{
  "id": "yt:video:Seu7V91vxAo",
  "yt:videoId": "Seu7V91vxAo",
  "yt:channelId": "UCweDKPSF65wRw5VHFUJYiow",
  "title": "The 'Biology' of Horizon Zero Dawn",
  "link": "",
  "author": {
    "name": "Curious Archive",
    "uri": "https://www.youtube.com/channel/UCweDKPSF65wRw5VHFUJYiow"
  },
  "published": "2022-06-03T19:13:09+00:00",
  "updated": "2022-09-02T17:09:21+00:00",
  "media:group": {
    "media:title": "The 'Biology' of Horizon Zero Dawn",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Ever wondered how the machines of Horizon: Zero Dawn function? Join us on our nature-documentary style deep-dive into an artificial ecosystem. (Part II: https://youtu.be/8d9_TA1hi9w)\n---\nCurious Archive Social Media:\nTwitter: https://twitter.com/Curious_Archive\nInstagram: https://www.instagram.com/CuriousArchive\n\nImagine an ecosystem made entirely of autonomous machines. Where every ecological niche is filled by an artificial organism. In the video game ‘Horizon: Zero Dawn’ and it’s sequel ‘Horizon: Forbbiden West’ a global calamity has led to a version of planet Earth inhabited by animal-mimicking machines — from mighty herbivores to deadly predators. While these synthetic creatures might not be ‘biological,’ their fascinating interactions, unique behavioral patterns, and hidden intricacies make them worthy of study.\n\nThe story takes place thousands of years in the future, but a little thing like the flow of time isn’t going to stop this archivist from doing his fieldwork. So, for this entry into the archive, I’ll lead us on another documentary style expedition, investigating the artificial ‘biology’ of these intriguing machines and revealing what animal roles they fill. We’ll need, though, to stay alert—there are constant dangers in this environment. \n\nNow, let’s leap forward in time, and discover an ecosystem of metal and wire...\n\n0:00 Machines of Horizon: Zero Dawn\n1:14 Strider\n3:45 Watcher\n5:20 Grazer\n6:53 Sawtooth\n8:28 Longleg\n9:43 Scrapper\n11:13 Shell-Walker\n12:56 Glinthawk\n14:54 Snapmaw\n16:24 Bellowback\n17:36 Behemoth\n19:04 Thunderjaw\n20:28 Tallneck\n22:00 The Next Horizon…\n\nCopyright Disclaimer: Under section 107 of the Copyright Act 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education, and research. All video/image content is edited under fair use rights for reasons of commentary.\n\nI do not own the images, music, or footage used in this video. All rights and credit goes to the original owners.\n\n♫ Music by Kevin MacLeod (incompetech.com): \nBeauty Flow, Firesong, Impact Lento, Majestic Hills, Bittersweet, Floating Cities\nLicensed under Creative Commons: By Attribution 3.0\n\n#CuriousArchive #Horizon #SpeculativeBiology",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}