{
  "title": "S15 Ep30: The Curse of the Bermuda Triangle with Josh Gates",
  "link": "https://audioboom.com/posts/8098493",
  "itunes:episode": 30,
  "itunes:title": "The Curse of the Bermuda Triangle with Josh Gates",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4668,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Darkness Radio & Josh Gates brace themselves for The Curse of the Bermuda Triangle!<br>\n<br>\nJosh Gates of Discovery Channel's hit series, Expedition Unknown returns from the abyss as we discuss The Curse of the Bermuda Triangle, his most recent journeys took him to one of the most mystical and unusual places on Earth. What did he uncover? Tune in to find out PLUS we discuss the new season of Expedition Unknown.<br>\n<br>\nExpedition Unknown with Josh Gates airs Wednesday Nights at 9/8pm ct on Discovery Channel and Discovery Channel Go!<br>\n<br>\nFor more information visit the site: <a href=\"https://go.discovery.com/tv-shows/expedition-unknown/\">https://go.discovery.com/tv-shows/expedition-unknown/</a><br>\n<br>\nVisit his site here: <a href=\"https://www.joshuagates.com/\">https://www.joshuagates.com/</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !<br>\n<br>\nWhite Castle Sliders have a unique, one-of-kind taste that’s totally crave worthy! They are the perfect home solution for lunches, snacks and dinners , eat them by yourself or eat them with family!  Pick up White Castle Sliders in freezer aisles nationwide!",
  "itunes:summary": "Darkness Radio & Josh Gates brace themselves for The Curse of the Bermuda Triangle!\n\nJosh Gates of Discovery Channel's hit series, Expedition Unknown returns from the abyss as we discuss The Curse of the Bermuda Triangle, his most...",
  "pubDate": "Sun, 12 Apr 2020 08:00:00 +0000",
  "guid": "cc521bc4-aeb9-494d-8295-bfc03fc7abbb",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}