{
  "title": "Brexit, Its Economic Impact, and International Disintegration with Thomas Sampson",
  "pubDate": "Fri, 06 Oct 2017 16:04:36 +0000",
  "guid": "ff7ad828d1243c77ff09c4702ed3ac04",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP66Sampson_EDR.mp3",
  "itunes:image": "",
  "description": "<p>My guest today is <a href=\"http://personal.lse.ac.uk/sampsont/\" target=\"_blank\" rel=\"noopener\">Thomas Sampson</a> of the London School of Economics.</p> <p>Our topic for today is the economic impact of Brexit. Long-time listeners will recall that I did <a href= \"http://economicsdetective.com/2016/06/brexit-european-union-european-economic-area-sam-bowman/\" target=\"_blank\" rel=\"noopener\">an interview with Sam Bowman on Brexit</a> immediately after the vote occurred. Think of this as a follow-up to that episode now that the dust has settled and we have a better idea of what Brexit is going to look like. Thomas has written multiple papers on the subject, including <a href= \"http://personal.lse.ac.uk/sampsont/BrexitDisintegration.pdf\" target=\"_blank\" rel=\"noopener\">Brexit: The Economics of International Disintegration</a>, which is forthcoming in the Journal of Economic Perspectives. Its abstract follows:</p> <blockquote>This paper reviews the literature on the likely economic consequences of Brexit and considers the lessons of the Brexit vote for the future of European and global integration. Brexit will make the United Kingdom poorer because it will lead to new barriers to trade and migration between the United Kingdom and the European Union. Plausible estimates put the costs to the United Kingdom at between 1 and 10 percent of income per capita. Other European Union countries will also suffer economically, but their estimated losses are much smaller. Support for Brexit came from a coalition of less-educated, older, less economically successful and more socially conservative voters. Why these voters rejected the European Union is poorly understood, but will play an important role in determining whether Brexit proves to be merely a diversion on the path to greater international integration or a sign that globalization has reached its limits.</blockquote> <p>Globalization and economic integration have been on more or less a constant rise since WWII, and Brexit is a rare reversal of this trend. Thomas argues that it is important to understand the causes of Brexit to see if this is just a temporary blip on the way to global economic integration or the start of a reversal of the post-WWII trend.</p> <hr /> <p> </p>",
  "content:encoded": "<p>My guest today is <a href=\"http://personal.lse.ac.uk/sampsont/\" target=\"_blank\" rel=\"noopener\">Thomas Sampson</a> of the London School of Economics.</p> <p>Our topic for today is the economic impact of Brexit. Long-time listeners will recall that I did <a href= \"http://economicsdetective.com/2016/06/brexit-european-union-european-economic-area-sam-bowman/\" target=\"_blank\" rel=\"noopener\">an interview with Sam Bowman on Brexit</a> immediately after the vote occurred. Think of this as a follow-up to that episode now that the dust has settled and we have a better idea of what Brexit is going to look like. Thomas has written multiple papers on the subject, including <a href= \"http://personal.lse.ac.uk/sampsont/BrexitDisintegration.pdf\" target=\"_blank\" rel=\"noopener\">Brexit: The Economics of International Disintegration</a>, which is forthcoming in the Journal of Economic Perspectives. Its abstract follows:</p> This paper reviews the literature on the likely economic consequences of Brexit and considers the lessons of the Brexit vote for the future of European and global integration. Brexit will make the United Kingdom poorer because it will lead to new barriers to trade and migration between the United Kingdom and the European Union. Plausible estimates put the costs to the United Kingdom at between 1 and 10 percent of income per capita. Other European Union countries will also suffer economically, but their estimated losses are much smaller. Support for Brexit came from a coalition of less-educated, older, less economically successful and more socially conservative voters. Why these voters rejected the European Union is poorly understood, but will play an important role in determining whether Brexit proves to be merely a diversion on the path to greater international integration or a sign that globalization has reached its limits. <p>Globalization and economic integration have been on more or less a constant rise since WWII, and Brexit is a rare reversal of this trend. Thomas argues that it is important to understand the causes of Brexit to see if this is just a temporary blip on the way to global economic integration or the start of a reversal of the post-WWII trend.</p>  <p> </p>",
  "enclosure": "",
  "itunes:duration": "50:42",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "My guest today is  of the London School of Economics. Our topic for today is the economic impact of Brexit. Long-time listeners will recall that I did  immediately after the vote occurred. Think of this as a follow-up to that episode now that the dust...",
  "itunes:episode": 66,
  "itunes:episodeType": "full"
}