{
  "guid": "urn:uuid:35b49f77-ccaf-4f96-83de-526fdf51af61",
  "link": "https://www.who.int/news/item/23-03-2022-eu-and-who-join-forces-to-improve-global-health-security-and-access-to-medical-products-and-health-technologies-in-africa",
  "a10:author": {
    "a10:name": ""
  },
  "title": "EU and WHO join forces to improve global  health security and access to medical products and health technologies in Africa",
  "description": "<p>On 23 March 2022, Jutta Urpilainen, European Commissioner for International Partnerships, and WHO Director-General Tedros Adhanom Ghebreyesus, met in Geneva to deliberate on the EU - WHO partnership in global health and the ongoing preparations for a global accord on pandemic prevention, preparedness and response. The two senior representatives of the partner organizations signed a letter of intent for a &euro; 24.5 million EU contribution to the World Health Organization, to support the local manufacturing of and access to vaccines, medicines and health technologies in Sub-Saharan Africa.<br /></p><p>Thanking Commissioner Urpilainen, Dr Tedros commented: &lsquo;&rsquo;One of the most obvious lessons of the pandemic is the urgent need to increase local production of vaccines, especially in low- and middle-income countries. WHO is grateful to the EU for this new project that will empower African countries and partners to ensure equitable access to safe, effective, quality-assured and affordable essential medicines and other health products for their populations.&rsquo;&rsquo;</p><p>The new initiative is designed to empower African countries and partners such as the African Union to further enable local manufacturing of medical products and health technologies by advancing regulatory convergence across the continent, supporting technology transfer and capacity building for local production, and improving the consolidation of the demand and strategic purchasing of such products.<em></em></p><p>Commissioner Urpilainen and Dr Tedros also noted the rich EU - WHO collaboration to help achieve Universal Health Coverage (UHC). Dr Tedros noted that &ldquo;WHO is grateful to the EU for its strong and lasting commitment to UHC. Together we provide critical support in 115 countries to ensure that all people, especially the most vulnerable, have access to quality, affordable health services when and where they need them&rsquo;&rsquo;. Under the 2019-2022 EU - WHO Partnership for health systems strengthening, the EU had already allocated US$ 168 million to WHO to assist countries in designing and implementing interventions to strengthen national health systems, tackle the threat of COVID-19 and promote an inclusive post-pandemic recovery.</p><p>During the meeting, the EU and WHO also reviewed the current efforts to improve the global health architecture with a strong WHO at its centre, including through the preparation for a global accord on pandemic prevention, preparedness and response. Welcoming the key role of the EU in promoting this initiative, Dr Tedros shared that these discussions represented a once-in-a-generation opportunity to strengthen the global health architecture to protect and promote the well-being of all people.</p><p>WHO has a longstanding, strategic partnership with the EU, as they work together to support countries in building systems for resilient, sustainable and inclusive development through the promotion of health and wellbeing, strengthening of health systems and preparedness and response to health emergencies. In 2020 - 2021, the EU consolidated its position as the 5th largest WHO contributor with US$ 466 million, confirming its leading role in global health.</p><p>Read more about the&nbsp;<a href=\"https://who.int/about/funding/contributors/european-union\">strategic partnership between the EU and WHO</a></p>",
  "pubDate": "Thu, 24 Mar 2022 08:18:17 Z"
}