{
  "title": "Unsolved Mysteries Ep 6: Missing Witness",
  "link": "https://audioboom.com/posts/7728428",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 2985,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>At 17 years old, Lena Chapin made a startling confession, and the whole thing was captured on tape. 4 years earlier, she’d helped her mother, Sandra Klemp dispose of a body. It was the body of Sandra’s husband, whom Sandara had killed in cold blood earlier that day. Three years later , Lena was set to testify against her mother in court—she was going to tell everything she knew. But then Lena vanished. And nobody has seen her since. Now, Lena’s sisters are on the hunt for her. They’re convinced that their mother killed her. But can they prove it? <br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n<div><a href=\"https://audioboom.com/posts/7703675-death-at-the-mansion-rebecca-zahau-part-1/edit\">Update Description</a></div>\n<div>\n<br>\n<strong>YOU GUYS WE LAUNCHED A NEW PODCAST!!</strong> Each week on <a href=\"https://www.centuriespod.com/\">\"Crimes of the Centuries\"</a> host Amber Hunt (of the Accused podcast) takes us on a deep investigative dive into a crime that was huge when it happened, but has been lost to time--and one you've likely never heard of. Episodes 1 & 2 are available right now! <a href=\"https://www.centuriespod.com/post/episode-1-mary-phagan\">Episode tells the story of the 1913 murder of 13-year-old Mary Phagan</a> which resulted in one of the country's first high-profile murder trials. <a href=\"https://www.centuriespod.com/post/episode-2-leopold-loeb\">Episode 2 tells the story of the Jazz Age killers Leopold & Loeb</a>, who murdered a boy just to prove they could get away with it. <strong>Find \"Crimes of the Centuries\" wherever you get your podcasts. </strong>\n</div>\n",
  "pubDate": "Thu, 12 Nov 2020 11:05:00 +0000",
  "guid": "tag:audioboom.com,2020-11-12:/posts/7728428",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}