{
  "title": "Victoria Pham: TERRA",
  "itunes:author": "Liquid Architecture",
  "itunes:subtitle": "",
  "itunes:summary": "TERRA: Memory & Soil is a collaboration between Victoria Pham and Joel Spring that transforms West Space gallery into an immersive garden by  combining sound, biological-sculpture, architecture and projection. The project interrogates how we remember our past landscapes, bringing vastly different insights into notions of the built environment, history and legacies of colonialism.\n\nArcheologist and composer Victoria Pham talks through the elements that make up TERRA; the practice of archeo-acoustics; and the mission of placing indigenous knowledge at the centre of knowledge production, cultural exchange and story-telling. \n\nVictoria Pham is an Australian installation artist, composer, archaeologist and evolutionary biologist. She is a current PhD candidate for Biological Anthropology at the University of Cambridge where she seeks to expand her interdisciplinary work into a broader exploration of acoustic perception as a basis into modes of bio-acoustic material development and construction. Her artistic and musical work is driven by explorations into the sonic connections between second-hand memory, examining modes of decolonisation, communal story-telling, intertwining electronic sound with acoustic instrumentation, and ecological expressions of construction\n\nhttps://liquidarchitecture.org.au/events/victoria-pham-and-joel-spring-terra\n\nhttps://liquidarchitecture.org.au/events/mono-poly-terra-october\n\nTERRA: Mono-Poly-October\n13 October 2022\nWest Space and Collingwood Yards\nPresented by Liquid Architecture, West Space and Create Yarra\n\nProduced by Mara Schwerdtfeger. \n\nFinancial support from patrons at any level has a resounding impact on our work. You can support Liquid Architecture’s weekly podcast and our online journal Disclaimer, for new thinking and writing on listening and sound through a Patreon subscription, for as little as $5 a month. \n\nhttps://www.patreon.com/liquidarchitecture\n\nFor the past 20 years, Liquid Architecture has been Australia’s leading organisation for artists working with sound and listening. LA investigates the sounds themselves, but also the ideas communicated about, and the meaning of, sound and listening.\n\nhttps://liquidarchitecture.org.au/",
  "itunes:image": "",
  "enclosure": "",
  "guid": "https://liquidarchitecture.org.au/podcast/victoria-pham-terra",
  "pubDate": "Tue, 11 Oct 2022 08:00:00 +1100",
  "itunes:duration": "32:00",
  "itunes:explicit": "no"
}