{
  "id": "tag:blogger.com,1999:blog-1747027701196237068.post-3344646692355378963",
  "published": "2022-01-12T10:00:00.001-05:00",
  "updated": "2022-01-12T10:00:55.528-05:00",
  "title": "Canadian Tennis Star Leylah Fernandez joins #TeamPixel",
  "content": "<div style=\"text-align: center;\"><div><span style=\"white-space: pre-wrap;\">U.S. Open finalist will be the face of Pixel 6 for French-speaking Canada</span></div></div><div style=\"text-align: center;\"><span><span face=\"&quot;Google Sans&quot;, sans-serif\" style=\"font-size: 11pt; font-variant-east-asian: normal; font-variant-numeric: normal; vertical-align: baseline; white-space: pre-wrap;\"><br /></span></span></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><iframe allowfullscreen='allowfullscreen' webkitallowfullscreen='webkitallowfullscreen' mozallowfullscreen='mozallowfullscreen' width='436' height='362' src='https://www.blogger.com/video.g?token=AD6v5dwyTcZ3uYT4UAG0FkKECdFV4yt24MXhUVoQEMsWxPpgsNElRo-AOTgdOW3a8xtvJ40r8CnpF3fCSdV4BCQ1Lw' class='b-hbp-video b-uploaded' frameborder='0'></iframe></div><div><br /></div><div><br /></div><div>Google Canada is thrilled to announce that Canadian Tennis player and Grand Slam finalist Leylah Fernandez has been named the latest Canadian ambassador for <a href=\"https://store.google.com/ca/category/phones?e=EnableSynchronyFinancing&amp;hl=en-GB\" rel=\"nofollow\" target=\"_blank\">the Pixel 6 and Pixel 6 Pro</a>.&nbsp;</div><div><br /></div><div>Fernandez, currently the top-ranked Canadian in the Women’s Tennis Association (WTA), rose to international recognition after appearing in the final of the 2021 U.S. Open. This led her to being our <a href=\"https://trends.google.com/trends/yis/2021/CA/\" rel=\"nofollow\" target=\"_blank\">top-trending Canadian athlete</a> in the country last year. Now the Montreal native will be featured in a new national English and French-speaking ad campaign, which she unveiled <a href=\"https://www.instagram.com/p/CYohaarj5ez/\" rel=\"nofollow\" target=\"_blank\">on her Instagram account today</a>.  The ad features Fernandez utilizing the capabilities of the Pixel’s Live Translate feature, a perfect fit for the WTA pro, who is already fluent in English, French and Spanish. In addition to the ad campaign, Leylah will also be sharing her journey with her Pixel 6 on her social media channels.&nbsp;</div><div><br /></div><div>“I travel a lot throughout the season, so I need a phone that’s going to help me manage my busy schedule and have fun at the same time.” says Fernandez. “After using the Pixel 6 Pro for a couple months, I’m thrilled about how easily it fits into my lifestyle and I can’t wait to show other Canadians what it can do.”&nbsp;</div><div><br /></div><div>After making her professional debut in 2019, Fernandez had her breakout year in 2021, with her first tour win at the Monterrey Open and her aforementioned appearance in the U.S. Open. Just weeks ago, she was named the Canadian Press’ Female Athlete of the Year. Days away from competing in this year’s Australian Open, Fernandez will be able to document her season with the Pixel 6 Pro, taking advantage of our most ‘Google’ phone yet, both inside and out.&nbsp;</div><div><br /></div><div>“After her incredible year on the women’s tennis circuit, and how she won the hearts of the Canadians with her grit and grace, it was an easy decision to partner Leylah as a spokesperson for the Pixel 6,” says Laura Pearce, Head of Marketing, Google Canada. \"The Pixel provides all the helpfulness of Google for consumers to see, experience and do more - and that's exactly what we expect Leylah to do as she takes the tennis world by storm.”&nbsp;</div><div><br /></div><div>The Pixel 6 and Pixel 6 Pro feature Google’s first System on a Chip (SoC), <a href=\"https://blog.google/products/pixel/introducing-google-tensor/\" rel=\"nofollow\" target=\"_blank\">Google Tensor</a>, which unlocks the full potential of the phone’s camera system, Android user interface and AI that Google is known for. Google Tensor allows the Pixel 6 to adapt to each individual user to provide a bespoke experience that, at its heart, performs fast and reliably in everyday use. Featuring a best-in-class camera with new experiences like low-light video and Magic Eraser, Pixel 6 allows users to share special moments exactly how they remember them. Inclusive features like Live Translate combine Pixel’s  speech recognition with Google’s translation capabilities to help users to communicate in languages other than their own across a number of applications1.&nbsp;</div><div><br /></div><div>&nbsp;Leylah Fernandez’ English Pixel 6 ad spot is now live online with the French version of the ad spot going live when the Australian Open gets underway on January 17. The Google Pixel 6 and Pixel 6 Pro are now available on <a href=\"https://store.google.com/ca/product/pixel_6?gclid=Cj0KCQjw5oiMBhDtARIsAJi0qk1sfLPZTvkoGN8csgY3hAjYu8iIMxQ7k320t54T2DFBg2MvwKVGV5YaAj8VEALw_wcB&amp;gclsrc=aw.ds&amp;hl=en-GB\" rel=\"nofollow\" target=\"_blank\">the Google Store</a>. <br /><br /><span class=\"post-author\">Posted by Google Canada&nbsp;</span></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Aaron Brindle",
    "uri": "http://www.blogger.com/profile/13885417405401273013",
    "email": "noreply@blogger.com",
    "gd:image": ""
  }
}