{
  "title": "TU105: Narcissism &#8211; What is Going on Under the Defense with Sue Marriott and Ann Kelley",
  "link": "https://therapistuncensored.com/episodes/tu105-narcissism-what-is-going-on-under-the-defense-with-sue-marriott-and-ann-kelley/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu105-narcissism-what-is-going-on-under-the-defense-with-sue-marriott-and-ann-kelley",
  "pubDate": "Thu, 03 Oct 2019 13:55:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=7551",
  "description": "Hey everybody, we are BACK and ready to take off on Season 4!!! Wahoo!\n\nNarcissism – This time we focus on how it’s created and what is going on behind the narcissists defenses. Later we will address Malignant Narcissism, which is in a class all to itself! It deserves an entire episode, but for today we will look at what causes it, healthy and pathological degrees of it and what is really going on under the hood of the person afflicted with narcissism.\n\nWe really heard the requests wanting to hear more about some of the diagnostic pieces of attachment, trauma and the relational sciences. Specifically, narcissism and borderline personality disorder are of great interest to many of you.  We put our heads together about how to best do this in a way that honors those who are struggling with these issues and those in relationship with them. To do this, we are going to weave conversations about narcissism and borderline personality disorder throughout the season. It may be snippets in a podcast about something else, or entire episodes focused on these concerns.\n\nToday, we’re going to get started on narcissism.\n\nGreek version of the myth:\n\nNarcissus, was the son of River God Cephisus and nymph Lyriope. He was known for his beauty and he was loved by God Apollo due to his extraordinary physique.\n\nNarcissus was once walking by a lake or river and decided to drink some water; he saw his reflection in the water and was surprised by the beauty he saw; he became entranced by the reflection of himself. He could not obtain the object of his desire though, and he died at the banks of the river or lake from his sorrow.\n\nAccording to the myth Narcissus is still admiring himself in the Underworld, looking at the waters of the Styx.\nHealthy Narcissism (!?)\nWe all have some element of Narcissism and if we don’t, we get run over in life. We don’t want to be a doormat but we also don’t want to be on a High Horse above it all. We all have narcissism, it’s healthy entitlement.\n\nFunctional narcissism is about your sense of Self, healthy entitlement and being inside yourself, and really rolling with who you are as a person. It’s being confident instead of being overly in-tune to others opinion of you.\nProblematic Narcissism\nIf it’s a character trait rather than a moment in time, it’s all about defense. This defense protects the smallness and inadequacy and shame at it’s core, and to compensate, grandiosity is born. That or the opposite, which we will discuss, but if I attack the hell out of myself then I protect myself from you having less than positive feelings about me because I beat you to it.\n\nBasically, it’s about deriving self-esteem from outside affirmation in order to maintain internal validity.\n\nNarcissism is an injury to the Self, where we’ve had to give ourselves up in service of the other or blow ouselves up to feel “enough”.\n\nIt is associated with the avoidant/dissmissing attachment category, or the blue side of the attachment spectrum.\nNarcissistic Tendencies Versus a Disorder (from a Psychologist’s Perspective)\nIt’s only in the much higher degree and more rigid degree of the trait that we would call it disordered or problematic. This is NOT a judgment. We mean it’s problematic for the person who suffers from it and that it infiltrates most every relationship to a point that it significantly impairs daily functioning or social relationships. Not that a person with true Narcissistic personality disorder would notice this distress, because everyone around them are “stupid” or “the best.” You can imagine stupid one’s are differentiated from them and the best one’s reflect their version of themselves.\nNarcissistic Injury:\nExample: The blue side – (avoidance/dismissive attachment) is a defense, whether we live there or whether we travel there. When we feel very deeply vulnerable but can’t tolerate that experience, we pull into what we call a narcissistic defense to avoid an injury.",
  "enclosure": "",
  "itunes:subtitle": "Hey everybody, we are BACK and ready to take off on Season 4!!! Wahoo! - Narcissism – This time we focus on how it’s created and what is going on behind the narcissists defenses. Later we will address Malignant Narcissism,",
  "itunes:summary": "This season we will be unpacking both narcissism and borderline personality disorder over time.  Today we delve into the range of the issue, the types and compassionately look at what is going on inside the person who needs this defense.  Hint: it&apos;s about their need to develop a false self.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "44:39"
}