{
  "title": "Even without internet at home, students can keep learning",
  "link": "https://blog.google/outreach-initiatives/education/offline-access-covid19/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>If your school is operating virtually as a result of COVID-19, you may be wondering how to continue teaching students who don’t have access to the internet at home, or who only have low-bandwidth access. Fortunately, there are many ways to keep Chromebooks and G Suite up and running even when online access is slow or unavailable. We’ve pulled together ideas for educators and school IT teams who want to encourage all students to keep learning, regardless of their online access. </p><h3>For edtech and IT teams: The basics of enabling offline access</h3><p>Using Chromebooks and G Suite without Wi-Fi or low connectivity is relatively easy, but you may want to enlist your EdTech and IT teams to <a href=\"https://support.google.com/a/answer/7684186?hl=en\">set up offline access for everyone</a>. Here are the key steps in the process, along with useful Google support links. </p><p>Keep in mind that people need to go through this process while they still have online access. Consider taking a few minutes to guide students and staff through the process while they’re on school Wi-Fi networks.</p><p>Step 1: To help students, teachers and staff work in G Suite offline, the first step is to enable offline access for all users. Your IT or EdTech team can do this from G Suite’s admin console using <a href=\"https://support.google.com/a/answer/1642623?hl=en\">these instructions</a> for managed devices; in the Features and Applications section of the Admin console, administrators can click “Allow users to enable offline access.” </p><p>Step 2: G Suite users also need to download the <a href=\"https://chrome.google.com/webstore/detail/google-docs-offline/ghbmnnjooekpmoecnnnilnnbdlolhkhi\">Google Docs Offline extension</a> for Chrome Browser, which will allow them to use Google Docs, Sheets, Drive and Slides without online access. </p><p>Step 3: Finally, people should turn on offline access for the G Suite applications they’d like to use before they go offline. Share <a href=\"https://support.google.com/drive/answer/2375012\">these instructions</a> for opening G Suite files offline. It’s a good idea to ask students to test that offline access is working properly; help them turn off Wi-Fi access and try to access a G Suite file. Students can download notes from Slides, Docs, and more, and download the lectures from Classroom and Drive to watch later if they do not have internet at home.</p><h3>For teachers: Things to do offline</h3><p>Remind students that even if they don’t have Wi-Fi access away from school, there’s a lot that they can <a href=\"https://support.google.com/chromebook/answer/3214688?hl=en\">do with their Chromebooks</a>:</p><ul><li><p>Read and respond to emails. Once the IT administrator <a href=\"https://support.google.com/a/answer/7684186?hl=en\">enables offline access</a>, they can read and write emails. The emails are sent as soon as students get back online. </p></li><li><p>Take, view and <a href=\"https://support.google.com/chromebook/answer/1751068\">edit photos and videos</a>. </p></li><li><p>Take notes in the <a href=\"https://support.google.com/chromebook/answer/3214688?hl=en\">Google Keep app</a>. </p></li><li><p>Work on <a href=\"https://support.google.com/docs/answer/6388102\">Google Docs, Sheets, and Drive</a> files. </p></li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>For edtech and IT teams: Chrome extensions that work offline</h3><p>Encourage students to use Chrome extensions that help them do classwork while offline—and ask your edtech or IT team to <a href=\"https://support.google.com/chrome/a/answer/6306504?hl=en\">push out the extensions</a> to all G Suite and Chromebook users. Search the<a href=\"https://chromebookapphub.withgoogle.com/ideas\">Chromebook App Hub</a> or the <a href=\"https://chrome.google.com/webstore/category/extensions\">Chrome Web Store</a> using the “runs offline” option to find useful extensions, or start with <a href=\"https://chromebookapphub.withgoogle.com/apps/screencastify\">Screencastify</a> for recording and editing videos and <a href=\"https://chromebookapphub.withgoogle.com/apps/soundtrap-for-education\">Soundtrap</a> for recording and saving audio files. </p><h3>Tips from teachers</h3><p>Teachers are already brainstorming creative ways to help students without home online access continue their studies:</p><p><b>Create a “file upload” feature in Google Forms:</b>Eric Lawson, director of technology at Maine’s York School Department, shared that you can create a Google Form directly from Google Classroom. One of the question options in Google Forms is to create a “file upload.” This allows for students to work on podcasts, videos, journals, infographics, etc. and simply submit them to their teacher through a form. On a day where students may not have internet access, they can still work on their project offline on their Chromebooks at home and then submit the file when they have access.</p><p><b>Offer mobile hotspot access:</b>At Grain Valley Schools in Missouri, Kyle Pace, director of technology, plans to remind students that they can check out mobile hotspot devices from the school’s libraries—just as they’d check out books.</p><p>If you use Google Classroom and want to make sure students can view assignments offline, follow this <a href=\"https://www.youtube.com/watch?v=48NnlPf-rog\">YouTube tutorial</a> from Stewart Lee, technology integration coordinator with Anderson School District 3 in South Carolina.<br/></p></div></div></body></html>",
  "pubDate": "Fri, 13 Mar 2020 19:30:00 +0000",
  "guid": "https://blog.google/outreach-initiatives/education/offline-access-covid19/",
  "category": [
    "Chromebooks",
    "COVID-19",
    "Docs",
    "Education",
    "Google Workspace",
    "Classroom"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Even without internet at home, students can keep learning",
    "description": "Many Google for Education tools are available offline, and students can keep learning at home, even without internet.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/030-BET-2020-Blog-Header-Chrome-OS-TB_1_1_9k.max-600x600.png",
    "site_name": "Google",
    "url": "https://blog.google/outreach-initiatives/education/offline-access-covid19/"
  },
  "author": {
    "name": "Jeff Kurtz",
    "title": "Solutions Engineer, Google for Education",
    "department": "",
    "company": ""
  }
}