{
  "title": "#481: The Deep Similarities Between Harry and Neville",
  "link": "https://audioboom.com/posts/7676631",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4638,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>We take a deep dive into Harry and Neville’s parallel journeys throughout the Harry Potter series</li>\n<li>Muggle Mail covers how you correct someone who is wrong about Harry Potter, Snape fan fiction and more</li>\n<li>The Chronicles of Narnia, Lord of the Rings and King Arthur: the hosts share some of their favorite stories influenced by cultural artifacts</li>\n<li>Let's get religious (not really)! We compare Harry to Jesus and Neville to John The Baptist</li>\n<li>Linked from the start via prophecy, did anyone suspect pre-Order of the Phoenix that Neville would prove to play such a significant role?</li>\n<li>The hosts share their Favorite Neville Moments from the Harry Potter Series</li>\n<li>A book-by-book analysis of Harry and Neville's journeys</li>\n<li>Were Harry and Neville's upbringing really all that dissimilar?</li>\n<li>We discuss Harry and Neville both being orphaned and having their parents taken from them by Voldemort and the Death Eaters</li>\n<li>Harry and Neville both kill a giant snake... with the Sword of Gryffindor... pulled from The Sorting Hat!</li>\n<li>Snape has quite the penchant for picking on Harry... and Neville! Does he partially blame Neville for what befell his beloved Lily Potter?</li>\n<li>Dumbledore's Army, The Department of Mysteries and the Evolution of Neville Longbottom</li>\n<li>Neville, much like John The Baptist, is the leader of the resistance within Hogwarts in Deathly Hallows</li>\n<li>Neville's confrontation with Voldemort</li>\n<li>Quizzitch: When exactly does Neville say he will join Voldemort?</li>\n<li>You can join our community at <a href=\"http://www.patreon.com/mugglecast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast! This week, we discuss an update on Fantastic Beasts 3 filming!</li>\n<li>This week's episode is brought to you by ThirdLove (find your perfect fitting bra by going to <a href=\"http://www.thirdlove.com/mugglecast\">Thirdlove.com/mugglecast</a>, and get 15% off your first order), HelloFresh (Visit <a href=\"http://HelloFresh.com/mugglecast80\">HelloFresh.com/mugglecast80</a> and get your first 8 meals free) and BetterHelp (visit <a href=\"http://betterhelp.com/mugglecast\">BetterHelp.com/mugglecast</a> and get 10% off).</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 08 Sep 2020 11:00:00 +0000",
  "guid": "tag:audioboom.com,2020-09-07:/posts/7676631",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}