{
  "id": "yt:video:CTNQA76_Qro",
  "yt:videoId": "CTNQA76_Qro",
  "yt:channelId": "UCKy1dAqELo0zrOtPkf0eTMw",
  "title": "How God of War's Devs Rebuilt the Blades of Chaos - Art of the Level",
  "link": "",
  "author": {
    "name": "IGN",
    "uri": "https://www.youtube.com/channel/UCKy1dAqELo0zrOtPkf0eTMw"
  },
  "published": "2022-11-05T14:15:00+00:00",
  "updated": "2022-11-05T14:15:01+00:00",
  "media:group": {
    "media:title": "How God of War's Devs Rebuilt the Blades of Chaos - Art of the Level",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Kratos’ journey into the mysteries of a new Norse world in 2018’s God of War takes both him and players to fantastical realms, pits us against mythical beasts, and introduces an epic cast. But at the heart of it all is Kratos’ relationship to his son Atreus. Learning what kind of father he should be in contrast to the person he was, and what kind of man he wants to raise Atreus to be, echoes in every step of his journey.\n\nSo it’s no surprise that one of Kratos’ most challenging moments comes when Atreus grows sick, and the only answer to his salvation lies in Helheim, where no known fire in the nine realms will burn. Kratos, of course, knows of a fire from another realm he can draw from, and in one incredible sequence we see him dig up the ghost of Sparta as he reclaims the Blades of Chaos to save his son. It is a difficult choice, to revisit the past he has clearly worked so hard to leave behind him. But at the same time, it demonstrates that Kratos will do anything to save Atreus.\n\nThat harrowing moment weighs on Kratos, and the team at Sony Santa Monica lets that weight rest on the player too before he ultimately retrieves the Blades and confronts everything they represent. To find out more, IGN spoke to members of the development team about how Santa Monica brought this moment to life, and how it revived the Blades for Kratos’ newest adventure. This is Art of the Level.\n\n#GodOfWar #BladesOfChaos #ArtOfTheLevel\n\nThis video was originally published on IGN Games on Aug 15, 2022.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}