{
  "title": "Switzerland Moves Ahead With Underground Autonomous Cargo Delivery",
  "link": "https://spectrum.ieee.org/cargo-sous-terrain",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-concept-image-showing-cargo-pods-traveling-through-a-tunnel-with-a-map-of-switzerland-showing-routes-in-the-background.jpg?id=30070109&width=1200&height=800&coordinates=0%2C8%2C0%2C8\"/><br/><br/><p>\n\tIn 2016, we wrote about <a href=\"https://www.cst.ch/en/\" rel=\"noopener noreferrer\" target=\"_blank\">Cargo Sous Terrain</a>, a (then) US <a href=\"https://spectrum.ieee.org/swiss-considering-34-billion-cargo-tunnel-for-automated-delivery-trucks\" target=\"_self\">$3.4 billion concept for underground cargo tubes full of automated delivery carts whisking goods between cities and logistics centers across Switzerland at 30 kilometers per hour</a>. The idea behind CST is to provide for long-term freight transport without relying on expansion of road and rail networks, which are already stuffed with both freight and passengers and don’t have much room to grow.\n</p><p>\n\tLike so many concepts of this kind, six years ago it seemed like it was highly unlikely to ever happen. However, this past December, the <a href=\"https://www.parlament.ch/de/services/news/Seiten/2021/20211130101446964194158159038_bsd062.aspx\" rel=\"noopener noreferrer\" target=\"_blank\">Swiss parliament passed the necessary legal framework to enable underground freight transportation</a>, meaning that the CST project can commence on August 1st.\n</p><hr/><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"dc01b49f0f385a00ccd86251c2a2014e\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/htTo-_5X8gA?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n</p><blockquote>\n\tCargo sous terrain follows a similar principle to that of an automatic conveyor system. Automated, driverless transport vehicles which are able to pick up and deposit loads automatically from the designated ramps and lifts travel around the clock in the tunnels.<br/>\n<br/>\nThe vehicles, which travel on wheels and have an electric drive with induction rails, operate in three-track tunnels with a constant speed of around 30 kilometers per hour. The goods are transported on pallets or in modified containers. Thanks to refrigeration-compatible transport vehicles, the transport of fresh and chilled goods is also possible. Attached to the roof of the tunnel is a rapid overhead track for smaller goods packages.\n\t<br/>\n<br/>\nIt will for the first time be economically viable to transport small volumes on individual pallets or containers on an ongoing basis. The continuous flow of small-component goods obviates the need for waiting times at transfer stations. In addition, the space requirement can be massively reduced because temporary goods storage is no longer necessary.\n\t</blockquote><p>\n\tFreight honestly seems like a much better use of small-scale underground transportation systems than passenger services, which have been the focus of a lot of recent speculation. Freight tunnels can be smaller and can operate at slower speeds than would be demanded by passengers, and since the entire system is autonomous, comfort (and to some extent safety) can be less of a focus.\n</p><p>\n\tThe cost (to be covered entirely by the private sector) has increased from the initial 2016 estimate of $3.5 billion—CST is now estimated to cost between $30 and $35 billion for the full 500-kilometer network, although about $3 billion should be sufficient for the first phase, a 70-km section with 10 hubs that connects Zurich with a logistics center in Härkingen-Niederbipp to the west. The Swiss seem mostly unfazed by the scale of the project, and still consider it to be a good long-term investment. CST has partnered with a bunch of large Swiss logistics companies and retailers who see this solution as a complement to existing road and rail infrastructure. The entire project will run on renewable energy, and CST expects the amount of heavy trucks on roads to be reduced by up to 40 percent as its underground vehicles take over transport.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A concept image showing a tunnel full of autonomous cargo pods\" class=\"rm-shortcode\" data-rm-shortcode-id=\"22bc250e1a8ff6a0b3b15010641b18e9\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"0789f\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-concept-image-showing-a-tunnel-full-of-autonomous-cargo-pods.jpg?id=30070111&width=980\"/>\n</p><p>With tangible planning measures soon to be underway for the initial line, other Swiss cantons are taking note. To the east of Zurich, <a href=\"https://en.wikipedia.org/wiki/St._Gallen\" target=\"_blank\">St. Gallen</a> and <a href=\"https://en.wikipedia.org/wiki/Thurgau\" target=\"_blank\">Thurgau</a> are suggesting that an underground CST connection is “<a href=\"https://www.sg.ch/news/sgch_allgemein/2022/04/unterirdischer-guetertransport-nach-st-gallen-ist-machbar.html\" rel=\"noopener noreferrer\" target=\"_blank\">technically and economically realistic</a>” and have begun determining possible hub locations. All of this is a far cry from actually digging a hole and running autonomous cargo pods through it, but it’s a lot closer to reality now than it was in 2016.</p>",
  "pubDate": "Fri, 08 Jul 2022 18:36:38 +0000",
  "guid": "https://spectrum.ieee.org/cargo-sous-terrain",
  "category": [
    "Logistics",
    "Switzerland",
    "Cargo drones"
  ],
  "dc:creator": "Evan Ackerman",
  "media:content": ""
}