{
  "title": "S1E32 - The Secret to Dominance with World Champion High Diver Gary Hunt",
  "guid": "https://pinecast.com/guid/b8f8d8e3-c744-428b-ae5c-fe42308da5d2",
  "pubDate": "Tue, 02 Feb 2021 07:30:00 -0000",
  "itunes:duration": "00:50:43",
  "description": "<p>Today you will be treated to an ‘extreme’ episode as World Champion High Diver, Gary Hunt, joins Laura for an absolutely fascinating conversation. A legend in the high diving world, Gary is actually a 2-time World Champion and an 8-time winner of the Red Bull Cliff Diving World Series. Before he took on the daredevil world of high diving, Gary competed in 10-meter platform diving, and, in fact, took home a Bronze in the 10-meter Synchro at the 2006 Commonwealth Games. If you have ever wondered what it takes to have the courage and skill to dive off of cliffs and castles, and even out of helicopters, and still continue to set even loftier goals for yourself, you’ve come to the right place.\n \nIn this conversation, Gary tells his story all the way from first getting into diving all the way to what he is doing now and what his lofty and inspiring new goal is. In the process, he shares his favorite places to dive, his craziest and most memorable dives, the dangers he and his colleagues face, and the mental preparation that allows him to do what he does so well so consistently. Finding coaching in a relatively new sport, maintaining focus, his exciting new goal, and the impact that COVID has had upon him, his sport and his training are all discussed as well. Gary’s calm, thoughtful and humble nature shines through in this episode as he shares his vast amount of experience and insight into a sport which would seem unthinkably perilous to so many of us. Combine all of these qualities with his penchant for setting new goals and pursuing passion projects, and you will undoubtedly agree with Laura’s assessment of Gary Hunt as truly ‘an inspiration’, certainly one well worth listening to here today.</p>\n<p>Episode Highlights:\n \n·   How Gary found his way to diving\n·   Transitioning from platform to high diving\n·   His favorite places to dive\n·   Gary’s craziest high diving story\n·   The potential dangers in high diving\n·   The process involved in introducing a new dive\n·   The worst lead up he has to do\n·   Gary’s mental preparation\n·   The Red Bull World Series\n·   How he’s navigated coaching\n·   His favorite moment in diving\n·   His perfect score dive\n·   Preparing for dives\n·   Using juggling to remain focused\n·   Gary’s new goal\n·   How COVID has impacted him</p>\n<p>Quotes:\n \n“I started noticing the divers in the other side of the pool looking like they were having much more fun than I was.”\n \n“It was like a new door was being opened before me with so many possibilities.”\n \n“Sometimes when it’s really windy, you just want it to be over.”\n \n“The training is often much more scary than the actual competitions.”\n \n“I couldn’t remember anything about after the dive.”\n \n“You have to expect that it’s not always going to go your way.”\n \n“There are horror stories of people being swept away.”\n \n“We feel like we’re in safe hands.”\n \n“In the times where it hasn’t gone well, I think I’ve learned from it.”\n \n“I was the first of a wave of new high divers that were really going to push the boat out.”\n \n“I entered the sport at the right time.”\n \n“I think diving from a helicopter is one of my highlights.”\n \n“Usually, I will do one of each dive before the competition when we get to a new location.”\n \n“This dream of competing on 10-meter again just started to get more and more interesting.”\n \n“I prefer looking ahead and just focusing on my training.”\n \n“As long as your head’s into it and you’re focused, you can do it.”\n \n“You are an inspiration…giving yourself new passion projects…new goals.”</p>\n<p>Links:\nThe Pursuit of Gold homepage:<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">   http://thepursuitofgold.com/</a> \n5 Smart Strategies to Confidence:<a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">   https://www.laurawilkinson.com/learn </a>\nLaura’s Social Media:\nInstagram:<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">   https://www.instagram.com/lala_the_diver</a>  \nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">  https://www.facebook.com/TheLauraWilkinson</a> \n \nLearn more about Gary:\n<a href=\"https://www.instagram.com/garydiver/\" rel=\"nofollow\">https://www.instagram.com/garydiver/</a></p>",
  "itunes:title": "The Secret to Dominance with World Champion High Diver Gary Hunt",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 32
}