{
  "title": "Valuable Lessons from My Fourth Year of Freedom",
  "link": "https://www.madfientist.com/fourth-year-of-freedom/",
  "comments": "https://www.madfientist.com/fourth-year-of-freedom/#comments",
  "dc:creator": "The Mad Fientist",
  "pubDate": "Fri, 07 Aug 2020 09:58:00 +0000",
  "category": [
    "FIRE (Financial Independence / Retire Early)",
    "Interviews"
  ],
  "guid": "http://www.madfientist.com/?p=6800",
  "description": "<p class=\"lead\">It's been 4 years since I left my job and what a crazy year it's been!  Here's what I learned from the last year of post-FI life (and the COVID crisis)</p>\n<p class=\"more-link-p\"><a class=\"btn btn-danger\" href=\"https://www.madfientist.com/fourth-year-of-freedom/\">Read more &#8594;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/fourth-year-of-freedom/\">Valuable Lessons from My Fourth Year of Freedom</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "content:encoded": "\n<p>It&#8217;s been four years since <a href=\"https://www.madfientist.com/time-has-finally-come/\" target=\"_blank\" rel=\"noopener\">I left my full-time job</a> and what a crazy year it&#8217;s been!</p>\n\n\n\n<p>To celebrate this anniversary and to recap the things I&#8217;ve learned during this last year of post-FI life (and the COVID market crash), I recorded a short podcast episode:</p>\n\n\n<h2>Listen Now</h2><div style='padding:20px'><audio class=\"wp-audio-shortcode\" id=\"audio-6800-9\" preload=\"none\" style=\"width: 100%;\" controls=\"controls\"><source type=\"audio/mpeg\" src=\"http://traffic.libsyn.com/madfientist/fourth-year-of-freedom.mp3?_=9\" /><a href=\"http://traffic.libsyn.com/madfientist/fourth-year-of-freedom.mp3\">http://traffic.libsyn.com/madfientist/fourth-year-of-freedom.mp3</a></audio></div><ul><li>Listen on <a href='https://open.spotify.com/show/5AjnvxZb6ZScoI6KCV0hxo' target='_blank'>Spotify</a> or <a href='https://www.madfientist.com/go/itunes/' target='_blank'>Apple Podcasts</a></li><li>Download MP3 by right-clicking <a href='http://traffic.libsyn.com/madfientist/fourth-year-of-freedom.mp3' target='_blank' rel='nofollow'>here</a></li></ul>\n\n\n\n<p>I released similar posts for my <a href=\"https://www.madfientist.com/first-year-of-freedom/\" target=\"_blank\" rel=\"noopener\">first</a><a href=\"https://www.madfientist.com/first-year-of-freedom/\"> year of freedom</a>, <a href=\"https://www.madfientist.com/second-year-of-freedom/\">second year </a><a href=\"https://www.madfientist.com/second-year-of-freedom/\" target=\"_blank\" rel=\"noopener\">of</a><a href=\"https://www.madfientist.com/second-year-of-freedom/\"> freedom</a>, and <a aria-label=\"undefined (opens in a new tab)\" href=\"https://www.madfientist.com/third-year-of-freedom/\" target=\"_blank\" rel=\"noopener\">third year of freedom</a> so if you haven&#8217;t read or listened to those yet, you may want to check them out first.</p>\n\n\n\n<h2>Highlights</h2>\n\n\n\n<ul><li>What I learned from the COVID-19 market crash</li><li>Why FIRE is not dead</li><li>How my investment plans have changed</li><li>Why you should take advantage of this market reset</li><li>How the pandemic changed my thoughts on risk</li><li>Why I&#8217;ve decided to use my travel rewards differently</li><li>How to use what you learned from lockdown to shape a better post-FI life</li></ul>\n\n\n\n<h2>Show Links</h2>\n\n\n\n<ul><li><a aria-label=\"undefined (opens in a new tab)\" href=\"https://www.madfientist.com/coronavirus-market-crash/\" target=\"_blank\" rel=\"noopener\">Coronavirus Market Crash &#8211; Is This Time Different?</a></li><li><a aria-label=\"undefined (opens in a new tab)\" href=\"https://www.madfientist.com/my-portfolio/\" target=\"_blank\" rel=\"noopener\">What&#8217;s In My Portfolio (and How I Manage It)</a></li><li><a aria-label=\"undefined (opens in a new tab)\" href=\"https://www.madfientist.com/traditional-ira-vs-roth-ira/\" target=\"_blank\" rel=\"noopener\">Traditional IRA vs. Roth IRA – The Best Choice for Early Retirement</a></li><li><a aria-label=\"undefined (opens in a new tab)\" href=\"https://www.madfientist.com/other-portfolio/\" target=\"_blank\" rel=\"noopener\">The Other Portfolio You Need to Focus On</a></li><li><a aria-label=\"undefined (opens in a new tab)\" href=\"https://www.madfientist.com/third-year-of-freedom/\" target=\"_blank\" rel=\"noopener\">Valuable Lessons from My Third Year of Freedom</a></li><li><a aria-label=\"undefined (opens in a new tab)\" href=\"https://www.madfientist.com/advice\" target=\"_blank\" rel=\"noopener\">Advice from Financial Independence Podcast Guests</a></li></ul>\n\n\n\n<h2>Full Transcript</h2>\n\n\n\n<div class=\"transcript\"><strong>Mad Fientist:</strong> Hey, what&#8217;s up everybody. It&#8217;s the Mad Fientist. Welcome to the Financial Independence Podcast. <br><br>It&#8217;s been a while since I released my last episode and wow has a lot of stuff happened since then. So my last episode with Jim was released on March 16th. And if you remember what March was like, it was pretty crazy.<br><br>We recorded that episode on Sunday, March 15th and the markets were down 21% from the February 19th highs. <br><br>I released the episode early Monday morning and Monday just happened to be the biggest drop of this entire crisis and actually the third biggest drop of all time, behind black Monday back in 1987 and one day during the great depression.<br><br>So I&#8217;m glad I rushed that episode out, even though I didn&#8217;t have my proper microphone and just threw it together the day before I released it. But hopefully it stopped you from selling because now here we are on August 6th when I&#8217;m recording this and the markets aren&#8217;t open yet, but we&#8217;re currently sitting just under 2% lower than the all time highs we hit on February 19th, which is just insane.<br><br>I mean, I would have never predicted that. If someone had told me that we would be here in August, I would say, &#8220;Oh, great&#8230;we have a vaccine and everything&#8217;s back to normal.  Economies are up and running!&#8221; and that&#8217;s not happened either. So this just highlights one that you can&#8217;t predict what&#8217;s going to happen in the world.  And two, you definitely can&#8217;t predict what&#8217;s going to happen in the market. <br><br>So hopefully for all the people out there who think they can predict those things, this has been a humbling experience and hopefully not too costly. <br><br>The good thing about being in the position we are in now in the markets is that it&#8217;s sort of like a reset button.  And if you recall what Jim&#8217;s advice was in that last podcast episode, he said&#8230;During a downturn, during a crash, is not the best time to be rethinking your portfolio strategy and asset allocation because your emotions are high. You&#8217;re scared. You may make decisions that you wouldn&#8217;t normally make.<br><br>So he said to wait until things get back to normal again, and then you can revisit your strategy and you can reflect on that crash and see if you are taking too many risks and if you want to make changes for the future.  Well, here we are back at almost all time highs and this is your opportunity to do that.<br><br>So if you think back to when you listened to my last episode, back in March, and think about how you felt then, and sort of reflect on what your portfolio was and what you had wished it would have been at that point when markets were tanking. And again, like I said, when I released that episode, March 16th, stocks went down 11% in one day, and it was a very scary time and nobody knew what was happening.<br><br>So think back to then and think about, did you wish that you had less money in the market? Did you wish you had a higher bond allocation?  And now you can make those changes because we&#8217;re back at where we were back in February before this whole thing kicked off. <br><br>So today&#8217;s episode, I&#8217;m gonna talk about what I personally learned from this whole thing and my plans for the future and what&#8217;s changed.<br><br>And if you guys have listened to the show before, you may remember that on the anniversary of me leaving work, I&#8217;ve released episodes and articles titled Valuable lessons from My First Year of Freedom, Second Year of Freedom, Third Year of Freedom. And I can&#8217;t believe it, but it&#8217;s actually four years since I left my job.<br><br>It was August 1st, 2016. So just recently had my four-year anniversary. And I definitely learned a lot this past year, but most of what I learned was the result of all this COVID craziness. So that will be a big focus, but I&#8217;ll obviously talk about what else has happened to the past year and what other lessons I learned during this fourth year that can hopefully help you prepare for your own post-FI life.<br><br>So since this is the Financial Independence Podcast, let&#8217;s start with the money side of the equation. And I definitely learned a lot from this recent crash, even though I did survive the global financial crisis back in 2008 and was invested during that time. I still learned quite a few lessons from this particular crash.<br><br>And I wrote about some of that in my last post, where I broke down what&#8217;s in my portfolio and why. So if you haven&#8217;t read that yet, head over to madfientist.com/my-portfolio and you can read about everything that&#8217;s in there, there, but I just want to talk about some of the things that I didn&#8217;t mention in that post.<br><br>So the first thing is I&#8217;m thinking differently about risk than I used to. You may recall in previous episodes, I talked about my &#8220;peak arbitrage&#8221; strategy, where I buy a property in a mountain resort destination in the States. And I buy a property in Edinburgh, Scotland, and since the peak tourist season for those two properties is different, I could live in one of them during the off season and rent the other one out. And the, you know, the higher priced peak place would pay for the lower priced off-peak place. And then I can enjoy two really great houses and two great destinations for potentially a profit. <br><br>That seemed like a great idea, pre-COVID, but never in my wildest dreams, would I expect that the entire travel industry would just go poof overnight and Airbnbs that are normally in hot demand would not be filled for months at a time during a lockdown.<br><br>So, had I bought two expensive properties that I thought would wasn&#8217;t that risky due to the fact that, you know, the peak tourist seasons were different and they&#8217;re both very highly desirable destinations that were always being rented out. Had I done that then I would have been in a position where I had two big mortgages and a lot more financial stress than I&#8217;d want in my life.<br><br>COVID highlighted to me that anything is possible and you&#8217;d never want to overextend yourself in any sort of way that&#8217;s going to cause stress. So before making a purchase or before investing in something, really try to visualize the worst-case scenario and make sure that you&#8217;re comfortable with that.<br><br>And looking back on that plan, I don&#8217;t think I would be comfortable with that. That would cause me a lot of stress to have to empty properties. Obviously we could we&#8217;ll live in one of them, but having an empty property somewhere across the world and just be paying a bunch of bills on that is not exactly what I want to be doing.<br><br>So yeah, it was the first big lesson I took away from this year. <br><br>The other thing this crisis has highlighted is the value of living below your means.<br><br>As I&#8217;ve mentioned in past interviews and posts, there&#8217;s a lot of post-FI income that&#8217;s coming that I wasn&#8217;t expecting. So it would have been very easy over the past few years to inflate our lifestyles and start spending more because who would thought that the income would just drop off from a global pandemic?<br><br>I know I wouldn&#8217;t, but that&#8217;s what happened. So the whole stock market&#8217;s collapsing in March and all of the supplemental income that has been coming in over the years just decreases by 90% or something like that. And had we inflated our lifestyles, it could have been a very stressful time.<br><br>So that really highlighted the benefit of not increasing your spending, just because you have income coming in, that you expect to continue to come in. Because as I&#8217;m sure a lot of individuals and businesses are learning over the past few months, you could have a rock solid business and you could have a rock solid job and something like this could happen that causes that income to go away and you would have never expected it or predicted it. And you could be in a very tough spot if you&#8217;re relying on that income to sustain an inflated lifestyle. <br><br>Another big change I&#8217;m making this year is I&#8217;m going to be switching over my retirement contributions to Roth from Traditional.<br><br>As you know, I wrote an article talking about how traditional is better for people who are pursuing early retirement. And if you haven&#8217;t read that yet, I&#8217;ll put a link in the show notes to that article. But since our income has dropped this year and I&#8217;m eligible to contribute to a Roth IRA and Roth Solo 401k, I&#8217;m going to do it because I want to diversify more with my tax advantage accounts. Since I&#8217;m heavy on the traditional sides, I&#8217;m willing to take the tax hit this year to ensure that that money can be withdrawn tax-free in the future. Because obviously governments are spending a lot of money to deal with this COVID crisis. And we don&#8217;t know what taxes are gonna be in the future, but there seems to be a higher probability that taxes would need to increase the pay for all of this so this year I&#8217;m just going to try to diversify by my tax-advantaged accounts a bit more and put some more money into the rough side of things. <br><br>I&#8217;m also thinking a bit differently about travel rewards. So if you&#8217;ve read my past articles, you know that I was building up a big stash of miles and points so that the next time there was a big stock market crash, I could use all of those miles and points to travel while being able to funnel as much cash into the down market as I could. Well, I didn&#8217;t expect that the crash would come with a global pandemic, which means that we can&#8217;t travel anyway. So that&#8217;s been interesting because that sort of foiled my plan to use all those points. <br><br>So, I started getting a little bit worried about having huge balances in those programs, because airlines are struggling at the moment.  Hotels are struggling. Credit card companies are likely struggling. So having a million points scattered across different programs was a bit risky for me at this stage so I&#8217;ve actually started using some of those points to pay for groceries, which I am surprised about myself, but the deal was too good to pass up.<br><br>I recently found out that I can use my Chase points to wipe grocery bills off of my credit card statement. And normally that&#8217;s not really a great redemption, but since I have a Chase Sapphire Reserve card, I was able to get 1.5 cents per point, which is a decent redemption. It&#8217;s not amazing, but it&#8217;s decent.<br><br>And the fact that that same card was giving me 5 points per dollar at grocery stores for the whole pandemic, that means I was able to get 7.5% off of my grocery bill, which was pretty much our only expense during the three months of lockdown. So it turned out to be a great deal. It&#8217;s allowed me to get through some of my points and lower my point balances a bit more.<br><br>And it&#8217;s also saved us some money so that if the market does decrease again, we&#8217;ll have more cash to put into it. <br><br>If you&#8217;re interested in learning more about that card. That has definitely been my go to card for that the last three or four years. Yeah. Ever since it came out, I hopped on and as soon as it came out and it was amazing for travel, but like I said, it&#8217;s been great for groceries and stuff too, during the pandemic.<br><br>So if you&#8217;re interested to learn more about that, just head to madfientist.com/reserve, and you can read all about it there. And I think you&#8217;re able to redeem for groceries at 1.5 cents per point until the end of September. So if you already have that card and are interested in using your points for that, you can look into &#8220;Pay Yourself Back&#8221;&#8230;I think is the name of the program.<br><br>And you should be able to find it in the Ultimate Rewards portal on the Chase website. <br><br>So I think those were the main lessons from a financial standpoint, but this whole crisis has highlighted a bunch of nonfinancial things as well. <br><br>If you remember back in April and may, I think there&#8217;s a lot of mainstream media focus on FIRE and asking whether this means FIRE is dead and things like that.<br><br>And I didn&#8217;t get into the conversation back then because I thought it was crazy that, during our first market pullback and people were thinking that everyone&#8217;s plans are screwed, which is insane because if you don&#8217;t plan for these sorts of drops, or if your plan fails at the first draw down, then you&#8217;re not really FIRE in the first place.<br><br>So it seemed like a crazy argument at the time, but I thought that this whole crisis actually highlighted the benefits of FIRE more than anything, the value of not having to make decisions for financial reasons. And being in a financial position where you don&#8217;t have to say yes to anything that you don&#8217;t want to say yes to and you don&#8217;t have to put yourself in a position where you could potentially hurt yourself or others, just because you need to get that next paycheck. That is a huge benefit during stressful times like this.<br><br>Another thing this experience has done is it&#8217;s sort of highlighted what was good and what wasn&#8217;t as good about pre-COVID life, because everything sort of went away. So if you&#8217;re in a position now where you&#8217;re still sort of under lockdown, like we are here in the UK, think back to your pre-COVID life and think about the things that you really miss. And also try to think about what life was like before and all the things you were doing and think about the things that you haven&#8217;t missed, or you forgot that you even did before, because I&#8217;m sure a lot of people have really busy lives and a lot of that busyness is maybe stuff that&#8217;s just leftover from earlier years, and you&#8217;ve just continued doing it even though it&#8217;s not as important to you anymore. So now&#8217;s a great time to think back to the pre-COVID life. Make changes and make different plans for the future.  <br><br>Based on what I&#8217;ve learned after reflecting on it myself, I learned that after three years of post-FI life, I had pretty much dialed in a great routine and a great balance of fun and work that I&#8217;m really passionate about.  So the life I described in my Valuable Lessons from My Third Year of Freedom podcast, which I&#8217;ll link to in the show notes, actually is yeah, pretty ideal. And obviously this year is quite different because a lot of the fun half of that lifestyle was cut away because not able to travel and see friends and family like I did in the third year, but it was a good balance so I know that I was on the right track. And once we get back to post-COVID normal life, then hopefully we can just pick up where we left off and that&#8217;s going to be a pretty good trajectory to be on. <br><br>Speaking of meaningful work&#8230;since the fun portion of life was put on hold from all of this COVID stuff, I&#8217;ve been doubling down on the meaningful work aspect.  So I&#8217;ve spent lockdown, really working hard on a lot of these projects that I&#8217;ve been wanting to make progress on over the years and have made some really good progress, which is fantastic. And I&#8217;m going to tell you a lot more about that in my next episode. So if you&#8217;re not subscribed, then head to  madfientist.com/advice, and you can sign up to the email list there and you&#8217;ll get a PDF of all the great advice I&#8217;ve got from my Financial Independence Podcast, guests over the years and you&#8217;ll also find out when I publish my next episode, which is definitely the most excited I&#8217;ve ever been to publish an episode before. So hopefully that&#8217;s going to come out in September, but yeah, go to madfientist.com/advice to sign up to the email list and you&#8217;ll get notified as soon as that next episode comes out.<br><br>But one thing I wanted to mention about working on those meaningful projects is that lockdown hopefully maybe showed you that it&#8217;s a bit harder than you expect it to be, to work on all those things that you always say that you&#8217;re going to work on. Yes, I realized that lockdown was probably a lot more stressful and weird than normal life would be after you quit your job but it does take a lot of effort and a lot of learning about yourself too, to do the things that you have always said you wanted to do.<br><br>I guess, a good way to describe it is sort of like new year&#8217;s day when you make all these resolutions and you have all this optimism and you think that future you is going to be healthy and active and will be able to avoid all of the procrastination issues that you&#8217;ve had to deal with so far. And you know, you just have this other picture of yourself that&#8217;s probably not as realistic as you think it is. So that again, this goes back to what I&#8217;ve said before in that anything that you plan to do after you retire, I say you start now and you start to integrate that into your life and you start to work through some of the hard things that you have to work through to be able to get to work on some of these things. <br><br>Because for me, it wasn&#8217;t my job holding me back. It was actually my self-doubt and my procrastination and my inability to get started because I was scared I was going to be bad at it. And it was those things that was holding me back and it wasn&#8217;t my nine-to-five because I had plenty of free time. It was just that I use that free time for other things, because I was too scared to use it for the things that really mattered. So again, if you can start these things now, even before FI, even before you leave your full time job. Then when you get to FI, you&#8217;re going to be in a much better position and you&#8217;re going to be able to just like hit the ground running because you&#8217;re going to have all these hours to use, but you&#8217;re going to know how to use them. <br><br>So think about how you used your time during lockdown. If you had any extra time&#8230;I know the parents out there probably had less time than they did before lockdown.  But if you did have some free time, did you use it how you thought you would? And if you didn&#8217;t then how can you start to live that sort of life now, even if you are back to work and you don&#8217;t have as much free time. <br><br>Well, I think that&#8217;s it for this year. There&#8217;s obviously a lot of stuff that I&#8217;ve learned about myself and about the world that I didn&#8217;t expect to learn this year.<br><br>I&#8217;d be interested to hear any lessons that you&#8217;ve picked up from the last few crazy months so just head over to the show notes for this episode and put them in the comments and I&#8217;ll look forward to reading those. <br><br>Again, if you haven&#8217;t subscribed to the email list or the podcast yet just head over to madfientist.com/advice or subscribe on iTunes, and then you&#8217;ll get to know when the next episode comes out and hopefully that will be sometime in September and I am seriously so excited about it. <br><br>And finally, I hope. Everyone out there is doing okay. I know these are crazy times and a lot of ups and downs and some scary stuff going on so I hope everybody&#8217;s healthy. I hope all of your families have been able to stay healthy.<br><br>So take care, thanks for listening, and I&#8217;ll speak again soon.<br></div>\n\n\n\n\n\n<h2>Related Post</h2><div><a href='https://www.madfientist.com/third-year-of-freedom/' target='_blank'><div class='post_card'><div class='post_card_text'><h3 style='color:#399da8;'>Valuable Lessons from My Third Year of Freedom</h3><p class='post_card_excerpt'>It's been three years since I left my full-time job and this past year was the best one yet!  Here's a short podcast episode with everything I learned.</p></div><div class='post_card_image'><img src='https://www.madfientist.com/wp-content/uploads/2019/08/third-year-of-freedom.jpg' style='border-radius:7px;'/></div></div></a></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/fourth-year-of-freedom/\">Valuable Lessons from My Fourth Year of Freedom</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "wfw:commentRss": "https://www.madfientist.com/fourth-year-of-freedom/feed/",
  "slash:comments": 41,
  "enclosure": ""
}