{
  "id": "https://bibleinoneyear.org/en/youth/237",
  "title": "Day 237: Strong Families",
  "description": "Psalm 102:18–28, 2 Chronicles 25:4, 1 Corinthians 16:5-20. ’The Bible has a great deal to say about family life  Not only do we have a natural family but, as Christians, we are part of the church, which the New Testament sees as ‘the family of God’",
  "pubDate": "Thu, 25 Aug 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/237/",
  "itunes:duration": "13:21",
  "guid": "enyouth25082022-237",
  "length": 801.18,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 237: Strong Families",
  "itunes:subtitle": "Psalm 102:18–28, 2 Chronicles 25:4, 1 Corinthians 16:5-20. ’The Bible has a great deal to say about family life  Not only do we have a natural family but, as Christians, we are part of the church, which the New Testament sees as ‘the family of God’",
  "itunes:summary": "A busy father was looking for a way to entertain his young daughter. He found a map of the world in a magazine and cut it into pieces. He gave the pieces to his child and suggested she try to piece the map back together.\nAfter a very short time, she said she had finished. He was very surprised by how quickly she had done it. He asked her how she had managed to do it so fast. She replied, ‘I noticed when you took the page out of the magazine that on the back of the map of the world there was a picture of a man and a woman. I thought that if I could put the man and the woman back together, I could put the world back together.’\nMarriage and family life are hugely important. They are part of God’s natural order, and are a vital part of the fabric of society. Pope John Paul II once wrote that family is the ‘foundation’ of society and ‘nourishes’ society continually.\nNicky and Sila Lee have invested their lives in strengthening marriages and family life. Their courses and books such as The Marriage Book and The Parenting Book have had a profound impact on thousands of people in our own local church and now in many countries around the world. Recently a government official in one country said to Nicky and Sila, ‘A strong society depends on strong families and strong families depend on strong marriages. That’s why we are interested in your work.’\nThe Bible has a great deal to say about family life. Not only do we have a natural family but, as Christians, we are part of the church, which the New Testament sees as ‘the family of God’.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 602
}