{
  "title": "S1E40 - Coming Back from Injuries Stronger than Before with Our Host Laura Wilkinson",
  "guid": "https://pinecast.com/guid/59f29c76-b533-4a52-9c1e-a601f2c81dfe",
  "pubDate": "Tue, 06 Apr 2021 06:30:00 -0000",
  "itunes:duration": "00:39:07",
  "description": "<p>One topic that Laura has been receiving a lot of messages about lately is that of dealing with injuries. There seems to be some worry, frustration, and uncertainty expressed by more and more athletes when it comes to feeling productive while they’re sidelined for weeks, months, and even longer during their recovery. Definitely no stranger to the world of injuries, Laura draws upon her own experiences, and those of previous podcast guests, to address all of these concerns and share some valuable advice.\n \nLaura begins by recounting some of the injuries she has sustained during her career and how she and her coach responded to them. Throughout these stories, she highlights the importance of being ‘all in’ on your recovery plan, learning from these injuries and carrying those lessons forward, the power of mind, mindset, and perspective, as well as working through the many resulting emotions. Laura also reviews the stories of some past guests of the podcast whose journeys through injury and illness are both inspiring and enlightening, and she concludes the episode with her advice on ways to deal with injuries, how to use the time while on the sidelines, and just how critical it is to really take the time to assess your injury and recovery before choosing wisely on how to move forward. As you will hear, today’s topic is one with which Laura is greatly familiar, and the knowledge and wisdom she shares here is drawn not only from her own experience but from others in the world of high level sports. This is, truly, an important listen for all athletes, and really, for anyone who may suffer perceived setbacks in achieving their goals in life.</p>\n<p>Episode Highlights:\n </p>\n<ul>\n<li>Some of the injuries that Laura has sustained throughout her career and how she and her coach responded to them</li>\n<li>Believing in what you’re doing when coming back from injury</li>\n<li>Learning from injuries and recovery and carrying those lessons forward</li>\n<li>The importance of our mind, mindset, and perspective</li>\n<li>Working through your emotions</li>\n<li>Inspiration to be drawn from past podcast guests</li>\n<li>Laura’s advice on ways to deal with injuries and what you can do while sidelined</li>\n<li>The power of nutrition, video study, visualization, mindfulness, coaching others, and restructuring goals</li>\n<li>Choosing your response to injuries wisely</li>\n</ul>\n<p>Quotes:\n </p>\n<ul>\n<li>“Obviously, hindsight, I wish we would have pressed for X-rays anyway, but my coach and I were just hoping that, you know, it wasn’t a big deal.”</li>\n<li>“That first week, I still had all those mix of emotions that you get when you feel like your world is caving in on you.”</li>\n<li>“We’re not going to look back and say, ‘What if?” and ‘Could I have?’, we are only going to look forward with a new plan.”</li>\n<li>“I have to tell you that believing in what you’re doing - as crazy as it might appear to anyone watching - if you believe in what you are doing, you’ve got to be all in.”</li>\n<li>“I would not have stood on that podium if I had not broken my foot.”</li>\n<li>“They basically took two of the discs out in my neck and fused the bones together.”</li>\n<li>“You can come out the other side even stronger.”</li>\n<li>“If your goals have changed and you don’t want to be in your sport anymore, you don’t always have to use the injury as an excuse.”</li>\n<li>“Sometimes these injuries turn into something more beautiful.”</li>\n<li>“These injuries, they can break you if you let them, or they are something that can turn you into an entirely new athlete with a new purpose.”</li>\n<li>“I encourage you to even check out the small injuries.”</li>\n<li>“Take your physical therapy seriously.”</li>\n<li>“Be smart. Know when to go slow. Know when to push forward.”</li>\n<li>“There is so much you can do while you’re sidelined.”</li>\n<li>“The mind is powerful. You need to learn how to use it.”</li>\n<li>“Don’t underestimate the power of coaching. Even if it’s some younger kids that are around you, it can be really, really beneficial.”</li>\n<li>“It all truly comes down to how you chose to look at it…choose wisely, friends.”</li>\n</ul>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold homepage</a>\n<a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">5 Smart Strategies to Confidence</a>\n<a href=\"https://laurawilkinson.mykajabi.com/email-capture-0d05ebf5-739d-43b0-a4ab-5f4ea91a24e6\" rel=\"nofollow\">Conquer Your Fear in 5 Days</a>\n \nLaura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura's Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura's Facebook page</a>\n \nPrevious episode links:\n \n<a href=\"https://www.laurawilkinson.com/podcast-episodes/paralyzed-to-powerful-with-rugby-player-robert-paylor\" rel=\"nofollow\">Robert Paylor</a>, episode 38\n \n<a href=\"https://www.laurawilkinson.com/podcast-episodes/learning-to-run-free-with-world-champion-chanelle-price\" rel=\"nofollow\">Chanelle Price</a>, episode 37\n \n<a href=\"https://www.laurawilkinson.com/podcast-episodes/finding-the-positive-side-of-challenges-with-paralympic-champion-allysa-seely\" rel=\"nofollow\">Allysa Seely</a>, episode 29\n \n<a href=\"https://www.laurawilkinson.com/podcast-episodes/how-to-be-resilient-through-adversity-improve-performance-with-dr-ben-houltberg\" rel=\"nofollow\">Dr. Ben Houltberg</a>, episode 27\n \n<a href=\"https://www.laurawilkinson.com/podcast-episodes/when-the-beautiful-olympic-moment-is-not-what-you-expected-with-abbey-and-jacob-cooper\" rel=\"nofollow\">Abby and Jacob Cooper</a>, episode 23\n \n<a href=\"https://www.laurawilkinson.com/podcast-episodes/when-your-purpose-becomes-greater-than-your-goal-with-chaunte-lowe\" rel=\"nofollow\">Chaunte Lowe</a>, episode 18\n \n<a href=\"https://www.laurawilkinson.com/podcast-episodes/mindset-is-everything-with-speed-skater-apolo-ohno\" rel=\"nofollow\">Apolo Ohno</a>, episode 16\n \n<a href=\"https://www.laurawilkinson.com/podcast-episodes/you-dont-need-to-have-sight-to-have-vision-with-amy-dixon\" rel=\"nofollow\">Amy Dixon</a>, episode 14\n \n<a href=\"https://www.laurawilkinson.com/podcast-episodes/us-navy-eod-officer-to-gold-medal-paralympian-with-brad-snyder\" rel=\"nofollow\">Brad Snyder</a>, episode 12</p>\n<p><a href=\"https://www.laurawilkinson.com/podcast-episodes/extend-your-athletic-career-with-susie-parker-simmons\" rel=\"nofollow\">Susie Parker-Simmons</a>, episode 7</p>",
  "itunes:title": "Coming Back from Injuries Stronger than Before with Our Host Laura Wilkinson",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 40
}