{
  "title": "Deep-Brain Stimulator Draws Power From Breath",
  "link": "https://spectrum.ieee.org/deep-brain-stimulation-no-battery",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/neon-colored-outline-of-person-and-lungs-against-a-dark-checked-background.jpg?id=31988426&width=1200&height=600&coordinates=0%2C312%2C0%2C313\"/><br/><br/><p>A new experimental, batteryless, surgically implanted brain device for chronic conditions and neurodegenerative disorders is bolstering hopes in the eternal quest for maximally effective but minimally invasive treatments. </p><p><a href=\"https://spectrum.ieee.org/what-is-neural-implant-neuromodulation-brain-implants-electroceuticals-neuralink-definition-examples\" target=\"_self\">Neural implants</a> that electrically stimulate tissue deep in the brain are used today to treat Parkinson’s disease and epilepsy. Researchers have also shown recently that <a href=\"https://spectrum.ieee.org/how-to-treat-psychiatric-disorders-with-brain-stimulation\" target=\"_self\">deep-brain simulation can be used to treat mental disorders</a> such as addiction, depression, obsessive-compulsive disorder, and post-traumatic stress disorder.<br/></p><p>The batteries that power these deep-brain stimulation (DBS) implants last for about three years. However, surgery to replace the bulky batteries can add cost and increase the risk of infection. To get around that problem, researchers have made a DBS system that powers itself by harvesting and storing energy from the motion of breathing lungs. </p><p>“Deep-brain stimulators are energy monsters so the battery runs out very quickly,” says <a href=\"https://soeprofed.uconn.edu/meet-islam-mosa/\" target=\"_blank\">Islam Mosa</a>, a chemist and chief technology officer of University of Connecticut spinoff <a href=\"https://www.linkedin.com/company/voltxon\" target=\"_blank\">VoltXon</a>, which is commercializing the system reported in the journal <em><a href=\"https://www.sciencedirect.com/science/article/pii/S2666386422004015\" rel=\"noopener noreferrer\" target=\"_blank\">Cell Reports Physical Science</a></em>. “We have created the first self-sustainable and battery-free deep-brain stimulating device.”</p><p>Deep-brain stimulation uses electrodes surgically implanted in the deep interior part of the brain to send electrical impulses at varying frequencies via electrodes. A pulse generator placed under the skin just below the collarbone fires the electrodes through a wire under the skin that runs up the neck to the skull.</p><p>Those electrical pulses have to be delivered to the brain in a controlled manner. <a href=\"https://scholar.google.com/scholar?hl=en&as_sdt=0%2C22&q=make+battery-free+DBS+systems+&btnG=\" target=\"_blank\">Past efforts to make battery-free DBS systems</a> that rely on harvesting the body’s mechanical energy have either not been able to deliver pulses with controlled frequency or haven’t generated enough power to trigger the electrodes. </p><p>Mosa, UConn chemistry professor James Rusling, and their colleagues developed a new type of <a href=\"https://spectrum.ieee.org/tag/triboelectric-nanogenerators\" target=\"_blank\">triboelectric nanogenerator (TENG)</a> to harvest energy from lung movements, and a <a href=\"https://spectrum.ieee.org/tag/supercapacitors\" target=\"_blank\">supercapacitor</a> to store that energy. Both devices are superthin and flexible. </p><p><a href=\"https://spectrum.ieee.org/yarnlike-rechargeable-zinc-battery-could-power-smart-clothes-and-wearables\" target=\"_self\">TENGs</a> rely on the buildup of electrical charge when repeated movements cause their two electrodes, made of <a href=\"https://spectrum.ieee.org/nanogenerators-could-charge-your-smartphone\" target=\"_self\">dissimilar materials</a>, to separate and come together. They have been demonstrated to generate power from <a href=\"https://spectrum.ieee.org/flexible-nanogenerators-offer-dependable-energy-source-for-flexible-electronics\" target=\"_self\">footsteps</a>, <a href=\"https://spectrum.ieee.org/skinbased-generators-scavenge-muscle-motion-to-power-wearables\" target=\"_self\">muscle motion</a>, and <a href=\"https://spectrum.ieee.org/solar-and-wind-energy-from-the-same-device\" target=\"_self\">wind</a>, among other things, but have yet to be commercialized on a large scale.</p><p>The new TENG relies on the contact and separation of films made of two different plastics. But the researchers also added an extra “biographene” layer—which they make by coating a carbon microfiber fabric with graphene flakes and a protein. This biographene serves as an additional TENG, Mosa says, because of the relative movement between the carbon materials and protein, boosting the energy produced by the TENG. The entire device is the thickness of paper, and a 4- by 5-centimeter device generates 6.9 microwatts for each contact-separation cycle.</p><p>That energy is stored in the supercapacitor, which the researchers make by sandwiching a gel electrolyte between two biographene electrodes. Once the supercapacitor is charged up, it powers the pulse generator to fire the implanted electrode. </p><p>For practical use, the TENG wouldn’t be placed on delicate lung tissue, but attached to the inside of the rib cage, he says. The lungs would then press and release the device every time a person breathes in and out.</p><p>The researchers tested their system <em>ex vivo</em> for now, with the TENG placed on a model rib cage with actual pig lungs that were inflated and deflated using a pump, and the biosupercapacitor connected to electrodes that stimulated mouse brain tissue in a petri dish. </p><p>While commercial DBS systems electrically stimulate the brain continually, delivering 60 to 180 pulses per second, the new system is meant for intermittent DBS. Research has recently shown that intermittent stimulation might be more effective in conditions such as Alzheimer’s disease, memory, depression, and PTSD, Mosa says. </p><p>“Next we plan to do a long-term in vivo study,” he says.</p>",
  "pubDate": "Fri, 21 Oct 2022 17:29:55 +0000",
  "guid": "https://spectrum.ieee.org/deep-brain-stimulation-no-battery",
  "category": [
    "Triboelectric nanogenerators",
    "Supercapacitors",
    "Parkinson's disease",
    "Addiction",
    "Depression",
    "Electrical stimulation",
    "Deep brain stimulation",
    "Triboelectricity"
  ],
  "dc:creator": "Prachi Patel",
  "media:content": ""
}