{
  "title": "2018 Data Science Bowl Winners Announced",
  "link": "https://datasciencebowl.com/2018winners/",
  "dc:creator": "admin",
  "pubDate": "Tue, 08 May 2018 16:07:37 +0000",
  "category": "Data Science",
  "guid": "https://datasciencebowl.com/?p=44",
  "description": "<p>Imagine unleashing the power of artificial intelligence to automate a critical component of biomedical research, expediting life-saving research in the treatment of almost every disease from rare disorders to the common cold. This could soon be a reality, thanks to the fourth Data Science Bowl, a 90-day competition in which, for the very first time, [...]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://datasciencebowl.com/2018winners/\">2018 Data Science Bowl Winners Announced</a> appeared first on <a rel=\"nofollow\" href=\"https://datasciencebowl.com\">The Data Science Bowl</a>.</p>\n",
  "content:encoded": "<p><img class=\"alignleft size-full wp-image-45\" src=\"https://datasciencebowl.com/wp-content/uploads/2019/03/C.12.004.17_Data-Science-Bowl_dsb-1920x1080-v2-300x169.jpg\" alt=\"\" width=\"300\" height=\"169\" srcset=\"http://bahdatascience.wpenginepowered.com/wp-content/uploads/2019/03/C.12.004.17_Data-Science-Bowl_dsb-1920x1080-v2-300x169-200x113.jpg 200w, http://bahdatascience.wpenginepowered.com/wp-content/uploads/2019/03/C.12.004.17_Data-Science-Bowl_dsb-1920x1080-v2-300x169.jpg 300w\" sizes=\"(max-width: 300px) 100vw, 300px\" />Imagine unleashing the power of artificial intelligence to automate a critical component of biomedical research, expediting life-saving research in the treatment of almost every disease from rare disorders to the common cold. This could soon be a reality, thanks to the fourth Data Science Bowl, a 90-day competition in which, for the very first time, participants trained deep learning models to examine images of cells and identify nuclei, regardless of the experimental setup—and without human intervention. Algorithms developed in this competition could save researchers hundreds of thousands of hours of effort per year. <span id=\"more-5414\"></span><br />\n<a href=\"http://www.boozallen.com\">Booz Allen Hamilton</a> and <a href=\"http://www.kaggle.com\">Kaggle</a> today announced the winners of this year’s Data Science Bowl. The competition brought together nearly 18,000 global participants, the most ever for the Data Science Bowl. Collectively, they submitted more than 68,000 algorithms and worked an estimated 288,000 hours to automate the vital, but time-consuming, process of nuclei detection. Identifying nuclei allows researchers to find each individual cell in a sample and, by measuring how cells react to various treatments, understand the underlying biological processes at work.</p>\n<p>“These solutions represent a paradigm shift in the way microscopy images are processed in biomedical research and will make research more accurate and efficient,” said Dr. Anne Carpenter, director of the Imaging Platform at Broad Institute of MIT and Harvard. The next step being investigated is to create a user-friendly and open-sourced software that biomedical researchers can begin using in their day-to-day work.</p>\n<p><strong><a href=\"https://www.kaggle.com/c/data-science-bowl-2018/leaderboard\">2018 Data Science Bowl winners</a> include:</strong></p>\n<ul>\n<li><strong>First Place:</strong> Victor Durnov, Alexander Buslaev, and Selim Seferbekov, an international team from Russia and Germany who have competed against each other in previous crowdsourcing competitions but formed a team with the specific goal of winning this year’s competition.</li>\n<li><strong>Second Place:</strong> Minxi Jiang, who finished in the top one percent in <a href=\"https://www.boozallen.com/e/media/press-release/nearly-10-000-global-problem-solvers-yield-winning-formulas-to-i.html\">last year’s Data Science Bowl</a>.</li>\n<li><strong>Third Place:</strong> Angel Lopez-Urrutia, a marine ecologist in Spain who uses machine learning to automatically classify images of plankton, a challenge that was central to the <a href=\"https://www.boozallen.com/e/media/press-release/booz-allen-kaggle-announce-winner-of-the-data-science-bowl.html\">inaugural Data Science Bowl</a>.</li>\n</ul>\n<p>“By identifying nuclei quickly and accurately, the algorithms developed in this competition can free up biologists to focus on other aspects of their research, shortening the approximately 10 years it takes for each new drug to come to market and, ultimately, improving quality of life,” said Ray Hensberger, a Booz Allen Hamilton principal. “This year’s Data Science Bowl was fascinating because nuclei detection is crucial to biomedical research, but detection methods require time-consuming biologist oversight. Until now, there have never been any deep learning models available that can identify nuclei across multiple experimental setups and testing conditions.”</p>\n<p>For this year’s Data Science Bowl, <a href=\"https://www.broadinstitute.org/\">Broad Institute of MIT and Harvard</a>, a non-profit biomedical and genomics research institute, provided participants with data from thousands of nuclei from a wide variety of imaging experiments. Using this data, participants created algorithms that can identify nuclei in any cell image, thereby expediting the detection process and allowing biologists to conserve time for other efforts.</p>\n<p>“We’re thrilled that this year’s Data Science Bowl convened thousands of the world’s top minds and rallied them around a pressing scientific challenge,” said Anthony Goldbloom, CEO, Kaggle. “In just 90 days, participants submitted over 68,000 algorithms, which is nearly 280 percent more than last year’s competition. The large numbers of forum posts and kernels resulting from this year’s competition demonstrate that we have fostered a growing community that is willing to share and learn together, which is truly inspiring.”</p>\n<p>Creators of the top algorithms will split $170,000 in cash and prizes, including powerful NVIDIA® GPU hardware for deep learning such as the NVIDIA DGX Station and the NVIDIA TITAN GPU. The competition receives sponsorship and support from several leading health and technology organizations, including the Broad Institute, <a href=\"http://www.nvidia.com/page/home.html\">NVIDIA</a>, and <a href=\"http://www.perkinelmer.com/\">PerkinElmer, Inc</a>.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://datasciencebowl.com/2018winners/\">2018 Data Science Bowl Winners Announced</a> appeared first on <a rel=\"nofollow\" href=\"https://datasciencebowl.com\">The Data Science Bowl</a>.</p>\n"
}