{
  "title": "S15 Ep2: ALL OUT MONSTER ATTACK",
  "link": "https://audioboom.com/posts/8098521",
  "itunes:episode": 2,
  "itunes:title": "ALL OUT MONSTER ATTACK",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4214,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "ALL OUT MONSTER ATTACK on BEYOND the DARKNESS with Alien Legacy & guest Geraldine Sutton Stith!<br>\n<br>\nAugust 21, 1955 was just another hot summer night like so many others in the small community of Kelly, Kentucky. Lucky Sutton along with his family and friends were enjoying a quiet peaceful evening. The family not knowing that all around them strange things were happening. <br>\n<br>\nLucky and his family were about to find out what lurks in the darkness. The visitors were not from this earth. A night that started like any other ended with gunshots and screams and 11 people who's live would be forever changed.<br>\n<br>\nGet the book here: <a href=\"https://amazon.com\">https://amazon.com</a><br>\n<br>\nVisit the Little Green Men Festival: <a href=\"http://www.kellyky.com/\">http://www.kellyky.com/</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nAre you playing along with Beyond the Darkness on the Podcast One/ <a href=\"http://Betonline.AG\">Betonline.AG</a> Sportsnet Challenge?!  Each Week Dave and Tim are picking the winners of five NFL gam,es and playing against the hosts of different Podcast One shows!  If you play aloing with Dave and Tim on <a href=\"http://BetOnline.AG\">BetOnline.AG</a>, and they win the week, you qualify to be one of five winners splitting a $500 weekly prize! To sign up go to <a href=\"https://promotions.betonline.ag/podcastone\">https://promotions.betonline.ag/podcastone</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.",
  "itunes:summary": "ALL OUT MONSTER ATTACK on BEYOND the DARKNESS with Alien Legacy & guest Geraldine Sutton Stith!\n\nAugust 21, 1955 was just another hot summer night like so many others in the small community of Kelly, Kentucky. Lucky Sutton along with...",
  "pubDate": "Sun, 05 Jan 2020 10:00:00 +0000",
  "guid": "820a2c99-cfc6-44dc-93a2-6281d1cd1dde",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}