{
  "title": "When Google Search fails, and when it doesn't",
  "link": "",
  "id": "http://brooksandrew.github.io/simpleblog/articles/when-google-fails",
  "published": "2014-09-28T00:00:00+00:00",
  "updated": "2014-09-28T00:00:00+00:00",
  "author": {
    "name": "andrew brooks",
    "uri": "http://brooksandrew.github.io/simpleblog",
    "email": "andrewbrooksct@gmail.com"
  },
  "content": "<h3 id=\"what-google-cant-do\">What Google can’t do</h3>\n\n<p>Google (Search) is pretty awesome.  Sometimes it knows what I want more than I know what I want.  But not with punctuation, special characters, symbols, whatever you want to call them – stuff like <code class=\"highlighter-rouge\">!#$%&amp;*+-/.,;:</code></p>\n\n<h3 id=\"when-i-want-to-search-for-special-characters\">When I want to search for special characters</h3>\n\n<p>I find myself trying to search for special characters in two common situations:</p>\n\n<ol>\n  <li>\n    <p><strong>Code:</strong> I’m often googling syntax for whichever programming language I’m coding in.  Code is generally littered with special characters… especially if you’re doing something with <a href=\"http://en.wikipedia.org/wiki/Regular_expression\">regular expressions</a>… like <code class=\"highlighter-rouge\">([[^:]]+)://([[^:/]]+)(:([[0-9]]+))</code></p>\n  </li>\n  <li>\n    <p><strong>Writing:</strong> When I’m writing, I often use Google to help get a feel for how conventional/correct/mainstream the phrase or grammar I’m using is.  If the <a href=\"http://www.nytimes.com/\">New York Times</a> (or any organization of prestige) uses the piece of language I’m inquiring about, then I feel good about it.  If Google returns only a couple sketchy websites with visibile editing lapses, I’ll probably rephrase my language.  Take “editing lapses” for example.  I thought of the phrase just as I was writing the previous sentence you just read.  Having not used the phrase (that I can remember) before, I Googled it.  Sure enough, one of the first hits was the <a href=\"http://books.google.com/books?id=CnwIVkAQgFwC&amp;pg=PA85&amp;lpg=PA85&amp;dq=%22editing+lapse%22&amp;source=bl&amp;ots=xmq938KI5G&amp;sig=6EAvhXLUvJ0hN7ERVdHvuA6kKg4&amp;hl=en&amp;sa=X&amp;ei=0MwkVM_kINiiyAS7_oD4Cw&amp;ved=0CD8Q6AEwBg#v=onepage&amp;q=%22editing%20lapse%22&amp;f=false\">New York Times Manual of Style and Usage</a>:</p>\n  </li>\n</ol>\n\n<blockquote>\n  <p>If the justification is lame or lacking, the correction should acknowledge reporting or <strong>editing lapses</strong>.</p>\n</blockquote>\n\n<h3 id=\"what-special-characters-google-can-do\">What special characters Google can do</h3>\n\n<p>Google claims to provide search support for <a href=\"https://support.google.com/websearch/answer/2466433\">some special characters</a>:</p>\n\n<ul>\n  <li><code class=\"highlighter-rouge\">+</code></li>\n  <li><code class=\"highlighter-rouge\">@</code></li>\n  <li><code class=\"highlighter-rouge\">&amp;</code></li>\n  <li><code class=\"highlighter-rouge\">%</code></li>\n  <li><code class=\"highlighter-rouge\">$</code></li>\n  <li><code class=\"highlighter-rouge\">-</code></li>\n  <li><code class=\"highlighter-rouge\">_</code></li>\n</ul>\n\n<p>This wasn’t always the case – checkout <a href=\"http://insidesearch.blogspot.com/2012/04/search-quality-highlights-50-changes.html\">Google’s official Search blog post from March 2012</a>.  Search may support these special characters, but it does not allow (from what I can tell) to search for a specific quoted string with the character.  I had decent luck with <code class=\"highlighter-rouge\">$</code> and <code class=\"highlighter-rouge\">%</code>, but could barely get any queries to work with <code class=\"highlighter-rouge\">-</code> or <code class=\"highlighter-rouge\">+</code>.</p>\n\n<p>However noticably absent are the comma, period and colon and semicolon which account for nearly all the grammar queries I’d want to run by Google.</p>\n\n<p>It appears I’m not alone.  <a href=\"https://productforums.google.com/forum/#!topic/websearch/JJZ35b1ShFg\">Here on Google’s product forms page</a>, a user complains of the same issue – inability to include a comma in a quoted string query.</p>\n\n<h3 id=\"what-else-google-can-do\">What else Google can do</h3>\n\n<p>Google provides the simplicity of one search line that knows all (most of the time).  There’s also the <a href=\"https://www.google.com/advanced_search\">Google Advanced Search</a> page, which is not obviously located on <a href=\"http://google.com\">the main search page</a>, where you can narrow your search by explicity guiding Google.</p>\n\n<p>You can also utilize the simple search bar with basic <a href=\"https://support.google.com/websearch/answer/136861?hl=en\">Google Search operators</a>.  For some reason Google doesn’t document all of the operators – <a href=\"http://www.googleguide.com/advanced_operators_reference.html\">here is a more extensive list</a>.</p>\n\n<p>Some of my favorites are:</p>\n\n<ul>\n  <li>\n    <p><code class=\"highlighter-rouge\">filetype:pdf</code> returns just pdf documents… can replace with <code class=\"highlighter-rouge\">:pdf</code> with <code class=\"highlighter-rouge\">:R</code> if you’re looking for R scripts. You get the idea.</p>\n  </li>\n  <li>\n    <p><code class=\"highlighter-rouge\">\"this exact phrase\"</code> returns hits with the exact phrase in quotes</p>\n  </li>\n  <li>\n    <p><code class=\"highlighter-rouge\">d3 -diablo</code> returns hits on <code class=\"highlighter-rouge\">d3</code> without the word <code class=\"highlighter-rouge\">diablo</code>.  This was a problem for me when I was constantly searching for the JavaScript library <a href=\"http://d3js.org/\">D3.js</a> and not <a href=\"http://us.battle.net/d3/en/\">Diablo 3</a> which admittedly consumed large part of my life for a short but intense period.</p>\n  </li>\n  <li>\n    <p><code class=\"highlighter-rouge\">link:http://en.wikipedia.org/wiki/Catch-22</code> returns all the websites that link to the <a href=\"http://en.wikipedia.org/wiki/Catch-22\">Catch 22 wiki page</a>.  I like to use this on new websites/blogs/online-storefronts to scan for any red flags and general clout on the web.</p>\n  </li>\n  <li>\n    <p><code class=\"highlighter-rouge\">~inexpensive dinner</code> returns hits for inexpensive dinners, cheap dinners, budget dinners, and any synonym of <code class=\"highlighter-rouge\">inexpensive</code> with dinner.  I’ve had mixed success with this one.  A lot of the time the results appear the same with or without the tilda <code class=\"highlighter-rouge\">~</code>.</p>\n  </li>\n</ul>\n\n<h3 id=\"where-you-can-search-for-special-characters\">Where you can search for special characters</h3>\n\n<p>For code specific queries, the Stack Overflow community seems to favor <a href=\"http://symbolhound.com/\">SymbolHound</a>.  For the few queries I tested with special characters, it returned some honest results with my exact string of special characters, but only a few hits (sometimes 2, sometimes 0).</p>\n\n<p>Slightly unrelated… but when you find a special character that you can’t identify in a paper, or want to copy that special character somewhere, you can search for it on <a href=\"http://www.amp-what.com/unicode/search/\">amp-what.com</a></p>\n\n<p>It’s not just Google.  The other big search engines, like <a href=\"http://bing.com\">Bing</a> don’t support the full gamut of special characters either.  I did encounter a new search engine called <a href=\"http://blekko.com\">Blekko</a> with an interesting service – <a href=\"https://blekko.com/webgrep\">webgrep</a> – that does exactly what I’m looking for.  They search for specific strings of text including punctuation in the raw HTML and rank the top URLs.  The only problem is that it takes 10 hours and is on reqest only.  <code class=\"highlighter-rouge\">:(</code>  Cool concept though.</p>\n\n\n  <p><a href=\"http://brooksandrew.github.io/simpleblog/articles/when-google-fails/\">When Google Search fails, and when it doesn't</a> was originally published by andrew brooks at <a href=\"http://brooksandrew.github.io/simpleblog\">andrew brooks</a> on September 28, 2014.</p>"
}