{
  "title": "Rapid A/B-testing with Sequential Analysis",
  "description": "<img src=\"http://auduno.github.io/SeGLiR/images/header4.png\" alt=\"image\" style=\"margin-top:50px;margin-bottom:50px\"/><p>A common issue with classical A/B-tests, especially when you want to be able to detect small differences, is that the sample size needed can be prohibitively large. In many cases it can take several weeks, months or even years to collect enough data to conclude a test. In this post I&rsquo;ll introduce a very little known test that in many cases severely reduces the number of samples needed, namely the Sequential Generalized Likelihood Ratio Test.</p>\n\n<!-- more -->\n<br/><p>The Sequential Generalized Likelihood Ratio test (or sequential GLR test for short) is a test that is surprisingly little known outside of statistical clinical research. Unlike classical fixed sample-size tests, where significance is only checked after all samples have been collected, this test will continously check for significance at every new sample and stop the test as soon as a significant result is detected, while still guaranteeing the same type-1 and type-2 errors as the fixed-samplesize test. This means the test could be stopped as early as after a handful of samples if there is a strong effect present.</p>\n\n<p>Despite this very nice property, I couldn&rsquo;t find <em>any</em> public implementation of this test, so I&rsquo;ve created a node.js implementation of this test, <a href=\"http://github.com/auduno/seglir/\">SeGLiR</a>, which can easily be used in web application A/B testing. I&rsquo;ll give a brief example of usage below, but to give you some idea about the potential savings, I&rsquo;ll first show you a comparison of the needed samplesize for a fixed samplesize test versus the sequential GLR test.</p>\n\n<p>The test I&rsquo;ll compare is a <em>comparison of proportions</em> test, which is commonly used in A/B-testing to compare conversion rates. We compare the tests at the same levels, α-level 0.05 and β-level 0.10, and say that we want to detect a difference between proportions larger than 0.01 (in sequential analysis this is usually called an &ldquo;indifference region&rdquo; of size 0.01). Note that the expected samplesize for the sequential GLR test vary depending on the true proportions p<sub>1</sub> and p<sub>2</sub>, so we compare the samplesize at different true proportions. We&rsquo;ll first look at the case where the expected samplesize for the sequential GLR test is worst, when the proportions are closest to 0.5.</p>\n\n<figure style=\"margin-left:-20px;margin-right:-20px;\"><img src=\"http://auduno.github.io/SeGLiR/images/expected_samplesize_fig1.png\" alt=\"samplesize comparison\"/></figure><p>As you can see, the expected samplesize of the sequential GLR test is much smaller for almost any value of the true difference. The test will stop especially early when there is a large difference between the proportions, so if there is a significant advantage of choosing one of the alternatives, this can be acted upon as early as possible. Let&rsquo;s take a closer look at the expected samplesize when the differences between the true proportions are small.</p>\n\n<figure style=\"margin-left:-20px;margin-right:-20px;\"><img src=\"http://auduno.github.io/SeGLiR/images/expected_samplesize_fig2.png\" alt=\"samplesize comparison\"/></figure><p>The only case where the sample size for the sequential GLR test can be expected to be larger, is when the true difference between p<sub>1</sub> and p<sub>2</sub> is just below 0.01, i.e. the smallest difference we were interested in detecting. However, this is just when the proportions are close to 0.5. What about when p<sub>1</sub> and p<sub>2</sub> are farther from 0.5?</p>\n\n<figure style=\"margin-left:-50px;margin-right:-50px;\"><img src=\"http://auduno.github.io/SeGLiR/images/expected_samplesize_fig3.png\" alt=\"samplesize comparison\"/></figure><p>Actually, as the true p<sub>1</sub> and p<sub>2</sub> get closer to either 0 or 1, the expected samplesize will <em>always</em> be smaller than the fixed samplesize test. Since this is the <em>expected</em> samplesize, to be sure that the test doesn&rsquo;t often require a much higher samplesize, let&rsquo;s also take a look at the more extreme outcomes, for instance the 5th and 95th percentiles (with p<sub>1</sub> and p<sub>2</sub> close to 0.5 as earlier):</p>\n\n<figure style=\"margin-left:-20px;margin-right:-20px;\"><img src=\"http://auduno.github.io/SeGLiR/images/expected_samplesize_fig4.png\" alt=\"samplesize comparison\"/></figure><p>For most of the true differences the samplesize is still lower than the fixed-samplesize test, except for differences below 0.015. A good next question might be if there is a <em>bound</em> to the amount of samples we may have to collect? Actually, there exists a worst-case samplesize for the test, meaning that the test will always conclude before this point. In the example above, the worst-case samplesize, though extremely rare, is at 161103 samples. Note that there is a tradeoff between this worst-case samplesize and the size of the indifference region, which means that a smaller indifference region will lead to a larger worst-case samplesize, and a larger indifference region will lead to a smaller worst-case samplesize.</p>\n\n<p>Given the very nice samplesize properties we&rsquo;ve seen above, it might not come as a surprise that the sequential GLR test has been shown<a href=\"#footnote1\"><sup>[1]</sup></a> to be the optimal test with regards to minimizing samplesize at a given α- and β-level.</p>\n\n<p class=\"footnote\" id=\"footnote1\">[1] <a href=\"http://books.google.no/books?id=zhsbBAAAQBAJ&amp;lpg=PP1&amp;pg=PA254#v=onepage&amp;q&amp;f=false\">Theorem 5.4.1</a> in Tartakovsky et al, Sequential Analysis, CRC Press 2014</p>\n\n<h4>Usage</h4>\n\n<p>You can install <em>SeGLiR</em>, the node.js library I&rsquo;ve implemented for doing these types of tests, via node package manager : `npm install seglir`. Here&rsquo;s an example of how to set up and run a similar sequential GLR test as the one above in node.js.</p>\n\n<pre class=\"prettyprint lang-js\" style=\"margin-bottom:1.7em;overflow-x:scroll;\">\nvar glr = require('seglir')\n// set up an instance of a test, with indifference region of size 0.01,\n//   alpha-level 0.05 and beta-level 0.10\nvar test = glr.test(\"bernoulli\",\"two-sided\",0.01,0.05,0.10)\n</pre>\n\n<p>When setting up any statistical hypothesis test, you need to calculate the test statistic thresholds at which the null-hypothesis or the alternative hypothesis is rejected for a given α- and β-level. Unfortunately, unlike the fixed samplesize tests, there is no analytical way to calculate these thresholds for the sequential GLR test, so SeGLiR will use simulation to find them. This simulation can take some time and doesn&rsquo;t always converge, so I&rsquo;ve added some precalculated thresholds for the most common levels. It probably saves a bit of time to check these precalculated thresholds in the <a href=\"http://auduno.github.io/SeGLiR/documentation/reference.html\">reference</a> before setting up a test.</p>\n\n<p>Add data as it comes in, until the instance returns either &ldquo;true&rdquo; (the null hypothesis was accepted, i.e. there is no difference between the proportions) or &ldquo;false&rdquo; (the alternative hypothesis was accepted, i.e. there is a difference between the proportions).</p>\n\n<pre class=\"prettyprint lang-js\" style=\"margin-bottom:1.7em;overflow-x:scroll;\">\ntest.addData({x:0,y:1})\ntest.addData({x:0})\ntest.addData({y:0})\ntest.addData({x:1,y:0})\n// add more data until the function returns either \"true\" or \"false\"\n</pre>\n\n<p>When the test is done, you can get estimates of the true parameters by estimate():</p>\n\n<pre class=\"prettyprint lang-js\" style=\"margin-bottom:1.7em;\">\ntest.estimate()\n</pre>\n\n<p>To get more details about functions, check out the <a href=\"http://auduno.github.io/SeGLiR/documentation/reference.html\">SeGLiR reference</a>. Try out comparing the fixed samplesize test and the sequential GLR yourself (using SeGLiR) in <a href=\"http://auduno.github.io/SeGLiR/demo/demo.html\">this demo</a>.</p>\n\n<br/><p>To sum up, the sequential GLR test is an alternative to fixed samplesize tests that usually are much faster, at the cost of a large, but rare, worst-case samplesize. Another slight drawback with sequential tests is that post-analysis estimation can be a bit more tricky. I&rsquo;ll elaborate on this in my next post, as well as talk a bit about the solutions I&rsquo;ve implemented in SeGLiR. <a href=\"https://twitter.com/matsiyatzy\">Follow me on twitter</a> if you want to get updates!</p>\n\n<br/><p>If you&rsquo;re interested in a very brief introduction to the mathematical details of the sequential GLR test, take a look at the <a href=\"http://auduno.github.io/SeGLiR/documentation/reference.html\">SeGLiR reference</a>. For a more rigorous mathematical introduction, see these excellent references:</p>\n<ul><li>Tartakovsky, Nikiforov &amp; Basseville : <a href=\"http://www.amazon.com/Sequential-Analysis-Hypothesis-Changepoint-Probability/dp/1439838208\">Sequential Analysis</a>, CRC Press 2014</li>\n\t<li>Bartroff, Lai &amp; Shih : <a href=\"http://www.amazon.com/Sequential-Experimentation-Clinical-Trials-Statistics/dp/1461461138/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1416693815&amp;sr=1-1&amp;keywords=sequential+experimentation+in+clinical+trials\">Sequential Experimentation in Clinical Trials</a>, Springer 2012</li>\n<ul><script>\n\t$(document).ready( function(){\n\t    prettyPrint();\n\t});\n</script></ul></ul>",
  "link": "https://auduno.tumblr.com/post/106141177173",
  "guid": "https://auduno.tumblr.com/post/106141177173",
  "pubDate": "Thu, 25 Dec 2014 14:54:00 +0100"
}