{
  "title": "Did A Ghost Return For The Holidays? | Best Of RGSO",
  "link": "https://audioboom.com/posts/8104770",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1860,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Did the spirit of a deceased father return to a family over the holidays with a message?<br>\nHere is a preview of the story.<br>\n“My dad passed away on Christmas Day, 2015, at 75 years old, I was 47 years old. It was completely unexpected. We shared his favorite holiday with him and at supper time, my older sister was with him preparing supper with my mom and her children. She called and said they called 911, dad, was not breathing. Unfortunately, he passed at 10:30, December 25th, 2015. This was such a devastating time for my mom, Joan, my sisters, Doll & Jay, and my brother Fred. My mom could not manage the stress and pain as she knew that he was going to pass that night and her and I and my brother-in-law, Joe, stayed at the house. All the other family stayed with dad at Royal University Hospital until he passed that evening. Mom, Joe, and I were sitting in the living room and about 10:25 mom said, He's gone. I feel it, he is just passed. The phone rang only minutes later, and yes, dad, had passed. Mom also passed in March of 2019, just heartbreaking for my sisters, my brother and I and our families. We have always been such a close family and honestly, we talk to one another several times a day. I always felt as if dad were with me as I would take him driving with me often and he would often say, \"my girl, slow down, you are driving so fast.\" He always referred to all children and adult children as \"my girl and my boy,” as it was the Metis way. He was always a loving and caring man, not only to us, his children, but to any friend that we had and brought home. Mom and Dad were always ready to feed everyone from our neighborhood. Kids would stop by just to see what mom was cooking! Everyone remembers him as a gentle soul who always treated everyone with respect, love, and true caring. People remember Mom as always welcoming and ready to open the door, her heart, and share her cooking!”<br>\n<br>\n\n</div>\n<div>Watch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\n\n</div>\n<div>If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n<div>\n<br>\n<br>\n\n</div>\n",
  "pubDate": "Sat, 18 Jun 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-06-17:/posts/8104770",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}