{
  "title": "#65/Modernism Week 7: SFMOMA's Jennifer Dunlop Fletcher plus Christiane Robbins + Katherine Lambert",
  "pubDate": "Mon, 18 Jun 2018 07:00:00 +0000",
  "guid": "3eb291fee9a542fcafc204925c2779fe",
  "link": "https://traffic.libsyn.com/secure/usmodernist/USM65.mp3",
  "itunes:image": "",
  "description": "<p>USModernist Radio goes to Palm Springs each February for the incredibly popular Modernism Week.  It’s a fascinating array of sunshine, architecture, lectures, parties, tours, exhibits, and you can even order martinis for breakfast. Yes, you can do that anywhere but you'll feel glamorous in Palm Springs. USModernist Radio's <strong>George Smart</strong> was there with keynote speakers and other special guests who make Modernism Week a blast.<br /> <br /> <strong>Jennifer Dunlop Fletcher</strong> is the Helen Hilton Raiser Curator of Architecture and Design at the San Francisco Museum of Modern Art. She designed exhibits including A. Quincy Jones: Building for Better Living at the Hammer Museum in 2013 and The Utopian Impulse: Buckminster Fuller and The Bay Area in 2012.  Since 2010, she has been building SFMOMA’s Architecture and Design collection.</p> <p><strong>Christiane Robbins,</strong> Professor and Director of USC’s Matrix Program for Digital Media, and <strong>Katherine Lambert,</strong> Professor at the California College of the Arts join George to discuss their new film, <strong>Gregory Ain, the Most Dangerous Architect in America</strong>. With images of FBI surveillance records recently obtained, they explore architect Ain’s career and why J. Edgar Hoover and the FBI watched him and his family for years.</p>",
  "content:encoded": "<p>USModernist Radio goes to Palm Springs each February for the incredibly popular Modernism Week.  It’s a fascinating array of sunshine, architecture, lectures, parties, tours, exhibits, and you can even order martinis for breakfast. Yes, you can do that anywhere but you'll feel glamorous in Palm Springs. USModernist Radio's George Smart was there with keynote speakers and other special guests who make Modernism Week a blast.  Jennifer Dunlop Fletcher is the Helen Hilton Raiser Curator of Architecture and Design at the San Francisco Museum of Modern Art. She designed exhibits including A. Quincy Jones: Building for Better Living at the Hammer Museum in 2013 and The Utopian Impulse: Buckminster Fuller and The Bay Area in 2012.  Since 2010, she has been building SFMOMA’s Architecture and Design collection.</p> <p>Christiane Robbins, Professor and Director of USC’s Matrix Program for Digital Media, and Katherine Lambert, Professor at the California College of the Arts join George to discuss their new film, Gregory Ain, the Most Dangerous Architect in America. With images of FBI surveillance records recently obtained, they explore architect Ain’s career and why J. Edgar Hoover and the FBI watched him and his family for years.</p>",
  "enclosure": "",
  "itunes:duration": "36:17",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "USModernist Radio goes to Palm Springs each February for the incredibly popular Modernism Week.  It’s a fascinating array of sunshine, architecture, lectures, parties, tours, exhibits, and you can even order martinis for breakfast. Yes, you can...",
  "itunes:episodeType": "full",
  "itunes:author": "george smart"
}