{
  "title": "Australia: Flood Response Failed to Protect Most at Risk",
  "link": "https://www.hrw.org/news/2022/11/03/australia-flood-response-failed-protect-most-risk",
  "description": "Click to expand Image\n          \n\n\n\n\n  \n        \n                      \n      \n        Photos from Lismore, Australia, May 2022. (L) During the Lismore flooding, David, a 61-year-old man with a physical disability who uses a wheelchair, was trapped in his house as water entered through the windows. (M) Amanda, a 50-year-old South Lismore resident with a hearing disability, was home alone when the flood waters rapidly rose inside her home. When she tried to call emergency services to be rescued, she couldn’t get through and it was hard for her to hear their pre-recorded messages. (R) Jack Bobbin, 82, was told to evacuate but had no vehicle and was offered no assistance to leave by authorities.\n                    © 2022 Sophie McNeill/Human Rights Watch \n          \n\n  \n<p>(Sydney) – Australian authorities failed to take effective steps to protect those most at risk from foreseeable harm of the catastrophic flooding in the New South Wales (NSW) town of Lismore in February 2022, Human Rights Watch said today. Such extreme weather events are expected to become more frequent as a result of climate change.</p>\n\n<p>Human Rights Watch found that NSW and local authorities did not provide adequate flood warnings, evacuation, or rescue support, leaving older people, people with disabilities, and those who were pregnant facing life-threatening circumstances with little government assistance.</p>\n\n<p>“During the 2022 floods, NSW authorities did not adequately warn or help at-risk people, which led to terrifying and deadly consequences,” said Sophie McNeill, Australia researcher at Human Rights Watch. “Climate change exacerbates inequalities, and the failures seen in Lismore highlight the urgent need for the authorities to ensure inclusive climate action and planning.”</p>\n\n<p>No conclusive evidence currently attributes the 2022 floods to the climate crisis, but the most recent report of the Intergovernmental Panel on Climate Change (IPCC), the world’s leading scientific body on climate change, projects an increase in more extreme rainfall events and flood magnitudes in eastern Australia due to warming temperatures. In addition, the east coast of Australia is likely to face ongoing La Niña weather conditions until early 2023, highlighting the need for Australian authorities to urgently address the needs of at-risk populations during extreme weather events.</p>\n\n<p>As a top greenhouse gas emitter and fossil fuel producer, Australia has a human rights obligation to address climate change by both helping at-risk groups deal with the foreseeable harm of extreme weather events and reducing the global greenhouse gas emissions that are driving them.</p>\n\n<p>In May 2022, Human Rights Watch interviewed 23 survivors of the Lismore flooding, documenting the experiences of older people, people with disabilities, and people who were pregnant. During extreme weather events, people in these circumstances often require assistance and additional time to evacuate, may not have access to warnings, and are frequently not meaningfully included in evacuations and emergency response plans.</p>\n\n<p>The flooding in Lismore peaked at 14.4 meters, 2 meters higher than flooding levels previously recorded. It occurred after intense and sustained rainfall during a wet La Niña weather pattern that broke all existing rainfall records. Four Lismore residents drowned – two women in their 80s and a man and a woman in their 50s – and more than 2,000 homes became uninhabitable.</p>\n\n<p>Stranded community members who were powerless to carry out rescues told Human Rights Watch they had been left distressed and angry by the lack of government assistance.</p>\n\n<p>“I could hear her screaming; she was only three houses down,” said a 63-year-old man whose 82-year-old neighbor drowned. “By the time it was light, and it [the floodwater] was up to the doors, I couldn’t hear her anymore.”</p>\n\n<p>Many residents in low-lying South Lismore woke in the early hours of February 28 to find the only way to survive the rapidly rising floodwater was to climb onto their roof or into their roof cavity. When authorities did not respond to the majority of calls for help, more than 1,000 people were rescued from the floodwaters by community members who put their lives at risk to rescue their neighbors.</p>\n\n<p>The NSW government created an independent inquiry into the 2022 floods that found the risk of such severe weather was not adequately communicated through the State Emergency Service (SES) flood bulletins, on its website and Facebook, and other warning methods, and that many residents did not receive text messages urging them to evacuate.</p>\n\n<p>Out of 15 households interviewed, only two said that emergency services had knocked on their door and advised them to evacuate. But emergency services offered no assistance, leaving families with small children, older people, and people with disabilities unable to leave. Emergency services also failed to answer the desperate calls for rescues from older people, people with disabilities, people who were pregnant, and parents with young children.</p>\n\n<p>Emergency services later told the flood inquiry that they lost up to 3,000 calls for assistance, after their overwhelmed software system turned off.</p>\n\n<p>The flood inquiry found that this led to a “systemic failure” that resulted in the community not having enough time to evacuate, and Lismore residents not understanding how severe the flooding was expected to be.</p>\n\n<p>Emergency services rescued only a few of the people interviewed who needed urgent rescue. As the flood inquiry found, the actions of community members kept the loss of life from being significantly higher.</p>\n\n<p>“I was calling SES, 000, just over and over again,” said Harry Gregg, 24, who risked his life to save a 91-year-old woman. “And no one was picking up and I tell you what, that was the scariest thing ever, when you call 000 and no one answers, you’re like, well I’m truly on my own.”</p>\n\n<p>The NSW SES responded to Human Rights Watch findings, stating that: “During this flood emergency, NSW SES responded in accordance with existing emergency management arrangements. However, an emergency service organisation, we will always be looking out for what we can do better.” Since the Lismore floods, the NSW SES said it had launched a public information campaign in six languages that aims to improve flood safety communication in diverse communities, undertaken a transition to the new nation-wide Australian Warning System to bring the agency in line with a nationally consistent framework for emergency warnings, increased operational capacity through additional training and call-taking capability, and is working proactively with at-risk local communities for flood preparedness and better understanding what they should do if they need to evacuate.</p>\n\n<p>Emergency messaging methods and emergency preparedness and response programs should be inclusive, accessible to everyone, and developed in consultation with people with all types of disability, including physical, sensory, and intellectual. The NSW government should urgently carry out the flood inquiry recommendation to have “clear, consistent and effective messaging prior to and during a disaster to ensure all community members understand the risk in all its dimensions including vulnerability, capacity, exposure and hazard characteristics.”</p>\n\n<p>The NSW government should also ensure that actions and planning developed out of the NSW Climate Change Adaptation Strategy includes consulting with at-risk groups to identify their needs and evaluate effective practices in the state’s adaptation planning. The Australian government should start collecting disaggregated data of people whose deaths are related to climate change, including by age, gender, and disability.</p>\n\n<p>As the global climate crisis intensifies, high emitter and fossil fuel producer countries like Australia have human rights obligations to reduce their emissions, end all new fossil fuel projects, and prepare for foreseeable risks of extreme weather events, in part by ensuring those most at risk are protected.</p>\n\n<p>“With severe climate change impacts expected in the years to come, the Australian government needs to make at-risk groups a priority in their extreme weather response planning,” McNeill said. “At the upcoming UN Climate Change Conference, COP27, Australia should show it’s serious about preventing the worst effects of the climate crisis by announcing an end to new fossil fuel projects and a rapid transition to renewable energy.”</p>\n\n<p>For detailed accounts from Lismore flood survivors and additional information, please see below.</p>\n\n<p>At-Risk Groups</p>\n\n<p>The authorities’ evacuation orders did not adequately consider the needs of at-risk groups. Some older residents said emergency services came to their door at about 8:30 p.m. on February 27 and told them to evacuate by themselves. By then, it was dark, and the rising water was already beginning to block evacuation routes.</p>\n\n<p>Emergency services did not offer older residents, some of whom had difficulty walking, any assistance to evacuate. Expecting some level of flooding, a large number of South Lismore residents had moved their vehicles to higher ground earlier that day, so they had no ability to leave the area, except on foot, after receiving the evacuation order.</p>\n\n<p>The flood inquiry found no evidence of any extraordinary preparation or planning by NSW government agencies in line with the identified heightened risk and likely consequences.</p>\n\n<p>Members of at-risk groups are less likely to have smart phones to access information during disasters. Some residents in their 70s and 80s who did not have access to the latest weather data or warnings said they do not regularly use or possess smart phones, “I only used my mobile for emergencies, and I hadn't quite known how to use it,” said 74-year-old Pat Bobbin.</p>\n\n<p>The authorities’ flood rescue response in Lismore left many at-risk residents, with fewer resources or capabilities to fend for themselves, dangerously close to drowning in their homes.</p>\n\n<p>Residents said that after they received text messages from authorities that flood levels were expected to be around 11 or 12 meters, many went to sleep unconcerned about their safety, believing their home would be above the flood line. However, as those predictions proved inaccurate, they woke to find rapidly rising water inside their homes.</p>\n\n<p>Older People</p>\n\n<p>Marge Graham, 82-Year-Old Woman with a Disability</p>\n\n<p>Marge Graham, 82, was trapped in her home on Casino Street in South Lismore as the flood waters rose. Her friend John Maloney said that he tried calling emergency services for hours when he heard Graham needed an urgent rescue, but he received no response: </p>\n\n\n<p>You couldn't get through. No one was answering. Margie had trouble moving around because she'd had a hip replacement. And so, she was on a four-wheeled wheelie walker. They said that they couldn't get anybody there because there was just too much demand. And their advice was to try and get up on the table. … How can people like my friend Marge, who's over 80, she's on a wheelie walker, get up onto a table? She wasn't physically very well at that time for mobility and especially for climbing on tables or climbing into a manhole.</p>\n\n\n<p>He said emergency services did not reach her house until the following day.</p>\n\n\n<p>The next morning, they'd gone to the house, and she was found floating face down in the water, floating in the bathroom or something. Nowhere near the kitchen table there. I just kept thinking; wish we could have done more to help.</p>\n\n\n<p>Dave, 63, who asked not to use their full name, lived three houses down. He and his wife were trapped inside their roof cavity as the waters rose and heard Graham crying out for help:</p>\n\n\n<p>I could hear her screaming. That’s what really tires my mind out, she was only three houses down. I’m a really good swimmer – I have a bronze medallion – but the current was just too strong, it was rushing between our houses. I saw a cow and a horse get swept past. When it was still chest height, I could hear Marge screaming. By the time it was light, and it was up to the doors, I couldn’t hear her anymore.</p>\n\n\n<p>He said he thinks about her a lot.</p>\n\n\n<p>It makes me so angry. I just can’t work out why they didn’t come rescue her. She had a walking frame; she couldn’t climb anywhere. Where’s the idea that she’ll be okay? Her voice will reverberate through my head for a long time.</p>\n\n\n<p>Woman, 91</p>\n\n<p>Harry Gregg, a 24-year-old South Lismore resident, risked his life to rescue a 91-year-old neighbor who was trapped in rising flood waters, after calls to emergency services went unanswered:</p>\n\n\n<p>It was pretty horrifying. I was calling SES, 000, just over and over again. And no one was picking up and I tell you what, that was the scariest thing ever, when you call 000 and no one answers, you're like, well I'm truly on my own. My next-door neighbor had a blow-up canoe. It's certainly not a rescue device. It's something you take to the beach. I got that. There was an old woman in the house. I couldn't really see her that well because it was dark. So, I went in, she was kind of just in the front hallway and she was screaming, it was up to her neck.</p>\n\n\n<p>Harry managed to pull the woman onto his blow-up canoe, but they nearly both went under.</p>\n\n\n<p>I'm not sure if she panicked or just moved or a combination of the two, but we capsized, she went under, pretty quickly. I jumped in and pulled her up. We both took in quite a bit of water and I was getting a bit worried at that point. I ended up having her in one arm. And I swam about 50 meters to shore. And we both kind of went into shock, started shaking. Everyone in Lismore just put themselves at harm’s risk, try and swim through the water, get on any flotation device that they possibly could to help their neighbors and their community.</p>\n\n\n<p>Pat Bobbin, 74, and Jack Bobbin, 82 </p>\n\n<p>On the evening of February 27, Pat Bobbin, 74, her husband, Jack Bobbin, 82, and their 17-year-old grandson, Sam, were at home in South Lismore. At about 8:30 p.m., a member of emergency services came to their door and told them to evacuate but offered no assistance. It was already dark and some roads were already cut off by rising flood waters. Pat had moved her car to higher ground during the day. She has mobility issues and relies on a walking stick to get around:</p>\n\n\n<p>A chap come around, door knocking and said, \"Evacuate.\" But at that time, if we had evacuated, we wouldn't have got through on the town side. It was bloody dark. And the town side had water … My grandson was going from front door to the back door, sort of thing, and he’s saying to Pop, “It’s coming up the stairs quick! And I thought, “Oh jeez,” because I’ve got crooked legs. Then the next thing the water was coming through the floorboards. I got a chair and I got up onto the kitchen cupboard. And the water, you could see it coming up, up and up. And then when it got up around the legs, you could feel it creeping up your legs.</p>\n\n\n<p>By the early morning, flood waters inside their elevated house on stilts were quickly rising. Emergency services eventually rescued the Bobbins’ just as the water reached over Pat’s shoulders. She says she and Jack would have drowned if it wasn’t for her grandson who had a mobile phone and did not stop trying to reach emergency services, despite many failed attempts to get through:</p>\n\n\n<p>He was better on the phone than anyone. I only used my mobile for emergencies. My daughter upgraded me, and I hadn’t quite learned how to use it, I just used to only have it to make a call and receive a call. But lucky we had Sam there. We wouldn’t have made it out, I don’t think, if he hadn’t been there.</p>\n\n\n<p>Valerie Axtens, 91, and Son Christopher, 53, Who Has a Disability</p>\n\n<p>Emergency services failed to answer the calls of North Lismore resident Laurie Axtens, 57, who feared for the lives of his mother, Valerie, 91, and Christopher, 53, his brother, who has a disability. As the water rose, he was unable to lift them into the roof cavity:</p>\n\n\n<p>I tried to ring them, I couldn’t even get through. I tried to ring 000. And he put me on hold! It was terrifying to be completely honest. I could have gotten into the loft in my house, but I couldn’t get Val or Christopher. If we hadn’t been saved out the window at dawn. … If it was just left to the government response, we were stuffed.</p>\n\n\n<p>People with Disabilities</p>\n\n<p>David, 50, Who Has Multiple Sclerosis</p>\n\n<p>The authorities were very slow to help evacuate a South Lismore resident, David, 50, who has a physical disability and uses a wheelchair. He woke up on February 28 to find himself trapped in his house as water started to come in through his windows:</p>\n\n\n<p>I watched it come up the stairs and it come up the wall to the bottom of the window and within no time flat, it was starting to come in through the window. It was scary. There was myself, my wife, and my eldest son. We’re all sitting and floating around in the water in the bedroom. Every time a boat went past, we were yelling, “We’re stuck! I’m in a wheelchair!” It was up to my belly button, and then it was up to my neck.</p>\n\n\n<p>Emergency services only evacuated David after he had begged for help for hours and the water reached up to his neck:</p>\n\n\n<p>The water was so cold, everything seizes up, and I’d been there three-and-a-half hours. I said, “If you don’t come now, you won’t see me again.” They pulled up in the boat and they dragged me out through the window.</p>\n\n\n<p>Amanda Speers, 50, Who Has a Hearing Disability</p>\n\n<p>South Lismore resident Amanda Speers, 50, who has a hearing disability, was home alone on February 27. Speers said the first and only text message she received from authorities to evacuate came at nearly 1 a.m. on February 28 after it was already impossible to leave safely. She tried to call emergency services to be rescued as the waters rapidly rose inside her home, but she couldn’t get through and it was hard for her to hear their pre-recorded messages:</p>\n\n\n<p>As a hearing-impaired person, I can't hear very well on the phone. You have to have the perfect pitch for me to get you. So, I usually tell people to correspond with me via text message or email, and I will always answer you back. But, phone calls, I don't try to answer phone calls because what's the point? The communication completely breaks down, I can't hear what you're saying.</p>\n\n\n<p>As water began to rise over her shoulders, Speers said she feared for her life:</p>\n\n\n<p>I had hit total panic mode. I couldn't get into the roof, I'm too short, anyway, I've got nine-foot ceilings, what am I going to climb on? I got stuck because I had security screens on the only way out. I rang my parents and said, \"Basically, I'm going to die, and I love you.\" And they were trying to talk to me. I said, \"I can't even hear what you're saying to me.\" I think that's when I surrendered to the fact that I was going to die. And it was a matter of whether I died in my house or I died outside my house trying to escape.</p>\n\n\n<p>Speers feared she wouldn’t even hear anyone who was trying to rescue her:</p>\n\n\n<p>[I was thinking] constantly, what didn't I hear? What have I missed? I was screaming out, [but] no one came near our street. I managed to get the screen door open just enough that I could squeeze through. And that current sucked me, and it sucked me to the corner, and my legs smashed into the railing, and I wrapped my legs around the railing and that's what stopped me getting sucked out in the flood water.</p>\n\n\n<p>After clinging to the gutters outside her veranda, Speers’ neighbor eventually rescued her by pulling her up onto her roof and out of the flood waters.</p>\n\n<p>Webber Family, Including Logan, 19, Who Has Autism</p>\n\n<p>Vickie Webber, 50, was at home in South Lismore the night of the flood with her seven children, including her 19-year-old son, Logan, who has autism and cannot swim. They had not received an evacuation order from the authorities. As the water started coming into the house, her calls to emergency services went unanswered:</p>\n\n\n<p>It [the water] just kept coming up and up and up and I thought, \"Uh-oh something's wrong here.\" We all started ringing for SES and everything like that. SES never came. All our relatives, they were ringing police stations. They were ringing everywhere. They never came. But yeah, he [Logan] didn't understand anything. We sat him up on a ladder so that he didn't get hypothermia in the water.</p>\n\n\n<p>Vickie and her children were eventually rescued from the roof of their carport by community members who had a boat.</p>\n\n<p>People Who Were Pregnant</p>\n\n<p>Jahnaya Mumford, 32</p>\n\n<p>South Lismore resident Jahnaya Mumford, 32, was 38 weeks pregnant the night the flooding started. Like many of her neighbors, she had moved her car to higher ground earlier that day and did not receive an evacuation order from emergency services:</p>\n\n\n<p>I had called my neighbor and I said, \"Oh, what does the tape mean on our mailbox?\" And he said, \"Oh, that actually means that the SES have come and knocked on your door and spoken to you about evacuating.\" I went, \"No one come and knocked on my door. I've been here all night.\" And I had my mum, and the kids, and no one come and knock. The last message I got from SES was [warning the flood would be] 12.5 meters and that was at about midnight. That was the last message I got. And this house is built over that, so I wasn't expecting it to come in how it did. So, we stayed here.</p>\n\n\n<p>Once the water began to quickly rise, Mumford, her mother, and her 13-year-old daughter called emergency services 35 times asking to be rescued. When they eventually got through, they said emergency services told them they were not doing any rescues:</p>\n\n\n<p>My first phone call I think was 3:30 a.m. I said, \"I've got two young kids and I'm 38 weeks pregnant. The water's just about to come inside my top story of my house.\" And they said, \"We aren't doing any rescues till daylight.” We had all been calling Triple Zero and SES every half hour. And by the time it got to our chins, and I was standing on my tippy toes. And still then SES were telling us that they weren't doing any rescues. I was starting to panic; I was worried I was going to go into labor.</p>\n\n\n<p>After hours of waiting, Mumford and her family managed to climb onto their roof where they were eventually rescued by local residents going past in a small boat. She believes the stress of the ordeal led to her needing to be induced four days after the flood:</p>\n\n\n<p>The stress of what I had gone through, that flood just topped it. And I ended up getting a phone call and saying that the ultrasound after the floods showed that my placenta wasn't working, and he wasn't growing. That I needed to be induced. So, four days after the flood, I was in hospital getting induced. So, he was two weeks early.</p>\n\n\n<p>Like many Lismore residents interviewed, Mumford seems traumatized by the experience of the flood and now feels anxious whenever it rains heavily:</p>\n\n\n<p>I actually woke up really early in the morning. And I started getting chest pains because it was just the noise of it. It just was bringing back that being on the roof with the same kind of rain. So, I actually called my psychologist and was like, “I need to talk. I'm starting to panic.” No one actually knows if it's going to flood, or if it's going to rain again, or what's going to happen because they got minimal warning last time.</p>\n\n\n<p>International Standards</p>\n\n<p>Governments have a human rights obligation both to reduce carbon emissions and to address their current and predicted impacts on health. All levels of government should make populations at risk a priority of disaster risk reduction planning and adaptation strategies. They should highlight the effects of flooding on at-risk groups in public health outreach or public awareness efforts on heat and human health, including on websites, posters, and heat advisories for media outlets.</p>\n\n<p>Under the UN Convention on the Rights of Persons with Disabilities, which Australia ratified in 2008, the federal, state, and local governments have obligations to ensure equal rights for people with disabilities, including older people with disabilities, and ensure their protection and safety during natural disasters. The International Covenant on Civil and Political Rights requires governments to protect the right to life, including from foreseeable threats.</p>\n\n<p>The UN has repeatedly advised governments of the need to make their climate action and planning more inclusive. In 2015, the United Nations Office of the High Commissioner for Human Rights outlined in a submission to the UN Climate Change Conference (COP) that: “States must build adaptive capacities in vulnerable [at-risk] communities and devote adequate resources to ensure people’s rights are respected, particularly those facing the greatest risks.”</p>\n\n<p>A UN Human Rights Council report from April 2020 highlighted that people with disabilities are at increased risk of the adverse impacts of climate change. An April 2021 report on climate change and older people warned that adults aged 65 and older are at higher risk of dying during natural hazards.</p>\n\n<p>The 2022 Summary for Policymakers from the Sixth Assessment Report of the IPCC calls upon policymakers to address “context specific inequities such as based on gender, ethnicity, disability, age, location and income” when designing laws, policies, processes and interventions to reduce vulnerabilities and climate risks.”</p>\n\n<p>Extreme Weather Events in Australia</p>\n\n<p>The most recent report of the IPCC, the world’s leading scientific body on climate change, found that Australian land areas have warmed by about 1.4°C since 1910.</p>\n\n<p>There is no current conclusive evidence attributing the intensity or frequency of current flooding events to the climate crisis. However, the IPCC found that extreme rainfall intensity in northern Australia has already been increasing and projects more heavy rainfall in the Australasia region, especially in eastern Australia. Modelling studies also project increases in flooding in northern and eastern Australia in future years.</p>",
  "pubDate": "Thu, 03 Nov 2022 10:00:00 -0400",
  "dc:creator": "Human Rights Watch",
  "guid": "https://www.hrw.org/news/2022/11/03/australia-flood-response-failed-protect-most-risk"
}