{
  "title": "S1E23 - When the Beautiful Olympic Moment is Not What You Expected with Abbey and Jacob Cooper",
  "guid": "https://pinecast.com/guid/a95678ff-1c9b-4ee8-81d1-73cb3252e6df",
  "pubDate": "Tue, 10 Nov 2020 07:30:00 -0000",
  "itunes:duration": "00:58:03",
  "description": "<p>Laura’s guests on the podcast today are Olympic runner, Abbey Cooper, and her sport psychologist husband, Jacob. Abbey’s impressive college career includes being seven-time national champion, 16-time Ivy League champion and 12-time All-American. In 2012, she became the first Dartmouth woman to win a national title, and in 2013 she became the first Ivy League student-athlete to win the cross-country title. Currently running for New Balance and pursuing the Tokyo Olympics, Abbey is perhaps best known for her inspiring performance at the 2016 Rio Olympics, which she describes in full here today. Highly talented in his own right, Jacob was a scholarship athlete and four-year starter on the football team at Taylor University. This experience led to his interest in the field of sport psychology, and currently, he is the Director of Sport Psychology Services at Appalachian State University and a member of the Mental Health Registry of the USOPC.</p>\n<p>Their conversation with Laura today explores not only their story in sport and in their personal relationship, but also of their unwavering faith, and the role that God plays in their lives. Along the way, they touch on Abbey’s experience at Dartmouth and the beginning of her faith journey, God’s grace in her life, His transformation of Jacob’s heart, and how He has taught them lessons about hardship, suffering, and what really matters through His ministry to them. Of course, Abbey’s historic and inspiring performance at the 2016 Olympics is recounted from both of their perspectives, and they also share details of their unique dynamic, what the past four years have been like, what they’ve been working on during the pandemic, and the dream that they have for helping other athletes. Having been through so much, and having faced it all together, supported by the power of their faith, Abbey and Jacob have many lessons to teach about making meaning out of experiences, and they do precisely that here today with extraordinary grace, humility, and sincerity.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>Abbey’s experience at Dartmouth</li>\n<li>The beginning of her faith journey and her transitional moment</li>\n<li>God’s grace in her life</li>\n<li>Jacob’s athletic experience</li>\n<li>God’s transformation of his heart</li>\n<li>Jacob’s transition into sports psychology</li>\n<li>How Abbey and Jacob’s relationship started and built</li>\n<li>Abbey’s 2016 Olympic experience, and how God prepared her for the moment</li>\n<li>Jacob’s perspective of it</li>\n<li>God shifting Abbey’s perspective on the meaning of hardship</li>\n<li>What really matters</li>\n<li>How God ministers back to us</li>\n<li>What their past four years have been like</li>\n<li>The dynamic between Abbey and Jacob</li>\n<li>What they’ve worked on during the pandemic and Tokyo Games postponement</li>\n<li>Understanding the purpose of suffering</li>\n<li>The importance of acknowledging grief</li>\n<li>The unique fulfillment of inspiring and lifting other people up</li>\n<li>Jacob and Abbey’s dream to help other athletes rehabilitate their relationship with sport</li>\n<li><a href=\"http://runningwithheart.org\" rel=\"nofollow\">runningwithheart.org</a> (coming soon)</li>\n</ul>\n<p>Quotes:</p>\n<p>“God had other plans.”</p>\n<p>“I wouldn’t go back and change it, because it really brought me to the end of myself, and introduced me to this need for the Lord in my life.”</p>\n<p>“It was the peace He gave you inside.”</p>\n<p>“It was definitely a pretty humbling and arduous path from there that God really used to kind of transform my life.”</p>\n<p>“It was this gift to glorify Him.”</p>\n<p>“Luckily, God surrounded me with great friends, coaching, and mentors that helped me make meaning of my experience.”</p>\n<p>“It was the fastest mile of my life, and probably the slowest of Abbey’s.”</p>\n<p>“It was like God’s hand was over the whole thing.”</p>\n<p>“I know that I’m here for a reason, but none of this makes sense.”</p>\n<p>“That is so unnatural to me to respond in a way that isn’t selfish that I am so sure that it was just the Holy Spirit.”</p>\n<p>“Abbey tried to get up like two or three times and run, and just kind of collapsed.”</p>\n<p>“It was one of the most memorable and uplifting stories of the 2016 Olympic Games in Rio.”</p>\n<p>“Now to him who is able.”</p>\n<p>“When I crossed the finish line, I was already so amazed by what God had done.”</p>\n<p>“Lord, bless me with wisdom, bless me with humility, and bless me with a godly wife someday…He gave me all three combined into one.”</p>\n<p>“God’s given me a lot of hardship to walk through, and so I’ve picked up a few things along the way about what’s helped me.”</p>\n<p>“I hope and pray athletes will feel less alone in their struggles.”</p>\n<p>Links:</p>\n<p>The Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a>\nMental Training:   <a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">https://www.laurawilkinson.com/learn </a>\nLaura’s Social Media:\nInstagram: <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">https://www.instagram.com/lala_the_diver</a><br>\nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">https://www.facebook.com/TheLauraWilkinson</a></p>\n<p>Connect with Abbey and Jacob:</p>\n<p>Running With Heart homepage (coming soon):   <a href=\"https://www.runningwithheart.org/\" rel=\"nofollow\">https://www.runningwithheart.org/</a>\nAbbey’s instagram:   <a href=\"https://www.instagram.com/abbey_dags/\" rel=\"nofollow\">https://www.instagram.com/abbey_dags/</a></p>",
  "itunes:title": "When the Beautiful Olympic Moment is Not What You Expected with Abbey and Jacob Cooper",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 23
}