{
  "title": "Episode 66: &#8220;Great Balls of Fire&#8221; by Jerry Lee Lewis",
  "link": "https://500songs.com/podcast/episode-66-great-balls-of-fire-by-jerry-lee-lewis/",
  "pubDate": "Mon, 20 Jan 2020 17:55:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=531",
  "description": "<p>Episode sixty-six of<em> A History of Rock Music in Five Hundred Songs</em> looks at \"Great Balls of Fire\" by Jerry Lee Lewis. Click the full post to read liner notes, links to more information, and a transcript of the episode. This one comes with a bit of a content warning, as while it has nothing explicit, it deals with his marriage to his thirteen-year-old cousin.</p>\n<p>Patreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/33298565\">on \"Rumble\" by Link Wray</a>.</p>\n<p><strong>Resources</strong></p>\n<p>As always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-66-great-balls-of-fire/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode (with one exception, which I mention in the podcast).</p>\n<p><a href=\"https://amzn.to/2NJF8gh\"><em>The Spark That Survived</em> by Myra Lewis Williams</a> is Myra's autobiography, and tells her side of the story, which has tended to be ignored in favour of her famous husband's side.</p>\n<p>I'm relying heavily <a href=\"https://amzn.to/2VDGeeo\">on <em>Sam Phillips: the Man Who Invented Rock and Roll</em> by Peter Guralnick</a> for all the episodes dealing with Phillips and Sun Records.</p>\n<p>Books on Jerry Lee Lewis tend to be very flawed, as the authors all tend to think they're Faulkner rather than giving the facts. <a href=\"https://amzn.to/2IImoLJ\">This one by Rick Bragg</a> is better than most.</p>\n<p>There are many budget CDs containing Lewis' pre-1962 work. <a href=\"https://amzn.to/2OFartv\">This set</a> seems as good an option as any.</p>\n<p>And <a href=\"https://amzn.to/30CBvh8\">this ten-CD box set</a> contains ninety Sun singles in chronological order, starting with \"Whole Lotta Shakin'\" and covering the Jerry Lee Lewis, Johnny Cash, and Carl Perkins records discussed here. There are few better ways to get an idea of Lewis' work in context.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them</a>?</p>\n<p><strong>Erratum:</strong></p>\n<p>I say “Glad All Over” was written by Aaron Schroeder. In fact it was co-written by Schroeder, Roy Bennett, and Sid Tepper.</p>\n<p><strong>Transcript</strong></p>\n<p>We've looked before at the rise of Jerry Lee Lewis, but in this episode we're going to talk about his fall. And for that reason I have to put a content warning at the beginning here. While I'm not going to say anything explicit at all, this episode has to deal with events that I, and most of my listeners, would refer to as child sexual abuse, though the child in question still, more than sixty years later, doesn't see them that way, and I don't want to say anything that imposes my framing over hers. If you might find this subject distressing, I suggest reading the transcript before listening, or just skipping this episode. It also deals, towards the end, with domestic violence.</p>\n<p>Indeed, if you're affected by these issues, I would also suggest skipping the next episode, on \"Johnny B. Goode\", and coming back on February the second for \"Yakety Yak\" by the Coasters. We're hitting a point in the history of rock and roll where, for the first time, rock and roll begins its decline in popularity. We'll see from this point on that every few years there's a change in musical fashions, and a new set of artists take over from the most popular artists of the previous period. And in the case of the first rock and roll era, that takeover was largely traumatic. There were a number of deaths, some prosecutions -- and in the case of Jerry Lee Lewis and Chuck Berry, scandals.</p>\n<p>In general, I try not to make these podcast episodes be about the horrific acts that some of the men involved have committed. This is a podcast about music, not about horrible men doing horrible things. But in the case of Jerry Lee Lewis, he was one of the very small number of men to have actually faced consequences for his actions, and so it has to be discussed. I promise I will try to do so as sensitively as possible.</p>\n<p>Although sensitivity is not the word that comes to mind when one thinks of Jerry Lee Lewis, generally...</p>\n<p>[Excerpt: Jerry Lee Lewis, \"Great Balls of Fire\"]</p>\n<p>When we left Jerry Lee Lewis, he had just had his first really major success, with \"Whole Lotta Shakin'\". He was on top of the world, and the most promising artist in rock and roll music. With Elvis about to be drafted into the army, the role of biggest rock and roll star was wide open, and Lewis intended to take over Elvis' mantle. There was going to be a new king of rock and roll.</p>\n<p>It didn't quite work out that way.</p>\n<p>\"Whole Lotta Shakin'\" was such a massive hit that on the basis of that one record, Jerry Lee was invited to perform his next single in a film called Jamboree.</p>\n<p>This was one of the many exploitation films that were being put out starring popular DJs -- this one starred Dick Clark, rather than Alan Freed, who'd appeared in most of them. They were the kind of thing that made Elvis' films look like masterpieces of the cinema, and tended to involve a bunch of kids who wanted to put a dance on at their local school, or similar interchangeable plots. The reason people went to see them wasn't the plot, but the performances by rock and roll musicians.</p>\n<p>Fats Domino was in most of these, and he was in this one, singing his minor single \"Wait and See\". There were also a few performances by musicians who weren't strictly rock and roll, and were from an older generation, but who were close enough that the kids would probably accept them. Slim Whitman appeared, as did Count Basie, with Joe Williams as lead vocalist:…</p>\n<p>[Excerpt: Joe Williams, \"I Don't Like You No More\"]</p>\n<p>The film also featured the only known footage of Lewis Lymon and the Teenchords, who we talked about briefly last week. More pertinently to this story, it featured Carl Perkins:</p>\n<p>[Excerpt: Carl Perkins, \"Glad All Over\"]</p>\n<p>That song was one of the few that Perkins recorded which wasn't written by him. Instead, it was written by Aaron Schroeder, who had co-written the non-Leiber-and-Stoller songs for Jailhouse Rock, and who also appeared in this film in a cameo role as himself. The song was provided to Sam Phillips by Hill and Range, who were Phillips' publishing partners as well as being Elvis'.</p>\n<p>It was to be Carl Perkins' last record for Sun -- Perkins had finally had enough of Sam Phillips being more interested in Jerry Lee Lewis. Even little things were getting to him -- Jerry Lee's records were credited to \"Jerry Lee Lewis and his Pumping Piano\". Why did Carl's records never say anything about Carl's guitar?</p>\n<p>Sam promised him that the records would start to credit Carl Perkins as \"the rocking guitar man\", but it was too late -- Perkins and Johnny Cash both made an agreement with Columbia Records on November the first 1957 that when their current contracts with Sun expired, they'd start recording for the new label.</p>\n<p>Cash was in a similar situation to Perkins -- Jack Clement had now taken over production of Cash's records, and while Cash was writing some of his best material, songs like \"Big River\" that remain classics, Clement was making him record songs Clement had written himself, like \"Ballad of a Teenage Queen\":</p>\n<p>[Excerpt: Johnny Cash, \"Ballad of a Teenage Queen\"]</p>\n<p>It's quite easy to see from that, which he recorded in mid-November, why Cash left Sun.</p>\n<p>While Cash would go on to have greater success at Columbia, Perkins wouldn't. And ironically it was possible that he had had one more opportunity to have a hit follow-up to \"Blue Suede Shoes\" at Sun, and he'd passed on it.</p>\n<p>According to Perkins, he was given a choice of two songs to perform in Jamboree, both of them published by Hill and Range, but \"I thought both of them was junk!\" and he'd chosen the one that was slightly less awful -- that's not how other people involved remember it, but he would always claim that he had been offered the song that Jerry Lee Lewis performed, and turned down \"Great Balls of Fire\":</p>\n<p>[Excerpt: Jerry Lee Lewis, \"Great Balls of Fire\"]</p>\n<p>That song was one that both Lewis and Phillips were immediately convinced would be a hit as soon as they heard the demo. Sam Phillips' main worry was how they were going to improve on the demo by the song's writer, Otis Blackwell, which he thought was pretty much perfect as it was.</p>\n<p>We've met Otis Blackwell briefly before -- he was a New York-based songwriter, one of a relatively small number of black people who managed to get work as a professional songwriter for one of the big publishing companies. Blackwell had written \"Fever\" for Little Willie John, \"You're the Apple of My Eye\" for Frankie Valli, and two massive hits for Elvis -- \"Don't Be Cruel\" and \"All Shook Up\". We don't have access to his demo of \"Great Balls of Fire\", but in the seventies he recorded an album called \"These are My Songs\", featuring many of the hits he'd written for other people, and it's possible that the version of \"Great Balls of Fire\" on that album gives some idea of what the demo that so impressed Phillips sounded like:</p>\n<p>[Excerpt: Otis Blackwell, \"Great Balls of Fire\"]</p>\n<p>\"Great Balls of Fire\" seems to be the first thing to have been tailored specifically for the persona that Lewis had created with his previous hit. It's a refinement of the \"Whole Lotta Shakin'\" formula, but it has a few differences that give the song far more impact.</p>\n<p>Most notably, where \"Whole Lotta Shakin'\" starts off with a gently rolling piano intro and only later picks up steam:</p>\n<p>[Excerpt: Jerry Lee Lewis, \"Whole Lotta Shakin'\"]</p>\n<p>\"Great Balls of Fire\" has a much more dynamic opening -- one that sets the tone for the whole record with its stop-start exclamations:</p>\n<p>[Excerpt: Jerry Lee Lewis, \"Great Balls of Fire\"]</p>\n<p>Although that stop-start intro is one of the few signs in the record that point to the song having been possibly offered to Perkins -- it's very reminiscent of the intro to \"Blue Suede Shoes\":</p>\n<p>[Excerpt: Carl Perkins, \"Blue Suede Shoes\"]</p>\n<p>I could imagine Perkins recording the song in the \"Blue Suede Shoes\" manner and having a hit with it, though not as big a hit as Lewis eventually had. On the other hand I can't imagine Lewis turning \"Glad All Over\", fun as it is, into anything even remotely worthy of following up \"Whole Lotta Shakin'\".</p>\n<p>Almost straight away they managed to cut a version of \"Great Balls of Fire\" that was suitable for the film, but it wasn't right for a hit record. They needed something that was absolutely perfect. After having sent the film version off, they spent several days working on getting the perfect version cut -- paying particular attention to that stop-start intro, which the musicians had to time perfectly for it not to come out as a sloppy mess.</p>\n<p>Oddly, the musicians on the track weren't the normal Sun session players, and nor were they the musicians who normally played in Lewis' band. Instead, Lewis was backed by Sidney Stokes on bass and Larry Linn on drums -- according to Lewis, he never met those two people again after they finished recording.</p>\n<p>But as the work proceeded, Jerry Lee became concerned. \"Great Balls of Fire\"? Didn't that sound a bit... Satanic? And people did say that rock and roll was the Devil's music.</p>\n<p>He ended up getting into an angry, rambling, theological discussion with Sam Phillips, which was recorded and which gives an insight into how difficult Lewis must have been to work with, but also how tortured he was -- he truly believed in the existence of a physical Hell, and that he was destined to go there because of his music:</p>\n<p>[Excerpt: Jerry Lee Lewis and Sam Phillips, Bible discussion]</p>\n<p>Sam Phillips, who appears to have had the patience of a saint, eventually talked Lewis down and persuaded him to get back to making music.</p>\n<p>When \"Great Balls of Fire\" came out, with a cover of Hank Williams' ballad \"You Win Again\" on the B-side, it was an immediate success. It sold over a million copies in the first ten days it was out, and it became a classic that has been covered by everyone from Dolly Parton to Aerosmith. It's one of the records that defines 1950s rock and roll music, and it firmly established Jerry Lee Lewis as one of the greatest stars of rock and roll, if not the greatest.</p>\n<p>Jack and Sam kept recording everything they could from Lewis, getting a backlog of recordings that would be released for decades to come -- everything from Hank Williams covers to the old blues number \"Big Legged Woman\":</p>\n<p>[Excerpt: Jerry Lee Lewis, \"Big Legged Woman\"]</p>\n<p>But they decided that they didn't want to mess with a winning formula, and so the next record that they put out was another Otis Blackwell song, \"Breathless\".</p>\n<p>This time, the band was the normal Sun studio drummer Jimmy Van Eaton, Billy Lee Riley on guitar -- Riley was also furious with Sam Phillips for the way he was concentrating on Lewis' career at the expense of everyone else's, but he was still working on sessions for Phillips -- and Jerry Lee's cousin J.W. Brown on bass. J.W. was his full name -- it didn't stand for anything -- and he was the regular touring bass player in Lewis' band.</p>\n<p>\"Breathless\" was very much in the same style as \"Great Balls of Fire\", if perhaps not *quite* so good:</p>\n<p>[Excerpt: Jerry Lee Lewis, \"Breathless\"]</p>\n<p>To promote the record, Jud Phillips, Sam's brother, came up with a great promotional scheme. Dick Clark, the presenter of American Bandstand, had another show, the Dick Clark Show, which was also called Dick Clark's Saturday Night Beechnut Show because it was sponsored by Beechnut chewing gum. Clark had already had Jerry Lee on his show once, and he'd been a hit -- Clark could bring him back on the show, and they could announce that if you sent Sun Records five Beechnut wrappers and fifty cents for postage and packing, you could get a signed copy of the new record. The fifty cents would be more than the postage and packing would cost, of course, and Sun would split the profits with Dick Clark.</p>\n<p>Sun bought an autograph stamp to stamp copies of the record with, hired a few extra temporary staff members to help them get the records posted, and made the arrangements with Dick Clark and his sponsors. The result was extraordinary -- in some parts of the country, stores ran out of Beechnut gum altogether. More than thirty-eight thousand copies of the single were sent out to eager gum-chewers.</p>\n<p>It was around this time that Jerry Lee went on the Alan Freed tour that we mentioned last week, with Chuck Berry, Buddy Holly, Larry Williams, the Chantels, and eleven other acts. The tour later became legendary not so much for the music -- though that was great -- but for the personal disputes between Lewis and Berry.</p>\n<p>There were two separate issues at stake. The first was Elmo Lewis, Jerry's father. Elmo had a habit of using racial slurs, and of threatening to fight anyone, especially black people, who he thought was disrespecting him. At one show on the tour, a dispute about parking spaces between Berry and Lewis led to the elder Lewis chasing Berry three blocks, waving a knife, and shouting \"You know what we do with cats like you down in Ferriday? We chop the heads off them and throw it in a lake.\"</p>\n<p>Apparently, by the next day, Elmo and Chuck were sat with each other at breakfast, the best of friends.</p>\n<p>The other issue was Berry's belief that he, rather than Lewis, should be headlining the shows. He managed to persuade the promoters of this, and this led Lewis to try more and more outrageous stunts on stage to try to upstage Berry. The legend has it that at one show he went so far as to set his piano on fire at the climax of \"Great Balls of Fire\", and then walk off stage challenging Berry to follow that.</p>\n<p>Some versions of the story have him using a racial slur there, too, but the story in whatever form seems to be apocryphal. It does, though, sum up the atmosphere between the two.</p>\n<p>That said, while Lewis and Berry fought incessantly, Berry was one of the few people to whom Lewis has ever shown any respect at all. Partly that's because of Lewis' admiration for Berry's songwriting -- he's called Berry \"the Hank Williams of rock and roll\" before now, and for someone who admires Williams as much as Lewis does that's about the highest imaginable praise. But also, Lewis and his father were both always very careful not to do anything that would lead to word of the feud getting back to his mother, because his mother had repeatedly told him that Chuck Berry was the greatest rock and roller in the world -- Elvis was good, she said, and obviously so was her son, but neither of them were a patch on Chuck. She would have been furious with him, and would definitely have taken Chuck's side.</p>\n<p>After the tour, Jerry Lee recorded another song for a film he was going to appear in. This time, it was the title song for a terribly shlocky attempt at drama, called High School Confidential -- a film that dealt with the very serious and weighty issue of marijuana use among teenagers, and is widely regarded as one of the worst films ever made. The theme music, though, was pretty good:</p>\n<p>[Excerpt: Jerry Lee Lewis, \"High School Confidential\"]</p>\n<p>That came out on the nineteenth of May, 1958, and immediately started rising up the charts. Two days later, Jerry Lee headed out on what was meant to be a triumphal tour of the UK, solidifying him as the biggest, most important, rock and roll star in the world.</p>\n<p>And that is when everything came crashing down. Because it was when he and his entourage landed in the UK, and the press saw the thirteen-year-old girl with him, and asked who she was, that it became public knowledge he had married his thirteen-year-old cousin Myra.</p>\n<p>And here we get to something I've been dreading talking about since I decided on this project. There is simply no way to talk about Jerry Lee Lewis' marriage to Myra Gale Brown which doesn't erase Brown's experience, doesn't excuse Lewis' behaviour, explains the cultural context in which it happened, and doesn't minimise child abuse -- which, and let's be clear about this right now, this was.</p>\n<p>If you take from *anything* that I say after this that I think there is any possible excuse, any justification, for a man in his twenties having sex with a thirteen-year-old girl -- let alone a thirteen-year-old girl in his own family, to whom he was an authority figure -- then I have *badly* failed to get my meaning across. What Lewis did was, simply, wrong.</p>\n<p>It's important to say that, because something that applies both to this episode and to the downfall of Chuck Berry, which we'll be looking at in the next episode, is the way that both have been framed by all the traditional histories of rock and roll. If you read almost anything about rock and roll history, what you see when it gets to 1958 is \"and here rock and roll nearly died, because of the prurient attitudes of a few prudes, who were out to destroy the careers of these new exciting rock and rollers because they hated the threat they posed to their traditional way of life\".</p>\n<p>That is simply not the case. Yes, there was a great deal of establishment opposition to rock and roll music, but what happened to Jerry Lee Lewis wasn't some conspiracy of blue-nosed prudes. It was people getting angry, for entirely understandable reasons, about a man doing something that was absolutely, unquestionably, just *wrong*.</p>\n<p>And the fact that this has been minimised by rock and roll histories says a lot about the culture around rock journalism, none of it good.</p>\n<p>Now, that said, something that needs to be understood here is that Lewis and most of the people round him didn't see him as doing anything particularly wrong. In the culture of the Southern US at the time, it was normal for very young girls to be married, often to older men. By his own lights, he was doing nothing wrong. His first marriage was when he was sixteen -- Myra was his third wife, and he was still legally married to his second when he married her -- and his own younger sister had recently got married, aged twelve.</p>\n<p>Likewise, marrying one's cousin was the norm within Jerry Lee's extended family, where pretty much everyone whose surname was Lewis, Swaggart, or Gilley was married to someone else whose surname was Lewis, Swaggart, or Gilley.</p>\n<p>But I don't believe we have to judge people by their own standards, or at least not wholly so. There were many other horrific aspects to the culture of the Southern states at the time, and just because, for example, the people who defended segregation believed they were doing nothing wrong and were behaving according to their own culture, doesn't mean we can't judge them harshly.</p>\n<p>And it's not as if everyone in Jerry Lee's own culture was completely accepting of this. They'd married in secret, and when Myra's father -- Jerry Lee's cousin and bass player, J.W. Brown -- found out about it, he grabbed his shotgun and went out with every intention of murdering Jerry Lee, and it was only Sam Phillips who persuaded him that maybe that would be a bad idea.</p>\n<p>The British tour, which was meant to last six weeks, ended up lasting only three days. Jerry Lee and his band and family cancelled the tour and returned home, where they expected everyone to accept them again, and for things to carry on as normal. They didn't.</p>\n<p>The record company tried to capitalise on the controversy, and also to defuse the anger towards Lewis. At the time, there was a craze for novelty records which interpolated bits of spoken word dialogue with excerpts of rock and roll hits, sparked off by a record called \"The Flying Saucer\":</p>\n<p>[Excerpt: Buchanan and Goodman, \"The Flying Saucer\"]</p>\n<p>Jack Clement put together a similar thing, as a joke for the Sun Records staff, called \"The Return of Jerry Lee\", having an interviewer, the DJ George Klein, ask Jerry Lee questions about the recent controversy, and having Jerry Lee \"answer\" them in clips from his records. Sam Phillips loved it, and insisted on releasing it as a single.</p>\n<p>[Excerpt: George and Louis, \"The Return of Jerry Lee\"]</p>\n<p>Unsurprisingly, that did not have the effect that was hoped, and did not defuse the situation one iota -- especially since some of the jokes in the record were leering ones about Myra's physical attractiveness -- the attractiveness, remember, of a child. For that reason, I will *not* be putting the full version of that particular track in the Mixcloud mix of songs I excerpted in this episode.</p>\n<p>This is where we say goodbye to Sam Phillips. With Jerry Lee Lewis' career destroyed, and with all his other major acts having left him, Phillips' brief reign as the most important record producer and company owner in the USA was over. He carried on running Sun records for a few years, and eventually sold it to Shelby Singleton. Singleton is a complicated figure, but one thing he definitely did right was exploiting Sun's back catalogue -- in their four-year rockabilly heyday Sam Phillips and Jack Clement had recorded literally thousands of unreleased songs by Jerry Lee Lewis, Johnny Cash, Roy Orbison, Carl Perkins, Conway Twitty, Charlie Rich, Billy Lee Riley, and many more.</p>\n<p>Those tracks sat in Sun's vaults for more than a decade, but once Singleton took over the company pretty much every scrap of material from Sun's vaults saw release, especially once a British reissue label called Charly employed Martin Hawkins and Colin Escott, two young music obsessives, to put out systematic releases of Sun's rockabilly and blues archives.</p>\n<p>The more of that material came out, the more obvious it became that Sam Phillips had tapped into something very, very special at Sun Records, and that throughout the fifties one small studio in Memphis had produced staggering recordings on a daily basis. By the time Sam Phillips died, in 2003, aged eighty, he was widely regarded as one of the most important people in the history of music.</p>\n<p>Jerry Lee Lewis, meanwhile, spent several years trying and failing to have a hit, but slowly rebuilding his live audiences, playing small venues and winning back his audience one crowd at a time. By the late 1960s he was in a position to have a comeback, and \"Another Place, Another Time\" went to number four on the country charts, and started a run of country hits that lasted for the best part of a decade:</p>\n<p>[Excerpt: Jerry Lee Lewis, \"Another Place, Another Time\"]</p>\n<p>Myra divorced Jerry Lee around that time, citing physical and emotional abuse. She is now known as Myra Williams, has been happily married for thirty-six years, and works as a real-estate agent.</p>\n<p>Jerry Lee has, so far, married four more times. His fourth and fifth wives died in mysterious circumstances -- his fourth drowned shortly before the divorce went through, and the fifth died in circumstances that are still unclear, and several have raised suspicions that Jerry Lee killed her. It's not impossible. The man known as the Killer did once shoot his bass player in the chest in the late seventies -- he insists that was an accident -- and was arrested outside Graceland, drunk and with a gun, yelling for Elvis Presley to come out and settle who was the real king.</p>\n<p>Jerry Lee Lewis is still alive, married to his seventh wife, who is Myra's brother's ex-wife. Last year, he and his wife sued his daughter, though the lawsuit was thrown out of court. He's eighty-four years old, still performs, and according to recent interviews, worries if he is going to go to Heaven or to Hell when he dies. I imagine I would worry too, in his place.</p>",
  "itunes:subtitle": "Episode sixty-six of A History of Rock Music in Five Hundred Songs looks at Great Balls of Fire by Jerry Lee Lewis. Click the full post to read liner notes, links to more information, and a transcript of the episode. This one comes with a bit of a conten",
  "itunes:keywords": "Aaron Schroeder,Alan Freed,Billy Lee Riley,Buchanan and Goodman,Carl Perkins,country and western,Dick Clark,Hill and Range publishing,Jack Clement,Jerry Lee Lewis,Jimmy van Eaton,Jud Phillips,Otis Blackwell,rockabilly,Sam Phillips,sex scandals,Shelby Singleton,Sun Records",
  "itunes:episodeType": "full",
  "itunes:episode": 66,
  "content:encoded": "<p>Episode sixty-six of<em> A History of Rock Music in Five Hundred Songs</em> looks at \"Great Balls of Fire\" by Jerry Lee Lewis. Click the full post to read liner notes, links to more information, and a transcript of the episode. This one comes with a bit of a content warning, as while it has nothing explicit, it deals with his marriage to his thirteen-year-old cousin.</p>\n<p>Patreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/33298565\">on \"Rumble\" by Link Wray</a>.</p>\n<p><strong>Resources</strong></p>\n<p>As always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-66-great-balls-of-fire/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode (with one exception, which I mention in the podcast).</p>\n<p><a href=\"https://amzn.to/2NJF8gh\"><em>The Spark That Survived</em> by Myra Lewis Williams</a> is Myra's autobiography, and tells her side of the story, which has tended to be ignored in favour of her famous husband's side.</p>\n<p>I'm relying heavily <a href=\"https://amzn.to/2VDGeeo\">on <em>Sam Phillips: the Man Who Invented Rock and Roll</em> by Peter Guralnick</a> for all the episodes dealing with Phillips and Sun Records.</p>\n<p>Books on Jerry Lee Lewis tend to be very flawed, as the authors all tend to think they're Faulkner rather than giving the facts. <a href=\"https://amzn.to/2IImoLJ\">This one by Rick Bragg</a> is better than most.</p>\n<p>There are many budget CDs containing Lewis' pre-1962 work. <a href=\"https://amzn.to/2OFartv\">This set</a> seems as good an option as any.</p>\n<p>And <a href=\"https://amzn.to/30CBvh8\">this ten-CD box set</a> contains ninety Sun singles in chronological order, starting with \"Whole Lotta Shakin'\" and covering the Jerry Lee Lewis, Johnny Cash, and Carl Perkins records discussed here. There are few better ways to get an idea of Lewis' work in context.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them</a>?</p>\n<p><strong>Erratum:</strong></p>\n<p>I say “Glad All Over” was written by Aaron Schroeder. In fact it was co-written by Schroeder, Roy Bennett, and Sid Tepper.</p>\n<p><strong>Transcript</strong></p>\n<p>We've looked before at the rise of Jerry Lee Lewis, but in this episode we're going to talk about his fall. And for that reason I have to put a content warning at the beginning here. While I'm not going to say anything explicit at all, this episode has to deal with events that I, and most of my listeners, would refer to as child sexual abuse, though the child in question still, more than sixty years later, doesn't see them that way, and I don't want to say anything that imposes my framing over hers. If you might find this subject distressing, I suggest reading the transcript before listening, or just skipping this episode. It also deals, towards the end, with domestic violence.</p>\n<p>Indeed, if you're affected by these issues, I would also suggest skipping the next episode, on \"Johnny B. Goode\", and coming back on February the second for \"Yakety Yak\" by the Coasters. We're hitting a point in the history of rock and roll where, for the first time, rock and roll begins its decline in popularity. We'll see from this point on that every few years there's a change in musical fashions, and a new set of artists take over from the most popular artists of the previous period. And in the case of the first rock and roll era, that takeover was largely traumatic. There were a number of deaths, some prosecutions -- and in the case of Jerry Lee Lewis and Chuck Berry, scandals.</p>\n<p>In general, I try not to make these podcast episodes be about the horrific acts that some of the men involved have committed. This is a podcast about music, not about horrible men doing horrible things. But in the case of Jerry Lee Lewis, he was one of the very small number of men to have actually faced consequences for his actions, and so it has to be discussed. I promise I will try to do so as sensitively as possible.</p>\n<p>Although sensitivity is not the word that comes to mind when one thinks of Jerry Lee Lewis, generally...</p>\n<p>[Excerpt: Jerry Lee Lewis, \"Great Balls of Fire\"]</p>\n<p>When we left Jerry Lee Lewis, he had just had his first really major success, with \"Whole Lotta Shakin'\". He was on top of the world, and the most promising artist in rock and roll music. With Elvis about to be drafted into the army, the role of biggest rock and roll star was wide open, and Lewis intended to take over Elvis' mantle. There was going to be a new king of rock and roll.</p>\n<p>It didn't quite work out that way.</p>\n<p>\"Whole Lotta Shakin'\" was such a massive hit that on the basis of that one record, Jerry Lee was invited to perform his next single in a film called Jamboree.</p>\n<p>This was one of the many exploitation films that were being put out starring popular DJs -- this one starred Dick Clark, rather than Alan Freed, who'd appeared in most of them. They were the kind of thing that made Elvis' films look like masterpieces of the cinema, and tended to involve a bunch of kids who wanted to put a dance on at their local school, or similar interchangeable plots. The reason people went to see them wasn't the plot, but the performances by rock and roll musicians.</p>\n<p>Fats Domino was in most of these, and he was in this one, singing his minor single \"Wait and See\". There were also a few performances by musicians who weren't strictly rock and roll, and were from an older generation, but who were close enough that the kids would probably accept them. Slim Whitman appeared, as did Count Basie, with Joe Williams as lead vocalist:…</p>\n<p>[Excerpt: Joe Williams, \"I Don't Like You No More\"]</p>\n<p>The film also featured the only known footage of Lewis Lymon and the Teenchords, who we talked about briefly last week. More pertinently to this story, it featured Carl Perkins:</p>\n<p>[Excerpt: Carl Perkins, \"Glad All Over\"]</p>\n<p>That song was one of the few that Perkins recorded which wasn't written by him. Instead, it was written by Aaron Schroeder, who had co-written the non-Leiber-and-Stoller songs for Jailhouse Rock, and who also appeared in this film in a cameo role as himself. The song was provided to Sam Phillips by Hill and Range, who were Phillips' publishing partners as well as being Elvis'.</p>\n<p>It was to be Carl Perkins' last record for Sun -- Perkins had finally had enough of Sam Phillips being more interested in Jerry Lee Lewis. Even little things were getting to him -- Jerry Lee's records were credited to \"Jerry Lee Lewis and his Pumping Piano\". Why did Carl's records never say anything about Carl's guitar?</p>\n<p>Sam promised him that the records would start to credit Carl Perkins as \"the rocking guitar man\", but it was too late -- Perkins and Johnny Cash both made an agreement with Columbia Records on November the first 1957 that when their current contracts with Sun expired, they'd start recording for the new label.</p>\n<p>Cash was in a similar situation to Perkins -- Jack Clement had now taken over production of Cash's records, and while Cash was writing some of his best material, songs like \"Big River\" that remain classics, Clement was making him record songs Clement had written himself, like \"Ballad of a Teenage Queen\":</p>\n<p>[Excerpt: Johnny Cash, \"Ballad of a Teenage Queen\"]</p>\n<p>It's quite easy to see from that, which he recorded in mid-November, why Cash left Sun.</p>\n<p>While Cash would go on to have greater success at Columbia, Perkins wouldn't. And ironically it was possible that he had had one more opportunity to have a hit follow-up to \"Blue Suede Shoes\" at Sun, and he'd passed on it.</p>\n<p>According to Perkins, he was given a choice of two songs to perform in Jamboree, both of them published by Hill and Range, but \"I thought both of them was junk!\" and he'd chosen the one that was slightly less awful -- that's not how other people involved remember it, but he would always claim that he had been offered the song that Jerry Lee Lewis performed, and turned down \"Great Balls of Fire\":</p>\n<p>[Excerpt: Jerry Lee Lewis, \"Great Balls of Fire\"]</p>\n<p>That song was one that both Lewis and Phillips were immediately convinced would be a hit as soon as they heard the demo. Sam Phillips' main worry was how they were going to improve on the demo by the song's writer, Otis Blackwell, which he thought was pretty much perfect as it was.</p>\n<p>We've met Otis Blackwell briefly before -- he was a New York-based songwriter, one of a relatively small number of black people who managed to get work as a professional songwriter for one of the big publishing companies. Blackwell had written \"Fever\" for Little Willie John, \"You're the Apple of My Eye\" for Frankie Valli, and two massive hits for Elvis -- \"Don't Be Cruel\" and \"All Shook Up\". We don't have access to his demo of \"Great Balls of Fire\", but in the seventies he recorded an album called \"These are My Songs\", featuring many of the hits he'd written for other people, and it's possible that the version of \"Great Balls of Fire\" on that album gives some idea of what the demo that so impressed Phillips sounded like:</p>\n<p>[Excerpt: Otis Blackwell, \"Great Balls of Fire\"]</p>\n<p>\"Great Balls of Fire\" seems to be the first thing to have been tailored specifically for the persona that Lewis had created with his previous hit. It's a refinement of the \"Whole Lotta Shakin'\" formula, but it has a few differences that give the song far more impact.</p>\n<p>Most notably, where \"Whole Lotta Shakin'\" starts off with a gently rolling piano intro and only later picks up steam:</p>\n<p>[Excerpt: Jerry Lee Lewis, \"Whole Lotta Shakin'\"]</p>\n<p>\"Great Balls of Fire\" has a much more dynamic opening -- one that sets the tone for the whole record with its stop-start exclamations:</p>\n<p>[Excerpt: Jerry Lee Lewis, \"Great Balls of Fire\"]</p>\n<p>Although that stop-start intro is one of the few signs in the record that point to the song having been possibly offered to Perkins -- it's very reminiscent of the intro to \"Blue Suede Shoes\":</p>\n<p>[Excerpt: Carl Perkins, \"Blue Suede Shoes\"]</p>\n<p>I could imagine Perkins recording the song in the \"Blue Suede Shoes\" manner and having a hit with it, though not as big a hit as Lewis eventually had. On the other hand I can't imagine Lewis turning \"Glad All Over\", fun as it is, into anything even remotely worthy of following up \"Whole Lotta Shakin'\".</p>\n<p>Almost straight away they managed to cut a version of \"Great Balls of Fire\" that was suitable for the film, but it wasn't right for a hit record. They needed something that was absolutely perfect. After having sent the film version off, they spent several days working on getting the perfect version cut -- paying particular attention to that stop-start intro, which the musicians had to time perfectly for it not to come out as a sloppy mess.</p>\n<p>Oddly, the musicians on the track weren't the normal Sun session players, and nor were they the musicians who normally played in Lewis' band. Instead, Lewis was backed by Sidney Stokes on bass and Larry Linn on drums -- according to Lewis, he never met those two people again after they finished recording.</p>\n<p>But as the work proceeded, Jerry Lee became concerned. \"Great Balls of Fire\"? Didn't that sound a bit... Satanic? And people did say that rock and roll was the Devil's music.</p>\n<p>He ended up getting into an angry, rambling, theological discussion with Sam Phillips, which was recorded and which gives an insight into how difficult Lewis must have been to work with, but also how tortured he was -- he truly believed in the existence of a physical Hell, and that he was destined to go there because of his music:</p>\n<p>[Excerpt: Jerry Lee Lewis and Sam Phillips, Bible discussion]</p>\n<p>Sam Phillips, who appears to have had the patience of a saint, eventually talked Lewis down and persuaded him to get back to making music.</p>\n<p>When \"Great Balls of Fire\" came out, with a cover of Hank Williams' ballad \"You Win Again\" on the B-side, it was an immediate success. It sold over a million copies in the first ten days it was out, and it became a classic that has been covered by everyone from Dolly Parton to Aerosmith. It's one of the records that defines 1950s rock and roll music, and it firmly established Jerry Lee Lewis as one of the greatest stars of rock and roll, if not the greatest.</p>\n<p>Jack and Sam kept recording everything they could from Lewis, getting a backlog of recordings that would be released for decades to come -- everything from Hank Williams covers to the old blues number \"Big Legged Woman\":</p>\n<p>[Excerpt: Jerry Lee Lewis, \"Big Legged Woman\"]</p>\n<p>But they decided that they didn't want to mess with a winning formula, and so the next record that they put out was another Otis Blackwell song, \"Breathless\".</p>\n<p>This time, the band was the normal Sun studio drummer Jimmy Van Eaton, Billy Lee Riley on guitar -- Riley was also furious with Sam Phillips for the way he was concentrating on Lewis' career at the expense of everyone else's, but he was still working on sessions for Phillips -- and Jerry Lee's cousin J.W. Brown on bass. J.W. was his full name -- it didn't stand for anything -- and he was the regular touring bass player in Lewis' band.</p>\n<p>\"Breathless\" was very much in the same style as \"Great Balls of Fire\", if perhaps not *quite* so good:</p>\n<p>[Excerpt: Jerry Lee Lewis, \"Breathless\"]</p>\n<p>To promote the record, Jud Phillips, Sam's brother, came up with a great promotional scheme. Dick Clark, the presenter of American Bandstand, had another show, the Dick Clark Show, which was also called Dick Clark's Saturday Night Beechnut Show because it was sponsored by Beechnut chewing gum. Clark had already had Jerry Lee on his show once, and he'd been a hit -- Clark could bring him back on the show, and they could announce that if you sent Sun Records five Beechnut wrappers and fifty cents for postage and packing, you could get a signed copy of the new record. The fifty cents would be more than the postage and packing would cost, of course, and Sun would split the profits with Dick Clark.</p>\n<p>Sun bought an autograph stamp to stamp copies of the record with, hired a few extra temporary staff members to help them get the records posted, and made the arrangements with Dick Clark and his sponsors. The result was extraordinary -- in some parts of the country, stores ran out of Beechnut gum altogether. More than thirty-eight thousand copies of the single were sent out to eager gum-chewers.</p>\n<p>It was around this time that Jerry Lee went on the Alan Freed tour that we mentioned last week, with Chuck Berry, Buddy Holly, Larry Williams, the Chantels, and eleven other acts. The tour later became legendary not so much for the music -- though that was great -- but for the personal disputes between Lewis and Berry.</p>\n<p>There were two separate issues at stake. The first was Elmo Lewis, Jerry's father. Elmo had a habit of using racial slurs, and of threatening to fight anyone, especially black people, who he thought was disrespecting him. At one show on the tour, a dispute about parking spaces between Berry and Lewis led to the elder Lewis chasing Berry three blocks, waving a knife, and shouting \"You know what we do with cats like you down in Ferriday? We chop the heads off them and throw it in a lake.\"</p>\n<p>Apparently, by the next day, Elmo and Chuck were sat with each other at breakfast, the best of friends.</p>\n<p>The other issue was Berry's belief that he, rather than Lewis, should be headlining the shows. He managed to persuade the promoters of this, and this led Lewis to try more and more outrageous stunts on stage to try to upstage Berry. The legend has it that at one show he went so far as to set his piano on fire at the climax of \"Great Balls of Fire\", and then walk off stage challenging Berry to follow that.</p>\n<p>Some versions of the story have him using a racial slur there, too, but the story in whatever form seems to be apocryphal. It does, though, sum up the atmosphere between the two.</p>\n<p>That said, while Lewis and Berry fought incessantly, Berry was one of the few people to whom Lewis has ever shown any respect at all. Partly that's because of Lewis' admiration for Berry's songwriting -- he's called Berry \"the Hank Williams of rock and roll\" before now, and for someone who admires Williams as much as Lewis does that's about the highest imaginable praise. But also, Lewis and his father were both always very careful not to do anything that would lead to word of the feud getting back to his mother, because his mother had repeatedly told him that Chuck Berry was the greatest rock and roller in the world -- Elvis was good, she said, and obviously so was her son, but neither of them were a patch on Chuck. She would have been furious with him, and would definitely have taken Chuck's side.</p>\n<p>After the tour, Jerry Lee recorded another song for a film he was going to appear in. This time, it was the title song for a terribly shlocky attempt at drama, called High School Confidential -- a film that dealt with the very serious and weighty issue of marijuana use among teenagers, and is widely regarded as one of the worst films ever made. The theme music, though, was pretty good:</p>\n<p>[Excerpt: Jerry Lee Lewis, \"High School Confidential\"]</p>\n<p>That came out on the nineteenth of May, 1958, and immediately started rising up the charts. Two days later, Jerry Lee headed out on what was meant to be a triumphal tour of the UK, solidifying him as the biggest, most important, rock and roll star in the world.</p>\n<p>And that is when everything came crashing down. Because it was when he and his entourage landed in the UK, and the press saw the thirteen-year-old girl with him, and asked who she was, that it became public knowledge he had married his thirteen-year-old cousin Myra.</p>\n<p>And here we get to something I've been dreading talking about since I decided on this project. There is simply no way to talk about Jerry Lee Lewis' marriage to Myra Gale Brown which doesn't erase Brown's experience, doesn't excuse Lewis' behaviour, explains the cultural context in which it happened, and doesn't minimise child abuse -- which, and let's be clear about this right now, this was.</p>\n<p>If you take from *anything* that I say after this that I think there is any possible excuse, any justification, for a man in his twenties having sex with a thirteen-year-old girl -- let alone a thirteen-year-old girl in his own family, to whom he was an authority figure -- then I have *badly* failed to get my meaning across. What Lewis did was, simply, wrong.</p>\n<p>It's important to say that, because something that applies both to this episode and to the downfall of Chuck Berry, which we'll be looking at in the next episode, is the way that both have been framed by all the traditional histories of rock and roll. If you read almost anything about rock and roll history, what you see when it gets to 1958 is \"and here rock and roll nearly died, because of the prurient attitudes of a few prudes, who were out to destroy the careers of these new exciting rock and rollers because they hated the threat they posed to their traditional way of life\".</p>\n<p>That is simply not the case. Yes, there was a great deal of establishment opposition to rock and roll music, but what happened to Jerry Lee Lewis wasn't some conspiracy of blue-nosed prudes. It was people getting angry, for entirely understandable reasons, about a man doing something that was absolutely, unquestionably, just *wrong*.</p>\n<p>And the fact that this has been minimised by rock and roll histories says a lot about the culture around rock journalism, none of it good.</p>\n<p>Now, that said, something that needs to be understood here is that Lewis and most of the people round him didn't see him as doing anything particularly wrong. In the culture of the Southern US at the time, it was normal for very young girls to be married, often to older men. By his own lights, he was doing nothing wrong. His first marriage was when he was sixteen -- Myra was his third wife, and he was still legally married to his second when he married her -- and his own younger sister had recently got married, aged twelve.</p>\n<p>Likewise, marrying one's cousin was the norm within Jerry Lee's extended family, where pretty much everyone whose surname was Lewis, Swaggart, or Gilley was married to someone else whose surname was Lewis, Swaggart, or Gilley.</p>\n<p>But I don't believe we have to judge people by their own standards, or at least not wholly so. There were many other horrific aspects to the culture of the Southern states at the time, and just because, for example, the people who defended segregation believed they were doing nothing wrong and were behaving according to their own culture, doesn't mean we can't judge them harshly.</p>\n<p>And it's not as if everyone in Jerry Lee's own culture was completely accepting of this. They'd married in secret, and when Myra's father -- Jerry Lee's cousin and bass player, J.W. Brown -- found out about it, he grabbed his shotgun and went out with every intention of murdering Jerry Lee, and it was only Sam Phillips who persuaded him that maybe that would be a bad idea.</p>\n<p>The British tour, which was meant to last six weeks, ended up lasting only three days. Jerry Lee and his band and family cancelled the tour and returned home, where they expected everyone to accept them again, and for things to carry on as normal. They didn't.</p>\n<p>The record company tried to capitalise on the controversy, and also to defuse the anger towards Lewis. At the time, there was a craze for novelty records which interpolated bits of spoken word dialogue with excerpts of rock and roll hits, sparked off by a record called \"The Flying Saucer\":</p>\n<p>[Excerpt: Buchanan and Goodman, \"The Flying Saucer\"]</p>\n<p>Jack Clement put together a similar thing, as a joke for the Sun Records staff, called \"The Return of Jerry Lee\", having an interviewer, the DJ George Klein, ask Jerry Lee questions about the recent controversy, and having Jerry Lee \"answer\" them in clips from his records. Sam Phillips loved it, and insisted on releasing it as a single.</p>\n<p>[Excerpt: George and Louis, \"The Return of Jerry Lee\"]</p>\n<p>Unsurprisingly, that did not have the effect that was hoped, and did not defuse the situation one iota -- especially since some of the jokes in the record were leering ones about Myra's physical attractiveness -- the attractiveness, remember, of a child. For that reason, I will *not* be putting the full version of that particular track in the Mixcloud mix of songs I excerpted in this episode.</p>\n<p>This is where we say goodbye to Sam Phillips. With Jerry Lee Lewis' career destroyed, and with all his other major acts having left him, Phillips' brief reign as the most important record producer and company owner in the USA was over. He carried on running Sun records for a few years, and eventually sold it to Shelby Singleton. Singleton is a complicated figure, but one thing he definitely did right was exploiting Sun's back catalogue -- in their four-year rockabilly heyday Sam Phillips and Jack Clement had recorded literally thousands of unreleased songs by Jerry Lee Lewis, Johnny Cash, Roy Orbison, Carl Perkins, Conway Twitty, Charlie Rich, Billy Lee Riley, and many more.</p>\n<p>Those tracks sat in Sun's vaults for more than a decade, but once Singleton took over the company pretty much every scrap of material from Sun's vaults saw release, especially once a British reissue label called Charly employed Martin Hawkins and Colin Escott, two young music obsessives, to put out systematic releases of Sun's rockabilly and blues archives.</p>\n<p>The more of that material came out, the more obvious it became that Sam Phillips had tapped into something very, very special at Sun Records, and that throughout the fifties one small studio in Memphis had produced staggering recordings on a daily basis. By the time Sam Phillips died, in 2003, aged eighty, he was widely regarded as one of the most important people in the history of music.</p>\n<p>Jerry Lee Lewis, meanwhile, spent several years trying and failing to have a hit, but slowly rebuilding his live audiences, playing small venues and winning back his audience one crowd at a time. By the late 1960s he was in a position to have a comeback, and \"Another Place, Another Time\" went to number four on the country charts, and started a run of country hits that lasted for the best part of a decade:</p>\n<p>[Excerpt: Jerry Lee Lewis, \"Another Place, Another Time\"]</p>\n<p>Myra divorced Jerry Lee around that time, citing physical and emotional abuse. She is now known as Myra Williams, has been happily married for thirty-six years, and works as a real-estate agent.</p>\n<p>Jerry Lee has, so far, married four more times. His fourth and fifth wives died in mysterious circumstances -- his fourth drowned shortly before the divorce went through, and the fifth died in circumstances that are still unclear, and several have raised suspicions that Jerry Lee killed her. It's not impossible. The man known as the Killer did once shoot his bass player in the chest in the late seventies -- he insists that was an accident -- and was arrested outside Graceland, drunk and with a gun, yelling for Elvis Presley to come out and settle who was the real king.</p>\n<p>Jerry Lee Lewis is still alive, married to his seventh wife, who is Myra's brother's ex-wife. Last year, he and his wife sued his daughter, though the lawsuit was thrown out of court. He's eighty-four years old, still performs, and according to recent interviews, worries if he is going to go to Heaven or to Hell when he dies. I imagine I would worry too, in his place.</p>",
  "enclosure": "",
  "itunes:summary": "Episode sixty-six of A History of Rock Music in Five Hundred Songs looks at \"Great Balls of Fire\" by Jerry Lee Lewis. Click the full post to read liner notes, links to more information, and a transcript of the episode. This one comes with a bit of a content warning, as while it has nothing explicit, it deals with his marriage to his thirteen-year-old cousin.\nPatreon backers also have a ten-minute bonus episode available, on \"Rumble\" by Link Wray.\nResources\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode (with one exception, which I mention in the podcast).\nThe Spark That Survived by Myra Lewis Williams is Myra's autobiography, and tells her side of the story, which has tended to be ignored in favour of her famous husband's side.\nI'm relying heavily on Sam Phillips: the Man Who Invented Rock and Roll by Peter Guralnick for all the episodes dealing with Phillips and Sun Records.\nBooks on Jerry Lee Lewis tend to be very flawed, as the authors all tend to think they're Faulkner rather than giving the facts. This one by Rick Bragg is better than most.\nThere are many budget CDs containing Lewis' pre-1962 work. This set seems as good an option as any.\nAnd this ten-CD box set contains ninety Sun singles in chronological order, starting with \"Whole Lotta Shakin'\" and covering the Jerry Lee Lewis, Johnny Cash, and Carl Perkins records discussed here. There are few better ways to get an idea of Lewis' work in context.\nPatreon\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\nErratum:\nI say “Glad All Over” was written by Aaron Schroeder. In fact it was co-written by Schroeder, Roy Bennett, and Sid Tepper.\nTranscript\nWe've looked before at the rise of Jerry Lee Lewis, but in this episode we're going to talk about his fall. And for that reason I have to put a content warning at the beginning here. While I'm not going to say anything explicit at all, this episode has to deal with events that I, and most of my listeners, would refer to as child sexual abuse, though the child in question still, more than sixty years later, doesn't see them that way, and I don't want to say anything that imposes my framing over hers. If you might find this subject distressing, I suggest reading the transcript before listening, or just skipping this episode. It also deals, towards the end, with domestic violence.\nIndeed, if you're affected by these issues, I would also suggest skipping the next episode, on \"Johnny B. Goode\", and coming back on February the second for \"Yakety Yak\" by the Coasters. We're hitting a point in the history of rock and roll where, for the first time, rock and roll begins its decline in popularity. We'll see from this point on that every few years there's a change in musical fashions, and a new set of artists take over from the most popular artists of the previous period. And in the case of the first rock and roll era, that takeover was largely traumatic. There were a number of deaths, some prosecutions -- and in the case of Jerry Lee Lewis and Chuck Berry, scandals.\nIn general, I try not to make these podcast episodes be about the horrific acts that some of the men involved have committed. This is a podcast about music, not about horrible men doing horrible things. But in the case of Jerry Lee Lewis, he was one of the very small number of men to have actually faced consequences for his actions, and so it has to be discussed. I promise I will try to do so as sensitively as possible.\nAlthough sensitivity is not the word that comes to mind when one thinks of Jerry Lee Lewis, generally...\n[Excerpt: Jerry Lee Lewis, \"Great Balls of Fire\"]\nWhen we left Jerry Lee Lewis, he had just had his first really major success, with \"Whole Lotta Shakin'\". He was on top of the world, and the most promising artist in rock and roll music. With Elvis about to be drafted into the army, the role of biggest rock and roll star was wide open, and Lewis intended t",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode sixty-six of A History of Rock Music in Five Hundred Songs looks at \"Great Balls of Fire\" by Jerry Lee Lewis. Click the full post to read liner notes, links to more information, and a transcript of the episode. This one comes with a bit of a content warning, as while it has nothing explicit, it deals with his marriage to his thirteen-year-old cousin.\nPatreon backers also have a ten-minute bonus episode available, on \"Rumble\" by Link Wray.\nResources\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode (with one exception, which I mention in the podcast).\nThe Spark That Survived by Myra Lewis Williams is Myra's autobiography, and tells her side of the story, which has tended to be ignored in favour of her famous husband's side.\nI'm relying heavily on Sam Phillips: the Man Who Invented Rock and Roll by Peter Guralnick for all the episodes dealing with Phillips and Sun Records.\nBooks on Jerry Lee Lewis tend to be very flawed, as ",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}