{
  "title": "Big Oil Companies Are Selling Their Wells. Some Worry Taxpayers Will Pay to Clean Them Up.",
  "link": "https://www.propublica.org/article/california-oil-wells-shell-exxonmobil",
  "pubDate": "Thu, 27 Oct 2022 06:00:00 -0400",
  "guid": "https://www.propublica.org/article/california-oil-wells-shell-exxonmobil",
  "description": "\n                <p class=\"byline\">\n                by <a class=\"name\" href=\"https://www.propublica.org/people/mark-olalde\">Mark Olalde</a>                </p>\n                                             \n\n                                                                    \n            \n                <p>ProPublica is a nonprofit newsroom that investigates abuses of power. <a href=\"https://www.propublica.org/newsletters/dispatches?source=54G&placement=top-note&region=local\">Sign up for Dispatches</a>, a newsletter that spotlights wrongdoing around the country, to receive our stories in your inbox every week.</p>\n\n            \n\n                \n\n      \n  \n\n\n\n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.0\">The <a href=\"https://www.eia.gov/dnav/pet/hist/LeafHandler.ashx?n=PET&s=F005006__3&f=M\">price of oil produced in California</a> this year reached its highest level in a decade. President Joe Biden is releasing millions of barrels of oil from the Strategic Petroleum Reserve to keep prices in check. And fossil fuel companies’ earnings are so high that Gov. Gavin Newsom has called for a windfall tax on their profits.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.1\">It might seem like a lucrative time to drill for oil in the Golden State. Yet, some of the world’s largest oil companies, several of which have done business in the state for more than a century, are selling assets and beginning to pull out of California.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.2\">Even with strong cash flow in the short term, producers have more to gain from offloading wells and the associated liability — chiefly expensive environmental cleanup — than from pumping more oil and gas, experts say.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.3\">“This is the kind of deal you see when an industry is in its twilight,” said Andrew Logan, senior director for oil and gas at Ceres, a nonprofit focused on sustainability in companies and markets.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.4\">Some industry experts, lawmakers and environmentalists are concerned about the recent deals, noting that the sales shift environmental liability from corporate powerhouses to less-capitalized firms, increasing the risk that aging wells will be left orphaned, unplugged and leaking oil, brine and climate-warming methane. They see a threat that the state’s oil industry could <a href=\"https://www.desmog.com/2020/06/25/coal-surety-bond-pools-liabilities-mine-cleanup/\">repeat a pattern seen in other extractive industries like coal mining</a> and lead to taxpayers bearing cleanup costs.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.5\">California Assemblymember Steve Bennett, a Democrat who has long worked on oil policy, has seen oil companies in his Ventura district walk away from environmental liability. “It gets passed on to a smaller company and to a smaller company until someone declares bankruptcy and the public is stuck with the cleanup bill,” he said.</p>\n\nIKAV Enters the Fray\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.6\">Supermajors Shell and ExxonMobil recently agreed to sell more than 23,000 wells in California, which they owned through a joint venture called Aera Energy, to German asset management group IKAV for an estimated $4 billion. Aera accounts for about a quarter of California’s oil and gas production, largely from pumping in Kern and Ventura counties.</p>\n        \n    \n                    \n\n    Get Involved\n<p>ProPublica is reporting on oil and gas, with a focus on decommissioning, asset retirement obligations, liability evasion and government oversight. Do you work for an oil and gas company, a state or federal regulator, an insurance company or a financial institution that interacts with the oil and gas industry? Reach out directly at <a href=\"mailto:mark.olalde@propublica.org\">mark.olalde@propublica.org</a>, or find details on how to send us tips securely <a href=\"https://www.propublica.org/tips/\">here</a>.</p>\n\n\n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.0\">Shell and ExxonMobil say the deal will strengthen their businesses.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.1\">But Greg Rogers, an attorney and accountant who researches the oil and gas industry, said the deal allows the sellers to shed decommissioning costs. “You got bad assets with big liabilities, and you can get rid of both at the same time. That’s a win for Exxon and Shell,” he said.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.2\">IKAV will inherit a portfolio littered with wells past their prime. Nearly 9,000 Aera wells were idle as of early October, meaning about 38% of the company’s unplugged inventory isn’t producing oil or gas, <a href=\"https://gis.conservation.ca.gov/portal/home/item.html?id=0d30c4d9ac8f4f84a53a145e7d68eb6b\">according to state data</a>.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.3\">“With oil being over $100 a barrel, any well that would’ve come back has likely come back,” Logan said, adding that <a href=\"https://www.latimes.com/projects/california-oil-well-drilling-idle-cleanup/\">long-idled wells are simply “orphan wells in waiting.”</a></p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.4\">In an email, Aera spokesperson Kimberly Ellis-Thompson said the company is capable of managing its large portfolio of idle wells. “Since 2019, when new idle well management program regulations were published, we have met or exceeded the requirements for retiring idle wells,” she said. The company has decommissioned and plugged nearly 1,000 wells on average every year since then, she said.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.5\">IKAV, Aera’s soon-to-be new owner, manages about $2.5 billion in energy-focused assets. <a href=\"https://www.ikav.com/2022/09/01/ikav-acquires-aera-energy-from-shell-and-exxonmobil/\">News releases on the Aera sale</a> quoted Constantin von Wasserschleben, IKAV’s chairman, saying, “We advocate a co-existence between renewable and conventional energy for decades to come.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.6\">As the world increasingly shifts to cheaper renewable energy to address climate change, IKAV has been snapping up oil and gas wells from supermajors exiting the market. The firm, which once focused exclusively on renewable energy, began expanding into oil and gas in 2020 when <a href=\"https://www.durangoherald.com/articles/bp-finalizes-sale-of-san-juan-basin-assets/\">it purchased BP’s gas assets</a> in the San Juan Basin, spanning New Mexico and Colorado. The deal was part of <a href=\"https://www.bp.com/en/global/corporate/news-and-insights/press-releases/bp-expects-to-deliver-around-10-billion-dollars-of-divestment-proceeds-and-announced-transactions-by-end-2019.html\">BP’s push to divest $10 billion in assets</a>, including aging American gas fields.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.7\">BP declined to comment.</p>\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n    \n\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n            An Aera facility and a pump in Ventura. Aera accounts for about a quarter of California’s oil and gas production.\n    \n            (Myung J. Chun/Los Angeles Times)\n    \n    \n    \n\n    \n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.0\">If it’s not profitable to return wells to production, they need to be plugged. But if a company doesn’t plug its wells before walking away, wells are orphaned and the cleanup costs ultimately fall to taxpayers and current operators through fees.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.1\">This has happened with <a href=\"https://www.conservation.ca.gov/calgem/Documents/202209%20Well%20Inventory%20List%20with%20Scenario%20Tiers.pdf\">thousands of wells in California</a> and hundreds of thousands, or more, across the country.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.2\">For example, the Greka group of companies left more than 750 wells for California to plug when its wealthy owner began <a href=\"https://www.desertsun.com/in-depth/news/environment/2021/06/25/oil-bankruptcies-leave-environment-cleanup-california-taxpayers/4977647001/\">pushing his businesses into bankruptcy in 2016 and retired to his Santa Maria winery</a>. And a subsidiary of one of the country’s largest mining companies, Freeport-McMoRan, left dozens of likely orphaned wells, state records show, even though the company brought in nearly $23 billion in revenue last year.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.3\">Greka’s CEO didn’t respond to a request for comment, and a Freeport spokesperson said the company is working with the state to verify details about its orphaned wells.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.4\">To minimize the government’s exposure if wells are orphaned, producers must put up a bond, typically held as cash or a surety policy. The bonds act like a security deposit: The company gets its bond back if it cleans up its mess, but the government keeps the money if the company orphans its wells.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.5\">Newsom has called for an end to all oil extraction in the state by 2045, but his administration has yet to use another tool to hold producers responsible for cleanup.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.6\">California has the authority to ask for an additional $30 million in financial security from a single operator but only requires Aera to hold a $3 million bond. As a result, Aera’s bonds cover less than half a percent of the $1.1 billion that ProPublica estimates it would cost the state to plug the wells based on <a href=\"https://ccst.us/wp-content/uploads/CCST-Orphan-Wells-in-California-An-Initial-Assessment.pdf\">the average cost to California for past well plugging</a>. (That estimate does not include the additional cost of full surface remediation.)</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.7\">California Oil and Gas Supervisor Uduak-Joe Ntuk said in a statement that his agency reviews bonds for all oil companies in the state but did not say whether the amount of Aera’s financial security would be increased through the sale.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.8\">Aera, Shell and ExxonMobil did not respond to a question about the gap between their bonds and the estimated cost to plug their wells. IKAV did not respond to requests for comment. In an email, ExxonMobil spokesperson Meghan Macdonald said that “when we make divestments, we always try to work with partners like Aera and IKAV who are also committed to a lower-emissions future.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.9\">Costs vary widely, but <a href=\"https://energynews.us/2020/01/15/cleaning-up-after-ohios-oil-and-gas-industry-brings-a-growing-price-tag/\">states have paid $100,000 or more</a> to plug wells — and the same to clean up surface pollution — meaning there’s a significant gap between what’s needed and what California has available in bonds.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.10\">“If they don’t have the financial resources when it comes time to plug those wells, there’s a possibility that the public will be left holding the bag and paying those costs even though it’s the company that made the profit from selling the oil,” said Hollin Kretzmann, an attorney with the Center for Biological Diversity.</p>\n\nWho Will Be Liable?\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.11\">More than 240,000 wells have pierced the state since the late 1800s, when Southern California’s first producing well spouted oil near where Dodger Stadium now stands. Of those, more than 5,300 are “orphan, deserted, and potentially deserted wells,” according to <a href=\"https://www.conservation.ca.gov/calgem/Pages/Orphan-Well-Screening-Methodology.aspx\">data the California Geologic Energy Management Division published in September</a>.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.12\">Many on that list belong to individuals who died long ago or companies that dissolved in the shuffling of corporate paperwork. However, some responsible parties are still around but no longer legally liable after offloading their wells through sales and bankruptcies.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.13\">So who will be responsible for cleanup?</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.14\">California is unique because state law allows regulators to call on former operators such as Shell and ExxonMobil to help pay for plugging onshore oil wells if they are later orphaned, even by a different owner. But companies have escaped responsibility under this stronger legal standard by exploiting loopholes such as a porous bankruptcy code.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.15\">Some experts question whether Shell and ExxonMobil would be required to pay if the wells they are selling to IKAV are ultimately orphaned, saying their ownership of the wells through a separate company, Aera, might shield them from liability.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.16\">“Exxon and Shell do not directly operate those wells. There’s corporate structuring going on in between,” Rogers said. And IKAV now adds another layer of corporate paperwork, holding the wells it acquired in New Mexico, Colorado and California through companies that were registered in Delaware shortly before the sales.</p>\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n            Aging wells that are left orphaned and unplugged can leak oil, brine and climate-warming methane.\n    \n            (Myung J. Chun/Los Angeles Times)\n    \n    \n    \n\n    \n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.0\">Alongside Aera, two other companies — California Resources Corp. and Chevron — account for the vast majority of California’s oil and gas production, and they too are shrinking their positions in the state. California Resources, <a href=\"https://www.desertsun.com/story/news/environment/2020/07/15/crc-californias-largest-oil-and-gas-company-files-bankruptcy-protection/5446329002/\">which has been in</a> and <a href=\"https://www.desertsun.com/story/tech/science/energy/2020/10/13/judge-approves-california-resources-corp-plan-emerge-bankruptcy/3642935001/\">out of Chapter 11 bankruptcy in recent years</a>, sold most of its Ventura Basin operations in November 2021. Chevron recently <a href=\"https://www.wsj.com/articles/chevron-sells-global-headquarters-pares-back-in-california-amid-texas-expansion-11664401218\">sold its California headquarters</a> and plans to <a href=\"https://www.bakersfield.com/news/chevron-plans-sale-of-bakersfield-office-space-amid-local-consolidation/article_1f87a0fc-48b6-11ed-83d1-8f4de19efad9.html\">consolidate some of its unused Bakersfield office space</a> as it shifts employees to Texas. <a href=\"https://www.reuters.com/markets/commodities/exclusive-california-oil-producer-berry-corp-explores-sale-sources-2022-10-06/\">Reuters reported</a> in early October that Berry Corp., another large oil company that for many years has operated in California and Utah, was considering selling.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.1\">Berry did not respond to a request for comment.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.2\">Shell acknowledged its California wells were overvalued, suggesting the wells are even nearer to the end of their economic life than previously predicted. The company is wiping as much as $400 million off its books through the sale via an impairment charge.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.3\">Shell has been shedding assets in part to hand off associated greenhouse gas emissions. A <a href=\"https://www.reuters.com/business/sustainable-business/dutch-court-orders-shell-set-tougher-climate-targets-2021-05-26/\">2021 Dutch court ruling</a> ordered it to significantly reduce emissions, although the company has appealed the ruling. Zoe Yujnovich, the company’s upstream director, <a href=\"https://www.shell.com/media/news-and-media-releases/2022/shell-to-sell-interest-in-aera-energy-to-ikav.html\">said in a news release</a> about the sale of Aera that Shell will instead be “focusing on positions with high growth potential.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.4\">For its part, ExxonMobil plans to focus on oil and natural gas that costs less to extract, Liam Mallon, president of ExxonMobil Upstream Co., <a href=\"https://corporate.exxonmobil.com/news/newsroom/news-releases/2022/0901_exxonmobil-to-sell-its-share-of-aera-energy-joint-venture\">said in a news release</a> announcing the sale to IKAV.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.5\">Large public companies are handing off oil and gas assets around the country. Between 2017 and 2021, more than a quarter of oil and gas mergers and acquisitions took public companies private, with private equity often involved, <a href=\"https://business.edf.org/files/Transferred-Emissions-How-Oil-Gas-MA-Hamper-Energy-Transition.pdf\">according to a study conducted by the Environmental Defense Fund</a>. The report voiced concern that private companies are less transparent and have less incentive to protect the environment.</p>\n\nCalifornia Is Just the Beginning\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.6\">With more than 2 million unplugged oil wells believed to be scattered across the U.S., California is the tip of the iceberg.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.7\">A massive boom in American oil and gas production over the past 15 years spurred by technological advances in hydraulic fracturing and horizontal drilling unlocked previously inaccessible geologic formations. But the shale revolution and current market highs buoyed by Russia’s invasion of Ukraine won’t last forever.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.8\">Longtime petroleum reservoir engineer Dwayne Purvis <a href=\"https://youtu.be/JadeRGbK6H8?t=3502\">laid out the reality at a recent conference</a>. This shale revolution revitalized only some oil fields, and more than 90% of the country’s unplugged wells are either idle or minimally producing and unlikely to make a major comeback, according to his research.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.9\">“The bulk of the wells are producing from plays where there is no hope of another deus ex machina,” Purvis said, referencing nearly depleted oil fields.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.10\">The oil industry also faces an impending decline in demand from the shift to renewable energy and the trend toward banning the sale of new internal-combustion engine cars, as well as plans to phase out drilling in metro areas.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.11\">“The overall industry is being assaulted right now through policy changes at the state and federal level. That’s the story writ large,” Rogers said. “The industry is dying.”</p>\n        \n                                   ",
  "dc:subject": "Environment",
  "dc:date": "2022-10-27T06:00:00-04:00",
  "dc:creator": "by Mark Olalde"
}