{
  "title": "The Best of Unpublished Machine Learning and Statistics Books",
  "link": "",
  "published": "2016-02-09T23:00:00+00:00",
  "updated": "2016-02-09T23:00:00+00:00",
  "author": {
    "name": "Sebastian Nowozin"
  },
  "id": "tag:www.nowozin.net,2016-02-09:/sebastian/blog/the-best-of-unpublished-machine-learning-and-statistics-books.html",
  "summary": "<p>Nowadays authors in the fields of statistics and machine learning often choose\nto write their books openly by publishing early draft versions.\nFor popular books this creates a lot of feedback and in the end clearly\nimproves the final book …</p>",
  "content": "<p>Nowadays authors in the fields of statistics and machine learning often choose\nto write their books openly by publishing early draft versions.\nFor popular books this creates a lot of feedback and in the end clearly\nimproves the final book when it is published.</p>\n<p>Here is a short list of very promising draft books.\nBecause completing a book is difficult it is likely that some of these books\nwill never be finished.</p>\n<h3><a href=\"http://www.deeplearningbook.org/\">\"Deep Learning\"</a></h3>\n<p>By Ian Goodfellow, Yoshua Bengio, and Aaron Courville.</p>\n<p>Deep learning has revolutionized multiple applied pattern recognition fields\nsince 2011.\nIf you want to get started in applying deep learning methods, now is the time.</p>\n<p>First, there are now <a href=\"https://docs.google.com/spreadsheets/d/1XvGfi3TxWm7kuQ0DUqYrO6cxva196UJDxKTxccFqb9U/edit#gid=0\">many well-engineered\nframeworks</a>\navailable that make learning and experimentation fun.</p>\n<p>Second, there are good learning resources available.  If you have a solid\nbackground in basic machine learning and basic linear algebra, this book is\nfor you.\nThe field of deep learning is advancing very swiftly and likely this book will\nnot cover all the latest models and techniques used when it is published.\nHowever, at the moment it is quite up-to-date and simply contains some of the\nmost organized material on the topic of deep learning.</p>\n<h3><a href=\"http://www.stat.cmu.edu/~cshalizi/ADAfaEPoV/\">\"Advanced Data Analysis from an Elementary Point of View\"</a></h3>\n<p>By Cosma Rohilla Shalizi.</p>\n<p>This book is covering a lot of ground from classical statistics\n(linear/additive/spline regression, resampling methods, density estimation,\ndimensionality reduction), and some more recent topics (causality, graphical\nmodels, models for dependent data).</p>\n<p>One feature of this book is highlighted by the addition ``from an elementary\npoint of view'' to the title:\nit is quite accessible and the author genuinely cares about conveying\nunderstanding, often in a delightfully casual tone.</p>\n<p>See also the unfinished but great book written by\n<a href=\"http://www.stat.cmu.edu/~cshalizi/\">Cosma Shalizi</a> and\n<a href=\"http://www.cs.bgu.ac.il/~karyeh/\">Aryeh Kontorovich</a>,\n<a href=\"http://www.stat.cmu.edu/~cshalizi/almost-none/\">\"Almost None of the Theory of Stochastic\nProcesses\"</a>.</p>\n<h3><a href=\"http://statweb.stanford.edu/~owen/mc/\">\"Monte Carlo theory, methods and examples\"</a></h3>\n<p>By Art Owen.</p>\n<p>While Monte Carlo methods have advanced in the last decade, in particular\ndriven by the need for large scale Bayesian statistics, most comprehensive\ntextbooks (Liu, Robert and Casella, Rubinstein and Kroese) are now dated.</p>\n<p>Art Owen's book is a wonderful addition that will become a classic once it is\ncompleted.\nFrom first principles and with great depth Art Owen introduces the theory and\npractice of Monte Carlo methods.\nChapters 8 to 10 contain a wealth of material not found in other textbook\ntreatments.\nI am eagerly waiting for chapters 11 to 17.</p>\n<h3><a href=\"http://ciml.info/\">\"A Course in Machine Learning\"</a></h3>\n<p>By Hal Daume III.</p>\n<p>A basic course on a broad set of machine learning methods including\n(eventually, not yet) chapters on structured prediction and Bayesian learning.\nVery accessible and lots of pseudo-code.</p>\n<h3><a href=\"http://alex.smola.org/drafts/thebook.pdf\">\"Introduction to Machine Learning\"</a></h3>\n<p>By Alex Smola and SVN Vishwanathan.</p>\n<p>This draft was last updated in 2010 and probably will never be completed.\nChapter 3 however, covering continuous optimization methods, is complete and\nnicely written.</p>",
  "category": ""
}