{
  "id": "tag:blogger.com,1999:blog-1747027701196237068.post-5881608488588726969",
  "published": "2021-12-06T08:00:00.002-05:00",
  "updated": "2021-12-06T08:00:00.162-05:00",
  "title": "Google, MLSE and the NBA extend partnership through to 2026",
  "content": "Here at Google, we believe progress happens through the power of the ‘we’, not the ‘I’. That’s why we create truly open and helpful products that bring people together, while partnering with organizations that share this same vision.&nbsp;<div><br /></div><div>With that in mind, we’re thrilled to announce our partnership with Maple Leaf Sports &amp; Entertainment (MLSE) and the NBA to make Google Pixel the official smartphone of the Toronto Raptors, Toronto Maple Leafs, and the NBA for the next five seasons.&nbsp;</div><div><br /></div><div>This partnership will leverage the strengths of MLSE’s full ecosystem of sports brands, including the Raptors, Maple Leafs, Toronto FC and Argos, reaching millions of fans across Canada.&nbsp;</div><div><br /></div><div>The beginnings of this partnership date back to October 2017, when we collaborated with the Raptors for the launch of Google Home. As part of this deal, Google Nest will remain the official smart home technology partner of both MLSE and the NBA through to the 2025-2026 season, and Chromebook will become the official laptop of the Raptors, Leafs, TFC and Argos.&nbsp;</div><div><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><iframe allowfullscreen=\"\" class=\"BLOG_video_class\" height=\"404\" src=\"https://www.youtube.com/embed/7ypFG5LY4c4\" width=\"486\" youtube-src-id=\"7ypFG5LY4c4\"></iframe></div><div><br /></div><div>Why is this important? The answer is simple. Having an open ecosystem of accessible and friendly smartphones, home computing, powered by Google software and connected objects helps Canadians reach their goals while staying connected.&nbsp;</div><div><br /></div><div>We think human progress, big and small, can only happen when technology speaks to everybody, for everybody, in the most inclusive, open, friendly and human way. This aligns with MLSE’s commitment to establish partnerships with organizations and co-create purpose-driven programs.&nbsp;</div><div><br /></div><div>This partnership will further showcase the innovation and helpfulness that Google hardware and products bring through a series of advertisements, entertaining content and fresh activations featuring exciting sports talent from our own backyard.&nbsp;</div><div><br /></div><div>This is bold and changemaking, just like our culture and our communities. Together, we’re better - and we can’t wait to share more in the coming months.  </div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Aaron Brindle",
    "uri": "http://www.blogger.com/profile/13885417405401273013",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}