{
  "title": "Common pitfalls to avoid when digitally transforming your supply chain",
  "link": "https://techhq.com/2022/11/uk-warehousing-storage-supply-chain-best-practice-robots-automation-guide/",
  "dc:creator": "Dematic",
  "pubDate": "Tue, 01 Nov 2022 10:59:00 +0000",
  "category": [
    "Sponsored",
    "Hardware",
    "IoT",
    "Platforms",
    "robotics",
    "Software",
    "Supply Chain"
  ],
  "guid": "https://techhq.com/?p=219104",
  "description": "<img width=\"3000\" height=\"1489\" src=\"https://cdn1.techhq.com/wp-content/uploads/2022/11/MainVisual_03-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Dematic\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://cdn1.techhq.com/wp-content/uploads/2022/11/MainVisual_03-1.png 3000w, https://cdn.techhq.com/wp-content/uploads/2022/11/MainVisual_03-1-300x149.png 300w, https://cdn2.techhq.com/wp-content/uploads/2022/11/MainVisual_03-1-1024x508.png 1024w, https://cdn2.techhq.com/wp-content/uploads/2022/11/MainVisual_03-1-768x381.png 768w, https://cdn.techhq.com/wp-content/uploads/2022/11/MainVisual_03-1-1536x762.png 1536w, https://cdn.techhq.com/wp-content/uploads/2022/11/MainVisual_03-1-2048x1016.png 2048w\" sizes=\"(max-width: 3000px) 100vw, 3000px\" /><p>Enterprise logistics are under more pressure than ever — the labour crunch, fierce competition, next day (even next hour) delivery all challenging supply chain efficiency and resilience. Companies are expected to ship goods on time without fail, and that requires them to have a firm grasp on what&#8217;s happening inside their facilities at every moment.<a class=\"excerpt-read-more\" href=\"https://techhq.com/2022/11/uk-warehousing-storage-supply-chain-best-practice-robots-automation-guide/\" title=\"ReadCommon pitfalls to avoid when digitally transforming your supply chain\">... Read more &#187;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://techhq.com/2022/11/uk-warehousing-storage-supply-chain-best-practice-robots-automation-guide/\">Common pitfalls to avoid when digitally transforming your supply chain</a> appeared first on <a rel=\"nofollow\" href=\"https://techhq.com\">TechHQ</a>.</p>\n",
  "content:encoded": "<img width=\"3000\" height=\"1489\" src=\"https://cdn1.techhq.com/wp-content/uploads/2022/11/MainVisual_03-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Dematic\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://cdn1.techhq.com/wp-content/uploads/2022/11/MainVisual_03-1.png 3000w, https://cdn.techhq.com/wp-content/uploads/2022/11/MainVisual_03-1-300x149.png 300w, https://cdn2.techhq.com/wp-content/uploads/2022/11/MainVisual_03-1-1024x508.png 1024w, https://cdn2.techhq.com/wp-content/uploads/2022/11/MainVisual_03-1-768x381.png 768w, https://cdn.techhq.com/wp-content/uploads/2022/11/MainVisual_03-1-1536x762.png 1536w, https://cdn.techhq.com/wp-content/uploads/2022/11/MainVisual_03-1-2048x1016.png 2048w\" sizes=\"(max-width: 3000px) 100vw, 3000px\" /><p>Enterprise logistics are under more pressure than ever — the labour crunch, fierce competition, next day (even next hour) delivery all challenging supply chain efficiency and resilience. Companies are expected to ship goods on time without fail, and that requires them to have a firm grasp on what&#8217;s happening inside their facilities at every moment. Companies are looking for digital transformation initiatives to solve their supply chain challenges by using the latest technologies to reduce unplanned downtime, improve throughput and productivity, and increase visibility into day-to-day operations.</p>\n<p>No technology or process change can by itself be expected to solve these challenges. But combining technologies under the broad term &#8220;digital&#8221; is proving to deliver positive results. Still, with so many moving parts, companies must use a strategic, targeted approach to realise the benefits of digitisation.</p>\n<p>There are plenty of opportunities that Brexit and the labour shortage (for example) are presenting to companies in the UK. Logistics and supply chain challenges are throwing into relief the differences between companies that put customer experience first, and those that have no choice but to pass on their internal problems to the customer.</p>\n<p>Here&#8217;s how companies can leverage technology and changes to business processes to gain competitive advantage in the new-shape Europe, in the UK, and beyond.</p>\n<ol>\n<li>Rather than &#8220;following the leader,&#8221; <strong>apply digital solutions to tackle the most meaningful challenges </strong>unique to your business.</li>\n</ol>\n<p>As consumers demand more and faster, it&#8217;s tempting to jump right into operationalising systems to meet rapid delivery demands. However, the first step for most companies should be to perform an assessment of facilities and operations to define desired business outcomes. The logistics space, especially for grocers and other food service providers, is crowded by competitors trying to deliver goods to consumers in record time. Determine which areas are most critical to address for <em>your</em> business, then identify the right solution for your needs. For example, one company might have issues with unplanned downtime and need improvements in predictive maintenance, while another may have bottlenecks in their operations that limit their ability to ship products at certain times. Problems (and solutions) are myriad, so an initial assessment will ensure your investments are effective. In general, most distribution facilities should start by addressing one of these two areas:</p>\n<p>&#8211;   Modernising operational networks and IT systems to improve cybersecurity. This serves as the foundation for digital investments,</p>\n<p>&#8211;   Implementing advanced analytics to optimise operations with efficient inventory management or predictive maintenance.</p>\n<ol start=\"2\">\n<li>Once you&#8217;ve identified what you&#8217;d like to digitise, <strong>resist the urge to do everything at once</strong>. Instead, start small and broaden your focus as you achieve success.</li>\n</ol>\n<p>Companies typically pursue one of two pathways for digitisation:</p>\n<p>&#8211;   Apply digital transformation narrowly at first to address specific, high-value key performance indicators (KPIs) — like grocery pickup and delivery time. And then apply it more broadly across prioritised aspects of operations over time,</p>\n<p>&#8211;   &#8220;Go big&#8221; with next-generation facilities — think of, for example, retailers, building distribution centres for online grocery ordering where they don&#8217;t otherwise have a brick-and-mortar presence.</p>\n<p>We generally recommend starting with targeted business outcomes that are high-value and quick to implement, then focus on longer implementation opportunities as those begin to show results.</p>\n<ol start=\"3\">\n<li>Know when to lean on technology or when <strong>a problem might be better solved with a human touch</strong>.</li>\n</ol>\n<div id=\"attachment_219118\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-219118\" loading=\"lazy\" class=\"wp-image-219118 size-large\" src=\"https://cdn1.techhq.com/wp-content/uploads/2022/11/MainVisual_02-1024x485.png\" alt=\"Dematic\" width=\"1024\" height=\"485\" srcset=\"https://cdn1.techhq.com/wp-content/uploads/2022/11/MainVisual_02-1024x485.png 1024w, https://cdn.techhq.com/wp-content/uploads/2022/11/MainVisual_02-300x142.png 300w, https://cdn2.techhq.com/wp-content/uploads/2022/11/MainVisual_02-768x364.png 768w, https://cdn.techhq.com/wp-content/uploads/2022/11/MainVisual_02-1536x727.png 1536w, https://cdn2.techhq.com/wp-content/uploads/2022/11/MainVisual_02-2048x969.png 2048w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p id=\"caption-attachment-219118\" class=\"wp-caption-text\">Source: Dematic</p></div>\n<p>Integral components of digital transformation have been around for years — artificial intelligence, machine learning, the cloud — just to name three. What&#8217;s new is using the connectivity and intelligence of these technologies to allow smarter optimisation decisions, whether those decisions are made by humans, software, or a combination of both.</p>\n<p>Many organisations tend to jump to shiny, new technologies before assessing or fully understanding internal user requirements and the need for collaboration among departments, vendors, and suppliers. Understanding organisational change management and having a plan of an area are critical for successfully implementing a digitisation initiative. Avoid the trap of kaleidoscopic analytic applications that require by perpetual clicking to get actionable information (if any at all). Technology must be an enabler and analytic applications must be intelligent enough to facilitate user tasks. So first prioritise user experience requirements over technology.</p>\n<p>When you connect your operational technologies (OT) with your company&#8217;s information technology (IT) and network infrastructure, you begin to connect the Industrial Internet of Things (IIoT) dots in your facility and facilitate a more comprehensive view of operations and maintenance — a view that drives results. The advent of Industry 4.0 technological advancements (big data, the cloud, IIoT, digital sensors, etc.), makes connecting the right data with the right intelligence easier than previously.</p>\n<p>While consumer demands are certainly a leading source of pressure points, food shortages and recalls cause their own disruptions. These disruptions present another case for moving toward digitised logistics in a planned and purposeful way. Whether you are relying on traceability to track a tainted product or real-time inventory data to move product to where it&#8217;s most needed, the key to transformation is thoughtfully considering the solutions that have the biggest impact on your business.</p>\n<p>With the right digital transformation approach, companies can expect to see annual productivity improvements of more than five percent in inventory, lead time, data collection, quality, and more.</p>\n<p>For more information visit <a href=\"http://www.dematic.com.\">www.dematic.com.</a></p>\n<p>&nbsp;</p>\n<p><em>Authored by John Mart, Vice President, Software, Americas, Dematic.</em></p>\n<p>The post <a rel=\"nofollow\" href=\"https://techhq.com/2022/11/uk-warehousing-storage-supply-chain-best-practice-robots-automation-guide/\">Common pitfalls to avoid when digitally transforming your supply chain</a> appeared first on <a rel=\"nofollow\" href=\"https://techhq.com\">TechHQ</a>.</p>\n"
}