{
  "id": "tag:blogger.com,1999:blog-8913912091036362264.post-1618356872931492770",
  "published": "2020-02-14T09:00:00.000-08:00",
  "updated": "2020-02-14T11:36:45.282-08:00",
  "title": "YouTube at 15: My personal journey and the road ahead",
  "content": "<div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-C5jHSgi5JL8/XkWGoSJiQ2I/AAAAAAAAAxk/ykI888NpgLYJSCMEjqdP-efiMJD5rWqkACLcBGAsYHQ/s1600/Susan-note2.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"623\" data-original-width=\"1600\" src=\"https://4.bp.blogspot.com/-C5jHSgi5JL8/XkWGoSJiQ2I/AAAAAAAAAxk/ykI888NpgLYJSCMEjqdP-efiMJD5rWqkACLcBGAsYHQ/s1600/Susan-note2.png\" /></a></div><br /><br />15 years ago today, YouTube took a small step toward starting something big. On February 14, 2005, YouTube was registered as a website. Its <a href=\"https://www.youtube.com/watch?v=QCVxQ_3Ejkg\" target=\"_blank\">founders</a> wanted to create a way for people around the world to share videos. Soon after, the first video&nbsp;<span style=\"background-color: white; color: #3c4043; font-family: &quot;arial&quot; , sans-serif; font-size: 14px;\">⁠—</span>&nbsp;<a href=\"https://www.youtube.com/watch?v=jNQXAC9IVRw\" target=\"_blank\">“Me at the zoo”</a>&nbsp;<span style=\"background-color: white; color: #3c4043; font-family: &quot;arial&quot; , sans-serif; font-size: 14px;\">⁠—</span>&nbsp;was uploaded, and before the end of the year, the site was receiving millions of views a day.<br /><br />Just miles away at Google’s headquarters, I had begun working with colleagues to see how people would use online video. Much to our surprise, users all over the world wanted to upload their videos to share their stories. But what surprised me even more was that so many others wanted to watch these videos about everyday life: funny dances, kids making cute unexpected comments, and, of course, lots of cat videos. These videos entertained us, but they also showed there was something very human about connecting through online video. While traditional media often showed polished and perfected versions of life, this medium was different; it had a raw, honest, and authentic feel.  <br /><br />As YouTube began to take off, it became clear that the company would need significant capital investment to support its growth, so YouTube decided to sell to another company. I, along with <a href=\"https://en.wikipedia.org/wiki/Salar_Kamangar\" target=\"_blank\">Salar Kamangar</a>, made the case to bring the companies together. After the acquisition, founder <a href=\"https://en.wikipedia.org/wiki/Chad_Hurley\" target=\"_blank\">Chad Hurley</a> became CEO, then Salar, and I was incredibly honored to become YouTube’s third CEO six years ago. <br /><br />Fast forward to today, and YouTube has more than two billion monthly users around the world, and 500 hours of video uploaded every minute. Looking ahead in 2020, we’re focused on making YouTube a place where everyone has a voice and can see the world as we:  <br /><br /><br /><ul><li><b>Grow the creator ecosystem to be the best place for creators.</b> Creators are the heart of YouTube, and they’re pioneering new content by vlogging about their lives, covering topics like gaming, fitness, comedy, hobbies, makeup tutorials, and every kind of How To imaginable. Want to fix that 10 year old refrigerator or car? YouTube likely has the video to replace every single part, and in multiple languages! Creators are at the cutting edge of culture and also becoming next generation media companies, boosting local economies with new jobs. Compared to last year, the number of creators earning five figures annually has increased more than 40 percent. And more than 170,000 YouTube channels around the world have over 100,000 subscribers&nbsp;<span style=\"background-color: white; color: #3c4043; font-family: &quot;arial&quot; , sans-serif; font-size: 14px;\">⁠—</span>&nbsp;that’s hundreds of thousands of small businesses growing through the platform. YouTube is unique as a platform since we share the majority of revenue with our creators. Going forward, our goal is to continue to grow revenue and audiences of YouTube creators. We appreciate everything creators do to inspire, educate, and entertain their audiences. We know their fans appreciate them, too, and today we’re launching the third annual #LoveNotes campaign. Click <a href=\"https://twitter.com/YouTube/status/1227647319396507648\" target=\"_blank\">here</a> to show support for your favorite creators. </li></ul><br /><br /><br /><ul><li><b>Partner with the music industry</b> to <a href=\"https://www.billboard.com/articles/business/8550838/lyor-cohen-youtube-music-billboard-cover-story-interview-2020\" target=\"_blank\">grow revenue</a>, break new artists and promote music. YouTube offers twin engines for revenue with advertising and subscribers, paying out more than $3 billion to the music industry last year from ads and subscriptions. We’re also partnering with artists to support and amplify their work through every phase of their career. <a href=\"https://www.youtube.com/channel/UC-J-KZfRV8c13fOCkhXdLiQ\" target=\"_blank\">Dua Lipa</a> was in YouTube's first-ever Foundry program — our initiative to develop independent music acts. <a href=\"https://www.youtube.com/channel/UCIwFjwMjI0y7PDBVEO9-bkQ\" target=\"_blank\">Justin Bieber</a> and <a href=\"https://www.youtube.com/channel/UCiGm_E4ZwYSHV3bcW1pnSeQ\" target=\"_blank\">Billie Eilish</a> have built massive global audiences by directly connecting and engaging with fans on YouTube. At just 18 years old, Billie is now one of the world's biggest stars with five recent Grammy wins. And from its early days, YouTube has been a home for artists who found creative ways to use the platform to help expand their reach. In 2005, <a href=\"https://www.youtube.com/okgo\" target=\"_blank\">OK Go</a> had one of the first viral hits with their music video, \"<a href=\"https://www.youtube.com/watch?v=M1_CLW-NNwc\" target=\"_blank\">A Million Ways</a>.\" Fans posted their own versions of the boy band-inspired choreography, and OK Go decided to make it official with a dance challenge on YouTube. We continue to see unknown artists make it big with a single viral hit. Last year, <a href=\"https://www.youtube.com/channel/UC_uMv3bNXwapHl8Dzf2p01Q\" target=\"_blank\">Lil Nas X</a>’s <a href=\"https://www.youtube.com/watch?v=r7qovpFAGrQ\" target=\"_blank\">\"Old Town Road\"</a> became a YouTube phenomenon and the longest-leading single atop the Billboard Hot 100.  </li></ul><br /><br /><br /><ul><li><b>Work with media companies to extend their audiences</b> through time shifting, new geographies and new users. We’re also boosting awareness of subscription services, sports and news highlights, long-form content, and movies with trailers and clips. And we’re connecting networks and media partners to a consumer base that is increasingly cutting the cord. Today, <a href=\"https://tv.youtube.com/welcome/go/\" target=\"_blank\">YouTube TV</a> has more than 2 million subscribers, and our service has expanded nationwide in the U.S., offering access to more than 70 channels, including cable networks, live sports, and on-demand programming. </li></ul><br /><br /><br /><ul><li><b>Help advertisers</b> big and small find more customers. Advertisers recognize the reach and effectiveness of YouTube to build awareness, improve consideration, and drive results. In 2020, we’ll continue to make our solutions simpler and more effective, while keeping responsibility front of mind. We’ve spent the last three years working to strike the right balance between what advertisers think of as brand safety and what creators think of as demonetization. We continue to develop tools that give advertisers confidence about where their ads run. We’re also working to offer more transparency and certainty to creators with more guidance on our advertiser-friendly <a href=\"https://support.google.com/youtube/answer/6162278?hl=en\" target=\"_blank\">guidelines</a> and an expansion of our creator <a href=\"https://www.youtube.com/watch?v=bK2xupRNgaU\" target=\"_blank\">self-certification</a> program. </li></ul><br /><br /><br /><ul><li><b>Continue to be a place where users come to laugh and to learn.</b> YouTube has become the world's largest video library, a place where people come to be entertained, watch their favorite creators, get help with homework, learn a new hobby, see the latest music video and find community. We’ve seen the ways video is an effective medium for learning&nbsp;<span style=\"background-color: white; color: #3c4043; font-family: &quot;arial&quot; , sans-serif; font-size: 14px;\">⁠—&nbsp;</span>users can see how to do something and repeat the lesson as many times as needed!  Whether it’s help with a <a href=\"https://www.youtube.com/watch?v=z1zxj-axCEo\" target=\"_blank\">math class</a> for college or learning <a href=\"https://www.youtube.com/watch?v=iPE0WfmWpb8&amp;feature=youtu.be\" target=\"_blank\">how to sew</a> and becoming an entrepreneur, we know YouTube is a key force for learning. To amplify this positive impact, we’re investing in quality family content, including our $100 million fund dedicated to the creation of thoughtful, original children’s content on YouTube and YouTube Kids.</li></ul><br /><br />With these new opportunities have come new challenges around responsibility. From the very first days, we realized the importance of setting the rules of the road with <a href=\"https://www.youtube.com/about/policies/#community-guidelines\" target=\"_blank\">Community Guidelines</a>. Over the years, we’ve built on our commitment to protect the YouTube community. While YouTube is clearly a platform&nbsp;<span style=\"background-color: white; color: #3c4043; font-family: &quot;arial&quot; , sans-serif; font-size: 14px;\">—</span>&nbsp;our focus as a company is to distribute the content produced by others&nbsp;<span style=\"background-color: white; color: #3c4043; font-family: &quot;arial&quot; , sans-serif; font-size: 14px;\">⁠—</span>&nbsp;that doesn’t mean we don’t have responsibility. This is my number one focus, and we will continue to do the hard work to make sure that we’re on the right side of history.<br /><br />We think about our responsibility efforts in terms of 4 Rs:  <br /><br /><br /><ul><li>We <a href=\"https://youtube.googleblog.com/2019/09/the-four-rs-of-responsibility-remove.html\" target=\"_blank\"><b>remove</b></a> content that violates policies as quickly as possible. In Q3 of last year alone, <a href=\"https://transparencyreport.google.com/youtube-policy/removals?hl=en\" target=\"_blank\">we removed</a> more than 8.7 million videos.</li></ul><ul><li>We <b><a href=\"https://youtube.googleblog.com/2019/12/the-four-rs-of-responsibility-raise-and-reduce.html\" target=\"_blank\">raise</a>&nbsp;</b>up&nbsp;authoritative voices in searches and recommendations for news and other types of sensitive information.</li></ul><ul><li>We <b>reduce</b> our recommendations of content that brushes up against our policies. We’ve reduced watchtime of borderline content from non-subscribed recommendations in the U.S. by more than 70 percent. Last year we launched these efforts in other markets, including Brazil, France, Germany, and Mexico. And we started 2020 with launches in Italy and Japan, with plans to continue to expand throughout the year.</li></ul><ul><li>And we <b>reward</b> content that meets our even higher bar for monetization.  </li></ul><br /><br />We’re proud of the work we’ve done over the past three years to raise the bar on responsibility. Over the past two years, we've made more than 50 policy changes, often in consultation with relevant outside experts around the world who help us craft guidelines that will protect our community in the long run. Today, problematic content is only a fraction of one percent of what’s watched on YouTube, and we want to drive that number down even more. And as the U.S. <a href=\"https://youtube.googleblog.com/2020/02/how-youtube-supports-elections.html\" target=\"_blank\">presidential election</a> approaches, we will continue to balance openness with responsibility by ensuring that YouTube is a reliable source for information. Our efforts include raising up authoritative election news and removing bad actors and misleading content. <br /><br />Over the next few months, we’ll be celebrating the moments that led up to the public launch of YouTube in May 2005. As I look back on my journey with online video over the past 15 years, I feel incredibly privileged to have been part of these key moments. What inspires me as CEO of YouTube are the stories I hear everyday of how YouTube enabled someone to build a business, gain new skills, laugh, cry, and connect with others. While I don’t know what the next 15 years will bring, I’m certain that YouTube will continue to empower the next generation of storytellers and enrich all our lives.",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube",
    "uri": "http://www.blogger.com/profile/03369985352764236236",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}