{
  "title": "Impact of multiple modes on the evolution of self-interacting axion condensate around rotating black holes. (arXiv:2211.01949v1 [gr-qc])",
  "link": "http://arxiv.org/abs/2211.01949",
  "description": "<p>Ultra-light particles, such as axions, form a macroscopic condensate around a\nhighly spinning black hole by the superradiant instability. Due to its\nmacroscopic nature, the condensate opens the possibility of detecting the axion\nthrough gravitational wave observations. However, the precise evolution of the\ncondensate must be known for the actual detection. For future observation, we\nnumerically study the influence of the self-interaction, especially interaction\nbetween different modes, on the evolution of the condensate in detail. First,\nwe focus on the case when condensate starts with the smallest possible angular\nquantum number. For this case, we perform the non-linear calculation and show\nthat the dissipation induced by the mode interaction is strong enough to\nsaturate the superradiant instability, even if the secondary cloud starts with\nquantum fluctuations. Our result indicates that explosive phenomena such as\nbosenova do not occur in this case. We also show that the condensate settles to\na quasi-stationary state mainly composed of two modes, one with the smallest\nangular quantum number for which the superradiant instability occurs and the\nother with the adjacent higher angular quantum number. We also study the case\nwhen the condensate starts with the dominance of the higher angular quantum\nnumber. We show that the dissipation process induced by the mode coupling does\nnot occur for small gravitational coupling. Therefore, bosenova might occur in\nthis case.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/gr-qc/1/au:+Omiya_H/0/1/0/all/0/1\">Hidetoshi Omiya</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Takahashi_T/0/1/0/all/0/1\">Takuya Takahashi</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Tanaka_T/0/1/0/all/0/1\">Takahiro Tanaka</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Yoshino_H/0/1/0/all/0/1\">Hirotaka Yoshino</a>"
}