{
  "title": "Ukraine ‘won’t get a penny’ if Republicans win Congress – Trump ally",
  "link": "https://www.rt.com/news/565961-mtg-republicans-defund-ukraine-military/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565961-mtg-republicans-defund-ukraine-military/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6365387420302721e2560a23.jpg\" /> Republican Congresswoman Marjorie Taylor Greene warned Ukraine that the US’ largesse is coming to an end <br/><a href=\"https://www.rt.com/news/565961-mtg-republicans-defund-ukraine-military/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Voices in Kiev dismissed Marjorie Taylor Greene’s promise, arguing she does not represent her party's mainstream</strong></p>\n            \n                        \n            <p>If Republicans win back Congress in next week&rsquo;s midterm elections, &ldquo;<em>not another penny will go to Ukraine</em>,&rdquo; US Representative Marjorie Taylor Greene told a rally in Sioux City, Iowa on Thursday, accusing the ruling Democratic Party of prioritizing the Ukrainian military over the lives of Americans.</p>\n<p>&ldquo;<em>The only border they care about is Ukraine, not America&rsquo;s southern border</em>,&rdquo; Greene declared. &ldquo;<em>Our country comes first</em>.&rdquo;</p>\n<p>While polls indicate Republicans have a very real chance of taking back the House as well as the Senate, Ukrainian politicians did not seem worried by Greene&rsquo;s promises.</p>\n<p>Sviatoslav Yurash, a member of President Vladimir Zelensky&rsquo;s Servant of the People Party, told Newsweek on Friday that Greene is &ldquo;<em>not a lead part of the Republican discussion</em>.&rdquo;&nbsp;</p>\n<p>&ldquo;<em>The fact that there are extreme right and extreme left in America which have a different point of view is obvious because America is a democracy</em>,&rdquo; he said. &ldquo;<em>As far as the mainstream perspective is concerned on both sides of the aisle, support for Ukraine is very clear</em>.&rdquo;</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.08/thumbnail/62f026e085f54013cd2938e7.jpg\" alt=\"US Representatives Marjorie Taylor Greene (left) and Lauren Boebert are shown at a June 2021 press conference in Washington.\" />\n            <figcaption><a href=\"https://www.rt.com/news/560429-us-lawmakers-claim-ukraine-aid-scam/\">Most Ukraine aid is a ‘scam’ – US lawmaker</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Insisting Kiev was not asking for &ldquo;<em>limitless aid</em>,&rdquo; Yurash argued that the government was &ldquo;<em>very clear on the point of where [aid] is spent and we are very welcoming to any kind of oversight or missions coming to Ukraine to check and verify on the use of anything</em>.&rdquo; A&nbsp;recent attempt by Senator Rand Paul (R-Kentucky) to include oversight provisions in a $40 billion aid bill, however, was unsuccessful.</p>\n<p>Greene is regularly pilloried as an extremist by Democrats for her outspoken opposition to hot-button issues like LGBT kids, gun control, and abortion. She was also one of just 57 representatives to oppose a bill providing $40 billion in aid to Kiev, arguing that only about a third of the weapons sent there actually make it to the front lines, a statistic confirmed by CBS News.</p>\n<p>As of August, the US had sent over $54 billion in aid to Ukraine this year. Accompanying the latest announcement of $275 million in advanced weapons systems was an acknowledgement by the State Department that there was a &ldquo;<em>possibility that criminal and non-state actors may attempt to illicitly acquire weapons from sources in Ukraine</em>.&rdquo;</p>",
  "enclosure": "",
  "pubDate": "Fri, 04 Nov 2022 16:11:03 +0000",
  "dc:creator": "RT"
}