{
  "title": "Millionaire Interview 335",
  "link": "https://esimoney.com/millionaire-interview-335/",
  "comments": "https://esimoney.com/millionaire-interview-335/#comments",
  "dc:creator": "ESI",
  "pubDate": "Mon, 17 Oct 2022 09:00:55 +0000",
  "category": [
    "Interviews",
    "Millionaires"
  ],
  "guid": "https://esimoney.com/?p=8733",
  "description": "<p>Here’s our latest interview with a millionaire as we seek to learn from those who have grown their wealth to high heights. If you’d like to be considered for an interview, drop me a note and we can chat about specifics. This interview took place in May. My questions are in bold italics and their [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://esimoney.com/millionaire-interview-335/\">Millionaire Interview 335</a> appeared first on <a rel=\"nofollow\" href=\"https://esimoney.com\">ESI Money</a>.</p>\n",
  "content:encoded": "<p><a href=\"https://esimoney.com/wp-content/uploads/2022/05/Close-up-of-piggy-bank-on-desk-new.jpg\"><img class=\"alignleft size-medium wp-image-8734\" src=\"https://esimoney.com/wp-content/uploads/2022/05/Close-up-of-piggy-bank-on-desk-new-300x200.jpg\" alt=\"\" width=\"300\" height=\"200\" srcset=\"https://esimoney.com/wp-content/uploads/2022/05/Close-up-of-piggy-bank-on-desk-new-300x200.jpg 300w, https://esimoney.com/wp-content/uploads/2022/05/Close-up-of-piggy-bank-on-desk-new.jpg 750w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a>Here’s our latest <a href=\"https://esimoney.com/category/millionaires/\">interview with a millionaire</a> as we seek to learn from those who have grown their wealth to high heights.</p>\n<p>If you’d like to be considered for an interview, <a href=\"https://esimoney.com/contact/\">drop me a note</a> and we can chat about specifics.</p>\n<p>This interview took place in May.</p>\n<p>My questions are in bold italics and their responses follow in black.</p>\n<p>Let&#8217;s get started&#8230;</p>\n<h4><span style=\"text-decoration: underline;\"><strong>OVERVIEW</strong></span></h4>\n<p><em><strong>How old are you (and spouse if applicable, plus how long you&#8217;ve been married)?</strong></em></p>\n<p>I am 57 and my spouse is also 57.</p>\n<p>We have been married for 34 years.</p>\n<p><em><strong>Do you have kids/family (if so, how old are they)?</strong></em></p>\n<p>We have one child, he is 31.</p>\n<p>He is also married and a contributing member to society, he has been independent since graduating from college. That means we have been “empty nesters” for around 8 years.</p>\n<p><em><strong>What area of the country do you live in (and urban or rural)?</strong></em></p>\n<p>We live outside of a large metropolitan city in the southeast, mostly a bedroom community on the southside of the city.</p>\n<p><em><strong>What is your current net worth?</strong></em></p>\n<p>Current net worth sits at around $2.5 million.</p>\n<p><em><strong>What are the main assets that make up your net worth (stocks, real estate, business, home, retirement accounts, etc.) and any debt that offsets part of these?</strong></em></p>\n<p>Our main assets are as follows:</p>\n<ul>\n<li>401K &#8212; $1.515M &#8212; This is a managed fund, currently running about 60% stocks/40% bonds</li>\n<li>Primary Residence &#8212; $340K &#8212; A bit inflated due to the recent uptick in the housing market, but hey who am I to complain!</li>\n<li>Pension (value) &#8212; $252K &#8212; This is a guaranteed pension that was frozen a few years back during a downturn/bankruptcy. This type of traditional pension has fallen to the wayside. I based the value on the monthly amount and life expectancy</li>\n<li>TD Ameritrade account &#8212; $206K &#8212; This fund is used to balance out the portfolio, more structured toward the bond side</li>\n<li>Cash &#8212; $168k &#8212; I know, I know, way too heavy here but I will get into this later</li>\n<li>HSA &#8212; $35K &#8212; We contribute the maximum amount that we can each year and plan to use this as a bridge supplement for healthcare</li>\n<li>Bulk Pension &#8212; $30K &#8212; This was an add on when the above pension was frozen</li>\n<li>Series EE Bonds &#8212; $7K &#8212; These are leftovers from when we started to fund my son’s college tuition account (pre 529 account availability)</li>\n</ul>\n<h4><span style=\"text-decoration: underline;\"><strong>EARN</strong></span></h4>\n<p><em><strong>What is your job?</strong></em></p>\n<p>I&#8217;m a mid-level manager working for a large transportation-based company.</p>\n<p>Both my wife and I started our careers in the military &#8212; one in the Navy and one in the Marine Corps. This is where we met, soon after we left the military, and both entered into the private sector.</p>\n<p>I had a brief 1 year stint working for the government but it was mostly a transition to my current company.</p>\n<p>I am one of a dying breed these days that has stayed with my current company for the bulk of my career, currently just shy of 34 years. I have held various positions with increasing responsibilities over the span of my career. The ability to move laterally and the opportunities at my company are endless and maybe that is the reason I have stuck around for so long.</p>\n<p><em><strong>What is your annual income?</strong></em></p>\n<p>My current income is around $220k with bonuses, stock grants, etc.</p>\n<p>My wife left her position some years ago and manages the household, which for me is priceless.</p>\n<p><em><strong>Tell us about your income performance over time. What was the starting salary of your first job, how did it grow from there (and what you did to make it grow), and where are you now?</strong></em></p>\n<p>Starting salary for my first job was $8k a year. Being an enlisted troop in the military does not pay well, but my housing and meals were all free so I guess when you factor that in it inflates considerably.</p>\n<p>Working for the government grew my salary to around $18k per year.</p>\n<p>Starting salary with my current company was around $34k per year (1988 dollars!)</p>\n<p>Salary doubled to $60k in 1998.</p>\n<p>$100k in 2008.</p>\n<p>$219k in 2018.</p>\n<p>I gave 10 year salary increments because I feel this is sometimes better than the year-by-year numbers that I have seen before. Especially when you have been at the same company for so many years.</p>\n<p>We have no debt, we tend to buy cars and keep them for 10 years or so, and have been in the same house for over 25 years. Having no mortgage is the first step to financial freedom in my opinion.</p>\n<p><em><strong>What tips do you have for others who want to grow their career-related income?</strong></em></p>\n<p>I used to think it was “find a good company, and stick with it”, but I think my attitude has changed over time with the elimination of the traditional pension and the portability of the 401k based retirements. There is nothing keeping the current and next generation of workers in one place anymore, and I think that if I had it to do over again I would join them</p>\n<p>Most are just looking for a better working environment and a better work life balance. I think the best advice I could give is always strive to be the best at what you do. If you are a ditch digger, then be the best one around. That goes all the way to CEO in my opinion. Why would you want to be mediocre and not want to be the best?</p>\n<p><em><strong>What&#8217;s your work-life balance look like?</strong></em></p>\n<p>Well until about a year ago it used to be terrible. I was in roles for almost 20 years that required me to be “on call” 24/7, 365 strapped to a pager, then a cell phone/email. That sometimes got in the way of enjoying the time that I did have outside of the standard work hours.</p>\n<p>Over the past year I have drifted away from that type of demand. Now my work-life balance is much better and I enjoy my time off.</p>\n<p>Nobody looks back at the end of their life and says “I wish that I had worked more…”.</p>\n<p><em><strong>Do you have any sources of income besides your career? If so, can you list them, give us a feel for how much you earn with each, and offer some insight into how you developed them?</strong></em></p>\n<p>We do not have any sources of income outside of my salary.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>SAVE</strong></span></h4>\n<p><em><strong>What is your annual spending?</strong></em></p>\n<p>Our annual spending is around $50-60k per year.</p>\n<p>I have only been tracking this for the past couple of years. This is all inclusive with travel, home improvements, taxes, insurance, etc.</p>\n<p><em><strong>What are the main categories (expenses) this spending breaks into?</strong></em></p>\n<p>Mainly it is just the day to day expenses.</p>\n<p>We are not big on eating out so we tend to dine in the majority of the time and any big expenses are discussed thoroughly. These are generally travel and home improvement. Home improvement is different than home maintenance.</p>\n<p><em><strong>Do you have a budget? If so, how do you implement it?</strong></em></p>\n<p>We do not have a formalized budget.</p>\n<p>We do track spending using software so that we can see where we have overrun the pre-set limits on such things as travel, food, etc. I do reconcile it at the end of each month just to ensure that we are not way off track.</p>\n<p>My wife (household CFO) takes charge of paying the bills and ensuring that the house keeps running smoothly.</p>\n<p>Traditionally we do things ourselves but recently we have started to hire jobs out that we no longer want to do, or consider too risky, tree cutting, high ladder work, etc.</p>\n<p><em><strong>What percentage of your gross income do you save and how has that changed over time?</strong></em></p>\n<p>Currently around 30-40%.</p>\n<p>This has certainly increased over time as income has changed and with the elimination of debt, mostly being mortgage free.</p>\n<p><em><strong>What&#8217;s your best tip for saving (accumulating) money?</strong></em></p>\n<p>Have the discipline to stick to it.</p>\n<p>Not having a rainy day fund is a miserable feeling and can quickly turn you upside down financially.</p>\n<p>Take a hard look at where the discretionary money goes, daily coffee, eating out for lunch every day, etc.</p>\n<p><em><strong>What&#8217;s your best tip for spending less money?</strong></em></p>\n<p>Watch the discretionary spending.</p>\n<p>The $3-4 at a shot for things adds up quickly along with constantly eating out.</p>\n<p>Spend more on life experiences and less on material things.</p>\n<p>For big ticket items, take a pause before you purchase and let the cost sink in to ensure that it is a good decision and not a spur of the moment decision.</p>\n<p><em><strong>What is your favorite thing to spend money on/your secret splurge?</strong></em></p>\n<p>Definitely travel.</p>\n<p>We love to travel overseas (or did love to travel overseas). We have started to travel again this year and are enjoying it.</p>\n<p>This will also be important to us in retirement. Traveling is where you learn different cultures, ways of thinking, etc.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>INVEST</strong></span></h4>\n<p><em><strong>What is your investment philosophy/plan?</strong></em></p>\n<p>Up until a few years ago it was just head down forge forward, no real plan, just fund the 401k.</p>\n<p>We met with a financial advisor a few years ago and he really pulled the whole picture together for us and is still helping us with allocation, retirement goals, etc.</p>\n<p>I am not a financial guy by any means, I stick to my lanes for the most part.</p>\n<p><em><strong>What has been your best investment?</strong></em></p>\n<p>Marrying well for sure.</p>\n<p>As many have posted on here there is no real substitute for having a partner who is on the same track as you and has the same goals.</p>\n<p>When I first started out with my current company one of the senior people I was working with walked me through signing up for 401k, and told me to never stop the contributions, the best piece of advice ever. Even when there were pay cuts and reductions I stayed the course and it has paid off, compound interest over a large span of time.</p>\n<p><em><strong>What has been your worst investment?</strong></em></p>\n<p>Probably not paying attention to my 401k during the early/mid years.</p>\n<p>I picked an allocation (mutual fund) and stuck with it. There were not the classes and education that there is now for these types of things.</p>\n<p><em><strong>What&#8217;s been your overall return?</strong></em></p>\n<p>I would guess around 8-10% for the duration.</p>\n<p>We have some investments that do better and some worse so it is a balance.</p>\n<p><em><strong>How often do you monitor/review your portfolio?</strong></em></p>\n<p>I generally look at it once or twice a month.</p>\n<p>Most of it is managed so I just check in to see how things are doing against expectations.</p>\n<p>When the market tanked at the start of COVID, I did not look at it for quite a while, just to save myself the heartache but it recovered nicely.</p>\n<p>The start of 2022 has been rough, but we are playing the long game and expect there to be bumps in the road.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>NET WORTH</strong></span></h4>\n<p><em><strong>How did you accumulate your net worth?</strong></em></p>\n<p>It has all been through saving money. I know that sounds simple but there have been no inheritances, lottery wins or anything like that.</p>\n<p>My salary has steadily grown over time, and luckily it mostly outpaced inflation/cost of living. Once I reached a level where stock options and bonuses were awarded that is where it really started to kick in.</p>\n<p>We never changed our lifestyle when our income increased. Having contributed to a 401k for over 30 years did not hurt either but more on that roller coaster later.</p>\n<p><em><strong>What would you say is your greatest strength in the ESI wealth-building model (Earn, Save or Invest) and why would you say it&#8217;s tops?</strong></em></p>\n<p>I think it is a toss up between earning and saving, more leaning toward the saving side since I needed to earn to get to the saving side. Saving allowed for investing so the center of it all seems to be the saving piece of the puzzle.</p>\n<p>It has not always been easy and sometimes things were really tight financially but we always stuck to trying to save what we could. One of our greatest accomplishments was saving for our son’s college. We started out with EE bonds deducted from paychecks and eventually opened a 529 when available, this and the states “lottery funded scholarship” allowed him to graduate debt free. This cannot be underestimated when they are starting out in life after college.</p>\n<p><em><strong>What road bumps did you face along the way to becoming a millionaire and how did you handle them?</strong></em></p>\n<p>A company bankruptcy was the largest road bump in my opinion.</p>\n<p>At the time the 401k matching was with company stock, so when the company filed for bankruptcy I lost half my 401k and my “guaranteed” pension was frozen at that point.</p>\n<p>I learned a hard lesson on not having all your eggs in the same basket. I no longer hold onto company stock for very long after it is issued.</p>\n<p><em><strong>What are you currently doing to maintain/grow your net worth?</strong></em></p>\n<p>Since I am planning on retiring in 10 months we are more on the maintaining side of the equation.</p>\n<p>I am hoping to fund retirement with pension/SSI/other to let the retirement fund (401k) continue to grow for a bit and to build that cushion to help me sleep better at night.</p>\n<p><em><strong>Do you have a target net worth you are trying to attain?</strong></em></p>\n<p>I never dreamed I would be where I am today financially so I don’t really have a target, just enough to be comfortable in retirement and be able to do the things we have always talked about doing (travel, etc.)</p>\n<p><em><strong>How old were you when you made your first million and have you had any significant behavior shifts since then?</strong></em></p>\n<p>You know, I am not really sure.</p>\n<p>I had never thought about net worth until I started considering retirement. I know that sounds crazy but it’s true.</p>\n<p>If I had to guess when our net worth hit the $1M mark I was probably 52-53 years old. I think the main behavior shift is that I no longer worry about having a job. I know that I can leave and be ok, maybe even find another career if that happens, so it has given me the freedom of choice. Now I get to choose if I stay or go. There is peace in that.</p>\n<p><em><strong>What money mistakes have you made along the way that others can learn from?</strong></em></p>\n<p>I think if I would do anything differently I would have been more of an active participant in where my 401k was invested.</p>\n<p>For too many years I just let it go with my initial selections. Once I started having it professionally managed it really started to grow.</p>\n<p>I know that that may not be a popular scenario but I am not a financial guy and will never profess to be one (or desire to be one), so getting help with that side of it was a good choice.</p>\n<p><em><strong>What advice do you have for ESI Money readers on how to become wealthy?</strong></em></p>\n<p>Save money. Even when it hurts, save money.</p>\n<p>Invest in your retirement plans early in your career. If nothing else invest enough to get the company match if that is the plan offered, this is free money.</p>\n<p>Start those habits early and they will pay off tremendously later in life when you can retire before you hit 67 years old!</p>\n<h4><span style=\"text-decoration: underline;\"><strong>FUTURE</strong></span></h4>\n<p><em><strong>What are your plans for the future regarding lifestyle?</strong></em></p>\n<p>We can retire early. Well, not really that early but 9 years early is good enough for me.</p>\n<p>I would imagine since we are not big spenders that we will maintain a similar lifestyle in retirement.</p>\n<p>We have plans to move to another state that is more tax friendly and where our son currently resides.</p>\n<p>I do not object to working some during retirement but it will have to be something that I just love to get up and do. After 35 years of corporate work, anything stress free will be a good compromise.</p>\n<p>Travel domestically and abroad are top of the list items.</p>\n<p><em><strong>What are your retirement plans?</strong></em></p>\n<p>The current plan is to retire in 2023.</p>\n<p>I currently do not have plans to work in retirement, but that can always change, if I find myself with time on my hands and I get bored, then maybe I will do something part time, or find a non-profit to contribute time to. Can’t see myself playing pickleball, but we will stay active. We love to hike, kayak, etc. so that will give us lots of opportunity for activities.</p>\n<p>My wife has her own activities. It will just be up to me to expand on the things that I currently do now &#8212; I will just have more time to do them.</p>\n<p><em><strong>Are there any issues in retirement that concern you? If so, how are you planning to address them?</strong></em></p>\n<p>Ah yes. Healthcare.</p>\n<p>I really would have thought that by now that the U.S. would have figured out healthcare, but it does not seem to be making progress. So we will need to figure this out soon.</p>\n<p>Going to the open market is expensive and the company does offer a “retiree package” but it rivals the cost of the open market.</p>\n<p>We do have plans to minimize income so that we can take advantage of all the credits and discounts that we can until we hit Medicare age.</p>\n<p>Also a bit concerned about switching from saver to spender. I am sure there are many who read this blog that have made that transition and would be good to hear how you did that and how long it took to become comfortable with it.</p>\n<p>Also being able to balance where to pull funds from early in retirement (pre-pension/SSI) and later when these kick in.</p>\n<p>The age old question of when to start SSI is also something that I find very confusing.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>MISCELLANEOUS</strong></span></h4>\n<p><em><strong>How did you learn about finances and at what age did it &#8220;click&#8221;?</strong></em></p>\n<p>I think you learn about finances as you go through life.</p>\n<p>When you are young and single you don’t really think about it too much, more when you get married, and even more when you have children. After that as you progress through life your attitude and priorities change to a more stable place.</p>\n<p>I did not grow up with a lot of money. We were not “poor” by the definition but we did not have very much discretionary funds either. I think that teaches you to be careful with what funds you do have, and to spend them wisely.</p>\n<p><em><strong>Who inspired you to excel in life? Who are your heroes?</strong></em></p>\n<p>I don&#8217;t think I can honestly point to one person or another on this.</p>\n<p>My parents were both hard working factory workers that pushed on raising 2 kids. I have the utmost appreciation for that now.</p>\n<p><em><strong>Do you have any favorite money books you like/recommend? If so, can you share with us your top three and why you like them?</strong></em></p>\n<p>I can hear the gasps now &#8212; I am not really a reader. When I do read they are more targeted toward leadership.</p>\n<p>I do enjoy short articles on finance, business, etc. Maybe it is an attention span problem! Maybe I will read more in retirement…probably not.</p>\n<ul>\n<li>Essentialism by Greg Mckeown—taught me a lot on how to prioritize things, what is important and what is not.</li>\n<li>It’s Your Ship by Michael Abrashoff—taught me to take control and drive for results.</li>\n<li>Make Your Bed by William McRaven—do the small things first, set yourself up for success.</li>\n</ul>\n<p>I know these are not the normal books that you see on here but it is what I read.</p>\n<p><em><strong>Do you give to charity? Why or why not? If you do, what percent of time/money do you give?</strong></em></p>\n<p>We do not give to charity, other than clothes, etc. to local charity groups.</p>\n<p>This is something that we may consider later on in life. It will take some research as there are many “charities” out there that are charities in name only.</p>\n<p><em><strong>Do you plan to leave an inheritance for your heirs (how do you plan to distribute your wealth at your death)? What are your reasons behind this plan?</strong></em></p>\n<p>Not really a plan, with only one heir it will be up to him to carry on.</p>\n<p>I will have the conversation with him at some point on being a good steward of these types of things and to be sure that there is a plan to pass it on to the next generation.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://esimoney.com/millionaire-interview-335/\">Millionaire Interview 335</a> appeared first on <a rel=\"nofollow\" href=\"https://esimoney.com\">ESI Money</a>.</p>\n",
  "wfw:commentRss": "https://esimoney.com/millionaire-interview-335/feed/",
  "slash:comments": 3
}