{
  "id": "yt:video:QAm1HHnPj8Q",
  "yt:videoId": "QAm1HHnPj8Q",
  "yt:channelId": "UCVpankR4HtoAVtYnFDUieYA",
  "title": "True Facts: Sea Cucumbers",
  "link": "",
  "author": {
    "name": "zefrank1",
    "uri": "https://www.youtube.com/channel/UCVpankR4HtoAVtYnFDUieYA"
  },
  "published": "2022-10-07T16:22:56+00:00",
  "updated": "2022-10-21T04:35:48+00:00",
  "media:group": {
    "media:title": "True Facts: Sea Cucumbers",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Keep exploring at https://brilliant.org/zefrank Get started for free — the first 200 people get 20% off an annual premium subscription.\n\nmerch: https://ze-true-store.myshopify.com/\npatreon: https://www.patreon.com/truefacts\n\nAnna & Ned Deloach:  https://www.blennywatcher.com/\nDr Dave Cowles: salishseainvertebrates.com\ncharlesleflamand: https://www.youtube.com/c/KarelMestdagh-aka-charlesleflamand\nEllen Muller: https://www.youtube.com/channel/UCtc9mtimS9Gk9w9XODoOt_A\nPacificklaus: https://www.youtube.com/channel/UCXpYfIHXf1L7s-V_LebJmCA\nDr. C. PrasannaKumar, Associate Professor, PG and Research Department of Biotechnology and Microbiology, National College (Autonomous), Tamil Nadu, India\nSeymour Marine Discovery Center: https://seymourcenter.ucsc.edu/\n\nAl-Rashdi, Khalfan & Claereboudt, Michel & Eeckhaut, Igor. (2019). Preliminary Trials on Hatchery and Larval Development of the Sea Cucumber, Holothuria scabra (Jaeger 1883), in the Sultanate of Oman. Asian Journal of Fisheries and Aquatic Research. 47061. 10.9734/AJFAR/2018/v2i330009. \n\nCaulier, G., Lepoint, G., Van Nedervelde, F. et al. The diet of the Harlequin crab Lissocarcinus orbicularis, an obligate symbiont of sea cucumbers belonging to the genera Thelenota, Bohadschia and Holothuria . Symbiosis 62, 91–99 (2014). https://doi.org/10.1007/s13199-014-0274-2\n\nChimienti, G., Aguilar, R., Gebruk, A.V. et al. Distribution and swimming ability of the deep-sea holothuroid Penilpidia ludwigi . Mar Biodiv 49, 2369–2380 (2019). https://doi.org/10.1007/s12526-019-00973-9\n\nPeter V. Fankboner and J. Lane Cameron. Seasonal atrophy of the visceral organs in a sea cucumber. Canadian Journal of Zoology. 63(12): 2888-2892. https://doi.org/10.1139/z85-432\n\nFerstl, S., Schwaha, T., Ruthensteiner, B. et al. Nanoscopic X-ray tomography for correlative microscopy of a small meiofaunal sea-cucumber. Sci Rep 10, 3960 (2020). https://doi.org/10.1038/s41598-020-60977-5\n\nFlammang, P., Ribesse, J., & Jangoux, M. (2002). Biomechanics of adhesion in sea cucumber cuvierian tubules. Integrative and comparative biology, 42(6), 1107–1115. https://doi.org/10.1093/icb/42.6.1107\n\nJean‐François Hamel & Annie Mercier (2000) Cuvierian tubules in tropical holothurians: Usefulness and efficiency as a defence mechanism, Marine and Freshwater Behaviour and Physiology, 33:2, 115-139, DOI: 10.1080/10236240009387085\n\nJean-François Hamel , Peter K. L. Ng & Annie Mercier (1999): Life cycle of the pea crab pinnotheres halingi sp. Nov., an obligate symbiont of the sea cucumber holothuria scabra jaeger, Ophelia, 50:3, 149-175 \n\nJontila, Jean. (2018). Possible occurrence of the sea cucumber Actinopyga spinea (Cherbonnier 1980) in Arreceffi Island, Honda Bay, Puerto Princesa City, Palawan, Philippines. 9. 63-67. \n\nLim, AYH & Chan, Ian & Carrasco, L Roman & Todd, Peter. (2019). Aposematism in the pink warty sea cucumber: Independent effects of chromatic and achromatic cues. Marine Ecology Progress Series. 631. 10.3354/meps13159. \n\nMacTavish T, Stenton-Dozey J, Vopel K, Savage C (2012) Deposit-Feeding Sea Cucumbers Enhance Mineralization and Nutrient Cycling... PLoS ONE 7(11): e50031. doi:10.1371/journal.pone.0050031 \n\nMarquet, N., Hubbard, P.C., da Silva, J.P. et al. Chemicals released by male sea cucumber mediate aggregation and spawning behaviours. Sci Rep 8, 239 (2018). https://doi.org/10.1038/s41598-017-18655-6\n\nPeters-Didier, J., Sewell, M.A. The role of the hyaline spheres in sea cucumber metamorphosis. EvoDevo 10, 8 (2019). https://doi.org/10.1186/s13227-019-0119-4\n\nPierrat J. et al. Sophistication in a seemingly simple creature: a review of wild holothurian nutrition in marine ecosystems. Biological Reviews (Feb 2022) https://doi.org/10.1111/brv.12799\n\nPurcell, Steven & Conand, Chantal & Uthicke, Sven & Byrne, Maria. (2016). Ecological Roles of Exploited Sea Cucumbers. Oceanography and Marine Biology. 54. 367-386. 10.1201/9781315368597-8. \n\nOkada, A., Kondo, M. Regeneration of the digestive tract of an anterior-eviscerating sea cucumber, Eupentacta quinquesemita.... Zoological Lett 5, 21 (2019). https://doi.org/10.1186/s40851-019-0133-3\n\nShenkar, N., Gordon, T. Gut-spilling in chordates: Evisceration in the tropical ascidian Polycarpa mytiligera. Sci Rep 5, 9614 (2015). https://doi.org/10.1038/srep09614\n\nTrottier, O., & Jeffs, A. G. (2015). Mate locating and access behaviour of the parasitic pea crab, Nepinnotheres novaezelandiae, an important parasite of the mussel Perna canaliculus. Parasite (Paris, France), 22, 13. https://doi.org/10.1051/parasite/2015013\n\nUdagawa, S., Ikeda, T., Oguchi, K. et al. Hydrocoel morphogenesis forming the pentaradial body plan in a sea cucumber, Apostichopus japonicus. Sci Rep 12, 6025 (2022). https://doi.org/10.1038/s41598-022-09691-y\n\nVandenspiegel, D., Ovaere, A.A., & Massin, C. (1992). On the association between the crab Hapalonotus reticulatus (Crustacea, Brachyura, Eumedonidae) and the sea cucumber Holothuria (Metriatyla) scabra.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}