{
  "title": "Order-optimal Joint Transmission and Identification in Massive Multi-User MIMO via Group Testing. (arXiv:2210.00421v5 [cs.IT] UPDATED)",
  "link": "http://arxiv.org/abs/2210.00421",
  "description": "<p>The number of wireless devices which are connected to a single Wireless Local\nArea Network continues to grow each year. As a result, the orchestration of so\nmany devices becomes a daunting, resource--consuming task, especially when the\nresources available at the single access point are limited, and it is hard to\nanticipate which devices will request access at any given time. On the other\nhand, the number of antennas on both the devices and the access point grows as\nwell, facilitating advanced joint scheduling and coding techniques.\n</p>\n<p>In this paper, we leverage the large number of antennas and suggest a massive\nmultiple-user multiple-input-multiple-output (MU-MIMO) scheme using sparse\ncoding based on Group Testing (GT) principles. The scheme allows for a small\nsubset of devices to transmit simultaneously, without a preceding scheduling\nphase or coordination, thus reducing overhead and complexity. Specifically, we\nshow that out of a population of \\(N\\) devices, it is possible to jointly\nidentify and decode \\(K\\) devices, unknown in advance, simultaneously and\nwithout any scheduling. The scheme utilizes minimal knowledge of channel state,\nuses an efficient (in both run-time and space) decoding algorithm, and requires\n\\(O(K\\log NC)\\) antennas, where \\(C\\) is the number of messages per device. In\nfact, we prove that this scheme is order--optimal in the number of users and\nmessages. This is done by deriving sufficient conditions for a vanishing error\nprobability (a direct result), bounding the minimal number of antennas\nnecessary for any such scheme (a converse result), and showing that these\nresults are asymptotically tight.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Vershinin_G/0/1/0/all/0/1\">George Vershinin</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Cohen_A/0/1/0/all/0/1\">Asaf Cohen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Gurewitz_O/0/1/0/all/0/1\">Omer Gurewitz</a>"
}