{
  "title": "RSiteCatalyst Version 1.4.7 (and 1.4.6.) Release Notes",
  "description": "<p>It seems as though I missed release notes for version RSiteCatalyst 1.4.6, so we’ll do those and RSiteCatalyst 1.4.7 (now on CRAN) and the same time…</p>",
  "pubDate": "Mon, 01 Feb 2016 09:24:04 +0000",
  "link": "http://randyzwitch.com/rsitecatalyst-version-1-4-7-release-notes/",
  "guid": "http://randyzwitch.com/rsitecatalyst-version-1-4-7-release-notes/",
  "content": "<p>It seems as though I missed release notes for version RSiteCatalyst 1.4.6, so we’ll do those and RSiteCatalyst 1.4.7 (now on CRAN) and the same time…</p>\n\n<h2 id=\"rsitecatalyst-146\">RSiteCatalyst 1.4.6</h2>\n\n<p>This release was mostly tweaking some settings, specifically:</p>\n\n<ul>\n  <li>Adding a second <code class=\"language-plaintext highlighter-rouge\">top</code> argument within the <code class=\"language-plaintext highlighter-rouge\">Queue*</code> functions for more control on results returned. It used to be the case that a breakdown report with the <code class=\"language-plaintext highlighter-rouge\">top</code> argument would return, say, the top 10 values of the first variable and up to 50,000 values for the breakdown. Now you can control the second level breakdown as well, such as the top 10 pages and top 5 browsers for those pages.</li>\n  <li>Disable checking of the API call before submitting. I never ran into this, but a user was seeing that the API would return errors in validation under high volume. So if you have any weird issues, disable validation using the <code class=\"language-plaintext highlighter-rouge\">validate = FALSE</code> keyword argument.</li>\n  <li>The package now handles situation where API returns an unexpected type for the <code class=\"language-plaintext highlighter-rouge\">reportID</code> and automatically converts it to the proper type (low-level issue, not a user-facing issue)</li>\n</ul>\n\n<p>Those changes carry forward into version RSiteCatalyst 1.4.7, so there is no reason for a user to stick with this release.</p>\n\n<h2 id=\"rsitecatalyst-147---no-more-unicode-errors\">RSiteCatalyst 1.4.7 - No more Unicode Errors!</h2>\n\n<p>I was surprised it took so long for someone to report this error, but <a href=\"https://github.com/randyzwitch/RSiteCatalyst/issues/151\">#151</a> finally reported a case from a user in Germany where search keywords were being mangled due to the presence of an umlaut. UTF-8 encoding is now the default for both calling the API and processing the results, so this issue will hopefully not arise again.</p>\n\n<p>Additionally, a <code class=\"language-plaintext highlighter-rouge\">locale</code> argument has been added, to set the proper locale for your report suite. This is specified through the <code class=\"language-plaintext highlighter-rouge\">SCAuth()</code> function, with the list of possible <a href=\"https://marketing.adobe.com/developer/documentation/analytics-reporting-1-4/r-reportdescriptionlocale\" target=\"_blank\">locales provided by the Adobe documentation</a>. So if the even after using 1.4.7 with UTF-8 encoding by default, you are still seeing errors, try setting the locale to the country you are in/country setting of the report suite.</p>\n\n<h2 id=\"feature-requestsbugs\">Feature Requests/Bugs</h2>\n\n<p>As always, if you come across bugs or have feature requests, please continue to use <a href=\"https://github.com/randyzwitch/RSiteCatalyst/issues\">RSiteCatalyst GitHub Issues</a> page to submit issues. Don’t worry about cluttering up the page with tickets, please fill out a new issue for anything you encounter (with code you’ve already tried and is failing), unless you are SURE that it is the same problem someone else is facing.</p>\n\n<p>However, outside of patching really serious bugs, I will likely <strong>not spend any more time improving this package in the future</strong>; my interests have changed, and RSiteCatalyst is pretty much complete as far as I’m concerned. That said, contributors are also <em>very welcomed</em>. If there is a feature you’d like added, and especially if you can fix an outstanding issue reported at GitHub, we’d love to have your contributions. Willem and I are both parents of young children and have real jobs outside of open-source software creation, so we welcome any meaningful contributions to RSiteCatalyst that anyone would like to contribute.</p>"
}