{
  "title": "DRAM’s Moore’s Law Is Still Going Strong",
  "link": "https://spectrum.ieee.org/micron-dram",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-golden-disc-etched-with-fine-lines-and-with-light-splayed-across-it-at-intersecting-angles.jpg?id=32025123&width=1200&height=800&coordinates=0%2C179%2C0%2C179\"/><br/><br/><p>Memory and storage chip maker <a href=\"https://www.micron.com/\" target=\"_blank\">Micron Technology</a> says it is shipping samples of the most bit-dense DRAM memory chips yet. Compared with its own previous generation, the 16-gigabit DRAM chip is 15 percent more power efficient and 35 percent more dense. Notably, Micron achieved the improvement without resorting to the most advanced chip-making technology, extreme ultraviolet lithography. The features that make up DRAM cells are not nearly as tiny as those on logic chips, but this advance shows that DRAM density could still shrink further in the future.<br/></p><p>Micron says it is shipping samples of LPDDR5X chips, memory made for power-constrained systems such as smartphones. (LPDDR5X, unpacked: a revved-up twist on the low-power version of the fifth generation of the double-data-rate memory communications standard, capable of transferring 8.5 gigabits per second.) It’s the first chip made using Micron’s new manufacturing process, called 1-beta, which the company says maintains the <a href=\"https://investors.micron.com/news-releases/news-release-details/micron-delivers-industrys-first-1a-dram-technology\" target=\"_blank\">lead it took a year ago</a> over rivals, including <a href=\"https://semiconductor.samsung.com/dram/\" target=\"_blank\">Samsung</a> and <a href=\"https://www.skhynix.com/\" target=\"_blank\">SK Hynix</a>.</p><p>Manufacturing processes for DRAM and logic chips diverged decades ago, with logic chips shrinking transistors much more aggressively as the years went by, explains <a href=\"https://objective-analysis.com/jim-handy/\" target=\"_blank\">Jim Handy</a>, a memory and storage analyst at <a href=\"https://objective-analysis.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Objective Analysis</a>, in Los Gatos, Calif. The reason for the difference has to do with DRAM’s structure. DRAM stores a bit as charge in a capacitor. Access to each capacitor is gated by a transistor. But the transistor is an imperfect barrier, and the charge will eventually leak away. So DRAM must be periodically refreshed, restoring its bits before they drain away. In order to keep that refresh period reasonable while still increasing the density of memory, DRAM makers had to make some pretty radical changes to the makeup of the capacitor. For Micron and other major manufacturers, it now resembles a tall pillar and is made using materials not found in logic chips.</p><p>Nevertheless, memory makers have been investing in the latest key manufacturing tool that logic-chip companies have: <a href=\"https://spectrum.ieee.org/euv-lithography-finally-ready-for-chip-manufacturing\" target=\"_blank\">extreme ultraviolet lithography</a>. But Micron didn’t need it to achieve its latest chip. Instead, the company used a proprietary version of “multipatterning” technology while sticking with the long-established <a href=\"https://spectrum.ieee.org/chip-makings-wet-new-world\" target=\"_blank\">193-nanometer immersion lithography</a>. Multipatterning involves <a href=\"https://www.micron.com/about/blog/2021/january/inside-1a-the-worlds-most-advanced-dram-process-technology\" target=\"_blank\">cycles of projecting a pattern, etching and depositing material, then projecting another pattern</a>—done in such a way that the interaction produces finer structures than any single pattern could. This version of multipatterning was adapted from one used in Micron’s NAND flash business, according to Thy Tran, vice president of DRAM process integration at Micron. “We have taken that and extended it aggressively,” she says. “It’s extremely valuable to be able to leverage both DRAM and NAND [flash].”</p><p>Not needing to use EUV is “a real coup,” says Handy. But it follows a trend. “Micron, for over a decade, has been able to use older process technology and equipment smarter than everybody else.”</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"A gold rectangle with intersecting paralle pale lines and darker sopts.\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"5d2693732af78ecc2942b08030783717\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"4873a\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-gold-rectangle-with-intersecting-paralle-pale-lines-and-darker-sopts.jpg?id=32025124&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">A 16-gigabit DRAM die made with Micron’s 1-beta technology.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Micron Technology</small></p><p>Tran says the company currently believes it will begin using EUV with the next process, 1-gamma.</p><p>The initial product is meant for mobile systems, and so it makes power saving a priority. Part of that comes from the use of “enhanced” dynamic voltage and frequency scaling. This is technology that allows a chip to run with a slower clock and at lower voltage to conserve energy and then ramp up to higher frequency and voltage to get more work done. Micron’s previous manufacturing technology, 1-alpha, could transfer data at 1,600 megabits per second when in the power-saving mode, explains Ross Dermott, vice president of mobile product line management. The LPDDR5X DRAM, made using the 1-beta process, can operate at 3,200 Mb/s in the low-power condition. Handset makers that “have features or applications that are running at that faster speed,  can go into [the low-power] mode and essentially further reduce the power consumption,” he says.<br/></p><p>Tran says that Micron will later use 1-beta to make other types of DRAM, including the high-bandwidth memory that powers data-center processors and AI accelerators.</p><p><em>This post was corrected on 3 November. Micron's vice president of mobile product line management is Ross Dermott, not Ross McDermott.</em></p>",
  "pubDate": "Tue, 01 Nov 2022 13:00:00 +0000",
  "guid": "https://spectrum.ieee.org/micron-dram",
  "category": [
    "Dram",
    "Moore's law",
    "Micron",
    "Samsung",
    "Sk hynix",
    "Extreme ultraviolet lithography",
    "Euv",
    "Memory"
  ],
  "dc:creator": "Samuel K. Moore",
  "media:content": ""
}