{
  "id": "https://bibleinoneyear.org/en/youth/275",
  "title": "Day 275: Godly Ambition",
  "description": "Psalm 116:7–9, Jeremiah 5:14, Philippians 3:4–21. ’Ambition has been defined as the ‘desire to succeed’  There are ultimately only two controlling ambitions to which all others may be reduced: one is our own glory and the other is God’s glory",
  "pubDate": "Sun, 02 Oct 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/275/",
  "itunes:duration": "14:41",
  "guid": "enyouth02102022-275",
  "length": 881.45,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 275: Godly Ambition",
  "itunes:subtitle": "Psalm 116:7–9, Jeremiah 5:14, Philippians 3:4–21. ’Ambition has been defined as the ‘desire to succeed’  There are ultimately only two controlling ambitions to which all others may be reduced: one is our own glory and the other is God’s glory",
  "itunes:summary": "Chuck Colson was a self-made man. As a student, he arrogantly turned down a scholarship to Harvard. He joined the Marines, he set up his own law firm and entered politics. By the age of forty he had become one of President Nixon’s closest advisers. Later, he described himself as ‘a young ambitious political kingmaker’. He was known as Nixon’s ‘hatchet-man’.\nHe pleaded guilty to his part in the Watergate cover-up scandal and was sent to prison. By then he had encountered Jesus. When he left the court after hearing the sentence, he said, ‘What happened in court today... was the court’s will and the Lord’s will – I have committed my life to Jesus Christ and I can work for him in prison as well as out.’\nColson did just that. After his release, he set up Prison Fellowship and became directly or indirectly responsible for leading thousands to Christ. I once heard him say, ‘I was ambitious, and I am ambitious today, but I hope it is not for Chuck Colson (although I struggle with that quite a lot as a matter of fact). But I am ambitious for Christ.’\nAmbition has been defined as the ‘desire to succeed’. There are ultimately only two controlling ambitions to which all others may be reduced: one is our own glory and the other is God’s glory.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 640
}