{
  "title": "124: Dahmer on Dahmer: Part 1",
  "link": "https://audioboom.com/posts/7532625",
  "itunes:episode": 124,
  "itunes:title": "Dahmer on Dahmer: Part 1",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3316,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>This is part 1 of a 2 part series. Part 2 is available <a href=\"https://www.patreon.com/TrueCrimeObsessed\"><strong>RIGHT NOW AND AD FREE </strong>for one week at the $5 level on Patreon.</a> It will be our regular episode (with ads) next week. <br>\n<br>\nTwo-and-a-half decades ago, a man from Milwaukee named Jeffrey Dahmer was tried and convicted of 17 gruesome murders that occurred between 1978 and 1991. Dahmer was convicted of luring young men into his home, where he then drugged, sexually violated, killed, and finally, consumed them. Investigative journalist Nancy Glass secured exclusive access and the first televised interview with the famous serial killer. Dahmer on Dahmer: A Serial Killer Speaks' catapults viewers into Jeffrey Dahmer's psyche, providing a unique look at the life of a serial killer that shook the nation. <br>\n<br>\n<strong>You don't have to wait to hear part 2! It's available right now and ad-free at the $5 level on Patreon. </strong><a href=\"https://www.patreon.com/TrueCrimeObsessed\"><strong>Go here to get it!</strong></a><strong><br>\n</strong><br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 100 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n<br>\n<a href=\"https://www.obsessedwithpod.com/\"><strong>WE LAUNCHED A NEW PODCAST!</strong></a> \"Obsessed With: Abducted In Plain Sight\" is a 4-part podcast series hosted by Patrick Hinds and Skye Borgman, the director of <em>Abducted in Plain Sight. </em>The podcast takes you behind the scenes of the smash hit documentary by sharing new interview with Jan and her parents, deleted scenes, AN INSANE PLOT LINE THAT LEFT OUT OF THE FILM THAT YOU WON'T BELIEVE, and audio journal recorded by the kidnapper himself and later recovered by the FBI. <strong>BINGE ALL 4 EPISODES NOW WHEREVER YOU GET YOUR PODCASTS!</strong>\n</div>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 17 Mar 2020 04:01:00 +0000",
  "guid": "tag:audioboom.com,2020-03-17:/posts/7532625",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}