{
  "title": "32: Life on Purpose Round Table on Vulnerability with Kyle Wood, Elloa Atkinson, and Toku",
  "pubDate": "Thu, 17 Sep 2015 18:33:30 +0000",
  "guid": "cfe9e1f840c0f55ca7aa83996ba607c6",
  "link": "https://lifeonpurpose.libsyn.com/32-life-on-purpose-round-table-on-vulnerability-with-kyle-wood-elloa-atkinson-and-toku",
  "itunes:image": "",
  "description": "<p><strong>Life on Purpose Episode #32</strong> is the long-promised return of the<strong> LoP Round-Table</strong>! For RT#2, I was joined by <strong>Kyle Wood</strong>, <strong>Elloa Atkinson</strong>, and <strong>Toku</strong>. Collectively, they are coaches, trainers, and thought leaders in the mindfulness and personal development communities. They each write, podcast, and speak about mindfulness, vulnerability, and living purposeful lives and they each help others do the same. <br /><br />They joined me for a fantastic deep-dive conversation on the topic of vulnerability — what that really means, how that applies to our lives, holding space for others, and some practical tips for being more vulnerable each and every day.<br /><br /><em>NOTE: I was incredibly fortunate to meet each of my guests at an amazing gathering that I've attended the past two years called <strong>Camp Good LIfe Project</strong>. This conversation began as a meet-up there and I thought it would be incredibly valuable to continue the conversation here on my show. I hope you agree!</em><br /><br /><strong>LoP Round-Table #2 Guests</strong><br /><br />About <strong>Kyle Wood</strong>: Hi, my name is Kyle Wood. And this is scary as hell. The last couple of years have been really challenging for me. It seemed like the work I had done over the years before to try and be a better man <em>(think exercise, meditation, gratefulness practice, etc)</em> had come undone. I had put up my shields and walls to protect myself during this time.<br /><br />When I was ready to make some awesome new friends and grow my business, something was stopping me. It was my walls; while they did a good job protecting me at one time, they were now stopping me from having the kinds of connections I desired. And I had no idea how to tear those walls down.<br /><br />Until <em>(with the help of a coach, psychologist and friends)</em> it hit me. The only way to start tearing down those walls was to start being a LOT more vulnerable. In fact, every success I’ve had this year has come through a moment of being vulnerable. And I want more of that.<br /><br />I’m married, to my amazing wife Zoe. I’m from Melbourne, Australia. I was (still am) a personal trainer. During my time as a trainer I worked on a fun side hustle that I call <em>Bootcamp Ideas</em>. This is now my full time income and allows me ‘location independence’. I still like living in one place at a time, but it is nice to be able to visit family and friends on short notice<br /><br />To learn more about <strong>Kyle</strong>, visit: <a href=\"http://heartmen.net\" target=\"_blank\">http://heartmen.net</a>.<br /><br />About <strong>Elloa Atkinson</strong>: I am a wife, a life-changing coach and entrepreneur, a dancer, a writer, a daughter sister and auntie, and a mum to my lovely rescue dog, Molly Miracle the Westie.<br /><br />I am driven by a vision that stirs the depths of my soul. Through a process of deep coaching, <em>Fearless Expression</em> challenges and my podcast, <em>The Academy of Miracles</em>, I reunite people with their whole self; that I coach + mentor brave people through a process of profound inner and outer transformation.<br /><br />I do this work because I spent the first 18 years and 6 months of my life heading towards a dark night of the soul, and the last 13+ years learning how to live again with authenticity, vulnerability, bravery and intimacy.<br /><br />To learn more about <strong>Elloa,</strong> visit: <a href=\"http://www.elloaatkinson.com\" target=\"_blank\">http://www.elloaatkinson.com</a>.<br /><br /><strong>About Toku</strong>: Toku is short for “Gentoku”, which is the name I received while living at a Zen monastery. In my tradition when you take Jukai and become a card carrying Buddhist, your teachers give you a name. The name they gave me was “Gentoku”, which means “manifesting virtue or present sincerity”.<br /><br />I do my best on my blog and in my training to live up to that name and to help other people embody their best selves as well.<br /><br />I’m originally from Tennessee, but now I live in Portland, OR. I work as a Mindfulness Based executive coach and have clients in Portland, as well as all over the US and Canada.<br /><br />I’m a writer and thought leader in the mindfulness community. My writing has been published on sites such as <em>Tiny Buddha</em>, <em>The Change Blog</em>, and <em>Sea Change</em>.<br /><br />To learn more about <strong>Toku</strong>, visit: <a href=\"http://unexecutive.com\" target=\"_blank\">http://unexecutive.com</a>.</p>",
  "content:encoded": "<p>Life on Purpose Episode #32 is the long-promised return of the LoP Round-Table! For RT#2, I was joined by Kyle Wood, Elloa Atkinson, and Toku. Collectively, they are coaches, trainers, and thought leaders in the mindfulness and personal development communities. They each write, podcast, and speak about mindfulness, vulnerability, and living purposeful lives and they each help others do the same. They joined me for a fantastic deep-dive conversation on the topic of vulnerability — what that really means, how that applies to our lives, holding space for others, and some practical tips for being more vulnerable each and every day.<em>NOTE: I was incredibly fortunate to meet each of my guests at an amazing gathering that I've attended the past two years called Camp Good LIfe Project. This conversation began as a meet-up there and I thought it would be incredibly valuable to continue the conversation here on my show. I hope you agree!</em>LoP Round-Table #2 GuestsAbout Kyle Wood: Hi, my name is Kyle Wood. And this is scary as hell. The last couple of years have been really challenging for me. It seemed like the work I had done over the years before to try and be a better man <em>(think exercise, meditation, gratefulness practice, etc)</em> had come undone. I had put up my shields and walls to protect myself during this time.When I was ready to make some awesome new friends and grow my business, something was stopping me. It was my walls; while they did a good job protecting me at one time, they were now stopping me from having the kinds of connections I desired. And I had no idea how to tear those walls down.Until <em>(with the help of a coach, psychologist and friends)</em> it hit me. The only way to start tearing down those walls was to start being a LOT more vulnerable. In fact, every success I’ve had this year has come through a moment of being vulnerable. And I want more of that.I’m married, to my amazing wife Zoe. I’m from Melbourne, Australia. I was (still am) a personal trainer. During my time as a trainer I worked on a fun side hustle that I call <em>Bootcamp Ideas</em>. This is now my full time income and allows me ‘location independence’. I still like living in one place at a time, but it is nice to be able to visit family and friends on short noticeTo learn more about Kyle, visit: <a href=\"http://heartmen.net\" target=\"_blank\">http://heartmen.net</a>.About Elloa Atkinson: I am a wife, a life-changing coach and entrepreneur, a dancer, a writer, a daughter sister and auntie, and a mum to my lovely rescue dog, Molly Miracle the Westie.I am driven by a vision that stirs the depths of my soul. Through a process of deep coaching, <em>Fearless Expression</em> challenges and my podcast, <em>The Academy of Miracles</em>, I reunite people with their whole self; that I coach + mentor brave people through a process of profound inner and outer transformation.I do this work because I spent the first 18 years and 6 months of my life heading towards a dark night of the soul, and the last 13+ years learning how to live again with authenticity, vulnerability, bravery and intimacy.To learn more about Elloa, visit: <a href=\"http://www.elloaatkinson.com\" target=\"_blank\">http://www.elloaatkinson.com</a>.About Toku: Toku is short for “Gentoku”, which is the name I received while living at a Zen monastery. In my tradition when you take Jukai and become a card carrying Buddhist, your teachers give you a name. The name they gave me was “Gentoku”, which means “manifesting virtue or present sincerity”.I do my best on my blog and in my training to live up to that name and to help other people embody their best selves as well.I’m originally from Tennessee, but now I live in Portland, OR. I work as a Mindfulness Based executive coach and have clients in Portland, as well as all over the US and Canada.I’m a writer and thought leader in the mindfulness community. My writing has been published on sites such as <em>Tiny Buddha</em>, <em>The Change Blog</em>, and <em>Sea Change</em>.To learn more about Toku, visit: <a href=\"http://unexecutive.com\" target=\"_blank\">http://unexecutive.com</a>.</p>",
  "enclosure": "",
  "itunes:duration": "01:06:10",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Life on Purpose Episode #32 is the long-promised return of the LoP Round-Table! For RT#2, I was joined by Kyle Wood, Elloa Atkinson, and Toku. Collectively, they are coaches, trainers, and thought leaders in the mindfulness and personal development..."
}