{
  "title": "An interdisciplinary journey through living machines",
  "link": "https://news.mit.edu/2022/interdisciplinary-journey-through-living-machines-sherry-nyeo-1018",
  "description": "With NEET, Sherry Nyeo is discovering MIT’s undergraduate research community at the intersection of computer science and biological engineering.",
  "pubDate": "Tue, 18 Oct 2022 11:20:00 -0400",
  "guid": "https://news.mit.edu/2022/interdisciplinary-journey-through-living-machines-sherry-nyeo-1018",
  "dc:creator": "Jiyoo Jye | New Engineering Education Transformation (NEET) program",
  "content:encoded": "<p>Sherry Nyeo walks down a tree-lined street on a balmy fall afternoon. The tilting towers of MIT's iconic Stata Center stretch behind her like a serendipitous backdrop. She pauses her audiobook for the interview. Her latest read is “Klara and the Sun,” by Kazuo Ishiguro.&nbsp;</p>\n\n<p>Nyeo is a senior majoring in computer science and molecular biology at MIT. Originally from Taiwan, she moved to Colorado halfway through high school. During the summer before college applications, she recalls reading about microRNA, a class of non-coding RNAs that play essential roles in regulating gene expression, when a segment about MIT appeared on<em> </em>“60 Minutes.” The show highlighted researchers developing devices that interface with the brain. “It was daunting for me to apply because I'm clumsy and can't create things with my hands, especially when the motto of the school is 'mens et manus' ['mind and hand']. But then I applied, and somehow got in,” she remarks with her characteristic modesty.&nbsp;&nbsp;&nbsp;</p>\n\n<p>Since her sophomore year, she’s been a part of an academic cohort known as the <a href=\"https://neet.mit.edu/\">New Engineering Education Transformation</a> (NEET) program. NEET consists of four distinct “threads,” or thematic concentrations, and provides students unique opportunities to join a community and collaborate among like-minded peers and mentors and engage in cross-departmental, hands-on projects.&nbsp;</p>\n\n<p>As Professor Linda Griffith, founding faculty lead and associate director of NEET, explains, the focus of the Living Machines thread is to “mentor students in how to use a strong disciplinary degree program to work on interdisciplinary projects and be part of multidisciplinary teams.” She also adds that the program teaches students&nbsp;“how to interact productively with other disciplines, from your depth of expertise in one discipline.”&nbsp;</p>\n\n<p>NEET Living Machines exposes undergraduate students with multidisciplinary interests like Nyeo to a community with a vast network of people within bioengineering research while they simultaneously earn a major of their choice (computational biology in Nyeo’s case). As a student in the Living Machines thread, Nyeo has had the opportunity to work on projects spanning synthetic biology, immuno-engineering, tissue engineering, microfluidics, computational biology, and other research areas, with the common goal of better understanding therapies for human disease.</p>\n\n<p>“That's what makes working with biology and bioengineering so cool in my mind,” Nyeo states. “You get to study what evolution has perfected (or not) over billions of years, and you get to use it as a tool to apply to so many other problems humans encounter.”&nbsp;</p>\n\n<p>When asked about the project she recently worked on, she describes the <a href=\"http://bathebionano.org/bathe-bionanolab-research/\">Bathe BioNano Lab</a>, the laboratory of MIT Professor Mark Bathe, the director of NEET. This lab uses nucleic acids — DNA and RNA — to engineer revolutionary new materials at the nanometer scale (for reference, the thickness of a human hair is approximately 80,000-100,000 nanometers).&nbsp;&nbsp;</p>\n\n<p>Nyeo describes the potential of using DNA as a data storage medium. “We're generating a lot of data, but there's not enough room to store it all. We're thinking about using something that all of us have. [Something] that has been a storage medium for millennia, which is DNA.” She explains how the extreme density of DNA holds up to 215 million gigabytes of data in a single gram, while an average hard drive can hold only one-millionth of that amount.&nbsp;&nbsp;</p>\n\n<p>Working alongside several postdocs and graduate students at the lab, Nyeo established and later optimized a protocol for writing and reading DNA. “For any data storage system to work, you need to be able to write your information and then store it. Then, somehow [you need to] be able to access specific pieces of information and read them back. I worked on the writing-and-reading part of the process,” she adds.&nbsp;</p>\n\n<p>Nyeo is looking into graduate programs and fellowships in her senior year at MIT. In her spare time, she writes. She shares that she’s kept a diary since she was 7, and more recently, she’s been working on a dystopian screenplay. It’s about a biotech company that can transfer information such as different languages to your brain. The plot is inspired by a class she took last year, 24.133 (Experiential Ethics), along with a book from her childhood titled “Molly Moon, Micky Minus, and the Mind Machine” by Georgia Byng.</p>\n\n<p>As the conversation continues, the sun stretches over the lawn and casts an intricate shadow beneath the red metal sculpture. Its curved steel plates create a geometric frame behind Nyeo — who is beaming with anticipation for the next journey ahead.&nbsp;&nbsp;</p>",
  "media:content": {
    "media:description": "For undergraduate students like Sherry Nyeo with multidisciplinary interests, the NEET Living Machines program opens up a community with a vast network of people within bioengineering research while they simultaneously earn a major of their choice (computational biology in Nyeo’s case).",
    "media:credit": "Photo: Jiyoo Jye"
  },
  "category": [
    "Classes and programs",
    "Profile",
    "Students",
    "Undergraduate",
    "Bioengineering and biotechnology",
    "Computational biology",
    "Nanoscience and nanotechnology",
    "Microfluidics",
    "DNA",
    "Research",
    "Biological engineering",
    "STEM education",
    "Electrical Engineering & Computer Science (eecs)",
    "School of Engineering"
  ]
}