{
  "title": "The Neolithic Revolution with Andrea Matranga",
  "pubDate": "Sat, 28 Apr 2018 03:28:32 +0000",
  "guid": "910eb0032e3b3d5c1a52b0e57b355bc8",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP93Matranga_EDR.mp3",
  "itunes:image": "",
  "description": "<p>Andrea Matranga of the New Economics School in Moscow joins the podcast with a fascinating question: Why did humans adopt agriculture in the times and places they did? His research paper, <a href= \"https://www.dropbox.com/s/3w5indcezgs9c5b/NeolithicQJE.pdf?dl=0\" target=\"_blank\" rel=\"noopener\">The Ant and the Grasshopper: Seasonality and the Invention of Agriculture</a>, offers a potential solution. Here's the abstract:</p> <blockquote>During the Neolithic Revolution, seven populations independently invented agriculture. In this paper, I argue that this innovation was a response to a large increase in climatic seasonality. Hunter-gatherers in the most affected regions became sedentary in order to store food and smooth their consumption. I present a model capturing the key incentives for adopting agriculture, and I test the resulting predictions against a global panel dataset of climate conditions and Neolithic adoption dates. I find that invention and adoption were both systematically more likely in places with higher seasonality. The findings of this paper imply that seasonality patterns 10,000 years ago were amongst the major determinants of the present day global distribution of crop productivities, ethnic groups, cultural traditions, and political institutions.</blockquote> <p>Figure 2 in the paper illustrates the locations and times of the adoption of agriculture:</p> <p><img style= \"display: block; margin-left: auto; margin-right: auto; width: 80%;\" src= \"http://economicsdetective.com/wp-content/uploads/2018/04/fig-2.png\" /></p> <p>Andrea looks at both these adoption dates and the rapidity of the spread of agriculture from these locations and compares them to the climatic seasonality of those locations, finding a strong connection between seasonality and adoption of agriculture. He argues that the need to store food caused people to become sedentary as opposed to nomadic, and once they were sedentary the opportunity cost of farming was greatly reduced.</p> <p> </p>",
  "content:encoded": "<p>Andrea Matranga of the New Economics School in Moscow joins the podcast with a fascinating question: Why did humans adopt agriculture in the times and places they did? His research paper, <a href= \"https://www.dropbox.com/s/3w5indcezgs9c5b/NeolithicQJE.pdf?dl=0\" target=\"_blank\" rel=\"noopener\">The Ant and the Grasshopper: Seasonality and the Invention of Agriculture</a>, offers a potential solution. Here's the abstract:</p> During the Neolithic Revolution, seven populations independently invented agriculture. In this paper, I argue that this innovation was a response to a large increase in climatic seasonality. Hunter-gatherers in the most affected regions became sedentary in order to store food and smooth their consumption. I present a model capturing the key incentives for adopting agriculture, and I test the resulting predictions against a global panel dataset of climate conditions and Neolithic adoption dates. I find that invention and adoption were both systematically more likely in places with higher seasonality. The findings of this paper imply that seasonality patterns 10,000 years ago were amongst the major determinants of the present day global distribution of crop productivities, ethnic groups, cultural traditions, and political institutions. <p>Figure 2 in the paper illustrates the locations and times of the adoption of agriculture:</p> <p></p> <p>Andrea looks at both these adoption dates and the rapidity of the spread of agriculture from these locations and compares them to the climatic seasonality of those locations, finding a strong connection between seasonality and adoption of agriculture. He argues that the need to store food caused people to become sedentary as opposed to nomadic, and once they were sedentary the opportunity cost of farming was greatly reduced.</p> <p> </p>",
  "enclosure": "",
  "itunes:duration": "49:04",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Andrea Matranga of the New Economics School in Moscow joins the podcast with a fascinating question: Why did humans adopt agriculture in the times and places they did? His research paper, , offers a potential solution. Here's the abstract: During the...",
  "itunes:episode": 93,
  "itunes:episodeType": "full"
}