{
  "title": "TU106: What Actually Heals in Therapy with Psychoanalyst Nancy McWilliams",
  "link": "https://therapistuncensored.com/episodes/what-actually-heals-in-therapy-with-psychoanalyst-nancy-mcwilliams/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=what-actually-heals-in-therapy-with-psychoanalyst-nancy-mcwilliams",
  "pubDate": "Fri, 18 Oct 2019 00:08:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=7642",
  "description": "Learn what actually works in therapy.\nIt’s hard to verbalize the problem with “evidence-based” models of care, but renowned psychoanalyst and psychologist Nancy McWilliams does just that. She further describes what happens in quality depth-oriented therapies such as psychoanalytically-informed, attachment-oriented therapy, and integrates the neurobiological aspect that Freud started that has now been confirmed.\nWho is Nancy McWilliams?\nNancy McWilliams, PhD, ABPP, is Visiting Professor in the Graduate School of Applied and Professional Psychology at Rutgers, The State University of New Jersey, and has a private practice in Flemington, New Jersey. She is on the editorial board of Psychoanalytic Psychology and has authored three classic books on psychotherapy, including the award-winning Psychoanalytic Diagnosis, Second Edition: Understanding Personality Structure in the Clinical Process. Dr. McWilliams is an Honorary Member of the American Psychoanalytic Association and a former Erikson Scholar at the Austen Riggs Center in Stockbridge, Massachusetts. She is a recipient of the Leadership and Scholarship Awards from Division 39 (Psychoanalysis) of the American Psychological Association (APA) and the Hans H. Strupp Award from the Appalachian Psychoanalytic Society, and delivered the Dr. Rosalee G. Weiss Lecture for Outstanding Leaders in Psychology for APA Division 42 (Psychologists in Independent Practice). She has demonstrated psychodynamic psychotherapy in three APA educational videos and has spoken at the commencement ceremonies of the Yale University School of Medicine and the Smith College School for Social Work.\nShow Notes – Psychoanalytic Perspectives on Therapy with Nancy McWilliams\nPsychoanalytic Perspective, Trauma & Attachment Based Treatment\n• Challenges – academic and scientific\n\n• Short term focused\n\n• Technique driven\n\n• However, deprives individuals of the time needed to establish secure attachment to therapist, develop motivation to change, feel root feelings, etc.\n\n• Psychoananalytic Perspective\n\n• Humanistic-evidence based relationships\n\n• Proving and disproving Freud\n Trauma treatment history\n• Long term Therapy\n\nBenefits\n\n• Devoted Therapist\nNegative Transference\n“Difficult patients” typically are the ones that evoke parts of ourselves that we don’t like. Our own ugliness, our own badness, all of that. And again, that goes back to long-term treatment, but also long-term treatment of ourselves, you know, as doing our own work and really, you know, a lifelong process.\n\nResearch on non-verbal communications and what works in therapy.\nLearning the defenses and what lies underneath\n• Narcissism/soft toss\n\n• Borderline\n\n• what would you advise for people to get the most out of their therapy or any close relationship that they’re in? Do you have thoughts about that?\n\n \nIf you enjoy this episode you may also enjoy these:\nTU105: Narcissism, What is Going On Under the Defense w Sue Marriott & Ann Kelley\n\nTU90: Avoidance and the Difficulty Opening Up with Guest Robert T. Muller\n\nTU41: The Dark Side Of Therapy: Recognizing When The Therapeutic Relationship Goes Bad\n\n \nResources:\nPsychoanalytic Diagnosis by Nancy McWilliams (textbook for therapists and students)\n\nTo Know and to Care – A_Review of Psychoanalysis by Nancy McWilliams\n\nA psychodynamic formulation masterclass by Nancy McWilliams\n\nIn Conversation Wih Dr Nancy McWilliam\n\nThe Therapeutic Presence In Psychoanalys by Nancy McWilliams\n\nMaybe You Should Talk to Someone: A Therapist, HER Therapist, and Our Lives Revealed – Lori Gottlieb (Sue read this at Dr. McWilliams suggestion and found it hilarious, poignant and much like therapy occurs in real life. Highly recommended.)\n\n \nWho doesn’t love special offers?\n\nOur course is now available for a deeply discounted early release price! While this course is aimed toward clinicians (CE’s available!), all who are highly interested in deepening the security in ...",
  "enclosure": "",
  "itunes:subtitle": "Learn what actually works in therapy. It’s hard to verbalize the problem with “evidence-based” models of care, but renowned psychoanalyst and psychologist Nancy McWilliams does just that. She further describes what happens in quality depth-oriented th...",
  "itunes:summary": "Evidence-based treatment sounds good but it has nothing to do with deep life-changing work of psychoanalytically-oriented attachment therapies.  Dr. Nancy McWilliams takes on the issue of insurance and other institutions trying to define your issue and the care you deserve. She also tackles trauma, narcissism and the training of therapists.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "45:06"
}