{
  "itunes:episode": 63,
  "title": "Failing Upward with Greg Knauss",
  "pubDate": "Thu, 20 Feb 2014 15:04:24 +0000",
  "link": "http://newdisrupt.org/blog/2014/2/20/63-failing-upward-with-greg-knauss",
  "description": "<p>Greg Knauss is an independent software developer who created <a href=\"http://romantimatic.com/\">Romantimatic</a>, a reminder program for absent-minded sweethearts. You may know him from the early 2000s: from <a href=\"http://www.suck.com/fish/contributors/knauss/\">Suck.com</a> and <a href=\"http://www.metababy.com/meta/\">Metababy</a> and <em><a href=\"http://www.kottke.org/02/03/rainy-day-fun-and-games-for-toddler-and-total-bastard-book-tour-2002\">Rainy Day Fun and Games for Toddler and Total Bastard</a></em>, a collection of stories he promoted on what was arguably the first digital book tour. Then for a decade he toiled behind the scenes until he went out on his own. We'll talk today about his expectations, the reality, and fear of failing--and of succeeding!</p>\n\n<p>Sponsored by:</p>\n\n<p><a href=\"http://www.lynda.com/promo/trial/Default.aspx?lpk35=5865&utm_medium=podcast&utm_source=tnd&utm_campaign=link-sponsor-notes\">lynda.com</a>: Over 2,000 high-quality and engaging video courses taught by industry experts — with new courses added daily. Listeners get a free 7-day trial with full access to all content by visiting <a href=\"http://www.lynda.com/promo/trial/Default.aspx?lpk35=5865&utm_medium=podcast&utm_source=tnd&utm_campaign=link-sponsor-notes\">lynda.com/tnd</a> and signing up.</p>\n \n<p><a href=\"http://mediatemple.net/?utm_source=thenewdisruptors&utm_medium=banner&utm_content=feb_podcast&utm_campaign=general\">Media Temple</a>: Web hosting for artists, designers, and Web developers since 1998. World-class support available 24x7 through phone and chat—and even Twitter. Sign up with coupon code \"tnd\" to get 25% off your first month of hosting.</p>\n\n<p><a href=\"http://vimeo.com/\">Vimeo</a>: If you upload a lot of videos, Vimeo Plus and Vimeo PRO let you add 20 GB a week with no ads slapped on top. Get 10% off with the code DISRUPT. (Coupon expires 4/30/2014. Renewals are at full price.)</p>\n\n<p><a href=\"http://BackersHub.com\">BackersHub.com</a>: BackersHub is a daily deals Web site that rewards people who have backed  previously successfully Kickstarter campaigns with exclusive discounts.</p>\n",
  "guid": "tag:soundcloud,2010:tracks/135677864",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "01:09:14",
  "itunes:subtitle": "Greg Knauss is an independent software developer who created Romantimatic, a reminder program for absent-minded sweethearts.",
  "itunes:summary": "Greg Knauss is an independent software developer who created Romantimatic, a reminder program for absent-minded sweethearts. You may know him from the early 2000s: from Suck.com and Metababy and Rainy Day Fun and Games for Toddler and Total Bastard, a collection of stories he promoted on what was arguably the first digital book tour. Then for a decade he toiled behind the scenes until he went out on his own. We'll talk today about his expectations, the reality, and fear of failing--and of succeeding!\n\nSponsored by:\n\nThis episode is sponsored by:\n\nlynda.com: Over 2,000 high-quality and engaging video courses taught by industry experts — with new courses added daily. Listeners get a free 7-day trial with full access to all content by visiting http://lynda.com/tnd and signing up.\n\nMedia Temple: Web hosting for artists, designers, and Web developers since 1998. World-class support available 24x7 through phone and chat—and even Twitter. Sign up at http://mediatemple.net with coupon code \"tnd\" to get 25% off your first month of hosting.\n\nVimeo: If you upload a lot of videos, Vimeo Plus and Vimeo PRO let you add 20 GB a week with no ads slapped on top. Get 10% off with the code DISRUPT at http://vimeo.com. (Coupon expires 4/30/2014. Renewals are at full price.)\n\nBackersHub.com: BackersHub is a daily deals Web site that rewards people who have backed previously successfully Kickstarter campaigns with exclusive discounts."
}