{
  "id": "yt:video:cK43gsND4GQ",
  "yt:videoId": "cK43gsND4GQ",
  "yt:channelId": "UCMTk_R_Y49jvq-HQXDmKI0Q",
  "title": "The Rise And Fall of Frenemies - Trisha and Ethan's Impossible Podcast | TRO",
  "link": "",
  "author": {
    "name": "The Right Opinion",
    "uri": "https://www.youtube.com/channel/UCMTk_R_Y49jvq-HQXDmKI0Q"
  },
  "published": "2022-10-06T17:00:18+00:00",
  "updated": "2022-10-30T12:04:41+00:00",
  "media:group": {
    "media:title": "The Rise And Fall of Frenemies - Trisha and Ethan's Impossible Podcast | TRO",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Go to https://www.Vance-Global.com and use CODE: RIGHTOPINION for 20% off your order or CODE: RIGHTOPINION30 for 30% off Subscriptions\n\nThe Right Opinion: The Rise And Fall of Frenemies - Trisha and Ethan's Impossible Podcast | TRO\n\n0:00- Introduction\n14:25 - The Beginning\n22:27 - Crash\n30:45 - Dynamic\n40:07 - Chaos & Control\n49:24 - Frenemies\n57:08 - Couples Counselling\n1:05:04 - Trisha's Counselling\n1:15:59 - Resolution\n1:23:53 - The Wall\n1:33:16 - Penultimatum\n1:39:57 - The Final Episode\n1:49:11 - Aftermath\n1:57:31 - Aftershock\n2:13:07 - The Next Episode\n2:22:24 - Divergence\n2:31:36 - Reconciliation\n2:40:44 - Enemies\n2:50:08 - Nemeses\n3:04:45 - Truth\n3:12:14 - Lies\n3:22:34 - Who’s Using Who?\n3:30:40 - Who’s Using Who, 2\n3:41:32 - Five Percent\n3:48:46 - Faith\n4:04:27 - Frenemies\n4:13:26 - Outro & Credits\n\nFor me, I guess I’ll always be someone who requires the rehearsed nature of scripts to maximise my full potential, and although I’m not adverse to making appearances on a podcast here and there, I think I need to focus my efforts on my content first and foremost, given how I have regularly failed to do that of recent. However, it is a thought that has taken up residence in my psyche, what if I was to drop everything I was doing now, set up a new channel with the resources I currently possess, and do something that doesn’t require me tearing my hair out. In a way, it’s a decision that Ethan and Hila Klein, also known as h3h3productions made a few years ago, when they decided to launch the h3 podcast, but let’s rewind for just a moment in case anyone here isn’t fully acquainted with the YouTube leviathan that is h3h3productions.\n\nh3h3productions is the YouTube channel run by the aforementioned Klein couple, they established a presence on YouTube for content that often parodied their subjects, usually utilising Ethan’s offbeat sense of humour, alongside editing that put a somewhat amusingly absurdist twist on the content they were lampooning. Nonetheless, many of these videos also had an underlying moral message that resonated with many viewers, often calling out many of the creators of their time for their often shallow exploitation of YouTube culture. \n\nThey’re funny, they’re well made, and many of them are still relevant to this day. They’re videos I grew up with, and will always find a place in my heart for. However, a few years ago, as many of you probably know, they themselves became the centre of attention after one of the subjects of their videos: a gentleman by the name of Matt Hoss, decided to sue them for copyright infringement. It had been regularly debated on how much commentary constituted fair use, and with h3’s videos, there was an uneasy trepidation that maybe, if the ruling went in the favour of the plaintiff, that a new gauntlet would be set down for further lawsuits in this domain.\n\nFortunately the case was won by our protagonists here, and they triumphantly returned to the platform, cheered on by the platform itself, and many creators whose livelihoods seemed to depend on the verdict. However, you can’t really undo the stress that such a case would cause you, and in the aftermath it seemed difficult to return to that content with the same sort of gusto that they’d previously bore. And it’s hard to blame them, if anything a lawsuit which requires such an investment would inevitably sap the fun out of the content that in many ways served as an escape at one point. So, over time, they seemed to distance themselves further from the formula that they had once been inseparable from, venturing into new pastures, including the one we mentioned earlier: the podcast.\n\nIf you got this far and you're still interested, be sure to watch more!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}