{
  "title": "Day 92: Jephthah's Vow (2021)",
  "link": "https://bibleinayear.fireside.fm/day-92",
  "guid": "b3b96a51-c722-4f5d-b194-88be106a4304",
  "pubDate": "Fri, 02 Apr 2021 00:00:00 -0400",
  "author": "Ascension",
  "enclosure": "",
  "itunes:episodeType": "full",
  "itunes:author": "Ascension",
  "itunes:subtitle": "Today's readings are Judges 9-11, Ruth 4, and Psalm 137. In the reading from Judges, we hear about the rise and fall of Abimelech, as well as the misguided and heartbreaking vow Jephthah makes to God in return for victory over the Ammonites. We also conclude the book of Ruth with the marriage of Boaz and Ruth. Please note: The Bible contains adult themes that may not be suitable for children - parental discretion is advised.",
  "itunes:duration": "28:18",
  "itunes:explicit": "no",
  "description": "Today's readings are Judges 9-11, Ruth 4, and Psalm 137. In the reading from Judges, we hear about the rise and fall of Abimelech, as well as the misguided and heartbreaking vow Jephthah makes to God in return for victory over the Ammonites. We also conclude the book of Ruth with the marriage of Boaz and Ruth.\nFor the complete reading plan, visit ascensionpress.com/bibleinayear.\nPlease note: The Bible contains adult themes that may not be suitable for children - parental discretion is advised.",
  "itunes:keywords": "jephthah, judges, ruth, boaz, abimelech, conquest and judges, psalm 137, ruth 4, judges 9, judges 10, judges 11, human sacrifice, tribes of israel, israel, ammonites, catholic, bible, bible in a year, bible in a year with fr.mike, bible in a year with fr.mike schmitz, bible in a year with fr mike, bible in a year with father mike, bible in a year with father mike schmitz, the bible in a year with fr.mike schmitz, the bible in a year with fr mike, the bible in a year with father mike, the bible in a year with father mike schmitz, father mike, fr.mike, fr mike, fr. mike schmitz, father mike schmitz, bible podcast, read the bible, read the bible in a year, bible in a year podcast, bible podcast fr mike, bible podcast fr.mike, bible podcast fr.mike schmitz, bible podcast father mike, bible podcast father mike schmitz, scripture, god’s word, the word of god, Catholic Church, catholicism, catholic faith, catholic priest, ascension, ascension press, christianity, catholic bible,roman catholic, christian, catholics, catholic bible, totus tuus, bible study, Catholic Bible Study, ascension presents, salvation history, the great adventure bible, the great adventure timeline, catholics, ascension catholic, religion, jesus, jesus christ, catholic religion, god,",
  "content:encoded": "<p>Today's readings are Judges 9-11, Ruth 4, and Psalm 137. In the reading from Judges, we hear about the rise and fall of Abimelech, as well as the misguided and heartbreaking vow Jephthah makes to God in return for victory over the Ammonites. We also conclude the book of Ruth with the marriage of Boaz and Ruth.</p>\n\n<p>For the complete reading plan, visit ascensionpress.com/bibleinayear.</p>\n\n<p>Please note: The Bible contains adult themes that may not be suitable for children - parental discretion is advised.</p><p><a href=\"https://ascensionpress.com/products/support-ascension\" rel=\"payment\">Support The Bible in a Year (with Fr. Mike Schmitz)</a></p>",
  "itunes:summary": "<p>Today's readings are Judges 9-11, Ruth 4, and Psalm 137. In the reading from Judges, we hear about the rise and fall of Abimelech, as well as the misguided and heartbreaking vow Jephthah makes to God in return for victory over the Ammonites. We also conclude the book of Ruth with the marriage of Boaz and Ruth.</p>\n\n<p>For the complete reading plan, visit ascensionpress.com/bibleinayear.</p>\n\n<p>Please note: The Bible contains adult themes that may not be suitable for children - parental discretion is advised.</p><p><a href=\"https://ascensionpress.com/products/support-ascension\" rel=\"payment\">Support The Bible in a Year (with Fr. Mike Schmitz)</a></p>",
  "fireside:playerURL": "https://fireside.fm/player/v2/pkZrCg5G+5vubsUCs",
  "fireside:playerEmbedCode": "<iframe src=\"https://fireside.fm/player/v2/pkZrCg5G+5vubsUCs\" width=\"740\" height=\"200\" frameborder=\"0\" scrolling=\"no\">"
}