{
  "title": "City Energy and Sydrogen to Study Development of Off-Grid Fuel Cell Solutions",
  "link": "https://www.iaasiaonline.com/city-energy-and-sydrogen-to-study-development-of-off-grid-fuel-cell-solutions/",
  "dc:creator": "Tzelong",
  "pubDate": "Fri, 28 Oct 2022 20:30:15 +0000",
  "category": [
    "Hydrogen",
    "Industry News",
    "Recent News",
    "Sydrogen",
    "Temasek"
  ],
  "guid": "https://www.iaasiaonline.com/?p=38701",
  "description": "<p>City Energy and Sydrogen to Study Development of Off-Grid Fuel Cell Solutions with Hydrogen Extracted from Town Gas From L-R: Mr Desmond Tay, Vice President for Strategic Planning, City Energy, Mr Perry Ong, Chief Executive Officer, City Energy, Mr David DeVries, Chief Technology Officer, Sydrogen, Mr Mun Meng Wai, Assistant Director, Strategic Marketing, Sydrogen City &#8230;</p>\n<p class=\"read-more\"> <a class=\"\" href=\"https://www.iaasiaonline.com/city-energy-and-sydrogen-to-study-development-of-off-grid-fuel-cell-solutions/\"> <span class=\"screen-reader-text\">City Energy and Sydrogen to Study Development of Off-Grid Fuel Cell Solutions</span> Read More &#187;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com/city-energy-and-sydrogen-to-study-development-of-off-grid-fuel-cell-solutions/\">City Energy and Sydrogen to Study Development of Off-Grid Fuel Cell Solutions</a> appeared first on <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com\">IAA - Industrial Automation</a>.</p>\n",
  "content:encoded": "<p>City Energy and Sydrogen to Study Development of Off-Grid Fuel Cell Solutions with Hydrogen Extracted from Town Gas</p>\n<p><img decoding=\"async\" class=\"aligncenter\" src=\"https://attachments.office.net/owa/tzelong-goh%40epl.com.sg/service.svc/s/GetAttachmentThumbnail?id=AAMkADMxOGQ1YWQyLTNjZjAtNGI4ZS1hOGI5LTVkZGRiYjc1ZTBkMgBGAAAAAADzHK6xERxSRL%2F2UEaBxEvABwD2ALhh4dPVQ7fzTeQs4KtvAAAAAAEMAAD2ALhh4dPVQ7fzTeQs4KtvAACHxk8DAAABEgAQADaDBWQYMhhAl8AXaWwiE5k%3D&thumbnailType=2&token=eyJhbGciOiJSUzI1NiIsImtpZCI6IkQ4OThGN0RDMjk2ODQ1MDk1RUUwREZGQ0MzODBBOTM5NjUwNDNFNjQiLCJ0eXAiOiJKV1QiLCJ4NXQiOiIySmozM0Nsb1JRbGU0Tl84dzRDcE9XVUVQbVEifQ.eyJvcmlnaW4iOiJodHRwczovL291dGxvb2sub2ZmaWNlLmNvbSIsInVjIjoiY2QwZDExODFkN2JlNGE3OTlkNGQ4MWRmMzFhZTZmYTIiLCJzaWduaW5fc3RhdGUiOiJbXCJrbXNpXCJdIiwidmVyIjoiRXhjaGFuZ2UuQ2FsbGJhY2suVjEiLCJhcHBjdHhzZW5kZXIiOiJPd2FEb3dubG9hZEBiOGQ1Njk3MC1hZmFkLTQ0MGEtYTA5ZC1hOTBkODg0OTFmZDkiLCJpc3NyaW5nIjoiV1ciLCJhcHBjdHgiOiJ7XCJtc2V4Y2hwcm90XCI6XCJvd2FcIixcInB1aWRcIjpcIjExNTM4MDExMjIxNDA2NTAyNDBcIixcInNjb3BlXCI6XCJPd2FEb3dubG9hZFwiLFwib2lkXCI6XCJjNmE3NTFhYS1hNmE4LTQ3ZTMtOTBlMC01NDQzNTBiNTFiZTJcIixcInByaW1hcnlzaWRcIjpcIlMtMS01LTIxLTE5MTAzMTE1MTUtMzY5MTY4NTA1MS0yMzkzNDYwMDY0LTUyNTkyODE2XCJ9IiwibmJmIjoxNjY2OTg4MTc5LCJleHAiOjE2NjY5ODg3NzksImlzcyI6IjAwMDAwMDAyLTAwMDAtMGZmMS1jZTAwLTAwMDAwMDAwMDAwMEBiOGQ1Njk3MC1hZmFkLTQ0MGEtYTA5ZC1hOTBkODg0OTFmZDkiLCJhdWQiOiIwMDAwMDAwMi0wMDAwLTBmZjEtY2UwMC0wMDAwMDAwMDAwMDAvYXR0YWNobWVudHMub2ZmaWNlLm5ldEBiOGQ1Njk3MC1hZmFkLTQ0MGEtYTA5ZC1hOTBkODg0OTFmZDkiLCJoYXBwIjoib3dhIn0.tiYr5WGYIPfsfPOqMIb8_-uePbph3GvHA-qXaNaloC74hmzURpy7sPMkslW68WW2wAPYnUBAvp0ew_U47-fHC1YZvuw-rPCOZSYk0ShukvyuIQV7vEpcAoFxPUtrpLnY2gF7Vlr2sDRYHgQ35H4hhxkc5s9JcNB4UtBWEhe4aw3CvHwtpPWcZM0fQy7Djqd2tybLbxYA-zueo4J678oYrhu3OvQRWGIzojK5-8N1NveCDGefJ3PU0-eQm9LzI35UY8ErVCZKnMuNnAh6rJMpFWJqYZXtpWlT_6L_jkICLT2zLjxakhbFreGxBjnhs7BNNuG7jsjo9yOSOS_80FH-Cg&X-OWA-CANARY=3UGmwbqj_keIkI-3300upvDF-U8hudoYTLh5EUb-bhFY_S2sFkadMxv3X_8vi3UCgiaqhVNe1Cg.&owa=outlook.office.com&scriptVer=20221021015.06&animation=true\" alt=\"A group of people holding certificates Description automatically generated with medium confidence\" /></p>\n<p><i>From L-R: Mr Desmond Tay, Vice President for Strategic Planning, City Energy, Mr Perry Ong, Chief Executive Officer, City Energy, Mr David DeVries, Chief Technology Officer, Sydrogen, Mr Mun Meng Wai, Assistant Director, Strategic Marketing, Sydrogen</i></p>\n<p>City Energy Pte Ltd. (as Trustee of City Energy Trust) (“City Energy”) and Sydrogen Energy Pte. Ltd. (“Sydrogen”) (hereinafter, the “Parties”) have signed a Memorandum of Understanding (MOU) to study the Proof of Concept (“PoC”) of generating an end-to-end hydrogen fuel cell solution for off- grid power supply, utilising high-purity hydrogen extracted from the town gas produced by City Energy. The study is expected to commence in early 2023 and will continue until mid-2024, at which point the parties will further explore town gas-powered hydrogen fuel cells for broader off-grid applications.</p>\n<p>&nbsp;</p>\n<p>Hydrogen has gained global recognition as an important potential energy source in the world’s journey towards decarbonisation, with more than 50 countries having committed to hydrogen road maps and announced associated projects. This is the first time that a hydrogen fuel cell study will be conducted using town gas as fuel source in Singapore.</p>\n<p>&nbsp;</p>\n<p>Hydrogen has emerged as a key component of Singapore’s decarbonisation strategy, with the announcement of the “4 Switches” in 2019, and Energy Market Authority (EMA)’s Energy 2050 Committee Report. Distributed Energy Resources (“DER”) from clean energy like low-carbon hydrogen, coupled with smart technologies like Artificial Intelligence (AI), enable Singapore’s energy grid to flexibly optimise the system at a local level, leading to reduced overall grid capacity and costs. Advancement of smart technologies also accelerate aggregation and management of DERs acting as a virtual power plant, which contributes to a more reliable and stable system.</p>\n<p>&nbsp;</p>\n<p>Singapore has stepped up efforts to electrify its transport sector with supporting infrastructure. This includes establishing up to 60,000 Electric Vehicle (EV) charging points island wide by 2030. Such rapid electrification will add significant demand to the power grid, thereby necessitating grid upgrades where current electrical infrastructure is insufficient to meet demand.</p>\n<p>&nbsp;</p>\n<p>In view of these developments, City Energy is collaborating with Sydrogen on a proof of concept to establish the viability of distributed power generation using fuel cells and the town gas network. The parties seek to demonstrate that hydrogen fuel cells can be used as an off-grid decentralised means to augment grid infrastructure upgrades that support large-scale EV charging in the future.</p>\n<p>&nbsp;</p>\n<p>For City Energy, which is the sole producer and retailer of town gas in Singapore, successful completion of the PoC would enable the repurposing of the extensive town gas network for the distribution of hydrogen via hydrogen-enriched (up to 65%) town gas to fuel a network of hydrogen fuel cells around the island and form a network of DERs to serve residential and commercial users with on-site basic utilities and EV charging.</p>\n<p>&nbsp;</p>\n<p>Perry Ong, Chief Executive Officer of City Energy, said: “As the nation’s sole piped town gas provider for more than 880,000 homes and businesses, we look forward to the possibility of using the town gas network to support the hydrogen economy development, and accelerate deployment of green hydrogen in Singapore. It is our pleasure to collaborate with Sydrogen on this innovative PoC to accelerate Singapore’s hydrogen adoption, electrification goals and path to net zero emissions.”</p>\n<p>&nbsp;</p>\n<p>David DeVries, Chief Technology Officer of Sydrogen, said: “Decentralised power generation plays an important role in diversifying our energy use. The proof of concept combines Sydrogen’s Deep Tech capabilities with a key ecosystem player to develop home-grown solutions for to future-proof Singapore’s energy supply future. We are glad to work with forward-looking partners such as City Energy in this endeavour”.</p>\n<p>&nbsp;</p>\n<p>While Sydrogen, a JV between Nanofilm Technologies International and a subsidiary of Temasek, was only formed in 2021, Sydrogen has already begun shipping of metallic bipolar plates to a key automotive customer in China and also the provision of coating services to other players in the market. This PoC will provide additional opportunity to showcase Sydrogen’s capabilities in stationary and distributed power systems connected to gas networks.</p>\n<p>&nbsp;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com/city-energy-and-sydrogen-to-study-development-of-off-grid-fuel-cell-solutions/\">City Energy and Sydrogen to Study Development of Off-Grid Fuel Cell Solutions</a> appeared first on <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com\">IAA - Industrial Automation</a>.</p>\n"
}