{
  "title": "63: Samantha Bennett- How To \"Start Right Where You Are\"",
  "pubDate": "Wed, 30 Nov 2016 03:18:34 +0000",
  "guid": "8991d66a022091b63187dc82c20517e4",
  "link": "https://lifeonpurpose.libsyn.com/63-samantha-bennett-how-to-start-right-where-you-are",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #63</strong>, my guest is author, actor, teacher, and creativity/productivity specialist <strong>Samantha Bennett</strong>, who has counseled thousands of artists in all disciplines on their way to success.</p> <p><strong>Sam</strong> is the creator of The Organized Artist Company – a multi-six figure business she has built by hand, from scratch. Her previous book, the bestselling “<strong><em>Get It Done: From Procrastination to Creative Genius in 15 Minutes a Day</em></strong>” received rave reviews, including Seth Godin, who called it, \"An instant classic.\"<br /> <br /> <strong>Sam</strong> joined me for a high-energy chat about her new book <em><strong>Start Right Where You Are: How Little Changes Can Make a Big Difference for Overwhelmed Procrastinators, Frustrated Overachievers, and Recovering Perfectionists</strong></em> (New World Library), which is based on the premise that small shifts in the right direction can yield big results in the realization of our creative dreams.<br /> <br /> <strong>Start Right Where You Are</strong> offers 66 small, doable changes that will help readers:<br /> <br /> • Complete projects that are dear to their hearts<br /> <br /> • Change their relationship with their bodies and improve their physical health<br /> <br /> • Transform their relationships with people who are important to them<br /> <br /> • Get their work out in the world<br /> <br /> <em>“When you decide that you want something and you move toward it physically, emotionally, or spiritually, then your movement opens up new pathways by which things can appear in your life. Even a very small step can cause a radical change in your relationship to the thing you want. Even a small shift in perspective can allow you to see new opportunities.”</em><br /> <br /> About: Originally from Chicago, <strong>Samantha Bennett</strong> is an author, actor, teacher and creativity/productivity specialist who has counseled thousands of artists in all disciplines on their way to success. She is the creator of The Organized Artist Company – a multi-six figure business she has built by hand, from scratch.<br /> <br /> Her bestselling book, “<strong><em>Get It Done: From Procrastination to Creative Genius in 15 Minutes a Day</em></strong>” (New World Library) has received rave reviews, including from than the great Seth Godin, who called it, \"An instant classic.\"<br /> <br /> She is an an email marketing and small business automation expert and was named the 2010 Ultimate Marketer Finalist by Infusionsoft, and she is an Infusionsoft Certified Consultant, Reseller and Partner.<br /> <br /> <strong>Sam</strong> has self-published four books: “By The Way, You Look Really Great Today,” \"An Artist Talks to God,\" “365 Reasons To Write” and \"Less Crazy, More Money: 52 Secrets to Running a Serene, Profitable Business.\"<br /> <br /> Her latest book is the critically- acclaimed, \"<strong><em>Start Right Where You Are: How Little Changes Can Make a Big Difference for Overwhelmed Procrastinators, Frustrated Overachievers and Recovering Perfectionists</em></strong>\" - the book that emerged from this workshop.<br /> <br /> Still a working actor (Modern Family, Drew Carey Show, Strong Medicine) <strong>Samantha</strong> has also written several plays, including, “Kiss The Monster,” “Miss Millicent’s Fall Recital” and “In A Booth At Chasen’s.” As an alumni of The Second City in Chicago, ComedySportz LA, The Open Fist Theatre Company and LA TheatreWorks, <strong>Samantha</strong> is known for her quick wit and warm heart.<br /> <br /> Her 12 years as a professional Personal Branding Specialist with Sam Christensen Studios has given her an uncanny ability to help people recognize and capitalize on their own brilliance.<br /> <br /> <strong>Sam</strong> abides in a quiet little beach town outside of Los Angeles, where she hangs out with the dolphins and the seals, living the life of her dreams.<br /> <br /> To learn more about <strong>Sam</strong> and her work, visit: <a href=\"http://www.startrightwhereyouare.com/\" target= \"_blank\">http://www.startrightwhereyouare.com/</a>.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #63, my guest is author, actor, teacher, and creativity/productivity specialist Samantha Bennett, who has counseled thousands of artists in all disciplines on their way to success.</p> <p>Sam is the creator of The Organized Artist Company – a multi-six figure business she has built by hand, from scratch. Her previous book, the bestselling “<em>Get It Done: From Procrastination to Creative Genius in 15 Minutes a Day</em>” received rave reviews, including Seth Godin, who called it, \"An instant classic.\"  Sam joined me for a high-energy chat about her new book <em>Start Right Where You Are: How Little Changes Can Make a Big Difference for Overwhelmed Procrastinators, Frustrated Overachievers, and Recovering Perfectionists</em> (New World Library), which is based on the premise that small shifts in the right direction can yield big results in the realization of our creative dreams.  Start Right Where You Are offers 66 small, doable changes that will help readers:  • Complete projects that are dear to their hearts  • Change their relationship with their bodies and improve their physical health  • Transform their relationships with people who are important to them  • Get their work out in the world  <em>“When you decide that you want something and you move toward it physically, emotionally, or spiritually, then your movement opens up new pathways by which things can appear in your life. Even a very small step can cause a radical change in your relationship to the thing you want. Even a small shift in perspective can allow you to see new opportunities.”</em>  About: Originally from Chicago, Samantha Bennett is an author, actor, teacher and creativity/productivity specialist who has counseled thousands of artists in all disciplines on their way to success. She is the creator of The Organized Artist Company – a multi-six figure business she has built by hand, from scratch.  Her bestselling book, “<em>Get It Done: From Procrastination to Creative Genius in 15 Minutes a Day</em>” (New World Library) has received rave reviews, including from than the great Seth Godin, who called it, \"An instant classic.\"  She is an an email marketing and small business automation expert and was named the 2010 Ultimate Marketer Finalist by Infusionsoft, and she is an Infusionsoft Certified Consultant, Reseller and Partner.  Sam has self-published four books: “By The Way, You Look Really Great Today,” \"An Artist Talks to God,\" “365 Reasons To Write” and \"Less Crazy, More Money: 52 Secrets to Running a Serene, Profitable Business.\"  Her latest book is the critically- acclaimed, \"<em>Start Right Where You Are: How Little Changes Can Make a Big Difference for Overwhelmed Procrastinators, Frustrated Overachievers and Recovering Perfectionists</em>\" - the book that emerged from this workshop.  Still a working actor (Modern Family, Drew Carey Show, Strong Medicine) Samantha has also written several plays, including, “Kiss The Monster,” “Miss Millicent’s Fall Recital” and “In A Booth At Chasen’s.” As an alumni of The Second City in Chicago, ComedySportz LA, The Open Fist Theatre Company and LA TheatreWorks, Samantha is known for her quick wit and warm heart.  Her 12 years as a professional Personal Branding Specialist with Sam Christensen Studios has given her an uncanny ability to help people recognize and capitalize on their own brilliance.  Sam abides in a quiet little beach town outside of Los Angeles, where she hangs out with the dolphins and the seals, living the life of her dreams.  To learn more about Sam and her work, visit: <a href=\"http://www.startrightwhereyouare.com/\" target= \"_blank\">http://www.startrightwhereyouare.com/</a>.</p>",
  "enclosure": "",
  "itunes:duration": "01:01:04",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #63, my guest is author, actor, teacher, and creativity/productivity specialist Samantha Bennett, who has counseled thousands of artists in all disciplines on their way to success. Sam is the creator of The Organized Artist..."
}