{
  "title": "A Practical, Progressively-Expressive GNN. (arXiv:2210.09521v3 [cs.LG] UPDATED)",
  "link": "http://arxiv.org/abs/2210.09521",
  "description": "<p>Message passing neural networks (MPNNs) have become a dominant flavor of\ngraph neural networks (GNNs) in recent years. Yet, MPNNs come with notable\nlimitations; namely, they are at most as powerful as the 1-dimensional\nWeisfeiler-Leman (1-WL) test in distinguishing graphs in a graph isomorphism\ntesting frame-work. To this end, researchers have drawn inspiration from the\nk-WL hierarchy to develop more expressive GNNs. However, current\nk-WL-equivalent GNNs are not practical for even small values of k, as k-WL\nbecomes combinatorially more complex as k grows. At the same time, several\nworks have found great empirical success in graph learning tasks without highly\nexpressive models, implying that chasing expressiveness with a coarse-grained\nruler of expressivity like k-WL is often unneeded in practical tasks. To truly\nunderstand the expressiveness-complexity tradeoff, one desires a more\nfine-grained ruler, which can more gradually increase expressiveness. Our work\nputs forth such a proposal: Namely, we first propose the (k, c)(&lt;=)-SETWL\nhierarchy with greatly reduced complexity from k-WL, achieved by moving from\nk-tuples of nodes to sets with &lt;=k nodes defined over &lt;=c connected components\nin the induced original graph. We show favorable theoretical results for this\nmodel in relation to k-WL, and concretize it via (k, c)(&lt;=)-SETGNN, which is as\nexpressive as (k, c)(&lt;=)-SETWL. Our model is practical and\nprogressively-expressive, increasing in power with k and c. We demonstrate\neffectiveness on several benchmark datasets, achieving several state-of-the-art\nresults with runtime and memory usage applicable to practical graphs. We open\nsource our implementation at https://github.com/LingxiaoShawn/KCSetGNN.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Zhao_L/0/1/0/all/0/1\">Lingxiao Zhao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Hartel_L/0/1/0/all/0/1\">Louis H&#xe4;rtel</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Shah_N/0/1/0/all/0/1\">Neil Shah</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Akoglu_L/0/1/0/all/0/1\">Leman Akoglu</a>"
}