{
  "title": "Who Actually Owns Tesla’s Data?",
  "link": "https://spectrum.ieee.org/tesla-autopilot-data-ownership",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/nighttime-photograph-of-a-man-in-a-car-at-an-outdoor-tesla-charging-lot.jpg?id=30547112&width=600&height=600&coordinates=504%2C0%2C496%2C0\"/><br/><br/><p>On 29 September 2020, a masked man entered a branch of the Wells Fargo bank in Washington, D.C., and handed the teller a note: “This is a robbery. Act calm give me all hundreds.” The teller complied. The man then fled the bank and jumped into a gray Tesla Model S. This was one of three bank robberies the man attempted the same day.<br/></p><p>When FBI agents began investigating, they reviewed Washington, D.C.’s <a href=\"https://ddot.dc.gov/\" target=\"_blank\">District Department of Transportation</a> camera footage, and spotted a Tesla matching the getaway vehicle’s description. The license plate on that car showed that it was registered to Exelorate Enterprises LLC, the parent company of <a href=\"https://www.steerev.com/\" target=\"_blank\">Steer EV</a>—a D.C.-based monthly vehicle-subscription service.</p><p>Agents served a subpoena on Steer EV for the renter’s billing and contact details. Steer EV provided those—and also voluntarily supplied historical GPS data for the vehicle. The data showed the <a href=\"https://www.documentcloud.org/documents/22088133-1-1-statement-of-facts\" rel=\"noopener noreferrer\" target=\"_blank\">car driving between, and parking at, each bank at the time of the heists</a>. The renter was arrested and, in September, sentenced to four years in prison.</p><p class=\"pull-quote\">“If an entity is collecting, retaining, [and] sharing historical location data on an individualized level, it’s extraordinarily difficult to de-identify that, verging on impossible.”<br/>—John Verdi, Future of Privacy Forum</p><p>In this case, the GPS data likely came from a device Steer EV itself installed in the vehicle (neither Steer nor Tesla responded to interview requests). However, according to researchers, as discussed in previous entries in<em> Spectrum</em>'s investigative series on Tesla's data (<a href=\"https://spectrum.ieee.org/tesla-autopilot-data-scope\" target=\"_blank\">installment one</a>; <a href=\"https://spectrum.ieee.org/tesla-autopilot-data-deluge\" target=\"_blank\">installment two</a>), Tesla is potentially in a position to provide similar GPS tracks for many of its 3 million customers.</p><p>For Teslas built since mid-2017, “every time you drive, it records the whole track of where you drive, the GPS coordinates and certain other metrics for every mile driven,” says <a href=\"https://twitter.com/greentheonly?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\" rel=\"noopener noreferrer\" target=\"_blank\">Green</a>, a Tesla owner who has reverse engineered the company’s Autopilot data collection. “They say that they are anonymizing the trigger results,” but, he says, “you could probably match everything to a single person if you wanted to.”</p><p>Each of these trip logs, and other <a href=\"https://spectrum.ieee.org/tesla-autopilot-data-scope\" target=\"_self\">data “snapshots” captured by the Autopilot system</a> that include images and video, is stripped of its identifying VIN and given a temporary, random ID number when it is uploaded to Tesla, says Green. However, he notes, that temporary ID can persist for days or weeks, connecting all the uploads made during that time.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"Black and white photo of a man in a suit looking off into the distance\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"f5ca99cffc8e7b6e210f39d7f7d37e39\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"58062\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/black-and-white-photo-of-a-man-in-a-suit-looking-off-into-the-distance.jpg?id=30563961&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Elon Musk, CEO of Tesla Motors</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Mark Mahaney/Redux</small></p><p>Given that some trip logs will also likely record journeys between a driver’s home, school, or place of work, guaranteeing complete anonymity is unrealistic, says <a href=\"https://fpf.org/person/john-verdi/\" rel=\"noopener noreferrer\" target=\"_blank\">John Verdi</a>, senior vice president of policy at the Future of Privacy Forum: “If an entity is collecting, retaining, [and] sharing historical location data on an individualized level, it’s extraordinarily difficult to de-identify that, verging on impossible.”</p><p>Tesla, like all other automakers, has a <a href=\"https://www.tesla.com/legal/privacy#location-data\" rel=\"noopener noreferrer\" target=\"_blank\">policy</a> that spells out what it can and cannot do with the data it gets from customers’ vehicles, including location information. This states that while the company does not sell customer and vehicle data, it can share that data with service providers, business partners, affiliates, some authorized third parties, and government entities according to the law.</p><p>Owners can buy a <a href=\"https://crashdatagroup.com/collections/tesla-edr-tool/products/edr-kit-for-tesla-vehicles\" rel=\"noopener noreferrer\" target=\"_blank\">special kit for US $1,400</a> that allows them to access data on their own car's event data recorder, but this represents just a tiny subset of the data the company collects, and is related only to crashes. Owners living in California and <a href=\"https://spectrum.ieee.org/your-guide-to-the-gdpr\" target=\"_self\">Europe</a> benefit from legislation that means Tesla will provide access to more data generated by their vehicles, although not the Autopilot snapshots and trip logs that are supposedly anonymized.</p><p>Once governments realize that a company possesses such a trove of information, it could be only a matter of time before they seek access to it. “If the data exists…and in particular exists in the domain of somebody who’s not the subject of those data, it’s much more likely that a government will eventually get access to them in some way,” says <a href=\"https://sc.edu/study/colleges_schools/law/faculty_and_staff/directory/smith_bryant_walker.php\" rel=\"noopener noreferrer\" target=\"_blank\">Bryant Walker Smith</a>, an associate professor in the schools of law and engineering at the University of South Carolina.</p><p class=\"pull-quote\">“Individuals ought to think about their cars more like they think about their cellphones.”<br/>—John Verdi, Future of Privacy Forum</p><p>This is not necessarily a terrible thing, Walker says, who suggests that such rich data could unlock valuable insights into which roads or intersections are dangerous. The wealth of data could also surface subtle problems in the vehicles themselves.</p><p>In many ways, the data genie is already out of the bottle, according to Verdi. “Individuals ought to think about their cars more like they think about their cellphones,” he says. “The auto industry has a lot to learn from the ways that mobile-phone operating systems handle data permissions…. Both iOS and Android have made great strides in recent years in empowering consumers when it comes to data collection, data disclosure, and data use.”</p><p>Tesla permits owners to control some data sharing, including Autopilot and road segment analytics. If they want to opt out of data collection completely, they can <a href=\"https://www.tesla.com/legal/privacy\" rel=\"noopener noreferrer\" target=\"_blank\">ask Tesla to disable the vehicle’s connectivity altogether</a>. However, this would mean losing features such as remote services, Internet radio, voice commands, and Web browser functionality, and even safety-related over-the-air updates.</p><p>Green says he is not aware of anyone who has successfully undergone this nuclear option. The only real way to know you’ve prevented data sharing, he says, is to “go to a repair place and ask them to remove the modem out of the car.” </p><p>Tesla almost certainly has the biggest empire of customer and vehicle data among automakers. It also appears to be the most aggressive in using that data to develop its automated driving systems, and to protect its reputation in the courts of law and public opinion, even to the detriment of some of its customers.</p><p>But while the world’s most valuable automaker dominates the discussion around connected cars, others are not far behind. Elon Musk’s insight—to embrace the data-driven world that our other digital devices already inhabit—is rapidly becoming the industry standard. When our cars become as powerful and convenient as our phones, it is hardly surprising that they suffer the same challenges around surveillance, privacy, and accountability.</p><p><em>This article appears in the October 2022 print issue as “The Radical Scope of Tesla’s Data Hoard.”</em></p>",
  "pubDate": "Fri, 05 Aug 2022 15:26:58 +0000",
  "guid": "https://spectrum.ieee.org/tesla-autopilot-data-ownership",
  "category": [
    "Tesla motors",
    "Autopilot",
    "Big data"
  ],
  "dc:creator": "Mark Harris",
  "media:content": ""
}