{
  "title": "S14 Ep107: Haunting of The Boyd House",
  "link": "https://audioboom.com/posts/8098523",
  "itunes:episode": 107,
  "itunes:title": "Haunting of The Boyd House",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 3744,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS investigates the Haunting of The Boyd House with guest Jill Shelley!<br>\n<br>\nThere is a Haunted House in Boyd MN, no one knows exactly why it is haunted but it appears to be quite active with strange occurrences happening on a regular basis. From touching to voice, shadows to things moving on their own, today we will explore the history and claims of haunted activity.<br>\n<br>\nVisit the site here: <a href=\"http://www.stcroixparanormal.com/boyd-house-l-l-c-.html\">http://www.stcroixparanormal.com/boyd-house-l-l-c-.html</a><br>\n<br>\nParanormal Books and Swag hand picked by Darkness Dave right here:<br>\n<a href=\"https://www.amazon.com/shop/darknessradiodave\">https://www.amazon.com/shop/darknessradiodave</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nAre you playing along with Beyond the Darkness on the Podcast One/ <a href=\"http://Betonline.AG\">Betonline.AG</a> Sportsnet Challenge?!  Each Week Dave and Tim are picking the winners of five NFL gam,es and playing against the hosts of different Podcast One shows!  If you play aloing with Dave and Tim on <a href=\"http://BetOnline.AG\">BetOnline.AG</a>, and they win the week, you qualify to be one of five winners splitting a $500 weekly prize! To sign up go to <a href=\"https://promotions.betonline.ag/podcastone\">https://promotions.betonline.ag/podcastone</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.<br>\n<br>\nWe all know mental health is a big part of self-care. But changing mental habits is easier said than done. Luckily, Talkspace online therapy gives you a convenient and affordable way to improve your mental health.  Our listeners can get $100 off their first month by using code DARKNESS at <a href=\"http://talkspace.com\">talkspace.com</a> right now!",
  "itunes:summary": "BEYOND the DARKNESS investigates the Haunting of The Boyd House with guest Jill Shelley!\n\nThere is a Haunted House in Boyd MN, no one knows exactly why it is haunted but it appears to be quite active with strange occurrences happening on...",
  "pubDate": "Sun, 29 Dec 2019 10:00:00 +0000",
  "guid": "bbbcaf1d-4a94-474b-8c49-6cfdf273d9e2",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}