{
  "title": "Gravitational wave stochastic background in reduced Horndeski theories. (arXiv:2211.01405v1 [gr-qc])",
  "link": "http://arxiv.org/abs/2211.01405",
  "description": "<p>We generalize to reduced Horndeski theories of gravity, where gravitational\nwaves (GWs) travel at the speed of light, the expression of a statistically\nhomogeneous and unpolarized stochastic gravitational wave background (SGWB)\nsignal measured as the correlation between the individual signals detected by\ntwo interferometers in arbitrary configurations. We also discuss some results\nfound in the literature regarding cosmological distances in modified theories,\nnamely, the simultaneous validity of a duality distance relation for GW signals\nand of the coincidence between the gravitational wave luminosity distance,\nbased on the energy flux, and the distance inferred from the wave amplitude.\nThis discussion allows us to conclude that the spectral energy density per unit\nsolid angle of an astrophysical SGWB signal has the same functional dependency\nwith the luminosity of each emitting source as in General Relativity (GR).\nUsing the generalized expression of the GW energy-momentum tensor and the\nmodified propagation law for the tensor modes, we conclude that the energy\ndensity of a SGWB maintains the same functional relation with the scale factor\nas in GR, provided that the modified theory coincides with GR in a given\nhypersurface of constant time. However, the relation between the detected\nsignal and the spectral energy density is changed by the global factor\n$G_4(\\varphi(t_0))$, thus potentially serving as a probe for modified gravity\ntheories.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/gr-qc/1/au:+Lobato_J/0/1/0/all/0/1\">Jo&#xe3;o C. Lobato</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Matos_I/0/1/0/all/0/1\">Isabela S. Matos</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Calvao_M/0/1/0/all/0/1\">Maur&#xed;cio O. Calv&#xe3;o</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Waga_I/0/1/0/all/0/1\">Ioav Waga</a>"
}