{
  "title": "The BBC made up a story about a Russian &#039;attack&#039; on a Ukrainian city&#039;s water supply – where are the &#039;fake news&#039; fact checkers?",
  "link": "https://www.rt.com/news/565788-bbc-fake-news/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565788-bbc-fake-news/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63628a5385f54002e72ce995.jpg\" /> The BBC was caught promoting completely fake news about the Russian ‘attack’ in Nikolaev <br/><a href=\"https://www.rt.com/news/565788-bbc-fake-news/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Britain's state broadcaster claimed that Moscow's troops tried to create a drought in Nikolaev, using false information</strong></p>\n            \n                        \n            <p>On October 25, BBC News <a href=\"https://www.bbc.com/news/world-europe-63383605\">published</a> an absolutely shocking exclusive report revealing that residents of the southern Ukrainian city of Nikolaev (which current officials in Kiev insist should be spelt as \"Mykolaiv,\" in English)&nbsp;had been without clean drinking water for six months, due to attacks on a pipeline supplying the city.&nbsp;<em>&ldquo;Evidence collected&rdquo;</em> by the British state broadcaster pointed to this being <em>&ldquo;a deliberate act by Russian forces&rdquo;</em> intended to cause mass dehydration and death among the local population.</p>\n<p>Strangely though, despite all the sound and fury and finger-pointing, the BBC stopped short of condemning the alleged action as an outright war crime, simply noting that <em>&ldquo;destroying resources vital for civilian life is widely regarded as a violation of international humanitarian law.&rdquo;</em>&nbsp;</p>\n<p>This reluctance seems rather strange, given that the Beeb&nbsp;appears&nbsp;to offer an open-and-shut case, including <em>&ldquo;satellite imagery and data&rdquo;</em> showing the pipeline <em>&ldquo;was deliberately destroyed while under Russian control,&rdquo;</em> and bold declarations from esteemed military experts that it was a calculated act by Moscow.</p>\n<p>The reasons for the BBC&rsquo;s hesitancy soon become very clear, though. A key part of its case against Russia is that <em>&ldquo;two separate points on the same pipeline&rdquo;</em> were <em>&ldquo;damaged in ways that are consistent with sabotage.&rdquo;</em> Photos of this damage are provided in the article, at least one being an &ldquo;exclusive&rdquo; that was &ldquo;given&rdquo; to BBC journalists by unidentified people while in Nikolaev.</p>\n<p>Other photos of tanks <em>&ldquo;close to the pipe&rdquo;</em>&nbsp;while the area was <em>&ldquo;under Russian control&rdquo;</em> are thus said to point to <em>&ldquo;occupying Russian forces deliberately cutting off the water supply.&rdquo;</em></p>\n    <figure>\n        <img src=\"https://mf.b37mrtl.ru/files/2022.11/original/63628a622030270c910771d0.jpg\"  />\n                    <figcaption>\n                \n                <span class = \"copyright\">\n                      ©&nbsp; BBC                                                        </span>\n            </figcaption>\n            </figure>\n\n<p>Of course, images of someone&nbsp;&ndash; or something&nbsp;&ndash; near a subsequent murder scene is far from even circumstantial evidence, let alone proof that they pulled the trigger or wielded the knife. But the British state broadcaster&rsquo;s already shaky case is even less convincing when you consider that we may not be dealing with a murder scene in the first place.&nbsp;</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/6352e73e20302741fc1197c6.jpg\" alt=\"James Gordon Meek, an ABC News investigative journalist.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565070-abc-investigative-journalist-disappeared/\">An ABC News investigative journalist disappeared six months ago. He seems to have known a lot about American aims in Ukraine</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Don&rsquo;t take RT&rsquo;s word for it. The BBC itself seems simultaneously uncertain as to whether the deliberate destruction it claims the pictures show is in fact destruction at all. Descriptive texts accompanying the two highly pixelated, blurry shots&nbsp;&ndash; which may suggest they were taken on extremely dated photographic equipment, and/or aren&rsquo;t at all recent&nbsp;&ndash; add a small but hugely significant caveat to the allegation.</p>\n<p><em>&ldquo;These photos appear to show damage caused to Mykolaiv's water supply pipeline,&rdquo;</em> says one, while the other states, <em>&ldquo;the pipeline appears to have been damaged in a second area.&rdquo;</em></p>\n<p>Such equivocation by a prosecution lawyer would get a case thrown out of any UK court in the West, on principle. If a non-mainstream media source was to engage in similar ambiguity when reporting on a matter of this seriousness, the Brussels-bankrolled&nbsp;<a href=\"https://euvsdisinfo.eu/\">EU vs Disinfo</a>&nbsp;information war team&nbsp;would be on the scene in minutes to condemn the article&rsquo;s author and the outlet that published it.&nbsp;</p>\n<p>Either the photos show damage&nbsp;&ndash; deliberate or otherwise&nbsp;&ndash; or they don&rsquo;t. It&rsquo;s one or the other, and certainly not both.</p>\n    <figure>\n        <img src=\"https://mf.b37mrtl.ru/files/2022.11/original/63628a622030270c910771d1.jpg\"  />\n                    <figcaption>\n                \n                <span class = \"copyright\">\n                      ©&nbsp; BBC                                                        </span>\n            </figcaption>\n            </figure>\n\n<p></p>\n<h2>Conflict of interest, much?</h2>\n<p>As if to resolve the conundrum its own lack of certainty creates, the BBC goes on to consult two &ldquo;security experts&rdquo; so as to fortify the headline charge of deliberate Russian wrecking.</p>\n<p>The first quoted is Chris Cobb Smith, a &ldquo;military forensics expert who served in the British Army as an artillery officer for over 20 years and spent three years as a UN weapons inspector in Iraq.&rdquo; He vehemently dismissed any suggestion the pipe could&rsquo;ve been &ldquo;damaged&rdquo;&nbsp;&ndash; note we&rsquo;re suddenly back to certainty on this crucial point again&nbsp;&ndash; by tank fire, or accidental &ldquo;random shelling,&rdquo; calling the chances of an &ldquo;indirect fire strike&rdquo; being responsible &ldquo;infinitesimal.&rdquo;</p>\n<p>Instead, he&nbsp;claims that the &ldquo;intentional placement of an explosive charge either directly under the pipe or possibly on top of it, at the most vulnerable point,&rdquo; was to blame. Absent from the article was any acknowledgement of the fact that his work as a &ldquo;media security&rdquo; consultant <a href=\"http://www.chiron-resources.com/about.html\">started</a> in 2000, when he approached none other than the BBC and offered his services in this regard directly.&nbsp;</p>\n<p>It was a welcome advance. His company, Chiron Associates, boasts that the British state broadcaster&nbsp;&ndash; among a great many other Western news outlets that have likewise published dubious claims about the conflict in Ukraine&nbsp;&ndash; remains a client to this day. Cobb-Smith also moonlights as an <a href=\"https://forensic-architecture.org/about/team/member/chris-cobb-smith\">investigator</a> for Forensic Architecture, which played a prominent role in disseminating and legitimizing blatantly false war propaganda related to the Syrian crisis.</p>\n<p>Still, his potentially not-so-independent view is reinforced by Michael Whelan, a &ldquo;security expert who served in the British military for over 20 years,&rdquo; who agrees &ldquo;the damage to the pipeline was deliberately caused by explosives.&rdquo; His unstated day job could amount to a conflict of interest even larger&nbsp;than Cobb-Smith&rsquo;s, for he serves as an &ldquo;international security advisor&rdquo; at <a href=\"https://www.operatorscircle.com/about-us/michael-whelan/\">Operators Circle</a>.&nbsp;</p>\n<p>The company connects retired military veterans looking for new opportunities to carry out their deadly trade in the private sphere, with companies on the hunt for mercenaries to hire. The landing page of the Operators Circle website indicates that the Western proxy war in Ukraine is very much a hotspot for recruitment, and a big earner from the firm&rsquo;s perspective as a result.</p>\n    <figure>\n        <img src=\"https://mf.b37mrtl.ru/files/2022.11/original/63628a622030270c910771cf.jpg\"  />\n                    <figcaption>\n                \n                <span class = \"copyright\">\n                      ©&nbsp; Telegram / Тимофей Ви                                                        </span>\n            </figcaption>\n            </figure>\n\n<p>Maybe it would be unwise to discount the insight of the &ldquo;experts&rdquo; Cobb-Smith and Whelan. Although, if their claims of explosives blowing up the pipe, not tank shelling, are true, that means the BBC&rsquo;s photo of tanks near the pipeline is completely immaterial, because a tank wasn&rsquo;t used to inflict the damage. But then, why didn&rsquo;t the Russians just use tanks if they wished to destroy the pipeline, as that capability was so near at the time?</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/635fcbf2203027716c40859c.jpg\" alt=\"RT\" />\n            <figcaption><a href=\"https://www.rt.com/news/565660-erdogan-vs-ataturk/\">Erdogan vs. Ataturk: Will modern Türkiye’s leader finally bury the legacy of the republic's iconic founder?</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<h2>A neverending story</h2>\n<p>Delivering a further coup de gr&acirc;ce to the narrative of deliberate Russian sabotage, a diligent and eagle-eyed Telegrammer <a href=\"https://t.me/timofei_v/630\">geolocated</a> where the BBC claimed the damage was inflicted based on the photo of the tanks nearby, and dug up archived satellite images of the site dating back a number of years, as far as 2006. The same apparent &ldquo;destruction&rdquo; is present in every frame. In other words, there was no damage.</p>\n<p>Still, why let facts get in the way of a good story? Shock headlines and allegations of major Russian atrocities get clicks and draw viewers, and very effectively serve the interests of the British state, which claims it is funnelling endless weapons to Kiev not in service of endlessly prolonging a brutal proxy conflict, but to save Ukraine and Ukrainians from &ldquo;genocide.&rdquo;</p>\n<p>It is ironic&nbsp;&ndash; and no doubt a disappointment to the British state broadcaster&nbsp;&ndash; that the landmark waterpipe &ldquo;exclusive&rdquo; largely went unreported on by the rest of the Western media. That may be an indication that, at this stage, sensational stories of Kremlin-directed war crimes are published so regularly that&nbsp;news organizations simply can&rsquo;t keep up with it all. In fact, since the BBC&rsquo;s baseless report dropped a week ago, we&rsquo;re well overdue for the next avalanche of lies, whether from government controlled outlets or the \"free press.\"</p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 08:36:25 +0000",
  "dc:creator": "RT"
}