{
  "title": "Episode 41 - Debra J. Stone",
  "itunes:title": "Debra J. Stone",
  "pubDate": "Fri, 22 Mar 2019 21:00:00 +0000",
  "guid": "795e72a75c054d1ebecc8f8f06b4372c",
  "link": "https://givensbmr.libsyn.com/debra-stone",
  "itunes:image": "",
  "description": "<p>Minnesota-based writer Debra J. Stone sits down with Lissa Jones for a wide-ranging conversation about writing the stories she wants to read, her upbringing in the Rondo Neighborhood and the Northside, and what it means to be a black woman who loves to bike and camp.</p> <p><span style=\"font-weight: 400;\">Stone’s poetry, short-fiction and essays have appeared in many publications and literary journals including</span> <em><span style=\"font-weight: 400;\">About Place</span></em><span style=\"font-weight: 400;\">,</span> <em><span style=\"font-weight: 400;\">Wild Age Press</span></em><span style=\"font-weight: 400;\">, and</span> <em><span style=\"font-weight: 400;\">Random Sample Review.</span></em> <span style=\"font-weight: 400;\">Stone co-founded and co-facilitates the Northside Writers Group, and is currently a fellow at the Loft Literary Center in Minneapolis. She has received grants from Intermedia Arts, Beyond the Pure Fellowship, Jerome Foundation for Emerging Writers and the Minnesota State Arts Board. C</span><span style= \"font-weight: 400;\">urrently, Debra serves as Board Member and Engagement Committee Chair for the non-profit independent publisher Graywolf Press.</span></p>",
  "content:encoded": "<p>Minnesota-based writer Debra J. Stone sits down with Lissa Jones for a wide-ranging conversation about writing the stories she wants to read, her upbringing in the Rondo Neighborhood and the Northside, and what it means to be a black woman who loves to bike and camp.</p> <p>Stone’s poetry, short-fiction and essays have appeared in many publications and literary journals including <em>About Place</em>, <em>Wild Age Press</em>, and <em>Random Sample Review.</em> Stone co-founded and co-facilitates the Northside Writers Group, and is currently a fellow at the Loft Literary Center in Minneapolis. She has received grants from Intermedia Arts, Beyond the Pure Fellowship, Jerome Foundation for Emerging Writers and the Minnesota State Arts Board. Currently, Debra serves as Board Member and Engagement Committee Chair for the non-profit independent publisher Graywolf Press.</p>",
  "enclosure": "",
  "itunes:duration": "42:27",
  "itunes:explicit": false,
  "itunes:keywords": "writing,paul,camping,minnesota,St,Women,essays,nonfiction,Community,minneapolis,loft,rondo",
  "itunes:subtitle": "Minnesota-based writer Debra J. Stone sits down with Lissa Jones for a wide-ranging conversation about writing the stories she wants to read, her upbringing in the Rondo Neighborhood and the Northside, and what it means to be a black woman who loves...",
  "itunes:season": 4,
  "itunes:episode": 7,
  "itunes:episodeType": "full",
  "itunes:author": "The Givens Foundation for African American Literature / iDream.tv"
}