{
  "id": "yt:video:ov7UniDqWo0",
  "yt:videoId": "ov7UniDqWo0",
  "yt:channelId": "UC510QYlOlKNyhy_zdQxnGYw",
  "title": "The Military Went Too Far With These Disturbing Experiments",
  "link": "",
  "author": {
    "name": "Simple History",
    "uri": "https://www.youtube.com/channel/UC510QYlOlKNyhy_zdQxnGYw"
  },
  "published": "2022-10-10T17:33:25+00:00",
  "updated": "2022-11-04T19:24:15+00:00",
  "media:group": {
    "media:title": "The Military Went Too Far With These Disturbing Experiments",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "2nd Channel: https://www.youtube.com/channel/UCPdc6bs3I8s6Y4QE_3g3MZw\nBecome a Simple History member: https://www.youtube.com/simplehistory/join\nSupport us on Patreon: https://www.patreon.com/simplehistory\n\nNazi doctors sewing together twins under the guise of populating an ethnically uniform German nation, Japanese Imperial surgeons dissecting POWs to plan biological warfare and covert CIA programmes using LSD to experiment for the possibility of mind control. These are some of the most notorious military medical experiments that have plagued our history.\n\nCopyright: DO NOT translate and re-upload our content on Youtube or other social media.\n\nSIMPLE HISTORY MERCHANDISE \n\nGet the Simple History books on Amazon: \n\nhttps://www.amazon.com/Daniel-Turner-%60/e/B00H5TYLAE/\n\nT-Shirts\n\nhttps://teespring.com/stores/simple-history-official-merch\n\nSimple history gives you the facts, simple!\n\nSee the book collection here:\n\nAmazon USA\n\nhttp://www.amazon.com/Daniel-Turner/e/B00H5TYLAE/\n\n\nAmazon UK\nhttp://www.amazon.co.uk/Daniel-Turner/e/B00H5TYLAE/\n\n\nhttps://www.facebook.com/Simple-History-549437675141192/\n\nhttps://twitter.com/SimpleHistoryYT\n\n\nCredit:\nCreated by Daniel Turner (B.A. (Hons) in History, University College London) \nScript: Natasha Martell\nNarrator:\n\nBryan 'Lazlo' Beauregard\n\n\nBrody H, Leonard SE, Nie JB, Weindling P. “U.S. responses to Japanese wartime inhuman experimentation after World War II.” Cambridge Quarterly of Healthcare Ethics (April 2014): 220-230.\n\nByrd, Gregory Dean. “General ishii Shiro: his Legacy is That of Genius and Madman.” M.A. diss., University of Tennessee, 2005.\n\nConahan, Frank C. Human Experimentation: An Overview on Cold War Era Programs. Washington DC: United States General Accounting Office, 1994.\n\nHarris, Sheldon H. Factories Of Death. London: Routledge, 1999.\n\nHickey, Doug, Scarllet Sijia Li, Morrison Celia, Schulz Richard, Thiry Michelle, Sorensen Kelly. “Unit 731 and moral repair.” Journal of Medical Ethics. Vol 43, No.4 (April 2017): 270-276.\n\nGesundheit, Benjamin, Reichenberg Ephraim, Strous Rael D. “Resilience: Message From a ‘Mengele Twin’ Survivor”, Psychiatry Online. Vol 62, No 10 (October, 2011): 1127-1129.\n\nMozes-Kor, Eva. “The Mengele Twins and Human Experimentation: A Personal Account.” (extract from “The Nazi Doctors and The Nuremberg Code”, edited by George J Annas, and Micchael A. Grodin). New York: Oxford University Press, 1992.\n\nSihra, Avani. “Unit 731.” May, 2018. Atomic Heritage Foundation.\n\nTimeline World History Documentaries. “In Vivo: The Horrific Experiments Performed By Josef Mengele | Destruction (Nazi Doctors) | Timeline.” Youtube, March 2020.\n\nWartman, Brad. “2019-08-12 - Chabad Center - Jona Laks.” Youtube, October 2019.\n\nWeindling, P, von Villiez A, Loewenau A, Farron, N. “The victims of unethical human experiments and coerced research under National Socialism.” Endeavor, March, 2016.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}