{
  "id": "yt:video:sw8XQDLBJBE",
  "yt:videoId": "sw8XQDLBJBE",
  "yt:channelId": "UCtXKDgv1AVoG88PLl8nGXmw",
  "title": "Raoul Pal | CEO of RealVision, GMI, etc. | web3 talks | Sep 29th 2022 | Hosted by Raphael Hyde",
  "link": "",
  "author": {
    "name": "Google TechTalks",
    "uri": "https://www.youtube.com/channel/UCtXKDgv1AVoG88PLl8nGXmw"
  },
  "published": "2022-10-25T21:04:32+00:00",
  "updated": "2022-10-26T17:31:50+00:00",
  "media:group": {
    "media:title": "Raoul Pal | CEO of RealVision, GMI, etc. | web3 talks | Sep 29th 2022 | Hosted by Raphael Hyde",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Hey web3 frenz!\n\nI'm beyond excited for this week's special guest! We have the great and powerful Raoul Pal (@RaoulGMI), founder & CEO of Real Vision (http://realvision.com), Global Macro Investor (www.globalmacroinvestor.com/), Exponential AgeTM Asset Management and ScienceMagic.Studios (www.sciencemagicstudios.xyz/) joining us for an hour of all things macro, finance and web3! With all the craziness in the world, why not bring in the master chief to tell us what's going on :)\n\nRaoul has held several senior roles in the financial markets over the last 32 years; from running equity/equity derivative sales to hedge funds at Goldman Sachs to founding and managing a Global Macro hedge fund for GLG Partners (one of the largest hedge fund firms in the world).\n\nRaoul's Career\n\nIn 2005 he began publishing the Global Macro Investor (GMI), a world-renowned institutional investment strategy publication read by the world’s biggest hedge funds, asset managers and family offices, which he still publishes to this day. In 2014 he also co-Founded Real Vision, the preeminent financial media platform and community, which extensively covers both traditional asset markets and digital asset markets. He is working on turning Real Vision into a Web 3 community and FinTech platform.\n\nRaoul has been investing in crypto and digital assets since 2013, when he wrote the first ever macroeconomic analysis of bitcoin in GMI. In 2021 he co-founded two new businesses to capture opportunities in the rise of Web 3; Exponential Age Asset Management, an asset management firm that invests in Digital Asset hedge funds and Science.Magic Studios, a token venture studio that creates token economies and participates in the worlds large cultural communities; music, sports, entertainment and fashion. \n\nHe lives in the Cayman Islands.\n\nHosted by,\nRaphael Hyde\nhttps://www.linkedin.com/in/raphael-hyde-4416494/\nGoogle web3 community lead | Google UX | web3 Angel\n\nMusic by Sunset Music Inc",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}