{
  "title": "566: WB is Planning HBO Max Harry Potter Shows -- We Pitch Lots of New Ideas!",
  "link": "https://audioboom.com/posts/8101461",
  "itunes:episode": 566,
  "itunes:title": "WB is Planning HBO Max Harry Potter Shows -- We Pitch Lots of New Ideas!",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4446,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>A merger of Warner Bros and Discovery, Inc. has led Andrew to speculate as to what the future of the Wizarding World may look like on film and TV. And he's prepared a presentation about it! Hosts Eric, Micah, Laura and special Slug Club guest Neil join in and speculate as to the future of <em>Fantastic Beasts</em>, and what - if any - television series set within the Wizarding World we might see from Discovery Time Warner. It's a jam-packed episode with lots of laughs and really cool ideas!<br>\n<br>\n\n</div>\n<ul>\n<li>Welcome Slug Club guest Neil, who's joining us from South Korea in the middle of the night.</li>\n<li>What CEO David Zaslav might do with <em>Fantastic Beasts, Harry Potter,</em> and his upcoming meeting with JKR.</li>\n<li>While <em>Secrets of Dumbledore</em> is the lowest performing Wizarding World film of all time, it still <em>technically</em> has broken even, reaching $400M globally. Is the future secure for its remaining announced sequels?</li>\n<li>Hypothetically, what scripted Harry Potter TV shows could we see coming if not a direct reboot of the original Potter books?</li>\n<li>The hosts all provide an idea for a television series that fills in canon and explores plot holes from the series.</li>\n<li>Laura wants an episode dedicated to \"<a href=\"https://www.mugglenet.com/2004/10/the-lost-day-part-1-why-it-took-so-long/\">The Missing 24 Hours</a>\", while Micah wants a series focused on Tom Riddle's ascent to power.</li>\n<li>Is a Marauders series anybody's second choice for new TV content? How about one that shows the events of <em>Deathly Hallows</em> from the students' perspective in Hogwarts? And finally, Andrew's idea for an Auror Dept. police procedural is intriguing!</li>\n<li>Next, the hosts \"Star Wars-ify\" a Wizarding World story, pairing an adult and child character together in the style of Disney+'s <em>The Mandalorian </em>and <em>Obi-Wan Kenobi.</em>\n</li>\n<li>Would Salazar Slytherin look good boasting a gray area? Are outcasts Hagrid and Luna the perfect pair for an exploration of Wizarding World secrets? Would Tonks and Mad-Eye see eye to eye if placed together for long? How about Snape and Draco? And would a time-traveling Neville Longbottom learn a few things from Professor Sprout?</li>\n<li>Finally, falling in line with <em>Discovery Channel</em>'s past offerings, the hosts predict which educational and/or questionable reality programming we might get from the content creators.</li>\n<li>Ideas include space-faring wizards, Charms disasters, a travel show, and <em>\"Trelawney Truckers\"</em>!</li>\n<li>Quizzitch: Who illustrated the first book cover for Harry Potter and the Philosopher’s Stone, published in 1997 by Bloomsbury in UK?</li>\n<li>This week's episode is brought to you by MeUndies (visit <a href=\"https://www.meundies.com/mugglecast\">MeUndies.com/MuggleCast</a> for 15% off your first order and 25% off your first membership item), <a href=\"https://www.framebridge.com\">Framebridge</a> (Use promo code 'muggle' for 15% off your first order), and BetterHelp (Go to <a href=\"https://www.betterhelp.com/mugglecast\">BetterHelp.com/mugglecast</a> for 10% off your first month)</li>\n</ul>\n",
  "pubDate": "Tue, 14 Jun 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-06-13:/posts/8101461",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}