{
  "id": "https://bibleinoneyear.org/en/youth/177",
  "title": "Day 177: Three Things God Wants to Give You",
  "description": "Psalm 78:13–15, 1 Kings 17:2–4,7–16, Acts 17:2–4,10–12,15–18.  Our Father in heaven knows when you will need the strength to be a martyr for Jesus Christ  He will supply all you need just in time",
  "pubDate": "Sat, 26 Jun 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/177/?ignore",
  "itunes:duration": "14:36",
  "guid": "enyouth26062021-177",
  "length": 876.85,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 177: Three Things God Wants to Give You",
  "itunes:subtitle": "Psalm 78:13–15, 1 Kings 17:2–4,7–16, Acts 17:2–4,10–12,15–18.  Our Father in heaven knows when you will need the strength to be a martyr for Jesus Christ  He will supply all you need just in time",
  "itunes:summary": "Corrie ten Boom and her sister Betsie were middle-aged Christian women in Holland when World War II erupted. They resolved to conceal fleeing Jews from the Nazis. They rescued many. But they were eventually arrested and taken to Ravensbrück concentration camp. Betsie died there. Corrie miraculously survived to bear witness to the way in which God can save, heal and forgive.\nWhen asked how to prepare for persecution, she used to tell this story about her childhood:\n‘When I was a little girl, I went to my father and said, “Daddy, I was afraid that I will never be strong enough to be a martyr for Jesus Christ.” “Tell me,” said father, “When you take a train trip to Amsterdam, when do I give you the money for the ticket? Three weeks before?” “No, Daddy, you give me the money for the ticket just before we get on the train.” “That is right,” my father said, “And so it is with God’s strength. Our Father in heaven knows when you will need the strength to be a martyr for Jesus Christ. He will supply all you need just in time.”’",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 177
}