{
  "title": "EPISODE 84: History and Video Games",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Mon, 17 Jan 2022 21:41:27 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2022/1/17/episode-84-history-and-video-games",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:61e5e21cff063f1e149f3be7",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1010c2ab-ce40-420c-a294-8cc1c239da3b/HOF-84.jpg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"61e5e26d2036f0611412f1b4\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1010c2ab-ce40-420c-a294-8cc1c239da3b/HOF-84.jpg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“We don’t need anyone to tell us what to do; not Savonarola, not the Medici. We are free to follow our own path. There are those who will take that freedom from us, and too many of you gladly give it. But it is our ability to choose—whatever you think it is true—that makes us human… There is no book or teacher to give you the answers, to show you the path. Choose your own way! Do not follow me, or anyone else.”</em> — Ezio Auditore in Assassin’s Creed II</p><p class=\"\"><em>“History is our playground” —</em> tagline to the Assassin’s Creed series </p><p class=\"\">The excellent Alexander Von Sternberg (from the podcast History Impossible) joins me to discuss how video games are changing the way we can understand history. Obviously, people play video games for entertainment—no argument there. But it is also true that few things can allow us to immerse ourselves in a multi-faceted reconstruction of the past as much as video games do. In the course of the discussion, we touch on the prehistoric adventures of Far Cry Primal, sexuality in video games, Ancestors: The Humankind Odyssey, multiple volumes of Assassin’s Creed, the joys of becoming a playboy assassin in the Renaissance, from hanging out with Leonardo Da Vinci to riding along with Paul Revere, from making out with Caterina Sforza to dumping tea in the Boston’s harbor, Ghost of Tsushima, Gun, Red Dead Redemption, This Land Is My Land, Kingdom Come: Deliverance, and much more.</p>",
  "media:content": {
    "media:title": "EPISODE 84: History and Video Games"
  }
}