{
  "title": "Citrix grows leadership team in Asia Pacific Japan",
  "link": "https://www.digitalnewsasia.com/business/citrix-grows-leadership-team-asia-pacific-japan",
  "description": "<!-- START FIELD TEMPLATE -->\n\n\n<div class=\"d-flex justify-content-start flex-wrap\">\n      <div class=\"body\">\n      <ul>\n<li><em><strong>Vincent Wong is named area vice president Citrix Asia</strong></em></li>\n<li><em><strong>Sandeep Pal is regional VP marketing, Orcun Tezel is senior sales director for networking</strong></em></li>\n</ul>\n<p class=\"rtecenter\"> </p>\n<p class=\"rtecenter\"><img alt=\"\" src=\"/sites/default/files/images/Vincent%20Wong%20of%20Citrix%20horizontal.jpg\" style=\"margin-top: 2px; margin-bottom: 2px; width: 650px;\" /></p>\n<p class=\"rtecenter\"> </p>\n<p>CITRIX on Aug 9 announced that Vincent Wong <em><strong>(pic, above) </strong></em>has been appointed area vice president of Asia for Citrix.  Reporting to Stanimira Koleva, vice president of sales and services, Asia Pacific Japan, Citrix, Wong brings extensive experience in driving workspace innovation, cloud adoption and business transformation.</p>\n<p>He will focus on executing the company’s corporate strategy and delivering consistent growth across all sectors of the Asia region, covering Asean and Korea markets.</p>\n<p>Wong joins as Citrix is expanding the leadership team across the Asia Pacific Japan region. Citrix recently appointed Sandeep Pal to regional vice president, marketing, Asia Pacific Japan, Citrix and Orcun Tezel as senior sales director for networking, Asia Pacific Japan, Citrix.        </p>\n<p>Commenting on the expanded leadership team, Koleva said: “I’m excited to announce the extended APJ leadership team, and believe Orcun, Sandeep and Vincent will strengthen our ability to support our customers and partners across the region. Our investment and commitment to growth will help drive our business forward and support organisations across the region to transition to cloud and drive digital transformation.”</p>\n<p>Wong joins Citrix to lead the Asean and Korea sales and services business, bringing almost three decades of experience in business development, product sales, marketing, sales operations, channel management, sales management and business management from companies such as IBM, Cisco Systems and Microsoft.</p>\n<p>Prior to joining Citrix, Wong spent fourteen years at Microsoft where he held various roles, most recently as director of the company’s APAC channel business.  During this time, Wong developed a deep understanding of business transformation and leading change, as well as adapting to the ever-changing needs of the Asia region.</p>\n<p>“Vincent brings proven expertise and a solid track record to the role. His knowledge of the ASEAN and Korean markets, combined with his strong leadership skills, will strengthen our ability to help businesses in these markets succeed,” said Koleva.</p>\n<p>Wong holds a BSc degree (with double majors in Computer Science and Information Technology) from The University of Western Australia and an Executive MBA from the California State University, Hayward.</p>\n<p>Wong was a committee member of the Singapore Chinese Chamber of Commerce and Industry’s IT advisory board, Committee member of the National Infocomm Competency Framework and committee member of Singapore International Chamber of Commerce’s Cybersecurity chapter before he left for Korea in August 2015. He is currently a board member of Netball Singapore, a non-profit sport organisation.</p>\n<p>Sandeep joins Citrix to lead the Asia Pacific Japan marketing team, with over 25 years of sales and marketing experience in the Asia Pacific region in companies such as IBM and Oracle.</p>\n<p>He will be responsible for leading marketing strategy to accelerate the brand’s growth in the Asia Pacific Japan region. </p>\n<p>Key to his focus will be to drive the transformation towards cloud while leveraging digital and modern marketing techniques.</p>\n<p>Prior to joining Citrix, he spent almost two decades at Oracle in various country, regional and global marketing leadership roles. Most recently, he was the senior director of Marketing leading all aspects of marketing in Southeast Asia and emerging markets.</p>\n<p>Tezel joins Citrix to lead the Asia Pacific Japan Networking team, bringing extensive experience from across the IT industry in EMEA, Middle East and Asia Pacific Japan.</p>\n<p>In his role as the senior sales director, Networking for Asia Pacific Japan region he will be responsible for leading the company&#039;s strategic initiatives in the rapidly evolving application delivery and cloud networking markets to expand Citrix’s thought leadership and drive top line revenue and market share growth across APJ region.</p>\n<p>Prior to joining Citrix, Tezel worked as senior director, systems engineering (SE) and professional services at Brocade Communications Asia Pacific Japan, and led a team of Principal Architects and SE managers/directors to achieve significant sales growth in new and emerging technologies across Asia Pacific. Prior to his time with Brocade, he held management roles with Cisco, HP and 3Com.</p>\n    </div>\n  </div>\n\n<div class=\"clearfix\">&nbsp;</div>\n<!-- END FIELD TEMPLATE -->\n<!-- START FIELD TEMPLATE -->\n\n  <h6 class=\"field-label font-weight-bold text-dark\">Keyword(s) :</h6>\n\n<div class=\"d-flex justify-content-start flex-wrap\">\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/citrix\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Citrix</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/vincent-wong\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Vincent Wong</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/stanimira-koleva\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Stanimira Koleva</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/sandeep-pal\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Sandeep Pal</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/orcun-tezel\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Orcun Tezel</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/ibm\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">IBM</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/cisco-systems\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Cisco Systems</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/microsoft\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Microsoft</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/oracle\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Oracle</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/brocade-communications\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Brocade Communications</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/hp\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">HP</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/3com\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">3Com</a>    </div>\n  </div>\n\n<div class=\"clearfix\">&nbsp;</div>\n<!-- END FIELD TEMPLATE -->\n<!-- START FIELD TEMPLATE -->\n\n  <h6 class=\"field-label font-weight-bold text-dark\">Author Name :</h6>\n\n<div class=\"d-flex justify-content-start flex-wrap\">\n      <div class=\"field_article_author_name\">\n      <a href=\"/author/digital-news-asia\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Digital News Asia</a>    </div>\n  </div>\n\n<div class=\"clearfix\">&nbsp;</div>\n<!-- END FIELD TEMPLATE --><span class=\"a2a_kit a2a_kit_size_24 a2a_target addtoany_list\" id=\"da2a_16\">\n      <a class=\"a2a_button_facebook a2a_counter\"></a>\n<a class=\"a2a_button_twitter a2a_counter\"></a>\n<a class=\"a2a_button_linkedin a2a_counter\"></a>\n<a class=\"a2a_button_email  a2a_counter\"></a>\n<a class=\"a2a_button_whatsapp  a2a_counter\"></a>\n<a class=\"a2a_button_telegram  a2a_counter\"></a\n      <a class=\"a2a_dd addtoany_share_save\" href=\"https://www.addtoany.com/share#url=https%3A%2F%2Fwww.digitalnewsasia.com%2Fbusiness%2Fcitrix-grows-leadership-team-asia-pacific-japan&amp;title=Citrix%20grows%20leadership%20team%20in%20Asia%20Pacific%20Japan\"></a>\n      \n    </span>",
  "pubDate": "Wed, 09 Aug 2017 09:56:07 +0000",
  "dc:creator": "nesacat",
  "guid": "68691 at https://www.digitalnewsasia.com"
}