{
  "title": "Catherine Ryan: Krell and the Destruction of Worlds",
  "itunes:author": "Liquid Architecture",
  "itunes:subtitle": "",
  "itunes:summary": "How can we wrap our heads around the inevitability of planetary and civilisational collapse? What can the history of experimental electronic music and the fate of an extinct alien species teach us about living with chaos and destruction? \n\nBringing together performative musicology and electronic music synthesis, Ryan addresses a pressing feeling that structures our age: the existential terror many of us feel when we contemplate how human-made climate change is transforming the regular cycles of life on our planet, rendering a familiar world unfamiliar.\n\nCatherine Ryan expands on the converging influences that informed Krell and the Destruction of Worlds, how humour can open up conversations around confronting topics, and the possibilities that emerge through the multidisciplinary structure of performance lectures.\n\nThis episode features music by Bebe and Louis Barron from the film Forbidden Planet and Catherine Ryan. \n\nhttps://liquidarchitecture.org.au/events/krell\n\n22 May 2022\nMeat Market Stables, North Melbourne\nPresented by MESS and Liquid Architecture\n\nFinancial support from patrons at any level has a resounding impact on our work. You can support Liquid Architecture’s weekly podcast and our online journal Disclaimer, for new thinking and writing on listening and sound through a Patreon subscription, for as little as $5 a month.\n\nhttps://www.patreon.com/liquidarchitecture\n\nFor the past 20 years, Liquid Architecture has been Australia’s leading organisation for artists working with sound and listening. LA investigates the sounds themselves, but also the ideas communicated about, and the meaning of, sound and listening.\n\nProduced by Mara Schwerdtfeger",
  "itunes:image": "",
  "enclosure": "",
  "guid": "https://liquidarchitecture.org.au/podcast/catherine-ryan-krell-and-the-destruction-of-worlds",
  "pubDate": "Tue, 10 May 2022 08:00:00 +1000",
  "itunes:duration": "24:04",
  "itunes:explicit": "no"
}