{
  "title": "Chinese Whispers: the Xi-Putin alliance",
  "link": "https://audioboom.com/posts/8027066",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2486,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In 2008, President George Bush was the star guest at Beijing’s opening ceremony. Fourteen years later, under a cloud of diplomatic boycotts led by the US, the guest of honour spot was filled instead by President Putin. Under a confluence of factors over the last decade, China and Russia are closer now than they have been since the Cold War.</div>\n<br>\n<div>On this episode of Chinese Whispers, Cindy Yu talks to Alexander Gabuev, a senior fellow at the Carnegie Moscow Center, about how this situation came about. If the beginning of the end of the Cold War can be traced back to the Sino-Soviet split – allowing a bipolar world to be split into three when China began rapprochement with Nixon’s America – then what does today’s alliance mean at this moment in geopolitics?</div>\n<br>\n<div>For Alex, there were three reasons why China and Russia have got closer. China’s hunger for oil and gas makes Russia a much-needed new trading partner (and vice versa). The two were able to fudge territorial disputes along the 3000 mile border they share (Alex points out that Russia has only been able to amass troops on the Ukrainian border because their military presence on the Sino-Russian border is the lightest it has been for a century). They share similar political cultures - strongman-ship supported by powerful and corrupt oligarchs and a nationalistic society - and similar national leaders (‘for the first time after the dissolution of the Soviet Union, we have two leaders that are age mates and soul mates’).</div>\n<br>\n<div>‘The secret sauce’ that binds the collaboration together, according to Alex, is the US’s increasing confrontation with both. What we see from Washington today is a reverse Kissinger - where the two authoritarian countries are being pushed closer together by an increasingly hawkish America. Take Nord Stream 2 - any weaning off of the German market from Russian gas will simply make the Chinese market even more important for Moscow. But it’s not clear that the West has many alternatives.</div>\n<br>\n<div>Getting closer to China is not necessarily a good thing for Russia, either. For one, the relationship is unbalanced. In a reversal of Cold War dynamics, the size of China’s high value economy today means that Chinese business matters more to Moscow than Russian to Beijing. ‘Ten, fifteen years down the road,’ Alex says, ‘China will have more leverage’. Could a more powerful China try to bully its weaker ally in commercial and security spheres? Possibly, but the die may already have been cast: ‘unfortunately, the sources of grievances and conflict between Russia and the US run so deep [that] the Russian leadership is so emotionally invested that there is no easy way out.’</div>\n<br>\n<div>On this episode Cindy and Alex also discuss the malleability of national memory (Russian aggression during the 19th century often flies under the radar of Chinese nationalists), in what ways China’s relations with the US are still better than with Russia and exactly how China could react to any transgression on the Ukrainian border. Tune in.</div>\n",
  "pubDate": "Tue, 08 Feb 2022 10:00:00 +0000",
  "guid": "tag:audioboom.com,2022-02-07:/posts/8027066",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}