{
  "title": "EU country to apologize for slavery – media",
  "link": "https://www.rt.com/news/565926-netherlands-slavery-apology-recognition/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565926-netherlands-slavery-apology-recognition/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63643147203027485e05da21.jpg\" /> The Dutch government will apologize for the country’s history of slavery, local media reported <br/><a href=\"https://www.rt.com/news/565926-netherlands-slavery-apology-recognition/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The Netherlands is expected to set up a multimillion ‘awareness fund’ as part of its history recognition campaign</strong></p>\n            \n                        \n            <p>The Dutch government plans to issue a formal apology next month for its historical involvement with the slave trade, the RTL news website reported on Thursday, citing sources.</p>\n<p>According to the outlet, the government also intends to set up a &euro;200 million &lsquo;slavery awareness fund&rsquo; which will finance the relevant projects and dedicated school programs. Additional &euro;27 million will be allocated to create a slavery museum, RTL&rsquo;s sources said.</p>\n<p>The government&rsquo;s move will constitute a formal response to a report last year by the Dialogue Group on Slavery History. The commission, which was set up by the Interior Ministry, recommended that Prime Minister Mark Rutte should recognize and apologize for past slavery.</p>\n<p><em>&ldquo;On the one hand, recognition will give satisfaction to those who suffered under slavery, and on the other hand, it will promote a critical view of Dutch history in a broader sense,&rdquo;</em> the group said at the time.<strong><br /></strong><strong></strong></p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.09/thumbnail/631f25c1203027560953dd0d.jpg\" alt=\"RT\" />\n            <figcaption><a href=\"https://www.rt.com/russia/562633-un-slavery-report-rise/\">UN sounds alarm over modern slavery</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>The formal apology, which is not expected until mid-December, will reportedly be supported by most MPs, while key parliamentary parties have already called on the government to take a stand.</p>\n<p>In July, 2021, the mayor of Amsterdam, Femke Halsema, officially apologized for <em>&ldquo;the active involvement&rdquo;</em> of the city<em> &ldquo;in the commercial system of colonial slavery.&rdquo;</em></p>\n<p>Between the 16th and 19th centuries, the Netherlands maintained colonies in the regions known today as Indonesia, South Africa, Cura&ccedil;ao and New Guinea. It was one of the last countries to abolish slavery, doing so in 1863 in its main colony of Surinam in South America. The year 2023 will mark 150 years since the Netherlands freed tens of thousands slaves there and on the Dutch Caribbean islands.</p>\n<p>In September, during a short official visit to Surinam, PM Rutte said that<em> &ldquo;the time is right&rdquo;</em> for the recognition of slavery.&nbsp;</p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 21:58:48 +0000",
  "dc:creator": "RT"
}