{
  "title": "564: Who's the Threat in 'Fantastic Beasts 4' if Grindelwald's Been Qilinized?",
  "link": "https://audioboom.com/posts/8089136",
  "itunes:episode": 564,
  "itunes:title": "Who's the Threat in 'Fantastic Beasts 4' if Grindelwald's Been Qilinized?",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3898,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode, Micah and Eric talk about what Fantastic Beasts 4 needs to do in order to keep fans interested in the franchise. Then open our Muggle Mailbag to take feedback on <em>Secrets of Dumbledore</em>. Plus... Alakazam! Can wizards and witches really use spoons to do magic?<br>\n<br>\n\n</div>\n<ul>\n<li>Main Mini-Discussion: What does Fantastic Beasts 4 need to do in order to be a satisfying story for fans?</li>\n<li>With where <em>Secrets of Dumbledore</em> left us, what more story is there to tell? </li>\n<li>Can the franchise continue to hang its hooks on <em>Potter</em> nostalgia, but then fail to deliver?</li>\n<li>Do we feel there is enough meat for five <em>Fantastic Beasts</em> films? Could a flashback movie work?</li>\n<li>It's time to bust open the Muggle Mailbag!</li>\n<li>What did Grindelwald know about Dumbledore's future when he said: \"Who's going to love you now?\"</li>\n<li>Will Jude Law's Dumbledore ever reenact the <em>Half-Blood Prince</em> potion scene?</li>\n<li>Is Secrets of Dumbledore too gay?</li>\n<li>Did Dumbledore plan for Jacob to be an \"assassin\" all along?</li>\n<li>Why did Leta choose Theseus? Is Newt to blame?</li>\n<li>Which characters are the best examples from each Hogwarts House?</li>\n<li>Can you use spoons to do magic?</li>\n<li>Quizzitch: In <em>Half-Blood Prince</em>, during the cave scene, what does Dumbledore toast before drinking the potion?</li>\n<li>On next week's episode: we're off for the Memorial Day Holiday, but back the following week with our <em>Secrets of Dumbledore</em> movie commentary!</li>\n<li>This week's episode is brought to you by Mint Mobile (to get your new wireless plan for just $15 bucks/month and get the plan shipped to your door for FREE, visit <a href=\"http://www.mintmobile.com/mugglecast\">MintMobile.com/MuggleCast</a>) and BetterHelp (get 10% off their first month at <a href=\"http://www.betterhelp.com/mugglecast\">BetterHelp.com/MuggleCast</a>)!</li>\n</ul>\n",
  "pubDate": "Tue, 24 May 2022 16:38:22 +0000",
  "guid": "tag:audioboom.com,2022-05-24:/posts/8089136",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}