{
  "title": "Iran says it supplied drones to Russia before Ukraine conflict",
  "link": "https://www.rt.com/news/566006-iran-acknowledges-drone-shipments-russia/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/566006-iran-acknowledges-drone-shipments-russia/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63667ad185f5402e4d280b2a.jpg\" /> Iran has acknowledged it had supplied military drones to Russia, adding, however, that it did so “months before the Ukraine war” <br/><a href=\"https://www.rt.com/news/566006-iran-acknowledges-drone-shipments-russia/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Tehran acknowledges it had provided Moscow with a “small number” of UAVs but denies ever supplying missiles</strong></p>\n            \n                        \n            <p>Iran has acknowledged for the first time it handed over military drones to Russia, claiming, however, that the shipments were completed before the Ukraine conflict broke out in late February.</p>\n<p>Tehran also denied claims that it had provided Moscow with missiles.</p>\n<p>Iranian state news agency, IRNA, cites Iranian Foreign Minister Hossein Amirabdollahian as saying&nbsp;<em>&ldquo;This fuss made by some Western countries, that Iran has provided missiles and drones to Russia to help the war in Ukraine - the missile part is completely wrong.&rdquo;</em></p>\n<p>The diplomat explained&nbsp;that the <em>&ldquo;drone part is true, and we provided Russia with a small number of drones months before the Ukraine war.&rdquo;</em></p>\n<p>Amirabdollahian also claimed that Tehran and Kiev had agreed two weeks ago to hold discussions on alleged instances of Russian troops using Iranian weapons. According to the minister, the Ukrainian delegation pulled out of the planned meeting at the last minute, however.</p>\n<p>The diplomat also gave assurances that Tehran would <em>&ldquo;not remain indifferent&rdquo;</em> if evidence was presented that proves the Russian military is using Iranian drones in Ukraine.&nbsp;</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/635d898d85f5406ebc5e8616.png\" alt=\"© Military TV UA / YouTube\" />\n            <figcaption><a href=\"https://www.rt.com/russia/565595-ukrainian-made-part-drone/\">Ukrainian-made part found in ‘Iranian drone’ – Kiev</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Reuters reported that the Ukrainian Foreign Ministry had not immediately replied to a request for comment.</p>\n<p>In early October, Russia launched a massive campaign of airstrikes targeting major Ukrainian cities, with particular emphasis on power plants and other critical infrastructure. These attacks involved missiles as well as so-called &lsquo;kamikaze&rsquo; drones.</p>\n<p>The Ukrainian government claims the Russian military has been increasingly relying on Iranian-made Shahed-136 UAVs to conduct such strikes &ndash; which Moscow denies.</p>\n<p>Kiev was making similar allegations about Tehran&rsquo;s alleged involvement as early as in September, with Ukraine downgrading its diplomatic relations with Iran later that month.</p>\n<p>In mid-October, Foreign Minister Dmitry Kuleba proposed severing ties with the Islamic Republic altogether.</p>\n<p>The EU and the UK were quick to side with Ukraine on the issue, and last month slapped additional punitive measures on the already heavily sanctioned Iran.</p>",
  "enclosure": "",
  "pubDate": "Sat, 05 Nov 2022 16:12:59 +0000",
  "dc:creator": "RT"
}