{
  "title": "S1E24 - Special birthday Q&A with our host Laura Wilkinson and daughter Arella",
  "guid": "https://pinecast.com/guid/5eb43db5-4113-45b8-8514-060538a5e770",
  "pubDate": "Tue, 17 Nov 2020 07:30:00 -0000",
  "itunes:duration": "00:34:20",
  "description": "<p>This week’s episode is a little different, because today is Laura’s birthday! And to celebrate, she has a very special guest who will be asking the questions – her oldest daughter, Arella. Many of the questions that Arella will be asking Laura have been submitted by listeners, and she has also added a few of her own. Towards the end of the podcast, Laura turns the tables and asks Arella a couple questions as well. You will quickly discover that Arella is an excellent interviewer who might just be ready to host her own podcast someday, and you’ll also learn a lot more about Laura, her sport, her faith, her physical and mental training, and, of course, her Olympic experiences. Today’s episode is an excellent opportunity to learn so much about the life of an Olympian and her family, and if there is more you would like to know, be sure to send in your questions to Laura and they might just be answered on a future episode!</p>\n<p>Episode Highlights:\n \nQuestions for Laura:\n </p>\n<ul>\n<li>How do you set your goals when everything is changing?</li>\n<li>Since you compete all over the world, and you have met lots of different people, has it ever given you the opportunity to share your faith with a fellow athlete?</li>\n<li>Why do you love ‘Learning to Fly’, the song by Petty so much? Is it inspirational or is it just because you think it’s a cool song?</li>\n<li>Coaching mental and physical abuse – how can we combat this as athletes?</li>\n<li>Recovering from intense diving practices</li>\n<li>How do you overcome the feelings of personal failure?</li>\n<li>Why do some divers wear swim caps now?</li>\n<li>What Gym did you go to gymnastics at before you did diving?</li>\n<li>Who are some of your mindset coaches or influencers at this point in your life?</li>\n<li>What dive has caused you to have the largest mental block, and how do you overcome it?</li>\n<li>What made you want to go to the Olympics?</li>\n<li>What are your chances of qualifying for Tokyo?</li>\n<li>How did you get into diving?</li>\n<li>How many medals do you really have?</li>\n<li>How many sports did you do before you did diving?</li>\n<li>How many times have you gone to the Olympics?</li>\n<li>What is your hardest dive ever?</li>\n<li>What’s your easiest dive?</li>\n</ul>\n<p>Questions for Arella:\n </p>\n<ul>\n<li>What was the first sport that you did?</li>\n<li>What did you do after gymnastics?</li>\n<li>How do you get bored in gymnastics?</li>\n<li>Why do you enjoy Ninja Warrior so much now?</li>\n<li>Do you have any big goals for Ninja Warrior?</li>\n<li>Are there any lessons that you learn while you’re training for Ninja Warrior that help you in your everyday life?</li>\n<li>What is your new dream that you just came up with that you want to be when you grow up and why?</li>\n<li>Do you want to talk about the workout that you created during homeschool after you watched the Navy Seals?</li>\n<li>How has homeschooling been going?</li>\n</ul>\n<p>Quotes:\n \n“Your ultimate goals don’t need to change…what changes is your path to get there.”\n \n“Research what other athletes in your sport are doing out there right now, like, stalk Instagram or Facebook or YouTube.”\n \n“Obviously, the biggest part of being able to share your faith is starting relationships with people. That has to come first.”\n \n“That’s really when you get a chance to show people what your faith is, what it means to you, and begin to have those discussions if they’re open to that.”\n \n“’I’m going to free fall out into nothing. I’m going to leave this world for a while’, and to me, that just encapsulates what it feels like when I’m diving 10 meter, and I’m just in my happy place, and I’m in my zone, and it kind of feels like a place of worship for me because I’m using the gifts that God has given me.”\n \n“Episode 11 with Kaillee Humphries, she talks about mental and verbal abuse…from one of her coaches…and also in Episode 20, with Tracy Hanson, there was kind of a very long term abuse going on there.”\n \n“It’s kind of like a small car accident every time.”\n \n“Sometimes it’s not your body that’s wearing out, it’s your mind…if that’s the case, go play.”\n \n“If you’re not failing, you’re not going to succeed.”\n \n“It’s to keep the chlorine from absorbing into their hair.”\n \n“Mostly, ‘Flips’ was my home gym.”\n \n“The Bible has just been, kind of, my firm foundation since I gave my life to Christ.”\n \n“If you’re ever going through a really hard time, Psalms is a wonderful place to go.”\n \n“It really broke a barrier for me to all of a sudden, I could do anything.”\n \n“I tried a bunch of sports until I finally found diving.”\n \n“My biggest challenge is really getting my body back to the point where I can get my entries clean again.”\n“I didn’t give up just because I had a bad dive…I came back and I won the competition.”\n \n“In 2000, it was in Sydney, Australia. In 2004, it was in Athens, Greece. And in 2008, it was in Beijing, China.”\n \n“The back 3½ somersault pike just felt really, really, really hard.”\n \n“Sometimes, the simple ones are the hardest.”\n \n“My easiest dive is probably just, like, jumping in the water…a pencil dive.”\n \n“My first sport was gymnastics.”\n \n“I did soccer and now I’m a Ninja Warrior…I did diving…before soccer.”\n \n“The trapeze bar is probably my favorite.”\n \n“I keep trying over and over again until I finish the route.”\n \n“I want to be…the first woman to be a Navy SEAL.”\n \n“I like hard and challenging things.”\n \n“I started working out while I was doing my Math.”\n \n“I really like homeschooling – it’s really fun!”\n \n“I think we should make another episode.”\n </p>\n<p>Links:\nThe Pursuit of Gold homepage: <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">  http://thepursuitofgold.com/</a> \nMental Training: <a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">  https://www.laurawilkinson.com/learn </a></p>\n<p>Laura’s Social Media:\nInstagram: <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">https://www.instagram.com/lala_the_diver</a>  \nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">https://www.facebook.com/TheLauraWilkinson</a></p>",
  "itunes:title": "Special birthday Q&A with our host Laura Wilkinson and daughter Arella",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 24
}