{
  "title": "261: TEN Simple Small Steps to Win in 2022",
  "pubDate": "Mon, 03 Jan 2022 19:14:26 +0000",
  "guid": "81b62e8b-ebd3-4c2c-8225-0c0fe457bf2d",
  "link": "https://sites.libsyn.com/94610/261-ten-simple-small-steps-to-win-in-2022",
  "itunes:image": "",
  "description": "<p>Happy new year! As we’re kicking off the new year, I want to share the tips to get the most out of this year.<br /> <br /> If you’ve been listening to our podcast for the last few years, you’re probably familiar with the metaphor of the butterfly. I use this metaphor because the butterfly is a profound symbol of transformation. And while the beauty may be in the butterfly, the growth happens inside the cocoon.<br /> <br /> Today, I want to talk about TEN small, simple steps that you can do to achieve more in the New Year. I’m going to give you four things to stop and six things to start so you can win the year.</p> <p>This isn’t an all-or-nothing list. Whether you choose to stop or start one thing, the most important thing is to take that first step. If you’ve ever felt alone with your thoughts, fears, and doubts and are looking for ways to make small changes in your learning and life, this episode is for you.</p> <p class=\"p1\">*** Need a boost of confidence to get things done? Check out our <strong>brand NEW 7-day Kwik Confidence online course</strong>. We use an accelerated learning model to guide you through simple confidence upgrade techniques each day. All you need is 15 minutes a day to get the results. Go to <a href= \"https://kwikbrain.com/confidence\"><span class= \"s1\">KwikConfidence.com</span></a> to learn more. ***</p>",
  "content:encoded": "<p>Happy new year! As we’re kicking off the new year, I want to share the tips to get the most out of this year.  If you’ve been listening to our podcast for the last few years, you’re probably familiar with the metaphor of the butterfly. I use this metaphor because the butterfly is a profound symbol of transformation. And while the beauty may be in the butterfly, the growth happens inside the cocoon.  Today, I want to talk about TEN small, simple steps that you can do to achieve more in the New Year. I’m going to give you four things to stop and six things to start so you can win the year.</p> <p>This isn’t an all-or-nothing list. Whether you choose to stop or start one thing, the most important thing is to take that first step. If you’ve ever felt alone with your thoughts, fears, and doubts and are looking for ways to make small changes in your learning and life, this episode is for you.</p> <p class=\"p1\">*** Need a boost of confidence to get things done? Check out our brand NEW 7-day Kwik Confidence online course. We use an accelerated learning model to guide you through simple confidence upgrade techniques each day. All you need is 15 minutes a day to get the results. Go to <a href= \"https://kwikbrain.com/confidence\">KwikConfidence.com</a> to learn more. ***</p>",
  "enclosure": "",
  "itunes:duration": "19:46",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Happy new year! As we’re kicking off the new year, I want to share the tips to get the most out of this year.  If you’ve been listening to our podcast for the last few years, you’re probably familiar with the metaphor of the butterfly. I use...",
  "itunes:episodeType": "full"
}