{
  "title": "S1E50 - Worth the Risk with Aerial Skiing Olympian Emily Cook",
  "guid": "https://pinecast.com/guid/b8d99369-ff20-4dbc-97db-c0e627adaa8d",
  "pubDate": "Thu, 29 Jul 2021 06:30:00 -0000",
  "itunes:duration": "00:55:54",
  "description": "<p>Joining Laura on the podcast this week is 3 time Olympian and 6 time National Champion in Aerial Skiing, Emily Cook. Currently the manager of sport and human potential at Skullcandy, Emily also manages programming for the non-profit, <a href=\"http://www.classroomchampions.org/\" rel=\"nofollow\">Classroom Champions</a>, coaches young athletes at the Utah Olympic Park through the US Ski Team’s Elite Aerial Development Program, and is an ambassador for Right to Play and Kids Play International. Throughout her career, Emily has routinely demonstrated her ability to overcome obstacles and elevate her game to new levels, and she shares her inspirational story with listeners here today.\n \nIn today’s episode, Emily discusses her commitment towards her sport, her experiences at the World Cup and the Olympics, and the multiple emotions she went through while training. She also delves into dealing with injuries, making difficult decisions, and compares being a coach to being an athlete. She brings the conversation to a close by sharing details about the important work she does these days. An inspiring model of perseverance, Emily has so very much to share here today that is sure to motivate all who listen.</p>\n<p>Episode Highlights:\n </p>\n<ul>\n<li>Emily’s realization of her love for aerial skiing</li>\n<li>Dealing with injuries as an athlete</li>\n<li>Her experiences at the Olympics</li>\n<li>Emily’s work at The Speedy Foundation</li>\n<li>How she had trust in her coach</li>\n<li>Emily’s commitments in the sports sphere</li>\n<li>Being a coach vs. being an athlete                        </li>\n<li>Emily’s work outside the sports sphere</li>\n</ul>\n<p>Quotes:\n </p>\n<ul>\n<li>“So, I always determined before a training block, whether it was a three-week training block or something, what my negative thought stoppers would be, and, you know, exactly what mindset I wanted to be in on the hill. I use music a lot as well.’’</li>\n<li>“And then, every once in a while, like, as humans, we’re just not reliable, we’re not reliable to our own commitments.”</li>\n<li>“But regardless of who’s there watching, you know…you’ve accomplished something that you set out to do so many years earlier, and it’s an incredible feeling.’’</li>\n<li>“And so, it was a daily choice, it was a choice of showing up and showing up 100% no matter what, no matter what my mood was, no matter what was going on around me.’’</li>\n<li>“In the end of the day, knowing exactly what I wanted to accomplish, and then debriefing exactly what I did accomplish, so that I knew what I needed to change the next day in order to perform even better.’’</li>\n</ul>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold Homepage</a>\n<a href=\"https://www.amazon.com/Life-10-Meters-Lessons-Champion/dp/B096CQW2L7/ref=sr_1_3?crid=2AXVGI3HL987J&dchild=1&keywords=laura+wilkinson+life+at+10+meters&qid=1624113646&sprefix=Laura+Wilkinson%2Caps%2C227&sr=8-3\" rel=\"nofollow\">Life at 10 Meters: Lessons from an Olympic Champion</a>\n<a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">5 Smart Strategies to Confidence</a>\n<a href=\"https://laurawilkinson.mykajabi.com/email-capture-0d05ebf5-739d-43b0-a4ab-5f4ea91a24e6\" rel=\"nofollow\">Conquer Your Fear in 5 Days</a>               \n \nLaura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura's Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura's Facebook page</a>\n \n \nConnect with Emily:\n \n<a href=\"http://www.emilycook.com/\" rel=\"nofollow\">Emily's Homepage</a>\n \n<a href=\"https://www.classroomchampions.org/\" rel=\"nofollow\">Classroom Champions</a>\n \n<a href=\"https://www.thespeedyfoundation.org/\" rel=\"nofollow\">The Speedy Foundation</a></p>",
  "itunes:title": "Worth the Risk with Aerial Skiing Olympian Emily Cook",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 50
}