{
  "title": "A Four-Year Program to Tackle a Fundamental Antenna Challenge",
  "link": "https://spectrum.ieee.org/electrically-small-antenna",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/differently-colored-lines-of-light-swirl-on-a-dark-background.jpg?id=31484242&width=1200&height=800&coordinates=0%2C104%2C0%2C105\"/><br/><br/><p>For 80 years, a class of antenna called electrically small antennas has been stymied by a seemingly insurmountable barrier. These antennas, which can receive signals with wavelengths that are much longer than the antennas themselves, are seemingly stuck with designs in which there is a trade-off between high bandwidth and efficiency.</p><p>Now, a new program by the U.S. <a href=\"https://www.iarpa.gov/\" rel=\"noopener noreferrer\" target=\"_blank\">Intelligence Advanced Research Projects Activity</a> (IARPA) agency seeks ways to finally circumvent or overcome these historical limitations for electrically small antennas. Over the next four years, the research teams participating in the <a href=\"https://www.iarpa.gov/research-programs/equal-p\" rel=\"noopener noreferrer\" target=\"_blank\">Effective Quantitative Antenna Limits for Performance</a> (EQuAL-P) program will work through three phases of progressively more ambitious benchmarks in order to prove their ideas can work.</p><p>The simplest form of antenna is a dipole antenna, which is essentially just two pieces of wire placed end to end with a feed point in the middle. The length of this antenna is typically half the wavelength of the signal that is being received or transmitted, so a shortwave radio dipole working in the 20-meter band would be 10 meters long. An “electrically small” antenna is one that is significantly shorter than the wavelength of the signals it is designed for. These antennas typically take the form of small loops or patches. </p><p>The benefit of electrically small antennas is clear—as the name implies, they confer an advantage when space is at a premium. Satellites, for example, can use them to reduce mass and free up more space for other components.</p><p>But the trade-off with electrically small antennas is that as they get shorter, their bandwidth and radiation efficiency also shrink, eventually hitting something named the <a href=\"https://en.wikipedia.org/wiki/Chu%E2%80%93Harrington_limit\" target=\"_blank\">Chu-Harrington limit</a>. This has meant that although such antennas have been in use for decades, they remain difficult to design and limited in their applicability. Historically, any attempts to widen the usable bandwidth have decreased these antennas' radiation efficiency even more, and vice versa. This is the problem the EQuAL-P program is aimed at.</p><p class=\"pull-quote\">The teams have proposed different kinds of approaches, but Kolb says there are several common themes among them.</p><p>“Because it’s an 80-year problem, we want to give them a little more time to come up with solutions,” says <a href=\"https://www.iarpa.gov/who-we-are/program-managers/dr-paul-kolb\" rel=\"noopener noreferrer\" target=\"_blank\">Paul Kolb</a>, the program manager for EQuAL-P. The eight teams participating will work through three increasingly ambitious phases during the next four years to prove their ideas can pass muster.</p><p>At the end of 18 months, Kolb says, he hopes to see that the teams have made meaningful progress toward the ultimate goal of a 10-decibel gain in antenna performance in the HF and ultrahigh frequency (UHF) bands. But because of the difficulty of the challenge, teams won’t be required to produce a working demonstration of their technology at that point.</p><p>That changes at the end of the second phase, 15 months later, in which the teams will need to demonstrate an actual antenna that has a 6-dB gain in performance over existing electrically small antennas.</p><p>EQuAL-P, like other IARPA projects, will rely on an independent verification of the demonstrations with external labs. In this instance, Kolb says, verification will be provided by the <a href=\"https://www.niwcpacific.navy.mil/\" rel=\"noopener noreferrer\" target=\"_blank\">Naval Information Warfare Center Pacific</a>—which specializes in HF measurements—the <a href=\"https://www.navair.navy.mil/organization/NAWCWD\" rel=\"noopener noreferrer\" target=\"_blank\">Naval Air Warfare Center Weapons Division</a>, and the <a href=\"https://www.afrl.af.mil/\" rel=\"noopener noreferrer\" target=\"_blank\">Air Force Research Laboratory</a>.</p><p>According to Kolb, the rationale behind the multiple phases is that it gives the agency the ability to fund the teams’ progress in increments, monitor that progress, and end projects if they don’t seem to be panning out.</p><p>The final, 12-month phase will require the research teams to demonstrate a 10-dB gain in performance. Kolb admits the threshold will be difficult to reach. “That’s a huge improvement,” he says, “but it also gives any eventual users enough motivation to actually use the new technique.”</p><p>Kolb doesn’t expect to see commercially viable products four years from now, however. That would be too ambitious even here. Instead, he wants to see functioning demonstrations of the technology that will hopefully provide the participating teams a clearer path forward and a good springboard from which to launch.</p><p>The teams have proposed different kinds of approaches, but Kolb says there are several common themes among them. Almost all of them include, for example, time-varying components—whether that’s accomplished through diodes, voltage changes, switches, or some other mechanism. Many of the teams will also need to design and build their own validation techniques because existing methods for assessing antenna performance likely won’t be up to snuff. In such cases, the teams will also need to ensure that the independent labs can verify their validation techniques.</p><p>The eight teams include researchers from <a href=\"https://www.boeing.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Boeing</a>, <a href=\"https://www.ncsu.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">North Carolina State University</a>, <a href=\"https://www.rtx.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Raytheon</a>, and the <a href=\"https://www.wisc.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">University of Wisconsin-Madison</a>, to name a few. In order to keep the number of teams manageable, Kolb says, some groups with similar proposals were combined, such as two groups in the <a href=\"https://www.universityofcalifornia.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">University of California</a> system that originally submitted individual proposals.</p><p>Ultimately, there’s no guarantee the program will pan out, but that’s the bread and butter for programs at IARPA, which—like <a href=\"https://www.darpa.mil/\" rel=\"noopener noreferrer\" target=\"_blank\">DARPA</a> and <a href=\"https://arpa-e.energy.gov/\" rel=\"noopener noreferrer\" target=\"_blank\">ARPA-E</a>—funds high-risk, high-reward research efforts. And even though the chance of failure is not insignificant, it’s the best chance for improvements to electrically small antennas we've seen in 80 years.</p>",
  "pubDate": "Tue, 06 Sep 2022 19:01:35 +0000",
  "guid": "https://spectrum.ieee.org/electrically-small-antenna",
  "category": [
    "Antennas",
    "Iarpa",
    "Wireless"
  ],
  "dc:creator": "Michael Koziol",
  "media:content": ""
}