{
  "title": "Quantum Spin Puddles and Lakes: NISQ-Era Spin Liquids from Non-Equilibrium Dynamics. (arXiv:2211.01381v1 [cond-mat.str-el])",
  "link": "http://arxiv.org/abs/2211.01381",
  "description": "<p>While many-body systems can host long-ranged entangled quantum spin liquids\n(QSLs), the ingredients for realizing these as ground states can be\nprohibitively difficult. In many circumstances, one requires (i) a constrained\nHilbert space and (ii) an extensive quantum superposition. The paradigmatic\nexample is the toric code, or $\\mathbb{Z}_2$ spin liquid, which is a\nsuperposition of closed loop states. We show how non-equilibrium Hamiltonian\ndynamics can provide a streamlined route toward creating such QSLs. Rather than\ncooling into the ground state of a Hamiltonian, we show how a simple parameter\nsweep can dynamically project a family of initial product states into the\nconstrained space, giving rise to a QSL. For the toric code, this is achieved\nin systems with a separation in energy scales between the $e$- and $m$-anyons,\nwhere one can sweep in a way that is adiabatic (sudden) with respect to the\nformer (latter). Although this separation of scales does not extend to the\nthermodynamic limit, we analytically and numerically show that this method\nefficiently prepares a spin liquid in finite-sized regions, which we brand\n``quantum spin lakes.'' This mechanism elucidates recent experimental and\nnumerical observations of the dynamical state preparation of the ruby lattice\nspin liquid in Rydberg atom arrays. In fact, the slow dynamics of $m$-anyons\nsuggest that we can capture spin lake preparation by simulating the dynamics on\ntree lattices, which we confirm with tensor network simulations. Finally, we\nuse this mechanism to propose new experiments, e.g., for preparing a\nfinite-sized $U(1)$ spin liquid as a honeycomb Rokhsar-Kivelson dimer model\nusing Rydberg atoms -- which is remarkable given its equilibrium counterpart is\nunstable in $2 + 1$D. Our work opens up a new avenue in the study of\nnon-equilibrium physics, as well as the exploration of exotic states of finite\nextent in NISQ devices.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cond-mat/1/au:+Sahay_R/0/1/0/all/0/1\">Rahul Sahay</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Vishwanath_A/0/1/0/all/0/1\">Ashvin Vishwanath</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Verresen_R/0/1/0/all/0/1\">Ruben Verresen</a>"
}