{
  "title": "After the Nong Bua Lamphu shooting, a need for grief-sensitive journalism",
  "link": "https://www.newmandala.org/after-the-nong-bua-lamphu-shooting-a-need-for-grief-sensitive-journalism/",
  "dc:creator": "Mark Cogan",
  "pubDate": "Fri, 14 Oct 2022 05:42:39 +0000",
  "category": [
    "Media",
    "Thailand",
    "United Nations"
  ],
  "guid": "https://www.newmandala.org/?p=59984",
  "description": "<p>Evidence of inappropriate reporting on the Nong Bua Lamphu tragedy is rife.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.newmandala.org/after-the-nong-bua-lamphu-shooting-a-need-for-grief-sensitive-journalism/\">After the Nong Bua Lamphu shooting, a need for grief-sensitive journalism</a> appeared first on <a rel=\"nofollow\" href=\"https://www.newmandala.org\">New Mandala</a>.</p>\n",
  "content:encoded": "<p>In a horrifying mass shooting at a childcare center in the northeastern Thai province of Nong Bua Lamphu on October 6, <a href=\"https://www.bloomberg.com/news/articles/2022-10-06/thai-daycare-center-shooting-leaves-32-dead-mostly-children\">at least 38 people</a>, including 22 young children were killed. A former police officer, Panya Kamrab used his personal 9mm handgun as well as several knives in the attack that stunned and frightened the Kingdom. International and national media have descended upon the rural Uthai Sawan community for the purposes of covering the story.</p>\n<p>Journalists, as well as the Thai public, have raised legitimate questions that should be asked after a tragedy like this: Has rising poverty as a result of the <a href=\"https://muse.jhu.edu/article/846882\">COVID-19 pandemic</a> contributed to a decline in mental health?  What can Thailand do about its <a href=\"https://www.nytimes.com/2022/10/06/world/asia/thailand-shootings-guns-firearms.html\">rising gun violence</a>? According to the University of Sydney’s School of Public Health, there are <a href=\"https://www.gunpolicy.org/firearms/region/thailand\">more than 10 million privately-owned guns</a> circulating in Thailand. Thailand has 15.1 weapons per 100 people compared to just 0.3 in Singapore and 0.25 in Japan. Mass shootings are still rare, although <a href=\"https://www.bbc.co.uk/news/world-asia-51435760\">in 2020 a soldier killed 29 people </a>in Nakhon Ratchasima.</p>\n<p>While these questions facilitate dialogue on how to create better national policy and better protect children, journalists also need to ask themselves ethical questions when covering stories of trauma and times of grief: What is driving my need to ask questions? Is it the appropriate time to ask my questions? And, when approaching families of the victims, are my questions appropriate and is their grief a legitimate part of the story?</p>\n<p>Evidence of inappropriate, ill-considered decisions by journalists and editors are rife amid reporting on the Nong Bua Lamphu tragedy. Anna Coren, a CNN anchor and correspondent <a href=\"https://twitter.com/SaksithCNA/status/1578698804647235589\">filmed inside the childcare center illegally</a>, an action condemned by the Foreign Correspondents’ Club of Thailand (FCCT). Less conspicuous is the common practice of filming or photographing coffins, <a href=\"https://www.facebook.com/KhaosodEnglish/posts/pfbid02sZs8au6jWdqptByUEK8W6bkogxC61FuXhXLFLoxpjKYA3YjZBNv6JaFAmaectvZRl\">demonstrated on social media by Khaosod English</a> photographing a visibly shaken mother as she left toys of her deceased son on top of his coffin, or the <em>Southeast Asia Globe</em> showing the <a href=\"https://twitter.com/SEA_GLOBE/status/1578202733324255232\">bloodstained coffin of the shooter compared to that of one of the victims</a>. Other newspapers such as <em>The Straits Times</em>, have <a href=\"https://www.straitstimes.com/multimedia/photos/in-pictures-parents-grief-for-children-killed-in-thai-nursery-massacre\">shown even more graphic images</a>, some from <em>Reuters</em>, such as the floor of the childcare center with blood still visible, just a day after the killings. <em>The New York Times</em> is also guilty of the same questionable practices. Whether the action is intentional or unintentional, careful or careless, the media need to rethink their approaches while covering delicate stories.</p>\n<p>There are clear ethical guidelines that suggest these decisions should not be normalised as practice. UNICEF was <a href=\"https://twitter.com/UNICEF_Thailand/status/1577977981061910529?s=20&t=0Gu3tAeJh6J-21-IKYT0YQ\">quick to advise the media and the general public</a> to “refrain from posting or forwarding images and videos related to this violent incident, as this may further negatively impact children, victims’ families, and their loved ones.”  Several Thai news associations, including the National Press Council of Thailand, News Broadcasting Council of Thailand, and the Society for Online News issued statements warning the media to refrain from publishing accounts and photos that add to the suffering of relatives of the victims.<em class=\"help-text\">\n\t<div class=\"post alignleft\">\n\t\t<div class=\"post-image\">\n\t\t\t<span class=\"post-label\">\n\t\t\t\tRelated\t\t\t</span>\n\t\t\t\n\t\t\t\t\t\t\t<a href=\"https://www.newmandala.org/the-partisan-history-of-police-power-in-thailand/\">\n\t\t\t\t\t<img width=\"245\" height=\"184\" src=\"http://www.newmandala.org/wp-content/uploads/cache/2020/03/214778601_1ca312a3aa_o/894239786.jpg\" class=\" wp-post-image\" alt=\"\" loading=\"lazy\" />\t\t\t\t</a>\n\t\t\t\t\t</div><!-- /.post-image -->\n\t\n\t\t<h3 class=\"post-title\">\n\t\t\t<a href=\"https://www.newmandala.org/the-partisan-history-of-police-power-in-thailand/\">The partisan history of police power in Thailand</a>\n\t\t</h3><!-- /.post-title -->\n\t\t\n\t\t\t\t<div class=\"post-entry\">\n\t\t\t<p>Paul Chambers looks back at the politicisation of the Royal Thai Police, before turning to the palace's recent personalisation of authority over an institution often overshadowed by the military.</p>\n\t\t</div><!-- /.post-entry -->\n\t\n\t\t<div class=\"post-actions\">\n\t\t\t<div class=\"post-meta\">\n\t\t\t\t<p>\n\t\t\t\t\t\t<a class=\"post-author\" href=\"https://www.newmandala.org/author/paulchambers/\">Paul Chambers</a>\n\t\t\t\t\n\t\t\t\t\t02 March, 2020\t\t\t\t</p>\n\t\t\t</div><!-- /.post-meta -->\n\t\t</div><!-- /.post-actions -->\n\t</div><!-- /.post -->\n\t</em></p>\n<p>IMPRESS, a UK-based media regulator, created ethical guidelines for journalists under its <a href=\"https://www.impress.press/standards/#standards-code\">Standards Code</a>, of which Section 7 under Privacy is of relevance here.</p>\n<p>Journalists are advised to ask “whether the person had voluntarily courted publicity on a relevant aspect of their private life” and to “take all reasonable steps not to exacerbate grief or distress through intrusive newsgathering or reporting.” Further, the Society for Professional Journalists (SPJ), under its <a href=\"https://www.spj.org/ethicscode.asp\">Code of Ethics</a> advises journalists to “balance the public need for information against potential harm or discomfort.” The SPJ advises compassion and heightened sensitivity when dealing with people who have experienced trauma.</p>\n<p>Trauma-sensitive and grief-sensitive journalism skills should be regularly provided by newsrooms, and are clearly lacking. Resources are <a href=\"https://healthjournalism.internews.org/wp-content/uploads/sites/2/2021/12/GOOD-TO-KNOW-Interviewing-in-times-of-grief.pdf\">readily available online</a>, but are seldom accessed. However, what needs to be heeded is mostly an ethical awareness and an understanding of the grieving process. Some academic literature is instructive.</p>\n<p>In <a href=\"https://www.tandfonline.com/doi/abs/10.1080/01972243.2013.777300\">a 2013 article</a> on social media and the expansion of death and mourning, Professors Jed Brubaker, Gillian Hayes, and Paul Dourish suggest that social media builds “an infrastructure for a new relationship with our social pasts” where “deceased friends are resituated into our everyday use” of social media applications. The grieving process is expanded from a small community of mourners, as was typical, and is greatly expanded into public and online spaces, often blurring the lines between observers and mourners.</p>\n<p>For some, according to the University of California at Irvine researchers, social media can be seen as intrusive to those who prefer more traditional forms of mourning. Private thoughts and memories are thrust into public spaces, often seen as an invasion of privacy. Sharing intimate, painful moments, through photos and video can exacerbate or prolong the grieving process, thereby creating an ethical dilemma for journalists. As Ann Shearer <a href=\"https://www.amazon.com/Survivors-Broadcasting-Standards-Research-Monograph/dp/0861963326\">in her 1991 monograph</a>, <em>Survivors and the Media</em>, noted, “the media may, by wrenching private grief into the public realm, simply underline and exacerbate [a] sense of helplessness.”</p>\n<p>The media can have an adverse effect on victims’ families, <a href=\"https://www.tandfonline.com/doi/abs/10.1080/17577632.2019.1592337?journalCode=rjml20\">detailed well in a 2019 article</a> on the impact of grief journalism by N.A. Noreham and Yvette Tinsley, two Victoria University of Wellington, New Zealand researchers in an examination of the <a href=\"https://www.theguardian.com/world/2021/nov/17/pike-river-bodies-found-of-miners-from-2010-new-zealand-disaster\">Pike River mining disaster</a>, where 29 men were killed in 2010. Five negative impacts are chronicled, the fear and loss of physical security, stress and loss of emotional equilibrium, feelings of violation and exploitation, loss of autonomy and control, and interference with relationships and emotional recovery.</p>\n<p>As the authors detail, the Nong Bua Lamphu tragedy should be approached with caution as families can easily gain the perception that journalists are there to serve their own interests over that of families’ immediate concerns, namely the grieving and burial process. In the Pike River case, participants overwhelmingly objected to the media’s lack of respect, humanity and empathy. The media can also inadvertently limit the ability of families to control who has access to their loved ones, their freedom of movement, and their control over how their loved ones are remembered.</p>\n<p>Consider the humanity of the <a href=\"https://www.tnews.co.th/social/575475?fbclid=IwAR1CjsqdIXZx49Y34z18aEDpuf3NpFn6p8oSQpJTQ2EkqZB6LkLJXrEZ5ow\">perpetrator’s mother</a>, a 63-year old woman, who had to bury her son in Udon Thani province in order to avoid public anger. Making merit in hopes of her son’s soul continuing on to heaven, she expressed regret about him not talking to her before he took the lives of 38 people. While public anger is both visible and justified, increased media focus on her increases the likelihood of unjustified anger toward the mother, as well as the prolonging of her own grief. Oftentimes, the parents of perpetrators of mass violence share additional feelings of loss and guilt, combined with the pain of public anger, as evidenced by the Uvalde, Texas mother <a href=\"https://www.theguardian.com/us-news/2022/may/27/texas-school-shooter-parents\">Adriana Martinez, who went through a period of shock, denial, grief, and anger over the actions of her son</a> and as well as the <a href=\"https://www.kgns.tv/2022/07/20/uvalde-families-confront-killers-mother/\">reaction of the community who confronted her</a>.</p>\n<p>With respect to the rights and dignity of the grieving, media requests should occur in their proper course. Journalist Jo Healey, who devised trauma reporting training for the BBC, and author of <a href=\"https://www.routledge.com/Trauma-Reporting-A-Journalists-Guide-to-Covering-Sensitive-Stories/Healey/p/book/9781138482104\"><em>Trauma Reporting</em></a><em>: A Journalist&#8217;s Guide to Covering Sensitive Stories </em>notes that the families of victims will often come to journalists naturally, for a variety of different reasons: to pay tribute to loved ones, to raise awareness, to hold perpetrators or officials to account, or to appeal to the media to keep the story in the public eye. In the context of the  Nong Bua Lamphu tragedy, sensitive approaches used by veteran journalists <a href=\"https://apnews.com/article/thailand-d628902ba284787f5ea1946cd91d853c\">David Rising of the Associated Press</a> and Hathairat Phaholtap of <a href=\"https://theisaanrecord.co/2022/10/09/questions-left-unanswered-on-motive-behind-at-the-mass-shooting/\">the Isaan Record</a> and <a href=\"https://www.aljazeera.com/news/2022/10/7/the-children-were-sleeping-witness-to-thai-nursery-massacre\">recently for Al Jazeera</a> are recent best practices.</p>\n<p>Like other instances of mass violence, the Nong Bua Lamphu story will soon be out of the media spotlight, and families will soon have the freedom to resume their lives without the burden of the media documenting their private lives. As Thailand grapples with the twin challenges of improving mental health and reducing access to firearms, news organizations must use this opportunity to educate and inform their reporters and editors on grief and trauma-sensitive approaches. <a href=\"https://dartcenter.org/asia-pacific\">The Dart Center for Journalism and Trauma</a> is an excellent resource, as is the <a href=\"https://rjionline.org/news/best-practices-for-trauma-informed-journalism/\">Donald W. Reynolds Journalism Institute at the University of Missouri</a>.</p>\n<p>In the meantime, while the victims’ families remain a part of the focus of news coverage, journalists should continue to question the reasoning of their inquiries: is it in the public interest? Would reporting your story cause harm? Can the questions be revisited at a more appropriate time? What is in the public interest does not always mean that it is necessary. Journalists can be a part of the healing process if grief-sensitive approaches are applied.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.newmandala.org/after-the-nong-bua-lamphu-shooting-a-need-for-grief-sensitive-journalism/\">After the Nong Bua Lamphu shooting, a need for grief-sensitive journalism</a> appeared first on <a rel=\"nofollow\" href=\"https://www.newmandala.org\">New Mandala</a>.</p>\n"
}