{
  "title": "The Number of Employed Workers Fell in October and Price Inflation Continues to Outpace Wages",
  "link": "https://mises.org/node/60886",
  "description": "<p>In another sign of weakness for the job market, the <a href=\"https://fred.stlouisfed.org/series/CE16OV#0\">total number of employed persons in the United States fell</a>, month over month, in October. That's the third time in the last seven months this total has fallen, dropping to approximately 158 million.</p>\n<p>According to new employment data released by the Bureau of Labor Statistics on Friday, the current population survey shows 328,000 fewer people were employed in October than in September, seasonally adjusted. </p>\n<div class=\"media media-element-container media-image_no_caption\"><a href=\"https://cdn.mises.org/household1_0.jpg\" title=\"household\" class=\"colorbox\" data-colorbox-gallery=\"gallery-all-D289x7XeyO0\" data-cbox-img-attrs=\"{\"title\": \"\", \"alt\": \"household\"}\"><img class=\"media-element file-image-no-caption\" data-delta=\"2\" alt=\"household\" typeof=\"foaf:Image\" src=\"https://cdn.mises.org/styles/max_1160/s3/household1_0.jpg?itok=HXUc37ni\" width=\"1160\" height=\"621\" title=\"\" /></a></div>\n<p>This continues a seven-month trend in which the total number of employed persons has moved sideways. From March 2022 to October, total employed persons has only increased by 150,000 people, rising from about 158.45 million to 158.6 million. With October's drop, this also puts total employment in October below the peak of 158.8 million in February 2020. In other words, the household survey shows there are fewer employed people now than before the Covid Panic. </p>\n<p>Moreover, the household survey also showed that the total number of<a href=\"https://fred.stlouisfed.org/series/UNEMPLOY\"> unemployed workers increased</a> by approximately 250,000 people from September to October. That's an 8-month high. </p>\n<p>The decline in total employed was driven by a fall in <a href=\"https://fred.stlouisfed.org/series/LNS12500000#0\">full-time workers</a>. The survey shows that in October full-time workers dropped by 433,000 while <a href=\"https://fred.stlouisfed.org/series/LNS12600000#0\">part-time workers</a> increased by 164,000. </p>\n<p>Yet, the headlines in the business press today told us that \"U.S. payrolls grew by 261,000 October\" and that \"total employment\" is now 800,000 jobs above the February 2020 peak. </p>\n<p>Those numbers come from the \"establishment survey\" which differs from the household survey in that the establishment survey measures jobs. The household survey measures workers. Historically, the two numbers often track together, but there is a sizable gap between the two numbers in recent months. That is, since January, total jobs has grown considerably—showing an increase of 3.5 million jobs. Yet over that same time, the household survey has shown an increase of only 1.4 million employed persons. In other words, the two surveys together suggest much more growth in jobs than actual workers <em>with</em> jobs. </p>\n<div class=\"media media-element-container media-image_no_caption\"><a href=\"https://cdn.mises.org/household2.png\" title=\"household\" class=\"colorbox\" data-colorbox-gallery=\"gallery-all-D289x7XeyO0\" data-cbox-img-attrs=\"{\"title\": \"\", \"alt\": \"household\"}\"><img class=\"media-element file-image-no-caption\" data-delta=\"3\" alt=\"household\" typeof=\"foaf:Image\" src=\"https://cdn.mises.org/styles/max_1160/s3/household2.png?itok=7OkhGUBm\" width=\"1160\" height=\"596\" title=\"\" /></a></div>\n<p>One conclusion we can draw here is that more people are working second jobs to make ends meet. This would make sense given what other information we have about the state of household finances at the moment. </p>\n<p>For example, according to the bureau of economic analysis, <a href=\"https://fred.stlouisfed.org/series/DSPIC96\">disposable income</a> is lower now than it was before the Covid Panic, coming in at $15,130. That sum was $15,232 during February of 2020. Meanwhile, <a href=\"https://fred.stlouisfed.org/series/PSAVERT\">the personal savings rate</a> in September fell to 3.1 percent. That's the second-lowest level since 2007. Credit card debt, in contrast,<a href=\"https://fred.stlouisfed.org/series/CCLACBW027SBOG\"> reached new highs</a> in September, and is now well above its previous 2020 peak. </p>\n<p>Workers and consumers are likely spending down whatever savings they have because wages, in spite of what the allegedly \"robust\" establishment-survey jobs numbers say, are not keeping up with price inflation. Since April 2021, CPI inflation has repeatedly outpaced growth in average hourly earnings, year-over-year. In September, wages grew by 5.12 percent, but the CPI grew by 8.2 percent (year over year). The latest jobs numbers show these hourly earnings are up by 4.86, but price inflation is going to have to come down a very long way for real wage growth to materialize again. </p>\n<div class=\"media media-element-container media-image_no_caption\"><a href=\"https://cdn.mises.org/household3.jpg\" title=\"household\" class=\"colorbox\" data-colorbox-gallery=\"gallery-all-D289x7XeyO0\" data-cbox-img-attrs=\"{\"title\": \"\", \"alt\": \"household\"}\"><img class=\"media-element file-image-no-caption\" data-delta=\"4\" alt=\"household\" typeof=\"foaf:Image\" src=\"https://cdn.mises.org/styles/max_1160/s3/household3.jpg?itok=5Eem6Biw\" width=\"1160\" height=\"593\" title=\"\" /></a></div>\n<p>All of this combines to suggest that households are facing some real struggles in terms of dealing with rising expenses, and the need for more income. For example, CNBC <a href=\"https://www.cnbc.com/2022/10/24/more-americans-live-paycheck-to-paycheck-as-inflation-outpaces-income.html\">reported</a> last month that more Americans are living paycheck to paycheck:</p>\n<blockquote><p>As rising prices continue to outpace wage gains, families are finding less cushion in their monthly budget.</p>\n<p>As of September, 63% of Americans were living paycheck to paycheck, according to a recent <a href=\"https://www.pymnts.com/study/reality-check-paycheck-to-paycheck-inflation-consumer-spend-expenses/\" target=\"_blank\">LendingClub report</a> — near the 64% historic high hit in March. A year ago, the number of adults who felt strained was closer to 57%. ...</p>\n<p>“Being employed is no longer enough for the everyday American,” [Anuj] Nayar said. “Wage growth has been inadequate, leaving more consumers than ever with little to nothing left over after managing monthly expenses.</p></blockquote>\n<p>A recent <a href=\"https://nypost.com/2022/10/20/inflation-costing-americans-445-more-in-expenses-per-month/\">study from Moody's analytics</a> also concludes that the average American household paid $445 more for basic goods and services in September, compared to September of last year. </p>\n<p>Nor is the news likely to get much better. There is growing evidence that the United States—if not already in recession—is headed toward one. For one, the first two quarters of 2022 showed negative growth. The third quarter showed some growth, but that was largely driven by a one-time narrowing in the trade deficit and by government spending. Even with reports of third-quarter growth, <a href=\"https://www.cnbc.com/2022/10/27/us-gdp-accelerated-at-2point6percent-pace-in-q3-better-than-expected-as-growth-turns-positive.html\">CNBC admits</a> that a recession is coming with economist Paul Ashworth concluding “Exports will soon fade and domestic demand is getting crushed under the weight of higher interest rates.\"</p>\n<p>The other big factor pointing toward recession is the yield curve, which has now inverted, pointing to a coming recession. In fact, inversions in the yield curve have a perfect record of predicting recessions in recent decades. As of last week, <a href=\"https://fred.stlouisfed.org/series/T10Y3M#0\">the spread between the 10-year and the 3-month Treasurys is now negative</a>. The same thing happened in May of 2019, July of 2006, and July of 2000. There can be a lag of six months or more in these cases, but the result has been the same: recession. </p>\n<p>The Biden Administration and the Federal Reserve both continue to cling to jobs data as evidence that the economy is \"strong.\" As we've seen, though, most of the employment data actually points to stagnation or even losses in terms of employed persons. So, the the-economy-is-great crowd clings to the small slice of the employment data that is the establishment survey suggesting that all is well. If there is an upside to this, it's that the job-growth-is-strong narrative has provided some cover to the Federal Reserve which is far, far behind the curve on ending its inflationary easy-money policies. Thanks to the Fed's refusal to reverse course on its ultra-low interest rate policy until the economy was already clearly headed toward 40-year highs in price inflation, the Fed now faces a stagflationary crisis if it cannot get price inflation down before a recession becomes obvious. After all, as the jobs data becomes worse, this will increasingly trigger an avalanche of political pressure to \"pivot\" and start \"stimulating\" the economy once again. </p>\n<p>There's no telling at this point if the Fed has the stomach for actually bringing price inflation down and truly abandoning its 13-year long era of ultra-easy money and so-called unconventional monetary policy. It's far more likely that the Fed will return to suppressing interest rates just as soon as it can claim any sort of \"victory\" over price inflation, no matter how minor. This aborted retreat from the Fed's ongoing inflationary experiments would likely send the US toward something at least as bad as 1970's-style stagflation.  </p>\n\n",
  "author": "Ryan McMaken",
  "enclosure": "",
  "guid": 60886,
  "pubDate": "Fri, 04 Nov 2022 18:15:00 -0500",
  "source": "Mises Wire"
}