{
  "id": "tag:blogger.com,1999:blog-5245696872621940063.post-6662261113906975429",
  "published": "2022-11-04T12:13:00.000-07:00",
  "updated": "2022-11-04T12:13:27.630-07:00",
  "category": [
    "",
    "",
    "",
    "",
    ""
  ],
  "title": "Google Workspace Updates Weekly Recap - November 4, 2022",
  "content": "<h3>New updates&nbsp;</h3><h3><span style=\"font-weight: normal;\"><i><span style=\"font-size: xx-small;\">Unless otherwise indicated, the features below are fully launched or in the process of rolling out (rollouts should take no more than 15 business days to complete), launching to both Rapid and Scheduled Release at the same time (if not, each stage of rollout should take no more than 15 business days to complete), and available to all Google Workspace and G Suite customers.&nbsp;</span></i></span></h3><div><span></span></div><div><span style=\"font-weight: normal;\"><i><span style=\"font-size: xx-small;\"><br /></span></i></span></div><div><span></span></div><b>Use smart chips in Google Sheets as links on mobile&nbsp;</b><div><a href=\"https://cloud.google.com/blog/products/workspace/how-google-workspace-is-delivering-innovation-for-the-future-of-hybrid-work\">With smart canvas</a>, you’re currently able quickly add people and files into Google Sheets with smart chips on the web. Starting this week on mobile, these chips are treated like linked text and will show relevant hovercards and context menu items.&nbsp;</div><div><br /></div><div><b>Offline printing now available for Google Sheets&nbsp;</b></div><div>We’ve launched offline printing to support users working in a Sheet with <a href=\"https://support.google.com/drive/answer/2375012?hl=en&amp;co=GENIE.Platform%3DDesktop\">offline access</a>. In addition, emojis and system fonts are now included in offline printing. This feature is only available to those using Google Chrome. As a reminder, your organization can encrypt Sheets files with <a href=\"https://support.google.com/docs/answer/10519333?p=editors_encryption\">Workspace Client-side encryption</a>, an additional feature supported by offline printing. | <a href=\"https://support.google.com/chrome/answer/1069693?hl=en&amp;co=GENIE.Platform%3DDesktop\">Learn more</a>.&nbsp;</div><div><br /></div><div><br /></div><div><h3>Previous announcements</h3><h3><div style=\"font-size: medium; font-weight: 400;\"><i><span style=\"font-size: xx-small;\"><br /></span></i></div><div style=\"font-size: medium; font-weight: 400;\"><i><span style=\"font-size: xx-small;\">The announcements below were published on the Workspace Updates blog earlier this week. Please refer to the original blog posts for complete details.</span></i></div></h3></div><div><br /></div><div><br /></div><div><b>Improved flow for expiring access controls in Google Drive&nbsp;</b></div><div>You can now set expiring access when sharing files in <a href=\"https://support.google.com/drive/answer/2424384?hl=en&amp;co=GENIE.Platform%3DDesktop\">My Drive</a>. This update improves the existing expiring access capabilities by allowing you to add an expiration when sharing, as opposed to after a person already has access to the file. | Available to Google Workspace Business Standard, Business Plus, Enterprise Essentials, Enterprise Standard, Enterprise Plus, Education Plus, Education Standard, and Nonprofits customers only. | <a href=\"http://workspaceupdates.googleblog.com/2022/10/expiring-access-controls-google-drive.html\">Learn more</a>.&nbsp;</div><div><br /></div><div><b>Reminder to migrate your classic Google Sites before January 30, 2023&nbsp;</b></div><div>We’re extending the <a href=\"https://workspaceupdates.googleblog.com/2022/05/classic-sites-new-sites-timeline-update-may-2022.html\">previously announced timeline</a> to give Google Workspace customers more time to migrate from classic Google Sites to new Google Sites:&nbsp;</div><div><ul style=\"text-align: left;\"><li><b>On January 30, 2023</b>&nbsp;(previously December 1, 2022): We will begin to turn off the ability to edit any remaining classic Sites in your domain. Your classic Sites will remain viewable until the automatic conversion.</li><li><b>After January 30, 2023</b>&nbsp;(previously January 1, 2023): We will begin to automatically convert all remaining classic Sites to new Sites drafts for site owners to review and publish, and export static archives to&nbsp;<a href=\"https://support.google.com/accounts/answer/3024190\">Google Takeout</a>. Your classic Sites will be deleted after they are converted to new Sites.&nbsp;<b>Note:</b>&nbsp;Refer to the CSV file included with the export generated after your domain’s autoconversion completes for any classic Sites we were unable to convert. | <a href=\"http://workspaceupdates.googleblog.com/2022/11/migrate-classic-google-sites-by-january-30-2023.html\">Learn more</a>.</li></ul></div><div><b>Google for Education transformation reports window open for customers worldwide&nbsp;</b></div><div><a href=\"https://edutransformationreport.withgoogle.com/\">Google for Education transformation reports</a> are available for K-12 Google Workspace for Education customers worldwide, at no cost. Note: transformation reports are only available in English at this time. | Available to K-12 Google Workspace for Education Fundamentals, Education Standard, Education Plus, and the Teaching and Learning Upgrade customers only. | <a href=\"http://workspaceupdates.googleblog.com/2022/10/google-for-education-transformation-reports-nov-2022-window.html\">Learn more</a>.&nbsp;</div><div><br /></div><div><b>Manage projects &amp; tasks with a new timeline view on Google Sheets&nbsp;</b></div><div>We’ve introduced an interactive timeline view that allows you to track projects in Google Sheets. This new visual layer displays project information stored in Sheets, such as the task start and end date, description, and owner. | Available to Google Workspace Essentials, Business Standard, Business Plus, Enterprise Essentials, Enterprise Standard, Enterprise Plus, Education Fundamentals, Education Plus, Education Standard, the Teaching and Learning Upgrade, and Nonprofits customers only. | <a href=\"http://workspaceupdates.googleblog.com/2022/11/timeline-view-google-sheets.html\">Learn more</a>.&nbsp;</div><div><br /></div><div><br /></div><div><i><span style=\"font-size: xx-small;\">For a recap of announcements in the past six months, check out&nbsp;<a href=\"https://support.google.com/a/table/7314896\">What’s new in Google Workspace (recent releases)</a>.</span></i></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Unknown",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}