{
  "title": "Vanadium Anodes for Faster-charging, Longer-lived Batteries",
  "link": "https://spectrum.ieee.org/vanadium-batteries",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-foil-rectangle-labelled-tyfast-with-two-silver-squares-coming-out-of-the-top.jpg?id=30048901&width=1245&height=700&coordinates=0%2C165%2C0%2C165\"/><br/><br/><p>To fulfill the vision of EVs that <a href=\"https://spectrum.ieee.org/lucid-air-500-miles-ev\" target=\"_self\">travel a thousand miles</a> or phones that run for days on a single charge, most battery developers are racing to make batteries that can pack twice the energy in the same weight.</p><p>Not startup <a href=\"https://tyfast.energy/\" rel=\"noopener noreferrer\" target=\"_blank\">Tyfast</a>, which is “approaching next-generation battery development in a counter-current direction,” says GJ la O’, CEO and cofounder of the 2021 spinoff from the University of California, San Diego. </p><p>The company wants to make a battery based on a new vanadium-based anode material that can charge in 3 minutes and run for 20,000 charging cycles at the expense of energy density, which la O’ says could be 80 to 90 percent that of present-day batteries. La O' and company cofounder and chief technical officer Haodong Liu plan to develop a commercial product with the help of a new Activate <a href=\"https://www.activate.org/tyfast\" rel=\"noopener noreferrer\" target=\"_blank\">fellowship</a> they were awarded in early June. “Our high-level focus is 20 times faster charging and 20 times longer life than today’s lithium batteries. We’re saying we’ll deliver the same runtime as the previous-generation device, but charge really, really fast such that you forget about the size and energy density.”</p><p>That compromise works for their intended always-on, high-utilization applications such as autonomous warehouse or delivery robots that need to work nearly 24/7. Tyfast’s battery could enable that with very short fast-charging stops. </p><p>“Today’s robot platforms have battery packs that run 8 to 10 hours,” he says. “If you have a faster-charging battery you could have a 4- to 5-hour battery pack. A smaller pack would mean the robot carries more load per trip so it would be more productive.”</p><p>The charge time of lithium-ion batteries is limited by how quickly lithium ions flow in and out of the anode. The graphite used typically for anodes now has a planar structure with ions slipping in between the layers. </p><p>Tyfast instead uses an anode made of lithium vanadium oxide, a material with a 3D crystal structure similar to table salt. Ions move through the crystals in three dimensions, enabling 10 times as fast transport as in graphite. </p><p>The LVO anode, first reported by UCSD nanoengineers, Tyfast cofounder <a href=\"http://liugroup.ucsd.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">Ping Liu</a>, and others in 2020 in the journal <em><a href=\"https://www.nature.com/articles/s41586-020-2637-6\" rel=\"noopener noreferrer\" target=\"_blank\">Nature</a></em>, also expands and contracts less than graphite when it charges and discharges. Graphite changes volume by up to 10 percent whereas LVO expands less than 2 percent. That translates to less mechanical and chemical damage of the anode, allowing longer battery life, la O’ explains. “Our technology is trying to overcome this material limitation that graphite has set.”</p><p>Graphite can, however, hold more ions than LVO by weight, giving a higher battery energy density. Several <a href=\"https://spectrum.ieee.org/enevates-silicon-anodes-could-give-batteries-that-run-400-km-on-a-5minute-charge\" target=\"_self\">companies</a> are developing <a href=\"https://spectrum.ieee.org/nanograf-lithium-battery-silicon-anode\" target=\"_self\">nanoengineered silicon</a> or lithium-metal anodes that would have twice the energy density of even graphite, in order to enable longer EV driving range. The challenge with those materials is also their very high volumetric expansion that can crack the anode.</p><p>Tyfast’s LVO anode might be more robust, but its higher cost could be its downside. It is almost twice as expensive as graphite at over US $20 per kilogram. A battery  with an LVO anode and nickel-manganese-cobalt [NMC] cathode would be 30 to 50 percent more expensive than a graphite-NMC cell, says la O’. But LVO’s longer life could make up for its higher cost. “If you were to use it in an always-on application like autonomous robots, LVO lasts longer, so you’re at a lower cost per charging cycle,” he adds.</p><p>Before robots, the company is initially targeting the wearables market. It has several customers lined up, la O’ says, including a major consumer-electronics brand. In its laboratory, it is building batteries the size of credit cards and sugar packets. These prototypes use LVO anodes and commercial NMC cathodes and electrolytes so far last for over 2,000 charge cycles and charge in under 15 minutes. </p><p>By the end of the year, the team plans to reach 20,000 cycles and under 3-minute charging. “The vision is consumer-electronics devices that get you back to life faster with a Tyfast battery,” he says. “If you take a coffee break, by the time you’re done with your cup, your device is fully charged.”</p>",
  "pubDate": "Thu, 30 Jun 2022 19:35:30 +0000",
  "guid": "https://spectrum.ieee.org/vanadium-batteries",
  "category": [
    "Anodes",
    "Vanadium",
    "Fast charging",
    "Batteries"
  ],
  "dc:creator": "Prachi Patel",
  "media:content": ""
}