{
  "title": "Changing Stability in U.S. Employment Relationships: A Tale of Two Tails",
  "link": "https://fedinprint.org/item/fedmoi/93792/original",
  "description": "We examine how the distribution of employment tenure has changed in aggregate and for various demographic groups, drawing links to trends in job stability and satisfaction. The fraction of workers with short tenure (less than a year) has been falling since at least the mid-1990s, consistent with the decline in job changing documented over this period. The decline in short-tenure was widespread across demographic groups, industry, and occupation. It appears to be associated with fewer workers cycling among briefly-held jobs and coincides with an increase in perceived job security among short tenure workers. Meanwhile, the fraction of workers with long tenure (20 years or more) has been rising modestly since the early 1980s owing to an increase in long tenure for women and the ageing of the population. The rise in long tenure for women was broad-based across industries and occupations but limited to married women. By contrast, long tenure has declined markedly among older men. This is only partly explained by changing demographics and employment patterns such as the decline in manufacturing and unionization. In addition, an increase in mid-career separations during the 1970s and 1980s appears to have reduced the likelihood of reaching long-tenure for men. Survey evidence indicates that – despite these substantive changes over time – longer-tenure workers report no greater concern about job insecurity or decreases in job satisfaction than four decades ago.",
  "guid": "https://fedinprint.org/item/fedmoi/93792/original",
  "dc:creator": "Smith, Christopher L.; Molloy, Raven S.; Wozniak, Abigail",
  "dc:date": "2022-01-28",
  "dc:subject": "Tenure distribution; New hires; Turnover; Retention; Long tenure; Job tenure",
  "swpo:hasNumber": 56,
  "identifiers:doi": "10.21034/iwp.56",
  "bibo:series": "Opportunity and Inclusive Growth Institute Working Papers"
}