{
  "title": "Import AI 307: Copilot lawsuit; Stability raises $101m; US v China CHIPLOMACY",
  "link": "https://jack-clark.net/2022/10/25/import-ai-307-copilot-lawsuit-stability-raises-101m-us-v-china-chiplomacy/",
  "comments": "https://jack-clark.net/2022/10/25/import-ai-307-copilot-lawsuit-stability-raises-101m-us-v-china-chiplomacy/#respond",
  "dc:creator": "Jack Clark",
  "pubDate": "Tue, 25 Oct 2022 21:06:00 +0000",
  "category": "Uncategorized",
  "guid": "http://jack-clark.net/?p=2386",
  "description": "The single best thing to read about the China chip controls: …What CHIPLOMACY looks like… Here&#8217;s a great writeup by Greg Allen about the impact of the USA&#8217;s anti-China semiconductor controls. The tl;dr is this is a powerful and overlapping set of policy actions which, in combination, are designed to destroy China&#8217;s burgeoning chip industry. [&#8230;]",
  "content:encoded": "\n<p><strong>The single best thing to read about the China chip controls:</strong></p>\n\n\n\n<p><em>…What CHIPLOMACY looks like…</em></p>\n\n\n\n<p>Here&#8217;s a great writeup by Greg Allen about the impact of the USA&#8217;s anti-China semiconductor controls. The tl;dr is this is a powerful and overlapping set of policy actions which, in combination, are designed to destroy China&#8217;s burgeoning chip industry. These sanctions are a huge deal and the Chinese government will likely be responding &#8211; be prepared.&nbsp;</p>\n\n\n\n<p><strong>&nbsp;&nbsp;&nbsp;Read more: </strong><a href=\"https://www.csis.org/analysis/choking-chinas-access-future-ai\">Choking Off China’s Access to the Future of AI (CSIS)</a>.</p>\n\n\n\n<p>####################################################<br></p>\n\n\n\n<p><strong>Gray area code models: Lawyer-programmer mulls anti-Copilot lawsuit:</strong></p>\n\n\n\n<p><em>…What one person calls fair use another person calls infringement…</em></p>\n\n\n\n<p>Matthew Butterick, a lawyer and programmer, has reactivated his California bar membership so he can investigate &#8220;a potential lawsuit against GitHub Copilot for violating its legal duties to open-source authors and end users&#8221;. The gist of the complaint is that GitHub was trained on tons of public GitHub repos, yet the code GitHub spits out doesn&#8217;t have any attributions to those repos, and therefore you need to argue Copilot is fair use because it is sufficiently transformative &#8211; but that&#8217;s not established.&nbsp;</p>\n\n\n\n<p><strong>What&#8217;s wrong with Copilot? </strong>&#8220;Though some courts have con­sid­ered related issues, there is no US case squarely resolv­ing the fair-use ram­i­fi­ca­tions of AI train­ing,&#8221; Butterick writes. Since there is no legal precedent here, it&#8217;s not clear you can argue that Copilot falls under fair use, one way or the other.</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;Additionally, Copilot can sometimes regurgitate code which is a copy of identifiable reporistories, but both Microsoft (and their underlying AI partner, OpenAI) offload responsibility here to the user of the Copilot suggestion rather than themselves. &#8220;As a side effect of Copi­lot’s design, infor­ma­tion about the code’s ori­gin—author, license, etc.—is stripped away. How can Copi­lot users com­ply with the license if they don’t even know it exists?&#8221;</p>\n\n\n\n<p><strong>Copilot is climate change for coders: </strong>Butterick notes that Copilot may, as it becomes more successful, &#8220;inhibit&#8221; or &#8220;remove any incentive&#8221; for programmers to spend time in open source communities. &#8220;Over time, this process will starve these com­mu­ni­ties. User atten­tion and engage­ment will be shifted into the walled gar­den of Copi­lot and away from the open-source projects them­selves—away from their source repos, their issue track­ers, their mail­ing lists, their dis­cus­sion boards. This shift in energy will be a painful, per­ma­nent loss to open source,&#8221; he writes. &#8220;The legal­ity of Copi­lot must be tested before the dam­age to open source becomes irrepara­ble. That’s why I’m suit­ing up.&#8221;</p>\n\n\n\n<p><strong>Why this matters: </strong>These generative models can do amazing and beguiling things &#8211; and people are betting they&#8217;re the future (see, elsewhere in this issue, Common Sense Machines, and the Stable Diffusion fundraise). But they also do pose significant issues with regard to the &#8216;digital commons&#8217; from which we all depend &#8211; I worry that systems like Copilot can both starve the commons (destroy open source incentives) and also poison them (loop Copilot-generated code back into the commons, which could theoretically lower the aggregate quality of what is available.)&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;<strong>Read more: </strong><a href=\"https://githubcopilotinvestigation.com/\">Maybe you don’t mind if GitHub Copi­lot used your open-source code with­out ask­ing.</a></p>\n\n\n\n<p><a href=\"https://githubcopilotinvestigation.com/\">But how will you feel if Copi­lot erases your open-source com­mu­nity? (GitHub Copilot investigation)</a>.</p>\n\n\n\n<p>####################################################</p>\n\n\n\n<p><strong>Common Sense Machines wants to make a 3D, temporal DALL-E:</strong><strong><br></strong><em>…CSM-1 is a neural network pretending to be a simulator and a sign of things to come…</em></p>\n\n\n\n<p>New AI startup Common Sense Machines has built CommonSim-1 (CSM1), a &#8220;neural simulation engine&#8221; which people can use to generate arbitrary 3D scenes and simulations.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;&#8220;CommonSim-1 is operated with images, language, and action. A user (machine or human) shows or describes what they want to simulate and then controls the kinds of outputs they want to measure and observe,&#8221;&nbsp; they write. &#8220;At the heart of CommonSim-1 is a foundation model of the 3D world that is trained on a large-scale, growing dataset of diverse human (and non-human) experience across a wide range of tasks. We combine publicly available data, our own internal datasets, and task-specific data provided by our partners.&#8221;</p>\n\n\n\n<p><strong>What can CommonSim-1 do?</strong> CSM1 can build high-resolution videos from as little as a single frame of video. &#8220;Since this model imagines the future, one can use its imagination (1) as training data for 3D generation and perception and (2) as part of another system’s predictive model,&#8221; they write. &#8220;With a mesh or NeRF generated by CommonSim-1, one can type natural-language descriptions into a text prompt and generate unlimited new hybrid scenes.&#8221;</p>\n\n\n\n<p><strong>Why this matters &#8211; worlds within worlds: </strong>CSM-1 is a miniature world &#8211; it&#8217;s literally a world model. It combines text and image and video and provides another approach to monetizing AI; helping to take costs out of 3D design and simulation via leveraging a (presumably) gigantic model. It&#8217;s also a sign of things to come &#8211; all models are going to tend towards incorporating all modalities and unfolding over time; CSM-1 is a taste of things to come.&nbsp;</p>\n\n\n\n<p>&nbsp;<strong>&nbsp;&nbsp;Read more:</strong> <a href=\"https://csm.ai/commonsim-1-generating-3d-worlds/\">Generating 3D Worlds with CommonSim-1 (Common Sense Machines, blog)</a>.&nbsp;</p>\n\n\n\n<p>####################################################<br><br><strong>Open access image generation raises $101 million:</strong><strong><br></strong><em>…That&#8217;s a whole lot of capital for a company commoditizing itself…</em></p>\n\n\n\n<p>Stability.ai, the company behind the free &#8216;Stable Diffusion&#8217; image model, has raised $101 million in funding. The round was led by Coatue, Lightspeed Venture Partners, and O&#8217;Shaughnessy Ventures LLC. For those not familiar, Stability.ai built Stable Diffusion, a widely used image generation model which, unlike proprietary counterparts Imagen and DALL-E, has had its weights released onto the internet, making it available to tinker with for free.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;&#8220;Since launching, Stable Diffusion has been downloaded and licensed by more than 200,000 developers globally,&#8221; the company writes in a press release.</p>\n\n\n\n<p><strong>A funny aside:</strong> I wrote this section of the newsletter while sat on a couch in the Exploratorium watching as people ate short-rib sliders and drank glasses of wine, awaiting a presentation from Stable Diffusion about their raise.&nbsp;</p>\n\n\n\n<p><strong>Why this matters:</strong> There&#8217;s a vigorous debate in the AI community about how AI models should proliferate (and there&#8217;s some indication that this debate seeped through to politicians; see Eshoo&#8217;s letter to the US National Security Advisor criticizing the release of model weights for Stability.ai (<a href=\"https://jack-clark.net/2022/10/03/import-ai-304-reality-collapse-thanks-to-facebook-open-source-speech-rec-ai-culture-wars/\">Import AI 304</a>)), and Stability.ai represents one extreme end of the spectrum &#8211; proliferate the weights, then build a range of as-a-service businesses on top. How this debate unfolds is going to have a major influence over the AI development landscape, so it&#8217;s worth paying attention to how Stability.ai navigates this space.&nbsp;</p>\n\n\n\n<p><strong>&nbsp;&nbsp;&nbsp;Read more:</strong> <a href=\"https://www.prnewswire.com/news-releases/stability-ai-announces-101-million-in-funding-for-open-source-artificial-intelligence-301650932.html\">Stability AI Announces $101 Million in Funding for Open-Source Artificial Intelligence (PR Newswire)</a>.<br></p>\n\n\n\n<p>####################################################</p>\n\n\n\n<p><strong>First, image models, now language models get commoditized:</strong></p>\n\n\n\n<p><em>…Carper plans to release a pretty good RLHF language model…</em></p>\n\n\n\n<p>CarperAI, an AI startup slash open source research collective slash cypherpunk-AI-guerilla group, plans to release a &#8220;chinchilla-optimal large language model explicitly trained to follow human instructions&#8221;. This is a big deal! Up to now, publicly released language models (e.g, OPT, BLOOM, GLM-130) are either not trained on the optimal amount of data, nor are they calibrated via human feedback to be better at following instructions. Instead, these models mostly reside inside proprietary labs (e.g, Anthropic, OpenAI). (Carper also recently released code to make it easy for anyone to train LMs &#8211; up to 20B parameters &#8211; from human feedback (<a href=\"https://jack-clark.net/2022/10/11/import-ai-305-gpt3-can-simulate-real-people-ai-discovers-better-matrix-multiplication-microsoft-worries-about-next-gen-deepfakes/\">Import AI #305</a>)).</p>\n\n\n\n<p><strong>Who they&#8217;re partnering with:</strong> CarperAI are partnering with Scale, Humanloop, HuggingFace, Multi, EleutherAI, and StabilityAI to train and deploy the model. This is a neat illustration of the shifting politics and allegiances of the AI ecosystem, and feels like a representation of a &#8216;second wave&#8217; of labs, following the &#8216;first wave&#8217; epitomized by OpenAI and DeepMind.</p>\n\n\n\n<p><strong>Why this matters: </strong>Models trained with reinforcement learning from human feedback (RLHF) are <em>really good</em>. They&#8217;re way, way better than non-RLHF models for most tasks. Also, models trained on more data via the Chinchilla insight are also way more capable than those trained on less data. By combining these two things, CarperAI is likely to release far and away the most capable language model onto the open internet. This has upsides &#8211; researchers will get to play with a decent RLHF model in an unrestricted way &#8211; as well as downsides &#8211; RLHF models are the proverbial machine gun to a pistol (non-RLHF models), so potential misuses are magnified as well.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;<strong>Read more:</strong> <a href=\"https://carper.ai/instruct-gpt-announcement/\">CarperAI, an EleutherAI lab, announces plans for the first open-source “instruction-tuned” language model (CarperAI)</a>.</p>\n\n\n\n<p>####################################################</p>\n\n\n\n<p><strong>Tech Tales:</strong></p>\n\n\n\n<p><strong>So, do I have your attention</strong></p>\n\n\n\n<p><em>[Meta&#8217;s wasteland, 2030]</em></p>\n\n\n\n<p>You want to survive in this world, you need to keep one eye closed.&nbsp;</p>\n\n\n\n<p>That&#8217;s what my Dad said to me when he handed me the headset.&nbsp;</p>\n\n\n\n<p>But dad &#8211; these are for both eyes, I said.&nbsp;</p>\n\n\n\n<p>I know, and that&#8217;s how they get you, he said. I know you&#8217;ve just 18 and think you&#8217;ve got it all figured out, but trust me &#8211; they&#8217;ve got you figured out more.&nbsp;</p>\n\n\n\n<p>So I put the headset on and kept one eye closed. I walked through a vast world full of verdant nature and bustling cities and intriguing quests and characters. After half an hour, I had almost completed my first quest. The last part of the mission was to place a gem I&#8217;d mined at the base of a totem. I found the totem and, as I approached, the background music in the game changed. Then after I put the gem in the base, some huge light source overhead turned on and the music swelled to a crescendo.&nbsp;</p>\n\n\n\n<p>&#8216;No son don&#8217;t look up,&#8217; i could hear my dad, muffled, shouting at me.&nbsp;</p>\n\n\n\n<p>But I looked up. Stared into the light on top of the totem and felt something tickle my brain, like the beginning of a joke. My right eye hurt from keeping it shut and I wanted to open it as lights strobed across the eyelid. But I didn&#8217;t. And then I got a splitting headache and I paused the game and took the headset off.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;What the hell was that? I said.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;That, my dad said, was your first encounter with an attention harvester.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;A what?</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;How do you think they fund the game? All the utility functions? Services.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;I don&#8217;t know, I guessed ads.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;We&#8217;re way beyond ads, he said. This thing is designed to capture you &#8211; if you had both eyes open you&#8217;d have spent half an hour talking to that thing, telling it everything about yourself. And the next time you did a quest the world would be even more engaging, and the next time you talked to a totem it&#8217;d take an hour, and then the world would get even more interesting. Do you see?</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;I do, I said.&nbsp;</p>\n\n\n\n<p>The next time I went in the game I walked until I was in the multiplayer area and, across a great plain, I saw numerous totems light up and numerous players stop at the base of them, some staying for minutes and others for hours. One player was there for five hours and still there when I left, standing at the base of the totem and looking up into its brilliant light.&nbsp;</p>\n\n\n\n<p><strong>Things that inspired this story: </strong>Attention harvesting; the logic of the metaverse; computer games; wisdom; MK Ultra.</p>\n",
  "wfw:commentRss": "https://jack-clark.net/2022/10/25/import-ai-307-copilot-lawsuit-stability-raises-101m-us-v-china-chiplomacy/feed/",
  "slash:comments": 0,
  "media:content": {
    "media:title": "Jack Clark"
  }
}