{
  "title": "20: Episode 20",
  "link": "https://audioboom.com/posts/7336355",
  "itunes:episode": 20,
  "itunes:title": "Episode 20",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3924,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On our December 18th, 2005 edition of MuggleCast…<br>\n<br>\n\n</div>\n<div>The Brit is back! And he weighs in on everything from Miss Granger to Las Vegas. While Hermione’s role in the final book remains undecided, just how has Emma’s role in the movies skewed people’s perception of the character? And how much of a coincidence is it that Hermione’s Patronus has a connection to Ron’s family? Plus, the return of Jamie’s British Joke of the Day.<br>\n<br>\n\n</div>\n<div>From Gringotts to Slughorn… All that and more ahead with Andrew, Ben, Jamie, Laura, and Micah on this week’s edition of MuggleCast.<br>\n<br>\n\n</div>\n<ul>\n<li>Jamie returns (with two British Jokes of the Day)</li>\n<li>Goblet of Fire Soundtrack Contest is now closed, winners to be announced next week</li>\n<li>You can now call us at 1-218-20-MAGIC</li>\n<li>…and now send us your fan-mail:MuggleCast<br>\nPO Box 223<br>\nMoundridge, Kansas (“Central Location!” cries Andrew)<br>\n67107</li>\n<li>Character Discussion: Hermione Granger</li>\n<li>What’s her role going to be in Book 7 – Powerful witch or Horcrux hunter?</li>\n<li>Can she perform under pressure?</li>\n<li>What is her Patronus’ significance, if any?</li>\n<li>Micah becomes our resident zoologist and comes up with an excellent theory</li>\n<li>Why does Draco seem so jealous of her?</li>\n<li>Let the battle begin: Emma vs. Hermione</li>\n<li>Dueling Club: Lupin vs. Greyback and Snape vs. Moody</li>\n<li>Jamie discusses the importance of Gringotts</li>\n<li>Will McGonagall make a good Headmistress?</li>\n<li>Can Slughorn finally unite the houses having become the Head of Slytherin?</li>\n<li>Andrew’s Listener Challenge and Ben’s Weekly Top 10 go on hiatus, Bemma cancelled</li>\n<li>The usuals: Spy on Spartz and The Las Vegas Minute (with Jamie making an announcement)</li>\n</ul>\n",
  "pubDate": "Sun, 18 Dec 2005 00:00:00 +0000",
  "guid": "tag:audioboom.com,2019-08-08:/posts/7336355",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}