{
  "title": "Somalia Reeling from Devastating Attack on Education Ministry",
  "link": "https://www.hrw.org/news/2022/11/01/somalia-reeling-devastating-attack-education-ministry",
  "description": "Click to expand Image\n          \n\n\n\n\n  \n        \n                      \n      \n        A destroyed building and vehicles after a double car bomb attack at a busy junction in Mogadishu, Somalia, October 29, 2022.\n                    © 2022 Farah Abdi Warsameh/AP Photo\n          \n\n  \n<p>On the afternoon of October 29, residents of Mogadishu were once again hit by a devastating attack in a crowded and bustling area of Somalia’s capital.</p>\n\n<p>The double car bombings struck the Ministry of Education as secondary school students and their families gathered to collect their graduation certificates. At least 121 people were killed and hundreds more injured, and the number of fatalities continues to rise. </p>\n\n<p>The Islamist armed group Al-Shabab claimed responsibility for the bombings, which like many of its previous attacks, appeared designed to inflict maximum death and suffering on ordinary Somalis. Since the Somali government launched a new offensive against Al-Shabab in September, attacks by the group have increased around the country.</p>\n\n<p>Al-Shabab has frequently claimed responsibility for attacks targeting civilians and civilian structures, in violation of the laws of war. They’ve also repeatedly attacked education facilities, teachers, and students.</p>\n\n<p>While the attacks have garnered scant international attention, devastating photos and accounts from survivors are emerging on social media. Some accounts describe students being struck down while getting their certificates; visitors caught in a bomb blast while visiting relatives; a journalist, Mohamed Isse Koona, rushing to cover the attack, only to be killed by the second car bomb; and a nurse and driver from the town’s main ambulance service getting injured in their ambulance by the second explosion.</p>\n\n<p>Media and blog posts have also reported on people lining up to get information on their loved ones and people volunteering to donate blood.</p>\n\n<p>Suffering from this devastating attack extends well beyond the immediate victims. The Somali authorities need to investigate and bring those responsible for the attack to justice. They also need to ensure investigations are neither abusive nor arbitrary, and any subsequent criminal proceedings are fair and credible. Somalia’s partners should help the authorities ensure that victims receive appropriate psychological and medical support, as well as promote due process efforts.</p>\n\n<p>Many of those affected may face a long road ahead.</p>",
  "pubDate": "Tue, 01 Nov 2022 18:09:09 -0400",
  "dc:creator": "Human Rights Watch",
  "guid": "https://www.hrw.org/news/2022/11/01/somalia-reeling-devastating-attack-education-ministry"
}