{
  "title": "Artificial Muscles Woven Into Smart Textiles Could Make Clothing Hyperfunctional",
  "link": "https://spectrum.ieee.org/smart-clothes-artificial-muscles",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/fabric-butterfly-on-a-tree-branch.jpg?id=30193856&width=1245&height=700&coordinates=0%2C117%2C0%2C117\"/><br/><br/><p>Recent <a href=\"https://onlinelibrary.wiley.com/doi/abs/10.1002/admt.202000383\" rel=\"noopener noreferrer\" target=\"_blank\">advances</a> in soft robotics have opened up possibilities for the construction of smart fibers and textiles that have a variety of mechanical, therapeutic, and wearable possibilities. These fabrics, when programmed to expand or contract through thermal, electric, fluid, or other stimuli, can produce motion, deformation, or force for different functions.<br/></p><p>Engineers at the University of New South Wales (UNSW), Sydney, Australia, have developed a new class of fluid-driven smart textiles that can “shape-shift” into 3D structures. Despite recent advances in the development of active textiles, “they are either limited with slow response times due to the requirement of heating and cooling, or difficult to knit, braid, or weave in the case of fluid-driven textiles,” says <a href=\"https://www.unsw.edu.au/staff/thanh-nho-do\" rel=\"noopener noreferrer\" target=\"_blank\">Thanh Nho Do</a>, senior lecturer at the UNSW’s Graduate School of Biomedical Engineering, who led the <a href=\"https://www.nature.com/articles/s41598-022-15369-2#author-information\" rel=\"noopener noreferrer\" target=\"_blank\">study</a>.</p><p>To overcome these drawbacks, the UNSW team demonstrated a proof of concept of miniature, fast-responding artificial muscles made up of long, fluid-filled silicone tubes that can be manipulated through hydraulic pressure. The silicone tube is surrounded by an outer helical coil as a constraint layer to keep it from expanding like a balloon. Due to the constraint of the outer layer, only axial elongation is possible, giving muscle the ability to expand under increased hydraulic pressure or contract when pressure is decreased. Using this mechanism, says Do, they can program a <a href=\"https://www.youtube.com/watch?v=VMzJ-0qt9gQ\" rel=\"noopener noreferrer\" target=\"_blank\">wide range of motion</a> by changing the hydraulic pressure.</p><p>“A unique feature of our soft muscles compared to others is that we can tune their generated force by varying the stretch ratio of the inner silicone tube at the time they are fabricated, which provides high flexibility for use in specific applications,” Do says.</p><p>The researchers used a simple, low-cost fabrication technique, in which a long, thin silicone tube is directly inserted into a hollow microcoil to produce the artificial muscles, with a diameter ranging from a few hundred micrometers to several millimeters. “With this method, we could mass-produce soft artificial muscles at any scale and size—diameter could be down to 0.5 millimeters, and length at least 5 meters,” Do says.</p><p>The filament structure of the muscles allows them to be stored in spools and cut to meet specific length requirements. The team used two methods to create smart fibers from the artificial muscles. One was using them as active yarns to braid, weave, or knit into active fabrics using traditional textile-making technologies. The other was by integrating them directly into conventional, passive fabrics.</p><p>The combination of hydraulic pressure, fast response times, light weight, small size, and high flexibility makes the UNSW’s smart textiles versatile and programmable. According to Do, the expansion and contraction of their active fabrics is similar to those of human muscle fibers.</p><p>This versatility opens up potential applications in soft robotics, including shape-shifting structures, biomimicking soft robots, locomotion robots, and smart garments. There are possibilities for use as medical/therapeutic wearables, as assistive devices for those needing help with movement, and as soft robots to aid the rescue and recovery of people trapped in confined spaces.</p><p>Although these artificial muscles are still a proof of concept, Do is optimistic about commercialization in the near future. “We have a Patent Cooperation Treaty application around these technologies,” he says. “We are also working on clinical validation of our technology in collaborations with local clinicians, including smart compression garments, wearable assistive devices, and soft haptic interfaces.”</p><p>Meanwhile, the research team continues to work on improvements. “We have currently achieved an outer diameter of 0.5 mm, which we believe is still large compared to the human muscle fibers,” says Do. “[So] one of the main challenges of our technology is how to scale the muscle to a smaller size, let’s say less than 0.1 mm in diameter.”</p><p>Another challenge, he adds, relates to the hydraulic source of power, which requires electric wires to connect and drive the muscles. “Our team is working on the integration of a new soft, miniature pump and wireless communication modules that will enable untethered driving systems to make it a smaller and more compact device.”</p><p>Analytical modeling for bending actuators is yet another area of improvement. Concomitant studies to demonstrate the feasibility of machine-made smart textiles and washable smart textiles in the smart garment industry are also necessary, the researchers say, as are further studies regarding incorporating functional components into smart textiles to provide additional benefits.</p>",
  "pubDate": "Thu, 21 Jul 2022 18:33:12 +0000",
  "guid": "https://spectrum.ieee.org/smart-clothes-artificial-muscles",
  "category": [
    "Artificial muscles",
    "Soft robotics",
    "Smart textiles",
    "Hydraulics"
  ],
  "dc:creator": "Payal Dhar",
  "media:content": ""
}