{
  "title": "A step towards a reinforcement learning de novo genome assembler. (arXiv:2102.02649v3 [q-bio.GN] UPDATED)",
  "link": "http://arxiv.org/abs/2102.02649",
  "description": "<p>The use of reinforcement learning has proven to be very promising for solving\ncomplex activities without human supervision during their learning process.\nHowever, their successful applications are predominantly focused on fictional\nand entertainment problems - such as games. Based on the above, this work aims\nto shed light on the application of reinforcement learning to solve this\nrelevant real-world problem, the genome assembly. By expanding the only\napproach found in the literature that addresses this problem, we carefully\nexplored the aspects of intelligent agent learning, performed by the Q-learning\nalgorithm, to understand its suitability to be applied in scenarios whose\ncharacteristics are more similar to those faced by real genome projects. The\nimprovements proposed here include changing the previously proposed reward\nsystem and including state space exploration optimization strategies based on\ndynamic pruning and mutual collaboration with evolutionary computing. These\ninvestigations were tried on 23 new environments with larger inputs than those\nused previously. All these environments are freely available on the internet\nfor the evolution of this research by the scientific community. The results\nsuggest consistent performance progress using the proposed improvements,\nhowever, they also demonstrate the limitations of them, especially related to\nthe high dimensionality of state and action spaces. We also present, later, the\npaths that can be traced to tackle genome assembly efficiently in real\nscenarios considering recent, successfully reinforcement learning applications\n- including deep reinforcement learning - from other domains dealing with\nhigh-dimensional inputs.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/q-bio/1/au:+Padovani_K/0/1/0/all/0/1\">Kleber Padovani</a>, <a href=\"http://arxiv.org/find/q-bio/1/au:+Xavier_R/0/1/0/all/0/1\">Roberto Xavier</a>, <a href=\"http://arxiv.org/find/q-bio/1/au:+Carvalho_A/0/1/0/all/0/1\">Andre Carvalho</a>, <a href=\"http://arxiv.org/find/q-bio/1/au:+Reali_A/0/1/0/all/0/1\">Anna Reali</a>, <a href=\"http://arxiv.org/find/q-bio/1/au:+Chateau_A/0/1/0/all/0/1\">Annie Chateau</a>, <a href=\"http://arxiv.org/find/q-bio/1/au:+Alves_R/0/1/0/all/0/1\">Ronnie Alves</a>"
}