{
  "title": "Developing effective data scientists",
  "link": "http://www.erinshellman.com/developing-effective-data-scientists/",
  "comments": "http://www.erinshellman.com/developing-effective-data-scientists/#respond",
  "dc:creator": "erinshellman",
  "pubDate": "Thu, 11 Feb 2016 01:26:50 +0000",
  "category": [
    "career",
    "data science",
    "teaching",
    "code",
    "education",
    "productivity",
    "programming"
  ],
  "guid": "http://www.erinshellman.com/?p=549",
  "description": " <a class=\"read-more\" href=\"http://www.erinshellman.com/developing-effective-data-scientists/\"></a>",
  "content:encoded": "<p>Last year I had the honor and pleasure of visiting my graduate school alma mater to speak at the kick-off event for the University of Michigan&#8217;s new <a href=\"http://midas.umich.edu/\" target=\"_blank\">Institute for Data Science</a>. They invited me to share my work and teaching experiences, and offer guidance to students and educators of data science. I asked a bunch of my data scientist friends what they could have done differently to better prepare themselves for their careers, and there were a lot of similarities in the responses. I&#8217;ve attempted to distill them into three core competencies: communication, coding, and curiosity&#8230; and alliteration, when possible.</p>\n<h3>Effective data scientists communicate well</h3>\n<p>Communicating technical concepts to non-technical audiences is a huge part of a data scientist&#8217;s job. To do that well, you need a solid understanding of the techniques in your toolbox, and should be able to provide intuitions for why the techniques work. Also expect to spend a lot of time communicating technical concepts to other technical people from different disciplines, like software engineers. Communicating effectively with engineers requires that you think about data products in terms of their inputs and outputs. What inputs do your algorithms need in order to work and where will those inputs come from? What does the algorithm return as a result, and what&#8217;s the level of uncertainty?</p>\n<div id=\"attachment_563\" style=\"width: 310px\" class=\"wp-caption alignright\"><a href=\"http://www.erinshellman.com/blog/wp-content/uploads/2016/02/Screenshot-2016-01-25-17.22.59.png\" rel=\"attachment wp-att-563\"><img aria-describedby=\"caption-attachment-563\" class=\"size-medium wp-image-563\" src=\"http://www.erinshellman.com/blog/wp-content/uploads/2016/02/Screenshot-2016-01-25-17.22.59-300x259.png\" alt=\"Effective data scientists gesticulate wildly to drive home key points.\" width=\"300\" height=\"259\" srcset=\"http://www.erinshellman.com/blog/wp-content/uploads/2016/02/Screenshot-2016-01-25-17.22.59-300x259.png 300w, http://www.erinshellman.com/blog/wp-content/uploads/2016/02/Screenshot-2016-01-25-17.22.59.png 460w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a><p id=\"caption-attachment-563\" class=\"wp-caption-text\">Effective data scientists gesticulate wildly to drive home key points.</p></div>\n<p>In addition to the technical aspects of communication, data scientists are often expected to evangelize and advocate for their work more than is typical in older disciplines like software engineering. It&#8217;s critical for data scientists to understand the business in a broader context than their team or department, and also be able to identify specifically how their contributions fit into the broader context. At Nordstrom we did this with dollars, the ideal unit of measurement. We worked primarily in the area of product recommendations, so we could directly connect recommendation activity with sales. Your work won&#8217;t always be easy to quantify, which is why it&#8217;s important to establish evaluation metrics <em>before</em> starting projects.</p>\n<div class=\"perfect-quotes\">LEARN MORE CODING AND STATISTICS. Meet other people working on data sets not in your field. Learn something not in your field. Don&#8217;t sit in a box staring at your thesis project.<span>- Wendy Grus, Technical Data Analyst @ Inrix</span></div>\n<p>Developing communication skills as a student is pretty natural. Try presenting your work, blogging, and teaching others. When I was working on my PhD, my department had a student-run seminar series called Bistro. Bistro was a fantastic way for us to share our work and get feedback in a low-pressure setting. If you want to avoid the random and occasionally terrifying aspects of public speaking, blogging is an excellent way to practice written communication and advance your &#8220;personal brand.&#8221; <em>Ahem.</em></p>\n<h3>Effective data scientists write high-quality code</h3>\n<p>At Nordstrom my team was split evenly between software developers and data scientists. Working in the Data Lab was the first time in my life that I was not the sole consumer of my own code. Instead I wrote code for a website that got millions of hits everyday. I initially didn&#8217;t have the skills to write production-quality code, so my first year as a data scientist was a year of intense learning and buggin&#8217; out about how slow I felt.</p>\n<div class=\"perfect-quotes\">The single most useful thing I learned in grad school was how to work with Python.<span>- Sarah Guido, Data Scientist @ bit.ly</span></div>\n<p>You don&#8217;t have to be a software engineer, but it&#8217;s critical that before graduation you&#8217;re proficient in at least one programming language, and the sooner you adopt good coding practices the easier the transition will be. Start using automated testing now, and invest in learning to use your tools better (or get better tools).</p>\n<div class=\"perfect-quotes\">I wish there had been more emphasis on real data/messy data/getting my own data/cleaning data.<span>- Trey Causey, Data Scientist @ ChefSteps</span></div>\n<p>Unfortunately, demonstrating language proficiency isn&#8217;t enough. As a data scientist you&#8217;ll be expected to apply statistical skills in many domains throughout the business. For example, the Data Lab tackles problems ranging from personalization and marketing, to store display testing, to operations. Exposure to lots of different types of data in graduate school&#8211;especially large, messy bioinformatics data&#8211;prepared me to contribute to lots of different types of projects later.</p>\n<h3>Effective data scientists are curious, life-long learners</h3>\n<p>The tools and technologies of data science change at an incredible pace which is at once exciting and exhausting. To succeed in this field it&#8217;s important to have a mindset of life-long improvement and learning. Curiosity too is critical, because even if you work for the same company your entire career, you&#8217;ll be exposed to a breadth of problems over the years. In short, effective data scientists are usually people who can find something interesting in anything.</p>\n<div class=\"perfect-quotes\">I took Naval Criminal Law &#038; international relations. It was hard to stay awake. By comparison, I looked forward to vector calculus and loved Matlab. Lesson: Don&#8217;t be afraid to explore your options while you are still on the track of figuring out what comes next.<span>- Amanda Casari, Senior Data Scientist @ Concur</span></div>\n<p>While you&#8217;re a student, developing curiosity is hopefully something you don&#8217;t need to work too hard at (you&#8217;re so young to be this jaded). Try something simple like grabbing an Oprah Chai<img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/2122.png\" alt=\"™\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /> with someone outside your department and then think about how you might approach their research questions using your computational and quantitative tools. Also, go to a meet-up. Meet-ups can be a great place to learn about tools and techniques that are actually being applied out in the wild (<a href=\"http://www.meetup.com/Seattle-PyLadies/\" target=\"_blank\">and meet really fun and supportive women who program in Python in the Seattle area</a>).</p>\n<div class=\"perfect-quotes\">Boundaries between disciplines are becoming less-defined. There are general, powerful patterns of thinking that apply to many disciplines. A good way to become aware of these patterns is to broaden exposure to disciplines.<span>- James Pestrak, Senior Data Scientist @ Nordstrom</span></div>\n<p>I love the last two quotes because they advance the idea of casting a wide net in terms of academic interests. Ultimately, a data scientist is a person with a generalizable set of quantitative skills. As you grow and evolve, and your interests change, data science doesn&#8217;t lock you into any particular career. Instead, data science enables you to approach any problem that can be solved with quantitative tools, and that&#8217;s extremely powerful.</p>\n",
  "wfw:commentRss": "http://www.erinshellman.com/developing-effective-data-scientists/feed/",
  "slash:comments": 0
}