{
  "title": "Numb3d by Numbers&#8212;a must see kid&#8217;s science exhibition about measurement, counting, and stats",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/06/numb3d-by-numbers-a-must-see-kids-science-exhibition-about-measurement-counting-and-stats/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/06/numb3d-by-numbers-a-must-see-kids-science-exhibition-about-measurement-counting-and-stats/#comments",
  "dc:creator": "Bob Carpenter",
  "pubDate": "Thu, 06 Oct 2022 19:00:37 +0000",
  "category": "Teaching",
  "guid": "https://statmodeling.stat.columbia.edu/?p=48060",
  "description": "Mitzi and I just visited Antonietta Mira in Lugano. We went to talk about applying her delayed rejection algorithm to Hamiltonian Monte Carlo and partial momentum refresh Metropolis-adjusted Langevin. Numb3d by Numbers We were absolutely blown away when Antonietta took &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/06/numb3d-by-numbers-a-must-see-kids-science-exhibition-about-measurement-counting-and-stats/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>Mitzi and I just visited <a href=\"https://search.usi.ch/en/people/f8960de6d60dd08a79b6c1eb20b7442b/mira-antonietta\">Antonietta Mira</a> in Lugano.  We went to talk about applying her delayed rejection algorithm to Hamiltonian Monte Carlo and partial momentum refresh Metropolis-adjusted Langevin.</p>\n<p><b>Numb3d by Numbers</b> </p>\n<p>We were absolutely blown away when Antonietta took us on a tour of her science museum exhibition on probability, statistics, and simulation (Diamo I Numeri! in Italian, Numb3d by Numbers in English, which are not quite direct translations).  If I had seen this when I was a kid, you wouldn&#8217;t have been able to tear me away from the exhibits until I&#8217;d figured each one out.  The kids that were there when we were touring were all enthralled. </p>\n<p>Here&#8217;s a description of the exhibit (in English): <a href=\"https://statmodeling.stat.columbia.edu/wp-content/uploads/2022/10/numb3d-by-numbers.pdf\">Numb3d by Numbers</a>.  And here&#8217;s a short video in Italian, which shows how beautiful the exhibits are: <a href=\"https://youtu.be/p4wfzwREvkI\">Diamo I Numeri!</a>  </p>\n<p><b>The exhibits</b></p>\n<p>Among the exhibits Mitzi and I recall (and we were only there for an hour or so!):</p>\n<ul>\n<li> the coolest, largest-scale Galton board I&#8217;ve ever seen\n<li> a horse race with two six-sided dice and horses numbered 2&#8211;12\n<li> the towers of Hanoi\n<li> number writing systems that had kids translate their age\n<li> ancient games of counting\n<li> a magic trick with a giant deck of cards (see below)\n<li> population pyramids where people put their number down\n<li> crowdsourced guesses of jars of regular and irregular items\n<li> visualizations with strings of what you&#8217;re good and bad about to see trends\n<li> tangrams and other shape-based puzzles\n<li> magic squares with all the math\n<li> combinatorics and growth of possibilities\n<li> real-time counters, scales, and how they need to be contextualized\n<li> emergent patterns like dragonfly wings and sunflower illustrations of Fibonacci sequences\n<li> randomness and patterns\n<li> parity and how shepherds count goats\n<li> positive predictive accuracy of diagnostic tests using frequencies rather than probabilities\n<li> abacuses and calculating methods\n</ul>\n<p>The exhibits are aimed at kids, but they also work for adults and some of them even for young kids. It&#8217;s set up in a beautiful hillside science museum (all of Lugano is amazingly beautiful, being situated on a crystal clear alpine lake).  The exhibition is designed to be led by a science educator, though it&#8217;s also possible to do a self-guided tour.  </p>\n<p><b>On the road</b></p>\n<p>The great news is that Antonietta and crew just got a grant to translate the exhibit into English and German (it&#8217;s now in Italian) and take it on the road.  She&#8217;s looking for collaborators interested in bringing it to their home towns.  If you have any interest in stats education for kids, this is a golden opportunity.</p>\n<p><b>A probabilistic card trick</b></p>\n<p>I was fascinated by the probabilistic card trick (Antonietta&#8217;s a mathemagician and did a bunch of other card tricks for us).  Kids divide up a deck of cards and lay them out end to end in any order (these were huge cards so the deck made a winding path through the exhibits).  Then kids chose different starting points in the first five cards and stood on the card they chose.  Then each proceeds to move along the path (down the deck), each time advancing by the value of the card on which they were standing (cards 1&#8211;9 had their natural values, ace, 10, jack, queen, king all count as 1).  The science educator conducting the tour tells the kids where they&#8217;ll land before they start.  </p>\n<p>So the question is how does this work?  If you&#8217;re used to thinking about simulation, you may understand the theory of why this is likely to happen.  Mitzi and I had to put on our <a href=\"https://bookdown.org/manuele_leonelli/SimBook/a-bit-of-history.html\">Stan(islaw Ulam) hats</a> to work out how probable the trick is to work by simulation.  I&#8217;ll leave it as an exercise for the reader (and provide a solution in a follow-up post).</p>\n<p><b>A horse race</b></p>\n<p>I really liked the horse race because it involved dice and was very graphic and tactile.  Kids all get a pair of really big dice and the horses are numbered 2&#8211;12.  Each time a horse&#8217;s number comes up, it advances one step.  The first horse to take 20 (?) steps wins.  Of course, the 7 horse is the strong favorite, especially with a lot of steps.  We didn&#8217;t get around to doing the simulation for that one, but it&#8217;d be a nice exercise to introduce discrete Monte Carlo methods.</p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/06/numb3d-by-numbers-a-must-see-kids-science-exhibition-about-measurement-counting-and-stats/feed/",
  "slash:comments": 2
}