{
  "id": "tag:blogger.com,1999:blog-19803222.post-6636536578834134441",
  "published": "2017-03-10T05:46:00.000-07:00",
  "updated": "2017-03-10T05:46:22.697-07:00",
  "title": "Awesome people: Lise Getoor (IWD++)",
  "content": "To honor women this <a href=\"https://www.internationalwomensday.com/\">International Women's Day</a>, I have a several posts, broadly around the topic of women in STEM. Previous posts in this series include: <a href=\"https://nlpers.blogspot.com/2017/03/awesome-people-bonnie-dorr-iwd.html\">Awesome People: Bonnie Dorr</a> and <a href=\"https://nlpers.blogspot.com/2017/03/awesome-people-ellen-riloff-iwd.html\">Awesome People: Ellen Riloff</a>.<br /><br />Today is the continuation of the theme \"who has been influential in my career and helped me get where I am?\" and in that vein, I want to talk about another awesome person: Lise Getoor.<br /><br /><a href=\"https://www.soe.ucsc.edu/people/getoor\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img height=\"320\" src=\"https://www.soe.ucsc.edu/people/getoor/photo/1\" width=\"265\" /></a>Lise is best known for her deep work in statistical relational learning, link mining, knowledge graph models and tons of applications to real world inference problems where data can be represented as a graph. She's currently a professor in CS at UCSC, but I had the fortune to spend a few years with her while she was still here at UMD. During this time, she was an NSF Career awardee, and is now a Fellow of the AAAI. At UMD when you're up for promotion, you give a \"promotion talk\" to the whole department, and I still remember sitting in her Full Prof promotion talk and being amazed---despite having known her for years at this point---at how well she made both deep technical contributions and also built software and tools that are useful for a huge variety of practitioners.<br /><br />Like Bonnie Dorr, Lise was something of an unofficial mentor to me. Ok I'll be honest. She's still an unofficial mentor to me. Faculty life is hard work, especially when one has just moved; going through tenure is stressful in a place where you haven't had years to learn how things work; none of which is made easier by simultaneously having personal-life challenges. Lise was always incredibly supportive in all of these areas, and I don't think I realized until after she had moved to UCSC how much I benefited from Lise's professional and emotional labor in helping me survive. And how helpful it is to have an openly supportive senior colleague to help grease some gears. I always felt like Lise was on my side.<br /><br /><a href=\"http://www.umiacs.umd.edu/~getoor/index.shtml\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img height=\"200\" src=\"https://www.umiacs.umd.edu/~getoor/images/lcg.jpg\" width=\"163\" /></a>Probably one of the most important things I learned from Lise is how to be strategic, both in terms of research (what is actually worth putting my time and energy into) and departmental work (how can we best set ourselves up for success). As someone who has a tendency to spread himself too thin, it was incredibly useful to have a reminder that focusing on a smaller number of deeper things is more likely to have real lasting impact. I also found that I greatly respected her attention to excellence: my understanding (mostly from her students and postdocs) is that her personal acceptance rate on conference submissions is incredibly high (like almost 1.0), because her own internal bar for submission is generally much higher than any reviewer's. This is obviously something I haven't been able to replicate, but I think incredibly highly of Lise for this.<br /><br />Lise and I got promoted the same year---her to full prof, me to associate prof---and so we had a combined celebration dinner party at one of the (many) great Eritrean restaurants in DC followed by an attempt to go see life jazz at one of my favorite venues across the street. The music basically never showed up, but it was a really fun time anyway. Lise gave me a promotion gift that I still have on my desk: a small piece of wood (probably part of a branch of a tree) with a plaque that reads \"Welcome to the World of Deadwood.\" This is particularly meaningful to me because Lise is so far from deadwood that it puts me to shame, and I can only hope to be as un-deadwood-like as her for the rest of my career.<br /><br />Thanks Lise!",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "hal",
    "uri": "http://www.blogger.com/profile/02162908373916390369",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}