{
  "title": "How Microwave Radar Brought Direct Phone Calls to Millions",
  "link": "https://spectrum.ieee.org/trans-canada-microwave-system-milestone",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/an-electrical-tower-against-a-cloudy-sky.jpg?id=31941092&width=1200&height=800&coordinates=0%2C104%2C0%2C105\"/><br/><br/><p>Making direct, long-distance phone calls to family and friends is quick and easy today. But when the telephone was invented in 1876, the farthest a call could be made was about 13 kilometers.</p><p>The first of those calls involved the telephone’s inventor, <a href=\"https://ethw.org/Alexander_Graham_Bell\" rel=\"noopener noreferrer\" target=\"_blank\">Alexander Graham Bell</a>, who spoke from Paris, Ont., Canada, with his father, who lived in Brantford, also in Ontario.</p><hr/><p>Intercity telephone networks had been built in Canada in 1881, but the distances between them were limited, and customers needed to be connected to each other by an operator.</p><p>Fast-forward to 1958. To enable direct-dialed, long-distance calls, <a href=\"https://www.bell.ca/\" rel=\"noopener noreferrer\" target=\"_blank\">Bell Canada</a>, headquartered in Montreal, built the Trans-Canada Microwave system. It consisted of 139 relay towers that spanned more than 6,000 kilometers, from Victoria, B.C., to Sydney, N.S. The system used microwave frequencies to achieve a high enough bandwidth and telephone line capacity to conduct the calls. When the system was completed, it was the longest microwave relay network in the world.</p><p>The microwave system was commemorated with an IEEE Milestone during a ceremony on 1 July at the <a href=\"https://www.telus.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Telus</a> headquarters in Vancouver—which is a former Trans-Canada Microwave site. The <a href=\"https://vancouver.ieee.ca/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Vancouver Section</a> sponsored the Milestone nomination.</p><p>“No single engineering achievement of the past century has had a greater impact on Canada’s society, economy, and citizens than the completion of the Trans-Canada Microwave system,” says IEEE Senior Member <a href=\"https://ece.ubc.ca/david-michelson/\" rel=\"noopener noreferrer\" target=\"_blank\">David Michelson</a>, <a href=\"https://www.ieee.ca/en/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Canada</a>’s historian. “Introducing direct-dialed long-distance telephone services to Canadians immediately transformed the way that they communicated with each other for both business and pleasure.”</p><h2>A growing demand for long-distance calls</h2><p>When telephones were introduced to consumers, Canadians’ usage was among the highest in the world, according to the <a href=\"https://ethw.org/Milestones:The_Trans-Canada_Microwave_System,_1958\" rel=\"noopener noreferrer\" target=\"_blank\">Milestone entry</a> on the <a href=\"https://ethw.org/Main_Page\" rel=\"noopener noreferrer\" target=\"_blank\">Engineering and Technology History Wiki</a>.</p><p>In the early 1900s, seven telecommunications companies provided telephone services in Canada, according to a <a href=\"https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=6372537\" rel=\"noopener noreferrer\" target=\"_blank\">1956 article</a> in <a href=\"https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6367273\" rel=\"noopener noreferrer\" target=\"_blank\"><em>Transactions of the American Institute of Electrical Engineers</em></a>. (AIEE is one of IEEE’s predecessor societies.) Each company operated a small network within its own territory. In 1929 they formed the <a href=\"https://publications.gc.ca/collections/collection_2019/isde-ised/Co22/Co22-321-1979-eng.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">TransCanada Telephone System</a> to expand and maintain the networks. Its telephone systems consisted of copper wires or high-frequency and very-high-frequency radio waves. The country had nine switching centers, where operators connected callers. But the system had limited capacity, suffered from poor voice quality, and was expensive to use.</p><p>After World War II, Canada’s economy boomed, and its population grew. The volume of long-distance calls made during the first postwar decade doubled from the prewar era, according to the ETHW entry.</p><p>To keep up with the demand, TransCanada hired Bell Canada to upgrade the networks. The company’s engineers determined that microwave links could be used to improve the service. During World War II, scientists from Canada, the United Kingdom, and the United States had developed microwave transmitters and receivers for use in radar systems that measure the echo of a pulse of microwave radiation to detect and locate distant objects. Adopting the high operating frequencies used by radar systems increased the bandwidth and capacity of the new communication system, Michelson says.</p><p>The first part of Bell Canada’s intercity network began operating in 1948. Its 23 telephone lines connected Nova Scotia with Prince Edward Island, a distance of 211 km. Four years later, a radio system made up of 46 telephone lines began operating. It connected Halifax with St. John, N.B., a distance of about 310 km.</p><p>In 1953 Bell Canada built a microwave relay system that linked Buffalo, N.Y., to Toronto; Ottawa; Montreal; Quebec City, Que.; and Kingston, Ont.</p><h2>Building Canada’s national telephone and TV network</h2><p>Because of the success of the intercity networks, the <a href=\"https://www.cbc.ca/\" rel=\"noopener noreferrer\" target=\"_blank\">Canadian Broadcasting Corp.</a>, the country’s public broadcaster for both radio and television, decided to build a nationwide relay network to send TV and radio signals from coast to coast. Construction began in March 1955 and was completed in June 1958.</p><p>The CBC system introduced live network television to households. There had been no national TV network with individual stations or live programming.</p><p>To provide the ability to make coast-to-coast calls and access to TV programs nationwide, engineers used Bell Canada’s Northern Electric TD-2 microwave equipment, according to a 1957 <a href=\"https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=6442806\" rel=\"noopener noreferrer\" target=\"_blank\"><em>Electrical Engineering</em> article</a>. The equipment operated at a frequency of 4,000 megahertz, which produced six, two-way radio channels. One of the channels served as a backup in case another one malfunctioned. Each channel could handle two TV programs or 600 telephone connections, according to the 1957 article.</p><p>The TD-2 system divided bandwidth into frequency “slots” so that a channel could be shared among several users at the same time. Because each channel had an effective base bandwidth of 10 MHz and a TV program used 4 MHz, it was possible to house a TV program and a small number of telephone lines on the same channel simultaneously, according to the <em>Electrical Engineering</em> article.</p><p>The new TV network began operating in July 1958, when it ran its first live coast-to-coast broadcast—“A Memo to Champlain”—in honor of Canada Day.</p><p>The Trans-Canada Microwave system was decommissioned in the late 1990s. It has been replaced with satellites and fiber-optic cables.</p><p>Administered by the <a href=\"http://www.ieee.org/about/history_center/index.html\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE History Center</a> and <a href=\"https://www.ieeefoundation.org/donate_history\" rel=\"noopener noreferrer\" target=\"_blank\">supported by donors</a>, the Milestone program recognizes outstanding technical developments around the world.</p><p>The Trans-Canada system’s Milestone plaque, which is displayed in the lobby of the Telus headquarters, reads:</p><p><em>On 1 July 1958, the Trans-Canada Microwave system introduced live network television and direct-dialed long-distance telephone service to Canadians from coast to coast. Comprising 139 towers spanning more than 6,275 kilometres, it was, when completed, the world’s longest such network. Later extended and upgraded, the system had an immense impact on Canada’s society and economy.</em></p><em></em>",
  "pubDate": "Thu, 13 Oct 2022 18:00:01 +0000",
  "guid": "https://spectrum.ieee.org/trans-canada-microwave-system-milestone",
  "category": [
    "Ieee history",
    "Ieee milestone",
    "Telecommunications",
    "Microwave radar",
    "Ieee history",
    "Type:ti"
  ],
  "dc:creator": "Joanna Goodrich",
  "media:content": ""
}