{
  "title": "S1 Ep49: #49 - Zane Got Fired Because of This",
  "link": "https://audioboom.com/posts/7874589",
  "itunes:episode": 49,
  "itunes:title": "#49 - Zane Got Fired Because of This",
  "itunes:season": 1,
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3377,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>Brothers and sisters, thank you for returning, once again, to the church of UNFILTERED! Your patronage certainly means a lot to us as we discuss our strong and errr.. admittedly not-so-strong relationships with the big man upstairs. We must say though, down here on the ground floor things are getting pretty wacky. It seems both Zane AND Carole Baskin are being publicly called out after their individually polarizing returns to the spotlight. But to the haters we offer our WAP (our Wholly Appreciative Prayers, that is) knowing full-well that redemption lies just around the corner. And in this case it may be in the form of a potential modeling contract for Zane?!! Now that’s a shake up no one saw coming, much like the LA earthquake that shook the gang just a day before recording this episode! Maybe that’s why we are spilling so much news about UNFILTERED: Season 2, like officially announcing our first confirmed guest! Or when to expect the triumphant return of weekly bonus videos to the channel!</p>\n<p><br>\n</p>\n<p>Any way you look at it though, whether our second season is heavenly or hellacious, we know you’re gonna want to be a part of this congregation! So settle in with your wine and wafers or just come as you are to this positively divine episode of Zane and Heath: UNFILTERED.</p>\n<p>Go to <a href=\"http://liquidiv.com\">http://liquidiv.com</a> and use code UNFILTERED at checkout to get 25% off!</p>\n<p>Go to <a href=\"http://earnest.com/unfiltered\">http://earnest.com/unfiltered</a> to get $100 cash bonus when you refinance your student loan!</p>\n<p>Go to <a href=\"http://harrys.com/unfiltered\">http://harrys.com/unfiltered</a> and redeem your trial offer today!</p>\n",
  "itunes:summary": "Brothers and sisters, thank you for returning, once again, to the church of UNFILTERED! Your patronage certainly means a lot to us as we discuss our strong and errr.. admittedly not-so-strong relationships with the big man upstairs. We must say though, down here on the ground floor things are getting pretty wacky. It seems both Zane AND Carole Baskin are being publicly called out after their individually polarizing returns to the spotlight. But to the haters we offer our WAP (our Wholly Appreciative Prayers, that is) knowing full-well that redemption lies just around the corner. And in this case it may be in the form of a potential modeling contract for Zane?!! Now that’s a shake up no one saw coming, much like the LA earthquake that shook the gang just a day before recording this episode! Maybe that’s why we are spilling so much news about UNFILTERED: Season 2, like officially announcing our first confirmed guest! Or when to expect the triumphant return of weekly bonus videos to th...",
  "pubDate": "Mon, 21 Sep 2020 10:00:00 +0000",
  "guid": "13c8e088-fbf0-11ea-80ab-0b6a9a94058d",
  "itunes:author": "Zane & Heath",
  "dc:creator": "Zane & Heath",
  "media:rights": ""
}