{
  "title": "A New One-Stop Resource for IEEE Life Members",
  "link": "https://spectrum.ieee.org/new-ieee-life-members-website",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-photo-of-a-pair-of-women-and-an-older-man-in-front-of-a-tablet.jpg?id=31821584&width=1200&height=800&coordinates=0%2C0%2C0%2C209\"/><br/><br/><p>The new<a href=\"https://life.ieee.org/\" rel=\"noopener noreferrer\" target=\"_blank\"> IEEE Life Members website</a> is a one-stop resource to keep the most experienced of members connected.</p><p>The life member designation is for those who have reached the age of 65 and have been with IEEE for such a period of time that the sum of their age and their years of membership equals or exceeds 100.</p><hr/><p>There are many benefits to being a life member. Dues, regional assessments, and society fees are waived. Life members receive reduced registration fees at conferences for which IEEE is the sole sponsor. In addition, the members can continue to participate in the <a href=\"https://www.ieee.org/membership/discounts/index.html\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Member Discounts</a> program. They also retain all the other benefits of membership. </p><p>IEEE’s 35,000 life members provide professional and personal experiences and are an underutilized source of wisdom, says Life Member <a href=\"https://www.linkedin.com/in/ralph-wyndrum-41005065/\" rel=\"noopener noreferrer\" target=\"_blank\">Ralph Wyndrum</a>, an IEEE Fellow who led the project to redesign the website.</p><p class=\"pull-quote\">“IEEE’s 35,000 life members provide professional and personal experiences and are an underutilized source of wisdom.”</p><p>“As life members, we are uniquely experienced and available to serve as volunteers to the IEEE,” Wyndrum says, “and to those in the profession who would like to fast-track their career knowledge and advancement through formal and informal opportunities.”</p><p>IEEE Senior Member <a href=\"https://www.linkedin.com/in/howard-wolfman-5494b21/\" rel=\"noopener noreferrer\" target=\"_blank\">Howard Wolfman</a>, chair of the <a href=\"https://mga.ieee.org/board-committees/committees/216-ieee-life-members-committee\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Life Members Committee</a>, says that for about a year, the committee painstakingly reviewed all its activities, “reimagining a more intuitive and efficient way to connect our members and the public to the million years of professional and life experiences that IEEE life members have to offer.”</p>\n<h2>Five ways to connect</h2><p>The new website is organized into five sections:</p><ul><li><a href=\"https://life.ieee.org/get-involved/\" rel=\"noopener noreferrer\" target=\"_blank\">Ways to get involved.</a> There are many opportunities to participate, including helping others connect with senior leaders in the corporate and academic worlds, mentoring the next generation of engineers, and getting involved in technical and nontechnical <a href=\"https://life.ieee.org/get-involved/special-interest-groups/\" rel=\"noopener noreferrer\" target=\"_blank\">interest groups</a>. </li><li><a href=\"https://life.ieee.org/news-events/\" rel=\"noopener noreferrer\" target=\"_blank\">News and events.</a> Members are kept informed through a newsletter, announcements, and a calendar of upcoming meetings.</li><li><a href=\"https://life.ieee.org/awards-recognition/\" rel=\"noopener noreferrer\" target=\"_blank\">Awards and recognitions.</a> Learn about the four awards that the Life Members Committee bestows to honor the work of its members. Also included is information about nominating a colleague. </li><li><a href=\"https://life.ieee.org/volunteers/\" rel=\"noopener noreferrer\" target=\"_blank\">Volunteers.</a> For those who want to donate their time, there are several ways to do so. One is to join a section’s or council’s life member affinity group. The groups let life members contribute to the social good in their community, advance the professional interests of IEEE, and plan social and technical events.</li><li><a href=\"https://life.ieee.org/resources/\" rel=\"noopener noreferrer\" target=\"_blank\">Resources.</a> This section of the website offers books, publications, videos, and continuing-education materials to help members stay technically current.</li></ul>\n<h2>A new Collabratec community</h2><p>An online community for life members has launched on <a href=\"https://ieee-collabratec.ieee.org/app/home\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Collabratec</a>, the organization’s professional networking and collaboration platform. <a href=\"https://ieee-collabratec.ieee.org/app/community/1348/IEEE-Life-Members-and-Friends/activities\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Life Members and Friends</a> community provides opportunities to connect and engage in conversations of mutual interest with others, regardless of their physical location.</p>“In addition to improving connectivity and fellowship among our life members,” Wolfman says, “we have begun taking bold, new measures to support the next generation of innovators.” Throughout this year and next, he says, the Life Members Committee will collaborate with the <a href=\"https://www.ieeefoundation.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Foundation</a> to raise funds to support leadership-development events and opportunities for IEEE’s student members.",
  "pubDate": "Tue, 13 Sep 2022 18:00:00 +0000",
  "guid": "https://spectrum.ieee.org/new-ieee-life-members-website",
  "category": [
    "Ieee member news",
    "Ieee products services",
    "Life members",
    "Ieee collabratec",
    "Ieee life member committee",
    "Type:ti"
  ],
  "dc:creator": "Kathy Pretz",
  "media:content": ""
}