{
  "title": "S16 Ep78: Time-Slips: Journeys into the Past and the Future w/Rodney Davies",
  "link": "https://audioboom.com/posts/8098333",
  "itunes:episode": 78,
  "itunes:title": "Time-Slips: Journeys into the Past and the Future w/Rodney Davies",
  "itunes:season": 16,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4357,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>Darkness Radio presents Time-Slips: Journeys into the Past and the Future with Rodney Davies</p>\n\n<p>Dave & Tim tumble through time with their guest Rodney Davies. The idea of time travel, of venturing into the past and the future, is both fascinating and intriguing, and it has captured the imagination of many. But is it possible and has it ever been achieved? The answer to both questions is yes, and the effect of time travel upon human development has been profound. In this remarkable book Rodney Davies discusses the phenomenon of time and its enigmatic nature, and relates the amazing experiences of those who have found themselves, often unaccountably, in either yesterday or tomorrow. Of these, some have returned to relate their adventures, while others have left notice of their strange exploits in the form of objects fossilized in solid rock, or as footprints impressed thereon. The author suggests that many of the ancient deities were in fact time travelers, who, having discovered the technique of time-slipping, went back to take practical skills and moral guidance to earlier peoples, but who found that their self-seeking benevolence created unanticipated problems for themselves.</p>\n\n<p>Get the book here: <a href=\"https://www.google.com/url?q=http://www.amazon.com/shop/darknessradiodave&sa=D&source=calendar&usd=2&usg=AOvVaw0QMqUZHiOk1L6uzRnaM5cP\">www.amazon.com/shop/darknessradiodave</a></p>\n",
  "pubDate": "Thu, 15 Jul 2021 08:00:00 +0000",
  "guid": "e6f9b3bf-bb85-4cea-8dfa-ad65007bc8b8",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}