{
  "id": "https://bibleinoneyear.org/en/youth/310",
  "title": "Day 310: It’s Who You Know",
  "description": "Psalm 119:170-176, Ezekiel 11:1-20, Hebrews 7:18–27.  You come to him *through* *Jesus*, the man who is God, our Lord, brother and friend  Your prayers are inspired by *the Holy Spirit of God,* who lives within your heart",
  "pubDate": "Sat, 06 Nov 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/310/?ignore",
  "itunes:duration": "14:12",
  "guid": "enyouth06112021-310",
  "length": 852.35,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 310: It’s Who You Know",
  "itunes:subtitle": "Psalm 119:170-176, Ezekiel 11:1-20, Hebrews 7:18–27.  You come to him *through* *Jesus*, the man who is God, our Lord, brother and friend  Your prayers are inspired by *the Holy Spirit of God,* who lives within your heart",
  "itunes:summary": "During the American Civil War, as a result of a family tragedy, a soldier was granted permission to seek a hearing from the President. He wanted to request exemption from military service. However, when he arrived at the White House, he was refused entry and sent away. He went and sat in a nearby park.\nA young boy came across him and remarked how unhappy he looked. The soldier found himself telling the young boy everything. Eventually the boy said, ‘Come with me.’ He led the dejected soldier back to the White House. They went around the back, none of the guards stopped them. Even the generals and high-ranking government officials stood to attention and let them pass through.\nThe soldier was amazed. Finally, they came to the presidential office. Without knocking, the young boy opened the door and walked straight in. Abraham Lincoln, standing there, turned from his conversation with the Secretary of State and said, ‘What can I do for you, Tad?’\nTad said, ‘Dad, this soldier needs to talk to you.’\nIn this possibly fictional story, the soldier had access to the President ‘through the son’. According to the New Testament, in an even more amazing way, in truth, you, certainly, have access to God ‘through the son’ – Jesus.\nMany people pray, but not all prayer is Christian. Christian prayer is distinctive – it is Trinitarian. St Paul writes, ‘Through him [Jesus] we have access to the Father by one Spirit’ (Ephesians 2:18).\nThis is why prayer is such an immense privilege. You are able to speak to God, the creator of the universe, as your Father. You come to him through Jesus, the man who is God, our Lord, brother and friend. Your prayers are inspired by the Holy Spirit of God, who lives within your heart.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 310
}