{
  "title": "Experimental Economics and the Importance of Instructions",
  "pubDate": "Mon, 01 Oct 2018 03:17:58 +0000",
  "guid": "0eb9279747bf41dfad2f7740f735d542",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP107_EDR.mp3",
  "itunes:image": "",
  "description": "<p>Today I discuss one of my own papers: <a href= \"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3010380\">\"Instructions\"</a> by Freeman, Kimbrough, Petersen, and Tong. This research project on experimental instructions has been ongoing for years, but it was recently conditionally accepted for publication. I tell the story of how the research came together and detail some of the results.</p> <blockquote>A survey of instruction delivery and reinforcement methods in recent laboratory experiments reveals a wide and inconsistently-reported variety of practices and limited research evaluating their effectiveness. Thus we experimentally compare how methods of delivering and reinforcing experiment instructions impact subjects' understanding and retention. We report a one-shot individual decision task in which mistakes can be unambiguously identified in behavior and find that mistakes are prevalent in our base-line treatment which uses plain, but relatively standard experimental instructions. We find combinations of reinforcement methods that can eliminate half of subjects' mistakes, and we find that we can induce a similar reduction in mistakes via enhancements to the content of instructions. Residual mistakes suggests this may be an important source of noise in experimental studies.</blockquote> <hr /> <p> </p>",
  "content:encoded": "<p>Today I discuss one of my own papers: <a href= \"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3010380\">\"Instructions\"</a> by Freeman, Kimbrough, Petersen, and Tong. This research project on experimental instructions has been ongoing for years, but it was recently conditionally accepted for publication. I tell the story of how the research came together and detail some of the results.</p> A survey of instruction delivery and reinforcement methods in recent laboratory experiments reveals a wide and inconsistently-reported variety of practices and limited research evaluating their effectiveness. Thus we experimentally compare how methods of delivering and reinforcing experiment instructions impact subjects' understanding and retention. We report a one-shot individual decision task in which mistakes can be unambiguously identified in behavior and find that mistakes are prevalent in our base-line treatment which uses plain, but relatively standard experimental instructions. We find combinations of reinforcement methods that can eliminate half of subjects' mistakes, and we find that we can induce a similar reduction in mistakes via enhancements to the content of instructions. Residual mistakes suggests this may be an important source of noise in experimental studies.  <p> </p>",
  "enclosure": "",
  "itunes:duration": "34:36",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today I discuss one of my own papers:  by Freeman, Kimbrough, Petersen, and Tong. This research project on experimental instructions has been ongoing for years, but it was recently conditionally accepted for publication. I tell the story of how the...",
  "itunes:episode": 107,
  "itunes:episodeType": "full"
}