{
  "title": "S15 Ep111: A Demon-Haunted Land: Witches, Wonder Doctors, & the Ghosts of the Past in Post WWII Germany",
  "link": "https://audioboom.com/posts/8098413",
  "itunes:episode": 111,
  "itunes:title": "A Demon-Haunted Land: Witches, Wonder Doctors, & the Ghosts of the Past in Post WWII Germany",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4292,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>Darkness Radio enters A Demon-Haunted Land: Witches, Wonder Doctors, and the Ghosts of the Past in Post WWII Germany with guest Monica Black</p>\n\n<p>Today the boys take a look at a revelatory counter-history of postwar Germany, not as a reborn democracy but as a nation convulsed by apocalyptic visions, witchcraft trials, and supernatural obsessions.</p>\n\n<p>In the aftermath of World War II, a succession of mass supernatural events swept through a war-torn Germany. As millions were afflicted by a host of seemingly incurable maladies (including blindness and paralysis), waves of apocalyptic rumors crashed over the land. A messianic faith healer rose to extraordinary fame, prayer groups performed exorcisms, and enormous crowds traveled to witness apparitions of the Virgin Mary. Most strikingly, scores of people accused their neighbors of witchcraft and found themselves in turn hauled into court on charges of defamation, assault, and even murder. What linked these events, in the wake of an annihilationist war and the Holocaust, was a widespread preoccupation with evil.</p>\n\n<p>Get the book here: <a href=\"https://amzn.to/2JJz3B8\">https://amzn.to/2JJz3B8</a></p>\n\n<p>Get all kinds of cool paranormal swag here: <a href=\"https://www.amazon.com/shop/darknessradiodave\">https://www.amazon.com/shop/darknessradiodave</a></p>\n",
  "pubDate": "Thu, 24 Dec 2020 09:00:00 +0000",
  "guid": "e69d993c-8bd0-414b-8cf2-ac9a007af58d",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}