{
  "title": "Charles Dunoyer and French Classical Liberalism",
  "link": "https://mises.org/node/60504",
  "description": "<p>(Barthelemy) Charles (Pierre Joseph) Dunoyer (1786–1862) was born on May 20, 1786 at Carennac in ancient Turenne (Quercy, Cahorsin), the present-day Lot. His father, Jean-Jacques- Philippe Dunoyer, was seigneur de Segonzac. Destined at an early age for the order of St. Jean de Malte, he began his education in the order's near-by house at Martel. With the confiscation of the order's houses in 1792, his aunt, formerly of the Visitation order, and, then, the former Benedictine prior of Carennac, continued his education at home. His secondary education was completed at Cahors in the <em>école centrale</em>, one of the newly established schools under the Directory in which the ideas of the 18th century philosophes, and especially, the Ideologues, predominated. In 1803, Dunoyer went to Paris to study law at the newly founded Université de Jurisprudence.</p>\n<p>Dunoyer arrived in Paris as a major intellectual and political era was ending and a new one—the Empire—was beginning. Dunoyer's education at the <em>école centrale</em> had introduced him to the major thinkers of the Enlightenment and their followers during the Revolution and Directory. Beginning in 1800 a strong campaign against the Enlightenment was initiated in Paris, but was countered with lessening impact by the major organ of the philosophe tradition, <em>La Décade Philosophique</em>, of which the principal editor had been Jean-Baptiste Say (1767–1832). Say was general editor of the <em>Décade</em> from its founding (An II, April 29, 1794) until his entry into the Tribunat in 1800.<a class=\"see-footnote\" id=\"footnoteref1_i3nb9yw\" title=\"The Décade was suspended in 1807.\" href=\"#footnote1_i3nb9yw\">1</a> The education with which Dunoyer came to Paris was the product of the work of a number of men who contributed to the <em>Décade</em>.</p>\n<p>Pierre Claude Franpis Daunou (1761–1840). who was to be closely associated with Charles Dunoyer during the Restoration, was the major force in the development of the <em>écoles centrales</em> as he had been for the creation of the <em>Institut de France</em>. During 1791–1792 Talleyrand had proposed a secondary education based on languages, literature, history and ethics; and Condorcet had countered with an emphasis on mathematics, sciences, and the political and moral sciences. In 1795, after a proposal by Lakanal for a more scientific program, a less scientific one of Daunou was adopted. Earlier, Daunou, along with Lakanal and Sieyès, desired that education be freed to be supplied by private initiative. Daunou emphasized that liberty was a necessary condition for scientific progress. This concept formed an important part of the educational and economic thought of Destutt de Tracy, who was active in educational policy under the Directory as well as a leading Ideologue. François Guillaume Andrieux, president of the Tribunat and contributor to the <em>Décade Traité d'économie politique</em> (1803), for which he was not renewed in the Tribunat.<a class=\"see-footnote\" id=\"footnoteref2_drbm41g\" title=\"Joanna Kitchin, La Décade (1794–1807), Un Journal \"Philosophique\", (Paris: Lettres Modernes, 1965), pp. 3–10, 179–184, 200. The success of the école centrale of the departrnent of Lot, from the Ideologue point of view, was noted in an article on education in La Décade (October 22, 1801, p. 161) by one of its co-editors, Pierre-Louis Ginguené. Charles Hunter Van Duza, Contribution of the Ideologues to French Revolutionary Thought (Baltimore: The Johns Hopkins Press, 1935, ), pp. 141–142.\" href=\"#footnote2_drbm41g\">2</a></p>\n<p>The <em>Décade</em> was particularly significant in the history of economic thought. It contributed strongly to the development of Say's thinking, and Say was the most important economist in France during the Restoration. What would become even more accentuated in Say's <em>Traité</em>, the <em>Décade</em> was a major means of introducing the economic ideas of Adam Smith in a France where the concepts of the Physiocrats had been dominant. While Condorcet represented the beginning of a transition from the exclusive agrarianism of the Physiocrats, his initiatives toward industrialism remained limited. But, the impact of the industrial revolution in France (it had reached the point of inaugurating the standardization of manufactured elements by 1785) upon Condorcet, had more far-reaching repercussions on the thinking of Say and Destutt de Tracy. However, the frame of reference of the Physiocrats remained significant. For them, natural society existed before the state. Natural society was absolute, necessary and permanent; the state was relative, accidental and provisional. The Physiocrats' anarchism looked forward to the disappearance of the State. Condorcet strongly articulated this individualism, and his thought was accorded more attention than anyone else's in the <em>Décade</em>.<a class=\"see-footnote\" id=\"footnoteref3_a0wbil2\" title=\"Kitchin, La Décade, pp. 110–136, 198; Georges Gurvitch, Industrialisation et Technocratie (Paris: Librarie Armand Colin, 1949), p. 10; Gurvitch, L'Idée du Droit Social Notion et Système du Droit Social, Histoire de dectrine dupuis le XVII sieclé jusqu à la fin du XIX, sieclé. (Paris: Librairie du Recueil, Sirey, 1931), pp. 236–260, 272.\" href=\"#footnote3_a0wbil2\">3</a></p>\n<p>For Say, industrialism and anarchism found their model in the United States, just as Chinese agrarian despotism was the model for most Physiocrats. The Physiocrats' preference for a \"refined\", communal, agricultural, old, tired, bureaucratic society had been opposed by Jean-Jacques Rousseau's \"common\", individualist, non-agricultural craftsman, young, fresh, non-bureaucratic society. \"In passing simply from the refinement of an old society tightly formed around agriculture to the industrial activity of a new society, we again go forward from the Physiocrats to Rousseau. It is always the romanticism of the noble savage under a different form\". Say held that only man in a state of advanced personal well-being could achieve the natural perfection of which Rousseau spoke. Only where the society is natural can natural and social perfection be achieved; economic society for Say is natural, but political society is not natural and thus inhibits man's perfection. \"J.-B. Say is in agreement with Rousseau in proclaiming that political society is assuredly not natural\".<a class=\"see-footnote\" id=\"footnoteref4_1kcglhh\" title=\"Ernest Teilhac, L'Oeuvre économique de Jean Baptist Say (Paris: Librairie Felix Alcan, 1927), pp. 176, 164. Lester G. Crocker, Nature and Culture, Ethical Thought in the French Enlightenment (Baltimore: The Johns Hopkins Press, 1963), pp. 47, 444–448, 482–495, and 219–325 (\"The Utilitarian Synthesis\"); Crocker, Rousseau's Social Contract: An Interpretative Essay (Cleveland: Press of Case Western Reserve University, 1968), passim; Guy H. Dodge, \"Introduction\", Jean-Jacques Rousseau: Authoritarian or Libertarian? (Lexington, Mass.: D.C. Heath, 1971), pp. vii–xvii; Th. Ferneuil, \"Socialisme et Individualism\", Revue d'économie politique (1889), III, 51; R. Fargher, \"The Retreat from Voltarism, 1880–1815\", The French Mind, Studies in honour of Gustave Rudier (Oxford: Clarendon Press, 1952), pp. 220–237; Mario Einaudi, The Physiocratic Doctrine of Judicial Control (Cambridge: Harvard University Press, 1938), passim.\" href=\"#footnote4_1kcglhh\">4</a></p>\n<p>Dunoyer's interest in the United States in his own writings and in articles (especially about Franklin) in his periodicals, reflected a similar interest on the part of the Ideologues and especially Say in the <em>Décade</em>. Say was critical of the Federalists and of the speculators in government business and securities who might introduce materialism and large fortunes destructive of capitalism in America. For Say, as for many French radicals, Rousseau was associated with Franklin (and Jefferson). The second part of Franklin's <em>Autobiography</em> was first printed by the <em>Décade</em> in 1798 under Say's editorship; he also printed various letters and essays of Franklin. Robert Fulton represented an ideal American in Paris with his book on improvement of canal navigation, which Say reviewed, and his successful steamship sailing on the Seine. Say, in 1803, sent Jefferson a copy of his <em>Traité</em> accompanied by a letter:</p>\n<p class=\"indent2\">It is likewise your task to demonstrate to the friends of liberty throughout Europe how great an extent of personal liberty is compatible with the maintenance of the social body. It will then no longer be possible to defile by excesses the noblest of causes; and it will perhaps finally be perceived that civil liberty is the true goal of social organization, and that we must consider political liberty only as a means of attaining this end. The United States are the children of Europe; but the children are greater than the parents. We are old parents raised in foolish prejudices, chained by a mass of ancient fetters, and bound by a quantity of puerile considerations. You will show us the true ways to free ourselves from them. For you have done more than win your liberty; you have established it.<a class=\"see-footnote\" id=\"footnoteref5_9k51853\" title=\"Durnad Echeverria, Mirage in the West, A history of the French Image of American Society to 1815 (Princeton, New Jersey: Princeton University Press, 1957), pp. 275, 215, 222–224, 232; Kitcin, La Décade, pp. 194–195.\" href=\"#footnote5_9k51853\">5</a></p>\n<p>For Say, America was the model of the young, fresh, active, unrefined society whose industrialism and anarchism would contribute to human perfection. He said in the <em>Traité</em>:</p>\n<p class=\"indent2\">Here we indicate the point of contact between political economy and pure politics. Everyone is convinced that the sacrifices that the state of society imposes on us are especially the least where the government is best . . . In which country is one best governed, that is to say least governed at the cheapest cost than in the United States?<a class=\"see-footnote\" id=\"footnoteref6_691xr8f\" title=\"Teilhac, Say, p. 176; Say, Traité d'economie politique (Paris, 1803), I, 393.\" href=\"#footnote6_691xr8f\">6</a></p>\n<p>Say's optimism and naturalism was fundamental to the economic thought which he introduced. These premises were basic to many of the Physiocrats as well as to Rousseau. The Physiocrats placed the age of gold in the future, in contrast to Rousseau; they posited an individual naturalism <em>a posteriori</em> to Rousseau's individual naturalism <em>apriori</em>. The influence of Rousseau's individualism along with that of Adam Smith caused Say to negate the political means which many Physiocrats had favored. The individualism of Say's thought led his economic naturalism to obviate the political system. With reference to Rousseau,</p>\n<p class=\"indent2\">The economic utilitarianism is extended to the individual. Individual naturalism is extended to the economy. It is from this conjunction that the new naturalism is born. And here is how, while for Rousseau social utilitarianism was the means of individual naturalism, Say, after having strictly separated in his heart political society and economy, posited simply that political utilitarianism is the superfluous and temporary means of a naturalism not only individual but economic, of that natural coincidence of individual utilitarianism and economic utilitarianism.</p>\n<p class=\"indent2\">If one goes to the foundation of things one would conclude finally that Say continues Rousseau much more than he contradicts him.<a class=\"see-footnote\" id=\"footnoteref7_0zwjw3z\" title=\"Teilhac, Say, pp. 176–177, 193, 68, 79.\" href=\"#footnote7_0zwjw3z\">7</a></p>\n<p>Adam Smith differed from the Physiocrats in putting aside their acceptance of a political system which they hoped to rationalize. His contribution was rooted in a utilitarian naturalism in which economic and social relations flourished in the absence of political action, however rational the intention. Say derived his basic concepts directly and indirectly from Smith. It was upon Smith's optimism and naturalism that much of the controversial literature was based among the English radicals following the French Revolution. Just as Say and the French school of economists were favorable to the French Revolution and the Industrial Revolution in line with Smith's followers, Malthus and the English school opposed them or saw them as evils however necessary.</p>\n<p>To a major degree, the English radicals moved from the Rousseauan Declaration of Rights, which they recognized as an insufficient guarantee of natural rights, to the necessity of abolition of the political system.</p>\n<p class=\"indent2\">Amongst these democrats, who were opposed to Burke, Mackintosh, Paine, Godwin submitted so strongly to the influence of Smith that they ended by showing themselves the insufficiency of the Declaration of Rights. Nothing catches this more than to see Mackintosh subordinate natural rights to utility, Paine simply juxtaposed the two doctrines, and Godwin, finally, sensing the necessity of choosing, perfected the ideas of Paine in disassociating government and society, in showing that, far from relaxing the social bond, the abolition of government binds it tighter. . . Godwin in accord with the tradition of utilitarian naturalism of Smith, had sacrificed politics to economics. It was economics that the artificial utilitarianism of Bentham sacrificed to politics.</p>\n<p class=\"indent2\">Is that to say that it is Godwin who founded political economy? No! For it is perhaps more against him than against Bentham that Malthus and Ricardo established theirs . . . Godwin developed optimistic utilitarian naturalism, Malthus pessimistic utilitarian naturalism. It is in this way that one is able to say to the <em>Essays on the Principle of Population</em> that it is a rejoinder against the <em>Wealth of Nations</em> . . . According to Malthus, evil will not be able to be destroyed either by political action, contrary to what Bentham thought, nor by the abolition of government, contrary to what Godwin thought. If government can achieve nothing against economic reality, it becomes an integral part of that reality.</p>\n<p class=\"indent2\">. . ., is it not Adam Smith's optimistic utilitarianism that J.B. Say begins anew? In such a manner that definitely will his political economy be founded actually less against Godwin than against Bentham, and less against the utilitarian rationalism of Bentham than against the pessimistic utilitarian naturalism of Malthus and Ricard?<a class=\"see-footnote\" id=\"footnoteref8_6rjm607\" title=\"Ibid., 231–233.\" href=\"#footnote8_6rjm607\">8</a></p>\n<p>The pessimistic utilitarianism of Malthus and Ricardo in opposition to Godwin and his Smithian optimism was rooted in the crises of overproduction occurring during the period of the wars of the French Revolution and Napoleon. The crises of overproduction confronted economists with a profound challenge to the conception of economic science. Say demonstrated against Malthus the economic impossibility of overproduction. In his analysis of the extra-economic, the anti-economic or political, causes of overproduction, against Malthus' incorporation of government into economic reality, Say affirmed his renowned Law of Markets.</p>\n<p>The division between optimism and pessimism had important roots in the respective attitudes toward industrialization. Just as Malthus' work was a response to Smith through Godwin. Say's <em>industrialisme</em> was a reaffirmation of Smith and Godwin. Smith's positive economic attitude toward industry distinguished him from the Physiocrats. \"If from the <em>Wealth of Nations</em>, the <em>Traité</em> of Say derived in one part only his germs of industrialism, he derived in another part only the single optimistic branch of his utilitarian naturalism; and he made this double part coincide. If he industrialized nature, he naturalized industry\".<a class=\"see-footnote\" id=\"footnoteref9_8z0u58a\" title=\"Ibid., 228.\" href=\"#footnote9_8z0u58a\">9</a> The application of industrialization in absolute freedom would result in general well-being. The <em>Décade</em> perceived an indefinitely increasing prosperity due to economic freedom or capitalism, and to the use of machinery applying new technology and scientific discoveries. For Say, the facility of amassing capital was one of the causes of indefinite human perfectibility.</p>\n<p class=\"indent2\">For the <em>Décade</em>, one of the great advantages of the system of laissez-faire is that it prevents excessive enrichment due to monopolies and tariffs of a small number of privileged families, and that it diffuses very widely the profits of industry . . . But these measures of general utility (the liberalism of Smith and Say, for example) would they have a noticeable effect on the poor? The <em>Décade</em> believed it would, at least in what concerned economic freedom. The liberation of work by the abolition of feudal rights and of corporations seemed to it already an immense social progress. Its hopes for future progress of the people was founded on the anticipated effects of the system of laissez-faire joined to the mechanization of industry: national prosperity without precedent, work for all, lower prices due to competition, and to standardized manufacturing production. It is an industrial revolution similar to the manufacturing movement in England that Jean-Baptiste Say emphasized.<a class=\"see-footnote\" id=\"footnoteref10_0umww52\" title=\"Kitchin, La Décade, pp. 197–198, 146.\" href=\"#footnote10_0umww52\">10</a></p>\n<p>Say credited his friend the abbe Henri Grégoire, the founder of the Conservatoire des Arts et Métiers, with recognizing the human progress which machinery was providing. The <em>Décade </em>called for concentration on production of articles of wide use, and \"occupied itself constantly in inventions and new technology\".</p>\n<p class=\"indent1\"><em>La Décade</em> insisted on the importance of machinery and kept its readers current with the most recent developments in this field. It presented regular accounts of the sessions of the Lycée des Arts (the society founded in 1792 for the propagation of useful discoveries) and occupied itself with the industrial expositions which took place in Paris every year from 1797 of the Society for the Encouragement of National Industry (founded in 1801) and of the Conservatoire des Arts et Métiers (decreed in 1794).<a class=\"see-footnote\" id=\"footnoteref11_f2yheqw\" title=\"Ibid., pp. 197–145–146.\" href=\"#footnote11_f2yheqw\">11</a></p>\n<p>Industrialization had an important practical effect on capital, leading to one of Say's major contributions to economics. The revolution had reduced the importance of the privileged \"capital\" of the old regime, and had freed men to acquire capital outside the role of the state and thus to improve the general interest. The industrial revolution represented the great increase of this capital and the reduction of privileged \"capital\". Income on capital represented a reward to the capitalist for saving and for foregoing the use of savings rather than merely an insurance for risk. The rise in the price of capital in industrial society no longer reflected the scarcity of capital, but the increase in productive use of capital. This contrasts with the conception of Malthus and Ricardo and placed Say in radical opposition to the pessimistic English school.<a class=\"see-footnote\" id=\"footnoteref12_s61rbmg\" title=\"Teilhac, Say, pp. 112–120.\" href=\"#footnote12_s61rbmg\">12</a></p>\n<p class=\"indent2\">The development of the industrial revolution had held the attention of Say less on the already old phenomenon of the division of labor than on the entirely new phenomenon of mechanization which had caused the <em>industrialisme</em> of Say, passing beyond Smith, to return to naturalism.\"<a class=\"see-footnote\" id=\"footnoteref13_9gxp4ps\" title=\"Ibid., pp. 102, 137.\" href=\"#footnote13_9gxp4ps\">13</a></p>\n<p class=\"indent2\">From its birth, this harmonious conception wits destined to be broken; and, if the progress which the economics of J.-B. Say realized was more distinct in relation to his contemporaries than in relation to his predecessors, it was perhaps still more distinct in relation to his immediate successors . . . the industrialist idea passed in turn to the <em>Censeur</em> and to its editors: Charles Comte, Dunoyer and Augustin Thierry, in order to reach in the end to Saint-Simon and to Karl Marx ...</p>\n<p>\"Political Economy\", said the <em>Censeur Européen</em> at the end of a review of Say's <em>Traité</em>, \"in making seen how peoples prosper and decline, has posed the true foundations of political thought\". Even as there was no longer economic science strictly speaking, there ought no longer to be a pure political science. There is political economy.</p>\n<p class=\"indent2\">. . . And the progressive effacement that they marked of the warrior spirit before the industrial spirit was a veritable theory of historical materialism. As remarkable as their internal political conception was their international relations. The system of European equilibrium was only \"an old used machine\", a perpetual menace of war. The <em>Censeur</em> opposed to it the theory of markets and the real international entente that it engenders. There are no more than two great nations: the European nation of the producers, the industrials; as to the other, it is the old Europe battling against the new. But, if the relationship of the economic liberalism of J.-B. Say and the political liberalism of the <em>Censeur</em> is tight, it does not cover one difference. The sole criticism that Dunoyer addressed to his master is of not having seen that his doctrine was in itself a system of political thought and of having reduced the system of political thought to mere constitutional forms.<a class=\"see-footnote\" id=\"footnoteref14_5di8qut\" title=\"Ibid., pp. 241, 243–244,\" href=\"#footnote14_5di8qut\">14</a></p>\n<p>However, the flowering of Say's impact on Dunoyer was to occur only after a postponement of a dozen years. For when Dunoyer came to Paris in 1803 under the impact of the philosophical and literary views for which the <em>Décade </em> was the spokesman, the intellectual affinity was broken due to Say's leaving Paris in that year. The very publication of the <em>Traité</em> was the cause of Say's removal from Paris as a result of his elimination from the Tribunat. Refusing an offer from Napoleon of a position in the financial department, Say undertook to apply the recent developments in machinery to industrial production. He established a cotton spinnery which eventually employed almost 400 persons at Aulchy in Pas-de-Calais. When he sold his business a decade later and returned to the intellectual life of Paris as the Empire was coming to its conclusion, Say brought with him a complete knowledge of the role and the effects of industrialization on modern society.</p>\n<p class=\"indent2\">J.-B. Say was intimately involved in the emergence of large scale industry. He was, in effect, one of the most remarkable types of these manufacturers of the Consulate and of the Empire, of these first great\" entrepreneurs who sought to place in operation the new technological processes.<a class=\"see-footnote\" id=\"footnoteref15_2cp22ol\" title=\"Ibid., pp. 24–26; Charles Comte, \"Notice historique sur la vie et les ouvrages de J.-B. Say\", Mélanges...de J.-B. Say (Paris: Chamerot, 1833), p. xi.\" href=\"#footnote15_2cp22ol\">15</a></p>\n<p>Equally important, during that decade Say was able to clarify the social thought which he had expressed in the <em>Traité</em> and to publish in 1814 the second edition which was to have a central importance on the development of the thought of Charles Dunoyer and Charles Comte and through them on many others. When Say had launched his <em>industrialisme</em> in 1803, he faced the strong opposition of the writers who were tied to the economic patterns and thought of the 18th century. By 1814 the industrial revolution on the continent, alongside that of England, clearly indicated that new ways of thinking about reality were necessary. The material conditions as well as the intellectual conditions were ready for <em>industrialisme</em> after 1814.</p>\n<p class=\"indent2\">But since 1789 industry had tripled the <em>Censeur</em> <em>Européen</em> and Saint-Simon triumphed. If Stendhal remained curiously hostile to industrialism, Benjamin Constant in 1818, and especially in 1829, allowed himself to approach it probably under the influence of the success of J.-B.Say.<a class=\"see-footnote\" id=\"footnoteref16_j8rrl24\" title=\"Teilhac, Say, p. 220.\" href=\"#footnote16_j8rrl24\">16</a></p>\n<p>Dunoyer's lively interest in philosophy and literature remained guarded after his arrival in Paris in 1803, under the chilling impact of the emerging imperial regime. Dunoyer pursued his law studies and translated the Novelles of the Emperor Leo III. In 1807 he met (François) Charles (Louis) Comte (1782–1837) who came from Sainte-Enimie, Lozére. Comte had arrived in Paris alone without entrée or fortune, but with a rude aspect and energetic character. Later, he would occupy a special place among the friends of Odilon Barrot (1791–1873), who was a compatriot from Villefort, Lozére, and who said of Comte: \"His conversations and his examples fortified and purified in me the sentiment of liberalism of which my education and my origins had given me the germ.\"<a class=\"see-footnote\" id=\"footnoteref17_xkx8atw\" title=\"Charles Almeras, Odilon Barrot (Paris: Éditions Xavier Mappus, 1950), pp. 22–24.\" href=\"#footnote17_xkx8atw\">17</a> Charles Comte was working on a study of the jurisprudence of Sirey when he and Dunoyer became friends. At his parents' insistence, the reluctant Dunoyer left his scholarly pursuits in Paris and entered government service under the Empire. He became the secretary of a family friend, Baron Bertrand Bessières (1773–1855) of Prayssac (Lot), who was sent as intendant to northern Spain (1810–1811). Bessières, who had been a Napoleonic general de cavalerie and later defended Marechal Ney, was the younger brother of Marechal Jean Baptiste Bessières, duc d'Istria, who was the commander of French armies in northern Spain. Dunoyer's experience in Spain and his respect for the Spanish Liberals opposed by the traditionalists and the Anglophile constitutionalists, was to manifest itself in his discussion of Spanish events in his articles during the Restoration. Following his service in Spain, Dunoyer acted as the secretary to another family friend who was an official in the administration of Holland. There the police methods of the imperial government caused him to become completely opposed to the Empire and to return to Paris.</p>\n<p>Dunoyer welcomed the actions of the Senate deposing Napoleon, appointing a provisional government and preparing a constitution, especially with the leadership of such liberal senators as Garat, Grégoire, Lanjuinais, Destutt de Tracy and Lambrechts. A new constitution was issued by the Senate on April 6, 1814, and the Comte de Provence was called to the throne of a constitutional monarchy. Dunoyer was one of the gentlemen of the National Guard cavalry formed as a guard of honor for the Comte d'Artois on his entry into Paris in April. But, Dunoyer withdrew from the guard of honor when the Senate's constitution was set aside by the new king, Louis XVIII, in his declaration of Saint-Ouen on May 2–3. Dunoyer published a pamphlet regarding the constitution: <em>Réponse à quelques pamphlets contre la constitution</em>. Dunoyer was critical of the <em>Charte</em> issued by the royal government on June 4, in response to the pressure of the Coalition Allies occupying Paris, following the treaty of Paris (May 30, 1814) which ended the war.</p>\n<p>Dunoyer was then invited by Charles Comte to join him in the publication of a weekly journal, <em>Le Censeur</em>. The first volume (June 12– September 30, 1814) was published as a weekly until a strong censorship law was established. The <em>Censeur</em> declared in an advertisement:</p>\n<p class=\"indent2\">Strangers to all the governments which have succeeded each other in France during the mace of twenty years. We have, in writing, only the interest which ought to animate all Frenchmen, that of seeing our fellow citizens obey the law, respect public morals and resist oppression. What men of such and such a Party, or such and such a sect, should not look for, then, in this work, is what will feed their passions, for they will find here nothing which will be able to please them.<a class=\"see-footnote\" id=\"footnoteref18_l2m1bup\" title=\"Le Censeur, volume I; the advertisement is bound at the beginning of the first volume.\" href=\"#footnote18_l2m1bup\">18</a></p>\n<p>Despite their disappointments regarding the <em>Charte</em>, Dunoyer and Comte believed it capable of forming the basis for increased freedom and thus ending the successive revolutions which the French had experienced, but which had not in turn increased freedom. Dunoyer and Comte hoped that the royalists would be satisfied to find the Bourbons on the throne, and accept limited monarchy and cabinet government. They believed that constitutionalists would see the <em>Charte</em> as a major accomplishment in which most of their principles were clearly established. While the Bonapartists, as the most recent government, were least easily reconciled, they were seekers of office and power, and could become important if the government were to fail. Republicans were advised that the forms were less important than the content and that, with the <em>Charte</em>, France like England was a true republic in all but name. England was a contradiction to Dunoyer and Comte. In the midst of liberal and radical French opinion for which England represented an ideal, the <em>Censeur</em> became increasingly skeptical and finally abandoned its mild anglophilia for anglophobia. Since this evolution accompanied their increasing discouragement with the failures of the Restoration government and its violations of the <em>Charte</em>, it is possible that opened eyes saw wider than France and gained a depth of insight regarding England as well. With regard to <em>Le Mythe Anglais</em>, \"the influence of the <em>Censeur</em> was not negligible\"; \"it was the most important of the secondary reviews\".<a class=\"see-footnote\" id=\"footnoteref19_jj224c1\" title=\"Pierre Roboul, Le Mythe Anglais dans la littérature française sous la Restauration (Lille: Bibliothèque Universitaire, 1962), p. 377.\" href=\"#footnote19_jj224c1\">19</a></p>\n<p>Dunoyer felt that France had only a pale reflection of the English constitution because English society had strong foundations for liberty. Like other French radicals, he saw the defeat of Napoleon as a vindication of their ideas. The <em>Censeur</em> (September, 1914) wrote: \"the English have presented themselves mainly as liberators\". Yet, Dunoyer's memories of the role of the English and their allies in Spain, a theme of his writings over these years, as well as England's war against the United States, raised doubts as to England's disinterested diplomacy. Despite its belief that England's intention was hegemony, the <em>Censeur</em> could prefer an alliance with England over one with Russia. The <em>Censeur</em>'s Anglophobia was much deeper and analytic than the conceptions of \"Perfidious Albion\" of an Etienne de Jouy or of the \"Noble England\" of a Mme. de Stael. The depth of Dunoyer's analyses of England is evidenced in the impact that the <em>Censeur</em> had on Benjamin Constant's thinking. In this as in other areas the <em>Censeur</em> was part of the dialogue of attraction and criticism which they carried on to the end of Constant's life. Constant's conception of a free England was modified increasingly to a criticism of England. \"Without doubt, in his portrayal of the economic and social evolution of England, Constant was inspired by the brochures and articles of J.-B. Say as by the <em>Censeur</em>, taking account of the sentiments of his public and of the disquiet which had provoked the social and political troubles of Great Britain\".<a class=\"see-footnote\" id=\"footnoteref20_7bfarpb\" title=\"Ibid., pp. 101, 14–20, 60–65, 77–102.\" href=\"#footnote20_7bfarpb\">20</a> This development of ideas regarding England occurred throughout the Left in France with the <em>Censeur</em> in the forefront.</p>\n<p class=\"indent2\"><em>On the Left</em>, one discovers with a certain astonishment that the banner of liberty covers henceforth an aristocratic merchandise. They begin to envisage that England may cease being the forerunner of civilization. Have not its ministers made themselves the recognized protectors of continental <em>reaction</em>? Moreover, one would wish to be a <em>patriote</em>! Many former officers of the <em>Grande Armée</em> still resented the humiliation of the defeat; many former prisoners or former soldiers recalled the essential themes of revolutionary and imperial propaganda. The <em>Left </em>had hardly more unity than the <em>Right</em>: less still perhaps. Some hated, some admired, others exploited, some desired to imitate. C.A. Scheffer and, in a lesser measure, the staff of the <em>Censeur </em>began to critize the very idea of country.<a class=\"see-footnote\" id=\"footnoteref21_x2o9pjd\" title=\"Ibid., p. 115.\" href=\"#footnote21_x2o9pjd\">21</a></p>\n<p>This development did not include all those associated with the <em>Censeur</em>. Henri de Saint- Simon and his secretary Augustin Thierry expressed a deep Anglophilism in the <em>Censeur</em>, especially on the English parliamentary system. (Saint-Simon's \"De Réorganisation de la Société Européene\", <em>Le Censeur</em>, III): \"In his articles in the <em>Censeur</em>, he gave the same England as an example to the French: she had known how to resolve the problem of relations between the ministers and the opposition\".<a class=\"see-footnote\" id=\"footnoteref22_kgyxlot\" title=\"Ibid., 320–321.\" href=\"#footnote22_kgyxlot\">22</a> Furthermore, the shift to an anti-English position resulted from the increasingly central importance for Comte and Dunoyer of economic thought. \"For the readers of the <em>Censeur</em> . . . political economy eclipsed philosophy. In a certain measure, it replaced it.\"<a class=\"see-footnote\" id=\"footnoteref23_3wd37ia\" title=\"Ibid., p. 320.\" href=\"#footnote23_3wd37ia\">23</a> It was ironic that at first this economic thought was English; Charles Comte had an acquaintance with Jeremy Bentham's writings. Dunoyer and Comte were interested in the less traditional writing which was being published in England and found that writing to be congenial to the cosmopolitan attitudes they inherited from the philosophes, the Ideologues and the <em>Décade</em>.<a class=\"see-footnote\" id=\"footnoteref24_qr3fm8f\" title=\"Ibid., p. 38; it is likely that Comte became acquainted with Bentham's works through the French translations by the Genevan, Pierre Etienne Dumont, who acted as Bentham's literary secretary. Dumont had made Bentham known to French-speaking readers by the translation and publication of the strictly laissez-faire Manual of Political Economy in the Bibliothèque britannique (Geneva, 1797–1798). Published in French through Dumont's editing were Bentham's Traité de législation civile et penal (1802) and Théorie des peines el des récompenses (1811), published in English only in 1825.\" href=\"#footnote24_qr3fm8f\">24</a></p>\n<p>Thus, the first volume of the <em>Censeur</em> was launched in June, 1814 with certain significant political attitudes and concepts but with sufficient open-endedness to encourage and experience growth. This was in addition to the spirit of independence and criticism for which the <em>Censeur</em> was particularly famous. Eugène Hatin, in his discussion of the press under the Restoration, has noted:</p>\n<p class=\"indent2\">The only truly independent journal of the epoch was <em>Le Censeur</em>. <em>Le Censeur</em> had been created by two of those young men for whom the imperial despotism contradicted all their ideas, revolted all their sentiments, and who despite their patriotism, had seen in the day of March 31 the signal of universal deliverance. Admitted to the intimacy of the most distinguished members of the liberal minority of the Senate and of the philosophic party, the Tracys, the Lanjuinais', the Lenoir-Laroches, the Lambrechts', the Volneys, and the Cahanis', Comte and Dunoyer had imbibed a horror of tyranny, and it was to prevent its return that they had taken their stand . . . the ideas which, in its first numbers, <em>Le Censeur</em> expressed and developed in a firm and grave tone, contrasted singularly with most of the writings currently published. In sum, it was a support rather than a danger to the constitutional government of June 4, if that government would march directly along its path; but it would encounter in the new paper an inflexible censor every time that it deviated.<a class=\"see-footnote\" id=\"footnoteref25_gp7wjxh\" title=\"Eugène Hatin, Histoire politique et littéraire de la presse en France. La presse moderne, 1789–1860. La presses sous la Restauration (Genèva: Slatkine Reprints, 1967, Paris, 1859–1861), VIII, 82–86.\" href=\"#footnote25_gp7wjxh\">25</a></p>\n<p>But, the ministry did deviate rather quickly from the principles which Dunoyer believed were consecrated in the <em>Charte</em>. This was especially true concerning freedom of the press, which to Comte and Dunoyer was the basis of all other freedoms. Respect for freedom of the press had been accepted in the royal declaration of Saint-Ouen on May 2, 1814. The <em>Charte</em> of June 4 provided in article eight: \"The French have the right to publish and to print their opinions, in conformity to the laws which ought to punish abuses of this freedom\". An alternative interpretation of this article was supplied by the ministry almost immediately. The concept of punishment following the commission of an act was accepted by Dunoyer all his life as the basis of law; the concept of prevention by the government was rejected by Dunoyer to the end of his career. The minister of the interior, the abbé de Montesquiou, declared that \"punish\" and \"prevent\" were synonymous, and presented to the chamber of deputies on July 5, 1814 a proposed law interpreting punish as the same as prevent. The proposed law was the work of Royer-Collard, <em>directeur de la librairie</em>, and Guizot, secretary general of the ministry of interior, who were the leading figures in the Restoration party known as the Doctrinaires. That law was ultimately passed by the legislature, and became effective on October 21, 1814. According to Hatin: \"The press did not remain mute. A newly founded journal, which had come to enjoy a major role and to exercise a decisive influence in these years of crisis, <em>Le Censeur</em>, of which we will speak below, burst forth above all with a great force and great hardiness against that law, 'as despotic in its base as it was liberal in its form'. . . It was not only that unique liberal journal of the epoch which attacked the proposed law\".<a class=\"see-footnote\" id=\"footnoteref26_2as1xyz\" title=\"Ibid., pp. 41–46, 49–52, 71–75.\" href=\"#footnote26_2as1xyz\">26</a> Moderate royalist journals such as the <em>Journal de Paris</em> and <em>Journal des Débats</em>, attacked the law, but the brunt of the counter-attack by the ultra-royalists was aimed at the <em>Censeur</em>. The <em>Quotidienne</em> \"described the liberals as Jacobins on half-pay, and compared <em>le Censeur</em> to Marat's paper\", <em>L'Ami du Peuple</em>.</p>\n<p>Politics during the succeeding months of the first Restoration did not give Dunoyer and Comte confidence in the way that the ministry would apply the new law on journalistic writings. The new censorship applied to publications of less than 320 pages; the second through the seventh volumes of the <em>Censeur</em> (November 10, 1814–September 6, 1815) were therefore published in the form of books. As Benjamin Constant touchingly described the situation in his <em>De M. Dunoyer et de Quelques-uns de ses ouvrages</em>:</p>\n<p class=\"indent2\">. . . Nevertheless, the laws on writings, however absurd they are, have this advantage, that in order to study, one will try to elude them. The law on the press submitted to the censorship works of less than twenty printed sheets. Thus books of twenty and a half printed sheets were publishable: and writers who, having only one truth to develop, would express it in four pages, would look for others who together would form a volume.</p>\n<p class=\"indent2\">Such was the origin of the <em>Censeur européen</em>, to which the authors, MM. Comte and Dunoyer, devoted themselves with good faith and with courage, to the study, which one could call experimental, of the solidity of the guarnatees which the new pact promised to the nation. The laws contrary to these guarantees having been proposed by a timid and crafty ministry, and voted by the ignorant and docile Chambers, M. Dunoyer combatted them. Having raised persecutions against himself, this audacious patriot showed himself, in his defense, more occupied with the public interest than with his own.</p>\n<p class=\"indent2\">At his risk and peril, he seized that occasion to expose the vices of our legislation, the insufficiency of the protection that citizens may expect, and the arbitrariness of authority made possible by the administrative and judicial disposition bequested by the empire to the monarchy.</p>\n<p class=\"indent2\">He conquered in that way, for us and our heirs, a part of our liberties. For, although he did not came to obtain for them the institutions which render them inviolable, his example and his writings had popularized the notions which, while not consecrated in theory, became victorious in practice, when the general assent encompassed them. . . . The germs deposited, in 1814, in the <em>Censeur européen</em>, have developed and born fruit.<a class=\"see-footnote\" id=\"footnoteref27_den07mi\" title=\"Benjamin Constant, Mélanges (Paris, 1829).\" href=\"#footnote27_den07mi\">27</a></p>\n<p>Thus, the <em>Censeur</em> was published as a volume of more than 320 pages without any announced date. Publication dates in the future were arbitrarily chosen once each volume was printed, in order to avoid being considered a regular periodical. Volume II was dated November 15, 1814; volume III, December 20, 1814; volume IV, March 1, 1815; volume V, April 18, 1815; volume VI, June 1, 1815; and volume VII, September 6, 1815, but most of the copies were seized by the ministry of police of the second Restoration on September 4, 1815. As a pattern, the <em>Censeur</em>'s second volume was issued at an interval of a month and a half. The more than two months elapsing between the third volume, December 20, 1814 and the fourth volume, March 1, 1815, is explained by Charles Comte's involvement as the lawyer for General René Joseph Excelmans (1775–1852). General Excelmans took a leading role in the defense of France during the Allied invasion of 1814. He was prosecuted by the Restoration government's minister of war, Marshall Soult, in 1814. Comte prepared Excelmans' case in December, 1814, and appeared before the council of war at Lille, on January 23, 1815, where Excelmans was acquitted. The delay between the publication of volume six and volume seven 3 months later occurred during the transition from the Hundred Days to the second Restoration.</p>\n<p>During the Hundred Days, Dunoyer and Comte had refused to leave Paris, for which they were condemned by royalists, and refused to support the new imperial regime, for which they were criticized by Bonapartists. Their strong criticisms of the Hundred Days brought a brief delay in volume five's distribution due to a temporary confiscation. Constant and Carnot intervened in the matter, and Baron Legoux, <em>procureur général</em>, suspended any action to prosecute the <em>Censeur</em>. The role of Fouché in initiating the action was suspected, as Dunoyer and Comte rejected his requests that they work with him in his interest. Hatin has commented:</p>\n<p class=\"indent2\"><em>Le Censeur</em> was heard every hour to reprimand so vigorously the newspapers on their pusillanimity, and without doubt proved to them how far one was able to be bold. It is said that Fauché, wishing to attach to himself the editors of that paper, had offered to them the editorship of the <em>Moniteur</em>; then, on their refusal, had given them the choice of places which would be agreeable to them. But Comte and Dunoyer had rebuffed these offers, and they had remained inflexible in their opposition to the imperial government, an opposition which, it is very necessary to say, was not under the circumstances, very intelligent or very patriotic.<a class=\"see-footnote\" id=\"footnoteref28_dwtwsys\" title=\"Hatin, La Presse, p. 127.\" href=\"#footnote28_dwtwsys\">28</a></p>\n<p>Hatin, among others, has attacked the liberal opposition under the Hundred Days as non-patriots; he objected to the <em>Censeur</em>'s criticism of the imperial regime while French troops moved to the frontier to meet the Allied armies before Waterloo. The <em>Censeur</em> made quips about \"<em>De l'influence de la moustache sur le raisonnement, et de la nécessiée du sabre dans I'administration</em>\". However, the Hundred Days made a deep intellectual impact upon Dunoyer and Comte. The beginning of the major philosophic change leading to the important contributions to political, economic and social thought for which they become renowned can be dated from then. That impact went far beyond the quips about military men in government or the legitimacy of the imperial regime, although Hatin notes the importance of their attitude on that question during the Hundred Days.</p>\n<p class=\"indent2\">April 20, one month after the return from Elbe, <em>Le Censeur</em> said: \"The government is only a provisional government. It is of little importance that Napoleon has been proclaimed emperor by the army and by the inhabitants of the country through which he passed; of little importance that the coalition powers had or had not held to the conventions that they had made with him. France does not belong to the soldiers, nor to the inhabitants found on the route from Cannes to Paris.<a class=\"see-footnote\" id=\"footnoteref29_81agk0l\" title=\"Ibid., p. 127.\" href=\"#footnote29_81agk0l\">29</a></p>\n<p>In the intense atmosphere of repression at the beginning of the second Restoration, Dunoyer and Comte encountered hostility from the ultraroyalists. But the seizure of the seventh volume of the <em>Censeur</em> occurred while Fouché was still minister of police, and appeared to be on his instigation. Dunoyer and Comte did not continue the periodical while the seizure of the seventh volume was in the courts, and they pursued the matter through the courts for over a year. They hoped that the decision of the courts would be in their favor, and when they planned to renew publication following September 5, 1816, which they considered the beginning of a third Restoration, they wished to reissue the seventh volume of the <em>Censeur</em> as the first volume of the <em>Censeur européen</em>, their new periodical. After further delay, they recognized that their appeals would be denied, and launched the <em>Censeur européen</em> without the seventh volume.</p>\n<p>Concerning the suspension of the <em>Censeur</em> after the seizure of the seventh volume in September, 1815, Dunoyer and Comte later declared:</p>\n<p class=\"indent2\">The chamber of deputies of 1815 was convoked and the majority of members showed so much violence that all discussion became impossible. Not able to place itself in a party which, in its resolutions, seemed to take for its guide only furors, and not wishing to support a ministry which showed itself much too weak when it would defend justice, and much too strong when it attacked constitutional principles, men who did not hold to any faction and did not aspire to any favor could only condemn themselves to silence. This was the part which the authors of the <em>Censeur</em> took.<a class=\"see-footnote\" id=\"footnoteref30_r18d61d\" title=\"Ibid., p. 281.\" href=\"#footnote30_r18d61d\">30</a></p>\n<p>However, Dunoyer and Comte put their enforced leisure to good advantage. It was during 1815–1816 that they thought deeply about the ideas and concepts that had been raised for them during the Hundred Days by the actual political events and debates, and by the insights that these events gave to the social and economic thought which they were reading at that time. From that reading, beginning in the spring of 1815, came the new direction of their thinking, <em>industrialisme</em>, which first received expression in the periodical which they launched in the autumn of 1816, the <em>Censeur européen</em>, and which had both an immediate and long-lasting impact on the social thought of the 19th century.</p>\n<p>Contemporary Restoration commentators indicate the high regard in which Dunoyer's and Comte's journalism was held. Restoration writers were ranked according to conscience and talents by Lebrun-Tossa, in his <em>Consciences littéraires d'a présent, avec un tableau de leurs valeurs comparées, indiquent de plus, les degrés de talent et d'esprit par un jury de vrais libéraux:</em><a class=\"see-footnote\" id=\"footnoteref31_7is7ltj\" title=\"Ephraim Harpaz, \"Sur un Ecrit de Jeunesse d'Augustine Thierry\", Revue d'historie littéraire de la France, LIX, No. 3, p. 344. Also see Des Journalistes et des journaux (Paris, 1817), quoted in Hatin, La Presse, pp. 211–213.\" href=\"#footnote31_7is7ltj\">31</a></p>\n<div class=\"media media-element-container media-default\"><div id=\"file-136651\" class=\"file file-image file-image-jpeg\">\n\n        <h2 class=\"element-invisible\"><a href=\"/files/dunoyertablejpg\">dunoyer_table.jpg</a></h2>\n    \n  \n  <div class=\"content\">\n              <img alt=\"Dunoyer table\" title=\"Dunoyer table\" style=\"height: 209px; width: 300px;\" class=\"media-element file-default\" data-delta=\"1\" typeof=\"foaf:Image\" src=\"https://cdn.mises.org/styles/max_full/s3/dunoyer_table.jpg?itok=YjgZhRsw\" width=\"693\" height=\"483\" />      </div>\n\n  \n</div>\n</div>\n<p>The accession of the Decazes ministry had encouraged Dunoyer and Comte to launch the<em> <em>Censeur européen</em> </em>late in 1816 (it was published in twelve volumes until April 17, 1819). But, in June, 1817, the third volume was seized in a complicated case secretly pressed by important government officials and carried through under the charge against Dunoyer and Comte of Bonapartism. Comte fled arrest and went into hiding; Dunoyer was apprehended; and the editorship of the <em><em>Censeur européen</em> </em>was placed in the hands of their principal assistant, Augustin Thierry, who took the occasion to place in the<em> <em>Censeur européen</em> </em>over 300 pages of his<em> <em>Vue des revolutions d'Angleterre</em>. Dunoyer </em>was held for a month in the Force prison, and then transferred to Rennes, where the government's case had been initiated. The liberal notables supported Dunoyer as sureties and organized a society to support the legal costs of this and other press trials. Dunoyer, defended at Rennes by Mérilhou, was convicted; but the case contributed to the development of liberal consciousness in France, and particularly in western France. The<em> <em>Journal général</em> </em>was suspended because it described one of the serenades presented to Dunoyer in front of the prison by the youth of Rennes. Appeals reduced the severity of the sentences but not the conviction.</p>\n<p class=\"indent2\">This process against the<em> <em>Censeur</em> </em>caused for the first time to appear major manifestos of political doctrine signed by the most considerable members of the legal profession. M. Mérilhou, defender of MM. Comte and Dunoyer, produced in support of his plea a consultation of twenty-one lawyers among which one notes MM. Dupin, Persil. Parquin, Hennequin, Mauguin, Berryer fils, and some other names which ought to find celebrity in these press battles. The consultation bore principally on principles. The publisher, M. Dupin, established the famous distinction \"Between the attacks which are directed against the person or constitutional authority of the king, and the criticisms directly only against his<em> <em>ministers</em></em> or the acts of his governments.\"<a class=\"see-footnote\" id=\"footnoteref32_ohdh6y1\" title=\"Ibid., pp. 287–289. Perhaps as a result of his prosecutions, Dunoyer became increasingly active in behind-the-scenes radical political activity such as the election campaign for deputy by Lafayette in the fall of 1818: \"The successful candidate arrived in Paris at the beginning of November, 1818, accompanied by his friends Dunoyer and Victor de Broglie.\" Maurice de la Fuye and Emile Bameau, \"The Phase of Abortive Conspiracies\", The Apostle of Liberty, a Life of La Fayette (London: Thames & Hudson, 1956). pp. 243-245.\" href=\"#footnote32_ohdh6y1\">32</a></p>\n<p>With the increasingly liberal press laws, Dunoyer and Comte decided to publish the <em><em>Censeur européen</em> </em>as a daily newspaper. It was issued in two volumes from June 15, 1819 to June 23, 1820. It was suspended as a separate publication amidst the reaction to the assassination of the duc de Berry in February, 1820; the<em> <em>Censeur européen</em> </em>was merged with the<em> <em>Courrier français</em>. </em>However, Hatin has indicated the origin of the reaction in the moves by Decages against the<em> <em>Socété des amis de Iiberté de la presse</em></em>, which had been established by liberal notables in 1817 in defense of Dunoyer and continued to defend the<em> <em>Censeur européen</em> </em>and other periodicals in press cases. The Society was the center for radical political activity leading to the Left's electoral victories in 1817, 1818, and 1819. The Society's leaders were condemned and it was dissolved. The Society had had a <em>comité directeur</em> drawn from its most resolute members such as members of the <em>Union Libérale</em> of Paris. The<em> Union Libérale</em> appears to have been a vague, loose revolutionary coalition involving Paris notables, Paris youth, and provincial people, centering around Lafayette's salon in Paris and his château at Lagrange. Members were said to include legislators such as Lafayette, Voyer d'Argenson, Dupont de I'Eure, De Corcelles pere, General J.-J. Tarayre, General M.-J. Demarchy, journalists such as Dunoyer, Comte, Chatelain of the <em>Courrier français</em>, and Desloges of the <em>Journal du Commerce</em>, lawyers such as Joseph Mérilhou and Odilon Barrot, and a younger group including Paul Dubois, Theodore Jouffroy, Victor Cousin, Francois de Corcelle fils, Felix Barthe, Augustin Thierry, and the Scheffer brothers, Ary, Henri and Arnold who was Lafayette's secretary. J.-B. Say, whose daughter, Adrienne, married Charles Comte in 1818, has been mentioned as a participant.<a class=\"see-footnote\" id=\"footnoteref33_kmyrkf8\" title=\"Hatin, La Presse, pp. 307–313; Alan B. Spitzer, Old Hatreds and Young Hopes, The French Carbonari against the Bourbon Restoration (Cambridge, Mass., Harvard University Press, 1971), pp. 33–35, 38, 212–215, 242.\" href=\"#footnote33_kmyrkf8\">33</a></p>\n<p>Say's role, like that of Dunoyer and Comte, in revolutionary political activity in 1820, while unexpected is not unnatural. Teilhac has said:</p>\n<p class=\"indent2\">If we see then in J.-B. Say the man of the French political revolution and of the Anglo-French industrial revolution, the man of political Ideology and of economic Utilitarianism, he joined not only formal classical rationalism to a fundamental economic naturalism but to this economic naturalism a political rationalism.<a class=\"see-footnote\" id=\"footnoteref34_nxqxe6w\" title=\"Teilhac, Say, p. 50.\" href=\"#footnote34_nxqxe6w\">34</a></p>\n<p>John Stuart Mill visited Say in Paris in 1820 and observed: \"He belonged to the last generation of men of the French Revolution; he was the ideal type of true French republican\". Similarly, Auguste Blanqui recalled: \"I had had in my youth the honor of knowing the most eminent of French economists: J.-B. Say . . . J.-B. Say had very revolutionary ideas for the times. He detested at the same time the Bourbons and Bonaparte, an apparent contradiction which filled me with astonishment\".<a class=\"see-footnote\" id=\"footnoteref35_xw6zjb1\" title=\"Ibid., pp. 49–50.\" href=\"#footnote35_xw6zjb1\">35</a> In 1824, Frederic Jean Witt was interrogated by Bavarian police on revolutionary activities. Witt had been in Paris in 1818 and 1820, where he declared himself to have been in political contact with Lafayette, Comte and Dunoyer, and made himself their means of communication with radical elements in Germany.<a class=\"see-footnote\" id=\"footnoteref36_2n86tc8\" title=\"Spitzer, Old Hatreds, pp. 203–204.\" href=\"#footnote36_2n86tc8\">36</a></p>\n<p>The reaction of 1820 introduced a press law of March 31 which required submission of all periodicals to censorship before publication, and granted to the government the power to suspend any publication accused of infraction of the law even before a judicial decision. Lafayette in March, 1820, said of the press law that it was a violation of the <em><em>Charte</em>: \"</em>to violate it is to annul it, to dissolve the mutual guarantees of the nation and the throne, to restore us to ourselves in all the primitive independence of our rights and our duties\". General Tarayer, in June, declared to the deputies: \"the<em> <em>Charte</em> </em>is violated, and there remains to France no legal and regular means of defense against an ill-intentioned government\". The ministry altered the electoral system, presenting in May, 1820 a law of the double vote, weighing the electoral system in favor of wealthy landholders. Liberals withdrew from the chamber of deputies for the remainder of the session, and the Right accused the Left of preparing to turn to illegal actions. There were protests in Paris leading to a riot on June 5. It was in this atmosphere that the <em>Censeur européen</em>'s publication was suspended on June 23, 1820. There followed an attempt at a military conspiracy in which Lafayette's circle, especially Arnold Scheffer, were implicated: the plot of August 19, 1819. Charles Comte went into exile in Switzerland; Dunoyer remained in Paris where he was involved in the government's prosecutions against the <em>Censeur européen</em>.<a class=\"see-footnote\" id=\"footnoteref37_po5zgpq\" title=\"Ibid., pp. 37–50; members of a committee indicted before the Cours d'Assies, on June 29, 1820, included Lafayette, Comte, and Barrot. Lafayette and others were acquitted, but Comle was judged guilty and was condemned to five years, in exile. Barrot visited Comte in exile both in Switzerland and England. Almeras. Barrot, pp. 23,38.\" href=\"#footnote37_po5zgpq\">37</a></p>\n<p>Charles Comte settled in the Vaud which, in 1821, named him professor of natural law at the University of Lausanne. Either in Switzerland or Paris, Witt introduced him to Karl Follen, who had been a political refugee from the Prussian University of Jena, following the assassination of Kotzebue in March, 1819; Follen was forced to move from France to Switzerland in 1820. Follen became professor of law at the University of Basel. Following Witt's revelations to the Bavarian police in April, 1824, the Prussian government demanded the surrender of Follen, who was given refuge in the United States and appointed to the faculty of Harvard University (1825–1835) where he became a leading abolitionist. Comte similarly was forced to leave Switzerland on May 15, 1824 when, on the basis of Witt's statements, the French government intervened against Comte with the government of Vaud. Comte and his wife spent eighteen months in England in the company of James and John Stuart Mill and other philosophical radicals.<a class=\"see-footnote\" id=\"footnoteref38_j6gqpwb\" title=\"Spitzer, Old Hatreds, p. 205.\" href=\"#footnote38_j6gqpwb\">38</a></p>\n<p>Comte returned to France following his five years' exile,<a class=\"see-footnote\" id=\"footnoteref39_1rtwkqi\" title=\"Auguste Comte commented on Charles Comte's arrival in Paris: \"Comte of the Censeur has returned a little while ago to Paris, where he will establish himself permanently. He has returned from his exile more prejudiced than ever in the bastard direction of political economy. He will undertake soon a book totally of the order of the day, to prove that all the theories which are not immediately applicable to industrial practice ought to be quickly abandoned and scorned. Here is a rational man to cause fear! It Is he who had written in his time that if astronomy was truly useful, individuals would know well how to pay for it and hence that it is necessary to suppress the Observatory\". This was written on November 24, 1825. Henri Gouhier, La Jeuness d'Auguste Comte et la formation du positivisme; tome III, Auguste Comle et Saint-Simon (Paris: Librairie Philosophique J. Vrin, 1941), pp. 330–331\" href=\"#footnote39_1rtwkqi\">39</a> and became a contributor to the <em>Revue Americaine</em>, which Lafayette had founded on his return from America in October, 1825. Other editors were Voyer d'Argenson, Arnold Scheffer, and Armand Carrel, with Augustin Thierry as secretary. Comte wrote an important treatise on property, and published on similar topics. He was active in the opposition which led to the July Revolution of 1830. While Barrot became the prefect of the Seine, Comte was appointed a <em>procureur du roi.</em> But he resigned in 1831 and was elected a deputy by Mamers (Sarthe) and was reelected in 1834. During 1832 Comte and Barrot were active in defending newspapers against increasing prosecutions by the government. In 1832, Comte was appointed perpetual secretary of the newly reestablished Academy of Moral and Political Sciences. Charles Comte died on April 13, 1837.<a class=\"see-footnote\" id=\"footnoteref40_erk1n2j\" title=\"Harpaz . \"Jeunesse d'Augustin Thierry\", p. 349; Almeras, Barrot, p. 98. On November 6. 1830 Comte Charles de Lameth denounced abuses of freedom of the press; Comte, procureur du roi, on November 9 asked Lameth to make known such works to the courts as were open to any citizen. Lameth claimed that Comte was seeking judicial control over legislative statements. The chamber named a committee headed by Antoine Vatimesnil, who as a prosecutor during the Restoration had never supported parliamentary privileges, but had been a major force in the prosecution of Dunoyer and Comte. While declaring that Comte's action had threatened the rights of the chamber and approving Lameth's refusal to accept Comte's request, Comte was excused on the basis of the circumstances and the declarations he had made. In opposition to the committee's conclusions, Benjamin Constant made his last speech in the chamber on November 19, 1830. Constant held that Comte had the right to request Lameth to submit any fact; Lameth had the right to refuse according to his conscience; and the chamber had not any right to judge Comte because it was not a power of the legislature. Benjamin Constant, Écrits et discours politiques, commentary by O. Pozzo de Borgo (Paris: Chez Jean-Jacques Pauvert,  1964), II, 160–169.\" href=\"#footnote40_erk1n2j\">40</a></p>\n<p>The suspension of the<em> <em>Censeur européen</em> </em>in June, 1820 found Dunoyer with the highest reputation as a political publicist, a reputation which was to be long-lasting. Hatin has said:</p>\n<p class=\"indent2\">We have seen what reproaches had been made against the authors of<em> <em>Le Censeur</em></em>, and which as to basics and which as to form; but they have the incontestable merit of having dared first, since the Restoration, to profess with freedom the constitutional principles in all their integrity, and of having constantly sustained them, without ever making any concession to the military spirit or to bonapartism; they have yet the rare merit of having devoted themselves to proving by experience the vices of the legislation which then regulated the press.</p>\n<p class=\"indent2\">Among the collaborators of MM. Comte and Dunoyer, we will name Scheffer, J.-B. Say and Daunou, of which the articles <em><em>sur ler garanties</em> </em>were very remarkable. Paul-Louis Courier published there, between April 1819 and July 1820, the letters where one finds the ideal of his politics, and where he begins to design the original form of his style . . .<em>Le Censeur</em>, said M. Nettement, was the banner of the stoic school, which wished the complete and immediate application of the principle of political perfectibility, of nearly absolute liberty, without taking enough account of the political difficulties that the Restoration encountered. It was, to tell the truth, a renaissance of the movement of 1789, with that theoretical optimism which took its source in the best intentions, but which did not create in the least any grave perils.<a class=\"see-footnote\" id=\"footnoteref41_1ow4qwm\" title=\"Hatin, La Presse, pp. 290–291.\" href=\"#footnote41_1ow4qwm\">41</a></p>\n<p>During the remaining decade of the Restoration, Dunoyer remained active in the political opposition associated with the Lafayettes, de Broglies and de Staels. In 1822, Dunoyer wrote a pamphlet, <em>Lettre à un électeur de departement</em>, and another in 1824, <em>Du droit de petition à I'occasion des élections</em>. Dunoyer and Comte became members (February, 1826) of the forerunner of the \"Adie-toi et le Ciel t'aidera\" (which was instrumental in the July Revolution); this was \"La Société des Sciences morales et politiques\", which was under the aegis of Benjamin Constant and included Barrot, Mérilhou, Mauguin, duc de Broglie, Auguste de Stael and Guizot.<a class=\"see-footnote\" id=\"footnoteref42_hiruaky\" title=\"Almeras, Barrot, pp. 37–38.\" href=\"#footnote42_hiruaky\">42</a> Dunoyer's public contribution to the July Days was an open letter in <em>Le National</em> (July 26, 1830) declaring his refusal to pay taxes until the ordinances of Charles X were revoked.</p>\n<p>Dunoyer's political role during the Restoration can best be described as that of ideological leadership and of strategist and adviser, rather than political leadership<em> per se</em>, despite the prominence he achieved from his several political trials in the courts and his well-publicized political imprisonments. Guillaume de Bertier de Sauvigny has well recognized the uniqueness of the political role occupied by Dunoyer:</p>\n<p class=\"indent2\"><em><em>Le Censeur</em></em>, despite its powerful interest for the history of ideas, represented a relatively isolated voice; its editors, Comte and Dunoyer, were too concerned to raise themselves above the partisan passions of their epoch, too oriented toward the future of the nascent industrial society, to consider them representatives of a notable section of opinion.<a class=\"see-footnote\" id=\"footnoteref43_j9sg3cy\" title=\"G. de Bertier de Sauvigny, \"Preface\", in Ephraim Harpaz, L'École Liberale sous la Restauration, Travaux à l'Ethico-Politique (Genèva: Librairie Droz, 1969), XVI, ix; M. Girard, \"Les Liberaux des Gauche ou Independents de 1814 à 1824\", Le Libéralisme en France de 1814 à 1848: Doctrine et mouvement (Paris: Centre de Documentation Universitaire, 1966), I, 148–168; II, 151–158.\" href=\"#footnote43_j9sg3cy\">43</a></p>\n<p>Dunoyer's political role of ideologist and councillor was indistinguishable from the intellectual importance which Bertier de Sauvigny justly attributed to him. This activity continued to be manifest in the periodical press of the later Restoration, in the<em> <em>Revue encyclopedique</em></em>, in the<em> <em>Journal de debats</em></em>, and in the <em><em>Revue française</em></em>. But, the center of Dunoyer's intellectual contribution was the continuity and organization of the ideas, especially<em> <em>industrialisme</em></em>, which had been conceived and developed in the <em><em>Censeur</em> </em>and the<em> <em>Censeur européen</em>. </em>On the suspension of the<em> <em>Censeur européen</em></em>, Dunoyer embarked upon a course of lectures at the Athénée Saint-Germain, at which J.-B. Say had been presenting his lectures on economics for several years and Benjamin Constant had initiated his course on political thought. These lectures of Dunoyer formed the basis of his book, published in 1825,<em> <em>L'industrie et la morale considérées dans leur rapport aver liberté</em>. </em>A revised version was published in 1830,<em><em> Nouveau traité d'économie sociale, ou simple exposition des causes sous l'influence des quelles les hommes parviennent à uses de leur forces avec le plus de liberté, c'est-à-dire aver le plus de facilité et de puissance</em> </em>(the bulk of this publication was destroyed by fire before distribution in 1830).<a class=\"see-footnote\" id=\"footnoteref44_c3ppaer\" title=\"Albert Schatz, \"Ch. Dunoyer et la Définition de la Liberté\", L'lndividualisme économique et social (Paris: Librairie Armand Colin, 1907), pp. 196–215; Gaston Richard, \"Le philosophie et L'individualisme économique: l'école positiviste. Ses Origines\", La question sociale et Ie mouvemenl philosophique au XIX siècle (Paris: Librairie Armand Colin, 1914). pp. 97–119; René Gonnard, \"L'lndustrialisme: J.-B. Say\", and \"Dunoyer\", Histoire des Doctrines Économiques (Paris Nouvelle Librarie Nationale, 1922), II, 252–264, 278–283.\" href=\"#footnote44_c3ppaer\">44</a></p>\n<p>Dunoyer has been viewed as part of the broad society of intellectuals considered as the later Ideologues or the disciples of the Ideologues. Dunoyer was intermediate between Ideologue economists, Destutt de Tracy and Say, historians, C.F. Volney and P.C.F. Daunou, and the Younger disciples such as Augustin Thierry and Victor Jacquemont, whose friends, in addition to Dunoyer, encompassed Fauriel, Mérimée, Monzoni and Stendhal.<a class=\"see-footnote\" id=\"footnoteref45_tki8dmu\" title=\"Fr. Picavet, Les Ideologues (Paris: Felix Alcan, 1891), pp. 334–409, 419–422,479–489\" href=\"#footnote45_tki8dmu\">45</a> However, in contrast to the generally literary approach of the later Ideologues, Dunoyer carried the precision of the scientific attitudes of de Tracy and Say to their logical conclusions. The radical optimisim of their naturalist philosophy was such that, according to Roger Soltau, \"Jean-Baptiste Say proclaims his belief in 'the natural march of things', Dunoyer 'anticipated Spencer' (according to Taine) in his championship of the absolute 'freedom of labour', Garnier even denied the right of the State to issue currency, Bastiat [Soltau quoting Guido de Ruggiero] is an echo of eighteenth-century optimism with its identification of private and public interests, and the hostility towards the State which marks the earlier Liberalism\".<a class=\"see-footnote\" id=\"footnoteref46_12kdlr8\" title=\"Roger Henry Soltau, French Political Thought in the 19th Century (New York: Russell & Russell, 1959), p. 130; Guido de Ruggiero, The History of European Liberalism (trans. R.G. Collingwood) (Boston: Beacon Press, 1959), p. 187; on Dunoyer and Censeur, ibid., pp. 172–173, 453.\" href=\"#footnote46_12kdlr8\">46</a></p>\n<p>Dunoyer opposed legislation as attempts to prevent voluntary relations by words or actions between individuals. If at all, there should be only the application of judicial decision when a crime is committed; for example, it should be immoral to establish any regulation of the practice of medicine. Anyone undertaking its practice would accept the risk of judicial punishment should an injury be criminal. Relations would be defined by processes of contract, sureties and insurance. The production of security and justice would be a result of market functions and transactions. As Albert Schatz notes with reference to Dunoyer's ideas:</p>\n<p class=\"indent2\">So understood, the governmental function needs a small number of agents, the mass of workers remaining available to increase the sum of social utilities other than security. It is proper then to diminish the number of public offices and officers, and to employ to this end the single efficacious means, which is to reduce the rewards or salaries. It is of little importance, moreover, whether the signboard of the company charged with ordinary security be monarchy or republic, provided that it cost little and disturb no one at all, that it realize progressively this ideal in a society so perfectly developed that government disappears, leaving to the inhabitants the full enjoyment of their time, their wealth and their liberty.<a class=\"see-footnote\" id=\"footnoteref47_r6uj8sm\" title=\"Schatz, L'Individualisme, pp. 210–211.\" href=\"#footnote47_r6uj8sm\">47</a></p>\n<p>Dunoyer's precision of thought, following de Tracy and Say, and derived from scientific attitudes, contributed to the impact and the close relations which he had with Auguste Comte. Henri Michel has called Dunoyer the \"positivist before positivism\".<a class=\"see-footnote\" id=\"footnoteref48_hotfnnc\" title=\"Henri Michel, L'Ideé de l'État, Essai critique sur l'histoire des théories sociales et politiques dupuis la révolution (Paris: Hachette, 1895), p. 345.\" href=\"#footnote48_hotfnnc\">48</a> Dunoyer became acquainted with Auguste Comte when he became Saint-Simon's secretary in mid-1817 following Augustin Thierry's break with Saint-Simon and his full association with Dunoyer on the <em>Censeur européen</em>. After Comte's resignation in a couple of years as Saint-Simon's secretary, he, too, wrote for the <em>Censeur européen</em> and remained in intellectual contact (even when all other contact was excluded) with Dunoyer throughout his life. (Comte died in 1857.) Henri Gouhier in <em>La Jeunesse d'Auguste Comte et la formation dupositivisme</em>, tome III, <em>Auguste Comte et Saint-Simon</em>, emphasizes the role of Dunoyer in Comte's life. In <em>Appendice I, Le Censeur européen</em>, Gouhier says:</p>\n<p class=\"indent2\">The liberal and antifeudal thought expressed discreetly in the constitutional journals, the <em>Journal de Paris</em> and the <em>Journal général</em>, was expressed more freely in <em>Le Censeur</em> of Charles Comte and Charles Dunoyer, \"of which each edition was an event\" (Houssaye, 1815, <em>La première Restauration</em> . . . p. 67).</p>\n<p class=\"indent2\">This publication enjoyed a certain role in the formation of positivism . . . Auguste Comte became part of the staff during 1819 . . . Finally, around this review there was an intellectual and political milieu: \"l'école positive de MM. Comte et Dunoyer\", wrote Saint-Beuve (<em>Causeries du lundi</em>, t. II, 6e edition, Garnier, M.de Broglie, p. 381). These youth had a spirit which must be acknowledged. The founder of sociology has never forgotten it; in 1857, he called <em>Le Censeur</em> \"the only periodical publication which posterity will honor in French journalism: (<em>System</em>, 5. IV, Preface de l'appendice general, p. 11). Comte's personal relations with Dunoyer have always been clear; the economist sent him his works and Comte never ceased to feel for him a profound esteem; in 1845, at the time when his reading was reduced practically to a few inquiries, he permitted himself \"one special exception to his severe <em>hygène cérébrate</em>\" (A Mill 28 fevrier, 1845, p. 410) in opening <em>La liberté du travail</em>. \"In sum\", he said to John Stuart Mill, \"M. Dunoyer whom I have known more than twenty-five years, has always seemed to me one of my immediate predecessors who merits the entirety of my sympathies\" (A Mill, p. 409). On diverse occasions, Comte noted what he owed to his work. It is Dunoyer and not J.-B. Say who figured as the associate of Adam Smith in the positivist calendar.<a class=\"see-footnote\" id=\"footnoteref49_6dataqw\" title=\"Gouhier, La Jeunesse, pp. 408–409.\" href=\"#footnote49_6dataqw\">49</a></p>\n<p>It is in the emergence of the concept of social science that Auguste Comte found common ground with Dunoyer. The <em>Censeur europée</em>n, which spoke of a \"laic breviary for liberals\" in strongly recommending Daunou's <em>Essai historique sur la puissance temporelle des papes</em> (4th ed., 1818; 1st ed., 1810) was a far cry from Joseph de Maistre's <em>Du Pape</em> (1821) which Comte claimed was the source of more of his ideas than any other book. Dunoyer's anarchism, individualism and tolerance was in opposition to Comte's concern for the decay of traditional morals and hostility to intellectual divergences.<a class=\"see-footnote\" id=\"footnoteref50_zhfw2cl\" title=\"Soltau, \"The Authority of Science, I. August Comte\", French Political Thought, pp. 203–215.\" href=\"#footnote50_zhfw2cl\">50</a> The infallability and dominance of society posited by de Maistre was totally appealing to Comte in the early 1820s. The programs of the rulers were acceptable in contrast to the radical criticism of the opposition.</p>\n<p>Dunoyer's criticism of the concept of indefinite perfectibility, however, while praised by Comte, would involve him in a major debate with Benjamin Constant, but the immediate consequence was a temporary break between Dunoyer and Stendhal. Fernand Rude, in \"La Querelle des Industriels (1825)\", <em>Stendhal et</em> <em>La Pensée sociale de Son Temps</em>, describes the circumstances, beginning with the publication of Dunoyer's book.<a class=\"see-footnote\" id=\"footnoteref51_jmhyr9h\" title=\"Fernand Rude, Stendhal et La Pensée sociale de Son Temps (Paris: Plon, 1967), pp. 101–180.\" href=\"#footnote51_jmhyr9h\">51</a></p>\n<p class=\"indent2\">In a letter to the <em>London Magazine</em>, dated October 11, 1825, he [Stendhal announced that Charles Barthelemy Dunoyer, who in collaboration with Charles Comte. had published <em>Le Censeur européen</em> and who is \"one of the most powerful intellectuals of France\", is on the point of publishing \"a profound treatise\" entitled \"la morale et l'industrie considerées dans leurs rapports avec liberté\". Except for the inversion of <em>industrie</em> and <em>morale</em> it is in fact the exact title. \"This book of Dunoyer is too true to be sermonized . . . His work is a faithful table of the state of our society during the last thirty-five years. And in a word, his work is a very good supplement to Mignet's <em>Histoire de la Revolution</em>\".</p>\n<p class=\"indent2\">In another letter of November 18, 1825, the \"small nephew of Grimm\" characterized this work as \"admirable\" and felicitated him on his success which, said he, \"to my great surprise . . . goes to a crescendo\". All the gentlemen who wish to think read M. Dunoyer. Six years ago, no one had understood him.</p>\n<p class=\"indent2\">Dunoyer had presented a course in the winter of 1825 at the Athénée which constituted a veritable plea for <em>industrialisme</em>. It was in fact the rough draft of his major book . . . The epigraph of this work gives the resume of it: \"We become free only in becoming industrious and moral . . .\" Here is what Dunoyer wished to demonstrate. And for this, said he, it is necessary to consider, not the governments but the masses; the state of their industry and of their morals. Throughout that book, this author never separates in effect the progress of industry from the progress of morals and of liberty . . . \"Under the name of administration, I know not what monstrous, immense corpus, extending to all its innumerable hands, putting its shackles on everything, levying enormous taxes, bending by fraud, corruption, violence, all the political powers to its designs, exhaling chiefly the spirit of ambition which produced it, and the spirit of servility which conserves it\". More even than of Saint-Simon, this indictment makes us think of Proudhon . . . [the <em>industriel</em> people are] . . . \"those where it is no longer the passion for power that reigns, but the passion to work\". . . . \"In the beginning, the dominating classes are all, and the laboring classes nothing; in the end, the dominating classes will be nothing, at least so far as dominating, and the laboring classes will be all; society will be constituted for work\".<a class=\"see-footnote\" id=\"footnoteref52_uh2935i\" title=\"Ibid., pp. 105–109, 113–114.\" href=\"#footnote52_uh2935i\">52</a></p>\n<p>For Dunoyer, <em>industrialisme</em> was the exact opposite of theft. Any action which was not the result of a freely chosen choice was a theft. That is why he admired the American state constitutions of the Revolution, especially that of Pennsylvania; that was a model because the government appeared to have the character of an industrial enterprise in which everyone was a voluntary associate. Similarly, he admired America's decentralism which he believed was the result of America's <em>industrialisme</em>. <em>Industrialisme</em> would dissolve states as the universality of mankind was rooted in free labor.</p>\n<p class=\"indent2\">It is the spirit of domination which has formed these monstrous aggregations or which has rendered them necessary; it is the spirit of industry which will dissolve them: one of its ends, one of its greatest and most salutary effects must be to municipalize the world. . . . The centers of action will be multiplied; and finally the vastest countries will end by presenting only a single people, composed of an infinite number of uniform aggregates, aggregates between which will be established without confusion and without violence, the most complex and at the same time the most easy, the most peaceful and the most profitable relations.<a class=\"see-footnote\" id=\"footnoteref53_tx31dus\" title=\"Charles-Barthélemy Dunoyer, L'lndustrie el La Morale (Paris: Sautelet, 1825), pp. 336–367, Cf. Odilon Barrot, De la centralization et des ser Effets (Paris: Dumineray, 1861).\" href=\"#footnote53_tx31dus\">53</a></p>\n<p>Rude notes that in his letter of November 18, 1825, Stendhal singles out a noteworthy aspect of Dunoyer's book.</p>\n<p class=\"indent2\">There is a passage which had particularly struck Stendhal. \"M. Dunoyer, equally intrepid to blame the people of France, as to attack its tyrants, in place of flattering them basely in the fashion of the <em>Constitutionnel</em>, tells them courageously the truth. . . M. Dunoyer is the Sole liberal writer who does not flatter the nation and is bold to tell them: 'You make yourselves slaves, that is why you have tyrants. Each people has never more liberty than it forces its sovereign to accord to them'.\"<a class=\"see-footnote\" id=\"footnoteref54_z04nl7q\" title=\"Rude, Stendhal, p. 113.\" href=\"#footnote54_z04nl7q\">54</a></p>\n<p>The contacts between Dunoyer and Stendhal were based upon more than common friends, such as the young Victor Jacquemont or the elderly Destutt de Tracy. For two decades Stendhal had been a student of economics; he considered himself a disciple of Smith, Say and de Tracy.<a class=\"see-footnote\" id=\"footnoteref55_t0fw3ut\" title=\"Rude, \"Les 'Apprentissages' de Stendhal, 2, L'économie politique\", ibid., pp. 57–98.\" href=\"#footnote55_t0fw3ut\">55</a> Since Dunoyer was the major writer and lecturer continuing Say's contributions, it was natural that Stendhal would know Dunoyer, as well as take a direct interest in the development of <em>industrialisme</em>. Along with Condorcet's <em>Equisse</em> and Volney's <em>Ruines</em>, the young Stendhal had been strongly influenced by the writings of William Godwin, and was praising Godwin's work in the early 1820s. Godwin's heroes, who were \"at open war with their oppressors\", were one of the inspirations for Stendhal's <em>The Red and the Black</em> (1830).<a class=\"see-footnote\" id=\"footnoteref56_p12ekfi\" title=\"Rude, \"Les 'Apprentissages' de Stendhal, 1, L'Idéologue\", ibid., pp. 17–56.\" href=\"#footnote56_p12ekfi\">56</a> <em>The Red and the Black</em> was inspired by a number of sources during the 1820s and included material which Stendhal took from the manuscripts of his late fellow citizen of Grenoble, Barnave.<a class=\"see-footnote\" id=\"footnoteref57_0c5yd4m\" title=\"Emanuel Chill, \"Introductory Essay\", Power, Property, and History, Barnave's Introduction to the French Revolution and Other Writings (New York: Harper & Row, 1971), p. 70.\" href=\"#footnote57_0c5yd4m\">57</a> Barnave's then unpublished <em>Introduction to the French Revolution</em> presented one of the earliest statements of elements of the analysis characterized as <em>industrialisme</em>. Stendhal is a potential source for Dunoyer's being informed of Barnave's thought before the publication of Barnave's works in 1843 by Alphonse Marie Bérenger de la Drôme (1785–1855). Rude writes:</p>\n<p class=\"indent2\">We know the veneration which from his most youthful years Stendhal had for Barnave, \"that great spirit\". He speaks of him repeatedly in his <em>Mémoirs d'un touriste</em> and he notes even: \"If I had the space, I would cite a curious manuscript of his\". In effect Stendhal knew the sister of Barnave, Mme. Saint Germain, as well as Bérenger de la Drôrne, who in 1843 published the <em>Oeuvres de Barnave</em>.<a class=\"see-footnote\" id=\"footnoteref58_i93or0z\" title=\"Rude, Stendhal, p. 235; Fernand Rude, ed., Barnave: Introduction à la Révolution Française (Paris: Librairie Arman Colin, 1960).\" href=\"#footnote58_i93or0z\">58</a></p>\n<p>Dunoyer's disagreement with Stendhal arose from the printing in late November 1825 of Stendhal's booklet, <em>D'un nouveau complot contre les industriels</em>, issued by their common publisher, Sautelet. Dunoyer was unhappy over the publication of an attack on <em>industrialisme</em> since his book was the principal and most widely known treatise on the subject. Stendhal had been prompted to write his pamphlet by Saint-Simon's <em>Catéchisme des industriels</em> (issued in four <em>cahiers</em> between December, 1823 and June, 1824). Rude believes that the <em>nouveau complot</em> was written in early 1825 but that the publication was postponed by Saint-Simon's death on May 19, 1825, and resumed by Stendhal with the launching by Saint-Simon's disciples of the magazine <em>Le Producteur</em> at the time of a speculative coup by Saint-Simonian bankers.<a class=\"see-footnote\" id=\"footnoteref59_6oizd74\" title=\"Rude, Stendhal, p. 40.\" href=\"#footnote59_6oizd74\">59</a></p>\n<p>In the <em>Catéchisme</em>, Saint-Simon had attacked the \"bourgeois\", the lawyers, military officers and government bondholders (to which group Stendhal felt an affinity) and described banking as a new, higher form of industry which would lead to the reign of the bankers. Saint-Simon called for a union of the center-left with the center-right, the industrialists and the royalist ministerials, against the liberals. Saint-Simon expressed pleasure at the liberal party's destruction at the hands of the royalist ministry and wished the industrialists to repudiate liberalism because its critical and anti-organizational attitudes were revolutionary. Stendhal saw this project for a union of the bankers with the government as the <em>complot</em> against the liberals and the industrialists. Stendhal declared his faith in economics and in industrialization. Industry was one of the \"great strengths of civilization\", and he looked forward to its progress as it would lead the French to \"put into practice the <em>Charte</em>\": As a supporter of the producing majority against the governors, Stendhal opposed the substitution of \"the most important industrials\" as governors in place of the existing governors. Stendhal feared that Saint-Simonianism was a diversion from the struggle for liberty, was a weapon against liberalism, and was aimed at enshrining the rule of Baron de Rothschild and the other half dozen major bankers.<a class=\"see-footnote\" id=\"footnoteref60_7qspayg\" title=\"Rude, Stendhal, pp. 131–137.\" href=\"#footnote60_7qspayg\">60</a></p>\n<p><em>Le Producteur</em>, which was published by Saint-Simon's disciples with the support of a number of bankers headed by Jacques Laffitte, appeared on October 1, 1825; Cerclet was editor and Enfantin and Bazard were the publishers. In the early issues was a reprint of a chapter from Dunoyer's new book, a review by Say and articles by Auguste Comte, in which he declared that out of the scientific class, the engineers were forming a separate corporate class to act as intermediaries between the industrialists and the scientists (Comte also emphasized spiritual power as the new approach which Saint-Simon was initiating before his death). Stendhal wrote an article for the <em>London Magazine</em> (October 11, 1825) which was mostly favorable but which for the first time publicly linked the editors of <em>Le Producteur</em> with Saint-Simon. For they had attempted to present the whole spectrum of <em>industrialiste </em>authors rather than the narrow Saint-Simonian publication it would become. Indeed, there was a clear presentation of the diversity of <em>industrialiste</em> analyses. Say, in a review of McCulloch's <em>Political Economy</em> (<em>Le Producteur</em>, No. 5, October 29, 1825), attacked the Ricardian theory of value based solely on the quantity of labor in the product. Prosper Enfantin (No. 6, November 5, 1825) supported Ricardo and McCulloch against Say's economic analysis. Enfantin's article carried Ricardian classical economics, long before Marx, to the logical conclusion that Marx was to reach. In addition, there were articles on positivist literature against which Stendhal rebelled.<a class=\"see-footnote\" id=\"footnoteref61_kd01e1n\" title=\"Ibid., pp. 115–124; Georges Weill, L'École Saint-Simonienne (Paris, 1899), pp. 9–10.\" href=\"#footnote61_kd01e1n\">61</a></p>\n<p>However, the matter which triggered Stendhal's booklet was a speculative coup which received the support of <em>Le Producteur</em>. Its first issue had proposed a company of the bankers of Europe with Laffitte at its head to become a Holy Alliance of the Bankers. French bankers had made loans to King Ferdinand VII at the same time as the martyrdom of the Spanish liberal Riégo; Laffitte in July 1824 had aided the Villele ministry in its financial difficulty with the government debt. Finally, the bankers associated with the Saint-Simonians had been engaged in making loans to the Pasha of Egypt to purchase ships and arms to fight against the Greek revolution. The last straw for Stendhal was a loan to Haiti to be negotiated by Ternaux which was much discussed in the early issues of <em>Le Producteur</em>. On November 3, 1825 two sets of equal bids were submitted by Pillet-Will, and by André Delessert and Casimir Périer. The next day the loan was granted to Laffitte and the Rothschild brothers.<a class=\"see-footnote\" id=\"footnoteref62_32z7h8d\" title=\"Rude, Stendhal, pp. 97, 101, 124–127.\" href=\"#footnote62_32z7h8d\">62</a></p>\n<p>Stendhal expressed his earliest criticism of the position of <em>Le Producteur</em> in conjunction with his distress over the Haitian loan (November 10) and added that issue to the manuscript he had written on Saint-Simon's <em>Catéchisme</em> and the earlier activities of the bankers. Stendhal's <em>D'un nouveau complot contre les industriels</em> viewed the conspiracy of the bankers and the government against the liberals and industrialists as a major aspect of the Saint-Simonian doctrine. Instead of the Rothschilds, Laffitte <em>et al</em>., Stendhal proposed as disinterested heroes, Lafayette, Washington, Carnot, Dupont de l'Eure, Daunou and general Bertrand.<a class=\"see-footnote\" id=\"footnoteref63_wxo52fm\" title=\"Ibid., p. 133.\" href=\"#footnote63_wxo52fm\">63</a></p>\n<p>Cerclet wrote a letter of criticism to Stendhal. The <em>Journal du Commerce</em> responded (December 3, 1825) that Stendhal examined only a narrow segment of <em>industrialisme</em>, and neglected the major stream of <em>industrialisme</em> which centered on the ending of exploitation of man by man through privileges, and on society administering itself without an external agency. \"Man will then work upon nature, live from things and leave his fellow men in peace\". Armand Carrel reviewed Stendhal's booklet in <em>Le Producteur</em> (December 3, 1825). Stendhal in <em>Le Globe</em> (December 6, 1925) criticized the lack of clear writing and growth of charlatanism, of which an example was \"a new polish for the boots, a new system of <em>industrialisme</em>, of a new <em>vegetable rouge</em>\". <em>Le Globe</em> (December 17) reprinted long extracts from Stendhal's booklet.<a class=\"see-footnote\" id=\"footnoteref64_j41p808\" title=\"Ibid., pp. 141–149, 153–155.\" href=\"#footnote64_j41p808\">64</a></p>\n<p>Meanwhile, Leon Haltvy, one of the leading Saint-Simonians, had written an article in <em>L'Opinion</em> (December 5) on Benjamin Constant's lecture on December 3; Halevy's article \"Athénée Royal de Paris, Seance d'ouverture. Discours de M. Benjamin Constant\", sought to answer Constant's criticism of Saint-Simonianism and recalled the friendship between Constant and Saint-Simon. Constant responded with a letter to <em>L'Opinion</em> (December 6), which, was reprinted in the <em>Journal du Commerce</em> (December 7). He emphasized the need of constitutional guarantees against the pursuit of purely material interest. He was especially fearful of Saint-Simonian intolerance and he- supported freedom of conscience against the implicit despotism of the Saint-Simonians. Constant's interpretation regarding intolerance was confirmed in a reply to Constant's letter by Cerclet's article in <em>Le Producteur</em> (December 10), which followed an earlier response by Saint-Amand Bazard in the issue of December 3 but obviously published several days later.<a class=\"see-footnote\" id=\"footnoteref65_lmdkl6y\" title=\"Ibid., pp. 148–152, 291.\" href=\"#footnote65_lmdkl6y\">65</a></p>\n<p>The <em>Revue encyclopédique</em>, for which Say and Dunoyer wrote, contained a review (December, 1825) of Stendhal's booklet by Comte Paul-Eugène Lanjuinais, son of the Liberal peer. He emphasized Stendhal's criticism of the Saint-Simonian banker's loans to the Turks and agreed with Constant's lecture that industry was very important but that it is necessary to develop the moral faculties as well. Victor Jacquemont, who was a friend of Dunoyer's, was favorable to <em>industrialisme</em> and was acquainted with the Saint-Simonians, had found Stendhal's booklet worthwhile. Jacquemont wrote Stendhal on December 22, 1825: \"Barthélemy Dunoyer is furious against you. He said that you understand nothing on that question\". So for Stendhal, \"lourd\" Dunoyer became \"that most ignorant of liberal writers\", because \"it is too much to contemplate that they could believe that of me, who was of their party\". However, Dunoyer and Say could not long maintain their fragile association with the editors of a <em>Le Producteur</em> which continued to espouse Ricardian economics. Against the absolute opposition of Say and Dunoyer to paper money and the system of credit based upon it, Enfantin (January 1, 1826) praised Ricardo's preference for paper money, and emphasized the role of banks in creating credit for major undertakings such as transportation development. So also the split between Dunoyer and Stendhal was not continued; Rude writes:</p>\n<p class=\"indent2\">Stendhal acknowledges always his [Dunoyer's] science in political economy. And I believe we recognize him in the M.D. that the <em>touriste </em>encountered at Chalon-sur-Saône and whom he presents as \"one of the leading economists of France\".<a class=\"see-footnote\" id=\"footnoteref66_mop1peu\" title=\"Ibid., pp. 115, 155–164.\" href=\"#footnote66_mop1peu\">66</a></p>\n<p>Dunoyer signaled his break with the Saint-Simonians in an article in the <em>Revue encyclopédique</em> (t. XXXIII, février, 1827). In this lengthy \"Historical Notice on <em>Industrialisme</em>\", Dunoyer presented an analysis and criticism of the writing of the Saint-Simonians in<em> <em>Le Producteur</em>.</em></p>\n<p class=\"indent2\">As disciples of M. Saint-Simon, the authors have undertaken the work with the intention of propagating his doctrines. They seem to adopt these doctrines without restriction. First, they claim for him the honor of having founded<em> <em>industrialisme</em></em>; they attribute to him even the glory of having invented the word<em> <em>industriel</em></em>. Hence, like him, from the fact that the theological and feudal powers are constantly declining, and that the arts, the sciences, and industry do not cease to acquire strength, they conclude that the direction of affairs must pass from the hands of eccelesiastical and lay lords into those of the savants, the artists and the industrialists. Following their master, they reproach these latter classes for only having worked to free themselves. Because they have long made war, of wishing to make war always; of rendering eternal what ought only to be transitory; of making an end of what was only a means; of wishing to replace the old system by criticism; . . . of reducing criticism to a system, of making an aim of criticism, without any other object than to criticize. They beseech those classes to abandon this<em> <em>critical tendency</em></em>, which places, they say, very great obstacles to the progress of civilization, and to adopt the organic tendency, to proceed without loss of time to the organization of the industrial system. What they desire also, after the example of Saint-Simon, is a state composed solely of savants, artists and artisans, where the most distinguished savants and artists will form the spiritual power, and the most preponderant industrialists the temporal power of society; where the first will be charged with the formation of ideas, the second with the formation of sentiments, and the last with the administration of material interests. This system took no account of individuals; it only occupied itself <em><em>with the entire human species</em></em>. It assigned for the destiny of the species <em><em>the more and more perfect exploitation of the globe which we inhabit</em></em>. It proclaimed <em><em>the organizational principle of a productive association between all peoples</em>. </em>The law of this association is not liberty. <em><em>Laissez faire et laissez passer</em></em> is an insufficient counsel.<a class=\"see-footnote\" id=\"footnoteref67_3o5n4wu\" title=\"Revue encyclopédique, pp. 190–191.\" href=\"#footnote67_3o5n4wu\">67</a></p>\n<p>Dunoyer strongly attacked the Saint-Simonian decision that human imperfection required man's social activities to be under the direction of other men. For the Saint-Simonians there is no reason for creative men to seek answers and desire to apply them, if there is no force compelling individuals who escape its direction to return to its benefits and to show \"continually to workers the route that they must follow and not permit anyone to escape from it\". Dunoyer was appalled by the Saint-Simonian claim that the masses required a system of general directors and a negation of competition. For the Saint-Simonians, competition was a principal enemy and \"order would result only from the exceptions made to the principle of competition\". For Dunoyer, only competition can yield proper value and put in their correct place the means of order such as the police. The Saint-Simonians' desire to eliminate economic competition was shown by their wish to centralize the control of credit in the hands of bankers selected for this purpose. Dunoyer described this in terms taken from<em> <em>Le Producteur</em></em>:</p>\n<p class=\"indent2\">We seek constantly to combat this principle [competition] . . . It is necessary that in each branch of industry there be associations of captialists who will make advances only to the entrepreneurs and to the enterprises which merit it . . . it is necessary to establish a credit center in each industrial class . . . There need to be disciplinary councils for lawyers, doctors, bakers, butchers, stockbrokers, notaries, etc. The disciplinary councils are no more an evil than particular directors in each branch of industry are an evil, than the general directors of society, than governments in general are an evil. Such councils must guide the science and the morality of all men examined by them . . . But they must be composed of evidently superior men. Such is that system. It is all directed against what the authors call the<em> <em>critical tendency</em></em>, and towards what they call the<em> <em>organic tendency</em>.<a class=\"see-footnote\" id=\"footnoteref68_u2xl7i2\" title=\"Ibid., pp. 192.\" href=\"#footnote68_u2xl7i2\">68</a></em></p>\n<p>The Saint-Simonian system of organizing, directing and ordering society through government was in direct opposition to the contributions made by Say and Dunoyer. For the Saint-Simonians, an industrial society was one in which the leading industrialists exercised governmental power, in collaboration with the scientists and artists, over the rest of society. For Dunoyer, <em><em>industrialisme</em> </em>was the negation of government of men by men, \"a manner of life\" where all social relations are characterized by free, competitive activities in absolute freedom.</p>\n<p class=\"indent2\">The<em> <em>industrial system</em></em>, the<em><em> industrial society</em></em>, is truly one where all men are producers of usefulness, where the men of all classes, forced finally to renounce all violence, are only able to live from useful things that they create by peaceful work, and from what they obtain by voluntary gift or regular exchanges; but there is not much use in speaking of the social<em> <em>industrial state</em></em>, when, by the word <em>industriel</em>, one only intends, as do M. Saint-Simon and the writers of his school, one of several classes of individuals or of professions . . . It is then the fault of these writers to wish to choose only from among the savants, the industrialists and the artists. But they fall into an error yet more serious, concerning the regime mast convenient to the industrial system. Their complaints against what they call the<em> <em>critical system</em></em>, that is to say, against a general and permanent state of examination, of debate, of competition, attacks society in its most active principle of life, in its most efficacious means of development. First, these writers mistake all the facts, when they accuse a critical philosophy of tending only to destroy and of and of proposing only a negative goal. In working to remove the obstacles which oppose the free and legitimate exercise of the humane faculties, it tends, on the contrary, to a very positive goal, which is to place humanity in a situation where its faculties are able to grow easily. Hence, it demands the abolition of all privilege, of all monopoly, of all evil and violent restriction, and wishes that each be able to use his powers freely within the limits of justice and equity. . .</p>\n<p class=\"indent2\">The disciples of the school which claims to be organic see the greatest inconveniences in leaving society to itself and in looking forward to its development by the free competition of individual efforts. This state of competition, they say, only leads to the anarchy of sentiments and ideas. However, by a singular contradiction, they admit, at the same time, that free discussion is necessary at certain epochs, when society tends to pass from one doctrine to another, from an imperfect state to a better state. But, if discussion often has the power to produce enlightenment, if it is able to really spirits to truth, if it is in the nature of things what common ideas emerge from a conflict of divergent opinions, what is the significance of the reproach made against freedom, and when does it begin to be anarchic? Is there, in the course of centuries, a single instant where society does not tend, in a multitude of ways, to modify its ideas, to change its manner of existence? To accuse liberty of what remains of confusion in moral and social doctrines, is to see evil in the remedy, and to complain precisely of what tends to make the confusion cease. The error of the organic school is the belief that liberty is only a provisional utility. A time will come, they say, where all the sciences will be positive; and we will no longer have need of liberty when all the sciences are positive: one cannot dispute demonstrated truths. One disputes no longer what is demonstrated, no doubt; but will it ever all be demonstrated? What appears to be demonstrated, will it always appear so? Will not the inductions which seem well established, in the experimental sciences, be modified some day by new experiences? In place of saying that our knowledge will become complete and certain, we are able to affirm strongly that they always will leave something to be discovered or to be rectified. It is then in the nature of things that liberty of examination will be perpetually necessary. Society which lives chiefly by action, acts, at each instant, according to the notions that it possesses, but to act better and better, it needs to work constantly to perfect its knowledge, and it only is able to succeed by means of liberty: research, inquiry, examination, discussion, controversy, such is its natural state, and such it will always be, even when its knowledge has acquired the greatest certainty and understanding.</p>\n<p class=\"indent2\">This is not the advice of the organic school. It believes, on the contrary, that this state is only transitory, and that there will come a time when our knowledge will have attained such a degree of extension and of certitude, that there will be no matter for discussion. In consequence, and as if human knowledge had already arrived at that state of ideal perfection, it wishes to give from this moment official directors to society who will conduct its works in conformity with the infallible and complete knowledge that it is destined to acquire. It commences with a vain supposition in order to arrive at a disastrous conclusion. It is puerile to wish to decide in advance what will be in the future the progress of human knowledge; we do not have any means to know it; it will never become as perfect as one supposes; at least it is certain that it is yet far from being perfect, and it is insane to think as if it were perfect already. Finally, were it perfected, if we could know fully the aim of society and all the means we would every have to attain it, were there nothing more to discover in the sciences; it we could know the best means to follow in the arts; if we could acquire the infallible means to discern, in all cases, the good and bad undertakings, it would yet be very pernicious to give to the best instructed men in all things the right to submit others to their direction. We do not hasten the progress of truth by constraints. The best means, on the contrary, to hinder it so that it does not spread, is to give to men who know it the power to impose it on those who are ignorant. Far from increasing its influence, one destroys it. . . No one understands why he must <em>a priori</em> submit his reason to that of another; no one consents to receive a truth imposed by force. It is surely desirable that society be guided by the knowledge of its most enlightened members, but it is more desirable that they possess power only by their knowledge. The true savants have not need to exercise any magistracy in order to be consulted. The natural disposition of whoever has need of a service is to address himself to whomever is best able to serve him. It is only coercive directors that people refuse to fallow; and nothing will be less favorable to the progress of society, then to give to men of knowledge the power of constraint. Society wishes to be constrained only by whom it may select for the service; no more by savants than by priests; what its interest requires before anything, on the contrary, is that all unjust constraint should be repressed.<a class=\"see-footnote\" id=\"footnoteref69_ehkj1kr\" title=\"Ibid., pp. 194–198.\" href=\"#footnote69_ehkj1kr\">69</a></p>\n<p>Dunoyer's \"critical\" approach toward any attempt to eliminate absolute freedom of choice was the basis of his conflict with the Saint-Simonians. The introduction of any compulsion or direction by one person over another, including intellectual direction, was precisely the fundamental disagreement which Dunoyer had had with Rousseau's concepts. The possibility that legislation could have any role in the education, development or improvement of any person was contrary to Dunoyer's conception of law. All law was negative or destructive, except insofar as law expressed the exact relations which it sought to regulate, in which case it was at best superfluous. Dunoyer drew this attitude from the \"very judicious reflections\" of an \"old, little-known work\",<em> <em>L'Homme et la Société</em> </em>by J. B. Salaville, whom Rude notes had been influenced by the principles of William Godwin.<a class=\"see-footnote\" id=\"footnoteref70_eku7tn9\" title=\"Dunoyer, L'Industrie el la morale, pp. 430–431: J.B. Salaville, L'Homme et las Société; ou nouvelle théorie de la nature humaine et de l'état social (Paris: Carteret-Dentu, An VII, 1798), chapter XXXIV, pp. 355–372, 391–392; Rude, Stendhal, p. 114.\" href=\"#footnote70_eku7tn9\">70</a></p>\n<p>In conflict with Dunoyer's insistence that the voluntary acceptance of truth by each person was the sole means of gaining acceptance, in which case legislation was either evil or needless, the Saint-Simonians held that on the discovery of a truth, the compulsion to observe it had to be imposed on each person. For the Saint-Simonians the position advocated by Dunoyer was anarchism. In response to the \"critical\" approach and its rejection of his scientism, Saint-Simon had declared: \"you, gentlemen, are nothing but anarchists\". Dunoyer clearly identified himself with the anarchism of \"critical\" philosophy as well as the anarchism in politics which Saint-Simon and his disciples had felt to be the major opposition to his scientistic despotism. As J. L. Talmon notes in his \"Totalitarian Technocracy: Saint-Simon\", of Saint-Simon's criticism of the radical liberalism of such contemporaries as Dunoyer:</p>\n<p class=\"indent2\">Among themselves the\" would settle matters byway of contract, warranted by their own corporations and their laws and customs. Since the feudal-military-clerical State was in no position to render real assistance, but only to do harm, or worse—to extort ransom, the industrial classes developed almost a religion of non-interference by the State. Liberty became identified with the absence of government, individual freedom with isolationism. The experience of feudal-clerical rule was universalized into a philosophy teaching that government as such is a natural enemy, and not<em> \"<em>chef de la société, destiné à unir en faisceau et à diriger vers un but commun toutes les activités individuelles</em></em>\".<a class=\"see-footnote\" id=\"footnoteref71_atfiuxn\" title=\"J.L. Talmon, Political Messianism, The Romantic Phase (London: Secker & Warburg, 1960), pp. 35–124, esp., pp. 46 and 49–50; on 18th century advocates of the beneficial role of legislation, especially Rousseau, see Talmon, The Origins of Totalitarian Democracy (New York: Praeger, 1960), pp. 34–49.\" href=\"#footnote71_atfiuxn\">71</a></p>\n<p>Say and Dunoyer had been major spokesmen for the analysis which defined liberty in the terms which Saint-Simon and the Saint-Simonians condemned. This is of special interest in view of the criticism which Benjamin Constant made of this article by Dunoyer.</p>\n<p>Constant's response,<em> <em>De M. Dunoyer et de quelques-uns de ses ouvroges</em></em>,<a class=\"see-footnote\" id=\"footnoteref72_kcobn5o\" title=\"Benjamin Constant, \"De M. Dunoyer et de quelques-uns de ses ouvrages\", in De la Perfectibilité de l'Espèce humaine (Lausanne: Éditions L'Age D'Homme, 1967), pp. 66–95; Benjamin Constant, Mélanges de littérature et de politique (Paris: Pichon et Didier, 1829), pp. 128–162.\" href=\"#footnote72_kcobn5o\">72</a> was included in the collection of essays,<em> <em>Mélanges</em></em>, which Constant had published in 1829 in preparation for his unsuccessful candidacy for the <em><em>Académie</em>. </em>Pierre Deguise has commented on Constant's criticism of Dunoyer:<a class=\"see-footnote\" id=\"footnoteref73_wy448qo\" title=\"Pierre Deguise, \"Introduction\", Benjamin Constant, De La Perfectibilité de l'Espèce humaine (Lausanne: Éditions L'Age D'Homme, 1967), pp. 9–34.\" href=\"#footnote73_wy448qo\">73</a></p>\n<p class=\"indent2\">With <em>De M. Dunoyer et de quelques-uns de ses ouvrages</em>, Constant undertook to defend his ideas against those of others. In truth, Charles Dunoyer was not at all an enemy. A man of the liberal Left, as was himself, he had been motivated by an order to defend the freedom of the press equal to that of Constant. . .</p>\n<p class=\"indent2\">When he was obliged to renounce the publication of his review after the reaction which followed the assassination of the duc de Berry, he had turned more of his attention to political economy. He taught at the Athénée, where Constant had lectured on constitutional theory as well as on religion . . .</p>\n<p class=\"indent2\">Why then this criticism? Why, despite his eulogies on detail, this hostility of Constant who recognized in Dunoyer a companion in his battles? First he had been personally caught as one side in the work and he had to respond. Dunoyer saw in the industrial society the milieu most favorable to liberty. . . He then reproached Constant, along with Rousseau, Chateaubriand and also some ultra-royalists, for their mistrust and even their contempt for the development of civilization which they accused of depraving mankind. He noted a passage of the first volume of<em> <em>De la Religion</em> </em>where Constant wrote: \"Once before the human species seemed plunged into the abyss. Then also a long civilization had enervated it. Each time that mankind arrived ai an excessive civilization, it appeared degraded for several generations\" (Rel. I, 236). Constant was so much the more sensitive to this accusation, as he had felt himself placed in contradiction with himself. How is it possible to think that civilization is able to corrupt, when one believes with all one's strength in perfectibility?</p>\n<p class=\"indent2\">Adroit in defending himself, he protests that he had never believed in intellectual degradation by material progress. It would only be a temporary retreat from perfecting when an excess of civilization is able to enervate spirits and soften energies. Degradation can only be transitory.</p>\n<p class=\"indent2\">Nevertheless, why had he placed so much effort in this refutation . . . if Dunoyer had not hit the nail on the head? . . . Is it not strange that in this eternal conflict . . . which, in the midst of the eighteenth century, came to oppose Voltaire against Rousseau, a common nostalgia for simplicity, for patriarchal morals, is found among two writers, both from the shores of Lake Léman? . . . Constant felt for people furthest from the state of industrial wealth a sympathy nearly equal to that of Tacitus in another age for the Germans. Are these peoples not those who know best how to defend their freedom? The Russians and the Spanish against Napoleon, the Greeks against the Turks? Does one not divine behind these rude peasants, inheritors of ancient virtues, who rise up in arms to defend their independence, the shadow of William Tell?</p>\n<p class=\"indent2\">. . . Dunoyer never goes as far as Bentham, but Constant is unable to accept a theory which does not make liberty and right a first given of human nature, as he had made it likewise for religious sentiment. And then, fundamentally, the economist collides with the habits of political thought. \"Politics as a science of government has been transcended\", wrote Dunoyer; and he intended to substitute for it a study, according to him more scientific, which we call today \"political economy\". He did not seek the best form of government, but \"the mode of existence most natural to our species, more favorable to its progress\"; in place of presenting liberty \"as a dogma\", he studies it \"as a result\". It was insufficient to say as did the dogmatic publicists that \"it is necessary that peoples should be free\"; it is necessary to seek \"how they will be free\". In summation, from the point of view of political theorist and moralist who starts from principles, Dunoyer wished to substitute a purely experimental approach that he judged more scientific. The foundation of things appeared to him not political institutions, but the social mechanism . . . Constant is then very naturally brought to enter the campaign against the Saint-Simonians, He did it at the end of his essay in complimenting Dunoyer on distinguishing himself from a \"new sea\", the disciples of Saint-Simon whom he did not name. He took out with vigor against those who \"preached servility to authority\", wishing \"to found a new industrial papism\"; seeing \"anarchy in all difference of opinion\", and invoking a new spiritual power.<a class=\"see-footnote\" id=\"footnoteref74_irym2s5\" title=\"Ibid., pp. 15–20.\" href=\"#footnote74_irym2s5\">74</a></p>\n<p>Constant expressed the highest praise for Dunoyer's writings in the <em>Censeur europ<em>é</em>en </em>as well as his conflicts with the government to vindicate civil liberties: \"The germs deposited, in 1814, in the<em> <em>Censeur européen</em></em>, have developed and fructified\". While displeased by Dunoyer's criticism of him in<em> <em>L'Industrie et la Morale</em></em>, on which his essay concentrated, Constant made reference to Dunoyer's article in the <em><em>Revue encyclopédique</em></em> on the origins of <em>industrialisme</em>. Before confronting the Saint-Simonians, Constant contributed his observations briefly on the originality of Dunoyer in the development of<em> industrialisme</em>. Constant's failure even to mention Saint-Simon and his deprecatory references to the Saint-Simonians stemmed from Constant's not taking Saint-Simon seriously as a thinker. Dunoyer he took seriously as a fellow radical theorist and philosophical opponent. As the precursor of Dunoyer's elaboration of<em> <em>industrialisme</em></em>, Constant sought to mute and blur the differences by making his own ideas part of the general intellectual milieu. Dunoyer had stated the differences with clarity and in detail; Constant's vague reflections and his introduction of Sismondi, whose book was published too late to be relevant, obscured the particular issues.<a class=\"see-footnote\" id=\"footnoteref75_53kum46\" title=\"Constant, \"'De M. Dunoyer\": ibid., pp. 66–68, 90. Fourteen years before, Constant had published his De L'Ésprit de Conquète, in which he discussed the differences between the political freedom of the ancients and the individual freedom of the moderns. Constant repeated this in his brochure De la liberté des Anciens comparée à celle des modernes in 1819 Dunoyer's association in L'lndustrie et la morale, pp. 93–44, of Constant with Rousseau and Chateaubriand as a critic of civilization and proponent of primitive levels of civilization, is highlighted by their diverse views of the meaning of the Greek struggle for independence from the Turks. For Constant, \"it was in the barbarity of the Klephtes that Greece found a safeguard against the barbarity of the Turks\", \"De M. Dunoyer\", ibid., p. 75. The Klephtes were the Greek brigands, who from their refuge in the northern mountains, maintained the independence of Greek political movement and culture during the Turkish occupation, and who were active in the revolution. Dunoyer had been impressed that the Greeks were more industrious than the Turks, through their activity in commerce, crafts and especially seafaring, and thus, by the revolt of the Greek sailors who formed the vast majority of the Turks' navy, decisively shifted control in the Aegean to the Greek revolution. L'lndustrie et la morale, pp. 101–102. Constant was also distressed by Dunoyer's emphasis that it was the fault of the people that they suffered the government's oppression; if people had a stronger sense of morality and self-interest they would not have experienced government's oppression or would long since have overthrown it. The Revue encylopédique in January, 1825 had raised as a criticism of Dunoyer's lectures on industrialisme at the Athénée that industrial life makes ruling easier for the governors. Rude, Stendhal, p. 114. Constant disagreed with Dunoyer's view that governments were the reflection of the people's situation, and that governments will be overturned when the people achieve a sufficiently high state of development. Constant emphasized that governments were the result of conquest, of elements of the past, and of stagnation; and that the opposition between peoples and governments was the significant thing. Dunoyer's severity upon the people seemed to relieve the governments of criticism: \"This new principle is necessary to examine: all which discredits peoples is avidly gathered by government, and against the intention of M. Dunoyer, the oppressive authorities will seize possession easily of that part of his system\", \"De M. Dunoyer\", ibid., p. 68.\" href=\"#footnote75_53kum46\">75</a></p>\n<p>Specifically, in his \"<em>Historical notice on <em>industrialisme</em></em>\", Dunoyer said of Constant:</p>\n<p class=\"indent2\">I must say, to the glory of M. Benjamin Constant, that he is the first writer, at least to my knowledge, who had indicated the goal of the peoples of our time, and who also recognized the true object of politics. In his work on <em>I'esprit de conquête considéré dans ses rapports avec la civilisation européenne</em>, which had been published abroad in I813 . . . Constant wrote: \"While each people formerly formed an isolated family, a born enemy of other families, a mass of peoples now exists under different names and under various kinds of social organization, but homogeneous by its nature. It is sufficiently strong to have nothing to fear from the hordes that are still barbarian: it is sufficiently civilized that war will be a burden to it. The uniform tendency is towards peace . . . We have arrived at the epoch of commerce, the epoch which ought necessarily to replace what preceded . . .War was the savage impulse; commerce is the civilized calculation. It is clear that the more the commercial tendency dominates, the more the warrior tendency becomes weak. <em>The unique aim of modern nations is tranquility, with tranquility comfort, and as the source of comfort, INDUSTRY.</em> War each day becomes a less efficacious means to attain this aim. It does not offer to individuals and to nations benefits which equal the results of peaceful work and regular exchange\" (Chapter II). These statements are not absolutely irreproachable. M. Benjamin Constant, in saying that comfort is the unique aim of modern nations, seems to indicate that men have only physical needs to satisfy. The aim of modern nations is comfort; with comfort, dignity, consideration, glory, renown: and, as the source of all these goods, the moral and intellectual practice of all useful professions, or, as expressed by M. Benjamin Constant, <em>industry</em>, which embraces in effect all the useful professions of society. But, although the proposition of the able writer perhaps lacks exactitude in form, it was nonetheless very important as a foundation. It was the first time that anyone showed briefly the difference which exists between the ancients and the moderns; it was, the first time that anyone indicated to the modern peoples that they direct their activity towards industry. This observation, which now seems trivial, was than entirely novel, and I believe that I remember that people were very much struck by it.<a class=\"see-footnote\" id=\"footnoteref76_ge05i7k\" title=\"Dunoyer, \"Historical notice on industrialisme\", pp. 175–176.\" href=\"#footnote76_ge05i7k\">76</a></p>\n<p>Dunoyer emphasized the undeveloped nature of Constant's attitudes on industry and the impact of its growth on civilization. Constant had not made any detailed analysis of the positive aspects of industrial progress, and Dunoyer had particularly noted Constant's belief that the improvement of material conditions would cause the retrogression of mankind and interfere with human perfectibility. Dunoyer discussed the failure of Constant to develop his attitudes on the role of industry into a philosophy such as <enm><em>industrialisme</em>. Constant, like the two other authors whose works contributed to Dunoyer's and Comte's development of <em>industrialisme</em>, Montlosier, the historian, and Say, the political economist, did not see the deeper implications of their ideas. According to Dunoyer,</enm></p>\n<p class=\"indent2\">No writing of M. Benjamin Constant following the <em>Esprit de conquête</em>, has shown that he appreciated the political consequences of his observation that the peoples of our day direct their activity towards industry; he had not occupied himself with industrial society; he has not investigated how that society lives, fallowing by what laws it prospers and how it ought to be constituted in order to develop itself.<a class=\"see-footnote\" id=\"footnoteref77_5u8rpwj\" title=\"Ibid., pp. 178–179.\" href=\"#footnote77_5u8rpwj\">77</a></p>\n<p>The <em>Esprit de conquête</em> was drawn, even to its exact words, from the studies written during the intellectually creative end of the eighteenth and beginning of the nineteenth century period in the life of Constant, which are contained in the notebooks known as the <em>Oeuvres Manuscrites de 1810</em>. These unpublished manuscripts, in seven volumes of three to four hundred pages each, were a source for some of Constant's later articles as well as abbreviated and more acceptable (less radical) versions of the original essay.<a class=\"see-footnote\" id=\"footnoteref78_g2s5w6s\" title=\"O. Pozzo de Borgo, in Constant, Écrits, I, 204–206. Constant's Oeuvres Manuscrites de 1810 were acquired by the Bibliothèque nationale in 1961.\" href=\"#footnote78_g2s5w6s\">78</a></p>\n<p>Constant's <em>De la Perfectibilitié de l'Espèce humaine</em>, of which the <em> De M. Dunoyer et de quelques-urn de ses ouvrages</em> was a continuation, besides influencing other of his writings was partially reproduced in his <em>Mélanges</em>. The original essay had been composed about 1803–1804 as Constant's introduction to an extract from Herder's <em>Ideas on the Philosophy of History</em>. Perfectability had been treated in Mme. de Stael's <em>La Littérature considérée dans ses rapports avec les institution sociales</em> (1800). Constant was a friend of a number of the Ideologues who were concerned with this topic. Georges Cabanis (1757–1808) had published a \"lettre sur la Perfectibilite de I'esprit humain\". Claude Charles Fauriel (1772–1844), who was a friend both of Constant and Dunoyer, had reviewed Mme. de Stael's book for <em>La Décade</em>, which led to his friendship with her and Constant. Fauriel was a close friend to Mme. de Condorcet (1764–1822), who with Cabanis, who was married to her sister, had published the complete works of Condorcet in 1801–1804. The Marquis de Condorcet (1743–1794), through his <em>Equisse d'un tableau historique des progrés de l'esprit humain</em>, had a major impact on the thinking of the Ideologues on this topic.<a class=\"see-footnote\" id=\"footnoteref79_cnhmf6d\" title=\"Constant, Mélanges, pp. 387–415; Pierre Deguise, \"Introduction\", in Constant De la Perfectibilité, pp. 11–14; O. Pozzo de Borgo, pp. 234–235; Picavet, Les Idéologues, passim; Kitchin, La Décade, pp. 127, 148–149. Dominique Bagge, Les Idées politiques en France sous la Restauration (Paris: Presses Universitaires de France, 1952), \"Le courant de pensée Individualiste\", pp. 25–92, especially p. 48.\" href=\"#footnote79_cnhmf6d\">79</a></p>\n<p>The immediate source for Constant and through him, for Dunoyer, was William Godwin. Constant had been in close contact with intellectual developments in England from the friendships he had made during his eighteen months at the University of Edinburgh in 1783–1784. One of his continuing friendships was with James Mackintosh (1765–1832), who wrote in 1791 the <em>Vindiciae Gallicae</em>, in reply to Burke's <em>Reflections on the French Revolution</em>; Mackintosh's 1799 Lincoln's Inn lectures on the law of nature and nations, and his defense in 1803 of a French political refugee tried at Bonaparte's insistence for libel of the First Consul, increased his fame. Godwin's <em>Inquiry concerning Political Justice, and its Influence on General Virtue and Happiness</em> (1793) was read widely by political theorists in France. Godwin had dispatched a copy to the Convention by the hand of John Fenwick in a letter of February 15, 1793, but the outbreak of war soon afterward may have contributed to the fact that there was no French translation of the work. There did not seem to be any reviews of <em>Political Justice</em> in France, although the many reviews and comments in English publications were read in France. There was a detailed review of Godwin's 1794 novel, <em>Caleb Williams</em> (Paris, 1796) in <em>La Décade</em> (January 30, 1796, volume 8, pp. 413–420), which emphasized Godwin's discussion of prisons and his principles of justice. In 1795, Constant's uncle, Samuel Constant, had published a French translation of <em>Caleb Williams</em> in Geneva. Constant corresponded with Godwin in 1795–1796 concerning the former's desire to translate <em>Political Justice</em>. Constant, in 1799, announced the forthcoming publication of his translation of Godwin's <em>Political Justice</em>, but political events then and in the future caused the indefinite postponement of its publication. But the impact of Godwin's ideas was evident in the writings of Constant in that period and in his speeches at the Tribunate before his exclusion in 1802.<a class=\"see-footnote\" id=\"footnoteref80_rcndfst\" title=\"Burton R. Pollin, Godwin Criticism: A Synoptic Bibliography (Toronto: University of Toronto Press, 1967), pp. 54–55, numbers 360R–363R, including La Décade reviews of Godwin's Fleetwood and St. Leon, and p. 656, for editions of Political Justice (London, 1793, 1796, 1798; Dublin, 1793, 1796; Philadelphia, 1796; and Wurzburg, 1803); Pollin, \"Godwin's 'Letters of Verax'\", Journal of the History of Ideas, XXV, 1964, pp. 260–270.\" href=\"#footnote80_rcndfst\">80</a></p>\n<p>Constant himself had taken up the challenge to Burke's attacks on the French Revolution in <em>Des Réactions Politiques</em> (An V). In July, 1799 Constant published <em>Des suites de la contrerévolution de 1660 en Angleterre</em>, at the conclusion of which he announced his translation of Political Justice, which would be accompanied by a \"profound examination\" of the principles \"suitable to consolidate liberty\". Constant wished to publish the translation of <em>Political Justice</em> to counter the dictatorial and arbitrary government of the post-Fructidor Directory as well as the similar measures of those looking to return to the Terror of 1793, because Godwin showed that the true liberty to which these men claim to be dedicated is based on absolute liberty—the absence of all violence. The <em>Oeuvres Manuscrites de 1810</em> contains three notebooks with 576 pages of translation of <em>Political Justice</em>. In addition, the seventh notebook contains Constant's \"De Godwin, de ses principes et de son ouvrages sur la Justice politique\", which was partially published as an essay in April 1817. Godwin's absolute reliance on the voluntary element in all relations, and his basing of the absolute autonomy of the individual on intellectual independence, was much admired by Constant and was their \"kernel of anarchism\". Constant's individualist anarchism led him to oppose Rousseau's <em>Social Contract</em> as a surrender of individual rights, since it opened the way to arbitrary actions by the nation against a single individual. Constant, !ike Godwin, was influenced by Adam Smith's concept of \"natural order\", and he sought the replacement of public, feudal property by private, commercial and industrial property, and the destruction of public institutions which he viewed as liberation.<a class=\"see-footnote\" id=\"footnoteref81_736j3s8\" title=\"O. Pozzo di Borgo, I. 121–133, 234–235, 239–241; Pollin, Godwin Criticism, pp. 104-105, 199; Pollin, Education and Enlightenment in the Works of William Godwin (New York: Las Americas, 1962), pp. 1, 17–18. Harold Nicolson, Benjamin Constant (Garden City, New York: Doubleday & Co., 1949), pp. 285–289. The influence of Godwin on Constant has been noted by: Elizabeth W. Schermerhorn, Benjamin Constant (2nd printing, New York: Haskell House, 1970), pp. 179, 188; Georges de Lauris, Benjamin Constant el les idées libérales (Paris: Arthur Rousseau; 1903), p. 22. Charlotte T. Muret, French Royalist Doctrines since the Revolution (New York: Columbia University Press, 1933), p. 72, notes only the parallels between Godwin and Constant's individualist anarchism.\" href=\"#footnote81_736j3s8\">81</a></p>\n<p>Godwin avoided Turgot's concept of the \"perfect man\", since the idea of the ability to become perfect was in opposition to the idea of perfectibility, of continual improvement. Condorcet stressed progress based on the \"improvement of instruments which increase the power and direct the exercise of these facilities\". Condorcet's emphasis on the role in progress of education, invention and the applied arts and sciences, appears in his <em>Life of Voltaire</em> which Godwin used (<em>Political Justice</em> was published before the <em>Equisse</em>). A clear influence was the Ideologue historian, Constantin François Volney's <em>The Ruins, or Survey of the Revolutions of Empires</em> (1791) which was translated into English by James Marshal, Godwin's amanuensis. Volney (1757–1820) posited that public happiness could be only the sum of individual happinesses, and he viewed natural rights as basic to mankind's progress. Godwin shared Volney's utilitarianism and viewed technological progress and the rise in living standards due to increase in knowledge as the progress of civilization. Godwin's favorable view of labor-saving machinery which increases comfort and material goods paralleled the views of Dunoyer and Herbert Spencer on the essence of the progress of civilization.<a class=\"see-footnote\" id=\"footnoteref82_zftxck0\" title=\"Crocker, Nature and Culture, pp. 453; Pollin, Education and Enlightenment, pp. 4, 62–64, 95–98; C.F. Volney, The Ruins (Exeter: Joseph Mann, 1823), pp. 38–39, 93–104.\" href=\"#footnote82_zftxck0\">82</a></p>\n<p>Unlike Rousseau, but like the Physiocrats earlier and Say and Dunoyer later, Godwin considered the golden age or stateless society to be in the future and not in the past of mankind. For Godwin, as man's knowledge increases and more complex relationships develop, the less need is there for the role of government, thereby requiring the \"dissolution of government\". Godwin advocated extreme decentralization, which like Dunoyer's, could be called Rousseauist or primitivist if they had viewed government as having any legitimate role. But, Godwin and Dunoyer saw the progress of society in inverse proportion to the powers of government. The dissolution of government is the perfection of the complex and developed society.<a class=\"see-footnote\" id=\"footnoteref83_s6gr2ra\" title=\"Cf. above p. 5 for the Physiocrats' and Say's view of the golden age being in the future, and p. 31 for Dunoyer's extreme decentralism; Pollin, Education and Enlightenment, pp. 76–78, 83–89.\" href=\"#footnote83_s6gr2ra\">83</a></p>\n<p>Albert Schatz's <em>L'lndividualisme</em>, in introducing Dunoyer's definition of liberty, underlines the principle that the government and individuals in society progress in inverse proportion to each other; the dissolution of government is the necessary goal of morals and industry, of civilization.</p>\n<p class=\"indent2\">Liberalism tends then to create between the State and the individual a radical antagonism which is not in the classical doctrine and which makes the State and the individual two forces inversely proportional to each other. In consequence, there is in liberalism a tendency rather potential than achieved, to retire the State from the totality of economic role: we will see this born in the fulfillment that Dunoyer supplied to the classical doctrine, ending finally in a form of anarchism more or less disguised.<a class=\"see-footnote\" id=\"footnoteref84_w9xup9l\" title=\"Schatz, L'Individualisme, p. 197.\" href=\"#footnote84_w9xup9l\">84</a></p>\n<p>Schatz notes that Dunoyer's thinking influenced the development of Proudhon's social theory. Dunoyer's analyses of liberty led him to an emphasis upon the roles of competition and voluntary association in the progress of civilized society. Dunoyer completed his analysis through applying these roles to the production of security and to the development of the concept of competing voluntary associations providing for the production of security. Insurance societies and companies competing in the production of security for their members or subscribers was the culmination of this completion of the dissolution of government.<a class=\"see-footnote\" id=\"footnoteref85_8mhp1cw\" title=\"Ibid., pp. 490, 500.\" href=\"#footnote85_8mhp1cw\">85</a></p>\n<p>Schatz, in his chapter \"De l'individualisme anti-étatiste à l'individualisme anarchiste\",<a class=\"see-footnote\" id=\"footnoteref86_cw1bube\" title=\"Ibid., pp. 472–576.\" href=\"#footnote86_cw1bube\">86</a> discussed the expression by Gustav de Molinari, Dunoyer's principal disciple, of civilized society's production of security:</p>\n<p class=\"indent2\">that limited function. M. de Molinari removed from the government. In a study <em>De la production de la Sécurité</em> (<em>Journal des Économistes</em>, 15 fevrier 1849, p. 277), he asked why this industry had made room only for a monopoly. Had one not seen in Spain the Sainte-Hermandad. In Flanders and Italy the societies of artisans or others charging for furnishing security? Do there not exist in England and America private constables and in the Far West lynchers without official mandate? Regression, one asks? Not at all. On the contrary, progress, and more in conformity to liberal orthodoxy.</p>\n<p class=\"indent2\">. . . In the social state, the satisfaction of needs exists due to the division of labor and to exchange. The need of security, the effect of the insufficiency of justice, is one of those. From which there appear certain establishments destined to guarantee to each the peaceable possession of his person and of his goods, and that one calls \"governments\".</p>\n<p class=\"indent2\">But, if all needs are satisfied better by free competition, would Dunoyer be able to set aside this need of security? <em>A priori</em>, such a derogation contrary to the liberal faith is to be considered evil. Also, if the industry of security has been organized as a monopoly, it is easy to discover the reason. Respondant to a need which is after that of food the most essential, it puts face to face weak consumers and strong producers, by very definition. The latter imposes the monopoly of security on the former. What are the results of that? One saw in England a governing company, a feudality having an hereditary council of administration, the House of Lords, fix as it was convenient to them, under the name of taxation, the price of security.<a class=\"see-footnote\" id=\"footnoteref87_w8glpho\" title=\"Ibid., pp. 488–489. Dunoyer through de Molinari had an influence on American industrialist anarchists; Schatz notes that Benjamin R. Tucker used some of their concepts. Ibid., p. 514.\" href=\"#footnote87_w8glpho\">87</a></p>\n<p>But Dunoyer's concern for the analysis of the absolutely free market was interrupted by the events of the July Days of the 1830 Revolution. With the establishment of the July Monarchy (1830–1848), Dunoyer embarked on his seven year tenure as prefect, first at Allier (1830), and then at Somme (1833–1837). On his retirement, which coincided with the death of Charles Comte, he became a <em>conseiller d'état en service ordinaire</em> in 1838. In 1835, he had published a <em>Mémoire à consulter sur quelques unes des principales questions que la Révolution de juillet à fait naître</em>. In 1840 was published a study he had undertaken of the English railways with reference to railway construction in France: <em>Esprit et méthodes comparés de I'Angleterre et de la France dans les enterprises de travaux publics et en particular de chemins de fer; conséquences practiques tirées pour notre pays de ce rapprochement</em>.</p>\n<p>Dunoyer was appointed <em>administrateur général</em> at the Bibliothèque Nationale (Bibiothèque rovale. February–June, (1839) by the minister of. . . . public instruction in the Molé cabinet, the comte de Salvandy, who had been an associate of Decazes in 1819–1820. However, this was a period of cabinet crises due to the increasing conservatism of the government, which may have contributed to Dunoyer's retirement from active administration. Dunoyer's appointment to any position of ideological importance such as the Bibliothèque Nationale occasioned strong opposition from the conservatives; the mounting protests of his conservative subordinates forced Dunoyer to resign his office of <em>administrateur général</em> after a few months. He did publish <em>La bibliothèque du roi</em> (Paris, 1839). Thereafter, he returned to his analyses of the free market, and concentrated on social and economic theory. From the reestablishment of the Academy of Moral and Political Sciences Dunoyer was an active member, and in 1842 he was instrumental in the founding of the Société d'économie politique. He contributed to its <em>Journal des économistes</em>, as well as to the <em>Journal des debats</em>. In 1845 he published a completely revised and enlarged edition of his earlier major studies under the title: <em>De la liberté du travail, ou simple exposé des conditions dans lesquelles les forces humaines s'exercent avec le plus puissance.</em></p>\n<p>The Revolution of 1848 was a grave disappointment to Dunoyer. He strongly denounced the policies of Lamartine and published <em>La révolution du fevrier, 1848</em> (Paris, 1849). But, he continued to sit on the <em>conseil d'état</em>, and took satisfaction from the free trade campaign that Frederic Bastiat conducted from his seat on the Left of the chamber of deputies. Bastiat in 1825 had written that he had studied only four works on economics: Smith, Say, Destutt de Tracy and the <em>Censeur</em>. The coup d'état of December 2, 1851 caused Dunoyer to resign his position on the <em>conseil d'état</em> in protest. He continued to write for the <em>Journal des économistes</em> and to participate actively in the sessions of the <em>Academie des sciences morales et politiques</em>. There he engaged in debates, such as against Victor Cousin on the role of social economy and morals, in 1852.<a class=\"see-footnote\" id=\"footnoteref88_s916zxx\" title=\"Charles Turgeon, \"Des prétendues richesses immatérielles\", Revue d'économies politique (1889), III, pp. 230–231, and Turgeon, \"La conception matérialiste de l'histoire d'aprés Marx et Engels\", ibid., (1911), XXV, pp. 307–310\" href=\"#footnote88_s916zxx\">88</a> Finally, he wrote a two-volume work, <em>Le second empire et une nouvelle restauration</em> (London, 1864 and 1871) which was published posthumously by his son, Anatole, who was professor of political economy at Berne during the second empire, and who returned to France in 1873 to become a master of requests of the <em>conseil d'état</em>. Charles Dunoyer had died on December 4, 1862.</p>\n\n<ul class=\"footnotes\"><li class=\"footnote\" id=\"footnote1_i3nb9yw\"><a class=\"footnote-label\" href=\"#footnoteref1_i3nb9yw\">1.</a> The <em>Décade </em>was suspended in 1807.</li>\n<li class=\"footnote\" id=\"footnote2_drbm41g\"><a class=\"footnote-label\" href=\"#footnoteref2_drbm41g\">2.</a> Joanna Kitchin, <em>La Décade</em> (1794–1807), <em>Un Journal \"Philosophique\"</em>, (Paris: Lettres Modernes, 1965), pp. 3–10, 179–184, 200. The success of the <em>école centrale</em> of the departrnent of Lot, from the Ideologue point of view, was noted in an article on education in <em>La Décade</em> (October 22, 1801, p. 161) by one of its co-editors, Pierre-Louis Ginguené. Charles Hunter Van Duza, <em>Contribution of the Ideologues to French Revolutionary Thought</em> (Baltimore: The Johns Hopkins Press, 1935, ), pp. 141–142.</li>\n<li class=\"footnote\" id=\"footnote3_a0wbil2\"><a class=\"footnote-label\" href=\"#footnoteref3_a0wbil2\">3.</a> Kitchin, <em>La Décade</em>, pp. 110–136, 198; Georges Gurvitch,<em> Industrialisation et Technocratie</em> (Paris: Librarie Armand Colin, 1949), p. 10; Gurvitch, <em>L'Idée du Droit Social Notion et Système du Droit Social, Histoire de dectrine dupuis le XVII sieclé jusqu à la fin du XIX, sieclé.</em> (Paris: Librairie du Recueil, Sirey, 1931), pp. 236–260, 272.</li>\n<li class=\"footnote\" id=\"footnote4_1kcglhh\"><a class=\"footnote-label\" href=\"#footnoteref4_1kcglhh\">4.</a> Ernest Teilhac,<em> L'Oeuvre économique de Jean Baptist Say</em> (Paris: Librairie Felix Alcan, 1927), pp. 176, 164. Lester G. Crocker, <em>Nature and Culture, Ethical Thought in the French Enlightenment</em> (Baltimore: The Johns Hopkins Press, 1963), pp. 47, 444–448, 482–495, and 219–325 (\"The Utilitarian Synthesis\"); Crocker, <em>Rousseau's Social Contract: An Interpretative Essay</em> (Cleveland: Press of Case Western Reserve University, 1968), <em>passim</em>; Guy H. Dodge, \"Introduction\", <em>Jean-Jacques Rousseau: Authoritarian or Libertarian?</em> (Lexington, Mass.: D.C. Heath, 1971), pp. vii–xvii; Th. Ferneuil, \"Socialisme et Individualism\", <em>Revue d'économie politique </em>(1889), III, 51; R. Fargher, \"The Retreat from Voltarism, 1880–1815\", <em>The French Mind, Studies in honour of Gustave Rudier</em> (Oxford: Clarendon Press, 1952), pp. 220–237; Mario Einaudi, <em>The Physiocratic Doctrine of Judicial Control</em> (Cambridge: Harvard University Press, 1938), <em>passim</em>.</li>\n<li class=\"footnote\" id=\"footnote5_9k51853\"><a class=\"footnote-label\" href=\"#footnoteref5_9k51853\">5.</a> Durnad Echeverria, <em>Mirage in the West, A history of the French Image of American Society to 1815 </em>(Princeton, New Jersey: Princeton University Press, 1957), pp. 275, 215, 222–224, 232; Kitcin, <em>La Décade</em>, pp. 194–195.</li>\n<li class=\"footnote\" id=\"footnote6_691xr8f\"><a class=\"footnote-label\" href=\"#footnoteref6_691xr8f\">6.</a> Teilhac, <em>Say</em>, p. 176; Say, <em>Traité d'economie politique</em> (Paris, 1803), I, 393.</li>\n<li class=\"footnote\" id=\"footnote7_0zwjw3z\"><a class=\"footnote-label\" href=\"#footnoteref7_0zwjw3z\">7.</a> Teilhac, <em>Say</em>, pp. 176–177, 193, 68, 79.</li>\n<li class=\"footnote\" id=\"footnote8_6rjm607\"><a class=\"footnote-label\" href=\"#footnoteref8_6rjm607\">8.</a> <em>Ibid</em>., 231–233.</li>\n<li class=\"footnote\" id=\"footnote9_8z0u58a\"><a class=\"footnote-label\" href=\"#footnoteref9_8z0u58a\">9.</a> <em>Ibid</em>., 228.</li>\n<li class=\"footnote\" id=\"footnote10_0umww52\"><a class=\"footnote-label\" href=\"#footnoteref10_0umww52\">10.</a> Kitchin, <em>La Décade</em>, pp. 197–198, 146.</li>\n<li class=\"footnote\" id=\"footnote11_f2yheqw\"><a class=\"footnote-label\" href=\"#footnoteref11_f2yheqw\">11.</a> <em>Ibid</em>., pp. 197–145–146.</li>\n<li class=\"footnote\" id=\"footnote12_s61rbmg\"><a class=\"footnote-label\" href=\"#footnoteref12_s61rbmg\">12.</a> Teilhac, <em>Say</em>, pp. 112–120.</li>\n<li class=\"footnote\" id=\"footnote13_9gxp4ps\"><a class=\"footnote-label\" href=\"#footnoteref13_9gxp4ps\">13.</a> <em>Ibid</em>., pp. 102, 137.</li>\n<li class=\"footnote\" id=\"footnote14_5di8qut\"><a class=\"footnote-label\" href=\"#footnoteref14_5di8qut\">14.</a> <em>Ibid</em>., pp. 241, 243–244,</li>\n<li class=\"footnote\" id=\"footnote15_2cp22ol\"><a class=\"footnote-label\" href=\"#footnoteref15_2cp22ol\">15.</a> <em>Ibid</em>., pp. 24–26; Charles Comte, \"Notice historique sur la vie et les ouvrages de J.-B. Say\", <em>Mélanges...de J.-B. Say</em> (Paris: Chamerot, 1833), p. xi.</li>\n<li class=\"footnote\" id=\"footnote16_j8rrl24\"><a class=\"footnote-label\" href=\"#footnoteref16_j8rrl24\">16.</a> Teilhac, <em>Say</em>, p. 220.</li>\n<li class=\"footnote\" id=\"footnote17_xkx8atw\"><a class=\"footnote-label\" href=\"#footnoteref17_xkx8atw\">17.</a> Charles Almeras, <em>Odilon Barrot</em> (Paris: Éditions Xavier Mappus, 1950), pp. 22–24.</li>\n<li class=\"footnote\" id=\"footnote18_l2m1bup\"><a class=\"footnote-label\" href=\"#footnoteref18_l2m1bup\">18.</a> <em>Le Censeur</em>, volume I; the advertisement is bound at the beginning of the first volume.</li>\n<li class=\"footnote\" id=\"footnote19_jj224c1\"><a class=\"footnote-label\" href=\"#footnoteref19_jj224c1\">19.</a> Pierre Roboul,<em> Le Mythe Anglais dans la littérature française sous la Restauration</em> (Lille: Bibliothèque Universitaire, 1962), p. 377.</li>\n<li class=\"footnote\" id=\"footnote20_7bfarpb\"><a class=\"footnote-label\" href=\"#footnoteref20_7bfarpb\">20.</a> <em>Ibid</em>., pp. 101, 14–20, 60–65, 77–102.</li>\n<li class=\"footnote\" id=\"footnote21_x2o9pjd\"><a class=\"footnote-label\" href=\"#footnoteref21_x2o9pjd\">21.</a> <em>Ibid</em>., p. 115.</li>\n<li class=\"footnote\" id=\"footnote22_kgyxlot\"><a class=\"footnote-label\" href=\"#footnoteref22_kgyxlot\">22.</a> <em>Ibid</em>., 320–321.</li>\n<li class=\"footnote\" id=\"footnote23_3wd37ia\"><a class=\"footnote-label\" href=\"#footnoteref23_3wd37ia\">23.</a> <em>Ibid</em>., p. 320.</li>\n<li class=\"footnote\" id=\"footnote24_qr3fm8f\"><a class=\"footnote-label\" href=\"#footnoteref24_qr3fm8f\">24.</a> <em>Ibid</em>., p. 38; it is likely that Comte became acquainted with Bentham's works through the French translations by the Genevan, Pierre Etienne Dumont, who acted as Bentham's literary secretary. Dumont had made Bentham known to French-speaking readers by the translation and publication of the strictly laissez-faire <em>Manual of Political Economy in the Bibliothèque britannique</em> (Geneva, 1797–1798). Published in French through Dumont's editing were Bentham's <em>Traité de législation civile et penal</em> (1802) and <em>Théorie des peines el des récompenses</em> (1811), published in English only in 1825.</li>\n<li class=\"footnote\" id=\"footnote25_gp7wjxh\"><a class=\"footnote-label\" href=\"#footnoteref25_gp7wjxh\">25.</a> Eugène Hatin, <em>Histoire politique et littéraire de la presse en France. La presse moderne, 1789–1860. La presses sous la Restauration</em> (Genèva: Slatkine Reprints, 1967, Paris, 1859–1861), VIII, 82–86.</li>\n<li class=\"footnote\" id=\"footnote26_2as1xyz\"><a class=\"footnote-label\" href=\"#footnoteref26_2as1xyz\">26.</a> <em>Ibid</em>., pp. 41–46, 49–52, 71–75.</li>\n<li class=\"footnote\" id=\"footnote27_den07mi\"><a class=\"footnote-label\" href=\"#footnoteref27_den07mi\">27.</a> Benjamin Constant, <em>Mélanges </em>(Paris, 1829).</li>\n<li class=\"footnote\" id=\"footnote28_dwtwsys\"><a class=\"footnote-label\" href=\"#footnoteref28_dwtwsys\">28.</a> Hatin, <em>La Presse</em>, p. 127.</li>\n<li class=\"footnote\" id=\"footnote29_81agk0l\"><a class=\"footnote-label\" href=\"#footnoteref29_81agk0l\">29.</a> <em>Ibid</em>., p. 127.</li>\n<li class=\"footnote\" id=\"footnote30_r18d61d\"><a class=\"footnote-label\" href=\"#footnoteref30_r18d61d\">30.</a> <em>Ibid</em>., p. 281.</li>\n<li class=\"footnote\" id=\"footnote31_7is7ltj\"><a class=\"footnote-label\" href=\"#footnoteref31_7is7ltj\">31.</a> Ephraim Harpaz, \"Sur un Ecrit de Jeunesse d'Augustine Thierry\", <em>Revue d'historie littéraire de la France</em>, LIX, No. 3, p. 344. Also see <em>Des Journalistes et des journaux</em> (Paris, 1817), quoted in Hatin, <em>La Presse</em>, pp. 211–213.</li>\n<li class=\"footnote\" id=\"footnote32_ohdh6y1\"><a class=\"footnote-label\" href=\"#footnoteref32_ohdh6y1\">32.</a> Ibid., pp. 287–289. Perhaps as a result of his prosecutions, Dunoyer became increasingly active in behind-the-scenes radical political activity such as the election campaign for deputy by Lafayette in the fall of 1818: \"The successful candidate arrived in Paris at the beginning of November, 1818, accompanied by his friends Dunoyer and Victor de Broglie.\" Maurice de la Fuye and Emile Bameau, \"The Phase of Abortive Conspiracies\", <em>The Apostle of Liberty, a Life of La Fayette</em> (London: Thames & Hudson, 1956). pp. 243-245.</li>\n<li class=\"footnote\" id=\"footnote33_kmyrkf8\"><a class=\"footnote-label\" href=\"#footnoteref33_kmyrkf8\">33.</a> Hatin, <em>La Presse</em>, pp. 307–313; Alan B. Spitzer, <em>Old Hatreds and Young Hopes, The French Carbonari against the Bourbon Restoration</em> (Cambridge, Mass., Harvard University Press, 1971), pp. 33–35, 38, 212–215, 242.</li>\n<li class=\"footnote\" id=\"footnote34_nxqxe6w\"><a class=\"footnote-label\" href=\"#footnoteref34_nxqxe6w\">34.</a> Teilhac, <em>Say</em>, p. 50.</li>\n<li class=\"footnote\" id=\"footnote35_xw6zjb1\"><a class=\"footnote-label\" href=\"#footnoteref35_xw6zjb1\">35.</a> <em>Ibid</em>., pp. 49–50.</li>\n<li class=\"footnote\" id=\"footnote36_2n86tc8\"><a class=\"footnote-label\" href=\"#footnoteref36_2n86tc8\">36.</a> Spitzer, <em>Old Hatreds</em>, pp. 203–204.</li>\n<li class=\"footnote\" id=\"footnote37_po5zgpq\"><a class=\"footnote-label\" href=\"#footnoteref37_po5zgpq\">37.</a> <em>Ibid</em>., pp. 37–50; members of a committee indicted before the <em>Cours d'Assies</em>, on June 29, 1820, included Lafayette, Comte, and Barrot. Lafayette and others were acquitted, but Comle was judged guilty and was condemned to five years, in exile. Barrot visited Comte in exile both in Switzerland and England. Almeras. <em>Barrot</em>, pp. 23,38.</li>\n<li class=\"footnote\" id=\"footnote38_j6gqpwb\"><a class=\"footnote-label\" href=\"#footnoteref38_j6gqpwb\">38.</a> Spitzer, <em>Old Hatreds</em>, p. 205.</li>\n<li class=\"footnote\" id=\"footnote39_1rtwkqi\"><a class=\"footnote-label\" href=\"#footnoteref39_1rtwkqi\">39.</a> Auguste Comte commented on Charles Comte's arrival in Paris: \"Comte of the <em>Censeur </em>has returned a little while ago to Paris, where he will establish himself permanently. He has returned from his exile more prejudiced than ever in the bastard direction of political economy. He will undertake soon a book totally of the order of the day, to prove that all the theories which are not immediately applicable to industrial practice ought to be quickly abandoned and scorned. Here is a rational man to cause fear! It Is he who had written in his time that if astronomy was truly useful, individuals would know well how to pay for it and hence that it is necessary to suppress the Observatory\". This was written on November 24, 1825. Henri Gouhier, <em>La Jeuness d'Auguste Comte et la formation du positivisme</em>; tome III, <em>Auguste Comle et Saint-Simon</em> (Paris: Librairie Philosophique J. Vrin, 1941), pp. 330–331</li>\n<li class=\"footnote\" id=\"footnote40_erk1n2j\"><a class=\"footnote-label\" href=\"#footnoteref40_erk1n2j\">40.</a> Harpaz . \"Jeunesse d'Augustin Thierry\", p. 349; Almeras, <em>Barrot</em>, p. 98. On November 6. 1830 Comte Charles de Lameth denounced abuses of freedom of the press; Comte, <em>procureur du roi</em>, on November 9 asked Lameth to make known such works to the courts as were open to any citizen. Lameth claimed that Comte was seeking judicial control over legislative statements. The chamber named a committee headed by Antoine Vatimesnil, who as a prosecutor during the Restoration had never supported parliamentary privileges, but had been a major force in the prosecution of Dunoyer and Comte. While declaring that Comte's action had threatened the rights of the chamber and approving Lameth's refusal to accept Comte's request, Comte was excused on the basis of the circumstances and the declarations he had made. In opposition to the committee's conclusions, Benjamin Constant made his last speech in the chamber on November 19, 1830. Constant held that Comte had the right to request Lameth to submit any fact; Lameth had the right to refuse according to his conscience; and the chamber had not any right to judge Comte because it was not a power of the legislature. Benjamin Constant, <em>Écrits et discours politiques</em>, commentary by O. Pozzo de Borgo (Paris: Chez Jean-Jacques Pauvert,  1964), II, 160–169.</li>\n<li class=\"footnote\" id=\"footnote41_1ow4qwm\"><a class=\"footnote-label\" href=\"#footnoteref41_1ow4qwm\">41.</a> Hatin, <em>La Presse</em>, pp. 290–291.</li>\n<li class=\"footnote\" id=\"footnote42_hiruaky\"><a class=\"footnote-label\" href=\"#footnoteref42_hiruaky\">42.</a> Almeras, <em>Barrot</em>, pp. 37–38.</li>\n<li class=\"footnote\" id=\"footnote43_j9sg3cy\"><a class=\"footnote-label\" href=\"#footnoteref43_j9sg3cy\">43.</a> G. de Bertier de Sauvigny, \"Preface\", in Ephraim Harpaz, <em>L'École Liberale sous la Restauration, Travaux à l'Ethico-Politique</em> (Genèva: Librairie Droz, 1969), XVI, ix; M. Girard, \"Les Liberaux des Gauche ou Independents de 1814 à 1824\",<em> Le Libéralisme en France de 1814 à 1848: Doctrine et mouvement</em> (Paris: Centre de Documentation Universitaire, 1966), I, 148–168; II, 151–158.</li>\n<li class=\"footnote\" id=\"footnote44_c3ppaer\"><a class=\"footnote-label\" href=\"#footnoteref44_c3ppaer\">44.</a> Albert Schatz, \"Ch. Dunoyer et la Définition de la Liberté\", <em>L'lndividualisme économique et social </em>(Paris: Librairie Armand Colin, 1907), pp. 196–215; Gaston Richard, \"Le philosophie et L'individualisme économique: l'école positiviste. Ses Origines\", <em>La question sociale et Ie mouvemenl philosophique au XIX siècle</em> (Paris: Librairie Armand Colin, 1914). pp. 97–119; René Gonnard, \"L'lndustrialisme: J.-B. Say\", and \"Dunoyer\", <em>Histoire des Doctrines Économiques</em> (Paris Nouvelle Librarie Nationale, 1922), II, 252–264, 278–283.</li>\n<li class=\"footnote\" id=\"footnote45_tki8dmu\"><a class=\"footnote-label\" href=\"#footnoteref45_tki8dmu\">45.</a> Fr. Picavet, <em>Les Ideologues</em> (Paris: Felix Alcan, 1891), pp. 334–409, 419–422,479–489</li>\n<li class=\"footnote\" id=\"footnote46_12kdlr8\"><a class=\"footnote-label\" href=\"#footnoteref46_12kdlr8\">46.</a> Roger Henry Soltau, <em>French Political Thought in the 19th Century</em> (New York: Russell & Russell, 1959), p. 130; Guido de Ruggiero, <em>The History of European Liberalism</em> (trans. R.G. Collingwood) (Boston: Beacon Press, 1959), p. 187; on Dunoyer and <em>Censeur</em>, <em>ibid</em>., pp. 172–173, 453.</li>\n<li class=\"footnote\" id=\"footnote47_r6uj8sm\"><a class=\"footnote-label\" href=\"#footnoteref47_r6uj8sm\">47.</a> Schatz, <em>L'Individualisme</em>, pp. 210–211.</li>\n<li class=\"footnote\" id=\"footnote48_hotfnnc\"><a class=\"footnote-label\" href=\"#footnoteref48_hotfnnc\">48.</a> Henri Michel, <em>L'Ideé de l'État, Essai critique sur l'histoire des théories sociales et politiques dupuis la révolution</em> (Paris: Hachette, 1895), p. 345.</li>\n<li class=\"footnote\" id=\"footnote49_6dataqw\"><a class=\"footnote-label\" href=\"#footnoteref49_6dataqw\">49.</a> Gouhier, <em>La Jeunesse</em>, pp. 408–409.</li>\n<li class=\"footnote\" id=\"footnote50_zhfw2cl\"><a class=\"footnote-label\" href=\"#footnoteref50_zhfw2cl\">50.</a> Soltau, \"The Authority of Science, I. August Comte\", <em>French Political Thought</em>, pp. 203–215.</li>\n<li class=\"footnote\" id=\"footnote51_jmhyr9h\"><a class=\"footnote-label\" href=\"#footnoteref51_jmhyr9h\">51.</a> Fernand Rude, <em>Stendhal et La Pensée sociale de Son Temps</em> (Paris: Plon, 1967), pp. 101–180.</li>\n<li class=\"footnote\" id=\"footnote52_uh2935i\"><a class=\"footnote-label\" href=\"#footnoteref52_uh2935i\">52.</a> <em>Ibid</em>., pp. 105–109, 113–114.</li>\n<li class=\"footnote\" id=\"footnote53_tx31dus\"><a class=\"footnote-label\" href=\"#footnoteref53_tx31dus\">53.</a> Charles-Barthélemy Dunoyer, <em>L'lndustrie el La Morale</em> (Paris: Sautelet, 1825), pp. 336–367, Cf. Odilon Barrot,<em> De la centralization et des ser Effets</em> (Paris: Dumineray, 1861).</li>\n<li class=\"footnote\" id=\"footnote54_z04nl7q\"><a class=\"footnote-label\" href=\"#footnoteref54_z04nl7q\">54.</a> Rude, <em>Stendhal</em>, p. 113.</li>\n<li class=\"footnote\" id=\"footnote55_t0fw3ut\"><a class=\"footnote-label\" href=\"#footnoteref55_t0fw3ut\">55.</a> Rude, \"Les 'Apprentissages' de Stendhal, 2, L'économie politique\", <em>ibid</em>., pp. 57–98.</li>\n<li class=\"footnote\" id=\"footnote56_p12ekfi\"><a class=\"footnote-label\" href=\"#footnoteref56_p12ekfi\">56.</a> Rude, \"Les 'Apprentissages' de Stendhal, 1, L'Idéologue\", <em>ibid</em>., pp. 17–56.</li>\n<li class=\"footnote\" id=\"footnote57_0c5yd4m\"><a class=\"footnote-label\" href=\"#footnoteref57_0c5yd4m\">57.</a> Emanuel Chill, \"Introductory Essay\", <em>Power, Property, and History, Barnave's Introduction to the French Revolution and Other Writings</em> (New York: Harper & Row, 1971), p. 70.</li>\n<li class=\"footnote\" id=\"footnote58_i93or0z\"><a class=\"footnote-label\" href=\"#footnoteref58_i93or0z\">58.</a> Rude, <em>Stendhal</em>, p. 235; Fernand Rude, ed., <em>Barnave: Introduction à la Révolution Française</em> (Paris: Librairie Arman Colin, 1960).</li>\n<li class=\"footnote\" id=\"footnote59_6oizd74\"><a class=\"footnote-label\" href=\"#footnoteref59_6oizd74\">59.</a> Rude, <em>Stendhal</em>, p. 40.</li>\n<li class=\"footnote\" id=\"footnote60_7qspayg\"><a class=\"footnote-label\" href=\"#footnoteref60_7qspayg\">60.</a> Rude, <em>Stendhal</em>, pp. 131–137.</li>\n<li class=\"footnote\" id=\"footnote61_kd01e1n\"><a class=\"footnote-label\" href=\"#footnoteref61_kd01e1n\">61.</a> Ibid., pp. 115–124; Georges Weill, <em>L'École Saint-Simonienne</em> (Paris, 1899), pp. 9–10.</li>\n<li class=\"footnote\" id=\"footnote62_32z7h8d\"><a class=\"footnote-label\" href=\"#footnoteref62_32z7h8d\">62.</a> Rude, <em>Stendhal</em>, pp. 97, 101, 124–127.</li>\n<li class=\"footnote\" id=\"footnote63_wxo52fm\"><a class=\"footnote-label\" href=\"#footnoteref63_wxo52fm\">63.</a> <em>Ibid</em>., p. 133.</li>\n<li class=\"footnote\" id=\"footnote64_j41p808\"><a class=\"footnote-label\" href=\"#footnoteref64_j41p808\">64.</a> <em>Ibid</em>., pp. 141–149, 153–155.</li>\n<li class=\"footnote\" id=\"footnote65_lmdkl6y\"><a class=\"footnote-label\" href=\"#footnoteref65_lmdkl6y\">65.</a> <em>Ibid</em>., pp. 148–152, 291.</li>\n<li class=\"footnote\" id=\"footnote66_mop1peu\"><a class=\"footnote-label\" href=\"#footnoteref66_mop1peu\">66.</a> <em>Ibid</em>., pp. 115, 155–164.</li>\n<li class=\"footnote\" id=\"footnote67_3o5n4wu\"><a class=\"footnote-label\" href=\"#footnoteref67_3o5n4wu\">67.</a> <em>Revue encyclopédique</em>, pp. 190–191.</li>\n<li class=\"footnote\" id=\"footnote68_u2xl7i2\"><a class=\"footnote-label\" href=\"#footnoteref68_u2xl7i2\">68.</a> <em>Ibid</em>., pp. 192.</li>\n<li class=\"footnote\" id=\"footnote69_ehkj1kr\"><a class=\"footnote-label\" href=\"#footnoteref69_ehkj1kr\">69.</a> <em>Ibid</em>., pp. 194–198.</li>\n<li class=\"footnote\" id=\"footnote70_eku7tn9\"><a class=\"footnote-label\" href=\"#footnoteref70_eku7tn9\">70.</a> Dunoyer, <em>L'Industrie el la morale</em>, pp. 430–431: J.B. Salaville, <em>L'Homme et las Société; ou nouvelle théorie de la nature humaine et de l'état social</em> (Paris: Carteret-Dentu, An VII, 1798), chapter XXXIV, pp. 355–372, 391–392; Rude, <em>Stendhal</em>, p. 114.</li>\n<li class=\"footnote\" id=\"footnote71_atfiuxn\"><a class=\"footnote-label\" href=\"#footnoteref71_atfiuxn\">71.</a> J.L. Talmon, <em>Political Messianism, The Romantic Phase</em> (London: Secker & Warburg, 1960), pp. 35–124, esp., pp. 46 and 49–50; on 18th century advocates of the beneficial role of legislation, especially Rousseau, see Talmon, <em>The Origins of Totalitarian Democracy</em> (New York: Praeger, 1960), pp. 34–49.</li>\n<li class=\"footnote\" id=\"footnote72_kcobn5o\"><a class=\"footnote-label\" href=\"#footnoteref72_kcobn5o\">72.</a> Benjamin Constant, \"De M. Dunoyer et de quelques-uns de ses ouvrages\", in <em>De la Perfectibilité de l'Espèce humaine</em> (Lausanne: Éditions L'Age D'Homme, 1967), pp. 66–95; Benjamin Constant, <em>Mélanges de littérature et de politique</em> (Paris: Pichon et Didier, 1829), pp. 128–162.</li>\n<li class=\"footnote\" id=\"footnote73_wy448qo\"><a class=\"footnote-label\" href=\"#footnoteref73_wy448qo\">73.</a> Pierre Deguise, \"Introduction\", Benjamin Constant, <em>De La Perfectibilité de l'Espèce humaine</em> (Lausanne: Éditions L'Age D'Homme, 1967), pp. 9–34.</li>\n<li class=\"footnote\" id=\"footnote74_irym2s5\"><a class=\"footnote-label\" href=\"#footnoteref74_irym2s5\">74.</a> <em>Ibid</em>., pp. 15–20.</li>\n<li class=\"footnote\" id=\"footnote75_53kum46\"><a class=\"footnote-label\" href=\"#footnoteref75_53kum46\">75.</a> Constant, \"'<em>De M. Dunoyer</em>\": <em>ibid</em>., pp. 66–68, 90. Fourteen years before, Constant had published his <em>De L'Ésprit de Conquète</em>, in which he discussed the differences between the political freedom of the ancients and the individual freedom of the moderns. Constant repeated this in his brochure <em>De la liberté des Anciens comparée à celle des moderne</em>s in 1819 Dunoyer's association in <em>L'lndustrie et la morale</em>, pp. 93–44, of Constant with Rousseau and Chateaubriand as a critic of civilization and proponent of primitive levels of civilization, is highlighted by their diverse views of the meaning of the Greek struggle for independence from the Turks. For Constant, \"it was in the barbarity of the Klephtes that Greece found a safeguard against the barbarity of the Turks\", \"De M. Dunoyer\", <em>ibid</em>., p. 75. The Klephtes were the Greek brigands, who from their refuge in the northern mountains, maintained the independence of Greek political movement and culture during the Turkish occupation, and who were active in the revolution. Dunoyer had been impressed that the Greeks were more industrious than the Turks, through their activity in commerce, crafts and especially seafaring, and thus, by the revolt of the Greek sailors who formed the vast majority of the Turks' navy, decisively shifted control in the Aegean to the Greek revolution. <em>L'lndustrie et la morale</em>, pp. 101–102. Constant was also distressed by Dunoyer's emphasis that it was the fault of the people that they suffered the government's oppression; if people had a stronger sense of morality and self-interest they would not have experienced government's oppression or would long since have overthrown it. The <em>Revue encylopédique</em> in January, 1825 had raised as a criticism of Dunoyer's lectures on <em>industrialisme </em>at the Athénée that industrial life makes ruling easier for the governors. Rude, <em>Stendhal</em>, p. 114. Constant disagreed with Dunoyer's view that governments were the reflection of the people's situation, and that governments will be overturned when the people achieve a sufficiently high state of development. Constant emphasized that governments were the result of conquest, of elements of the past, and of stagnation; and that the opposition between peoples and governments was the significant thing. Dunoyer's severity upon the people seemed to relieve the governments of criticism: \"This new principle is necessary to examine: all which discredits peoples is avidly gathered by government, and against the intention of M. Dunoyer, the oppressive authorities will seize possession easily of that part of his system\", \"De M. Dunoyer\", <em>ibid</em>., p. 68.</li>\n<li class=\"footnote\" id=\"footnote76_ge05i7k\"><a class=\"footnote-label\" href=\"#footnoteref76_ge05i7k\">76.</a> Dunoyer, \"Historical notice on <em>industrialisme</em>\", pp. 175–176.</li>\n<li class=\"footnote\" id=\"footnote77_5u8rpwj\"><a class=\"footnote-label\" href=\"#footnoteref77_5u8rpwj\">77.</a> <em>Ibid</em>., pp. 178–179.</li>\n<li class=\"footnote\" id=\"footnote78_g2s5w6s\"><a class=\"footnote-label\" href=\"#footnoteref78_g2s5w6s\">78.</a> O. Pozzo de Borgo, in Constant, <em>Écrits</em>, I, 204–206. <em>Constant's Oeuvres Manuscrites de 1810</em> were acquired by the Bibliothèque nationale in 1961.</li>\n<li class=\"footnote\" id=\"footnote79_cnhmf6d\"><a class=\"footnote-label\" href=\"#footnoteref79_cnhmf6d\">79.</a> Constant, <em>Mélanges</em>, pp. 387–415; Pierre Deguise, \"Introduction\", in <em>Constant De la Perfectibilité</em>, pp. 11–14; O. Pozzo de Borgo, pp. 234–235; Picavet,<em> Les Idéologues</em>, passim; Kitchin, <em>La Décade</em>, pp. 127, 148–149. Dominique Bagge, <em>Les Idées politiques en France sous la Restauration</em> (Paris: Presses Universitaires de France, 1952), \"Le courant de pensée Individualiste\", pp. 25–92, especially p. 48.</li>\n<li class=\"footnote\" id=\"footnote80_rcndfst\"><a class=\"footnote-label\" href=\"#footnoteref80_rcndfst\">80.</a> Burton R. Pollin, <em>Godwin Criticism: A Synoptic Bibliography</em> (Toronto: University of Toronto Press, 1967), pp. 54–55, numbers 360R–363R, including <em>La Décade</em> reviews of Godwin's <em>Fleetwood </em>and <em>St. Leon</em>, and p. 656, for editions of <em>Political Justice</em> (London, 1793, 1796, 1798; Dublin, 1793, 1796; Philadelphia, 1796; and Wurzburg, 1803); Pollin, \"Godwin's 'Letters of Verax'\", <em>Journal of the History of Ideas</em>, XXV, 1964, pp. 260–270.</li>\n<li class=\"footnote\" id=\"footnote81_736j3s8\"><a class=\"footnote-label\" href=\"#footnoteref81_736j3s8\">81.</a> O. Pozzo di Borgo, I. 121–133, 234–235, 239–241; Pollin, <em>Godwin Criticism</em>, pp. 104-105, 199; Pollin, <em>Education and Enlightenment in the Works of William Godwin</em> (New York: Las Americas, 1962), pp. 1, 17–18. Harold Nicolson, <em>Benjamin Constant</em> (Garden City, New York: Doubleday & Co., 1949), pp. 285–289. The influence of Godwin on Constant has been noted by: Elizabeth W. Schermerhorn, <em>Benjamin Constant</em> (2nd printing, New York: Haskell House, 1970), pp. 179, 188; Georges de Lauris, <em>Benjamin Constant el les idées libérales</em> (Paris: Arthur Rousseau; 1903), p. 22. Charlotte T. Muret, <em>French Royalist Doctrines since the Revolution</em> (New York: Columbia University Press, 1933), p. 72, notes only the parallels between Godwin and Constant's individualist anarchism.</li>\n<li class=\"footnote\" id=\"footnote82_zftxck0\"><a class=\"footnote-label\" href=\"#footnoteref82_zftxck0\">82.</a> Crocker, <em>Nature and Culture</em>, pp. 453; Pollin, <em>Education and Enlightenment</em>, pp. 4, 62–64, 95–98; C.F. Volney, <em>The Ruins</em> (Exeter: Joseph Mann, 1823), pp. 38–39, 93–104.</li>\n<li class=\"footnote\" id=\"footnote83_s6gr2ra\"><a class=\"footnote-label\" href=\"#footnoteref83_s6gr2ra\">83.</a> Cf. above p. 5 for the Physiocrats' and Say's view of the golden age being in the future, and p. 31 for Dunoyer's extreme decentralism; Pollin, <em>Education and Enlightenment</em>, pp. 76–78, 83–89.</li>\n<li class=\"footnote\" id=\"footnote84_w9xup9l\"><a class=\"footnote-label\" href=\"#footnoteref84_w9xup9l\">84.</a> Schatz, <em>L'Individualisme</em>, p. 197.</li>\n<li class=\"footnote\" id=\"footnote85_8mhp1cw\"><a class=\"footnote-label\" href=\"#footnoteref85_8mhp1cw\">85.</a> <em>Ibid</em>., pp. 490, 500.</li>\n<li class=\"footnote\" id=\"footnote86_cw1bube\"><a class=\"footnote-label\" href=\"#footnoteref86_cw1bube\">86.</a> <em>Ibid</em>., pp. 472–576.</li>\n<li class=\"footnote\" id=\"footnote87_w8glpho\"><a class=\"footnote-label\" href=\"#footnoteref87_w8glpho\">87.</a> <em>Ibid</em>., pp. 488–489. Dunoyer through de Molinari had an influence on American industrialist anarchists; Schatz notes that Benjamin R. Tucker used some of their concepts. <em>Ibid</em>., p. 514.</li>\n<li class=\"footnote\" id=\"footnote88_s916zxx\"><a class=\"footnote-label\" href=\"#footnoteref88_s916zxx\">88.</a> Charles Turgeon, \"Des prétendues richesses immatérielles\", <em>Revue d'économies politique</em> (1889), III, pp. 230–231, and Turgeon, \"La conception matérialiste de l'histoire d'aprés Marx et Engels\", <em>ibid</em>., (1911), XXV, pp. 307–310</li>\n</ul>\n",
  "author": "Leonard P. Liggio",
  "guid": 60504,
  "pubDate": "Mon, 31 Oct 2022 05:15:00 -0500",
  "source": "Mises Wire"
}