{
  "title": "A rushed deal or a rush to judgement?",
  "link": "https://audioboom.com/posts/7783254",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2187,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On 30 November 2020 after over 7 years of talks, the European Union and China concluded negotiations for a Comprehensive Agreement on Investment (CAI for short).<br>\n<br>\n\n</div>\n<div>The agreement is intended to increase investment between the EU and China by establishing a legal framework and common rules on issues ranging from state-owned enterprises to subsidy transparency and rules against the forced transfer of technologies. The deal replaces more than two dozen bilateral investment treaties between the EU’s 27 member states and China, improving market access for European companies operating — or intending to operate — in China and ensuring a level playing field and reciprocity when they do.<br>\n<br>\n\n</div>\n<div>Does the agreement actually live up to the above claims and seven years of expectation? To help us find out, in this episode of the Sound of Economics <a href=\"https://www.bruegel.org/author/giuseppe-porcaro/\">Giuseppe Porcaro</a> is joined by <a href=\"https://www.bruegel.org/?author_name=bert-hofman\">Bert Hofman</a>, the director of the East Asian Institute at National University of Singapore and Bruegel’s China expert <a href=\"https://www.bruegel.org/author/alicia-garcia-herrero/\">Alicia García-Herrero</a>, for a in depth commentary and glance at what the detail of the deal means for Europe.<br>\n<br>\n\n</div>\n<div>\n<em>Relevant publications</em>:</div>\n<div>Demertzis, M. (2021) ‘<a href=\"https://www.bruegel.org/2021/01/an-eu-china-investment-deal-a-second-look/\">An EU – China investment deal: a second look</a>’ 19 January</div>\n<div>García-Herrero, A. (2021) '<a href=\"https://www.bruegel.org/2021/01/europes-disappointing-investment-deal-with-china/\">Europe’s disappointing investment deal with China</a>' 4 January<br>\n<br>\n\n</div>\n",
  "itunes:summary": "The Comprehensive Agreement on Investment (CAI) is supposed to improve market access for European companies operating in China and to ensure a level playing field, as well as reciprocity. Does it fulfil such expectations?",
  "pubDate": "Wed, 27 Jan 2021 11:07:02 +0000",
  "guid": "tag:audioboom.com,2021-01-27:/posts/7783254",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}