{
  "title": "Chinese Whispers: the radical age of Chinese cinema",
  "link": "https://audioboom.com/posts/8110139",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2646,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>You probably wouldn’t expect to see the Cultural Revolution in Chinese films, or the Great Leap Forward, or the Tiananmen Square protests. But for a certain generation and a certain corner of the Chinese film industry, these were actually common themes to deal with. Their films weren’t always welcome to the censors, but they weren’t always banned, either. </div>\n<br>\n<div>Cindy Yu recently <a href=\"https://www.spectator.co.uk/article/the-closing-of-the-chinese-mind\">wrote</a> a column for <em>The Spectator</em> on Chinese cinema, and the golden age it experienced just after the end of the Cultural Revolution. You’d be surprised at the amazing political – and social – subversiveness of directors like Chen Kaige and Zhang Yimou. On this episode, Cindy talks about that golden age and also about what has come after, where, depressingly, it’s now films like Wolf Warrior 2 that dominate the box office.</div>\n<br>\n<div>Joining her is Chris Berry, Professor of Film Studies at Kings College London who specialises in Chinese cinema. They talk about how their trauma of living through the Cultural Revolution drove the so-called 'Fifth Generation' directors; the bold portrayal of queer characters which got them into trouble with the censors; and how commercialisation has changed the landscape for Chinese directors who are now dictated by the box office. Pictured here is Leslie Cheung in Chen Kaige's <em>Farewell My Concubine</em>, where Cheung portrays a queer Beijing opera singer.</div>\n",
  "pubDate": "Mon, 27 Jun 2022 16:32:09 +0000",
  "guid": "tag:audioboom.com,2022-06-27:/posts/8110139",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}