{
  "title": "An Empirical Quantile Estimation Approach to Nonlinear Optimization Problems with Chance Constraints. (arXiv:2211.00675v2 [math.OC] UPDATED)",
  "link": "http://arxiv.org/abs/2211.00675",
  "description": "<p>We investigate an empirical quantile estimation approach to solve\nchance-constrained nonlinear optimization problems. Our approach is based on\nthe reformulation of the chance constraint as an equivalent quantile constraint\nto provide stronger signals on the gradient. In this approach, the value of the\nquantile function is estimated empirically from samples drawn from the random\nparameters, and the gradient of the quantile function is estimated via a\nfinite-difference approximation on top of the quantile-function-value\nestimation. We establish a convergence theory of this approach within the\nframework of an augmented Lagrangian method for solving general nonlinear\nconstrained optimization problems. The foundation of the convergence analysis\nis a concentration property of the empirical quantile process, and the analysis\nis divided based on whether or not the quantile function is differentiable. In\ncontrast to the sampling-and-smoothing approach used in the literature, the\nmethod developed in this paper does not involve any smoothing function, and\nhence the quantile-function gradient approximation is easier to implement, and\nthere are fewer accuracy-control parameters to tune. Numerical investigation\nshows that our approach can also identify high-quality solutions, especially\nwith a relatively large step size for the finite-difference estimation, which\nworks intuitively as an implicit smoothing. Thus,the possibility exists that an\nexplicit smoothing is not always necessary to handle the chance constraints.\nJust improving the estimation of the quantile-function value and gradient\nitself likely could already lead to high performance for solving the\nchance-constrained nonlinear programs.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/math/1/au:+Luo_F/0/1/0/all/0/1\">Fengqiao Luo</a>, <a href=\"http://arxiv.org/find/math/1/au:+Larson_J/0/1/0/all/0/1\">Jeffrey Larson</a>"
}