{
  "title": "Episode 84: &#8220;Shakin&#8217; All Over&#8221; by Johnny Kidd and the Pirates",
  "link": "https://500songs.com/podcast/episode-84-shakin-all-over-by-johnny-kidd-and-the-pirates/",
  "pubDate": "Thu, 28 May 2020 08:44:55 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-84-shakin-all-over-by-johnny-kidd-and-the-pirates/",
  "description": "<p>Episode eighty-four of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Shakin' All Over\" by Johnny Kidd and the Pirates, and how the first great British R&B band interacted with the entertainment industry. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have a fifteen-minute bonus episode, <a href=\"https://www.patreon.com/posts/37614263\">on \"Under Your Spell Again\" by Buck Owens.</a></p>\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n<p><strong>Resources</strong></p>\n<p>As usual, I have put together <a href=\"https://www.mixcloud.com/upload/AndrewHickey/500-songs-supplemental-84-shakin-all-over/\">a Mixcloud mix</a> with every song excerpted in this podcast.</p>\n<p>Only one biography of Kidd has been written, and that's been out of print for nearly a quarter of a century and goes for ridiculous prices. Luckily Adie Barrett's site <a href=\"http://www.johnnykidd.co.uk/\">http://www.johnnykidd.co.uk/</a> is everything a fan-site should be, and has a detailed biographical section which I used for the broad-strokes outline.</p>\n<p><a href=\"https://amzn.to/2XGnVZn\">Clem Cattini: My Life, Through the Eye of a Tornado</a> is somewhere between authorised biography and autobiography. It's not the best-written book ever, but it contains a lot of information about Clem's life.</p>\n<p><a href=\"https://amzn.to/2Ajg2RC\">Spike & Co by Graham McCann</a> gives a very full account of Associated London Scripts.</p>\n<p><a href=\"https://amzn.to/2lqg8PS\">Pete Frame's The Restless Generation</a> is the best book available looking at British 50s rock and roll from a historical perspective. Be warned, though -- his jokey and irreverent style can, when dealing with people like Larry Parnes (who was gay and Jewish) very occasionally tip over into reinforcing homophobic and anti-semitic stereotypes for an easy laugh.</p>\n<p><a href=\"https://amzn.to/2lqpk6S\">Billy Bragg's Roots, Radicals, and Rockers: How Skiffle Changed the World</a> is one of the best books I've read on music at all, and gives far more detail about the historical background.</p>\n<p>And a fair chunk of the background information here also comes from <a href=\"https://amzn.to/2XylQOW\">the extended edition of Mark Lewisohn's Tune In,</a> which is essential reading for anyone who is interested in the Beatles, British post-war culture, and British post-war music.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a></p>\n<p><strong>Transcript</strong></p>\n<p>As we get more into this story, we're going to see a lot more British acts becoming part of it. We've already looked at Lonnie Donegan, Cliff Richard, Tommy Steele, and Vince Taylor, but without spoiling anything I think most of you can guess that over the next year or so we're going to see a few guitar bands from the UK enter the narrative.</p>\n<p>Today we're going to look at one of the most important British bands of the early sixties -- a band who are now mostly known for one hit and a gimmick, but who made a massive contribution to the sound of rock music. We're going to look at Johnny Kidd and the Pirates:</p>\n<p>[Excerpt: Johnny Kidd and the Pirates, \"Shakin' All Over\"]</p>\n<p>Our story starts during the skiffle boom of 1957. If you don't remember the episodes we did on skiffle and early British rock and roll, it was a musical craze that swept Britain after Lonnie Donegan's surprise hit with \"Rock Island Line\". For about eighteen months, nearly every teenage boy in Britain was in a group playing a weird mix of Leadbelly and Woody Guthrie songs, old folk tunes, and music-hall numbers, with a lineup usually consisting of guitar, banjo, someone using a washboard as percussion, and a homemade double bass made out of a teachest, a broom handle, and a single string.</p>\n<p>The skiffle craze died away as quickly as it started out, but it left a legacy -- thousands of young kids who'd learned at least three chords, who'd performed in public, and who knew that it was possible to make music without having gone through the homogenising star-making process. That would have repercussions throughout the length of this story, and to this day.</p>\n<p>But while almost everyone in a skiffle group was a kid, not everyone was. Obviously the big stars of the genre -- Lonnie Donegan, Chas McDevitt, the Vipers -- were all in their twenties when they became famous, and so were some of the amateurs who tried to jump on the bandwagon.</p>\n<p>In particular, there was Fred Heath. Heath was twenty-one when skiffle hit, and was already married -- while twenty-one might seem young now, at the time, it was an age when people were meant to have settled down and found a career. But Heath wasn't the career sort. There were rumours about him which attest to the kind of person he was perceived as being -- that he was a bookie's runner, that he'd not been drafted because he was thought to be completely impossible to discipline, that he had been working as a painter in a warehouse and urinated on the warehouse floor from the scaffolding he was on -- and he was clearly not someone who was *ever* going to settle down. The first skiffle band Heath formed was called Bats Heath and the Vampires, and featured Heath on vocals and rhythm guitar, Brian Englund on banjo, Frank Rouledge on lead guitar, and Clive Lazell on washboard. The group went through a variety of names, at one point naming themselves the Frantic Four in what seems to have been an attempt to confuse people into thinking they were seeing Don Lang's Frantic Five, the group who often appeared on Six-Five Special:</p>\n<p>[Excerpt: Don Lang and his Frantic Five, \"Six-Five Hand Jivel\"]</p>\n<p>The group went through the standard lineup and name changes that almost every amateur group went through, and they ended up as a five-piece group called the Five Nutters. And it was as the Five Nutters that they made their first attempts at becoming stars, when they auditioned for Carroll Levis.</p>\n<p>Levis was one of the most important people in showbusiness in the UK at this time. He'd just started a TV series, but for years before that his show had been on Radio Luxembourg, which was for many teenagers in the UK the most important radio station in the world.</p>\n<p>At the time, the BBC had a legal monopoly on radio broadcasting in the UK, but they had a couple of problems when it came to attracting a teenage audience. The first was that they had to provide entertainment for *everyone*, and so they couldn't play much music that only appealed to teenagers but was detested by adults. But there was a much bigger problem for the BBC when it came to recorded music.</p>\n<p>In the 1950s, the BBC ran three national radio stations -- the Light Programme, the Home Service, and the Third Programme -- along with one national TV channel. The Musicians' Union were worried that playing recorded music on these would lead to their members losing work, and so there was an agreement called \"needletime\", which allowed the BBC to use recorded music for twenty-two hours a week, total, across all three radio stations, plus another three hours for the TV. That had to cover every style of music from Little Richard through to Doris Day through to Beethoven. The rest of the time, if they had music, it had to be performed by live musicians, and so you'd be more likely to hear \"Rock Around the Clock\" as performed by the Northern Dance Orchestra than Bill Haley's version, and much of the BBC's youth programming had middle-aged British session musicians trying to replicate the sound of American records and failing miserably.</p>\n<p>But Luxembourg didn't have a needle-time rule, and so a commercial English-language station had been set up there, using transmitters powerful enough to reach most of Britain and Ireland. The station was owned and run in Britain, and most of the shows were recorded in London by British DJs like Brian Matthew, Jimmy Savile, and Alan Freeman, although there were also recordings of Alan Freed's show broadcast on it. The shows were mostly sponsored by record companies, who would make the DJs play just half of the record, so they could promote more songs in their twenty-minute slot, and this was the main way that any teenager in Britain would actually be able to hear rock and roll music.</p>\n<p>Oddly, even though he spent many years on Radio Luxembourg, Levis' show, which had originally been on the BBC before the War, was not a music show, but a talent show. Whether on his original BBC radio show, the Radio Luxembourg one, or his new TV show, the format was the same. He would alternate weeks between broadcasting and talent scouting. In talent scouting weeks he would go to a different city each week, where for five nights in a row he would put on talent shows featuring up to twenty different local amateur acts doing their party pieces -- without payment, of course, just for the exposure. At the end of the show, the audience would get a chance to clap for each act, and the act that got the loudest applause would go through to a final on the Saturday night. This of course meant that acts that wanted to win would get a lot of their friends and family to come along and cheer for them. The Saturday night would then have the winning acts -- which is to say, those who brought along the most paying customers -- compete against each other. The most popular of *those* acts would then get to appear on Levis' TV show the next week.</p>\n<p>It was, as you can imagine, an extremely lucrative business.</p>\n<p>When the Five Nutters appeared on Levis' Discoveries show, they were fairly sure that the audience clapped loudest for them, but they came third. Being the type of person he was, Fred Heath didn't take this lying down, and remonstrated with Levis, who eventually promised to get the Nutters some better gigs, one suspects just to shut Heath up. As a result of Levis putting in a good word for them, they got a few appearances at places like the 2Is, and made an appearance on the BBC's one concession to youth culture on the radio -- a new show called Saturday Skiffle Club.</p>\n<p>Around this time, the Five Nutters also recorded a demo disc. The first side was a skiffled-up version of \"Shake, Rattle and Roll\", with some extremely good jazzy lead guitar:</p>\n<p>[Excerpt: Fred Heath and the Five Nutters, \"Shake, Rattle, and Roll\"]</p>\n<p>I've heard quite a few records of skiffle groups, mostly by professionals, and it's clear that the Five Nutters were far more musical, and far more interesting, than most of them, even despite the audible sloppiness here. The point of skiffle was meant to be that it was do-it-yourself music that required no particular level of skill -- but in this case the Nutters' guitarist Frank Rouledge was clearly quite a bit more proficient than the run-of-the-mill skiffle guitarist.</p>\n<p>What was even more interesting about that recording, though, was the B-side, which was a song written by the group. It seems to have been mostly written by Heath, and it's called \"Blood-Red Beauty\" because Heath's wife was a redhead:</p>\n<p>[Excerpt: Fred Heath and the Five Nutters, \"Blood Red Beauty\"]</p>\n<p>The song itself is fairly unexceptional -- it's a standard Hank Williams style hillbilly boogie -- but at this time there was still in Britain a fairly hard and fast rule which had performers and songwriters as two distinct things. There were a handful of British rock musicians who were attempting to write their own material -- most prominently Billy Fury, a Larry Parnes artist who I'm afraid we don't have space for in the podcast, but who was one of the most interesting of the late-fifties British acts -- but in general, there was a fairly strict demarcation. It was very unusual for a British performer to also be trying to write songs.</p>\n<p>The Nutters split up shortly after their Saturday Skiffle Club appearance, and Heath formed various other groups called things like The Fabulous Freddie Heath Band and The Fred, Mike & Tom Show, before going back to the old name, with a new lineup of Freddie Heath and the Nutters consisting of himself on vocals, Mike West and Tom Brown -- who had been the Mike and Tom in The Fred, Mike, & Tom Show, on backing vocals, Tony Doherty on rhythm guitar, Ken McKay on drums, Johnny Gordon on bass, and on lead guitar Alan Caddy, a man who was known by the nickname \"tea\", which was partly a pun on his name, partly a reference to his drinking copious amounts of tea, and partly Cockney rhyming slang -- tea-leaf for thief -- as he was known for stealing cars.</p>\n<p>The Nutters got a new agent, Don Toy, and manager, Guy Robinson, but Heath seemed mostly to want to be a songwriter rather than a singer at this point. He was looking to place his songs with other artists, and in early 1959, he did. He wrote a song called \"Please Don't Touch\", and managed to get it placed with a vocal group called the Bachelors -- not the more famous group of that name, but a minor group who recorded for Parlophone, a subsidiary of EMI run by a young producer named George Martin. \"Please Don't Touch\" came out as the B-side of a Bachelors record:</p>\n<p>[Excerpt: The Bachelors, \"Please Don't Touch\"]</p>\n<p>One notable thing about the songwriting credit -- while most sources say Fred Heath wrote the song by himself, he gave Guy Robinson a co-writing credit on this and many of his future songs. This was partly because it was fairly standard at the time for managers to cut themselves in on their artists' credits, but also because that way the credit could read Heath Robinson -- Heath Robinson was a famous British cartoonist who was notable for drawing impossibly complicated inventions, and whose name had become part of the British language -- for American listeners, imagine that the song was credited to Rube Goldberg, and you'll have the idea.</p>\n<p>At this point, the Nutters had become quite a professional organisation, and so it was unsurprising that after \"Please Don't Touch\" brought Fred Heath to the attention of EMI, a different EMI imprint, HMV, signed them up.</p>\n<p>Much of the early success of the Nutters, and this professionalism, seems to be down to Don Toy, who seems to have been a remarkably multi-talented individual. As well as being an agent who had contracts with many London venues to provide them with bands, he was also an electrical engineer specialising in sound equipment. He built a two-hundred watt bass amp for the group, at a time when almost every band just put their bass guitar through a normal guitar amp, and twenty-five watts was considered quite loud. He also built a portable tape echo device that could be used on stage to make Heath's voice sound like it would on the records. Heath later bought the first Copicat echo unit to be made -- this was a mass-produced device that would be used by a lot of British bands in the early sixties, and Heath's had serial number 0001 -- but before that became available, he used Toy's device, which may well have been the very first on-stage echo device in the UK.</p>\n<p>On top of that, Toy has also claimed that most of the songs credited to Heath and Robinson were also co-written by him, but he left his name off because the credit looked better without it. And whether or not that's true, he was also the drummer on this first session -- Ken McKay, the Nutters' drummer, was a bit unsteady in his tempo, and Toy was a decent player and took over from him when in April 1959, Fred Heath and the Nutters went into Abbey Road Studio 2, to record their own version of \"Please Don't Touch\". This was ostensibly produced by HMV producer Walter Ridley, but Ridley actually left rock and roll records to his engineer, Peter Sullivan:</p>\n<p>[Excerpt: Johnny Kidd and the Pirates, \"Please Don't Touch\"]</p>\n<p>It was only when the session was over that they saw the paperwork for it. Fred Heath was the only member of the Nutters to be signed to EMI, with the rest of the group being contracted as session musicians, but that was absolutely normal for the time period -- Tommy Steele's Steelmen and Cliff Richard's Drifters hadn't been signed as artists either. What they were concerned about was the band name on the paperwork -- it didn't say Fred Heath and the Nutters, but Johnny Kidd and the Pirates.</p>\n<p>They were told that that was going to be their new name. They never did find out who it was who had decided on this for them, but from now on Fred Heath was Johnny Kidd.</p>\n<p>The record was promoted on Radio Luxembourg, and everyone thought it was going to go to number one. Unfortunately, strike action prevented that, and the record was only a moderate chart success -- the highest position it hit in any of the UK charts at the time was number twenty on the Melody Maker chart. But that didn't stop it from becoming an acknowledged classic of British rock and roll. It was so popular that it actually saw an American cover version, which was something that almost never happened with British songs, though Chico Holliday's version was unsuccessful:</p>\n<p>[Excerpt: Chico Holliday, \"Please Don't Touch\"]</p>\n<p>It remained such a fond memory for British rockers that in 1980 the heavy metal groups Motorhead and Girlschool recorded it as the supergroup HeadGirl, and it became the biggest hit either group ever had, reaching number five in the British charts:</p>\n<p>[Excerpt: Headgirl, \"Please Don't Touch\"]</p>\n<p>But while \"Please Don't Touch\" was one of the very few good rock and roll records made in Britain, it wasn't the one for which Johnny Kidd and the Pirates would be remembered.</p>\n<p>It was, though, enough to make them a big act. They toured the country on a bill compered by Liverpool comedian Jimmy Tarbuck, and they made several appearances on Saturday Club, which had now dropped the \"skiffle\" name and was the only place anyone could hear rock and roll on BBC radio.</p>\n<p>Of course, the British record industry having the immense sense of potential it did, HMV immediately capitalised on the success of Johnny Kidd and the Pirates doing a great group performance of an original rock and roll number, by releasing as a follow-up single, a version of the old standard \"If You Were the Only Girl in the World and I Were the Only Boy\" by Johnny without the Pirates, but with chorus and orchestra conducted by Ivor Raymonde:</p>\n<p>[Excerpt: Johnny Kidd, \"If You Were The Only Girl in the World\"]</p>\n<p>For some reason -- I can't imagine why -- that didn't chart. One suspects that young Lemmy wasn't quite as fond of that one as \"Please Don't Touch\". The B-side was a quite good rocker, with some nice guitar work from the session guitarist Bert Weedon, but no-one bothered to buy the record at the time, so they didn't turn it over to hear the other side.</p>\n<p>The follow-up was better -- a reworking of Marv Johnson's \"You've Got What it Takes\", one of the hits that Berry Gordy had been writing and producing for Johnson. Johnson's version made the top five in the UK, but the Pirates' version still made the top thirty. But by this time there had been some changes.</p>\n<p>The first change that was made was that the Pirates changed manager -- while Robinson would continue getting songwriting credits, the group were now managed through Associated London Scripts, by Stan \"Scruffy\" Dale.</p>\n<p>Associated London Scripts was, as the name suggests, primarily a company that produced scripts. It was started as a writers' co-operative, and in its early days it was made up of seven people. There was Frankie Howerd, one of the most popular stand-up comedians of the time, who was always looking for new material; Spike Milligan, the writer and one of the stars of the Goon Show, the most important surreal comedy of the fifties; Eric Sykes, who was a writer-performer who was involved in almost every important comedy programme of the decade, including co-writing many Goon episodes with Milligan, before becoming a TV star himself; Ray Galton and Alan Simpson, who wrote the most important *sitcom* of the fifties and early sixties, Hancock's Half Hour; and Scruffy Dale, who was Howerd and Sykes' manager and was supposed to take care of the business stuff.</p>\n<p>In fact, though, most of the business was actually taken care of by the seventh person and only woman, Beryl Vertue, who was taken on as the secretary on the basis of an interview that mostly asked about her tea-making skills, but soon found herself doing almost everything -- the men in the office got so used to asking her \"Could you make the tea, Beryl?\", \"Could you type up this script, Beryl?\" that they just started asking her things like \"Could you renegotiate our contract with the BBC, Beryl?\" She eventually became one of the most important women in the TV industry, with her most recent prominent credit being as executive producer on the BBC's Sherlock up until 2017, more than sixty years after she joined the business.</p>\n<p>Vertue did all the work to keep the company running -- a company which grew to about thirty writers, and between the early fifties and mid sixties, as well as Hancock's Half Hour and the Goons, its writers created Sykes, Beyond Our Ken, Round the Horne, Steptoe and Son, The Bedsitting Room, the Running, Jumping, Standing Still Film, Til Death Us Do Part, Citizen James, and the Daleks. That's a list off the top of my head -- it would actually be easier to list memorable British comedy programmes and films of the fifties and early sixties that *didn't* have a script from one of ALS' writers.</p>\n<p>And while Vertue was keeping Marty Feldman, John Junkin, Barry Took, Johnny Speight, John Antrobus and all the rest of these new writers in work, Scruffy Dale was trying to create a career in pop management. As several people associated with ALS had made records with George Martin at Parlophone, he had an in there, and some of the few pop successes that Martin had in the fifties were producing acts managed by Dale through ALS, like the Vipers Skiffle Group:</p>\n<p>[Excerpt: The Vipers Skiffle Group, \"Don't You Rock Me, Daddy-O\"]</p>\n<p>and a young performer named Jim Smith, who wanted to be a comedian and actor, but who Dale renamed after himself, and who had a string of hits as Jim Dale:</p>\n<p>[Excerpt: Jim Dale, \"Be My Girl\"]</p>\n<p>Jim Dale eventually did become a film and TV star, starting with presenting Six-Five Special, and is now best known for having starred in many of the Carry On films and narrating the Harry Potter audiobooks, but at the time he was still a pop star.</p>\n<p>Jim Dale and the Vipers were the two professional acts headlining an otherwise-amateur tour that Scruffy Dale put together that was very much like Carroll Levis' Discoveries show, except without the need to even give the winners a slot on the TV every other week. This tour was supposed to be a hunt for the country's best skiffle group, and there was going to be a grand national final, and the winner of *that* would go on TV. Except they just kept dragging the tour out for eighteen months, until the skiffle fad was completely over and no-one cared, so there never was a national final. And in the meantime the Vipers had to sit through twenty groups of spotty kids a night, all playing \"Don't You Rock Me Daddy-O\", and then go out and play it themselves, every night for eighteen months.</p>\n<p>Scruffy Dale was unscrupulous in other ways as well, and not long after he'd taken on the Pirates' management he was sacked from ALS. Spike Milligan had never liked Dale -- when told that Dale had lost a testicle in the war, he'd merely replied \"I hope he dropped it on Dresden\" -- but Frankie Howerd and Eric Sykes had always been impressed with his ability to negotiate deals.</p>\n<p>But then Frankie Howerd found out that he'd missed out on lucrative opportunities because Dale had shoved letters in his coat pocket and forgotten about them for a fortnight. He started investigating a few more things, and it turned out that Dale had been siphoning money from Sykes and Howerd's personal bank accounts into his own, having explained to their bank manager that it would just be resting in his account for them, because they were showbiz people who would spend it all too fast, so he was looking after them. And he'd also been doing other bits of creative accounting -- every success his musical acts had was marked down as something he'd done independently, and all the profits went to him, while all the unsuccessful ventures were marked down as being ALS projects, and their losses charged to the company.</p>\n<p>So neither Dale nor the Pirates were with Associated London Scripts very long. But Dale made one very important change -- he and Don Toy decided between them that most of the Pirates had to go. There were six backing musicians in the group if you counted the two backing vocalists, who all needed paying, and only one could read music -- they weren't professional enough to make a career in the music business.</p>\n<p>So all of the Pirates except Alan Caddy were sacked. Mike West and Tony Doherty formed another band, Robby Hood and His Merry Men, whose first single was written by Kidd (though it's rare enough I've not been able to find a copy anywhere online).</p>\n<p>The new backing group was going to be a trio, modelled on Johnny Burnette's Rock and Roll Trio -- just one guitar, bass, and drums. They had Caddy on lead guitar, Clem Cattini on drums, and Brian Gregg on bass.</p>\n<p>Cattini was regarded as by far the best rock drummer in Britain at the time. He'd played with Terry Dene's backing band the Dene Aces, and can be seen glumly backing Dene in the film The Golden Disc:</p>\n<p>[Excerpt: Terry Dene, \"Candy Floss\"]</p>\n<p>Gregg had joined Dene's band, and they'd both then moved on to be touring musicians for Larry Parnes, backing most of the acts on a tour featuring Gene Vincent and Eddie Cochran that we'll be looking at next week. They'd played with various of Parnes' acts for a while, but had then asked for more money, and he'd refused, so they'd quit working for Parnes and joined Vince Taylor and the Playboys. They'd only played with the Playboys a few weeks when they moved on to Chas McDevitt's group. For a brief time, McDevitt had been the biggest star in skiffle other than Lonnie Donegan, but he was firmly in the downward phase of his career at this point.</p>\n<p>McDevitt also owned a coffee bar, the Freight Train, named after his biggest hit, and most of the musicians in London would hang out there. And after Clem Cattini and Brian Gregg had joined the Pirates, it was at the Freight Train that the song for which the group would be remembered was written.</p>\n<p>They were going to go into the studio to record another song chosen by the record label -- a version of the old standard \"Yes Sir, That's My Baby\" -- because EMI had apparently not yet learned that if you had Johnny Kidd record old standards, no-one bought it, but if you had him record bluesy rock and roll you had a hit. But they'd been told they could write their own B-side, as they'd been able to on the last few singles. They were also allowed to bring in Joe Moretti to provide a second guitar -- Moretti, who had played the solo on \"Brand New Cadillac\", was an old friend of Clem Cattini's, and they thought he'd add something to the record, and also thought they'd be doing him a favour by letting him make a session fee -- he wasn't a regular session player.</p>\n<p>So they all got together in the Freight Train coffee bar, and wrote another Heath/Robinson number. They weren't going to do anything too original for a B-side, of course. They nicked a rhythm guitar part from \"Linda Lu\", a minor US hit that Lee Hazelwood had produced for a Chuck Berry soundalike named Ray Sharpe, and which was itself clearly lifted from “Speedoo” by the Cadillacs:</p>\n<p>[Excerpt: Ray Sharpe, \"Linda Lu\"]</p>\n<p>They may also have nicked Joe Moretti's lead guitar part as well, though there's more doubt about this. There's a Mickey and Sylvia record, \"No Good Lover\", which hadn't been released in the UK at the time, so it's hard to imagine how they could have heard it, but the lead guitar part they hit on was very, very similar -- maybe someone had played it on Radio Luxembourg:</p>\n<p>[Excerpt: Mickey and Sylvia, \"No Good Lover\"]</p>\n<p>They combined those musical ideas with a lyric that was partly a follow-on to the line in \"Please Don't Touch\" about shaking too much, and partly a slightly bowdlerised version of a saying that Kidd had -- when he saw a woman he found particularly attractive, he'd say \"She gives me quivers in me membranes\".</p>\n<p>As it was a B-side, the track they recorded only took two takes, plus a brief overdub for Moretti to add some guitar shimmers, created by him using a cigarette lighter as a slide:</p>\n<p>[Excerpt: Johnny Kidd and the Pirates, \"Shakin' All Over\"]</p>\n<p>The song was knocked off so quickly that they even kept in a mistake -- before the guitar solo, Clem Cattini was meant to play just a one-bar fill. Instead he played for longer, which was very unlike Cattini, who was normally a professional's professional. He asked for another take, but the producer just left it in, and that break going into the solo was one of the things that people latched on to:</p>\n<p>[Excerpt: Johnny Kidd and the Pirates, \"Shakin' All Over\"]</p>\n<p>Despite the track having been put together from pre-existing bits, it had a life and vitality to it that no other British record except \"Brand New Cadillac\" had had, and Kidd had the added bonus of actually being able to hold a tune, unlike Vince Taylor. The record company quickly realised that \"Shakin' All Over\" should be the record that they were pushing, and flipped the single. The Pirates appeared on Wham!, the latest Jack Good TV show, and immediately the record charted. It soon made number one, and became the first real proof to British listeners that British people could make rock and roll every bit as good as the Americans -- at this point, everyone still thought Vince Taylor was from America.</p>\n<p>It was possibly Jack Good who also made the big change to Johnny Kidd's appearance -- he had a slight cast in one eye that got worse as the day went on, with his eyelid drooping more and more. Someone -- probably Good -- suggested that he should make this problem into an advantage, by wearing an eyepatch. He did, and the Pirates got pirate costumes to wear on stage, while Kidd would frantically roam the stage swinging a cutlass around. At this point, stagecraft was something almost unknown to British rock performers, who rarely did more than wear a cleanish suit and say \"thank you\" after each song. The only other act that was anything like as theatrical was Screaming Lord Sutch and the Savages, a minor act who had ripped off Screamin' Jay Hawkins' act.</p>\n<p>The follow-up, \"Restless\", was very much \"Shakin' All Over\" part two, and made the top thirty. After that, sticking with the formula, they did a version of \"Linda Lu\", but that didn't make the top forty at all. Possibly the most interesting record they made at this point was a version of \"I Just Want to Make Love to You\", a song Willie Dixon had written for Muddy Waters:</p>\n<p>[Excerpt: Johnny Kidd and the Pirates, \"I Just Want to Make Love to You\"]</p>\n<p>The Pirates were increasingly starting to include blues and R&B songs in their set, and the British blues boom artists of the next few years would often refer to the Pirates as being the band that had inspired them. Clem Cattini still says that Johnny Kidd was the best British blues singer he ever heard.</p>\n<p>But as their singles were doing less and less well, the Pirates decided to jump ship. Colin Hicks, Tommy Steele's much less successful younger brother, had a backing band called the Cabin Boys, which Brian Gregg had been in before joining Terry Dene's band. Hicks had now started performing an act that was based on Kidd's, and for a tour of Italy, where he was quite popular, he wanted a new band -- he asked the Pirates if they would leave Kidd and become the latest lineup of Cabin Boys, and they left, taking their costumes with them. Clem Cattini now says that agreeing was the worst move he ever made, but they parted on good terms -- Kidd said \"Alan, Brian and Clem left me to better themselves. How could I possibly begrudge them their opportunity?\"</p>\n<p>We'll be picking up the story of Alan, Brian, and Clem in a few months' time, but in the meantime, Kidd picked up a new backing band, who had previously been performing as the Redcaps, backing a minor singer called Cuddly Dudley on his single \"Sitting on a Train\":</p>\n<p>[Excerpt: Cuddly Dudley and the Redcaps, \"Sitting on a Train\"]</p>\n<p>That new lineup of Pirates didn't last too long before the guitarist quit, due to ill health, but he was soon replaced by Mick Green, who is now regarded by many as one of the great British guitarists of all time, to the extent that Wilko Johnson, another British guitarist who came to prominence about fifteen years later, has said that he spent his entire career trying and failing to sound like MIck Green.</p>\n<p>In 1962 and 63 the group were playing clubs where they found a lot of new bands who they seemed to have things in common with. After playing the Cavern in Liverpool and a residency at the Star Club in Hamburg, they added Richie Barrett's \"Some Other Guy\" and Arthur Alexander's \"A Shot of Rhythm and Blues\" to their sets, two R&B numbers that were very popular among the Liverpool bands playing in Hamburg but otherwise almost unknown in the UK. Unfortunately, their version of \"A Shot of Rhythm and Blues\" didn't chart, and their record label declined to issue their version of \"Some Other Guy\" -- and then almost immediately the Liverpool group The Big Three released their version as a single, and it made the top forty.</p>\n<p>As the Pirates' R&B sound was unsuccessful -- no-one seemed to want British R&B, at all -- they decided to go the other way, and record a song written by their new manager, Gordon Mills (who would later become better known for managing Tom Jones and Englebert Humperdinck). \"I'll Never Get Over You\" was a very catchy, harmonised, song in the style of many of the new bands that were becoming popular, and it's an enjoyable record, but it's not really in the Pirates' style:</p>\n<p>[Excerpt: Johnny Kidd and the Pirates, \"I'll Never Get Over You\"]</p>\n<p>That made number four on the charts, but it would be Johnny Kidd and the Pirates' last major hit. They did have a minor hit with another song by Mills, \"Hungry For Love\", but a much better record, and a much better example of the Pirates' style, was an R&B single released by the Pirates without Kidd. The plan at the time was that they would be split into two acts in the same way as Cliff Richard and the Shadows -- Kidd would be a solo star, while the Pirates would release records of their own.</p>\n<p>The A-side of the Pirates' single was a fairly good version of the Willie Dixon song \"My Babe\", but to my ears the B-side is better -- it's a version of \"Casting My Spell\", a song originally by an obscure duo called the Johnson Brothers, but popularised by Johnny Otis. The Pirates' version is quite possibly the finest early British R&B record I've heard:</p>\n<p>[Excerpt: The Pirates, \"Casting My Spell\"]</p>\n<p>That didn't chart, and the plan to split the two acts failed. Neither act ever had another hit again, and eventually the classic Mick Green lineup of the Pirates split up -- Green left first, to join Billy J Kramer and the Dakotas, and the rest left one by one.</p>\n<p>In 1965, The Guess Who had a hit in the US with their cover version of \"Shakin' All Over\":</p>\n<p>[Excerpt: The Guess Who, \"Shakin' All Over\"]</p>\n<p>The Pirates were reduced to remaking their own old hit as \"Shakin' All Over '65\" in an attempt to piggyback on that cover version, but the new version, which was dominated by a Hammond organ part, didn't have any success.</p>\n<p>After the Pirates left Kidd, he got a new group, which he called the New Pirates. He continued making extremely good records on occasion, but had no success at all. Even though younger bands like the Rolling Stones and the Animals were making music very similar to his, he was regarded as an outdated novelty act, a relic of an earlier age from six years earlier. There was always the potential for him to have a comeback, but then in 1966 Kidd, who was never a very good driver and had been in a number of accidents, arrived late at a gig in Bolton. The manager refused to let him on stage because he'd arrived so late, so he drove off to find another gig. He'd been driving most of the day, and he crashed the car and died, as did one person in the vehicle he crashed into.</p>\n<p>His final single, \"Send For That Girl\", was released after his death. It's really a very good record, but at the time Kidd's fortunes were so low that even his death didn't make it chart:</p>\n<p>[Excerpt: Johnny Kidd and the New Pirates, \"Send For That Girl\"]</p>\n<p>Kidd was only thirty when he died, and already a has-been, but he left behind the most impressive body of work of any pre-Beatles British act. Various lineups of Pirates have occasionally played since -- including, at one point, Cattini and Gregg playing with Joe Moretti's son Joe Moretti Jr -- but none have ever captured that magic that gave millions of people quivers down the backbone and shakes in the kneebone.</p>",
  "itunes:subtitle": "Episode eighty-four of A History of Rock Music in Five Hundred Songs looks at Shakin All Over by Johnny Kidd and the Pirates, and how the first great British R&B band interacted with the entertainment industry. Click the full post to read liner notes",
  "itunes:keywords": "Alan Caddy,Associated London Scripts,Beryl Vertue,Billy J Kramer,British rock,Carrol Levis,Chas McDevitt,Clem Cattini,Eric Sykes,Frankie Howerd,George Martin,Jack Good,Jim Dale,Joe Moretti,Johnny Kidd and the Pirates,Larry Parnes,Merseybeat,Mick Green,Mickey and Sylvia,Motorhead,Parlophone,Radio Luxembourg,Saturday Club,Six-Five Special,skiffle,Spike Milligan,Terry Dene,The Goon Show,The Vipers Skiffle Group,Vince Taylor",
  "itunes:episodeType": "full",
  "itunes:episode": 84,
  "content:encoded": "<p>Episode eighty-four of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Shakin' All Over\" by Johnny Kidd and the Pirates, and how the first great British R&B band interacted with the entertainment industry. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have a fifteen-minute bonus episode, <a href=\"https://www.patreon.com/posts/37614263\">on \"Under Your Spell Again\" by Buck Owens.</a></p>\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n<p><strong>Resources</strong></p>\n<p>As usual, I have put together <a href=\"https://www.mixcloud.com/upload/AndrewHickey/500-songs-supplemental-84-shakin-all-over/\">a Mixcloud mix</a> with every song excerpted in this podcast.</p>\n<p>Only one biography of Kidd has been written, and that's been out of print for nearly a quarter of a century and goes for ridiculous prices. Luckily Adie Barrett's site <a href=\"http://www.johnnykidd.co.uk/\">http://www.johnnykidd.co.uk/</a> is everything a fan-site should be, and has a detailed biographical section which I used for the broad-strokes outline.</p>\n<p><a href=\"https://amzn.to/2XGnVZn\">Clem Cattini: My Life, Through the Eye of a Tornado</a> is somewhere between authorised biography and autobiography. It's not the best-written book ever, but it contains a lot of information about Clem's life.</p>\n<p><a href=\"https://amzn.to/2Ajg2RC\">Spike & Co by Graham McCann</a> gives a very full account of Associated London Scripts.</p>\n<p><a href=\"https://amzn.to/2lqg8PS\">Pete Frame's The Restless Generation</a> is the best book available looking at British 50s rock and roll from a historical perspective. Be warned, though -- his jokey and irreverent style can, when dealing with people like Larry Parnes (who was gay and Jewish) very occasionally tip over into reinforcing homophobic and anti-semitic stereotypes for an easy laugh.</p>\n<p><a href=\"https://amzn.to/2lqpk6S\">Billy Bragg's Roots, Radicals, and Rockers: How Skiffle Changed the World</a> is one of the best books I've read on music at all, and gives far more detail about the historical background.</p>\n<p>And a fair chunk of the background information here also comes from <a href=\"https://amzn.to/2XylQOW\">the extended edition of Mark Lewisohn's Tune In,</a> which is essential reading for anyone who is interested in the Beatles, British post-war culture, and British post-war music.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a></p>\n<p><strong>Transcript</strong></p>\n<p>As we get more into this story, we're going to see a lot more British acts becoming part of it. We've already looked at Lonnie Donegan, Cliff Richard, Tommy Steele, and Vince Taylor, but without spoiling anything I think most of you can guess that over the next year or so we're going to see a few guitar bands from the UK enter the narrative.</p>\n<p>Today we're going to look at one of the most important British bands of the early sixties -- a band who are now mostly known for one hit and a gimmick, but who made a massive contribution to the sound of rock music. We're going to look at Johnny Kidd and the Pirates:</p>\n<p>[Excerpt: Johnny Kidd and the Pirates, \"Shakin' All Over\"]</p>\n<p>Our story starts during the skiffle boom of 1957. If you don't remember the episodes we did on skiffle and early British rock and roll, it was a musical craze that swept Britain after Lonnie Donegan's surprise hit with \"Rock Island Line\". For about eighteen months, nearly every teenage boy in Britain was in a group playing a weird mix of Leadbelly and Woody Guthrie songs, old folk tunes, and music-hall numbers, with a lineup usually consisting of guitar, banjo, someone using a washboard as percussion, and a homemade double bass made out of a teachest, a broom handle, and a single string.</p>\n<p>The skiffle craze died away as quickly as it started out, but it left a legacy -- thousands of young kids who'd learned at least three chords, who'd performed in public, and who knew that it was possible to make music without having gone through the homogenising star-making process. That would have repercussions throughout the length of this story, and to this day.</p>\n<p>But while almost everyone in a skiffle group was a kid, not everyone was. Obviously the big stars of the genre -- Lonnie Donegan, Chas McDevitt, the Vipers -- were all in their twenties when they became famous, and so were some of the amateurs who tried to jump on the bandwagon.</p>\n<p>In particular, there was Fred Heath. Heath was twenty-one when skiffle hit, and was already married -- while twenty-one might seem young now, at the time, it was an age when people were meant to have settled down and found a career. But Heath wasn't the career sort. There were rumours about him which attest to the kind of person he was perceived as being -- that he was a bookie's runner, that he'd not been drafted because he was thought to be completely impossible to discipline, that he had been working as a painter in a warehouse and urinated on the warehouse floor from the scaffolding he was on -- and he was clearly not someone who was *ever* going to settle down. The first skiffle band Heath formed was called Bats Heath and the Vampires, and featured Heath on vocals and rhythm guitar, Brian Englund on banjo, Frank Rouledge on lead guitar, and Clive Lazell on washboard. The group went through a variety of names, at one point naming themselves the Frantic Four in what seems to have been an attempt to confuse people into thinking they were seeing Don Lang's Frantic Five, the group who often appeared on Six-Five Special:</p>\n<p>[Excerpt: Don Lang and his Frantic Five, \"Six-Five Hand Jivel\"]</p>\n<p>The group went through the standard lineup and name changes that almost every amateur group went through, and they ended up as a five-piece group called the Five Nutters. And it was as the Five Nutters that they made their first attempts at becoming stars, when they auditioned for Carroll Levis.</p>\n<p>Levis was one of the most important people in showbusiness in the UK at this time. He'd just started a TV series, but for years before that his show had been on Radio Luxembourg, which was for many teenagers in the UK the most important radio station in the world.</p>\n<p>At the time, the BBC had a legal monopoly on radio broadcasting in the UK, but they had a couple of problems when it came to attracting a teenage audience. The first was that they had to provide entertainment for *everyone*, and so they couldn't play much music that only appealed to teenagers but was detested by adults. But there was a much bigger problem for the BBC when it came to recorded music.</p>\n<p>In the 1950s, the BBC ran three national radio stations -- the Light Programme, the Home Service, and the Third Programme -- along with one national TV channel. The Musicians' Union were worried that playing recorded music on these would lead to their members losing work, and so there was an agreement called \"needletime\", which allowed the BBC to use recorded music for twenty-two hours a week, total, across all three radio stations, plus another three hours for the TV. That had to cover every style of music from Little Richard through to Doris Day through to Beethoven. The rest of the time, if they had music, it had to be performed by live musicians, and so you'd be more likely to hear \"Rock Around the Clock\" as performed by the Northern Dance Orchestra than Bill Haley's version, and much of the BBC's youth programming had middle-aged British session musicians trying to replicate the sound of American records and failing miserably.</p>\n<p>But Luxembourg didn't have a needle-time rule, and so a commercial English-language station had been set up there, using transmitters powerful enough to reach most of Britain and Ireland. The station was owned and run in Britain, and most of the shows were recorded in London by British DJs like Brian Matthew, Jimmy Savile, and Alan Freeman, although there were also recordings of Alan Freed's show broadcast on it. The shows were mostly sponsored by record companies, who would make the DJs play just half of the record, so they could promote more songs in their twenty-minute slot, and this was the main way that any teenager in Britain would actually be able to hear rock and roll music.</p>\n<p>Oddly, even though he spent many years on Radio Luxembourg, Levis' show, which had originally been on the BBC before the War, was not a music show, but a talent show. Whether on his original BBC radio show, the Radio Luxembourg one, or his new TV show, the format was the same. He would alternate weeks between broadcasting and talent scouting. In talent scouting weeks he would go to a different city each week, where for five nights in a row he would put on talent shows featuring up to twenty different local amateur acts doing their party pieces -- without payment, of course, just for the exposure. At the end of the show, the audience would get a chance to clap for each act, and the act that got the loudest applause would go through to a final on the Saturday night. This of course meant that acts that wanted to win would get a lot of their friends and family to come along and cheer for them. The Saturday night would then have the winning acts -- which is to say, those who brought along the most paying customers -- compete against each other. The most popular of *those* acts would then get to appear on Levis' TV show the next week.</p>\n<p>It was, as you can imagine, an extremely lucrative business.</p>\n<p>When the Five Nutters appeared on Levis' Discoveries show, they were fairly sure that the audience clapped loudest for them, but they came third. Being the type of person he was, Fred Heath didn't take this lying down, and remonstrated with Levis, who eventually promised to get the Nutters some better gigs, one suspects just to shut Heath up. As a result of Levis putting in a good word for them, they got a few appearances at places like the 2Is, and made an appearance on the BBC's one concession to youth culture on the radio -- a new show called Saturday Skiffle Club.</p>\n<p>Around this time, the Five Nutters also recorded a demo disc. The first side was a skiffled-up version of \"Shake, Rattle and Roll\", with some extremely good jazzy lead guitar:</p>\n<p>[Excerpt: Fred Heath and the Five Nutters, \"Shake, Rattle, and Roll\"]</p>\n<p>I've heard quite a few records of skiffle groups, mostly by professionals, and it's clear that the Five Nutters were far more musical, and far more interesting, than most of them, even despite the audible sloppiness here. The point of skiffle was meant to be that it was do-it-yourself music that required no particular level of skill -- but in this case the Nutters' guitarist Frank Rouledge was clearly quite a bit more proficient than the run-of-the-mill skiffle guitarist.</p>\n<p>What was even more interesting about that recording, though, was the B-side, which was a song written by the group. It seems to have been mostly written by Heath, and it's called \"Blood-Red Beauty\" because Heath's wife was a redhead:</p>\n<p>[Excerpt: Fred Heath and the Five Nutters, \"Blood Red Beauty\"]</p>\n<p>The song itself is fairly unexceptional -- it's a standard Hank Williams style hillbilly boogie -- but at this time there was still in Britain a fairly hard and fast rule which had performers and songwriters as two distinct things. There were a handful of British rock musicians who were attempting to write their own material -- most prominently Billy Fury, a Larry Parnes artist who I'm afraid we don't have space for in the podcast, but who was one of the most interesting of the late-fifties British acts -- but in general, there was a fairly strict demarcation. It was very unusual for a British performer to also be trying to write songs.</p>\n<p>The Nutters split up shortly after their Saturday Skiffle Club appearance, and Heath formed various other groups called things like The Fabulous Freddie Heath Band and The Fred, Mike & Tom Show, before going back to the old name, with a new lineup of Freddie Heath and the Nutters consisting of himself on vocals, Mike West and Tom Brown -- who had been the Mike and Tom in The Fred, Mike, & Tom Show, on backing vocals, Tony Doherty on rhythm guitar, Ken McKay on drums, Johnny Gordon on bass, and on lead guitar Alan Caddy, a man who was known by the nickname \"tea\", which was partly a pun on his name, partly a reference to his drinking copious amounts of tea, and partly Cockney rhyming slang -- tea-leaf for thief -- as he was known for stealing cars.</p>\n<p>The Nutters got a new agent, Don Toy, and manager, Guy Robinson, but Heath seemed mostly to want to be a songwriter rather than a singer at this point. He was looking to place his songs with other artists, and in early 1959, he did. He wrote a song called \"Please Don't Touch\", and managed to get it placed with a vocal group called the Bachelors -- not the more famous group of that name, but a minor group who recorded for Parlophone, a subsidiary of EMI run by a young producer named George Martin. \"Please Don't Touch\" came out as the B-side of a Bachelors record:</p>\n<p>[Excerpt: The Bachelors, \"Please Don't Touch\"]</p>\n<p>One notable thing about the songwriting credit -- while most sources say Fred Heath wrote the song by himself, he gave Guy Robinson a co-writing credit on this and many of his future songs. This was partly because it was fairly standard at the time for managers to cut themselves in on their artists' credits, but also because that way the credit could read Heath Robinson -- Heath Robinson was a famous British cartoonist who was notable for drawing impossibly complicated inventions, and whose name had become part of the British language -- for American listeners, imagine that the song was credited to Rube Goldberg, and you'll have the idea.</p>\n<p>At this point, the Nutters had become quite a professional organisation, and so it was unsurprising that after \"Please Don't Touch\" brought Fred Heath to the attention of EMI, a different EMI imprint, HMV, signed them up.</p>\n<p>Much of the early success of the Nutters, and this professionalism, seems to be down to Don Toy, who seems to have been a remarkably multi-talented individual. As well as being an agent who had contracts with many London venues to provide them with bands, he was also an electrical engineer specialising in sound equipment. He built a two-hundred watt bass amp for the group, at a time when almost every band just put their bass guitar through a normal guitar amp, and twenty-five watts was considered quite loud. He also built a portable tape echo device that could be used on stage to make Heath's voice sound like it would on the records. Heath later bought the first Copicat echo unit to be made -- this was a mass-produced device that would be used by a lot of British bands in the early sixties, and Heath's had serial number 0001 -- but before that became available, he used Toy's device, which may well have been the very first on-stage echo device in the UK.</p>\n<p>On top of that, Toy has also claimed that most of the songs credited to Heath and Robinson were also co-written by him, but he left his name off because the credit looked better without it. And whether or not that's true, he was also the drummer on this first session -- Ken McKay, the Nutters' drummer, was a bit unsteady in his tempo, and Toy was a decent player and took over from him when in April 1959, Fred Heath and the Nutters went into Abbey Road Studio 2, to record their own version of \"Please Don't Touch\". This was ostensibly produced by HMV producer Walter Ridley, but Ridley actually left rock and roll records to his engineer, Peter Sullivan:</p>\n<p>[Excerpt: Johnny Kidd and the Pirates, \"Please Don't Touch\"]</p>\n<p>It was only when the session was over that they saw the paperwork for it. Fred Heath was the only member of the Nutters to be signed to EMI, with the rest of the group being contracted as session musicians, but that was absolutely normal for the time period -- Tommy Steele's Steelmen and Cliff Richard's Drifters hadn't been signed as artists either. What they were concerned about was the band name on the paperwork -- it didn't say Fred Heath and the Nutters, but Johnny Kidd and the Pirates.</p>\n<p>They were told that that was going to be their new name. They never did find out who it was who had decided on this for them, but from now on Fred Heath was Johnny Kidd.</p>\n<p>The record was promoted on Radio Luxembourg, and everyone thought it was going to go to number one. Unfortunately, strike action prevented that, and the record was only a moderate chart success -- the highest position it hit in any of the UK charts at the time was number twenty on the Melody Maker chart. But that didn't stop it from becoming an acknowledged classic of British rock and roll. It was so popular that it actually saw an American cover version, which was something that almost never happened with British songs, though Chico Holliday's version was unsuccessful:</p>\n<p>[Excerpt: Chico Holliday, \"Please Don't Touch\"]</p>\n<p>It remained such a fond memory for British rockers that in 1980 the heavy metal groups Motorhead and Girlschool recorded it as the supergroup HeadGirl, and it became the biggest hit either group ever had, reaching number five in the British charts:</p>\n<p>[Excerpt: Headgirl, \"Please Don't Touch\"]</p>\n<p>But while \"Please Don't Touch\" was one of the very few good rock and roll records made in Britain, it wasn't the one for which Johnny Kidd and the Pirates would be remembered.</p>\n<p>It was, though, enough to make them a big act. They toured the country on a bill compered by Liverpool comedian Jimmy Tarbuck, and they made several appearances on Saturday Club, which had now dropped the \"skiffle\" name and was the only place anyone could hear rock and roll on BBC radio.</p>\n<p>Of course, the British record industry having the immense sense of potential it did, HMV immediately capitalised on the success of Johnny Kidd and the Pirates doing a great group performance of an original rock and roll number, by releasing as a follow-up single, a version of the old standard \"If You Were the Only Girl in the World and I Were the Only Boy\" by Johnny without the Pirates, but with chorus and orchestra conducted by Ivor Raymonde:</p>\n<p>[Excerpt: Johnny Kidd, \"If You Were The Only Girl in the World\"]</p>\n<p>For some reason -- I can't imagine why -- that didn't chart. One suspects that young Lemmy wasn't quite as fond of that one as \"Please Don't Touch\". The B-side was a quite good rocker, with some nice guitar work from the session guitarist Bert Weedon, but no-one bothered to buy the record at the time, so they didn't turn it over to hear the other side.</p>\n<p>The follow-up was better -- a reworking of Marv Johnson's \"You've Got What it Takes\", one of the hits that Berry Gordy had been writing and producing for Johnson. Johnson's version made the top five in the UK, but the Pirates' version still made the top thirty. But by this time there had been some changes.</p>\n<p>The first change that was made was that the Pirates changed manager -- while Robinson would continue getting songwriting credits, the group were now managed through Associated London Scripts, by Stan \"Scruffy\" Dale.</p>\n<p>Associated London Scripts was, as the name suggests, primarily a company that produced scripts. It was started as a writers' co-operative, and in its early days it was made up of seven people. There was Frankie Howerd, one of the most popular stand-up comedians of the time, who was always looking for new material; Spike Milligan, the writer and one of the stars of the Goon Show, the most important surreal comedy of the fifties; Eric Sykes, who was a writer-performer who was involved in almost every important comedy programme of the decade, including co-writing many Goon episodes with Milligan, before becoming a TV star himself; Ray Galton and Alan Simpson, who wrote the most important *sitcom* of the fifties and early sixties, Hancock's Half Hour; and Scruffy Dale, who was Howerd and Sykes' manager and was supposed to take care of the business stuff.</p>\n<p>In fact, though, most of the business was actually taken care of by the seventh person and only woman, Beryl Vertue, who was taken on as the secretary on the basis of an interview that mostly asked about her tea-making skills, but soon found herself doing almost everything -- the men in the office got so used to asking her \"Could you make the tea, Beryl?\", \"Could you type up this script, Beryl?\" that they just started asking her things like \"Could you renegotiate our contract with the BBC, Beryl?\" She eventually became one of the most important women in the TV industry, with her most recent prominent credit being as executive producer on the BBC's Sherlock up until 2017, more than sixty years after she joined the business.</p>\n<p>Vertue did all the work to keep the company running -- a company which grew to about thirty writers, and between the early fifties and mid sixties, as well as Hancock's Half Hour and the Goons, its writers created Sykes, Beyond Our Ken, Round the Horne, Steptoe and Son, The Bedsitting Room, the Running, Jumping, Standing Still Film, Til Death Us Do Part, Citizen James, and the Daleks. That's a list off the top of my head -- it would actually be easier to list memorable British comedy programmes and films of the fifties and early sixties that *didn't* have a script from one of ALS' writers.</p>\n<p>And while Vertue was keeping Marty Feldman, John Junkin, Barry Took, Johnny Speight, John Antrobus and all the rest of these new writers in work, Scruffy Dale was trying to create a career in pop management. As several people associated with ALS had made records with George Martin at Parlophone, he had an in there, and some of the few pop successes that Martin had in the fifties were producing acts managed by Dale through ALS, like the Vipers Skiffle Group:</p>\n<p>[Excerpt: The Vipers Skiffle Group, \"Don't You Rock Me, Daddy-O\"]</p>\n<p>and a young performer named Jim Smith, who wanted to be a comedian and actor, but who Dale renamed after himself, and who had a string of hits as Jim Dale:</p>\n<p>[Excerpt: Jim Dale, \"Be My Girl\"]</p>\n<p>Jim Dale eventually did become a film and TV star, starting with presenting Six-Five Special, and is now best known for having starred in many of the Carry On films and narrating the Harry Potter audiobooks, but at the time he was still a pop star.</p>\n<p>Jim Dale and the Vipers were the two professional acts headlining an otherwise-amateur tour that Scruffy Dale put together that was very much like Carroll Levis' Discoveries show, except without the need to even give the winners a slot on the TV every other week. This tour was supposed to be a hunt for the country's best skiffle group, and there was going to be a grand national final, and the winner of *that* would go on TV. Except they just kept dragging the tour out for eighteen months, until the skiffle fad was completely over and no-one cared, so there never was a national final. And in the meantime the Vipers had to sit through twenty groups of spotty kids a night, all playing \"Don't You Rock Me Daddy-O\", and then go out and play it themselves, every night for eighteen months.</p>\n<p>Scruffy Dale was unscrupulous in other ways as well, and not long after he'd taken on the Pirates' management he was sacked from ALS. Spike Milligan had never liked Dale -- when told that Dale had lost a testicle in the war, he'd merely replied \"I hope he dropped it on Dresden\" -- but Frankie Howerd and Eric Sykes had always been impressed with his ability to negotiate deals.</p>\n<p>But then Frankie Howerd found out that he'd missed out on lucrative opportunities because Dale had shoved letters in his coat pocket and forgotten about them for a fortnight. He started investigating a few more things, and it turned out that Dale had been siphoning money from Sykes and Howerd's personal bank accounts into his own, having explained to their bank manager that it would just be resting in his account for them, because they were showbiz people who would spend it all too fast, so he was looking after them. And he'd also been doing other bits of creative accounting -- every success his musical acts had was marked down as something he'd done independently, and all the profits went to him, while all the unsuccessful ventures were marked down as being ALS projects, and their losses charged to the company.</p>\n<p>So neither Dale nor the Pirates were with Associated London Scripts very long. But Dale made one very important change -- he and Don Toy decided between them that most of the Pirates had to go. There were six backing musicians in the group if you counted the two backing vocalists, who all needed paying, and only one could read music -- they weren't professional enough to make a career in the music business.</p>\n<p>So all of the Pirates except Alan Caddy were sacked. Mike West and Tony Doherty formed another band, Robby Hood and His Merry Men, whose first single was written by Kidd (though it's rare enough I've not been able to find a copy anywhere online).</p>\n<p>The new backing group was going to be a trio, modelled on Johnny Burnette's Rock and Roll Trio -- just one guitar, bass, and drums. They had Caddy on lead guitar, Clem Cattini on drums, and Brian Gregg on bass.</p>\n<p>Cattini was regarded as by far the best rock drummer in Britain at the time. He'd played with Terry Dene's backing band the Dene Aces, and can be seen glumly backing Dene in the film The Golden Disc:</p>\n<p>[Excerpt: Terry Dene, \"Candy Floss\"]</p>\n<p>Gregg had joined Dene's band, and they'd both then moved on to be touring musicians for Larry Parnes, backing most of the acts on a tour featuring Gene Vincent and Eddie Cochran that we'll be looking at next week. They'd played with various of Parnes' acts for a while, but had then asked for more money, and he'd refused, so they'd quit working for Parnes and joined Vince Taylor and the Playboys. They'd only played with the Playboys a few weeks when they moved on to Chas McDevitt's group. For a brief time, McDevitt had been the biggest star in skiffle other than Lonnie Donegan, but he was firmly in the downward phase of his career at this point.</p>\n<p>McDevitt also owned a coffee bar, the Freight Train, named after his biggest hit, and most of the musicians in London would hang out there. And after Clem Cattini and Brian Gregg had joined the Pirates, it was at the Freight Train that the song for which the group would be remembered was written.</p>\n<p>They were going to go into the studio to record another song chosen by the record label -- a version of the old standard \"Yes Sir, That's My Baby\" -- because EMI had apparently not yet learned that if you had Johnny Kidd record old standards, no-one bought it, but if you had him record bluesy rock and roll you had a hit. But they'd been told they could write their own B-side, as they'd been able to on the last few singles. They were also allowed to bring in Joe Moretti to provide a second guitar -- Moretti, who had played the solo on \"Brand New Cadillac\", was an old friend of Clem Cattini's, and they thought he'd add something to the record, and also thought they'd be doing him a favour by letting him make a session fee -- he wasn't a regular session player.</p>\n<p>So they all got together in the Freight Train coffee bar, and wrote another Heath/Robinson number. They weren't going to do anything too original for a B-side, of course. They nicked a rhythm guitar part from \"Linda Lu\", a minor US hit that Lee Hazelwood had produced for a Chuck Berry soundalike named Ray Sharpe, and which was itself clearly lifted from “Speedoo” by the Cadillacs:</p>\n<p>[Excerpt: Ray Sharpe, \"Linda Lu\"]</p>\n<p>They may also have nicked Joe Moretti's lead guitar part as well, though there's more doubt about this. There's a Mickey and Sylvia record, \"No Good Lover\", which hadn't been released in the UK at the time, so it's hard to imagine how they could have heard it, but the lead guitar part they hit on was very, very similar -- maybe someone had played it on Radio Luxembourg:</p>\n<p>[Excerpt: Mickey and Sylvia, \"No Good Lover\"]</p>\n<p>They combined those musical ideas with a lyric that was partly a follow-on to the line in \"Please Don't Touch\" about shaking too much, and partly a slightly bowdlerised version of a saying that Kidd had -- when he saw a woman he found particularly attractive, he'd say \"She gives me quivers in me membranes\".</p>\n<p>As it was a B-side, the track they recorded only took two takes, plus a brief overdub for Moretti to add some guitar shimmers, created by him using a cigarette lighter as a slide:</p>\n<p>[Excerpt: Johnny Kidd and the Pirates, \"Shakin' All Over\"]</p>\n<p>The song was knocked off so quickly that they even kept in a mistake -- before the guitar solo, Clem Cattini was meant to play just a one-bar fill. Instead he played for longer, which was very unlike Cattini, who was normally a professional's professional. He asked for another take, but the producer just left it in, and that break going into the solo was one of the things that people latched on to:</p>\n<p>[Excerpt: Johnny Kidd and the Pirates, \"Shakin' All Over\"]</p>\n<p>Despite the track having been put together from pre-existing bits, it had a life and vitality to it that no other British record except \"Brand New Cadillac\" had had, and Kidd had the added bonus of actually being able to hold a tune, unlike Vince Taylor. The record company quickly realised that \"Shakin' All Over\" should be the record that they were pushing, and flipped the single. The Pirates appeared on Wham!, the latest Jack Good TV show, and immediately the record charted. It soon made number one, and became the first real proof to British listeners that British people could make rock and roll every bit as good as the Americans -- at this point, everyone still thought Vince Taylor was from America.</p>\n<p>It was possibly Jack Good who also made the big change to Johnny Kidd's appearance -- he had a slight cast in one eye that got worse as the day went on, with his eyelid drooping more and more. Someone -- probably Good -- suggested that he should make this problem into an advantage, by wearing an eyepatch. He did, and the Pirates got pirate costumes to wear on stage, while Kidd would frantically roam the stage swinging a cutlass around. At this point, stagecraft was something almost unknown to British rock performers, who rarely did more than wear a cleanish suit and say \"thank you\" after each song. The only other act that was anything like as theatrical was Screaming Lord Sutch and the Savages, a minor act who had ripped off Screamin' Jay Hawkins' act.</p>\n<p>The follow-up, \"Restless\", was very much \"Shakin' All Over\" part two, and made the top thirty. After that, sticking with the formula, they did a version of \"Linda Lu\", but that didn't make the top forty at all. Possibly the most interesting record they made at this point was a version of \"I Just Want to Make Love to You\", a song Willie Dixon had written for Muddy Waters:</p>\n<p>[Excerpt: Johnny Kidd and the Pirates, \"I Just Want to Make Love to You\"]</p>\n<p>The Pirates were increasingly starting to include blues and R&B songs in their set, and the British blues boom artists of the next few years would often refer to the Pirates as being the band that had inspired them. Clem Cattini still says that Johnny Kidd was the best British blues singer he ever heard.</p>\n<p>But as their singles were doing less and less well, the Pirates decided to jump ship. Colin Hicks, Tommy Steele's much less successful younger brother, had a backing band called the Cabin Boys, which Brian Gregg had been in before joining Terry Dene's band. Hicks had now started performing an act that was based on Kidd's, and for a tour of Italy, where he was quite popular, he wanted a new band -- he asked the Pirates if they would leave Kidd and become the latest lineup of Cabin Boys, and they left, taking their costumes with them. Clem Cattini now says that agreeing was the worst move he ever made, but they parted on good terms -- Kidd said \"Alan, Brian and Clem left me to better themselves. How could I possibly begrudge them their opportunity?\"</p>\n<p>We'll be picking up the story of Alan, Brian, and Clem in a few months' time, but in the meantime, Kidd picked up a new backing band, who had previously been performing as the Redcaps, backing a minor singer called Cuddly Dudley on his single \"Sitting on a Train\":</p>\n<p>[Excerpt: Cuddly Dudley and the Redcaps, \"Sitting on a Train\"]</p>\n<p>That new lineup of Pirates didn't last too long before the guitarist quit, due to ill health, but he was soon replaced by Mick Green, who is now regarded by many as one of the great British guitarists of all time, to the extent that Wilko Johnson, another British guitarist who came to prominence about fifteen years later, has said that he spent his entire career trying and failing to sound like MIck Green.</p>\n<p>In 1962 and 63 the group were playing clubs where they found a lot of new bands who they seemed to have things in common with. After playing the Cavern in Liverpool and a residency at the Star Club in Hamburg, they added Richie Barrett's \"Some Other Guy\" and Arthur Alexander's \"A Shot of Rhythm and Blues\" to their sets, two R&B numbers that were very popular among the Liverpool bands playing in Hamburg but otherwise almost unknown in the UK. Unfortunately, their version of \"A Shot of Rhythm and Blues\" didn't chart, and their record label declined to issue their version of \"Some Other Guy\" -- and then almost immediately the Liverpool group The Big Three released their version as a single, and it made the top forty.</p>\n<p>As the Pirates' R&B sound was unsuccessful -- no-one seemed to want British R&B, at all -- they decided to go the other way, and record a song written by their new manager, Gordon Mills (who would later become better known for managing Tom Jones and Englebert Humperdinck). \"I'll Never Get Over You\" was a very catchy, harmonised, song in the style of many of the new bands that were becoming popular, and it's an enjoyable record, but it's not really in the Pirates' style:</p>\n<p>[Excerpt: Johnny Kidd and the Pirates, \"I'll Never Get Over You\"]</p>\n<p>That made number four on the charts, but it would be Johnny Kidd and the Pirates' last major hit. They did have a minor hit with another song by Mills, \"Hungry For Love\", but a much better record, and a much better example of the Pirates' style, was an R&B single released by the Pirates without Kidd. The plan at the time was that they would be split into two acts in the same way as Cliff Richard and the Shadows -- Kidd would be a solo star, while the Pirates would release records of their own.</p>\n<p>The A-side of the Pirates' single was a fairly good version of the Willie Dixon song \"My Babe\", but to my ears the B-side is better -- it's a version of \"Casting My Spell\", a song originally by an obscure duo called the Johnson Brothers, but popularised by Johnny Otis. The Pirates' version is quite possibly the finest early British R&B record I've heard:</p>\n<p>[Excerpt: The Pirates, \"Casting My Spell\"]</p>\n<p>That didn't chart, and the plan to split the two acts failed. Neither act ever had another hit again, and eventually the classic Mick Green lineup of the Pirates split up -- Green left first, to join Billy J Kramer and the Dakotas, and the rest left one by one.</p>\n<p>In 1965, The Guess Who had a hit in the US with their cover version of \"Shakin' All Over\":</p>\n<p>[Excerpt: The Guess Who, \"Shakin' All Over\"]</p>\n<p>The Pirates were reduced to remaking their own old hit as \"Shakin' All Over '65\" in an attempt to piggyback on that cover version, but the new version, which was dominated by a Hammond organ part, didn't have any success.</p>\n<p>After the Pirates left Kidd, he got a new group, which he called the New Pirates. He continued making extremely good records on occasion, but had no success at all. Even though younger bands like the Rolling Stones and the Animals were making music very similar to his, he was regarded as an outdated novelty act, a relic of an earlier age from six years earlier. There was always the potential for him to have a comeback, but then in 1966 Kidd, who was never a very good driver and had been in a number of accidents, arrived late at a gig in Bolton. The manager refused to let him on stage because he'd arrived so late, so he drove off to find another gig. He'd been driving most of the day, and he crashed the car and died, as did one person in the vehicle he crashed into.</p>\n<p>His final single, \"Send For That Girl\", was released after his death. It's really a very good record, but at the time Kidd's fortunes were so low that even his death didn't make it chart:</p>\n<p>[Excerpt: Johnny Kidd and the New Pirates, \"Send For That Girl\"]</p>\n<p>Kidd was only thirty when he died, and already a has-been, but he left behind the most impressive body of work of any pre-Beatles British act. Various lineups of Pirates have occasionally played since -- including, at one point, Cattini and Gregg playing with Joe Moretti's son Joe Moretti Jr -- but none have ever captured that magic that gave millions of people quivers down the backbone and shakes in the kneebone.</p>",
  "enclosure": "",
  "itunes:summary": "Episode eighty-four of A History of Rock Music in Five Hundred Songs looks at \"Shakin' All Over\" by Johnny Kidd and the Pirates, and how the first great British R&B band interacted with the entertainment industry. Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a fifteen-minute bonus episode, on \"Under Your Spell Again\" by Buck Owens.\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nResources\nAs usual, I have put together a Mixcloud mix with every song excerpted in this podcast.\nOnly one biography of Kidd has been written, and that's been out of print for nearly a quarter of a century and goes for ridiculous prices. Luckily Adie Barrett's site http://www.johnnykidd.co.uk/ is everything a fan-site should be, and has a detailed biographical section which I used for the broad-strokes outline.\nClem Cattini: My Life, Through the Eye of a Tornado is somewhere between authorised biography and autobiography. It's not the best-written book ever, but it contains a lot of information about Clem's life.\nSpike & Co by Graham McCann gives a very full account of Associated London Scripts.\nPete Frame's The Restless Generation is the best book available looking at British 50s rock and roll from a historical perspective. Be warned, though -- his jokey and irreverent style can, when dealing with people like Larry Parnes (who was gay and Jewish) very occasionally tip over into reinforcing homophobic and anti-semitic stereotypes for an easy laugh.\nBilly Bragg's Roots, Radicals, and Rockers: How Skiffle Changed the World is one of the best books I've read on music at all, and gives far more detail about the historical background.\nAnd a fair chunk of the background information here also comes from the extended edition of Mark Lewisohn's Tune In, which is essential reading for anyone who is interested in the Beatles, British post-war culture, and British post-war music.\nPatreon\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\nTranscript\nAs we get more into this story, we're going to see a lot more British acts becoming part of it. We've already looked at Lonnie Donegan, Cliff Richard, Tommy Steele, and Vince Taylor, but without spoiling anything I think most of you can guess that over the next year or so we're going to see a few guitar bands from the UK enter the narrative.\nToday we're going to look at one of the most important British bands of the early sixties -- a band who are now mostly known for one hit and a gimmick, but who made a massive contribution to the sound of rock music. We're going to look at Johnny Kidd and the Pirates:\n[Excerpt: Johnny Kidd and the Pirates, \"Shakin' All Over\"]\nOur story starts during the skiffle boom of 1957. If you don't remember the episodes we did on skiffle and early British rock and roll, it was a musical craze that swept Britain after Lonnie Donegan's surprise hit with \"Rock Island Line\". For about eighteen months, nearly every teenage boy in Britain was in a group playing a weird mix of Leadbelly and Woody Guthrie songs, old folk tunes, and music-hall numbers, with a lineup usually consisting of guitar, banjo, someone using a washboard as percussion, and a homemade double bass made out of a teachest, a broom handle, and a single string.\nThe skiffle craze died away as quickly as it started out, but it left a legacy -- thousands of young kids who'd learned at least three chords, who'd performed in public, and who knew that it was possible to make music without having gone through the homogenising star-making process. That would have repercussions throughout the length of this story, and to this day.\nBut while almost everyone in a skiffle group was a kid, not everyone was. Obviously the big stars of the genre -- ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode eighty-four of A History of Rock Music in Five Hundred Songs looks at \"Shakin' All Over\" by Johnny Kidd and the Pirates, and how the first great British R&B band interacted with the entertainment industry. Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a fifteen-minute bonus episode, on \"Under Your Spell Again\" by Buck Owens.\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nResources\nAs usual, I have put together a Mixcloud mix with every song excerpted in this podcast.\nOnly one biography of Kidd has been written, and that's been out of print for nearly a quarter of a century and goes for ridiculous prices. Luckily Adie Barrett's site http://www.johnnykidd.co.uk/ is everything a fan-site should be, and has a detailed biograph",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}