{
  "title": "U.S. Passes Landmark Act to Fund Semiconductor Manufacturing",
  "link": "https://spectrum.ieee.org/chips-act-of-2022",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-gold-hued-photo-of-a-man-in-clean-room-garb-walking-down-a-an-aisle-with-white-machines-on-either-side.jpg?id=30326057&width=1200&height=800&coordinates=0%2C3%2C0%2C3\"/><br/><br/><p>Legislation aimed at increasing semiconductor manufacturing in the United States has finally passed both houses of Congress, following a multiyear journey that saw many mutations and delays. The <a href=\"https://www.commerce.senate.gov/services/files/1201E1CA-73CB-44BB-ADEB-E69634DA9BB9#:~:text=DIVISION%20A%20%2D%20CHIPS%20ACT%20OF%202022,-Sec.%20101%E2%80%94Short&text=This%20Act%20may%20be%20cited,%E2%80%9CCHIPS%20Act%20of%202022.%E2%80%9D&text=implement%20the%20Commerce%20Department%20semiconductor,Sec.%209902%20%26%209906).\" target=\"_blank\">CHIPS and Science Act</a>, provides about US $52 billion over 5 years to grow semiconductor manufacturing and authorizes a 25 percent tax credit for new or expanded facilities that make semiconductors or chipmaking equipment. It’s part of a $280 billion package aimed at improving the United States’ ability to compete in future technologies. And it comes amidst efforts by other nations and regions to boost chip manufacturing, an industry increasingly seen as a key to economic and military security.<br/></p><p>“This is going to make a huge difference in how the U.S. does innovation,” says <a href=\"https://ieeeusa.org/about/staff/\" target=\"_blank\">Russell T. Harrison</a>, acting managing director of IEEE-USA, who has been involved in the legislation since its beginnings more than two years ago.</p><p>The bill’s $52 billion includes $39 billion in grants for new manufacturing, $11 billion for federal semiconductor research programs and workforce development, and $2 billion for Defense Department–related microelectronics activities.</p><p class=\"pull-quote\">“Twenty-five percent [tax credit] means we’re in it to win.”<br/>—Ian Steff, former U.S. Assistant Secretary of Commerce</p><p>In addition, the bill directs $200 million over five years to the National Science Foundation to “promote growth of the semiconductor workforce.” The Commerce Department expects the United States will need 90,000 more workers in the semiconductor industry by 2025.</p><p>And there’s a further $500 million for “coordinating with foreign government partners to support international information and communications technology security and semiconductor supply-chain activities, including supporting the development and adoption of secure and trusted telecommunications technologies, semiconductors, and other emerging technologies.”</p><p>The 25 percent tax credit goes a long way toward making the building of new capacity in the United States comparable with building it offshore, according to <a href=\"https://www.linkedin.com/in/ian-steff-7a9a6088/\" target=\"_blank\">Ian Steff, former Assistant Secretary of Commerce</a>, and now a consultant advising Minnesota-based chip foundry <a href=\"https://www.skywatertechnology.com/\" target=\"_blank\">Skywater Technology</a>. “Twenty-five percent means we’re in it to win,” he says.</p><p>The legislation has been variously sold as an opportunity to create well-paid jobs, a chance to strengthen the semiconductor supply chain following the chip shortage of 2020, and as a national-defense imperative that would lessen the concern that China might strangle the supply of 90 percent of the most advanced logic by attacking Taiwan. It might be all of that.</p><p>Big chip manufacturers have been planning to add and expand fabs in anticipation of government incentives. GlobalFoundries is doing a <a href=\"https://spectrum.ieee.org/ignoring-intel-rumors-globalfoundries-will-do-1billion-expansion\" target=\"_blank\">$1 billion addition in Malta, N.Y.</a> <a href=\"https://www.datacenterdynamics.com/en/news/tsmc-starts-work-on-12bn-arizona-semiconductor-fab-gets-funding-for-japanese-chip-rd/\" target=\"_blank\">TSMC is already building</a> a $12 billion facility in Arizona. And Samsung plans a <a href=\"https://www.samsung.com/us/sas/News/Detail/202111230901001_News_2021FabExpansion\" target=\"_blank\">$17 billion fab</a> outside Austin, while dangling the possibility of nearly $200 billion in the future. Intel was probably the most explicit in its expectations. When it announced a plan for a <a href=\"https://spectrum.ieee.org/intel-ohio-fab\" target=\"_self\">$20 billion fab complex in Ohio</a>, <a href=\"https://www.intel.com/content/www/us/en/newsroom/biographies/biography-keyvan-esfarjani.html#gs.n3ifog\" rel=\"noopener noreferrer\" target=\"_blank\">Keyvan Esfarjani</a>, Intel senior vice president of manufacturing, supply chain, and operations made the strings explicit: “The scope and pace of Intel’s expansion in Ohio...will depend heavily on funding from the CHIPS Act,” he said at the time. The company said its investment could reach $100 billion over ten years with the proper government backing.</p><p>Getting this far has been “an effort that has transcended administrations and gotten bipartisan support since its early inception,” says Steff. Still, the legislation was stalled for a long time. The bill that passed in Congress largely appropriates funds for things that were already authorized in a the <a href=\"https://spectrum.ieee.org/us-takes-strategic-step-to-onshore-electronics-manufacturing\" target=\"_blank\">National Defense Authorization Act of 2021</a>, which passed in January of that year.</p><p>Within the U.S. semiconductor industry much of the debate fell into what Harrison calls the “normal legislative process.” Companies or industry sectors not covered under the legislation fight to gain inclusion, while those already on the inside fight to keep it exclusive, concerned that the pool of funds will become diluted. Some initial outsiders succeeded: Chip packaging, which has grown increasingly important as advanced processor makers find they cannot get enough computing from a single sliver of silicon, was swiftly added. Efforts to expand the bill beyond its manufacturing scope continued nearly up until the end. According to <a href=\"https://www.cnbc.com/2022/07/18/us-chip-industry-split-over-chips-act-benefits-to-intel.html\" rel=\"noopener noreferrer\" target=\"_blank\">reports</a>, chip designers whose processors are manufactured by others, including AMD, Nvidia, and Qualcomm, indicated their displeasure that they would not get in on the act.</p><p>Finding the balance of who’s in and who’s out meant making the terms broad enough to accomplish the goal of bringing chip manufacturing to the United States “without making it so broad that it becomes mush,” says Harrison. “They have now settled on something a little bigger than they had at first, but it’s focused on chips and their manufacture.”</p>",
  "pubDate": "Fri, 29 Jul 2022 14:53:55 +0000",
  "guid": "https://spectrum.ieee.org/chips-act-of-2022",
  "category": [
    "Fabs",
    "Foundries",
    "Tsmc",
    "Intel",
    "Samsung",
    "Globalfoundries",
    "Skywater technology foundry",
    "Congress",
    "Chips",
    "Semiconductor manufacturing"
  ],
  "dc:creator": "Samuel K. Moore",
  "media:content": ""
}