{
  "title": "S14 Ep34: Supernatural News/Parashare: Episode 209",
  "link": "https://audioboom.com/posts/8098596",
  "itunes:episode": 34,
  "itunes:title": "Supernatural News/Parashare: Episode 209",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5894,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS is back with Supernatural News and ParaShare!<br>\n<br>\nThis week, Scientists have figured out how to grow living A.I.!  The Ghost Adventures Crew finds body parts in jars on an investigation!  A presidential candidate would stop an alien invasion with a little grub and gab, and a baseball announcer says he is psychic PLUS your calls and stories today.<br>\n<br>\nRemember to call and share your stories for future episodes 651-300-4977<br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nGet a low, fixed rate credit card consolidation loan from Lightstream and pay off those credit card balances. You can get a loan from five thousand to a hundred thousand dollars and you could get your money as soon as the day you apply.  Visit <a href=\"http://lightstream.com/Darkness\">lightstream.com/Darkness</a> and get an additional interest rate discount and more information.",
  "itunes:summary": "BEYOND the DARKNESS is back with Supernatural News and ParaShare!\n\nThis week, Scientists have figured out how to grow living A.I.!  The Ghost Adventures Crew finds body parts in jars on an investigation!  A presidential candidate would...",
  "pubDate": "Sat, 27 Apr 2019 08:00:00 +0000",
  "guid": "ad4d46fe-dd75-465b-9862-c4f6c8cbea80",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}