{
  "title": "Why the 2022 elections might determine the future of democracy in the US",
  "link": "https://news.mit.edu/2022/why-2022-elections-might-determine-future-us-democracy-1101",
  "description": "In a recent discussion, individuals from around MIT describe why every vote in state and local elections matters.",
  "pubDate": "Tue, 01 Nov 2022 15:10:00 -0400",
  "guid": "https://news.mit.edu/2022/why-2022-elections-might-determine-future-us-democracy-1101",
  "dc:creator": "MIT Washington Office",
  "content:encoded": "<p>Voters need to pay attention to races up and down the ballot — especially to more obscure county-level contests — to protect democracy, panelists said during an Oct. 12 discussion titled “Why the 2022 Elections May Determine the Future of Democracy in the U.S.” While national and congressional races get the most attention, voters may not realize that local and state election officials have the most control over democracy issues, the panelists said.</p>\n\n<p>The panel was sponsored by MITvote, the MIT Washington Office, and several other MIT entities — under the umbrella of MIT’s ALL IN Campus Democracy Challenge — that share the goal of getting students to register and to cast votes, whether locally or in their home areas. David Goldston, director of the MIT Washington Office, moderated the conversation with Charles Stewart III, the Kenan Sahin Distinguished Professor of Political Science; Jessica Huseman, editorial director of the online publication <em>Votebeat</em>; and Chris Capozzola, professor of history.</p>\n<p>The panelists said that while senators, representatives, and governors have an impact, state secretaries of state (who control elections in 38 states) and local election officials (who are elected in some jurisdictions) have the greatest responsibility for determining the nature and integrity of elections.&nbsp;&nbsp;</p>\n\n<p>“You should figure out what your county election administrator is called,” Huseman said when asked what steps a voter could take to ensure the future of democracy. Capozzola recommended looking at materials from nonpartisan groups like the League of Women Voters, which has been around since early in the 20th century. And all the panelists suggested getting a sample ballot from your local election office and researching the candidates in advance of going to vote.</p>\n\n<p>Huseman also encouraged viewers to become poll workers. She noted that there were not enough people now volunteering for such roles, and she and Stewart lamented the harassment recently endured by such volunteers while stressing the importance of these individuals as unsung heroes of democracy. Becoming a poll worker will also enable you to get more informed about election processes, Huseman noted.</p>\n\n<p>Despite the many challenges to democracy today, the panelists were guardedly optimistic about its future in the United States. “We shouldn’t run around with our ‘hair on fire’ or lose faith in the system,” Stewart said. He warned that while some politicians and interest groups are sowing unwarranted concern about elections, the fundamentals of the voting system, including judicial protections, have remained intact.</p>\n\n<p>Stewart said the 2020 elections were especially well-run, despite challenges posed by the pandemic, cybersecurity concerns, and the intense partisanship of the races.</p>\n\n<p>The panelists did note that democracy issues have become more partisan as the two political parties have become more ideologically distinct. Conspiracy theories are originating on both sides of the aisle. While <em>The Washington Post </em>recently reported that about 53 percent of Republican candidates running for the Senate, the House of Representatives, and key statewide offices this year deny the results of the 2020 election, Huseman noted that some conspiracy theories undermining election legitimacy have originated on the far left — even theories that were eventually embraced by elements of the right wing, such as one about Venezuelans interfering with U.S. election equipment.</p>\n\n<p>The panel also highlighted a few specific races where democracy issues are at stake, particularly in Arizona. Huseman cited the secretary of state race in Arizona, saying that Mark Finchem, the Republican candidate, has embraced conspiracy theories about elections.</p>\n\n<p>Regardless of location, it is essential for voters to remain engaged, the panelists emphasized. The panelists acknowledged that today’s news cycles can be exhausting, but remaining engaged is paramount. “Voting is a muscle, and it takes exercise ... History teaches the importance of democratic practice, of voting, over and over again,” Capozzola said.&nbsp;</p>\n\n<p>“After watching the panel, I felt motivated and energized to vote this season and continue encouraging my peers to do the same,” says graduate student Kelsey Merrill. “Hearing the panelists stress the importance of this simple activity, not only to further my own policy preferences, but for the future of a healthy democracy in this country, made my work encouraging students to be civically engaged feel worth it.”&nbsp;&nbsp;&nbsp;</p>\n\n<p>To protect democracy in this election season, MIT’s ALL IN urges everyone to:&nbsp;</p>\n\n<ol>\n\t<li>Register to vote at <a href=\"http://mit.turbovote.org\">TurboVote</a></li>\n\t<li>Get a sample ballot and research county and state election official races</li>\n\t<li>Volunteer to be a poll worker</li>\n\t<li>Make a plan to vote</li>\n\t<li>Remind a friend or family member to vote.</li>\n</ol>",
  "media:content": {
    "media:description": "While national and congressional races get the most attention, voters may not realize that local and state election officials have the most control over democracy issues.",
    "media:credit": "Photo: Theresa Thompson/Flickr"
  },
  "category": [
    "Special events and guest speakers",
    "Voting and elections",
    "Democracy",
    "Political science",
    "Government",
    "Community",
    "Public Service Center (PSC)",
    "Volunteering, outreach, public service",
    "Politics",
    "Students",
    "Student life",
    "School of Humanities Arts and Social Sciences"
  ]
}