{
  "title": "Ugur Ungor discusses paramilitaries in his military history book Paramilitarism (Oxford University Press, 2020)",
  "link": "http://warscholar.org/ugur-ungar-discusses-paramilitaries-in-his-military-history-book-paramilitarism-oxford-university-press-2020/",
  "pubDate": "Mon, 05 Oct 2020 01:45:32 +0000",
  "guid": "http://warscholar.org/?p=2043",
  "comments": "http://warscholar.org/ugur-ungar-discusses-paramilitaries-in-his-military-history-book-paramilitarism-oxford-university-press-2020/#respond",
  "wfw:commentRss": "http://warscholar.org/ugur-ungar-discusses-paramilitaries-in-his-military-history-book-paramilitarism-oxford-university-press-2020/feed/",
  "slash:comments": 0,
  "category": [
    "All Modern War",
    "Interviews",
    "Podcasts",
    "academic",
    "audio interviews",
    "books",
    "germany",
    "Modern War",
    "Oxford University Press",
    "podcast",
    "Russia",
    "Ugur Umit Ungar",
    "United States",
    "Vietnam",
    "vietnam war"
  ],
  "description": "Ugur Ungor discusses Paramilitarism Check out this book here   https://amzn.to/3ivil4q Interview Summary Ugur Umit Ungor is a professor of Holocaust and Genocide Studies and has researched paramilitarism for years and has recently published a book on the topic. We discussed the book and the various paramilitaries that have formed in the twentieth century and…",
  "enclosure": "",
  "itunes:subtitle": "Ugur Ungor discusses Paramilitarism Check out this book here   https://amzn.to/3ivil4q Interview Summary Ugur Umit Ungor is a professor of Holocaust and Genocide Studies and has researched paramilitarism for years and has recently published a book on...",
  "itunes:summary": "&nbsp;<br />\nUgur Ungor discusses Paramilitarism<br />\n<a href=\"https://amzn.to/3ivil4q\">Check out this book here</a>   <a href=\"https://amzn.to/3ivil4q\">https://amzn.to/3ivil4q</a><br />\nInterview Summary<br />\nUgur Umit Ungor is a professor of Holocaust and Genocide Studies and has researched paramilitarism for years and has recently published a book on the topic. We discussed the book and the various paramilitaries that have formed in the twentieth century and the problems they have caused both for their victims and for the states that have created them.<br />\n(THE AUDIO PLAYER IS AT THE BOTTOM OF THE POST.)<br />\n0:42 &#8211; Ugur talks about how he started writing about paramilitary groups.<br />\n2:47 &#8211; Ugur talks about the regions and time periods the book covers.<br />\n0:41 &#8211; Ugur talks about how he started writing about paramilitary groups.<br />\n2:42 &#8211; Ugur talks about the regions and time periods the book covers.<br />\n5:18 &#8211; Ugur talks about what paramilitarism is and their relationship to states.<br />\n7:31 &#8211; Ugur talks about the ties between organized crime, paramilitaries, and states.<br />\n11:05 &#8211; Ugur talks about the extent that authoritarian regimes use paramilitaries.<br />\n14:07 &#8211; Ugur talks about being surprised that Stalin didn&#8217;t use paramilitaries.<br />\n15:28 &#8211; Ugur talks about being surprised that Indonesia used paramilitaries in the 1960s.<br />\n16:24 &#8211; Ugur talks about the internal structures and development of these groups.<br />\n18:34 &#8211; Ugur talks about paramilitary groups who fought outside of their countries.<br />\n20:38 &#8211; Ugur talks about why these groups are considered military rather than para police 23:50 &#8211; Ugur talks about how many military and law enforcement men were in paramilitary groups too.<br />\n26:09 &#8211; Ugur talks about insurgencies and the creation of paramilitaries.<br />\n29:58 &#8211; Ugur talks about the popularity of these groups in some parts of their society.<br />\n34:06 &#8211; Ugur talks about how most of the victims of paramilitaries were poor people.<br />\n36:19 &#8211; Ugur talks about the violent methods the paramilitaries used.<br />\n38:06 &#8211; Ugur talks about paramilitary membership.<br />\n40:48 &#8211; Ugur talks about the dangers or lack of that these paramilitaries faced.<br />\n42:22 &#8211; Ugur talks about how states disbanded paramilitary groups.<br />\n46:30 &#8211; Ugur talks about the power of the state over its paramilitaries.<br />\n47:55 &#8211; Ugur talks about how paramilitaries gain political and social status they didn&#8217;t have before.<br />\n48:24 &#8211; Ugur talks about the Syrian paramilitaries being the most violent he came across.<br />\n50:52 &#8211; Ugur talks about globalism and paramilitaries.<br />\n53:39 &#8211; Ugur talks about how he did his research.<br />\n56:05 &#8211; Ugur talks being surprised about how much paramilitaries figured in US history.<br />\n58:19 &#8211; Ugur talks about paramilitary false flag operations in Ireland.<br />\n1:00:39 &#8211; Ugur talks about wanting to know more about Slobodan Milosevic and his connection with paramilitaries.  He also talks about a November 1996 car crash in Turkey that involved a Turkish parliamentarian and Kurdish, the head of the Turkish police, and the top mob boss in Turkey at the time.<br />\n1:04:14 &#8211; Ugur talks about how these paramilitaries affect public perception of their governments and violence.<br />\n1:09:18 &#8211; Ugur is at Ungor.nl and on twitter @ugurumitungor.<br />\nLinks of interest<br />\n<a href=\"https://amzn.to/3ivil4q\">https://amzn.to/3ivil4q</a><br />\n<a href=\"https://global.oup.com/academic/product/paramilitarism-9780198825241?cc=us&lang=en&\">https://global.oup.com/academic/product/paramilitarism-9780198825241?cc=us&lang=en&</a><br />\n<a href=\"https://www.niod.nl/en/staff/ugur-%c3%bcng%c3%b6r\">https://www.niod.nl/en/staff/ugur-%c3%bcng%c3%b6r</a><br />\n",
  "itunes:author": "Cris Alvarez",
  "itunes:image": "",
  "itunes:duration": "1:11:36",
  "post-id": 2043
}