{
  "title": "EPISODE 64: The Taiping Rebellion (Part 2): Jesus’ Chinese Younger Brother",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Sat, 05 Sep 2020 09:39:11 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2020/9/4/episode-64",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5f52b4d3814c234eab02f47c",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1599298607498-012JW4I9EZPQJ75LTR7D/HOF-64-Taiping-02.jpg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"HOF-64-Taiping-02.jpg\" data-load=\"false\" data-image-id=\"5f535c2c36732345b4b61adb\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1599298607498-012JW4I9EZPQJ75LTR7D/HOF-64-Taiping-02.jpg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“Is not this insurgent movement truly wonderful? These rebels keep Sabbath as we do, they pray to God daily, they read the Scriptures, they break the idols, and they long for the time when, instead of those heathen temples, they shall have Christian chapels, and worship together with us… is it not a remarkable era in China?”</em>&nbsp; — A Christian missionary wife about the Taiping Rebellion&nbsp;</p><p class=\"\"><em>“Jesus our Elder Brother showed us the treacherous heart of this demon follower.”</em> — Sign hanging around the neck of a man executed by the Taiping&nbsp;</p><p class=\"\"><em>“Those who believe not in the true doctrine of God and Jesus, though they be old acquaintances, are still no friends of mine, but they are demons.”</em> — Hong Xiuquan&nbsp;</p><p class=\"\">If I were to ask you which is the deadliest conflict in history, you’d probably answer WW II. But if I were to ask you which is the second deadliest conflict ever—at least according to most historians—I’d bet the number of raised hands would shrink quickly. And I’d also bet that a good percentage of those taking their chances with an answer would probably be wrong. So, welcome to the wildest, weirdest, biggest conflict in history that few people have heard about (that is…unless you are quite knowledgeable about Chinese history). Millions of troops took part in this war. Something in the neighborhood of 600 cities changed hands over decade and half of fighting. Conservative estimates place the dead around 20-30 millions (some estimates go as high as 100 millions.) For frame of references, this is deadlier than the Iraq War, the War in Afghanistan, the Vietnam War, the Korean War, the Spanish American War, the American Civil War and the American Revolution put together. We can also throw in the 7 Years War, all three Punic wars and all of the Crusades for good measure. In light of this, it may begin to make sense why several historians believe this is the bloodiest civil war of all time. &nbsp;</p><p class=\"\">It all began with a Chinese man who, in the mid-1800s, dreamed of becoming a scholar and receive a government job. Seems like an innocent start, right? Well, our wannabe intellectual, a certain Hong Xiuquan, experienced a major crisis when he realized that no matter how much he studied, he would not succeed at passing the imperial exams, that were the prerequisite to getting the career he dreamed of. The fact that he failed was more than a personal tragedy for Hong. Rather, this failure would trigger a sequence of events leading to the death of millions. This was easily the most costly F in the history of education. Broken to the core, he had a mental breakdown, and began to experience visions. These visions revealed to him that he was God’s son, and Jesus’ younger brother, and he was tasked by his heavenly relatives to clean China off any demonic influences in order to create the Kingdom of Heavenly Peace. His efforts to create this Heavenly Kingdom of Great Peace heralded a bloody civil war with a body count that would make most video gamers blush.</p><p class=\"\">In this episode, we follow Hong Xiuquan as he graduates from religious intolerance to armed insurrection against the government. We also run into angels torturing Confucius, ‘God’ & ‘Jesus’ & ‘Jesus’ younger brother’ leading an army to topple the Qing Dynasty, a massive army of sexually frustrated people, the capture of Nanjing, Quentin Tarantino’s Biblical tales, the Taiping turning into The Sopranos, ‘Jesus’ younger brother’ placing a hit on ‘God’s Voice’, and much more.&nbsp;</p><p class=\"\">If you'd like to keep following my work on Luminary, please follow my personal link to their platform to sign up. Thank you for understanding that this move is necessary to keep History on Fire viable. <a href=\"https://luminarypodcasts.com/signup?_branch_match_id=486767570160189673\">luminary.link/history</a>&nbsp;</p><p class=\"\">Onnit has shown me love from day 1. So, please check out their supplements, special foods, clothing, and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;<br>My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>.&nbsp;</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "media:content": {
    "media:title": "EPISODE 64: The Taiping Rebellion (Part 2): Jesus’ Chinese Younger Brother"
  }
}