{
  "title": "Temporal Consistency Learning of inter-frames for Video Super-Resolution. (arXiv:2211.01639v1 [cs.CV])",
  "link": "http://arxiv.org/abs/2211.01639",
  "description": "<p>Video super-resolution (VSR) is a task that aims to reconstruct\nhigh-resolution (HR) frames from the low-resolution (LR) reference frame and\nmultiple neighboring frames. The vital operation is to utilize the relative\nmisaligned frames for the current frame reconstruction and preserve the\nconsistency of the results. Existing methods generally explore information\npropagation and frame alignment to improve the performance of VSR. However, few\nstudies focus on the temporal consistency of inter-frames. In this paper, we\npropose a Temporal Consistency learning Network (TCNet) for VSR in an\nend-to-end manner, to enhance the consistency of the reconstructed videos. A\nspatio-temporal stability module is designed to learn the self-alignment from\ninter-frames. Especially, the correlative matching is employed to exploit the\nspatial dependency from each frame to maintain structural stability. Moreover,\na self-attention mechanism is utilized to learn the temporal correspondence to\nimplement an adaptive warping operation for temporal consistency among\nmulti-frames. Besides, a hybrid recurrent architecture is designed to leverage\nshort-term and long-term information. We further present a progressive fusion\nmodule to perform a multistage fusion of spatio-temporal features. And the\nfinal reconstructed frames are refined by these fused features. Objective and\nsubjective results of various experiments demonstrate that TCNet has superior\nperformance on different benchmark datasets, compared to several\nstate-of-the-art methods.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Liu_M/0/1/0/all/0/1\">Meiqin Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Jin_S/0/1/0/all/0/1\">Shuo Jin</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Yao_C/0/1/0/all/0/1\">Chao Yao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Lin_C/0/1/0/all/0/1\">Chunyu Lin</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhao_Y/0/1/0/all/0/1\">Yao Zhao</a>"
}