{
  "title": "Episode 114 (video): Finding Little Albert",
  "pubDate": "Tue, 05 Jan 2010 14:19:31 +0000",
  "guid": "episode-114-video-finding-little-albert",
  "link": "http://www.thepsychfiles.com/2010/01/episode-114-video-finding-little-albert/",
  "itunes:image": "",
  "description": "Little Albert - one of the most famous subjects in the history of psychology - has finally been identified.  Researchers spent 7 years tracking down every possible lead in order to discover who John Watson's \"Albert B\" really was.  In this video episode I take you through each step of the extensive detective work to uncover his identity.  It's a fascinating, creative, and in the end touching journey.  Some never seen before pictures are included.  Join me in this episode of The Psych Files.",
  "content:encoded": "Little Albert - one of the most famous subjects in the history of psychology - has finally been identified.  Researchers spent 7 years tracking down every possible lead in order to discover who John Watson's \"Albert B\" really was.  In this video episode I take you through each step of the extensive detective work to uncover his identity.  It's a fascinating, creative, and in the end touching journey.  Some never seen before pictures are included.  Join me in this episode of The Psych Files.",
  "enclosure": "",
  "itunes:duration": "19:22",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology,lecture",
  "itunes:subtitle": "Little Albert, one of the most famous subjects in the history of psychology has finally been identified. It's a fascinating, creative, and in the end touching journey.  Never seen before pictures are included.  Join me in this episode of The Psych Files.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Little Albert - one of the most famous subjects in the history of psychology - has finally been identified. Researchers spent 7 years tracking down every possible lead in order to discover who John Watson's \"Albert B\" really was. In this video episode I take you through each step of the extensive detective work to uncover his identity. It's a fascinating, creative, and in the end touching journey. Some never seen before pictures are included. Join me in this episode of The Psych Files."
}