{
  "id": "tag:blogger.com,1999:blog-8878620400258430757.post-2245966937666085008",
  "published": "2019-06-09T15:18:00.001-07:00",
  "updated": "2019-06-09T15:20:42.597-07:00",
  "title": "Advice from Googlers heading to Consortium’s flagship MBA conference June 8-12.",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\"><div style=\"text-align: left;\"><br />From June 8-12 the <a href=\"https://cgsm.org/orientation-program/upcoming-program/\">Consortium Graduate Study in Mangemen’s 53rd annual Orientation Program </a>(#CGSM53, also affectionately referred to as “OP”) will take place in Houston, Texas. Consortium awards merit-based, full-tuition fellowships to top MBA candidates who have a proven record of promoting diversity and&nbsp; inclusion. 500+ incoming MBA students from 20 member schools will engage in this immersive experience where they’ll participate in various informational and networking opportunities with their educational institutions, dozens of corporate partners, and their peers.<br /><br />A team of 20 Googlers, many of them proud Consortium alumni themselves, will be on the ground. Before the fun begins, Googlers offered their advice to students heading to OP and other career fairs, conventions, and conferences.<br /><br /><i>Editor’s note: all Googlers interviewed and cited will be on the ground at #CGSM53, be sure to drop by our booth and say, “Hi.” We’d love to meet you!&nbsp;</i><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-ckkvWuLqxl0/XP2E1_whu2I/AAAAAAAAAko/CmP3UTFe1hYMlZIA5HXa5nwyv94spYxNwCEwYBhgL/s1600/MVIMG_20180612_112752.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1600\" data-original-width=\"1200\" height=\"640\" src=\"https://1.bp.blogspot.com/-ckkvWuLqxl0/XP2E1_whu2I/AAAAAAAAAko/CmP3UTFe1hYMlZIA5HXa5nwyv94spYxNwCEwYBhgL/s640/MVIMG_20180612_112752.jpg\" width=\"480\" /></a></div><br /><b>Can you tell us about the resources you use to prepare for a conference?</b><br /><blockquote class=\"tr_bq\" style=\"text-align: left;\">“Quora, Financial results/reporting for each company, company websites, Glassdoor.”<br />- Gbadebo (Debo) Aderibigbe, Cornell Johnson Graduate School of Management, Product Manager - GCP Cloud Services Platform</blockquote><blockquote class=\"tr_bq\">“I used Google and YouTube a lot to learn about various companies and industries, and to brush up on networking and interviewing skills. This was way before I even thought about working here!”<br />- Jonathan Beauford, Yale School of Management, Student Development Program Manager</blockquote><b>What do you wish you knew before you attended your own Consortium OP?</b><br /><blockquote class=\"tr_bq\">“There is a lot of opportunity — and a lot of access, but you don't have to apply for every job! Come looking to learn. Ask questions in a space where you are competing less for resources/time than you will be during regular recruiting. Be open-minded to opportunities that drive you towards your ultimate goal for your MBA.<br />- Debo Aderibigbe</blockquote><blockquote class=\"tr_bq\">“Take the time to get to know people from other Consortium schools. You'll have the next two years to spend with your future classmates, but only a few days to network with hundreds of students from other schools. Make the most of it.”<br />- Ryan Steele, University of Michigan’s Ross School of Business, Product Support Manager - G Suite</blockquote><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-4-e-1snPpD0/XP2E1IqijRI/AAAAAAAAAk0/rMsw4NtkbMMRVvgVIVHx3ZeF5rZc_r8WACEwYBhgL/s1600/IMG_20180612_115903.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1600\" data-original-width=\"1200\" height=\"640\" src=\"https://1.bp.blogspot.com/-4-e-1snPpD0/XP2E1IqijRI/AAAAAAAAAk0/rMsw4NtkbMMRVvgVIVHx3ZeF5rZc_r8WACEwYBhgL/s640/IMG_20180612_115903.jpg\" width=\"480\" /></a></div><br /><b>What was the most exciting part of your Consortium OP experience? Any magical moments?</b><br /><blockquote class=\"tr_bq\">“The conferences I attended during my pre-MBA experience were some of my first times being around so many ambitious people of color that looked like me. It was truly magical. I loved making new friends and connecting with students from other schools and I've been fortunate to grow quite close to some.”<br />- Tiffany Anderson, Emory University's Goizueta Business School, Product Support Manager - gTech</blockquote><blockquote class=\"tr_bq\">“The most exciting part of OP for me was the exposure to a wide variety of companies and industries that I hadn’t considered,&nbsp; including Google. I was undecided on my post-MBA career path going into business school, and it was a great opportunity to learn about opportunities and industries that I otherwise may not have considered.”<br />- Ryan Steele</blockquote><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-rVsiGkCneaA/XP2E0wfo-rI/AAAAAAAAAks/iLpDGVYFCnU40jMwvnIrfI9-M316JI-GQCEwYBhgL/s1600/IMG_20180612_143017.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1200\" data-original-width=\"1600\" height=\"480\" src=\"https://1.bp.blogspot.com/-rVsiGkCneaA/XP2E0wfo-rI/AAAAAAAAAks/iLpDGVYFCnU40jMwvnIrfI9-M316JI-GQCEwYBhgL/s640/IMG_20180612_143017.jpg\" width=\"640\" /></a></div><br /><b>Do you have any tips you’d like to share with aspiring Googlers?</b><br /><blockquote class=\"tr_bq\">“It's easy to stretch yourself too thin in business school, focus on the things that you're passionate about and really interest you and dive into them!”<br />- Ben Schwartzbach, New York University - Stern School of Business, Product Specialist - Hardware</blockquote><blockquote class=\"tr_bq\">“Talk to all of the Googlers if you can and get their perspectives on what they and the others around them seem to do to be successful!”<br />-Debo Aderibigbe</blockquote><blockquote class=\"tr_bq\">“Google has opportunities in probably every function that you could think of (and some you wouldn't think of). Don't assume that there's no place for you here if you don't have technical skills or a particular experience. Focus on your transferable skills and keep an open mind in terms of how those skills might be applied to a new field.”<br />- Jonathan Beauford</blockquote><blockquote class=\"tr_bq\">“Be open about opportunities at Google. There are a lot opportunities to drive impact at Google as an intern and post-MBA full-time hire.”<br />- JoAnne Williams, Columbia Business School, Sr. Financial Analyst, Retail Marketing Finance</blockquote><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-Ark8cJIFyFo/XP2E1EhtQxI/AAAAAAAAAkw/TPCXpf0fJV4gI9NI9ge3UenBg6AeiNcnwCEwYBhgL/s1600/IMG_20180612_090503.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1200\" data-original-width=\"1600\" height=\"480\" src=\"https://1.bp.blogspot.com/-Ark8cJIFyFo/XP2E1EhtQxI/AAAAAAAAAkw/TPCXpf0fJV4gI9NI9ge3UenBg6AeiNcnwCEwYBhgL/s640/IMG_20180612_090503.jpg\" width=\"640\" /></a></div><br /><b>Any other advice for tackling a multi-day conference?</b><br /><blockquote class=\"tr_bq\">“All of the companies are there to get to know you! Use the opportunity to explore companies you may not have originally targeted”<br />- Jasmin Herrera, Tuck School of Business - Dartmouth College, Business Operations &amp; Strategy Lead - Global Partnerships</blockquote><blockquote class=\"tr_bq\">“Do your research in advance and ask tough questions — it's a two-way experience! Be you — everyone else is taken! Smile and come say hi!”<br />- Tiffany Anderson</blockquote><blockquote class=\"tr_bq\">“Be your authentic self — always.”<br />- Dapo Adeshiyan&nbsp;</blockquote>Even if you're not at #CGSM53 we hope you can apply some of this advice to your next career fair, convention, or conference.&nbsp;</div></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google Students",
    "uri": "http://www.blogger.com/profile/15517669815238556768",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 6
}