{
  "title": "Episode 128: &#8220;Mr. Tambourine Man&#8221; by the Byrds",
  "link": "https://500songs.com/podcast/episode-128-mr-tambourine-man-by-the-byrds/",
  "pubDate": "Thu, 22 Jul 2021 10:07:32 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=842",
  "description": "Episode one hundred and twenty-eight of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Mr. Tambourine Man\" by the Byrds, and the start of LA folk-rock. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/53980470\">on \"I Got You Babe\" by Sonny and Cher.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Erratum</strong>\n\nThe version of this originally uploaded got the date of the Dylan tour filmed for <em>Don't Look Back</em> wrong. I edited out the half-sentence in question when this was pointed out to me very shortly after uploading.\n\n<strong>Resources</strong>\n\nAs usual, I’ve created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-128-mr-tambourine-man/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode (with the exception of the early Gene Clark demo snippet, which I've not been able to find a longer version of).\n\nFor information on Dylan and the song, I've mostly used these books:\n\n<a href=\"https://amzn.to/2ZovBkl\">Bob Dylan: All The Songs by Phillipe Margotin and Jean-Michel Guesdon</a> is a song-by-song look at every song Dylan ever wrote, as is <a href=\"https://amzn.to/3k7ct2a\">Revolution in the Air,</a> by Clinton Heylin.\n\nHeylin also wrote the most comprehensive and accurate biography of Dylan, <a href=\"https://amzn.to/35tC1mp\">Behind the Shades</a>.\n\nI’ve also used <a href=\"https://amzn.to/35iNB3A\">Robert Shelton’s No Direction Home</a>, which is less accurate, but which is written by someone who knew Dylan.\n\nWhile for the Byrds, I relied mostly on <a href=\"https://amzn.to/3rsesTF\">Timeless Flight Revisited by Johnny Rogan,</a> with some information from <a href=\"https://amzn.to/36RTDrp\">Chris Hillman's autobiography</a>.\n\n<a href=\"https://amzn.to/3rpSZLj\">This three-CD set</a> is a reasonable way of getting most of the Byrds' important recordings, while <a href=\"https://amzn.to/3zfOi9A\">this</a> contains the pre-Byrds recordings the group members did with Jim Dickson.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday we're going to take a look at one of the pivotal recordings in folk-rock music, a track which, though it was not by any means the first folk-rock record, came to define the subgenre in the minds of the listening public, and which by bringing together the disparate threads of influence from Bob Dylan, the Searchers, the Beatles, and the Beach Boys, manages to be arguably the record that defines early 1965. We're going to look at \"Mr. Tambourine Man\" by the Byrds:\n\n[Excerpt: The Byrds, \"Mr. Tambourine Man\"]\n\nFolk-rock as a genre was something that was bound to happen sooner rather than later. We've already seen how many of the British R&B bands that were becoming popular in the US were influenced by folk music, with records like \"House of the Rising Sun\" taking traditional folk songs and repurposing them for a rock idiom. And as soon as British bands started to have a big influence on American music, that would have to inspire a reassessment by American musicians of their own folk music.\n\nBecause of course, while the British bands were inspired by rock and roll, they were all also coming from a skiffle tradition which saw Woody Guthrie, Lead Belly, Big Bill Broonzy, and the rest as being the people to emulate, and that would show up in their music. Most of the British bands came from the bluesier end of the folk tradition -- with the exception of the Liverpool bands, who pretty much all liked their Black music on the poppy side and their roots music to be more in a country vein -- but they were still all playing music which showed the clear influence of country and folk as well as blues.\n\nAnd that influence was particularly obvious to those American musicians who were suddenly interested in becoming rock and roll stars, but who had previously been folkies. Musicians like Gene Clark.\n\nGene Clark was born in Missouri, and had formed a rock and roll group in his teens called Joe Meyers and the Sharks. According to many biographies, the Sharks put out a record of Clark's song \"Blue Ribbons\", but as far as I've been able to tell, this was Clark embellishing things a great deal -- the only evidence of this song that anyone has been able to find is a home recording from this time, of which a few seconds were used in a documentary on Clark:\n\n[Excerpt: Gene Clark, \"Blue Ribbons\"]\n\nAfter his period in the Sharks, Clark became a folk singer, starting out in a group called the Surf Riders. But in August 1963 he was spotted by the New Christy Minstrels, a fourteen-piece ultra-commercial folk group who had just released a big hit single, \"Green Green\", with a lead sung by one of their members, Barry McGuire:\n\n[Excerpt: The New Christy Minstrels, \"Green Green\"]\n\nClark was hired to replace a departing member, and joined the group, who as well as McGuire at that time also included Larry Ramos, who would later go on to join The Association and sing joint lead on their big hit \"Never My Love\":\n\n[Excerpt: The Association, \"Never My Love\"]\n\nClark was only in the New Christy Minstrels for a few months, but he appeared on several of their albums -- they recorded four albums during the months he was with the group, but there's some debate as to whether he appeared on all of them, as he may have missed some recording sessions when he had a cold. Clark didn't get much opportunity to sing lead on the records, but he was more prominent in live performances, and can be seen and heard in the many TV appearances the group did in late 1963:\n\n[Excerpt: The New Christy Minstrels, \"Julianne\"]\n\nBut Clark was not a good fit for the group -- he didn't put himself forward very much, which meant he didn't get many lead vocals, which meant in turn that he seemed not to be pulling his weight. But the thing that really changed his mind came in late 1963, on tour in Canada, when he heard this:\n\n[Excerpt: The Beatles, \"She Loves You\"]\n\nClark knew instantly that that was the kind of music he wanted to be making, and when \"I Want to Hold Your Hand\" came out in the US soon afterwards, it was the impetus that Clark needed in order to quit the group and move to California. There he visited the Troubadour club in Los Angeles, and saw another performer who had been in an ultra-commercial folk group until he had been bitten by the Beatle bug -- Roger McGuinn.\n\nOne note here -- Roger McGuinn at this point used his birth name, but he changed it for religious reasons in 1967.  I've been unable to find out his views on his old name -- whether he considers it closer to a trans person's deadname which would be disrespectful to mention, or to something like Reg Dwight becoming Elton John or David Jones becoming David Bowie. As I presume everyone listening to this has access to a search engine and can find out his birth name if at all interested, I'll be using \"Roger McGuinn\" throughout this episode, and any other episodes that deal with him, at least until I find out for certain how he feels about the use of that name.\n\nMcGuinn had grown up in Chicago, and become obsessed with the guitar after seeing Elvis on TV in 1956, but as rockabilly had waned in popularity he had moved into folk music, taking lessons from Frank Hamilton, a musician who had played in a group with Ramblin' Jack Elliot, and who would later go on to join a 1960s lineup of the Weavers. Hamilton taught McGuinn Lead Belly and Woody Guthrie songs, and taught him how to play the banjo. Hamilton also gave McGuinn an enthusiasm for the twelve-string guitar, an instrument that had been popular among folk musicians like Lead Belly, but which had largely fallen out of fashion.\n\nMcGuinn became a regular in the audience at the Gate of Horn, a folk club owned by Albert Grossman, who would later become Bob Dylan's manager, and watched performers like Odetta and Josh White. He also built up his own small repertoire of songs by people like Ewan MacColl, which he would perform at coffee shops. At one of those coffee shops he was seen by a member of the Limeliters, one of the many Kingston Trio-alike groups that had come up during the folk boom. The Limeliters were after a guitarist to back them, and offered McGuinn the job. He turned it down at first, as he was still in school, but as it turned out the job was still open when he graduated, and so young McGuinn found himself straight out of school playing the Hollywood Bowl on a bill including Eartha Kitt. McGuinn only played with the Limeliters for six weeks, but in that short time he ended up playing on a top five album, as he was with them at the Ash Grove when they recorded their live album Tonight in Person:\n\n[Excerpt: The Limeliters, \"Madeira, M'Dear\"]\n\nAfter being sacked by the Limeliters, McGuinn spent a short while playing the clubs around LA, before being hired by another commercial folk group, the Chad Mitchell Trio, who like the Limeliters before them needed an accompanist. McGuinn wasn't particularly happy working with the trio, who in his telling regarded themselves as the stars and McGuinn very much as the hired help. He also didn't respect them as musicians, and thought they were little to do with folk music as he understood the term.\n\nDespite this, McGuinn stayed with the Chad Mitchell Trio for two and a half years, and played on two albums with them -- Mighty Day on Campus, and Live at the Bitter End:\n\n[Excerpt: The Chad Mitchell Trio, \"The John Birch Society\" ]\n\nMcGuinn stuck it out with the Chad Mitchell trio until his twentieth birthday, and he was just about to accept an offer to join the New Christy Minstrels himself when he got a better one. Bobby Darin was in the audience at a Chad Mitchell Trio show, and approached McGuinn afterwards. Darin had started out in the music business as a songwriter, working with his friend Don Kirshner, but had had some success in the late fifties and early sixties as one of the interchangeable teen idol Bobbies who would appear on American Bandstand, with records like \"Dream Lover\" and \"Splish Splash\":\n\n[Excerpt: Bobby Darin, \"Splish Splash\"]\n\nBut Darin had always been more musically adventurous than most of his contemporaries, and with his hit version of \"Mack the Knife\" he had successfully moved into the adult cabaret market. And like other singers breaking into that market, like Sam Cooke, he had decided to incorporate folk music into his act. He would do his big-band set, then there would be a fifteen-minute set of folk songs, backed just by guitar and stand-up bass. Darin wanted McGuinn to be his guitarist and backing vocalist for these folk sets, and offered to double what the Chad Mitchell Trio was paying him.\n\nDarin wasn't just impressed with McGuinn's musicianship -- he also liked his showmanship, which came mostly from McGuinn being bored and mildly disgusted with the music he was playing on stage. He would pull faces behind the Chad Mitchell Trio's back, the audience would laugh, and the trio would think the laughter was for them.\n\nFor a while, McGuinn was happy playing with Darin, who he later talked about as being a mentor. But then Darin had some vocal problems and had to take some time off the road. However, he didn't drop McGuinn altogether -- rather, he gave him a job in the Brill Building, writing songs for Darin's publishing company. One of the songs he wrote there was \"Beach Ball\", co-written with Frank Gari. A knock-off of \"Da Doo Ron Ron\", retooled as a beach party song, the recording released as by the City Surfers apparently features McGuinn, Gari, Darin on drums and Terry Melcher on piano:\n\n[Excerpt: The City Surfers, \"Beach Ball\"]\n\nThat wasn't a hit, but a cover version by Jimmy Hannan was a local hit in Melbourne, Australia:\n\n[Excerpt: Jimmy Hannan “Beach Ball”]\n\nThat record is mostly notable for its backing vocalists, three brothers who would soon go on to become famous as the Bee Gees.\n\nDarin soon advised McGuinn that if he really wanted to become successful, he should become a rock and roll singer, and so McGuinn left Darin's employ and struck out as a solo performer, playing folk songs with a rock backbeat around Greenwich Village, before joining a Beatles tribute act playing clubs around New York. He was given further encouragement by Dion DiMucci, another late-fifties singer who like Darin was trying to make the transition to playing for adult crowds. DiMucci had been lead singer of Dion and the Belmonts, but had had more success as a solo act with records like \"The Wanderer\":\n\n[Excerpt: Dion, \"The Wanderer\"]\n\nDion was insistent that McGuinn had something -- that he wasn't just imitating the Beatles, as he thought, but that he was doing something a little more original. Encouraged by Dion, McGuinn made his way west to LA, where he was playing the Troubadour supporting Roger Miller, when Gene Clark walked in.\n\nClark saw McGuinn as a kindred spirit -- another folkie who'd had his musical world revolutionised by the Beatles -- and suggested that the two become a duo, performing in the style of Peter and Gordon, the British duo who'd recently had a big hit with \"World Without Love\", a song written for them by Paul McCartney:\n\n[Excerpt: Peter and Gordon, \"World Without Love\"]\n\nThe duo act didn't last long though, because they were soon joined by a third singer, David Crosby. Crosby had grown up in LA -- his father, Floyd Crosby, was an award-winning cinematographer, who had won an Oscar for his work on Tabu: A Story of the South Seas, and a Golden Globe for High Noon, but is now best known for his wonderfully lurid work on a whole series of films starring Vincent Price, including The Pit and the Pendulum, House of Usher, Tales of Terror, and Comedy of Terrors.\n\nLike many children of privilege, David had been a spoiled child, and he had taken to burglary for kicks, and had impregnated a schoolfriend and then run off rather than take responsibility for the child. Travelling across the US as a way to escape the consequences of his actions, he had spent some time hanging out with musicians like Fred Neil, Paul Kantner, and Travis Edmondson, the latter of whom had recorded a version of Crosby's first song, \"Cross the Plains\":\n\n[Excerpt: Travis Edmondson, \"Cross the Plains\"]\n\nEdmondson had also introduced Crosby to cannabis, and Crosby soon took to smoking everything he could, even once smoking aspirin to see if he could get high from that. When he'd run out of money, Crosby, like Clark and McGuinn, had joined an ultra-commercial folk group. In Crosby's case it was Les Baxter's Balladeers, put together by the bandleader who was better known for his exotica recordings. While Crosby was in the Balladeers, they were recorded for an album called \"Jack Linkletter Presents A Folk Festival\", a compilation of live recordings hosted by the host of Hootenanny:\n\n[Excerpt: Les Baxter's Balladeers, \"Ride Up\"]\n\nIt's possible that Crosby got the job with Baxter through his father's connections -- Baxter did the music for many films made by Roger Corman, the producer and director of those Vincent Price films. Either way, Crosby didn't last long in the Balladeers.\n\nAfter he left the group, he started performing solo sets, playing folk music but with a jazz tinge to it -- Crosby was already interested in pushing the boundaries of what chords and melodies could be used in folk. Crosby didn't go down particularly well with the folk-club crowds, but he did impress one man.\n\nJim Dickson had got into the music industry more or less by accident -- he had seen the comedian Lord Buckley, a white man who did satirical routines in a hipsterish argot that owed more than a little to Black slang, and had been impressed by him. He had recorded Buckley with his own money, and had put out Buckley's first album Hipsters, Flipsters and Finger Poppin' Daddies, Knock Me Your Lobes on his own label, before selling the rights of the album to Elektra records:\n\n[Excerpt: Lord Buckley, \"Friends, Romans, Countrymen\"]\n\nDickson had gone on to become a freelance producer, often getting his records put out by Elektra, making both jazz records with people like Red Mitchell:\n\n[Excerpt: Red Mitchell, \"Jim's Blues\"]\n\nAnd country, folk, and bluegrass records, with people like the Dillards, whose first few albums he produced:\n\n[Excerpt: The Dillards, \"Duelling Banjos\"]\n\nDickson had also recently started up a publishing company, Tickson Music, with a partner, and the first song they had published had been written by a friend of Crosby's, Dino Valenti, with whom at one point Crosby had shared a houseboat:\n\n[Excerpt: Dino Valenti, \"Get Together\"]\n\nUnfortunately for Dickson, before that song became a big hit for the Youngbloods, he had had to sell the rights to it, to the Kingston Trio's managers, as Valenti had been arrested and needed bail money, and it was the only way to raise the funds required.\n\nDickson liked Crosby's performance, and became his manager. Dickson had access to a recording studio, and started recording Crosby singing traditional songs and songs to which Dickson owned the copyright -- at this point Crosby wasn't writing much, and so Dickson got him to record material like \"Get Together\":\n\n[Excerpt: David Crosby, \"Get Together\"]\n\nUnfortunately for Crosby, Dickson's initial idea, to get him signed to Warner Brothers records as a solo artist using those recordings, didn't work out.\n\nBut Gene Clark had seen Crosby perform live and thought he was impressive. He told McGuinn about him, and the three men soon hit it off -- they were able to sing three-part harmony together as soon as they met. ( This is one characteristic of Crosby that acquaintances often note -- he's a natural harmony singer, and is able to fit his voice into pre-existing groups of other singers very easily, and make it sound natural). Crosby introduced the pair to Dickson, who had a brainwave. These were folkies, but they didn't really sing like folkies -- they'd grown up on rock and roll, and they were all listening to the Beatles now.\n\nThere was a gap in the market, between the Beatles and Peter, Paul, and Mary, for something with harmonies, a soft sound, and a social conscience, but a rock and roll beat. Something that was intelligent, but still fun, and which could appeal to the screaming teenage girls and to the college kids who were listening to Dylan. In Crosby, McGuinn, and Clark, Dickson thought he had found the people who could do just that.\n\nThe group named themselves The Jet Set -- a name thought up by McGuinn, who loved flying and everything about the air, and which they also thought gave them a certain sophistication -- and their first demo recording, with all three of them on twelve-string guitars, shows the direction they were going in. \"The Only Girl I Adore\", written by McGuinn and Clark, has what I can only assume is the group trying for Liverpool accents and failing miserably, and call and response and \"yeah yeah\" vocals that are clearly meant to evoke the Beatles. It actually does a remarkably good job of evoking some of Paul McCartney's melodic style -- but the rhythm guitar is pure Don Everly:\n\n[Excerpt: The Jet Set, \"The Only Girl I Adore\"]\n\nThe Jet Set jettisoned their folk instruments for good after watching A Hard Day's Night -- Roger McGuinn traded in his banjo and got an electric twelve-string Rickenbacker just like the one that George Harrison played, and they went all-in on the British Invasion sound, copying the Beatles but also the Searchers, whose jangly sound was perfect for the Rickenbacker, and who had the same kind of solid harmony sound the Jet Set were going for.\n\nOf course, if you're going to try to sound like the Beatles and the Searchers, you need a drummer, and McGuinn and Crosby were both acquainted with a young man who had been born Michael Dick, but who had understandably changed his name to Michael Clarke. He was only eighteen, and wasn't a particularly good drummer, but he did have one huge advantage, which is that he looked exactly like Brian Jones.\n\nSo the Jet Set now had a full lineup -- Roger McGuinn on lead guitar, Gene Clark on rhythm guitar, David Crosby was learning bass, and Michael Clarke on drums. But that wasn't the lineup on their first recordings. Crosby was finding it difficult to learn the bass, and Michael Clarke wasn't yet very proficient on drums, so for what became their first record Dickson decided to bring in a professional rhythm section, hiring two of the Wrecking Crew, bass player Ray Pohlman and drummer Earl Palmer, to back the three singers, with McGuinn and Gene Clark on guitars:\n\n[Excerpt: The Beefeaters, \"Please Let Me Love You\"]\n\nThat was put out on a one-single deal with Elektra Records, and Jim Dickson made the deal under the condition that it couldn't be released under the group's real name -- he wanted to test what kind of potential they had without spoiling their reputation. So instead of being put out as by the Jet Set, it was put out as by the Beefeaters -- the kind of fake British name that a lot of American bands were using at the time, to try and make themselves seem like they might be British.\n\nThe record did nothing, but nobody was expecting it to do much, so they weren't particularly bothered. And anyway, there was another problem to deal with. David Crosby had been finding it difficult to play bass and sing -- this was one reason that he only sang, and didn't play, on the Beefeaters single. His bass playing was wooden and rigid, and he wasn't getting better. So it was decided that Crosby would just sing, and not play anything at all.\n\nAs a result, the group needed a new bass player, and Dickson knew someone who he thought would fit the bill, despite him not being a bass player.\n\nChris Hillman had become a professional musician in his teens, playing mandolin in a bluegrass group called the Scottsville Squirrel Barkers, who made one album of bluegrass standards for sale through supermarkets:\n\n[Excerpt: The Scottsville Squirrel Barkers, \"Shady Grove\"]\n\nHillman had moved on to a group called the Golden State Boys, which featured two brothers, Vern and Rex Gosdin. The Golden State Boys had been signed to a management contract by Dickson, who had renamed the group the Hillmen after their mandolin player -- Hillman was very much in the background in the group, and Dickson believed that he would be given a little more confidence if he was pushed to the front. The Hillmen had recorded one album, which wasn't released until many years later, and which had featured Hillman singing lead on the Bob Dylan song \"When the Ship Comes In\":\n\n[Excerpt: The Hillmen, \"When the Ship Comes In\"]\n\nHillman had gone on from there to join a bluegrass group managed by Randy Sparks, the same person who was in charge of the New Christy Minstrels, and who specialised in putting out ultra-commercialised versions of roots music for pop audiences. But Dickson knew that Hillman didn't like playing with that group, and would be interested in doing something very different, so even though Hillman didn't play bass, Dickson invited him to join the group.\n\nThere was almost another lineup change at this point, as well. McGuinn and Gene Clark were getting sick of David Crosby's attitude -- Crosby was the most technically knowledgeable musician in the group, but was at this point not much of a songwriter. He was not at all shy about pointing out what he considered flaws in the songs that McGuinn and Clark were writing, but he wasn't producing anything better himself. Eventually McGuinn and Clark decided to kick Crosby out of the group altogether, but they reconsidered when Dickson told them that if Crosby went he was going too. As far as Dickson was concerned, the group needed Crosby's vocals, and that was an end of the matter. Crosby was back in the group, and all was forgotten.\n\nBut there was another problem related to Crosby, as the Jet Set found out when they played their first gig, an unannounced spot at the Troubadour. The group had perfected their image, with their Beatles suits and pose of studied cool, but Crosby had never performed without an instrument before. He spent the gig prancing around the stage, trying to act like a rock star, wiggling his bottom in what he thought was a suggestive manner.\n\nIt wasn't, and the audience found it hilarious. Crosby, who took himself very seriously at this point in time, felt humiliated, and decided that he needed to get an instrument to play. Obviously he couldn't go back to playing bass, so he did the only thing that seemed possible -- he started undermining Gene Clark's confidence as a player, telling him he was playing behind the beat. Clark -- who was actually a perfectly reasonable rhythm player -- was non-confrontational by nature and believed Crosby's criticisms. Soon he *was* playing behind the beat, because his confidence had been shaken. Crosby took over the rhythm guitar role, and from that point on it would be Gene Clark, not David Crosby, who would have to go on stage without an instrument.\n\nThe Jet Set were still not getting very many gigs, but they were constantly in the studio, working on material. The most notable song they recorded in this period is \"You Showed Me\", a song written by Gene Clark and McGuinn, which would not see release at the time but which would later become a hit for both the Turtles and the Lightning Seeds:\n\n[Excerpt: The Jet Set, \"You Showed Me\"]\n\nClark in particular was flourishing as a songwriter, and becoming a genuine talent. But Jim Dickson thought that the song that had the best chance of being the Jet Set's breakout hit wasn't one that they were writing themselves, but one that he'd heard Bob Dylan perform in concert, but which Dylan had not yet released himself.\n\nIn 1964, Dylan was writing far more material than he could reasonably record, even given the fact that his albums at this point often took little more time to record than to listen to. One song he'd written but not yet put out on an album was \"Mr. Tambourine Man\". Dylan had written the song in April 1964, and started performing it live as early as May, when he was on a UK tour that would later be memorialised in D.A. Pennebaker's film Don't Look Back. That performance was later released in 2014 for copyright extension purposes on vinyl, in a limited run of a hundred copies. I *believe* this recording is from that:\n\n[Excerpt: Bob Dylan, \"Mr. Tambourine Man (live Royal Festival Hall 1964)\"]\n\nJim Dickson remembered the song after seeing Dylan perform it live, and started pushing Witmark Music, Dylan's publishers, to send him a demo of the song. Dylan had recorded several demos, and the one that Witmark sent over was a version that was recorded with Ramblin' Jack Elliot singing harmony, recorded for Dylan's album Another Side of Bob Dylan, but left off the album as Elliot had been off key at points:\n\n[Excerpt: Bob Dylan and Ramblin' Jack Elliot, \"Mr. Tambourine Man\" (from Bootleg Series vol 7)]\n\nThere have been all sorts of hypotheses about what \"Mr. Tambourine Man\" is really about. Robert Shelton, for example, suspects the song is inspired by Thomas de Quincey's Confessions of an Opium Eater. de Quincey uses a term for opium, \"the dark idol\", which is supposedly a translation of the Latin phrase \"mater tenebrarum\", which actually means \"mother of darkness\" (or mother of death or mother of gloom). Shelton believes that Dylan probably liked the sound of \"mater tenebrarum\" and turned it into \"Mister Tambourine Man\". Others have tried to find links to the Pied Piper of Hamelin, or claimed that Mr. Tambourine Man is actually Jesus.\n\nDylan, on the other hand, had a much more prosaic explanation -- that Mr. Tambourine Man was a friend of his named Bruce Langhorne, who was prominent in the Greenwich Village folk scene. As well as being a guitarist, Langhorne was also a percussionist, and played a large Turkish frame drum, several feet in diameter, which looked and sounded quite like a massively oversized tambourine. Dylan got that image in his head and wrote a song about it. Sometimes a tambourine is just a tambourine.\n\n(Also, in a neat little coincidence, Dylan has acknowledged that he took the phrase “jingle jangle” from a routine by Jim Dickson's old client, Lord Buckley.)\n\nDickson was convinced that \"Mr. Tambourine Man\" would be a massive hit, but the group didn't like it. Gene Clark, who was at this point the group's only lead singer, didn't think it fit his voice or had anything in common with the songs he was writing. Roger McGuinn was nervous about doing a Dylan song, because he'd played at the same Greenwich Village clubs as Dylan when both were starting out -- he had felt a rivalry with Dylan then, and wasn't entirely comfortable with inviting comparisons with someone who had grown so much as an artist while McGuinn was still very much at the beginning of his career. And David Crosby simply didn't think that such a long, wordy, song had a chance of being a hit.\n\nSo Dickson started to manipulate the group. First, since Clark didn't like singing the song, he gave the lead to McGuinn. The song now had one champion in the band, and McGuinn was also a good choice as he had a hypothesis that there was a space for a vocal sound that split the difference between John Lennon and Bob Dylan, and was trying to make himself sound like that -- not realising that Lennon himself was busily working on making his voice more Dylanesque at the same time.\n\nBut that still wasn't enough -- even after Dickson worked with the group to cut the song down so it was only two choruses and one verse, and so came in under two minutes, rather than the five minutes that Dylan's original version lasted, Crosby in particular was still agitating that the group should just drop the song. So Dickson decided to bring in Dylan himself.\n\nDickson was acquainted with Dylan, and told him that he was managing a Beatles-style group who were doing one of Dylan's songs, and invited him to come along to a rehearsal. Dylan came, partly out of politeness, but also because Dylan was as aware as anyone of the commercial realities of the music business. Dylan was making most of his money at this point as a songwriter, from having other people perform his songs, and he was well aware that the Beatles had changed what hit records sounded like. If the kids were listening to beat groups instead of to Peter, Paul, and Mary, then Dylan's continued commercial success relied on him getting beat groups to perform his songs. So he agreed to come and hear Jim Dickson's beat group, and see what he thought of what they were doing with his song.\n\nOf course, once the group realised that Dylan was going to be coming to listen to them, they decided that they had better actually work on their arrangement of the song. They came up with something that featured McGuinn's Searchers-style twelve-string playing, the group's trademark harmonies, and a rather incongruous-sounding marching beat:\n\n[Excerpt: The Jet Set, \"Mr. Tambourine Man (early version)\"]\n\nDylan heard their performance, and was impressed, telling them \"You can DANCE to it!\"\n\nDylan went on a charm offensive with the group, winning all of them round except Crosby -- but even Crosby stopped arguing the point, realising he'd lost. \"Mr. Tambourine Man\" was now a regular part of their repertoire.\n\nBut they still didn't have a record deal, until one came from an unexpected direction. The group were playing their demos to a local promoter, Benny Shapiro, when Shapiro's teenage daughter came in to the room, excited because the music sounded so much like the Beatles. Shapiro later joked about this to the great jazz trumpet player Miles Davis, and Davis told his record label about this new group, and suddenly they were being signed to Columbia Records.\n\n\"Mr. Tambourine Man\" was going to be their first single, but before that they had to do something about the group's name, as Columbia pointed out that there was already a British group called the Jet Set. The group discussed this over Thanksgiving turkey, and the fact that they were eating a bird reminded Gene Clark of a song by the group's friend Dino Valenti, \"Birdses\":\n\n[Excerpt: Dino Valenti, \"Birdses\"]\n\nClark suggested \"The Birdses\", but the group agreed it wasn't quite right -- though McGuinn, who was obsessed with aviation, did like the idea of a name that was associated with flight. Dickson's business partner Eddie Tickner suggested that they just call themselves \"The Birds\", but the group saw a problem with that, too -- \"bird\" being English slang for \"girl\", they worried that if they called themselves that people might think they were gay.\n\nSo how about messing with the vowels, the same way the Beatles had changed the spelling of their name? They thought about Burds with a \"u\" and Berds with an \"e\", before McGuinn hit on Byrds with a y, which appealed to him because of Admiral Byrd, an explorer and pioneering aviator. They all agreed that the name was perfect -- it began with a \"b\", just like Beatles and Beach Boys, it was a pun like the Beatles, and it signified flight, which was important to McGuinn.\n\nAs the group entered 1965, another major event happened in McGuinn's life -- the one that would lead to him changing his name. A while earlier, McGuinn had met a friend in Greenwich Village and had offered him a joint. The friend had refused, saying that he had something better than dope. McGuinn was intrigued to try this \"something better\" and went along with his friend to what turned out to be a religious meeting, of the new religious movement Subud, a group which believes, among other things, that there are seven levels of existence from gross matter to pure spirit, and which often encourages members to change their names.\n\nMcGuinn was someone who was very much looking for meaning in his life -- around this time he also became a devotee of the self-help writer Norman Vincent Peale thanks to his mother sending him a copy of Peale's book on positive thinking -- and so he agreed to give the organisation a go. Subud involves a form of meditation called the laithan, and on his third attempt at doing this meditation, McGuinn had experienced what he believed was contact with God -- an intense hallucinatory experience which changed his life forever.\n\nMcGuinn was initiated into Subud ten days before going into the studio to record \"Mr. Tambourine Man\", and according to his self-description, whatever Bob Dylan thought the song was about, he was singing to God when he sang it -- in earlier interviews he said he was singing to Allah, but now he's a born-again Christian he tends to use \"God\".\n\nThe group had been assigned by CBS to Terry Melcher, mostly because he was the only staff producer they had on the West Coast who had any idea at all about rock and roll music, and Melcher immediately started to mould the group into his idea of what a pop group should be.\n\nFor their first single, Melcher decided that he wasn't going to use the group, other than McGuinn, for anything other than vocals. Michael Clarke in particular was still a very shaky drummer (and would never be the best on his instrument) while Hillman and Crosby were adequate but not anything special on bass and guitar. Melcher knew that the group's sound depended on McGuinn's electric twelve-string sound, so he kept that, but other than that the Byrds' only contribution to the A-side was McGuinn, Crosby, and Clark on vocals. Everything else was supplied by members of the Wrecking Crew -- Jerry Cole on guitar, Larry Knechtel on bass, Leon Russell on electric piano, and Hal Blaine on drums:\n\n[Excerpt: The Byrds, \"Mr. Tambourine Man\"]\n\nIndeed, not everyone who performed at the session is even clearly audible on the recording. Both Gene Clark and Leon Russell were actually mixed out by Melcher -- both of them are audible, Clark more than Russell, but only because of leakage onto other people's microphones.\n\nThe final arrangement was a mix of influences. McGuinn's twelve-string sound was clearly inspired by the Searchers, and the part he's playing is allegedly influenced by Bach, though I've never seen any noticeable resemblance to anything Bach ever wrote. The overall sound was an attempt to sound like the Beatles, while Melcher always said that the arrangement and feel of the track was inspired by \"Don't Worry Baby\" by the Beach Boys. This is particularly noticeable in the bass part -- compare the part on the Beach Boys record:\n\n[Excerpt: The Beach Boys, \"Don't Worry Baby (instrumental mix with backing vocals)\"]\n\nto the tag on the Byrds record:\n\n[Excerpt: The Byrds, \"Mr. Tambourine Man\"]\n\nFive days before the Byrds recorded their single, Bob Dylan had finally recorded his own version of the song, with the tambourine man himself, Bruce Langhorne, playing guitar, and it was released three weeks before the Byrds' version, as an album track on Dylan's Bringing it All Back Home:\n\n[Excerpt: Bob Dylan, \"Mr. Tambourine Man\"]\n\nDylan's album would become one of the most important of his career, as we'll discuss in a couple of weeks, when we next look at Dylan. But it also provided an additional publicity boost for the Byrds, and as a result their record quickly went to number one in both the UK and America, becoming the first record of a Dylan song to go to number one on any chart. Dylan's place in the new pop order was now secured; the Byrds had shown that American artists could compete with the British Invasion on its own terms -- that the new wave of guitar bands still had a place for Americans; and folk-rock was soon identified as the next big commercial trend. And over the next few weeks we'll see how all those things played out throughout the mid sixties.",
  "itunes:subtitle": "Episode one hundred and twenty-eight of A History of Rock Music in Five Hundred Songs looks at Mr. Tambourine Man by the Byrds, and the start of LA folk-rock. Click the full post to read liner notes, links to more information, and a transcript of the epi",
  "itunes:keywords": "Bob Dylan,Bobby Darin,Chris Hillman,David Crosby,Dion and the Belmonts,Gene Clark,Hal Blaine,Jim Dickson,Larry Knechtel,Leon Russell,Lord Buckley,Michael Clarke,New Christie Minstrels,Roger McGuinn,Terry Melcher,The Byrds,The Dillards,The Wrecking Crew",
  "itunes:episodeType": "full",
  "itunes:episode": 128,
  "content:encoded": "Episode one hundred and twenty-eight of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Mr. Tambourine Man\" by the Byrds, and the start of LA folk-rock. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/53980470\">on \"I Got You Babe\" by Sonny and Cher.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Erratum</strong>\n\nThe version of this originally uploaded got the date of the Dylan tour filmed for <em>Don't Look Back</em> wrong. I edited out the half-sentence in question when this was pointed out to me very shortly after uploading.\n\n<strong>Resources</strong>\n\nAs usual, I’ve created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-128-mr-tambourine-man/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode (with the exception of the early Gene Clark demo snippet, which I've not been able to find a longer version of).\n\nFor information on Dylan and the song, I've mostly used these books:\n\n<a href=\"https://amzn.to/2ZovBkl\">Bob Dylan: All The Songs by Phillipe Margotin and Jean-Michel Guesdon</a> is a song-by-song look at every song Dylan ever wrote, as is <a href=\"https://amzn.to/3k7ct2a\">Revolution in the Air,</a> by Clinton Heylin.\n\nHeylin also wrote the most comprehensive and accurate biography of Dylan, <a href=\"https://amzn.to/35tC1mp\">Behind the Shades</a>.\n\nI’ve also used <a href=\"https://amzn.to/35iNB3A\">Robert Shelton’s No Direction Home</a>, which is less accurate, but which is written by someone who knew Dylan.\n\nWhile for the Byrds, I relied mostly on <a href=\"https://amzn.to/3rsesTF\">Timeless Flight Revisited by Johnny Rogan,</a> with some information from <a href=\"https://amzn.to/36RTDrp\">Chris Hillman's autobiography</a>.\n\n<a href=\"https://amzn.to/3rpSZLj\">This three-CD set</a> is a reasonable way of getting most of the Byrds' important recordings, while <a href=\"https://amzn.to/3zfOi9A\">this</a> contains the pre-Byrds recordings the group members did with Jim Dickson.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday we're going to take a look at one of the pivotal recordings in folk-rock music, a track which, though it was not by any means the first folk-rock record, came to define the subgenre in the minds of the listening public, and which by bringing together the disparate threads of influence from Bob Dylan, the Searchers, the Beatles, and the Beach Boys, manages to be arguably the record that defines early 1965. We're going to look at \"Mr. Tambourine Man\" by the Byrds:\n\n[Excerpt: The Byrds, \"Mr. Tambourine Man\"]\n\nFolk-rock as a genre was something that was bound to happen sooner rather than later. We've already seen how many of the British R&B bands that were becoming popular in the US were influenced by folk music, with records like \"House of the Rising Sun\" taking traditional folk songs and repurposing them for a rock idiom. And as soon as British bands started to have a big influence on American music, that would have to inspire a reassessment by American musicians of their own folk music.\n\nBecause of course, while the British bands were inspired by rock and roll, they were all also coming from a skiffle tradition which saw Woody Guthrie, Lead Belly, Big Bill Broonzy, and the rest as being the people to emulate, and that would show up in their music. Most of the British bands came from the bluesier end of the folk tradition -- with the exception of the Liverpool bands, who pretty much all liked their Black music on the poppy side and their roots music to be more in a country vein -- but they were still all playing music which showed the clear influence of country and folk as well as blues.\n\nAnd that influence was particularly obvious to those American musicians who were suddenly interested in becoming rock and roll stars, but who had previously been folkies. Musicians like Gene Clark.\n\nGene Clark was born in Missouri, and had formed a rock and roll group in his teens called Joe Meyers and the Sharks. According to many biographies, the Sharks put out a record of Clark's song \"Blue Ribbons\", but as far as I've been able to tell, this was Clark embellishing things a great deal -- the only evidence of this song that anyone has been able to find is a home recording from this time, of which a few seconds were used in a documentary on Clark:\n\n[Excerpt: Gene Clark, \"Blue Ribbons\"]\n\nAfter his period in the Sharks, Clark became a folk singer, starting out in a group called the Surf Riders. But in August 1963 he was spotted by the New Christy Minstrels, a fourteen-piece ultra-commercial folk group who had just released a big hit single, \"Green Green\", with a lead sung by one of their members, Barry McGuire:\n\n[Excerpt: The New Christy Minstrels, \"Green Green\"]\n\nClark was hired to replace a departing member, and joined the group, who as well as McGuire at that time also included Larry Ramos, who would later go on to join The Association and sing joint lead on their big hit \"Never My Love\":\n\n[Excerpt: The Association, \"Never My Love\"]\n\nClark was only in the New Christy Minstrels for a few months, but he appeared on several of their albums -- they recorded four albums during the months he was with the group, but there's some debate as to whether he appeared on all of them, as he may have missed some recording sessions when he had a cold. Clark didn't get much opportunity to sing lead on the records, but he was more prominent in live performances, and can be seen and heard in the many TV appearances the group did in late 1963:\n\n[Excerpt: The New Christy Minstrels, \"Julianne\"]\n\nBut Clark was not a good fit for the group -- he didn't put himself forward very much, which meant he didn't get many lead vocals, which meant in turn that he seemed not to be pulling his weight. But the thing that really changed his mind came in late 1963, on tour in Canada, when he heard this:\n\n[Excerpt: The Beatles, \"She Loves You\"]\n\nClark knew instantly that that was the kind of music he wanted to be making, and when \"I Want to Hold Your Hand\" came out in the US soon afterwards, it was the impetus that Clark needed in order to quit the group and move to California. There he visited the Troubadour club in Los Angeles, and saw another performer who had been in an ultra-commercial folk group until he had been bitten by the Beatle bug -- Roger McGuinn.\n\nOne note here -- Roger McGuinn at this point used his birth name, but he changed it for religious reasons in 1967.  I've been unable to find out his views on his old name -- whether he considers it closer to a trans person's deadname which would be disrespectful to mention, or to something like Reg Dwight becoming Elton John or David Jones becoming David Bowie. As I presume everyone listening to this has access to a search engine and can find out his birth name if at all interested, I'll be using \"Roger McGuinn\" throughout this episode, and any other episodes that deal with him, at least until I find out for certain how he feels about the use of that name.\n\nMcGuinn had grown up in Chicago, and become obsessed with the guitar after seeing Elvis on TV in 1956, but as rockabilly had waned in popularity he had moved into folk music, taking lessons from Frank Hamilton, a musician who had played in a group with Ramblin' Jack Elliot, and who would later go on to join a 1960s lineup of the Weavers. Hamilton taught McGuinn Lead Belly and Woody Guthrie songs, and taught him how to play the banjo. Hamilton also gave McGuinn an enthusiasm for the twelve-string guitar, an instrument that had been popular among folk musicians like Lead Belly, but which had largely fallen out of fashion.\n\nMcGuinn became a regular in the audience at the Gate of Horn, a folk club owned by Albert Grossman, who would later become Bob Dylan's manager, and watched performers like Odetta and Josh White. He also built up his own small repertoire of songs by people like Ewan MacColl, which he would perform at coffee shops. At one of those coffee shops he was seen by a member of the Limeliters, one of the many Kingston Trio-alike groups that had come up during the folk boom. The Limeliters were after a guitarist to back them, and offered McGuinn the job. He turned it down at first, as he was still in school, but as it turned out the job was still open when he graduated, and so young McGuinn found himself straight out of school playing the Hollywood Bowl on a bill including Eartha Kitt. McGuinn only played with the Limeliters for six weeks, but in that short time he ended up playing on a top five album, as he was with them at the Ash Grove when they recorded their live album Tonight in Person:\n\n[Excerpt: The Limeliters, \"Madeira, M'Dear\"]\n\nAfter being sacked by the Limeliters, McGuinn spent a short while playing the clubs around LA, before being hired by another commercial folk group, the Chad Mitchell Trio, who like the Limeliters before them needed an accompanist. McGuinn wasn't particularly happy working with the trio, who in his telling regarded themselves as the stars and McGuinn very much as the hired help. He also didn't respect them as musicians, and thought they were little to do with folk music as he understood the term.\n\nDespite this, McGuinn stayed with the Chad Mitchell Trio for two and a half years, and played on two albums with them -- Mighty Day on Campus, and Live at the Bitter End:\n\n[Excerpt: The Chad Mitchell Trio, \"The John Birch Society\" ]\n\nMcGuinn stuck it out with the Chad Mitchell trio until his twentieth birthday, and he was just about to accept an offer to join the New Christy Minstrels himself when he got a better one. Bobby Darin was in the audience at a Chad Mitchell Trio show, and approached McGuinn afterwards. Darin had started out in the music business as a songwriter, working with his friend Don Kirshner, but had had some success in the late fifties and early sixties as one of the interchangeable teen idol Bobbies who would appear on American Bandstand, with records like \"Dream Lover\" and \"Splish Splash\":\n\n[Excerpt: Bobby Darin, \"Splish Splash\"]\n\nBut Darin had always been more musically adventurous than most of his contemporaries, and with his hit version of \"Mack the Knife\" he had successfully moved into the adult cabaret market. And like other singers breaking into that market, like Sam Cooke, he had decided to incorporate folk music into his act. He would do his big-band set, then there would be a fifteen-minute set of folk songs, backed just by guitar and stand-up bass. Darin wanted McGuinn to be his guitarist and backing vocalist for these folk sets, and offered to double what the Chad Mitchell Trio was paying him.\n\nDarin wasn't just impressed with McGuinn's musicianship -- he also liked his showmanship, which came mostly from McGuinn being bored and mildly disgusted with the music he was playing on stage. He would pull faces behind the Chad Mitchell Trio's back, the audience would laugh, and the trio would think the laughter was for them.\n\nFor a while, McGuinn was happy playing with Darin, who he later talked about as being a mentor. But then Darin had some vocal problems and had to take some time off the road. However, he didn't drop McGuinn altogether -- rather, he gave him a job in the Brill Building, writing songs for Darin's publishing company. One of the songs he wrote there was \"Beach Ball\", co-written with Frank Gari. A knock-off of \"Da Doo Ron Ron\", retooled as a beach party song, the recording released as by the City Surfers apparently features McGuinn, Gari, Darin on drums and Terry Melcher on piano:\n\n[Excerpt: The City Surfers, \"Beach Ball\"]\n\nThat wasn't a hit, but a cover version by Jimmy Hannan was a local hit in Melbourne, Australia:\n\n[Excerpt: Jimmy Hannan “Beach Ball”]\n\nThat record is mostly notable for its backing vocalists, three brothers who would soon go on to become famous as the Bee Gees.\n\nDarin soon advised McGuinn that if he really wanted to become successful, he should become a rock and roll singer, and so McGuinn left Darin's employ and struck out as a solo performer, playing folk songs with a rock backbeat around Greenwich Village, before joining a Beatles tribute act playing clubs around New York. He was given further encouragement by Dion DiMucci, another late-fifties singer who like Darin was trying to make the transition to playing for adult crowds. DiMucci had been lead singer of Dion and the Belmonts, but had had more success as a solo act with records like \"The Wanderer\":\n\n[Excerpt: Dion, \"The Wanderer\"]\n\nDion was insistent that McGuinn had something -- that he wasn't just imitating the Beatles, as he thought, but that he was doing something a little more original. Encouraged by Dion, McGuinn made his way west to LA, where he was playing the Troubadour supporting Roger Miller, when Gene Clark walked in.\n\nClark saw McGuinn as a kindred spirit -- another folkie who'd had his musical world revolutionised by the Beatles -- and suggested that the two become a duo, performing in the style of Peter and Gordon, the British duo who'd recently had a big hit with \"World Without Love\", a song written for them by Paul McCartney:\n\n[Excerpt: Peter and Gordon, \"World Without Love\"]\n\nThe duo act didn't last long though, because they were soon joined by a third singer, David Crosby. Crosby had grown up in LA -- his father, Floyd Crosby, was an award-winning cinematographer, who had won an Oscar for his work on Tabu: A Story of the South Seas, and a Golden Globe for High Noon, but is now best known for his wonderfully lurid work on a whole series of films starring Vincent Price, including The Pit and the Pendulum, House of Usher, Tales of Terror, and Comedy of Terrors.\n\nLike many children of privilege, David had been a spoiled child, and he had taken to burglary for kicks, and had impregnated a schoolfriend and then run off rather than take responsibility for the child. Travelling across the US as a way to escape the consequences of his actions, he had spent some time hanging out with musicians like Fred Neil, Paul Kantner, and Travis Edmondson, the latter of whom had recorded a version of Crosby's first song, \"Cross the Plains\":\n\n[Excerpt: Travis Edmondson, \"Cross the Plains\"]\n\nEdmondson had also introduced Crosby to cannabis, and Crosby soon took to smoking everything he could, even once smoking aspirin to see if he could get high from that. When he'd run out of money, Crosby, like Clark and McGuinn, had joined an ultra-commercial folk group. In Crosby's case it was Les Baxter's Balladeers, put together by the bandleader who was better known for his exotica recordings. While Crosby was in the Balladeers, they were recorded for an album called \"Jack Linkletter Presents A Folk Festival\", a compilation of live recordings hosted by the host of Hootenanny:\n\n[Excerpt: Les Baxter's Balladeers, \"Ride Up\"]\n\nIt's possible that Crosby got the job with Baxter through his father's connections -- Baxter did the music for many films made by Roger Corman, the producer and director of those Vincent Price films. Either way, Crosby didn't last long in the Balladeers.\n\nAfter he left the group, he started performing solo sets, playing folk music but with a jazz tinge to it -- Crosby was already interested in pushing the boundaries of what chords and melodies could be used in folk. Crosby didn't go down particularly well with the folk-club crowds, but he did impress one man.\n\nJim Dickson had got into the music industry more or less by accident -- he had seen the comedian Lord Buckley, a white man who did satirical routines in a hipsterish argot that owed more than a little to Black slang, and had been impressed by him. He had recorded Buckley with his own money, and had put out Buckley's first album Hipsters, Flipsters and Finger Poppin' Daddies, Knock Me Your Lobes on his own label, before selling the rights of the album to Elektra records:\n\n[Excerpt: Lord Buckley, \"Friends, Romans, Countrymen\"]\n\nDickson had gone on to become a freelance producer, often getting his records put out by Elektra, making both jazz records with people like Red Mitchell:\n\n[Excerpt: Red Mitchell, \"Jim's Blues\"]\n\nAnd country, folk, and bluegrass records, with people like the Dillards, whose first few albums he produced:\n\n[Excerpt: The Dillards, \"Duelling Banjos\"]\n\nDickson had also recently started up a publishing company, Tickson Music, with a partner, and the first song they had published had been written by a friend of Crosby's, Dino Valenti, with whom at one point Crosby had shared a houseboat:\n\n[Excerpt: Dino Valenti, \"Get Together\"]\n\nUnfortunately for Dickson, before that song became a big hit for the Youngbloods, he had had to sell the rights to it, to the Kingston Trio's managers, as Valenti had been arrested and needed bail money, and it was the only way to raise the funds required.\n\nDickson liked Crosby's performance, and became his manager. Dickson had access to a recording studio, and started recording Crosby singing traditional songs and songs to which Dickson owned the copyright -- at this point Crosby wasn't writing much, and so Dickson got him to record material like \"Get Together\":\n\n[Excerpt: David Crosby, \"Get Together\"]\n\nUnfortunately for Crosby, Dickson's initial idea, to get him signed to Warner Brothers records as a solo artist using those recordings, didn't work out.\n\nBut Gene Clark had seen Crosby perform live and thought he was impressive. He told McGuinn about him, and the three men soon hit it off -- they were able to sing three-part harmony together as soon as they met. ( This is one characteristic of Crosby that acquaintances often note -- he's a natural harmony singer, and is able to fit his voice into pre-existing groups of other singers very easily, and make it sound natural). Crosby introduced the pair to Dickson, who had a brainwave. These were folkies, but they didn't really sing like folkies -- they'd grown up on rock and roll, and they were all listening to the Beatles now.\n\nThere was a gap in the market, between the Beatles and Peter, Paul, and Mary, for something with harmonies, a soft sound, and a social conscience, but a rock and roll beat. Something that was intelligent, but still fun, and which could appeal to the screaming teenage girls and to the college kids who were listening to Dylan. In Crosby, McGuinn, and Clark, Dickson thought he had found the people who could do just that.\n\nThe group named themselves The Jet Set -- a name thought up by McGuinn, who loved flying and everything about the air, and which they also thought gave them a certain sophistication -- and their first demo recording, with all three of them on twelve-string guitars, shows the direction they were going in. \"The Only Girl I Adore\", written by McGuinn and Clark, has what I can only assume is the group trying for Liverpool accents and failing miserably, and call and response and \"yeah yeah\" vocals that are clearly meant to evoke the Beatles. It actually does a remarkably good job of evoking some of Paul McCartney's melodic style -- but the rhythm guitar is pure Don Everly:\n\n[Excerpt: The Jet Set, \"The Only Girl I Adore\"]\n\nThe Jet Set jettisoned their folk instruments for good after watching A Hard Day's Night -- Roger McGuinn traded in his banjo and got an electric twelve-string Rickenbacker just like the one that George Harrison played, and they went all-in on the British Invasion sound, copying the Beatles but also the Searchers, whose jangly sound was perfect for the Rickenbacker, and who had the same kind of solid harmony sound the Jet Set were going for.\n\nOf course, if you're going to try to sound like the Beatles and the Searchers, you need a drummer, and McGuinn and Crosby were both acquainted with a young man who had been born Michael Dick, but who had understandably changed his name to Michael Clarke. He was only eighteen, and wasn't a particularly good drummer, but he did have one huge advantage, which is that he looked exactly like Brian Jones.\n\nSo the Jet Set now had a full lineup -- Roger McGuinn on lead guitar, Gene Clark on rhythm guitar, David Crosby was learning bass, and Michael Clarke on drums. But that wasn't the lineup on their first recordings. Crosby was finding it difficult to learn the bass, and Michael Clarke wasn't yet very proficient on drums, so for what became their first record Dickson decided to bring in a professional rhythm section, hiring two of the Wrecking Crew, bass player Ray Pohlman and drummer Earl Palmer, to back the three singers, with McGuinn and Gene Clark on guitars:\n\n[Excerpt: The Beefeaters, \"Please Let Me Love You\"]\n\nThat was put out on a one-single deal with Elektra Records, and Jim Dickson made the deal under the condition that it couldn't be released under the group's real name -- he wanted to test what kind of potential they had without spoiling their reputation. So instead of being put out as by the Jet Set, it was put out as by the Beefeaters -- the kind of fake British name that a lot of American bands were using at the time, to try and make themselves seem like they might be British.\n\nThe record did nothing, but nobody was expecting it to do much, so they weren't particularly bothered. And anyway, there was another problem to deal with. David Crosby had been finding it difficult to play bass and sing -- this was one reason that he only sang, and didn't play, on the Beefeaters single. His bass playing was wooden and rigid, and he wasn't getting better. So it was decided that Crosby would just sing, and not play anything at all.\n\nAs a result, the group needed a new bass player, and Dickson knew someone who he thought would fit the bill, despite him not being a bass player.\n\nChris Hillman had become a professional musician in his teens, playing mandolin in a bluegrass group called the Scottsville Squirrel Barkers, who made one album of bluegrass standards for sale through supermarkets:\n\n[Excerpt: The Scottsville Squirrel Barkers, \"Shady Grove\"]\n\nHillman had moved on to a group called the Golden State Boys, which featured two brothers, Vern and Rex Gosdin. The Golden State Boys had been signed to a management contract by Dickson, who had renamed the group the Hillmen after their mandolin player -- Hillman was very much in the background in the group, and Dickson believed that he would be given a little more confidence if he was pushed to the front. The Hillmen had recorded one album, which wasn't released until many years later, and which had featured Hillman singing lead on the Bob Dylan song \"When the Ship Comes In\":\n\n[Excerpt: The Hillmen, \"When the Ship Comes In\"]\n\nHillman had gone on from there to join a bluegrass group managed by Randy Sparks, the same person who was in charge of the New Christy Minstrels, and who specialised in putting out ultra-commercialised versions of roots music for pop audiences. But Dickson knew that Hillman didn't like playing with that group, and would be interested in doing something very different, so even though Hillman didn't play bass, Dickson invited him to join the group.\n\nThere was almost another lineup change at this point, as well. McGuinn and Gene Clark were getting sick of David Crosby's attitude -- Crosby was the most technically knowledgeable musician in the group, but was at this point not much of a songwriter. He was not at all shy about pointing out what he considered flaws in the songs that McGuinn and Clark were writing, but he wasn't producing anything better himself. Eventually McGuinn and Clark decided to kick Crosby out of the group altogether, but they reconsidered when Dickson told them that if Crosby went he was going too. As far as Dickson was concerned, the group needed Crosby's vocals, and that was an end of the matter. Crosby was back in the group, and all was forgotten.\n\nBut there was another problem related to Crosby, as the Jet Set found out when they played their first gig, an unannounced spot at the Troubadour. The group had perfected their image, with their Beatles suits and pose of studied cool, but Crosby had never performed without an instrument before. He spent the gig prancing around the stage, trying to act like a rock star, wiggling his bottom in what he thought was a suggestive manner.\n\nIt wasn't, and the audience found it hilarious. Crosby, who took himself very seriously at this point in time, felt humiliated, and decided that he needed to get an instrument to play. Obviously he couldn't go back to playing bass, so he did the only thing that seemed possible -- he started undermining Gene Clark's confidence as a player, telling him he was playing behind the beat. Clark -- who was actually a perfectly reasonable rhythm player -- was non-confrontational by nature and believed Crosby's criticisms. Soon he *was* playing behind the beat, because his confidence had been shaken. Crosby took over the rhythm guitar role, and from that point on it would be Gene Clark, not David Crosby, who would have to go on stage without an instrument.\n\nThe Jet Set were still not getting very many gigs, but they were constantly in the studio, working on material. The most notable song they recorded in this period is \"You Showed Me\", a song written by Gene Clark and McGuinn, which would not see release at the time but which would later become a hit for both the Turtles and the Lightning Seeds:\n\n[Excerpt: The Jet Set, \"You Showed Me\"]\n\nClark in particular was flourishing as a songwriter, and becoming a genuine talent. But Jim Dickson thought that the song that had the best chance of being the Jet Set's breakout hit wasn't one that they were writing themselves, but one that he'd heard Bob Dylan perform in concert, but which Dylan had not yet released himself.\n\nIn 1964, Dylan was writing far more material than he could reasonably record, even given the fact that his albums at this point often took little more time to record than to listen to. One song he'd written but not yet put out on an album was \"Mr. Tambourine Man\". Dylan had written the song in April 1964, and started performing it live as early as May, when he was on a UK tour that would later be memorialised in D.A. Pennebaker's film Don't Look Back. That performance was later released in 2014 for copyright extension purposes on vinyl, in a limited run of a hundred copies. I *believe* this recording is from that:\n\n[Excerpt: Bob Dylan, \"Mr. Tambourine Man (live Royal Festival Hall 1964)\"]\n\nJim Dickson remembered the song after seeing Dylan perform it live, and started pushing Witmark Music, Dylan's publishers, to send him a demo of the song. Dylan had recorded several demos, and the one that Witmark sent over was a version that was recorded with Ramblin' Jack Elliot singing harmony, recorded for Dylan's album Another Side of Bob Dylan, but left off the album as Elliot had been off key at points:\n\n[Excerpt: Bob Dylan and Ramblin' Jack Elliot, \"Mr. Tambourine Man\" (from Bootleg Series vol 7)]\n\nThere have been all sorts of hypotheses about what \"Mr. Tambourine Man\" is really about. Robert Shelton, for example, suspects the song is inspired by Thomas de Quincey's Confessions of an Opium Eater. de Quincey uses a term for opium, \"the dark idol\", which is supposedly a translation of the Latin phrase \"mater tenebrarum\", which actually means \"mother of darkness\" (or mother of death or mother of gloom). Shelton believes that Dylan probably liked the sound of \"mater tenebrarum\" and turned it into \"Mister Tambourine Man\". Others have tried to find links to the Pied Piper of Hamelin, or claimed that Mr. Tambourine Man is actually Jesus.\n\nDylan, on the other hand, had a much more prosaic explanation -- that Mr. Tambourine Man was a friend of his named Bruce Langhorne, who was prominent in the Greenwich Village folk scene. As well as being a guitarist, Langhorne was also a percussionist, and played a large Turkish frame drum, several feet in diameter, which looked and sounded quite like a massively oversized tambourine. Dylan got that image in his head and wrote a song about it. Sometimes a tambourine is just a tambourine.\n\n(Also, in a neat little coincidence, Dylan has acknowledged that he took the phrase “jingle jangle” from a routine by Jim Dickson's old client, Lord Buckley.)\n\nDickson was convinced that \"Mr. Tambourine Man\" would be a massive hit, but the group didn't like it. Gene Clark, who was at this point the group's only lead singer, didn't think it fit his voice or had anything in common with the songs he was writing. Roger McGuinn was nervous about doing a Dylan song, because he'd played at the same Greenwich Village clubs as Dylan when both were starting out -- he had felt a rivalry with Dylan then, and wasn't entirely comfortable with inviting comparisons with someone who had grown so much as an artist while McGuinn was still very much at the beginning of his career. And David Crosby simply didn't think that such a long, wordy, song had a chance of being a hit.\n\nSo Dickson started to manipulate the group. First, since Clark didn't like singing the song, he gave the lead to McGuinn. The song now had one champion in the band, and McGuinn was also a good choice as he had a hypothesis that there was a space for a vocal sound that split the difference between John Lennon and Bob Dylan, and was trying to make himself sound like that -- not realising that Lennon himself was busily working on making his voice more Dylanesque at the same time.\n\nBut that still wasn't enough -- even after Dickson worked with the group to cut the song down so it was only two choruses and one verse, and so came in under two minutes, rather than the five minutes that Dylan's original version lasted, Crosby in particular was still agitating that the group should just drop the song. So Dickson decided to bring in Dylan himself.\n\nDickson was acquainted with Dylan, and told him that he was managing a Beatles-style group who were doing one of Dylan's songs, and invited him to come along to a rehearsal. Dylan came, partly out of politeness, but also because Dylan was as aware as anyone of the commercial realities of the music business. Dylan was making most of his money at this point as a songwriter, from having other people perform his songs, and he was well aware that the Beatles had changed what hit records sounded like. If the kids were listening to beat groups instead of to Peter, Paul, and Mary, then Dylan's continued commercial success relied on him getting beat groups to perform his songs. So he agreed to come and hear Jim Dickson's beat group, and see what he thought of what they were doing with his song.\n\nOf course, once the group realised that Dylan was going to be coming to listen to them, they decided that they had better actually work on their arrangement of the song. They came up with something that featured McGuinn's Searchers-style twelve-string playing, the group's trademark harmonies, and a rather incongruous-sounding marching beat:\n\n[Excerpt: The Jet Set, \"Mr. Tambourine Man (early version)\"]\n\nDylan heard their performance, and was impressed, telling them \"You can DANCE to it!\"\n\nDylan went on a charm offensive with the group, winning all of them round except Crosby -- but even Crosby stopped arguing the point, realising he'd lost. \"Mr. Tambourine Man\" was now a regular part of their repertoire.\n\nBut they still didn't have a record deal, until one came from an unexpected direction. The group were playing their demos to a local promoter, Benny Shapiro, when Shapiro's teenage daughter came in to the room, excited because the music sounded so much like the Beatles. Shapiro later joked about this to the great jazz trumpet player Miles Davis, and Davis told his record label about this new group, and suddenly they were being signed to Columbia Records.\n\n\"Mr. Tambourine Man\" was going to be their first single, but before that they had to do something about the group's name, as Columbia pointed out that there was already a British group called the Jet Set. The group discussed this over Thanksgiving turkey, and the fact that they were eating a bird reminded Gene Clark of a song by the group's friend Dino Valenti, \"Birdses\":\n\n[Excerpt: Dino Valenti, \"Birdses\"]\n\nClark suggested \"The Birdses\", but the group agreed it wasn't quite right -- though McGuinn, who was obsessed with aviation, did like the idea of a name that was associated with flight. Dickson's business partner Eddie Tickner suggested that they just call themselves \"The Birds\", but the group saw a problem with that, too -- \"bird\" being English slang for \"girl\", they worried that if they called themselves that people might think they were gay.\n\nSo how about messing with the vowels, the same way the Beatles had changed the spelling of their name? They thought about Burds with a \"u\" and Berds with an \"e\", before McGuinn hit on Byrds with a y, which appealed to him because of Admiral Byrd, an explorer and pioneering aviator. They all agreed that the name was perfect -- it began with a \"b\", just like Beatles and Beach Boys, it was a pun like the Beatles, and it signified flight, which was important to McGuinn.\n\nAs the group entered 1965, another major event happened in McGuinn's life -- the one that would lead to him changing his name. A while earlier, McGuinn had met a friend in Greenwich Village and had offered him a joint. The friend had refused, saying that he had something better than dope. McGuinn was intrigued to try this \"something better\" and went along with his friend to what turned out to be a religious meeting, of the new religious movement Subud, a group which believes, among other things, that there are seven levels of existence from gross matter to pure spirit, and which often encourages members to change their names.\n\nMcGuinn was someone who was very much looking for meaning in his life -- around this time he also became a devotee of the self-help writer Norman Vincent Peale thanks to his mother sending him a copy of Peale's book on positive thinking -- and so he agreed to give the organisation a go. Subud involves a form of meditation called the laithan, and on his third attempt at doing this meditation, McGuinn had experienced what he believed was contact with God -- an intense hallucinatory experience which changed his life forever.\n\nMcGuinn was initiated into Subud ten days before going into the studio to record \"Mr. Tambourine Man\", and according to his self-description, whatever Bob Dylan thought the song was about, he was singing to God when he sang it -- in earlier interviews he said he was singing to Allah, but now he's a born-again Christian he tends to use \"God\".\n\nThe group had been assigned by CBS to Terry Melcher, mostly because he was the only staff producer they had on the West Coast who had any idea at all about rock and roll music, and Melcher immediately started to mould the group into his idea of what a pop group should be.\n\nFor their first single, Melcher decided that he wasn't going to use the group, other than McGuinn, for anything other than vocals. Michael Clarke in particular was still a very shaky drummer (and would never be the best on his instrument) while Hillman and Crosby were adequate but not anything special on bass and guitar. Melcher knew that the group's sound depended on McGuinn's electric twelve-string sound, so he kept that, but other than that the Byrds' only contribution to the A-side was McGuinn, Crosby, and Clark on vocals. Everything else was supplied by members of the Wrecking Crew -- Jerry Cole on guitar, Larry Knechtel on bass, Leon Russell on electric piano, and Hal Blaine on drums:\n\n[Excerpt: The Byrds, \"Mr. Tambourine Man\"]\n\nIndeed, not everyone who performed at the session is even clearly audible on the recording. Both Gene Clark and Leon Russell were actually mixed out by Melcher -- both of them are audible, Clark more than Russell, but only because of leakage onto other people's microphones.\n\nThe final arrangement was a mix of influences. McGuinn's twelve-string sound was clearly inspired by the Searchers, and the part he's playing is allegedly influenced by Bach, though I've never seen any noticeable resemblance to anything Bach ever wrote. The overall sound was an attempt to sound like the Beatles, while Melcher always said that the arrangement and feel of the track was inspired by \"Don't Worry Baby\" by the Beach Boys. This is particularly noticeable in the bass part -- compare the part on the Beach Boys record:\n\n[Excerpt: The Beach Boys, \"Don't Worry Baby (instrumental mix with backing vocals)\"]\n\nto the tag on the Byrds record:\n\n[Excerpt: The Byrds, \"Mr. Tambourine Man\"]\n\nFive days before the Byrds recorded their single, Bob Dylan had finally recorded his own version of the song, with the tambourine man himself, Bruce Langhorne, playing guitar, and it was released three weeks before the Byrds' version, as an album track on Dylan's Bringing it All Back Home:\n\n[Excerpt: Bob Dylan, \"Mr. Tambourine Man\"]\n\nDylan's album would become one of the most important of his career, as we'll discuss in a couple of weeks, when we next look at Dylan. But it also provided an additional publicity boost for the Byrds, and as a result their record quickly went to number one in both the UK and America, becoming the first record of a Dylan song to go to number one on any chart. Dylan's place in the new pop order was now secured; the Byrds had shown that American artists could compete with the British Invasion on its own terms -- that the new wave of guitar bands still had a place for Americans; and folk-rock was soon identified as the next big commercial trend. And over the next few weeks we'll see how all those things played out throughout the mid sixties.",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and twenty-eight of A History of Rock Music in Five Hundred Songs looks at \"Mr. Tambourine Man\" by the Byrds, and the start of LA folk-rock. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"I Got You Babe\" by Sonny and Cher.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nErratum\n\nThe version of this originally uploaded got the date of the Dylan tour filmed for Don't Look Back wrong. I edited out the half-sentence in question when this was pointed out to me very shortly after uploading.\n\nResources\n\nAs usual, I’ve created a Mixcloud streaming playlist with full versions of all the songs in the episode (with the exception of the early Gene Clark demo snippet, which I've not been able to find a longer version of).\n\nFor information on Dylan and the song, I've mostly used these books:\n\nBob Dylan: All The Songs by Phillipe Margotin and Jean-Michel Guesdon is a song-by-song look at every song Dylan ever wrote, as is Revolution in the Air, by Clinton Heylin.\n\nHeylin also wrote the most comprehensive and accurate biography of Dylan, Behind the Shades.\n\nI’ve also used Robert Shelton’s No Direction Home, which is less accurate, but which is written by someone who knew Dylan.\n\nWhile for the Byrds, I relied mostly on Timeless Flight Revisited by Johnny Rogan, with some information from Chris Hillman's autobiography.\n\nThis three-CD set is a reasonable way of getting most of the Byrds' important recordings, while this contains the pre-Byrds recordings the group members did with Jim Dickson.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nToday we're going to take a look at one of the pivotal recordings in folk-rock music, a track which, though it was not by any means the first folk-rock record, came to define the subgenre in the minds of the listening public, and which by bringing together the disparate threads of influence from Bob Dylan, the Searchers, the Beatles, and the Beach Boys, manages to be arguably the record that defines early 1965. We're going to look at \"Mr. Tambourine Man\" by the Byrds:\n\n[Excerpt: The Byrds, \"Mr. Tambourine Man\"]\n\nFolk-rock as a genre was something that was bound to happen sooner rather than later. We've already seen how many of the British R&B bands that were becoming popular in the US were influenced by folk music, with records like \"House of the Rising Sun\" taking traditional folk songs and repurposing them for a rock idiom. And as soon as British bands started to have a big influence on American music, that would have to inspire a reassessment by American musicians of their own folk music.\n\nBecause of course, while the British bands were inspired by rock and roll, they were all also coming from a skiffle tradition which saw Woody Guthrie, Lead Belly, Big Bill Broonzy, and the rest as being the people to emulate, and that would show up in their music. Most of the British bands came from the bluesier end of the folk tradition -- with the exception of the Liverpool bands, who pretty much all liked their Black music on the poppy side and their roots music to be more in a country vein -- but they were still all playing music which showed the clear influence of country and folk as well as blues.\n\nAnd that influence was particularly obvious to those American musicians who were suddenly interested in becoming rock and roll stars, but who had previously been folkies. Musicians like Gene Clark.\n\nGene Clark was born in Missouri, and had formed a rock and roll group in his teens called Joe Meyers and the Sharks. According to many biographies, the Sharks put out a record of Clark's song \"Blue Ribbons\", but as far as I've been able to t",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and twenty-eight of A History of Rock Music in Five Hundred Songs looks at \"Mr. Tambourine Man\" by the Byrds, and the start of LA folk-rock. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"I Got You Babe\" by Sonny and Cher.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nErratum\n\nThe version of this originally uploaded got the date of the Dylan tour filmed for Don't Look Back wrong. I edited out the half-sentence in question when this was pointed out to me very shortly after uploading.\n\nResources\n\nAs usual, I’ve created a Mixcloud streaming playlist with full versions of all the songs in the episode (with the exception of the early Gene Clark demo snippet, which I've not b",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}