{
  "id": "tag:theatlantic.com,2019:39-603031",
  "content": "<figure data-apple-news-hide=\"1\"><img alt=\"\" height=\"403\" src=\"https://cdn.theatlantic.com/assets/media/img/posts/2019/12/final_1/30c9a0042.gif\" width=\"672\"><figcaption class=\"credit\">Giacomo Bagnara</figcaption></figure><p class=\"dropcap\">I<span class=\"smallcaps\">t was a pair</span> of feather earrings that helped Ann Miceli get out from underneath strangers’ cars. For years, Miceli had worked as an auto mechanic and picked up shifts in her spare time at Indianapolis restaurants. One day, she came across those earrings, and “it kind of sparked something.” Miceli bought a pair, and then some supplies to make her own. She listed some of her creations in a shop on Etsy and named it <a href=\"https://www.etsy.com/shop/PrettyVagrant\">PrettyVagrant</a>.</p><p>That was in 2011. In the intervening years, Miceli has sold nearly 30,000 of her handmade earrings and feather hair extensions, all of which she assembles by hand at home. After a couple of years, Miceli quit her job as a mechanic. Etsy “has given me the opportunity to work from home and watch my grandkids,” she told me. Everything was humming along nicely until last summer, when the site began implementing a new search algorithm that gives priority to sellers who guarantee free shipping. Those who charged even a few dollars, like Miceli, were removed from their spots on the first page of search results. In August, Miceli’s revenue was down 40 percent from the previous year—a huge dip that she blames on the free-shipping finagling.</p><p>Etsy said it had no choice: Buyers’ expectations had changed, and it felt compelled to respond. The company told Miceli to raise her prices to compensate for and disguise shipping fees. But when Miceli looked around, her competitors seemed to be simply eating the cost, which she couldn’t afford to do.</p><p>Etsy and Miceli share the same goal: to induce shoppers to buy from Etsy instead of ordering mass-produced goods from the uncountable conventional retailers that would also like to ship you a pair of feather earrings. Now she and the platform are in conflict because of how those other retailers—especially Amazon—have warped our idea of what it means to shop online. There’s scarcely tastier bait for American shoppers than free shipping, and it’s been transformed from an occasional incentive into something that closely resembles a consumer requirement. But shipping isn’t free for the people who send packages, and an insatiable demand for this perk might be the thing that breaks mom-and-pop retail for good.</p><p class=\"dropcap\">O<span class=\"smallcaps\">nline shopping</span>, when it works best, is sort of like a duck. The part above the water—the algorithmically selected products, the simple checkout process aided by personal information stored on phones, the package that appears on your porch two days later—glides placidly along, setting off only the gentlest of ripples in your attention. The apotheosis of e-commerce is when people spend money without feeling like anything has happened at all.</p><p>Below the surface, the little webbed feet of retail paddle furiously. Miceli alone takes a new bundle of packages to the post office nearly every day. This holiday season, the United States Postal Service will deliver a projected 800 million packages. Early in 2020, FedEx will start delivering on Sundays all year, a service previously reserved for the holidays. In New York, where daily deliveries have tripled in less than a decade, trucks snarl streets and rack up nearly a half million parking tickets annually. In 2015, Amazon launched Amazon Flex, through which the company pays people to use their own cars to ferry boxes, assuming all responsibility for mileage and expenses. (Amazon did not respond to requests for comment.)</p><p>Large retailers make sure their own ducks stay upright. Orders come in boxes marked with the insignia of the seller, not the deliverer. Narvar, a popular logistics start-up that touts its ability to help brands “deliver premium post-purchase experiences,” directs buyers to a clean, bright, retailer-marked landing page to track packages. If you don’t look closely, you might think Warby Parker itself is bringing you your new glasses, not UPS.</p><p>Masking the nitty-gritty of shipping, namely the costs, is the most potent tool online stores have to persuade people to click “Place order” and come back for more. In a 2018 survey by <em>Internet Retailer</em>, shipping charges were cited as the most common reason shoppers abandon their carts, topping the pet-peeve list for nearly a third of respondents, ahead of things like not wanting to create an account and being unsure of the store’s return policy. Many resent paying for shipping so much that they’ll buy more expensive items or throw in additional small stuff—a single-use skin-care mask, socks—just to clear a free-delivery purchase minimum, says Ron Berman, a marketing professor at the Wharton School at the University of Pennsylvania. At Etsy’s suggestion, Miceli started using a similar gambit, absorbing the cost for orders over $35 in the hope that people buying her least expensive products would buy more of them.</p><aside class=\"callout-placeholder\" data-source=\"curated\"></aside><p>Free shipping is enticing, says Ravi Dhar, the director of Yale’s Center for Customer Insights, because shoppers irrationally hate to pay for certain services—even those that they value immensely, such as speedy and reliable delivery. This demonstrates the economic principle known as “pain of paying,” a psychological discomfort that keeps people from completing purchases. Certain factors seem to sharpen the pain. Using cash rather than credit cards typically hurts more, because paper money must be physically relinquished. Higher charges for convenience, such as the jacked-up price for a soda in a hotel minibar or closer parking at a sporting event, usually rankle too. Printer ink and hotel Wi-Fi torment because they’re a means to an end that consumers feel they’ve already paid to reach. You bought the printer—of course you need to print things. You booked the hotel—of course you need to check your email during your stay. (Hotels, with their inherently captive audiences, are veritable houses of pain.) Paying for shipping is a two-for-one pain deal: Not only are you confronted with the actual cost of your convenience, but you’re being asked to pay “extra” for a store to fork over items you’re already laying out for.</p><p>“The reaction to free shipping goes beyond the normal way of looking at cost and benefit,” Dhar explains. “A 20 percent discount, which would add up to the same $5 or $8 that shipping costs—that’s not as effective as giving free shipping.” In general, Dhar says, shoppers are even willing to pay more overall for the same goods if there isn’t a separate shipping charge. What bothers them most is the nickeled-and-dimed feeling, not the total amount of the tab.</p><p class=\"dropcap\">I<span class=\"smallcaps\">t wasn’t always</span> like this in America, and it’s not like this in most other countries—standard European shipping and return policies would probably seem downright hostile here. That’s because U.S. shoppers are used to being coaxed into purchases by retailers who can and will bend over backwards to land a sale—another extreme of capitalism, American-style.</p><p>The main reason small businesses can’t keep up with the behemoths is economies of scale. Thanks to their huge infrastructure, mega-retailers simply pay less per package for shipping. Scale also helps when it comes to an ever more popular companion to free shipping: free returns. They’re another salve for the pain of paying, but processing returns requires manpower and eats into profits. Big clothing retailers can recoup some of the costs by off-loading returns and stale inventory to discount stores such as Marshalls, but small businesses don’t have that option.</p><p>Dhar and Berman point to the dot-com boom as the moment when retailers, fed by investor dollars and under no pressure to turn a profit, started offering free shipping to get people to take a chance on companies they’d never heard of. Webvan—an early and ill-fated grocery service—and Zappos, the online shoe store, helped normalize the incentive. Venture capital still drives much of the free-shipping expectation, for the same reason it did in the beginning: Getting people to try something new can be difficult, and taking a loss up front is often necessary to sweeten the deal enough to make it happen.</p><p>What got us to the present is Amazon Prime, the $119 annual program with more than 100 million American members, which promises unlimited two-day shipping to almost anywhere in the United States. The trick Amazon pulled off was to divorce shipping costs almost entirely from individual buying behavior by charging an annual shipping fee, then further camouflaging matters by making video-streaming services and the like part of the package. And now that we think nothing we order online should take more than two days to arrive, the company is in the process of shaving a day off that expectation. Buyers will receive their purchases the next day, as if delivered by the package fairy.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/technology/archive/2018/04/free-shipping-isnt-hurting-amazon/559052/?utm_source=feed\">Read: Free shipping isn’t hurting Amazon</a>]</i></p><p>This is what Etsy’s 2.6 million sellers—mostly women, mostly one-person operations, according to the company—are up against. On internal forums, they’ve been voicing concerns about lost sales, reduced margins, an inability to keep up with Jeff Bezos and the Waltons.</p><p>So far, the free-shipping push hasn’t been a big win for Etsy, either. In an earnings call in October, the company’s executives said that although the number of listings offering free shipping had more than doubled, to just over 60 percent, the conversion rate—the percentage of visitors to the site who actually buy something—had fallen. Popular sellers like Miceli had worked their way to the front page because buyers <em>liked</em> them, and now they were harder to find. But as more and more of its vendors get with the new regime, Etsy expects to see its performance rebound.</p><p>As for Miceli, her sales have started to tick back up from their mid-2019 crater, but she’s still not where she was a year ago. In the meantime, she’s picking up shifts at local restaurants and friends’ bars, a Plan B that she’s worked to keep viable in case the internet unexpectedly evaporates her income. “I’m always so nervous. There are so many highs and lows, and so much stress,” she said. “There are people winning—otherwise they wouldn’t be doing it. I just don’t know who those people are.”</p><hr><p><small><em>This article appears in the January/February 2020 print edition with the headline “The Myth of Free Shipping.”</em></small></p>",
  "author": {
    "name": "Amanda Mull",
    "uri": "http://www.theatlantic.com/author/amanda-mull/?utm_source=feed"
  },
  "media:content": {
    "media:credit": "Giacomo Bagnara"
  },
  "title": "Stop Believing in Free Shipping",
  "published": "2019-12-11T07:00:00-05:00",
  "updated": "2020-11-19T14:57:41-05:00",
  "summary": "How retailers hide the costs of delivery—and why we’re such suckers for their ploys",
  "link": ""
}