{
  "title": "Designing your life",
  "link": "https://www.getrichslowly.org/designing-your-life/",
  "comments": "https://www.getrichslowly.org/designing-your-life/#comments",
  "dc:creator": "J.D. Roth",
  "pubDate": "Sun, 21 Aug 2022 21:30:46 +0000",
  "category": [
    "Career",
    "Money Mindset"
  ],
  "guid": "https://www.getrichslowly.org/?p=244261",
  "description": "<p>I am obsessed with the film <a href=\"https://www.youtube.com/watch?v=wxN1T1uxQ2g\"><em>Everything Everywhere All at Once</em></a>. From the moment I saw the trailer, I knew the movie was meant for me. I was right. The film's bizarre blend of action, philosophy, science fiction, taxes, and juvenile humor feels specifically targeted to me and my brain.</p>\n<p>For those unfamiliar, here's a quick plot synopsis.</p>\n<p>Evelyn and Waymond Wang own a laundromat. Their business is failing, their marriage is fracturing, and so is their relationship with Joy, their daughter. During a meeting with the IRS, Evelyn is visited by a version of her husband from a parallel universe. He says that the multiverse — all of the many parallel universes — is under attack from an evil being named Jobu Tupaki, and Evelyn is the only one who can save it. The rest of the film is about Evelyn overcoming her skepticism and discovering her true power (and Waymond's).</p>\n<p>This trailer pretty much nails the mood and theme of the film. If this preview intrigues you, you'll probably like it:</p>\n<p class=\"youtube\"><iframe class=\"aligncenter\" src=\"https://www.youtube.com/embed/wxN1T1uxQ2g?rel=0\" width=\"100%\" height=\"150\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><em>Everything Everywhere All at Once</em> is strange. Very strange. It starts mundane and boring, descends into madness, then ultimately ties everything together in some magical ways. Some people hate it. They can't finish watching it. That's too bad, because if you abandon the film during the boring part or the strange part, you never get to the magical part. The tedium and the madness are all part of the journey.</p>\n",
  "content:encoded": "<p>I am obsessed with the film <a href=\"https://www.youtube.com/watch?v=wxN1T1uxQ2g\" rel=\"noopener\"><em>Everything Everywhere All at Once</em></a>. From the moment I saw the trailer, I knew the movie was meant for me. I was right. The film's bizarre blend of action, philosophy, science fiction, taxes, and juvenile humor feels specifically targeted to me and my brain.</p>\n<p>For those unfamiliar, here's a quick plot synopsis.</p>\n<p>Evelyn and Waymond Wang own a laundromat. Their business is failing, their marriage is fracturing, and so is their relationship with Joy, their daughter. During a meeting with the IRS, Evelyn is visited by a version of her husband from a parallel universe. He says that the multiverse — all of the many parallel universes — is under attack from an evil being named Jobu Tupaki, and Evelyn is the only one who can save it. The rest of the film is about Evelyn overcoming her skepticism and discovering her true power (and Waymond's).</p>\n<p>This trailer pretty much nails the mood and theme of the film. If this preview intrigues you, you'll probably like it:</p>\n<p class=\"youtube\"><iframe loading=\"lazy\" class=\"aligncenter\" src=\"https://www.youtube.com/embed/wxN1T1uxQ2g?rel=0\" width=\"100%\" height=\"150\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><em>Everything Everywhere All at Once</em> is strange. Very strange. It starts mundane and boring, descends into madness, then ultimately ties everything together in some magical ways. Some people hate it. They can't finish watching it. That's too bad, because if you abandon the film during the boring part or the strange part, you never get to the magical part. The tedium and the madness are all part of the journey.<span id=\"more-244261\"></span></p>\n<p>I've watched the film five times now (and will likely watch it a sixth later today), and I get something new from each viewing. The movie is rich. And detailed. And layered. In fact, it's designed for repeat viewing (because frequently there's no way to know something has meaning the first time through).</p>\n<p>The reason the film hits me so hard, I think, is that its themes are aligned with things I've been ruminating over throughout 2022. While I was caring for my dying cousin during the spring, I reached some sort of nihilistic nadir. Like Jobu Tupaki, the movie's &#8220;villain&#8221;, I decided that nothing matters, that life is inherently meaningless.</p>\n<p>At heart, though, I'm a Waymond figure — and I always have been. It didn't take me long to realize that even if life <em>is</em> inherently meaningless (<em>especially</em> if life is inherently meaningless), then it's up to each of us to make our own meaning. And that kindness matters.</p>\n<p>Then there's the movie's wild exploration of the multiverse. I've been exposed to this concept repeatedly in 2022, most notably in the novel <a href=\"https://www.amazon.com/dp/1786892723/?tag=grs17-20\" rel=\"noopener\"><em>The Midnight Library</em></a> by Matt Haig, which has a plot similar to <em>Everything Everywhere All at Once</em>: a woman is trapped in a limbo state between life and death, where she explores the many alternate lives she might have lived.</p>\n<p>It's as if the universe is trying to beat me over the head with a message: &#8220;J.D., you bozo, you are not trapped by your current reality. If you're dissatisfied with this timeline, it's up to you to create a timeline you like better.&#8221;</p>\n<p>Message received, Universe.</p>\n<h2>Designing Your Life</h2>\n<p>Last week, I re-read a book that helped me understand how to take this esoteric idea and do something practical about it. That book is <a href=\"https://www.amazon.com/dp/1101875321/?tag=grs17-20\" rel=\"noopener\"><em>Designing Your Life</em></a> by Bill Burnett and Dave Evans. Ostensibly, <em>Designing Your Life</em> is about finding a career that fits you. In reality, it's about looking at the multiverse and deciding which of the many available universes you want to live in.</p>\n<p class=\"youtube\"><iframe loading=\"lazy\" class=\"aligncenter\" src=\"https://www.youtube.com/embed/SemHh0n19LA?rel=0\" width=\"100%\" height=\"150\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>Fundamentally, <em>Designing Your Life</em> is a career book targeted at young adults. The material here is derived from <a href=\"http://lifedesignlab.stanford.edu/dyl\" rel=\"noopener\">a Stanford University course</a> taught by the two authors.</p>\n<p>Bill Burnett is the executive director of the <a href=\"https://dschool.stanford.edu\" rel=\"noopener\">Stanford Design Program</a> (and was a part of Apple's early laptop design team). Dave Evans is the co-director of the <a href=\"http://lifedesignlab.stanford.edu\" rel=\"noopener\">Stanford Life Design Lab</a> and a very early employee of Electronic Arts, the videogame company.</p>\n<p>Burnett and Evans aim to get students (and readers) to apply principles from the world of design to the process of planning their future. While sometimes this approach (and the terminology associated with it) feels forced, most of the time it works surprisingly well. In fact, I found this book was full of <em>aha!</em> moments.</p>\n<p>What does a well-designed life look like? What does that notion even mean? &#8220;A well-designed life is a life that makes sense,&#8221; the authors write. &#8220;It's a life in which <em>who you are</em>, <em>what you believe</em>, and <em>what you do</em> all line up together.&#8221; They call this alignment <em>coherence</em>, and I think it's an excellent concept.</p>\n<p>To build a coherent life, the authors encourage readers to practice five disciplines:</p>\n<ul>\n<li><strong>Curiosity.</strong> Curiosity, of course, is about being open-minded, about casting a wide net. The authors want you to explore, to be open to opportunity. Doing so will help you &#8220;get good at being lucky&#8221;.</li>\n<li><strong>Bias to action.</strong> It's not enough to simply read and think about things. Burnett and Evans want you to act — even if your actions are imperfect. They want you to try things. They want you to fail over and over, because failure is the foundation of success.</li>\n<li><strong>Reframing.</strong> People get stuck all of the time, and often this &#8220;stuckness&#8221; is a result of an inability to shift perspective. <em>Designing Your Life</em> urges readers to reframe problems in order to remove barriers and circumvent perceived roadblocks. (Reading this book helped me realize I do a poor job of reframing problems in my life. I allow myself to stay stuck for far too long, in most cases.)</li>\n<li><strong>Patience.</strong> Design, the authors say, is a process. Life design is no different. &#8220;For every step forward,&#8221; they write, &#8220;it can sometimes seem you are moving two steps back.&#8221; They advocate what they call <em>prototyping</em> — testing new ideas and solutions. &#8220;Life design is a journey,&#8221; they say. &#8220;Let go of the end goal and focus on the process.&#8221;</li>\n<li><strong>Radical collaboration.</strong> Lastly, the book urges readers to seek help. Great design requires multiple minds tackling a problem. In designing your life, you want to consult with friends and family and mentors. You want to meet people and ask questions. You want to get input from people you trust.</li>\n</ul>\n<p>Because this book is based on an actual college course, it's filled with exercises. These exercises were quite clearly homework assignments for Stanford students, but for old folks like me they're useful tools to gain clarity.</p>\n<p>One exercise, for instance, asks readers to write <a href=\"https://dci.stanford.edu/wp-content/uploads/sites/2/2017/11/DYLMC-Workview-Reflection-v2.2.pdf\" rel=\"noopener\">a 250-word Workview</a> (a short statement about what you believe work is for and what constitutes <em>good</em> work), <a href=\"http://dci.stanford.edu/wp-content/uploads/sites/2/2017/11/DYLMC-Lifeview-Reflection-v2.2.pdf\" rel=\"noopener\">a 250-word Lifeview</a> (a short statement describing what you believe makes life worth living), then explore how the Workview and Lifeview clash and/or complement one another.</p>\n<p>But the exercise I like the most in <em>Designing Your Life</em> makes me think of the multiverse.</p>\n<h2>The Many Versions of You</h2>\n<p>&#8220;This life you are living is one of many lives you will live,&#8221; write Burnett and Evans. &#8220;The plain and simple truth is that you will live many different lives in this lifetime. If the life you are currently living feels a bit off, don't worry; life design gives you endless mulligans.&#8221;</p>\n<p>To prove their point, they ask readers to visualize three versions of the future, to create <em>three</em> five-year Odyssey Plans.</p>\n<p>An Odyssey Plan is like a roadmap to an alternate universe. It's a vision of what your life might might like five years from now. And the authors want you to draft three of these so that you can see clearly that there really <em>is</em> a multitude of alternate realities from which to choose.</p>\n<ul>\n<li>Your first plan, they say, should be based on what you currently do.</li>\n<li>Your second plan should be the thing you'd do if the path you're currently on suddenly vanished.</li>\n<li>And the third plan should be the thing you'd do if money and/or image were no object.</li>\n</ul>\n<p>I love this idea. And, in fact, I think of it as a missing link in my own work.</p>\n<p>When I'm asked to speak, I generally talk about money and meaning. I lead audiences through exercises designed to help them find purpose in life. My end goal is to help people draft a <a href=\"https://www.getrichslowly.org/personal-mission-statement/\">personal mission statement</a>.</p>\n<p class=\"youtube\"><iframe loading=\"lazy\" class=\"aligncenter\" src=\"https://www.youtube.com/embed/3mry96kDjBo?rel=0\" width=\"100%\" height=\"150\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>But I've always felt that my presentation lacks a certain something. Now I know that that something is: Odyssey Plans (or my own version of this idea). An Odyssey Plan helps to put a personal mission statement into action.</p>\n<p>Let me give you a real-life example of what Burnett and Evans are after. (This isn't <em>exactly</em> their exercise, but it's the same idea.) Let's look at three possible futures for <em>me</em>.</p>\n<p><strong>Future #1: Get Rich Slowly.</strong><br />\nThe authors say that your first Odyssey Plan should be built around your existing life. In my case, that means Get Rich Slowly. This works well because that's my preferred plan, anyhow. I have a clear vision of what I want this site to be, and although my aims have been thwarted repeatedly over the past year, I <em>have</em> made progress toward the goal I have in mind.</p>\n<p>In this preferred future, five years from now this site will have a clean, elegant design (<a href=\"https://pennyshort.com\" rel=\"noopener\">which I'm currently building here</a>) that puts the reader first. No ads. No tracking. No social media. No bullshit. The site will still feature this blog, of course, but the content will also be organized into sections that resemble &#8220;online textbooks&#8221; about specific areas of personal finance.</p>\n<p>Meanwhile, I'd also like to build out <a href=\"https://www.youtube.com/c/GetRichSlowlyJD\" rel=\"noopener\">the GRS YouTube channel</a> to feature video versions of the most important articles. And somehow in all of this, I'd be grateful if I could earn an income. (Yes, I realize that'll be difficult to do without ads.)</p>\n<p>My preferred plan is to do what I'm doing now — but more of it&#8230;and more intensely.</p>\n<p><strong>Future #2: Preserving the Past</strong><br />\nYour second Odyssey Plan should be something you'd do if your current work suddenly vanished. In many cases, that means you'd end up doing something similar to what you already do. For me, this is and isn't true. If Get Rich Slowly suddenly vanished, I'd still write — but not about money.</p>\n<p>The two months I spent with my cousin Duane at the end of his life made me interested in finding a way to contribute my talents to hospice somehow. But what can a writer do to help the dying? When I phrase it like that, I suspect you might already see the answer.</p>\n<p>For my second five-year plan, I'd explore how to help people tell their life stories. The idea excites me, actually. I think I could do a good job at it because it'd combine a lot of my interests and talents.</p>\n<p>The way I see it, I'd sit with people and record their stories. I'd learn to <a href=\"https://storycorps.org/participate/great-questions/\" rel=\"noopener\">ask questions that elicit memories and meaning</a> from their past, then take these responses and somehow compile them into keepsakes for families. This is something I always wish I'd done with my father. It's something I tried to do with my cousin Duane. And it's something that I've actually been doing over the past decade with Kim's family. I have a whole collection of stories from her father and his siblings. (I'm not joking when I say their lives would have made a fantastic Michener novel!)</p>\n<p>So, my second possible future is helping people tell their life stories.</p>\n<p><strong>Future #3: A Portrait of the Artist as an Old Man</strong><br />\nYour third Odyssey plan should be a pipe dream. It's what you'd do if money (and/or the judgment of others) were no object.</p>\n<p>In my case, I've had a plan percolating in the back of my head for a year now. My Plan C would be something completely different than I've ever done before. I'd go to art school.</p>\n<p>You see, I'd like to draw a webcomic about personal finance. I've been a comic nerd my entire life. I've been writing about money for 15+ years now. This seems like a fun way to combine these two passions. And, in fact, I have a concept already. It's about a young woman named Penny Short who moves to small village inhabited by colorful characters, all of whom are anthropomorphized animals. Each of these animals is a caricature of one of my colleagues (or their ideas).</p>\n<p>There's <a href=\"https://www.mrmoneymustache.com\" rel=\"noopener\">Pete</a>, the Canadian Beaver, for instance, who is super frugal and bikes around town and hates rampant consumerism. There's <a href=\"https://www.financialsamurai.com\" rel=\"noopener\">Sam</a>, the samurai duck, who slices through life's money mysteries. There's Marla, the bear. And Tom, the turtle. And there's a whole bunch of folks who live in <a href=\"https://www.frugalwoods.com\" rel=\"noopener\">the Frugalwoods</a>.</p>\n<p>That's my third five-year plan. I'd go to art school, then create a webcomic about personal finance.</p>\n<h2>The Multiverse and Me</h2>\n<p><a href=\"https://www.amazon.com/dp/1101875321/?tag=grs17-20\" rel=\"noopener\"><img loading=\"lazy\" src=\"https://www.getrichslowly.org/wp-content/uploads/designing_your_life.jpeg\" width=\"339\" height=\"480\" class=\"alignright\" /></a>I hope that small example gives you a glimpse of just how powerful this exercise can be. Exploring three possible versions of your future is mind-opening. And this is just one of many similar exercises in this book.</p>\n<p><a href=\"https://www.amazon.com/dp/1101875321/?tag=grs17-20\" rel=\"noopener\"><em>Designing Your Life</em></a> is terrific. I recommend it highly. It's one of those rare books that I've added to the mental library of titles I suggest to those who need help. (Other examples of books in this mental library include <em>Your Money or Your Life, </em><em>I Will Teach You to Be Rich</em>, and <em>The Simple Path to Wealth</em>.)</p>\n<p>This book is so good, in fact, that I plan to make time to work through all of the exercises. And I'm not the only one. Kim is going to do them with me, as is my buddy Craig.</p>\n<p>Even if I didn't plan to do the exercises, though, I feel like I would have profited from reading <em>Designing Your Life</em>. The book is packed with actionable advice and thought-provoking questions.</p>\n<p>For me, though, the biggest takeaway has been that the multiverse isn't just the stuff of science fiction. That concept can be applied to my own life today. By taking the time to think about how to align my life with my values, then drafting multiple five-year plans that fit with these coherent values, I — and anyone else — can build a well-lived, joyful life.</p>\n<blockquote class=\"highlight\"><p>My biggest pet peeve with this book is the lack of an index. I never understand how books like this make it to print without a way to look things up. <em>Designing Your Life</em> is dense with &#8220;sticky&#8221; ideas, and I found myself wanting to reference past sections repeatedly. But it was nearly impossible to find the info I wanted because there's no index. Instead, I had to flip through page by page until I found what I wanted. Such a terrible design decision for a book guided by design principles.</p></blockquote>\n<div id=\"mediavine-settings\" data-blacklist-content-desktop=\"1\" data-blacklist-content-mobile=\"1\"></div>\n",
  "wfw:commentRss": "https://www.getrichslowly.org/designing-your-life/feed/",
  "slash:comments": 8,
  "media:content": {
    "media:player": "",
    "media:title": "Everything Everywhere All At Once | Official Trailer HD | A24",
    "media:description": "SUBSCRIBE: http://bit.ly/A24subscribeA film from Daniels and starring Michelle Yeoh, Ke Huy Quan, Stephanie Hsu, Jenny Slate, Harry Shum Jr., with James Hong...",
    "media:thumbnail": "",
    "media:rating": "nonadult"
  }
}