{
  "title": "Trudeau Revokes Emergency Powers Authorization",
  "itunes:title": "Trudeau Revokes Emergency Powers Authorization",
  "pubDate": "Fri, 25 Feb 2022 20:06:41 +0000",
  "guid": "6524ba00-9075-436e-aecc-f9ca68f13add",
  "link": "https://thejimmydoreshow.libsyn.com/trudeau-revokes-emergency-powers-authorization",
  "itunes:image": "",
  "description": "Canadian Prime Minister Justin Trudeau has reversed himself, and announced that the emergency powers he invoked to deal with the trucker protest, will be revoked. Some had feared that Trudeau would extend the powers in a decidedly authoritarian manner.<br /> <br /> Plus segments about plans in place by global officials to institute digital IDs and the CDC's recent announcement that data about booster effectiveness will not be released for fear the information will be \"misinterpreted.\"<br /> <br /> Also featuring Stef Zamorano, Max Blumenthal and Mike MacRae! And phone calls from Vince Vaughn and Mitt Romney!",
  "content:encoded": "Canadian Prime Minister Justin Trudeau has reversed himself, and announced that the emergency powers he invoked to deal with the trucker protest, will be revoked. Some had feared that Trudeau would extend the powers in a decidedly authoritarian manner.  Plus segments about plans in place by global officials to institute digital IDs and the CDC's recent announcement that data about booster effectiveness will not be released for fear the information will be \"misinterpreted.\"  Also featuring Stef Zamorano, Max Blumenthal and Mike MacRae! And phone calls from Vince Vaughn and Mitt Romney!",
  "enclosure": "",
  "itunes:duration": "01:03:46",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Canadian Prime Minister Justin Trudeau has reversed himself, and announced that the emergency powers he invoked to deal with the trucker protest, will be revoked. Some had feared that Trudeau would extend the powers in a decidedly authoritarian...",
  "itunes:episodeType": "full",
  "itunes:summary": "Canadian Prime Minister Justin Trudeau has reversed himself, and announced that the emergency powers he invoked to deal with the trucker protest, will be revoked. Some had feared that Trudeau would extend the powers in a decidedly authoritarian manner. Plus segments about plans in place by global officials to institute digital IDs and the CDC's recent announcement that data about booster effectiveness will not be released for fear the information will be \"misinterpreted.\" Also featuring Stef Zamorano, Max Blumenthal and Mike MacRae! And phone calls from Vince Vaughn and Mitt Romney!"
}