{
  "id": "https://bibleinoneyear.org/en/youth/134",
  "title": "Day 134: It’s Possible with God",
  "description": "Psalm 60:11-12, Judges 18:1, John 8:12–29.  Being *with* God is even more important than what you do *for* God  With God, everything is possible",
  "pubDate": "Fri, 14 May 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/134/?ignore",
  "itunes:duration": "12:45",
  "guid": "enyouth14052021-134",
  "length": 765.94,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 134: It’s Possible with God",
  "itunes:subtitle": "Psalm 60:11-12, Judges 18:1, John 8:12–29.  Being *with* God is even more important than what you do *for* God  With God, everything is possible",
  "itunes:summary": "I was eighteen years old when I first encountered Jesus. I remember distinctly a conversation I had with a Christian leader shortly afterwards. I said how glad I was that I had not become a Christian earlier, since I had been able to experience the difference between life without God and life with God. He pointed out the fallacy of this way of thinking and suggested that the sooner we experience life with God, the better.\nLooking back on my life now, I see the wisdom of his words. I am so grateful to God that our children can look back on their own lives and say that there has never been a time in their life when they were ‘without God’.\nOver the years, I have interviewed hundreds of people who have encountered Jesus on Alpha. They contrast their life without God and their life with God. There is a sense of great joy and relief, and often regret that they did not begin their life with God earlier.\nYou are created to live in a relationship with God. Without that, life will never really make sense. Being with God is even more important than what you do for God. With God, everything is possible.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 134
}