{
  "title": "Hierarchy of Quantum Fields, Scalar Field Neutrinos, Neutrino Dark Matter, Spacetime as a Product of Rotating Quantum Fields in a Higher Dimensional Bulk, The Nature of the Temporal Dimension",
  "link": "http://viXra.org/abs/2211.0026",
  "pubDate": "2022-11-04 01:10:46",
  "category": "Quantum Physics",
  "description": "\n     <b>reference:</b> viXra:2211.0026v1<br/>\n     <b>title:</b>     Hierarchy of Quantum Fields, Scalar Field Neutrinos, Neutrino Dark Matter, Spacetime as a Product of Rotating Quantum Fields in a Higher Dimensional Bulk, The Nature of the Temporal Dimension<br/>\n     <b>authors:</b>   Charlie Dawson<br/>\n     <b>category:</b>  Quantum Physics<br/>\n     <b>type:</b>      submission<br/>\n     <b>date:</b>      2022-11-04 01:10:46 <br/>\n     <b>abstract:</b>  \nWe postulate that quantum fields are more fundamental than spacetime. There is a hierarchy of fields, with the scalar, Higgs field being the most fundamental and the vector and spinor fields being a result of the 2-dimensional scalar field, being synonymous with a 2-brane, rotating through some higher dimensional bulk. As this field rotates the path integral of all possible paths of rotation through the higher dimensions can be summed into a projection into 1 extra dimension. The incorporation of another dimension creates a 3-brane that houses all of the vector fields. This brane, being coupled to the 2-brane, continues to rotate and the continued rotation produces a 4-brane to house all of the spinor fields. With 2 complete rotations the spinor fields will yield some paths in which a point of the scalar field would have 2 complete rotations bound up in its path back to its starting point on the scalar field, which would be the paths of spinor field particles. There would also be some paths which some points on the scalar field could complete 2 full rotations and instead of having those rotations bound up in the path, the particular paths would essentially unwind the part of the field along those paths. The would-be spinor fields would become a scalar field. The would-be spinor particles would become scalar values. We postulate that these would be spin &#189; particles might be right-handed neutrinos. Applying this possibility to recent work by Latham Boyle, Neil Turok, Kieran Finn and others, we explore the possibility that these paths might be the source of Dark Matter.\n  \n   "
}