{
  "title": "You Don’t Know What’s Good for You",
  "link": "https://mises.org/node/60839",
  "description": "<p>In last week’s column, I mentioned that regulation of drugs was among the important subjects Andrew Koppelman discusses in his thoughtful book <em>Burning Down the House</em>, and this week I’d like to look at what he has to say on this topic.</p>\n<p>To understand his arguments, though, what he says needs to be put in a wider philosophical framework. As he sees it, both libertarians and nonlibertarians like him share a goal. Both have as an ideal the notion of human autonomy. As he puts it,</p>\n<blockquote><p>People need all-purpose means to pursue their own aspirations. If they have those means, then they don’t need to justify themselves to anyone else. They are free to develop what they regard as best in themselves. This ideal of authenticity is common ground between large parts of both the political left and right. Our disagreements turn on how to realize it. That insistence on personal autonomy translates easily into rights talk. (pp. 108–09; Koppelman takes “authenticity” and “autonomy” to be in this context synonymous)</p></blockquote>\n<p>Koppelman is right that many people wish to promote autonomy in this sense, but Rothbard and his followers are not among them. It is not that they deem autonomy a bad idea, but rather one that stands apart from political philosophy. The aim of politics is, in the Rothbardian view, to promote liberty, meaning securing the lives and property of people against force and the threat of force, rather than enabling people to live a certain kind of life. Thus, if you are content to live your life in lassitude, drifting from one thing to another, or if you live unreflectively following customs that Koppelman and his colleagues deem narrow and bigoted, Rothbardian political philosophy has nothing to say against you.</p>\n<p>Before proceeding to show how this difference between Koppelman and Rothbard leads to divergent views on drug regulation, I will digress to note a poor argument having to do with autonomy that Koppelman advances. He says,</p>\n<blockquote><p>Moreover, if the value of property is that it gives individuals independence and autonomy, then this function is nicely performed by streams of government-generated income, such as Social Security and Medicare. Abolishing those, as many libertarians propose, would be a disaster not only for liberty but for property as well, depriving millions of what they had worked for. Libertarian philosophy perversely threatens to destroy what it most cares about. (p. 18)</p></blockquote>\n<p>But it does not follow that if Social Security has the same value, or the same function, as property, then it <em>is</em> property. My security blanket may, like my service dog, relieve my anxiety, but it would be rash to conclude that my blanket is a dog.</p>\n<p>Once you understand what Koppelman means by autonomy, his position on drug regulation is easy to understand. He remarks,</p>\n<blockquote><p>Libertarianism aims for a society of rational, self-governing agents. But we know that, a lot of the time, people do not and cannot measure up to this ideal. People are imperfectly rational. They are subject to systemic emotional and cognitive biases: overconfidence, poor risk assessment, inertia. A lot of decisions are the product not of rational deliberation but of default rules, framing effects, and other ways in which the human mind arrives at decisions unconsciously. (p. 160)</p></blockquote>\n<p>This may well be true, but Rothbardians think that the individual ought to be free to make his own decisions on taking drugs, so long as he violates no one’s rights. Koppelman acknowledges that the libertarian view has some weight, but in doing so, he shows that he hasn’t fully grasped what is at stake. He says,</p>\n<blockquote><p>All liberals, libertarians and Rawlsians alike, think that we each have the right to direct our own lives, and that we have a duty to respect one another by not interfering in others’ choices about what ends to pursue. The ideal is powerful and attractive. Its possibility depends, however, on the existence of selves of the right kind: self-governing agents who really do make choices about what ends to pursue. When a person is incapable of making such choices, such non-manipulative relations are impossible. That is why it is appropriate to paternalize children. Since the purpose of liberal rights is to allow persons to exercise their moral and rational powers, liberalism requires that persons develop those powers to some minimum degree. (pp. 158–59)</p></blockquote>\n<p>It’s understandable that Koppelman is attached to his conception of autonomous choice, but one would hope him capable of realizing that some people do not accept it.</p>\n<p>Given his emphasis on autonomy, Koppelman responds to a <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=615562\">proposal</a> about drug regulation by the legal academic Gregory Mitchell in a strange way. Mitchell suggests that people should be encouraged to engage in greater self-reflection about their choices. Koppelman objects:</p>\n<blockquote><p>With respect to a great many decisions that affect our lives, we do not <em>want</em> to engage in greater reflection. That demands time that we can’t spare. We want to pursue the projects that matter most to us, and delegate other decisions to someone else. Forcing us to deliberate about everything (or more precisely, attempting to force the impossible) is its own form of officious paternalism. It is in fact totalitarian: rather than block a single option, which would be bad enough, it dictates how we are to spend our time and direct our attention. (p. 161, emphasis in original)</p></blockquote>\n<p>Koppelman is correct that people shouldn’t be forced to engage in deliberation, but it’s odd for someone who says, “You shouldn’t be free to take dangerous drugs whenever you choose, because you’re not an autonomous chooser” to say also, “You should be free to let the state make choices for you about which drugs to take, because thinking about this is too much trouble for you.”</p>\n<p>As Koppelman notes, one argument against drug restriction is that this leads to other measures that restrict liberty. Koppelman answers that this need not happen. “It is possible to restrict substances without today’s orgy of mass incarceration. If the aim is reducing consumption, diminishing returns set in very quickly. During Prohibition, alcohol consumption dropped by between 33 and 50 percent, even though nearly nothing was spent on enforcement” (p. 158). Koppelman appears unaware that Prohibition led to grave violations of civil liberties, such as the use of wiretapping and the destruction of property, ably analyzed by the historian and sociologist Harry Elmer Barnes in <em>Prohibition versus Civilization</em> (1932) and in the contemporary classic by Mark Thornton, <a href=\"https://cdn.mises.org/Economics%20of%20Prohibition_2.pdf\"><em>The Economics of Prohibition</em></a> (1991).</p>\n<p>Patrick Henry said, “Give me liberty or give me death,” not “Give me autonomy or give me death,” and he was wise in his choice of words.</p>\n\n",
  "author": "David Gordon",
  "enclosure": "",
  "guid": 60839,
  "pubDate": "Fri, 04 Nov 2022 11:00:00 -0500",
  "source": "Mises Wire"
}