{
  "title": "Cram\\'er-Rao Bounds for Holographic Positioning. (arXiv:2111.02229v2 [eess.SP] UPDATED)",
  "link": "http://arxiv.org/abs/2111.02229",
  "description": "<p>Multiple antennas arrays play a key role in wireless networks for\ncommunications but also for localization and sensing applications. The use of\nlarge antenna arrays at high carrier frequencies (in the mmWave range) pushes\ntowards a propagation regime in which the wavefront is no longer plane but\nspherical. This allows to infer the position and orientation of a transmitting\nsource from the received signal without the need of using multiple anchor\nnodes, located in known positions. To understand the fundamental limits of\nlarge antenna arrays for localization, this paper combines wave propagation\ntheory with estimation theory, and computes the Cram\\'er-Rao Bound (CRB) for\nthe estimation of the source position on the basis of the three Cartesian\ncomponents of the electric field, observed over a rectangular surface area. The\nproblem is referred to as holographic positioning and is formulated by taking\ninto account the radiation angular pattern of the transmitting source, which is\ntypically ignored in standard signal processing models. We assume that the\nsource is a Hertzian dipole, and address the holographic positioning problem in\nboth cases, that is, with and without a priori knowledge of its orientation. To\nsimplify the analysis and gain further insights, we also consider the case in\nwhich the dipole is located on the line perpendicular to the surface center.\nNumerical and asymptotic results are given to quantify the CRBs, and to\nquantify the effect of various system parameters on the ultimate estimation\naccuracy. It turns out that surfaces of practical size may guarantee a\ncentimeter-level accuracy in the mmWave bands.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/eess/1/au:+DAmico_A/0/1/0/all/0/1\">Antonio A. D&#x27;Amico</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Torres_A/0/1/0/all/0/1\">Andrea de Jesus Torres</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Sanguinetti_L/0/1/0/all/0/1\">Luca Sanguinetti</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Win_M/0/1/0/all/0/1\">Moe Win</a>"
}