{
  "title": "Pivoted document length normalisation",
  "link": "https://rare-technologies.com/pivoted-document-length-normalisation/",
  "pubDate": "Tue, 19 Jun 2018 15:07:09 +0000",
  "dc:creator": "Mohit Rathore",
  "category": [
    "gensim",
    "Student Incubator",
    "pivoted normalization",
    "tfidf"
  ],
  "guid": "https://rare-technologies.com/?p=10576",
  "description": "As a part of the RARE incubator program my goal was to add two new features on the existing TF-IDF model of Gensim. One was implementing a SMART information retrieval system (smartirs) scheme [1] and the other was implementing pivoted document length normalization [2]. In this blog I'll discuss the whys and whats of the implementation. I'll also inspect the ... <div><a href=\"https://rare-technologies.com/pivoted-document-length-normalisation/\" class=\"more-link\">Read More</a></div>",
  "content:encoded": "<p>\nAs a part of the <a href=\"https://rare-technologies.com/incubator/\">RARE incubator program</a> my goal was to add two new features on the existing TF-IDF model of Gensim. One was implementing a SMART information retrieval system (smartirs) scheme <a href=\"https://en.wikipedia.org/wiki/SMART_Information_Retrieval_System\">[1]</a> and the other was implementing pivoted document length normalization <a href=\"http://singhal.info/pivoted-dln.pdf\">[2]</a>. \n</p>\n\n<span id=\"more-10576\"></span>\n\n<p>\nIn this blog I'll discuss the whys and whats of the implementation. I'll also inspect the original paper by Singhal, et al <a href=\"http://singhal.info/pivoted-dln.pdf\">[2]</a> on pivoted document length normalization.\n</p>\n\n<h3 id=\"Why\">Why pivoted document length normalization?</h3>\n\n<p>\nWhen classifying documents into various categories it was noticed in the same paper Singhal, et al <a href=\"http://singhal.info/pivoted-dln.pdf\">[2]</a> that cosine normalization tends to favor retrieval of short documents but suppresses the retrieval of long documents:\n</p>\n\n<div id=\"attachment_2\" style=\"width: 388px\" class=\"wp-caption aligncenter\"><img src=\"https://rare-technologies.com/wp-content/uploads/2018/04/fig1.png\" alt=\"Figure 1.\" width=\"378\" height=\"395\" class=\"size-medium wp-image-6\" /><p class=\"wp-caption-text\">Figure 1. - The variation of probability of retrieval and relevance with respect to document length.</p></div>\n\n<p>\nOur goal is to boost the probability of retrieving long documents and suppress the probability of retrieval of short documents so that the probability of retrieval and relevance for a given document align.\n</p>\n\n<h3 id=\"Term\">101 on TF-IDF</h3>\n\n<p>\nBefore we get to pivoted normalization itself, a few words on the bag-of-words model, term-frequency-inverse-document-frequency (TF-IDF) and the SMART weighting schemes. If you’re familiar with TF-IDF and its variants, you can skip straight to the sections below.\n</p>\n\n<h4>Term glossary</h4>\n\n<p>\nTerm Frequency is the number of times a word has occurred in the document or a words frequency in a document. Its domain remains local to the document.\nDocument frequency is the fraction of documents in which the word has occurred. It’s calculated based on statistics collected from the entire corpus.\n</p>\n\n<p>\nIn very simple terms TF-IDF scheme is used for extracting features or important words which can be the best representative of your document. To get the intuitive feel of TF-IDF, consider a recipe book which has recipe of various fast foods.\n</p>\n\n<p>\nHere the recipe book is our corpus and each recipe is our document. Now consider various recipes such as:\n</p>\n\n<ol>\n<li>\nBurger which will consist of words like \"bun\", \"meat\", \"lettuce\", \"ketchup\", \"heat\", \"onion\", \"food\", \"preparation\", \"delicious\", \"fast\"\n</li>\n<li>\nFrench fries which will consist of words like \"potato\", \"fry\", \"heat\", \"oil\", \"ketchup\", \"food\", \"preparation\", \"fast\"\n</li>\n<li>\nPizza which will consist of words like \"ketchup\", \"capsicum\", \"heat\", \"food\", \"delicious\", \"oregano\", \"dough\", \"fast\"\n</li>\n</ol>\n\n<p>\nHere words like \"fast\", \"food\", \"preparation\", \"heat\" occur in almost all the recipes. Such words will have a very high document frequency. Now consider words like \"bun\", \"lettuce\" for the recipe burger, \"potato\" and \"fry\" for the recipe french fries and \"dough\" and \"oregano\" for the recipe pizza. These have a high term frequency for the particular recipe they are related to, but will have a comparatively low document frequency.\n</p>\n\n<p>\nNow we propose the scheme of TF-IDF which simply put is a mathematical product of term-frequency and inverse of the document frequency of each term. One can clearly visualize how the words like \"potato\" in French fries will have a high TF-IDF value and at the same time are the best representative of the document which in this case is \"French Fries\".\n</p>\n\n<p>\nNow mathematically speaking:\n</p>\n\n<ul>\n<li>\n<p><strong>Term frequency</strong>: For a word (or term) <code>t</code>, the term frequency is denoted by <code>tf<sub>t,d</sub></code> and the frequency of each term in a document <code>d</code> is denoted by <code>f<sub>t,d</sub></code> then <code>tf<sub>t,d</sub> = f<sub>t,d</sub></code>\n</p>\n</li>\n\n<li>\n<p><strong>Inverse document frequency</strong>: Taking the log smartirs scheme for inverse document frequency <code>idf</code> is calculated as  <img src=\"http://bit.ly/2EoYVee\" width=\"257\" height=\"48\" class /> \nor the log of inverse fraction of document that contain the term <code>t</code>, where <code>N</code> is the total number of documents in the corpus. To avoid division by zero error generally 1 is added to the denominator.\n</p></li>\n\n<li><p><strong>TF-IDF</strong>: Finally, TF-IDF is calculated as the product of term frequency <code>tf<sub>t,d</sub></code> and inverse document frequency <code>idf(t,D)</code>, <code>TF-IDF(t,d,D) = tf<sub>t,d</sub> * idf<sub>t,D</sub></code>\n</p></li>\n\n<li><p><strong>Retrieval curve</strong>: It is the probability distribution of a document that is returned by the model against the document length of the documents. Refer to Figure 1.\n</p></li>\n\n<li><p><strong>Relevance curve</strong>\nIt is the probability distribution of a document that is expected from the model against the document length of the documents. Refer figure 1.\n</p></li>\n</ol>\n\n<h3 id=\"SMART\">SMART Information Retrieval System</h3>\n\n<p>\nThere exist multiple variants of how to weight the terms and document frequencies, using subtly different formulas. To make the notation scheme clearer, describes SMART (System for the Mechanical Analysis and Retrieval of Text, see Wikipedia <a href=\"https://en.wikipedia.org/wiki/SMART_Information_Retrieval_System\">[1]</a> information retrieval system, or SMARTIRS in short, defines a mnemonic scheme for denoting TF-IDF weighting variants in the vector space model. This notation is a 3-letter string of form TDN where T represents the term weighting for term frequency, D represents the term weighting for document frequency, and N represents the normalization scheme employed after the calculation of TF-IDF:\n</p>\n\n\n<div id=\"attachment_3\" style=\"width: 802px\" class=\"wp-caption aligncenter\"><img src=\"https://rare-technologies.com/wp-content/uploads/2018/04/smartirs.png\" alt=\"SMARTIRS\" width=\"792\" height=\"310\" class=\"size-medium wp-image-6\" /><p class=\"wp-caption-text\">The standard SMARTIRS notation.</p></div>\n\n<p>\nFor example, the most basic TF-IDF variant is described as “ntc” under this scheme.\n</p>\n\n<h3 id=\"Pivoted\">Pivoted document length normalization</h3>  \n\n<p>\nWith the basics out of the way, what is pivoted normalization exactly and how does it work?\n</p>\n\n<p>\nWe can solve the problem described in section 2 by introducing a new bias in favor of long documents to counter the unwanted bias introduced by cosine normalization for short documents. So our pivoted normalization scheme should be something like:\n</p>\n\n<div id=\"attachment_4\" style=\"width: 384px\" class=\"wp-caption aligncenter\"><img src=\"https://rare-technologies.com/wp-content/uploads/2018/04/fig2.png\" alt=\"Figure - 2\" width=\"374\" height=\"379\" class=\"size-medium wp-image-6\" /><p class=\"wp-caption-text\">Figure 2. - Using pivot and alpha to \"tilt\" the old normalisation.</p></div>\n\n<p>\nThe normalization factor should be high for short documents and low for long documents.\n(Remember that the graph is plotted for calculating the normalization factor. The higher the normalization factor, the lower is the TF-IDF value. More discussion on this in the later part.)\n</p>\n\n<p>\nThis approach requires two parameters for the normalization to work:\n</p>\n\n<ul>\n<li><p>Pivot: In figure 1 pivot is the document length below which the probability of retrieval is higher than the probability of relevance of a document and above which the probability of relevance is higher than the probability of retrieval of a document.</p>\n</p></li>\n\n<li><p>Slope: The slope decides the amount of \"tilting\" at the pivot point which is required to bring the relevance and retrieval curves as close as possible. Mathematically, slope is the tangent of the angle made by old normalization with the new normalisation.\n</p></li>\n</ul>\n\n<p>\nWe expect the user to supply both of these values. Generally, we can use the average number of unique terms in a document (computed across the entire collection) as the pivot and use grid search to get the optimum value of slope which ranges from 0 to 1. For a more detailed example the user can check this <a href=\"https://github.com/RaRe-Technologies/gensim/blob/develop/docs/notebooks/pivoted_document_length_normalisation.ipynb\">notebook</a> out.\n</p>\n\n<p>\nUsing basic coordinate geometry (which we are not going to discuss here) we can propose the new normalization scheme as <code>pivoted normalization = (1.0 - slope) x pivot + slope x old normalization</code>.\n</p>\n\n<h4 id=\"Comparative\">Comparative study</h4>\n\n<p>\nI used the publicly available <a href=\"http://qwone.com/~jason/20Newsgroups/\">twenty-newsgroup dataset</a> for comparing the traditional TF-IDF methods with that of pivoted normalization.\n</p>\n\n<p>\nThe study was conducted for binary classification of text into two categories namely 'sci.electronics' and 'sci.space'. The data consisted of 1184 training documents and 787 test documents belonging to the two categories.\n</p>\n\n<p>\nI used TF-IDF to generate features from documents which were later fed to a logistic regression classifier. The logistic regression classifier implementation of <code>sklearn</code> assigns scores to each document, which for my particular case had a varying score from approximately -2 to 2. The magnitude suggests the confidence level of the model that a particular document belongs to a particular class and the sign of these scores suggested the category to which the documents should belong.\n</p>\n\n<p>\nThe idea was to plot a histogram for the top K scoring documents and visualize their scores.\n</p>\n\n\n<div id=\"attachment_5\" style=\"width: 770px\" class=\"wp-caption aligncenter\"><img src=\"https://rare-technologies.com/wp-content/uploads/2018/04/hist-860x499.png\" alt=\"Figure - 3\" width=\"760\" height=\"499\" class=\"size-medium wp-image-6\" /><p class=\"wp-caption-text\">Figure 3. - The confidence scores of documents plotted against the corresponding document length. The first plot is using the traditional TFIDF and the second is using pivoted document length normalisation.</p></div>\n\n<p>\nWe observe an overall increase in the confidence score since we are introducing an additional bias for long documents along with the already present intrinsic bias for short document. \n</p>\n\n<p>\nAlso please do not confuse that the score of the same document is increased. The plot is  plotted against the score of top-k documents which are different in both the plots.\n</p>\n\n<p>\nIn the first histogram we can see that using regular TF-IDF implementation (or when slope was 1), there was a certain bias for short documents as one can see sparsity in bins around the length of 2500 and high density of bins around the length less than and around 500. Suggesting that shorter documents had a higher probability of appearing in the top K documents.\n</p>\n\n<p>\nAs we decreased the slope to 0.2, we notice that the histogram plot is now equalized and shows little sign of bias with respect to document length. We also notice an increase in accuracy of 1.1%.\n</p>\n\n<p>\nAlso by using pivoted document normalization we notice an increase in scores of nearly all the top K documents fetched. This mostly doesn't affect our results because the scores are almost evenly scaled up. Though this suggests that our model is now more confident in classifying the documents into a particular class.\n</p>\n\n<div id=\"attachment_6\" style=\"width: 310px\" class=\"wp-caption aligncenter\"><img src=\"https://rare-technologies.com/wp-content/uploads/2018/04/piv10.png\" alt=\"Figure - 4\" title=\"Figure 4\" width=\"402\" height=\"271\" class=\"size-medium wp-image-6\" /><p class=\"wp-caption-text\">Figure 4</p></div>\n\n<p>\nFigure 4 is a plot between slope and achieved accuracy of the model, it suggests that a decrease in slope doesn't always necessarily increase the accuracy. The reason for this behaviour can be attributed to the fact that by introducing too much bias for long documents to counter the bias for short documents, after a certain extent we are introducing another overall bias in the TF-IDF model which is redundant and unwanted.\n</p>\n\n<h4 id=\"References\">References</h4>\n[1] - <a href=\"https://en.wikipedia.org/wiki/SMART_Information_Retrieval_System\">https://en.wikipedia.org/wiki/SMART_Information_Retrieval_System</a>   \n[2] - <a href=\"http://singhal.info/pivoted-dln.pdf\">http://singhal.info/pivoted-dln.pdf</a>"
}