{
  "title": "My Ideal Tweet",
  "link": "",
  "updated": "2020-08-18T00:00:00+00:00",
  "id": "https://mrocklin.github.io/blog/work/2020/08/18/tweet",
  "content": "<p>Tweets, like all writing, should respect the reader through brevity and structure.</p>\n\n<h2 id=\"caveats\">Caveats</h2>\n\n<p>First, I’m mostly talking about professional tweets, and less about pictures of\nfamily outings, cute cats, or hilarious memes.  If that’s how you use Twitter,\nthen please disregard this post (or make fun of it with a hilarious meme).</p>\n\n<h2 id=\"example-tweet\">Example Tweet</h2>\n\n<p>Of my last few tweets, I think that this best exemplifies brevity and structure.</p>\n\n<p><img src=\"https://mrocklin.github.io/blog/images/tweet-video.png\" width=\"50%\" align=\"center\" /></p>\n\n<h2 id=\"what-i-like-about-this-structure\">What I like about this structure</h2>\n\n<ol>\n  <li>\n    <p>It starts with a short, single-line explanation, followed by a line break.</p>\n\n    <p>People skim, especially on Twitter.\nWe need to get to the point immediately.\nThe line break helps the eye focus on the summary/hook,\nand buys us a little bit of attention\nwhile the reader decides if they want to read more.</p>\n  </li>\n  <li>\n    <p>It then delivers actual novel content</p>\n\n    <p>After you’ve hooked the reader you can deliver some novel information.\nHere we follow with an enumerated list,\nincluding actual novel information like prices.\nReaders learn something on the internet, huzzah!</p>\n  </li>\n  <li>\n    <p>There is clickable link with an image</p>\n\n    <p>Tweets with clickable images seem to get shared more often.\nI’m not a fan of including stock photos just for click bait (this\ndisrespects the reader in my opinion), but if you are linking to a blogpost\nor video, it’s nice if SEO is active enough to have a clickable thing on\nthe bottom.</p>\n  </li>\n  <li>\n    <p>Deliver personalized opinions at the end</p>\n\n    <p>As a social medium, Twitter is slightly more personal than a blogpost.\nWhen I write a blog I try to remain neutral and precise (arguably too much\nso).  On Twitter I don’t mind stating the occasional personal opinion or\nbias.  I think that a subtle tint of personality makes me feel better about\nmy tweets, and maybe improves engagement too.</p>\n\n    <p>People like it when humans act like humans sometimes.</p>\n  </li>\n</ol>\n\n<h2 id=\"things-to-avoid-in-my-opinion\">Things to avoid (in my opinion)</h2>\n\n<p>I personally filter out most tweets that are half <a href=\"\">#hashtags</a> and\n<a href=\"\">@mentions</a>.\nIn my experience these are usually written by professional marketing folks, and\nI’ve learned to associate a bit less value to these tweets.</p>\n\n<p>Of course, there is a trade off here.  Accounts that are explicitly mentioned\nare more likely to retweet.  Tagging influencers feels cheap, but can\nsometimes be effective.  Personally, I like adding them in replies at the\nbottom “Hey @famousperson, I was thinking of your post … when writing this\nup. I’d love to know if you have thoughts.”  In general I think that\nself-replies are a great way to avoid packing too much into the header tweet,\nwhile still engaging other folks that you want to engage.</p>\n\n<p>Separately, I also think,\nperhaps unusually,\nthat the normal rules of writing apply.\nI avoid walls of text, abbreviations, internet shorthands, and so on.</p>\n\n<h2 id=\"engagement\">Engagement</h2>\n\n<p>I think that these suggestions make it easier to scan and abosrb,\nwhich I think eventually lead to improved engagement.</p>"
}