{
  "id": "yt:video:qI14RH-UnZ8",
  "yt:videoId": "qI14RH-UnZ8",
  "yt:channelId": "UCPD_bxCRGpmmeQcbe2kpPaA",
  "title": "TWICE Break Down Their Favorite Snacks | Snacked",
  "link": "",
  "author": {
    "name": "First We Feast",
    "uri": "https://www.youtube.com/channel/UCPD_bxCRGpmmeQcbe2kpPaA"
  },
  "published": "2022-10-18T15:00:28+00:00",
  "updated": "2022-10-19T15:00:04+00:00",
  "media:group": {
    "media:title": "TWICE Break Down Their Favorite Snacks | Snacked",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "TWICE is a K-pop supergroup, celebrating its seventh year of topping the charts in South Korea and beyond. But when Nayeon, Jeongyeon, Momo, Sana, Jihyo, Mina, Dahyun, Chaeyoung, and Tzuyu aren't busy taking the K-pop world by storm, they're snacking on some of their favorite chips, candies, and chocolates from around the world. From Korean classics like Star Popeye and Ppushu Ppushu, to international favorites like Sour Skittles and Crisp Choco, these are the treats that helped turn TWICE into a certified K-pop phenomenon. \n\nBUY HOT ONES BONELESS CHICKEN BITES NOW: https://hotoneschallenge.com/\n\nMAKE A DIFFERENCE BY DONATING TO COMMON THREADS, THE BRAND-NEW CHARITY PARTNER OF HOT ONES: https://www.commonthreads.org/firstwefeast/\n\nBUY HOT ONES TRUTH OR DAB THE GAME NOW: http://truthordabgame.com\n\nBUY HOT ONES HOT SAUCE NOW: http://bit.ly/HotOnesSaucesNEW\n\nHOT ONES MERCH AVAILABLE NOW: https://bit.ly/2AIS271\n\nSIGN UP FOR THE HOT ONES MONTHLY HOT SAUCE SUB BOX: https://bit.ly/2veY50P\n\nSIGN UP FOR THE FIRST WE FEAST NEWSLETTER: http://firstwefeast.com/signup\n\nSubscribe to First We Feast on YouTube: http://goo.gl/UxFzhK\n\nCheck out more of First We Feast here:\n\nhttp://firstwefeast.com/\n\nhttps://twitter.com/firstwefeast\n\nhttps://www.facebook.com/FirstWeFeast\n\nhttp://instagram.com/firstwefeast\n\nFirst We Feast videos offer an iconoclastic view into the culinary world, taking you behind-the-scenes with some of the country’s best chefs and finding the unexpected places where food and pop culture intersect. #snacked #twice #kpop #korea #트와이스",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}