{
  "title": "HK Authorities Use Dodgy Charge to Convict Publisher Lai",
  "description": "Beijing delivers another blow to personal and press freedom in Hong Kong",
  "link": "https://www.asiasentinel.com/p/hongkong-dodgy-charge-convict-jimmy-lai",
  "guid": "https://www.asiasentinel.com/p/hongkong-dodgy-charge-convict-jimmy-lai",
  "dc:creator": "John Berthelsen",
  "pubDate": "Thu, 27 Oct 2022 02:38:25 GMT",
  "enclosure": "",
  "content:encoded": "<div class=\"captioned-image-container\"><figure><a class=\"image-link is-viewable-img image2\" target=\"_blank\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F10d1befe-6050-4f50-9837-dc05af157963_1049x591.jpeg\"><div class=\"image2-inset\"><picture><source type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F10d1befe-6050-4f50-9837-dc05af157963_1049x591.jpeg 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F10d1befe-6050-4f50-9837-dc05af157963_1049x591.jpeg 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F10d1befe-6050-4f50-9837-dc05af157963_1049x591.jpeg 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F10d1befe-6050-4f50-9837-dc05af157963_1049x591.jpeg 1456w\" sizes=\"100vw\"><img src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F10d1befe-6050-4f50-9837-dc05af157963_1049x591.jpeg\" width=\"1049\" height=\"591\" data-attrs=\"{\"src\":\"https://bucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com/public/images/10d1befe-6050-4f50-9837-dc05af157963_1049x591.jpeg\",\"fullscreen\":null,\"imageSize\":null,\"height\":591,\"width\":1049,\"resizeWidth\":null,\"bytes\":135293,\"alt\":null,\"title\":null,\"type\":\"image/jpeg\",\"href\":null,\"belowTheFold\":false,\"internalRedirect\":null}\" class=\"sizing-normal\" alt=\"\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F10d1befe-6050-4f50-9837-dc05af157963_1049x591.jpeg 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F10d1befe-6050-4f50-9837-dc05af157963_1049x591.jpeg 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F10d1befe-6050-4f50-9837-dc05af157963_1049x591.jpeg 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F10d1befe-6050-4f50-9837-dc05af157963_1049x591.jpeg 1456w\" sizes=\"100vw\"></picture><div class=\"image-link-expand\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"16\" height=\"16\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"#FFFFFF\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\" class=\"lucide lucide-maximize2\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" y1=\"3\" x2=\"14\" y2=\"10\"></line><line x1=\"3\" y1=\"21\" x2=\"10\" y2=\"14\"></line></svg></div></div></a></figure></div><p>The most troubling aspect of the widely expected October 25 conviction of democracy advocate and media tycoon Jimmy Lai in a Hong Kong district court is that, clearly, the government had to search long and hard for a crime to fit whatever punishment is in store for the 74-year-old Lai.</p><p>The most important element that has separated Hong Kong from China and made it the home of thousands of multinational corporations and financial institutions has been its philosophy of hewing to the rule of law. That is now in danger.</p><p>The court convicted Lai on two counts of fraud for allegedly violating the lease on his corporate headquarters by subletting part of the office space in the building that housed his media outlet <em>Apple Daily</em> to another of his own companies. District Court Judge Stanley Chan Kwong-chi said the firm&#8217;s business didn&#8217;t conform with the lease agreement and that Lai had hidden the fact the company was using space in the building.</p><p>The lease violation is a minor common offense, with businesses routinely operating without legal authorization in premises and flats in industrial zones without prosecution, even for breach of tenancy, let alone fraud. In an effort to put Lai and Apple Daily out of business, authorities clearly were searching for an offense.</p><p>A more astonishing example concerned a case reported by the Hong Kong Free Press, one of the few independent publications left in the city, on the same day. After the High Court rejected a government effort to invalidate vaccination exceptions given by a liberal-minded doctor on the grounds that the government didn&#8217;t have the power to do so, officials simply announced a law change effective immediately even though it hadn&#8217;t been debated, let alone given the legislative rubber stamp by a Legislative Council that no longer has an opposition.</p><p>The implications of that action for the corporations and financial institutions domiciled in the city, making it the financial hub of Asia, are disturbing, to say the least. If the government can no longer be trusted to follow its own laws in a relatively minor case involving vaccine exemptions, it is concerning what happens when the stakes rise exponentially.</p><p>As to Lai&#8217;s conviction, with a sentence yet to be pronounced, it was preordained from the time he was arrested in January 2020. He has already <a href=\"https://cpj.us20.list-manage.com/track/click?u=6ad2c1e7bfaa1357bb4387b58&id=0878780992&e=26dd312665\">served</a>&nbsp;a 20-month prison term for two other charges relating to his alleged involvement with unauthorized demonstrations that shook the city periodically from 2014 with the onset of the pro-democracy Umbrella Movement. He is&nbsp;<a href=\"https://cpj.us20.list-manage.com/track/click?u=6ad2c1e7bfaa1357bb4387b58&id=785b98ef02&e=26dd312665\">awaiting trial</a>&nbsp;on national security charges, for which he faces life imprisonment with proceedings expected to begin on December 1.&nbsp;</p><p>Realistically, given the political situation in China with its unforgiving attitude toward what Beijing considers an ungrateful and rebellious city, Lai, who made a fortune with the Giordano clothing line before being forced to divest the company after insulting Chinese leader Deng Xiaoping, may never be freed. Chinese leader Xi Jinping, who last week won effective lifetime tenure, has little sympathy for either Lai or Hong Kong&#8217;s recalcitrant citizens.</p><p>What has happened to Lai, whose arrest along with other Apple Daily executives and the closure of the paper was condemned months earlier by US President Joe Biden and European Union officials, is in large measure what has happened to Hong Kong, once one of the most vibrant cities in Asia if not the world. Some 47 former elected legislators and activists remain in jail, charged under the National Security Law with &#8220;conspiracy to commit subversion&#8221; for what their supporters say were peaceful political activities. Five of the defendants have been charged with being &#8220;major organizers,&#8221; which suggests possible sentences of up to life in prison. Although 29 agreed to plead guilty weeks ago, hoping for lighter sentences, sentencing has been delayed until at least November.</p><p>The city has also been badly crippled by its zero-tolerance approach to the Covid-19 coronavirus, with harsh quarantines that have driven many executives to leave the city for Singapore and other locations, as officials have kowtowed to Beijing and Xi&#8217;s crippling restrictions, which have shaved a considerable amount off of China&#8217;s GDP as production linkages and supply chains have taken the brunt of the restrictions.</p><p><strong>Speedy dismantling of Next Media</strong></p><p>As to Lai&#8217;s Next Media, what was perhaps unexpected was the speed with which one of Hong Kong&#8217;s most popular media empires was dismantled and removed from the city without a trace. On June 18, 2021, the brash 26-year-old Apple Daily broadsheet had a paid circulation of 86,000, with its website the second most-used among online news media in the city.</p><p>According to a survey conducted by the&nbsp;<a href=\"https://en.wikipedia.org/wiki/Chinese_University_of_Hong_Kong\">Chinese University of Hong Kong</a>,&nbsp;Apple Daily&nbsp;was the third most trusted paid newspaper in 2019, only marginally behind the English-language South China Morning Post and the Chinese-language Ming Pao. A week later, it was effectively gone.</p><p>Hong Kong authorities used the national security law to raid the paper with hundreds of police and to freeze the company assets as well as Lai&#8217;s own properties. Unable to pay salaries or its other bills, the paper published its final edition five days later on June 24, with supporters lined up for blocks to buy the final print edition of a million copies. In addition to Lai, six former Apple Daily staff members were detained and face life imprisonment under similar charges.&nbsp;</p><p>International press watchdog organizations condemned the conviction, with the Committee to Protect Journalists issuing a statement by CPJ President Jodie Ginsberg in New York saying the verdict &#8220;shows that Hong Kong will stop at nothing to silence one of its fiercest media critics. Lai is clearly being targeted for his journalism, and the persecution must stop. Hong Kong authorities should let Lai go free and drop all charges against him.&#8221; In 2021, Lai&nbsp;<a href=\"https://cpj.us20.list-manage.com/track/click?u=6ad2c1e7bfaa1357bb4387b58&id=3c2bb61226&e=26dd312665\">received&nbsp;</a>CPJ&#8217;s Gwen Ifill Press Freedom Award in recognition of his extraordinary and sustained commitment to press freedom.</p><p>The Paris-based Reporters Without Borders (RSF) launched a petition calling on the Hong Kong authorities to urgently release Lai, a 2020 laureate of RSF&#8217;s Press Freedom Prize, and his six collaborators, who are accused of national security-related crimes and face a life sentence. Lai, said RSF East Asia Bureau Head Cedric Alviani urged the international community to&nbsp;&#8220;increase the pressure to secure Lai&#8217;s release, alongside his collaborators and all other press freedom defenders detained in Hong Kong and in the Mainland.&#8221;</p><p>CPJ called China the&nbsp;<a href=\"https://cpj.us20.list-manage.com/track/click?u=6ad2c1e7bfaa1357bb4387b58&id=9a596443f6&e=26dd312665\">world&#8217;s worst jailer of journalists</a>&nbsp;in 2021, according to CPJ&#8217;s December 1&nbsp;<a href=\"https://cpj.us20.list-manage.com/track/click?u=6ad2c1e7bfaa1357bb4387b58&id=101a58d96c&e=26dd312665\">prison census</a>. It was also&nbsp;<a href=\"https://cpj.us20.list-manage.com/track/click?u=6ad2c1e7bfaa1357bb4387b58&id=8e5d1895b4&e=26dd312665\">the first time</a>&nbsp;that journalists in Hong Kong appeared on CPJ&#8217;s census.</p>"
}