{
  "title": "The Many Ways the FOMC Can Be Wrong…",
  "link": "https://ritholtz.com/2022/11/the-many-ways-the-fomc-can-be-wrong/",
  "dc:creator": "Barry Ritholtz",
  "pubDate": "Fri, 04 Nov 2022 21:00:44 +0000",
  "category": [
    "Federal Reserve",
    "Inflation"
  ],
  "guid": "https://ritholtz.com/?p=303403",
  "description": "<p>&#160; Since it is late on a Friday, I thought I might share some quick thoughts about the week. I have been wondering, more than usual, about the disconnect between what we see in falling prices and the Federal Reserve’s anti-inflation actions. It is difficult to reconcile Fed rhetoric with the actual price of Goods.&#8230;</p>\n<p><a class=\"button\" href=\"https://ritholtz.com/2022/11/the-many-ways-the-fomc-can-be-wrong/\">Read More <i class=\"icon ion-arrow-right-c\"></i></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://ritholtz.com/2022/11/the-many-ways-the-fomc-can-be-wrong/\">The Many Ways the FOMC Can Be Wrong…</a> appeared first on <a rel=\"nofollow\" href=\"https://ritholtz.com\">The Big Picture</a>.</p>\n",
  "content:encoded": "<div class=\"pf-content\"><p><a href=\"https://search-production.openverse.engineering/image/66159111-e131-44b4-884c-af90ffa04051\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" class=\"alignnone wp-image-303516\" src=\"https://ritholtz.com/wp-content/uploads/2022/11/7777982086_2cf9c19bd8_c.jpeg\" alt=\"\" width=\"720\" height=\"478\" srcset=\"https://ritholtz.com/wp-content/uploads/2022/11/7777982086_2cf9c19bd8_c.jpeg 800w, https://ritholtz.com/wp-content/uploads/2022/11/7777982086_2cf9c19bd8_c-300x199.jpeg 300w, https://ritholtz.com/wp-content/uploads/2022/11/7777982086_2cf9c19bd8_c-768x510.jpeg 768w, https://ritholtz.com/wp-content/uploads/2022/11/7777982086_2cf9c19bd8_c-250x166.jpeg 250w\" sizes=\"(max-width: 720px) 100vw, 720px\" /></a></p>\n<p>&nbsp;</p>\n<p>Since it is late on a Friday, I thought I might share some quick thoughts about the week.</p>\n<p>I have been wondering, more than usual, about the disconnect between what we see in falling prices and the Federal Reserve’s anti-inflation actions. It is difficult to reconcile Fed rhetoric with the actual price of Goods.</p>\n<p>One can reach only so many conclusions: Perhaps the Fed is right and everybody else is wrong. This suggests that rates need to be appreciably higher and stay that way for longer. Or, the Fed could be wrong and many others are right: Inflation has already peaked and reversed but higher rates are already causing real and unnecessary suffering; keep tightening but raise unemployment, slow consumer spending, and perhaps even cause a recession.</p>\n<p>There is a real possibility that the Fed&#8217;s diagnosis is correct. However, this will only be known in the fullness of time, after inflation is tamed and the economy does not suffer too greatly from the cure.</p>\n<p>That presents a far less interesting scenario for discussion purposes than its opposite: That the Fed is wrong and is undertaking a deeply misguided policy.</p>\n<p>I don&#8217;t want to become a scold on this issue (although I suspect it might be too late). So instead, consider a far more provocative framing. As a thought experiment, ponder the ways that the Federal Reserve could be wrong, either in its understanding of the current situation or in its response thereto.</p>\n<p>I break it down into five broad categories:</p>\n<blockquote><p>1. The Fed is wrong about inflation, magnitude and/or direction.<br />\n2. The Fed is right about inflation but misunderstands the underlying causes.<br />\n3. The Fed is right about inflation but lacks the appropriate tools to address the 2020 inflation cycle.<br />\n4. We don’t know if the Fed is right about anything – Economics is at best a squishy and imperfect soft science.<br />\n5. The Fed is indifferent about inflation, but is being aggressive in order to protect it&#8217;s institutional reputation.</p></blockquote>\n<p>You could write a treatise on each of these, explaining how each occurred and what they mean for the economy and markets. The ramifications are significant.</p>\n<p>Think of each idea as a leaping-off point for further discussion. What is already reflected in stock and bond prices? Does consensus usually develop early or late with these sorts of issues? If the FOMC is right, how long will it be before we know? Before inflation falls? Before rates drop? What tools are they missing? When does it become obvious they were right or wrong?</p>\n<p>Regardless, it’s a worthwhile exercise to wargame Fed actions, and consider what they might mean to your portfolio and/or personal finances.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><em>Previously</em>:<br />\n<a href=\"https://ritholtz.com/2022/11/behind-the-curve-part-v/\" target=\"_blank\" rel=\"noopener\">Behind the Curve, Part V</a> (November 3, 2022)</p>\n<p><a href=\"https://ritholtz.com/2022/11/when-your-only-tool-is-a-hammer/\" target=\"_blank\" rel=\"noopener\">When Your Only Tool is a Hammer</a> (November 1, 2022)</p>\n<p><a href=\"https://ritholtz.com/2022/10/why-is-the-fed-always-late-to-the-party/\" target=\"_blank\" rel=\"noopener\">Why Is the Fed Always Late to the Party?</a> (October 7, 2022)</p>\n<p><a href=\"https://ritholtz.com/2022/06/inflation-blame-15/\" target=\"_blank\" rel=\"noopener\">Who Is to Blame for Inflation, 1-15</a> (June 28, 2022)</p>\n<p>&nbsp;</p>\n</div><p>The post <a rel=\"nofollow\" href=\"https://ritholtz.com/2022/11/the-many-ways-the-fomc-can-be-wrong/\">The Many Ways the FOMC Can Be Wrong…</a> appeared first on <a rel=\"nofollow\" href=\"https://ritholtz.com\">The Big Picture</a>.</p>\n"
}