{
  "id": "https://bibleinoneyear.org/en/youth/45",
  "title": "Day 45: The Most Important Question in the World",
  "description": "Psalm 21:8,13, Exodus 16:4,18–20, Matthew 28:5–20. 20) The result of the resurrection is not only his power and his presence but also his provision",
  "pubDate": "Mon, 14 Feb 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/45/",
  "itunes:duration": "13:21",
  "guid": "enyouth14022022-45",
  "length": 801.85,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 45: The Most Important Question in the World",
  "itunes:subtitle": "Psalm 21:8,13, Exodus 16:4,18–20, Matthew 28:5–20. 20) The result of the resurrection is not only his power and his presence but also his provision",
  "itunes:summary": "The brilliant professor of philosophy at London University, C.E.M. Joad, was not a Christian. He was asked on a radio programme, ‘If you could meet any person from the past and ask them just one question, whom would you meet and what question would you ask?’\nProfessor Joad answered without hesitation: ‘I would meet Jesus Christ and ask him the most important question in the world – “Did you or did you not rise from the dead?”’\nThere came a day in Professor Joad’s life when he assessed the evidence, encountered Jesus himself and wrote a book called, Recovery of Belief. If Jesus Christ is risen from the dead, this changes everything.\nWhen the New Testament writers speak of God’s love they point to the cross. When they speak of God’s power they point to the resurrection. God’s ‘incomparably great power’ was ‘exerted in Christ when he raised him from the dead’ (Ephesians 1:19–20). The risen Jesus says to his disciples, ‘All authority (all power to rule) in heaven and on earth has been given to me’ (Matthew 28:18, AMP).\nThe resurrection means that the risen Jesus is present with you now. Jesus continues, ‘I am with you always’ (v.20).\nThe result of the resurrection is not only his power and his presence but also his provision.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 410
}