{
  "id": "https://bibleinoneyear.org/en/youth/229",
  "title": "Day 229: How to Enjoy God",
  "description": "Psalm 98:1-2,4-7, 2 Chronicles 7:14, 1 Corinthians 11:20–21,23–25,27–28,33-34.  It is out of his love for you that God created you to worship  According to the *Westminster Shorter Catechism*, humankind’s ‘chief end is to glorify God and to *enjoy* him for ever’",
  "pubDate": "Wed, 17 Aug 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/229/",
  "itunes:duration": "14:00",
  "guid": "enyouth17082022-229",
  "length": 840.49,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 229: How to Enjoy God",
  "itunes:subtitle": "Psalm 98:1-2,4-7, 2 Chronicles 7:14, 1 Corinthians 11:20–21,23–25,27–28,33-34.  It is out of his love for you that God created you to worship  According to the *Westminster Shorter Catechism*, humankind’s ‘chief end is to glorify God and to *enjoy* him for ever’",
  "itunes:summary": "You and I are created to worship God. But why would God create human beings in order to receive their worship? Is this not, as some suggest, pure vanity?\nMany years ago, I was helped in my understanding of worship through C.S. Lewis’s explanation in his Reflections on the Psalms.\nHe wrote: ‘The most obvious fact about praise… strangely escaped me… I had never noticed that all enjoyment spontaneously overflows into praise… the world rings with praise... walkers praising the countryside, players praising their favourite game – praise of weather, wines, dishes, actors, horses, colleges, countries, historical personages, children, flowers, mountains, rare stamps, rare books, even sometimes politicians and scholars…\n‘I think we delight to praise what we enjoy because the praise not merely expresses but completes the enjoyment; it is its appointed consummation. It’s not out of compliment that lovers keep on telling one another how beautiful they are; the delight is incomplete till it is expressed.’\nIn other words, worship is the consummation of joy. Our joy is not complete until it is expressed in worship. It is out of his love for you that God created you to worship. According to the Westminster Shorter Catechism, humankind’s ‘chief end is to glorify God and to enjoy him for ever’.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 594
}