{
  "title": "How to Improve Your Subscription-Based Business by Predicting Churn",
  "dc:creator": "Louis Dorard",
  "pubDate": "Fri, 27 Jun 2014 15:06:11 +0000",
  "link": "http://blog.kissmetrics.com/improve-by-predicting-churn/",
  "guid": "5206b718e4b0bdc26006bae2:5206b959e4b0bdc26006be4a:53ad7769e4b003339a863047",
  "description": "Churn prediction is one of the most popular Big Data use cases in business. \nIt consists of detecting customers who are likely to cancel a subscription \nto a service. Although originally a telco giant thing, this concerns \nbusinesses of all sizes, including startups. The problem of churn \nprediction can be tackled with machine learning techniques. Now, thanks to \nprediction services and APIs, this sort of predictive analytics is no \nlonger exclusive to big players that can afford to hire teams of data \nscientists.",
  "content:encoded": "<p>A couple of weeks ago I wrote a guest post on churn prediction for Kissmetrics, and they <a href=\"http://blog.kissmetrics.com/improve-by-predicting-churn/#comment-307001\">just published it</a>.</p>\n\n<p>Churn prediction is one of the most popular Big Data use cases in business. It consists in detecting which customers are likely to cancel a subscription to a service based on how they use the service. Being able to predict churn based on customer data has proven extremely valuable to big telecom companies. <strong>Now, thanks to prediction services and APIs, it’s accessible to businesses of all sizes</strong> — not only those who can afford to hire teams of data scientists.</p>\n\n<p>The process is as follows:</p>\n\n<ul>\n<li><strong>Step 1:</strong> Gather historical customer data that you save to a CSV file.</li>\n<li><strong>Step 2:</strong> Upload that data to a prediction service that automatically creates a “predictive model.”</li>\n<li><strong>Step 3:</strong> Use the model on each current customer to predict whether they are at risk of leaving.</li>\n</ul>\n\n<p>Check out my <a href=\"http://blog.kissmetrics.com/improve-by-predicting-churn/#comment-307001\">full post on the Kissmetrics blog</a> for details on these steps and for an illustration of how to go through Steps 2 and 3 with <a href=\"http://www.bigml.com/\">BigML</a>.</p>\n\n<p>If you find this article useful, please <a href=\"https://news.ycombinator.com/submitlink?u=http%3A%2F%2Fblog.kissmetrics.com%2Fimprove-by-predicting-churn%2F&t=How%20to%20improve%20your%20subscription-based%20business%20by%20predicting%20hurn\">vote for it on HackerNews</a>!</p>\n\n<p>If you want to dig deeper and see what to do next, check out my book, <a href=\"https://www.ownml.co/machine-learning-book\">Bootstrapping Machine Learning</a>.</p>\n<iframe scrolling=\"yes\" src=\"https://dl.dropboxusercontent.com/u/685335/optin.html\" allowtransparency=\"true\" width=\"100%\" frameborder=\"0\" id=\"mailchimp\" height=\"400px\"></iframe><p><a href=\"https://www.ownml.co/blog/predict-churn\">Permalink</a><p>",
  "media:content": {
    "media:title": "How to Improve Your Subscription-Based Business by Predicting Churn"
  }
}