{
  "title": "Episode 83: &#8220;Only The Lonely&#8221; by Roy Orbison",
  "link": "https://500songs.com/podcast/episode-83-only-the-lonely-by-roy-orbison/",
  "pubDate": "Fri, 22 May 2020 21:02:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=466",
  "description": "Episode eighty-three of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Only the Lonely\" by Roy Orbison, and how Orbison finally found success by ignoring conventional pop song structure. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have two bonus podcasts -- <a href=\"https://www.patreon.com/posts/37336922\">part one of a two-part Q&A</a> and a ten-minute bonus on<a href=\"https://www.patreon.com/posts/37385535\"> \"Walk Don't Run\" by the Ventures</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I have put together <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-83-only-the-lonely/\">a Mixcloud mix</a> with every song excerpted in this podcast.\n\nI have relied for biographical information mostly on two books -- <a href=\"https://amzn.to/2JTpdt6\"><em>The Authorised Roy Orbison</em></a> written by Jeff Slate and three of Orbison's children, and <em><a href=\"https://amzn.to/2LRggln\">Rhapsody in Black</a> </em>by John Kruth.\n\nFor the musicological analysis, I referred a lot to the essay “Only the Lonely: Roy Orbison’s Sweet West Texas Style,” by Albin Zak, in <a href=\"https://amzn.to/36lqtzL\"><em>Sounding Out Pop: Analytical Essays in Popular Music</em>. </a>\n\nThere are many Orbison collections available, but many have rerecordings rather than the original versions of his hits. <a href=\"https://amzn.to/3cUXeGr\"><em>The Monument Singles Collection</em> is the originals. </a>\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nIt's been nearly a year since we last looked at Roy Orbison, so it's probably a good idea to quickly catch up with where we were up to. Roy Orbison had started out as a rockabilly singer, with a group called the Wink Westerners who changed their name to the Teen Kings and were signed to Sun Records. Orbison had thought that he would like to be a ballad singer, but everyone at Sun was convinced that he would never make it as anything other than a rocker. He had one minor hit on Sun, \"Ooby Dooby\", but eventually got dissatisfied with the label and asked to be allowed to go to another label -- Sam Phillips agreed to free him from his contract, in return for all the songwriting royalties and credits for everything he'd recorded for Sun.\n\nNewly free, Orbison signed to a major publisher and a major record label, recording for RCA with the same Nashville A-Team that were recording with Elvis and Brenda Lee. He had some success as a songwriter, writing \"Claudette\", which became a hit for the Everly Brothers, but he did no better recording for RCA than he had recording for Sun, and soon he was dropped by his new label, and the money from \"Claudette\" ran out. By the middle of 1959, Roy Orbison was an absolute failure.\n\nBut this episode, we're going to talk about what happened next, and the startling way in which someone who had been a failure when produced by both Sam Phillips and Chet Atkins managed to become one of the most important artists in the world on a tiny label with no track record. Today, we're going to look at \"Only the Lonely\", and the records that turned Roy Orbison into a star:\n\n[Excerpt: Roy Orbison, \"Only the Lonely\"]\n\nIt seems odd that Roy Orbison could thank Wesley Rose for introducing him to Monument Records. Rose was the co-owner of Acuff-Rose publishing, the biggest country music publishing company in the world, and the company to which Orbison had signed as a songwriter. Fred Foster, the owner of Monument, describes being called to a meeting of various Nashville music industry professionals, at which Rose asked him in front of everyone \"Why are you trying to destroy Nashville by making these...\" and then used an expletive I can't use here and a racial slur I *won't* use here, to describe the slightly R&B-infused music Foster was making.\n\nFoster was part of the new wave of Nashville record makers that also included Owen Bradley and Chet Atkins, though at this time he was far less successful than either of them. Foster had started out as a songwriter, writing the words for the McGuire Sisters' hit \"Picking Sweethearts\":\n\n[Excerpt: The McGuire Sisters, \"Picking Sweethearts\"]\n\nHe had moved from there into record production, despite having little musical or technical ability. He did, though, have a good ear for artists, and he made his career in the business by picking good people and letting them do the music they wanted. He started out at 4 Star Records, a small country label. From there he moved to Mercury Records, but he only spent a brief time there -- he was in favour of moving into the rockabilly market, while his superiors in the company weren't. He quickly found another role at ABC/Paramount, where he produced hits for a number of people, including one track we've already covered in this podcast, Lloyd Price's version of \"Stagger Lee\". He then put his entire life savings into starting up his own company, Monument, which he initially co-owned with a DJ named Buddy Deane. As Foster and Deane were based in Washington at this time, they used an image of the Washington Monument as the label's logo, and that also inspired the name.\n\nThe first single they put out on the label caused them some problems. Billy Grammer, their first signing, recorded a song that they believed to be in the public domain, \"Done Laid Around\", which had recently been recorded by the Weavers under the name \"Gotta Travel On\":\n\n[Excerpt: The Weavers, \"Gotta Travel On\"]\n\nHowever, after putting out Grammer's version, Foster discovered that the song was actually in copyright, with a credit to the folk singer and folklorist Paul Clayton. I don't know if Clayton actually wrote the song or not -- it was common practice at that time for folk songs to be copyrighted in the name of an artist.\n\nBut whether Clayton wrote the song or not, \"Done Laid Around\" had to be withdrawn from sale, and reissued under the name \"Gotta Travel On\", with Clayton credited as the composer -- something which cost the new label a substantial amount of money. But it worked out well for everyone, with Grammer's record eventually reaching number four on the pop charts:\n\n[Excerpt: Billy Grammer, \"Gotta Travel On\"]\n\nAfter that success, Foster bought out Buddy Deane and moved the label down to Nashville. They put out a few more singles over the next year, mostly by Grammer, but nothing recaptured that initial success. But it did mean that Foster started working with the Nashville A-Team of session musicians -- people like Bob Moore, the bass player who played on almost every important record to come out of Nashville at that time, including the Elvis records we looked at last week.\n\nMoore had also played on Roy Orbison's last sessions for RCA, where he'd seen how downcast Orbison was. Orbison had explained to Moore about how this was going to be his last session for RCA -- his contract was about to expire, and it was clear that Chet Atkins had no more idea than Sam Phillips how to make a successful Roy Orbison record. Moore told him not to worry -- he very obviously had talent, and Moore would speak to Wesley Rose about him.\n\nAs well as being Orbison's music publisher, Rose was also Orbison's manager, something that would nowadays be considered a conflict of interest, but was par for the course at the time -- he was also the Everly Brothers' manager and publisher, which is how Orbison had managed to place \"Claudette\" with them. There were a lot of such backroom deals in the industry at the time, and few people knew about them -- for example, none of Bob Moore's fellow session players on the A-Team knew that he secretly owned thirty-seven percent of Monument Records.\n\nWhile Fred Foster is credited as the producer on most of Orbison's sessions from this point on, it's probably reasonable to think of Bob Moore as at the very least an uncredited co-producer -- he was the arranger on all of the records, and he was also the person who booked the other musicians on the sessions.\n\nOrbison was by this point so depressed about his own chances in the music industry that he couldn't believe that anyone wanted to sign him at all -- he was convinced even after signing that Fred Foster was confusing his own \"Ooby Dooby\" with another Sun single, Warren Smith's similar sounding \"Rock and Roll Ruby\":\n\n[Excerpt: Warren Smith, \"Rock and Roll Ruby\"]\n\nWesley Rose had very clear ideas as to what Orbison's first single for Monument should be -- that last session at RCA had included two songs, \"Paper Boy\", and \"With the Bug\", that RCA had not bothered to release, and so Orbison went into the studio with much the same set of musicians he'd been working with at RCA, and cut the same songs he'd recorded there. The single was released, and made absolutely no impact -- unsurprising for a record that was really the end of Orbison's period as a failure, rather than the beginning of his golden period.\n\nThat golden period came when he started collaborating with Joe Melson. The two men had known each other for a while, but the legend has it that they started writing songs together after Melson was walking along and saw Orbison sat in his car playing the guitar -- Orbison and his wife Claudette had recently had a son, Roy DeWayne Orbison (his middle name was after Orbison's friend Duane Eddy, though spelled differently), and the flat they were living in was so small that the only way Orbison could write any songs without disturbing the baby was to go and write them in the car.\n\nMelson apparently tapped on the car window, and asked what Roy was doing, and when Roy explained, he suggested that the two of them start working together. Both men were more than capable songwriters on their own, but they brought out the best in one another, and soon they were writing material that was unlike anything else in popular music at the time.\n\nTheir first collaboration to be released was Orbison's second Monument single, \"Uptown\", a bluesy rock and roll track which saw the first big change in Orbison's style -- the introduction of a string section along with the Nashville A-Team. This was something that was only just starting to be done in Nashville, and it made little sense to most people involved that Orbison would want strings on what would otherwise be a rockabilly track, but they went ahead:\n\n[Excerpt: Roy Orbison, \"Uptown\"]\n\nThe string arrangement was written by Anita Kerr, of the Anita Kerr Singers, the female vocal group that would be called into any Nashville session that required women's voices (the male equivalent was the Jordanaires). Kerr would write a lot of the string arrangements for Orbison's records, and her vocal group -- with Joe Melson adding a single male voice -- would provide the backing vocals on them for the next few years.\n\nWesley Rose was still unsure that Orbison could ever be a star, mostly because he thought he was so odd-looking, but \"Uptown\" started to prove him wrong. It made number seventy-two on the pop charts -- still not a massive hit, but the best he'd done since \"Ooby Dooby\" three years and two record labels earlier.\n\nBut it was the next single, another Orbison/Melson collaboration, that would make him into one of the biggest stars in music.\n\n\"Only the Lonely\" had its roots in two other songs. Melson had written a song called \"Cry\" before ever meeting Orbison, and the two of them had reworked it into one called \"Only the Lonely\", but they were also working on another song at the same time. They had still not had a hit, and were trying to write something in the style of a current popular record. At the time, Mark Dinning was having huge success with a ballad called \"Teen Angel\", about a girl who gets run over by a train:\n\n[Excerpt: Mark Dinning, \"Teen Angel\"]\n\nOrbison and Melson were writing their own knock-off of that, called \"Come Back to Me My Love\". But when they played it for Fred Foster, he told them it was awful, and they should scrap the whole thing -- apart from the backing vocal hook Joe was singing. That was worth doing something with:\n\n[Excerpt: Roy Orbison, \"Only the Lonely\", vocal intro]\n\nThey took that vocal part and put it together with \"Only the Lonely\" to make a finished song. According to most reports, rather than have Orbison record it, they initially tried to get Elvis to do it -- if they did, they must have known that they had no chance of it getting recorded, because Elvis was only recording songs published by Hill and Range, and Orbison and Melson were Acuff-Rose songwriters. They also, though, tried to get it recorded by the Everly Brothers, who were friends of Orbison, were also signed with Acuff-Rose, and were also managed by Wesley Rose, and even they turned it down.\n\nThis is understandable, because the finished \"Only the Lonely\" is one of the most bizarrely structured songs ever to be a hit. Now, I've known this song for more than thirty years, I have a fair understanding of music, *and* I am explaining this with the help of a musicological essay on the song I've read, analysing it bar by bar. I am *still* not sure that my explanation of what's going on with this song is right. *That's* how oddly structured this song is.\n\nThe intro is straightforward enough, the kind of thing that every song has. But then the lead vocal comes in, and rather than continue under the lead, like you would normally expect, the lead and backing vocals alternate, and push each other out of phase as a result. Where in the intro, the first \"dum dum dum\" starts on the first bar of the phrase, here it starts on the *second* bar of the phrase and extends past the end of Orbison's line, meaning the first line of the verse is actually five bars (from where the instruments come in after the a capella \"Only the\"), and not only that, the backing vocals are stressing different beats to the ones the lead vocal is stressing:\n\n[Excerpt: Roy Orbison, \"Only the Lonely\", first line of verse]\n\nThis is quite astonishingly jarring. Pop songs, of whatever genre -- country, or blues, or rock and roll, or doo-wop, or whatever -- almost all work in fours. You have four-bar phrases that build up into eight- or twelve-bar verses, choruses, and bridges. Here, by overlaying two four-bar phrases out of synch with each other, Orbison and Melson have created a five-bar phrase -- although please note if you try to count bars along with these excerpts, you may come out with a different number, because phrases cross bar lines and I'm splitting these excerpts up by the vocal phrase rather than by the bar line.\n\nThe lead vocal then comes back, on a different beat than expected -- the stresses in the melody have moved all over the place. Because the lead vocal starts on a different beat for the second phrase, even though it's the same length as the first phrase, it crosses more bar lines, meaning two five-bar phrases total eleven bars. Not only that, but the bass doesn't move to a new chord where you expect, but it stays on its original chord for an extra two beats, giving the impression of a six-beat bar, even though the drums are staying in four-four. So the first half of the verse is eleven bars long, if you don't get thrown by thinking one of the bars is six beats rather than four. Structurally, harmonically, and rhythmically, it feels like someone has tried to compromise between a twelve-bar blues and an eight-bar doo-wop song:\n\n[Excerpt: Roy Orbison, \"Only the Lonely\", second line]\n\nThere's then another section, which in itself is perfectly straightforward -- an eight-bar stop-time section, whose lyric is possibly inspired by the Drifters song that had used strings and rhythmic disorientation in a similar way a few months earlier:\n\n[Excerpt: Roy Orbison, \"Only the Lonely\", \"There goes my baby...\"]\n\nThe only incongruity there is a very minor one -- a brief move to the fifth-of-fifth chord, which is the kind of extremely minor deviation from the key that's par for the course in pop music. That section by itself is nothing unusual.\n\nBut then after that straightforward eight-bar section, which seems like a return to normality, we then get a five-bar section which takes us to the end of the verse:\n\n[Excerpt: Roy Orbison, \"Only the Lonely\", \"But only the lonely know why...\"]\n\nThe song then basically repeats all its musical material from the start, with a few changes – the second time, the verse starts on the third of the scale rather than the first, and the melody goes up more, but it's structured similarly, and finishes in under two and a half minutes.\n\nSo the musical material of the song covers twenty-four bars, not counting the intro. Twenty-four bars is actually a perfectly normal number of bars for a song to cover, but it would normally be broken down into three lots of eight or two lots of twelve -- instead it's a five, a six, an eight, and a five. I think. Honestly, I've gone back and forth several times about how best to break this up.\n\nThe song is so familiar to most of us now that this doesn't sound strange any more, but I distinctly remember my own first time listening to it, when I was about eight, and wondering if the backing vocalists just hadn't known when to come in, if the people making the record just hadn't known how to make one properly, because this just sounded *wrong* to me.\n\nBut it's that wrongness, that strangeness, of course -- along with Orbison's magnificent voice -- that made the record a hit, expressing perfectly the confusion and disorientation felt by the song's protagonist. It went to number two in the US, and number one in the UK, and instantly made Roy Orbison a star.\n\nA couple of slightly more conventional singles followed -- \"Blue Angel\" and \"I'm Hurtin'\" -- and they were both hits, but nowhere near as big as \"Only the Lonely\", and this seems to have convinced Orbison and Melson that they needed to follow their instincts and go for different structures than the norm. They started to make their songs, as far as possible, through-composed pieces. While most songs of the time break down into neat little sections -- verse, chorus, verse, chorus, middle eight, instrumental solo, chorus to fade, or a similar structure, Orbison and Melson's songs rarely have sections that repeat without any changes. Instead a single melody develops and takes twists and turns over the course of a couple of minutes, with Orbison usually singing throughout.\n\nThis also had another advantage, as far as Orbison was concerned -- their songs hardly ever had space for an instrumental break, and so he never had to do the rock and roll star thing of moving around the stage and dancing while the instrumentalists soloed, which was something he felt uncomfortable doing. Instead he could just stand perfectly still at the microphone and sing.\n\nThe first single they released that fit this new style was inspired by a piece of music Fred Foster introduced Orbison to -- Ravel's \"Bolero\":\n\n[Excerpt: Ravel, \"Bolero\" (West-Eastern Divan Orchestra)]\n\nOrbison and Melson took that basic feel and changed it into what would become Orbison's first number one in the US, \"Running Scared\":\n\n[Excerpt: Roy Orbison, \"Running Scared\"]\n\nThat song was apparently one that met some resistance from the Nashville A-Team. A chunk of the song is in rubato, or \"free time\", where the musicians speed up or slow down slightly to make the music more expressive. This was not something that Bob Moore, in particular, was comfortable with -- they were making pop music, weren't they? Pop music was for kids to dance to, and if kids were going to dance to it, it had to have a steady beat.\n\nOrbison wasn't very good at all at dealing with conflict, and wherever possible he would try to take the most positive attitude possible, and in this case he just went into the control room and waited, while the musicians tried to figure out a way of playing the song in strict tempo, and found it just didn't work. After a while, Orbison walked back into the studio and said \"I think we should play it the way it was written\", and the musicians finally went along with him.\n\nIt may also have been on \"Running Scared\" that they pioneered a new recording technique, or at least new for Nashville, which was surprisingly conservative about recording technology for a town so rooted in the music industry. I've seen this story written about three different early Orbison songs, and it could have been any of them, but the descriptions of the \"Running Scared\" session are the most detailed. While Orbison had a great voice, at this point it wasn't especially powerful, and with the addition of strings, the band were overpowering his voice. At this time, it was customary for singers to record with the band, all performing together in one room, but the sound of the instruments was getting into Orbison's mic louder than his voice, making it impossible to get a good mix. Eventually, they brought a coatrack covered with coats into the studio, and used it to partition the space -- Orbison would stand on one side of it with his mic, and the band and their mics would be on the other side. The coats would deaden the sound of the musicians enough that Orbison's voice would be the main sound on his vocal mic.\n\nIn this case, the reason his voice was being overpowered was that right at the end of the song he had to hit a high A in full voice -- something that's very difficult for a baritone like Orbison to do without going into falsetto. It may also be that he was nervous about trying this when the musicians could see him, and the coats in the way helped him feel more secure. Either way, he does a magnificent job on that note:\n\n[Excerpt: Roy Orbison, \"Running Scared\", tag]\n\nApparently when Chet Atkins popped into the studio for a visit, he was utterly bemused by what he saw -- but then he was impressed enough by the idea that he got RCA to build a proper vocal isolation booth at their studios to get the same effect.\n\n\"Running Scared\" also came along just after Orbison made one big change to his image. He'd been on tour with Patsy Cline, promoting \"Blue Angel\", and had left his glasses on the plane. As he couldn't see well without them, he had to resort to using his prescription sunglasses on stage, and was astonished to find that instead of looking gawky and rather odd-looking, the audience now seemed to think he looked cool and brooding. From that point on, he wore them constantly.\n\nFor the next three years, Orbison and Melson continued working together and producing hits -- although Orbison also wrote several hits solo during this time, including \"In Dreams\", which many consider his greatest record. But Melson was becoming increasingly convinced that he was the real talent in the partnership. Melson was also putting out singles on his own at this time, and you can judge for yourself whether his most successful solo track, \"Hey Mr. Cupid\" is better or worse than the tracks Orbison did without him.\n\n[Excerpt: Joe Melson, \"Hey Mr. Cupid\"]\n\nEventually Melson stopped working with Orbison altogether, after their last major collaboration, \"Blue Bayou\".\n\nThis turned out to be the beginning of the collapse of Orbison's entire life, though it didn't seem like it at the time. It was the first crack in the team that produced his biggest hits, but for now he was on a roll. He started collaborating with another writer, Bill Dees, and even though Beatlemania was raging in the UK, and later in the US, he was one of a tiny number of American artists who continued to have hits. Indeed, two of the early collaborations by Orbison and Dees were the *only* two records by an American artist to go to number one in the UK between August 1963 and February 1965. The second of those, \"Oh, Pretty Woman\", also went to number one in the US, and became one of his most well-known songs:\n\n[Excerpt: Roy Orbison, \"Oh, Pretty Woman\"]\n\nThat song again caused problems with his new collaborator, as Bill Dees sang the harmony vocals on it, and felt he wasn't getting enough credit for that.\n\nBut that was the high point for Orbison. Wesley Rose and Fred Foster had never got on, and Rose decided that he was going to move Orbison over to MGM Records, who gave him an advance of a million dollars, but immediately the hits dried up. And the events of the next few years were the kind of thing that would would break almost anyone. He had divorced his wife Claudette, who had inspired \"Oh, Pretty Woman\", in November 1964, just before signing to MGM, because he'd discovered she was cheating on him. But the two of them had been so in love they'd ended up reconciling and remarrying in December 1965. But then six months later, they were out riding motorbikes together, Claudette crashed hers, and she died.\n\nAnd then a little over two years later, while he was on tour in the UK, his house burned down, killing two of his three children.\n\nOrbison continued to work, putting out records that no-one was buying, and playing the chicken-in-a-basket circuit in the UK. He even remarried in 1969, and found happiness and a new family with his second wife. But for about twenty years, from 1965 through to 1985, he was in a wilderness period. Between personal tragedy, changing fashions in music, and the heart condition he developed in the 70s, he was no longer capable of making records that resonated with the public, even though his voice was as strong as ever, and he could still get an audience when singing those old hits. And even the old hits were hard to get hold of -- Monument Records went bankrupt in the seventies, and reissues of his old songs were tied up in legal battles over their ownership.\n\nBut then things started to change for him in the mid-eighties. A few modern artists had had hits with cover versions of his hits, but the big change came in 1985, when he collaborated with his fellow ex-Sun performers Johnny Cash, Carl Perkins, and Jerry Lee Lewis, on an album called Class of 55:\n\n[Excerpt: Roy Orbison and the Class of 55, \"Coming Home\"]\n\nThat came out in 1986, and made the top twenty on the country charts -- the first time he'd had an album make any chart at all since 1966. Also in 1986, David Lynch used Orbison's \"In Dreams\" in his film Blue Velvet, which brought the record to a very different audience. He collaborated with k.d. lang, who was then one of the hottest new singers in country music, on a new version of his hit \"Crying\":\n\n[Excerpt: Roy Orbison and k.d. lang, \"Crying\"]\n\nThat later won a Grammy. He recorded a new album of rerecordings of his greatest hits, which made the lower reaches of the charts. He got inducted into the rock and roll hall of fame, and recorded a live TV special, A Black and White Night, where he was joined by Elvis' seventies backing band, Bruce Springsteen, Elvis Costello, k.d. lang, Bonnie Raitt, Jackson Browne and Tom Waits, among others, all just acting as backing singers and musicians for a man they admired.\n\nHe also joined with George Harrison, Jeff Lynne, Tom Petty and Bob Dylan in a supergroup called The Travelling Wilburys, whose first album made the top five:\n\n[Excerpt: The Travelling Wilburys, \"Handle With Care\"]\n\nAnd he recorded an album of new material, his best in decades, Mystery Girl, produced by Lynne and with songs written by Orbison, Lynne, and Petty -- along with a couple of songs contributed by famous admirers like Bono and the Edge of U2.\n\nBut by the time that came out, Orbison was dead -- after a day flying model aeroplanes with his sons, he had a heart attack and died, aged only fifty-two. When Mystery Girl came out a couple of months later, it rose to the top five or better almost everywhere -- and in the UK and US, he had two albums in the top five at the same time, as in the UK a hits compilation was also up there, while in the US the Wilburys album was still near the top of the charts.\n\nOrbison's is one of the saddest stories in rock music, with one of the greatest talents in history getting derailed for decades by heartbreaking tragedies unimaginable to most of us, and then dying right at the point he was finally starting to get the recognition he deserved. But the work he did, both as a songwriter and as a singer, would inspire people long after his death.",
  "itunes:subtitle": "Episode eighty-three of A History of Rock Music in Five Hundred Songs looks at Only the Lonely by Roy Orbison, and how Orbison finally found success by ignoring conventional pop song structure. Click the full post to read liner notes, links to more infor",
  "itunes:keywords": "Acuff-Rose publishing,Anita Kerr Singers,Bob Dylan,Bob Moore,Chet Atkins,Elvis Presley,Fred Foster,George Harrison,Jeff Lynne,Joe Melson,k.d. lang,Monument Records,Nashville,Nashville A Team,Roy Orbison,Sam Phillips,The Everly Brothers,The Weavers,Tom Petty,Wesley Rose",
  "itunes:episodeType": "full",
  "itunes:episode": 83,
  "content:encoded": "Episode eighty-three of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Only the Lonely\" by Roy Orbison, and how Orbison finally found success by ignoring conventional pop song structure. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have two bonus podcasts -- <a href=\"https://www.patreon.com/posts/37336922\">part one of a two-part Q&A</a> and a ten-minute bonus on<a href=\"https://www.patreon.com/posts/37385535\"> \"Walk Don't Run\" by the Ventures</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I have put together <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-83-only-the-lonely/\">a Mixcloud mix</a> with every song excerpted in this podcast.\n\nI have relied for biographical information mostly on two books -- <a href=\"https://amzn.to/2JTpdt6\"><em>The Authorised Roy Orbison</em></a> written by Jeff Slate and three of Orbison's children, and <em><a href=\"https://amzn.to/2LRggln\">Rhapsody in Black</a> </em>by John Kruth.\n\nFor the musicological analysis, I referred a lot to the essay “Only the Lonely: Roy Orbison’s Sweet West Texas Style,” by Albin Zak, in <a href=\"https://amzn.to/36lqtzL\"><em>Sounding Out Pop: Analytical Essays in Popular Music</em>. </a>\n\nThere are many Orbison collections available, but many have rerecordings rather than the original versions of his hits. <a href=\"https://amzn.to/3cUXeGr\"><em>The Monument Singles Collection</em> is the originals. </a>\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nIt's been nearly a year since we last looked at Roy Orbison, so it's probably a good idea to quickly catch up with where we were up to. Roy Orbison had started out as a rockabilly singer, with a group called the Wink Westerners who changed their name to the Teen Kings and were signed to Sun Records. Orbison had thought that he would like to be a ballad singer, but everyone at Sun was convinced that he would never make it as anything other than a rocker. He had one minor hit on Sun, \"Ooby Dooby\", but eventually got dissatisfied with the label and asked to be allowed to go to another label -- Sam Phillips agreed to free him from his contract, in return for all the songwriting royalties and credits for everything he'd recorded for Sun.\n\nNewly free, Orbison signed to a major publisher and a major record label, recording for RCA with the same Nashville A-Team that were recording with Elvis and Brenda Lee. He had some success as a songwriter, writing \"Claudette\", which became a hit for the Everly Brothers, but he did no better recording for RCA than he had recording for Sun, and soon he was dropped by his new label, and the money from \"Claudette\" ran out. By the middle of 1959, Roy Orbison was an absolute failure.\n\nBut this episode, we're going to talk about what happened next, and the startling way in which someone who had been a failure when produced by both Sam Phillips and Chet Atkins managed to become one of the most important artists in the world on a tiny label with no track record. Today, we're going to look at \"Only the Lonely\", and the records that turned Roy Orbison into a star:\n\n[Excerpt: Roy Orbison, \"Only the Lonely\"]\n\nIt seems odd that Roy Orbison could thank Wesley Rose for introducing him to Monument Records. Rose was the co-owner of Acuff-Rose publishing, the biggest country music publishing company in the world, and the company to which Orbison had signed as a songwriter. Fred Foster, the owner of Monument, describes being called to a meeting of various Nashville music industry professionals, at which Rose asked him in front of everyone \"Why are you trying to destroy Nashville by making these...\" and then used an expletive I can't use here and a racial slur I *won't* use here, to describe the slightly R&B-infused music Foster was making.\n\nFoster was part of the new wave of Nashville record makers that also included Owen Bradley and Chet Atkins, though at this time he was far less successful than either of them. Foster had started out as a songwriter, writing the words for the McGuire Sisters' hit \"Picking Sweethearts\":\n\n[Excerpt: The McGuire Sisters, \"Picking Sweethearts\"]\n\nHe had moved from there into record production, despite having little musical or technical ability. He did, though, have a good ear for artists, and he made his career in the business by picking good people and letting them do the music they wanted. He started out at 4 Star Records, a small country label. From there he moved to Mercury Records, but he only spent a brief time there -- he was in favour of moving into the rockabilly market, while his superiors in the company weren't. He quickly found another role at ABC/Paramount, where he produced hits for a number of people, including one track we've already covered in this podcast, Lloyd Price's version of \"Stagger Lee\". He then put his entire life savings into starting up his own company, Monument, which he initially co-owned with a DJ named Buddy Deane. As Foster and Deane were based in Washington at this time, they used an image of the Washington Monument as the label's logo, and that also inspired the name.\n\nThe first single they put out on the label caused them some problems. Billy Grammer, their first signing, recorded a song that they believed to be in the public domain, \"Done Laid Around\", which had recently been recorded by the Weavers under the name \"Gotta Travel On\":\n\n[Excerpt: The Weavers, \"Gotta Travel On\"]\n\nHowever, after putting out Grammer's version, Foster discovered that the song was actually in copyright, with a credit to the folk singer and folklorist Paul Clayton. I don't know if Clayton actually wrote the song or not -- it was common practice at that time for folk songs to be copyrighted in the name of an artist.\n\nBut whether Clayton wrote the song or not, \"Done Laid Around\" had to be withdrawn from sale, and reissued under the name \"Gotta Travel On\", with Clayton credited as the composer -- something which cost the new label a substantial amount of money. But it worked out well for everyone, with Grammer's record eventually reaching number four on the pop charts:\n\n[Excerpt: Billy Grammer, \"Gotta Travel On\"]\n\nAfter that success, Foster bought out Buddy Deane and moved the label down to Nashville. They put out a few more singles over the next year, mostly by Grammer, but nothing recaptured that initial success. But it did mean that Foster started working with the Nashville A-Team of session musicians -- people like Bob Moore, the bass player who played on almost every important record to come out of Nashville at that time, including the Elvis records we looked at last week.\n\nMoore had also played on Roy Orbison's last sessions for RCA, where he'd seen how downcast Orbison was. Orbison had explained to Moore about how this was going to be his last session for RCA -- his contract was about to expire, and it was clear that Chet Atkins had no more idea than Sam Phillips how to make a successful Roy Orbison record. Moore told him not to worry -- he very obviously had talent, and Moore would speak to Wesley Rose about him.\n\nAs well as being Orbison's music publisher, Rose was also Orbison's manager, something that would nowadays be considered a conflict of interest, but was par for the course at the time -- he was also the Everly Brothers' manager and publisher, which is how Orbison had managed to place \"Claudette\" with them. There were a lot of such backroom deals in the industry at the time, and few people knew about them -- for example, none of Bob Moore's fellow session players on the A-Team knew that he secretly owned thirty-seven percent of Monument Records.\n\nWhile Fred Foster is credited as the producer on most of Orbison's sessions from this point on, it's probably reasonable to think of Bob Moore as at the very least an uncredited co-producer -- he was the arranger on all of the records, and he was also the person who booked the other musicians on the sessions.\n\nOrbison was by this point so depressed about his own chances in the music industry that he couldn't believe that anyone wanted to sign him at all -- he was convinced even after signing that Fred Foster was confusing his own \"Ooby Dooby\" with another Sun single, Warren Smith's similar sounding \"Rock and Roll Ruby\":\n\n[Excerpt: Warren Smith, \"Rock and Roll Ruby\"]\n\nWesley Rose had very clear ideas as to what Orbison's first single for Monument should be -- that last session at RCA had included two songs, \"Paper Boy\", and \"With the Bug\", that RCA had not bothered to release, and so Orbison went into the studio with much the same set of musicians he'd been working with at RCA, and cut the same songs he'd recorded there. The single was released, and made absolutely no impact -- unsurprising for a record that was really the end of Orbison's period as a failure, rather than the beginning of his golden period.\n\nThat golden period came when he started collaborating with Joe Melson. The two men had known each other for a while, but the legend has it that they started writing songs together after Melson was walking along and saw Orbison sat in his car playing the guitar -- Orbison and his wife Claudette had recently had a son, Roy DeWayne Orbison (his middle name was after Orbison's friend Duane Eddy, though spelled differently), and the flat they were living in was so small that the only way Orbison could write any songs without disturbing the baby was to go and write them in the car.\n\nMelson apparently tapped on the car window, and asked what Roy was doing, and when Roy explained, he suggested that the two of them start working together. Both men were more than capable songwriters on their own, but they brought out the best in one another, and soon they were writing material that was unlike anything else in popular music at the time.\n\nTheir first collaboration to be released was Orbison's second Monument single, \"Uptown\", a bluesy rock and roll track which saw the first big change in Orbison's style -- the introduction of a string section along with the Nashville A-Team. This was something that was only just starting to be done in Nashville, and it made little sense to most people involved that Orbison would want strings on what would otherwise be a rockabilly track, but they went ahead:\n\n[Excerpt: Roy Orbison, \"Uptown\"]\n\nThe string arrangement was written by Anita Kerr, of the Anita Kerr Singers, the female vocal group that would be called into any Nashville session that required women's voices (the male equivalent was the Jordanaires). Kerr would write a lot of the string arrangements for Orbison's records, and her vocal group -- with Joe Melson adding a single male voice -- would provide the backing vocals on them for the next few years.\n\nWesley Rose was still unsure that Orbison could ever be a star, mostly because he thought he was so odd-looking, but \"Uptown\" started to prove him wrong. It made number seventy-two on the pop charts -- still not a massive hit, but the best he'd done since \"Ooby Dooby\" three years and two record labels earlier.\n\nBut it was the next single, another Orbison/Melson collaboration, that would make him into one of the biggest stars in music.\n\n\"Only the Lonely\" had its roots in two other songs. Melson had written a song called \"Cry\" before ever meeting Orbison, and the two of them had reworked it into one called \"Only the Lonely\", but they were also working on another song at the same time. They had still not had a hit, and were trying to write something in the style of a current popular record. At the time, Mark Dinning was having huge success with a ballad called \"Teen Angel\", about a girl who gets run over by a train:\n\n[Excerpt: Mark Dinning, \"Teen Angel\"]\n\nOrbison and Melson were writing their own knock-off of that, called \"Come Back to Me My Love\". But when they played it for Fred Foster, he told them it was awful, and they should scrap the whole thing -- apart from the backing vocal hook Joe was singing. That was worth doing something with:\n\n[Excerpt: Roy Orbison, \"Only the Lonely\", vocal intro]\n\nThey took that vocal part and put it together with \"Only the Lonely\" to make a finished song. According to most reports, rather than have Orbison record it, they initially tried to get Elvis to do it -- if they did, they must have known that they had no chance of it getting recorded, because Elvis was only recording songs published by Hill and Range, and Orbison and Melson were Acuff-Rose songwriters. They also, though, tried to get it recorded by the Everly Brothers, who were friends of Orbison, were also signed with Acuff-Rose, and were also managed by Wesley Rose, and even they turned it down.\n\nThis is understandable, because the finished \"Only the Lonely\" is one of the most bizarrely structured songs ever to be a hit. Now, I've known this song for more than thirty years, I have a fair understanding of music, *and* I am explaining this with the help of a musicological essay on the song I've read, analysing it bar by bar. I am *still* not sure that my explanation of what's going on with this song is right. *That's* how oddly structured this song is.\n\nThe intro is straightforward enough, the kind of thing that every song has. But then the lead vocal comes in, and rather than continue under the lead, like you would normally expect, the lead and backing vocals alternate, and push each other out of phase as a result. Where in the intro, the first \"dum dum dum\" starts on the first bar of the phrase, here it starts on the *second* bar of the phrase and extends past the end of Orbison's line, meaning the first line of the verse is actually five bars (from where the instruments come in after the a capella \"Only the\"), and not only that, the backing vocals are stressing different beats to the ones the lead vocal is stressing:\n\n[Excerpt: Roy Orbison, \"Only the Lonely\", first line of verse]\n\nThis is quite astonishingly jarring. Pop songs, of whatever genre -- country, or blues, or rock and roll, or doo-wop, or whatever -- almost all work in fours. You have four-bar phrases that build up into eight- or twelve-bar verses, choruses, and bridges. Here, by overlaying two four-bar phrases out of synch with each other, Orbison and Melson have created a five-bar phrase -- although please note if you try to count bars along with these excerpts, you may come out with a different number, because phrases cross bar lines and I'm splitting these excerpts up by the vocal phrase rather than by the bar line.\n\nThe lead vocal then comes back, on a different beat than expected -- the stresses in the melody have moved all over the place. Because the lead vocal starts on a different beat for the second phrase, even though it's the same length as the first phrase, it crosses more bar lines, meaning two five-bar phrases total eleven bars. Not only that, but the bass doesn't move to a new chord where you expect, but it stays on its original chord for an extra two beats, giving the impression of a six-beat bar, even though the drums are staying in four-four. So the first half of the verse is eleven bars long, if you don't get thrown by thinking one of the bars is six beats rather than four. Structurally, harmonically, and rhythmically, it feels like someone has tried to compromise between a twelve-bar blues and an eight-bar doo-wop song:\n\n[Excerpt: Roy Orbison, \"Only the Lonely\", second line]\n\nThere's then another section, which in itself is perfectly straightforward -- an eight-bar stop-time section, whose lyric is possibly inspired by the Drifters song that had used strings and rhythmic disorientation in a similar way a few months earlier:\n\n[Excerpt: Roy Orbison, \"Only the Lonely\", \"There goes my baby...\"]\n\nThe only incongruity there is a very minor one -- a brief move to the fifth-of-fifth chord, which is the kind of extremely minor deviation from the key that's par for the course in pop music. That section by itself is nothing unusual.\n\nBut then after that straightforward eight-bar section, which seems like a return to normality, we then get a five-bar section which takes us to the end of the verse:\n\n[Excerpt: Roy Orbison, \"Only the Lonely\", \"But only the lonely know why...\"]\n\nThe song then basically repeats all its musical material from the start, with a few changes – the second time, the verse starts on the third of the scale rather than the first, and the melody goes up more, but it's structured similarly, and finishes in under two and a half minutes.\n\nSo the musical material of the song covers twenty-four bars, not counting the intro. Twenty-four bars is actually a perfectly normal number of bars for a song to cover, but it would normally be broken down into three lots of eight or two lots of twelve -- instead it's a five, a six, an eight, and a five. I think. Honestly, I've gone back and forth several times about how best to break this up.\n\nThe song is so familiar to most of us now that this doesn't sound strange any more, but I distinctly remember my own first time listening to it, when I was about eight, and wondering if the backing vocalists just hadn't known when to come in, if the people making the record just hadn't known how to make one properly, because this just sounded *wrong* to me.\n\nBut it's that wrongness, that strangeness, of course -- along with Orbison's magnificent voice -- that made the record a hit, expressing perfectly the confusion and disorientation felt by the song's protagonist. It went to number two in the US, and number one in the UK, and instantly made Roy Orbison a star.\n\nA couple of slightly more conventional singles followed -- \"Blue Angel\" and \"I'm Hurtin'\" -- and they were both hits, but nowhere near as big as \"Only the Lonely\", and this seems to have convinced Orbison and Melson that they needed to follow their instincts and go for different structures than the norm. They started to make their songs, as far as possible, through-composed pieces. While most songs of the time break down into neat little sections -- verse, chorus, verse, chorus, middle eight, instrumental solo, chorus to fade, or a similar structure, Orbison and Melson's songs rarely have sections that repeat without any changes. Instead a single melody develops and takes twists and turns over the course of a couple of minutes, with Orbison usually singing throughout.\n\nThis also had another advantage, as far as Orbison was concerned -- their songs hardly ever had space for an instrumental break, and so he never had to do the rock and roll star thing of moving around the stage and dancing while the instrumentalists soloed, which was something he felt uncomfortable doing. Instead he could just stand perfectly still at the microphone and sing.\n\nThe first single they released that fit this new style was inspired by a piece of music Fred Foster introduced Orbison to -- Ravel's \"Bolero\":\n\n[Excerpt: Ravel, \"Bolero\" (West-Eastern Divan Orchestra)]\n\nOrbison and Melson took that basic feel and changed it into what would become Orbison's first number one in the US, \"Running Scared\":\n\n[Excerpt: Roy Orbison, \"Running Scared\"]\n\nThat song was apparently one that met some resistance from the Nashville A-Team. A chunk of the song is in rubato, or \"free time\", where the musicians speed up or slow down slightly to make the music more expressive. This was not something that Bob Moore, in particular, was comfortable with -- they were making pop music, weren't they? Pop music was for kids to dance to, and if kids were going to dance to it, it had to have a steady beat.\n\nOrbison wasn't very good at all at dealing with conflict, and wherever possible he would try to take the most positive attitude possible, and in this case he just went into the control room and waited, while the musicians tried to figure out a way of playing the song in strict tempo, and found it just didn't work. After a while, Orbison walked back into the studio and said \"I think we should play it the way it was written\", and the musicians finally went along with him.\n\nIt may also have been on \"Running Scared\" that they pioneered a new recording technique, or at least new for Nashville, which was surprisingly conservative about recording technology for a town so rooted in the music industry. I've seen this story written about three different early Orbison songs, and it could have been any of them, but the descriptions of the \"Running Scared\" session are the most detailed. While Orbison had a great voice, at this point it wasn't especially powerful, and with the addition of strings, the band were overpowering his voice. At this time, it was customary for singers to record with the band, all performing together in one room, but the sound of the instruments was getting into Orbison's mic louder than his voice, making it impossible to get a good mix. Eventually, they brought a coatrack covered with coats into the studio, and used it to partition the space -- Orbison would stand on one side of it with his mic, and the band and their mics would be on the other side. The coats would deaden the sound of the musicians enough that Orbison's voice would be the main sound on his vocal mic.\n\nIn this case, the reason his voice was being overpowered was that right at the end of the song he had to hit a high A in full voice -- something that's very difficult for a baritone like Orbison to do without going into falsetto. It may also be that he was nervous about trying this when the musicians could see him, and the coats in the way helped him feel more secure. Either way, he does a magnificent job on that note:\n\n[Excerpt: Roy Orbison, \"Running Scared\", tag]\n\nApparently when Chet Atkins popped into the studio for a visit, he was utterly bemused by what he saw -- but then he was impressed enough by the idea that he got RCA to build a proper vocal isolation booth at their studios to get the same effect.\n\n\"Running Scared\" also came along just after Orbison made one big change to his image. He'd been on tour with Patsy Cline, promoting \"Blue Angel\", and had left his glasses on the plane. As he couldn't see well without them, he had to resort to using his prescription sunglasses on stage, and was astonished to find that instead of looking gawky and rather odd-looking, the audience now seemed to think he looked cool and brooding. From that point on, he wore them constantly.\n\nFor the next three years, Orbison and Melson continued working together and producing hits -- although Orbison also wrote several hits solo during this time, including \"In Dreams\", which many consider his greatest record. But Melson was becoming increasingly convinced that he was the real talent in the partnership. Melson was also putting out singles on his own at this time, and you can judge for yourself whether his most successful solo track, \"Hey Mr. Cupid\" is better or worse than the tracks Orbison did without him.\n\n[Excerpt: Joe Melson, \"Hey Mr. Cupid\"]\n\nEventually Melson stopped working with Orbison altogether, after their last major collaboration, \"Blue Bayou\".\n\nThis turned out to be the beginning of the collapse of Orbison's entire life, though it didn't seem like it at the time. It was the first crack in the team that produced his biggest hits, but for now he was on a roll. He started collaborating with another writer, Bill Dees, and even though Beatlemania was raging in the UK, and later in the US, he was one of a tiny number of American artists who continued to have hits. Indeed, two of the early collaborations by Orbison and Dees were the *only* two records by an American artist to go to number one in the UK between August 1963 and February 1965. The second of those, \"Oh, Pretty Woman\", also went to number one in the US, and became one of his most well-known songs:\n\n[Excerpt: Roy Orbison, \"Oh, Pretty Woman\"]\n\nThat song again caused problems with his new collaborator, as Bill Dees sang the harmony vocals on it, and felt he wasn't getting enough credit for that.\n\nBut that was the high point for Orbison. Wesley Rose and Fred Foster had never got on, and Rose decided that he was going to move Orbison over to MGM Records, who gave him an advance of a million dollars, but immediately the hits dried up. And the events of the next few years were the kind of thing that would would break almost anyone. He had divorced his wife Claudette, who had inspired \"Oh, Pretty Woman\", in November 1964, just before signing to MGM, because he'd discovered she was cheating on him. But the two of them had been so in love they'd ended up reconciling and remarrying in December 1965. But then six months later, they were out riding motorbikes together, Claudette crashed hers, and she died.\n\nAnd then a little over two years later, while he was on tour in the UK, his house burned down, killing two of his three children.\n\nOrbison continued to work, putting out records that no-one was buying, and playing the chicken-in-a-basket circuit in the UK. He even remarried in 1969, and found happiness and a new family with his second wife. But for about twenty years, from 1965 through to 1985, he was in a wilderness period. Between personal tragedy, changing fashions in music, and the heart condition he developed in the 70s, he was no longer capable of making records that resonated with the public, even though his voice was as strong as ever, and he could still get an audience when singing those old hits. And even the old hits were hard to get hold of -- Monument Records went bankrupt in the seventies, and reissues of his old songs were tied up in legal battles over their ownership.\n\nBut then things started to change for him in the mid-eighties. A few modern artists had had hits with cover versions of his hits, but the big change came in 1985, when he collaborated with his fellow ex-Sun performers Johnny Cash, Carl Perkins, and Jerry Lee Lewis, on an album called Class of 55:\n\n[Excerpt: Roy Orbison and the Class of 55, \"Coming Home\"]\n\nThat came out in 1986, and made the top twenty on the country charts -- the first time he'd had an album make any chart at all since 1966. Also in 1986, David Lynch used Orbison's \"In Dreams\" in his film Blue Velvet, which brought the record to a very different audience. He collaborated with k.d. lang, who was then one of the hottest new singers in country music, on a new version of his hit \"Crying\":\n\n[Excerpt: Roy Orbison and k.d. lang, \"Crying\"]\n\nThat later won a Grammy. He recorded a new album of rerecordings of his greatest hits, which made the lower reaches of the charts. He got inducted into the rock and roll hall of fame, and recorded a live TV special, A Black and White Night, where he was joined by Elvis' seventies backing band, Bruce Springsteen, Elvis Costello, k.d. lang, Bonnie Raitt, Jackson Browne and Tom Waits, among others, all just acting as backing singers and musicians for a man they admired.\n\nHe also joined with George Harrison, Jeff Lynne, Tom Petty and Bob Dylan in a supergroup called The Travelling Wilburys, whose first album made the top five:\n\n[Excerpt: The Travelling Wilburys, \"Handle With Care\"]\n\nAnd he recorded an album of new material, his best in decades, Mystery Girl, produced by Lynne and with songs written by Orbison, Lynne, and Petty -- along with a couple of songs contributed by famous admirers like Bono and the Edge of U2.\n\nBut by the time that came out, Orbison was dead -- after a day flying model aeroplanes with his sons, he had a heart attack and died, aged only fifty-two. When Mystery Girl came out a couple of months later, it rose to the top five or better almost everywhere -- and in the UK and US, he had two albums in the top five at the same time, as in the UK a hits compilation was also up there, while in the US the Wilburys album was still near the top of the charts.\n\nOrbison's is one of the saddest stories in rock music, with one of the greatest talents in history getting derailed for decades by heartbreaking tragedies unimaginable to most of us, and then dying right at the point he was finally starting to get the recognition he deserved. But the work he did, both as a songwriter and as a singer, would inspire people long after his death.",
  "enclosure": "",
  "itunes:summary": "Episode eighty-three of A History of Rock Music in Five Hundred Songs looks at \"Only the Lonely\" by Roy Orbison, and how Orbison finally found success by ignoring conventional pop song structure. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have two bonus podcasts -- part one of a two-part Q&A and a ten-minute bonus on \"Walk Don't Run\" by the Ventures.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com\n\n\n\nResources\n\nAs usual, I have put together a Mixcloud mix with every song excerpted in this podcast.\n\nI have relied for biographical information mostly on two books -- The Authorised Roy Orbison written by Jeff Slate and three of Orbison's children, and Rhapsody in Black by John Kruth.\n\nFor the musicological analysis, I referred a lot to the essay “Only the Lonely: Roy Orbison’s Sweet West Texas Style,” by Albin Zak, in Sounding Out Pop: Analytical Essays in Popular Music. \n\nThere are many Orbison collections available, but many have rerecordings rather than the original versions of his hits. The Monument Singles Collection is the originals. \n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nIt's been nearly a year since we last looked at Roy Orbison, so it's probably a good idea to quickly catch up with where we were up to. Roy Orbison had started out as a rockabilly singer, with a group called the Wink Westerners who changed their name to the Teen Kings and were signed to Sun Records. Orbison had thought that he would like to be a ballad singer, but everyone at Sun was convinced that he would never make it as anything other than a rocker. He had one minor hit on Sun, \"Ooby Dooby\", but eventually got dissatisfied with the label and asked to be allowed to go to another label -- Sam Phillips agreed to free him from his contract, in return for all the songwriting royalties and credits for everything he'd recorded for Sun.\n\nNewly free, Orbison signed to a major publisher and a major record label, recording for RCA with the same Nashville A-Team that were recording with Elvis and Brenda Lee. He had some success as a songwriter, writing \"Claudette\", which became a hit for the Everly Brothers, but he did no better recording for RCA than he had recording for Sun, and soon he was dropped by his new label, and the money from \"Claudette\" ran out. By the middle of 1959, Roy Orbison was an absolute failure.\n\nBut this episode, we're going to talk about what happened next, and the startling way in which someone who had been a failure when produced by both Sam Phillips and Chet Atkins managed to become one of the most important artists in the world on a tiny label with no track record. Today, we're going to look at \"Only the Lonely\", and the records that turned Roy Orbison into a star:\n\n[Excerpt: Roy Orbison, \"Only the Lonely\"]\n\nIt seems odd that Roy Orbison could thank Wesley Rose for introducing him to Monument Records. Rose was the co-owner of Acuff-Rose publishing, the biggest country music publishing company in the world, and the company to which Orbison had signed as a songwriter. Fred Foster, the owner of Monument, describes being called to a meeting of various Nashville music industry professionals, at which Rose asked him in front of everyone \"Why are you trying to destroy Nashville by making these...\" and then used an expletive I can't use here and a racial slur I *won't* use here, to describe the slightly R&B-infused music Foster was making.\n\nFoster was part of the new wave of Nashville record makers that also included Owen Bradley and Chet Atkins, though at this time he was far less successful than either of them. Foster had started out as a songwriter, writing the words for the McGuire Sisters' hit \"Picking Sweet",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode eighty-three of A History of Rock Music in Five Hundred Songs looks at \"Only the Lonely\" by Roy Orbison, and how Orbison finally found success by ignoring conventional pop song structure. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have two bonus podcasts -- part one of a two-part Q&A and a ten-minute bonus on \"Walk Don't Run\" by the Ventures.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com\n\n\n\nResources\n\nAs usual, I have put together a Mixcloud mix with every song excerpted in this podcast.\n\nI have relied for biographical information mostly on two books -- The Authorised Roy Orbison written by Jeff Slate and three of Orbison's children, and Rhapsody in Black by John Kruth.\n\nFor the musicological analysis, I referred a lot to t",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}