{
  "title": "The Passing of Our Friend and Colleague Bob Helms",
  "link": "https://www.aei.org/health-care/the-passing-of-our-friend-and-colleague-bob-helms/",
  "dc:creator": "Josiah Johnson",
  "pubDate": "Thu, 27 Oct 2022 22:19:34 +0000",
  "category": "Health Care",
  "guid": "https://www.aei.org/?p=1008663875",
  "description": "<p>The AEI community mourns the passing of our colleague and friend Robert B. Helms.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/health-care/the-passing-of-our-friend-and-colleague-bob-helms/\">The Passing of Our Friend and Colleague Bob Helms</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n",
  "content:encoded": "\n<p>The AEI community mourns the passing of our colleague and friend Robert B. Helms. Bob passed away on Thursday afternoon after a long fight with cancer.</p>\n\n\n\n<p>Bob became AEI’s director of health policy studies in 1974. In that role, he pioneered AEI’s research on health policy and related areas. Specifically, Bob conducted and supervised influential research on pharmaceutical economics and regulation, health care financing, hospital regulation, medical malpractice issues, and other key policy issues. Under Bob’s leadership, AEI published studies by the top experts in the field, including Mark Pauly, Patricia Danzon, Clark Havighurst, Henry Grabowski, Roger Feldman, Brian Dowd, and Gail Wilensky. Bob’s legacy at AEI also includes the many distinguished health scholars in residence who joined AEI in part thanks to Bob’s reputation and the quality and impact of his work.</p>\n\n\n\n<p>Outside AEI, Bob had a distinguished career. He took a leave of absence from AEI in 1981 to become deputy assistant secretary for planning and evaluation in the US Department of Health and Human Services (HHS). He was confirmed as the assistant secretary in 1984 and served in that position until 1989. He was executive director of the American Pharmaceutical Institute in 1989 and 1990 before returning to AEI. While an AEI scholar, Bob was named to the HHS Medicaid Commission in 2005–06, where he argued for financing reforms to put Medicaid on a more stable fiscal path.</p>\n\n\n\n<p>Although the list of Bob Helms’s accomplishments is long, it does not fully capture his contribution to health policy and to his colleagues—at AEI and elsewhere. He was a kind and gentle person and a leader in every sense of the term. He will be greatly missed.</p>\n\n\n\n<p></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/health-care/the-passing-of-our-friend-and-colleague-bob-helms/\">The Passing of Our Friend and Colleague Bob Helms</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n"
}