{
  "title": "188: The Housewife and the Hustler",
  "link": "https://audioboom.com/posts/7904042",
  "itunes:episode": 188,
  "itunes:title": "The Housewife and the Hustler",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3522,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>THIS. ONE. IS. WILD. YOU. GUYS.<br>\n<br>\n\n</div>\n<div>Let us say right up front, Patrick and Gillian have never watched an episode of The Housewives, SO THIS WAS A REAL EDUCATION….And now Patrick identifies as Housewives Curious. OK,  so Beverly Hills Housewife Erik Jane (you guys, I could watch that XXPEN$IVE video allllll dayyyyy, and if you don’t know what that is, just you wait) and her husband, legal titan Tom Girardi are in super big trouble. It seems that Griardi has been stealing huge sums of money from his clients WHICH INCLUDE PLANE CRASH AND BURN VICTIMS. Yikes, Tom. Also, Erika maybe was in on it? There’s a lot to unpack here. BUT ALSO THE HOUSEWIVES!<br>\n<br>\n<a href=\"https://thewilbur.com/artist/true-crime-obsessed/\"><strong>FAM OUR LIVE SHOW IN BOSTON IS BACK ON AND TICKETS ARE NOW ON SALE!! </strong></a>If you had tickets to the original date, they have been refunded, check your email! Our new date is Saturday, July 31st at 7pm AT THE WILBUR THEATER!!  We're covering Oxygen's \"The Disappearance of Maura Murray\" and we will be joined by Maggie Freleng (who hosted the series) and Tim and Lance from Missing Maura Murray podcast! <a href=\"https://thewilbur.com/artist/true-crime-obsessed/\"><strong>TICKETS ARE GOING FAST! GET YOURS AND COME JOIN US!</strong></a><strong><br>\n<br>\nLOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 200 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>Night Stalker</strong>\" <strong>\"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Tue, 13 Jul 2021 10:00:00 +0000",
  "guid": "tag:audioboom.com,2021-07-13:/posts/7904042",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}