{
  "title": "Ad hoc committee releases report on remote teaching best practices for on-campus education",
  "link": "https://news.mit.edu/2022/report-remote-teaching-best-practices-campus-education-1018",
  "description": "Task Force 2021 and Beyond report highlights innovative teaching practices that MIT instructors have incorporated into in-person classes, informed by remote-teaching experiences.",
  "pubDate": "Tue, 18 Oct 2022 15:55:00 -0400",
  "guid": "https://news.mit.edu/2022/report-remote-teaching-best-practices-campus-education-1018",
  "dc:creator": "Elizabeth Durant | Office of the Vice Chancellor",
  "content:encoded": "<p>The Ad Hoc Committee on Leveraging Best Practices from Remote Teaching for On-Campus Education has <a href=\"https://tll.mit.edu/wp-content/uploads/2022/08/LeveragingBestPracticesReportAug9.pdf\">released a report</a> that captures how instructors are weaving lessons learned from remote teaching into in-person classes. Despite the challenges imposed by teaching and learning remotely during the Covid-19 pandemic, the report says, “there were seeds planted then that, we hope, will bear fruit in the coming years.”</p>\n\n<p>“In the long run, one of the best things about having lived through our remote learning experience may be the intense and broad focus on pedagogy that it necessitated,” the report continues. “In a moment when nobody could just teach the way they had always done before, all of us had to go back to first principles and ask ourselves: What are our learning goals for our students? How can we best help them to achieve these goals?”</p>\n\n<p>The committee’s work is a direct response to one of the Refinement and Implementation Committees (RIC) formed as part of <a href=\"https://tf2021.mit.edu/\">Task Force 2021 and Beyond.</a> Led by co-chairs Krishna Rajagopal, the William A. M. Burden Professor of Physics, and Janet Rankin, director of the MIT Teaching + Learning Lab, the committee engaged with faculty and instructional staff, associate department heads, and undergraduate and graduate officers across MIT.</p>\n\n<p>The findings are distilled into four broad themes:</p>\n\n<ol>\n\t<li><strong>Community, Well-being, and Belonging</strong>. Conversations revealed new ways that instructors cultivated these key interrelated concepts, all of which are fundamental to student learning and success. Many instructors focused more on supporting well-being and building community and belonging during the height of the pandemic precisely because the MIT community, and everyone in it, was under such great stress. Some of the resulting practices are continuing, the committee found. Examples include introducing simple gestures, such as start-of-class welcoming practices, and providing extensions and greater flexibility on student assignments. Also, many across MIT felt that the week-long Thanksgiving break offered in 2020 should become a permanent fixture in the academic calendar, because it enhances the well-being of both students and instructors at a time in the fall semester when everyone’s batteries need recharging.<br />\n\t&nbsp;</li>\n\t<li><strong>Enhancing Engagement</strong>. The committee found a variety of practices that have enhanced engagement between students and instructors; among students; and among instructors. For example, many instructors have continued to offer some office hours on Zoom, which seems to reduce barriers to participation for many students, while offering in-person office hours for those who want to take advantage of opportunities for more open-ended conversations. Several departments increased their usage of undergraduate teaching assistants (UTAs) in ways that make students’ learning experience more engaging and give the UTAs a real teaching experience. In addition, many instructors are leveraging out-of-class communication spaces like Slack, Perusall, and Piazza so students can work together, ask questions, and share ideas.<br />\n\t&nbsp;</li>\n\t<li><strong>Enriching and Augmenting the Learning Environment</strong>. The report presents two ways in which instructors have enhanced learning within the classroom: through blended learning and by incorporating authentic experiences. Although blended learning techniques are not new at MIT, after having made it through remote teaching many faculty have found new ways to combine synchronous in-person teaching with asynchronous activities for on-campus students, such as pre-class or pre-lab sequences of videos with exercises interspersed, take-home lab kits, auto-graded online problems that give students immediate feedback, and recorded lab experiences for subsequent review. In addition, instructors found many creative ways to make students’ learning more authentic by going on virtual field trips, using Zoom to bring experts from around the world into MIT classrooms or to enable interactions with students at other universities, and live-streaming experiments that students could not otherwise experience since they cannot be performed in a teaching lab.&nbsp;&nbsp;<br />\n\t&nbsp;</li>\n\t<li>&nbsp;<strong>Assessing Learning</strong>. For all its challenges, the report notes, remote teaching prompted instructors to take a step back and think about what they wanted students to learn, how to support it, and how to measure it. The committee found a variety of examples of alternatives to traditional assessments, such as papers or timed, written exams, that instructors tried during the pandemic and are continuing to use. These alternatives include shorter, more frequent, lower-stakes assessments; oral exams or debates; asynchronous, open-book/notes exams; virtual poster sessions; alternate grading schemes; and uploading paper psets and exams into Gradescope to use its logistics and rubrics to improve grading effectiveness and efficiency.</li>\n</ol>\n\n<p>A large portion of the report is devoted to an extensive, annotated list of best practices from remote instruction that are being used in the classroom. Interestingly, Rankin says, “so many of the strategies and practices developed and used during the pandemic are based on, and supported by, solid educational research.”</p>\n\n<p>The report concludes with one broad recommendation: that all faculty and instructors read the findings and experiment with some of the best practices in their own instruction. “Our hope is that the practices shared in the report will continue to be adopted, adapted, and expanded by members of the teaching community at MIT, and that instructors’ openness in sharing and learning from each will continue,” Rankin says.</p>\n\n<p>Two additional, specific recommendations are included in the report. First, the committee endorses the RIC 16 recommendation that a Classroom Advisory Board be created to provide strategic input grounded in evolving pedagogy about future classroom use and technology needs. In its conversations, the committee found a number of ways that remote teaching and learning have impacted students’ and instructors’ perceptions as they have returned to the classroom. For example, during the pandemic students benefited from being able to see everyone else’s faces on Zoom. As a result, some instructors would prefer classrooms that enable students to face each other, such as semi-circular classrooms instead of rectangular ones.</p>\n\n<p>More generally, the committee concluded, MIT needs classrooms with seats and tables that can be quickly and flexibly reconfigured to facilitate varying pedagogical objectives. The Classroom Advisory Board could also examine classroom technology; this includes the role of videoconferencing to create authentic engagement between MIT students and people far from campus, and blended learning that allows students to experience more of the in-classroom engagement with their peers and instructors from which the “magic of MIT” originates.</p>\n\n<p>Second, the committee recommends that an implementation group be formed to investigate the possibility of changing the MIT academic calendar to create a one-week break over Thanksgiving. “Finalizing an implementation plan will require careful consideration of various significant logistical challenges,” the report says. “However, the resulting gains to both well-being and learning from this change to the fall calendar make doing so worthwhile.”</p>\n\n<p>Rankin notes that the report findings dovetail with the recently released <a href=\"https://actionplan.mit.edu/\">MIT Strategic Action Plan for Belonging, Achievement and Composition</a>. “I believe that one of the most important things that became really apparent during remote teaching was that community, inclusion, and belonging really matter and are necessary for both learning and teaching, and that instructors can and should play a central role in creating structures and processes to support them in their classrooms and other learning environments,” she says.</p>\n\n<p>Rajagopal finds it inspiring that “during a time of intense stress — that nobody ever wants to relive — there was such an intense focus on how we teach and how our students learn that, today, in essentially every direction we look we see colleagues improving on-campus education for tomorrow. I hope that the report will help instructors across the Institute, and perhaps elsewhere, learn from each other. Its readers will see, as our committee did, new ways in which students and instructors are finding those moments, those interactions, where the magic of MIT is created.”</p>\n\n<p>In addition to the report, the co-chairs recommend two other valuable remote teaching resources: a video interview series, <a href=\"https://tll.mit.edu/teaching-resources/lessons-learned-from-remote-teaching/fresh-perspectives/\">TLL’s Fresh Perspectives</a>, and Open Learning’s <a href=\"https://openlearning.mit.edu/mit-faculty/residential-digital-innovations?f%5B0%5D=digital_innovations_tools%3A140\">collection of examples</a> of how MIT faculty and instructors leveraged digital technology to support and transform teaching and learning during the heart of the pandemic.</p>",
  "media:content": {
    "media:description": "“Our hope is that the practices shared in the report will continue to be adopted, adapted, and expanded by members of the teaching community at MIT, and that instructors’ openness in sharing and learning from each will continue,” says Janet Rankin, director of the Teaching + Learning Lab and committee co-chair for a report on remote teaching best practices for on-campus education.",
    "media:credit": "Photo: Jake Belcher"
  },
  "category": [
    "School of Architecture and Planning",
    "School of Engineering",
    "School of Humanities Arts and Social Sciences",
    "School of Science",
    "MIT Sloan School of Management",
    "MIT Schwarzman College of Computing",
    "Office of Open Learning",
    "Online learning",
    "Education, teaching, academics",
    "Pandemic",
    "Community",
    "Data",
    "Research"
  ]
}