{
  "title": "COVID Smear Artists Want “Amnesty” For Their Lies",
  "itunes:title": "COVID Smear Artists Want “Amnesty” For Their Lies",
  "pubDate": "Fri, 04 Nov 2022 05:30:00 +0000",
  "guid": "25dd9642-4e42-4bf6-9c92-9298458157d7",
  "link": "https://thejimmydoreshow.libsyn.com/covid-smear-artists-want-amnesty-for-their-lies",
  "itunes:image": "",
  "description": "<p>Writing in The Atlantic, economist Emily Oster announced that it’s time for the COVID wars to end, and for aggrieved parties who may or may not have been “right” in challenging the dominant narrative about vaccines, masks, transmission and related topics to give their antagonists a pass so that we can all move on together. But is that how it works – thousands lose their jobs, while countless more are demonized on a grand scale and everyone’s supposed to just take a mulligan?</p> <p>Jimmy and Americans’ Comedian Kurt Metzger discuss the importance of expressions of contrition if there is to be any “amnesty” for the likes of Noam Chomsky, Piers Morgan and Jimmy Kimmel who did everything they could to smear COVID narrative skeptics.<br /> <br /> Plus a segment on President Obama getting heckled at a campaign rally over Democrats' support for the march to nuclear war over Ukraine.</p> <p>Also featuring Stef Zamorano, Kurt Metzger and Mike MacRae! And phone calls from Alec Baldwin and Benjamin Netanyahu!</p>",
  "content:encoded": "<p>Writing in The Atlantic, economist Emily Oster announced that it’s time for the COVID wars to end, and for aggrieved parties who may or may not have been “right” in challenging the dominant narrative about vaccines, masks, transmission and related topics to give their antagonists a pass so that we can all move on together. But is that how it works – thousands lose their jobs, while countless more are demonized on a grand scale and everyone’s supposed to just take a mulligan?</p> <p>Jimmy and Americans’ Comedian Kurt Metzger discuss the importance of expressions of contrition if there is to be any “amnesty” for the likes of Noam Chomsky, Piers Morgan and Jimmy Kimmel who did everything they could to smear COVID narrative skeptics.  Plus a segment on President Obama getting heckled at a campaign rally over Democrats' support for the march to nuclear war over Ukraine.</p> <p>Also featuring Stef Zamorano, Kurt Metzger and Mike MacRae! And phone calls from Alec Baldwin and Benjamin Netanyahu!</p>",
  "enclosure": "",
  "itunes:duration": "01:01:54",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Writing in The Atlantic, economist Emily Oster announced that it’s time for the COVID wars to end, and for aggrieved parties who may or may not have been “right” in challenging the dominant narrative about vaccines, masks, transmission and...",
  "itunes:episodeType": "full",
  "itunes:summary": "Writing in The Atlantic, economist Emily Oster announced that it’s time for the COVID wars to end, and for aggrieved parties who may or may not have been “right” in challenging the dominant narrative about vaccines, masks, transmission and related topics to give their antagonists a pass so that we can all move on together. But is that how it works – thousands lose their jobs, while countless more are demonized on a grand scale and everyone’s supposed to just take a mulligan? Jimmy and Americans’ Comedian Kurt Metzger discuss the importance of expressions of contrition if there is to be any “amnesty” for the likes of Noam Chomsky, Piers Morgan and Jimmy Kimmel who did everything they could to smear COVID narrative skeptics. Plus a segment on President Obama getting heckled at a campaign rally over Democrats' support for the march to nuclear war over Ukraine. Also featuring Stef Zamorano, Kurt Metzger and Mike MacRae! And phone calls from Alec Baldwin and Benjamin Netanyahu!"
}