{
  "id": "tag:blogger.com,1999:blog-6894866515532737257.post-2255195785381607527",
  "published": "2017-04-04T06:26:00.001-07:00",
  "updated": "2017-04-04T06:38:08.917-07:00",
  "title": "Honey, money, weather, terror",
  "content": "In my Data Science class this semester, students are working on a series of reports where they explore a freely-available dataset, use data to answer questions, and present their findings. &nbsp;After each batch of reports, I will publish the abstracts here; you can follow the links below to see what they found.<br /><br /><br /><h3 id=\"the-impact-of-military-status-on-income-bracket\">The Impact of Military Status on Income Bracket</h3>Joey Maalouf<br /><br />Using the&nbsp;<a href=\"https://www.cdc.gov/nchs/nhis/nhis_2015_data_release.htm\">National Health Interview Survey</a>&nbsp;data, I was able to look for a potential link between military status and financial status. More specifically, I wanted to check if whether someone served in the United States military affects their current income bracket. It was apparent that people who served in the military were underrepresented in low income brackets and overrepresented in high income brackets compared to the rest of the population. This difference appears more clearly if we group the income data into even broader brackets for further analysis; being in the military increased one's chances of being in the upper half of respondents by 16.06 percentage points, and of being in the upper third by 14.64 percentage points. Further statistical analysis reported a Cohen effect size of 0.32, which is above the standard threshold to be considered more than a small effect.<br /><a href=\"https://github.com/joeylmaalouf/NHIS-analysis/blob/master/report/report2.md\">Report</a><br /><br /><h3 id=\"most-terrorism-is-local\">Getting Treatment</h3>Kaitlyn Keil<br /><br />In the so-called \"War on Drugs\", one of the primary tactics is teaching children to \"Just Say No!\" However, less attention is paid to treatment for those who are already addicted. Except for the occasional comment on how a celebrity disappeared off to rehab, there is a silence in our culture about the apparently shameful act of getting treatment. This silence made me begin to wonder: how many people who struggle with addictions actually get treated, and how long does it take before they receive this help? Using the National Survey on Drug Use and Health data from 2014, I found that very few people who use drugs report getting treatment or counseling, and the length of time they go without getting treatment isn't particularly correlated with other factors.<br /><a href=\"https://github.com/KaitlynKeil/ThinkStats2/blob/master/code/reports/report2.md\">Report</a><br /><br /><h3 id=\"whats-the-chance-you-will-die-to-terrorism\">What's the Chance You will Die Due to Terrorism?</h3>Kevin Zhang<br /><br />With Trump's recent travel ban and the escalation of controversial actions against Middle Eastern people, there has been a rise of paranoia towards the Middle East region for fear of the possibility of a terrorist attack. But is there is a reason to be so afraid of the Middle East, or even terrorism in general? What is the chance that an American would be a victim to terrorism? This article looks into just how likely the average person in the US will be affected by a terrorist attack, should one happen. Results show that the chance of a person being affected by terrorism in the North American region is almost 0, especially when compared to the probability in the Middle East itself. The data suggests that people's fears are unfounded and that the controversial reactions towards Middle East citizens because of a 1 in 15 million chance are irrational.<br /><a href=\"https://github.com/kzhang8850/ThinkStats2/blob/master/reports/report2blog.md\">Report</a><br /><br /><h3 id=\"is-there-a-seasonality-in-number-of-likes-for-social-media-posts\">Is There a Seasonality in the Response to Social Media Posts?</h3>Sungwoo Park<br /><br />Using a dataset containing over 4 million Facebook posts from 15 mainstream news outlets, I investigate the existence of seasonality in the number of likes a Facebook post from a news outlet gets. The dataset contains contents and attributes, such as number of likes and timestamp, of all facebook posts posted by the top media sources from 2012 to 2016. The media outlets included in the data are ABC, BBC, CBS, CNN, Fox &amp; Friends, Fox, LA Times, NBC, NPR, The Huffington Post, The New York Times, The Wall Street Journal, The Washington Post, Time, and USA Today.<br /><a href=\"https://github.com/SungwooPark/ThinkStats2/blob/master/reports/report2.md\">Report</a><br /><br /><h3>The Association Between Drug Usage and Depression</h3>David Papp and Willem Thorbecke<br /><br />The goal of this article is to explore the association between drug usage and depression. Intuitively, many would argue that those who use drugs are more likely to be depressed. To explore this relationship, we took data from the National Drug Usage and Health Survey from 2014. We conducted logistical regression on cocaine, marijuana, alcohol, and heroin while controlling for possible confounding variables such as sex, income, and health conditions. Surprisingly, there appears to be a negative correlation between drug usage and depression.<br /><a href=\"https://github.com/willythor/ThinkStats2/blob/master/reports/report2.md\">Report</a>  <br /><br /><h3 id=\"us-apiculture-and-honey-production\">US Apiculture and Honey Production</h3>Matthew Ruehle and Sean Carter<br /><br />We examine the historic honey-producing bee colony counts, yield, and honey production of states as <a href=\"https://www.nass.usda.gov/Surveys/Guide_to_NASS_Surveys/Bee_and_Honey/\">collected by the USDA</a>, finding statistical evidence for regional \"clustering\" of production and a negative correlation between per-hive yield and overall price, most strongly reflected in states with the greatest absolute production<br /><a href=\"https://github.com/matthewruehle/DataScienceApiculture/blob/master/reports/report2.md\">Report</a><br /><br /><h3 id=\"most-terrorism-is-local\">Most Terrorism is Local</h3>Radmer van der Heyde<br /><br /><div style=\"font-size: medium; font-weight: normal;\">I explored the Global Terrorism Database to see how terror has evolved over time, and whether international terrorism has any defining features. Over time terrorism has increased and gotten deadlier, but shifted regions. However, international terrorism was too small a percentage of the dataset to reach an appropriate conclusion.</div><div style=\"font-size: medium; font-weight: normal;\"><a href=\"https://github.com/rvanderheyde/ThinkStats2/blob/master/reports/report2.md\">Report</a><br /><br /></div><h3 id=\"does-it-get-warmer-before-it-rains\">Does it get warmer before it rains?</h3> <div style=\"font-size: medium; font-weight: normal;\">Apurva Raman and William Lu</div><div style=\"font-size: medium; font-weight: normal;\"><br /></div><div style=\"font-size: medium; font-weight: normal;\">Speculating about the weather has been a staple of small talk and human curiosity for a long time, and as a result, many weather \"myths\" exist. One such myth we’ve heard is that it gets warmer before a precipitation event (e.g. rain, snow, hail, sleet, etc.) occurs. Using data from the US National Oceanic and Atmospheric Association (NOAA), we find that change in temperature is a poor indicator for whether or not there will be a precipitation event.</div><div style=\"font-size: medium; font-weight: normal;\"><a href=\"https://github.com/williamalu/data_science_weather/blob/master/report2.md\">Report</a></div><div><br /></div><br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Allen Downey",
    "uri": "http://www.blogger.com/profile/01633071333405221858",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}