{
  "title": "Disarming Human Defenses, a Series with Ann &#038; Sue: Session 1 of 5 (183)",
  "link": "https://therapistuncensored.com/episodes/disarming-human-defenses-with-ann-sue-183/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=disarming-human-defenses-with-ann-sue-183",
  "pubDate": "Tue, 30 Aug 2022 00:05:04 +0000",
  "guid": "https://therapistuncensored.com/?p=13374",
  "description": "Ann and Sue get into the nitty gritty of exploring normal human defenses.  Using the full body of work from translated relational neuroscience, modern attachment and depth psychology they break down their professional and personal experience moving from armor back to more connected relationality. Shownotes at www.therapistuncensored.com/183 and more episodes at www.therapistuncensored.com/episodes.",
  "content:encoded": "<h1>Ann and Sue get into the nitty gritty by bringing you a short series of conversations on the uncomfortable truth about normal human defenses.</h1>\n<p>Whether you&#8217;re receiving hard professional feedback or facing a challenging discussion in your relationship &#8211; nobody enjoys those cringy feelings of being told something you don&#8217;t know or agree with about yourself.  Often these moments trigger an automatic neurobiological protection response in the cells dedicated to protecting us from threat.  No human doesn&#8217;t have this problem at the most fundamental level &#8211; so this series will break it down for exploration.</p>\n<p>This is the first episode in a five-part series where Ann and Sue take a deep dive into various kinds of frequently used defenses. They discuss how to become more conscious of which state of mind you may be in &#8211; protective circuits or connection circuits and how to sort out what to do if in the armored range.</p>\n<p>The 3 R spiral of change is a process that can help you reconnect and reground yourself in moments of stress. Identifying the ways you display this discomfort is a great first step in creating that shift from our automatic default responses to a more connected state where we can be present within ourselves and our relationships.</p>\n<h3>We all get defensive</h3>\n<blockquote><p><img loading=\"lazy\" class=\"size-medium wp-image-13647 alignleft\" src=\"https://therapistuncensored.com/wp-content/uploads/2022/06/pexels-kelvin-valerio-810775-300x200.jpg\" alt=\"\" width=\"300\" height=\"200\" /></p>\n<h2>&#8220;Nobody&#8217;s died from a feeling. You&#8217;re going to have them &#8211; maybe you&#8217;ll feel embarrassed or ashamed, or unfairly done to.. but the feeling itself is only 90 seconds, after that it&#8217;s all story. Feelings are going to have a beginning and a middle and an end, so just ride them out and they will change, morph, eventually subside. You don&#8217;t have to &#8216;do&#8217; anything. It&#8217;ll pass. You are gonna be okay.'&#8221; &#8211; Sue Marriott</h2>\n</blockquote>\n<h3></h3>\n<h3><em><strong>Time Stamps </strong></em></h3>\n<p>2:52 &#8211; Three R spiral of change  &#8211; recognition, reflection, rewiring</p>\n<p>9:46 &#8211; The last R: &#8220;Rewiring&#8221;</p>\n<p>18:42 &#8211; The first stage of self-awareness, waking up and stopping our projections</p>\n<p>26:54 &#8211; One of the key ingredients to self-awareness</p>\n<p>28:53 &#8211; The difference between self-care and stubbornness</p>\n<p>30:54 &#8211; Different types of self-awareness</p>\n<p>36:00 &#8211; &#8220;Don&#8217;t do this&#8221; when receiving feedback</p>\n<p>40:08 &#8211; Tips and recommendations for mindfulness</p>\n<h3><span style=\"color: #3366ff;\"><strong>CLICK HERE for <a href=\"https://therapistuncensored.com/wp-content/uploads/2022/06/Defense-Series-Episode-1_-Transcripts.pdf\">Defense Series &#8211; Part 1 Transcript</a> &#8211;</strong></span> Episode 183  &#8211; Lightly edited for readability</h3>\n<p><a href=\"https://therapistuncensored.com/join-our-neuronerd-community/\"><img loading=\"lazy\" class=\"size-medium wp-image-12583 alignleft\" src=\"https://therapistuncensored.com/wp-content/uploads/2023/01/reallygreatsite.com_-300x150.png\" alt=\"\" width=\"300\" height=\"150\" /></a><span style=\"color: #000000;\">We have pledged 50% of all corporate profits & <strong><span style=\"color: #3366ff;\"><a style=\"color: #3366ff;\" href=\"https://www.teepublic.com/stores/therapist-uncensored/crewneck-sweatshirt?utm_campaign=26430&utm_medium=affiliate&utm_source=Therapist%2BUncensored%2B\">merch sales (very fun swag!)</a> </span></strong>to organizations that support mental health access to those traditionally left out of mainstream healthcare.  We can only do that with the help of our Neuronerd private community. </span></p>\n<p><span style=\"color: #000000;\">By joining as a Neuronerd premium subscriber, you get</span> a dedicated ad-free feed, deeper dives into select content and first shot at very unique study opportunities. If we&#8217;ve provided value then please <span style=\"color: #000000;\">check us out, poke around, make sure you feel comfortable and then </span><strong><span style=\"color: #000000;\"><span style=\"color: #3366ff;\"><a style=\"color: #3366ff;\" href=\"http://therapistuncensored.com/join\">join us today</a></span>!</span></strong></p>\n<p>&nbsp;</p>\n<h3><span style=\"color: #339966;\"><strong>Sponsors who help make these episodes free and available to all &#8211; check them out to support the show! </strong></span></h3>\n<p>Z<a href=\"http://zocdoc.com/tu\"><img loading=\"lazy\" class=\" wp-image-13688 alignleft\" src=\"https://therapistuncensored.com/wp-content/uploads/2022/06/zoc-doc-logo--300x153.png\" alt=\"\" width=\"196\" height=\"100\" /></a>ocdoc can help you find therapists and psychiatrists and doctors of all sorts and flavors that your family may need that are close to you, taking new patients, and even taking your insurance. Find the doctor that is <i>right for you, </i>and book an appointment, in person or remotely, that works <i>f</i>or your schedule. Go to <strong><a href=\"http://Zocdoc.com/TU\"><span class=\"s1\">Zocdoc.com/TU</span></a> </strong>and download the Zocdoc app for FREE. No more excuses not to take care of yourself &#8211; check it out and book now, many providers are available within 24 hours.</p>\n<p><a href=\"http://shopbeam.com/tu\"><img loading=\"lazy\" class=\"wp-image-13686 alignright\" src=\"https://therapistuncensored.com/wp-content/uploads/2022/06/beam-sleep-powder-300x300.webp\" alt=\"\" width=\"128\" height=\"128\" /></a>Good sleep is related to so many good health and mental health outcomes, but we don&#8217; tall have it easy when we try to fall asleep or stay asleep.  Nighttime rituals are important, try a cup of hot cocoa before bed that tastes good and is full of wellness ingredients that will help you sleep.  Beam includes 3rd party tested hemp free of THC, l-theanine, melatonin and natural adaptogens to help your immunity.</p>\n<p><strong>Get up to 40% off when you go to <a href=\"http://shopbeam.com/tu\">shopbeam.com/TU</a> and use code TU at checkout. </strong></p>\n<h3>We hope you enjoy this content, if so please do leave us a rating wherever you get your podcasts so others may discover it as well.  Tk you for stopping by!</h3>\n<p class=\"p1\">\n",
  "enclosure": "",
  "itunes:subtitle": "How good are you at recognizing your own defensive posturing?  You are probably over-estimating yourself.",
  "itunes:summary": "In this first session in a series of 5, Ann and Sue discuss the 3R spiral of chance and get into the nitty gritty of exploring normal human defenses to help you identify and disarm unncessesary armor.  Using the full body of work from translated relational neuroscience, modern attachment and depth psychology they break down their professional and personal experience moving from armor back to more connected relationality. Show notes at www.therapistuncensored.com/183 and more episodes at www.therapistuncensored.com/episodes.  Share this free resource freely!",
  "itunes:author": "Sue Marriott LCSW, CGP, Ann Kelley PhD",
  "itunes:image": "",
  "itunes:season": 7,
  "itunes:episode": 183,
  "itunes:title": "Disarming Human Defenses with Ann & Sue: Session I of 5 (183)",
  "itunes:duration": "45:28"
}