{
  "title": "Government Officials Need To Ban TikTok From Operating in the U.S.",
  "link": "https://www.heritage.org/homeland-security/commentary/government-officials-need-ban-tiktok-operating-the-us",
  "description": "<p>At an Oct. 24 press conference on “significant national security cases,” Attorney General Merrick Garland announced several developments involving Chinese Communist Party espionage on U.S. soil. Noticeably absent was any mention of TikTok, China’s most valuable spying tool, which is used every day against American citizens.</p>\n\n<p>Since its inception, Beijing has used TikTok to steal personal information about its users and influence the direction of our country. The app’s “surreptitious data practices” include the mass collection of browsing histories, keystroke patterns, biometric identifiers, draft messages, and metadata as well as the text, images, and videos that are on a device’s clipboard.</p>\n\n<p>Capitalizing on the paralysis of U.S. regulators, ByteDance has used its ever-expanding social media reach to access critical information, posing a direct threat to our national security. The initial delay to ban TikTok from the devices of U.S. service members jeopardized troop movements and the data of our military men and women. While the application is now banned from the devices of military personnel, many Americans are still being targeted.</p>\n\n<p>Just last week, documents obtained by Forbes revealed that ByteDance intended to “use the TikTok app to monitor the personal location of some specific American citizens.” In other words, ByteDance plans to have their employees track the location of “high value” American citizens from their desks in China.</p>\n\n<p><strong>>>> <a href=\"https://www.heritage.org/technology/commentary/biden-directive-mitigating-threats-tiktok-other-foreign-owned-apps\">Biden Directive on Mitigating Threats From TikTok, Other Foreign-Owned Apps Is Insufficient</a></strong></p>\n\n<p>TikTok is much more than a social media hosting site. It’s a powerful surveillance tool for the CCP. Since President Donald Trump’s unsuccessful effort to ban TikTok, the app has further entrenched itself in our lives, and its parent company, ByteDance, has expanded its surveillance capabilities. It’s time for lawmakers to end their aimless debate on how to regulate this state-sponsored spying operation and do what they should have done years ago: Ban TikTok from operating in the United States.</p>\n\n<p>This alarming new development comes as TikTok’s lobbyists and communications consultants pitch their latest PR stunt, “Project Texas,” to lawmakers in an effort to avoid regulatory action. After years of privacy experts sounding the alarm that TikTok poses a serious threat to the U.S., one would hope our elected officials would be wise enough not to trust the company’s promises. Unfortunately, mere weeks after a report revealed that TikTok has been “keylogging” its users—meaning that the company has been tracking and storing “passwords, credit card information and other sensitive user data,” the Biden administration entered a preliminary security deal to allow the app to continue operating in the U.S.</p>\n\n<p>Since 2019, and after countless reports that have outlined the growing security threats we face from TikTok, only Mr. Trump has been willing to take on this CCP operation. As the current administration takes a victory lap over its recent arrests of 13 Chinese nationals on charges ranging from espionage to recruitment, Americans should not forgive their failure to act against TikTok. Instead of standing up to China, the Biden administration has negotiated a sweetheart deal that allows TikTok the maneuverability needed to avoid further regulation while continuing to spy on Americans.</p>\n\n<p><strong>>>> <a href=\"https://www.heritage.org/asia/report/responding-the-china-challenge-blueprint-20\">Responding to the China Challenge: Blueprint 2.0</a></strong></p>\n\n<p>During a recent visit to Australia, Sen. Mark Warner, the Virginia Democrat who chairs the Senate Intelligence Committee, acknowledged that “Donald Trump was right on TikTok years ago.” Mr. Warner went on to say, “If your country uses Huawei, if your kids are on TikTok, if your population uses WeChat as a social media platform, the ability for China to have undue influence is, I think, a much greater challenge and a much more immediate threat than any kind of actual, armed conflict.”</p>\n\n<p>The senator also noted that the Pentagon has ordered service members not to have the app downloaded to their devices. This raises the question: If TikTok isn’t safe for members of the armed forces, why is it safe for the rest of us?</p>\n\n<p>Instead of calling for more investigations, waiting for more leaks from ByteDance, or debating a so-called security deal that lets TikTok continue to shovel data back to Beijing, Congress must act to end this threat to our privacy and our national security. Lawmakers should disregard the press releases from TikTok, decline to take calls from their lobbyists, and ban this company from operating in the United States.</p>",
  "pubDate": "Thu, 03 Nov 2022 09:48:16 -0400",
  "dc:creator": "Jake Denton",
  "guid": "https://www.heritage.org/homeland-security/commentary/government-officials-need-ban-tiktok-operating-the-us"
}