{
  "title": "The Edition: The Covid revolts",
  "link": "https://audioboom.com/posts/7986322",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1956,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s episode: Just who is protesting new Covid rules in Europe? </div>\n<div><br>\n</div>\n<div>In The Spectator this week we have three articles that cover the riots and protests all over Europe about new covid policies. Two of them report the scene on the ground in different countries. Lionel Barber and Nick Farrell write respectively about the situations in Holland and Italy and talk on the podcast about why this is happening now and how much more it could escalate. (00:45)<br>\n<br>\n\n</div>\n<div><br>\n</div>\n<div>Also this week: Is China having its own hand and the #MeToo moment?</div>\n<div><br>\n</div>\n<div>A spotlight has been shined on China in recent days, due to the troubling series of events surrounding the Chinese tennis player Peng Shuai. Who after making claims of being pressured into a sexual relationship with a CCP official, disappeared for days, as all mentions of her claims were wiped from social media. Cindy Yu writes about this story in this week’s Spectator and talks on the podcast about the history of China’s mistress culture. (14:17)</div>\n<div>  </div>\n<div><br>\n</div>\n<div>And finally: What does it take to be a Hamleys elf? </div>\n<div><br>\n</div>\n<div>Christmas is coming and if there are children in your life begging for this season's hottest toy, you might find yourself at Hamleys, the world’s oldest toys store, and as you enter you may well be greeted by a festive elf. But what’s it like being one of these red and green-clad friends of Father Christmas? Our podcast producer Sam Holmes writes in The Spectator this week about his experience as an elf when he was 19. Sam is joined on the podcast by Mark Campbell, the current Lego man at Hamleys and Sam’s old boss from his elf days. (21:00)</div>\n<div><br>\n</div>\n<div><br>\n</div>\n<div>Hosted by Lara Prendergast</div>\n<div><br>\n</div>\n<div>Produced by Sam Holmes</div>\n<div><br>\n</div>\n<div><br>\n</div>\n<div>Subscribe to <em>The Spectator </em>today and get a £20 Amazon gift voucher:</div>\n<div>\n<a href=\"http://www.spectator.co.uk/voucher\">www.spectator.co.uk/voucher</a> </div>\n<div><br>\n</div>\n<div>Listen to Lara’s food-based interview show, <em>Table Talk</em>:</div>\n<div>\n<a href=\"https://www.spectator.co.uk/tabletalk\">https://www.spectator.co.uk/tabletalk</a> </div>\n",
  "pubDate": "Thu, 25 Nov 2021 16:34:00 +0000",
  "guid": "tag:audioboom.com,2021-11-25:/posts/7986322",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}