{
  "title": "37: Robert Moss- Bringing More Magic and Play to Everyday Life",
  "pubDate": "Thu, 19 Nov 2015 19:09:50 +0000",
  "guid": "579d5a02fc097200174ac94fc75cdc0b",
  "link": "https://lifeonpurpose.libsyn.com/37-robert-moss-bringing-more-magic-and-play-to-everyday-life",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #37</strong>, my guest is bestselling author and world-renowned \"dream explorer\" <strong>Robert Moss</strong>.</p>\n<p><strong>Robert</strong> joins me for a fascinating and lively conversation in which we discuss fun ways to bring more magic and play to your life; his new book <em><strong>Sidewalk Oracles: Playing with Signs, Symbols, and Synchronicity in Everyday Life</strong></em>; living with a sense of a larger purpose and story; becoming a kairomancer, and much more!</p>\n<p>About: <strong>Robert Moss</strong> is the author of Sidewalk Oracles and numerous other books about dreaming, shamanism, and imagination. He is a novelist, poet, and independent scholar, and the creator of <strong>Active Dreaming</strong>, an original synthesis of dreamwork and shamanism. He leads creative and shamanic adventures all over the world.</p>\n<p>About <em><strong>Sidewalk Oracles: Playing with Signs, Symbols, and Synchronicity in Everyday Life</strong></em>: Synchronicity is when the universe gets personal. Through this book of games and enchanting stories, you’ll learn how to monitor the play of coincidence and the symbolic resonance of incidents in daily life in order to tap into the deeper logic of events, receive extraordinary counsel, and have wonderful fun.</p>\n<p>You will be invited to become a <strong>kairomancer</strong>: someone who is poised to catch the messages in special moments when synchronicity is in play — and to take action to seize the opportunities those moments present. To be a kairomancer, you need to trust your feelings as you walk the roads of this world, to develop your personal science of shivers, and to recognize in your gut and your skin that you know far more than you hold on the surface of consciousness.</p>\n<p>This is a way of real magic, which is the art of bringing gifts from a deeper world into this one. Follow it, and you will put a champagne fizz of enchantment into your everyday life.</p>\n<p>To learn more about <strong>Robert</strong> and his work: <a href=\"http://www.mossdreams.com\" target=\"_blank\">http://www.mossdreams.com</a>.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #37, my guest is bestselling author and world-renowned \"dream explorer\" Robert Moss.</p>\n<p>Robert joins me for a fascinating and lively conversation in which we discuss fun ways to bring more magic and play to your life; his new book <em>Sidewalk Oracles: Playing with Signs, Symbols, and Synchronicity in Everyday Life</em>; living with a sense of a larger purpose and story; becoming a kairomancer, and much more!</p>\n<p>About: Robert Moss is the author of Sidewalk Oracles and numerous other books about dreaming, shamanism, and imagination. He is a novelist, poet, and independent scholar, and the creator of Active Dreaming, an original synthesis of dreamwork and shamanism. He leads creative and shamanic adventures all over the world.</p>\n<p>About <em>Sidewalk Oracles: Playing with Signs, Symbols, and Synchronicity in Everyday Life</em>: Synchronicity is when the universe gets personal. Through this book of games and enchanting stories, you’ll learn how to monitor the play of coincidence and the symbolic resonance of incidents in daily life in order to tap into the deeper logic of events, receive extraordinary counsel, and have wonderful fun.</p>\n<p>You will be invited to become a kairomancer: someone who is poised to catch the messages in special moments when synchronicity is in play — and to take action to seize the opportunities those moments present. To be a kairomancer, you need to trust your feelings as you walk the roads of this world, to develop your personal science of shivers, and to recognize in your gut and your skin that you know far more than you hold on the surface of consciousness.</p>\n<p>This is a way of real magic, which is the art of bringing gifts from a deeper world into this one. Follow it, and you will put a champagne fizz of enchantment into your everyday life.</p>\n<p>To learn more about Robert and his work: <a href=\"http://www.mossdreams.com\" target=\"_blank\">http://www.mossdreams.com</a>.</p>",
  "enclosure": "",
  "itunes:duration": "51:36",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #37, my guest is bestselling author and world-renowned \"dream explorer\" Robert Moss.\nRobert joins me for a fascinating and lively conversation in which we discuss fun ways to bring more magic and play to your life; his new..."
}