{
  "title": "Professor Emeritus Louis Braida, speech and hearing scientist and hearing aid innovator, dies at 79",
  "link": "https://news.mit.edu/2022/louis-braida-hearing-aid-innovator-dies-1104",
  "description": "Valued mentor was known for research in intensity perception, hearing-impairment characterization, and aids for the deaf.",
  "pubDate": "Fri, 04 Nov 2022 12:45:00 -0400",
  "guid": "https://news.mit.edu/2022/louis-braida-hearing-aid-innovator-dies-1104",
  "dc:creator": "Jane Halpern | Department of Electrical Engineering and Computer Science",
  "content:encoded": "<p>Louis Braida, the Henry Ellis Warren (1894) Professor Emeritus in the MIT Department of Electrical Engineering and Computer Science (EECS), died Sept. 2. He was 79.</p>\n\n<p>Braida was a principal researcher in the Research Laboratory of Electronics, and a faculty member in the Harvard-MIT Program in Health Sciences and Technology (HST), which is housed in the Institute for Medical Engineering and Science (IMES) at MIT.</p>\n\n<p>Born in the Bronx to Louis Braida and Elvina Tonelli Braida, Braida received a BEE from The Cooper Union in 1964, and an SM and PhD in electrical engineering from MIT in 1965 and 1969, respectively. During the course of his career at MIT, he was for many years the director of the Speech and Hearing Sciences training program within HST.</p>\n\n<p>Braida was internationally known for his research in the areas of intensity perception, the characterization of hearing impairments, and aids for the deaf. Using modern communication theory and computational techniques, he worked to develop improved hearing aids for people suffering from sensorineural hearing impairments, and cochlear implants for the deaf, addressing many of the field’s knottiest problems in the pursuit of improved performance.</p>\n\n<p>His work strongly enhanced the research community’s analytical understanding of both the benefits and limitations of compression amplification in hearing aids. Additionally, Braida sought to develop tactile aids for people who are profoundly deaf or deaf-blind, serving as a substitute for hearing in the reception of speech and environmental sounds.</p>\n\n<p>“Lou Braida was, in many respects, the father of speech and hearing sciences within HST,” says Collin Stultz,&nbsp;Nina T. and Robert H. Rubin Professor in Medical Engineering and Science, associate director of IMES, and co-director of HST. “His contributions to the field will endure in perpetuity. He was a scholar, a cherished mentor, and a dedicated educator.”</p>\n\n<p>Charlotte Reed, a principal investigator and senior research scientist in the Research Laboratory of Electronics and longtime friend and colleague of Braida, notes that “Lou applied a rigorous quantitative approach to the study of a wide range of topics in speech and hearing science. Among his lasting contributions to the field are his comprehensive modeling work on the auditory perception of intensity and loudness and on the multimodal perception of speech.”</p>\n\n<p>Beyond Braida’s contributions to the world of auditory science, he was known throughout EECS for his community-minded and collegial approach to work. Taking time from his intense research schedule, he volunteered to mentor new faculty members and orient them to MIT’s largest department. Elazer R. Edelman,&nbsp;Edward J. Poitras Professor in Medical Engineering and Science and the director of IMES, was one of the many influenced by Braida: “Lou was the consummate educator and mentor, a citizen of MIT and a dedicated member of HST whose engineering and programmatic innovations made life better for all in our community and the world at large.”</p>\n\n<p>Jae Lim, professor post-tenure of electrical engineering, remembers his friend as a kindly influence on all who entered his sphere. “Lou influenced the lives of many students at MIT. He supervised my bachelor’s and master’s theses. I learnt from him what research is and how exciting and satisfying research can be. As a floor tutor of Burton-Conner House, he helped many students, including me, not only with academic issues, but personal matters. He will be remembered and missed by many whose lives he touched.”</p>\n\n<p>Braida’s devotion to his community was recognized in 2001, when he was awarded the Thomas A. McMahon Mentoring Award by HST. His friend Charlotte Reed aptly sums up his legacy of care, saying, “Lou will be remembered by his many students and colleagues as an intellectual force who had an enormous impact on our personal and professional growth, and he will be greatly missed.”</p>",
  "media:content": {
    "media:description": "Louis Braida was a respected member of the Department of Electrical Engineering and Computer Science, the Research Lab of Electronics, and the Harvard-MIT Program in Health Sciences and Technology.",
    "media:credit": "Photo courtesy of EECS."
  },
  "category": [
    "Obituaries",
    "Faculty",
    "Research Laboratory of Electronics",
    "Electrical Engineering & Computer Science (eecs)",
    "Harvard-MIT Health Sciences and Technology",
    "Institute for Medical Engineering and Science (IMES)",
    "Alumni/ae",
    "School of Engineering",
    "MIT Schwarzman College of Computing"
  ]
}