{
  "title": "Global Macro: Intervention & Inflation",
  "description": "<p>Amidst increased volatility across credit, equity and FX markets, many investors this week are wondering, what is the path ahead for Fed intervention? Chief Cross Asset Strategist Andrew Sheets, Global Chief Economist Seth Carpenter and Head of Thematic and Public Policy Research Michael Zezas discuss.</p><p><br></p><p>----- Transcript -----</p><p><br></p><p><strong>Andrew Sheets:</strong> Welcome to Thoughts in the Market. I'm Andrew Sheets, Chief Cross Asset Strategist for Morgan Stanley.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong> And I'm Seth Carpenter. Morgan Stanley's Global Chief Economist.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> And I'm Michael Zezas, Head of Global Thematic and Public Policy Research.&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong> And on this special edition of the podcast, we'll be talking about intervention, inflation and what's ahead for markets. It's Friday, September 30th at 9 a.m. in San Francisco.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> So, Andrew, Seth, we've been on the road all week seeing clients and that's come amidst some very unusual moves in the markets and interventions by a couple of central banks. Andrew, can you put in a context for us what's happened and maybe why it's happened?&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong> Thanks, Mike. So I think you have the intersection of three pretty interesting stories that have been happening over the last couple of weeks. The first, and probably most important, is that core inflation in the U.S. remains higher than the Federal Reserve would like, which has kept Fed policy hawkish, which has kept the dollar strong and U.S. yields moving higher. Now, one of the currencies that the dollar has been strongest against is the Japanese yen, which has fallen sharply in value this year. Now we saw Japan finally intervene into the currency markets to a limited extent to try to support the yen but that support was short lived and we saw the dollar continue to strengthen. The other story that we saw occurred in the U.K., a country we discussed on this podcast recently about some of its unique economic challenges. The U.K. has also seen a weak currency against the dollar. But in addition to that, because of the market's reaction to recent fiscal policy proposals, we saw a very large rise in U.K. bond yields, which caused market dislocations and pushed the Bank of England to intervene in bond markets in a way that drove some of the largest moves in U.K. interest rates, really in recorded history. So a lot's been going on, Mike, it's been a very busy couple of weeks, but it's a story at its core about inflation leading to intervention, but ultimately not really changing a core backdrop of higher U.S. yields and a stronger U.S. dollar.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong> I completely agree with you on that, Andrew. And I think it brings up some of the questions that you and I have got in our client meetings this week, which is, 'where can this end?' Any trend that's not sustainable won't last forever, as the saying goes. So what would cause sort of an end to the dollar's run? And I think a natural place to look is, what would cause the Fed to stop hiking? I think the first thing that's worth strongly emphasizing is, from the Fed's perspective, a narrow monetary policy mandate, the rising dollar is actually a good thing. A stronger dollar means lower imported inflation. A stronger dollar means less demand for U.S. exports from the rest of the world. The Fed is fighting inflation by hiking interest rates, trying to slow the economy and thereby reduce inflationary pressures. Right now, this run in the dollar is doing their job for them.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> I would add to that that we've been getting a lot of questions about, 'when would the Fed or the Treasury see this weakness and want to intervene on behalf of markets?' And I think the answer is it's unlikely to happen anytime soon. And there's really kind of two reasons for that. One, doing so would contradict the Fed and the Treasury's own stated goals of fighting inflation right now. I think there are heavy political and policy incentives that haven't changed that support that being the policy direction for those institutions. And then the second is, even if you intervened right now, our FX research team has pointed out it's probably unlikely to work. At the moment, there aren't a tremendous amount of FX reserves in the system with which to intervene. And so any intervention would probably deliver short term results. So long story short, if the intervention is against your goals and wouldn't likely work anyway, it's probably not going to happen. So, Andrew, I think this kind of brings the conversation back around to you. If there really isn't going to be any net change in the Federal Reserve's stance towards monetary policy, then what should investors expect going forward?&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong> So at the risk of sounding simplistic, if we're not going to see a change in policy response from the Fed, then we shouldn't expect a major change in market dynamics. Core inflation remains higher than we think the Fed is comfortable with. That will keep pressure on the Fed to keep making hawkish noises that should keep upward pressure on the front end of the curve and keep the curve quite inverted. We think that helps support the dollar because while the dollar might be expensive in many measures of foreign exchange valuation, the dollar is still paying investors much more than currencies like the yen or the UK pound in real interest rates. And that differential is powerful, that differential is important. And I think that differential will keep investors looking for the safety and stability and higher yields of the U.S. dollar. Look, taking a step back, I think markets are adjusting to this dynamic where the Fed is not your friend as an investor. Which is the pattern that we saw through most of financial market history, but was different in the post global financial crisis era, when the level of stress on the markets was so severe that the level of policy support had to be extraordinary. And so that is a dynamic that's shifting now that we're facing a stronger economy, now that we're facing much stronger consumer and corporate demand, we're facing the more normal tradeoff where strong labor markets, strong consumer demand leads to a Federal Reserve that's really trying to tighten the reins and slow the economy down, slow financial market activity down. So, you know, investors are still sailing into that headwind. We think that presents a headwind to risky assets. We think that presents a headwind to the S&P 500. And we think, with the Fed still sounding quite serious on inflation, still erring on the side of caution, that will lead investors to continue to think more rate hikes are possible and support the U.S. dollar against many other currencies in the developed market, which still have lower yields, especially on an inflation adjusted basis.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong> So, Andrew, I think I want to jump in on that because I think what you're saying is, for now, nothing's changing and so we should expect the same market dynamics. Which brings up the question that you and I have got this week as we've been seeing clients, which is, 'what would cause the Fed to pivot? What would cause the Fed to change its policies?' And I think there, I would break it into two parts. Going back to my first point about what the rising interest rates and the rising dollar have been doing, they've been doing exactly what the Fed wants, limiting demand in the United States, slowing growth in the United States, and, as a result, putting downward pressure on inflation. If we get to the point where the US economy is clearly slowing enough, if we get data that is convincing that inflation is on a downward trajectory, that's what the Fed is looking for to pause their hiking cycle. So I think that's the first answer. The other version, though, is the market volatility that we're seeing is being driven by some of this policy action. We could get feedback loops, we could get increasing bouts of volatility where markets start to break, we could get credit markets breaking, we could get more volatility and interest rate markets like we saw in the U.K.. I think at some point we can see where there's a feedback loop from financial market disruptions globally that threatens the United States. And at some point, that kind of feedback could be enough to cause the Fed to take a pause.&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong> So Seth, that's a great point. And actually, I want to push you on specifics here. How do you and the economics team think about a scenario where, let's say inflation is 3/10 lower than expected next month, or where we go from a very strong level of reading in the labor market? What would be an indication of the type of market stress that the Fed would care about relative to something it would see as more the normal course of business?&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong> I don't think one month's worth of data coming in softer than forecast would be enough to completely change the Fed's mind, but it would be enough to change the Fed's tone. I think in those circumstances, if both nonfarm payrolls and CPI came in substantially below expectations, you would hear Chair Powell at the November meeting saying things like, 'We got some data that came in softer and for now, we're going to monitor the data to see if this same downward trajectory continues.' I think that kind of language from Powell would be a signal that a pivot is probably closer than you might have thought otherwise. Conversely, when it comes to financial markets, I think the key takeaway is that it has to be the type of financial market disruptions that the Fed thinks could spill back to the U.S. and hurt overall growth enough to slow the economy, to bring inflation down. Credit market disruptions are a key issue there. Sometimes we've seen global risk markets and global funding markets get disrupted. I think it's very hard to say ex-ante what it would take. But the key is that it would have to be severe enough that it would start to affect U.S. domestic markets.&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong> So, Seth, Mike, it's been great to talk to you. So just to wrap this up, we face a backdrop where inflation still remains higher than the Federal Reserve would like it. We think that keeps policy hawkish, which keeps the dollar strong. And even though we've seen some market interventions to a limited degree, we don't see much larger interventions reversing the direction of the dollar. And we don't think such interventions, at the moment, would be particularly effective. We think that keeps the dollar strong and we think that means headwinds for markets, which leaves us cautious on risky assets in the near term. As always, this is a fast evolving story and we'll do our best to keep you up to date on it.&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong> Thanks for listening. If you enjoy Thoughts on the Market, please take a moment to rate and review us on the Apple Podcasts app. It helps more people find the show. </p>",
  "itunes:title": "Global Macro: Intervention & Inflation",
  "itunes:episodeType": "full",
  "itunes:episode": 712,
  "itunes:summary": "Amidst increased volatility across credit, equity and FX markets, many investors this week are wondering, what is the path ahead for Fed intervention? Chief Cross Asset Strategist Andrew Sheets, Global Chief Economist Seth Carpenter and Head of Thematic and Public Policy Research Michael Zezas discuss.",
  "content:encoded": "<p>Amidst increased volatility across credit, equity and FX markets, many investors this week are wondering, what is the path ahead for Fed intervention? Chief Cross Asset Strategist Andrew Sheets, Global Chief Economist Seth Carpenter and Head of Thematic and Public Policy Research Michael Zezas discuss.</p><p><br></p><p>----- Transcript -----</p><p><br></p><p><strong>Andrew Sheets:</strong> Welcome to Thoughts in the Market. I'm Andrew Sheets, Chief Cross Asset Strategist for Morgan Stanley.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong> And I'm Seth Carpenter. Morgan Stanley's Global Chief Economist.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> And I'm Michael Zezas, Head of Global Thematic and Public Policy Research.&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong> And on this special edition of the podcast, we'll be talking about intervention, inflation and what's ahead for markets. It's Friday, September 30th at 9 a.m. in San Francisco.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> So, Andrew, Seth, we've been on the road all week seeing clients and that's come amidst some very unusual moves in the markets and interventions by a couple of central banks. Andrew, can you put in a context for us what's happened and maybe why it's happened?&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong> Thanks, Mike. So I think you have the intersection of three pretty interesting stories that have been happening over the last couple of weeks. The first, and probably most important, is that core inflation in the U.S. remains higher than the Federal Reserve would like, which has kept Fed policy hawkish, which has kept the dollar strong and U.S. yields moving higher. Now, one of the currencies that the dollar has been strongest against is the Japanese yen, which has fallen sharply in value this year. Now we saw Japan finally intervene into the currency markets to a limited extent to try to support the yen but that support was short lived and we saw the dollar continue to strengthen. The other story that we saw occurred in the U.K., a country we discussed on this podcast recently about some of its unique economic challenges. The U.K. has also seen a weak currency against the dollar. But in addition to that, because of the market's reaction to recent fiscal policy proposals, we saw a very large rise in U.K. bond yields, which caused market dislocations and pushed the Bank of England to intervene in bond markets in a way that drove some of the largest moves in U.K. interest rates, really in recorded history. So a lot's been going on, Mike, it's been a very busy couple of weeks, but it's a story at its core about inflation leading to intervention, but ultimately not really changing a core backdrop of higher U.S. yields and a stronger U.S. dollar.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong> I completely agree with you on that, Andrew. And I think it brings up some of the questions that you and I have got in our client meetings this week, which is, 'where can this end?' Any trend that's not sustainable won't last forever, as the saying goes. So what would cause sort of an end to the dollar's run? And I think a natural place to look is, what would cause the Fed to stop hiking? I think the first thing that's worth strongly emphasizing is, from the Fed's perspective, a narrow monetary policy mandate, the rising dollar is actually a good thing. A stronger dollar means lower imported inflation. A stronger dollar means less demand for U.S. exports from the rest of the world. The Fed is fighting inflation by hiking interest rates, trying to slow the economy and thereby reduce inflationary pressures. Right now, this run in the dollar is doing their job for them.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> I would add to that that we've been getting a lot of questions about, 'when would the Fed or the Treasury see this weakness and want to intervene on behalf of markets?' And I think the answer is it's unlikely to happen anytime soon. And there's really kind of two reasons for that. One, doing so would contradict the Fed and the Treasury's own stated goals of fighting inflation right now. I think there are heavy political and policy incentives that haven't changed that support that being the policy direction for those institutions. And then the second is, even if you intervened right now, our FX research team has pointed out it's probably unlikely to work. At the moment, there aren't a tremendous amount of FX reserves in the system with which to intervene. And so any intervention would probably deliver short term results. So long story short, if the intervention is against your goals and wouldn't likely work anyway, it's probably not going to happen. So, Andrew, I think this kind of brings the conversation back around to you. If there really isn't going to be any net change in the Federal Reserve's stance towards monetary policy, then what should investors expect going forward?&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong> So at the risk of sounding simplistic, if we're not going to see a change in policy response from the Fed, then we shouldn't expect a major change in market dynamics. Core inflation remains higher than we think the Fed is comfortable with. That will keep pressure on the Fed to keep making hawkish noises that should keep upward pressure on the front end of the curve and keep the curve quite inverted. We think that helps support the dollar because while the dollar might be expensive in many measures of foreign exchange valuation, the dollar is still paying investors much more than currencies like the yen or the UK pound in real interest rates. And that differential is powerful, that differential is important. And I think that differential will keep investors looking for the safety and stability and higher yields of the U.S. dollar. Look, taking a step back, I think markets are adjusting to this dynamic where the Fed is not your friend as an investor. Which is the pattern that we saw through most of financial market history, but was different in the post global financial crisis era, when the level of stress on the markets was so severe that the level of policy support had to be extraordinary. And so that is a dynamic that's shifting now that we're facing a stronger economy, now that we're facing much stronger consumer and corporate demand, we're facing the more normal tradeoff where strong labor markets, strong consumer demand leads to a Federal Reserve that's really trying to tighten the reins and slow the economy down, slow financial market activity down. So, you know, investors are still sailing into that headwind. We think that presents a headwind to risky assets. We think that presents a headwind to the S&P 500. And we think, with the Fed still sounding quite serious on inflation, still erring on the side of caution, that will lead investors to continue to think more rate hikes are possible and support the U.S. dollar against many other currencies in the developed market, which still have lower yields, especially on an inflation adjusted basis.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong> So, Andrew, I think I want to jump in on that because I think what you're saying is, for now, nothing's changing and so we should expect the same market dynamics. Which brings up the question that you and I have got this week as we've been seeing clients, which is, 'what would cause the Fed to pivot? What would cause the Fed to change its policies?' And I think there, I would break it into two parts. Going back to my first point about what the rising interest rates and the rising dollar have been doing, they've been doing exactly what the Fed wants, limiting demand in the United States, slowing growth in the United States, and, as a result, putting downward pressure on inflation. If we get to the point where the US economy is clearly slowing enough, if we get data that is convincing that inflation is on a downward trajectory, that's what the Fed is looking for to pause their hiking cycle. So I think that's the first answer. The other version, though, is the market volatility that we're seeing is being driven by some of this policy action. We could get feedback loops, we could get increasing bouts of volatility where markets start to break, we could get credit markets breaking, we could get more volatility and interest rate markets like we saw in the U.K.. I think at some point we can see where there's a feedback loop from financial market disruptions globally that threatens the United States. And at some point, that kind of feedback could be enough to cause the Fed to take a pause.&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong> So Seth, that's a great point. And actually, I want to push you on specifics here. How do you and the economics team think about a scenario where, let's say inflation is 3/10 lower than expected next month, or where we go from a very strong level of reading in the labor market? What would be an indication of the type of market stress that the Fed would care about relative to something it would see as more the normal course of business?&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong> I don't think one month's worth of data coming in softer than forecast would be enough to completely change the Fed's mind, but it would be enough to change the Fed's tone. I think in those circumstances, if both nonfarm payrolls and CPI came in substantially below expectations, you would hear Chair Powell at the November meeting saying things like, 'We got some data that came in softer and for now, we're going to monitor the data to see if this same downward trajectory continues.' I think that kind of language from Powell would be a signal that a pivot is probably closer than you might have thought otherwise. Conversely, when it comes to financial markets, I think the key takeaway is that it has to be the type of financial market disruptions that the Fed thinks could spill back to the U.S. and hurt overall growth enough to slow the economy, to bring inflation down. Credit market disruptions are a key issue there. Sometimes we've seen global risk markets and global funding markets get disrupted. I think it's very hard to say ex-ante what it would take. But the key is that it would have to be severe enough that it would start to affect U.S. domestic markets.&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong> So, Seth, Mike, it's been great to talk to you. So just to wrap this up, we face a backdrop where inflation still remains higher than the Federal Reserve would like it. We think that keeps policy hawkish, which keeps the dollar strong. And even though we've seen some market interventions to a limited degree, we don't see much larger interventions reversing the direction of the dollar. And we don't think such interventions, at the moment, would be particularly effective. We think that keeps the dollar strong and we think that means headwinds for markets, which leaves us cautious on risky assets in the near term. As always, this is a fast evolving story and we'll do our best to keep you up to date on it.&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong> Thanks for listening. If you enjoy Thoughts on the Market, please take a moment to rate and review us on the Apple Podcasts app. It helps more people find the show. </p>",
  "guid": "gid://art19-episode-locator/V0/gOFWKcJoVjMAd2WXWieDkikJN7PM7Pmj_O_70x_RoUQ",
  "pubDate": "Fri, 30 Sep 2022 20:13:14 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:keywords": "market-trends",
  "itunes:duration": "00:10:14",
  "enclosure": ""
}