{
  "id": "tag:blogger.com,1999:blog-8913912091036362264.post-8219274703763435834",
  "published": "2020-06-16T10:00:00.000-07:00",
  "updated": "2020-06-18T15:54:46.260-07:00",
  "title": "Introducing YouTube BrandConnect, a platform for Creators and Brands to collaborate",
  "content": "Every day, people come to YouTube to connect with their favorite creators, and in the process, they <a href=\"https://www.thinkwithgoogle.com/advertising-channels/video/video-purchase-funnel/\" target=\"_blank\">discover new products</a> they love. In turn, this creates a valuable opportunity for brands to reach new audiences on YouTube and partner with creators to amplify their message. Over the years, we’ve seen branded content grow on YouTube, thanks to the direct connection creators have with their fans. In fact, the influencer marketing industry as a whole is <a href=\"https://www.businessinsider.com/influencer-marketing-report\" target=\"_blank\">projected</a> to reach $15 billion by 2022.  <br /><br />Given the success our brands and creators have seen with branded content on YouTube, we are evolving FameBit to YouTube BrandConnect. <br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-9ludkUThWb8/XugVkHwJxoI/AAAAAAAAAzE/aw2ATKLVeq4nOceSNtYNz2j6WjQL7GfSACLcBGAsYHQ/s1600/YouTube_connect_transition_V01.gif\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"450\" data-original-width=\"800\" height=\"360\" src=\"https://1.bp.blogspot.com/-9ludkUThWb8/XugVkHwJxoI/AAAAAAAAAzE/aw2ATKLVeq4nOceSNtYNz2j6WjQL7GfSACLcBGAsYHQ/s640/YouTube_connect_transition_V01.gif\" width=\"640\" /></a></div><br /><br /><h3>What YouTube BrandConnect offers </h3><br />Through YouTube BrandConnect, we’re making it easier for creators and brands to create branded content that is both authentic and effective. Our focus will continue to be supporting and driving revenue to creators, providing measurable campaigns for brands, and reaching viewers with authentic and relevant content. We’ve built unique, industry-first features within our branded content platform to support each of these goals.  <br /><br />On the creator side, we’ve developed insights-based matchmaking tools that allow more access to branded content deals for eligible creators across YouTube. Because of the connection that creators have with their fans, our proactive matchmaking produces highly engaging and relevant branded content. And it’s working - over the past two years, average deal size across the full service product grew more than 260%. <br /><br />YouTube creators have a real-time pulse on their community and have the flexibility to pivot their content to serve audience (and brand) needs, something we’re seeing firsthand right now. For example, the Reese’s brand’s March Madness campaign took a turn when the annual basketball tournament was cancelled due to the pandemic. Creators including <a href=\"https://www.youtube.com/watch?v=ihc7wrKL0a8&amp;feature=youtu.be\" target=\"_blank\">2Hype</a>, <a href=\"https://www.youtube.com/watch?v=XdAd8XkV9RA&amp;feature=youtu.be\" target=\"_blank\">Smosh Pit</a>, and <a href=\"https://www.youtube.com/watch?v=jDo6Uj9jFHA&amp;feature=youtu.be\" target=\"_blank\">Eh Bee Family</a> were able to adapt their previously-shot content to still bring a relevant vibe to fans at home, while driving strong consumer engagement and awareness for Reese’s Miniature Cups newly designed packaging, which was perfect for a stay-at-home game of couch basketball. <br /><br />For brands, we’ve added new measurement solutions like Brand Interest Lift, Influencer Lift, and organic view-through conversations that provide them with real-time campaign results and bring the accountability of digital advertising to branded content campaigns. Brand Interest Lift allows advertisers to measure consumer search behavior resulting from viewing the creator’s video, and Influencer Lift measures consumer sentiment on Purchase Intent, Brand Recall, and more. Through Google insights and tools, it is possible for brands to measure the impact and ROI of influencer marketing for the first time on YouTube.  <br /><br />We’ve also introduced several ads technology innovations such as the shopping shelf and app shelf to help viewers buy products and download apps being discussed in creators' videos directly from the watch page. This will soon expand to a new media shelf, where viewers can buy or rent movies and shows. We’ve also introduced new technologies like the <a href=\"https://www.blog.google/products/marketingplatform/360/immersive-branded-experiences-youtube-and-display-ads/\" target=\"_blank\">AR try-on experience</a> that allow viewers to virtually try on and shop products, alongside their favorite creators.  <br /><br />Eligible creators in the U.S. with 25,000+ subscribers will be able to sign up for YouTube BrandConnect directly in YouTube Studio, where we’ll be adding more campaign management features in the coming months. With YouTube BrandConnect, brands can easily connect and measure branded content campaigns with their Google and YouTube advertising strategies - allowing for full-funnel influencer marketing integrations. <br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/--As7b_FOyTI/XugVrMv-CsI/AAAAAAAAAzI/5v_n0y9hhRMMc8qrsN8ScdoymQ85auwpwCLcBGAsYHQ/s1600/BrandConnectReStudio.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1225\" data-original-width=\"1128\" height=\"640\" src=\"https://3.bp.blogspot.com/--As7b_FOyTI/XugVrMv-CsI/AAAAAAAAAzI/5v_n0y9hhRMMc8qrsN8ScdoymQ85auwpwCLcBGAsYHQ/s640/BrandConnectReStudio.png\" width=\"589\" /></a></div><br /><br /><h3>Looking forward with YouTube BrandConnect </h3><br />We’re always looking for new ways to help creators earn more money, and we’ve added additional resources to help creators get started making branded content on <a href=\"https://creatoracademy.youtube.com/page/course/branded-content\" target=\"_blank\">Creator Academy</a>. We’ll continue investing in our technology and expanding internationally to bring new experiences to creators, brands and their fans globally. This is just the beginning for YouTube BrandConnect, and we’re excited to bring even more value to creators, brands, and viewers through branded content campaigns in the months ahead.  <br /><br /><i>Lori Sobel, Global Business Head of YouTube BrandConnect </i><br /><br /><i>Henry Scott-Green, Product Manager at YouTube BrandConnect </i>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube",
    "uri": "http://www.blogger.com/profile/03369985352764236236",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}