{
  "id": "tag:blogger.com,1999:blog-2499715909956774229.post-1874072111475145735",
  "published": "2019-05-02T07:54:00.001-07:00",
  "updated": "2019-05-05T11:01:47.289-07:00",
  "title": "Can the Fed Control Overnight Rates?",
  "content": "The mechanism under which central banks peg overnight nominal interest rates typically relies on having a sufficiently large buffer of some asset or liability, then supplying that asset or liability inelastically at the desired overnight rate. Financial market arbitrage then looks after the rest - the pegged nominal interest rate effectively sets all short-term interest rates. Before the financial crisis, the buffer for the Fed was a stock of overnight repos, supplied at a rate that would peg overnight repo rates. But, that was a tricky game, as the Fed's ultimate interest rate target was the unsecured fed funds rate. The New York Fed had to make daily adjustments in its repo market trading strategy to account for the factors that might cause differences between market repo rates and the fed funds rate. So, with the advent of interest payments on reserves in October 2008, and the large Fed balance sheet, some may have thought that controlling overnight interest rates would be comparatively easy.<br /><br />Under the floor system the Fed now operates under, the buffer is a large stock of reserve balances held by commercial banks. The Fed sets the interest rate on reserves, IOER, and in theory this should determine all overnight rates. That is, the Fed now pegs an interest rate on one of its liabilities, rather than one of its assets. But, as it turns out, arbitrage in US financial markets does not work like arbitrage in theory. In spite of the very large stock of reserves outstanding, setting IOER does not always do a good job of pegging overnight rates of interest.<br /><br />When the Fed began \"normalization,\" by raising its interest rate target, in December 2015, it established a \"leaky floor\" system, under which IOER would be viewed as an upper bound on the fed funds rate, and the lower bound would be the ON-RRP rate, an interest rate on reverse repurchase agreements, which the Fed would supply elastically in a daily auction. Initially, the margin between the IOER and the ON-RRP rate was 25 basis points. Until early in 2018, the fed funds rate fell between the ON-RRP rate and IOER. Overnight repo rates, along with short-term T-bill rates, tended to fall around the ON-RRP rate.<br /><br />But, by early 2018, things changed. All short-term interest rates moved up to the vicinity of IOER, and the Fed's ON-RRP facility became effectively dormant. I discussed these developments <a href=\"http://newmonetarism.blogspot.com/2018/07/fed-balance-sheet-news.html\">in this post,</a>  in <a href=\"http://newmonetarism.blogspot.com/2018/07/fed-balance-sheet-policy-and-treasury.html\">this one,</a> and <a href=\"http://newmonetarism.blogspot.com/2018/08/feds-portfolio-manager-says-not-to-worry.html\">in this one.</a> My interpretation of events is that, from 2009 to early 2018, collateral was scarce in overnight markets, making repo rates low relative to the fed funds rate and IOER. This scarcity was primarily due to the Fed's asset purchases (quantitative easing), and when the Fed phased out its reinvestment policy (replacing maturing assets on its balance sheet), the scarcity went away. The Fed blamed the Treasury, citing increased Treasury issues. It's possible that contributed to the easing of the collateral scarcity, but I'm not sure.<br /><br />Recently, something unexpected has happened. These are daily observations on the fed funds rate and a <a href=\"https://www.newyorkfed.org/markets/treasury-repo-reference-rates\">Treasury repo rate</a>:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-gjW_NpjpSjc/XMr4-cuyftI/AAAAAAAADb0/W4fy7_K6GkQFgyHT6_N9ntFCcOMzQ0kXwCLcBGAs/s1600/fedfig2.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://1.bp.blogspot.com/-gjW_NpjpSjc/XMr4-cuyftI/AAAAAAAADb0/W4fy7_K6GkQFgyHT6_N9ntFCcOMzQ0kXwCLcBGAs/s640/fedfig2.png\" width=\"640\" height=\"536\" data-original-width=\"1009\" data-original-height=\"845\" /></a></div>This shows daily data from December 20, 2018, just after the last FOMC interest rate hike, through April 29. IOER is set at 2.4% through the whole period. You can see that, until recently, IOER was pegging the fed funds rate at 2.4%, but in recent weeks the fed funds rate has eased up to, to at most 5 basis points above IOER. The repo rate I've shown exhibits a similar pattern, though there's more volatility in the repo rate. As well, the repo rate exhibits spikes at month end - particularly pronounced at year-end 2018. The other two Treasury repo rates the New York Fed reports show essentially identical behavior.<br /><br />For good measure, the next chart shows 1-month and 3-month T-bill secondary market yields. <div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-gJVkgwi8O6U/XMr6n38n-EI/AAAAAAAADcA/8dgPM-smFHwxLol4BPnh9h-qClD-QxBjQCLcBGAs/s1600/fedfig1.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-gJVkgwi8O6U/XMr6n38n-EI/AAAAAAAADcA/8dgPM-smFHwxLol4BPnh9h-qClD-QxBjQCLcBGAs/s640/fedfig1.png\" width=\"640\" height=\"529\" data-original-width=\"1023\" data-original-height=\"845\" /></a></div>So, T-bills are actually trading <i>lower</i> than fed funds recently - for the most part.<br /><br />So, what could be going on here? It cannot be the case that reserves are somehow becoming \"scarce.\" There's still about $1.5 trillion in reserves outstanding, and even extreme floor-system enthusiasts don't seem to think that $1.5 trillion isn't a lot. Why would banks forego a five-basis-point profit opportunity to lending on the fed funds market rather than holding reserves? What's changed in the last few weeks? Whatever is going on, the Fed is not controlling overnight rates as it anticipated, or the way it should.<br /><br />There's an easy fix, however, and that's <a href=\"https://www.stlouisfed.org/on-the-economy/2019/march/why-fed-create-standing-repo-facility\">Andolfatto and Ihrig's standing repo facility</a> (see also <a href=\"https://www.stlouisfed.org/on-the-economy/2019/april/fed-standing-repo-facility-follow-up\">this post</a>) - though Andolfatto and Ihrig (A/I) are offering the wrong reasons for the right action. The A/I argument is that a standing repo facility is necessary to make the Treasury holdings of large banks more liquid in the event of financial stress and wholesale funding outflows. Large banks hold liquid assets in line with their Dodd-Frank resolution plans, as well as to fulfill liquidity coverage requirements. One might think that Treasury securities are just as good as reserves for these purposes, but A/I argue to the contrary. The idea is that a stressed large bank might have trouble unloading a large quantity of Treasuries, or borrowing against them on the repo market. This argument might seem odd as: (i) A time of heavy stress for a large bank would typically be associated with aggregate stress. And - again typically - what happens in such episodes is that market participants are fleeing to safety, and safe assets include Treasury securities. So, there's not likely to be a problem in unloading Treasuries or in borrowing against them during a period of stress. (ii) It's the Fed's job to smooth fluctuations in short safe rates of interest. So, is there something wrong with the Fed's ability to control short rates?<br /><br />Well, it appears there is something wrong with the Fed's ability to control short rates. I'm actually less concerned with the fed funds rate, and more concerned with repo rates, as the Fed should be. Those end-of-month spikes in repo rates shouldn't be happening. Here's what would fix overnight markets. The Fed should go back to the sort of repo intervention they did before the financial crisis - fine if they want to call this a standing repo facility, or whatever. Use the same counterparties as for the Fed's reverse repo facility - a broad-based approach is ideal. A/I are suggesting that the targeted repo rate be above IOER, but why not set it equal to IOER?<br /><br />This then raises two questions: (i) Why the focus on the fed funds rate? Most central banks target a repo rate. (ii) Why the large balance sheet? The floor system isn't working.",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Stephen Williamson",
    "uri": "http://www.blogger.com/profile/01434465858419028592",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 2
}