{
  "id": "https://bibleinoneyear.org/en/youth/232",
  "title": "Day 232: How to Listen to the Holy Spirit",
  "description": "Proverbs 20:15,18a,19,22,24, 2 Chronicles 10:6a,7–8,10–11, 1 Corinthians 14:1–5,12b–19.  He loves me and he is with me ’Many of us live in a busy and noisy world",
  "pubDate": "Fri, 20 Aug 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/232/?ignore",
  "itunes:duration": "13:55",
  "guid": "enyouth20082021-232",
  "length": 835.16,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 232: How to Listen to the Holy Spirit",
  "itunes:subtitle": "Proverbs 20:15,18a,19,22,24, 2 Chronicles 10:6a,7–8,10–11, 1 Corinthians 14:1–5,12b–19.  He loves me and he is with me ’Many of us live in a busy and noisy world",
  "itunes:summary": "Will Wisbey was a successful, young estate agent. He was fiercely sceptical of Christianity. One Sunday, a friend invited him to HTB. During that service, someone had a ‘word of knowledge’ that went like this: ‘There is a man here who is expecting a soft-top sports car to be delivered in the next two days. He has worked all his life so hard to achieve success. Work has been his life. He’s got the car, the house, the lifestyle, and he‘s not happy. And God wants him to know that there’s something more important for him to focus on.’\nSubsequently Will wrote, ‘I couldn’t believe it. My new car was the nicest I’d bought. It was arriving in literally two days and I hadn’t told anyone. I was earning £100k a year. My work was my life. That night, for the first time in my life, I really prayed.’\nWill encountered Jesus Christ and was filled with the Holy Spirit. He says, ‘Now I know Jesus does exist. He loves me and he is with me.’\nMany of us live in a busy and noisy world. In the midst of all the noise, talk and distractions, how do you hear the voice of the Holy Spirit?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 232
}