{
  "title": "The deconvolved distribution estimator: enhancing reionisation-era CO line-intensity mapping analyses with a cross-correlation analogue for one-point statistics. (arXiv:2210.14890v2 [astro-ph.CO] UPDATED)",
  "link": "http://arxiv.org/abs/2210.14890",
  "description": "<p>We present the deconvolved distribution estimator (DDE), an extension of the\nvoxel intensity distribution (VID), in the context of future observations\nproposed as part of the CO Mapping Array Project (COMAP). The DDE exploits the\nfact that the observed VID is a convolution of correlated signal intensity\ndistributions and uncorrelated noise or interloper intensity distributions. By\ndeconvolving the individual VID of two observables away from their joint VID in\na Fourier-space operation, the DDE suppresses sensitivity to interloper\nemission while maintaining sensitivity to correlated components. The DDE thus\nimproves upon the VID by rejecting uncorrelated noise and interloper biases,\nwhich is useful in the context of COMAP observations that observe different\nrotational transitions of CO from the same comoving volume in different\nobserving frequency bands. Fisher forecasts suggest that the theoretical\nsensitivity in the DDE allows significant improvements in constraining power\ncompared to either the cross power spectrum or the individual VID data, and\nmatches the constraining power of the combination of all other one- and\ntwo-point summary statistics. Future work should further investigate the\ncovariance and model-dependent behaviour of this novel one-point\ncross-correlation statistic.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Chung_D/0/1/0/all/0/1\">Dongwoo T. Chung</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Bangari_I/0/1/0/all/0/1\">Ishika Bangari</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Breysse_P/0/1/0/all/0/1\">Patrick C. Breysse</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Ihle_H/0/1/0/all/0/1\">H&#xe5;vard T. Ihle</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Bond_J/0/1/0/all/0/1\">J. Richard Bond</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Dunne_D/0/1/0/all/0/1\">Delaney A. Dunne</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Padmanabhan_H/0/1/0/all/0/1\">Hamsa Padmanabhan</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Philip_L/0/1/0/all/0/1\">Liju Philip</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Rennie_T/0/1/0/all/0/1\">Thomas J. Rennie</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Viero_M/0/1/0/all/0/1\">Marco P. Viero</a>"
}