{
  "title": "Eric Andre, Polly Feitelberg's Debut, Dave Portnoy May Buy the Mets, and Randonauts",
  "description": "<p>Subscribe, rate, and leave a review!\n\nWe kick off the show talking about comedians reactions to the accusations against Chris D'Elia, his statement, and how no matter how hard they try people won't be able to cancel Joey \"Coco\" Diaz. \n\n(33:50) We discuss the unintentional comedy surrounding the Trump Rally and the photo of him looking disheveled. \n\n(41:36)A woman is trying to cancel Ancient Aliens and we don't know if she's kidding. That leads us into a conversation about conspiracy theories and the CIA.\n\n(54:28) Feits has dove into the world of Randonauts and the mystery surrounding them.\n\n(1:02:57) KFC reacts to the rumors of Dave Portnoy trying to buy the Mets.\n\n(1:22:32) Top 5 Tuesday returns with Top 5 HBO shows of all time.\n\n(1:42:25) Our first voicemail (about rather having gnats swarm you at all times or always have a pebble in your shoe) leads to a childhood story of Feits' and a guest appearance from Polly Feitelberg herself.\n\n(2:06:59) Eric Andre joins the show. We discuss what he's been getting up to in quarantine, favorite drinks, and his time at Berkley. We also discuss what goes into making his pranks, whether or not he gets uncomfortable, and the one guest who is impossible to make uncomfortable (hint: he's been on our show before). Catch his new special on Netflix now.\n\nLet us know what you thought of the podcast on twitter\n@kfcradio @kfcbarstool @feitsbarstool @ericandre\n\nSubscribe and check out daily clips on Youtube:\nhttps://www.youtube.com/user/KFCradio</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/kfcr\">barstool.link/kfcr</a></p>",
  "guid": "6a838ba6-1056-4e92-b882-4494a81b5e81",
  "pubDate": "Tue, 23 Jun 2020 08:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/kfc-radio",
  "itunes:explicit": "yes",
  "itunes:duration": "02:35:40",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}