{
  "id": "yt:video:Q0qNRbktkQU",
  "yt:videoId": "Q0qNRbktkQU",
  "yt:channelId": "UCiZVMOinTQGb8HQu53VbV4Q",
  "title": "Resident Evil 8 Gold: 3rd Person View  All Boss Fights 4K UHD",
  "link": "",
  "author": {
    "name": "Gamer's Little Playground",
    "uri": "https://www.youtube.com/channel/UCiZVMOinTQGb8HQu53VbV4Q"
  },
  "published": "2022-10-29T13:31:01+00:00",
  "updated": "2022-10-29T13:31:01+00:00",
  "media:group": {
    "media:title": "Resident Evil 8 Gold: 3rd Person View  All Boss Fights 4K UHD",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "🔔 Remember to Subscribe and hit the bell! 🔔\n\nHUGE THANKS TO CAPCOM FOR THE REVIEW COPY OF RESIDENT EVIL 8 GOLD EDITION\n\n🌟 DESCRIPTION🌟\n\nThree years after Resident Evil 7, Ethan and Mia have been relocated to Europe by Chris Redfield to start a new life with their newborn daughter Rosemary. One night, Chris and his Hound Wolf squad raid the house, assassinate Mia, and abduct Ethan and Rosemary. Ethan awakens next to the crashed transport truck in which he was riding and discovers a nearby village terrorized by werewolf-like creatures known as Lycans. Ethan is unable to save the remaining villagers and is captured and brought before the village priest Mother Miranda and her lords: Alcina Dimitrescu, Donna Beneviento, Salvatore Moreau, and Karl Heisenberg. Ethan escapes a death trap made by Heisenberg and ventures into Dimitrescu's castle to find Rosemary, with the support of a mysterious local merchant known as the Duke. Ethan eliminates Dimitrescu and her daughters, finding a flask containing Rosemary's head. The Duke explains that Miranda placed Rosemary's body parts in four different flasks for a special rite and that she can be restored if Ethan recovers the other flasks held by the remaining lords.\n\nWhile killing Beneviento and Moreau for their flasks, Ethan learns Hound Wolf is also in the village. Ethan passes a test from Heisenberg for the fourth flask and is invited to the lord's factory where Heisenberg offers a proposal to defeat Miranda together. Ethan refuses once he learns Heisenberg intends to weaponize Rosemary and escapes. Ethan encounters and confronts Chris over Mia's death, learning the \"Mia\" Chris killed was Miranda in disguise. Chris reveals that Miranda possesses the power of mimicry and was attempting to abduct Rosemary, succeeding when she crashed the transport truck. Chris destroys Heisenberg's factory while Ethan uses a makeshift tank to defeat Heisenberg. Miranda confronts Ethan and kills him after she reveals her plans to take Rosemary as her own.\n\nWitnessing Ethan's death, Chris leads Hound Wolf to extract Rosemary while a Bioterrorism Security Assessment Alliance (BSAA) assault force distracts Miranda. Chris enters a cave beneath the village and discovers a Megamycete (called the \"fungal root\" (菌根, kin kon) and the \"Black God\" (黒き神, kuroki kami) in the Japanese game), the source of the mold. He plants a bomb on the Megamycete and finds Miranda's lab, learning that she has lived a century since coming into contact with the Megamycete and was a mentor to the Umbrella Corporation's founder Oswell E. Spencer; Oswell used her knowledge to eventually develop the t-Virus. Miranda experimented with the fungus in an attempt to revive her daughter, Eva, who had succumbed to the Spanish flu; the four lords, Lycans, and Eveline were failed experiments. Miranda found a suitable host with Rosemary due to her special abilities inherited from Ethan and Mia. Chris also rescues the imprisoned Mia, learning that Ethan is still alive when Mia reveals her husband's powers.\n\nResident Evil 8 Gold: 3rd Person View  All Boss Fights 4K UHD\n\n\n_________________________________\n\n\n🛍  STORE  🛍 \n\nAwesome Shirts and Merch Here: https://www.glpstore.shop/ \n\n_________________________________\n\n🎥 MOVIE LIBRARY 🎥\n\nGame Movies in 4K and 2K.\nhttps://www.youtube.com/playlist?list=PL1cvljv8vQmRMPVtnAKZitfRGmQ2OGYoZ\n\nOur Recent Movies\nhttps://www.youtube.com/playlist?list=PL1cvljv8vQmQOpPYEoDelidg4A3SciA-B\n\nA-D Game Movies\nhttps://www.youtube.com/playlist?list=PL1cvljv8vQmRGd0tq8bezyN0QFHHtnoEe\n\nE-K Game Movies\nhttps://www.youtube.com/playlist?list=PL1cvljv8vQmTi2NRYbW8Y8eMdQzxfkOfr\n\nL-R Game Movies \nhttps://www.youtube.com/playlist?list=PL1cvljv8vQmSHy85leC3rx5-E8BwpOgZM\n\nS-Z Game Movies\nhttps://www.youtube.com/playlist?list=PL1cvljv8vQmSdCiQvhet-r0Cj31KdLvE_\n\n_________________________________\n\n📱 SOCIAL MEDIAS 📱\n\n► Tik Tok: https://www.tiktok.com/@glplayground\n► DISCORD: https://discord.gg/heZNbvGEvb\n► Facebook: http://facebook.com/gLpLayground\n► Twitter: http://twitter.com/GLP_Mike\n► Instagram: http://instagram.com/GLP_Mike\n► Instagram: https://www.instagram.com/mysterymrr/\n► Outro Song: https://www.youtube.com/watch?v=G2OhfdEDZ3k\n\n_________________________________\n\n📋 HASHTAGS 📋\n\n#residentevil8gold #re8village #allbosses",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}