{
  "title": "Episode 53: &#8220;I Put a Spell on You&#8221; by Screamin&#8217; Jay Hawkins",
  "link": "https://500songs.com/podcast/episode-53-i-put-a-spell-on-you-by-screamin-jay-hawkins/",
  "pubDate": "Mon, 21 Oct 2019 03:58:15 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-53-i-put-a-spell-on-you-by-screamin-jay-hawkins/",
  "description": "Episode fifty-three of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"I Put a Spell on You\" by Screamin' Jay Hawkins, and the career of a man who had more than fifty more children than hit records. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/30919066\">\"Since I Met You Baby\" by Ivory Joe Hunter</a>\n\n\n\n<strong>Erratum</strong>\n\nI only noticed while doing the final edit for this episode that I used the words \"legitimate\" and \"illegitimate\" to describe children, and that this usage could quite possibly be considered offensive, something I hadn't realised when writing or recording it. I apologise if anyone does take offence.\n\n<strong>Resources</strong>\n\nNo Mixcloud this week, as the episode is so heavy on Hawkins that it would violate Mixcloud's terms and conditions. I tried to put together a Spotify playlist instead, but a few of the recordings I use here aren't on Spotify.\n\nAs I mention in the episode, I leaned very heavily on one book here,<a href=\"https://amzn.to/2J6x7Qf\"> <em>I Put a Spell on You: The Bizarre Life of Screamin' Jay Hawkins</em> by Steve Bergsman</a>.\n\nThere are many compilations of Hawkins' work. <a href=\"https://amzn.to/35TsrXq\">This double-CD set</a> containing all his work up to 1962 is as good as any and ridiculously cheap.\n\nFinally, you should also listen to <a href=\"https://www.thirdcoastfestival.org/feature/jays-kids\">this short audio documentary</a> on the search for Jay's kids, as it features interviews with a couple of them. They deserve to have their voices heard.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"https://www.patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nBefore I start, an acknowledgement. I like to acknowledge in the podcast when I've relied heavily on one source, and in this case the source I'm relying on most is Steve Bergsman's book \"I Put a Spell on You: The Bizarre Life of Screamin' Jay Hawkins\". That book only came out this year, so it deserves the acknowledgment even more than normal. If you like this episode, you might well want to buy Mr. Bergsman's book, which has a lot more information.\n\nThere are a lot of one-hit wonders in the history of rock and roll. And most of those one-hit wonders might as well have had no hits for all the impact they actually made on the genre. Of the thousands of people who have hits, many of them drop off the mental radar as soon as their chart success ends. For every Beatles or Elvis there's a Sam And The Womp or Simon Park Orchestra.\n\nBut some one-hit wonders are different. Some one-hit wonders manage to get an entire career out of that one hit. And in the case of Screamin' Jay Hawkins, not only did he do that, but he created a stage show that would inspire every shock-rocker ever to wear makeup, and indirectly inspire a minor British political party. The one hit he recorded, meanwhile, was covered by everyone from Nina Simone to Marilyn Manson.\n\n[Excerpt: Screamin' Jay Hawkins, \"I Put A Spell On You\"]\n\nIt's hard to separate truth from myth when it comes to Screamin' Jay Hawkins, not least because he was an inveterate liar. He always claimed, for example, that in his time in the army he had been captured by the Japanese and tortured for eighteen months.\n\nAccording to Army records, he joined the army in December 1945 and was honourably discharged in 1952. Given that World War II ended in September 1945, that would tend to suggest that his story about having been a Japanese prisoner of war was, perhaps, not one hundred percent truthful. And the same thing goes for almost everything he ever said. So anything you hear here is provisional.\n\nWhat we do know is that he seems to have grown up extremely resentful of women, particularly his mother. He was, depending on which version of the story you believe, the youngest of four or seven children, all from different fathers, and he, unlike his older siblings, was fostered from an early age. He resented his mother because of this, but does not seem to have been particularly bothered by the fact that his own prodigious fathering of children by multiple women, all of whom he abandoned, will have put those children in the same position. He variously claimed to have between fifty-seven and seventy-five children. Thirty-three have been traced, so this seems to be one of those rare occasions where he was telling the truth.\n\nSo this is another of the all too many episodes where I have to warn listeners that we are dealing with someone who behaved appallingly towards women. I am not going to go into too many details here, but suffice to say that Hawkins was not an admirable man.\n\nJalacey Hawkins was born in Cleveland, Ohio, and would often claim that he had musical training at the Ohio Conservatory of Music. This is, you will be shocked to hear, not true -- not least because there was not, in fact, an Ohio Conservatory of Music for him to train at. Instead, he learned his trade as a musician in the armed forces, where he was not, in fact, sent into Japan in a combat role aged fourteen. Instead, he joined the Special Services, the people who put on shows for the rest of the military, and learned the saxophone.\n\nAs well as his stories about being a prisoner of war, he also used to claim on a regular basis that the reason he'd loved being in the military so much was because you were allowed to kill people and wouldn't get punished for it. History does not record exactly how many people his saxophone playing killed.\n\nAfter his discharge from the military in 1952, he abandoned his first wife and children -- telling them he was popping to the shop and then not seeing them again for two years. Around this time he hooked up with Tiny Grimes, who is yet another person who often gets credited as the creator of the \"first rock and roll record\", this one a 1946 song called \"Tiny's Boogie\":\n\n[Excerpt: Tiny Grimes, \"Tiny's Boogie\"]\n\nTiny Grimes was a strange figure who straddled the worlds of jazz and R&B, and who had played with great jazz figures like Charlie Parker and Art Tatum as an instrumentalist, but who as a singer was firmly in the rock and roll world. He had seen his greatest success with a rock and roll version of the old Scottish folk song \"Loch Lomond\"\n\n[Excerpt: Tiny Grimes \"Loch Lomond\"]\n\nAs a result of that, he'd started performing in a kilt, and calling himself Tiny \"Mac\" Grimes and His Rocking Highlanders. Grimes first met Hawkins backstage at the Moondog Coronation Ball -- a legendary gig put on by Alan Freed in 1952, which was the first big sign to Freed of just how successful rock and roll was going to become.\n\nAt that show, so many more people tried to get in than the venue had capacity for -- thanks, largely, to forged tickets being sold -- that the show became dangerously overcrowded, and had to be cancelled after a single song from the first artist on the bill.\n\nSo Grimes didn't get to play that day, but Jalacey Hawkins, as he was still then known, managed to get himself backstage and meet Grimes.\n\nHawkins did this through Freed, who Hawkins had got to know shortly after his discharge from the military. When he'd got back to Cleveland, he'd heard Freed on the radio and been amazed that they let a black man have his own show, so he'd gone down to the radio station to meet him, and been even more amazed to find out that the man who sounded black, and was playing black music, was in fact white. For decades afterwards, Hawkins would describe Freed as one of the very few white people in the world who actually cared about black people and black music.\n\nThe two had struck up a friendship, and Hawkins had managed to get backstage at Freed's show. When he did, he just went up to Grimes and asked for a job. Grimes gave him a job as a combination road manager and musician -- Hawkins would play piano and saxophone, sing occasionally, and was also (according to Hawkins) Grimes' valet and dog walker.\n\nWorking with Grimes is where Hawkins first started performing outrageously on stage. Grimes' band already dressed in Scottish clothing, and put on quite a bit of a show, but Hawkins pushed things a little further. He would, for example, come out on stage in his kilt and with tins of Carnation evaporated milk hanging on his chest as if they were breasts. He would then sing Ruth Brown's hit \"Mama, He Treats Your Daughter Mean\".\n\n[Excerpt: Ruth Brown, \"Mama, He Treats Your Daughter Mean\"\n\nAccording to Hawkins, Ruth Brown came to see the show at one point, and said of him \"This is the only bitch who can sing my song better than me\". That doesn't sound especially like Brown, it has to be said.\n\nHawkins started recording with Grimes, and started to be billed as \"Screamin' Jay Hawkins\" -- a stage name which, again, he gave varying origins for. The most likely seems to be the one he gave in a documentary, in which he said that he couldn't sing, but had to take lead vocals, so he decided to just scream everything, because at least that would be different. Quite how that tallies with his ability to sing better than Ruth Brown, it's best not to wonder.\n\nEither way, his early recordings show him trying to fit into the standard R&B vocal styles of the time, rather than screaming. On his first record, with Grimes, he's not the blues shouter that he had a reputation of being, and nor is he the screamer he would later become -- instead he sounds like he's imitating Clyde McPhatter's singing on \"The Bells\" by Billy Ward and His Dominoes, but in a bass register somewhat reminiscent of Paul Robeson. Compare Hawkins here:\n\n[Excerpt: Tiny Grimes with Screamin' Jay Hawkins, \"Why Did You Waste My Time?\"]\n\nWith McPhatter on the Billy Ward record:\n\n[Excerpt: Billy Ward and His Dominoes, \"The Bells\"]\n\nYou can hear the resemblance there, I'm sure. At this point Hawkins had a certain amount of potential, but was just one of a million smooth blues singers, who relied more on stage gimmicks than on singing ability. But those stage gimmicks were making him a breakout star in Grimes' band, and so at a recording session for Grimes, it was agreed that Hawkins could record a single of his own at the end of the session, if there was time.\n\nHawkins' attitude quickly caused problems for him, though. During the recording of \"Screamin' Blues\", which would have been his first single, he got into an argument with Ahmet Ertegun, who kept telling him to sing the song more smoothly, like Fats Domino. Accounts of what happened next vary -- Hawkins' most frequent version was that he ended up punching Ertegun, though other people just say that the two got into a screaming row. Either way, the session was abandoned, and Hawkins soon ended up out of Grimes' band.\n\nHe worked with a few different bands, before getting a big break as Fats Domino's opening act. He only lasted a few weeks in that role -- depending on who you asked, Domino either fired Hawkins for being vulgar on stage and screaming, as Domino claimed, or because he was jealous of Hawkins' great leopardskin suit, as Hawkins would sometimes claim.\n\nWynonie Harris saw something in Hawkins, and helped him get his first solo shows in New York, and on the back of these he made his first records as a solo artist, for the tiny label Timely Records, under his birth name, Jalacey Hawkins, and featuring Mickey Baker, who would play on most of his fifties sessions, on guitar:\n\n[Excerpt: Jalacey Hawkins, \"Baptize Me in Wine\"]\n\nBut unfortunately, after two of these singles, Timely Records folded, and Hawkins had to find another label. He moved on to Grand Records, and started recording as Screamin' Jay Hawkins. By this time, he had started using some of the gimmicks he would use in his stage show, though for the most part his act was still fairly tame by modern standards. He was also still, at least in the recording studio, making fairly standard jump blues records, like this one, the first he recorded as a solo artist under his stage name:\n\n[Excerpt, Screamin' Jay Hawkins, \"Take Me Back\"]\n\nThat was the only single that saw release from his time with Grand Records, and it's not even certain that it was released until a year or so later -- reports seem to vary about this.\n\nBut it was while he was recording for Grand Records that he wrote the song that would bring him worldwide fame. It came about, as so much of Hawkins' life did, from his mistreatment of a woman.\n\nHe was playing a residency in Atlantic City, and he had a live-in girlfriend from Philadelphia. But, as was always the case with Hawkins, he was cheating on her with multiple other women. Eventually she figured this out, and walked into the bar in the middle of one of his sets, threw his keys onto the stage, and walked out, blowing him a kiss. He didn't realise what had happened until he was talking to the barmaid later, and she explained to him that no, that meant his girlfriend was definitely leaving.\n\nHe brooded over this for a day, and then had another conversation with the barmaid, and told her he was planning to go to Philadelphia to get the girl back. She said \"so you think she'll come back to you, do you?\" and he replied \"yes, I'll get her back, even if I have to put a spell on her -- that's it! I'll write a song about putting a spell on her, and she'll realise how much I love her and come back!\"\n\nHawkins would later claim that when, two years later, the song was finally released, she did come back -- not because of \"I Put A Spell On You\", but because she loved the B-side, a song called \"Little Demon\". As Hawkins told the story, she came back to him, they stayed together for four months, and then he dumped her. He hadn't wanted her back because he loved her, he'd wanted her back so that he could be the one to do the dumping, not her.\n\nWhatever the truth of that last part, he recorded \"I Put A Spell on You\" some time around late 1954, but that version wouldn't be released until decades later:\n\n[Excerpt: Screamin' Jay Hawkins, \"I Put A Spell on You (unreleased version)\"]\n\nIt's a decent record, but there's something missing, and for whatever reason, it never came out.\n\nInstead, he signed to yet another label, Mercury, which was at the time somewhere between a large independent label and a small major, and started putting out singles just as \"Jay Hawkins\". By this time, he'd found a regular team of people to work with -- Leroy Kirkland was the arranger, and Mickey Baker would play guitar, Sam \"the Man\" Taylor and Al Sears were on saxophone, and Panama Francis was on drums. That core team would work on everything he did for the next couple of years.\n\nIt was while he was at Mercury that he hit on the style he would use from that point on, with a B-side called \"(She Put The) Wamee (On Me)\", a song about voodoo and threatening to murder a woman who'd cast a spell on him that, in retrospect, has all the elements of Hawkins' later hit in place, just with the wrong song:\n\n[Excerpt: Jay Hawkins, \"(She Put The) Wamee (On Me)\"]\n\nThat was Hawkins' first truly great record, but it was hidden away on a B-side and did nothing. After a couple more singles, Hawkins was once again dropped by his label -- but once again, he moved on to a slightly bigger label, this time to OKeh, which was a subsidiary of Columbia, one of the biggest labels in the country. And in September 1956, he went into the studio to record his first single for them, which was to be a new version of \"I Put a Spell on You\".\n\nBut Arnold Maxim, the producer at the session, wanted something a bit different from Hawkins. He thought that everyone sounded a little too staid, a little too uptight, and he asked why they couldn't sound in the studio like they did when they were having fun on stage and really cutting loose. Hawkins replied that when they were on stage everyone was usually so drunk they couldn't *remember* what it was they'd been doing.\n\nSo Maxim decided to order in some crates of beer and fried chicken, and told them \"this isn't a recording session, it's a party. Have fun.\" When they were drunk enough, he started recording, and the result was this:\n\n[Excerpt: Screamin' Jay Hawkins, \"I Put A Spell On You\"]\n\nNow, in later years, Hawkins would try to claim that he had been tricked into that performance, and that he'd had to relearn the song from the record after the fact, because he couldn't remember what it was he'd been doing. In truth, though, it's not that different from a record like \"(She Put the) Wamee (On Me)\", and it seems more than likely that this is yet more of Hawkins' exaggeration.\n\nThe record didn't chart, because many radio stations refused to play it, but it nonetheless became a classic and reportedly sold over a million copies. This was in part due to the efforts of Alan Freed. Hawkins was already starting to play up his stage persona even more -- wearing capes and bones through his nose, and trying to portray a voodoo image. But when he was booked as the headline act on a Christmas show Freed put together in 1956, Freed surprised him by telling him he'd had a great idea for the show -- he'd got hold of a coffin, and Hawkins could start his performance by rising out of the coffin like a vampire or zombie.\n\nHawkins was horrified. He told Freed that there was only one time a black man was ever getting into a coffin, and that was when he was never getting out again. Freed insisted, and eventually ended up paying Hawkins a large bonus -- which Hawkins would later claim was multiple thousands of dollars, but which actually seems to have been about three hundred dollars, itself a lot of money in 1956. Hawkins eventually agreed, though he kept a finger between the coffin and the lid, so it couldn't close completely on him.\n\nThis was the start of Hawkins' career as a shock-rocker, and he became known as \"the black Vincent Price\" for his stage shows which would include not only the coffin but also a skull on a stick with smoke coming out of it (the skull was named Henry) and a giant rubber snake. Many horror-themed rock acts of the future, such as Alice Cooper or the Cramps, would later use elements of Hawkins' stage shows -- and he would increasingly make music to match the show, so that he later recorded a song called \"Constipation Blues\", which he would perform while sitting on a toilet on stage.\n\nBut in 1957, neither he nor the record label seemed quite sure what they should do to follow up \"I Put a Spell on You\". That record had traded heavily on its shock value, to the extent that OKeh's trade ads contained the line \"DJs be brave -- if you get fired, we'll get you a job!\" however, only one DJ did get fired for playing it, one Bob Friesen. He contacted OKeh, but they didn't get him a job -- and eventually someone working for the company told Billboard this, Billboard publicised the story, and another station hired Friesen for the publicity that would get them.\n\nOKeh actually edited the single shortly after release, to get rid of some of the grunts at the end, which people variously described as \"orgiastic\" and \"cannibalistic\", but it didn't make the record any more palatable to the professionally outraged.\n\nBut the next record went completely the other way -- a cover version of the old standard \"You Made Me Love You (I Didn't Want to Do it)\":\n\n[Excerpt: Screamin' Jay Hawkins, \"You Made Me Love You (I Didn't Want to Do It)\"]\n\nI can see why they thought that was a good idea before recording it -- Fats Domino had just had a massive hit with \"Blueberry Hill\", another old standard done in a similar arrangement to the one on Hawkins' record, but still...\n\nThe next couple of records were more in the style one might expect from Hawkins, a track called \"Frenzy\", and a great Leiber and Stoller swamp-rocker called \"Alligator Wine\":\n\n[Excerpt: Screamin' Jay Hawkins, \"Alligator Wine\"]\n\nBut neither of those was a success either -- partly because Hawkins went too far in the other direction. He had the opportunity to appear in Alan Freed's film \"Mister Rock and Roll\" to promote \"Frenzy\", but while every other act in the film performed in suits or were similarly well-dressed, Hawkins insisted on performing naked apart from a loincloth, with his hair sticking up, white face-paint, and carrying a spear and a shield -- his idea of what a Mau Mau rebel in Kenya looked like (the Mau Mau fighters did not look like this). Or at least that was his later description of what he was wearing. Others who've seen the footage suggest it wasn't quite that extreme, but still involved him being half-naked and looking like a \"native\".\n\nHawkins had already been getting a certain amount of criticism from the NAACP and other civil rights groups because they believed that he was making black people look bad by associating them with voodoo and cannibalism. Paramount Pictures decided that they didn't particularly want to have their film picketed, and so removed Hawkins' section from the film. Hawkins' attitude to the NAACP was that as far as he was concerned the only thing they were doing for black people was trying to stop him earning a living, and he wanted nothing to do with them. (This was not a common attitude among black people at the time, as you might imagine.)\n\nAnd so, once again, things went to the other extreme. Hawkins put out his first album. It was called \"At Home With Screamin' Jay Hawkins\", had a cheery photo of Hawkins in a Santa hat on the cover, and mixed in his recent singles, a couple of new originals (including one called \"Hong Kong\" which is mostly just Hawkins making racist \"ching chong\" sounds) and... versions of \"I Love Paris in the Springtime\", \"Ol' Man River\", and other extremely non-voodoo-shock-rock songs.\n\nUnsurprisingly, it wasn't a success. He was dropped by OKeh and moved to a tiny label, where he started recording more idiosyncratic material like \"Armpit #6\":\n\n[Excerpt: Screamin' Jay Hawkins, \"Armpit #6\"]\n\nBut any chance of a comeback was pretty much destroyed when he was arrested in 1958 for possession of cannabis and statutory rape, after having had sex with a fifteen-year-old girl. After he got out of prison, he moved to Hawaii for a while, and became a performer again, although there was a temporary hiccup in his career when his girlfriend and singing partner stabbed him after she found out he'd married someone else without telling her. She presumably also didn't know that he was still married to his first wife at the time.\n\nHawkins' career remained in the doldrums until 1965, when two things happened almost simultaneously. The first was that Nina Simone recorded a cover version of \"I Put a Spell on You\", which made the top thirty in the US charts:\n\n[Excerpt: Nina Simone, \"I Put a Spell on You\"]\n\nThe second was that Hawkins got rediscovered in the UK, in quite a big way. There was a club in Manchester called the Twisted Wheel, which was legendary in soul and R&B circles -- to the extent that when I saw P.P. Arnold in its successor venue Night People two weeks ago, she kept referring to it as the Twisted Wheel, even though the original club closed down in 1971, because she had such strong memories of the original venue.\n\nAnd among the regular attendees of that club were a group of people who loved the few Screamin' Jay Hawkins records they'd been able to get hold of. Hawkins had been popular enough that a British act, Screamin' Lord Sutch and the Savages, had stolen his act wholesale, cape, coffin, and all:\n\n[Excerpt: Screamin' Lord Sutch and the Savages, \"Jack the Ripper\"]\n\nScreamin' Lord Sutch would later go on to form the Monster Raving Loony Party, a political party intended as a joke that still continues to field candidates at every election twenty years after Sutch's death.\n\nBut while people like Sutch had admired him, Hawkins was mostly a legend in British blues circles, someone about whom almost nothing was known. But then some of the Twisted Wheel people went to see Little Richard at the Oasis club, another famous Manchester venue, and got chatting to Don \"Sugarcane\" Harris, from the support act Don and Dewey. He mentioned that he'd recently seen Hawkins, and he was still doing the same show, and so the British blues and soul fans tracked him down and persuaded the promoter Don Arden to put on a tour of the UK, with Hawkins using the Twisted Wheel as his base.\n\nThe tour wasn't a commercial success, but it built Hawkins' reputation in Britain to the point that it seemed like *every* beat group wanted to record \"I Put a Spell on You\". Between 1965 and 1968, it was recorded by Manfred Mann, the Crazy World of Arthur Brown, the Animals, Them (featuring Van Morrison) and Alan Price, who made the top ten in the UK with his version:\n\n[Excerpt: The Alan Price Set, \"I Put a Spell on You\"]\n\nHawkins even got to record a second album, finally, in Abbey Road studios, and he started to tour Europe successfully and build up a major fanbase. But Hawkins' self-destructive -- and other-people-destructive -- tendencies kicked in. The next few decades would follow a recurring pattern -- Hawkins would get some big break, like opening for the Rolling Stones at Madison Square Garden, or recording an album with Keith Richards guesting, or finally getting to appear in a film.\n\nEvery time, he would let his addictions to alcohol or codeine overtake him, or he would rip a friend off for a trifling sum of money, or he would just get married bigamously again. Much of the time, he was living in one-room apartments, sometimes with no electricity. He married six times in total, and was abusive towards at least some of his wives.\n\nScreamin' Jay Hawkins died in 2000 after emergency surgery for an aneurysm. His fifth wife, one of the two who seem to have been actually important to him in some way, has dropped strong hints that he was killed by his sixth wife, who he had been claiming was poisoning him, though there's no evidence for that other than that she was strongly disliked by many of the people around Hawkins. When he died, he was seventy, and his current wife was thirty-one.\n\nMany people claimed that they had visitations from Hawkins' ghost in the days after his death, but the thing that seems to sum him up in the afterlife the most is his legacy to his family. He sold the rights to \"I Put a Spell on You\" shortly before his death, for twenty-five thousand dollars, which means his estate gets no songwriting royalties from his one big hit. He hadn't made a will since the 1970s, and that will left most of his money to his second wife, Ginny, who most people seem to agree deserved it if anyone did -- she was with him for sixteen years, and tolerated the worst of his behaviour. He also left an amount to a niece of his.\n\nAs for his kids? Well, none of the seventy or however many illegitimate children he had saw a penny from his will. His three legitimate children, he left a dollar each. At least one of them, his daughter Sookie, didn't get her dollar -- it went to her cousin, who didn't pass it on to her.\n\nAnd I think that means I should give Sookie the final word here, in a quote from the end of Steve Bergsman's biography. \"My father thought he was all that, but not to me. Screamin' Jay Hawkins didn't treat people right. He was a performer, but he didn't treat people right.\"",
  "itunes:subtitle": "Episode fifty-three of A History of Rock Music in Five Hundred Songs looks at I Put a Spell on You by Screamin Jay Hawkins, and the career of a man who had more than fifty more children than hit records. Click the full post to read liner notes, links to ",
  "itunes:keywords": "Ahmet Ertegun,Alan Freed,Don and Dewey,Fats Domino,Mickey Baker,Okeh Records,Ruth Brown,Screamin&#039; Jay Hawkins,Tiny Grimes,Wynonie Harris",
  "itunes:episodeType": "full",
  "itunes:episode": 53,
  "content:encoded": "Episode fifty-three of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"I Put a Spell on You\" by Screamin' Jay Hawkins, and the career of a man who had more than fifty more children than hit records. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/30919066\">\"Since I Met You Baby\" by Ivory Joe Hunter</a>\n\n\n\n<strong>Erratum</strong>\n\nI only noticed while doing the final edit for this episode that I used the words \"legitimate\" and \"illegitimate\" to describe children, and that this usage could quite possibly be considered offensive, something I hadn't realised when writing or recording it. I apologise if anyone does take offence.\n\n<strong>Resources</strong>\n\nNo Mixcloud this week, as the episode is so heavy on Hawkins that it would violate Mixcloud's terms and conditions. I tried to put together a Spotify playlist instead, but a few of the recordings I use here aren't on Spotify.\n\nAs I mention in the episode, I leaned very heavily on one book here,<a href=\"https://amzn.to/2J6x7Qf\"> <em>I Put a Spell on You: The Bizarre Life of Screamin' Jay Hawkins</em> by Steve Bergsman</a>.\n\nThere are many compilations of Hawkins' work. <a href=\"https://amzn.to/35TsrXq\">This double-CD set</a> containing all his work up to 1962 is as good as any and ridiculously cheap.\n\nFinally, you should also listen to <a href=\"https://www.thirdcoastfestival.org/feature/jays-kids\">this short audio documentary</a> on the search for Jay's kids, as it features interviews with a couple of them. They deserve to have their voices heard.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"https://www.patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nBefore I start, an acknowledgement. I like to acknowledge in the podcast when I've relied heavily on one source, and in this case the source I'm relying on most is Steve Bergsman's book \"I Put a Spell on You: The Bizarre Life of Screamin' Jay Hawkins\". That book only came out this year, so it deserves the acknowledgment even more than normal. If you like this episode, you might well want to buy Mr. Bergsman's book, which has a lot more information.\n\nThere are a lot of one-hit wonders in the history of rock and roll. And most of those one-hit wonders might as well have had no hits for all the impact they actually made on the genre. Of the thousands of people who have hits, many of them drop off the mental radar as soon as their chart success ends. For every Beatles or Elvis there's a Sam And The Womp or Simon Park Orchestra.\n\nBut some one-hit wonders are different. Some one-hit wonders manage to get an entire career out of that one hit. And in the case of Screamin' Jay Hawkins, not only did he do that, but he created a stage show that would inspire every shock-rocker ever to wear makeup, and indirectly inspire a minor British political party. The one hit he recorded, meanwhile, was covered by everyone from Nina Simone to Marilyn Manson.\n\n[Excerpt: Screamin' Jay Hawkins, \"I Put A Spell On You\"]\n\nIt's hard to separate truth from myth when it comes to Screamin' Jay Hawkins, not least because he was an inveterate liar. He always claimed, for example, that in his time in the army he had been captured by the Japanese and tortured for eighteen months.\n\nAccording to Army records, he joined the army in December 1945 and was honourably discharged in 1952. Given that World War II ended in September 1945, that would tend to suggest that his story about having been a Japanese prisoner of war was, perhaps, not one hundred percent truthful. And the same thing goes for almost everything he ever said. So anything you hear here is provisional.\n\nWhat we do know is that he seems to have grown up extremely resentful of women, particularly his mother. He was, depending on which version of the story you believe, the youngest of four or seven children, all from different fathers, and he, unlike his older siblings, was fostered from an early age. He resented his mother because of this, but does not seem to have been particularly bothered by the fact that his own prodigious fathering of children by multiple women, all of whom he abandoned, will have put those children in the same position. He variously claimed to have between fifty-seven and seventy-five children. Thirty-three have been traced, so this seems to be one of those rare occasions where he was telling the truth.\n\nSo this is another of the all too many episodes where I have to warn listeners that we are dealing with someone who behaved appallingly towards women. I am not going to go into too many details here, but suffice to say that Hawkins was not an admirable man.\n\nJalacey Hawkins was born in Cleveland, Ohio, and would often claim that he had musical training at the Ohio Conservatory of Music. This is, you will be shocked to hear, not true -- not least because there was not, in fact, an Ohio Conservatory of Music for him to train at. Instead, he learned his trade as a musician in the armed forces, where he was not, in fact, sent into Japan in a combat role aged fourteen. Instead, he joined the Special Services, the people who put on shows for the rest of the military, and learned the saxophone.\n\nAs well as his stories about being a prisoner of war, he also used to claim on a regular basis that the reason he'd loved being in the military so much was because you were allowed to kill people and wouldn't get punished for it. History does not record exactly how many people his saxophone playing killed.\n\nAfter his discharge from the military in 1952, he abandoned his first wife and children -- telling them he was popping to the shop and then not seeing them again for two years. Around this time he hooked up with Tiny Grimes, who is yet another person who often gets credited as the creator of the \"first rock and roll record\", this one a 1946 song called \"Tiny's Boogie\":\n\n[Excerpt: Tiny Grimes, \"Tiny's Boogie\"]\n\nTiny Grimes was a strange figure who straddled the worlds of jazz and R&B, and who had played with great jazz figures like Charlie Parker and Art Tatum as an instrumentalist, but who as a singer was firmly in the rock and roll world. He had seen his greatest success with a rock and roll version of the old Scottish folk song \"Loch Lomond\"\n\n[Excerpt: Tiny Grimes \"Loch Lomond\"]\n\nAs a result of that, he'd started performing in a kilt, and calling himself Tiny \"Mac\" Grimes and His Rocking Highlanders. Grimes first met Hawkins backstage at the Moondog Coronation Ball -- a legendary gig put on by Alan Freed in 1952, which was the first big sign to Freed of just how successful rock and roll was going to become.\n\nAt that show, so many more people tried to get in than the venue had capacity for -- thanks, largely, to forged tickets being sold -- that the show became dangerously overcrowded, and had to be cancelled after a single song from the first artist on the bill.\n\nSo Grimes didn't get to play that day, but Jalacey Hawkins, as he was still then known, managed to get himself backstage and meet Grimes.\n\nHawkins did this through Freed, who Hawkins had got to know shortly after his discharge from the military. When he'd got back to Cleveland, he'd heard Freed on the radio and been amazed that they let a black man have his own show, so he'd gone down to the radio station to meet him, and been even more amazed to find out that the man who sounded black, and was playing black music, was in fact white. For decades afterwards, Hawkins would describe Freed as one of the very few white people in the world who actually cared about black people and black music.\n\nThe two had struck up a friendship, and Hawkins had managed to get backstage at Freed's show. When he did, he just went up to Grimes and asked for a job. Grimes gave him a job as a combination road manager and musician -- Hawkins would play piano and saxophone, sing occasionally, and was also (according to Hawkins) Grimes' valet and dog walker.\n\nWorking with Grimes is where Hawkins first started performing outrageously on stage. Grimes' band already dressed in Scottish clothing, and put on quite a bit of a show, but Hawkins pushed things a little further. He would, for example, come out on stage in his kilt and with tins of Carnation evaporated milk hanging on his chest as if they were breasts. He would then sing Ruth Brown's hit \"Mama, He Treats Your Daughter Mean\".\n\n[Excerpt: Ruth Brown, \"Mama, He Treats Your Daughter Mean\"\n\nAccording to Hawkins, Ruth Brown came to see the show at one point, and said of him \"This is the only bitch who can sing my song better than me\". That doesn't sound especially like Brown, it has to be said.\n\nHawkins started recording with Grimes, and started to be billed as \"Screamin' Jay Hawkins\" -- a stage name which, again, he gave varying origins for. The most likely seems to be the one he gave in a documentary, in which he said that he couldn't sing, but had to take lead vocals, so he decided to just scream everything, because at least that would be different. Quite how that tallies with his ability to sing better than Ruth Brown, it's best not to wonder.\n\nEither way, his early recordings show him trying to fit into the standard R&B vocal styles of the time, rather than screaming. On his first record, with Grimes, he's not the blues shouter that he had a reputation of being, and nor is he the screamer he would later become -- instead he sounds like he's imitating Clyde McPhatter's singing on \"The Bells\" by Billy Ward and His Dominoes, but in a bass register somewhat reminiscent of Paul Robeson. Compare Hawkins here:\n\n[Excerpt: Tiny Grimes with Screamin' Jay Hawkins, \"Why Did You Waste My Time?\"]\n\nWith McPhatter on the Billy Ward record:\n\n[Excerpt: Billy Ward and His Dominoes, \"The Bells\"]\n\nYou can hear the resemblance there, I'm sure. At this point Hawkins had a certain amount of potential, but was just one of a million smooth blues singers, who relied more on stage gimmicks than on singing ability. But those stage gimmicks were making him a breakout star in Grimes' band, and so at a recording session for Grimes, it was agreed that Hawkins could record a single of his own at the end of the session, if there was time.\n\nHawkins' attitude quickly caused problems for him, though. During the recording of \"Screamin' Blues\", which would have been his first single, he got into an argument with Ahmet Ertegun, who kept telling him to sing the song more smoothly, like Fats Domino. Accounts of what happened next vary -- Hawkins' most frequent version was that he ended up punching Ertegun, though other people just say that the two got into a screaming row. Either way, the session was abandoned, and Hawkins soon ended up out of Grimes' band.\n\nHe worked with a few different bands, before getting a big break as Fats Domino's opening act. He only lasted a few weeks in that role -- depending on who you asked, Domino either fired Hawkins for being vulgar on stage and screaming, as Domino claimed, or because he was jealous of Hawkins' great leopardskin suit, as Hawkins would sometimes claim.\n\nWynonie Harris saw something in Hawkins, and helped him get his first solo shows in New York, and on the back of these he made his first records as a solo artist, for the tiny label Timely Records, under his birth name, Jalacey Hawkins, and featuring Mickey Baker, who would play on most of his fifties sessions, on guitar:\n\n[Excerpt: Jalacey Hawkins, \"Baptize Me in Wine\"]\n\nBut unfortunately, after two of these singles, Timely Records folded, and Hawkins had to find another label. He moved on to Grand Records, and started recording as Screamin' Jay Hawkins. By this time, he had started using some of the gimmicks he would use in his stage show, though for the most part his act was still fairly tame by modern standards. He was also still, at least in the recording studio, making fairly standard jump blues records, like this one, the first he recorded as a solo artist under his stage name:\n\n[Excerpt, Screamin' Jay Hawkins, \"Take Me Back\"]\n\nThat was the only single that saw release from his time with Grand Records, and it's not even certain that it was released until a year or so later -- reports seem to vary about this.\n\nBut it was while he was recording for Grand Records that he wrote the song that would bring him worldwide fame. It came about, as so much of Hawkins' life did, from his mistreatment of a woman.\n\nHe was playing a residency in Atlantic City, and he had a live-in girlfriend from Philadelphia. But, as was always the case with Hawkins, he was cheating on her with multiple other women. Eventually she figured this out, and walked into the bar in the middle of one of his sets, threw his keys onto the stage, and walked out, blowing him a kiss. He didn't realise what had happened until he was talking to the barmaid later, and she explained to him that no, that meant his girlfriend was definitely leaving.\n\nHe brooded over this for a day, and then had another conversation with the barmaid, and told her he was planning to go to Philadelphia to get the girl back. She said \"so you think she'll come back to you, do you?\" and he replied \"yes, I'll get her back, even if I have to put a spell on her -- that's it! I'll write a song about putting a spell on her, and she'll realise how much I love her and come back!\"\n\nHawkins would later claim that when, two years later, the song was finally released, she did come back -- not because of \"I Put A Spell On You\", but because she loved the B-side, a song called \"Little Demon\". As Hawkins told the story, she came back to him, they stayed together for four months, and then he dumped her. He hadn't wanted her back because he loved her, he'd wanted her back so that he could be the one to do the dumping, not her.\n\nWhatever the truth of that last part, he recorded \"I Put A Spell on You\" some time around late 1954, but that version wouldn't be released until decades later:\n\n[Excerpt: Screamin' Jay Hawkins, \"I Put A Spell on You (unreleased version)\"]\n\nIt's a decent record, but there's something missing, and for whatever reason, it never came out.\n\nInstead, he signed to yet another label, Mercury, which was at the time somewhere between a large independent label and a small major, and started putting out singles just as \"Jay Hawkins\". By this time, he'd found a regular team of people to work with -- Leroy Kirkland was the arranger, and Mickey Baker would play guitar, Sam \"the Man\" Taylor and Al Sears were on saxophone, and Panama Francis was on drums. That core team would work on everything he did for the next couple of years.\n\nIt was while he was at Mercury that he hit on the style he would use from that point on, with a B-side called \"(She Put The) Wamee (On Me)\", a song about voodoo and threatening to murder a woman who'd cast a spell on him that, in retrospect, has all the elements of Hawkins' later hit in place, just with the wrong song:\n\n[Excerpt: Jay Hawkins, \"(She Put The) Wamee (On Me)\"]\n\nThat was Hawkins' first truly great record, but it was hidden away on a B-side and did nothing. After a couple more singles, Hawkins was once again dropped by his label -- but once again, he moved on to a slightly bigger label, this time to OKeh, which was a subsidiary of Columbia, one of the biggest labels in the country. And in September 1956, he went into the studio to record his first single for them, which was to be a new version of \"I Put a Spell on You\".\n\nBut Arnold Maxim, the producer at the session, wanted something a bit different from Hawkins. He thought that everyone sounded a little too staid, a little too uptight, and he asked why they couldn't sound in the studio like they did when they were having fun on stage and really cutting loose. Hawkins replied that when they were on stage everyone was usually so drunk they couldn't *remember* what it was they'd been doing.\n\nSo Maxim decided to order in some crates of beer and fried chicken, and told them \"this isn't a recording session, it's a party. Have fun.\" When they were drunk enough, he started recording, and the result was this:\n\n[Excerpt: Screamin' Jay Hawkins, \"I Put A Spell On You\"]\n\nNow, in later years, Hawkins would try to claim that he had been tricked into that performance, and that he'd had to relearn the song from the record after the fact, because he couldn't remember what it was he'd been doing. In truth, though, it's not that different from a record like \"(She Put the) Wamee (On Me)\", and it seems more than likely that this is yet more of Hawkins' exaggeration.\n\nThe record didn't chart, because many radio stations refused to play it, but it nonetheless became a classic and reportedly sold over a million copies. This was in part due to the efforts of Alan Freed. Hawkins was already starting to play up his stage persona even more -- wearing capes and bones through his nose, and trying to portray a voodoo image. But when he was booked as the headline act on a Christmas show Freed put together in 1956, Freed surprised him by telling him he'd had a great idea for the show -- he'd got hold of a coffin, and Hawkins could start his performance by rising out of the coffin like a vampire or zombie.\n\nHawkins was horrified. He told Freed that there was only one time a black man was ever getting into a coffin, and that was when he was never getting out again. Freed insisted, and eventually ended up paying Hawkins a large bonus -- which Hawkins would later claim was multiple thousands of dollars, but which actually seems to have been about three hundred dollars, itself a lot of money in 1956. Hawkins eventually agreed, though he kept a finger between the coffin and the lid, so it couldn't close completely on him.\n\nThis was the start of Hawkins' career as a shock-rocker, and he became known as \"the black Vincent Price\" for his stage shows which would include not only the coffin but also a skull on a stick with smoke coming out of it (the skull was named Henry) and a giant rubber snake. Many horror-themed rock acts of the future, such as Alice Cooper or the Cramps, would later use elements of Hawkins' stage shows -- and he would increasingly make music to match the show, so that he later recorded a song called \"Constipation Blues\", which he would perform while sitting on a toilet on stage.\n\nBut in 1957, neither he nor the record label seemed quite sure what they should do to follow up \"I Put a Spell on You\". That record had traded heavily on its shock value, to the extent that OKeh's trade ads contained the line \"DJs be brave -- if you get fired, we'll get you a job!\" however, only one DJ did get fired for playing it, one Bob Friesen. He contacted OKeh, but they didn't get him a job -- and eventually someone working for the company told Billboard this, Billboard publicised the story, and another station hired Friesen for the publicity that would get them.\n\nOKeh actually edited the single shortly after release, to get rid of some of the grunts at the end, which people variously described as \"orgiastic\" and \"cannibalistic\", but it didn't make the record any more palatable to the professionally outraged.\n\nBut the next record went completely the other way -- a cover version of the old standard \"You Made Me Love You (I Didn't Want to Do it)\":\n\n[Excerpt: Screamin' Jay Hawkins, \"You Made Me Love You (I Didn't Want to Do It)\"]\n\nI can see why they thought that was a good idea before recording it -- Fats Domino had just had a massive hit with \"Blueberry Hill\", another old standard done in a similar arrangement to the one on Hawkins' record, but still...\n\nThe next couple of records were more in the style one might expect from Hawkins, a track called \"Frenzy\", and a great Leiber and Stoller swamp-rocker called \"Alligator Wine\":\n\n[Excerpt: Screamin' Jay Hawkins, \"Alligator Wine\"]\n\nBut neither of those was a success either -- partly because Hawkins went too far in the other direction. He had the opportunity to appear in Alan Freed's film \"Mister Rock and Roll\" to promote \"Frenzy\", but while every other act in the film performed in suits or were similarly well-dressed, Hawkins insisted on performing naked apart from a loincloth, with his hair sticking up, white face-paint, and carrying a spear and a shield -- his idea of what a Mau Mau rebel in Kenya looked like (the Mau Mau fighters did not look like this). Or at least that was his later description of what he was wearing. Others who've seen the footage suggest it wasn't quite that extreme, but still involved him being half-naked and looking like a \"native\".\n\nHawkins had already been getting a certain amount of criticism from the NAACP and other civil rights groups because they believed that he was making black people look bad by associating them with voodoo and cannibalism. Paramount Pictures decided that they didn't particularly want to have their film picketed, and so removed Hawkins' section from the film. Hawkins' attitude to the NAACP was that as far as he was concerned the only thing they were doing for black people was trying to stop him earning a living, and he wanted nothing to do with them. (This was not a common attitude among black people at the time, as you might imagine.)\n\nAnd so, once again, things went to the other extreme. Hawkins put out his first album. It was called \"At Home With Screamin' Jay Hawkins\", had a cheery photo of Hawkins in a Santa hat on the cover, and mixed in his recent singles, a couple of new originals (including one called \"Hong Kong\" which is mostly just Hawkins making racist \"ching chong\" sounds) and... versions of \"I Love Paris in the Springtime\", \"Ol' Man River\", and other extremely non-voodoo-shock-rock songs.\n\nUnsurprisingly, it wasn't a success. He was dropped by OKeh and moved to a tiny label, where he started recording more idiosyncratic material like \"Armpit #6\":\n\n[Excerpt: Screamin' Jay Hawkins, \"Armpit #6\"]\n\nBut any chance of a comeback was pretty much destroyed when he was arrested in 1958 for possession of cannabis and statutory rape, after having had sex with a fifteen-year-old girl. After he got out of prison, he moved to Hawaii for a while, and became a performer again, although there was a temporary hiccup in his career when his girlfriend and singing partner stabbed him after she found out he'd married someone else without telling her. She presumably also didn't know that he was still married to his first wife at the time.\n\nHawkins' career remained in the doldrums until 1965, when two things happened almost simultaneously. The first was that Nina Simone recorded a cover version of \"I Put a Spell on You\", which made the top thirty in the US charts:\n\n[Excerpt: Nina Simone, \"I Put a Spell on You\"]\n\nThe second was that Hawkins got rediscovered in the UK, in quite a big way. There was a club in Manchester called the Twisted Wheel, which was legendary in soul and R&B circles -- to the extent that when I saw P.P. Arnold in its successor venue Night People two weeks ago, she kept referring to it as the Twisted Wheel, even though the original club closed down in 1971, because she had such strong memories of the original venue.\n\nAnd among the regular attendees of that club were a group of people who loved the few Screamin' Jay Hawkins records they'd been able to get hold of. Hawkins had been popular enough that a British act, Screamin' Lord Sutch and the Savages, had stolen his act wholesale, cape, coffin, and all:\n\n[Excerpt: Screamin' Lord Sutch and the Savages, \"Jack the Ripper\"]\n\nScreamin' Lord Sutch would later go on to form the Monster Raving Loony Party, a political party intended as a joke that still continues to field candidates at every election twenty years after Sutch's death.\n\nBut while people like Sutch had admired him, Hawkins was mostly a legend in British blues circles, someone about whom almost nothing was known. But then some of the Twisted Wheel people went to see Little Richard at the Oasis club, another famous Manchester venue, and got chatting to Don \"Sugarcane\" Harris, from the support act Don and Dewey. He mentioned that he'd recently seen Hawkins, and he was still doing the same show, and so the British blues and soul fans tracked him down and persuaded the promoter Don Arden to put on a tour of the UK, with Hawkins using the Twisted Wheel as his base.\n\nThe tour wasn't a commercial success, but it built Hawkins' reputation in Britain to the point that it seemed like *every* beat group wanted to record \"I Put a Spell on You\". Between 1965 and 1968, it was recorded by Manfred Mann, the Crazy World of Arthur Brown, the Animals, Them (featuring Van Morrison) and Alan Price, who made the top ten in the UK with his version:\n\n[Excerpt: The Alan Price Set, \"I Put a Spell on You\"]\n\nHawkins even got to record a second album, finally, in Abbey Road studios, and he started to tour Europe successfully and build up a major fanbase. But Hawkins' self-destructive -- and other-people-destructive -- tendencies kicked in. The next few decades would follow a recurring pattern -- Hawkins would get some big break, like opening for the Rolling Stones at Madison Square Garden, or recording an album with Keith Richards guesting, or finally getting to appear in a film.\n\nEvery time, he would let his addictions to alcohol or codeine overtake him, or he would rip a friend off for a trifling sum of money, or he would just get married bigamously again. Much of the time, he was living in one-room apartments, sometimes with no electricity. He married six times in total, and was abusive towards at least some of his wives.\n\nScreamin' Jay Hawkins died in 2000 after emergency surgery for an aneurysm. His fifth wife, one of the two who seem to have been actually important to him in some way, has dropped strong hints that he was killed by his sixth wife, who he had been claiming was poisoning him, though there's no evidence for that other than that she was strongly disliked by many of the people around Hawkins. When he died, he was seventy, and his current wife was thirty-one.\n\nMany people claimed that they had visitations from Hawkins' ghost in the days after his death, but the thing that seems to sum him up in the afterlife the most is his legacy to his family. He sold the rights to \"I Put a Spell on You\" shortly before his death, for twenty-five thousand dollars, which means his estate gets no songwriting royalties from his one big hit. He hadn't made a will since the 1970s, and that will left most of his money to his second wife, Ginny, who most people seem to agree deserved it if anyone did -- she was with him for sixteen years, and tolerated the worst of his behaviour. He also left an amount to a niece of his.\n\nAs for his kids? Well, none of the seventy or however many illegitimate children he had saw a penny from his will. His three legitimate children, he left a dollar each. At least one of them, his daughter Sookie, didn't get her dollar -- it went to her cousin, who didn't pass it on to her.\n\nAnd I think that means I should give Sookie the final word here, in a quote from the end of Steve Bergsman's biography. \"My father thought he was all that, but not to me. Screamin' Jay Hawkins didn't treat people right. He was a performer, but he didn't treat people right.\"",
  "enclosure": "",
  "itunes:summary": "Episode fifty-three of A History of Rock Music in Five Hundred Songs looks at \"I Put a Spell on You\" by Screamin' Jay Hawkins, and the career of a man who had more than fifty more children than hit records. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Since I Met You Baby\" by Ivory Joe Hunter\n\n\n\nErratum\n\nI only noticed while doing the final edit for this episode that I used the words \"legitimate\" and \"illegitimate\" to describe children, and that this usage could quite possibly be considered offensive, something I hadn't realised when writing or recording it. I apologise if anyone does take offence.\n\nResources\n\nNo Mixcloud this week, as the episode is so heavy on Hawkins that it would violate Mixcloud's terms and conditions. I tried to put together a Spotify playlist instead, but a few of the recordings I use here aren't on Spotify.\n\nAs I mention in the episode, I leaned very heavily on one book here, I Put a Spell on You: The Bizarre Life of Screamin' Jay Hawkins by Steve Bergsman.\n\nThere are many compilations of Hawkins' work. This double-CD set containing all his work up to 1962 is as good as any and ridiculously cheap.\n\nFinally, you should also listen to this short audio documentary on the search for Jay's kids, as it features interviews with a couple of them. They deserve to have their voices heard.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nBefore I start, an acknowledgement. I like to acknowledge in the podcast when I've relied heavily on one source, and in this case the source I'm relying on most is Steve Bergsman's book \"I Put a Spell on You: The Bizarre Life of Screamin' Jay Hawkins\". That book only came out this year, so it deserves the acknowledgment even more than normal. If you like this episode, you might well want to buy Mr. Bergsman's book, which has a lot more information.\n\nThere are a lot of one-hit wonders in the history of rock and roll. And most of those one-hit wonders might as well have had no hits for all the impact they actually made on the genre. Of the thousands of people who have hits, many of them drop off the mental radar as soon as their chart success ends. For every Beatles or Elvis there's a Sam And The Womp or Simon Park Orchestra.\n\nBut some one-hit wonders are different. Some one-hit wonders manage to get an entire career out of that one hit. And in the case of Screamin' Jay Hawkins, not only did he do that, but he created a stage show that would inspire every shock-rocker ever to wear makeup, and indirectly inspire a minor British political party. The one hit he recorded, meanwhile, was covered by everyone from Nina Simone to Marilyn Manson.\n\n[Excerpt: Screamin' Jay Hawkins, \"I Put A Spell On You\"]\n\nIt's hard to separate truth from myth when it comes to Screamin' Jay Hawkins, not least because he was an inveterate liar. He always claimed, for example, that in his time in the army he had been captured by the Japanese and tortured for eighteen months.\n\nAccording to Army records, he joined the army in December 1945 and was honourably discharged in 1952. Given that World War II ended in September 1945, that would tend to suggest that his story about having been a Japanese prisoner of war was, perhaps, not one hundred percent truthful. And the same thing goes for almost everything he ever said. So anything you hear here is provisional.\n\nWhat we do know is that he seems to have grown up extremely resentful of women, particularly his mother. He was, depending on which version of the story you believe, the youngest of four or seven children, all from different fathers, and he, unlike his older siblings, was fostered from an early age. He resented his mother because of this, but does not seem to have been particularly bothered by the fact that his own prodigious fathering of children by multiple women, a",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode fifty-three of A History of Rock Music in Five Hundred Songs looks at \"I Put a Spell on You\" by Screamin' Jay Hawkins, and the career of a man who had more than fifty more children than hit records. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Since I Met You Baby\" by Ivory Joe Hunter\n\n\n\nErratum\n\nI only noticed while doing the final edit for this episode that I used the words \"legitimate\" and \"illegitimate\" to describe children, and that this usage could quite possibly be considered offensive, something I hadn't realised when writing or recording it. I apologise if anyone does take offence.\n\nResources\n\nNo Mixcloud this week, as the episode is so heavy on Hawkins that it would violate Mixcloud's terms and conditions. I tried to put together a Spotify playlist instead, but a few of the recordings I use here aren't on Spotify.\n\nAs I mention in the episode, ",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}