{
  "id": "https://bibleinoneyear.org/en/youth/171",
  "title": "Day 171: Come, Holy Spirit",
  "description": "Psalm 76:1–2, 1 Kings 8:10–13, Acts 13:46–52, 14:1.  In the Old Testament passage for today we read how ‘the glory of the Lord filled his temple’ (1 Kings 8:11) Each of the passages for today tells us something about how to enjoy God’s empowering presence that comes through the Holy Spirit",
  "pubDate": "Sun, 20 Jun 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/171/?ignore",
  "itunes:duration": "14:21",
  "guid": "enyouth20062021-171",
  "length": 861.26,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 171: Come, Holy Spirit",
  "itunes:subtitle": "Psalm 76:1–2, 1 Kings 8:10–13, Acts 13:46–52, 14:1.  In the Old Testament passage for today we read how ‘the glory of the Lord filled his temple’ (1 Kings 8:11) Each of the passages for today tells us something about how to enjoy God’s empowering presence that comes through the Holy Spirit",
  "itunes:summary": "Spending time in the presence of God is the most important activity of your life. You need God’s presence in your life more than you need anything else. But where do you find the presence of God?\nI remember so well the first time I heard someone pray one of the most ancient prayers of the church, ‘Come, Holy Spirit’, with a real expectation that the Holy Spirit would come! It was on a Sunday night in 1982. We had a meeting in the crypt after our evening service at HTB. As we prayed, ‘Come, Holy Spirit’ we saw remarkable events occur. We saw people being filled with the Holy Spirit with physical manifestations similar to those described in the book of Acts on the day of Pentecost. We saw extraordinary physical healings take place the following day when again someone prayed, ‘Come, Holy Spirit’.\nGod is always present with his people today by his Holy Spirit. When you pray, ‘Come, Holy Spirit,’ you are asking for an increased sense of the presence of God. There are times in the New Testament when the Holy Spirit filled a gathering of people sovereignly and spontaneously (Acts 2:2; 10:44). There are other times when the disciples prayed for the Holy Spirit: ‘After they prayed, the place where they were meeting was shaken. And they were all filled with the Holy Spirit’ (4:31). In the Old Testament passage for today we read how ‘the glory of the Lord filled his temple’ (1 Kings 8:11).\nEach of the passages for today tells us something about how to enjoy God’s empowering presence that comes through the Holy Spirit.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 171
}