{
  "id": "yt:video:c-vayU3pOeI",
  "yt:videoId": "c-vayU3pOeI",
  "yt:channelId": "UCNhX3WQEkraW3VHPyup8jkQ",
  "title": "Nahuatl - An Indigenous Language of Mexico",
  "link": "",
  "author": {
    "name": "Langfocus",
    "uri": "https://www.youtube.com/channel/UCNhX3WQEkraW3VHPyup8jkQ"
  },
  "published": "2022-02-05T14:43:40+00:00",
  "updated": "2022-06-11T05:46:23+00:00",
  "media:group": {
    "media:title": "Nahuatl - An Indigenous Language of Mexico",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "This video is all about Nahuatl, the most widely spoken indigenous language of Mexico. \n\n►Learn a language with native teachers online using italki: http://go.italki.com/1Ojye8x\n►Watch my video about MEXICO: https://www.youtube.com/watch?v=ATBtwveHx74\n\n●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●\n\n►Consultant and voice in the Nahuatl audio samples: Regulo Castro Hernandez\n\n► The Nahuatl dialect map is from the following textbook:\n\n\"Escribo mi lengua. Nahuatl de Guerrero\" MIBES 7.\nInstituto Nacional para la Educación de los Adultos, INEA.\nhttp://www.cursosinea.conevyt.org.mx/cursos/para_ser_alfabetizador_mib/contenidos/pdf/mibes7/01_n_guerrero_m7_libro.pdf\n\n► Major source for the content of this video:  \n\n\"Lecciones para un curso del náhuatl moderno\" by David Tuggy T.\nhttps://scholars.sil.org/david_h_tuggy/es/publicaciones/nahuatl_lecciones/indice\n\n► Full list of sources: https://docs.google.com/document/d/1jSXCBNWQtk3UpJOTK8V0kmsMdkORl8ZFCst_oaQ5Igo/edit?usp=sharing\n\n●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●\n\nSupport Langfocus on Patreon (https://patreon.com/langfocus). Current patrons include these amazing people:\n\nMichael, AmateurTextualCriticism, Andrew Doehler, Auguste Fields, Bennett Seacrist, Bill Walderman, Brian King, Bruce C, CFitz17, Chuck Davis, Damaran Kos, Irina Bruce, Italy Made Easy, Jacob Madsen, John Moffat, Karl-Erik Wångstedt, Kenny, Kirk Kirkpatrick, Michael Arbagi, \nMichael Cuomo, Michael J Synnott, Mody, Neil Sills, Nobbi Lampe-Strang, Paul Falstad, Rosalind Resnick, Ruben Sanchez Jr, ShadowCrossZero, Ulf Hermjakob, Victoria Goh, Vincent David, Walter Moore, Wolfgang Egon, Schroder, Yuko Sunda, 19jks94, Aaron Chow, Abdullah Al-Kazaz, Adam Vanderpluym, Aitona, Al Fung, Alana Kalinowski, Aleksei, Alen, Alex McKenzie, Ali Muhammed Alshehri, Alice, Amittai Aviram, Andrew Woods, Anthony Kinread, Anthony Peter Swallow, Aous Mansouri, Arnoud Hoorn, Ashley Dierolf, Avital Levant, Bartosz Czarnotta, Ben,  Benjamin Tipton, Billy Billy, Brent Warner, Brian Begnoche, Bruce Stark, chris brown, Chris Shifman, Christian Langreiter, Christopher Lowell, contumacious, Culimancer, Cyrus Shahrivar, Daniel Young, Darek, David Eggleston, David Golub, David LeCount, Dean Cary, Debbie, Diana Fulger, Diane Young, DickyBoa, Dina Trageser, divad, Divadrax, Don Ross, Donald Tilley, Doug, Drew Gatewood, Edward Wilson, Elijah Double, Emilia Bruns, Eric Loewenthal, Eric Nutt, Fabio Martini, fatimahl, Fawad Quraishi, Fearghus Butler, frederick shiels, G Bot, Grace Wagner, Grégoire Le Corre, Guillaume Brodar, Gustavo Villegas, Henrik Flyvbjerg, Herr K, Hila Ghebrehiwot, Howard Clark, Hugh AULT, Ihor Khodzhaniiazov, Ina Mwanda, J Choi, James and Amanda Soderling, James Lillis, JAMES ORR, Jay Bernard, Jaye Ferrone, Jens Aksel Takle, Jesús Horacio Báez Ávila, Jim McLaughlin, JL Bumgarner, Joe Dubya, Johannes, John E. McLaughlin, John Flanagan, John Gavin, John Hyaduck, John Lloyd, \nJonathan Hutchins, Josh Rotenberg, Julie Sriken, Kimball Pierce, kingvaeonic, Konrad, Konstantin Bredyuk, KW, Lance Bedasie, Laura Morland, Lee Dedmon, Leo Barudi, Lincoln Hutton, Lissette Talledo, Louie dela Fuente, Luke Jensen, m, maiku, Manuel Rosales, Margaret Langendorf, Margrét, Mark, Mark Bonneaux, Mark Judge, Mark Kemp, Markzipan, Martin Blackwell, Merrick Bobb, Merrick Bobb, MH, Michael Regal, Mike Donaldson, Mike Frysinger, Mohammed A. Abahussain, \nMário Pegado, Naama and Geoff Shang, Nicholas Gentry, Nick Michaels, Nicolas Elsishans, Niro, Oleksandr Ivanov, Ondra, Oto Kohulák, Patrick smith, Patriot Nurse, Paul Flynn, Paul Shutler, Paulla Fetzek, Peter Andersson, Peter Nikitin, Peter Scollar, piero, Pudim de Cana, Raymond Thomas, Richard Kelly, Robert Brockway, Robert Williams, Roger Smith, Roland Seuhs, Ronald Brady, Ryan Rubinstein, S. P., Sergio Pascalin, Sheila Perryman, Sierra Rooney, Sigbjørn Nerland, Simon Blanchet, sinastral, SJWS, Srga91, Stefan Reichenberger, Steven Severance, Suzanne Jacobs, Tara Pride, Theophagous, Thomas Chapel, Thomas Gijsbers, Tim Hopmann, tommy dahill, Tony DeSantis, Tumble Bug, Ty Ovendale, Vinicius Marchezini, Vitor, Waltraud Seemann, Warren McKenzie, William MacKenzie, William O Beeman, Yagub Alserkal, Yeshar Hadi, Yuriy Vrublevskiy, Yuval Filmus, Zachary Root, zhangyimo, Éric Martin, Вайзефакнот.\n\n●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●\n\nOutro music: \"January Thirteenth\" by JCSD, licensed from Storyblocks.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}