{
  "title": "S15 Ep34: Destination Fear with Dakota and Chelsea Laden",
  "link": "https://audioboom.com/posts/8098489",
  "itunes:episode": 34,
  "itunes:title": "Destination Fear with Dakota and Chelsea Laden",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4635,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Destination Fear descends on Darkness Radio with guests Dakota & Chelsea Laden.<br>\n<br>\nBrother and sister duo, Dakota Laden and Chelsea Laden join Dave & Tim to discuss some terrifying aspects of their series, favorite haunts, most memorable creepy moments, insights into the new season and more!<br>\n<br>\nBuckle up for another fright-fueled season of Travel Channel’s “Destination Fear” – a haunted road trip turned terrifying sleepover – premiering Wednesday, April 29 at 10 p.m. ET/PT. <br>\n<br>\nFor more information visit their site:<br>\n<a href=\"https://www.travelchannel.com/shows/destination-fear-2019\">https://www.travelchannel.com/shows/destination-fear-2019</a><br>\n<br>\n<br>\nVisit our shop for exciting new items, clothes, books and more: <a href=\"https://amazon.com\">https://amazon.com</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !<br>\n<br>\nBombas makes the most comfortable socks in the history of feet. Give a pair when you buy a pair, and get twenty percent off your first purchase at <a href=\"http://Bombas.com/\">Bombas.com/</a> darkness.<br>\n<br>\nDo you experience stress?  Or have anxiety…Or chronic pain ...Or have trouble sleeping at least once a week? You’re NOT alone! Feals is a better way to feel better. Our premium CBD will keep your head clear and help you feel your best. Become a member today by going to <a href=\"http://Feals.com/darkness\">Feals.com/darkness</a> and you'll get 50% off your first order with free shipping.",
  "itunes:summary": "Destination Fear descends on Darkness Radio with guests Dakota & Chelsea Laden.\n\nBrother and sister duo, Dakota Laden and Chelsea Laden join Dave & Tim to discuss some terrifying aspects of their series, favorite haunts, most memorable...",
  "pubDate": "Sun, 26 Apr 2020 08:00:00 +0000",
  "guid": "44c0c197-9dcf-454e-b2e3-a36844a0773c",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}