{
  "title": "Day 32: Cattle, Boils, and Hail (2021)",
  "link": "https://bibleinayear.fireside.fm/day-32",
  "guid": "e8d2b451-a441-4115-b410-101fa49d4f7d",
  "pubDate": "Mon, 01 Feb 2021 00:00:00 -0500",
  "author": "Ascension",
  "enclosure": "",
  "itunes:episodeType": "full",
  "itunes:author": "Ascension",
  "itunes:subtitle": "As we continue to read through the ten plagues of Egypt, Fr. Mike uses the example of Pharaoh  to show  us how our hearts can either harden or melt in response to God. Today we read Exodus 9, Leviticus 7, and Psalm 49.\n\nFor the complete reading plan, visit ascensionpress.com/bibleinayear.",
  "itunes:duration": "17:43",
  "itunes:explicit": "no",
  "description": "As we continue to read through the ten plagues of Egypt, Fr. Mike uses the example of Pharaoh to show us how our hearts can either harden or melt in response to God. Today we read Exodus 9, Leviticus 7, and Psalm 49.\nFor the complete reading plan, visit ascensionpress.com/bibleinayear.",
  "itunes:keywords": "exodus, ten plagues, plagues of egypt, ten plagues of egypt, pharaoh, let my people go, moses, egypt and exodus, egypt, leviticus, psalm, psalms, psalm 49, god's grace, catholic, bible, bible in a year, bible in a year with fr.mike, bible in a year with fr.mike schmitz, bible in a year with fr mike, bible in a year with father mike, bible in a year with father mike schmitz, the bible in a year with fr.mike schmitz, the bible in a year with fr mike, the bible in a year with father mike, the bible in a year with father mike schmitz, father mike, fr.mike, fr mike, fr. mike schmitz, father mike schmitz, bible podcast, read the bible, read the bible in a year, bible in a year podcast, bible podcast fr mike, bible podcast fr.mike, bible podcast fr.mike schmitz, bible podcast father mike, bible podcast father mike schmitz, scripture, god’s word, the word of god, Catholic Church, catholicism, catholic faith, catholic priest, ascension, ascension press, christianity, catholic bible,roman catholic, christian, catholics, catholic bible, totus tuus, bible study, Catholic Bible Study, ascension presents, salvation history, the great adventure bible, the great adventure timeline, catholics, ascension catholic, religion, jesus, jesus christ, catholic religion, god,",
  "content:encoded": "<p>As we continue to read through the ten plagues of Egypt, Fr. Mike uses the example of Pharaoh to show us how our hearts can either harden or melt in response to God. Today we read Exodus 9, Leviticus 7, and Psalm 49.</p>\n\n<p>For the complete reading plan, visit ascensionpress.com/bibleinayear.</p><p><a href=\"https://ascensionpress.com/products/support-ascension\" rel=\"payment\">Support The Bible in a Year (with Fr. Mike Schmitz)</a></p>",
  "itunes:summary": "<p>As we continue to read through the ten plagues of Egypt, Fr. Mike uses the example of Pharaoh to show us how our hearts can either harden or melt in response to God. Today we read Exodus 9, Leviticus 7, and Psalm 49.</p>\n\n<p>For the complete reading plan, visit ascensionpress.com/bibleinayear.</p><p><a href=\"https://ascensionpress.com/products/support-ascension\" rel=\"payment\">Support The Bible in a Year (with Fr. Mike Schmitz)</a></p>",
  "fireside:playerURL": "https://fireside.fm/player/v2/pkZrCg5G+s_2X_Y6Y",
  "fireside:playerEmbedCode": "<iframe src=\"https://fireside.fm/player/v2/pkZrCg5G+s_2X_Y6Y\" width=\"740\" height=\"200\" frameborder=\"0\" scrolling=\"no\">"
}