{
  "title": "TU79: Attachment Spectrum and the Nervous System, Quick Review with Updates",
  "link": "https://therapistuncensored.com/episodes/tu79-attachment-spectrum-and-the-nervous-system-quick-review-with-updates/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu79-attachment-spectrum-and-the-nervous-system-quick-review-with-updates",
  "pubDate": "Tue, 02 Oct 2018 19:39:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=6468",
  "description": "A guide to secure relating and using the attachment sciences and regulation theory in your day to day lives. Today we review what we’ve discussed so far on the podcast about the attachment spectrum and add more detail about the nervous system.\n\nTHANK YOU for getting us all the way to Season 3!! We continue to share our ideas on the practical use of attachment science and learning to manage our nervous system.\n\nFacebook Live October 8 11:30 am Central Time — Bless us with some attention here because we have never done this before but are taking the scary tech leap so that we can interact more directly, show you some stuff and we are just going to go feet first and are going to try it. Hope to see ya there!\n\nWe have updated a few things on the show, and we are hoping to add some much needed help this fall and are excited about what is in store!\n\nSo today we do a quick review of what we’ve covered before on the podcast and go over how to navigate our website and our various podcasting platforms, but we focus primarily on weaving in more nuance to the attachment spectrum. The spectrum comes from the research on infant to adult attachment that are profoundly supported in the literature. We work to make this dense science accessible in as clear and useful a way as possible that also weaves in as much neurobiology and regulation theory as possible.\n\nWe go over the notion of listening for narrative. Not what people say but how we put ideas together, not what happened to us but what we’ve done with it. So for example a the notion of a coherent narrative, one that elaborates on one’s view of themselv in the world and can perspective-take and be curious and open to exploration and influence yet have a stable sense of one’s sense of self. This compared to insecure narratives that may restrict information in various forms in order to preserve a sense of safety.\n\nWe also talk about the difference between states and traits, and focus primarily on states because that is something we can change.\n\nWe review implicit/explicit learning.\n\nWe support the notion of strategies of development instead of seeing this as insecurity, or pathology, or dysfunctional.\n\nThis is also different than introversion/extroversion.\n\nWe shift to discussing polyvagal theory or regulation theory and the ladder of regulation and how this relates to attachment. BLUE-RED-GREEN.\n\nNervous system decoded.\n\nHopeful message of change and connection and security!!\n\nWhy we are doing this.\n\nListener Comments – THANK YOU!!! Please leave us a message on our website www.therapistuncensored.com\n\nFacebook Live October 8 11:30 am Central Time — Bless us with some attention here because we have never done this before but are going to try it. \n\nResources:\n\n \tAttachment Disturbances in Adults Treatment for Comprehensive Repair (2016) Daniel Brown andDavid Elliott \n \tClinical Application of the Adult Attachment Interview Edited by Howard Steele and Mariam Steele Our favorite clinical reference for those that want to learn much more deeply about using the AAI to treat attachment and learn about its usefulness with various populations.\n\nVan Assche, L. et al “Attachment in Old Age: Theoretical Assumptions, Empirical Findings and Implications for Clinical Practice” Clinical Psychological Rev. 2013 Feb; 33(1): 67-81\n\n \n\nSchore A “Back to basics. Attachment, affect regulation and the developing right brain. Linking developmental neuroscience to pediatrics” Pedal Rev. 2005; 26: 204-217.\n\n \n\nRees, C. “Childhood attachment,” The British Journal of General Practice, 2007, Nov. 1; 57(544): 920-922\n\nTweet",
  "enclosure": "",
  "itunes:subtitle": "A guide to secure relating and using the attachment sciences and regulation theory in your day to day lives. Today we review what we’ve discussed so far on the podcast about the attachment spectrum and add more detail about the nervous system. -",
  "itunes:summary": "A guide to secure relating and using the attachment sciences and regulation theory to improve your understanding of yourself and others in your day to day lives.  Today we review what we&apos;ve discussed so far on the podcast about the attachment spectrum and add more detail about the nervous system.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "27:41"
}