{
  "title": "Review: Data Science at the Command Line",
  "description": "<p>Admission: I didn’t <em>really know</em> how computers worked until around 2012.</p>",
  "pubDate": "Mon, 15 Dec 2014 10:22:46 +0000",
  "link": "http://randyzwitch.com/data-science-command-line-review-janssens/",
  "guid": "http://randyzwitch.com/data-science-command-line-review-janssens/",
  "content": "<p>Admission: I didn’t <em>really know</em> how computers worked until around 2012.</p>\n\n<p>For the majority of my career, I’ve worked for large companies with centralized IT functions. Like many statisticians, I fell into a comfortable position of learning SAS in a Windows environment, had Ops people to fix any Unix problems I’d run into and DBAs to load data into a relational database environment.</p>\n\n<p>Then I became a consultant at a boutique digital analytics firm. To say I was punching above my weight was an understatement. All of the sudden it was time to go into various companies, have a one-hour kickoff meeting, then start untangling the spaghetti mess that represented their various technology systems. I also needed to figure out the boutique firm’s hacked together AWS and Rackspace infrastructure.</p>\n\n<p><a href=\"http://datascienceatthecommandline.com/\"><img src=\"/wp-content/uploads/2014/12/data-science-command-line.png\" alt=\"data-science-command-line\" /></a></p>\n\n<p>I’m starting off this review with this admission, because my story of learning to work from the command line parallels <a href=\"http://datascienceatthecommandline.com/\">Data Science at the Command Line</a> author <a href=\"https://twitter.com/jeroenhjanssens\">Jeroen Janssens</a>:</p>\n\n<blockquote>\n  <p>Around five years ago, during my PhD program, I gradually switched from using Microsoft Windows to GNU/Linux…Out of necessity I quickly became comfortable using the command line. Eventually, as spare time got more precious, I settled down with a GNU/Linux distribution known as Ubuntu…</p>\n\n  <ul>\n    <li>Preface, pg. xi</li>\n  </ul>\n</blockquote>\n\n<p>Because a solid majority of people have never learned anything beyond point-and-click interface (Windows or Mac), the title of the book <em>Data Science at the Command Line</em> is somewhat unfortunate; this is a book for ANYONE looking to start manipulating files efficiently from the command line.</p>\n\n<h2 id=\"getting-started-safely\">Getting Started, Safely</h2>\n\n<p>One of the best parts of <em>Data Science at the Command Line</em> is that it comes with a <a href=\"http://datasciencetoolbox.org/\">pre-built virtual machine</a> with 80-100 or more command line tools installed. This is a very fast and safe way to get started with the command line, as the tools are pre-installed and no matter what command you run while you’re learning, you won’t destroy a computer you actually care about!</p>\n\n<p>Chapters 2 and 3 move through the steps of installing the virtual machine, explaining the essential concepts of the command line, some basic commands showing simple (but powerful!) ways to chain command line tools together and how to obtain data. What I find so refreshing about these two chapters by Janssens is that the author assumes zero knowledge of the command line by the reader; these two chapters are the most accessible summary of how and why to use the command line I’ve ever read (<a href=\"http://cli.learncodethehardway.org/book/\">Zed Shaw’s CLI tutorial</a> is a close second, but is quite terse).</p>\n\n<h2 id=\"the-osemn-model\">The OSEMN model</h2>\n\n<p>The middle portion of book covers the <a href=\"http://www.dataists.com/2010/09/a-taxonomy-of-data-science/\">OSEMN model</a> (Obtain-Scrub-Explore-Model-iNterpret) of data science; another way this book is refreshing is that rather than jump right into machine learning/predictive modeling, the author spends a considerable amount of time covering the gory details of real analysis projects: manipulating data from the format you <em>receive</em> (XML, JSON, sloppy CSV files, etc.) and taking the (numerous) steps required to get the format you <em>want</em>.</p>\n\n<p>By introducing tools such as <a href=\"http://csvkit.readthedocs.io/en/latest/\">csvkit</a> (csv manipulation), <a href=\"http://stedolan.github.io/jq/\">jq</a> (JSON processor), and classic tools such as <a href=\"https://www.gnu.org/software/sed/manual/sed.html\">sed</a> (stream editor) and <a href=\"http://www.gnu.org/software/gawk/manual/gawk.html\">(g)awk</a>, the reader gets a full treatment of how to deal with malformed data files (which in my experience are the only type available in the wild!) . Chapter 6 (“Managing Your Data Workflow”) is also a great introduction into <a href=\"http://en.wikipedia.org/wiki/Reproducibility#Reproducible_research\">reproducible research</a> using <a href=\"http://blog.factual.com/introducing-drake-a-kind-of-make-for-data\">Drake</a> (Make for Data Analysis). This is an area that I will personally be focusing my time on, as I tend to run a lot of one-off commands in HDFS and as of now, just copy them into a plain-text file. Reproducing = copy-paste in my case, which defeats the purpose of computers and scripting!</p>\n\n<h2 id=\"an-idea-can-be-stretched-too-far\">An Idea Can Be Stretched Too Far</h2>\n\n<p>Chapters 8 and 9 cover Parallel Processing using <a href=\"http://www.gnu.org/software/parallel/\">GNU Parallel</a> and Modeling Data respectively. While GNU Parallel is a tool I could see using sometime in the future, I do feel like building models and creating visualizations straight from the command line is getting pretty close to just being a parlor trick. Yes, it’s obviously possible to do such things (and the author even wrote his own <a href=\"https://github.com/jeroenjanssens/data-science-at-the-command-line/blob/master/tools/Rio\">command line tool Rio</a> for using R from the command line), but with the amount of iteration, feature building and fine-tuning that goes on, I’d rather use <a href=\"http://ipython.org/notebook.html\">IPython Notebook</a> or <a href=\"http://www.rstudio.com/\">RStudio</a> to give me the flexibility I need to really iterate effectively.</p>\n\n<h2 id=\"a-book-for-everyone\">A Book For Everyone</h2>\n\n<p>As I mentioned above, I really feel that <em>Data Science at the Command Line</em> is a book well suited for anyone who does data analysis. Jeroen Janssens has done a fantastic job of taking his original <a href=\"http://jeroenjanssens.com/2013/09/19/seven-command-line-tools-for-data-science.html\">“7 command-line tools for data science”</a> blog post and extending the idea to a full-fledged book. This book has a prominent place in my work library next to <a href=\"http://shop.oreilly.com/product/0636920023784.do\">Python for Data Analysis</a> and in the past two months I’ve referred to each book at roughly the same rate. For under $30 for paperback at Amazon, there’s more than enough content to make you a better data scientist.</p>"
}