{
  "title": "Low interest rates: a transatlantic phenomenon",
  "link": "https://audioboom.com/posts/7819336",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2364,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>\n<a href=\"https://www.bruegel.org/author/maria-demertzis\">Maria Demertzis</a> and <a href=\"https://www.bruegel.org/author/nicola-viegi/\">Nicola Vegi </a>join <a href=\"https://www.bruegel.org/author/giuseppe-porcaro\">Giuseppe Porcaro</a> to talk about their <a href=\"https://www.bruegel.org/2021/03/low-interest-rates-in-europe-and-the-us-one-trend-two-stories/\">recent research</a> on low interest rates, declining productivity growth and how to tackle this.<br>\n<br>\n\n</div>\n<div>In both Europe and the United States, interest rates have been declining for more than fifteen years. For much of this period, real interest rates have been negative and they are expected to remain negative for at least another decade. The literature associates this decline in interest rates with a similarly protracted decline in productivity. But the decline in productivity appears paradoxical given major technological advances.<br>\n<br>\n\n</div>\n<div>The structural factors behind the downward pressure on interest rates imply that macroeconomic policy will have a reduced role in managing aggregate demand. Monetary policy in the euro area will be more about preventing financial fragmentation and less about stimulating demand. Equally, fiscal policy will have more of a supporting rather than stimulating role.<br>\n<br>\n\n</div>\n<div>Tackling the structural decline in market dynamism and therefore in real rates will require structural policies to reduce market power globally and ensure the creation of capital markets in the EU.</div>\n",
  "itunes:summary": "Structural factors are putting downward pressure on rates: is it time for macroeconomic policy to play second fiddle in managing demand?",
  "pubDate": "Wed, 10 Mar 2021 15:16:01 +0000",
  "guid": "tag:audioboom.com,2021-03-10:/posts/7819336",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}