{
  "title": "CATL And Vinfast Reach Global Strategic Cooperation To Promote Global E-Mobility",
  "link": "https://www.iaasiaonline.com/catl-and-vinfast-reach-global-strategic-cooperation-to-promote-global-e-mobility/",
  "dc:creator": "Tzelong",
  "pubDate": "Mon, 31 Oct 2022 08:52:15 +0000",
  "category": [
    "e-mobility",
    "electromobility",
    "Industry News",
    "Recent News",
    "CATL",
    "Vinfast"
  ],
  "guid": "https://www.iaasiaonline.com/?p=38722",
  "description": "<p>Catl And Vinfast Reach Global Strategic Cooperation To Promote Global E-Mobility Contemporary Amperex Technology Company (“CATL”) and VinFast Trading & Manufacturing Joint Stock Company (&#8220;VinFast&#8221;) announced a Memorandum of Understanding for Global Strategic Cooperation to expand collaboration in areas including CIIC (CATL integrated intelligent chassis) skateboard chassis products. The MOU signing ceremony is witnessed by &#8230;</p>\n<p class=\"read-more\"> <a class=\"\" href=\"https://www.iaasiaonline.com/catl-and-vinfast-reach-global-strategic-cooperation-to-promote-global-e-mobility/\"> <span class=\"screen-reader-text\">CATL And Vinfast Reach Global Strategic Cooperation To Promote Global E-Mobility</span> Read More &#187;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com/catl-and-vinfast-reach-global-strategic-cooperation-to-promote-global-e-mobility/\">CATL And Vinfast Reach Global Strategic Cooperation To Promote Global E-Mobility</a> appeared first on <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com\">IAA - Industrial Automation</a>.</p>\n",
  "content:encoded": "<p>Catl And Vinfast Reach Global Strategic Cooperation To Promote Global E-Mobility<span id=\"more-38722\"></span></p>\n<p>Contemporary Amperex Technology Company (“CATL”) and VinFast Trading & Manufacturing Joint Stock Company (&#8220;VinFast&#8221;) announced a Memorandum of Understanding for Global Strategic Cooperation to expand collaboration in areas including CIIC (CATL integrated intelligent chassis) skateboard chassis products.</p>\n<p>The MOU signing ceremony is witnessed by Dr. Robin Zeng, founder and Chairman of CATL, and Mr. Pham Nhat Vuong, Chairman of Vingroup and VinFast. According to the agreement, CATL and VinFast intend to explore various forms of cooperation on CIIC skateboard chassis on top of the current cooperation on battery supply with CTP (cell-to-pack) technology between the two companies, which will provide VinFast rapid access to the global market.</p>\n<p>CIIC skateboard chassis integrates battery packs, electric motors, and other critical units into a single layer at the bottom of the vehicle, lowering purchasing cost, vehicle weight and energy consumption while maximizing cabin space for optimal driving experiences.</p>\n<p>In addition to the collaboration on CTP batteries and skateboard chassis, CATL is poised to cooperate with VinFast with respect to other areas, thus promoting battery innovation and e-mobility transition.</p>\n<p>Madam Le Thi Thu Thuy, Vingroup Vice Chairwoman and VinFast Global CEO shared: “VinFast connects global intelligence to promote research and production of smart electric vehicles. Collaboration with CATL &#8211; a global leader of new energy innovative technologies &#8211; is the next development milestone of VinFast in applying advanced technology to enhance driving range and experience while offering competitive pricing, making smart electric vehicles more efficient and accessible to everyone.”</p>\n<p>By leveraging CATL’s cutting-edge batteries, VinFast’s innovative EVs will reach new heights in terms of range, safety, and intelligent driving. The cooperation will also enable CATL to enhance its global footprint, especially in emerging markets, and promote the application of new EV technologies.</p>\n<p>The elevated cooperation will enable both companies to promote innovation of battery technologies and global e-mobility, contributing to global drive for energy transition and carbon neutrality goals.</p>\n<p><!--more--></p>\n<p><strong><b>CLICK </b></strong><a href=\"https://www.iaasiaonline.com/industry-news/\"><strong><u><b>HERE</b></u></strong></a><strong><b> FOR LATEST NEWS.</b></strong></p>\n<p><strong><b>READ CURRENT AND PAST </b></strong><a href=\"https://www.iaasiaonline.com/magazine/\"><strong><u><b>ISSUES</b></u></strong></a><strong><b> OF IAA.</b></strong></p>\n<p><strong><b>KEEP YOURSELF UPDATED, </b></strong><a href=\"https://www.iaasiaonline.com/subscription/\"><strong><u><b>SUBSCRIBE</b></u></strong></a><strong><b> TO IAA NOW!</b></strong></p>\n<p><strong><b>AND DON’T FORGET FOLLOW US ON </b></strong><a href=\"https://www.facebook.com/IAAsia/\"><strong><u><b>FACEBOOK</b></u></strong></a><strong><b>,</b></strong><a href=\"https://www.linkedin.com/showcase/industrial-automation-asia/\"><strong><u><b> LINKEDIN</b></u></strong></a><strong><b> AND </b></strong><a href=\"https://twitter.com/IAA_Asia\"><strong><u><b>TWITTER!</b></u></strong></a></p>\n<p>&nbsp;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com/catl-and-vinfast-reach-global-strategic-cooperation-to-promote-global-e-mobility/\">CATL And Vinfast Reach Global Strategic Cooperation To Promote Global E-Mobility</a> appeared first on <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com\">IAA - Industrial Automation</a>.</p>\n"
}