{
  "id": "https://bibleinoneyear.org/en/youth/92",
  "title": "Day 92: It is All Yours",
  "description": "Proverbs 8:22–31, Numbers 33:53, 34:16–18, Luke 9:10–24.  God gave to his people in the Old Testament a wonderful vision of their potential *inheritance*  It is all yours in Christ Jesus",
  "pubDate": "Fri, 02 Apr 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/92/?ignore",
  "itunes:duration": "13:58",
  "guid": "enyouth02042021-92",
  "length": 838.61,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 92: It is All Yours",
  "itunes:subtitle": "Proverbs 8:22–31, Numbers 33:53, 34:16–18, Luke 9:10–24.  God gave to his people in the Old Testament a wonderful vision of their potential *inheritance*  It is all yours in Christ Jesus",
  "itunes:summary": "The Chelsea Flower Show may well be the most famous flower show in the world. It attracts visitors from all continents.\nThere are four grades of award presented, Gold, Silver-Gilt, Silver and Bronze. As well as awards for gardens and flowers, the Knightian award is for exhibits of vegetables.\nI once heard a man being interviewed about the fact that he was retiring after winning the gold medal for his vegetables for ten years in a row. Asked for the secret of his success, he said, ‘I aim for perfection. But I settle for excellence.’\n‘Aim for perfection’ (2 Corinthians 13:11), writes the apostle Paul. This is very different from ‘perfectionism’. Perfectionism is a personality trait characterised by striving for flawlessness. It leads to setting excessively high performance standards. Perfectionists are overly critical of themselves and constantly concerned about what others think of them. It leads to a fear of failure and making mistakes. It can lead to depression, anxiety and missed opportunities.\nGod’s people have always been called to aim high (while avoiding the dangers of perfectionism). God gave to his people in the Old Testament a wonderful vision of their potential inheritance. It is all yours in Christ Jesus.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 92
}