{
  "title": "Episode 114: &#8220;My Boy Lollipop&#8221; by Millie",
  "link": "https://500songs.com/podcast/episode-114-my-boy-lollipop-by-millie/",
  "pubDate": "Thu, 18 Feb 2021 15:56:23 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-114-my-boy-lollipop-by-millie/",
  "description": "This week's episode looks at \"My Boy Lollipop\" and the origins of ska music. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/47710216\">\"If You Wanna Be Happy\" by Jimmy Soul</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I have created&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-114-my-boy-lollipop/\">a Mixcloud playlist</a> containing every song heard in this episode -- a content warning applies for the song \"Bloodshot Eyes\" by Wynonie Harris.\n\nThe information about ska in general mostly comes from <a href=\"https://amzn.to/2OQLnlR\"><em>Bass Culture: When Reggae Was King</em> </a>by Lloyd Bradley, with some also from<a href=\"https://amzn.to/2ZvPEwW\">&nbsp;<em>Reggae and Caribbean Music</em></a> by Dave Thompson.\n\nBiographical information on Millie Small is largely from <a href=\"https://recordcollectormag.com/articles/millie-small-the-lollipop-girl\">this article in Record Collector</a>, plus a paywalled interview with Goldmine magazine (which I won't link to because of the paywall).\n\nMillie's early recordings with Owen Gray and Coxsone Dodd can be found on <a href=\"https://amzn.to/3axI3V0\">this compilation</a>, along with a good selection of other recordings Dodd produced, while <a href=\"https://amzn.to/3av9peo\">this compilation</a> gives a good overview of her recordings for Island and Fontana.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Erratum</strong>\n\nI refer to \"Barbara Gaye\" when I should say \"Barbie Gaye\"\n\n<strong>Transcript</strong>\n\nToday, we're going to take our first look at a form of music that would go on to have an almost incalculable influence on the music of the seventies, eighties, and later, but which at the time we're looking at was largely regarded as a novelty music, at least in Britain and America. We're going to look at the birth of ska, and at the first ska record to break big outside of Jamaica. We're going to look at \"My Boy Lollipop\" by Millie:\n\n[Excerpt: Millie, \"My Boy Lollipop\"]\n\nMost of the music we've looked at so far in the podcast has been from either America or Britain, and I'm afraid that that's going to remain largely the case -- while there has been great music made in every country in the world, American and British musicians have tended to be so parochial, and have dominated the music industry so much, that relatively little of that music has made itself felt widely enough to have any kind of impact on the wider history of rock music, much to rock's detriment.\n\nBut every so often something from outside the British Isles or North America manages to penetrate even the closed ears of Anglo-American musicians, and today we're going to look at one of those records.\n\nNow, before we start this, this episode is, by necessity, going to be dealing in broad generalisations -- I'm trying to give as much information about Jamaica's musical culture in one episode as I've given about America's in a hundred, so I am going to have to elide a lot of details. Some of those details will come up in future episodes, as we deal with more Jamaican artists, but be aware that I'm missing stuff out.\n\nThe thing that needs to be understood about the Jamaican music culture of the fifties and early sixties is that it developed in conditions of absolute poverty. Much of the music we looked at in the first year or so of the podcast came from extremely impoverished communities, of course, but even given how utterly, soul-crushingly, poor many people in the Deep South were, or the miserable conditions that people in Liverpool and London lived in while Britain was rebuilding itself after the war, those people were living in rich countries, and so still had access to some things that were not available to the poor people of poorer countries.\n\nSo in Jamaica in the 1950s, almost nobody had access to any kind of record player or radio themselves. You wouldn't even *know* anyone who had one, unlike in the states where if you were very poor you might not have one yourself, but your better-off cousin might let you come round and listen to the radio &nbsp;at their house. So music was, by necessity, a communal experience.\n\nJamaican music, or at least the music in Kingston, the biggest city in Jamaica, was organised around &nbsp;sound systems -- big public open-air systems run by DJs, playing records for dancing. These had originally started in shops as a way of getting customers in, but soon became so popular that people started doing them on their own. These sound systems played music that was very different from the music played on the radio, which was aimed mostly at people rich enough to own radios, which at that time mostly meant white British people -- in the fifties, Jamaica was still part of the British Empire, and there was an extraordinary gap between the music the white British colonial class liked and the music that the rest of the population liked.\n\nThe music that the Jamaican population *made* was mostly a genre called mento. Now, this is somewhere where my ignorance of this music compared to other musics comes into play a bit. There seem to have been two genres referred to as mento. One of them, rural mento, was based around instruments like the banjo, and a home-made bass instrument called a \"rhumba box\", and had a resemblance to a lot of American country music or British skiffle -- this form of mento is often still called \"country music\" in Jamaica itself:\n\n[Excerpt: The Hiltonaires, \"Matilda\"]\n\nThere was another variant of mento, urban mento, which dropped the acoustic and home-made instruments and replaced them with the same sort of instruments that R&B or jazz bands used. Everything I read about urban mento says that it's a different genre from calypso music, which generally comes from Trinidad and Tobago rather than Jamaica, but nothing explains what that difference is, other than the location. Mento musicians would also call their music calypso in order to sell it to people like me who don't know the difference, and so you would get mento groups called things like Count Lasher and His Calypsonians, Lord Lebby and the Jamaica Calypsonians, and Count Owen and His Calypsonians, songs called things like \"Hoola Hoop Calypso\", and mentions of calypso in the lyrics.\n\nI am fairly familiar with calypso music -- people like the Mighty Sparrow, Lord Melody, Roaring Lion, and so on -- and I honestly can't hear any difference between calypso proper and mento records like this one, by Lord Power and Trenton Spence:\n\n[Excerpt: Lord Power and Trenton Spence, \"Strip Tease\"]\n\nBut I'll defer to the experts in these genres and accept that there's a difference I'm not hearing. Mento was primarily a music for live performance, at least at first -- there were very few recording facilities in Jamaica, and to the extent that records were made at all there, they were mostly done in very small runs to sell to tourists, who wanted a souvenir to take home.\n\nThe music that the first sound systems played would include some mento records, and they would also play a fair number of latin-flavoured records. But the bulk of what they played was music for dancing, imported from America, made by Black American musicians, many of them the same musicians we looked at in the early months of this podcast. Louis Jordan was a big favourite, as was Wynonie Harris -- the biggest hit in the early years of the sound systems was Harris' \"Bloodshot Eyes\". I'm going to excerpt that here, because it was an important record in the evolution of Jamaican music, but be warned that the song trivialises intimate partner violence in a way that many people might find disturbing. If you might be upset by that, skip forward exactly thirty seconds now:\n\n[Excerpt: Wynonie Harris, \"Bloodshot Eyes\"]\n\nThe other artists who get repeatedly named in the histories of the early sound systems along with Jordan and Harris are Fats Domino, Lloyd Price, Professor Longhair -- a musician we've not talked about in the podcast, but who made New Orleans R&B music in the same style as Domino and Price, and for slow-dancing the Moonglows and Jesse Belvin. They would also play jazz -- Dizzy Gillespie, Duke Ellington, and Sarah Vaughan were particular favourites.\n\nThese records weren't widely available in Jamaica -- indeed, *no* records were really widely available . They found their way into Jamaica through merchant seamen, who would often be tasked by sound men with getting hold of new and exciting records, and paid with rum or marijuana. The \"sound man\" was the term used for the DJs who ran these sound systems, and they were performers as much as they were people who played records -- they would talk and get the crowds going, they would invent dance steps and perform them, and they would also use the few bits of technology they had to alter the sound -- usually by adding bass or echo. Their reputation was built by finding the most obscure records, but ones which the crowds would love. Every sound man worth his salt had a collection of records that nobody else had -- if you were playing the same records that someone else had, you were a loser. As soon as a sound man got hold of a record, he'd scratch out all the identifying copy on the label and replace it with a new title, so that none of his rivals could get hold of their own copies.\n\nThe rivalry between sound men could be serious -- it started out just as friendly competition, with each man trying to build a bigger and louder system and draw a bigger crowd, but when the former policeman turned gangster Duke Reid started up his Trojan sound system, intimidating rivals with guns soon became par for the course. Reid had actually started out in music as an R&B radio DJ -- one of the few in Jamaica -- presenting a show whose theme song, Tab Smith's \"My Mother's Eyes\", would become permanently identified with Reid:\n\n[Excerpt: Tab Smith, \"My Mother's Eyes\"]\n\nReid's Trojan was one of the two biggest sound systems in Kingston, the other being Downbeat, run by Coxsone Dodd. Dodd's system became so popular that he ended up having five different sound systems, all playing in different areas of the city every night, with the ones he didn't perform at himself being run by assistants who later became big names in the Jamaican music world themselves, like Prince Buster and Lee \"Scratch\" Perry.\n\nBuster performed a few other functions for Dodd as well -- one important one being that he &nbsp;knew enough about R&B that he could go to Duke Reid's shows, listen to the records he was playing, and figure out what they must be -- he could recognise the different production styles of the different R&B labels well enough that he could use that, plus the lyrics, to work out the probable title and label of a record Reid was playing. Dodd would then get a merchant seaman to bring a copy of that record back from America, get a local record pressing plant to press up a bunch of copies of it, and sell it to the other sound men, thus destroying Reid's edge.\n\nEventually Prince Buster left Dodd and set up his own rival sound system, at which point the rivalry became a three-way one. Dodd knew about technology, and had the most powerful sound system with the best amps. Prince Buster was the best showman, who knew what the people wanted and gave it to them, and Duke Reid was connected and powerful enough that he could use intimidation to keep a grip on power, but he also had good enough musical instincts that his shows were genuinely popular in their own right. People started to see their favourite sound systems in the same way they see sports teams or political parties -- as marks of identity that were worth getting into serious fights over. Supporters of one system would regularly attack supporters of another, and who your favourite sound system was *really mattered*.\n\nBut there was a problem. While these systems were playing a handful of mento records, they were mostly relying on American records, and this had two problems. The most obvious was that if a record was available publicly, eventually someone else would find it. Coxsone Dodd managed to use one record, \"Later For Gator\" by Willis \"Gatortail\" Jackson, at every show for seven years, renaming it \"Coxsone Hop\":\n\n[Excerpt: Willis \"Gatortail\" Jackson, \"Later For Gator\"]\n\nBut eventually word got out that Duke Reid had tracked the song down and would play it at a dance. Dodd went along, and was allowed in unmolested -- Reid wanted Dodd to know he'd been beaten.\n\nNow, here I'm going to quote something Prince Buster said, and we hit a problem we're likely to hit again when it comes to Jamaica. Buster spoke Jamaican Patois, a creole language that is mutually intelligible with, but different from, standard English. When quoting him, or any other Patois speaker, I have a choice of three different options, all bad. I could translate his words into standard English, thus misrepresenting him; I could read his words directly in my own accent, which has the problem that it can sound patronising, or like I'm mocking his language, because so much of Patois is to do with the way the words are pronounced; or I could attempt to approximate his own accent -- which would probably come off as incredibly racist. As the least bad option of the three, I'm choosing the middle one here, and reading in my own accent, but I want people to be aware that this is not intended as mockery, and that I have at least given this some thought:\n\n\"So we wait. Then as the clock struck midnight we hear “Baaap… bap da dap da dap, daaaa da daap!” And we see a bunch of them down from the dancehall coming up with the green bush. I was at the counter with Coxsone, he have a glass in him hand, he drop it and just collapse, sliding down the bar. I had to brace him against the bar, then get Phantom to give me a hand. The psychological impact had knocked him out. Nobody never hit him.\"\n\nThere was a second problem with using American records, as well -- American musical tastes were starting to change, and Jamaican ones weren't. Jamaican audiences wanted Louis Jordan, Fats Domino, and Gene & Eunice, but the Americans wanted Elvis and Jerry Lee Lewis and Bobby Darin. For a while, the sound men were able to just keep finding more and more obscure old R&B and jump band records, but there was a finite supply of these, and they couldn't keep doing it forever.\n\nThe solution eventually became obvious -- they needed Jamaican R&B. And thankfully there was a ready supply. Every week, there was a big talent contest in Kingston, and the winners would get five pounds -- a lot of money in that time and place. Many of the winners would then go to a disc-cutting service, one of those places that would record a single copy of a song for you, and use their prize money to record themselves. They could then sell that record to one of the sound men, who would be sure that nobody else would have a copy of it.\n\nAt first, the only sound men they could sell to were the less successful ones, who didn't have good connections with American records. A local record was clearly not as good as an American one, and so the big sound systems wouldn't touch it, but it was better than nothing, and some of the small sound systems would find that the local records were a success for them, and eventually the bigger systems would start using the small ones as a test audience -- if a local record went down well at a small system, one of the big operators would get in touch with the sound man of that system and buy the record from him.\n\nOne of the big examples of this was \"Lollipop Girl\", a song by Derrick Harriott and Claudie Sang. They recorded that, with just a piano backing, and sold their only copy to a small sound system owner. It went down so well that the small sound man traded his copy with Coxsone Dodd for an American record -- and it went down so well when Dodd played it that Duke Reid bribed one of Dodd's assistants to get hold of Dodd's copy long enough to get a copy made for himself. When Dodd and Reid played a sound clash -- a show where they went head to head to see who could win a crowd over -- and Reid played his own copy of \"Lollipop Girl\", Dodd pulled a gun on Reid, and it was only the fact that the clash was next door to the police station that kept the two men from killing each other.\n\nReid eventually wore out his copy of \"Lollipop Girl\", he played it so much, and so he did the only sensible thing -- he went into the record business himself, and took Harriott into the studio, along with a bunch of musicians from the local big bands, and cut a new version of it with a full band backing Harriott. As well as playing this on his sound system, Reid released it as a record:\n\n[Excerpt: Derrick Harriott, \"Lollipop Girl\"]\n\nReid didn't make many more records at this point, but both Coxsone Dodd and Prince Buster started up their own labels, and started hiring local singers, plus people from a small pool of players who became the go-to session musicians for any record made in Jamaica at the time, like trombone player Rico Rodriguez and guitarist Ernest Ranglin.\n\nDuring the late 1950s, a new form of music developed from these recordings, which would become known as ska, and there are three records which are generally considered to be milestones in its development. The first was produced by a white businessman, Edward Seaga, who is now more famous for becoming the Prime Minister of Jamaica in the 1980s. At the time, though, Seaga had the idea to incorporate a little bit of a mento rhythm into an R&B record he was producing. In most music, if you have a four-four rhythm, you can divide it into eight on-beats and off-beats, and you normally stress the on-beats, so you stress \"ONE and TWO and THREE and FOUR and\". In mento, though, you'd often have a banjo stress the off-beats, so the stresses would be \"one AND two AND three AND four AND\".\n\nSeaga had the guitarist on \"Manny Oh\" by Higgs and Wilson do this, on a track that was otherwise a straightforward New Orleans style R&B song with a tresillo bassline. The change in stresses is almost imperceptible to modern ears, but it made the record sound uniquely Jamaican to its audience:\n\n[Excerpt: Higgs and Wilson, \"Manny Oh\"]\n\nThe next record in the sequence was produced by Dodd, and is generally considered the first real ska record. There are a few different stories about where the term \"ska\" came from, but one of the more believable is that it came from Dodd directing Ernest Ranglin, who was the arranger for the record, to stress the off-beat more, saying \"play it ska... ska... ska...\"\n\nWhere \"Manny Oh\" had been a Jamaican sounding R&B record, \"Easy Snappin'\" is definitely a blues-influenced ska record:\n\n[Excerpt: Theo Beckford, \"Easy Snappin'\"]\n\nBut Duke Reid and Coxsone Dodd, at this point, still saw the music they were making as a substitute for American R&B. Prince Buster, on the other hand, by this point was a full-fledged Black nationalist, and wanted to make a purely Jamaican music. Buster was, in particular, an adherent of the Rastafari religion, and he brought in five drummers from the Rasta Nyabinghi tradition, most notably Count Ossie, who became the single most influential drummer in Jamaica, to record on the Folkes brothers single \"Oh Carolina\", incorporating the rhythms of Rasta sacred music into Jamaican R&B for the first time:\n\n[Excerpt: The Folkes Brothers, \"Oh Carolina\"]\n\n1962 was a turning point in Jamaican music in a variety of ways. Most obviously, it was the year that Jamaica became independent from the British Empire, and was able to take control of its own destiny. But it was also the year that saw the first recordings of a fourteen-year-old girl who would become ska's first international star.\n\nMillie Small had started performing at the age of twelve, when she won the Vere Johns Opportunity Hour, the single biggest talent contest in Kingston. But it was two years later that she came to the attention of Coxsone Dodd, who was very interested in her because her voice sounded spookily like that of Shirley, from the duo Shirley and Lee.\n\nWe mentioned Shirley and Lee briefly back in the episode on \"Ko Ko Mo\", but they were a New Orleans R&B duo who had a string of hits in the early and mid fifties, recorded at Cosimo Matassa's studio, pairing Leonard Lee's baritone voice with Shirley Goodman's soprano. Their early records had been knock-offs of the sound that Little Esther had created with Johnny Otis and his male vocalists -- for example Shirley and Lee's \"Sweethearts\":\n\n[Excerpt: Shirley and Lee, \"Sweethearts\"]\n\nbears a very strong resemblance to \"Double-Crossing Blues\":\n\n[Excerpt: Little Esther, Johnny Otis, and the Robins, \"Double-Crossing Blues\"]\n\nBut they'd soon developed a more New Orleans style, with records like \"Feel So Good\" showing some of the Caribbean influence that many records from the area had:\n\n[Excerpt: Shirley and Lee, \"Feel So Good\"]\n\nShirley and Lee only had minor chart success in the US, but spawned a host of imitators, including Gene and Eunice and Mickey and Sylvia, both of whom we looked at in the early months of the podcast, and Ike and Tina Turner who will be coming up later. Like much New Orleans R&B, Shirley and Lee were hugely popular among the sound system listeners, and Coxsone Dodd thought that Mille's voice sounded enough like Shirley's that it would be worth setting her up as part of his own Shirley and Lee soundalike duo, pairing her with a more established singer, Owen Gray, to record songs like \"Sit and Cry\", a song which combined the vocal sound of Shirley and Lee with the melody of \"The Twist\":\n\n[Excerpt: Owen and Millie, \"Sit and Cry\"]\n\nAfter Gray decided to continue performing on his own, Millie was instead teamed with another performer, Roy Panton, and \"We'll Meet\" by Roy and Millie went to number one in Jamaica:\n\n[Excerpt: Roy and Millie, \"We'll Meet\"]\n\nMeanwhile, in the UK, there was a growing interest in music from the Caribbean, especially Jamaica. Until very recently, Britain had been a very white country -- there have always been Black people in the UK, especially in port towns, but there had been very few. As of 1950, there were only about twenty thousand people of colour living in the UK. But starting in 1948, there had been a massive wave of immigration from other parts of what was then still the British Empire, as the government encouraged people to come here to help rebuild the country after the war. By 1961 there were nearly two hundred thousand Black people in Britain, almost all of them from the Caribbean.\n\nThose people obviously wanted to hear the music of their own culture, and one man in particular was giving it to them.\n\nChris Blackwell was a remarkably privileged man. His father had been one of the heirs to the Crosse and Blackwell fortune, and young Chris had been educated at Harrow, but when not in school he had spent much of his youth in Jamaica. His mother, Blanche, lived in Jamaica, where she was a muse to many men -- Noel Coward based a character on her, in a play he wrote in 1956 but which was considered so scandalous that it wasn't performed in public until 2012. Blanche attended the premiere of that play, when she was ninety-nine years old. She had an affair with Errol Flynn, and was also Ian Fleming's mistress -- Fleming would go to his Jamaican villa, GoldenEye, every year to write, leaving his wife at home (where she was having her own affairs, with the Labour MPs Hugh Gaitskell and Roy Jenkins), and would hook up with Blanche while he was there -- according to several sources, Fleming based the characters of Pussy Galore and Honeychile Ryder on Blanche. After Fleming's death, his wife instructed the villa's manager that it could be rented to literally anyone except Blanche Blackwell, but in the mid-1970s it was bought by Bob Marley, who in turn sold it to Chris Blackwell.\n\nChris Blackwell had developed a fascination with Rasta culture after having crashed his boat while sailing, and being rescued by some Rasta fishermen, and he had decided that his goal was to promote Jamaican culture to the world. He'd started his own labels, Island Records, in 1959, using his parents' money, and had soon produced a Jamaican number one, \"Boogie in My Bones\", by Laurel Aitken:\n\n[Excerpt: Laurel Aitken, \"Boogie in My Bones\"]\n\nBut music was still something of a hobby with Blackwell, to the point that he nearly quit it altogether in 1962. He'd been given a job as a gopher on the first James Bond film, Dr. No, thanks to his family connections, and had also had a cameo role in the film. Harry Saltzman, the producer, offered him a job, but Blackwell went to a fortune teller who told him to stick with music, and he did.\n\nSoon after that, he moved back to England, where he continued running Island Records, this time as a distributor of Jamaican records. The label would occasionally record some tracks of its own, but it made its money from releasing Jamaican records, which Blackwell would hand-sell to local record shops around immigrant communities in London, Manchester, and Birmingham.\n\nIsland was not the biggest of the labels releasing Jamaican music in Britain at the time -- there was another label, Blue Beat, which got most of the big records, and which was so popular that in Britain \"bluebeat\" became a common term for ska, used to describe the whole genre, in the same way as Motown might be. And ska was becoming popular enough that there was also local ska being made, by Jamaican musicians living in Britain, and it was starting to chart. The first ska record to hit the charts in Britain was a cover of a Jimmy Cliff song, \"King of Kings\", performed by Ezz Reco and the Launchers:\n\n[Excerpt: Ezz Reco and the Launchers, \"King of Kings\"]\n\nThat made the lower reaches of the top forty, and soon after came \"Mockingbird Hill\", a ska remake of an old Les Paul and Mary Ford hit, recorded by the Migil Five, a white British R&B group whose main claim to fame was that one of them was Charlie Watts' uncle, and Watts had occasionally filled in on drums for them before joining the Rolling Stones:\n\n[Excerpt: Migil Five, \"Mockingbird Hill\"]\n\nThat made the top ten. Ska was becoming the in sound in Britain, to the point that in March 1964, the same month that \"Mockingbird Hill\" was released, the Beatles made a brief detour into ska in the instrumental break to \"I Call Your Name\":\n\n[Excerpt: The Beatles, \"I Call Your Name\"]\n\nAnd it was into this atmosphere that Chris Blackwell decided to introduce Millie. Her early records had been selling well enough for him that in 1963 he had decided to call Millie's mother and promise her that if her daughter came over to the UK, he would be able to make her into a star. Rather than release her records on Island, which didn't have any wide distribution, he decided to license them to Fontana, a mid-sized British label.\n\nMillie's first British single, \"Don't You Know\", was released in late 1963, and was standard British pop music of the time, with little to distinguish it, and so unsurprisingly it wasn't a hit:\n\n[Excerpt: Millie, \"Don't You Know\"]\n\nBut the second single was something different. For that, Blackwell remembered a song that had been popular among the sound systems a few years earlier; an American record by a white singer named Barbara Gaye. Up to this point, Gaye's biggest claim to fame had been that Ellie Greenwich had liked this record enough that she'd briefly performed under the stage name Ellie Gaye, before deciding against that.\n\n\"My Boy Lollipop\" had been written by Robert Spencer of the Cadillacs, the doo-wop group whose biggest hit had been \"Speedoo\":\n\n[Excerpt: The Cadillacs, \"Speedoo\"]\n\nSpencer had written “My Boy Lollipop”, but lost the rights to it in a card game -- and then Morris Levy bought the rights from the winner for a hundred dollars. Levy changed the songwriting credit to feature a mob acquaintance of his, Johnny Roberts, and then passed the song to Gaetano Vastola, another mobster, who had it recorded by Gaye, a teenage girl he managed, with the backing provided by the normal New York R&B session players, like Big Al Sears and Panama Francis:\n\n[Excerpt: Barbie Gaye, \"My Boy Lollipop\"]\n\nThat hadn't been a hit when it was released in 1956, but it had later been picked up by the Jamaican sound men, partly because of its resemblance to the ska style, and Blackwell had a tape recording of it. Blackwell got Ernest Ranglin, who had also worked on Dr. No, and who had moved over to the UK at the same time as Blackwell, to come up with an arrangement, and Ranglin hired a local band to perform the instrumental backing. That band, Jimmy Powell and the Five Dimensions, had previously been known as the Moontrekkers, and had worked with Joe Meek, recording \"Night of the Vampire\":\n\n[Excerpt: The Moontrekkers, \"Night of the Vampire\"]\n\nRanglin replaced the saxophone solo from the original record with a harmonica solo, to fit the current fad for the harmonica in the British charts, and there is some dispute about who played it, but Millie always insisted that it was the Five Dimensions' harmonica player, Rod Stewart, though Stewart denies it:\n\n[Excerpt: Millie, \"My Boy Lollipop\"]\n\n\"My Boy Lollipop\" came out in early 1964 and became a massive hit, reaching number two on the charts both in the UK and the US, and Millie was now a star. She got her own UK TV special, as well as appearing on Around The Beatles, a special starring the Beatles and produced by Jack Good. She was romantically linked to Peter Asher of Peter and Gordon. Her next single, though, \"Sweet William\", only made number thirty, as the brief first wave of interest in ska among the white public subsided:\n\n[Excerpt: Millie, \"Sweet William\"]\n\nOver the next few years, there were many attempts made to get her back in the charts, but the last thing that came near was a remake of \"Bloodshot Eyes\", without the intimate partner violence references, which made number forty-eight on the UK charts at the end of 1965:\n\n[Excerpt: Millie, \"Bloodshot Eyes\"]\n\nShe was also teamed with other artists in an attempt to replicate her success as a duet act. She recorded with Jimmy Cliff:\n\n[Excerpt: Millie and Jimmy Cliff, \"Hey Boy, Hey Girl\"]\n\nand Jackie Edwards:\n\n[Excerpt: Jackie and Millie, \"Pledging My Love\"]\n\nand she was also teamed with a rock group Blackwell had discovered, and who would soon become big stars themselves with versions of songs by Edwards, on a cover version of Ike and Tina Turner's \"I'm Blue (the Gong Gong Song)\":\n\n[Excerpt: The Spencer Davis Group, \"I'm Blue (The Gong Gong Song)\"]\n\nBut the Spencer Davis Group didn't revive her fortunes, and she moved on to a succession of smaller labels, with her final recordings coming in the early 1970s, when she recorded the track \"Enoch Power\", in response to the racism stirred up by the right-wing politician Enoch Powell:\n\n[Excerpt: Millie Small, \"Enoch Power\"]\n\nMillie spent much of the next few decades in poverty. There was talk of a comeback in the early eighties, after the British ska revival group Bad Manners had a top ten hit with a gender-flipped remake of \"My Boy Lollipop\":\n\n[Excerpt: Bad Manners, \"My Girl Lollipop\"]\n\nBut she never performed again after the early seventies, and other than one brief interview in 2016 she kept her life private. She was given multiple honours by the people of Jamaica, including being made a Commander in the Order of Distinction, but never really got any financial benefit from her enormous chart success, or from being the first Jamaican artist to make an impact on Britain and America. She died last year, aged seventy-two.",
  "itunes:subtitle": "This weeks episode looks at My Boy Lollipop and the origins of ska music. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on If You Wann",
  "itunes:keywords": "calypso,Chris Blackwell,Coxsone Dodd,Duke Reid,Ernest Ranglin,Ian Fleming,James Bond,Joe Meek,Lee \"Scratch\" Perry,mento,Millie,Millie Small,Morris Levy,Prince Buster,reggae,Rod Stewart,Shirley and Lee,ska,The Beatles,The Cadillacs,Wynonie Harris",
  "itunes:episodeType": "full",
  "itunes:episode": 114,
  "content:encoded": "This week's episode looks at \"My Boy Lollipop\" and the origins of ska music. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/47710216\">\"If You Wanna Be Happy\" by Jimmy Soul</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I have created&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-114-my-boy-lollipop/\">a Mixcloud playlist</a> containing every song heard in this episode -- a content warning applies for the song \"Bloodshot Eyes\" by Wynonie Harris.\n\nThe information about ska in general mostly comes from <a href=\"https://amzn.to/2OQLnlR\"><em>Bass Culture: When Reggae Was King</em> </a>by Lloyd Bradley, with some also from<a href=\"https://amzn.to/2ZvPEwW\">&nbsp;<em>Reggae and Caribbean Music</em></a> by Dave Thompson.\n\nBiographical information on Millie Small is largely from <a href=\"https://recordcollectormag.com/articles/millie-small-the-lollipop-girl\">this article in Record Collector</a>, plus a paywalled interview with Goldmine magazine (which I won't link to because of the paywall).\n\nMillie's early recordings with Owen Gray and Coxsone Dodd can be found on <a href=\"https://amzn.to/3axI3V0\">this compilation</a>, along with a good selection of other recordings Dodd produced, while <a href=\"https://amzn.to/3av9peo\">this compilation</a> gives a good overview of her recordings for Island and Fontana.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Erratum</strong>\n\nI refer to \"Barbara Gaye\" when I should say \"Barbie Gaye\"\n\n<strong>Transcript</strong>\n\nToday, we're going to take our first look at a form of music that would go on to have an almost incalculable influence on the music of the seventies, eighties, and later, but which at the time we're looking at was largely regarded as a novelty music, at least in Britain and America. We're going to look at the birth of ska, and at the first ska record to break big outside of Jamaica. We're going to look at \"My Boy Lollipop\" by Millie:\n\n[Excerpt: Millie, \"My Boy Lollipop\"]\n\nMost of the music we've looked at so far in the podcast has been from either America or Britain, and I'm afraid that that's going to remain largely the case -- while there has been great music made in every country in the world, American and British musicians have tended to be so parochial, and have dominated the music industry so much, that relatively little of that music has made itself felt widely enough to have any kind of impact on the wider history of rock music, much to rock's detriment.\n\nBut every so often something from outside the British Isles or North America manages to penetrate even the closed ears of Anglo-American musicians, and today we're going to look at one of those records.\n\nNow, before we start this, this episode is, by necessity, going to be dealing in broad generalisations -- I'm trying to give as much information about Jamaica's musical culture in one episode as I've given about America's in a hundred, so I am going to have to elide a lot of details. Some of those details will come up in future episodes, as we deal with more Jamaican artists, but be aware that I'm missing stuff out.\n\nThe thing that needs to be understood about the Jamaican music culture of the fifties and early sixties is that it developed in conditions of absolute poverty. Much of the music we looked at in the first year or so of the podcast came from extremely impoverished communities, of course, but even given how utterly, soul-crushingly, poor many people in the Deep South were, or the miserable conditions that people in Liverpool and London lived in while Britain was rebuilding itself after the war, those people were living in rich countries, and so still had access to some things that were not available to the poor people of poorer countries.\n\nSo in Jamaica in the 1950s, almost nobody had access to any kind of record player or radio themselves. You wouldn't even *know* anyone who had one, unlike in the states where if you were very poor you might not have one yourself, but your better-off cousin might let you come round and listen to the radio &nbsp;at their house. So music was, by necessity, a communal experience.\n\nJamaican music, or at least the music in Kingston, the biggest city in Jamaica, was organised around &nbsp;sound systems -- big public open-air systems run by DJs, playing records for dancing. These had originally started in shops as a way of getting customers in, but soon became so popular that people started doing them on their own. These sound systems played music that was very different from the music played on the radio, which was aimed mostly at people rich enough to own radios, which at that time mostly meant white British people -- in the fifties, Jamaica was still part of the British Empire, and there was an extraordinary gap between the music the white British colonial class liked and the music that the rest of the population liked.\n\nThe music that the Jamaican population *made* was mostly a genre called mento. Now, this is somewhere where my ignorance of this music compared to other musics comes into play a bit. There seem to have been two genres referred to as mento. One of them, rural mento, was based around instruments like the banjo, and a home-made bass instrument called a \"rhumba box\", and had a resemblance to a lot of American country music or British skiffle -- this form of mento is often still called \"country music\" in Jamaica itself:\n\n[Excerpt: The Hiltonaires, \"Matilda\"]\n\nThere was another variant of mento, urban mento, which dropped the acoustic and home-made instruments and replaced them with the same sort of instruments that R&B or jazz bands used. Everything I read about urban mento says that it's a different genre from calypso music, which generally comes from Trinidad and Tobago rather than Jamaica, but nothing explains what that difference is, other than the location. Mento musicians would also call their music calypso in order to sell it to people like me who don't know the difference, and so you would get mento groups called things like Count Lasher and His Calypsonians, Lord Lebby and the Jamaica Calypsonians, and Count Owen and His Calypsonians, songs called things like \"Hoola Hoop Calypso\", and mentions of calypso in the lyrics.\n\nI am fairly familiar with calypso music -- people like the Mighty Sparrow, Lord Melody, Roaring Lion, and so on -- and I honestly can't hear any difference between calypso proper and mento records like this one, by Lord Power and Trenton Spence:\n\n[Excerpt: Lord Power and Trenton Spence, \"Strip Tease\"]\n\nBut I'll defer to the experts in these genres and accept that there's a difference I'm not hearing. Mento was primarily a music for live performance, at least at first -- there were very few recording facilities in Jamaica, and to the extent that records were made at all there, they were mostly done in very small runs to sell to tourists, who wanted a souvenir to take home.\n\nThe music that the first sound systems played would include some mento records, and they would also play a fair number of latin-flavoured records. But the bulk of what they played was music for dancing, imported from America, made by Black American musicians, many of them the same musicians we looked at in the early months of this podcast. Louis Jordan was a big favourite, as was Wynonie Harris -- the biggest hit in the early years of the sound systems was Harris' \"Bloodshot Eyes\". I'm going to excerpt that here, because it was an important record in the evolution of Jamaican music, but be warned that the song trivialises intimate partner violence in a way that many people might find disturbing. If you might be upset by that, skip forward exactly thirty seconds now:\n\n[Excerpt: Wynonie Harris, \"Bloodshot Eyes\"]\n\nThe other artists who get repeatedly named in the histories of the early sound systems along with Jordan and Harris are Fats Domino, Lloyd Price, Professor Longhair -- a musician we've not talked about in the podcast, but who made New Orleans R&B music in the same style as Domino and Price, and for slow-dancing the Moonglows and Jesse Belvin. They would also play jazz -- Dizzy Gillespie, Duke Ellington, and Sarah Vaughan were particular favourites.\n\nThese records weren't widely available in Jamaica -- indeed, *no* records were really widely available . They found their way into Jamaica through merchant seamen, who would often be tasked by sound men with getting hold of new and exciting records, and paid with rum or marijuana. The \"sound man\" was the term used for the DJs who ran these sound systems, and they were performers as much as they were people who played records -- they would talk and get the crowds going, they would invent dance steps and perform them, and they would also use the few bits of technology they had to alter the sound -- usually by adding bass or echo. Their reputation was built by finding the most obscure records, but ones which the crowds would love. Every sound man worth his salt had a collection of records that nobody else had -- if you were playing the same records that someone else had, you were a loser. As soon as a sound man got hold of a record, he'd scratch out all the identifying copy on the label and replace it with a new title, so that none of his rivals could get hold of their own copies.\n\nThe rivalry between sound men could be serious -- it started out just as friendly competition, with each man trying to build a bigger and louder system and draw a bigger crowd, but when the former policeman turned gangster Duke Reid started up his Trojan sound system, intimidating rivals with guns soon became par for the course. Reid had actually started out in music as an R&B radio DJ -- one of the few in Jamaica -- presenting a show whose theme song, Tab Smith's \"My Mother's Eyes\", would become permanently identified with Reid:\n\n[Excerpt: Tab Smith, \"My Mother's Eyes\"]\n\nReid's Trojan was one of the two biggest sound systems in Kingston, the other being Downbeat, run by Coxsone Dodd. Dodd's system became so popular that he ended up having five different sound systems, all playing in different areas of the city every night, with the ones he didn't perform at himself being run by assistants who later became big names in the Jamaican music world themselves, like Prince Buster and Lee \"Scratch\" Perry.\n\nBuster performed a few other functions for Dodd as well -- one important one being that he &nbsp;knew enough about R&B that he could go to Duke Reid's shows, listen to the records he was playing, and figure out what they must be -- he could recognise the different production styles of the different R&B labels well enough that he could use that, plus the lyrics, to work out the probable title and label of a record Reid was playing. Dodd would then get a merchant seaman to bring a copy of that record back from America, get a local record pressing plant to press up a bunch of copies of it, and sell it to the other sound men, thus destroying Reid's edge.\n\nEventually Prince Buster left Dodd and set up his own rival sound system, at which point the rivalry became a three-way one. Dodd knew about technology, and had the most powerful sound system with the best amps. Prince Buster was the best showman, who knew what the people wanted and gave it to them, and Duke Reid was connected and powerful enough that he could use intimidation to keep a grip on power, but he also had good enough musical instincts that his shows were genuinely popular in their own right. People started to see their favourite sound systems in the same way they see sports teams or political parties -- as marks of identity that were worth getting into serious fights over. Supporters of one system would regularly attack supporters of another, and who your favourite sound system was *really mattered*.\n\nBut there was a problem. While these systems were playing a handful of mento records, they were mostly relying on American records, and this had two problems. The most obvious was that if a record was available publicly, eventually someone else would find it. Coxsone Dodd managed to use one record, \"Later For Gator\" by Willis \"Gatortail\" Jackson, at every show for seven years, renaming it \"Coxsone Hop\":\n\n[Excerpt: Willis \"Gatortail\" Jackson, \"Later For Gator\"]\n\nBut eventually word got out that Duke Reid had tracked the song down and would play it at a dance. Dodd went along, and was allowed in unmolested -- Reid wanted Dodd to know he'd been beaten.\n\nNow, here I'm going to quote something Prince Buster said, and we hit a problem we're likely to hit again when it comes to Jamaica. Buster spoke Jamaican Patois, a creole language that is mutually intelligible with, but different from, standard English. When quoting him, or any other Patois speaker, I have a choice of three different options, all bad. I could translate his words into standard English, thus misrepresenting him; I could read his words directly in my own accent, which has the problem that it can sound patronising, or like I'm mocking his language, because so much of Patois is to do with the way the words are pronounced; or I could attempt to approximate his own accent -- which would probably come off as incredibly racist. As the least bad option of the three, I'm choosing the middle one here, and reading in my own accent, but I want people to be aware that this is not intended as mockery, and that I have at least given this some thought:\n\n\"So we wait. Then as the clock struck midnight we hear “Baaap… bap da dap da dap, daaaa da daap!” And we see a bunch of them down from the dancehall coming up with the green bush. I was at the counter with Coxsone, he have a glass in him hand, he drop it and just collapse, sliding down the bar. I had to brace him against the bar, then get Phantom to give me a hand. The psychological impact had knocked him out. Nobody never hit him.\"\n\nThere was a second problem with using American records, as well -- American musical tastes were starting to change, and Jamaican ones weren't. Jamaican audiences wanted Louis Jordan, Fats Domino, and Gene & Eunice, but the Americans wanted Elvis and Jerry Lee Lewis and Bobby Darin. For a while, the sound men were able to just keep finding more and more obscure old R&B and jump band records, but there was a finite supply of these, and they couldn't keep doing it forever.\n\nThe solution eventually became obvious -- they needed Jamaican R&B. And thankfully there was a ready supply. Every week, there was a big talent contest in Kingston, and the winners would get five pounds -- a lot of money in that time and place. Many of the winners would then go to a disc-cutting service, one of those places that would record a single copy of a song for you, and use their prize money to record themselves. They could then sell that record to one of the sound men, who would be sure that nobody else would have a copy of it.\n\nAt first, the only sound men they could sell to were the less successful ones, who didn't have good connections with American records. A local record was clearly not as good as an American one, and so the big sound systems wouldn't touch it, but it was better than nothing, and some of the small sound systems would find that the local records were a success for them, and eventually the bigger systems would start using the small ones as a test audience -- if a local record went down well at a small system, one of the big operators would get in touch with the sound man of that system and buy the record from him.\n\nOne of the big examples of this was \"Lollipop Girl\", a song by Derrick Harriott and Claudie Sang. They recorded that, with just a piano backing, and sold their only copy to a small sound system owner. It went down so well that the small sound man traded his copy with Coxsone Dodd for an American record -- and it went down so well when Dodd played it that Duke Reid bribed one of Dodd's assistants to get hold of Dodd's copy long enough to get a copy made for himself. When Dodd and Reid played a sound clash -- a show where they went head to head to see who could win a crowd over -- and Reid played his own copy of \"Lollipop Girl\", Dodd pulled a gun on Reid, and it was only the fact that the clash was next door to the police station that kept the two men from killing each other.\n\nReid eventually wore out his copy of \"Lollipop Girl\", he played it so much, and so he did the only sensible thing -- he went into the record business himself, and took Harriott into the studio, along with a bunch of musicians from the local big bands, and cut a new version of it with a full band backing Harriott. As well as playing this on his sound system, Reid released it as a record:\n\n[Excerpt: Derrick Harriott, \"Lollipop Girl\"]\n\nReid didn't make many more records at this point, but both Coxsone Dodd and Prince Buster started up their own labels, and started hiring local singers, plus people from a small pool of players who became the go-to session musicians for any record made in Jamaica at the time, like trombone player Rico Rodriguez and guitarist Ernest Ranglin.\n\nDuring the late 1950s, a new form of music developed from these recordings, which would become known as ska, and there are three records which are generally considered to be milestones in its development. The first was produced by a white businessman, Edward Seaga, who is now more famous for becoming the Prime Minister of Jamaica in the 1980s. At the time, though, Seaga had the idea to incorporate a little bit of a mento rhythm into an R&B record he was producing. In most music, if you have a four-four rhythm, you can divide it into eight on-beats and off-beats, and you normally stress the on-beats, so you stress \"ONE and TWO and THREE and FOUR and\". In mento, though, you'd often have a banjo stress the off-beats, so the stresses would be \"one AND two AND three AND four AND\".\n\nSeaga had the guitarist on \"Manny Oh\" by Higgs and Wilson do this, on a track that was otherwise a straightforward New Orleans style R&B song with a tresillo bassline. The change in stresses is almost imperceptible to modern ears, but it made the record sound uniquely Jamaican to its audience:\n\n[Excerpt: Higgs and Wilson, \"Manny Oh\"]\n\nThe next record in the sequence was produced by Dodd, and is generally considered the first real ska record. There are a few different stories about where the term \"ska\" came from, but one of the more believable is that it came from Dodd directing Ernest Ranglin, who was the arranger for the record, to stress the off-beat more, saying \"play it ska... ska... ska...\"\n\nWhere \"Manny Oh\" had been a Jamaican sounding R&B record, \"Easy Snappin'\" is definitely a blues-influenced ska record:\n\n[Excerpt: Theo Beckford, \"Easy Snappin'\"]\n\nBut Duke Reid and Coxsone Dodd, at this point, still saw the music they were making as a substitute for American R&B. Prince Buster, on the other hand, by this point was a full-fledged Black nationalist, and wanted to make a purely Jamaican music. Buster was, in particular, an adherent of the Rastafari religion, and he brought in five drummers from the Rasta Nyabinghi tradition, most notably Count Ossie, who became the single most influential drummer in Jamaica, to record on the Folkes brothers single \"Oh Carolina\", incorporating the rhythms of Rasta sacred music into Jamaican R&B for the first time:\n\n[Excerpt: The Folkes Brothers, \"Oh Carolina\"]\n\n1962 was a turning point in Jamaican music in a variety of ways. Most obviously, it was the year that Jamaica became independent from the British Empire, and was able to take control of its own destiny. But it was also the year that saw the first recordings of a fourteen-year-old girl who would become ska's first international star.\n\nMillie Small had started performing at the age of twelve, when she won the Vere Johns Opportunity Hour, the single biggest talent contest in Kingston. But it was two years later that she came to the attention of Coxsone Dodd, who was very interested in her because her voice sounded spookily like that of Shirley, from the duo Shirley and Lee.\n\nWe mentioned Shirley and Lee briefly back in the episode on \"Ko Ko Mo\", but they were a New Orleans R&B duo who had a string of hits in the early and mid fifties, recorded at Cosimo Matassa's studio, pairing Leonard Lee's baritone voice with Shirley Goodman's soprano. Their early records had been knock-offs of the sound that Little Esther had created with Johnny Otis and his male vocalists -- for example Shirley and Lee's \"Sweethearts\":\n\n[Excerpt: Shirley and Lee, \"Sweethearts\"]\n\nbears a very strong resemblance to \"Double-Crossing Blues\":\n\n[Excerpt: Little Esther, Johnny Otis, and the Robins, \"Double-Crossing Blues\"]\n\nBut they'd soon developed a more New Orleans style, with records like \"Feel So Good\" showing some of the Caribbean influence that many records from the area had:\n\n[Excerpt: Shirley and Lee, \"Feel So Good\"]\n\nShirley and Lee only had minor chart success in the US, but spawned a host of imitators, including Gene and Eunice and Mickey and Sylvia, both of whom we looked at in the early months of the podcast, and Ike and Tina Turner who will be coming up later. Like much New Orleans R&B, Shirley and Lee were hugely popular among the sound system listeners, and Coxsone Dodd thought that Mille's voice sounded enough like Shirley's that it would be worth setting her up as part of his own Shirley and Lee soundalike duo, pairing her with a more established singer, Owen Gray, to record songs like \"Sit and Cry\", a song which combined the vocal sound of Shirley and Lee with the melody of \"The Twist\":\n\n[Excerpt: Owen and Millie, \"Sit and Cry\"]\n\nAfter Gray decided to continue performing on his own, Millie was instead teamed with another performer, Roy Panton, and \"We'll Meet\" by Roy and Millie went to number one in Jamaica:\n\n[Excerpt: Roy and Millie, \"We'll Meet\"]\n\nMeanwhile, in the UK, there was a growing interest in music from the Caribbean, especially Jamaica. Until very recently, Britain had been a very white country -- there have always been Black people in the UK, especially in port towns, but there had been very few. As of 1950, there were only about twenty thousand people of colour living in the UK. But starting in 1948, there had been a massive wave of immigration from other parts of what was then still the British Empire, as the government encouraged people to come here to help rebuild the country after the war. By 1961 there were nearly two hundred thousand Black people in Britain, almost all of them from the Caribbean.\n\nThose people obviously wanted to hear the music of their own culture, and one man in particular was giving it to them.\n\nChris Blackwell was a remarkably privileged man. His father had been one of the heirs to the Crosse and Blackwell fortune, and young Chris had been educated at Harrow, but when not in school he had spent much of his youth in Jamaica. His mother, Blanche, lived in Jamaica, where she was a muse to many men -- Noel Coward based a character on her, in a play he wrote in 1956 but which was considered so scandalous that it wasn't performed in public until 2012. Blanche attended the premiere of that play, when she was ninety-nine years old. She had an affair with Errol Flynn, and was also Ian Fleming's mistress -- Fleming would go to his Jamaican villa, GoldenEye, every year to write, leaving his wife at home (where she was having her own affairs, with the Labour MPs Hugh Gaitskell and Roy Jenkins), and would hook up with Blanche while he was there -- according to several sources, Fleming based the characters of Pussy Galore and Honeychile Ryder on Blanche. After Fleming's death, his wife instructed the villa's manager that it could be rented to literally anyone except Blanche Blackwell, but in the mid-1970s it was bought by Bob Marley, who in turn sold it to Chris Blackwell.\n\nChris Blackwell had developed a fascination with Rasta culture after having crashed his boat while sailing, and being rescued by some Rasta fishermen, and he had decided that his goal was to promote Jamaican culture to the world. He'd started his own labels, Island Records, in 1959, using his parents' money, and had soon produced a Jamaican number one, \"Boogie in My Bones\", by Laurel Aitken:\n\n[Excerpt: Laurel Aitken, \"Boogie in My Bones\"]\n\nBut music was still something of a hobby with Blackwell, to the point that he nearly quit it altogether in 1962. He'd been given a job as a gopher on the first James Bond film, Dr. No, thanks to his family connections, and had also had a cameo role in the film. Harry Saltzman, the producer, offered him a job, but Blackwell went to a fortune teller who told him to stick with music, and he did.\n\nSoon after that, he moved back to England, where he continued running Island Records, this time as a distributor of Jamaican records. The label would occasionally record some tracks of its own, but it made its money from releasing Jamaican records, which Blackwell would hand-sell to local record shops around immigrant communities in London, Manchester, and Birmingham.\n\nIsland was not the biggest of the labels releasing Jamaican music in Britain at the time -- there was another label, Blue Beat, which got most of the big records, and which was so popular that in Britain \"bluebeat\" became a common term for ska, used to describe the whole genre, in the same way as Motown might be. And ska was becoming popular enough that there was also local ska being made, by Jamaican musicians living in Britain, and it was starting to chart. The first ska record to hit the charts in Britain was a cover of a Jimmy Cliff song, \"King of Kings\", performed by Ezz Reco and the Launchers:\n\n[Excerpt: Ezz Reco and the Launchers, \"King of Kings\"]\n\nThat made the lower reaches of the top forty, and soon after came \"Mockingbird Hill\", a ska remake of an old Les Paul and Mary Ford hit, recorded by the Migil Five, a white British R&B group whose main claim to fame was that one of them was Charlie Watts' uncle, and Watts had occasionally filled in on drums for them before joining the Rolling Stones:\n\n[Excerpt: Migil Five, \"Mockingbird Hill\"]\n\nThat made the top ten. Ska was becoming the in sound in Britain, to the point that in March 1964, the same month that \"Mockingbird Hill\" was released, the Beatles made a brief detour into ska in the instrumental break to \"I Call Your Name\":\n\n[Excerpt: The Beatles, \"I Call Your Name\"]\n\nAnd it was into this atmosphere that Chris Blackwell decided to introduce Millie. Her early records had been selling well enough for him that in 1963 he had decided to call Millie's mother and promise her that if her daughter came over to the UK, he would be able to make her into a star. Rather than release her records on Island, which didn't have any wide distribution, he decided to license them to Fontana, a mid-sized British label.\n\nMillie's first British single, \"Don't You Know\", was released in late 1963, and was standard British pop music of the time, with little to distinguish it, and so unsurprisingly it wasn't a hit:\n\n[Excerpt: Millie, \"Don't You Know\"]\n\nBut the second single was something different. For that, Blackwell remembered a song that had been popular among the sound systems a few years earlier; an American record by a white singer named Barbara Gaye. Up to this point, Gaye's biggest claim to fame had been that Ellie Greenwich had liked this record enough that she'd briefly performed under the stage name Ellie Gaye, before deciding against that.\n\n\"My Boy Lollipop\" had been written by Robert Spencer of the Cadillacs, the doo-wop group whose biggest hit had been \"Speedoo\":\n\n[Excerpt: The Cadillacs, \"Speedoo\"]\n\nSpencer had written “My Boy Lollipop”, but lost the rights to it in a card game -- and then Morris Levy bought the rights from the winner for a hundred dollars. Levy changed the songwriting credit to feature a mob acquaintance of his, Johnny Roberts, and then passed the song to Gaetano Vastola, another mobster, who had it recorded by Gaye, a teenage girl he managed, with the backing provided by the normal New York R&B session players, like Big Al Sears and Panama Francis:\n\n[Excerpt: Barbie Gaye, \"My Boy Lollipop\"]\n\nThat hadn't been a hit when it was released in 1956, but it had later been picked up by the Jamaican sound men, partly because of its resemblance to the ska style, and Blackwell had a tape recording of it. Blackwell got Ernest Ranglin, who had also worked on Dr. No, and who had moved over to the UK at the same time as Blackwell, to come up with an arrangement, and Ranglin hired a local band to perform the instrumental backing. That band, Jimmy Powell and the Five Dimensions, had previously been known as the Moontrekkers, and had worked with Joe Meek, recording \"Night of the Vampire\":\n\n[Excerpt: The Moontrekkers, \"Night of the Vampire\"]\n\nRanglin replaced the saxophone solo from the original record with a harmonica solo, to fit the current fad for the harmonica in the British charts, and there is some dispute about who played it, but Millie always insisted that it was the Five Dimensions' harmonica player, Rod Stewart, though Stewart denies it:\n\n[Excerpt: Millie, \"My Boy Lollipop\"]\n\n\"My Boy Lollipop\" came out in early 1964 and became a massive hit, reaching number two on the charts both in the UK and the US, and Millie was now a star. She got her own UK TV special, as well as appearing on Around The Beatles, a special starring the Beatles and produced by Jack Good. She was romantically linked to Peter Asher of Peter and Gordon. Her next single, though, \"Sweet William\", only made number thirty, as the brief first wave of interest in ska among the white public subsided:\n\n[Excerpt: Millie, \"Sweet William\"]\n\nOver the next few years, there were many attempts made to get her back in the charts, but the last thing that came near was a remake of \"Bloodshot Eyes\", without the intimate partner violence references, which made number forty-eight on the UK charts at the end of 1965:\n\n[Excerpt: Millie, \"Bloodshot Eyes\"]\n\nShe was also teamed with other artists in an attempt to replicate her success as a duet act. She recorded with Jimmy Cliff:\n\n[Excerpt: Millie and Jimmy Cliff, \"Hey Boy, Hey Girl\"]\n\nand Jackie Edwards:\n\n[Excerpt: Jackie and Millie, \"Pledging My Love\"]\n\nand she was also teamed with a rock group Blackwell had discovered, and who would soon become big stars themselves with versions of songs by Edwards, on a cover version of Ike and Tina Turner's \"I'm Blue (the Gong Gong Song)\":\n\n[Excerpt: The Spencer Davis Group, \"I'm Blue (The Gong Gong Song)\"]\n\nBut the Spencer Davis Group didn't revive her fortunes, and she moved on to a succession of smaller labels, with her final recordings coming in the early 1970s, when she recorded the track \"Enoch Power\", in response to the racism stirred up by the right-wing politician Enoch Powell:\n\n[Excerpt: Millie Small, \"Enoch Power\"]\n\nMillie spent much of the next few decades in poverty. There was talk of a comeback in the early eighties, after the British ska revival group Bad Manners had a top ten hit with a gender-flipped remake of \"My Boy Lollipop\":\n\n[Excerpt: Bad Manners, \"My Girl Lollipop\"]\n\nBut she never performed again after the early seventies, and other than one brief interview in 2016 she kept her life private. She was given multiple honours by the people of Jamaica, including being made a Commander in the Order of Distinction, but never really got any financial benefit from her enormous chart success, or from being the first Jamaican artist to make an impact on Britain and America. She died last year, aged seventy-two.",
  "enclosure": "",
  "itunes:summary": "This week's episode looks at \"My Boy Lollipop\" and the origins of ska music. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"If You Wanna Be Happy\" by Jimmy Soul.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, I have created&nbsp;a Mixcloud playlist containing every song heard in this episode -- a content warning applies for the song \"Bloodshot Eyes\" by Wynonie Harris.\n\nThe information about ska in general mostly comes from Bass Culture: When Reggae Was King by Lloyd Bradley, with some also from&nbsp;Reggae and Caribbean Music by Dave Thompson.\n\nBiographical information on Millie Small is largely from this article in Record Collector, plus a paywalled interview with Goldmine magazine (which I won't link to because of the paywall).\n\nMillie's early recordings with Owen Gray and Coxsone Dodd can be found on this compilation, along with a good selection of other recordings Dodd produced, while this compilation gives a good overview of her recordings for Island and Fontana.\n\nPatreon\n\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\n\nErratum\n\nI refer to \"Barbara Gaye\" when I should say \"Barbie Gaye\"\n\nTranscript\n\nToday, we're going to take our first look at a form of music that would go on to have an almost incalculable influence on the music of the seventies, eighties, and later, but which at the time we're looking at was largely regarded as a novelty music, at least in Britain and America. We're going to look at the birth of ska, and at the first ska record to break big outside of Jamaica. We're going to look at \"My Boy Lollipop\" by Millie:\n\n[Excerpt: Millie, \"My Boy Lollipop\"]\n\nMost of the music we've looked at so far in the podcast has been from either America or Britain, and I'm afraid that that's going to remain largely the case -- while there has been great music made in every country in the world, American and British musicians have tended to be so parochial, and have dominated the music industry so much, that relatively little of that music has made itself felt widely enough to have any kind of impact on the wider history of rock music, much to rock's detriment.\n\nBut every so often something from outside the British Isles or North America manages to penetrate even the closed ears of Anglo-American musicians, and today we're going to look at one of those records.\n\nNow, before we start this, this episode is, by necessity, going to be dealing in broad generalisations -- I'm trying to give as much information about Jamaica's musical culture in one episode as I've given about America's in a hundred, so I am going to have to elide a lot of details. Some of those details will come up in future episodes, as we deal with more Jamaican artists, but be aware that I'm missing stuff out.\n\nThe thing that needs to be understood about the Jamaican music culture of the fifties and early sixties is that it developed in conditions of absolute poverty. Much of the music we looked at in the first year or so of the podcast came from extremely impoverished communities, of course, but even given how utterly, soul-crushingly, poor many people in the Deep South were, or the miserable conditions that people in Liverpool and London lived in while Britain was rebuilding itself after the war, those people were living in rich countries, and so still had access to some things that were not available to the poor people of poorer countries.\n\nSo in Jamaica in the 1950s, almost nobody had access to any kind of record player or radio themselves. You wouldn't even *know* anyone who had one, unlike in the states where if you were very poor you might not have one yourself, but your bet",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "This week's episode looks at \"My Boy Lollipop\" and the origins of ska music. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"If You Wanna Be Happy\" by Jimmy Soul.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, I have created&nbsp;a Mixcloud playlist containing every song heard in this episode -- a content warning applies for the song \"Bloodshot Eyes\" by Wynonie Harris.\n\nThe information about ska in general mostly comes from Bass Culture: When Reggae Was King by Lloyd Bradley, with some also from&nbsp;Reggae and Caribbean Music by Dave Thompson.\n\nBiographical information on Millie Small is largely from this article in Record Collector, plus a paywalled inte",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}