{
  "title": "Retirement Update: 6.25 Years",
  "link": "https://esimoney.com/retirement-update-6-25-years/",
  "comments": "https://esimoney.com/retirement-update-6-25-years/#comments",
  "dc:creator": "ESI",
  "pubDate": "Wed, 02 Nov 2022 09:00:38 +0000",
  "category": "Retirement",
  "guid": "https://esimoney.com/?p=9155",
  "description": "<p>Well, it&#8217;s that time again &#8212; time for another retirement update where I share what it&#8217;s like in the retired world of ESI! And there&#8217;s some big news in this post! FYI, I did an update in August titled Retirement Update: 6 Years. If you missed that you may want to go there first to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://esimoney.com/retirement-update-6-25-years/\">Retirement Update: 6.25 Years</a> appeared first on <a rel=\"nofollow\" href=\"https://esimoney.com\">ESI Money</a>.</p>\n",
  "content:encoded": "<p><a href=\"https://esimoney.com/wp-content/uploads/2022/11/Ft-Lauderdale-Beach-FL-new.jpg\"><img class=\"alignleft size-medium wp-image-9156\" src=\"https://esimoney.com/wp-content/uploads/2022/11/Ft-Lauderdale-Beach-FL-new-300x200.jpg\" alt=\"\" width=\"300\" height=\"200\" srcset=\"https://esimoney.com/wp-content/uploads/2022/11/Ft-Lauderdale-Beach-FL-new-300x200.jpg 300w, https://esimoney.com/wp-content/uploads/2022/11/Ft-Lauderdale-Beach-FL-new.jpg 750w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a>Well, it&#8217;s that time again &#8212; time for another retirement update where I share what it&#8217;s like in the retired world of ESI! And there&#8217;s some big news in this post!</p>\n<p>FYI, I did an update in August titled <a href=\"https://esimoney.com/retirement-update-6-years/\">Retirement Update: 6 Years</a>. If you missed that you may want to go there first to catch up.</p>\n<p>FWIW, this might be my last &#8220;official&#8221; retirement update for several months. That&#8217;s because I&#8217;m headed to Florida this winter and will likely give monthly updates from The Villages (like I did last year). These will provide more than enough details as to what&#8217;s going on with us in retirement. We&#8217;ll see what I decide to do. As you&#8217;ll find out in a moment&#8230;we&#8217;re kind of in flux right now.</p>\n<p>With that said, let&#8217;s get started with the big news&#8230;</p>\n<h4><span style=\"text-decoration: underline;\"><strong>We Bought a House in The Villages</strong></span></h4>\n<p>Yep. We just bought a place in The Villages (TV). Actually, we&#8217;re in the process of buying and close in late November. Here&#8217;s how it all came to be&#8230;</p>\n<p>Our plan had been to rent there early next year and (hopefully/maybe) buy a place near the new town square of Eastport in 2023.</p>\n<p>A few months ago, that looked like a reasonable plan.</p>\n<p>But as things have developed, it appears that Eastport won&#8217;t be done and homes around it available for much longer &#8212; 2-3 years down the road (maybe 2024 or 2025).</p>\n<p>This meant that we&#8217;d be renting for this year AND two more years most likely&#8230;and even then the developments we would like might not be the first they completed&#8230;so our wait could be longer. Rental prices are going nowhere but up with Jan-April at $18k (this year &#8212; what we locked in back in May &#8212; it&#8217;s much higher now), will be $20k+ next year and look to be even higher the year after that.</p>\n<p>When we began looking at $60k in rental fees over three years not to mention the hassle of trying to find a place, get our stuff down there, and all the associated issues with renting, we thought about buying a small place, using it as a vacation home (for 4-8 months a year), and if need be, selling it if we didn&#8217;t like it/no longer wanted it (FYI, when you buy a new home in TV you sign an agreement saying you won&#8217;t/can&#8217;t sell it within the first year).</p>\n<p>We talked to our agent and there was only one village we were interested in between now and the development of Eastport (from what we know currently and what the agent knows) and that&#8217;s the Village of Richmond. The great thing about it is that it&#8217;s very close to a town square &#8212; Brownwood Paddock Square (which was the reason we were interested in Eastport as well &#8212; we wanted a place near a town square).</p>\n<p>Here&#8217;s a relatively recent tour of Richmond:</p>\n<p><center><iframe loading=\"lazy\" title=\"YouTube video player\" src=\"https://www.youtube.com/embed/nsRNb_1xZmM\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></center>The problem with Richmond is that they were selling homes currently. Not in 2-3 months or even in a year &#8212; they have been on the market for some time (I&#8217;d say about half the homes are sold) and are going like hotcakes.</p>\n<p>So we had to decide &#8212; were we willing to make the move right away or did we want to wait? And even if we did try immediately, there was no guarantee we&#8217;d get something. The forums I follow on TV said sometimes there were up to 10 buyers trying to get a place in Richmond when it came available. Yikes!</p>\n<p>Eventually we decided we&#8217;d try to buy a place. Initially we looked at <a href=\"https://www.thevillages.com/our-homes/patio-villas\">patio villas</a>, small 2 bed/2 bath places &#8212; the same type that my dad has.</p>\n<p>But if we bought a place like that, we would be banking on someplace in Eastport being open that we liked (if we ever decided to move down there full time or wanted a better vacation spot) as we didn&#8217;t want to live in a place that small. Plus, there weren&#8217;t really any places/styles/locations we liked in the patio villa options. So we went to plan B&#8230;</p>\n<p>We then moved on to the next levels of homes &#8212; <a href=\"https://www.thevillages.com/our-homes/the-verandas\">Verandas</a> and <a href=\"https://www.thevillages.com/our-homes/designer-homes\">Designer</a> homes. These are bigger (and more expensive) but also might be places we really liked, would want to live in eventually, and might take buying another place in Eastport out of the equation (or at least give us options).</p>\n<p>Our realtor sent us a map of places available by lot as well as what style home was going to be on each lot. From there we looked at lots we wanted that had homes on them we liked and made a Google spreadsheet for our realtor. Then we could track what we were interested in, when it was up for sale, etc.</p>\n<p>We sent her the list on Saturday, October 22. On Monday, October 24, we got a call from our realtor at 5 p.m. that said two of the homes near the top of our list were going on sale the next day.</p>\n<p>As a refresher in case you don&#8217;t know, here&#8217;s how TV sells new homes:</p>\n<ul>\n<li>The night before they become available, TV lets realtors know which homes will be for sale the next day at 8 am.</li>\n<li>The realtors then contact their buyers, determine whether they are interested or not, and proceed accordingly.</li>\n<li>If the buyers are interested, the realtor will be at his/her computer at 8 am the next morning, refreshing the screen constantly as it&#8217;s first come, first served. The first one to get a home once it shows up as available has 24 hours to commit to it. If they do not, it goes to the second in line and so on until there&#8217;s a final buyer.</li>\n</ul>\n<p>When my dad bought his place, he tried 3 or 4 times until he got one. He was second, third, and even farther back all the other times until he got a place.</p>\n<p>Our place was a bit bigger and more expensive, so there would probably be fewer competitors, but it would still be a race to get it. I pegged our chances of being first at 1 in 3.</p>\n<p>The other thing was the first homes to come up for sale were not at the top of our list. They were in the top 5 or so (out of 15 we had identified), but not #1.</p>\n<p>And&#8230;even though we knew we approved of the lot and the home&#8217;s layout, we did not know if we liked the inside designs. Those could be perfect for us or ones we hated.</p>\n<p>So our agent went to the homes on Monday night, videotaped them, and sent us the videos. We got to see the colors, fixtures, etc. plus any extra add ons (both places had expanded lanais (which we liked) and one had carpet in the bedrooms and two master closets (which we also liked.))</p>\n<p>After looking over the videos and having a hour or so to determine what to do, we decided we&#8217;d bid on one of the homes. It was a &#8220;Begonia&#8221; design&#8230;which <a href=\"https://www.thevillages.com/homefinder/model/Begonia?new&preowned&homesites&status&lng=-81.99355979584547&lat=28.87421165371721&lvl=0\">you can see here</a>.</p>\n<p>My wife liked the colors and design much better than the other one and we liked the carpet in the bedrooms and the expanded lanai.</p>\n<p>Coincidently, this is the same model type we rented in January-March of this year from our friends, so we knew it well.</p>\n<p>The location was good, but not perfect. The second home had a BIT better location IMO (not as good in my wife&#8217;s opinion).</p>\n<p>It is in the heart of the action (near a recreation center), which is what we wanted. It&#8217;s also close to the walking path, so we could WALK to Brownwood &#8212; very nice. And we can see the pickleball courts from the house, basically giving us our own backyard pickleball courts. Hahaha.</p>\n<p>We will see how we like it and can go in several different ways:</p>\n<ul>\n<li>If we do like it, we could keep it and use it either as a vacation home or as a main home if we ever decided to move down there.</li>\n<li>If we don&#8217;t like it and want to move to Eastport or completely abandon TV, we could sell it. The purchase price is a decent amount and homes like it are going for more on the secondary market as of now.</li>\n<li>Or, if we don&#8217;t like it, we could move to Eastport and keep it &#8212; either renting it out (Jan-Mar rental numbers would cover all annual expenses) or use it for friends and family to stay in.</li>\n</ul>\n<p>As for our house in Colorado, how we transition, etc., that&#8217;s all a work in progress as of now. We don&#8217;t need to sell anything and had enough in cash (barely) to buy the new place outright and not sell our current home (I had money remaining from the sale of our rentals last year).</p>\n<p>We will most likely move our state of residence to Florida as we&#8217;ll be there more than six months per year (our current plan is to be there from December 2022 until sometime in May, then come back in October-December 2023, sooner if we sell our Colorado home.) Anyway, there&#8217;s no state income tax in Florida, so I&#8217;m looking forward to that! <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f609.png\" alt=\"😉\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n<p>FYI, we still do have our rental in the Village of St. Catherine for January-April. The good news is that we rented it through a rental company closely associated with The Villages and they are more than helpful in renting out places to others when you&#8217;re buying something from them. LOL. They are pretty confident they can rent it out for us (and thus release us from our agreement) from Jan-Mar (and probably get more than what we agreed to pay as rates are way up). They are fairly confident they can rent it out in April. If they can&#8217;t for April, we&#8217;ll use it for friends and family who want to visit, treating them to a free vacation. <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f609.png\" alt=\"😉\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n<p>Anyway, that&#8217;s it for now.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>Life</strong></span></h4>\n<p>It was a pretty normal late summer and early fall in Colorado. Nothing too out of the ordinary or noteworthy. We spent most of it close to home, playing pickleball, and hanging out with family. But there were a few notable happenings&#8230;</p>\n<ul>\n<li>In September my brother-in-law was supposed to visit us but he got Covid and had to cancel. But my biological father did come and brought his new wife. We had a good visit and made a couple standard <a href=\"https://esimoney.com/what-to-do-when-visiting-colorado-springs/\">Colorado Springs tourist stops</a>. The first was to the <a href=\"https://gardenofgods.com/\">Garden of the Gods</a> (a must see, of course). The second was a trip to the top of Pikes Peak via the <a href=\"https://www.cograilway.com/\">Cog Railway</a> one day. I posted some pictures of both trips on Instagram &#8212; so <a href=\"https://www.instagram.com/esimoneyblog/\">if you follow me there</a> you&#8217;ve seen them.</li>\n<li>My dad (step-dad) has now been living in The Villages for six months and LOVES it. He&#8217;s making friends, going to Zumba, working out at the gym I went to last winter in Brownwood Square, and listening to music most nights on the square. I got to see him in September when my daughter and I drove up from Orlando (see below for details) and he&#8217;s doing well. Hurricane Ian missed the Villages &#8212; all they had was a few inches of rain and some downed palm branches.</li>\n<li>Speaking of Hurricane Ian, I watched a lot of footage of the damage in Ft. Myers Beach and was able to find the vacation house we had stayed in many years ago (detailed in <a href=\"https://esimoney.com/retirement-update-3-25-years/\">Retirement Update: 3.25 Years</a>.) It&#8217;s gone. Completely gone. The only thing left is the pool that was in the back yard. So sad.</li>\n<li>We did the annual Parade of Homes in September &#8212; my wife, daughter, son-in-law, and me &#8212; seeing 25 homes or so in two days (we have a system and know how to map out a good route.) As usual it was fun to see new homes and how people are designing them. We didn&#8217;t get any ideas for our place this year, but we do have tentative plans for some new carpet and paint while we&#8217;re gone this winter.</li>\n<li>We&#8217;ll be going to The Villages earlier than we&#8217;d planned. Anyway, <a href=\"https://www.instagram.com/esimoneyblog/\">stay tuned to both Instagram</a> (I post &#8220;retirement life&#8221; pictures there weekly) and ESI Money (with more in-depth coverage) to keep up.</li>\n</ul>\n<h4><span style=\"text-decoration: underline;\"><strong>Health</strong></span></h4>\n<ul>\n<li>I am still working out six times a week &#8212; three cardio days and three weights days. I see my trainer every 4 weeks for a new weight routine. I thought I might need to do a bit more, but at my annual physical my doctor said my vitals were &#8220;perfect.&#8221; I asked if I should do anything different exercise-wise and he said, &#8220;I wouldn&#8217;t change a thing. Your vitals are perfect, so keep doing whatever you&#8217;re doing.&#8221;</li>\n<li>Now that it&#8217;s turned colder, more people have joined our gym to play pickleball. We upgraded our membership to &#8220;Signature&#8221; level, which for an extra $60 a month allows us to play unlimited pickleball. Given that it&#8217;s $10 a pop to play each time and I play five times a week (not to mention what my wife plays), you can see how $60 is a better deal. Hahahaha.</li>\n<li>In early October our gym had its first fall classic pickleball tournament. My partner and I were going to sign up for 4.0 men&#8217;s doubles, but since they didn&#8217;t segregate the teams by ages (which most bigger tournaments do), we elected to play 3.5 men&#8217;s (we are 4.0 for our ages, but playing against 20 and 30-year olds makes it pretty tough on us.) We had an up and down day and did just enough to barely squeak into the gold medal match. Once there, we played like we knew we could and won 2 out of 3 in two games &#8212; 11-5 and 11-2 (beating a team that had beaten us in the round robin section earlier that day). We were happy (of course) and thrilled to win. FYI, I shared a picture of us on Instagram as well.</li>\n<li>I&#8217;m also still walking a lot and averaging over 20k steps per day. The summer was actually a time when I averaged fewer than 20,000 a day (too hot to walk sometimes) but now that it&#8217;s cooler I&#8217;m hitting 25k+ on some days (like when I do cardio and play pickleball).</li>\n<li>I have been seeing doctors left and right to get in all my visits before we leave for Florida. All I have left is a second dentist appointment (six month visit)!</li>\n</ul>\n<h4><span style=\"text-decoration: underline;\"><strong>Entertainment</strong></span></h4>\n<ul>\n<li>My wife and I got wind of <a href=\"https://www.hallmarkchannel.com/chesapeake-shores\">Chesapeake Shores</a>, a Hallmark Channel TV series that has been on for six seasons (the last (and final) season was just this year). We have spent the last couple months watching through all the seasons and finally finished it in October. We also watched/are watching the Lord of the Rings series with our kids (when they come over every Saturday), Young Sheldon, AFV, Shark Tank, This Old House, House Hunters, and a few more.</li>\n<li>We also watch a lot of YouTube. Funny videos (like Fail Army) and posts on The Villages are the mainstays together, but I also watch several money channels, video game channels, and a few channels on creating a YouTube channel (see below for more on that.)</li>\n<li>I have spent a lot of time with my PS5 the last quarter. I got Horizon Forbidden West and have about 80 hours played so far (I spend a lot of time wandering and doing side missions.) My plan is to be done with it before we head to Florida at the end of December. Gotham Knights is just out and I would normally buy it, but I won&#8217;t have time to do it justice before we go, so I&#8217;ll wait until we get back in May. Besides, when I order games on launch day, I generally get done with them after a couple months. Then some cool DLC stuff comes out after six months and by then I have forgotten how to play my amped up character. So I&#8217;ll wait and some good extra content may be out by the time I get back.</li>\n<li>I have been reading several books (both actual reading and audio listening) the past few months which are listed below. I&#8217;m still enjoying the amount of reading time I have these days. I am also listening to several podcasts.</li>\n</ul>\n<h4><span style=\"text-decoration: underline;\"><strong>Finances</strong></span></h4>\n<ul>\n<li>We ended October with a net worth of $6.1 million, down $430k from a year ago and the same from our high of $6.5 million (December 2021). Easy come, easy go. LOL! I&#8217;m still up almost $3 million since retiring and income is more than twice spending, so it&#8217;s not a big deal.</li>\n<li>I had two syndication deals end this quarter (short-term land deals) and I reinvested the money into other projects. As of now I have 12 syndication deals for a total of $1.025 million invested. Together these pay $72,250 per year in income over the course of their investment periods (which is usually 5-7 years). I&#8217;m not looking for any additional deals as my current level of commitment is where I would like to stay for the time being. FYI, my dad got into one of the deals with me and he&#8217;s THRLLED that he&#8217;s earning 10% back on his money with a short-term (18 months) commitment.</li>\n<li>As you&#8217;ll read in a month or so, we&#8217;ve ramped up our giving plan for the next five years. This quarter we sent a container of donated supplies to Ukraine as well as sent money to Florida to help people and the clean-up from Hurricane Ian. We&#8217;ll make one more small gift before the year is out that will put us at or over $100k for the year.</li>\n</ul>\n<h4><span style=\"text-decoration: underline;\"><strong>ESI Money and Millionaire Money Mentors</strong></span></h4>\n<ul>\n<li>ESI Money is still doing well&#8230;chugging along like always. I have hit a stride of sharing more interviews because I feel like the more stories people hear about how others have become wealthy, the more ideas and insights they&#8217;ll have to apply themselves.</li>\n<li>There will be a change to ESI Money in 2023 as I&#8217;ll move from three posts a week to two. The move came after chatting about this with the mentors &#8212; they are GREAT to bounce ideas off of and discuss various options. I am spending more and more time in the Millionaire Money Mentors (MMM) forums and need to free up some time for other projects and pickleball. <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f609.png\" alt=\"😉\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /> I might start to syndicate posts from other bloggers which could bring the total posts per week back up to three, but that is still TBD. If you are a blogger and have a great post you&#8217;d like me to consider for syndication and/or you have a guest post you&#8217;d like to pitch, please email me your thoughts.</li>\n<li>As you may have seen me mention here and there, my plan is to do minimal blog writing while we&#8217;re in Florida this winter. As such, I have been slaving away at posts and now have them completed through May 2023. As you&#8217;ll notice, some of the interviews take place a few months before they will post, but I have mentioned that on each one for some context.</li>\n<li>I&#8217;ll be reaching a blogging milestone in a few years. In 2025 I&#8217;ll celebrate 20 years of blogging. I was writing (for national magazines) before that and coaching before that, so 2022 actually makes 30 years I have been teaching and writing about money. It&#8217;s pretty wild to think it&#8217;s been that long.</li>\n<li>My daughter and I went to FinCon (money media conference) in Orlando in early September. It was part business, part vacation. We flew first class (which is way better than coach for long trips) and had fun visiting Universal Studios, Disney Springs, an outlet mall, and made a trip to see my dad for a day in the Villages. On the business side we attended some seminars and met some great people (my daughter picked up a couple clients). I also got to have dinner with JD Roth from get Rich Slowly as well as a couple awesome friends from the Millionaire Money Mentors forums. It was a really great time.</li>\n<li>I have been considering ramping up (and taking seriously) my YouTube channel. I&#8217;m going through a course on it now and working through whether or not I&#8217;ll take it as a major project in 2023 (it&#8217;s probably 50/50 at the moment). All I have there now are some whiteboard videos my son did for me, so I need to do much more to get it in shape. If you want to follow me there just to see what happens, <a href=\"https://www.youtube.com/channel/UCsdvovOqxDL3hbkKiFbrn8A\">here&#8217;s my YouTube channel</a>.</li>\n<li>I have been writing a TON in addition to getting ahead on ESI Money. I currently have 10 ebooks completed and edited&#8230;now I just need to get them designed. That might happen before we head to Florida but if not, I can manage that while down there. It&#8217;s part of my plan to offer products of various depths at various prices. I have ESI Money (free) and the <a href=\"https://esimoney.com/email-series/\">email money series</a> (free), will have ebooks (very affordable), have a membership site (a bit more, but still a great deal), and might have courses some day (which will likely be the most costly but also have the most-focused content.) FYI, I&#8217;m also taking a course on how to create a course. Hahahaha.</li>\n<li>The Millionaire Money Mentors site is now at record membership (it pretty much reaches a new record every time I have a sale). As noted above, I spend much more time there than I do on ESI Money and really enjoy the community, topics we discuss, and the wisdom from so many great people. I have made some great online friendships and hope to turn some of those into real-life friendships.</li>\n<li>As a heads up, my next MMM sale will be Black Friday/Cyber Monday. It will be a great time to join the group (in time for the new year). It will be the last sale of the year (and probably last one for several months) and could be the final sale where the price is below $300. Hope to see you all there soon!</li>\n<li>I always need more millionaire and (especially) retirement interviews!!!! I&#8217;m well ahead but time passes and we&#8217;ll use up all the ones I have backlogged, so if you&#8217;re interested in sharing one, please email me and I&#8217;ll send you the details. And remember, if you do a millionaire interview and agree to some low-level posting requirements, your MMM membership is free once your interview goes live (no refunds to existing members, but you don&#8217;t have to renew either.)</li>\n<li>Finally, if you&#8217;re a regular ESI Money reader and have gotten something out of reading, please do me a favor and tell others about the site. I&#8217;d like to impact as many people as possible with some good financial content.</li>\n</ul>\n<h4><span style=\"text-decoration: underline;\"><strong>Books and Podcasts</strong></span></h4>\n<p>Here are some of the books I&#8217;ve read since my last update plus a few podcasts I really enjoy:</p>\n<ul>\n<li><a href=\"https://podcasts.apple.com/us/podcast/missed-fortune/id1636560953\">Missed Fortune</a> &#8212; Tells the story of the treasure hunt started by Forrest Fenn &#8212; and in particular focuses on the story of one guy looking for it. Very fascinating. FYI, <a href=\"https://www.outsideonline.com/outdoor-adventure/exploration-survival/forrest-fenn-treasure-jack-stuef/\">here&#8217;s an article with the highlights as well as details on the guy who found the treasure</a>.</li>\n<li><a href=\"https://amzn.to/3yJkqEN\">How to Get Paid for What You Know</a> &#8212; It&#8217;s a book about creating a course. It&#8217;s very good IMO and I&#8217;ll likely take it to Florida with me and re-read again. Plus I&#8217;ll then begin to plan my first course (I have one idea about 75% done, but I need to revisit it now that I&#8217;ve studied a bit &#8212; I can make it better.)</li>\n<li><a href=\"https://amzn.to/3rUUHFt\">YouTube Secrets</a> &#8212; This one I bought both the audio version as well as the book. I&#8217;ve listened to the book once and will be going through it a second time soon. It&#8217;s very good stuff and along with the course I&#8217;m taking, I think they have let me know what I should do on YouTube if I decide to go big there.</li>\n<li><a href=\"https://amzn.to/3TlNBW5\">Sparring Partners</a> &#8212; I love me some John Grisham! There are three short stories here with two of them (first and third) being quite good IMO.</li>\n<li><a href=\"https://amzn.to/3CBPOG9\">The Boys from Biloxi</a> &#8212; This is Grisham&#8217;s latest book which I&#8217;m listening to (and loving) now.</li>\n<li><a href=\"https://amzn.to/3T3aFcD\">The Five People You Meet in Heaven</a> &#8212; An oldie but a goodie! I remember wanting to buy it many years ago but it got pushed off my list by other books, so I got the Audible version and LOVED listening to it.</li>\n<li><a href=\"https://podcasts.apple.com/us/podcast/the-villages-daily-sun-podcast/id1507397935\">The Villages podcast</a> &#8212; I listen to it every Monday and know more about what&#8217;s going on in The Villages than most of the people who live there. LOL.</li>\n</ul>\n<p>That&#8217;s it for this report. Any thoughts or questions?</p>\n<p>The post <a rel=\"nofollow\" href=\"https://esimoney.com/retirement-update-6-25-years/\">Retirement Update: 6.25 Years</a> appeared first on <a rel=\"nofollow\" href=\"https://esimoney.com\">ESI Money</a>.</p>\n",
  "wfw:commentRss": "https://esimoney.com/retirement-update-6-25-years/feed/",
  "slash:comments": 16
}