{
  "title": "Cristina Alvizo Carranza y Elizabeth Cejudo Ramos (coord.) \"Mujeres en el siglo XX mexicano: agentes del proceso histórico\" (El Colegio de Jalisco, 2021)",
  "description": "Mujeres en el siglo XX Mexicano: agentes del proceso histórico, coordinado por Cristina Alvizo Carranza y Elizabeth Cejudo Ramos, se compone de siete capítulos en los que desde un enfoque regional y bajo la perspectiva de género se busca contribuir al estudio de las mujeres en la historia de México. Las autoras de los textos contenidos en el libro, tienen la intención de aportar al entendimiento de las mujeres como sujetas de la historia, activas y agentes de los cambios sociales que tuvieron lugar en el siglo XX. Los trabajos presentados giran en torno a los símbolos sobre la idea de feminidad, la educación de las mujeres, la normatividad impuesta según su sexo, las nociones políticas, la construcción de la ciudadanía, así como las percepciones que las mujeres tenían de sí mismas y sus procesos de autorrepresentación.\nEntrevista presentada por Pamela Fuentes profesora en el departamento de Estudios de las Mujeres y de Género en Pace University, también es una de las editoras de New Books Network en español",
  "pubDate": "Mon, 06 Jun 2022 08:00:00 -0000",
  "itunes:episodeType": "full",
  "itunes:episode": 76,
  "itunes:author": "New Books Network",
  "itunes:subtitle": "Una entrevista con Cristina Alvizo Carranza y Elizabeth Cejudo Ramos",
  "itunes:summary": "Mujeres en el siglo XX Mexicano: agentes del proceso histórico, coordinado por Cristina Alvizo Carranza y Elizabeth Cejudo Ramos, se compone de siete capítulos en los que desde un enfoque regional y bajo la perspectiva de género se busca contribuir al estudio de las mujeres en la historia de México. Las autoras de los textos contenidos en el libro, tienen la intención de aportar al entendimiento de las mujeres como sujetas de la historia, activas y agentes de los cambios sociales que tuvieron lugar en el siglo XX. Los trabajos presentados giran en torno a los símbolos sobre la idea de feminidad, la educación de las mujeres, la normatividad impuesta según su sexo, las nociones políticas, la construcción de la ciudadanía, así como las percepciones que las mujeres tenían de sí mismas y sus procesos de autorrepresentación.\nEntrevista presentada por Pamela Fuentes profesora en el departamento de Estudios de las Mujeres y de Género en Pace University, también es una de las editoras de New Books Network en español",
  "content:encoded": "<p><a href=\"https://libreriacoljal.com/tienda/ols/products/xn-mujeres-en-el-siglo-xx-mexicano-agentes-del-proceso-histrico-m4f\"><em>Mujeres en el siglo XX Mexicano: agentes del proceso histórico,</em></a><em> </em>coordinado por Cristina Alvizo Carranza y Elizabeth Cejudo Ramos, se compone de siete capítulos en los que desde un enfoque regional y bajo la perspectiva de género se busca contribuir al estudio de las mujeres en la historia de México. Las autoras de los textos contenidos en el libro, tienen la intención de aportar al entendimiento de las mujeres como sujetas de la historia, activas y agentes de los cambios sociales que tuvieron lugar en el siglo XX. Los trabajos presentados giran en torno a los símbolos sobre la idea de feminidad, la educación de las mujeres, la normatividad impuesta según su sexo, las nociones políticas, la construcción de la ciudadanía, así como las percepciones que las mujeres tenían de sí mismas y sus procesos de autorrepresentación.</p><p>Entrevista presentada por <a href=\"https://www.pace.edu/dyson/sections/meet-the-faculty/faculty-profile/pfuentesperalta\">Pamela Fuentes</a> profesora en el departamento de Estudios de las Mujeres y de Género en Pace University, también es una de las editoras de <a href=\"https://newbooksnetwork.com/es/\">New Books Network en español </a></p>",
  "itunes:duration": 2788,
  "itunes:explicit": "no",
  "guid": "91c1e266-e0da-11ec-baf7-ff1207f20ac2",
  "enclosure": ""
}