{
  "title": "Can Autonomous Weapons Be Compatible With International Humanitarian Law?",
  "link": "https://spectrum.ieee.org/autonomous-weapons-law",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/abstract-illustration-of-green-connected-lines-the-silhouette-of-heads-and-a-globe.jpg?id=31988636&width=1245&height=700&coordinates=0%2C337%2C0%2C338\"/><br/><br/><p><em><em>This article is part of our <a href=\"https://spectrum.ieee.org/collections/autonomous-weapons-challenges/\" target=\"_self\">Autonomous Weapons Challenges</a> series. The IEEE Standards Association is <a href=\"https://saforms.ieee.org/autonomous-weapons-participation/\" rel=\"noopener noreferrer\" target=\"_blank\">looking for your feedback</a> on this topic, and has invites you to answer <a href=\"https://saforms.ieee.org/autonomous-weapons-participation/\" rel=\"noopener noreferrer\" target=\"_blank\">these questions</a>.</em></em></p><p>\n\tThe real world is anything but binary. It is fuzzy and indistinct, with lots of options and potential outcomes, full of complexity and nuance. Our societies create laws and cultural norms to provide and maintain some semblance of order, but such structures are often open to interpretation, and they shift and evolve over time.\n</p><p>\n\tThis fuzziness can be challenging for any autonomous system navigating the uncertainty of a human world—such as Alexa reacting to the wrong conversations, or self-driving cars being stymied by \n\t<a href=\"https://www.archyde.com/tesla-hits-a-white-truck-again-with-two-passengers-rushing-to-icu-tesla-tesla-electric-car/\" rel=\"noopener noreferrer\" target=\"_blank\">white trucks</a> and<a href=\"https://www.theverge.com/2021/5/14/22436584/waymo-driverless-stuck-traffic-roadside-assistance-video\" rel=\"noopener noreferrer\" target=\"_blank\"> orange traffic cones</a>. But not having clarity on \"right or wrong\" is especially problematic when considering autonomous weapons systems (AWS).\n</p><p>\n\tInternational Humanitarian Law (IHL) is the body of laws that govern international military conflicts, and they provide rules about how weapons should be used. The fundamentals of IHL were developed before the widespread use of personal computers, satellites, the Internet, and social media, and before private data became a commodity that could be accessed remotely and often without a person’s knowledge or consent. \n\t<a href=\"https://www.stopkillerrobots.org/a-global-push/member-organisations/\" rel=\"noopener noreferrer\" target=\"_blank\">Many groups</a> are concerned that the existing laws don’t cover the myriad issues that recent and emerging technologies have created, and the International Committee of the Red Cross, the <a href=\"https://www.icrc.org/en/mandate-and-mission\" rel=\"noopener noreferrer\" target=\"_blank\">watchdog of IHL</a>, has <a href=\"https://www.icrc.org/en/document/icrc-position-autonomous-weapon-systems\" rel=\"noopener noreferrer\" target=\"_blank\">recommended new, legally binding rules </a>to cover AWS.\n</p><p>\n<a href=\"https://documents-dds-ny.un.org/doc/UNDOC/GEN/G19/343/64/PDF/G1934364.pdf?OpenElement\" rel=\"noopener noreferrer\" target=\"_blank\">Ethical principles</a> have been developed to help address gaps between changing cultural norms and technologies and established laws, but such principles also tend to be vague and difficult to translate into legal code. For example, even if everyone agrees on an ethical principle like minimizing bias in an autonomous system, how would that be programmed? Who would determine whether an algorithmic bias has been sufficiently “minimized” for the system to be deployed?\n</p><p>\n\tAll countries involved in the autonomous weapons systems (AWS) debate at the United Nations have stated that AWS must follow international law. However, they don’t agree on what these laws and ethics mean in practice, and there’s additional disagreement over whether some AWS capabilities must be preemptively banned in order to ensure that IHL is honored.\n</p><h3>IHL, Emerging Technology, and AWS</h3><p>\n\tMuch of the disagreement at the United Nations stems from the uncertainty surrounding the technology and how the technology will evolve in the future. Though existing weapons systems have some autonomous capabilities, and though there have been reports of \n\t<a href=\"https://www.npr.org/2021/06/01/1002196245/a-u-n-report-suggests-libya-saw-the-first-battlefield-killing-by-an-autonomous-d\" rel=\"noopener noreferrer\" target=\"_blank\">AWS being used in Libya</a> and <a href=\"https://www.csis.org/analysis/russia-probably-has-not-used-ai-enabled-weapons-ukraine-could-change\" rel=\"noopener noreferrer\" target=\"_blank\">questions about AWS being used</a> in Ukraine, the extent to which AI and autonomy will change warfare remains unknown. Even when IHL mandates already exist, it’s unclear that AWS will be able to follow them: For example, can a machine be trained to reliably recognize when a combatant is injured or surrendering? Is it possible for a machine to learn the difference between a civilian and a combatant dressed as a civilian?\n</p><p>\n\tCyberthreats pose new risks to national security, and the ability of companies and governments to collect personal data is already a controversial legal and ethical issue. These risks are only exacerbated when paired with AWS, which could be biased, hacked, trained on bad data, or otherwise compromised as a result of weak regulations surrounding emerging technologies.\n</p><p>\n\tMoreover, for AI systems to work, they typically need to be trained on huge data sets. But military conflict and battlefields can be chaotic and unpredictable, and large, reliable data sets may not exist. AWS may also be subject to greater adversarial manipulation, which, essentially, involves tricking the system into misunderstanding the situation–something that can be as easy to do as \n\t<a href=\"https://www.theverge.com/2018/1/3/16844842/ai-computer-vision-trick-adversarial-patches-google\" rel=\"noopener noreferrer\" target=\"_blank\">placing a sticker on or near an object</a>. Is it possible for AWS algorithms to receive sufficient training and supervision to ensure they won’t violate international laws, and who makes that decision?\n</p><p>\n\tAWS are complex, with various people and organizations involved at different stages of development, and communication between designers and users of the systems may not exist. Additionally, the algorithms and AI software used in AWS may not have originally been intended for military use, or they may have been intended for the military but not for weapons specifically. To ensure the safety and reliability of AWS, new standards for testing, evaluation, verification, and validation are needed. And if an automated weapons system acts inappropriately or unexpectedly and causes unintended harm, will it be clear who is at fault?\n</p><h3>Nonmilitary Use of AWS</h3><p>\n\tWhile certain international laws cover human rights issues during a war, separate laws cover human rights issues in all other circumstances. Simply prohibiting a weapons system from being used during wartime does not guarantee that the system can’t be used outside of military combat. For example, \n\t<a href=\"https://theconversation.com/tear-gas-and-pepper-spray-are-chemical-weapons-so-why-can-police-use-them-140364\" rel=\"noopener noreferrer\" target=\"_blank\">tear gas</a> has been classified as a chemical weapon and banned in warfare since 1925, but it remains legal for law enforcement to use for riot control.\n</p><p>\n\tIf new international laws are developed to regulate the wartime use of AI and autonomy in weapons systems, human rights violations committed outside of the scope of a military action could—and likely would—still occur. The latter could include actions by private security companies, police, border control agencies, and nonstate armed groups.\n</p><p>\n\tUltimately, in order to ensure that laws, policy, and ethics are well adapted to the new technologies of AWS—and that AWS are designed to better abide by international laws and norms—policymakers need to have a stronger understanding of the technical capabilities and limitations of the weapons, and how the weapons might be used.\n</p><div class=\"ieee-sidebar-large\">\n<h3>What Do You Think?</h3>\n<p>\n\tWe want your feedback! To help bring clarity to these AWS discussions, the \n\t<a href=\"https://standards.ieee.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Standards Association</a> convened an expert group in 2020, to consider the ethical and technical challenges of translating AWS principles into practice and what that might mean for future development and governance. Last year, the expert group published its findings in a report entitled “<a href=\"https://standards.ieee.org/wp-content/uploads/import/documents/other/ethical-technical-challenges-autonomous-weapons-systems.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">Ethical and Technical Challenges in the Development, Use, and Governance of Autonomous Weapons Systems</a>.” Many of the AWS challenges are similar to those arising in other fields that are developing autonomous systems. We expect and hope that IEEE members and readers of <em>IEEE Spectrum</em> will have insights from their own fields that can inform the discussion around AWS technologies.\n</p>\n<p>\n\tWe’ve put together a <a href=\"https://saforms.ieee.org/autonomous-weapons-participation/\" rel=\"noopener noreferrer\" target=\"_blank\">series of questions</a> in the <a href=\"https://standards.ieee.org/wp-content/uploads/import/documents/other/ethical-technical-challenges-autonomous-weapons-systems.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">Challenges document</a> that we hope you’ll answer, to help us better understand how people in other fields are addressing these issues. Autonomous capabilities will increasingly be applied to weapons systems, much as they are being applied in other realms, and we hope that by looking at the challenges in more detail, we can help establish effective technical solutions, while contributing to discussions about what can and should be legally acceptable. Your feedback will help us move toward this ultimate goal. <a href=\"https://saforms.ieee.org/autonomous-weapons-participation/\" rel=\"noopener noreferrer\" target=\"_blank\">Public comments will be open through 7 December 2022</a>.\n</p></div>",
  "pubDate": "Thu, 03 Nov 2022 13:24:56 +0000",
  "guid": "https://spectrum.ieee.org/autonomous-weapons-law",
  "category": [
    "Autonomous weapons",
    "Aws",
    "Robotics"
  ],
  "dc:creator": "Ariel Conn",
  "media:content": ""
}