{
  "id": "yt:video:wZJoE6TjwKY",
  "yt:videoId": "wZJoE6TjwKY",
  "yt:channelId": "UCnQC_G5Xsjhp9fEJKuIcrSw",
  "title": "Bill Lee | The Ben Shapiro Show Sunday Special Ep. 133",
  "link": "",
  "author": {
    "name": "Ben Shapiro",
    "uri": "https://www.youtube.com/channel/UCnQC_G5Xsjhp9fEJKuIcrSw"
  },
  "published": "2022-11-05T06:10:13+00:00",
  "updated": "2022-11-05T10:05:01+00:00",
  "media:group": {
    "media:title": "Bill Lee | The Ben Shapiro Show Sunday Special Ep. 133",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Daily Wire members get access to Ben Shapiro's Sunday Special on SATURDAY! Click here to sign up for a membership: https://bit.ly/3U3ClhY\n\nRepublicans are gaining momentum in key midterms races; and with federalism on the rise in our politics, watching republicans thrive in the gubernatorial races has been encouraging. In this episode, Governor Bill Lee of Tennessee joins us to discuss his own race for re-election and the current state of our country.\n\nBefore entering politics in 2018, Governor Lee was president of his grandfather’s business, where his leadership took the company’s annual revenue from $20 million to $140 million. His success in business has informed his governing policy; and as a result many companies, including The Daily Wire, have resettled in Tennessee in the wake of disastrous democratic policy. \n\nIn Nashville, recent controversy at Vanderbilt University over transgender programs has directly involved Governor Lee in statewide protection of children. We will discuss. Plus, Lee breaks down his plans for abortion bans, job growth in TN, and places conservatives can win in the coming years.\n\nBecome a Daily Wire member to get access to bonus questions with Governor Lee: https://bit.ly/3U3ClhY\n\nCheck out more of Ben Shapiro here:\nYouTube: https://bit.ly/30AnoII\nTwitter: https://twitter.com/benshapiro\nFacebook: https://www.facebook.com/officialbenshapiro\nInstagram: https://www.instagram.com/officialbenshapiro \n \n#BenShapiro #DailyWire #BillLee #Politics #Elections2022",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}