{
  "title": "Twitter Should Moderate Communities, Not Content",
  "link": "https://www.aei.org/technology-and-innovation/twitter-should-moderate-communities-not-content/",
  "dc:creator": "Matthew Glavish",
  "pubDate": "Wed, 02 Nov 2022 10:00:00 +0000",
  "category": [
    "Technology and Innovation",
    "Censorship",
    "Elon Musk",
    "google",
    "internet",
    "Online Speech Project",
    "twitter"
  ],
  "guid": "https://www.aei.org/?p=1008664512",
  "description": "<p>Rather than playing Sisyphus in the content moderation theatrics, Twitter should instead borrow from reputation systems to incentivize community moderation to reward people for platform credibility and moderate behavior.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/technology-and-innovation/twitter-should-moderate-communities-not-content/\">Twitter Should Moderate Communities, Not Content</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n",
  "content:encoded": "\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" width=\"1800\" height=\"250\" src=\"https://www.aei.org/wp-content/uploads/2022/05/AEIsection230banner.png?x91208\" alt=\"\" class=\"wp-image-1008627382\"/><figcaption>Note: This post and all affiliated content are part of AEI’s Online Speech Project. To learn more about the project, click <a href=\"https://www.aei.org/online-speech-project/\" target=\"_blank\" rel=\"noreferrer noopener\">here</a>.</figcaption></figure>\n\n\n\n<p>With Elon Musk’s acquisition of Twitter now finalized, the issue of how he is going to run the company is fully joined. Musk <a href=\"https://twitter.com/elonmusk/status/1586149451348910081\" target=\"_blank\" rel=\"noreferrer noopener\">announced</a> that there would be no change to Twitter’s content policies until a “content moderation council” is convened. It’s a good time to consider the truly vast range of options available to Musk and Twitter. In my opinion, Twitter should de-emphasize content moderation in favor of <em>community</em> moderation.</p>\n\n\n\n<p>In <a href=\"https://www.aei.org/research-products/testimony/testimony-privacy-and-other-challenges-for-mandated-internet-platform-disclosure/\" target=\"_blank\" rel=\"noreferrer noopener\">testimony</a> to the Senate Judiciary Committee earlier this year, I discussed content moderation in the context of a proposal to <a href=\"https://www.aei.org/technology-and-innovation/mandated-platform-transparency-speech-regulation-is-in-the-air-everywhere/\" target=\"_blank\" rel=\"noreferrer noopener\">force transparency</a> on internet platforms. I noted how some users are relentless in their efforts to reverse engineer and then evade every content moderation policy and practice. Content moderation is similar to platform security; attackers are motivated, adaptive, and wily.</p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" width=\"2610\" height=\"1740\" src=\"https://www.aei.org/wp-content/uploads/2022/11/Musk-Twitter-Complaint-Hotline-Operator.jpg?x91208\" alt=\"\" class=\"wp-image-1008664515\"/><figcaption>via Reuters</figcaption></figure>\n\n\n\n<p>As I did in my testimony, my colleague Daniel Lyons recently <a href=\"https://www.aei.org/technology-and-innovation/elon-musk-confronts-the-moderators-dilemma-holds-mirror-to-users/\" target=\"_blank\" rel=\"noreferrer noopener\">discussed</a> giving content moderation tools to users. That would be consistent with what makes the internet great: This “dumb” network pushes innovation and responsibility to the edges, <a href=\"https://fee.org/articles/decentralization-why-dumb-networks-are-better/\" target=\"_blank\" rel=\"noreferrer noopener\">which is smart</a>. With tools in hand, users can array their motivations, adaptability, and wiles against social attackers. Importantly, this can weaken the bipartisan political demand for companies to “fix” content.</p>\n\n\n\n<p>But users may not be able to overcome their fascination with conflict.</p>\n\n\n\n<p>Twitter need not wait for users to mature on their own. Information that can tune the community’s zeitgeist are there to be harvested. Think in terms of reputation systems.</p>\n\n\n\n<p>Credit reporting and Google’s <a href=\"https://www.google.com/search/howsearchworks/how-search-works/ranking-results/#quality\" target=\"_blank\" rel=\"noreferrer noopener\">PageRank algorithm</a> are both reputation systems. They use information gathered from third parties to gauge a given resource’s reliability. In the case of credit reporting, records of reliable bill payments tell you how likely a person is to pay bills in the future.</p>\n\n\n\n<p>In PageRank, the focus is on links. A hyperlink from one web page to another is a vote saying, “This resource is good.” Pages with more links pointing their way are probably better resources than pages with fewer. The process is recursive: If a web page that others recognize as a good resource points to another web page, that can be treated as a stronger up vote than the vote of a lower-ranked page.</p>\n\n\n\n<p>The same type of process can animate Twitter’s curation of community. <em>In general</em>: Follows are votes. Retweets are votes. Replies are votes. And so on.</p>\n\n\n\n<p>Those indicia are subject to gaming. But many others are harder to game, or they can’t be gamed at all. All of them can be fed into a reputation algorithm that rewards productive contribution and disincentivizes antisocial behavior.</p>\n\n\n\n<p>How long has an account existed? How much does an account parrot others or itself? Does the account have the daily, weekly, and monthly participation cadence of a well-adjusted human? Has the account holder submitted (optional) proof of identity? <a href=\"https://twitter.com/elonmusk/status/1587498907336118274\" target=\"_blank\" rel=\"noreferrer noopener\">Paid a fee</a>? Does the account connect from a normal distribution of IP addresses? Does the account have a variegated (non-bubble) network of followers and followees? Does the account follow links? How long does the account take to write tweets or replies? Does the account abandon and delete tweets? Does the tenor or language of an account’s interactions follow healthy patterns? Does the account respond to randomized <a href=\"http://www.captcha.net/\" target=\"_blank\" rel=\"noreferrer noopener\">CAPTCHAs</a>?</p>\n\n\n\n<p>Some of these data are probably used now to help root out “fake” accounts. All these things and many more could be tested as dials that tune the community toward normalcy by increasing the public availability of “healthy” accounts.</p>\n\n\n\n<p>There is no need for this approach to be a <a href=\"https://www.arimetrics.com/en/digital-glossary/black-box-algorithm\" target=\"_blank\" rel=\"noreferrer noopener\">black box</a> eliciting paranoid claims of <a href=\"https://www.theatlantic.com/technology/archive/2022/04/social-media-shadowbans-tiktok-twitter/629702/\" target=\"_blank\" rel=\"noreferrer noopener\">shadow banning</a>. Publish at least summary guidelines of what the algorithm prefers so that people can adjust their behavior accordingly. If an obsessive person must post judiciously to be heard, so be it. If a “fake” account must act like a healthy human to survive, what’s the difference?</p>\n\n\n\n<p>If you think this style of moderation is impossible, consider an arena in which people actually earn money by defeating a reputation system. That’s Google. And Google has done this kind of moderation at scale. Ask <a href=\"https://searchengineland.com/google-head-web-spam-221482\" target=\"_blank\" rel=\"noreferrer noopener\">Matt Cutts</a>. Google keeps “search engine optimization” in check well enough to continue thriving as a business.</p>\n\n\n\n<p>In opining here, I’ve said nothing about the substantive content of tweets. Other than universally disapproved gore, scatology, and so on, it’s a fool’s errand to try to moderate content based on content. The alternative is moderating communities—not in the censorious mode that addresses what people can say, but in a civilizing mode that addresses how people can act. Regardless of content, Twitter can give more voice to people whose behavior is moderate.</p>\n\n\n<div class=\"related-items shortcode \"><p><strong>See also:  </strong><a href=\"https://www.aei.org/technology-and-innovation/elon-musk-confronts-the-moderators-dilemma-holds-mirror-to-users/\">Elon Musk Confronts the Moderator’s Dilemma and Holds a Mirror to Users</a> | <a href=\"https://www.aei.org/technology-and-innovation/mandated-platform-transparency-speech-regulation-is-in-the-air-everywhere/\">Mandated Platform Transparency: Speech Regulation Is in the Air Everywhere</a> | <a href=\"https://www.aei.org/technology-and-innovation/market-solutions-for-social-media-content-moderation/\">Market Solutions for Social Media Content Moderation</a> | <a href=\"https://www.aei.org/events/separating-fact-from-fiction-election-disinformation-on-online-platforms/\">Separating Fact from Fiction: Election Disinformation on Online Platforms</a></p></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/technology-and-innovation/twitter-should-moderate-communities-not-content/\">Twitter Should Moderate Communities, Not Content</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n"
}