{
  "title": "S1E66 - Confidence is the Answer to Fear with High Performance Coach Rebecca Smith",
  "guid": "https://pinecast.com/guid/4b9b5dea-2428-4197-ab8f-da592a5872d5",
  "pubDate": "Thu, 15 Sep 2022 07:30:00 -0000",
  "itunes:duration": "00:57:48",
  "description": "<p>Today, Laura welcomes Rebecca Smith, the Founder and CEO of Complete Performance Coaching and PerformHappy, who has been helping high achievers thrive under pressure for more than 20 years. A former gymnast herself and a fellow recovering perfectionist, Rebecca understands very well the mental health challenges that professional athletes have to go through. Having struggled with mental blocks for years, she eventually quit her gymnastics career and decided to move on. Now, she’s committed to helping young athletes nurture their mental health while still winning competitions. Her unique evidence-based approach helps fearful young athletes discover the confidence to stand up for themselves when faced with the notorious toxic culture of youth sport.</p>\n<p>On this episode of the Pursuit of Gold podcast, Laura and Rebecca discuss mental blocks and how to overcome them. Rebecca shares her own story dealing with perfectionism, how mental blocks destroyed her gymnastics career yet helped her to uncover effective tactics for getting over them. She explains the two main parts of overcoming a mental block: the physical side and the mental side. Once you overcome the physical part, you need to work on maintaining a healthy relationship with yourself, meaning build your self-awareness and inner confidence. These two are fundamental to your self-growth. Rebecca goes on to share a few more useful tactics for overcoming mental blocks, such as turning nervousness into excitement, practicing mindfulness, and front-loading confidence. Finally, Laura and Rebecca wrap up the episode by touching upon the importance of having a supportive coach, emphasizing the fact that a positive environment sets the tone for success.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>Rebecca’s gymnastics background and moving past mental blocks</li>\n<li>Winning the battle against perfectionism</li>\n<li>The importance of praising effort versus talent</li>\n<li>The incredible power of imagination and creativity for your competence</li>\n<li>The two parts to overcoming a mental block</li>\n<li>Increasing and front-loading confidence to avoid mental blocks</li>\n<li>Turning nervousness into excitement</li>\n<li>Practicing the mindful warmup and being present</li>\n<li>Dealing with injuries as a professional athlete</li>\n<li>Mental health and motivation during COVID</li>\n<li>The importance of a supportive and positive environment for athletes</li>\n<li>Supporting young athletes as a parent</li>\n</ul>\n<p>Quotes:</p>\n<ul>\n<li>“Their parents are like, ‘She’s the best tumbler anyone's ever seen, why can't she just go do it?’ And there's this because there's just such a combination of factors that lead to mental block. One of them is that it's the pressure of being amazing, being perfect.”</li>\n<li>“Our brain only cares about keeping us safe. That's the only thing. It doesn't care about competitions. It doesn't care about scores, or metals or places, or deadlines, or any of that stuff It only cares about ‘keep the body alive.’”</li>\n<li>“She was the kid who was a hard worker with heart. She was not the most talented kid on our team. But so, with that being said, if you want to move forward, you can't wait for your magic talent fairy to bless you with the ability to do your skill again, it just isn't going to work.”</li>\n<li>“There is this huge kind of internal component that's all about connecting with your own joy and your own choice. Because if you don't, if you feel like you're doing it for anybody, but you, you're going to get burned out, it's just the way it goes.”</li>\n<li>“Excitement and nerves are both high arousal, physical states. So, your heart's beating, you're a little more fidgety, you've got a little more energy, it is a lot easier to go from nervous to excited than it is to go from nervous to calm, especially when you only have moments before you compete.”</li>\n<li>“Injuries, just like mental blocks, are part of the deal. For a lot of athletes, it's just a setback. And so, the worst thing you can do is compare yourself to where you should be or could be or where your friend is or where you would like to be because all that does is create self-pity.”</li>\n</ul>\n<p><a href=\"https://www.kaatsu.com/go/PURSUIT\" rel=\"nofollow\">Pursuit of Gold Podcast is brought to you by Kaatsu Global</a></p>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold</a>\n<a href=\"https://laurawilkinson.com/coaching\" rel=\"nofollow\">1-on-1 Coaching with Laura</a>\n<a href=\"https://www.laurawilkinson.com/journal\" rel=\"nofollow\">The Confidence Journal</a>\n<a href=\"https://laurawilkinson.com/book\" rel=\"nofollow\">Life at 10 Meters: Lessons from an Olympic Champion</a></p>\n<p>Laura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura’s Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura’s Facebook</a></p>\n<p>Connect with Rebecca:\n<a href=\"https://www.linkedin.com/in/rebecca-smith-ma/\" rel=\"nofollow\">Rebecca’s LinkedIn</a>\n<a href=\"https://www.instagram.com/complete_performance/\" rel=\"nofollow\">Rebecca’s Instagram</a></p>",
  "itunes:title": "Confidence is the Answer to Fear with High Performance Coach Rebecca Smith",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 66
}