{
  "title": "Mid-Year Outlook: European Energy & Growth Challenges",
  "description": "<p>With rising prices already on the minds of investors and consumers, the outlook in Europe remains challenged across supply chains, inflation rates and energy markets. Chief European Economist Jens Eisenschmidt and Global Oil Strategist and Head of the European Energy Team Martijn Rats discuss.</p><p><br></p><p>-----Transcript-----</p><p><br></p><p><strong>Jens Eisenschmidt:</strong> Welcome to Thoughts on the Market. I'm Jens Eisenschmidt, Morgan Stanley's Chief European Economist.&nbsp;</p><p><br></p><p><strong>Martijn Rats:</strong> And I'm Martijn Rats, Morgan Stanley's Global Commodity Strategist and Head of the European Energy Research Team.&nbsp;</p><p><br></p><p><strong>Jens Eisenschmidt:</strong> And today on the podcast, we will be talking about the outlook for the European economy for the next 12 months in the very challenging context of rising energy prices and sustained inflationary pressure. It's Thursday, May 19, at 4 p.m. in London.&nbsp;</p><p><br></p><p><strong>Jens Eisenschmidt:</strong> So, Martin, I wanted to talk with you today about some burning issues that seem to be topmost on everybody's mind these days, namely rising energy prices and inflation. These challenges are affecting literally everyone. And Europe, in particular, is acutely feeling the impact from the war in Ukraine. Let's maybe pick up with a topic you discussed on this podcast back in January. So even prior to the war in Ukraine, you talked about five enduring tailwinds boosting commodities. So far in 22, commodities are on track to outperform equities for the second consecutive year. Now that we are approaching the mid-year mark, what's your outlook for the second half of 22 in terms of commodities and which ones are likely to outperform the most in the current environment?&nbsp;</p><p><br></p><p><strong>Martijn Rats:</strong> Some things have changed, but also a lot of things are still the same when it comes to the outlook for commodities. Commodities move in long cycles. The last decade was, on the whole, more challenging, but we think that we're still in the relatively early innings of what could be a long cycle ahead. You already mentioned the five enduring tailwinds that we've previously written about and discussed on podcasts like this. First of all, is inflation. Commodities often do well in inflationary periods, and the inflationary pressures are still there, that's one. Secondly, geopolitical risk. Thirdly, there's the energy transition. For a broad range of commodities the energy transition is a demand tailwind, but for a lot of others, it's basically a red flag not to invest in supply. Then fourthly, a lot of commodities have gone through a long period of very little investment. That sets up a tighter supply outlook. And then finally there's reopening. A lot of reopening has already played out, but there are still important pockets of reopening that have yet to fully materialize. A lot of that thesis is still the same. And I would expect that this will carry the commodity asset class for some time. Now, in terms of how things have changed at the start of the year, we were more optimistic about demand for a lot of commodities, and those expectations have come down a little bit because the economic slowdown, because of China. But we were also more optimistic about the supply for those commodities. We've seen a lot of headwinds in terms of the supply of a broad range of commodities, particularly because of the war in the Ukraine. So net net our balances are broadly still equally tight, if not slightly tighter, and that's to still set up the commodity asset class quite well. Also for the second half, the ones that we prefer the most, it's mostly the energy commodities. We think they'll do better than the metals. That is already happening as we speak, but there is more to come in that relative trade in the second half as well.&nbsp;</p><p><br></p><p><strong>Jens Eisenschmidt:</strong> Let's talk a little bit about oil. You've said that you continue to see upside to oil prices, even though the nature of your thesis has changed since the start of the year. Could you walk us through your thinking specifically around oil?&nbsp;</p><p><br></p><p><strong>Martijn Rats:</strong> Yes. At the start of the year, we were thinking that oil demand could grow this year by something like 3.5 to 4 million barrels a day, year over year compared to 2021. And that expectation had turned out to be too optimistic. There are basically two reasons for that. First of all, is China. The Zero-Covid policies in China and the stringent lockdowns that have come with that means that at the moment we're probably losing something like 1.5 to 2 million barrels a day of oil demand in China right now. Now, that might not last the entire year, but there is a material effect. And then also economic growth expectations have come down. And as a result, we also had to moderate our oil demand forecasts. But then on the supply side, we had to make even bigger changes. Russian production has fallen by broadly a million barrels a day already, and we think that that will continue to fall by another million barrels a day in the second half of the year. So when you add it all up, I'm sure our demand expectations have fallen, but they are already at a level that I would say is reflective of the current situation while there's still meaningful supply risks and when you put those two things combined, actually our balances are even slightly tighter than they were at the start of the year. Hence the call, as we've had it for a while, for $130 brent by the third quarter.&nbsp;</p><p><br></p><p><strong>Jens Eisenschmidt:</strong> Turning to the European gas markets. Gas prices in Europe are roughly five times as high as in the U.S., reflecting the increased risk to Russian supply created by the war in Ukraine. What are your expectations in terms of Europe following through on its intent to phase out Russian gas? And what potential scenarios do you see playing out here?&nbsp;</p><p><br></p><p><strong>Martijn Rats:</strong> The story about European gas is is quite a bit different from what it is to oil. There is clearly heightened risk in the European gas market right now that is reflected in price. As a result, the price is well above historical levels, is well above the levels that prevail in the United States. But that also means that a lot of the world's seaborne gas, a lot of those cargoes of LNG at the moment are ending up in Europe. At the same time. Russian flows of natural gas into Europe are low, but they by and large continue. And when you put all of that together, actually, judging by, you know, the normal fundamental metrics that we look at, the European gas market right here, right now today is actually relatively soft. But all of that is, of course, drowned out by the risk that Russian supplies may be impacted. Now, that remains very difficult to call in the short run. That's also the reason why you see European gas prices being so volatile. What does strike us to be the case is that Europe will wean itself off Russian gas over the next sort of 5, 6, 7 years towards the end of the decade. That will require a lot of LNG to come to Europe and also a fair amount of demand erosion. Neither of these things will happen with low prices. We have low conviction on what happens to European natural gas prices in the short run, admittedly, but we have high conviction that gas prices will need to stay high, if not very high by historical standards for several years to come to allow the European gas markets to move away from Russian supplies.</p><p><br></p><p><strong>Jens Eisenschmidt:</strong> Maybe one last word on metals. What are your expectations for metals, especially vis a vis what you just said about energy?&nbsp;</p><p><br></p><p><strong>Martijn Rats:</strong> If you look at metals for most of the metals, practically all of them, China is a huge factor in setting the demand outlook. So where would we be cautious at the moment is in the precise trajectory of the demand recovery in China. At the same time, we are quite concerned about the supply outlook, particularly as of Russia. So if you put all of that together, the metals suffer much more from weak Chinese demand, whilst the energy commodities are much more impacted by tight supply because of the Russian situation. So our preference over the last couple of months, for some time already, to be honest, has been to prefer the energy commodities. Whilst we think that the metals will probably stay a little weaker for some time to come because of their dominant exposure to Chinese demands factors. So there is a strong story to be told about many of the metals over the next sort of 5, 6, 7 years around energy transition. But right here, right now, we're biding our time a little bit with the metals. Jens, the 1Q GDP and inflation numbers confirms that supply shocks are hitting hard on the European economy, even after its strong post-COVID recovery in 2021. In your mid-year outlook, you refer to the set of challenges facing Europe as a perfect storm. Tell us why the situation looks so challenging from where you stand.&nbsp;</p><p><br></p><p><strong>Jens Eisenschmidt:</strong> Yes, you're right, Martin. It's very difficult in these days to get very optimistic about the growth outlook. I mean, we started the year actually on a much brighter note with a growth outlook of 3.9% for 22 for the euro area and had to revise it consecutively down to 3 to 2.7 and now to 2.6. And this is all on the back of as you mentioned, supply side shocks. First of all, we would have, of course, a huge hit to disposable income through inflation. Also, as we don't really see the wage developments catching quite up to that number. We are facing here a shock to confidence that we have seen emanating from both the war, but also from more generally the developments surrounding us. We have recently seen news from increased chances for more supply chain issues coming our way, for instance, out of China. Plus, on the other side of the Atlantic, the Federal Reserve has started to aggressively rein into their inflation that has significant domestic demand component to it. Overall, it's very difficult to see really bright spots here. That's why we have arrived at 2.6% in our forecast, that is despite significant dynamics coming out from the reopening and fiscal stimulus being on the road. So overall, it's a very challenging environment we are in.&nbsp;</p><p><br></p><p><strong>Jens Eisenschmidt:</strong> Martijn, thanks for taking the time to talk.&nbsp;</p><p><br></p><p><strong>Martijn Rats</strong>: Thanks, Jens was great to speak with you.&nbsp;</p><p><br></p><p><strong>Jens Eisenschmidt:</strong> And thanks for listening. If you enjoy Thoughts on the Market, please leave us a review on Apple Podcasts and share the podcast with a friend or colleague today. </p>",
  "itunes:title": "Mid-Year Outlook: European Energy & Growth Challenges",
  "itunes:episodeType": "full",
  "itunes:episode": 620,
  "itunes:summary": "With rising prices already on the minds of investors and consumers, the outlook in Europe remains challenged across supply chains, inflation rates and energy markets. Chief European Economist Jens Eisenschmidt and Global Oil Strategist and Head of the European Energy Team Martijn Rats discuss.",
  "content:encoded": "<p>With rising prices already on the minds of investors and consumers, the outlook in Europe remains challenged across supply chains, inflation rates and energy markets. Chief European Economist Jens Eisenschmidt and Global Oil Strategist and Head of the European Energy Team Martijn Rats discuss.</p><p><br></p><p>-----Transcript-----</p><p><br></p><p><strong>Jens Eisenschmidt:</strong> Welcome to Thoughts on the Market. I'm Jens Eisenschmidt, Morgan Stanley's Chief European Economist.&nbsp;</p><p><br></p><p><strong>Martijn Rats:</strong> And I'm Martijn Rats, Morgan Stanley's Global Commodity Strategist and Head of the European Energy Research Team.&nbsp;</p><p><br></p><p><strong>Jens Eisenschmidt:</strong> And today on the podcast, we will be talking about the outlook for the European economy for the next 12 months in the very challenging context of rising energy prices and sustained inflationary pressure. It's Thursday, May 19, at 4 p.m. in London.&nbsp;</p><p><br></p><p><strong>Jens Eisenschmidt:</strong> So, Martin, I wanted to talk with you today about some burning issues that seem to be topmost on everybody's mind these days, namely rising energy prices and inflation. These challenges are affecting literally everyone. And Europe, in particular, is acutely feeling the impact from the war in Ukraine. Let's maybe pick up with a topic you discussed on this podcast back in January. So even prior to the war in Ukraine, you talked about five enduring tailwinds boosting commodities. So far in 22, commodities are on track to outperform equities for the second consecutive year. Now that we are approaching the mid-year mark, what's your outlook for the second half of 22 in terms of commodities and which ones are likely to outperform the most in the current environment?&nbsp;</p><p><br></p><p><strong>Martijn Rats:</strong> Some things have changed, but also a lot of things are still the same when it comes to the outlook for commodities. Commodities move in long cycles. The last decade was, on the whole, more challenging, but we think that we're still in the relatively early innings of what could be a long cycle ahead. You already mentioned the five enduring tailwinds that we've previously written about and discussed on podcasts like this. First of all, is inflation. Commodities often do well in inflationary periods, and the inflationary pressures are still there, that's one. Secondly, geopolitical risk. Thirdly, there's the energy transition. For a broad range of commodities the energy transition is a demand tailwind, but for a lot of others, it's basically a red flag not to invest in supply. Then fourthly, a lot of commodities have gone through a long period of very little investment. That sets up a tighter supply outlook. And then finally there's reopening. A lot of reopening has already played out, but there are still important pockets of reopening that have yet to fully materialize. A lot of that thesis is still the same. And I would expect that this will carry the commodity asset class for some time. Now, in terms of how things have changed at the start of the year, we were more optimistic about demand for a lot of commodities, and those expectations have come down a little bit because the economic slowdown, because of China. But we were also more optimistic about the supply for those commodities. We've seen a lot of headwinds in terms of the supply of a broad range of commodities, particularly because of the war in the Ukraine. So net net our balances are broadly still equally tight, if not slightly tighter, and that's to still set up the commodity asset class quite well. Also for the second half, the ones that we prefer the most, it's mostly the energy commodities. We think they'll do better than the metals. That is already happening as we speak, but there is more to come in that relative trade in the second half as well.&nbsp;</p><p><br></p><p><strong>Jens Eisenschmidt:</strong> Let's talk a little bit about oil. You've said that you continue to see upside to oil prices, even though the nature of your thesis has changed since the start of the year. Could you walk us through your thinking specifically around oil?&nbsp;</p><p><br></p><p><strong>Martijn Rats:</strong> Yes. At the start of the year, we were thinking that oil demand could grow this year by something like 3.5 to 4 million barrels a day, year over year compared to 2021. And that expectation had turned out to be too optimistic. There are basically two reasons for that. First of all, is China. The Zero-Covid policies in China and the stringent lockdowns that have come with that means that at the moment we're probably losing something like 1.5 to 2 million barrels a day of oil demand in China right now. Now, that might not last the entire year, but there is a material effect. And then also economic growth expectations have come down. And as a result, we also had to moderate our oil demand forecasts. But then on the supply side, we had to make even bigger changes. Russian production has fallen by broadly a million barrels a day already, and we think that that will continue to fall by another million barrels a day in the second half of the year. So when you add it all up, I'm sure our demand expectations have fallen, but they are already at a level that I would say is reflective of the current situation while there's still meaningful supply risks and when you put those two things combined, actually our balances are even slightly tighter than they were at the start of the year. Hence the call, as we've had it for a while, for $130 brent by the third quarter.&nbsp;</p><p><br></p><p><strong>Jens Eisenschmidt:</strong> Turning to the European gas markets. Gas prices in Europe are roughly five times as high as in the U.S., reflecting the increased risk to Russian supply created by the war in Ukraine. What are your expectations in terms of Europe following through on its intent to phase out Russian gas? And what potential scenarios do you see playing out here?&nbsp;</p><p><br></p><p><strong>Martijn Rats:</strong> The story about European gas is is quite a bit different from what it is to oil. There is clearly heightened risk in the European gas market right now that is reflected in price. As a result, the price is well above historical levels, is well above the levels that prevail in the United States. But that also means that a lot of the world's seaborne gas, a lot of those cargoes of LNG at the moment are ending up in Europe. At the same time. Russian flows of natural gas into Europe are low, but they by and large continue. And when you put all of that together, actually, judging by, you know, the normal fundamental metrics that we look at, the European gas market right here, right now today is actually relatively soft. But all of that is, of course, drowned out by the risk that Russian supplies may be impacted. Now, that remains very difficult to call in the short run. That's also the reason why you see European gas prices being so volatile. What does strike us to be the case is that Europe will wean itself off Russian gas over the next sort of 5, 6, 7 years towards the end of the decade. That will require a lot of LNG to come to Europe and also a fair amount of demand erosion. Neither of these things will happen with low prices. We have low conviction on what happens to European natural gas prices in the short run, admittedly, but we have high conviction that gas prices will need to stay high, if not very high by historical standards for several years to come to allow the European gas markets to move away from Russian supplies.</p><p><br></p><p><strong>Jens Eisenschmidt:</strong> Maybe one last word on metals. What are your expectations for metals, especially vis a vis what you just said about energy?&nbsp;</p><p><br></p><p><strong>Martijn Rats:</strong> If you look at metals for most of the metals, practically all of them, China is a huge factor in setting the demand outlook. So where would we be cautious at the moment is in the precise trajectory of the demand recovery in China. At the same time, we are quite concerned about the supply outlook, particularly as of Russia. So if you put all of that together, the metals suffer much more from weak Chinese demand, whilst the energy commodities are much more impacted by tight supply because of the Russian situation. So our preference over the last couple of months, for some time already, to be honest, has been to prefer the energy commodities. Whilst we think that the metals will probably stay a little weaker for some time to come because of their dominant exposure to Chinese demands factors. So there is a strong story to be told about many of the metals over the next sort of 5, 6, 7 years around energy transition. But right here, right now, we're biding our time a little bit with the metals. Jens, the 1Q GDP and inflation numbers confirms that supply shocks are hitting hard on the European economy, even after its strong post-COVID recovery in 2021. In your mid-year outlook, you refer to the set of challenges facing Europe as a perfect storm. Tell us why the situation looks so challenging from where you stand.&nbsp;</p><p><br></p><p><strong>Jens Eisenschmidt:</strong> Yes, you're right, Martin. It's very difficult in these days to get very optimistic about the growth outlook. I mean, we started the year actually on a much brighter note with a growth outlook of 3.9% for 22 for the euro area and had to revise it consecutively down to 3 to 2.7 and now to 2.6. And this is all on the back of as you mentioned, supply side shocks. First of all, we would have, of course, a huge hit to disposable income through inflation. Also, as we don't really see the wage developments catching quite up to that number. We are facing here a shock to confidence that we have seen emanating from both the war, but also from more generally the developments surrounding us. We have recently seen news from increased chances for more supply chain issues coming our way, for instance, out of China. Plus, on the other side of the Atlantic, the Federal Reserve has started to aggressively rein into their inflation that has significant domestic demand component to it. Overall, it's very difficult to see really bright spots here. That's why we have arrived at 2.6% in our forecast, that is despite significant dynamics coming out from the reopening and fiscal stimulus being on the road. So overall, it's a very challenging environment we are in.&nbsp;</p><p><br></p><p><strong>Jens Eisenschmidt:</strong> Martijn, thanks for taking the time to talk.&nbsp;</p><p><br></p><p><strong>Martijn Rats</strong>: Thanks, Jens was great to speak with you.&nbsp;</p><p><br></p><p><strong>Jens Eisenschmidt:</strong> And thanks for listening. If you enjoy Thoughts on the Market, please leave us a review on Apple Podcasts and share the podcast with a friend or colleague today. </p>",
  "guid": "gid://art19-episode-locator/V0/n8f3Tf2gxK5pZnSlk0m_iC3ZHFqDCslQ6snXGRnoXHc",
  "pubDate": "Fri, 20 May 2022 00:58:55 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:keywords": "market-trends,sustainability",
  "itunes:duration": "00:09:36",
  "enclosure": ""
}