{
  "title": "Meet the Lunar Gateway’s Robot Caretakers",
  "link": "https://spectrum.ieee.org/lunar-gateway-robots",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/an-artist-s-concept-of-a-large-robotic-arm-on-the-exterior-of-a-space-station-orbiting-the-moon.jpg?id=29647407&width=1500&height=2000&coordinates=555%2C0%2C555%2C0\"/><br/><br/><p>\n\tAn integral part of NASA’s plan to return astronauts to the moon this decade is the \n\t<a href=\"https://www.nasa.gov/gateway\" target=\"_blank\">Lunar Gateway</a>, a space station that will be humanity’s first permanent outpost outside of low Earth orbit. Gateway, a partnership between <a href=\"http://nasa.gov\" target=\"_blank\">NASA</a>, the <a href=\"https://www.asc-csa.gc.ca/eng/astronomy/moon-exploration/lunar-gateway.asp\" target=\"_blank\">Canadian Space Agency</a> (CSA), the <a href=\"https://www.esa.int/Science_Exploration/Human_and_Robotic_Exploration/Exploration/Gateway\" target=\"_blank\">European Space Agency</a> (ESA), and the <a href=\"https://global.jaxa.jp/press/2019/03/20190312b.html\" target=\"_blank\">Japan Aerospace Exploration Agency</a> (JAXA), is intended to support operations on the lunar surface while also serving as a staging point for exploration to Mars.\n</p><p>\n<a data-linked-post=\"2650278695\" href=\"https://spectrum.ieee.org/nasas-lunar-space-station-is-a-greatterrible-idea\" target=\"_blank\">Gateway</a> will be significantly smaller than the <a data-linked-post=\"2654777916\" href=\"https://spectrum.ieee.org/naukas-troubled-flight-t\" target=\"_blank\">International Space Station</a> (ISS), initially consisting of just two modules with additional modules to be added over time. The first pieces of the station to reach lunar orbit will be the <a href=\"https://www.nasa.gov/feature/glenn/2021/we-are-fired-up-gateway-propulsion-system-passes-first-test\" target=\"_blank\">Power and Propulsion Element (PPE)</a> attached to the <a href=\"https://news.northropgrumman.com/news/releases/northrop-grumman-finalizes-contract-with-nasa-to-complete-first-crew-module-for-artemis-program\" target=\"_blank\">Habitation and Logistics Outpost (HALO)</a>, <a href=\"https://www.nasa.gov/press-release/nasa-awards-contract-to-launch-initial-elements-for-lunar-outpost/\" target=\"_blank\">scheduled to launch</a> together on a <a href=\"https://www.spacex.com/vehicles/falcon-heavy/\" target=\"_blank\">SpaceX Falcon Heavy</a> rocket in November 2024. The relatively small size of Gateway is possible because the station won’t be crewed most of the time—astronauts may pass through for a few weeks, but the expectation is that Gateway will spend about 11 months out of the year without anyone on board.\n</p><hr/><p>\n\tThis presents some unique challenges for Gateway. On the ISS, astronauts spend a substantial amount of time on station upkeep, but Gateway will have to keep itself functional for extended periods without any direct human assistance.\n</p><p>\n\t“The things that the crew does on the International Space Station will need to be handled by Gateway on its own,” explains \n\t<a href=\"https://www.linkedin.com/in/julia-badger-b690094/\" rel=\"noopener noreferrer\" target=\"_blank\">Julia Badger</a>, Gateway autonomy system manager at NASA’s Johnson Space Center. “There’s also a big difference in the operational paradigm. Right now, ISS has a mission control that’s full time. With Gateway, we’re eventually expecting to have just 8 hours a week of ground operations.” The hundreds of commands that the ISS receives every day to keep it running will still be necessary on Gateway—they’ll just have to come from Gateway itself, rather than from humans back on Earth.\n</p><p class=\"pull-quote\">\n\t“It’s a new way of thinking compared to ISS. If something breaks on Gateway, we either have to be able to live with it for a certain amount of time, or we’ve got to have the ability to remotely or autonomously fix it.” —<em>Julia Badger, NASA JSC</em>\n</p><p>\n\tTo make this happen, NASA is developing a \n\t<a href=\"https://www.nasa.gov/collection-asset/gateway-vehicle-systems-management-demonstration-completed-0\" target=\"_blank\">vehicle system manager</a>, or VSM, that will act like the omnipresent computer system found on virtually every science-fiction starship. The VSM will autonomously manage all of Gateway’s functionality, taking care of any problems that come up, to the extent that they can be managed with clever software and occasional input from a distant human. “It’s a new way of thinking compared to ISS,” explains Badger. “If something breaks on Gateway, we either have to be able to live with it for a certain amount of time, or we’ve got to have the ability to remotely or autonomously fix it.”\n</p><p>\n\tWhile Gateway itself can be thought of as a robot of sorts, there’s a limited amount that can be reasonably and efficiently done through dedicated automated systems, and NASA had to find a compromise between redundancy and both complexity and mass. For example, there was some discussion about whether Gateway’s hatches should open and close on their own, and NASA ultimately decided to leave the hatches manually operated. But that doesn’t necessarily mean that Gateway won’t be able to open its hatches without human assistance; it just means that there will be a need for robotic hands rather than human ones.\n</p><p>\n\t“I hope eventually we have robots up there that can open the hatches,” Badger tells us. She explains that Gateway is being designed with potential intravehicular robots (IVRs) in mind, including things like adding visual markers to important locations, placing convenient charging ports around the station interior, and designing the hatches such that the force required to open them is compatible with the capabilities of robotic limbs. Parts of Gateway’s systems may be modular as well, able to be removed and replaced by robots if necessary. “What we’re trying to do,” Badger says, “is make smart choices about Gateway’s design that don’t add a lot of mass but that will make it easier for a robot to work within the station.”\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A human-sized white humanoid robot with a golden helmet and visor, in front of a task board on the International Space Station\" class=\"rm-shortcode\" data-rm-shortcode-id=\"a1be5f40d0caada309af13e9b48ac6c1\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"4f1df\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-human-sized-white-humanoid-robot-with-a-golden-helmet-and-visor-in-front-of-a-task-board-on-the-international-space-station.jpg?id=29647419&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Robonaut at its test station in front of a manipulation task board on the ISS.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">JSC/NASA</small>\n</p><p>\n\tNASA already has a substantial amount of experience with IVR. \n\t<a href=\"https://spectrum.ieee.org/tag/robonaut-2\" target=\"_blank\">Robonaut 2</a>, a full-size humanoid robot, spent several years on the International Space Station starting in 2011, learning how to perform tasks that would otherwise have to be done by human astronauts. More recently, a trio of cubical, toaster-size, free-flying robots called <a href=\"https://spectrum.ieee.org/tag/Astrobee?topic=robotics\" target=\"_blank\">Astrobees</a> have taken up residence on the ISS, where they’ve been experimenting with autonomous sensing and navigation. A NASA project called <a href=\"https://www.nasa.gov/directorates/spacetech/game_changing_development/projects/ISAAC\" rel=\"noopener noreferrer\" target=\"_blank\">ISAAC</a> (Integrated System for Autonomous and Adaptive Caretaking) is currently exploring how robots like Astrobee could be used for a variety of tasks on Gateway, from monitoring station health to autonomously transferring cargo, although at least in the near term, in Badger’s opinion, “maintenance of Gateway, like using robots that can switch out broken components, is going to be more important than logistics types of tasks.”\n</p><p>\n\tBadger believes that a combination of a generalized mobile manipulator like Robonaut 2 and a free flyer like Astrobee make for a good team, and this combination is currently the general concept for Gateway IVR. This is not to say that the intravehicular robots that end up on Gateway will look like the robots that have been working on the ISS, but they’ll be inspired by them, and will leverage all of the experience that NASA has gained with its robots on ISS so far. It might also be useful to have a limited number of specialized robots, Badger says. “For example, if there was a reason to get behind a rack, you may want a snake-type of robot for that.”\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A casually dressed astronaut holds a toaster-sized cubical robot on the International Space Station\" class=\"rm-shortcode\" data-rm-shortcode-id=\"4a7cf4b8184f22a5f507df9f08013bfd\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"80d9b\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-casually-dressed-astronaut-holds-a-toaster-sized-cubical-robot-on-the-international-space-station.jpg?id=29647421&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">An Astrobee robot (this one is named Bumble) on the ISS.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">JSC/NASA</small>\n</p><p>\n\tWhile NASA is actively preparing for intravehicular robots on Gateway, such robots do not yet exist, and the agency may not be building these robots itself, instead relying on industry partners to deliver designs that meet NASA’s requirements. At launch, and likely for the first several years at least, Gateway will have to take care of itself without internal robotic assistants. However, one of the goals of Gateway is to operate itself completely autonomously for up to three weeks without any contact with Earth at all, mimicking the three-week solar conjunction between Earth and Mars where the sun blocks any communications between the two planets. “I think that we will get IVR on board,” Badger says. “If we really want Gateway to be able to take care of itself for 21 days, IVR is going to be a very important part of that. And having a robot is absolutely something that I think is going to be necessary as we move on to Mars.”\n\t<br/>\n</p><p class=\"pull-quote\">\n\t“Having a robot is absolutely something that I think is going to be necessary as we move on to Mars.” —<em>Julia Badger, NASA JSC</em>\n</p><p>\n\tIntravehicular robots are just half of the robotic team that will be necessary to keep Gateway running autonomously long-term. Space stations rely on complex external infrastructure for power, propulsion, thermal control, and much more. Since 2001, the ISS has been home to Canadarm2, a 17.6-meter robotic arm, which is able to move around the station to grasp and manipulate objects while under human control from either inside the station or from the ground.\n</p><p>\n\tThe Canadian Space Agency, in partnership with space technology company MDA, is developing a new robotic-arm system for Gateway, called \n\t<a href=\"https://www.asc-csa.gc.ca/eng/canadarm3/about.asp\" target=\"_blank\">Canadarm3</a>, scheduled to launch in 2027. Canadarm3 will include an 8.5-meter-long arm for grappling spacecraft and moving large objects, as well as a smaller, more dexterous robotic arm that can be used for delicate tasks. The smaller arm can even repair the larger arm if necessary. But what really sets Canadarm3 apart from its predecessors is how it’s controlled, according to <a href=\"https://www.linkedin.com/in/daniel-rey-214828a2/\" rel=\"noopener noreferrer\" target=\"_blank\">Daniel Rey</a>, Gateway chief engineer and systems manager at CSA. “One of the very novel things about Canadarm3 is its ability to operate autonomously, without any crew required,” Rey says. This capability relies on a new generation of software and hardware that gives the arm a sense of touch as well as the ability to react to its environment without direct human supervision.\n</p><p class=\"pull-quote\">\n\t“With Canadarm3, we realize that if we want to get ready for Mars, more autonomy will be required.” —<em>Daniel Rey, CSA</em>\n</p><p>\n\tEven though Gateway will be a thousand times farther away from Earth than the ISS, Rey explains that the added distance (about 400,000 kilometers) isn’t what really necessitates Canadarm3’s added autonomy. “Surprisingly, the location of Gateway in its orbit around the moon has a time delay to Earth that is not all that different from the time delay in low Earth orbit when you factor in various ground stations that signals have to pass through,” says Rey. “With Canadarm3, we realize that if we want to get ready for Mars, where that will no longer be the case, more autonomy will be required.”\n</p><p>\n\tCanadarm3’s autonomous tasks on Gateway will include external inspection, unloading logistics vehicles, deploying science payloads, and repairing Gateway by swapping damaged components with spares. Rey tells us that there will also be a science logistics airlock, with a moving table that can be used to pass equipment in and out of Gateway. “It’ll be possible to deploy external science, or to bring external systems inside for repair, and for future internal robotic systems to cooperate with Canadarm3. I think that’ll be a really exciting thing to see.”\n</p><p>\n\tEven though it’s going to take a couple of extra years for Gateway’s robotic residents to arrive, the station will be operating mostly autonomously (by necessity) as soon as the Power and Propulsion Element and the Habitation and Logistics Outpost begin their journey to lunar orbit in November o2024. Several science payloads will be along for the ride, including heliophysics and space weather experiments.\n</p><p>\n\tGateway itself, though, is arguably the most important experiment of all. Its autonomous systems, whether embodied in internal and external robots or not, will be undergoing continual testing, and Gateway will need to prove itself before we’re ready to trust its technology to take us into deep space. In addition to being able to operate for 21 days without communications, one of Gateway’s eventual requirements is to be able to function for up to three years without any crew visits. This is the level of autonomy and reliability that we’ll need to be prepared for our exploration of Mars, and beyond.\n</p>",
  "pubDate": "Thu, 07 Apr 2022 18:40:09 +0000",
  "guid": "https://spectrum.ieee.org/lunar-gateway-robots",
  "category": [
    "Space robots",
    "Autonomy",
    "Lunar gateway",
    "Nasa",
    "Robotics"
  ],
  "dc:creator": "Evan Ackerman",
  "media:content": ""
}