{
  "title": "Episode 68: &#8220;Yakety Yak&#8221; by the Coasters",
  "link": "https://500songs.com/podcast/episode-68-yakety-yak-by-the-coasters/",
  "pubDate": "Tue, 04 Feb 2020 17:23:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=524",
  "description": "Episode sixty-eight of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Yakety Yak'\" by The Coasters, and at the group's greatest success and split, and features discussion of racism, plagiarism, STDs and Phil Spector. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/33723164\">on \"Tears on My Pillow\" by Little Anthony and the Imperials</a>.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created Mixcloud streaming playlists with full versions of all the songs in the episode. Because of the limit on the number of songs by one artist, I have posted them as two playlists -- <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-68a-yakety-yak-part-1/\">part one</a>, <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-68a-yakety-yak-part-2/\">part two</a>.\n\nI've used multiple sources to piece together the information here.\n\n<a href=\"https://amzn.to/2SY9jkw\">Hound Dog: The Leiber and Stoller Autobiography</a> by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\n<a href=\"https://amzn.to/2NClIJp\">Yakety Yak, I Fought Back: My Life With the Coasters by Carl and Veta Gardner</a> is a self-published, rather short, autobiography, which gives Gardner's take on the formation of the Coasters.\n\n<a href=\"http://www.angelfire.com/mn/coasters/\">Those Hoodlum Friends</a> is a Coasters fansite, with a very nineties aesthetic (frames! angelfire domain name! Actual information rather than pretty, empty, layouts!)\n\n<a href=\"https://amzn.to/39gyJBF\">The Coasters by Bill Millar</a> is an excellent, long out-of-print, book which provided a lot of useful information.\n\nAnd <a href=\"https://amzn.to/2NbPRAb\">The Definitive Coasters</a> is a double-CD set that has the A- and B-sides of all the group's hits.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWhen we last left the Coasters, they'd just taken on two new singers -- Cornell Gunter and Dub Jones -- to replace Leon Hughes and Bobby Nunn. The classic lineup of the Coasters had finally fallen into place, but it had been a year since they had had a hit -- for most of 1957, their writing and production team, Jerry Leiber and Mike Stoller, had been concentrating on more lucrative work, with Elvis Presley among others.\n\nLeiber and Stoller had a rather unique setup, which very few other people in the business had at that point. They were independent writer/producers -- an unusual state in itself in the 1950s -- but they were effectively under contract to two different labels, whose markets and audiences didn't overlap very much. They were contracted to RCA to work with white pop stars -- not just Elvis, though he was obviously important to them, but people like Perry Como, who were very far from Leiber and Stoller's normal music. That contract with RCA produced a few hits outside Elvis, but didn't end up being comfortable for either party, and ended after a year or so, but it was still remarkable that they would be working as producers for a major label while remaining independent contractors.\n\nAnd at the same time, they were also attached to Atlantic, where they were recording almost exclusively with the black performers that they admired, such as Ruth Brown, LaVern Baker, and the Drifters.\n\nAnd it was, of course, also at Atlantic that they were working with the Coasters, who unlike those other artists were Leiber and Stoller's own personal project, and the one with whom they were most identified, and for whom they were about to write the group's biggest hit:\n\n[Excerpt: The Coasters, \"Yakety Yak\"]\n\nFor the most part, Leiber and Stoller had the classic songwriting split of one lyricist and one composer. Leiber had started out as a songwriter who couldn't play an instrument or write music -- he'd just written lyrics down and remembered the tune in his head -- while Stoller was already an accomplished and sophisticated jazz pianist by the time the two started collaborating. But they wrote together, and so occasionally one would contribute ideas to the other's sphere.\n\nNormally, we don't know exactly how much each contributed to the other's work, because they didn't go into that much detail about how they wrote songs, but in the case of \"Yakety Yak\" we know exactly how the song was written -- everyone who has had a certain amount of success in the music business tends to have a store of anecdotes that they pull out in every interview, and one of Leiber and Stoller's was how they wrote \"Yakety Yak\".\n\nAccording to the anecdote, they were in Leiber's house, in a writing session, and Stoller started playing a piano rhythm, with the idea it might be suitable for the Coasters, while Leiber was in the kitchen. Leiber heard him playing and called out the first line, \"Take out the papers and the trash!\", and Stoller immediately replied \"Or you don't get no spending cash\". They traded off lines and had the song written in about ten minutes.\n\n\"Yakety Yak\" featured a new style for the Coasters' records. Where their earlier singles had usually alternated between a single lead vocalist -- usually Carl Gardner -- on the verses, and the group taking the chorus, with occasional solo lines by the other members, here the lead vocal was taken in unison by the two longest-serving members of the group, Gardner and Billy Guy, with Cornell Gunter harmonising with them. Leiber and Stoller, in their autobiography, actually call it a duet between Gardner and Guy, but I'm pretty sure I hear three voices on the verses, not two, although Gardner's voice is the most prominent.\n\nThen, at the end of each verse, there's the chorus line, where the group sing \"Yakety Yak\", and then Dub Jones takes the single line \"Don't talk back\":\n\n[Excerpt: The Coasters, \"Yakety Yak\"]\n\nThis formula would be one they would come back to again and again -- and there was one more element of the record that became part of the Coasters' formula -- King Curtis' saxophone part:\n\n[Excerpt: The Coasters, \"Yakety Yak\"]\n\nWhile “Yakety Yak” seems in retrospect to be an obvious hit record, it didn't seem so at the time, at least to Jerry Leiber. Mike Stoller was convinced from the start that it would be a massive success, and wanted to put another Leiber and Stoller song on the B-side, so they'd be able to get royalties for both sides when the record became as big as he knew it would. Leiber, though, thought they needed a proven song for the B-side -- something safe for if \"Yakety Yak\" was a flop.\n\nThey went with Leiber's plan, and the B-side was a version of the old song \"Zing! Went the Strings of My Heart\", performed as a duet by Dub Jones and Cornell Gunter:\n\n[Excerpt: The Coasters, \"Zing! Went the Strings of My Heart\"]\n\nLeiber shouldn't have worried -- \"Yakety Yak\" was, of course, a number one hit single. The song was successful enough that it spawned a few answer records, including one by Cornell Gunter's sister Gloria, which Cornell sang backing vocals on:\n\n[Excerpt: Gloria Gunter, \"Move on Out\"]\n\nWith the new lineup of the group in place, they quickly settled into a hit-making machine. Everyone had a role to play. Leiber and Stoller would write the songs and take them into the studio. Stoller would write the parts for the musicians and play the piano, while Leiber supervised in the control room. Cornell Gunter would work out the group's vocal arrangements, Dub Jones would always take his bass solo lines, and either Carl Gardner or Billy Guy would take the lead vocal -- but when they did, they'd be copying, as exactly as they could, a performance they'd been shown by Leiber.\n\nFrom the very start of Leiber and Stoller's career, Leiber had always directed the lead vocalist and told them how to sing his lines -- you may remember from the episode on \"Hound Dog\", one of the very first songs they wrote, that Big Mama Thornton was annoyed at him for telling her how to sing the song. When Leiber and Stoller produced an artist, whether it was Elvis or Ruth Brown or the Coasters or whoever, they would get them to follow Leiber's phrasing as closely as possible.\n\nAnd this brings me to a thing that we need to deal with when talking about the Coasters, and that is the criticism that is often levelled against their records that they perpetuate racist stereotypes. Johnny Otis, in particular, would make this criticism of the group's records, and it's one that must be taken seriously -- though of course Otis had personal issues with Leiber and Stoller, resulting from the credits on \"Hound Dog\". But other people, such as Charlie Gillett, have also raised it.\n\nIt's also a charge that, genuinely, I am not in any position to come to a firm conclusion on. I'm a white man, and so my instincts as to what is and isn't racist are likely to be extremely flawed.\n\nWhat I'd say is this -- the Coasters' performances, and *especially* Dub Jones' vocal parts, are very clearly rooted in particular traditions of African-American comedy, and the way that that form of comedy plays with black culture, and reappropriates stereotypes of black people. If black people were performing, just like this, songs just like this that they had written themselves, there would be no question -- it wouldn't be racist.\n\nEqually, if white people were performing these songs, using the same arrangements, in the same voices, it would undoubtedly be racist -- it would be an Amos and Andy style audio blackface performance, and an absolute travesty.\n\nThe problem comes with the fact that the Coasters were black people, but they were performing songs written for them by two white people -- Jerry Leiber and Mike Stoller -- and that Leiber and Stoller were directing how they should perform those songs. To continue the Amos 'n' Andy analogy, is this like when Amos and Andy transferred from the radio to the TV, and the characters were played by black actors imitating the voices of the white comedians who had created the characters?\n\nI can't answer that. Nor can I say if it makes a difference that Leiber and Stoller were Jewish, and so were only on the borders of whiteness themselves at the time, or that they were deeply involved in black culture themselves -- though that said, they also claimed on several occasions that they weren't writing about black people in particular in any of their songs. Leiber said of \"Riot in Cell Block #9\" \"It was inspired by the Gangbusters radio drama. Those voices just happened to be black. But they could have been white actors on radio, saying, “Pass the dynamite, because the fuse is lit.”\"\n\n[Excerpt: The Robins, “Riot in Cell Block #9”]\n\nThat may be the case as well -- their intent may not have been to write about specifically black experiences at all. And certainly, the Coasters' biggest hits seem to me to be less about black culture, and more about generic teenage concerns. But still, it's very obvious that a large number of people did interpret the Coasters' songs as being about black experiences specifically -- and about a specific type of black experience.\n\nOtis said of Leiber and Stoller, \"They weren't racist in the true sense of the word, but they dwelled entirely on a sort of street society. It's a very fine point -- sure, the artist who performed and created these things, that's where he was. He wasn't a family person going to a gig, he was in the alleys, he was out there in the street trying to make it with his guitar. But while it might be a true reflection of life, it's not invariably a typical reflection of the typical life in the black community\".\n\nThe thing is, as well, a lot of this isn't in the songwriting, but in the performance -- and that performance was clearly directed by Leiber. I think it makes a difference, as well, that the Coasters had two different audiences -- they had an R&B audience, who were mostly older black people, and they had a white teenage audience. Different audiences preferred different songs, and again, there's a difference between black performers singing for a black audience and singing for a white one.\n\nI don't have any easy answers on this one. I don't think that whether something is racist or not is a clear binary, and I'm not the right person to judge whether the Coasters' music crosses any lines. But I thought it was important that I at least mention that there is a debate to be had there, and not just leave the subject alone as being too difficult.\n\nThe song Johnny Otis singled out in the interview was \"Charlie Brown\", which most people refer to as the follow-up to \"Yakety Yak\".\n\nIn fact, after \"Yakety Yak\" came a blues song called \"The Shadow Knows\", based on the radio mystery series that starred Orson Welles. While Leiber and Stoller often talked about the inspiration that radio plays gave them for their songs for the group, that didn't translate to chart success -- several online discographies even fail to mention the existence of \"The Shadow Knows\". It's a more adult record than \"Yakety Yak\", and seems to have been completely ignored by the Coasters' white teenage audience -- and in Leiber and Stoller's autobiography, they skip over it completely, and talk about \"Charlie Brown\" as being immediately after \"Yakety Yak\".\n\n\"Charlie Brown\" took significantly longer to come up with than the ten minutes that \"Yakety Yak\" had taken -- while Stoller came up with some appropriate music almost straight away, it took Leiber weeks of agonising before he hit on the title \"Charlie Brown\", and came up with the basic idea for the lyric -- which, again, Stoller helped with. It's clear, listening to it, that they were trying very deliberately to replicate the sound of \"Yakety Yak\":\n\n[Excerpt: The Coasters, \"Charlie Brown\"]\n\n\"Charlie Brown\" was almost as big a hit as \"Yakety Yak\", reaching number two on the pop charts, so of course they followed it with a third song along the same lines, \"Along Came Jones\". This time, the song was making fun of the plethora of Western TV series:\n\n[Excerpt: The Coasters, \"Along Came Jones\"]\n\nWhile that's a fun record, it “only” reached number nine in the pop charts – still a big success, but nowhere near as big as “Charlie Brown” or “Yakety Yak”. Possibly \"Along Came Jones\" did less well than it otherwise would have because The Olympics had had a recent hit with a similar record, \"Western Movies\":\n\n[Excerpt: The Olympics, \"Western Movies\"]\n\nEither way, the public seemed to tire of the unison-vocals-and-honking-sax formula -- while the next single was meant to be a song called \"I'm a Hog For You Baby\" which was another iteration of the same formula (although with a more bluesy feel, and a distinctly more adult tone to the lyrics) listeners instead picked up on the B-side, which became their biggest hit among black audiences, becoming their fourth and final R&B number one, as well as their last top ten pop hit.\n\nThis one was a song called \"Poison Ivy\", and it's frankly amazing that it was even released, given that it's blatantly about sexually transmitted diseases -- the song is about a woman called \"Poison Ivy\", and it talks about mumps, measles, chicken pox and more, before saying that \"Poison Ivy will make you itch\" and \"you can look but you'd better not touch\". It's hardly subtle:\n\n[Excerpt: The Coasters, \"Poison Ivy\"]\n\nShortly after that, Adolph Jacobs left the group. While he'd always been an official member, it had always seemed somewhat strange that the group had one non-singing instrumental member -- and that that member wasn't even a particularly prominent instrumentalist on the records, with Mike Stoller's piano and King Curtis' saxophone being more important to the sound of the records.\n\n\"Poison Ivy\" would be the group's last top ten hit, and it seemed to signal Leiber and Stoller getting bored with writing songs aimed at an audience of teenagers. From that point on, most of the group's songs would be in the older style that they'd used with the Robins -- songs making social comments, and talking about adult topics.\n\nThe next single, \"What About Us?\", which was a protest song about how rich (and by implication) white people had an easy life while the singers didn't have anything, \"only\" reached number seventeen, and there seems to have been a sort of desperate flailing about to try new styles. They released a single of the old standard \"Besame Mucho\", which extended over two sides -- the second side mostly being a King Curtis saxophone solo. That only went to number seventy.\n\nThen they released the first single written by a member of the group -- \"Wake Me, Shake Me\", which was written by Billy Guy. That was backed by the old folk song \"Stewball\", and didn't do much better, reaching number fifty-one on the charts.\n\nThe song after that was an attempt at yet another style, and that did even worse in the charts, but it's now considered one of the Coasters' great classics. \"Clothes Line (Wrap It Up)\" was a comedy blues song written by a singer called Kent Harris and performed by him under the name Boogaloo and His Solid Crew, and it seems to have been modelled both on the early Robins songs that Leiber and Stoller had written, and on Chuck Berry's \"No Money Down\":\n\n[Excerpt: Boogaloo and His Solid Crew: \"Clothes Line (Wrap it Up)\"]\n\nLeiber and Stoller told various different stories over the years about how the Coasters came to record what they titled \"Shopping For Clothes\", but the one they seem to have settled on was that Billy Guy vaguely remembered hearing the original record, and knew about half the lyrics, and they'd reconstructed the song from what he remembered. They'd been unable to find out who had written it, so had just credited it to \"Elmo Glick\", a pseudonym they sometimes used.\n\nThe new version of the song was reworked significantly, and in particular it became a dialogue, with Billy Guy playing the shopper and Dub Jones playing the sales assistant:\n\n[Excerpt: The Coasters, \"Shopping For Clothes\"]\n\nThe record only reached number eighty-three on the charts, and of course Kent Harris sued and was awarded joint writing credit with Leiber and Stoller. While it didn't chart, it is usually regarded as one of the Coasters' very best records.\n\nIt's also notable for being the first Coasters record to feature a young session musician that Leiber and Stoller were mentoring at the time. Lester Sill, who had been Leiber and Stoller's mentor in their early years, had partnered with them in several business ventures, and was currently the Coasters' manager, phoned them up out of the blue one day, and told them about a kid he knew who'd had a big hit with a song called \"To Know Him Is To Love Him\", which he'd written for his group the Teddy Bears:\n\n[Excerpt: The Teddy Bears, \"To Know Him Is To Love Him\"]\n\nThat record had been released on Trey Records, a new label that Sill had set up with another producer, Lee Hazlewood.\n\nSill said that the kid in question was a huge admirer of Leiber and Stoller, and wanted to learn from them. Would they give him some kind of job with them, so he could be like an apprentice?\n\nSo, as a favour to Sill, and even though they found they disliked the kid once he got to New York, they signed him to a publishing contract, gave him jobs as a session guitarist, and even let him sleep in their office or in Leiber's spare room for a while. We'll be hearing more about how their collaboration with Phil Spector worked out in future episodes.\n\nAround the time that \"Shopping For Clothes\" came out, the group became conscious that their time as a pop chart act with a teenage fanbase was probably close to its end, and they decided to do something that Carl Gardner had wanted to do for a while, and try to transition into the adult white market -- the kind of people who were buying records by Tony Bennett or Andy Williams.\n\nGardner had wanted, from the start, to be a big band singer, and his friend Johnny Otis had always encouraged him to try to sing the material he really loved, rather than the stuff he was doing with the Coasters. So eventually it was agreed that the group would do their first proper album -- something recorded with the intention of being an LP, rather than a collection of singles shoved together.\n\nThis record was to be titled \"One By One\", and would have the group backed by an orchestra, singing old standards. Each song would have a single lead vocalist, with the others relegated to backing vocal parts. Gardner took lead on four songs, and seems to have believed that this would be his big chance to transition into being a solo singer, but it didn't work out like that.\n\nThe album wasn't a particular success, either commercially or critically, but to the extent that anyone noticed it at all, they mostly commented on how good Cornell Gunter sounded. Gunter had always been relegated to backing roles in the group -- he was an excellent singer, and a very strong physical comedian, but his sweeter voice didn't really suit being lead on the material that made the group famous.\n\nGunter had always admired the singer Dinah Washington, and he used to do imitations of her in the group's shows. Getting the chance to take a solo lead on three songs, he shone with his imitation of her style:\n\n[Excerpt: The Coasters, \"Easy Living\"]\n\nFor comparison, this is Washington's version of the same song:\n\n[Excerpt: Dinah Washington, \"Easy Living\"]\n\nDespite the record showing what strong vocalists the group were, it did nothing, and by this time the group's commercial fortunes seemed to be in terminal decline. Looking at their releases around this period, it's noticeable as well that the Coasters stop being produced exclusively by Leiber and Stoller -- several of their recordings are credited instead to Sill and Hazlewood as producers.\n\nThere could be several explanations for this -- it could be that Leiber and Stoller were bored of working with the Coasters, or it could be that they thought that getting in another production team might give the group a boost -- after all, Sill and Hazlewood had recently had a few hits of their own, producing records like \"Rebel Rouser\" by Duane Eddy:\n\n[Excerpt: Duane Eddy, \"Rebel Rouser\"]\n\nBut nothing they produced for the group had any great commercial success either. The group's last top thirty hit was another Leiber and Stoller song -- one that once again shows the more adult turn their writing for the group had taken:\n\n[Excerpt: The Coasters, \"Little Egypt\"]\n\n\"Little Egypt\" was originally the stage name for three different belly-dancers, two of whom performed in Chicago in the mid-1890s and introduced the belly dance to the American public, and another who performed in New York a few years later and was the subject of a scandal when a party she was performing at was raided and it was discovered she planned to perform nude. These dancers had been so notorious that as late as the early 1950s -- nearly sixty years after their careers -- there was a highly fictionalised film supposedly based on the life of one of them.\n\nWhether Leiber and Stoller were inspired by the film, or just by the many exotic dancers who continued using variations of the name, their song about a stripper would be the last time the Coasters would have a significant hit.\n\nShortly after its release, Cornell Gunter decided to leave the group and take up an opportunity to sing in Dinah Washington's backing group. He was replaced by Earl \"Speedo\" Carroll, who had previously sung with a group called the Cadillacs, whose big hit was \"Speedoo\":\n\n[Excerpt: The Cadillacs, \"Speedoo\"]\n\nCarroll, according to Leiber and Stoller, was so concerned about job security that he kept his day job as a school janitor after joining the Coasters.\n\nUnfortunately, Gunter was soon sacked by Dinah Washington, and he decided to form his own group, and to call it the Coasters. A more accurate name might have been the Penguins, since the other three members of his new group had been members of the Penguins previously -- Gunter had come out of the same stew of vocal groups as the Penguins had, and had known them for years.\n\nGunter's group weren't allowed to record as the Coasters, so they made records just under Gunter's own name, or as \"Cornell Gunter and the Cornells\":\n\n[Excerpt: Cornell Gunter, “In a Dream of Love”]\n\nBut while he couldn't make records as the Coasters, his group could tour under that name -- and they were cheaper than the other group. Gunter was friends with Dick Clark, and so Clark started to book Gunter's version of the group, rather than the version that was in the studio.\n\nNot that the group in the studio was exactly the same as the group you'd see live, even if you did go and see the main group. Billy Guy decided he wanted to try a solo career, but unlike Gunter he didn't quit the group. Instead, he had a replacement go out on the road for him, but still sang with them in the studio. None of Guy's solo records did particularly well, and several of them ended up getting reissued under the Coasters name, even though no other Coasters were involved:\n\n[Excerpt: Billy Guy, \"It Doesn't Take Much\"]\n\nThe band membership kept changing, and the hits stopped altogether. Over the next few decades, pretty much everyone who'd been involved with the Coasters started up their own rival version of the group. Carl Gardner apparently retained the legal rights to the name \"the Coasters\", and would sue people using it without his permission, but that didn't stop other members performing under names like \"Cornel Gunter's Coasters\", which isn't precisely the same.\n\nSadly, several people associated with the Coasters ended up dying violently. King Curtis was stabbed to death in the street in 1971, outside his apartment building. Two people were making a drug deal outside his door, and he asked them to move, as he was trying to carry a heavy air-conditioning unit in. They refused, a fight broke out, and he ended up dead, aged only thirty-seven. One of Cornell Gunter's Coasters was murdered by Gunter's manager in 1980, after threatening to expose some of the manager's criminal activities. And finally Gunter himself was shot dead in 1990, and his killer has never been found.\n\nThese days there are three separate Coasters groups touring. \"Cornell Gunter's Coasters\" is a continuation of the group that Gunter led before his death. \"The Coasters\" is managed by Carl Gardner's widow. And Leon Hughes, who is the only surviving original member of the Coasters but was gone by the time of \"Yakety Yak\", tours as \"Leon Hughes and His Coasters\".\n\nThe Coasters are now all gone, other than Hughes, but their records are still remembered. They created a sound that influenced many, many, other groups, but has never been replicated by anyone. They were often dismissed as just a comedy group, but as anyone who has ever tried it knows, making music that is both funny and musically worthwhile is one of the hardest things you can do. And making comedy music that's still enjoyable more than sixty years later? No-one else in rock and roll has ever done that.",
  "itunes:subtitle": "Episode sixty-eight of A History of Rock Music in Five Hundred Songs looks at Yakety Yak by The Coasters, and at the groups greatest success and split, and features discussion of racism, plagiarism, STDs and Phil Spector. Click the full post to read line",
  "itunes:keywords": "Atlantic Records,Cornell Gunter,Dick Clark,Duane Eddy,Johnny Otis,King Curtis,lawsuits,Lee Hazlewood,Leiber and Stoller,Lester Sill,Phil Spector,plagiarism,racism,The Cadillacs,The Coasters,The Penguins",
  "itunes:episodeType": "full",
  "itunes:episode": 68,
  "content:encoded": "Episode sixty-eight of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Yakety Yak'\" by The Coasters, and at the group's greatest success and split, and features discussion of racism, plagiarism, STDs and Phil Spector. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/33723164\">on \"Tears on My Pillow\" by Little Anthony and the Imperials</a>.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created Mixcloud streaming playlists with full versions of all the songs in the episode. Because of the limit on the number of songs by one artist, I have posted them as two playlists -- <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-68a-yakety-yak-part-1/\">part one</a>, <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-68a-yakety-yak-part-2/\">part two</a>.\n\nI've used multiple sources to piece together the information here.\n\n<a href=\"https://amzn.to/2SY9jkw\">Hound Dog: The Leiber and Stoller Autobiography</a> by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\n<a href=\"https://amzn.to/2NClIJp\">Yakety Yak, I Fought Back: My Life With the Coasters by Carl and Veta Gardner</a> is a self-published, rather short, autobiography, which gives Gardner's take on the formation of the Coasters.\n\n<a href=\"http://www.angelfire.com/mn/coasters/\">Those Hoodlum Friends</a> is a Coasters fansite, with a very nineties aesthetic (frames! angelfire domain name! Actual information rather than pretty, empty, layouts!)\n\n<a href=\"https://amzn.to/39gyJBF\">The Coasters by Bill Millar</a> is an excellent, long out-of-print, book which provided a lot of useful information.\n\nAnd <a href=\"https://amzn.to/2NbPRAb\">The Definitive Coasters</a> is a double-CD set that has the A- and B-sides of all the group's hits.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWhen we last left the Coasters, they'd just taken on two new singers -- Cornell Gunter and Dub Jones -- to replace Leon Hughes and Bobby Nunn. The classic lineup of the Coasters had finally fallen into place, but it had been a year since they had had a hit -- for most of 1957, their writing and production team, Jerry Leiber and Mike Stoller, had been concentrating on more lucrative work, with Elvis Presley among others.\n\nLeiber and Stoller had a rather unique setup, which very few other people in the business had at that point. They were independent writer/producers -- an unusual state in itself in the 1950s -- but they were effectively under contract to two different labels, whose markets and audiences didn't overlap very much. They were contracted to RCA to work with white pop stars -- not just Elvis, though he was obviously important to them, but people like Perry Como, who were very far from Leiber and Stoller's normal music. That contract with RCA produced a few hits outside Elvis, but didn't end up being comfortable for either party, and ended after a year or so, but it was still remarkable that they would be working as producers for a major label while remaining independent contractors.\n\nAnd at the same time, they were also attached to Atlantic, where they were recording almost exclusively with the black performers that they admired, such as Ruth Brown, LaVern Baker, and the Drifters.\n\nAnd it was, of course, also at Atlantic that they were working with the Coasters, who unlike those other artists were Leiber and Stoller's own personal project, and the one with whom they were most identified, and for whom they were about to write the group's biggest hit:\n\n[Excerpt: The Coasters, \"Yakety Yak\"]\n\nFor the most part, Leiber and Stoller had the classic songwriting split of one lyricist and one composer. Leiber had started out as a songwriter who couldn't play an instrument or write music -- he'd just written lyrics down and remembered the tune in his head -- while Stoller was already an accomplished and sophisticated jazz pianist by the time the two started collaborating. But they wrote together, and so occasionally one would contribute ideas to the other's sphere.\n\nNormally, we don't know exactly how much each contributed to the other's work, because they didn't go into that much detail about how they wrote songs, but in the case of \"Yakety Yak\" we know exactly how the song was written -- everyone who has had a certain amount of success in the music business tends to have a store of anecdotes that they pull out in every interview, and one of Leiber and Stoller's was how they wrote \"Yakety Yak\".\n\nAccording to the anecdote, they were in Leiber's house, in a writing session, and Stoller started playing a piano rhythm, with the idea it might be suitable for the Coasters, while Leiber was in the kitchen. Leiber heard him playing and called out the first line, \"Take out the papers and the trash!\", and Stoller immediately replied \"Or you don't get no spending cash\". They traded off lines and had the song written in about ten minutes.\n\n\"Yakety Yak\" featured a new style for the Coasters' records. Where their earlier singles had usually alternated between a single lead vocalist -- usually Carl Gardner -- on the verses, and the group taking the chorus, with occasional solo lines by the other members, here the lead vocal was taken in unison by the two longest-serving members of the group, Gardner and Billy Guy, with Cornell Gunter harmonising with them. Leiber and Stoller, in their autobiography, actually call it a duet between Gardner and Guy, but I'm pretty sure I hear three voices on the verses, not two, although Gardner's voice is the most prominent.\n\nThen, at the end of each verse, there's the chorus line, where the group sing \"Yakety Yak\", and then Dub Jones takes the single line \"Don't talk back\":\n\n[Excerpt: The Coasters, \"Yakety Yak\"]\n\nThis formula would be one they would come back to again and again -- and there was one more element of the record that became part of the Coasters' formula -- King Curtis' saxophone part:\n\n[Excerpt: The Coasters, \"Yakety Yak\"]\n\nWhile “Yakety Yak” seems in retrospect to be an obvious hit record, it didn't seem so at the time, at least to Jerry Leiber. Mike Stoller was convinced from the start that it would be a massive success, and wanted to put another Leiber and Stoller song on the B-side, so they'd be able to get royalties for both sides when the record became as big as he knew it would. Leiber, though, thought they needed a proven song for the B-side -- something safe for if \"Yakety Yak\" was a flop.\n\nThey went with Leiber's plan, and the B-side was a version of the old song \"Zing! Went the Strings of My Heart\", performed as a duet by Dub Jones and Cornell Gunter:\n\n[Excerpt: The Coasters, \"Zing! Went the Strings of My Heart\"]\n\nLeiber shouldn't have worried -- \"Yakety Yak\" was, of course, a number one hit single. The song was successful enough that it spawned a few answer records, including one by Cornell Gunter's sister Gloria, which Cornell sang backing vocals on:\n\n[Excerpt: Gloria Gunter, \"Move on Out\"]\n\nWith the new lineup of the group in place, they quickly settled into a hit-making machine. Everyone had a role to play. Leiber and Stoller would write the songs and take them into the studio. Stoller would write the parts for the musicians and play the piano, while Leiber supervised in the control room. Cornell Gunter would work out the group's vocal arrangements, Dub Jones would always take his bass solo lines, and either Carl Gardner or Billy Guy would take the lead vocal -- but when they did, they'd be copying, as exactly as they could, a performance they'd been shown by Leiber.\n\nFrom the very start of Leiber and Stoller's career, Leiber had always directed the lead vocalist and told them how to sing his lines -- you may remember from the episode on \"Hound Dog\", one of the very first songs they wrote, that Big Mama Thornton was annoyed at him for telling her how to sing the song. When Leiber and Stoller produced an artist, whether it was Elvis or Ruth Brown or the Coasters or whoever, they would get them to follow Leiber's phrasing as closely as possible.\n\nAnd this brings me to a thing that we need to deal with when talking about the Coasters, and that is the criticism that is often levelled against their records that they perpetuate racist stereotypes. Johnny Otis, in particular, would make this criticism of the group's records, and it's one that must be taken seriously -- though of course Otis had personal issues with Leiber and Stoller, resulting from the credits on \"Hound Dog\". But other people, such as Charlie Gillett, have also raised it.\n\nIt's also a charge that, genuinely, I am not in any position to come to a firm conclusion on. I'm a white man, and so my instincts as to what is and isn't racist are likely to be extremely flawed.\n\nWhat I'd say is this -- the Coasters' performances, and *especially* Dub Jones' vocal parts, are very clearly rooted in particular traditions of African-American comedy, and the way that that form of comedy plays with black culture, and reappropriates stereotypes of black people. If black people were performing, just like this, songs just like this that they had written themselves, there would be no question -- it wouldn't be racist.\n\nEqually, if white people were performing these songs, using the same arrangements, in the same voices, it would undoubtedly be racist -- it would be an Amos and Andy style audio blackface performance, and an absolute travesty.\n\nThe problem comes with the fact that the Coasters were black people, but they were performing songs written for them by two white people -- Jerry Leiber and Mike Stoller -- and that Leiber and Stoller were directing how they should perform those songs. To continue the Amos 'n' Andy analogy, is this like when Amos and Andy transferred from the radio to the TV, and the characters were played by black actors imitating the voices of the white comedians who had created the characters?\n\nI can't answer that. Nor can I say if it makes a difference that Leiber and Stoller were Jewish, and so were only on the borders of whiteness themselves at the time, or that they were deeply involved in black culture themselves -- though that said, they also claimed on several occasions that they weren't writing about black people in particular in any of their songs. Leiber said of \"Riot in Cell Block #9\" \"It was inspired by the Gangbusters radio drama. Those voices just happened to be black. But they could have been white actors on radio, saying, “Pass the dynamite, because the fuse is lit.”\"\n\n[Excerpt: The Robins, “Riot in Cell Block #9”]\n\nThat may be the case as well -- their intent may not have been to write about specifically black experiences at all. And certainly, the Coasters' biggest hits seem to me to be less about black culture, and more about generic teenage concerns. But still, it's very obvious that a large number of people did interpret the Coasters' songs as being about black experiences specifically -- and about a specific type of black experience.\n\nOtis said of Leiber and Stoller, \"They weren't racist in the true sense of the word, but they dwelled entirely on a sort of street society. It's a very fine point -- sure, the artist who performed and created these things, that's where he was. He wasn't a family person going to a gig, he was in the alleys, he was out there in the street trying to make it with his guitar. But while it might be a true reflection of life, it's not invariably a typical reflection of the typical life in the black community\".\n\nThe thing is, as well, a lot of this isn't in the songwriting, but in the performance -- and that performance was clearly directed by Leiber. I think it makes a difference, as well, that the Coasters had two different audiences -- they had an R&B audience, who were mostly older black people, and they had a white teenage audience. Different audiences preferred different songs, and again, there's a difference between black performers singing for a black audience and singing for a white one.\n\nI don't have any easy answers on this one. I don't think that whether something is racist or not is a clear binary, and I'm not the right person to judge whether the Coasters' music crosses any lines. But I thought it was important that I at least mention that there is a debate to be had there, and not just leave the subject alone as being too difficult.\n\nThe song Johnny Otis singled out in the interview was \"Charlie Brown\", which most people refer to as the follow-up to \"Yakety Yak\".\n\nIn fact, after \"Yakety Yak\" came a blues song called \"The Shadow Knows\", based on the radio mystery series that starred Orson Welles. While Leiber and Stoller often talked about the inspiration that radio plays gave them for their songs for the group, that didn't translate to chart success -- several online discographies even fail to mention the existence of \"The Shadow Knows\". It's a more adult record than \"Yakety Yak\", and seems to have been completely ignored by the Coasters' white teenage audience -- and in Leiber and Stoller's autobiography, they skip over it completely, and talk about \"Charlie Brown\" as being immediately after \"Yakety Yak\".\n\n\"Charlie Brown\" took significantly longer to come up with than the ten minutes that \"Yakety Yak\" had taken -- while Stoller came up with some appropriate music almost straight away, it took Leiber weeks of agonising before he hit on the title \"Charlie Brown\", and came up with the basic idea for the lyric -- which, again, Stoller helped with. It's clear, listening to it, that they were trying very deliberately to replicate the sound of \"Yakety Yak\":\n\n[Excerpt: The Coasters, \"Charlie Brown\"]\n\n\"Charlie Brown\" was almost as big a hit as \"Yakety Yak\", reaching number two on the pop charts, so of course they followed it with a third song along the same lines, \"Along Came Jones\". This time, the song was making fun of the plethora of Western TV series:\n\n[Excerpt: The Coasters, \"Along Came Jones\"]\n\nWhile that's a fun record, it “only” reached number nine in the pop charts – still a big success, but nowhere near as big as “Charlie Brown” or “Yakety Yak”. Possibly \"Along Came Jones\" did less well than it otherwise would have because The Olympics had had a recent hit with a similar record, \"Western Movies\":\n\n[Excerpt: The Olympics, \"Western Movies\"]\n\nEither way, the public seemed to tire of the unison-vocals-and-honking-sax formula -- while the next single was meant to be a song called \"I'm a Hog For You Baby\" which was another iteration of the same formula (although with a more bluesy feel, and a distinctly more adult tone to the lyrics) listeners instead picked up on the B-side, which became their biggest hit among black audiences, becoming their fourth and final R&B number one, as well as their last top ten pop hit.\n\nThis one was a song called \"Poison Ivy\", and it's frankly amazing that it was even released, given that it's blatantly about sexually transmitted diseases -- the song is about a woman called \"Poison Ivy\", and it talks about mumps, measles, chicken pox and more, before saying that \"Poison Ivy will make you itch\" and \"you can look but you'd better not touch\". It's hardly subtle:\n\n[Excerpt: The Coasters, \"Poison Ivy\"]\n\nShortly after that, Adolph Jacobs left the group. While he'd always been an official member, it had always seemed somewhat strange that the group had one non-singing instrumental member -- and that that member wasn't even a particularly prominent instrumentalist on the records, with Mike Stoller's piano and King Curtis' saxophone being more important to the sound of the records.\n\n\"Poison Ivy\" would be the group's last top ten hit, and it seemed to signal Leiber and Stoller getting bored with writing songs aimed at an audience of teenagers. From that point on, most of the group's songs would be in the older style that they'd used with the Robins -- songs making social comments, and talking about adult topics.\n\nThe next single, \"What About Us?\", which was a protest song about how rich (and by implication) white people had an easy life while the singers didn't have anything, \"only\" reached number seventeen, and there seems to have been a sort of desperate flailing about to try new styles. They released a single of the old standard \"Besame Mucho\", which extended over two sides -- the second side mostly being a King Curtis saxophone solo. That only went to number seventy.\n\nThen they released the first single written by a member of the group -- \"Wake Me, Shake Me\", which was written by Billy Guy. That was backed by the old folk song \"Stewball\", and didn't do much better, reaching number fifty-one on the charts.\n\nThe song after that was an attempt at yet another style, and that did even worse in the charts, but it's now considered one of the Coasters' great classics. \"Clothes Line (Wrap It Up)\" was a comedy blues song written by a singer called Kent Harris and performed by him under the name Boogaloo and His Solid Crew, and it seems to have been modelled both on the early Robins songs that Leiber and Stoller had written, and on Chuck Berry's \"No Money Down\":\n\n[Excerpt: Boogaloo and His Solid Crew: \"Clothes Line (Wrap it Up)\"]\n\nLeiber and Stoller told various different stories over the years about how the Coasters came to record what they titled \"Shopping For Clothes\", but the one they seem to have settled on was that Billy Guy vaguely remembered hearing the original record, and knew about half the lyrics, and they'd reconstructed the song from what he remembered. They'd been unable to find out who had written it, so had just credited it to \"Elmo Glick\", a pseudonym they sometimes used.\n\nThe new version of the song was reworked significantly, and in particular it became a dialogue, with Billy Guy playing the shopper and Dub Jones playing the sales assistant:\n\n[Excerpt: The Coasters, \"Shopping For Clothes\"]\n\nThe record only reached number eighty-three on the charts, and of course Kent Harris sued and was awarded joint writing credit with Leiber and Stoller. While it didn't chart, it is usually regarded as one of the Coasters' very best records.\n\nIt's also notable for being the first Coasters record to feature a young session musician that Leiber and Stoller were mentoring at the time. Lester Sill, who had been Leiber and Stoller's mentor in their early years, had partnered with them in several business ventures, and was currently the Coasters' manager, phoned them up out of the blue one day, and told them about a kid he knew who'd had a big hit with a song called \"To Know Him Is To Love Him\", which he'd written for his group the Teddy Bears:\n\n[Excerpt: The Teddy Bears, \"To Know Him Is To Love Him\"]\n\nThat record had been released on Trey Records, a new label that Sill had set up with another producer, Lee Hazlewood.\n\nSill said that the kid in question was a huge admirer of Leiber and Stoller, and wanted to learn from them. Would they give him some kind of job with them, so he could be like an apprentice?\n\nSo, as a favour to Sill, and even though they found they disliked the kid once he got to New York, they signed him to a publishing contract, gave him jobs as a session guitarist, and even let him sleep in their office or in Leiber's spare room for a while. We'll be hearing more about how their collaboration with Phil Spector worked out in future episodes.\n\nAround the time that \"Shopping For Clothes\" came out, the group became conscious that their time as a pop chart act with a teenage fanbase was probably close to its end, and they decided to do something that Carl Gardner had wanted to do for a while, and try to transition into the adult white market -- the kind of people who were buying records by Tony Bennett or Andy Williams.\n\nGardner had wanted, from the start, to be a big band singer, and his friend Johnny Otis had always encouraged him to try to sing the material he really loved, rather than the stuff he was doing with the Coasters. So eventually it was agreed that the group would do their first proper album -- something recorded with the intention of being an LP, rather than a collection of singles shoved together.\n\nThis record was to be titled \"One By One\", and would have the group backed by an orchestra, singing old standards. Each song would have a single lead vocalist, with the others relegated to backing vocal parts. Gardner took lead on four songs, and seems to have believed that this would be his big chance to transition into being a solo singer, but it didn't work out like that.\n\nThe album wasn't a particular success, either commercially or critically, but to the extent that anyone noticed it at all, they mostly commented on how good Cornell Gunter sounded. Gunter had always been relegated to backing roles in the group -- he was an excellent singer, and a very strong physical comedian, but his sweeter voice didn't really suit being lead on the material that made the group famous.\n\nGunter had always admired the singer Dinah Washington, and he used to do imitations of her in the group's shows. Getting the chance to take a solo lead on three songs, he shone with his imitation of her style:\n\n[Excerpt: The Coasters, \"Easy Living\"]\n\nFor comparison, this is Washington's version of the same song:\n\n[Excerpt: Dinah Washington, \"Easy Living\"]\n\nDespite the record showing what strong vocalists the group were, it did nothing, and by this time the group's commercial fortunes seemed to be in terminal decline. Looking at their releases around this period, it's noticeable as well that the Coasters stop being produced exclusively by Leiber and Stoller -- several of their recordings are credited instead to Sill and Hazlewood as producers.\n\nThere could be several explanations for this -- it could be that Leiber and Stoller were bored of working with the Coasters, or it could be that they thought that getting in another production team might give the group a boost -- after all, Sill and Hazlewood had recently had a few hits of their own, producing records like \"Rebel Rouser\" by Duane Eddy:\n\n[Excerpt: Duane Eddy, \"Rebel Rouser\"]\n\nBut nothing they produced for the group had any great commercial success either. The group's last top thirty hit was another Leiber and Stoller song -- one that once again shows the more adult turn their writing for the group had taken:\n\n[Excerpt: The Coasters, \"Little Egypt\"]\n\n\"Little Egypt\" was originally the stage name for three different belly-dancers, two of whom performed in Chicago in the mid-1890s and introduced the belly dance to the American public, and another who performed in New York a few years later and was the subject of a scandal when a party she was performing at was raided and it was discovered she planned to perform nude. These dancers had been so notorious that as late as the early 1950s -- nearly sixty years after their careers -- there was a highly fictionalised film supposedly based on the life of one of them.\n\nWhether Leiber and Stoller were inspired by the film, or just by the many exotic dancers who continued using variations of the name, their song about a stripper would be the last time the Coasters would have a significant hit.\n\nShortly after its release, Cornell Gunter decided to leave the group and take up an opportunity to sing in Dinah Washington's backing group. He was replaced by Earl \"Speedo\" Carroll, who had previously sung with a group called the Cadillacs, whose big hit was \"Speedoo\":\n\n[Excerpt: The Cadillacs, \"Speedoo\"]\n\nCarroll, according to Leiber and Stoller, was so concerned about job security that he kept his day job as a school janitor after joining the Coasters.\n\nUnfortunately, Gunter was soon sacked by Dinah Washington, and he decided to form his own group, and to call it the Coasters. A more accurate name might have been the Penguins, since the other three members of his new group had been members of the Penguins previously -- Gunter had come out of the same stew of vocal groups as the Penguins had, and had known them for years.\n\nGunter's group weren't allowed to record as the Coasters, so they made records just under Gunter's own name, or as \"Cornell Gunter and the Cornells\":\n\n[Excerpt: Cornell Gunter, “In a Dream of Love”]\n\nBut while he couldn't make records as the Coasters, his group could tour under that name -- and they were cheaper than the other group. Gunter was friends with Dick Clark, and so Clark started to book Gunter's version of the group, rather than the version that was in the studio.\n\nNot that the group in the studio was exactly the same as the group you'd see live, even if you did go and see the main group. Billy Guy decided he wanted to try a solo career, but unlike Gunter he didn't quit the group. Instead, he had a replacement go out on the road for him, but still sang with them in the studio. None of Guy's solo records did particularly well, and several of them ended up getting reissued under the Coasters name, even though no other Coasters were involved:\n\n[Excerpt: Billy Guy, \"It Doesn't Take Much\"]\n\nThe band membership kept changing, and the hits stopped altogether. Over the next few decades, pretty much everyone who'd been involved with the Coasters started up their own rival version of the group. Carl Gardner apparently retained the legal rights to the name \"the Coasters\", and would sue people using it without his permission, but that didn't stop other members performing under names like \"Cornel Gunter's Coasters\", which isn't precisely the same.\n\nSadly, several people associated with the Coasters ended up dying violently. King Curtis was stabbed to death in the street in 1971, outside his apartment building. Two people were making a drug deal outside his door, and he asked them to move, as he was trying to carry a heavy air-conditioning unit in. They refused, a fight broke out, and he ended up dead, aged only thirty-seven. One of Cornell Gunter's Coasters was murdered by Gunter's manager in 1980, after threatening to expose some of the manager's criminal activities. And finally Gunter himself was shot dead in 1990, and his killer has never been found.\n\nThese days there are three separate Coasters groups touring. \"Cornell Gunter's Coasters\" is a continuation of the group that Gunter led before his death. \"The Coasters\" is managed by Carl Gardner's widow. And Leon Hughes, who is the only surviving original member of the Coasters but was gone by the time of \"Yakety Yak\", tours as \"Leon Hughes and His Coasters\".\n\nThe Coasters are now all gone, other than Hughes, but their records are still remembered. They created a sound that influenced many, many, other groups, but has never been replicated by anyone. They were often dismissed as just a comedy group, but as anyone who has ever tried it knows, making music that is both funny and musically worthwhile is one of the hardest things you can do. And making comedy music that's still enjoyable more than sixty years later? No-one else in rock and roll has ever done that.",
  "enclosure": "",
  "itunes:summary": "Episode sixty-eight of A History of Rock Music in Five Hundred Songs looks at \"Yakety Yak'\" by The Coasters, and at the group's greatest success and split, and features discussion of racism, plagiarism, STDs and Phil Spector. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Tears on My Pillow\" by Little Anthony and the Imperials.\n\n\n\nResources\n\nAs always, I've created Mixcloud streaming playlists with full versions of all the songs in the episode. Because of the limit on the number of songs by one artist, I have posted them as two playlists -- part one, part two.\n\nI've used multiple sources to piece together the information here.\n\nHound Dog: The Leiber and Stoller Autobiography by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\nYakety Yak, I Fought Back: My Life With the Coasters by Carl and Veta Gardner is a self-published, rather short, autobiography, which gives Gardner's take on the formation of the Coasters.\n\nThose Hoodlum Friends is a Coasters fansite, with a very nineties aesthetic (frames! angelfire domain name! Actual information rather than pretty, empty, layouts!)\n\nThe Coasters by Bill Millar is an excellent, long out-of-print, book which provided a lot of useful information.\n\nAnd The Definitive Coasters is a double-CD set that has the A- and B-sides of all the group's hits.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nWhen we last left the Coasters, they'd just taken on two new singers -- Cornell Gunter and Dub Jones -- to replace Leon Hughes and Bobby Nunn. The classic lineup of the Coasters had finally fallen into place, but it had been a year since they had had a hit -- for most of 1957, their writing and production team, Jerry Leiber and Mike Stoller, had been concentrating on more lucrative work, with Elvis Presley among others.\n\nLeiber and Stoller had a rather unique setup, which very few other people in the business had at that point. They were independent writer/producers -- an unusual state in itself in the 1950s -- but they were effectively under contract to two different labels, whose markets and audiences didn't overlap very much. They were contracted to RCA to work with white pop stars -- not just Elvis, though he was obviously important to them, but people like Perry Como, who were very far from Leiber and Stoller's normal music. That contract with RCA produced a few hits outside Elvis, but didn't end up being comfortable for either party, and ended after a year or so, but it was still remarkable that they would be working as producers for a major label while remaining independent contractors.\n\nAnd at the same time, they were also attached to Atlantic, where they were recording almost exclusively with the black performers that they admired, such as Ruth Brown, LaVern Baker, and the Drifters.\n\nAnd it was, of course, also at Atlantic that they were working with the Coasters, who unlike those other artists were Leiber and Stoller's own personal project, and the one with whom they were most identified, and for whom they were about to write the group's biggest hit:\n\n[Excerpt: The Coasters, \"Yakety Yak\"]\n\nFor the most part, Leiber and Stoller had the classic songwriting split of one lyricist and one composer. Leiber had started out as a songwriter who couldn't play an instrument or write music -- he'd just written lyrics down and remembered the tune in his head -- while Stoller was already an accomplished and sophisticated jazz pianist by the time the two started collaborating. But they wrote together, and so occasionally one would contribute ideas to the other's sphere.\n\nNormally, we don't know exactly how much each contributed to the other's work, because they didn't go into that much detail about how they wrote songs, but in the case of \"Yakety Yak\" we know exactly how",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode sixty-eight of A History of Rock Music in Five Hundred Songs looks at \"Yakety Yak'\" by The Coasters, and at the group's greatest success and split, and features discussion of racism, plagiarism, STDs and Phil Spector. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Tears on My Pillow\" by Little Anthony and the Imperials.\n\n\n\nResources\n\nAs always, I've created Mixcloud streaming playlists with full versions of all the songs in the episode. Because of the limit on the number of songs by one artist, I have posted them as two playlists -- part one, part two.\n\nI've used multiple sources to piece together the information here.\n\nHound Dog: The Leiber and Stoller Autobiography by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\nYakety Yak, I Fought Back: My Life With the Coasters by Carl and Veta Gardner is a self-publis",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}