{
  "title": "US attempt to unleash anarchy in Iran has failed – Tehran",
  "link": "https://www.rt.com/news/566017-iran-destabilization-syria-libya-students/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/566017-iran-destabilization-syria-libya-students/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6366ada585f5403525744a95.jpg\" /> Though the US has tried to destabilize Iran like it did to Libya and Syria, the country is secure, its president claims <br/><a href=\"https://www.rt.com/news/566017-iran-destabilization-syria-libya-students/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>US-backed destabilization campaign didn't succeed, president told students</strong></p>\n            \n                        \n            <p>The US has tried to destabilize Iran like it did to Libya and Syria, by encouraging unrest and riots in the guise of legitimate protests, President Ebrahim Raisi told a group of students on Saturday, adding that the effort had failed and&nbsp;his country was safe.</p>\n<p>Speaking to the participants of elite&nbsp;Path of Progress academic camps, the Iranian president said &ldquo;<em>Americans and our enemies sought to make the country insecure by implementing examples of their work in Libya and Syria, but they achieved nothing except failure.</em>&rdquo;</p>\n<p>He stressed that&nbsp;&ldquo;<em>unrest and attempts to disrupt the country</em>&rdquo; were qualitatively different from &ldquo;<em>protests</em>,&rdquo; Raisi observed that &ldquo;<em>rioters and those who create insecurity must be dealt with decisively</em>.&rdquo;</p>\n<p>Alluding to &ldquo;<em>advancements</em>&rdquo; not widely known even to Iranian elites, the president boasted that the country&rsquo;s best researchers had &ldquo;<em>succeeded in advancing the country in the face of restrictions and sanctions</em>,&rdquo; triggering jealousy on the part of Tehran&rsquo;s adversaries.&nbsp;</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6362c41e85f54005914ce3ec.jpg\" alt=\"FILE PHOTO.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565835-us-not-invincible-iran/\">US is not invincible – Iran</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>On Friday Iranians celebrated the National Day against Global Arrogance, the anniversary of the 1979 takeover of the US Embassy in Tehran, a key event in the revolution that birthed the Islamic Republic. Thousands of Iranians took to the streets in support of their government.</p>\n<p>The US backed militant opposition groups in Libya and Syria in its efforts to impose regime change on those countries, two of the &ldquo;<em>seven countries in five years</em>&rdquo; US General Wesley Clark infamously revealed Washington was seeking to overthrow under the Bush administration.</p>\n<p>While Libya, once boasting the highest standard of living in Africa, quickly descended into failed-state status following the brutal murder of Muammar Gaddafi, Syrian President Bashar Assad has managed to survive &ndash; politically and literally &ndash; with help from Iran and Russia.</p>\n<p>While Iran was also on Clark&rsquo;s regime-change to-do list, the US has largely relied upon funding civil society groups rather than overtly backing terrorists in its efforts to topple the state. Tehran has accused the US and UK of direct involvement in recent riots under the guise of protesting the death of Mahsa Amini, the 22-year-old Kurdish woman who died in police custody after she was detained for wearing her hijab improperly. While the demonstrators claim she was beaten, CCTV footage shows no such assault, and a coroner ruled her death the result of an illness.</p>\n\n            \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/news/565964-biden-free-iran-explained/\">\n            <span>READ MORE: </span>White House explains Biden’s regime change comment\n        </a>\n    </p>\n\n    \n\n<p>After US President Joe Biden declared on Thursday, &ldquo;<em>we&rsquo;re going to free Iran,</em>&rdquo; President Raisi retorded that Iran had been freed 43 years ago.</p>",
  "enclosure": "",
  "pubDate": "Sat, 05 Nov 2022 18:40:46 +0000",
  "dc:creator": "RT"
}