{
  "id": "tag:blogger.com,1999:blog-6755709643044947179.post-3738781921708646978",
  "published": "2022-09-29T10:00:00.002-07:00",
  "updated": "2022-10-12T10:18:01.939-07:00",
  "category": [
    "",
    "",
    ""
  ],
  "title": "Outdooractive boosts user experience on wearable devices with 30% less development time using Compose for Wear OS",
  "content": "<meta content=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg69A15Ez-1D5ph64gLDu4KsFQeah6vv2YxARIYL-aPCTYrUoYYG9G6HDNzrvsKs5liiVTs32ESnkY52uf1bY9VxOH6f9ezb8oOpgOqLA1LYMegZF8nHQToVhhW49FDe7nTWcwMVBduy0udnY2gv9T2ephPgcitea4L8cSh8AU1luYw46D77Ea-gOv1/s1600/Android-OutdooractiveCaseStudy_1024x512%20%281%29.png\" name=\"twitter:image\"></meta>\n<img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg69A15Ez-1D5ph64gLDu4KsFQeah6vv2YxARIYL-aPCTYrUoYYG9G6HDNzrvsKs5liiVTs32ESnkY52uf1bY9VxOH6f9ezb8oOpgOqLA1LYMegZF8nHQToVhhW49FDe7nTWcwMVBduy0udnY2gv9T2ephPgcitea4L8cSh8AU1luYw46D77Ea-gOv1/s1600/Android-OutdooractiveCaseStudy_1024x512%20%281%29.png\" style=\"display: none;\" />\n\n<p><em>Posted by The Android Developers Team</em></p><p>\n\n<a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhP8jx0yIoK9yoTohAPBOoA-U7_vznSmcXyzMAYpdhHXbQh13mi94uVyy0_UhCq1YhdkvojWk1acTvMGnrhfAC7EBdyYDlkPqRgQPyMhfx5p0dG2L3bhnTeTCvma9HaTuyWeCauYB1RZpRzXX13bc1OOsqpPQgHpevQuIGsQbKjMB7CdvuOO8kXLFOt/s1600/Android-OutdooractiveCaseStudy_4209x1253%20%281%29%20%281%29.png\"><img border=\"0\" data-original-height=\"800\" data-original-width=\"1058\" height=\"202\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhP8jx0yIoK9yoTohAPBOoA-U7_vznSmcXyzMAYpdhHXbQh13mi94uVyy0_UhCq1YhdkvojWk1acTvMGnrhfAC7EBdyYDlkPqRgQPyMhfx5p0dG2L3bhnTeTCvma9HaTuyWeCauYB1RZpRzXX13bc1OOsqpPQgHpevQuIGsQbKjMB7CdvuOO8kXLFOt/w682-h202/Android-OutdooractiveCaseStudy_4209x1253%20(1)%20(1).png\" width=\"682\" /></a>\n\n</p><p>\n<a href=\"https://www.outdooractive.com/en/\" target=\"_blank\">Outdooractive</a>, Europe’s largest outdoor platform, provides trail maps and information to a global community of more than <a href=\"https://business.outdooractive.com/\" target=\"_blank\">12 million </a>nature enthusiasts. As a platform focused on helping users plan and navigate their outdoor adventures, Outdooractive has long viewed wearable devices like smart watches as essential to the growth of their app. Users value wearables as navigation tools and activity trackers, so when Google reached out with Android’s new UI toolkit, <a href=\"https://android-developers.googleblog.com/2022/07/compose-for-wear-os-10-stable.html\" target=\"_blank\">Compose for Wear OS</a>, Outdooractive’s developers jumped on the opportunity to improve their app for this growing market.\n</p>\n<p>\nThe application overhaul quickly showed the benefits of Compose for Wear OS. It cut development time by an estimated 30% for Outdooractive’s developers, accelerating their ability to create streamlined user interfaces. “What would have taken us days now takes us hours,” said Liam Hargreaves, the Senior Project Manager of Outdooractive.\n</p>\n<p>\nHaving a modern code base and increasing the development speed helped make the UI code more intuitive for the developers to read and write, allowing for faster prototyping in the design phase and more fluid collaboration. This helped the developers create a more convenient experience for users. \n</p>\n<h3 style=\"text-align: left;\"><strong>Using new tools to create an improved user experience</strong></h3>\n<p>\nOutdooractive’s app strives to deliver accurate information in real time to the users’ wearable devices, including turn-by-turn navigation, trail conditions, and weather updates.\n</p>\n<p>\n“Our app has a relatively complex set of interactions,” said Liam. “Each of these needs to be kept simple, quick, easy to access, and clearly presented — all whilst our customer could be standing on a hillside or in a storm or wearing winter hiking gear and gloves!”\n</p>\n<p>\nNew features in Compose for Wear OS helped the Outdooractive developers create a higher quality app experience for users on the go. The <a href=\"https://developer.android.com/training/wearables/compose/chips\" target=\"_blank\">Chip</a> component significantly improved the process for creating lists and allowed developers to use pre-built design elements, saving the team days of work. <a href=\"https://developer.android.com/jetpack/compose/lists#lazy\" target=\"_blank\">ScalingLazyColumn</a> also optimized the creation of scrolling screens without the need for RecyclerView or ScrollView. \n</p>\n<p>\nThe developers were also excited by how easy it was to use the <a href=\"https://developer.android.com/jetpack/compose/animation\" target=\"_blank\">AnimatedVisibility</a> component because it allowed them to animate functions that they previously didn’t have time for. The team especially appreciated how Compose for Wear OS made it much easier to present different UI states to the user by communicating “loading” or “error” conditions more clearly. \n</p><p><span id=\"docs-internal-guid-f08d0428-7fff-fe61-b05a-83b3c8f2ee38\"></span></p><h3 style=\"text-align: left;\"><blockquote><span style=\"color: #3ddc84; font-weight: normal;\">\"Compose makes the UI code more intuitive to write and read, allowing us to prototype faster in the design phase and also collaborate better on the code.\"</span>&nbsp;</blockquote></h3><div style=\"text-align: left;\"><b><br /></b></div><h3 style=\"text-align: left;\"><b>Experimentation without the overhead</b></h3>\n<p>\nSince implementing Compose for Wear OS, Outdooractive’s users have spent more time on wearable devices doing things they normally would have done on their phones, such as navigating hiking routes — a key UI goal that Compose for Wear OS helped the developers to achieve. \n</p>\n<p>\n“We see wearables as a critical part of our product and market strategy — and the reaction from our users is extremely positive,” Liam said.\n</p>\n<p>\nOutdooractive’s developers used another Wear OS capability called <a href=\"https://developer.android.com/training/wearables/health-services\" target=\"_blank\">Health Services</a> to implement fitness tracking features such as heart rate monitoring into the app by leveraging on-device sensors to offer an experience unique to wearable devices. Health Services on Wear OS automates the configuration of all health- and fitness-related sensors; collects their data; and calculates metrics such as heart rate, distance traveled, and pace, making it easy for developers to implement sophisticated app features while also maximizing battery life. With Health Services and Compose for Wear OS, Outdooractive’s developers plan to further expand the app’s offerings that are made possible by body sensors.\n</p>\n<p>\nOutdooractive’s streamlined process shows just how easy Compose for Wear OS makes application development because it gives developers the flexibility to experiment with different layouts without increasing development overhead.\n</p>\n<p>\nLiam had clear advice for other developers considering using Compose for Wear OS: “Fully embrace it.” \n</p>\n<h3 style=\"text-align: left;\"><strong>Boost your wearable app’s capabilities </strong></h3>\n<p>\n<a href=\"https://developer.android.com/training/wearables/compose\" target=\"_blank\">Jetpack Compose for Wear OS</a> helps build more engaging user experiences for wearable devices.\n</p>\n<p>\nTo get a first look, watch the <a href=\"https://www.youtube.com/watch?v=jpUVamtoKOs\" target=\"_blank\">Wear OS talk</a> from Google I/O or try the <a href=\"https://developer.android.com/codelabs/compose-for-wear-os#0\" target=\"_blank\">Compose for Wear OS codelab</a> to start learning now.\n</p><p></p><p></p>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Android Developers",
    "uri": "http://www.blogger.com/profile/08588467489110681140",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}