{
  "title": "Night of the Living Pandemic Tech Patent Waiver",
  "link": "https://www.aei.org/technology-and-innovation/night-of-the-living-pandemic-tech-patent-waiver/",
  "dc:creator": "Matthew Glavish",
  "pubDate": "Fri, 04 Nov 2022 10:00:00 +0000",
  "category": [
    "Intellectual Property",
    "Technology and Innovation",
    "Biden administration",
    "Coronavirus",
    "developing countries",
    "Innovation",
    "Intellectual property",
    "patents",
    "White House",
    "World Trade Organization"
  ],
  "guid": "https://www.aei.org/?p=1008664698",
  "description": "<p>Despite reaching a consensus on intellectual property rights for COVID-19 vaccines in June 2022, the debate at the World Trade Organization regarding IP rights for COVID-19 diagnostics and treatments won’t be so easily put to rest.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/technology-and-innovation/night-of-the-living-pandemic-tech-patent-waiver/\">Night of the Living Pandemic Tech Patent Waiver</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n",
  "content:encoded": "\n<p>Like a classic Halloween horror movie villain, the debate over intellectual property (IP) protections related to COVID-19 simply refuses to die.</p>\n\n\n\n<p>Just when we thought we’d seen the last of this issue over the summer, the dispute roared back to life last month at another World Trade Organization (WTO) meeting. In June 2022, the WTO at long last reached an agreement on waiving trade-related aspects of intellectual property rights (TRIPS) for COVID-19 vaccines—but not for all COVID-19-related technology.</p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"5076\" height=\"3396\" src=\"https://www.aei.org/wp-content/uploads/2022/11/World-Trade-Organization-Generic-Photo.jpg?x91208\" alt=\"\" class=\"wp-image-1008664699\"/><figcaption>via Reuters</figcaption></figure>\n\n\n\n<p>Recall that India and South Africa <a href=\"https://www.aei.org/technology-and-innovation/covid-19-vaccine-patent-waiver-debate-intensifies-ahead-of-key-wto-meeting/\" target=\"_blank\" rel=\"noreferrer noopener\">petitioned</a> the organization in late 2020 to override patent rights associated with COVID-19 diagnostics, treatments, and vaccines, which at the time had not yet even been administered. While the Trump administration and its European allies initially opposed the request, President Joe Biden’s trade representative <a href=\"https://ustr.gov/about-us/policy-offices/press-office/press-releases/2021/may/statement-ambassador-katherine-tai-covid-19-trips-waiver\" target=\"_blank\" rel=\"noreferrer noopener\">reversed course</a> in May 2021 to great fanfare.</p>\n\n\n\n<p>However, as predicted, by the time the WTO <a href=\"https://www.aei.org/technology-and-innovation/the-covid-19-patent-waiver-compromise-finally-breaks-through-and-nobodys-happy/\" target=\"_blank\" rel=\"noreferrer noopener\">finally acted</a> on the petition in June 2022, the pandemic had ebbed, and billions of vaccine doses had been administered around the world—at extremely low cost to the developing world. According to the <a href=\"https://docs.wto.org/dol2fe/Pages/SS/directdoc.aspx?filename=q:/WT/MIN22/30.pdf&Open=True\" target=\"_blank\" rel=\"noreferrer noopener\">agreement</a>, painstakingly negotiated to achieve consensus among WTO member states:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Notwithstanding the provision of patent rights under its domestic legislation, an eligible Member may limit the rights provided for under Article 28.1 of the TRIPS Agreement . . . by authorizing the use of the subject matter of a patent required for the production and supply of COVID-19 vaccines without the consent of the right holder to the extent necessary to address the COVID-19 pandemic.</p></blockquote>\n\n\n\n<p>The WTO decision, <a href=\"https://www.aei.org/events/where-does-the-debate-over-intellectual-property-protections-for-covid-19-vaccines-stand-one-year-later/\" target=\"_blank\" rel=\"noreferrer noopener\">which</a> <a href=\"https://www.aei.org/technology-and-innovation/the-covid-19-patent-waiver-compromise-finally-breaks-through-and-nobodys-happy/\" target=\"_blank\" rel=\"noreferrer noopener\">displeased</a> waiver advocates and opponents alike, covered only vaccines, not treatments or diagnostics, but vowed to consider the latter issue within six months.</p>\n\n\n\n<p>And sure enough, last month, the WTO revived the discussions, where, according to the <a href=\"https://www.wto.org/english/news_e/news22_e/trip_13oct22_e.htm\" target=\"_blank\" rel=\"noreferrer noopener\">official readout</a>, “members who support an extension of the Decision to cover COVID-19 diagnostics and therapeutics favoured a blanket approach of the extension to therapeutics and diagnostics and stressed that the current COVID-19 IP waiver decision should be adopted ‘as is.’” Those countries “emphasized that the pandemic is far from over and noted that equitable access to therapeutics and diagnostics is critical in helping detect new COVID-19 cases and variants,” noting that “this extension is more urgent than ever, as many least developed countries (LDCs) lack access to life-saving drugs and testing therapeutics.”</p>\n\n\n\n<p>For their part, “a group of developing and developed members expressed their readiness to advance the discussions but insisted on seeing evidence of where and how intellectual property (IP) constitutes a barrier to access to therapeutics and diagnostics before considering an extension,” along the way “reiterat[ing] the need for members to fully make use of all the flexibilities that already exist in the TRIPS Agreement (including compulsory licensing) before requesting new flexibilities.”</p>\n\n\n\n<p>Indeed, the latest request by India, South Africa, and its allies in the WTO caucus realizes a key concern expressed during the original debate—that the initial TRIPS waiver would trigger a further deterioration of IP rights. Once the door was cracked ajar, various public health advocates would ram it open fully. To change metaphors, by acceding to the petition in June 2022, the WTO fanned the flames of anti-IP sentiment, flames that may soon threaten to consume the entire structure of international patent rights.</p>\n\n\n\n<p>“IP has never been a barrier,” says Komal Kalha, the associate director of IP and trade policy at the Geneva-based International Federation of Pharmaceutical Manufacturers & Associations and a <a href=\"https://www.aei.org/events/where-does-the-debate-over-intellectual-property-protections-for-covid-19-vaccines-stand-one-year-later/\" target=\"_blank\" rel=\"noreferrer noopener\">panelist</a> at the AEI forum on this issue in June, <a href=\"https://cen.acs.org/policy/intellectual-property/Debate-over-COVID-19-product/100/i37\" target=\"_blank\" rel=\"noreferrer noopener\">telling</a> <em>Chemical & Engineering News</em>, “You take that away, what you’re doing is you are fracturing a system that delivers in real time but also for the future.”</p>\n\n\n\n<p>This concern seems especially salient in the area of COVID-19 diagnostics and treatments, which can be used in a variety of non-COVID-19 situations. In other words, the patents underlying COVID-19 treatments and diagnostics are the result of substantial research and development investment and underpin commercially valuable products whose use cases include illnesses entirely unrelated to COVID-19. Unlocking IP protection for these innovations would severely dampen incentives for the development of future such breakthroughs.</p>\n\n\n\n<p>In the meantime, the WTO debate will continue, and if the difficulty in reaching a consensus on the original petition is any indication, the diagnostics and treatments issue will take months to resolve. Here’s hoping that this time, it’s put to rest.</p>\n\n\n<div class=\"related-items shortcode \"><p><strong>See also:  </strong><a href=\"https://www.aei.org/technology-and-innovation/where-the-debate-over-intellectual-property-protections-for-covid-19-vaccines-stands-one-year-later-highlights-from-an-expert-panel-discussion/\">Where the Debate over Intellectual Property Protections for COVID-19 Vaccines Stands One Year Later: Highlights from an Expert Panel Discussion</a> | <a href=\"https://www.aei.org/technology-and-innovation/the-covid-19-patent-waiver-compromise-finally-breaks-through-and-nobodys-happy/\">The COVID-19 Patent Waiver Compromise Finally Breaks Through (And Nobody’s Happy)</a> | <a href=\"https://www.aei.org/technology-and-innovation/covid-19-vaccine-patent-waiver-debate-intensifies-ahead-of-key-wto-meeting/\">COVID-19 Vaccine Patent Waiver Debate Intensifies Ahead of Key WTO Meeting</a> | <a href=\"https://www.aei.org/events/where-does-the-debate-over-intellectual-property-protections-for-covid-19-vaccines-stand-one-year-later/\">Where Does the Debate over Intellectual Property Protections for COVID-19 Vaccines Stand One Year Later?</a></p></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/technology-and-innovation/night-of-the-living-pandemic-tech-patent-waiver/\">Night of the Living Pandemic Tech Patent Waiver</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n"
}