{
  "id": "yt:video:VFCaCe-Cnlg",
  "yt:videoId": "VFCaCe-Cnlg",
  "yt:channelId": "UCG_nvdTLdijiAAuPKxtvBjA",
  "title": "Ambulance (2022) — What is Bayhem? | Film Perfection",
  "link": "",
  "author": {
    "name": "Filmento",
    "uri": "https://www.youtube.com/channel/UCG_nvdTLdijiAAuPKxtvBjA"
  },
  "published": "2022-06-21T17:00:11+00:00",
  "updated": "2022-10-30T09:27:08+00:00",
  "media:group": {
    "media:title": "Ambulance (2022) — What is Bayhem? | Film Perfection",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Get a Galaxy Projector 2.0 with 15% off by using code FILMENTO: https://galaxylamps.co/filmento\n\nAmbulance is a new 2022 action movie from Filmento's biggest enemy/friend Michael Bay. A lot of negativity has been said about his Transformers movies here, but Ambulance is a return to form for him as well as a great showcase of his biggest strength: Bayhem. And that's not just explosions -- there is something about Michael Bay that allows him to pack his movies with incredible action if he only cares enough to try. And so today let's dive into what Bayhem means and how to use it in our own action scripts.\n\nSupport:     https://patreon.com/filmento\nFollow:        https://twitter.com/filmento\n\nMusic:\nhttps://www.youtube.com/c/WhiteBatAudio\n\n#ambulance  #michaelbay #filmperfection\n\n\n-\nAmbulance (2022)\nIn this breakneck thriller from director-producer Michael Bay, decorated veteran Will Sharp (Yahya Abdul-Mateen II, The Matrix Resurrections), desperate for money to cover his wife’s medical bills, asks for help from the one person he knows he shouldn’t—his adoptive brother Danny (Jake Gyllenhaal, Zodiac, Spider-Man: Far From Home). A charismatic career criminal, Danny instead offers him a score: the biggest bank heist in Los Angeles history: $32 million. With his wife’s survival on the line, Will can’t say no. But when their getaway goes spectacularly wrong, the desperate brothers hijack an ambulance with a wounded cop clinging to life and ace EMT Cam Thompson (Eiza González, Fast & Furious Presents: Hobbs & Shaw) onboard. In a high-speed pursuit that never stops, Will and Danny ambulance only action ambulance honest trailer everything wrong with ambulance ending best moments michael bay bayhem ambulance full movie online free clip 4k hd ambulance flop ambulance great movie must evade a massive, city-wide law enforcement response, keep their hostages alive, and somehow try not to kill each other, all while executing the most insane escape L.A. has ever seen.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}