{
  "title": "567: 'Philosopher's Stone' Illustrator Thomas Taylor Reveals the Secrets Behind the Cover",
  "link": "https://audioboom.com/posts/8105681",
  "itunes:episode": 567,
  "itunes:title": "'Philosopher's Stone' Illustrator Thomas Taylor Reveals the Secrets Behind the Cover",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3233,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode of MuggleCast, we're joined by a very special guest, Mr. Thomas Taylor, who originally illustrated Harry Potter and the Philosopher's Stone in 1996!  He talks about what it was like to land the job and all that ensued! Join us as we celebrate the 25th anniversary of the book that began a phenomenon!<br>\n<br>\n\n</div>\n<ul>\n<li>Welcome <a href=\"https://www.thomastaylor-author.com/\">Thomas Taylor</a>, illustrator of the very first Harry Potter book in the UK!</li>\n<li>Thomas shares what it was like to get the job at just 23-years-old!</li>\n<li>How did he decide to illustrate the iconic Hogwarts Express scene?</li>\n<li>Did he ever speak with J.K. Rowling?</li>\n<li>What was it like to be one of the first people to ever read Harry Potter?</li>\n<li>Was he ever asked to work on the remainder of the series?</li>\n<li>Who is the mysterious gentleman on the original back cover, and what's in his pocket?</li>\n<li>Did you know there is a connection between Dumbledore and The Hobbit?</li>\n<li>Thomas shares his thoughts on the first Harry Potter movie, his favorite characters and his Hogwarts House!</li>\n<li>What was it like for him to transition from illustrator to author?</li>\n<li>Be sure to check out Taylor's other works, including <a href=\"https://us.eerie-on-sea.com/\">The Legends of</a> <a href=\"https://us.eerie-on-sea.com/\">Eerie-on-Sea</a> and follow him on <a href=\"http://www.twitter.com/thomashtaylor\">Twitter</a> and <a href=\"http://www.instagram.com/thomskagram\">Instagram</a>! </li>\n<li>Quizzitch: Dumbledore’s nose appeared as though it had been broken how many times, according to the first chapter of Philosopher’s Stone?</li>\n<li>This week's episode is brought to you by MeUndies (get 15% off your first order, 25% off your first Membership item, and a 100% satisfaction guarantee at <a href=\"http://www.MeUndies.com/MuggleCast\">MeUndies.com/MuggleCast</a>) and Shudder (stream your first 30 days of Shudder for FREE by going to <a href=\"http://www.shudder.com\">Shudder.com</a> and entering code MuggleCast)!</li>\n<li>Bonus MuggleCast, available later this week: In celebration of Pride Month, we had fun whipping up some gay Harry Potter pick-ups lines (parental advisory warning: these pick-up lines are of an adult nature and not suitable for children). Become a supporter of the show today at <a href=\"http://www.patreon.com/mugglecast\">Patreon.com/MuggleCast</a>!</li>\n</ul>\n",
  "pubDate": "Tue, 21 Jun 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-06-20:/posts/8105681",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}