{
  "title": "TU64: Mindfulness Meditation with Yoga Therapist Kelly Inselmann, Bonus Episode",
  "link": "https://therapistuncensored.com/episodes/tu64-mindfulness-meditation-with-yoga-therapist-kelly-inselman-bonus-episode/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu64-mindfulness-meditation-with-yoga-therapist-kelly-inselman-bonus-episode",
  "pubDate": "Wed, 16 May 2018 13:31:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=6023",
  "description": "Enjoy a straight shot of Kirtan Kriya Meditation from Kundalini Yoga Instructor and Therapist, Kelly Inselmann. Lose your inhibitions, roll up the windows so no one can hear you and go for it. Coolness and calm on the other side.\n\nMindfulness literally soothes our nervous system and teaches us to manage our mental shenanigans. This is a straight up super cool mindfulness meditation exercise called a Kirtan Kriya Meditation. Try it and repeat. And repeat again. It’s vulnerable but seriously, do it with her. It works.\n\nTU 63: Living with Cancer – The Six Principles of Emotional Healing with Guest Kelly Inselmann\n\nTU 52: Using Mindfulness, Movement and Yoga to Manage Arousal, with Guest Kelly Inselmann\n\nTweet\n\n\nOK friends if you have found the bottom of these show notes then you are our people.  Find us on Facebook @austinshrinks and from there, join for free our discussion community.\n\nIf that is not enough, consider purchasing our signature (4 hour!!) course and use \"ourclan\" to get a discount on enrollment.  It&#039;s Not Me It&#039;s My Amygdala Advanced Course Connecting the Science of the Mind to the Amygdala \n\nFinally, we invite you to join our patron Neuronerd community for some occasional bling and behind the scenes stuff, as well as helping to keep us Ad-Free!!!\n\n \n\n\n\n\n\n\n\n\nThanks for stopping by - we really appreciate you and hope this show provides even a tiny inspiration. xo\n\n\nNeed CEU&#039;s??  We&#039;ve got you covered, use OURCLAN for 10% off –\n\n\n\nIt&#039;s Not Me It&#039;s My Amygdala – Advanced Course Connecting the Sciences of the Mind to Everyday Relationships\n\nFOUR hours of quality content and 3 CE&#039;s available to professionals. Since you are this deep into our show notes, then you are indeed one of our peeps and thus invited to be part of our clan  GET 10% off this signature course by using code OURCLAN!  –\nTo get more of this kind of in-depth discussion with quality content and real-world healing – join us on FB where you can find more of your peeps.  Want even more than that?  Join our Neuronerd Patreon community at patreon.com/therapistuncensored for as little as $5 per month.   Join us now.",
  "enclosure": "",
  "itunes:subtitle": "Enjoy a straight shot of Kirtan Kriya Meditation from Kundalini Yoga Instructor and Therapist, Kelly Inselmann. Lose your inhibitions, roll up the windows so no one can hear you and go for it. Coolness and calm on the other side. -",
  "itunes:summary": "Mindfulness literally soothes our nervous system - straight up, super cool meditation.  Try it and repeat.  <br />\nEnjoy a straight shot of Kirtan Kriya Meditation from Kundalini Yoga Instructor and Therapist, Kelly Inselman.  That&apos;s fancy for coolness and calm.  Who doesn&apos;t want that? Dive right in and give yourself the gift of practicing along - we guarantee a more regulated nervous system moment. Money back guarantee. :)",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "18:14"
}