{
  "title": "ZBT #309: Fort Bragg Is H-O-R-N-Y",
  "description": "<p>This Friday episode is just an absolute delight.\n\n-We are presented by Arbor Tech Tools. Check out arbortechtools.com/zero and use promo code \"Zero\" to get 10% off the best wood carving tools around. Start a new hobby, make cool shit, save some money, everyone wins.\n-3chi.com promo code \"Zero\" for 5% off the best Delta 8 THC products\n-FRIDAY 10/23 Rough N Rowdy! BuyRnR.com for some truly entertaining amateur fights.\n\nROUND 1: Get your sunglasses emojis ready because we’re off to a big time horny start to the weekend and it’s all thanks to the official Fort Bragg Twitter who had a very public Fort Boner for a gal on OnlyFans\n\nROUND 2: People dont wanna talk about it but one of the biggest struggles leaving military life is gaining a little weight after organized PT ends. I caught up with one of my former Marines who is brave enough to talk about that struggle. \n\nROUND 3: Remember the soldier who got in trouble for jumping with his goldfish? Well now the Army is looking into a soldier who vibed with cranberry juice and Fleetwood Mac during an airborne jump\n\nROUND 4: If there's anything I know from my former pastor days, it’s that the clergy like to have a little F U N. One Chaplain is gathering around with the troops, putting their pocket books down, and pickin up a few Cosmopolitans at the local macaroni grill. \n\nROUND 5: A woman who once went commando killing Soviets as they tried to capture her village, and then spent years as a warlord fighting the Taliban, has finally turned herself over to them. Hear the story of Afghanistan’s only woman Warlord, Commander Pidgeon!</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/ZeroBlog30\">barstool.link/ZeroBlog30</a></p>",
  "guid": "ddbfbe95-bca7-4389-9426-1fa4cecacffc",
  "pubDate": "Fri, 23 Oct 2020 07:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/zero-blog-thirty",
  "itunes:explicit": "yes",
  "itunes:duration": "00:50:50",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}