{
  "title": "Afterglow Polarization from Off-Axis GRB Jets. (arXiv:2211.01516v1 [astro-ph.HE])",
  "link": "http://arxiv.org/abs/2211.01516",
  "description": "<p>As we further our studies on Gamma-ray bursts (GRBs), both on theoretical\nmodels and observational tools, more and more options begin to open for\nexploration of its physical properties. As transient events primarily dominated\nby synchrotron radiation, it is expected that the synchrotron photons emitted\nby GRBs should present some degree of polarization throughout the evolution of\nthe burst. Whereas observing this polarization can still be challenging due to\nthe constraints on observational tools, especially for short GRBs, it is\nparamount that the groundwork is laid for the day we have abundant data. In\nthis work, we present a polarization model linked with an off-axis spreading\ntop-hat jet synchrotron scenario in a stratified environment with a density\nprofile $n(r)\\propto r^ {-k}$. We present this model's expected temporal\npolarization evolution for a realistic set of afterglow parameters constrained\nwithin the values observed in the GRB literature for four degrees of\nstratification $k=0,1,1.5 {\\rm \\, and\\,} 2$ and two magnetic field\nconfigurations with high extreme anisotropy. We apply this model and predict\npolarization from a set of GRBs exhibiting off-axis afterglow emission. In\nparticular, for GRB 170817A, we use the available polarimetric upper limits to\nrule out the possibility of a extremely anisotropic configuration for the\nmagnetic field.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Pedreira_A/0/1/0/all/0/1\">A. C. Caligula do E. S. Pedreira</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Fraija_N/0/1/0/all/0/1\">N. Fraija</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Galvan_Gamez_A/0/1/0/all/0/1\">A. Galvan-Gamez</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Kamenetskaia_B/0/1/0/all/0/1\">B. Betancourt Kamenetskaia</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Veres_P/0/1/0/all/0/1\">P. Veres</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Dainotti_M/0/1/0/all/0/1\">M. G. Dainotti</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Dichiara_S/0/1/0/all/0/1\">S. Dichiara</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Becerra_R/0/1/0/all/0/1\">R. L. Becerra</a>"
}