{
  "title": "004 Protecting (English)",
  "itunes:title": "004 Protecting (English)",
  "pubDate": "Sun, 10 Jan 2021 19:20:13 +0000",
  "guid": "5a8c45fb-39e9-49bc-9faf-0b1adf642a9e",
  "link": "https://larchitect.libsyn.com/004-protecting",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Hello everyone! My name is Ryan Ortiz, and I would like to welcome you all to our fourth episode of the Bravely Curious Podcast. In this episode we will be immersing ourselves into the importance of protecting and preserving our public and private landscape. But first we must define the differences between Preservation and Protection in the landscape.</span> <em><span style=\"font-weight: 400;\">To preserve</span></em> <span style=\"font-weight: 400;\">is to protect, to keep, to maintain the condition of; while</span> <em><span style=\"font-weight: 400;\">to protect</span></em> <span style=\"font-weight: 400;\">is to keep safe, to defend, to guard; against harmful human activities that have disrupted culture, climate and biodiversity of plant and animals. With that in mind we have separated our discussion into three parts. The first topic will cover indigenous cultures, followed by the second topic on the biodiversity of animals, plants, and the environment. And lastly, the topic of addressing the issues of climate change within the landscape.</span></p>",
  "content:encoded": "<p>Hello everyone! My name is Ryan Ortiz, and I would like to welcome you all to our fourth episode of the Bravely Curious Podcast. In this episode we will be immersing ourselves into the importance of protecting and preserving our public and private landscape. But first we must define the differences between Preservation and Protection in the landscape. <em>To preserve</em> is to protect, to keep, to maintain the condition of; while <em>to protect</em> is to keep safe, to defend, to guard; against harmful human activities that have disrupted culture, climate and biodiversity of plant and animals. With that in mind we have separated our discussion into three parts. The first topic will cover indigenous cultures, followed by the second topic on the biodiversity of animals, plants, and the environment. And lastly, the topic of addressing the issues of climate change within the landscape.</p>",
  "enclosure": "",
  "itunes:duration": "25:48",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "004 Protecting (English)",
  "itunes:season": 2,
  "itunes:episode": 4,
  "itunes:episodeType": "full",
  "itunes:author": "Michael Todoran"
}