{
  "id": "yt:video:Av5bljZ0MQ0",
  "yt:videoId": "Av5bljZ0MQ0",
  "yt:channelId": "UC9_p50tH3WmMslWRWKnM7dQ",
  "title": "Irish-style pot roast",
  "link": "",
  "author": {
    "name": "Adam Ragusea",
    "uri": "https://www.youtube.com/channel/UC9_p50tH3WmMslWRWKnM7dQ"
  },
  "published": "2022-10-13T18:00:09+00:00",
  "updated": "2022-10-15T19:57:41+00:00",
  "media:group": {
    "media:title": "Irish-style pot roast",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Thanks to HelloFresh for sponsoring this video! For 65% off with HelloFresh plus FREE shipping, use code ADAMRAGUSEA65: https://bit.ly/3RO6mRv\n\n***RECIPE, SERVES 4-6***\n\n3lb (1.36kg) mock tenderloin or round roast\n1 22 oz (946mL) carton beef stock\n3-4 shallots\n1 lb (454g) carrots\n1.5 lb (680g) waxy potatoes\na few sticks of celery\none or two bunches of green onions\nstarch\npowdered gelatin (very optional)\ntomato paste\nmustard (any kind that's tart)\nhoney or other sweetener\ngarlic powder\nonion powder\ndried mushroom powder (or a glug of soy sauce, any other source of umami)\ndried herbs\nsalt\npepper\noil\n\nOil the roast and season it heavily with salt and pepper. Brown the outside over moderate heat, taking care to not to let anything burn. Finely chop the shallots, and when the meat is brown, throw them into the pan at let them brown for a few minutes. Stir in a squeeze of tomato paste and let it brown for a minute. Pour in the beef stock and deglaze the pan.\n\nSeason heavily with garlic powder, onion powder, dried mushroom powder, assorted dry herbs and pepper. Reduce the heat to a simmer, cover and let braise until you can feel the meat starting to soften, 2-3 hours.\n\nPrep the vegetables by cutting them into really big pieces. For the green onions, I cut off the white parts and cook them whole — the greens I slice thin and use for garnish at the end. Don't start putting them in until the roast is getting soft and probably only needs another half hour or so. If you want to be able to slice the roast, take it out when it's just barely fork tender. If you want to tear it into chunks,  cook it as soft as you want.\n\nWhen everything is cooked, remove all the solids with a slotted spoon and transfer to a heat-safe platter. Keep this in a warm oven until you're ready to eat.\n\nTo finish the gravy, consider blooming a couple packets of powdered gelatin in some cool water for a few minutes until gelled, then stir that into the gravy. This will enhance the texture, but it's not necessary.\n\nMix a couple spoonfuls of starch with just enough cool water to make a thin paste. Drizzle some of that slowly into the gravy while you stir aggressively, and bring the gravy to a boil. Keep stirring in slurry until the gravy is as thick as you want it. Stir in mustard, honey and additional seasoning to taste.\n\nSlice the roast, cover everything with gravy and garnish with the sliced onion greens.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}