{
  "title": "The Edition: who’s afraid of rising wages?",
  "link": "https://audioboom.com/posts/7943515",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2674,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s episode: is Brexit to blame for the rise in blue-collar wages? With labour shortages driving wages up, many have blamed Britain’s removal from the single market. However, this week in <em>The Spectator</em>, Matthew Lynn argues that shocks and price signals are how the free-market economy reorganises, and that we are experiencing a global trend just like America and Germany. Simon Jenkins, columnist for the <em>Guardian</em>, joins Matthew to discuss. (00:45)<br>\n<br>\nAlso this week: the British Medical Association has dropped its opposition to assisted dying, but is euthanasia really a dignified and painless process? Dr Joel Zivot asks this question in <em>The Spectator</em> magazine, drawing upon his own experience as an expert witness against the use of lethal injection in America. Dr Jacky Davis, radiologist and chair of the Healthcare Professionals for Assisted Dying, disagrees. Davis, who pushed the motion causing the BMA to change its position, calls claims that assisted dying is a painful process 'unscientific shroud-waving', a claim she debates with Dr Zivot this week. (13:43)<br>\n<br>\nAnd finally, Non-Fungible Tokens are selling at extortionate prices online, and are proudly hanging on the virtual walls of many. But can they really be considered art? Jack Rivlin writes about his own experience of purchasing NFTs in this week's <em>Spectator</em>. He is joined by Nima Sagharachi, director of Middle Eastern, Islamic and South Asian Art at Bonhams. (30:20)<br>\n<br>\nHosted by William Moore<br>\n<br>\nProduced by Sam Holmes and Oscar Edmondson</div>\n",
  "pubDate": "Thu, 16 Sep 2021 16:08:00 +0000",
  "guid": "tag:audioboom.com,2021-09-16:/posts/7943515",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}