{
  "id": "yt:video:RFvZ8vsDPdE",
  "yt:videoId": "RFvZ8vsDPdE",
  "yt:channelId": "UCcRV5FPxxWFdS4Fjnk9FQvA",
  "title": "Inaugural lecture of the first postholder of the Armourers & Brasiers’ Chair, Professor Mary Ryan",
  "link": "",
  "author": {
    "name": "Imperial College London",
    "uri": "https://www.youtube.com/channel/UCcRV5FPxxWFdS4Fjnk9FQvA"
  },
  "published": "2022-11-04T11:12:22+00:00",
  "updated": "2022-11-04T13:21:17+00:00",
  "media:group": {
    "media:title": "Inaugural lecture of the first postholder of the Armourers & Brasiers’ Chair, Professor Mary Ryan",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Professor Mary Ryan\n\nMary Ryan is Professor of Materials Science and Nanotechnology, and Vice-Provost (Research and Enterprise). She joined Imperial in 1998 from Brookhaven National Laboratory in the US where she was assistant scientist in the Materials-Environment Interactions Group. She graduated from the University of Manchester with a Joint Honours degree in Mathematics and Physics and was then awarded a PhD in Materials Science carrying out early work with in situ electrochemical STM to study passivation phenomena in binary alloy systems.\n\nMary leads a large interdisciplinary group focused on understanding nanoscale materials, and nanoscale interfaces in and between materials and their environments. She has a particular interest in the development of operando approaches and has pioneered nanoscale methods in synchrotron science.\n\nShe was elected Fellow of the Royal Academy of Engineering in 2015 and is a Fellow IoM3and of the Institute of Corrosion.\n\n \n\nThe Armourers & Brasiers\n\nThe Armourers & Brasiers is one of the 110 Livery Companies in the City of London. Ranked 22, it has existed since 1322 when 26 helm-makers grouped together to control standards in the craft of armour-making. When effective musketry made armour redundant in the 1600’s, its members turned to brass and copper work (hence ‘Brasiers’).\n\nThe Company has a longstanding association with Imperial, having been one of the founders of the City & Guilds of London Institute, one of the three institutions that were merged to form Imperial College in 1907",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}