{
  "title": "Newly Obtained Uvalde 911 Calls Shed More Light on Botched Police Response",
  "link": "https://www.propublica.org/article/uvalde-911-calls-highlight-botched-police-response",
  "pubDate": "Tue, 01 Nov 2022 19:45:00 -0400",
  "guid": "https://www.propublica.org/article/uvalde-911-calls-highlight-botched-police-response",
  "description": "\n                <p class=\"byline\">\n                by <span class=\"name\">Lomi Kriel</span>,  <a href=\"https://www.propublica.org/texas\">ProPublica and The Texas Tribune</a>, and <span class=\"name\">Zach Despart</span>, <span class=\"name\">Alejandro Serrano</span> and <span class=\"name\">Roxanna Asgarian</span>,  <a href=\"https://www.texastribune.org/\">The Texas Tribune</a>                </p>\n                                             \n\n                                                                    \n            \n                <p>ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive <a href=\"https://www.propublica.org/newsletters/the-big-story?source=54G&placement=top-note&region=texas\">our biggest stories</a> as soon as they’re published.</p>\n\n            \n\n                \n\n\n\n                                                                    \n            \n                <p>This article is co-published with The Texas Tribune, a nonprofit, nonpartisan local newsroom that informs and engages with Texans. Sign up for <a href=\"https://www.texastribune.org/newsletters/briefweekly/\">The Brief Weekly</a> to get up to speed on their essential coverage of Texas issues.</p>\n\n            \n\n                \n\n\n\n        \n                        <p>This story contains audio of people calling 911 during a mass shooting incident.</p>\n\n        \n\n    \n      \n  \n\n\n\n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"2.0\">The first two 911 calls came in at 11:29 a.m. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"2.1\">A man had crashed his truck into a ditch by Robb Elementary School in Uvalde, Texas, and he was rushing toward the school with a gun.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.0\">“​​He’s inside the school shooting at the kids!” a third caller yelled at 11:33 a.m.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.0\">The gunman fired more than 100 rounds by the time police dispatchers received another call two minutes later. An adult voice could be heard making “shh” sounds for nearly 44 seconds before the phone abruptly cut out.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.1\">Monica Martinez, a STEM teacher who was hiding in a closet at the school, was among several callers from inside the school who followed.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.0\">“There’s somebody banging at my school,” Martinez said, her voice muffled as she continued speaking. “I’m so scared,” she said at 11:36 a.m.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"10.0\">What happened on May 24 in Uvalde is <a href=\"https://www.texastribune.org/2022/05/27/uvalde-texas-school-shooting-timeline/\">well documented</a>. Hundreds of law enforcement officers from nearly two dozen local, state and federal agencies rushed to the scene. It took more than an hour before they entered the rooms where the gunman was located. They treated the crisis as one of a barricaded suspect who was no longer an active threat. Ultimately, 19 children and two teachers were killed in the worst school shooting in Texas history.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"10.1\">In the ensuing five months, the delayed law enforcement response has spurred state and federal investigations. The school district’s police chief was fired. He has publicly contested his termination, saying he was unfairly blamed. The acting Uvalde police chief has also been suspended and a <a href=\"https://www.texastribune.org/2022/10/21/dps-state-trooper-uvalde-response-fired/\">state trooper fired</a>. The chief of the Texas Rangers, the Department of Public Safety unit that is leading the state investigation, retired abruptly in September, as did his deputy in August. Several state police troopers remain under investigation. Officers facing punishment either could not immediately be reached for comment or declined to respond. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"10.2\">The Texas Tribune and ProPublica have for the first time obtained recordings of more than 20 emergency calls and dozens of hours of conversations between police and dispatchers that lay bare the increasing sense of urgency and desperation conveyed by children and teachers. In chilling, muffled 911 calls, they begged for help from inside the school. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"10.3\">Although the existence of some 911 calls and body camera footage has been reported publicly, the totality of the recordings show the pervasiveness of the miscommunication that unfolded that day. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"10.4\">During some calls, dispatchers and officers warned that class was supposed to be in session in rooms where the gunman had been shooting. On others, law enforcement officers said they were unaware that anyone aside from the gunman was in the classrooms, even as dispatchers received calls from children seeking help.</p>\n        \n    \n                        \n\n\n              <p><a href=\"https://www.propublica.org/newsletters/the-big-story?placement=in-body&source=54G&region=texas\">Never miss the most important reporting from ProPublica’s newsroom. Subscribe to the Big Story newsletter.</a></p>\n\n       \n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"12.0\">Ten-year-old Khloie Torres was one of those children. While state officials previously released a transcript with excerpts from one of Khloie’s phone calls, the news organizations obtained additional recordings of her pleading for help that had not been made public. Khloie survived that day.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"12.1\">In an interview, her father, Ruben Torres Jr., said he is “disgusted” that police did not quickly intervene. The fact that his daughter had to wait so long to get help is “mind-boggling,” Torres said.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"12.2\">“There was no control. That dude had control the entire 77 minutes,” said Torres, a U.S. Marine Corps veteran. “They didn’t have him barricaded. He had the police barricaded outside. It’s plain and simple. The police didn’t go in. That’s your job: to go in.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"12.3\">DPS officials did not respond to questions from ProPublica and the Tribune about the recordings. A spokesperson for the city of Uvalde, the police chief, the Uvalde mayor and the county’s chief executive declined to comment.</p>\n        \n    \n                            \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"14.0\">Communication was a key failure throughout the response. Many officers assumed the school police chief, Pete Arredondo, was in command. He did not have his radios with him, issued few orders and later said he never viewed himself as the officer in charge. County officials said emergency communications were overwhelmed in the rural community, which typically has only two dispatchers answering 911 calls and juggling the transmission of key information to emergency responders.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"14.1\">The emergency radio system has two 911 lines and three emergency channels. Its frequency is designed for the vast, 15,000-square-mile stretch of scrubby desert terrain, rather than for high-density urban areas where equipment must work inside buildings, said Forrest Anderson, the county’s emergency management coordinator who oversaw the radio system’s implementation two decades ago. A legislative committee that later examined the response noted that city police radios worked only intermittently inside the school. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"14.2\">Radio traffic and footage obtained by the news organizations show that some police knew about the 911 calls, but just how many officers remains unclear. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"14.3\">High-stakes emergency responses always have some communications gaps, but skilled incident commanders should be prepared to overcome such challenges, said Bob Harrison, a former California police chief and homeland security researcher at the Rand Corp., a national think tank.</p>\n        \n    \n                            \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.0\">Harrison noted that many of the radios used by Border Patrol agents also did not work during the Uvalde shooting response, but the agency’s SWAT team, which does not typically lead the response in school shootings because it is a federal agency focused on immigration and national security, mobilized to breach the classroom once it arrived and determined no one was in control. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.1\">“If a strong unifying command scene was set up quickly, these discrepancies wouldn’t have been necessarily relevant, and there would have been one voice and one command,” Harrison said of the problems with 911 and radio communication. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.2\">The state legislative committee reached a similar conclusion in its <a href=\"https://house.texas.gov/_media/pdf/committees/reports/87interim/Robb-Elementary-Investigative-Committee-Report.pdf\">July investigative report</a>, which stated that a capable incident commander would have realized that the radios were “mostly ineffective” and that responders needed other means of communication to transmit key details such as calls from victims inside the classrooms. The report highlighted that law enforcement is trained to be “prepared to respond effectively without reliable radio communications” and could employ a series of strategies including using “runners” to deliver messages in person. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.3\">But that day, children and teachers, including Martinez, waited to be rescued. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.4\">In the dark closet of room 116, Martinez stayed on the phone with a dispatcher and tried to practice a key tenet of the school’s active-shooter protocol: Be quiet.</p>\n\nClass Should Be in Session\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.5\">When a new round of gunshots rang out from behind the closed door of the two adjoining classrooms, Uvalde police Sgt. Daniel Coronado sprinted outside, panting heavily as he relayed an urgent message on his radio to city police dispatchers.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.6\">“He’s inside the building,” Coronado said of the shooter at 11:38 a.m. “We have him contained.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.7\">He asked for ballistic shields and requested that someone call DPS.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.8\">Then he repeated: “He’s contained. We’ve got multiple officers inside the building at this time. We believe he’s barricaded in one of the offices. Male subject is still shooting.” </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.9\">Four minutes later, an unidentified male official asked that someone check the classroom of fourth-grade teacher Eva Mireles, a 44-year-old educator and the wife of Ruben Ruiz, a Uvalde Consolidated Independent School District police officer. Mireles was assigned to room 112, one of two adjoining rooms where the shots were coming from.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.10\">“See if the class is in there right now or if they’re somewhere else,” the official said.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"18.0\">Then a Uvalde school district police officer came on the radio with a critical announcement: “The classroom should be in session right now. The class should be in session, Ms. Mireles.”</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.0\">Another officer gasped. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.1\">“That’s going to be Ruben’s girl,” he said, referring to Mireles. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.2\">“Oh no, oh no,” Coronado muttered under his breath. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.3\">The exchange demonstrates some officers knew early on that the gunman was not barricaded alone in the classroom. More indicators, and clear confirmations, would come soon after — yet for much of the response, they would not be heard. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.4\">At 11:48 a.m., Ruiz, who was standing in the hallway outside of the classroom, told officers that his wife had been shot. Ruiz said his wife had called him and said she was “dying.” Mireles later died in an ambulance.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.5\">Officers escorted Ruiz outside, taking away his weapon for his safety, according to interviews officers at the scene later gave to the Texas Rangers. But they did not attempt to enter the classroom. One of the police lieutenants who heard Ruiz’s announcement told investigators that they were waiting for DPS and Border Patrol to arrive “with better equipment like rifle-rated shields.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.6\">By that time, Martinez, the teacher, had been on the phone with 911 for more than 10 minutes. She had told the dispatcher that she could hear people in the hallway. The dispatcher urged her to stay quiet and remain barricaded in the closet. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.7\">“You still there with me?” the dispatcher asked at about 11:47 a.m.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.8\">“I’m still here,” Martinez whispered.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"22.0\">Misinformation spread as Martinez and other 911 callers waited to be rescued. At 11:50 a.m., a Uvalde police dispatcher wrongly reported that the school chief was “in the room with the shooter,” referring to Arredondo by his call sign.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.0\">Seven minutes later, an officer asked if any children were inside with the gunman. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.1\">“No, we don’t know anything about that,” another officer replied on the radio.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.2\">“Everything is closed, like the kids are not in there,” a third responded. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.3\">About a minute later, an officer asked for the shooter’s location.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.4\">“The school chief of police is in there with him,” another officer replied. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.5\">As the back-and-forth continued, law enforcement officers rescued people from other classrooms. At 11:58 a.m., Martinez told the dispatcher that she again heard someone knocking. She said the person had identified themselves as a police officer. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.6\">“Open the door,” the dispatcher said, confirming that the person on the other side was law enforcement. “Stay on the line with me until you make contact with him.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.7\">“I’m coming,” the teacher whispered. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.8\">Her sobs carried through the phone.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.9\">The teacher did not return calls and emails seeking comment.</p>\n\nConfusion Marks Response\n<p data-pp-blocktype=\"copy\" data-pp-id=\"24.10\">Some children in classrooms 111 and 112 with the gunman kept calling 911, seeking help even when they suspected it was not safe to speak. One of the first calls from a trapped student, at 12:03 p.m., was barely audible.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"26.0\">“There’s a school …” a muffled child’s voice reported, breaking up in the recording, “at Robb Elementary.”</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"28.0\">The call lasted a minute and 24 seconds. The child was silent as the dispatcher asked their name and what room they were in. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"28.1\">“Hello, ma’am? Can you hear me?” the dispatcher asked. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"28.2\">Then at 12:10 p.m., Khloie called. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"28.3\">“There is a lot of bodies,” The New York Times <a href=\"https://www.nytimes.com/2022/06/03/us/uvalde-police-response.html?partner=slack&smid=sl-share\">previously reported that she told a dispatcher</a>, adding that her teacher had been shot but was still alive. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"28.4\">Khloie stayed on the phone for more than 17 minutes. While she spoke, another city police dispatcher answered a call from DPS and erroneously reported that the school police chief was inside the classroom with the gunman.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.0\">“I have the school chief of the PD in room 111 or 112 with the active shooter, and they’re still standing by,” she said when the DPS dispatcher asked for an update. “We have multiple agencies on scene. I don’t know if you have anybody else to send out to help out?”</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"31.0\">“We’re sending everybody that we can, um, heading out there, but do you have any injuries, fatals, anything?” the DPS dispatcher responded.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"33.0\">Only one female was shot, and perhaps an officer was injured, the Uvalde dispatcher replied. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"33.1\">A dispatcher’s voice crackled through the Uvalde police and Border Patrol radio traffic, notifying that she had a child on the line.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"35.0\">“The child is advising he is in the room full of victims, full of victims at this moment,” the dispatcher said.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"37.0\">Hallway surveillance video from inside the school at the time shows at least four law enforcement officials, one with a shield, kneeling outside the classroom door with their guns drawn. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"37.1\">It is not clear if the officers heard that message. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"37.2\">At 12:14 p.m., a state trooper’s body camera captured someone saying, “There’s victims in there, dude.” The trooper was standing outside a door to the school, with at least eight officers from different agencies visible from that camera angle. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"37.3\">“We need to get in there,” one responded. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"37.4\">No one did. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"37.5\">Five minutes later, another girl in room 111 called 911. The recording of the call, which lasted a minute and 17 seconds, is mostly inaudible.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"37.6\">In the hallway, Uvalde County Constable Emmanuel Zamora wrongly suggested that the gunman may have already shot himself. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"37.7\">“One shot at the end was self-inflicted, maybe,” Zamora said in the recording, referring to an earlier burst of gunfire. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"37.8\">Zamora did not respond to texts and emails about his comments, which had not been previously reported.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"39.0\">Arredondo, the school chief, can be heard on a state trooper’s body camera at 12:20 p.m. telling another officer: “We have victims in there. I don’t want to have any more. You know what I’m saying?”</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"41.0\">It was the first time he acknowledged to other responders that anyone was wounded inside the two classrooms, according to new footage obtained by the news organizations. The legislative report noted only that he acknowledged “some casualties” 14 minutes later. Arredondo did not return a message seeking comment shared with him by his former attorney.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"41.1\">A minute later, the gunman fired again. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"41.2\">Officers in the hallway flinched, formed a line and started walking down the hall, then suddenly stopped, a state trooper’s body camera footage reveals.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"41.3\">Just after the shots were fired at 12:21 p.m., the school chief began trying to talk to the shooter for the first time, according to communications and records.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"41.4\">“If you can hear me, sir, please put your firearm down, sir,” Arredondo said. “We don’t want anyone else hurt.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"41.5\">Just after 12:30 p.m., three troopers again advanced toward the classrooms before an unidentified person said “no, no, no,” according to body camera footage. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"41.6\">Once again, they stopped.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"41.7\">A DPS trooper who made his way into the hallway around that time asked another officer if there were children in the classroom. The response was, “We don’t know.” </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"41.8\">By then, more than 20 minutes had lapsed since Khloie first begged a dispatcher for help. She ended the initial call when she feared the gunman, who she felt taunted the children, was getting close, her father later recalled. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"41.9\">She called 911 again at 12:36 p.m.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"43.0\">“There’s a school shooting,” Khloie said. “Yes, I’m aware,” the dispatcher responded. “I was talking to you earlier. You’re still there in your room? You’re still in room 112?” “Yeah,” Khloie replied. “OK. You stay on the line with me. Do not disconnect,” the dispatcher said.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"46.0\">“Can you tell the police to come to my room?” Khloie whispered. The dispatcher said: “I’ve already told them to go to the room. We’re trying to get someone to you.”</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"48.0\">About two minutes later, Khloie once more asked for police.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"48.1\">Yet again, a dispatcher tried to reassure her.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"48.2\">“I have someone that is trying to get to you, OK,” she said. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"48.3\">Khloie whispered that she thought she heard the police next door.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"50.0\">“If you hear anyone come in, but they’re not supposed to be there, and they don’t say that they’re police, y’all pretend that you are asleep, OK?” the dispatcher replied.</p>\n        \n    \n                    \n“That Was You?”\n<p data-pp-blocktype=\"copy\" data-pp-id=\"52.0\">As the Border Patrol strike team was almost ready to breach, DPS Capt. Joel Betancourt went on the radio and ordered the agents to wait.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"54.0\">“The team that’s gonna breach needs to stand by,” Betancourt said at 12:50 p.m.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"55.0\">The captain did not respond to requests for comment left for him through DPS.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"57.0\">The team ignored the order and entered the classroom, quickly killing the shooter. The previously silent hallway filled with officers waiting to act. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"57.1\">Someone yelled, “Make a hole!” as police carried out wounded children. Law enforcement officers motioned for those who were not as severely injured to walk out on their own.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"59.0\">“Oh man, I guess there was more kids in that room,” a DPS special agent said, according to his body camera footage. “Yeah, he must have had some hostages,” another law enforcement officer replied.</p>\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"61.0\">As the onsite paramedics focused on the most critically injured, officers began taking other hurt children to the hospital. Khloie was among them. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"61.1\">“I was on the phone with a police officer,” she told the trooper examining her as the screams of other wounded children reverberated in the background.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"61.2\">The officer, whose body camera had earlier picked up a dispatcher describing that call, seemed surprised.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"61.3\">“Oh, that was you?” the trooper asked.</p>\n        \n             \n\n                                    \n        \n                        <p>Uriel J. Garcia of The Texas Tribune contributed reporting.</p>\n\n        \n\n    \n          \n                \n            Correction\n            <p><strong>Nov. 3, 2022:</strong> A previous version of this story included incorrect details of a request to check the classroom of teacher Eva Mireles early in the police response. The request was to check Mireles' room, 112, not the adjoining 111. It was made by an unidentified male official, not a dispatcher. And class was reported to be in session by a school district police officer, not a Uvalde officer. That same officer, not a dispatcher, also wrongly reported over the radio at 11:50 a.m. that the school chief was \"in the room with the shooter.\"</p>\n\n        \n\n                               ",
  "dc:subject": "",
  "dc:date": "2022-11-01T19:45:00-04:00",
  "dc:creator": "by Lomi Kriel,  ProPublica and The Texas Tribune, and Zach Despart, Alejandro Serrano and Roxanna Asgarian,  The Texas Tribune"
}