{
  "title": "Microsoft Patch Tuesday, October 2022 Edition",
  "link": "https://krebsonsecurity.com/2022/10/microsoft-patch-tuesday-october-2022-edition/",
  "comments": "https://krebsonsecurity.com/2022/10/microsoft-patch-tuesday-october-2022-edition/#comments",
  "dc:creator": "BrianKrebs",
  "pubDate": "Tue, 11 Oct 2022 21:06:23 +0000",
  "category": [
    "Latest Warnings",
    "Time to Patch",
    "Caitlin Condon",
    "CVE-2022-37968",
    "CVE-2022-41033",
    "Immersive Labs",
    "Kevin Breen",
    "Microsoft Patch Tuesday October 2022",
    "Rapid7",
    "Satnam Narang",
    "Tenable"
  ],
  "guid": "https://krebsonsecurity.com/?p=61528",
  "description": "Microsoft today released updates to fix at least 85 security holes in its Windows operating systems and related software, including a new zero-day vulnerability in all supported versions of Windows that is being actively exploited. However, noticeably absent from this month's Patch Tuesday are any updates to address a pair of zero-day flaws being exploited this past month in Microsoft Exchange Server.",
  "content:encoded": "<p><strong>Microsoft</strong> today released updates to fix at least 85 security holes in its <strong>Windows</strong> operating systems and related software, including a new zero-day vulnerability in all supported versions of Windows that is being actively exploited. However, noticeably absent from this month&#8217;s Patch Tuesday are any updates to address a pair of zero-day flaws being exploited this past month in <strong>Microsoft Exchange Server</strong>.</p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-52647\" src=\"https://krebsonsecurity.com/wp-content/uploads/2020/08/windowsec.png\" alt=\"\" width=\"750\" height=\"550\" /></p>\n<p>The new zero-day flaw&#8211; <a href=\"https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-41033\" target=\"_blank\" rel=\"noopener\">CVE-2022-41033</a> &#8212; is an &#8220;elevation of privilege&#8221; bug in the Windows COM+ event service, which provides system notifications when users logon or logoff. Microsoft says the flaw is being actively exploited, and that it was reported by an anonymous individual.</p>\n<p>&#8220;Despite its relatively low score in comparison to other vulnerabilities patched today, this one should be at the top of everyone&#8217;s list to quickly patch,&#8221; said <strong>Kevin Breen</strong>, director of cyber threat research at <strong>Immersive Labs</strong>. &#8220;This specific vulnerability is a local privilege escalation, which means that an attacker would already need to have code execution on a host to use this exploit. Privilege escalation vulnerabilities are a common occurrence in almost every security compromise. Attackers will seek to gain SYSTEM or domain-level access in order to disable security tools, grab credentials with tools like Mimkatz and move laterally across the network.</p>\n<p>Indeed, <strong>Satnam Narang</strong>, senior staff research engineer at <strong>Tenable</strong>, notes that almost half of the security flaws Microsoft patched this week are elevation of privilege bugs.<span id=\"more-61528\"></span></p>\n<p>Some privilege escalation bugs can be particularly scary. One example is <a href=\"https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-37968\" target=\"_blank\" rel=\"noopener\">CVE-2022-37968</a>, which affects organizations running <strong>Kubernetes</strong> clusters on <strong>Azure</strong> and earned a CVSS score of 10.0 &#8212; the most severe score possible.</p>\n<p>Microsoft says that to exploit this vulnerability an attacker would need to know the randomly generated DNS endpoint for an Azure Arc-enabled Kubernetes cluster. But that may not be such a tall order, says Breen, who notes that a number of free and commercial DNS discovery services now make it easy to find this information on potential targets.</p>\n<p>Late last month, Microsoft acknowledged that attackers were <a href=\"https://krebsonsecurity.com/2022/09/microsoft-two-new-0-day-flaws-in-exchange-server/\" target=\"_blank\" rel=\"noopener\">exploiting two previously unknown vulnerabilities in Exchange Server</a>. Paired together, the two flaws are known as &#8220;ProxyNotShell&#8221; and they can be chained to allow remote code execution on Exchange Server systems.</p>\n<p>Microsoft said it was expediting work on official patches for the Exchange bugs, and it urged affected customers to enable certain settings to mitigate the threat from the attacks. However, those mitigation steps were soon shown to be ineffective, and Microsoft has been <a href=\"https://msrc-blog.microsoft.com/2022/09/29/customer-guidance-for-reported-zero-day-vulnerabilities-in-microsoft-exchange-server/\" target=\"_blank\" rel=\"noopener\">adjusting them on a daily basis nearly each day since then</a>.</p>\n<p>The lack of Exchange patches leaves a lot of Microsoft customers exposed. Security firm <strong>Rapid7</strong> said that as of early September 2022 the company observed more than 190,000 potentially vulnerable instances of Exchange Server exposed to the Internet.</p>\n<p>&#8220;While Microsoft confirmed the zero-days and issued guidance faster than they have in the past, there are still no patches nearly two weeks out from initial disclosure,&#8221; said <strong>Caitlin Condon</strong>, senior manager of vulnerability research at Rapid7. &#8220;Despite high hopes that today&#8217;s Patch Tuesday release would contain fixes for the vulnerabilities, Exchange Server is conspicuously missing from the initial list of October 2022 security updates. Microsoft’s recommended rule for blocking known attack patterns has been bypassed multiple times, emphasizing the necessity of a true fix.&#8221;</p>\n<p>Adobe also released <a href=\"https://helpx.adobe.com/security.html\" target=\"_blank\" rel=\"noopener\">security updates to fix 29 vulnerabilities</a> across a variety of products, including <strong>Acrobat</strong> and <strong>Reader</strong>, <strong>ColdFusion</strong>, <strong>Commerce</strong> and <strong>Magento</strong>. Adobe said it is not aware of active attacks against any of these flaws.</p>\n<p>For a closer look at the patches released by Microsoft today and indexed by severity and other metrics, check out the <a href=\"https://isc.sans.edu/forums/diary/October%202022%20Microsoft%20Patch%20Tuesday/29138/\" target=\"_blank\" rel=\"noopener\">always-useful Patch Tuesday roundup</a> from the <strong>SANS Internet Storm Center</strong>. And it’s not a bad idea to hold off updating for a few days until Microsoft works out any kinks in the updates: <a href=\"https://www.askwoody.com/\" target=\"_blank\" rel=\"noopener\">AskWoody.com</a> usually has the lowdown on any patches that may be causing problems for Windows users.</p>\n<p>As always, please consider backing up your system or at least your important documents and data before applying system updates. And if you run into any problems with these updates, please drop a note about it here in the comments.</p>\n",
  "wfw:commentRss": "https://krebsonsecurity.com/2022/10/microsoft-patch-tuesday-october-2022-edition/feed/",
  "slash:comments": 13
}