{
  "title": "South Korea scrambles fighter jets",
  "link": "https://www.rt.com/news/565981-south-korea-scramble-jets/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565981-south-korea-scramble-jets/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6365f09585f5403525744a53.jpg\" /> South Korea said it scrambled dozens of fighter jets after spotting around 180 military flights by Pyongyang <br/><a href=\"https://www.rt.com/news/565981-south-korea-scramble-jets/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Seoul’s armed forces said nearly 200 North Korean military flights were detected on Friday</strong></p>\n            \n                        \n            <p>South Korea scrambled dozens of fighter jets after&nbsp;identifying a significant number of North Korean warplanes on radar, the country&rsquo;s military has reported. The incident occurred during air exercises by Seoul and Washington, which have prompted several shows of force by Pyongyang in recent days.&nbsp;</p>\n<p><strong></strong>The South Korean military&rsquo;s Joint Chiefs of Staff (JCS) <a href=\"https://en.yna.co.kr/view/AEN20221104009400325\" target=\"_blank\" rel=\"noopener noreferrer\">said</a> 80 jets were mobilized on Friday in response to more than 180 North Korean military flights, noting that Pyongyang&rsquo;s planes did not come close to the inter-Korean border.</p>\n<p>The JCS added that US-made F-35As were among the South Korean jets scrambled, and that the military was in a <em>&ldquo;full response posture.&rdquo;</em></p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63654ce685f54026b81a4d08.jpg\" alt=\"Kim Jong-un inspects a missile test at an undisclosed location in North Korea, sometime between September 25 and October 9, 2022\" />\n            <figcaption><a href=\"https://www.rt.com/news/565965-north-korea-end-regime/\">Pentagon predicts what could end Kim’s rule in North Korea</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>While Seoul offered few details about the North Korean flights, officials said the planes remained north of the Military Demarcation Line which separates the two Koreas.&nbsp;</p>\n<p><strong></strong>The South scrambled jets last month in a similar response after 10 North Korean planes were seen on radar, though the incident also ended without further escalation.</p>\n<p>Tensions have soared on the Korean Peninsula in recent months, with the North carrying out a record number of weapons tests this year &ndash; including an intercontinental ballistic missile (ICBM) launched into the sea earlier this week. Seoul, meanwhile, has carried out several rounds of live-fire military drills with the United States, including the ongoing &lsquo;Vigilant Storm&rsquo; exercise, the largest air drill ever held between the two allies.</p>\n<p>Pyongyang has repeatedly condemned the exercises as preparations for an attack, while Washington and the South say the DPRK has engaged in dangerous <em>&ldquo;provocations&rdquo;</em> with its retaliatory <a href=\"https://www.rt.com/news/565810-north-korea-more-missiles/\" target=\"_blank\" rel=\"noopener noreferrer\">missile and artillery demonstrations</a>.</p>\n\n            \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/news/565929-security-council-korea-icbm/\">\n            <span>READ MORE: </span>US calls Security Council meeting after ICBM launch\n        </a>\n    </p>\n\n    \n",
  "enclosure": "",
  "pubDate": "Sat, 05 Nov 2022 05:13:35 +0000",
  "dc:creator": "RT"
}