{
  "title": "512: The Highs and Lows of the Battle of Hogwarts",
  "link": "https://audioboom.com/posts/7857776",
  "itunes:episode": 512,
  "itunes:title": "The Highs and Lows of the Battle of Hogwarts",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4005,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Take note! The new-ish <a href=\"https://www.harrypotterdatabase.com/blog/2021/3/30/harry-potter-and-the-goblet-of-fire-deleted-and-unreleased-scenes\">Harry Potter Database</a> is keeping track of deleted and never-seen scenes from the movies, with stills and even script excerpts! Including the alternate ending from <em>Goblet of Fire</em> that we mentioned last week.</li>\n<li>It's the anniversary of the Battle of Hogwarts! The hosts honor the occasion by looking at what the movie left out from the book.</li>\n<li>How do the hosts feel about the Harry/Voldemort face-off, now that they've reread it?</li>\n<li>What role would Andrew, Laura, Micah, and Eric taken in defending the school?</li>\n<li>Would any particular moment during the Battle of Hogwarts have caused us to retreat or rethink our strategy?</li>\n<li>What is the one thing that we'd change after all these years about what happened during the Battle of Hogwarts in the book? Listeners weigh in with the top things they would change as well.</li>\n<li>Which character who died would Andrew, Eric, Laura and Micah save, and who would we kill in their place?</li>\n<li>We eulogize those who lost their lives on this fateful day in the book series.</li>\n<li>Quizzitch: What is the final sentence in <em>Deathly Hallows</em> prior to the epilogue?Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week’s episode is sponsored by MeUndies, makers of the most comfortable underwear (get 15% off your first order at <a href=\"http://MeUndies.com/mugglecast\">MeUndies.com/mugglecast</a>) and HelloFresh (Get 12 free meals plus free shipping, at <a href=\"http://HelloFresh.com/12muggle\">HelloFresh.com/12muggle</a>, and using code 12muggle)</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like access to our recording studio, Bonus MuggleCast, a personalized thank you video from one of the hosts and more!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 04 May 2021 11:00:00 +0000",
  "guid": "tag:audioboom.com,2021-05-03:/posts/7857776",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}