{
  "title": "Special Episode: Untangling Global Spikes in Commodity Prices",
  "description": "<p>We look at how soaring energy prices in Spain, gas prices in the U.S. and aluminum prices globally could all be linked to coal mines in China.</p><p><br></p><p>----- Transcript -----</p><p><strong>Andrew Sheets </strong>Welcome to Thoughts on the Market, I'm Andrew Sheets, chief cross asset strategist for Morgan Stanley.</p><p><br></p><p><strong>Martijn Rats </strong>And I'm Martijn Rats, Morgan Stanley's global oil strategist and head of the European energy team.</p><p><br></p><p><strong>Andrew Sheets </strong>And on this special episode, we'll be talking about how soaring energy prices in Spain, gas prices in the U.S. and aluminum prices globally could all be linked to coal mines in China. It's Friday, September 17th, at 3 p.m. in London.</p><p><br></p><p><strong>Andrew Sheets</strong> So, Martin, there's a pretty striking story going on globally in commodities that's been hitting close to home here in Europe. I think a good place to start is just to run through how much prices for things like coal, natural gas and aluminum have been rising this year.</p><p><br></p><p><strong>Martijn Rats </strong>Thanks, Andrew. The price rally in many of these commodities has been rather extraordinary. The global consumption of coal peaked in 2013. So eight years ago. And yet we're now looking at thermal coal prices that are close to all time highs. At the start of the year, the price of thermal coal in the seaborne market was in the order of $80/ton. Now we're looking at $180/ton. With that also, the price of aluminum has risen very strongly. At the start of the year, we were around about $2000/ton. At the moment we're knocking on nearly $3000/ton. The price of natural gas both in the seaborne market traded as LNG as liquefied natural gas, but also in Europe, delivered through pipelines at several trading hubs where gas is trading. In Europe, we've seen extraordinary rallies. Typical prices have gone from in the order of&nbsp;$6-7 per MMBTU to $22, $23, $24 per MMBTU. And with that, then also electricity prices have increased very sharply. In Germany, in France, Spain, the U.K., electricity prices have broadly tripled from about sort of 50 euros a megawatt hour to about 150 euros per megawatt hour.</p><p><br></p><p><strong>Andrew Sheets </strong>So one of the reasons I was so keen to talk to you today is that this is a really interesting and interlinked story. What's going on?</p><p><br></p><p><strong>Martijn Rats </strong>I think there is a common set of factors between all of these rallies. In China, electricity demand is up, coming out of covid and also because of hot weather. Normally, China produces its majority of its electricity from coal and from hydropower, i.e. dams and rivers. But because of underinvestment and because of drought, both of these source of electricity production have really struggled this year. That meant that China had to curtail aluminum production, which is particularly electricity intensive to make. China is a big producer of aluminum globally, so that made the global aluminum price spike. At the same time, it meant that China had to look for coal in the seaborne market and also for natural gas, which is another fuel you can use for electricity production. That tightens the global market for coal and for natural gas. And then those prices spiked, particularly in Europe, because normally natural gas that is shipped around the world in LNG tankers, a lot of that ends in Europe. But this year, a far lower share of it ended in Europe. That meant that our inventories of natural gas didn't really build over the summer. We're now going into the winter with unusually low levels of natural gas inventories. Natural gas prices in Europe then spiked. And because that sets the price for electricity, then electricity prices also spiked. It's a global story that is very interconnected across regions and across commodities.</p><p><br></p><p><strong>Andrew Sheets </strong>So, Martin, I know this is hard to comment on, but how do you think this resolves itself? And what do you think are the key factors to watch here going forward as we think about these interconnected commodity markets?</p><p><br></p><p><strong>Martijn Rats </strong>Well, I think these rallies and particularly the sharpened sort of nature of them have really driven home three things. First of all, how interconnected the commodity markets really are. You can get, you know, drought in China and electricity prices go up in Spain. It really is that interconnected. I think the second thing that these rallies drive home is how difficult this is to forecast. As in, even three months ago, six months ago, most market participants would not have expected that in particular, commodities would have rallied so much. As we go into the energy transition, we really should use less coal. And therefore, coal markets were by and large expected to be very well supplied. Natural gas has been quite abundant, really on a global basis ever since the emergence of U.S. shale about a decade ago. And that market, too, was widely expected to remain abundant. So to see these types of price rallies really drives home how difficult it is to forecast these rallies. And frankly, for that reason, we should be open minded about, you know, these deeply held consensual views about how all of this is going to play out. The third thing I think that is worth stressing is that these rallies also show how little margin of safety there is in the broader energy system, and particularly as we do go into the energy transition with seemingly little margin of safety, that creates room for instabilities and spikes in the future as well.</p><p><br></p><p><strong>Andrew Sheets </strong>And, Martin, by the energy transition, we're talking here about this idea that we're really going to be moving away from coal based production, fossil fuels, not just because they're worse for the environment, but they're increasingly less economic relative to many of these renewable technologies that are now out there.</p><p><br></p><p><strong>Martijn Rats </strong>Yeah, that is exactly right. You know, to address climate change and to decarbonize, we need to move to more sustainable low carbon sources of energy. But what is currently going on is that this prospect is leading those that typically invest in the traditional fossil fuels to lower their investment levels already well in advance, whilst actually our consumption patterns are changing quite slowly. So there's a real question whether the prospect of the energy transition is impacting the supply side of energy before it impacts really the demand side of energy. And that's that could then be the source of those price squeezes and instabilities that I just mentioned.</p><p><br></p><p><strong>Andrew Sheets </strong>So, Martin, meanwhile, U.S. gasoline prices have moved up to some of their highest levels since 2014. Is this related to this story and the other commodities or is something else going on here now?</p><p><br></p><p><strong>Martijn Rats </strong>So far, oil is not quite wrapped up in this story quite as much. Oil still has its own standalone dynamic, more or less. And the reason for that is that have loose connections to each other. But oil is truly global. So the United States has reduced its dependance on imported oil very, very significantly over the years, but still, the American oil market is connected to the global oil market. And in the global oil market, we see recovery in demand. The oil market is simply tight and that is driving U.S. gasoline prices. So the dynamic there is different. But where these stories could converge is in terms of the impact of little investment in the future, because clearly part of the story that I just told about natural gas and coal has an element to it of low investment levels that are now showing their consequences and partly responsible for creating these squeezes. In the oil market, we are also now going through a number of years already with low investment levels. Now, there's still some slack in the system, but what is now happening to coal and natural gas could well happen to oil markets in two, three, four years from now when OPEC's spare capacity has been depleted and demand has recovered. So in that sense, U.S. gasoline prices are a different story, but they could become the same story in a few years from now.</p><p><br></p><p><strong>Martijn Rats </strong>So now, Andrew, I look at it from an energy and commodity perspective, but you take a very much a macro view. What do you make of all of this?</p><p><br></p><p><strong>Andrew Sheets </strong>So I think the irony here is, is that both investors or general people who want to reduce carbon based emissions and the energy companies would both prefer higher energy prices, albeit for maybe different reasons. But higher prices are one mechanism to reduce the amount of consumption of these various fossil fuels and commodities. So there is a free market element here. As these prices go up, people will use less electricity, they will use less natural gas, they will try to they will drive less. And that can have some positive environmental impacts. It can also have some negative economic impacts, as if that if that leads to less activity. If that transition has to happen a lot faster or maybe more uncomfortably than expected. I think the second thing is we do have to be on the lookout for this impact on corporate margins. When it comes to commodities and when it comes to the things you were just discussing, if you produce these things, it can be really good. And if you consume them, it can be really challenging. If prices are going up 50-100%, I don't think many people's budgets or earnings numbers account for that type of fluctuation. So, you know, this is something we're going to be watching very closely as we go into third quarter earnings and fourth quarter earnings. And also, I think investors need to be on the lookout for companies that potentially get squeezed if they are not able to pass on price increases onto the next part of the supply chain, onto their customers. And finally, I think this is a really good reminder that there's, I think, a temptation in markets often to really want to think that politics is this great explainer of everything. And I think this is a good reminder of the limitations of that. I mean, I think if you had told an investor at the start of 2020 that you would have Democratic control of the White House, the House of Representatives, the Senate, and then coal prices would go on and more than double. People would have thought that you were crazy. People would have thought that you didn't know what you were talking about. And yet that's happened. And it's happened because there's a drought in China and there's a lack of coal production for many other unrelated reasons. So I think this is just a good example that any time I think we look at markets with upcoming elections, yes, those can matter and they can matter a lot. But often other factors can also come into play. And we need to be mindful and I think kind of humble to that dynamic.</p><p><br></p><p><strong>Andrew Sheets </strong>Martijn, thanks for taking the time to talk.</p><p><br></p><p><strong>Martijn Rats </strong>Great speaking with you, Andrew,</p><p><br></p><p><strong>Andrew Sheets </strong>And thanks for listening. If you enjoy Thoughts on the Market, please leave us a review on Apple Podcasts and share the podcast with a friend or colleague today.</p>",
  "itunes:title": "Special Episode: Untangling Global Spikes in Commodity Prices",
  "itunes:episodeType": "full",
  "itunes:episode": 452,
  "itunes:summary": "We look at how soaring energy prices in Spain, gas prices in the U.S. and aluminum prices globally could all be linked to coal mines in China.",
  "content:encoded": "<p>We look at how soaring energy prices in Spain, gas prices in the U.S. and aluminum prices globally could all be linked to coal mines in China.</p><p><br></p><p>----- Transcript -----</p><p><strong>Andrew Sheets </strong>Welcome to Thoughts on the Market, I'm Andrew Sheets, chief cross asset strategist for Morgan Stanley.</p><p><br></p><p><strong>Martijn Rats </strong>And I'm Martijn Rats, Morgan Stanley's global oil strategist and head of the European energy team.</p><p><br></p><p><strong>Andrew Sheets </strong>And on this special episode, we'll be talking about how soaring energy prices in Spain, gas prices in the U.S. and aluminum prices globally could all be linked to coal mines in China. It's Friday, September 17th, at 3 p.m. in London.</p><p><br></p><p><strong>Andrew Sheets</strong> So, Martin, there's a pretty striking story going on globally in commodities that's been hitting close to home here in Europe. I think a good place to start is just to run through how much prices for things like coal, natural gas and aluminum have been rising this year.</p><p><br></p><p><strong>Martijn Rats </strong>Thanks, Andrew. The price rally in many of these commodities has been rather extraordinary. The global consumption of coal peaked in 2013. So eight years ago. And yet we're now looking at thermal coal prices that are close to all time highs. At the start of the year, the price of thermal coal in the seaborne market was in the order of $80/ton. Now we're looking at $180/ton. With that also, the price of aluminum has risen very strongly. At the start of the year, we were around about $2000/ton. At the moment we're knocking on nearly $3000/ton. The price of natural gas both in the seaborne market traded as LNG as liquefied natural gas, but also in Europe, delivered through pipelines at several trading hubs where gas is trading. In Europe, we've seen extraordinary rallies. Typical prices have gone from in the order of&nbsp;$6-7 per MMBTU to $22, $23, $24 per MMBTU. And with that, then also electricity prices have increased very sharply. In Germany, in France, Spain, the U.K., electricity prices have broadly tripled from about sort of 50 euros a megawatt hour to about 150 euros per megawatt hour.</p><p><br></p><p><strong>Andrew Sheets </strong>So one of the reasons I was so keen to talk to you today is that this is a really interesting and interlinked story. What's going on?</p><p><br></p><p><strong>Martijn Rats </strong>I think there is a common set of factors between all of these rallies. In China, electricity demand is up, coming out of covid and also because of hot weather. Normally, China produces its majority of its electricity from coal and from hydropower, i.e. dams and rivers. But because of underinvestment and because of drought, both of these source of electricity production have really struggled this year. That meant that China had to curtail aluminum production, which is particularly electricity intensive to make. China is a big producer of aluminum globally, so that made the global aluminum price spike. At the same time, it meant that China had to look for coal in the seaborne market and also for natural gas, which is another fuel you can use for electricity production. That tightens the global market for coal and for natural gas. And then those prices spiked, particularly in Europe, because normally natural gas that is shipped around the world in LNG tankers, a lot of that ends in Europe. But this year, a far lower share of it ended in Europe. That meant that our inventories of natural gas didn't really build over the summer. We're now going into the winter with unusually low levels of natural gas inventories. Natural gas prices in Europe then spiked. And because that sets the price for electricity, then electricity prices also spiked. It's a global story that is very interconnected across regions and across commodities.</p><p><br></p><p><strong>Andrew Sheets </strong>So, Martin, I know this is hard to comment on, but how do you think this resolves itself? And what do you think are the key factors to watch here going forward as we think about these interconnected commodity markets?</p><p><br></p><p><strong>Martijn Rats </strong>Well, I think these rallies and particularly the sharpened sort of nature of them have really driven home three things. First of all, how interconnected the commodity markets really are. You can get, you know, drought in China and electricity prices go up in Spain. It really is that interconnected. I think the second thing that these rallies drive home is how difficult this is to forecast. As in, even three months ago, six months ago, most market participants would not have expected that in particular, commodities would have rallied so much. As we go into the energy transition, we really should use less coal. And therefore, coal markets were by and large expected to be very well supplied. Natural gas has been quite abundant, really on a global basis ever since the emergence of U.S. shale about a decade ago. And that market, too, was widely expected to remain abundant. So to see these types of price rallies really drives home how difficult it is to forecast these rallies. And frankly, for that reason, we should be open minded about, you know, these deeply held consensual views about how all of this is going to play out. The third thing I think that is worth stressing is that these rallies also show how little margin of safety there is in the broader energy system, and particularly as we do go into the energy transition with seemingly little margin of safety, that creates room for instabilities and spikes in the future as well.</p><p><br></p><p><strong>Andrew Sheets </strong>And, Martin, by the energy transition, we're talking here about this idea that we're really going to be moving away from coal based production, fossil fuels, not just because they're worse for the environment, but they're increasingly less economic relative to many of these renewable technologies that are now out there.</p><p><br></p><p><strong>Martijn Rats </strong>Yeah, that is exactly right. You know, to address climate change and to decarbonize, we need to move to more sustainable low carbon sources of energy. But what is currently going on is that this prospect is leading those that typically invest in the traditional fossil fuels to lower their investment levels already well in advance, whilst actually our consumption patterns are changing quite slowly. So there's a real question whether the prospect of the energy transition is impacting the supply side of energy before it impacts really the demand side of energy. And that's that could then be the source of those price squeezes and instabilities that I just mentioned.</p><p><br></p><p><strong>Andrew Sheets </strong>So, Martin, meanwhile, U.S. gasoline prices have moved up to some of their highest levels since 2014. Is this related to this story and the other commodities or is something else going on here now?</p><p><br></p><p><strong>Martijn Rats </strong>So far, oil is not quite wrapped up in this story quite as much. Oil still has its own standalone dynamic, more or less. And the reason for that is that have loose connections to each other. But oil is truly global. So the United States has reduced its dependance on imported oil very, very significantly over the years, but still, the American oil market is connected to the global oil market. And in the global oil market, we see recovery in demand. The oil market is simply tight and that is driving U.S. gasoline prices. So the dynamic there is different. But where these stories could converge is in terms of the impact of little investment in the future, because clearly part of the story that I just told about natural gas and coal has an element to it of low investment levels that are now showing their consequences and partly responsible for creating these squeezes. In the oil market, we are also now going through a number of years already with low investment levels. Now, there's still some slack in the system, but what is now happening to coal and natural gas could well happen to oil markets in two, three, four years from now when OPEC's spare capacity has been depleted and demand has recovered. So in that sense, U.S. gasoline prices are a different story, but they could become the same story in a few years from now.</p><p><br></p><p><strong>Martijn Rats </strong>So now, Andrew, I look at it from an energy and commodity perspective, but you take a very much a macro view. What do you make of all of this?</p><p><br></p><p><strong>Andrew Sheets </strong>So I think the irony here is, is that both investors or general people who want to reduce carbon based emissions and the energy companies would both prefer higher energy prices, albeit for maybe different reasons. But higher prices are one mechanism to reduce the amount of consumption of these various fossil fuels and commodities. So there is a free market element here. As these prices go up, people will use less electricity, they will use less natural gas, they will try to they will drive less. And that can have some positive environmental impacts. It can also have some negative economic impacts, as if that if that leads to less activity. If that transition has to happen a lot faster or maybe more uncomfortably than expected. I think the second thing is we do have to be on the lookout for this impact on corporate margins. When it comes to commodities and when it comes to the things you were just discussing, if you produce these things, it can be really good. And if you consume them, it can be really challenging. If prices are going up 50-100%, I don't think many people's budgets or earnings numbers account for that type of fluctuation. So, you know, this is something we're going to be watching very closely as we go into third quarter earnings and fourth quarter earnings. And also, I think investors need to be on the lookout for companies that potentially get squeezed if they are not able to pass on price increases onto the next part of the supply chain, onto their customers. And finally, I think this is a really good reminder that there's, I think, a temptation in markets often to really want to think that politics is this great explainer of everything. And I think this is a good reminder of the limitations of that. I mean, I think if you had told an investor at the start of 2020 that you would have Democratic control of the White House, the House of Representatives, the Senate, and then coal prices would go on and more than double. People would have thought that you were crazy. People would have thought that you didn't know what you were talking about. And yet that's happened. And it's happened because there's a drought in China and there's a lack of coal production for many other unrelated reasons. So I think this is just a good example that any time I think we look at markets with upcoming elections, yes, those can matter and they can matter a lot. But often other factors can also come into play. And we need to be mindful and I think kind of humble to that dynamic.</p><p><br></p><p><strong>Andrew Sheets </strong>Martijn, thanks for taking the time to talk.</p><p><br></p><p><strong>Martijn Rats </strong>Great speaking with you, Andrew,</p><p><br></p><p><strong>Andrew Sheets </strong>And thanks for listening. If you enjoy Thoughts on the Market, please leave us a review on Apple Podcasts and share the podcast with a friend or colleague today.</p>",
  "guid": "gid://art19-episode-locator/V0/1gHw-iLTzHJ_VrjMxTEufHx-X-6KsumOA2Mc5wDMs1Q",
  "pubDate": "Fri, 17 Sep 2021 23:12:22 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:duration": "00:10:01",
  "enclosure": ""
}