{
  "id": "https://bibleinoneyear.org/en/youth/69",
  "title": "Day 69: Crucified",
  "description": "Psalm 31:21–24, Leviticus 22:31–33, Mark 15:1–2,20,25–26,31–32. In the Greek translation of the Old Testament, the Septuagint, this sacred name (YHWH) is translated *Kyrios* (Lord)  It really is quite extraordinary, therefore, that the New Testament writers (who were Jewish monotheists) made this fundamental Christian affirmation that ‘*Jesus is Lord’* (*Kyrios*) (Romans 10:9; 2 Corinthians 4:5; Acts 2:36) and that *our Lord* has been *crucified for us*",
  "pubDate": "Wed, 10 Mar 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/69/?ignore",
  "itunes:duration": "13:03",
  "guid": "enyouth10032021-69",
  "length": 783.93,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 69: Crucified",
  "itunes:subtitle": "Psalm 31:21–24, Leviticus 22:31–33, Mark 15:1–2,20,25–26,31–32. In the Greek translation of the Old Testament, the Septuagint, this sacred name (YHWH) is translated *Kyrios* (Lord)  It really is quite extraordinary, therefore, that the New Testament writers (who were Jewish monotheists) made this fundamental Christian affirmation that ‘*Jesus is Lord’* (*Kyrios*) (Romans 10:9; 2 Corinthians 4:5; Acts 2:36) and that *our Lord* has been *crucified for us*",
  "itunes:summary": "In the days of slavery in the United States, southern slaves were living under brutal conditions. They composed some deeply moving songs with haunting melodies, rich with emotion. These ‘spirituals’ were songs of hope and anticipation. They were the soul-cry of the slave longing for freedom.\nThey embraced Jesus as their Saviour and Lord and, in the midst of almost unbearable suffering, they experienced his grace, peace and hope for the future. From this relationship they were able to sing:\nWere you there when they crucified my Lord?\nIn the New Testament passage for today, we see the background to the extraordinary claim of the New Testament that the one ‘they crucified’ is in fact my Lord. God is described in the Old Testament as ‘The Lord’.\nThe original Hebrew word for ‘Lord’ (YHWH) had no vowels and was not vocalised. It was considered too sacred to pronounce. For that reason, when vowels were added to the original Hebrew texts they weren’t added to ‘the name’ (YHWH). There has been much debate in modern times as to what vowels should be used – it used to be thought it should be ‘Jehovah’, but most scholars now think ‘Yahweh’ is more accurate.\nIn the Greek translation of the Old Testament, the Septuagint, this sacred name (YHWH) is translated Kyrios (Lord). It really is quite extraordinary, therefore, that the New Testament writers (who were Jewish monotheists) made this fundamental Christian affirmation that ‘Jesus is Lord’ (Kyrios) (Romans 10:9; 2 Corinthians 4:5; Acts 2:36) and that our Lord has been crucified for us.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 69
}