{
  "title": "The Edition: America abandoned this fight before the Afghans did",
  "link": "https://audioboom.com/posts/7926937",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2316,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week’s podcast:</div>\n<div>\n<br>\nIn the latest issue of <em>The Spectator</em>, we cover the Afghanistan issue extensively, looking at everything from why the West was doomed from the start, to how events in Afghanistan have transformed central Asian politics. On the podcast, journalist Paul Wood and our own deputy editor Freddy Gray, both of whom feature in this week’s issue, join Lara to talk Biden, Boris and the new 'progressive' Taliban. (00:37)</div>\n<div><br>\n</div>\n<div>\n<em>'This is not your father's Taliban'</em> - Paul Wood</div>\n<div>\n<br>\nNext up, thousands of women whose menstrual cycles have been affected by the Covid vaccine have now come forward to make their symptoms known, including our  host Lara Prendergast, who writes about her experience in this week's <em>Spectator</em>. We continue that conversation with Jessica Braun, who was the host of the <em>Periodical</em> podcast and Dr Joe Mountfield from the Royal College of Obstetricians and Gynaecologists. (12:12)</div>\n<div><br>\n</div>\n<div>\n<em>‘I don't think your piece is anti-vaxx, I don't think you're anti-vaxx, I think expressing some concerns and airing what's happened to you is absolutely legitimate and valid’</em> - Dr Jo Mountfield</div>\n<div>\n<br>\nAnd finally, while many during the pandemic have fled London for greener pastures, our own Martin Vander Weyer has moved back to the city after more than 30 years of Yorkshire living. He writes about his new Covent Garden lifestyle in this week’s issue, and He joins us on the Edition along with William Moore, who has done the opposite, having left London with his young family to become a country gent. (25:39)</div>\n<div>\n<br>\n<em>'With the upmost respect, I think you're mad!' </em>- William Moore </div>\n<div>\n<br>\nPresented by Lara Prendergast</div>\n<div>\n<br>\nProduced by Sam Holmes</div>\n",
  "pubDate": "Thu, 19 Aug 2021 16:05:00 +0000",
  "guid": "tag:audioboom.com,2021-08-19:/posts/7926937",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}