{
  "title": "Episode 90: &#8220;Runaway&#8221; by Del Shannon",
  "link": "https://500songs.com/podcast/episode-90-runaway-by-del-shannon/",
  "pubDate": "Sat, 18 Jul 2020 15:34:33 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-90-runaway-by-del-shannon/",
  "description": "Episode ninety of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Runaway\" by Del Shannon, and at the early use of synthesised sound in rock music. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/39455335\">on \"Blue Moon\" by the Marcels.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>A note</strong>\n\nAlmost every version of “Runaway” currently available is in stereo, and the stereo version of the song has a slightly different vocal take to the original mono version. Unfortunately, there appear to be multiple “original mono versions” too. To check that what I'm using here, a mono track available as a bonus on a reissue of the album <em>Runaway With Del Shannon,</em> is actually the hit single version, I downloaded two vinyl rips of the single and one vinyl rip of a mono hits compilation from the sixties that had been uploaded to YouTube. Unfortunately no two copies of the song I could find online would play in synch – they all appear to be mastered at slightly different speeds, possibly due to the varispeeding I talk about in the episode. I've gone with the version I did because it's a clean-sounding mono version, but it may not be exactly what people heard in 1961.\n\n<strong>Resources</strong>\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode. This one is in two parts because of the number of songs by Del Shannon in the mix. <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-90a-runaway/\">Part one</a>, <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-90b-runaway-part-2/\">part two</a>.\n\nOnly one biography of Del Shannon has ever been written, and that's out of print and (to judge from the Amazon reviews) not very well written, so I've relied again on other sources. Those include the liner notes to <a href=\"https://amzn.to/2ZF9bfc\">this CD</a>, a good selection of Shannon's work (with the proviso that \"Runaway\" is in stereo -- see above; the articles on Shannon and Max Crook on <a href=\"http://tims.blackcat.nl/\">This Is My Story,</a> <a href=\"http://delshannon.com/\">the official Del Shannon website</a>,  and<a href=\"http://web.archive.org/web/20060506222625/http://go.zibycom.com/members/002222119/Site4/maxcrook.html\"> the Internet Archive's cached copy of Max Crook's old website</a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday's episode is an odd one to write, as just as I put the finishing touches to the script I discovered that Max Crook, the keyboard player at the centre of this story, died less than two weeks ago. The news wasn't widely reported, and I only discovered this by double-checking a detail and discovering an obituary of him. Crook was one of the great early pioneers of electronic music, and a massive talent, and he's a big part of the story I'm telling today, so before we go into the story proper I just wanted to take a moment to acknowledge his passing, and to regret that it hasn't been more widely noted.\n\nOne of the things we've not talked about much in this podcast so far is the technology of music. We've discussed it a bit -- we've looked at how things like the change from 78s to 45s affected the music industry, at the transition from recording on discs to recording on tape, at the electrification of the guitar, and at Les Paul's inventions. But in general, the music we've looked at has been made in a fairly straightforward manner -- some people with some combination of guitars, bass, piano, drums, and saxophone, and maybe a few string players on the most recent recordings, get together in front of a microphone and sing and play those instruments.\n\nBut today, we're going to look at the start of synthesisers being used in rock and roll music. Today we're going to look at \"Runaway\" by Del Shannon:\n\n[Excerpt: Del Shannon, \"Runaway\"]\n\nSynthesised sound has a far longer pedigree than you might expect. The use of electronics to create music goes back to the invention of the theremin and the ondes martenot in the 1920s, and by the 1930s, people had already started using polyphonic keyboard-based electronic instruments. The Novachord was produced by the Hammond organ company between 1938 and 1942, and was introduced at the World's Fair in 1939, where Ferdinand Grofe, who we talked about a little in the episode on \"Cathy's Clown\", led a group consisting only of Novachord players in a public performance.\n\nThe Novachord never achieved mass popularity because of World War II halting its production, but it was still used in a few recordings. One that's of particular interest to those of us interested in early rock and roll is Slim Gaillard's \"Novachord Boogie\":\n\n[Excerpt: Slim Gaillard, \"Novachord Boogie\"]\n\nBut also it was used on one of the most famous records of the late thirties. These days, when you hear \"We'll Meet Again\" by Vera Lynn on documentaries about the second world war, this is the version you hear:\n\n[Excerpt: Vera Lynn, \"We'll Meet Again\"]\n\nBut the record that people actually listened to in World War II didn't have any of that orchestration. It was Lynn accompanied by a single instrument, a Novachord played by Arthur Young, and is notably more interesting and less syrupy:\n\n[Excerpt: Vera Lynn with Arthur Young on Novachord, \"We'll Meet Again\"]\n\nSo even in the late thirties, synthesised sounds were making their way on to extremely popular recordings, but it wasn't until after the war that electronic instruments started getting used in a major way. And the most popular of those instruments was a monophonic keyboard instrument called the clavioline, which was first produced in 1947. The clavioline was mostly used as a novelty element, but it appeared on several hit records. We're going to devote a whole episode in a few months' time to a record with the clavioline as lead instrument, but you can hear it on several fifties novelty records, like \"Little Red Monkey\" by Frank Chacksfield's Tunesmiths, a UK top ten hit from 1953:\n\n[Excerpt: Frank Chacksfield's Tunesmiths, \"Little Red Monkey\"]\n\nBut while the clavioline itself was in use quite widely in the fifties, the first big rock and roll hit with an electronic synthesiser actually used a modified clavioline called a musitron, which was put together by an electronics amateur and keyboard player named Max Crook, from Ann Arbor, Michigan.\n\nCrook had built his musitron using a clavioline as a base, but adding parts from TVs, reel-to-reel recorders, and bits of whatever electronic junk he could salvage parts from. He'd started playing electronic instruments in his teens, and had built his own recording studio.\n\nSadly, the early records Crook made are not easily available. The only place I've been able to track down copies of his early singles in a digital format is one grey-market CD, which I wasn't able to obtain in time to include the tracks here and which only seems to be available from one shop in Cornwall. His first band, the White Bucks, released a single, \"Get That Fly\" backed with \"Orny\", on Dot Records, but I can tell you from experience that if you search anywhere online for \"White Bucks Orny\" you will find... well, not that record, anyway.\n\nEven more interestingly, he apparently recorded a version of \"Bumble Boogie\", the novelty instrumental that would later become a hit for B. Bumble and the Stingers, with Berry Gordy at some point in the late fifties. Sadly, that too is not generally available.\n\nBut it wasn't until he auditioned for Charlie Johnson and the Big Little Show Band that Max Crook met the people who were going to become his most important collaborators. The Big Little Show Band had started as Doug DeMott and The Moonlight Ramblers, a honky-tonk band that played at the Hi-Lo Club in Battle Creek, Michigan. Battle Creek is a company town, midway between Chicago and Detroit, which is most famous as being the headquarters of the Kellogg company, the cereal manufacturer and largest employer there. It's not somewhere you'd expect great rock and roll to come from, being as it is a dull medium-sized town with little in the way of culture or nightlife.\n\nThe Hi-Lo Club was a rough place, frequented by hard-working, hard-drinking people, and Doug DeMott had been a hard drinker himself -- so hard a drinker, in fact, that he was soon sacked. The group's rhythm guitarist, Charles Westover, had changed his name to Charlie Johnson and put together a new lineup of the group based around himself and the bass player, Loren Dugger. They got in a new drummer, Dick Parker, and then went through a couple of guitarists before deciding to hire a keyboard player instead.\n\nOnce they auditioned Crook, with his musitron, which he could clip to the piano and thus provide chordal piano accompaniment while playing a lead melody on his musitron, they knew they had the right player for them.\n\nCrook had a friend, a black DJ named Ollie McLaughlin, who had music industry connections, and had been involved in the White Bucks recordings. Crook and Johnson started writing songs and recording demos for McLaughlin, who got Johnson a session with Irving Micahnik and Harry Balk, two record producers who were working with Johnny and the Hurricanes, an instrumental group who'd had a big hit with \"Red River Rock\" a year or so previously:\n\n[Excerpt: Johnny and the Hurricanes, \"Red River Rock\"]\n\nJohnson recorded two songs in New York, without his normal musicians backing him. However, Micahnik and Balk thought that the tracks were too dirgey, and Johnson was singing flat -- and listening to them it's not hard to see why they thought that:\n\n[Excerpt: Del Shannon, \"The Search\"]\n\nThey told him to go back and come up with some more material that was less dirgey. Two things did come out of the association straight away, though. The first was that Charles Johnson changed his name again, combining a forename he chose to be reminiscent of the Cadillac Coup deVille with a surname he took from an aspiring wrestler he knew, Mark Shannon, to become Del Shannon.\n\nThe second was that Johnny and the Hurricanes recorded one of Max Crook's instrumentals, \"Mr Lonely\", as a B-side, and you can hear in the Hammond organ part the kind of part that Crook would have been playing on his Musitron:\n\n[Excerpt: Johnny and the Hurricanes, \"Mr Lonely\"]\n\nShannon and Crook recorded a tape of many other songs they were working on for McLaughlin to play to Micahnik and Balk, but they weren't interested -- until they heard a fragment of a song that Shannon and Crook had recorded, and which they'd then mostly taped over. That song, \"Runaway\", was the one they wanted.\n\n\"Runaway\" had been an idea that had happened almost by accident. The band had been jamming on stage, and Crook had hit a chord change that Shannon thought sounded interesting -- in later tellings of the story, this is always the Am-G chord change that opens the song, but I suspect the actual chord change that caught his ear was the one where they go to an E major chord rather than the expected G or E minor on the line “As our hearts were young”. That's the only truly unusual chord change in the song.\n\nBut whatever it was, Shannon liked the changes that Crook was playing -- he and Crook would both later talk about how bored he was with the standard doo-wop progression that made up the majority of the songs they were playing at the time -- and the band ended up jamming on the new chord sequence for fifteen or twenty minutes before the club owner told them to play something else.\n\nThe next day, Shannon took his guitar to the carpet shop where he worked, and when there were no customers in, he would play the song to himself and write lyrics. He initially wrote two verses, but decided to scrap one.\n\nThey performed the song, then titled \"My Little Runaway\", that night, and it became a regular part of their set. The crucial element in the song, though, came during that first performance. Shannon said, just before they started, \"Max, when I point to you, play something\". And so when Shannon got to the end of the chorus, he pointed, and Crook played this:\n\n[Excerpt: Del Shannon, \"Runaway\"]\n\nWhen they were told that Micahnik and Balk liked the fragment of song that they'd heard, Shannon and Crook recorded a full demo of the song and sent it on to them. The producers weren't hugely impressed with the finished song, saying they thought it sounded like three songs trying to coexist, and they also didn't like Shannon's voice, but they *did* like Crook and the Musitron, and so they invited Crook and Shannon to come to New York to record. The two men drove seven hundred miles in a broken-down car, with their wives, to get from Michigan to New York. It was the middle of winter, the car had no heating, and Shannon smoked while Crook was allergic to tobacco smoke, so they had to keep the windows open.\n\nThe session they were going to do was a split session -- they were going to record two Del Shannon vocal tracks, and two instrumentals by Crook, who was recording under the name \"Maximilian\" without a surname (though the \"Max\" in his name was actually short for Maxfield). Crook was definitely the one they were interested in -- he rearranged the way the microphones were arranged in the studio, to get the sound he wanted rather than the standard studio sound, and he also had a bag full of gadgets that the studio engineers were fascinated by, for altering the Musitron's sound.\n\nThe first single released as by \"Maximilian\" was \"The Snake\", which featured Crook and Shannon's wives on handclaps, along with an additional clapper who was found on the street and paid forty dollars to come in and clap along:\n\n[Excerpt: Maximilian, \"The Snake\"]\n\nAfter that, the two women got bored and wandered off down Broadway. They eventually found themselves in the audience for a TV game show, Beat the Clock, and Joann Crook ended up a contestant on the show -- their husbands didn't believe them, when they explained later where they'd been, until acquaintances mentioned having seen Joann on TV.\n\nMeanwhile, the two men were working on another Maximillian track, and on two Del Shannon tracks, one of which was \"Runaway\". They couldn't afford to stay overnight in New York, so they drove back to Michigan, but when the record company listened to \"Runaway\", they discovered that Shannon had been singing flat due to nerves. Shannon had to go back to New York, this time by plane, to rerecord his vocals.\n\nAccording to Crook, even this wasn't enough, and the engineers eventually had to varispeed his vocals to get them in key with the backing track. I'm not at all sure how this would have worked, as speeding up his vocals would have also meant that he was singing at a different tempo, but that's what Crook said, and the vocal does have a slightly different quality to it. And Harry Balk backed Crook up, saying \"We finally got Del on key, and it sounded great, but it didn't sound like Del. We mixed it anyhow, and it came out wonderful. When I brought Ollie and Del into my office to hear it, Del had a bit of a fit. He said, 'Harry, that doesn't even sound like me!' I just remember saying, 'Yeah but Del, nobody knows what the hell you sound like!\"\n\nLike most great records, \"Runaway\" was the sum of many parts. Shannon later broke down all the elements that went into the song, saying:\n\n\"I learned falsetto from The Ink Spots' 'We Three,'\":\n\n[Excerpt: The Ink Spots, \"We Three (My Echo, My Shadow, and Me)\"]\n\n\"I eventually got hooked on Jimmy Jones' 'Handy Man' in '59 and would sing that at the Hi-Lo Club.\":\n\n[Excerpt: Jimmy Jones, \"Handy Man\"]\n\n\"I always had the idea of 'running away' somewhere in the back of my mind. 'I wa-wa-wa-wa-wonder, why...' I borrowed from Dion & The Belmonts' 'I Wonder Why.'\"\n\n[Excerpt: Dion and the Belmonts, \"I Wonder Why\"]\n\n\"The beats you hear in there, '...I wonder, bam-bam-bam, I wa-wa...' I stole from Bobby Darin's 'Dream Lover.'\"\n\n[Excerpt: Bobby Darin, \"Dream Lover\"]\n\nListening to the song, you can definitely hear all those elements that Shannon identifies in there, but what emerges is something fresh and original, unlike anything else out at the time:\n\n[Excerpt: Del Shannon, \"Runaway\"]\n\n\"Runaway\" went to number one in almost every country that had a chart at the time, and top five in most of the rest. In America, the song it knocked off the top was \"Blue Moon\" by the Marcels, one of those songs with the doo-wop progression that Shannon had been so bored with. At its peak, it was selling eighty thousand copies a day, and Billboard put it at number three hundred and sixty four on the all-time charts in 2018. It was a massive success, and a game-changer in the music industry.\n\nMaximilian's single, on the other hand, only made the top forty in Argentina. Clearly, Del Shannon was the artist who was going to be worth following, but they did release a few more singles by Maximilian, things like \"The Twisting Ghost\":\n\n[Excerpt: Maximilian, \"The Twisting Ghost\"]\n\nThat made the Canadian top forty, but Maximilian never became a star in his own right. Shannon, on the other hand, recorded a string of hits, though none were as successful as \"Runaway\". The most successful was the follow-up, \"Hats off to Larry\", which was very much \"Runaway part 2\":\n\n[Excerpt: Del Shannon, \"Hats off to Larry\"]\n\nBut every single he released after that was slightly less successful than the one before. He soon stopped working with Crook, who remained at the Hi-Lo Club with the rest of the band while Shannon toured the country, and without Crook's Musitron playing his records were far less interesting than his earliest singles, though he did have the distinction of being one of the few singers of this era to write the bulk of his own material.\n\nHe managed to further sabotage his career by suing Micahnik and Balk, and by 1963 he was largely washed up, though he did do one more thing that would make him at least a footnote in music history for something other than \"Runaway\".\n\nHe was more popular in the UK than in the US, and he even appeared in the film \"It's Trad Dad!\", a cheap cash-in on the trad jazz craze, starring Helen Shapiro and Craig Douglas as teenagers who try to persuade the stuffy adults who hate the young people's music that the Dukes of Dixieland, Mr. Acker Bilk and the Temperance Seven are not dangerous obscene noises threatening the morals of the nation's youth. That film also featured Gene Vincent and Chubby Checker along with a lot of British trumpet players, and was the first feature film made by Richard Lester, who we'll be hearing more about in this story.\n\nSo Shannon spent a fair amount of time in the UK, and in 1963 he noticed a song by a new British group that was rising up the UK charts and covered it. His version of \"From Me to You\" only made number seventy-seven on the US charts, but it was still the first version of a Lennon/McCartney song to make the Hot One Hundred:\n\n[Excerpt: Del Shannon, \"From Me to You\"]\n\nHe made some interesting records in the rest of the sixties, and had the occasional fluke hit, but the music he was making, a unique blend of hard garage rock and soft white doo-wop, was increasingly out of step with the rest of the industry. In the mid and late sixties, his biggest successes came with songwriting and productions for other artists. He wrote \"I Go to Pieces\" which became a hit for Peter & Gordon:\n\n[Excerpt: Peter and Gordon, \"I Go to Pieces\"]\n\nProduced the band Smith in their cover version of \"Baby It's You\", which made the top five:\n\n[Excerpt: Smith, \"Baby It's You\"]\n\nAnd produced Brian Hyland's million-selling version of a Curtis Mayfield song that I'm not going to play, because its title used a racial slur against Romani people which most non-Romani people didn't then regard as a slur, but which is a great record if you can get past that. That Hyland record featured Crook, reunited briefly with Shannon.\n\nBut over the seventies Shannon seemed increasingly lost, and while he continued to make records, including some good ones made in the UK with production by Dave Edmunds and Jeff Lynne, he was increasingly unwell with alcoholism. He finally got sober in 1978, and managed to have a fluke hit in 1981 with a cover version of Phil Phillips' \"Sea of Love\", produced by Tom Petty and with Petty's band the Heartbreakers backing him:\n\n[Excerpt: Del Shannon, \"Sea of Love\"]\n\nHe also came to people's attention when a rerecorded version of \"Runaway\" with new lyrics was used as the theme for the TV show Crime Story.\n\nIn 1989, Del Shannon was working on a comeback album, with Jeff Lynne producing and members of Tom Petty and the Heartbreakers as backing musicians. The same people had previously worked on Roy Orbison's last album, which had been his biggest success in decades, and Lynne was gaining a reputation for resuscitating the careers of older musicians. Both Lynne and Petty were fans of Shannon and had worked with him previously, and it seemed likely that he might be able to have a hit with some of the material he was working on. Certainly \"Walk Away\", which Shannon co-wrote with Lynne and Petty, sounds like the kind of thing that was getting radio play around that time:\n\n[Excerpt: Del Shannon, \"Walk Away\"]\n\nThere were even rumours that Lynne and Petty were thinking of inviting Shannon to join the Travelling Wilburys to replace Roy Orbison, though that seems unlikely to me.\n\nUnfortunately, by the time the album came out, Shannon was dead. He'd been suffering from depression for decades, and he died of suicide in early 1990, aged fifty-five. His widow later sued the manufacturers of the new wonder drug, Prozac, which he'd been prescribed a couple of weeks earlier, claiming that it caused his death.\n\nMax Crook, meanwhile, had become a firefighter and burglar alarm installer, while also pursuing a low-key career in music, mostly making religious music. When Shannon was posthumously inducted into the Rock and Roll Hall of Fame, Crook volunteered to perform at the ceremony, playing his original Musitron, but his offer was ignored. In later years he would regularly show up at annual celebrations of Shannon, and talk about the music they made together, and play for their fans. He died on July the first this year, aged eighty-three.",
  "itunes:subtitle": "Episode ninety of A History of Rock Music in Five Hundred Songs looks at Runaway by Del Shannon, and at the early use of synthesised sound in rock music. Click the full post to read liner notes, links to more information, and a transcript of the episode.",
  "itunes:keywords": "Berry Gordy,claviioline,Dave Edmunds,Del Shannon,Dot Records,Ferde Grofe,It&#039;s Trad Dad,Jeff Lynne,Johnny and the Hurricanes,lawsuits,Max Crook,synthesiser,The Beatles,Tom Petty,Vera Lynn",
  "itunes:episodeType": "full",
  "itunes:episode": 90,
  "content:encoded": "Episode ninety of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Runaway\" by Del Shannon, and at the early use of synthesised sound in rock music. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/39455335\">on \"Blue Moon\" by the Marcels.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>A note</strong>\n\nAlmost every version of “Runaway” currently available is in stereo, and the stereo version of the song has a slightly different vocal take to the original mono version. Unfortunately, there appear to be multiple “original mono versions” too. To check that what I'm using here, a mono track available as a bonus on a reissue of the album <em>Runaway With Del Shannon,</em> is actually the hit single version, I downloaded two vinyl rips of the single and one vinyl rip of a mono hits compilation from the sixties that had been uploaded to YouTube. Unfortunately no two copies of the song I could find online would play in synch – they all appear to be mastered at slightly different speeds, possibly due to the varispeeding I talk about in the episode. I've gone with the version I did because it's a clean-sounding mono version, but it may not be exactly what people heard in 1961.\n\n<strong>Resources</strong>\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode. This one is in two parts because of the number of songs by Del Shannon in the mix. <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-90a-runaway/\">Part one</a>, <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-90b-runaway-part-2/\">part two</a>.\n\nOnly one biography of Del Shannon has ever been written, and that's out of print and (to judge from the Amazon reviews) not very well written, so I've relied again on other sources. Those include the liner notes to <a href=\"https://amzn.to/2ZF9bfc\">this CD</a>, a good selection of Shannon's work (with the proviso that \"Runaway\" is in stereo -- see above; the articles on Shannon and Max Crook on <a href=\"http://tims.blackcat.nl/\">This Is My Story,</a> <a href=\"http://delshannon.com/\">the official Del Shannon website</a>,  and<a href=\"http://web.archive.org/web/20060506222625/http://go.zibycom.com/members/002222119/Site4/maxcrook.html\"> the Internet Archive's cached copy of Max Crook's old website</a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday's episode is an odd one to write, as just as I put the finishing touches to the script I discovered that Max Crook, the keyboard player at the centre of this story, died less than two weeks ago. The news wasn't widely reported, and I only discovered this by double-checking a detail and discovering an obituary of him. Crook was one of the great early pioneers of electronic music, and a massive talent, and he's a big part of the story I'm telling today, so before we go into the story proper I just wanted to take a moment to acknowledge his passing, and to regret that it hasn't been more widely noted.\n\nOne of the things we've not talked about much in this podcast so far is the technology of music. We've discussed it a bit -- we've looked at how things like the change from 78s to 45s affected the music industry, at the transition from recording on discs to recording on tape, at the electrification of the guitar, and at Les Paul's inventions. But in general, the music we've looked at has been made in a fairly straightforward manner -- some people with some combination of guitars, bass, piano, drums, and saxophone, and maybe a few string players on the most recent recordings, get together in front of a microphone and sing and play those instruments.\n\nBut today, we're going to look at the start of synthesisers being used in rock and roll music. Today we're going to look at \"Runaway\" by Del Shannon:\n\n[Excerpt: Del Shannon, \"Runaway\"]\n\nSynthesised sound has a far longer pedigree than you might expect. The use of electronics to create music goes back to the invention of the theremin and the ondes martenot in the 1920s, and by the 1930s, people had already started using polyphonic keyboard-based electronic instruments. The Novachord was produced by the Hammond organ company between 1938 and 1942, and was introduced at the World's Fair in 1939, where Ferdinand Grofe, who we talked about a little in the episode on \"Cathy's Clown\", led a group consisting only of Novachord players in a public performance.\n\nThe Novachord never achieved mass popularity because of World War II halting its production, but it was still used in a few recordings. One that's of particular interest to those of us interested in early rock and roll is Slim Gaillard's \"Novachord Boogie\":\n\n[Excerpt: Slim Gaillard, \"Novachord Boogie\"]\n\nBut also it was used on one of the most famous records of the late thirties. These days, when you hear \"We'll Meet Again\" by Vera Lynn on documentaries about the second world war, this is the version you hear:\n\n[Excerpt: Vera Lynn, \"We'll Meet Again\"]\n\nBut the record that people actually listened to in World War II didn't have any of that orchestration. It was Lynn accompanied by a single instrument, a Novachord played by Arthur Young, and is notably more interesting and less syrupy:\n\n[Excerpt: Vera Lynn with Arthur Young on Novachord, \"We'll Meet Again\"]\n\nSo even in the late thirties, synthesised sounds were making their way on to extremely popular recordings, but it wasn't until after the war that electronic instruments started getting used in a major way. And the most popular of those instruments was a monophonic keyboard instrument called the clavioline, which was first produced in 1947. The clavioline was mostly used as a novelty element, but it appeared on several hit records. We're going to devote a whole episode in a few months' time to a record with the clavioline as lead instrument, but you can hear it on several fifties novelty records, like \"Little Red Monkey\" by Frank Chacksfield's Tunesmiths, a UK top ten hit from 1953:\n\n[Excerpt: Frank Chacksfield's Tunesmiths, \"Little Red Monkey\"]\n\nBut while the clavioline itself was in use quite widely in the fifties, the first big rock and roll hit with an electronic synthesiser actually used a modified clavioline called a musitron, which was put together by an electronics amateur and keyboard player named Max Crook, from Ann Arbor, Michigan.\n\nCrook had built his musitron using a clavioline as a base, but adding parts from TVs, reel-to-reel recorders, and bits of whatever electronic junk he could salvage parts from. He'd started playing electronic instruments in his teens, and had built his own recording studio.\n\nSadly, the early records Crook made are not easily available. The only place I've been able to track down copies of his early singles in a digital format is one grey-market CD, which I wasn't able to obtain in time to include the tracks here and which only seems to be available from one shop in Cornwall. His first band, the White Bucks, released a single, \"Get That Fly\" backed with \"Orny\", on Dot Records, but I can tell you from experience that if you search anywhere online for \"White Bucks Orny\" you will find... well, not that record, anyway.\n\nEven more interestingly, he apparently recorded a version of \"Bumble Boogie\", the novelty instrumental that would later become a hit for B. Bumble and the Stingers, with Berry Gordy at some point in the late fifties. Sadly, that too is not generally available.\n\nBut it wasn't until he auditioned for Charlie Johnson and the Big Little Show Band that Max Crook met the people who were going to become his most important collaborators. The Big Little Show Band had started as Doug DeMott and The Moonlight Ramblers, a honky-tonk band that played at the Hi-Lo Club in Battle Creek, Michigan. Battle Creek is a company town, midway between Chicago and Detroit, which is most famous as being the headquarters of the Kellogg company, the cereal manufacturer and largest employer there. It's not somewhere you'd expect great rock and roll to come from, being as it is a dull medium-sized town with little in the way of culture or nightlife.\n\nThe Hi-Lo Club was a rough place, frequented by hard-working, hard-drinking people, and Doug DeMott had been a hard drinker himself -- so hard a drinker, in fact, that he was soon sacked. The group's rhythm guitarist, Charles Westover, had changed his name to Charlie Johnson and put together a new lineup of the group based around himself and the bass player, Loren Dugger. They got in a new drummer, Dick Parker, and then went through a couple of guitarists before deciding to hire a keyboard player instead.\n\nOnce they auditioned Crook, with his musitron, which he could clip to the piano and thus provide chordal piano accompaniment while playing a lead melody on his musitron, they knew they had the right player for them.\n\nCrook had a friend, a black DJ named Ollie McLaughlin, who had music industry connections, and had been involved in the White Bucks recordings. Crook and Johnson started writing songs and recording demos for McLaughlin, who got Johnson a session with Irving Micahnik and Harry Balk, two record producers who were working with Johnny and the Hurricanes, an instrumental group who'd had a big hit with \"Red River Rock\" a year or so previously:\n\n[Excerpt: Johnny and the Hurricanes, \"Red River Rock\"]\n\nJohnson recorded two songs in New York, without his normal musicians backing him. However, Micahnik and Balk thought that the tracks were too dirgey, and Johnson was singing flat -- and listening to them it's not hard to see why they thought that:\n\n[Excerpt: Del Shannon, \"The Search\"]\n\nThey told him to go back and come up with some more material that was less dirgey. Two things did come out of the association straight away, though. The first was that Charles Johnson changed his name again, combining a forename he chose to be reminiscent of the Cadillac Coup deVille with a surname he took from an aspiring wrestler he knew, Mark Shannon, to become Del Shannon.\n\nThe second was that Johnny and the Hurricanes recorded one of Max Crook's instrumentals, \"Mr Lonely\", as a B-side, and you can hear in the Hammond organ part the kind of part that Crook would have been playing on his Musitron:\n\n[Excerpt: Johnny and the Hurricanes, \"Mr Lonely\"]\n\nShannon and Crook recorded a tape of many other songs they were working on for McLaughlin to play to Micahnik and Balk, but they weren't interested -- until they heard a fragment of a song that Shannon and Crook had recorded, and which they'd then mostly taped over. That song, \"Runaway\", was the one they wanted.\n\n\"Runaway\" had been an idea that had happened almost by accident. The band had been jamming on stage, and Crook had hit a chord change that Shannon thought sounded interesting -- in later tellings of the story, this is always the Am-G chord change that opens the song, but I suspect the actual chord change that caught his ear was the one where they go to an E major chord rather than the expected G or E minor on the line “As our hearts were young”. That's the only truly unusual chord change in the song.\n\nBut whatever it was, Shannon liked the changes that Crook was playing -- he and Crook would both later talk about how bored he was with the standard doo-wop progression that made up the majority of the songs they were playing at the time -- and the band ended up jamming on the new chord sequence for fifteen or twenty minutes before the club owner told them to play something else.\n\nThe next day, Shannon took his guitar to the carpet shop where he worked, and when there were no customers in, he would play the song to himself and write lyrics. He initially wrote two verses, but decided to scrap one.\n\nThey performed the song, then titled \"My Little Runaway\", that night, and it became a regular part of their set. The crucial element in the song, though, came during that first performance. Shannon said, just before they started, \"Max, when I point to you, play something\". And so when Shannon got to the end of the chorus, he pointed, and Crook played this:\n\n[Excerpt: Del Shannon, \"Runaway\"]\n\nWhen they were told that Micahnik and Balk liked the fragment of song that they'd heard, Shannon and Crook recorded a full demo of the song and sent it on to them. The producers weren't hugely impressed with the finished song, saying they thought it sounded like three songs trying to coexist, and they also didn't like Shannon's voice, but they *did* like Crook and the Musitron, and so they invited Crook and Shannon to come to New York to record. The two men drove seven hundred miles in a broken-down car, with their wives, to get from Michigan to New York. It was the middle of winter, the car had no heating, and Shannon smoked while Crook was allergic to tobacco smoke, so they had to keep the windows open.\n\nThe session they were going to do was a split session -- they were going to record two Del Shannon vocal tracks, and two instrumentals by Crook, who was recording under the name \"Maximilian\" without a surname (though the \"Max\" in his name was actually short for Maxfield). Crook was definitely the one they were interested in -- he rearranged the way the microphones were arranged in the studio, to get the sound he wanted rather than the standard studio sound, and he also had a bag full of gadgets that the studio engineers were fascinated by, for altering the Musitron's sound.\n\nThe first single released as by \"Maximilian\" was \"The Snake\", which featured Crook and Shannon's wives on handclaps, along with an additional clapper who was found on the street and paid forty dollars to come in and clap along:\n\n[Excerpt: Maximilian, \"The Snake\"]\n\nAfter that, the two women got bored and wandered off down Broadway. They eventually found themselves in the audience for a TV game show, Beat the Clock, and Joann Crook ended up a contestant on the show -- their husbands didn't believe them, when they explained later where they'd been, until acquaintances mentioned having seen Joann on TV.\n\nMeanwhile, the two men were working on another Maximillian track, and on two Del Shannon tracks, one of which was \"Runaway\". They couldn't afford to stay overnight in New York, so they drove back to Michigan, but when the record company listened to \"Runaway\", they discovered that Shannon had been singing flat due to nerves. Shannon had to go back to New York, this time by plane, to rerecord his vocals.\n\nAccording to Crook, even this wasn't enough, and the engineers eventually had to varispeed his vocals to get them in key with the backing track. I'm not at all sure how this would have worked, as speeding up his vocals would have also meant that he was singing at a different tempo, but that's what Crook said, and the vocal does have a slightly different quality to it. And Harry Balk backed Crook up, saying \"We finally got Del on key, and it sounded great, but it didn't sound like Del. We mixed it anyhow, and it came out wonderful. When I brought Ollie and Del into my office to hear it, Del had a bit of a fit. He said, 'Harry, that doesn't even sound like me!' I just remember saying, 'Yeah but Del, nobody knows what the hell you sound like!\"\n\nLike most great records, \"Runaway\" was the sum of many parts. Shannon later broke down all the elements that went into the song, saying:\n\n\"I learned falsetto from The Ink Spots' 'We Three,'\":\n\n[Excerpt: The Ink Spots, \"We Three (My Echo, My Shadow, and Me)\"]\n\n\"I eventually got hooked on Jimmy Jones' 'Handy Man' in '59 and would sing that at the Hi-Lo Club.\":\n\n[Excerpt: Jimmy Jones, \"Handy Man\"]\n\n\"I always had the idea of 'running away' somewhere in the back of my mind. 'I wa-wa-wa-wa-wonder, why...' I borrowed from Dion & The Belmonts' 'I Wonder Why.'\"\n\n[Excerpt: Dion and the Belmonts, \"I Wonder Why\"]\n\n\"The beats you hear in there, '...I wonder, bam-bam-bam, I wa-wa...' I stole from Bobby Darin's 'Dream Lover.'\"\n\n[Excerpt: Bobby Darin, \"Dream Lover\"]\n\nListening to the song, you can definitely hear all those elements that Shannon identifies in there, but what emerges is something fresh and original, unlike anything else out at the time:\n\n[Excerpt: Del Shannon, \"Runaway\"]\n\n\"Runaway\" went to number one in almost every country that had a chart at the time, and top five in most of the rest. In America, the song it knocked off the top was \"Blue Moon\" by the Marcels, one of those songs with the doo-wop progression that Shannon had been so bored with. At its peak, it was selling eighty thousand copies a day, and Billboard put it at number three hundred and sixty four on the all-time charts in 2018. It was a massive success, and a game-changer in the music industry.\n\nMaximilian's single, on the other hand, only made the top forty in Argentina. Clearly, Del Shannon was the artist who was going to be worth following, but they did release a few more singles by Maximilian, things like \"The Twisting Ghost\":\n\n[Excerpt: Maximilian, \"The Twisting Ghost\"]\n\nThat made the Canadian top forty, but Maximilian never became a star in his own right. Shannon, on the other hand, recorded a string of hits, though none were as successful as \"Runaway\". The most successful was the follow-up, \"Hats off to Larry\", which was very much \"Runaway part 2\":\n\n[Excerpt: Del Shannon, \"Hats off to Larry\"]\n\nBut every single he released after that was slightly less successful than the one before. He soon stopped working with Crook, who remained at the Hi-Lo Club with the rest of the band while Shannon toured the country, and without Crook's Musitron playing his records were far less interesting than his earliest singles, though he did have the distinction of being one of the few singers of this era to write the bulk of his own material.\n\nHe managed to further sabotage his career by suing Micahnik and Balk, and by 1963 he was largely washed up, though he did do one more thing that would make him at least a footnote in music history for something other than \"Runaway\".\n\nHe was more popular in the UK than in the US, and he even appeared in the film \"It's Trad Dad!\", a cheap cash-in on the trad jazz craze, starring Helen Shapiro and Craig Douglas as teenagers who try to persuade the stuffy adults who hate the young people's music that the Dukes of Dixieland, Mr. Acker Bilk and the Temperance Seven are not dangerous obscene noises threatening the morals of the nation's youth. That film also featured Gene Vincent and Chubby Checker along with a lot of British trumpet players, and was the first feature film made by Richard Lester, who we'll be hearing more about in this story.\n\nSo Shannon spent a fair amount of time in the UK, and in 1963 he noticed a song by a new British group that was rising up the UK charts and covered it. His version of \"From Me to You\" only made number seventy-seven on the US charts, but it was still the first version of a Lennon/McCartney song to make the Hot One Hundred:\n\n[Excerpt: Del Shannon, \"From Me to You\"]\n\nHe made some interesting records in the rest of the sixties, and had the occasional fluke hit, but the music he was making, a unique blend of hard garage rock and soft white doo-wop, was increasingly out of step with the rest of the industry. In the mid and late sixties, his biggest successes came with songwriting and productions for other artists. He wrote \"I Go to Pieces\" which became a hit for Peter & Gordon:\n\n[Excerpt: Peter and Gordon, \"I Go to Pieces\"]\n\nProduced the band Smith in their cover version of \"Baby It's You\", which made the top five:\n\n[Excerpt: Smith, \"Baby It's You\"]\n\nAnd produced Brian Hyland's million-selling version of a Curtis Mayfield song that I'm not going to play, because its title used a racial slur against Romani people which most non-Romani people didn't then regard as a slur, but which is a great record if you can get past that. That Hyland record featured Crook, reunited briefly with Shannon.\n\nBut over the seventies Shannon seemed increasingly lost, and while he continued to make records, including some good ones made in the UK with production by Dave Edmunds and Jeff Lynne, he was increasingly unwell with alcoholism. He finally got sober in 1978, and managed to have a fluke hit in 1981 with a cover version of Phil Phillips' \"Sea of Love\", produced by Tom Petty and with Petty's band the Heartbreakers backing him:\n\n[Excerpt: Del Shannon, \"Sea of Love\"]\n\nHe also came to people's attention when a rerecorded version of \"Runaway\" with new lyrics was used as the theme for the TV show Crime Story.\n\nIn 1989, Del Shannon was working on a comeback album, with Jeff Lynne producing and members of Tom Petty and the Heartbreakers as backing musicians. The same people had previously worked on Roy Orbison's last album, which had been his biggest success in decades, and Lynne was gaining a reputation for resuscitating the careers of older musicians. Both Lynne and Petty were fans of Shannon and had worked with him previously, and it seemed likely that he might be able to have a hit with some of the material he was working on. Certainly \"Walk Away\", which Shannon co-wrote with Lynne and Petty, sounds like the kind of thing that was getting radio play around that time:\n\n[Excerpt: Del Shannon, \"Walk Away\"]\n\nThere were even rumours that Lynne and Petty were thinking of inviting Shannon to join the Travelling Wilburys to replace Roy Orbison, though that seems unlikely to me.\n\nUnfortunately, by the time the album came out, Shannon was dead. He'd been suffering from depression for decades, and he died of suicide in early 1990, aged fifty-five. His widow later sued the manufacturers of the new wonder drug, Prozac, which he'd been prescribed a couple of weeks earlier, claiming that it caused his death.\n\nMax Crook, meanwhile, had become a firefighter and burglar alarm installer, while also pursuing a low-key career in music, mostly making religious music. When Shannon was posthumously inducted into the Rock and Roll Hall of Fame, Crook volunteered to perform at the ceremony, playing his original Musitron, but his offer was ignored. In later years he would regularly show up at annual celebrations of Shannon, and talk about the music they made together, and play for their fans. He died on July the first this year, aged eighty-three.",
  "enclosure": "",
  "itunes:summary": "Episode ninety of A History of Rock Music in Five Hundred Songs looks at \"Runaway\" by Del Shannon, and at the early use of synthesised sound in rock music. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Blue Moon\" by the Marcels.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nA note\n\nAlmost every version of “Runaway” currently available is in stereo, and the stereo version of the song has a slightly different vocal take to the original mono version. Unfortunately, there appear to be multiple “original mono versions” too. To check that what I'm using here, a mono track available as a bonus on a reissue of the album Runaway With Del Shannon, is actually the hit single version, I downloaded two vinyl rips of the single and one vinyl rip of a mono hits compilation from the sixties that had been uploaded to YouTube. Unfortunately no two copies of the song I could find online would play in synch – they all appear to be mastered at slightly different speeds, possibly due to the varispeeding I talk about in the episode. I've gone with the version I did because it's a clean-sounding mono version, but it may not be exactly what people heard in 1961.\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode. This one is in two parts because of the number of songs by Del Shannon in the mix. Part one, part two.\n\nOnly one biography of Del Shannon has ever been written, and that's out of print and (to judge from the Amazon reviews) not very well written, so I've relied again on other sources. Those include the liner notes to this CD, a good selection of Shannon's work (with the proviso that \"Runaway\" is in stereo -- see above; the articles on Shannon and Max Crook on This Is My Story, the official Del Shannon website,  and the Internet Archive's cached copy of Max Crook's old website.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nToday's episode is an odd one to write, as just as I put the finishing touches to the script I discovered that Max Crook, the keyboard player at the centre of this story, died less than two weeks ago. The news wasn't widely reported, and I only discovered this by double-checking a detail and discovering an obituary of him. Crook was one of the great early pioneers of electronic music, and a massive talent, and he's a big part of the story I'm telling today, so before we go into the story proper I just wanted to take a moment to acknowledge his passing, and to regret that it hasn't been more widely noted.\n\nOne of the things we've not talked about much in this podcast so far is the technology of music. We've discussed it a bit -- we've looked at how things like the change from 78s to 45s affected the music industry, at the transition from recording on discs to recording on tape, at the electrification of the guitar, and at Les Paul's inventions. But in general, the music we've looked at has been made in a fairly straightforward manner -- some people with some combination of guitars, bass, piano, drums, and saxophone, and maybe a few string players on the most recent recordings, get together in front of a microphone and sing and play those instruments.\n\nBut today, we're going to look at the start of synthesisers being used in rock and roll music. Today we're going to look at \"Runaway\" by Del Shannon:\n\n[Excerpt: Del Shannon, \"Runaway\"]\n\nSynthesised sound has a far longer pedigree than you might expect. The use of electronics to create music goes back to the invention of the theremin and the ondes martenot in the 1920s, and by the 1930s, people had already started using polyphonic keyboard-based el",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode ninety of A History of Rock Music in Five Hundred Songs looks at \"Runaway\" by Del Shannon, and at the early use of synthesised sound in rock music. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Blue Moon\" by the Marcels.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nA note\n\nAlmost every version of “Runaway” currently available is in stereo, and the stereo version of the song has a slightly different vocal take to the original mono version. Unfortunately, there appear to be multiple “original mono versions” too. To check that what I'm using here, a mono track available as a bonus on a reissue of the album Runaway With Del Shannon, is actually the hit single version, I downloaded tw",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}