{
  "title": "Is This the Best Semiconductor Ever Found?",
  "link": "https://spectrum.ieee.org/best-semiconductor-boron-arsenide",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/figure-of-cubic-boron-arsenide-on-a-colorful-background.jpg?id=30296928&width=1200&height=800&coordinates=0%2C65%2C0%2C66\"/><br/><br/><p>Silicon is the foundation of the electronics industry. However, its performance as a semiconductor leaves much to be desired. Now scientists have discovered that an obscure material known as cubic boron arsenide (c-BAs) may perform much better than silicon. In fact, it may be the best semiconductor ever found, and potentially even the best possible one.<br/></p><p><a href=\"https://spectrum.ieee.org/silicon-valley-cares-about-chips-again\" target=\"_blank\">Silicon</a> is one of the most abundant elements on earth. In its pure form, silicon is key to much of modern technology, from microchips to solar cells. However, its properties as a semiconductor are far from ideal.</p><p class=\"pull-quote\">“We demonstrated, for the first time, a new material with high carrier mobility and simultaneously high thermal conductivity.”<br/>—Zhifeng Ren, University of Houston</p><p>For one thing, silicon is not very good at conducting heat. As such, <a href=\"https://spectrum.ieee.org/carbon-nanotubes-could-solve-overheating-problem-for-nextgen-computer-chips\" target=\"_blank\">overheating</a> and expensive <a href=\"https://spectrum.ieee.org/meet-the-electronics-cooling-system-400-million-years-in-the-making\" target=\"_blank\">cooling systems</a> are common in computers. Furthermore, although silicon lets electrons race through its structure easily, it is much less obliging to the positively charged absences of electrons known as holes. These weaknesses reduce silicon’s overall efficiency as a semiconductor. (To be fair, most semiconductors offer high mobility only for either electrons or holes.)</p><p>In <u><a href=\"https://www.science.org/doi/10.1126/science.aat5522\" target=\"_blank\">2018</a></u>, experiments revealed that c-BAs—a crystal grown from boron and arsenic, two relatively common mineral elements—conducted heat nearly 10 times as well as silicon. This is the best known thermal conductivity of any semiconductor, and the third-best known thermal conductivity of any material, behind diamond and isotopically enriched cubic boron nitride.</p><p>In addition, <u><a href=\"https://journals.aps.org/prb/abstract/10.1103/PhysRevB.98.081203\" rel=\"noopener noreferrer\" target=\"_blank\">theoretical predictions</a></u> suggested that c-BAs would also possess very high mobility for both electrons and holes. Now, in <u><a href=\"https://www.science.org/doi/10.1126/science.abn4290\" rel=\"noopener noreferrer\" target=\"_blank\">two</a></u> <u><a href=\"https://www.science.org/doi/10.1126/science.abn4727\" rel=\"noopener noreferrer\" target=\"_blank\">studies</a></u> in the 22 July issue of the journal <em>Science</em>, experiments confirm cubic boron arsenide's high electron and hole mobility.</p><p>“We demonstrated, for the first time, a new material with high carrier mobility and simultaneously high thermal conductivity,” says Zhifeng Ren, a physicist and materials scientist at the University of Houston and a coauthor on both studies. “The findings point out a new direction for semiconductors that could revolutionize the semiconductor industry in the near future.”</p><p>Analyzing electron and hole mobility in c-BAs was challenging because the crystals the researchers had were small. In addition, the crystals were riddled with impurities that scattered the electrons and holes. By probing the crystals with <a href=\"https://orensteinlab.berkeley.edu/optical-techniques/#transGrat\" rel=\"noopener noreferrer\" target=\"_blank\">laser</a> <a href=\"https://www.nature.com/articles/s41563-019-0498-x\" rel=\"noopener noreferrer\" target=\"_blank\">pulses</a>, the team of scientists (from the University of Houston as well as MIT, the University of Texas at Austin, and Boston College) found that electrons and electron holes had the highest mobility at locations on the lattice with the fewest impurities.</p><p>Electron and hole mobility is measured in units of square centimeters per volt-seconds (cm<sup>2</sup>/V•s). Silicon has an electron mobility of 1,400 cm<sup>2</sup>/V•s and a hole mobility of 450 cm<sup>2</sup>/V•s  at room temperature. By contrast, according to the new findings, c-BAs has a mobility of 1,600 cm<sup>2</sup>/V•s  for both electrons and holes moving together at room temperature.</p><p>Moreover, one of the two new studies in <em>Science</em> found that electron mobility in c-BAs could reach as high as 3,000 cm<sup>2</sup>/V•s. This feat may be due to “hot electrons,” which preserve the energy generated by laser pulses used to excite the charge carriers longer than they do in most other materials.</p><p>So far, scientists have made c-BAs only in small, lab-scale batches that are not uniform. Still, Ren thinks it very likely that it can be made in a practical and economic way, since boron, arsenic, and the crystal fabrication technique are all inexpensive. He says that in order to maintain quality control, the crystals may be scaled to much larger sizes only “when the growth process is fully understood.”</p><p>In addition, says Ren, “my group has always believed that even higher thermal conductivity and higher mobility should be achieved when the crystal quality is further improved, so the near-term goal is to improve their growth for higher-quality crystals.”</p>",
  "pubDate": "Wed, 27 Jul 2022 16:07:32 +0000",
  "guid": "https://spectrum.ieee.org/best-semiconductor-boron-arsenide",
  "category": [
    "Semiconductor",
    "Silicon",
    "Electronics",
    "Solar cell",
    "Electrons",
    "Holes",
    "Charge carrier mobility",
    "Cubic boron arsenide"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}