{
  "id": "https://bibleinoneyear.org/en/youth/282",
  "title": "Day 282: Life-changing Words",
  "description": "Psalm 119:1–2, Jeremiah 18:1–11, 1 Thessalonians 1:2–13.  Earl and his wife, Thommy, were great friends of ours at theological college in Oxford  His life had been radically changed by the words of God in the Bible",
  "pubDate": "Sun, 09 Oct 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/282/",
  "itunes:duration": "14:09",
  "guid": "enyouth09102022-282",
  "length": 849.48,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 282: Life-changing Words",
  "itunes:subtitle": "Psalm 119:1–2, Jeremiah 18:1–11, 1 Thessalonians 1:2–13.  Earl and his wife, Thommy, were great friends of ours at theological college in Oxford  His life had been radically changed by the words of God in the Bible",
  "itunes:summary": "Earl had far too much money. He did not need to work. He took all kinds of drugs, including heroin. At the age of thirty he ended up in hospital.\nSomeone came to visit him in hospital and gave him a New Testament. He was thrilled. The paper was very thin and was ideal for rolling joints. He rolled his way through Matthew, Mark and Luke. When he came to John’s Gospel, he started reading. As a result of reading the words of John’s Gospel, he encountered Jesus. He was filled with joy.\nThe psychologist in charge of his case was a very beautiful young woman, who had been a model. One day she said to Earl, ‘Look, I have it all – success, beauty and endless qualifications – yet I am not fulfilled. Your life is a mess yet you seem to have something – a peace and a joy. What is it?’\nThen he led her to faith in Jesus Christ. Later they were married. Earl and his wife, Thommy, were great friends of ours at theological college in Oxford. His life had been radically changed by the words of God in the Bible.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 647
}