{
  "title": "ARE CHARLI D'AMELIO AND LANDON BARKER DATING? — BFFs EP. 86",
  "description": "<p>We are back after a week off and we lead off the show with the tragic passing of Cooper Noriega. You can find all the info about the mental health Discord he started and his family is continuing on the page \"Cooper's Advice\" here: https://instagram.com/coopsadvice?igshid=YmMyMTA2M2Y=\n\nWe then get into headlines talking about Lil Huddy deleting pictures with Landon Barker after he is spotted leaving a show with Charli D'Amelio and Britney Spears having her wedding and her ex-husband crash it. \n\nThe show is then quickly derailed after Dave gives the double bird salute after not being able to bring two extra guests to the Hampton's White Party, and a debate about whether or not Miley Cyrus' version of \"Like A Prayer\" is better than Madonna's, leading to a 10 minute tangent of watching both performances in full. \n\nWe pick the pod back up with Justin Bieber sharing he has Ramsay Hunt Syndrome, Sony Execs being trolled into re-releasing Morbius, a couple hiring Minnie and Mickey instead of giving food at their wedding, Ryan Gosling's look for the upcoming Barbie movie, Mike Majlak buying a house with an NFT, and Squid Games 2 getting announced.\n\nWe finish the pod with BFFs Corner where Nessa approved of Josh and Grace's closure walk, Josh and Nessa following each other on all social media, whether or not Nessa was spotted taking Josh's dog Buddy for a drive, Jackson Mahomes agreeing to come on BFFs, Bri having her first live show, O'Malley getting cancelled by Millie Bobby Brown stans, and end with some videos to react to.\n\nSupport our sponsors! \n\nBetterhelp: Go to BetterHelp.com/BFF for 10% off your first month\n\nGametime: Download the Gametime app at https://barstool.link/GametimeApp and redeem code BFF for $20 off your first purchase (terms apply).\n\nHooters: Head to https://barstool.link/HootersBSS  to cast your vote</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/bffspod\">barstool.link/bffspod</a></p>",
  "guid": "a80f467d-c1ec-4318-a869-3f0bb5d0ba65",
  "pubDate": "Thu, 23 Jun 2022 00:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/134/Bffs",
  "itunes:explicit": "yes",
  "itunes:duration": "00:39:01",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}