{
  "title": "Forum on strengthening primary health care in Indonesia: Lessons from COVID-19",
  "link": "https://www.newmandala.org/forum-strengthening-primary-health-care-in-indonesia/",
  "dc:creator": "New Mandala",
  "pubDate": "Fri, 04 Nov 2022 06:27:06 +0000",
  "category": [
    "ANU Indonesia Institute",
    "Australia",
    "Australia and Southeast Asia",
    "COVID-19",
    "Indonesia",
    "Public health"
  ],
  "guid": "https://www.newmandala.org/?p=60241",
  "description": "<p>This discussion brings together experts from the USA, Australia and Indonesia.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.newmandala.org/forum-strengthening-primary-health-care-in-indonesia/\">Forum on strengthening primary health care in Indonesia: Lessons from COVID-19</a> appeared first on <a rel=\"nofollow\" href=\"https://www.newmandala.org\">New Mandala</a>.</p>\n",
  "content:encoded": "<p><strong>Date and time:</strong></p>\n<p>17 November 2022, 1-2.30 pm AEDT, 9-10:30am WIB</p>\n<div class=\"panel-pane pane-entity-field pane-node-field-cap-event-date\">\n<div class=\"pane-content\">\n<div class=\"field field-name-field-cap-event-date field-type-datetime field-label-hidden\">\n<div class=\"field-items\">\n<div><strong>Speakers:</strong></div>\n</div>\n</div>\n</div>\n</div>\n<div class=\"panel-pane pane-node-body\">\n<div class=\"pane-content\">\n<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\">\n<div class=\"field-items\">\n<div class=\"field-item even\">\n<div>\n<ul>\n<li>Shailey Prasad (University of Minnesota, USA) – COVID-19 pandemic and primary health care in the US</li>\n<li>Christine Phillips (Australia National University, Australia) – Primary health care and COVID-19 in Australia</li>\n<li>Made Ady Wirawan (Udayana University, Indonesia) – Primary health care and COVID-19 in Indonesia</li>\n</ul>\n<p><strong>Convenor: </strong>Dr I Nyoman Sutarsa</p>\n<p><a href=\"https://events.zoom.us/ev/AiJYt6cBTeQ_5YCRRe-aOMhmKz8gE-LHMRxoxYWRFEIUHY8A7Z8N~AggLXsr32QYFjq8BlYLZ5I06Dg\">Register via this link</a></p>\n<p>The COVID-19 pandemic exposed the fragility of Indonesia’s health systems, including delivery of essential health services in the primary care setting. The pandemic also revealed existing health and social inequities in Indonesia, with highly uneven effects and experiences across locations and services. Like in many other middle-income countries with fragile health and primary care services, in Indonesia the pa.demic placed an immense burden on health systems, particularly community-based health programs and the delivery of essential health services in primary care settings. For example, the social restrictions designed to contain the pandemic have negatively influenced the uptake of antenatal care visits, self-management programs for patients with chronic illnesses, and other community empowerment activities.</p>\n<p>This seminar will discuss lessons learned from the COVID-19 pandemic in order to improve and strengthen primary health care in Indonesia. Understanding the impacts of the pandemic on the uptake of essential health services in primary care settings, including barriers and enablers, is critical to ensure continuity of care, to reduce the burden of preventable diseases and to decrease utilisation of health resources and hospitalisation rates. This panel discussion brings together experts from the USA, Australia, and Indonesia, to share knowledge and best practices when it comes to collecting and documenting the effects of the pandemic on sustainability of access to essential health services. Such comparative data are crucial for health leaders and policymakers to identify and prioritise actions, strategies, and health resources, that can strengthen essential health services in primary care in Indonesia. The seminar will also discuss reform strategies to ensure better access and uptake of essential health services, and to prepare better systems for future pandemics or public health emergencies.<strong><u> </u></strong></p>\n<p><strong>Convenor: </strong></p>\n<p><strong>Dr I Nyoman Sutarsa </strong>is a Senior Lecturer in Population Health, Medical School at The Australian National University and a member of the ANU Indonesia Institute’s advisory board, and a Lecturer and Researcher in the Department of Public Health and Preventative Medicine, Faculty of Medicine, Udayana University</p>\n<p><strong>Speakers: </strong></p>\n<p><strong>I Md Ady Wirawan,</strong> MD, MPH, Ph.D (Ady) is a family medicine physician and professor at the Department of Public Health and Preventive Medicine, Faculty of Medicine, Udayana University, Bali, Indonesia. He is currently the Vice Dean for Student, Information, and Cooperation Affairs at the Faculty of Medicine, Udayana University. His areas of interest in research include occupational health, travel medicine, global health, and primary care. He led the development of the Integrated Travel Health Surveillance and Information System at Destinations (TravHeSID), and also Indonesia Travel Health Network (InaTravNet).</p>\n<p><em>The COVID-19 pandemic has exposed the fragility of healthcare systems in Indonesia, including service delivery of essential health services at the primary care settings. In this talk I describe the challenges for the healthcare system in Indonesia during pandemic, disruption of essential health service provisions, strategies for adaptation used to strengthen essential services, and future recommendation for Indonesia. </em></p>\n<p><strong>Professor Christine Phillips</strong> is a general practitioner, Head of Social Foundations of Medicine at the Australian National University, and Associate Dean for Health Social Science. She is a co-founder of the Refugee Health Network of Australia and a member of the Migrant and Refugee Health Partnership national peak body. In 2021, she led the development of the WHO Global Competency Framework for Health workers working with Migrants and Refugees. She is the Medical Director of Companion House Refugee Health Service in the ACT. Through the COVID-19 pandemic has provided intensive support for primary care service delivery for marginalized populations.</p>\n<p><em>The COVID-19 pandemic in Australia was delayed through border closures and an initial public health focus on elimination. In this talk I describe the impacts of lockdowns on social cohesion, mental health and primary health care delivery. The COVID-19 pandemic highlighted fragilities in aged care and challenges in whole-of-community collaboration for both elimination and mitigation strategies. Primary care was emphasized in policy as a way of driving social cohesion and community-based care. This response will be compared and contrasted with Australia’s health response to the HIV epidemic in the late twentieth century.</em></p>\n<p><strong>Shailendra (Shailey) Prasad, MD MPH FAAFP</strong> is the Associate Vice President for Global and Rural Health at the University of Minnesota. He is the Carlson Chair of Global Health and the Executive Director of the Center for Global Health and Social Responsibility at the University of Minnesota, Professor and Vice-Chair of Education at the Dept of Family Medicine and Community Health and an Adjunct Professor at the School of Public Health at the University of Minnesota. He is the co-lead of the CDC funded National Resource Center for Refugees, Immigrants and Migrants and the NIH/Fogarty funded Northern Pacific Global Health consortium. He is also a founding member and part of the leadership team of Advocacy for Global Health Partnerships. He is actively involved in the growth of academic primary care and global health research training across various parts of the world as part of Family Medicine Global Education Network (FamMed GEN).</p>\n<p><em>The COVID19 pandemic created unprecedented challenges to the health care systems around the world. Dr. Prasad will review the affect it had on healthcare systems in the US, particularly around healthcare workforce and medical education. He will review the role of primary care/Family Medicine in this and the need to changes in Family Medicine Education in the future.</em></p>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.newmandala.org/forum-strengthening-primary-health-care-in-indonesia/\">Forum on strengthening primary health care in Indonesia: Lessons from COVID-19</a> appeared first on <a rel=\"nofollow\" href=\"https://www.newmandala.org\">New Mandala</a>.</p>\n"
}