{
  "title": "S14 Ep36: Supernatural News/Parashare: Episode 210",
  "link": "https://audioboom.com/posts/8098594",
  "itunes:episode": 36,
  "itunes:title": "Supernatural News/Parashare: Episode 210",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4679,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "SUPERNATURAL NEWS is weird and wild this week on BEYOND the DARKNESS!<br>\nGhosts, Monsters, Supernatural Sex and More!<br>\n<br>\nThe world it seems is busting at its seems in high strangeness this past week. Reality stars admit to paranormal shenanigans, OUIJA has a new home, an indestructible Parrot named Freddy Kruger and more await you in today's journey into the weird.<br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.<br>\n<br>\nDigestive troubles? \tWeight gain?\tLow energy?\tAchy Joints?<br>\nIf you’ve been struggling with any of these, Dr. Steven Gundry says you’re not alone<br>\nAnd he knows the real cause! Watch the free video at <a href=\"http://totalrestore2.com\">totalrestore2.com</a> to find out more!",
  "itunes:summary": "SUPERNATURAL NEWS is weird and wild this week on BEYOND the DARKNESS!\nGhosts, Monsters, Supernatural Sex and More!\n\nThe world it seems is busting at its seems in high strangeness this past week. Reality stars admit to paranormal shenanigans,...",
  "pubDate": "Sat, 04 May 2019 08:00:00 +0000",
  "guid": "b2ec77ad-90a5-4ddc-9db3-5e19149b0b09",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}