{
  "title": "541: What Happened To Queenie in 'Crimes of Grindelwald'?",
  "link": "https://audioboom.com/posts/7992074",
  "itunes:episode": 541,
  "itunes:title": "What Happened To Queenie in 'Crimes of Grindelwald'?",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4745,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode, Harry Potter: Hogwarts Tournament of Houses makes it television premiere! And speaking of trivia, join us for Quizzitch Live: Holiday House Battle on Sunday, December 12 at 10 a.m. ET! In other news, our Fantastic Beasts character discussions continue with Queenie Goldstein. How has her character changed from <em>Fantastics Beasts</em> to <em>Crimes of Grindelwald</em>?</div>\n<br>\n<ul>\n<li>Welcome Slug Club member, Sam!</li>\n<li>We review our magical stats from this year's Spotify Wrapped! Welcome to our new listeners in Cameroon, Mongolia, Brunei, Russia and Kenya!</li>\n<li>Eric and Micah will be doing an <a href=\"http://www.instagram.com/mugglecast\">Instagram Live</a> on Tuesday, December 7 at 7 p.m. ET!</li>\n<li>Harry Potter: Hogwarts Tournament of Houses debuts! We offer our initial thoughts!</li>\n<li>Our Fantastic Beasts Character Discussions return with Queenie Goldstein </li>\n<li>What happened to Queenie between the first and second films? Have we seen a complete devolution of her character? Or is it just bad writing?</li>\n<li>Do Jacob and Queenie have a healthy relationship?</li>\n<li>What do we make of Queenie using a Love Potion on Jacob? Does it give us Merope Gaunt vibes?</li>\n<li>Is Queenie's power of Legilimency a blessing or a curse?</li>\n<li>Why does it always rain during Queenie's major scenes?</li>\n<li>Should we be suspicious of the tea in Grindelwald's flat?</li>\n<li>What does the future look like for Queenie? What will make her leave Grindelwald's side?  Could Queenie already be a double agent and will she become one?</li>\n<li>Who is Quentin Kowalski?</li>\n<li>Quizzitch: What day of the year does Professor McGonagall say she wouldn’t be surprised if it were known as “Harry Potter Day” in the future? <a href=\"https://mugglecast.com/quizzitch/\">Submit your answer</a>! </li>\n<li>This week's episode is brought to you by Quip (visit <a href=\"http://www.quip.com/muggle\">Quip.com/Muggle</a> for your first refill free and up to 40% off bundles for the holiday ) and Thirdlove (get 20% off at <a href=\"http://www.thirdlove.com/mugglecast\">Thirdlove.com/mugglecast</a>)!</li>\n</ul>\n",
  "pubDate": "Tue, 07 Dec 2021 10:00:00 +0000",
  "guid": "tag:audioboom.com,2021-12-06:/posts/7992074",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}