{
  "title": "65: Movements that Boost Brain Performance with Aaron Alexander",
  "pubDate": "Mon, 09 Jul 2018 12:59:16 +0000",
  "guid": "9f8a777fb7224dd5955179b502eaf555",
  "link": "https://sites.libsyn.com/94610/65-movements-that-boost-brain-performance-with-aaron-alexander",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">In today’s episode we’ll be addressing the much-talked-about mind/body connection and exploring how optimizing our body function, posture and movements can affect our minds and improve our brain power.<br /> <br /></span> <span style=\"font-weight: 400;\">An accomplished manual therapist and movement coach, today’s guest</span> <strong>Aaron Alexander</strong> <span style= \"font-weight: 400;\">has over a decade of experience coaching clients from Olympic athletes to Hollywood actors to improve their health and streamline their daily movements. <br /> <br /></span><span style=\"font-weight: 400;\">The way we move has lasting impacts on our health and longevity. Our posture and daily movements affect our thinking, our happiness, and our general health. In today’s world many of us have learnt to separate our bodies and brains and sacrifice our physical health for the sake of convenience — think taking the elevator instead of the stairs, or jumping in the car for a trip of a couple of blocks — and this is resulting in heightened rates of physical illness and depression despite our ever-rising rates of affluence. <br /> <br /></span><span style=\"font-weight: 400;\">In today’s conversation, we talk about the best ways to sit for a healthier body, explain the brain-body connection, and discuss the effect of posture on your mental state. We’ll give you some practical tips to turn your everyday tasks into the body and brain-boosting missions and ideas for best breathing practices. We’ll leave you with some helpful thoughts on how changing the way you move can reduce health risks and some quick tips for boosting your general health! <br /> <br /> *Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access.<br /></span></p>",
  "content:encoded": "<p>In today’s episode we’ll be addressing the much-talked-about mind/body connection and exploring how optimizing our body function, posture and movements can affect our minds and improve our brain power.  An accomplished manual therapist and movement coach, today’s guest Aaron Alexander has over a decade of experience coaching clients from Olympic athletes to Hollywood actors to improve their health and streamline their daily movements.  The way we move has lasting impacts on our health and longevity. Our posture and daily movements affect our thinking, our happiness, and our general health. In today’s world many of us have learnt to separate our bodies and brains and sacrifice our physical health for the sake of convenience — think taking the elevator instead of the stairs, or jumping in the car for a trip of a couple of blocks — and this is resulting in heightened rates of physical illness and depression despite our ever-rising rates of affluence.  In today’s conversation, we talk about the best ways to sit for a healthier body, explain the brain-body connection, and discuss the effect of posture on your mental state. We’ll give you some practical tips to turn your everyday tasks into the body and brain-boosting missions and ideas for best breathing practices. We’ll leave you with some helpful thoughts on how changing the way you move can reduce health risks and some quick tips for boosting your general health!   *Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access.</p>",
  "enclosure": "",
  "itunes:duration": "19:53",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "In today’s episode we’ll be addressing the much-talked-about mind/body connection and exploring how optimizing our body function, posture and movements can affect our minds and improve our brain power.  An accomplished manual therapist and...",
  "itunes:episodeType": "full"
}