{
  "title": "18: We Got to the Bag of Severed Heads! Shadow's Claim and Shadow's Seduction",
  "category": [
    "full-length episode",
    "IAD",
    "read along",
    "the dacians"
  ],
  "dc:creator": "Jennifer Prokop",
  "pubDate": "Wed, 31 Jul 2019 04:00:00 +0000",
  "link": "https://fatedmates.net/episodes/2019/7/20/18-shadows-claim-and-shadows-seduction",
  "guid": "5bc7409ec46f6d369ce5f644:5bcf6773419202388fdccb10:5d331906fabc590001848c47",
  "description": "<p class=\"\">Don’t forget to subscribe to the podcast in your favorite podcasting platform — and while you’re there, please leave us a like or a review.</p><p class=\"\">We’re getting down to the wire with Season One of Fated Mates — in two weeks, join us for <a href=\"https://amzn.to/2ynTc6S\" target=\"_blank\"><em>Wicked Abyss</em></a>, featuring the literal King of Hell, and the Queen who takes fully no shit from him. Get <em>Wicked Abyss</em> at <a href=\"https://amzn.to/2ynTc6S\" target=\"_blank\">Amazon</a>, <a href=\"https://www2.barnesandnoble.com/w/wicked-abyss-kresley-cole/1124115501?type=eBook\" target=\"_blank\">Barnes & Noble</a>, <a href=\"https://books.apple.com/us/book/wicked-abyss/id1135492505?mt=11&app=itunes&at=1l3vpAR\" target=\"_blank\">Apple Books</a>, <a href=\"https://www.kobo.com/us/en/ebook/wicked-abyss-1\" target=\"_blank\">Kobo</a>, or <a href=\"https://www.indiebound.org/book/9781501120381\" target=\"_blank\">at your local indie</a>!</p><p class=\"\"><strong>Show Notes</strong></p><p class=\"\">- You know Kresley is self-publishing when you see it's <a href=\"https://en.wikipedia.org/wiki/Kresley_Cole\">Valkerie Press</a>.</p><p class=\"\">In IAD, a <a href=\"https://immortalsafterdarkiad.fandom.com/wiki/Queens\">sorceri queen</a> has the most power in that area.</p><p class=\"\">- <a href=\"https://bookriot.com/2016/02/14/love-love-triangle-best-series-include-love-triangle-subplot/\">Love triangles</a> are <a href=\"https://bookriot.com/2016/02/14/love-love-triangle-best-series-include-love-triangle-subplot/\">very common in YA</a>.</p><p class=\"\">- Eloisa James' first novel was <a href=\"https://amzn.to/2LDM4Mm\">Potent Pleasures</a>, the the line Sarah quoted is: \"Charlotte was one week short of 17 when her life was changed, falling into two halves like a shiny child's ball: before and after.\"</p><p class=\"\">- <a href=\"https://www.netflix.com/title/81013626\">The best thing that ever happened at Coachella</a>.</p><p class=\"\">- Uh. While researching for this podcast, Jen realized that <a href=\"https://www.billboard.com/articles/news/dance/6598414/deadmau5-cease-desist-deadmouse-the-musical\">Deadmou5</a> is real.</p><p class=\"\">- Sarah's hero/heroine/heroine's best friend on the line book is <a href=\"https://amzn.to/2ykSEi3\"><em>A Rogue By Any Other Name</em></a>, which you can get in ebook for $1.99 right now!</p><p class=\"\">- There apparently was a crossover between IAD and Gena Showalter's <a href=\"https://www.goodreads.com/series/46385-lords-of-the-underworld\">Lords of the Underworld series</a>. Tell us what you know.</p><p class=\"\">- Gay romance author and all around good guy <a href=\"https://twitter.com/NathanBurgoine\">Nathan Burgoine</a> explains <a href=\"https://apostrophen.wordpress.com/2016/03/20/for-you/\">why \"Gay for You\" is a problem</a>.</p><p class=\"\">- No one like a <a href=\"https://www.merriam-webster.com/dictionary/milksop\">milksop</a>.</p><p class=\"\">- All about <a href=\"https://en.wikipedia.org/wiki/Kinsey_scale\">the Kinsey Scale</a>, and Jen thinks of <a href=\"https://twitter.com/itsonlyzach/status/583251090621231104?s=20\">this very funny tweet from her friend Zach</a> every time she hears the phrase \"Kinsey scale.\"</p><p class=\"\">- Happy Days didn't <a href=\"https://www.usatoday.com/story/life/tv/2019/01/08/tv-spinoffs-10-best-and-five-worst-all-time-fosters-goldbergs-joey-colbert-report-good-fight/2472040002/\">spin off</a> from something, <a href=\"https://en.wikipedia.org/wiki/Happy_Days#Spin-offs\">it was the spinner</a>. <a href=\"https://en.wikipedia.org/wiki/Frasier\">Frasier</a> was a Cheers spin-off. The Dacians is not an IAD spin-off. It is IAD. This is canon now.</p><p class=\"\">- <a href=\"https://www.goodreads.com/series/73713-the-arcana-chronicles\">The Arcana Chronicles</a> is Kresley's YA series.</p><p class=\"\">- Jen recommends <a href=\"https://amzn.to/2SyDvDn\">The Animators</a> by Kayla Rae Whitaker if you're interested in a novel about women artists at work.</p><p class=\"\">- In two weeks, we're finishing Season One (sniff!) with <a href=\"https://amzn.to/2ynTc6S\">Wicked Abyss</a>!</p><p class=\"\"><strong>Lost Limb Count</strong></p><p class=\"\"><strong>Arms and Hands (8)</strong></p><p class=\"\"><em>1. Conrad</em> cuts off his own hand with a rusty axe so he escape the \"witched\" chains his brothers locked him in. (<em>Dark Needs at Night's Edge</em>)</p><p class=\"\"><em>2. Cadeon</em> has both of his hands burned off in the same scene where he loses an eye. There's description of what Cade's baby fingers look like as they are re-growing. It's...kinda gross. (<em>Dark Desires After Dusk</em>)</p><p class=\"\"><em>3. Sebastian</em> pulverizes most of his right arm during the Hie. He regenerates. (<em>No Rest For the Wicked</em>)</p><p class=\"\"><em>4. Lucia</em> peels all the skin off from her hand in order to free herself from some handcuffs. (<em>Pleasure of a Dark Prince</em>)</p><p class=\"\">5. In order to retrieve the ring from <em>La Dorada</em> , Lothaire cuts off her finger. (<em>Pleasure of a Dark Prince</em>)</p><p class=\"\"><em>6. Lanthe</em> and <em>Carrow</em> cut off Fegley's hand so they can use his thumb to unlock their torques. He's later killed. (<em>Demon from the Dark</em>)</p><p class=\"\">7. After receiving Lothaire's heart in a box, <em>Ellie</em> cuts off her middle finger and sends it to him. (Lothaire)</p><p class=\"\"><em>8. Chloe</em>'s shoulder is dislocated in the escape from her auction (MacRieve).</p><p class=\"\"><strong>Chest and Torso (7)</strong></p><p class=\"\">1. Omort severs <em>Rydstrom's</em> spine and punches through his torso in a fight. Sabine saves him and enlists Hag to help heal him. (<em>Kiss of a Demon King</em>)</p><p class=\"\"><em>2. Lucia</em>'s neck is broken. She regenerates. (<em>Pleasure of a Dark Prince</em>)</p><p class=\"\">3. On Torture Island, <em>Regin</em>,</p><p class=\"\"><em>4. MacRieve</em>,</p><p class=\"\">5. and <em>Brandr</em> are vivisected. It's pretty terrible. (<em>Dreams of a Dark Warrior</em>)</p><p class=\"\"><em>6. Declan</em>'s skin is peeled off by the Neoptera as a child. (<em>Dreams of a Dark Warrior</em>)</p><p class=\"\">7. Lothaire rips out his own heart and sends it to Ellie in a box. (<em>Lothaire</em>)</p><p class=\"\"><strong>Head, Face, and Eyes (6)</strong></p><p class=\"\"><em>1. Bowen</em> loses an eye and most of his forehead during the Hie. Mariketa has cursed him and he can't heal until he returns to her. (<em>Wicked Deeds on a Winter's Night</em>)</p><p class=\"\"><em>2. Cadeon</em> loses an eye and part of his forehead and hair when fighting. It all regenerates. (<em>Dark Desires After Dusk</em>)</p><p class=\"\">3. During a rugby match, <em>Garreth</em> has his teeth knocked out and swallows them. (<em>Pleasure of a Dark Prince</em>)</p><p class=\"\"><em>4. Lothaire</em> kicks out La Dorada's remaining eye and throws her over a cliff. (<em>Dreams of a Dark Warrior</em>)</p><p class=\"\">5. In the Bloodroot Forest, the tree grows over <em>Lothaire</em>'s lips and tongue. (<em>Lothaire</em>)</p><p class=\"\">6. After she gains her immortality, <em>Chloe</em>'s hair grows, but she cuts it off every morning. (MacRieve)</p><p class=\"\"><em>7. Lanthe</em> agrees to have her tongue cut out to save herself and Thronos, knowing she can still use the power of persuasion telepathically. (<em>Dark Skye</em>)</p><p class=\"\"><strong>Horns (2)</strong></p><p class=\"\"><em>8. Cadeon</em> cuts off his own horns to prove to Holly that he is worthy of being her mate. She tells him to let them grow back (<em>Dark Desires After Dusk</em>)</p><p class=\"\"><em>9. Malkolm</em> is captured by his enemies in Oblivion and taken to the city of Ash. The publicly cut off his horns and then intend to kill him, but Carrow saves him. (Demon from the Dark)</p><p class=\"\"><strong>Legs and Feet (3)</strong></p><p class=\"\"><em>1. Lachlain</em> tears off his own leg to reach Emma. He regenerates. (<em>A Hunger Like No Other</em>)</p><p class=\"\"><em>2. Mariketa</em>'s skull is fractured and her leg is torn from her body. She heals herself after Bowen lays on the ground. Ivy grows over her and heals her. (<em>Wicked Deeds on a Winter's Night</em>)</p><p class=\"\"><em>3. Thronos</em> is chasing Melananthe and loses a foot when a portal closes on it. (<em>Kiss of a Demon King</em>)</p><p class=\"\">4. While in Pandamonia, <em>Thronos</em> is trapped in a Groundhog Day like trap, doomed to repeat his worst nightmare over and over again. When he believes that Lanthe is about to die, he repeatedly tears of his legs in order to reach her. He never actually loses a limb, but he was willing, so we're counting it. (<em>Dark Skye</em>)</p><p class=\"\"><strong>Beheading as a Romantic Gesture (4)</strong></p><p class=\"\">1. The first time Garreth spies <em>Lucia</em>, it's when she shoots an arrow and beheads a kobold. He notices that it's \"a fantastical shot\" and he's super into it. Later, he helps her pick up the head because he's a real gentleman like that. (<em>Pleasure of a Dark Prince</em>)</p><p class=\"\">2. Later in the book, they are under attack from vampires and Lucia asks him to help. <em>Garreth</em> promises to \"give her their throats\" and beheads two vampires. But she's upset about it because of a previous bad experience with cannibalism. (<em>Pleasure of a Dark Prince</em>)</p><p class=\"\"><em>3. Malkolm</em> beheads men that attacked Carrow in Oblvion, and he throws them to prove he's a worthy mate. (<em>Demon from the Dark</em>)</p><p class=\"\"><em>4. Declan</em> fights and beheads several creatures as they escape Torture Island, including squeezing one dude so hard his eyes pop out and then he twists his head off. (<em>Dreams of a Dark Warrior</em>)</p><p class=\"\">5. Thronos beheads several foes during fights, which impresses <em>Lanthe</em>; but he also beheads Felix, a sorcerer who once tricked Lanthe and stole her sorcery. (<em>Dark Skye</em>)</p><p class=\"\">6. The bag of heads, yo. This is the pinnicle of this category, obviously. (<em>Shadow's Claim</em>)</p><p class=\"\"><strong>Beheading as a Non-Romantic Gesture</strong></p><p class=\"\">1. Ellie cuts off <em>Lothaire</em>'s head, leaving a slender 1/8 of an inch left. It was kind of an accident, but he deserved it. (Lothaire)</p><p class=\"\"><strong>Maybe?</strong></p><p class=\"\">1. Does Garreth's losing his connection with his mortal soul count? (<em>Pleasure of a Dark Prince</em>)</p><p class=\"\">2. When Soroya inhabited <em>Ellie</em>'s body, she subjected her to a full Brazilian wax. Ellie doesn't realize it's happened until she takes control of her body again. (<em>Lothaire</em>)</p>",
  "itunes:author": "Fated Mates",
  "itunes:subtitle": "We’re taking a turn into the world of the Dacians, and Jen and Sarah are having STRIFE because, as usual, Jen is wrong.",
  "itunes:summary": "We’re taking a turn into the world of the Dacians, and Jen and Sarah are having STRIFE because, as usual, Jen is wrong. We’re combining Shadow’s Claim and Shadow’s Seduction — talking about what it means to be a Kresley heroine, why writers tackle spin off series, the challenges of straight writers writing queer stories, and why we would appreciate receiving the heads of our enemies as tributes.",
  "itunes:explicit": "yes",
  "itunes:duration": "01:10:22",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 37,
  "itunes:title": "18: We Got to the Bag of Severed Heads! Shadow's Claim and Shadow's Seduction",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "18: We Got to the Bag of Severed Heads! Shadow's Claim and Shadow's Seduction"
  }
}