{
  "title": "Anja Kanngieser: Listening to the Anthropocene - Sound and ecological crisis (Histories and Theories of Sound)",
  "itunes:author": "Liquid Architecture",
  "itunes:subtitle": "Histories and Theories of Sound",
  "itunes:summary": "Listening to the Anthropocene: Sound and ecological crisis explores imaginations of the natural world at a time of accelerating global environmental crisis; in an era currently being defined as the Anthropocene. Mapping out a range of eco-acoustic practices from field recordings to data and geo-sonifications, Anja Kanngieser investigates how such practices seek to delineate, highlight, and/ or overcome, distinctions between natural and social, urban and rural, exceptional and everyday.\n\nhttps://liquidarchitecture.org.au/events/listeningtotheanthropocene\nAnja Kanngieser: Listening to the Anthropocene: Sound and ecological crisis (Theories and Histories of Sound)\n\nHistories and Theories of Sound\n14 December, 2015\nGertrude Contemporary, Fitzroy\nPresented by Liquid Architecture, Discipline and Gertrude Contemporary.\n\nAudio: Mara Schwerdtfeger\n\nFinancial support from patrons at any level has a resounding impact on our work. You can support Liquid Architecture’s weekly podcast and our online journal Disclaimer, for new thinking and writing on listening and sound through a Patreon subscription, for as little as $5 a month. \n\nhttps://www.patreon.com/liquidarchitecture\n\nFor the past 20 years, Liquid Architecture has been Australia’s leading organisation for artists working with sound and listening. LA investigates the sounds themselves, but also the ideas communicated about, and the meaning of, sound and listening.",
  "itunes:image": "",
  "enclosure": "",
  "guid": "https://liquidarchitecture.org.au/podcast/anja-kanngieser-listening-to-the-anthropocene-sound-and-ecological-crisis-theories-and-histories-of-sound",
  "pubDate": "Thu, 07 May 2020 08:00:00 +1000",
  "itunes:duration": "29:07",
  "itunes:explicit": "no"
}