{
  "id": "tag:blogger.com,1999:blog-1747027701196237068.post-336041252546765862",
  "published": "2022-01-25T08:00:00.001-05:00",
  "updated": "2022-01-25T08:00:00.154-05:00",
  "title": "Applications are now open for the second Google Cloud Accelerator Canada Cohort",
  "content": "<i>We’re inviting Canadian cloud-native technology startups to apply for the second Google Cloud Accelerator Canada cohort. The intensive 10-week virtual bootcamp helps startups prepare for the next phase of growth and development in their journey.&nbsp;</i><div><br /></div><div>Throughout the pandemic, we’ve seen just how important the role of cloud technology is in almost every sector. From healthcare to education, retail to manufacturing, cloud technology keeps us connected, and helps us maintain continuity in our schools, work and businesses.&nbsp;<div><br /></div><div>We know the need for cloud-based solutions will continue to grow, that’s why we launched the first <a href=\"http://g.co/cloud/acceleratorcanada\" rel=\"nofollow\" target=\"_blank\">Google Cloud Accelerator Canada</a> last year, entirely dedicated to supporting cloud-native technology startups. The accelerator was the first of it’s kind at Google, designed to bring the best of our programs, products, people and technology to startups doing interesting work in cloud.&nbsp;<div><br /></div><div>“We are thrilled to be at the start of our second journey in meeting and building meaningful relationships with this new Google Canada Accelerator Cloud cohort,” said James Lambe, Managing Director of Google Cloud Canada.&nbsp;</div><div><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/a/AVvXsEj-fGQwZ8OfYEb47cdp4TdppAp-7vQxxMPj8YTfFP4N62aag5FNTn9eff1LyYLLuBAaVQWOVq3pJ6abUNCenpkfX5CNwpSYyQgzXyu2K9C9pXadGHFIfujqpyus8lqUY2Qd-ZFuGptfLhj6v7HRkcEE06W455t8tgwgY4rvxfr6t3iNy1BxxmBz5hhZ=s512\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"288\" data-original-width=\"512\" height=\"360\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEj-fGQwZ8OfYEb47cdp4TdppAp-7vQxxMPj8YTfFP4N62aag5FNTn9eff1LyYLLuBAaVQWOVq3pJ6abUNCenpkfX5CNwpSYyQgzXyu2K9C9pXadGHFIfujqpyus8lqUY2Qd-ZFuGptfLhj6v7HRkcEE06W455t8tgwgY4rvxfr6t3iNy1BxxmBz5hhZ=w640-h360\" width=\"640\" /></a></div><br /><div><br /><div><br /></div><div>Last year, twelve startups were selected for our <a href=\"https://canada.googleblog.com/2021/06/meet-inaugural-google-cloud-accelerator.html\" rel=\"nofollow\" target=\"_blank\">inaugural cohort,</a> representing a range of industries including healthcare, hospitality and real estate. We worked with founders and their teams to help solve some of the top challenges facing their startup and provided 1:1 mentorship from an array of Google Cloud experts. We also offered support in AI/ML, design/UX, Android, web, product strategy, sales, marketing, and more.&nbsp;<div><br /></div><div>Today, we’re excited to announce that applications are now open for the second <a href=\"http://g.co/cloud/acceleratorcanada\" rel=\"nofollow\" target=\"_blank\">Google Cloud Accelerator Canada</a>. The 10-week virtual accelerator will offer cloud mentorship and technical project support, as well as deep dives and workshops on product design, customer acquisition and leadership development for cloud startup founders and leaders.&nbsp;<div><br /></div><div>The Accelerator is best suited for funded, revenue generating startups who have a minimum of five employees and are well-positioned for their next phase of growth. In order to ensure Google can provide meaningful value, startups should aim to leverage either Cloud or AI/ML technologies in their product, service, or operations, or show an interest in leveraging these technologies in the future.&nbsp;<div><br /></div><div>Applications are now open until March 1, 2022 and the accelerator will kick off this April. Interested startups leveraging cloud to drive growth and innovation are encouraged to apply <a href=\"http://g.co/cloud/acceleratorcanada\" rel=\"nofollow\" target=\"_blank\">here</a>.&nbsp;</div><div><br /></div><div><span class=\"post-author\">Posted by Ashley Francisco Head of Startup Developer Ecosystem, Google Canada</span></div></div></div></div></div></div></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Aaron Brindle",
    "uri": "http://www.blogger.com/profile/13885417405401273013",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}