{
  "title": "Do We Owe This Boyfriend an Apology?",
  "link": "https://freakonomics.com/2015/06/do-we-owe-this-boyfriend-an-apology/",
  "dc:creator": "Stephen J. Dubner",
  "pubDate": "Tue, 09 Jun 2015 17:00:53 +0000",
  "category": [
    "Freakonomics Blog",
    "Dating",
    "Yu Chen"
  ],
  "guid": "http://freakonomics.com/?p=110275",
  "description": "<p>We recently received the following e-mail from Yu Chen, a 29-year-old engineer supervisor in California who moved to the U.S. from China when she was 16. I listened to the episode on diamonds and asked my boyfriend for a gold bar for engagement instead. Then I heard the episode on quitting, so I broke up with him. I&#8217;ve been very . . .</p>\n<p>The post <a rel=\"nofollow\" href=\"https://freakonomics.com/2015/06/do-we-owe-this-boyfriend-an-apology/\">Do We Owe This Boyfriend an Apology?</a> appeared first on <a rel=\"nofollow\" href=\"https://freakonomics.com\">Freakonomics</a>.</p>\n",
  "content:encoded": "<p>We recently received the following e-mail from <strong>Yu Chen</strong>, a 29-year-old engineer supervisor in California who moved to the U.S. from China when she was 16.</p>\n<blockquote><p>I listened to the <a href=\"https://freakonomics.com/2015/04/16/diamonds-are-a-marriage-counselors-best-friend-a-new-freakonomics-radio-podcast/\">episode on diamonds</a> and asked my boyfriend for a gold bar for engagement instead. Then I heard the <a href=\"https://freakonomics.com/2011/09/30/new-freakonomics-radio-podcast-the-upside-of-quitting/\">episode on quitting</a>, so I broke up with him. I&#8217;ve been very happy ever since! Thank you for the awesome podcasts!</p></blockquote>\n<p>Nice to see that we are getting results!</p>\n<p>I followed up with Yu by e-mail and this is what she had to say:</p>\n<blockquote><p>Recently my family has been pressuring me to find someone. So I try to apply what I know to dating. I was ecstatic when I heard the <a href=\"https://freakonomics.com/2014/02/06/what-you-dont-know-about-online-dating-a-new-freakonomics-radio-podcast/\">episode on online dating</a>. I used match.com to meet my two previous boyfriends. I used a screening system where &#8220;candidates&#8221; must be able to produce meaningful conversations with me via email for two weeks prior to the &#8220;interview.&#8221; Then I staked the interviews. I met as much as three candidates a week. I realize it&#8217;s a two-way choice. We make our selections within the first three dates. This allowed me to meet the most qualifying candidates in a short amount of time.</p>\n<p>I thank Freakonomics and TED Talks for my recent break up. Freakonomics told me that I would be less likely to regret if I were to quit. TED Talks said I should reject everyone within the first 37% of my dating window and marry the next best thing. So I shall reject everyone I meet before 28.7. I&#8217;m on the right track.</p></blockquote>\n<p>The post <a rel=\"nofollow\" href=\"https://freakonomics.com/2015/06/do-we-owe-this-boyfriend-an-apology/\">Do We Owe This Boyfriend an Apology?</a> appeared first on <a rel=\"nofollow\" href=\"https://freakonomics.com\">Freakonomics</a>.</p>\n"
}