{
  "title": "Sales is about listening",
  "link": "",
  "updated": "2019-12-05T00:00:00+00:00",
  "id": "https://mrocklin.github.io/blog/work/2019/12/05/engineers-and-sales",
  "content": "<ul>\n  <li><strong>Engineer:</strong> <em>Hey Boss, what should I know to more effectively sell our product?</em></li>\n  <li><strong>Boss:</strong> <em>Resist the urge to answer technical questions</em></li>\n</ul>\n\n<p>I had this brief conversation years ago at an industry conference.\nThis advice has proven invaluable over the years in many contexts\n(including beyond corporate sales)\nand I’ve re-shared it countless times,\nso I thought I’d write it up.</p>\n\n<h2 id=\"sales-is-about-listening\">Sales is About Listening</h2>\n\n<p>My then boss (Peter Wang) expanded on his main point</p>\n\n<p><em>Resist the urge to answer technical questions</em></p>\n\n<p>To go on to say that as engineers,\nwe always want to show off how something works.\nThis is either out of a need to show that we are knowledgable,\nor just because we like to geek out.</p>\n\n<p>But we often go too deeply too quickly into a solution\nbefore we fully understand the potential customers’ problem.\nThis is almost always a waste of everyone’s time.</p>\n\n<p>So when a customer asks a technical question,\nit’s often better to follow up with a question to better understand their situation.\nHere is a small example interaction</p>\n\n<h3 id=\"bad--engineer-talks-first\">Bad.  Engineer talks first</h3>\n\n<ul>\n  <li><strong>Customer:</strong> Is your database product fast?</li>\n  <li><strong>Bad Engineer:</strong> Yes!  Our combination of advanced algorithms and cluster\ncomputing let us scale to very large datasets.\nLet me tell you about our GPU accelerated join algorithms.</li>\n  <li><em>Bad Engineer continues on for a while until customer excuses himself awkwardly</em></li>\n</ul>\n\n<h3 id=\"good--engineer-listens-first\">Good.  Engineer listens first</h3>\n\n<ul>\n  <li><strong>Customer:</strong> Is your database product fast?</li>\n  <li><strong>Good Engineer:</strong> Yes, in many ways, but I’m curious, why do you care\nabout speed?  I see that you work at an insurance company.  Is this for\nanalytics?</li>\n  <li><strong>Customer:</strong> No actually.  While we do do lots of analytics, our main need\nright now is to host queries for our website.</li>\n  <li><strong>Good Engineer:</strong> Ah, so you’re looking for something like a key-value\ndatabase with query times under, say, 20ms?</li>\n  <li><strong>Customer:</strong> Oh yes, anything under 50ms would be fine really.</li>\n  <li><strong>Good Engineer:</strong> OK great.  Yes, we can definitely help you with that.  I\nnormally talk about our GPU accelerated analytics database, but that’s\nactually not a good fit for your use case.  Instead, let me show you our\ntransactionial database product.  I’m less familiar here, but I’m confident\nthat your use case fits right in here.</li>\n</ul>\n\n<p>Selling is much less about telling people what your product solves,\nand is much more about listening to what problems other people have.\nBy listening you learn a lot about their situation.\nThis gives you a lot of insight into what they care about,\nand helps you to match them to solutions more effectively.</p>\n\n<h2 id=\"pain-points\">Pain Points</h2>\n\n<p>Our goal is to discover a customers’ pain point,\nand then translate it into technical terms.</p>\n\n<p>For example their pain point might be that they’ve been tasked with\nmaking the website faster because customers were dropping off due to long wait\ntimes.</p>\n\n<p>They’ve tried to translate this pain point into a set of technical features\n(fast database)\nfor which they are now on the lookout.\nBut they’re usually pretty bad at this, and so we need to learn a lot more\nabout them before we know how to help.\nFor example maybe they don’t need to invest in a new database product,\nbut instead they just need a progress bar, or better CSS on their webpage.</p>\n\n<p>If you can discover their pain point then\nyou’re much better equipped to solve their problem effectively.\nIf you identify a good product fit at this stage then selling is easy.\nIf you don’t then you’ve avoided a long and fruitless sales process.</p>\n\n<h2 id=\"summary\">Summary</h2>\n\n<p>Selling (or helping people generally) has much more to with learning about them\nand having empathy than it does with talking about what yourself or your\nproduct.</p>"
}