{
  "title": "The Computers Who Brought ENIAC to Life",
  "link": "https://spectrum.ieee.org/eniac-woman-programmers",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/black-and-white-image-of-three-women-each-in-front-of-a-large-wheeled-cabinet-faced-with-countless-rotary-switches.jpg?id=29705856&width=1245&height=700&coordinates=0%2C298%2C0%2C0\"/><br/><br/><p>The Electronic Numerical Integrator and Computer—better known as <a data-linked-post=\"2650274151\" href=\"https://spectrum.ieee.org/great-computers-never-die\" target=\"_blank\">ENIAC</a>—became the world’s first programmable general-purpose electronic computer when it was completed in 1945. ENIAC’s hardware was designed by John Mauchly and J. Presper Eckert, but the programs it ran were largely the creation of <a href=\"https://penntoday.upenn.edu/news/eniacs-anniversary-nod-its-female-computers\" target=\"_blank\">a team of six women</a>. For decades, <a href=\"https://spectrum.ieee.org/untold-history-of-ai-invisible-woman-programmed-americas-first-electronic-computer\" target=\"_blank\">these women were largely unknown</a>, except only as unidentified figures in photographs of ENIAC. But as an undergraduate, <a href=\"https://www.linkedin.com/in/kathy-kleiman-09832b1/\" target=\"_blank\">Kathy Kleiman</a>—who would later help found <a href=\"https://www.icann.org/\" target=\"_blank\">ICANN</a> (Internet Corporation for Assigned Names and Numbers)—started looking into who they were. This weekend at the <a href=\"https://vcfed.org/events/vintage-computer-festival-east/\" target=\"_blank\">Vintage Computer Festival East</a> in Wall, N.J., Kleiman will be screening her short documentary <a href=\"https://eniacprogrammers.org/documentary-info/\" target=\"_blank\"><em>The Computers</em></a>, about the programmers. In advance of her talk, <em>IEEE Spectrum</em> spoke to Kleiman about the ENIAC women and her fascination with them.</p><p><strong>How did these women come to be such a central part of the history of computing?</strong></p><p><strong>Kathy Kleiman:</strong> During World War II, the army needed people to hand-calculate ballistics trajectories or artillery firing tables. And male mathematicians were running short. The Army relocated the project from rural Maryland to Philadelphia and went looking for women math majors in Philadelphia, which has a very high density of schools with coed universities and colleges and all-women schools. </p><p>Later they would go across the country looking for women math majors to come to the Morse School of Electrical Engineering, which is where they located this project and where they hand-calculated ballistic trajectories using mechanical desktop calculators. But it took 30 to 40 hours to calculate a single trajectory for one set of weather conditions for one gun and one projectile, and the Army needed hundreds of trajectories per firing table. </p><p>So in the dark days of the war, early 1943, when there was no end to the war in sight, they agreed to fund the experiment of a visionary guy who also happened to be at the Moore School at that time. His name was Dr. John Mauchly. He partnered with Presper Eckert, who was 23 years old at the time, a young engineering grad. They were yin and yang, a great combination. With Army funding, they built this machine that wasn’t supposed to work—18,000 vacuum tubes were never supposed to be able to work in concert. But they did it, a machine 8 feet tall and 80 feet long. </p><p>But when they’re almost done, they’re like, “Wait a second.” Part of the Army contract was delivering a working ballistic trajectory calculated by the machine. So a mathematician and Army lieutenant at the proving ground called Herman Goldstein picks six out of the 80 to 100 women who’ve been calculating trajectories. They [Kathleen Antonelli, Jean Bartik, Betty Holberton, Marlyn Meltzer, Frances Spence, and Ruth Teitelbaum] are given the wiring diagrams and the block diagrams and told to figure it out so they can do the ballistics trajectory equation. </p><p>The women don’t have security access to even see the actual computer, but they figure it out, doing what is now called <a href=\"https://studylib.net/doc/8742623/programming-the-eniac-before-its-rewiring.\" target=\"_blank\">direct programming</a>. There’s looping, there’s conditional logic, and the women collectively mastered all this and made it perform the ballistic trajectory calculation that wound up becoming the climactic moment of demonstration day on 6 February 1946, when ENIAC was unveiled. </p><p><strong>Why did you start looking into their story?</strong></p><p><strong>Kleiman: </strong>I was at Harvard. I was kind of a social theory major. I took computer science from the first classes that I took in college because I was already a programmer because of a Western Electric program when I was in high school. I also noticed that as the levels of the computer science classes went higher, the number of women dropped. And I knew about Ada Lovelace. I knew about Grace Hopper. Ada Lovelace was in the 19th century, then Grace Hopper in the 20th century. And one woman succeeding in computing per century didn’t make me feel warm and fuzzy, so I went looking for more. </p><p>I found the pictures of ENIAC taken before demonstration day and given to the press and published across the country.  These pictures are beautiful black-and-white pictures, and they have men and women in them; some of them just have women! But while some of the men, particularly Eckert and Mauchly, are named in the captions, none of the names of the women are in the captions. I wanted to know who they were. I was told by some computer historians at the time that they were models, and they didn’t look like models to me. I tracked them down, and they weren’t models; they were programmers.</p><p><strong>You’ll be showing your documentary at <a href=\"https://vcfed.org/events/vintage-computer-festival-east/\" target=\"_blank\">VCF East</a>, which features interviews with four of the programmers conducted before they passed away, but you’ll also be <a href=\"https://www.grandcentralpublishing.com/titles/kathy-kleiman/proving-ground/9781549185458/\" target=\"_blank\">releasing a book later this year</a>, called<em> Proving Ground</em>?</strong></p><p><strong>Kleiman:</strong> The documentary raised as many questions as it answered. So I was kind of persuaded to tell the rest of the story, and really sit down and talk about the incredible work, not just of the ENIAC programmers but of millions of women on the home front during World War II. It turned out that is not a story we know very well. I had always known women went to the factories, they went to the farms. I didn’t realize until I sat down in front of newspapers of the period and saw the ads that there was an enormous push for women with science and technology backgrounds. If you had the interest, the aptitude, and some training, these articles made it clear they’d teach you the rest, not just for the military but for industry. That was just a whole part of the story I’d never heard, that women also filled in these gaps in science, technology, and engineering.</p>",
  "pubDate": "Thu, 21 Apr 2022 16:51:16 +0000",
  "guid": "https://spectrum.ieee.org/eniac-woman-programmers",
  "category": [
    "Eniac",
    "Women who code",
    "Documentaries"
  ],
  "dc:creator": "Stephen Cass",
  "media:content": ""
}