{
  "id": "https://bibleinoneyear.org/en/youth/338",
  "title": "Day 338: Four Keys to Overcoming Fear",
  "description": "Psalm 138:2a,3,7a,8a, Daniel 11:32b-33a, 1 John 4:7–21.  But perfect love drives out fear’ (v 18)",
  "pubDate": "Sat, 04 Dec 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/338/?ignore",
  "itunes:duration": "14:30",
  "guid": "enyouth04122021-338",
  "length": 870.5,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 338: Four Keys to Overcoming Fear",
  "itunes:subtitle": "Psalm 138:2a,3,7a,8a, Daniel 11:32b-33a, 1 John 4:7–21.  But perfect love drives out fear’ (v 18)",
  "itunes:summary": "Alex Buchanan was well known as a ‘pastor to the pastors’. He was profoundly deaf in one ear, with only 5% hearing in the other, and one side of his face was paralysed after he suffered nerve damage during major surgery. I remember hearing him speak about God’s love and he kept repeating the words, ‘God loves you unconditionally, wholeheartedly and continually.’\nWhen he finished his talk he came up to me and said, ‘Do you believe that God approves of you?’ I said, ‘Actually, I really struggle with that because I know things about myself that mean I find it difficult to believe that God approves of me.’ He replied, ‘We all struggle with that. But God wants you to know that he approves of you. He wants you to know he loves you unconditionally, wholeheartedly and continually.’\nIf I were asked to summarise what I thought the Bible was all about in one word – apart from the word ‘Jesus’ – I would choose the word ‘love’. Twice in today&#039;s New Testament passage John writes, ‘God is love’ (1 John 4:8,16). The word ‘love’ is used widely in our society. Nowhere in the Bible does it say, ‘Love is God’. In other words, it is God who defines what love is rather than the other way around. God is love.\nThis is the message you need to understand yourself, meditate on constantly and speak about to the world: ‘God is love’.\nHere is the answer to the greatest longing of the world today. People are looking for love. Their hearts are searching. When you really know God’s love for you, your life is transformed. As we will see in the New Testament passage for today, God’s love is at the heart of each of the four keys to overcoming unhealthy fear in your life: ‘There is no fear in love. But perfect love drives out fear’ (v.18).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 338
}