{
  "title": "ZBT #300: 300TH EPISODE EXTRAVAGANZA!!!!!",
  "description": "<p>Well folks, we made it to episode 300 and we are celebrating!\n\nVisit our sponsors:\n-RockyBoots.com and use promo code \"ZBT\" to get 25% off boots so comfortable you can sleep in them.\n-InVets.org/Zero. Make a profile, get a free t-shirt, and also get some transition help for getting out of the military.\n\nRound 1: We’ve made it 300 episodes. We’re gonna take a small look back on where we started, where we are at, and where we intend to go. We wont suck our own dicks too much!\n\nRound 2: Even though we’ve done 300 episodes, there’s some things we were supposed to do but never did. Interesting enough, and not just for the purpose of a transition, we found a tweet thread from Military folks who talked about training they were supposed to complete but they skated out of it like longtime stoolie Michelle Kwan. \n\nRound 3: For the first time in Zero Blog Thirty history, we are gonna head over to Slovenia to check out some news that would make even the most senior of Lance Corporals happy. Melania Trump’s statue was burned in her home town. We got something for that. \n\nRound 4: The oldest Marine Corps veteran celebrates their birthday this week. Guess how old they are?\n\nRound 5: Danny Trejo joins the show which might not make sense but it totally makes sense. He’s feeding tons of unhomed veterans and he’s basically like every GySgt I’ve ever had. Looks rough and tough but is a big ole teddy bear despite the tattoos and reputation that proceeds him. \n\nRound 6: Over the last 300 episodes, we’ve changed since the beginning. We arent the only ones though. The Army has changed too or is changing, rather. Kinder Gentler! Kinder Gentler!!!</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/ZeroBlog30\">barstool.link/ZeroBlog30</a></p>",
  "guid": "efa6f5b4-d716-4493-bdad-c63956ab5df5",
  "pubDate": "Tue, 22 Sep 2020 07:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/zero-blog-thirty",
  "itunes:explicit": "yes",
  "itunes:duration": "01:40:21",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}