{
  "id": "https://bibleinoneyear.org/en/youth/365",
  "title": "Day 365: How to Begin and End",
  "description": "Psalm 150:1,6, Nehemiah 13:22b, Revelation 22:1–5,12–13,17,20–21.  Of course, ‘the End’ and ‘the Beginning’ appear very different  However, there can be significant similarities to both the beginning and the end",
  "pubDate": "Fri, 31 Dec 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/365/?ignore",
  "itunes:duration": "14:15",
  "guid": "enyouth31122021-365",
  "length": 855.69,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 365: How to Begin and End",
  "itunes:subtitle": "Psalm 150:1,6, Nehemiah 13:22b, Revelation 22:1–5,12–13,17,20–21.  Of course, ‘the End’ and ‘the Beginning’ appear very different  However, there can be significant similarities to both the beginning and the end",
  "itunes:summary": "One young woman asked me the following questions: ‘What will it be like in heaven? What will our heavenly bodies look like? Will we be able to fly? Will we be sexless? Will we be able to see the Garden of Eden? Will we recognise family and friends? What sort of friendships will we have? What will we do? Will there be Bible studies and Alpha? Who is the congregation?’\nThe Bible does not give the answers to all our questions.\nI have a book on my bookshelf entitled, 50 Remarkable events pointing to THE END. Written in 1997, it predicted that ‘Jesus could return by AD 2000&#039;. This is one of many attempts to predict the timing of ‘the End’ that have turned out to be false. That is why Tony Campolo wisely says he wants to be ‘on the welcoming committee’ rather than the ‘planning committee’!\nWe are not told when the end will come, but we are told about the how and the who. The key is the who. Jesus says, ‘I am… the Beginning and the End’ (Revelation 22:13). Of course, ‘the End’ and ‘the Beginning’ appear very different. However, there can be significant similarities to both the beginning and the end.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 365
}