{
  "title": "Episode 75: &#8220;There Goes My Baby&#8221; by the Drifters",
  "link": "https://500songs.com/podcast/episode-75-there-goes-my-baby-by-the-drifters/",
  "pubDate": "Mon, 23 Mar 2020 20:15:43 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-75-there-goes-my-baby-by-the-drifters/",
  "description": "Episode seventy-five of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"There Goes My Baby\" by the Drifters, and how a fake record label, a band sacked for drunkenness, and a kettledrum player who couldn't play led to a genre-defining hit. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/35184587\">\"Rebel Rouser\" by Duane Eddy</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust%20\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-75-there-goes-my-baby/\"> Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI'm not going to recommend a compilation this week, for reasons I mention in the episode itself. There are plenty available, none of them as good as they should be.\n\nThe episode on the early career of the Drifters is <a href=\"https://www.500songs.com/e/episode-17-money-honey-by-clyde-mcphatter-and-the-drifters/\">episode seventeen</a>.\n\nMy main resource in putting this episode together was <a href=\"http://uncamarvy.com\">Marv Goldberg's website</a>, and his excellent articles on both the early- and late-period Drifters, Bill Pinkney's later Original Drifters, the Five Crowns, and Ben E. King.\n\n<a href=\"https://amzn.to/2JO5R9p\">Lonely Avenue</a>, a biography of Doc Pomus by Alex Halberstadt, helped me with the information on Pomus.\n\n<a href=\"https://amzn.to/2SY9jkw\">Hound Dog: The Leiber and Stoller Autobiography</a> by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\nAnd <a href=\"https://amzn.to/2vHRyiL\">Bill Millar's book on the Drifters</a>, while it is more a history of 50s vocal group music generally using them as a focus than a biography of the group, contains some interesting material.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/andrewhickey\">Why not join them</a>?\n\n<strong>Transcript</strong>\n\nA quick note about this one, before I start. As we'll see in this episode, there have been many, many, lineups of the Drifters over the years, with many different people involved. One problem with that is that there have been lots of compilations put out under the Drifters name, featuring rerecorded versions of their hits, often involving nobody who was on the original record.\n\nIndeed, there have been so many of these compilations, and people putting together hits compilations, even for major labels, have been so sloppy, that I can't find a single compilation of the Drifters' recordings that doesn't have one or two dodgy remakes on replacing the originals.\n\nI've used multiple sources for the recordings I'm excerpting here, and in most cases I'm pretty sure that the tracks I'm excerpting are the original versions. But particularly when it comes to songs that aren't familiar, I may have ended up using a rerecording rather than the original. Anyway, on with the story...\n\n[Excerpt: The Drifters, \"There Goes My Baby\"]\n\nIt's been more than a year since we last properly checked in with the Drifters, one of the great R&B vocal groups of all time, so I'll quickly bring you up to speed -- if you want to hear the full story so far, episode seventeen, on \"Money Honey\", gives you all the details.\n\nThe Drifters had originally formed as the backing group for Clyde McPhatter, who had been the lead singer of Billy Ward and the Dominoes in the early fifties, when that group had had their biggest success. The original lineup of the group had all been sacked before they even released a record, and then a couple of members of the lineup who recorded their first big hits became ill or died, but the group had released two massive hits -- \"Money Honey\" and \"Such a Night\", both with McPhatter on lead vocals:\n\n[Excerpt: Clyde McPhatter and the Drifters, \"Such a Night\"]\n\nBut then McPhatter had been drafted, and the group's manager, George Treadwell, had got in a member of the original lineup, David Baughan, to replace McPhatter, as Baughan could sound a little like McPhatter. When McPhatter was discharged from the army, he decided to sell the group name to Treadwell, and the Drifters became employees of Treadwell, to be hired and fired at his discretion. This group went through several lineup changes, some of which we'll look at later in this episode, but they kept making records that sounded a bit like the ones they'd been making with Clyde McPhatter, even after Baughan also left the group.\n\nBut there was a big difference behind the scenes. Those early records had been produced by Ahmet Ertegun and Jerry Wexler, and had usually been arranged by Jesse Stone, the man who'd written \"Money Honey\" and many other early rock and roll hits, like \"Shake, Rattle, and Roll\". But a little while after Baughan left the group, Ertegun and Wexler asked Jerry Leiber and Mike Stoller to start working with them.\n\nLeiber and Stoller, you might remember, were working with a *lot* of people at the time. They'd come over to Atlantic Records with a non-exclusive contract to write and produce for the label, and while their main project at Atlantic was with the Coasters, they were also producing records for people like Ruth Brown, as well as also working on records for Elvis and others at RCA.\n\nBut they took on the Drifters as well, and started producing a string of minor hits for them, including \"Ruby Baby\" and \"Fools Fall In Love\". Those hits went top ten on the R&B chart, but did little or nothing in the pop market.\n\n[Excerpt: The Drifters, \"Fools Fall In Love\"]\n\nThat song, which had Johnny Moore on lead vocals, was the last big hit for what we can think of as the \"original\" Drifters in some form. It came out in March 1957, and for the rest of the year they kept releasing singles, but nothing made the R&B charts at all, though a few did make the lower reaches of the Hot One Hundred.\n\nThroughout 1957, the group had been gaining and losing members. Bill Pinkney, who had been chosen by the other group members to be essentially their shop steward, had gone to Treadwell and asked for a raise in late 1956, and been promptly fired. He'd formed a group called the Flyers, with a new singer called Bobby Hendricks on lead. The Flyers recorded one single, \"My Only Desire\":\n\n[Excerpt: the Flyers, \"My Only Desire\"]\n\nBut then Tommy Evans, Pinkney's replacement in the group, was fired, and Pinkney was brought back into the group. Hendricks thought that was the end of his career, but then a few days later Pinkney phoned him up -- Johnny Moore was getting drafted, and Hendricks was brought into the group to take Moore's place.\n\nBut almost immediately after Hendricks joined the group, Pinkney once again asked for a raise, and was kicked out and Evans brought back in. Pinkney went off and made a record for Sam Phillips, with backing music overdubbed by Bill Justis:\n\n[Excerpt: Bill Pinkney, \"After the Hop\"]\n\nThe group kept changing lineups, and there was only one session in 1958, which led to a horrible version of \"Moonlight Bay\". Apparently, the session was run by Leiber and Stoller as an experiment (they would occasionally record old standards with the Coasters, so presumably they were seeing if the same thing would work with the Drifters), and several of the group's members were drunk when they recorded it. They decided at the session that it was not going to be released, but then the next thing the group knew, it was out as their next single, with overdubs by a white vocal group, making it sound nothing like the Drifters at all:\n\n[Excerpt: The Drifters \"Moonlight Bay\"]\n\nBobby Hendricks hated that recording session so much that he quit the group and went solo, going over to Sue Records, where he joined up with another former Drifter, Jimmy Oliver. Oliver wrote a song for Hendricks, \"Itchy Twitchy Feeling\", and the Coasters sang the backup vocals for him, uncredited. That track went to number five on the R&B charts:\n\n[Excerpt: Bobby Hendricks, \"Itchy Twitchy Feeling\"]\n\nBy this time, the Drifters were down to just three people -- Gerhart Thrasher, Jimmy Milner, and Tommy Evans. They no longer had a lead singer, but they had a week's worth of shows they were contracted to do, at the Harlem Apollo, on a show hosted by the DJ Doctor Jive. That show was headlined by Ray Charles, and also featured the Cookies, Solomon Burke, and a minor group called the Crowns, among several other acts.\n\nTreadwell was desperate, so he called Hendricks and Oliver and got them to return to the group just for one week, so they would have a lead vocalist. They both did return, though just as a favour. Then, at the end of the week's residency, one of the group members got drunk and started shouting abuse at Doctor Jive, and at the owner of the Apollo.\n\nGeorge Treadwell had had enough. He fired the entire group.\n\nTommy Evans went on to join Charlie Fuqua's version of the Ink Spots, and Bill Pinkney decided he wanted to get the old group back together. He got a 1955 lineup of the Drifters together -- Pinkney, David Baughan, Gerhart Thrasher, and Andrew Thrasher. That group toured as The Original Drifters, and the group under that name would consist almost entirely of ex-members of the Drifters, with some coming or going, until 1968, when most of the group retired, while Pinkney carried on leading a group under that name until his death in 2007. But they couldn't use that name on records. Instead they made records as the Harmony Grits:\n\n[Excerpt: The Harmony Grits, \"I Could Have Told You\"]\n\nand with ex-Drifter Johnny Moore singing lead, as a solo artist under the name Johnny Darrow:\n\n[Excerpt: Johnny Darrow, \"Chew Tobacco Rag\"]\n\nAnd with Bobby Hendricks singing lead, as the Sprites:\n\n[Excerpt: The Sprites, \"My Picture\"]\n\nBut the reason they couldn't call themselves the Drifters on their records is that George Treadwell owned the name, and he had hired a totally different group to tour and record under that name.\n\nThe Crowns had their basis in a group called the Harmonaires, a street-corner group in New York. They had various members at first, but by the time they changed their name to the Five Crowns, they had stabilised on a lineup of Dock Green, Yonkie Paul, and three brothers -- Papa, Nicky, and Sonny Boy Clark.\n\nThe group were managed by Lover Patterson, who they believed was the manager of the Orioles, but was actually the Orioles' valet. Nonetheless, Patterson did manage to get them signed to a small record label, Rainbow Records, where they released \"You're My Inspiration\" in 1952:\n\n[Excerpt: The Five Crowns, \"You're My Inspiration\"]\n\nThe record label sent out a thousand copies of that single to one of their distributors, right at the point a truckers' strike was called, and ended up having to send another thousand out by plane. That kind of thing sums up the kind of luck the Five Crowns would have for the next few years.\n\nNothing they put out on Rainbow Records was any kind of a success, and in 1953 the group became the first act on a new label, Old Town Records -- they actually met the owner of the label, Hy Weiss, in a waiting room, while they were waiting to audition for a different label. On Old Town they put out a couple of singles, starting with \"You Could Be My Love\":\n\n[Excerpt: The Five Crowns, \"You Could Be My Love\"]\n\nBut none of these singles were hits either, and the group were doing so badly that when Nicky Clark left the group, they couldn't get another singer in to replace him at first -- Lover Patterson stood on stage and mimed while the four remaining members sang, so there would still be five people in the Five Crowns.\n\nBy 1955, the group had re-signed to Rainbow Records, now on their Riviera subsidiary, and they had gone through several further lineup changes. They now consisted of Yonkie Paul, Richard Lewis, Jesse Facing, Dock Green, and Bugeye Bailey. They put out one record on Riviera, \"You Came To Me\":\n\n[Excerpt: The Five Crowns, \"You Came to Me\"]\n\nThe group broke up shortly after that, and Dock Green put together a totally new lineup of the Five Crowns. That group signed to one of George Goldner's labels, Gee, and released another single, and then they broke up. Green got together *another* lineup of the Five Crowns, made another record on another label, and then that group broke up too. They spent nearly two years without making a record, with constantly shifting lineups as people kept leaving and rejoining, and by the time they went into a studio again, they consisted of Charlie Thomas, Dock Green, Papa Clark, Elsbeary Hobbs, and a new tenor singer called Benjamin Earl Nelson, who hadn't sung professionally before joining the group -- he'd been working in a restaurant owned by his father, and Lover Patterson had heard him singing to himself while he was working and asked him to join the group.\n\nThis lineup of the group, who were now calling themselves the Crowns rather than the Five Crowns, finally got a contract with a record label... or at least, it was sort of a record label.\n\nWe've talked about Doc Pomus before, back in November, but as a brief recap -- Pomus was a blues singer and songwriter, a white Jewish paraplegic whose birth name was Jerome Felder, who had become a blues shouter in the late forties:\n\n[Excerpt: Doc Pomus, \"Send for the Doctor\"]\n\nHe had been working as a professional songwriter for a decade or so, and had written songs for people like Ray Charles, but the music he loved was hard bluesy R&B, and he didn't understand the new rock and roll music at all. Other than writing \"Young Blood\", which Leiber and Stoller had rewritten and made into a hit for the Coasters, he hadn't written anything successful in quite some time.\n\nHe'd recently started writing with a much younger man, Mort Shuman, who did understand rock and roll, and we heard one of the results of that last week -- \"Teenager in Love\" by Dion and the Belmonts, which would be the start of a string of hits for them:\n\n[Excerpt: Dion and the Belmonts, \"Teenager in Love\"]\n\nBut in 1958, that had not yet been released. Pomus' wife had a baby on the way, and he was desperate for money. He was so desperate, he got involved in a scam. An old girlfriend introduced him to an acquaintance, a dance instructor named Fred Huckman. Huckman had recently married a rich old widow, and he wanted to get away from her during the day to sleep with other people.\n\nSo Huckman decided he was going to become the owner of a record label, using his wife's money to fund an office. The label was named R&B Records at Doc's suggestion, and Doc was going to be the company's president, while Mort was going to be the company's shipping clerk.\n\nThe company would have offices in 1650 Broadway, one of the buildings that these days gets lumped in when people talk about \"the Brill Building\", though the actual Brill Building itself was a little way down the street at 1619. 1650 was still a prime music business location though, and the company's office would let both Doc and Mort go and try to sell their songs to publishing companies and record labels. And they'd need to do this because R&B Records wasn't going to put out any records at all.\n\nDoc and Mort's actual job was that one of them had to be in the office at all times, so when Huckman's wife phoned up, they could tell her that he'd just popped out, or was in a meeting, or something so she didn't find out about his affairs.\n\nThey lived off the scam for a little while, while writing songs, but eventually they started to get bored of doing nothing all day. And then Lucky Patterson brought the Crowns in.\n\nThey didn't realise that R&B Records wasn't a real record label, and Pomus decided to audition them. When he did, he was amazed at how good they sounded. He decided that R&B Records was *going* to be a real record label, no matter what Huckman thought. He and Shuman wrote them a single in the style of the Coasters, and they got in the best session musicians in New York -- people like King Curtis and Mickey Baker, who were old friends of Pomus -- to play on it:\n\n[Excerpt: The Crowns, \"Kiss and Make Up\"]\n\nAt first that record was completely unsuccessful, but then, rather amazingly, it started to climb in the charts, at least in Pittsburgh, where it became a local number one. It started to do better elsewhere as well, and it looked like the Crowns could have a promising career.\n\nAnd then one day Mrs. Huckman showed up at the office. Pomus tried to tell her that her husband had gone out and would be back later, but she insisted on waiting in the office, silently, all day. R&B Records closed the next day.\n\nBut \"Kiss and Make Up\" had been a big enough success that the Crowns had ended up on that Doctor Jive show with the Drifters. And then when George Treadwell fired the Drifters, he immediately hired the Crowns -- or at least, he hired four of them. Papa Clark had a drinking problem, and Treadwell was fed up of dealing with drunk singers. So from this point on the Drifters were Charlie Thomas, Dock Green, Elsbeary Hobbs, and Benjamin Nelson, who decided that he was going to take on a stage name and call himself Ben E. King.\n\nThis new lineup of the group went out on tour for almost a year before going into the studio, and they were abysmal failures. Everywhere they went, promoters advertised their shows with photos of the old group, and then this new group of people came on stage looking and sounding nothing like the original Drifters. They were booed everywhere they went.\n\nThey even caused problems for the other acts -- at one show they nearly killed Screamin' Jay Hawkins. Hawkins used to pop out of a coffin while performing \"I Put A Spell on You\":\n\n[Excerpt: Screamin' Jay Hawkins, \"I Put a Spell on You\"]\n\nThe group were sometimes asked to carry the coffin onto the stage with Hawkins inside it, and one night Charlie Thomas accidentally nudged something and heard a click. What he didn't realise was that Hawkins put matchbooks in the gap in the coffin lid, to stop it closing all the way -- Thomas had knocked the coffin properly shut.\n\nThe music started, and Hawkins tried to open the coffin, and couldn't. He kept pushing, and the coffin wouldn't open. Eventually, he rocked the coffin so hard that it fell off its stand and popped open, but if it hadn't opened there was a very real danger that Hawkins could have asphyxiated.\n\nBut something else happened on that tour -- Ben E. King wrote a song called \"There Goes My Baby\", which the group started to perform live. As they originally did it, it was quite a fast song, but when they finally got off the tour and went into the studio, Leiber and Stoller, who were going to be the producers for this new group just like they had been for the old group, decided to slow it down.\n\nThey also decided that this was going to be a chance for them to experiment with some totally new production ideas. Stoller had become infatuated with a style called baion, a Brazillian musical style that is based on the same tresillo rhythm that a lot of New Orleans R&B is based on.\n\nIf you don't remember the tresillo rhythm, we talked about it a lot in episodes on Fats Domino and others, but it's that \"bom [pause] bom-bom [pause] bom [pause] bom-bom\" rhythm. We've always been calling it the tresillo, but when people talk about the Drifters' music they always follow Stoller's lead and call it the baion rhythm, so that's what we'll do in future.\n\nThey decided to use that rhythm, and also to use strings, which very few people had used on a rock and roll record before -- this is an idea that several people seemed to have simultaneously, as we saw last week with Buddy Holly doing the same thing. It may, indeed, be that Leiber and Stoller had heard \"It Doesn't Matter Any More\" and taken inspiration from it -- Holly had died just over a month before the recording session for \"There Goes My Baby\", and his single hit the top forty the same week that \"There Goes My Baby\" was recorded.\n\nStoller sketched out some string lines, which were turned into full arrangements by an old classmate of his, Stan Applebaum, who had previously arranged for Lucky Millinder, and who had written a hit for Sarah Vaughan, who was married to Treadwell.\n\nCharlie Thomas was meant to sing lead on the track, but he just couldn't get it right, and eventually it was decided to have King sing it instead, as he'd written the song. King tried to imitate the sound of Sam Cooke, but it came out sounding like no-one but King himself.\n\nThen, as a final touch, Leiber and Stoller decided to use a kettledrum on the track, rather than a normal drum kit. There was only one problem -- the drummer they booked didn't know how to change the pitch on the kettledrum using the foot pedal. So he just kept playing the same note throughout the song, even as the chords changed:\n\n[Excerpt: The Drifters, \"There Goes My Baby\"]\n\nWhen Leiber and Stoller took that to their bosses at Atlantic Records, they were horrified. Jerry Wexler said “It’s dog meat. You've wasted our money on an overpriced production that sounds like a radio caught between two stations. It’s a goddamn awful mess!”\n\nAhmet Ertegun was a little more diplomatic, but still said that the record was unreleasable. But eventually he let them have a go at remixing it, and then the label stuck the record out, assuming it would do nothing.\n\nInstead, it went to number two on the charts, and became one of the biggest hits of 1959. Not only that, but it instantly opened up the possibilities for new ways of producing records. The new Drifters were a smash hit, and Leiber and Stoller were now as respected as producers as they already had been as songwriters. They got themselves a new office in the Brill Building, and they were on top of the world.\n\nBut already there was a problem for the new Drifters, and that problem was named Lover Patterson.\n\nRather than sign the Crowns to a management deal as a group, Patterson had signed them all as individuals, with separate contracts. And when he'd allowed George Treadwell to take over their management, he'd only sold the contracts for three of the four members. Ben E. King was still signed to Lover Patterson, rather than to George Treadwell. And Patterson decided that he was going to let King sing on the records, but he wasn't going to let him tour with the group.\n\nSo there was yet another lineup change for the Drifters, as they got in Johnnie Lee Williams to sing King's parts on stage. Williams would sing one lead with the group in the studio, \"If You Cry True Love, True Love\":\n\n[Excerpt: The Drifters, \"If You Cry True Love, True Love\"]\n\nBut for the most part, King was the lead singer in the studio, and so there were five Drifters on the records, but only four on the road. But they were still having hits, and everybody seemed happy.\n\nAnd soon, they would all have the biggest hit of their careers, with a song that Doc Pomus had written with Mort Shuman, about his own wedding reception. We'll hear more about that, and about Leiber and Stoller's apprentice Phil Spector, when we return to the Drifters in a few weeks time.",
  "itunes:subtitle": "Episode seventy-five of A History of Rock Music in Five Hundred Songs looks at There Goes My Baby by the Drifters, and how a fake record label, a band sacked for drunkenness, and a kettledrum player who couldnt play led to a genre-defining hit. Click the",
  "itunes:keywords": "Ahmet Ertegun,baion,Ben E. King,Bill Justis,Brill Building,Clyde McPhatter,Dion and the Belmonts,Doc Pomus,Gee Records,George Goldner,Jerry Wexler,Jesse Stone,King Curtis,Leiber and Stoller,Mickey Baker,Mort Shuman,Sam Phillips,Screamin&#039; Jay Hawkins,soul,The Coasters,The Drifters,The Orioles,tresillo,vocal groups",
  "itunes:episodeType": "full",
  "itunes:episode": 75,
  "content:encoded": "Episode seventy-five of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"There Goes My Baby\" by the Drifters, and how a fake record label, a band sacked for drunkenness, and a kettledrum player who couldn't play led to a genre-defining hit. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/35184587\">\"Rebel Rouser\" by Duane Eddy</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust%20\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-75-there-goes-my-baby/\"> Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI'm not going to recommend a compilation this week, for reasons I mention in the episode itself. There are plenty available, none of them as good as they should be.\n\nThe episode on the early career of the Drifters is <a href=\"https://www.500songs.com/e/episode-17-money-honey-by-clyde-mcphatter-and-the-drifters/\">episode seventeen</a>.\n\nMy main resource in putting this episode together was <a href=\"http://uncamarvy.com\">Marv Goldberg's website</a>, and his excellent articles on both the early- and late-period Drifters, Bill Pinkney's later Original Drifters, the Five Crowns, and Ben E. King.\n\n<a href=\"https://amzn.to/2JO5R9p\">Lonely Avenue</a>, a biography of Doc Pomus by Alex Halberstadt, helped me with the information on Pomus.\n\n<a href=\"https://amzn.to/2SY9jkw\">Hound Dog: The Leiber and Stoller Autobiography</a> by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\nAnd <a href=\"https://amzn.to/2vHRyiL\">Bill Millar's book on the Drifters</a>, while it is more a history of 50s vocal group music generally using them as a focus than a biography of the group, contains some interesting material.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/andrewhickey\">Why not join them</a>?\n\n<strong>Transcript</strong>\n\nA quick note about this one, before I start. As we'll see in this episode, there have been many, many, lineups of the Drifters over the years, with many different people involved. One problem with that is that there have been lots of compilations put out under the Drifters name, featuring rerecorded versions of their hits, often involving nobody who was on the original record.\n\nIndeed, there have been so many of these compilations, and people putting together hits compilations, even for major labels, have been so sloppy, that I can't find a single compilation of the Drifters' recordings that doesn't have one or two dodgy remakes on replacing the originals.\n\nI've used multiple sources for the recordings I'm excerpting here, and in most cases I'm pretty sure that the tracks I'm excerpting are the original versions. But particularly when it comes to songs that aren't familiar, I may have ended up using a rerecording rather than the original. Anyway, on with the story...\n\n[Excerpt: The Drifters, \"There Goes My Baby\"]\n\nIt's been more than a year since we last properly checked in with the Drifters, one of the great R&B vocal groups of all time, so I'll quickly bring you up to speed -- if you want to hear the full story so far, episode seventeen, on \"Money Honey\", gives you all the details.\n\nThe Drifters had originally formed as the backing group for Clyde McPhatter, who had been the lead singer of Billy Ward and the Dominoes in the early fifties, when that group had had their biggest success. The original lineup of the group had all been sacked before they even released a record, and then a couple of members of the lineup who recorded their first big hits became ill or died, but the group had released two massive hits -- \"Money Honey\" and \"Such a Night\", both with McPhatter on lead vocals:\n\n[Excerpt: Clyde McPhatter and the Drifters, \"Such a Night\"]\n\nBut then McPhatter had been drafted, and the group's manager, George Treadwell, had got in a member of the original lineup, David Baughan, to replace McPhatter, as Baughan could sound a little like McPhatter. When McPhatter was discharged from the army, he decided to sell the group name to Treadwell, and the Drifters became employees of Treadwell, to be hired and fired at his discretion. This group went through several lineup changes, some of which we'll look at later in this episode, but they kept making records that sounded a bit like the ones they'd been making with Clyde McPhatter, even after Baughan also left the group.\n\nBut there was a big difference behind the scenes. Those early records had been produced by Ahmet Ertegun and Jerry Wexler, and had usually been arranged by Jesse Stone, the man who'd written \"Money Honey\" and many other early rock and roll hits, like \"Shake, Rattle, and Roll\". But a little while after Baughan left the group, Ertegun and Wexler asked Jerry Leiber and Mike Stoller to start working with them.\n\nLeiber and Stoller, you might remember, were working with a *lot* of people at the time. They'd come over to Atlantic Records with a non-exclusive contract to write and produce for the label, and while their main project at Atlantic was with the Coasters, they were also producing records for people like Ruth Brown, as well as also working on records for Elvis and others at RCA.\n\nBut they took on the Drifters as well, and started producing a string of minor hits for them, including \"Ruby Baby\" and \"Fools Fall In Love\". Those hits went top ten on the R&B chart, but did little or nothing in the pop market.\n\n[Excerpt: The Drifters, \"Fools Fall In Love\"]\n\nThat song, which had Johnny Moore on lead vocals, was the last big hit for what we can think of as the \"original\" Drifters in some form. It came out in March 1957, and for the rest of the year they kept releasing singles, but nothing made the R&B charts at all, though a few did make the lower reaches of the Hot One Hundred.\n\nThroughout 1957, the group had been gaining and losing members. Bill Pinkney, who had been chosen by the other group members to be essentially their shop steward, had gone to Treadwell and asked for a raise in late 1956, and been promptly fired. He'd formed a group called the Flyers, with a new singer called Bobby Hendricks on lead. The Flyers recorded one single, \"My Only Desire\":\n\n[Excerpt: the Flyers, \"My Only Desire\"]\n\nBut then Tommy Evans, Pinkney's replacement in the group, was fired, and Pinkney was brought back into the group. Hendricks thought that was the end of his career, but then a few days later Pinkney phoned him up -- Johnny Moore was getting drafted, and Hendricks was brought into the group to take Moore's place.\n\nBut almost immediately after Hendricks joined the group, Pinkney once again asked for a raise, and was kicked out and Evans brought back in. Pinkney went off and made a record for Sam Phillips, with backing music overdubbed by Bill Justis:\n\n[Excerpt: Bill Pinkney, \"After the Hop\"]\n\nThe group kept changing lineups, and there was only one session in 1958, which led to a horrible version of \"Moonlight Bay\". Apparently, the session was run by Leiber and Stoller as an experiment (they would occasionally record old standards with the Coasters, so presumably they were seeing if the same thing would work with the Drifters), and several of the group's members were drunk when they recorded it. They decided at the session that it was not going to be released, but then the next thing the group knew, it was out as their next single, with overdubs by a white vocal group, making it sound nothing like the Drifters at all:\n\n[Excerpt: The Drifters \"Moonlight Bay\"]\n\nBobby Hendricks hated that recording session so much that he quit the group and went solo, going over to Sue Records, where he joined up with another former Drifter, Jimmy Oliver. Oliver wrote a song for Hendricks, \"Itchy Twitchy Feeling\", and the Coasters sang the backup vocals for him, uncredited. That track went to number five on the R&B charts:\n\n[Excerpt: Bobby Hendricks, \"Itchy Twitchy Feeling\"]\n\nBy this time, the Drifters were down to just three people -- Gerhart Thrasher, Jimmy Milner, and Tommy Evans. They no longer had a lead singer, but they had a week's worth of shows they were contracted to do, at the Harlem Apollo, on a show hosted by the DJ Doctor Jive. That show was headlined by Ray Charles, and also featured the Cookies, Solomon Burke, and a minor group called the Crowns, among several other acts.\n\nTreadwell was desperate, so he called Hendricks and Oliver and got them to return to the group just for one week, so they would have a lead vocalist. They both did return, though just as a favour. Then, at the end of the week's residency, one of the group members got drunk and started shouting abuse at Doctor Jive, and at the owner of the Apollo.\n\nGeorge Treadwell had had enough. He fired the entire group.\n\nTommy Evans went on to join Charlie Fuqua's version of the Ink Spots, and Bill Pinkney decided he wanted to get the old group back together. He got a 1955 lineup of the Drifters together -- Pinkney, David Baughan, Gerhart Thrasher, and Andrew Thrasher. That group toured as The Original Drifters, and the group under that name would consist almost entirely of ex-members of the Drifters, with some coming or going, until 1968, when most of the group retired, while Pinkney carried on leading a group under that name until his death in 2007. But they couldn't use that name on records. Instead they made records as the Harmony Grits:\n\n[Excerpt: The Harmony Grits, \"I Could Have Told You\"]\n\nand with ex-Drifter Johnny Moore singing lead, as a solo artist under the name Johnny Darrow:\n\n[Excerpt: Johnny Darrow, \"Chew Tobacco Rag\"]\n\nAnd with Bobby Hendricks singing lead, as the Sprites:\n\n[Excerpt: The Sprites, \"My Picture\"]\n\nBut the reason they couldn't call themselves the Drifters on their records is that George Treadwell owned the name, and he had hired a totally different group to tour and record under that name.\n\nThe Crowns had their basis in a group called the Harmonaires, a street-corner group in New York. They had various members at first, but by the time they changed their name to the Five Crowns, they had stabilised on a lineup of Dock Green, Yonkie Paul, and three brothers -- Papa, Nicky, and Sonny Boy Clark.\n\nThe group were managed by Lover Patterson, who they believed was the manager of the Orioles, but was actually the Orioles' valet. Nonetheless, Patterson did manage to get them signed to a small record label, Rainbow Records, where they released \"You're My Inspiration\" in 1952:\n\n[Excerpt: The Five Crowns, \"You're My Inspiration\"]\n\nThe record label sent out a thousand copies of that single to one of their distributors, right at the point a truckers' strike was called, and ended up having to send another thousand out by plane. That kind of thing sums up the kind of luck the Five Crowns would have for the next few years.\n\nNothing they put out on Rainbow Records was any kind of a success, and in 1953 the group became the first act on a new label, Old Town Records -- they actually met the owner of the label, Hy Weiss, in a waiting room, while they were waiting to audition for a different label. On Old Town they put out a couple of singles, starting with \"You Could Be My Love\":\n\n[Excerpt: The Five Crowns, \"You Could Be My Love\"]\n\nBut none of these singles were hits either, and the group were doing so badly that when Nicky Clark left the group, they couldn't get another singer in to replace him at first -- Lover Patterson stood on stage and mimed while the four remaining members sang, so there would still be five people in the Five Crowns.\n\nBy 1955, the group had re-signed to Rainbow Records, now on their Riviera subsidiary, and they had gone through several further lineup changes. They now consisted of Yonkie Paul, Richard Lewis, Jesse Facing, Dock Green, and Bugeye Bailey. They put out one record on Riviera, \"You Came To Me\":\n\n[Excerpt: The Five Crowns, \"You Came to Me\"]\n\nThe group broke up shortly after that, and Dock Green put together a totally new lineup of the Five Crowns. That group signed to one of George Goldner's labels, Gee, and released another single, and then they broke up. Green got together *another* lineup of the Five Crowns, made another record on another label, and then that group broke up too. They spent nearly two years without making a record, with constantly shifting lineups as people kept leaving and rejoining, and by the time they went into a studio again, they consisted of Charlie Thomas, Dock Green, Papa Clark, Elsbeary Hobbs, and a new tenor singer called Benjamin Earl Nelson, who hadn't sung professionally before joining the group -- he'd been working in a restaurant owned by his father, and Lover Patterson had heard him singing to himself while he was working and asked him to join the group.\n\nThis lineup of the group, who were now calling themselves the Crowns rather than the Five Crowns, finally got a contract with a record label... or at least, it was sort of a record label.\n\nWe've talked about Doc Pomus before, back in November, but as a brief recap -- Pomus was a blues singer and songwriter, a white Jewish paraplegic whose birth name was Jerome Felder, who had become a blues shouter in the late forties:\n\n[Excerpt: Doc Pomus, \"Send for the Doctor\"]\n\nHe had been working as a professional songwriter for a decade or so, and had written songs for people like Ray Charles, but the music he loved was hard bluesy R&B, and he didn't understand the new rock and roll music at all. Other than writing \"Young Blood\", which Leiber and Stoller had rewritten and made into a hit for the Coasters, he hadn't written anything successful in quite some time.\n\nHe'd recently started writing with a much younger man, Mort Shuman, who did understand rock and roll, and we heard one of the results of that last week -- \"Teenager in Love\" by Dion and the Belmonts, which would be the start of a string of hits for them:\n\n[Excerpt: Dion and the Belmonts, \"Teenager in Love\"]\n\nBut in 1958, that had not yet been released. Pomus' wife had a baby on the way, and he was desperate for money. He was so desperate, he got involved in a scam. An old girlfriend introduced him to an acquaintance, a dance instructor named Fred Huckman. Huckman had recently married a rich old widow, and he wanted to get away from her during the day to sleep with other people.\n\nSo Huckman decided he was going to become the owner of a record label, using his wife's money to fund an office. The label was named R&B Records at Doc's suggestion, and Doc was going to be the company's president, while Mort was going to be the company's shipping clerk.\n\nThe company would have offices in 1650 Broadway, one of the buildings that these days gets lumped in when people talk about \"the Brill Building\", though the actual Brill Building itself was a little way down the street at 1619. 1650 was still a prime music business location though, and the company's office would let both Doc and Mort go and try to sell their songs to publishing companies and record labels. And they'd need to do this because R&B Records wasn't going to put out any records at all.\n\nDoc and Mort's actual job was that one of them had to be in the office at all times, so when Huckman's wife phoned up, they could tell her that he'd just popped out, or was in a meeting, or something so she didn't find out about his affairs.\n\nThey lived off the scam for a little while, while writing songs, but eventually they started to get bored of doing nothing all day. And then Lucky Patterson brought the Crowns in.\n\nThey didn't realise that R&B Records wasn't a real record label, and Pomus decided to audition them. When he did, he was amazed at how good they sounded. He decided that R&B Records was *going* to be a real record label, no matter what Huckman thought. He and Shuman wrote them a single in the style of the Coasters, and they got in the best session musicians in New York -- people like King Curtis and Mickey Baker, who were old friends of Pomus -- to play on it:\n\n[Excerpt: The Crowns, \"Kiss and Make Up\"]\n\nAt first that record was completely unsuccessful, but then, rather amazingly, it started to climb in the charts, at least in Pittsburgh, where it became a local number one. It started to do better elsewhere as well, and it looked like the Crowns could have a promising career.\n\nAnd then one day Mrs. Huckman showed up at the office. Pomus tried to tell her that her husband had gone out and would be back later, but she insisted on waiting in the office, silently, all day. R&B Records closed the next day.\n\nBut \"Kiss and Make Up\" had been a big enough success that the Crowns had ended up on that Doctor Jive show with the Drifters. And then when George Treadwell fired the Drifters, he immediately hired the Crowns -- or at least, he hired four of them. Papa Clark had a drinking problem, and Treadwell was fed up of dealing with drunk singers. So from this point on the Drifters were Charlie Thomas, Dock Green, Elsbeary Hobbs, and Benjamin Nelson, who decided that he was going to take on a stage name and call himself Ben E. King.\n\nThis new lineup of the group went out on tour for almost a year before going into the studio, and they were abysmal failures. Everywhere they went, promoters advertised their shows with photos of the old group, and then this new group of people came on stage looking and sounding nothing like the original Drifters. They were booed everywhere they went.\n\nThey even caused problems for the other acts -- at one show they nearly killed Screamin' Jay Hawkins. Hawkins used to pop out of a coffin while performing \"I Put A Spell on You\":\n\n[Excerpt: Screamin' Jay Hawkins, \"I Put a Spell on You\"]\n\nThe group were sometimes asked to carry the coffin onto the stage with Hawkins inside it, and one night Charlie Thomas accidentally nudged something and heard a click. What he didn't realise was that Hawkins put matchbooks in the gap in the coffin lid, to stop it closing all the way -- Thomas had knocked the coffin properly shut.\n\nThe music started, and Hawkins tried to open the coffin, and couldn't. He kept pushing, and the coffin wouldn't open. Eventually, he rocked the coffin so hard that it fell off its stand and popped open, but if it hadn't opened there was a very real danger that Hawkins could have asphyxiated.\n\nBut something else happened on that tour -- Ben E. King wrote a song called \"There Goes My Baby\", which the group started to perform live. As they originally did it, it was quite a fast song, but when they finally got off the tour and went into the studio, Leiber and Stoller, who were going to be the producers for this new group just like they had been for the old group, decided to slow it down.\n\nThey also decided that this was going to be a chance for them to experiment with some totally new production ideas. Stoller had become infatuated with a style called baion, a Brazillian musical style that is based on the same tresillo rhythm that a lot of New Orleans R&B is based on.\n\nIf you don't remember the tresillo rhythm, we talked about it a lot in episodes on Fats Domino and others, but it's that \"bom [pause] bom-bom [pause] bom [pause] bom-bom\" rhythm. We've always been calling it the tresillo, but when people talk about the Drifters' music they always follow Stoller's lead and call it the baion rhythm, so that's what we'll do in future.\n\nThey decided to use that rhythm, and also to use strings, which very few people had used on a rock and roll record before -- this is an idea that several people seemed to have simultaneously, as we saw last week with Buddy Holly doing the same thing. It may, indeed, be that Leiber and Stoller had heard \"It Doesn't Matter Any More\" and taken inspiration from it -- Holly had died just over a month before the recording session for \"There Goes My Baby\", and his single hit the top forty the same week that \"There Goes My Baby\" was recorded.\n\nStoller sketched out some string lines, which were turned into full arrangements by an old classmate of his, Stan Applebaum, who had previously arranged for Lucky Millinder, and who had written a hit for Sarah Vaughan, who was married to Treadwell.\n\nCharlie Thomas was meant to sing lead on the track, but he just couldn't get it right, and eventually it was decided to have King sing it instead, as he'd written the song. King tried to imitate the sound of Sam Cooke, but it came out sounding like no-one but King himself.\n\nThen, as a final touch, Leiber and Stoller decided to use a kettledrum on the track, rather than a normal drum kit. There was only one problem -- the drummer they booked didn't know how to change the pitch on the kettledrum using the foot pedal. So he just kept playing the same note throughout the song, even as the chords changed:\n\n[Excerpt: The Drifters, \"There Goes My Baby\"]\n\nWhen Leiber and Stoller took that to their bosses at Atlantic Records, they were horrified. Jerry Wexler said “It’s dog meat. You've wasted our money on an overpriced production that sounds like a radio caught between two stations. It’s a goddamn awful mess!”\n\nAhmet Ertegun was a little more diplomatic, but still said that the record was unreleasable. But eventually he let them have a go at remixing it, and then the label stuck the record out, assuming it would do nothing.\n\nInstead, it went to number two on the charts, and became one of the biggest hits of 1959. Not only that, but it instantly opened up the possibilities for new ways of producing records. The new Drifters were a smash hit, and Leiber and Stoller were now as respected as producers as they already had been as songwriters. They got themselves a new office in the Brill Building, and they were on top of the world.\n\nBut already there was a problem for the new Drifters, and that problem was named Lover Patterson.\n\nRather than sign the Crowns to a management deal as a group, Patterson had signed them all as individuals, with separate contracts. And when he'd allowed George Treadwell to take over their management, he'd only sold the contracts for three of the four members. Ben E. King was still signed to Lover Patterson, rather than to George Treadwell. And Patterson decided that he was going to let King sing on the records, but he wasn't going to let him tour with the group.\n\nSo there was yet another lineup change for the Drifters, as they got in Johnnie Lee Williams to sing King's parts on stage. Williams would sing one lead with the group in the studio, \"If You Cry True Love, True Love\":\n\n[Excerpt: The Drifters, \"If You Cry True Love, True Love\"]\n\nBut for the most part, King was the lead singer in the studio, and so there were five Drifters on the records, but only four on the road. But they were still having hits, and everybody seemed happy.\n\nAnd soon, they would all have the biggest hit of their careers, with a song that Doc Pomus had written with Mort Shuman, about his own wedding reception. We'll hear more about that, and about Leiber and Stoller's apprentice Phil Spector, when we return to the Drifters in a few weeks time.",
  "enclosure": "",
  "itunes:summary": "Episode seventy-five of A History of Rock Music in Five Hundred Songs looks at \"There Goes My Baby\" by the Drifters, and how a fake record label, a band sacked for drunkenness, and a kettledrum player who couldn't play led to a genre-defining hit. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Rebel Rouser\" by Duane Eddy\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI'm not going to recommend a compilation this week, for reasons I mention in the episode itself. There are plenty available, none of them as good as they should be.\n\nThe episode on the early career of the Drifters is episode seventeen.\n\nMy main resource in putting this episode together was Marv Goldberg's website, and his excellent articles on both the early- and late-period Drifters, Bill Pinkney's later Original Drifters, the Five Crowns, and Ben E. King.\n\nLonely Avenue, a biography of Doc Pomus by Alex Halberstadt, helped me with the information on Pomus.\n\nHound Dog: The Leiber and Stoller Autobiography by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\nAnd Bill Millar's book on the Drifters, while it is more a history of 50s vocal group music generally using them as a focus than a biography of the group, contains some interesting material.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nA quick note about this one, before I start. As we'll see in this episode, there have been many, many, lineups of the Drifters over the years, with many different people involved. One problem with that is that there have been lots of compilations put out under the Drifters name, featuring rerecorded versions of their hits, often involving nobody who was on the original record.\n\nIndeed, there have been so many of these compilations, and people putting together hits compilations, even for major labels, have been so sloppy, that I can't find a single compilation of the Drifters' recordings that doesn't have one or two dodgy remakes on replacing the originals.\n\nI've used multiple sources for the recordings I'm excerpting here, and in most cases I'm pretty sure that the tracks I'm excerpting are the original versions. But particularly when it comes to songs that aren't familiar, I may have ended up using a rerecording rather than the original. Anyway, on with the story...\n\n[Excerpt: The Drifters, \"There Goes My Baby\"]\n\nIt's been more than a year since we last properly checked in with the Drifters, one of the great R&B vocal groups of all time, so I'll quickly bring you up to speed -- if you want to hear the full story so far, episode seventeen, on \"Money Honey\", gives you all the details.\n\nThe Drifters had originally formed as the backing group for Clyde McPhatter, who had been the lead singer of Billy Ward and the Dominoes in the early fifties, when that group had had their biggest success. The original lineup of the group had all been sacked before they even released a record, and then a couple of members of the lineup who recorded their first big hits became ill or died, but the group had released two massive hits -- \"Money Honey\" and \"Such a Night\", both with McPhatter on lead vocals:\n\n[Excerpt: Clyde McPhatter and the Drifters, \"Such a Night\"]\n\nBut then McPhatter had been drafted, and the group's manager, George Treadwell, had got in a member of the original lineup, David Baughan, to replace McPhatter, as Baughan could sound a little like McPhatter. When McPhatter was discharged from the army, he decided to sell the group name to Treadwell, and the ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode seventy-five of A History of Rock Music in Five Hundred Songs looks at \"There Goes My Baby\" by the Drifters, and how a fake record label, a band sacked for drunkenness, and a kettledrum player who couldn't play led to a genre-defining hit. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Rebel Rouser\" by Duane Eddy\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI'm not going to recommend a compilation this week, for reasons I mention in the episode itself. There are plenty available, none of them as good as they should be.\n\nThe episode on the early career of the Drifte",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}