{
  "title": "Unsolved Mysteries Ep 1: Mystery on the Rooftop",
  "link": "https://audioboom.com/posts/7700904",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3399,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>FAM!! SPOOKY SEASON IS HERE! To celebrate, we're adding an extra episode each week for the next 12 week to cover the FREAKING GLORIOUS NETFLIX REBOOT OF \"UNSOLVED MYSTERIES!\"<br>\n<br>\nEpisode 1 delves into the mysterious death of Rey Rivera. On May 16, 2006 Rey was seen leaving his home in a hurry after getting a phone call. His wife was away on a business trip, so it was a house guest who heard him say \"Oh!\" before darting out of the house in flip flops. 8 days later, his decomposing body was found in an abandoned area of the Belevedere Hotel in downtown Baltimore. He seemed to have come through the lower roof, as though he had jumped--or been pushed?--off of the upper roof of the hotel. Was this murder or suicide? And what could possibly have been the motive for either? <br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Thu, 08 Oct 2020 11:32:42 +0000",
  "guid": "tag:audioboom.com,2020-10-08:/posts/7700904",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}