{
  "id": "yt:video:lBJVyCYuu78",
  "yt:videoId": "lBJVyCYuu78",
  "yt:channelId": "UCGaVdbSav8xWuFWTadK6loA",
  "title": "This \"Math Test\" Changed How I See Humanity",
  "link": "",
  "author": {
    "name": "vlogbrothers",
    "uri": "https://www.youtube.com/channel/UCGaVdbSav8xWuFWTadK6loA"
  },
  "published": "2022-10-21T16:57:29+00:00",
  "updated": "2022-10-24T20:21:26+00:00",
  "media:group": {
    "media:title": "This \"Math Test\" Changed How I See Humanity",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "I think, for example, that pretty much every question about \"cancel culture\" is a question poorly phrased because \"cancel culture\" means at least 20 different things, from celebrities going to jail for sexual assault to viral \"karen\" videos. It's impossible to be right about cancel culture but very easy to have an opinion on it because every person has a different definition. It is a question, like the math test in the video, seemingly intentionally designed to create conflict. \n\nThere are so many mechanisms of how our disrupted world gets so messy and weird and bad, but the fact that it's much easier to argue about stuff when opinions are easy to form, and it's much easier to form easy opinions when questions are wrongly stated is actually new to me!!\n\nAlways learning!\n\n----\nSubscribe to our newsletter! http://eepurl.com/Bgi9b\nAnd join the community at http://nerdfighteria.com  \nHelp transcribe videos - http://nerdfighteria.info\nLearn more about our project to help Partners in Health radically reduce maternal mortality in Sierra Leone: https://www.pih.org/hankandjohn\nIf you're able to donate $2,000 or more to this effort, please join our matching fund: https://pih.org/hankandjohnmatch\nIf you're in Canada, you can donate here: https://pihcanada.org/hankandjohn\nJohn's twitter - http://twitter.com/johngreen\nHank's twitter - http://twitter.com/hankgreen\nHank's tumblr - http://edwardspoonhands.tumblr.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}