{
  "guid": "https://podcasts.nationalreview.com/?p=1816",
  "title": "Episode 16: Josh Jordan / Pearl Jam",
  "description": "<p>Scot and Jeff talk to Josh Jordan about Pearl Jam.</p>\n<p><b><span>Introducing the Band</span><br />\n</b>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\" target=\"_blank\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\" target=\"_blank\">@EsotericCD</a>) with guest Josh Jordan, writer for various outlets. Follow Josh on Twitter at <a href=\"https://twitter.com/NumbersMuncher\">@NumbersMuncher</a>.</p>\n<p><span><b>Josh’s Musical Pick: Pearl Jam</b></span><b><br />\n</b>Break out the flannels — it’s time for the gang to tackle a long overdue episode on Pearl Jam, the most durable (and arguably best — sorry, Nirvana fans) band of the famed Seattle grunge era of the ’90s. But Pearl Jam were so much more than just a “grunge” act, and have remained consistently great (as well as a legendarily top-shelf live act with a fanatical cult-like following) all the way up to the present day. Josh is almost a ‘ringer’ of sorts — a bona-fide megafan who has been to over 70 Pearl Jam shows since the mid-’90s. Josh talks about how he, like most people whose adolescence came during the early Nineties, got into Pearl Jam at the jump via <i>Ten </i>and immediately started using Eddie Vedder’s “poetry” in middle school English class. Jeff was of a similar vintage, but his fandom was interrupted: he fell off after <i>Vitalogy</i> when he discovered The Beatles and classic rock in high school, and only returned to them years later thanks to the fortuitous purchase of the well-curated compilation <i>Rearviewmirror.</i></p>\n<p><span><b><i>Ten, Vs.</i>, and Pearl Jam’s role in the Seattle grunge scene<br />\n</b></span>Scot quickly covers the origin story of Pearl Jam: Seattle act Mother Love Bone collapses when its lead singer Andrew Wood dies of an overdose, surviving members Jeff Ament (bass) and Stone Gossard (rhythm guitar) recruit hugely talented lead guitarist Mike McCready into the fold, and a demo tape from San Diego-based sensitive surfer bro Eddie Vedder finds its way into their hands. Vedder was brought into the band just in time to add lyrics and lead vocals to a series of songs already written by Gossard and Ament, the result was <i>Ten</i> (1991) and the rest is history.</p>\n<p>Perhaps surprisingly, the gang isn’t particularly enthusiastic about <i>Ten</i>, which most casual fans regard as Pearl Jam’s greatest album (it is certainly their most famous, one that nationally defined the sound of the grunge revolution). Jeff violently hates its quasi-hair metal anthems (even “Even Flow,” a great song, sounds like sludge on the record). He considers “Black” to be faux-sensitive tripe and is authentically offended by the terribleness of “Deep,” though he relents when it comes to “Jeremy” and the straight ahead dash of “Once.” Scot isn’t much more complimentary, noting that so much of PJ’s music is compulsively listenable but he never feels the need to return to <i>Ten</i>. Even Josh isn’t an enormous fan, though he defends many of these songs as live juggernauts (particularly “Release” and “Porch”). Josh notes that the album’s production (which feels more “late Eighties” than grunge) is the primary culprit, and that producer Brendan O’Brien (who joins the band on <i>Vs.</i>) was a savior for the group.</p>\n<p>The gang is vastly more positive about <i>Vs</i>. (1993), an album that looms nearly as large in the legend of early ’90s grunge as <i>Ten </i>and which is approximately twenty times better-sounding and more consistent. Jeff calls this their “classic rock album”: Brendan O’Brien’s crisp production blasts away all of the chintzy reverb heard on <i>Ten</i> and the band comes up with a set of massively catchy, memorable hard-rock tunes. Jeff prefers the remarkably sensitive lyrical conceit of “Daughter” (Vedder writing from the point of view of a young girl) and the hilarity of “Glorified G” — if you’re gonna work political messages into your music, this is the way to do it: with a smile. Scot is all about the titanic chorus of “Dissident” and the propulsiveness of drummer Dave Abbruzzese’s “Go.” And as the gang remarks on how an album with so much cursing on it managed to get flood-the-zone radio airplay, Josh tells the story of trying to convince his dad that Eddie Vedder wasn’t singing exactly what he is actually singing on “Leash” by futilely showing him the CD’s censored lyric sheet.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=_NKeJGUVY88\">Release</a>” (<i>Ten</i>, 1991); “<a href=\"https://www.youtube.com/watch?v=X8iazhzUlZg\">Even Flow (single version)</a>” (A-side of single, originally from <i>Ten, </i>1991); “<a href=\"https://www.youtube.com/watch?v=MS91knuzoOA\">Jeremy</a>” (<i>Ten</i>, 1991); “<a href=\"https://www.youtube.com/watch?v=3MutXUvS37k\">Alive</a>” (<i>Ten</i>, 1991); “<a href=\"https://youtu.be/7z7_NCc_gZY?t=39s\">Once</a>” (<i>Ten</i>, 1991); “<a href=\"https://www.youtube.com/watch?v=uYjM-BuE3Cs\">State Of Love And Trust</a>” (<i>Singles – Original Motion Picture Soundtrack</i>, 1992); “<a href=\"https://www.youtube.com/watch?v=gBt8DnKC1_Y\">Go</a>” (<i>Vs.</i>, 1993); “<a href=\"https://www.youtube.com/watch?v=vR7OWzvf5uM\">Animal</a>” (<i>Vs.</i>, 1993); “<a href=\"https://www.youtube.com/watch?v=4cpJ982JGOo\">Dissident</a>” (<i>Vs.</i>, 1993); “<a href=\"https://www.youtube.com/watch?v=KTl_GAPu1ZY\">Daughter</a>” (<i>Vs.</i>, 1993); “<a href=\"https://www.youtube.com/watch?v=CyPMgPa6RbE\">Glorified G</a>” (<i>Vs.</i>, 1993); “<a href=\"https://www.youtube.com/watch?v=x3pRrMz_Uqk\">Leash</a>” (<i>Vs</i>., 1993); “<a href=\"https://www.youtube.com/watch?v=bf2LDmkzmwo\">Rearviewmirror</a>” (<i>Vs.</i>, 1993)</p>\n<p><b><span>Pearl Jam revolts against their fame and nearly implodes: <i>Vitalogy</i> and </span><i><span>No Code</span><br />\n</i></b>Kurt Cobain’s 1994 suicide not only brought the curtain down on the Grunge Era with shocking immediacy, it forced Pearl Jam to stop short and reevaluate who they were, who they wanted to be, and where they were going. The result was 1994’s perversely compelling <i>Vitalogy</i> (1994), a record famous not merely for being so good but also for simultaneously being <i>so, so terrible</i>. Jeff is fascinated by the Jekyll-and-Hyde personality of <i>Vitalogy</i>; he considers it their first truly great, essential LP because half of its music is among the best this group would ever record…but the <i>other</i> half of the record is mind-bogglingly pungent offal, and quite clearly intentionally so. Everybody needs to hear “Corduroy,” “Not For You,” “Better Man,” “Nothingman,” etc. But this record also features flatulent abominations like “Tremor Christ,” “Satan’s Bed,” a boneheadedly stupid sound collage called “Hey Foxymophandlemama, That’s Me,” and <i>a song where Vedder literally plays an out-of-tune accordion and mumbles about bugs for four minutes. </i>Scot ventures that the band was trying to escape the shackles of their success by putting out such an intentionally compromised record. But the good half of <i>Vitalogy</i> is PJ’s best music: “Corduroy” is arguably the greatest rock song of the entire decade, Scot loves their Husker Du tribute “Spin The Black Circle,” Jeff talks about the emotional power of “Nothingman,” and Josh can’t quite believe that Eddie Vedder had “Better Man” in his back pocket for nearly a decade before finally letting the band record it.</p>\n<p>Perhaps the real problem with <i>Vitalogy</i> was that the band was at war with itself; this was the era where Vedder was forcefully asserting himself as the leader and lead songwriter of a group he had invited to join a mere four years earlier, and it shows up not only in the strangeness of the record but in the songwriting credits, a full 50% of which are his alone. Vedder forced out the band’s drummer Dave Abbruzzese (for buying the wrong car, more or less — not a joke), incited a war with Ticketmaster that was doomed to failure, and forced Pearl Jam to take a hard left-turn into weirdness with their next record, <i>No Code</i> (1996).</p>\n<p>Not that Jeff is complaining, though! He loves <i>No Code</i>, considering it not only Pearl Jam’s most underrated album but also one of their two best. There’s exactly one “classic PJ”-style rocker on <i>No Code</i> (the roaring “Hail, Hail,” which careens through a truly innovative chord progression in its riff/chorus) and the rest is a mixture of eastern-tinged mysticism, tribal beats from new drummer Jack Irons, soft electro-acoustic ballads, and surly, ostentatiously uncommercial punk and hard-rock songs. Lord, is it ever a delight. Jeff cites the entire first half of the album, but particularly salutes “Sometimes” (where PJ flips the script by opening on an ominously soft note), “Who You Are,” and “In My Tree”: four minutes of luminously rapturous catharsis. Scot points to the sequence of “In My Tree,” “Smile” and “Off He Goes” as the linchpin of the album: if you like them, you’ll like this record. Josh remembers radio DJs playing “Who You Are” as the leading single of <i>No Code</i> and making fun of how terrible it was (how little they knew); he suspects Pearl Jam was daring people not to buy this record, which they still did…but tellingly, this was Pearl Jam’s last #1 album during the CD era.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=QulcQ5Afd7I\">Not For You</a>” (<i>Vitalogy</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=T3oMcrqDn_4\">Spin The Black Circle</a>” (<i>Vitalogy</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=FQkgIrfpLw0\">Corduroy</a>” (<i>Vitalogy</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=YQRyhKmkUUE\">Last Exit</a>” (<i>Vitalogy, </i>1994); “<a href=\"https://www.youtube.com/watch?v=xiNpezXV3ck\">Nothingman</a>” (<i>Vitalogy</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=27ztFtLKvuQ\">Better Man</a>” (<i>Vitalogy</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=lWHW3UGMr8s\">Long Road (live from <i>The Concert For Heroes</i>, September 21st, 2001)</a>” (originally from <i>Merkinball EP</i>, 1995); “<a href=\"https://www.youtube.com/watch?v=xIT1xCrn0Co\">Sometimes</a>” (<i>No Code</i>, 1996); “<a href=\"https://www.youtube.com/watch?v=GJnem-10YQQ\">Hail, Hail</a>” (<i>No Code</i>, 1996); “<a href=\"https://www.youtube.com/watch?v=F5s1d1G4Rko\">Off He Goes</a>” (<i>No Code</i>, 1996); “<a href=\"https://www.youtube.com/watch?v=J3TxXJ7PI4I\">Who You Are</a>” (<i>No Code</i>, 1996); “<a href=\"https://www.youtube.com/watch?v=d1EJJkamfVE\">In My Tree</a>” (<i>No Code</i>, 1996)</p>\n<p><b><span>Pearl Jam learn to live with themselves, and with their fame: <i>Yield</i>, <i>Binaural</i> and <i>Riot Act</i></span><br />\n</b>Jack Irons was more than just Pearl Jam’s new drummer; he was also a stabilizing force within the band, a bridge between Vedder and the McCready/Gossard/Ament contingent. Irons got them talking again and helped them establish a modus vivendi. That newfound internal peace shows up immediately on <i>Yield</i> (1998), and it’s telling that all three members of the gang agree: <u>this is their greatest album</u>. Scot, Jeff, and Josh can’t praise <i>Yield</i> enough, as Pearl Jam’s most consistent, effortlessly melodic effort, a record that combines muscular professionalism with a continuing ability to surprise and put a dazzling new spin on an old formula. Scot and Jeff rave about “Faithfull,” a song known only to the band’s fans, as the sine qua non of what made Pearl Jam great during this era: a mesmerizingly assured mid-tempo rock song that starts at a whisper and then raises its energy level until it explodes into a gale-force wall of sound in its chorus. Jeff also singles out “Brain Of J.” as one of the band’s greatest rockers and laughs about how his wife, unfamiliar with the band, immediately recognized “Given To Fly” as Christian Rock worship music by any other name when she first heard it. Josh speaks out in favor of some of <i>Yield</i>‘s more underappreciated songs like “Low Light” and “All Those Yesterdays.”</p>\n<p><i>Binaural</i> (2000) and <i>Riot Act</i> (2002) are records that divide the gang somewhat: Jeff likes both of these records quite a bit, but understands that they are flawed; what he appreciates is that even the songs that don’t work fail to work in interesting ways. Still, he singles out “Light Years” on <i>Binaural</i> as one of Pearl Jam’s most moving ballads. Scot thinks that <i>Binaural</i> is too compromised by failed experiments, but favors “Of The Girl,” as an experiment that works extremely well. Josh’s choice is “Parting Ways.” <i>Riot Act</i>has much the same problem, but it kicks off with one of Jeff’s favorite pieces in the ghostly “Can’t Keep.” Jeff also ruefully admits to enjoying the anti-Dubya philippic “Bu$hleaguer” for the creativity of its music alone and wishes “Thumbing My Way” had closed the record. Scot wonders why “I Am Mine” isn’t more well-loved than it is. Josh is more negative on <i>Riot Act</i> than the others, citing “Get Right” and “Help Help” as being particularly obnoxious.</p>\n<p>Between the discussion of <i>Binaural</i> and <i>Riot Act</i> the gang (and Josh in particular, veteran of countless Pearl Jam concerts) takes time to discuss the band’s live act and their continuing durability to the present day. This was the era where the band actually released every single show from their 2000 and 2003 tours commercially so that fans could get a professionally-recorded souvenir. They also debate which of Pearl Jam’s many drummers was their best.</p>\n<p>“<a href=\"https://www.youtube.com/watch?v=V4FVnDxh3ZM\">Faithfull</a>” (<i>Yield</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=vSJ6jYzDOvs\">Brain Of J.</a>” (<i>Yield</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=M1D1WuVXyrU\">Wishlist</a>” (<i>Yield</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=Thq-eZ0udtA\">No Way</a>” (<i>Yield</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=rfYd03L9SQs\">Given To Fly</a>” (<i>Yield</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=ZLjTLczg6Z4\">In Hiding</a>” (<i>Yield</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=EzFTHs43e6k\">Low Light</a>” (<i>Yield</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=nRK7n61hlp8\">Breakerfall</a>” (<i>Binaural</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=lQkQi4hBcr8\">Of The Girl</a>” (<i>Binaural</i>, 2000); “<a href=\"https://youtu.be/eQfQMGFdAGc?t=5s\">Light Years</a>” (<i>Binaural</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=eiDF0g5OzOU\">Nothing As It Seems</a>” (<i>Binaural</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=Z5Zvad3VNZg\">Insignificance</a>” (<i>Binaural</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=gZwc-U_5V7o\">Parting Ways</a>” (<i>Binaural</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=_2EQuWYpq80\">Can’t Keep</a>” (<i>Riot Act</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=-45K4p7wJSI\">Love Boat Captain</a>” (<i>Riot Act</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=Js2_RrSO1MU\">I Am Mine</a>” (<i>Riot Act</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=flTuypUpkXE\">Thumbing My Way</a>” (<i>Riot Act</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=6y5AVeRqSU4\">Bu$hleaguer</a>” (<i>Riot Act</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=fwqfuFMzSaQ\">All Or None</a>” (<i>Riot Act</i>, 2002)</p>\n<p><b><span>Pearl Jam in the 21st Century: <i>Pearl Jam</i>, <i>Backspacer</i>, and <i>Lightning Bolt</i></span><br />\n</b>The gang’s discussion of Pearl Jam’s last three records keeps returning to this basic point: “huh, these albums are all surprisingly good, aren’t they.” Scot and Jeff in particular hadn’t paid nearly as much attention to PJ’s post-<i>Riot Act</i> era and were deeply surprised to return to these three records in the past week or so and be reminded how unfailingly consistent each one of them is. Jeff thinks <i>Pearl Jam</i> (2006) — usually known as the “Avocado” album because of its front cover image — is probably the weakest of them, but even there “World Wide Suicide” and “Gone” are both superb, and Josh rates “Inside Job” especially highly as perhaps the band’s finest album-closer. Jeff appreciates the brevity of <i>Backspacer</i> (2009), a 37 minute album from a band notorious for their inability to edit themselves, and Scot singles out the buoyant surfing-as-zen anthem “Amongst The Waves” and the likely unwitting Donald Rumsfeld tribute of “Unthought Known.” Really, Jeff argues, the only problem with Pearl Jam’s post-2002 material is that it lacks any real sense of risk: the extended time they now have to put these records together means that no howlers slip through, but that the sort of pressure that can churn up “Can’t Keep” or “Faithfull” isn’t on them, either.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=lpqhmCcZ5eA\">World Wide Suicide</a>” (<i>Pearl Jam</i>, 2006); “<a href=\"https://www.youtube.com/watch?v=T9iQXhGha90\">Gone</a>” (<i>Pearl Jam</i>, 2006); “<a href=\"https://www.youtube.com/watch?v=_t8tnfrYEOw\">Inside Job</a>” (<i>Pearl Jam</i>, 2006); “<a href=\"https://www.youtube.com/watch?v=1Q9lx-93eLM\">Johnny Guitar</a>” (<i>Backspacer</i>, 2009); “<a href=\"https://www.youtube.com/watch?v=jhEh_kjNFVs\">Amongst The Waves</a>” (<i>Backspacer</i>, 2009); “<a href=\"https://www.youtube.com/watch?v=cjPD1K8wf0M\">Unthought Known</a>” (<i>Backspacer</i>, 2009); “<a href=\"https://www.youtube.com/watch?v=ITsPLax86gs\">Sirens</a>” (<i>Lightning Bolt</i>, 2013); “<a href=\"https://www.youtube.com/watch?v=w4dbVCI82rU\">Lightning Bolt</a>” (<i>Lightning Bolt</i>, 2013); “<a href=\"https://www.youtube.com/watch?v=7Le2XF5sivM\">Infallible</a>” (<i>Lightning Bolt</i>, 2013); “<a href=\"https://www.youtube.com/watch?v=aT6uraMzXV0\">Sleeping By Myself</a>” (<i>Lightning Bolt</i>, 2013); “<a href=\"https://www.youtube.com/watch?v=yMVZVwWLmNk\">Yellow Ledbetter</a>” (B-side of “Jeremy,” 1992)</p>\n<p><b><span>Finale</span><br />\n</b>Josh, Scot and Jeff each name their two key albums and five key songs from Pearl Jam.</p>\n",
  "pubDate": "Mon, 11 Dec 2017 07:28:05 +0000",
  "author": "studio@nationalreview.com (National Review)",
  "link": "https://www.nationalreview.com/media/political-beats",
  "content:encoded": "<p>Scot and Jeff talk to Josh Jordan about Pearl Jam.</p>\n<p><b><span>Introducing the Band</span><br />\n</b>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\" target=\"_blank\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\" target=\"_blank\">@EsotericCD</a>) with guest Josh Jordan, writer for various outlets. Follow Josh on Twitter at <a href=\"https://twitter.com/NumbersMuncher\">@NumbersMuncher</a>.</p>\n<p><span><b>Josh’s Musical Pick: Pearl Jam</b></span><b><br />\n</b>Break out the flannels — it’s time for the gang to tackle a long overdue episode on Pearl Jam, the most durable (and arguably best — sorry, Nirvana fans) band of the famed Seattle grunge era of the ’90s. But Pearl Jam were so much more than just a “grunge” act, and have remained consistently great (as well as a legendarily top-shelf live act with a fanatical cult-like following) all the way up to the present day. Josh is almost a ‘ringer’ of sorts — a bona-fide megafan who has been to over 70 Pearl Jam shows since the mid-’90s. Josh talks about how he, like most people whose adolescence came during the early Nineties, got into Pearl Jam at the jump via <i>Ten </i>and immediately started using Eddie Vedder’s “poetry” in middle school English class. Jeff was of a similar vintage, but his fandom was interrupted: he fell off after <i>Vitalogy</i> when he discovered The Beatles and classic rock in high school, and only returned to them years later thanks to the fortuitous purchase of the well-curated compilation <i>Rearviewmirror.</i></p>\n<p><span><b><i>Ten, Vs.</i>, and Pearl Jam’s role in the Seattle grunge scene<br />\n</b></span>Scot quickly covers the origin story of Pearl Jam: Seattle act Mother Love Bone collapses when its lead singer Andrew Wood dies of an overdose, surviving members Jeff Ament (bass) and Stone Gossard (rhythm guitar) recruit hugely talented lead guitarist Mike McCready into the fold, and a demo tape from San Diego-based sensitive surfer bro Eddie Vedder finds its way into their hands. Vedder was brought into the band just in time to add lyrics and lead vocals to a series of songs already written by Gossard and Ament, the result was <i>Ten</i> (1991) and the rest is history.</p>\n<p>Perhaps surprisingly, the gang isn’t particularly enthusiastic about <i>Ten</i>, which most casual fans regard as Pearl Jam’s greatest album (it is certainly their most famous, one that nationally defined the sound of the grunge revolution). Jeff violently hates its quasi-hair metal anthems (even “Even Flow,” a great song, sounds like sludge on the record). He considers “Black” to be faux-sensitive tripe and is authentically offended by the terribleness of “Deep,” though he relents when it comes to “Jeremy” and the straight ahead dash of “Once.” Scot isn’t much more complimentary, noting that so much of PJ’s music is compulsively listenable but he never feels the need to return to <i>Ten</i>. Even Josh isn’t an enormous fan, though he defends many of these songs as live juggernauts (particularly “Release” and “Porch”). Josh notes that the album’s production (which feels more “late Eighties” than grunge) is the primary culprit, and that producer Brendan O’Brien (who joins the band on <i>Vs.</i>) was a savior for the group.</p>\n<p>The gang is vastly more positive about <i>Vs</i>. (1993), an album that looms nearly as large in the legend of early ’90s grunge as <i>Ten </i>and which is approximately twenty times better-sounding and more consistent. Jeff calls this their “classic rock album”: Brendan O’Brien’s crisp production blasts away all of the chintzy reverb heard on <i>Ten</i> and the band comes up with a set of massively catchy, memorable hard-rock tunes. Jeff prefers the remarkably sensitive lyrical conceit of “Daughter” (Vedder writing from the point of view of a young girl) and the hilarity of “Glorified G” — if you’re gonna work political messages into your music, this is the way to do it: with a smile. Scot is all about the titanic chorus of “Dissident” and the propulsiveness of drummer Dave Abbruzzese’s “Go.” And as the gang remarks on how an album with so much cursing on it managed to get flood-the-zone radio airplay, Josh tells the story of trying to convince his dad that Eddie Vedder wasn’t singing exactly what he is actually singing on “Leash” by futilely showing him the CD’s censored lyric sheet.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=_NKeJGUVY88\">Release</a>” (<i>Ten</i>, 1991); “<a href=\"https://www.youtube.com/watch?v=X8iazhzUlZg\">Even Flow (single version)</a>” (A-side of single, originally from <i>Ten, </i>1991); “<a href=\"https://www.youtube.com/watch?v=MS91knuzoOA\">Jeremy</a>” (<i>Ten</i>, 1991); “<a href=\"https://www.youtube.com/watch?v=3MutXUvS37k\">Alive</a>” (<i>Ten</i>, 1991); “<a href=\"https://youtu.be/7z7_NCc_gZY?t=39s\">Once</a>” (<i>Ten</i>, 1991); “<a href=\"https://www.youtube.com/watch?v=uYjM-BuE3Cs\">State Of Love And Trust</a>” (<i>Singles – Original Motion Picture Soundtrack</i>, 1992); “<a href=\"https://www.youtube.com/watch?v=gBt8DnKC1_Y\">Go</a>” (<i>Vs.</i>, 1993); “<a href=\"https://www.youtube.com/watch?v=vR7OWzvf5uM\">Animal</a>” (<i>Vs.</i>, 1993); “<a href=\"https://www.youtube.com/watch?v=4cpJ982JGOo\">Dissident</a>” (<i>Vs.</i>, 1993); “<a href=\"https://www.youtube.com/watch?v=KTl_GAPu1ZY\">Daughter</a>” (<i>Vs.</i>, 1993); “<a href=\"https://www.youtube.com/watch?v=CyPMgPa6RbE\">Glorified G</a>” (<i>Vs.</i>, 1993); “<a href=\"https://www.youtube.com/watch?v=x3pRrMz_Uqk\">Leash</a>” (<i>Vs</i>., 1993); “<a href=\"https://www.youtube.com/watch?v=bf2LDmkzmwo\">Rearviewmirror</a>” (<i>Vs.</i>, 1993)</p>\n<p><b><span>Pearl Jam revolts against their fame and nearly implodes: <i>Vitalogy</i> and </span><i><span>No Code</span><br />\n</i></b>Kurt Cobain’s 1994 suicide not only brought the curtain down on the Grunge Era with shocking immediacy, it forced Pearl Jam to stop short and reevaluate who they were, who they wanted to be, and where they were going. The result was 1994’s perversely compelling <i>Vitalogy</i> (1994), a record famous not merely for being so good but also for simultaneously being <i>so, so terrible</i>. Jeff is fascinated by the Jekyll-and-Hyde personality of <i>Vitalogy</i>; he considers it their first truly great, essential LP because half of its music is among the best this group would ever record…but the <i>other</i> half of the record is mind-bogglingly pungent offal, and quite clearly intentionally so. Everybody needs to hear “Corduroy,” “Not For You,” “Better Man,” “Nothingman,” etc. But this record also features flatulent abominations like “Tremor Christ,” “Satan’s Bed,” a boneheadedly stupid sound collage called “Hey Foxymophandlemama, That’s Me,” and <i>a song where Vedder literally plays an out-of-tune accordion and mumbles about bugs for four minutes. </i>Scot ventures that the band was trying to escape the shackles of their success by putting out such an intentionally compromised record. But the good half of <i>Vitalogy</i> is PJ’s best music: “Corduroy” is arguably the greatest rock song of the entire decade, Scot loves their Husker Du tribute “Spin The Black Circle,” Jeff talks about the emotional power of “Nothingman,” and Josh can’t quite believe that Eddie Vedder had “Better Man” in his back pocket for nearly a decade before finally letting the band record it.</p>\n<p>Perhaps the real problem with <i>Vitalogy</i> was that the band was at war with itself; this was the era where Vedder was forcefully asserting himself as the leader and lead songwriter of a group he had invited to join a mere four years earlier, and it shows up not only in the strangeness of the record but in the songwriting credits, a full 50% of which are his alone. Vedder forced out the band’s drummer Dave Abbruzzese (for buying the wrong car, more or less — not a joke), incited a war with Ticketmaster that was doomed to failure, and forced Pearl Jam to take a hard left-turn into weirdness with their next record, <i>No Code</i> (1996).</p>\n<p>Not that Jeff is complaining, though! He loves <i>No Code</i>, considering it not only Pearl Jam’s most underrated album but also one of their two best. There’s exactly one “classic PJ”-style rocker on <i>No Code</i> (the roaring “Hail, Hail,” which careens through a truly innovative chord progression in its riff/chorus) and the rest is a mixture of eastern-tinged mysticism, tribal beats from new drummer Jack Irons, soft electro-acoustic ballads, and surly, ostentatiously uncommercial punk and hard-rock songs. Lord, is it ever a delight. Jeff cites the entire first half of the album, but particularly salutes “Sometimes” (where PJ flips the script by opening on an ominously soft note), “Who You Are,” and “In My Tree”: four minutes of luminously rapturous catharsis. Scot points to the sequence of “In My Tree,” “Smile” and “Off He Goes” as the linchpin of the album: if you like them, you’ll like this record. Josh remembers radio DJs playing “Who You Are” as the leading single of <i>No Code</i> and making fun of how terrible it was (how little they knew); he suspects Pearl Jam was daring people not to buy this record, which they still did…but tellingly, this was Pearl Jam’s last #1 album during the CD era.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=QulcQ5Afd7I\">Not For You</a>” (<i>Vitalogy</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=T3oMcrqDn_4\">Spin The Black Circle</a>” (<i>Vitalogy</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=FQkgIrfpLw0\">Corduroy</a>” (<i>Vitalogy</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=YQRyhKmkUUE\">Last Exit</a>” (<i>Vitalogy, </i>1994); “<a href=\"https://www.youtube.com/watch?v=xiNpezXV3ck\">Nothingman</a>” (<i>Vitalogy</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=27ztFtLKvuQ\">Better Man</a>” (<i>Vitalogy</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=lWHW3UGMr8s\">Long Road (live from <i>The Concert For Heroes</i>, September 21st, 2001)</a>” (originally from <i>Merkinball EP</i>, 1995); “<a href=\"https://www.youtube.com/watch?v=xIT1xCrn0Co\">Sometimes</a>” (<i>No Code</i>, 1996); “<a href=\"https://www.youtube.com/watch?v=GJnem-10YQQ\">Hail, Hail</a>” (<i>No Code</i>, 1996); “<a href=\"https://www.youtube.com/watch?v=F5s1d1G4Rko\">Off He Goes</a>” (<i>No Code</i>, 1996); “<a href=\"https://www.youtube.com/watch?v=J3TxXJ7PI4I\">Who You Are</a>” (<i>No Code</i>, 1996); “<a href=\"https://www.youtube.com/watch?v=d1EJJkamfVE\">In My Tree</a>” (<i>No Code</i>, 1996)</p>\n<p><b><span>Pearl Jam learn to live with themselves, and with their fame: <i>Yield</i>, <i>Binaural</i> and <i>Riot Act</i></span><br />\n</b>Jack Irons was more than just Pearl Jam’s new drummer; he was also a stabilizing force within the band, a bridge between Vedder and the McCready/Gossard/Ament contingent. Irons got them talking again and helped them establish a modus vivendi. That newfound internal peace shows up immediately on <i>Yield</i> (1998), and it’s telling that all three members of the gang agree: <u>this is their greatest album</u>. Scot, Jeff, and Josh can’t praise <i>Yield</i> enough, as Pearl Jam’s most consistent, effortlessly melodic effort, a record that combines muscular professionalism with a continuing ability to surprise and put a dazzling new spin on an old formula. Scot and Jeff rave about “Faithfull,” a song known only to the band’s fans, as the sine qua non of what made Pearl Jam great during this era: a mesmerizingly assured mid-tempo rock song that starts at a whisper and then raises its energy level until it explodes into a gale-force wall of sound in its chorus. Jeff also singles out “Brain Of J.” as one of the band’s greatest rockers and laughs about how his wife, unfamiliar with the band, immediately recognized “Given To Fly” as Christian Rock worship music by any other name when she first heard it. Josh speaks out in favor of some of <i>Yield</i>‘s more underappreciated songs like “Low Light” and “All Those Yesterdays.”</p>\n<p><i>Binaural</i> (2000) and <i>Riot Act</i> (2002) are records that divide the gang somewhat: Jeff likes both of these records quite a bit, but understands that they are flawed; what he appreciates is that even the songs that don’t work fail to work in interesting ways. Still, he singles out “Light Years” on <i>Binaural</i> as one of Pearl Jam’s most moving ballads. Scot thinks that <i>Binaural</i> is too compromised by failed experiments, but favors “Of The Girl,” as an experiment that works extremely well. Josh’s choice is “Parting Ways.” <i>Riot Act</i>has much the same problem, but it kicks off with one of Jeff’s favorite pieces in the ghostly “Can’t Keep.” Jeff also ruefully admits to enjoying the anti-Dubya philippic “Bu$hleaguer” for the creativity of its music alone and wishes “Thumbing My Way” had closed the record. Scot wonders why “I Am Mine” isn’t more well-loved than it is. Josh is more negative on <i>Riot Act</i> than the others, citing “Get Right” and “Help Help” as being particularly obnoxious.</p>\n<p>Between the discussion of <i>Binaural</i> and <i>Riot Act</i> the gang (and Josh in particular, veteran of countless Pearl Jam concerts) takes time to discuss the band’s live act and their continuing durability to the present day. This was the era where the band actually released every single show from their 2000 and 2003 tours commercially so that fans could get a professionally-recorded souvenir. They also debate which of Pearl Jam’s many drummers was their best.</p>\n<p>“<a href=\"https://www.youtube.com/watch?v=V4FVnDxh3ZM\">Faithfull</a>” (<i>Yield</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=vSJ6jYzDOvs\">Brain Of J.</a>” (<i>Yield</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=M1D1WuVXyrU\">Wishlist</a>” (<i>Yield</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=Thq-eZ0udtA\">No Way</a>” (<i>Yield</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=rfYd03L9SQs\">Given To Fly</a>” (<i>Yield</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=ZLjTLczg6Z4\">In Hiding</a>” (<i>Yield</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=EzFTHs43e6k\">Low Light</a>” (<i>Yield</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=nRK7n61hlp8\">Breakerfall</a>” (<i>Binaural</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=lQkQi4hBcr8\">Of The Girl</a>” (<i>Binaural</i>, 2000); “<a href=\"https://youtu.be/eQfQMGFdAGc?t=5s\">Light Years</a>” (<i>Binaural</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=eiDF0g5OzOU\">Nothing As It Seems</a>” (<i>Binaural</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=Z5Zvad3VNZg\">Insignificance</a>” (<i>Binaural</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=gZwc-U_5V7o\">Parting Ways</a>” (<i>Binaural</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=_2EQuWYpq80\">Can’t Keep</a>” (<i>Riot Act</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=-45K4p7wJSI\">Love Boat Captain</a>” (<i>Riot Act</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=Js2_RrSO1MU\">I Am Mine</a>” (<i>Riot Act</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=flTuypUpkXE\">Thumbing My Way</a>” (<i>Riot Act</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=6y5AVeRqSU4\">Bu$hleaguer</a>” (<i>Riot Act</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=fwqfuFMzSaQ\">All Or None</a>” (<i>Riot Act</i>, 2002)</p>\n<p><b><span>Pearl Jam in the 21st Century: <i>Pearl Jam</i>, <i>Backspacer</i>, and <i>Lightning Bolt</i></span><br />\n</b>The gang’s discussion of Pearl Jam’s last three records keeps returning to this basic point: “huh, these albums are all surprisingly good, aren’t they.” Scot and Jeff in particular hadn’t paid nearly as much attention to PJ’s post-<i>Riot Act</i> era and were deeply surprised to return to these three records in the past week or so and be reminded how unfailingly consistent each one of them is. Jeff thinks <i>Pearl Jam</i> (2006) — usually known as the “Avocado” album because of its front cover image — is probably the weakest of them, but even there “World Wide Suicide” and “Gone” are both superb, and Josh rates “Inside Job” especially highly as perhaps the band’s finest album-closer. Jeff appreciates the brevity of <i>Backspacer</i> (2009), a 37 minute album from a band notorious for their inability to edit themselves, and Scot singles out the buoyant surfing-as-zen anthem “Amongst The Waves” and the likely unwitting Donald Rumsfeld tribute of “Unthought Known.” Really, Jeff argues, the only problem with Pearl Jam’s post-2002 material is that it lacks any real sense of risk: the extended time they now have to put these records together means that no howlers slip through, but that the sort of pressure that can churn up “Can’t Keep” or “Faithfull” isn’t on them, either.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=lpqhmCcZ5eA\">World Wide Suicide</a>” (<i>Pearl Jam</i>, 2006); “<a href=\"https://www.youtube.com/watch?v=T9iQXhGha90\">Gone</a>” (<i>Pearl Jam</i>, 2006); “<a href=\"https://www.youtube.com/watch?v=_t8tnfrYEOw\">Inside Job</a>” (<i>Pearl Jam</i>, 2006); “<a href=\"https://www.youtube.com/watch?v=1Q9lx-93eLM\">Johnny Guitar</a>” (<i>Backspacer</i>, 2009); “<a href=\"https://www.youtube.com/watch?v=jhEh_kjNFVs\">Amongst The Waves</a>” (<i>Backspacer</i>, 2009); “<a href=\"https://www.youtube.com/watch?v=cjPD1K8wf0M\">Unthought Known</a>” (<i>Backspacer</i>, 2009); “<a href=\"https://www.youtube.com/watch?v=ITsPLax86gs\">Sirens</a>” (<i>Lightning Bolt</i>, 2013); “<a href=\"https://www.youtube.com/watch?v=w4dbVCI82rU\">Lightning Bolt</a>” (<i>Lightning Bolt</i>, 2013); “<a href=\"https://www.youtube.com/watch?v=7Le2XF5sivM\">Infallible</a>” (<i>Lightning Bolt</i>, 2013); “<a href=\"https://www.youtube.com/watch?v=aT6uraMzXV0\">Sleeping By Myself</a>” (<i>Lightning Bolt</i>, 2013); “<a href=\"https://www.youtube.com/watch?v=yMVZVwWLmNk\">Yellow Ledbetter</a>” (B-side of “Jeremy,” 1992)</p>\n<p><b><span>Finale</span><br />\n</b>Josh, Scot and Jeff each name their two key albums and five key songs from Pearl Jam.</p>\n",
  "enclosure": "",
  "itunes:title": "Episode 16: Josh Jordan / Pearl Jam",
  "itunes:author": "National Review",
  "itunes:duration": "02:23:14",
  "itunes:summary": "Scot and Jeff talk to Josh Jordan about Pearl Jam.",
  "itunes:subtitle": "Scot and Jeff talk to Josh Jordan about Pearl Jam.",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:episode": 16
}