{
  "itunes:episode": 35,
  "title": "Outstanding in His Depth of Field with Adam Lisagor",
  "pubDate": "Thu, 08 Aug 2013 18:57:00 +0000",
  "link": "http://newdisrupt.org/blog/2013/8/8/episode-35-outstanding-in-his-depth-of-field-with-adam-lisagor",
  "description": "<p><a href=\"http://lonelysandwich.com/\">Adam Lisagor</a> didn't set out to be the face of app advertising, but his acting and directing style mesh perfectly with the zeitgeist. It's a bit of irony without the snark. It's charming, straightforward, quiet, and informative. You've almost certainly seen his work repeatedly, and once you follow this link to <a href=\"http://sandwichvideo.com/\">Sandwich Video</a> and watch some of his studio's work, you'll be able to recognize his work from now on. From his first video to promote an app he was co-developing to the massive amount of work done since, Adam has defined a style that others now aspire to. But this wasn't a plan. We'll talk about how he got here. (Adam is on <a href=\"https://twitter.com/lonelysandwich\">Twitter</a> and <a>App.net</a>.)</p>",
  "guid": "tag:soundcloud,2010:tracks/104504879",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "01:09:42",
  "itunes:subtitle": "Adam Lisagor didn't set out to be the face of app advertising",
  "itunes:summary": "Adam Lisagor didn't set out to be the face of app advertising, but his acting and directing style mesh perfectly with the zeitgeist. It's a bit of irony without the snark. It's charming, straightforward, quiet, and informative. You've almost certainly seen his work repeatedly, and once you follow this link to Sandwich Video and watch some of his studio's work, you'll be able to recognize his work from now on. From his first video to promote an app he was co-developing to the massive amount of work done since, Adam has defined a style that others now aspire to. But this wasn't a plan. We'll talk about how he got here."
}