{
  "title": "Can Alt-Fuel Credits Accelerate EV Adoption?",
  "link": "https://spectrum.ieee.org/evs-boost-renewables-program",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/car-sitting-in-a-parking-lot.jpg?id=31999276&width=1200&height=800&coordinates=0%2C104%2C0%2C105\"/><br/><br/><p>The United States is home to the world’s largest biofuel program. For the past decade and a half, the U.S. government has mandated that the country’s government-operated planes, trains, and automobiles run on a fuel blend partly made from corn- and soybean-based biofuels.<br/></p><p>It’s a program with decidedly mixed results. Now, it might get a breath of new life. </p><p>Earlier this month, Reuters <a href=\"https://www.reuters.com/business/autos-transportation/exclusive-us-epa-expected-propose-electric-cars-be-eligible-renewable-fuel-2022-10-05/\" rel=\"noopener noreferrer\" target=\"_blank\">reported</a> that the program could be expanded to provide power for charging electric vehicles. It would be the biggest change in the history of a program that has, in part, failed to live up to its designers’ ambitious dreams.</p><p>In one way, the program in question—the Renewable Fuel Standard (RFS)—is a relic from a bygone era. U.S. lawmakers established the RFS in 2005 and expanded it in 2007, well before solar panels, wind turbines, and electric vehicles became the stalwarts of decarbonization they are today.</p><p>The RFS, in essence, mandated that the blend powering engines in the nation’s official service vehicles run on a certain amount of renewable fuel. Petroleum refiners have to put a certain amount of renewable fuel—such as ethanol derived from corn or cellulose—into the U.S. supply. If a refiner couldn’t manage it, it could buy credits, called Renewable Identification Numbers (RINs), from a supplier that did.</p><p>From 2006, the RFS set a schedule of yearly obligations through 2022, with annually rising RIN targets. The long-term targets were more ambitious than the actual amount of biofuel the U.S. ever actually produced. (It didn’t help that fossil fuel producers <a href=\"https://www.reuters.com/markets/commodities/what-is-stake-us-biofuel-blending-law-2022-beyond-2022-01-11/\" rel=\"noopener noreferrer\" target=\"_blank\">fought</a> tooth and nail to reduce their obligations. Meanwhile, agriculture-industry lobbyists <a href=\"https://www.reuters.com/article/us-usa-biofuels/trump-epa-finalizes-2020-biofuel-rule-corn-lobby-objects-idUSKBN1YN20M\" rel=\"noopener noreferrer\" target=\"_blank\">fought</a> just as hard against those reductions.) </p><p>By the mid-2010s, the U.S. Environmental Protection Agency, which stewards the RFS, had repeatedly downsized the targets by nearly 25 percent. In 2016, a U.S. government report <a href=\"https://www.gao.gov/assets/gao-17-94.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">stated</a>, quite bluntly, that “it is unlikely that the goals of the RFS will be met as envisioned.” A more recent study <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8892349/\" rel=\"noopener noreferrer\" target=\"_blank\">found</a> that, since the program coaxed farmers into using more land for corn cultivation, RFS biofuel wasn’t actually any less carbon-intensive than gasoline.</p><p>Now, it is 2022. Amidst a backdrop of rising fuel prices, the Biden administration might bring the RFS its greatest shakeup yet.</p><p>The proposed changes aren’t set in stone. The EPA is under orders to propose a 2023 mandate by 16 November. Any electric vehicle add-on would likely debut by then. Reuters <a href=\"https://www.reuters.com/business/environment/biden-administration-leans-tesla-guidance-renewable-fuel-policy-reform-2022-06-23/\" rel=\"noopener noreferrer\" target=\"_blank\">previously reported</a> that the Biden administration has reached out to electric vehicle maker Tesla to collaborate on crafting the mandates.</p><p>The changes might bolster the RFS with a new type of credit, an “e-RIN,” which would mark an amount of energy used for charging electric vehicles. The changes might nudge the RFS away from corn and oil: Car-charging companies and power-plant biogas suppliers might become eligible, too.</p><p>It wouldn’t be this administration’s first attempt at boosting electric vehicles. While California <a href=\"https://www.automotiveworld.com/articles/what-does-californias-ice-ban-mean-for-the-us/\" rel=\"noopener noreferrer\" target=\"_blank\">leads</a> state governments in slating a 2035 target for ending most internal combustion vehicle sales, the federal government’s ambitious Inflation Reduction Act allocated funds for tax credits on electric vehicles. That plan, however, has proven contentious due to an asterisk: A $7,500-per-vehicle credit would apply only to cars for which most battery material and components come from North America.</p><p>Many analysts <a href=\"https://www.csis.org/analysis/ira-and-ev-tax-credits%E2%80%94can-we-kill-multiple-birds-one-stone-0\" rel=\"noopener noreferrer\" target=\"_blank\">believe</a> that the plan could actually slow electric vehicle take-up rather than accelerate it. And although the plan seeks to reduce U.S. electric-vehicle supply chains’ reliance on Chinese rare earths and battery components, U.S.-friendly governments in Europe, Japan, and South Korea <a href=\"https://www.csis.org/analysis/ira-and-ev-tax-credits%E2%80%94can-we-kill-multiple-birds-one-stone-0\" rel=\"noopener noreferrer\" target=\"_blank\">have criticized</a> the plan for purportedly discriminating against non-U.S. vehicles, potentially breaching World Trade Organisation rules.</p><p>Nunes says it’s currently unclear whether federal government action via a fuel standard would be more effective than direct investment. It’s not the only question with an answer that is still in flux. </p><p>“How much cleaner are electric vehicles relative to internal combustion engines that are powered by fuels that fall under the RFS?” says Nunes. “Because that’s really the comparison that you care about.”</p><p>What that means is that any electric vehicle standard will only be as carbon-free as the supply chains that go into making the vehicles and the electrical grid from which they draw power; and that puts the pressure on governments, electricity providers, and consumers alike to decarbonize the grid.</p><p>Meanwhile, in a future U.S. where electric vehicles come to dominate the roads, sidelining internal combustion engines and liquefied fuels for good, do biofuels and the RFS’s original purpose still have a place?</p><p>Nunes believes so. “There are certainly areas of the economy where electrification does not make a lot of sense,” he says.</p><p>In the world of aviation, for instance, battery tech hasn’t quite advanced to a point that would make electric flights feasible. “That’s where, I think, using things like sustainable aviation fuels and biofuels, et cetera, makes a lot more sense,” Nunes says.</p>",
  "pubDate": "Tue, 25 Oct 2022 14:00:00 +0000",
  "guid": "https://spectrum.ieee.org/evs-boost-renewables-program",
  "category": [
    "Electric vehicles",
    "Alternative fuels",
    "Alternative energy",
    "Biofuels",
    "Renewable energy"
  ],
  "dc:creator": "Rahul Rao",
  "media:content": ""
}