{
  "title": "Authoritarian Left EXPOSED By Covid!",
  "itunes:title": "Authoritarian Left EXPOSED By Covid!",
  "pubDate": "Fri, 08 Apr 2022 03:03:48 +0000",
  "guid": "f223066c-945f-4122-9c83-0fb40bebcd27",
  "link": "https://thejimmydoreshow.libsyn.com/authoritarian-left-exposed-by-covid",
  "itunes:image": "",
  "description": "<p>Jimmy speaks with John Jay College economics professor Christian Parenti about all the ways the coronavirus pandemic has revealed the authoritarian streak in so-called \"leftists\" in the United States, whether supporting mandates and vaccine passports or paying fealty to corrupt government agencies and the rapacious pharmaceutical industry.<br /> <br /> Plus a segment on how Ukrainian President Zelenskyy could have avoided war but chose to risk a Russian invasion instead.<br /> <br /> Also featuring Stef Zamorano, Aaron Maté and Mike MacRae! And phone calls from Vince Vaughn and David Axelrod!</p>",
  "content:encoded": "<p>Jimmy speaks with John Jay College economics professor Christian Parenti about all the ways the coronavirus pandemic has revealed the authoritarian streak in so-called \"leftists\" in the United States, whether supporting mandates and vaccine passports or paying fealty to corrupt government agencies and the rapacious pharmaceutical industry.  Plus a segment on how Ukrainian President Zelenskyy could have avoided war but chose to risk a Russian invasion instead.  Also featuring Stef Zamorano, Aaron Maté and Mike MacRae! And phone calls from Vince Vaughn and David Axelrod!</p>",
  "enclosure": "",
  "itunes:duration": "01:08:12",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Jimmy speaks with John Jay College economics professor Christian Parenti about all the ways the coronavirus pandemic has revealed the authoritarian streak in so-called \"leftists\" in the United States, whether supporting mandates and vaccine passports...",
  "itunes:episodeType": "full",
  "itunes:summary": "Jimmy speaks with John Jay College economics professor Christian Parenti about all the ways the coronavirus pandemic has revealed the authoritarian streak in so-called \"leftists\" in the United States, whether supporting mandates and vaccine passports or paying fealty to corrupt government agencies and the rapacious pharmaceutical industry. Plus a segment on how Ukrainian President Zelenskyy could have avoided war but chose to risk a Russian invasion instead. Also featuring Stef Zamorano, Aaron Maté and Mike MacRae! And phone calls from Vince Vaughn and David Axelrod!"
}