{
  "title": "Flying Robots 3D-Print Structures in Flight",
  "link": "https://spectrum.ieee.org/drone-3dprint",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/two-drone-flying-in-the-air-one-printing-a-3d-structure.jpg?id=31802792&width=1200&height=800&coordinates=0%2C104%2C0%2C105\"/><br/><br/><p>Flying 3D-printing robots modeled after wasps and birds may one day repair and build structures at remote sites beyond the reach of standard construction teams, a new study finds.<br/></p><p><a href=\"https://spectrum.ieee.org/robotic-construction-platform-creates-large-buildings-on-demand\" target=\"_self\">Construction robots</a> that can 3D-print structures on sites may one day prove faster, safer, and more productive than human teams. However, construction robotics currently focuses mostly on ground-based robots. This approach is limited by the heights a robot can reach, and large-scale systems that require tethering to a power supply are limited in where they can be deployed.</p><p>In the new study, researchers drew inspiration from flying animals that are highly adept at construction. For instance, to incrementally build its nest, a barn swallow can overcome the limited payload it can carry in one flight by typically making some 1,200 trips between where it gets its construction material and its construction site.</p><p class=\"pull-quote\">“When animals want to build something large, they work together in swarms or collectives to do so.”<br/>—Mirko Kovač, Imperial College London</p><p>The new robot fleet the researchers developed, which they call their aerial additive manufacturing system, can collectively and autonomously 3D-print structures while in flight. The fleet consists of two kinds of untethered quadrotor drones—BuilDrones that deposit materials in layers from nozzles, and ScanDrones that use standard optical cameras to continuously map the structures in 3D and monitor their quality.</p><p>“This combination of manufacturing and scanning with flying robots is very new,” says study senior author Mirko Kovač, a roboticist at Imperial College London and at the Swiss Federal Laboratories for Materials Science and Technology in Dübendorf, Switzerland.</p><p>The drones work cooperatively from a single blueprint, adapting to variations in the geometry of the structure in real time as construction progresses. The robots are fully autonomous while flying, but a human supervisor can monitor data from the drones and intervene when necessary.</p><p>A question often asked about this approach is “Can you build something with one drone when one drone can carry relatively little?” Kovač says. The key to this strategy is not just using one drone “but many drones working together, which is what is also seen in the animal kingdom. When animals want to build something large, they work together in swarms or collectives to do so.”</p><p>The researchers developed four different mixtures with which the robots 3D printed. The robots, their software, the materials they build with, and the architecture they end up constructing all need to be designed together, Kovač says, an approach the researchers call “<a href=\"https://www.nature.com/articles/s42256-020-00258-y\" target=\"_blank\">physical artificial intelligence</a>.”</p><p>“We’re not just taking some material and putting it on a robot—the evolution of the material itself can be quite complex, and tailored to being integrable with a robot that has a relatively low payload,” Kovač says.</p><p>In experiments, the drones could manufacture a roughly 2-meter-high, 30-centimeter-wide, 72-layer cylinder from polyurethane insulation foam in 29 minutes. They could also build a 18-cm-high, 33-cm-wide, 28-layer cylinder from a cementlike material in 133 minutes. All in all, they achieved a manufacturing accuracy of 5 millimeters, acceptable within United Kingdom building requirements.</p><p>The scientists note their approach is potentially scalable to large numbers of robots working as a team. Potential applications may include “work at height, or in areas that are inaccessible—for example, facades of buildings, or remote structures that need very fast repair, such as pipelines,” Kovač says. Other potential uses may include construction in hostile locations or after natural disasters, the researchers say.</p><p>“We are now working on case studies with industrial partners to apply our approach to industrial problems,” Kovač says. “We may tailor our drones to one use case or the other—this may include bigger drones, or slightly different designs of drones.”</p><p>Kovač, along with architect Robert Stuart-Smith at University College London and the University of Pennsylvania in Philadelphia and their colleagues, detailed <u><a href=\"https://www.nature.com/articles/s41586-022-04988-4\" target=\"_blank\">their findings</a></u> online 21 September in the journal <em>Nature</em>.</p>",
  "pubDate": "Sun, 25 Sep 2022 21:56:53 +0000",
  "guid": "https://spectrum.ieee.org/drone-3dprint",
  "category": [
    "3d printing",
    "Construction robots",
    "Biomimicry",
    "Biomimetics",
    "Additive manufacturing",
    "Drones"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}