{
  "title": "Episode 20: &#8220;Rock Around the Clock&#8221; by Bill Haley and the Comets",
  "link": "https://500songs.com/podcast/rock-around-the-clock-by-bill-haley-and-the-comets/",
  "pubDate": "Mon, 18 Feb 2019 05:52:41 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/rock-around-the-clock-by-bill-haley-and-the-comets/",
  "description": "Welcome to episode twenty of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Rock Around the Clock\" by Bill Haley and the Comets. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-20-rock-around-the-clock/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nUnfortunately, there aren't many good books about Bill Haley available. There are two biographies which are long out of print -- one by John Swenson which I read as a very small child, and one from the nineties by one of Haley's sons. Another of Haley's sons has a biography due out in April, which might be worthwhile, but until then the only book available is a self-published biography by Otto Fuchs. I relied on <a href=\"https://amzn.to/2T4cIhF\">volume one of Fuchs' book</a> for this post -- it's very good on the facts -- but it suffers from being written by someone whose first language is not English, and it also *badly* needs an editor, so I can't wholly recommend it.\n\n<a href=\"https://amzn.to/2R0zgOn\">This box set</a>, which is ridiculously cheap, contains almost every track anyone could want by Haley and the Comets, and it also includes the Jodimars track I excerpt here. Unfortunately it doesn't contain his great late-fifties singles \"Lean Jean\" and \"Skinny Minnie\", or the 1960s recordings I excerpt here (which are not in print anywhere that I know of) but it has everything else you could want.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a>\n\n<strong>Transcript</strong>\n\nA quick content note for this one – it contains non-explicit mention of infant death, alcoholism, and brain tumours, as well as a quote which uses a word which, while not a slur, is now no longer accepted as a polite term for black people in the way that it was at the time of the quote.\n\nSometimes, the very worst thing that can happen to a musician is for them to have a big hit. A musician who has been doing fine, getting moderate sized hits and making a decent living, suddenly finds themselves selling tens of millions of records. It's what everyone wants, and it's what they've been working up to for their whole career, but what happens then? Is it a fluke? Are they ever going to have another hit as big as the first? How do they top that?\n\nThose problems can be bad enough if your big hit is just a normal big hit. Now imagine that your big hit becomes a marker for a whole generation, that it inspires a musical trend that lasts decades, that it causes actual rioting. Imagine that it's a record that literally everyone in the Western Hemisphere knows, that sixty-five years and counting after its release is still instantly recognisable. When your big hit is *that* big, where do you go from there? What *can* you do next?\n\nFor a while, before leaving Essex Records, Bill Haley had wanted to record a song called \"Rock Around the Clock\". It had been passed to him by Jimmy Myers, one of the song's two credited writers, but for some reason Dave Miller, Haley's producer, didn't want Haley to record it -- to the extent that Haley claimed that a couple of times he'd brought the sheet music into the studio and Miller had ripped it up rather than let him record the song.\n\nAccording to John Swenson's biography of Haley, Miller and Myers knew each other and didn't get on, which might be the case, but it might also just be as simple as \"Rock Around the Clock\" being very derivative. In particular, the lyrics owed more than a little to Wynonie Harris' \"Around the Clock Blues\". Indeed, even the title \"Rock Around the Clock\" had already been used, four years earlier, by Hal Singer:\n\n[excerpt \"Rock Around the Clock\": Hal Singer and Orchestra]\n\nSo, \"Rock Around the Clock\" was an absolutely generic song for its time, and whatever Dave Miller's reasons for not allowing Haley to record it, it wasn't like he was missing out on anything special, was it?\n\nAfter \"Rock the Joint\" and \"Crazy Man Crazy\", Bill Haley was in a position to make a real breakthrough into massive commercial success, but... nothing happened. He released a bunch more singles on Essex, but for some reason they weren't following up on the clear direction he'd set with those singles. Instead he seemed to be flailing around, recording cover versions of recent country hits, or remakes of older songs like \"Chattanooga Choo Choo\". None of his follow-ups to \"Crazy Man Crazy\" did anything at all in the charts, and it looked for a while that he was going to be a one-hit wonder, and getting to number fifteen in the charts was going to be his highest achievement.\n\nBut then, something happened -- Bill Haley quit Essex Records, the label that had led him to become a rockabilly performer in the first place, and signed with Decca. And there his producer was Milt Gabler.\n\nDecca was in an interesting position in 1954, one which listeners to this podcast may not quite appreciate. You might remember that we've mentioned Decca quite a few times over the first few months of this podcast. That's because in the 1940s, Decca was the only major label to sign any of the proto-rock artists we've talked about. In the late forties, Decca had Lucky Millinder, Lionel Hampton, Louis Jordan, the Ink Spots, Ella Fitzgerald, Rosetta Tharpe, Marie Knight, and the Mills Brothers on its roster. It also had a number of country artists who contributed a lot to the hillbilly boogie sound -- people like Ernest Tubb, Red Foley, and more.\n\nBut Decca was the *only* one of the major labels to sign up acts like this. The major labels were, as we've discussed, going mostly for a white middle-class market that wanted Doris Day and Tony Bennett -- not that there's anything wrong with Doris Day or Tony Bennett -- and indeed Decca had plenty of its own acts like that too, and *mostly* dealt in that sort of music.\n\nBut any artist that was working in those styles that *wasn't* signed to Decca had to sign to tiny independent labels. And those independent labels set up their own distribution networks, which went to shops that specialised in the black or hillbilly markets. And so those speciality shops eventually just started buying from the indie distributors, and didn't buy from the major labels at all -- since Decca was the only one they'd been buying from anyway, before the indies came along.\n\nAnd this caused problems for a lot of Decca's artists. The reason that Louis Jordan, say, was so big was that he'd been selling both to the R&B market -- since he was, after all, an R&B artist, and one of the best -- and to the pop market, because he was on a major label. You sell to both those markets, and you'd sell to a *lot* of people -- the casual record buyer market was much larger than the market for speciality genres, while the speciality genre audience was loyal and would buy everything in the styles it liked. But if you were only selling to the Doris Day buyers, and not to the people who liked honking saxophones and went out of their way to buy them, then your honking-saxophone records were not going to do wonderfully in sales.\n\nThis change in the distribution model of records is one of the two reasons that all the artists we talked about in the first few episodes had a catastrophic drop in their sales in the early fifties. We already talked about the other reason in the episode on \"Crazy Man Crazy\", but as a reminder, when the radio stations switched to playing forty-fives, they threw out their old seventy-eights.\n\nThat meant that if you were one of those Decca artists, you simultaneously lost all the radio play for your old singles -- because the radio stations had chucked out their copies -- and stopped having new hits because the distribution model had changed under your feet. And so pretty much all Decca's roster of rhythm and blues or country hitmakers had lost their hit potential, all at the same time.\n\nBut Decca still had Milt Gabler.\n\nWe talked about Milt Gabler right back at the start of this series. He was the one who produced Lionel Hampton's version of \"Flying Home\", the one with the Ilinois Jacquet sax solo, and who produced \"Strange Fruit\" and most of Louis Jordan's records and the Ink Spots' hits. He'd been the one who put Sister Rosetta Tharpe together with pianist Sammy Price. He was largely -- almost solely -- responsible for the difference between Decca's roster and that of the other major labels, and he still wanted to carry on making records in the styles he loved. But to do that, he had to find a way to sell them to the pop audience.\n\nAnd Bill Haley seemed like someone who could appeal to that audience. Indeed, Haley already *had* appealed to that audience once, with \"Crazy Man Crazy\", and if he could do it once he could do it again.\n\nBill Haley's style was not very like most of the music Milt Gabler had been making -- Gabler was, after all, a serious jazz fanatic -- but over recent months Haley's style had been drifting closer and closer to the sort of thing Gabler was doing. In fact, Gabler saw a way to make him even more successful, by pushing the similarity to Louis Jordan, which had already been apparent in some of Haley's earlier records.\n\nAnd so the group were in the studio to record what was intended to be Bill Haley and the Comets' latest hit, \"Thirteen Women And Only One Man In Town\".\n\n[excerpt: Bill Haley \"Thirteen Women\"]\n\nWe haven't talked enough about how much nuclear paranoia was fuelling the popular culture of the early 1950s. Remember, when this record was made, the first atomic bombs had only been dropped eight and a half years earlier, and it had been five years since the Russians had revealed that they, too, had an atom bomb. At the time, everyone was absolutely convinced that a nuclear war between America and Russia was not only likely but inevitable -- yet at the same time the development of nuclear weapons was also something to be proud of -- a great American technological innovation, something that was out of a science fiction film.\n\nBoth of these things were true, more or less, as far as the American popular imagination went, and this led to a very odd sort of cognitive dissonance. And while it's not a good idea to put too much weight on the lyrics of \"Thirteen Women\", which is, after all, just an attempt at having a novelty hit with a Louis Jordan-style song about having thirteen women to oneself, it is notable that it does reflect that ambiguity. The dream the singer has is that the hydrogen bomb has been dropped and left only fourteen people alive in the whole town -- thirteen women plus himself.\n\nNow, one might normally think that that was a devastating, horrific, thought, and that it was a prelude to some sort of Threads-esque story of post-apocalyptic terror. In this case, however, it merely becomes an excuse for a bit of casual sexism, as the thirteen women become Haley's harem and servants, each with their own specified task.\n\nObviously, I'm being a little facetious here. For what it is -- a comedy hillbilly boogie that plays on Haley's genial likeability, “Thirteen Women” is perfectly pleasant, if a little \"of its time\". It's very obviously influenced by Louis Jordan, but that makes sense given that Gabler was Jordan's producer.\n\nIndeed, Gabler was also the one who introduced the H-bomb theme -- the original version of the song, by the blues guitarist Dickie Thompson, makes no mention of the bomb or the dream, just treats it as something that happened to him. And, frankly, Thompson's version is much, much better than Haley's, and has some truly great guitar playing:\n\n[excerpt: Dickie Thompson \"Thirteen Women\"]\n\nBut Thompson's record is absolutely a blues record, in the same style as people like Guitar Slim or Johnny Guitar Watson. Haley's record is very different, and while Thompson's sounds better to modern ears -- or at least to my ears -- Haley's was in a style that was massively popular for the time.\n\nBut it would probably make an unlikely massive hit. And you certainly wouldn't expect its B-side to become that massive hit.\n\nFor the B-side, Haley decided to cut that \"Rock Around the Clock\" song that he'd been offered a year earlier. It might have come back into his mind because, two weeks earlier, another group had released their version of it.\n\nSonny Dae and his Knights were a band from Virginia who had never made a record before -- and who never would again -- but who had a regular radio spot. \"Rock Around the Clock\" was their only recorded legacy, and it might have had a chance at being a hit by them with some proper promotion -- or maybe not, given the... experimental... nature of the intro:\n\n[excerpt Sonny Dae and his Knights: \"Rock Around the Clock\"]\n\nSo the single did very little, and now Sonny Dae and his Knights are a footnote.\n\nBut their release may have reminded Haley of the song, and he recorded his new version in two takes.\n\nBut the interesting thing is that Haley *didn't* record the song as it was written, or as the Knights recorded it. Listen again to the melody that Sonny Dae is singing:\n\n[short excerpt]\n\nNow, let's listen to Bill Haley singing the same bit\n\n[excerpt]\n\nThat's a totally different melody. What Haley has done there is change the melody on the original to a melody that is essentially the standard boogie bassline. But I think there's a specific reason for that.\n\nHank Williams' very first big hit, remember, was a comedy Western swing song called \"Move it on Over\". That song has almost exactly the same melody that Haley is singing for the verse of \"Rock Around the Clock\"\n\n[excerpt of Hank Williams: \"Move it On Over\"]\n\nWe know that Haley knew the song, because he later cut his own version of it, so it's reasonable to assume that this was a very deliberate decision.\n\nWhat Haley and the Comets have done is take the *utterly generic* song \"Rock Around the Clock\", and they've used it as an excuse to hang every bit of every other song that they know could be a hit on -- to create an arrangement that could encapsulate everything about successful music. They kept the basic arrangement and structure they'd worked out for \"Rock the Joint\" right down to Danny Cedrone playing the same solo note-for-note.\n\nCompare \"Rock the Joint\"'s solo\n\n[excerpt]\n\nWith \"Rock Around the Clock\"'s\n\n[excerpt]\n\nFor the beginning, they came up with a stop-start intro that emphasised the word \"rock\":\n\n[excerpt]\n\nAnd then, at the end, they used a variant of the riff ending you'd often get in swing songs like \"Flying Home\", which one strongly suspects was Gabler's idea. The Knights did something similar, but only for a couple of bars, in their badly-thought-out solo section. With the Comets, it's a far more prominent feature of the arrangement. Again, compare \"Flying Home\":\n\n[riff from \"Flying Home\", Benny Goodman]\n\nand \"Rock Around the Clock\":\n\n[riff]\n\nThis was *wildly* experimental. They were trying this stuff, not with any thought to listenability, but to see what worked. It didn't matter, no-one was going to hear it. It was something they knocked out in two takes – and the finished version had to be edited together from both of them, because they didn't have time in the studio to get a decent take down. This was not a record that was destined to have any great success.\n\nAnd, indeed, it didn't.\n\n\"Rock Around the Clock\" made almost no impact on its original release. It charted, but only in the lower reaches of the chart, and didn't really register on the public's consciousness.\n\nBut Haley and his band continued making records in that style, and their next one, a cover of Big Joe Turner's \"Shake, Rattle, and Roll\", did rather better, and started rising up the charts quite well.\n\nTheir version of \"Shake, Rattle, and Roll\" -- a song which we talked about a bit in episode two, if you want to go back and refresh your memory -- was nowhere near as powerful as Turner's had been. It cleaned up parts of the lyric -- though notably not the filthiest lines, presumably because the innuendo in them completely passed both Haley and Gabler by -- and imposed a much more conventional structure on it. But while it was a watered-down version of the original song, it was still potent enough that for those who hadn't heard the original, it was working some sort of magic:\n\n[excerpt: \"Shake, Rattle, and Roll\" by Bill Haley and his Comets]\n\nHaley was a real fan of Turner, and indeed the two men became close friends in later years, and the Comets were Turner's backing band on one sixties album. But he doesn't have the power or gravitas in his vocals that Turner did, and the result is rather lightweight.\n\nHaley's cover was recorded the same week that Turner's version reached number one on the R&B charts, and it's easy to think of this as another \"Sh'Boom\" situation, with a white man making a more radio-friendly version of a black musician's hit. But Haley's version is not just a straight copy -- and not just because of the changes to remove some of the more obviously filthy lines. It's structured differently, and has a whole different feel to it. This feels to me more like Haley recasting things into his own style than him trying to jump on someone else's bandwagon, though it's a more ambiguous case than some.\n\n\"Shake, Rattle, and Roll\" became Bill Haley's biggest hit so far, going top ten in the pop charts, and both Haley's version and Turner's sold a million copies. It looked like Haley was on his way to a reasonable career -- not, perhaps, a massive stardom, but selling a lot of records, and doing well in shows.\n\nBut then everything changed, for Bill Haley and for the world.\n\nIt was only when a film, \"The Blackboard Jungle\", was being made nearly a year after \"Rock Around the Clock\" was recorded, that the track became important.\n\n\"Blackboard Jungle\" was absolutely not a rock and roll film. It was a film about teenagers and rebellion and so on, yes, but in a pivotal scene when a teacher brings his old jazz records in, in order to bond with the kids, and they smash them and play their own, it's not rock and roll they're playing but modern jazz. Stan Kenton is the soundtrack to their rebellion, not anything more rock.\n\nBut in order to make the film up-to-the-minute, the producers of the film borrowed some records from the record collection of Peter Ford, the teenage son of the film's star. They wanted to find out what kind of records teenagers were listening to, and he happened to have a copy of the Bill Haley single.\n\nThey made the decision that this was to be the theme tune to the film, and all of a sudden, everything changed. Everything.\n\nBecause \"The Blackboard Jungle\" was a sensation. Probably the best explanation of what it did, and of what \"Rock Around the Clock\" did as its theme song, is in this quote from Frank Zappa from 1971.\n\n\"In my days of flaming youth I was extremely suspect of any rock music played by white people. The sincerity and emotional intensity of their performances, when they sang about boyfriends and girlfriends and breaking up et cetera, was nowhere when I compared it to my high school negro R&B heroes like Johnny Otis, Howlin' Wolf and Willie Mae Thornton.”\n\n(Again, when Zappa said this, that word was the accepted polite term for black people. Language has evolved since. The quote continues.)\n\n“But then I remember going to see Blackboard Jungle. When the titles flashed up there on the screen, Bill Haley and his Comets started blurching 'One, Two, Three O'Clock, Four O'Clock Rock…' It was the loudest rock sound kids had ever heard at the time. I remember being inspired with awe. In cruddy little teen-age rooms, across America, kids had been huddling around old radios and cheap record players listening to the 'dirty music' of their lifestyle. (\"Go in your room if you wanna listen to that crap…and turn the volume all the way down\".) But in the theatre watching Blackboard Jungle, they couldn't tell you to turn it down. I didn't care if Bill Haley was white or sincere…he was playing the Teen-Age National Anthem, and it was so LOUD I was jumping up and down.\"\n\nThere were reports of riots in the cinemas, with people slicing up seats with knives in a frenzy as the music played.\n\n\"Rock Around the Clock\" went to number one on the pop charts, but it did more than that. It sold, in total, well over twenty-five million copies as a vinyl single, becoming the best-selling vinyl single in history. When counting compilation albums on which it has appeared, the number of copies of the song that have sold must total in the hundreds of millions.\n\nBill Haley and the Comets had become the biggest act in the world, and for the next couple of years, they would tour constantly, playing to hysterical crowds, and appearing in two films -- \"Rock Around the Clock\" and \"Don't Knock the Rock\". They were worldwide superstars, famous at a level beyond anything imaginable before.\n\nBut at the same time that everything was going right for \"Rock Around the Clock\"'s sales, things were going horribly wrong for everything else in Haley's life. Ten days after the session for \"Shake, Rattle, and Roll\", at the end of June 1954, Danny Cedrone, the session guitarist who had played on all Haley's records, and a close friend of Haley, fell down the stairs and broke his neck, dying instantly. At the end of July, Haley's baby daughter died suddenly, of cot death.\n\nAnd... there was no follow-up to \"Rock Around the Clock\". You *can't* follow up anything that big -- there's nothing to follow it up with. And Haley's normal attitude, of scientifically assessing what the kids liked, didn't work any more either. The kids were screaming at *everything*, because he was the biggest star in the world. The next few records all hit the pop charts, and all got in the top twenty or thirty -- they were big hits by most standards, but they weren't \"Rock Around the Clock\" big. And then in 1955, the band's bass player, saxophone player, and drummer quit the band, forming their own group, the Jodimars:\n\n[excerpt: the Jodimars: \"Well Now Dig This\"]\n\nHaley soldiered on, however, and the new lineup of the band had another top ten hit in December 1955 -- their first in over a year -- with \"See You Later Alligator\":\n\n[excerpt: Bill Haley and the Comets \"See You Later, Alligator\"]\n\nWhile that was no \"Rock Around the Clock\", it did sell a million copies. But it was a false dawn. The singles after that made the lower reaches of the top thirty, and then the lower reaches of the top one hundred, and then stopped charting altogether. They had one final top thirty hit in 1958, with the rather fabulous \"Skinny Minnie\":\n\n[excerpt: Bill Haley and the Comets \"Skinny Minnie\"]\n\nThat's an obvious attempt to copy Larry Williams' \"Bony Moronie\", but also, it's a really good record. But the follow-up, \"Lean Jean\", only reached number sixty, and that was it for Bill Haley and the Comets on the US charts.\n\nAnd that's usually where people leave the story, assuming Haley was a total failure after this, but that shows the America-centric nature of most rock criticism. In fact, Bill Haley moved to Mexico in 1960.\n\nThe IRS were after Haley's money, and he found that he could make money from a Mexican record label, and if it stayed in Mexico, he didn't have to give his new income to them. He was going through a divorce, and he'd met a Mexican woman who was to become his third wife, and so it just made sense for him to move.\n\nAnd in Mexico, Bill Haley became king of the Twist:\n\n[excerpt: Bill Haley y sus Cometas, \"Florida Twist\"]\n\n\"Florida Twist\" went to number one in Mexico, as did the album of the same name. Indeed, \"Florida Twist\", by Bill Haley y sus Cometas, became the biggest-selling single ever up to that point in Mexico. The Comets had their own TV show in Mexico, Orfeón a Go-Go, and made three Spanish-language films in the sixties. They had a string of hits there, and Mexico wasn't the only place they were having hits. Their \"Chick Safari\" went to number one in India. A warning before this bit... it's got a bit of the comedy racism that you would find at the time in too many records:\n\n[excerpt \"Chick Safari\", Bill Haley and the Comets]\n\nAnd even after his success as a recording artist finally dried up -- in the late sixties, not the late fifties like most articles on him assume, Haley and the Comets were still a huge live draw across the world. At a rock revival show in the late sixties at Madison Square Garden, Haley got an eight-and-a-half-minute standing ovation before playing a song. He played Wembley Stadium in 1972 and the Royal Variety Performance in 1979.\n\nHaley's last few years weren't happy ones -- he started behaving erratically shortly after Rudy Pompili, his best friend and saxophone player for over twenty years, died in 1976. He gave up performing for a couple of years -- he and Pompilli had always said that if one of them died the other one wouldn't carry on -- and when he came back, he seemed to be behaving oddly and people usually put this down to his alcoholism, and blame *that* on his resentment at his so-called lack of success -- forgetting that he had a brain tumour, and that just perhaps that might have led to some of the erraticness.\n\nBut people let that cast a shadow back over his career, and let his appearance -- a bit fat, not in the first flush of youth -- convince them that because he didn't fit with later standards of cool, he was \"forgotten\" and \"overlooked\".\n\nBill Haley died in 1981, just over a year after touring Britain and playing the Royal Variety Performance -- a televised event which would regularly get upwards of twenty million viewers. I haven't been able to find the figures for the 1979 show, but the Royal Variety Performance regularly hit the top of the ratings for the *year* in the seventies and eighties. Bill Haley was gone, yes, but he hadn't been forgotten. And as long as “Rock Around the Clock” is played, he won't be.\n\n[excerpt: \"See You Later Alligator\" -- \"so long, that's all goodbye\"]",
  "itunes:subtitle": "Welcome to episode twenty of A History of Rock Music in Five Hundred Songs. Today were looking at Rock Around the Clock by Bill Haley and the Comets. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n",
  "itunes:keywords": "Big Joe turner,Bill Haley,Dave Miller,Decca Records,Frank Zappa,Hank Williams,hillbilly boogie,Louis Jordan,Milt Gabler,nuclear war,riffs,the Twist,white cover versions",
  "itunes:episodeType": "full",
  "itunes:episode": 20,
  "content:encoded": "Welcome to episode twenty of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Rock Around the Clock\" by Bill Haley and the Comets. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-20-rock-around-the-clock/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nUnfortunately, there aren't many good books about Bill Haley available. There are two biographies which are long out of print -- one by John Swenson which I read as a very small child, and one from the nineties by one of Haley's sons. Another of Haley's sons has a biography due out in April, which might be worthwhile, but until then the only book available is a self-published biography by Otto Fuchs. I relied on <a href=\"https://amzn.to/2T4cIhF\">volume one of Fuchs' book</a> for this post -- it's very good on the facts -- but it suffers from being written by someone whose first language is not English, and it also *badly* needs an editor, so I can't wholly recommend it.\n\n<a href=\"https://amzn.to/2R0zgOn\">This box set</a>, which is ridiculously cheap, contains almost every track anyone could want by Haley and the Comets, and it also includes the Jodimars track I excerpt here. Unfortunately it doesn't contain his great late-fifties singles \"Lean Jean\" and \"Skinny Minnie\", or the 1960s recordings I excerpt here (which are not in print anywhere that I know of) but it has everything else you could want.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a>\n\n<strong>Transcript</strong>\n\nA quick content note for this one – it contains non-explicit mention of infant death, alcoholism, and brain tumours, as well as a quote which uses a word which, while not a slur, is now no longer accepted as a polite term for black people in the way that it was at the time of the quote.\n\nSometimes, the very worst thing that can happen to a musician is for them to have a big hit. A musician who has been doing fine, getting moderate sized hits and making a decent living, suddenly finds themselves selling tens of millions of records. It's what everyone wants, and it's what they've been working up to for their whole career, but what happens then? Is it a fluke? Are they ever going to have another hit as big as the first? How do they top that?\n\nThose problems can be bad enough if your big hit is just a normal big hit. Now imagine that your big hit becomes a marker for a whole generation, that it inspires a musical trend that lasts decades, that it causes actual rioting. Imagine that it's a record that literally everyone in the Western Hemisphere knows, that sixty-five years and counting after its release is still instantly recognisable. When your big hit is *that* big, where do you go from there? What *can* you do next?\n\nFor a while, before leaving Essex Records, Bill Haley had wanted to record a song called \"Rock Around the Clock\". It had been passed to him by Jimmy Myers, one of the song's two credited writers, but for some reason Dave Miller, Haley's producer, didn't want Haley to record it -- to the extent that Haley claimed that a couple of times he'd brought the sheet music into the studio and Miller had ripped it up rather than let him record the song.\n\nAccording to John Swenson's biography of Haley, Miller and Myers knew each other and didn't get on, which might be the case, but it might also just be as simple as \"Rock Around the Clock\" being very derivative. In particular, the lyrics owed more than a little to Wynonie Harris' \"Around the Clock Blues\". Indeed, even the title \"Rock Around the Clock\" had already been used, four years earlier, by Hal Singer:\n\n[excerpt \"Rock Around the Clock\": Hal Singer and Orchestra]\n\nSo, \"Rock Around the Clock\" was an absolutely generic song for its time, and whatever Dave Miller's reasons for not allowing Haley to record it, it wasn't like he was missing out on anything special, was it?\n\nAfter \"Rock the Joint\" and \"Crazy Man Crazy\", Bill Haley was in a position to make a real breakthrough into massive commercial success, but... nothing happened. He released a bunch more singles on Essex, but for some reason they weren't following up on the clear direction he'd set with those singles. Instead he seemed to be flailing around, recording cover versions of recent country hits, or remakes of older songs like \"Chattanooga Choo Choo\". None of his follow-ups to \"Crazy Man Crazy\" did anything at all in the charts, and it looked for a while that he was going to be a one-hit wonder, and getting to number fifteen in the charts was going to be his highest achievement.\n\nBut then, something happened -- Bill Haley quit Essex Records, the label that had led him to become a rockabilly performer in the first place, and signed with Decca. And there his producer was Milt Gabler.\n\nDecca was in an interesting position in 1954, one which listeners to this podcast may not quite appreciate. You might remember that we've mentioned Decca quite a few times over the first few months of this podcast. That's because in the 1940s, Decca was the only major label to sign any of the proto-rock artists we've talked about. In the late forties, Decca had Lucky Millinder, Lionel Hampton, Louis Jordan, the Ink Spots, Ella Fitzgerald, Rosetta Tharpe, Marie Knight, and the Mills Brothers on its roster. It also had a number of country artists who contributed a lot to the hillbilly boogie sound -- people like Ernest Tubb, Red Foley, and more.\n\nBut Decca was the *only* one of the major labels to sign up acts like this. The major labels were, as we've discussed, going mostly for a white middle-class market that wanted Doris Day and Tony Bennett -- not that there's anything wrong with Doris Day or Tony Bennett -- and indeed Decca had plenty of its own acts like that too, and *mostly* dealt in that sort of music.\n\nBut any artist that was working in those styles that *wasn't* signed to Decca had to sign to tiny independent labels. And those independent labels set up their own distribution networks, which went to shops that specialised in the black or hillbilly markets. And so those speciality shops eventually just started buying from the indie distributors, and didn't buy from the major labels at all -- since Decca was the only one they'd been buying from anyway, before the indies came along.\n\nAnd this caused problems for a lot of Decca's artists. The reason that Louis Jordan, say, was so big was that he'd been selling both to the R&B market -- since he was, after all, an R&B artist, and one of the best -- and to the pop market, because he was on a major label. You sell to both those markets, and you'd sell to a *lot* of people -- the casual record buyer market was much larger than the market for speciality genres, while the speciality genre audience was loyal and would buy everything in the styles it liked. But if you were only selling to the Doris Day buyers, and not to the people who liked honking saxophones and went out of their way to buy them, then your honking-saxophone records were not going to do wonderfully in sales.\n\nThis change in the distribution model of records is one of the two reasons that all the artists we talked about in the first few episodes had a catastrophic drop in their sales in the early fifties. We already talked about the other reason in the episode on \"Crazy Man Crazy\", but as a reminder, when the radio stations switched to playing forty-fives, they threw out their old seventy-eights.\n\nThat meant that if you were one of those Decca artists, you simultaneously lost all the radio play for your old singles -- because the radio stations had chucked out their copies -- and stopped having new hits because the distribution model had changed under your feet. And so pretty much all Decca's roster of rhythm and blues or country hitmakers had lost their hit potential, all at the same time.\n\nBut Decca still had Milt Gabler.\n\nWe talked about Milt Gabler right back at the start of this series. He was the one who produced Lionel Hampton's version of \"Flying Home\", the one with the Ilinois Jacquet sax solo, and who produced \"Strange Fruit\" and most of Louis Jordan's records and the Ink Spots' hits. He'd been the one who put Sister Rosetta Tharpe together with pianist Sammy Price. He was largely -- almost solely -- responsible for the difference between Decca's roster and that of the other major labels, and he still wanted to carry on making records in the styles he loved. But to do that, he had to find a way to sell them to the pop audience.\n\nAnd Bill Haley seemed like someone who could appeal to that audience. Indeed, Haley already *had* appealed to that audience once, with \"Crazy Man Crazy\", and if he could do it once he could do it again.\n\nBill Haley's style was not very like most of the music Milt Gabler had been making -- Gabler was, after all, a serious jazz fanatic -- but over recent months Haley's style had been drifting closer and closer to the sort of thing Gabler was doing. In fact, Gabler saw a way to make him even more successful, by pushing the similarity to Louis Jordan, which had already been apparent in some of Haley's earlier records.\n\nAnd so the group were in the studio to record what was intended to be Bill Haley and the Comets' latest hit, \"Thirteen Women And Only One Man In Town\".\n\n[excerpt: Bill Haley \"Thirteen Women\"]\n\nWe haven't talked enough about how much nuclear paranoia was fuelling the popular culture of the early 1950s. Remember, when this record was made, the first atomic bombs had only been dropped eight and a half years earlier, and it had been five years since the Russians had revealed that they, too, had an atom bomb. At the time, everyone was absolutely convinced that a nuclear war between America and Russia was not only likely but inevitable -- yet at the same time the development of nuclear weapons was also something to be proud of -- a great American technological innovation, something that was out of a science fiction film.\n\nBoth of these things were true, more or less, as far as the American popular imagination went, and this led to a very odd sort of cognitive dissonance. And while it's not a good idea to put too much weight on the lyrics of \"Thirteen Women\", which is, after all, just an attempt at having a novelty hit with a Louis Jordan-style song about having thirteen women to oneself, it is notable that it does reflect that ambiguity. The dream the singer has is that the hydrogen bomb has been dropped and left only fourteen people alive in the whole town -- thirteen women plus himself.\n\nNow, one might normally think that that was a devastating, horrific, thought, and that it was a prelude to some sort of Threads-esque story of post-apocalyptic terror. In this case, however, it merely becomes an excuse for a bit of casual sexism, as the thirteen women become Haley's harem and servants, each with their own specified task.\n\nObviously, I'm being a little facetious here. For what it is -- a comedy hillbilly boogie that plays on Haley's genial likeability, “Thirteen Women” is perfectly pleasant, if a little \"of its time\". It's very obviously influenced by Louis Jordan, but that makes sense given that Gabler was Jordan's producer.\n\nIndeed, Gabler was also the one who introduced the H-bomb theme -- the original version of the song, by the blues guitarist Dickie Thompson, makes no mention of the bomb or the dream, just treats it as something that happened to him. And, frankly, Thompson's version is much, much better than Haley's, and has some truly great guitar playing:\n\n[excerpt: Dickie Thompson \"Thirteen Women\"]\n\nBut Thompson's record is absolutely a blues record, in the same style as people like Guitar Slim or Johnny Guitar Watson. Haley's record is very different, and while Thompson's sounds better to modern ears -- or at least to my ears -- Haley's was in a style that was massively popular for the time.\n\nBut it would probably make an unlikely massive hit. And you certainly wouldn't expect its B-side to become that massive hit.\n\nFor the B-side, Haley decided to cut that \"Rock Around the Clock\" song that he'd been offered a year earlier. It might have come back into his mind because, two weeks earlier, another group had released their version of it.\n\nSonny Dae and his Knights were a band from Virginia who had never made a record before -- and who never would again -- but who had a regular radio spot. \"Rock Around the Clock\" was their only recorded legacy, and it might have had a chance at being a hit by them with some proper promotion -- or maybe not, given the... experimental... nature of the intro:\n\n[excerpt Sonny Dae and his Knights: \"Rock Around the Clock\"]\n\nSo the single did very little, and now Sonny Dae and his Knights are a footnote.\n\nBut their release may have reminded Haley of the song, and he recorded his new version in two takes.\n\nBut the interesting thing is that Haley *didn't* record the song as it was written, or as the Knights recorded it. Listen again to the melody that Sonny Dae is singing:\n\n[short excerpt]\n\nNow, let's listen to Bill Haley singing the same bit\n\n[excerpt]\n\nThat's a totally different melody. What Haley has done there is change the melody on the original to a melody that is essentially the standard boogie bassline. But I think there's a specific reason for that.\n\nHank Williams' very first big hit, remember, was a comedy Western swing song called \"Move it on Over\". That song has almost exactly the same melody that Haley is singing for the verse of \"Rock Around the Clock\"\n\n[excerpt of Hank Williams: \"Move it On Over\"]\n\nWe know that Haley knew the song, because he later cut his own version of it, so it's reasonable to assume that this was a very deliberate decision.\n\nWhat Haley and the Comets have done is take the *utterly generic* song \"Rock Around the Clock\", and they've used it as an excuse to hang every bit of every other song that they know could be a hit on -- to create an arrangement that could encapsulate everything about successful music. They kept the basic arrangement and structure they'd worked out for \"Rock the Joint\" right down to Danny Cedrone playing the same solo note-for-note.\n\nCompare \"Rock the Joint\"'s solo\n\n[excerpt]\n\nWith \"Rock Around the Clock\"'s\n\n[excerpt]\n\nFor the beginning, they came up with a stop-start intro that emphasised the word \"rock\":\n\n[excerpt]\n\nAnd then, at the end, they used a variant of the riff ending you'd often get in swing songs like \"Flying Home\", which one strongly suspects was Gabler's idea. The Knights did something similar, but only for a couple of bars, in their badly-thought-out solo section. With the Comets, it's a far more prominent feature of the arrangement. Again, compare \"Flying Home\":\n\n[riff from \"Flying Home\", Benny Goodman]\n\nand \"Rock Around the Clock\":\n\n[riff]\n\nThis was *wildly* experimental. They were trying this stuff, not with any thought to listenability, but to see what worked. It didn't matter, no-one was going to hear it. It was something they knocked out in two takes – and the finished version had to be edited together from both of them, because they didn't have time in the studio to get a decent take down. This was not a record that was destined to have any great success.\n\nAnd, indeed, it didn't.\n\n\"Rock Around the Clock\" made almost no impact on its original release. It charted, but only in the lower reaches of the chart, and didn't really register on the public's consciousness.\n\nBut Haley and his band continued making records in that style, and their next one, a cover of Big Joe Turner's \"Shake, Rattle, and Roll\", did rather better, and started rising up the charts quite well.\n\nTheir version of \"Shake, Rattle, and Roll\" -- a song which we talked about a bit in episode two, if you want to go back and refresh your memory -- was nowhere near as powerful as Turner's had been. It cleaned up parts of the lyric -- though notably not the filthiest lines, presumably because the innuendo in them completely passed both Haley and Gabler by -- and imposed a much more conventional structure on it. But while it was a watered-down version of the original song, it was still potent enough that for those who hadn't heard the original, it was working some sort of magic:\n\n[excerpt: \"Shake, Rattle, and Roll\" by Bill Haley and his Comets]\n\nHaley was a real fan of Turner, and indeed the two men became close friends in later years, and the Comets were Turner's backing band on one sixties album. But he doesn't have the power or gravitas in his vocals that Turner did, and the result is rather lightweight.\n\nHaley's cover was recorded the same week that Turner's version reached number one on the R&B charts, and it's easy to think of this as another \"Sh'Boom\" situation, with a white man making a more radio-friendly version of a black musician's hit. But Haley's version is not just a straight copy -- and not just because of the changes to remove some of the more obviously filthy lines. It's structured differently, and has a whole different feel to it. This feels to me more like Haley recasting things into his own style than him trying to jump on someone else's bandwagon, though it's a more ambiguous case than some.\n\n\"Shake, Rattle, and Roll\" became Bill Haley's biggest hit so far, going top ten in the pop charts, and both Haley's version and Turner's sold a million copies. It looked like Haley was on his way to a reasonable career -- not, perhaps, a massive stardom, but selling a lot of records, and doing well in shows.\n\nBut then everything changed, for Bill Haley and for the world.\n\nIt was only when a film, \"The Blackboard Jungle\", was being made nearly a year after \"Rock Around the Clock\" was recorded, that the track became important.\n\n\"Blackboard Jungle\" was absolutely not a rock and roll film. It was a film about teenagers and rebellion and so on, yes, but in a pivotal scene when a teacher brings his old jazz records in, in order to bond with the kids, and they smash them and play their own, it's not rock and roll they're playing but modern jazz. Stan Kenton is the soundtrack to their rebellion, not anything more rock.\n\nBut in order to make the film up-to-the-minute, the producers of the film borrowed some records from the record collection of Peter Ford, the teenage son of the film's star. They wanted to find out what kind of records teenagers were listening to, and he happened to have a copy of the Bill Haley single.\n\nThey made the decision that this was to be the theme tune to the film, and all of a sudden, everything changed. Everything.\n\nBecause \"The Blackboard Jungle\" was a sensation. Probably the best explanation of what it did, and of what \"Rock Around the Clock\" did as its theme song, is in this quote from Frank Zappa from 1971.\n\n\"In my days of flaming youth I was extremely suspect of any rock music played by white people. The sincerity and emotional intensity of their performances, when they sang about boyfriends and girlfriends and breaking up et cetera, was nowhere when I compared it to my high school negro R&B heroes like Johnny Otis, Howlin' Wolf and Willie Mae Thornton.”\n\n(Again, when Zappa said this, that word was the accepted polite term for black people. Language has evolved since. The quote continues.)\n\n“But then I remember going to see Blackboard Jungle. When the titles flashed up there on the screen, Bill Haley and his Comets started blurching 'One, Two, Three O'Clock, Four O'Clock Rock…' It was the loudest rock sound kids had ever heard at the time. I remember being inspired with awe. In cruddy little teen-age rooms, across America, kids had been huddling around old radios and cheap record players listening to the 'dirty music' of their lifestyle. (\"Go in your room if you wanna listen to that crap…and turn the volume all the way down\".) But in the theatre watching Blackboard Jungle, they couldn't tell you to turn it down. I didn't care if Bill Haley was white or sincere…he was playing the Teen-Age National Anthem, and it was so LOUD I was jumping up and down.\"\n\nThere were reports of riots in the cinemas, with people slicing up seats with knives in a frenzy as the music played.\n\n\"Rock Around the Clock\" went to number one on the pop charts, but it did more than that. It sold, in total, well over twenty-five million copies as a vinyl single, becoming the best-selling vinyl single in history. When counting compilation albums on which it has appeared, the number of copies of the song that have sold must total in the hundreds of millions.\n\nBill Haley and the Comets had become the biggest act in the world, and for the next couple of years, they would tour constantly, playing to hysterical crowds, and appearing in two films -- \"Rock Around the Clock\" and \"Don't Knock the Rock\". They were worldwide superstars, famous at a level beyond anything imaginable before.\n\nBut at the same time that everything was going right for \"Rock Around the Clock\"'s sales, things were going horribly wrong for everything else in Haley's life. Ten days after the session for \"Shake, Rattle, and Roll\", at the end of June 1954, Danny Cedrone, the session guitarist who had played on all Haley's records, and a close friend of Haley, fell down the stairs and broke his neck, dying instantly. At the end of July, Haley's baby daughter died suddenly, of cot death.\n\nAnd... there was no follow-up to \"Rock Around the Clock\". You *can't* follow up anything that big -- there's nothing to follow it up with. And Haley's normal attitude, of scientifically assessing what the kids liked, didn't work any more either. The kids were screaming at *everything*, because he was the biggest star in the world. The next few records all hit the pop charts, and all got in the top twenty or thirty -- they were big hits by most standards, but they weren't \"Rock Around the Clock\" big. And then in 1955, the band's bass player, saxophone player, and drummer quit the band, forming their own group, the Jodimars:\n\n[excerpt: the Jodimars: \"Well Now Dig This\"]\n\nHaley soldiered on, however, and the new lineup of the band had another top ten hit in December 1955 -- their first in over a year -- with \"See You Later Alligator\":\n\n[excerpt: Bill Haley and the Comets \"See You Later, Alligator\"]\n\nWhile that was no \"Rock Around the Clock\", it did sell a million copies. But it was a false dawn. The singles after that made the lower reaches of the top thirty, and then the lower reaches of the top one hundred, and then stopped charting altogether. They had one final top thirty hit in 1958, with the rather fabulous \"Skinny Minnie\":\n\n[excerpt: Bill Haley and the Comets \"Skinny Minnie\"]\n\nThat's an obvious attempt to copy Larry Williams' \"Bony Moronie\", but also, it's a really good record. But the follow-up, \"Lean Jean\", only reached number sixty, and that was it for Bill Haley and the Comets on the US charts.\n\nAnd that's usually where people leave the story, assuming Haley was a total failure after this, but that shows the America-centric nature of most rock criticism. In fact, Bill Haley moved to Mexico in 1960.\n\nThe IRS were after Haley's money, and he found that he could make money from a Mexican record label, and if it stayed in Mexico, he didn't have to give his new income to them. He was going through a divorce, and he'd met a Mexican woman who was to become his third wife, and so it just made sense for him to move.\n\nAnd in Mexico, Bill Haley became king of the Twist:\n\n[excerpt: Bill Haley y sus Cometas, \"Florida Twist\"]\n\n\"Florida Twist\" went to number one in Mexico, as did the album of the same name. Indeed, \"Florida Twist\", by Bill Haley y sus Cometas, became the biggest-selling single ever up to that point in Mexico. The Comets had their own TV show in Mexico, Orfeón a Go-Go, and made three Spanish-language films in the sixties. They had a string of hits there, and Mexico wasn't the only place they were having hits. Their \"Chick Safari\" went to number one in India. A warning before this bit... it's got a bit of the comedy racism that you would find at the time in too many records:\n\n[excerpt \"Chick Safari\", Bill Haley and the Comets]\n\nAnd even after his success as a recording artist finally dried up -- in the late sixties, not the late fifties like most articles on him assume, Haley and the Comets were still a huge live draw across the world. At a rock revival show in the late sixties at Madison Square Garden, Haley got an eight-and-a-half-minute standing ovation before playing a song. He played Wembley Stadium in 1972 and the Royal Variety Performance in 1979.\n\nHaley's last few years weren't happy ones -- he started behaving erratically shortly after Rudy Pompili, his best friend and saxophone player for over twenty years, died in 1976. He gave up performing for a couple of years -- he and Pompilli had always said that if one of them died the other one wouldn't carry on -- and when he came back, he seemed to be behaving oddly and people usually put this down to his alcoholism, and blame *that* on his resentment at his so-called lack of success -- forgetting that he had a brain tumour, and that just perhaps that might have led to some of the erraticness.\n\nBut people let that cast a shadow back over his career, and let his appearance -- a bit fat, not in the first flush of youth -- convince them that because he didn't fit with later standards of cool, he was \"forgotten\" and \"overlooked\".\n\nBill Haley died in 1981, just over a year after touring Britain and playing the Royal Variety Performance -- a televised event which would regularly get upwards of twenty million viewers. I haven't been able to find the figures for the 1979 show, but the Royal Variety Performance regularly hit the top of the ratings for the *year* in the seventies and eighties. Bill Haley was gone, yes, but he hadn't been forgotten. And as long as “Rock Around the Clock” is played, he won't be.\n\n[excerpt: \"See You Later Alligator\" -- \"so long, that's all goodbye\"]",
  "enclosure": "",
  "itunes:summary": "Welcome to episode twenty of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Rock Around the Clock\" by Bill Haley and the Comets. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nUnfortunately, there aren't many good books about Bill Haley available. There are two biographies which are long out of print -- one by John Swenson which I read as a very small child, and one from the nineties by one of Haley's sons. Another of Haley's sons has a biography due out in April, which might be worthwhile, but until then the only book available is a self-published biography by Otto Fuchs. I relied on volume one of Fuchs' book for this post -- it's very good on the facts -- but it suffers from being written by someone whose first language is not English, and it also *badly* needs an editor, so I can't wholly recommend it.\n\nThis box set, which is ridiculously cheap, contains almost every track anyone could want by Haley and the Comets, and it also includes the Jodimars track I excerpt here. Unfortunately it doesn't contain his great late-fifties singles \"Lean Jean\" and \"Skinny Minnie\", or the 1960s recordings I excerpt here (which are not in print anywhere that I know of) but it has everything else you could want.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nA quick content note for this one – it contains non-explicit mention of infant death, alcoholism, and brain tumours, as well as a quote which uses a word which, while not a slur, is now no longer accepted as a polite term for black people in the way that it was at the time of the quote.\n\nSometimes, the very worst thing that can happen to a musician is for them to have a big hit. A musician who has been doing fine, getting moderate sized hits and making a decent living, suddenly finds themselves selling tens of millions of records. It's what everyone wants, and it's what they've been working up to for their whole career, but what happens then? Is it a fluke? Are they ever going to have another hit as big as the first? How do they top that?\n\nThose problems can be bad enough if your big hit is just a normal big hit. Now imagine that your big hit becomes a marker for a whole generation, that it inspires a musical trend that lasts decades, that it causes actual rioting. Imagine that it's a record that literally everyone in the Western Hemisphere knows, that sixty-five years and counting after its release is still instantly recognisable. When your big hit is *that* big, where do you go from there? What *can* you do next?\n\nFor a while, before leaving Essex Records, Bill Haley had wanted to record a song called \"Rock Around the Clock\". It had been passed to him by Jimmy Myers, one of the song's two credited writers, but for some reason Dave Miller, Haley's producer, didn't want Haley to record it -- to the extent that Haley claimed that a couple of times he'd brought the sheet music into the studio and Miller had ripped it up rather than let him record the song.\n\nAccording to John Swenson's biography of Haley, Miller and Myers knew each other and didn't get on, which might be the case, but it might also just be as simple as \"Rock Around the Clock\" being very derivative. In particular, the lyrics owed more than a little to Wynonie Harris' \"Around the Clock Blues\". Indeed, even the title \"Rock Around the Clock\" had already been used, four years earlier, by Hal Singer:\n\n[excerpt \"Rock Around the Clock\": Hal Singer and Orchestra]\n\nSo, \"Rock Around the Clock\" was an absolutely generic song for its time, and whatever Dave Miller's reasons for not allowing Haley to record it, it wasn't like he was missing out on anything special, was it?\n\nAfter \"Rock the Joint\" and \"Crazy Man Crazy\", Bill Haley was in a position to make a real breakthroug",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode twenty of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Rock Around the Clock\" by Bill Haley and the Comets. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nUnfortunately, there aren't many good books about Bill Haley available. There are two biographies which are long out of print -- one by John Swenson which I read as a very small child, and one from the nineties by one of Haley's sons. Another of Haley's sons has a biography due out in April, which might be worthwhile, but until then the only book available is a self-published biography by Otto Fuchs. I relied on volume one of Fuchs' book for this post -- it's very good on the facts -- but it suffers from being written by someone whose first language is not English, and it also *badly* needs an editor, so I can't whol",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}