{
  "title": "Special Request! -- Help Support A Way with Words",
  "link": "http://awww.libsyn.com/special-request-help-support-a-way-with-words",
  "description": "Give Now for the $25,000 Fundraising Challenge\n\n\n\n\n\n\n\n\n  Dear friends and listeners,   As we near the end of our biggest year yet, we must raise $25,000 to cover the remainder of this season. We need your help to reach that amount before December 30th.  Reaching that goal will mean covering fixed costs: Broadcast studio rental. A sound engineer and board operator. Website hosting. Podcast hosting. The toll-free phone line. Episode distribution through the Public Radio Satellite System — an expense that will increase 50% in 2012.  What you may not know is that when you donate to your local station — as you should — none of that money goes to A Way with Words. We’re independent of any radio station and independent of NPR. We receive no funds from them at all.  This means, in part, that A Way with Words can carry out its educational mission without excessive bureaucracy and overhead costs. It also means we can make it available to everyone, completely free of charge.  But it also means that to do well, we require support from our listeners. We need your donations, whether you listen online or on the air.  Show us that we can count on you. Make a tax-deductible donation of $100 or more today. If that’s too much, please donate what you can.  \n\n\n If you’ve given to A Way with Words before, thank you! But can we ask you to double your donation this time? Will you go the extra mile to support quality radio that respects your intelligence?  You can also send your donations by postal mail to this address:\n\nWayword, Inc. P.O. Box 632721 San Diego, CA 92163\nThank you for the affection and support you’ve shown in your phone calls in emails over the past year. We wish you and your family all the love in the world.  Best wishes, and happy holidays,  Grant Barrett and Martha Barnette co-hosts of A Way with Words  PS: A Way with Words is now heard on the air in more than 173 cities across North America and we’re happy to report that the program will also be heard on Vermont Public Radio starting in January!  \n\n\n Wayword, Inc., is a small non-profit 501(c)3 corporation. It receives no funding from NPR, PRI, PBS, the Corporation for Public Broadcasting, or any public radio station or broadcast network. Support amazing radio today! All donations to Wayword, Inc., the nonprofit that produces A Way with Words, are tax-deductible. Our Federal tax ID number is #27-0277377. \nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "pubDate": "Thu, 15 Dec 2011 00:06:00 -0000",
  "itunes:episodeType": "full",
  "itunes:author": "Hosted by Martha Barnette and Grant Barrett. Produced by Stefanie Levine.",
  "itunes:image": "",
  "itunes:subtitle": "How much can you help support intelligent radio that respects your brains?",
  "itunes:summary": "Give Now for the $25,000 Fundraising Challenge\n\n\n\n\n\n\n\n\n  Dear friends and listeners,   As we near the end of our biggest year yet, we must raise $25,000 to cover the remainder of this season. We need your help to reach that amount before December 30th.  Reaching that goal will mean covering fixed costs: Broadcast studio rental. A sound engineer and board operator. Website hosting. Podcast hosting. The toll-free phone line. Episode distribution through the Public Radio Satellite System — an expense that will increase 50% in 2012.  What you may not know is that when you donate to your local station — as you should — none of that money goes to A Way with Words. We’re independent of any radio station and independent of NPR. We receive no funds from them at all.  This means, in part, that A Way with Words can carry out its educational mission without excessive bureaucracy and overhead costs. It also means we can make it available to everyone, completely free of charge.  But it also means that to do well, we require support from our listeners. We need your donations, whether you listen online or on the air.  Show us that we can count on you. Make a tax-deductible donation of $100 or more today. If that’s too much, please donate what you can.  \n\n\n If you’ve given to A Way with Words before, thank you! But can we ask you to double your donation this time? Will you go the extra mile to support quality radio that respects your intelligence?  You can also send your donations by postal mail to this address:\n\nWayword, Inc. P.O. Box 632721 San Diego, CA 92163\nThank you for the affection and support you’ve shown in your phone calls in emails over the past year. We wish you and your family all the love in the world.  Best wishes, and happy holidays,  Grant Barrett and Martha Barnette co-hosts of A Way with Words  PS: A Way with Words is now heard on the air in more than 173 cities across North America and we’re happy to report that the program will also be heard on Vermont Public Radio starting in January!  \n\n\n Wayword, Inc., is a small non-profit 501(c)3 corporation. It receives no funding from NPR, PRI, PBS, the Corporation for Public Broadcasting, or any public radio station or broadcast network. Support amazing radio today! All donations to Wayword, Inc., the nonprofit that produces A Way with Words, are tax-deductible. Our Federal tax ID number is #27-0277377. \nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "content:encoded": "\n\n\n\n\n\n\n\n\n<a href=\"http://www.waywordradio.org/2011-gifts.html\"></a>\n\n\n\n<br> Give Now for the $25,000 Fundraising Challenge<br><a href=\"http://www.waywordradio.org/2011-gifts.html\"></a>\n\n\n\n\n\n\n\n\n<p><br> <br> Dear friends and listeners, <br> <br> As we near the end of our biggest year yet, we must <a href=\"http://www.waywordradio.org/2011-gifts.html\">raise $25,000</a> to cover the remainder of this season. We need your help to reach that amount before December 30th.<br> <br> Reaching that goal will mean covering fixed costs: Broadcast studio rental. A sound engineer and board operator. Website hosting. Podcast hosting. The toll-free phone line. Episode distribution through the Public Radio Satellite System — an expense that will increase 50% in 2012.<br> <br> What you may not know is that when you donate to your local station — as you should — none of that money goes to A Way with Words. We’re independent of any radio station and independent of NPR. We receive no funds from them at all.<br> <br> This means, in part, that A Way with Words can carry out its educational mission without excessive bureaucracy and overhead costs. It also means we can make it available to everyone, completely free of charge.<br> <br> But it also means that to do well, we require support from our listeners. We need your donations, whether you listen online or on the air.<br> <br> Show us that we can count on you. <a href=\"http://www.waywordradio.org/2011-gifts.html\">Make a tax-deductible donation</a> of $100 or more today. If that’s too much, please donate what you can. <br> <br></p>\n<a href=\"http://www.waywordradio.org/2011-gifts.html\"></a>\n<p><br> If you’ve given to A Way with Words before, thank you! But can we ask you to double your donation this time? Will you go the extra mile to support quality radio that respects your intelligence?<br> <br> You can also send your donations by postal mail to this address:<br></p>\nWayword, Inc.<br> P.O. Box 632721<br> San Diego, CA 92163\n<p>Thank you for the affection and support you’ve shown in your phone calls in emails over the past year. We wish you and your family all the love in the world.<br> <br> Best wishes, and happy holidays,<br> <br> Grant Barrett and Martha Barnette<br> co-hosts of A Way with Words<br> <br> PS: A Way with Words is now heard on the air in more than 173 cities across North America and we’re happy to report that the program will also be heard on Vermont Public Radio starting in January!<br> <br> </p>\n\n<p><br> Wayword, Inc., is a small non-profit 501(c)3 corporation. It receives no funding from NPR, PRI, PBS, the Corporation for Public Broadcasting, or any public radio station or broadcast network. <a href=\"http://waywordradio.org/donate/\">Support amazing radio today!</a><br><br> All donations to Wayword, Inc., the nonprofit that produces A Way with Words, are tax-deductible. Our Federal tax ID number is #27-0277377. </p><p> </p><p>Learn more about your ad choices. Visit <a href=\"https://megaphone.fm/adchoices\">megaphone.fm/adchoices</a></p>",
  "itunes:duration": 141,
  "itunes:explicit": "no",
  "guid": "37a16d6b433ee690cec770abfb55d284",
  "enclosure": ""
}