{
  "title": "Episode 39 - Danez Smith",
  "itunes:title": "Danez Smith",
  "pubDate": "Mon, 28 Jan 2019 18:00:00 +0000",
  "guid": "3e88f688393347e2a31347bd6bad4dd0",
  "link": "https://givensbmr.libsyn.com/danez-smith",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">On this episode of Black Market Reads, the acclaimed poet Danez Smith. Smith is the author of two award-winning collections of poetry: 2014’s</span> <em><span style= \"font-weight: 400;\">[insert] boy</span></em> <span style= \"font-weight: 400;\">which was awarded the winner of the Kate Tufts Discovery Award and the Lambda Literary Award for Gay Poetry; and their most recent collection, <em>Don’t Call Us Dead,</em> published by Graywolf Press in 2017, which was winner of the Forward Prize for Best Collection, the Midwest Booksellers Choice Award, and a finalist for the National Book Award. Smith is the recipient of fellowships from the Poetry Foundation, the McKnight Foundation, the Montalvo Arts Center, Cave Canem, and the National Endowment for the Arts. Smith is a member of the Dark Noise Collective and is the co-host of  VS, a podcast sponsored by the Poetry Foundation and Postloudness.</span></p> <p><span style=\"font-weight: 400;\">To learn more about Smith's work, visit their website: <a href= \"http://www.danezsmithpoet.com/\">http://www.danezsmithpoet.com/</a></span></p>",
  "content:encoded": "<p>On this episode of Black Market Reads, the acclaimed poet Danez Smith. Smith is the author of two award-winning collections of poetry: 2014’s <em>[insert] boy</em> which was awarded the winner of the Kate Tufts Discovery Award and the Lambda Literary Award for Gay Poetry; and their most recent collection, <em>Don’t Call Us Dead,</em> published by Graywolf Press in 2017, which was winner of the Forward Prize for Best Collection, the Midwest Booksellers Choice Award, and a finalist for the National Book Award. Smith is the recipient of fellowships from the Poetry Foundation, the McKnight Foundation, the Montalvo Arts Center, Cave Canem, and the National Endowment for the Arts. Smith is a member of the Dark Noise Collective and is the co-host of  VS, a podcast sponsored by the Poetry Foundation and Postloudness.</p> <p>To learn more about Smith's work, visit their website: <a href= \"http://www.danezsmithpoet.com/\">http://www.danezsmithpoet.com/</a></p>",
  "enclosure": "",
  "itunes:duration": "36:08",
  "itunes:explicit": true,
  "itunes:keywords": "writing,black,minnesota,literature,poetry,American,POET,smith,queer,African,spokenword,LGBTQ,danez",
  "itunes:subtitle": "On this episode of Black Market Reads, the acclaimed poet Danez Smith. Smith is the author of two award-winning collections of poetry: 2014’s [insert] boy which was awarded the winner of the Kate Tufts Discovery Award and the Lambda Literary Award...",
  "itunes:season": 4,
  "itunes:episode": 5,
  "itunes:episodeType": "full",
  "itunes:author": "The Givens Foundation for African American Literature / iDream.tv"
}