{
  "id": "https://bibleinoneyear.org/en/youth/251",
  "title": "Day 251: Winning the Spiritual Battle",
  "description": "Psalm 106:16,21,23–25,29–30,31, Isaiah 19:20,21,22–23,25, 2 Corinthians 10:3–5,9–11,14–16.  The weapons we fight with are not the weapons of the world  On the contrary, they have divine power to demolish strongholds’ (2 Corinthians 10:3b–4)",
  "pubDate": "Wed, 08 Sep 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/251/?ignore",
  "itunes:duration": "14:38",
  "guid": "enyouth08092021-251",
  "length": 878.65,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 251: Winning the Spiritual Battle",
  "itunes:subtitle": "Psalm 106:16,21,23–25,29–30,31, Isaiah 19:20,21,22–23,25, 2 Corinthians 10:3–5,9–11,14–16.  The weapons we fight with are not the weapons of the world  On the contrary, they have divine power to demolish strongholds’ (2 Corinthians 10:3b–4)",
  "itunes:summary": "The tragic image is unforgettable. Like so many people, I wept as I saw the picture of 3-year-old Alan Kurdi’s little body washed up on the shoreline in Turkey. He had drowned, together with his brother and mother, as his family fled the war in Syria.\nOne of the biggest causes of the current European refugee crisis is warfare. Over 500,000 people have been killed in the civil war in Syria in recent years. In Iraq, Isis have murdered thousands of innocent people (many of them Christians) and displaced tens of thousands of people (again, many of them Christians). Appalling terrorist attacks around the world now occur with alarming regularity.\nThese atrocities are extreme and horrific instances of a violence that has always taken place at every level of society. ‘Brother fight brother, neighbour fight neighbour, city fight city, kingdom fight kingdom – anarchy and chaos and killing!’ (Isaiah 19:2, MSG).\nVirtually every day in the media we see the horrors of warfare. We live in a world that is constantly developing even more terrible weapons of physical warfare. These weapons have the power to maim, kill and destroy. But this warfare is not purely physical. The issues that give rise to it, as many in both politics and the media acknowledge, are profoundly moral and spiritual.\nJust as physical warfare is a serious global issue, so, according to the apostle Paul, is spiritual warfare (see Ephesians 6:10–20). This is unseen, but it is just as real. The great Welsh preacher, Dr Martyn Lloyd-Jones, once said, ‘There is no grosser or greater misrepresentation of the Christian message than that which depicts it as offering a life of ease with no battle and struggle at all... sooner or later every believer discovers that the Christian life is a battleground, not a playground.’\nIn this battle, you are called not to be overcome by evil but to overcome evil with good (Romans 12:21). You are given the weapons with which to win the battle. Paul writes, ‘We do not wage war as the world does. The weapons we fight with are not the weapons of the world. On the contrary, they have divine power to demolish strongholds’ (2 Corinthians 10:3b–4).\nWhat are these weapons? How do you use them?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 251
}