{
  "title": "FourierNets enable the design of highly non-local optical encoders for computational imaging. (arXiv:2104.10611v6 [eess.IV] UPDATED)",
  "link": "http://arxiv.org/abs/2104.10611",
  "description": "<p>Differentiable simulations of optical systems can be combined with deep\nlearning-based reconstruction networks to enable high performance computational\nimaging via end-to-end (E2E) optimization of both the optical encoder and the\ndeep decoder. This has enabled imaging applications such as 3D localization\nmicroscopy, depth estimation, and lensless photography via the optimization of\nlocal optical encoders. More challenging computational imaging applications,\nsuch as 3D snapshot microscopy which compresses 3D volumes into single 2D\nimages, require a highly non-local optical encoder. We show that existing deep\nnetwork decoders have a locality bias which prevents the optimization of such\nhighly non-local optical encoders. We address this with a decoder based on a\nshallow neural network architecture using global kernel Fourier convolutional\nneural networks (FourierNets). We show that FourierNets surpass existing deep\nnetwork based decoders at reconstructing photographs captured by the highly\nnon-local DiffuserCam optical encoder. Further, we show that FourierNets enable\nE2E optimization of highly non-local optical encoders for 3D snapshot\nmicroscopy. By combining FourierNets with a large-scale multi-GPU\ndifferentiable optical simulation, we are able to optimize non-local optical\nencoders 170$\\times$ to 7372$\\times$ larger than prior state of the art, and\ndemonstrate the potential for ROI-type specific optical encoding with a\nprogrammable microscope.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/eess/1/au:+Deb_D/0/1/0/all/0/1\">Diptodip Deb</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Jiao_Z/0/1/0/all/0/1\">Zhenfei Jiao</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Sims_R/0/1/0/all/0/1\">Ruth Sims</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Chen_A/0/1/0/all/0/1\">Alex B. Chen</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Broxton_M/0/1/0/all/0/1\">Michael Broxton</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Ahrens_M/0/1/0/all/0/1\">Misha B. Ahrens</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Podgorski_K/0/1/0/all/0/1\">Kaspar Podgorski</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Turaga_S/0/1/0/all/0/1\">Srinivas C. Turaga</a>"
}