{
  "id": "tag:blogger.com,1999:blog-8878620400258430757.post-3966060996487450577",
  "published": "2019-06-21T14:24:00.003-07:00",
  "updated": "2019-06-21T14:24:44.577-07:00",
  "title": "Internal mobility — switching roles at Google: an interview with Alison Agüero Dooley",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\">Have you ever wondered what internal mobility and switching roles looks like at Google? Meet Alison Agüero Dooley! Alison has been at Google since summer 2014, when she was an MBA student. Since then, she’s held three different roles: gTech Ads MBA Intern, gTech Ads Product Operations Manager (POM) for YouTube Ads, and Product Manager for YouTube Ads. To learn more about switching roles and advancing careers at Google, read on for Alison’s journey.<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-wy7_E3cFeCc/XQ1Kt6qGaeI/AAAAAAAAAlU/d-7XB7L1wC8iOP1yWIG_p-jOdlxcWHG8gCLcBGAs/s1600/Student%2BPortraits013%2B%25283%2529.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1068\" data-original-width=\"1600\" height=\"426\" src=\"https://1.bp.blogspot.com/-wy7_E3cFeCc/XQ1Kt6qGaeI/AAAAAAAAAlU/d-7XB7L1wC8iOP1yWIG_p-jOdlxcWHG8gCLcBGAs/s640/Student%2BPortraits013%2B%25283%2529.jpg\" width=\"640\" /></a></div><br /><b>Can you tell us a bit about yourself?</b><br />I grew up in a Peruvian household in the northern Virginia suburbs of Washington, D.C., and I’m the eldest of three girls. I love dancing (especially salsa and merengue), being with family and friends, devouring ice cream, and spreading the word about <a href=\"https://www.dreamwakers.org/\">DreamWakers</a>, a non-profit for which I’m an Advisory Council member.<br /><br /><b>What has your career path at Google looked like? What role(s) and team(s) have you been on?</b><br />I was first a gTech Ads MBA intern based in New York City on a team of solutions consultants focused on supporting agencies in their use of Google Marketing Platform. I devised strategies and tools for helping my peers better understand how to allocate their focus across assigned customers, and how to make better business cases for product feature requests.<br /><br />My first full-time role with Google was in gTech as a Product Operations Manager for YouTube Ads. In this role, I served as a bridge between gTech and YouTube Ads Product Managers. In one direction, I learned about new product launches from the Product Managers and made sure the gTech teams had the tools necessary to support customers. In the other direction, I surfaced relevant feedback up to the Product Managers and lobbied for development of features that would make the product easier for customers to use and for gTech to support.<br /><br />After two years in the role, I transitioned to a Product Management role within YouTube Ads.<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-3mVvoFSpUzA/XQ1KyOSjzMI/AAAAAAAAAlc/mPHZ6r7-i5gulnkHqQHoq-ix4gflySd3ACEwYBhgL/s1600/IMG_20180819_132855%2B%25281%2529.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1600\" data-original-width=\"1200\" height=\"640\" src=\"https://1.bp.blogspot.com/-3mVvoFSpUzA/XQ1KyOSjzMI/AAAAAAAAAlc/mPHZ6r7-i5gulnkHqQHoq-ix4gflySd3ACEwYBhgL/s640/IMG_20180819_132855%2B%25281%2529.jpg\" width=\"480\" /></a></div><br /><b>What inspired you to switch roles?</b><br />After two years as a Product Operations Manager, I started to feel the itch to push myself to learn something new. Since I was working with Product Managers frequently, it seemed like the next great opportunity to incorporate my strengths, and also build on and expand my existing skillset. My past roles had been pretty operations heavy, so I was excited to try a role where I could think more holistically about product solutions and play a more active role in setting the strategy for, designing, and delivering products.<br /><br /><b>Can you tell us how you leveraged transferable skills to pivot to a new role?</b><br />The transferable skills from my previous role were critical to starting off on the right foot in my new role as a Product Manager. From a broader perspective, in each pivot of my career I had one foot in a strength and the other foot in something new. I started in consulting, where the industry I focused on was federal government agencies and the functional expertise I developed was in operations strategy. In my first role at Google as a gTech Product Operations Manager, my functional expertise stayed in operations strategy, but my industry expertise shifted to digital advertising with YouTube Ads. In my next role at Google, my industry expertise stayed with YouTube Ads but my functional expertise shifted to Product Management. Using this approach ensured I would always have a solid foundation to build upon in each new role.<br /><br />Specifically with respect to my transition to Product Management, I leveraged the deep YouTube Ads product expertise I gained from my role as a Product Operations Manager; the holistic business thinking I gained from my MBA at <a href=\"https://www.darden.virginia.edu/\">UVA Darden</a>; the analysis, communication, relationship management, and thriving-in-ambiguity skills I gained as a consultant; and the technical skills and exposure to product development I gained in my Systems Engineering studies as an undergrad at UVA.<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-irNgYZA7XGE/XQ1KyBBSigI/AAAAAAAAAlY/spk1AdEyr_cT11KcfIU-0psjMltZBjGBACEwYBhgL/s1600/IMG_8888.JPG\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1200\" data-original-width=\"1600\" height=\"480\" src=\"https://1.bp.blogspot.com/-irNgYZA7XGE/XQ1KyBBSigI/AAAAAAAAAlY/spk1AdEyr_cT11KcfIU-0psjMltZBjGBACEwYBhgL/s640/IMG_8888.JPG\" width=\"640\" /></a></div><br /><b>How did the internal mobility process go for you? What did it entail?</b><br />I first set up coffee chats with Googlers in my network to learn about roles that interested me and get their advice on how to transition. I also updated my resume and set up job alerts in our internal job posting site. As soon as any interesting roles popped up, I immediately applied. I ended up interviewing for a few roles, but none of them worked out. However, It turned out to be a blessing in disguise!<br /><br />I had made sure to have a coffee chat with the lead of the YouTube Ads Product Management team I had been working closely with in my existing role. Months later, a role on the team opened up. Because (1) I had already expressed to them my desire to transition to Product Management, (2) I had gained deep expertise in their product area from my existing role, and (3) because they had familiarity with my skills and work ethic from our work together in my existing role, they offered me a chance to join the team by doing a full-time rotation.<br /><br /><b>Can you tell us about the resources you used to prepare yourself to move into your new role?</b><br />I leaned heavily on the generosity of others, who offered me their time in giving me advice, doing mock interviews with me, sharing their experiences with me, and more. I also made use of our internal career mentors program by meeting with an amazing career mentor several times. She was key to helping me identify the right time to start looking for a new role and in giving me strategies for making the move.<br /><br />In preparing for Product Management specifically, I read the canonical books (e.g., Cracking the PM Interview), met with current Product Managers to learn from them, and did my own self study to brush up on my technical skills.<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-aGbkuu63vvc/XQ1KyJi05WI/AAAAAAAAAlg/S-y_dzwcZ2gDA1l2icJofySHqjLjvMxPwCEwYBhgL/s1600/00100dPORTRAIT_00100_BURST20190426145459707_COVER.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1600\" data-original-width=\"1200\" height=\"640\" src=\"https://1.bp.blogspot.com/-aGbkuu63vvc/XQ1KyJi05WI/AAAAAAAAAlg/S-y_dzwcZ2gDA1l2icJofySHqjLjvMxPwCEwYBhgL/s640/00100dPORTRAIT_00100_BURST20190426145459707_COVER.jpg\" width=\"480\" /></a></div><br /><b>Do you have any tips you’d like to share with aspiring Googlers?</b><br />Lean into your strengths! Yes, it’s important to make sure you’re being challenged and learning new things, but make sure you’re doing so in an environment in which you’re also building on the foundation of your natural strengths and interests.<br /><br /><br />Interested in making your first move at Google? Apply today: <a href=\"http://goo.gl/aoD9fB\">google.com/students</a><br /><div><br /></div></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google Students",
    "uri": "http://www.blogger.com/profile/15517669815238556768",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 13
}