{
  "id": "tag:blogger.com,1999:blog-2471378914199150966.post-7976712942944674585",
  "published": "2022-08-05T13:33:00.002-07:00",
  "updated": "2022-08-09T09:44:57.174-07:00",
  "category": "",
  "title": "Chrome 105 Beta: Custom Highlighting, Fetch Upload Streaming, and More",
  "content": "<p>Unless otherwise noted, changes described below apply to the newest Chrome beta channel release for Android, Chrome OS, Linux, macOS, and Windows. Learn more about the features listed here through the provided links or from the list on <a href=\"https://www.chromestatus.com/features#milestone%3D76\">ChromeStatus.com</a>. Chrome 105 is beta as of August 5th, 2022. You can <a href=\"https://www.google.com/chrome/beta/\">download the latest on Google.com</a> for desktop or on Google Play Store on Android. </p> <h1>Custom Highlight API</h1><p>The <a href=\"https://www.chromestatus.com/feature/5436441440026624\">Custom Highlight API</a> extends the concept of highlighting pseudo-elements by providing a way to style the text of arbitrary ranges, rather than being limited to the user agent-defined <code>::selection</code>, <code>::inactive-selection</code>, <code>::spelling-error</code>, and <code>::grammar-error</code>. This is useful in a variety of scenarios, including editing frameworks that wish to implement their own selection, find-in-page over virtualized documents, multiple selection to represent online collaboration, or spell checking frameworks.<br /><br />Without this feature, web developers and framework authors are forced to modify the underlying structure of the DOM tree to achieve the rendering they desire. This is complicated in cases where the desired highlight spans across multiple subtrees, and it also requires DOM updates to adjust highlights as they change. The custom highlight API provides a programmatic way of adding and removing highlights that does not affect the underlying DOM structure, but instead applies styles to text based on range objects.</p> <p>In 105, only the color and background-color pseudo elements are supported. Support for other items will be added later.</p> <h1>Container Queries</h1><p>Container queries allow authors to style elements according to the size of a container element. This capability means that a component owns its responsive styling logic. This makes the component much more resilient, as the styling logic is attached to it, no matter where it appears on the page. </p> <p>Container queries are similar to media queries, but evaluate against the size of a container rather than the size of the viewport. A known issue is that container queries do not work when an author combines it with table layout in a multicolumn layout. We expect to fix this in 106. For more information, see <a href=\"https://developer.chrome.com/blog/has-with-cq-m105\">@container and :has(): two powerful new responsive APIs</a>. For other CSS features in this release, see below.</p> <h1>:has() Pseudo Class</h1><p>The <code>:has()</code> pseudo class specifies an element having at least one element that matches the relative selector passed as an argument. Unlike other selectors, the <code>:has()</code> pseudo class applies, for a specified element, a style rule to preceding elements, specifically, siblings, ancestors, and preceding siblings of ancestors. For example, the following rule matches only anchor tags that have an image tag as a child. </p> <pre>a:has(&gt; img)<br /></pre> <p>For more information, see <a href=\"https://developer.chrome.com/blog/has-with-cq-m105\">@container and :has(): two powerful new responsive APIs</a>. For other CSS features in this release, see below.</p> <h1>Fetch Upload Streaming </h1><p>Fetch upload streaming lets web developers make a fetch with a <code><a href=\"https://developer.mozilla.org/en-US/docs/Web/API/ReadableStream\">ReadableStream</a></code> body. Previously, you could only start a request once you had the whole body ready to go. But now, you can start sending data while you're still generating the content, improving performance and memory usage.</p> <p>For example, an online form could initiate a fetch as soon as a user focuses a text input field. By the time the user clicks enter, <code>fetch()</code> headers would already have been sent. This feature also allows you to send content as it's generated on the client, such as audio and video. For more information, see <a href=\"https://web.dev/fetch-upload-streaming\">Streaming requests with the fetch API</a>.</p> <h1>Window Controls Overlay for Installed Desktop Web Apps</h1><p>Window controls overlay extends an app's client area to cover the entire window, including the title bar, and the window control buttons (close, maximize/restore, minimize). The web app developer is responsible for drawing and input handling for the entire window except for the window controls overlay. Developers can use this feature to make their installed desktop web apps look like operating system apps. For more information, see <a href=\"https://web.dev/window-controls-overlay/\">Customize the window controls overlay of your PWA's title bar</a>.</p> <div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgw6Cad1Wg5uzl7KrXRcLlMBnVW1U4Fwu1JJO_qza-IJifORk_yq3884EYYONblMHAi-Mc6-l-_CLmDBe_xuuKCQYj6JYoHmfGuFHh_EYkcz02A_ETOpW-laBFcnQeBdF_JyAbzk3Q-bUlmgfHsWyIdRhX27bHwfmMg_zEp8cFtC5RZJfd9gt1G-aczKQ/s1600/overlay.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"364\" data-original-width=\"1600\" height=\"148\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgw6Cad1Wg5uzl7KrXRcLlMBnVW1U4Fwu1JJO_qza-IJifORk_yq3884EYYONblMHAi-Mc6-l-_CLmDBe_xuuKCQYj6JYoHmfGuFHh_EYkcz02A_ETOpW-laBFcnQeBdF_JyAbzk3Q-bUlmgfHsWyIdRhX27bHwfmMg_zEp8cFtC5RZJfd9gt1G-aczKQ/w651-h148/overlay.png\" width=\"651\" /></a></div> <h1>Origin Trials</h1><p>No origin trials are beginning in this version of Chrome. However there are a number of ongoing origin trials which you can find on the <a href=\"https://developers.chrome.com/origintrials/#/trials/active\">Chrome Origin Trials dashboard</a>. Origin trials allow you to try new features and give feedback on usability, practicality, and effectiveness to the web standards community. To learn more about origin trials in Chrome, visit the <a href=\"https://web.dev/origin-trials/\">Origin Trials Guide for Web Developers</a>. Microsoft Edge runs its own origin trials separate from Chrome. To learn more, see the <a href=\"https://developer.microsoft.com/en-us/microsoft-edge/origin-trials/\">Microsoft Edge Origin Trials Developer Console</a>. </p> <h2>Completed Origin Trials</h2><p>The following features, previously in a Chrome origin trial, are now enabled by default.</p> <h2>Media Source Extensions in Workers</h2><p>The Media Source Extensions (MSE) API is <a href=\"https://www.chromestatus.com/feature/5177263249162240\">now available from <code>DedicatedWorker</code> contexts</a> to enable improved performance of buffering media for playback by an <code>HTMLMediaElement</code> on the main Window context. By creating a <code>MediaSource</code> object in a <code>DedicatedWorker</code>, an application may then obtain a <code>MediaSourceHandle</code> from it and call <code>postMessage()</code> to transfer it to the main thread for attaching to an <code>HTMLMediaElement</code>. The context that created the <code>MediaSource</code> object may then use it to buffer media.</p> <h2>Viewport-height Client Hint</h2><p>Chrome supports the new <a href=\"https://www.chromestatus.com/feature/5646861215989760\"><code>Sec-CH-Viewport-Height</code> client hint</a>. This is a counterpart to the <code>Sec-CH-Viewport-Width</code> previously introduced in Chrome. Together they provide information about a viewport's size to an origin. To use these hints, pass <code>Sec-CH-Viewport-Height</code> or <code>Sec-CH-Viewport-Width</code> to the <code>Accept-CH</code> header. </p> <h1>Other Features in this Release</h1> <h2>Accurate Screen Labels for Multi-Screen Window Placement</h2><p>This release enhances the screen label strings provided by the <a href=\"https://web.dev/multi-screen-window-placement/\">Multi-Screen Window Placement API</a>. Specifically, it refines <code>ScreenDetailed.label</code> property by replacing the previous placeholders with information from the device's Extended Display Identification Data (EDID) or from a higher-level operating system API. For example, instead of returning \"External Display 1\", the label property will now return something like \"HP z27n\" or \"Built-in Retina Display\". These more accurate labels match those shown by operating systems in display settings dialog boxes. The labels are only exposed to sites that have been granted the <code>\"window-placement\"</code> permission by the user.</p> <h2>CSS: Preventing Overscroll Effects for Fixed Elements</h2><p>Setting an element's <code>position</code> CSS property to <code>fixed</code> (unless the element's <a href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/Containing_block\">containing block</a> is not the root) will now prevent it from performing the effects specified by overscroll-behavior. In particular, <code>fixed-position</code> elements will not move during overscroll effects.</p> <h2>DisplayMediaStreamConstraints.systemAudio</h2><p>A <a href=\"https://www.chromestatus.com/feature/4649448880734208\">new constraint is being added</a> to <code>MediaDevices.getDisplayMedia()</code> to indicate whether system audio should be offered to the user. User agents sometimes offer audio for capturing alongside video. But not all audio is created alike. Consider video-conferencing applications. Tab audio is often useful, and can be shared with remote participants. But system audio includes participants' own audio, and may not be appropriate to share back. To use the new constraint, pass <code>systemAudio</code> as a constraint. For example:</p> <pre>const stream = await navigator.mediaDevices.getDisplayMedia({<br />  video: true,<br />  audio: true,<br />  systemAudio: \"exclude\"  // or \"include\"<br />});</pre> <p>This feature is only supported on desktop.</p> <h2>Expose TransformStreamDefaultController</h2><p>To conform with spec the <code>TransformStreamDefaultController</code> class is <a href=\"https://www.chromestatus.com/feature/5130793182035968\">now available on the global scope</a>. This class already exists and can be accessed using code such as<br /><br /><code>let TransformStreamDefaultController;<br />new TransformStream({ start(c) { TransformStreamDefaultController = c.constructor; } });</code><br /><br />This change makes such code unnecessary since <code>TransformStreamDefaultController</code> is now on the global scope. Possible uses for this class include monkey patching properties onto <code>TransformStreamDefaultController.prototype</code>, or feature-testing existing properties of it more easily. Note that the class is not constructible. In other words, this throws an error:</p> <p><code>new TransformStreamDefaultController()</code> </p> <h2>HTML Sanitizer API </h2><p>The HTML Sanitizer API is an easy to use and safe way to remove executable code from arbitrary, user-supplied content. The goal of the API is to make it easier to build web applications that are free of cross-site scripting vulnerabilities and ship part of the maintenance burden for such apps to the platform. </p> <p>In this release, only basic functionality is supported, specifically <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Element/setHTML\"><code>Element.setHTML()</code></a>. The Sanitize interface will be added at a later stage. Namespaced content (SVG + MathML) is not yet supported, only HTML. For more information on the API, see <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/HTML_Sanitizer_API\">HTML Sanitizer API - Web APIs</a>.</p> <h2>import.meta.resolve()</h2><p>The <a href=\"https://www.chromestatus.com/feature/5086507990777856\"><code>import.meta.resolve()</code> method</a> returns the URL to which the passed specifier would resolve in the context of the current script. That is, it returns the URL that would be imported if you called <code>import()</code>. A specifier is a URL beginning with a valid scheme or one of <code>/</code>, <code>./</code>, or <code>../</code>. See the HTML spec for <a href=\"https://html.spec.whatwg.org/#resolve-a-module-specifier\">examples</a>.</p> <p>This method makes it easier to write scripts which are not sensitive to their exact location, or to the web application's module setup. Some of its capabilities are doable today, in a longer form, by combining <code>new URL()</code> and the existing <code>import.meta.url()</code> method. But the integration with import maps allows resolving URLs that are affected by import maps.</p> <h2>Improvements to the Navigation API</h2><p>Chrome 105 introduces two new methods on the NavigateEvent of the <a href=\"https://developer.chrome.com/docs/web-platform/navigation-api/\">Navigation API</a> (introduced in 102) to improve on methods that have proved problematic in practice. <code>intercept()</code>, which let's developers control the state following the navigation, replaces <code>transitionWhile()</code>, which proved difficult to use. The <code>scroll()</code> method, which scrolls to an anchor specified in the URL, replaces <code>restoreScroll()</code> which does not work for all types of navigation. For explanations of the problems with the existing methods and examples of using the new, see <a href=\"https://developer.chrome.com/blog/navigateevent-intercept/\">Changes to NavigateEvent</a>.</p> <p>The <code>transitionWhile()</code> and <code>restoreScroll()</code> methods are also deprecated in this release. We expect to remove them in 108. See below for <a href=\"#Deprecations-and-Removals\">other deprecations and removals</a> in this release.</p> <h2>onbeforeinput Global Event Handler Content Attribute</h2><p>The <a href=\"https://www.chromestatus.com/feature/6627326972919808\"><code>nbeforeinput</code> global content attribute is now supported</a> in Chrome. The <code>beforeinput</code> form was already available via <code>addEventListener()</code>. Chrome now also allows feature detection by testing against d<code>ocument.documentElement.onbeforeinput</code></p> <h2>Opaque Response Blocking v0.1</h2><p><a href=\"https://chromestatus.com/feature/4933785622675456\">Opaque Response Blocking (ORB)</a> is a replacement for Cross-Origin Read Blocking (CORB). CORB and ORB are both heuristics that attempt to prevent cross-origin disclosure of \"no-cors\" subresources.  </p> <h2>Picture-in-Picture API Comes to Android</h2><p>The Picture-in-Picture API allows websites to create a floating video window that is always on top of other windows so that users may continue consuming media while they interact with other sites or applications on their device. This feature has been available on desktop since Chrome 70. It's now available for Chrome running on Android 11 or later. This change only applies to <code>&lt;video&gt;</code> elements. For information on using the Picture-in-Picture API, see <a href=\"https://developer.chrome.com/blog/watch-video-using-picture-in-picture/\">Watch video using Picture-in-Picture</a>.</p> <h2>Response.json()</h2><p>The <code>Response()</code> constructor allows for creating the body of the response from many types; however the existing <code>response.json()</code> instance method does not let you directly create a JSON object. The <a href=\"https://www.chromestatus.com/feature/5197912798658560\"><code>Response.json()</code> static method</a> fills this gap. </p> <p>Response.json() returns a new Response object and takes two arguments. The first argument takes a string to convert to JSON. The second is an optional initialization object.</p> <h2>Syntax Changes to Markup Based Client Hints Delegation</h2><p>The <a href=\"https://www.chromestatus.com/feature/6308751530262528\">syntax for the delegation of client hints to third-party content</a> that requires client information lost by user agent reduction, which shipped in Chrome 100, is changing.</p> <p><strong>Previous syntax:</strong><br /><code>&lt;meta name=\"accept-ch\" value=\"sec-ch-dpr=(https://foo.bar  https://baz.qux), sec-ch-width=(https://foo.bar)\"&gt;</code><br /><br /><strong>New syntax:</strong><br /><code>&lt;meta http-equiv=\"delegate-ch\" value=\"sec-ch-dpr https://foo.bar https://baz.qux; sec-ch-width https://foo.bar\"&gt;</code></p> <h2>Writable Directory Prompts for the File System Access API</h2><p>Chromium now allows <a href=\"https://chromestatus.com/feature/6383970247770112\">returning a directory with both read and write permissions</a> in a single prompt for the <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/File_System_Access_API\">File System Access API</a>. Previously, <code>Window.showDirectoryPicker()</code> returned a read-only directory (after showing a read access prompt), requiring a second prompt to get write access. This double prompt is a poor user experience and contributes to confusion and permission fatigue among users.</p> <h1>Deprecations, and Removals</h1><p>This version of Chrome introduces the deprecations and removals listed below. Visit ChromeStatus.com for lists of planned deprecations,  <a href=\"https://www.chromestatus.com/features#browsers.chrome.status%3A%22Deprecated%22\">current deprecations</a>  and <a href=\"https://www.chromestatus.com/features#browsers.chrome.status:%22Removed%22\">previous removals</a>.</p> <h2>Remove WebSQL in Non-secure Contexts</h2><p>WebSQL in non-secure contexts <a href=\"https://www.chromestatus.com/feature/5175124599767040\">is now removed</a>. The Web SQL Database standard was first proposed in April 2009 and abandoned in November 2010. Gecko never implemented this feature and WebKit deprecated it in 2019. The W3C encourages Web Storage and Indexed Database for those needing alternatives.</p> <p>Developers should expect that WebSQL itself will be deprecated and removed when usage is low enough.</p> <h2>CSS Default Keyword is Disallowed in Custom Identifiers</h2><p>The CSS keyword <a href=\"https://chromestatus.com/feature/5096490737860608\"><code>'default'</code> is no longer allowed</a> within CSS custom identifiers, which are used for many types of user-defined names in CSS (for example, names created by <code>@keyframes</code> rules, counters, <code>@container</code> names, custom layout or paint names). This adds <code>'default'</code> to the list of names that are restricted from use in custom identifiers, specifically <code>'inherit'</code>, <code>'initial'</code>, <code>'unset'</code>, <code>'revert'</code>, and <code>'revert-layer'</code>.</p> <h2>Deprecations in the Navigation API</h2><p>The <code>transitionWhile()</code> and <code>restoreScroll()</code> methods are also deprecated in this release, and we expect to remove them in 108. Developers who need this functionality should use the new <code>intercept()</code> and <code>scroll()</code> methods. For explanations of the problems with the existing methods and examples of using the new, see <a href=\"https://developer.chrome.com/blog/navigateevent-intercept/\">Changes to NavigateEvent</a> .</p> <h2>Deprecate Non-ASCII Characters in Cookie Domain Attributes</h2><p>To align with the latest spec (<a href=\"https://datatracker.ietf.org/doc/html/draft-ietf-httpbis-rfc6265bis/#section-5.5\">RFC 6265bis</a>), <a href=\"https://www.chromestatus.com/feature/5534966262792192\">Chromium will soon reject</a> cookies with a <code>Domain</code> attribute that contains a non-ASCII character (for example, <code>Domain=éxample.com</code>).<br />Support for IDN domain attributes in cookies has been long unspecified, with Chromium, Safari, and Firefox all behaving differently. This change standardizes Firefox's behavior of rejecting cookies with non-ASCII domain attributes.<br /><br />Since Chromium has previously accepted non-ASCII characters and tried to convert them to normalized punycode for storage, we will now apply stricter rules and require valid ASCII (punycode if applicable) domain attributes.</p> <p>A warning is printed to the console starting in 105. Removal is expected in 106. </p> <h2>Remove Gesture Scroll DOM Events</h2><p>The gesture scroll DOM events <a href=\"https://chromestatus.com/feature/5166018807726080\">have been removed from Chrome</a>, specifically, <code>gesturescrollstart</code>, <code>gesturescrollupdate</code> and <code>gesturescrollend</code>. These were non-standard APIs that were added to Blink for use in plugins, but had also been exposed to the web. </p>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Chromium Blog",
    "uri": "http://www.blogger.com/profile/06394244468194711527",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}