{
  "id": "tag:blogger.com,1999:blog-4371296950668142214.post-474595221251677826",
  "published": "2020-11-26T11:00:00.003+11:00",
  "updated": "2020-11-27T07:20:39.378+11:00",
  "title": "Celebrating the Outstanding 50 LGBTI+ Leaders of 2020",
  "content": "Diversity, inclusion and equity have always been important parts of what we do at Google. They are values at the heart of everything from building our products, to developing our workforce.&nbsp;<div><br /></div><div><br /></div><div>And it’s an important part of our mission: ‘to organise the world’s information and make it universally accessible and useful’. That one word - ‘universal’ - says everything about how we think when we’re designing products that aim to be useful and helpful to everyone.&nbsp;</div><div><br /></div><div><br /></div><div>That’s why Google is extremely proud to once again partner with Deloitte and EnergyAustralia in supporting the <a href=\"https://www2.deloitte.com/au/en/pages/about-deloitte/articles/out50.html\">Outstanding 50 LGBTI+ Leaders Report</a> - recognising and celebrating remarkable role models across the country.&nbsp;</div><div><br /></div><div><br /></div><div>2020’s list is incredibly inspiring and it’s been humbling to read through the stories and achievements of leaders in so many diverse industries - from business and corporate Australia, to public service, diversity and inclusion, the not-for-profit sector, and social justice.&nbsp;</div><div><br /></div><div><br /></div><div>This year, we are especially proud to support the initiative because our very own Googler, Tara Mckenty, has been recognised amongst the esteemed field. This is the second time a Googler has received the honour, following <a href=\"https://www2.deloitte.com/au/en/pages/about-deloitte/articles/out50.html\">Tea Uglow’s recognition in 2018</a>.&nbsp;</div><div><br /></div><div><br /></div><div>Tara is Google’s Creative Director and Founder of <a href=\"https://rare.withgoogle.com/\">Rare</a>, Google's diversity and inclusion initiative for the creative industries. Her tireless efforts to increase diversity and inclusion, and ensure advertising represents diverse perspectives, inspire many at Google and have rightly earned her a place on this Outstanding 50 LGBTI+ Leaders Report.&nbsp; &nbsp;&nbsp;</div><div><br /></div><div><br /></div><div>Throughout her seven years’ with Google, Tara has also led the creative execution of Google’s Mardi Gras initiatives (<a href=\"https://mashable.com/2016/02/19/google-lets-you-spread-your-love-on-a-world-map/\">Places of Pride and Love by Numbers</a>), ensured diverse talent is represented in all communications, and built a platform to help remove unconscious bias from machine learning algorithms (<a href=\"https://projectrespect.withgoogle.com/\">Project Respect</a>). Tara’s passion about diversity, inclusion and equity in the creative industries and using advertising as a medium for social good shines through in her work at all times.&nbsp;</div><div><br /></div><div><br /></div><div>“I’ve tried to be open and out about my identity, to ensure that the generation behind me has visible LGBTI+ role models, so they can see what they want to be, and know that there is a place in our industry for people like us,” Tara says.&nbsp;</div><div><br /></div><div><br /></div><div>You can read more about Tara’s experience and those of the other inspiring leaders in the Outstanding 50 LGBTI+ Leaders Report <a href=\"https://www2.deloitte.com/au/en/pages/about-deloitte/articles/out50.html\">here</a>.&nbsp;</div><div><br /></div><div><br /></div><div>Congratulations to all nominees and finalists - thank you for continuing to inspire LGBTI+ communities and allies.&nbsp;</div><div><i><span style=\"font-size: x-small;\"><br /></span></i></div><div><i><span style=\"font-size: x-small;\">Posted by Aisling Finch, Director of Marketing, Google Australia</span></i></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "anzprteam",
    "uri": "http://www.blogger.com/profile/06099752084931732403",
    "email": "noreply@blogger.com",
    "gd:image": ""
  }
}