{
  "title": "This is how much it costs to run a smart garden, and how much it can save",
  "link": "https://www.digitaltrends.com/home/true-cost-smart-garden/",
  "pubDate": "Sat, 05 Nov 2022 10:15:11 +0000",
  "dc:creator": "Patrick Hearn",
  "category": [
    "Features",
    "Smart Home",
    "Energy",
    "garden",
    "hydroponics",
    "smart garden",
    "smart home"
  ],
  "guid": "https://www.digitaltrends.com/?p=3220022",
  "description": "Smart gardens are pitched as a way to cut down on produce costs, but are they really cost-efficient? ",
  "content:encoded": "<p>I&#8217;ve talked a lot about smart gardens before. They&#8217;re one of my favorite smart home devices overall, especially with the rising cost of fresh produce and with winter just around the corner. I like fresh ingredients, and it&#8217;s often less expensive to grow them at home than it is to go to the store and buy them.</p>\n<p>On the other hand, it&#8217;s not always easy for someone to do that if they live in an apartment. Balconies don&#8217;t always get enough sunlight (as my failed experiment to grow potatoes this year can attest), and the available yield is small. <a href=\"https://www.digitaltrends.com/home/rise-garden-makes-growing-veggies-easy/\">Smart gardens </a>offer an easy way to circumvent these woes by controlling the light output and watering schedule and taking the guesswork out of the process.</p>\n<p>But are they really worthwhile, or do you end up spending more money in the long run? I sat down to take a look at the actual costs of a smart garden, from the initial purchase cost to the day-to-day operating costs.</p>\n<p>Bear with me. Many of these numbers are rough estimates, and some are simplified to make the calculations easier to follow, but the end result should be a decent estimate of the overall cost of a smart garden.</p>\n<figure class=\"alignnone\"><img  class=\" size-large wp-image-3113163\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/06/AeroGarden-Harvest-copy.jpg?fit=720%2C479&p=1\" alt=\"The AeroGarden Harvest with a full crop of plants.\"   /></figure>\n<h2>Smart gardens can be expensive</h2>\n<p>For this piece, I wanted to look at a garden that could produce a truly decent yield. While I adore my <a href=\"https://www.digitaltrends.com/home/aerogarden-smart-garden-review/\">AeroGarden</a>, it&#8217;s not quite enough for more than one or two salads for my wife and me. Instead, I chose to use the Gardyn 3.0 as my starting point.</p>\n<p>The Gardyn 3.0 is $999 retail. That&#8217;s a <em>lot</em> of money for a smart device, but it can grow 30 plants at once and includes 30 yCubesn(Gardyn&#8217;s version of a plant starter pod) with purchase.</p>\n<p>At $4 per bagged salad, you&#8217;re looking at the equivalent of 250 meals right away. The <a href=\"https://www.digitaltrends.com/home/gardyn-review-easy-gardening-high-price/\">Gardyn</a> might pay for itself in the long run, but you&#8217;re going to feel the expense upfront.</p>\n<h2>Smart gardens have consistent yields</h2>\n<p>If you&#8217;re following the growing steps, you should see anywhere from 8 to 10 pounds of produce per month from the Gardyn 3.0. It can grow a wide variety of different plants, so the value of that produce might vary wildly. Add a few extra dollars to any calculations, though; since the Gardyn grows without pesticides, it could practically be called organic.</p>\n<figure class=\"alignnone\"><img  class=\" size-large wp-image-3210674\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/10/Gardyn-Kitchen.jpg?fit=647%2C720&p=1\" alt=\"The Gardyn in someone's kitchen.\"   /></figure>\n<p>With that in mind, let&#8217;s do a bit of math. According to FoodCoop.com, a pound of organic iceberg lettuce is roughly $3.91. At a generous estimate of 10 pounds of produce each month, the Gardyn produces $39 worth of food. At that rate, it would take just over two years to pay for itself &#8212; but wait, we can&#8217;t forget the cost of electricity and water.</p>\n<h2>Utility costs contribute more than you might expect</h2>\n<p>The Gardyn produces so much produce thanks to a combination of automatic watering and two powerful LED grow lights. According to Gardyn&#8217;s FAQ page, these lights use about 75 watts per second on average. Following the recommended schedule, you&#8217;re looking at about 54kWh per month of energy use.</p>\n<p>The average <a href=\"https://www.digitaltrends.com/home/how-to-measure-home-energy-use/\">rate of electricity</a> in my home state is about $0.1226 per kilowatt hour, which translates to about $6.62 per month in electrical costs just to run the Gardyn.</p>\n<p>You also need to factor in water costs. The Gardyn has a 6-gallon tank, and though it does use 95% less water than similar systems, it will need to be topped off about once per week when the plants are mature. We&#8217;ll say 20 gallons of water per month.</p>\n<figure id=\"attachment_2646097\" aria-describedby=\"caption-attachment-2646097\" class=\"wp-caption alignnone\"><img  class=\" size-large wp-image-2646097\" src=\"https://www.digitaltrends.com/wp-content/uploads/2021/04/rise-garden-personal.jpg?fit=720%2C480&p=1\" alt=\"rise gardens: personal garden\"   /><figcaption id=\"caption-attachment-2646097\" class=\"wp-caption-text\"><span class=\"credit\">Rise Gardens</span></figcaption></figure>\n<p>Water costs in the U.S are about $1.50 per 1,000 gallons. The cost of 20 gallons is minuscule and hardly worth consideration.</p>\n<h2>Plants cost money, too</h2>\n<p>The Gardyn 3.0 includes 30 plants out of the box, and the company says they should last about three months before they stop yielding and need to be replaced. The yCube pods cost about $5 each, so a full replacement would cost $150. However, Gardyn offers a membership that provides users with 10 free yCubes per month.</p>\n<p>That membership is $34 per month for one year or $29 per month for two years. If you pay strictly monthly, it&#8217;s $39. We&#8217;ll assume a two-year membership.</p>\n<p>As I established before, the Gardyn will yield around $39 of value each month. With a $29 membership fee and $6 in utilities, that&#8217;s only $4 in savings.</p>\n<p>That said, it&#8217;s entirely possible to make your own yCubes and grow them in the Gardyn. There&#8217;s an entire thriving community of users that do exactly that.</p>\n<h2>Does a smart garden actually save money?</h2>\n<p>Truthfully, not really. The amount of time it would take to pay off the initial cost of a smart garden means you would need to use it for several years before you saw any return on investment, at which time the day-to-day maintenance costs and replacement parts would likely destroy any real savings.</p>\n<figure class=\"alignnone\"><img  class=\" size-large wp-image-2969411\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/01/lg-tiiun_product-0.jpg?fit=720%2C480&p=1\" alt=\"LG tiiun indoor garden.\"   /></figure>\n<p>Smart gardens shouldn&#8217;t be thought of as a way to save money, but as an alternative way to grow plants for yourself. The produce you buy in-store isn&#8217;t going to be as high quality as what you grow at home, and you&#8217;ll get better taste, color, and crunch from a smart garden yield.</p>\n<p>It&#8217;s definitely a luxury item. If you&#8217;re trying to cut out all unnecessary expenses, a smart garden isn&#8217;t the way to go (although growing your own produce in a backyard garden might help cut costs). Instead, think of a smart garden as a fun way to grow plants indoors and add a few more greens to your diet, rather than a self-sustaining system for growing your own food.</p>\n",
  "thumbnail": "https://www.digitaltrends.com/wp-content/uploads/2019/05/smart-garden-3.jpg?p=1",
  "enclosure": "",
  "post-id": 3220022
}