{
  "id": "tag:blogger.com,1999:blog-4371296950668142214.post-791693793634465853",
  "published": "2020-10-30T09:00:00.067+11:00",
  "updated": "2020-10-30T10:42:56.342+11:00",
  "title": "Reflecting on our Google News Initiative work in Australia",
  "content": "Today, we reflect on the past two years of the Google News Initiative as we publish our first <a href=\"https://newsinitiative.withgoogle.com/impact/\">GNI Impact Report</a>. We’re proud of our efforts across Australia and the work we’ve accomplished in this time with our news industry partners, right across the country and the world. While facing a challenging regulatory process in the shape of a problematic News Media Bargaining Code, we've worked positively with news publishers since 2004 and are pushing for a workable code to build on that foundation. Despite the challenges of the pandemic and long-term shifts in consumer behaviour that have upended traditional business models, there is reason for hope and optimism. We’ve seen Australian journalism demonstrate its incredible resilience, entrepreneurship and diversity.&nbsp;<div><br /></div><div><br /></div><div><div>We’ve also learned that crises can be unexpected and require unprecedented support. That’s why when the COVID-19 pandemic swept through the world, we refocused our efforts. Through the Journalism Emergency Relief Fund, we were able to provide financial support to 97 news organisations across the country, with recipients able to use the funds in whatever way would help them. For example, <a href=\"https://www.murraypioneer.com.au/\">The Murray Pioneer</a> adapted their entire workflow to a remote working situation, while building ways to maintain business relationships with advertisers.&nbsp;</div><div><br /></div><div><br /></div><div>Our work in Australia during the pandemic also <a href=\"https://australia.googleblog.com/2020/04/how-were-responding-to-covid-19.html\">tackled misinformation</a>. Because access to primary expert sources during an evolving public health crisis is both challenging and fundamental for journalists covering the story, we provided funding to the <a href=\"https://www.smc.org.au/\">Australian Science Media Centre</a>, creators of <a href=\"http://Scimex.org\">Scimex.org</a>. They worked with more than 85 COVID-19 experts and organised 60 <a href=\"https://www.scimex.org/info/coronavirus\">expert reactions</a> from leaders in the fields of science and health, explainers, briefings and myth busters on COVID-19, all of which informed more than 30,000 news stories in Australia and overseas. GNI funds also allowed the Centre to hire an additional media officer for six months.&nbsp;</div><div><br /></div><div><br /></div><div>As we look back beyond this year, here are the highlights of our work in Australia, which spanned three key areas:&nbsp;</div><div><br /></div><div><br /></div><div><b>Elevating quality journalism</b>&nbsp;</div><div>Supporting newsrooms in delivering quality reporting sits at the heart of the GNI’s mission, and our work in Australia was deeply rooted in supporting editorial talent in that endeavour. We have appointed Teaching Fellows and partnered with the <a href=\"https://australia.googleblog.com/2019/02/partnering-with-walkley-foundation-to.html\">Walkley Foundation</a> to provide training across Australia to help make sure that journalists and media organisations have the digital skills to succeed at their craft. Since the program launched in February 2019, we’ve been able to train thousands of journalists across more than 200 newsrooms in the country.&nbsp;</div><div><br /></div><div><br /></div><div>It’s when citizens have to vote that they rely the most on quality news content. To navigate last year’s Federal Election, the Google News Lab supported the Australian Associated Press (AAP) in its election verification service, sending alerts to newsrooms and offering workshops to help journalists access the latest tools and technology to tackle disinformation and support their coverage of the elections. Ahead of the election, we also <a href=\"https://australia.googleblog.com/2019/04/federal-election-2019-helping-explore.html\">helped First Draft launch its first bureau in Asia Pacific</a> (APAC) to assist journalists and publishers unearth and expose misleading, false and untrue claims.&nbsp;</div><div><br /></div><div><br /></div><div>But our work doesn’t stop at how news is being reported on, we also deeply care about who is writing the news, because diversity and inclusion in newsrooms impact the reporting made available to citizens. That’s why we partnered with <a href=\"https://www.mediadiversityaustralia.org/\">Media Diversity Australia</a> to release a landmark report on diversity in Australia’s broadcast news. “<a href=\"https://www.mediadiversityaustralia.org/wp-content/uploads/2020/08/Who-Gets-To-Tell-Australian-Stories_LAUNCH-VERSION.pdf\">Who Gets To Tell Australian Stories?</a>” found that almost 76 percent of those on Australian screens were of an Anglo-Celtic background, while just six percent were from Indigenous or non-European backgrounds. We’re confident that by sharing these findings, newsrooms will be able to consider more closely their diversity and inclusion practices.</div><div><br />&nbsp; <div class=\"separator\" style=\"clear: both;\"><span id=\"docs-internal-guid-64c16961-7fff-e179-c614-c205f1bf9479\"><span style=\"font-family: &quot;Google Sans&quot;, sans-serif; font-size: 11pt; font-variant-east-asian: normal; font-variant-numeric: normal; vertical-align: baseline; white-space: pre-wrap;\"></span></span><span style=\"border: none; display: inline-block; height: 352px; margin-left: 1em; margin-right: 1em; overflow: hidden; width: 624px;\"><img height=\"352\" src=\"https://lh5.googleusercontent.com/wX6FhHXNFlqIFYe3FvXYsWBCAaF6w9pIZtYFuXWRZpwBMoUfQ4QdW9OtGEMEYTFBU-dbPebWIjPkkxwkRds9p3LwZNFSTgsY7v-Q-NJKx6GtinlwdqXgp1xL-caA5nJJ2H4fN_PHeA\" style=\"margin-left: 0px; margin-top: 0px;\" width=\"624\" /></span></div>&nbsp;</div><div><br /></div><div><br /></div><div><b>Empowering sustainable business growth&nbsp;</b></div><div>Readers’ consumption habits have changed, and media have had to adapt to this ever-evolving environment. That’s why since late 2019, we have worked on a News Lab pilot program in Australia to build digital skills and capacity among regional publishers, and to research and test new small-scale digital publishing models. The programs, such as <a href=\"https://www.walkleys.com/project-kookaburra-webinar-series/\">Project Kookaburr</a>a, focus on specific publishers but share common themes, namely optimising revenue, increasing use of audience engagement data and insights, and supporting organisational transformation. Through this work, publications have been able to achieve goals such as increasing their advertising revenues, better understanding their audiences, and expanding their news coverage.&nbsp;</div><div><br /></div><div><br /></div><div>We also work with bigger media organisations like Nine to implement <a href=\"https://developers.google.com/news/subscribe#:~:text=Subscribe%20with%20Google%20is%20a,across%20Google%20and%20the%20web.\">Subscribe with Google</a> into their publications, The Sydney Morning Herald and The Age. Subscribe with Google makes it easier for readers to subscribe to premium content online in a seamless way.&nbsp;</div><div><br /></div><div><br /></div><div>At Google, we work to increase the value of our partnership to publishers by ensuring their content reaches as many people as possible. As part of the YouTube Player for Publisher program, we worked with Junkee Media and Southern Cross Austereo to reduce complexity and increase audience reach.&nbsp;</div><div><br /></div><div><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><span style=\"border: none; display: inline-block; height: 349px; margin-left: 1em; margin-right: 1em; overflow: hidden; width: 624px;\"><img height=\"349\" src=\"https://lh5.googleusercontent.com/kXbIrNRGdQQrYmJfHJ_ouEISejM3wSS2AtZiysunsCFxajVwdcErbfkWO7BjXsDOGnGWSFgcOCcgDCri-pI9rDa0mDGPFm1uFVGWs7OUltaxXXegKsDYfgg04_ERLSKzSA_YmEFN3w\" style=\"margin-left: 0px; margin-top: 0px;\" width=\"624\" /></span></div><div><span id=\"docs-internal-guid-3d61fb33-7fff-52d1-e154-e6b18a8c5fab\"><span style=\"font-family: Arial; font-size: 11pt; font-variant-east-asian: normal; font-variant-numeric: normal; vertical-align: baseline; white-space: pre-wrap;\"></span></span></div><div><br /></div><div><br /></div><div><b>Empowering newsrooms through innovation&nbsp;</b></div><div>While the media may face many challenges today, continuous innovation is the key to sustainable business models. We have seen that innovative spirit shine through our interactions with many Australian publications and journalists. Last year, two Australian editors from the Brisbane Times and Australian Community Media (ACM) were chosen among 12 Fellows for the <a href=\"https://www.blog.google/outreach-initiatives/google-news-initiative/backing-asia-pacifics-emerging-newsroom-leaders/\">Google News Initiative Newsroom Leadership Program</a>, a collaboration between GNI and the Columbia School of Journalism, to develop the business and product expertise of emerging newsroom leaders from the APAC region.&nbsp;</div><div><br /></div><div><br /></div><div>Seven Australian media outlets (Crikey, the Community Broadcasting Association of Australia, Women's Agenda, Guardian Australia, Mamamia, The Conversation, and Australian Community Media) are recipients of our GNI APAC<a href=\"https://newsinitiative.withgoogle.com/intl/en_gb/innovation-challenges/funding/\"> Innovation Challenges</a>, and Junkee Media and Nine News Australia received GNI YouTube Innovation Funding. Both programs fund projects that inject new ideas into the news industry, and we hope to be able to share the successes soon.&nbsp;</div><div><br /></div><div><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><span style=\"border: none; display: inline-block; height: 349px; margin-left: 1em; margin-right: 1em; overflow: hidden; width: 624px;\"><img height=\"349\" src=\"https://lh5.googleusercontent.com/zGuB5jeGwhgoXLeH41aT4Qc59RF6uMxf9ekgUlQ9Qp8EDkmIkMVb7QvtpX2pBwOLSFFnl3tkoJSy2zpAe-1Ou-_0gJkZSF_tX_qYiglIqK1zJVjr3SkDcQbjSUDowehxXJG0hP4wWw\" style=\"margin-left: 0px; margin-top: 0px;\" width=\"624\" /></span></div><div><span id=\"docs-internal-guid-ced07274-7fff-e5c6-e198-90431f73e2aa\"><span style=\"background-color: white; color: #3c4043; font-family: &quot;Google Sans&quot;, sans-serif; font-size: 10.5pt; font-variant-east-asian: normal; font-variant-numeric: normal; vertical-align: baseline; white-space: pre-wrap;\"></span></span></div><div><br /></div><div><br /></div><div><b>What’s next?</b>&nbsp;</div><div>Despite the enormous progress that's been made to help create a sustainable future for journalism in Australia, there is still much work to be done. We’ve recently launched the <a href=\"https://newsinitiative.withgoogle.com/intl/en_gb/digital-growth/apac-overview/\">GNI Digital Growth Program</a> in Australia, which has been designed with industry experts and news publishers across the world to help small and medium-sized news organisations grow their digital businesses. <a href=\"https://newsonair.withgoogle.com/events/dgp-apac-reader-revenue?talk=developing-communicating-value-prop\">We invite Australian media</a> to course through a range of free playbooks, interactive exercises, digital workshops and labs. We look forward to continuing our important work with local publishers across the country.</div></div><div><br /></div><div><span id=\"docs-internal-guid-a3fc286d-7fff-f215-2995-b656a4544ec2\"><span face=\"&quot;Google Sans&quot;, sans-serif\" style=\"font-variant-east-asian: normal; font-variant-numeric: normal; vertical-align: baseline; white-space: pre-wrap;\"><span style=\"font-size: xx-small;\">&nbsp;</span></span></span><i>Posted by Nic Hopkins, News Lab Lead, Australia and New Zealand.</i></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "anzprteam",
    "uri": "http://www.blogger.com/profile/06099752084931732403",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}