{
  "title": "S1E29 - Finding the Positive Side of Challenges with Paralympic Champion Allysa Seely",
  "guid": "https://pinecast.com/guid/e5b17142-223e-4038-8fb5-b4531bc0d4c6",
  "pubDate": "Tue, 22 Dec 2020 07:30:00 -0000",
  "itunes:duration": "00:51:11",
  "description": "<p>Joining Laura on today’s episode is the incredibly inspiring American Paralympic champion, Allysa Seely. Diagnosed with a combination of brain, spinal and connectivity disorders which eventually led to the amputation of her left leg below the knee, Allysa responded by going on to become a 3-time World Champion and a Paralympic Gold Medalist. Despite the challenges presented by her ongoing medical concerns, Allysa continues to persevere, and is currently training with an eye to competing in the Tokyo Paralympic Games in 2021. Hers is a story of exemplary commitment, resilience, and determination, and she shares it all with Laura here today.\n \nThey begin by discussing the story behind the unique spelling of Allysa’s name and her DIY projects, which gives just a taste of her remarkable commitment to achievement. Allysa then shares the details of her start in the triathlon, her diagnosis and its ongoing impact, her journey as a paratriathlete and the great success she has achieved therein, as well as her preparation for the upcoming Paralympics. She also discusses the importance of her team, her unique nutrition necessities, her ESPN Body Issue experience, and how she is feeling these days since a recent stint in the hospital. Make no mistake, Allysa’s story is not solely about her diagnosis and the impact it has had upon her life. It is about having the steely resolve to recognize challenges, meet them head on, and go beyond simply overcoming them to actually using them as fuel to achieve even greater results, rendering Allysa Seely a truly inspiring example for everyone to follow not only in sport but in every aspect of life.</p>\n<p>Episode Highlights:\n </p>\n<ul>\n<li>Some of Allysa’s DIY projects</li>\n<li>Her start in the triathlon</li>\n<li>Allysa’s diagnosis of Chiari II malformation, its symptoms, and her reaction to it</li>\n<li>Her brain and spine surgery, rehabilitation, and return to running</li>\n<li>How her science background has helped her</li>\n<li>Transitioning from triathlon to paratriathlon</li>\n<li>Her amputation and returning to racing</li>\n<li>Her World Championships and Paralympics experiences and their impact</li>\n<li>Allysa’s team</li>\n<li>Nutrition, sleep and recovery for her</li>\n<li>Allysa’s training schedule</li>\n<li>Her ESPN Body Issue experience</li>\n<li>How the Tokyo Games postponement has affected Allysa</li>\n<li>How she is feeling these days since her last hospital stay</li>\n</ul>\n<p>Quotes:</p>\n<ul>\n<li>“I really just fell in love with the challenge and the camaraderie and the exhilaration of the sport so I haven’t left yet.”</li>\n<li>“The bike has definitely been the lasting challenge for me…I have a love/hate relationship with it.”</li>\n<li>“The back part of my brain – the cerebellum – is not actually in my skull, it’s herniated into my spinal column.”</li>\n<li>“It’s not super common, so there’s many times I’m explaining it to medical professionals as well.”</li>\n<li>“I ran my first 5K as an amputee in December after losing my leg in August.”</li>\n<li>“Learning to walk and run was actually easier than when I had my foot.”</li>\n<li>“I do think very little was expected of me.”</li>\n<li>“People who believe in you, but yet love you whether you win or lose, right?”</li>\n<li>“My neurological disability is absolutely more challenging than the amputation.”</li>\n<li>“Because of the injury to my brain, my body is not able to digest food like most others do.”</li>\n<li>“For the first time in my life, we’ve been able to…fully support my training, build muscle mass, and not worry about my weight throughout the season as much.”</li>\n<li>“Nutrition is so important to achieving your best.”</li>\n<li>“Not a single person cared that I was unclothed.”</li>\n<li>“I’ve had a really rough year this year.”</li>\n<li>“All in all, I think it might have worked out okay for me. Hopefully, next year’s going to be way better.”</li>\n<li>“We can’t change the cards we’re dealt, and so we just have to make the best of what we have…those who are able to cope with the changes and stay on track and stay motivated are the ones that are going to find the most success next summer.”</li>\n<li>“Although these few months have been hard, I don’t think it counts me out. If anything, it lights more of a fire under me to prove that I can overcome this and everything else thrown my way to be the athlete and the competitor that I want to be.”</li>\n<li>“Impossible is a dare.”</li>\n</ul>\n<p>Links:\nThe Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a> \nMental Training:   <a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">https://www.laurawilkinson.com/learn </a>\nLaura’s Social Media:\nInstagram:   <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">https://www.instagram.com/lala_the_diver </a> \nFacebook:   <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">https://www.facebook.com/TheLauraWilkinson</a> \n \nConnect with Allysa:\nInstagram   <a href=\"https://www.instagram.com/triallysa/\" rel=\"nofollow\">https://www.instagram.com/triallysa/</a>\nFacebook   <a href=\"https://www.facebook.com/allysaseelytriathlete/\" rel=\"nofollow\">https://www.facebook.com/allysaseelytriathlete/</a></p>",
  "itunes:title": "Finding the Positive Side of Challenges with Paralympic Champion Allysa Seely",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 29
}