{
  "id": "yt:video:pzyIvNtP0i4",
  "yt:videoId": "pzyIvNtP0i4",
  "yt:channelId": "UCMTk_R_Y49jvq-HQXDmKI0Q",
  "title": "The Disappearance of Dr. Disrespect - Twitch's Greatest Mystery | TRO (ft. Poutine)",
  "link": "",
  "author": {
    "name": "The Right Opinion",
    "uri": "https://www.youtube.com/channel/UCMTk_R_Y49jvq-HQXDmKI0Q"
  },
  "published": "2022-11-05T20:00:02+00:00",
  "updated": "2022-11-05T21:41:02+00:00",
  "media:group": {
    "media:title": "The Disappearance of Dr. Disrespect - Twitch's Greatest Mystery | TRO (ft. Poutine)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Install Raid for Free ✅ Mobile and PC: https://clik.cc/T3wh3 and get a special starter pack. Available only for the next thirty days. Take part in Halloween event at https://trickortreat.plarium.com!\n\nThe Right Opinion: The Disappearance of Dr. Disrespect - Twitch's Biggest Mystery | TRO\n\n0:00:00 - Intro\n0:09:02 - Mixed Up (Epilepsy Warning)\n0:16:18 - Twitchy\n0:23:27 - The Return\n0:30:34 - The Lawsuit\n0:45:52 - The Outcome\n0:52:30 - Confusion\n0:58:58 - Why\n1:05:50 - Why More\n1:14:36 - How Come\n1:21:43 - The Unknown\n1:28:15 - Finale\n1:35:20 - Outro\n\n\nMany of you are likely well-acquainted with my established status as a gamer, in fact, probably one of the best gamers there is out there, truth is, I only don’t compete in tournaments because I’d really hate to put any of those competitive players out of a job, especially when I am so blessed to have alternative sources of entertainment. Yes, my field of interest isn’t merely restricted to one meadow, you see, like most people, I love a good mystery, and today, we have nothing less than one of the online’s world’s strangest happenings. One that has baffled observers, and even after its resolution, left far more questions than answers. Nonetheless, whereas most of our topics are embroilments on our resident platform, we have to turn our attention to one of YouTube’s contemporaries, and dare I say it, competitors for today’s situation: Twitch.\n\nTwitch, like YouTube, is a video-sharing platform, where one can tune in to their favourite creators and view various genres of content. However, unlike YouTube, Twitch’s format prioritises livestreams, which often provides more direct interaction between a creator, the content, and their audience. YouTube also offers this feature, and most people have taken advantage of it at some point, however, as YouTube isn’t thought to provide the same attention to it that Twitch does, most tend to opt for the latter when it comes to streaming. With that said, Twitch isn’t without its issues either, many of which have been on display in the last few years, particularly their policy which has often led to accusations of hypocrisy and double standards. \n\nNow, with these large platforms, some sort of double standard is inevitable, particularly given the special treatment that larger creators have been known to afford. With that said, Twitch’s attempts to find any “consistency”, have often led to criticisms of the opposite, and their nature to double down hasn’t helped that. I’m not going to detail each individual example because we’d be here all year, but their lack of transparency on the matter has left some streamers being indefinitely banned for the most milquetoast of faux pas, and in the livestreaming scene where there are no editing tools between the video and viewer, that can be risky business. On the other hand though, there are the platform darlings, who have been welcomed back despite multiple breaches of their supposed all-encompassing creator guidelines. For many, there’s unfairness, and then there’s Twitch. \n\nThere are a fair few theories about why Twitch is so wildly inconsistent, but I think the most deeply rooted one is that simply put, they’re a business, they need to hold on to the main sources of that business, especially when there are alternative platforms offering the same service. If they went and banned their biggest names, even if it was for good reason, those names may just migrate to a competitor who will tolerate their antics, taking all their audience, and income, with them. Even if it leads to greater moral inconsistency, their current practice keeps their platform afloat, which is probably their prime concern. However, at the core of this pretty logically sound explanation, there is one rather significant exception to that rule, so, I think it’s high time to introduce our title character…\n\nWatch more if you want!\n\nRaid Shadow Legends PRIZE PROMOTION TRICK OR TREAT. NO PURCHASE NECESSARY TO ENTER OR TO WIN A PRIZE. A PURCHASE DOES NOT IMPROVE YOUR CHANCES OF WINNING.\n\nEntry is Open to legal residents of THE 50 UNITED STATES AND THE DISTRICT OF COLUMBIA (EXCLUDING NEW YORK AND FLORIDA), who are 18 years or older. VOID WHERE PROHIBITED. Open only to RAID users with valid Raid Player ID. Promotion Period: 15.10 at Midnight UTC – 05.11 at 23:59 UTC. Sponsor: Plarium Global Ltd.  Administrator: JMG Brands & Talents GmbH. The Official Rules and Privacy Policy set forth here [https://trickortreat.plarium.com].",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}