{
  "title": "How Airbnb Achieved Metric Consistency at Scale",
  "link": "https://medium.com/airbnb-engineering/how-airbnb-achieved-metric-consistency-at-scale-f23cc53dea70?source=rss-c00b242128fe------2",
  "guid": "https://medium.com/p/f23cc53dea70",
  "category": [
    "data",
    "data-engineering",
    "data-science",
    "software-development"
  ],
  "dc:creator": "Robert Chang",
  "pubDate": "Fri, 30 Apr 2021 18:25:08 GMT",
  "atom:updated": "2021-08-05T05:37:22.385Z",
  "content:encoded": "<h4>Part-I: Introducing Minerva — Airbnb’s Metric Platform</h4><p><strong>By</strong>: <a href=\"https://www.linkedin.com/in/apahwa/\">Amit Pahwa</a>, <a href=\"https://www.linkedin.com/in/cristianrfr/\">Cristian Figueroa</a>, <a href=\"https://www.linkedin.com/in/donghan-zhang-670990135/\">Donghan Zhang</a>, <a href=\"https://www.linkedin.com/in/haimgrosman/\">Haim Grosman</a>, <a href=\"https://www.linkedin.com/in/john-bodley-a13327133/\">John Bodley</a>, <a href=\"https://www.linkedin.com/in/jonathan-parks-15617820/\">Jonathan Parks</a>, <a href=\"https://www.linkedin.com/in/shengnan-zhu-89403124/\">Maggie Zhu</a>, <a href=\"https://www.linkedin.com/in/philip-weiss-391021b1/\">Philip Weiss</a>, <a href=\"https://www.linkedin.com/in/robert-ih-chang/\">Robert Chang</a>, <a href=\"https://www.linkedin.com/in/shao-xie-0b84b64/\">Shao Xie</a>, <a href=\"https://www.linkedin.com/in/sylviatomiyama/\">Sylvia Tomiyama</a>, <a href=\"https://www.linkedin.com/in/xiaohui-sun-24bb3017/\">Xiaohui Sun</a></p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*rB53PQsJi73IeA-eIeucIg.png\" /><figcaption>Data is the voice of our users at scale. In the midst of the COVID-19 pandemic, we saw that travel with Airbnb has become hyper-local.</figcaption></figure><h3>Introduction</h3><p>At Airbnb, we lean on data to inform our critical decisions. We validate product ideas through randomized controlled experiments, and we track our business performance rigorously to ensure that we maximize values for our stakeholders. To achieve these goals, we needed to build a robust data platform that serves the internal users’ end-to-end needs.</p><p>While we have previously shared how we <a href=\"https://medium.com/airbnb-engineering/scaling-spark-streaming-for-logging-event-ingestion-4a03141d135d\">ingest data</a> into our data warehouse and how to enable users to conduct their own <a href=\"https://medium.com/airbnb-engineering/supercharging-apache-superset-b1a2393278bd\">analyses with contextual data</a>, we have not yet discussed the middle layer: how to properly model and transform data into accurate, analysis-ready datasets.</p><p>In this post, we will share our journey in building Minerva, Airbnb’s metric platform that is used across the company as the single source of truth for analytics, reporting, and experimentation. Specifically, we will set the context on why we built it, describe its core features and the ecosystem of tools it has enabled, and highlight the impact it has had on Airbnb. In upcoming posts, we will deep dive into the <a href=\"https://medium.com/airbnb-engineering/airbnb-metric-computation-with-minerva-part-2-9afe6695b486\">technology behind Minerva</a> and share the lessons we learned along the way. By publishing this series, we hope our readers will appreciate the power of a system like Minerva and be inspired to create something similar for their organizations!</p><h3>A Brief History of Analytics at Airbnb</h3><p>Like many data-driven companies, Airbnb had a humble start at the beginning of its data journey. Circa 2010, there was only one full-time analyst at the company working on data, and his laptop was effectively the company’s data warehouse. Queries were often run directly against the production databases, and expensive queries occasionally caused serious incidents and took down Airbnb.com. In spite of the pitfalls, this simple solution helped Airbnb identify many growth opportunities over the years.</p><p>As Airbnb’s footprint continued to grow in the early 2010s, more data scientists were <a href=\"https://medium.com/airbnb-engineering/at-airbnb-data-science-belongs-everywhere-917250c6beba\">brought on to the company</a> and data kept growing both in terms of size and of variety. It was around then that we went through the first phase of changes, <a href=\"https://medium.com/airbnb-engineering/data-infrastructure-at-airbnb-8adfb34f169c\">upgrading and stabilizing</a> our data infrastructure. We switched from Chronos to our home-grown, now open sourced, Apache <a href=\"https://medium.com/airbnb-engineering/airflow-a-workflow-management-platform-46318b977fd8\">Airflow</a> for workflow orchestration and invested in building a set of highly critical data tables called `core_data`.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*AqJoWcwj7duvOrtr\" /><figcaption>Airbnb and the data that fuels it has grown substantially over the years.</figcaption></figure><p>With `core data` serving as the foundation, analytics at Airbnb began to blossom. First, we brought the culture of A/B testing to Airbnb by <a href=\"https://medium.com/airbnb-engineering/experiment-reporting-framework-4e3fcd29e6c0\">building</a> and <a href=\"https://medium.com/airbnb-engineering/https-medium-com-jonathan-parks-scaling-erf-23fd17c91166\">scaling</a> Airbnb’s experimentation platform. We built an in-house data catalog, <a href=\"https://medium.com/airbnb-engineering/democratizing-data-at-airbnb-852d76c51770\">Dataportal</a>, to organize and document our data and created, now open sourced, Apache <a href=\"https://medium.com/airbnb-engineering/caravel-airbnb-s-data-exploration-platform-15a72aa610e5\">Superset</a> so more users could analyze data independently and interactively. Last but not least, we focused on data education by launching <a href=\"https://medium.com/airbnb-engineering/how-airbnb-democratizes-data-science-with-data-university-3eccc71e073a\">Data University</a>, a program to teach non-data scientists useful skills in an effort to democratize data analysis at Airbnb.</p><h3>Growing Pains</h3><p>While `core_data` brought several step-function changes to Airbnb’s data capabilities, our success did not come without some significant cost. In fact, the proliferation of data and use cases caused serious growing pains, both for data producers and for data consumers.</p><p>First, as `core_data` continued to rise in popularity, more data producers wanted to use it for analytics, forecasting, and experimentation. New tables were created manually on top of `core_data` tables every other day, but there was no way to tell if similar tables already existed. The complexity of our warehouse continued to grow, and data lineage became impossible to track. When a data issue upstream was discovered and fixed, there was no guarantee that the fix would propagate to all downstream jobs. As a result, data scientists and engineers spent countless hours debugging data discrepancies, fighting fires, and often feeling unproductive and defeated.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*DGqa6USgQiX21F62\" /><figcaption>Proliferation of derived tables built on top of `core_data` caused some serious growing pains.</figcaption></figure><p>For data consumption, we heard complaints from decision makers that different teams reported different numbers for very simple business questions, and there was no easy way to know which number was correct. Years ago, when Brian, our CEO, would ask simple questions like which city had the most bookings in the previous week, Data Science and Finance would sometimes provide diverging answers using slightly different tables, metric definitions, and business logic. Over time, even data scientists started to second guess their own data, confidence in data quality fell, and trust from decision makers degraded.</p><h3>Overcoming Our Growing Pains with Minerva</h3><p>As these pain points worsened, Airbnb embarked on a <a href=\"https://medium.com/airbnb-engineering/data-quality-at-airbnb-e582465f3ef7\">multi-year journey</a> to revamp its data warehouse with the goal of drastically improving data quality at the company. As a first step, our data engineering team rebuilt several key business data models from scratch, which resulted in a set of certified, lean, normalized tables that do not use unnecessary joins. These vetted tables now served as the new foundation for our analytics warehouse.</p><p>Our work hardly stopped there, however. In order to translate these tables into insights, we needed to be able to programmatically join them together to create analysis-friendly datasets. We needed to be able to backfill data whenever business logic changed. Finally, we needed data to be presented consistently and correctly in different consumption tools.</p><p>This is when Minerva — Airbnb’s metric platform — came onto the scene. Minerva takes fact and dimension tables as inputs, performs data denormalization, and serves the aggregated data to downstream applications. The Minerva API bridges the gap between upstream data and downstream consumption, enabling Data Engineering teams the flexibility to modify core tables while maintaining support for various downstream consumers. This API serves a vital role in Airbnb’s next-generation data warehouse architecture.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*SCOkdySJO68BS8OJ\" /><figcaption>Minerva, Airbnb’s metric platform, plays a central role in Airbnb’s new data warehouse architecture.</figcaption></figure><p>To date, we have more than 12,000 metrics and 4,000 dimensions in Minerva, with more than 200 data producers spanning across different functions (e.g., Data, Product Management, Finance, Engineering) and teams (e.g., Core Product, Trust, Payments). Most teams now regard Minerva as their preferred framework for analytics, reporting, and experimentation at Airbnb.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*3KyF0UdLxSok8FyF\" /><figcaption>Adoption of Minerva at Airbnb has grown tremendously in the past two years.</figcaption></figure><h3>Data Production in Minerva</h3><p>From an infrastructure perspective, Minerva is built on top of open-source projects. It uses Airflow for workflow orchestration, Apache Hive and Apache Spark as the compute engine, and Presto and Apache Druid for consumption. From metric creation through computation, serving, consumption, and eventually deprecation, Minerva covers the full life cycle of a metric.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*MStjNvO4kb-XNNur\" /><figcaption>Minerva manages the entire lifecycle of metrics at Airbnb.</figcaption></figure><ul><li><strong>Metrics Definition</strong>: Minerva defines key business metrics, dimensions, and other metadata in a centralized Github repository that can be viewed and updated by anyone at the company.</li><li><strong>Validated Workflow</strong>: The Minerva development flow enforces best data engineering practices such as code review, static validation, and test runs.</li><li><strong>DAG Orchestration: </strong>Minerva performs data denormalization efficiently by maximizing data reuse and intermediate joined results.</li><li><strong>Computation Runtime: </strong>Minerva has a sophisticated computation flow that can<strong> </strong>automatically self-heal after job failures and has built-in checks to ensure data quality.</li><li><strong>Metrics / Metadata Serving: </strong>Minerva provides a unified data API to serve both aggregated and raw metrics on demand.</li><li><strong>Flexible Backfills: </strong>Minerva<strong> </strong>version controls data definitions, so major changes to the datasets are automatically tracked and backfilled.</li><li><strong>Data Management</strong>: Minerva has built-in capabilities such as cost attribution, GDPR selective deletion, data access control, and an auto-deprecation policy.</li><li><strong>Data Retention:</strong> Minerva establishes usage-based retention and garbage collection, so expensive but infrequently utilized datasets are removed.</li></ul><p>The above mentioned features allow us to standardize metric creation, data computation, and data delivering. In the next post, we will deep dive into these features and explain them in more detail!</p><h3>Data Consumption in Minerva</h3><p>Minerva’s product vision is to allow users to “define metrics once, use them everywhere”. That is, a metric created in Minerva should be easily accessed in company dashboarding tools like <a href=\"https://medium.com/airbnb-engineering/supercharging-apache-superset-b1a2393278b\">Superset</a>, tracked in our A/B testing framework <a href=\"https://medium.com/airbnb-engineering/experiment-reporting-framework-4e3fcd29e6c0\">ERF</a>, or processed by our anomaly detection algorithms to spot business anomalies, just to name a few. Over the last few years, we have partnered closely with other teams to create an ecosystem of tools built on top of Minerva.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*3JIcR8l97r90lqf5\" /><figcaption>Minerva’s vision is “define once, use everywhere”.</figcaption></figure><h4>Data Catalog</h4><p>First, we partnered closely with the Analytics Product team to index all Minerva metrics and dimensions in the <a href=\"https://medium.com/airbnb-engineering/democratizing-data-at-airbnb-852d76c51770\">Dataportal</a>, Airbnb’s data catalog. When a user interfaces with the Dataportal and searches for a metric, it ranks Minerva metrics at the top of the search results. The Dataportal also surfaces contextual information, such as certification status, ownership, and popularity so that users can gauge the relative importance of metrics. For most non-technical users, the Dataportal is their first entry point to metrics in Minerva.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*o7XX523HFOUjyNrn\" /><figcaption>Minerva metrics are indexed and catalogued in the Dataportal UI.</figcaption></figure><h4>Data Exploration</h4><p>Upon selecting a metric, users are redirected to Metric Explorer, a component of the Dataportal that enables out-of-the-box data exploration. On a metric page, users can see trends of a metric with additional slicing and drill down options such as `Group By` and `Filter`. Those who wish to dig deeper can click into the Superset view to perform more advanced analytics. Throughout this experience, Metric Explorer surfaces metadata such as metric owners, historical landing time, and metric description to enrich the data context. This design balances the needs of both technical and non-technical users so they can <a href=\"https://medium.com/airbnb-engineering/supercharging-apache-superset-b1a2393278bd\">uncover data insights in-place seamlessly</a>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*rxkHxALysVnkzxxz\" /><figcaption>Users can investigate trends and anomalies in Metric Explorer and Superset seamlessly.</figcaption></figure><h4>A/B Testing</h4><p>Historically, Airbnb’s Experimentation Reporting Framework (ERF) had its own experiment metrics repository called “metrics repo”. Experimenters could add any business metric to an experiment and compare the results of the control and treatment group. Unfortunately, the metrics repo couldn’t be used for other use cases beyond experimentation, so we decided to integrate Minerva with ERF so all base events for A/B tests are defined and sourced from Minerva. Using the same source across experimentation and analytics means data scientists can be confident in their understanding of <a href=\"https://medium.com/airbnb-engineering/designing-experimentation-guardrails-ed6a976ec669\">how certain experiments could affect the top line business metrics</a>.</p><h4>Executive Reporting</h4><p>Long since Airbnb became a public company, we have adopted a practice of reviewing Airbnb’s business performance on weekly, monthly, and quarterly cadences. In these meetings, leaders across different functions meet and discuss the current state of the business. This type of meeting requires executive reports that are high-level and succinct. Data are often aggregated, trends are analyzed and plotted, and metrics movements are presented as running aggregations (e.g., year to date) and time ratio comparison (e.g., year over year).</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*RWmZcLerJV5JoRtP\" /><figcaption>Here is an example of the reporting configuration for COVID-19 dashboard, built on top of Minerva.</figcaption></figure><p>To enable this type of reporting, we built an eXecutive Reporting Framework (XRF). XRF takes a list of user-specified Minerva metrics and dimensions and turns them into aggregated metric time series that are report-friendly. This framework automates a lot of the manual work and allows us to standardize high-fidelity, business-critical reports by leveraging the same Minerva metrics and dimensions used for analysis and experimentation.</p><h4>Data Analysis</h4><p>Last but not least, Minerva data is exposed to Airbnb’s custom R and Python clients through Minerva’s API. This allows data scientists to query Minerva data in a notebook environment with ease. Importantly, the data that’s being surfaced in the notebook environment is computed and surfaced exactly the same way as they were in the aforementioned tools, such as Superset and Metric Explorer. This saves enormous amounts of time for data scientists as they can pick and choose the right tool for the job depending on the complexity of the analysis. Notably, this data API encourages lightweight prototyping of internal tooling, which can later be productionalized and shared across the company. For example, data scientists have built a time series analysis tool and an email reporting framework using this API over the last two years.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/972/0*AvWgz6qImCriZUBn\" /><figcaption>A data scientist can use our Python client to retrieve aggregated data in Minerva and conduct analyses.</figcaption></figure><h3>How We Responded To the COVID-19 Crisis with Minerva Data</h3><p>As Minerva became a centerpiece of analytics at Airbnb, we saw again and again the power and productivity gain it has brought to the data community at Airbnb. In this last section, we want to give a concrete example of how Minerva aided the business during the COVID-19 crisis.</p><p>In March 2020, global travel came to a halt due to COVID-19. Almost overnight, Airbnb bookings plummeted and cancellations skyrocketed. This was a scary moment for us, and it raised many important business questions: How was the coronavirus affecting our nights backlog? How was it affecting our occupancy rate? What was the financial impact of rising cancellations? How had the coronavirus altered travel demand in terms of travel distance? We needed to answer all these questions quickly and correctly.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*M0Dzpgwz7633v1SB\" /><figcaption>We were able to dramatically shorten the time from data curation to insight discovery and assess the impact of COVID-19 on Airbnb’s business because of Minerva!</figcaption></figure><p>In response to this influx of inquiries, our data science team gathered the questions and started to brainstorm how we could leverage data to answer them. Crucially, since many important business metrics and dimensions for supply, demand, finance, and customer support were already defined in Minerva, our Central Analytics team was able to wireframe an executive dashboard and roll out the initial version in just under a few days. The COVID-19 dashboard quickly became the single authoritative source of truth and was reviewed closely by our executive team in the midst of the crisis. Since then, it has amassed more than 11,000 views and 1,500 distinct viewers. Not surprisingly, the COVID-19 dashboard was the most viewed Superset dashboard at Airbnb in 2020.</p><p>Insights generated from Minerva metrics also allowed the company to confidently pinpoint the rapidly changing landscape. For example, we uncovered market opportunities such as demand shift to local travel and longer-term stays. These findings led us to redesign several important touch points of our product pages to meet the shift in user preference. In moments of crisis, the ability to answer questions and uncover insights is more important than ever. We are able to do this efficiently and effectively, thanks to the single source of truth data in Minerva!</p><h3>Closing</h3><p>In this post, we briefly summarized the history of Airbnb’s analytics journey, the growing pains we faced in the last few years, and why we built Minerva, Airbnb’s metric infrastructure. In particular, we covered how data is produced and consumed via Minerva. Toward the end of the post, we also highlighted a recent example of how Minerva helped Airbnb to react to the COVID-19 crisis.</p><p>In the <a href=\"https://medium.com/airbnb-engineering/airbnb-metric-computation-with-minerva-part-2-9afe6695b486\">next post</a>, we will deep dive into Minerva’s technical architecture, including the design principles, the user development flow, as well as the data computation graph. In the last post of the series, we will introduce Minerva API, which is our single layer of data abstraction that made all the integrations outlined above possible. We will close the series by sharing the lessons that we’ve learned from building Minerva in the hope that these lessons will be helpful for others building similar systems.</p><p>Until then, stay tuned for our next post!</p><h3>Acknowledgments</h3><p>Minerva is made possible only because of the care and dedication from those who worked on it. We would also like to thank <a href=\"https://www.linkedin.com/in/lchircus/\">Lauren Chircus</a>, <a href=\"https://www.linkedin.com/in/aaronkeys/\">Aaron Keys</a>, <a href=\"https://www.linkedin.com/in/michaelcl/\">Mike Lin</a>, <a href=\"https://www.linkedin.com/in/adriankuhn/\">Adrian Kuhn</a>, <a href=\"https://www.linkedin.com/in/krishna-bhupatiraju-1ba1a524/\">Krishna Bhupatiraju</a>, <a href=\"https://www.linkedin.com/in/michelleethomas/\">Michelle Thomas</a>, <a href=\"https://www.linkedin.com/in/erikrit/\">Erik Ritter</a>, <a href=\"https://www.linkedin.com/in/serena-jiang/\">Serena Jiang</a>, <a href=\"https://www.linkedin.com/in/krist-wongsuphasawat-279b1617/\">Krist Wongsuphasawat</a>, <a href=\"https://www.linkedin.com/in/chris-williams-1bb8b936/\">Chris Williams</a>, <a href=\"https://www.linkedin.com/in/kenchendesign/\">Ken Chen</a>, <a href=\"https://www.linkedin.com/in/yguang11/\">Guang Yang</a>, <a href=\"https://www.linkedin.com/in/jinyang-li-607690143/\">Jinyang Li</a>, <a href=\"https://www.linkedin.com/in/clark-wright-67955537/\">Clark Wright</a>, <a href=\"https://www.linkedin.com/in/vquoss/\">Vaughn Quoss</a>, <a href=\"https://www.linkedin.com/in/zi-jerry-chu/\">Jerry Chu</a>, <a href=\"https://www.linkedin.com/in/palanieppan-muthiah-b7088924/\">Pala Muthiah</a>, <a href=\"https://www.linkedin.com/in/ruiqinyang/\">Kevin Yang</a>, <a href=\"https://www.linkedin.com/in/ellen-huynh/\">Ellen Huynh</a>, and many more who partnered with us to make Minerva more accessible across the company. Finally, thank you <a href=\"https://www.linkedin.com/in/bulam/\">Bill Ulammandakh</a> for creating the beautiful visualization so we can use it as our header image!</p><p><em>Apache®, Apache Airflow, Apache Superset, Apache Hive, Apache Spark and Apache druid are either registered trademarks or trademarks of the Apache Software Foundation in the United States and/or other countries.</em></p><p><em>Presto is the registered trademark of LF Projects, LLC.</em></p><p><em>GITHUB® is the exclusive trademark registered in the United States by GitHub, Inc.</em></p><p><em>All trademarks are the properties of their respective owners. Any use of these are for identification purposes only and do not imply sponsorship or endorsement.</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=f23cc53dea70\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/airbnb-engineering/how-airbnb-achieved-metric-consistency-at-scale-f23cc53dea70\">How Airbnb Achieved Metric Consistency at Scale</a> was originally published in <a href=\"https://medium.com/airbnb-engineering\">The Airbnb Tech Blog</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
}