{
  "id": "yt:video:60z_hpEAtD8",
  "yt:videoId": "60z_hpEAtD8",
  "yt:channelId": "UCEo_JfTH_9FK-7k9-mAWJkQ",
  "title": "A Swift Introduction to Geometric Algebra",
  "link": "",
  "author": {
    "name": "sudgylacmoe",
    "uri": "https://www.youtube.com/channel/UCEo_JfTH_9FK-7k9-mAWJkQ"
  },
  "published": "2020-08-18T00:56:42+00:00",
  "updated": "2022-06-24T19:21:23+00:00",
  "media:group": {
    "media:title": "A Swift Introduction to Geometric Algebra",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "This video is an introduction to geometric algebra, a severely underrated mathematical language that can be used to describe almost all of physics.  This video was made as a presentation for my lab that I work in.  While I had the people there foremost in my mind when making this, I realized that this might be useful to the general public, so I also tried to make this useful to others as well.\n\nThis video was made using manim (https://github.com/ManimCommunity/manim), a math animation library.\n\nSeveral things in this video were incorrectly simplified.  Please watch the video before reading the rest of the description.\n\nBefore I get into the things that were incorrectly simplified, I need to state a few definitions.  The grade of a k-vector is defined to be k.  A blade is defined to be the outer product of vectors.  A k-blade is a blade of grade k.  Some of the terminology between linear algebra and geometric algebra can be confusing, such as the use of the terms vector space and dimension.  Because multivectors form their own vector space, but we don't consider all of them to be vectors, some people use the term linear space instead of vector space.  While we think of dimension in terms of spatial degrees of freedom, the mathematical definition means that the 3D geometric algebra shown here is actually eight-dimensional.  This is part of the reason for the distinction between the terms grade and dimension.\n\nThe following are the things that I purposefully got wrong to make things simpler:\n\nThe biggest thing I glossed over is the distinction between blades and vectors.  A lot of the ways that I described k-vectors intuitively actually only applied to k-blades, not k-vectors.  For example, in four or more dimensions, all 2-blades can be represented as an oriented area, but not all 2-vectors can.  I didn't mention this fact for two reasons: first, for a first look, the distinction is not that important.  Second, the distinction doesn't even matter until you reach four or more dimensions.  In three dimensions, all k-vectors are k-blades.\n\nMy use of the term basis was not quite right, and I should have used the term \"orthonormal basis\".  I wanted this video to be understood by people who had learned about vectors in a physics class where they don't go into too much detail about the exact definitions a linear algebra class would give you, so I didn't want to use the term orthonormal.  I tried to mitigate this somewhat by always using terms like \"the basis\" and assuming that it was known that I meant the standard orthonormal basis.  Hopefully this doesn't cause any confusion.\n\nI mentioned that the inner product can get complicated when generalized to generic blades.  What I didn't mention is that there is a large amount of disagreement on what this generalization is.  I've seen at least five different extensions of the inner product to higher-grade blades.  I didn't mention this because it was not pertinent to the discussion.  However, even though I didn't talk much about the inner and outer products in this video, they are essential to the usage of geometric algebra in many applications.\n\nThis wasn't necessarily wrong, but I assumed that space is Euclidean throughout the video.  In some applications, especially in relativity, space is not Euclidean, and a few things aren't the same.\n\nIn general, the pseudoscalar for a geometric algebra is the highest-grade element, but this does not always square to -1.  In the three main applications of geometric algebra (2D Euclidean space, 3D Euclidean space, and 4D Minkowski space), this does happen to be the case, but in general it is not true.\n\nWhen I mentioned dividing vectors, I didn't mention the fact that when dividing, you have to \"divide on the left\" or \"divide on the right\" because multiplication is not commutative.  I actually prefer just to divide by multiplying by the inverse, because then you don't have to worry about how you're dividing.  I didn't mention this because I never mentioned inverses again after I introduced them.\n\nAnother issue with inverses is that while vectors have inverses, not all multivectors have inverses.  Also, in other spaces, such as the Minkowski space used in relativity, even some vectors don't have inverses.  Again, this was because I didn't really use inverses much after this.\n\nThis one is small, but we assumed several properties of the geometric product that we didn't prove or state, such as distributivity and associativity.  To be precise, the set of multivectors along with addition and the geometric product forms an associative algebra.  I defined the geometric product in a bit of a roundabout way and I couldn't find a good place to insert these facts.  The kind of people this video is aiming at are those who don't know a lot of abstract algebra and so I assumed that they would assume associativity and distributivity.\n\nRotors actually have many different definitions, so don't always think of them as a complex exponential.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}