{
  "id": "yt:video:NGHrRq3fQuE",
  "yt:videoId": "NGHrRq3fQuE",
  "yt:channelId": "UCs8o1mdWAfefJkdBg632_tg",
  "title": "Why Outsider Stories Make Great Movies - Tony DuShane",
  "link": "",
  "author": {
    "name": "Film Courage",
    "uri": "https://www.youtube.com/channel/UCs8o1mdWAfefJkdBg632_tg"
  },
  "published": "2022-11-01T00:00:07+00:00",
  "updated": "2022-11-01T00:00:09+00:00",
  "media:group": {
    "media:title": "Why Outsider Stories Make Great Movies - Tony DuShane",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Tony DuShane is the author and award-winning screenwriter of Confessions of a Teenage Jesus Jerk. The book was published by Soft Skull Press and the feature film, directed by Eric Stoltz, was released in 2018 and is currently streaming on Amazon Prime. His journalism and essays has appeared in The Los Angeles Times, Mother Jones, Penthouse, The Rumpus, The Believer, and other media outlets. He teaches writing at UCLA Extension and his journalism has appeared in Mother Jones, The Los Angeles Times, and San Francisco Chronicle. He hosts the literary podcast Drinks with Tony every Wednesday.\n\nMORE VIDEOS WITH TONY DUSHANE\nhttps://bit.ly/3mFoq28\n\nCONNECT WITH TONY DUSHANE\nhttp://www.tonydushane.com\nhttps://drinkswithtony.podbean.com\nhttps://twitter.com/tonydushane\n\nRELATED VIDEOS\nNo One Cares About The Movies You Like - https://youtu.be/LBlJiK3h2hc\nBeginner's Guide To Writing A Story - https://youtu.be/8FxdZ1wdltw\n9 Stories To Inspire Your Soul - https://youtu.be/SXaLoySpxUo\nPrimary Reasons To Tell Stories - https://youtu.be/rEN2g3_qgCo\nI Only Write Stories That Pass This Test - https://youtu.be/vIZwq0rWh78\n\n(Affiliates)\n►WE USE THIS CAMERA (B&H) – https://buff.ly/3rWqrra\n►WE USE THIS EDITING PROGRAM (ADOBE) – https://goo.gl/56LnpM\n►WE USE THIS SOUND RECORDER (AMAZON) – http://amzn.to/2tbFlM9\n►WRITERS, TRY FINAL DRAFT FREE FOR 30-DAYS! (FINAL DRAFT) - http://ow.ly/Gz4w30rDSKt\n\nSUPPORT FILM COURAGE BY BECOMING A MEMBER\nhttps://www.youtube.com/channel/UCs8o1mdWAfefJkdBg632_tg/join\n\nCONNECT WITH FILM COURAGE\nhttp://www.FilmCourage.com\nhttp://twitter.com/#!/FilmCourage\nhttps://www.facebook.com/filmcourage\nhttps://www.instagram.com/filmcourage\nhttp://filmcourage.tumblr.com\nhttp://pinterest.com/filmcourage\n\nSUBSCRIBE TO THE FILM COURAGE YOUTUBE CHANNEL\nhttp://bit.ly/18DPN37\n\nLISTEN TO THE FILM COURAGE PODCAST\nhttps://soundcloud.com/filmcourage-com\n\nStuff we use:\n\nLENS - Most people ask us what camera we use, no one ever asks about the lens which filmmakers always tell us is more important.  This lens was a big investment for us and one we wish we could have made sooner.  Started using this lens at the end of 2013 - http://amzn.to/2tbtmOq\n\nAUDIO \n\nRode VideoMic Pro  - The Rode mic helps us capture our backup audio.  It also helps us sync up our audio in post http://amzn.to/2t1n2hx\n\nAudio Recorder - If we had to do it all over again, this is probably the first item we would have bought - http://amzn.to/2tbFlM9\n\nLIGHTS - Although we like to use as much natural light as we can, we often enhance the lighting with this small portable light.  We have two of them and they have saved us a number of times - http://amzn.to/2u5UnHv\n\nCOMPUTER - Our favorite computer, we each have one and have used various models since 2010 - http://amzn.to/2t1M67Z\n\nEDITING - We upgraded our editing suite this year and we’re glad we did!  This has improved our workflow and the quality of our work.  Having new software also helps when we have a problem, it’s easy to search and find a solution - https://goo.gl/56LnpM\n\n*These are affiliate links, by using them you can help support this channel.\n\n#writing #screenwriting #writers",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}