{
  "title": "205: Dateline: \"Mommy Doomsday\"",
  "link": "https://audioboom.com/posts/7969003",
  "itunes:episode": 205,
  "itunes:title": "Dateline: \"Mommy Doomsday\"",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3174,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Lori Vallow was devoted wife and mother, but then people around her started dying. And THEN her children vanished. Lori insisted to the police that the children were fine and being cared for by friends in other states, but that story quickly fell apart. And THEEEEENNNN Lori and her new husband, Chad Daybell (whose first wife ALSO died under mysterious circumstances) fled to Hawaii. And if you don't know the insane thing that happened next, \"Well, you're gonna want to give this episode a listen\" [said in Gillian's best Keith Morrison voice]<br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 200 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"John Wayne Gacy: Devil in Disguise\" </strong>\"<strong>Night Stalker</strong>\" <strong>\"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n<br>\nFAM! IF YOU'RE COMING TO SEE US ON BROADWAY ON APRIL 11, 2020 YOU MUST CONFIRM YOUR TICKETS BY OCTOBER 31  <a href=\"https://2st.formstack.com/forms/tcoexchange?promo&fbclid=IwAR2eunIi0uQwxh6-ecXOflE11pmu9fwRkqdYm5WZcwxeHk7AI-8pOowdmlc\">BY USING THIS LINK</a> (you can also use this link to cancel and get a refund). <strong>If you do not confirm your tickets by 10/31 you will be automatically refunded and your tickets will be resold!</strong> WE LOVE YOU AND WE CAN'T WAIT TO SEE YOU ON BROADWAY!</div>\n<div><a href=\"https://audioboom.com/posts/7964768-dateline-lori-vallow-what-happened-to-the-children/edit\">Update Description</a></div>\n",
  "pubDate": "Thu, 28 Oct 2021 10:54:56 +0000",
  "guid": "tag:audioboom.com,2021-10-28:/posts/7969003",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}