{
  "title": "Joining Forces for an Arrow-Native Future",
  "link": "",
  "published": "2021-08-05T00:00:00-07:00",
  "updated": "2021-08-05T00:00:00-07:00",
  "author": {
    "name": "Wes McKinney"
  },
  "id": "tag:wesmckinney.com,2021-08-05:/blog/from-ursa-to-voltrondata/",
  "summary": "<h4>Joint Post from Wes McKinney and Josh Patterson</h4>\n<h4><em>Allow us to reintroduce ourselves</em></h4>\n<p>Too often people say \"let’s do something together\" in passing, and\ndon’t. There's the occasional inter-project collaboration, but rarely will\npeople take that next step. There are countless reasons why this happens, and\naligning goals …</p>",
  "content": "<h4>Joint Post from Wes McKinney and Josh Patterson</h4>\n<h4><em>Allow us to reintroduce ourselves</em></h4>\n<p>Too often people say \"let’s do something together\" in passing, and\ndon’t. There's the occasional inter-project collaboration, but rarely will\npeople take that next step. There are countless reasons why this happens, and\naligning goals is challenging to say the least. But after spending the last\nseveral years working separately on related problems in the data ecosystem, we\nrealized our best hope to make lasting progress was to build a stronger,\nunified foundation. We needed to do something radically different.</p>\n<h2>A Brief History</h2>\n<p><a href=\"https://twitter.com/wesmckinn\">Wes</a> helped start the Apache Arrow project in\n2015, and since then has continued to build a developer community to achieve\nArrow’s dual goals. The first goal is to be an efficient, language-independent\nopen standard for columnar data interchange. The second goal is to be a\nportable, high-performance computing foundation for doing analytics on that\ncolumnar data. To pursue these goals, Wes formed <a href=\"https://ursalabs.org/\">Ursa\nLabs</a> in 2018 and <a href=\"https://ursalabs.org/blog/ursa-computing/\">Ursa\nComputing</a> in 2020.</p>\n<p>In parallel, <a href=\"https://twitter.com/datametrician\">Josh</a> and colleagues at NVIDIA\nforesaw the potential of GPUs to accelerate analytics workloads. In 2017, they\ncreated the <a href=\"https://developer.nvidia.com/blog/goai-open-gpu-accelerated-data-analytics/\">GPU Open Analytics\nInitiative</a>\nand later RAPIDS, which has demonstrated the potential of accelerated\nhigh-performance columnar analytics. Josh and the cuDF developers collaborated\nextensively with <a href=\"https://www.blazingsql.com/\">BlazingSQL</a> to bring\nGPU-accelerated Arrow analytics not only to the Python community, but to modern\nSQL workloads as well.</p>\n<p>Over the last 5 years, Arrow has been rapidly adopted as the gold standard for\ntabular data interchange across the data warehousing and data science\necosystems, bringing massive performance and efficiency improvements to many\nuse cases. Arrow is also taking Flight (<a href=\"https://arrow.apache.org/blog/2019/10/13/introducing-arrow-flight/\">pun\nintended</a>)\nas a replacement for slow database access protocols like ODBC and JDBC. These\norganizations worked across numerous projects, but individually, each only\naddressed some of the community's needs.</p>\n<h2>United Foundation</h2>\n<p>The next stage of growth is to see Arrow adopted not only as the standard for\nfast data movement but also as the native format for cost-effective analytical\ncomputing. We envision a ubiquitous, hardware-optimized foundation that\nsimplifies and accelerates data analytics workloads across programming\nlanguages.</p>\n<p>Today, we are launching a new company, <a href=\"https://voltrondata.com\">Voltron Data</a>,\nthat reflects this unified vision. The Ursa Computing and BlazingSQL teams\ntogether with pioneers of RAPIDS and other open-source projects have joined\nforces to form Voltron Data. Additionally, Ursa Labs is now <a href=\"https://voltrondata.com/labs\">Voltron\nLabs</a>, and it will continue to work for the\nbenefit of the open-source ecosystem around Apache Arrow. Josh and Wes are now\nVoltron Data’s CEO and CTO, respectively. You’ll see us doing even more work in\nthe Arrow community than we have in the past, and we look forward to increasing\nArrow’s footprint in the world. Together we are unifying our collective\nexpertise in performance, portability, and programmability to build more\nbridges across the data ecosystem to improve the tools you know and love.</p>\n<p>We look forward to sharing more about Voltron Data in the coming months. In the\nmeantime, we have <a href=\"https://voltrondata.com/careers\">many open roles</a> and are\nlooking for talented software engineers around the globe to further our\nmission. <a href=\"https://voltrondata.com/careers\">Join us!</a></p>"
}