{
  "id": "yt:video:wdgULBpRoXk",
  "yt:videoId": "wdgULBpRoXk",
  "yt:channelId": "UCS0N5baNlQWJCUrhCEo8WlA",
  "title": "How does a USB keyboard work?",
  "link": "",
  "author": {
    "name": "Ben Eater",
    "uri": "https://www.youtube.com/channel/UCS0N5baNlQWJCUrhCEo8WlA"
  },
  "published": "2021-06-05T14:39:16+00:00",
  "updated": "2022-01-01T14:25:46+00:00",
  "media:group": {
    "media:title": "How does a USB keyboard work?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The USB 2.0 spec: https://eater.net/downloads/usb_20.pdf\n\nSupport these videos on Patreon: https://www.patreon.com/beneater or https://eater.net/support for other ways to support.\n\n0:00 Intro\n0:50 USB electrical interface\n4:43 How USB encodes bits and packets\n23:41 USB packet contents\n29:26 USB vs. PS/2\n\n------------------&#13;\n&#13;\nSocial media:&#13;\nWebsite: https://www.eater.net&#13;\nTwitter: https://twitter.com/ben_eater&#13;\nPatreon: https://patreon.com/beneater&#13;\nReddit: https://www.reddit.com/r/beneater&#13;\n&#13;\nSpecial thanks to these supporters for making this video possible:\nAaron Todd, Aleksey Smolenchuk, Alexander Wendland, Andrew C. Young, Anson VanDoren, Anthanasius, anula, Armin Brauns, Ben Cochran, Ben Kamens, Ben Williams, Benny Olsson, Bill Cooksey, Binh Tran, Bouke Groenescheij, Bradley Pirtle, Bradley Stach, Brent Reusing, Bryan Brickman, Carlos Ambrozak, Christian Carter, Christopher Blackmon, Dale Andrew Darling, Daniel Jeppsson, Daniel Tang, dans, Dave Burley, Dave Walter, David Brown, David Clark, David Cox, David House, David Sastre Medina, David Turner, David Worsham, Dean Bevan, Dean Winger, Dissy, dko, Dmitry Guyvoronsky, Dušan Dželebdžić, Dustin Yelland, Dzevad Trumic, Eric Dynowski, Erik Broeders, Eugene Bulkin, George Miroshnykov, Harry McDow, hotwire33, Ian Tait, Ingo Eble, Ivan Sorokin, James Capuder, james schaefer, Jared Dziedzic, Jason DeStefano, Jason Specland, JavaXP, Jaxon Ketterman, Jay Binks, Jayne Gabriele, Jesse Miller, Jim Kelly, Jim Knowler, Jim Van Meggelen, Joe Beda, Joe OConnor, Joe Pregracke, Joel Miller, John Fenwick, John Meade, Jon Dugan, Joseph Portaro, Joshua King, Jurģis Brigmanis, Kai Wells, Kefen, Kenneth Christensen, Kent Collins, Kitick, Koreo, Lambda GPU Workstations, Larry, László Bácsi, Lucky Resistor, Lukasz Pacholik, Marcos Fujisawa, Marcus Classon, Mark Day, Martin Roth, Mats Fredriksson, Matt Krueger, Matthäus Pawelczyk, Matthew Duphily, melvin2001, Michael Tedder, Michael Timbrook, Michael Weitman, Miguel Ríos, mikebad, Mikel Lindsaar, Miles Macchiaroli, Muqeet Mujahid, My Yiddishe Mama, Nicholas Counts, Nicholas Moresco, Nick, Not Yet Wise, Paul Pluzhnikov, Paul Randal, Pete Dietl, Phil Dennis, Philip Hofstetter, Phillip Glau, PixelSergey, ProgrammerDor, Randal Masutani, Randy True, raoulvp, Renaldas Zioma, Ric King, Rick Hennigan, Rob Bruno, Robert Comyn, Robert Diaz, Roland Bobek, sam raza, Scott Holmes, Sergey Kruk, Shelton, SonOfSofaman, Stefan Nesinger, Stefanus Du Toit, Stephen, Stephen Riley, Stephen Smithstone, Steve  Jones, Steven Zilberberg, Tayler Porter, TheWebMachine, Thomas Bruggink, Thomas Eriksen, Tii, Tom, Tom Yedwab, Tommaso Palmieri, Tyler Latham, Vincent Bernat, Vladimir Solomatin, Walter Montalvo, Warren Miller, Wim Coekaerts, Wraithan McCarroll, xisente, Yee Lam Wan",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}