{
  "title": "240: How to Recover for Better Performance with Miesha Tate",
  "pubDate": "Mon, 19 Jul 2021 13:03:17 +0000",
  "guid": "5c3004cf-c21b-43a3-bd5f-1c19dc50395d",
  "link": "https://sites.libsyn.com/94610/240-how-to-recover-for-better-performance-with-miesha-tate",
  "itunes:image": "",
  "description": "<p>How can you use recovery not only to bounce back but bounce forward?<br /> <br /> There’s a formula to success: Reaching, recovering, and repeating. A lot of times, the focus is on the first and third steps. But recovery is a vital piece when it comes to achieving your goals.</p> <p>Today, we’re back with UFC Champion Miesha Tate to talk about the importance of how to use recovery to prepare for your next steps!</p> <p>Last week, we focused on how to reach your goals by building the mindset for resilience and mental toughness. If you missed that episode, you can listen to the last episode.</p> <p>No matter what your goal, you need to make time to recover. Listen in, as we talk about what questions you should ask yourself to help choose the best path of recovery.</p> <p class=\"p1\">*** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. ***</p>",
  "content:encoded": "<p>How can you use recovery not only to bounce back but bounce forward?  There’s a formula to success: Reaching, recovering, and repeating. A lot of times, the focus is on the first and third steps. But recovery is a vital piece when it comes to achieving your goals.</p> <p>Today, we’re back with UFC Champion Miesha Tate to talk about the importance of how to use recovery to prepare for your next steps!</p> <p>Last week, we focused on how to reach your goals by building the mindset for resilience and mental toughness. If you missed that episode, you can listen to the last episode.</p> <p>No matter what your goal, you need to make time to recover. Listen in, as we talk about what questions you should ask yourself to help choose the best path of recovery.</p> <p class=\"p1\">*** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. ***</p>",
  "enclosure": "",
  "itunes:duration": "18:22",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "How can you use recovery not only to bounce back but bounce forward?  There’s a formula to success: Reaching, recovering, and repeating. A lot of times, the focus is on the first and third steps. But recovery is a vital piece when it comes to...",
  "itunes:episodeType": "full"
}