{
  "id": "https://bibleinoneyear.org/en/youth/25",
  "title": "Day 25: &#039;God Intended It for Good&#039;",
  "description": "Psalm 15:1–5, Genesis 50:18–21, Matthew 17:14-23, 18:1-4.  He suffers alongside you  Yet he does not always simply remove suffering from your life; he sometimes uses the bad things that happen to bring about his good purposes",
  "pubDate": "Tue, 25 Jan 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/25/",
  "itunes:duration": "13:08",
  "guid": "enyouth25012022-25",
  "length": 788.32,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 25: &#039;God Intended It for Good&#039;",
  "itunes:subtitle": "Psalm 15:1–5, Genesis 50:18–21, Matthew 17:14-23, 18:1-4.  He suffers alongside you  Yet he does not always simply remove suffering from your life; he sometimes uses the bad things that happen to bring about his good purposes",
  "itunes:summary": "In 1947, a young New Yorker named Glenn Chambers had a lifelong dream to work for God in Ecuador. At the airport on the day of departure, he wanted to send a note to his mother but he didn’t have time to buy a card. He noticed a piece of paper on the terminal floor and picked it up. It turned out to be an advertisement with ‘Why?’ spread across it. He scribbled his note around the word ‘Why?’ and put it in the post box. That night his aeroplane exploded as it hit the 14,000-foot Colombian peak El Tablazo. When his mother received the note after the news of his death the question burned up at her from the page… ‘Why?’\nWhy does God not stop a global pandemic? Why does God allow such suffering?¹ This question is the single greatest challenge to the Christian faith. The amount of suffering and its distribution seem to be random and unfair. It outrages and bewilders us.\nTheologians and philosophers have wrestled for centuries with the mystery of undeserved suffering, and no one has ever come up with a simple and complete solution. Today and tomorrow’s passages are only part of the answer, but each of them gives us some insight.\nWe see that although suffering is never good in itself, God is able to use it for good in a number of ways. God loves you. Your suffering is also God’s suffering. He suffers alongside you. Yet he does not always simply remove suffering from your life; he sometimes uses the bad things that happen to bring about his good purposes.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 390
}