{
  "title": "ImageCAS: A Large-Scale Dataset and Benchmark for Coronary Artery Segmentation based on Computed Tomography Angiography Images. (arXiv:2211.01607v1 [eess.IV])",
  "link": "http://arxiv.org/abs/2211.01607",
  "description": "<p>Cardiovascular disease (CVD) accounts for about half of non-communicable\ndiseases. Vessel stenosis in the coronary artery is considered to be the major\nrisk of CVD. Computed tomography angiography (CTA) is one of the widely used\nnoninvasive imaging modalities in coronary artery diagnosis due to its superior\nimage resolution. Clinically, segmentation of coronary arteries is essential\nfor the diagnosis and quantification of coronary artery disease. Recently, a\nvariety of works have been proposed to address this problem. However, on one\nhand, most works rely on in-house datasets, and only a few works published\ntheir datasets to the public which only contain tens of images. On the other\nhand, their source code have not been published, and most follow-up works have\nnot made comparison with existing works, which makes it difficult to judge the\neffectiveness of the methods and hinders the further exploration of this\nchallenging yet critical problem in the community. In this paper, we propose a\nlarge-scale dataset for coronary artery segmentation on CTA images. In\naddition, we have implemented a benchmark in which we have tried our best to\nimplement several typical existing methods. Furthermore, we propose a strong\nbaseline method which combines multi-scale patch fusion and two-stage\nprocessing to extract the details of vessels. Comprehensive experiments show\nthat the proposed method achieves better performance than existing works on the\nproposed large-scale dataset. The benchmark and the dataset are published at\nhttps://github.com/XiaoweiXu/ImageCAS-A-Large-Scale-Dataset-and-Benchmark-for-Coronary-Artery-Segmentation-based-on-CT.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/eess/1/au:+Zeng_A/0/1/0/all/0/1\">An Zeng</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Wu_C/0/1/0/all/0/1\">Chunbiao Wu</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Huang_M/0/1/0/all/0/1\">Meiping Huang</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Zhuang_J/0/1/0/all/0/1\">Jian Zhuang</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Bi_S/0/1/0/all/0/1\">Shanshan Bi</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Pan_D/0/1/0/all/0/1\">Dan Pan</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Ullah_N/0/1/0/all/0/1\">Najeeb Ullah</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Khan_K/0/1/0/all/0/1\">Kaleem Nawaz Khan</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Wang_T/0/1/0/all/0/1\">Tianchen Wang</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Shi_Y/0/1/0/all/0/1\">Yiyu Shi</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Li_X/0/1/0/all/0/1\">Xiaomeng Li</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Lin_G/0/1/0/all/0/1\">Guisen Lin</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Xu_X/0/1/0/all/0/1\">Xiaowei Xu</a>"
}