{
  "title": "S14 Ep70: The Next Generation of Ghost Hunters",
  "link": "https://audioboom.com/posts/8098560",
  "itunes:episode": 70,
  "itunes:title": "The Next Generation of Ghost Hunters",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5830,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Fifteen years after introducing the world to the field of authentic paranormal investigation, Ghost hunters returned to TV on A&E this past week.  The team is now led by Grant Wilson and features a brand new cast of paranormal investigators!  BEYOND The DARKNESS got the privilege to sit down and talk to Brandon Alvis and Mustafa Gatollari about their paranormal histories, investigation techniques, and what it is like to work on this historic series!  <br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.<br>\n<br>\nSend your kids back to school with the socks that keep them comfy, colorful, and ready to take on the school year. Visit <a href=\"http://Bombas.com/Darkness\">Bombas.com/Darkness</a> to receive 20 percent off of your first order! <br>\n<br>\nCarnival Row is a one-hour fantasy drama series starring Orlando Bloom and Cara Delevingne . The series is set in a Victorian fantasy world filled with mythological immigrant creatures whose exotic homelands were invaded by the empires of man. Come together on August 30th to watch Carnival Row only on Amazon Prime Video this Labor Day Weekend!<br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends. Best Fiends is a CASUAL game anyone can play (but made for adults). Download FREE on the Apple App Store or Google Play!",
  "itunes:summary": "Fifteen years after introducing the world to the field of authentic paranormal investigation, Ghost hunters returned to TV on A&E this past week.  The team is now led by Grant Wilson and features a brand new cast of paranormal investigators!...",
  "pubDate": "Sun, 25 Aug 2019 08:00:00 +0000",
  "guid": "23e254c5-0500-4419-9c50-c0f63f9c88fc",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}