{
  "title": "#477: Burning 'Order of the Phoenix' Questions That Were Never Answered",
  "link": "https://audioboom.com/posts/7654579",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5124,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>News: The Harry Potter film series is moving to Peacock and leaving HBO Max.</li>\n<li>Muggle Mail covers <a href=\"https://www.buzzsprout.com/1248779\">Potter People The Podcast</a> and an <a href=\"https://www.fanfiction.net/s/12924292/181/A-Second-Chance\">interesting fan fiction about Voldemort's return!</a>\n</li>\n<li>It's our Order of the Phoenix Rewind episode!</li>\n<li>Acceptable. Troll. Exceeds Expectations. Just how good were our 7-Word Summaries during Chapter-by-Chapter? The grades are in!</li>\n<li>Dumbledore vs. Voldemort. The Lost Prophecy. Harry's trial. What were the Top 7 Most Critical Moments of Order of the Phoenix?</li>\n<li>We take a Time Turner back to 2003! What were fans theorizing most about between the Order of the Phoenix and Half-Blood Prince book releases?</li>\n<li>From Peter Pettigrew to Dumbledore's mysterious absence, what burning questions did Order of the Phoenix and the final two books leave unanswered?</li>\n<li>Luna Lovegood. Dolores Umbridge. Bellatrix Lestrange. We discuss Order of the Phoenix's Most Notable New Characters and how they translated on screen!</li>\n<li>The hosts give their Favorite Moments and Rename The Book</li>\n<li>Quizzitch: What do Jamie Parker, Jim Dale and Evanna Lynch all have in common (besides Harry Potter)?</li>\n<li>This week's episode is sponsored by BetterHelp (visit <a href=\"http://BetterHelp.com/mugglecast\">BetterHelp.com/mugglecast</a> to get 10% off your first month of therapy)!</li>\n<li>Join our community at <a href=\"http://www.patreon.com/mugglecast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 11 Aug 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-08-10:/posts/7654579",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}