{
  "title": "Chip-scale Simulations in a Quantum-correlated Synthetic Space. (arXiv:2211.01489v1 [physics.optics])",
  "link": "http://arxiv.org/abs/2211.01489",
  "description": "<p>An efficient simulator for quantum systems is one of the original goals for\nthe efforts to develop a quantum computer [1]. In recent years, synthetic\ndimension in photonics [2] have emerged as a potentially powerful approach for\nsimulation that is free from the constraint of geometric dimensionality. Here\nwe demonstrate a quantum-correlated synthetic crystal, based upon a\ncoherently-controlled broadband quantum frequency comb produced in a chip-scale\ndynamically modulated lithium niobate microresonator. The time-frequency\nentanglement inherent with the comb modes significantly extends the\ndimensionality of the synthetic space, creating a massive nearly 400 x 400\nsynthetic lattice with electrically-controlled tunability. With such a system,\nwe are able to utilize the evolution of quantum correlations between entangled\nphotons to perform a series of simulations, demonstrating quantum random walks,\nBloch oscillations, and multi-level Rabi oscillations in the time and frequency\ncorrelation space. The device combines the simplicity of monolithic\nnanophotonic architecture, high dimensionality of a quantum-correlated\nsynthetic space, and on-chip coherent control, which opens up an avenue towards\nchip-scale implementation of large-scale analog quantum simulation and\ncomputation [1,3,4] in the time-frequency domain.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Javid_U/0/1/0/all/0/1\">Usman A. Javid</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Lopez_Rios_R/0/1/0/all/0/1\">Raymond Lopez-Rios</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Ling_J/0/1/0/all/0/1\">Jingwei Ling</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Graf_A/0/1/0/all/0/1\">Austin Graf</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Staffa_J/0/1/0/all/0/1\">Jeremy Staffa</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Lin_Q/0/1/0/all/0/1\">Qiang Lin</a>"
}