{
  "title": "Robot Outperforms a Surgeon in a Precision Training Task",
  "link": "https://spectrum.ieee.org/robot-outperforms-a-surgeon-in-a-precision-training-task",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/robotic-arms-with-surgical-tools-approach-a-red-board-with-pegs.jpg?id=30154200&width=1200&height=600&coordinates=0%2C109%2C0%2C110\"/><br/><br/><p>\n<p>\n<em>This article is part of our exclusive <a href=\"https://spectrum.ieee.org/collections/journal-watch/\" rel=\"noopener noreferrer\" target=\"_self\">IEEE Journal Watch series</a> in partnership with IEEE Xplore.</em>\n</p>\n</p>\n<p>\n\tWho is better at performing surgery: an experienced surgeon or a robot?\n</p>\n<p>\n\tTypically, surgeons have to make incisions that are relatively big during surgery, whereas the small instruments of a robot can fit through smaller incisions. Given this advantage of robotic systems, it’s now quite common for surgeons to use remote-controlled robotic arms to perform surgery—combining the precision of an experienced human with the minimal invasiveness of a small robotic arm. Nevertheless, the surgeon is controlling the robot in these cases, and a fully automated robotic system that can outperform surgeons in terms of precision is yet to be realized.\n</p>\n<p>\n\tA recent advance shows that robots could surpass human performance in the near future, however. In a \n\t<a href=\"https://ieeexplore.ieee.org/abstract/document/9772013\" rel=\"noopener noreferrer\" target=\"_blank\">paper</a> published 10 May in <a href=\"https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8856\" rel=\"noopener noreferrer\" target=\"_blank\"><em>IEEE Transactions on Automation Science and Engineering</em></a>, a multinational team of researchers reported the results of a study where a robot was able to complete a common surgery training task with the same accuracy as an experienced surgeon, while completing the task more quickly and consistently.\n</p>\n<p>\n\tMinho Hwang, an assistant professor at the Daegu Gyeongbuk Institute of Science and Technology, in South Korea, was involved in the study. He notes that many robotic systems currently rely on automated control of cables, which are subjected to friction, cable coupling, and stretch—all of which can make precision positioning difficult.\n</p>\n<p>\n\t“When humans control the robots, they can compensate through human visual feedback,” explains Hwang. “But automation of robot-assisted surgery is very difficult due to [these] position errors.”\n</p>\n<p>\n\tIn their study, Hwang and colleagues took a standard da Vinci robotic system, which is a common model usedd for robot-assisted surgery, and strategically placed 3-D printed markers on its robotic arm. This allowed the team to track its movements using a color and depth sensor. They then analyzed the arm’s movements using a machine-learning algorithm. Results suggest that the trained model can reduce the mean tracking error by 78 percent, from 2.96 millimeters to 0.65 mm.\n</p>\n<p>\n\tNext, the researchers put their system to the test against an experienced surgeon who had performed more than 900 surgeries, as well as against nine volunteers with no surgical experience. The study participants were asked to complete a peg transfer task, which is a standardized test for training surgeons that involves transferring six triangular blocks from one side of a pegboard to the other and then back again. While the task sounds simple enough, it requires millimeter precision.\n</p>\n<p>\n\tThe study participants completed three different variations of the peg task using the da Vinci system: unilateral (using one arm to move a peg), bilateral (using two arms to simultaneously move two pegs) and bilateral with a crossover (using one arm to pick up the peg, transfer it to the other arm, and place the peg on the board). Their robot-assisted performance was compared to that of the fully automated robotic system designed by Hwang’s team.\n</p>\n<p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"4e971addae5aa180bbbb81c9dce5c925\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/xXMvtPlBzlc?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Hwang et al show how their robot system can outperform a surgeon in a precision training task. In the most difficult variation of the task, called a bilateral handover, the robot must pick up a peg, transfer it to the other robotic arm, and then place the peg back on the peg board, all with millimeter precision. The robot outperforms the surgeon by 31.7 % in mean transfer time.</small>\n</p>\n<p>\n\tUsing one arm, the surgeon outperformed the automated robot in terms of speed. But in the more complex tasks involving two arms, the robot outperformed the surgeon.\n</p>\n<p>\n\tFor example, for the most difficult task (bilateral handovers), the surgeon achieved a success rate of 100 percent with a mean transfer time of 7.9 seconds. The robot had the same success rate, but with a mean transfer time of just 6.0 seconds.\n</p>\n<p>\n\t“We were very surprised by the robot’s speed and accuracy, as it is very hard to surpass the skill of a trained human surgeon,” says Ken Goldberg, a\n\t professor in the Department of Electrical Engineering and Computer Sciences at the University of California, Berkeley, who was also involved in the study. “We were also surprised by how consistent the robot was; it transferred 120 blocks flawlessly without a single failure.”\n</p>\n<p>\n\tGoldberg and Hwang note that this is a preliminary study in a controlled environment, and more studies are still needed to achieve fully automated robotic surgery. But as far as they are aware, this is the first instance of a robot outperforming a human in a surgery-related training task.\n</p>\n<p>\n\t“We have demonstrated that fast and accurate automation is feasible for one surgical task involving rigid objects of known shape. The next step is to demonstrate this for other tasks and in the much more complex environment of a human body,” says Hwang.\n</p>\n<p>\n\tHe says that, in future work, the team plans to extend their approach to automating surgical subtasks such as tissue suturing, and that they would like to build upon their methods for calibration, motion planning, visual servoing, and error recovery.\n</p>\n<p>\n<em>This article appears in the October 2022 print issue as “Robot Bests Surgeon in Precision Task.”</em>\n</p>",
  "pubDate": "Tue, 19 Jul 2022 15:03:02 +0000",
  "guid": "https://spectrum.ieee.org/robot-outperforms-a-surgeon-in-a-precision-training-task",
  "category": [
    "Surgical robots",
    "Machine learning",
    "Journal watch"
  ],
  "dc:creator": "Michelle Hampson",
  "media:content": ""
}