{
  "title": "Dask Development Log, Scipy 2018",
  "link": "",
  "updated": "2018-07-17T00:00:00+00:00",
  "id": "https://mrocklin.github.io/blog/work/2018/07/17/dask-dev",
  "content": "<p><em>This work is supported by <a href=\"http://anaconda.com\">Anaconda Inc</a></em></p>\n\n<p>To increase transparency I’m trying to blog more often about the current work\ngoing on around Dask and related projects.  Nothing here is ready for\nproduction.  This blogpost is written in haste, so refined polish should not be\nexpected.</p>\n\n<p>Last week many Dask developers gathered for the annual SciPy 2018 conference.\nAs a result, very little work was completed, but many projects were started or\ndiscussed.  To reflect this change in activity this blogpost will highlight\npossible changes and opportunities for readers to further engage in\ndevelopment.</p>\n\n<h2 id=\"dask-on-hpc-machines\">Dask on HPC Machines</h2>\n\n<p>The <a href=\"https://dask-jobqueue.readthedocs.io/\">dask-jobqueue</a> project was a hit at\nthe conference.  Dask-jobqueue helps people launch Dask on traditional job\nschedulers like PBS, SGE, SLURM, Torque, LSF, and others that are commonly\nfound on high performance computers.  These are <em>very common</em> among scientific,\nresearch, and high performance machine learning groups but commonly a bit hard\nto use with anything other than MPI.</p>\n\n<p>This project came up in the <a href=\"https://youtu.be/2rgD5AJsAbE\">Pangeo talk</a>,\nlightning talks, and the Dask Birds of a Feather session.</p>\n\n<p>During sprints a number of people came up and we went through the process of\nconfiguring Dask on common supercomputers like Cheyenne, Titan, and Cori.  This\nprocess usually takes around fifteen minutes and will likely be the subject of\na future blogpost.  We published known-good configurations for these clusters\non our <a href=\"http://dask-jobqueue.readthedocs.io/en/latest/configurations.html\">configuration documentation</a></p>\n\n<p>Additionally, there is a <a href=\"https://github.com/jupyterhub/batchspawner/issues/101\">JupyterHub\nissue</a> to improve\ndocumentation on best practices to deploy JupyterHub on these machines.  The\ncommunity has done this well a few times now, and it might be time to write up\nsomething for everyone else.</p>\n\n<h3 id=\"get-involved\">Get involved</h3>\n\n<p>If you have access to a supercomputer then please try things out.  There is a\n30-minute Youtube video screencast on the\n<a href=\"https://dask-jobqueue.readthedocs.io/\">dask-jobqueue</a> documentation that should\nhelp you get started.</p>\n\n<p>If you are an administrator on a supercomputer you might consider helping to\nbuild a configuration file and place it in <code class=\"language-plaintext highlighter-rouge\">/etc/dask</code> for your users.  You\nmight also want to get involved in the <a href=\"http://dask-jobqueue.readthedocs.io/en/latest/configurations.html\">JupyterHub on\nHPC</a>\nconversation.</p>\n\n<h2 id=\"dask--scikit-learn-talk\">Dask / Scikit-learn talk</h2>\n\n<p>Olivier Grisel and Tom Augspurger prepared and delivered a great talk on the\ncurrent state of the new Dask-ML project.</p>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/ccfsbuqsjgI\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"></iframe>\n\n<h2 id=\"mybinder-and-bokeh-servers\">MyBinder and Bokeh Servers</h2>\n\n<p>Not a Dask change, but Min Ragan-Kelley showed how to run services through\n<a href=\"https://mybinder.org/\">mybinder.org</a> that are not only Jupyter.  As an example,\nhere is a repository that deploys a Bokeh server application with a single\nclick.</p>\n\n<ul>\n  <li><a href=\"https://github.com/minrk/binder-bokeh-server\">Github repository</a></li>\n  <li><a href=\"https://mybinder.org/v2/gh/minrk/binder-bokeh-server/master?urlpath=%2Fproxy%2F5006%2Fbokeh-app\">Binder link</a></li>\n</ul>\n\n<p>I think that by composing with Binder Min effectively just created the\nfree-to-use hosted Bokeh server service.  Presumably this same model could be\neasily adapted to other applications just as easily.</p>\n\n<h2 id=\"dask-and-automated-machine-learning-with-tpot\">Dask and Automated Machine Learning with TPOT</h2>\n\n<p>Dask and TPOT developers are discussing paralellizing the\nautomatic-machine-learning tool <a href=\"http://epistasislab.github.io/tpot/\">TPOT</a>.</p>\n\n<p>TPOT uses genetic algorithms to search over a space of scikit-learn style\npipelines to automatically find a decently performing pipeline and model.  This\ninvolves a fair amount of computation which Dask can help to parallelize out to\nmultiple machines.</p>\n\n<ul>\n  <li><a href=\"https://github.com/EpistasisLab/tpot/issues/304\">Issue: EpistasisLab/tpot #304</a></li>\n  <li><a href=\"https://github.com/EpistasisLab/tpot/pull/730\">PR: EpistasisLab/tpot #730</a></li>\n</ul>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/QrJlj0VCHys\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"></iframe>\n\n<h3 id=\"get-involved-1\">Get involved</h3>\n\n<p>Trivial things work now, but to make this efficient we’ll need to dive in a bit\nmore deeply.  Extending that pull request to dive within pipelines would be a\ngood task if anyone wants to get involved.  This would help to share\nintermediate results between pipelines.</p>\n\n<h2 id=\"dask-and-scikit-optimize\">Dask and Scikit-Optimize</h2>\n\n<p>Among various features, <a href=\"https://scikit-optimize.github.io/\">Scikit-optimize</a>\noffers a <a href=\"https://scikit-optimize.github.io/#skopt.BayesSearchCV\">BayesSearchCV</a>\nobject that is like Scikit-Learn’s <code class=\"language-plaintext highlighter-rouge\">GridSearchCV</code> and <code class=\"language-plaintext highlighter-rouge\">RandomSearchCV</code>, but is a\nbit smarter about how to choose new parameters to test given previous results.\nHyper-parameter optimization is a low-hanging fruit for Dask-ML workloads today,\nso we investigated how the project might help here.</p>\n\n<p>So far we’re just experimenting using Scikit-Learn/Dask integration through\njoblib to see what opportunities there are.  Dicussion among Dask and\nScikit-Optimize developers is happening here:</p>\n\n<ul>\n  <li><a href=\"https://github.com/dask/dask-ml/issues/300\">Issue: dask/dask-ml #300</a></li>\n</ul>\n\n<h2 id=\"centralize-pydatascipy-tutorials-on-binder\">Centralize PyData/Scipy tutorials on Binder</h2>\n\n<p>We’re putting a bunch of the PyData/Scipy tutorials on Binder, and hope to\nembed snippets of Youtube videos into the notebooks themselves.</p>\n\n<p>This effort lives here:</p>\n\n<ul>\n  <li><a href=\"https://pydata-tutorials.readthedocs.io\">pydata-tutorials.readthedocs.io</a></li>\n</ul>\n\n<h3 id=\"motivation\">Motivation</h3>\n\n<p>The PyData and SciPy community delivers tutorials as part of most conferences.\nThis activity generates both educational Jupyter notebooks and explanatory\nvideos that teach people how to use the ecosystem.</p>\n\n<p>However, this content isn’t very discoverable <em>after</em> the conference.  People\ncan search on Youtube for their topic of choice and hopefully find a link to\nthe notebooks to download locally, but this is a somewhat noisy process.  It’s\nnot clear which tutorial to choose and it’s difficult to match up the video\nwith the notebooks during exercises.\nWe’re probably not getting as much value out of these resources as we could be.</p>\n\n<p>To help increase access we’re going to try a few things:</p>\n\n<ol>\n  <li>Produce a centralized website with links to recent tutorials delivered for\neach topic</li>\n  <li>Ensure that those notebooks run easily on Binder</li>\n  <li>Embed sections of the talk on Youtube within each notebook so that the\nexplanation of the section is tied to the exercises</li>\n</ol>\n\n<h3 id=\"get-involved-2\">Get involved</h3>\n\n<p>This only really works long-term under a community maintenance model.  So far\nwe’ve only done a few hours of work and there is still plenty to do in the\nfollowing tasks:</p>\n\n<ol>\n  <li>Find good tutorials for inclusion</li>\n  <li>Ensure that they work well on <a href=\"https://mybinder.org/\">mybinder.org</a>\n    <ul>\n      <li>are self-contained and don’t rely on external scripts to run</li>\n      <li>have an environment.yml or requirements.txt</li>\n      <li>don’t require a lot of resources</li>\n    </ul>\n  </li>\n  <li>Find video for the tutorial</li>\n  <li>Submit a pull request to the tutorial repository that embeds a link to the\nyoutube talk at the top cell of the notebook at the proper time for each\nnotebook</li>\n</ol>\n\n<h2 id=\"dask-actors-and-ray\">Dask, Actors, and Ray</h2>\n\n<p>I really enjoyed the <a href=\"https://youtu.be/D_oz7E4v-U0\">talk on Ray</a> another\ndistributed task scheduler for Python.  I suspect that Dask will steal ideas\nfor <a href=\"https://github.com/dask/distributed/issues/2109\">actors for stateful operation</a>.\nI hope that Ray takes on ideas for using standard Python interfaces so that\nmore of the community can adopt it more quickly.  I encourage people to check\nout the talk and give Ray a try.  It’s pretty slick.</p>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/D_oz7E4v-U0\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"></iframe>\n\n<h2 id=\"planning-conversations-for-dask-ml\">Planning conversations for Dask-ML</h2>\n\n<p>Dask and Scikit-learn developers had the opportunity to sit down again and\nraise a number of issues to help plan near-term development.  This focused\nmostly around building important case studies to motivate future development,\nand identifying algorithms and other projects to target for near-term\nintegration.</p>\n\n<h3 id=\"case-studies\">Case Studies</h3>\n\n<ul>\n  <li><a href=\"https://github.com/dask/dask-ml/issues/302\">What is the purpose of a case study: dask/dask-ml #302</a></li>\n  <li><a href=\"https://github.com/dask/dask-ml/issues/295\">Case study: Sparse Criteo Dataset: dask/dask-ml #295</a></li>\n  <li><a href=\"https://github.com/dask/dask-ml/issues/296\">Case study: Large scale text classification: dask/dask-ml #296</a></li>\n  <li><a href=\"https://github.com/dask/dask-ml/issues/297\">Case study: Transfer learning from pre-trained model: dask/dask-ml #297</a></li>\n</ul>\n\n<h3 id=\"algorithms\">Algorithms</h3>\n\n<ul>\n  <li><a href=\"https://github.com/dask/dask-ml/issues/299\">Gradient boosted trees with Numba: dask/dask-ml #299</a></li>\n  <li><a href=\"https://github.com/dask/dask-ml/issues/300\">Parallelize Scikit-Optimize for hyperparameter optimization: dask/dask-ml #300</a></li>\n</ul>\n\n<h3 id=\"get-involved-3\">Get involved</h3>\n\n<p>We could use help in building out case studies to drive future development in\nthe project.  There are also several algorithmic places to get involved.\nDask-ML is a young and fast-moving project with many opportunities for new\ndevelopers to get involved.</p>\n\n<h2 id=\"dask-and-umap-for-low-dimensional-embeddings\">Dask and UMAP for low-dimensional embeddings</h2>\n\n<p>Leland McKinnes gave a great talk <a href=\"https://youtu.be/nq6iPZVUxZU\">Uniform Manifold Approximation and\nProjection for Dimensionality Reduction</a> in which\nhe lays out a well founded algorithm for dimensionality reduction, similar to\nPCA or T-SNE, but with some nice properties.  He worked together with some Dask\ndevelopers where we identified some challenges due to dask array slicing with\nrandom-ish slices.</p>\n\n<p>A proposal to fix this problem lives here, if anyone wants a fun problem to work on:</p>\n\n<ul>\n  <li><a href=\"https://github.com/dask/dask/issues/3409#issuecomment-405254656\">dask/dask #3409 (comment)</a></li>\n</ul>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/nq6iPZVUxZU\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"></iframe>\n\n<h2 id=\"dask-stories\">Dask stories</h2>\n\n<p>We soft-launched <a href=\"http://dask-stories.readthedocs.io/en/latest/\">Dask Stories</a>\na webpage and project to collect user and share stories about how people use\nDask in practice.  We’re also delivering a separate blogpost about this today.</p>\n\n<p>See blogpost: <a href=\"http://matthewrocklin.com/blog/work/2018/07/16/dask-stories\">Who uses Dask?</a></p>\n\n<p>If you use Dask and want to share your story we would absolutely welcome your\nexperience.  Having people like yourself share how they use Dask is incredibly\nimportant for the project.</p>"
}