{
  "id": "https://bibleinoneyear.org/en/youth/57",
  "title": "Day 57: Better Than Fame and Celebrity",
  "description": "Psalm 26:2–12, Exodus 40:34–38, Mark 9:2–24. Perhaps it is not surprising that as society moves away from worshipping *the glory of God*, it turns towards the worship of the ‘glory’ of celebrity and fame  We are called to worship God’s glory and reflect it, however imperfectly, in our lives",
  "pubDate": "Sat, 26 Feb 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/57/",
  "itunes:duration": "13:53",
  "guid": "enyouth26022022-57",
  "length": 833.91,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 57: Better Than Fame and Celebrity",
  "itunes:subtitle": "Psalm 26:2–12, Exodus 40:34–38, Mark 9:2–24. Perhaps it is not surprising that as society moves away from worshipping *the glory of God*, it turns towards the worship of the ‘glory’ of celebrity and fame  We are called to worship God’s glory and reflect it, however imperfectly, in our lives",
  "itunes:summary": "In a survey of millennials, 50% of young adults said that a major life goal was to become famous. In the past people wanted to be famous for doing something. Now, celebrity has become an end in itself. It has attained god-like characteristics. Not only do people want to be famous, they idolise those who have achieved celebrity status. This widespread interest in famous individuals has been described as ‘the cult of celebrity’.\nFame to the ambitious is like salt water to the thirsty. The more you get, the more you want. Madonna, who at one stage was probably the most famous woman on the planet, said, ‘I won’t be happy until I am as famous as God.’\nCelebrity and fame are only a pale reflection of true glory. ‘Glory’ is used in the Bible to denote the manifestation of God’s presence. Glory is one of the most common words in the Bible. God’s glory means his importance, reputation, majesty and honour.\nPerhaps it is not surprising that as society moves away from worshipping the glory of God, it turns towards the worship of the ‘glory’ of celebrity and fame. We are called to worship God’s glory and reflect it, however imperfectly, in our lives.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 422
}