{
  "title": "S16 Ep20: Holzer's Ghosts: Ghosts of Port Clyde",
  "link": "https://audioboom.com/posts/8098391",
  "itunes:episode": 20,
  "itunes:title": "Holzer's Ghosts: Ghosts of Port Clyde",
  "itunes:season": 16,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4256,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>Darkness Radio presents Holzer's Ghosts: Ghosts of Port Clyde with guests Shane Pittman & Jamie Kaler</p>\n\n<p>Tonight Dave Schrader, lead investigator of the Holzer Files is joined by fellow investigator Shane Pittman and paranormal adventurer and actor/comedian Jamie Kaler to discuss the most recent episode of The #HolzerFiles.</p>\n\n<p>In 1976, legendary ghost hunter Hans Holzer visited the quiet coastal Maine town of Port Clyde to investigate the haunting of a woman's home. Her horrific dreams bled into a terrifying reality as members of her family started experiencing a dark figure appearing in the home, whispering in the night, and even physically attacking them in their beds.</p>\n\n<p>Now, nearly half a century after Hans Holzer first helped cross over a restless spirit, his hidden case file is reopened, as paranormal investigator Dave Schrader, psychic medium Cindy Kaza, equipment expert Shane Pittman along with new insights from researcher Gabe Roth and Holzer's own daughter, Alexandra return to Maine's rocky coast to research the resurgent haunting.</p>\n\n<p>However, as they delve into the family's haunting, they soon find that the haunting is very different from that which Hans Holzer encountered, and the spirits in the home may have a more personal attachment than they ever suspected a team member is left scarred for life!</p>\n\n<p>Check out Jamie's YouTube Channel: <a href=\"https://www.youtube.com/user/JamieKaler\">https://www.youtube.com/user/JamieKaler</a></p>\n\n<p>Visit Shane's site: <a href=\"http://www.officialshanepittman.com/\">www.officialshanepittman.com</a></p>\n",
  "pubDate": "Fri, 19 Feb 2021 09:00:00 +0000",
  "guid": "f715bce0-81e5-4fe4-9766-acd4006405f3",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}