{
  "title": "Chinese Whispers: how China replaced Russia in Kazakhstan and beyond",
  "link": "https://audioboom.com/posts/8143751",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2474,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>What does China want with Xinjiang? Its systematic repression of the Uyghur people and other regional minorities has shocked the world, eliciting accusations of genocide from politicians and activists across the West. The Chinese Communist Party claims that its re-education camps are an anti-terrorism measure, but surely if anything is going to radicalise vast swathes of a non-Han population, it’s their forced internment and (for many) subsequent incarceration. So what is the CCP’s long term aim?</div>\n<br>\n<div>According to Raffaello Pantucci, senior associate fellow at the think tank Rusi, ‘the Central Government recognises that a very strong security crackdown is not necessarily going to deal with these problems in perpetuity’. Instead, ‘long-term stability for Xinjiang is going to come from economic prosperity’.</div>\n<br>\n<div>That’s where Central Asia comes in. On this episode, I talk to Raffaello about China’s relations with the five ‘Stans that sit cushioned between China (to their east) and Russia (to their north). As with China’s relationship with any developing region, Beijing is motivated by access to its significant oil and mineral resources. But there’s something special about Central Asia - Raffaello argues that it’s an extension of Beijing’s Xinjiang strategy: ‘It’s really about trying to improve the prosperity in this border region around Xinjiang to help improve its prosperity and stability… If you’re going to make Xinjiang economically prosperous, you’re going to have to find a way of connecting it to the world.’   </div>\n<br>\n<div>Raffaello’s new book is <em>Sinostan: China’s Inadvertent Empire</em>, based on a decade of travel in and around the region (there were two when they started, but Raffaello’s co-author, Alexandros Petersen, died in a Taliban attack in Kabul eight years ago). As well as the Xinjiang implications, <em>Sinostan</em> looks at China’s oil and gas trade with these resource-rich countries, the cultural exchanges (or lack thereof, and often promoted by Confucius Institutes) and the difference in approach between Moscow and Beijing, all of which we discuss on the episode.</div>\n<br>\n<div>On China’s usurpation of Russia in the region, it’s striking that some public opinion is deeply suspicious of the new power in the region, a general Sinophobia that crystallises in numerous conspiracy theories (for example that roads built by Chinese companies are specifically designed to the weight of Chinese tanks). Welcomed by governments keen to benefit from the economic clout of their neighbour, some Chinese companies end up trying to hide their presence to avoid the ire of the locals. Raffaello recounts that ‘there are some cities in Kazakhstan, particularly in the oil regions, where we know CNPC [China National Petroleum Corporation] is a big player, but we just couldn’t find evidence of them. You’d ask the locals “where are the CNPC guys” and they’d say “we don’t know what you’re talking about”’.</div>\n<br>\n<div>But China’s influence is very much there. It remains a ‘huge lacuna in Western strategic thinking’ that cannot be ignored, Raffaello says. Tune in to get ahead on this next geopolitical hot topic.<br>\n<br>\nThis episode is sponsored by the SOAS China Institute. Buy tickets for their three day course on China and the media at <a href=\"http://www.spectator.co.uk/soas\">www.spectator.co.uk/soas</a>.<br>\n<br>\nLearn more about China's relationship with Afghanistan here: <a href=\"https://www.spectator.co.uk/podcast/will-china-become-afghanistan-s-new-sponsor-\">https://www.spectator.co.uk/podcast/will-china-become-afghanistan-s-new-sponsor-</a>\n</div>\n",
  "pubDate": "Mon, 22 Aug 2022 16:47:18 +0000",
  "guid": "tag:audioboom.com,2022-08-22:/posts/8143751",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}