{
  "title": "Four from MIT receive NIH New Innovator Awards for 2022",
  "link": "https://news.mit.edu/2022/nih-new-innovator-awards-1004",
  "description": "Awards support high-risk, high-impact research from early-career investigators.",
  "pubDate": "Tue, 04 Oct 2022 13:10:00 -0400",
  "guid": "https://news.mit.edu/2022/nih-new-innovator-awards-1004",
  "dc:creator": "Phie Jacobs | School of Science",
  "content:encoded": "<p>The National Institutes of Health (NIH) has awarded grants to four MIT faculty members as part of its <a href=\"https://commonfund.nih.gov/highrisk\">High-Risk, High-Reward Research</a> program.</p>\n\n<p>The program supports unconventional approaches to challenges in biomedical, behavioral, and social sciences. Each year, NIH Director’s Awards are granted to program applicants who propose high-risk, high-impact research in areas relevant to the NIH’s mission. In doing so, the NIH encourages innovative proposals that, due to their inherent risk, might struggle in the traditional peer-review process.</p>\n\n<p>This year, Lindsay Case, Siniša Hrvatin, Deblina Sarkar, and Caroline Uhler have been chosen to receive the <a href=\"https://commonfund.nih.gov/newinnovator\">New Innovator Award</a>, which funds exceptionally creative research from early-career investigators. The award, which was established in 2007, supports researchers who are within 10 years of their final degree or clinical residency and have not yet received a research project grant or equivalent NIH grant.</p>\n\n<p><a href=\"https://biology.mit.edu/profile/lindsay-case/\">Lindsay Case</a><u>,</u> the Irwin and Helen Sizer Department of Biology Career Development Professor and an extramural member of the Koch Institute for Integrative Cancer Research, uses biochemistry and cell biology to study the spatial organization of signal transduction. Her work focuses on understanding how signaling molecules assemble into compartments with unique biochemical and biophysical properties to enable cells to sense and respond to information in their environment. Earlier this year, Case was one of two MIT assistant professors named as <a href=\"https://searlescholars.org/\">Searle Scholars</a>.</p>\n\n<p><a href=\"https://biology.mit.edu/profile/sinisa-hrvatin/\">Siniša Hrvatin</a>, who joined the School of Science faculty this past winter, is an assistant professor in the Department of Biology and a core member at the Whitehead Institute for Biomedical Research. He studies how animals and cells enter, regulate, and survive states of dormancy such as torpor and hibernation, aiming to harness the potential of these states therapeutically.</p>\n\n<p><a href=\"https://www.media.mit.edu/people/deblina/overview/\">Deblina Sarkar</a> is an assistant professor and AT&amp;T Career Development Chair Professor at the MIT Media Lab​. Her research combines the interdisciplinary fields of nanoelectronics, applied physics, and biology to invent disruptive technologies for energy-efficient nanoelectronics and merge such next-generation technologies with living matter to create a new paradigm for life-machine symbiosis. Her high-risk, high-reward proposal received the rare perfect impact score of 10, which is the highest score awarded by NIH.</p>\n\n<p><a href=\"https://www.carolineuhler.com/\">Caroline Uhler</a> is a professor in the Department of Electrical Engineering and Computer Science and the Institute for Data, Systems, and Society. In addition, she is a core institute member at the Broad Institute of MIT and Harvard, where she co-directs the Eric and Wendy Schmidt Center. By combining machine learning, statistics, and genomics, she develops representation learning and causal inference methods to elucidate gene regulation in health and disease.</p>\n\n<p>The High-Risk, High-Reward Research program is supported by the NIH Common Fund, which oversees programs that pursue major opportunities and gaps in biomedical research that require collaboration across NIH Institutes and Centers. In addition to the New Innovator Award, the NIH also issues three other awards each year: the <a href=\"https://commonfund.nih.gov/pioneer/\">Pioneer Award</a>, which supports bold and innovative research projects with unusually broad scientific impact; the <a href=\"https://commonfund.nih.gov/TRA/\">Transformative Research Award</a>, which supports risky and untested projects with transformative potential; and the <a href=\"https://commonfund.nih.gov/earlyindependence/\">Early Independence Award</a>, which allows especially impressive junior scientists to skip the traditional postdoctoral training program to launch independent research careers.</p>\n\n<p>This year, the High-Risk, High-Reward Research program is awarding 103 awards, including eight Pioneer Awards, 72 New Innovator Awards, nine Transformative Research Awards, and 14 Early Independence Awards. These 103 awards total approximately $285 million in support from the institutes, centers, and offices across NIH over five years. “The science advanced by these researchers is poised to blaze new paths of discovery in human health,” says Lawrence A. Tabak DDS, PhD, who is performing the duties of the director of NIH. “This unique cohort of scientists will transform what is known in the biological and behavioral world. We are privileged to support this innovative science.”</p>",
  "media:content": {
    "media:description": "Clockwise from top left: MIT NIH New Innovator Award winners Lindsay Case, Siniša Hrvatin, Caroline Uhler, and Deblina Sarkar",
    "media:credit": "Photos courtesy of the faculty."
  },
  "category": [
    "Awards, honors and fellowships",
    "Grants",
    "Faculty",
    "Research",
    "National Institutes of Health (NIH)",
    "Biology",
    "Electrical Engineering & Computer Science (eecs)",
    "Broad Institute",
    "IDSS",
    "Koch Institute",
    "Media Lab",
    "Whitehead Institute",
    "School of Architecture and Planning",
    "School of Science",
    "School of Engineering",
    "MIT Schwarzman College of Computing"
  ]
}