{
  "title": "#420: Really Loose Pockets (HBP 28, Flight of the Prince)",
  "link": "https://audioboom.com/posts/7284503",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4852,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Unplug your Alexa's: Our Slug Club guest this week had her name stolen from Amazon!</li>\n<li>Vans' new line of Harry Potter shoes is causing some ripples amongst fans -- how'd Hufflepuff gets the short end of the stick?</li>\n<li>Andrew is in Orlando for the opening of Hagrid's Magical Creatures Motorbike Adventure. Follow us on Instagram to get looks at the new ride!</li>\n<li>MuggleMail: What would've happened if the Death Eaters weren't waiting for Dumbledore back at Hogwarts? And the best DVD/Blu-ray collection question gets answered.</li>\n<li>Chapter by Chapter: Half-Blood Prince Chapter 28, Flight of the Prince.</li>\n<li>Have we ever felt like Harry did in the opening of this scene, as if we're hurling through space because of a life-changing event?</li>\n<li>Hogwarts Is A Security Nightmare Example #9134891: Kids running around while hearing ruckus. Where's the lock-down?</li>\n<li>Warning: Never light Laura's house is on fire while her dog is inside. She will be enraged.</li>\n<li>Harry has to remind Hagrid to put out his burning home. He ALSO has to remind him how to conjure one of earth's core elements: WTF?</li>\n<li>Even while working for the Greater Good, Snape still takes the opportunity to besmirch James. Why so mean?</li>\n<li>The Half-Blood Prince is revealed, and Snape can't stand being called a coward. What's going through his mind in this moment?</li>\n<li>The movie version of this chapter is different to say the least. We compare and contrast.</li>\n<li>Dumbledore's pockets are now available for everyone to peruse, and the locket presents itself. Uh oh.</li>\n<li>Quizzitch: From whom does Lupin learn that Dumbledore has died?</li>\n<li>Thank you to this week's sponsors: The Harry Potter Figurine Collection (<a href=\"http://HeroCollector.com/Wizards\">HeroCollector.com/Wizards</a>), Scentbird (<a href=\"http://Scentbird.com/MUGGLECAST\">Scentbird.com/MUGGLECAST</a> for 50% off), and ThirdLove (<a href=\"http://Thirdlove.com/MuggleCast\">Thirdlove.com/MuggleCast</a> for 15% off). Support the show by supporting supporting our advertisers!</li>\n</ul>\n",
  "pubDate": "Mon, 10 Jun 2019 13:03:15 +0000",
  "guid": "tag:audioboom.com,2019-06-10:/posts/7284503",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}