{
  "title": "500: The Best Harry Potter Pick-Up Lines, Popular Head Cannon Ships",
  "link": "https://audioboom.com/posts/7794773",
  "itunes:episode": 500,
  "itunes:title": "The Best Harry Potter Pick-Up Lines, Popular Head Cannon Ships",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4542,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>We made it to Episode 500! To celebrate, we have a fun a look at MuggleCast By The Numbers</li>\n<li>How many emails have we received over the years? How many times has the show been downloaded? Which host has appeared on the most episodes?</li>\n<li>Guess That MuggleCast Episode Title! Eric quizzes Andrew, Laura and Micah on some of the more memorable episode titles on the last 15 years!</li>\n<li>To celebrate Valentine's Day, we set the mood and deliver some of the best Harry Potter Pickup Lines</li>\n<li>Alternate Universe Pairings that've been popular head cannon: could Harry and Luna have really happened? What about Hermione and Draco? Remus and Sirius?</li>\n<li>We examine some of the more popular head canon couples in the series and try to identify the turning point where they could have become a reality!</li>\n<li>What Hogwarts House is your soulmate in? <a href=\"https://www.buzzfeed.com/ewinca5447/itas-freaky-but-we-know-what-hogwarts-house-is-y-6n5u235gdp\">Take the quiz</a>!</li>\n<li>Quizzitch: How far did Harry throw the gnome that bit him?</li>\n<li>This week's episode is sponsored by <a href=\"http://www.thirdlove.com/mugglecast\">ThirdLove</a> (Get 20% off your order at the link!) and our newest sponsor <a href=\"http://www.magicspoon.com/mugglecast\">Magic Spoon </a>(hit the link and use promo code 'mugglecast' for $5 off your first order!)</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like a personalized thank you video from one of the hosts and Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 09 Feb 2021 12:00:00 +0000",
  "guid": "tag:audioboom.com,2021-02-08:/posts/7794773",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}