{
  "title": "Hydrogen Helps Make Topological Insulators Practical",
  "link": "https://spectrum.ieee.org/topological-insulator-hydrogen",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/rendering-shows-a-clear-beaker-with-rendering-suspended-in-liquid-of-atomic-scale-model-featuring-red-and-white-connected-dots-f.jpg?id=29820287&width=1200&height=800&coordinates=0%2C70%2C0%2C71\"/><br/><br/><p>Future microchips that require far less energy than present-day devices may rely on exotic materials known as <a href=\"https://spectrum.ieee.org/a-beginners-guide-to-topological-materials\" target=\"_blank\">topological insulators</a>, in which electricity flows across only surfaces and edges, with virtually no dissipation of energy. However, it can prove tricky developing such materials for real-world applications. Now a new study reveals that simply incorporating hydrogen into topological insulators may control their electronic properties to help make them useful.<br/></p><p>Topology is the branch of mathematics that investigates what features of shapes may survive deformation. Material science has emerged in recent decades as an unexpected but compelling application of topology. The insights from topological models, scientists have discovered, help to understand and predict some materials’ unusual properties. These include electromagnetic effects <a href=\"https://artscimedia.case.edu/wp-content/uploads/sites/176/2014/05/15022516/Sammon_Mathur.pdf\" target=\"_blank\">beyond those explained by Maxwell’s Equations</a> as well as <a href=\"https://www.annualreviews.org/doi/abs/10.1146/annurev-conmatphys-031016-025458\" target=\"_blank\">quantum particles</a> that could yield <a href=\"https://physics.aps.org/articles/v10/63\" target=\"_blank\">new kinds of electronic and optical devices</a>.        </p><p>Using insights from topology, scientists also developed the first electronic <a href=\"https://www.sciencedirect.com/science/article/pii/S1631070513001461\" target=\"_blank\">topological insulators</a> in 2007. Electricity flowing along the edges or surfaces of these materials is “topologically protected,” meaning that the patterns in which the electrons flow will stay unchanged in the face of any disturbances they might encounter, a discovery that helped win the Nobel Prize in Physics in 2016.</p><p>Topological insulators could lead to advances such as <a href=\"https://spectrum.ieee.org/a-beginners-guide-to-topological-materials\" target=\"_self\">ultralow-energy transistors</a>. One major class of topological insulators are known as <a href=\"https://www.nist.gov/publications/chalcogenide-topological-insulators\" target=\"_blank\">chalcogenides</a>, which contain elements known as chalcogens such as selenium and tellurium.</p><p>To make sure topological insulators manifest topological protection on their surfaces, researchers need to make sure the interiors of these materials really are insulating and not conducting. However, naturally occurring defects “can donate electrical charges to the bulk of the material and contribute to unwanted conduction in the bulk,” says study senior author <a href=\"https://www.ccny.cuny.edu/profiles/lia-krusin-elbaum\" target=\"_blank\">Lia Krusin-Elbaum</a>, a physicist at the City College of New York.</p><p>One way to control conduction in the interiors of topological insulators is to make them very thin. However, there are limits to this method, as below a certain thickness, the topologically protected states on the surfaces of these materials vanish. Another strategy involves lacing these materials with a variety of elements, but this can reduce the operating temperature of these materials.</p><p>Now Krusin-Elbaum and her colleagues have developed what they say is a remarkably simple, efficient way to tune the conductivity of the interior of these materials—the insertion or extraction of hydrogen. The scientists detailed <u><a href=\"https://www.nature.com/articles/s41467-022-29957-3\" rel=\"noopener noreferrer\" target=\"_blank\">their findings</a></u> 28 April in the journal <em>Nature Communications</em>.</p><p>In experiments, the scientists used hydrochloric acid diluted in water to help weave hydrogen into chalcogenide topological insulators. The hydrogen can bind with atoms of tellurium or selenium, donating electrons to adjust the material’s electronic properties. This method was fully reversible using a low amount of heating to remove the hydrogen.</p><p>This hydrogen-tuning strategy may relax thickness limits for chalcogenide topological insulators and results in materials that are stable at room temperature. “We were much surprised by the effect and by the efficiency of the hydrogenation as a tuning technique,” Krusin-Elbaum says.</p><p>Krusin-Elbaum suggests hydrogen tuning may help lead to new kinds of topological superconductors, many of which can generate mysterious particles on their surfaces known as Majorana fermions, long-theorized particles that are their own antiparticles. Majorana fermions could find use as quantum bits, or qubits, which lie at the heart of most quantum computers—machines that can theoretically perform more computations in an instant than there are atoms in the universe.</p><p>Qubits are typically fragile, but the Majorana fermions of topological superconductors could prove topologically protected against disturbances. This feature may help lead to “error-free quantum computing,” Krusin-Elbaum says.</p>",
  "pubDate": "Wed, 18 May 2022 16:08:24 +0000",
  "guid": "https://spectrum.ieee.org/topological-insulator-hydrogen",
  "category": [
    "Quantum computing",
    "Hydrogen",
    "Chalcogenide",
    "Majorana fermions",
    "Topological insulators"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}