{
  "title": "Episode 103: Raising Children - Interview with Author Jamie Raser",
  "pubDate": "Sun, 30 Aug 2009 15:20:52 +0000",
  "guid": "episode-103-raising-children-interview-with-aut",
  "link": "http://www.thepsychfiles.com/2009/08/episode-103-raising-children-interview-with-author-jamie-raser/",
  "itunes:image": "",
  "description": "Having trouble raising your children?  Join the crowd.  There are lots and lots of parenting books out there, but here's one I think you should know about. It's called Raising Children You Can Live With by Jamie Raser.  He has an approach to parenting that is not about picking your battles, but about staying out of battles altogether and talking with your child in a way that doesn't lead to shouting, screaming and anger.  I cannot recommend this book highly enough.  Listen to Jamie Raser talk about his ideas in this episode of The Psych Files.",
  "content:encoded": "Having trouble raising your children?  Join the crowd.  There are lots and lots of parenting books out there, but here's one I think you should know about. It's called Raising Children You Can Live With by Jamie Raser.  He has an approach to parenting that is not about picking your battles, but about staying out of battles altogether and talking with your child in a way that doesn't lead to shouting, screaming and anger.  I cannot recommend this book highly enough.  Listen to Jamie Raser talk about his ideas in this episode of The Psych Files.",
  "enclosure": "",
  "itunes:duration": "31:01",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,behavior,psychology,child,lecture,parenting,discipline,childhood,childcare",
  "itunes:subtitle": "Having trouble raising your children? There are lots of parenting books, but here's one you should know about. It's called Raising Children You Can Live With by Jamie Raser. Listen to Jamie Raser talk about his ideas in this episode of The Psych Files. ",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Having trouble raising your children? Join the crowd. There are lots and lots of parenting books out there, but here's one I think you should know about. It's called Raising Children You Can Live With by Jamie Raser. He has an approach to parenting that is not about picking your battles, but about staying out of battles altogether and talking with your child in a way that doesn't lead to shouting, screaming and anger. I cannot recommend this book highly enough. Listen to Jamie Raser talk about his ideas in this episode of The Psych Files."
}