{
  "title": "Amazon Union Organizer Hits Back At Critics!",
  "itunes:title": "Amazon Union Organizer Hits Back At Critics!",
  "pubDate": "Fri, 22 Apr 2022 05:04:16 +0000",
  "guid": "e6aa1148-e2c6-4fae-969c-0a38a977ce91",
  "link": "https://thejimmydoreshow.libsyn.com/amazon-union-organizer-hits-back-at-critics",
  "itunes:image": "",
  "description": "<p>Christian Smalls, the fired Amazon worker who beat the odds to successfully win a union vote at the company's Staten Island fulfillment center, spoke to Jimmy about why his efforts succeeded, what it takes to organize workers from diverse backgrounds and his recent appearance on Tucker Carlson's show.<br /> <br /> Plus segments on the plummeting price of the first ever Twitter tweet NFT and Nina Turner's snubbing by the Congressional Progressive Caucus.<br /> <br /> Also featuring Stef Zamorano, Kurt Metzger and Mike MacRae! And a phone calls from Al Pacino!</p>",
  "content:encoded": "<p>Christian Smalls, the fired Amazon worker who beat the odds to successfully win a union vote at the company's Staten Island fulfillment center, spoke to Jimmy about why his efforts succeeded, what it takes to organize workers from diverse backgrounds and his recent appearance on Tucker Carlson's show.  Plus segments on the plummeting price of the first ever Twitter tweet NFT and Nina Turner's snubbing by the Congressional Progressive Caucus.  Also featuring Stef Zamorano, Kurt Metzger and Mike MacRae! And a phone calls from Al Pacino!</p>",
  "enclosure": "",
  "itunes:duration": "56:42",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Christian Smalls, the fired Amazon worker who beat the odds to successfully win a union vote at the company's Staten Island fulfillment center, spoke to Jimmy about why his efforts succeeded, what it takes to organize workers from diverse backgrounds...",
  "itunes:episodeType": "full",
  "itunes:summary": "Christian Smalls, the fired Amazon worker who beat the odds to successfully win a union vote at the company's Staten Island fulfillment center, spoke to Jimmy about why his efforts succeeded, what it takes to organize workers from diverse backgrounds and his recent appearance on Tucker Carlson's show. Plus segments on the plummeting price of the first ever Twitter tweet NFT and Nina Turner's snubbing by the Congressional Progressive Caucus. Also featuring Stef Zamorano, Kurt Metzger and Mike MacRae! And a phone calls from Al Pacino!"
}