{
  "title": "Adaptive Diffusion Priors for Accelerated MRI Reconstruction. (arXiv:2207.05876v2 [eess.IV] UPDATED)",
  "link": "http://arxiv.org/abs/2207.05876",
  "description": "<p>Deep MRI reconstruction is commonly performed with conditional models that\nde-alias undersampled acquisitions to recover images consistent with\nfully-sampled data. Since conditional models are trained with knowledge of the\nimaging operator, they can show poor generalization across variable operators.\nUnconditional models instead learn generative image priors decoupled from the\nimaging operator to improve reliability against domain shifts. Recent diffusion\nmodels are particularly promising given their high sample fidelity.\nNevertheless, inference with a static image prior can perform suboptimally.\nHere we propose the first adaptive diffusion prior for MRI reconstruction,\nAdaDiff, to improve performance and reliability against domain shifts. AdaDiff\nleverages an efficient diffusion prior trained via adversarial mapping over\nlarge reverse diffusion steps. A two-phase reconstruction is executed following\ntraining: a rapid-diffusion phase that produces an initial reconstruction with\nthe trained prior, and an adaptation phase that further refines the result by\nupdating the prior to minimize reconstruction loss on acquired data.\nDemonstrations on multi-contrast brain MRI clearly indicate that AdaDiff\noutperforms competing conditional and unconditional methods under domain\nshifts, and achieves superior or on par within-domain performance.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/eess/1/au:+Gungor_A/0/1/0/all/0/1\">Alper G&#xfc;ng&#xf6;r</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Dar_S/0/1/0/all/0/1\">Salman UH Dar</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Ozturk_S/0/1/0/all/0/1\">&#x15e;aban &#xd6;zt&#xfc;rk</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Korkmaz_Y/0/1/0/all/0/1\">Yilmaz Korkmaz</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Elmas_G/0/1/0/all/0/1\">Gokberk Elmas</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Ozbey_M/0/1/0/all/0/1\">Muzaffer &#xd6;zbey</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Cukur_T/0/1/0/all/0/1\">Tolga &#xc7;ukur</a>"
}