{
  "id": "yt:video:_wt0uk2DNxI",
  "yt:videoId": "_wt0uk2DNxI",
  "yt:channelId": "UCs8o1mdWAfefJkdBg632_tg",
  "title": "The Worst Movies Of Our Time - Chris Gore",
  "link": "",
  "author": {
    "name": "Film Courage",
    "uri": "https://www.youtube.com/channel/UCs8o1mdWAfefJkdBg632_tg"
  },
  "published": "2022-11-02T00:00:15+00:00",
  "updated": "2022-11-02T00:21:20+00:00",
  "media:group": {
    "media:title": "The Worst Movies Of Our Time - Chris Gore",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Chris Gore is a writer, comedian, author and television personality who has built a solid reputation as a hilariously outspoken voice in the entertainment world. As a teenager, Chris founded the brutally honest magazine Film Threat, which began as a fanzine while he was a college student in Detroit. As Film Threat evolved into a respected national magazine, he relocated to Los Angeles. The print magazine was retired in 1997 when it was re-launched as a web site. FilmThreat.com found a huge audience online and was named one of the top five movie web sites by the Wall Street Journal. Chris has appeared as a film expert on MSNBC, E!, CNN, Travel Channel, and Reelz Channel. Chis has also hosted shows on FX, Starz, IFC and G4TV’s Attack of the Show as the show’s film expert. His weekly movie review segment DVDuesday was among the most popular on G4. Chris is also an author, having written The 50 Greatest Movies Never Made and The Complete DVD Book. His book The Ultimate Film Festival Survival Guide is considered the bible of the industry and is required reading at film school. \n\nBUY THE BOOK - CHRIS GORE'S ULTIMATE FILM FESTIVAL SURVIVAL GUIDE, 4TH EDITION: The Essential Companion for Filmmakers and Festival-Goers (Chris Gore's Ultimate Film Festival Survival Guide) - https://amzn.to/3e69S7m \n\nBUY THE BOOK - THE 50 GREATEST MOVIES NEVER MADE \nhttps://amzn.to/3tvKTkg \n\nSUBSCRIBE TO CHRIS GORE’S YOUTUBE CHANNEL \nhttps://www.youtube.com/FilmThreat \n\nWATCH TEASER TRAILER FOR 'FILM THREAT SUCKS' \nhttps://youtu.be/fhj-C_Z-h6w \n\nMORE VIDEOS WITH CHRIS GORE \nhttps://bit.ly/3lcbuSm \n\nCONNECT WITH CHRIS GORE \nhttps://filmthreat.com \nhttps://www.instagram.com/filmthreat \nhttps://www.facebook.com/filmthreat \nhttps://twitter.com/filmthreat \nhttps://www.youtube.com/FilmThreat \n\nRELATED VIDEOS\nWhat Hollywood Is Getting Wrong And How We Can Fix It - https://youtu.be/Q9UrlGBgQqE\nHow To Fix Hollywood Movies - https://youtu.be/hrJiv2i0tP4\nWhat Happened To The American Movie? - https://youtu.be/JO5KLe1QE5Q\nHow Many Boxes Need To Be Checked For A Hollywood Movie? - https://youtu.be/IsrTtzO1mHU\nPlease Hollywood Realize That It's Not Going To Work - https://youtu.be/lMdaD1JpCFE\n\n(Affiliates)\n►WE USE THIS CAMERA (B&H) – https://buff.ly/3rWqrra\n►WE USE THIS EDITING PROGRAM (ADOBE) – https://goo.gl/56LnpM\n►WE USE THIS SOUND RECORDER (AMAZON) – http://amzn.to/2tbFlM9\n►WRITERS, TRY FINAL DRAFT FREE FOR 30-DAYS! (FINAL DRAFT) - http://ow.ly/Gz4w30rDSKt\n\nBOOKS WE RECOMMEND\nhttps://buff.ly/3o0oE5o\n\nSUPPORT FILM COURAGE BY BECOMING A MEMBER\nhttps://www.youtube.com/channel/UCs8o1mdWAfefJkdBg632_tg/join\n\nCONNECT WITH FILM COURAGE\nhttp://www.FilmCourage.com\nhttp://twitter.com/#!/FilmCourage\nhttps://www.facebook.com/filmcourage\nhttps://www.instagram.com/filmcourage\nhttp://filmcourage.tumblr.com\nhttp://pinterest.com/filmcourage\n\nSUBSCRIBE TO THE FILM COURAGE YOUTUBE CHANNEL\nhttp://bit.ly/18DPN37\n\nLISTEN TO THE FILM COURAGE PODCAST\nhttps://soundcloud.com/filmcourage-com\n\nStuff we use:\n\nLENS - Most people ask us what camera we use, no one ever asks about the lens which filmmakers always tell us is more important.  This lens was a big investment for us and one we wish we could have made sooner.  Started using this lens at the end of 2013 - http://amzn.to/2tbtmOq\n\nAUDIO \n\nRode VideoMic Pro  - The Rode mic helps us capture our backup audio.  It also helps us sync up our audio in post http://amzn.to/2t1n2hx\n\nAudio Recorder - If we had to do it all over again, this is probably the first item we would have bought - http://amzn.to/2tbFlM9\n\nLIGHTS - Although we like to use as much natural light as we can, we often enhance the lighting with this small portable light.  We have two of them and they have saved us a number of times - http://amzn.to/2u5UnHv\n\nCOMPUTER - Our favorite computer, we each have one and have used various models since 2010 - http://amzn.to/2t1M67Z\n\nEDITING - We upgraded our editing suite this year and we’re glad we did!  This has improved our workflow and the quality of our work.  Having new software also helps when we have a problem, it’s easy to search and find a solution - https://goo.gl/56LnpM\n\n*These are affiliate links, by using them you can help support this channel.\n\n#entertainment  #movies #cinema",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}