{
  "title": "US biolab accidents going unreported – The Intercept",
  "link": "https://www.rt.com/news/565915-us-biolab-accidents-go-unreported/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565915-us-biolab-accidents-go-unreported/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6364059f85f5402e4d280a5c.jpg\" /> Hundreds of US biolab accidents have gone unreported to the public, including cases involving deadly viruses <br/><a href=\"https://www.rt.com/news/565915-us-biolab-accidents-go-unreported/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Some have reportedly involved deadly pathogens, and hundreds of cases have been kept from public view</strong></p>\n            \n                        \n            <p>Directors of America&rsquo;s biolabs have admitted to hundreds of dangerous accidents in the past two decades, but even incidents involving exposure to deadly viruses have been kept from public view, an investigation by The Intercept has revealed.</p>\n<p><em>&ldquo;People have it in their minds that lab accidents are very, very rare, and if they happen, they happen only in the least well-run overseas labs,&rdquo;</em> Rutgers University molecular biologist Richard Ebright told the <a href=\"https://theintercept.com/2022/11/01/biosafety-lab-accident-chikungunya-virus/?utm_source=twitter&utm_medium=social&utm_campaign=theintercept\" target=\"_blank\" rel=\"noopener noreferrer\">media outlet</a>. <em>&ldquo;That simply isn&rsquo;t true.&rdquo;</em></p>\n<p>The erroneous public perception could stem from the fact that, as The Intercept found, Americans don&rsquo;t hear about US biolab accidents. The outlet obtained more than 5,500 pages of laboratory incident reports from the US National Institutes of Health (NIH), compelling the agency to release the documents through a Freedom of Information Act request.</p>\n<p>Many lab mishaps are reported to the NIH, the world&rsquo;s largest funder of biomedical research, but the agency doesn&rsquo;t pass on the information to the public, even in cases involving Level 3 and Level 4 biolabs.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.06/thumbnail/62a5fbad2030273d5d10befe.jpg\" alt=\"©  simarik\" />\n            <figcaption><a href=\"https://www.rt.com/russia/557041-biolabs-us-russia-ukraine/\">Russia accuses US of concealing data on biolabs</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>One such incident occurred in 2016, when a graduate student at Washington University in St. Louis accidentally pricked her finger with a needle after injecting a mouse with a recombinant strain of the Chikungunya virus, The Intercept said. The student didn&rsquo;t tell her supervisor about the accident until after becoming ill and seeking treatment at a local hospital emergency room.</p>\n<p>The university disclosed the accident and infection to the NIH, where the report was kept under wraps until The Intercept came calling six years later.&nbsp;&nbsp;</p>\n<p><em>&ldquo;That&rsquo;s not a good situation,&rdquo;</em> said Scott Weaver, a University of Texas immunologist and expert on Chikungunya. <em>&ldquo;If that person knew they had a needlestick and they were working with Chikungunya, they should have reported it immediately. And then whatever health care people saw them should have recognized that there was a very small &mdash; but not zero &mdash; risk of them transmitting the virus.&rdquo;</em></p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.03/thumbnail/622f125685f540518c15262e.jpg\" alt=\"FILE PHOTO. ©D-Keine / Getty Images\" />\n            <figcaption><a href=\"https://www.rt.com/news/551855-china-biolabs-international-inspectors/\">Beijing wants US to ‘open biolabs’ to international experts</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Chikungunya, which was first identified in Tanzania in the 1950s, is a debilitating and potentially deadly virus that can lead to chronic arthritis. In the local Makonde language, its name means <em>&ldquo;bent over in pain.&rdquo;</em> Outbreaks of the virus were reported in Italy and the US between 2007 and 2017.</p>\n<p>The Intercept investigation found a wide range of other biolab accidents over a period spanning 18 years. For instance, in 2018, a US Food and Drug Administration researcher in Maryland contracted MRSA after working with the antibiotic-resistant bacteria. The University of North Carolina reported five escapes of lab mice in 2013 and 2014. At least one of the rodents had been infected with SARS.</p>\n<p>The Washington University Chikungunya incident was among five needle injuries reported by the school, despite its lab being a Level 3 facility where researchers wear double layers of protective gear, including two pairs of gloves.</p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 18:30:40 +0000",
  "dc:creator": "RT"
}