{
  "title": "Should you take Grab or Gojek? Founders reveal how they scale their business",
  "link": "https://e27.co/should-you-take-grab-or-gojek-founders-reveal-how-they-scale-their-business-20221102/",
  "dc:creator": "Anisa Menur",
  "pubDate": "Wed, 02 Nov 2022 09:22:44 +0000",
  "category": [
    "e27",
    "Echelon",
    "Events",
    "10x Innovation Lab",
    "Fazz Financial Group",
    "NirogStreet",
    "PayFazz",
    "Wiz Holdings",
    "Zeek"
  ],
  "guid": "https://e27.co/?p=475495",
  "description": "<p>As two of the leading tech giants in Southeast Asia (SEA), Grab and Gojek took radically different approaches to growth. If Grab is known for rapidly launching in new markets in SEA with its platform, Gojek is known for its strong focus in Indonesia before it started entering neighbouring countries. But if you were a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/should-you-take-grab-or-gojek-founders-reveal-how-they-scale-their-business-20221102/\">Should you take Grab or Gojek? Founders reveal how they scale their business</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<div id=\"attachment_475496\" style=\"width: 700px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-475496\" loading=\"lazy\" class=\"size-full wp-image-475496\" src=\"https://e27.co/wp-content/uploads/2022/11/echelon_grab_gojek.000.jpg\" alt=\"\" width=\"690\" height=\"390\" /><p id=\"caption-attachment-475496\" class=\"wp-caption-text\">Left to right: Klaus Wehage (10x Innovation Lab), Vincent Fan (Zeek), Jennifer Zhang (Wiz Holdings), Ram N Kumar (Nirog Street), and Hendra Kwik (FAZZ Financial Group)</p></div>\n<p>As two of the leading tech giants in Southeast Asia (SEA), Grab and Gojek took radically different approaches to growth. If Grab is known for rapidly launching in new markets in SEA with its platform, Gojek is known for its strong focus in Indonesia before it started entering neighbouring countries.</p>\n<p>But if you were a startup founder looking to make it big in the region, which approach should you go for? How do you decide the most suitable one for your company? In a panel discussion on the first day of Echelon 2022 on October 27 at Resorts World Sentosa, four founders and CEOs shared their personal experiences.</p>\n<p>According to Ram N Kumar, CEO & Founder of Nirog Street, the first thing to remember is that there is no right or wrong in choosing either approach. Instead, it is all about deciding one&#8217;s end goal.</p>\n<p>&#8220;If you want speed and scale, you need to become Grab. But if you want market leadership, you need to become Gojek,&#8221; he stressed.</p>\n<p>Jennifer Zhang, Co-Founder and CEO of Wiz Holdings, said that founders should also consider the condition in the market they are operating in: Does it provide sufficient opportunities for growth? Taking the example of Finland and Singapore, she highlighted how international expansion is a sure way to go for companies in these markets.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/ex-gojek-vps-mobile-cafe-network-jago-nets-us2-2m-pre-series-a-20221027/\">Ex-Gojek VP’s mobile café network Jago nets US$2.2M pre-Series A</a></strong></p>\n<p>But for companies operating in markets with plenty of opportunities for growth, there is also an element of having a first-mover advantage in the Gojek approach.</p>\n<p>As a company from Hong Kong, Zeek also saw the need to expand to other markets early on, but they made a careful decision on the kind of services they introduced in a new market. Starting out as a last-mile delivery service platform, CEO & Co-Founder Vincent Fan explained how they eventually saw this new opportunity in the market they operated in.</p>\n<p>&#8220;We realised that last-mile fulfilment is not the only challenge our merchant is facing,&#8221; he said. &#8220;That was when we came up with a lot of our solutions. With our delivery services, we need to learn about local nuances, labour laws, competitors, delivery fees, and so forth. So our solutions business is easier to replicate across markets.&#8221;</p>\n<p>&#8220;At this point in time, we&#8217;re at a junction of focusing deeply on those markets that were already in with our delivery businesses. On the other hand, for our solutions business, [we are working on] which other markets that are quick to go into,&#8221; Fan continued. &#8220;For example, in Singapore, we have all the major instant on-demand delivery partners across the country. Are there partners that are capable of supporting us in other markets that we might want to explore? I think that&#8217;s the direction we are moving towards at this point.&#8221;</p>\n<h1>The matters of talents</h1>\n<p>Panel moderator Klaus Wehage, Co-Founder & CEO at 10x Innovation Lab, pointed out the importance of talents in a company&#8217;s international expansion move and the different types of talents that a company need for this process.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/this-app-from-gojeks-ex-cmo-notifies-you-about-the-quality-of-air-in-your-location-every-20-minutes-20201217/\">This app from gojek’s ex-CMO notifies you about the quality of air in your location every 20 minutes</a></strong></p>\n<p>For the panellists, there are different criteria that they are looking at. Companies in the early stage tend to prefer having a smaller representative, but for the later stages, having a larger team that is able to make decision of its own can be advantageous.</p>\n<p>Apart from talents, companies with a strong local presence can tap into their clients&#8217; international network to help them get started in new markets -something Zeek has already been doing.</p>\n<p>&#8220;[In] finding the right people with the right culture, we have [experienced] a lot of trial and error. A lot of failures, to be very honest. But I think we learn along the way. That&#8217;s where we find people you can work well alongside one another with a common goal of what you want to achieve,&#8221; said Fan.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/should-you-take-grab-or-gojek-founders-reveal-how-they-scale-their-business-20221102/\">Should you take Grab or Gojek? Founders reveal how they scale their business</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}