{
  "id": "yt:video:4YP19SkHN_E",
  "yt:videoId": "4YP19SkHN_E",
  "yt:channelId": "UCohJ129sdAX08pkeCyQL9Jw",
  "title": "FRENCH STORY - LA SURPRISE DE PÂQUES - THE EASTER SURPRISE",
  "link": "",
  "author": {
    "name": "Learn French With Frencheezi",
    "uri": "https://www.youtube.com/channel/UCohJ129sdAX08pkeCyQL9Jw"
  },
  "published": "2020-04-07T20:27:53+00:00",
  "updated": "2022-06-02T10:54:20+00:00",
  "media:group": {
    "media:title": "FRENCH STORY - LA SURPRISE DE PÂQUES - THE EASTER SURPRISE",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "// T R A N S C R I P T  &  T R A N S L A T I O N + vocab list\n▶️ https://bit.ly/theeastersurprise\n\nFrench story: La Surprise de Pâques (The Easter Surprise).\nThis story is mainly aimed at beginners as it's written in the present tense. That said, I'm sure you'll be able to get something from it even if you're a little more advanced, as it may include vocabulary you're not familiar with. Make sure to download the pdf so you can make best use of this video.\n\nClick on the link above to download the transcript and line by line translation so you can check your understanding and learn some of the vocabulary contained in the story. \n\n_\n\n// I T A L K I   P R O M O\n▶️ https://go.italki.com/frencheezi\n(this is an affiliate link)\n\n_\n\n// P A T R E O N\nSupport my work and get cool rewards!\n▶️ https://www.patreon.com/frencheezi\n\n_\n\n// W A T CH   N E X T\n\nFRENCH GHOST STORY\n▶️ https://youtu.be/8rfz1JPE7a4\n\nTOP 30 FRENCH PHRASES BEGINNER EDITION\n▶️ https://www.youtube.com/watch?v=V96wrSZFzCE\n\nTOP 30 FRENCH PHRASES INTERMEDIATE EDITION\n▶️ https://www.youtube.com/watch?v=8sXE54qMlyY\n\n\n_\n\n// F O L L O W   M E\n▶️ Facebook | http://www.facebook.com/pages/frencheezi\n▶️ Twitter | https://twitter.com/frencheezi\n▶️ Instagram | https://instagram.com/frencheezi\n\n_\n\n// A B O U T   M E\n\nBonjour ! I'm Cindy, a native French speaker. I moved to the UK in 2005,  am now bilingual in French and English, have a degree in modern languages (English and Spanish) and a passion for teaching French. I wish you good luck on your French learning journey, and if you ever have any doubts or questions regarding a particular aspect of the language, give me a shout! I'm always happy to help!  \n\n_\n\n// DISCLOSURE\n\nFrom time to time I use affiliate links in my videos. When this is the case, I always disclose it. Purchasing through an affiliate link will never affect you negatively and may even give you a discount not available to other customers. I will also get a small commission, helping me run this channel. Thank you for trusting me with my truthful opinion.\n\n_\n\nImage from: http:www.pixabay.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}