{
  "title": "Image-based Stability Quantification. (arXiv:2206.11443v2 [cs.CV] UPDATED)",
  "link": "http://arxiv.org/abs/2206.11443",
  "description": "<p>Quantitative evaluation of human stability using foot pressure/force\nmeasurement hardware and motion capture (mocap) technology is expensive, time\nconsuming, and restricted to the laboratory. We propose a novel image-based\nmethod to estimate three key components for stability computation: Center of\nMass (CoM), Base of Support (BoS), and Center of Pressure (CoP). Furthermore,\nwe quantitatively validate our image-based methods for computing two classic\nstability measures, CoMtoCoP and CoMtoBoS distances, against values generated\ndirectly from laboratory-based sensor output (ground truth) using a publicly\navailable, multi-modality (mocap, foot pressure, two-view videos), ten-subject\nhuman motion dataset. Using Leave One Subject Out (LOSO) cross-validation,\nexperimental results show: 1) our image-based CoM estimation method (CoMNet)\nconsistently outperforms state-of-the-art inertial sensor-based CoM estimation\ntechniques; 2) stability computed by our image-based method combined with\ninsole foot pressure sensor data produces consistent, strong, and statistically\nsignificant correlation with ground truth stability measures (CoMtoCoP r = 0.79\np &lt; 0.001, CoMtoBoS r = 0.75 p &lt; 0.001); 3) our fully image-based estimation of\nstability produces consistent, positive, and statistically significant\ncorrelation on the two stability metrics (CoMtoCoP r = 0.31 p &lt; 0.001, CoMtoBoS\nr = 0.22 p &lt; 0.043). Our study provides promising quantitative evidence for the\nfeasibility of image-based stability evaluation in natural environments.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Scott_J/0/1/0/all/0/1\">Jesse Scott</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Challis_J/0/1/0/all/0/1\">John Challis</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Collins_R/0/1/0/all/0/1\">Robert T. Collins</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liu_Y/0/1/0/all/0/1\">Yanxi Liu</a>"
}