{
  "title": "#432: Connecting Prisoner of Azkaban to Order of the Phoenix",
  "link": "https://audioboom.com/posts/7357494",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5707,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Happy Back to Hogwarts y'all!</li>\n<li>Enough already! Pottermore announces a new \"reimagined\" Sorting Hat is coming. Are we about to receive new House assignments?</li>\n<li>We've shipped MuggleCast tote bags to our first 150 patrons, with more going out in the weeks ahead!</li>\n<li>Andrew recaps Harry Potter Trivia Night at Wizards Unite Indianapolis, but he can't remember anything!</li>\n<li>Beautiful park, great community event, dragons, cool merchandise and more! Andrew shares his experience from Wizards Unite Fan Fest!</li>\n<li>Before beginning our chapter-by-chapter analysis of Order of the Phoenix, we connect the threads to Prisoner of Azkaban, since the Harry Potter series is a frame narrative (We recently did this with Sorcerer's Stone and Deathly Hallows on <a href=\"https://www.mugglecast.com/episode-427-connecting-sorcerers-stone-to-deathly-hallows/\">Episode 427</a>). </li>\n<li>The grim, dementors and what happens when Harry runs from the Dursleys</li>\n<li>Aunt Marge, Dudley and the first chapter magical impact on the Dursley family</li>\n<li>Character appearances and reappearances: Lupin, Sirius, Luna and more!</li>\n<li>Is it a coincidence Harry meets Lupin and Luna the same way?</li>\n<li>The contrasting teaching styles of Remus Lupin and Dolores Umbridge</li>\n<li>Hermione takes on Trelawney in Prisoner of Azkaban and Umbridge in Order of the Phoenix for their ineffective teaching methods</li>\n<li>Ministry Interference: comparing Fudge's actions towards Harry in Prisoner vs. Order</li>\n<li>Lucius Malfoy and his meddlesome nature: first Buckbeak then Harry's trial</li>\n<li>We take a look at a similarity between Hermione and Umbridge (Say what?!?)</li>\n<li>How Dementors and time turners play a critical role in both books</li>\n<li>Sirius Black is a prisoner in both books</li>\n<li>Dumbledore undermines the Ministry at the end of both books: the escape of Sirius and the return of Voldemort</li>\n<li>Quizzitch: What type of flower bed does Harry find himself laying in as Order of the Phoenix opens?</li>\n<li>Don't forget: We'll be at LeakyCon 2019 in Boston! <a href=\"https://www.leakycon.com/\">Register using</a> code MUGGLE to get $10 off!</li>\n<li>In addition to <a href=\"http://www.facebook.com/mugglecast\">Facebook</a>, <a href=\"http://www.twitter.com/mugglecast\">Twitter</a> and <a href=\"http://www.instagram.com/mugglecast\">Instagram</a>... We're now on <a href=\"http://www.linkedin.com/company/mugglecastpodcast\">LinkedIn</a>! </li>\n<li>\n<a href=\"https://www.patreon.com/mugglecast\">Become a member of our community</a> today on Patreon and receive awesome, magical benefits! </li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Mon, 02 Sep 2019 18:33:18 +0000",
  "guid": "tag:audioboom.com,2019-09-02:/posts/7357494",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}