{
  "title": "Wrapping Up COP26, with Michael Franczak",
  "description": "<p>I’m joined by historian Michael Franczak, Postdoctoral Fellow in Global Order at the University of Pennsylvania’s Perry World House, to recap the COP26 summit. Michael covered the first week of the conference for <em>Foreign Exchanges</em>, and if you missed his three dispatches please give them a read <a target=\"_blank\" href=\"https://fx.substack.com/p/climate-change-with-an-american-face\">here</a>, <a target=\"_blank\" href=\"https://fx.substack.com/p/get-in-line-or-get-out-of-the-way\">here</a>, and <a target=\"_blank\" href=\"https://fx.substack.com/p/the-failure-to-adapt\">here</a>. We discuss the history of the international environmental movement and the US role in it, Mike’s own experiences in Glasgow, and his assessment of what took place after he left—including a final agreement so watered down that the summit’s own president, Alok Sharma, actually <a target=\"_blank\" href=\"https://www.reuters.com/business/cop/deeply-sorry-uks-sharma-offers-apology-last-minute-changes-climate-deal-2021-11-13/\">apologized for it</a>. So I guess that means it was…really good?</p><p>Mike has a book coming out next June titled <em>Global Inequality and American Foreign Policy</em> in the 1970s, from Cornell University Press. It’s too soon for pre-orders but please keep an eye out for the book!</p><p>Our coverage of the summit was made possible by the support of FX subscribers. If you’ve appreciated that coverage please consider becoming a paid subscriber. Between this month’s special discount and <a target=\"_blank\" href=\"https://fx.substack.com/p/new-offer-20-off-your-first-year\">a couple of other perks</a> it’s never been a better time to subscribe.</p> <br/><br/>This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit <a href=\"https://fx.substack.com/subscribe?utm_medium=podcast&utm_campaign=CTA_2\">fx.substack.com/subscribe</a>",
  "link": "https://fx.substack.com/p/wrapping-up-cop26-with-michael-franczak",
  "guid": "substack:post:44187299",
  "dc:creator": "Derek Davison",
  "pubDate": "Wed, 17 Nov 2021 19:27:00 GMT",
  "enclosure": "",
  "itunes:author": "Derek Davison",
  "itunes:explicit": "No",
  "itunes:duration": 4869,
  "itunes:image": ""
}