{
  "title": "Episode 75: Science Proves Subliminal Tapes Work! Well....not really",
  "pubDate": "Tue, 21 Oct 2008 16:56:00 +0000",
  "guid": "episode-75-science-proves-subliminal-tapes-work",
  "link": "http://www.thepsychfiles.com/2008/10/21/episode-75-science-proves-subliminal-tapes-work-wellnot-really/",
  "itunes:image": "",
  "description": "Do subliminal messages in self-help tapes really work?  There actually is some evidence that people can be influenced by subliminal messages.  Can your self-esteem be raised with subliminal tapes?  Can subliminal persuasion help you lose weight?  Are there even subliminal messages in Disney files?? Are there subliminal messages in advertising that can make you buy certain products?  These questions answered once and for all at The Psych Files podcast.",
  "content:encoded": "Do subliminal messages in self-help tapes really work?  There actually is some evidence that people can be influenced by subliminal messages.  Can your self-esteem be raised with subliminal tapes?  Can subliminal persuasion help you lose weight?  Are there even subliminal messages in Disney files?? Are there subliminal messages in advertising that can make you buy certain products?  These questions answered once and for all at The Psych Files podcast.",
  "enclosure": "",
  "itunes:duration": "26:25",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Do Subliminal Self-Help tapes really work! Well, there actually is some evidence to suggest that people can be influenced by subliminal information. Can your self-esteem be raised with subliminal tapes?",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Do subliminal messages in self-help tapes really work? There actually is some evidence that people can be influenced by subliminal messages. Can your self-esteem be raised with subliminal tapes? Can subliminal persuasion help you lose weight? Are there even subliminal messages in Disney files?? Are there subliminal messages in advertising that can make you buy certain products? These questions answered once and for all at The Psych Files podcast."
}