{
  "id": "https://bibleinoneyear.org/en/youth/215",
  "title": "Day 215: Working Without Wilting",
  "description": "Psalm 90:14-15a,17, 1 Chronicles 15:1–2,16, 16:8–11, Romans 16:1–5a,6–7,9,12–13,20b–21,23,25a,27.  Work has an intrinsic value  The Bible has a lot to say on the subject of our work",
  "pubDate": "Tue, 03 Aug 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/215/?ignore",
  "itunes:duration": "13:52",
  "guid": "enyouth03082021-215",
  "length": 832.08,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 215: Working Without Wilting",
  "itunes:subtitle": "Psalm 90:14-15a,17, 1 Chronicles 15:1–2,16, 16:8–11, Romans 16:1–5a,6–7,9,12–13,20b–21,23,25a,27.  Work has an intrinsic value  The Bible has a lot to say on the subject of our work",
  "itunes:summary": "The average person will spend approximately 150,000 hours at work in their lifetime – that is to say, about 40% of our waking lives are spent at work, whether it be paid or voluntary employment, or as a carer or full-time parent.\n‘Is God interested in our work? Many people do not see God as a 24/7 God, but as a withdrawn actor confined to a Sunday show with a declining audience. There is a widespread view that God and work simply don’t mix: the competitive, cut-throat demands of the working world are seen as the obvious enemy of Christian compassion and love. But the God who created and sustains the world is also the God of the workplace. If the Christian faith is not relevant in the workplace, it is not relevant at all,’ writes Ken Costa, in his book God at Work (see also godatwork.org.uk). For over forty years, Ken has been living out his faith on the frontline of Christian ministry – in the ‘secular’ workplace in the City of London. And he sees that as his primary calling as a Christian.\nWhatever kind of work you are called to, it will probably occupy a large proportion of your life. Work is an important part of God’s ‘economy’. It is part of what you were created to do, and will be part of what you do in heaven. Work has an intrinsic value. The Bible has a lot to say on the subject of our work.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 215
}