{
  "id": "yt:video:aNzTUdOHm9A",
  "yt:videoId": "aNzTUdOHm9A",
  "yt:channelId": "UCMm211NGh4Ls5SAMZJF7E8A",
  "title": "SM64 - TTC Upwarp $1000 Bounty",
  "link": "",
  "author": {
    "name": "pannenkoek2012",
    "uri": "https://www.youtube.com/channel/UCMm211NGh4Ls5SAMZJF7E8A"
  },
  "published": "2015-08-04T23:07:17+00:00",
  "updated": "2022-05-19T15:21:14+00:00",
  "media:group": {
    "media:title": "SM64 - TTC Upwarp $1000 Bounty",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Update: Due to people using hacked savestates to fraudulently recreate the upwarp, all submissions going forward must be an m64 file that begins from game start.\n\nRecently, a video by twitch user DOTA_TeaBag was brought to my attention, in which he did an upwarp in Tick Tock Clock. I believe this is a new, unexplored glitch, but unfortunately I have been unsuccessful at recreating it myself. Thus, I'm putting a bounty of $1000 on the glitch. In other words, the first person to recreate the glitch and send it to me will earn $1000 from me.\n\nThe submission should be a .m64 from game start. The bounty will hold until the first person successfully submits a recreation of the glitch, at which point I will add the word [CLAIMED] to the end of this video's title, and then no one else will be eligible for the prize.\n\nHelpful downloads (a savestate in the TTC room on the Japanese version and an MHS file showing the ceiling currently above Mario):\nhttps://drive.google.com/file/d/0B3JCRPC09lDtR0N2RzVzWlNZQVU/view?usp=sharing\n\nDOTA_TeaBag's highlight of the glitch:\nhttps://www.youtube.com/watch?v=bhBf5crp0i8\n\nFull VOD of DOTA_TeaBag that day:\nhttps://www.youtube.com/watch?v=TTh3LY-5KKg\n\nThe song I used at the end was a Benny Hill Techno Remix Demo made by Dj Freshwinter, which you can find here:\nhttps://youtu.be/fesYUkG4Kyg\n\nAdditional Notes:\n(1) Some people are wondering why the spinners are rotating instead of being still. You must enter Tick Tock Clock when the long hand is at 12 for the objects in the course to be still.\n(2) I've been told others have reuploaded this video. Basically, the bounty is awarded to the first person to submit a valid recreation of the glitch. If you submit your entry to someone else and they send it to me, then that person will earn the bounty. I'm not responsible for tracking down the original creator of the .m64; I award whoever sends it in, as is said in the rules. So don't submit to someone else.\n(3) Your submission should be a .m64 file that Mupen64 can play. Anything else (such as .avi, .rec) is not valid. So don't use Project64 or Bizhawk.\n(4) I've heard of and thought of every theory in the book. Maybe it was the bob-omb, the bob-omb's explosion, the bob-omb's coin, when Mario hits the corner, when Mario presses the wall, when Mario hits his head on the spinner, when Mario touches the other corner, when Mario lands at the edge, being under certain ceilings, etc. Telling me you believe one of these is the cause is not very helpful. I'm looking for hard evidence.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}