{
  "guid": "urn:uuid:38d62f77-050f-47ed-a7a3-7c0fb23147bf",
  "link": "https://www.who.int/news/item/30-03-2022-who-releases-10-year-strategy-for-genomic-surveillance-of-pathogens",
  "a10:author": {
    "a10:name": ""
  },
  "title": "WHO releases 10-year strategy for genomic surveillance of pathogens",
  "description": "<p>WHO is releasing a strategy to strengthen and scale up genomic surveillance around the world.</p><p>Historically, few countries have routinely done genomic surveillance in-country, a technology considered complicated and expensive. But COVID-19 changed that.\n</p><p>Genomic surveillance is the process of constantly monitoring pathogens and analyzing their genetic similarities and differences. It helps researchers, epidemiologists and public health officials to monitor the evolution of infectious diseases agents,\n    alert on the spread of pathogens, and develop counter measures like vaccines.</p><p>The<em> <a target=\"_blank\" href=\"https://www.who.int/publications-detail-redirect/9789240046979\">Global genomic surveillance strategy for pathogens with pandemic and epidemic potential 2022&ndash;2032</a> </em>is\n not specific to a single pathogen or disease threat. It provides a high-level unifying framework to leverage existing capacities, address barriers and strengthen the use of genomic surveillance worldwide.\n</p><p>Data collected by WHO show that in March 2021, 54% of countries had this capacity. By January 2022, thanks to the major investments made during the COVID-19 pandemic, the number had increased to 68%. Even greater gains were made in the public sharing\n    of sequence data: in January 2022, 43% more countries published their sequence data compared to a year before. </p><p>Despite this fast progress, much remains to be done. Any new technology comes with the risk of increasing inequity, which is one of the gaps this strategy targets.</p><p>Various public health programmes &ndash; from Ebola to cholera &ndash; use genomic surveillance to understand a pathogen at its molecular level, but COVID-19 has highlighted the challenges of bringing genomics to scale. </p><div data-class=\"blockquote-container\"><p><strong>The complexities of genomics and the challenges of sustaining capacities in different settings, including workforce needs, means that most countries cannot develop these capabilities on their own. The global strategy helps keep our eyes on the horizon\n        and provides a unifying framework for action. WHO looks forward to working with countries and partners in this important and highly dynamic field.</strong></p><h5>&nbsp; &nbsp;&nbsp; - Dr&nbsp;Tedros Adhanom Ghebreyesus<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; WHO Director-General</h5></div><p>&ldquo;The complexities of genomics and the challenges of sustaining capacities in different settings, including workforce needs, means that most countries cannot develop these capabilities on their own. The global strategy helps keep our eyes on the\n    horizon and provides a unifying framework for action. WHO looks forward to working with countries and partners in this important and highly dynamic field,&rdquo; said Dr&nbsp;Tedros Adhanom Ghebreyesus, WHO Director-General. &ldquo;We will do best\n    if we work together.&rdquo;</p><p>The COVID-19 pandemic has shown that health systems need genomic surveillance so that risks are rapidly detected and addressed. This technology has been critical in this response, from the identification of a novel coronavirus, to the development of the\n    first diagnostic tests and vaccines, to the tracking and identification of new virus variants. </p><p>&ldquo;Genomic surveillance is critical for stronger pandemic and epidemic preparedness and response,&rdquo; said Dr Michael Ryan, Executive Director, WHO Health Emergencies Programme. &ldquo;This pandemic has laid bare the fact that we live in an interconnected\n    world and that we are only as strong as our weakest link. Improving global disease surveillance means improving local disease surveillance. That is where we need to act, and this strategy will provide us with the foundation.&rdquo;\n</p><p>Read more about the strategy <a href=\"https://www.who.int/initiatives/genomic-surveillance-strategy\" data-mce-href=\"http://www.who.int/initiatives/genomic-surveillance-strategy\" target=\"_blank\">here</a>. </p><p>&nbsp;</p>",
  "pubDate": "Wed, 30 Mar 2022 09:33:50 Z"
}