{
  "title": "Australia live news update: Daniel Andrews asks ‘what is the point’ of News Corp story revisiting his fall; boy’s body found in Canberra",
  "link": "https://www.theguardian.com/environment/live/2022/nov/06/australia-live-news-update-nsw-flood-water-emergency-warnings-floods-canberra-missing-boy-cop27-tony-burke-ir-politics-covid-cases-omicron",
  "description": "<p>Also, communities in NSW remain on high alert as authorities warn of flood waters moving downstream. Follow all the day’s news</p><ul><li>Get our <a href=\"https://www.theguardian.com/australia-news/2022/oct/29/email-newsletters-guardian-australia-best-daily-news-emails-newsletter-free-sign-up-inbox-subscribe-headlines?CMP=cvau_sfl\">morning and afternoon news emails</a>, <a href=\"https://www.theguardian.com/technology/ng-interactive/2018/may/15/the-guardian-app?CMP=cvau_sfl\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p><strong>Chaney ‘not convinced’ IR changes will ‘drive an increase in wages’</strong></p><p>On the proposed industrial relations changes, Chaney says she supports the proposal where it will lift wages in low-paid sectors of the economy but is wary of introducing “another layer of complexity” into workplaces and is not convinced multi-employer bargaining will actually lift wages.</p><p>I’m completely supportive of the fact that we need to increase wages and increase share of wages to GDP. I think the expansion – the multi-employer bargaining for the supported stream is a good thing, [in] those low-paid industries, and that may well get wages moving.</p><p>[It will benefit] childcare, aged care, largely feminised industries, and that seems to make a lot of sense. I’m concerned about the overreach and this extension of multi-employer bargaining to any group that are deemed to have a common interest, as determined by the Fair Work Commission. I think it’s great for IR specialists and lawyers.</p><p>I can understand the government’s desire to keep its promises, but when you look at where we are, really there is nothing to take the place of the revenue lost in those tax cuts, so it needs to be part of a broader review of how are we going to pay for the things we need.</p><p>I reckon they should be delayed, pending a broader review of the tax system and it may be that a result that have could be trimming them at the top, or it could be looking at different sources of revenue that mean we can rely less on personal income tax as we see our population age.</p> <a href=\"https://www.theguardian.com/environment/live/2022/nov/06/australia-live-news-update-nsw-flood-water-emergency-warnings-floods-canberra-missing-boy-cop27-tony-burke-ir-politics-covid-cases-omicron\">Continue reading...</a>",
  "category": [
    "Australia news",
    "Flooding",
    "Australian politics",
    "Climate crisis",
    "Extreme weather"
  ],
  "pubDate": "Sun, 06 Nov 2022 00:49:40 GMT",
  "guid": "https://www.theguardian.com/environment/live/2022/nov/06/australia-live-news-update-nsw-flood-water-emergency-warnings-floods-canberra-missing-boy-cop27-tony-burke-ir-politics-covid-cases-omicron",
  "media:content": [
    {
      "media:credit": "Photograph: Brendon Thorne/AAP"
    },
    {
      "media:credit": "Photograph: Brendon Thorne/AAP"
    }
  ],
  "dc:creator": "Royce Kurmelovs",
  "dc:date": "2022-11-06T00:49:40Z"
}