{
  "id": "yt:video:w0USdlRVgVY",
  "yt:videoId": "w0USdlRVgVY",
  "yt:channelId": "UCkLHy_jxeaHTZCfGalg6QaA",
  "title": "How to Best Ensure ADA Compliance for Your Property’s Website",
  "link": "",
  "author": {
    "name": "Conn Maciel Carey LLP",
    "uri": "https://www.youtube.com/channel/UCkLHy_jxeaHTZCfGalg6QaA"
  },
  "published": "2022-09-23T17:03:38+00:00",
  "updated": "2022-09-25T09:39:00+00:00",
  "media:group": {
    "media:title": "How to Best Ensure ADA Compliance for Your Property’s Website",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Another year has gone by, and yet the lawsuits filed against hotels and other places of public accommodation alleging violations of the Americans with Disabilities Act (“ADA”) continues to increase. We still see hundreds of lawsuits filed each month against hotels for their failure to identify and describe accessible features at their properties in sufficient detail on their websites. Many of these lawsuits continue to allege that Online Travel Agencies (“OTAs”) such Expedia, Hotels.com, or Orbitz fail to provide information about the accessible amenities of the hotel, including its rooms, to individuals with disabilities, or fail to allow an individual with a disability to book an accessible guestroom. While it may seem counterintuitive that a Hotel would be responsible for the information provided on the OTAs website, that often is the case.\n\nA ton of ADA lawsuits also continue to be filed every day alleging that hotel websites cannot be used by individuals with visual or hearing impairments (in particular websites that utilize PDFs). Thus, it is extremely important that businesses ensure the accessibility of their websites while also providing an appropriate “accessibility statement” explaining to users the steps you have taken to improve your website’s accessibility.\n\nDuring this webinar participants learned about:\n\n• What accessible features to list on your website to reduce your legal exposure\n• What questions to ask OTAs to ensure that they are not creating liability for your property\n• Best practices for ensuring that your website is accessible\n• Tips for drafting an appropriate website accessibility statement\n• How to decrease your overall legal exposure\n\nA webinar from Conn Maciel Carey LLP.\n\nUse of this video does not in any manner constitute or establish an attorney-client relationship between Conn Maciel Carey and the viewer. This video may be deemed \"attorney advertising\" in jurisdictions from which it is accessed. The decision to hire a lawyer is a serious one and should be undertaken after consideration of all relevant information, not only information on this video.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}