{
  "id": "yt:video:eR2tI7Irfdo",
  "yt:videoId": "eR2tI7Irfdo",
  "yt:channelId": "UCqnbDFdCpuN8CMEg0VuEBqA",
  "title": "This Pro-Life Pastor's Sermon on Abortion Deserves a Larger Audience  | NYT Opinion",
  "link": "",
  "author": {
    "name": "The New York Times",
    "uri": "https://www.youtube.com/channel/UCqnbDFdCpuN8CMEg0VuEBqA"
  },
  "published": "2022-10-26T17:00:25+00:00",
  "updated": "2022-10-29T19:32:48+00:00",
  "media:group": {
    "media:title": "This Pro-Life Pastor's Sermon on Abortion Deserves a Larger Audience  | NYT Opinion",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "In the debate over abortion, it often seems there’s not much room for nuance: You’re either for it or against it.\n\nBut in the Opinion video above, the Rev. Clinton L. Stancil, the pastor of Wayman A.M.E. Church in St. Louis, articulates a position that is heard all too rarely, particularly among faith leaders.\n\nHe is opposed to abortion on moral grounds and counsels his parishioners against getting the procedure. But he is also vehemently supportive of a woman’s right to choose. In an interview with Opinion Video, he called the Supreme Court decision that eliminated the constitutional right to abortion “a tragedy.”\n\nMr. Stancil, 60, who was a sales executive for IBM before entering the ministry, anchors his pro-choice position in Scripture. But he is also deeply concerned that the new restrictions on abortion access will disproportionately harm Black communities, spurring poverty and crime. (Black women have a far higher abortion rate than white women, according to the Centers for Disease Control and Prevention.)\n\nMr. Stancil, who is active on civil rights issues in St. Louis and has discussed the abortion debate in his sermons this year, offered to deliver his guest essay in the form of a sermon. We recorded it as a postscript to a Sunday service this month.\n\nAs it has for many houses of worship in the United States, attendance at Wayman A.M.E. still hasn’t rebounded to prepandemic levels. So Mr. Stancil, a kinetic preacher whose partly improvised sermons often run half an hour or more, finds himself these days speaking to a congregation that is mostly tuning in via the church’s live streams. We thought his message deserved a wider audience.\n&#13;\nSubscribe: http://bit.ly/U8Ys7n&#13;\nMore from The New York Times Video:  http://nytimes.com/video&#13;\n----------&#13;\nWhether it's reporting on conflicts abroad and political divisions at home, or covering the latest style trends and scientific developments, New York Times video journalists provide a revealing and unforgettable view of the world. It's all the news that's fit to watch.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}