{
  "id": "tag:blogger.com,1999:blog-1176949257541686127.post-906768766717947517",
  "published": "2022-04-27T12:01:00.000-04:00",
  "updated": "2022-04-27T12:01:06.684-04:00",
  "title": "How we fought bad apps and developers in 2021",
  "content": "<span class=\"byline-author\">Posted by Steve Kafka and Khawaja Shams, Android Security and Privacy Team</span> <p>Providing a safe experience to billions of users continues to be one of the <a href=\"https://android-developers.googleblog.com/2022/03/privacy-and-security-direction.html\">highest priorities</a> for Google Play. Last year we introduced multiple privacy focused features, enhanced our protections against bad apps and developers, and improved <a href=\"https://en.wikipedia.org/wiki/Software_development_kit\">SDK</a> data safety. In addition, Google Play Protect continues to scan billions of installed apps each day across billions of devices to keep people safe from malware and unwanted software.  </p><p>  </p><p>We continue to enhance our machine learning systems and review processes, and in 2021 we blocked 1.2 million policy violating apps from being published on Google Play, preventing billions of harmful installations. We also continued in our efforts to combat malicious and spammy developers, banning 190k bad accounts in 2021. In addition, we have closed around 500k developer accounts that are inactive or abandoned. </p><p>In May we <a href=\"https://android-developers.googleblog.com/2021/05/new-safety-section-in-google-play-will.html\">announced</a> our new Data safety section for Google Play where developers will be required to give users deeper insight into the privacy and security practices of the apps they download, and provide transparency into the data the app may collect and why. The Data safety section <a href=\"https://blog.google/products/google-play/data-safety/\">launched</a> this week, and developers are required to complete this section for their apps by July 20th.  </p><p>We’ve also invested in making life easier for our developers. We added the <a href=\"https://play.google.com/console/about/policystatus/\">Policy and Programs</a> section to Google Play Console to help developers manage all their app compliance issues in one central location. This includes the ability to appeal a decision and <a href=\"https://support.google.com/googleplay/android-developer/answer/9842754?hl=en\">track its status</a> from this page. </p><p>In addition, we continued to partner with SDK developers to improve app safety, limit how user data is shared, and <a href=\"https://support.google.com/googleplay/android-developer/answer/10358880\">improve lines of communication with app developers</a>. SDKs provide functionality for app developers, but it can sometimes be tricky to know when an SDK is safe to use. Last year, we engaged with SDK developers to build a safer Android and Google Play ecosystem. As a result of this work, SDK developers have improved the safety of SDKs used by hundreds of thousands of apps impacting billions of users. This remains a huge investment area for our team, and we will continue in our efforts to make SDKs safer across the ecosystem.  </p><p><strong>Limiting access</strong></p><p>The best way to ensure users' data stays safe is to limit access to it in the first place.  </p><p>As a result of new platform protections and <a href=\"https://support.google.com/googleplay/android-developer/answer/10467955\">policies</a>, developer collaboration and education, 98% of apps migrating to Android 11 or higher have reduced their access to sensitive APIs and user data. We've also significantly reduced the unnecessary, dangerous, or disallowed use of <a href=\"https://support.google.com/googleplay/android-developer/answer/10964491?hl=en#:~:text=Google%20Play%20permits%20the%20use,that%20they%20are%20accessibility%20tools.\">Accessibility APIs</a> in apps migrating to Android 12, while preserving the functionality of legitimate use cases. </p><p>We also continued in our commitment to make Android a great place for families. Last year we disallowed the collection of Advertising ID (AAID) and other device identifiers from all users in apps solely targeting children, and gave all users the ability to delete their Advertising ID entirely, regardless of the app.  </p><p><strong>Pixel enhancements</strong></p><p>For Pixel users, we had even more great features to help keep you safe. Our new <a href=\"https://security.googleblog.com/2021/10/pixel-6-setting-new-standard-for-mobile.html\">Security hub</a> helps protect your phone, apps, Google Account, and passwords by giving you a central view of your device’s current configuration. Security hub also provides recommendations to improve your security, helping you decide what settings best meet your needs.  </p><p>In addition, Pixels now use new machine learning models that improve the detection of malware in Google Play Protect. The detection runs on your Pixel, and uses a privacy preserving technology called federated analytics to discover bad apps. </p><p>Our global teams are dedicated to keeping our billions of users safe, and look forward to many exciting announcements in 2022. </p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google",
    "uri": "http://www.blogger.com/profile/11822708545141062574",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}