{
  "title": "A Positive Trade Agenda",
  "description": " \n\n<p>In the space of just a few years, the public discourse on trade has undergone a significant shift. Where trade was once commonly agreed upon as a net benefit to the U.S. economy and the global good, it is now used as a scapegoat across the political spectrum for systemic issues. As we approach the 75th anniversary of the Bretton Woods Conference, deep questions are emerging about the post-War economy it reconstructed, the multilateral system it created, and the liberal values it codified. The international trading system and its norms have unleashed an unprecedented wave of globalization but how the world understands free and open trade and its value is undergoing a generational shift. Join the Scholl Chair in International Business and CSIS to launch a major initiative to investigate and reshape the conversation on trade for the 21st century.</p>\n\n\n<p><i>Introductory Remarks by:</i><br />\nF​rederick W. Smith<br />\nChairman and CEO of FedEx Corp.</p>\n\n<p><i>Keynote Address by:</i><br />\nHenry M. Paulson<br />\n​Secretary of the Treasury (2006-2009)<br />\nChairman of the Paulson Institute</p>\n\n\n\n<p><b>Envisioning a World of \"Three Zeroes\": Zero Tariffs, Zero Subsidies, and Zero Non-tariff Barriers to Trade</b><br />\n<i>Moderated by Scott Miller</i></p>\n<b>Daniel J. Ikenson</b><br />\n<i>Director, Herbert A. Stiefel Center for Trade Policy Studies</i><br />\n<br />\n<b>Ambassador Susan C. Schwab</b><br />\n<i>Former United States Trade Representative (2005-2009)</i><br />\n \n<p><b>Out With the Old, In With the New: Developing New International Frameworks or Reforming the Old?</b><br />\n<i>Moderated by Matthew P. Goodman</i></p>\n<b>Catherine A. Novelli</b> <br />\n<i>President, Listening for America</i><br />\n<br />\n<b>Dr. Derek M. Scissors</b><br />\n<i>Resident Scholar, AEI</i><br />\n \n<p><b>Meeting the China Challenge: Engagement or Decoupling?</b><br />\n<i>Moderated by Dr. Scott Kennedy</i></p>\n<b>Dr. David Dollar</b><br />\n<i>Senior Fellow, John L. Thorton China Center, The Brookings Institution</i><br />\n<br />\n<b>Ambassador Jorge Guajardo</b><br />\n<i>Ambassador of Mexico to the People's Republic of China (2007-2013) </i><br />\n<br />\n<i>This event is made possible through general support to CSIS.</i> ",
  "itunes:author": "John J. Hamre, William Alan Reinsch, Matthew P. Goodman, Scott Miller, Scott Kennedy",
  "pubDate": "Wed, 27 Feb 2019 09:30:00 -0500",
  "enclosure": "",
  "itunes:duration": "1:08:28",
  "guid": "https://csis-website-prod.s3.amazonaws.com/s3fs-public/field_soundcloud_audio/A%20Positive%20Trade%20Agenda%20Part%204%20-%20Meeting%20the%20China%20Challenge.mp3"
}