{
  "title": "Conformalized survival analysis with adaptive cutoffs. (arXiv:2211.01227v2 [stat.ME] UPDATED)",
  "link": "http://arxiv.org/abs/2211.01227",
  "description": "<p>This paper introduces a method that constructs valid and efficient lower\npredictive bounds (LPBs) for survival times with censored data. Traditional\nmethods for survival analysis often assume a parametric model for the\ndistribution of survival time as a function of the measured covariates, or\nassume that this conditional distribution is captured well with a\nnon-parametric method such as random forests; however, these methods may lead\nto undercoverage if their assumptions are not satisfied. In this paper, we\nbuild on recent work by Cand\\`es et al. (2021), which offers a more\nassumption-lean approach to the problem. Their approach first subsets the data\nto discard any data points with early censoring times and then uses a\nreweighting technique (namely, weighted conformal inference (Tibshirani et al.,\n2019)) to correct for the distribution shift introduced by this subsetting\nprocedure. For our new method, instead of constraining to a fixed threshold for\nthe censoring time when subsetting the data, we allow for a covariate-dependent\nand data-adaptive subsetting step, which is better able to capture the\nheterogeneity of the censoring mechanism. As a result, our method can lead to\nLPBs that are less conservative and give more accurate information. We show\nthat in the Type I right-censoring setting, if either of the censoring\nmechanism or the conditional quantile of survival time is well estimated, our\nproposed procedure achieves approximately exact marginal coverage, where in the\nlatter case we additionally have approximate conditional coverage. We evaluate\nthe validity and efficiency of our proposed algorithm in numerical experiments,\nillustrating its advantage when compared with other competing methods. Finally,\nour method is applied to a real dataset to generate LPBs for users' active\ntimes on a mobile app.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/stat/1/au:+Gui_Y/0/1/0/all/0/1\">Yu Gui</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Hore_R/0/1/0/all/0/1\">Rohan Hore</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Ren_Z/0/1/0/all/0/1\">Zhimei Ren</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Barber_R/0/1/0/all/0/1\">Rina Foygel Barber</a>"
}