{
  "id": "https://bibleinoneyear.org/en/youth/12",
  "title": "Day 12: No Fear",
  "description": "Proverbs 1:33, Genesis 26:24, Matthew 10:1,16–31. The expression ‘*do not be afraid*’ is one of the most frequent commands in the Bible  Four of the occurrences are in our passages for today",
  "pubDate": "Wed, 12 Jan 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/12/",
  "itunes:duration": "11:58",
  "guid": "enyouth12012022-12",
  "length": 718.08,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 12: No Fear",
  "itunes:subtitle": "Proverbs 1:33, Genesis 26:24, Matthew 10:1,16–31. The expression ‘*do not be afraid*’ is one of the most frequent commands in the Bible  Four of the occurrences are in our passages for today",
  "itunes:summary": "At one level, fear is healthy. ‘Fear’ is an emotion induced by a perceived threat. It is a natural human emotion. It is God-given. It is a basic survival mechanism. It keeps us alive. It protects us from danger.\nHowever, there is also such a thing as unhealthy fear. The Greek word commonly used in the New Testament is phobos – from which we get the word ‘phobia’. This is unhealthy fear. It is disproportionate to the danger posed. It is ‘False Evidence Appearing Real’. It is when I catastrophise – overestimating the danger and underestimating my ability to cope.\nCommon phobias include fears in relation to health, finances, failure, growing old, death, loneliness, rejection, messing up, public speaking, flying, heights, snakes and spiders. They also include things such as, what is now called, FOMO – the Fear Of Missing Out, the fear of not being special.\nIn my own life, I have experienced many fears – from a fear of heights to panic attacks and other irrational fears, fears about preaching and a fear of doing anything that might bring dishonour to the name of Jesus.\nWhereas the Spirit of God does not produce negative fear, there is a kind of healthy fear – the fear of God. This does not mean being frightened of God. In fact, it means the opposite. It is an understanding of who God is in relation to us. It means respect, reverence, awe, honour, adoration and worship; it could even be translated as love for God. It recognises the power, majesty and holiness of God Almighty. It leads to a healthy respect of God and is the antidote to all other fears and phobias we experience in life. Fear God and you need not fear anything else or anyone else.\nIt is no coincidence that as the fear of God has decreased in our society, all the other fears have increased. We need to return to a right relationship with God.\nThe expression ‘do not be afraid’ is one of the most frequent commands in the Bible. Four of the occurrences are in our passages for today.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 377
}