{
  "title": "A New Conflict-Resolution Model to Advance DEI",
  "link": "https://sloanreview.mit.edu/article/a-new-conflict-resolution-model-to-advance-dei/",
  "comments": "https://sloanreview.mit.edu/article/a-new-conflict-resolution-model-to-advance-dei/#respond",
  "pubDate": "Wed, 26 Oct 2022 11:00:06 +0000",
  "dc:creator": "Peter T. Coleman, Allegra Chen-Carrel, and Bodi M. Regan. <p>Peter T. Coleman (<a href=\"https://twitter.com/PeterTColeman1\">@petertcoleman1</a>) is a professor of psychology and education at Columbia University, where he is director of the Morton Deutsch International Center for Cooperation and Conflict Resolution (MD-ICCCR) and executive director of the Earth Institute’s Advanced Consortium on Cooperation, Conflict, and Complexity (AC4). He identifies as a straight, White, American-born male. His latest book is <cite><a href=\"https://www.thewayoutofpolarization.com/\">The Way Out: How to Overcome Toxic Polarization</a></cite> (Columbia University Press, 2021). Allegra Chen-Carrel is an assistant professor at the University of San Francisco and is on the leadership team of the MD-ICCCR&#8217;s DEIA consulting group. She identifies as biracial Asian and White. Bodi M. Regan is a faculty member in the Negotiation and Conflict Resolution Program in Columbia’s School of Professional Studies and at the MD-ICCCR. He is also a founding partner of the MD-ICCCR DEIA Consulting Group, and is a White and Irish-Italian with more than 25 years of experience as a mediator, facilitator and workshop leader.</p>\n",
  "category": [
    "Change Management",
    "Conflict Resolution",
    "Diversity",
    "Culture",
    "Diversity & Inclusion",
    "Workplace, Teams, & Culture"
  ],
  "description": "Dan Bejar/theispot.com Racism, misogyny, classism, xenophobia — when these chronic problems afflict organizations, they stem from a constellation of forces, not a single attitude, act, or outdated norm. As a result of that complexity, solutions can be elusive, and we often see intransigence even in places explicitly committed to change. Take, for example, our home [&#8230;]",
  "content:encoded": "<p></p>\n<figure class=\"article-inline\">\n<img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/10/WINTER23-COLEMAN-1290x860-1.jpg\" alt=\"\" /><figcaption>\n<p class=\"attribution\">Dan Bejar/theispot.com</p>\n</figcaption></figure>\n<p>Racism, misogyny, classism, xenophobia — when these chronic problems afflict organizations, they stem from a constellation of forces, not a single attitude, act, or outdated norm. As a result of that complexity, solutions can be elusive, and we often see intransigence even in places explicitly committed to change.</p>\n<p>Take, for example, our home institution of Columbia University, which invested more than $200 million over two decades to enhance diversity and inclusion among its faculty. Given that level of commitment and the school’s progressive values, the administration was quite stunned when a self-study revealed a stubbornly slow pace of change and an environment where “women and minority professors … navigate numerous inequities … in a workplace that isn’t conducive to their success.”<a id=\"reflink1\" class=\"reflink\" href=\"#ref1\">1</a> Persistent grievances included harassment of women faculty members, fear of retaliation for reporting incidents of harassment and discrimination, cronyism, and a cryptic and biased tenure and promotion system. In addition, women and members of underrepresented groups said that they were tasked with an unfair share of committee work and other “invisible labor” and that their contributions were undervalued. Though well intended, the school’s efforts clearly hadn’t addressed the root issues.</p>\n<p></p>\n<p>This problem certainly isn’t unique to academic settings. Organizations large and small with mostly homogenous leadership teams, across sectors and industries, struggle to make headway with diversity, equity, and inclusion (DEI) initiatives. Research shows that dozens of factors interact to create change-resistant institutional cultures, which further complicate matters.<a id=\"reflink2\" class=\"reflink\" href=\"#ref2\">2</a> At the individual level, for instance, factors such as implicit biases, stereotyping, ethnocentrism, and homophily (our attraction to people who are similar to us) can work together to shape our perceptions and behaviors. Between groups, selective perception of bias-confirming information about outgroups can elicit hostile responses (from both “us” and “them”), resulting in self-fulfilling prophecies.<a id=\"reflink3\" class=\"reflink\" href=\"#ref3\">3</a> And those experiences, in turn, can lead to more competitive and destructive intergroup interactions — one of the many vicious cycles at play.</p>\n<p>Within organizations where leadership is essentially monocultural, conflicts over individual and group differences are often suppressed, and leaders may be blind to the dominant power structures and stereotyping that exacerbate those differences.<a id=\"reflink4\" class=\"reflink\" href=\"#ref4\">4</a> Even so, whenever people must compete for scarce resources and rewards (attention from senior leaders, project support, plum assignments, promotions, office space, and so on), the conflicts persist, bubbling under the surface if unacknowledged — and Columbia was certainly not immune to this.<a id=\"reflink5\" class=\"reflink\" href=\"#ref5\">5</a> Of course, many marginalized groups have experienced long periods of institutionalized discrimination and injustice at the hands of dominant groups, fueling distrust and anger. Those in power, meanwhile, insulated by their privilege, might fail to recognize and respond to those concerns and feelings.<a id=\"reflink6\" class=\"reflink\" href=\"#ref6\">6</a></p>\n<p>That’s just a sampling of destructive relational dynamics in workplaces. And studies suggest that they have staying power: When the various individual, intergroup, and organizational factors fuel and reinforce one another, the cultural patterns that result are robust, particularly resistant to change, and largely unresponsive to the typical interventions.<a id=\"reflink7\" class=\"reflink\" href=\"#ref7\">7</a></p>\n<p>Indeed, research shows that workshops, training, and other one-and-done events fail to go deep enough to address the attitudes, incentives, and norms that perpetuate these systemic patterns.<a id=\"reflink8\" class=\"reflink\" href=\"#ref8\">8</a> Sometimes they even make problems worse, escalating tensions by increasing awareness of injustice without offering a path toward resolution, or simply raising defenses and rallying resistance to change. But many organizations don’t know what the alternative to training is, so they keep at it, spinning their wheels, knowing they have to do something.</p>\n<p>There is a better way.</p>\n<h3>A Blended Approach</h3>\n<p>In our research and work with organizations, we study the complex dynamics that make conflicts flare and persist, and we identify paths to positive change. We spent much of the past decade exploring how to create better conditions for sustained DEI reform — and how to dismantle systemic bias — by leveraging and managing the inherent conflicts more effectively. We’ve found that conflict resolution, which typically attempts to reduce tension over differences (and is the approach favored in organizations with homogenous leadership teams), is at times insufficient, because it applies a superficial bandage to deep wounds that need to be reckoned with more thoroughly. While advocacy for social justice goes deeper in seeking to increase awareness of wrongs against members of marginalized groups within organizations, it can also create problems: Tensions can escalate with no relief, and activists can lose sight of the shared goals and concerns of all involved. An approach that blends conflict-resolution tactics with a social justice mindset — one that optimally manages tensions between groups — is needed to support constructive, genuine change.</p>\n<div class=\"callout-highlight callout--expand\">\n<aside class=\"l-content-wrap\">\n<article>\n<h4>Five Modes of Action</h4>\n<p class=\"caption\">These actions and tactics borrowed from complexity-science approaches to organizational development can help increase effectiveness of your diversity, equity, and inclusion (DEI) efforts.</p>\n<table id=\"Chart#\" class=\"chart-grouped-rows no-mobile\" style=\"width: 100%\">\n<thead>\n<tr>\n<th style=\"line-height:1.5;vertical-align:bottom;width:20%\"> Capitalize on Shocks </th>\n<th style=\"line-height:1.5;vertical-align:bottom;width:20%\"> Map the Landscape </th>\n<th style=\"line-height:1.5;vertical-align:bottom;width:20%\"> Deconstruct Destructive Dynamics </th>\n<th style=\"line-height:1.5;vertical-align:bottom;width:20%\"> Bolster Constructive Efforts </th>\n<th style=\"line-height:1.5;vertical-align:bottom;width:20%\"> Persist and Adapt </th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>\n<p><span class=\"blue\">&bull;</span> What major changes, conflicts, or crises can you leverage to unfreeze the organization’s DEI efforts?</p>\n<p><span class=\"blue\">&bull;</span> What societal forces can you draw on?</p>\n</td>\n<td>\n<p><span class=\"blue\">&bull;</span> How do members of different groups feel about their work climate and interactions?</p>\n<p><span class=\"blue\">&bull;</span> What troubling patterns or unique opportunities do you see?</p>\n</td>\n<td>\n<p><span class=\"blue\">&bull;</span> How can you block, mitigate, or break down negative attitudes and behaviors between groups?</p>\n<p><span class=\"blue\">&bull;</span> How can you manage tensions to pave the way for sustainable change?</p>\n</td>\n<td>\n<p><span class=\"blue\">&bull;</span> Where has your organization made DEI inroads?</p>\n<p><span class=\"blue\">&bull;</span> What strengths can you channel to build on that progress?</p>\n</td>\n<td>\n<p><span class=\"blue\">&bull;</span> How will you track progress and promote accountability?</p>\n<p><span class=\"blue\">&bull;</span> How will you report back to leaders to keep their attention focused on the DEI agenda?</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p><!--IMAGE FALLBACK FOR MOBILE BELOW --></p>\n<p>\t\t<img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/10/MAG-Coleman-Table.png\" alt=\"Five Modes of Action\" class=\"no-desktop\" /><br />\n\t</article>\n</aside>\n</div>\n<p></p>\n<p>Organizations can choose from menus of tactics for tapping and reducing conflict. For instance, acts of civil disobedience (such as the walkouts at Netflix over content that employees viewed as transphobic) can facilitate conversations about difficult topics like microaggressions and systemic bias, or analyses of counterproductive power dynamics can be used to underscore tension and highlight the need for reform. Mediation, information sharing, collaborative task force work, or discussions about shared experiences or values can be used to tamp down tension, making it easier to establish common goals and embrace change. Choosing tactics effectively often involves weighing contextual factors — for instance, what are the main sources of conflict, and how responsive has leadership been in addressing voiced concerns? — to decide what the situation calls for. Different tactics can be employed by different actors in an organization; for example, ombudsmen, HR leaders, managers, employees, and union organizers may play separate roles. Or the same actors can apply various tactics.</p>\n<p>For those reasons, managing conflict in pursuit of organizational change is an art. But there’s also some science to it. By applying theoretical models that cast organizations as complex, dynamic systems to better comprehend culturally institutionalized forms of discrimination, we’ve come to understand this: While it may be possible for DEI policies or programs alone to affect the current state of intergroup relations, lasting change requires altering the underlying enduring patterns, known as attractors in systems thinking.<a id=\"reflink9\" class=\"reflink\" href=\"#ref9\">9</a> Like strong habits, routines, and cultural norms, these attractors emerge from complex combinations of factors, repeatedly draw us in, and resist change. They are the social-psychological ruts we get trapped in.<a id=\"reflink10\" class=\"reflink\" href=\"#ref10\">10</a></p>\n<p>We’ve developed a framework for breaking out of these traps. It utilizes tension, conflict resolution, and bottom-up activism to break through cultural inertia and facilitate constructive and sustained forms of organizational DEI.<a id=\"reflink11\" class=\"reflink\" href=\"#ref11\">11</a> We’ve applied it over the past few years at the Earth Institute, a 900-person multidisciplinary research and education center at Columbia promoting global sustainability, to help reform the culture.</p>\n<p>We think our experience there could serve as a blueprint for other organizations interested in becoming more inclusive, equitable employers. Here, we explain what steps they can take, describe how and why we took them in our work with the institute, and share some of the changes we saw as a result.</p>\n<p></p>\n<p><strong>Capitalize on shocks to the system.</strong> Breaking ingrained cultural patterns — such as the dominance of White males among Earth Institute leaders and faculty members despite attempts to recruit a more diverse workforce — often requires leveraging conflict, tension, crises, and pressure for effect.<a id=\"reflink12\" class=\"reflink\" href=\"#ref12\">12</a> Sometimes dramatic events like scandals, walkouts, lawsuits, or mergers send difficult but useful destabilizing shocks through an organization, and leaders can take advantage of moments like these to drive organizational change.</p>\n<p></p>\n<p>At the institute, a combination of events created such an opportunity. First was the arrival of what Connie Gersick, a visiting management scholar at Yale University, calls a newcomer; such leaders are “more than three times more likely to initiate frame-breaking change than existing executive teams.”<a id=\"reflink13\" class=\"reflink\" href=\"#ref13\">13</a> Alex Halliday came on as director of the Earth Institute in 2018, after a stint as dean of science and engineering at Oxford University, where he had worked resolutely on increasing gender diversity in the geosciences. Upon his arrival, he immediately began speaking out about the need to diversify the institute’s leadership.</p>\n<p>A few weeks later, when racist emails were received by students at one of the institute’s 19 units, Halliday prioritized that push for DEI and asked us to assist. He ordered a systematic review of the demographics on hiring and promotion at the Earth Institute for the previous decade and began working with our team to develop a comprehensive strategy for reform.</p>\n<p>In addition to the internal destabilizing events — the new leader, the racist emails — societal forces also played an important role. Protests over the murder of George Floyd by Minneapolis police ignited across the country in 2020, which further increased the sense of urgency of this work and deepened conversations about race. Halliday explicitly encouraged and participated in those conversations, and he became evermore committed to correcting the gender and racial deficits he saw as pervasive. His ethos and energy reverberated throughout the organization.</p>\n<p>The message here is to look for opportunities for change during times of crisis or instability in the organization or in the world. For instance, rather than avoiding discussion of injustices that grab the headlines and resorting to business as usual after such acts are reported in the news, leaders can use them as cues to start new conversations and mobilize meaningful reform within their own institutions. Of course, such leaders must be willing and able to work with deep sources of tension. Addressing long legacies of discrimination is always emotionally messy, politically fraught, and likely to trigger backlash from members of the dominant group. The remaining steps in our framework can help leaders navigate and manage these reactions effectively.</p>\n<p><strong>Map the DEI landscape.</strong> Once leaders have seized on an opening for change, it is critical to survey the status of intergroup relations in the organization. That involves gathering information on the experiences of members of different groups — their highs and lows, opportunities and grievances, successes and setbacks. In all of the workplaces we’ve studied, such data collection (through conversations, surveys, and archival research) has shed light on the specific elements driving both constructive and destructive patterns in distinct pockets of the organization. The Earth Institute was no different.</p>\n<p>To gain a comprehensive view, organizations must learn about what is going well <em>and</em> what isn’t. Research has shown that the drivers of positive versus negative intergroup relations are often not mirror opposites of one another but, rather, qualitatively different factors.<a id=\"reflink14\" class=\"reflink\" href=\"#ref14\">14</a> For example, one study showed that positive attitudes about Black people led to positive acts more often than a lack of negative attitudes did. And negative attitudes led to negative acts more often than a lack of positive attitudes did. So it’s important to measure a full range of attitudes and experiences to understand and predict behaviors toward historically marginalized and underrepresented groups.</p>\n<p>At the Earth Institute, we cocreated an assessment with the DEI steering committee and used it to survey faculty, staff members, and students. We measured for empirically derived indicators of healthy work climates (such as psychological safety and respect) and dysfunctional environments (including lack of fairness or accountability) and gathered information about how members of different demographic groups experienced the organization. For instance, we asked how safe they felt being themselves and whether promotions seemed within reach. We also dug deeply into hiring practices and approaches used to resolve internal conflicts among management and the staff.</p>\n<p>The result was a nuanced account of each unit within the institute. As expected, we saw troubling patterns in some places, like a sense of isolation among employees who identify as BIPOC (Black, Indigenous, or people of color) in certain units, disengagement of some senior White males from DEI activities, resentment at being asked to participate, and widespread frustration with leaders’ lack of urgency to remedy long-standing structural inequities. But we also identified efforts that were making a positive difference, such as the affinity groups that had been convened in one unit, and a more comprehensive approach to reform taken at another. Institute leaders and members are generally very responsive to data, so sharing our findings helped further open people’s minds to change.</p>\n<p>We compiled the results into one high-level report and several unit-level reports that were fed back to each unit, shining a light on the intergroup tensions. The unit directors then recruited small, diverse teams of DEI champions (including White and BIPOC employees, men and women, and senior and junior folks) to review the findings and begin planning how to tackle challenges and bolster initiatives that were already proving useful.<a id=\"reflink15\" class=\"reflink\" href=\"#ref15\">15</a> The chosen champions had strong levels of support and influence within the organization, since they would be tasked with recruiting coworkers to participate in these efforts. In selecting champions and deciding whom else to include in these groups, it was critical to remember that DEI adds extra work that can be emotionally taxing, and this work is often put on the plates of those who belong to underrepresented groups. Such work must be valued, recognized, and compensated as in-role labor, and other responsibilities must be balanced accordingly — a recommendation that was emphasized in the reports.</p>\n<p>After sharing the findings, we offered coaching and workshops when requested to address tensions head-on. (This type of support works best when it’s not prescribed or imposed.<a id=\"reflink16\" class=\"reflink\" href=\"#ref16\">16</a>) For example, we conducted a workshop on how to lead difficult conversations about race at work, and we provided coaching sessions for managers on how to address deep-seated misogynist and White supremacist attitudes held by a few of their senior employees. Such training sessions can have a powerful impact when they are offered in response to the immediate needs and concerns of managers and employees.</p>\n<p><strong>Deconstruct destructive dynamics.</strong> Sustained institutional reform requires shutting down problematic psychological and behavioral patterns (those attractors, or ruts, we mentioned earlier) and bolstering positive deviance (those programs and policies already working).<a id=\"reflink17\" class=\"reflink\" href=\"#ref17\">17</a> Because bad experiences tend to have a stronger impact than good ones, we took every indication of problems seriously — like reports of bias and ethnocentrism, intergroup competition, and exclusionary practices within the units — and delved into those areas before examining positive dynamics.<a id=\"reflink18\" class=\"reflink\" href=\"#ref18\">18</a></p>\n<p></p>\n<p>For example, more than half of the BIPOC members of the community reported feeling isolated and stressed and said that key people at the institute often didn’t turn up for diversity events like bias training and town hall meetings. Those same respondents said that the onus of promoting DEI had mostly fallen on members of underrepresented groups, and such efforts lacked coordination. “There were not really any frameworks or any structures for DEI on a large scale. There were a lot of one-off events, but not a lot of continuous traction,” said Kailani Acosta, a Ph.D. student. Acosta had organized opportunities for dialogue to uplift diverse voices at the Earth Institute and had helped create a seminar on race, climate change, and environmental justice before our work began.</p>\n<p>After digesting the feedback from surveys, the champion groups got to work in their respective units. This allowed individuals like Acosta, who had struggled to generate interest in the programs she’d organized, to channel their energies toward achieving unit-relevant goals and measurable outcomes. Rather than applying a top-down, one-size-fits-all approach to reform, each unit took charge of creating and implementing its own agenda, with support from the top. This helped get people on board. Some of the dozens of activities deployed to mitigate exclusionary dynamics included integrating DEI criteria (like providing BIPOC employees with equitable opportunities for development) into managers’ performance appraisals, establishing a bridge program to mentor and support members of historically underrepresented groups, and rethinking the methods of some major research projects to reduce their unintended negative consequences on the communities under study.</p>\n<p>These change efforts were not always met with complete enthusiasm, of course. Some busy scientists saw them as distractions from their primary work. Their resistance sparked difficult conversations that needed facilitation, both during staff meetings and in mediated one-on-one discussions.</p>\n<p><strong>Bolster constructive DEI efforts.</strong> Our analysis also identified strengths to build on in each unit. We learned, for example, that the staff members of most units (other than leadership) were perceived to be very diverse and that people generally felt respected by their supervisors. They mostly felt psychologically safe to interact with candor, saw equal opportunities for promotion and advancement for most positions, liked their colleagues personally, and reported a high level of job satisfaction. These were areas that <em>didn’t</em> require conflict resolution — positive dynamics that could be channeled to further the organization’s DEI work. Given the Earth Institute’s standing as a model in the sustainability field, respondents also saw the organization as uniquely positioned to take on student pipeline issues that have historically prevented hiring from underrepresented groups, particularly in climate science roles.</p>\n<p>As DEI conversations across the institute continued, we supplied the champion teams with a template and other tools to help them develop their action plans.<a id=\"reflink19\" class=\"reflink\" href=\"#ref19\">19</a> We encouraged them to begin with what was already advancing DEI in their units. These teams eventually came together across the institute — at a meeting we facilitated — to present their draft plans and receive feedback from one another and senior leadership. (This can happen only in an environment where it’s safe to speak truth to power.) The Earth Institute also asked its DEI steering committee to draft an overarching action plan that would stitch those smaller plans together. </p>\n<p>With our help, committee members identified actions to bolster positive efforts across the organization and then followed through. For instance, they clarified processes for navigating the existing (albeit complicated) systems for raising and addressing grievances, joining search committees, and calling for town hall gatherings.</p>\n<p></p>\n<p><strong>Persist and adapt.</strong> Ultimately, the idea was to create staying power through accountability. The DEI steering committee reported to Halliday, the institute’s director, and that direct line was a pivotal component of effective change.<a id=\"reflink20\" class=\"reflink\" href=\"#ref20\">20</a> The overarching plan consisted of 24 proposed actions nested under six priorities: establishing responsibility for DEI throughout the organization, linking funding to DEI commitments, prioritizing DEI in hiring and promotion, enhancing DEI programming, integrating DEI into all aspects of research, and providing mentoring and networking opportunities to BIPOC employees to mitigate social isolation. Each of the units’ own plans were similarly structured: They briefly spelled out who was responsible for achieving each goal, when it would happen, and how. Actions included establishing a DEI office and director to oversee, support, and organize continuing efforts; convening a faculty-student committee to work in partnership with that office; and, critically, tracking progress on the newly established DEI goals.</p>\n<p></p>\n<p>Throughout the process, we continued to facilitate communication within the teams and units and, in some cases, brokered some of the more difficult conversations over race and gender that flared up. That was important, because well-laid plans can fall apart if tensions are simply buried or escalated (hence the blending of conflict-resolution tactics and a social justice mindset in our framework). Unit and institute leaders had to learn to maintain a climate of cooperation, candor, inclusivity, and justice. Some were understandably concerned about their skills in shepherding the necessary conversations. And in a hierarchical organization like Columbia, poor communication can heighten anxiety for those who aren’t in a position of power; it can make people feel threatened or invisible. We offered workshops on difficult conversations so that leaders would have a safe space to share questions, replay scenarios, and build skills.</p>\n<p>But diversity and inclusion efforts are never “accomplished.” Without continuous attention (and tension) and adaptation, there’s a high risk of reverting to old patterns and undoing progress. Therefore, monitoring and providing feedback on the effects of the action plans will be an essential part of the new director of DEI’s work. That is why the Earth Institute explicitly agreed to keep sharing the findings from its ongoing data collection in a timely and transparent manner: Making the inevitable setbacks and lags in implementation apparent will serve as an ongoing source of accountability and pressure for reform.</p>\n<p>Lasting change also depends on distributing responsibility between those working in the trenches — who have a nuanced understanding of the pain, problems, and more promising remedies — and those with the organizational power to fund and execute programs. That shared stewardship amounts to shared power. It gives everyone a voice and a stake in sustained systemic change.</p>\n<p></p>\n",
  "wfw:commentRss": "https://sloanreview.mit.edu/article/a-new-conflict-resolution-model-to-advance-dei/feed/",
  "slash:comments": 0
}