{
  "title": "Episode 100: Reflections on 100 Episodes of The Psych Files",
  "pubDate": "Mon, 20 Jul 2009 00:41:44 +0000",
  "guid": "episode-100-reflections-on-100-episodes-of-the-ps",
  "link": "http://www.thepsychfiles.com/2009/07/episode-100-reflections-on-100-episodes-of-the-psych-files/",
  "itunes:image": "",
  "description": "Well, it's here - episode 100.  I take this time to reflect on which episodes have made the most impact on the podcast and the episodes and listeners that have taught me the most.  Also, I provide a little background on how the podcast is produced, along with what programs and equipment are used.  Thank you to everyone who has emailed me over the years to provide feedback and thanks to everyone else for being listeners and contributing to the success of The Psych Files!",
  "content:encoded": "Well, it's here - episode 100.  I take this time to reflect on which episodes have made the most impact on the podcast and the episodes and listeners that have taught me the most.  Also, I provide a little background on how the podcast is produced, along with what programs and equipment are used.  Thank you to everyone who has emailed me over the years to provide feedback and thanks to everyone else for being listeners and contributing to the success of The Psych Files!",
  "enclosure": "",
  "itunes:duration": "49:02",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology,lecture",
  "itunes:subtitle": "Well, it's here - episode 100.  I reflect on which episodes have made the most impact on the podcast and the episodes and listeners that have taught me the most. Thank you to everyone who has contributed to the success of The Psych Files!  ",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Well, it's here - episode 100. I take this time to reflect on which episodes have made the most impact on the podcast and the episodes and listeners that have taught me the most. Also, I provide a little background on how the podcast is produced, along with what programs and equipment are used. Thank you to everyone who has emailed me over the years to provide feedback and thanks to everyone else for being listeners and contributing to the success of The Psych Files!"
}