{
  "itunes:episode": 31,
  "title": "Me Eat Pretty Some Day with Matthew Amster-Burton",
  "link": "http://newdisrupt.org/blog/2013/7/10/me-eat-pretty-some-day",
  "description": "<p><a href=\"http://www.rootsandgrubs.com/\">Matthew Amster-Burton</a> is a food writer and host of the podcast <a href=\"http://www.spilledmilkpodcast.com/\">Spilled Milk</a>. Matthew has a particular affinity for Japanese food, and that led to a trip to that country he'd promised to his daughter, Iris, who stars in his book <a href=\"http://www.isbn.nu/9780547336893\"><em>Hungry Monkey</em></a>. Their trip led to a second visit to Japan with Matthew's wife and Iris's mom Laurie, and to a second book, <em><a href=\"http://www.rootsandgrubs.com/books/pretty-good-number-one/\">Pretty Good Number One</a></em>, about eating in Tokyo. He talks about the perils of publishing with a large firm and on his own, and how he's navigated the maze of electronic book production.</p>\n<p>Matthew on Twitter: <a href=\"https://twitter.com/mamster/\">@mamster</a></p>\n\n\n\n",
  "pubDate": "Wed, 10 Jul 2013 10:32:46 -0700",
  "enclosure": "",
  "itunes:image": "",
  "itunes:duration": "1:05:33",
  "guid": "tag:soundcloud,2010:tracks/103194383",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:subtitle": "Matthew Amster-Burton is a food writer and host of the podcast Spilled Milk. Matthew has a particular affinity for Japanese food, and that led to a trip to that country ...",
  "itunes:summary": "Matthew Amster-Burton is a food writer and host of the podcast Spilled Milk. Matthew has a particular affinity for Japanese food, and that led to a trip to that country he'd promised to his daughter, Iris, who stars in his book Hungry Monkey. Their trip led to a second visit to Japan with Matthew's wife and Iris's mom Laurie, and to a second book, Pretty Good Number One, about eating in Tokyo. He talks about the perils of publishing with a large firm and on his own, and how he's navigated the maze of electronic book production.\nMatthew on Twitter: @mamster"
}