{
  "id": "yt:video:Ao02ABtK1vc",
  "yt:videoId": "Ao02ABtK1vc",
  "yt:channelId": "UCbmNph6atAoGfqLoCL_duAg",
  "title": "Sean Carroll | The Biggest Ideas in the Universe: Space, Time and Motion | Talks at Google",
  "link": "",
  "author": {
    "name": "Talks at Google",
    "uri": "https://www.youtube.com/channel/UCbmNph6atAoGfqLoCL_duAg"
  },
  "published": "2022-11-04T16:00:09+00:00",
  "updated": "2022-11-04T16:00:10+00:00",
  "media:group": {
    "media:title": "Sean Carroll | The Biggest Ideas in the Universe: Space, Time and Motion | Talks at Google",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Renowned theoretical physicist Sean Carroll joins us to discuss his new book \"The Biggest Ideas in The Universe: Time, Space and Motion\" where he offers a deep dive into physics that pulls back the veil of mystery from most complex ideas in the field.\n\nIn his view, the foundational ideas of classical physics (from Newton to Einstein) is as worthy of our gaze as the Mona Lisa and he is committed to making these ideas accessible to all, which is why this is just the first in a three-book series that will tackle everything from Space, Time, and Motion (century-old ideas that are still relevant in modern research); Quanta and Fields (the fundamental laws of nature); and Complexity and Emergence (the full complexity of the world and where that research will take us). The series was inspired by his wildly popular YouTube series of the same name, a pandemic project that has accumulated over four million views from fans hungry to expand their minds amid lockdowns and hear Sean explain the most mind-boggling concepts in an entertaining, uniquely lucid way. This first book explores, among many topics, how space and time come together to form spacetime, why calculus is still fundamental to everything we understand about the universe and what escapes from black holes and why.\n\nGet the book here: https://goo.gle/3Cjt2D2.\n\nSean Carroll is Homewood Professor of Natural Philosophy at Johns Hopkins University and Fractal Faculty at the Santa Fe Institute. He received his Ph.D. from Harvard University.  His research focuses on the foundations of physics, including issues in quantum mechanics, spacetime, cosmology, and emergence. He is the author of several books, including New York Times bestseller Something Deeply Hidden. He has been awarded prizes and fellowships by the National Science Foundation, NASA, the Sloan Foundation, the Packard Foundation, the American Physical Society, the American Institute of Physics, the Royal Society of London, the Guggenheim Foundation, and the American Association for the Advancement of Science. Sean also hosts the weekly podcast Mindscape.\n\nModerated by Quentin Capista.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}