{
  "title": "Zippedi keeps store shelves stocked with the help of Google Cloud",
  "link": "https://cloud.google.com/blog/topics/startups/how-zippedi-automates-inventory-management-with-google-cloud/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>These days, many stores can’t keep their shelves stocked with the basic items people need at an affordable price. Although the retail industry has always struggled to manage inventory efficiently, the COVID-19 pandemic has created supply chain disruptions and staffing shortages that make it even more difficult for stores to meet customer expectations.</p><p>That’s why we built<a href=\"https://www.home.zippedi.com/\" target=\"_blank\">Zippedi</a>. With the Zippedi AI inventory robot and mobile app, any store can scan its shelves and efficiently identify, replace, and reorganize products that are running low or out of stock. Zippedi automatically creates and delivers detailed inventory reports to store managers—and alerts employees when items, price tags, and signs need to be restocked or updated.</p></div></div><div class=\"block-image_full_width\"><div class=\"article-module h-c-page\"><div class=\"h-c-grid\"><figure class=\"article-image--large h-c-grid__col h-c-grid__col--6 h-c-grid__col--offset-3 \"><img alt=\"1 Zippedi.jpg\" src=\"https://storage.googleapis.com/gweb-cloudblog-publish/images/1_Zippedi.0771063915291201.max-1000x1000.jpg\"/><figcaption class=\"article-image__caption \"><div class=\"rich-text\"><i> Zippedi team members</i></div></figcaption></figure></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Building an automated inventory management platform</h3><p>Zippedi began its journey in 2018 as an engineering project at the Pontificia Universidad Católica de Chile. Although we were determined to create an automated inventory management platform, we knew we couldn’t effectively scale or accelerate time to market without a reliable technology partner. Zippedi is a company that develops high-tech software and hardware solutions. Scaling a startup is not trivial with too many flanks to address. On-premises or self-hosted/managed resources for software development &amp; deployment would've meant to create further dependencies on hardware, not only for clients (by building robots) but also datacenters to process all the incoming data robots are gathering worldwide. </p><p>We looked at the options and identified<a href=\"https://cloud.google.com/gcp?utm_source=google&amp;utm_medium=cpc&amp;utm_campaign=na-US-all-en-dr-bkws-all-all-trial-e-dr-1011347&amp;utm_content=text-ad-none-any-DEV_c-CRE_491349594127-ADGP_Desk%20%7C%20BKWS%20-%20EXA%20%7C%20Txt%20~%20Google%20Cloud%20Platform%20Core-KWID_43700060017921803-kwd-6458750523&amp;utm_term=KW_google%20cloud-ST_google%20cloud&amp;gclid=Cj0KCQjwgYSTBhDKARIsAB8Kukv-HP_avMypBus4evGUPySVjvPIWfgsjisR0stadHuFKwggfdpPhAcaAknMEALw_wcB&amp;gclsrc=aw.ds\">Google Cloud</a>, including the<a href=\"https://inthecloud.withgoogle.com/startup/dl-cd.html?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=FY21-Q1-global-demandgen-website-cs-startup_program_mc&amp;utm_content=google-cloud-blog-post&amp;utm_term=-\" target=\"_blank\">Google for Startups Cloud Program</a>, as the best choice to help us reduce IT management costs, affordably expand our technology stack, and allocate more resources to R&amp;D. In just a year, we migrated on-premises IT infrastructure to Google Cloud, built a fully functioning AI robot, coded an easy-to-use mobile app, and tripled the size of our team.</p><p>We now leverage the<a href=\"https://cloud.google.com/security\">secure-by-design infrastructure</a> of Google Cloud to rapidly process and analyze millions of shelf scans for stores around the world with an incredibly high level of precision. Specifically, we rely on<a href=\"https://cloud.google.com/vertex-ai\">Vertex AI</a> to quickly build, deploy, and scale the advanced machine learning (ML) models that classify products, identify items running low or out of stock, and spot outdated price tags and signs.</p><p>We use<a href=\"https://cloud.google.com/compute\">Compute Engine</a> to run Zippedi’s online prediction and inference engine on scalable virtual machines that lower computing costs. These cost savings enable us to shift more of our budget to R&amp;D and rapidly develop new solutions and services for our customers. We’re also seeing significant cost savings with<a href=\"https://cloud.google.com/bigquery\">BigQuery</a>, which gives us a 26% to 34% lower three-year TCO than cloud data warehouse alternatives.</p><p>We use additional Google Cloud solutions to power Zippedi. We automate database provisioning and storage capacity management with<a href=\"https://cloud.google.com/sql\">Cloud SQL</a>, run large analytical and operational workloads on<a href=\"https://cloud.google.com/bigtable\">Cloud Bigtable</a>, develop and deploy highly scalable containerized applications on<a href=\"https://cloud.google.com/run\">Cloud Run</a>, and author, schedule, and monitor pipelines across multiple clouds with<a href=\"https://cloud.google.com/composer\">Cloud Composer</a>. Lastly, we develop and introduce new features for our Zippedi mobile app on<a href=\"https://cloud.google.com/appengine\">App Engine</a>.</p><h3>Scaling Zippedi with the Google for Startups Cloud Program</h3><p>Building, scaling, and deploying a market-ready automated inventory management platform in just a year would not have been possible without the incredible support of the Google for Startups Cloud Program.</p><p>For example, the dedicated Startups Success Team made sure that our customized microservices and ML models seamlessly migrated to Google Cloud. We also used Google Cloud credits to affordably trial different<a href=\"https://cloud.google.com/products/ai\">AI and machine learning products</a> and Google Cloud databases. We continue to tap the deep technical knowledge of the Google Cloud team and technical experts to further optimize our automated inventory management platform with additional Google Cloud solutions. These could potentially include MLOps pipelines through <a href=\"https://cloud.google.com/vertex-ai\">Vertex AI</a>,<a href=\"https://cloud.google.com/tpu\">Cloud TPUs</a>, and<a href=\"https://cloud.google.com/looker\">Looker</a>. </p><p>Since 2020, the retail industry has struggled to keep store shelves stocked with the basic items people need at an affordable price. With Zippedi, stores are successfully mitigating supply chain disruptions and lowering costs by efficiently identifying, replacing, and reorganizing products that are running low or out of stock.</p><p>Today, many stores around the world rely on Zippedi to stabilize consumer prices by streamlining inventory management, increasing employee efficiency, and lowering operating costs. Our customers are seeing impressive results as they eliminate pricing errors by 90%, improve on-shelf availability by over 10%, and bolster in-store sales by up to 5%.</p><p>As we expand our team, we look forward to launching Zippedi in new markets and empowering retailers to overcome the delivery delays and staffing shortages caused by the COVID-19 pandemic. We will introduce new features and services to help the retail industry mitigate supply chain disruptions and make it easier and more affordable for people to buy the basic items they need to thrive.</p></div></div><div class=\"block-image_full_width\"><div class=\"article-module h-c-page\"><div class=\"h-c-grid\"><figure class=\"article-image--large h-c-grid__col h-c-grid__col--6 h-c-grid__col--offset-3 \"><img alt=\"2 Zippedi.jpg\" src=\"https://storage.googleapis.com/gweb-cloudblog-publish/images/2_Zippedi.max-1000x1000.jpg\"/></figure></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p><i>If you want to learn more about how Google Cloud can help your startup, visit our page<a href=\"https://inthecloud.withgoogle.com/startup/dl-cd.html?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=FY21-Q1-global-demandgen-website-cs-startup_program_mc&amp;utm_content=google-cloud-blog-post&amp;utm_term=-\" target=\"_blank\">here</a> to get more information about our program, and <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSfowlgaSsVDQojZ1JDDhRMfZ5TAFY6do4UPZXqkuToX63K2dQ/viewform\" target=\"_blank\">sign up for our communications</a> to get a look at our community activities, digital events, special offers, and more.</i></p></div></div></body></html>",
  "pubDate": "Fri, 04 Nov 2022 16:00:00 -0000",
  "guid": "https://cloud.google.com/blog/topics/startups/how-zippedi-automates-inventory-management-with-google-cloud/",
  "category": [
    "Customers",
    "Startups"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Zippedi keeps store shelves stocked with the help of Google Cloud",
    "description": "Learn how Zippedi automates inventory management, increases employee efficiency, and lowers operating costs.",
    "image": "https://storage.googleapis.com/gweb-cloudblog-publish/images/Zippedi.max-600x600.jpg",
    "site_name": "Google",
    "url": "https://cloud.google.com/blog/topics/startups/how-zippedi-automates-inventory-management-with-google-cloud/"
  },
  "author": [
    {
      "name": "Luis Vera",
      "title": "CEO, Zippedi",
      "department": "",
      "company": ""
    },
    {
      "name": "Rodrigo Adolfo Gonzalez",
      "title": "VP Software & Cloud, Zippedi",
      "department": "",
      "company": ""
    }
  ]
}