{
  "title": "Early Modern London, Wages, and the Industrial Revolution with Judy Stephenson",
  "pubDate": "Fri, 23 Dec 2016 20:20:59 +0000",
  "guid": "a3b0cbc3423879cf6b3126db92d207b6",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP40Stephenson_EDR.mp3",
  "itunes:image": "",
  "description": "<p>What follows is an edited transcript of my conversation with Judy Stephenson.</p> <hr /> <p><strong>Petersen:</strong> You're listening to Economics Detective Radio. My guest today is Judy Stephenson of Oxford University's Wadham college. Judy, welcome to Economics Detective Radio.</p> <p><strong>Stephenson:</strong> Thank you very much. It's nice to be here.</p> <p><strong>Petersen:</strong> So, our topic for today is economic history. Specifically we’ll be looking at some interesting research Judy has done on wage rates in the early modern period in London. This period is particularly interesting because it's the start of the Industrial Revolution which leads to a dramatic increase in the growth living standards and of technology and that trend of course is what has shaped our modern world and made it different from the world of the past. So, it's very important of course to understand this period if we want to understand the world as it is now. So Judy, start by giving us historical background. What was the world like in the period you study?</p> <p><strong>Stephenson:</strong> Well, I work mostly on researching London, so urban environments. And London is very developed in this period between about 1600 and 1800. And London becomes the biggest city in the world during this period and as the biggest city in the world it's hugely vibrant, some of the largest merchant houses in the world are there, banking is advanced and developing. Most of the occupations of London are tertiary or service sector, even at this early date.</p> <p>The river is a huge source of both transportation and work, the port is where much of the capital, both physical and financial, from around the world comes through the city, and the professions and bureaucracy are well established in London in this period. It's growing at all levels of society, from the very poorest to the very richest exponentially. So, if you look at the population growth overall in the U.K. in the late 17th century from 1500-1600 to 1700, that actually is pretty much stable or slightly declining. But the population of London grows by a third or something in that period.</p> <p>London is this hugely vibrant commercial social and cultural center and it's pretty much overtaken Amsterdam, which has come to the end of its golden age in the mid 17th century, right at this period. So, although the world more generally and in a wider sense can be typified by pre-industrial or agrarian values, London is very commercial in this period.</p> <p><strong>Petersen:</strong> Okay, so, if I were to get in a time machine and go back in time, maybe London would be more familiar to me, would seem, feel more modern than almost any other place.</p> <p><strong>Stephenson:</strong> I think it would be very familiar to you the way of getting around would be a sedan chair or a carriage. You can hire them on the street, in fact you send your boy out to get one. It looks very like Uber, it's a gig economy.</p> <p>And most people working in unskilled, or who didn't have a trade or didn't have a profession or skill probably didn't have steady jobs. They thought of themselves as having work that they could rely on, but it wasn't wholly reliable and they definitely didn't have a contract that would keep them going, they probably didn't have many rights either. And they probably worked at two or three things and everything---the traditional literature about London in this period is one of inequality. So the very very poor literally scavenging on the streets among the smut because the streets were the sewers in those days, and the very very rich living in these incredibly grand environments with retinues and servants.</p> <p>It's a golden age for the aristocracy after they had a pretty rubbish time in the 16th century. It's a golden age for the aristocracy, it's a golden age for art, for architecture, for all these things but it is also a period of desperate poverty and mortality. The plague doesn't die out in London until the end of the 17th century, but still very very high infant mortality and living standards are nothing like they become in the later 19th century, after they sorted out all those things. But from a commercial point of view, you might well recognise it.</p> <p><strong>Petersen:</strong> It's very interesting---and of course the whole period is interesting---but it's particularly interesting for what it becomes, really. The rest of the world starts becoming more like London, starting in this period.</p> <p><strong>Stephenson:</strong> Yes.</p> <p><strong>Petersen:</strong> And so you study wage rate of some of the day labourers and the workers in that period. How have economic historians gone about measuring things and getting data that far back in the past?</p> <p><strong>Stephenson:</strong> Well, data on wages and prices for this period was originally gathered by a guy---Thorold Rogers---who was a 19th century historian who started collecting wages and prices in the mid 19th century and finished 40 years later, literally a broken man. These are seven volumes from around England and he basically went into any long run institution where there was an archive or records, as they were called in those days, and just noted the quantities and prices found in the books.</p> <p>But it was a huge project way before the days of even print noting, before the days of an efficient typewriter, let alone a computer. It was pretty haphazard as to what he was actually recording but it's very accurate. But he tended to take down labour costs or wages as day rates, and what he mostly found were builders because he was in big Oxford colleges and places like Westminster Abbey which had buildings from the 13th century and had required a lot of building maintenance and surprisingly he didn't find many other wages.</p> <p>So this way of recording had a sort of half dependence. These day rates because they were the only ones that people could find it was assumed that wages---wage rates are very hard to find but there's always good ones for builders---and it was assumed that builders were the same everywhere in terms of skill levels so these could be comparative.</p> <p>And Arthur Bowley---who is known as the father of modern statistics, an economist and statistician again working in the end of the 19th century and in the early 20th century---used builders in his first attempts to think statistically about an average wage, an average worker, and to establish a real wage. And Bowley’s work is absolutely seminal in the history of statistics, econometrics, and economic history. And he used Rogers' and others' wage rates of builders. And this tradition carried on as other historians gathered more rates, like Elizabeth Gilboy in the 1930s, and then Phelps Brown and Hopkins used all these people's data when they came up with the seminal <a href= \"https://www.jstor.org/stable/2626898\" target=\"_blank\" rel= \"noopener\">Seven Centuries of Building Wages</a> in 1955.</p> <p>And what Phelps Brown and Hopkins had done was they took all those day rates from the builders, and then they took a series of wages and prices and they created a basket of goods and they offset the wages against the prices and they came up with an index of the real wage or living standards across the ages. And this has been the standard for measuring welfare since 1955. And because it's very difficult to find wage rates for the 18th century for some of the reasons I spoke about a minute ago---not many people have jobs, etc etc etc---the dependence on builders' wages continued until, with the most amazing econometric and advanced econometrics techniques that Greg Clarke and Robert Allen were using, they still use that data from the 1930s.</p> <p>I think <a href=\"https://www.jstor.org/stable/2597916\" target= \"_blank\" rel=\"noopener\">the latest good index Jeremy Boulton made in the early ‘90's</a>, where he collected about 2,700 observations of wage rates. The key thing to remember here is all of these wage rates came from bills in the archives of the institutions. So they’re not really wages. In fact they are not wages at all. So, I don't know if you've ever worked for somebody and been charged out by the day, have you?</p> <p><strong>Petersen:</strong> I have not, but my wife is charged out, she works in data science and yes, she gets one wage and she's charged out to other firms at a different rate.</p> <p><strong>Stephenson:</strong> And what she's charged out is higher, right? So, when I worked in advertising, I cost my clients about 1,800 pounds a day, I saw about 350 of that. What a bloody enormous margin, actually. You got to look at how IPG were not making a really stonking profit on that but you know there's overhead and those kinds of things.</p> <p>Well, in the 18th century everything, but particularly in the building trades, that's exactly how you dealt with masons or bricklayers or carpenters or labourers. And any economy that has to organize production---and the building they were organizing was pretty big, the Great Fire of London destroyed the old city and was completely rebuilt in about a decade---there's some serious organizational coordination mechanism problems of making all that stuff happen. And the 18th century way of doing it is contract it out. Firms are a series of sub-contracts and so the way wage rates have been collected were the sums that were paid to contractors and what those contractors pay their men were substantially lower than those wages that Phelps Brown and Hopkins had used, or Robert Allen had used and Rogers and people have recorded.</p> <p><strong>Petersen:</strong> Okay. In your paper you mention Robert Allen and he had a hypothesis that based on these faulty rage weights that high wages in London were a contributing factor in kicking off mechanization in the Industrial Revolution. So, can you talk a little bit about that hypothesis and how your new look at the data has, I suppose, called it into question?</p> <p><strong>Stephenson:</strong> Yeah. So, Allen has made the most seminal contribution to the study of the Industrial Revolution. So, the Industrial Revolution is the savored big debate in economic history really and it's a favorite big debate for lots of parts or disciplines within economic history. The history of technology people like it because of the gadgets, the history of macroeconomics and supply and demand people like it because of the factor prices, the history of the organizational people and sociological people like it because of the institutions in the factories.</p> <p>So it has this broad appeal for everybody who's interested in the economics of the long run. Essentially, the core issue around the Industrial Revolution is it's unexplained. Why did it occur in England before anywhere else? It's this naughty problem that had never really been adequately explained until the early 2000s. Then there were two competing---well not two competing but two complementary---explanations by sort of giants of economic history in the same period.</p> <p>So, Bob Allen explained it through England being a high-wage economy and Joel Mokyr explained it through a series of innovations and enlightenment and how that brings about sort of an intellectual enlightment in scientific innovation. Allen’s theory was the economists’ theory and still is. And essentially what he proposed is that the high wages of England incentivized the owners of production to substitute capital for labour.</p> <p>Essentially because of the way series are constructed when you take all those comparative wage series of Amsterdam, London, Milan, Florence, Madrid, Antwerp, Strasbourg, when you sort of put them all together as a real wage series in the long run, the English wages looked substantially higher by comparison, particularly after 1650. It looked like the cost of labour for capital in England was much higher than it was in the rest of North Western Europe or Italy, where you had the traditional textile industries and banking, where there was some quite advanced commerce in places. Allen argued that the high wage economy first of all created those incentives but that also it had created higher human capital and skills, attracted capital to it, to prepare England for industrialization in the long run. But that the trigger was induced innovation through relative factor prices.</p> <div style=\"float: right; padding-left: 10px;\"><a href= \"https://www.amazon.com/Energy-English-Industrial-Revolution-Wrigley/dp/0521131855/ref=as_li_ss_il?s=books&ie=UTF8&qid=1482515355&sr=1-1&linkCode=li3&tag=economicsde0f-20&linkId=060025be70ccd897a321dc436f029cee\" target=\"_blank\" rel=\"noopener\"><img src= \"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=0521131855&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=economicsde0f-20\" alt=\"\" border=\"0\" /></a><img style= \"border: none !important; margin: 0px !important;\" src= \"https://ir-na.amazon-adsystem.com/e/ir?t=economicsde0f-20&l=li3&o=1&a=0521131855\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" /></div> <p>And part of his theory also was that coal was cheap and available in England, which is very hard to argue that it wasn't, the coal in China is in Mongolia, the Dutch don't have any they've got coal in the Ruhr, of course. But you know coal has been at the center of English energy requirements for a very long time as Tony Wrigley has written about in a very distinct way actually in a lovely book called <a href=\"http://amzn.to/2io0ddO\" target=\"_blank\" rel=\"noopener\">Energy and the English Industrial Revolution</a>, which is the kind of thing your children could read.</p> <p>So the relative factor prices between energy and capital and labour were unique in England is Allen’s argument. So, obviously if you find out that the wages are 20% to 30% to even 40% lower than Allen thought, that presents a problem for that theory.</p> <p><strong>Petersen:</strong> I believe I heard once that Germany had coal but it had to be transported over land and so was as good as useless to them before the age of the steam engine and trucking. Coal is really important. And so Robert Allen felt that high wages in London and in England were important but it seems like this issue of measuring the contract rate instead of the wage rate casts doubt on that, or even---does it close the whole gap between London and the rest of Europe?</p> <p><strong>Stephenson:</strong> Good question. And that really depends on what sort of organizational form or coordination mechanism was in place in other countries.</p> <p>So,I've looked into this with Amsterdam and Antwerp quite a bit already. I've done some work with Heidi Deneweth who works on the Low Countries on economy and building particularly. She's at Ghent. And we're finding in the way that building is organized in Amsterdam, in London, is that in London very much the state has completely outsourced everything. So, the city doesn't employ people directly, that's too much hassle. It seems like the cost of management to something is very high in England because they outsource everything: the navy, the supply, the whole thing. Bits of the navy are integrated into it, but a lot of it, particularly the supply to it, is outsourced and all building is outsourced. Whereas in Amsterdam the city still employs people who are digging dikes, and looking after canals, and doing maintenance work on public buildings. Whereas in London the comparable projects which would be stopping London Bridge from falling down, or wharfing the fleet ditch and making these canals and things. Those are given to large contractors and the contractors are solely responsible for labour.</p> <p>Whereas there is some relationship between labour and the city, people are directly employed in Amsterdam, this is indicative only and we need to do a lot more work on comparing contracts in the same types of organizations. And then there's a guy called Luca Maccarelli, who is an established Italian historian of the building industry and industry in Milan generally and he has looked at some of the data for the wages for Florence and Milan particularly and he has shown that the day rate was only part of the wage there. In fact the contractors were throwing food, bonuses, cash savings, access to places to stay, and all sorts of perks at workers to try and induce them to work. So the wage in Italy was probably a little bit higher. In fact, Mark Reilly has said that we've understated Italy’s by 15-20% and then the person who's done the most work on France so far is <a href= \"http://economicsdetective.com/2016/11/re-thinking-u-curve-inequality-vincent-geloso/\" target=\"_blank\" rel=\"noopener\">Vincent Geloso</a>, who's shown that the Strasbourg wages are probably problematic.</p> <p>But all this comparative stuff is at a really early stage. And we need people to get out into the field, the way I've been in the field in London, and look at more the form of employment and the form of the wage in those places. And really understand, the figures that we've got are they real or have they got other sort of recording factors like I've shown in London? So it's too soon to say although we started work on that.</p> <p><strong>Petersen:</strong> So, for the modern era we have people collecting data and they're making a big effort to collect the same data across time and across place. Surveys asking the same survey question to everyone, or government data and making sure it's collected in the same way every year but when we're going back to the past, of course there was no one in the year 1700 collecting data on Italy, and London, and Amsterdam, and all these different places. And so we have to stitch it together from what is available and often that's very different datasets.</p> <p><strong>Stephenson:</strong> Exactly, and different types of records. So, it may be the case that all the records are a bit skewed and you know there'll be a new schema once we have all the new data together that does reproduce the Allen’s story. And remember that we need to take the prices of goods into account. It's a real wage calculation he's done not just a nominal wage calculation. But until we've done that, what we do know is the living standards in England were not what Allen thought at the moment but you've got to do the whole comparative thing to know.</p> <p><strong>Petersen:</strong> So, how do you distinguish the skilled from the unskilled? How do you make sure you're comparing the same kind of labour?</p> <p><strong>Stephenson:</strong> That's a good question. Traditionally pretty much everywhere in Europe we've gathered two types of wage: a skilled wage for what we call craftsmen and craftsman are people who have completed an apprenticeship, who are qualified, that's the idea. So, a mason who has studied seven years in England---doesn't seem to be as long anywhere else---or a carpenter who has studied in the long run. So, who has invested time in the development of the human capital and acquired skills and then we think about the unskilled person as a counterpoint as being the labourer.</p> <p>And this is another important distinction because you know building labourers are actually of two kinds: there's the completely unskilled guy. Actually there are three kinds: there's the completely unskilled guy who's basically just handing them nails or wheeling a barrel around. But then there's the more skilled or semi-skilled assistant who actually is doing a lot more than that, who is preparing the work for the craftsman, who knows which tools go with which materials and who is fully assisting a craftsman and they couldn't really do the work without them. And you call that semi-skilled. And then there's a labourer who is hired really for their brawn. They've got a premium for being extremely strong and what you tend to see in building accounts is people who are actually hired by the load. They get 2 shillings and 8 to move a ton over a day or something---and probably need more than one man to do that---but so there's a brawn premium in these labourers or unskilled.</p> <p>And actually from Phelps Brown and Hopkins onwards we've taken this semi-skilled or brawn wage to be the unskilled wage, but these people aren't unskilled. Whereas the unskilled, the guy wheeling the barrel, or just picking out nails was paid a lot less than those. So, if the rate for the semi-skilled guy was 18 pence a day in 1700, the rate for the unskilled guy was 12 to 14. So you can see there's a considerable premium in here. That's another thing that colours our understanding of welfare because usually it's the unskilled or subsistence wage that the macroeconomist is interested in. They relate unskilled and subsistence even though they maybe should not. It's that unskilled wage that is an indication of supply and demand in the labour market, and the draw of that. So taking building labour to a semi-skilled to be unskilled leads to some problems because it implies that unskilled people in London could afford four times the subsistence basket of welfare goods in 1700, when actually they could barely afford two.</p> <p>So, if you're going to use a welfare basket these rates have a real issue and the distinction between skilled is…</p> <p><strong>Petersen:</strong> So, the reason maybe we care more about unskilled wages is because that's the wage that you'd expect to see in other places in the economy. For instance unskilled work in agriculture or working in a shop or things that we don't have data for we can sort of guess because presumably there's a labour market and people have mobility and if there was too big a gap between wages for different unskilled jobs then people would move, they’d arbitrage away that difference. So your paper, it has some sort of case studies. You have data from particular construction projects. I thought those might be interesting to go through. So, one of them is the reconstruction of St Paul's Cathedral after the Great Fire of London, which is a massive project, could you talk a little bit about that?</p> <p><strong>Stephenson:</strong> Well, yes it's a famous project because the old St. Paul’s had stood since I think the 14th century. It was this you know cultural and emotional symbol for Londoners apparently, and it had been redesigned---the front had been redesigned---by Indigo Jones, the kind of father of classical architecture in England. And it was completely destroyed by the fire and this was a sort of symbolic task to rebuild and so Christopher Wren hailed the King, came up with the design and you know Wren is pretty much the father of modern architecture and he's this enormous intellectual as well as architectural figure, he's very much part of the enlightenment.</p> <p>So the project lasted about 35-40 years, so they declared it finished in 1711 and the Great Fire was 1666 and it's still there today, absolutely intact, it survived the Second World War. So it's this incredible and very emotive building. The interesting thing from a work point of view is it's very much a craftsman's building, it's not an artist's building. So there is sculpture there, there is painting but nothing like a European cathedral like St. Peter's, St. Paul’s is very much a display of English craftsmanship and baroque style and most of it is stone faced.</p> <p>So, I have these wonderful papers, which are the day books of one of the Master Masons, one of the contracting masons who built the south west tower on the west front. His name was William Camster, his father was also a contracting mason on a separate contract and in the network of masons who served, ran and worked. We’d ran over 30 or 40 years and he was on site for about 10 years of the project from 1700 to 1709 or so and some after and I have his day books right, years of this, where he records every single man that was working for him and what they paid him. So, it's got an appeal because you can go and see what they did---which is very rare---working on the 18th century that you get some wage records and you can actually see the product as well. So, it's quite nice from that point of view.</p> <p>So, from an economist's point of view the interesting thing is the way that they contracted the construction because they just started out one contract at a time and then if it worked, they’d go \"Yes. We'll do that again.\" So, they had these repeated idiosyncratic contingent claims contracting going on and on and on and obviously disputes arise and they resolve them, or people drop out and they get new contractors. But the whole thing is basically on a rolling contingent claims contract what Oliver Hart and Holmström said could never happen. Oliver Williamson would have had his head in his hands.</p> <p>But the other notable thing is that the contractors financed this really because the Crown didn't pay them. It did pay them but the Crown and the city, they leveraged the coal tax but mostly people waited two or three years on contracts to be paid. So, the cost of financing that was just swallowed up by the contractors, it was in the price. And that's one of the reasons why you see a margin on labour and materials. But the interest costs for St. Paul's were as a total of the entire bill over 35 years about 20%, and very little of that had been lent by citizens and the city, a lot of that had come from the contractors themselves through just rolling over bills.</p> <p><strong>Petersen:</strong> That's interesting. So, we know not only what they were paying their day labours, but also implicitly we know the interest rate for that time.</p> <p><strong>Stephenson:</strong> We do. Yes, 6% for to and from the cathedral. Six percent on an annualized basis. Stephen Quinn and Temin and Voth have found higher rates, above 8% for some private lending around the same time. And it is likely that these contractors will have had to have done some private borrowing or lending within their networks to keep rolling this finance over. Because they will have bought the stone, they will have paid the carter, they will have paid the labours who are working for the carter, they will have paid the craftsman, so they may have well have to borrow to do all those things but 6% is what they got from the cathedral.</p> <p>But the real question is then, so these networks of supply chains are surviving on that kind of finance. So really big contracts essentially on a very high level of trust or a very high level of interest. We need to do more work to find out which, but it does seem like these networks---because they repeatedly contract---they have good information and it's more effective than you would imagine those types of contracts to be.</p> <p><strong>Petersen:</strong> And of course they're contracting---it's the government paying for it ultimately right?</p> <p><strong>Stephenson:</strong> Yes, and it's financed through the coal tax which is also interesting. Bearing in mind the price of coal is relevant to development at this time. The coal tax was levied at a shilling a cauldron after the Great Fire to rebuild the churches for the city and then it was maintained through and into the Georgian period by parliament who kept sort of either adding to it or continuing it and apparently it was detested and greatly avoided.</p> <p>But we definitely need some more research on how this work, and how people avoided it, and and what it did to coal consumption. Because you find in the accounts that the coal tax, they're expecting this much per year from it and consistently about 10 to 15% less comes in. So they have to turn to the city or to commissioners and people who might have money to borrow from them and tide it over. So financing the thing was unconventional.</p> <p><strong>Petersen:</strong> So, we usually think of government debt as being highly safe at least in the modern period but back then it may not have been.</p> <p><strong>Stephenson:</strong> Yes, and I don't know what the connection to other Treasury things are and Bank of England and everything. At the time it looks like it's just private between St. Paul's and the commissioners for St. Paul’s and either citizens or contractors and that it wasn't actually securitized as a state promise, but there may have been connections. It's something I haven't delved into enough.</p> <p><strong>Petersen:</strong> So, another construction project, in this case it's a maintenance project, is the famous London Bridge which of course in the nursery rhyme \"London Bridge is falling down\" which apparently was true. Can you tell me a little bit about that?</p> <p><strong>Stephenson:</strong> So, well London Bridge was it was built the end of 13th century and it's 19 stone piers across the Thames. It must have been the most fascinating and amazing structure, it stood for pretty much 500 years, but by the end of the 16th century in the early 17th century it is falling down.</p> <p>And the Thames because this sort of development further up river as well, the Thames is actually a very strongly flowing tidal river at this stage and the force of the water force through those 19 piers is wearing away. So they built wooden starlings, so they built a wooden constructions they look like boats around the piers, trying to guide the water through and these of course made the problem worse and they made the waters faster. So to pass under the bridge in a boat at high tide apparently you could drop 10 feet through the rushing rapids beneath. So you pay the shootsman who was contracted by the bridge to guide you through the piers. And it was really quite dangerous.</p> <p>So, the bridge has a number of maintenance problems: the first is the starlings the mason repairs. The second is until the mid 18th century the bridge was covered in housing just like Ponte Vecchio in Florence as a proper living bridge the housing was also in a state of disrepair and some of it owned by the bridge and some of it owned privately. So the bridge tried to take over the property that isn't theirs and then get rid of the housing that isn't working, it's falling into disrepair over this period.</p> <p>And there's a guy called Mark Leighton who's written a brilliant thesis at the University of Leicester all about how the bridge masters and the City of London get rid of the housing in the mid 18th century.</p> <p>But essentially the bridge is the only crossing from side to side, from north to south or vice versa until 1750. There isn't another way to cross the Thames. There was a little wooden bridge up in Putney in 1729. London Bridge it's got all of the infrastructure of London basically. And so it's hugely congested and falling apart. So, the maintenance bills are are huge.</p> <p>Oh yeah as well. So as well as the starlings you then have water wheels which are basically bringing the water from the New River Company and the Thames to give water to the city. So those are also in operation, these whole teams of little engineers looking after the water wheels. So it's a really busy bridge it's got people scrambling over it all the time looking after it, not before the shootsman or anybody else doing any work on it and those people were paid not very much.</p> <p>The master craftsmen were paid for their contract and got a really good rate for looking after the contract, and then they hired others piecemeal so they'd hire well-known carpenters or masons. But they'd never have regular days or regular work and then the labourers were paid by the tide.</p> <p>So at high tide you could work on the bridge or you could work on the upper bits of the bridge if you were in a boat; at low tide you could access all those damaged starlings and piers. So at low tide they worked in boats and that meant that in the winter you might only get four tides in the week depending on when the tide and the light coincided, in the summer you could maybe get 11 and then when they didn't need any work done you wouldn't get any tides at all.</p> <p>So, there were quite a number of people. It varied from teams of 12 to teams of 80 or so who were employed in this fashion in a piecemeal just waiting for a little sort of bit of peace work on London Bridge. So, it's an interesting bit of contact with the sort of materiality of the world as well, everything was literally ruled by when the water came in.</p> <p><strong>Petersen:</strong> Right. And since it's such a long period of time, I suppose you can get a decent time series of that change in the wages over that period.</p> <p><strong>Stephenson:</strong> Yes, from a labour economist point of view, one of the fascinating things about the 18th century is this persistence of rates, particularly for labourers, it's a very monopsonistic market it's a classic monopsonistic market. It's a wage posting. One where employers basically will see who will come at this set wage and what happens is they don't change the wage.</p> <p>The fluctuation happens around the number of days worked. So people don't turn up, or don't get work when there is less to do. The number of days fall away and when there is high demand, an upward-sloping curve, the number of days go up for everybody.</p> <p>But a transaction cost analysis would suggest that the 18th century employer understood the costs of such information very well indeed because they weren't going to have any asymmetry of information. They were going to post ‘this is what you get,’ particularly the unskilled hand and the time or the amount of work that you got was how the fluctuations and the dispersion occurred.</p> <p>So there's a lot more work to be done on that because nobody's really ever looked at this kind of market in those modern terms, understanding it as monopsonistic or having search or information costs.</p> <p>And it's only with these levels of micro data that we can begin to understand that it might have worked like the labour market we know. Until about 20 years ago people thought---until much more recently actually, the last paper I can see about this is in 2007 by Leonard Schwartz---that essentially before 1840 it's a market dominated by custom not by market forces. But on a micro analysis it looks very much like there are just the kind of market forces at play that we understand today. So, wage posting at the lower level, a little bit of wage bargaining at the skills level, and supply and demand do actually equilibrate but not through the rate, through the number of days worked, which of course brings about the income.</p> <p><strong>Petersen:</strong> So, the third construction project you discuss is the Westminster Bridge, which I suppose is that that second bridge you mentioned earlier.</p> <p><strong>Stephenson:</strong> Yes, the second bridge, the cross rail of the 18th century.</p> <p><strong>Petersen:</strong> Is that interesting from an economic history point of view, we have a lot of data from that?</p> <p><strong>Stephenson:</strong> You get less data because I don't have anybody's nice little book saying who came in and on which day, so I don't have the number of days' work for Westminster Bridge.</p> <p>The interesting thing about Westminster Bridge is the different kinds of contract. Everybody, they were making contracts for hundreds of thousands of pounds with the masons and engineers and they also had a contract with a guy who had a horse and three piles for 27 pounds for the year. So, you've got this variation in value or risk from a financial point of view which is quite dramatic.</p> <p>But the key thing is that at Westminster Bridge you find the tide and the day model as well. So a much smaller number of days than you would expect that are actually billed to the institution, but this means of paying by the tide, which protects productivity from an employer's point of view. So that also occurs at Westminster Bridge.</p> <p>And what you find is that people are doing quite advanced and quite dangerous work, but without the danger money. They were given gin instead. So they sank caissons, this is one of the earliest uses of caissons designed to create the piers. So these things are experimental to say the least, and they put people in diving gear into the caissons and it must have been terrifying, you know, what if the stuff gave way and they went under the Thames. In February, because that's the time you want to be in the Thames! You know, in 18th century diving gear. And got them to work on the masonry or on the carpentry on the bed of the river for the same rate as you could be having quite a nice comfy time carving out something simple, or doing some basic maintenance work on a couple of windows on some bridge houses. So, yes very dangerous work. There seemed to be a lot of skill available, ready to do that work at those kinds of rates.</p> <p><strong>Petersen:</strong> So, where do you see this research program going in the future?</p> <p><strong>Stephenson:</strong> There's obviously an issue about the rate of welfare, the real wage and welfare in the 18th century and to be honest if we're going to make a serious contribution to that, we need to start looking at people who aren't builders.</p> <p>I've started a project with the Cambridge Group for the History of Population and Social Structure, where I spent a year before I went to Oxford, on London occupations. Because that Cambridge group, they are the masters of working on occupational structure in the long run in England and we are sampling institutions that bought goods and services widely. And the kind of bills and the kind of businesses that they deal with to understand what sort of people were employed where. So, to try and get some welfare and some wage data beyond builders that we can normalize and use properly.</p> <p>I think the second direction for this research is to understand how labour markets worked. Was there such a thing as custom? Because one of the old things we believe about the Industrial Revolution, and this idea doesn't really stand up anymore, but it's something that's still emotionally alluring for a lot of people, we see the Industrial Revolution as that sort of capitalism thing and our version of capitalism got going.</p> <p>But if people already understood transaction cost economics, and Christopher Wren writes like Oliver Williamson sometimes, then maybe the market didn't start then, maybe they already had a view of the market. And there are some organizational things that we need to be looking at from that point of view.</p> <p>Essentially the 18th century will always be interesting because it is a free market. It is unregulated, there's no corporation tax and the finance is not state controlled at all. This is before the gold standard, this is before states get interested in managing money in a big way. There is monetary policy but it's not in the same way we conceive it now. And so labour and capital have a relationship that is unencumbered by the state, by government, by regulation.</p> <p>So what is the outcome of that? Was it a race to the bottom, was there any equilibrium, what happened? So, there's a contribution to be made to studying that as a sort of a history of ideas thing as well. It's hugely rich but those are broadly the three things that are on my agenda right now.</p> <p><strong>Petersen:</strong> My guest today has been Judy Stephenson. Judy thanks for being a part of Economics Detective Radio.</p> <p><strong>Stephenson:</strong> Thank you very much. I very much enjoyed talking to you.</p> <hr /> <p> </p>",
  "content:encoded": "<p>What follows is an edited transcript of my conversation with Judy Stephenson.</p>  <p>Petersen: You're listening to Economics Detective Radio. My guest today is Judy Stephenson of Oxford University's Wadham college. Judy, welcome to Economics Detective Radio.</p> <p>Stephenson: Thank you very much. It's nice to be here.</p> <p>Petersen: So, our topic for today is economic history. Specifically we’ll be looking at some interesting research Judy has done on wage rates in the early modern period in London. This period is particularly interesting because it's the start of the Industrial Revolution which leads to a dramatic increase in the growth living standards and of technology and that trend of course is what has shaped our modern world and made it different from the world of the past. So, it's very important of course to understand this period if we want to understand the world as it is now. So Judy, start by giving us historical background. What was the world like in the period you study?</p> <p>Stephenson: Well, I work mostly on researching London, so urban environments. And London is very developed in this period between about 1600 and 1800. And London becomes the biggest city in the world during this period and as the biggest city in the world it's hugely vibrant, some of the largest merchant houses in the world are there, banking is advanced and developing. Most of the occupations of London are tertiary or service sector, even at this early date.</p> <p>The river is a huge source of both transportation and work, the port is where much of the capital, both physical and financial, from around the world comes through the city, and the professions and bureaucracy are well established in London in this period. It's growing at all levels of society, from the very poorest to the very richest exponentially. So, if you look at the population growth overall in the U.K. in the late 17th century from 1500-1600 to 1700, that actually is pretty much stable or slightly declining. But the population of London grows by a third or something in that period.</p> <p>London is this hugely vibrant commercial social and cultural center and it's pretty much overtaken Amsterdam, which has come to the end of its golden age in the mid 17th century, right at this period. So, although the world more generally and in a wider sense can be typified by pre-industrial or agrarian values, London is very commercial in this period.</p> <p>Petersen: Okay, so, if I were to get in a time machine and go back in time, maybe London would be more familiar to me, would seem, feel more modern than almost any other place.</p> <p>Stephenson: I think it would be very familiar to you the way of getting around would be a sedan chair or a carriage. You can hire them on the street, in fact you send your boy out to get one. It looks very like Uber, it's a gig economy.</p> <p>And most people working in unskilled, or who didn't have a trade or didn't have a profession or skill probably didn't have steady jobs. They thought of themselves as having work that they could rely on, but it wasn't wholly reliable and they definitely didn't have a contract that would keep them going, they probably didn't have many rights either. And they probably worked at two or three things and everything---the traditional literature about London in this period is one of inequality. So the very very poor literally scavenging on the streets among the smut because the streets were the sewers in those days, and the very very rich living in these incredibly grand environments with retinues and servants.</p> <p>It's a golden age for the aristocracy after they had a pretty rubbish time in the 16th century. It's a golden age for the aristocracy, it's a golden age for art, for architecture, for all these things but it is also a period of desperate poverty and mortality. The plague doesn't die out in London until the end of the 17th century, but still very very high infant mortality and living standards are nothing like they become in the later 19th century, after they sorted out all those things. But from a commercial point of view, you might well recognise it.</p> <p>Petersen: It's very interesting---and of course the whole period is interesting---but it's particularly interesting for what it becomes, really. The rest of the world starts becoming more like London, starting in this period.</p> <p>Stephenson: Yes.</p> <p>Petersen: And so you study wage rate of some of the day labourers and the workers in that period. How have economic historians gone about measuring things and getting data that far back in the past?</p> <p>Stephenson: Well, data on wages and prices for this period was originally gathered by a guy---Thorold Rogers---who was a 19th century historian who started collecting wages and prices in the mid 19th century and finished 40 years later, literally a broken man. These are seven volumes from around England and he basically went into any long run institution where there was an archive or records, as they were called in those days, and just noted the quantities and prices found in the books.</p> <p>But it was a huge project way before the days of even print noting, before the days of an efficient typewriter, let alone a computer. It was pretty haphazard as to what he was actually recording but it's very accurate. But he tended to take down labour costs or wages as day rates, and what he mostly found were builders because he was in big Oxford colleges and places like Westminster Abbey which had buildings from the 13th century and had required a lot of building maintenance and surprisingly he didn't find many other wages.</p> <p>So this way of recording had a sort of half dependence. These day rates because they were the only ones that people could find it was assumed that wages---wage rates are very hard to find but there's always good ones for builders---and it was assumed that builders were the same everywhere in terms of skill levels so these could be comparative.</p> <p>And Arthur Bowley---who is known as the father of modern statistics, an economist and statistician again working in the end of the 19th century and in the early 20th century---used builders in his first attempts to think statistically about an average wage, an average worker, and to establish a real wage. And Bowley’s work is absolutely seminal in the history of statistics, econometrics, and economic history. And he used Rogers' and others' wage rates of builders. And this tradition carried on as other historians gathered more rates, like Elizabeth Gilboy in the 1930s, and then Phelps Brown and Hopkins used all these people's data when they came up with the seminal <a href= \"https://www.jstor.org/stable/2626898\" target=\"_blank\" rel= \"noopener\">Seven Centuries of Building Wages</a> in 1955.</p> <p>And what Phelps Brown and Hopkins had done was they took all those day rates from the builders, and then they took a series of wages and prices and they created a basket of goods and they offset the wages against the prices and they came up with an index of the real wage or living standards across the ages. And this has been the standard for measuring welfare since 1955. And because it's very difficult to find wage rates for the 18th century for some of the reasons I spoke about a minute ago---not many people have jobs, etc etc etc---the dependence on builders' wages continued until, with the most amazing econometric and advanced econometrics techniques that Greg Clarke and Robert Allen were using, they still use that data from the 1930s.</p> <p>I think <a href=\"https://www.jstor.org/stable/2597916\" target= \"_blank\" rel=\"noopener\">the latest good index Jeremy Boulton made in the early ‘90's</a>, where he collected about 2,700 observations of wage rates. The key thing to remember here is all of these wage rates came from bills in the archives of the institutions. So they’re not really wages. In fact they are not wages at all. So, I don't know if you've ever worked for somebody and been charged out by the day, have you?</p> <p>Petersen: I have not, but my wife is charged out, she works in data science and yes, she gets one wage and she's charged out to other firms at a different rate.</p> <p>Stephenson: And what she's charged out is higher, right? So, when I worked in advertising, I cost my clients about 1,800 pounds a day, I saw about 350 of that. What a bloody enormous margin, actually. You got to look at how IPG were not making a really stonking profit on that but you know there's overhead and those kinds of things.</p> <p>Well, in the 18th century everything, but particularly in the building trades, that's exactly how you dealt with masons or bricklayers or carpenters or labourers. And any economy that has to organize production---and the building they were organizing was pretty big, the Great Fire of London destroyed the old city and was completely rebuilt in about a decade---there's some serious organizational coordination mechanism problems of making all that stuff happen. And the 18th century way of doing it is contract it out. Firms are a series of sub-contracts and so the way wage rates have been collected were the sums that were paid to contractors and what those contractors pay their men were substantially lower than those wages that Phelps Brown and Hopkins had used, or Robert Allen had used and Rogers and people have recorded.</p> <p>Petersen: Okay. In your paper you mention Robert Allen and he had a hypothesis that based on these faulty rage weights that high wages in London were a contributing factor in kicking off mechanization in the Industrial Revolution. So, can you talk a little bit about that hypothesis and how your new look at the data has, I suppose, called it into question?</p> <p>Stephenson: Yeah. So, Allen has made the most seminal contribution to the study of the Industrial Revolution. So, the Industrial Revolution is the savored big debate in economic history really and it's a favorite big debate for lots of parts or disciplines within economic history. The history of technology people like it because of the gadgets, the history of macroeconomics and supply and demand people like it because of the factor prices, the history of the organizational people and sociological people like it because of the institutions in the factories.</p> <p>So it has this broad appeal for everybody who's interested in the economics of the long run. Essentially, the core issue around the Industrial Revolution is it's unexplained. Why did it occur in England before anywhere else? It's this naughty problem that had never really been adequately explained until the early 2000s. Then there were two competing---well not two competing but two complementary---explanations by sort of giants of economic history in the same period.</p> <p>So, Bob Allen explained it through England being a high-wage economy and Joel Mokyr explained it through a series of innovations and enlightenment and how that brings about sort of an intellectual enlightment in scientific innovation. Allen’s theory was the economists’ theory and still is. And essentially what he proposed is that the high wages of England incentivized the owners of production to substitute capital for labour.</p> <p>Essentially because of the way series are constructed when you take all those comparative wage series of Amsterdam, London, Milan, Florence, Madrid, Antwerp, Strasbourg, when you sort of put them all together as a real wage series in the long run, the English wages looked substantially higher by comparison, particularly after 1650. It looked like the cost of labour for capital in England was much higher than it was in the rest of North Western Europe or Italy, where you had the traditional textile industries and banking, where there was some quite advanced commerce in places. Allen argued that the high wage economy first of all created those incentives but that also it had created higher human capital and skills, attracted capital to it, to prepare England for industrialization in the long run. But that the trigger was induced innovation through relative factor prices.</p> <a href= \"https://www.amazon.com/Energy-English-Industrial-Revolution-Wrigley/dp/0521131855/ref=as_li_ss_il?s=books&ie=UTF8&qid=1482515355&sr=1-1&linkCode=li3&tag=economicsde0f-20&linkId=060025be70ccd897a321dc436f029cee\" target=\"_blank\" rel=\"noopener\"></a> <p>And part of his theory also was that coal was cheap and available in England, which is very hard to argue that it wasn't, the coal in China is in Mongolia, the Dutch don't have any they've got coal in the Ruhr, of course. But you know coal has been at the center of English energy requirements for a very long time as Tony Wrigley has written about in a very distinct way actually in a lovely book called <a href=\"http://amzn.to/2io0ddO\" target=\"_blank\" rel=\"noopener\">Energy and the English Industrial Revolution</a>, which is the kind of thing your children could read.</p> <p>So the relative factor prices between energy and capital and labour were unique in England is Allen’s argument. So, obviously if you find out that the wages are 20% to 30% to even 40% lower than Allen thought, that presents a problem for that theory.</p> <p>Petersen: I believe I heard once that Germany had coal but it had to be transported over land and so was as good as useless to them before the age of the steam engine and trucking. Coal is really important. And so Robert Allen felt that high wages in London and in England were important but it seems like this issue of measuring the contract rate instead of the wage rate casts doubt on that, or even---does it close the whole gap between London and the rest of Europe?</p> <p>Stephenson: Good question. And that really depends on what sort of organizational form or coordination mechanism was in place in other countries.</p> <p>So,I've looked into this with Amsterdam and Antwerp quite a bit already. I've done some work with Heidi Deneweth who works on the Low Countries on economy and building particularly. She's at Ghent. And we're finding in the way that building is organized in Amsterdam, in London, is that in London very much the state has completely outsourced everything. So, the city doesn't employ people directly, that's too much hassle. It seems like the cost of management to something is very high in England because they outsource everything: the navy, the supply, the whole thing. Bits of the navy are integrated into it, but a lot of it, particularly the supply to it, is outsourced and all building is outsourced. Whereas in Amsterdam the city still employs people who are digging dikes, and looking after canals, and doing maintenance work on public buildings. Whereas in London the comparable projects which would be stopping London Bridge from falling down, or wharfing the fleet ditch and making these canals and things. Those are given to large contractors and the contractors are solely responsible for labour.</p> <p>Whereas there is some relationship between labour and the city, people are directly employed in Amsterdam, this is indicative only and we need to do a lot more work on comparing contracts in the same types of organizations. And then there's a guy called Luca Maccarelli, who is an established Italian historian of the building industry and industry in Milan generally and he has looked at some of the data for the wages for Florence and Milan particularly and he has shown that the day rate was only part of the wage there. In fact the contractors were throwing food, bonuses, cash savings, access to places to stay, and all sorts of perks at workers to try and induce them to work. So the wage in Italy was probably a little bit higher. In fact, Mark Reilly has said that we've understated Italy’s by 15-20% and then the person who's done the most work on France so far is <a href= \"http://economicsdetective.com/2016/11/re-thinking-u-curve-inequality-vincent-geloso/\" target=\"_blank\" rel=\"noopener\">Vincent Geloso</a>, who's shown that the Strasbourg wages are probably problematic.</p> <p>But all this comparative stuff is at a really early stage. And we need people to get out into the field, the way I've been in the field in London, and look at more the form of employment and the form of the wage in those places. And really understand, the figures that we've got are they real or have they got other sort of recording factors like I've shown in London? So it's too soon to say although we started work on that.</p> <p>Petersen: So, for the modern era we have people collecting data and they're making a big effort to collect the same data across time and across place. Surveys asking the same survey question to everyone, or government data and making sure it's collected in the same way every year but when we're going back to the past, of course there was no one in the year 1700 collecting data on Italy, and London, and Amsterdam, and all these different places. And so we have to stitch it together from what is available and often that's very different datasets.</p> <p>Stephenson: Exactly, and different types of records. So, it may be the case that all the records are a bit skewed and you know there'll be a new schema once we have all the new data together that does reproduce the Allen’s story. And remember that we need to take the prices of goods into account. It's a real wage calculation he's done not just a nominal wage calculation. But until we've done that, what we do know is the living standards in England were not what Allen thought at the moment but you've got to do the whole comparative thing to know.</p> <p>Petersen: So, how do you distinguish the skilled from the unskilled? How do you make sure you're comparing the same kind of labour?</p> <p>Stephenson: That's a good question. Traditionally pretty much everywhere in Europe we've gathered two types of wage: a skilled wage for what we call craftsmen and craftsman are people who have completed an apprenticeship, who are qualified, that's the idea. So, a mason who has studied seven years in England---doesn't seem to be as long anywhere else---or a carpenter who has studied in the long run. So, who has invested time in the development of the human capital and acquired skills and then we think about the unskilled person as a counterpoint as being the labourer.</p> <p>And this is another important distinction because you know building labourers are actually of two kinds: there's the completely unskilled guy. Actually there are three kinds: there's the completely unskilled guy who's basically just handing them nails or wheeling a barrel around. But then there's the more skilled or semi-skilled assistant who actually is doing a lot more than that, who is preparing the work for the craftsman, who knows which tools go with which materials and who is fully assisting a craftsman and they couldn't really do the work without them. And you call that semi-skilled. And then there's a labourer who is hired really for their brawn. They've got a premium for being extremely strong and what you tend to see in building accounts is people who are actually hired by the load. They get 2 shillings and 8 to move a ton over a day or something---and probably need more than one man to do that---but so there's a brawn premium in these labourers or unskilled.</p> <p>And actually from Phelps Brown and Hopkins onwards we've taken this semi-skilled or brawn wage to be the unskilled wage, but these people aren't unskilled. Whereas the unskilled, the guy wheeling the barrel, or just picking out nails was paid a lot less than those. So, if the rate for the semi-skilled guy was 18 pence a day in 1700, the rate for the unskilled guy was 12 to 14. So you can see there's a considerable premium in here. That's another thing that colours our understanding of welfare because usually it's the unskilled or subsistence wage that the macroeconomist is interested in. They relate unskilled and subsistence even though they maybe should not. It's that unskilled wage that is an indication of supply and demand in the labour market, and the draw of that. So taking building labour to a semi-skilled to be unskilled leads to some problems because it implies that unskilled people in London could afford four times the subsistence basket of welfare goods in 1700, when actually they could barely afford two.</p> <p>So, if you're going to use a welfare basket these rates have a real issue and the distinction between skilled is…</p> <p>Petersen: So, the reason maybe we care more about unskilled wages is because that's the wage that you'd expect to see in other places in the economy. For instance unskilled work in agriculture or working in a shop or things that we don't have data for we can sort of guess because presumably there's a labour market and people have mobility and if there was too big a gap between wages for different unskilled jobs then people would move, they’d arbitrage away that difference. So your paper, it has some sort of case studies. You have data from particular construction projects. I thought those might be interesting to go through. So, one of them is the reconstruction of St Paul's Cathedral after the Great Fire of London, which is a massive project, could you talk a little bit about that?</p> <p>Stephenson: Well, yes it's a famous project because the old St. Paul’s had stood since I think the 14th century. It was this you know cultural and emotional symbol for Londoners apparently, and it had been redesigned---the front had been redesigned---by Indigo Jones, the kind of father of classical architecture in England. And it was completely destroyed by the fire and this was a sort of symbolic task to rebuild and so Christopher Wren hailed the King, came up with the design and you know Wren is pretty much the father of modern architecture and he's this enormous intellectual as well as architectural figure, he's very much part of the enlightenment.</p> <p>So the project lasted about 35-40 years, so they declared it finished in 1711 and the Great Fire was 1666 and it's still there today, absolutely intact, it survived the Second World War. So it's this incredible and very emotive building. The interesting thing from a work point of view is it's very much a craftsman's building, it's not an artist's building. So there is sculpture there, there is painting but nothing like a European cathedral like St. Peter's, St. Paul’s is very much a display of English craftsmanship and baroque style and most of it is stone faced.</p> <p>So, I have these wonderful papers, which are the day books of one of the Master Masons, one of the contracting masons who built the south west tower on the west front. His name was William Camster, his father was also a contracting mason on a separate contract and in the network of masons who served, ran and worked. We’d ran over 30 or 40 years and he was on site for about 10 years of the project from 1700 to 1709 or so and some after and I have his day books right, years of this, where he records every single man that was working for him and what they paid him. So, it's got an appeal because you can go and see what they did---which is very rare---working on the 18th century that you get some wage records and you can actually see the product as well. So, it's quite nice from that point of view.</p> <p>So, from an economist's point of view the interesting thing is the way that they contracted the construction because they just started out one contract at a time and then if it worked, they’d go \"Yes. We'll do that again.\" So, they had these repeated idiosyncratic contingent claims contracting going on and on and on and obviously disputes arise and they resolve them, or people drop out and they get new contractors. But the whole thing is basically on a rolling contingent claims contract what Oliver Hart and Holmström said could never happen. Oliver Williamson would have had his head in his hands.</p> <p>But the other notable thing is that the contractors financed this really because the Crown didn't pay them. It did pay them but the Crown and the city, they leveraged the coal tax but mostly people waited two or three years on contracts to be paid. So, the cost of financing that was just swallowed up by the contractors, it was in the price. And that's one of the reasons why you see a margin on labour and materials. But the interest costs for St. Paul's were as a total of the entire bill over 35 years about 20%, and very little of that had been lent by citizens and the city, a lot of that had come from the contractors themselves through just rolling over bills.</p> <p>Petersen: That's interesting. So, we know not only what they were paying their day labours, but also implicitly we know the interest rate for that time.</p> <p>Stephenson: We do. Yes, 6% for to and from the cathedral. Six percent on an annualized basis. Stephen Quinn and Temin and Voth have found higher rates, above 8% for some private lending around the same time. And it is likely that these contractors will have had to have done some private borrowing or lending within their networks to keep rolling this finance over. Because they will have bought the stone, they will have paid the carter, they will have paid the labours who are working for the carter, they will have paid the craftsman, so they may have well have to borrow to do all those things but 6% is what they got from the cathedral.</p> <p>But the real question is then, so these networks of supply chains are surviving on that kind of finance. So really big contracts essentially on a very high level of trust or a very high level of interest. We need to do more work to find out which, but it does seem like these networks---because they repeatedly contract---they have good information and it's more effective than you would imagine those types of contracts to be.</p> <p>Petersen: And of course they're contracting---it's the government paying for it ultimately right?</p> <p>Stephenson: Yes, and it's financed through the coal tax which is also interesting. Bearing in mind the price of coal is relevant to development at this time. The coal tax was levied at a shilling a cauldron after the Great Fire to rebuild the churches for the city and then it was maintained through and into the Georgian period by parliament who kept sort of either adding to it or continuing it and apparently it was detested and greatly avoided.</p> <p>But we definitely need some more research on how this work, and how people avoided it, and and what it did to coal consumption. Because you find in the accounts that the coal tax, they're expecting this much per year from it and consistently about 10 to 15% less comes in. So they have to turn to the city or to commissioners and people who might have money to borrow from them and tide it over. So financing the thing was unconventional.</p> <p>Petersen: So, we usually think of government debt as being highly safe at least in the modern period but back then it may not have been.</p> <p>Stephenson: Yes, and I don't know what the connection to other Treasury things are and Bank of England and everything. At the time it looks like it's just private between St. Paul's and the commissioners for St. Paul’s and either citizens or contractors and that it wasn't actually securitized as a state promise, but there may have been connections. It's something I haven't delved into enough.</p> <p>Petersen: So, another construction project, in this case it's a maintenance project, is the famous London Bridge which of course in the nursery rhyme \"London Bridge is falling down\" which apparently was true. Can you tell me a little bit about that?</p> <p>Stephenson: So, well London Bridge was it was built the end of 13th century and it's 19 stone piers across the Thames. It must have been the most fascinating and amazing structure, it stood for pretty much 500 years, but by the end of the 16th century in the early 17th century it is falling down.</p> <p>And the Thames because this sort of development further up river as well, the Thames is actually a very strongly flowing tidal river at this stage and the force of the water force through those 19 piers is wearing away. So they built wooden starlings, so they built a wooden constructions they look like boats around the piers, trying to guide the water through and these of course made the problem worse and they made the waters faster. So to pass under the bridge in a boat at high tide apparently you could drop 10 feet through the rushing rapids beneath. So you pay the shootsman who was contracted by the bridge to guide you through the piers. And it was really quite dangerous.</p> <p>So, the bridge has a number of maintenance problems: the first is the starlings the mason repairs. The second is until the mid 18th century the bridge was covered in housing just like Ponte Vecchio in Florence as a proper living bridge the housing was also in a state of disrepair and some of it owned by the bridge and some of it owned privately. So the bridge tried to take over the property that isn't theirs and then get rid of the housing that isn't working, it's falling into disrepair over this period.</p> <p>And there's a guy called Mark Leighton who's written a brilliant thesis at the University of Leicester all about how the bridge masters and the City of London get rid of the housing in the mid 18th century.</p> <p>But essentially the bridge is the only crossing from side to side, from north to south or vice versa until 1750. There isn't another way to cross the Thames. There was a little wooden bridge up in Putney in 1729. London Bridge it's got all of the infrastructure of London basically. And so it's hugely congested and falling apart. So, the maintenance bills are are huge.</p> <p>Oh yeah as well. So as well as the starlings you then have water wheels which are basically bringing the water from the New River Company and the Thames to give water to the city. So those are also in operation, these whole teams of little engineers looking after the water wheels. So it's a really busy bridge it's got people scrambling over it all the time looking after it, not before the shootsman or anybody else doing any work on it and those people were paid not very much.</p> <p>The master craftsmen were paid for their contract and got a really good rate for looking after the contract, and then they hired others piecemeal so they'd hire well-known carpenters or masons. But they'd never have regular days or regular work and then the labourers were paid by the tide.</p> <p>So at high tide you could work on the bridge or you could work on the upper bits of the bridge if you were in a boat; at low tide you could access all those damaged starlings and piers. So at low tide they worked in boats and that meant that in the winter you might only get four tides in the week depending on when the tide and the light coincided, in the summer you could maybe get 11 and then when they didn't need any work done you wouldn't get any tides at all.</p> <p>So, there were quite a number of people. It varied from teams of 12 to teams of 80 or so who were employed in this fashion in a piecemeal just waiting for a little sort of bit of peace work on London Bridge. So, it's an interesting bit of contact with the sort of materiality of the world as well, everything was literally ruled by when the water came in.</p> <p>Petersen: Right. And since it's such a long period of time, I suppose you can get a decent time series of that change in the wages over that period.</p> <p>Stephenson: Yes, from a labour economist point of view, one of the fascinating things about the 18th century is this persistence of rates, particularly for labourers, it's a very monopsonistic market it's a classic monopsonistic market. It's a wage posting. One where employers basically will see who will come at this set wage and what happens is they don't change the wage.</p> <p>The fluctuation happens around the number of days worked. So people don't turn up, or don't get work when there is less to do. The number of days fall away and when there is high demand, an upward-sloping curve, the number of days go up for everybody.</p> <p>But a transaction cost analysis would suggest that the 18th century employer understood the costs of such information very well indeed because they weren't going to have any asymmetry of information. They were going to post ‘this is what you get,’ particularly the unskilled hand and the time or the amount of work that you got was how the fluctuations and the dispersion occurred.</p> <p>So there's a lot more work to be done on that because nobody's really ever looked at this kind of market in those modern terms, understanding it as monopsonistic or having search or information costs.</p> <p>And it's only with these levels of micro data that we can begin to understand that it might have worked like the labour market we know. Until about 20 years ago people thought---until much more recently actually, the last paper I can see about this is in 2007 by Leonard Schwartz---that essentially before 1840 it's a market dominated by custom not by market forces. But on a micro analysis it looks very much like there are just the kind of market forces at play that we understand today. So, wage posting at the lower level, a little bit of wage bargaining at the skills level, and supply and demand do actually equilibrate but not through the rate, through the number of days worked, which of course brings about the income.</p> <p>Petersen: So, the third construction project you discuss is the Westminster Bridge, which I suppose is that that second bridge you mentioned earlier.</p> <p>Stephenson: Yes, the second bridge, the cross rail of the 18th century.</p> <p>Petersen: Is that interesting from an economic history point of view, we have a lot of data from that?</p> <p>Stephenson: You get less data because I don't have anybody's nice little book saying who came in and on which day, so I don't have the number of days' work for Westminster Bridge.</p> <p>The interesting thing about Westminster Bridge is the different kinds of contract. Everybody, they were making contracts for hundreds of thousands of pounds with the masons and engineers and they also had a contract with a guy who had a horse and three piles for 27 pounds for the year. So, you've got this variation in value or risk from a financial point of view which is quite dramatic.</p> <p>But the key thing is that at Westminster Bridge you find the tide and the day model as well. So a much smaller number of days than you would expect that are actually billed to the institution, but this means of paying by the tide, which protects productivity from an employer's point of view. So that also occurs at Westminster Bridge.</p> <p>And what you find is that people are doing quite advanced and quite dangerous work, but without the danger money. They were given gin instead. So they sank caissons, this is one of the earliest uses of caissons designed to create the piers. So these things are experimental to say the least, and they put people in diving gear into the caissons and it must have been terrifying, you know, what if the stuff gave way and they went under the Thames. In February, because that's the time you want to be in the Thames! You know, in 18th century diving gear. And got them to work on the masonry or on the carpentry on the bed of the river for the same rate as you could be having quite a nice comfy time carving out something simple, or doing some basic maintenance work on a couple of windows on some bridge houses. So, yes very dangerous work. There seemed to be a lot of skill available, ready to do that work at those kinds of rates.</p> <p>Petersen: So, where do you see this research program going in the future?</p> <p>Stephenson: There's obviously an issue about the rate of welfare, the real wage and welfare in the 18th century and to be honest if we're going to make a serious contribution to that, we need to start looking at people who aren't builders.</p> <p>I've started a project with the Cambridge Group for the History of Population and Social Structure, where I spent a year before I went to Oxford, on London occupations. Because that Cambridge group, they are the masters of working on occupational structure in the long run in England and we are sampling institutions that bought goods and services widely. And the kind of bills and the kind of businesses that they deal with to understand what sort of people were employed where. So, to try and get some welfare and some wage data beyond builders that we can normalize and use properly.</p> <p>I think the second direction for this research is to understand how labour markets worked. Was there such a thing as custom? Because one of the old things we believe about the Industrial Revolution, and this idea doesn't really stand up anymore, but it's something that's still emotionally alluring for a lot of people, we see the Industrial Revolution as that sort of capitalism thing and our version of capitalism got going.</p> <p>But if people already understood transaction cost economics, and Christopher Wren writes like Oliver Williamson sometimes, then maybe the market didn't start then, maybe they already had a view of the market. And there are some organizational things that we need to be looking at from that point of view.</p> <p>Essentially the 18th century will always be interesting because it is a free market. It is unregulated, there's no corporation tax and the finance is not state controlled at all. This is before the gold standard, this is before states get interested in managing money in a big way. There is monetary policy but it's not in the same way we conceive it now. And so labour and capital have a relationship that is unencumbered by the state, by government, by regulation.</p> <p>So what is the outcome of that? Was it a race to the bottom, was there any equilibrium, what happened? So, there's a contribution to be made to studying that as a sort of a history of ideas thing as well. It's hugely rich but those are broadly the three things that are on my agenda right now.</p> <p>Petersen: My guest today has been Judy Stephenson. Judy thanks for being a part of Economics Detective Radio.</p> <p>Stephenson: Thank you very much. I very much enjoyed talking to you.</p>  <p> </p>",
  "enclosure": "",
  "itunes:duration": "42:57",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "What follows is an edited transcript of my conversation with Judy Stephenson.  Petersen: You're listening to Economics Detective Radio. My guest today is Judy Stephenson of Oxford University's Wadham college. Judy, welcome to Economics Detective...",
  "itunes:episode": 40,
  "itunes:episodeType": "full"
}