{
  "id": "yt:video:icE7E42A-CE",
  "yt:videoId": "icE7E42A-CE",
  "yt:channelId": "UCg_j7kndWLFZEg4yCqUWPCA",
  "title": "Mario + Rabbids Sparks of Hope - All Bosses (No Damage)",
  "link": "",
  "author": {
    "name": "packattack04082",
    "uri": "https://www.youtube.com/channel/UCg_j7kndWLFZEg4yCqUWPCA"
  },
  "published": "2022-10-28T13:30:21+00:00",
  "updated": "2022-11-03T10:56:03+00:00",
  "media:group": {
    "media:title": "Mario + Rabbids Sparks of Hope - All Bosses (No Damage)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "This video shows how to defeat all bosses in Mario + Rabbids Sparks of Hope without taking any damage.  This took a bit of practice to try and learn a good strategy for each boss.  I hope that the video helps anyone else with these bosses as the strategies are pretty consistent and repeatable if you can memorize them.  This includes all secret bosses in the game as well as the main story bosses.  Time stamps for each boss are listed below.\n\nThis channel features instructional & highly edited video game guides, walkthroughs, speedruns and other uniquely transformative videos.  My own personal gameplay, extensive editing & creative input are clearly added into each video, ensuring that all videos adhere to YouTube's partner program guidelines.  My walkthoughs take tremendous amounts of work & editing so that all videos are straight to the point & can be used as professional video game guides.  I have spent thousands of hours practicing & mastering games before recording to ensure the highest quality gameplay possible.  All gameplay is my own & is recorded and edited solely by me.  Permission to upload each game was provided by the game publisher.\n\n00:00 Giant Wildclaw\n05:50 Giant Goomba\n11:22 Midnite\n20:45 Giant Squashette\n25:00 Bedrock\n36:58 Giant Depleter\n42:12 Wiggler\n47:38 Giant Magikoopa\n54:33 Daphne\n1:06:05 Giant Magnafowl\n1:16:11 Darkmess Bowser\n1:22:22 Darkmess Edge\n1:27:52 Cursa Final Boss\n1:53:40 Ending",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}