{
  "title": "Chinese Whispers: Has China got over the Japanese invasion?",
  "link": "https://audioboom.com/posts/7945372",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2375,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>For China, WWII started in 1937 with the Japanese invasion, two years before Hitler invaded Poland. Japan would occupy China until its surrender in 1945, in the process committing atrocities like the rape of Nanjing. This was the second Japanese invasion in fifty years. </div>\n<div><br>\n</div>\n<div>Yet decades after the war, when I grew up in Nanjing, Japanese food was all the craze and it was Japanese anime that kids watched and Japanese fashion that teenagers craved. So has China got over its wartime hatred of Japan?</div>\n<div><br>\n</div>\n<div>On this episode, I’m joined by the Tokyo-based Chinese translator Dylan Levi King, who you might remember from our previous conversation on ketamine use in China. We’re going to be chatting about China’s attitude to Japan today, and the contradictions within that, rather than focusing on the history between the two countries. If you want to learn more about that part of things – there’s nowhere better to go than Professor Rana Mitter’s book, <em>China’s War with Japan</em>. Dylan and I chat about the Chinese caricatures of Japanese soldiers on screen, the Japanese porn star who overcame the two countries’ enmity and the <em>jingri</em> – the Chinese who identify as ‘spiritually Japanese’.</div>\n<div><br>\n</div>\n<div>Dylan reflects on the cognitive dissonance – or disassociation – that the Chinese hold between Japanese politics and Japanese soft power. For example, he tells me that:</div>\n<div><br>\n</div>\n<div><em>‘I used to go to this clothing store when I was a student in China, and in the store they would sell Japanese fashion like BAPE, but on the doorstep walking into the place there was a Japanese flag on the ground, so you could trample on the Japanese flag as you walk into buy all your Japanese fashion.’</em></div>\n<div><br>\n</div>\n<div>Japanese nationalism, in return, seems to be getting louder, whether it’s visits to the Yasukuni shrine housing war criminals, or a continued refusal to acknowledge the war-time trafficking of Chinese and Korean women as sex slaves – euphemistically known as ‘comfort women’. Yet Dylan argues that this is just all bark, no bite:</div>\n<div><br>\n</div>\n<div><em>‘China rising on its doorstep and Japan’s economy, since 1990, not really improving, has exacerbated that feeling in Japan of wanting to stand up, even though they can’t really. So it’s all performative and useless.’</em></div>\n",
  "pubDate": "Mon, 20 Sep 2021 15:25:00 +0000",
  "guid": "tag:audioboom.com,2021-09-20:/posts/7945372",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}