{
  "title": "Pentagon Aims to Demo a Nuclear Spacecraft Within 5 Years",
  "link": "https://spectrum.ieee.org/nuclear-spacecraft",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-rendering-of-an-apple-next-to-an-exploded-view-diagram-of-a-white-and-grey-sphere-with-a-small-orange-cylinder-at-its-center.jpg?id=29959462&width=1500&height=2000&coordinates=262%2C0%2C263%2C0\"/><br/><br/><p>\n\tIn the latest push for nuclear power in space, the Pentagon’s <a href=\"https://www.diu.mil/\" target=\"_blank\">Defense Innovation Unit</a> (DIU) <a href=\"https://www.diu.mil/latest/powering-the-future-of-space-exploration-diu-launching-next-generation\" rel=\"noopener noreferrer\" target=\"_blank\">awarded a contract</a> in May to Seattle-based <a href=\"https://usnc.com/space/\" target=\"_blank\">Ultra Safe Nuclear</a> to advance its nuclear power and propulsion concepts. The company is making a soccer ball–size radioisotope battery it calls <a href=\"https://usnc.com/embercore/\" target=\"_blank\">EmberCore</a>. The DIU’s goal is to launch the technology into space for demonstration in 2027.\n</p><p>\n\tUltra Safe Nuclear’s system is intended to be lightweight, scalable, and usable as both a propulsion source and a power source. It will be specifically designed to give small-to-medium-size military spacecraft the ability to maneuver nimbly in the space between Earth orbit and the moon. The DIU effort is part of the U.S. military’s recently <a href=\"https://www.politico.com/news/2022/03/12/space-force-moon-pentagon-00016818\" rel=\"noopener noreferrer\" target=\"_blank\">announced plans</a> to develop a surveillance network in cislunar space.\n</p><p>\n\tBesides speedy space maneuvers, the DIU wants to power sensors and communication systems without having to worry about solar panels pointing in the right direction or batteries having enough charge to work at night, says <a href=\"https://www.linkedin.com/in/adam-schilffarth-4958253\" target=\"_blank\">Adam Schilffarth</a>, director of strategy at Ultra Safe Nuclear. “Right now, if you are trying to take radar imagery in Ukraine through cloudy skies,” he says, “current platforms can only take a very short image because they draw so much power.”\n</p><p>\n\tRadioisotope power sources are well suited for small, uncrewed spacecraft, adds <a href=\"https://www.linkedin.com/in/chris-morrison-51039813\" target=\"_blank\">Christopher Morrison</a>, who is leading EmberCore’s development. Such sources rely on the radioactive decay of an element that produces energy, as opposed to nuclear fission, which involves splitting atomic nuclei in a controlled chain reaction to release energy. Heat produced by radioactive decay is converted into electricity using thermoelectric devices.\n</p><p>\n\tRadioisotopes have provided heat and electricity for spacecraft <a href=\"https://world-nuclear.org/information-library/non-power-nuclear-applications/transport/nuclear-reactors-for-space.aspx\" rel=\"noopener noreferrer\" target=\"_blank\">since 1961</a>. The <a href=\"https://mars.nasa.gov/msl/home/\" target=\"_blank\">Curiosity</a> and <a href=\"https://mars.nasa.gov/mars2020/\" target=\"_blank\">Perseverance</a> rovers on Mars, and deep-space missions including <a href=\"https://solarsystem.nasa.gov/missions/cassini/overview/\" target=\"_blank\">Cassini</a>, <a href=\"https://www.nasa.gov/mission_pages/newhorizons/main/index.html\" target=\"_blank\">New Horizons</a>, and <a href=\"https://voyager.jpl.nasa.gov/\" target=\"_blank\">Voyager</a> all use radioisotope batteries that rely on the decay of plutonium-238, which is nonfissile—unlike plutonium-239, which is used in weapons and power reactors.\n</p><p>\n\tFor EmberCore, Ultra Safe Nuclear has instead turned to medical isotopes such as cobalt-60 that are easier and cheaper to produce. The materials start out inert, and have to be charged with neutrons to become radioactive. The company encapsulates the material in a proprietary ceramic for safety.\n</p><p>\n\tCobalt-60 has a half-life of five years (compared to plutonium-238’s 90 years), which is enough for the cislunar missions that the DOD and NASA are looking at, Morrison says. He says that EmberCore should be able to provide 10 times as much power as a plutonium-238 system, providing over 1 million kilowatt-hours of energy using just a few pounds of fuel. “This is a technology that is in many ways commercially viable and potentially more scalable than plutonium-238,” he says.\n</p><p>\n\tOne downside of the medical isotopes is that they can produce high-energy X-rays in addition to heat. So Ultra Safe Nuclear wraps the fuel with a radiation-absorbing metal shield. But in the future, the EmberCore system could be designed for scientists to use the X-rays for experiments. “They buy this heater and get an X-ray source for free,” says Schilffarth. “We’ve talked with scientists who right now have to haul pieces of lunar or Martian regolith up to their sensor because the X-ray source is so weak. Now we’re talking about a spotlight that could shine down to do science from a distance.”\n</p><p>\n\tUltra Safe Nuclear’s contract is one of two awarded by the DIU—which aims to speed up the deployment of commercial technology through military use—to develop nuclear power and propulsion for spacecraft. The other contract was awarded to <a href=\"https://www.avalanche.energy/\" rel=\"noopener noreferrer\" target=\"_blank\">Avalanche Energy</a>, which is making a lunchbox-size fusion device it calls an Orbitron. The device will use electrostatic fields to trap high-speed ions in slowly changing orbits around a negatively charged cathode. Collisions between the ions can result in fusion reactions that produce energetic particles.\n</p><p>\n\tBoth companies will use nuclear energy to power high-efficiency electric propulsion systems. Electric propulsion technologies such as ion thrusters, which use electromagnetic fields to accelerate ions and generate thrust, are more efficient than chemical rockets, which burn fuel. Solar panels typically power the ion thrusters that satellites use today to change their position and orientation. Schilffarth says that the higher power from EmberCore should give a greater velocity change of 10 kilometers per second in orbit than today’s electric propulsion systems.\n</p><p>\n\tUltra Safe Nuclear is also one of three companies developing <a href=\"https://spectrum.ieee.org/nuclear-powered-rockets-get-a-second-look-for-travel-to-mars\" target=\"_self\">nuclear fission thermal propulsion systems</a> for NASA and the Department of Energy. Meanwhile, the Defense Advanced Research Projects Agency (DARPA) is <a href=\"https://www.ans.org/news/article-3946/dod-seeks-inspace-demo-of-nuclear-rocket-engine-in-fy-2026/\" target=\"_blank\">seeking companies</a> to develop a fission-based nuclear thermal rocket engine, with demonstrations expected in 2026.\n</p><p>\n<em>This article appears in the August 2022 print issue as “Spacecraft to Run on Radioactive Decay.”</em>\n</p>",
  "pubDate": "Thu, 09 Jun 2022 16:44:41 +0000",
  "guid": "https://spectrum.ieee.org/nuclear-spacecraft",
  "category": [
    "Spacecraft",
    "Radioactive",
    "Nuclear fusion",
    "Nuclear energy"
  ],
  "dc:creator": "Prachi Patel",
  "media:content": ""
}