{
  "title": "The Edition: How much longer can Boris Johnson keep going?",
  "link": "https://audioboom.com/posts/8070446",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2479,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s episode: Is Boris going to limp on?<br>\n<br>\nIn her cover piece this week, Katy Balls writes that although Boris Johnson believes he can survive the partygate scandal, he has some way to go until he is safe, while in his column, James Forsyth writes about why the Tories have a summer of discontent ahead of them. They both join the podcast to speculate on the Prime Minister’s future. (00:44)<br>\n<br>\nAlso this week: Why is the Rwandan government taking our asylum seekers?<br>\n<br>\nWe have heard the arguments behind the Home Office’s plan to send migrants to Rwanda. But why is Rwanda up for this arrangement? Michela Wrong, the author of <em>Do Not Disturb: The Story of a Political Murder</em> <em>and an African Regime Gone Bad</em>, explores this question in this week’s <em>Spectator </em>and she joins the podcast along with MP Andrew Mitchell. (14:50)<br>\n<br>\nAnd finally: Can AI take on the art world?<br>\n<br>\nSean Thomas writes in this week’s magazine about how some AI programs appear to have become rather good at painting. But what does this mean for the future of art? He joins the podcast along with Lukas Noehrer the organiser of The Alan Turing Institute’s AI & Arts group and Professor Stefano Ermon of Stanford whose research has made much of this technology possible. (28:16)<br>\n<br>\nHosted by Lara Prendergast and William Moore<br>\nProduced by Sam Holmes<br>\n<br>\nSubscribe to <em>The Spectator</em> today and get a £20 Amazon gift voucher:<a href=\"http://www.spectator.co.uk/voucher\">www.spectator.co.uk/voucher</a><br>\n<br>\nListen to Lara's food podcast <em>Table Talk</em>: <a href=\"https://www.spectator.co.uk/podcasts/table-talk\">https://www.spectator.co.uk/podcasts/table-talk</a>\n</div>\n",
  "pubDate": "Thu, 21 Apr 2022 12:05:20 +0000",
  "guid": "tag:audioboom.com,2022-04-21:/posts/8070446",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}