{
  "id": "tag:blogger.com,1999:blog-2957813557601703695.post-1341187629387763776",
  "published": "2022-11-01T14:28:00.003+05:00",
  "updated": "2022-11-01T14:28:20.154+05:00",
  "category": [
    "",
    ""
  ],
  "title": "“Fly Jinnah” takes off with first flight to Islamabad",
  "content": "<p><br /></p><p>&nbsp;</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh-05d-CJguzlDuQEzTVqT8BPRiN00K12xdvFu-LSJZcHA-JonPiBh8-9kasjcYkUjjHbNnl-VgG_sdU90HM9FVYLD0gNZFqT6dGVIkaw0EynXbqZ-4MlbJzhbgoCr8GRkzN8SuNG8fhFNiVSF_JC3ZnhHLLe-IHXo9lYKI5YxjgpiqCRheneLOSwVzZA/s1000/IMAGE%204.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"“Fly Jinnah” takes off with first flight to Islamabad\" border=\"0\" data-original-height=\"665\" data-original-width=\"1000\" height=\"426\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh-05d-CJguzlDuQEzTVqT8BPRiN00K12xdvFu-LSJZcHA-JonPiBh8-9kasjcYkUjjHbNnl-VgG_sdU90HM9FVYLD0gNZFqT6dGVIkaw0EynXbqZ-4MlbJzhbgoCr8GRkzN8SuNG8fhFNiVSF_JC3ZnhHLLe-IHXo9lYKI5YxjgpiqCRheneLOSwVzZA/w640-h426/IMAGE%204.jpg\" width=\"640\" /></a></div><br /><p></p><p><br /></p><p>&nbsp;</p><p><br /></p><p>KARACHI: Fly Jinnah, Pakistan’s new low-cost carrier (LCC), today held the inaugural ceremony of its first flight to Islamabad, marking the start of the airline’s operations. The ceremony took place at the Ramada Plaza by Wyndham Karachi Airport Hotel prior the departure of the inaugural flight which included delegates and members of the media.</p><p><br /></p><p>&nbsp;</p><p><br /></p><p>&nbsp;</p><p><br /></p><p>The inaugural ceremony, which also included a press conference prior to departure, was attended by members of the Pakistan Civil Aviation Authority (PCAA), along with senior leaders of Lakson Group, Air Arabia Group, Jinnah Airport, members of the press and other delegates.&nbsp;</p><p><br /></p><p>Iqbal Ali Lakhani, Chairman of Fly Jinnah, said: “Today’s milestone marks the beginning of Fly Jinnah’s operations, a new airline serving Pakistan is and contributing to the nation’s aviation infrastructure with the latest innovation and technology. We are confident that Fly Jinnah will offer its customers a convenient air travel option backed up with a value-driven product and services. We look forward to working closely with our partners to effectively cater to the needs of the Pakistani market and to contribute to the growth of the travel and tourism sector of Pakistan”.&nbsp;&nbsp;</p><p><br /></p><p>&nbsp;</p><p><br /></p><p>&nbsp;</p><p><br /></p><p>Adel Al Ali, Group Chief Executive Officer, Air Arabia said: “Today marks a special occasion as Fly Jinnah takes off to the skies. This step reflects the carrier’s strategic commitment to offer a reliable and value for money air travel to its customer base in Pakistan. We are excited to mark the start of Fly Jinnah’s operations with four domestic routes and remain eager to further expand our network and services. We thank our partners and the Pakistan Civil Aviation Authority for their support, and we look forward to welcoming customers on board our flights”.</p><p><br /></p><p>Upon the arrival of the inaugural flight at Islamabad Airport, the aircraft was received with the traditional water cannon salute.&nbsp;</p><p><br /></p><p>&nbsp;</p><p><br /></p><p>&nbsp;</p><p><br /></p><p>Fly Jinnah now operates direct daily flights from Karachi to Islamabad, Lahore, and Peshawar. In addition to that, the airline operates direct flights four times weekly between Karachi and Quetta. Customers can book their flights by visiting Fly Jinnah’s website (www.flyjinnah.com), by calling the call center (021-3565096) or through travel agencies.</p><p><br /></p><p>Earlier this month, the airline has received its Air Operator Certificate and Air Operating License from the Pakistan Civil Aviation Authority (PCAA) allowing Fly Jinnah to start its domestic operations.</p><p><br /></p><p>Fleet and configuration</p><p><br /></p><p>Fly Jinnah is starting its operations with a fleet that is comprised of three Airbus A320-200 aircraft, the most modern and best-selling single aisle aircraft in the world. The aircraft is configured with 174 seats and therefore providing added comfort with one of the most generous seat-pitch of any economy cabin. The aircraft is also equipped with “SkyTime”, a free in-flight streaming service that allows passengers to stream a wide selection of entertainment directly to their devices. Customers can also enjoy a variety of snacks, sandwiches, hot meals, and beverages from its on-board “SkyCafe” menu at affordable prices.</p><div class=\"blogger-post-footer\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js\"></script>\n<!-- MobileAds -->\n<ins class=\"adsbygoogle\"\n     style=\"display:inline-block;width:320px;height:50px\"\n     data-ad-client=\"ca-pub-2762820915666464\"\n     data-ad-slot=\"9814557735\"></ins>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Admin",
    "uri": "https://www.blogger.com/profile/00179371387546033311",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}