{
  "title": "Introducing: Unjust & Unsolved",
  "link": "https://audioboom.com/posts/7679014",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 2672,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>FAM!! We are so excited to introduce Obsessed Network's newest podcast, \"Unjust & Unsolved\" with Maggie Freleng! Each week, Maggie tells the story of a person who, the evidence shows, was wrongfully convicted of a crime they didn't commit. <strong>You can find and subscribe to \"Unjust & Unsolved\" wherever you get your podccasts.<br>\n</strong><br>\nFor episode 1, Maggie is telling the story of Ronnie Long. AND YOU NEED TO KNOW, AFTER MAGGIE WAS THROUGH REPORTING THE STORY, THERE WAS MAJOR NEWS IN THE CASE! SO STAY TUNED TILL THE END TO FIND OUT WHAT HAPPENED! <br>\n<br>\nIn 1976 Concord, NC, a man broke into the home of a prominent white widow and violently beat and raped her. Ronnie Long, a 20-year-old black man, was given consecutive life sentences for rape and burglary. In a mostly segregated town, Ronnie was convicted by an all white jury, with no evidence linking him to the crime, an alibi, and only a shaky witness ID from the survivor. Since then, it was revealed that the prosecution witheld exculpatory evidence for Ronnie. There is also DNA evidence Ronnie is trying to get tested to prove who the real attacker was. Ronnie, now 64, has spent 44 years in prison; however, major updates happened during this case while we were reporting it.<br>\n<br>\n<strong>Learn more about Ronnie's case and how to help:</strong><br>\n<a href=\"https://freeronnielongnow.org/\">https://freeronnielongnow.org/</a><br>\n<br>\nFor more information and a complete list of sources for this episode, visit <a href=\"http://www.unjustandunsolved.com/\"><strong><a href=\"http://www.unjustandunsolved.com\">www.unjustandunsolved.com</a></strong></a>\n</div>\n",
  "pubDate": "Thu, 10 Sep 2020 10:10:00 +0000",
  "guid": "tag:audioboom.com,2020-09-10:/posts/7679014",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}