{
  "title": "Expanding Accurate Person Recognition to New Altitudes and Ranges: The BRIAR Dataset. (arXiv:2211.01917v1 [cs.CV])",
  "link": "http://arxiv.org/abs/2211.01917",
  "description": "<p>Face recognition technology has advanced significantly in recent years due\nlargely to the availability of large and increasingly complex training datasets\nfor use in deep learning models. These datasets, however, typically comprise\nimages scraped from news sites or social media platforms and, therefore, have\nlimited utility in more advanced security, forensics, and military\napplications. These applications require lower resolution, longer ranges, and\nelevated viewpoints. To meet these critical needs, we collected and curated the\nfirst and second subsets of a large multi-modal biometric dataset designed for\nuse in the research and development (R&amp;D) of biometric recognition technologies\nunder extremely challenging conditions. Thus far, the dataset includes more\nthan 350,000 still images and over 1,300 hours of video footage of\napproximately 1,000 subjects. To collect this data, we used Nikon DSLR cameras,\na variety of commercial surveillance cameras, specialized long-rage R&amp;D\ncameras, and Group 1 and Group 2 UAV platforms. The goal is to support the\ndevelopment of algorithms capable of accurately recognizing people at ranges up\nto 1,000 m and from high angles of elevation. These advances will include\nimprovements to the state of the art in face recognition and will support new\nresearch in the area of whole-body recognition using methods based on gait and\nanthropometry. This paper describes methods used to collect and curate the\ndataset, and the dataset's characteristics at the current stage.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Cornett_D/0/1/0/all/0/1\">David Cornett III</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Brogan_J/0/1/0/all/0/1\">Joel Brogan</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Barber_N/0/1/0/all/0/1\">Nell Barber</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Aykac_D/0/1/0/all/0/1\">Deniz Aykac</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Baird_S/0/1/0/all/0/1\">Seth Baird</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Burchfield_N/0/1/0/all/0/1\">Nick Burchfield</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Dukes_C/0/1/0/all/0/1\">Carl Dukes</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Duncan_A/0/1/0/all/0/1\">Andrew Duncan</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ferrell_R/0/1/0/all/0/1\">Regina Ferrell</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Goddard_J/0/1/0/all/0/1\">Jim Goddard</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Jager_G/0/1/0/all/0/1\">Gavin Jager</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Larson_M/0/1/0/all/0/1\">Matt Larson</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Murphy_B/0/1/0/all/0/1\">Bart Murphy</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Johnson_C/0/1/0/all/0/1\">Christi Johnson</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Shelley_I/0/1/0/all/0/1\">Ian Shelley</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Srinivas_N/0/1/0/all/0/1\">Nisha Srinivas</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Stockwell_B/0/1/0/all/0/1\">Brandon Stockwell</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Thompson_L/0/1/0/all/0/1\">Leanne Thompson</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Yohe_M/0/1/0/all/0/1\">Matt Yohe</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhang_R/0/1/0/all/0/1\">Robert Zhang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Dolvin_S/0/1/0/all/0/1\">Scott Dolvin</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Santos_Villalobos_H/0/1/0/all/0/1\">Hector J. Santos-Villalobos</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Bolme_D/0/1/0/all/0/1\">David S. Bolme</a>"
}