{
  "id": "https://bibleinoneyear.org/en/youth/139",
  "title": "Day 139: Your Hope in Times of Trouble",
  "description": "Psalm 64:1–2,5–6,10, 1 Samuel 3:10–11, John 11:1–44.  As well as on a national level, all of us are likely at some point to face times of trouble in our own individual lives ‘Trouble’ can take many forms",
  "pubDate": "Wed, 19 May 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/139/?ignore",
  "itunes:duration": "14:49",
  "guid": "enyouth19052021-139",
  "length": 889.05,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 139: Your Hope in Times of Trouble",
  "itunes:subtitle": "Psalm 64:1–2,5–6,10, 1 Samuel 3:10–11, John 11:1–44.  As well as on a national level, all of us are likely at some point to face times of trouble in our own individual lives ‘Trouble’ can take many forms",
  "itunes:summary": "As a result of the coronavirus epidemic, our world has been shaken. All our assumptions are shattered. Almost everyone, each in our own way, have been dealing with fear, grief and trauma. However difficult your situation may be – however much ‘trouble’ you are facing in your life, you can have hope. Hope is the confident expectation of God’s ultimate blessing in this life and the life to come, based upon the goodness and promises of God. With Jesus, there is always hope.\nLike Lazarus in our New Testament passage for today, some parts of the church have been prematurely declared dead. In his book, The Death of Christian Britain, Callum Brown writes, ‘This book is about the demise of the nation’s core religious moral identity. As historical changes go, this has been no lingering and drawn-out affair. It took several centuries (in what historians used to call the Dark Ages) to convert Britain to Christianity, but it has taken less than forty years for the country to forsake it.’\nWe often read headlines such as, ‘Crisis in the Church’, ‘Dramatic decline in attendance’ and ‘Church attendance figures fall again’.\nAt the same time, today, we are seeing the results of a society that is attempting to shut God out. Every day, in Britain, around 300 couples are divorced. Somebody calls the Samaritans every fourteen seconds. The pornographic industry is worth billions of pounds. There are 30,000 Christian clergy of all types, and more than 80,000 registered witches and fortune tellers.\nBritain is not the only nation in trouble. Many other nations are going through difficult times. As well as on a national level, all of us are likely at some point to face times of trouble in our own individual lives.\n‘Trouble’ can take many forms. What is your hope in times of trouble?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 139
}