{
  "title": "Computing committors via Mahalanobis diffusion maps with enhanced sampling data. (arXiv:2208.13772v2 [physics.comp-ph] UPDATED)",
  "link": "http://arxiv.org/abs/2208.13772",
  "description": "<p>The study of phenomena such as protein folding and conformational changes in\nmolecules is a central theme in chemical physics. Molecular dynamics (MD)\nsimulation is the primary tool for the study of transition processes in\nbiomolecules, but it is hampered by a huge timescale gap between the processes\nof interest and atomic vibrations which dictate the time step size. Therefore,\nit is imperative to combine MD simulations with other techniques in order to\nquantify the transition processes taking place on large timescales. In this\nwork, the diffusion map with Mahalanobis kernel, a meshless approach for\napproximating the Backward Kolmogorov Operator (BKO) in collective variables,\nis upgraded to incorporate standard enhanced sampling techniques such as\nmetadynamics. The resulting algorithm, which we call the \"target measure\nMahalanobis diffusion map\" (tm-mmap), is suitable for a moderate number of\ncollective variables in which one can approximate the diffusion tensor and free\nenergy. Imposing appropriate boundary conditions allows use of the approximated\nBKO to solve for the committor function and utilization of transition path\ntheory to find the reactive current delineating the transition channels and the\ntransition rate. The proposed algorithm, tm-mmap, is tested on the\ntwo-dimensional Moro-Cardin two-well system with position-dependent diffusion\ncoefficient and on alanine dipeptide in two collective variables where the\ncommittor, the reactive current, and the transition rate are compared to those\ncomputed by the finite element method (FEM). Finally, tm-mmap is applied to\nalanine dipeptide in four collective variables where the use of finite elements\nis infeasible.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Evans_L/0/1/0/all/0/1\">Luke Evans</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Cameron_M/0/1/0/all/0/1\">Maria K. Cameron</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Tiwary_P/0/1/0/all/0/1\">Pratyush Tiwary</a>"
}