{
  "id": "yt:video:-zrF2HcVJbQ",
  "yt:videoId": "-zrF2HcVJbQ",
  "yt:channelId": "UC2iUwfYi_1FCGGqhOUNx-iA",
  "title": "SONIC PRIME: Trailer Breakdown!",
  "link": "",
  "author": {
    "name": "Screen Rant",
    "uri": "https://www.youtube.com/channel/UC2iUwfYi_1FCGGqhOUNx-iA"
  },
  "published": "2022-10-29T17:15:01+00:00",
  "updated": "2022-10-31T17:29:40+00:00",
  "media:group": {
    "media:title": "SONIC PRIME: Trailer Breakdown!",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "As we inch closer to the release date of the newest sonic game: Sonic Frontiers, it's looking like Sega and Netflix are finally deciding to ramp up the promotion of the next sonic animated series: Sonic Prime! The second teaser trailer just dropped and there's so much to pick apart, from the paradox prism being the catalyst for sonics multiversal journey, and the awesome new character designs for the main cast! Not to mention, we get a singular shot of a group of mad doctors that may or may not be the central antagonists of the series. \n\nWith the first episode clocking in at an astounding 40 minutes, we can expect the premiere of Sonic Prime to be an absolute blast! It looks like Netflix is going all in on Sonic the Hedgehog and we couldn’t be happier the blue blur is getting more time to shine. All that and we didn’t even see Shadow or arguably the most important sonic character, big the cat in the teaser! Honestly they should just rework the series so that it focuses solely on big, we’d be in full support of it. There's much more to come regarding sonic prime so make sure you guys stick around for more coverage on the series as we get closer to its release this december! \n\nSubscribe: http://bit.ly/Subscribe-to-Screenrant\n\nChapters:\n0:00 - Intro \n0:28 - Paradox Prism\n1:40 - New Outfits\n2:50 - Eggman Variants \n3:54 - The Sonic Multiverse\n\nCheck out Screen Rant’s official TikTok! \nhttps://www.tiktok.com/@screenrant \n\nOur Social Media:\nhttps://twitter.com/screenrant \nhttps://www.facebook.com/ScreenRant  \nhttps://www.linkedin.com/company/screen-rant/ \n\nOur Website:\nhttp://screenrant.com/\n\nVideo by: Patrice Scott\n\nFor copyright matters please contact us at: legal@valnetinc.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}