{
  "id": "tag:blogger.com,1999:blog-37798047.post-436861897425412865",
  "published": "2021-09-21T18:01:00.004-04:00",
  "updated": "2021-09-26T11:56:50.068-04:00",
  "title": "That Alfa-Trump Sussman indictment",
  "content": "<p>Five years ago, online magazine Slate broke a <a href=\"http://www.slate.com/articles/news_and_politics/cover_story/2016/10/was_a_server_registered_to_the_trump_organization_communicating_with_russia.html\">story</a> about how DNS packets showed secret communications between Alfa Bank in Russia and the Trump Organization, proving a link that Trump denied. I was the only prominent tech expert that debunked this as just a conspiracy-theory[<a href=\"https://blog.erratasec.com/2016/11/debunking-trumps-secret-server.html\">*</a>][<a href=\"https://blog.erratasec.com/2016/11/in-which-i-have-to-debunk-second-time.html\">*</a>][<a href=\"https://blog.erratasec.com/2017/03/fbi-what-to-look-for-in-trumpalfabank.html\">*</a>].</p><p>Last week, I was vindicated by the&nbsp;<a href=\"https://s3.documentcloud.org/documents/21063441/sussmann.pdf\">indictment</a>&nbsp;of a lawyer involved, a Michael Sussman. It tells a story of where this data came from, and some problems with it.</p><span><a name='more'></a></span><p>But we should first avoid reading too much into this indictment. It cherry picks data supporting its argument while excluding anything that disagrees with it. We see chat messages expressing doubt in the DNS data. If chat messages existed expressing confidence in the data, we wouldn't see them in the indictment.</p><p>In addition, the indictment tries to make strong ties to the Hillary campaign and the Steele Dossier, but ultimately, it's weak. It looks to me like an outsider trying to ingratiated themselves with the Hillary campaign rather than there being part of a grand Clinton-lead conspiracy against Trump.</p><p>With these caveats, we do see some important things about where the data came from.</p><p>We see how Tech-Executive-1 used his position at cyber-security companies to search private data (namely, private DNS logs) to search for anything that might link Trump to somebody nefarious, including Russian banks. In other words, a link between Trump and Alfa bank wasn't something they accidentally found, it was one of the many thousands of links they looked for.</p><p>Such a technique has been long known as a problem in science. If you cast the net wide enough, you are sure to find things that would otherwise be statistically unlikely. In other words, if you do hundreds of tests of hydroxychloroquine or invermectin on Covid-19, you are sure to find results that are so statistically unlikely that they wouldn't happen more than 1% of the time.</p><p>If you search world-wide DNS logs, you are certain to find weird anomalies that you can't explain. Unexplained computer anomalies happen all the time, as every user of computers can tell you.</p><p>We've seen from the start that the data was highly manipulated. It's likely that the data is real, that the DNS requests actually happened, but at the same time, it's been stripped of everything that might cast doubt on the data. In this indictment we see why: before the data was found the purpose was to smear Trump. The finders of the data don't want people to come to the best explanation, they want only explainations that hurt Trump.</p><p>Trump had no control over the domain in question, trump-email.com. Instead, it was created by a hotel marketing firm they hired, Cendyne. It's Cendyne who put Trump's name in the domain. A broader collection of DNS information including Cendyne's other clients would show whether this was normal or not.</p><p>In other words, a possible explanation of the data, hints of a Trump-Alfa connection, has always been the dishonesty of those who collected the data. The above indictment confirms they were at this level of dishonesty. It doesn't mean the DNS requests didn't happen, but that their anomalous nature can be created by deletion of explanatory data.</p><p>Lastly, we see in this indictment the problem with \"experts\".</p><p><a href=\"https://1.bp.blogspot.com/-w0-DVQTsQ4k/YUPp12XKcxI/AAAAAAAAGv0/TQrKRsykSTMwQ1x2ruiEQpZU8Y5ydcjMgCLcBGAsYHQ/s1186/Screen%2BShot%2B2021-09-16%2Bat%2B9.03.23%2BPM.png\" style=\"margin-left: 1em; margin-right: 1em; text-align: center;\"><img border=\"0\" data-original-height=\"220\" data-original-width=\"1186\" height=\"59\" src=\"https://1.bp.blogspot.com/-w0-DVQTsQ4k/YUPp12XKcxI/AAAAAAAAGv0/TQrKRsykSTMwQ1x2ruiEQpZU8Y5ydcjMgCLcBGAsYHQ/s320/Screen%2BShot%2B2021-09-16%2Bat%2B9.03.23%2BPM.png\" width=\"320\" /></a></p><p>Sadly, this didn't happen. Even experts are biased. The original Slate story quoted Paul Vixie, who hates Trump, who was willing to believe it rather than question it. It's not necessarily Vixie's fault: the Slate reporter gave the experts they quoted a brief taste of the data, then pretended their response was a full in-depth analysis, rather than a quick hot-take. It's not clear that Vixie really still stands behind the conclusions in the story.</p><p>But of the rest of the \"experts\" in the field, few really care. Most hate Trump, and therefore, wouldn't challenge anything that hurts Trump. Experts who like Trump also wouldn't put the work into it, because nobody would listen to them. Most people choose sides -- they don't care about the evidence.</p><p>This indictment vindicates my analysis in those blogposts linked above. My analysis shows convincingly that Trump had no real connection to the domain. I can't explain the anomaly, why Alfa Bank is so interested in a domain containing the word \"trump\", but I can show that conspirational communications is the least likely explanation.</p><p><br /></p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Robert Graham",
    "uri": "http://www.blogger.com/profile/09879238874208877740",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}