{
  "id": "https://bibleinoneyear.org/en/youth/154",
  "title": "Day 154: Even Your Weakness is Anointed",
  "description": "Psalm 69:13-17, 2 Samuel 3:39a, Acts 1:3–11.  However weak and inadequate you may feel, God can use you, like David, in extraordinary ways  Even your weakness is anointed",
  "pubDate": "Thu, 03 Jun 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/154/?ignore",
  "itunes:duration": "13:58",
  "guid": "enyouth03062021-154",
  "length": 838.84,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 154: Even Your Weakness is Anointed",
  "itunes:subtitle": "Psalm 69:13-17, 2 Samuel 3:39a, Acts 1:3–11.  However weak and inadequate you may feel, God can use you, like David, in extraordinary ways  Even your weakness is anointed",
  "itunes:summary": "Do you ever feel too weak or inadequate to be useful to God?\nA teenager from Cumbria in Northern England felt God calling him. Patrick was poorly educated, ineloquent and faced significant opposition throughout his ministry from those who felt that he wasn’t up to the task. Even as an old man he still admitted, ‘Today I still blush and fear more than anything to have my lack of learning brought out into the open.’\nYet despite all his disadvantages Patrick remained convinced that God had called and anointed him as an evangelist. He wrote, ‘We are a letter of Christ for salvation even to the back of beyond – and what does it matter if it is not a learned letter? For it is still to be found valid and plain for all to read, written in your very hearts, not in ink but by the Spirit of the living God!’\nToday his more eloquent contemporaries have long been forgotten, but the impact of St Patrick’s ministry and mission to Ireland 1500 years ago is still recognised around the world. Even his weakness was anointed.\nAs David takes up the throne of Israel he says, ‘… though I am the anointed king, I am weak’ (2 Samuel 3:39). The moment you put your faith in Jesus, God anoints you with the Holy Spirit. However weak and inadequate you may feel, God can use you, like David, in extraordinary ways. Even your weakness is anointed.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 154
}