{
  "title": "The Government, Race, and an Upcoming SCOTUS Decision",
  "link": "https://mises.org/node/60868",
  "description": "<p>This week, the Supreme Court of the United States is confronting yet again an issue that has bedeviled it for the past thirty years: the use of racial quotas by government-owned universities and private universities that accept government funding.</p>\n<p>The last time the court looked at this issue, it punted. As is always the case when the court punts, the issue returned. This time around, the issue comes in an environment hot with racial anxiety and lack of constitutional fidelity.</p>\n<p>Here is the backstory.</p>\n<p>The Fourteenth Amendment was enacted after the conclusion of the War Between the States. The radical Republicans who controlled the Congress and most Northern state legislatures wanted to punish the Southern states severely. Yet, their debates on the floors of Congress and state legislatures are unilluminating, as they offer contradictory purposes.</p>\n<p>But the language of the Amendment—in the Equal Protection Clause—makes it clear that by requiring the laws to be applied equally, the mandate of the amendment is to remove race from the armament of states’ tools of governance.</p>\n<p>Yet, the Supreme Court ruled in <em>Plessy v. Ferguson</em> in 1896 that states could use race as a basis to govern, so long as they did so equally. This is the separate-but-equal jurisprudence. In 1954, in <em>Brown v. Board of Education</em>, that jurisprudence was reversed when the court ruled that separate is inherently unequal.</p>\n<p>Without saying so directly, the post-<em>Brown</em> federal jurisprudence has assumed as an underlying principle that the mandate of the amendment is to eradicate race from the states’ armaments of governance.</p>\n<p>There is no federal Equal Protection Clause. Yet, the Civil Rights Act of 1964 purported to abolish all use of race in government, public accommodations, housing, and workplaces, on public and on private property; the latter, a massive assault on property rights, the former, a rational understanding of the Fourteenth Amendment.</p>\n<p>Since 1964, most states have enacted their own laws against racial discrimination, which basically mimic the federal laws and continue to prohibit government from using race as a basis for any decisions and continuing the assault on private property rights.</p>\n<p>Today, nearly all colleges and universities use race as an admissions factor. According to their own public statements, they believe that they are serving a societal good and advancing the public policy of the United States by assuring a racially diverse makeup of all incoming classes and by compensating for past egregious racial wrongs.</p>\n<p>To their point, the Supreme Court, in an absurdly reasoned 2003 opinion, generally accepted these goals and employed them to trump the Fourteenth Amendment, but only until 2028. Why 2028? Because Justice Sandra Day O’Connor, who wrote the opinion, opined that in the twenty-five years following her opinion, race relations in the United Stated will have so improved that racial quotas in college admissions will not be a public issue. How wrong she was!</p>\n<p>In Supreme Court history, this is the only case in which the court put a time limit on the duration of its ruling. Yet, it is a basic principle of constitutional law that if something was unconstitutional yesterday, it will be unconstitutional tomorrow and thereafter.</p>\n<p>Notwithstanding this lamentable history and the contorted judicial lens through which it all comes to us, a group of libertarian-leaning college students and professors have challenged the use of racial quotas in university admission policies by suing Harvard University, the nation’s oldest private university, and the University of North Carolina, the nation’s oldest public university.</p>\n<p>Harvard, though private, accepts federal aid directly and indirectly and thereby has agreed to comply with federal nondiscrimination standards. UNC is owned by the state of North Carolina and thus is directly bound by the Fourteenth Amendment.</p>\n<p>Earlier this past week, the Supreme Court devoted five hours to oral argument on these two cases, but not before the feds jumped in. Surprisingly, the Biden Department of Justice entered the case in behalf of the plaintiffs, arguing for the purest view of the Fourteenth Amendment—that it prohibits all state-owned or federally assisted institutions from racial discrimination.</p>\n<p>One embarrassing moment emerged during the oral argument when the solicitor general, who had just attacked Harvard and UNC, tried to justify the use of racial quotas by West Point, Annapolis, the Air Force Academy and the Coast Guard Academy. She resorted to the feds’ favorite shibboleth and claimed that military racial quotas were a matter of national security. The court—even its liberal membership—was unimpressed.</p>\n<p>After 150 years of slavery and 150 years of Jim Crow, America can’t shake its racial demons. All these problems were caused by governments that treated persons as chattel and enslaved and suppressed the African race. Then the problems were exacerbated when the feds thought they could regulate private property while failing to regulate their own. Throughout all this, countless folks of all races suffered at the hands of government trying to right past wrongs and socially engineer the future.</p>\n<p>The government needs to stay chained down to the Constitution. That means it must be color-blind, stay off of private property and comply with the legal principles it imposes on the rest of us.</p>\n<p>Harvard can do what it wants on its own lands, and the feds should stay off of them. It is richer than the federal government; it doesn’t need and shouldn’t receive a penny from taxpayers. Even if it were poor, there is simply no constitutional basis for taxpayer funding of private schools. UNC is directly bound by the Constitution, and it must be color-blind.</p>\n<p>All this came about by government telling folks how to live, spend their money, use their private property and plan for the future. This is the same government that lies, cheats, steals, kills, can’t deliver the mail, stop robo calls or fill potholes. When will we learn that that government is best which governs least?</p>\n<p>COPYRIGHT 2022 ANDREW P. NAPOLITANO</p>\n<p>DISTRIBUTED BY CREATORS.COM</p>\n\n",
  "author": "Judge Andrew P. Napolitano",
  "enclosure": "",
  "guid": 60868,
  "pubDate": "Thu, 03 Nov 2022 05:00:00 -0500",
  "source": "Mises Wire"
}