{
  "title": "Episode 47: The Little Albert Study: What You Know is...Mostly Wrong",
  "pubDate": "Wed, 20 Feb 2008 11:50:42 +0000",
  "guid": "episode-47-the-little-albert-study-what-you-kno",
  "link": "http://www.thepsychfiles.com/2008/02/19/episode-47-the-little-albert-study-what-you-know-ismostly-wrong/",
  "itunes:image": "",
  "description": "Think you know a lot about the little Albert experiment conducted by John Watson?  Well, guess what - you'd be surprised at how much of the story is simply not true.  If you're wondering whatever happened to little Albert, whether the little Albert study created a lasting phobia in a small boy, or even what place this story has in the history of behaviorism, then I suggest you take a listen to this episode of The Psych Files and get the facts on this fascinating part of psychology's history.",
  "content:encoded": "Think you know a lot about the little Albert experiment conducted by John Watson?  Well, guess what - you'd be surprised at how much of the story is simply not true.  If you're wondering whatever happened to little Albert, whether the little Albert study created a lasting phobia in a small boy, or even what place this story has in the history of behaviorism, then I suggest you take a listen to this episode of The Psych Files and get the facts on this fascinating part of psychology's history.",
  "enclosure": "",
  "itunes:duration": "19:02",
  "itunes:explicit": false,
  "itunes:keywords": "psychology,behaviorism",
  "itunes:subtitle": "Think you know a lot about the little Albert experiment conducted by John Watson? Well, guess what - you'd be surprised at how much of the story is simply not true.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Think you know a lot about the little Albert experiment conducted by John Watson? Well, guess what - you'd be surprised at how much of the story is simply not true. If you're wondering whatever happened to little Albert, whether the little Albert study created a lasting phobia in a small boy, or even what place this story has in the history of behaviorism, then I suggest you take a listen to this episode of The Psych Files and get the facts on this fascinating part of psychology's history."
}