{
  "id": "tag:blogger.com,1999:blog-4371296950668142214.post-3753361335349284129",
  "published": "2021-03-17T00:00:00.000+11:00",
  "updated": "2021-03-17T07:41:52.227+11:00",
  "category": [
    "",
    "",
    ""
  ],
  "title": "Meet the new Nest Hub",
  "content": "Introducing the second-generation Nest Hub! Since we launched Google’s first smart display two years ago, it’s brought help to thousands of homes and we’ve been dedicated to exploring ways to make our devices even more helpful.&nbsp;<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-aXKEhF8I3L0/YFBKnRNQsII/AAAAAAAACxY/5l8ZXBSvgKoxzDzp_M4babYB4-3YFmLtwCLcBGAsYHQ/s2008/Screen%2BShot%2B2021-03-16%2Bat%2B5.04.55%2Bpm.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1566\" data-original-width=\"2008\" height=\"313\" src=\"https://1.bp.blogspot.com/-aXKEhF8I3L0/YFBKnRNQsII/AAAAAAAACxY/5l8ZXBSvgKoxzDzp_M4babYB4-3YFmLtwCLcBGAsYHQ/w400-h313/Screen%2BShot%2B2021-03-16%2Bat%2B5.04.55%2Bpm.png\" width=\"400\" /></a></div><div><br /></div><div><b>The Nest Hub you love, but better&nbsp;</b></div><div>The new Nest Hub’s speaker is based on the same audio technology as Nest Audio and has 50 percent more bass than the original Hub for a bigger, richer sound to fill any room with music, podcasts or audiobooks from services like YouTube Music and Spotify — or enjoy your favourite TV shows and movies with a subscription from providers like Netflix, Disney+ and Stan. With Quick Gestures, you can pause or play content at any time by tapping the air in front of your display.&nbsp;</div><div>The new Nest Hub shows all your compatible connected devices in one place so you can control them with one tap. And with a built-in Thread radio, Nest Hub will work with the new connectivity standard being created by the <a href=\"https://www.blog.google/products/google-nest/developing-standard-smart-home-industry/\">Project Connected Home over IP</a> working group, making it even simpler to control your connected home.&nbsp;</div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/--ApUXjoQrcY/YFBJiC-3WII/AAAAAAAACxQ/UXBbS6CWeuc7Eicdm9p5fpV5NAti6uX8gCLcBGAsYHQ/s480/Animated%2BGIF-downsized_large.gif\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"270\" data-original-width=\"480\" height=\"225\" src=\"https://1.bp.blogspot.com/--ApUXjoQrcY/YFBJiC-3WII/AAAAAAAACxQ/UXBbS6CWeuc7Eicdm9p5fpV5NAti6uX8gCLcBGAsYHQ/w400-h225/Animated%2BGIF-downsized_large.gif\" width=\"400\" /></a></div><div><br /></div><div>Nest Hub is also full of help for your busy family. See your calendar, set timers, and create reminders with Family Notes, digital sticky notes to share chores and to-dos so everyone stays on track.&nbsp;</div><div><br /></div><div><br /></div><div><b>New sleep features for better rest&nbsp;</b></div><div>The Nest Hub has always helped you tackle the day; now, it can help you rest well at night. Many of us don’t get enough sleep, which is becoming the number one concern for adults when it comes to health and wellness.&nbsp;</div><div>As people have started to recognise the need for better sleep, sleep trackers have continued to become a popular solution. But we wanted to offer an alternative way for people who may not want to wear something to bed to understand their sleep.&nbsp;</div><div>We dug into the data, and because we also knew people felt comfortable with Nest Hub at their bedsides thanks to its camera-free design, we went to work. The result is <a href=\"http://blog.google/products/google-nest/new-nest-hub-soli\">Sleep Sensing</a>, an opt-in feature to help you understand and improve your sleep — and is available as a free preview until next year.&nbsp;</div><div>Sleep Sensing is completely optional with privacy safeguards in place so you’re in control: You choose if you want to enable it and there's a visual indicator on the display to let you know when it’s on. Motion Sense only detects motion, not specific bodies or faces, and your coughing and snoring audio data is only processed on the device — it isn’t sent to Google servers. You have multiple controls to disable Sleep Sensing features, including a hardware switch that physically disables the microphone. You can review or delete your sleep data at any time, and consistent with our <a href=\"https://store.google.com/us/magazine/google_nest_privacy\">privacy commitments</a>, it isn't used for personalised ads.&nbsp;</div><div>Even if you choose not to enable Sleep Sensing, you can still fall asleep and wake up easier with Nest Hub. The display dims to make your bedroom more sleep-friendly, and the “Your evening” page helps you wind down at night with relaxing sounds. When it’s time to wake up, Nest Hub’s Sunrise Alarm gradually brightens the display and increases the alarm volume. If you need a few more ZZZs, use Motion Sense to wave your hand and snooze the alarm.&nbsp;</div><div><br /></div><div><br /></div><div><b>Sustainable design that matches any room</b>&nbsp;</div><div>The new Nest Hub will be available to Australians in two colours, to complement most rooms in the house: Chalk and Charcoal. It features an edgeless glass display that’s easy to clean and makes your Nest Hub an even more beautiful digital photo frame. And <a href=\"https://blog.google/outreach-initiatives/sustainability/hardware-sustainability-commitments/\">continuing our commitment to sustainability</a>, Nest Hub is designed with recycled materials with its plastic mechanical parts containing 54 percent recycled post-consumer plastic.&nbsp;</div><div><br /></div><div>The second-generation Nest Hub is $149. It can be preordered online in Australia at the Google Store and other retailers from today.   <span data-about-syndication=\"\" style=\"display: none; font-size: 0px; line-height: 0; max-height: 0px; overflow: hidden;\"> <!--INSTRUCTIONS   In order to support google.com/about site blog syndication, fill in the info below (after the example). Leave elements empty if there is no valid data.    Example:   <span class=\"post-image\">http://1.bp.blogspot.com/-mX0dxJxp8dg/Vo8MSdxypWI/AAAAAAAARsI/EjaFhvgAEgc/s1600/Beutler_Google_Giftwrap_-v2TW.png</span>  <span class=\"post-author-name\">Abbi Tatton</span>  <span class=\"post-author-title\">Editorial Elf</span>  <span class=\"post-author-team\">Google</span>--> <span class=\"post-image\"></span><span class=\"post-author-name\"></span><span class=\"post-author-title\"></span><span class=\"post-author-team\"></span></span></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "anzprteam",
    "uri": "http://www.blogger.com/profile/06099752084931732403",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}