{
  "title": "Court Tells Florida Town That Law Forbidding Resident&#8217;s &#8216;Fuck Trump&#8217; Sign Is Unconstitutional",
  "link": "https://www.techdirt.com/2022/11/04/court-tells-florida-town-that-law-forbidding-residents-fuck-trump-sign-is-unconstitutional/",
  "comments": "https://www.techdirt.com/2022/11/04/court-tells-florida-town-that-law-forbidding-residents-fuck-trump-sign-is-unconstitutional/#comments",
  "dc:creator": "Tim Cushing",
  "pubDate": "Fri, 04 Nov 2022 19:48:43 +0000",
  "category": [
    1,
    "1st amendment",
    "andrew sheets",
    "florida",
    "obscenity",
    "obscenity laws",
    "punta gorda"
  ],
  "guid": "https://www.techdirt.com/?p=380987&#038;preview=true&#038;preview_id=380987",
  "description": "Welcome to America! Fuck everything! And not in the sexual sense, as any person would immediately understand unless, of course, they just want to hit people with criminal charges for maximizing the use of limited space to criticize the government. Local governments tend to get pretty weird about &#8220;community standards&#8221; and &#8220;protecting children,&#8221; something that [&#8230;]",
  "content:encoded": "<p>Welcome to America! Fuck everything! And not in the sexual sense, as any person would immediately understand unless, of course, they just want to hit people with criminal charges for maximizing the use of limited space to criticize the government. </p>\n<p>Local governments tend to get pretty weird about &#8220;community standards&#8221; and &#8220;protecting children,&#8221; something that can possibly be chalked up to &#8220;thinking locally&#8221; rather than recognizing the baseline set by the US Constitution and its amendments, particularly the first of those amendments.</p>\n<p>We&#8217;ve seen dubious actions catering to each side of the political aisle. In Texas, <a href=\"https://www.techdirt.com/2018/10/10/texas-cops-seize-anti-gop-sign-homeowners-lawn/\" data-type=\"URL\" data-id=\"https://www.techdirt.com/2018/10/10/texas-cops-seize-anti-gop-sign-homeowners-lawn/\">cops decided to seize</a> a sign critical of the Republican party from a person&#8217;s yard under the theory the picture might offend children. (That it depicted the Republican elephant slipping its trunk under the skirt of a child in response to allegations against GOP Senate candidate Roy Moore for taking sexual liberties with minors went unmentioned in the city&#8217;s response.)</p>\n<p>On the other side, <a href=\"https://www.techdirt.com/2021/07/20/judge-ignores-first-amendment-misreads-town-law-while-ordering-resident-to-remove-fuck-biden-signs/\" data-type=\"URL\" data-id=\"https://www.techdirt.com/2021/07/20/judge-ignores-first-amendment-misreads-town-law-while-ordering-resident-to-remove-fuck-biden-signs/\">a New Jersey municipal judge</a> decided the First Amendment didn&#8217;t protect a home owner who placed anti-Joe Biden signs and flags in her yard, including the ever-popular phrase &#8220;Fuck Biden.&#8221; The local judge arrived at this conclusion by ignoring the obvious definition of the phrase to suggest it had something to do with actually engaging in sexual congress with the sitting president, which of course might be tough to explain to children.</p>\n<p>Fortunately, the First Amendment is getting more respect in, of all places, Punta Gorda, Florida. As reported by Eugene Volokh, <a href=\"https://reason.com/volokh/2022/10/24/court-strikes-down-ban-on-displaying-indecent-speech-where-children-under-17-can-see-it/\" data-type=\"URL\" data-id=\"https://reason.com/volokh/2022/10/24/court-strikes-down-ban-on-displaying-indecent-speech-where-children-under-17-can-see-it/\">a judge recently declared the city&#8217;s obscenity law</a> &#8212; the one that led to criminal citations for &#8220;Fuck Trump,&#8221; &#8220;Fuck Policing 4 Profit,&#8221; and &#8220;Fuck Biden&#8221; signs and flags displayed by resident Andrew Sheets &#8212; unconstitutional. For these so-called crimes, Sheets was fined $2500. He sued. And he has won.</p>\n<p>The opening of the Florida circuit court <a href=\"https://s3.documentcloud.org/documents/23227674/sheetsvpuntagorda.pdf\" data-type=\"URL\" data-id=\"https://s3.documentcloud.org/documents/23227674/sheetsvpuntagorda.pdf\">opinion</a> [PDF] makes it clear the city (seemingly deliberately) misread the law to target protected expression. That the intention of the law is to protect children makes no difference. </p>\n<blockquote class=\"wp-block-quote\">\n<p><em>The City of Punta Gorda has embarked upon the task of protecting children. The record makes clear that city adopted the ordinance in hopes of advancing that goal. Punta Gorda argues that the ordinance is limited as it only applies to signs in public places which can be seen by children. In actual fact, that is no limitation at all.</em></p>\n<p><em>As is relevant to this case, the ordinance bans signs that depict or describe sexual activities or organs. Fuck or Cunt can be about sex or not about sex, Sheets used Fuck as an interjection. By its express terms, the ordinance does not apply to the use of Fuck as an interjection. Sheets&#8217; items used Fuck to emphasize the passion and force of his political opinion and his use of the word had nothing to do with sex. The use of R Cunts is arguably within the express terms of the ordinance. But is similarly used as a political statement, not a reference to the sexual organ. </em></p>\n<p><em>By applying the rules of constitutional avoidance, by its plain terms, the ordinance does not apply to Sheets&#8217; Items as they have nothing to do with sexual activities or organs.</em></p>\n</blockquote>\n<p>The court cites a couple of extremely relevant bits of Supreme Court precedent, the latter of which has received <a href=\"https://www.techdirt.com/2021/06/24/fuck-this-cheer-particular-says-supreme-court-decision-upholding-students-free-speech-rights/\" data-type=\"URL\" data-id=\"https://www.techdirt.com/2021/06/24/fuck-this-cheer-particular-says-supreme-court-decision-upholding-students-free-speech-rights/\">plenty of coverage</a> here at Techdirt. </p>\n<blockquote class=\"wp-block-quote\">\n<p><em>Although factually different in some respects, this case is squarely within the reasoning of Cohen v. California (Fuck the Draft jacket case) and the distinction between a criminal charge and a civil fine provides no basis to uphold the ordinance in this case.</em></p>\n<p><em>[&#8230;]</em></p>\n<p><em>Given the most recent cases involving First Amendment challenges (Mahanoy, &#8220;Fuck school, Fuck cheerleading&#8221; case) and (Reed, municipal sign case) there can be little question that the U.S. Supreme Court jurisprudence has moved toward more protection for speech, not less.</em></p>\n</blockquote>\n<p>The city, on the other hand, offered very little in terms of Supreme Court precedent in defense of its ordinance and its actions. Instead, it offered perhaps the weakest &#8220;for the children&#8221; argument possible.</p>\n<blockquote class=\"wp-block-quote\">\n<p><em>In this case Punta Gorda argues only one compelling governmental interest: protection of children, specifically, only children that can read.</em></p>\n</blockquote>\n<p>That there are limited beneficiaries isn&#8217;t enough to make an attempt at speech regulation &#8220;narrowly tailored.&#8221; The court says the law is wrong in both directions.</p>\n<blockquote class=\"wp-block-quote\">\n<p><em>The ordinance is under inclusive and over inclusive. The ordinance prohibits speech that the record reflects was never seen by children. Punta Gorda claims that the limitation to places where children under 17 may see the signs is a narrow limitation. It is not. Children may be present anywhere in Punta Gorda and therefore that term is no limitation at all. The ordinance does not prohibit use of verbal indecency and that is a means of communication that many more children could understand.</em></p>\n</blockquote>\n<blockquote class=\"wp-block-quote\">\n<p><em>The Punta Gorda ordinance is overbroad as it was actually designed to cause the preemptive self-silencing of speakers whose messages are entitled to constitutional protection. See, Reno v. ACLU, 521 U.S. 844 (1997). Whether termed vague or overbroad, the ordinance fails for the same reasons as the Statute in Reno.</em></p>\n</blockquote>\n<p>Good try, says the court, but the Punta Gorda ordinance has to go.</p>\n<blockquote class=\"wp-block-quote\">\n<p><em>In sum, Punta Gorda&#8217;s municipal heart is in the right place but there does not appear to be a constitutionally valid way to protect children from seeing (or displaying!) political signs with the word.</em></p>\n</blockquote>\n<p>That&#8217;s how the Constitution works. The way Punta Gorda imagined it worked solely for the purpose of shutting down a critic of all things government (and one imagines it was probably the criticized police that objected most given Sheets directed fucks at both Biden and Trump) is no longer an option for the city.</p>\n<p>And there&#8217;s even better news: <a href=\"https://www.yoursun.com/puntagorda/news/punta-gorda-wont-appeal-freedom-of-speech-case/article_20a3d358-53d2-11ed-9295-4b49a04dff5e.html\" data-type=\"URL\" data-id=\"https://www.yoursun.com/puntagorda/news/punta-gorda-wont-appeal-freedom-of-speech-case/article_20a3d358-53d2-11ed-9295-4b49a04dff5e.html\">Punta Gorda is not going to waste any more of its residents&#8217; money</a> to argue against their interests. The city will not be appealing this decision. There are a few city officials who still believe this decision (and the decades of court precedent at all levels backing it) is wrong, but have decided it&#8217;s not worth an unknown amount of future expense to continue trying to punish one person for speech some city officials objected to.</p>\n",
  "wfw:commentRss": "https://www.techdirt.com/2022/11/04/court-tells-florida-town-that-law-forbidding-residents-fuck-trump-sign-is-unconstitutional/comments/feed/",
  "slash:comments": 11
}