{
  "id": "https://bibleinoneyear.org/en/youth/305",
  "title": "Day 305: Fix Your Thoughts",
  "description": "Psalm 119:137-143, Joel 2:12-13, Hebrews 3:1-13.  However, you can see in these same scriptures that the secret to dealing with these is to ‘*fix your thoughts* on Jesus’ (v 1)",
  "pubDate": "Tue, 01 Nov 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/305/",
  "itunes:duration": "14:03",
  "guid": "enyouth01112022-305",
  "length": 843.78,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 305: Fix Your Thoughts",
  "itunes:subtitle": "Psalm 119:137-143, Joel 2:12-13, Hebrews 3:1-13.  However, you can see in these same scriptures that the secret to dealing with these is to ‘*fix your thoughts* on Jesus’ (v 1)",
  "itunes:summary": "When the British people are asked who the greatest Briton of all time was, Sir Winston Churchill usually tops the poll. If you were to ask an American who the greatest American was, they might reply George Washington or Abraham Lincoln. If you asked a Jew at the start of the first century AD who the greatest Jew was, without a doubt they would have said ‘Moses’. Moses was the supreme figure of their history. He had rescued them from slavery and given them the Law.\nThe writer of Hebrews describes to Jewish Christians how Jesus is greater than Moses. His argument is that, in spite of the greatness of Moses, Jesus is in a completely different league. Jesus is the ‘centrepiece of everything we believe’ (Hebrews 3:1, MSG); ‘he has been found worthy of honour greater than Moses, just as the builder of a house has greater honour than the house itself’ (v.3). ‘Moses was faithful as a servant’ (v.5); ‘Christ is faithful as a Son over God’s house’ (v.6).\nThe themes for today’s passages are trouble and distress, testing times, and trials and tribulations. However, you can see in these same scriptures that the secret to dealing with these is to ‘fix your thoughts on Jesus’ (v.1).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 670
}