{
  "title": "Becoming Michael Phelps | Tony talks to the greatest Olympian of all time about the art of the comeback, what it means to win, and the power of pushing through",
  "pubDate": "Mon, 01 Apr 2019 21:14:22 +0000",
  "guid": "3d36a8f3ecb742b1b9944f3cf791a6e3",
  "link": "https://tonyrobbins.libsyn.com/becoming-michael-phelps-tony-talks-to-the-greatest-olympian-of-all-time-about-the-art-of-the-comeback-what-it-means-to-win-and-the-power-of-pushing-through",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Having won 28 medals, Michael Phelps is the most decorated Olympian in history. He has trained and competed at the highest levels of elite swimming, has broken world records, and forged a lifelong career unrivaled by any other. Even after he announced his retirement in 2012, he made a valiant comeback in 2016 at the Rio de Janeiro Olympics, where he won five</span> <em><span style=\"font-weight: 400;\">more</span></em> <span style=\"font-weight: 400;\">gold medals to bring him up to a remarkable 23 first-place finishes.</span></p> <p><span style=\"font-weight: 400;\">Today on the The Tony Robbins Podcast, you are about to hear from this legendary athlete, as he and Tony have a one-on-one interview at Tony’s private home, as part of a small event held for his Platinum Partners. You’ll hear Michael Phelps, who shares with the groups how he came to dominate the sport of swimming –</span> <em><span style= \"font-weight: 400;\">and</span></em> <span style= \"font-weight: 400;\">the setbacks he faced along the way. You’ll also hear from snowboarder Shaun White was also there, so you’ll hear a bit from him towards the end. (You can hear Shaun’s full interview right here</span><span style=\"font-weight: 400;\"> on the podcast, a few episodes back).</span></p> <p><span style=\"font-weight: 400;\">Michael has trained and competed in the swimming pool for the vast majority of his life. He made his Olympic debut at just 15 years old, and he spent the next 16 years mastering the sport through hard work and determination, intense focus, and an</span> <em><span style= \"font-weight: 400;\">unwavering</span></em> <span style= \"font-weight: 400;\">trust in his long-time coach, Bob Bowman. Touted as one of the greatest coach-athlete partnerships in the history of swimming, Michael opens up to Tony about his</span> <em><span style=\"font-weight: 400;\">unbreakable</span></em> <span style=\"font-weight: 400;\">relationship with Bob – who not only molded him into at supreme athlete, but who</span> <em><span style=\"font-weight: 400;\">also</span></em> <span style= \"font-weight: 400;\">played an essential role in his emotional upbringing.</span></p> <p><span style=\"font-weight: 400;\">But not everything for Michael Phelps has been paved with gold, and his rise to the top was not without a series of well-publicized stumbles. In this interview, he opens up about his own struggle with depression, which affects over 40 million people in the U.S., and takes a</span> <em><span style= \"font-weight: 400;\">particular</span></em> <span style= \"font-weight: 400;\">toll on Olympic athletes who are on a biochemical high during the games, and afterwards, return home feeling empty and directionless.</span></p> <p><span style=\"font-weight: 400;\">Now, Michael’s life is far different from what it once was. He’s a husband and father of two boys. He’s more patient. He spends time writing. He’s rekindling a relationship with his father. He’s not planning on another Olympic comeback – instead, he’s using his platform to help save lives through the Michael Phelps Foundation and his commitment to water safety and mental health programs and awareness. And as he shares with Tony, to him,</span> <em><span style= \"font-weight: 400;\">that’s</span></em> <span style= \"font-weight: 400;\">a comeback that’s bigger than winning an Olympic gold medal.</span></p>",
  "content:encoded": "<p>Having won 28 medals, Michael Phelps is the most decorated Olympian in history. He has trained and competed at the highest levels of elite swimming, has broken world records, and forged a lifelong career unrivaled by any other. Even after he announced his retirement in 2012, he made a valiant comeback in 2016 at the Rio de Janeiro Olympics, where he won five <em>more</em> gold medals to bring him up to a remarkable 23 first-place finishes.</p> <p>Today on the The Tony Robbins Podcast, you are about to hear from this legendary athlete, as he and Tony have a one-on-one interview at Tony’s private home, as part of a small event held for his Platinum Partners. You’ll hear Michael Phelps, who shares with the groups how he came to dominate the sport of swimming – <em>and</em> the setbacks he faced along the way. You’ll also hear from snowboarder Shaun White was also there, so you’ll hear a bit from him towards the end. (You can hear Shaun’s full interview right here on the podcast, a few episodes back).</p> <p>Michael has trained and competed in the swimming pool for the vast majority of his life. He made his Olympic debut at just 15 years old, and he spent the next 16 years mastering the sport through hard work and determination, intense focus, and an <em>unwavering</em> trust in his long-time coach, Bob Bowman. Touted as one of the greatest coach-athlete partnerships in the history of swimming, Michael opens up to Tony about his <em>unbreakable</em> relationship with Bob – who not only molded him into at supreme athlete, but who <em>also</em> played an essential role in his emotional upbringing.</p> <p>But not everything for Michael Phelps has been paved with gold, and his rise to the top was not without a series of well-publicized stumbles. In this interview, he opens up about his own struggle with depression, which affects over 40 million people in the U.S., and takes a <em>particular</em> toll on Olympic athletes who are on a biochemical high during the games, and afterwards, return home feeling empty and directionless.</p> <p>Now, Michael’s life is far different from what it once was. He’s a husband and father of two boys. He’s more patient. He spends time writing. He’s rekindling a relationship with his father. He’s not planning on another Olympic comeback – instead, he’s using his platform to help save lives through the Michael Phelps Foundation and his commitment to water safety and mental health programs and awareness. And as he shares with Tony, to him, <em>that’s</em> a comeback that’s bigger than winning an Olympic gold medal.</p>",
  "enclosure": "",
  "itunes:duration": "39:27",
  "itunes:explicit": false,
  "itunes:keywords": "Michael,health,gold,bob,mental,tony,Medal,swimming,Olympics,robbins,phelps,Bowman",
  "itunes:subtitle": "Having won 28 medals, Michael Phelps is the most decorated Olympian in history. He has trained and competed at the highest levels of elite swimming, has broken world records, and forged a lifelong career unrivaled by any other. Even after he announced...",
  "itunes:episodeType": "full"
}