{
  "title": "News from the Sahel, with Alex Thurston",
  "description": "<p>Returning champion and <em>Foreign Exchanges</em> contributor Alex Thurston is here to discuss the apparent, though not yet totally confirmed, death of Boko Haram leader Abubakar Shekau and what it means for Nigeria. We’ll discuss Shekau’s role in Boko Haram’s rise and development, his notorious reputation, and what his (probable) death means for the rivalry between his branch of Boko Haram and the Islamic State West Africa Province, which very publicly split with Shekau in 2016. We’ll also spend some time talking about the overall deterioration in Nigeria’s internal security as well as the recent “coup-within-a-coup” in Mali and what that may portend for the future of civilian governance in Bamako.</p><p>For those who aren’t familiar, Alex is assistant professor of political science at the University of Cincinnati whose writing has appeared in numerous places, including here at <em>Foreign Exchanges</em>. His most recent piece looked at the implications of Shekau’s apparent death over at <em>Lawfare</em>. He is the author of three books: <em>Boko Haram: The History of an African Jihadist Movement</em>, <em>Salafism in Nigeria: Islam, Preaching, and Politics</em>, and most recently <em>Jihadists of North Africa and the Sahel</em>. You can also find him on <a target=\"_blank\" href=\"https://twitter.com/sahelblog\">Twitter</a>.</p> <br/><br/>This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit <a href=\"https://fx.substack.com/subscribe?utm_medium=podcast&utm_campaign=CTA_2\">fx.substack.com/subscribe</a>",
  "link": "https://fx.substack.com/p/news-from-the-sahel-with-alex-thurston",
  "guid": "substack:post:37131103",
  "dc:creator": "Derek Davison and Alex Thurston",
  "pubDate": "Wed, 02 Jun 2021 18:11:05 GMT",
  "enclosure": "",
  "itunes:author": "Derek Davison and Alex Thurston",
  "itunes:explicit": "No",
  "itunes:duration": 3926,
  "itunes:image": ""
}