{
  "title": "When Do Informational Interventions Work? Experimental Evidence from New York City High School Choice",
  "link": "https://fedinprint.org/item/fedmoi/93794/original",
  "description": "This paper reports the results of a large, school-level randomized controlled trial evaluating a set of three informational interventions for young people choosing high schools in 473 middle schools, serving over 115,000 8th graders. The interventions differed in their level of customization to the student and their mode of delivery (paper or online); all treated schools received identical materials to scaffold the decision-making process. Every intervention reduced likelihood of application to and enrollment in schools with graduation rates below the city median (75 percent). An important channel is their effect on reducing nonoptimal first choice application strategies. Providing a simplified, middle-school specific list of relatively high graduation rate schools had the largest impacts, causing students to enroll in high schools with 1.5-percentage point higher graduation rates. Providing the same information online, however, did not alter students’ choices or enrollment. This appears to be due to low utilization. Online interventions with individual customization, including a recommendation tool and search engine, induced students to enroll in high schools with 1-percentage point higher graduation rates, but with more variance in impact. Together, these results show that successful informational interventions must generate engagement with the material, and this is possible through multiple channels.",
  "guid": "https://fedinprint.org/item/fedmoi/93794/original",
  "dc:creator": "Sattin-Bajaj, Carolyn; Corcoran, Sean P.; Jennings, Jennifer; Cohodes, Sarah",
  "dc:date": "2022-02-01",
  "dc:subject": "Informational interventions; Inequality; Decision-making; School choice",
  "swpo:hasNumber": 57,
  "identifiers:doi": "10.21034/iwp.57",
  "bibo:series": "Opportunity and Inclusive Growth Institute Working Papers"
}