{
  "title": "EPISODE 29 I Drink and I Know Things (Where History and Game of Thrones Intersect)",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Thu, 18 Jan 2018 12:00:00 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2018/1/11/episode-29-i-drink-and-i-know-things-where-history-and-game-of-thrones-intersect",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5a578b74419202b169ae0d2d",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1515686838332-VWUR2F016I8TXNQJT8QW/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"5a578bb053450ad10268750a\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1515686838332-VWUR2F016I8TXNQJT8QW/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“No matter how much I make up, there’s stuff in history that’s just as bad, or worse.” —</em> George R.R. Martin</p><p class=\"\"><em>“Though I would treasure your friendship, I am mainly interested in your facility with murder” —</em> Tyrion Lannister</p><p class=\"\"><em>“That’s what I do. I drink and I know things.” —</em> Tyrion Lannister</p><p class=\"\"><em>“If we don’t put aside our enmities and band together, we will die. And then it doesn’t matter whose skeleton sits on the Iron Throne.” —</em> Ser Davos Seaworth</p><p class=\"\">“Now, I’m sure cutting off heads is very satisfying, but that’s not the way you get people to work together.” — Sansa Stark&nbsp;</p><p class=\"\">I always say that history is really no different from Game of Thrones (minus the dragons). The passion, brutality, the joys and heartbreak, human greatness and human pettiness… it’s all there. And as it turns out the connection between history and the world created by George R.R. Martin’s run deep. In this episode, I am joined by Aziz Al-Doory from The History of Westeros Podcast, and together we discuss some (definitely not all) of the ways in which history has influenced Game of Thrones. In this episode we’ll tackle: The Wall & Hadrian’s Wall, flaying, human sacrifice, feeding enemies to dogs, Agamemnon and Stannis Baratheon, parallels with the Bible, the Dothraki and nomadic steppe peoples, execution by molten gold, the real life examples of the High Sparrow, the walk of shame, the inquisition, the Red Wedding, the siege of Constantinople & the battle of Blackwater Bay, and much more.</p><p class=\"\">This episode is sponsored by <a href=\"http://getthewatch.net\" target=\"_blank\">Vincero</a>. If you like it when high quality watches and affordable prices go together, check out getthewatch.net and use the code HISTORY for a 15% discount&nbsp;</p><p class=\"\">This episode is sponsored by <a href=\"http://www.flaviar.com/exclusive\" target=\"_blank\">Flaviar</a>, the world’s largest online club of spirits enthusiasts. Members get a themed tasting box that let you try different spirits before buying a full sized bottle, and access to their Vault which holds a selection of rare and hard to find spirits available to members only. Please, check them out and use the coupon code HISTORY at checkout.&nbsp;</p><p class=\"\">This episode is sponsored by <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a> For less than $ 10 per meal, Blue Apron delivers straight to your door seasonal recipes along with pre-portioned ingredients to make delicious, home-cooked meals. Get $ 30 off your first order—with free shipping—by going to <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a>&nbsp;</p><p class=\"\">Please, also show some love to my regular sponsors by shopping for supplements, special foods, clothing and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;</p><p class=\"\">And if you are in the market for backpacks, computer bags and other hemp gear, check out my favorites at <a href=\"http://www.dsgear.com\">http://www.dsgear.com</a>&nbsp;</p><p class=\"\">PATREON NEWS: I have just started a Patreon account!!!! If you feel in a generous mood, please, check it out at <a href=\"http://www.patreon.com/historyonfire\">www.patreon.com/historyonfire</a>&nbsp;</p><p class=\"\">My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>. Thank you to Onnit, Datsusara, Float Clinic, Shaman’s Simple Solutions, War Fuel, Proven Nutrition, and Fight Chix for sponsoring her for her first MMA fight. If you’d like to check out Fight Chix merchandise, you can get a 20% discount by going to <a href=\"http://www.fightchix.com/\">http://www.fightchix.com/</a> and entering the code Fire20 upon checkout.</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "02:21:46",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 29,
  "itunes:title": "EPISODE 29 I Drink and I Know Things (Where History and Game of Thrones Intersect)",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 29 I Drink and I Know Things (Where History and Game of Thrones Intersect)"
  }
}