{
  "title": "Design of plasma shutters for improved heavy ion acceleration by ultra-intense laser pulses. (arXiv:2205.06088v2 [physics.plasm-ph] UPDATED)",
  "link": "http://arxiv.org/abs/2205.06088",
  "description": "<p>In this work, we investigate the application of the plasma shutters for heavy\nion acceleration driven by a high-intensity laser pulse. We use\nparticle-in-cell (PIC) and hydrodynamic simulations. The laser pulse,\ntransmitted through the opaque shutter, gains a steep-rising front and its peak\nintensity is locally increased at the cost of losing part of its energy. These\neffects have a direct influence on subsequent ion acceleration from the\nultrathin target behind the shutter. In our 3D simulations of silicon nitride\nplasma shutter and a silver target, the maximal energy of high-Z ions increases\nsignificantly when the shutter is included for both linearly and circularly\npolarized laser pulses. Moreover, application of the plasma shutter for\nlinearly polarized pulse results in focusing of ions towards the laser axis in\nthe plane perpendicular to the laser polarization. The generated high energy\nion beam has significantly lower divergence compared to the broad ion cloud,\ngenerated without the shutter. The effects of prepulses are also investigated\nassuming a double plasma shutter. The first shutter can withstand the assumed\nsub-ns prepulse (treatment of ns and ps prepulses by other techniques is\nassumed) and the pulse shaping occursvia interaction with the second shutter.\nOn the basis of our theoretical findings, we formulated an approach towards\ndesigning a double plasma shutter for high-intensity and high-power laser\npulses and built a prototype.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Matys_M/0/1/0/all/0/1\">M. Matys</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Bulanov_S/0/1/0/all/0/1\">S. V. Bulanov</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Kucharik_M/0/1/0/all/0/1\">M. Kucharik</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Jirka_M/0/1/0/all/0/1\">M. Jirka</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Nikl_J/0/1/0/all/0/1\">J. Nikl</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Kecova_M/0/1/0/all/0/1\">M. Kecova</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Proska_J/0/1/0/all/0/1\">J. Proska</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Psikal_J/0/1/0/all/0/1\">J. Psikal</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Korn_G/0/1/0/all/0/1\">G. Korn</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Klimo_O/0/1/0/all/0/1\">O. Klimo</a>"
}