{
  "title": "Episode 87: &#8220;Apache&#8221; by the Shadows",
  "link": "https://500songs.com/podcast/episode-87-apache-by-the-shadows/",
  "pubDate": "Tue, 23 Jun 2020 19:51:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=451",
  "description": "<p>Episode eighty-seven of A History of Rock Music in Five Hundred Songs looks at \"Apache\", by the Shadows, and at the three years in which they and Cliff Richard were on top of the music world. Patreon backers also have a fifteen-minute bonus episode, <a href=\"https://www.patreon.com/posts/38532000\">on \"Handy Man\" by Jimmy Jones</a>.</p>\n<p>My apologies for the lateness of this episode, which is due to my home Internet connection having been out for a week.</p>\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n<p><strong>Resources</strong></p>\n<p>As usual, I have put together <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-87-apache/\">a Mixcloud mix</a> with every song excerpted in this podcast.</p>\n<p><a href=\"https://amzn.to/31XL4rU\">This four-CD set</a> contains all the singles and EPs released by Cliff Richard and the Shadows, together and separately, between 1958 and 1962.</p>\n<p>Meanwhile,<a href=\"https://amzn.to/2zZr5Q0\"> this six-CD set</a> contains every recording the Shadows made on their own between 1959 and 1966, for a very low price.</p>\n<p><a href=\"https://amzn.to/2lqg8PS\">Pete Frame's The Restless Generation</a> is the best book available looking at British 50s rock and roll from a historical perspective. Be warned, though -- his jokey and irreverent style can, when dealing with people like Larry Parnes (who was gay and Jewish) very occasionally tip over into reinforcing homophobic and anti-semitic stereotypes for an easy laugh.</p>\n<p>Some of the information on Royston Ellis and Norrie Paramor comes from <a href=\"https://amzn.to/2XylQOW\">the extended edition of Mark Lewisohn's Tune In,</a> which is essential reading for anyone who is interested in the Beatles, British post-war culture, and British post-war music.</p>\n<p><a href=\"https://amzn.to/314nY4t\">This volume</a> contains Royston Ellis' two very slim books, one on Cliff and one on the Shadows, written for a teen audience in 1960 and 61. They are more of historical interest than anything else.</p>\n<p>And <a href=\"https://amzn.to/2SxaWaK\">Cliff Richard: The Biography by Steve Turner</a> is very positive towards Richard, but not at the expense of honesty.</p>\n<p> <strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/andrewhickey\">Why not join them?</a></p>\n<p><strong>Transcript</strong></p>\n<p>Today we're going to look at the group that, more than any other, made the guitar group the standard for rock music; the group which made the Fender Stratocaster the single most popular guitar in the world; and who dominated the British charts for much of the early 1960s.</p>\n<p>We're going to look at the Shadows:</p>\n<p>[Excerpt: The Shadows: \"Apache\"]</p>\n<p>We talked about Cliff Richard four months ago, but we've not yet looked at his backing group in any great detail. That's because his group at the time of \"Move It\", the single we looked at back then, was not the group that would end up becoming famous for backing him. We only mentioned in the last few minutes of that episode how his original backing band, the Drifters, were replaced one at a time by Hank Marvin, Bruce Welch, Jet Harris and Tony Meehan, most of whom had been members of the Vipers at one point or another during that group's commercial decline.</p>\n<p>This group, still calling themselves the Drifters, went into Abbey Road studios with Cliff in February 1959, to record Richard's first album -- a live album in front of a studio audience. The album was mostly made up of rather anaemic cover versions of American records, though drawing from a rather wider pool than one might expect -- as well as ballads like Ritchie Valens' \"Donna\" and rockabilly covers like \"Baby I Don't Care\" and \"That'll Be the Day\", there were also attempts at styles like Chicago blues, with a cover version of \"My Babe\", the song Willie Dixon had written for Little Walter:</p>\n<p>[Excerpt: Cliff Richard and the Drifters, \"My Babe\"]</p>\n<p>The album also featured two instrumentals by the Drifters, one of which was \"Jet Black\", named after Jet Harris, who was the de facto leader of the band at this time. Harris was a very experienced musician long before joining the group. He had played bass with Tony Crombie and the Rockets, the very first ever British rock and roll band, and Crombie had told him about a new instrument -- the electric bass guitar. Harris had obtained one, and seems to have been the very first British musician to play an electric bass. His bass was a signature of the band's early work, and it gets the spotlight in \"Jet Black\":</p>\n<p>[Excerpt: Cliff Richard and the Drifters, \"Jet Black\"]</p>\n<p>It was around this time that Hank Marvin ended up being the first British musician to play a solid-body electric guitar -- and a Fender Stratocaster at that.</p>\n<p>At the time we're talking about, there were import restrictions on many goods from America -- at the time, most economies were a lot more protectionist than they are these days, and the doctrine of free trade hadn't taken a foothold -- and so there were literally no American electric guitars in the UK, and there were no British manufacturers of them. Every British electric guitar player was playing a hollow-bodied guitar -- what we'd these days call a semi-acoustic or electro-acoustic guitar.</p>\n<p>But Cliff Richard was determined that his guitarist was going to have the best instrument. An instrument that was suitable for his music.</p>\n<p>While Cliff was portrayed as England's Elvis, and always credited Elvis as his inspiration, he had another favourite American singer, Ricky Nelson, whose softer style appealed to him, and was closer to the music that he ended up making:</p>\n<p>[Excerpt: Ricky Nelson, \"Poor Little Fool\"]</p>\n<p>Nelson's lead guitarist was James Burton, who Hank Marvin admired almost as much as Cliff admired Nelson. Burton had got his start playing on Dale Hawkins' \"Suzy Q\":</p>\n<p>[Excerpt: Dale Hawkins, \"Suzy Q\"]</p>\n<p>But at this point, as well as playing for Nelson, he was making a reputation as the best session guitarist on the West Coast of America -- so much of a reputation that even musicians in Britain knew his name. So it made sense that they should get Marvin the guitar that Burton played. They knew it was a Fender guitar, but they didn't know anything else, so they got themselves a Fender catalogue sent over from the US. Looking through it, they recognised one guitar, the Stratocaster, as being the one Buddy Holly played. It was also the most expensive, and the coolest-looking, so it must be the one that Burton played, right?</p>\n<p>As it turns out, Burton didn't play a Stratocaster, but a Telecaster, but they didn't know that until much later, and so Cliff Richard sent off the equivalent of several months' worth of Marvin's salary to have a Stratocaster shipped over and pay the import taxes.</p>\n<p>While they were waiting for it, though, there were records to be made -- and some of those records were ones that nobody involved was particularly interested in making.</p>\n<p>Cliff had started up a film career in parallel with his musical career. His first film was an attempt at an \"issue\" film, about teen pregnancy and false rape accusations, which featured him in a very minor role as a juvenile delinquent. In the film, he had to sing three songs written by Lionel Bart, who had written Tommy Steele's hits, and he didn't realise until afterwards that his film contract stipulated that one of them must be released as a single. The one that was chosen was \"Living Doll\".</p>\n<p>The problem was that Richard loathed the song. He thought it was an attempt at sounding like an American rock and roll record, but one that completely missed everything that made American rock and roll exciting. He flat-out refused to do it. And then Norrie Paramor came up with an ingenious scheme.</p>\n<p>Paramor was Richard's producer at EMI, and in a couple of years he became notorious in Britain when a jealous colleague, George Martin, leaked one of his scams to the TV presenter David Frost. Paramor would regularly write songs under pseudonyms, and get his artists to record them as B-sides, so he would get the same royalties from the record sales as the composer of the hit on the A-side. He apparently used thirty-six different pseudonyms, and was so widely known for this in the industry that people would sing of him \"Oh I Do Like To See Me On The B-Side\". Paramor earned enough money from his songwriting sideline that he owned a speedboat, a second home at the seaside, and an E-type Jag, while George Martin, ostensibly on the same salary, had a second-hand Mini.</p>\n<p>But for once, Paramor was going to be able to get the A-side to a single, and present it as doing his artist a favour. He explained to Richard that one way to be sure he'd never have to put out \"Living Doll\" as a single would be if he'd already put out a single with a similar name. So if, say, Paramor were to write him a song called \"Livin' Lovin' Doll\", then there'd be no way they could put out \"Living Doll\" -- and, if anyone had seen the film and *did* want \"Living Doll\", well, that would be free promotion for Paramor's song.</p>\n<p>\"Livin' Lovin' Doll\" went to number twenty on the charts:</p>\n<p>[Excerpt: Cliff Richard and the Drifters, \"Livin' Lovin' Doll\"]</p>\n<p>But, as it turned out, the contracts didn't say anything about only releasing a single if you didn't have a good reason not to. Cliff still had to release the song he'd sung in the film. But he decided he wasn't going to release that recording -- he was going to get the band to rearrange it into something that he could live with. The band members put their heads together, and decided that the song might work in a country direction, perhaps with a little of that Ricky Nelson soft-rock feel that Cliff liked. So, grudgingly, they recorded a slowed-down, acoustic version of \"Living Doll\".</p>\n<p>Which promptly became Cliff's first UK number one, as well as becoming a minor hit in the USA:</p>\n<p>[Excerpt: Cliff Richard and the Drifters, \"Living Doll\"]</p>\n<p>Meanwhile, the Drifters were doing some stuff on the sidelines by themselves, too, including backing a beat poet. British popular culture in the late 1950s and early 1960s was largely, if not solely, made up of poor imitations of American pop culture, usually without any understanding of what that culture was. The phrase \"cargo cult\" is one that reinforces a number of unpleasant stereotypes, and as far as I can tell the story on which the phrase is based is a gross misunderstanding, but if you imagine the cargo cult as it is popularly imagined, much of British pop culture was a cargo cult imitation of America, with signifiers yanked completely out of their contexts and placed in wholly new ones. The British musicians we've looked at so far have been the ones that were the most innovative, the least tied to their American inspirations, and yet I'm sure you've been able to detect even in them the sense that they were the ersatz version of the American rock stars, the Cheez-wizz to Elvis Presley's fine mature Stilton, a collection of sneers and hip swivels and \"uh-huh\"s performed in the vain hope that by doing so they could invoke some of the magic of the King of Rock and Roll.</p>\n<p>But it wasn't just popular culture that was like this -- even the Bohemian underground were trying desperately to copy American models. We've already seen how the skiffle craze came out of trad music, which was in itself an attempt to replicate the music made by black American musicians in New Orleans some thirty or forty years earlier. In the visual arts, there was Pop Art, which was, to start with, a purely British artistic phenomenon, but it was one made up of recycled Americana. A work like Richard Hamilton's 1956 collage Just what is it that makes today's homes so different, so appealing? was made up entirely of images found in American magazines sent over to Britain. Pop Art was interested in commenting on mass culture, but Hamilton wasn't interested in commenting on culture that British people would have any experience of -- he uses an image of a Young Romance comic cover, drawn by Jack Kirby, rather than Biffo the Bear or Desperate Dan, and the advert the collage was based on was from Ladies Home Journal, not Home Chat.</p>\n<p>And so in the late 1950s Britain got its own Beat Poet, Royston Ellis. Ellis was a bearded bisexual teenage speed freak, who hung around in Soho, which was, not coincidentally, simultaneously the gayest place in Britain, the most ethnically diverse, the artiest, and the place where every fifties British rock and roll artist came from. For all that the dozens of identikit Larry Parnes artists were made to a showbiz formula, British rock and roll was still fundamentally intertwined with the Bohemian subculture, and there were usually at most only two degrees of separation between some spotty bequiffed youth pinup in the teen magazines and a bearded folk-singing physics lecturer who went on Ban the Bomb marches every weekend.</p>\n<p>Ellis managed to parlay being willing to say controversial things like \"many teenagers quite like drugs\" and \"some teenagers have sex before marriage\" into a \"spokesman for his generation\" role, with regular appearances on TV. And so when he decided that he was going to copy the American Beat poets and perform in front of musicians, he wasn't going to just go for jazz musicians like they did. He was going to continue being the voice of a generation by performing the music that would go with his talk of sex and drugs -- he was going to perform his poetry backed by rock and roll music, what he called “rocketry”. And when you think of sex and drugs and rock and roll, obviously your first thought is of Cliff Richard.</p>\n<p>And so it was that Royston Ellis struck up a friendship with Cliff. Ellis' first book of beat poetry was dedicated to Cliff, and Cliff's first attempt at autobiography was dedicated to Royston. And Cliff's backing band became Ellis' backing band:</p>\n<p>[Excerpt: Royston Ellis and the Shadows, \"Gone Man Squared\"]</p>\n<p>That wasn't all the Drifters were doing without Cliff. They were encouraged by Cliff to make their own records -- it made him look better if his backing band were famous in their own right, and it would make the tours more attractive if both Cliff and the Drifters were star names, and so they went into Abbey Road themselves to record their first single, which is actually strikingly like the Merseybeat music that would become famous a few years later -- Everly Brothers-inspired harmonies, but with the electric guitar more prominent than on the Everlys' records, and sung in an English accent. Even the scream as they went into the guitar solo sounds very familiar if you've spent a lot of time listening to records from 1963 and 64. Remember again that this is 1959:</p>\n<p>[Excerpt: The Drifters, \"Feeling Fine\"]</p>\n<p>That was unsuccessful. By this time, though, Hank Marvin's Fender had arrived, and he was using it on records like Cliff's second number one, \"Travellin' Light\":</p>\n<p>[Excerpt: Cliff Richard and the Shadows, \"Travellin' Light\"]</p>\n<p>That single was also the first to bear a new credit -- rather than by Cliff Richard and the Drifters, it was credited to Cliff Richard and the Shadows. It turns out that if you want to release records in the US by a new group made up of geeky-looking white British teenagers, putting it out under the name of an established black vocal group who are climbing the charts with their own massive hit is a good way to get legal letters and have to withdraw the release. Jet Harris and Hank Marvin went to the pub to discuss a new name, and Harris suggested \"The Shadows\", because they were always standing in Cliff Richard's shadow.</p>\n<p>Their first single under the Shadows name, \"Lonesome Fella\", was a hybrid of country and doo-wop, with backing vocals that were more than a little reminiscent of the Del-Vikings' \"Come Go With Me\":</p>\n<p>[Excerpt: The Shadows, \"Lonesome Fella\"]</p>\n<p>That was also unsuccessful, and it seemed that for the time being the Shadows' time was best spent working as a backing group, either with Cliff Richard or Royston Ellis.</p>\n<p>But Ellis worked with other musicians too. For example here's a TV appearance with John Betjeman from very early 1961, where Ellis is accompanied by a single guitar:</p>\n<p>[Excerpt: Royston Ellis, “Lumbering Now”]</p>\n<p>The guitar there was played by a young musician Ellis had discovered named Jimmy Page. And in summer 1960, Ellis went up to Liverpool and met a band there that had been formed by a couple of art students and their younger friends. He got them to back him on stage and introduced them to drugs (showing them how at the time you could open up an inhaler to get at the amphetamine inside).</p>\n<p>He was impressed enough by them that in July 1960 an article appeared about him in Record Mirror, reading in part \"the bearded sage of the coffee bars has not always been satisfied with the accompaniment provided, so he's thinking of bringing down to London a young backing group which he considers is most in accord with his poetry. The name of the group? The Beetles!\"</p>\n<p>When Tony Meehan saw that, he got annoyed -- Meehan was the Shadow who, more than any of the others, was interested in being properly artistic. He'd thought that they were doing something worthwhile with Ellis, and didn't appreciate having their accompaniment dismissed like that in favour of some nobodies from Liverpool. Ellis had to write to the Record Mirror \"clarifying\" his previous remarks:</p>\n<p>\"These remarks were not intended as disparaging comments on the many excellent groups I have worked with on television and stage shows -- groups such as Cliff Richard's Shadows and the London group The Red Cats. For some time I have been searching for a group to use regularly, and I feel that \"The Beetles\" (most of them are Liverpool ex-art students) fill the bill. However, I am looking forward to working with other groups as well, and plans are at the moment underway for television appearances with both Bert Weedon and with The Shadows.\"</p>\n<p>As it turned out, Ellis never did bring the Beatles down to London -- when he turned twenty, he declared that as he was now middle-aged, he could no longer function as the voice of the teenagers, and turned to travelling and writing novels.</p>\n<p>You'll notice that in Ellis' apology, he refers to \"Cliff Richard's Shadows\", because at this point they were still just Cliff's backing band in the eyes of the public. That was going to change that same month, and it was about to change, in part, because of someone else Ellis mentioned there -- Bert Weedon. Weedon is someone who, when I pencilled in my initial list of songs to cover, was down as a definite. I was going to look at his record \"Guitar Boogie Shuffle\":</p>\n<p>[Excerpt: Bert Weedon, \"Guitar Boogie Shuffle\"]</p>\n<p>But unfortunately, it turned out that the tiny amount of information about Weedon available made it impossible to write a full episode about him, even though he had a career that lasted sixty years and was one of the most important people in British music history.</p>\n<p>But to boil it down to its basics, Bert Weedon was a jazz guitarist, at a time when the guitar was not the prominent instrument it has been since the sixties. When he was growing up in the twenties and thirties, as he would put it, the only time you'd see a guitar was being held by a singing cowboy in a film. There were almost no guitarists in Britain, and he soon became the first-call session player any time anyone in Britain was making a record that needed guitar.</p>\n<p>Then came both rock and roll and the skiffle boom. Most of Weedon's contemporaries were bitterly contemptuous of the new music, but the way he saw it, for the first time in his lifetime people were starting to make a decent living out of the guitar, and he wanted in. While his jazz friends started sneering at him and calling him \"boogie Bert\", for the first couple of years of British rock and roll he played on almost every record that came out.</p>\n<p>But his biggest contribution to music came with a book called \"Play in a Day\". That book was the first guitar tutorial published in the UK to attempt to show young players how to play the instrument in a way that got them playing songs quickly. While it's creakily old-fashioned today, Weedon did know that what kids wanted was to learn a couple of chords so they could accompany themselves playing a song, rather than to have to practice scales for months before moving on to anything more interesting. These days there are much better books, and Weedon's book looks exactly like all those older books it was replacing, but at the time it was a revelation.</p>\n<p>A lot of guitarists are credited as having learned from Weedon's book, some of them almost certainly apocryphally. But while it's been superseded by many better books, it was a massive seller in its time, and sold over two million copies. It's safe to say that at the very least every British guitarist we look at over the next hundred or so episodes will have had a look at Weedon's book, and many of them will have learned their first chords from it.</p>\n<p>Weedon had been a session musician and writer, but not a star musician in his own right, until he released his single \"Guitar Boogie Shuffle\" in 1959. It was a cover version of a hillbilly boogie called \"Guitar Boogie\", by Arthur \"Guitar Boogie\" Smith, and Weedon's version became a hit, reaching number ten in the UK -- the first British guitar instrumental to make the top ten:</p>\n<p>[Excerpt: Bert Weedon, \"Guitar Boogie\"]</p>\n<p>Dick Rowe, the boss of Top Rank Records, for which Weedon recorded at the time, had disliked that song so much that Weedon had tried to record it under a pseudonym for another label, because Rowe wouldn't put it out. But it became a hit, and started a run of instrumental hits for Weedon.</p>\n<p>After he'd had four hits along the lines of \"Guitar Boogie Shuffle\", Weedon was sent a piece of sheet music by the publishers Francis, Day, and Hunter. \"Apache\" was a song inspired by a 1954 western, and written by a young songwriter called Jerry Lordan. Lordan was a minor British singer, who'd had a recent hit with \"I'll Stay Single\":</p>\n<p>[Excerpt: Jerry Lordan, \"I'll Stay Single\"]</p>\n<p>But while he was a mildly successful singer, he was much more successful as a songwriter, writing Anthony Newley's top five hit \"I've Waited So Long\":</p>\n<p>[Excerpt: Anthony Newley, \"I've Waited So Long\"]</p>\n<p>And \"A House, a Car, and a Wedding Ring\", which had the unusual distinction for a British song of getting an American cover version, by Dale Hawkins:</p>\n<p>[Excerpt: Dale Hawkins, \"A House, a Car, and a Wedding Ring\"]</p>\n<p>Lordan's song, \"Apache\", seemed to be the kind of thing that Bert Weedon could do well, and Weedon recorded a version of it some time in late 1959 or early 1960:</p>\n<p>[Excerpt: Bert Weedon, \"Apache\"]</p>\n<p>Weedon also started performing the song in his shows and on TV. But the recording hadn't been released yet -- according to Weedon, he was planning on releasing the single in September, because that was when the most records were sold.</p>\n<p>But Lordan didn't want to wait until September for his song to come out on a record, so while he was on tour with Cliff and the Shadows, he showed the tune to Jet Harris on his ukulele. The group liked the tune, and released it as their second single under their new name. Hank Marvin had by this time been given a guitar echo unit by Joe Brown, who'd bought it and then disliked it. He used it on this record, along with another innovation -- the tremolo arm on his guitar. A tremolo arm, sometimes called a whammy bar, is a metal bar on your guitar that allows you to bend all the strings at once, and nobody else in Britain had a guitar with one at this point, but Hank had his Fender Stratocaster, on which they come fitted as standard. The combination of the tremolo arm and the echo unit was a sound that no-one else in the UK had, but which was strikingly similar to some of the surf music being made in the US, which was still mostly on tiny labels with no distribution over here:</p>\n<p>[Excerpt: The Shadows, \"Apache\"]</p>\n<p>\"Apache\" went to number one on the charts, knocking off \"Please Don't Tease\", a track by Cliff with the Shadows backing him. It stayed on the charts for five months, and became a standard performed by every British guitarist -- and soon by American guitarists like the Ventures. Weedon's version was rushed out to compete with it, but only made number twenty-four. Many versions of the song have become classics in their own right, and I won't go through all the hit versions here because this is a long episode anyway, but I do have to mention one version -- a novelty version recorded as album filler by a group of session musicians hired to make an album under the name The Incredible Bongo Band:</p>\n<p>[Excerpt: The Incredible Bongo Band, \"Apache\"]</p>\n<p>The guitarist on that, incidentally, is Mike Deasy, who we heard last week playing with Bruce Johnston and Sandy Nelson in various bands, and who had been in Eddie Cochran's backing band.</p>\n<p>That track includes a drum break, with bongos by King Errisson, and drums probably played by Jim Gordon, which is probably the most sampled recording of all time, and certainly in the top ten:</p>\n<p>[Excerpt: The Incredible Bongo Band, \"Apache\", drum breaks]</p>\n<p>That's been sampled by everyone from the Roots to Madonna, Vanilla Ice to Amy Winehouse, Rage Against the Machine to Kanye West. It's been called \"hip-hop's national anthem\", and there's a whole ninety-minute documentary on Netflix just about that track.</p>\n<p>But getting back to 1960 and the Shadows' version of the tune, it came as a revelation to many British kids, inspiring thousands of young boys who had already learned the guitar to start playing *electric* guitar, and making everyone who wanted to be a rock and roll star covet a Stratocaster specifically (with a few odd exceptions who reacted against what was popular, like there always are). Pete Townshend, for example, in a documentary earlier this year said that hearing \"Apache\" was for him even more important than his first orgasm.</p>\n<p>\"Apache\" stayed on the charts so long that the group's next single, \"Man of Mystery\", went to number five in the charts while \"Apache\" was still in the top forty:</p>\n<p>[Excerpt: The Shadows, \"Man of Mystery\"]</p>\n<p>And while that was at number five, \"Nine Times Out of Ten\" by Cliff Richard and the Shadows was at number three.</p>\n<p>Between 1959 and 1965, Cliff had twenty-six consecutive top ten hit singles, of which twenty-one had the Shadows (or the Drifters) as his backing group. In the same time period, the Shadows had a run of thirteen top ten hits in their own right. They were a phenomenon in British music like nothing anyone had ever seen. They appeared in a series of films, starring Richard, who was in 1962 and 63 a bigger draw at the British cinema than the early James Bond films. Neither Cliff nor the Shadows ever had much American success, but in Europe and Australia, and from 1962 on in Canada, they were at the very peak of success in the music industry.</p>\n<p>Everything seemed to be going perfectly for Cliff and the Shadows, even when in 1961 a bizarre love triangle upended everything. Jet Harris, who was at the time the band member who was closest to Cliff, had married a beautiful young woman called Carol Costa, without realising that she had never really been interested in him, but was using him to get to Cliff. Cliff and Costa started an affair, Harris became physically abusive towards Costa, she -- quite rightly -- left him, and he spiralled into depression and alcoholism. Cliff and Costa's affair didn't last long either -- but as it turned out, she would be the only woman with whom he would ever have sex.</p>\n<p>Richard's sexuality or lack of it has been the subject of a huge amount of discussion over the years. For many decades he said he was straight but celibate because of his religious views -- that he couldn't get married without disappointing his female fans, and that he felt sex outside marriage was wrong. In more recent years he's switched the wording he uses, saying his sexuality is his own business, that he'll never talk about it publicly, that he has a live-in male companion, and that it shouldn't matter to anyone what his sexuality is. Most descriptions of him from those who've known him over the decades have said that he was and is someone who is simply not very interested in sex. I mention this not to engage in prurient speculation about him, but to show how utterly bizarre it is that the one woman he would ever have sex with would be the wife of a friend and colleague.</p>\n<p>More in character, though, was the way he would dump Costa -- as was so often the case with Cliff Richard when discarding people for whom he had no further use, he got someone else to do it. In this case it was Tony Meehan who was given the task of letting her know that Cliff had suddenly developed moral scruples.</p>\n<p>Those moral scruples would soon get a lot more scrupulous, as this affair would indirectly lead to the most famous religious conversion in all of British music history.</p>\n<p>Shortly after dumping Costa on Cliff's behalf, Tony Meehan left the group, just before a tour of Australia and New Zealand. Meehan had slowly become disenchanted with the rest of the group, and didn't really fit in with them -- he was an intellectual who read books about the history of folk music and jazz, and wanted one day to write a history of Soho's music scene in the style of books he'd read about New Orleans, while the rest of them just liked reading thrillers.</p>\n<p>When he left, the group's second number one, \"Kon-Tiki\", was still at the top of the charts:</p>\n<p>[Excerpt: The Shadows, \"Kon-Tiki\"]</p>\n<p>He was replaced by Brian Bennett, who had played in the very first lineup of Vince Taylor and the Playboys, and had been in Marty Wilde's Wildcats for a while. Jet Harris lasted in the group another few months, until April 1962, when the drink caught up with him and he was fired.</p>\n<p>Bennett suggested that the group get in his old friend Licorice Locking, who he'd played with in the Vipers, the Playboys, and the Wildcats, and who had played with Bennett on those Eddie Cochran and Gene Vincent Saturday Club sessions we heard a couple of weeks back. Locking was a fine bass player, had played with most of them before back in their 2is days, and fitted in perfectly, though he had a very different playing style than Harris -- many hardcore Shadows fans think the group's golden age ended when Harris left, and he's rated enough as a bass player that while there are currently no substantial books on the Shadows themselves still in print, there are two separate self-published biographies of Harris available.</p>\n<p>Within a month of being fired, Harris had his own solo hit, making the top thirty with a version of \"Besame Mucho\" modelled on the Coasters' version, but with Harris playing lead bass instead of singing:</p>\n<p>[Excerpt: Jet Harris, \"Besame Mucho\"]</p>\n<p>But Locking would have an odd effect on the Shadows. Brian Bennett had been brought up as a Jehovah's Witness, and even though he was no longer a believer in that religion, he'd told Locking about its beliefs -- and Locking had become an enthusiastic convert. As soon as he joined the group, he set about trying to convert the other members, too. He succeeded with Hank Marvin, who to this day is a devoted Witness, and he came part way with Cliff, who never became a Witness but was inspired by Locking's Bible-reading sessions to become an evangelical Christian, and who is now British rock music's most famously religious person.</p>\n<p>Meanwhile, Harris had switched from bass to guitar, and was now going in a more Duane Eddy style. He teamed up with Tony Meehan, and together they recorded another Jerry Lordan song, \"Diamonds\", featuring Royston Ellis' friend Jimmy Page on rhythm guitar, on his first major session:</p>\n<p>[Excerpt: Jet Harris and Tony Meehan, \"Diamonds\"]</p>\n<p>At the beginning of 1963, Cliff and the Shadows, past and present, had a ridiculous monopoly of the top of the charts. \"Bachelor Boy\" by Cliff and the Shadows, written by Cliff and Bruce Welch, was at number one for three weeks, then was replaced by \"Dance On\" by the Shadows, which in turn was replaced by \"Diamonds\" by Jet and Tony. There was a brief three-week respite while Frank Ifield topped the charts with his \"Wayward Wind\", then \"Summer Holiday\" by Cliff and the Shadows, written by Bruce and Brian. Then \"Foot Tapper\" by the Shadows went to number one, then \"Summer Holiday\" went back to the top position.</p>\n<p>They all looked unstoppable. However, while they would all chart again, it would be two years before Cliff would have another number one, and neither the Shadows nor Jet and Tony ever would. In the case of Cliff and the Shadows, this change in commercial fortunes was because of a general change in the music market, which we'll be looking at towards the end of the year. In the case of Jet and Tony, though, that was only part of it. Jet was in a car accident which put him out of commission for a while, and when he got better he was drinking even more. He made a brief attempt at a comeback and even joined an early lineup of the Jeff Beck Group, but spent the rest of his life either working labouring jobs or playing the nostalgia circuit. He died in 2011.</p>\n<p>Jet and Tony's touring bass player, John Paul Jones, actually auditioned for the Shadows, as Licorice Locking left the group to spend more time evangelising, but Jones didn't get the job, and we'll be picking up on him later. We'll be seeing Cliff again too, as well as having a brief appearance from Tony Meehan, but this is the last we'll see of the Shadows, who continued with a variety of different bass players, and with Brian Bennett as the permanent drummer, off and on until 2015. Marvin, Bennett, and Welch all continue to make music separately, and it's still possible they may perform together as the Shadows one day. But even if they don't, \"Apache\" stands as the moment when a million British kids first decided that they wanted to be a guitar hero and play a Fender Stratocaster.</p>",
  "itunes:subtitle": "Episode eighty-seven of A History of Rock Music in Five Hundred Songs looks at Apache, by the Shadows, and at the three years in which they and Cliff Richard were on top of the music world. Patreon backers also have a fifteen-minute bonus episode, on Han",
  "itunes:keywords": "Bert Weedon,Brian Bennett,British rock,Cliff Richard,David Frost,Dick Rowe,EMI,Fender stratocaster,George Martin,James Burton,Jerry Lordan,Jim Gordon,Jimmy Page,Joe Brown,John Paul Jones,LGBT+ people,Licorice Locking,Lionel Bart,Mike Deasy,Norrie Paramor,Royston Ellis,The Beatles,The Incredible Bongo Band,The Shadows,The Vipers Skiffle Group,Tony Crombie and the Rockets,Tony Meehan,Vince Taylor",
  "itunes:episodeType": "full",
  "itunes:episode": 87,
  "content:encoded": "<p>Episode eighty-seven of A History of Rock Music in Five Hundred Songs looks at \"Apache\", by the Shadows, and at the three years in which they and Cliff Richard were on top of the music world. Patreon backers also have a fifteen-minute bonus episode, <a href=\"https://www.patreon.com/posts/38532000\">on \"Handy Man\" by Jimmy Jones</a>.</p>\n<p>My apologies for the lateness of this episode, which is due to my home Internet connection having been out for a week.</p>\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n<p><strong>Resources</strong></p>\n<p>As usual, I have put together <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-87-apache/\">a Mixcloud mix</a> with every song excerpted in this podcast.</p>\n<p><a href=\"https://amzn.to/31XL4rU\">This four-CD set</a> contains all the singles and EPs released by Cliff Richard and the Shadows, together and separately, between 1958 and 1962.</p>\n<p>Meanwhile,<a href=\"https://amzn.to/2zZr5Q0\"> this six-CD set</a> contains every recording the Shadows made on their own between 1959 and 1966, for a very low price.</p>\n<p><a href=\"https://amzn.to/2lqg8PS\">Pete Frame's The Restless Generation</a> is the best book available looking at British 50s rock and roll from a historical perspective. Be warned, though -- his jokey and irreverent style can, when dealing with people like Larry Parnes (who was gay and Jewish) very occasionally tip over into reinforcing homophobic and anti-semitic stereotypes for an easy laugh.</p>\n<p>Some of the information on Royston Ellis and Norrie Paramor comes from <a href=\"https://amzn.to/2XylQOW\">the extended edition of Mark Lewisohn's Tune In,</a> which is essential reading for anyone who is interested in the Beatles, British post-war culture, and British post-war music.</p>\n<p><a href=\"https://amzn.to/314nY4t\">This volume</a> contains Royston Ellis' two very slim books, one on Cliff and one on the Shadows, written for a teen audience in 1960 and 61. They are more of historical interest than anything else.</p>\n<p>And <a href=\"https://amzn.to/2SxaWaK\">Cliff Richard: The Biography by Steve Turner</a> is very positive towards Richard, but not at the expense of honesty.</p>\n<p> <strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/andrewhickey\">Why not join them?</a></p>\n<p><strong>Transcript</strong></p>\n<p>Today we're going to look at the group that, more than any other, made the guitar group the standard for rock music; the group which made the Fender Stratocaster the single most popular guitar in the world; and who dominated the British charts for much of the early 1960s.</p>\n<p>We're going to look at the Shadows:</p>\n<p>[Excerpt: The Shadows: \"Apache\"]</p>\n<p>We talked about Cliff Richard four months ago, but we've not yet looked at his backing group in any great detail. That's because his group at the time of \"Move It\", the single we looked at back then, was not the group that would end up becoming famous for backing him. We only mentioned in the last few minutes of that episode how his original backing band, the Drifters, were replaced one at a time by Hank Marvin, Bruce Welch, Jet Harris and Tony Meehan, most of whom had been members of the Vipers at one point or another during that group's commercial decline.</p>\n<p>This group, still calling themselves the Drifters, went into Abbey Road studios with Cliff in February 1959, to record Richard's first album -- a live album in front of a studio audience. The album was mostly made up of rather anaemic cover versions of American records, though drawing from a rather wider pool than one might expect -- as well as ballads like Ritchie Valens' \"Donna\" and rockabilly covers like \"Baby I Don't Care\" and \"That'll Be the Day\", there were also attempts at styles like Chicago blues, with a cover version of \"My Babe\", the song Willie Dixon had written for Little Walter:</p>\n<p>[Excerpt: Cliff Richard and the Drifters, \"My Babe\"]</p>\n<p>The album also featured two instrumentals by the Drifters, one of which was \"Jet Black\", named after Jet Harris, who was the de facto leader of the band at this time. Harris was a very experienced musician long before joining the group. He had played bass with Tony Crombie and the Rockets, the very first ever British rock and roll band, and Crombie had told him about a new instrument -- the electric bass guitar. Harris had obtained one, and seems to have been the very first British musician to play an electric bass. His bass was a signature of the band's early work, and it gets the spotlight in \"Jet Black\":</p>\n<p>[Excerpt: Cliff Richard and the Drifters, \"Jet Black\"]</p>\n<p>It was around this time that Hank Marvin ended up being the first British musician to play a solid-body electric guitar -- and a Fender Stratocaster at that.</p>\n<p>At the time we're talking about, there were import restrictions on many goods from America -- at the time, most economies were a lot more protectionist than they are these days, and the doctrine of free trade hadn't taken a foothold -- and so there were literally no American electric guitars in the UK, and there were no British manufacturers of them. Every British electric guitar player was playing a hollow-bodied guitar -- what we'd these days call a semi-acoustic or electro-acoustic guitar.</p>\n<p>But Cliff Richard was determined that his guitarist was going to have the best instrument. An instrument that was suitable for his music.</p>\n<p>While Cliff was portrayed as England's Elvis, and always credited Elvis as his inspiration, he had another favourite American singer, Ricky Nelson, whose softer style appealed to him, and was closer to the music that he ended up making:</p>\n<p>[Excerpt: Ricky Nelson, \"Poor Little Fool\"]</p>\n<p>Nelson's lead guitarist was James Burton, who Hank Marvin admired almost as much as Cliff admired Nelson. Burton had got his start playing on Dale Hawkins' \"Suzy Q\":</p>\n<p>[Excerpt: Dale Hawkins, \"Suzy Q\"]</p>\n<p>But at this point, as well as playing for Nelson, he was making a reputation as the best session guitarist on the West Coast of America -- so much of a reputation that even musicians in Britain knew his name. So it made sense that they should get Marvin the guitar that Burton played. They knew it was a Fender guitar, but they didn't know anything else, so they got themselves a Fender catalogue sent over from the US. Looking through it, they recognised one guitar, the Stratocaster, as being the one Buddy Holly played. It was also the most expensive, and the coolest-looking, so it must be the one that Burton played, right?</p>\n<p>As it turns out, Burton didn't play a Stratocaster, but a Telecaster, but they didn't know that until much later, and so Cliff Richard sent off the equivalent of several months' worth of Marvin's salary to have a Stratocaster shipped over and pay the import taxes.</p>\n<p>While they were waiting for it, though, there were records to be made -- and some of those records were ones that nobody involved was particularly interested in making.</p>\n<p>Cliff had started up a film career in parallel with his musical career. His first film was an attempt at an \"issue\" film, about teen pregnancy and false rape accusations, which featured him in a very minor role as a juvenile delinquent. In the film, he had to sing three songs written by Lionel Bart, who had written Tommy Steele's hits, and he didn't realise until afterwards that his film contract stipulated that one of them must be released as a single. The one that was chosen was \"Living Doll\".</p>\n<p>The problem was that Richard loathed the song. He thought it was an attempt at sounding like an American rock and roll record, but one that completely missed everything that made American rock and roll exciting. He flat-out refused to do it. And then Norrie Paramor came up with an ingenious scheme.</p>\n<p>Paramor was Richard's producer at EMI, and in a couple of years he became notorious in Britain when a jealous colleague, George Martin, leaked one of his scams to the TV presenter David Frost. Paramor would regularly write songs under pseudonyms, and get his artists to record them as B-sides, so he would get the same royalties from the record sales as the composer of the hit on the A-side. He apparently used thirty-six different pseudonyms, and was so widely known for this in the industry that people would sing of him \"Oh I Do Like To See Me On The B-Side\". Paramor earned enough money from his songwriting sideline that he owned a speedboat, a second home at the seaside, and an E-type Jag, while George Martin, ostensibly on the same salary, had a second-hand Mini.</p>\n<p>But for once, Paramor was going to be able to get the A-side to a single, and present it as doing his artist a favour. He explained to Richard that one way to be sure he'd never have to put out \"Living Doll\" as a single would be if he'd already put out a single with a similar name. So if, say, Paramor were to write him a song called \"Livin' Lovin' Doll\", then there'd be no way they could put out \"Living Doll\" -- and, if anyone had seen the film and *did* want \"Living Doll\", well, that would be free promotion for Paramor's song.</p>\n<p>\"Livin' Lovin' Doll\" went to number twenty on the charts:</p>\n<p>[Excerpt: Cliff Richard and the Drifters, \"Livin' Lovin' Doll\"]</p>\n<p>But, as it turned out, the contracts didn't say anything about only releasing a single if you didn't have a good reason not to. Cliff still had to release the song he'd sung in the film. But he decided he wasn't going to release that recording -- he was going to get the band to rearrange it into something that he could live with. The band members put their heads together, and decided that the song might work in a country direction, perhaps with a little of that Ricky Nelson soft-rock feel that Cliff liked. So, grudgingly, they recorded a slowed-down, acoustic version of \"Living Doll\".</p>\n<p>Which promptly became Cliff's first UK number one, as well as becoming a minor hit in the USA:</p>\n<p>[Excerpt: Cliff Richard and the Drifters, \"Living Doll\"]</p>\n<p>Meanwhile, the Drifters were doing some stuff on the sidelines by themselves, too, including backing a beat poet. British popular culture in the late 1950s and early 1960s was largely, if not solely, made up of poor imitations of American pop culture, usually without any understanding of what that culture was. The phrase \"cargo cult\" is one that reinforces a number of unpleasant stereotypes, and as far as I can tell the story on which the phrase is based is a gross misunderstanding, but if you imagine the cargo cult as it is popularly imagined, much of British pop culture was a cargo cult imitation of America, with signifiers yanked completely out of their contexts and placed in wholly new ones. The British musicians we've looked at so far have been the ones that were the most innovative, the least tied to their American inspirations, and yet I'm sure you've been able to detect even in them the sense that they were the ersatz version of the American rock stars, the Cheez-wizz to Elvis Presley's fine mature Stilton, a collection of sneers and hip swivels and \"uh-huh\"s performed in the vain hope that by doing so they could invoke some of the magic of the King of Rock and Roll.</p>\n<p>But it wasn't just popular culture that was like this -- even the Bohemian underground were trying desperately to copy American models. We've already seen how the skiffle craze came out of trad music, which was in itself an attempt to replicate the music made by black American musicians in New Orleans some thirty or forty years earlier. In the visual arts, there was Pop Art, which was, to start with, a purely British artistic phenomenon, but it was one made up of recycled Americana. A work like Richard Hamilton's 1956 collage Just what is it that makes today's homes so different, so appealing? was made up entirely of images found in American magazines sent over to Britain. Pop Art was interested in commenting on mass culture, but Hamilton wasn't interested in commenting on culture that British people would have any experience of -- he uses an image of a Young Romance comic cover, drawn by Jack Kirby, rather than Biffo the Bear or Desperate Dan, and the advert the collage was based on was from Ladies Home Journal, not Home Chat.</p>\n<p>And so in the late 1950s Britain got its own Beat Poet, Royston Ellis. Ellis was a bearded bisexual teenage speed freak, who hung around in Soho, which was, not coincidentally, simultaneously the gayest place in Britain, the most ethnically diverse, the artiest, and the place where every fifties British rock and roll artist came from. For all that the dozens of identikit Larry Parnes artists were made to a showbiz formula, British rock and roll was still fundamentally intertwined with the Bohemian subculture, and there were usually at most only two degrees of separation between some spotty bequiffed youth pinup in the teen magazines and a bearded folk-singing physics lecturer who went on Ban the Bomb marches every weekend.</p>\n<p>Ellis managed to parlay being willing to say controversial things like \"many teenagers quite like drugs\" and \"some teenagers have sex before marriage\" into a \"spokesman for his generation\" role, with regular appearances on TV. And so when he decided that he was going to copy the American Beat poets and perform in front of musicians, he wasn't going to just go for jazz musicians like they did. He was going to continue being the voice of a generation by performing the music that would go with his talk of sex and drugs -- he was going to perform his poetry backed by rock and roll music, what he called “rocketry”. And when you think of sex and drugs and rock and roll, obviously your first thought is of Cliff Richard.</p>\n<p>And so it was that Royston Ellis struck up a friendship with Cliff. Ellis' first book of beat poetry was dedicated to Cliff, and Cliff's first attempt at autobiography was dedicated to Royston. And Cliff's backing band became Ellis' backing band:</p>\n<p>[Excerpt: Royston Ellis and the Shadows, \"Gone Man Squared\"]</p>\n<p>That wasn't all the Drifters were doing without Cliff. They were encouraged by Cliff to make their own records -- it made him look better if his backing band were famous in their own right, and it would make the tours more attractive if both Cliff and the Drifters were star names, and so they went into Abbey Road themselves to record their first single, which is actually strikingly like the Merseybeat music that would become famous a few years later -- Everly Brothers-inspired harmonies, but with the electric guitar more prominent than on the Everlys' records, and sung in an English accent. Even the scream as they went into the guitar solo sounds very familiar if you've spent a lot of time listening to records from 1963 and 64. Remember again that this is 1959:</p>\n<p>[Excerpt: The Drifters, \"Feeling Fine\"]</p>\n<p>That was unsuccessful. By this time, though, Hank Marvin's Fender had arrived, and he was using it on records like Cliff's second number one, \"Travellin' Light\":</p>\n<p>[Excerpt: Cliff Richard and the Shadows, \"Travellin' Light\"]</p>\n<p>That single was also the first to bear a new credit -- rather than by Cliff Richard and the Drifters, it was credited to Cliff Richard and the Shadows. It turns out that if you want to release records in the US by a new group made up of geeky-looking white British teenagers, putting it out under the name of an established black vocal group who are climbing the charts with their own massive hit is a good way to get legal letters and have to withdraw the release. Jet Harris and Hank Marvin went to the pub to discuss a new name, and Harris suggested \"The Shadows\", because they were always standing in Cliff Richard's shadow.</p>\n<p>Their first single under the Shadows name, \"Lonesome Fella\", was a hybrid of country and doo-wop, with backing vocals that were more than a little reminiscent of the Del-Vikings' \"Come Go With Me\":</p>\n<p>[Excerpt: The Shadows, \"Lonesome Fella\"]</p>\n<p>That was also unsuccessful, and it seemed that for the time being the Shadows' time was best spent working as a backing group, either with Cliff Richard or Royston Ellis.</p>\n<p>But Ellis worked with other musicians too. For example here's a TV appearance with John Betjeman from very early 1961, where Ellis is accompanied by a single guitar:</p>\n<p>[Excerpt: Royston Ellis, “Lumbering Now”]</p>\n<p>The guitar there was played by a young musician Ellis had discovered named Jimmy Page. And in summer 1960, Ellis went up to Liverpool and met a band there that had been formed by a couple of art students and their younger friends. He got them to back him on stage and introduced them to drugs (showing them how at the time you could open up an inhaler to get at the amphetamine inside).</p>\n<p>He was impressed enough by them that in July 1960 an article appeared about him in Record Mirror, reading in part \"the bearded sage of the coffee bars has not always been satisfied with the accompaniment provided, so he's thinking of bringing down to London a young backing group which he considers is most in accord with his poetry. The name of the group? The Beetles!\"</p>\n<p>When Tony Meehan saw that, he got annoyed -- Meehan was the Shadow who, more than any of the others, was interested in being properly artistic. He'd thought that they were doing something worthwhile with Ellis, and didn't appreciate having their accompaniment dismissed like that in favour of some nobodies from Liverpool. Ellis had to write to the Record Mirror \"clarifying\" his previous remarks:</p>\n<p>\"These remarks were not intended as disparaging comments on the many excellent groups I have worked with on television and stage shows -- groups such as Cliff Richard's Shadows and the London group The Red Cats. For some time I have been searching for a group to use regularly, and I feel that \"The Beetles\" (most of them are Liverpool ex-art students) fill the bill. However, I am looking forward to working with other groups as well, and plans are at the moment underway for television appearances with both Bert Weedon and with The Shadows.\"</p>\n<p>As it turned out, Ellis never did bring the Beatles down to London -- when he turned twenty, he declared that as he was now middle-aged, he could no longer function as the voice of the teenagers, and turned to travelling and writing novels.</p>\n<p>You'll notice that in Ellis' apology, he refers to \"Cliff Richard's Shadows\", because at this point they were still just Cliff's backing band in the eyes of the public. That was going to change that same month, and it was about to change, in part, because of someone else Ellis mentioned there -- Bert Weedon. Weedon is someone who, when I pencilled in my initial list of songs to cover, was down as a definite. I was going to look at his record \"Guitar Boogie Shuffle\":</p>\n<p>[Excerpt: Bert Weedon, \"Guitar Boogie Shuffle\"]</p>\n<p>But unfortunately, it turned out that the tiny amount of information about Weedon available made it impossible to write a full episode about him, even though he had a career that lasted sixty years and was one of the most important people in British music history.</p>\n<p>But to boil it down to its basics, Bert Weedon was a jazz guitarist, at a time when the guitar was not the prominent instrument it has been since the sixties. When he was growing up in the twenties and thirties, as he would put it, the only time you'd see a guitar was being held by a singing cowboy in a film. There were almost no guitarists in Britain, and he soon became the first-call session player any time anyone in Britain was making a record that needed guitar.</p>\n<p>Then came both rock and roll and the skiffle boom. Most of Weedon's contemporaries were bitterly contemptuous of the new music, but the way he saw it, for the first time in his lifetime people were starting to make a decent living out of the guitar, and he wanted in. While his jazz friends started sneering at him and calling him \"boogie Bert\", for the first couple of years of British rock and roll he played on almost every record that came out.</p>\n<p>But his biggest contribution to music came with a book called \"Play in a Day\". That book was the first guitar tutorial published in the UK to attempt to show young players how to play the instrument in a way that got them playing songs quickly. While it's creakily old-fashioned today, Weedon did know that what kids wanted was to learn a couple of chords so they could accompany themselves playing a song, rather than to have to practice scales for months before moving on to anything more interesting. These days there are much better books, and Weedon's book looks exactly like all those older books it was replacing, but at the time it was a revelation.</p>\n<p>A lot of guitarists are credited as having learned from Weedon's book, some of them almost certainly apocryphally. But while it's been superseded by many better books, it was a massive seller in its time, and sold over two million copies. It's safe to say that at the very least every British guitarist we look at over the next hundred or so episodes will have had a look at Weedon's book, and many of them will have learned their first chords from it.</p>\n<p>Weedon had been a session musician and writer, but not a star musician in his own right, until he released his single \"Guitar Boogie Shuffle\" in 1959. It was a cover version of a hillbilly boogie called \"Guitar Boogie\", by Arthur \"Guitar Boogie\" Smith, and Weedon's version became a hit, reaching number ten in the UK -- the first British guitar instrumental to make the top ten:</p>\n<p>[Excerpt: Bert Weedon, \"Guitar Boogie\"]</p>\n<p>Dick Rowe, the boss of Top Rank Records, for which Weedon recorded at the time, had disliked that song so much that Weedon had tried to record it under a pseudonym for another label, because Rowe wouldn't put it out. But it became a hit, and started a run of instrumental hits for Weedon.</p>\n<p>After he'd had four hits along the lines of \"Guitar Boogie Shuffle\", Weedon was sent a piece of sheet music by the publishers Francis, Day, and Hunter. \"Apache\" was a song inspired by a 1954 western, and written by a young songwriter called Jerry Lordan. Lordan was a minor British singer, who'd had a recent hit with \"I'll Stay Single\":</p>\n<p>[Excerpt: Jerry Lordan, \"I'll Stay Single\"]</p>\n<p>But while he was a mildly successful singer, he was much more successful as a songwriter, writing Anthony Newley's top five hit \"I've Waited So Long\":</p>\n<p>[Excerpt: Anthony Newley, \"I've Waited So Long\"]</p>\n<p>And \"A House, a Car, and a Wedding Ring\", which had the unusual distinction for a British song of getting an American cover version, by Dale Hawkins:</p>\n<p>[Excerpt: Dale Hawkins, \"A House, a Car, and a Wedding Ring\"]</p>\n<p>Lordan's song, \"Apache\", seemed to be the kind of thing that Bert Weedon could do well, and Weedon recorded a version of it some time in late 1959 or early 1960:</p>\n<p>[Excerpt: Bert Weedon, \"Apache\"]</p>\n<p>Weedon also started performing the song in his shows and on TV. But the recording hadn't been released yet -- according to Weedon, he was planning on releasing the single in September, because that was when the most records were sold.</p>\n<p>But Lordan didn't want to wait until September for his song to come out on a record, so while he was on tour with Cliff and the Shadows, he showed the tune to Jet Harris on his ukulele. The group liked the tune, and released it as their second single under their new name. Hank Marvin had by this time been given a guitar echo unit by Joe Brown, who'd bought it and then disliked it. He used it on this record, along with another innovation -- the tremolo arm on his guitar. A tremolo arm, sometimes called a whammy bar, is a metal bar on your guitar that allows you to bend all the strings at once, and nobody else in Britain had a guitar with one at this point, but Hank had his Fender Stratocaster, on which they come fitted as standard. The combination of the tremolo arm and the echo unit was a sound that no-one else in the UK had, but which was strikingly similar to some of the surf music being made in the US, which was still mostly on tiny labels with no distribution over here:</p>\n<p>[Excerpt: The Shadows, \"Apache\"]</p>\n<p>\"Apache\" went to number one on the charts, knocking off \"Please Don't Tease\", a track by Cliff with the Shadows backing him. It stayed on the charts for five months, and became a standard performed by every British guitarist -- and soon by American guitarists like the Ventures. Weedon's version was rushed out to compete with it, but only made number twenty-four. Many versions of the song have become classics in their own right, and I won't go through all the hit versions here because this is a long episode anyway, but I do have to mention one version -- a novelty version recorded as album filler by a group of session musicians hired to make an album under the name The Incredible Bongo Band:</p>\n<p>[Excerpt: The Incredible Bongo Band, \"Apache\"]</p>\n<p>The guitarist on that, incidentally, is Mike Deasy, who we heard last week playing with Bruce Johnston and Sandy Nelson in various bands, and who had been in Eddie Cochran's backing band.</p>\n<p>That track includes a drum break, with bongos by King Errisson, and drums probably played by Jim Gordon, which is probably the most sampled recording of all time, and certainly in the top ten:</p>\n<p>[Excerpt: The Incredible Bongo Band, \"Apache\", drum breaks]</p>\n<p>That's been sampled by everyone from the Roots to Madonna, Vanilla Ice to Amy Winehouse, Rage Against the Machine to Kanye West. It's been called \"hip-hop's national anthem\", and there's a whole ninety-minute documentary on Netflix just about that track.</p>\n<p>But getting back to 1960 and the Shadows' version of the tune, it came as a revelation to many British kids, inspiring thousands of young boys who had already learned the guitar to start playing *electric* guitar, and making everyone who wanted to be a rock and roll star covet a Stratocaster specifically (with a few odd exceptions who reacted against what was popular, like there always are). Pete Townshend, for example, in a documentary earlier this year said that hearing \"Apache\" was for him even more important than his first orgasm.</p>\n<p>\"Apache\" stayed on the charts so long that the group's next single, \"Man of Mystery\", went to number five in the charts while \"Apache\" was still in the top forty:</p>\n<p>[Excerpt: The Shadows, \"Man of Mystery\"]</p>\n<p>And while that was at number five, \"Nine Times Out of Ten\" by Cliff Richard and the Shadows was at number three.</p>\n<p>Between 1959 and 1965, Cliff had twenty-six consecutive top ten hit singles, of which twenty-one had the Shadows (or the Drifters) as his backing group. In the same time period, the Shadows had a run of thirteen top ten hits in their own right. They were a phenomenon in British music like nothing anyone had ever seen. They appeared in a series of films, starring Richard, who was in 1962 and 63 a bigger draw at the British cinema than the early James Bond films. Neither Cliff nor the Shadows ever had much American success, but in Europe and Australia, and from 1962 on in Canada, they were at the very peak of success in the music industry.</p>\n<p>Everything seemed to be going perfectly for Cliff and the Shadows, even when in 1961 a bizarre love triangle upended everything. Jet Harris, who was at the time the band member who was closest to Cliff, had married a beautiful young woman called Carol Costa, without realising that she had never really been interested in him, but was using him to get to Cliff. Cliff and Costa started an affair, Harris became physically abusive towards Costa, she -- quite rightly -- left him, and he spiralled into depression and alcoholism. Cliff and Costa's affair didn't last long either -- but as it turned out, she would be the only woman with whom he would ever have sex.</p>\n<p>Richard's sexuality or lack of it has been the subject of a huge amount of discussion over the years. For many decades he said he was straight but celibate because of his religious views -- that he couldn't get married without disappointing his female fans, and that he felt sex outside marriage was wrong. In more recent years he's switched the wording he uses, saying his sexuality is his own business, that he'll never talk about it publicly, that he has a live-in male companion, and that it shouldn't matter to anyone what his sexuality is. Most descriptions of him from those who've known him over the decades have said that he was and is someone who is simply not very interested in sex. I mention this not to engage in prurient speculation about him, but to show how utterly bizarre it is that the one woman he would ever have sex with would be the wife of a friend and colleague.</p>\n<p>More in character, though, was the way he would dump Costa -- as was so often the case with Cliff Richard when discarding people for whom he had no further use, he got someone else to do it. In this case it was Tony Meehan who was given the task of letting her know that Cliff had suddenly developed moral scruples.</p>\n<p>Those moral scruples would soon get a lot more scrupulous, as this affair would indirectly lead to the most famous religious conversion in all of British music history.</p>\n<p>Shortly after dumping Costa on Cliff's behalf, Tony Meehan left the group, just before a tour of Australia and New Zealand. Meehan had slowly become disenchanted with the rest of the group, and didn't really fit in with them -- he was an intellectual who read books about the history of folk music and jazz, and wanted one day to write a history of Soho's music scene in the style of books he'd read about New Orleans, while the rest of them just liked reading thrillers.</p>\n<p>When he left, the group's second number one, \"Kon-Tiki\", was still at the top of the charts:</p>\n<p>[Excerpt: The Shadows, \"Kon-Tiki\"]</p>\n<p>He was replaced by Brian Bennett, who had played in the very first lineup of Vince Taylor and the Playboys, and had been in Marty Wilde's Wildcats for a while. Jet Harris lasted in the group another few months, until April 1962, when the drink caught up with him and he was fired.</p>\n<p>Bennett suggested that the group get in his old friend Licorice Locking, who he'd played with in the Vipers, the Playboys, and the Wildcats, and who had played with Bennett on those Eddie Cochran and Gene Vincent Saturday Club sessions we heard a couple of weeks back. Locking was a fine bass player, had played with most of them before back in their 2is days, and fitted in perfectly, though he had a very different playing style than Harris -- many hardcore Shadows fans think the group's golden age ended when Harris left, and he's rated enough as a bass player that while there are currently no substantial books on the Shadows themselves still in print, there are two separate self-published biographies of Harris available.</p>\n<p>Within a month of being fired, Harris had his own solo hit, making the top thirty with a version of \"Besame Mucho\" modelled on the Coasters' version, but with Harris playing lead bass instead of singing:</p>\n<p>[Excerpt: Jet Harris, \"Besame Mucho\"]</p>\n<p>But Locking would have an odd effect on the Shadows. Brian Bennett had been brought up as a Jehovah's Witness, and even though he was no longer a believer in that religion, he'd told Locking about its beliefs -- and Locking had become an enthusiastic convert. As soon as he joined the group, he set about trying to convert the other members, too. He succeeded with Hank Marvin, who to this day is a devoted Witness, and he came part way with Cliff, who never became a Witness but was inspired by Locking's Bible-reading sessions to become an evangelical Christian, and who is now British rock music's most famously religious person.</p>\n<p>Meanwhile, Harris had switched from bass to guitar, and was now going in a more Duane Eddy style. He teamed up with Tony Meehan, and together they recorded another Jerry Lordan song, \"Diamonds\", featuring Royston Ellis' friend Jimmy Page on rhythm guitar, on his first major session:</p>\n<p>[Excerpt: Jet Harris and Tony Meehan, \"Diamonds\"]</p>\n<p>At the beginning of 1963, Cliff and the Shadows, past and present, had a ridiculous monopoly of the top of the charts. \"Bachelor Boy\" by Cliff and the Shadows, written by Cliff and Bruce Welch, was at number one for three weeks, then was replaced by \"Dance On\" by the Shadows, which in turn was replaced by \"Diamonds\" by Jet and Tony. There was a brief three-week respite while Frank Ifield topped the charts with his \"Wayward Wind\", then \"Summer Holiday\" by Cliff and the Shadows, written by Bruce and Brian. Then \"Foot Tapper\" by the Shadows went to number one, then \"Summer Holiday\" went back to the top position.</p>\n<p>They all looked unstoppable. However, while they would all chart again, it would be two years before Cliff would have another number one, and neither the Shadows nor Jet and Tony ever would. In the case of Cliff and the Shadows, this change in commercial fortunes was because of a general change in the music market, which we'll be looking at towards the end of the year. In the case of Jet and Tony, though, that was only part of it. Jet was in a car accident which put him out of commission for a while, and when he got better he was drinking even more. He made a brief attempt at a comeback and even joined an early lineup of the Jeff Beck Group, but spent the rest of his life either working labouring jobs or playing the nostalgia circuit. He died in 2011.</p>\n<p>Jet and Tony's touring bass player, John Paul Jones, actually auditioned for the Shadows, as Licorice Locking left the group to spend more time evangelising, but Jones didn't get the job, and we'll be picking up on him later. We'll be seeing Cliff again too, as well as having a brief appearance from Tony Meehan, but this is the last we'll see of the Shadows, who continued with a variety of different bass players, and with Brian Bennett as the permanent drummer, off and on until 2015. Marvin, Bennett, and Welch all continue to make music separately, and it's still possible they may perform together as the Shadows one day. But even if they don't, \"Apache\" stands as the moment when a million British kids first decided that they wanted to be a guitar hero and play a Fender Stratocaster.</p>",
  "enclosure": "",
  "itunes:summary": "Episode eighty-seven of A History of Rock Music in Five Hundred Songs looks at \"Apache\", by the Shadows, and at the three years in which they and Cliff Richard were on top of the music world. Patreon backers also have a fifteen-minute bonus episode, on \"Handy Man\" by Jimmy Jones.\nMy apologies for the lateness of this episode, which is due to my home Internet connection having been out for a week.\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nResources\nAs usual, I have put together a Mixcloud mix with every song excerpted in this podcast.\nThis four-CD set contains all the singles and EPs released by Cliff Richard and the Shadows, together and separately, between 1958 and 1962.\nMeanwhile, this six-CD set contains every recording the Shadows made on their own between 1959 and 1966, for a very low price.\nPete Frame's The Restless Generation is the best book available looking at British 50s rock and roll from a historical perspective. Be warned, though -- his jokey and irreverent style can, when dealing with people like Larry Parnes (who was gay and Jewish) very occasionally tip over into reinforcing homophobic and anti-semitic stereotypes for an easy laugh.\nSome of the information on Royston Ellis and Norrie Paramor comes from the extended edition of Mark Lewisohn's Tune In, which is essential reading for anyone who is interested in the Beatles, British post-war culture, and British post-war music.\nThis volume contains Royston Ellis' two very slim books, one on Cliff and one on the Shadows, written for a teen audience in 1960 and 61. They are more of historical interest than anything else.\nAnd Cliff Richard: The Biography by Steve Turner is very positive towards Richard, but not at the expense of honesty.\n Patreon\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\nTranscript\nToday we're going to look at the group that, more than any other, made the guitar group the standard for rock music; the group which made the Fender Stratocaster the single most popular guitar in the world; and who dominated the British charts for much of the early 1960s.\nWe're going to look at the Shadows:\n[Excerpt: The Shadows: \"Apache\"]\nWe talked about Cliff Richard four months ago, but we've not yet looked at his backing group in any great detail. That's because his group at the time of \"Move It\", the single we looked at back then, was not the group that would end up becoming famous for backing him. We only mentioned in the last few minutes of that episode how his original backing band, the Drifters, were replaced one at a time by Hank Marvin, Bruce Welch, Jet Harris and Tony Meehan, most of whom had been members of the Vipers at one point or another during that group's commercial decline.\nThis group, still calling themselves the Drifters, went into Abbey Road studios with Cliff in February 1959, to record Richard's first album -- a live album in front of a studio audience. The album was mostly made up of rather anaemic cover versions of American records, though drawing from a rather wider pool than one might expect -- as well as ballads like Ritchie Valens' \"Donna\" and rockabilly covers like \"Baby I Don't Care\" and \"That'll Be the Day\", there were also attempts at styles like Chicago blues, with a cover version of \"My Babe\", the song Willie Dixon had written for Little Walter:\n[Excerpt: Cliff Richard and the Drifters, \"My Babe\"]\nThe album also featured two instrumentals by the Drifters, one of which was \"Jet Black\", named after Jet Harris, who was the de facto leader of the band at this time. Harris was a very experienced musician long before joining the group. He had played bass with Tony Crombie and the Rockets, the very first ever British rock and roll band, and Crombie had told him about a new instrument -- the electric bass guitar. Har",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode eighty-seven of A History of Rock Music in Five Hundred Songs looks at \"Apache\", by the Shadows, and at the three years in which they and Cliff Richard were on top of the music world. Patreon backers also have a fifteen-minute bonus episode, on \"Handy Man\" by Jimmy Jones.\nMy apologies for the lateness of this episode, which is due to my home Internet connection having been out for a week.\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nResources\nAs usual, I have put together a Mixcloud mix with every song excerpted in this podcast.\nThis four-CD set contains all the singles and EPs released by Cliff Richard and the Shadows, together and separately, between 1958 and 1962.\nMeanwhile, this six-CD set contains every recording the Shadows made on their own between 1959 and 1966, for a very low price.\nPete Frame's",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}