{
  "title": "Episode 66: What to do about Mom? Personal Control and Aging",
  "pubDate": "Mon, 11 Aug 2008 13:20:12 +0000",
  "guid": "episode-66-what-do-to-about-mom-personal-control",
  "link": "http://www.thepsychfiles.com/2008/08/11/episode-66-what-to-do-about-mom-personal-control-and-aging/",
  "itunes:image": "",
  "description": "Do nursing homes and assisted living facilities have to be so depressing?  Is there a way to help senior citizens have more energy and more enthusiasm for life?  What do psychologists know that you should know about how to help the elderly feel good about life?  It has to do with the concept of personal control (also referred to as locus of control).  Learn about it in this review of a classic study in psychology.  This week on The Psych Files podcast.",
  "content:encoded": "Do nursing homes and assisted living facilities have to be so depressing?  Is there a way to help senior citizens have more energy and more enthusiasm for life?  What do psychologists know that you should know about how to help the elderly feel good about life?  It has to do with the concept of personal control (also referred to as locus of control).  Learn about it in this review of a classic study in psychology.  This week on The Psych Files podcast.",
  "enclosure": "",
  "itunes:duration": "19:34",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology,lecture,aging",
  "itunes:subtitle": "Do nursing homes and assisted living facilities have to be so depressing? Is there a way to help senior citizens have more energy and enthusiasm for life? Learn more in this review of a classic study in psychology. This week on The Psych Files podcast.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Do nursing homes and assisted living facilities have to be so depressing? Is there a way to help senior citizens have more energy and more enthusiasm for life? What do psychologists know that you should know about how to help the elderly feel good about life? It has to do with the concept of personal control (also referred to as locus of control). Learn about it in this review of a classic study in psychology. This week on The Psych Files podcast."
}