{
  "title": "Landsat Proved the Power of Remote Sensing",
  "link": "https://spectrum.ieee.org/landsat",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-satellite-image-shows-vegetation-in-red-tones-and-urban-and-rocky-areas-in-grays-and-whites.jpg?id=29985802&width=1245&height=700&coordinates=0%2C278%2C0%2C278\"/><br/><br/><p><strong>On 18 September 1969</strong>, U.S. President Richard Nixon <a href=\"https://2009-2017.state.gov/p/io/potusunga/207305.htm\" target=\"_blank\">addressed</a> the General Assembly of the United Nations. It was a difficult time in global politics, and much of his speech focused on the war in Vietnam, disputes in the Middle East, and strategic arms control. Toward the end, though, the speech took a curious and hopeful turn, as Nixon rhapsodized about the unifying potential of international cooperation in space exploration. As an example, he noted the United States was in the process of developing new satellites to survey Earth’s natural resources.  </p><p>Three years later, on 23 July 1972, NASA launched what would be the first Earth Resources Technology Satellite (ERTS). It gave scientists, land managers, policymakers, and others an unprecedented view of their planet. The program has since launched eight more satellites. Renamed the Landsat program in 1975, it is now celebrating its 50th anniversary of imaging the Earth. </p><h2>Landsat’s winning tech was the Multispectral Scanner System </h2><p>ERTS was the first of its kind. On board were two different imaging instruments. The first was a television-style camera system (called a Return Beam Vidicon, or RBV) built by the Radio Corporation of America. Everyone assumed the camera would be the workhorse of the mission.  </p><p>The second instrument was a highly experimental Multispectral Scanner System (MSS) designed by <a href=\"https://landsat.gsfc.nasa.gov/article/virginia-t-norwood-the-mother-of-landsat/\" target=\"_blank\">Virginia T. Norwood</a> and built by Hughes Aircraft Co. MSS capitalized on fiber optics to collect data at four different spectral bands (visible green and red, plus two bands of near-infrared). <a href=\"https://landsat.gsfc.nasa.gov/article/remembering-paul-lowman/\" target=\"_blank\">NASA geologist Paul Lowman</a>, who reviewed the original, unsolicited proposal for the MSS, had no faith that the technology would work. RBV had been used on previous space missions and weather satellites. MSS had been successfully tested on Earth, but could it work while zooming through space, sending out binary data in real time? </p><p>As it turned out, the RBV failed on 5 August 1972 after collecting only 1,690 images. The MSS, though, operated until 6 January 1978, outliving its design life by four and a half years and recording more than 300,000 images. Lowman later conceded that he had been “dead wrong.” MSS was clearly the winning technology. </p><p>The first ERTS satellite (retroactively known as <a href=\"https://landsat.gsfc.nasa.gov/satellites/landsat-1/\" target=\"_blank\">Landsat 1</a>) orbited the Earth about 14 times a day, imaging the globe every 18 days. <a href=\"https://www.usgs.gov/landsat-legacy/fifty-years-exploration-and-innovation-how-landsat-launched-remote-sensing-era\" target=\"_blank\">Ground stations in California and Alaska</a> received the data and then sent the tapes to the Goddard Space Flight Center in Maryland for processing. Two days after the launch, Goddard received its first MSS image, showing the Dallas–Fort Worth area. (In the false-color image, shown at top, reds are vegetation and grays and whites are urban or rocky land.) ERTS had a spatial resolution of 80 meters. Landsat data is considered <a href=\"https://eos.com/blog/satellite-data-what-spatial-resolution-is-enough-for-you/\" target=\"_blank\">low to medium resolution</a>—absolutely fine for looking at large areas of land, but not exactly spyware. Today’s commercial high-resolution satellites can have a resolution of 30 centimeters. </p><p>As Landsat 1 orbited the Earth in a north-to-south direction, the MSS’s oscillating mirror repeatedly scanned a 185-kilometer-wide swath (corresponding to a 12° field of view) from west to east. The light from the mirror passed through filters and onto the 24-element array of detectors—six for each of the MSS’s four spectral bands—yielding 24 channels of video data. A multiplexer processed this data, and an analog-to-digital converter changed it to a pulse-code modulated signal. The satellite then transmitted the signal to a ground station; if no station was within range, it stored the data on magnetic tape for later transmission. </p><p>Under NASA’s supervision, more than 300 researchers investigated how to use this abundance of new data—for biology, geology, land use, agricultural developing, and mining, among other things. </p><h2>The Soviet grain deal gave Landsat a new use: predicting crop yields worldwide </h2><p>The U.S. Department of Agriculture was one of the earliest boosters for Landsat. Beginning in the mid-1960s, the USDA had worked with NASA and labs at Purdue University and the University of Michigan to develop new ways to identify crops from high-altitude aircraft and satellites. In 1970 and 1971, corn blight ravaged the Midwest and the South, providing a real-world test to see if multispectral scanners flown in aircraft could classify the stages of fungus infestation. The experiment showed <a href=\"https://www.nass.usda.gov/Education_and_Outreach/Reports,_Presentations_and_Conferences/GIS_Reports/Results%20of%20the%201971%20Corn%20Blight%20Watch%20Experiment.pdf\" target=\"_blank\">promising results</a> for the emerging MSS technology. </p><p>Just as corn blight was devastating crops in the United States, a long, cold winter was destroying Soviet wheat from the Ukraine and Volga River valley, totaling half of the world’s grain loss that year. The Kremlin, trying to avoid famine at home, sent representatives to the United States to purchase American wheat, corn, oats, rye, and soybeans. The Soviets were capitalizing on a recent change in U.S. agricultural policy that removed restrictions on grain sales to the Soviet Union and China. The U.S. government did not yet know about the Soviet’s crop failure and the ripple effects it would have on the global market, and farmers were happy to sell. Within a few months of the sales, however, global food prices soared by 50 percent, and U.S. farmers estimated a profit loss of $462 million (about $3.2 billion in today’s dollars). </p><p>As the historian Brian Jirout argues in his 2017 article “<a href=\"https://spacehistory101.com/downloads/quest-vol-24-4/\" target=\"_blank\">Farming from Space: Landsat and the Development of Agricultural Surveillance During the Cold War</a>,” the Soviet grain deal created the urgency and anxiety necessary for the USDA to propose the Large Area Crop Inventory Experiment, to predict both domestic and foreign crop yields. The experiment would use the satellite’s MSS to collect agricultural data on a global scale, using the same protocol as the corn blight experiment. The experiment’s success pushed NASA to move up Landsat 2’s launch date. That satellite went up on 22 January 1975 carrying the same RBV and MSS sensor technology as the original. </p><p>To calibrate the MSS imagery, NASA and the USDA needed to have crop reports, soil data, and meteorological information about conditions on the ground. After several months of negotiation, the United States and the Soviet Union signed the Agreement on Cooperation in Agriculture on 19 June 1973, legitimizing the agricultural goals for the project. The two nations also cooperated on applying remote sensing to geology and hydrology in the hopes of allaying international concerns over American espionage.  </p><h2>Landsat provided imagery for the CIA’s War on Drugs and the Gulf War </h2><p>As the Landsat technology matured, both the Carter and Reagan administrations moved to privatize the program. Unfortunately, the <a href=\"https://www.science.org/doi/10.1126/science.216.4541.40\" target=\"_blank\">estimated costs for running the program</a> (including satellites, launch vehicles, communication stations, and image processing) amounted to $1 billion to $10 billion over 10 years, while the estimated annual revenue was only about $6 million. Landsat couldn’t survive without government subsidies. Launches for Landsat 6 and 7 were paused, and program managers warned that image collecting would cease.  </p><p>Meanwhile, Landsat 5 stayed the course, imaging the Earth from March 1984 to June 2013—an astounding 29 years. Jirout notes that without the satellite’s incredible longevity, “there’s a good chance the Landsat archive would have a significant data gap.”  </p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A model of a satellite that's suspended from wires and has solar panels, instrumentation, and other equipment extending from its body.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"cba706c4d005e800888016a65e91d317\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"c9461\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-model-of-a-satellite-that-s-suspended-from-wires-and-has-solar-panels-instrumentation-and-other-equipment-extending-from-its.jpg?id=29985917&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Landsat 5 (a model of which is shown here) operated for 29 years, making it one of the most long-lived satellites of all time.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">SSPL/Getty Images</small></p><p>Government contracts ended up saving the Landsat program, and perhaps unsurprisingly, they came from the intelligence and military sectors. As part of its War on Drugs, the CIA used Landsat imagery to reveal an increase of acreage committed to poppy in Afghanistan in 1985 and the resulting expanded opium trade. The Defense Mapping Agency also regularly used Landsat data for terrain analysis in Kuwait during the Gulf War with Operations Desert Shield and Storm. After the dissolution of the Soviet Union, the U.S. Department of Defense used Landsat to image the 15 new nations. </p><p>As the program marks its 50th anniversary, let’s reflect on Landsat’s place in history. Many of the troubling themes that Nixon raised in his 1969 UN address continue to echo today. Countries still engage in conflicts and border disputes, if not outright war, and arms control remains a contentious subject. Landsat has been an unexpected, mostly peaceful, constant. </p><p>Landsat’s lasting legacy is the treasure trove of continuous global imaging data it has produced. Freely available to all, the data now has a historic dimension, allowing scientists to compare how land has changed over decades. Whether it is comparing damage due to storms, pollution caused by factories, or the spread of deserts and urban sprawl, Landsat provides a baseline for measuring Earth’s resources. </p><p>Although <a href=\"https://spectrum.ieee.org/commercial-satellite-imagery\" target=\"_self\">Earth-imaging satellites</a> have become far more common, especially in the past decade, Landsat is still going strong. Last November, the Landsat Archive added its <a href=\"https://www.usgs.gov/landsat-missions/news/landsat-archive-adds-its-10-millionth-image\" target=\"_blank\">10 millionth scene</a>, an image of the Dead Sea. This video, prepared by the U.S. Geological Survey, which administers the archive, shows how the Dead Sea has shrunk over nearly 50 years:  </p><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"b32acef70dae5b874e529a44834405c2\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/Ivehqq4MXBQ?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Image of the Week - Landsat's 10 Millionth Scene</small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">\n<a href=\"https://www.youtube.com/watch?v=Ivehqq4MXBQ\" target=\"_blank\">www.youtube.com</a>\n</small>\n</p><p><span style=\"background-color: initial;\">The latest satellite, Landsat 9, launched on 27 September of last year and is collecting up to 750 scenes per day. T</span><span style=\"background-color: initial;\">he Landsat Next mission is already in the planning stages</span><span style=\"background-color: initial;\">.</span> While scientists consider future projects, historians <span style=\"background-color: initial;\">are</span> thinking about how to preserve the history of space <span style=\"background-color: initial;\">projects like Landsat</span> as well as newer efforts<span style=\"background-color: initial;\">. </span><a href=\"https://www.toboldlypreserve.space/about.html\" target=\"_blank\">To Boldly Preserve</a><span style=\"background-color: initial;\"> is an organization of nearly 100 historians, archivists, and museum curators who are working with government officials and </span><span style=\"background-color: initial;\">representative</span> of the space industry to capture contemporary events and ensure they can be accessed in the future. <span style=\"background-color: initial;\">Here’s to the next 50 years of space exploration.</span><br/></p><p><em>Part of a </em><a href=\"https://spectrum.ieee.org/tag/Past+Forward\" target=\"_self\"><em>continuing series</em></a><em> looking at photographs of historical artifacts that embrace the boundless potential of technology.</em> </p><p><em>An abridged version of this article appears in the July 2022 print issue as </em><em>“Pictures of a Planet.\"</em></p>",
  "pubDate": "Wed, 29 Jun 2022 15:00:00 +0000",
  "guid": "https://spectrum.ieee.org/landsat",
  "category": [
    "Landsat",
    "Earth imaging",
    "Remote sensing",
    "History of the satellite",
    "Past forward"
  ],
  "dc:creator": "Allison Marsh",
  "media:content": ""
}