{
  "title": "Episode 49: &#8220;Love is Strange&#8221; by Mickey and Sylvia",
  "link": "https://500songs.com/podcast/episode-49-love-is-strange-by-mickey-and-sylvia/",
  "pubDate": "Mon, 09 Sep 2019 19:08:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=601",
  "description": "Welcome to episode forty-eight of <em>A History of Rock Music in Five Hundred Songs</em>. This one looks at \"Love is Strange\" by Mickey and Sylvia, and how a reluctant bluesman who wrote books on jazz guitar, and a failed child star who would later become the mother of hip-hop, made a classic. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have <a href=\"https://www.patreon.com/posts/29825197\">a bonus episode available</a>. This one's on \"Ain't Nobody's Business\" by Jimmy Witherspoon, and is about blues shouting and the ambition to have a polyester suit.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-49-love-is-strange/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThe information here was pulled together from bits of pieces all over the place, as neither Mickey Baker nor Sylvia Robinson have ever had a biography published. As well as their obituaries on various news sites, my principal sources were <a href=\"https://amzn.to/2LcGb9J\"><em>Bo Diddley: Living Legend</em> by George R. White</a>, which tells Diddley's side of how the song came about, <a href=\"https://amzn.to/2ZIeSL8\"><em>Honkers and Shouters </em>by Arnold Shaw,</a> which has a six-page interview with Bob Rolontz , and <a href=\"https://amzn.to/2ULP3nU\"><em>The Big Payback: The History of the Business of Hip-Hop</em> by Dan Charnan.</a>\n\n<a href=\"https://amzn.to/2HVbH81\">This double-CD set</a> contains all of Mickey and Sylvia's releases as a duo, plus several Little Sylvia singles.\n\nAnd<a href=\"https://amzn.to/2UFIC5L\"> <em>Mississippi Delta Dues</em> </a>is an album that all blues lovers should have.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWe've talked before, of course, about the great Bo Diddley, and his main contributions to rock and roll, but today we're going to talk about a song he co-wrote which ended up, in a roundabout way, contributing to many other genres, in ways that we won't properly see until we reach the 1970s. A song that, for all that it is a classic that almost everyone knows, is still rarely treated as an important song in music history.\n\nYet this is a song that's a nexus of all sorts of music, which connects the birth of hip-hop to the compositions of Iannis Xenakis, by way of Doc Pomus, Bo Diddley, and Ike and Tina Turner.\n\nThe story of this song starts with Billy Stewart. These days, Billy Stewart is a largely unknown figure -- a minor blues man on Chess who was too close to soul music for the Chess Chicago blues fans to take him to heart.\n\nStewart, like many of the musicians we're looking at at the moment, started out in the gospel field, but moved over to vocal group R&B. In his case, he did so by occasionally filling in for a group called the Rainbows, which featured Don Covay, who would later go on to become a very well-known soul singer.\n\nThere are no recordings of Stewart with the Rainbows, but this recording of the group a few years later should give you some sort of idea what they sounded like:\n\n[Excerpt: The Rainbows, \"If You See Mary Lee\"]\n\nThrough his work with the group, Stewart got to know Bo Diddley, whose band he joined as a piano player. Stewart also signed with Chess, and his first record, \"Billy's Blues\", featured both Diddley and Diddley's guitarist Jody Williams on guitar:\n\n[Billy Stewart, \"Billy's Blues\"]\n\nWilliams came up with that guitar part, and that would lead to a lot of trouble in the future.\n\nAnd that trouble would come because of Mickey Baker.\n\nMickey Baker's birth name was McHouston Baker. Baker had a rough, impoverished, upbringing. He didn't know the identity of his father, and his mother was in and out of prison. He started out as a serious jazz musician, playing bebop, up until the point he saw the great blues musician Pee Wee Crayton:\n\n[Excerpt: Pee Wee Crayton: \"Blues After Hours\"]\n\nOr, more precisely, when he saw Crayton's Cadillac. Baker was playing difficult, complex, music that required a great amount of skill and precision. What Crayton was doing was technically far, far, easier than anything Baker was doing, and he was making far more money. So, as Baker put it, \"I started bending strings. I was starving to death, and the blues was just a financial thing for me then.\"\n\nBaker became part of an informal group of people around Atlantic Records, centred around Doc Pomus, a blues songwriter who we will hear more about in the future, along with Big Joe Turner and the saxophone player King Curtis. They were playing sophisticated city blues and R&B, and rather looked down on the country bluesmen who are now much better known, as being comparatively unsophisticated musicians. Baker's comments about “bending strings” come from this attitude, that real good music involved horns and pianos and rhythmic sophistication, and that what the Delta bluesmen were doing was something anyone can do.\n\nBaker became one of the most sought-after studio guitarists in the R&B field, and for example played the staggering lead guitar on \"Need Your Love So Bad\" by Little Willie John:\n\n[Excerpt, Little Willie John, \"Need Your Love So Bad\"]\n\nThat's some pretty good string-bending. He was also on a lot of other songs we've talked about in previous episodes. That's him on guitar on \"Mama, He Treats Your Daughter Mean\":\n\n[Excerpt: Ruth Brown, \"Mama, He Treats Your Daughter Mean\"]\n\nAnd \"Shake, Rattle, and Roll\":\n\n[Excerpt: Big Joe Turner, \"Shake, Rattle, and Roll\"]\n\nand \"Money Honey\"\n\n[Excerpt: Clyde McPhatter and the Drifters, \"Money Honey\"]\n\nAnd records by Louis Jordan, LaVern Baker, Ray Charles and more.\n\nBaker was also a guitar teacher, and one of his students was a young woman named Sylvia Vanterpool. Sylvia was, at the time, a singer who was just starting out in her career. She had recorded several unsuccessful tracks on Savoy and Jubilee records. A typical example is her version of \"I Went to Your Wedding\":\n\n[Excerpt: Little Sylvia, \"I Went to Your Wedding\"]\n\nSylvia was only thirteen when she started her career, using the name \"Little Sylvia\" -- inspired by \"Little Esther\", who like her was making records for Savoy records -- and her early recordings are a strange mix of different styles. For every syrupy ballad like \"I Went to Your Wedding\" there was a hard R&B number, more in the Little Esther style, like \"Drive, Daddy, Drive\":\n\n[Excerpt: Little Sylvia, \"Drive Daddy Drive\"]\n\nThat was the other side of the same single as \"I Went to Your Wedding\", and you can hear that while she had some vocal talent, she was not keeping to a coherent enough, distinctive enough, sound to make her into a star.\n\nBy the time she was twenty, Sylvia was holding down a day job as a typist, trying and failing to earn enough money to live on as a singer. But she'd been taking guitar lessons from Mickey Baker and had got pretty good.\n\nBut then Sylvia started dating a man named Joe Robinson.\n\nJoe Robinson was involved in some way with gangsters -- nobody has written enough detail for me to get an exact sense of what it was he did with the mob, but he had connections. And he decided he was going to become Sylvia's manager.\n\nWhile Sylvia's career was floundering, Joe thought he could beef it up. All that was needed was a gimmick.\n\nDifferent sources tell different stories about who thought of the idea, but eventually it was decided that Sylvia should join with her guitar teacher and form a duo. Some sources say that the duo was Joe Robinson's idea, and that it was inspired by the success of Gene and Eunice, Shirley and Lee, and the other vocal duos around the time.\n\nOther sources, on the other hand, talk about how Mickey Baker, who had started out as a jazz guitarist very much in the Les Paul mode, had wanted to form his own version of Les Paul and Mary Ford.\n\nEither way, the gimmick was a solid one -- a male/female duo, both of whom could sing and play the guitar, but playing that string-bending music that Mickey was making money from.\n\nAnd the two of them had chemistry -- at least on stage and on recordings. Off stage, they soon began to grate on each other. Mickey was a man who had no interest in stardom or financial success -- he was a rather studious, private, man who just wanted to make music and get better at his instrument, while Sylvia had a razor-sharp business mind, a huge amount of ambition, and a desire for stardom. But they worked well as a musical team, even if they were never going to be the best of friends.\n\nOriginally, they signed with a label called Rainbow Records, a medium-sized indie label in New York, where they put out their first single, \"I'm So Glad\". It's not an especially good record, and it does seem to have a bit of Gene and Eunice to it, and almost none of the distinctive guitar that would characterise their later work -- just some stabbing punctuation on the middle eight and a rather perfunctory solo. The B-side, though, \"Se De Boom Run Dun\", while it's also far from a wonderful song, does have the semi-calypso rhythm that would later make them famous:\n\n[Excerpt: Mickey and Sylvia, \"Se De Boom Run Dun\"]\n\nUnsurprisingly, it didn't sell, and nor did the follow-ups. But the records did get some airplay in New York, if nowhere else, and that brought them to the attention of Bob Rolontz at Groove Records.\n\nGroove Records was a subsidiary of RCA, set up in 1953. At that time, the major record labels had a problem, which we've talked about before. For years, none of them had put out R&B records, and the small labels that did put out R&B had been locked out of the distribution networks that the major labels dominated. The result had been that a whole independent network of shops -- usually black-owned businesses selling to black customers -- had sprung up that only sold R&B records.\n\nThose shops had no interest in selling the records put out by the major labels -- their customers weren't interested in Doris Day or Frank Sinatra, they wanted Wynonie Harris and Johnny Otis, so why would the shop want to stock anything by Columbia or Decca or RCA, when there was Modern and Chess and Federal and King and Sun and RPM out there making the kind of records their customers liked?\n\nBut, of course, the major labels still wanted to sell to those customers. After all, there was money out there in the pockets of people who weren't shareholders in RCA or Columbia, and in the eyes of those shareholders that was the greatest injustice in the world, and one that needed to be rectified forthwith.\n\nAnd so those labels set up their own mini-divisions, to sell to those shops. They had different labels, because the shops wouldn't buy from the majors, but they were wholly-owned subsidiaries. Fake indie labels. And Groove was one of them.\n\nGroove Records had had a minor hit in 1955 with the piano player Piano Red, and his \"Jump Man Jump\":\n\n[Excerpt: Piano Red, \"Jump Man Jump\"]\n\nThey hadn't had a huge amount of commercial success since, but Rolontz thought that Mickey and Sylvia could be the ones to bring him that success. Rolontz put them together with the saxophonist and arranger King Curtis, who Mickey already knew from his work with Doc Pomus, and Curtis put together a team of the best R&B musicians in New York, many of them the same people who would play on most of Atlantic's sessions.\n\nMickey and Sylvia's first single on Groove, \"Walking in the Rain\", had the potential to be a big hit in the eyes of the record company:\n\n[Excerpt: Mickey and Sylvia, \"Walking in the Rain\"]\n\nBut unfortunately for them, Johnnie Ray put out this at around the same time:\n\n[Excerpt: Johnnie Ray, \"Just Walking in the Rain\"]\n\nThat's a totally different song, of course -- it's a cover version of one of the first records ever released on Sun Records, a few years earlier, originally by a vocal group called the Prisonaires. But customers were understandably confused by the presence of two songs with almost identical titles in the market, and so Mickey and Sylvia's song tanked. They still didn't have that hit they needed.\n\nBut at that point, fate intervened in the form of Bo Diddley.\n\nIn May 1956, Diddley had written and recorded a song called \"Love is Strange\", and not got round to releasing it. Jody Williams, who was in Diddley's band at the time, had played the lead guitar on the session, and he'd reused the licks he had used for \"Billy's Blues\" on the song:\n\n[Excerpt: Bo Diddley, \"Love is Strange\"]\n\nAt the time, Diddley was friendly with Mickey Baker, and was using Baker as a session guitarist on outside recordings he was producing for other artists, including recordings with Billy Stewart and with the Marquees, a vocal group which featured a young singer named Marvin Gaye:\n\n[Excerpt: The Marquees, \"Wyatt Earp\"]\n\nAs a result, Mickey and Sylvia ended up playing a few shows on the same bill as Diddley, and at one of the shows, Williams, who was attracted to Sylvia, decided to play \"Love is Strange\" for her. Sylvia liked the song, and Mickey and Sylvia decided to record it.\n\n[Excerpt: Mickey and Sylvia, \"Love is Strange\"]\n\nNow, Diddley claimed that what he told the song's publishers was that Jody Williams wrote the music, while he wrote the lyrics, but he asked that the credit for the lyrics be put in the name of his wife Ethel Smith.\n\nWhile Smith's name made the credits, Williams' didn't, and Williams blamed Diddley for the omission, while Diddley just said (with some evidence) that most of the people he signed contracts with were liars and thieves, and that it didn't surprise him that they'd missed Williams' name off.\n\nWe'll never know for sure what was actually in Diddley's contracts because, again according to Diddley, just before he and Smith divorced she burned all his papers so she could claim that he never gave her any money and he couldn't prove otherwise.\n\nWilliams never believed him, and the two didn't speak for decades.\n\nMeanwhile, two other people were credited as writers on the song -- Mickey and Sylvia themselves. This is presumably for the changes that were made between Diddley's demo and the finished song, which mostly amount to Baker's lead guitar part and to the famous spoken-word section of the song in the middle:\n\n[Excerpt: Mickey and Sylvia, \"Love is Strange\", spoken word section]\n\nAccording to Diddley, he also later sold his own share in the song to Sylvia, some time in the early sixties. This may well be the case, because Sylvia Vanterpool went on to become a very, very successful businesswoman, who made a lot of very wise business decisions.\n\nEither way, \"Love is Strange\" was a big hit. It went to number eleven in the pop charts and number one on the R&B chart. It's one of those records that everyone knows, and it went on to be covered by dozens upon dozens of performers, including The Maddox Brothers and Rose:\n\n[Excerpt: The Maddox Brothers and Rose, \"Love is Strange\". All very short excerpts here]\n\nThe Everly Brothers:\n\n[Excerpt: The Everly Brothers, \"Love is Strange\"]\n\nAnd Paul McCartney and Wings:\n\n[Excerpt: Wings, \"Love is Strange\"]\n\nAnd Jody Williams never saw a penny from it.\n\nBut after Groove Records had had this breakthrough big hit, RCA decided to close the label down, and move the acts on the label, and their producer Rolontz, to another subsidiary, Vik. Vik Records had, according to Rolontz, \"probably the worst collection of talent in the history of the world\", and was severely in debt. All the momentum for their career was gone.\n\nMickey and Sylvia would release many more records, but they would have diminishing returns. Their next record went top ten R&B, but only number forty-seven on the pop charts, and the record after that did even worse, only reaching number eighty-five in the hot one hundred, even though it was another Bo Diddley ballad very much in the same vein as \"Love is Strange\":\n\n[Excerpt: Mickey and Sylvia, \"Dearest\"]\n\nBut even though that wasn't a big hit record, it was a favourite of Buddy Holly -- a singer who at this time was just starting out in his own career. You can tell how much Holly liked Mickey and Sylvia, though, just by comparing the way he sings the word “baby” on many of his records to the way Sylvia sings it in “Love is Strange”, and he recorded his own home demos of both \"Love is Strange\" and \"Dearest\" -- demos which were released on singles after his death:\n\n[Excerpt: Buddy Holly, \"Dearest\"]\n\nBut \"Dearest\" was so obscure that when Holly's single came out, the song was titled \"Umm Oh Yeah\", and credited to \"unknown\" for many years, because no-one at the record label had heard the earlier record.\n\nMickey and Sylvia would have several more records in the hot one hundred, but the highest would only reach number forty-six. But while they had no more hits under their own names, they did have another hit...\n\nas Ike Turner.\n\nAfter Mickey and Sylvia were dropped along with the rest of the Vik artists, they split up temporarily, but then got back together to start their own company, Willow Records, to release their material. Ike Turner played on some of their records, and to return the favour they agreed to produce a record for Ike and Tina Turner.\n\nThe song chosen was called \"It's Gonna Work Out Fine\", and it was co-written by the great R&B songwriter Rose Marie McCoy, who had written for Elvis, Nat \"King\" Cole, Nappy Brown, and many others. The other credited co-writer is one Sylvia McKinney, who some sources suggest is the same person as Sylvia Vanterpool -- who had by this point married Joe Robinson and changed her name to Sylvia Robinson.\n\nWhether she was the other co-writer or not, Mickey and Sylvia had recorded a version of the song for Vik Records, but it hadn't been released, and so they suggested to Ike that the song would work as an Ike and Tina Turner record -- and they would produce and arrange it for them.\n\nIndeed they did more than that. They *were* Ike Turner on the record -- Sylvia played the lead guitar part, while Mickey did the spoken \"Ike\" vocals, which Ike would do live. Sylvia also joined the Ikettes on backing vocals, and while Mickey and Sylvia aren't the credited producers, the end result is essentially a Mickey and Sylvia record with guest vocals from Tina Turner:\n\n[Excerpt: Ike and Tina Turner, \"It's Gonna Work Out Fine\"]\n\nThat record sold over a million copies, and got a Grammy nomination.\n\nHowever, Mickey and Sylvia's recordings under their own name were still having no success, and Mickey was also having problems because his then-wife was white, and with the particularly virulent form of racism the US was suffering through at the time, he didn't want to be in the country any more.\n\nHe was also becoming more and more interested in the academic side of music. He had already, in 1955, written a book, the Complete Course in Jazz Guitar, which is still available today and highly regarded.\n\nSo he moved to Europe, and went back into jazz, performing with people like Coleman Hawkins:\n\n[Excerpt: Mickey Baker and Coleman Hawkins: \"South of France Blues\"]\n\nBut he did more than just jazz. He studied composition with Iannis Xennakis and started writing fugues and a concerto for guitar and orchestra, \"The Blues Suite\". Unfortunately, while some of that music was recorded, it only appears to have been released on now out of print and expensive vinyl which no-one has uploaded to the Internet, so I can't excerpt it for you here.\n\nWhat I *can* excerpt is a project he did in the mid-1970s, an album called \"Mississippi Delta Dues\", released under his birth name McHouston Baker, where he paid tribute to the country bluesmen he'd looked down on early on by performing their songs, along with some of his own in a similar style. It's an odd album, in which sometimes he does a straight soundalike, like this version of Robert Johnson's \"Terraplane Blues\":\n\n[Excerpt: McHouston Baker, \"Terraplane Blues\"]\n\nAnd sometimes he uses strings. Sometimes this is just as a standard pop-style string section, but sometimes he's using them in ways he learned from Xenakkis, like on this version of J.B. Lenoir's \"Alabama Blues\", rewritten as \"Alabama March\", which ends up sounding like nothing as much as Scott Walker:\n\n[Excerpt: McHouston Baker, \"Alabama March\"]\n\nBaker carried on performing music of all kinds around Europe until his death in 2011. He died massively respected for his contributions to blues, jazz, R&B, and the technical proficiency of generations of guitarists.\n\nSylvia Robinson made even more of a contribution. After a few years off to have kids after the duo split up, she set up her own record label, All Platinum. For All Platinum she wrote and produced a number of proto-disco hits for other people in the late sixties and early seventies. Those included \"Shame Shame Shame\" for Shirley and Company:\n\n[Excerpt: Shirley and Company, \"Shame Shame Shame\"]\n\nThat's the song that inspired David Bowie, John Lennon, and Carlos Alomar to rework a song Bowie and Alomar had been working on, called \"Footstompin'\", into \"Fame\".\n\nSylvia also had a hit of her own, with a song called \"Pillow Talk\" that she'd written for Al Green, but which he'd turned down due to its blatant sexuality conflicting with his newfound religion:\n\n[Excerpt: Sylvia, \"Pillow Talk\"]\n\nBut I'm afraid we're going to have to wait more than two years before we find out more about Sylvia's biggest contribution to music, because Sylvia Robinson, who had been Little Sylvia and the woman calling her lover-boy, became to hip-hop what Sam Phillips was to rock and roll, and when we get to 1979 we will be looking at how, with financing from her husband's gangster friend Morris Levy, someone from the first wave of rock and roll stars was more responsible than anyone for seeing commercial potential in the music that eventually took rock's cultural place.",
  "itunes:subtitle": "Welcome to episode forty-eight of A History of Rock Music in Five Hundred Songs. This one looks at Love is Strange by Mickey and Sylvia, and how a reluctant bluesman who wrote books on jazz guitar, and a failed child star who would later become the mothe",
  "itunes:keywords": "Atlantic Records,Big Joe turner,Bo Diddley,Buddy Holly,Doc Pomus,Ike Turner,Jody Williams,King Curtis,Mickey and Sylvia,Mickey Baker,RCA Records,Ruth Brown,Sylvia Vanterpool,the blues,The Drifters,Tina Turner",
  "itunes:episodeType": "full",
  "itunes:episode": 49,
  "content:encoded": "Welcome to episode forty-eight of <em>A History of Rock Music in Five Hundred Songs</em>. This one looks at \"Love is Strange\" by Mickey and Sylvia, and how a reluctant bluesman who wrote books on jazz guitar, and a failed child star who would later become the mother of hip-hop, made a classic. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have <a href=\"https://www.patreon.com/posts/29825197\">a bonus episode available</a>. This one's on \"Ain't Nobody's Business\" by Jimmy Witherspoon, and is about blues shouting and the ambition to have a polyester suit.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-49-love-is-strange/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThe information here was pulled together from bits of pieces all over the place, as neither Mickey Baker nor Sylvia Robinson have ever had a biography published. As well as their obituaries on various news sites, my principal sources were <a href=\"https://amzn.to/2LcGb9J\"><em>Bo Diddley: Living Legend</em> by George R. White</a>, which tells Diddley's side of how the song came about, <a href=\"https://amzn.to/2ZIeSL8\"><em>Honkers and Shouters </em>by Arnold Shaw,</a> which has a six-page interview with Bob Rolontz , and <a href=\"https://amzn.to/2ULP3nU\"><em>The Big Payback: The History of the Business of Hip-Hop</em> by Dan Charnan.</a>\n\n<a href=\"https://amzn.to/2HVbH81\">This double-CD set</a> contains all of Mickey and Sylvia's releases as a duo, plus several Little Sylvia singles.\n\nAnd<a href=\"https://amzn.to/2UFIC5L\"> <em>Mississippi Delta Dues</em> </a>is an album that all blues lovers should have.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWe've talked before, of course, about the great Bo Diddley, and his main contributions to rock and roll, but today we're going to talk about a song he co-wrote which ended up, in a roundabout way, contributing to many other genres, in ways that we won't properly see until we reach the 1970s. A song that, for all that it is a classic that almost everyone knows, is still rarely treated as an important song in music history.\n\nYet this is a song that's a nexus of all sorts of music, which connects the birth of hip-hop to the compositions of Iannis Xenakis, by way of Doc Pomus, Bo Diddley, and Ike and Tina Turner.\n\nThe story of this song starts with Billy Stewart. These days, Billy Stewart is a largely unknown figure -- a minor blues man on Chess who was too close to soul music for the Chess Chicago blues fans to take him to heart.\n\nStewart, like many of the musicians we're looking at at the moment, started out in the gospel field, but moved over to vocal group R&B. In his case, he did so by occasionally filling in for a group called the Rainbows, which featured Don Covay, who would later go on to become a very well-known soul singer.\n\nThere are no recordings of Stewart with the Rainbows, but this recording of the group a few years later should give you some sort of idea what they sounded like:\n\n[Excerpt: The Rainbows, \"If You See Mary Lee\"]\n\nThrough his work with the group, Stewart got to know Bo Diddley, whose band he joined as a piano player. Stewart also signed with Chess, and his first record, \"Billy's Blues\", featured both Diddley and Diddley's guitarist Jody Williams on guitar:\n\n[Billy Stewart, \"Billy's Blues\"]\n\nWilliams came up with that guitar part, and that would lead to a lot of trouble in the future.\n\nAnd that trouble would come because of Mickey Baker.\n\nMickey Baker's birth name was McHouston Baker. Baker had a rough, impoverished, upbringing. He didn't know the identity of his father, and his mother was in and out of prison. He started out as a serious jazz musician, playing bebop, up until the point he saw the great blues musician Pee Wee Crayton:\n\n[Excerpt: Pee Wee Crayton: \"Blues After Hours\"]\n\nOr, more precisely, when he saw Crayton's Cadillac. Baker was playing difficult, complex, music that required a great amount of skill and precision. What Crayton was doing was technically far, far, easier than anything Baker was doing, and he was making far more money. So, as Baker put it, \"I started bending strings. I was starving to death, and the blues was just a financial thing for me then.\"\n\nBaker became part of an informal group of people around Atlantic Records, centred around Doc Pomus, a blues songwriter who we will hear more about in the future, along with Big Joe Turner and the saxophone player King Curtis. They were playing sophisticated city blues and R&B, and rather looked down on the country bluesmen who are now much better known, as being comparatively unsophisticated musicians. Baker's comments about “bending strings” come from this attitude, that real good music involved horns and pianos and rhythmic sophistication, and that what the Delta bluesmen were doing was something anyone can do.\n\nBaker became one of the most sought-after studio guitarists in the R&B field, and for example played the staggering lead guitar on \"Need Your Love So Bad\" by Little Willie John:\n\n[Excerpt, Little Willie John, \"Need Your Love So Bad\"]\n\nThat's some pretty good string-bending. He was also on a lot of other songs we've talked about in previous episodes. That's him on guitar on \"Mama, He Treats Your Daughter Mean\":\n\n[Excerpt: Ruth Brown, \"Mama, He Treats Your Daughter Mean\"]\n\nAnd \"Shake, Rattle, and Roll\":\n\n[Excerpt: Big Joe Turner, \"Shake, Rattle, and Roll\"]\n\nand \"Money Honey\"\n\n[Excerpt: Clyde McPhatter and the Drifters, \"Money Honey\"]\n\nAnd records by Louis Jordan, LaVern Baker, Ray Charles and more.\n\nBaker was also a guitar teacher, and one of his students was a young woman named Sylvia Vanterpool. Sylvia was, at the time, a singer who was just starting out in her career. She had recorded several unsuccessful tracks on Savoy and Jubilee records. A typical example is her version of \"I Went to Your Wedding\":\n\n[Excerpt: Little Sylvia, \"I Went to Your Wedding\"]\n\nSylvia was only thirteen when she started her career, using the name \"Little Sylvia\" -- inspired by \"Little Esther\", who like her was making records for Savoy records -- and her early recordings are a strange mix of different styles. For every syrupy ballad like \"I Went to Your Wedding\" there was a hard R&B number, more in the Little Esther style, like \"Drive, Daddy, Drive\":\n\n[Excerpt: Little Sylvia, \"Drive Daddy Drive\"]\n\nThat was the other side of the same single as \"I Went to Your Wedding\", and you can hear that while she had some vocal talent, she was not keeping to a coherent enough, distinctive enough, sound to make her into a star.\n\nBy the time she was twenty, Sylvia was holding down a day job as a typist, trying and failing to earn enough money to live on as a singer. But she'd been taking guitar lessons from Mickey Baker and had got pretty good.\n\nBut then Sylvia started dating a man named Joe Robinson.\n\nJoe Robinson was involved in some way with gangsters -- nobody has written enough detail for me to get an exact sense of what it was he did with the mob, but he had connections. And he decided he was going to become Sylvia's manager.\n\nWhile Sylvia's career was floundering, Joe thought he could beef it up. All that was needed was a gimmick.\n\nDifferent sources tell different stories about who thought of the idea, but eventually it was decided that Sylvia should join with her guitar teacher and form a duo. Some sources say that the duo was Joe Robinson's idea, and that it was inspired by the success of Gene and Eunice, Shirley and Lee, and the other vocal duos around the time.\n\nOther sources, on the other hand, talk about how Mickey Baker, who had started out as a jazz guitarist very much in the Les Paul mode, had wanted to form his own version of Les Paul and Mary Ford.\n\nEither way, the gimmick was a solid one -- a male/female duo, both of whom could sing and play the guitar, but playing that string-bending music that Mickey was making money from.\n\nAnd the two of them had chemistry -- at least on stage and on recordings. Off stage, they soon began to grate on each other. Mickey was a man who had no interest in stardom or financial success -- he was a rather studious, private, man who just wanted to make music and get better at his instrument, while Sylvia had a razor-sharp business mind, a huge amount of ambition, and a desire for stardom. But they worked well as a musical team, even if they were never going to be the best of friends.\n\nOriginally, they signed with a label called Rainbow Records, a medium-sized indie label in New York, where they put out their first single, \"I'm So Glad\". It's not an especially good record, and it does seem to have a bit of Gene and Eunice to it, and almost none of the distinctive guitar that would characterise their later work -- just some stabbing punctuation on the middle eight and a rather perfunctory solo. The B-side, though, \"Se De Boom Run Dun\", while it's also far from a wonderful song, does have the semi-calypso rhythm that would later make them famous:\n\n[Excerpt: Mickey and Sylvia, \"Se De Boom Run Dun\"]\n\nUnsurprisingly, it didn't sell, and nor did the follow-ups. But the records did get some airplay in New York, if nowhere else, and that brought them to the attention of Bob Rolontz at Groove Records.\n\nGroove Records was a subsidiary of RCA, set up in 1953. At that time, the major record labels had a problem, which we've talked about before. For years, none of them had put out R&B records, and the small labels that did put out R&B had been locked out of the distribution networks that the major labels dominated. The result had been that a whole independent network of shops -- usually black-owned businesses selling to black customers -- had sprung up that only sold R&B records.\n\nThose shops had no interest in selling the records put out by the major labels -- their customers weren't interested in Doris Day or Frank Sinatra, they wanted Wynonie Harris and Johnny Otis, so why would the shop want to stock anything by Columbia or Decca or RCA, when there was Modern and Chess and Federal and King and Sun and RPM out there making the kind of records their customers liked?\n\nBut, of course, the major labels still wanted to sell to those customers. After all, there was money out there in the pockets of people who weren't shareholders in RCA or Columbia, and in the eyes of those shareholders that was the greatest injustice in the world, and one that needed to be rectified forthwith.\n\nAnd so those labels set up their own mini-divisions, to sell to those shops. They had different labels, because the shops wouldn't buy from the majors, but they were wholly-owned subsidiaries. Fake indie labels. And Groove was one of them.\n\nGroove Records had had a minor hit in 1955 with the piano player Piano Red, and his \"Jump Man Jump\":\n\n[Excerpt: Piano Red, \"Jump Man Jump\"]\n\nThey hadn't had a huge amount of commercial success since, but Rolontz thought that Mickey and Sylvia could be the ones to bring him that success. Rolontz put them together with the saxophonist and arranger King Curtis, who Mickey already knew from his work with Doc Pomus, and Curtis put together a team of the best R&B musicians in New York, many of them the same people who would play on most of Atlantic's sessions.\n\nMickey and Sylvia's first single on Groove, \"Walking in the Rain\", had the potential to be a big hit in the eyes of the record company:\n\n[Excerpt: Mickey and Sylvia, \"Walking in the Rain\"]\n\nBut unfortunately for them, Johnnie Ray put out this at around the same time:\n\n[Excerpt: Johnnie Ray, \"Just Walking in the Rain\"]\n\nThat's a totally different song, of course -- it's a cover version of one of the first records ever released on Sun Records, a few years earlier, originally by a vocal group called the Prisonaires. But customers were understandably confused by the presence of two songs with almost identical titles in the market, and so Mickey and Sylvia's song tanked. They still didn't have that hit they needed.\n\nBut at that point, fate intervened in the form of Bo Diddley.\n\nIn May 1956, Diddley had written and recorded a song called \"Love is Strange\", and not got round to releasing it. Jody Williams, who was in Diddley's band at the time, had played the lead guitar on the session, and he'd reused the licks he had used for \"Billy's Blues\" on the song:\n\n[Excerpt: Bo Diddley, \"Love is Strange\"]\n\nAt the time, Diddley was friendly with Mickey Baker, and was using Baker as a session guitarist on outside recordings he was producing for other artists, including recordings with Billy Stewart and with the Marquees, a vocal group which featured a young singer named Marvin Gaye:\n\n[Excerpt: The Marquees, \"Wyatt Earp\"]\n\nAs a result, Mickey and Sylvia ended up playing a few shows on the same bill as Diddley, and at one of the shows, Williams, who was attracted to Sylvia, decided to play \"Love is Strange\" for her. Sylvia liked the song, and Mickey and Sylvia decided to record it.\n\n[Excerpt: Mickey and Sylvia, \"Love is Strange\"]\n\nNow, Diddley claimed that what he told the song's publishers was that Jody Williams wrote the music, while he wrote the lyrics, but he asked that the credit for the lyrics be put in the name of his wife Ethel Smith.\n\nWhile Smith's name made the credits, Williams' didn't, and Williams blamed Diddley for the omission, while Diddley just said (with some evidence) that most of the people he signed contracts with were liars and thieves, and that it didn't surprise him that they'd missed Williams' name off.\n\nWe'll never know for sure what was actually in Diddley's contracts because, again according to Diddley, just before he and Smith divorced she burned all his papers so she could claim that he never gave her any money and he couldn't prove otherwise.\n\nWilliams never believed him, and the two didn't speak for decades.\n\nMeanwhile, two other people were credited as writers on the song -- Mickey and Sylvia themselves. This is presumably for the changes that were made between Diddley's demo and the finished song, which mostly amount to Baker's lead guitar part and to the famous spoken-word section of the song in the middle:\n\n[Excerpt: Mickey and Sylvia, \"Love is Strange\", spoken word section]\n\nAccording to Diddley, he also later sold his own share in the song to Sylvia, some time in the early sixties. This may well be the case, because Sylvia Vanterpool went on to become a very, very successful businesswoman, who made a lot of very wise business decisions.\n\nEither way, \"Love is Strange\" was a big hit. It went to number eleven in the pop charts and number one on the R&B chart. It's one of those records that everyone knows, and it went on to be covered by dozens upon dozens of performers, including The Maddox Brothers and Rose:\n\n[Excerpt: The Maddox Brothers and Rose, \"Love is Strange\". All very short excerpts here]\n\nThe Everly Brothers:\n\n[Excerpt: The Everly Brothers, \"Love is Strange\"]\n\nAnd Paul McCartney and Wings:\n\n[Excerpt: Wings, \"Love is Strange\"]\n\nAnd Jody Williams never saw a penny from it.\n\nBut after Groove Records had had this breakthrough big hit, RCA decided to close the label down, and move the acts on the label, and their producer Rolontz, to another subsidiary, Vik. Vik Records had, according to Rolontz, \"probably the worst collection of talent in the history of the world\", and was severely in debt. All the momentum for their career was gone.\n\nMickey and Sylvia would release many more records, but they would have diminishing returns. Their next record went top ten R&B, but only number forty-seven on the pop charts, and the record after that did even worse, only reaching number eighty-five in the hot one hundred, even though it was another Bo Diddley ballad very much in the same vein as \"Love is Strange\":\n\n[Excerpt: Mickey and Sylvia, \"Dearest\"]\n\nBut even though that wasn't a big hit record, it was a favourite of Buddy Holly -- a singer who at this time was just starting out in his own career. You can tell how much Holly liked Mickey and Sylvia, though, just by comparing the way he sings the word “baby” on many of his records to the way Sylvia sings it in “Love is Strange”, and he recorded his own home demos of both \"Love is Strange\" and \"Dearest\" -- demos which were released on singles after his death:\n\n[Excerpt: Buddy Holly, \"Dearest\"]\n\nBut \"Dearest\" was so obscure that when Holly's single came out, the song was titled \"Umm Oh Yeah\", and credited to \"unknown\" for many years, because no-one at the record label had heard the earlier record.\n\nMickey and Sylvia would have several more records in the hot one hundred, but the highest would only reach number forty-six. But while they had no more hits under their own names, they did have another hit...\n\nas Ike Turner.\n\nAfter Mickey and Sylvia were dropped along with the rest of the Vik artists, they split up temporarily, but then got back together to start their own company, Willow Records, to release their material. Ike Turner played on some of their records, and to return the favour they agreed to produce a record for Ike and Tina Turner.\n\nThe song chosen was called \"It's Gonna Work Out Fine\", and it was co-written by the great R&B songwriter Rose Marie McCoy, who had written for Elvis, Nat \"King\" Cole, Nappy Brown, and many others. The other credited co-writer is one Sylvia McKinney, who some sources suggest is the same person as Sylvia Vanterpool -- who had by this point married Joe Robinson and changed her name to Sylvia Robinson.\n\nWhether she was the other co-writer or not, Mickey and Sylvia had recorded a version of the song for Vik Records, but it hadn't been released, and so they suggested to Ike that the song would work as an Ike and Tina Turner record -- and they would produce and arrange it for them.\n\nIndeed they did more than that. They *were* Ike Turner on the record -- Sylvia played the lead guitar part, while Mickey did the spoken \"Ike\" vocals, which Ike would do live. Sylvia also joined the Ikettes on backing vocals, and while Mickey and Sylvia aren't the credited producers, the end result is essentially a Mickey and Sylvia record with guest vocals from Tina Turner:\n\n[Excerpt: Ike and Tina Turner, \"It's Gonna Work Out Fine\"]\n\nThat record sold over a million copies, and got a Grammy nomination.\n\nHowever, Mickey and Sylvia's recordings under their own name were still having no success, and Mickey was also having problems because his then-wife was white, and with the particularly virulent form of racism the US was suffering through at the time, he didn't want to be in the country any more.\n\nHe was also becoming more and more interested in the academic side of music. He had already, in 1955, written a book, the Complete Course in Jazz Guitar, which is still available today and highly regarded.\n\nSo he moved to Europe, and went back into jazz, performing with people like Coleman Hawkins:\n\n[Excerpt: Mickey Baker and Coleman Hawkins: \"South of France Blues\"]\n\nBut he did more than just jazz. He studied composition with Iannis Xennakis and started writing fugues and a concerto for guitar and orchestra, \"The Blues Suite\". Unfortunately, while some of that music was recorded, it only appears to have been released on now out of print and expensive vinyl which no-one has uploaded to the Internet, so I can't excerpt it for you here.\n\nWhat I *can* excerpt is a project he did in the mid-1970s, an album called \"Mississippi Delta Dues\", released under his birth name McHouston Baker, where he paid tribute to the country bluesmen he'd looked down on early on by performing their songs, along with some of his own in a similar style. It's an odd album, in which sometimes he does a straight soundalike, like this version of Robert Johnson's \"Terraplane Blues\":\n\n[Excerpt: McHouston Baker, \"Terraplane Blues\"]\n\nAnd sometimes he uses strings. Sometimes this is just as a standard pop-style string section, but sometimes he's using them in ways he learned from Xenakkis, like on this version of J.B. Lenoir's \"Alabama Blues\", rewritten as \"Alabama March\", which ends up sounding like nothing as much as Scott Walker:\n\n[Excerpt: McHouston Baker, \"Alabama March\"]\n\nBaker carried on performing music of all kinds around Europe until his death in 2011. He died massively respected for his contributions to blues, jazz, R&B, and the technical proficiency of generations of guitarists.\n\nSylvia Robinson made even more of a contribution. After a few years off to have kids after the duo split up, she set up her own record label, All Platinum. For All Platinum she wrote and produced a number of proto-disco hits for other people in the late sixties and early seventies. Those included \"Shame Shame Shame\" for Shirley and Company:\n\n[Excerpt: Shirley and Company, \"Shame Shame Shame\"]\n\nThat's the song that inspired David Bowie, John Lennon, and Carlos Alomar to rework a song Bowie and Alomar had been working on, called \"Footstompin'\", into \"Fame\".\n\nSylvia also had a hit of her own, with a song called \"Pillow Talk\" that she'd written for Al Green, but which he'd turned down due to its blatant sexuality conflicting with his newfound religion:\n\n[Excerpt: Sylvia, \"Pillow Talk\"]\n\nBut I'm afraid we're going to have to wait more than two years before we find out more about Sylvia's biggest contribution to music, because Sylvia Robinson, who had been Little Sylvia and the woman calling her lover-boy, became to hip-hop what Sam Phillips was to rock and roll, and when we get to 1979 we will be looking at how, with financing from her husband's gangster friend Morris Levy, someone from the first wave of rock and roll stars was more responsible than anyone for seeing commercial potential in the music that eventually took rock's cultural place.",
  "enclosure": "",
  "itunes:summary": "Welcome to episode forty-eight of A History of Rock Music in Five Hundred Songs. This one looks at \"Love is Strange\" by Mickey and Sylvia, and how a reluctant bluesman who wrote books on jazz guitar, and a failed child star who would later become the mother of hip-hop, made a classic. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a bonus episode available. This one's on \"Ain't Nobody's Business\" by Jimmy Witherspoon, and is about blues shouting and the ambition to have a polyester suit.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThe information here was pulled together from bits of pieces all over the place, as neither Mickey Baker nor Sylvia Robinson have ever had a biography published. As well as their obituaries on various news sites, my principal sources were Bo Diddley: Living Legend by George R. White, which tells Diddley's side of how the song came about, Honkers and Shouters by Arnold Shaw, which has a six-page interview with Bob Rolontz , and The Big Payback: The History of the Business of Hip-Hop by Dan Charnan.\n\nThis double-CD set contains all of Mickey and Sylvia's releases as a duo, plus several Little Sylvia singles.\n\nAnd Mississippi Delta Dues is an album that all blues lovers should have.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nWe've talked before, of course, about the great Bo Diddley, and his main contributions to rock and roll, but today we're going to talk about a song he co-wrote which ended up, in a roundabout way, contributing to many other genres, in ways that we won't properly see until we reach the 1970s. A song that, for all that it is a classic that almost everyone knows, is still rarely treated as an important song in music history.\n\nYet this is a song that's a nexus of all sorts of music, which connects the birth of hip-hop to the compositions of Iannis Xenakis, by way of Doc Pomus, Bo Diddley, and Ike and Tina Turner.\n\nThe story of this song starts with Billy Stewart. These days, Billy Stewart is a largely unknown figure -- a minor blues man on Chess who was too close to soul music for the Chess Chicago blues fans to take him to heart.\n\nStewart, like many of the musicians we're looking at at the moment, started out in the gospel field, but moved over to vocal group R&B. In his case, he did so by occasionally filling in for a group called the Rainbows, which featured Don Covay, who would later go on to become a very well-known soul singer.\n\nThere are no recordings of Stewart with the Rainbows, but this recording of the group a few years later should give you some sort of idea what they sounded like:\n\n[Excerpt: The Rainbows, \"If You See Mary Lee\"]\n\nThrough his work with the group, Stewart got to know Bo Diddley, whose band he joined as a piano player. Stewart also signed with Chess, and his first record, \"Billy's Blues\", featured both Diddley and Diddley's guitarist Jody Williams on guitar:\n\n[Billy Stewart, \"Billy's Blues\"]\n\nWilliams came up with that guitar part, and that would lead to a lot of trouble in the future.\n\nAnd that trouble would come because of Mickey Baker.\n\nMickey Baker's birth name was McHouston Baker. Baker had a rough, impoverished, upbringing. He didn't know the identity of his father, and his mother was in and out of prison. He started out as a serious jazz musician, playing bebop, up until the point he saw the great blues musician Pee Wee Crayton:\n\n[Excerpt: Pee Wee Crayton: \"Blues After Hours\"]\n\nOr, more precisely, when he saw Crayton's Cadillac. Baker was playing difficult, complex, music that required a great amount of skill and precision. What Crayton was doing was technically far, far, easier than anything Baker was doing, and he was making far more money. So, as Baker put it, \"I started bending strings. I was starving to death, and th",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode forty-eight of A History of Rock Music in Five Hundred Songs. This one looks at \"Love is Strange\" by Mickey and Sylvia, and how a reluctant bluesman who wrote books on jazz guitar, and a failed child star who would later become the mother of hip-hop, made a classic. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a bonus episode available. This one's on \"Ain't Nobody's Business\" by Jimmy Witherspoon, and is about blues shouting and the ambition to have a polyester suit.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThe information here was pulled together from bits of pieces all over the place, as neither Mickey Baker nor Sylvia Robinson have ever had a biography published. As well as their obituaries on various news sites, my principal sources were Bo Diddley: Living Legend by George R. White, which tells Diddley",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}