{
  "title": "508: How To Tell Fred and George Weasley Apart, and More Twin Talk",
  "link": "https://audioboom.com/posts/7837563",
  "itunes:episode": 508,
  "itunes:title": "How To Tell Fred and George Weasley Apart, and More Twin Talk",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3996,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>News: Warner Bros' <a href=\"https://www.theverge.com/2021/3/23/22346613/warner-bros-theatrical-releases-2022-hbo-max\">recent deal with Regal</a> means a shorter window between theaters and streaming for future Wizarding World films.</li>\n<li>This week, we focus our attention on Fred and George Weasley, in celebration of their April 1st birthday.</li>\n<li>Following up on <a href=\"https://www.mugglecast.com/episode-503-ron-weasley-podcast/\">our Ron discussion</a>, we read the Twins' horoscope (Aries) for insight into their personality.</li>\n<li>Is it strange for George to marry Angelina Johnson, after Fred's death? The hosts weigh in.</li>\n<li>The Weasley Twins have traits that can be found in each of their other family members, like Percy's ambition and Arthur's ingenuity.</li>\n<li>Are Fred and George the most entrepreneurial characters in <em>Harry Potter</em>?</li>\n<li>Eric asks: Can readers readily tell the twins apart from one another in the books? It turns out, Fred and George really do have different personalities!</li>\n<li>One of the twins often \"goes too far,\" while the other is more restrained. The hosts read textual evidence to support the findings.</li>\n<li>From harming childhood pets to forcing Unbreakable Vows and feeding acid pops, one Weasley Twin sure has a mean streak, even toward his family members!</li>\n<li>Check out <a href=\"https://www.mugglecast.com/episode-235/\">MuggleCast #235</a> for our interview with Oliver Phelps.</li>\n<li>Our <a href=\"https://www.patreon.com/mugglecast/\">patrons</a> weigh in on the top Weasley Twins moments... together.</li>\n<li>On Bonus MuggleCast, available on Patreon this week, the hosts celebrate March Madness by competing in a Weasley Twins Quotes bracket</li>\n<li>The MuggleCasters gift each other one product from Weasleys' Wizard Wheezes.</li>\n<li>Quizzitch: What TWO things do the Twins bewitch Percy's badge to say in the books? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like access to our recording studio, Bonus MuggleCast a personalized thank you video from one of the hosts and more!</li>\n<li>This week's MuggleCast is brought to you by ThirdLove. Visit <a href=\"http://www.thirdlove.com/mugglecast\">Thirdlove.com/mugglecast</a> for 20% off today!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 06 Apr 2021 11:00:00 +0000",
  "guid": "tag:audioboom.com,2021-04-05:/posts/7837563",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}