{
  "id": "https://bibleinoneyear.org/en/youth/120",
  "title": "Day 120: It’s Already Yours",
  "description": "Proverbs 10:31, 11:6, Joshua 18:3, John 1:29–34.  The New Testament presents the ‘land’ as a picture of the Christian life (Hebrews 4)  Realise what is already yours in Christ Jesus and then take possession of it",
  "pubDate": "Fri, 30 Apr 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/120/?ignore",
  "itunes:duration": "13:45",
  "guid": "enyouth30042021-120",
  "length": 825.03,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 120: It’s Already Yours",
  "itunes:subtitle": "Proverbs 10:31, 11:6, Joshua 18:3, John 1:29–34.  The New Testament presents the ‘land’ as a picture of the Christian life (Hebrews 4)  Realise what is already yours in Christ Jesus and then take possession of it",
  "itunes:summary": "My maternal grandparents lived in the small fishing village of Pittenweem near Edinburgh in Scotland. They owned a house there. In 1939, at the start of World War II, they let their home to tenants. When the war ended, they wanted to return to their home but they were unable to. The law at the time allowed the tenants to remain in the house for as long as they lived, at approximately the same rent (with no adjustment for inflation!).\nFor fifty years my grandparents were unable to get possession of the house they owned. My uncle inherited the house from my grandparents. By the time he got possession, the condition of the house had deteriorated greatly. He sold it for a very small sum.\nAlthough my family owned this house in Pittenweem, they never took possession of it. There is a big difference between ownership and possession.\nThe people of Israel had been given ownership of Canaan, the promised land. Now Joshua says to the Israelites, ‘How long will you wait before you begin to take possession of the land…?’ (Joshua 18:3). The New Testament presents the ‘land’ as a picture of the Christian life (Hebrews 4). Realise what is already yours in Christ Jesus and then take possession of it.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 120
}