{
  "title": "#443: Never A Bride (OOTP Chapter 9, Woes of Mrs. Weasley)",
  "link": "https://audioboom.com/posts/7427575",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4545,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Andrew checks in from the Wizarding World... completely decked out for the holidays!</li>\n<li>Laura reveals an early Christmas present that would excite any Potter fan!</li>\n<li>Chapter-by-Chapter continues with Order of the Phoenix - Chapter 9: The Woes of Mrs. Weasley</li>\n<li>7-Word Summary: Harry feels envious because friends are winning</li>\n<li>What's up with Umbridge \"appraising\" Harry?</li>\n<li>Uh oh, Lucius has Fudge's ear! Is it worse that the Order thinks the Minister is NOT under the Imperius Curse?</li>\n<li>Why does Harry's scar burn when thinking about Dumbledore? Is it the Voldemort connection, the Horcrux or just pure emotion?</li>\n<li>Do we agree with Hermione that Sirius is acting selfishly after learning Harry has been found not guilty?</li>\n<li>We do a deep dive on the Defense Against The Dark Arts position</li>\n<li>Ron is named Prefect... and EVERYONE is stunned! Can't the kid just have his moment?</li>\n<li>Why DID Dumbledore select Ron and Hermione as Prefects?</li>\n<li>Moody tries to cheer up Harry by showing him an original Order of the Phoenix photo</li>\n<li>We discuss Gideon and Fabian Prewett (Were Fred and George's names tributes to them?), Aberforth, Edgar Bones and more</li>\n<li>The Boggart shows the very real fear Mrs. Weasley has of losing her family</li>\n<li>Why did Molly choose to take care of the boggart herself?</li>\n<li>Perspective, Harry!</li>\n<li>The Umbridge (Toad) Suck Count rises!</li>\n<li>Connecting The Threads, MVP of the Week and Rename The Chapter return!</li>\n<li>Quizzitch: What is Luna's mother's first name?</li>\n<li>This week's episode of MuggleCast is sponsored by TodayTix! For your chance to see Harry Potter and the Cursed Child in San Francisco, visit <a href=\"http://www.TodayTix.com/MuggleCast\">TodayTix.com/MuggleCast</a>\n</li>\n<li>Join our community at <a href=\"http://www.Patreon.com/MuggleCast\">Patreon.com/MuggleCast</a> and receive magical benefits, including early access to the show via our live streams!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Mon, 18 Nov 2019 18:07:19 +0000",
  "guid": "tag:audioboom.com,2019-11-18:/posts/7427575",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}