{
  "title": "Flare Network gives blockchain a boost with groundbreaking protocol running on Google Cloud",
  "link": "https://cloud.google.com/blog/topics/startups/flare-network-launches-blockchain-protocol-on-google-cloud/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p><a href=\"https://flare.xyz/\" target=\"_blank\">Flare</a> started as a research organization looking into the future of blockchain technology. This resulted in the development of our own platform and the launch of Flare Network, a blockchain which presents developers with a simple and coherent stack for decentralized interoperability. Decentralized applications on Flare can safely access information from outside the Flare network including prices and blockchain state, helping to establish a highly secure, interoperable multi-and cross-chain solution. </p><p>One benefit is that by building on top of Flare, it becomes possible to devise bridges that transport value from one blockchain to another, with decentralized insurance that gives peace of mind to users. By alleviating the risk to the user, Flare believes that the blockchain as an industry can scale to hundreds of millions of users and fulfill its potential to benefit multiple sectors from finance to healthcare. That’s why our motto is ‘connect everything’. </p><p>Even though Flare is a new startup, we have to maintain enterprise levels of security and availability for our customers. With that, we turned to <a href=\"https://cloud.google.com/gcp?utm_source=google&amp;utm_medium=cpc&amp;utm_campaign=na-US-all-en-dr-bkws-all-all-trial-e-dr-1011347&amp;utm_content=text-ad-none-any-DEV_c-CRE_491349594127-ADGP_Desk%20%7C%20BKWS%20-%20EXA%20%7C%20Txt%20~%20Google%20Cloud%20Platform%20Core-KWID_43700060017921803-kwd-6458750523&amp;utm_term=KW_google%20cloud-ST_google%20cloud&amp;gclid=CjwKCAjw1ICZBhAzEiwAFfvFhO_3Tjgk4BR4sR-8ANK0yV7YhJo0EvGHc87rMfqyQjO3l750EHBRKhoCIscQAvD_BwE&amp;gclsrc=aw.ds\">Google Cloud</a> to help ensure that our environment was robust and highly secure from the start, as there is no better solution for tech companies when it comes to security than Google. </p><h3>Bringing blockchain to the mainstream</h3><p>Google Cloud solutions provide us with a reliable infrastructure upon which we can build and monitor our services. Today, our automation is so advanced that we can have a new test network up and running within minutes. Once in place, we can quickly integrate it with any of our connected chain networks, enabling digital assets and on-chain information to flow freely. Google Cloud also gives us certainty that our system environments are resilient and available across 22 regions worldwide. We are confident that if anything happens in one of these areas, we can be back up and running within minutes.</p><p><a href=\"https://cloud.google.com/kubernetes-engine\">Google Kubernetes Engine</a> (GKE) provides a managed environment for deploying, managing, and scaling our containerized applications. We also take advantage of <a href=\"https://cloud.google.com/compute?utm_source=google&amp;utm_medium=cpc&amp;utm_campaign=na-US-all-en-dr-bkws-all-all-trial-e-dr-1011347&amp;utm_content=text-ad-none-any-DEV_c-CRE_509008855892-ADGP_Desk%20%7C%20BKWS%20-%20EXA%20%7C%20Txt%20~%20Compute%20~%20Compute%20Engine_Computing-KWID_43700060017822089-kwd-955537173&amp;utm_term=KW_google%20compute-ST_google%20compute&amp;gclid=CjwKCAjw1ICZBhAzEiwAFfvFhLZm5eypxMU7Vs5m5x8hdbvOl4kMqhWuUrdKC5Sj5idWCnKWt4cGshoCvhYQAvD_BwE&amp;gclsrc=aw.ds\">Compute Engine</a> to launch virtual machines on demand in less time, which reduces the burden of routine tasks on our engineering team. </p><p>We recently began using <a href=\"https://cloud.google.com/apigee\">Apigee</a> to streamline our GTM and security operations for a future API-based web3 cross-chain infrastructure offering (infura but multi-chain) to support our chargeable API platform which is launching in beta soon: <a href=\"https://api-portal.flare.network/\" target=\"_blank\">https://api-portal.flare.network/</a> </p><p>I saw this first-hand when I joined Flare. One of my first tasks was to get a Flare testnet up and running within one month. Google Cloud took away a lot of the heavy lifting and upfront configuration, so I could focus on fine-tuning the test network.  </p><h3>Government and financial-grade security</h3><p>Google Cloud has several government and financial-grade certificates that help ensure our environment is secure, safe, and monitored. For example, Google has received the UK’s National Cyber Security Centre’s (NCSC) Cyber Essentials Plus certification for both Google Cloud and Google Workspace.</p><p>It’s also important to mention the support we’ve received from Google Cloud startup experts. They helped us with several reviews and gave us advice on how we could improve our overall system performance. Google Cloud credits has also enabled us to optimize our spend, which is critical as we navigate the startup process and test out different products and projects while we grow. </p><p>Google Cloud support strengthens our credibility with external communities and partners. The resilience and security of the environment gives the developer community confidence that Flare is a reliable base on which to build applications using both price and state from other networks.</p><p>For end-users, Google Cloud will help to enable our mission to offer bridging for tokens that lack smart contract capabilities such as Bitcoin, LiteCoin, Dogecoin, Stellar, and XRP.  We will also be offering bridging for smart contract tokens, including Ethereum, USD Coin, and Tether.<br/></p><p>As a next step, we’re looking to deploy the latest public APIs for all of Flare’s chains and connected chains to the <a href=\"https://cloud.google.com/marketplace?utm_source=google&amp;utm_medium=cpc&amp;utm_campaign=na-US-all-en-dr-bkws-all-all-trial-e-dr-1011347&amp;utm_content=text-ad-none-any-DEV_c-CRE_491414382665-ADGP_Desk%20%7C%20BKWS%20-%20EXA%20%7C%20Txt%20~%20GCP%20~%20Marketplace_Technical_Marketplace-KWID_43700060017821876-kwd-123598470263&amp;utm_term=KW_google%20cloud%20marketplace-ST_google%20cloud%20marketplace&amp;gclid=CjwKCAjw1ICZBhAzEiwAFfvFhD42xzvMyWUk9EGgEsyGUfhHSNUFO5kAQORFD6l46GI_IwVZVAt9KhoCu88QAvD_BwE&amp;gclsrc=aw.ds\">Google Cloud Marketplace</a> to lower the barrier to entry for our networks, technologies, and services. </p><h3>Moving into the Metaverse</h3><p>Although these are early days for our business, we see this as a long-term partnership with Google Cloud. We like the way that their platform is evolving, and we can already anticipate how this will support our mission to bring blockchain into the mainstream.</p><p>For instance, we recently announced a partnership with a metaverse platform that enables users and their assets to move seamlessly between different metaverse ecosystems. It’s a groundbreaking project and we look forward to continuing to work with Google Cloud to bring this and other exciting initiatives to market in the future.</p></div></div><div class=\"block-image_full_width\"><div class=\"article-module h-c-page\"><div class=\"h-c-grid\"><figure class=\"article-image--large h-c-grid__col h-c-grid__col--6 h-c-grid__col--offset-3 \"><img alt=\"flare collect everything.jpg\" src=\"https://storage.googleapis.com/gweb-cloudblog-publish/images/flare_collect_everything.0999026619990483.max-1000x1000.jpg\"/></figure></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p><i>If you want to learn more about how Google Cloud can help your startup, visit our page<a href=\"https://inthecloud.withgoogle.com/startup/dl-cd.html?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=FY21-Q1-global-demandgen-website-cs-startup_program_mc&amp;utm_content=google-cloud-blog-post&amp;utm_term=-\" target=\"_blank\">here</a> to get more information about our program, and<a href=\"https://docs.google.com/forms/d/e/1FAIpQLSfowlgaSsVDQojZ1JDDhRMfZ5TAFY6do4UPZXqkuToX63K2dQ/viewform\" target=\"_blank\">sign up for our communications</a> to get a look at our community activities, digital events, special offers, and more.</i></p></div></div></body></html>",
  "pubDate": "Wed, 02 Nov 2022 16:00:00 -0000",
  "guid": "https://cloud.google.com/blog/topics/startups/flare-network-launches-blockchain-protocol-on-google-cloud/",
  "category": [
    "Customers",
    "Google Cloud in Europe",
    "Web3",
    "Startups"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Flare Network gives blockchain a boost with groundbreaking protocol running on Google Cloud",
    "description": "Flare Network launches interoperable blockchain based on power, security, and scalability of Google Cloud.",
    "image": "https://storage.googleapis.com/gweb-cloudblog-publish/images/flare.max-600x600.jpg",
    "site_name": "Google",
    "url": "https://cloud.google.com/blog/topics/startups/flare-network-launches-blockchain-protocol-on-google-cloud/"
  },
  "author": [
    {
      "name": "Hugo Philion",
      "title": "CEO and Co-founder, Flare Network",
      "department": "",
      "company": ""
    },
    {
      "name": "Joshua Edwards",
      "title": "Vice President of Engineering, Flare Network",
      "department": "",
      "company": ""
    }
  ]
}