{
  "guid": "prx_137_35e91635-a2fe-4814-b96c-e9ac33c2cc77",
  "title": "757 - Magic Masquerade Mystery  | Big Farm in the Sky P.I.",
  "pubDate": "Sun, 24 Mar 2019 23:00:00 -0000",
  "link": "https://beta.prx.org/stories/270610",
  "description": "<p>A sleepy case of an amateur busker outside of a Design Your Own Crocs themed restaurant.<br>\n<br>\n(You can find all of our sponsors or become a patron on our new website <a href=\"http://www.sleepwithmepodcast.com/\" rel=\"nofollow\" target=\"_blank\">http://www.sleepwithmepodcast.com</a> story starts at about 18:00)<br>\n<br>\nCheck out “Start With This” in your podcast app or at <a href=\"http://www.nightvalepresents.com/startwiththis\" rel=\"nofollow\" target=\"_blank\">http://www.nightvalepresents.com/startwiththis. Start With This is a podcast gone creativity playground designed to put your ideas in motion, from the creators of Welcome to Night Vale, Joseph Fink and Jeffrey Cranor.</a><a href=\"http://www.dylanmarron.com/podcast/\" rel=\"nofollow\" target=\"_blank\"> <br>\n</a><br>\nTonight’s show is sponsored by Quip! The sensitive sonic toothbrush I have been using for over two years (not over and over! Changing out the brush heads every three months!) Quip starts at just $25 and if you go to <a href=\"http://www.getquip.com/sleep\" rel=\"nofollow\" target=\"_blank\">http://www.getquip.com/sleep</a>, you get your first refill pack for FREE with a quip electric toothbrush.<br>\n<br>\nTonight’s episode is sponsored by Brooklinen, luxury bedding, at amazing prices. You have to try these sheets today! There is an exclusive offer just for Sleep With Me listeners.<br>\nGet $20 off AND free shipping when you use promo code [WITHME] at <a href=\"http://www.brooklinen.com\" rel=\"nofollow\" target=\"_blank\">http://www.brooklinen.com</a>.<br>\nBrooklinen is SO confident that they offer **a risk-free 60-night satisfaction guarantee and a lifetime warranty on all of their sheets and comforters! **<br>\n<br>\nTonight’s show is sponsored by Molekule, for $75 off your first order, visit** <a href=\"http://molekule.com/\" rel=\"nofollow\" target=\"_blank\">Molekule.com</a> and enter “sleepwithme”** at checkout. Molekule is a complete reinvention of the air purifier, not just an improvement on existing, outdated technology. It was developed by a scientist whose son suffered from asthma and who was frustrated by the fact HEPA air purifiers did not relieve his son’s symptoms. As a result, Dr.Yogi Goswami spent 20 years developing a completely new, totally effective way of removing indoor air pollutants. Unlike HEPA filters, Molekule destroys indoor air pollutants at a molecular level, completely removing them from the air you breathe.</p>",
  "enclosure": "",
  "itunes:title": "Magic Masquerade Mystery  | Big Farm in the Sky P.I.",
  "itunes:subtitle": "A sleepy case of an amateur busker outside of a Design Your Own Crocs themed restaurant.",
  "itunes:episodeType": "full",
  "itunes:episode": 757,
  "itunes:duration": "01:09:17"
}