{
  "id": "tag:blogger.com,1999:blog-6959495683334200101.post-7677479451723192930",
  "published": "2019-02-19T05:00:00.000-08:00",
  "updated": "2019-02-19T05:00:06.451-08:00",
  "title": "Making our strikes system clear and consistent",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\"><div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\"><div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\">We’re updating the way we give <a href=\"https://www.youtube.com/yt/about/policies/#community-guidelines\" target=\"_blank\">Community Guidelines</a> strikes to a new, simpler system. We’ve worked with creators to understand what’s working and what’s not, and you told us that consistent enforcement, clear policies, and transparency about the impact of a strike are most important. So we’re introducing more opportunities for everyone to understand our policies, a consistent penalty for each strike, and better notifications. <br /><br /><br /><br /><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/zgoF7HpB55g\" width=\"560\"></iframe><br /><br /><br /><br /><h3 style=\"text-align: left;\">More opportunities to learn YouTube’s policies</h3><br /><br /><br />Although 98% of you never break our Community Guidelines, they are vital to making YouTube a strong community and balancing freedom of expression with the <a href=\"https://www.youtube.com/yt/about/\" target=\"_blank\">freedom to belong.</a> That’s why<span style=\"background-color: white; color: #545454; font-family: &quot;roboto&quot; , &quot;arial&quot; , sans-serif; font-size: x-small;\">—</span>from our earliest days<span style=\"background-color: white; color: #545454; font-family: &quot;roboto&quot; , &quot;arial&quot; , sans-serif; font-size: x-small;\">—</span>we’ve relied on a three-strikes system and email notices to give everyone a chance to review and understand what went wrong before they face more severe consequences. And it works: 94% of those who do receive a first strike never get a second one.<br /><br /><br /><br />We want to give you even more opportunities to learn about our policies, so starting February 25, all channels will receive a one-time warning the first time they post content that crosses the line, with no penalties to their channel except for the removal of that content. This is to make sure everyone takes the time to learn about our Community Guidelines, and then can quickly get back to creating great content and engaging with their audience in a way that complies with our rules.  <br /><br /><br /><br />Along with this new warning, we are also expanding the <a href=\"https://www.youtube.com/yt/about/policies/#community-guidelines\" target=\"_blank\">policy resources</a> available in our help center to give more detail about what behavior will result in a strike. This includes new, detailed examples of the kind of content we commonly see that breaks our rules.  <br /><br /><br /></div><h3 style=\"text-align: left;\">Consistent strikes across all of YouTube</h3><br /><br /><br />We’re also making the penalty for violating our Community Guidelines the same wherever it happens. While most strikes result from videos, our Community Guidelines cover all content on YouTube, including stories, custom thumbnails, or links to other websites included in a video’s description or infocard. <br /><br />Previously, not all strikes had the same penalty on your channel. For example, first strikes on videos would trigger a 90-day freeze on live streaming, and second strikes would result in a two-week freeze on new video uploads. We heard from many of you that this was confusing and the penalty didn’t match the source of the strike. Now, based on your feedback, all Community Guidelines strikes will have the same penalty:  <br /><br />As mentioned, everyone who uploads content to YouTube will now receive a warning the first time their content crosses the line. Although the content will be removed, there will be no other penalty on the channel. There will be only one warning and unlike strikes, the warning will not reset after 90 days. <br /><br /><br /><br /><br /><ul style=\"text-align: left;\"><li>The first strike will result in a one-week freeze on the ability to upload any new content to YouTube, including live streaming, and other channel activities. Strikes will expire after 90 days.</li><li>The second strike in any 90-day period will result in a two-week freeze on the ability to upload any new content to YouTube.</li><li>The third strike in any 90-day period will result in channel termination.</li></ul><br /><br /><br /><br /><h3 style=\"text-align: left;\">Transparency about your channel status</h3><br /><br /><br />Finally, we always want to make it clear why a strike occurred, what it means for your channel, and the next steps that are available<span style=\"background-color: white; color: #545454; font-family: &quot;roboto&quot; , &quot;arial&quot; , sans-serif; font-size: x-small;\">—</span>including appealing the decision in case you think it was a mistake. To that end, we’re making our email and desktop notifications clearer, and they will provide more details on which policy was violated. We are also adding new mobile and in-product notifications to make sure you have all the important information about a strike available at a glance. <br /><br /><br /><br />These updates are part of our ongoing work to make sure that YouTube is the best place to listen, share, and create community through your stories. Our strikes system is an important way for us to help creators and artists understand when they’ve crossed the line by uploading content that undermines that goal, and your feedback has helped to make this system work better for the entire community. We’ll build on this and all the progress we’ve made over the last year by continuing to consult with you as we strengthen enforcement and update our policies. We want to make sure they're easy to understand and address the needs of the global YouTube community.<br /><br /></div><br /><br /><br /><i>— The YouTube Team</i></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube Creators",
    "uri": "http://www.blogger.com/profile/00450486760991148551",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}