{
  "title": "Misunderstanding Mises, Again",
  "link": "https://mises.org/node/60691",
  "description": "<p>In a recent blog post on the <em>Marginal</em><em> Revolution</em> <a href=\"HYPERLINK%20%22https:/marginalrevolution.com/%22\">blog</a>, Ludwig von Mises is categorized as an <em>underrated</em><em> thinker</em>. That’s undoubtedly true, especially when considering his many groundbreaking contributions to economics. Mises was also one of the first to be named a <a href=\"https://www.aeaweb.org/about-aea/honors-awards/distinguished-fellows\">distinguished fellow</a> of the American Economic Association in 1969. His contributions to economic theory were many and significant and were largely recognized by his contemporaries. But while they are difficult to deny, Mises still gets very little recognition today.</p>\n<p>Mises is frighteningly often dismissed as a “crank” or “ideologue” by present-day know-it-alls who are clearly ignorant of recent history of economic thought. The blog post at “MR,” which comments very briefly on Mises’s main works, is therefore an important reminder of Mises’s strong legacy. But it is also interesting because it provides insight into how a non-Austrian who is (or at least should be) well aware of Austrian economic theory sees Mises’s work.</p>\n<p>The blog post is written by Tyler Cowen, a professor of economics at George Mason University who has recently gained online notoriety as a columnist, blogger, and podcast host. As a longtime colleague with Austrian economists, both faculty and graduate students, in the GMU economics department, many would assume Cowen to know much about this tradition and, especially, its main works.</p>\n<p>Nevertheless, there is much to agree with Cowen on. He starts by pointing to <em>Socialism</em> and <em>Economic Calculation in the Socialist Commonwealth</em> as great contribution. He then moves on to state that he likes <em>Liberalism</em> and <em>Bureaucracy</em>. <a href=\"https://marginalrevolution.com/marginalrevolution/2022/10/overrated-or-underrated.html\">Cowen thereafter writes</a>:</p>\n<blockquote><p><em>Human</em> <em>Action</em> is big, cranky, and dogmatic, but for some people a useful tonic and alternative to the usual stuff. I can’t say I have ever really liked it, and in an odd way the whole emphasis on “Man acts” undoes at least one part of marginalism.</p></blockquote>\n<p>I admit that I do not quite understand how starting one’s analysis with human action “undoes … part of marginalism.” A more reasonable conclusion, at least from my perspective, is that this part of marginalism, whichever it may be, might be wrong or, at least, ill founded. But it would be easier to tell if Cowen had given us a clue what part he might be talking about.</p>\n<p>The much larger problem is to call Mises’s systematic treatise “cranky” and “dogmatic.” I have the feeling that Cowen is referring to praxeology rather than Mises’s conclusions, even though the conclusions of course are stated without exceptions. That’s expected from theory that is derived logically from a true axiom: either the logic is wrong, or they are true. There is no reason to discussion “exceptions” because there are none.</p>\n<p>But, as is common nowadays, many mistakenly believe that opening for exceptions and not being dogmatic is a sign of wisdom or scholarship. Likewise, they seem to think that taking a middle position is automatically “nuanced.” It can be, of course, but not by virtue of simply being in the middle. There is no middle ground between food and poison, as Ayn Rand would say. There is also, to borrow from Aristotle, no “golden middle” between truth and falsity, between right and wrong, or between ethical and unethical.</p>\n<p>Praxeology is dogmatic in the same sense as truth is either true or it is not. It is not “nuanced” in the sense that empirical analyses are, because they always leave room for interpretation. It doesn’t matter how large a database or how sophisticated statistical methods—you cannot ever be certain that your findings are accurate. When people force praxeology into this frame, it appears dogmatic. But it is so for a reason: it must be.</p>\n<p>Praxeology claims to establish the truth. This means that, from a scholarly perspective, praxeology should be considered the gold standard: it makes very strong claims, which can then be properly assessed and, if wrong, rejected. “Nuance” here means allowing for and including error. After all, praxeology is of the same kind as mathematics. But few would reject mathematics because it “dogmatically” holds that 2 + 2 = 4 instead of being more “nuanced” (allowing for 2 + 2 <> 4 at least sometimes).</p>\n<p>Cowen would know this if he understood praxeology, but there is no reason to assume that he does. His comment on Mises’s dogmatism suggests as much. So it appears reasonable to assume that he has the same type of <a href=\"https://perbylund.com/2011/01/a-spectacle-due-to-spectacles/\">shallow understanding</a> of Austrian conclusions as his fellow non-Austrian GMU economics professor Bryan Caplan. The latter has written several essays on why he is not an Austrian, showing the world that he knows the terminology and conclusions but not the reasoning or rationale.</p>\n<p>It is sad that Mises to this day is misunderstood. While Cowen indeed gives Mises well-deserved credit, doing so while dismissing his<em> magnum opus</em> as “dogmatic” and “cranky” is at best odd and bittersweet praise.</p>\n\n",
  "author": "Per Bylund",
  "enclosure": "",
  "guid": 60691,
  "pubDate": "Wed, 02 Nov 2022 06:00:00 -0500",
  "source": "Mises Wire"
}