{
  "title": "Episode 62: &#8220;Jailhouse Rock&#8221; by Elvis Presley",
  "link": "https://500songs.com/podcast/episode-62-jailhouse-rock-by-elvis-presley/",
  "pubDate": "Sun, 22 Dec 2019 21:35:45 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-62-jailhouse-rock-by-elvis-presley/",
  "description": "Episode sixty-two of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Jailhouse Rock\" by Elvis Presley, and at his relationships with Colonel Tom Parker, Leiber and Stoller, his band members, and the film industry. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/32543567\">Santa Claus is Back in Town</a>, also by Elvis, which ties in more than most to this episode.\n\n\n\nResources\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-62-jailhouse-rock/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\n<a href=\"https://amzn.to/2SY9jkw\">Hound Dog: The Leiber and Stoller Autobiography</a> by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\nThere are many, many books about Elvis Presley out there, but the one I'm using as my major resource for information on him, and which has guided my views as to the kind of person he was, is <a href=\"https://amzn.to/2EjL4b9\"><em>Last Train to Memphis</em> by Peter Guralnick</a>, generally considered the best biography of him.\n\n<a href=\"https://amzn.to/2Vw2yGU\"><em>The Colonel</em> </a>by Alanna Nash is a little more tabloidy than those two, but is the only full-length biography I know of of Colonel Tom Parker.\n\n<a href=\"https://amzn.to/2Mm3E6h\"> This box set</a> contains all the recordings, including outtakes, for Elvis' 1950s films, while <a href=\"https://amzn.to/2SirZxR\">this one</a> contains just the finished versions of every record he made in the fifties.\n\nAnd <a href=\"https://amzn.to/2Q9GG3n\">Jailhouse Rock</a> itself is well worth watching.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nColonel Tom Parker, from the very first, had wanted Elvis to move into films. Indeed, even before he met Elvis, he had tried grooming the other stars he'd managed -- and non-stars like Tommy Sands -- for film roles. In particular, he wanted to work with Hal Wallis at MGM, who had become something of an idee fixe for him after the first time he saw a film being made and was told that Wallis was the man in charge of it all.\n\nIn particular, Parker was interested in film as a mass medium that nonetheless required people to pay. While Elvis had become famous by taking advantage of television's newfound ubiquity, Colonel Parker didn't like the idea that people could just watch Elvis for free. If they could watch him for nothing in their own home, why would they pay to see his shows, or pay for his records?\n\nBut the cinema was different. People paid to go to the cinema, and you could get millions of people paying money to see the same performance. For the Colonel, that was the key -- a way to maximise paying customers. Even if you made more money from the TV than from the cinema in the short term, cultivating a paying audience was clearly the best thing to do in the medium term.\n\nAnd so, from late 1956, Elvis' career had started to be focused on films, which were themselves focussed on his music. His first film, a Western originally titled The Reno Brothers, had been intended to have him in a small part, trying to be a straight actor, without any singing at all, and that was how Elvis had been persuaded to do it.\n\nInstead, at the last minute, four songs had been added to the film, and it had been retitled from The Reno Brothers to Love Me Tender. Elvis' part -- which was originally a relatively minor part -- had been beefed up, though in terms of actual plot involvement he was still not the main star, and the film became an uneasy compromise between being a serious Western drama and a rock and roll vehicle, not really managing to do either well.\n\nThe film after that, \"Loving You\", had been different:\n\n[Excerpt: Elvis Presley, \"Loving You\"]\n\nThat one had been a more straight ahead rock and roll film -- it was basically a fictionalised version of Elvis' own life to that point, with him playing Deke Rivers, a singer who is discovered by the manager of a fading country star. The manager in this case is a woman, and she also becomes the love interest in the film, but the broad outlines are about what you'd expect from a fictionalised biopic -- Elvis was  clearly playing himself.\n\nBut the soundtrack to \"Loving You\" had been a huge improvement on the soundtrack to \"Love Me Tender\", and had included some of Elvis' very best songs, including a title song written for him by Leiber and Stoller.\n\nThe pair had been called on almost straight away after their \"Hound Dog\" had become a hit for Elvis, to see if they had any more songs for him. At the time, they hadn't been hugely impressed by Elvis' version of \"Hound Dog\", and so rather than give him anything new, they suggested he record a song they had written for the duo Willy and Ruth:\n\n[Excerpt: Willy and Ruth, \"Love Me\"]\n\nThat song had been written as a parody of country songs, and they hadn't taken it seriously at all, but there had been all sorts of cover versions of it, by everyone from Georgia Gibbs to Hank Snow's son Jimmie Rodgers Snow. None of them had been hits, but the song obviously had some commercial potential.\n\nSo Leiber and Stoller suggested that Elvis try it, and they were very impressed with his performance of the song, which unlike them he *did* take seriously:\n\n[Excerpt: Elvis Presley, \"Love Me\"]\n\nFrom that point on, they had a certain amount of respect for Elvis as a performer, and so they were happy to write \"Loving You\" for the film. But at this point they still hadn't even met him, and regarded him as, in their words, \"an idiot savant\" -- someone who just happened to have a marketable talent, rather than an actual artist like the people they worked with.\n\nBut Elvis was so impressed with the songs that Leiber and Stoller were writing that they soon got the call to write more songs for his next film. The original plan was that they were to write all of the songs for the film, but there was a snag. They'd been flown back to New York from LA, and they had a suite at an expensive hotel, and Miles Davis and Count Basie and Thelonius Monk all had gigs in the city that week, and there were a few good plays on at the theatre, and they had some friends who wanted to take them out for meals, and... well, there's a lot of stuff to do in New York that's more interesting than work.\n\nEventually, Jean Aberbach from Hill and Range publishing came round to see them in their hotel suite, and ask them where his songs were. They told him he would have them soon, and he replied that he knew he would, because he wasn't going to let them leave until he did. He pushed the sofa in front of the door so they couldn't get out, and went to sleep on it.\n\nIn the next five hours, Leiber and Stoller wrote four songs together, which was just about enough for the film, which was padded out with two other songs by other writers -- both of them co-written by Aaron Schroeder. There was \"Don't Leave Me Now\", which had been recorded but not used for \"Loving You\",  but which had still already appeared on that film's soundtrack album, and a new ballad called \"Young and Beautiful\".\n\nBut neither of those songs were particularly strong, and so it was the Leiber and Stoller songs that would be the musical spine of the film -- the credits at the beginning of the film said \"songs mostly by Mike Stoller and Jerry Leiber\", clearly showing that they knew which songs it was that people would actually care about.\n\nIt was only in April 1957 that Leiber and Stoller actually met the man who had already had hits with two of their songs and used a third as the title song for one of his films. Coincidentally, they met him in Radio Recorders Annex, the same studio where five years earlier they had recorded the original version of \"Hound Dog\" with Big Mama Thornton.\n\nThey went in not knowing what to expect, but were struck, in order, by three different things. The first was that Elvis was extremely physically beautiful, far more so in person than in photos. The second was how shy and quiet he was -- but how these things actually gave him an extra presence.\n\nAnd the third was how much he knew about R&B music, and how much he loved it. Leiber and Stoller had believed themselves to be the only white people of their own generation to really know or care about R&B or the blues, and here was someone enthusing to them about B.B. King, Big Bill Broonzy, and Arthur Crudup, and also about their own songs. He particularly liked one they'd written for Ray Charles, \"The Snow is Falling\":\n\n[Excerpt: Ray Charles, \"The Snow is Falling\"]\n\nHe ended up sitting at the piano playing a four-handed blues with Mike Stoller. The three men were getting on well enough that even though Leiber and Stoller had only intended to visit the sessions for a short while to meet Elvis, they ended up essentially producing the session -- Leiber was in the control room, and would show Elvis how he wanted the songs to be phrased, while Stoller was on the studio floor, working with the musicians, and playing piano on one track.\n\nThe two were particularly impressed by Elvis' determination in the studio. They were having to record multiple versions of almost every song, because the plot of the film would have Elvis' character, Vince Everett, learning songs, trying them out in different arrangements, trying different vocal styles on them, and so on. As well as recording the songs properly, the way he'd like to sing them, Elvis had to do tentative versions, versions with wrong notes, and so forth.\n\nAnd Elvis happily worked, take after take, to get all these different versions of the songs done exactly right.  In fact, he ended up not just singing on the tracks, but playing bass on one of them.\n\nUp until these sessions, Bill Black had been playing double bass on all Elvis' sessions -- the double bass was the standard bass instrument in country music, and had become so in rockabilly as well. But around this time it became clear that the new Fender bass guitars, which had been introduced to the market a couple of years earlier and had quickly taken off in the jazz and blues worlds, were going to become the standard instrument for studio work for everyone.\n\nBlack was far from being the most accomplished musician in the world -- what he brought to Elvis' sessions was more about his enthusiasm and attitude than his ability to play -- and the switch to the bass guitar was an uncomfortable one. If you don't know, a double bass is played standing up, like a cello, and has no frets, while a bass guitar is played like a guitar. They're very different instruments, and Black had trouble switching from one to the other.\n\nHe was also getting annoyed with the whole Presley organisation. Tom Parker was determined to isolate Elvis from anyone else in the business, including his band members. And not only that, Bill and Scotty were on what they both considered was a miserably low salary.\n\nSo when Bill messed up the intro to \"(You're So Square) Baby, I Don't Care\" repeatedly, he threw the bass across the room and stormed out of the session.\n\nElvis just picked up the bass and played the part himself, and it's him you can hear playing it on the finished record, doing a rather decent job of it:\n\n[Excerpt: Elvis Presley, \"(You're So Square) Baby I Don't Care\"]\n\nWhile Bill had left the session, it didn't stop him appearing in the film -- \"Jailhouse Rock\" featured Scotty, Bill, and D.J., miming their instruments. They didn't have any lines -- they weren't members of the Screen Actors' Guild, so they couldn't -- but they appeared throughout the last half of the film, as did Mike Stoller on the piano.\n\nIt was actually meant to be Jerry Leiber miming the piano parts -- someone from the film studio had come into the recording studio while they were making the records, and had said that Leiber looked like a piano player. Elvis had said that no, it was Stoller who was the piano player, and the filmmaker had said it didn't matter -- Leiber looked like a piano player, and so if he wanted to be in the film miming the piano parts he could.\n\nLeiber agreed, but then on the day he was meant to go into the studio, he developed a terrible toothache. He called up Stoller and said \"I can't go, you go instead\".\n\nStoller pointed out that they were expecting Leiber, and Leiber told him that they wouldn't know the difference anyway. So Stoller went along, and the only thing he was told was that he would have to shave off his goatee beard, as it would be a scene-stealer and distract people from Elvis.\n\nSo Mike Stoller was there with Scotty, Bill, and D.J. as they filmed most of what is generally considered to be Elvis' best film.\n\nThe film almost got stopped before it was started, though. The first thing to be filmed was the big dance sequence to one of the songs Leiber and Stoller had written, \"Jailhouse Rock\":\n\n[excerpt: Elvis Presley, \"Jailhouse Rock\"]\n\nThat was going to be the centrepiece of the whole film, and the dance sequence involved dozens of men dressed as convicts. Some have argued that the song and the sequence were inspired by the bit in The Girl Can't Help It in which a parody of rock and roll is sung by a group dressed as convicts. There might even be some truth to that as far as the version in the film goes, as the film has extra orchestration and an intro section added which isn't on the record, and which doesn't really fit very well. Compare the film version of \"Jailhouse Rock\":\n\n[Excerpt: Elvis Presley, \"Jailhouse Rock\", film version]\n\nWith \"Rock Around the Rockpile\":\n\n[Excerpt: \"Jerri Jordan\", \"Rock Around the Rockpile\"]\n\nBut the thing is, that's only a partial explanation. The song itself is clearly in a long line of Leiber and Stoller songs about the judicial system, like \"Framed\":\n\n[Excerpt: The Robins, \"Framed\"]\n\nand \"Riot in Cell Block #9\":\n\n[Excerpt: The Robins, \"Riot in Cell Block #9\"]\n\nIt also contains a lot of the humour that Leiber and Stoller were noted for. Many comedians have made fun of this section:\n\n[Excerpt: Elvis Presley, \"Jailhouse Rock\"]\n\nand pointed out the homoerotic implications of those lines. Given Leiber and Stoller's other work, I think it's fairly clear they were perfectly aware of those implications -- and given that this is a film that also features shots of Elvis shirtless, tied up, being whipped by another man, I suspect they weren't the only ones who were dropping little coded hints to gay fans at that time.\n\nBut, as I said, the dance sequence nearly ended the film -- and nearly ended Elvis' singing career along with it. Elvis had some trouble learning to dance with a choreographed troupe, at first -- he was a natural mover, and not used to the way trained dancers moved. Luckily, the choreographer, Alex Romero, came up with a solution to that problem. He got Elvis to just perform in front of him, miming to his own records, moving like he would on stage.\n\nRomero then took Elvis' normal stage movements and worked them into the dance routine, choreographing it so it still worked with the large dance troupe, but Elvis was able to move in ways that were comfortable for him.\n\n(The claim on Wikipedia that Elvis himself choreographed the dance sequence is absolutely mythical, incidentally. It was Alex Romero.)\n\nThat solved the immediate problem, but there was a larger problem when, on the first day of shooting, Elvis hit his mouth and dislodged a crown. Elvis insisted that it had gone into his chest. At first, people thought he was being overly dramatic, but after a few more takes of bits of the sequence, they noticed a whistling sound when he was breathing. He had inhaled his crown.\n\nIt required major surgery to remove the crown from his lung, and to do it they had to separate his vocal cords to get into his lungs. This was a weird case of life imitating art, as a crucial plot point in the film was Elvis' character having to have throat surgery and worrying whether he would be able to sing again. Fortunately, just as in the film, he made a full recovery and was able to carry on.\n\nThe film itself was surprisingly good, given the depths to which Elvis would sink in some of his later films. Elvis plays a very unsympathetic character, with a chip on his shoulder after being imprisoned after accidentally killing a man in a bar fight, who (of course) becomes a famous singer. It's no cinematic masterpiece, but it's a very decent film of its type.\n\nThe film sadly had a tragic coda -- just days after the film finished shooting, Judy Tyler, Elvis' love interest in the film, died in a car accident. As a result, Elvis refused to ever watch the film in full -- he couldn't bear to.\n\nBut in the short term, the film's main effect was to draw Elvis and Mike Stoller closer together. As Stoller was on the set all the time, he had a chance to get close to Elvis, and at one point they were having a game of pool, and one of the songs Leiber and Stoller had written for the Drifters came on:\n\n[Excerpt: The Drifters, \"Ruby Baby\"]\n\nElvis started singing along, and asking Stoller how he and Leiber wrote so many great songs together. But then, a few minutes later, Elvis was dragged out of the room, and came back in telling Stoller that he had to leave -- the Colonel didn't want Elvis hanging round with people who were in the music industry, unless those people worked for the Colonel.\n\nIndeed, at one point around this time, the Colonel tried to become Leiber and Stoller's manager. He sent them blank pieces of paper for them to sign, with a promise that he would fill out the rest later and give them a very good deal. Perhaps unsurprisingly, their response was not one I could repeat on a podcast that isn't in the adult section.\n\nBut Elvis had still taken to Leiber and Stoller. He started calling them his \"good luck charms\", and decided that he wanted them at every recording session. The Colonel agreed to have them involved in everything. For the moment.\n\nBut Leiber and Stoller weren't dependent on Elvis and the Colonel. During 1957, while they were working with Elvis, they also wrote hits for Perry Como:\n\n[Excerpt: Perry Como, \"Dancin'\"]\n\nRuth Brown:\n\n[Excerpt: Ruth Brown, \"Lucky Lips\"]\n\nThe Drifters:\n\n[Excerpt: The Drifters, \"Fools Fall in Love\"]\n\nAnd of course those Coasters records we looked at a few weeks ago -- and will be looking at again in a month or so.\n\nAnd that independence was bothering people in the Colonel's group of business people. In particular, Freddy Bienstock, who worked at Hill and Range and controlled what songs Elvis performed, became apoplectic when the duo gave the song \"Don't\" directly to Elvis:\n\n[Excerpt: Elvis Presley, \"Don't\"]\n\nStoller explained to Bienstock that the song had been commissioned directly *by* Elvis. Elvis had said, \"I want you to write a real pretty ballad for me,\" they'd gone away and written him a real pretty ballad, he'd liked it, what was the problem?\n\nThe problem, Bienstock explained, was that you don't just give songs to Elvis. There was no contract for the song. What if they couldn't come to a contract agreement, but Elvis wanted to record the song anyway? What if all the money ended up just going to Leiber and Stoller because they refused to cut Hill and Range, Elvis, and the Colonel in on the royalties?\n\nThat wasn't a problem, they said. They'd written songs for Elvis before. They knew the drill. They assumed that the contract would be the same one they always had to sign when writing for Elvis.\n\nBienstock insisted that none of that mattered. You brought the song to Bienstock, or to Jean Aberbach. If they liked it for Elvis, *then* they got the contracts sorted, and *then* Elvis got to hear it. That was the way things worked around here. You don't just go bringing Elvis a song. That was going behind the Colonel's back, and the Colonel didn't like people going behind his back.\n\nAs far as Leiber and Stoller were concerned, they weren't going behind anyone's back.\n\nSo by September 1957, when Jailhouse Rock came out, things were a lot more precarious for Elvis than they looked from the outside. The Colonel had weakened the bonds between him and his backing musicians, by insisting that they get paid a small salary rather than a percentage; he had control over what songs Elvis could sing; Sam Phillips was no longer in the picture; and so Leiber and Stoller were the only people involved in Elvis' life who had any real independence -- everyone at Hill and Range, the film studios, and RCA was involved in a complex network of kickbacks which meant that they all stood or fell together with the Colonel.\n\nIf the Colonel could just get those good luck charms out of Elvis' life again, he'd be all set to make sure Elvis' career was run exactly as he wanted it.\n\nAnd as luck would have it, Elvis was going to become eligible for the draft in January 1958. All the Colonel had to do was wait a few months...",
  "itunes:subtitle": "Episode sixty-two of A History of Rock Music in Five Hundred Songs looks at Jailhouse Rock by Elvis Presley, and at his relationships with Colonel Tom Parker, Leiber and Stoller, his band members, and the film industry. Click the full post to read liner ",
  "itunes:keywords": "Aaron Schroeder,Bill Black,Colonel Tom Parker,D.J. Fontana,Elvis Presley,Freddy Bienstock,Hill and Range publishing,Jean Aberbach,Leiber and Stoller,RCA Records,Scotty Moore",
  "content:encoded": "Episode sixty-two of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Jailhouse Rock\" by Elvis Presley, and at his relationships with Colonel Tom Parker, Leiber and Stoller, his band members, and the film industry. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/32543567\">Santa Claus is Back in Town</a>, also by Elvis, which ties in more than most to this episode.\n\n\n\nResources\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-62-jailhouse-rock/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\n<a href=\"https://amzn.to/2SY9jkw\">Hound Dog: The Leiber and Stoller Autobiography</a> by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\nThere are many, many books about Elvis Presley out there, but the one I'm using as my major resource for information on him, and which has guided my views as to the kind of person he was, is <a href=\"https://amzn.to/2EjL4b9\"><em>Last Train to Memphis</em> by Peter Guralnick</a>, generally considered the best biography of him.\n\n<a href=\"https://amzn.to/2Vw2yGU\"><em>The Colonel</em> </a>by Alanna Nash is a little more tabloidy than those two, but is the only full-length biography I know of of Colonel Tom Parker.\n\n<a href=\"https://amzn.to/2Mm3E6h\"> This box set</a> contains all the recordings, including outtakes, for Elvis' 1950s films, while <a href=\"https://amzn.to/2SirZxR\">this one</a> contains just the finished versions of every record he made in the fifties.\n\nAnd <a href=\"https://amzn.to/2Q9GG3n\">Jailhouse Rock</a> itself is well worth watching.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nColonel Tom Parker, from the very first, had wanted Elvis to move into films. Indeed, even before he met Elvis, he had tried grooming the other stars he'd managed -- and non-stars like Tommy Sands -- for film roles. In particular, he wanted to work with Hal Wallis at MGM, who had become something of an idee fixe for him after the first time he saw a film being made and was told that Wallis was the man in charge of it all.\n\nIn particular, Parker was interested in film as a mass medium that nonetheless required people to pay. While Elvis had become famous by taking advantage of television's newfound ubiquity, Colonel Parker didn't like the idea that people could just watch Elvis for free. If they could watch him for nothing in their own home, why would they pay to see his shows, or pay for his records?\n\nBut the cinema was different. People paid to go to the cinema, and you could get millions of people paying money to see the same performance. For the Colonel, that was the key -- a way to maximise paying customers. Even if you made more money from the TV than from the cinema in the short term, cultivating a paying audience was clearly the best thing to do in the medium term.\n\nAnd so, from late 1956, Elvis' career had started to be focused on films, which were themselves focussed on his music. His first film, a Western originally titled The Reno Brothers, had been intended to have him in a small part, trying to be a straight actor, without any singing at all, and that was how Elvis had been persuaded to do it.\n\nInstead, at the last minute, four songs had been added to the film, and it had been retitled from The Reno Brothers to Love Me Tender. Elvis' part -- which was originally a relatively minor part -- had been beefed up, though in terms of actual plot involvement he was still not the main star, and the film became an uneasy compromise between being a serious Western drama and a rock and roll vehicle, not really managing to do either well.\n\nThe film after that, \"Loving You\", had been different:\n\n[Excerpt: Elvis Presley, \"Loving You\"]\n\nThat one had been a more straight ahead rock and roll film -- it was basically a fictionalised version of Elvis' own life to that point, with him playing Deke Rivers, a singer who is discovered by the manager of a fading country star. The manager in this case is a woman, and she also becomes the love interest in the film, but the broad outlines are about what you'd expect from a fictionalised biopic -- Elvis was  clearly playing himself.\n\nBut the soundtrack to \"Loving You\" had been a huge improvement on the soundtrack to \"Love Me Tender\", and had included some of Elvis' very best songs, including a title song written for him by Leiber and Stoller.\n\nThe pair had been called on almost straight away after their \"Hound Dog\" had become a hit for Elvis, to see if they had any more songs for him. At the time, they hadn't been hugely impressed by Elvis' version of \"Hound Dog\", and so rather than give him anything new, they suggested he record a song they had written for the duo Willy and Ruth:\n\n[Excerpt: Willy and Ruth, \"Love Me\"]\n\nThat song had been written as a parody of country songs, and they hadn't taken it seriously at all, but there had been all sorts of cover versions of it, by everyone from Georgia Gibbs to Hank Snow's son Jimmie Rodgers Snow. None of them had been hits, but the song obviously had some commercial potential.\n\nSo Leiber and Stoller suggested that Elvis try it, and they were very impressed with his performance of the song, which unlike them he *did* take seriously:\n\n[Excerpt: Elvis Presley, \"Love Me\"]\n\nFrom that point on, they had a certain amount of respect for Elvis as a performer, and so they were happy to write \"Loving You\" for the film. But at this point they still hadn't even met him, and regarded him as, in their words, \"an idiot savant\" -- someone who just happened to have a marketable talent, rather than an actual artist like the people they worked with.\n\nBut Elvis was so impressed with the songs that Leiber and Stoller were writing that they soon got the call to write more songs for his next film. The original plan was that they were to write all of the songs for the film, but there was a snag. They'd been flown back to New York from LA, and they had a suite at an expensive hotel, and Miles Davis and Count Basie and Thelonius Monk all had gigs in the city that week, and there were a few good plays on at the theatre, and they had some friends who wanted to take them out for meals, and... well, there's a lot of stuff to do in New York that's more interesting than work.\n\nEventually, Jean Aberbach from Hill and Range publishing came round to see them in their hotel suite, and ask them where his songs were. They told him he would have them soon, and he replied that he knew he would, because he wasn't going to let them leave until he did. He pushed the sofa in front of the door so they couldn't get out, and went to sleep on it.\n\nIn the next five hours, Leiber and Stoller wrote four songs together, which was just about enough for the film, which was padded out with two other songs by other writers -- both of them co-written by Aaron Schroeder. There was \"Don't Leave Me Now\", which had been recorded but not used for \"Loving You\",  but which had still already appeared on that film's soundtrack album, and a new ballad called \"Young and Beautiful\".\n\nBut neither of those songs were particularly strong, and so it was the Leiber and Stoller songs that would be the musical spine of the film -- the credits at the beginning of the film said \"songs mostly by Mike Stoller and Jerry Leiber\", clearly showing that they knew which songs it was that people would actually care about.\n\nIt was only in April 1957 that Leiber and Stoller actually met the man who had already had hits with two of their songs and used a third as the title song for one of his films. Coincidentally, they met him in Radio Recorders Annex, the same studio where five years earlier they had recorded the original version of \"Hound Dog\" with Big Mama Thornton.\n\nThey went in not knowing what to expect, but were struck, in order, by three different things. The first was that Elvis was extremely physically beautiful, far more so in person than in photos. The second was how shy and quiet he was -- but how these things actually gave him an extra presence.\n\nAnd the third was how much he knew about R&B music, and how much he loved it. Leiber and Stoller had believed themselves to be the only white people of their own generation to really know or care about R&B or the blues, and here was someone enthusing to them about B.B. King, Big Bill Broonzy, and Arthur Crudup, and also about their own songs. He particularly liked one they'd written for Ray Charles, \"The Snow is Falling\":\n\n[Excerpt: Ray Charles, \"The Snow is Falling\"]\n\nHe ended up sitting at the piano playing a four-handed blues with Mike Stoller. The three men were getting on well enough that even though Leiber and Stoller had only intended to visit the sessions for a short while to meet Elvis, they ended up essentially producing the session -- Leiber was in the control room, and would show Elvis how he wanted the songs to be phrased, while Stoller was on the studio floor, working with the musicians, and playing piano on one track.\n\nThe two were particularly impressed by Elvis' determination in the studio. They were having to record multiple versions of almost every song, because the plot of the film would have Elvis' character, Vince Everett, learning songs, trying them out in different arrangements, trying different vocal styles on them, and so on. As well as recording the songs properly, the way he'd like to sing them, Elvis had to do tentative versions, versions with wrong notes, and so forth.\n\nAnd Elvis happily worked, take after take, to get all these different versions of the songs done exactly right.  In fact, he ended up not just singing on the tracks, but playing bass on one of them.\n\nUp until these sessions, Bill Black had been playing double bass on all Elvis' sessions -- the double bass was the standard bass instrument in country music, and had become so in rockabilly as well. But around this time it became clear that the new Fender bass guitars, which had been introduced to the market a couple of years earlier and had quickly taken off in the jazz and blues worlds, were going to become the standard instrument for studio work for everyone.\n\nBlack was far from being the most accomplished musician in the world -- what he brought to Elvis' sessions was more about his enthusiasm and attitude than his ability to play -- and the switch to the bass guitar was an uncomfortable one. If you don't know, a double bass is played standing up, like a cello, and has no frets, while a bass guitar is played like a guitar. They're very different instruments, and Black had trouble switching from one to the other.\n\nHe was also getting annoyed with the whole Presley organisation. Tom Parker was determined to isolate Elvis from anyone else in the business, including his band members. And not only that, Bill and Scotty were on what they both considered was a miserably low salary.\n\nSo when Bill messed up the intro to \"(You're So Square) Baby, I Don't Care\" repeatedly, he threw the bass across the room and stormed out of the session.\n\nElvis just picked up the bass and played the part himself, and it's him you can hear playing it on the finished record, doing a rather decent job of it:\n\n[Excerpt: Elvis Presley, \"(You're So Square) Baby I Don't Care\"]\n\nWhile Bill had left the session, it didn't stop him appearing in the film -- \"Jailhouse Rock\" featured Scotty, Bill, and D.J., miming their instruments. They didn't have any lines -- they weren't members of the Screen Actors' Guild, so they couldn't -- but they appeared throughout the last half of the film, as did Mike Stoller on the piano.\n\nIt was actually meant to be Jerry Leiber miming the piano parts -- someone from the film studio had come into the recording studio while they were making the records, and had said that Leiber looked like a piano player. Elvis had said that no, it was Stoller who was the piano player, and the filmmaker had said it didn't matter -- Leiber looked like a piano player, and so if he wanted to be in the film miming the piano parts he could.\n\nLeiber agreed, but then on the day he was meant to go into the studio, he developed a terrible toothache. He called up Stoller and said \"I can't go, you go instead\".\n\nStoller pointed out that they were expecting Leiber, and Leiber told him that they wouldn't know the difference anyway. So Stoller went along, and the only thing he was told was that he would have to shave off his goatee beard, as it would be a scene-stealer and distract people from Elvis.\n\nSo Mike Stoller was there with Scotty, Bill, and D.J. as they filmed most of what is generally considered to be Elvis' best film.\n\nThe film almost got stopped before it was started, though. The first thing to be filmed was the big dance sequence to one of the songs Leiber and Stoller had written, \"Jailhouse Rock\":\n\n[excerpt: Elvis Presley, \"Jailhouse Rock\"]\n\nThat was going to be the centrepiece of the whole film, and the dance sequence involved dozens of men dressed as convicts. Some have argued that the song and the sequence were inspired by the bit in The Girl Can't Help It in which a parody of rock and roll is sung by a group dressed as convicts. There might even be some truth to that as far as the version in the film goes, as the film has extra orchestration and an intro section added which isn't on the record, and which doesn't really fit very well. Compare the film version of \"Jailhouse Rock\":\n\n[Excerpt: Elvis Presley, \"Jailhouse Rock\", film version]\n\nWith \"Rock Around the Rockpile\":\n\n[Excerpt: \"Jerri Jordan\", \"Rock Around the Rockpile\"]\n\nBut the thing is, that's only a partial explanation. The song itself is clearly in a long line of Leiber and Stoller songs about the judicial system, like \"Framed\":\n\n[Excerpt: The Robins, \"Framed\"]\n\nand \"Riot in Cell Block #9\":\n\n[Excerpt: The Robins, \"Riot in Cell Block #9\"]\n\nIt also contains a lot of the humour that Leiber and Stoller were noted for. Many comedians have made fun of this section:\n\n[Excerpt: Elvis Presley, \"Jailhouse Rock\"]\n\nand pointed out the homoerotic implications of those lines. Given Leiber and Stoller's other work, I think it's fairly clear they were perfectly aware of those implications -- and given that this is a film that also features shots of Elvis shirtless, tied up, being whipped by another man, I suspect they weren't the only ones who were dropping little coded hints to gay fans at that time.\n\nBut, as I said, the dance sequence nearly ended the film -- and nearly ended Elvis' singing career along with it. Elvis had some trouble learning to dance with a choreographed troupe, at first -- he was a natural mover, and not used to the way trained dancers moved. Luckily, the choreographer, Alex Romero, came up with a solution to that problem. He got Elvis to just perform in front of him, miming to his own records, moving like he would on stage.\n\nRomero then took Elvis' normal stage movements and worked them into the dance routine, choreographing it so it still worked with the large dance troupe, but Elvis was able to move in ways that were comfortable for him.\n\n(The claim on Wikipedia that Elvis himself choreographed the dance sequence is absolutely mythical, incidentally. It was Alex Romero.)\n\nThat solved the immediate problem, but there was a larger problem when, on the first day of shooting, Elvis hit his mouth and dislodged a crown. Elvis insisted that it had gone into his chest. At first, people thought he was being overly dramatic, but after a few more takes of bits of the sequence, they noticed a whistling sound when he was breathing. He had inhaled his crown.\n\nIt required major surgery to remove the crown from his lung, and to do it they had to separate his vocal cords to get into his lungs. This was a weird case of life imitating art, as a crucial plot point in the film was Elvis' character having to have throat surgery and worrying whether he would be able to sing again. Fortunately, just as in the film, he made a full recovery and was able to carry on.\n\nThe film itself was surprisingly good, given the depths to which Elvis would sink in some of his later films. Elvis plays a very unsympathetic character, with a chip on his shoulder after being imprisoned after accidentally killing a man in a bar fight, who (of course) becomes a famous singer. It's no cinematic masterpiece, but it's a very decent film of its type.\n\nThe film sadly had a tragic coda -- just days after the film finished shooting, Judy Tyler, Elvis' love interest in the film, died in a car accident. As a result, Elvis refused to ever watch the film in full -- he couldn't bear to.\n\nBut in the short term, the film's main effect was to draw Elvis and Mike Stoller closer together. As Stoller was on the set all the time, he had a chance to get close to Elvis, and at one point they were having a game of pool, and one of the songs Leiber and Stoller had written for the Drifters came on:\n\n[Excerpt: The Drifters, \"Ruby Baby\"]\n\nElvis started singing along, and asking Stoller how he and Leiber wrote so many great songs together. But then, a few minutes later, Elvis was dragged out of the room, and came back in telling Stoller that he had to leave -- the Colonel didn't want Elvis hanging round with people who were in the music industry, unless those people worked for the Colonel.\n\nIndeed, at one point around this time, the Colonel tried to become Leiber and Stoller's manager. He sent them blank pieces of paper for them to sign, with a promise that he would fill out the rest later and give them a very good deal. Perhaps unsurprisingly, their response was not one I could repeat on a podcast that isn't in the adult section.\n\nBut Elvis had still taken to Leiber and Stoller. He started calling them his \"good luck charms\", and decided that he wanted them at every recording session. The Colonel agreed to have them involved in everything. For the moment.\n\nBut Leiber and Stoller weren't dependent on Elvis and the Colonel. During 1957, while they were working with Elvis, they also wrote hits for Perry Como:\n\n[Excerpt: Perry Como, \"Dancin'\"]\n\nRuth Brown:\n\n[Excerpt: Ruth Brown, \"Lucky Lips\"]\n\nThe Drifters:\n\n[Excerpt: The Drifters, \"Fools Fall in Love\"]\n\nAnd of course those Coasters records we looked at a few weeks ago -- and will be looking at again in a month or so.\n\nAnd that independence was bothering people in the Colonel's group of business people. In particular, Freddy Bienstock, who worked at Hill and Range and controlled what songs Elvis performed, became apoplectic when the duo gave the song \"Don't\" directly to Elvis:\n\n[Excerpt: Elvis Presley, \"Don't\"]\n\nStoller explained to Bienstock that the song had been commissioned directly *by* Elvis. Elvis had said, \"I want you to write a real pretty ballad for me,\" they'd gone away and written him a real pretty ballad, he'd liked it, what was the problem?\n\nThe problem, Bienstock explained, was that you don't just give songs to Elvis. There was no contract for the song. What if they couldn't come to a contract agreement, but Elvis wanted to record the song anyway? What if all the money ended up just going to Leiber and Stoller because they refused to cut Hill and Range, Elvis, and the Colonel in on the royalties?\n\nThat wasn't a problem, they said. They'd written songs for Elvis before. They knew the drill. They assumed that the contract would be the same one they always had to sign when writing for Elvis.\n\nBienstock insisted that none of that mattered. You brought the song to Bienstock, or to Jean Aberbach. If they liked it for Elvis, *then* they got the contracts sorted, and *then* Elvis got to hear it. That was the way things worked around here. You don't just go bringing Elvis a song. That was going behind the Colonel's back, and the Colonel didn't like people going behind his back.\n\nAs far as Leiber and Stoller were concerned, they weren't going behind anyone's back.\n\nSo by September 1957, when Jailhouse Rock came out, things were a lot more precarious for Elvis than they looked from the outside. The Colonel had weakened the bonds between him and his backing musicians, by insisting that they get paid a small salary rather than a percentage; he had control over what songs Elvis could sing; Sam Phillips was no longer in the picture; and so Leiber and Stoller were the only people involved in Elvis' life who had any real independence -- everyone at Hill and Range, the film studios, and RCA was involved in a complex network of kickbacks which meant that they all stood or fell together with the Colonel.\n\nIf the Colonel could just get those good luck charms out of Elvis' life again, he'd be all set to make sure Elvis' career was run exactly as he wanted it.\n\nAnd as luck would have it, Elvis was going to become eligible for the draft in January 1958. All the Colonel had to do was wait a few months...",
  "enclosure": "",
  "itunes:summary": "Episode sixty-two of A History of Rock Music in Five Hundred Songs looks at \"Jailhouse Rock\" by Elvis Presley, and at his relationships with Colonel Tom Parker, Leiber and Stoller, his band members, and the film industry. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on Santa Claus is Back in Town, also by Elvis, which ties in more than most to this episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nHound Dog: The Leiber and Stoller Autobiography by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\nThere are many, many books about Elvis Presley out there, but the one I'm using as my major resource for information on him, and which has guided my views as to the kind of person he was, is Last Train to Memphis by Peter Guralnick, generally considered the best biography of him.\n\nThe Colonel by Alanna Nash is a little more tabloidy than those two, but is the only full-length biography I know of of Colonel Tom Parker.\n\n This box set contains all the recordings, including outtakes, for Elvis' 1950s films, while this one contains just the finished versions of every record he made in the fifties.\n\nAnd Jailhouse Rock itself is well worth watching.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nColonel Tom Parker, from the very first, had wanted Elvis to move into films. Indeed, even before he met Elvis, he had tried grooming the other stars he'd managed -- and non-stars like Tommy Sands -- for film roles. In particular, he wanted to work with Hal Wallis at MGM, who had become something of an idee fixe for him after the first time he saw a film being made and was told that Wallis was the man in charge of it all.\n\nIn particular, Parker was interested in film as a mass medium that nonetheless required people to pay. While Elvis had become famous by taking advantage of television's newfound ubiquity, Colonel Parker didn't like the idea that people could just watch Elvis for free. If they could watch him for nothing in their own home, why would they pay to see his shows, or pay for his records?\n\nBut the cinema was different. People paid to go to the cinema, and you could get millions of people paying money to see the same performance. For the Colonel, that was the key -- a way to maximise paying customers. Even if you made more money from the TV than from the cinema in the short term, cultivating a paying audience was clearly the best thing to do in the medium term.\n\nAnd so, from late 1956, Elvis' career had started to be focused on films, which were themselves focussed on his music. His first film, a Western originally titled The Reno Brothers, had been intended to have him in a small part, trying to be a straight actor, without any singing at all, and that was how Elvis had been persuaded to do it.\n\nInstead, at the last minute, four songs had been added to the film, and it had been retitled from The Reno Brothers to Love Me Tender. Elvis' part -- which was originally a relatively minor part -- had been beefed up, though in terms of actual plot involvement he was still not the main star, and the film became an uneasy compromise between being a serious Western drama and a rock and roll vehicle, not really managing to do either well.\n\nThe film after that, \"Loving You\", had been different:\n\n[Excerpt: Elvis Presley, \"Loving You\"]\n\nThat one had been a more straight ahead rock and roll film -- it was basically a fictionalised version of Elvis' own life to that point, with him playing Deke Rivers, a singer who is discovered by the manager of a fading country star. The manager in this case is a woman, and she also becomes the love interest in the film, but the broad outlines are about what you'd expect from a fictionalised biopic -- Elvis ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode sixty-two of A History of Rock Music in Five Hundred Songs looks at \"Jailhouse Rock\" by Elvis Presley, and at his relationships with Colonel Tom Parker, Leiber and Stoller, his band members, and the film industry. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on Santa Claus is Back in Town, also by Elvis, which ties in more than most to this episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nHound Dog: The Leiber and Stoller Autobiography by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\nThere are many, many books about Elvis Presley out there, but the one I'm using as my major resource for information on him, and which has guided my views as to the kind of person he was, is Last Train to Memphis by Peter Guralnick, generally consider",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}