{
  "title": "South Africa Needs to Step Up Fight Against Gender Based Violence",
  "link": "https://www.hrw.org/news/2022/11/01/south-africa-needs-step-fight-against-gender-based-violence",
  "description": "Click to expand Image\n          \n\n\n\n\n  \n        \n                      \n      \n        President Cyril Ramaphosa delivering the keynote address at the National Gender-based Violence and Femicide Summit on November 1, 2018 in Pretoria, South Africa.\n                    © 2018 GCIS\n          \n\n  \n<p>The second Presidential Summit on Gender-Based Violence and Femicide (GBVF) this week in South Africa presents an opportunity to reflect on the successes and challenges in tackling widespread GBVF in the country.</p>\n\n<p>Since the first summit in 2018, South African authorities have taken some positive steps, including adopting the National Strategic Plan on GBVF 2020 and the September 2021 amendment to the 1998 Domestic Violence Act, to make it easier for victims to get protection orders. In January, authorities amended a raft of laws, the Criminal Law (Sexual Offences and Related Matters) Amendment Act, the Criminal and Related Matters Amendment Act, the Domestic Violence Amendment Act, and the Criminal Law (Forensics Procedures) Amendment Act, all aimed at strengthening efforts to address GBVF.</p>\n\n<p>Despite these strides in law reform and apparent political will, GBVF is still rampant in South Africa in part due to inadequate funding and lack of cooperation among government departments, and there are several instances in which the criminal justice system has not been supportive of survivors. Poverty and patriarchal norms are also barriers to implementing measures to tackle GBVF. President Cyril Ramaphosa, who is hosting the summit, described GBVF as the “second pandemic” at the height of the Covid-19 pandemic in 2020.</p>\n\n<p>The summit should lay out what the steps will be taken to implement the ambitious strategic plan, including how much funding will be available, how it will be prioritized and how spending will be tracked so the public can see what has been spent, and where. Authorities should also adopt unambiguous blueprints for cooperation between the different government departments. All measures proposed need to adopt an intersectional approach to ensure inclusion of the perspectives and experiences of GBVF faced by all women, including lesbian, bisexual, and transgender women, women activists, older women, women with disabilities, undocumented survivors, and sex workers. The summit should adopt strategies, including education in schools and the promotion of sexual health and community mobilization programs that address misogyny, patriarchy, and negative attitudes towards all women in South Africa.</p>",
  "pubDate": "Tue, 01 Nov 2022 09:41:52 -0400",
  "dc:creator": "Human Rights Watch",
  "guid": "https://www.hrw.org/news/2022/11/01/south-africa-needs-step-fight-against-gender-based-violence"
}