{
  "title": "Google Assignments, your new grading companion",
  "link": "https://blog.google/outreach-initiatives/education/introducing-assignments/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p></p><p>Instructors lose valuable time doing cumbersome tasks: writing the same comment on multiple essays, returning piles of paper assignments, and battling copy machine jams. These frustrations are most often felt by instructors with the highest teaching workloads and the least time. For the last five years, we’ve been building tools—like Classroom and Quizzes in Google Forms—to address these challenges. Now you can take advantage of these tools if you use a traditional Learning Management System (LMS). </p><p><a href=\"http://edu.google.com/assignments\">Assignments</a> brings together the capabilities of Google Docs, Drive and Search into a new tool for collecting and grading student work. It helps you save time with streamlined assignment workflows, ensure student work is authentic with originality reports, and give constructive feedback with comment banks. You can use Assignments as a standalone tool and a companion to your LMS (no setup required!) or your school admin can integrate it with your LMS. <a href=\"http://assignments.google.com/beta\">Sign up</a> today to try Assignments.</p><p>If you're one of the 40 million people using Classroom: you've got the best of Assignments already baked in, including our <a href=\"https://blog.google/outreach-initiatives/education/originality-reports\">new originality reports</a>. For everyone else, Assignments gives you access to these features as a compliment to your school’s LMS. <br/></p><h3>Assignments is your tireless grading companion</h3><p>Using an LMS can create more work than it saves: students turn in all kinds of files, you have to download and re-upload student files one-by-one, and what if students can keep editing after they already turned in their work? Assignments handles all this for you.</p><p>Assignments streamlines the creation and management of coursework, and tackles some of your biggest frustrations:<br/></p><ul><li><p>Stop typing the same feedback over and over by using a comment bank, and never worry about pressing the “save” button again</p></li><li><p>Check student work for originality and automatically lock work once it’s turned in</p></li><li><p>Assign files with the option to send each student a copy (no more copy machines!)</p></li><li><p>Grade assignments for an entire class with a student switcher and rubrics, and review any file type without leaving your grading interface</p></li><li><p>Comment and leave suggestions on student work with Google Docs</p></li></ul></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col-l--6 h-c-grid__col--8 h-c-grid__col-l--offset-3 h-c-grid__col--offset-2\"><a class=\"article-image--link\"><img alt=\"Grade in Google Assignments\" class=\"article-image--large\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/Grade_social_1.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p></p><p>Instructors and students can attach anything to assignments: Docs or Word files for papers, spreadsheets for data analysis, slides for presentations, sites for digital portfolios or final projects, <a href=\"https://colab.research.google.com/\">Colab</a> notebooks for programming exercises, and much more. </p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col-l--6 h-c-grid__col--8 h-c-grid__col-l--offset-3 h-c-grid__col--offset-2\"><a class=\"article-image--link\"><img alt=\"Create assignments with Google Assignments\" class=\"article-image--large\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/Create_social_1.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Help students turn in their best work with originality reports</h3><p>With <a href=\"https://blog.google/outreach-initiatives/education/originality-reports\">originality reports</a> in Assignments, you can check student work for missed citations and possible plagiarism without interrupting your grading workflow. When students turn in a document, Assignments will check students’ text against hundreds of billions of web pages and tens of millions of books. </p><p>If you enable originality reports on an assignment, students can also check their work for authenticity (a limited number of times) to correct issues, turn in their best work, and save instructors time grading. Since both you and your students can see originality reports, they’re designed to help you teach your students about authenticity and academic integrity. </p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col-l--6 h-c-grid__col--8 h-c-grid__col-l--offset-3 h-c-grid__col--offset-2\"><a class=\"article-image--link\"><img alt=\"Analyze student work with originality reports\" class=\"article-image--large\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/Analyze_social_2.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Getting started with Assignments</h3><p>Starting today, you can <a href=\"http://edu.google.com/assignments\">sign up</a> to get access to Assignments when it becomes available in a few weeks. Assignments will be available for free as part of G Suite for Education and can be used by instructors alongside or integrated with an LMS. </p><p>Instructors can use Assignments even if your school has an LMS. There’s no setup required, all you need is to <a href=\"http://assignments.google.com/beta\">sign up</a> and have a school-issued Google account. </p><p>Admins can turn on access to Assignments within your LMS. Assignments is available as an LTI tool, which provides a more integrated experience and enables roster syncing and grade transmission to your LMS gradebook. Assignments is an improved and expanded version of Course Kit, so if you’re already in the Course Kit beta, you’ll automatically have access to Assignments. </p><p>If you use Canvas, we’ve worked with their team to complement the Assignments LTI tool with <a href=\"https://support.google.com/edu/coursekit/answer/9381694?hl=en&amp;ref_topic=9069280\">a set of additional features</a> that make Docs and Drive work seamlessly across all Canvas assignments. </p></div></div></body></html>",
  "pubDate": "Wed, 14 Aug 2019 16:00:00 +0000",
  "guid": "https://blog.google/outreach-initiatives/education/introducing-assignments/",
  "category": [
    "Education",
    "Google Workspace",
    "Docs",
    "Drive"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Google Assignments, your new grading companion",
    "description": "Assignments brings together the capabilities of Google Docs, Drive and Search into a new tool for collecting and grading student work.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/007-BTS-Assignments-Header-FM.max-600x600.png",
    "site_name": "Google",
    "url": "https://blog.google/outreach-initiatives/education/introducing-assignments/"
  },
  "author": {
    "name": "Jorge Lugo",
    "title": "Software Engineer, Google Assignments",
    "department": "",
    "company": ""
  }
}