{
  "title": "I asked Gmail experts to rewrite my emails",
  "link": "https://blog.google/products/gmail/gmail-experts-rewrite-my-emails/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"e3xqm\">You may think that, as a writer at Google, I would be an accomplished emailer — but the truth is that my emailing skills and inbox management could use some help. I often feel like I’m sending emails that disappear into the void, go unanswered (or partially answered) for too long or that require more follow up than I’d like. There’s got to be a better way!</p><p data-block-key=\"femoi\">Luckily for me, I work with no shortage of email experts. So I asked a few of them to critique some of my recent emails, and to give me pointers about what I could have done instead.</p><p data-block-key=\"escsu\">Turns out the secret to strong, effective emails is a mix of clear writing and helpful tools. See for yourself below with these before and after examples straight from my sent messages folder.</p><p data-block-key=\"do48n\">In the “before” emails, I’ve used bolded copy and superscripts to make it clear what exactly the email pros identified as missteps. The superscript numbers match up to the mistake and solution feedback (so, superscript 2 matches up to mistake and solution #2, superscript 3 with #3, and so on). And then you can see the revised email (the “after”), with bolded copy and superscripts to indicate the changes I made based on that feedback.</p><p data-block-key=\"drfk9\">Let’s get to it.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col--10 h-c-grid__col--offset-1 h-c-grid__col-l--offset-2 h-c-grid__col-l--8\"><a class=\"article-image--link\"><img alt=\"A page break illustration showing a blue line with a gmail icon in the middle.\" class=\"article-image--full\" data-loading='{\n                \"mobile\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/gmail_divider_2.max-500x500.png\",\n                \"desktop\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/gmail_divider_2.max-1000x1000.png\"\n              }' loading=\"lazy\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/images/gmail_divider_2.max-100x100.png \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3 data-block-key=\"e3xqm\"><b>The email:</b></h3><p data-block-key=\"e2i9l\">Date: <b>August 26, 2022, 6:46 PM</b><b><sup>1<br/></sup></b>Subject: <b>Happy Friday</b><b><sup>2</sup></b></p><p data-block-key=\"a4186\">Hi everyone! Wanted to recap everything we went over in the meeting earlier this week. The whole team is going to divide and conquer, so why don’t you <b>let me know</b><b><sup>3</sup></b> what piece you’d like to work on? Or… <b>thoughts on how best to go about that?</b><b><sup>3</sup></b> Also, we still need to figure out if we want to bring in other teams to help out with this or if we think it would be best to do our part first and then look for outside help… <b>thoughts?</b><b><sup>3</sup></b> OK I think that’s it, have a great weekend! And if you could <b>get back to me on this asap</b><b><sup>4</sup></b> that would be great because then I can solidify the recap notes and send them along.</p><p data-block-key=\"4j9p5\">Thanks!<br/>Molly</p><h3 data-block-key=\"32eqk\"></h3><h3 data-block-key=\"7h5rr\"><b>The feedback:</b></h3><p data-block-key=\"8mf6p\"><b>Mistake #1: I sent an email — with action items — at the end of the day on a Friday!<br/>The solution:</b> Use <a href=\"https://support.google.com/a/users/answer/9395629?hl=en\">Gmail’s schedule send</a> feature. “Sending people an email on a Friday afternoon makes it really difficult to get feedback,” says Maalika Manoharan, a Gmail product manager. “Schedule it for Monday morning,” she says, when people are more focused on work and better able to respond. “Or better yet, Tuesday morning — people can be slammed trying to catch up from the weekend on Monday, and it could get lost.”</p><p data-block-key=\"2ra72\"><b>Mistake #2:</b> <b>The subject line doesn’t indicate what the email is about.<br/>The solution:</b> I should have started with a much more specific subject line, says Sergio Civetta, who works in Strategy and Operations and has helped with email courses for Googlers. People are busy, and getting to the point helps them manage their inboxes and figure out what needs their attention.</p><p data-block-key=\"d7sv5\"><b>Mistake #3:</b> <b>For such a short note, I asked for fairly broad feedback.<br/>The solution:</b> “If you want email replies on specific topics, break them out clearly and be as direct as possible,” Sergio says. He notes that depending on who I’m sending this out to, I should use my own judgment to determine if this is going to lead to a messy string of replies. If so, it might be better to jump into a meeting or email people separately — or ask for feedback in a central location, like a Google Sheet or a Doc.</p><p data-block-key=\"8ai0o\"><b>Mistake #4: I wasn’t clear about when I needed their responses.<br/>The solution:</b> Be clear and specific if you need a response. “In this case, I’d suggest telling them multiple times they have action items, and anchoring a specific date for responses before closing your email,” Sergio says.</p><h3 data-block-key=\"6imdq\"></h3><h3 data-block-key=\"eksls\"><b>The revise:</b></h3><p data-block-key=\"4v61q\">Date: <b>August 29, 2022, 9:30 AM</b><b><sup>1<br/></sup></b>Subject: <b>[Response requested] Project kick-off meeting action items</b><b><sup>2</sup></b></p><p data-block-key=\"eoeb5\">Hi everyone!</p><p data-block-key=\"dnpkk\">Thanks all for attending our kick-off on Friday. There are a few items <b>still in need of your input</b><b><sup>3:</sup></b></p><p data-block-key=\"8rgnr\"><b>Workstream ownership</b><b><sup>3<br/></sup></b>We agreed to divide and conquer. I’ve attached a Google Sheet that lists the various project workstreams; <b>please indicate in the Sheet</b><b><sup>3</sup></b> which ones you’d like to own.</p><p data-block-key=\"fk5lm\"><b>Involvement of other teams</b><b><sup>3<br/></sup></b>We still need to figure out if we want to involve other teams right now or if we’re better off getting this started on our own and making a call later. <b>Please reply to this thread</b><b><sup>3</sup></b> with your thoughts on that question.</p><p data-block-key=\"67odi\">I’d appreciate your answers <b>by Tuesday</b><b><sup>4</sup></b> so we can finalize recap notes and next steps.</p><p data-block-key=\"b4mi2\">Thank you!<br/>-Molly</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col--10 h-c-grid__col--offset-1 h-c-grid__col-l--offset-2 h-c-grid__col-l--8\"><a class=\"article-image--link\"><img alt=\"A page break illustration showing a blue line with a gmail icon in the middle.\" class=\"article-image--full\" data-loading='{\n                \"mobile\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/gmail_divider_2.max-500x500.png\",\n                \"desktop\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/gmail_divider_2.max-1000x1000.png\"\n              }' loading=\"lazy\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/images/gmail_divider_2.max-100x100.png \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3 data-block-key=\"hkusa\"><b>The email:</b></h3><p data-block-key=\"fvkhc\">Date: August 24, 2022, 2:39 PM<br/>Subject: <b>(no subject)</b><b><sup>1</sup></b></p><p data-block-key=\"91vc9\">Hey, I had a few questions about the trip:</p><p data-block-key=\"bp1nf\">Do you know when it is? Also, I’m supposed to be helping with some of the planning…but I need a few more details before getting started - something you could help with? What do you think everyone will want to do? What’s the consensus?</p><p data-block-key=\"6hgvs\">I have <b>a million more questions</b><b><sup>2</sup></b> so let me know what you think when you can!</p><p data-block-key=\"c7hrq\">-Molly</p><h3 data-block-key=\"ekh5m\"></h3><h3 data-block-key=\"7h8pe\"><b>The feedback:</b></h3><p data-block-key=\"885vt\"><b>Mistake #1: I didn’t include a subject line at all.<br/>The solution:</b> Use Gmail’s Smart Compose. Maalika wisely points out that one huge problem with this email is that it doesn’t have a subject line. “You can just let Gmail write the subject line for you,” she says. “Most people probably think of <a href=\"https://support.google.com/mail/answer/9116836?hl=en&amp;co=GENIE.Platform%3DDesktop\">Smart Compose</a> as filling in responses, but it can also help fill in subject lines.” You’ll see Gmail make a subject line suggestion once the email is drafted, and hitting tab will fill it in — so long as you’ve written something in the body of the email for the tool to pull from. (Gmail will also ask if the suggestion isn’t what you need, and you can help this feature get smarter with a response.)</p><p data-block-key=\"3bjf3\"><b>Mistake #2: I asked rapid-fire questions without options for answering.<br/>The solution:</b> With this many questions, some which could require extensive answers, Google productivity expert Laura Mae Martin advises that I could have offered other methods for responding, like a Google Meet call or via Google Chat, or even a Google Form so I could get decisions right away. This way it doesn’t devolve into half-answered questions or never-ending email chains chasing answers. “Or I would have used bullets with spaces between and asked folks to insert their answers inline,” she says.</p><h3 data-block-key=\"asuet\"></h3><h3 data-block-key=\"751rl\"><b>The revise:</b></h3><p data-block-key=\"b6r6m\">Date: August 24, 2022, 2:39 PM<br/>Subject: <b>[Response requested]</b> <b>Questions about the upcoming trip</b><b><sup>1</sup></b></p><p data-block-key=\"5upru\">Hey there, I have some questions about the upcoming trip! If you could reply with answers inline<b><sup>2</sup></b>, that would be great.</p><p data-block-key=\"44ntn\">1. What is the main focus going to be?<br/>2. Do you know when it is?<br/>3. I’m going to help with planning — thoughts on what folks would like to do? We have three afternoon slots for activities.</p><p data-block-key=\"8fi9l\">Those are my main questions, so feel free to respond here or <b>we can talk via Google Chat</b><b><sup>2</sup></b> and go from there — I’d like to have everything set by Tuesday. Thanks!</p><p data-block-key=\"4er4c\">-Molly</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col--10 h-c-grid__col--offset-1 h-c-grid__col-l--offset-2 h-c-grid__col-l--8\"><a class=\"article-image--link\"><img alt=\"A page break illustration showing a blue line with a gmail icon in the middle.\" class=\"article-image--full\" data-loading='{\n                \"mobile\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/gmail_divider_2.max-500x500.png\",\n                \"desktop\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/gmail_divider_2.max-1000x1000.png\"\n              }' loading=\"lazy\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/images/gmail_divider_2.max-100x100.png \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3 data-block-key=\"hkusa\"><b>The email:</b></h3><p data-block-key=\"brjpn\">Date: August 12, 2022, 11:34 AM<br/>Subject: <b>RE:</b> <b>Project Assignments [Confidential]</b><b><sup>1</sup></b></p><p data-block-key=\"3ujuo\">Apologies, the previous email was not meant for Team C. Those details were confidential for Teams A and B only.</p><p data-block-key=\"cvmbu\">August 12, 2022, 11:29 AM Molly McHugh-Johnson wrote:</p><p data-block-key=\"fo4mu\">As discussed, here are all of the details from the product meeting earlier today for Teams A and B. Please do not forward this email! <b>Only reply with your additions</b><b><sup>2</sup></b> to the notes before we send up the line.</p><h3 data-block-key=\"12gbo\"></h3><h3 data-block-key=\"93lq2\"><b>The feedback:</b></h3><p data-block-key=\"8l6q2\"><b>Mistake #1: I sent a sensitive email to the wrong people!<br/>The solution(s):</b> I should have sent this in confidential mode, or unsent it when I realized my slip-up. With <a href=\"https://support.google.com/a/answer/7684332?hl=en\">confidential mode</a>, “the content can expire on a certain date and people can’t download it, or forward it,” says Gmail product marketing manager Stephanie Chang. And there’s also a solution in case you send something that you shouldn’t, like I did here: <a href=\"https://support.google.com/mail/answer/2819488?hl=en&amp;co=GENIE.Platform%3DDesktop\">undo send</a>. “We hear people say they wish they could unsend an email,” Maalika says. “And you can!” A little notification pops up in the bottom of the screen where you can undo a send.</p><p data-block-key=\"1f5al\">“And if you’re particularly nervous about sending something you want to get back, you can customize the settings of how long you can click undo send,” Stephanie says. You can <a href=\"https://support.google.com/mail/answer/2819488?hl=en&amp;co=GENIE.Platform%3DDesktop\">change how long your own undo send timing lasts for</a> — it can be up to 30 seconds. Another delay-related idea from Maalika is to schedule the send for an hour later. “That way, if I have second thoughts, I can revise and reschedule.”</p><p data-block-key=\"e0v39\"><b>Mistake #2: This email is begging to become a never-ending thread.<br/>The solution:</b> When an email requires multiple people for input, Stephanie says I could <a href=\"https://support.google.com/mail/answer/11930385?hl=en\">draft it in a Google Doc</a> and ask everyone who needed to help write it assist me there. Using Google Docs to first draft the copy means you’ll be able to keep all the formatting the same, in addition to the language. “Then when it’s ready, you can just hit File, Email and Email draft,” she says.</p><h3 data-block-key=\"bvis2\"></h3><h3 data-block-key=\"8gsfa\"><b>The revise:</b></h3><p data-block-key=\"226l8\">Date: August 12, 2022, 11:34 AM<br/>Subject: <b>Project Assignments [Confidential]</b><b><sup>1</sup></b></p><p data-block-key=\"35iu3\">As discussed, here are all of the details from the product meeting earlier today for Teams A and B. Please do not respond to this email with notes — instead, <b>add your input to this Google Doc in suggested mode</b><b><sup>2</sup></b>. Thank you!</p><p data-block-key=\"64u5r\"><b>[This email was sent in confidential mode.]</b><b><sup>1</sup></b></p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col--10 h-c-grid__col--offset-1 h-c-grid__col-l--offset-2 h-c-grid__col-l--8\"><a class=\"article-image--link\"><img alt=\"A page break illustration showing a blue line with a gmail icon in the middle.\" class=\"article-image--full\" data-loading='{\n                \"mobile\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/gmail_divider_2.max-500x500.png\",\n                \"desktop\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/gmail_divider_2.max-1000x1000.png\"\n              }' loading=\"lazy\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/images/gmail_divider_2.max-100x100.png \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3 data-block-key=\"hkusa\"><b>The email:</b></h3><p data-block-key=\"4hi3d\">Date: August 11, 2022 9:50 am<br/>Subject: <b>Re: VIP read now! Need your input</b><b><sup>1</sup></b></p><p data-block-key=\"4mjth\">Hey, I’m <b>so so so so sorry</b><b><sup>2</sup></b>, I totally missed this email — it got swallowed up this week. <b>I promise I will look at this first thing Monday!</b><b><sup>3</sup></b></p><h3 data-block-key=\"33op3\"></h3><h3 data-block-key=\"f4u3j\"><b>The feedback:</b></h3><p data-block-key=\"6npoo\"><b>Mistake #1: I missed an important email that required my feedback.<br/>The solution:</b> Stephanie suggests I use the <a href=\"https://support.google.com/mail/answer/7622010?hl=en&amp;co=GENIE.Platform%3DDesktop\">snooze function</a> on future important emails, so that I can’t forget about them. “Or you can look out for nudges — they’re sort of saying ‘hey, you received this email a few days ago, do you want to reply?’” You can also solve this email issue with some inbox organization, like Stephanie does. “I personally love using tasks,” she says. “I have <a href=\"https://support.google.com/a/users/answer/9310236?hl=en\">a task list</a> so I’ll add emails that need to be replied to and then I know, say Monday morning, I have that on my list.” Another option, Maalika says, is to simply star your emails and then hit your starred folder — or color code your stars so they indicate items to address today, tomorrow, next week, etc. Or, Laura says, using labels could have prevented me from missing the email in the first place. “I have a list of color-coded labels that I use — for example if an email comes from someone with an @google.com email address, it gets coded a certain way,” she says.</p><p data-block-key=\"9jc2j\"><b>Mistake #2: I apologized maybe a bit more than was necessary.<br/>The solution:</b> “No need to repeatedly apologize!” Laura says. “I think one thing you could have done better, which I'm a big proponent of, is not answering every email right away, but acknowledging emails right away.”</p><p data-block-key=\"9vidc\"><b>Mistake #3: I set an overly ambitious deadline for myself.<br/></b>“I’d reply saying ‘by no later than Tuesday morning,’ so you have all day Monday to get to it,” Laura says. Sergio also says one option would be to simply wait until Monday to reply at all. “Sometimes it’s best to save the person an email that just tells them there’s another one coming.” But should I feel compelled to send one immediately, here’s a new and improved version:</p><h3 data-block-key=\"qk61\"></h3><h3 data-block-key=\"8c3an\"><b>The revise:</b></h3><p data-block-key=\"fl0g1\">Date: August 11, 2022 9:50 am<br/>Subject: Re: VIP read now! Need your input</p><p data-block-key=\"a0j13\">Hi!</p><p data-block-key=\"3egnf\">Thanks for sending this - <b>I have it on my radar</b><b><sup>2</sup></b>. I had a lot going on this week so I will be sure to review and complete comments <b>no later than Tuesday morning</b><b><sup>3</sup></b>.</p><p data-block-key=\"4908f\">Thanks and I look forward to reviewing!</p><p data-block-key=\"3o3pi\">-Molly</p></div></div></body></html>",
  "pubDate": "Thu, 15 Sep 2022 14:00:00 +0000",
  "guid": "https://blog.google/products/gmail/gmail-experts-rewrite-my-emails/",
  "category": "Gmail",
  "media:content": "",
  "og": {
    "type": "article",
    "title": "I asked Gmail experts to rewrite my emails",
    "description": "Their tips for how to write better emails rely on clear writing and helpful tools.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/gmail_hero_animated.gif",
    "site_name": "Google",
    "url": "https://blog.google/products/gmail/gmail-experts-rewrite-my-emails/"
  },
  "author": {
    "name": "Molly McHugh-Johnson",
    "title": "Contributor",
    "department": "The Keyword",
    "company": ""
  }
}