{
  "id": "tag:blogger.com,1999:blog-582368152716771238.post-6998827941075226110",
  "published": "2022-10-03T12:57:00.009-05:00",
  "updated": "2022-10-10T09:02:43.827-05:00",
  "category": [
    "",
    "",
    ""
  ],
  "title": "Sowell Nobel Redux",
  "content": "<p>Nobel Prize season is around the corner. Last year, <a href=\"https://johnhcochrane.blogspot.com/2021/10/sowell-nobel.html\" target=\"_blank\">I blogged in favor of Tom Sowell</a>. I update, with some edits.&nbsp;</p><p>Dear Nobel Committee: How can you&nbsp;<i>not</i>&nbsp;give the prize to&nbsp;<a href=\"https://www.tsowell.com\" target=\"_blank\">Tom Sowell&nbsp;</a>this year?&nbsp;</p><p>Tom's work evidently merits a Nobel purely as a contribution to economics, covering many issues. But we can't ignore what year it is. Race is a forefront issue of our time. How can you<i>&nbsp;not</i>&nbsp;give the prize to the living economist who has written the most penetrating economic analysis of race?&nbsp;</p><p>Yes, he's a free-market economist, and thus characterized as conservative. His deeply fact-based research is &nbsp;uncomfortable to The Narrative. For example, groups that white people cannot tell apart have profoundly different outcomes in the US. Nigerian immigrants are among the highest achieving ethnic groups in the US. West Indians do well. Asians of different waves of immigration and different countries -- Chinese, Laotians, Vietnamese -- show profound differences. Tom has thousands of such facts, impeccably documented.&nbsp;</p><p>But you're the Nobel Committee. You care about Science, about facts, about logic, not about cheers from the Davos crowd. You care about issues that are important, as you should, but you do not care about embracing one or the other political narrative's answers to those questions. You care about the reputation of your Prize, for courageously recognizing great research, even if its surprising conclusions upset established orders. And, to your credit, you have given the prize to economists of widely different political enthusiasms through the years. &nbsp;<span></span></p><a name='more'></a><p></p><p>Why not? I grant, Tom's work is unusual. The Nobel Prize is, justly, conservative (that's praise in my vocabulary). Prizes prosper by widespread view that they are given to people who deserve them. Most (not all) Nobels in economics go to people who, if you ask around the faculty lunchrooms at the top economics department, are those who people would instantly mention. And rightly so. But that fact gives a bit of tilt toward methodological work. People in their productive 30s and 40s are likely to mention their mentors who gave them the tools to write the papers that got them where they are. It gives a bit of tilt toward people who produce a lot of graduate students. &nbsp;Tom did not mentor an army of young assistant professors, nor did he invent a theoretical framework or econometric technique. He writes books, and taught us about how the world works. (<i>Knowledge and Decisions</i>&nbsp;is an excellent work of theory, but not an extendable mathematical framework.)&nbsp;</p><p>But the Nobel isn't always like that, and does occasionally celebrate persuasive and important fact-based and logic-based books. Indeed, as I infer, the Prize occasionally makes a bit of a subtle point about what's important and what kind of work the rest of us might do. That Tom's work is important, and his style of work is worth emulating is a useful point. And perhaps the committee is a bit aghast at the wokeness that is starting to infect even economics.&nbsp;</p><p>For example, the American Economics Association, via its&nbsp;<a href=\"https://www.aeaweb.org/news/member-announcements-june-5-2020\" target=\"_blank\">statement from the American Economic Association Executive Committee</a>, has compiled an officially sanctioned <a href=\"https://diversifyingecon.org/history-of-race-and-racism/\" target=\"_blank\">&nbsp;reading list on racism and the experience of Black Americans</a>. Members of the AEA Executive Committee have pledged to continue to educate themselves in part by reading works from the list and to seek to integrate work by diverse authors in course syllabi, and \"ask all economists to make the same pledge.\" This list is in use at semi-mandatory &nbsp;DEI training sessions, reportedly including the Federal Reserve. But this officially-endorsed reading list to this day brazenly omits Sowell. Or Walter Williams. Or Glenn Loury. Or Roland Fryer. &nbsp;And here I am succumbing to racism that says the author's skin color matters to his or her or their conclusions. Or Gary Becker. Or Bob Fogel. Maybe the committee would like to say that Sowell and related work should be at least included on a comprehensive officially sanctioned reading list offered by an <i>economics</i> association.&nbsp;</p><p>While Tom is hardy, he is 92. None of us last forever. Nor does your opportunity to recognize one of the most important economists of our time. This is the year.&nbsp;</p><p>********</p><p>Update: If you don't know Tom, and don't want to face an overwhelming volume of primary sources, his&nbsp;<a href=\"https://en.wikipedia.org/wiki/Thomas_Sowell\" target=\"_blank\">Wikipedia page</a>&nbsp;is not bad. Twitter commenters complain that he appears on Fox News. Well, Paul Krugman appears in the New York Times. Within a respectable range, really, we need to start keeping political commentary separate from scientific contribution, like other hobbies.&nbsp;</p><p>Update: Well, they didn't give it to Tom, but Bernanke, Diamond, Dybvig is a fine prize for great work.</p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "John H. Cochrane",
    "uri": "http://www.blogger.com/profile/04842601651429471525",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 29
}