{
  "title": "Episode 7: Wynonie Harris and &#8220;Good Rockin&#8217; Tonight&#8221;",
  "link": "https://500songs.com/podcast/wynonie-harris-and-good-rockin-tonight/",
  "pubDate": "Mon, 19 Nov 2018 00:00:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/wynonie-harris-and-good-rockin-tonight/",
  "description": "Welcome to episode seven of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at Wynonie Harris and \"Good Rockin' Tonight\"\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-7-good-rockin-tonight/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nAll the music I talk about here is now in the public domain, and there are a lot of good cheap compilations available. <a href=\"https://amzn.to/2Tn6dHf\">This four-CD set of Wynonie Harris</a> is probably the definitive one. <a href=\"https://amzn.to/2DIF6Sx\">This two-CD set of Roy Brown material</a> has all his big hits, as well as the magnificently disturbing \"Butcher Pete Parts 1 & 2\", my personal favourite of his. Lucky Millinder isn't as well served by compilations, but <a href=\"https://amzn.to/2zfLlt9\">this one</a> has all the songs I talk about here, plus a couple I talked about in<a href=\"https://www.500songs.com/e/episode-5-rosetta-tharpe-and-this-train/\"> the Sister Rosetta Tharpe episode.</a>\n\nThere is only one biography of Wynonie Harris that I know of -- <em>Rock Mr Blues</em> by Tony Collins -- and that is out of print, though you can pick up expensive second-hand copies <a href=\"https://amzn.to/2zfLNYn\">here</a>.\n\nSome of the information on Lucky Millinder comes from <a href=\"https://amzn.to/2TpNpa8\"><em>Shout, Sister, Shout!: The Untold Story of Rock-and-roll Trailblazer Sister Rosetta Tharpe</em></a> by Gayle F Wald, which I also used for the episode on Rosetta Tharpe.\n\nThere are articles on Wynonie Harris, Roy Brown, and Cecil Gant in <a href=\"https://amzn.to/2Kjoi53\"><em>Unsung Heroes of Rock 'n' Roll</em> by Nick Tosches</a>. This book is considered a classic, and will probably be of interest to anyone who finds this episode and the next few interesting, but a word of caution -- it was written in the 70s, and Tosches is clearly of the Lester Bangs/underground/gonzo school of rock journalism, which in modern terms means he's a bit of an edgelord who'll be needlessly offensive to get a laugh. The quotes from Harris I use here are from an article in <em>Tan</em> magazine, which Tosches quotes.\n\n<a href=\"https://amzn.to/2Kc5Db6\"><em>Before Elvis,</em></a> a book I've mentioned many times before, covers all the artists I talk about here.\n\nAnd again, <a href=\"https://archive.org/details/georgeblood\">archive.org's collection of digitised 78 records</a> was very useful.\n\n<strong>Patreon Admin Note</strong>\n\nI have updated the details on my Patreon to better reflect the fact that it backs this podcast as well as my other work, and to offer podcast-related rewards. I'll be doing ebooks for Patreons based on the scripts for the podcasts (the first of those, <em>Savoy Stompers and Kings of Swing</em> should be up in a week or so), and if the Patreon hits $500 a month I'll start doing monthly bonus episodes for backers only. Those episodes won't be needed to follow the story in the main show, but I think they'd be fun to do. To find out more, <a href=\"https://www.patreon.com/join/AndrewHickey\">check out my Patreon</a>.\n\n<strong>Transcript</strong>\n\nThere's a comic called <em>Phonogram</em>, and in it there are people called \"phonomancers\". These are people who aren't musicians, but who can tap into the power of music other people have made, and use it to do magic.\n\nI think \"phonomancers\" is actually a very useful concept for dealing with the real world as well. There are people in the music industry who don't themselves play an instrument or sing or any of the normal musician things, but who manage to get great records made -- records which are their creative work -- by moulding and shaping the work of others. Sometimes they're record producers, sometimes they're managers, sometimes they're DJs or journalists. But there are a lot of people out there who've shaped music enormously without being musicians in the normal sense. Brian Eno, Sam Phillips, Joe Meek, Phil Spector, Malcolm McLaren, Simon Napier-Bell... I'm sure you can add more to the list yourself. People -- almost always men, to be honest -- who have a vision, and a flair for self-publicity, and an idea of how to get musicians to turn that idea into a reality. Men who have the power to take some spotty teenager with a guitar and turn him into a god, at least for the course of a three minute pop song.\n\nAnd there have always been spaces in the music industry for this sort of person. And in the thirties and forties, that place was often in front of the band.\n\nMost of the big band leaders we remember now were themselves excellent musicians -- Count Basie, Duke Ellington, Benny Goodman, you could put those people up against most others on their instruments. They might not have been the best, but they could hold their own.\n\nBut plenty of other band leaders were mediocre musicians or couldn't play at all. Glenn Miller was a competent enough trombone player, but no-one listens to the Glenn Miller band and thinks \"wow, one of those four trombone players is fantastic!\" And other band leaders were much less involved in the music. Kay Kyser -- the most successful bandleader of the period, who had eleven number one records and thirty-five in the top ten -- never played an instrument, didn't write songs, didn't sing. He acted as onstage MC, told jokes, and was the man at the front of the stage. And there were many other bandleaders like that -- people who didn't have any active involvement in the music they were credited with. Bob Crosby, Bing's brother, for example, was a bandleader and would sing on some tracks, but his band performed plenty of instrumentals without him having anything to do with them.\n\nMost non-playing bandleaders would sing, like Bob Crosby, but even then they often did so rarely. And yet some of them had an immense influence on the music world.\n\nBecause a good bandleader's talent wasn't in playing an instrument or writing songs. It was having an idea for a sound, and getting together the right people who could make that sound, and creating a work environment in which they could make that sound well. It was a management role, or an editorial one. But those roles can be important. And one of the most important people to do that job was Lucky Millinder, who we've talked about a couple of times already in passing.\n\nLucky Millinder is a largely forgotten figure now, but he was one of the most important figures in black music in the 1940s. He was a fascinating figure -- one story about how he got his name is that Al Capone was down ten thousand dollars playing dice, Millinder offered to rub the dice for luck, and Capone ended the night fifty thousand dollars up and called him Lucky from then on.\n\n(I think it's more likely that Lucky was short for his birth name, Lucius, but I think the story shows the kind of people Millinder was hanging around with).\n\nHe didn't play an instrument or read music or sing much. What Millinder could definitely do was recognise talent. He'd worked with Bill Doggett, before Doggett went off to join the Ink Spots' backing band, and the trumpet player on his first hit was Dizzy Gillespie, who Millinder had hired after Gillespie had been sacked from Cab Calloway's band after stabbing Calloway in the leg. He had Rosetta Tharpe as his female singer at the beginning of the forties, and Ruth Brown -- who we'll talk about later -- later on.\n\nHe'd started out as the leader of the Mills Blue Rhythm Band, the house band in the Cotton Club, before moving on to lead, as his own band, one of the main bands in residence at the Savoy, along with occasionally touring the chitlin' circuit -- the rather derogatory name for the clubs and theatres that were regular tour stops for almost all major black artists at the time.\n\nSlowly, during the 1940s, Millinder transitioned his band from the kind of swing music that had been popular in the thirties, to the jump band style that was becoming more popular. And if you want to point to one band that you can call the first rhythm and blues band, you probably want to look at Millinder's band, who more than any other band of the era were able to combine all the boogie, jump, and jive sounds with a strong blues feeling and get people dancing. Listen, for example, to \"Savoy\" from 1943:\n[Excerpt: \"Savoy\" by Lucky Millinder]\n\nIn 1944, after Rosetta Tharpe had left his band, Millinder needed a new second singer, to take the occasional lead as Tharpe had. And he found one -- one who later became the most successful rhythm and blues artist of the late 1940s. Wynonie Harris.\n\nHarris was already known as \"Mr. Blues\" when Millinder first saw him playing in Chicago and invited him to join the band. He was primarily a blues shouter, inspired by people like Big Joe Turner and Jimmy Rushing, but he could also perform in a subtler style, close to the jive singing of a Cab Calloway or Louis Jordan.\n\nHarris joined the Millinder band and started performing with them in their residency at the Savoy. Shortly after this, the band went into the studio to record \"Who Threw The Whiskey In The Well?\"\n\n[excerpt \"Who Threw The Whiskey in the Well?\"]\n\nYou'll note that that song has a backbeat. One of the things we talked about right back in episode two was that the combination of the backbeat and the boogie bass is what really makes rock and roll, and we're now getting to the point that that combination was turning up more and more.\n\nThat was recorded in May 1944, almost straight after the end of the musicians union strike, but it wasn't released straight away. Records, at that time, were released on discs made out of shellac, which is a resin made from insect secretions. Unfortunately, the insects in question were native to Vietnam, which was occupied by Japan, and India, which was going through its own problems at the time, so shellac was strictly rationed. There was a new product, vinylite, being made which seemed promising for making records, but that was also used for lifejackets, which were obviously given a higher priority during a war than making records was. So the record wasn't released until nearly a year after it was recorded. And during that time, Wynonie Harris had become a much more important part of Millinder's band, and was starting to believe that maybe he deserved a bit more credit.\n\nHarris, you see, was an absolutely astonishing stage presence. Lots of people who spoke about Elvis Presley in later years said that his performances, hip thrusts and leg shaking and all, were just a watered-down version of what Wynonie Harris had been doing. Harris thought of himself as a big star straight away,\n\nThis belief was made stronger when \"Who Threw The Whiskey In The Well\" was finally released. It became a massive hit, and the only money Harris saw from it was a flat $37.50 session fee. Millinder, on the other hand, was getting the royalties. Harris decided that it was his vocal, not anything to do with the rest of the band, that had made the record a success, and that he could make more money on his own.\n\n(In case you hadn't realised, yet, Wynonie Harris was never known as the most self-effacing of people, and that confidence gave him a huge amount of success on stage, but didn't win him many friends in his personal life).\n\nHarris went solo, and Lucky Millinder replaced him with a trumpet player and singer called Henry Glover. Harris started making records for various small labels.\n\nHis first record as a solo artist was \"Around the Clock Blues\", one of the most influential records ever made:\n\n[Excerpt \"Around the Clock Blues\" by Wynonie Harris]\n\nIf that sounds familiar, maybe it's because you've heard this song by Arthur Crudup that Elvis later covered:\n\n[excerpt of \"So Glad You're Mine\" by Arthur Crudup, showing it's more or less identical]\n\nOr maybe you know \"Reelin' and Rockin'\" by Chuck Berry...\n\n[excerpt of \"Reelin' and Rockin'\" by Chuck Berry, showing it's also more or less identical]\n\nAnd of course there was another song with \"Around the Clock\" in the title, and we'll get to that pretty soon...\n\nThe band on \"Around the Clock\", incidentally, was led by a session drummer called Johnny Otis.\n\nThat record, in fact, is one of the milestones in the development of rock and roll. And yet it's not the most important record Wynonie Harris made in the late 1940s.\n\nHarris recorded for many labels over the next couple of years, including King Records, whose A&R man Ralph Bass we'll also be hearing more about, and Bullet Records, whose founder Jim Bulleit went on to bigger things as well. And just as a brief diversion, we'll take a listen to one of the singles he made around this time, \"Dig this Boogie\":\n\n[excerpt \"Dig This Boogie\", Wynonie Harris]\n\nI played that just because of the pianist on that record -- Herman \"Sonny\" Blount later became rather better known as Sun Ra, and while he didn't have enough to do with rock music for me to do an episode on him, I had to include him here when I could.\n\nWynonie Harris became a big star within the world of rhythm and blues, and that was in large part because of the extremely sexual performances he put on, and the way he aimed them at women, not at the young girls many other singers would target. As he said himself, the reason he was making fifteen hundred dollars a week when most famous singers were getting fifty or seventy-five dollars a night was\n\"The crooners star on the Great White Way and get swamped with Coca-Cola-drinking bobby-soxers and other 'jail bait'. I star in Georgia, Texas, Alabama, Tennessee, and Missouri and get those who have money to buy stronger stuff and my records to play while they drink it. I like to sing to women with meat on their bones and that long green stuff in their pocketbook\".\n\nAnd he certainly made enough of that long green stuff, but he spent it just as fast as he made it. When he got a ten thousand dollar royalty cheque, he bought himself two Cadillacs and hired two chauffeurs, and every night at the end of his show they'd both arrive at the venue and he'd pick which one he was riding home in that night.\n\nNow, having talked about Wynonie Harris for a little bit, let's pause for a moment and talk about one of his fans. Roy Brown was a big fan of Harris, and was a blues singer himself, in something like the same style. Brown had originally been hired as \"a black singer who sounds white\", which is odd because he used a lot of melisma in his vocals, which was normally a characteristic of black singing. But other than that, Brown's main vocal influences when he started were people like Bing Crosby and other crooners, rather than blues music.\n\nHowever, he soon became very fond of jump blues, and started writing songs in the style himself. In particular, one, called \"Good Rockin' Tonight\", he thought might be popular with other audiences, since it always went down so well in his own shows. Indeed, he thought it might be suitable for Wynonie Harris -- and when Harris came to town, Brown suggested the song to him.\n\nAnd Harris wasn't interested. But after Brown moved back to New Orleans from Galveston, Texas, where he'd been performing -- there was a girl, and a club owner, and these things happen and sometimes you have to move --  Brown took his song to Cecil Gant instead. Gant was another blues singer, and if Harris wasn't up for recording the song, maybe Gant would be.\n\nCecil Gant was riding high off his biggest hit, \"I Wonder\", which was a ballad, and he might have seemed a strange choice to record \"Good Rockin' Tonight\", but while Gant's A-sides were ballads, his B-sides were boogie rockers, and very much in the style of Brown's song -- like this one, the B-side to \"I Wonder\"\n\n[excerpt \"Cecil Boogie\" by Cecil Gant]\n\nBut Gant wasn't the best person for Brown to ask to record a song. According to Jim Bulleit, who produced Gant's records, everything Gant recorded was improvised in one take, and he could never remember what it was he'd just done, and could never repeat a song. So Gant wasn't really in the market for other people's songs.\n\nBut he was so impressed by Brown's singing, as well as his song, that he phoned the head of his record company, at 2:30AM, and got Brown to sing down the phone. After hearing the song, the record company head asked to hear it a second time. And then he told Gant \"give him fifty dollars and don't let him out of your sight!\"\n\nAnd so Roy Brown ended up recording his song, on Deluxe Records, and having a minor hit with it:\n\n[excerpt \"Good Rocking Tonight\" by Roy Brown]\n\nWhen you listen back to that, now, it doesn't sound all that innovative at all. In fact it wears its influences on its sleeve so much that it namechecks Sweet Lorraine, Sioux City Sue, Sweet Georgia Brown, and Caldonia, all of whom were characters who'd appeared in other popular R&B songs around that time -- we talked about Caldonia, in fact, in the episode about \"Choo Choo Ch'Boogie\" and Louis Jordan.\n\nIt might also sound odd to anyone who's familiar with later cover versions by Elvis Presley, or by Paul McCartney and others who followed the pattern of Elvis' version. Brown only sings the opening line once, before singing \"I'm gonna hold my baby as tight as I can\". Those other versions restructure the song into a fairly conventional sixteen-bar blues form by adding in a repeat of the first line and a chord change along with it. Roy Brown's original, on the other hand, just holds the first chord, and keeps playing the same riff, for almost the entire verse and chorus -- the chord changes are closer to passing chords than to anything else, and the song ends up having some of the one-chord feel that people like John Lee Hooker had, where the groove is all and harmonic change is thrown out of the window. Even though you'd think, from the melody line, that it was a twelve-bar blues, it's something altogether different.\n\nThis is something that you need to realise -- the more chords something has, in general, the harder it is to dance to. And there will always, always, be a tension between music that's all about the rhythm, and which is there for you to dance to, and music which is all about the melody line, and which treats harmonic interest as an excuse to write more interesting melodies. You can either be Burt Bacharach or you can be Bo Diddley, and the closer you get to one, the further you get from the other. And on that spectrum, \"Good Rockin' Tonight\" is absolutely in the Diddley corner.\n\nBut at the time, this was an absolutely phenomenal record, and it immediately started to take off in the New Orleans market.\n\nAnd then Wynonie Harris realised that maybe he'd made a mistake. Maybe he should have recorded that song after all. And so he did -- cutting his own, almost identical, cover version of Brown's song:\n\n[excerpt from \"Good Rocking Tonight\" by Wynonie Harris]\n\nThere are a few differences between the two, of course. In particular, Harris introduced those \"hoy hoy\" vocals we just heard, which weren't part of Roy Brown's original. That's a line which comes from \"The Honeydripper\", another massively important R&B record.  Harris also included a different instrumental introduction -- playing \"When the Saints Go Marchin' In\" at the start, a song whose melody bears a slight resemblance to Brown's song.\n\nHarris also adds that backbeat again, and it's for that reason that Wynonie Harris' version of the song, not Roy Brown's original, is the one that people call \"the first rock and roll record\".\n\nOther than those changes, Harris' version is a carbon copy of Roy Brown's version. Except, of course, that Wynonie Harris was one of the biggest stars in R&B, while Roy Brown was an unknown who'd just released his first single. That makes a lot of difference, and Harris had the big hit with the song.\n\nAnd \"Good Rocking Tonight\", in Harris' version, became one of those records that was *everywhere*. Roy Brown's version of the song made number thirteen on the R&B charts, and two years later it would re-enter the charts and go to number eleven – but Harris' was a world-changing hit, at least in the R&B market.\n\nHarris' version, in fact, started off a whole chain of soundalikes and cash-ins, records that were trying to be their own version of \"Good Rockin' Tonight\". Harris himself recorded a sequel, \"All She Wants to Do is Rock\", but for the next two years everyone was recording songs with “rock” in the title.  There was Roy Brown's own sequel, \"Rockin' at Midnight\":\n\n[Excerpt \"Rockin' at Midnight\" by Roy Brown]\n\nThere was Cecil Gant's \"We're Gonna Rock\"\n\n[Excerpt]\n\nThere was \"Rock the Joint\" by Jimmy Preston\n\n[Excerpt]\n\nFrom 1948 through about 1951, if you listened to rhythm and blues records at all you couldn't escape this new rock craze. Record after record with \"rock\" in the title, with a boogie woogie bassline, with a backbeat, and with someone singing about how they were going to rock and roll.\n\nThis was, in fact, the real start of the rock and roll music fad. We're still six years away from it coming to the notice of the white mainstream audience, but all the pieces are there together, and while we're still three years away even from the canonical \"first rock and roll record\", Jackie Brenston's \"Rocket 88\", 1948 is when rock and roll first became a cohesive, unified, whole, something that was recognisable and popular, a proper movement in music rather than odd individuals making their own separate music.\n\nOf course, it was still missing some of the ingredients that would later be added. First-wave rock and roll is a music that's based on the piano and horn sections rather than guitars, and it wouldn't be until it merged with hillbilly boogie in the early fifties that the electric guitar started to be an important instrument in it. But... we've talked before and will talk again about how there's no real \"first rock and roll record\", but if you insist on looking for one then \"Good Rocking Tonight\" is as good a candidate as any.\n\nNeither of its creators did especially well from the rock and roll craze they initiated though. Roy Brown got a reputation for being difficult after he went to the musicians' union to try to get some of the money the record company owed him -- in the 1950s, as today, record companies thought it was unreasonable for musicians and singers to actually want them to pay the money that was written in their contract -- and so after a period of success in the late forties and very early fifties he spent a couple of decades unable to get a hit. He eventually started selling encyclopaedias door to door -- with the unique gimmick that when he was in black neighbourhoods he could offer the people whose doors he was knocking on an autographed photo of himself. He sold a lot of encyclopaedias that way, apparently. He continued making the occasional great R&B record, but he made more money from sales. He died in 1981.\n\nWynonie Harris wasn't even that lucky. He basically stopped having hits by 1953, and he more or less gave up performing by the early sixties. The new bands couldn't play his kind of boogie, and in his last few performances, by all accounts, he cut a sad and pitiful figure. He died in 1969 after more or less drinking himself to death.\n\nThe music business is never friendly towards originals, especially black originals. But we're now finally into the rock era. We'll be looking over the next few weeks at a few more \"first rock and roll songs\" as well as at some music that still doesn't quite count as rock but was influential on it, but if you've ever listened to a rock and roll record and enjoyed it, a tiny part of the pleasure you got you owe to Roy Brown and Wynonie Harris.",
  "itunes:subtitle": "Welcome to episode seven of A History of Rock Music in Five Hundred Songs. Today were looking at Wynonie Harris and Good Rockin Tonight\n\n\n\nResources\n\nAs always, Ive created a Mixcloud streaming playlist with full versions of all the songs in the episode.",
  "itunes:keywords": "1940s music strikes,Arthur Crudup,backbeat,boogie woogie,Cecil Gant,Chuck Berry,Cotton Club,Henry Glover,Jim Bulleit,Johnny Otis,jump bands,King Records,Lucky Millinder,Ralph Bass,Roy Brown,Savoy Ballroom,Sister Rosetta Tharpe,Sun Ra,swing,Wynonie Harris",
  "itunes:episodeType": "full",
  "itunes:episode": 7,
  "content:encoded": "Welcome to episode seven of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at Wynonie Harris and \"Good Rockin' Tonight\"\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-7-good-rockin-tonight/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nAll the music I talk about here is now in the public domain, and there are a lot of good cheap compilations available. <a href=\"https://amzn.to/2Tn6dHf\">This four-CD set of Wynonie Harris</a> is probably the definitive one. <a href=\"https://amzn.to/2DIF6Sx\">This two-CD set of Roy Brown material</a> has all his big hits, as well as the magnificently disturbing \"Butcher Pete Parts 1 & 2\", my personal favourite of his. Lucky Millinder isn't as well served by compilations, but <a href=\"https://amzn.to/2zfLlt9\">this one</a> has all the songs I talk about here, plus a couple I talked about in<a href=\"https://www.500songs.com/e/episode-5-rosetta-tharpe-and-this-train/\"> the Sister Rosetta Tharpe episode.</a>\n\nThere is only one biography of Wynonie Harris that I know of -- <em>Rock Mr Blues</em> by Tony Collins -- and that is out of print, though you can pick up expensive second-hand copies <a href=\"https://amzn.to/2zfLNYn\">here</a>.\n\nSome of the information on Lucky Millinder comes from <a href=\"https://amzn.to/2TpNpa8\"><em>Shout, Sister, Shout!: The Untold Story of Rock-and-roll Trailblazer Sister Rosetta Tharpe</em></a> by Gayle F Wald, which I also used for the episode on Rosetta Tharpe.\n\nThere are articles on Wynonie Harris, Roy Brown, and Cecil Gant in <a href=\"https://amzn.to/2Kjoi53\"><em>Unsung Heroes of Rock 'n' Roll</em> by Nick Tosches</a>. This book is considered a classic, and will probably be of interest to anyone who finds this episode and the next few interesting, but a word of caution -- it was written in the 70s, and Tosches is clearly of the Lester Bangs/underground/gonzo school of rock journalism, which in modern terms means he's a bit of an edgelord who'll be needlessly offensive to get a laugh. The quotes from Harris I use here are from an article in <em>Tan</em> magazine, which Tosches quotes.\n\n<a href=\"https://amzn.to/2Kc5Db6\"><em>Before Elvis,</em></a> a book I've mentioned many times before, covers all the artists I talk about here.\n\nAnd again, <a href=\"https://archive.org/details/georgeblood\">archive.org's collection of digitised 78 records</a> was very useful.\n\n<strong>Patreon Admin Note</strong>\n\nI have updated the details on my Patreon to better reflect the fact that it backs this podcast as well as my other work, and to offer podcast-related rewards. I'll be doing ebooks for Patreons based on the scripts for the podcasts (the first of those, <em>Savoy Stompers and Kings of Swing</em> should be up in a week or so), and if the Patreon hits $500 a month I'll start doing monthly bonus episodes for backers only. Those episodes won't be needed to follow the story in the main show, but I think they'd be fun to do. To find out more, <a href=\"https://www.patreon.com/join/AndrewHickey\">check out my Patreon</a>.\n\n<strong>Transcript</strong>\n\nThere's a comic called <em>Phonogram</em>, and in it there are people called \"phonomancers\". These are people who aren't musicians, but who can tap into the power of music other people have made, and use it to do magic.\n\nI think \"phonomancers\" is actually a very useful concept for dealing with the real world as well. There are people in the music industry who don't themselves play an instrument or sing or any of the normal musician things, but who manage to get great records made -- records which are their creative work -- by moulding and shaping the work of others. Sometimes they're record producers, sometimes they're managers, sometimes they're DJs or journalists. But there are a lot of people out there who've shaped music enormously without being musicians in the normal sense. Brian Eno, Sam Phillips, Joe Meek, Phil Spector, Malcolm McLaren, Simon Napier-Bell... I'm sure you can add more to the list yourself. People -- almost always men, to be honest -- who have a vision, and a flair for self-publicity, and an idea of how to get musicians to turn that idea into a reality. Men who have the power to take some spotty teenager with a guitar and turn him into a god, at least for the course of a three minute pop song.\n\nAnd there have always been spaces in the music industry for this sort of person. And in the thirties and forties, that place was often in front of the band.\n\nMost of the big band leaders we remember now were themselves excellent musicians -- Count Basie, Duke Ellington, Benny Goodman, you could put those people up against most others on their instruments. They might not have been the best, but they could hold their own.\n\nBut plenty of other band leaders were mediocre musicians or couldn't play at all. Glenn Miller was a competent enough trombone player, but no-one listens to the Glenn Miller band and thinks \"wow, one of those four trombone players is fantastic!\" And other band leaders were much less involved in the music. Kay Kyser -- the most successful bandleader of the period, who had eleven number one records and thirty-five in the top ten -- never played an instrument, didn't write songs, didn't sing. He acted as onstage MC, told jokes, and was the man at the front of the stage. And there were many other bandleaders like that -- people who didn't have any active involvement in the music they were credited with. Bob Crosby, Bing's brother, for example, was a bandleader and would sing on some tracks, but his band performed plenty of instrumentals without him having anything to do with them.\n\nMost non-playing bandleaders would sing, like Bob Crosby, but even then they often did so rarely. And yet some of them had an immense influence on the music world.\n\nBecause a good bandleader's talent wasn't in playing an instrument or writing songs. It was having an idea for a sound, and getting together the right people who could make that sound, and creating a work environment in which they could make that sound well. It was a management role, or an editorial one. But those roles can be important. And one of the most important people to do that job was Lucky Millinder, who we've talked about a couple of times already in passing.\n\nLucky Millinder is a largely forgotten figure now, but he was one of the most important figures in black music in the 1940s. He was a fascinating figure -- one story about how he got his name is that Al Capone was down ten thousand dollars playing dice, Millinder offered to rub the dice for luck, and Capone ended the night fifty thousand dollars up and called him Lucky from then on.\n\n(I think it's more likely that Lucky was short for his birth name, Lucius, but I think the story shows the kind of people Millinder was hanging around with).\n\nHe didn't play an instrument or read music or sing much. What Millinder could definitely do was recognise talent. He'd worked with Bill Doggett, before Doggett went off to join the Ink Spots' backing band, and the trumpet player on his first hit was Dizzy Gillespie, who Millinder had hired after Gillespie had been sacked from Cab Calloway's band after stabbing Calloway in the leg. He had Rosetta Tharpe as his female singer at the beginning of the forties, and Ruth Brown -- who we'll talk about later -- later on.\n\nHe'd started out as the leader of the Mills Blue Rhythm Band, the house band in the Cotton Club, before moving on to lead, as his own band, one of the main bands in residence at the Savoy, along with occasionally touring the chitlin' circuit -- the rather derogatory name for the clubs and theatres that were regular tour stops for almost all major black artists at the time.\n\nSlowly, during the 1940s, Millinder transitioned his band from the kind of swing music that had been popular in the thirties, to the jump band style that was becoming more popular. And if you want to point to one band that you can call the first rhythm and blues band, you probably want to look at Millinder's band, who more than any other band of the era were able to combine all the boogie, jump, and jive sounds with a strong blues feeling and get people dancing. Listen, for example, to \"Savoy\" from 1943:\n[Excerpt: \"Savoy\" by Lucky Millinder]\n\nIn 1944, after Rosetta Tharpe had left his band, Millinder needed a new second singer, to take the occasional lead as Tharpe had. And he found one -- one who later became the most successful rhythm and blues artist of the late 1940s. Wynonie Harris.\n\nHarris was already known as \"Mr. Blues\" when Millinder first saw him playing in Chicago and invited him to join the band. He was primarily a blues shouter, inspired by people like Big Joe Turner and Jimmy Rushing, but he could also perform in a subtler style, close to the jive singing of a Cab Calloway or Louis Jordan.\n\nHarris joined the Millinder band and started performing with them in their residency at the Savoy. Shortly after this, the band went into the studio to record \"Who Threw The Whiskey In The Well?\"\n\n[excerpt \"Who Threw The Whiskey in the Well?\"]\n\nYou'll note that that song has a backbeat. One of the things we talked about right back in episode two was that the combination of the backbeat and the boogie bass is what really makes rock and roll, and we're now getting to the point that that combination was turning up more and more.\n\nThat was recorded in May 1944, almost straight after the end of the musicians union strike, but it wasn't released straight away. Records, at that time, were released on discs made out of shellac, which is a resin made from insect secretions. Unfortunately, the insects in question were native to Vietnam, which was occupied by Japan, and India, which was going through its own problems at the time, so shellac was strictly rationed. There was a new product, vinylite, being made which seemed promising for making records, but that was also used for lifejackets, which were obviously given a higher priority during a war than making records was. So the record wasn't released until nearly a year after it was recorded. And during that time, Wynonie Harris had become a much more important part of Millinder's band, and was starting to believe that maybe he deserved a bit more credit.\n\nHarris, you see, was an absolutely astonishing stage presence. Lots of people who spoke about Elvis Presley in later years said that his performances, hip thrusts and leg shaking and all, were just a watered-down version of what Wynonie Harris had been doing. Harris thought of himself as a big star straight away,\n\nThis belief was made stronger when \"Who Threw The Whiskey In The Well\" was finally released. It became a massive hit, and the only money Harris saw from it was a flat $37.50 session fee. Millinder, on the other hand, was getting the royalties. Harris decided that it was his vocal, not anything to do with the rest of the band, that had made the record a success, and that he could make more money on his own.\n\n(In case you hadn't realised, yet, Wynonie Harris was never known as the most self-effacing of people, and that confidence gave him a huge amount of success on stage, but didn't win him many friends in his personal life).\n\nHarris went solo, and Lucky Millinder replaced him with a trumpet player and singer called Henry Glover. Harris started making records for various small labels.\n\nHis first record as a solo artist was \"Around the Clock Blues\", one of the most influential records ever made:\n\n[Excerpt \"Around the Clock Blues\" by Wynonie Harris]\n\nIf that sounds familiar, maybe it's because you've heard this song by Arthur Crudup that Elvis later covered:\n\n[excerpt of \"So Glad You're Mine\" by Arthur Crudup, showing it's more or less identical]\n\nOr maybe you know \"Reelin' and Rockin'\" by Chuck Berry...\n\n[excerpt of \"Reelin' and Rockin'\" by Chuck Berry, showing it's also more or less identical]\n\nAnd of course there was another song with \"Around the Clock\" in the title, and we'll get to that pretty soon...\n\nThe band on \"Around the Clock\", incidentally, was led by a session drummer called Johnny Otis.\n\nThat record, in fact, is one of the milestones in the development of rock and roll. And yet it's not the most important record Wynonie Harris made in the late 1940s.\n\nHarris recorded for many labels over the next couple of years, including King Records, whose A&R man Ralph Bass we'll also be hearing more about, and Bullet Records, whose founder Jim Bulleit went on to bigger things as well. And just as a brief diversion, we'll take a listen to one of the singles he made around this time, \"Dig this Boogie\":\n\n[excerpt \"Dig This Boogie\", Wynonie Harris]\n\nI played that just because of the pianist on that record -- Herman \"Sonny\" Blount later became rather better known as Sun Ra, and while he didn't have enough to do with rock music for me to do an episode on him, I had to include him here when I could.\n\nWynonie Harris became a big star within the world of rhythm and blues, and that was in large part because of the extremely sexual performances he put on, and the way he aimed them at women, not at the young girls many other singers would target. As he said himself, the reason he was making fifteen hundred dollars a week when most famous singers were getting fifty or seventy-five dollars a night was\n\"The crooners star on the Great White Way and get swamped with Coca-Cola-drinking bobby-soxers and other 'jail bait'. I star in Georgia, Texas, Alabama, Tennessee, and Missouri and get those who have money to buy stronger stuff and my records to play while they drink it. I like to sing to women with meat on their bones and that long green stuff in their pocketbook\".\n\nAnd he certainly made enough of that long green stuff, but he spent it just as fast as he made it. When he got a ten thousand dollar royalty cheque, he bought himself two Cadillacs and hired two chauffeurs, and every night at the end of his show they'd both arrive at the venue and he'd pick which one he was riding home in that night.\n\nNow, having talked about Wynonie Harris for a little bit, let's pause for a moment and talk about one of his fans. Roy Brown was a big fan of Harris, and was a blues singer himself, in something like the same style. Brown had originally been hired as \"a black singer who sounds white\", which is odd because he used a lot of melisma in his vocals, which was normally a characteristic of black singing. But other than that, Brown's main vocal influences when he started were people like Bing Crosby and other crooners, rather than blues music.\n\nHowever, he soon became very fond of jump blues, and started writing songs in the style himself. In particular, one, called \"Good Rockin' Tonight\", he thought might be popular with other audiences, since it always went down so well in his own shows. Indeed, he thought it might be suitable for Wynonie Harris -- and when Harris came to town, Brown suggested the song to him.\n\nAnd Harris wasn't interested. But after Brown moved back to New Orleans from Galveston, Texas, where he'd been performing -- there was a girl, and a club owner, and these things happen and sometimes you have to move --  Brown took his song to Cecil Gant instead. Gant was another blues singer, and if Harris wasn't up for recording the song, maybe Gant would be.\n\nCecil Gant was riding high off his biggest hit, \"I Wonder\", which was a ballad, and he might have seemed a strange choice to record \"Good Rockin' Tonight\", but while Gant's A-sides were ballads, his B-sides were boogie rockers, and very much in the style of Brown's song -- like this one, the B-side to \"I Wonder\"\n\n[excerpt \"Cecil Boogie\" by Cecil Gant]\n\nBut Gant wasn't the best person for Brown to ask to record a song. According to Jim Bulleit, who produced Gant's records, everything Gant recorded was improvised in one take, and he could never remember what it was he'd just done, and could never repeat a song. So Gant wasn't really in the market for other people's songs.\n\nBut he was so impressed by Brown's singing, as well as his song, that he phoned the head of his record company, at 2:30AM, and got Brown to sing down the phone. After hearing the song, the record company head asked to hear it a second time. And then he told Gant \"give him fifty dollars and don't let him out of your sight!\"\n\nAnd so Roy Brown ended up recording his song, on Deluxe Records, and having a minor hit with it:\n\n[excerpt \"Good Rocking Tonight\" by Roy Brown]\n\nWhen you listen back to that, now, it doesn't sound all that innovative at all. In fact it wears its influences on its sleeve so much that it namechecks Sweet Lorraine, Sioux City Sue, Sweet Georgia Brown, and Caldonia, all of whom were characters who'd appeared in other popular R&B songs around that time -- we talked about Caldonia, in fact, in the episode about \"Choo Choo Ch'Boogie\" and Louis Jordan.\n\nIt might also sound odd to anyone who's familiar with later cover versions by Elvis Presley, or by Paul McCartney and others who followed the pattern of Elvis' version. Brown only sings the opening line once, before singing \"I'm gonna hold my baby as tight as I can\". Those other versions restructure the song into a fairly conventional sixteen-bar blues form by adding in a repeat of the first line and a chord change along with it. Roy Brown's original, on the other hand, just holds the first chord, and keeps playing the same riff, for almost the entire verse and chorus -- the chord changes are closer to passing chords than to anything else, and the song ends up having some of the one-chord feel that people like John Lee Hooker had, where the groove is all and harmonic change is thrown out of the window. Even though you'd think, from the melody line, that it was a twelve-bar blues, it's something altogether different.\n\nThis is something that you need to realise -- the more chords something has, in general, the harder it is to dance to. And there will always, always, be a tension between music that's all about the rhythm, and which is there for you to dance to, and music which is all about the melody line, and which treats harmonic interest as an excuse to write more interesting melodies. You can either be Burt Bacharach or you can be Bo Diddley, and the closer you get to one, the further you get from the other. And on that spectrum, \"Good Rockin' Tonight\" is absolutely in the Diddley corner.\n\nBut at the time, this was an absolutely phenomenal record, and it immediately started to take off in the New Orleans market.\n\nAnd then Wynonie Harris realised that maybe he'd made a mistake. Maybe he should have recorded that song after all. And so he did -- cutting his own, almost identical, cover version of Brown's song:\n\n[excerpt from \"Good Rocking Tonight\" by Wynonie Harris]\n\nThere are a few differences between the two, of course. In particular, Harris introduced those \"hoy hoy\" vocals we just heard, which weren't part of Roy Brown's original. That's a line which comes from \"The Honeydripper\", another massively important R&B record.  Harris also included a different instrumental introduction -- playing \"When the Saints Go Marchin' In\" at the start, a song whose melody bears a slight resemblance to Brown's song.\n\nHarris also adds that backbeat again, and it's for that reason that Wynonie Harris' version of the song, not Roy Brown's original, is the one that people call \"the first rock and roll record\".\n\nOther than those changes, Harris' version is a carbon copy of Roy Brown's version. Except, of course, that Wynonie Harris was one of the biggest stars in R&B, while Roy Brown was an unknown who'd just released his first single. That makes a lot of difference, and Harris had the big hit with the song.\n\nAnd \"Good Rocking Tonight\", in Harris' version, became one of those records that was *everywhere*. Roy Brown's version of the song made number thirteen on the R&B charts, and two years later it would re-enter the charts and go to number eleven – but Harris' was a world-changing hit, at least in the R&B market.\n\nHarris' version, in fact, started off a whole chain of soundalikes and cash-ins, records that were trying to be their own version of \"Good Rockin' Tonight\". Harris himself recorded a sequel, \"All She Wants to Do is Rock\", but for the next two years everyone was recording songs with “rock” in the title.  There was Roy Brown's own sequel, \"Rockin' at Midnight\":\n\n[Excerpt \"Rockin' at Midnight\" by Roy Brown]\n\nThere was Cecil Gant's \"We're Gonna Rock\"\n\n[Excerpt]\n\nThere was \"Rock the Joint\" by Jimmy Preston\n\n[Excerpt]\n\nFrom 1948 through about 1951, if you listened to rhythm and blues records at all you couldn't escape this new rock craze. Record after record with \"rock\" in the title, with a boogie woogie bassline, with a backbeat, and with someone singing about how they were going to rock and roll.\n\nThis was, in fact, the real start of the rock and roll music fad. We're still six years away from it coming to the notice of the white mainstream audience, but all the pieces are there together, and while we're still three years away even from the canonical \"first rock and roll record\", Jackie Brenston's \"Rocket 88\", 1948 is when rock and roll first became a cohesive, unified, whole, something that was recognisable and popular, a proper movement in music rather than odd individuals making their own separate music.\n\nOf course, it was still missing some of the ingredients that would later be added. First-wave rock and roll is a music that's based on the piano and horn sections rather than guitars, and it wouldn't be until it merged with hillbilly boogie in the early fifties that the electric guitar started to be an important instrument in it. But... we've talked before and will talk again about how there's no real \"first rock and roll record\", but if you insist on looking for one then \"Good Rocking Tonight\" is as good a candidate as any.\n\nNeither of its creators did especially well from the rock and roll craze they initiated though. Roy Brown got a reputation for being difficult after he went to the musicians' union to try to get some of the money the record company owed him -- in the 1950s, as today, record companies thought it was unreasonable for musicians and singers to actually want them to pay the money that was written in their contract -- and so after a period of success in the late forties and very early fifties he spent a couple of decades unable to get a hit. He eventually started selling encyclopaedias door to door -- with the unique gimmick that when he was in black neighbourhoods he could offer the people whose doors he was knocking on an autographed photo of himself. He sold a lot of encyclopaedias that way, apparently. He continued making the occasional great R&B record, but he made more money from sales. He died in 1981.\n\nWynonie Harris wasn't even that lucky. He basically stopped having hits by 1953, and he more or less gave up performing by the early sixties. The new bands couldn't play his kind of boogie, and in his last few performances, by all accounts, he cut a sad and pitiful figure. He died in 1969 after more or less drinking himself to death.\n\nThe music business is never friendly towards originals, especially black originals. But we're now finally into the rock era. We'll be looking over the next few weeks at a few more \"first rock and roll songs\" as well as at some music that still doesn't quite count as rock but was influential on it, but if you've ever listened to a rock and roll record and enjoyed it, a tiny part of the pleasure you got you owe to Roy Brown and Wynonie Harris.",
  "enclosure": "",
  "itunes:summary": "Welcome to episode seven of A History of Rock Music in Five Hundred Songs. Today we're looking at Wynonie Harris and \"Good Rockin' Tonight\"\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nAll the music I talk about here is now in the public domain, and there are a lot of good cheap compilations available. This four-CD set of Wynonie Harris is probably the definitive one. This two-CD set of Roy Brown material has all his big hits, as well as the magnificently disturbing \"Butcher Pete Parts 1 & 2\", my personal favourite of his. Lucky Millinder isn't as well served by compilations, but this one has all the songs I talk about here, plus a couple I talked about in the Sister Rosetta Tharpe episode.\n\nThere is only one biography of Wynonie Harris that I know of -- Rock Mr Blues by Tony Collins -- and that is out of print, though you can pick up expensive second-hand copies here.\n\nSome of the information on Lucky Millinder comes from Shout, Sister, Shout!: The Untold Story of Rock-and-roll Trailblazer Sister Rosetta Tharpe by Gayle F Wald, which I also used for the episode on Rosetta Tharpe.\n\nThere are articles on Wynonie Harris, Roy Brown, and Cecil Gant in Unsung Heroes of Rock 'n' Roll by Nick Tosches. This book is considered a classic, and will probably be of interest to anyone who finds this episode and the next few interesting, but a word of caution -- it was written in the 70s, and Tosches is clearly of the Lester Bangs/underground/gonzo school of rock journalism, which in modern terms means he's a bit of an edgelord who'll be needlessly offensive to get a laugh. The quotes from Harris I use here are from an article in Tan magazine, which Tosches quotes.\n\nBefore Elvis, a book I've mentioned many times before, covers all the artists I talk about here.\n\nAnd again, archive.org's collection of digitised 78 records was very useful.\n\nPatreon Admin Note\n\nI have updated the details on my Patreon to better reflect the fact that it backs this podcast as well as my other work, and to offer podcast-related rewards. I'll be doing ebooks for Patreons based on the scripts for the podcasts (the first of those, Savoy Stompers and Kings of Swing should be up in a week or so), and if the Patreon hits $500 a month I'll start doing monthly bonus episodes for backers only. Those episodes won't be needed to follow the story in the main show, but I think they'd be fun to do. To find out more, check out my Patreon.\n\nTranscript\n\nThere's a comic called Phonogram, and in it there are people called \"phonomancers\". These are people who aren't musicians, but who can tap into the power of music other people have made, and use it to do magic.\n\nI think \"phonomancers\" is actually a very useful concept for dealing with the real world as well. There are people in the music industry who don't themselves play an instrument or sing or any of the normal musician things, but who manage to get great records made -- records which are their creative work -- by moulding and shaping the work of others. Sometimes they're record producers, sometimes they're managers, sometimes they're DJs or journalists. But there are a lot of people out there who've shaped music enormously without being musicians in the normal sense. Brian Eno, Sam Phillips, Joe Meek, Phil Spector, Malcolm McLaren, Simon Napier-Bell... I'm sure you can add more to the list yourself. People -- almost always men, to be honest -- who have a vision, and a flair for self-publicity, and an idea of how to get musicians to turn that idea into a reality. Men who have the power to take some spotty teenager with a guitar and turn him into a god, at least for the course of a three minute pop song.\n\nAnd there have always been spaces in the music industry for this sort of person. And in the thirties and forties, that place was often in front of the band.\n\nMost of the big band leaders we remember now were themselves excellent musicians -- Count B",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode seven of A History of Rock Music in Five Hundred Songs. Today we're looking at Wynonie Harris and \"Good Rockin' Tonight\"\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nAll the music I talk about here is now in the public domain, and there are a lot of good cheap compilations available. This four-CD set of Wynonie Harris is probably the definitive one. This two-CD set of Roy Brown material has all his big hits, as well as the magnificently disturbing \"Butcher Pete Parts 1 & 2\", my personal favourite of his. Lucky Millinder isn't as well served by compilations, but this one has all the songs I talk about here, plus a couple I talked about in the Sister Rosetta Tharpe episode.\n\nThere is only one biography of Wynonie Harris that I know of -- Rock Mr Blues by Tony Collins -- and that is out of print, though you can pick up expensive second-hand copies here.\n\nSome of the information on Lucky Mil",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}