{
  "title": "Episode 67: &#8220;Johnny B. Goode&#8221;, by Chuck Berry",
  "link": "https://500songs.com/podcast/episode-67-johnny-b-goode-by-chuck-berry/",
  "pubDate": "Mon, 27 Jan 2020 23:40:02 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-67-johnny-b-goode-by-chuck-berry/",
  "description": "Episode sixty-seven of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Johnny B. Goode\" by Chuck Berry, and the decline and fall of both Berry and Alan Freed. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/33505626\">\"Splish Splash\" by Bobby Darin</a>.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created Mixcloud streaming playlists with full versions of all the songs in the episode. Because of the limit on the number of songs by one artist, I have posted them as two playlists -- <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-67a-johnny-b-goode-part-1/\">part one</a>, <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-67b-johnny-b-goode-part-2/\">part two</a>.\n\nI used two main books as reference here:\n\n<a href=\"https://amzn.to/2KW58Gj\"><em>Brown Eyed Handsome Man: The Life and Hard Times of Chuck Berry</em> by Bruce Pegg</a> is a good narrative biography of Berry, which doesn't shy away from the less salubrious aspects of his personality, but is clearly written by an admirer.\n\n<a href=\"https://amzn.to/2vgii6n\"><em>Long Distance Information: Chuck Berry's Recorded Legacy </em>by Fred Rothwell</a> is an extraordinarily researched look at every single recording session of Berry's career up to 2001.\n\nI also used a Chuck Berry website, <a href=\"http://www.crlf.de/ChuckBerry/\">http://www.crlf.de/ChuckBerry/</a> , which contains updates on Rothwell's research.\n\nThe information on the precursors to the \"Johnny B. Goode\" intro comes from <a href=\"https://amzn.to/2NsiM4k\"><em>Before Elvis</em> by Larry Birnbaum. </a>\n\nAnd for information about Freed, I used <a href=\"https://amzn.to/2VLllii\"><em> Big Beat Heat: Alan Freed and the Early Years of Rock & Roll</em></a> by John A. Jackson.\n\nThere are a myriad Chuck Berry compilations available. The one I'd recommend if you don't have a spare couple of hundred quid for the complete works box set is <a href=\"https://amzn.to/2ZpsF5A\">the double-CD <em>Gold</em></a>, which has every major track without much of the filler.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nA brief content warning for this episode – like last week's, this discusses, though not in any great detail, a few crimes of a sexual nature. If that's likely to upset you, please either check the transcript to make sure you'll be OK, or come back next week.\n\nToday we're going to talk about the definitive fifties rock and roll song. “Johnny B. Goode” is so much the epitome of American post-war culture that when NASA sent a record into space, on the Voyager probes in the seventies, it was the only rock and roll song included in the selection of audio, which also included pieces by Bach, Beethoven, Mozart, and Stravinsky, and performances by Louis Armstrong and Blind Willie Johnson, along with folk songs, spoken greetings from world leaders, and so on.\n\nAt the time the golden record was put together, it was criticised for containing any rock and roll at all. Now, that record is further away from Earth than any other object created by a human being.\n\nOn Saturday Night Live, the week the probe was launched, Steve Martin joked that there'd been a message from aliens – “Send more Chuck Berry”.\n\nThat's what an important record \"Johnny B. Goode\" is.\n\n[Excerpt: Chuck Berry, “Johnny B. Goode”]\n\nWhen we last looked at Chuck Berry, he'd just released \"School Day\", which had been his breakout hit into the broader white teenage market that had started to listen to rock and roll.\n\nBerry's career didn't go on a completely upward curve after that point. His next single, \"Oh Baby Doll\", was a comparative flop -- it reached number twelve in the R&B charts, but only number fifty-seven on the pop charts. But the record after that was the start of a three-single run that would consolidate Berry as rock and roll's premier mythologiser.\n\nWhere in May 1956 Berry had sung about \"these rhythm and blues\", this time he was going to use the music's new name, and he was singing \"just let me hear some of that rock and roll music\":\n\n[Excerpt: Chuck Berry, \"Rock and Roll Music\"]\n\nThat put him back in the top ten, and everything seemed to be going wonderfully for him. He was so popular now as a rock and roll star that on one of the late 1957 tours he did, when Buddy Holly and the Crickets were lower down the bill, the Crickets would do \"Roll Over Beethoven\" and \"Brown-Eyed Handsome Man\" as part of their set. Berry had written enough classics by now that other acts on the bill could do the ones he didn't have time for.\n\nWhen he next went back into the studio, it was to cut seven songs.\n\nOne of them, \"Reelin' and Rockin'\", was a slight reworking of the old Wynonie Harris song, \"Round the Clock Blues\". Harris' song, which had also been recorded by Big Joe Turner with Johnny Otis' band, was an inspiration for \"Rock Around the Clock\" among other records:\n\n[Excerpt: Wynonie Harris, \"Round the Clock Blues\"]\n\nBerry's version got rid of some of the more sexual lyrical content -- though that would later come back in live performances of the song -- and played up the song's similarity to \"Rock Around the Clock\", but it's still basically the exact same song that Wynonie Harris had performed. Of course, the copyright is in Chuck Berry's name -- for all that he and his publishers would be very eager to sue anyone who might come too close to one of Berry's songs, he had no compunction about taking all the credit for a song someone else had written.\n\n[Excerpt: Chuck Berry, “Reelin' and Rockin'”]\n\nYou might notice that the piano style on that track is very different from some of Berry's earlier recordings.\n\nNow, there are two possible explanations for this, because I've seen two different pianists credited for these sessions. Some sources credit Lafayette Leake with playing the piano here, and that might be enough to explain the difference in style, but I'm going with the other sources, which credit Johnnie Johnson, Berry's regular player, as playing on the session.\n\nIf it is, though, he's playing in a different style. This is because of the popularity of Jerry Lee Lewis, who had risen to fame since Berry's last session.\n\nLewis used to use a simple technique called \"ripping\" when playing the piano, in which you just slide your fingers across the keys as fast as possible. He does it pretty much constantly in his solos, as you can hear in this:\n\n[Excerpt: Jerry Lee Lewis, “Great Balls of Fire”, piano solo]\n\nLeonard Chess had heard that sound, and become convinced that that was the main reason that Lewis' records were so successful, so he insisted on Johnnie Johnson doing that on Berry's new records.\n\nJohnson didn't like the sound, which he considered \"all flash and no technique\", but Chess insisted -- to the extent that when they were rehearsing the tracks, Chess would walk over and rip his hand down the keys himself, to show Johnson what he wanted. Johnson eventually went along with it, though he said he \"'bout tore my thumbnail off\" getting it done.\n\n[Excerpt: Chuck Berry, “Reelin' and Rockin'”]\n\nHe later acknowledged that Chess had a point, though -- simple as it was, it did make the records more exciting, and it was something that the kids clearly liked.\n\nAnd something else that the kids liked was another song recorded at the same session -- this time about the kids themselves:\n\n[Excerpt: Chuck Berry, \"Sweet Little Sixteen\"]\n\n\"Sweet Little Sixteen\" was one of the first songs about the experience of being a rock and roll fan. There had been earlier records about just dancing to rock and roll music, of course -- things like \"Drugstore Rock & Roll\" or \"Rip it Up\" -- but this was about fandom, and about the experience of following musicians.\n\nIt's not completely about that, sadly -- it's the teen girl fan filtered through the male gaze, and so it's also about how \"everybody wants to dance with\" this sixteen-year-old girl, and about her \"tight dresses and lipstick\" -- but where the song gains its power is in the verse sections where the girl becomes the viewpoint character, and we hear about how excited she is to go to the show, and about her collections of autographs and photos. However flawed it is, it's one of the best evocations of the experience of fandom as a hobby -- not just liking the music, but having the experience of fandom be a major part of your life.\n\nOne of the most notable things about \"Sweet Little Sixteen\" is the way that Berry uses the song to namecheck American Bandstand, which was fast becoming the most important rock and roll TV show around. While in the first chorus he sings about how they'll be rocking in Boston and Pittsburgh, PA, in the subsequent choruses he changes that to \"on Bandstand\" and \"in Philadelphia PA\", which is where American Bandstand was broadcast from. It's a sign that Dick Clark was becoming more important than Berry's mentor, Alan Freed.\n\nA week after the session for \"Reelin' and Rockin'\" and \"Sweet Little Sixteen\", came another session for what would become Berry's most well-known song, and one that remains in the repertoire of almost every bar band in the world.\n\nIt's instantly recognisable right from the start. The introduction to \"Johnny B. Goode\" is one of the most well-known guitar parts in history:\n\n[Excerpt: Chuck Berry, \"Johnny B. Goode\"]\n\nBut that guitar part has a long history -- it's original to Chuck Berry, but at the same time it's based on a lot of earlier examples.\n\nBerry took the basic idea for that line from Carl Hogan, Louis Jordan's guitarist, who played this as the intro to Jordan's \"Ain't That Just Like a Woman\":\n\n[Excerpt: Louis Jordan, \"Ain't That Just Like a Woman\"]\n\nBut Hogan was only the latest in a long line of people who had played essentially that identical line. The first recording we have of that riff dates back to 1918, and a recording by Wilbur Sweatman's Jazz Orchestra. Sweatman was a friend and colleague of Scott Joplin, and his band was one of the very first black jazz groups to record at all. And on their song \"Bluin' the Blues\", you hear this:\n\n[Excerpt: Wilbur Sweatman's Jazz Orchestra, \"Bluin' the Blues\"]\n\nWe hear it in Blind Lemon Jefferson's \"Got the Blues\", in 1926:\n\n[Excerpt: Blind Lemon Jefferson, \"Got the Blues\"]\n\nIn Blind Blake's \"Too Tight\", also from 1926:\n\n[Excerpt: Blind Blake, \"Too Tight\"]\n\nthen in records by Cow Cow Davenport, Andy Kirk, and Count Basie, before it turns up in the Louis Jordan record. But there is a crucial difference between what Carl Hogan played and what Chuck Berry played. Listen again to Hogan's playing:\n\n[Excerpt: Louis Jordan, \"Ain't That Just Like a Woman\"]\n\nand now to Berry:\n\n[Excerpt: Chuck Berry, \"Johnny B. Goode\"]\n\nThe crucial change Berry makes there is that most of the time he's playing the solo line on two strings instead of one, creating a thicker sound, with parallel harmonies, rather than just the simple melody line. This was something that Berry learned from the great blues guitarist T-Bone Walker:\n\n[Excerpt: T-Bone Walker, \"Shufflin' the Blues\"]\n\nBerry took Walker's playing style, and combined it with Hogan's note choices, and that simple change makes all the difference. It transmutes the part that Hogan had played from just a standard riff you find in dozens of old jazz records, a standard part of any musician's toolkit, into a specific intro to a specific song. When, six years later, Carl Wilson of the Beach Boys played this as the intro to \"Fun, Fun, Fun\":\n\n[Excerpt: The Beach Boys, \"Fun Fun Fun\"]\n\nAbsolutely no-one listening thought \"Oh, he's riffing off 'Texas Shout' by Cow Cow Davenport\" -- everyone instantly thought \"Oh, that's the intro to 'Johnny B. Goode'\". Berry had taken a standard piece of every musician's toolkit, and by putting a very slight twist on it had made everyone listening hear it differently, so now it was identified solely with him.\n\nThe lyric to Johnny B. Goode is more original than the music, but even there we can trace its origins. Berry always talked about how the original idea for the lyric was as a message to Johnnie Johnson, saying \"Johnnie, be good\", stop drinking so much -- a wake-up call to his friend and colleague. But that quickly changed, and the song became more about Berry himself, or an idealised version of Berry, perhaps how he would want people to see him -- something that was even more explicit in the original version of the lyric, where rather than sing \"a country boy\", he sang \"a coloured boy\".\n\nBut there's another sign that Berry was talking about himself, and that's in the very title itself. Goode is spelled \"G-o-o-d-e\", with an \"e\" on the end -- and Berry's childhood home was at 2520 Goode avenue, with an E.\n\nThere's another possible origin as well -- the poet Langston Hughes had written a very widely circulated series of newspaper columns, which Berry would have encountered in his teenage years and early twenties, about a character named Jesse B. Simple.\n\n(And in an interesting note, in 1934 Hughes wrote a story about racial injustice called \"Berry\", about a boy named Berry who would, among other things, tell children stories and sing them songs, and Hughes signed the dedication in the book that story was in \"Berry\" rather than with his own name.)\n\nYou can point to every element of \"Johnny B. Goode\" and say \"well, this came from there, and this came from there\", but still you're no closer to identifying why Johnny B. Goode works as well as it does. it's the combination of all these elements in a way that they'd never been put together before that is Berry's genius, and is why Berry is pretty much universally regarded as an innovator, not just as an imitator.\n\n\"Johnny B. Goode\" was also the title song for what turned out to be Alan Freed's final film -- a film called Go, Johnny, Go! which also featured Eddie Cochran, the Moonglows, and Ritchie Valens.\n\n[Excerpt: Berry and Freed dialogue from Go, Johnny, Go!]\n\nThat film came out in 1959, and had Berry as Freed's co-star, appearing with Freed as himself in almost every scene. It was the last gasp of rock and roll cultural relevance for almost everyone involved. By the time the film had come out, Valens was already dead, and within a little over eighteen months after its release, Cochran was also dead, Freed was disgraced, and Berry was in prison.\n\nIn the last couple of episodes, I've mentioned a tour that Chuck Berry and Jerry Lee Lewis headlined in 1958, just after “Johnny B. Goode” came out, with Alan Freed as the MC. What I didn't mention until now is that as well as the tension between Chuck and Jerry Lee, that tour ended up spelling the end of Freed's career.\n\nFreed was already on the downturn in his career -- rock and roll was moving from being a music made largely by black musicians to one dominated by white people, and to make matters worse the major labels had finally got a handle on it and started churning out dozens of prepackaged teen idols, most of them called Bobby. Freed didn't have the connections with the major labels, or the understanding of the new manufactured pop, that he did with the R&B records from labels like Chess.\n\nBut it was the show in Boston on this tour that led to Freed's downfall. The early show, which had been headlined by Lewis, had had the audience dancing, and the police were not at all impressed with this. They'd forced Alan Freed to make the audience sit down, and Lewis had had to play his set to an audience who were seated and squirming, unable to get up and dance to his recent big hits like “Great Balls of Fire”:\n\n[Excerpt: Jerry Lee Lewis, “Great Balls of Fire”]\n\nThen came the late show, which Berry was headlining. The same thing started to happen -- the kids in the audience got up to dance, and the police made Alan Freed make them sit down. But then, when the audience had quietened down, while Berry was standing there on stage, the police refused to dim the house lights and let the musicians carry on playing. So Freed got back on stage and said \"It looks like the Boston police don't want you to have a good time.\"\n\nThe show continued with the lights on, but the audience got annoyed -- so much so that Chuck Berry finished the show from behind the drummer, in case the audience attacked. But the police got more annoyed.\n\nThey got so annoyed, in fact, that they decided to simply claim that every single crime reported to them that night had been inspired by the show.\n\nNobody now thinks that the New York Times reports which said there were multiple stabbings, fifteen people hospitalised, and multiple rapes, are actually accurate reports of anything caused by the show. But at the time, everyone believed it. Boston decided to ban rock and roll concerts altogether, as a result of the show, and while the tour continued through a couple more dates, most of the remaining tour dates got cancelled.\n\nOddly, going through this adversity seems to have brought Berry and Jerry Lee Lewis together. While they'd been fighting each other for almost the entire tour, after this point they became quite close friends, and would speak warmly about each other.\n\nThings didn't end so happily for Alan Freed.\n\nFreed had been having some problems with his radio station for a little while. He was difficult to work with, and they particularly disliked that he had started doing his broadcasts from home, rather than from the studio. When he'd been hired, the station was losing money, and he'd been a gamble. Now, they were in profit, and they didn't need to take risks, and they'd been considering not renewing his contract when it came up in six months. Now that this had happened, they took the opportunity to use the morals clause in Freed's contract to fire him, although he was allowed to present it as a resignation instead of a firing.\n\nFreed would manage to get another radio job, but not one with anything like the same prominence. He would, within a couple of years, become the designated industry fall guy for the practice of payola. This is something that we've talked about before -- record labels would pay DJs to play their records. Sometimes it was in the form of adding their name to the writing credits, as was the case for Freed with records like \"Maybellene\" and \"Sincerely\" – and you can tell how much Freed contributed to those songs by hearing his own attempts at making records:\n\n[Excerpt: Alan Freed and his Rock and Roll Band, “Rock and Roll Boogie”, Rock Rock Rock version]\n\nSometimes a promoter would just slip a DJ fifty dollars when handing over a promotional copy of the record. Sometimes, the DJ would be hired to announce a show by the act whose record was to be promoted. There were a lot of different methods, some of them more blatant than others, but it was a common practice.\n\nEvery DJ and TV presenter took part in this, pretty much -- Dick Clark certainly did -- and while no-one other than the DJs liked the practice, the small labels that built rock and roll, labels like Sun or Chess or Atlantic, all saw it as a way that they could equalise things a little bit. The major labels all had an inbuilt advantage, and would get their records played on the radio no matter what -- this was a way that the smaller labels could be heard.\n\nBut precisely because it levelled the playing field somewhat, the larger record labels didn't like it, and by this point the major labels were becoming more interested in rock and roll. And to protect that interest, they promoted a campaign against payola.\n\nFreed, as the most prominent DJ in the country, and someone who did his fair share of taking bribes, was essentially chosen as the scapegoat for this, once he lost his job at WINS. By the end of 1959 he lost his job with the station he moved to, WABC, once the payola scandal became headline news, and he spent the next few years moving from smaller stations to yet smaller ones, not staying anywhere very long. He died in 1965, of illnesses caused by his alcoholism. He was only forty-three.\n\n[Excerpt: Alan Freed sign-off, “This is not goodbye, it's just goodnight”]\n\nAnd here we get to the downfall of Chuck Berry himself. It's an unfortunate fact of chronology that I have to deal with this the week after dealing with Jerry Lee Lewis' own underage sex scandal -- well, a fact of both chronology and a terrible society that sees the bodies of young girls as something to which powerful men are entitled, anyway.\n\nChuck Berry had been on a tour of the Southwest, when in Texas he had met up with a fourteen-year-old sex worker, who had accompanied him on the rest of the tour. He'd promised her a job working at his nightclub in St. Louis, and when he fired her shortly after she started there, she went to the police.\n\nLike Lewis, Berry has been more or less forgiven by the consensus narrative of rock history. There is slightly more justification for doing so in Berry's case than in Lewis', because the Mann Act, the law under which he was charged and convicted, was a law that was created specifically to punish black men -- indeed, its official title was The White Slave Traffic Act. Given the way that other rock and roll artists seem to have had carte blanche to abuse young girls, the fact that a black man was about the only one, certainly for many decades, to spend time in prison for this, is more than a little unjust.\n\nBut the fact remains, a man in his thirties had had sexual relations with a fourteen-year-old girl. And it's not like this was an isolated incident -- he would later famously settle a class-action suit brought against him by a large number of women he had videotaped on the toilet without their permission.\n\nSo while Berry had an entirely fair complaint that the prosecution was motivated by race -- and his prison sentence was reduced in large part because the judge made some extremely racist remarks -- it's still a fact that what he did was wrong.\n\nNow, I'm not going to spend much more time on this with Berry -- not as much as I did with Jerry Lee Lewis last week -- and that's because as I said in the beginning of the series, this is not a podcast about the horrible crimes men have committed against women.\n\nSo why bring it up at all?\n\nWell, there's a myth that Berry's career was completely wrecked by his arrest. This simply isn't true.\n\nIt's true that \"Johnny B. Goode\" was Berry's last top ten hit for quite a few years, and he only had one more top twenty hit in the fifties. But the thing is, his singles had had a very inconsistent chart history before that. He'd released eleven singles up to that point, and only five of them had made the top ten on the pop charts. Classics like \"Thirty Days\", \"Too Much Monkey Business\", \"Brown-Eyed Handsome Man\" and \"You Can't Catch Me\" had totally failed to hit the pop charts at all.\n\nBerry was arrested in December 1959, and between trials and appeals, he didn't end up going to jail until 1961. \"Johnny B. Goode\" came out in March 1958. That means that for almost two years *before* the arrest, Berry was, at best, charting in the lower reaches of the charts.\n\nThe fact is, there's a simple reason why Berry didn't chart very much in the late fifties and early sixties. Well, there are two reasons. The first is that public taste had moved on, as it does every few years. There are very few singles artists -- and all artists in the fifties were singles artists -- who can survive a major change in the public's taste.\n\nThe other reason, as he would later admit himself, is that the material he recorded in the few years after \"Johnny B. Goode\" wasn't his best. There were some good songs -- things like \"Carol\", \"Little Queenie\", and \"I've Got to Find My Baby\" -- but even those weren't Berry at his absolute peak. And the majority of the material he put out during that time was stuff like \"Anthony Boy\" and \"Too Pooped to Pop\", which very few of even Berry's most ardent fans will tell you are worth listening to.\n\nThere was one exception -- during that time, he put out what may be the best song he ever wrote, \"Memphis, Tennessee\":\n\n[Excerpt: Chuck Berry, \"Memphis, Tennessee\"]\n\nWhile it's a travesty that that record didn't chart, in retrospect it's easy to see why it didn't. Berry's audience were, for the most part, teenagers. No matter how good a song it was, \"Memphis Tennessee\" was about a man wanting to regain contact with his six-year-old daughter after he's split up with her mother. That's something that would have far more relevance to people of Berry's own age group than to the people who had been, a year or so earlier, wanting to dance with sweet little sixteen, and wanting to hear some of that rock and roll music.\n\nAs odd as it is to say, Berry's eighteen months in jail may have done him some good as a commercial prospect. The first three singles he released in 1964, right after getting out of prison, were all bigger hits than he'd had since summer 1958 -- \"Nadine\" made number 23, \"You Never Can Tell\" made number fourteen, and \"No Particular Place to Go\", a rewrite of \"School Day\", with new, funnier, lyrics about sexual frustration, went to number ten:\n\n[Excerpt: Chuck Berry, \"No Particular Place to Go\"]\n\nThose songs were better than anything he'd released for several years previously, and it seemed that Berry might be on his way back to the top, but it was a false dawn. Berry's studio work slid back into mediocrity with occasional flashes of his old brilliance, and his only hit after this point was in the seventies, when he had his only number one with a novelty song by Dave Bartholomew, \"My Ding-a-Ling\", which if you've not heard it is about as juvenile as it sounds.\n\nIn the late seventies, Berry essentially retired from making new music, choosing instead to spend the best part of forty years touring the world with just his guitar, playing with whatever local pickup band the promoter could scrape together, and often not even letting them know in advance what the next song was going to be -- he assumed that everyone knew all of his songs, and he was, by and large, correct in that assumption. He was, by all accounts, an extremely bitter man.\n\nHe did, though, work on one final album, just called \"Chuck\", which was announced as part of the celebrations for his ninetieth birthday, but wasn't released until shortly after his death. He died, aged ninety, in 2017, and the obituaries concentrated on his music rather than his crimes against women. John Lennon once said \"if you tried to give rock and roll another name, it would be Chuck Berry\", and for both better and worse, that's probably true.",
  "itunes:subtitle": "Episode sixty-seven of A History of Rock Music in Five Hundred Songs looks at Johnny B. Goode by Chuck Berry, and the decline and fall of both Berry and Alan Freed. Click the full post to read liner notes, links to more information, and a transcript of t",
  "itunes:keywords": "Alan Freed,Blind Blake,Blind Lemon Jefferson,Buddy Holly,Chess Records,Chuck Berry,Jerry Lee Lewis,Johnnie Johnson,Leonard Chess,Louis Jordan,payola,racism,sex scandals,T-Bone Walker,The Beach Boys,Wynonie Harris",
  "itunes:episodeType": "full",
  "itunes:episode": 67,
  "content:encoded": "Episode sixty-seven of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Johnny B. Goode\" by Chuck Berry, and the decline and fall of both Berry and Alan Freed. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/33505626\">\"Splish Splash\" by Bobby Darin</a>.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created Mixcloud streaming playlists with full versions of all the songs in the episode. Because of the limit on the number of songs by one artist, I have posted them as two playlists -- <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-67a-johnny-b-goode-part-1/\">part one</a>, <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-67b-johnny-b-goode-part-2/\">part two</a>.\n\nI used two main books as reference here:\n\n<a href=\"https://amzn.to/2KW58Gj\"><em>Brown Eyed Handsome Man: The Life and Hard Times of Chuck Berry</em> by Bruce Pegg</a> is a good narrative biography of Berry, which doesn't shy away from the less salubrious aspects of his personality, but is clearly written by an admirer.\n\n<a href=\"https://amzn.to/2vgii6n\"><em>Long Distance Information: Chuck Berry's Recorded Legacy </em>by Fred Rothwell</a> is an extraordinarily researched look at every single recording session of Berry's career up to 2001.\n\nI also used a Chuck Berry website, <a href=\"http://www.crlf.de/ChuckBerry/\">http://www.crlf.de/ChuckBerry/</a> , which contains updates on Rothwell's research.\n\nThe information on the precursors to the \"Johnny B. Goode\" intro comes from <a href=\"https://amzn.to/2NsiM4k\"><em>Before Elvis</em> by Larry Birnbaum. </a>\n\nAnd for information about Freed, I used <a href=\"https://amzn.to/2VLllii\"><em> Big Beat Heat: Alan Freed and the Early Years of Rock & Roll</em></a> by John A. Jackson.\n\nThere are a myriad Chuck Berry compilations available. The one I'd recommend if you don't have a spare couple of hundred quid for the complete works box set is <a href=\"https://amzn.to/2ZpsF5A\">the double-CD <em>Gold</em></a>, which has every major track without much of the filler.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nA brief content warning for this episode – like last week's, this discusses, though not in any great detail, a few crimes of a sexual nature. If that's likely to upset you, please either check the transcript to make sure you'll be OK, or come back next week.\n\nToday we're going to talk about the definitive fifties rock and roll song. “Johnny B. Goode” is so much the epitome of American post-war culture that when NASA sent a record into space, on the Voyager probes in the seventies, it was the only rock and roll song included in the selection of audio, which also included pieces by Bach, Beethoven, Mozart, and Stravinsky, and performances by Louis Armstrong and Blind Willie Johnson, along with folk songs, spoken greetings from world leaders, and so on.\n\nAt the time the golden record was put together, it was criticised for containing any rock and roll at all. Now, that record is further away from Earth than any other object created by a human being.\n\nOn Saturday Night Live, the week the probe was launched, Steve Martin joked that there'd been a message from aliens – “Send more Chuck Berry”.\n\nThat's what an important record \"Johnny B. Goode\" is.\n\n[Excerpt: Chuck Berry, “Johnny B. Goode”]\n\nWhen we last looked at Chuck Berry, he'd just released \"School Day\", which had been his breakout hit into the broader white teenage market that had started to listen to rock and roll.\n\nBerry's career didn't go on a completely upward curve after that point. His next single, \"Oh Baby Doll\", was a comparative flop -- it reached number twelve in the R&B charts, but only number fifty-seven on the pop charts. But the record after that was the start of a three-single run that would consolidate Berry as rock and roll's premier mythologiser.\n\nWhere in May 1956 Berry had sung about \"these rhythm and blues\", this time he was going to use the music's new name, and he was singing \"just let me hear some of that rock and roll music\":\n\n[Excerpt: Chuck Berry, \"Rock and Roll Music\"]\n\nThat put him back in the top ten, and everything seemed to be going wonderfully for him. He was so popular now as a rock and roll star that on one of the late 1957 tours he did, when Buddy Holly and the Crickets were lower down the bill, the Crickets would do \"Roll Over Beethoven\" and \"Brown-Eyed Handsome Man\" as part of their set. Berry had written enough classics by now that other acts on the bill could do the ones he didn't have time for.\n\nWhen he next went back into the studio, it was to cut seven songs.\n\nOne of them, \"Reelin' and Rockin'\", was a slight reworking of the old Wynonie Harris song, \"Round the Clock Blues\". Harris' song, which had also been recorded by Big Joe Turner with Johnny Otis' band, was an inspiration for \"Rock Around the Clock\" among other records:\n\n[Excerpt: Wynonie Harris, \"Round the Clock Blues\"]\n\nBerry's version got rid of some of the more sexual lyrical content -- though that would later come back in live performances of the song -- and played up the song's similarity to \"Rock Around the Clock\", but it's still basically the exact same song that Wynonie Harris had performed. Of course, the copyright is in Chuck Berry's name -- for all that he and his publishers would be very eager to sue anyone who might come too close to one of Berry's songs, he had no compunction about taking all the credit for a song someone else had written.\n\n[Excerpt: Chuck Berry, “Reelin' and Rockin'”]\n\nYou might notice that the piano style on that track is very different from some of Berry's earlier recordings.\n\nNow, there are two possible explanations for this, because I've seen two different pianists credited for these sessions. Some sources credit Lafayette Leake with playing the piano here, and that might be enough to explain the difference in style, but I'm going with the other sources, which credit Johnnie Johnson, Berry's regular player, as playing on the session.\n\nIf it is, though, he's playing in a different style. This is because of the popularity of Jerry Lee Lewis, who had risen to fame since Berry's last session.\n\nLewis used to use a simple technique called \"ripping\" when playing the piano, in which you just slide your fingers across the keys as fast as possible. He does it pretty much constantly in his solos, as you can hear in this:\n\n[Excerpt: Jerry Lee Lewis, “Great Balls of Fire”, piano solo]\n\nLeonard Chess had heard that sound, and become convinced that that was the main reason that Lewis' records were so successful, so he insisted on Johnnie Johnson doing that on Berry's new records.\n\nJohnson didn't like the sound, which he considered \"all flash and no technique\", but Chess insisted -- to the extent that when they were rehearsing the tracks, Chess would walk over and rip his hand down the keys himself, to show Johnson what he wanted. Johnson eventually went along with it, though he said he \"'bout tore my thumbnail off\" getting it done.\n\n[Excerpt: Chuck Berry, “Reelin' and Rockin'”]\n\nHe later acknowledged that Chess had a point, though -- simple as it was, it did make the records more exciting, and it was something that the kids clearly liked.\n\nAnd something else that the kids liked was another song recorded at the same session -- this time about the kids themselves:\n\n[Excerpt: Chuck Berry, \"Sweet Little Sixteen\"]\n\n\"Sweet Little Sixteen\" was one of the first songs about the experience of being a rock and roll fan. There had been earlier records about just dancing to rock and roll music, of course -- things like \"Drugstore Rock & Roll\" or \"Rip it Up\" -- but this was about fandom, and about the experience of following musicians.\n\nIt's not completely about that, sadly -- it's the teen girl fan filtered through the male gaze, and so it's also about how \"everybody wants to dance with\" this sixteen-year-old girl, and about her \"tight dresses and lipstick\" -- but where the song gains its power is in the verse sections where the girl becomes the viewpoint character, and we hear about how excited she is to go to the show, and about her collections of autographs and photos. However flawed it is, it's one of the best evocations of the experience of fandom as a hobby -- not just liking the music, but having the experience of fandom be a major part of your life.\n\nOne of the most notable things about \"Sweet Little Sixteen\" is the way that Berry uses the song to namecheck American Bandstand, which was fast becoming the most important rock and roll TV show around. While in the first chorus he sings about how they'll be rocking in Boston and Pittsburgh, PA, in the subsequent choruses he changes that to \"on Bandstand\" and \"in Philadelphia PA\", which is where American Bandstand was broadcast from. It's a sign that Dick Clark was becoming more important than Berry's mentor, Alan Freed.\n\nA week after the session for \"Reelin' and Rockin'\" and \"Sweet Little Sixteen\", came another session for what would become Berry's most well-known song, and one that remains in the repertoire of almost every bar band in the world.\n\nIt's instantly recognisable right from the start. The introduction to \"Johnny B. Goode\" is one of the most well-known guitar parts in history:\n\n[Excerpt: Chuck Berry, \"Johnny B. Goode\"]\n\nBut that guitar part has a long history -- it's original to Chuck Berry, but at the same time it's based on a lot of earlier examples.\n\nBerry took the basic idea for that line from Carl Hogan, Louis Jordan's guitarist, who played this as the intro to Jordan's \"Ain't That Just Like a Woman\":\n\n[Excerpt: Louis Jordan, \"Ain't That Just Like a Woman\"]\n\nBut Hogan was only the latest in a long line of people who had played essentially that identical line. The first recording we have of that riff dates back to 1918, and a recording by Wilbur Sweatman's Jazz Orchestra. Sweatman was a friend and colleague of Scott Joplin, and his band was one of the very first black jazz groups to record at all. And on their song \"Bluin' the Blues\", you hear this:\n\n[Excerpt: Wilbur Sweatman's Jazz Orchestra, \"Bluin' the Blues\"]\n\nWe hear it in Blind Lemon Jefferson's \"Got the Blues\", in 1926:\n\n[Excerpt: Blind Lemon Jefferson, \"Got the Blues\"]\n\nIn Blind Blake's \"Too Tight\", also from 1926:\n\n[Excerpt: Blind Blake, \"Too Tight\"]\n\nthen in records by Cow Cow Davenport, Andy Kirk, and Count Basie, before it turns up in the Louis Jordan record. But there is a crucial difference between what Carl Hogan played and what Chuck Berry played. Listen again to Hogan's playing:\n\n[Excerpt: Louis Jordan, \"Ain't That Just Like a Woman\"]\n\nand now to Berry:\n\n[Excerpt: Chuck Berry, \"Johnny B. Goode\"]\n\nThe crucial change Berry makes there is that most of the time he's playing the solo line on two strings instead of one, creating a thicker sound, with parallel harmonies, rather than just the simple melody line. This was something that Berry learned from the great blues guitarist T-Bone Walker:\n\n[Excerpt: T-Bone Walker, \"Shufflin' the Blues\"]\n\nBerry took Walker's playing style, and combined it with Hogan's note choices, and that simple change makes all the difference. It transmutes the part that Hogan had played from just a standard riff you find in dozens of old jazz records, a standard part of any musician's toolkit, into a specific intro to a specific song. When, six years later, Carl Wilson of the Beach Boys played this as the intro to \"Fun, Fun, Fun\":\n\n[Excerpt: The Beach Boys, \"Fun Fun Fun\"]\n\nAbsolutely no-one listening thought \"Oh, he's riffing off 'Texas Shout' by Cow Cow Davenport\" -- everyone instantly thought \"Oh, that's the intro to 'Johnny B. Goode'\". Berry had taken a standard piece of every musician's toolkit, and by putting a very slight twist on it had made everyone listening hear it differently, so now it was identified solely with him.\n\nThe lyric to Johnny B. Goode is more original than the music, but even there we can trace its origins. Berry always talked about how the original idea for the lyric was as a message to Johnnie Johnson, saying \"Johnnie, be good\", stop drinking so much -- a wake-up call to his friend and colleague. But that quickly changed, and the song became more about Berry himself, or an idealised version of Berry, perhaps how he would want people to see him -- something that was even more explicit in the original version of the lyric, where rather than sing \"a country boy\", he sang \"a coloured boy\".\n\nBut there's another sign that Berry was talking about himself, and that's in the very title itself. Goode is spelled \"G-o-o-d-e\", with an \"e\" on the end -- and Berry's childhood home was at 2520 Goode avenue, with an E.\n\nThere's another possible origin as well -- the poet Langston Hughes had written a very widely circulated series of newspaper columns, which Berry would have encountered in his teenage years and early twenties, about a character named Jesse B. Simple.\n\n(And in an interesting note, in 1934 Hughes wrote a story about racial injustice called \"Berry\", about a boy named Berry who would, among other things, tell children stories and sing them songs, and Hughes signed the dedication in the book that story was in \"Berry\" rather than with his own name.)\n\nYou can point to every element of \"Johnny B. Goode\" and say \"well, this came from there, and this came from there\", but still you're no closer to identifying why Johnny B. Goode works as well as it does. it's the combination of all these elements in a way that they'd never been put together before that is Berry's genius, and is why Berry is pretty much universally regarded as an innovator, not just as an imitator.\n\n\"Johnny B. Goode\" was also the title song for what turned out to be Alan Freed's final film -- a film called Go, Johnny, Go! which also featured Eddie Cochran, the Moonglows, and Ritchie Valens.\n\n[Excerpt: Berry and Freed dialogue from Go, Johnny, Go!]\n\nThat film came out in 1959, and had Berry as Freed's co-star, appearing with Freed as himself in almost every scene. It was the last gasp of rock and roll cultural relevance for almost everyone involved. By the time the film had come out, Valens was already dead, and within a little over eighteen months after its release, Cochran was also dead, Freed was disgraced, and Berry was in prison.\n\nIn the last couple of episodes, I've mentioned a tour that Chuck Berry and Jerry Lee Lewis headlined in 1958, just after “Johnny B. Goode” came out, with Alan Freed as the MC. What I didn't mention until now is that as well as the tension between Chuck and Jerry Lee, that tour ended up spelling the end of Freed's career.\n\nFreed was already on the downturn in his career -- rock and roll was moving from being a music made largely by black musicians to one dominated by white people, and to make matters worse the major labels had finally got a handle on it and started churning out dozens of prepackaged teen idols, most of them called Bobby. Freed didn't have the connections with the major labels, or the understanding of the new manufactured pop, that he did with the R&B records from labels like Chess.\n\nBut it was the show in Boston on this tour that led to Freed's downfall. The early show, which had been headlined by Lewis, had had the audience dancing, and the police were not at all impressed with this. They'd forced Alan Freed to make the audience sit down, and Lewis had had to play his set to an audience who were seated and squirming, unable to get up and dance to his recent big hits like “Great Balls of Fire”:\n\n[Excerpt: Jerry Lee Lewis, “Great Balls of Fire”]\n\nThen came the late show, which Berry was headlining. The same thing started to happen -- the kids in the audience got up to dance, and the police made Alan Freed make them sit down. But then, when the audience had quietened down, while Berry was standing there on stage, the police refused to dim the house lights and let the musicians carry on playing. So Freed got back on stage and said \"It looks like the Boston police don't want you to have a good time.\"\n\nThe show continued with the lights on, but the audience got annoyed -- so much so that Chuck Berry finished the show from behind the drummer, in case the audience attacked. But the police got more annoyed.\n\nThey got so annoyed, in fact, that they decided to simply claim that every single crime reported to them that night had been inspired by the show.\n\nNobody now thinks that the New York Times reports which said there were multiple stabbings, fifteen people hospitalised, and multiple rapes, are actually accurate reports of anything caused by the show. But at the time, everyone believed it. Boston decided to ban rock and roll concerts altogether, as a result of the show, and while the tour continued through a couple more dates, most of the remaining tour dates got cancelled.\n\nOddly, going through this adversity seems to have brought Berry and Jerry Lee Lewis together. While they'd been fighting each other for almost the entire tour, after this point they became quite close friends, and would speak warmly about each other.\n\nThings didn't end so happily for Alan Freed.\n\nFreed had been having some problems with his radio station for a little while. He was difficult to work with, and they particularly disliked that he had started doing his broadcasts from home, rather than from the studio. When he'd been hired, the station was losing money, and he'd been a gamble. Now, they were in profit, and they didn't need to take risks, and they'd been considering not renewing his contract when it came up in six months. Now that this had happened, they took the opportunity to use the morals clause in Freed's contract to fire him, although he was allowed to present it as a resignation instead of a firing.\n\nFreed would manage to get another radio job, but not one with anything like the same prominence. He would, within a couple of years, become the designated industry fall guy for the practice of payola. This is something that we've talked about before -- record labels would pay DJs to play their records. Sometimes it was in the form of adding their name to the writing credits, as was the case for Freed with records like \"Maybellene\" and \"Sincerely\" – and you can tell how much Freed contributed to those songs by hearing his own attempts at making records:\n\n[Excerpt: Alan Freed and his Rock and Roll Band, “Rock and Roll Boogie”, Rock Rock Rock version]\n\nSometimes a promoter would just slip a DJ fifty dollars when handing over a promotional copy of the record. Sometimes, the DJ would be hired to announce a show by the act whose record was to be promoted. There were a lot of different methods, some of them more blatant than others, but it was a common practice.\n\nEvery DJ and TV presenter took part in this, pretty much -- Dick Clark certainly did -- and while no-one other than the DJs liked the practice, the small labels that built rock and roll, labels like Sun or Chess or Atlantic, all saw it as a way that they could equalise things a little bit. The major labels all had an inbuilt advantage, and would get their records played on the radio no matter what -- this was a way that the smaller labels could be heard.\n\nBut precisely because it levelled the playing field somewhat, the larger record labels didn't like it, and by this point the major labels were becoming more interested in rock and roll. And to protect that interest, they promoted a campaign against payola.\n\nFreed, as the most prominent DJ in the country, and someone who did his fair share of taking bribes, was essentially chosen as the scapegoat for this, once he lost his job at WINS. By the end of 1959 he lost his job with the station he moved to, WABC, once the payola scandal became headline news, and he spent the next few years moving from smaller stations to yet smaller ones, not staying anywhere very long. He died in 1965, of illnesses caused by his alcoholism. He was only forty-three.\n\n[Excerpt: Alan Freed sign-off, “This is not goodbye, it's just goodnight”]\n\nAnd here we get to the downfall of Chuck Berry himself. It's an unfortunate fact of chronology that I have to deal with this the week after dealing with Jerry Lee Lewis' own underage sex scandal -- well, a fact of both chronology and a terrible society that sees the bodies of young girls as something to which powerful men are entitled, anyway.\n\nChuck Berry had been on a tour of the Southwest, when in Texas he had met up with a fourteen-year-old sex worker, who had accompanied him on the rest of the tour. He'd promised her a job working at his nightclub in St. Louis, and when he fired her shortly after she started there, she went to the police.\n\nLike Lewis, Berry has been more or less forgiven by the consensus narrative of rock history. There is slightly more justification for doing so in Berry's case than in Lewis', because the Mann Act, the law under which he was charged and convicted, was a law that was created specifically to punish black men -- indeed, its official title was The White Slave Traffic Act. Given the way that other rock and roll artists seem to have had carte blanche to abuse young girls, the fact that a black man was about the only one, certainly for many decades, to spend time in prison for this, is more than a little unjust.\n\nBut the fact remains, a man in his thirties had had sexual relations with a fourteen-year-old girl. And it's not like this was an isolated incident -- he would later famously settle a class-action suit brought against him by a large number of women he had videotaped on the toilet without their permission.\n\nSo while Berry had an entirely fair complaint that the prosecution was motivated by race -- and his prison sentence was reduced in large part because the judge made some extremely racist remarks -- it's still a fact that what he did was wrong.\n\nNow, I'm not going to spend much more time on this with Berry -- not as much as I did with Jerry Lee Lewis last week -- and that's because as I said in the beginning of the series, this is not a podcast about the horrible crimes men have committed against women.\n\nSo why bring it up at all?\n\nWell, there's a myth that Berry's career was completely wrecked by his arrest. This simply isn't true.\n\nIt's true that \"Johnny B. Goode\" was Berry's last top ten hit for quite a few years, and he only had one more top twenty hit in the fifties. But the thing is, his singles had had a very inconsistent chart history before that. He'd released eleven singles up to that point, and only five of them had made the top ten on the pop charts. Classics like \"Thirty Days\", \"Too Much Monkey Business\", \"Brown-Eyed Handsome Man\" and \"You Can't Catch Me\" had totally failed to hit the pop charts at all.\n\nBerry was arrested in December 1959, and between trials and appeals, he didn't end up going to jail until 1961. \"Johnny B. Goode\" came out in March 1958. That means that for almost two years *before* the arrest, Berry was, at best, charting in the lower reaches of the charts.\n\nThe fact is, there's a simple reason why Berry didn't chart very much in the late fifties and early sixties. Well, there are two reasons. The first is that public taste had moved on, as it does every few years. There are very few singles artists -- and all artists in the fifties were singles artists -- who can survive a major change in the public's taste.\n\nThe other reason, as he would later admit himself, is that the material he recorded in the few years after \"Johnny B. Goode\" wasn't his best. There were some good songs -- things like \"Carol\", \"Little Queenie\", and \"I've Got to Find My Baby\" -- but even those weren't Berry at his absolute peak. And the majority of the material he put out during that time was stuff like \"Anthony Boy\" and \"Too Pooped to Pop\", which very few of even Berry's most ardent fans will tell you are worth listening to.\n\nThere was one exception -- during that time, he put out what may be the best song he ever wrote, \"Memphis, Tennessee\":\n\n[Excerpt: Chuck Berry, \"Memphis, Tennessee\"]\n\nWhile it's a travesty that that record didn't chart, in retrospect it's easy to see why it didn't. Berry's audience were, for the most part, teenagers. No matter how good a song it was, \"Memphis Tennessee\" was about a man wanting to regain contact with his six-year-old daughter after he's split up with her mother. That's something that would have far more relevance to people of Berry's own age group than to the people who had been, a year or so earlier, wanting to dance with sweet little sixteen, and wanting to hear some of that rock and roll music.\n\nAs odd as it is to say, Berry's eighteen months in jail may have done him some good as a commercial prospect. The first three singles he released in 1964, right after getting out of prison, were all bigger hits than he'd had since summer 1958 -- \"Nadine\" made number 23, \"You Never Can Tell\" made number fourteen, and \"No Particular Place to Go\", a rewrite of \"School Day\", with new, funnier, lyrics about sexual frustration, went to number ten:\n\n[Excerpt: Chuck Berry, \"No Particular Place to Go\"]\n\nThose songs were better than anything he'd released for several years previously, and it seemed that Berry might be on his way back to the top, but it was a false dawn. Berry's studio work slid back into mediocrity with occasional flashes of his old brilliance, and his only hit after this point was in the seventies, when he had his only number one with a novelty song by Dave Bartholomew, \"My Ding-a-Ling\", which if you've not heard it is about as juvenile as it sounds.\n\nIn the late seventies, Berry essentially retired from making new music, choosing instead to spend the best part of forty years touring the world with just his guitar, playing with whatever local pickup band the promoter could scrape together, and often not even letting them know in advance what the next song was going to be -- he assumed that everyone knew all of his songs, and he was, by and large, correct in that assumption. He was, by all accounts, an extremely bitter man.\n\nHe did, though, work on one final album, just called \"Chuck\", which was announced as part of the celebrations for his ninetieth birthday, but wasn't released until shortly after his death. He died, aged ninety, in 2017, and the obituaries concentrated on his music rather than his crimes against women. John Lennon once said \"if you tried to give rock and roll another name, it would be Chuck Berry\", and for both better and worse, that's probably true.",
  "enclosure": "",
  "itunes:summary": "Episode sixty-seven of A History of Rock Music in Five Hundred Songs looks at \"Johnny B. Goode\" by Chuck Berry, and the decline and fall of both Berry and Alan Freed. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Splish Splash\" by Bobby Darin.\n\n\n\nResources\n\nAs always, I've created Mixcloud streaming playlists with full versions of all the songs in the episode. Because of the limit on the number of songs by one artist, I have posted them as two playlists -- part one, part two.\n\nI used two main books as reference here:\n\nBrown Eyed Handsome Man: The Life and Hard Times of Chuck Berry by Bruce Pegg is a good narrative biography of Berry, which doesn't shy away from the less salubrious aspects of his personality, but is clearly written by an admirer.\n\nLong Distance Information: Chuck Berry's Recorded Legacy by Fred Rothwell is an extraordinarily researched look at every single recording session of Berry's career up to 2001.\n\nI also used a Chuck Berry website, http://www.crlf.de/ChuckBerry/ , which contains updates on Rothwell's research.\n\nThe information on the precursors to the \"Johnny B. Goode\" intro comes from Before Elvis by Larry Birnbaum. \n\nAnd for information about Freed, I used  Big Beat Heat: Alan Freed and the Early Years of Rock & Roll by John A. Jackson.\n\nThere are a myriad Chuck Berry compilations available. The one I'd recommend if you don't have a spare couple of hundred quid for the complete works box set is the double-CD Gold, which has every major track without much of the filler.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nA brief content warning for this episode – like last week's, this discusses, though not in any great detail, a few crimes of a sexual nature. If that's likely to upset you, please either check the transcript to make sure you'll be OK, or come back next week.\n\nToday we're going to talk about the definitive fifties rock and roll song. “Johnny B. Goode” is so much the epitome of American post-war culture that when NASA sent a record into space, on the Voyager probes in the seventies, it was the only rock and roll song included in the selection of audio, which also included pieces by Bach, Beethoven, Mozart, and Stravinsky, and performances by Louis Armstrong and Blind Willie Johnson, along with folk songs, spoken greetings from world leaders, and so on.\n\nAt the time the golden record was put together, it was criticised for containing any rock and roll at all. Now, that record is further away from Earth than any other object created by a human being.\n\nOn Saturday Night Live, the week the probe was launched, Steve Martin joked that there'd been a message from aliens – “Send more Chuck Berry”.\n\nThat's what an important record \"Johnny B. Goode\" is.\n\n[Excerpt: Chuck Berry, “Johnny B. Goode”]\n\nWhen we last looked at Chuck Berry, he'd just released \"School Day\", which had been his breakout hit into the broader white teenage market that had started to listen to rock and roll.\n\nBerry's career didn't go on a completely upward curve after that point. His next single, \"Oh Baby Doll\", was a comparative flop -- it reached number twelve in the R&B charts, but only number fifty-seven on the pop charts. But the record after that was the start of a three-single run that would consolidate Berry as rock and roll's premier mythologiser.\n\nWhere in May 1956 Berry had sung about \"these rhythm and blues\", this time he was going to use the music's new name, and he was singing \"just let me hear some of that rock and roll music\":\n\n[Excerpt: Chuck Berry, \"Rock and Roll Music\"]\n\nThat put him back in the top ten, and everything seemed to be going wonderfully for him. He was so popular now as a rock and roll star that on one of the late 1957 tours he did, when Buddy Holly and the Crickets were lower down the bill, the Crickets",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode sixty-seven of A History of Rock Music in Five Hundred Songs looks at \"Johnny B. Goode\" by Chuck Berry, and the decline and fall of both Berry and Alan Freed. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Splish Splash\" by Bobby Darin.\n\n\n\nResources\n\nAs always, I've created Mixcloud streaming playlists with full versions of all the songs in the episode. Because of the limit on the number of songs by one artist, I have posted them as two playlists -- part one, part two.\n\nI used two main books as reference here:\n\nBrown Eyed Handsome Man: The Life and Hard Times of Chuck Berry by Bruce Pegg is a good narrative biography of Berry, which doesn't shy away from the less salubrious aspects of his personality, but is clearly written by an admirer.\n\nLong Distance Information: Chuck Berry's Recorded Legacy by Fred Rothwell is an extraordinarily researched look at eve",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}