{
  "id": "tag:blogger.com,1999:blog-6959495683334200101.post-8005979909916902417",
  "published": "2019-02-28T10:05:00.000-08:00",
  "updated": "2019-02-28T10:07:32.806-08:00",
  "title": "More updates on our actions related to the safety of minors on YouTube",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\">Dear Creators,<br /><br />We know that many of you have been closely following the actions we’re taking to protect young people on YouTube and are as deeply concerned as we are that we get this right. We want to update you on some additional changes we’re making, particularly in regards to comments, building on the efforts <a href=\"https://support.google.com/youtube/thread/1805616\" target=\"_blank\">we shared last week.</a><br /><br /><br />We recognize that comments are a core part of the YouTube experience and how you connect with and grow your audience. At the same time, the important steps we’re sharing today are critical for keeping young people safe.  Thank you for your understanding and feedback as we continue our work to protect the YouTube community.<br /><br /><br /><br />Below is a summary of the main steps we’ve taken to improve child safety on YouTube since our <a href=\"https://support.google.com/youtube/thread/1805616\" target=\"_blank\">update</a> last Friday:<br /><br /><br /><br /><h3 style=\"text-align: left;\">Disabling comments on videos featuring minors</h3><br /><br /><br />Over the past week, we disabled comments from tens of millions of videos that could be subject to predatory behavior. These efforts are focused on videos featuring young minors and we will continue to identify videos at risk over the next few months. Over the next few months, we will be broadening this action to suspend comments on videos featuring young minors and videos featuring older minors that could be at risk of attracting predatory behavior.<br /><br /><br /><br />A small number of creators will be able to keep comments enabled on these types of videos. These channels will be required to actively moderate their comments, beyond just using our moderation tools, and demonstrate a low risk of predatory behavior.  We will work with them directly and our goal is to grow this number over time as our ability to catch violative comments continues to improve. <br /><br /><br /><br /><h3 style=\"text-align: left;\">Launching a new comments classifier</h3><br /><br /><br />While we have been removing hundreds of millions of comments for violating our policies, we had been working on an even more effective classifier, that will identify and remove predatory comments. This classifier does not affect the monetization of your video. We accelerated its launch and now have a new comments classifier in place that is more sweeping in scope, and will detect and remove 2X more individual comments.<br /><br /><br /><br /><h3 style=\"text-align: left;\">Taking action on creators who cause egregious harm to the community</h3><br /><br /><br />No form of content that endangers minors is acceptable on YouTube, which is why we have terminated certain channels that attempt to endanger children in any way. Videos encouraging harmful and dangerous challenges targeting any audience are also clearly against our policies. We will continue to take action when creators violate our policies in ways that blatantly harm the broader user and creator community. Please continue to <a href=\"https://support.google.com/youtube/answer/2802027\" target=\"_blank\">flag</a> these to us.<br /><br /><br /><br />Thank you for your understanding as we make these changes,<br /><br /><i>TeamYouTube</i></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube Creators",
    "uri": "http://www.blogger.com/profile/00450486760991148551",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}