{
  "title": "Measles vaccination rate by USA state and relation to mean outbreak size",
  "link": "",
  "published": "2015-02-25T13:40:00-08:00",
  "updated": "2015-02-25T13:40:00-08:00",
  "author": {
    "name": "Damien RJ"
  },
  "id": "tag:efavdb.com,2015-02-25:/vaccination-rates",
  "summary": "<p>In this post, we provide a quick overview of the data and science of measles spread. Making use of python (code provided) we extract from a <span class=\"caps\">CDC</span> data set the 2012 youth vaccination rate for each <span class=\"caps\">USA</span> state &#8212; see figure below. To aid in the interpretation of this data, we …</p>",
  "content": "<p>In this post, we provide a quick overview of the data and science of measles spread. Making use of python (code provided) we extract from a <span class=\"caps\">CDC</span> data set the 2012 youth vaccination rate for each <span class=\"caps\">USA</span> state &#8212; see figure below. To aid in the interpretation of this data, we also review and describe the results of a generalized &#8220;<span class=\"caps\">SIR</span>&#8221; model for disease spread. The model &#8212; analyzed in <a href=\"http://http://efavdb.github.io/math-of-measles\">our last post</a> &#8212; predicts that measles outbreaks are supported only if the vaccination rate is below 94%. At higher rates, infection spread is suppressed, and outbreaks do not occur. As seen in the figure, the majority of the states sit just below this critical number, and so are predicted to support youth&nbsp;outbreaks.</p>\n<iframe width=\"600\" height=\"533\" frameborder=\"0\" src=\"//plot.ly/~damienrj/179.embed\"></iframe>\n\n<p>Measles vaccination rate by <span class=\"caps\">USA</span> state for youths under 36 months in age, 2012. Dashed line at 94% is estimated critical vaccination rate needed to suppress outbreaks. The mean <span class=\"caps\">USA</span> youth rate is about&nbsp;91%.</p>\n<h4><strong>Introduction: History of measles in&nbsp;America</strong></h4>\n<p>Measles is a highly-contagious, serious illness estimated to currently be contracted by about 20 million individuals each year, globally. Just prior to the arrival of the first measles vaccine in 1963 (developed by <a href=\"http://en.wikipedia.org/wiki/John_Franklin_Enders\">John Enders</a> and his colleagues) approximately 500,000 Americans contracted the disease annually, approximately 50,000 of which required hospitalization &#8212; a rate of 1/10. Among these individuals, approximately 500 would die each year, equating to a 1/1000 mortality rate. As yet, there is <a href=\"http://www.mayoclinic.org/diseases-conditions/measles/basics/treatment/con-20019675\">no treatment</a> available to combat the measles virus, once contracted. Consequently, similar hospitalization and mortality rates <a href=\"http://en.wikipedia.org/wiki/Measles#Epidemiology\">continue to hold today</a>. Sadly, the mortality rate among the malnourished can be as high as&nbsp;1/10.</p>\n<iframe width=\"600\" height=\"533\" frameborder=\"0\" src=\"//plot.ly/~damienrj/262.embed\"></iframe>\n\n<p>Here, the vaccination rate shown is for youths, under 48 months in first brach (up to 1985), and under 36 months in the latter&nbsp;branch.</p>\n<p>Contemporary contraction rates in the <span class=\"caps\">USA</span> are now extremely low, on the order of <a href=\"http://www.cdc.gov/measles/cases-outbreaks.html\">50-500 per year</a>. This is likely a consequence of the strong local adoption of measles vaccinations, with 91% of young children here now receiving the vaccine prior to their third birthday. The most recent large-scale <span class=\"caps\">USA</span> outbreak of the disease happened between the years of 1989 and 1991, when the vaccination rates of children were significantly lower, hovering around 70%. This outbreak centered within poorer, urban areas where the vaccination rates were <a href=\"http://www.cdc.gov/vaccines/pubs/pinkbook/meas.html\">substantially lower</a> than the national average. A summary plot of <span class=\"caps\">USA</span> contraction counts and youth vaccination rates by year is shown above &#8212; the two curves are highly anti-correlated. Note that this plot is <strong>click and drag zoomable</strong>, which is useful for setting the scale appropriately for recent years. Data <a href=\"http://jid.oxfordjournals.org/content/189/Supplement_1/S17.long\">source 1</a>, <a href=\"http://www.cdc.gov/mmwr/preview/mmwrhtml/mm6316a4.htm\">source 2</a>; no youth vaccination rate data available between 1985-1991. Full-population averages have been in the 90&#8217;s <a href=\"http://www.nature.com/news/measles-by-the-numbers-a-race-to-eradication-1.16897\">for some decades</a>, likely due to elementary school matriculation&nbsp;requirements.</p>\n<h4><strong>Modeling disease&nbsp;spread</strong></h4>\n<p>The striking <span class=\"caps\">USA</span> historical data suggests a very strong relationship between the vaccination rate within a community and the frequency and size of the measles outbreaks that it supports. In fact, simple models for disease spread suggest a phase-transition-like (exhibiting abrupt changes) outbreak size dependence on vaccination rates. This is illustrated below, where we plot the predicted measles contraction rate against a population&#8217;s vaccination rate &#8212; as returned by a generalized <a href=\"http://en.wikipedia.org/wiki/Epidemic_model#The_SIR_model\"><span class=\"caps\">SIR</span> model for disease spread</a>: Notice that in the far left side of this plot, the model predicts that disease spread is completely suppressed. However, below a critical vaccination rate (the stated 94% mark &#8212; a number consistent with <a href=\"http://jid.oxfordjournals.org/content/196/10/1433.full\">published estimates for measles</a>), outbreaks begin to be supported, growing in size with further decrease of the vaccination&nbsp;rate.</p>\n<iframe width=\"600\" height=\"533\" frameborder=\"0\" src=\"//plot.ly/~damienrj/275.embed\"></iframe>\n\n<p>The generalized <span class=\"caps\">SIR</span> model predicts that a measles outbreak size changes in a phase-transition-like manner with vaccination rate. Further, at about 85% vaccination, the outbreak population fraction and the unvaccinated fraction curves cross. At this point, the outbreak captures nearly all unvaccinated and also a finite fraction of the vaccinated, who begin to become infected due to frequent encounters with&nbsp;disease.</p>\n<p>A detailed study of the <span class=\"caps\">SIR</span> model&#8217;s <a href=\"http://efavdb.github.io/math-of-measles\">solution</a> is not necessary to understand why disease spread exhibits a phase-transition-like form. Qualitatively, this behavior is a consequence of a simple balance of rates: If the rate at which a disease spreads is greater than the rate at which the ill recover, outbreaks grow and expand. However, if patients recover more quickly than they can spread the disease, outbreak expansion is suppressed, and the number of infected individuals will decrease with time. The balance of these competing effects is tuned by the frequency of vaccination, which directly affects the first of these rates &#8212; that at which the disease can spread. Because measles is <a href=\"http://www.cdc.gov/measles/about/transmission.html\">highly contagious</a>, its balance point occurs around the relatively-high 94% mark seen in the figure &#8212; this is the vaccination rate needed to have the average rate of disease spread just equal to the average rate of recovery. An info-graphic illustrating these points can be found <a href=\"http://www.vaccines.gov/basics/protection/\">here</a>.</p>\n<h4><strong>Model implications for <span class=\"caps\">USA</span>&nbsp;youth</strong></h4>\n<p>At the start of this post, we presented <span class=\"caps\">CDC</span> estimates for the mean, by-state vaccination rates within the <span class=\"caps\">USA</span>. Now that we have reviewed the results of the <span class=\"caps\">SIR</span> model, we can begin to appreciate the significance of this data more deeply. First &#8212; as we noted above &#8212; we see that many states have youth vaccination rates that sit just below the critical 94% level, and thus on average should support small measles outbreaks. The graph of the previous section also allows us to estimate the mean size of a measles outbreak (once sparked) within any community below the critical vaccination rate: The further a state is from the 94% mark, the larger its mean outbreak size should be. Although all states are doing reasonably well, when considered on <a href=\"http://www.npr.org/blogs/goatsandsoda/2015/02/06/384068229/measles-vaccination-rates-tanzania-does-better-than-u-s\">a global scale</a>, it is important to realize that many sit in a region of the plot where the response to a decrease in vaccination rate is most dramatic &#8212; the curve&#8217;s slope is largest just to the right of 94% vaccination. This means, e.g., that a 1% decrease in vaccination rate will result in a greater than 1% increase in the size of the average outbreak supported within that state. This observation is modestly worrisome, as the risk of contraction for all individuals &#8212; even those vaccinated &#8212; is always proportional to the number of cases present in any&nbsp;outbreak.</p>\n<p><strong>Important&nbsp;caveats:</strong></p>\n<ul>\n<li>Vaccination rates fluctuate between cities, neighborhoods, etc. This means that simple state averages may not accurately characterize your local community&#8217;s vaccination rate &#8212; the quantity most relevant to your personal infection risk. See, for instance, the plot for California by county shown <a href=\"http://www.huffingtonpost.com/2015/02/03/measles-us-facts_n_6581922.html\">here</a>.</li>\n<li>Our results are based on a descriptive, but simple model. They are intended only to provide one with a qualitative picture of the forces governing measles spread. Detailed, peer-reviewed treatments (this is just a blog&#8230;) can be found in the&nbsp;literature.</li>\n<li>Consult a licensed physician for qualified information on vaccines, measles&nbsp;etc.</li>\n</ul>\n<h4><strong>Discussion</strong></h4>\n<p>Interestingly, <a href=\"http://en.wikipedia.org/wiki/Measles#Cause\">humans are the only known carriers</a> of the measles virus. Consequently, with <a href=\"http://www.nature.com/news/measles-by-the-numbers-a-race-to-eradication-1.16897\">growing global vaccination rates</a>, it may one day soon be possible to totally extinguish the disease. Looking back on the historical <span class=\"caps\">USA</span> data helps one realize that this would be a truly remarkable accomplishment! In fact, were the <span class=\"caps\">USA</span> in isolation, our current vaccination rates would likely be sufficient to bring this about. However, we are not, and sporadic outbreaks continue to occur here, ignited through international travel of infected individuals. These outbreaks can occur because our youth vaccination rates are below the critical 94% level needed to suppress&nbsp;them.</p>\n<p>The science of disease spread is very interesting. For those with a mathematical background, we suggest taking a look at <a href=\"http://http://efavdb.github.io/math-of-measles\">our prior post</a>, where we solve the <span class=\"caps\">SIR</span> model analytically. Many additional insights into disease spread &#8212; not covered here &#8212; can be gleaned through the study of this model. Likewise, those with a programming background can play with the code that we provide below to sort through the <span class=\"caps\">CDC</span>&#8217;s data sets in different ways. For instance, one can easily alter this code to view how vaccination rates vary by socio-economic background, rather than by state, etc. One can also use the same procedures to sort through many other interesting data sets provided by the <span class=\"caps\">CDC</span> and&nbsp;others.</p>\n<h4><strong>Methods: Wrangling the <span class=\"caps\">CDC</span> measles data&nbsp;sets</strong></h4>\n<h5><strong>Grabbing and loading&nbsp;data</strong></h5>\n<p>In this section, we outline our numerical analysis of the <span class=\"caps\">CDC</span> measles vaccination rate data set. To follow along, you must first download the files.  Current data can be found <a href=\"http://www.cdc.gov/nchs/nis/data_files.htm\">here</a>, and data corresponding to years before 2009 <a href=\"http://www.cdc.gov/nchs/nis/data_files_09_prior.htm\">here</a>.  Three files are needed.  The <a href=\"ftp://ftp.cdc.gov/pub/Health_Statistics/NCHS/Datasets/nis/nispuf12.dat\">Dataset file</a>, the <a href=\"ftp://ftp.cdc.gov/pub/Health_Statistics/NCHS/Dataset_Documentation/NIS/NISPUF12_CODEBOOK.PDF\">Codebook</a> that explains how to read the dataset files, and the <a href=\"ftp://ftp.cdc.gov/pub/Health_Statistics/NCHS/Dataset_Documentation/NIS/NISPUF12_DUG.PDF\">Data User’s Guide</a> which provides details about the data, including methodology and statistics&nbsp;descriptions.</p>\n<p>In our analysis, we will make use of a few python packages.  In particular, we will use <a href=\"http://pandas.pydata.org/\">Pandas</a> to construct high performance data structures, called DataFrames. These are easy to use, and they allow for fast, straightforward data manipulation &#8212; both helpful features for data wrangling. We will utilize the groupby DataFrame method, which enables one to easily segment data according to values along different feature directions. To illustrate, we will split our data by state name.  We will then use the <a href=\"https://plot.ly/\">Plot.ly</a> package to generate the interactive plots included&nbsp;above.</p>\n<p>To get a feel for the <span class=\"caps\">CDC</span> data, a good first step is to look at the data in a text editor.  Doing this, we quickly notice multiple rows of characters having no vernacular significance.  The codebook allows one to interpret these characters.  It also explains that each row corresponds to a different child surveyed, and that each row has a fixed number of entries, many corresponding to different vaccines. We will read these rows in one at a time &#8212; making use of a for loop &#8212; to save on memory. As each line is processed, we keep only what we need &#8212; here that info relevant to the <span class=\"caps\">MMR</span>&nbsp;vaccine.</p>\n<div class=\"highlight\"><pre><span></span><span class=\"kn\">import</span> <span class=\"nn\">pandas</span> <span class=\"k\">as</span> <span class=\"nn\">pd</span>\n<span class=\"kn\">import</span> <span class=\"nn\">numpy</span> <span class=\"k\">as</span> <span class=\"nn\">np</span>\n<span class=\"kn\">import</span> <span class=\"nn\">matplotlib.pyplot</span> <span class=\"k\">as</span> <span class=\"nn\">plt</span>\n<span class=\"kn\">import</span> <span class=\"nn\">plotly.plotly</span> <span class=\"k\">as</span> <span class=\"nn\">py</span>\n<span class=\"kn\">from</span> <span class=\"nn\">plotly.graph_objs</span> <span class=\"kn\">import</span> <span class=\"o\">*</span>\n<span class=\"n\">py</span><span class=\"o\">.</span><span class=\"n\">sign_in</span><span class=\"p\">(</span><span class=\"s1\">&#39;username&#39;</span><span class=\"p\">,</span> <span class=\"s1\">&#39;password&#39;</span><span class=\"p\">)</span>\n\n<span class=\"c1\">#Create some empty lists to store the data</span>\n<span class=\"n\">child_ID</span> <span class=\"o\">=</span> <span class=\"p\">[]</span>\n<span class=\"n\">house_ID</span> <span class=\"o\">=</span> <span class=\"p\">[]</span>\n<span class=\"n\">patient_data</span> <span class=\"o\">=</span> <span class=\"p\">[]</span>\n<span class=\"n\">measles</span> <span class=\"o\">=</span> <span class=\"p\">[]</span>\n<span class=\"n\">state</span> <span class=\"o\">=</span> <span class=\"p\">[]</span>\n<span class=\"n\">stratum</span> <span class=\"o\">=</span> <span class=\"p\">[]</span>\n<span class=\"n\">weights</span> <span class=\"o\">=</span> <span class=\"p\">[]</span> <span class=\"c1\">#No virgin islands</span>\n<span class=\"n\">weights_v</span> <span class=\"o\">=</span> <span class=\"p\">[]</span>\n<span class=\"n\">mmr</span> <span class=\"o\">=</span> <span class=\"p\">[]</span>\n\n<span class=\"c1\">#First we need to read in the data file, and parse the data</span>\n<span class=\"c1\">#using the datasheet</span>\n<span class=\"k\">with</span> <span class=\"nb\">open</span><span class=\"p\">(</span><span class=\"s1\">&#39;nispuf12.dat&#39;</span><span class=\"p\">,</span> <span class=\"s1\">&#39;r&#39;</span><span class=\"p\">)</span> <span class=\"k\">as</span> <span class=\"n\">f</span><span class=\"p\">:</span>\n    <span class=\"k\">for</span> <span class=\"n\">line</span> <span class=\"ow\">in</span> <span class=\"n\">f</span><span class=\"p\">:</span>\n        <span class=\"n\">child_ID</span><span class=\"o\">.</span><span class=\"n\">append</span><span class=\"p\">(</span><span class=\"n\">line</span><span class=\"p\">[</span><span class=\"mi\">0</span><span class=\"p\">:</span><span class=\"mi\">6</span><span class=\"p\">])</span>\n        <span class=\"n\">house_ID</span><span class=\"o\">.</span><span class=\"n\">append</span><span class=\"p\">(</span><span class=\"n\">line</span><span class=\"p\">[</span><span class=\"mi\">6</span><span class=\"p\">:</span><span class=\"mi\">11</span><span class=\"p\">])</span>\n        <span class=\"n\">patient_data</span><span class=\"o\">.</span><span class=\"n\">append</span><span class=\"p\">(</span><span class=\"n\">line</span><span class=\"p\">[</span><span class=\"mi\">11</span><span class=\"p\">:</span><span class=\"mi\">12</span><span class=\"p\">])</span>\n        <span class=\"n\">measles</span><span class=\"o\">.</span><span class=\"n\">append</span><span class=\"p\">(</span><span class=\"n\">line</span><span class=\"p\">[</span><span class=\"mi\">260</span><span class=\"p\">:</span><span class=\"mi\">261</span><span class=\"p\">])</span>\n        <span class=\"n\">state</span><span class=\"o\">.</span><span class=\"n\">append</span><span class=\"p\">(</span><span class=\"n\">line</span><span class=\"p\">[</span><span class=\"mi\">181</span><span class=\"p\">:</span><span class=\"mi\">183</span><span class=\"p\">])</span>\n        <span class=\"n\">stratum</span><span class=\"o\">.</span><span class=\"n\">append</span><span class=\"p\">(</span><span class=\"n\">line</span><span class=\"p\">[</span><span class=\"mi\">88</span><span class=\"p\">:</span><span class=\"mi\">92</span><span class=\"p\">])</span>\n        <span class=\"n\">weights</span><span class=\"o\">.</span><span class=\"n\">append</span><span class=\"p\">(</span><span class=\"n\">line</span><span class=\"p\">[</span><span class=\"mi\">50</span><span class=\"p\">:</span><span class=\"mi\">69</span><span class=\"p\">])</span>\n        <span class=\"n\">weights_v</span><span class=\"o\">.</span><span class=\"n\">append</span><span class=\"p\">(</span><span class=\"n\">line</span><span class=\"p\">[</span><span class=\"mi\">31</span><span class=\"p\">:</span><span class=\"mi\">50</span><span class=\"p\">])</span>\n        <span class=\"n\">mmr</span><span class=\"o\">.</span><span class=\"n\">append</span><span class=\"p\">(</span><span class=\"n\">line</span><span class=\"p\">[</span><span class=\"mi\">261</span><span class=\"p\">:</span><span class=\"mi\">262</span><span class=\"p\">])</span>\n</pre></div>\n\n\n<h5><strong>Cleaning&nbsp;data</strong></h5>\n<p>Now that everything is parsed and loaded into arrays, we will insert our data into a dictionary with key given by the column header.  We then convert this into a DataFrame. To streamline the process, we will also replace all the missing values with a <span class=\"caps\">NAN</span>, and also convert all relevant entries from string to number format.  We will also replace the stateID numbers with their written names.  Lastly, we will remove all the incomplete patient&nbsp;files.</p>\n<div class=\"highlight\"><pre><span></span><span class=\"c1\">#Create a dataframe in pandas for data manipulation</span>\n<span class=\"n\">d</span><span class=\"o\">=</span> <span class=\"p\">{</span><span class=\"s1\">&#39;child&#39;</span><span class=\"p\">:</span><span class=\"n\">child_ID</span><span class=\"p\">,</span> <span class=\"s1\">&#39;house&#39;</span><span class=\"p\">:</span><span class=\"n\">house_ID</span><span class=\"p\">,</span> <span class=\"s1\">&#39;state&#39;</span><span class=\"p\">:</span><span class=\"n\">state</span><span class=\"p\">,</span>\n    <span class=\"s1\">&#39;patient_data&#39;</span><span class=\"p\">:</span><span class=\"n\">patient_data</span><span class=\"p\">,</span> <span class=\"s1\">&#39;measles&#39;</span><span class=\"p\">:</span><span class=\"n\">measles</span><span class=\"p\">,</span>\n    <span class=\"s1\">&#39;MMR&#39;</span><span class=\"p\">:</span><span class=\"n\">mmr</span><span class=\"p\">,</span> <span class=\"s1\">&#39;stratum&#39;</span><span class=\"p\">:</span><span class=\"n\">stratum</span><span class=\"p\">,</span> <span class=\"s1\">&#39;weights&#39;</span><span class=\"p\">:</span><span class=\"n\">weights</span><span class=\"p\">,</span>\n    <span class=\"s1\">&#39;weights_v&#39;</span><span class=\"p\">:</span><span class=\"n\">weights_v</span><span class=\"p\">}</span>\n<span class=\"n\">data</span> <span class=\"o\">=</span> <span class=\"n\">pd</span><span class=\"o\">.</span><span class=\"n\">DataFrame</span><span class=\"p\">(</span><span class=\"n\">d</span><span class=\"p\">);</span>\n\n<span class=\"c1\">#Clean up the data to assign . to NAN</span>\n<span class=\"n\">data</span><span class=\"p\">[</span><span class=\"s1\">&#39;measles&#39;</span><span class=\"p\">]</span> <span class=\"o\">=</span> <span class=\"n\">data</span><span class=\"p\">[</span><span class=\"s1\">&#39;measles&#39;</span><span class=\"p\">]</span><span class=\"o\">.</span><span class=\"n\">replace</span><span class=\"p\">(</span>\n        <span class=\"p\">[</span><span class=\"s1\">&#39;1&#39;</span><span class=\"p\">,</span> <span class=\"s1\">&#39;0&#39;</span><span class=\"p\">,</span> <span class=\"s1\">&#39;.&#39;</span><span class=\"p\">],</span> <span class=\"p\">[</span><span class=\"mi\">1</span><span class=\"p\">,</span> <span class=\"mi\">0</span><span class=\"p\">,</span> <span class=\"s1\">&#39;NAN&#39;</span><span class=\"p\">])</span>\n\n<span class=\"c1\">#Convert the data to numberic values</span>\n<span class=\"n\">data</span> <span class=\"o\">=</span> <span class=\"n\">data</span><span class=\"o\">.</span><span class=\"n\">convert_objects</span><span class=\"p\">(</span><span class=\"n\">convert_numeric</span><span class=\"o\">=</span><span class=\"kc\">True</span><span class=\"p\">)</span>\n\n<span class=\"c1\">#Replace the state ID code with the state&#39;s name</span>\n<span class=\"n\">num</span><span class=\"p\">,</span><span class=\"n\">name</span> <span class=\"o\">=</span> <span class=\"n\">np</span><span class=\"o\">.</span><span class=\"n\">loadtxt</span><span class=\"p\">(</span>\n        <span class=\"s1\">&#39;state_ID.txt&#39;</span><span class=\"p\">,</span><span class=\"n\">unpack</span><span class=\"o\">=</span><span class=\"kc\">True</span><span class=\"p\">,</span><span class=\"n\">dtype</span><span class=\"o\">=</span><span class=\"nb\">str</span><span class=\"p\">,</span><span class=\"n\">delimiter</span><span class=\"o\">=</span><span class=\"s1\">&#39;,&#39;</span><span class=\"p\">)</span>\n\n<span class=\"n\">data</span><span class=\"p\">[</span><span class=\"s1\">&#39;state&#39;</span><span class=\"p\">]</span> <span class=\"o\">=</span> <span class=\"n\">data</span><span class=\"p\">[</span><span class=\"s1\">&#39;state&#39;</span><span class=\"p\">]</span><span class=\"o\">.</span><span class=\"n\">replace</span><span class=\"p\">(</span>\n        <span class=\"n\">num</span><span class=\"o\">.</span><span class=\"n\">astype</span><span class=\"p\">(</span><span class=\"n\">np</span><span class=\"o\">.</span><span class=\"n\">int64</span><span class=\"p\">),</span> <span class=\"n\">name</span><span class=\"p\">)</span>\n\n<span class=\"c1\">#Find all the values where there is complete provider data.</span>\n<span class=\"c1\">#We will look at only the complete patient records,</span>\n<span class=\"c1\">#and remove records column which is now only one value.</span>\n<span class=\"n\">ind</span> <span class=\"o\">=</span> <span class=\"n\">np</span><span class=\"o\">.</span><span class=\"n\">where</span><span class=\"p\">(</span><span class=\"n\">data</span><span class=\"o\">.</span><span class=\"n\">patient_data</span><span class=\"o\">==</span><span class=\"mi\">1</span><span class=\"p\">)[</span><span class=\"mi\">0</span><span class=\"p\">]</span>\n<span class=\"n\">data</span> <span class=\"o\">=</span> <span class=\"n\">data</span><span class=\"o\">.</span><span class=\"n\">iloc</span><span class=\"p\">[</span><span class=\"n\">ind</span><span class=\"p\">]</span>\n<span class=\"n\">data</span><span class=\"o\">.</span><span class=\"n\">drop</span><span class=\"p\">([</span><span class=\"s1\">&#39;patient_data&#39;</span><span class=\"p\">],</span><span class=\"n\">inplace</span><span class=\"o\">=</span><span class=\"kc\">True</span><span class=\"p\">,</span><span class=\"n\">axis</span><span class=\"o\">=</span><span class=\"mi\">1</span><span class=\"p\">)</span>\n</pre></div>\n\n\n<p>Below, we provide some examples of our resulting, cleaned data points. The weight columns here are described further below. The first of these is used for analyses including the Virgin Islands, the other when they are&nbsp;not.</p>\n<div class=\"highlight\"><pre><span></span><span class=\"err\">MMR child house measles state stratum weights weights_v</span>\n<span class=\"err\">0 1 11 1 1 Texas 1054 65.155698 120.163273</span>\n<span class=\"err\">1 1 21 2 1 Texas 2055 33.652064 52.360361</span>\n<span class=\"err\">3 1 41 4 1 Massachusetts 1002 216.529889 271.502218</span>\n<span class=\"err\">5 1 61 6 1 Georgia 1025 231.557156 562.130094</span>\n<span class=\"err\">6 1 71 7 1 South Carolina 1030 150.109737 238.018808</span>\n</pre></div>\n\n\n<h5><strong>Weighting to get averaged&nbsp;statistics</strong></h5>\n<p>We now have our data cleaned and ready to go. However, some additional work needs to be done before we can evaluate various statistics of interest. This is because the <span class=\"caps\">CDC</span> data set is not a random sample, but instead a <a href=\"http://en.wikipedia.org/wiki/Stratified_sampling\">stratified sample</a> &#8212; i.e. one geared towards obtaining reasonable accuracy among many minority groups, and not simply among the averaged population. The weight factors are the key to extracting averaged statistics from this data, as explained in the user guide. For example, the average is essentially just a weighted average, and the standard error can be calculated using a Taylor-Series approach. The easiest way to apply this to our data is to make use of custom functions. Once constructed, these can then be easily applied to different DataFrame&nbsp;groupings.</p>\n<div class=\"highlight\"><pre><span></span><span class=\"c1\"># Lets define a function to caluclate the vaccination rate</span>\n<span class=\"c1\"># for the group we are looking at, and the standard error</span>\n<span class=\"k\">def</span> <span class=\"nf\">calculate_rate_and_error</span><span class=\"p\">(</span><span class=\"n\">data</span><span class=\"p\">):</span>\n    <span class=\"c1\"># The rate is calucated useing a weighted average</span>\n    <span class=\"n\">rate</span> <span class=\"o\">=</span> <span class=\"p\">(</span><span class=\"n\">data</span><span class=\"o\">.</span><span class=\"n\">MMR</span> <span class=\"o\">*</span> <span class=\"n\">data</span><span class=\"o\">.</span><span class=\"n\">weights_v</span><span class=\"p\">)</span><span class=\"o\">.</span><span class=\"n\">sum</span><span class=\"p\">()</span> <span class=\"o\">/</span> <span class=\"n\">data</span><span class=\"o\">.</span><span class=\"n\">weights_v</span><span class=\"o\">.</span><span class=\"n\">sum</span><span class=\"p\">()</span>\n\n    <span class=\"c1\"># The error is calculated using the formula from the data sheet</span>\n    <span class=\"n\">data</span><span class=\"p\">[</span><span class=\"s1\">&#39;Z&#39;</span><span class=\"p\">]</span> <span class=\"o\">=</span> <span class=\"n\">data</span><span class=\"o\">.</span><span class=\"n\">weights_v</span><span class=\"o\">*</span><span class=\"p\">(</span><span class=\"n\">data</span><span class=\"o\">.</span><span class=\"n\">MMR</span><span class=\"o\">-</span><span class=\"n\">rate</span><span class=\"p\">)</span> <span class=\"o\">/</span> <span class=\"n\">data</span><span class=\"o\">.</span><span class=\"n\">weights_v</span><span class=\"o\">.</span><span class=\"n\">sum</span><span class=\"p\">()</span>\n    <span class=\"n\">zhi</span> <span class=\"o\">=</span> <span class=\"n\">data</span><span class=\"o\">.</span><span class=\"n\">groupby</span><span class=\"p\">([</span><span class=\"s1\">&#39;stratum&#39;</span><span class=\"p\">,</span><span class=\"s1\">&#39;house&#39;</span><span class=\"p\">])</span><span class=\"o\">.</span><span class=\"n\">agg</span><span class=\"p\">(</span><span class=\"n\">np</span><span class=\"o\">.</span><span class=\"n\">sum</span><span class=\"p\">)</span><span class=\"o\">.</span><span class=\"n\">Z</span>\n    <span class=\"n\">zh</span> <span class=\"o\">=</span> <span class=\"n\">zhi</span><span class=\"o\">.</span><span class=\"n\">groupby</span><span class=\"p\">(</span><span class=\"n\">level</span><span class=\"o\">=</span><span class=\"s1\">&#39;stratum&#39;</span><span class=\"p\">)</span><span class=\"o\">.</span><span class=\"n\">sum</span><span class=\"p\">()</span>\n    <span class=\"c1\"># Number of households per stratum</span>\n    <span class=\"n\">nk</span> <span class=\"o\">=</span> <span class=\"n\">zhi</span><span class=\"o\">.</span><span class=\"n\">groupby</span><span class=\"p\">(</span><span class=\"n\">level</span><span class=\"o\">=</span><span class=\"s1\">&#39;stratum&#39;</span><span class=\"p\">)</span><span class=\"o\">.</span><span class=\"n\">count</span><span class=\"p\">()</span>\n    <span class=\"n\">zh</span> <span class=\"o\">=</span> <span class=\"n\">zh</span><span class=\"o\">/</span><span class=\"n\">nk</span>\n\n    <span class=\"n\">stratum_labels</span> <span class=\"o\">=</span> <span class=\"n\">zh</span><span class=\"o\">.</span><span class=\"n\">index</span><span class=\"o\">.</span><span class=\"n\">values</span>\n    <span class=\"n\">var</span><span class=\"o\">=</span><span class=\"n\">np</span><span class=\"o\">.</span><span class=\"n\">zeros</span><span class=\"p\">(</span><span class=\"nb\">len</span><span class=\"p\">(</span><span class=\"n\">nk</span><span class=\"p\">))</span>\n    <span class=\"n\">ind</span> <span class=\"o\">=</span> <span class=\"mi\">0</span>\n    <span class=\"k\">for</span> <span class=\"n\">a</span> <span class=\"ow\">in</span> <span class=\"n\">stratum_labels</span><span class=\"p\">:</span>\n        <span class=\"n\">delta2</span> <span class=\"o\">=</span> <span class=\"p\">(</span><span class=\"n\">zhi</span><span class=\"o\">.</span><span class=\"n\">loc</span><span class=\"p\">[</span><span class=\"n\">a</span><span class=\"p\">]</span> <span class=\"o\">-</span> <span class=\"n\">zh</span><span class=\"p\">[</span><span class=\"n\">a</span><span class=\"p\">])</span><span class=\"o\">**</span><span class=\"mi\">2</span>\n        <span class=\"n\">delta2</span> <span class=\"o\">=</span> <span class=\"n\">delta2</span><span class=\"o\">.</span><span class=\"n\">sum</span><span class=\"p\">()</span>\n        <span class=\"n\">var</span><span class=\"p\">[</span><span class=\"n\">ind</span><span class=\"p\">]</span><span class=\"o\">=</span><span class=\"p\">(</span><span class=\"n\">nk</span><span class=\"p\">[</span><span class=\"n\">a</span><span class=\"p\">]</span><span class=\"o\">/</span><span class=\"p\">(</span><span class=\"n\">nk</span><span class=\"p\">[</span><span class=\"n\">a</span><span class=\"p\">]</span><span class=\"o\">-</span><span class=\"mf\">1.</span><span class=\"p\">))</span> <span class=\"o\">*</span> <span class=\"n\">delta2</span>\n        <span class=\"n\">ind</span> <span class=\"o\">+=</span> <span class=\"mi\">1</span>\n\n    <span class=\"n\">standard_error</span> <span class=\"o\">=</span> <span class=\"n\">np</span><span class=\"o\">.</span><span class=\"n\">sqrt</span><span class=\"p\">(</span><span class=\"nb\">sum</span><span class=\"p\">(</span><span class=\"n\">var</span><span class=\"p\">))</span>\n    <span class=\"k\">return</span> <span class=\"n\">rate</span><span class=\"p\">,</span> <span class=\"n\">standard_error</span>\n</pre></div>\n\n\n<p>If we apply this function to our whole DataFrame, we will get the national <span class=\"caps\">MMR</span> vaccination rate and standard&nbsp;error.</p>\n<div class=\"highlight\"><pre><span></span><span class=\"err\">calculate_rate_and_error(data)</span>\n<span class=\"err\"># output: (0.90767842904073048, 0.0043003916851249895)</span>\n</pre></div>\n\n\n<h5><strong>Data segmentation &#8212; stats by&nbsp;group</strong></h5>\n<p>But we can also do more! If we first apply the DateFrame&#8217;s groupby method, we can split the data along any feature of interest. For example, below we split the data along the state column. This generates subgroups for each state. Next, we use the apply method to run our custom function on all the different groups of data. We then clean up the output, unzip the tuple and generate a graph showing the <span class=\"caps\">MMR</span> vaccination rate by state. It should be evident that with only modest effort, one can modify this code to group the data in many varying ways &#8212; all that needs to be done is to adjust the arguments of the groupby&nbsp;command.</p>\n<div class=\"highlight\"><pre><span></span><span class=\"c1\"># Now that we have our function it is easy to calculate values</span>\n<span class=\"c1\"># for any group.</span>\n\n<span class=\"c1\"># To examine rates by state, we will group by state</span>\n<span class=\"n\">grouped</span><span class=\"o\">=</span><span class=\"n\">data</span><span class=\"o\">.</span><span class=\"n\">groupby</span><span class=\"p\">(</span><span class=\"s1\">&#39;state&#39;</span><span class=\"p\">)</span>\n\n<span class=\"c1\"># We then apply our function to the grouped data, and save</span>\n<span class=\"c1\"># it as a data frame</span>\n<span class=\"n\">result</span> <span class=\"o\">=</span> <span class=\"n\">pd</span><span class=\"o\">.</span><span class=\"n\">DataFrame</span><span class=\"p\">(</span><span class=\"n\">grouped</span><span class=\"o\">.</span><span class=\"n\">apply</span><span class=\"p\">(</span><span class=\"n\">calculate_rate_and_error</span><span class=\"p\">))</span>\n\n<span class=\"c1\"># To conver the results from:</span>\n<span class=\"c1\"># state</span>\n<span class=\"c1\"># Alabama (0.931323319509, 0.017837146103)</span>\n<span class=\"c1\"># Alaska (0.862202058663, 0.0257844894834)</span>\n<span class=\"c1\"># to</span>\n<span class=\"c1\"># Rate Standard Error</span>\n<span class=\"c1\"># state</span>\n<span class=\"c1\"># Alabama 0.931323 0.017837</span>\n<span class=\"c1\"># Alaska 0.862202 0.025784</span>\n<span class=\"c1\"># We use the following code</span>\n\n<span class=\"n\">new_col_list</span> <span class=\"o\">=</span> <span class=\"p\">[</span><span class=\"s1\">&#39;Rate&#39;</span><span class=\"p\">,</span><span class=\"s1\">&#39;Standard Error&#39;</span><span class=\"p\">]</span>\n<span class=\"k\">for</span> <span class=\"n\">n</span><span class=\"p\">,</span><span class=\"n\">col</span> <span class=\"ow\">in</span> <span class=\"nb\">enumerate</span><span class=\"p\">(</span><span class=\"n\">new_col_list</span><span class=\"p\">):</span>\n    <span class=\"n\">result</span><span class=\"p\">[</span><span class=\"n\">col</span><span class=\"p\">]</span> <span class=\"o\">=</span> <span class=\"n\">result</span><span class=\"p\">[</span><span class=\"mi\">0</span><span class=\"p\">]</span><span class=\"o\">.</span><span class=\"n\">apply</span><span class=\"p\">(</span><span class=\"k\">lambda</span> <span class=\"n\">x</span><span class=\"p\">:</span> <span class=\"n\">x</span><span class=\"p\">[</span><span class=\"n\">n</span><span class=\"p\">])</span>\n    <span class=\"n\">result</span><span class=\"o\">.</span><span class=\"n\">drop</span><span class=\"p\">(</span><span class=\"mi\">0</span><span class=\"p\">,</span> <span class=\"n\">axis</span><span class=\"o\">=</span><span class=\"mi\">1</span><span class=\"p\">,</span> <span class=\"n\">inplace</span><span class=\"o\">=</span><span class=\"kc\">True</span><span class=\"p\">)</span>\n\n<span class=\"c1\"># Make a sorted copy of the data</span>\n<span class=\"nb\">sorted</span> <span class=\"o\">=</span> <span class=\"n\">result</span><span class=\"o\">.</span><span class=\"n\">sort_index</span><span class=\"p\">(</span><span class=\"n\">by</span><span class=\"o\">=</span><span class=\"s1\">&#39;Rate&#39;</span><span class=\"p\">,</span> <span class=\"n\">ascending</span><span class=\"o\">=</span><span class=\"kc\">True</span><span class=\"p\">)</span>\n<span class=\"n\">result</span><span class=\"p\">[</span><span class=\"s1\">&#39;Rate&#39;</span><span class=\"p\">]</span><span class=\"o\">=</span><span class=\"n\">result</span><span class=\"p\">[</span><span class=\"s1\">&#39;Rate&#39;</span><span class=\"p\">]</span><span class=\"o\">*</span><span class=\"mi\">100</span>\n\n<span class=\"c1\"># Save a csv file if wanted</span>\n<span class=\"n\">result</span><span class=\"o\">.</span><span class=\"n\">to_csv</span><span class=\"p\">(</span><span class=\"s1\">&#39;Rate 2012.csv&#39;</span><span class=\"p\">,</span> <span class=\"n\">float_format</span><span class=\"o\">=</span><span class=\"s1\">&#39;</span><span class=\"si\">%5.2f</span><span class=\"s1\">&#39;</span><span class=\"p\">)</span>\n\n<span class=\"c1\"># Generate an online plot</span>\n<span class=\"n\">data</span> <span class=\"o\">=</span> <span class=\"n\">Data</span><span class=\"p\">([</span>\n    <span class=\"n\">Bar</span><span class=\"p\">(</span>\n        <span class=\"n\">y</span><span class=\"o\">=</span><span class=\"nb\">sorted</span><span class=\"o\">.</span><span class=\"n\">index</span><span class=\"o\">.</span><span class=\"n\">values</span> <span class=\"p\">,</span>\n        <span class=\"n\">x</span><span class=\"o\">=</span><span class=\"nb\">sorted</span><span class=\"p\">[</span><span class=\"s1\">&#39;Rate&#39;</span><span class=\"p\">],</span>\n        <span class=\"n\">orientation</span><span class=\"o\">=</span><span class=\"s1\">&#39;h&#39;</span>\n    <span class=\"p\">)</span>\n<span class=\"p\">])</span>\n<span class=\"n\">plot_url</span> <span class=\"o\">=</span> <span class=\"n\">py</span><span class=\"o\">.</span><span class=\"n\">plot</span><span class=\"p\">(</span><span class=\"n\">data</span><span class=\"p\">,</span> <span class=\"n\">filename</span><span class=\"o\">=</span><span class=\"s1\">&#39;plot&#39;</span><span class=\"p\">)</span>\n</pre></div>",
  "category": ""
}