{
  "title": "Some Economics of Algae and Duckweed",
  "link": "https://conversableeconomist.com/2022/11/04/some-economics-of-algae-and-duckweed/",
  "dc:creator": "conversableeconomist",
  "pubDate": "Fri, 04 Nov 2022 15:36:06 +0000",
  "category": "Uncategorized",
  "guid": "https://conversableeconomist.com/?p=12861",
  "description": "<p>As the world population rises toward 10 billion, there are hard questions of how to feed everyone, while protecting the environment, and while also having a generally rising standard of living. No single answer is likely to suffice. But Gal Hochman and Ruslana Rachel Palatnik discuss one possible piece of the puzzle in &#8220;The Economics &#8230; <a href=\"https://conversableeconomist.com/2022/11/04/some-economics-of-algae-and-duckweed/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Some Economics of Algae and Duckweed</span></a></p>\n<p>The post <a href=\"https://conversableeconomist.com/2022/11/04/some-economics-of-algae-and-duckweed/\">Some Economics of Algae and Duckweed</a> first appeared on <a href=\"https://conversableeconomist.com\">Conversable Economist</a>.</p>",
  "content:encoded": "<p>As the world population rises toward 10 billion, there are hard questions of how to feed everyone, while protecting the environment, and while also having a generally rising standard of living. No single answer is likely to suffice. But <a href=\"https://www.annualreviews.org/doi/abs/10.1146/annurev-resource-111920-011624\">Gal Hochman and Ruslana Rachel Palatnik discuss one possible piece of the puzzle in  &#8220;The Economics of Aquatic Plants: The Case of Algae and Duckweed&#8221;</a> (<em>Annual Review of Resource Economics</em>, 14: 555-577). They begin: </p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>Aquatic plants grow in freshwater, coastal marine waters, or open oceans and are the starting point of many food webs. This survey focuses on three such plants: microalgae, seaweeds (or macroalgae), and duckweed (MSD). Although microalgae are a photosynthetic aquatic organism, seaweed and duckweed are aquatic plants. However, for simplicity, we refer to them as aquatic plants. These plants are mostly directly consumed as human food and animal feed; however, they are consumed in much smaller volumes in pharmaceuticals and cosmetics, textiles, biofertilizers/biostimulants, and biopackaging products and applications. MSD have considerable potential to become an essential player in the bioeconomy as a source for plant-based protein and other biochemicals, feedstock<br>for bio-oils and biofuels, a variety of high-value bioproducts, and a viable source for carbon sequestration.</p>\n\n\n\n<p>The comparative advantages of MSD are the much higher biomass productivity than that of terrestrial plants (Casoni et al. 2020) while not competing for land or freshwater (Palatnik & Zilberman 2017). Importantly, MSD have higher photosynthetic efficiencies than land-based biomass production and are more efficient in capturing carbon (Packer 2009, Duarte et al. 2017). Moreover, MSD can be cultivated efficiently without antibiotics, fertilizers, and pesticides (Golberg et al. 2020a), and the global MSD biomass cultivation potential can sustain the industry’s rapid growth. For example, the offshore cultivation potential of seaweeds can provide up to a quarter of predicted plant protein demand by 2054 (Lehahn et al. 2016). Roughly 0.3% of the ocean surface would be enough to produce as much biomass as is produced annually in all of global agriculture (Bjerregaard et al. 2016).</p>\n\n\n\n<p>Demand for meat, fish, and dairy is soaring, particularly among the rapidly growing middle classes in parts of the developing world (GFI 2021). Producing those products in traditional agriculture uses large amounts of land, water, and pesticides and produces gigatons of greenhouse gases. Commercial fishing may not be sustainable, and overfishing pushes fish populations to become endangered or threatened. Dairy production also creates a range of negative externalities. Thus, MSD cultivation is a double dividend and may significantly address humanity’s primary challenges: food security and climate change. </p>\n\n\n\n<p>In 2019 the market for MSD products and applications was worth approximately US$20 billion (FAO 2021). The growing demand for sustainable biobased products and applications can potentially significantly increase the market. Furthermore, carbon pricing might dramatically exacerbate the demand for MSD.</p>\n</blockquote>\n\n\n\n<p>In the context of the global economy, these markets are tiny. An optimist would view this fact as suggesting room for dramatic growth, while pessimist would say that they are small because all this talk of potential benefits is a dramatic overestimate. The authors argue that there is a pathway followed for new agricultural products: it begins with a reliance on harvesting wild products, then shifts to cultivated products, and then shifts further to science-based insights about both cultivation and potential use.  For microalgae, seaweeds (&#8220;macroalgae&#8221;), and duckweed, the shift from harvesting wild products to cultivation is barely underway, and the development of science-based insights about cultivation and use are also at a very early stage. But just to take a few examples, if microalgae can be used as a basis for biofuels, and if seaweed and duckweed could be useful for animal feed, those kinds of applications could dramatically reshape the constraints facing land-based agriculture in the next few decades. </p>\n<p><a class=\"a2a_button_facebook\" href=\"https://www.addtoany.com/add_to/facebook?linkurl=https%3A%2F%2Fconversableeconomist.com%2F2022%2F11%2F04%2Fsome-economics-of-algae-and-duckweed%2F&linkname=Some%20Economics%20of%20Algae%20and%20Duckweed\" title=\"Facebook\" rel=\"nofollow noopener\" target=\"_blank\"></a><a class=\"a2a_button_twitter\" href=\"https://www.addtoany.com/add_to/twitter?linkurl=https%3A%2F%2Fconversableeconomist.com%2F2022%2F11%2F04%2Fsome-economics-of-algae-and-duckweed%2F&linkname=Some%20Economics%20of%20Algae%20and%20Duckweed\" title=\"Twitter\" rel=\"nofollow noopener\" target=\"_blank\"></a><a class=\"a2a_button_email\" href=\"https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fconversableeconomist.com%2F2022%2F11%2F04%2Fsome-economics-of-algae-and-duckweed%2F&linkname=Some%20Economics%20of%20Algae%20and%20Duckweed\" title=\"Email\" rel=\"nofollow noopener\" target=\"_blank\"></a><a class=\"a2a_dd addtoany_share_save addtoany_share\" href=\"https://www.addtoany.com/share#url=https%3A%2F%2Fconversableeconomist.com%2F2022%2F11%2F04%2Fsome-economics-of-algae-and-duckweed%2F&#038;title=Some%20Economics%20of%20Algae%20and%20Duckweed\" data-a2a-url=\"https://conversableeconomist.com/2022/11/04/some-economics-of-algae-and-duckweed/\" data-a2a-title=\"Some Economics of Algae and Duckweed\"></a></p><p>The post <a href=\"https://conversableeconomist.com/2022/11/04/some-economics-of-algae-and-duckweed/\">Some Economics of Algae and Duckweed</a> first appeared on <a href=\"https://conversableeconomist.com\">Conversable Economist</a>.</p>",
  "post-id": 12861
}