{
  "title": "TU113: Integrating Self-Defense, Neuroscience and Affirmative Consent to Build Empowerment and Heal Trauma",
  "link": "https://therapistuncensored.com/episodes/tu113-integrating-self-defense-neuroscience-and-affirmative-consent-to-build-empowerment-and-heal-trauma/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu113-integrating-self-defense-neuroscience-and-affirmative-consent-to-build-empowerment-and-heal-trauma",
  "pubDate": "Thu, 23 Jan 2020 14:36:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=7922",
  "description": "“Yes means yes is the new no means no!”\nOften we doubt our gut instinct, question our right to take up space in the world, and live governed by fear -especially when we’ve experienced trauma. Meet the Safety Team, a group of ordinary women doing extraordinary work teaching women how to build resiliency and re-claim their sense of agency.\nIn this episode,\nCo-host Dr Ann Kelley joins this powerful group of women as they teach us how to find our voice, feel more present and powerful in our bodies, build resilience, and heal trauma.\nWho is The Safety Team?\nChristine DiBlasio, Ph.D., is the president and co-founder of The Safety Team, as well as a 4th degree black belt in Karate. For over 15 years, Dr. DiBlasio has coordinated and presented workshops on violence prevention, risk reduction, and self-advocacy skills to middle, high school and college students, as well as to community and corporate organizations. She has been instrumental in curriculum development, with a strong focus on serving survivors of interpersonal violence and trauma so as to promote healing. In addition, Dr. DiBlasio created a college and high school internship program and continues to provide leadership training to these interns as well as to an expanding group of volunteers.\n\nDr. DiBlasio’s dedication to the Safety Team is an outgrowth of both her background in martial arts as well as her extensive experience as a practicing licensed psychologist with 30 years of clinical experience. Dr. DiBlasio is the clinical director of a large mental health outpatient practice, and in the context of this work, has provided psychotherapy services for survivors of interpersonal violence, trauma and sexual assault across the lifespan.\n\n \n\n\n\nDarcy Richardson, MS, is a forensic toxicologist and Vice-President of The Safety Team, a 501(c)3 non-profit focused on the empowerment of women and the reduction of sexual violence. As a toxicologist she has provided expert testimony in over a thousand cases in both criminal and civil courts at the state and federal level. These cases have included assault and sexual assaults where her expertise is used to discuss the impact of alcohol and drugs on the ability to consent or to react effectively in dangerous situations. As part of The Safety Team she uses this expertise to teach women about Drug-Facilitated Sexual Assault (DFSA), and how to effectively navigate this risk. Research indicates that half of all sexual assault cases involve alcohol and/or other drugs, which means addressing DFSA in Empowerment Self-Defense (ESD) classes and curricula is an integral part of reducing the incidence of sexual violence overall. Darcy is a 2nd degree black belt in Karate and a 1st degree black belt in Arnis.\n\n \n\n\n\nChristina Allard, PT, is the volunteer coordinator, and instructor for The Safety Team, Inc. and a licensed Physical Therapist specializing in pediatrics and school-based therapy. She pursued additional training in childhood trauma and its impacts on development. She incorporates her knowledge of neuromuscular and somatic responses to develop movement strategies for emotional regulation in children and teenagers. Her interest in the therapeutic effects of movement sparked her interest in martial arts (brown belt in Karate) and her ongoing commitment to the empowerment model of The Safety Team.\n\n \n\n\n\nNancy Keller, MEd, CAS, is the treasurer, co-founder, and lead instructor for The Safety Team, Inc. and a licensed public-school educator with Winooski (VT) School District for more than 30 years. With expertise in curriculum development and instruction, she has created middle school programs for place-based learning in science and mathematics, as well as implemented a school-wide classroom-based program for physical activity. This program was designed to address the movement needs of those children who have experienced trauma, and was built upon her background in the martial arts (3rd degree black belt in Karate ...",
  "enclosure": "",
  "itunes:subtitle": "“Yes means yes is the new no means no!” Often we doubt our gut instinct, question our right to take up space in the world, and live governed by fear -especially when we’ve experienced trauma. Meet the Safety Team,",
  "itunes:summary": "\"Yes means yes is the new no means no!\" Often we doubt our gut instinct,  question our right to take up space in the world, and live governed by fear -especially when we&apos;ve experienced trauma. Meet the Safety Team, a group of ordinary women doing extraordinary work teaching women how to build resiliency and re-claim their sense of agency.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW, CGP",
  "itunes:image": "",
  "itunes:duration": "50:50"
}