{
  "id": "yt:video:xzhhbvUIWEs",
  "yt:videoId": "xzhhbvUIWEs",
  "yt:channelId": "UCPDXXXJj9nax0fr0Wfc048g",
  "title": "Dirty Laundry Ep. 1 [Full Episode] - Sam Reich, Katie Marovitch, Raphael Chestang, and Jacob Wysocki",
  "link": "",
  "author": {
    "name": "CollegeHumor",
    "uri": "https://www.youtube.com/channel/UCPDXXXJj9nax0fr0Wfc048g"
  },
  "published": "2022-06-08T17:30:09+00:00",
  "updated": "2022-09-19T03:16:03+00:00",
  "media:group": {
    "media:title": "Dirty Laundry Ep. 1 [Full Episode] - Sam Reich, Katie Marovitch, Raphael Chestang, and Jacob Wysocki",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Presenting the premiere episode of Dirty Laundry! Host Lily Du gathers together four guests to tell secrets, guess who they belong to, and enjoy a few drinks crafted by bartender Grant O'Brien. Sam Reich, Katie Marovitch, Jacob Wysocki, and Raphael Chestang kick things off drinking Spanish coffees. To watch the rest of the series, sign up for Dropout! https://signup.dropout.tv.\n\nWelcome to the CollegeHumor channel! Yes, we're still here (and still making videos). You can support us by signing up for DROPOUT.tv, our subscription video platform that features a ton of exclusive content and series for only $6/month (that's less than 25 cents a day). See tons of Um Actually, Game Changer, Dimension 20, Dirty Laundry Breaking News, Total Forgiveness, and more - all uncensored and with no ads! https://signup.dropout.tv\n\nAnd if you just love watching stuff on Youtube, you can instead become a member of our channel today [ http://bit.ly/2kpp0oz ] for access to OUR ENTIRE DROPOUT LIBRARY RIGHT HERE!\n\nIn the meantime, leave us some nice comments on this video. It's a good one, right?\n\nFOLLOW US EVERYWHERE:\nhttps://www.twitter.com/collegehumor\nhttps://www.instagram.com/collegehumor\nhttps://www.tiktok.com/@collegehumor\nhttps://www.facebook.com/collegehumor",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}