{
  "title": "Home Heating With Hydrogen: Ill-Advised as It Sounds",
  "link": "https://spectrum.ieee.org/home-heating-with-hydrogen-is-ill-advised",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/two-white-boilers-mounted-on-a-wood-wall-with-pipes-and-tubes.jpg?id=31859785&width=1200&height=800&coordinates=0%2C184%2C0%2C184\"/><br/><br/><p>Hydrogen, if it comes from splitting water with renewable electricity, has its role as a climate-friendly energy source. It could help decarbonize challenging sectors like heavy industry, shipping, and aviation.</p><p>But hydrogen makes absolutely no sense for heating homes and buildings, according to a new review of several international studies. It is simply much too expensive and inefficient for that purpose, says Jan Rosenow, Europe director at the Regulatory Assistance Project, an energy think tank in Brussels, who authored the commentary published in the journal <em><a href=\"https://www.cell.com/joule/fulltext/S2542-4351%2822%2900416-0\" rel=\"noopener noreferrer\" target=\"_blank\">Joule</a></em>.</p><p>Space heating today mostly relies on burning natural gas or other fossil fuels. The gas and heating industry are promoting hydrogen as a clean substitute for fossils. Using hydrogen in current infrastructure, they say, would be much easier than switching to electric heat pumps, the biggest competitor today for low-carbon heating. Several countries are considering hydrogen heating strategies. But they do not seem to be based on scientific evidence, Rosenow’s analysis shows. </p><p>“Hydrogen home heating is attractive to gas grid companies because it allows them to continue using their assets,” Rosenow says. “The heating industry is supportive [because] they manufacture systems that currently use gas, and now have products that can run on hydrogen. So they also have an interest in retaining molecules that they can use.”</p><p>Meanwhile, policymakers seem to have gotten behind the idea “because it sounds easy,” he says. “You just replace gas in the pipes. And there’s no disruption to the consumer.”</p><p>Cost and efficiency numbers belie the hydrogen heating hype, though, Rosenow says. He looked at 32 independent studies from Brazil, California, the E.U., and the United Kingdom. They include energy-system modeling, customer-cost modeling, and environmental-impact studies, done at scales spanning from city level to international. He chose studies that were not carried out by or on behalf of any industry, whether gas, electricity, or heat pump or boiler manufacturers. </p><p>The studies show that using renewable electricity to first make hydrogen with electrolysis, and then using the hydrogen to heat spaces is less efficient than using the electricity to directly power a heat pump. Electrolyzers are around 80 percent efficient, and boilers have average efficiencies of 85 percent, resulting in an overall efficiency of hydrogen heating of 70 percent. Meanwhile, a heat pump produces three to four units of heat for each unit of electricity. “You need five to six times more electricity to generate the same amount of heat with hydrogen than with an efficient heat pump,” Rosenow says. “That’s the Achilles’ heel for hydrogen. It’s basic thermodynamics.”</p><p>Besides being less efficient, hydrogen is also significantly more expensive per unit of heat delivered when compared to heat pumps, his review found. Switching to hydrogen isn’t as easy as the industry makes it sound. It will require changing distribution pipelines, pipe work in buildings, and furnaces, all of which will add to consumers’ heating cost.</p><p>Others have come to the same conclusion. At a recent Financial Times Hydrogen Summit in London, one U.K. utility representative likened hydrogen home heating to <a href=\"https://www.rechargenews.com/energy-transition/astonishingly-expensive-using-hydrogen-to-heat-homes-will-be-like-spaffing-money-up-the-wall-utility/2-1-1246366\" rel=\"noopener noreferrer\" target=\"_blank\">burning cash</a>. A report by energy analysis firm Cornwall Insight released days before Rosenow’s review showed that using hydrogen to heat a home would cost <a href=\"https://hydrogen-central.com/hydrogen-could-nearly-double-cost-heating-home-compared-gas-about-70-increase-home-energy-bills-according-report-renewable-energy-charity/\" rel=\"noopener noreferrer\" target=\"_blank\">twice as much as using natural gas</a>. </p><p>But the hydrogen lobby, backed by large players in the gas industry, is strong, as David Cebon, professor of mechanical engineering at the University of Cambridge, outlined in a recent <a href=\"https://www.rechargenews.com/energy-transition/wrong-side-of-history-wake-up-to-the-hype-around-green-hydrogen-for-heating/2-1-1282365\" rel=\"noopener noreferrer\" target=\"_blank\">opinion piece</a>. The U.K. government is carrying out a number of small, private trials for hydrogen heating, and is expected to decide on the role that hydrogen will play when it makes a strategic decision on the future of the gas grid in 2026. By 2030, there could be whole towns being heated by hydrogen in the U.K. Similar hydrogen heating trials are underway in Spain and the Netherlands. In the United States, where the <a href=\"https://spectrum.ieee.org/hydrogen-economy-inflation-reduction-act\" target=\"_self\">hydrogen economy is also picking up speed</a> thanks to the Inflation Reduction Act, gas monopolies are also <a href=\"https://www.latimes.com/business/story/2022-03-21/los-angeles-needs-clean-energy-hydrogen-could-be-the-answer\" rel=\"noopener noreferrer\" target=\"_blank\">starting to push for the switch to hydrogen</a>.</p><p>There are many applications where hydrogen could be essential. But for buildings, writes Cebon, “heat pumps are a clear winning technology. Decarbonising heat will be hard enough. And when speed is everything, there is no time for the hydrogen distraction.”</p>",
  "pubDate": "Tue, 04 Oct 2022 15:22:23 +0000",
  "guid": "https://spectrum.ieee.org/home-heating-with-hydrogen-is-ill-advised",
  "category": [
    "Home heating",
    "Hydrogen"
  ],
  "dc:creator": "Prachi Patel",
  "media:content": ""
}