{
  "title": "Funny NYT corrections",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/24/funny-nyt-corrections/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/24/funny-nyt-corrections/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Mon, 24 Oct 2022 13:58:08 +0000",
  "category": "Zombies",
  "guid": "https://statmodeling.stat.columbia.edu/?p=46380",
  "description": "I happened to come across this one from a few years ago: Correction: June 16, 2014 Nicholas Kristof’s column on Thursday misspelled the middle name of a Vanderbilt professor. She is Cecilia Hyunjung Mo, not Hyunjong. Similarly, there was this &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/24/funny-nyt-corrections/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>I happened to come across <a href=\"https://statmodeling.stat.columbia.edu/2014/06/21/race-top-nyt-columnists-edition/\">this one</a> from a few years ago:</p>\n<blockquote><p>Correction: June 16, 2014</p>\n<blockquote><p>Nicholas Kristof’s column on Thursday misspelled the middle name of a Vanderbilt professor. She is Cecilia Hyunjung Mo, not Hyunjong.</p></blockquote>\n<p>Similarly, there was this memorable correction from a David Brooks column a couple years ago:</p>\n<blockquote><p>An earlier version of this column misstated the location of a statue in Washington that depicts a rambunctious horse being reined in by a muscular man. The sculpture, Michael Lantz’s ‘Man Controlling Trade’ (1942), is outside the Federal Trade Commission, not the Department of Labor.</p></blockquote>\n<p>I think if you’re willing to correct the spelling of one vowel in somebody’s middle name or the location of a statue of a rambunctious horse, you should be willing to correct the erroneous statement, “Researchers find that female-named hurricanes kill about twice as many people as similar male-named hurricanes because some people underestimate them,” or various erroneous <a href=\"https://statmodeling.stat.columbia.edu/2014/04/03/boldest-experiment-journalism-history-admit-made-mistake/\">economic</a> and <a href=\"https://statmodeling.stat.columbia.edu/2013/02/20/my-beef-with-brooks-the-alternative-to-good-statistics-is-not-no-statistics-its-bad-statistics/\">education</a> statistics. Again, outside the <a href=\"https://statmodeling.stat.columbia.edu/2014/05/18/never-back-culture-poverty-culture-journalism/\">code of the street</a>, there should be no shame in issuing a correction. We all make mistakes, dude.</p></blockquote>\n<p>In comments, Keith Ellis <a href=\"https://statmodeling.stat.columbia.edu/2014/06/21/race-top-nyt-columnists-edition/#comment-174523\">wrote</a>:</p>\n<blockquote><p>One thing that you didn’t mention in your earlier post is that it’s not just that pundits have very strong incentives to maintain an illusion of infallibility, it’s also the case that people generally process information about a source’s reliability asymmetrically and this means that maintaining credibility is extremely fragile.</p>\n<p>Specifically, people will more strongly recall, and weight, that someone has been proven wrong than that they’ve been proven right. Furthermore, a single admission of error will disproportionately damage someone’s credibility, and particularly so, because a) this negative information is seen as especially important, b) the admission of error removes all ambiguity about whether an error was made, and c) because such admissions are rare, they are especially memorable.</p>\n<p>It’s difficult to overstate how much various intellectual subcultures combat this natural tendency by turning it on its head and seeing a willingness to admit error as a necessary prerequisite to the discovery of truth, socratic-like. But those of us who have strong affiliations with such cultures — say, in academia or science — will correspondingly be somewhat naive about how strong the opposing natural tendency is elsewhere.</p>\n<p>And while the natural tendency is strong generally, it’s especially and arguably maximally strong at the nexus of opinion journalism and politics. As you discuss in your prior post, this is a subculture where there is everything to lose by admitting error. . . .</p>\n<p>For Brooks or Kristof to admit to a non-trivial error, as you suggest they do, would be for their admissions to immediately become high-profile fodder for their critics. And not just then, but forever more — a link to the admission, a quote of it, will be repeated at any occasion when a club to use against their credibility is wanted. But more to the point, such a club will work. It will work because people strongly recall that someone was proven wrong about something and especially they recall when someone admitted to it and, finally, they weight that information very heavily when evaluating credibility.</p></blockquote>\n<p>On the plus side, they have no problem correcting misspellings of people&#8217;s middle names and locations of horse statues.</p></blockquote>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/24/funny-nyt-corrections/feed/",
  "slash:comments": 4
}