{
  "title": "Uyghur doctor jailed for treating a ‘terrorist’ dies after release from prison",
  "description": "Another detained Uyghur also dies shortly after his release from jail.",
  "link": "https://www.rfa.org/english/news/uyghur/tudahun-nurehmet-11032022185154.html",
  "guid": "https://www.rfa.org/english/news/uyghur/tudahun-nurehmet-11032022185154.html",
  "author": "By Shohret Hoshur for RFA Uyghur",
  "media:content": {
    "media:description": "Tudahun Nurehmet, former chief of the Achatagh Hospital in Uchturpan county,  Aksu prefecture, in northwestern China's Xinjiang region, in an undated photo.",
    "media:credit": "Citizen journalist"
  },
  "content:encoded": "\n        <p><span style=\"font-weight: 400;\">A Uyghur doctor sentenced to eight years in prison in China’s northwestern Xinjiang region for removing a bullet from the foot of a suspected criminal, died shortly after being released from prison in September, local police and people with knowledge of the situation said.</span></p>\n<p><span style=\"font-weight: 400;\">Tudahun Nurehmet, also known by the surname Mahmud, was the former chief of the Achatagh Hospital in Uchturpan (in Chinese, Wushi) county, Aksu (Akesu) prefecture. </span></p>\n<p><span style=\"font-weight: 400;\">In 2013, he was sentenced for treating a person Chinese authorities identified as a terrorist who was wounded during a clash in Aksu's Aykol (Ayikule) township in August of that year.</span></p>\n<p><span style=\"font-weight: 400;\">On that day, a brawl between Muslim Uyghurs and police broke out during a security check of a mosque on the eve of the Eid al-Fitr Islamic festival marks the end of the month-long dawn-to-sunset fasting of Ramadan. </span></p>\n<p><span style=\"font-weight: 400;\">During the altercation, police fired at unarmed people, killing three Uyghurs and wounding 20 others, RFA </span><a href=\"https://www.rfa.org/english/news/uyghur/clashes-08102013000244.html\" rel=\"noopener\" target=\"_blank\"><span style=\"font-weight: 400;\">reported</span></a><span style=\"font-weight: 400;\">. Those who were wounded  either were taken to the hospital or left the area and sought treatment on their own, according to a policeman who was at the scene.</span></p>\n<p><span style=\"font-weight: 400;\">It was at one of these hospitals that Tudahun apparently treated one of the wounded, fulfilling his role as a doctor – which later got him arrested and sentenced to eight years in prison because the patient was identified as a terrorist. </span></p>\n<p><b>Kidney disease in prison</b></p>\n<p><span style=\"font-weight: 400;\">Tudahun was released to his family because of his deteriorating health and died of kidney complications on Sept. 18, according to a person named “Nurxenim Uyghur” who </span><a href=\"https://www.facebook.com/nur.uyghur.7/videos/517788666528461\"><span style=\"font-weight: 400;\">posts</span></a><span style=\"font-weight: 400;\"> information about the deaths of Uyghurs in Xinjiang on Facebook.</span></p>\n<p><span style=\"font-weight: 400;\">A police officer in the town of Achatagh said Tudahun served his sentence in Urumqi’s No. 6 prison, though he did not have information about the physician’s death.</span></p>\n<p><span style=\"font-weight: 400;\">A village policeman from Achatagh said Tudahun, the father of two children, was released one year ago and had a severe kidney problem and could not walk. He was healthy before his arrest and died due to a kidney disease that developed during his prison time, the police officer said.</span></p>\n<p><span style=\"font-weight: 400;\">A second village police officer from the area told RFA that Tudahun was accused of protecting “a crime suspect” because he treated that person’s wound, but he could not provide the suspect’s name or the place where he received medical care.</span></p>\n<p><span style=\"font-weight: 400;\">“They did not tell us whom he treated,” he said. “It was due to an incident that took place on Eid day.“</span></p>\n<p><span style=\"font-weight: 400;\">Tudahun “was taken away on the third day of Eid,” the village policeman said. “I don’t know if the wounded people came to the hospital or if he went to treat them. I heard he treated ‘the terrorists’ and was therefore accused of aiding them.”</span></p>\n<p><span style=\"font-weight: 400;\">A village Communist Party secretary in Achatagh said Tudahun was sentenced to eight years for removing a bullet from the foot of a wounded suspect involved in the “August 8th incident” in Aksu, referring to the deadly clashes.</span></p>\n<p><span style=\"font-weight: 400;\">“He was arrested because he hid the situation of a person who got shot, and he treated him,” he said.</span></p>\n<p><span style=\"font-weight: 400;\">But he said Tudahun was a very skilled physician who treated patients from other towns and villages.</span></p>\n<p><span style=\"font-weight: 400;\">The party secretary said Tudahun treated the suspect on the day the incident occurred, and when the suspect was arrested on the second day, he exposed Tudahun, and police subsequently arrested the doctor. </span></p>\n<p><span style=\"font-weight: 400;\">“He was taken from his home,” the secretary said.</span></p>\n<p><span style=\"font-weight: 400;\">As for the suspect,</span> <span style=\"font-weight: 400;\">he left after receiving medical treatment and was later arrested at another location. </span></p>\n<p><b>Another death after release</b></p>\n<p><span style=\"font-weight: 400;\">In a similar case of an Uyghur individual dying after being released from prison, 27-year-old Alimjan Abdureshit from the town of Toqquzaq (Tuokezhake) in Kashgar (Kashi) prefecture, died on Oct. 2, about 40 days after his release from a prison or an internment camp, according to the same the Facebook page of “Nurxenim Uyghur.”</span></p>\n<p><span style=\"font-weight: 400;\">He was detained for five years for participating in “illegal religious activities.”</span></p>\n<p><span style=\"font-weight: 400;\">A staffer at a neighborhood committee in Kashgar Yengisheher (Shule) county told RFA that police took away the body of Abdurishit, who died from a combination of illness and starvation during a recent coronavirus lockdown there.</span></p>\n<p><span style=\"font-weight: 400;\">RFA </span><a href=\"https://www.rfa.org/english/news/uyghur/ritual-burials-11022022133359.html\" rel=\"noopener\" target=\"_blank\"><span style=\"font-weight: 400;\">reported</span></a><span style=\"font-weight: 400;\"> earlier that authorities in Xinjiang have been collecting the bodies of deceased Uyghurs, many of whom died of starvation or lack of medical treatment during lockdowns, without informing their relatives whether their corpses would be handled according to Islamic burial rituals.</span></p>\n<p><span style=\"font-weight: 400;\">Abdureshit lived in downtown Toqquzaq when police took the former school security guard to the internment camp in 2017, said an expatriate from the county who has knowledge of the situation.</span></p>\n<p><span style=\"font-weight: 400;\">A neighborhood committee staffer in Kashgar Yengisheher said authorities took Abdurishit away to receive so-called “education” while he was working at a middle school. </span></p>\n<p><span style=\"font-weight: 400;\">Abdureshit was healthy before his detainment, he said, though he did not know if the young man had been ill when he was released or if he died because of starvation during the lockdown.</span></p>\n<p><b><i>Translated by RFA Uyghur. Reported in English by Roseanne Gerin.</i></b></p>\n        ",
  "pubDate": "Thu, 03 Nov 2022 19:05:00 -0400"
}