{
  "title": "Why We Never Try To Time The Market",
  "pubDate": "Fri, 25 Feb 2022 21:01:01 +0000",
  "guid": "5374e820-9d44-4bd8-ab8c-8a827f7f5f27",
  "link": "https://fool.libsyn.com/why-we-never-try-to-time-the-market",
  "itunes:image": "",
  "description": "<p>A sudden upswing for stocks late in the week is only the latest reminder of why it's a bad idea to try and time the market. (0:40) Jason Moser and Ron Gross share data that proves staying in the market is much more efficient (and lucrative) for investors than jumping in and out, and discuss:<br aria-hidden=\"true\" /> - Etsy increasing their seller transaction fee<br aria-hidden= \"true\" /> - Block's transaction revenue growth<br aria-hidden=\"true\" /> - Home Depot and Lowe's getting different reactions from similar 4th-quarter reports<br aria-hidden=\"true\" /> - The latest from Beyond Meat, Mercadolibre, Fulgent Genetics, and Booking Holdings<br aria-hidden=\"true\" /> <br aria-hidden=\"true\" /> (19:20) Chief Investment Officer Andy Cross talks with Jeff Green, CEO of The Trade Desk.<br aria-hidden=\"true\" /> <br aria-hidden=\"true\" /> (32:00) Jason and Ron answer a listener's question about how to build a portfolio. Jason's radar stock is Zoom Video and Ron unveils his \"Resilient Basket\" of stocks! (Costco, Disney, Domino's Pizza, Home Depot, Microsoft, Target)<br aria-hidden=\"true\" /> <br aria-hidden=\"true\" /> Got a question about stocks, industries, or trends?<br aria-hidden= \"true\" /> Drop as an email podcasts@fool.com<br aria-hidden=\"true\" /> <br aria-hidden=\"true\" /> Stocks discussed: ETSY, SQ, HD, LOW, BYND, MELI, FLGT, BKNG, TTD, ZM, COST, DIS, DPZ, MSFT, TGT<br aria-hidden=\"true\" /> <br aria-hidden=\"true\" /> Host: Chris Hill<br aria-hidden=\"true\" /> Guests: Jason Moser, Ron Gross, Andy Cross, Jeff Green<br aria-hidden=\"true\" /> Engineer: Rick Engdahl, Austin Morgan</p>",
  "content:encoded": "<p>A sudden upswing for stocks late in the week is only the latest reminder of why it's a bad idea to try and time the market. (0:40) Jason Moser and Ron Gross share data that proves staying in the market is much more efficient (and lucrative) for investors than jumping in and out, and discuss: - Etsy increasing their seller transaction fee - Block's transaction revenue growth - Home Depot and Lowe's getting different reactions from similar 4th-quarter reports - The latest from Beyond Meat, Mercadolibre, Fulgent Genetics, and Booking Holdings  (19:20) Chief Investment Officer Andy Cross talks with Jeff Green, CEO of The Trade Desk.  (32:00) Jason and Ron answer a listener's question about how to build a portfolio. Jason's radar stock is Zoom Video and Ron unveils his \"Resilient Basket\" of stocks! (Costco, Disney, Domino's Pizza, Home Depot, Microsoft, Target)  Got a question about stocks, industries, or trends? Drop as an email podcasts@fool.com  Stocks discussed: ETSY, SQ, HD, LOW, BYND, MELI, FLGT, BKNG, TTD, ZM, COST, DIS, DPZ, MSFT, TGT  Host: Chris Hill Guests: Jason Moser, Ron Gross, Andy Cross, Jeff Green Engineer: Rick Engdahl, Austin Morgan</p>",
  "enclosure": "",
  "itunes:duration": "39:28",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "A sudden upswing for stocks late in the week is only the latest reminder of why it's a bad idea to try and time the market. (0:40) Jason Moser and Ron Gross share data that proves staying in the market is much more efficient (and lucrative) for...",
  "itunes:episodeType": "full"
}