{
  "title": "How we build with and for people with disabilities",
  "link": "https://blog.google/outreach-initiatives/accessibility/building-with-the-disability-community-2022/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"cud06\"><i>Editor’s note: Today is Global Accessibility Awareness Day. We’re also sharing how we’re making</i> <a href=\"https://blog.google/outreach-initiatives/education/global-accessibility-awareness-day--2022/\"><i>education more accessible</i></a><i>and launching a new</i><a href=\"http://blog.google/products/android/braille-display-talkback\"><i>Android accessibility feature</i></a><i>.</i></p><p data-block-key=\"8k3s1\">Over the past nine years, my job has focused on building accessible products and supporting Googlers with disabilities. Along the way, I’ve been constantly reminded of how vast and diverse the disability community is, and how important it is to continue working alongside this community to build technology and solutions that are truly helpful.</p><p data-block-key=\"5vor3\">Before delving into some of the accessibility features our teams have been building, I want to share how we’re working to be more inclusive of people with disabilities to create more accessible tools overall.</p><h3 data-block-key=\"25bkr\">Nothing about us, without us</h3><p data-block-key=\"6qeth\">In the disability community, people often say “nothing about us without us.” It’s a sentiment that I find sums up what disability inclusion means. The types of barriers that people with disabilities face in society vary depending on who they are, where they live and what resources they have access to. No one’s experience is universal. That’s why it’s essential to include a wide array of people with disabilities at every stage of the development process for any of our accessibility products, initiatives or programs.</p><p data-block-key=\"42s00\">We need to work to make sure our teams at Google are reflective of the people we’re building for. To do so, last year we launched our <a href=\"https://careers.google.com/programs/people-with-disabilities/\">hiring site</a> geared toward people with disabilities — including our <a href=\"https://cloud.google.com/blog/topics/inside-google-cloud/google-cloud-launches-a-career-program-for-people-with-autism\">Autism Career Program</a> to further grow and strengthen our autistic community. Most recently, we helped launch the <a href=\"https://ndcc.simplifyhire.com/\">Neurodiversity Career Connector</a> along with other companies to create a job portal that connects neurodiverse candidates to companies that are committed to hiring more inclusively.</p><p data-block-key=\"1snbm\">Beyond our internal communities, we also must partner with communities outside of Google so we can learn what is truly useful to different groups and parlay that understanding into the improvement of current products or the creation of new ones. Those partnerships have resulted in the creation of <a href=\"https://blog.google/outreach-initiatives/accessibility/project-relate/\">Project Relate</a>, a communication tool for people with speech impairments, the development of a <a href=\"https://blog.google/products/android/all-new-talkback/\">completely new TalkBack</a>, Android’s built-in screen reader, and the <a href=\"https://blog.google/products/chromebooks/accessibility-features/\">improvement of Select-to-Speak</a>, a Chromebook tool that lets you hear selected text on your screen spoken out loud.</p><h3 data-block-key=\"bbkoo\">Equitable experiences for everyone</h3><p data-block-key=\"de84m\">Engaging and listening to these communities — inside and outside of Google — make it possible to create tools and features like the ones we’re sharing today.</p><p data-block-key=\"23bpj\">The ability to add alt-text, which is a short description of an image that is read aloud by screen readers, directly to images sent through Gmail starts rolling out today. With this update, people who use screen readers will know what’s being sent to them, whether it’s a GIF celebrating the end of the week or a screenshot of an important graph.</p><p data-block-key=\"mqmf\">Communication tools that are inclusive of everyone are especially important as teams have shifted to fully virtual or hybrid meetings. Again, everyone experiences these changes differently. We’ve heard from some people who are deaf or hard of hearing, that this shift has made it easier to identify who is speaking — something that is often more difficult in person. But, in the case of people who use ASL, we’ve heard that it can be difficult to be in a virtual meeting and simultaneously see their interpreter and the person speaking to them.</p><p data-block-key=\"es5r9\">Multi-pin, a new feature in Google Meet, helps solve this. Now you can pin multiple video tiles at once, for example, the presenter’s screen and the interpreter’s screen. And like many accessibility features, the usefulness extends beyond people with disabilities. The next time someone is watching a panel and wants to pin multiple people to the screen, this feature makes that possible.</p><p data-block-key=\"5quel\">We've also been working to make video content more accessible to those who are blind or low-vision through audio descriptions that describe verbally what is on the screen visually. All of our English language YouTube Originals content from the past year — and moving forward — will now have English audio descriptions available globally. To turn on the audio description track, at the bottom right of the video player, click on “Settings”, select “Audio track”, and choose “English descriptive”.</p><p data-block-key=\"ec428\">For many people with speech impairments, being understood by the technology that powers tools like voice typing or virtual assistants can be difficult. In 2019, we started work to change that through Project Euphonia, a research initiative that works with community organizations and people with speech impairments to create more inclusive speech recognition models. Today, we’re expanding Project Euphonia’s research to include four more languages: <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSfroo5csa5ZZsx9ysjS8vO9BihmV6SLnKUCNNKdA8oSgt6zWQ/viewform\">French</a>, <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSeBFmyc9hkc7e6Llm0-2VRIpz5j7iu5Rwfpxg-F_8IvuQMwDg/viewform\">Hindi</a>, <a href=\"https://docs.google.com/forms/d/e/1FAIpQLScSEbxXZsfZbIUNmm0TlkWvF3C_gPcpucTzGm36TsBSCLV3oA/viewform?resourcekey=0-quzTBS9bMQ2zL5fXh3IjDA\">Japanese</a> and <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSc9tkmL5VwSP88nGHULo6NauivSLgEBxgR3vO9knc1P4cvsUA/viewform?resourcekey=0-nNMgUv0K876UAOCbu7i2zw\">Spanish</a>. With this expansion, we can create even more helpful technology for more people — no matter where they are or what language they speak.</p><p data-block-key=\"d465g\">I’ve learned so much in my time working in this space and among the things I’ve learned is the absolute importance of building right alongside the very people who will most use these tools in the end. We’ll continue to do that as we work to create a more inclusive and accessible world, both physically and digitally.</p></div></div></body></html>",
  "pubDate": "Thu, 19 May 2022 13:00:00 +0000",
  "guid": "https://blog.google/outreach-initiatives/accessibility/building-with-the-disability-community-2022/",
  "category": [
    "Accessibility",
    "Gmail",
    "YouTube",
    "AI"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "How we build with and for people with disabilities",
    "description": "",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/hero-blue.max-600x600.png",
    "site_name": "Google",
    "url": "https://blog.google/outreach-initiatives/accessibility/building-with-the-disability-community-2022/"
  },
  "author": {
    "name": "Eve Andersson",
    "title": "Senior Director, Product Inclusion, Equity, and Accessibility",
    "department": "",
    "company": ""
  }
}