{
  "title": "What If NCAA Basketball Players Were Paid? - An Analysis",
  "description": "<!--kg-card-begin: markdown--><p>Every year around this time, after the conclusion of the collegiate football season and the height of March Madness the question I always hear posed is, should NCAA athletes be paid? This got me thinking, if student athletes <i>were</i> to be paid how much would they be worth? Since we</p>",
  "link": "https://www.danielforsyth.me/what-if-ncaa-basketball-players-were-paid-an-analysis/",
  "guid": "5d24af011e693a0017f5e5ef",
  "category": [
    "Python",
    "Machine Learning",
    "Pandas",
    "Sports"
  ],
  "dc:creator": "Daniel Forsyth",
  "pubDate": "Wed, 26 Mar 2014 12:39:39 GMT",
  "content:encoded": "<!--kg-card-begin: markdown--><p>Every year around this time, after the conclusion of the collegiate football season and the height of March Madness the question I always hear posed is, should NCAA athletes be paid? This got me thinking, if student athletes <i>were</i> to be paid how much would they be worth? Since we are in the middle of the annual NCAA basketball tournament I chose to work with basketball data in an attempt to answer this question.</p>\n<p><img src=\"https://www.danielforsyth.me/content/images/2014/Mar/ncaa.jpg\" alt loading=\"lazy\"></p>\n<br>\nMy first order of business was to find a statistic that expresses a players overall contributions, A tell all stat that pools everything a player does on the court into one number. After some reading I came across the Player Efficency Rating or PER, which is exactly what I was looking for. Developed by John Hollinger, current Vice President of basketball operations for the Memphis Grizzlies, the player efficeny rating measures a players per-minute performance on the court adjusted for pace. PER takes into account both positive and negative contributions by the player, it is than adjusted to a per-minute basis so that every player, whether it be a starter or a sixth-man, can be compared equally. At this point my game plan become to find current NBA data that included PER and Salary, create a predictive model using this data, then feed it in current NCAA PER stayts to predi players salary.\n<p>After downloading some data from <a href=\"http://www.basketball-reference.com/\"> basketball-reference.com</a> I opened up ipython and began looking at the data.</p>\n<p><img src=\"https://www.danielforsyth.me/content/images/2014/Mar/Screen_Shot_2014_03_25_at_11_51_26_PM.png\" alt loading=\"lazy\"></p>\n<p>I was only interested in the Player Name and current year salary.</p>\n<p><img src=\"https://www.danielforsyth.me/content/images/2014/Mar/Screen_Shot_2014_03_25_at_11_55_49_PM.png\" alt loading=\"lazy\"></p>\n<p>Load Data that includes player efficency rating.</p>\n<p><img src=\"https://www.danielforsyth.me/content/images/2014/Mar/Screen_Shot_2014_03_25_at_11_57_05_PM.png\" alt loading=\"lazy\"></p>\n<p>Add a column for minutes per game, to qualify for PER you must have a minimum of 6.09 MPG.</p>\n<p><img src=\"https://www.danielforsyth.me/content/images/2014/Mar/Screen_Shot_2014_03_25_at_11_57_57_PM.png\" alt loading=\"lazy\"></p>\n<p>Merge PER and salary data into one table, then display only qualified players and remove and duplicate entries.</p>\n<p><img src=\"https://www.danielforsyth.me/content/images/2014/Mar/Screen_Shot_2014_03_26_at_12_01_21_AM.png\" alt loading=\"lazy\"></p>\n<p>Now that we have all of the data cleaned and in the proper format we can begin plotting it and working on making predictions. Below I have created a scatter plot of the PER and Salary data.</p>\n<p><img src=\"https://www.danielforsyth.me/content/images/2014/Mar/Screen_Shot_2014_03_26_at_12_07_42_AM.png\" alt loading=\"lazy\"></p>\n<p>To further visualize the data I created a scatter plot matrix of the Salary, PER, and MPG.</p>\n<p><img src=\"https://www.danielforsyth.me/content/images/2014/Mar/Screen_Shot_2014_03_26_at_12_11_41_AM.png\" alt loading=\"lazy\"></p>\n<p><img src=\"https://www.danielforsyth.me/content/images/2014/Mar/Screen_Shot_2014_03_26_at_12_11_56_AM.png\" alt loading=\"lazy\"></p>\n<p>Time to make some predictions on the data, the first step in this process was creating a model with the NBA data. I went with a simple Linear Regression classifier as we are looking to predict a continious target variable.</p>\n<p><img src=\"https://www.danielforsyth.me/content/images/2014/Mar/Screen_Shot_2014_03_26_at_12_19_15_AM.png\" alt loading=\"lazy\"></p>\n<p><img src=\"https://www.danielforsyth.me/content/images/2014/Mar/Screen_Shot_2014_03_26_at_12_19_39_AM.png\" alt loading=\"lazy\"></p>\n<p>Testing the classifier on a random PER.</p>\n<p><img src=\"https://www.danielforsyth.me/content/images/2014/Mar/Screen_Shot_2014_03_26_at_12_20_29_AM.png\" alt loading=\"lazy\"></p>\n<p>At this point it was time to show the model some data from NCAA players. I was able to scrape the PER ratings of the top 100 NCAA players from this current season off of ESPN.com. The following code displays this data.</p>\n<p><img src=\"https://www.danielforsyth.me/content/images/2014/Mar/Screen_Shot_2014_03_26_at_12_23_12_AM.png\" alt loading=\"lazy\"></p>\n<p>I then created a list of predicted salary based on the players PER rating and then added it into the data frame.</p>\n<p><img src=\"https://www.danielforsyth.me/content/images/2014/Mar/Screen_Shot_2014_03_26_at_12_24_53_AM.png\" alt loading=\"lazy\"></p>\n<p>The dataframe below shows the top 15 players based on PER and their predicted salary.</p>\n<p><img src=\"https://www.danielforsyth.me/content/images/2014/Mar/Screen_Shot_2014_03_26_at_12_27_06_AM.png\" alt loading=\"lazy\"></p>\n<p>In the future it would be interesting to apply this approach to previous seasons data and then compare the predicted salary to the actual salary of players that were drafted into the NBA. I would also be curious to see how players with very high player efficeny ratings in college fared when they made the move to the pros, especially those playing in less competitive conferences.</p>\n<p>The complete notebook is available <a href=\"http://nbviewer.ipython.org/github/danielforsyth/NCAA-Salary-Prediction/blob/master/NCAA.ipynb\">here</a> and all of the code is on my <a href=\"https://github.com/danielforsyth/NCAA-Salary-Prediction\">github</a>. As always I would appreciate any feedback, advice, or corrections. You can find me on <a href=\"https://twitter.com/Daniel_Forsyth1\">Twitter</a>  or email me at <a href=\"mailto:danforsyth1@gmail.com\">danforsyth1@gmail.com</a>.</p>\n<!--kg-card-end: markdown-->"
}