{
  "title": "S14 Ep86: Was The Apostle Paul ,The Antichrist?!",
  "link": "https://audioboom.com/posts/8098544",
  "itunes:episode": 86,
  "itunes:title": "Was The Apostle Paul ,The Antichrist?!",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 7526,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "(Encore Presentation)  Exorcist, and Author Jeffrey Daugherty joins BEYOND the DARKNESS to talk about the rise in demonic ranks, these reason for such gaining numbers, what demons really are, and then Jeffrey breaks down his theory as to what he believes Satan and the Antichrist really are! <br>\n<br>\nJeffrey Daugherty's Website:   <a href=\"https://jeffreydaugherty.com/\">https://jeffreydaugherty.com/</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nAre you playing along with Beyond the Darkness on the Podcast One/ <a href=\"http://Betonline.AG\">Betonline.AG</a> Sportsnet Challenge?!  Each Week Dave and Tim are picking the winners of five NFL gam,es and playing against the hosts of different Podcast One shows!  If you play aloing with Dave and Tim on <a href=\"http://BetOnline.AG\">BetOnline.AG</a>, and they win the week, you qualify to be one of five winners splitting a $500 weekly prize! To sign up go to <a href=\"https://promotions.betonline.ag/podcastone\">https://promotions.betonline.ag/podcastone</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.<br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !",
  "itunes:summary": "(Encore Presentation)  Exorcist, and Author Jeffrey Daugherty joins BEYOND the DARKNESS to talk about the rise in demonic ranks, these reason for such gaining numbers, what demons really are, and then Jeffrey breaks down his theory as to...",
  "pubDate": "Mon, 21 Oct 2019 05:00:00 +0000",
  "guid": "5caaad9a-2473-4202-8c88-68012a4c48d5",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}