{
  "title": "How We Priced Our Book With An Experiment",
  "link": "",
  "updated": "2015-05-27T00:00:00-07:00",
  "id": "http://carlshan.com/2015/05/27/dsh-experiment",
  "content": "<h1 id=\"how-we-priced-our-book-with-an-experiment\">How We Priced Our Book With An Experiment</h1>\n\n<p class=\"meta\">27 May 2015 - Chicago</p>\n\n<p><em>Summary: We conducted a large experiment to test pricing strategies for our book and came to some very surprising findings about allowing customers to pay what they wanted.</em></p>\n\n<p><em>Specifically, we found strong evidence that we should let customers pay what they want, which would help us earn more money and more readers when compared with traditional pricing models. We hope our findings can inspire other authors, musicians and creators to look into pay-what-you-want pricing and run experiments of their own.</em></p>\n\n<p><em>To get automatically notified about new posts, you can subscribe by <a href=\"https://carlshan.wufoo.com/forms/join-other-readers/\">clicking here</a>. You can also subscribe via <a href=\"http://feeds.feedburner.com/carlshan\">RSS</a> to this blog to get updates.</em></p>\n\n<hr />\n\n<h2 id=\"introduction-pay-what-you-want\">Introduction: Pay What You Want?</h2>\n<p>My co-authors (Henry Wang, William Chen, Max Song) and I have been working on our book, The Data Science Handbook, for over a year now. Shortly before launch, we asked ourselves an important question that many authors face: how much should we charge for our book?</p>\n\n<p>We had heard of Pay-What-You-Want (PWYW) models, where readers can purchase the book for any amount they want (or at least above a threshold you set). However, many authors and creators worry that only a small percentage of people will contribute in a PWYW pricing model, and that these contributors will opt for meager amounts in the $1-$5 range.</p>\n\n<p>On the other hand, we also felt that PWYW was an exciting model to try. A PWYW model would allow us to get the book out to as many people as possible without putting the book behind a paywall. We also had an inkling that this experimental pricing model would increase exposure for our book.</p>\n\n<p>So we set out to answer this simple question: <strong>how should we price our book?</strong></p>\n\n<p>As practicing statisticians and data scientists, we thought of no better way to decide this than to run a large-scale experiment. The following section details exactly what we tested and discovered.</p>\n\n<h2 id=\"tldr---letting-customers-pay-what-they-want-wins-the-day\">TL;DR - Letting Customers Pay What They Want Wins the Day</h2>\n<p>We experimented with 7 different pricing models pre-launch, with our subscriber base of 5,700 people. In these 7 different models, we compared different pricing schemes, including fixed prices at $19 and $29, along with several Pay What You Want (PWYW) models with varying minimum amounts and suggested price points.</p>\n\n<p>Before the experiment began, we had agreed to choose whichever variant maximized the two things we cared about: the total number of readers and net revenue (later on, we’ll explain how we prioritized the two).</p>\n\n<p>Before conducting the experiment, we thought that setting a fixed price at $29, like a traditional book, would lead to the maximum revenue.</p>\n\n<p>After we analyzed our results, to our surprise, we discovered strong statistical evidence that <strong>with a PWYW model for our book, we could significantly expand our readership (by 4x!) while earning at least as much revenue (and potentially even more) as either of the fixed-priced variants.</strong></p>\n\n<h2 id=\"the-prices-we-tested-setting-up-our-experiment\">The Prices We Tested: Setting Up Our Experiment</h2>\n<p><em>On notation: throughout this post, PWYW models will be described as (Minimum Price/Suggested Price). Example. ($0/$19) means ($0 Minimum Price, $19 Suggested Price).</em></p>\n\n<p>Through a sign-up page on our website, we’ve been continuously gathering email addresses of individuals interested in our book throughout the process of promoting the Data Science Handbook.</p>\n\n<p>We conducted this pricing experiment before the official launch of the book by letting our 5,700 subscribers pre-order a special early release of the book. The following diagram shows our experimental setup:</p>\n\n<p>-&gt;<img src=\"/images/experiment-setup.png\" alt=\"experiment setup\" />&lt;-</p>\n\n<p>We started the early release pre-order process on Monday, April 20th. We stopped the pre-orders one week later, so that we could analyze our results.</p>\n\n<p>Through Gumroad, we tracked data on the number of people who landed on each link, whether they purchased, and how much they chose to pay.</p>\n\n<p>Note: To guard against people buying the book who were not originally assigned to that bucket (for example, those who inadvertently stumbled across our links online), we filtered out all email addresses that purchased a book through a variant that they were not explicitly assigned to. This gave us more confidence in the rigor of our statistical analyses.</p>\n\n<h2 id=\"what-we-found-experiment-results\">What We Found: Experiment Results</h2>\n\n<p>The roughly 800 users in each of our experimental buckets went through a funnel, where they clicked through the email to visit the purchase page, and then decided whether or not to purchase. We collected data on user behavior in this funnel, as well as the price they paid.</p>\n\n<p>-&gt;<img src=\"/images/funnel.png\" alt=\"conversion funnel\" />&lt;-</p>\n\n<p>For each of the experimental variants, we collected data on 6 key metrics:</p>\n\n<ul>\n  <li>Email CTR - # of people who clicked through to the purchase page / # of people who received the email. The emails were identical, minus the link and a short section about the price.</li>\n  <li>Conversion Rate - # of purchases / # of people who clicked through to the purchase page</li>\n  <li>Total Sales - # of sales, regardless of whether a reader paid $0 or $100</li>\n  <li>Net Revenue - Total revenue generated, minus fees from Gumroad</li>\n  <li>Mean Sales Price - Average sales price that people paid</li>\n  <li>Max Sales Price - Largest sales price paid in that bucket</li>\n</ul>\n\n<p>Below, you’ll see some plots on how each pricing variant performed on each metric. Each of the seven circles represents a different pricing variant, with the area of the circle being proportional to the magnitude it represents. The larger the circle, the “better” that pricing variant did in terms of our metrics.</p>\n\n<p>The blue circles are the variants that were fixed at $19 and $29. The orange circles are the PWYW variants.</p>\n\n<p>The X-axis of the following plots describes the minimum prices we offered: free, $10, $19 (this was a fixed price), $20 and $29 (also fixed). The Y-axes are the prices we suggested when we were using a PWYW variant: $19 and $29.</p>\n\n<p>-&gt;<img src=\"/images/pwyw-vs-fixed.jpg\" alt=\"pwyw vs fixed\" />&lt;-</p>\n\n<p>-&gt;<img src=\"/images/metric-plots.png\" alt=\"plots\" />&lt;-</p>\n\n<p>Looking above, it’s no surprise at a PWYW model of ($0/$19) had the highest conversion rate  (upper right plot), and as a result the greatest number of people who downloaded the book . After all, you can get it for free!</p>\n\n<p>Much to our surprise, many of our readers who got this variant paid much more than $0. In fact, as you can see above in the “Mean Sales Price” plot in the bottom left corner, our average purchase price was about $9. Some readers even paid $30.</p>\n\n<p>To examine the distribution of payments we received for each variant, we also examined the histogram of payments for each of the 5 PWYW variants:</p>\n\n<p>-&gt;<img src=\"/images/sales-distribution.png\" alt=\"sales distribution\" />&lt;-</p>\n\n<p>It’s again no surprise to see a large chunk of purchases at the minimum. However, you can also see fairly sizable clumps of readers who pay amounts around $5, $10, $15 and $20 (and even some who paid in the $30-$50 range).</p>\n\n<p>In fact, readers seemed to like paying amounts that were multiples of $5, perhaps because it represented a nice round number.</p>\n<h2 id=\"surprising-insights-on-pay-what-you-want\">Surprising Insights on Pay What You Want</h2>\n<h3 id=\"you-can-earn-as-much-from-a-pwyw-model-and-possibly-more-as-from-a-fixed-price-model\">You Can Earn As Much from a PWYW model (and possibly more) as from a Fixed Price model</h3>\n<p>Traditional advice told us that we should price our book at a high, fixed price point, since people interested in advancing their careers will typically pay a premium for a book that helps them do exactly that.</p>\n\n<p><strong>However, our ($0/$19) variant was ranked second in total revenue generated (tying with a fixed price of $29).</strong></p>\n\n<p>-&gt;<img src=\"/images/net-revenue.png\" alt=\"net revenue\" />&lt;-</p>\n\n<p>In fact, if anything, the data lends credence to the belief that <strong>you can earn even more from PWYW than from setting a fixed price.</strong></p>\n\n<p>What do we mean by that?</p>\n\n<p>Well, our ($0/$19) variant actually made nearly twice as much money as fixing the price at $19. The difference in earnings was large, and is strong statistical evidence that our book would make more money if we made it free, and simply had a suggested price of $19, than if we had fixed the price at $19.[1]</p>\n\n<p>This was an incredible result, since it suggested that with a PWYW model, we could generate the same amount of revenue as a fixed price model, while attracting 3-4x more readership!</p>\n\n<h3 id=\"higher-suggested-price-didnt-translate-to-higher-average-payments-but\">Higher Suggested Price Didn’t Translate to Higher Average Payments. But…</h3>\n<p>The “suggested” price didn’t seem to have seem to have a large impact on the price people paid. Compare the mean purchase prices between $19 suggested and $29 suggested in both the $0 minimum variants and the $10 minimum variants.</p>\n\n<p>-&gt;<img src=\"/images/mean-sales.png\" alt=\"mean sales price\" />&lt;-</p>\n\n<p>As you can see, moving the suggested price from $19 to $29 in both cases increased average purchase price by only $1.</p>\n\n<p>However, we don’t mean to imply the suggested price had zero effect. In fact, <strong>the data lends support to actually having a lower suggested price.</strong></p>\n\n<p>You can look to see what happened to conversion rates when we changed the suggested price from $19 to $29. In both cases we tested ($0 minimum and $10 minimum), a lower suggested price had a higher conversion rate, and drove ultimately more revenue.[2]</p>\n\n<p>Therefore, it seems that even if the average sale is the same despite different suggested price, <em>total sales</em> increased when you have a lower suggested price. This is perhaps due to certain readers being turned off by a higher suggested price, even if they could get it for $0.</p>\n\n<p>Just imagine seeing a piece of chocolate being offered for free, but having a suggested price of $100. You might scoff at the absurdly high suggested price and refuse the candy, despite being able to take it for nothing.</p>\n\n<p>On the other hand, if you were offered the same scenario, but this time the free candy had a suggested price of just $0.25, you may see this as fair and be much more inclined to part with your quarter.</p>\n\n<h2 id=\"try-it-out-for-yourself\">Try It Out For Yourself</h2>\n<p>We think that all of these findings should spur authors and creators to conduct testing on their own product pricing. <a href=\"www.gumroad.com\">Gumroad</a>, our sales platform, makes it remarkably easy to create product variants, which you can email out to randomized batches of your followers. Or, you can use the suite of A/B testing tools to ensure that different visitors to your website receive different product links.</p>\n\n<p>By doing so, you may discover that you could reach a larger audience, while also earning higher revenue.</p>\n\n<p>[1] This result <em>just</em> missed the cutoff for statistical significance. The actual p-value comparing $0/$19 with a fixed $19 was 0.057, missing our threshold of 0.05 necessary to qualify as statistically significant. Nevertheless, the very low p-value is a strongly suggestive result in favor of a PWYW model.</p>\n\n<p>[2] Beyond being practically significant, this was also statistically significant with a p-value close to 0.</p>\n\n<hr />\n\n<p><em>If you want to be notified when my next article is published, subscribe by <a href=\"https://carlshan.wufoo.com/forms/join-other-readers/\">clicking here</a>.</em></p>"
}