{
  "published": "2022-11-03T18:00:00-04:00",
  "updated": "2022-11-03T18:00:00-04:00",
  "title": "A peace deal could end Ethiopia’s brutal civil war. Can a truce last?",
  "content": "<figure>\n      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/sya1ImZ9n6bR93wT6nU83TiMFyc=/113x0:2197x1563/1310x983/cdn.vox-cdn.com/uploads/chorus_image/image/71581921/1244430182a.0.jpg\" />\n        <figcaption>Redwan Hussein, left, representing the Ethiopian government, and Getachew Reda, right, representing the Tigray People’s Liberation Front, sign a peace agreement after peace talks in Pretoria, South Africa, on November 2. | Phill Magakoe/AFP via Getty Images</figcaption>\n    </figure>\n\n  <p>A surprise deal announced Wednesday promises peace but doesn’t offer much detail.</p> <p id=\"1s7lPd\">One of the world’s current deadliest conflicts and worst humanitarian crises could be moving toward a close.</p>\n<p id=\"rNNdBJ\">On Wednesday, the Ethiopian federal government and the Tigrayan People’s Liberation Front (TPLF) came to <a href=\"https://www.reuters.com/world/africa/african-union-parties-ethiopia-conflict-have-agreed-cease-hostilities-2022-11-02/\">an agreement to permanently halt hostilities</a> in a civil war that has killed tens of thousands, <a href=\"https://www.unrefugees.org/news/ethiopia-s-tigray-refugee-crisis-explained/\">displaced millions</a>, pushed regions in the north to the brink of famine, and altered Ethiopia’s standing in the international community. </p>\n<p id=\"NYgVe2\">Though the announcement was an unexpected and welcome development in the two-year conflict, <a href=\"https://www.bbc.com/news/world-africa-63503615\">questions remain</a> — including whether all the involved parties will commit to the peace deal, the mechanisms for implementation, and the role of other armed actors, including the Eritrean government.</p>\n<p id=\"2AjpJg\">“The two parties in the Ethiopian conflict have formally agreed to the cessation of hostilities as well as to systematic, orderly, smooth, and coordinated disarmament,” Olusegun Obasanjo, a former president of Nigeria who now works to mediate conflicts in Africa, announced yesterday, almost two years exactly after hostilities initially broke out in November 2020.</p>\n<p id=\"IPvMhy\">The deal reportedly calls for the full disarmament of Tigray’s forces within 30 days, with leaders meeting within five days to sort details. Ethiopian forces will also take control of federal facilities and major infrastructure in Tigray. (Though the official deal hasn’t yet been made public, <a href=\"https://www.nytimes.com/2022/11/03/world/africa/ethiopia-tigray-civil-war-agreement.html\">multiple</a> <a href=\"https://abcnews.go.com/International/wireStory/ethiopia-peace-deal-silence-terms-tigray-92617217\">news outlets</a> on Thursday obtained a copy.)</p>\n<p id=\"gyKsjY\">Thursday, Ethiopian Prime Minister<strong> </strong>Abiy Ahmed <a href=\"https://abcnews.go.com/International/wireStory/ethiopia-peace-deal-silence-terms-tigray-92617217\">celebrated the deal</a>, saying, “Ethiopia’s peace proposal has been accepted 100 percent.” In a <a href=\"https://twitter.com/AbiyAhmedAli/status/1587869990006525953?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1587869990006525953%7Ctwgr%5E%7Ctwcon%5Es1_&amp;ref_url=about%3Asrcdoc\">statement on Twitter</a>, Abiy promised that his government’s commitment to peace “remains steadfast.”</p>\n<p id=\"hPLcAe\">The deal, the product of eight days of peace talks in <a href=\"https://www.britannica.com/place/Pretoria\">South Africa</a> between the two parties and alongside<strong> </strong>negotiators from the African Union like Obasanjo, surprised the world. </p>\n<p id=\"qCoH2E\">Though an internet and media blackout, imposed by Abiy’s government at the beginning of hostilities, has made verifying information in Tigray difficult if not impossible, tens of thousands are believed to have been killed in the fighting in Tigray, while hundreds of thousands have been displaced from Tigray and the neighboring Afar and Amhara regions, <a href=\"https://news.un.org/en/story/2022/10/1129572\">according to the United Nations</a>. Millions are in dire need of humanitarian assistance including food and medical care. </p>\n<p id=\"AAROfq\">And violence in northern Ethiopia’s Tigray region had continued in the runup to the talks, which made a resolution seem increasingly unlikely. A previous humanitarian ceasefire, <a href=\"https://www.state.gov/five-months-of-a-humanitarian-truce-in-ethiopia/\">brokered in March of this year</a>, <a href=\"https://www.aljazeera.com/news/2022/8/24/fighting-resumes-in-ethiopia-despite-truce-tigray-forces\">broke down in August</a>, and <a href=\"https://www.nytimes.com/2022/10/08/world/africa/ethiopia-tigray-war-talks-us.html\">American diplomatic efforts to stop the fighting</a> had failed by early September, <a href=\"https://www.nytimes.com/2022/10/08/world/africa/ethiopia-tigray-war-talks-us.html\">when violence in Tigray surged again</a>, with a particularly devastating impact on Tigrayan civilians. During that spate of fighting, around 500,000 people were forced from their homes; Ethiopian government forces hit a UN food truck and airstrikes hit a center for refugees near the border with Eritrea, killing at least 50 people, <a href=\"https://www.nytimes.com/2022/10/08/world/africa/ethiopia-tigray-war-talks-us.html\">the New York Times reported</a>. </p>\n<p id=\"Ky6qyh\">Details of the peace process are thus far scant; the TPLF has agreed to disarm and reintegrate into the federal government’s army and the government has promised to support humanitarian efforts, but other questions, such as the role of the Eritrean army, which has supported the Ethiopian forces, and other armed groups involved in the conflict haven’t yet been addressed. </p>\n<p id=\"XHOCQY\">Parts of the deal may be difficult to implement; regional experts <a href=\"https://www.nytimes.com/2022/11/03/world/africa/ethiopia-tigray-civil-war-agreement.html\">told the New York Times</a> that Tigrayan leaders might have trouble selling the disarmament portions of the reported agreement. Tigray’s lead negotiator, Getachew Reda, <a href=\"https://abcnews.go.com/International/wireStory/ethiopia-peace-deal-silence-terms-tigray-92617217\">noted that the deal contained</a> “painful concessions” for the Tigrayans, including handing over control of “all federal facilities, installations, and major infrastructure ... within the Tigray region” to the federal government.</p>\n<p id=\"cIYInu\">Obasanjo seemed to acknowledge the significant work yet to be done to ensure peace in Ethiopia. “This moment is not the end of the peace process,” he said Wednesday. “Implementation of the peace agreement signed today is critical for its success,” he added, although the mechanics of the implementation are still opaque. </p>\n<h3 id=\"VzrAeh\">The conflict has stopped, but the wounds are deep</h3>\n<p id=\"qXyOz5\">The <a href=\"https://www.cfr.org/global-conflict-tracker/conflict/conflict-ethiopia\">conflict in Tigray</a> began in November 2020, after two years of tension between Tigrayan leadership and Prime Minister Abiy Ahmed, who was elected to his office in 2018 after nearly 30 years of Tigrayan political dominance. Though Tigrayans are a minority ethnic group within Ethiopia, the TPLF consolidated power first under the autocratic regime of Meles Zenawi, to the detriment of larger ethnic groups like the Oromo, Amhara, and Somali populations; Ethiopia under Tigrayan leadership also fought a low-level, frozen conflict over the next two decades with neighboring Eritrea. </p>\n<p id=\"7zSZkq\">In 2019, <a href=\"https://www.nytimes.com/2019/10/11/world/africa/nobel-peace-prize.html#:~:text=Abiy%20Ahmed%2C%20the%20prime%20minister,of%20political%20and%20economic%20repression.\">Abiy won the Nobel Peace Prize</a> for ending hostilities with Eritrea and for instituting domestic reforms like rolling back press censorship, releasing political prisoners, and allowing political opposition groups. Despite these accomplishments, though, Ethiopia’s democratic progress deteriorated quickly after Abiy’s government repeatedly delayed national elections and extended his time in power in June 2020, as the <a href=\"https://www.cfr.org/global-conflict-tracker/conflict/conflict-ethiopia\">Council on Foreign Relations</a> explained. Tigrayan leadership held local elections despite the delays, solidifying the TPLF’s power in the region — and warned the federal government not to intervene or risk igniting conflict.</p>\n<p id=\"ERJ5GU\">Abiy sent troops from the Ethiopian National Defense Force (ENDF) to Tigray on November 4, 2020, after accusing the TPLF of raiding a national military depot for weapons. Over the next few months, the low-level conflict ballooned into a civil war; Eritrean troops joined on the side of the federal government, although Abiy initially denied their presence in Tigray. <a href=\"https://www.reuters.com/world/africa/more-than-50-killed-northern-ethiopia-air-strike-say-aid-workers-tigray-forces-2022-10-05/\">They, along with ENDF troops</a>, the <a href=\"https://www.hrw.org/news/2021/12/10/ethiopia-tigray-forces-summarily-execute-civilians\">Tigray Defense Forces (TDF)</a>, and TDF allies the <a href=\"https://www.bloomberg.com/news/articles/2022-06-21/ethiopian-military-tagets-rebels-accused-of-killing-civilians\">Oromo Liberation Army</a> have been accused of <a href=\"https://apnews.com/article/africa-only-on-ap-kenya-ethiopia-eritrea-b86f4f1fbc836f132e15e1d65893b0d3\">targeting civilians</a>.</p>\n<p id=\"TYpMKb\">Information about the humanitarian situation in Tigray and the contours of the conflict have been difficult to come by; Abiy <a href=\"https://www.voanews.com/a/press-freedom_journalists-struggle-through-information-blackout-ethiopia/6199045.html\">instituted an internet and media blackout in the region</a> at the start of the war, making it difficult to verify sites of attack or numbers of casualties. A federal government blockade of the region began in June 2021, after the TPLF retook control of the region from federal forces; since then, except for a brief reprieve earlier this year, Tigrayans have suffered from a desperate lack of necessities like food, fuel, and medical supplies. </p>\n<p id=\"nDvjWB\">Ethiopia overall and Tigray in particular have some of the most severe food insecurity outlooks in the world, according to the <a href=\"https://reliefweb.int/report/ethiopia/ethiopia-food-security-outlook-june-2022-january-2023\">Famine Early Warning System</a>; that’s due to a combination of low levels of rainfall, instability limiting agricultural activity, and outside supply factors — specifically the war in Ukraine. Since the beginning of Russia’s invasion, countries including Ethiopia that rely on Ukrainian grain to feed their populations have suffered due to Russia’s Black Sea blockade. </p>\n<h3 id=\"aXwwMN\">What comes next?</h3>\n<p id=\"m8tvR3\">In his announcement Wednesday, <a href=\"https://www.reuters.com/world/africa/african-union-parties-ethiopia-conflict-have-agreed-cease-hostilities-2022-11-02/\">Obasanjo promised</a> “restoration of law and order, restoration of services, unhindered access to humanitarian supplies, protection of civilians,” a seeming acknowledgment of the dire consequences of the war for civilian populations in Tigray. </p>\n<p id=\"nq3a3W\">United Nations head Antonio Guterres <a href=\"https://news.un.org/en/story/2022/11/1130137\">praised the announcement</a> as “a critical first step” in ending the war, while noting the severe damage the war has done to the civilian population in Tigray. According to the World Health Organization, about 5.2 million people in Tigray need humanitarian assistance in Tigray, and 3.8 million need health care, <a href=\"https://www.who.int/director-general/speeches/detail/who-director-general-s-opening-remarks-at-media-briefing---2-november-2022\">with WHO chief Tedros Ghebreyesus calling the situation</a> “the worst humanitarian crisis in the world.”</p>\n<p id=\"vymAgu\">Though the peace agreement promises unfettered access to humanitarian aid, Ghebreyesus expressed concerns in a media briefing Wednesday regarding the sheer scale of need.</p>\n<p id=\"OtTBqp\">“Large numbers of displaced people are now arriving in, or moving towards, the regional capital Mekelle,” he said. “Most UN agencies and NGOs have now left towns in the region’s northeast because of security concerns. Some health partners have shut down because they cannot access the funds, fuel, and other supplies they need to serve the community,” raising concerns that the needed aid infrastructure might not become available as quickly as it’s needed. </p>\n<p id=\"F34A2V\">Also unclear is the role of Eritrea in the peace process; though Eritrean troops have been fighting alongside ENDF troops since nearly the beginning of the conflict and have been accused of serious crimes in the hostilities, neither they nor the regional forces like the <a href=\"https://apnews.com/article/africa-only-on-ap-ethiopia-b280e6622d66b7e7f9b12cd1d0041ae8\">Oromo Liberation Army</a>, which allied with the TDF, were represented at the talks, <a href=\"https://www.reuters.com/world/africa/african-union-parties-ethiopia-conflict-have-agreed-cease-hostilities-2022-11-02/\">Reuters reported</a>. </p>\n<p id=\"7Quhdr\">“We still have questions on the agreement,” a Tigrayan man in Addis Ababa told Reuters. “We didn’t hear anything about Eritrea. I hope that it will be in the details.”</p>\n<p id=\"ii7JrY\">A <a href=\"https://twitter.com/AbiyAhmedAli/status/1587869990006525953\">statement Abiy posted to Twitter</a> was similarly opaque; the prime minister thanked the African Union and negotiators for brokering the deal, but didn’t acknowledge the grave suffering the conflict had caused, nor did he acknowledge any of the underlying causes of the war. The only mention of fighting at all is tangential; the conclusion of Abiy’s statement thanks “the brave members of the Ethiopian National Defense Forces” and the Ethiopian people who “[with]stood a testing period.”</p>\n<div id=\"SwT34p\">\n<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Expression of Gratitude on the Conclusion of the Peace Talks <a href=\"https://t.co/mB7Q0jLwsZ\">pic.twitter.com/mB7Q0jLwsZ</a></p>— Abiy Ahmed Ali    (@AbiyAhmedAli) <a href=\"https://twitter.com/AbiyAhmedAli/status/1587869990006525953?ref_src=twsrc%5Etfw\">November 2, 2022</a>\n</blockquote>\n<script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n</div>\n<p id=\"pqImbk\">With so few details to go on, it’s difficult to know exactly how peace can be achieved; it’s one thing to “silence the guns” and agree to disarmament, but it’s another entirely to peacefully disarm and change control of territory, let alone<strong> </strong>adjudicate a truth and reconciliation process and come to a national understanding of what happened and why. Such a process, though painful, <a href=\"https://theconversation.com/do-truth-and-reconciliation-commissions-heal-divided-nations-109925\">can be critical for addressing the serious rifts in the fabric of a society</a> and at least lay the groundwork for alternate forms of dispute resolution — outside of violence and armed conflict. </p>\n<p id=\"cXgGdN\"></p>",
  "link": "",
  "id": "https://www.vox.com/world/2022/11/3/23438725/ethiopia-tigray-peace-deal-cessation-hostilities",
  "author": {
    "name": "Ellen Ioanes"
  }
}