{
  "title": "Tory-linked firm involved in ‘secret’ Africa campaigns – Guardian",
  "link": "https://www.rt.com/news/565912-secret-campaigns-uk-africa/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565912-secret-campaigns-uk-africa/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6363fcbe85f5403525744991.jpg\" /> Tory-linked lobbying firm CT Group allegedly conducted “secretive” political projects in African countries <br/><a href=\"https://www.rt.com/news/565912-secret-campaigns-uk-africa/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>CT Group reportedly worked to swing presidential elections in the DRC and Zambia while lobbying on behalf of mining companies</strong></p>\n            \n                        \n            <p>Australian lobbying firm CT Group, which maintains close ties to the UK&rsquo;s ruling Conservative Party, attempted to influence elections in African countries in the interests of mining companies, The Guardian reported on Thursday, citing leaked documents.&nbsp;</p>\n<p>CT Group&rsquo;s co-owner Lynton Crosby managed the Tories&rsquo; 2005 and 2017 general election campaigns, as well as Boris Johnson&rsquo;s successful mayoral&nbsp;runs of 2008 and 2012. Many former employees of the firm eventually ended up in the Conservative Party&rsquo;s headquarters and in the government, The Guardian reported.&nbsp;</p>\n<p>Besides well-known&nbsp;election-consulting&nbsp;in Australia, the UK, and elsewhere, the lobbying firm conducted a number of <em>&ldquo;secret political projects&rdquo;</em> in Africa.&nbsp;</p>\n<p>Citing the leaked papers, the outlet revealed that CT Group &ndash; previously known as CTF Partners &ndash; worked for the Canadian enterprise First Quantum Minerals in the early 2010s.&nbsp;</p>\n<p>When the copper-mining permit of First Quantum Minerals was revoked by the authorities of the Democratic Republic of the Congo (DRC), CT Group offered its client a secretive plan to discredit then-President Joseph Kabila, while supporting &ldquo;<em>the most likely person</em>&rdquo; to beat him, according to the documents.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/6357cd17203027191b7885e9.jpg\" alt=\"Former UK Prime Minister Boris Johnson leaves the Accession Council ceremony to proclaim the new King, at St James&#039;s Palace in London.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565304-johnson-lobby-us-ukraine-support/\">Boris Johnson to lobby for Ukraine in US – FT</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>The documents suggest CT Group was set to earn &pound;1.2 million in fees, with a &pound;1 million bonus available if it reached certain targets. It is not clear if these goals were met, as Kabila ultimately won the election.&nbsp;</p>\n<p>Three years after the DRC campaign, CT Group allegedly became involved in another &ldquo;<em>secret political project</em>,&rdquo; this time in Zambia. The client in this case was also from the mining sector, according to The Guardian, though it is not clear if it was First Quantum or not.&nbsp;</p>\n<p>&ldquo;<em>There is no suggestion CT Group engaged in unlawful activities on behalf of clients in the mining sector,</em>&rdquo; The Guardian said.&nbsp;</p>\n<p>CT Group told the paper it had supported &ldquo;<em>campaigns in a range of countries, including the DRC and Zambia</em>&rdquo; and that lobbying candidates for office is part of &ldquo;<em>the democratic process.&rdquo; &nbsp;</em></p>\n<p>The company also emphasized that when it works on election campaigns, it strictly adheres to all &ldquo;<em>laws and regulations&rdquo;</em> of the relevant countries.&nbsp;&nbsp;</p>\n<p>In 2019, in another exclusive investigation, The Guardian claimed that CT Group, acting in its clients&rsquo; interests, had launched an undercover Facebook advertising campaign. According to the outlet, the company ran multiple supposedly &ldquo;<em>grassroots</em>&rdquo; social media groups to promote certain political views, including pro-Brexit ones.</p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 18:30:02 +0000",
  "dc:creator": "RT"
}