{
  "title": "MIKE MAJLAK IS HAPPY LANA RHOADES MOVED ON — BFFs EP. 103",
  "description": "<p>We are joined this week by friend of the pod Mike Majlak, who we recently discussed due to his cheating scandal in the past with enemy of the pod, Ava Louise. We get into that and Ava Louise saying Blac Chyna tried to traffic her, who Lana Rhoades real baby daddy is, Mike joining in on Ethan Klein’s BFFs rebrand, and what his true feelings are on Andrew Tate.\n\nWe then get into headlines with whether or not Travis Scott was cheating on Kylie Jenner in a 10 year affair, Dixie D’Amelio explaining the reason her and Noah Beck broke up, Mr. Beast canceling a grocery store giveaway, Cody Ko skipping Noel Miller’s wedding, Josh clowning Monty Lopez’s recreation of Bryce and Addison’s Halloween costume, Fyre Fest 2.0, Taylor Swift’s new album, and Kanye going crazy again on the internet. \n\nWe end with BFFs corner to figure out what really happened with Josh and Nessa after she talked about their relationship on Call Her Daddy and they both unfollowed each other, Josh coping mechanism of shooting his shot at every girl on the internet, and the fallout of Dave trying to figure out whether or not BTS lip syncs. \n\n\nSupport Our Sponsors!\nRaising Canes: Come for the Chicken Finger meals, stay for the Sauce. Order online at https://barstool.link/RaisingCanesBSS\nToo Lost: Take control of your music at https://too.fm/barstool\nTakis: Try Takis and face the intensity!</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/bffspod\">barstool.link/bffspod</a></p>",
  "guid": "60da8f94-b350-40c9-9081-033069f1974f",
  "pubDate": "Thu, 27 Oct 2022 00:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/134/Bffs",
  "itunes:explicit": "yes",
  "itunes:duration": "00:57:21",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}