{
  "title": "EPISODE 77: Bruce Lee (Part 1)",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Mon, 17 Jan 2022 21:25:51 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2022/1/17/episode-77-bruce-lee-part-1",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:61e5de4be8f08e6ac35f2588",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/7790e8ec-162e-4381-b1f6-a1052cc90ba4/HOF-77.jpg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"61e5dea62cf96950e4f2d024\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/7790e8ec-162e-4381-b1f6-a1052cc90ba4/HOF-77.jpg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“Energy is eternal delight.”</em> — William Blake </p><p class=\"\"><em>“Hong Kong in the 1950s was a depressed place. Post–World War II Hong Kong had suffered from unemployment, a poor economy, over-crowding, homelessness, and people taking advantage of each other. Gangs roamed the street, and juvenile delinquents ran rampant.” —</em> Hawkins Cheung</p><p class=\"\"><em>“Teachers should never impose their favorite patterns on their students—he said—They should be finding out what works for them, and what does not work for them. The individual is more important than the style.”</em> — Bruce Lee </p><p class=\"\"><em>“I feel I have this great creative and spiritual force within me that is greater than faith, greater than ambition, greater than confidence, greater than determination, greater than vision. It is all of these combined…”</em> — Bruce Lee </p><p class=\"\">Ask anyone for one name they associate with martial arts, and odds are they will mention Bruce Lee. Because of his career, millions of people were introduced to martial arts. Thanks to his movies, Lee achieved enduring, worldwide fame, broke plenty of box office records, and forever changed the aesthetics of action films. Not bad for a skinny kid from Hong Kong who arrived in United States with the proverbial shirt on his back. The image of his hyper-muscular body in combat pose has become iconic. But there was a lot more to Bruce Lee than meets the eye. He could have been a rock star or a spiritual leader or anything else he had wished… Martial arts was just a channel for his energy. Had he put that same energy anywhere else, he’d have probably had similar success. Despite Hollywood turning him down time and time again due to racial prejudices, Lee refused to take no for an answer and more or less single-handedly changed the way in which Asian people were perceived in the West. His philosophical insights also changed the face of martial arts training, and introduced masses of people to Taoism and Zen Buddhism. His creative & anti-authoritarian approach to life captured the best of the essence of the 1960s. Get ready for a ride because this is an incredible story I have wanted to tell since I first started podcasting.</p><p class=\"\">This episode covers Bruce Lee’s life from birth to his famous fight with Wong Jack Man in 1964.</p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "02:13:18",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 77,
  "itunes:title": "EPISODE 77: Bruce Lee (Part 1)",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 77: Bruce Lee (Part 1)"
  }
}