{
  "id": "yt:video:RZGAYzItazw",
  "yt:videoId": "RZGAYzItazw",
  "yt:channelId": "UCAL3JXZSzSm8AlZyD3nQdBA",
  "title": "Primitive Technology: Smelting Iron In Brick Furnaces",
  "link": "",
  "author": {
    "name": "Primitive Technology",
    "uri": "https://www.youtube.com/channel/UCAL3JXZSzSm8AlZyD3nQdBA"
  },
  "published": "2022-10-06T21:00:02+00:00",
  "updated": "2022-10-19T08:44:15+00:00",
  "media:group": {
    "media:title": "Primitive Technology: Smelting Iron In Brick Furnaces",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Primitive Technology: Smelting Iron In Brick Furnaces\nSubscribe: http://bit.ly/subPT | Never miss a video! Enable ‘ALL’ Notifications!\nWatch my newest content: https://youtube.com/playlist?list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj&playnext=1&index=2\n\nFollow Primitive Technology:\nWordpress: https://primitivetechnology.wordpress.com/\nPatreon: https://patreon.com/user?u=2945881\n\nWatch More Primitive Technology:\nNewest Uploads: https://youtube.com/playlist?list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj&playnext=1&index=2\nPyrotechnology: https://youtube.com/playlist?list=PLGnWLXjIDnpBVRqu5lz5JGaQxjPs7q3CJ&playnext=1&index=2\nShelter: https://youtube.com/playlist?list=PLGnWLXjIDnpBBsdKZb-vy30o88SIxItp2&playnext=1&index=2\nWeapons: https://youtube.com/playlist?list=PLGnWLXjIDnpA-XGDrrmVgBnSXx15i2Awp&playnext=1&index=2\nPopular Videos: https://youtube.com/playlist?list=PLGnWLXjIDnpAb29Lrdki5BPjTpMon8zla&playnext=1&index=2\n\nAbout This Video:\nI made 3 furnaces from bricks using different configurations to test their effectiveness. The benefit of using bricks to make a furnace is that it's quicker, easier, re-useable and portable relative to a furnace constructed in-situ from clay. This is because the old furnaces crack and need repairs where as the brick ones can be assembled and re-assembled with any broken bricks being swapped out as necessary. Also, the shape and height of the furnace is easily changed by adding/subtracting or re-arranging bricks.\n The first furnace used a square plan with the bricks laid on their sides with a inner cross section of 18 cm square. A 2.5 cm diameter tuyere was used and about 15 g of iron was made. The second furnace was the same but used a 5 cm diameter tuyere. It made about the same amount of iron. The 3rd furnace was a haexagonal plan furnace with a diameter of about 22 cm. The bricks were laid on their ends for this type. The smelt yielded the same as the square ones for the same input of ore, charcoal and effort.\nI'll probably stick to using the square design made from bricks in future. Things I may try later would be to increase the height of the furnace by adding more brick layers. I'd put in all the charcoal and ore for the smelt after preheating. Then I'd be able to operate the smelt without the interruption of needing to charge the furnace every 5 minutes with ore and charcoal.\nIn conclusion, bricks make a useful furnace in a shorter time and with less difficulty than in situ made furnaces, are re-useable and can be disassembled and rebuilt in various locations if needed while the bricks can be stored out of the way when not in use. \n\nAbout Primitive Technology:\nPrimitive technology is a hobby where you build things in the wild completely from scratch using no modern tools or materials. These are the strict rules: If you want a fire, use a fire stick - An axe, pick up a stone and shape it - A hut, build one from trees, mud, rocks etc. The challenge is seeing how far you can go without utilizing modern technology. I do not live in the wild, but enjoy building shelter, tools, and more, only utilizing natural materials. To find specific videos, visit my playlist tab for building videos focused on pyrotechnology, shelter, weapons, food & agriculture, tools & machines, and weaving & fiber.If you want a fire, use a fire stick - An axe, pick up a stone and shape it - A hut, build one from trees, mud, rocks etc. The challenge is seeing how far you can go without utilizing modern technology. I do not live in the wild, but enjoy building shelter, tools, and more, only utilizing natural materials. To find specific videos, visit my playlist tab for building videos focused on pyrotechnology, shelter, weapons, food & agriculture, tools & machines, and weaving & fiber.If you want a fire, use a fire stick - An axe, pick up a stone and shape it - A hut, build one from trees, mud, rocks etc. The challenge is seeing how far you can go without utilizing modern technology. I do not live in the wild, but enjoy building shelter, tools, and more, only utilizing natural materials. To find specific videos, visit my playlist tab for building videos focused on pyrotechnology, shelter, weapons, food & agriculture, tools & machines, and weaving & fiber.visit my playlist tab for building videos focused on pyrotechnology, shelter, weapons, food & agriculture, tools & machines, and weaving & fiber.visit my playlist tab for building videos focused on pyrotechnology, shelter, weapons, food & agriculture, tools & machines, and weaving & fiber.\n\n#PrimitiveTechnology #iron #bricks",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}