{
  "title": "Episode 111: &#8220;Heat Wave&#8221; by Martha and the Vandellas",
  "link": "https://500songs.com/podcast/episode-111-heat-wave-by-martha-and-the-vandellas/",
  "pubDate": "Wed, 20 Jan 2021 23:25:09 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-111-heat-wave-by-martha-and-the-vandellas/",
  "description": "Episode one hundred and eleven of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Heat Wave\" by Martha and the Vandellas, and the beginnings of Holland-Dozier-Holland. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/46463768\">\"My Boyfriend's Back\" by the Angels</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I've created&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-111-heat-wave/\">a Mixcloud streaming playlist&nbsp;</a>with full versions of all the songs in the episode.\n\nFor Motown-related information in this and other Motown episodes, I've used the following resources:\n\n<a href=\"https://amzn.to/2QTOvdM\"><em>Where Did Our Love Go? The Rise and Fall of the Motown Sound</em>&nbsp;by Nelson George</a>&nbsp;is an excellent popular history of the various companies that became Motown.\n\n<a href=\"https://amzn.to/2QQhXRZ\"><em>To Be Loved</em>&nbsp;by Berry Gordy</a>&nbsp;is Gordy's own, understandably one-sided, but relatively well-written, autobiography.\n\n<a href=\"https://amzn.to/2VIpXII\"><em>Women of Motown: An Oral History</em>&nbsp;by Susan Whitall</a> is a collection of interviews with women involved in Motown, including Martha and the Vandellas.\n\n<a href=\"https://amzn.to/2xVdvfD\"><em>I Hear a Symphony: Motown and Crossover R&B&nbsp;</em>by J. Andrew Flory</a>&nbsp;is an academic look at Motown.\n\n<a href=\"https://amzn.to/2VLquJX\"><em>The Motown Encyclopaedia</em>&nbsp;by Graham Betts</a>&nbsp;is an exhaustive look at the people and records involved in Motown's thirty-year history.\n\n<a href=\"https://amzn.to/3bZd5q6\"><em>How Sweet It Is</em> by Lamont Dozier and Scott B. Bomar </a>is Dozier's autobiography, while&nbsp;<a href=\"https://amzn.to/3903ey8\"><em>Come and Get These Memories&nbsp;</em>by Brian and Eddie Holland and Dave Thompson</a> is the Holland brothers'.\n\nAnd&nbsp;<a href=\"https://motownjunkies.co.uk/\">Motown Junkies</a> is an infrequently-updated blog looking at (so far) the first 694 tracks released on Motown singles.\n\n<a href=\"https://amzn.to/3iOneXx\">Girl Groups</a> by John Clemente contains potted biographies of many groups of the era, including Martha and the Vandellas.\n\nAnd&nbsp;<a href=\"https://amzn.to/3o2d4Uw\"><em>Dancing in the Street: Confessions of a Motown Diva&nbsp;</em> by Martha Reeves and Mark Bego</a> is Reeves' autobiography.\n\nAnd <a href=\"https://amzn.to/3qEHGx0\">this three-CD set </a>contains all the Vandellas' Motown singles, along with a bunch of rarities.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\n<strong>Transcript</strong>\n\nToday we're going to take a look at the career of one of the great girl groups to come out of Motown, and at the early work of the songwriting team that went on to be arguably the most important people in the definition of the Motown Sound. We're going to look at \"Heatwave\" by Martha and the Vandellas, and the beginning of the career of Holland, Dozier, and Holland:\n\n[Excerpt: Martha and the Vandellas, \"Heatwave\"]\n\nBy the time she started recording for Motown, Martha Reeves had already spent several years in groups around Detroit, with little success. Her singing career had started in a group called The Fascinations, which she had formed with another singer, who is variously named in different sources as Shirley Lawson and Shirley Walker. She'd quickly left that group, but after she left them, the Fascinations went on to make a string of minor hit records with Curtis Mayfield:\n\n[Excerpt: The Fascinations, \"Girls Are Out To Get You\"]\n\nBut it wasn't just her professional experience, such as it was, that Reeves credited for her success -- she had also been a soloist in her high school choir, and from her accounts her real training came from her High School music teacher, Abraham Silver. In her autobiography she talks about hanging around in the park singing with other people who had been taught by the same teacher -- Mary Wilson and Florence Ballard, who would go on to form the Supremes, Bobby Rogers and Claudette Robinson, who were founder members of the Miracles, and Little Joe Harris, who would later become lead singer of the minor Motown act The Undisputed Truth.\n\nShe'd eventually joined another group, the Del-Phis, with three other singers -- Gloria Williams (or Williamson -- sources vary as to what her actual surname was -- it might be that Williamson was her birth name and Williams a stage name), Annette Beard, and Rosalind Ashford. The group found out early on that they didn't particularly get on with each other as people -- their personalities were all too different -- but their voices blended well and they worked well on stage. Williams or Williamson was the leader and lead singer at this point, and the rest of the DelPhis acted as her backing group.\n\nThey started performing at the amateur nights and talent contests that were such a big part of the way that Black talent got known at that time, and developed a rivalry with two other groups -- The Primes, who would later go on to be the Temptations, and The Primettes, who had named themselves after the Primes, but later became the Supremes. Those three groups more or less took it in turns to win the talent contests, and before long the Del-Phis had been signed to Checkmate Records, one of several subsidiaries of Chess, where they released one single, with Gloria on lead:\n\n[Excerpt: The Del-Phis, \"I'll Let You Know\"]\n\nThe group also sang backing vocals on various other records at that time, like Mike Hanks' \"When True Love Comes to Be\":\n\n[Excerpt: Mike Hanks, \"When True Love Comes to Be\"]\n\nDepending on who you believe, Martha may not be on that record at all -- the Del-Phis apparently had some lineup fluctuations, with members coming and going, though the story of who was in the group when seems to be told more on the basis of who wants credit for what at any particular time than on what the truth is.\n\nNo matter who was in the group, though, they never had more than local success. While the Del-Phis were trying and failing to become big stars as a group, Martha also started performing solo, as Martha LaVelle. Only a couple of days after her first solo performance, Mickey Stevenson saw her perform and gave her his card, telling her to pop down to Hitsville for an audition as he thought she had talent.\n\nBut when she did turn up, Stevenson was annoyed at her, over a misunderstanding that turned out to be his fault. She had just come straight to the studio, assuming she could audition any time, and Stevenson hadn't explained to her that they had one day a month where they ran auditions -- he'd expected her to call him on the number on the card, not just come down.\n\nStevenson was busy that day, and left the office, telling Martha on his way out the door that he'd be back in a bit, and to answer the phone if it rang, leaving her alone in the office. She started answering the phone, calling herself the \"A&R secretary\", taking messages, and sorting out problems. She was asked to come back the next day, and worked there three weeks for no pay before getting herself put on a salary as Stevenson's secretary.\n\nOnce her foot was in the door at Motown, she also started helping out on sessions, as almost all the staff there did, adding backing vocals, handclaps, or footstomps for a five-dollar-per-session bonus.\n\nOne of her jobs as Stevenson's secretary was to phone and book session musicians and singers, &nbsp;and for one session the Andantes, Motown's normal female backing vocal group, were unavailable. Martha got the idea to call the rest of the DelPhis -- who seem like they might even have been split up at this point, depending on which source you read -- and see if they wanted to do the job instead. They had to audition for Berry Gordy, but Gordy was perfectly happy with them and signed them to Motown. Their role was mostly to be backing vocalists, but the plan was that they would also cut a few singles themselves as well.\n\nBut Gordy didn't want to sign them as the Del-Phis -- he didn't know what the details of their contract with Checkmate were, and who actually owned the name. So they needed a new name.\n\nAt first they went with the Dominettes, but that was soon changed, before they ever made a record What happened is a matter of some dispute, because this seems to be the moment that Martha Reeves took over the group -- it may be that the fact that she was the one booking them for the sessions and so in charge of whether they got paid or not changed the power dynamics of the band -- and so different people give different accounts depending on who they want to seem most important. But the generally accepted story is that Martha suggested a name based on the street she lived on, Van Dyke Street, and Della Reese, Martha's favourite singer, who had hits like \"Don't You Know?\":\n\n[Excerpt: Della Reese, \"Don't You Know?\"]\n\nThe group became Martha and the Vandellas -- although Rosalind Ashford, who says that the group name was not Martha's work, also says that the group weren't \"Martha and the Vandellas\" to start with, but just the Vandellas, and this might be the case, as at this point Gloria rather than Martha was still the lead singer.\n\nThe newly-named Vandellas were quickly put to work, mostly working on records that Mickey Stevenson produced. The first record they sang on was not credited either to the Vandellas *or* to Martha and the Vandellas, being instead credited to Saundra Mallett and the Vandellas – Mallett was a minor Motown singer who they were backing for this one record. The song was one written by Berry Gordy, as an attempt at a \"Loco-Motion\" clone, and was called \"Camel Walk\":\n\n[Excerpt: Saundra Mallett and the Vandellas, \"Camel Walk\"]\n\nMore famously, there was the record that everyone talks about as being the first one to feature the Vandellas, even though it came out after \"Camel Walk\", one we've already talked about before, Marvin Gaye's \"Stubborn Kind of Fellow\":\n\n[Excerpt: Marvin Gaye, \"Stubborn Kind of Fellow\"]\n\nThat became Gaye's breakout hit, and as well as singing in the studio for other artists and trying to make their own records, the Vandellas were now also Marvin Gaye's backing vocalists, and at shows like the Motortown Revue shows, as well as performing their own sets, the Vandellas would sing with Gaye as well. While they were not yet themselves stars, they had a foot on the ladder, and through working with Marvin they got to perform with all sorts of other people -- Martha was particularly impressed by the Beach Boys, who performed on the same bill as them in Detroit, and she developed a lifelong crush on Mike Love.\n\nBut while the Vandellas were Motown's go-to backing vocalists in 1962, they still wanted to make their own records. They did make one record with Gloria singing lead, \"You’ll Never Cherish A Love So True (‘Til You Lose It)\":\n\n[Excerpt: The Vells, \"You’ll Never Cherish A Love So True (‘Til You Lose It)\"]\n\nBut that was released not as by the Vandellas, but by the Vells, because by the time it was released, the Vandellas had more or less by accident become definitively MARTHA and the Vandellas. The session that changed everything came about because Martha was still working as Mickey Stevenson's secretary. Stevenson was producing a record for Mary Wells, and he had a problem.\n\nStevenson had recently instituted a new system for his recordings at Motown. Up to this point, they'd been making records with everyone in the studio at the same time -- all the musicians, the lead singer, the backing vocalists, and so on. But that became increasingly difficult when the label's stars were on tour all the time, and it also meant that if the singer flubbed a note a good bass take would also be wrecked, or vice versa. It just wasn't efficient.\n\nSo, taking advantage of the ability to multitrack, Stevenson had started doing things differently. Now backing tracks would be recorded by the Funk Brothers in the studio whenever a writer-producer had something for them to record, and then the singer would come in later and overdub their vocals when it was convenient to do that. That also had other advantages -- if a singer turned out not to be right for the song, they could record another singer doing it instead, and they could reuse backing tracks, so if a song was a hit for, say, the Miracles, the Marvelettes could then use the same backing track for a cover version of it to fill out an album.\n\nBut there was a problem with this system, and that problem was the Musicians' Union. The union had a rule that if musicians were cutting a track that was intended to have a vocal, the vocalist *must* be present at the session -- like a lot of historical union rules, this seems faintly ridiculous today, but no doubt there were good reasons for it at the time.\n\nMotown, like most labels, were perfectly happy to break the union rules on occasion, but there was always the possibility of a surprise union inspection, and one turned up while Mickey Stevenson was cutting \"I'll Have to Let Him Go\". Mary Wells wasn't there, and knowing that his secretary could sing, Stevenson grabbed her and got her to go into the studio and sing the song while the musicians played. Martha decided to give the song everything she had, and Stevenson was impressed enough that he decided to give the song to her, rather than Wells, and at the same session that the Vandellas recorded the songs with Gloria on lead, they recorded new vocals to the backing track that Stevenson had recorded that day:\n\n[Excerpt: Martha and the Vandellas, \"I'll Have to Let Him Go\"]\n\nThat was released under the Martha and the Vandellas name, and around this point Gloria left the group. Some have suggested that this was because she didn't like Martha becoming the leader, while others have said that it's just that she had a good job working for the city, and didn't want to put that at risk by becoming a full-time singer. Either way, a week after the Vandellas record came out, Motown released \"You’ll Never Cherish A Love So True (‘Til You Lose It)\" under the name The Vells.\n\nNeither single had any chart success, but that wouldn't be true for the next one, which wouldn't be released for another five months. But when it was finally released, it would be regarded as the beginning of the \"Motown Sound\". Before that record, Motown had released many extraordinary records, and we've looked at some of them. But after it, it began a domination of the American charts that would last the rest of the decade; a domination caused in large part by the team of Holland, Dozier, and Holland.\n\nWe've heard a little from the Holland brothers and Lamont Dozier, separately, in previous episodes looking at Motown, but this is the point at which they go from being minor players within the Motown organisation to being the single most important team for the label's future commercial success, so we should take a proper look at them now.\n\nEddie Holland started working with Berry Gordy years before the start of Motown -- he was a singer who was known for having a similar sounding voice to that of Jackie Wilson, and Gordy had taken him on first as a soundalike demo singer, recording songs written for Wilson so Wilson could hear how they would sound in his voice, and later trying to mould him into a Wilson clone, starting with Holland's first single, \"You\":\n\n[Excerpt: Eddie Holland, \"You\"]\n\nHolland quickly found that he didn't enjoy performing on stage -- he loved singing, but he didn't like the actual experience of being on stage. However, he continued doing it, in the belief that one should not just quit a job until a better opportunity comes along. Before becoming a professional singer, Holland had sung in street-corner doo-wop groups with his younger brother Brian. Brian, unlike Eddie, didn't have a particularly great voice, but what he did have was a great musical mind -- he could instantly figure out all the harmony parts for the whole group, and had a massive talent for arrangement.\n\nEddie spent much of his early time working with Gordy trying to get Gordy to take his little brother seriously -- at the time, &nbsp;Brian Holland was still in his early teens, and Gordy refused to believe he could be as talented as Eddie said. Eventually, though, Gordy listened to Brian and took him under his wing, pairing him with Janie Bradford to add music to Bradford's lyrics, and also teaching him to engineer. One of Brian Holland's first engineering jobs was for a song recorded by Eddie, written as a jingle for a wine company but released as a single under the name \"Briant Holland\" -- meaning it has often over the years been assumed to be Brian singing lead:\n\n[Excerpt: Briant Holland, \"(Where's the Joy) in Nature Boy?\"]\n\nWhen Motown started up, Brian had become a staffer -- indeed, he has later claimed that he was the very first person employed by Motown as a permanent staff member. While Eddie was out on the road performing, Brian was &nbsp;writing, producing, and singing backing vocals on many, many records. We've already heard how he was the co-writer and producer on \"Please Mr. Postman\" by the Marvelettes:\n\n[Excerpt: The Marvelettes, \"Please Mr. Postman\"]\n\nThat had obviously been a massive hit, and Motown's first number one, but Brian was still definitely just one of the Motown team, and not as important a part of it as Berry Gordy, Smokey Robinson, or Mickey Stevenson. Meanwhile, Eddie finally had a minor hit of his own, with \"Jamie\", a song co-written by Barrett Strong and Mickey Stevenson, and originally recorded by Strong -- when Strong left the label, they took the backing track intended for him and had Holland record new vocals over it.\n\n[Excerpt: Eddie Holland, \"Jamie\"]\n\nThat made the top thirty, which must have been galling at the time for Strong, who'd quit in part because he couldn't get a hit. But the crucial thing that lifted the Holland brothers from being just parts of the Motown machine to being the most important creative forces in the company was when Brian Holland became friendly with Anne Dozier, who worked at Motown packing records, and whose husband Lamont was a singer.\n\nLamont Dozier had been around musical people all his life -- at Hutchins Junior High School, he was a couple of years below Marv Johnson, the first Motown star, he knew Freda Payne, and one of his classmates was Otis Williams, later of the Temptations. But it was another junior high classmate who, as he puts it, \"lit a fire under me to take some steps to get my own music heard by the world\", when one of his friends asked him if he felt like coming along to church to hear another classmate sing. Dozier had no idea this classmate sang, but he went along, and as it happens, we have some recordings of that classmate singing and playing piano around that time:\n\n[Excerpt: Aretha Franklin, \"There Is a Fountain Filled With Blood\"]\n\nThat's fourteen-year-old Aretha Franklin, and as you can imagine, being classmates with someone who could perform like that caused Lamont Dozier to radically revise his ideas of what it was possible for him to do. He'd formed a doo-wop group called the Romeos, and they released their first single, with both sides written by Lamont, by the time he was sixteen:\n\n[Excerpt: The Romeos, \"Gone Gone Get Away\"]\n\nThe Romeos' third single, \"Fine Fine Fine\", was picked up by Atlantic for distribution, and did well enough that Atlantic decided they wanted a follow-up, and wrote to them asking them to come into the studio. But Lamont Dozier, at sixteen, thought that he had some kind of negotiating power, and wrote back saying they weren't interested in just doing a single, they wanted to do an album. Jerry Wexler wrote back saying \"fair enough, you're released from your contract\", and the Romeos' brief career was over before it began.\n\nHe joined the Voice Masters, the first group signed to Anna Records, and sang on records of theirs like \"Hope and Pray\", the very first record ever put out by a Gordy family label:\n\n[Excerpt: The Voice Masters, \"Hope and Pray\"]\n\nAnd he'd continued to sing with them, as well as working for Anna Records doing odd jobs like cleaning the floors. His first solo record on Anna, released under the name Lamont Anthony, featured Robert White on guitar, James Jamerson on bass, Harvey Fuqua on piano, and Marvin Gaye on drums, and was based on the comic character \"Popeye\":\n\n[Excerpt: Lamont Anthony, \"Popeye the Sailor Man\"]\n\nUnfortunately, just as that record was starting to take off, King Features Syndicate, the owners of Popeye, sent a cease and desist order. Dozier went back into the studio and recut the vocal, this time singing about Benny the Skinny Man, instead of Popeye the Sailor Man:\n\n[Excerpt: Lamont Anthony, \"Benny the Skinny Man\"]\n\nBut without the hook of it being about Popeye, the song flopped.\n\nDozier joined Motown when that became the dominant part of the Gordy family operation, and signed up as a songwriter and producer. Robert Bateman had just stopped working with Brian Holland as a production team, and when Anne Dozier suggested that Holland go and meet her husband who was just starting at Motown, Holland walked in to find Dozier working at the piano, writing a song but stuck for a middle section. Holland told him he had an idea, sat next to him at the piano, and came up with the bridge. The two instantly clicked musically -- they discovered that they almost had a musical telepathy, and Holland got Freddie Gorman, his lyricist partner at the time, to finish up the lyrics for the song while he and Dozier came up with more ideas.\n\nThat song became a Marvelettes album track, \"Forever\", which a few years later would be put out as a B-side, and make the top thirty in its own right:\n\n[Excerpt: The Marvelettes, \"Forever\"]\n\nHolland and Dozier quickly became a strong musical team -- Dozier had a great aptitude for coming up with riffs and hooks, both lyrical and musical, and rhythmic ideas, while Brian Holland could come up with great melodies and interesting chord changes, though both could do both. In the studio Brian would work with the drummers, while Lamont would work with the keyboard players and discuss the bass parts with James Jamerson. Their only shortfall was lyrically. They could both write lyrics -- and Lamont would often come up with a good title or hook phrase -- but they were slow at doing it. For the lyrics, they mostly worked with Freddie Gorman, and sometimes got Janie Bradford in. These teams came up with some great records, like \"Contract on Love\", which sounds very like a Four Seasons pastiche but also points the way to Holland and Dozier's later sound:\n\n[Excerpt: Little Stevie Wonder, \"Contract on Love\"]\n\nBoth Little Stevie Wonder and the backing vocalists on that, the Temptations, would do better things later, but that's still a solid record.\n\nMeanwhile, Eddie Holland had had a realisation that would change the course of Motown. \"Jamie\" had been a hit, but he received no royalties -- he'd had a run of flop singles, so he hadn't yet earned out the production costs on his records. His first royalty statement after his hit showed him still owing Motown money. He asked his brother, who got a royalty statement at the same time, if he was in the same boat, and Brian showed him the statement for several thousand dollars that he'd made from the songs he'd written. Eddie decided that he was in the wrong job. He didn't like performing anyway, and his brother was making serious money while he was working away earning nothing.\n\nHe took nine months off from doing anything other than the bare contractual minimum, -- where before he would spend every moment at Hitsville, now he only turned up for his own sessions -- and spent that time teaching himself songwriting. He studied Smokey Robinson's writing, and he developed his own ideas about what needed to be in a lyric -- he didn't want any meaningless filler words, he wanted every word to matter. He also wanted to make sure that even if people misheard a line or two, they would be able to get the idea of the song from the other lines, so he came up with a technique he referred to as \"repeat-fomation\", where he would give the same piece of information two or three times, paraphrasing it.\n\nWhen the next Marvelettes album, The Marvellous Marvelettes, was being finished up by Mickey Stevenson, Motown got nervous about the album, thinking it didn't have a strong enough single on it, and so Brian Holland and Dozier were asked to come up with a new Marvelettes single in a hurry. Freddie Gorman had more or less stopped songwriting by this point, as he was spending most of his time working as a postman, and so, in need of another writing partner, they called on Eddie, who had been writing with various people. The three of them wrote and produced \"Locking Up My Heart\", the first single to be released with the writing credit \"Holland-Dozier-Holland\":\n\n[Excerpt: The Marvelettes, \"Locking Up My Heart\"]\n\nThat was a comparative flop for the Marvelettes, and the beginning of the downward slump we talked about for them in the episode on \"Please Mr. Postman\", but the second Holland-Dozier-Holland single, recorded ten days later, was a very different matter. That one was for Martha and the Vandellas, and became widely regarded as the start of Motown's true Golden Age -- so much so that Brian and Eddie Holland's autobiography is named after this, rather than after any of the bigger and more obvious hits they would later co-write.\n\nThe introduction to \"Come and Get These Memories\" isn't particularly auspicious -- the Vandellas singing the chorus:\n\n[Excerpt: Martha and the Vandellas, \"Come and Get These Memories\"]\n\nHearing all three of the Vandellas, all of whom have such strong, distinctive voices, sing together is if anything a bit much -- the Vandellas aren't a great harmony group in the way that some of the other Motown groups are, and they work best when everyone's singing an individual line rather than block harmonies.\n\nBut then we're instantly into the sound that Holland, Dozier, and Holland -- really Brian Holland and Lamont Dozier, who took charge of the musical side of things, with Eddie concentrating on the lyrics -- would make their own. There's a lightly swung rhythm, but with a strong backbeat with handclaps and tambourine emphasising the two and four-- the same rhythmic combination that made so many of the very early rock and roll records we looked at in the first year of the podcast, but this time taken at a more sedate pace, a casual stroll rather than a sprint. There's the simple, chorded piano and guitar parts, both instruments often playing in unison and again just emphasising the rhythm rather than doing anything more complex. And there's James Jamerson's wonderful, loping bass part, doing the exact opposite of what the piano and guitar are doing.\n\n[Excerpt: Martha and the Vandellas, “Come and Get These Memories”]\n\nIn almost every record in the rock and roll, soul, and R&B genres up to this point -- I say \"almost every\" because, as I've said many times before, there are always exceptions and there is never a first of anything -- the bass does one of two things: it either plods along just playing the root notes, or it plays a simple, repeated, ostinato figure throughout, acting as a backbone while the other instruments do more interesting things.\n\nJames Jamerson is the first bass player outside the jazz and classical fields to prominently, repeatedly, do something very different -- he's got the guitars and piano holding down the rhythm so steadily that he doesn't need to. He plays melodies, largely improvised, that are jumping around and going somewhere different from where you'd expect.\n\n\"Come and Get These Memories\" was largely written before Eddie's involvement, and the bulk of the lyric was Lamont Dozier's. He's said that in this instance he was inspired by country singers like Loretta Lynn, and the song's lyrical style, taking physical objects and using them as a metaphor for emotional states, certainly seems very country:\n\n[Excerpt: Martha and the Vandellas, \"Come and Get These Memories\"]\n\n\"Come and Get These Memories\" made number twenty-nine on the pop charts and number six on the R&B charts. Martha and the Vandellas were finally stars.\n\nAs was the normal practice at Motown, when an artist had a hit, the writing and production team were given the chance to make the follow-up with them, and so the followup was another Holland/Dozier/Holland song, again from an idea by Lamont Dozier, as most of their collaborations with the Vandellas would be.\n\n\"Heat Wave\" is another leap forward, and is quite possibly the most exciting record that Motown had put out to this point. Where \"Come and Get These Memories\" established the Motown sound, this one establishes the Martha and the Vandellas sound, specifically, and the style that Holland, Dozier, and Holland would apply to many of their more uptempo productions for other artists.\n\nThis is the subgenre of Motown that, when it was picked up by fans in the North of England, became known as Northern Soul -- the branch of Motown music that led directly to Disco, to Hi-NRG, to electropop, to the Stock-Aitken-Waterman hit factory of the eighties, to huge chunks of gay culture, and to almost all music made for dancing in whatever genre after this point. Where \"Come and Get These Memories\" is mid-tempo, \"Heat Wave\" races along. Where \"Come and Get These Memories\" swings, \"Heat Wave\" stomps. \"Come and Get These Memories\" has the drums swinging and the percussion accenting the backbeat, here the drums are accenting the backbeat while the tambourine is hitting every beat dead on, four/four. It's a rhythm which has something in common with some of the Four Seasons' contemporary hits, but it's less militaristic than those. While \"Pistol\" Allen's drumming starts out absolutely hard on the beat, he swings it more and more as the record goes on, trusting to the listener once that hard rhythm has been established, allowing him to lay back behind the beat just a little.\n\nThis is where my background as a white English man, who has never played music for dancing -- when I tried to be a musician myself, it was jangly guitar pop I was playing -- limits me. I have a vocabulary for chords and for melodies, but when it comes to rhythms, at a certain point my vocabulary goes away, and all I can do is say \"just... *listen*\" It's music that makes you need to dance, and you can either hear that or you can't -- but of course, you can:\n\n[Excerpt: Martha and the Vandellas, \"Heat Wave\"]\n\nAnd Martha Reeves' voice is perfect for the song. Most female Motown singers were pop singers first and foremost -- some of them, many of them, *great* pop singers, but all with voices fundamentally suited to gentleness. Reeves was a belter. She has far more blues and gospel influence in her voice than many of the other Motown women, and she's showing it here.\n\n\"Heat Wave\" made the top ten, as did the follow-up, a \"Heat Wave\" soundalike called \"Quicksand\". But the two records after that, both still Holland/Dozier/Holland records, didn't even make the top forty, and Annette left, being replaced by Betty Kelly. The new lineup of the group were passed over to Mickey Stevenson, for a record that would become the one for which they are best remembered to this day. It wasn't as important a record in the development of the Motown sound as \"Come and Get These Memories\" or \"Heat Wave\", but \"Dancing in the Street\" was a masterpiece. Written by Stevenson, Marvin Gaye, and Ivy Joe Hunter, it features Gaye on drums, but the most prominent percussive sound is Hunter, who, depending on which account you read was either thrashing a steel chain against something until his hands bled, or hitting a tire iron.\n\nAnd Martha's vocal is astonishing -- and has an edge to it. Apparently this was the second take, and she sounds a little annoyed because she absolutely nailed the vocal on the first take only to find that there'd been a problem recording it.\n\n[Excerpt: Martha Reeves and the Vandellas, \"Dancing in the Street\"]\n\nThat went to number two in the charts, and would be the group's cultural and commercial high point. The song also gained some notoriety two years later when, in the wake of civil rights protests that were interpreted as rioting, the song was interpreted as being a call to riot -- it was assumed that instead of being about dancing it was actually about rioting, something the Rolling Stones would pick up on later when they released \"Street Fighting Man\", a song that owes more than a little to the Vandellas classic.\n\nThe record after that, \"Wild One\", was so much of a \"Dancing in the Streets\" soundalike that I've seen claims that the backing track is an alternate take of the earlier song. It isn't, but it sounds like it could be. But the record after that saw them reunited with Holland/Dozier/Holland, who provided them with yet another great track, \"Nowhere to Run\":\n\n[Excerpt: Martha Reeves and the Vandellas, \"Nowhere to Run\"]\n\nFor the next few years the group would release a string of classic hits, like \"Jimmy Mack\" and \"Honey Chile\", but the rise of the Supremes, who we'll talk about in a month, meant that like the Marvelettes before them the Vandellas became less important to Motown. When Motown moved from Detroit to LA in the early seventies, Martha was one of those who decided not to make the move with the label, and the group split up, though the original lineup occasionally reunited for big events, and made some recordings for Ian Levine's Motorcity label.\n\nCurrently, there are two touring Vandellas groups. One, Martha Reeves and the Vandellas, consists of Martha and two of her sisters -- including Lois, who was a late-period member of the group before they split, replacing Betty in 1967. Meanwhile \"The Original Vandellas\" consist of Rosalind and Annette. Gloria died in 2000, but Martha and the Vandellas are one of the very few sixties hitmaking groups where all the members of their classic lineup are still alive and performing. Martha, Rosalind, Betty, Annette, and Lois were all also inducted into the Rock and Roll Hall of Fame in 1995, becoming only the second all-female group to be inducted.\n\nThe Vandellas were one of the greatest of the Motown acts, and one of the greatest of the girl groups, and their biggest hits stand up against anything that any of the other Motown acts were doing at the time. When you hear them now, even almost sixty years later, you're still hearing the sound they were in at the birth of, the sound of young America.",
  "itunes:subtitle": "Episode one hundred and eleven of A History of Rock Music in Five Hundred Songs looks at Heat Wave by Martha and the Vandellas, and the beginnings of Holland-Dozier-Holland. Click the full post to read liner notes, links to more information, and a transc",
  "itunes:keywords": "Anna Records,Aretha Franklin,Berry Gordy,Chess Records,Freddie Gorman,girl groups,Holland-Dozier-Holland,James Jamerson,Martha and the Vandellas,Marvin Gaye,Mickey Stevenson,Motown,Musicians Union,The Funk Brothers,The Marvelettes,vocal groups",
  "itunes:episodeType": "full",
  "itunes:episode": 111,
  "content:encoded": "Episode one hundred and eleven of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Heat Wave\" by Martha and the Vandellas, and the beginnings of Holland-Dozier-Holland. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/46463768\">\"My Boyfriend's Back\" by the Angels</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I've created&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-111-heat-wave/\">a Mixcloud streaming playlist&nbsp;</a>with full versions of all the songs in the episode.\n\nFor Motown-related information in this and other Motown episodes, I've used the following resources:\n\n<a href=\"https://amzn.to/2QTOvdM\"><em>Where Did Our Love Go? The Rise and Fall of the Motown Sound</em>&nbsp;by Nelson George</a>&nbsp;is an excellent popular history of the various companies that became Motown.\n\n<a href=\"https://amzn.to/2QQhXRZ\"><em>To Be Loved</em>&nbsp;by Berry Gordy</a>&nbsp;is Gordy's own, understandably one-sided, but relatively well-written, autobiography.\n\n<a href=\"https://amzn.to/2VIpXII\"><em>Women of Motown: An Oral History</em>&nbsp;by Susan Whitall</a> is a collection of interviews with women involved in Motown, including Martha and the Vandellas.\n\n<a href=\"https://amzn.to/2xVdvfD\"><em>I Hear a Symphony: Motown and Crossover R&B&nbsp;</em>by J. Andrew Flory</a>&nbsp;is an academic look at Motown.\n\n<a href=\"https://amzn.to/2VLquJX\"><em>The Motown Encyclopaedia</em>&nbsp;by Graham Betts</a>&nbsp;is an exhaustive look at the people and records involved in Motown's thirty-year history.\n\n<a href=\"https://amzn.to/3bZd5q6\"><em>How Sweet It Is</em> by Lamont Dozier and Scott B. Bomar </a>is Dozier's autobiography, while&nbsp;<a href=\"https://amzn.to/3903ey8\"><em>Come and Get These Memories&nbsp;</em>by Brian and Eddie Holland and Dave Thompson</a> is the Holland brothers'.\n\nAnd&nbsp;<a href=\"https://motownjunkies.co.uk/\">Motown Junkies</a> is an infrequently-updated blog looking at (so far) the first 694 tracks released on Motown singles.\n\n<a href=\"https://amzn.to/3iOneXx\">Girl Groups</a> by John Clemente contains potted biographies of many groups of the era, including Martha and the Vandellas.\n\nAnd&nbsp;<a href=\"https://amzn.to/3o2d4Uw\"><em>Dancing in the Street: Confessions of a Motown Diva&nbsp;</em> by Martha Reeves and Mark Bego</a> is Reeves' autobiography.\n\nAnd <a href=\"https://amzn.to/3qEHGx0\">this three-CD set </a>contains all the Vandellas' Motown singles, along with a bunch of rarities.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\n<strong>Transcript</strong>\n\nToday we're going to take a look at the career of one of the great girl groups to come out of Motown, and at the early work of the songwriting team that went on to be arguably the most important people in the definition of the Motown Sound. We're going to look at \"Heatwave\" by Martha and the Vandellas, and the beginning of the career of Holland, Dozier, and Holland:\n\n[Excerpt: Martha and the Vandellas, \"Heatwave\"]\n\nBy the time she started recording for Motown, Martha Reeves had already spent several years in groups around Detroit, with little success. Her singing career had started in a group called The Fascinations, which she had formed with another singer, who is variously named in different sources as Shirley Lawson and Shirley Walker. She'd quickly left that group, but after she left them, the Fascinations went on to make a string of minor hit records with Curtis Mayfield:\n\n[Excerpt: The Fascinations, \"Girls Are Out To Get You\"]\n\nBut it wasn't just her professional experience, such as it was, that Reeves credited for her success -- she had also been a soloist in her high school choir, and from her accounts her real training came from her High School music teacher, Abraham Silver. In her autobiography she talks about hanging around in the park singing with other people who had been taught by the same teacher -- Mary Wilson and Florence Ballard, who would go on to form the Supremes, Bobby Rogers and Claudette Robinson, who were founder members of the Miracles, and Little Joe Harris, who would later become lead singer of the minor Motown act The Undisputed Truth.\n\nShe'd eventually joined another group, the Del-Phis, with three other singers -- Gloria Williams (or Williamson -- sources vary as to what her actual surname was -- it might be that Williamson was her birth name and Williams a stage name), Annette Beard, and Rosalind Ashford. The group found out early on that they didn't particularly get on with each other as people -- their personalities were all too different -- but their voices blended well and they worked well on stage. Williams or Williamson was the leader and lead singer at this point, and the rest of the DelPhis acted as her backing group.\n\nThey started performing at the amateur nights and talent contests that were such a big part of the way that Black talent got known at that time, and developed a rivalry with two other groups -- The Primes, who would later go on to be the Temptations, and The Primettes, who had named themselves after the Primes, but later became the Supremes. Those three groups more or less took it in turns to win the talent contests, and before long the Del-Phis had been signed to Checkmate Records, one of several subsidiaries of Chess, where they released one single, with Gloria on lead:\n\n[Excerpt: The Del-Phis, \"I'll Let You Know\"]\n\nThe group also sang backing vocals on various other records at that time, like Mike Hanks' \"When True Love Comes to Be\":\n\n[Excerpt: Mike Hanks, \"When True Love Comes to Be\"]\n\nDepending on who you believe, Martha may not be on that record at all -- the Del-Phis apparently had some lineup fluctuations, with members coming and going, though the story of who was in the group when seems to be told more on the basis of who wants credit for what at any particular time than on what the truth is.\n\nNo matter who was in the group, though, they never had more than local success. While the Del-Phis were trying and failing to become big stars as a group, Martha also started performing solo, as Martha LaVelle. Only a couple of days after her first solo performance, Mickey Stevenson saw her perform and gave her his card, telling her to pop down to Hitsville for an audition as he thought she had talent.\n\nBut when she did turn up, Stevenson was annoyed at her, over a misunderstanding that turned out to be his fault. She had just come straight to the studio, assuming she could audition any time, and Stevenson hadn't explained to her that they had one day a month where they ran auditions -- he'd expected her to call him on the number on the card, not just come down.\n\nStevenson was busy that day, and left the office, telling Martha on his way out the door that he'd be back in a bit, and to answer the phone if it rang, leaving her alone in the office. She started answering the phone, calling herself the \"A&R secretary\", taking messages, and sorting out problems. She was asked to come back the next day, and worked there three weeks for no pay before getting herself put on a salary as Stevenson's secretary.\n\nOnce her foot was in the door at Motown, she also started helping out on sessions, as almost all the staff there did, adding backing vocals, handclaps, or footstomps for a five-dollar-per-session bonus.\n\nOne of her jobs as Stevenson's secretary was to phone and book session musicians and singers, &nbsp;and for one session the Andantes, Motown's normal female backing vocal group, were unavailable. Martha got the idea to call the rest of the DelPhis -- who seem like they might even have been split up at this point, depending on which source you read -- and see if they wanted to do the job instead. They had to audition for Berry Gordy, but Gordy was perfectly happy with them and signed them to Motown. Their role was mostly to be backing vocalists, but the plan was that they would also cut a few singles themselves as well.\n\nBut Gordy didn't want to sign them as the Del-Phis -- he didn't know what the details of their contract with Checkmate were, and who actually owned the name. So they needed a new name.\n\nAt first they went with the Dominettes, but that was soon changed, before they ever made a record What happened is a matter of some dispute, because this seems to be the moment that Martha Reeves took over the group -- it may be that the fact that she was the one booking them for the sessions and so in charge of whether they got paid or not changed the power dynamics of the band -- and so different people give different accounts depending on who they want to seem most important. But the generally accepted story is that Martha suggested a name based on the street she lived on, Van Dyke Street, and Della Reese, Martha's favourite singer, who had hits like \"Don't You Know?\":\n\n[Excerpt: Della Reese, \"Don't You Know?\"]\n\nThe group became Martha and the Vandellas -- although Rosalind Ashford, who says that the group name was not Martha's work, also says that the group weren't \"Martha and the Vandellas\" to start with, but just the Vandellas, and this might be the case, as at this point Gloria rather than Martha was still the lead singer.\n\nThe newly-named Vandellas were quickly put to work, mostly working on records that Mickey Stevenson produced. The first record they sang on was not credited either to the Vandellas *or* to Martha and the Vandellas, being instead credited to Saundra Mallett and the Vandellas – Mallett was a minor Motown singer who they were backing for this one record. The song was one written by Berry Gordy, as an attempt at a \"Loco-Motion\" clone, and was called \"Camel Walk\":\n\n[Excerpt: Saundra Mallett and the Vandellas, \"Camel Walk\"]\n\nMore famously, there was the record that everyone talks about as being the first one to feature the Vandellas, even though it came out after \"Camel Walk\", one we've already talked about before, Marvin Gaye's \"Stubborn Kind of Fellow\":\n\n[Excerpt: Marvin Gaye, \"Stubborn Kind of Fellow\"]\n\nThat became Gaye's breakout hit, and as well as singing in the studio for other artists and trying to make their own records, the Vandellas were now also Marvin Gaye's backing vocalists, and at shows like the Motortown Revue shows, as well as performing their own sets, the Vandellas would sing with Gaye as well. While they were not yet themselves stars, they had a foot on the ladder, and through working with Marvin they got to perform with all sorts of other people -- Martha was particularly impressed by the Beach Boys, who performed on the same bill as them in Detroit, and she developed a lifelong crush on Mike Love.\n\nBut while the Vandellas were Motown's go-to backing vocalists in 1962, they still wanted to make their own records. They did make one record with Gloria singing lead, \"You’ll Never Cherish A Love So True (‘Til You Lose It)\":\n\n[Excerpt: The Vells, \"You’ll Never Cherish A Love So True (‘Til You Lose It)\"]\n\nBut that was released not as by the Vandellas, but by the Vells, because by the time it was released, the Vandellas had more or less by accident become definitively MARTHA and the Vandellas. The session that changed everything came about because Martha was still working as Mickey Stevenson's secretary. Stevenson was producing a record for Mary Wells, and he had a problem.\n\nStevenson had recently instituted a new system for his recordings at Motown. Up to this point, they'd been making records with everyone in the studio at the same time -- all the musicians, the lead singer, the backing vocalists, and so on. But that became increasingly difficult when the label's stars were on tour all the time, and it also meant that if the singer flubbed a note a good bass take would also be wrecked, or vice versa. It just wasn't efficient.\n\nSo, taking advantage of the ability to multitrack, Stevenson had started doing things differently. Now backing tracks would be recorded by the Funk Brothers in the studio whenever a writer-producer had something for them to record, and then the singer would come in later and overdub their vocals when it was convenient to do that. That also had other advantages -- if a singer turned out not to be right for the song, they could record another singer doing it instead, and they could reuse backing tracks, so if a song was a hit for, say, the Miracles, the Marvelettes could then use the same backing track for a cover version of it to fill out an album.\n\nBut there was a problem with this system, and that problem was the Musicians' Union. The union had a rule that if musicians were cutting a track that was intended to have a vocal, the vocalist *must* be present at the session -- like a lot of historical union rules, this seems faintly ridiculous today, but no doubt there were good reasons for it at the time.\n\nMotown, like most labels, were perfectly happy to break the union rules on occasion, but there was always the possibility of a surprise union inspection, and one turned up while Mickey Stevenson was cutting \"I'll Have to Let Him Go\". Mary Wells wasn't there, and knowing that his secretary could sing, Stevenson grabbed her and got her to go into the studio and sing the song while the musicians played. Martha decided to give the song everything she had, and Stevenson was impressed enough that he decided to give the song to her, rather than Wells, and at the same session that the Vandellas recorded the songs with Gloria on lead, they recorded new vocals to the backing track that Stevenson had recorded that day:\n\n[Excerpt: Martha and the Vandellas, \"I'll Have to Let Him Go\"]\n\nThat was released under the Martha and the Vandellas name, and around this point Gloria left the group. Some have suggested that this was because she didn't like Martha becoming the leader, while others have said that it's just that she had a good job working for the city, and didn't want to put that at risk by becoming a full-time singer. Either way, a week after the Vandellas record came out, Motown released \"You’ll Never Cherish A Love So True (‘Til You Lose It)\" under the name The Vells.\n\nNeither single had any chart success, but that wouldn't be true for the next one, which wouldn't be released for another five months. But when it was finally released, it would be regarded as the beginning of the \"Motown Sound\". Before that record, Motown had released many extraordinary records, and we've looked at some of them. But after it, it began a domination of the American charts that would last the rest of the decade; a domination caused in large part by the team of Holland, Dozier, and Holland.\n\nWe've heard a little from the Holland brothers and Lamont Dozier, separately, in previous episodes looking at Motown, but this is the point at which they go from being minor players within the Motown organisation to being the single most important team for the label's future commercial success, so we should take a proper look at them now.\n\nEddie Holland started working with Berry Gordy years before the start of Motown -- he was a singer who was known for having a similar sounding voice to that of Jackie Wilson, and Gordy had taken him on first as a soundalike demo singer, recording songs written for Wilson so Wilson could hear how they would sound in his voice, and later trying to mould him into a Wilson clone, starting with Holland's first single, \"You\":\n\n[Excerpt: Eddie Holland, \"You\"]\n\nHolland quickly found that he didn't enjoy performing on stage -- he loved singing, but he didn't like the actual experience of being on stage. However, he continued doing it, in the belief that one should not just quit a job until a better opportunity comes along. Before becoming a professional singer, Holland had sung in street-corner doo-wop groups with his younger brother Brian. Brian, unlike Eddie, didn't have a particularly great voice, but what he did have was a great musical mind -- he could instantly figure out all the harmony parts for the whole group, and had a massive talent for arrangement.\n\nEddie spent much of his early time working with Gordy trying to get Gordy to take his little brother seriously -- at the time, &nbsp;Brian Holland was still in his early teens, and Gordy refused to believe he could be as talented as Eddie said. Eventually, though, Gordy listened to Brian and took him under his wing, pairing him with Janie Bradford to add music to Bradford's lyrics, and also teaching him to engineer. One of Brian Holland's first engineering jobs was for a song recorded by Eddie, written as a jingle for a wine company but released as a single under the name \"Briant Holland\" -- meaning it has often over the years been assumed to be Brian singing lead:\n\n[Excerpt: Briant Holland, \"(Where's the Joy) in Nature Boy?\"]\n\nWhen Motown started up, Brian had become a staffer -- indeed, he has later claimed that he was the very first person employed by Motown as a permanent staff member. While Eddie was out on the road performing, Brian was &nbsp;writing, producing, and singing backing vocals on many, many records. We've already heard how he was the co-writer and producer on \"Please Mr. Postman\" by the Marvelettes:\n\n[Excerpt: The Marvelettes, \"Please Mr. Postman\"]\n\nThat had obviously been a massive hit, and Motown's first number one, but Brian was still definitely just one of the Motown team, and not as important a part of it as Berry Gordy, Smokey Robinson, or Mickey Stevenson. Meanwhile, Eddie finally had a minor hit of his own, with \"Jamie\", a song co-written by Barrett Strong and Mickey Stevenson, and originally recorded by Strong -- when Strong left the label, they took the backing track intended for him and had Holland record new vocals over it.\n\n[Excerpt: Eddie Holland, \"Jamie\"]\n\nThat made the top thirty, which must have been galling at the time for Strong, who'd quit in part because he couldn't get a hit. But the crucial thing that lifted the Holland brothers from being just parts of the Motown machine to being the most important creative forces in the company was when Brian Holland became friendly with Anne Dozier, who worked at Motown packing records, and whose husband Lamont was a singer.\n\nLamont Dozier had been around musical people all his life -- at Hutchins Junior High School, he was a couple of years below Marv Johnson, the first Motown star, he knew Freda Payne, and one of his classmates was Otis Williams, later of the Temptations. But it was another junior high classmate who, as he puts it, \"lit a fire under me to take some steps to get my own music heard by the world\", when one of his friends asked him if he felt like coming along to church to hear another classmate sing. Dozier had no idea this classmate sang, but he went along, and as it happens, we have some recordings of that classmate singing and playing piano around that time:\n\n[Excerpt: Aretha Franklin, \"There Is a Fountain Filled With Blood\"]\n\nThat's fourteen-year-old Aretha Franklin, and as you can imagine, being classmates with someone who could perform like that caused Lamont Dozier to radically revise his ideas of what it was possible for him to do. He'd formed a doo-wop group called the Romeos, and they released their first single, with both sides written by Lamont, by the time he was sixteen:\n\n[Excerpt: The Romeos, \"Gone Gone Get Away\"]\n\nThe Romeos' third single, \"Fine Fine Fine\", was picked up by Atlantic for distribution, and did well enough that Atlantic decided they wanted a follow-up, and wrote to them asking them to come into the studio. But Lamont Dozier, at sixteen, thought that he had some kind of negotiating power, and wrote back saying they weren't interested in just doing a single, they wanted to do an album. Jerry Wexler wrote back saying \"fair enough, you're released from your contract\", and the Romeos' brief career was over before it began.\n\nHe joined the Voice Masters, the first group signed to Anna Records, and sang on records of theirs like \"Hope and Pray\", the very first record ever put out by a Gordy family label:\n\n[Excerpt: The Voice Masters, \"Hope and Pray\"]\n\nAnd he'd continued to sing with them, as well as working for Anna Records doing odd jobs like cleaning the floors. His first solo record on Anna, released under the name Lamont Anthony, featured Robert White on guitar, James Jamerson on bass, Harvey Fuqua on piano, and Marvin Gaye on drums, and was based on the comic character \"Popeye\":\n\n[Excerpt: Lamont Anthony, \"Popeye the Sailor Man\"]\n\nUnfortunately, just as that record was starting to take off, King Features Syndicate, the owners of Popeye, sent a cease and desist order. Dozier went back into the studio and recut the vocal, this time singing about Benny the Skinny Man, instead of Popeye the Sailor Man:\n\n[Excerpt: Lamont Anthony, \"Benny the Skinny Man\"]\n\nBut without the hook of it being about Popeye, the song flopped.\n\nDozier joined Motown when that became the dominant part of the Gordy family operation, and signed up as a songwriter and producer. Robert Bateman had just stopped working with Brian Holland as a production team, and when Anne Dozier suggested that Holland go and meet her husband who was just starting at Motown, Holland walked in to find Dozier working at the piano, writing a song but stuck for a middle section. Holland told him he had an idea, sat next to him at the piano, and came up with the bridge. The two instantly clicked musically -- they discovered that they almost had a musical telepathy, and Holland got Freddie Gorman, his lyricist partner at the time, to finish up the lyrics for the song while he and Dozier came up with more ideas.\n\nThat song became a Marvelettes album track, \"Forever\", which a few years later would be put out as a B-side, and make the top thirty in its own right:\n\n[Excerpt: The Marvelettes, \"Forever\"]\n\nHolland and Dozier quickly became a strong musical team -- Dozier had a great aptitude for coming up with riffs and hooks, both lyrical and musical, and rhythmic ideas, while Brian Holland could come up with great melodies and interesting chord changes, though both could do both. In the studio Brian would work with the drummers, while Lamont would work with the keyboard players and discuss the bass parts with James Jamerson. Their only shortfall was lyrically. They could both write lyrics -- and Lamont would often come up with a good title or hook phrase -- but they were slow at doing it. For the lyrics, they mostly worked with Freddie Gorman, and sometimes got Janie Bradford in. These teams came up with some great records, like \"Contract on Love\", which sounds very like a Four Seasons pastiche but also points the way to Holland and Dozier's later sound:\n\n[Excerpt: Little Stevie Wonder, \"Contract on Love\"]\n\nBoth Little Stevie Wonder and the backing vocalists on that, the Temptations, would do better things later, but that's still a solid record.\n\nMeanwhile, Eddie Holland had had a realisation that would change the course of Motown. \"Jamie\" had been a hit, but he received no royalties -- he'd had a run of flop singles, so he hadn't yet earned out the production costs on his records. His first royalty statement after his hit showed him still owing Motown money. He asked his brother, who got a royalty statement at the same time, if he was in the same boat, and Brian showed him the statement for several thousand dollars that he'd made from the songs he'd written. Eddie decided that he was in the wrong job. He didn't like performing anyway, and his brother was making serious money while he was working away earning nothing.\n\nHe took nine months off from doing anything other than the bare contractual minimum, -- where before he would spend every moment at Hitsville, now he only turned up for his own sessions -- and spent that time teaching himself songwriting. He studied Smokey Robinson's writing, and he developed his own ideas about what needed to be in a lyric -- he didn't want any meaningless filler words, he wanted every word to matter. He also wanted to make sure that even if people misheard a line or two, they would be able to get the idea of the song from the other lines, so he came up with a technique he referred to as \"repeat-fomation\", where he would give the same piece of information two or three times, paraphrasing it.\n\nWhen the next Marvelettes album, The Marvellous Marvelettes, was being finished up by Mickey Stevenson, Motown got nervous about the album, thinking it didn't have a strong enough single on it, and so Brian Holland and Dozier were asked to come up with a new Marvelettes single in a hurry. Freddie Gorman had more or less stopped songwriting by this point, as he was spending most of his time working as a postman, and so, in need of another writing partner, they called on Eddie, who had been writing with various people. The three of them wrote and produced \"Locking Up My Heart\", the first single to be released with the writing credit \"Holland-Dozier-Holland\":\n\n[Excerpt: The Marvelettes, \"Locking Up My Heart\"]\n\nThat was a comparative flop for the Marvelettes, and the beginning of the downward slump we talked about for them in the episode on \"Please Mr. Postman\", but the second Holland-Dozier-Holland single, recorded ten days later, was a very different matter. That one was for Martha and the Vandellas, and became widely regarded as the start of Motown's true Golden Age -- so much so that Brian and Eddie Holland's autobiography is named after this, rather than after any of the bigger and more obvious hits they would later co-write.\n\nThe introduction to \"Come and Get These Memories\" isn't particularly auspicious -- the Vandellas singing the chorus:\n\n[Excerpt: Martha and the Vandellas, \"Come and Get These Memories\"]\n\nHearing all three of the Vandellas, all of whom have such strong, distinctive voices, sing together is if anything a bit much -- the Vandellas aren't a great harmony group in the way that some of the other Motown groups are, and they work best when everyone's singing an individual line rather than block harmonies.\n\nBut then we're instantly into the sound that Holland, Dozier, and Holland -- really Brian Holland and Lamont Dozier, who took charge of the musical side of things, with Eddie concentrating on the lyrics -- would make their own. There's a lightly swung rhythm, but with a strong backbeat with handclaps and tambourine emphasising the two and four-- the same rhythmic combination that made so many of the very early rock and roll records we looked at in the first year of the podcast, but this time taken at a more sedate pace, a casual stroll rather than a sprint. There's the simple, chorded piano and guitar parts, both instruments often playing in unison and again just emphasising the rhythm rather than doing anything more complex. And there's James Jamerson's wonderful, loping bass part, doing the exact opposite of what the piano and guitar are doing.\n\n[Excerpt: Martha and the Vandellas, “Come and Get These Memories”]\n\nIn almost every record in the rock and roll, soul, and R&B genres up to this point -- I say \"almost every\" because, as I've said many times before, there are always exceptions and there is never a first of anything -- the bass does one of two things: it either plods along just playing the root notes, or it plays a simple, repeated, ostinato figure throughout, acting as a backbone while the other instruments do more interesting things.\n\nJames Jamerson is the first bass player outside the jazz and classical fields to prominently, repeatedly, do something very different -- he's got the guitars and piano holding down the rhythm so steadily that he doesn't need to. He plays melodies, largely improvised, that are jumping around and going somewhere different from where you'd expect.\n\n\"Come and Get These Memories\" was largely written before Eddie's involvement, and the bulk of the lyric was Lamont Dozier's. He's said that in this instance he was inspired by country singers like Loretta Lynn, and the song's lyrical style, taking physical objects and using them as a metaphor for emotional states, certainly seems very country:\n\n[Excerpt: Martha and the Vandellas, \"Come and Get These Memories\"]\n\n\"Come and Get These Memories\" made number twenty-nine on the pop charts and number six on the R&B charts. Martha and the Vandellas were finally stars.\n\nAs was the normal practice at Motown, when an artist had a hit, the writing and production team were given the chance to make the follow-up with them, and so the followup was another Holland/Dozier/Holland song, again from an idea by Lamont Dozier, as most of their collaborations with the Vandellas would be.\n\n\"Heat Wave\" is another leap forward, and is quite possibly the most exciting record that Motown had put out to this point. Where \"Come and Get These Memories\" established the Motown sound, this one establishes the Martha and the Vandellas sound, specifically, and the style that Holland, Dozier, and Holland would apply to many of their more uptempo productions for other artists.\n\nThis is the subgenre of Motown that, when it was picked up by fans in the North of England, became known as Northern Soul -- the branch of Motown music that led directly to Disco, to Hi-NRG, to electropop, to the Stock-Aitken-Waterman hit factory of the eighties, to huge chunks of gay culture, and to almost all music made for dancing in whatever genre after this point. Where \"Come and Get These Memories\" is mid-tempo, \"Heat Wave\" races along. Where \"Come and Get These Memories\" swings, \"Heat Wave\" stomps. \"Come and Get These Memories\" has the drums swinging and the percussion accenting the backbeat, here the drums are accenting the backbeat while the tambourine is hitting every beat dead on, four/four. It's a rhythm which has something in common with some of the Four Seasons' contemporary hits, but it's less militaristic than those. While \"Pistol\" Allen's drumming starts out absolutely hard on the beat, he swings it more and more as the record goes on, trusting to the listener once that hard rhythm has been established, allowing him to lay back behind the beat just a little.\n\nThis is where my background as a white English man, who has never played music for dancing -- when I tried to be a musician myself, it was jangly guitar pop I was playing -- limits me. I have a vocabulary for chords and for melodies, but when it comes to rhythms, at a certain point my vocabulary goes away, and all I can do is say \"just... *listen*\" It's music that makes you need to dance, and you can either hear that or you can't -- but of course, you can:\n\n[Excerpt: Martha and the Vandellas, \"Heat Wave\"]\n\nAnd Martha Reeves' voice is perfect for the song. Most female Motown singers were pop singers first and foremost -- some of them, many of them, *great* pop singers, but all with voices fundamentally suited to gentleness. Reeves was a belter. She has far more blues and gospel influence in her voice than many of the other Motown women, and she's showing it here.\n\n\"Heat Wave\" made the top ten, as did the follow-up, a \"Heat Wave\" soundalike called \"Quicksand\". But the two records after that, both still Holland/Dozier/Holland records, didn't even make the top forty, and Annette left, being replaced by Betty Kelly. The new lineup of the group were passed over to Mickey Stevenson, for a record that would become the one for which they are best remembered to this day. It wasn't as important a record in the development of the Motown sound as \"Come and Get These Memories\" or \"Heat Wave\", but \"Dancing in the Street\" was a masterpiece. Written by Stevenson, Marvin Gaye, and Ivy Joe Hunter, it features Gaye on drums, but the most prominent percussive sound is Hunter, who, depending on which account you read was either thrashing a steel chain against something until his hands bled, or hitting a tire iron.\n\nAnd Martha's vocal is astonishing -- and has an edge to it. Apparently this was the second take, and she sounds a little annoyed because she absolutely nailed the vocal on the first take only to find that there'd been a problem recording it.\n\n[Excerpt: Martha Reeves and the Vandellas, \"Dancing in the Street\"]\n\nThat went to number two in the charts, and would be the group's cultural and commercial high point. The song also gained some notoriety two years later when, in the wake of civil rights protests that were interpreted as rioting, the song was interpreted as being a call to riot -- it was assumed that instead of being about dancing it was actually about rioting, something the Rolling Stones would pick up on later when they released \"Street Fighting Man\", a song that owes more than a little to the Vandellas classic.\n\nThe record after that, \"Wild One\", was so much of a \"Dancing in the Streets\" soundalike that I've seen claims that the backing track is an alternate take of the earlier song. It isn't, but it sounds like it could be. But the record after that saw them reunited with Holland/Dozier/Holland, who provided them with yet another great track, \"Nowhere to Run\":\n\n[Excerpt: Martha Reeves and the Vandellas, \"Nowhere to Run\"]\n\nFor the next few years the group would release a string of classic hits, like \"Jimmy Mack\" and \"Honey Chile\", but the rise of the Supremes, who we'll talk about in a month, meant that like the Marvelettes before them the Vandellas became less important to Motown. When Motown moved from Detroit to LA in the early seventies, Martha was one of those who decided not to make the move with the label, and the group split up, though the original lineup occasionally reunited for big events, and made some recordings for Ian Levine's Motorcity label.\n\nCurrently, there are two touring Vandellas groups. One, Martha Reeves and the Vandellas, consists of Martha and two of her sisters -- including Lois, who was a late-period member of the group before they split, replacing Betty in 1967. Meanwhile \"The Original Vandellas\" consist of Rosalind and Annette. Gloria died in 2000, but Martha and the Vandellas are one of the very few sixties hitmaking groups where all the members of their classic lineup are still alive and performing. Martha, Rosalind, Betty, Annette, and Lois were all also inducted into the Rock and Roll Hall of Fame in 1995, becoming only the second all-female group to be inducted.\n\nThe Vandellas were one of the greatest of the Motown acts, and one of the greatest of the girl groups, and their biggest hits stand up against anything that any of the other Motown acts were doing at the time. When you hear them now, even almost sixty years later, you're still hearing the sound they were in at the birth of, the sound of young America.",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and eleven of A History of Rock Music in Five Hundred Songs looks at \"Heat Wave\" by Martha and the Vandellas, and the beginnings of Holland-Dozier-Holland. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"My Boyfriend's Back\" by the Angels.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, I've created&nbsp;a Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nFor Motown-related information in this and other Motown episodes, I've used the following resources:\n\nWhere Did Our Love Go? The Rise and Fall of the Motown Sound&nbsp;by Nelson George&nbsp;is an excellent popular history of the various companies that became Motown.\n\nTo Be Loved&nbsp;by Berry Gordy&nbsp;is Gordy's own, understandably one-sided, but relatively well-written, autobiography.\n\nWomen of Motown: An Oral History&nbsp;by Susan Whitall is a collection of interviews with women involved in Motown, including Martha and the Vandellas.\n\nI Hear a Symphony: Motown and Crossover R&B&nbsp;by J. Andrew Flory&nbsp;is an academic look at Motown.\n\nThe Motown Encyclopaedia&nbsp;by Graham Betts&nbsp;is an exhaustive look at the people and records involved in Motown's thirty-year history.\n\nHow Sweet It Is by Lamont Dozier and Scott B. Bomar is Dozier's autobiography, while&nbsp;Come and Get These Memories&nbsp;by Brian and Eddie Holland and Dave Thompson is the Holland brothers'.\n\nAnd&nbsp;Motown Junkies is an infrequently-updated blog looking at (so far) the first 694 tracks released on Motown singles.\n\nGirl Groups by John Clemente contains potted biographies of many groups of the era, including Martha and the Vandellas.\n\nAnd&nbsp;Dancing in the Street: Confessions of a Motown Diva&nbsp; by Martha Reeves and Mark Bego is Reeves' autobiography.\n\nAnd this three-CD set contains all the Vandellas' Motown singles, along with a bunch of rarities.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nToday we're going to take a look at the career of one of the great girl groups to come out of Motown, and at the early work of the songwriting team that went on to be arguably the most important people in the definition of the Motown Sound. We're going to look at \"Heatwave\" by Martha and the Vandellas, and the beginning of the career of Holland, Dozier, and Holland:\n\n[Excerpt: Martha and the Vandellas, \"Heatwave\"]\n\nBy the time she started recording for Motown, Martha Reeves had already spent several years in groups around Detroit, with little success. Her singing career had started in a group called The Fascinations, which she had formed with another singer, who is variously named in different sources as Shirley Lawson and Shirley Walker. She'd quickly left that group, but after she left them, the Fascinations went on to make a string of minor hit records with Curtis Mayfield:\n\n[Excerpt: The Fascinations, \"Girls Are Out To Get You\"]\n\nBut it wasn't just her professional experience, such as it was, that Reeves credited for her success -- she had also been a soloist in her high school choir, and from her accounts her real training came from her High School music teacher, Abraham Silver. In her autobiography she talks about hanging around in the park singing with other people who had been taught by the same teacher -- Mary Wilson and Florence Ballard, who would go on to form the Supremes, Bobby Rogers and Claudette Robinson, who were founder members of the Miracles, and Little Joe Harris, who would later become lead singer of the minor Motown act The Undisputed Truth.\n\nShe'd eventually joined another group, the Del-Phis, with three other singers -- ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and eleven of A History of Rock Music in Five Hundred Songs looks at \"Heat Wave\" by Martha and the Vandellas, and the beginnings of Holland-Dozier-Holland. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"My Boyfriend's Back\" by the Angels.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, I've created&nbsp;a Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nFor Motown-related information in this and other Motown episodes, I've used the following resources:\n\nWhere Did Our Love Go? The Rise and Fall of the Motown Sound&nbsp;by Nelson George&nbsp;is an excellent popular history of the various companies that",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}