{
  "title": "What is a Senior Engineer?",
  "link": "",
  "updated": "2019-11-09T00:00:00+00:00",
  "id": "https://mrocklin.github.io/blog/2019/11/09/senior-engineer",
  "content": "<p>Software development is both a highly technical and a highly creative process.\nProgrammers are reasonably proud of their abilities and experience,\nmuch in the same way that expert artists or artisans can be proud of their work.</p>\n\n<p>Unfortunately, like art, there is no obvious scale on which to measure programmers.\nWe throw around terms like “junior engineer” and “senior engineer” on job\ntitles and resumes, but there isn’t a clear definition for these terms.\nIf you look online you’ll find a variety of definitions from a variety of\nbloggers.  This article is one such blogpost.</p>\n\n<p>In this post I lay out my criteria for senior engineers.\nAs with many posts like this, it will mostly focus on non-technical aspects of the job.</p>\n\n<p>For the lazy, I’ll summarize this post in the following sections. Senior engineers …</p>\n\n<ul>\n  <li>Are technically skilled</li>\n  <li>Handle vague requirements</li>\n  <li>Seek to understand context</li>\n  <li>Connect with stakeholders</li>\n  <li>Take ownership and talk back</li>\n  <li>Communicate regularly</li>\n  <li>Handle uncertainty, and are comfortable with failure</li>\n  <li>Ask for help</li>\n  <li>Take vacations</li>\n</ul>\n\n<h2 id=\"are-technically-skilled\">Are technically skilled</h2>\n\n<p>First, senior engineers need to be able to program well.\nThis has less to do with understanding language constructs and frameworks\n(these are traits by which we judge junior engineers)\nand is more about designing systems that can be easily reasoned about,\nmaintained, and extended by junior engineers into the future.</p>\n\n<p><em>Senior engineers can design and implement boring solutions to complex problems.</em></p>\n\n<p>Now, that that’s out of the way,\nlet’s get on to the non-technical aspects of senior engineering.</p>\n\n<h2 id=\"handle-vague-requirements\">Handle vague requirements</h2>\n\n<p>The more senior you are in an organization,\nthe more vague and poorly-specified your tasks become.</p>\n\n<ul>\n  <li>\n    <p>Junior engineers get tasks like</p>\n\n    <p><em>“Run this specific benchmark on this component of our platform.\n Then try swapping out algorithm X for Y and report back the results”</em></p>\n  </li>\n  <li>\n    <p>Senior engineers get tasks like</p>\n\n    <p><em>“Please figure out why the platform is slow and fix it”</em></p>\n  </li>\n</ul>\n\n<p>Junior engineers are more actively managed,\nwhile senior engineers are trusted to figure things out on their own,\nreliably come to a decent solution decently quickly\nwithout someone guiding their way.</p>\n\n<h2 id=\"seek-to-understand-context\">Seek to understand context</h2>\n\n<p>To achieve this,\nsenior engineers acknowledge their own ignorance of the situation,\nseek out others to help them understand the context in which their work matters.</p>\n\n<ul>\n  <li>\n    <p>So given a task like</p>\n\n    <p><em>“Please figure out why the platform is slow and fix it”</em></p>\n  </li>\n  <li>\n    <p>They understand that this was actually</p>\n\n    <p><em>“Someone somewhere is complaining about performance.\nFigure out who this was, what will make them happy,\nand while you’re at it\nsee if there is anything we should be concerned about long term”</em></p>\n  </li>\n</ul>\n\n<p>Senior engineers seek to understand the context of the task given to them so\nthat they can resolve underlying issues efficiently.</p>\n\n<h2 id=\"connect-with-stakeholders\">Connect with Stakeholders</h2>\n\n<p>To do this, a senior engineer reaches out to other stakeholders.\nThis might be the people who raised the issue/ticket,\nthe people who are most affected by it,\nor even just someone they know personally who is well informed about this sort of problem.</p>\n\n<p>The engineer then seeks to learn more about the problem so that they can design\nan efficient plan to solve it.</p>\n\n<p>So for original task above:</p>\n\n<ul>\n  <li><em>“Please figure out why the platform is slow and fix it”</em></li>\n</ul>\n\n<p>they might first ask their colleagues why it’s important that things are fast.\nMaybe it’s just frustrating users that they don’t know how long things will take,\nand so actually the solution to this problem is to implement a progress bar,\nrather than dive into optimizing code,\nwhich, while fun, likely isn’t the best use of time.</p>\n\n<p>The proposed solution given by the manager is often wrong.\nThat’s ok, senior engineers identify the root problem so that they\ncan develop a more effective solution.</p>\n\n<h2 id=\"take-ownership-and-talk-back\">Take ownership and talk back</h2>\n\n<p>A senior engineer should feel comfortable disagreeing with their manager and peers when constructive.\nThey understand that they have been trusted with this problem,\nand the they are likely the person who has the most time to focus on it.\nThey will quickly become the expert here and know more than their managers,\nwho are often distracted and make incorrect judgements about these vague tasks.\nManagers are often juggling many things and so often make mistakes.</p>\n\n<p>As a senior engineer learns more they naturally take control of the problem,\nboth technically and socially,\nand handle communication with the broader team.</p>\n\n<h2 id=\"communicate-regularly\">Communicate regularly</h2>\n\n<p>As the senior engineer takes control,\nthey communicate with the relevant stakeholders about what is going on.\nThis is both to allow other people to plan around the engineer’s work,\nand also to verify that the plans of the engineer remain valid as things inevitably change.\nThis communication might be sending out update e-mails,\nupdating issues/tickets,\nor reaching out to known stakeholders directly in one-on-one conversations.\nThey don’t ask for permission to do these things,\nthey just go ahead if they think that it’s probably the right thing to do.</p>\n\n<h2 id=\"handle-uncertainty-and-fail-comfortably\">Handle uncertainty, and fail comfortably</h2>\n\n<p>Senior engineers are given positions of ownership over difficult problems.\nThey are placed in positions where they are likely to fail.</p>\n\n<p>This is ok.  They know that they will survive.\nWhile a junior engineer might be mortified at making a public mistake,\na senior engineer is self-assure and has enough reputation to fail safely.\nNo one is perfect, and no one can do everything right all the time, especially\nwhen operating on their own.</p>\n\n<h2 id=\"ask-for-help\">Ask for help</h2>\n\n<p>Senior engineers engage peers in the company when necessary to help them\naccomplish larger tasks.\nProbably most of the task that they were given is well within their expertise,\nbut there may be some parts that they know they’re not going to be efficient at.\nTo resolve this, senior engineers know how to ask for short term resources\nwithin their company, and are comfortable doing so, especially when it’s likely\nto be more cost effective for the institution.</p>\n\n<p>So in our example maybe the backend engineer who is building a progress bar\nidentifies that they need a little bit of front-end work to make the bar\nintegrate well into the visual design of the broader product.\nThe senior engineer has learned the process to ask for this help from peers,\nincluding peers from very different teams.</p>\n\n<h2 id=\"take-vacations\">Take Vacations</h2>\n\n<p>Senior engineers have been around long enough to realize that\nthey work and live better when they are well rested.</p>\n\n<p>They also know not to get stressed out by any particular problem,\neven if that problem seems critical at the time.</p>\n\n<p>The senior engineer works a comfortable number of hours during the week,\nand makes sure to take solid chunks of vacation time to help them clear their head,\nand invest in their life and mental health.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>Senior engineers are trusted to get things done.\nFor larger and more vaguely defined tasks this requires\ntechnical, organizational, and emotional maturity.</p>"
}