{
  "title": "ZBT #304: President Trump Is At Sick Call and Kate's MASSIVE Announcement",
  "description": "<p>HUGE ANNOUNCEMENT EPISODE. YUUUUGGGEEEEEE.\n\n-RockyBoots.com promo code \"ZBT\" to get 25% off high quality boots AND military boots that are now MCO P1020.34H compliant.\n-InVets.org/Zero to make a profile, get a free shirt, AND get help transitioning out of the military.\n\nRound 1: The President is at sick call for a while. Does he get a light-duty chit? We’re gonna talk about the ramifications of the Commander in Chief being extremely ill BUT we’re just gonna speculate. If we get anything wrong, please contact Hope Seck.\n\nRound 2: Mail order bride? More like mail order brides, obstruction of justice, and wrongfully using your position for influence, no… its not another round about the President, folks, it’s about a former soldier who has been setting up sham marriages as if junior troops needed the help. \n\nRound 3: Somebody ended up with a huge dumper in their pants and it was captured on TikTok. A guard at the Tomb of the Unknown Soldier nearly had his “I wish a mother fucker would moment.”\n\nRound 4: Over the weekend, I watched a show about Surviving WW2. I was triggered and I’ll tell you why. \n\nRound 5: Hold on to your dicks, there’s a shortage of hot pockets on military bases. We’re gonna tell you why and have a Barracks Meal Snake Draft\n\nRound 6:. An interview with the fellas from Battlebox and Southern Survival on Netflix!</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/ZeroBlog30\">barstool.link/ZeroBlog30</a></p>",
  "guid": "d1f9dcac-22e2-4355-b81d-c3a8c0c194e9",
  "pubDate": "Tue, 6 Oct 2020 07:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/zero-blog-thirty",
  "itunes:explicit": "yes",
  "itunes:duration": "01:32:53",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}