{
  "title": "TranSMS: Transformers for Super-Resolution Calibration in Magnetic Particle Imaging. (arXiv:2111.02163v2 [eess.IV] UPDATED)",
  "link": "http://arxiv.org/abs/2111.02163",
  "description": "<p>Magnetic particle imaging (MPI) offers exceptional contrast for magnetic\nnanoparticles (MNP) at high spatio-temporal resolution. A common procedure in\nMPI starts with a calibration scan to measure the system matrix (SM), which is\nthen used to set up an inverse problem to reconstruct images of the MNP\ndistribution during subsequent scans. This calibration enables the\nreconstruction to sensitively account for various system imperfections. Yet\ntime-consuming SM measurements have to be repeated under notable changes in\nsystem properties. Here, we introduce a novel deep learning approach for\naccelerated MPI calibration based on Transformers for SM super-resolution\n(TranSMS). Low-resolution SM measurements are performed using large MNP samples\nfor improved signal-to-noise ratio efficiency, and the high-resolution SM is\nsuper-resolved via model-based deep learning. TranSMS leverages a vision\ntransformer module to capture contextual relationships in low-resolution input\nimages, a dense convolutional module for localizing high-resolution image\nfeatures, and a data-consistency module to ensure measurement fidelity.\nDemonstrations on simulated and experimental data indicate that TranSMS\nsignificantly improves SM recovery and MPI reconstruction for up to 64-fold\nacceleration in two-dimensional imaging.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/eess/1/au:+Gungor_A/0/1/0/all/0/1\">Alper G&#xfc;ng&#xf6;r</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Askin_B/0/1/0/all/0/1\">Baris Askin</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Soydan_D/0/1/0/all/0/1\">Damla Alptekin Soydan</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Saritas_E/0/1/0/all/0/1\">Emine Ulku Saritas</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Top_C/0/1/0/all/0/1\">Can Bar&#x131;&#x15f; Top</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Cukur_T/0/1/0/all/0/1\">Tolga &#xc7;ukur</a>"
}