{
  "title": "Cities and Growth with Gilles Duranton and Diego Puga",
  "pubDate": "Thu, 30 Jan 2020 01:27:00 +0000",
  "guid": "1093b068-1646-49fe-b501-74f6ee701dec",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP138Durnaton-Puga_EDR.mp3",
  "itunes:image": "",
  "description": "<p>Today's episode features Gilles Duranton and Diego Puga on their new working paper, <a href= \"https://www.nber.org/papers/w26591\">\"Urban Growth and its Aggregate Implications.\"</a> This paper builds a detailed theoretical model that includes urbanization, agglomeration economies, inter-city migration, congestion externalities, and land-use restrictions.</p> <blockquote>We develop an urban growth model where human capital spillovers foster entrepreneurship and learning in heterogeneous cities. Incumbent residents limit city expansion through planning regulations so that commuting and housing costs do not outweigh productivity gains. The model builds on strong microfoundations, matches key regularities at the city and economy-wide levels, and generates novel predictions for which we provide evidence. It can be quantified relying on few parameters, provides a basis to estimate the main ones, and remains transparent regarding its mechanisms. We examine various counterfactuals to assess quantitatively the effect of cities on economic growth and aggregate income.</blockquote> <hr />",
  "content:encoded": "<p>Today's episode features Gilles Duranton and Diego Puga on their new working paper, <a href= \"https://www.nber.org/papers/w26591\">\"Urban Growth and its Aggregate Implications.\"</a> This paper builds a detailed theoretical model that includes urbanization, agglomeration economies, inter-city migration, congestion externalities, and land-use restrictions.</p> We develop an urban growth model where human capital spillovers foster entrepreneurship and learning in heterogeneous cities. Incumbent residents limit city expansion through planning regulations so that commuting and housing costs do not outweigh productivity gains. The model builds on strong microfoundations, matches key regularities at the city and economy-wide levels, and generates novel predictions for which we provide evidence. It can be quantified relying on few parameters, provides a basis to estimate the main ones, and remains transparent regarding its mechanisms. We examine various counterfactuals to assess quantitatively the effect of cities on economic growth and aggregate income. ",
  "enclosure": "",
  "itunes:duration": "48:21",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today's episode features Gilles Duranton and Diego Puga on their new working paper,  This paper builds a detailed theoretical model that includes urbanization, agglomeration economies, inter-city migration, congestion externalities, and land-use...",
  "itunes:episode": 138,
  "itunes:episodeType": "full"
}