{
  "title": "The Gender Salary Ask Gap with Nina Roussille",
  "pubDate": "Thu, 24 Sep 2020 21:58:24 +0000",
  "guid": "94541a8e-2444-4125-a802-1f6be2d96759",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/150_Roussille_edit.mp3",
  "itunes:image": "",
  "description": "<p>Today's guest is <a href=\"https://ninaroussille.github.io/\" target=\"_blank\" rel=\"noopener\">Nina Roussille</a> of UC Berkeley and we discuss her working paper, <strong><a href= \"https://ninaroussille.github.io/files/Roussille_askgap.pdf\">The central role of the ask gap in gender pay inequality</a>.</strong></p> <blockquote>The gender ask gap measures the extent to which women ask for lower salaries than comparable men. This paper studies the role of the ask gap in generating wage inequality using novel data from Hired.com, a leading online recruitment platform for full time engineering jobs in the United States. To use the platform, job candidates must post an ask salary, stating how much they want to make in their next job. Firms then apply to candidates by offering a bid salary they are willing to pay the candidate. If the candidate is hired, final salary is recorded. After adjusting for resume characteristics, the ask gap is 3.3%, the bid gap is 2.4% and the gap in final offers is 1.8%. Remarkably, further controlling for the ask salary explains all of the gender gaps in bid and final salary on the platform. To estimate the market-level effects of an increase in women’s ask salary, I exploit a sudden change in how candidates were prompted to provide their ask salary. For a subset of candidates, in mid-2018, the answer box used to solicit the ask salary went from an empty field to a pre-filled entry with the median salary on the platform for a similar candidate. Comparing candidates creating a profile before and after the feature change, I find that this change drove the ask gap and the bid gap to zero. In addition, women received the same number of bids before and after the change, suggesting they face little penalty for demanding wages comparable to men.</blockquote> <hr /> <p><strong>Related links:</strong></p> <p>During the conversation, Nina mentions Sheryl Sandberg's <a href=\"https://amzn.to/3cqIZde\">Lean In: Women, Work, and the Will to Lead</a>. Among other things, encourages women to negotiate higher salaries, a strategy Nina's research would support.</p>",
  "content:encoded": "<p>Today's guest is <a href=\"https://ninaroussille.github.io/\" target=\"_blank\" rel=\"noopener\">Nina Roussille</a> of UC Berkeley and we discuss her working paper, <a href= \"https://ninaroussille.github.io/files/Roussille_askgap.pdf\">The central role of the ask gap in gender pay inequality</a>.</p> The gender ask gap measures the extent to which women ask for lower salaries than comparable men. This paper studies the role of the ask gap in generating wage inequality using novel data from Hired.com, a leading online recruitment platform for full time engineering jobs in the United States. To use the platform, job candidates must post an ask salary, stating how much they want to make in their next job. Firms then apply to candidates by offering a bid salary they are willing to pay the candidate. If the candidate is hired, final salary is recorded. After adjusting for resume characteristics, the ask gap is 3.3%, the bid gap is 2.4% and the gap in final offers is 1.8%. Remarkably, further controlling for the ask salary explains all of the gender gaps in bid and final salary on the platform. To estimate the market-level effects of an increase in women’s ask salary, I exploit a sudden change in how candidates were prompted to provide their ask salary. For a subset of candidates, in mid-2018, the answer box used to solicit the ask salary went from an empty field to a pre-filled entry with the median salary on the platform for a similar candidate. Comparing candidates creating a profile before and after the feature change, I find that this change drove the ask gap and the bid gap to zero. In addition, women received the same number of bids before and after the change, suggesting they face little penalty for demanding wages comparable to men.  <p>Related links:</p> <p>During the conversation, Nina mentions Sheryl Sandberg's <a href=\"https://amzn.to/3cqIZde\">Lean In: Women, Work, and the Will to Lead</a>. Among other things, encourages women to negotiate higher salaries, a strategy Nina's research would support.</p>",
  "enclosure": "",
  "itunes:duration": "54:01",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today's guest is  of UC Berkeley and we discuss her working paper, . The gender ask gap measures the extent to which women ask for lower salaries than comparable men. This paper studies the role of the ask gap in generating wage inequality using novel...",
  "itunes:episode": 150,
  "itunes:episodeType": "full"
}