{
  "title": "Episode 108: More Harm Than Good? Kubler-Ross' Five Stages of Grief",
  "pubDate": "Mon, 26 Oct 2009 10:36:32 +0000",
  "guid": "episode-108-more-harm-than-good-kublerross-fiv",
  "link": "http://www.thepsychfiles.com/2009/10/episode-108-kubler-ross-five-stages-of-grief-more-harm-than-good/",
  "itunes:image": "",
  "description": "Almost everyone has heard of Elisabeth Kubler-Ross, her book On Death and Dying, and her five stages of grief.  But are these stages accurate?  Could the five stages of grief actually be doing more harm than good? Are they helping us to better understand what dying people go through or are they making it more difficult for us to truly understand and relate to them?  Find out in this episode of The Psych Files.",
  "content:encoded": "Almost everyone has heard of Elisabeth Kubler-Ross, her book On Death and Dying, and her five stages of grief.  But are these stages accurate?  Could the five stages of grief actually be doing more harm than good? Are they helping us to better understand what dying people go through or are they making it more difficult for us to truly understand and relate to them?  Find out in this episode of The Psych Files.",
  "enclosure": "",
  "itunes:duration": "30:14",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,and,death,ross,psychology,lecture,dying,kubler",
  "itunes:subtitle": "Almost everyone has heard of Elisabeth Kubler-Ross, her book On Death and Dying, and her five stages of grief.  Are these stages accurate? Are they helping us understand what dying people go through or could be they be making it more difficult?",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Almost everyone has heard of Elisabeth Kubler-Ross, her book On Death and Dying, and her five stages of grief. But are these stages accurate? Could the five stages of grief actually be doing more harm than good? Are they helping us to better understand what dying people go through or are they making it more difficult for us to truly understand and relate to them? Find out in this episode of The Psych Files."
}