{
  "title": "EPISODE 28 Jack Johnson (Part 3): Nobody’s Slave",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Thu, 04 Jan 2018 23:14:08 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2018/1/5/episode-28-jack-johnson-part-3-nobodys-slave",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5a4ea940e2c4837fbba0b926",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1515105679038-7HW9ML1T28PCKEUVXXU2/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"5a4ead8d0852296d709016f8\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1515105679038-7HW9ML1T28PCKEUVXXU2/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“He refused to allow anyone—white or black—or any laws and customs—to dictate his place in society or the manner in which he should live.”</em> — Al-Tony Gilmore</p><p class=\"\"><em>“This negro, in the eyes of many, has been persecuted. Perhaps as an individual he was. But it was his misfortune to be the foremost example of the evil in permitting the intermarriage of whites and blacks.”</em> — Asst Atty. Gen. Harry Parkin </p><p class=\"\"><em>“No brutality, no infamy, no degradation in all the years of Southern slavery, possessed such a villainous character and such atrocious qualities as the provision of the laws of Illinois, New York, Massachusetts, and other states which allow the marriage of the negro, Jack Johnson, to a woman of Caucasian strain.” He continued “Intermarriage between whites and blacks is repulsive and averse to every sentiment of pure American spirit. It is abhorrent and repugnant to the very principles of a pure Saxon government. It is subversive to social peace. It is destructive of moral supremacy, and ultimately this slavery of white women to black beasts will bring this nation to a conflict as fatal and as bloody as ever reddened the soil of Virginia or crimsoned the mountain paths of Pennsylvania… Let us uproot and exterminate now this debasing, ultrademoralizing, un-American and inhuman leprosy.”</em> — Congressman from Georgia Seaborn Roddenberry </p><p class=\"\"><em>“It comes down, then, after all to this unforgivable blackness.”</em> — W.E.B. Du Bois</p><p class=\"\"><em>“I loved him because of his courage. He faced the world unafraid. There wasn't anybody or anything he feared.”</em> — Irene Pineau&nbsp;</p><p class=\"\"><em>“I would rather listen to you than hear an oration from a professional politician. I can learn more from you.”</em> — Mexican President Venustiano Carranza&nbsp;</p><p class=\"\">By 1900, the federal government had long abandoned Reconstruction, and white supremacy was returning to the South with a vengeance. Jim Crow was in full swing. Segregation was the law of the land. And Fifty years before Jackie Robinson challenged segregation in baseball, there was Jack Johnson.&nbsp;</p><p class=\"\">Lynching was a weekly event. Any black man in the South not acting subservient could find himself dangling from a tree. Even African American leaders like Booker T. Washington preached that accepting segregation, keeping one’s head down, and working hard were the best options for black people.</p><p class=\"\">Jack Johnson clearly didn’t get the memo.</p><p class=\"\">At this time when simply looking a white man in the eyes, or talking to a white woman, could get one lynched, Jack Johnson made a living beating the hell out of white men in the ring. Living defiantly as if prejudice didn’t exist—he felt—was the best way to defeat racism.&nbsp;</p><p class=\"\">It would be easy to mistake Jack Johnson’s story simply as a tale of standing up to racism. It’s about that—sure. But it’s also about a lot more. Because as much Jack Johnson stared down white supremacy, he also battled those black people who insisted that he behaved like a hard-working, God-fearing role model. But JJ wasn’t about to trade a cage for another. He wouldn’t be anyone’s puppet. He would have no master telling him how to live—not white ones, but no black ones either. His story is the tale of a man who, in spite of a time and place that would not allow it, was on a defiant quest to be free, and live life on his own terms.&nbsp;</p><p class=\"\">In this episode:</p><ul data-rte-list=\"default\"><li><p class=\"\">The campaign to ban boxing</p></li><li><p class=\"\">Grappling with the demons of success</p></li><li><p class=\"\">Jack Johnson vs. Winston Churchill</p></li><li><p class=\"\">Marriage and suicide</p></li><li><p class=\"\">Legal persecution and marriage # 2</p></li><li><p class=\"\">The Police Gazette calling him “the vilest, most despicable creature that lives… he has disgusted the American public by flaunting in their faces an alliance as bold as it was offensive.”</p></li><li><p class=\"\">The paranoid hysteria at the roots of the Mann Act</p></li><li><p class=\"\">Running from the Law</p></li><li><p class=\"\">The title defense against Frank Moran</p></li><li><p class=\"\">At a party with Rasputin</p></li><li><p class=\"\">Rubbing elbows with Pancho Villa</p></li><li><p class=\"\">Jess Willard</p></li><li><p class=\"\">Prison life</p></li><li><p class=\"\">Marriage # 3<br></p></li></ul><p class=\"\">This episode is sponsored by <a href=\"http://www.flaviar.com/exclusive\">Flaviar</a>, the world’s largest online club of spirits enthusiasts. Members get a themed tasting box that let you try different spirits before buying a full sized bottle, and access to their Vault which holds a selection of rare and hard to find spirits available to members only. Please, check them out and use the coupon code HISTORY at checkout.&nbsp;</p><p class=\"\">If you like it when high quality watches and affordable prices go together, check out getthewatch.net and use the code HISTORY for a 15% discount </p><p class=\"\">This episode is sponsored by <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a> For less than $ 10 per meal, Blue Apron delivers straight to your door seasonal recipes along with pre-portioned ingredients to make delicious, home-cooked meals. Get your first three meals free—with free shipping—by going to <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a>&nbsp;</p><p class=\"\">A big thank you for the support to the podcast <em>How It Began: A History of the Modern World</em> by Brad Harris. Brad holds a PhD in history from Stanford University and is the host of a great new podcast focusing the most important scientific, technological and cultural advancements in history. So, please check out his podcast and his website <a href=\"https://howitbegan.com/\">https://howitbegan.com/</a>&nbsp;</p><p class=\"\">Please, also show some love to my regular sponsors by shopping for supplements, special foods, clothing and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;</p><p class=\"\">And if you are in the market for backpacks, computer bags and other hemp gear, check out my favorites at <a href=\"http://www.dsgear.com\">http://www.dsgear.com</a>&nbsp;</p><p class=\"\">PATREON NEWS: I have just started a Patreon account!!!! If you feel in a generous mood, please, check it out at <a href=\"http://www.patreon.com/historyonfire\">www.patreon.com/historyonfire</a>&nbsp;</p><p class=\"\">My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>. Thank you to Onnit, Datsusara, Float Clinic, Shaman’s Simple Solutions, War Fuel, Proven Nutrition, and Fight Chix for sponsoring her for her first MMA fight. If you’d like to check out Fight Chix merchandise, you can get a 20% discount by going to <a href=\"http://www.fightchix.com/\">http://www.fightchix.com/</a> and entering the code Fire20 upon checkout.</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "2:07:51",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 28,
  "itunes:title": "EPISODE 28 Jack Johnson (Part 3): Nobody’s Slave",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 28 Jack Johnson (Part 3): Nobody’s Slave"
  }
}