{
  "title": "How the Soviets \"Fixed\" Inflation, but Ruined the Economy",
  "link": "https://mises.org/node/60844",
  "description": "<p>Price inflation and the resulting business cycles are monetary phenomena, and without increases in the money supply—i.e., monetary inflation—<a href=\"https://mises.org/wire/shortages-arent-causing-inflation-money-creation\">there is no price inflation</a>. If the world were a very simple place, we would see this relationship clearly displayed: when the money supply increased, we would also see a general increase in prices soon thereafter. The world, however, is not a very simple place and an economy can include countless factors that can mask, delay, and otherwise obscure the connection between monetary inflation and price inflation. </p>\n<p>For example, monetary policymakers in the US have long benefited from the disinflationary effects of global trade and increasing worker productivity. This means that, for decades, consumers <em>should</em> have seen prices of most goods and services falling. Instead, relentless monetary inflation over the past three decades has resulted in <em>positive</em> price growth that is seemingly mild, and policymakers can claim victory over inflation. Moreover, new money can enter the economy in a variety of ways, often manifesting as asset-price inflation rather than as noticeably high price increases in food or household goods. </p>\n<p>Governments also have many tools at their disposal to delay or hide the effects of monetary inflation, sometimes for many years. Price controls and subsidies, for example, can obscure the true costs of goods and services for the end consumer. These tactics cause shortages, bubbles, and other problems, but these can often be blamed on \"greed\" or \"capitalism.\" </p>\n<p>One particularly interesting case of how governments can hide price inflation for <em>decades</em> is the Soviet Union. Under the Soviet regime, the money supply—denominated in unbacked fiat money, of course—was continually expanded to increase wages and create the impression of prosperity. This <em>would </em>have led to price inflation quickly, but for the shortage economy and demand-killing government policies endured by the average Soviet citizen. As is so often the case, the regime was able to cover up the effects of inflation for a time, but the policies ultimately proved to be disastrous. </p>\n<h4>Preventing Inflation through State Control of the Economy</h4>\n<p>As a regime increases the money supply, demand will generally rise. But rising prices will become acute only if there are actually products and services on which consumers and enterprises can spend their new money. Thus, a regime wishing to avoid price inflation can keep increasing the money supply so long as it also reduces demand by limiting the availability of goods. This prevents improvements in the standard of living, but it can indeed keep down price inflation. </p>\n<p>This cannot be easily done in a country where the population expects to live under a relatively free economy. In an unhampered or partially interventionist economy, a lack of widespread price controls often means a large number of goods and services will continue to be supplied, albeit at higher prices, in an inflationary environment. But, because the USSR oversees a heavily controlled, command economy, the regime could more easily dictate prices, limit imports, and force consumers to save rather than spend.</p>\n<p>Ultimately, though, by the late 1980s, the regime was forced to \"open up\" its economy to market forces as a restive population increasingly demanded a standard of living more in line with what existed in the West. However, once the regime ceased controlling prices and savings, prices exploded, government revenues cratered, and the Soviet regime ended its days in an orgy of money printing and hyperinflation. </p>\n<h4>How the Soviet Regime Manipulated Price Inflation</h4>\n<p>The fact that the Soviet regime preferred shortages to inflation has its roots in the hyperinflationary history of the Soviet economy. By the middle of the twentieth century, Soviet planners were already well aware of the dangers of hyperinflation. With the end of the czarist regime, and the cessation of the First World War, the new socialist regime took over a country that was already broke and highly dysfunctional. Hyperinflation soon followed. The Bolsheviks attempted to do away with money altogether, but this naturally failed, and a number of monetary reforms followed. By the late 1920s, however, the regime was engaging in widespread price control efforts, including the highly unusual tactic of peacetime rationing. This limited price inflation for many goods and set the stage for the \"repressed inflation\" that would become a mainstay of the Soviet system for decades. Prices nevertheless began to rise rapidly in many areas, and the Second World War brought on a new wave of price inflation and prices spiraled upward. This was followed by another currency reform—i.e., devaluation—of the Soviet ruble in 1947. Efforts at price controls were redoubled and overall prices actually declined during the 1950s. </p>\n<p>Throughout much of the 1950s and early sixties, the regime was perennially concerned about price inflation. In fact, Soviet ideology stipulated that inflation did not actually exist in the USSR. <a href=\"https://www.federalreserve.gov/pubs/rfd/1962/386/rfd386.pdf\">As claimed by</a> Vasily Garbuzov, the Soviet Minister of Finance in 1960:</p>\n<blockquote><p>In the Soviet Union there is not and cannot be any inflation; the possibility of inflation is fully precluded by the very system of planned socialist economy. In our country both wholesale and retail prices are established by the government and, therefore, the purchasing power of the ruble is controlled on a planned basis. ...The stability of Soviet currency is guaranteed by the monopoly of currency and the monopoly of foreign trade which is one of the most important advantages of the socialist economic system.</p></blockquote>\n<p>This is propaganda, of course, but in a sense, Garbuzov was right. A socialist state really <em>could</em> moderate the price effects of monetary inflation by throttling back the standard of living and consumption options whenever it seemed prices were rising.</p>\n<p>This was necessary because the money supply continually expanded as wages rose. In <a href=\"https://www-jstor-org.ezproxy2.library.colostate.edu/stable/151563#metadata_info_tab_contents\">their 1985 study on the Soviet economy</a>, Igor Birman and Roger Clarke wrote: </p>\n<blockquote><p>The reason for the excess supply of money is that the state has consistently 'over-paid' the population in the form of wages, pensions, stipends etc., which exceed production (plus net imports and minus net exports) of consumer goods at the currently ruling retail prices (fixed by the state). While there has indeed been a steady rise in retail prices (despite the stability of the official index) this has been very far from sufficient to equalise the real effective demand of the population with the available supply of goods. In other words, the state generates excessive purchasing power in the hands of the population.</p></blockquote>\n<p>In an unhampered economy wages are closely tied to the productivity of workers, so wages would not grow out of proportion to the amount of goods and services available in the economy. In a socialist, economy, however, the price of labor—i.e., wages—were arbitrarily set like all other prices. Wages under socialism are also paid out of the public treasury and can be increased to the liking of the regime itself. This often meant rising wages because higher wages were politically popular. Rising wages potentially created the impression of prosperity, even when the economy wasn't actually more productive. Also, as Birman and Clarke note</p>\n<blockquote><p>During the last two decades [i.e., 1965 to 1985] it has pursued the 'confidence trick' policy of trying to stimulate productivity by higher money wages without raising the supply of consumer goods by nearly sufficient to translate the increase in money wages into increased real incomes.</p></blockquote>\n<p>Increasingly, after 1965, the Soviet money supply was out of proportion to the productive capability of the economy. In a relatively free economy, this would quickly lead to price inflation, but the Soviet regime had ways of shifting the economic burden elsewhere. </p>\n<p>Thus, prices were kept under control not through fiscal disciple, but through price controls. This led to shortages because, if wages were rising while goods prices could not, demand quickly exceeded supply. Soviet citizens often found they had very little to spend their money <em>on</em>, with the result being the long queues and empty store shelves we now associate with the Soviet economy. </p>\n<p>By this mechanism, the regime can continue to inject new money into the economy but also prevent ordinary people from spending \"too much\" money and thus ratcheting up consumer prices. The downside, of course, is that the standard of living goes down considerably, as <a href=\"https://dc.etsu.edu/etd/1474/\">historian Steven Efremov notes</a>: </p>\n<blockquote><p>The system of price controls had deleterious effects both for Soviet consumers and for the economy as a whole. ... Shortages of most foods led to lower quality diets, and many consumer products that were routinely available in the West, such as telephones, cars, and modern washing machines were amazingly rare in the Soviet Union. Living conditions were less comfortable in many ways, with less housing space per person, no central heating, no air conditioning, and often no sewer connections or hot water. </p></blockquote>\n<p>The result was essentially forced savings. Efremov continues: </p>\n<blockquote><p>When consumers could not find anything they wanted to buy, many chose to save a portion of their income every year. This effect was cumulative over the years, as unsatisfied demand from each year was carried over to the next and the population's savings continued to grow.</p></blockquote>\n<p>In some respects, this was good for the regime because this unspendable savings could also be tapped for buying the government's debt. But this stored up money—known as the \"monetary overhang\" increased much more rapidly than did the production of goods and services, and Efremov concludes \"the money supply had grown to become many times larger than what was needed for regular circulation.\" This would come back to haunt the regime when the economy began to open up and consumers could finally spend the money, causing prices to soar. </p>\n<p>An additional method of pushing down official inflation numbers was to subsidize consumer goods. Retail price subsidies were introduced in in the Soviet Union in 1965 as part of a major economic reform package. Soviet authorities then began to implement price subsidies of \"basic foods such as meat, milk, bread, sausages, sugar, and butter.\"<a class=\"see-footnote\" id=\"footnoteref1_rrck71p\" title=\"Byung-Yeon Kim, \"Causes of Repressed Inflation in the Soviet Consumer Market, 1965-1989: Retail Price Subsidies, the Siphoning Effect, and the Budget Deficit,\" The Economic History Review 55, no. 1 (Feb. 2002):108\" href=\"#footnote1_rrck71p\">1</a> The purpose was to keep prices stable. These subsidies survived subsequent economic reform efforts and became a larger and larger part of the economy heading into the 1980s, with government spending rapidly increasing to push down prices through subsidies.</p>\n<h4>Spending Rises and the Economy Stagnates </h4>\n<p>None of this worked to actually help the Soviet standard of living. </p>\n<p>To combat the effects of monetary expansion and falling standards of living, the Soviet regime perennially attempted to increase production to narrow the gap between money growth and productivity growth. Due to the impossibility of economic calculation under socialism, however, Soviet central planning could not coordinate goods and capital efficiently, and the productivity of workers stagnated. </p>\n<p>Another result was further declines in government revenue. Although taxes were levied and some revenue could be collected on imports, government monopolies—i.e., government-owned enterprises—controlling a variety of goods and services produced much of the income the regime relied on. These enterprises could theoretically increase revenues with increased output, but output often stagnated as wages—i.e., production costs—rose.</p>\n<p>Government budgets thus increased alongside falling revenue. Byung-Yeon Kim notes, for example, that \"retail price subsidies ... rose from 4 per cent of state budget expenditure in 1965 to 20 per cent in the late 1980s.\"<a class=\"see-footnote\" id=\"footnoteref2_82ubdrl\" title=\"Ibid., p. 106\" href=\"#footnote2_82ubdrl\">2</a> </p>\n<p>Yet, the availability of consumer goods certainly did not keep up. Rather, consumer had few places to spend their money and \"the share of forced savings in total monetary savings increased from 9 per cent in 1965 to 42 per cent in 1989.\"<a class=\"see-footnote\" id=\"footnoteref3_lxdee8l\" title=\"Ibid.\" href=\"#footnote3_lxdee8l\">3</a></p>\n<p>Measured by the prevalence of shortages, it is clear the Soviet economy was in a state of stagnation by the late 70s. Shortages became even worse. Kim concludes: </p>\n<blockquote><p>Consumer market conditions in the official retail network deteriorated rapidly in the years 1965-78. This is most likely to have been caused by stable consumer prices faced with rising consumer purchasing power. Even though the rapid deterioration halted during the period 1979-83, this was not sufficient to restore equilibrium. Further worsening of consumer market conditions occurred after 1984. In particular, shortages in the consumer market intensified significantly in 1989 because household money income increased much faster than the availability of consumer goods.<a class=\"see-footnote\" id=\"footnoteref4_q2nqlux\" title=\"Ibid., p. 115.\" href=\"#footnote4_q2nqlux\">4</a></p></blockquote>\n<p>The wage increases continued with little positive effect. Throughout the 1980s, Soviet state-owned enterprises raised wages in an attempt to create a \"wealth effect\" and to placate dissatisfied workers. Yet, with few goods available to buy, rising wages ceased to be much of an inducement to harder work. Birman and Clarke <a href=\"https://www-jstor-org.ezproxy2.library.colostate.edu/stable/151563#metadata_info_tab_contents\">note</a> that after a time, rising wages \"become ineffective—additional unspendable money is no longer an incentive to work harder or more productively.\" Worker productivity suffered. This problem only accelerated as the decade wore on and, as Igor Filatochev and Roy Bradshaw <a href=\"https://www.tandfonline.com/doi/abs/10.1080/09668139208412045\">note</a>, \"wages increas[ed] four times faster than labour productivity throughout 1989 and 1990.\"</p>\n<h4>The 1980s: A Time of Growing Deficits and Money Printing </h4>\n<p>All of this spending on wages and subsidies combined to create conditions under which government deficits rose, leading for even greater monetary expansion. Kim concludes:</p>\n<blockquote><p>Although the budget deficit was officially recorded only from 1985 onwards, many reliable Soviet and western sources have maintained that a sizable deficit already existed well before the 1980s.<a class=\"see-footnote\" id=\"footnoteref5_uwalw70\" title=\"Ibid., p. 115.\" href=\"#footnote5_uwalw70\">5</a></p></blockquote>\n<p>Up until the 1970s, there had been a connection between revenues and spending to the point that deficits were manageable. As time went on, borrowing to address deficits became increasingly expensive for the regime, and printing money—above and beyond the need for wages—was increasingly viewed as a way out:</p>\n<blockquote><p>[P]rinting of money began well before the late 1980s, that is, from 1977 onwards, and tended to increase during the late 1970s and early 1980s. Overall, the Soviet budget tended to destabilize the consumer market, at least after 1977, by putting money into circulation. In particular, a sharp increase in printing money in the late 1980s suggests that the Soviet economy was then on the verge of collapse.<a class=\"see-footnote\" id=\"footnoteref6_y7r26my\" title=\"Ibid., p. 122.\" href=\"#footnote6_y7r26my\">6</a></p></blockquote>\n<p class=\"text-center\"><strong>Amount of Deficit Financed by Printing Money</strong></p>\n<h4><div class=\"media media-element-container media-image_no_caption\"><a href=\"https://cdn.mises.org/printing.jpg\" title=\"print\" class=\"colorbox\" data-colorbox-gallery=\"gallery-all-bp7VN8KKhhg\" data-cbox-img-attrs=\"{\"title\": \"\", \"alt\": \"print\"}\"><img class=\"media-element file-image-no-caption\" data-delta=\"1\" alt=\"print\" typeof=\"foaf:Image\" src=\"https://cdn.mises.org/styles/max_1160/s3/printing.jpg?itok=6gmP1y93\" width=\"827\" height=\"483\" title=\"\" /></a></div></h4>\n<h6>Source: <span style=\"color: rgb(0, 0, 0); font-family: sans-serif;\">Byung-Yeon Kim, \"Causes of Repressed Inflation in the Soviet Consumer Market, 1965-1989: Retail Price Subsidies, the Siphoning Effect, and the Budget Deficit,\" </span><em style=\"color: rgb(0, 0, 0); font-family: sans-serif;\">The Economic History Review</em><span style=\"color: rgb(0, 0, 0); font-family: sans-serif;\"> 55, no. 1 (Feb. 2002): 121</span></h6>\n<h4>Hyperinflation Sets In </h4>\n<p>By the late 1980s, the Soviet economy was already primed for price inflation, yet so-called repressed inflation continued to be a sizable factor pushing down official inflation rates until the mid 1980s. With the advent of perestroika and some limited promarket reforms, Soviet citizens were increasingly able to purchase more goods and import more goods. Decades of forced saving led to runaway inflation as shortages became less acute in many cases. That \"monetary overhang\" came out of savings accounts and drove price inflation to disastrous heights. </p>\n<p>It took some time for the official numbers to catch up with reality. The regime's official numbers had long understated even the moderate levels of price inflation in earlier periods, but after the mid-80s, the gap between official inflation and estimated real inflation grew considerably. Efremov <a href=\"http://dc.etsu.edu/etd/1474/\">summarizes</a> the divergence, noting that in 1988 official inflation was 0.6 percent but 6 percent in the <em>real </em>marketplace. By 1989, official inflation was 2 percent, but it was really 8 percent. In 1990, it was 5.3 percent, but really 20 percent. And then the wheels started to really come off in 1991, with 96.3 \"official\" inflation that was really 200 percent. </p>\n<p>The Soviet Union collapsed shortly thereafter, and the new regime did not issue falsified inflation numbers anymore. Instead, the real inflation rate in 1992 was estimated to be more than 2,300 percent. Hyperinflation continued for three more years until the old Soviet ruble finally ceased to exist.</p>\n<h4>A Socialist Guide to Lowering Price Inflation</h4>\n<p>The Soviet experience provides an example of how expanding the money supply forces a choice. In response, an inflationist regime can commit to reining in monetary inflation to tackle rising prices. Or, a regime can \"solve\" an inflation problem by destroying demand via price controls and shortages.  The latter choice requires lowering the standard of living and gradually reducing consumer choices again and again. Yet, even this draconian option fails to prevent hyperinflation in the end.</p>\n\n<ul class=\"footnotes\"><li class=\"footnote\" id=\"footnote1_rrck71p\"><a class=\"footnote-label\" href=\"#footnoteref1_rrck71p\">1.</a> Byung-Yeon Kim, \"Causes of Repressed Inflation in the Soviet Consumer Market, 1965-1989: Retail Price Subsidies, the Siphoning Effect, and the Budget Deficit,\" <em>The Economic History Review</em> 55, no. 1 (Feb. 2002):108</li>\n<li class=\"footnote\" id=\"footnote2_82ubdrl\"><a class=\"footnote-label\" href=\"#footnoteref2_82ubdrl\">2.</a> Ibid., p. 106</li>\n<li class=\"footnote\" id=\"footnote3_lxdee8l\"><a class=\"footnote-label\" href=\"#footnoteref3_lxdee8l\">3.</a> Ibid.</li>\n<li class=\"footnote\" id=\"footnote4_q2nqlux\"><a class=\"footnote-label\" href=\"#footnoteref4_q2nqlux\">4.</a> Ibid., p. 115.</li>\n<li class=\"footnote\" id=\"footnote5_uwalw70\"><a class=\"footnote-label\" href=\"#footnoteref5_uwalw70\">5.</a> Ibid., p. 115.</li>\n<li class=\"footnote\" id=\"footnote6_y7r26my\"><a class=\"footnote-label\" href=\"#footnoteref6_y7r26my\">6.</a> Ibid., p. 122.</li>\n</ul>\n",
  "author": "Ryan McMaken",
  "enclosure": "",
  "guid": 60844,
  "pubDate": "Thu, 03 Nov 2022 16:15:00 -0500",
  "source": "Mises Wire"
}