{
  "title": "Tom Cruise VINDICATED For Viral Rant Against Big Pharma – New Study",
  "itunes:title": "Tom Cruise VINDICATED For Viral Rant Against Big Pharma – New Study",
  "pubDate": "Fri, 29 Jul 2022 23:00:23 +0000",
  "guid": "3297c4a2-73a6-4931-8494-280b856688df",
  "link": "https://thejimmydoreshow.libsyn.com/tom-cruise-vindicated-for-viral-rant-against-big-pharma-new-study",
  "itunes:image": "",
  "description": "<p>In 2005 Tom Cruise was widely mocked, derided and accused of being a lunatic after appearing on the Today Show and expressing controversial views about the ineffectiveness of antidepressants and the widespread practice of prescribing Ritalin and Adderall to children. Now 17 years later Cruise is being vindicated by a comprehensive study questioning the science behind “chemical imbalances” in the brain and demonstrating that antidepressants do not work as advertised. Jimmy and America’s comedian Kurt Metzger discuss their recollection of the infamous interview and how the march of scientific advancement has now caught up with… Tom Cruise.<br /> <br /> Plus a segment speaking with The Grayzone's Aaron Maté about confronting the writer who smeared him in the pages of The Guardian.<br /> <br /> Also featuring Stef Zamorano, Kurt Metzger and Mike MacRae! And phone calls from Joe Biden and Al Pacino!</p> <p><br /> <br /> <br /></p>",
  "content:encoded": "<p>In 2005 Tom Cruise was widely mocked, derided and accused of being a lunatic after appearing on the Today Show and expressing controversial views about the ineffectiveness of antidepressants and the widespread practice of prescribing Ritalin and Adderall to children. Now 17 years later Cruise is being vindicated by a comprehensive study questioning the science behind “chemical imbalances” in the brain and demonstrating that antidepressants do not work as advertised. Jimmy and America’s comedian Kurt Metzger discuss their recollection of the infamous interview and how the march of scientific advancement has now caught up with… Tom Cruise.  Plus a segment speaking with The Grayzone's Aaron Maté about confronting the writer who smeared him in the pages of The Guardian.  Also featuring Stef Zamorano, Kurt Metzger and Mike MacRae! And phone calls from Joe Biden and Al Pacino!</p> <p>  </p>",
  "enclosure": "",
  "itunes:duration": "56:56",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "In 2005 Tom Cruise was widely mocked, derided and accused of being a lunatic after appearing on the Today Show and expressing controversial views about the ineffectiveness of antidepressants and the widespread practice of prescribing Ritalin and...",
  "itunes:episodeType": "full",
  "itunes:summary": "In 2005 Tom Cruise was widely mocked, derided and accused of being a lunatic after appearing on the Today Show and expressing controversial views about the ineffectiveness of antidepressants and the widespread practice of prescribing Ritalin and Adderall to children. Now 17 years later Cruise is being vindicated by a comprehensive study questioning the science behind “chemical imbalances” in the brain and demonstrating that antidepressants do not work as advertised. Jimmy and America’s comedian Kurt Metzger discuss their recollection of the infamous interview and how the march of scientific advancement has now caught up with… Tom Cruise. Plus a segment speaking with The Grayzone's Aaron Maté about confronting the writer who smeared him in the pages of The Guardian. Also featuring Stef Zamorano, Kurt Metzger and Mike MacRae! And phone calls from Joe Biden and Al Pacino!"
}