{
  "title": "Higgs Condensates are Symmetry-Protected Topological Phases: I. Discrete Symmetries. (arXiv:2211.01376v1 [cond-mat.str-el])",
  "link": "http://arxiv.org/abs/2211.01376",
  "description": "<p>Where in the landscape of many-body phases of matter do we place the Higgs\ncondensate of a gauge theory? On the one hand, the Higgs phase is gapped, has\nno local order parameter, and for fundamental Higgs fields is adiabatically\nconnected to the confined phase. On the other hand, Higgs phases such as\nsuperconductors display rich phenomenology. In this work, we propose a minimal\ndescription of the Higgs phase as a symmetry-protected topological (SPT) phase,\nutilizing conventional and higher-form symmetries. In this first part, we focus\non 2+1D $\\mathbb Z_2$ gauge theory and find that the Higgs phase is protected\nby a higher-form magnetic symmetry and a matter symmetry, whose meaning depends\non the physical context. While this proposal captures known properties of Higgs\nphases, it also predicts that the Higgs phase of the Fradkin-Shenker model has\nSPT edge modes in the symmetric part of the phase diagram, which we confirm\nanalytically. In addition, we argue that this SPT property is remarkably robust\nupon explicitly breaking the magnetic symmetry. Although the Higgs and confined\nphases are then connected without a bulk transition, they are separated by a\nboundary phase transition, which we confirm with tensor network simulations.\nMore generally, the boundary anomaly of the Higgs SPT phase coincides with the\nemergent anomaly of symmetry-breaking phases, making precise the relation\nbetween Higgs phases and symmetry breaking. The SPT nature of the Higgs phase\ncan also manifest in the bulk, e.g., at transitions between distinct Higgs\ncondensates. Finally, we extract insights which are applicable to general SPT\nphases, such as a 'bulk-defect correspondence' generalizing discrete gauge\ngroup analogs of Superconductor-Insulator-Superconductor (SIS) junctions. The\nsequel to this work will generalize 'Higgs=SPT' to continuous symmetries,\ninterpreting superconductivity as an SPT property.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cond-mat/1/au:+Verresen_R/0/1/0/all/0/1\">Ruben Verresen</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Borla_U/0/1/0/all/0/1\">Umberto Borla</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Vishwanath_A/0/1/0/all/0/1\">Ashvin Vishwanath</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Moroz_S/0/1/0/all/0/1\">Sergej Moroz</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Thorngren_R/0/1/0/all/0/1\">Ryan Thorngren</a>"
}