{
  "title": "A day in the life with Google Assistant",
  "link": "https://blog.google/products/assistant/day-life-google-assistant/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>The last few years have been full of change, and 2022 is no exception. Personally, I’ve begun heading back to the office for work — which is a pretty big departure from the days when I used to sleep, work, exercise and relax all inside my San Francisco studio apartment.</p><p>I’m ready to put away the athleisure (at least during work hours), and I’m excited about seeing everyone in person…but at the same time, I'm a bit worried about keeping up with the healthy habits I developed while working from home.</p><p>Since I started working as a Product Marketing Manager on the Google Assistant team about a year ago, though, I’ve gotten hooked on a few features that help me manage my day and keep me accountable to my wellness goals. Here’s a day in <i>my</i> life with Google Assistant:</p><ul><li><b>7:45 a.m.</b> - My alarm goes off on my Nest Hub, and I wake up to country music (my favorite). Usually I’m a snoozer, but since I started setting my alarm to my favorite genre of music, I’ve been waking up to feel-good tunes for a little extra motivation.</li><li><b>7:50 a.m.</b> - After brushing my teeth, I kick off my morning Routine. “<b>Hey Google, Good morning</b>” starts an automated rundown of everything I need to prepare for the day ahead: a weather update, an overview of my calendar and important news headlines. This pre-made Routine works great for me, but I can always <a href=\"https://support.google.com/googlenest/answer/7029585?hl=en&amp;co=GENIE.Platform%3DAndroid\">go into the Google Assistant settings</a> on my phone to edit or create a custom Routine when my needs change.</li><li><b>10:30 a.m.</b> - I have a break between morning meetings and grab a banana. I’m trying to eat more fruits and veggies, so I’ve been tracking them — and I can just say “<b>Hey Google, log a banana on MyFitnessPal”</b> and Google Assistant will automatically help me log it in the app on my phone.</li></ul></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col-l--4 h-c-grid__col--6 h-c-grid__col-l--offset-4 h-c-grid__col--offset-3\"><a class=\"article-image--link\"><img alt=\"A photo of a salad in a clear glass bowl sitting on a desk.\" class=\"article-image--medium\" data-loading='{\n                \"mobile\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/IMG_3565.max-500x500.jpg\",\n                \"desktop\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/IMG_3565.max-1000x1000.jpg\"\n              }' loading=\"lazy\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/images/IMG_3565.max-100x100.jpg \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><ul><li><b>12:15 p.m.</b> - Lunch time arrives and I grab a salad to eat with my teammate, Laura. We decide we want to start working out together in the office gym during lunch breaks, so I set a reminder for next week by saying “<b>Hey Google, remind me to pack workout clothes every Tuesday at 8 a.m.”</b></li><li><b>3:00 p.m.</b> - The afternoon whizzes by, and at 3 p.m. I’m ready for a snack. I grab a sparkling water and trail mix, log it in MyFitnessPal and finish the day working from a communal table overlooking the city.</li></ul></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col-l--6 h-c-grid__col--8 h-c-grid__col-l--offset-3 h-c-grid__col--offset-2\"><a class=\"article-image--link\"><img alt=\"A photo of the Marina running trail in San Francisco. The sky is blue with some clouds and the Golden Gate Bridge is in the background.\" class=\"article-image--large\" data-loading='{\n                \"mobile\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/IMG_2002.max-500x500_phzxkON.jpg\",\n                \"desktop\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/IMG_2002.max-1000x1000_U2z6aUR.jpg\"\n              }' loading=\"lazy\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/images/IMG_2002.max-100x100_rUKHXx6.jpg \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><ul><li><b>5:15 p.m. -</b> I power down for the day, commute home to the Marina and change into running clothes. I've signed up for the San Francisco marathon in July, and today I want to get in a few light training miles along Crissy Field since it’s (finally!) still light out and the weather is beautiful. I start my running playlist, and with a simple “<b>Hey Google, start my run with Strava,”</b> I’m on the move.</li><li><b>6:00 p.m. -</b> I finish my run and complete my workout with a quick strength circuit in my apartment with some help from Google Assistant: I don’t have to fumble with my phone between sets and can instead use a hands-free timer by saying “<b>Hey Google, set a 60-second timer for planking.”</b></li><li><b>8:00 p.m. -</b> Work day evenings are usually pretty mellow for me, but today I made plans to get a scoop of ice cream with a friend I haven’t seen in a while. I walk to meet her a few blocks away, and we have a fun time catching up over a sweet treat.</li><li><b>10:30 p.m.</b> - Bedtime! I wind down for the day, write in my journal and set my media alarm again, this time for an early pre-work run: “<b>Hey Google, wake me up at 7 a.m. to pop music.”</b></li></ul><p>There you have it: A snapshot of the real ways I use Google Assistant to stay organized with my health and wellness.</p><p>Whatever your goals might be, sticking to your fitness or wellness goals alone can be tough, and while Google can’t work out <i>for</i> you, it <i>can</i> be your accountability partner. With regular reminders to help you stick to your goals, motivating ways to start each day right and easy voice access into your wellness apps, Google can help you build healthy habits and stay accountable to your wellness goals this spring — just say, “Hey Google.”</p></div></div></body></html>",
  "pubDate": "Mon, 28 Mar 2022 15:00:00 +0000",
  "guid": "https://blog.google/products/assistant/day-life-google-assistant/",
  "category": "Google Assistant",
  "media:content": "",
  "og": {
    "type": "article",
    "title": "A day in the life with Google Assistant",
    "description": "Learn from a Googler about the ways Google can help you build healthy habits and stay accountable to your wellness goals.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/assistant_health_running_hero.max-600x600.jpg",
    "site_name": "Google",
    "url": "https://blog.google/products/assistant/day-life-google-assistant/"
  },
  "author": {
    "name": "Allie",
    "title": "Product Marketing Manager",
    "department": "",
    "company": ""
  }
}