{
  "title": "2 States That Should Be Able to Sue Over Biden’s Student Loan Bailout",
  "link": "https://www.heritage.org/courts/commentary/2-states-should-be-able-sue-over-bidens-student-loan-bailout",
  "description": "<p>President Joe Biden’s student loan bailout <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4250322\">is illegal</a>. That’s not a hard call, but before a court can consider the merits of Biden’s scheme, a plaintiff must have what the law refers to as “standing.”</p>\n\n<p>Standing is a doctrine that says that a court doesn’t have jurisdiction to hear a case unless the plaintiff has suffered a concrete injury caused by the defendant that a court has the power to fix.</p>\n\n<p>Six states <a href=\"https://www.dailysignal.com/2022/09/29/6-states-sue-to-block-bidens-student-loan-forgiveness-scheme?_gl=1*1g6as2n*_ga*MTM3OTE5NDAwOC4xNjY2OTczMDI3*_ga_W14BT6YQ87*MTY2Njk3MzAyNi4xLjEuMTY2Njk3MzAzMS41NS4wLjA.\">sued to block</a> Biden’s student loan bailout, claiming that it harmed their financial interests, but a federal district court judge ruled that the states lacked standing. The states appealed, and the 8th U.S. Circuit Court of Appeals stayed Biden’s bailout plan while it considers the case.</p>\n\n<p>The district court was wrong about some of the states, and the 8th Circuit should reverse the lower court’s decision. The states with the strongest arguments for standing are Missouri and Arkansas, because of how the student loan bailout harms their state-run loan servicers, which, in turn, harms the state.</p>\n\n<p>Missouri has a state agency (the Higher Education Loan Authority of the State of Missouri) that services student loans, including those that Biden plans to cancel. A servicer handles all the administrative tasks associated with loans: communicating with borrowers, processing payments, tracking balances, reporting that information to the federal government, etc. For all this work, a servicer gets paid by the government at a fixed rate per loan.</p>\n\n<p>Biden’s bailout <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4250322\">will harm</a> these servicers by eliminating millions of the loans they service (and the revenue they make as a result) and by increasing the servicers’ administrative costs by forcing them to administer the bailout.</p>\n\n<p>Because Missouri’s college loan agency is a “public instrumentality,” harms to it are harms to the state. Missouri has what the law calls “proprietary” interests in the financial health of its college loan agency because it participates in the loan-servicing market through the authority.</p>\n\n<p>Missouri also has “quasi-sovereign” interests in the loan agency’s health because money that it makes is invested in other state programs—such as financial assistance programs for students and schools—that benefit Missouri’s citizens. Biden’s bailout will directly harm these interests.</p>\n\n<p>The bailout will also impose secondary financial harms on Missouri’s college loan agency. The direct financial harm, coupled with the uncertainty over whether future “forgiveness” programs might impose those harms again, is likely to decrease the value of the loan agency’s bonds. That in turn would decrease the agency’s bond revenue, meaning that it would have even less money to invest in state programs. </p>\n\n<p>This all means that Missouri has standing to sue to stop Biden from harming its college loan agency and, by extension, the people of the state of Missouri.  </p>\n\n<p>Arkansas likely has standing too.</p>\n\n<p>Arkansas also has a loan servicer (the Arkansas Student Loan Authority) that holds loans from the Federal Family Education Loan program, which aren’t going to be forgiven under Biden’s bailout. (Biden initially said he would forgive these loans, but changed his mind in an apparent attempt to eliminate Arkansas’ standing.)</p>\n\n<p>Although these loans won’t be forgiven, borrowers can convert them into direct loans that would be forgiven. Since Biden announced his bailout, tens of thousands of borrowers have done so. As a result, the Arkansas student loan authority has lost millions of dollars of assets.</p>\n\n<p>Arkansas’ student loan agency is structured similarly to Missouri’s: It is a state entity and its revenue is used to fund education in Arkansas. As people convert their Federal Family Education loans into direct loans, the Arkansas agency loses those loans and the revenue they provide.</p>\n\n<p>Just like Missouri, Arkansas can sue to stop Biden from imposing those harms on its student loan agency and its citizens.</p>\n\n<p>Our prediction, therefore, is that the 8th Circuit will reverse the district court and allow the states’ lawsuit against the Biden bailout to proceed. If the appeals court does do this, it also should preserve its temporary stay of the bailout.</p>\n\n<p>The legal argument that Biden has advanced in support of his student loan bailout is dubious in the extreme. He relied on a law meant to give the president the power to grant military service members temporary reprieve from loan payments while they’re deployed overseas during times of emergency.</p>\n\n<p>Because of the COVID-19 emergency, Biden said, he can use this law to forgive student loans for everyone. No matter that he just said “<a href=\"https://www.wsj.com/articles/biden-calls-pandemic-over-says-u-s-troops-could-defend-taiwan-11663554391?mod=mhp\">the pandemic is over</a>.”</p>\n\n<p>And no matter that the Supreme Court has said that the president <a href=\"https://www.dailysignal.com/2022/07/08/ruling-in-west-virginia-v-epa-was-victory-for-representative-government/\">cannot expansively rewrite laws</a>. Biden did it anyway.</p>\n\n<p>This suggests that Biden does not really believe that his loan bailout is lawful. Instead, he’s playing for time, hoping that he can forgive some or all eligible student loans illegally before a court can stop him.</p>\n\n<p>If this sounds familiar, it’s because Biden did something similar a year ago when he renewed the eviction moratorium imposed by the Centers for Disease Control and Prevention. That moratorium was unlawful, and <a href=\"https://reason.com/2021/08/06/biden-admits-new-cdc-eviction-moratorium-runs-counter-to-the-bulk-of-the-constitutional-scholarship/\">Biden admitted</a> as much.</p>\n\n<p>But the president did it anyway, because, <a href=\"https://reason.com/2021/08/06/biden-admits-new-cdc-eviction-moratorium-runs-counter-to-the-bulk-of-the-constitutional-scholarship/\">he said</a>, “by the time it gets litigated, it will probably give some additional time while we’re getting that $45 billion out to people who are, in fact, behind in the rent and don’t have the money.”</p>\n\n<p>Biden is doing the same thing again with his student loan bailout. He likely knows it’s unlawful, but he doesn’t care. He just hopes he can get away with it for a little bit longer.</p>\n\n<p>The 8th Circuit shouldn’t let the president get away with this bad behavior a second time.</p>\n\n<p><em>This piece originally appeared in <a href=\"https://www.dailysignal.com/2022/10/31/2-states-that-should-be-able-to-sue-over-bidens-student-loan-bailout\">The Daily Signal</a></em></p>",
  "pubDate": "Tue, 01 Nov 2022 12:40:28 -0400",
  "dc:creator": "GianCarlo Canaparo, Meaghen McManus",
  "guid": "https://www.heritage.org/courts/commentary/2-states-should-be-able-sue-over-bidens-student-loan-bailout"
}