{
  "id": "https://bibleinoneyear.org/en/youth/198",
  "title": "Day 198: As If You Had Never Sinned",
  "description": "Psalm 86:1–6, Amos 5:21-24, Romans 4:2–5,13–15.  You can live in a right relationship with him and with others  This is ‘*justification’*",
  "pubDate": "Sat, 17 Jul 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/198/?ignore",
  "itunes:duration": "15:57",
  "guid": "enyouth17072021-198",
  "length": 957.26,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 198: As If You Had Never Sinned",
  "itunes:subtitle": "Psalm 86:1–6, Amos 5:21-24, Romans 4:2–5,13–15.  You can live in a right relationship with him and with others  This is ‘*justification’*",
  "itunes:summary": "In the years that I practised as a barrister I noticed that, for many people, appearing in a court of law is a terrifying experience – even if they are only appearing as a witness. Being a litigant, a person involved in the lawsuit, or a defendant in a criminal trial is an even more nerve-racking event. I saw the relief when a defendant was acquitted or a litigant was declared by a judge to be ‘in the right’.\nIn the legal system of Ancient Israel, a dispute put both parties at risk of the judgment of the court. The court’s process had a redemptive role; the judge was meant to help the party in the right to correct the wrong. At the end of the case, one party would be declared righteous and the other in the wrong. Successful performance of this function meant ‘justice’ had been done. The Hebrew word for righteous is tsaddiq, which some versions of the Bible translate as ‘innocent’ or ‘just’ – one whose status is right. This is the Old Testament background to being ‘justified’.\nThe child’s definition of justified is ‘just as if I’d’ never sinned. Jesus died for our sins. When you put your faith in him you were justified. You were freed. You are declared righteous in his sight. Sin no longer separates you from God. You can live in a right relationship with him and with others. This is ‘justification’.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 198
}