{
  "id": "yt:video:mTn_rmpDCV8",
  "yt:videoId": "mTn_rmpDCV8",
  "yt:channelId": "UCMTk_R_Y49jvq-HQXDmKI0Q",
  "title": "The Never-Ending Nightmare Of Nikocado Avocado - From Vegan To Villain | TRO",
  "link": "",
  "author": {
    "name": "The Right Opinion",
    "uri": "https://www.youtube.com/channel/UCMTk_R_Y49jvq-HQXDmKI0Q"
  },
  "published": "2020-08-05T22:00:01+00:00",
  "updated": "2021-12-17T01:09:20+00:00",
  "media:group": {
    "media:title": "The Never-Ending Nightmare Of Nikocado Avocado - From Vegan To Villain | TRO",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Sponsored: Get Surfshark VPN at https://surfshark.deals/opinion and enter promo code OPINION for 85% off and 3 extra months for free!\n\nThe Right Opinion: The Never-Ending Nightmare Of Nikocado Avocado - From Vegan To Villain | TRO\n\n0:00 - Intro\n10:28 - Origins\n17:58 - New Era\n27:10 - Devil's Advocado\n38:04 - Calculation\n46:27 - Worth The Weight\n56:39 - Drama Queen\n1:08:31 - Enduriance\n1:17:19 - Cracked Foundations\n1:31:20 - Trisha\n1:42:52 - Twisted Reality\n1:59:41 - The Joker\n2:11:20 - Collecting the W\n2:23:39 - The Standard\n2:31:37 - Stephanie\n2:49:26 - Nick's Retort\n2:57:22 - Self-Incrimination\n3:12:15 - Playing Yourself\n3:39:56 - By The Sword\n3:51:50 - Old Dogs\n4:06:59 - New Tricks\n4:18:33 - Undeniably Nick\n4:28:49 - The Never-Ending Nightmare Of Nikocado Avocado\n\nIntro:\n\nDrama. In the world of YouTube, the word “drama” is typically used to refer to a conflict regarding a creator, or multiple creators at that. It’s a pretty central theme to the current content that I make on my channel, and is a focal point for multiple commentators alike. We tend to associate most drama with a more contemporary era of YouTube, originating from the mid 2010s, spearheaded by many commentators, and really popularised by the Content Cop series, but drama has existed since the dawn of YouTube. I remember all the way back in 2012, when I watched a lot of Call of Duty content, because, as always, I am a gamer, and there was a very renowned callout video uploaded which obtained well over a million views, and probably would have obtained many more if it had not been deleted. In an environment like that, that was hugely impressive. \n\nHowever, with the constant manifestation of communities, and lack of real culture surrounding the nature of drama, with it more seeming like an unintended side effect, nothing ever seemed mould its way into YouTube history, and we tend to reminisce about the early 2010s on YouTube with the innocent nostalgia that we have since assigned to it. That’s not a facet that can be considered with commentary, and since its rise, every major conflict seems imprinted on this beautiful platform, for better and for worse. \n\nYet the sensation that drama provokes ever remains the same. It was still one of the most iconic feelings when that Call of Duty drama in 2012 was transpiring, it was a rush, someone being exposed, conflict within the community. The truth is plain, many creators, and audiences alike, thrive on drama, the appeal of it is indisputable, and as it has grown out of its reputation as a byproduct, and into its own genre, it becomes more powerful, and people feel less afraid to indulge their more dramatic side. On top of this, with the increased mobilisation of online communities, it has been granted additional consequential value that we can observe over the past few years.\n\nOne of the most noteworthy outcomes of this is “expose culture”, when a person makes strong or revelatory claims regarding another individual, and their behaviour, typically with the intent of depicting a character that had not been previously shown to the audience. You might find someone sitting quite sternly, glaring at the camera, before going into details of whatever they wish to disclose, or you might just see a neatly posted Twitlonger. The overarching message will tell you, this person isn’t who you thought they were, whether its mere business malpractice or something more sinister, there can be very real ramifications. \n\nThe mid 2010s weren’t just for sewing the seeds of drama, and commentary though. No, in fact many new genres rose to YouTube prominence, one of those being mukbangs. Mukbang is another delightful portmanteau whose literal translation would be eatcast, with such information you can probably take a guess at what I’m referring to.  \n\nYes, the videos where we have an individual consuming portions of food, often accompanied by them making casual chit-chat with the audience. It originated in South Korea at the end of 2000s, but only really caught fire in 2015, when a few larger channels began to pay attention to it.  Since then we’ve seen a wave of creators all over the spectrum take part, either engaging in it as a side venture, or as their dedicated pursuit.\n\nSo we have drama, and mukbang, simultaneously emerging into the limelight… two, seemingly quite distinct genres, but what would you end up with, if you merged the two together…\n\nLadies and gentlemen, I introduce you to Nikocado Avocado.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}