{
  "title": "Hiring at Flatiron Institute (NYC): research scientists, postdoctoral fellows, interns, and software engineers at Flatiron Institute",
  "link": "https://statmodeling.stat.columbia.edu/2022/11/01/flatiron-institute-hiring-postdocs-research-scientists-interns/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/11/01/flatiron-institute-hiring-postdocs-research-scientists-interns/#comments",
  "dc:creator": "Bob Carpenter",
  "pubDate": "Tue, 01 Nov 2022 19:00:46 +0000",
  "category": [
    "Jobs",
    "Statistical computing"
  ],
  "guid": "https://statmodeling.stat.columbia.edu/?p=48148",
  "description": "Edit: Before going into detail, I would like to make it clear up front that I&#8217;m specifically looking for people with experience and a publication record in algorithms, open-source software, and directly relevant theory and methodology. Flatiron Institute as a &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/11/01/flatiron-institute-hiring-postdocs-research-scientists-interns/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<blockquote><p>\nEdit: Before going into detail, I would like to make it clear up front that I&#8217;m specifically looking for people with experience and a publication record in algorithms, open-source software, and directly relevant theory and methodology.  Flatiron Institute as a whole is focused on the physical and biological sciences (not education, social science, finance, etc.).</p>\n<p>Edit #2:  I don&#8217;t know anything yet about the new <a href=\"https://www1.nyc.gov/assets/cchr/downloads/pdf/publications/Salary-Transparency-Factsheet.pdf\">Salary Transparency in Job Advertisements</a> law and what that will mean for our job ads.\n</p></blockquote>\n<p>Hiring season is officially open!  I&#8217;m now officially the group leader for computational statistics and am looking to hire at all levels.  </p>\n<p><b>Jobs</b></p>\n<ul>\n<li><b>Postdoctoral Fellows</b>: 2 year appointments with a 1-year extension baked in. <br />&nbsp;\n<li><b>Open-rank Research Scientists</b>: permanent appointments at all levels; we typically do not hire straight out of graduate school for these permanent positions. <br />&nbsp;\n<li><b>Software engineers</b>: permanent software engineering positions. <br />&nbsp;\n<li><b>Summer interns</b>: we bring in a large number of interns across Flatiron Institute and Simons Foundation, who are mentored by research scientists, postdocs, or software engineers.\n</ul>\n<p><b>Official job ads</b></p>\n<p>Here&#8217;s the link to the official Flatiron Institute jobs board, where you will find the postdoctoral fellow and open-rank job ads:</p>\n<ul>\n<li><a href=\"https://www.simonsfoundation.org/careers/?tab=job-openings\">Job openings at Flatiron Institute</a>\n</ul>\n<p><b>Application dates</b></p>\n<p><img src=\"https://statmodeling.stat.columbia.edu/wp-content/uploads/2021/09/flatiron-institute-lunchroom.jpg\" alt=\"Flatiron Institute cafeteria\" style=\"width:350px; float:right; margin:0 0 1em 1em\" />Postdoctoral Fellow applications are <b>due 15 December 2022</b> for positions with flexible starting dates in 2023. We accept open-rank applications for permanent research scientist positions at any time, though we will also be hiring in the usual academic cycle (i.e., early 2023 interviews and job offers).  We do not have an ad for software engineers up, but will create one if we find relevant candidates&#8212;we are always looking to hire permanent software engineers.  </p>\n<p>The official announcement for interns is not yet up on our jobs site, but I will post a separate blog entry when it&#8217;s up.    </p>\n<p><b>Please contact me directly</b></p>\n<p>If you&#8217;re interested in one of these positions, please send me an email directly to discuss (<tt><a href=\"mailto:bcarpenter@flatironinstitute.org\">bcarpenter@flatironinstitute.org</a></tt>).</p>\n<p><b>Center for Computational Mathematics Mission</b></p>\n<p>This is the only place I&#8217;ve ever worked where the mission statement lines up so well with my own interests:</p>\n<blockquote><p>\nCCM’s mission is to create new mathematical approaches, algorithms and software to advance scientific research in multiple disciplines, often in collaboration with other Flatiron Centers.\n</p></blockquote>\n<p>The other centers have similar missions, because the institute was established to fill the gap in scientific funding for algorithms and software.  If the mission appeals to you, you will probably like Flatiron Institute.  More specifically, members of our center work on methodology, applications, and theory for computational stats and machine learning, as well as more traditional scientific computing in the form of optimization, differential equation solvers, non-uniform FFTs, phase retrieval, optimization etc.  </p>\n<p>We are all principal investigators in the sense that there are no top-down goals from the administration other than to work toward our mission. Our president, <a href=\"https://scholar.google.com/citations?user=xoOGOFEAAAAJ&#038;hl=en\">David Spergel</a>, is an astrophysicist, which gives the whole place a more traditional academic feel than the current MBA-led situation in most universities.</p>\n<p><b>Computational Statistics Group</b></p>\n<p>Our group so far consists of </p>\n<ul>\n<li> <a href=\"https://scholar.google.com.au/citations?user=kPtKWAwAAAAJ&#038;hl=en\">Bob Carpenter</a> (Senior Research Scientist), working on computational statistics algorithms, Stan, and applied statistics (crowdsourcing, coherent diffraction imaging, genomics, etc.)\n<li> <a href=\"https://scholar.google.com/citations?user=okKw87MAAAAJ&#038;hl=en\">Robert Gower</a> (Research Scientist), who&#8217;s a specialist in optimization and working with us and others on both variational inference and with me on optimization for large scale transcriptomics and biome modeling.\n<li> <a href=\"https://www.simonsfoundation.org/people/brian-ward/\">Brian Ward</a> (Software Engineer), who&#8217;s been working on the Stan language, interfaces, and applications like CDI.\n<li> <a href=\"https://scholar.google.com/citations?user=T7P7bwYAAAAJ&#038;hl=en\">Yuling Yao</a> (Postdoctoral Fellow), who&#8217;s working on Bayesian methodology, Bayesian inference and beyond, including some really exciting ML-motivated variational inference algorithms.\n<li> <a href=\"https://scholar.google.com/citations?user=nPtLsvIAAAAJ&#038;hl=en\">Charles Margossian</a> (Postdoctoral Fellow), who&#8217;s working on massively parallel inference and convergence monitoring, adjoint methods for autodial of implicit functions (like root finders and differential equation solvers), as well as nested Laplace approximation.\n</ul>\n<p><b>Machine Learning Group</b></p>\n<p><img src=\"https://statmodeling.stat.columbia.edu/wp-content/uploads/2021/09/flatiron-3.jpg\" alt=\"Flatiron Institute roof garden\" style=\"width:300px; float:left; margin:1em 1em 1em 0\" />The complementary group to ours is machine learning, led by <a href=\"https://scholar.google.com/citations?user=Hft_8cgAAAAJ&#038;hl=en\">Lawrence Saul</a>, and we&#8217;re hiring in machine learning as well as computational statistics (the line is admittedly blurry and purely administrative). <a href=\"https://scholar.google.com/citations?user=8OYE6iEAAAAJ&#038;hl=en\">Dave Blei</a> is also visiting one day a week after being here for a year on sabbatical.  </p>\n<p>In addition to Dave, we have a steady stream of visitors.  In our group, <a href=\"https://people.cs.umass.edu/~domke/\">Justin Domke</a> is visiting for 5 months in early 2023, and <a href=\"https://www.csuchico.edu/math/people/faculty/roualdes-edward.shtml\">Edward Roulades</a> (a Stan developer and applied mathematician/statistician), will be back to work on massively parallel inference next summer.  Robert Gower also has a steady stream of optimization specialists visiting.</p>\n<p>We also have a very active internship program and both postdocs and research scientists can recruit interns who we bring to NY and put up for the summer.</p>\n<p><b>Focus on algorithms and computation</b></p>\n<p>Although most of our permanent staff researchers and software engineers work on open-source software, we realize postdocs need to get a job, so we give them the flexibility to concentrate on research.  We also understand that research is an international collaborative effort and we encourage postdocs and research scientists to maintain and develop academic collaborations outside of Flatiron Institute.</p>\n<p><b>A highly collaborative environment</b></p>\n<p>My favorite part of this place is that it&#8217;s packed to the rafters with scientists working on deep and interesting problems across the biological and physical sciences (our other centers are for computational astronomy, computational biology, computational neuroscience, and computational quantum physics).  </p>\n<p><img src=\"https://statmodeling.stat.columbia.edu/wp-content/uploads/2021/09/christian-mueller-flatiron.jpg\" alt=\"christian mueller at blackboard\" style=\"width:300px; float:right; margin:1em 0 1em 1em\" />I&#8217;m afraid we don&#8217;t do social science or humanities computing and are unlikely to hire anyone who&#8217;s concentrated mainly in these areas.  The centers run popular science talks for each other on a weekly basis, which are really wonderful because they&#8217;re pitched at mathematically- and computationally-oriented scientists (so they assume you know basic physics and differential equations).  We also do in-house training in computational statistics, machine learning, and applied mathematics&#8212;I often say it&#8217;s a great place to work for people who like math class (from both the teacher and student side).  It&#8217;s been a wonderful place to learn new subjects and techniques.</p>\n<p><b>Compute and support</b></p>\n<p>Another great benefit of working here is our large-scale, state of the art compute clusters and the Scientific Computing Core staff who can help you get your C++, Fortran, or even Python code running efficiently on the cluster.  </p>\n<p>Like continental Europe and the old Bell Labs, we have a very pleasant lunch culture where we eat together almost every day (it&#8217;s not required but very pleasant;  one of the pictures above is our cafeteria and another is the roof deck, where we have receptions after events and usually eat during the summer.</p>\n<p>We also have truly fantastic admin support at all levels.  I don&#8217;t think I could&#8217;ve imagined admin support this good and it makes a huge difference.  Even our security guards are friendly and helpful.  </p>\n<p>We&#8217;re one of the few places that has sufficient meeting rooms for our staff size (as well as great professional AV support).  We&#8217;re also one of those places with chalkboards and white boards in all the halls, and it feels very welcoming to be surrounded by mathematical scribbling (that&#8217;s my office you can see behind Christian Mueller writing on the blackboard below).</p>\n<p><b>Simons Foundation</b></p>\n<p>Flatiron Institute is part of the Simons Foundation, which is one of the largest non-governmental science funders.  Jim and Marilyn Simons funded the foundation with a large enough endowment to exist in perpetuity.  <img src=\"https://statmodeling.stat.columbia.edu/wp-content/uploads/2021/09/flatiron-4.jpg\" alt=\"Flatiron Institute auditorium\" style=\"width:300px; float:left; margin:1em 1em 0.5em 0\" />Simons Foundation also runs all kinds of popular outreach programs around math and science education and engagement, including <i>Quanta Magazine</i> and Sandbox Films (science documentaries), Math for America, an oceanographic data collection arm, observatories, and a very large autism research insitiative dedicated to open-access data collection and curation.  We even fund arXiv.</p>\n<p>We are fully funded through the Simons Foundations and cannot apply for grants, though we are free to collaborate with whomever we want.  </p>\n<p><b>Offices and in-person work</b></p>\n<p>We are not in the Flatiron Building, but have very nice digs in the Flatiron neighborhood of NYC (as you can see above), though hardly anyone has an individual office.  Flatiron Institute and Simons Foundations have offices in two buildings at  Fifth Avenue and 21st St, only a few blocks from Greenwich Village (NYU and subsidized postdoc housing) and Chelsea (Google and the Hudson River).</p>\n<p>We&#8217;re 100% back to the office and do not hire people for remote positions.  </p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/11/01/flatiron-institute-hiring-postdocs-research-scientists-interns/feed/",
  "slash:comments": 4
}