{
  "title": "Minkorrekt Folge 97 “Hefe, du Penner!”",
  "itunes:title": "Minkorrekt Folge 97 “Hefe, du Penner!”",
  "description": "Folge 97 vom 29.05.2017\n\ndiesmal mit einem sehr kalten Fleck, Designer-Viren, akustisch attraktiven Podcastern und Glaubwürdigkeit!\n\nExperiment der Woche: Faszien-Rolle\n\nChinagadget: Strandbeest\n\nDu möchtest mehr über unsere Werbepartner erfahren? Hier findest du alle Infos & Rabatte: https://linktr.ee/methodischinkorrekt",
  "pubDate": "Tue, 30 May 2017 07:00:13 +0000",
  "link": "https://minkorrekt.podigee.io/102-minkorrekt-folge-97-hefe-du-penner",
  "guid": "podlove-2017-05-30t05:28:13+00:00-0d4f2f61701609d",
  "content:encoded": "\"Hefe, du Penner!\" direkt aus dem Bauwagen der Wissenschaft\n<p>Shownotes zu Minkorrekt 97, 29.05. 2017 (diesmal von unseren Zuhörern Casandro, realMagnesium12, T0nd4, n unnamed, dot_dee)</p>\n<p>Erklärung des Pads als Ersatz für Shownotes</p>\n<p>Befehl zum nicht Chatten im Pad</p>\n<p>Leuten einen Link zu einem Etherpad zu geben &#8220;What could possibly go wrong&#8221;</p>\n<p>Diskussionen über das Intro</p>\n<p>Intro Löwenzahn<br />\nMinkorrekt heute: Mit ganz viel Wissenschaft<br />\n<span id=\"more-1882\"></span><br />\nAus dem blauen Bauwagen der Wissenschaften<br />\nMit Nachbar und Klaus-Dieter, der Gitarre</p>\n<p>Erklärung der 2 Pools im Garten der Casa Wöhrl, Aufnahme Open Air</p>\n<p>Erklärung, dass 2. Versuch einer OpenAir Aufzeichnung. Erster Versuch war auf dem Camp 2015, welcher wegen Unwetter abgebrochen wurde. (Link zum Fotobeweis: https://twitter.com/MInkorrekt/status/869228081910865920 )</p>\n<p>Diskussion über Eiswürfel und Speiseeis<br />\nMuskelkater von Nikolas<br />\nGrund: Triathlon. Weil er Bock gehabt hatte. Als er 30 geworden ist musste er an einem Marathonlauf mitmachen.Der Herr Remfort macht so etwas nicht. Zeit der Tristhlons ist unbekannt.<br />\nWar spannend abgesperrte Fahrradstrecke zu benutzen. Hat Helme gesehen die teurer waren als sein Fahrrad.<br />\nDeutsche wollen technisch gute Klamotten<br />\nItaliener wollen gut aussehen Espresso trinken und wenn es sich ergibt, auch Fahrradfahren.</p>\n<p>Schwiegervater ist Italiener und kennt somit Ausländer persönlich.</p>\n<p>Deshalb gegegentliche Klagen über Muskelkater</p>\n<p>Er kam ins Ziel. Die Ergebnislisten sind noch nicht draußen.<br />\nKein Gefühl für Wechsel. Schuhe an, Trikot an, mit Fahrrad zu Ort LAUFEN, an dem man erst aufsteigen darf.</p>\n<p>Reinhard war in Oberhausen auf einer Wiskeymesse. Hat das Ende des Abends miterlebt, 2 mal <img src=\"https://s.w.org/images/core/emoji/2.4/72x72/1f642.png\" alt=\"🙂\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /> Bruder großer Whiskeyfan Messe war Just Whiskey. Leute an Tapeziertischen und haben Whiskey aufgebaut, draußen gab es Bierzeltgarnituren mit Essen. Beim Eintritt gibt es ein Whiskeyglas, Profis haben Whiskeyhalter umd das Glas um den Hals zu hängen. Bruder hatte eines in der Tasche.</p>\n<p>Whiskey wird geschluckt! Von den milden zu den rauchigen. R. hatte 4 x 2cl, wovon jew nur einmal genippt. 2cl für min. 3 €, teuerste 80€ für 2 cl! War herabgesetzt, weil die Flasche schon offen war.</p>\n<p>Hat Whiskey mit Lakritzaroma gefunden. Scotch Universe Edition, Reihe mit Namen wie Double Velocity of Light oder Sternennamen</p>\n<p>Öffnen der Biere: Bergedorfer Bier. Kam per Packstation.</p>\n<p>Gibt Packstationsong: Link: https://www.youtube.com/watch?v=YPtWDBmYPy0</p>\n<p>*Schunkeln im Garten*</p>\n<p>Zitate aus dem Chat: &#8221; Boah&#8230; Hat der Icewalker das mit seiner Band erstellt?&#8221;&#8221; ach du scheiße &#8230; ich geh mir Alkohol organisieren &#8221;</p>\n<p>Amazon Locker: Packstation von amazon. &#8220;Post, du bist so scheiße, wir machen jetzt unsere eigene&#8221;<br />\nBier wird als lecker empfunden</p>\n<p>Hermesshops wechseln, da Läden kommen und gehen und immer weit weg sind.<br />\nHassladen UPS. Fahrer geben sich zweimal Mühe, danach uss man weit weg zur UPS-Zentrale<br />\nUPS Abholplatz in Düsseldorf Hafen Vermutlich das hier:<br />\nhttps://www.paketda.de/ups-depot-duesseldorf.html</p>\n<p>Bucketlist abgehakt: Essen mit Nobelpreisträger<br />\nNobelpreis 1985 Klaus von Klitzing Quantenmechnischer Hall Effekt</p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\">\n<p lang=\"de\" dir=\"ltr\">Anruf bei Mama, nur um zu sagen dass ich keine Zeit habe weil ich mit nem Nobelpreisträger zu Tisch bin. Like a boss! <a href=\"https://twitter.com/hashtag/vonKlitzing?src=hash\">#vonKlitzing</a> <a href=\"https://t.co/nR1ZJVMO5w\">pic.twitter.com/nR1ZJVMO5w</a></p>\n<p>&mdash; Nicolas Wöhrl (@Icewalker1974) <a href=\"https://twitter.com/Icewalker1974/status/867309844562423808\">May 24, 2017</a></p></blockquote>\n<p><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>https://de.wikipedia.org/wiki/Quanten-Hall-Effekt</p>\n<p>Hallwiderstände sind quantisierte ganzzahlige Teile, abh. Planck u Elementarladung. Und sind selbst universelle Naturkonstanten.<br />\nBedeutung fürs Eichen von Geräten. Fehler! Leitungswiderstand kann mit Vierleitermessung vollständig kompensiert werden<br />\nhttps://de.wikipedia.org/wiki/Vierleitermessung<br />\nAber Grundidee der Definition des Widerstandes als Grundeinheit natürlich sinnvoll.</p>\n<p>SI-Einheiten.<br />\nDer oder das oder doch der? Meter. 1793.<br />\nhttp://www.duden.de/rechtschreibung/Meter<br />\nDWDS &#8211; Das Wortauskunftssystem zur deutschen Sprache in Geschichte und Gegenwart:<br />\nhttps://www.dwds.de/wb/Meter</p>\n<p>Sollte 10 Mio/Teil des Erdquadranten auf dem Paris-Meridian. https://de.wikipedia.org/wiki/Internationales_Einheitensystem#SI-Basiseinheiten<br />\nUrmeter: Aus Messing gegossen und dann liegen gelassen. Unmitelbar nach Einigung dann Kritik, da Erde veränderlich, so dass Naturkonsten ungeeignet (?)&#8230;<br />\nNicht zu verwechseln mit https://de.wikipedia.org/wiki/Metatron</p>\n<p>Seit 1973 dann durch Definition mit Lichtgeschwindigkeit im Vakuum.<br />\nAktuell: verschiedenen Projekte das Kilogramm neu zu definieren.<br />\nBisher ist kg durch Prototyp definiert. Zylinder aus Pt-Ir. Wird in Tresor bei Paris verwahrt.</p>\n<p>https://de.wikipedia.org/wiki/Kilogramm#Avogadroprojekt zur besseren Definition des Kilogramms als &#8220;Anzahl von Siliziumatomen&#8221;<br />\nGewichtsdrift, ein Gewicht hat Kratzer, 5 Jahre später bemerk<br />\nGewichte verliereh nunterschiedlich Gewicht je nach Schmelze in der die Hergestellt wurden</p>\n<p>Silizium wird als neuer Standard verwendet, weil das billig hochrein verfügbar ist. Problem Oxidation, unterschiedlich je nach Gitterrichtung</p>\n<p>Vortrag war unterhaltsam<br />\nFunfact: Der Typ war im Labor Idee auf Tür unterschreiben. Die wollten Diamant zeigen, Klitzing holte Nobelpreismedallie wohl nächstes Näherung an den Nobelpreis für Herrn Remfort</p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\">\n<p lang=\"de\" dir=\"ltr\">Der hatte echt seine original Nobelpreismedaille dabei! <a href=\"https://t.co/0djFEKEZXr\">https://t.co/0djFEKEZXr</a></p>\n<p>&mdash; Nicolas Wöhrl (@Icewalker1974) <a href=\"https://twitter.com/Icewalker1974/status/867379972037644288\">May 24, 2017</a></p></blockquote>\n<p><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script><br />\nReinhard kam zu einem sponanten Science Slam gesponsert von Stahlhersteller als Ersatz mit Aufwandsentschädigung. Gab Freibier. Mann im Anzug als Silouette mit Stadt, kuckte in die Ferne. Gewonnen hat Vortrag über Sprache insgesammt, erst 2 Bier drin. Gab Mischung aus Unentschieden und. Das schönste war Interview mit jedem Sprecher. Ist im Haus der Technik. Reinhard ist da Dozent.<br />\nhttp://www.hdt-essen.de/</p>\n<p>Umfrage einer Freundin von Reinhard<br />\nhttps://twitter.com/ReinhardRemfort/status/868944935231377408 https://docs.google.com/forms/d/e/1FAIpQLSfVJhZ52aWO5-32GJO7tAZLW0oUOGoyPzgs2pkq3WF0hoVA4Q/viewform</p>\n<p>Steffen ist an<br />\nhttps://www.vda.de/de/themen/innovation-und-technik/automatisiertes-fahren/automatisiertes-fahren.html<br />\nbeteiligt. Hat sich über Umgang mit autonomen Fahrzeugen beschwert. Ging um letzte Sendung mit Paper zu Autos mit Geschwindigkeitsregelung zur Stauvermeidung<br />\nStufen der Autonomie<br />\nStufe 0: Spurhalteassistenten usw.<br />\nStufe 3: Fahren auf der Autobahn, Staufolgefahren, Fahren im Stau ab 2020<br />\nStufe 4: Vollautonom 2030</p>\n<p>Nicolas will in Zukunft präziser sein. Denn zu früh von autonomen fahren sprechen verbrennt den Begriff.</p>\n<p>Reinhard war auf der GPN http://www.gulas.ch/ Ähnlich wie die Winter-GPN in Hamburg (bald Leipzig)<br />\nHat Vortrag von Starbug gehört:<br />\nVortrag: https://media.ccc.de/v/gpn17-8618-hacking_galaxy_s8_iris_recognition<br />\nSendung mit der Maus Version: https://media.ccc.de/v/biometrie-s8-iris-fun<br />\nIn der Vergangenheit war Biometrie auch schon kacke.<br />\nhttps://www.ccc.de/updates/2008/schaubles-finger<br />\nhttps://www.ccc.de/de/updates/2013/ccc-breaks-apple-touchid</p>\n<p>Reinhard war nur einen Tag. Weil der Smart blutet und Öl verliert. Turbolader defekt. Smart wird wohl zu Grabe getragen. Motorrad hatte fast mehr Kolbenvolumen.</p>\n<p>Themen der Woche<br />\nDer Kühlschrank des Nachbarunsiversums<br />\nWhat possibly go wrong<br />\nMinkorrekt eine 10 auf der Glaubwürdigkeitsskala<br />\nBleib Wachsam</p>\n<p>Aufforderung Müsli bereit zu legen.Lecker Seitenbacher. Seitenbacher Müsli. Vom Seitenbacher! Lecker, lecker, lecker, lecker! https://www.youtube.com/watch?v=6w9EKP5JsK4</p>\n<p>Seitenbacher hat Müsli ohne Früchte.<br />\nGefriergetrocknete Erdbeeren mit Schoko sind geil!</p>\n<p>Konditor in Essen Overbeck hat zugemacht im Stil der 1950ger 1960ger Jahre, mit Sofas und nicht abgeranzt einer der Professoren hat da regelmßsig Kuchen gegessen.<br />\nhttps://www.derwesten.de/staedte/essen/das-cafe-overbeck-in-essen-ist-jetzt-geschichte-id10181186.html</p>\n<p>Verlagslobby beschwert sich, dass Bibliotheken 15% von Werken verwenden dürfen.<br />\nhttp://www.faz.net/aktuell/feuilleton/urheberrechtsreform-heiko-maas-macht-die-freie-presse-kaputt-15033766.html</p>\n<p>Quatsch-Paper: Penis.<br />\nhttps://web.archive.org/web/20170522110654/https://www.cogentoa.com/article/10.1080/23311886.2017.1330439.pdf<br />\nThe conceptual penis as a social construct.<br />\nPeer-Reviewer habendurchgewunken und auch gelobt!</p>\n<blockquote data-secret=\"HTwofQKNOT\" class=\"wp-embedded-content\"><p><a href=\"http://www.skeptic.com/reading_room/conceptual-penis-social-contruct-sokal-style-hoax-on-gender-studies/\">The Conceptual Penis as a Social Construct: A Sokal-Style Hoax on Gender Studies</a></p></blockquote>\n<p><iframe class=\"wp-embedded-content\" sandbox=\"allow-scripts\" security=\"restricted\" src=\"http://www.skeptic.com/reading_room/conceptual-penis-social-contruct-sokal-style-hoax-on-gender-studies/embed/#?secret=HTwofQKNOT\" data-secret=\"HTwofQKNOT\" width=\"584\" height=\"329\" title=\"&#8220;The Conceptual Penis as a Social Construct: A Sokal-Style Hoax on Gender Studies&#8221; &#8212; Skeptic\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\"></iframe></p>\n<p>Nocolas zitiert:<br />\n&#8220;We conclude that penises are not best understood as the male sexual organ, or as a male reproduc-<br />\ntive organ, but instead as an enacted social construct that is both damaging and problematic for<br />\nsociety and future generations. The conceptual penis presents significant problems for gender iden-<br />\ntity and reproductive identity within social and family dynamics, is exclusionary to disenfranchised<br />\ncommunities based upon gender or reproductive identity, is an enduring source of abuse for women.<br />\nand other gender-marginalized groups and individuals, is the universal performative source of rape,<br />\nand is the conceptual driver behind much of climate change.&#8221;</p>\n<p>Wollten erst in Masculinity Journal veröffentlichen, aber dort abgelehnt, jedoch auf ein anderes Journal verwiesen, das Open Access macht, aber dafür Geld nimmt.</p>\n<p>Politisch ewünschte Ergebnise und ??? führen zu blödsinnigen Erkenntnissen.<br />\nIdee: Nicolas Geld das Unis and Journals geben, dann an unabhängige Verlagsorganisation.<br />\nProblem: Reinhard Leute des Peer Reviews, bzw deren Auswahl könnte nicht unabhängi sein. Hohes Machtmissbrauchspotential. Schwierig Interessengruppen (Industrie, Militär, usw) trotzdem wichtig als Ersatz für Verlage. Aus allgemeiner Hand finanziert. Verlage nicht mehr zeitgemäß.</p>\n<p>Reinhard: Schaffen von Wissen darf nicht am Urheberrecht zu Grunde gehen. Es darf nicht sein, dass man nicht 2 Seiten kopieren darf, weil die Erben eines Rechteinhabers der seit 10 Jahren tot ist einem aufs Dach steigen können.</p>\n<p><strong>Thema #1 Der Kühlschrank des Nachbaruniversums (danach Bier)</strong></p>\n<p>Paper: https://arxiv.org/abs/1704.03814</p>\n<p>Kosmische Hintergrundstrahlung zeigt die Anfänge des Unversum. Kosmische Mikrowellenstrahlung ist eine Strahlung, die das ganze Universum isotrop ausfüllt und kurz nach dem Urknall entstanden ist. Dadurch ergibt sich auch die Temperatur des Kosmoss, welche bei 3K liegt. Sie kommt aus der Zeit als Strahlung und Materie im thermischen Gleichgewicht lagen. Damals hatte man Strahlung und geladene Teilchen, (Elektronen, Protonen usw). Photonen werden an geladenen Teilchen gestreut (Thomson-Streuung). Diese Thema wurde schon vorher behandlet. Weil die Wechselwirken entsteht ein thermisches Gleichgewicht. Durch fortwährende Kollision wird dabei kontinuierlich Energie ausgetauscht => Thermisches Gleichgewicht<br />\n(Jemand schmettert schnell durch eine Tempo 30 Zone neben dem Haus. Offensichtlich heizen da häufiger Halbstarke rum. Das Haus, und somit die Aufnahme ist in der Landeschneise des Düsseldorfer Flughafen. Deshalb war das Haus auch so billig)<br />\nDas Universum kühlt sich ab weil es sich ausdehnt. Ab 3000K rekombinieren Protonen und Elektronen und bilden neutralen Wasserstoff. Dadurch gibt esungeladene Teilchen => keine Thomsonstreuung => keine Wechelwirkung => Universum wird durchsichtig. Das ist kein Gleichgewichtszustand mehr.<br />\nTeile der Hintergrundstrahlung geben Informationen über frühe Phase des Universums. Sie ist älter als die ersten Sterne.<br />\nDurch die Ausdehnung des Universums wird die Strahlung rot verschoben deshalb ist die Strahlung im MikrowellenBereich. Hinweis auf Urknall, aber kein hinreichender Beweis.<br />\nReinhard erinnert sich an Entdeckung der Mikrowellenstrahlung.<br />\nNicolas sehr glücklich und hat noch Bier. Rätsel kalter Fleck 5° große Zone 2004 entdeckt, deutlich 70µK kälter als der Durchschnitt<br />\nhttps://de.wikipedia.org/wiki/CMB_Cold_Spot<br />\nFluktuationen nicht ungewöhnlich weil Materie ungleichmäßig verteilt, wie man jetzt sieht.<br />\nDie Materie (Galaxien) im Universum sind ungeichmäßig verteilt. Es sieht aus wei ein Schwamm. Das kann nur durch ursprüngliche Fluktuationen entstanden sein.</p>\n<p>Vor Reinhard erscheint durch Fluktuation plötzlich ein Duckstein Weizen welches 2 Euro pro Flasche kostet.<br />\nNicolas kriegt 60 cent Bier, sieht das als Scheidungsgrund, und ist ganz knapp davor, Sendung abzubrechen.<br />\n&#8220;Kalter Fleck in dieser Ehe.&#8221;<br />\nReinhard: Dieser Kalte Fleck ist unter Brustbein &#8220;Gib dem Pöbel nicht dieses Gute Bier&#8221;</p>\n<p>Sendungstitelvorschlag &#8220;Das ist Hefe du Penner&#8221;<br />\nWoher kommt halter Fleck. 2015 Erklärungsversuch. Große leere Zone im All vor dem Fleck => Mikrowellenstrahlung erhält kälter. Anschauliche Erklärung: Hintegrundstrahlung flegt durch massenähme Zone Sachs Wolf Effekt 1967 Wirkung Gravitation auf Lichtteilchen. Bei viel Masse (beleidigend) werden beeinfluss und angezogen, nehmen dadurch Energie auf (Frequenzänderung) werden blauer, fligtr durch, wird dabei wieder &#8220;abgebremst&#8221; (Frequenzsenkujng, röter) Stimmt dann nicht mehr bei expandierenden Universum. Licht fliegt auf Masse zu, Universum wird größer, so dass dei &#8220;Bremsung&#8221; nicht mehr so stark ist. => Energiegewinn aus expansion. Hier aber &#8220;Loch im All&#8221; => Energieverlust.</p>\n<p>Idee warum die Superleere zum kalten Fleck führt.</p>\n<p>Das Problem ist, dieser Effekt könnte nur 20µK bewirken. Fleck ist aber 70µK kälter.<br />\nhttps://de.wikipedia.org/wiki/Sachs-Wolfe-Effekt<br />\nHat die University of Durham. Paper in Archives.</p>\n<p>Haben sich Rotverschiebung in Sichtlinie vor kalten Flech angeschaut. ÜPber die Rotverschiebung Position festgestellt. => Es gibt keien Superleere vor dem kalten Fleck. => Model der Superleere nicht vereinbar mit Messungen. Was bleibt dann? Wissenschaftler vermuten eine Primordiale Ursache. Es gibt keine Erklärung, noch keine Antwort, Superleere ist es nicht. Spekulation: spannenste Idee, kalter Fleck durch Kollision mit Paralleluniversum.</p>\n<p>Universen wie Seifenschaum. Anderes Universum hat uns berührt. Deshalb ist diese Stelle kälter.</p>\n<p>Reinhard fragt sich ob das überhaupt durch die Berührung existiert. Warum nicht Fleischklöpse des Flying Sphagette Monster, oder die Allmighty BBBs. (siehe Doctor Das<br />\nNicolas: alle Theorien um Multiversum haben keinen guten Ruf, weil können nicht wiederlegt werden. Nicht überprüfbar. Reinhard: Könnte auch &#8220;Jesus Pensisring&#8221; sein<br />\nNicolas: Fantastische Idee, keine fundierte Feststellung. Wenn es wirklich Paralleluniversen gibt, werden wr das nie erfahren. Wenn es doch Hinweise gibt, kriegt er Gänsepelle sofort. Findet es so geil, dass er es erzählen musste. Wie hoch ist die Wahrscheinlichkeit, dass Fleck durch Zufall entsteht: ca 2%. Bestimmt aus Abweichungen (Standardabweichung) Reinhard: Gott hat da mit dem Finger&#8230;. Nicolas: genau so wahrscheinlich, mag aber Multiversum lieber. Reinhard: Stringtheorie mit Universen auf Membranen. Nicolas: immerhin Mathematisch sinnvoll. Reinhard: Stringtheorie immerhin mathematisch schön, aber nicht überprüfbar. Nicolas: Paralleluniversum mit Podcads in der Bierverteilung anders herum, und warmer Fleck in Hintergrundstrahlung diskutiert wird.<br />\nReinhard: War schön</p>\n<p><strong>Thema #2: What could possibly go wrong? Designer-Viren gegen Krebs.</strong></p>\n<p>PAPER: http://www.nature.com/articles/ncomms15327</p>\n<p>Schlimm, vielfältig. Krebs ist nicht Krebs. Unterschiedliche Entwicklungen, ergo unterschiedliche Heilansätze.<br />\nSehr verbreitet. Jeder kennt jemanden, der Krebs hat(te).<br />\nHeiliger Gral: Wirksame Krebstherapie.<br />\nProblem: Krebs wird vom Immunsystem nicht erkannt, können wuchern und andere Zellen überrennen.<br />\nAnsatzpunkt: Das Immunsystem zu trainieren und den Krebs erkennen.</p>\n<p>https://www.xkcd.com/1217/<br />\nhttps://tapas.io/episode/58081</p>\n<p>Paper:<br />\nVersuch dem Immunsystem beizubringen, wer Krebszellen sind.<br />\nImmunsystem erkennt wirksam Viren. Daher Idee: Viren zu manipulieren.<br />\nHerstellung eines künstliches Virus auf Basis eines existierenden Virus, das primär Nagetiere befällt.<br />\n3% der Menschen in Deutschland haben Antikörper gegen dieses Virus.<br />\nGrippale Symptome, kann Meningitis entstehen. Mortalität 1-2%.<br />\nForscher haben zusätzlich Protein eingebaut, das sonst nur in Krebszellen vorkommt.<br />\nResident Evil wäre nur Fiktion&#8230;.</p>\n<p>Cytotoxische T-Lymphozyten.<br />\nRelativierung(dringend, Wortspiel): Keine Heilung von Krebs, keine Therapie. Nur ein Ansatz, was man machen könnte. Man weiß, dass Dortmunder in Gelsenkirchen unbeliebt sind, und bekommen auf Bahnhofs aufs<br />\nSticker: Das geht nicht in Saal 1. Reinhard hat einen Aufkleber, Nicolas auch. Und Tassen!</p>\n<p>Nicolas muss aufs Klo <img src=\"https://s.w.org/images/core/emoji/2.4/72x72/1f600.png\" alt=\"😀\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /> Fragerunde.<br />\nWarum braucht man Gender Studies?<br />\nPool hat Durchmesser 3-4m, der kleine 1,5m &#8211; reicht für 4 bis 5 Kästen Bier.<br />\nNachfolger für Smart noch unbekannt, Firma hat Dienstwagen.</p>\n<p>Tesla Modell 3: Wie Opel Ampera, 300km Reichweite</p>\n<p>Reinhard fragt nach Wohnung in Köln</p>\n<p>Reinhard geht pinkeln Im sitzen! wers glaubt&#8230;. <img src=\"https://s.w.org/images/core/emoji/2.4/72x72/1f600.png\" alt=\"😀\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n<p>Nicolas hat Austauschstudent</p>\n<p>ISS war deutlich zu sehen, flog über seinen Garten. scheinbar knapp am Jupiter vorbei.<br />\nExperiment der Woche</p>\n<p>eines das Reinhard kennt.<br />\nAuf gehts mein Junger Padawan<br />\nWeißt Du was Fazien sind?</p>\n<p>Produkt von Tanja und Adreas. Nehmen an Amazon Vine t<br />\nProdukttest, das durchgefallen ist.</p>\n<p>Physiotherapeuten raten davon dringend ab, weil viel zu stark. Bitte von Nicolas: nicht auf Dachboden probieren.</p>\n<p>Normale Fascienrolle kostet 30 &#8211; 75€</p>\n<p>Nicolas kauft arschteure Müslis ohne Paranüsse.<br />\nSchütteln/rütteln von Müslipakcungen: größere Partikel sammeln sich oben. Paranusseffekt: Brazil nuts.<br />\nEntmischung/Segregation von granularen Medien. Alle Stücke sind durch Transport schon nach oben gewandert. Durch Rütteln werden Hohlräume erzeugt, wodurch kleinere Stücke da hineinrutschen, ergo rutschen kleine Dinge nach unten und drücken größere nach oben.</p>\n<p>Trittz auch in Geophysik auf: Mischung sandige und kiesige Böden.</p>\n<p>Artistikladen: In Landau &#8220;Die Kugel&#8221;. Spielzeug, das sich nur auseinander<br />\nschieben lässt, wenn man es dreht.</p>\n<p>Vibrierende Fascierolle. Vibriert das Müsli nicht optimal. Andere Vibrationsgegenstände sind möglicherweise besser. Probieren Müsli mit Beeren.</p>\n<p>Musik Axis of Awesome Ducktales Parodie<br />\n<iframe width=\"584\" height=\"329\" src=\"https://www.youtube.com/embed/ffX5iAG0GWI?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe><br />\nExperiment mit Reis und Erbsen möglicherweise besser, wenn man vibrierende Dinge im Schlafzimmer findet.</p>\n<p>Chinagadget der Woche<br />\n&#8220;Theo lass laufen&#8221;<br />\nAnimaris ordis parvus.<br />\nhttps://www.amazon.com/Wind-powered-Animaris-Ordis-Parvus-Strandbeest/dp/B00AM6W76W<br />\nhttp://www.wholecheap.com/Sku/1176370/wind-powered-animaris-ordis-parvus-strandbeest-model-robot-beige</p>\n<p>&#8220;Eine Tüte voller Plastikteile.&#8221;<br />\nDing, das vom Wind angetrieben sich bewegt.<br />\nVon Künstler namens Theo Jansen</p>\n<p>https://de.wikipedia.org/wiki/Strandbeest<br />\nKam in den Simpsons vor https://www.youtube.com/watch?v=wMVr7gPjpqk<br />\nAdam Savage meets Theo Jansen https://www.youtube.com/watch?v=U02qqB-2nbs</p>\n<p>Klopause</p>\n<p>Twitteraccount des Slushiemixers: https://twitter.com/SlushieMixer</p>\n<p><strong>Thema #3 Minkorrekt eine perfect Ten auf der Glaubwürdigkeitsskala.</strong></p>\n<p>PAPER:http://www.pnas.org/content/early/2017/05/16/1620542114<br />\nMinkorrekt ist unterschätzt in der WIssenschaftskommunikation tätig. Mehr hobby als professionell, aber großartig.<br />\nBritische Forscher untersuchten das Aussehen der Wissenschaftskommentatoren auf die Glaubwürdigkeit.<br />\n&#8220;Dieser Podcast ist erfolgreich, wiel man uns nicht sieht&#8221;</p>\n<p>Paper:Facial appearenace,&#8230;..</p>\n<p>Ergebnis: Attraktive WIssenschaftler erwcken mehr Interesse an den Themen, aber sie wirken weniger kompetent. lol.<br />\nDen hässlichen wird nicht zugehört, aber sie sind kompetent. Gutaussehene hört man lieber zu, aber sind weniger glaubhaft.<br />\nn= 600.<br />\nFoto: Atteaktivität, Intelligent, Alter,&#8230;<br />\nMehr Interesse anArbeit der attraktivetren Forscher.<br />\nGesellschaftlich (vgl. Trump) Eigentlich wird es wichtiger, dass wir Wissenschaftlern zuhören.<br />\nDa man minkorrekt gerne zuhört, muss minkorrekt mega hübsch sein!<br />\nhttps://pbs.twimg.com/media/C_fyTVSXoAAQEHi?format=jpg&#038;name=large</p>\n<p>Auflistung aus wissenschaftlichenapern, welche Faktoren unser Aussehen definieren:</p>\n<p>Ultimative minkorrekt Schönheitstipps:<br />\n1. ausreichend Schlaf<br />\n2. gemein sein ist nicht gut<br />\n3. zurückgezogene Körperhaltung ist nicht hübsch<br />\n4. Stress macht weniger attraktiv<br />\n5. zu glücklich oder zu stolz auch doof<br />\n6. Sinn für Humor<br />\n7.Faulheit schlecht, Hilfsbereitschaft super<br />\n8. Geruch: man muss ich riechen können: Genetischer Abstand<br />\n9. Ehrlich wärt am längsten &#8211; und ist hübsch</p>\n<p>Bleibt wach-sam.<br />\nSlushiemixer! Hat Reinhard noch nie ein Duchkstein aus der Hand gerissen.<br />\n<strong>Thema #4 Bleibt wachsam!</strong></p>\n<p>PAPER: http://www.pnas.org/cgi/doi/10.1073/pnas.1700175114</p>\n<p>Reinhard: Kann es sein, dass wir Informationen anders wahrnehmen wenn wir die über ein Sozial Network kommen als wenn sie über die Zeitung kommen. Kann es sein, dass wir dort Informationen anders bewerten.<br />\nWie kann man Nachrichten in Zukunft präsentieren. Große Verlage betreiben Bots in Social Networks. Das hat sich eine Studie genauer angekuckt. Percieved social presence reduces fact-checking.<br />\nhttp://www.pnas.org/content/early/2017/05/16/1700175114.short?rss=1</p>\n<p>2000 Probanten. Künstliches Soziales Netzwerk 36 Headlines (statements Headlines)<br />\nBewertung auf Wahrheitsgehalt und Vertrauenswürdigkeit der Quelle. Auch mit Abstufung &#8220;sollte man mal überprüfen&#8221;.<br />\n8 kleine Experimente.</p>\n<p>Setting: alleine im Sozial Network<br />\nSetting: etwas mehr als 100 Namen der anderen (virtuelle Anwesenheit einer größeren Mege)<br />\nSetting: Probant wird einer Gruppe zugeteilt.<br />\nBekommen Geld für richtige Antworten. Einzeln abgestimmt, aber mit Bewusstsein in der Gruppe zu sein.<br />\nIn Gesellschaft weniger Nachprüfen der Fakten.</p>\n<p>Grund:<br />\nEigener Beitrag zu klein?<br />\nMöglichst wenig anecken, unruhe stiften.<br />\nIn der Gruppe sicherer => weniger Aufmerksamkeit => weniger kritisch beurteilen von Fakten</p>\n<p>Steigerung der Achtsamkeit für Factchecking durch Ermahnung am Anfang.</p>\n<p>Fakenewserkennung durch Vergleich mit anderen Bildern. Ist eine Möglichkeit, sowie Moderatoren, besser ist aber Leute dazu zu sein kritisch zu sein. Sensibilisierung ist sinnvoller.</p>\n<p>Menschen werden ängstlicher, weil sie mehr Informationen haben. Terror war in 70ern viel schlimmer, aber um Flüchtlinge aus nahost wird Panik gemacht.<br />\nWas haben wir gelernt?<br />\nHaben gelernt, dass Nicolas Herz ein kalter Klumpen im Universum ist und ursprünglich in der Anomalie des Universums<br />\nMöglicher Ansatz für eine Krebstherapie<br />\nAkustische Attraktivität und wenn man minkorrekt sieht, wird man glaubwürdig.<br />\nIn größeren sozialen Gruppen hinterfragen wir weniger, was an Information vorgesetzt wird.</p>\n<p>Amazon-Kauf der Woche:<br />\nWeißt du, was Wikingerschach ist (Kubb).<br />\nUrvater von Flunkyball &#8211; Was zum Teufel ist Flunkyball???<br />\n&#8220;Typischer Physiker: Saufspiele nüchtern spielen&#8221;<br />\nhttp://www.flunkyball-deutschland.de/4.html<br />\nIn der Mitte steht der König, zwei Manschaften gegenüber.<br />\nSaufspiele sind Familienspiele.<br />\nAn Grundlinie stehen Holzeumel, dann ins eigene Spielfeld. Gegner muss erst eigene wieder abwerfen, dann andere,&#8230; blabla.<br />\nAmazoneinkäufe helfen Plantschbekcen zu finanzieren und alles andere auch <img src=\"https://s.w.org/images/core/emoji/2.4/72x72/1f609.png\" alt=\"😉\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n<p>Schon lang keine Kommentare bei iTunes mehr. Wäre nett. Kommentare der Woche.<br />\nKommentar auch per E-Mail, wenn ausgewählt, dann gibts Aufkleber.<br />\n&#8220;Sonst ham wir doch nix!&#8221;</p>\n<p>GCSE Chemistry Revison Song<br />\n<iframe width=\"584\" height=\"329\" src=\"https://www.youtube.com/embed/JQVKT4rU4sI?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p>Nächste Folge evtl in 2 Wochen.<br />\nam 11.6. ist Reinhard morgend um 9 im Deutschlandfunk Nova.<br />\nThema: sein Buch.<br />\n(War vor geraumer Zeit ja auch bei WDR Leonardo)<br />\nFragt auch nach eigener Sendung <img src=\"https://s.w.org/images/core/emoji/2.4/72x72/1f609.png\" alt=\"😉\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /> oder zumindest nach Gespräch über Wissenschaftspodcasts.</p>\n<p>&nbsp;</p>\n<p>Du möchtest mehr über unsere Werbepartner erfahren? <a href=\"https://linktr.ee/methodischinkorrekt\"><strong>Hier findest du alle Infos & Rabatte</strong></a></p>",
  "itunes:image": "",
  "itunes:episode": 102,
  "itunes:episodeType": "full",
  "itunes:subtitle": "\"Hefe, du Penner!\" direkt aus dem Bauwagen der Wissenschaft",
  "itunes:summary": "Folge 97 vom 29.05.2017\n\ndiesmal mit einem sehr kalten Fleck, Designer-Viren, akustisch attraktiven Podcastern und Glaubwürdigkeit!\n\nExperiment der Woche: Faszien-Rolle\n\nChinagadget: Strandbeest\n\nDu möchtest mehr über unsere Werbepartner erfahren? Hier findest du alle Infos & Rabatte: https://linktr.ee/methodischinkorrekt",
  "itunes:explicit": "no",
  "itunes:keywords": "",
  "itunes:author": "Methodisch inkorrekt!",
  "enclosure": "",
  "itunes:duration": 12482
}