{
  "title": "Deep Residual Networks for Gravitational Wave Detection. (arXiv:2211.01520v1 [gr-qc])",
  "link": "http://arxiv.org/abs/2211.01520",
  "description": "<p>Traditionally, gravitational waves are detected with techniques such as\nmatched filtering or unmodeled searches based on wavelets. However, in the case\nof generic black hole binaries with non-aligned spins, if one wants to explore\nthe whole parameter space, matched filtering can become impractical, which sets\nsevere restrictions on the sensitivity and computational efficiency of\ngravitational-wave searches. Here, we use a novel combination of\nmachine-learning algorithms and arrive at sensitive distances that surpass\ntraditional techniques in a specific setting. Moreover, the computational cost\nis only a small fraction of the computational cost of matched filtering. The\nmain ingredients are a 54-layer deep residual network (ResNet), a Deep Adaptive\nInput Normalization (DAIN), a dynamic dataset augmentation, and curriculum\nlearning, based on an empirical relation for the signal-to-noise ratio. We\ncompare the algorithm's sensitivity with two traditional algorithms on a\ndataset consisting of a large number of injected waveforms of non-aligned\nbinary black hole mergers in real LIGO O3a noise samples. Our machine-learning\nalgorithm can be used in upcoming rapid online searches of gravitational-wave\nevents in a sizeable portion of the astrophysically interesting parameter\nspace. We make our code, AResGW, and detailed results publicly available at\nhttps://github.com/vivinousi/gw-detection-deep-learning.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/gr-qc/1/au:+Nousi_P/0/1/0/all/0/1\">Paraskevi Nousi</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Koloniari_A/0/1/0/all/0/1\">Alexandra E. Koloniari</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Passalis_N/0/1/0/all/0/1\">Nikolaos Passalis</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Iosif_P/0/1/0/all/0/1\">Panagiotis Iosif</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Stergioulas_N/0/1/0/all/0/1\">Nikolaos Stergioulas</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Tefas_A/0/1/0/all/0/1\">Anastasios Tefas</a>"
}