{
  "id": "yt:video:wrRfOzhM2AE",
  "yt:videoId": "wrRfOzhM2AE",
  "yt:channelId": "UCLXo7UDZvByw2ixzpQCufnA",
  "title": "Why this instrument explains Black American folk music",
  "link": "",
  "author": {
    "name": "Vox",
    "uri": "https://www.youtube.com/channel/UCLXo7UDZvByw2ixzpQCufnA"
  },
  "published": "2022-10-21T18:38:20+00:00",
  "updated": "2022-10-25T12:12:15+00:00",
  "media:group": {
    "media:title": "Why this instrument explains Black American folk music",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Jake Blount, a banjo scholar, explains.\n\nSubscribe and turn on notifications 🔔  so you don't miss any videos: http://goo.gl/0bsAjO \n\nJake Blount has built a career out of understanding the banjo’s connection to Black American folk music. In this video, he walks us through the instrument’s history — from West Africa to enslaved people in the US to the early record industry — to explain how Black folk music has evolved. \n\nFor example: The early record industry confined Black musicians to “race records” and white musicians to “hillbilly records.” Hillbilly music would have been early country and string band music. Race records restricted Black musicians to blues and jazz genres. Which meant Black musicians playing bluegrass-style banjo weren’t recorded — even if they were responsible for teaching white musicians.  \n\nUsing field recordings, their own banjo and fiddle skills, and a deconstructed version of one of their own songs, Jake explains how Black musicians have long been left out of the current canon of folklore recordings and American folk music history. And what he’s doing to keep the tradition alive, with fresh observations and a musical style that looks both forward and backward.  \n\nThis video was filmed on location at Hancock Shaker Village in Pittsfield, Massachusetts.\n\nListen to Jake Blount’s music and find his album The New Faith, here: https://jakeblount.com/\n\nJake’s website also lists resources for Black string band music. You can find free online resources, discover contemporary black artists, and listen to source recordings here: https://jakeblount.com/black-stringband-resources \n\nGribble, M., Lusk, J., York, A. “Altamont” Black Stringband Music from the Library of Congress\nBlount, J. “Once There Was No Sun” The New Faith\nJones, B. “Once There Was No Sun” \n\nSmithsonian Music, “Roots of African American Music”\nhttps://music.si.edu/spotlight/african-american-music/roots-of-african-american-music\n\nSmithsonian Music, “Banjos”\n​​https://music.si.edu/spotlight/banjos-smithsonian\n\nPBS, “Blackface Minstrelsy”\nhttps://www.pbs.org/wgbh/americanexperience/features/foster-blackface-minstrelsy/\n\nMake sure you never miss behind the scenes content in the Vox Video newsletter, sign up here: http://vox.com/video-newsletter\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com\n\nSupport Vox's reporting with a one-time or recurring contribution: http://vox.com/contribute-now\n\nShop the Vox merch store: http://vox.com/store\n\nWatch our full video catalog: http://goo.gl/IZONyE\n\nFollow Vox on Facebook: http://facebook.com/vox\nFollow Vox on Twitter: http://twitter.com/voxdotcom\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}