{
  "id": "yt:video:ojb80s5Iltk",
  "yt:videoId": "ojb80s5Iltk",
  "yt:channelId": "UC3WoPalcYf7d_x4DC2BXAfw",
  "title": "Mafia 2 turned me into a mob boss",
  "link": "",
  "author": {
    "name": "jayvee",
    "uri": "https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw"
  },
  "published": "2022-09-30T15:00:40+00:00",
  "updated": "2022-10-07T09:50:25+00:00",
  "media:group": {
    "media:title": "Mafia 2 turned me into a mob boss",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "🌎Check out Instant Gaming for some great deals ↣\nhttps://www.instant-gaming.com/giveaway/JAYVEE\n\nSubscribe to jayveeonYT for more videos!\n► ​https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw?sub_confirmation=1\n\nWatch more videos on jayveeonYT! \n► https://youtube.com/playlist?list=PLGdQpBjWmxqVuXKKNVcccm81dpDwsJPvH\n\n- - - - - - - - - - - - - - - -\n\nFollow jayveeonYT!\n► Twitter: https://twitter.com/jayveeonYT​\n► Discord: https://discord.gg/jayveeonyt\n► Instagram: https://www.instagram.com/jayvee.yt/​\n\nWatch More jayveeonYT!\nLatest Uploads:  \n\nSo I ranked ALL the AC games...\n► https://youtu.be/Z9_Tb_TcPYI\n\nSo I played AC Rogue in 2021...\n► https://youtu.be/LUmOm2whuvY\n\nSo I played AC Syndicate in 2021...\n► https://youtu.be/swJN5NO2gJ8\n\nSo I played AC Unity in 2021...\n► https://youtu.be/UjTt4KtAZO8\n\nSo I played AC Odyssey in 2021…\n► https://youtu.be/guMObmtv54s\n\n- - - - - - - - - - - - - - - -\n\nAbout jayveeonYT:\nNews, reactions, and gameplay of all the biggest RPGs, open world, and action-adventure video games! Jayvee covers Assassin's Creed, Cyberpunk, Fallout, and more!\n\n- - - - - - - - - - - - - - - -\n\nCyberpunk 2077 is an action role-playing video game developed and published by CD Projekt. The story takes place in Night City, an open world set in the Cyberpunk universe. Players assume the first-person perspective of a customisable mercenary known as V, who can acquire skills in hacking and machinery with options for melee and ranged combat.\n\nMafia II is a 2010 action-adventure game developed by 2K Czech and published by 2K Games. It was released in August for PlayStation 3, Windows, and Xbox 360.[1][2] The game is a standalone sequel to 2002's Mafia,[3] and the second installment in the Mafia series. Set within the fictional city of Empire Bay from 1945 to 1951, the story follows Vito Scaletta, a young Sicillian-American mobster and war veteran, who becomes caught in a power struggle among the city's Mafia crime families while attempting to pay back his father's debts and secure a better lifestyle alongside his best friend.\n\nThe game is played from a third-person perspective and its world is navigated on-foot or by vehicle. The player character's criminal activities may incite a response from law enforcement agencies, measured by a \"wanted\" system that governs the aggression of their response. Development began in 2003, soon after the release of the first Mafia game. At release, Mafia II received generally positive reviews from critics, with praise particularly directed at its story, characters, and gameplay; however, the restrictive world design and lack of certain features present in other sandbox games was criticized.\n\nA version of the game including all previously released downloadable content, entitled Mafia II: Director's Cut, was released by Feral Interactive in December 2011.[4] A sequel, Mafia III, developed by Hangar 13, was released in October 2016. To coincide with the remake of the first game of the series, Mafia II: Definitive Edition, a remastered version of the game developed by D3T, was released by 2K Games on 19 May 2020. It received mixed reviews, particularly for its bugs and glitches, most of which were not present in the original version of Mafia II.[5] This Definitive Edition was later bundled in the Mafia: Trilogy pack, released on 25 September 2020.\n\n#gaming #jayvee #mafia2",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}