{
  "published": "2022-10-30T19:10:54-04:00",
  "updated": "2022-10-30T19:10:54-04:00",
  "title": "Who would make Bolsonaro president again?",
  "content": "<figure>\n      <img alt=\"A woman in a yellow shirt wears a sticker on her forehead supporting Bolsonaro in 2022. Her arms are raised and she is cheering. \" src=\"https://cdn.vox-cdn.com/thumbor/VwsyZnU_6Ud8LdyqP5CVMOmwzs0=/108x0:4353x3184/1310x983/cdn.vox-cdn.com/uploads/chorus_image/image/71558399/1244278490.0.jpg\" />\n        <figcaption>A supporter of incumbent PresidentJair Bolsonaro cheers during an October 27 rally in Sao Joao de Meriti, Brazil, ahead of a Sunday run-off election | Wagner Meier/Getty Images</figcaption>\n    </figure>\n\n  <p>How the incumbent president might win — or lose — in Sunday’s runoff.</p> <p id=\"Jtfe17\"><strong>Editor’s note, Sunday, October 30, 2022, 7:10 pm:</strong> <em>This piece was published ahead of the 2022 Brazilian election. Sunday, former President Luiz Inácio Lula da Silva was declared the winner. </em></p>\n<p id=\"FR9hA3\">The <a href=\"https://www.reuters.com/world/americas/brazils-lula-widens-lead-slightly-over-bolsonaro-two-polls-2022-10-26/\">runoff presidential election in Brazil is close</a>. Right now, the left-wing Workers’ Party (PT) candidate and former President Luiz Inácio Lula da Silva — better known as Lula — <a href=\"https://www.reuters.com/world/americas/brazils-lula-keeps-lead-roughly-stable-race-against-bolsonaro-poll-2022-10-27/\">remains ahead</a> of the right-wing incumbent President Jaír Bolsonaro. </p>\n<p id=\"P4yhlP\">But if the polls are wrong — <a href=\"https://www.aljazeera.com/news/2022/10/6/how-did-brazils-pollsters-underestimate-support-for-bolsonaro\">and they were once already</a> — the outcome of this election is still not a sure thing. </p>\n<p id=\"dLzuQf\">One of the questions pollsters struggled with after the first round of voting earlier this month, where Bolsonaro outperformed predictions, is how to account for his supporters. Those voters may not say publicly that they are backing the current president, because they might distrust institutions and media, or may be reluctant to say they’re casting a ballot a leader who remains <a href=\"https://www.vox.com/22737145/bolsonaro-covid-19-crimes-against-humanity-icc\">pretty controversial</a>.</p>\n<p id=\"wtUBJs\">It also raises bigger questions about who, exactly, is voting for Bolsonaro in 2022. In 2018, <a href=\"https://www.vox.com/world/2018/10/29/18025066/bolsonaro-brazil-elections-voters-q-a\">some voters</a> saw Bolsonaro as a break from the past, a change candidate who promised to crack down on crime and root out corruption. After a scandal-plagued and chaotic tenure of his own that included a mismanaged <a href=\"https://www.vox.com/2021/6/4/22456981/brazil-jair-bolsonaro-impeachment-protests-coronavirus\">pandemic</a> and the <a href=\"https://www.nytimes.com/2021/03/31/world/americas/brazil-coronavirus-bolsonaro.html\">economic fallout</a>, that case <a href=\"https://www.washingtonpost.com/world/2021/07/05/brazil-bolsonaro-corruption-investigation/\">may not resonate as powerfully this time around</a>. Bolsonaro has always maintained a core base — evangelicals and the military among them — that is largely unshakeable. No matter what Bolsonaro does or says, they stick with him. But Bolsonaro secured <a href=\"https://www.nytimes.com/2022/10/03/world/americas/brazil-elections-runoff-bolsonaro-lula.html\">about 43 percent</a> of the vote in the first round of the election, which means people outside of this base are supporting him, too.</p>\n<p id=\"b4sWk0\">Lula’s traditional base of support, in the northeast and among poor and working-class voters, has expanded to become a coalition of “everyone who are against Bolsonaro,” says Graziella Testa, a professor of public policy and government at the Fundação Getulio Vargas in Brasilía.</p>\n<p id=\"m7fXtu\">To get a better understanding of who backs Bolsonaro — and why — Vox spoke to Testa. She broke down some of the mechanics of voting in Brazil, and explained some of the cleavages among the voting population, a reflection of potentially more entrenched divisions within Brazil’s politics that are unlikely to disappear, no matter who wins this Sunday.  </p>\n<p id=\"OzS4kS\">This conversation has been edited and condensed for length and clarity.</p>\n<hr class=\"p-entry-hr\" id=\"5DFnsE\">\n<h4 id=\"B4AtHQ\">Jen Kirby</h4>\n<p id=\"qJqxAg\">Who are the Bolsonaro voters in 2022?</p>\n<h4 id=\"n8gtVw\">Graziella Testa</h4>\n<p id=\"zl6xwB\">We have some groups that are with Bolsonaro since 2018 that now are even more with Bolsonaro. </p>\n<p id=\"jvCBXJ\">There are evangelicals. There are people that work for the army. The military is very corporatist. They received lots of good inputs from Bolsonaro — if you think <a href=\"https://www.bbc.com/news/world-latin-america-50151327\">about the reform in the pension systems</a>, the militaries didn’t hurt as the regular worker in Brazil did. They have this ideological conservative agenda that is very like Bolsonaro but they also have this corporatist agenda of paycheck and pension, and Bolsonaro helped them a lot. Also, militarists in Brazil still have this ideology, as if they were this moderating power in Brazil. Most of them don’t recognize <a href=\"https://oxfordre.com/latinamericanhistory/view/10.1093/acrefore/9780199366439.001.0001/acrefore-9780199366439-e-413\">the dictatorship in Brazil</a> [during which military-installed, repressive leaders ruled for 21 years starting in 1964]<strong> </strong>was a dictatorship. Some of would still say it was a revolution to contain communists, and still defend that this was the best thing to do. </p>\n<p id=\"eEx8qZ\">We have also truck drivers and taxi drivers. Before the election of 2018, truck drivers were very unsatisfied with their conditions, and they <a href=\"https://www.nytimes.com/2018/05/28/world/americas/brazil-truckers-strike-economy.html\">made a big strike</a>. In Brazil, all kinds of goods move through the country through trucks; it’s not diverse, the ways we transport our production throughout Brazil. <a href=\"https://crisis24.garda.com/alerts/2018/05/brazil-truck-driver-strike-causing-major-disruptions-update-1\">This was a very big impact in Brazil</a>, to see those strikes; people would stay for hours in line to put some gasoline in the car. And Bolsonaro <a href=\"https://www.miamiherald.com/news/nation-world/world/article267885212.html\">recently directed new public policy specifically to truck drivers</a>. Drivers will receive every month <a href=\"https://www.bnamericas.com/en/analysis/brazil-secures-2022-diesel-supply\">about $190</a> (about 1,000 reais).</p>\n<h4 id=\"RFyQtO\">Jen Kirby</h4>\n<p id=\"Ki4u3U\">And Bolsonaro also provided support for taxi drivers, too?</p>\n<h4 id=\"g6IkgG\">Graziella Testa</h4>\n<p id=\"7giGt3\">Taxi drivers don’t get as much. [In] the most recent round of stimulus payments, there was an allowance for truck drivers; <a href=\"https://www1.folha.uol.com.br/mercado/2022/10/governo-promete-beneficio-extra-de-ate-r-500-a-taxistas-em-meio-a-campanha-eleitoral.shtml\">a gasoline allowance for taxi drivers</a>; and <a href=\"https://www.reuters.com/world/americas/brazils-economy-ministry-tries-limit-spending-fuel-related-subsidies-sources-say-2022-06-22/\">a cooking gas allowance to families in poverty</a>. In Brazil, we cook with gas, not with electric energy, so when gas got very expensive people started to make fires inside their houses and there were accidents because they needed to cook. Obviously [the allowance] had electoral purpose, but it was necessary.</p>\n<h4 id=\"M5jubp\">Jen Kirby</h4>\n<p id=\"otKoRY\">Did it serve its electoral purpose?</p>\n<h4 id=\"l6ybCq\">Graziella Testa</h4>\n<p id=\"US77Zt\">Bolsonaro also increased <a href=\"https://www.usnews.com/news/world/articles/2021-11-25/brazils-lower-house-approves-replacement-of-brazils-famed-bolsa-familia\">Auxilio Brasil</a><em>,</em> which used to be called Bolsa Familia, the program that started with Lula and pays money directly to people in misery or poor. It used to be <a href=\"https://g1.globo.com/jornal-nacional/noticia/2021/10/20/governo-anuncia-auxilio-brasil-de-r-400-a-partir-de-novembro-mas-nao-revela-a-fonte-do-dinheiro.ghtml\">about 400 reais a month</a> and <a href=\"https://www.cnnbrasil.com.br/politica/bolsonaro-cita-auxilio-brasil-de-r-600-como-forma-de-atender-a-todos/\">Bolsonaro increased it to $115 a month</a>, so 600 reais. It was important, it was a big difference, but it didn’t impact the vote of the poor. That’s the very interesting part of this. </p>\n<p id=\"b9aQQE\">Bolsonaro really tried to gain the vote from poor people, but he couldn’t. Poor people go for Lula, most of them. The vote of Bolsonaro is wealthy, is evangelical, and from men, mostly. </p>\n<p id=\"yngFn6\">Of course, those variables, they come together. Most poor people in Brazil are women, because they mostly lost their jobs during the pandemic; we have a very high [rate] of families with only one parent, and almost all the time this parent figure is a woman. If you look at the face of poverty and food insecurity, it is a face of a woman. And those women mostly vote for Lula as well. Bolsonaro didn’t get the vote he wanted with this stimulus payment specifically. He did get the support of truck drivers and taxi drivers, but they are not relevant in number of citizens when you think about a country the size of Brazil. </p>\n<h4 id=\"LwrRej\">Jen Kirby</h4>\n<p id=\"Lhtzjg\">Are there any other constituencies that support Bolsonaro?</p>\n<h4 id=\"44W271\">Graziella Testa</h4>\n<p id=\"bmZoNo\">Another important variable in the Bolsonaro vote is the size of the city. From 2018 to 2022, big cities tended to vote more for Lula, and Bolsonaro got stronger in small cities. Mostly because he has strong support from the agriculture sector, and those cities are mostly located in rural areas. </p>\n<p id=\"srXf8U\">You have this group of agro-related business that really supports Bolsonaro. The same way you have in the US, you have the country music, there’s a very specific culture; here in Brazil, we have this, too. We have our kind of country music and lots of those artists are with Bolsonaro because there is this support from the rural area and the agriculture sector. </p>\n<p id=\"79NKQo\">One thing that is interesting to note, as well, is that evangelicals are the biggest supporters of Bolsonaro, but <a href=\"https://www.npr.org/2022/08/25/1117849457/evangelical-vote-brazil-bolsonaro-lula\">Catholics are the biggest supporters of Lula</a>. Until today, the difference of how educated the person is, and the region, have been important, but maybe it’s the first time you have this very strong variable that is religion in the Brazilian elections. Which is interesting because Bolsonaro has always declared that he is Catholic. His wife is the strongest tie that he has to the evangelical community. But Catholics in Brazil tend to feel that it’s not good to relate religion and state, which is the opposite of the evangelical leadership in Brazil.</p>\n<h4 id=\"7xgIij\">Jen Kirby</h4>\n<p id=\"EYNzG2\">So, as in 2018, Bolsonaro is likely to have strong support from evangelicals, the military, and the agriculture sector; Lula is likely to retain a large share of the support of working-class and poor people. Are there other notable trends?</p>\n<h4 id=\"xiSDHw\">Graziella Testa</h4>\n<p id=\"3hp1u2\">Another thing is that we also have important regional cleavages in Brazil. You have the midwest, that goes strongly for Bolsonaro. It’s the region that has most of the agriculture industry in Brazil. The south is also very supportive of Bolsonaro, and the north is also mostly Bolsonaro. </p>\n<p id=\"ydB5E3\">Then you have the northeast, that votes — like more than 70 percent, almost 80 percent — for Lula. You have states in the northeast of Brazil, like Bahia and Pernambuco, which are big and important states. <a href=\"https://www.americasquarterly.org/article/its-lula-forever-in-brazils-northeast/\">The northeast is an important base for Lula</a>.</p>\n<p id=\"aqFruN\">Then you have the southeast, which is the biggest region of Brazil, with the most votes, and it’s the more divided. In this region, you have like 50-50. In the center of this dispute, you have São Paulo. São Paulo is the biggest state of Brazil, and you have a second round [of elections], as well, for governor. In the second round for governor, there is the PT candidate and the candidate that is <a href=\"https://abcnews.go.com/International/wireStory/shooting-disrupts-bolsonaro-backed-candidates-campaign-stop-91629732\">a former minister of Bolsonaro’s government</a>. The same dispute that you have on the national level, <a href=\"https://foreignpolicy.com/2022/08/31/brazil-elections-sao-paulo-haddad-lula-bolsonaro-workers-party/\">you have on the state level</a>. In the beginning, the candidate from PT was behind the candidate of Bolsonaro. But now <a href=\"https://www1.folha.uol.com.br/poder/2022/10/ipec-tarcisio-tem-46-em-empate-tecnico-com-haddad-43-brancos-e-nulos-sao-7-e-indecisos-4.shtml\">they are technically tied</a>. This difference may impact the national-level campaign.</p>\n<aside id=\"uZygfn\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Brazil’s likely next president, explained\",\"url\":\"https://www.vox.com/videos/2022/10/25/23422828/brazil-lula-bolsanaro-presidential-election\"}]}'></div></aside><h4 id=\"gXAIwr\">Jen Kirby</h4>\n<p id=\"VdT7hb\">In 2018, Bolsonaro attracted supporters frustrated with corruption and the state of the economy, but who maybe weren’t completely sold on the guy. What does that constituency look like in 2022?</p>\n<h4 id=\"DP2bGK\">Graziella Testa</h4>\n<p id=\"nMibcC\">You have this strong, important ideological movement in Brazil that are people who are anti-PT, who hate the Workers’ Party, which is Lula’s party, mostly because of a big corruption scandal, <a href=\"https://www.economist.com/the-economist-explains/2021/03/09/what-did-lava-jato-brazils-anti-corruption-investigation-achieve\">Lava Jato</a> (Operation Car Wash). This Lava Jato scandal still hurts the PT, and you have lots of people who are not voting exactly for Bolsonaro, they’re voting because they want anything but PT. </p>\n<p id=\"ALHdEM\">On the other hand, you also have people who vote for Lula who are not even leftists. If you ask them they will say, “I have always been ideologically right, but I cannot tolerate someone like Bolsonaro, with everything he did during the pandemic, and that’s why I’m not voting for him at all.” </p>\n<p id=\"AadTBZ\">I think the pandemic really hurt Bolsonaro, and the economic results were also a big factor. Lula [was cleared] <a href=\"https://time.com/5946236/brazil-lula-returns/\">of all the charges held against him</a> [in the Lava Jato scandal] — they can open a new process now, but he’s not being prosecuted — and if there was lots of corruption during his government, it was a bigger scale involving all the coalition parties and even opposition parties. So even though this is the weakest point of Lula, for lots of people who went for Bolsonaro [in 2018], he is the option because of what Bolsonaro did with the economy and with public health during the pandemic.</p>\n<p id=\"R9evuB\">You have a good dose of former rivals who are now supporting Lula. The vice president candidate [Geraldo Alckmin] with <a href=\"https://en.mercopress.com/2022/09/29/lula-praises-vice-president-candidate-alckmin-the-best-thing-we-have-done\">Lula used to be a rival of the PT,</a> and now they compete and run together. Lula is very, very smart in a political way. He can construct those [relationships] with people who are very different from him. It’s government that has to accommodate lots of different perspectives. It’s not going to be easy to govern if Lula wins, but Lula represents everyone who is against Bolsonaro. That’s the situation now.</p>\n<h4 id=\"SZBiZS\">Jen Kirby</h4>\n<p id=\"CVM7F6\">It sounds a little bit like the Democratic coalition that came together to defeat Trump in 2020. </p>\n<h4 id=\"p43j5V\">Graziella Testa</h4>\n<p id=\"Ye8dUq\">Exactly.</p>\n<h4 id=\"QZCX4w\">Jen Kirby</h4>\n<p id=\"FsdiWq\">I guess we’re not quite there yet. But one of the things that has come up — similar to the US in 2020 — <a href=\"https://www.bloomberg.com/news/articles/2022-09-23/lula-s-support-puts-first-round-win-back-in-play-datafolha-says#xj4y7vzkg\">is the initial polling that showed Lula so far ahead</a>, and potentially winning outright in the first round. In reality, the race is actually much, much closer. And so I will frame this in a very American way, which is: does this election just come down to turnout? </p>\n<h4 id=\"ogfe1D\">Graziella Testa</h4>\n<p id=\"E614fe\">Turnout is not such a big deal in Brazil as it is in the United States. But we have to point out this factor because as in the US, in Brazil, there’s a big difference between who is not going to vote and who is going to abstain from voting, and who does vote. </p>\n<p id=\"Y7txit\">The poorer the person is, the less likely this person is going to vote. The truth is that we don’t have good measures for the likely voters as you do in the US. We are starting to have some companies who are trying to understand this in Brazil, but it’s not very calibrated yet. But because the people who are less likely to vote are the ones who mostly go for Lula, it may hurt Lula.</p>\n<p id=\"Mfn2sR\">But you have another movement in Brazil. We all vote on the same day, on Sunday. There’s a holiday on Friday, and another holiday on Wednesday. People from the middle class and wealthy people, they can travel and they may be away from home on the day of voting. And this may hurt actually Bolsonaro, because this electorate is Bolsonaro’s.</p>\n<p id=\"sMccRj\">Another important point is that people over 70 years old are not obliged to vote anymore. But the [<a href=\"https://www.in.gov.br/en/web/dou/-/portaria-dirben/inss-n-982-de-22-de-fevereiro-de-2022-383112438\">National Institute of Social Security]</a> established this year that old people could show proof of life with their vote — basically, to keep receiving your paychecks, you have to prove that you are alive. There are a few ways to do that, and now voting is included as one of those ways. So you have a percentage of old people voting, and guess who most vote for Bolsonaro? Older people.<em> </em>[Note: <a href=\"https://www.brasilwire.com/vote-for-bolsonaro-or-lose-your-pension/\">Bolsonaro’s campaign was dinged for misleading ads</a> that appeared to suggest that voting for Bolsonaro was the way to verify proof of life.] </p>\n<p id=\"NbSZ7b\">But this proof of life, they just needed to do that in the first round. They have the proof already. So in theory, they don’t have to go on the second round. Maybe they will vote because they were actually very ideological. But maybe they just wanted to do the proof of life, so they are not going to go on the second round.</p>\n<h4 id=\"NZ0btP\">Jen Kirby</h4>\n<p id=\"hZBEKk\">What are the legal requirements of voting in Brazil?</p>\n<h4 id=\"Xf8Rzk\">Graziella Testa</h4>\n<p id=\"PfllcB\">Up to 70 years old, we are obliged to vote. There are some people who can vote, but you don’t have to: [Those groups are] if you are more than 70 years, or if you are between 16 and 18 years. And if you cannot read and write, if you’re illiterate, voting is not mandatory.</p>\n<p id=\"3LajkR\">For everyone else, 18 to 70, voting is mandatory. There are some things that you cannot do if you don’t vote, like you can’t have a passport, you can’t be a public servant. </p>\n<p id=\"XEBSRc\">Most of the punishments you have if you don’t vote, they are stronger for wealthier people. Who needs a passport? Someone who can go abroad. Who needs to be a public servant? Someone who can study very hard. That’s why we have the system, but it mostly obliges people who have a higher income.</p>\n<h4 id=\"5lst5V\">Jen Kirby</h4>\n<p id=\"EaOIia\">Interesting, the system is set up to encourage voting, but based on the demographics of who is voting, it favors, in some ways, Bolsonaro. For poorer people, voting may be mandatory, but they may not really feel the sting of the penalties, which also seems to make allowances for the fact that it’s probably harder for some of that group to get to the polls.</p>\n<h4 id=\"AGi5lb\">Graziella Testa</h4>\n<p id=\"YeYTiR\">Another important point is that poor people, sometimes they need to use public transportation to go vote. If they have to pay for the public transportation, it’s going to be too much for them. So now you have a few cities in Brazil who have already declared that the buses and other kinds of public transportation are going to be free on the day of voting. <a href=\"https://brazilian.report/liveblog/2022/10/24/sao-paulo-free-transportation-election-day/\">One city that already did that is São Paulo, which is a very big and important city</a>. You have other cities who also announced that, and there’s now a movement to make public transportation free so that poor people can also go and vote the way rich people can do with their cars. </p>\n<aside id=\"6DXhPs\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Brazil escaped a January 6-style insurrection — for now\",\"url\":\"https://www.vox.com/2021/9/8/22620570/bolsonaro-brazil-september-7-democracy-supreme-court\"}]}'></div></aside><h4 id=\"XTRdC0\">Jen Kirby</h4>\n<p id=\"g3Ofrm\">Of course, the more people who vote, the better for democracy. But the big question now is whether, if Lula does win, which it seems he might — if a bit closer than initially thought — that Bolsonaro will accept the results. <a href=\"https://www.vox.com/2021/9/8/22620570/bolsonaro-brazil-september-7-democracy-supreme-court\">We’ve already seen him sowing doubts about the integrity of the election</a>. Given what we know about who is likely voting for Bolsonaro this time around, how do you think his supporters will interpret his loss — if he does lose?</p>\n<h4 id=\"KlbYCt\">Graziella Testa</h4>\n<p id=\"667swL\">Well, I think it’s very difficult to anticipate that. We cannot anticipate what the army or the military or his supporters are going to do. I have hope that we have strong enough institutions. But we are not calm. It’s not, “Okay, it’s another election.” But I think at the end, it’s going to be well.</p>\n<p id=\"L99xbG\"></p>\n<p id=\"D73uEQ\"></p>\n<p id=\"1yZgPY\"></p>\n<p id=\"dbDkIc\"></p>",
  "link": "",
  "id": "https://www.vox.com/world/2022/10/29/23427452/bolsonaro-lula-voters-election-brazil-expert-questions",
  "author": {
    "name": "Jen Kirby"
  }
}