{
  "id": "yt:video:y90GLWU7jq4",
  "yt:videoId": "y90GLWU7jq4",
  "yt:channelId": "UCccafaIN6dwBwyl1cwNH90w",
  "title": "The Serotonin 2A Receptor Pt. 1: Brain Effects |  The Psychedelic Brain Receptor | Pharmacology",
  "link": "",
  "author": {
    "name": "The Psychedelic Scientist",
    "uri": "https://www.youtube.com/channel/UCccafaIN6dwBwyl1cwNH90w"
  },
  "published": "2021-03-06T19:05:39+00:00",
  "updated": "2022-06-26T20:56:22+00:00",
  "media:group": {
    "media:title": "The Serotonin 2A Receptor Pt. 1: Brain Effects |  The Psychedelic Brain Receptor | Pharmacology",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "This is the first video in my two part series on the serotonin 2A (aka 5-HT2A) receptor - the brain receptor most important for psychedelic drug effects!\n\nIn this video I go over: \n\n- the basics of how neurons communicate and what a brain receptor is (0:23)\n\n- how psychedelics act as if they're serotonin (1:38)\n\n- how we know that the serotonin 2A receptor is the most important for psychedelic effects (2:18)\n\n- where this receptor located in the brain (2:55)\n\n- what happens to the activity of neurons/groups of neurons when this receptor gets activated (4:28)\n\nIn Part 2 I will be going over theories on what this system might be responsible for (independent of psychedelics drugs), as well as why it might've evolved! Stay tuned for that soon.\n\n---\n\nDon't forget to follow me on social media for all the latest updates. Especially Instagram where I've started putting out regular shorter content!\n\nInstagram\nhttps://www.instagram.com/thepsychede... \n\nTwitter\nhttps://twitter.com/ThePsychedSci\n\nFacebook\nhttps://www.facebook.com/The-Psychede... \n\nMore info about me:\n\nManesh Girn is a Neuroscience PhD student at McGill University and has been lead or co-author on over a dozen scientific publications and book chapters on topics including psychedelics, meditation, daydreaming, and brain networks. \n\nManesh currently has ongoing collaborations with Robin Carhart-Harris and others at the Imperial College Center for Psychedelic Research and is investigating the brain changes underlying psilocybin, LSD, and DMT.\n\nhttps://twitter.com/MGirnNeuro\nhttps://www.researchgate.net/profile/...",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}