{
  "title": "Aime to Invest &#8211; From Bankruptcy to FI in 8 Years",
  "link": "https://www.madfientist.com/aime-to-invest-interview/",
  "comments": "https://www.madfientist.com/aime-to-invest-interview/#comments",
  "dc:creator": "The Mad Fientist",
  "pubDate": "Mon, 25 Apr 2022 09:00:27 +0000",
  "category": [
    "Geographic Arbitrage",
    "Interviews"
  ],
  "guid": "https://www.madfientist.com/?p=7432",
  "description": "<p class=\"lead\">Patrick Aime from Aime to Invest shares the important lessons he learned on his rollercoaster journey from bankruptcy to FI millionaire!</p>\n<p class=\"more-link-p\"><a class=\"btn btn-danger\" href=\"https://www.madfientist.com/aime-to-invest-interview/\">Read more &#8594;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/aime-to-invest-interview/\">Aime to Invest &#8211; From Bankruptcy to FI in 8 Years</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "content:encoded": "<p>On today&#8217;s episode of the <a href=\"https://www.madfientist.com/podcast/\" rel=\"noopener\" target=\"_blank\">Financial Independence Podcast</a>, I speak to Patrick Aime from <a href=\"https://www.youtube.com/channel/UC_zAjsAmKWA_Vizqlpt-j4A\" rel=\"noopener\" target=\"_blank\">Aime to Invest</a>!</p>\n\n<p>Patrick&#8217;s journey to FI is an incredible one.  He&#8230;</p>\n\n<ul>\n<li>Moved from his home in Rwanda to attend high school in Europe and college in America</li>\n<li>Stayed in America after college and started working in the feast-or-famine world of sales</li>\n<li>Started his own company and grew it to $5 million in revenue in four years</li>\n<li>Used his success in business to invest in rental properties and live a lavish lifestyle</li>\n<li>Lost everything during the 2008 global financial crisis and had to declare bankruptcy</li>\n<li>Found FIRE and drastically reduced his expenses and started saving for the long term</li>\n<li>Rebuilt a smaller business and started investing in short-term rental properties in Mexico</li>\n<li>Utilized <a href=\"https://www.madfientist.com/category/geographic-arbitrage/\" rel=\"noopener\" target=\"_blank\">geographic arbitrage</a> to lower his expenses even further</li>\n<li>Hit FI 8 years after declaring bankruptcy and became a millionaire 2 years after FI</li>\n</ul>\n\nPatrick shares everything he learned during his rollercoaster financial journey so hope you enjoy the interview!\n\n<h2>Listen Now</h2><div style='padding:20px'><audio class=\"wp-audio-shortcode\" id=\"audio-7432-2\" preload=\"none\" style=\"width: 100%;\" controls=\"controls\"><source type=\"audio/mpeg\" src=\"https://traffic.libsyn.com/secure/madfientist/aime-to-invest-interview.mp3?_=2\" /><a href=\"https://traffic.libsyn.com/secure/madfientist/aime-to-invest-interview.mp3\">https://traffic.libsyn.com/secure/madfientist/aime-to-invest-interview.mp3</a></audio></div><ul><li>Listen on <a href='https://open.spotify.com/show/5AjnvxZb6ZScoI6KCV0hxo' target='_blank'>Spotify</a> or <a href='https://www.madfientist.com/go/itunes/' target='_blank'>Apple Podcasts</a></li><li>Download MP3 by right-clicking <a href='https://traffic.libsyn.com/secure/madfientist/aime-to-invest-interview.mp3' target='_blank' rel='nofollow'>here</a></li></ul>\n\n\n\n<h2>Show Links</h2>\n\n\n\n<ul>\n \t<li><a href=\"https://www.youtube.com/channel/UC_zAjsAmKWA_Vizqlpt-j4A\" target=\"_blank\" rel=\"noopener\">Aime to Invest YouTube Channel</a></li>\n<li><a href=\"https://frugalsafari.com\" target=\"_blank\" rel=\"noopener\">Frugal Safari Website</a></li>\n<li><a href=\"https://twitter.com/frugalsafari\" target=\"_blank\" rel=\"noopener\">Patrick on Twitter</a></li>\n<li><a href=\"https://pages.madfientist.com/fi-laboratory\" target=\"_blank\" rel=\"noopener\">Mad Fientist&#8217;s FI Laboratory</a></li>\n</ul>\n\n\n\n<h2>Full Transcript</h2>\n<div class=\"transcript\">\n<strong>Mad Fientist:</strong> Hey, what&#8217;s up, everybody. Welcome to the Financial Independence Podcast, the podcast where I talked to some of the best and brightest in personal finance to find out how they achieved financial independence. <br/><br/>I&#8217;m really excited about today&#8217;s show. I&#8217;m talking to a buddy of mine named Patrick, who I met way back in 2016 at FinCon San Diego, which is a financial conference.<br/><br/>And he was a Mad Fientist listener at the time. And just came up and talked to me and my wife. And I quickly realized one, he&#8217;s a really fun guy to talk to, but also he had a really interesting story to tell. So I&#8217;m excited to share it with you today. Patrick&#8217;s story is a bit of a rags to riches, to rags, to riches story.<br/><br/>And there&#8217;s lots of stuff that he learned along the way, and I&#8217;m excited to dive into some of it, but a brief summary&#8230; he built up a multi-million dollar business over the years, and he was living the multimillion dollar entrepreneur lifestyle a bit. And sadly it all came crashing down during the global financial crisis.<br/><br/>So he had to eventually declare bankruptcy and start from scratch again. And when he was rebuilding up his life and his business, he realized he needed to get his personal finances in order. And that&#8217;s how he ended up finding the financial independence world. And that led to him completely changing his outlook on spending.<br/><br/>And he ended up trimming his expenses to less than 50% of before the financial crisis. And he was able to build up his business and his investments, and he was able to reach financial independence in just eight years after declaring bankruptcy. So it&#8217;s an incredible story with lots of lessons learned, no doubt. So without further delay, Patrick, thank you so much for being here. I really appreciate it! <br/><br/><strong>Patrick:</strong> Thank you for having me on, Mad Fientist. This is an honor to be on your podcast.<br/><br/><strong>Mad Fientist:</strong> So we go way back. We met back in 2016 at FinCon San Diego. And I have to say out of my entire decade of being the Mad Fientist, I think when I met you, that was the coolest I ever felt. And it just so happened to be, my wife was there and she got to experience it too. So yeah, if we just go back to 2016 and we were just milling around in some big convention hall and you came up to me and you just said some very kind things in front of my wife, and I could just tell by her face, she&#8217;s like, what is going on here?<br/><br/>This guy is like, he looks like a really nice normal guy smart. And he&#8217;s saying all these really nice things about, you know, just weird financial writing on the internet. And yeah. So I have to say thank you for that. That was a highlight of being the Mad Fientist.<br/><br/><strong>Patrick:</strong> That was crazy. I remember that too. I was talking about how I first met you. I actually was, I met JD Roth first, and then I was like \"Do you know the Mad Fientist?\" He was like, of course, you know, because I knew I had listened to your podcast when you interviewing him. And I know, is that, can you introduce me to him and was like, Hey yeah, sure.<br/><br/>You know, so, and then when I met you, I was, I was star struck, dude. I remember when I asked you to get to take a picture with you and your wife was looking at us, like what&#8217;s going to picture him here.<br/><br/><strong>Mad Fientist:</strong> Exactly <br/><br/><strong>Patrick:</strong> Yeah, and for me, I I&#8217;m the sports marketing industry. So we do a lot of big corporate events or we know the big sporting events. So I get to meet a lot of celebrities you know, Hollywood and sports celebrities. And but I don&#8217;t get as star struck as, as well as when I met the Mad Fientist, that was like, I gotta get a picture.<br/><br/><strong>Mad Fientist:</strong> That&#8217;s what you said that, yeah, that, that reminded me. You said something about like, yeah, like you had met some famous basketball player or something and and yeah, you&#8217;re more excited to meet me. And like, I was just as dumbfounded as my wife, because I&#8217;ve just been writing some weird financial stuff into the internet and never expected any sort of a response like that.<br/><br/>And and yeah, it was, it was pretty special. So I, I appreciate all the kind words and it was good to meet you all those years ago and hear some of your story, which I&#8217;m so excited to get into today, obviously. And so yeah, thanks for taking the time.<br/><br/><strong>Patrick:</strong> Being on your show is definitely a highlight of my FI experience because you&#8217;re the reason why I started this whole FII journey and to be on your show after all these years is basically a bucket list type of opportunity for me. So thank you again.<br/><br/><strong>Mad Fientist:</strong> Oh, no, my pleasure. And yeah, like I meant to do it a long time ago because when we met in 2016, I was like, wow, Patrick has such an interesting story. I need to get them on the podcast, but then completely forgot all about it after that. And then it wasn&#8217;t until recently, just a few months ago, you had tagged me on a YouTube video that you had published.<br/><br/>And I watched it and was like, oh yeah, this is why I was to have Patrick on all those years ago. So I&#8217;m so excited. We&#8217;re getting to do it today. So for my audience who is not familiar with you, could you maybe just tell a little bit about yourself and how this whole FIRE thing came about for you? <br/><br/><strong>Patrick:</strong> Definitely. So I&#8217;m originally from Africa, east Africa, the small country called Rwanda, and we&#8217;re best known for having a mountain gorillas that you can actually visit in the mountains in the wild, which is one of those experience that you have to to do if you have a chance. And so I grew up in Africa, very modest lifestyle, single mom.<br/><br/>And when I was 14, I had a chance to go to high school in Belgium and and I took it. And then so I went to high school in Belgium. I was playing basketball. And then a few buddies of mine, teammates, were playing in the US and so had a chance to go to college in the US.<br/><br/>And of course that took it because being from Africa, having a chance to live in America, it&#8217;s too big of a dream. You know, because for us going to Europe is somewhat an achievable dream because it&#8217;s not that far and a lot of people have done it. And so for a kid out of Africa, especially my country Rwanda, a lot of people go to Europe or even South Africa, which is a modern African country to really experience I guess the first world living.<br/><br/>And then when I got a chance to come to the US I took it and my plan was to come here do the whole collegiate experience and then go back to Europe and play at a pro level, like a lot of my friends were doing, but I hurt myself my second year. And then it wasn&#8217;t the same anymore.<br/><br/>So that dream was was done. And then I decided to stay in the US, which was the best decision of my life. And then got a job, started working in a sports marketing, as we talked about. Saw these ads saying sales make a lot of money as I can do that.<br/><br/>So I got the job. And after four years of like a telemarketing type of a telesales, telemarketing, what you have to call these top CEOs of big companies and pitch them, kind of like that movie, Glengarry Glen Ross, or the boiler room basically, you know, yeah.<br/><br/>You learn quick. I love those kind of movies because they remind me of my start in working, basically hitting the phone, it&#8217;s kind of like a stockbroker in a way, where you got to make a hundred calls a day and hope that you talked to 10 people and out of the 10 people, maybe a sign up one person.<br/><br/><strong>Mad Fientist:</strong> And this commission- only sales. Is that right? So you didn&#8217;t have any sort of base salary and you just earned solely off the commissions of what you sold. Is that right? <br/><br/><strong>Patrick:</strong> Yes. So, it was a commission only sales, and that if you sold a package, which is hard to do, but if you sell a package, you make a lot of money, thousands of dollars per package. And so we knew that I was feast or famine basically. You sell something, you make a lot of money, you sell nothing and you&#8217;re dead broke for that month, basically.<br/><br/>So it was a high turnover job because it&#8217;s not made for everybody because you have to accept rejection every single day. And in the toughest thing with a commission only sales job too, is the fact that you have to reinvent yourself every month because&#8230; I have a buddy of mine who was my CPA, and he always tells me how his job, at the beginning of each year, he already knows how many clients he&#8217;s going to doing taxes for. So he already has a book of business that he knows, we will come back every year, so he doesn&#8217;t have to go fetch a new business. Whereas for me, I can have a huge month. Then the first of the next month, I have to start from scratch.<br/><br/>I don&#8217;t know where I&#8217;m going to get my next deal. So it&#8217;s kind of like you have to reinvent yourself every single month.<br/><br/><strong>Mad Fientist:</strong> Wow. So, so you&#8217;re, you&#8217;re just basically cold calling and hoping for the best. And you&#8217;re not really taking any warm leads into the next month.<br/><br/>Is that right? <br/><br/><strong>Patrick:</strong> Exactly. I&#8217;ve been doing this since 1998. And. It&#8217;s still as hard as it was on day one. You know, of course now I have a book of business. Because you can do a great job to a customer who said, once they get their clients to let&#8217;s say, super bowl and the super bowl happens to be in your hometown, then it makes sense for you to invite a few of your top accounts and then take them to a super bowl for a nice weekend of a fun and party.<br/><br/>So you can get to meet your clients at a personal level and generate more revenue in the future because now you know&#8230; so if there&#8217;s a relationship type of packages that we sell, where you get to spend time with your client outside of a boardroom, where you get to really know him at a personal level and that usually helps your bottom line.<br/><br/>Say the Super Bowl was just in LA and you do a big junket and you invited your clients. It doesn&#8217;t mean that you&#8217;re going to do next year when the super bowl is in Phoenix so that&#8217;s why you have to find another client who is in Phoenix, who wants to do the same thing.<br/><br/>So that&#8217;s why you have to always, always, always get new leads and new clients .<br/><br/><strong>Mad Fientist:</strong> So it sounds like what the job like that you would need some serious money management skills to be able to smooth out those highs and lows so that you can sustain yourself for every month, no matter what&#8217;s happening. It sounds like you did that, but it was just because you were so good at sales that you&#8217;re able to maintain a really lavish lifestyle. Can you talk about adjusting to that sort of income and then how you actually used that to inflate your lifestyle quite a bit. <br/><br/><strong>Patrick:</strong> Yeah. So I get my job and then I become the king of of cold calling and then four years into it, I had learned the sales aspect of it, I learned the the operational sides of it. And then I was like, you know what? I think I can do this for myself. I&#8217;d have to work with somebody.<br/><br/>So that was one of my biggest accomplishment in life because four years after college, I just jumped in and started my own company in the same industry. <br/><br/><strong>Mad Fientist:</strong> Oh, wow. <br/><br/><strong>Patrick:</strong> Yes. So I wasn&#8217;t married. I had no kids. So there was nothing to lose really and everything to gain. So I jumped in and then I started my new company and the idea behind that whole thing was like, I was telling my current customers that I was starting a new company and all excited for me. And I thought I was going to get everybody to join me. But then they didn&#8217;t really join me as I thought they would.<br/><br/>Because when I did my my business plan, I counted for a certain number of accounts that would come with me. And then nobody showed. So I had to really dig deep and find new accounts to start my company. So it was tough the first six months, I thought I was going to be a bust.<br/><br/>And then after month six, I just blew up and got a bunch of deals. And the Super Bowl was in San Diego that year 2003. And I was basically sold that in a month. I like 200 people going to the Super Bowl. And I was like, wow, this is ridiculous. And then the following year I kept growing the business.<br/><br/>I went from basically $0 to $5 million in four years. <br/><br/><strong>Mad Fientist:</strong> Wow. <br/><br/><strong>Patrick:</strong> Yes. In revenue. And I had a whole sales team at that point. I had 10 people working for me. I had a whole event planning team on site. I had two event planners. I had an accounting team onsite. So we had a bunch of accounts at that point and everything was rolling.<br/><br/>And of course, with money coming in and I hadn&#8217;t seen that much money in my lifetime. So I started spending all the money as well. <br/><br/><strong>Mad Fientist:</strong> Let&#8217;s just recap real quick. Did you graduate college in 98? Is that right?<br/><br/><strong>Patrick:</strong> Yes. <br/><br/><strong>Mad Fientist:</strong> And then you worked for somebody else until about 2002 and then 2002, you started your own company and then it took six months to a year to get ramped up. And then 2003 you&#8217;re really cooking.<br/><br/>Is that, is that about right? <br/><br/><strong>Patrick:</strong> Yes.<br/><br/><strong>Mad Fientist:</strong> Nice. Okay. So you got all this money coming in and yeah, talk about how that changed how you spent. <br/><br/><strong>Patrick:</strong> I guess rewind a little bit, when I finished college, I started my job. A lot of people in the office talking about investing in stocks and this and that and stocks splits and all of that.<br/><br/>So I started kind of of studying up on that a little bit. And then in 2000, early 2000, I jumped in and invested $5,000 in the tech mutual fund. So it was basically all the .coms were in this fund. And then and you know, what happened that year? The whole .com bubble burst.<br/><br/>And then my $5,000 basically turned into $1,800 in like six months. So at that point, I was like, okay, I don&#8217;t believe in the stock market, I&#8217;m never going to invest in this thing again. And so I did not touch the stock market. And then in 2003, when when the money started flowing in, for me, I bought a house.<br/><br/>I bought a townhouse in downtown in a really ritzy area. And then of course when you have a new house, you have to get a new car too. At that point, I was driving an infinity FX 35. And at that point my monthly payment was about $400 or $500.<br/><br/>So I just bought a house and then I was like, okay, now just get a nice car to park in front of this house. So I went and bought a Mercedes, like the most expensive Mercedes out there where my monthly payment&#8230;I leased it, it was a three-year lease. And I was spending $1,100 a month.<br/><br/>And, Mad Fientist, I got to tell you, one thing about me was, I had a spreadsheet. So I was spending out of control, but it was always on my spreadsheet. So if it made sense of my spreadsheet, I spent it. So the way I did it for the car, as an example, I was like, okay, so I&#8217;m paying $500 for this car right here. This one is going to cost me $1,100. So it&#8217;s only $600 extra. Do I have $600 extra? Yes, I do. Okay.<br/><br/>So you know, trips, bottle service. I remember one of my birthdays was epic where we had a Cristal, think we had like 10 bottles of Cristal. So I was just spending thousands of dollars in a stupid manner.<br/><br/><strong>Mad Fientist:</strong> As someone who has never had Cristal, how is it? Is it really that much better than any other champagnes or&#8230; because I want to have had Krug champagne on a business class flight that I booked with miles on Qatar Airlines and that the Krug was amazing. Like I&#8217;m not a champagne fan, but I could drink that Krug all day.<br/><br/>Is Cristal the same sort of quality then? <br/><br/><strong>Patrick:</strong> Yes, it goes down smooth, like you can tell it&#8217;s a little different than the Corbel. <br/><br/><strong>Mad Fientist:</strong> Yeah. <br/><br/><strong>Patrick:</strong> But it&#8217;s not worth the money you&#8217;re spending on that one bottle though. You&#8217;re trying to get drunk and they all taste the same really. <br/><br/><strong>Mad Fientist:</strong> That&#8217;s true. We were up in Islay, Scotland, which is where they produce all the peaty whiskies, and this completely wasted guy came up to the bar next to us and ordered a dram of whiskey for 95 pounds. So that&#8217;s like pretty much one shot of booze for 95 pounds. And we were sitting there drinking our four pound dram of something good but not 95 pounds.<br/><br/>And it took everything I had not to just swap mine for his cause I was like, there&#8217;s no way he&#8217;s going to notice. He can&#8217;t even stand up. Like, this is all going to taste the same to him and it took everything I had not to just swap that over and see what 95 pound dram actually tasted like. <br/><br/><strong>Patrick:</strong> Yeah, exactly. <br/><br/>So basically I was spending out of control, I was not saving anything, but one thing I did that was great though. At that time, I bought a bunch of rental properties in Arizona and I bought four properties in the same month. That was when the real estate was booming in the U S and I remember that time in Arizona and Phoenix area, there were saying, like, finding a house at $200,000 is going to be a thing of the past, you know, like these homes are going to $500,000. So I was like, yeah, let me just go in.<br/><br/>Because, as I said before, I didn&#8217;t believe in the stock market. So I was like, okay, this real estate thing. When I bought that townhouse, it appreciated real quick, within a year. And then by &#8217;05, appreciated like a couple of hundred grand on my townhouse in downtown San Diego.<br/><br/>And then I was like, okay, now I&#8217;m a believer in real estate. And then of course at that time, everybody was saying real estate never goes down. It only goes up. And when I bought those homes in Arizona as rental properties it was going great too. I hired a property manager in Phoenix and they were doing everything for me and getting an 8% cut on the rent.<br/><br/>So I didn&#8217;t have to do anything. I was just collect the checks every month. Yeah, it was just fantastic. And at that point I was like, okay, I have to ramp it up and get more properties because this real estate thing is ridiculous, you know? I&#8217;m going to be a multimillonaire in no time.<br/><br/>So as I was spending money, money was still flowing in, you know, we&#8217;re growing real fast. And my wife always makes fun of me because I had a personal shopper at Nordstrom. And so she would call me every time they had a new arrival and it put them clothes out for me.<br/><br/>I was really living it up, but I don&#8217;t regret it because I really had a great time. <br/><br/>And then in 2008, it all came to a screeching halt when the recession hit. I still remember September 2008, when the Lehman brothers went belly up then everything just stopped in my industry because this is a discretionary spending that really is not necessary for companies, no marketing dollars to spend on their clients.<br/><br/>So when the going gets tough, that&#8217;s the first thing they cut. <br/><br/><strong>Mad Fientist:</strong> Yeah. <br/><br/><strong>Patrick:</strong> So I don&#8217;t know if you remember in &#8217;08, they were laying off thousands of people, and my biggest accounts were like AIG and all these other companies that were spending stupid money on these corporate junkets and so everybody now from September until December, they all wanted their money back or canceling events and then not spending anything on corporate events.<br/><br/>So we didn&#8217;t sell anything in three months. We actually just reimbursing people. And at that point I knew, okay, this is not going well. And in December of &#8217;08, I I made a decision to basically close shop.<br/><br/><strong>Mad Fientist:</strong> Wow. So at that point, you&#8217;re used to this lavish lifestyle, I guess you have some fixed expenses that are going to be not changing no matter what&#8217;s happening in the market. So you still got that $1,100 a month Benz payment, and then you got your condo that you own in San Diego that you live in, but then you got the four rental properties in Phoenix.<br/><br/>So all those bills are still coming due. Did did you maintain your tenants throughout that time? <br/><br/><strong>Patrick:</strong> No, not at all. So all the tenants started not paying and so we&#8217;re doing eviction and it was tough to try and get somebody out to get somebody in and were trashing the places. So my monthly expenses at the time were probably like about $12,000-$15,000 on my personal expenses. Company expenses, I was probably spending like $70,000 a month just to break even. So that&#8217;s when I was like, there&#8217;s no way I can continue because the money&#8217;s not flowing anymore.<br/><br/>And I still am paying that $70,000. To pay my team and as well as all the other fixed expenses that I had to pay. So I made a decision to basically close shop and I had to file for bankruptcy. So I really hit rock bottom at that time.<br/><br/><strong>Mad Fientist:</strong> Obviously that must&#8217;ve been a really trying time personally. Where do you go from that? Especially when you know, the economy wasn&#8217;t really picking back up very quickly at that stage.<br/><br/><strong>Patrick:</strong> It was really, really rough because I had no plan B, so this was my plan A, B, C, D all of them been combined in one, and then now I just lost it. And the reason why I had to file for bankruptcy was because. I had a bunch of loans that I had personally guaranteed.<br/><br/>And, there was no way I could have survived it. So I let my properties go in Arizona. And filing for bankruptcy is it&#8217;s, I&#8217;m not saying it&#8217;s a great thing, but it gives you a fresh start. <br/><br/><strong>Mad Fientist:</strong> Right. <br/><br/><strong>Patrick:</strong> Did you know that when you file for bankruptcy, they expunge all your debt, but they don&#8217;t expunge your student loans. So those you pay, they don&#8217;t expunge those, but if you have money invested in the 401k or any other retirement accounts, they do not touch that.<br/><br/><strong>Mad Fientist:</strong> Oh, wow. I had no idea. <br/><br/><strong>Patrick:</strong> Yes. So let&#8217;s say instead of buying homes in Arizona, I had a SEP IRA or invested in a 401k and I had a few hundred thousand dollars in that, in that account, they would not have touched it. <br/><br/><strong>Mad Fientist:</strong> Wow. <br/><br/><strong>Patrick:</strong> I&#8217;m not saying it&#8217;s a good thing, you know, because you had a bunch of debt that you don&#8217;t have to pay any more, but at the same time, you know, like if you were invested in the retirement account, you at least have a starting point.<br/><br/>You&#8217;re not from zero. <br/><br/><strong>Mad Fientist:</strong> Right. <br/><br/><strong>Patrick:</strong> So when I hit rock bottom in &#8217;09 and filed for bankruptcy. When you file for bankruptcy, you have to take a little online class, because they don&#8217;t want you to come back. Cause a lot of people either you get it or you don&#8217;t get it, you know?<br/><br/>And then you&#8217;re going to be back 10 years later, as far as filing for bankruptcy. But that hit me really hard because I was like, wow, you know, like, this is ridiculous. I mean, you can&#8217;t go any lower than I am right now because I lost everything. And so that class really hit me hard.<br/><br/>And that&#8217;s when I started doing some research on personal finance and then I found Dave Ramsey first and you know how he also had a bunch of real estate and went bankrupt also. And then he always preaches cash is king. I mean, I couldn&#8217;t finance a pen anywhere at that point.<br/><br/>You know, my credit score was, I think it was like 450 in &#8217;09 and so I was using just cash for everything. And so I was like, okay, I gotta figure out my life and I started listening to him and then doing some research a few years later, then I found the Mad Fientist.<br/><br/>And, and when I find the Mad Fientist podcast that really, really opened up my life and gave me a new lifeline. Because you had Mr. Money Mustache. <br/><br/><strong>Mad Fientist:</strong> Yeah, first guest. <br/><br/><strong>Patrick:</strong> Yes. First guest. So I listened to what he said, and I was like, wow, that&#8217;s possible? I had no idea. This was possible.<br/><br/>And then you had JL Collins and you had JD Roth. And so all of these other FI influencers. So I started just basically just listened to your shows all the time. And then I started investing in the stock market again, because everybody was talking about index fund investing.<br/><br/>And so I started putting some money aside, investing in the stock market. And then I also knew that I had to lower my expenses because everybody was, was was talking about that on your show as well. You know, you have to us to find a way to lower your expenses. So that&#8217;s what I did. Also I forgot to tell you, I&#8217;ll also start a new company, but in the same industry, but at a smaller scale instead set of having a whole team.<br/><br/>Now, it was just me. And I was outsourcing the event planning. I was outsourcing everything else. So it was just me on the phone and just creating a smaller company in the same industry, which I knew. And this time around, I was like, okay, I have to make sure that I get something out of this industry because the first time around, I got a lot of fun, but I got nothing to show for it after.<br/><br/>So this time round, okay, I have to really now learn how to save. I learn how to invest. So any money that I make now is going towards my savings.<br/><br/><strong>Mad Fientist:</strong> Right. And, so talk a little bit about decreasing your expenses. Cause I think in your video you maybe had mentioned that you decreased them by 50% over that period. Was it painful, was there things that you really missed that you&#8217;ve since added back to your life?<br/><br/>Just talk about taking such a drastic expense cut. <br/><br/><strong>Patrick:</strong> At that time I was paying about about $7,000 a month in all my expenses. And I knew I could do better. And so the first thing that we did was we sold our house and so my wife had a nice condo that we lived in and we sold it and by selling and then started renting, we basically shaved off a thousand dollars from the mortgage to renting.<br/><br/>And then we continued by finding ways to shave off expense that we didn&#8217;t really need. And so I went to 6,000, 5,000, 4,000. And and then in 2013, we did something really crazy, Mad Fientist, we had about $250,000 saved up at that point. And and we&#8217;re like, okay what are we going to do with this?<br/><br/>And it was in index funds and brokerage accounts. So we decided to take down a whole chunk, which was a hundred percent of our liquid assets. When I think about it, I cringe because we took all that money and bought a condo in Cabo San Lucas, Mexico.<br/><br/><strong>Mad Fientist:</strong> Oh, wow. <br/><br/><strong>Patrick:</strong> And the thinking behind the whole thing was okay well, if you buy a condo in Mexico, then we can really lower expenses because living in Mexico is basically 50% off of living in San Diego. So if we can go to Mexico, then we can really shave off even more money.<br/><br/>And the fact that my company, I could make calls from anywhere. I don&#8217;t have to be in the US. And so the idea behind buying a property in Mexico was okay, let&#8217;s rent it out now. And I didn&#8217;t even know Airbnb existed in 2013. I knew VRBO, I didn&#8217;t know Airbnb. I think they were still at the infancy stage or they were not as big as VRBO for renting your house.<br/><br/>So we&#8217;re thinking we&#8217;re going to rent it out and then use it as well. And then a few years later, I think we had a five-year plan of actually moving to Mexico and really shaving off, going from like $7,000 to probably go into that $2,000. And when you buy a place in Mexico, I don&#8217;t know if you&#8217;re familiar with buying a property in Mexico, you cannot get a loan from Mexico, so you have to buy cash. So a lot of Americans who buy homes in Mexico, they have to either use cash or take a an equity loan out of their home and then use that to buy the place in Mexico. So it was really, really risky because Mexico, you know, when you go to Mexico for a weekend, you having a good time.<br/><br/>But it&#8217;s not a first world country. So you don&#8217;t really know when you buy a place in Mexico, if the place is actually yours, because there&#8217;s this thing called, which is a trust. So they don&#8217;t want to allow Americans to actually own a property in Mexico. So you have to put it in a trust that you open with a Mexican bank, and then that trust is renewable, every year. It costs like $400 a year. So the title of the house is in that trust, which is under my name and I can gift it to somebody. I can sell that property.<br/><br/>I can do whatever I want, it&#8217;s my property, but it has to be in the trust. So a lot of different rules that happen where you don&#8217;t really know. So what happened is the bank goes belly up, then what happened? You start to think about all these things, <br/><br/><strong>Mad Fientist:</strong> Yeah. <br/><br/><strong>Patrick:</strong> But we were like, you know what, let&#8217;s just give it a try and see.<br/><br/>So we really put all of our chips in that one basket. And then with Airbnb, the place exploded as far as renting.<br/><br/>And so we were netting probably about $2,000 a month in rental income, after all expenses.<br/><br/>And the following year in 2014, we bought another place in Playa Del Carmen on the east coast, the Caribbean side of Mexico. And the reason why it was we&#8217;re trying to hedge kind of saying, okay, instead of buying another place in Cabo, how about we bought another place in a whole different area of Mexico?<br/><br/>So if Cabo goes bust, at least we have another place so we can kind of hedge. And so we bought that one and then it went also unbelievable as far as renting our Airbnb. So now we&#8217;re netting over $3,000 a month on just those two properties. In my head I was like, okay, so we net netting $3,000.<br/><br/>So all I need to do now is get below $3000 in expenses and then I&#8217;m free. <br/><br/><strong>Mad Fientist:</strong> Yeah. <br/><br/><strong>Patrick:</strong> So we kept moving every year. It seemed like we were moving just to shave off money from our rental. And our family members were making fun of us because we wouldn&#8217;t hire a moving company because I was so cheap at that point.<br/><br/>So I did a lot of moving of a big furniture. And every time we moved, we shaved off $500. That&#8217;s why we moved. And so in 2017 we had accumulated enough or we&#8217;re making enough money and had lowered our expenses to a level where we actually hit FI and you know how I found out I hit FI? I went on the MadFientist Lab and then I was like, I don&#8217;t know what kind of a mumbo-jumbo algorithm you use here, but let me try this. I put all the numbers. Okay. This is just, my expenses is how much I have invested and then click results. And then the Mad Fientist told me, well, you have hit FI, my friend.<br/><br/><strong>Mad Fientist:</strong> Oh, that&#8217;s great. <br/><br/><strong>Patrick:</strong> And at that time, my monthly expenses were about $2,800. <br/><br/><strong>Mad Fientist:</strong> Wow. <br/><br/><strong>Patrick:</strong> So I had lowered my monthly expenses to $2,800. And this is kind of crazy when you think about it too, because I live in San Diego.<br/><br/><strong>Mad Fientist:</strong> Right. Yeah, exactly. <br/><br/><strong>Patrick:</strong> San Diego is not a cheap place to live.<br/><br/>So that&#8217;s when I knew in 2017 that I had hit FI. And then in 2019 that&#8217;s when another huge milestone of mine, I hit that millionaire mark.<br/><br/>Yes. So it was crazy though for, you know, a kid from Africa, who grew up with nothing. Because when you&#8217;re in Africa, when you dream about being a millionaire&#8230; being a millionaire in Russian rubles, means nothing. <br/><br/><strong>Mad Fientist:</strong> Yeah. <br/><br/><strong>Patrick:</strong> Or Cuban pesos, or even you know, Rwandan Francs that, okay.<br/><br/>You have a million Rawandan Francs, but being a millionaire in the US is a big deal. <br/><br/><strong>Mad Fientist:</strong> Oh, yeah, definitely. <br/><br/><strong>Patrick:</strong> And especially because in &#8217;09 I had nothing. It is my best accomplishment ever because especially where I came from, you know, and also my spending habits, pre recession.<br/><br/><strong>Mad Fientist:</strong> Yeah, so obviously, I guess during this time you&#8217;re building up the smaller business that you had started in 2009. Is that right? Is that what produced the income besides the rental properties? <br/><br/><strong>Patrick:</strong> Yes, so every money I was making, I was basically saving it and I became a saving machine at that point. Because in sales, you always think about you always trying to measure yourself with the next sales guy.<br/><br/>Because I remember when I started, you know, I was like, okay, I made a hundred grand. How much did you make? So it&#8217;s kind of a competition amongst sales people. But after &#8217;09, I didn&#8217;t really care how much I made. The biggest thing that was important for me is how much I saved.<br/><br/>So I don&#8217;t care I made 200 grand. If I don&#8217;t save anything, it means nothing. But if I save a hundred grand, then that&#8217;s a huge accomplishment because not many people can do that. <br/><br/>And it became an obsession of mine, basically, trying to find a way to save as much as I could and invested. And at that point I believed in the index investing, I believed in real estate. So my portfolio is half and half right now. Where it&#8217;s half real estate, half index fund.<br/><br/><strong>Mad Fientist:</strong> So I&#8217;ve had the pleasure of meeting your lovely wife. When in the story, did she come into the picture and was she on board with this crazy FIRE idea slash cutting expenses to 50% of what they were before?<br/><br/><strong>Patrick:</strong> My wife is my ride or die because I met her in 2007. So she got to experience the spending Patrick. I always tell her I got you because of my Mercedes. But she she&#8217;s frugal by nature. So she, she wasn&#8217;t really wowed by all the flash and the bling.<br/><br/>And so when everything hit rock bottom, she was actually my rock because it was still early in our dating life. And if I was her, the way everything was hemorrhaging around me, I would have cut my losses and be like, okay guy&#8217;s not worth it. You&#8217;re supposed to marry up not married down, right? <br/><br/>So she stood by me and she was all in. Like every time we come up with our crazy ideas she&#8217;s always all in and always gave some great advice and when we took that big risk of buying our place in Cabo, she was the driving force.<br/><br/><strong>Mad Fientist:</strong> I wanted to quickly go back and ask you about that transition from spending as much as you were pre-2008 to then spending what you spend now or in 2017 when you hit FI. And it&#8217;s sort of a selfish question because I&#8217;ve always been naturally frugal and now that I don&#8217;t need to be as frugal, I&#8217;m trying to see what kind of spending actually moves the needle for happiness. Is there anything you miss that you cut out or was there anything that you&#8217;ve added back into your life after drastically cutting your expenses or anything interesting that you learned in those two sort of mindsets?<br/><br/><strong>Patrick:</strong> You have to change that mindset. And that was the biggest thing for me in &#8217;09 was to change my mindset, I became a saver instead of a spender. And to do that though, you have to have a why, and if you don&#8217;t have a why it&#8217;s going to be tough.<br/><br/>So me, I spend money on experience.<br/><br/>I love traveling. So my wife and I, we&#8217;re trying to take at least two months a year going places. So what we do, we just go eight days at a time, eight days to Hawaii and then come back home.<br/><br/>And then the next month we take eight days, go to Jamaica and then come back home. And we usually do that for about two months every year. And that&#8217;s where we spend our money just to go have those memories of going to these festivals and concerts and things like that. <br/><br/>And so it&#8217;s personal again though. So I don&#8217;t knock anyone for doing what they doing. You know, if you have the money and can buy yourself a new car, go ahead and do it because you have to enjoy life, but enjoying life for me is not buying material stuff anymore.<br/><br/>So that&#8217;s why personal finance is personal. <br/><br/>A lot of my friends, they&#8217;ll always ask me how come you always on vacation? That&#8217;s why I started my YouTube channel, because I was like, maybe I should share how I did it. You know, my journey. <br/><br/><strong>Mad Fientist:</strong> That&#8217;s awesome. And so speaking of your YouTube channel, where can people find you if they want to learn more about you, your story, or get in touch? Where can people go?<br/><br/><strong>Patrick:</strong> So I&#8217;m active on Twitter. And my Twitter handle is @frugalsafari. <br/><br/>I have frugalsafari.com as well, where I started blogging after I met you in 2016. But then I realized I&#8217;m not a big writer, so there&#8217;s a few articles there, but maybe I should go back and write a few more, but also have a YouTube channel now called the Aime to Invest, cause my name is Patrick Aime.<br/><br/><strong>Mad Fientist:</strong> A I M E <br/><br/><strong>Patrick:</strong> Yes. So my YouTube channel is called Aime to Invest. <br/><br/><strong>Mad Fientist:</strong> Nice. Okay, I&#8217;ll link to a link to Twitter, I&#8217;ll link to the website, and I&#8217;ll definitely link to the YouTube channel as well. And you&#8217;ve heard this show before, so, you know, I always end every interview with what&#8217;s one piece of advice you&#8217;d give to somebody on the path to financial independence?<br/><br/><strong>Patrick:</strong> The biggest piece of advice I would give is know your expenses. Because a lot of people, I feel like the majority of Americans and everybody in the world, they don&#8217;t know how much they spend on things. So if you ask them how much you spend on your expenses every month, they don&#8217;t know. And if you don&#8217;t know how much you spend, then you&#8217;re going to have a hard time controlling your finances, because it&#8217;s controlling you at that point.<br/><br/>You have to know how much you spend every month, because once you know that, then you can have a game plan on how to achieve financial independence. So know your expenses. Itemize your expenses on a spreadsheet so you know how bad or how good it is so you can have control of your finances.<br/><br/><strong>Mad Fientist:</strong> Couldn&#8217;t agree more, Patrick, thank you so much for joining me. And everyone out there go give Patrick some love on YouTube because I accidentally woke him up early on a Sunday. He had to set an alarm for the first time in years because I&#8217;m in Scotland, so that&#8217;s usually eight hours difference.<br/><br/>But it was even worse because the clocks changed last night in America and they didn&#8217;t change year. So we only figured that out today. So he had to wake up super early on a Sunday. So Patrick, thank you for doing that. This has been fantastic. Really enjoyed chatting with you and yeah, you&#8217;re welcome back anytime. <br/><br/><strong>Patrick:</strong> Mad Fientist, this is definitely a bucket list moment for me. We went from taking that selfie together in 2016 to now being on your show and the fact that I hit financial independence was because of you, because you showed me the way with all your interviews. So thank you so much. And this is definitely a memory that I will not forget.<br/><br/><strong>Mad Fientist:</strong> Oh, that&#8217;s great to hear, Patrick. And I&#8217;ll use that picture of us as the main picture for this episode. <br/><br/><strong>Patrick:</strong> And that&#8217;s what started the whole journey for me, basically San Diego meeting the Mad Fientist. And now I&#8217;m on the Mad Fientist show. <br/><br/>It doesn&#8217;t get any better.<br/><br/>This is basically what you call Hollywood ending, man, Hollywood ending.<br/><br/><strong>Mad Fientist:</strong> Well, it&#8217;s awesome, man. Thank you so much. I enjoyed it and I know the audience will too. So I really appreciate you taking the time and waking up early on a Sunday morning and hopefully I&#8217;ll see you somewhere in the world. <br/><br/><strong>Patrick:</strong> Let&#8217;s do it and say hi to your lovely wife from me. <br/><br/><strong>Mad Fientist:</strong> You do the same. Alright. Thanks buddy. Bye.\n</div>\n<h2>Related Post</h2><div><a href='https://www.madfientist.com/jd-roth-interview/' target='_blank'><div class='post_card'><div class='post_card_text'><h3 style='color:#399da8;'>JD Roth - Get Rich Slowly</h3><p class='post_card_excerpt'>J.D. Roth, creator of GetRichSlowly.org, joined me for the Financial Independence Podcast to talk about finding personal and financial freedom!</p></div><div class='post_card_image'><img src='https://www.madfientist.com/wp-content/uploads/2014/04/jd-roth-interview.jpg' style='border-radius:7px;'/></div></div></a></div><p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/aime-to-invest-interview/\">Aime to Invest &#8211; From Bankruptcy to FI in 8 Years</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "wfw:commentRss": "https://www.madfientist.com/aime-to-invest-interview/feed/",
  "slash:comments": 6,
  "enclosure": ""
}