{
  "title": "Episode 122: DSM-V and On Being Sane - Are Psychiatric Labels Really Harmful?",
  "pubDate": "Thu, 22 Apr 2010 19:31:05 +0000",
  "guid": "episode-122-dsmv-and-on-being-sane-are-psychia",
  "link": "http://www.thepsychfiles.com/2010/04/episode-122-dsm-v-and-on-being-sane-are-psychiatric-labels-really-harmful/",
  "itunes:image": "",
  "description": "<p>What does the movie Shrek have to do with labeling, psychiatric illness and the self-fulfilling prophecy? In this episode I take a close look at the well-known Rosenhan study.  This was the study in which pseudopatients pretend to hear voices and on the basis of this they get admitted to psychiatric centers.  Then they were told to act normally.  It took an average of 19 days for these pseudopatients to be discharged from the hospital and even then they were diagnosed as schizophrenia in remission. </p>\n\n<p>Does this study show that psychiatric diagnoses are not only useless but also possibly harmful? Or do we find what we found back in episode 47 on Little Albert, and what we found in episode 36 on Kitty Genovese that what we thought we knew is largely wrong.</p>",
  "content:encoded": "<p>What does the movie Shrek have to do with labeling, psychiatric illness and the self-fulfilling prophecy? In this episode I take a close look at the well-known Rosenhan study.  This was the study in which pseudopatients pretend to hear voices and on the basis of this they get admitted to psychiatric centers.  Then they were told to act normally.  It took an average of 19 days for these pseudopatients to be discharged from the hospital and even then they were diagnosed as schizophrenia in remission. </p>\n\n<p>Does this study show that psychiatric diagnoses are not only useless but also possibly harmful? Or do we find what we found back in episode 47 on Little Albert, and what we found in episode 36 on Kitty Genovese that what we thought we knew is largely wrong.</p>",
  "enclosure": "",
  "itunes:duration": "32:53",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology,illness,lecture,prophecy,disorders,psychiatric,DSM,rosenhan,revision,dsm5,selffullfilling",
  "itunes:subtitle": "What does the movie Shrek have to do with labeling, psychiatric illness and the self-fulfilling prophecy? I take a close look at the well-known Rosenhan study  in which pseudopatients pretend to hear voices and get admitted to psychiatric centers.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "What does the movie Shrek have to do with labeling, psychiatric illness and the self-fulfilling prophecy? In this episode I take a close look at the well-known Rosenhan study. This was the study in which pseudopatients pretend to hear voices and on the basis of this they get admitted to psychiatric centers. Then they were told to act normally. It took an average of 19 days for these pseudopatients to be discharged from the hospital and even then they were diagnosed as schizophrenia in remission. Does this study show that psychiatric diagnoses are not only useless but also possibly harmful? Or do we find what we found back in episode 47 on Little Albert, and what we found in episode 36 on Kitty Genovese that what we thought we knew is largely wrong."
}