{
  "id": "yt:video:wC0eRXL4tLU",
  "yt:videoId": "wC0eRXL4tLU",
  "yt:channelId": "UCUk0AvSMU5CJ0wUqJf9TX8g",
  "title": "Drowning In Debt with Josh Mitchell",
  "link": "",
  "author": {
    "name": "Coleman Hughes",
    "uri": "https://www.youtube.com/channel/UCUk0AvSMU5CJ0wUqJf9TX8g"
  },
  "published": "2022-10-21T20:00:20+00:00",
  "updated": "2022-10-25T19:04:59+00:00",
  "media:group": {
    "media:title": "Drowning In Debt with Josh Mitchell",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "My guest today is Josh Mitchell. Josh is a Wall Street Journal reporter who covers debt and finance. His book is called “The Debt Trap: How Student Loans Became a National Catastrophe” and it was named one of the best books of 2021 by both NPR and The New York Post.\n\nIn this episode, Josh and I talk about the history of government involvement in student loans. We discuss the reasons why college tuition has been soaring since the 1980s. We talk about the value of a four-year college degree. We talk about the similarities between the housing crisis of the 2000s and the current student loan crisis. We also go on to talk about President Biden's student loan forgiveness program, and much more.\n\nCheck out Josh's New Book -\nThe Debt Trap: How Student Loans Became a National Catastrophe - https://amzn.to/3evE5B1\n\n#ColemanUnfiltered\nColeman Unfiltered addresses topics that have been on mute through the ages with silent shifts into polarities, by relentless questioning and observations in coordination with some of the brightest intellectuals of our generation.\nThe Unfiltered Community is an ode to the fans; an environment promoting sound tolerance of ideas to solidify the meaning of liberalism in a changing world.\nIt’s a concrete effort to have open, honest conversations on the most difficult social and political issues we’re surrounded with.\nFor in-depth discussions, unaired/unseen episodes, and bonus content on Conversations With Coleman, participate via a membership and gain access to raw, powerful human ideology. \nWelcome to the new age’s most original intellectual revolution; let’s change the world, one conversation at a time.\nSign up Today  - https://bit.ly/3B1GAlS\n\n#QUALIA\nPresenting ‘The Life Of The Mind’, the latest podcast by renowned cognitive psychologist Steven Pinker.\nThis new podcast discusses an array of fascinating topics about the most powerful tool we own, the human mind.\n‘The Life Of The Mind’ takes us on a psychological journey, unearthing truths about our own complex minds while shaping our understanding of how the mind perceives what we see and feel when we try to understand the world around us.\nIt’s now available on YouTube and your favorite podcast platform.\nCheck it out now - https://bit.ly/3TBO6MI\n\n\nFOLLOW COLEMAN \n\nYouTube - http://bit.ly/38kzium \nTwitter - http://bit.ly/2rbAJue \nFacebook - http://bit.ly/2LiAXH3 \nInstagram - http://bit.ly/2SDGo6o \nPodcast -https://bit.ly/3oQvNUL \nWebsite - https://colemanhughes.org/ \nLimited Edition Merch - https://bit.ly/CWCMerch",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}