{
  "id": "tag:blogger.com,1999:blog-6959495683334200101.post-7050269050545094893",
  "published": "2019-04-30T12:12:00.000-07:00",
  "updated": "2019-05-20T12:10:27.056-07:00",
  "title": "Addressing creator feedback and an update on my 2019 priorities",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\">Dear Creators and Artists,<br /><br />It’s hard to believe it’s only April given all that we’ve already witnessed this year. We’ve seen new creative peaks reached by our global creator community, showing even further that you are the heart of YouTube. But we’ve also faced incredible challenges. And given the scale and impact of YouTube, there’s nothing more important than managing our role as a platform responsibly.<br /><br /><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/76WOBUhuFL8\" width=\"560\"></iframe><br /><br /><br /><br /><h3>1. Living up to our responsibility</h3><br />My top priority is responsibility. We’re always balancing maintaining an open platform with managing our community guidelines. But to combat a number of concerning incidents we’ve seen in the last few months, we’ve had to take more aggressive action. <br /><br />In February, we <a href=\"https://youtube-creators.googleblog.com/2019/02/more-updates-on-our-actions-related-to.html\" target=\"_blank\">announced</a> the suspension of comments on most YouTube videos that feature minors. We did this to protect children from predatory comments (with the exception of a small number of channels that have the manpower needed to actively moderate their comments and take additional steps to protect children). We know how vital comments are to creators. I hear from creators every day how meaningful comments are for engaging with fans, getting feedback, and helping guide future videos. I also know this change impacted so many creators who we know are innocent—from professional creators to young people or their parents who are posting videos. But in the end, that was a trade-off we made because we feel protecting children on our platform should be the most important guiding principle.<br /><br />The following month, we took unprecedented action in the wake of the Christchurch tragedy. Our teams immediately sprung into action to remove the violative content. To counter the enormous volume of uploaded videos showing violent imagery, we chose to temporarily break some of our processes and features. That meant a number of videos that didn’t actually violate community guidelines, including a small set of news and commentary, were swept up and kept off the platform (until appealed by its owners and reinstated). But given the stakes, it was another trade-off that we felt was necessary.  And with the devastating Sri Lankan attacks, our teams worked around the clock to make sure we removed violative content. In both cases, our systems triggered authoritative news and limited the spread of any hate and misinformation. <br /><br />These issues have also been top-of-mind for policy-makers, press, brands, and advertisers, whom I met with on recent trips to Washington and Asia. I updated them all on the steps we’ve taken around responsibility and also praised the extraordinary talents and importance of our creator economy. You’ve helped drive a remarkable transformation in the media landscape—where we’ve gone from a handful of broadcast networks to millions of channels that connect deeply with each and every person. Your videos not only touch lives, but have created new jobs and the next generation of media companies. <br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-QYGiZb-mTng/XMiW3YZNcrI/AAAAAAAACLs/kCDT1QGLSDgf_Gx-NVXrclQHm6nEa0sUQCLcBGAs/s1600/Wei_Frame6_Neighborhood.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"950\" data-original-width=\"1600\" height=\"380\" src=\"https://2.bp.blogspot.com/-QYGiZb-mTng/XMiW3YZNcrI/AAAAAAAACLs/kCDT1QGLSDgf_Gx-NVXrclQHm6nEa0sUQCLcBGAs/s640/Wei_Frame6_Neighborhood.jpg\" width=\"640\" /></a></div><br /><h3>2. Support creator and artist success</h3><br />Everywhere I go I try to meet with creators. Recently, I sat down with a number of creators in Japan and India and did videos with <a href=\"https://www.youtube.com/koreagrandma\" target=\"_blank\">Korea Grandma</a> in Seoul and Prajakta Koli, or <a href=\"https://www.youtube.com/channel/UCvCyIiKSCA1fHKSCOKJyjXA\" target=\"_blank\">MostlySane</a>, in Mumbai. Back at home, I shared drinks and some honest conversation with <a href=\"https://www.youtube.com/user/shane\" target=\"_blank\">Shane Dawson</a>, <a href=\"https://www.youtube.com/channel/UCucot-Zp428OwkyRm2I7v2Q\" target=\"_blank\">James Charles</a>, <a href=\"https://www.youtube.com/user/CollinsKey\" target=\"_blank\">Collins</a> and <a href=\"https://www.youtube.com/user/devan11art\" target=\"_blank\">Devan Key</a>, <a href=\"https://www.youtube.com/user/h2h2productions\" target=\"_blank\">Ethan and Hila Klein</a>, and <a href=\"https://www.youtube.com/channel/UCbAwSkqJ1W_Eg7wr3cp5BUA\" target=\"_blank\">Safiya Nygaard</a>. It was inspiring to see how all these creators have invested so deeply in YouTube. <br /><br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-F14JWhFKyfQ/XMiXhp4toaI/AAAAAAAACL4/IZh72BtXoIc78UICfzkDFPsENPQn4H6rQCLcBGAs/s1600/Wei_Frame8_creator_sitdown.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"950\" data-original-width=\"1600\" height=\"380\" src=\"https://4.bp.blogspot.com/-F14JWhFKyfQ/XMiXhp4toaI/AAAAAAAACL4/IZh72BtXoIc78UICfzkDFPsENPQn4H6rQCLcBGAs/s640/Wei_Frame8_creator_sitdown.jpg\" width=\"640\" /></a></div><br />The feedback I heard from these discussions was especially important. A top issue was wanting more clarity around community guidelines and advertiser friendly policies so there’s more predictability on monetization and our recommendation system. They’re also looking for better representation of creators on trending. They’re frustrated with copyright claims that are less than 10 seconds or incidental. And they say the online harassment from fellow creators is growing and needs to be addressed.  <br /><br />I’d like to address these issues one by one. First, we <a href=\"https://www.youtube.com/watch?v=IhfYlNUL9pE\" target=\"_blank\">plan</a> to add more detail to our policies so that creators can make the best decisions on their content. Our Self Certification pilot is a great example of why this is so crucial. With this program, creators can self report how their video complies with ad policies and build up trust that our systems adjust to. This helps creators gain a better understanding of our guidelines and delivers clearer results for them and for advertisers. We’ve rolled out this pilot to over one thousand channels and I’m hopeful we will find a way to make it available to more monetizing channels. And on monetization, we’ll continue to focus on increasing the accuracy of the classifiers representing the advertising friendly guidelines, something we know is important for all creators. Since January, we’ve already improved the precision of the classifier by 25%.<br /><br />On the trending tab, we’ve heard it doesn’t seem to reflect what people are watching on the platform and that too many of the same creators show up time and time again. One thing to keep in mind is that trending is meant to show content that a wide range of viewers would find interesting. We are especially careful about the safety of what appears here, so we have filters to make sure we don’t show videos that contain mature content (i.e. language, imagery, etc.), violence, or are otherwise inappropriate, such as disparaging others in the community. Eligible videos are then ranked based on a calculation of their “temperature”—how quickly that video is generating views. But we want to better showcase our creators. Going forward, our goal is to have at least half the videos on trending come from YouTubers (with the remainder coming from music and traditional media), something we’re close to already but will expand on. We also plan to make sure this is a diverse set of creators. And we’ll continue to ramp up our Creator on the Rise and Gaming Creator on the Rise initiatives. <br /><br />We also heard firsthand that our Manual Claiming system was increasingly being used to claim very short (in some cases one second) content or incidental content like when a creator walks past a store playing a few seconds of music. We were already looking into this issue but hearing this directly from creators was vital. We are exploring improvements in striking the right balance between copyright owners and creators.<br /><br />Finally, I take it very seriously when creators share stories of experiencing harassment on the platform. While criticism from fellow creators can be constructive, any threats or doxing crosses the line. Such behavior is already prohibited by our policies. But stay tuned as we will do more to discourage this from happening on the platform.<br /><br />To help more creators find their audience, we’ve been ramping up our NextUp creator camps, with recent editions in Jakarta and London. And we’re seeing exciting momentum for YouTube around the world, not just for creators but also artists.<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-nFOjgvs5iqY/XMiZ1nBBT4I/AAAAAAAACME/OyKWExc0joYCLZPWzl0x9Ntjr7YVYm_EwCLcBGAs/s1600/Wei_Frame15_Creators_highfive.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"950\" data-original-width=\"1600\" height=\"380\" src=\"https://4.bp.blogspot.com/-nFOjgvs5iqY/XMiZ1nBBT4I/AAAAAAAACME/OyKWExc0joYCLZPWzl0x9Ntjr7YVYm_EwCLcBGAs/s640/Wei_Frame15_Creators_highfive.jpg\" width=\"640\" /></a></div><br />With the launch of YouTube Music in India, Japan, and Argentina, we’ve witnessed musical artists big and small reach new audiences internationally, and the free, ad-supported streaming app is now available in 43 countries, with more to come.<br /><br />But we are also still very concerned about Article 13 (now renamed Article 17) — a part of the Copyright directive that recently passed in the E.U. While we support the rights of copyright holders—YouTube has deals with almost all the music companies and TV broadcasters today—we are concerned about the vague, untested requirements of the new directive. It could create serious limitations for what YouTube creators can upload. This risks lowering the revenue to traditional media and music companies from YouTube and potentially devastating the many European creators who have built their businesses on YouTube. <br /><br />While the Directive has passed, there is still time to affect the final implementation to avoid some of the worst unintended consequences. Each E.U. member state now has two years to introduce national laws that are in line with the new rules, which means that the powerful collective voice of creators can still make a major impact.<br /><br />We must continue to stand up and speak out for open creativity.  Your actions have already led to the most popular <a href=\"https://www.change.org/p/european-parliament-stop-the-censorship-machinery-save-the-internet\" target=\"_blank\">Change.org petition</a> in history and encouraged people to reach across borders. This is not the end of our movement but only the beginning.<br /><br /><h3>3. Improving communication and engagement</h3><br />Personally, and as a company, we are committed to listening to your feedback and concerns. Just like last year, we’ll be making a big push to meet creators where they want to communicate— through social, video, and one-on-one sessions. I plan on sitting down with more creators in 2019, focusing on the issues that are most important to you. Let me know who you’d like to see me meet with - I’m open to suggestions!<br /><br />Hopefully, most of you have tried out YouTube Studio Beta, which we’ve built to give creators even more updates and news. It offers a Known Issues bulletin on the dashboard that lists outages, bugs, or issues going on with YouTube, and a new Analytics experience with long-requested metrics like impressions, thumbnail click-through rates, and unique viewers. We've also recently improved our support of InfoCards and EndScreens in the new Studio, as well as Comparisons in Analytics. Your feedback has been crucial to these improvements, and more real-time data is coming soon.<br /><br />Since so many creators have told us that the community guidelines strike system felt inconsistent and confusing, we <a href=\"https://youtube-creators.googleblog.com/2019/02/making-our-strikes-system-clear-and.html\" target=\"_blank\">updated</a> our policies to a simpler and more transparent system. Every creator now gets a one-time warning that allows them to learn about our policies before they face penalties on their channel. Each strike, no matter if it comes from the videos, thumbnails, or links, gets the same penalty. On top of adding new mobile and in-product notifications about a strike, our email and desktop notifications will provide more details on which policy was violated. <br /><br />Like all of you, YouTube is continually adapting to keep up with a fast-changing world. But the one thing that won’t change is the fact that our past, present, and future success starts with our creators. Many of you have been with us since our early days, and have built YouTube into the vibrant community it is today.  And that’s why we’re focused on supporting your growing businesses, both through improving responsibility on the platform and by creating more opportunities for you to engage and build audiences.<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-eYjh5Fe72n4/XMiaXDjeGSI/AAAAAAAACMM/WBulmpddq3UJnkKUKSBYs9tkRXyvkoOLQCLcBGAs/s1600/Wei_Frame16_thankyou.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"950\" data-original-width=\"1600\" height=\"380\" src=\"https://3.bp.blogspot.com/-eYjh5Fe72n4/XMiaXDjeGSI/AAAAAAAACMM/WBulmpddq3UJnkKUKSBYs9tkRXyvkoOLQCLcBGAs/s640/Wei_Frame16_thankyou.jpg\" width=\"640\" /></a></div><br />Being a creator can be rewarding, exhilarating, challenging, and exhausting all at once. But the hard work is worth it. You’re at the cutting edge of culture.Your stories are helping the world to connect and learn. Please continue to share your voice and your feedback with us—it helps us make our platform stronger.<br /><br />Susan Wojcicki<br /><br /><br /><br /><br /><br /><br /></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube Creators",
    "uri": "http://www.blogger.com/profile/00450486760991148551",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}