{
  "title": "Digital Resurrection Brings Star Trek Back to the Future",
  "link": "https://spectrum.ieee.org/digital-recreation-star-trek",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/5-scenes-from-star-trek-episodes.png?id=31639724&width=1245&height=700&coordinates=0%2C0%2C0%2C1\"/><br/><br/><p>The bridge of the original <em>U.S.S. Enterprise</em> could soon be a place you can visit—complete with some of the original cast. </p><p>Visual effects that include virtual “performances” by deceased actors, or that drastically de-age those still alive, are becoming commonplace. <em>Rogue One: A Star Wars Story</em> famously used such effects <a href=\"https://www.nytimes.com/2016/12/27/movies/how-rogue-one-brought-back-grand-moff-tarkin.html\" rel=\"noopener noreferrer\" target=\"_blank\">to replicate the late Peter Cushing’s performance as Grand Moff Tarkin</a>. Now, the Roddenberry Archive is using similar effects to give audiences a like-new performance of Leonard Nimoy as Spock—if only inside the virtual world of a video game. </p><p>“The kid inside me had always dreamed of being Spock,” says actor Lawrence Selleck, who performs as Spock in the Roddenberry Archive’s restoration. “And now, suddenly, here I am with the Roddenberry Foundation putting on the best set of ears you can possibly imagine.”</p><hr/><h2>Digitally restoring a 57-year-old pilot</h2><p>The Roddenberry Archive is a collaboration between the Gene Roddenberry Estate and <a href=\"https://home.otoy.com/\" rel=\"noopener noreferrer\" target=\"_blank\">OTOY</a>, a cloud graphics company that builds specialized rendering software. </p><p><a href=\"https://home.otoy.com/roddenberryarchive/\" rel=\"noopener noreferrer\" target=\"_blank\">Announced in 2021</a>, the Roddenberry Archive is showing its first complete project: a re-creation of sets, props, and actors from <em>Star Trek</em>’s 1965 original pilot episode, “The Cage.” The pilot, shot two years prior to the series’ television debut, was unsuccessful, forcing the creation of a second pilot, “Where No Man Has Gone Before.” The experience debuted at Creation Entertainment’s Star Trek convention “The 56-Year Mission: Las Vegas,” which ran from 25 to 28 of August 2022.</p><p>The experience is not a restoration of the episode but rather a re-creation of the episode’s set and props inside an interactive 3D experience. “What [the Roddenberry Archive] had on display were a couple of stations with a flat-screen TV and a game controller, and it allowed you to walk through and see everything,” says Selleck. This version of the experience is built in Unreal Engine and runs locally on a PC. Trek fans at the Las Vegas convention, game controller in hand, could explore “The Cage,” including key sets like the bridge and engineering. </p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt='A television on a table displaying \"The Cage\" digital experience. Another table has a mannequin with Star Trek shirt.' class=\"rm-shortcode\" data-rm-shortcode-id=\"b9d9038a972e0f85036853f29e10cac4\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"4d29a\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-television-on-a-table-displaying-the-cage-digital-experience-another-table-has-a-mannequin-with-star-trek-shirt.png?id=31639617&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The current iteration of “The Cage” is navigated with a game controller.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">OTOY/The Roddenberry Archive</small></p><p>While the iteration of “The Cage” shown at “The 56-Year Mission: Las Vegas” was confined to a television, OTOY’s founder and CEO, Jules Urbach, aspires to bring the experience to more immersive technologies, including holographic displays. “Being able to walk through the sets of the Enterprise is better than using an Xbox controller or using WASD on a Web page,” says Urbach.<br/></p><p>OTOY is working with <a href=\"https://www.lightfieldlab.com\" target=\"_blank\">Light Field Labs,</a> creator of Solid Light holographic displays, to achieve immersion without a headset or glasses. The goal is holographic reproductions of Star Trek sets where fans can tour a life-size Enterprise accurate to the original sets and interact with classic characters. </p><p>“The dream, I think, is to basically build a Holodeck,” says Selleck. </p><h2>Can digital resurrection be used with respect?</h2><p>OTOY’s teasers include the digital re-creation of Leonard Nimoy’s Spock, portrayed by Lawrence Selleck, as well as Laurel Goodwin’s Yeoman L.M. Colt, portrayed by Mahé Thaissa. Both Nimoy and Goodwin are now deceased—Nimoy in 2015 and Goodwin earlier this year. </p><p>The teaser is brief, but convincing, and raises questions like those that followed the re-creation of Peter Cushing’s Grand Moff Tarkin for <em>Rogue One</em>. Disney’s decision to digitally resurrect Cushing was criticized in 2016 by numerous publications including <em><a href=\"https://www.theguardian.com/commentisfree/2016/dec/21/peter-cushing-rogue-one-resurrection-cgi\" rel=\"noopener noreferrer\" target=\"_blank\">The Guardian</a>, </em><a href=\"https://time.com/4604996/rogue-one-grand-moff-tarkin-princess-leia-cgi/\" rel=\"noopener noreferrer\" target=\"_blank\"><em>TIME</em></a>, and <a href=\"https://variety.com/2016/film/news/rogue-one-peter-cushing-digital-resurrection-cgi-1201943759/\" rel=\"noopener noreferrer\" target=\"_blank\"><em>Variety</em></a>. While technically impressive, watching an actor perform two decades after his death didn’t sit well with some viewers.</p><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"afbbe5d301fedbdb1dde16b5dbde3d0a\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/fzeznWVQu5o?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">765874 - Memory Wall (4K)</small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">\n<a href=\"https://www.youtube.com/watch?v=fzeznWVQu5o\" target=\"_blank\">www.youtube.com</a>\n</small>\n</p><p>Selleck is aware of these concerns. “It’s silly to say it’s a holy endeavor, but for <em>Star Trek</em> fans, it really kind of is. You don’t take this lightly.” He can imagine ways the technology could be used to be funny, or trashy, or otherwise run counter to the spirit of the original performance. To Selleck, it’s important to steer clear of that territory. “Not even in between takes, not even goofing around. It’s not appropriate,” he says.</p><p>And there’s another aspect that sets Selleck’s performance, and the Roddenberry Archive’s efforts, apart from application of similar techniques in blockbuster movies: the focus on preservation, not the mass market. “In order to stay in the noncommercial realm, we’re not putting this out there for people to download,” says Urbach. “Ideally, we’d like to do something at the Smithsonian.” </p><p>Digital re-creations of actors are used extensively in Hollywood films to resurrect, de-age, or modify the appearance of actor, but the results are typically part of new commercial films. It’s unclear if past criticisms apply to use of digital effects for preservation of historical performances.</p><p>“From my own perspective? I would love to stand on the bridge next to, nearby, these heroic figures,” says Selleck. </p><p><br/></p><p><strong><em>Update 7 Oct. 2022: </em></strong><em>A previous version of this article, although lacking the present version’s interview with OTOY CEO Jules Urbach, was published online on 13 Sept. </em><br/></p>",
  "pubDate": "Fri, 07 Oct 2022 14:00:00 +0000",
  "guid": "https://spectrum.ieee.org/digital-recreation-star-trek",
  "category": [
    "Special effects",
    "Deepfakes",
    "Digital restoration",
    "Star trek"
  ],
  "dc:creator": "Matthew S. Smith",
  "media:content": ""
}