{
  "id": "yt:video:CbzLFgW_Wgc",
  "yt:videoId": "CbzLFgW_Wgc",
  "yt:channelId": "UCX6b17PVsYBQ0ip5gyeme-Q",
  "title": "Toni Morrison: Crash Course Black American History #48",
  "link": "",
  "author": {
    "name": "CrashCourse",
    "uri": "https://www.youtube.com/channel/UCX6b17PVsYBQ0ip5gyeme-Q"
  },
  "published": "2022-10-05T23:44:43+00:00",
  "updated": "2022-10-29T01:11:56+00:00",
  "media:group": {
    "media:title": "Toni Morrison: Crash Course Black American History #48",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Today, Clint Smith will teach you about the legendary writer Toni Morrison. Morrison is best known for her novels which chronicle the experiences of Black Americans throughout history. She was the first Black American Woman to win a Nobel Prize for Literature.\n\nClint's book, How the Word is Passed is available now! https://bookshop.org/books/how-the-word-is-passed-a-reckoning-with-the-history-of-slavery-across-america/9780316492935 \n\nWant to learn more about Toni Morrison's work? Check out these videos from Crash Course Literature:\nSlavery, Ghosts, and Beloved: Crash Course Literature 214: https://www.youtube.com/watch?v=6lQyPgaakY4\nSula: Crash Course Literature 309: https://www.youtube.com/watch?v=eAHYT5gIPZg\n\nVIDEO SOURCES\nMichelle Alexander, The New Jim Crow: Mass Incarceration in the Age of Colorblindness (New York: New Press, 2010).\nNellie Y. McKay, ed. Critical Essays on Toni Morrison (Boston: G.K. Hall & Co., 1988).\nPhilip Page, Dangerous Freedom: Fusion and Fragmentation in Toni Morrison’s Novels (Jackson: University Press of Mississippi, 1995).\nToni Morrison: The Pieces I Am. Directed by Timothy Greenfield-Sanders. June 21, 2019.\nhttps://www.archives.gov/news/articles/toni-morrison-death-2019\nWatch our videos and review your learning with the Crash Course App! \nDownload here for Apple Devices: https://apple.co/3d4eyZo\nDownload here for Android Devices: https://bit.ly/2SrDulJ\n\nCrash Course is on Patreon! You can support us directly by signing up at http://www.patreon.com/crashcourse\n\nThanks to the following patrons for their generous monthly contributions that help keep Crash Course free for everyone forever:\nKatie, Hilary Sturges, Austin Zielman, Tori Thomas, Justin Snyder, DL Singfield, Amelia Ryczek, Ken Davidian, Stephen Akuffo, Toni Miles, Steve Segreto, Kyle & Katherine Callahan, Laurel Stevens, Stacey Gillespie (Stacey J), Burt Humburg, Allyson Martin, Aziz Y, DAVID MORTON HUDSON, Perry Joyce, Scott Harrison, Mark & Susan Billian, Alan Bridgeman, Rachel Creager, Breanna Bosso, Matt Curls, Jonathan Zbikowski, Jennifer Killen, Sarah & Nathan Catchings, team dorsey, Trevin Beattie, Eric Koslow, Jennifer Dineen, Indika Siriwardena, Jason Rostoker, Shawn Arnold, Siobhán, Ken Penttinen, Nathan Taylor, Les Aker, William McGraw, ClareG, Rizwan Kassim, Constance Urist, Alex Hackman, Jirat, pineapples of solidarity, Katie Dean, Wai Jack Sin, Ian Dundore, Justin, Mark, Caleb Weeks\n__\n\nWant to find Crash Course elsewhere on the internet?\nFacebook - http://www.facebook.com/YouTubeCrashCourse\nTwitter - http://www.twitter.com/TheCrashCourse\nInstagram - https://www.instagram.com/thecrashcourse/\n\nCC Kids: http://www.youtube.com/crashcoursekids",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}