{
  "title": "ZBT #299.5: Burn Pits Are Killing Veterans",
  "description": "<p>Chaps is back and we have an awesome Friday episode!\n\n-Manscaped.com promo code \"Zero\" for 20% off and free shipping\n-Superchewer.com/ZBT for a free dog toy when you get a subscription box for your dog pal(s)\n\nROUND 1: ::Whispering:: Round one is sure to give you alllll the tingles as we low crawl into the world of Military ASMR, ooooohhhh, ahhhhh, oooohhhh. Kate has a game that’s sure to leave us all in goosebumps, oOOOOo\n\nROUND 2: Most military branches are new boot goofin’ but over at Edwards Airforce Base their new SCOOT goofin’ on electric scooters. Would you be seen in uniform rolling over to the PX on one? \n\nROUND 3: Jon Stewart used to make us laugh on The Daily Show & now he’s making us cheer as he stands up for veterans dealing with fallout from deployment burn pits. He’s calling out the DoD for some real hot garbage. \n\nROUND 4: Apparently the Russian military had a quick break from trolling us with their planes & vehicles & decided to get real into anatomy. Most recently they stormed a theater to stop a screening of the documentary… Vulva 3.0. For uh, research purposes I’m sure. \n\nROUND 5: When a Coast Guard crew got sidelined by Coronavirus, the mission was able to keep rolling along thanks to young cadets at the Academy who went on to have the summer of a lifetime on the high seas. Have we finally found a good case of ‘being voluntold’??</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/ZeroBlog30\">barstool.link/ZeroBlog30</a></p>",
  "guid": "2a271df1-2010-4122-9689-61ed96a0992b",
  "pubDate": "Fri, 18 Sep 2020 07:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/zero-blog-thirty",
  "itunes:explicit": "yes",
  "itunes:duration": "01:08:27",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}