{
  "title": "S1E45 - Ministry and Competition with Our Host, Laura Wilkinson, and Power Up Sports Ministry",
  "guid": "https://pinecast.com/guid/a76a2a02-cb9b-4d67-8b39-39e37e4f312a",
  "pubDate": "Tue, 25 May 2021 06:30:00 -0000",
  "itunes:duration": "00:30:35",
  "description": "<p>Today’s episode is a little different in that Laura is actually a guest on another podcast, and is interviewed by veteran broadcaster, Bill Houston and former LPGA Pro, Tracy Hanson, from the Power Up Sports Ministry, an outreach of Our Daily Bread Ministries. Listeners may remember Tracy as a guest on Episode 20 of Pursuit of Gold where she very vulnerably opened up about recognizing and overcoming abuse. As you will hear, this week’s episode is an extra special one for Laura as she shares so much that is close to her heart, but that she doesn’t always get a chance to discuss in other arenas.\n \nShe begins by briefly reviewing her personal and professional lives, and then delves deeply into her spiritual journey, including a moving account of the moment her life changed and she started fully trusting God with it. She also describes how she brings her faith into her competitions, the impact that the Tokyo Games postponement has had upon her and her training, her experience of returning to diving after neck surgery, and how she approaches sharing her faith with others. Laura concludes by offering her perspective on ministering to other athletes, as well as details regarding her wonderful family, and what she has learned about herself in her quest to return to the Olympics. Laura truly loves ‘just being able to be open and honest about Jesus and sports’, and that is precisely what she does today in this enlightening and thoroughly inspiring interview.</p>\n<p>Episode Highlights:\n </p>\n<ul>\n<li>A brief history of Laura’s personal and professional lives</li>\n<li>Laura’s spiritual journey and the moment her life began to change</li>\n<li>Trusting God with her life</li>\n<li>Taking her faith into her competitions</li>\n<li>The impact of the Olympic postponement on Laura</li>\n<li>Returning to diving after her neck surgery</li>\n<li>Sharing her faith with others</li>\n<li>Her perspective on ministering to other athletes</li>\n<li>Laura’s family</li>\n<li>What Laura has learned about herself</li>\n</ul>\n<p>Quotes: \n </p>\n<ul>\n<li>“I was told I was a waste of space… fortunately for me, it lit a fire.”</li>\n<li>“I had reached out and I kind of realized that I had taken the reins of my life and I'd made a mess of things, but I was reaching back out for God.”</li>\n<li>“I just remember thinking that God was saying, “Look, when you trust Me with your life, I have plans for you. I have a purpose for you.”</li>\n<li>“You are probably impacting people's lives all over the place and you don't always see the fruit of that. But you've got to know when you're trusting God and you're doing what He's asking you to do, like, waves will be made, seeds will be planted, you know, and the harvest will come.”</li>\n<li>“I was much better at staying in the moment because of Him, because I was focused on Him.”</li>\n<li>“God always gives you these challenges that you're like, ‘No, I don't want to go through this’, but he uses those to equip us in ways that we can't even fathom to help us for something bigger that’s coming ahead.”</li>\n<li>“You have to be able to meet people where they are and talk to them where they're at.”</li>\n<li>“I think for athletes just constantly, constantly reminding them that, like, you are not the sum total of your score or your place at the end of the competition. Like, you are far more valuable than that. And if you get injured and you can't go on tomorrow, you still have value and purpose and you were created for that purpose.”</li>\n<li>“I've gotten really good at juggling, and I have an amazing husband who is very supportive. Without him, I mean, honestly, none of this would have happened.”</li>\n<li>“The older I get, the more I realize I don't know.”</li>\n<li>“Having kids, they kind of make you really not eat your words, but live up to your words.”</li>\n<li>“I think athletes and sports ministry leaders alike can learn from what you're putting out there with the guests that you're having.”</li>\n</ul>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold homepage</a>\n<a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">5 Smart Strategies to Confidence</a>\n<a href=\"https://laurawilkinson.mykajabi.com/email-capture-0d05ebf5-739d-43b0-a4ab-5f4ea91a24e6\" rel=\"nofollow\">Conquer Your Fear in 5 Days</a>                \n \nLaura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura's Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura's Facebook page</a>\n<a href=\"https://www.laurawilkinson.com/podcast-episodes/recognizing-and-overcoming-abuse-with-pro-golfer-tracy-hanson\" rel=\"nofollow\">Tracy Hanson's Pursuit of Gold Episode</a>\n<a href=\"https://podcasts.apple.com/us/podcast/power-up-the-sports-ministry-podcast/id1533269787\" rel=\"nofollow\">Power Up Podcast</a>\n<a href=\"https://www.facebook.com/groups/powerupsports/\" rel=\"nofollow\">Power Up Facebook</a>\n<a href=\"https://www.youtube.com/channel/UCo84-tdih-z0PcqAh7lvbZQ/about\" rel=\"nofollow\">Power Up YouTube</a></p>",
  "itunes:title": "Ministry and Competition with Our Host, Laura Wilkinson, and Power Up Sports Ministry",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 45
}