{
  "title": "507: Bradley Bakes is Creating Every Food and Drink Item in the Harry Potter Books",
  "link": "https://audioboom.com/posts/7832988",
  "itunes:episode": 507,
  "itunes:title": "Bradley Bakes is Creating Every Food and Drink Item in the Harry Potter Books",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 2877,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>This week, we're joined by <a href=\"https://www.youtube.com/channel/UCrXXzz7_WuknZ1NUZRGB-1A\">Bradley Bakes</a>, a YouTuber in the United Kingdom who’s currently baking his way through the entire Harry Potter book series!</li>\n<li>Bradley shares why he started creating every food and drink item mentioned in the Harry Potter books</li>\n<li>64 recipes for Sorcerer's Stone, 54 recipes for Chamber of Secrets - what's next on the menu?</li>\n<li>Golden Snitch Lemon Meringue Pie... Whomping Willow Chocolate Cabbage Cake... Bradley puts a twist on some notable Potter items!</li>\n<li>Bradley shares a few simple recipes the listeners (and hosts) can try at home and the most challenging food for him to make</li>\n<li>How long does each recipe take from start to finish? What's it like to shop for all of these delicious items?</li>\n<li>Which item in the upcoming books is Bradley most looking forward to making?</li>\n<li>MuggleCast gets its very own recipe!</li>\n<li>Fans have no excuses for their next Harry Potter party! Be sure to check Bradley out on <a href=\"https://www.youtube.com/channel/UCrXXzz7_WuknZ1NUZRGB-1A\">YouTube</a>, <a href=\"https://www.instagram.com/bradbakes/?hl=en\">Instagram</a> and <a href=\"https://www.bradleybakes.co.uk/\">his blog</a>!</li>\n<li>Snog, Marry, Avada Kedavra returns!</li>\n<li>Can the hosts name the Top 50 Most Mentioned Characters in the Harry Potter series <em>without</em> naming those outside the Top 50? <a href=\"https://www.sporcle.com/games/Flick/hpminefun?t=harrypotter\">You give a try!</a>\n</li>\n<li>Quizzitch: The night Norbert is born, Hagrid makes the trio tea and offers them which food that they refuse? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like access to our recording studio, Bonus MuggleCast a personalized thank you video from one of the hosts and more!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 30 Mar 2021 11:00:00 +0000",
  "guid": "tag:audioboom.com,2021-03-29:/posts/7832988",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}