{
  "title": "Weekish notes",
  "link": "https://ianozsvald.com/2020/07/15/weekish-notes-2/",
  "dc:creator": "Ian",
  "pubDate": "Wed, 15 Jul 2020 19:20:59 +0000",
  "category": [
    "Data science",
    "Python",
    "Week notes"
  ],
  "guid": "https://ianozsvald.com/?p=3877",
  "description": "I&#8217;ve recently switched back from Sourdough yeast to dried packet yeast mix, given a recipe by a colleague (thanks Nick!). I immediately set to work modifying his recipe (well, cutting out steps if we&#8217;re honest). The first loaf looked fine but was bland &#8211; I cut out too much salt. The next was really very [&#8230;]",
  "content:encoded": "<p>I&#8217;ve recently switched back from Sourdough yeast to dried packet yeast mix, given a recipe by a colleague (thanks Nick!). I immediately set to work modifying his recipe (well, cutting out steps if we&#8217;re honest). The first loaf looked fine but was bland &#8211; I cut out too much salt. The next was really very good (&#8220;shop quality&#8221;). For the third I used off-boil water for my autolyse and I think the water was still too hot and killed some of the yeast later giving me <a href=\"https://twitter.com/ianozsvald/status/1283059008144904194\">this dense lump</a>. Later that evening after 2.5 hours I had a luke-warm water repeat loaf and <a href=\"https://twitter.com/ianozsvald/status/1283165887244140545\">it was brilliant</a>. I confirmed this with toast & jam this morning.</p>\n<p>I&#8217;ve got quite a log of notes for my two main recipes now and will have a Sourdough on the go again this weekend.</p>\n<p>Working with my &#8220;still secret&#8221; client in a safe haven locked down remote instance I lack most of my usual tools (part by design, part my ignorance during configuration). I&#8217;ve got Vi so I&#8217;m getting my hands dirty with the <a href=\"https://dev.to/iggredible/using-buffers-windows-and-tabs-efficiently-in-vim-56jc\">underlying operations</a> (hey! :bnext and :e work fine! Ctrl P does some sort of autocomplete! :ls lists my buffers!). This is a little painful and Apache Guacamole&#8217;s remote viewer can be troublesome (stripping £ symbols, giving me 3 different keyboard configs depending on when I login, forgetting some of my windows!) but on the whole the setup is working well.</p>\n<p>I&#8217;ve also had to get down and dirty with Git &#8211; no GitK or other fun tools. I&#8217;ve discovered some nice light git configs like &#8220;<a href=\"https://ma.ttias.be/pretty-git-log-in-one-line/\">git logline</a>&#8221; which help with terminal based navigation in our small team.</p>\n<p><a href=\"https://ianozsvald.com/training/\">Training classes</a> are now listed for:</p>\n<ul>\n<li><a href=\"https://www.eventbrite.co.uk/e/software-engineering-for-data-scientists-3-morning-virtual-event-tickets-111465787170\">Software Engineering for Data Scientists</a> (September) &#8211; write strong, tested, reliable and defensible code from Notebooks to modules to improve collaboration and resilience</li>\n<li><a href=\"https://www.eventbrite.co.uk/e/higher-performance-python-tickets-112262839174\">Higher Performance Python</a> (October) &#8211; profile CPU & memory usage, speed up your code, compile where useful and improve your Pandas & Dask to enable faster iteration and faster processing on your projects with minimal effort on your part</li>\n<li><a href=\"https://www.eventbrite.co.uk/e/successful-data-science-projects-tickets-93928096465\">Successful Data Science Projects</a> (November) &#8211; discover new process & tools to design data science projects that&#8217;ll run successfully, improve collaboration between your team and the wider business (this is built out of 15 years of painful lessons so you don&#8217;t have to make the same mistakes!)</li>\n</ul>\n<hr>\nIan is a Chief Interim Data Scientist via his <a href=http://morconsulting.com>Mor Consulting</a>. Sign-up for <a href=http://eepurl.com/Z44HT>Data Science tutorials in London</a> and to hear about his <a href=https://ianozsvald.com/data-science-jobs/>data science thoughts and jobs</a>. He lives in London, is walked by his high energy Springer Spaniel and is a consumer of fine coffees."
}