{
  "title": "S15 Ep33: Portals To Hell and Supernatural News",
  "link": "https://audioboom.com/posts/8098490",
  "itunes:episode": 33,
  "itunes:title": "Portals To Hell and Supernatural News",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5158,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Darkness Radio enters Portals to Hell with special guests Jack Osbourne & Katrina Weidman!<br>\n<br>\nJack Osbourne and Katrina Weidman resume their chilling journey to historically haunted locations in the United States, confronting sinister stories of the supernatural as they seek concrete evidence that a spirit world exists.<br>\n<br>\nAll this PLUS Supernatural News and YOUR paranormal encounters on this weeks edition of Darkness Radio.<br>\n<br>\nDescend into all-new eerie encounters when Travel Channel’s hit series, \"Portals to Hell,\" returns for Season Two on Thursday April 30th.<br>\n<br>\nVisit our shop for exciting new items, clothes, books and more:   <a href=\"https://amazon.com\">https://amazon.com</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !<br>\n<br>\nBombas makes the most comfortable socks in the history of feet. Give a pair when you buy a pair, and get twenty percent off your first purchase at <a href=\"http://Bombas.com/\">Bombas.com/</a> darkness.<br>\n<br>\nDo you experience stress?  Or have anxiety…Or chronic pain ...Or have trouble sleeping at least once a week? You’re NOT alone! Feals is a better way to feel better. Our premium CBD will keep your head clear and help you feel your best. Become a member today by going to <a href=\"http://Feals.com/darkness\">Feals.com/darkness</a> and you'll get 50% off your first order with free shipping.",
  "itunes:summary": "Darkness Radio enters Portals to Hell with special guests Jack Osbourne & Katrina Weidman!\n\nJack Osbourne and Katrina Weidman resume their chilling journey to historically haunted locations in the United States, confronting sinister...",
  "pubDate": "Sat, 25 Apr 2020 08:00:00 +0000",
  "guid": "7ca062b6-0a9b-4f72-8571-dae9eedc1873",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}