{
  "title": "Episode 35: &#8220;Why Do Fools Fall In Love?&#8221; by Frankie Lymon and the Teenagers",
  "link": "https://500songs.com/podcast/episode-35-why-do-fools-fall-in-love-by-frankie-lymon-and-the-teenagers/",
  "pubDate": "Mon, 03 Jun 2019 01:21:33 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-35-why-do-fools-fall-in-love-by-frankie-lymon-and-the-teenagers/",
  "description": "Episode thirty-five of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Why Do Fools Fall in Love?\" by Frankie Lymon and the Teenagers, and at the terrible afterlife of child stardom. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/27340100\">on \"Space Guitar\" by Johnny \"Guitar\" Watson.</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-35-why-do-fools-fall-in-love/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThere are no books on the Teenagers, as far as I know, so as I so often do when talking about vocal groups I relied heavily on <a href=\"http://www.uncamarvy.com/Teenagers/teenagers.html\">Marv Goldberg's website</a>.\n\nSome information also comes from<a href=\"https://amzn.to/2VLllii\"><em> Big Beat Heat: Alan Freed and the Early Years of Rock & Roll</em></a> by John A. Jackson.\n\nSome background on George Goldner was from <a href=\"https://amzn.to/2SY9jkw\"><em>Hound Dog: The Leiber and Stoller Autobiography</em> by Jerry Leiber, Mike Stoller, and David Ritz.</a>\n\nAnd for more on Morris Levy, see <a href=\"https://amzn.to/2W9rXGJ\"><em>Me, the Mob, and the Music, </em>by Tommy James with Martin Fitzpatrick</a>.\n\n<a href=\"https://amzn.to/2IcQ5n1\">This compilation</a> contains every recording by Frankie Lymon and the Teenagers, together or separately, as well as recordings by Lewis Lymon and the Teenchords, a group led by Lymon's brother.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nThe story of Frankie Lymon and the Teenagers is, like so many of the stories we're dealing with in this series, a story of heartbreak and early death, a story of young people of colour having their work become massively successful and making no money off it because of wealthy businessmen stealing their work. But it's also a story of what happens when you get involved with the Mafia before you hit puberty, and your career peaks at thirteen.\n\nThe Teenagers only had one really big hit, but it was one of the biggest hits of the fifties, and it was a song that is almost universally known to this day. So today we're going to talk about \"Why Do Fools Fall in Love?\"\n\nThe Teenagers started when two black teenagers from New York, Jimmy Merchant and Sherman Garnes, left the vocal group they'd formed, which was named \"the Earth Angels\" after the Penguins song, and hooked up with two Latino neighbours, Joe Negroni and Herman Santiago. They named themselves the Ermines. Soon after, they were the support act for local vocal group the Cadillacs:\n\n[Excerpt, The Cadillacs, \"Speedoo\"]\n\nThey were impressed enough by the Cadillacs that in honour of them they changed their name, becoming the Coup de Villes, and after that the Premiers.\n\nThey used to practice in the hallway of the apartment block where Sherman Garnes lived, and eventually one of the neighbours got sick of hearing them sing the same songs over and over. The neighbour decided to bring out some love letters his girlfriend had written, some of which were in the form of poems, and say to the kids \"why don't you turn some of these into songs?\"\n\nAnd so they did just that -- they took one of the letters, containing the phrase \"why do birds sing so gay?\" and Santiago and Merchant worked out a ballad for Santiago to sing containing that phrase.\n\nSoon after this, the Premiers met up with a very young kid, Frankie Lymon, who sang and played percussion in a mambo group.\n\nI suppose I should pause here to talk briefly about the mambo craze. Rock and roll wasn't the only musical style that was making inroads in the pop markets in the fifties -- and an impartial observer, looking in 1953 or 1954, might easily have expected that the big musical trend that would shape the next few decades would be calypso music, which had become huge in the US for a brief period. But that wasn't the only music that was challenging rock and roll. There were a whole host of other musics, usually those from Pacific, Latin-American and/or Caribbean cultures, which tend to get lumped together as \"exotica\" now, and \"mambo\" was one of those.\n\nThis was a craze named after a song by the Cuban bandleader Perez Prado, \"Mambo Jambo\":\n\n[Excerpt: Perez Prado, \"Mambo Jambo\"]\n\nThat song was popular enough that soon everyone was jumping on the bandwagon -- for example, Bill Haley and the Comets with \"Mambo Rock\":\n\n[Excerpt: Bill Haley and the Comets, \"Mambo Rock\"]\n\nThe group that Frankie Lymon was performing with was one of those groups, but he was easily persuaded instead to join the Premiers. He was the young kid who hung around with them when they practiced, not the leader, and not even a major part of the group. Not yet, anyway.\n\nBut everything changed for the group when Richie Barrett heard them singing on a street corner near him.\n\nThese days, Barrett is best-known for his 1962 single \"Some Other Guy\", which was later covered by the Beatles, among others:\n\n[Excerpt: Richie Barrett, \"Some Other Guy\"]\n\nBut at the time he was the lead singer of a group called the Valentines:\n\n[Excerpt: The Valentines, \"Tonight Kathleen\"]\n\nHe was also working for George Goldner at Rama Records as a talent scout and producer, doing the same kind of things that Ike Turner had been doing for Chess and Modern, or that Jesse Stone did for Atlantic -- finding the acts, doing the arrangements, doing all the work involved in turning some teenage kid into someone who could become a star.\n\nGoldner was someone for whom most people in the music industry seem to have a certain amount of contempt -- he was, by most accounts, a fairly weak-willed figure who got himself into great amounts of debt with dodgy people. But one thing they're all agreed on is that he had a great ear for a hit, because as Jerry Leiber put it he had the taste of a fourteen-year-old girl.\n\nGeorge Goldner had actually got into R&B through the mambo craze. When Goldner had started in the music industry, it had been as the owner of a chain of nightclubs which featured Latin music. The clubs became popular enough that he also started Tico Records, a label that put out Latin records, most notably early recordings by Tito Puente.\n\n[Excerpt: Tito Puente: \"Vibe Mambo\"]\n\nWhen the mambo boom hit, a lot of black teenagers started attending Goldner's clubs, and he became interested in the other music they were listening to. He started first Rama Records, as a label for R&B singles, and then Gee records, named after the most successful record that had been put out on Rama, \"Gee\", by the Crows.\n\nHowever, Goldner had a business partner, and his name was Morris Levy, and Levy was *not* someone you wanted involved in your business in any way.\n\nIn this series we're going to talk about a lot of horrible people -- and in fact we've already covered more than a few of them -- yet Morris Levy was one of the worst people we're going to look at. While most of the people we've discussed are either terrible people in their personal life (if they were a musician) or a minor con artist who ripped off musicians and kept the money for themselves, Morris Levy was a terrible human being *and* a con artist, someone who used his Mafia connections to ensure that the artists he ripped off would never even think of suing him, because they valued their lives too much. We'll be looking at at least one rock and roll star, in the 1960s, who died in mysterious circumstances after getting involved with Levy.\n\nLevy had been the founder of Birdland, the world-famous jazz club, in the 1940s, but when ASCAP came to him asking for the money they were meant to get for their songwriters from live performances, Levy had immediately seen the possibilities in music publishing.\n\nLevy then formed a publishing company, Patricia Music, and a record label, Roulette, and started into the business of properly exploiting young black people, not just having them work in his clubs for a night, but having them create intellectual property he could continue exploiting for the rest of his life.\n\nIndeed, Levy was so keen to make money off dubious intellectual property that he actually formed a company with his friend Alan Freed which attempted to trademark the phrase \"rock and roll\", on the basis that this way any records that came out labelled as such would have to pay them for the privilege. Thankfully, the term caught on so rapidly that there was no way for them to enforce the trademark, and it became genericised.\n\nBut this is who Levy was, and how he made his money -- at least his more legitimate money. Where he got the rest from is a matter for the true crime podcasts.\n\nThere are several people who report death threats, or having to give up their careers, or suddenly move thousands of miles away from home, to avoid Levy's revenge on artists who didn't do exactly what he said. So when we're looking at a group of literal teenage kids -- and black teenagers at that, with the smallest amount of institutional privilege possible, you can be sure that he was not going to treat them with the respect that they were due.\n\nLevy owned fifty percent of Goldner's record companies, and would soon grow to own all of them, as Goldner accumulated more gambling debts and used his record labels to pay them off.\n\nBut at the start of their career, the group didn't yet have to worry about Levy. That would come later. For now, they were dealing with George Goldner.\n\nAnd Goldner was someone who was actually concerned with the music, and who had been producing hits consistently for the last few years. At the time the Premiers signed with him, for example, he had just produced \"You Baby You\" for the Cleftones.\n\n[Excerpt: The Cleftones, \"You Baby You\"]\n\nWhen Richie Barrett brought the Premiers to Goldner, he was intrigued because two of the members were Latino, and he was such a lover of Latin music. But he quickly latched on to the potential of Frankie Lymon as a star. Lymon was a captivating performer, and when you watch video footage of him now you can't help but think of Michael Jackson, who followed almost exactly the same early career trajectory a decade later. While the other band members were the normal kind of teenage kids who joined doo-wop groups, and were clearly a little reserved, Lymon just *went for it*, working the crowd like a young James Brown with absolutely no self-consciousness at all.\n\nHe also had a gorgeous falsetto voice, and knew how to use it. As we've heard, many of the doo-wop groups of the fifties weren't particularly proficient singers, but Lymon did have a real vocal talent. He was clearly a potential star.\n\nFrankie Lymon wasn't even originally meant to be the lead singer on \"Why Do Fools Fall in Love?\" -- that distinctive falsetto that makes the record so memorable was a late addition. The song was originally meant to be sung by Herman Santiago, and it was only in the studio that the song was rearranged to instead focus on the band's youngest -- and youngest-sounding -- member.\n\n[Excerpt: Frankie Lymon and the Teenagers, \"Why Do Fools Fall In Love?\"]\n\nWhen the record came out, it wasn't credited to the Premiers, but to \"The Teenagers, featuring Frankie Lymon\". Goldner hadn't liked the group's name, and decided to focus on their big selling point -- their youth, and in particular the youth of their new lead singer.\n\nMuch of the work to make the record sound that good was done not by the Teenagers or by Goldner, but by the session saxophone player Jimmy Wright, who ended up doing the arrangements on all of the Teenagers' records, and whose idea it was to start them with Sherman Garnes' bass intros.\n\nAgain, as with so many of these records, there was a white cover version that came out almost immediately -- this time by the Diamonds, a group of Canadians who copied the formula of their fellow countrymen the Crew Cuts and more or less cornered the market in white remakes of doo-wop hits.\n\n[Excerpt: The Diamonds, \"Why Do Fools Fall in Love?\"]\n\nBut in a sign of how the times were changing, the Diamonds' version of the song only went to number twelve, while the Teenagers' version went to number six, helped by a massive push from Morris Levy's good friend Alan Freed.\n\nPartly this may have been down to the fact that all the Diamonds were adults, and they simply couldn't compete with the novelty sound of a boy who sounded prepubescent, singing in falsetto.\n\nFalsetto had, of course, always been a part of the doo-wop vocal blend, but it had been a minor part up to this point. Lead vocals would generally be sung in a smooth high tenor, but would very rarely reach to the truly high notes. Lymon, by virtue of his voice not yet having broken, introduced a new timbre into rock and roll lead vocals, and he influenced almost every vocal group that followed. There might have been a Four Seasons or a Jan and Dean or a Beach Boys without Lymon, but I doubt it.\n\nThere was also a British cover version, by Alma Cogan, a middle-of-the-road singer known as \"the girl with the giggle in her voice\".\n\n[Excerpt: Alma Cogan, \"Why Do Fools Fall In Love?\"]\n\nThis sort of thing was common in Britain well into the sixties, as most US labels didn't have distribution in the UK, and so if British people wanted to hear American rock and roll songs, they would often get them in native cover versions. Cogan was a particular source of these, often recording songs that had been R&B hits.\n\nWe will see a lot more of this in future episodes, as we start to look more at the way rock and roll affected the UK.\n\nThe Teenagers followed the success of \"Why Do Fools Fall in Love?\" with \"I Want You to Be My Girl\":\n\n[Excerpt, Frankie Lymon and the Teenagers, \"I Want You to Be My Girl\"]\n\nThis one did almost as well, reaching a peak of number thirteen in the pop charts. But the singles after that did less well, although \"I'm Not A Juvenile Delinquent\" became a big hit in the UK.\n\nThe record label soon decided that Lymon needed to become a solo star, rather than being just the lead singer of the Teenagers. Quite why they made this decision was difficult to say, as one would not normally deliberately break up a hit act. But presumably the calculation was that they would then have two hit acts -- solo Frankie Lymon, and the Teenagers still recording together. It didn't work out like that.\n\nLymon inadvertently caused another crisis in the ongoing battle of rock and roll versus racism. Alan Freed had a new TV series, The Big Beat, which was a toned-down version of Freed's radio show. By this point, real rock and roll was already in a temporary decline as the major labels fought back, and so Freed's show was generally filled with the kind of pre-packaged major label act, usually named Bobby, that we'll be talking about when we get to the later fifties. For all that Freed had a reputation as a supporter of black music, what he really was was someone with the skill to see a bandwagon and jump on it.\n\nBut still, some of the black performers were still popular, and so Freed had Lymon on his showr. But his show was aimed at a white audience, and so the studio audience was white, and dancing. And Frankie Lymon started to dance as well. A black boy, dancing with a white girl.\n\nThis did not go down well at all with the Southern network affiliates, and within a couple of weeks Freed's show had been taken off the TV.\n\nAnd that appearance, the one that destroyed Freed's show, was almost certainly Lymon's very first ever solo performance. One might think that this did not augur well for his future career, and that assessment would be largely correct.\n\nNeither Lymon nor the Teenagers would ever have another hit after they split. The last few records credited to Frankie Lymon and the Teenagers were in fact Lymon solo recordings, performed with other backing singers. \"Goody Goody\" did manage to reach number twenty on the pop charts:\n\n[Excerpt: Frankie Lymon and the Teenagers, \"Goody Goody\"]\n\nEverything after that did worse. Lymon's first solo single, \"My Girl\", failed to chart:\n\n[Excerpt: Frankie Lymon, \"My Girl\"]\n\nHe continued making records for another couple of years, but nothing came of any of them, and when his voice broke he stopped sounding much like himself. The last recording he made that came even close to being a hit was a remake of Bobby Day's \"Little Bitty Pretty One\" from 1960.\n\n[Excerpt: Frankie Lymon, \"Little Bitty Pretty One\"]\n\nAnd the Teenagers didn't fare much better. They went through several new lead singers. There was Billy Lobrano, a white kid who according to Jimmy Merchant sounded more like Eddie Fisher than like Lymon:\n\n[Excerpt: The Teenagers, \"Mama Wanna Rock\"]\n\nThen there was Freddie Houston, who would go on to be the lead singer in one of the many Ink Spots lineups touring in the sixties, and then they started trying to focus on the other original group members, for example calling themselves \"Sherman and the Teenagers\" when performing the Leiber and Stoller song \"The Draw\":\n\n[Excerpt: Sherman and the Teenagers, \"The Draw\"]\n\nAs you can hear, none of these had the same sound as they'd had with Lymon, and they eventually hit on the idea of getting a woman into the group instead. They got in Sandra Doyle, who would later be Zola Taylor's replacement in the Platters, and struggled on until 1961, when they finally split up.\n\nLymon's life after leaving the Teenagers was one of nothing but tragedy. He married three times, every time bigamously, and his only child died two days after the birth. Lymon would apparently regularly steal from Zola Taylor, who became his second wife, to feed his heroin addiction.\n\nHe briefly reunited with the Teenagers in 1965, but they had little success. He spent a couple of years in the army, and appeared to have got himself clean, and even got a new record deal. But the night before he was meant to go back into the studio, he fell off the wagon, for what would be the last time.\n\nFrankie Lymon died, aged just twenty-five, and a has-been for almost half of his life, of a heroin overdose, in 1968.\n\nThe other Teenagers would reunite, with Lymon's brother joining them briefly, in the 70s. Sherman Garnes died in 1977, and Joe Negroni in 1978, but Santiago and Merchant continued, off and on, with a lineup of the Teenagers -- a version of the band continues to this day, still featuring Herman Santiago, and Merchant remained with the band until his retirement a few years ago.\n\nBut their first hit caused legal problems:\n\n[Excerpt: Frankie Lymon and the Teenagers, \"Why Do Fools Fall In Love?\"]\n\n\"Why Do Fools Fall In Love?\" was written by Herman Santiago, with the help of Jimmy Merchant. But neither Santiago or Merchant were credited on the song when it came out. The credited songwriters for the song are Frankie Lymon -- who did have some input into rewriting it in the studio -- and Morris Levy, who had never even heard the song until after it was a massive hit.\n\nGeorge Goldner was originally credited as Lymon's co-writer, and of course Goldner never wrote it either, but at least he was in the studio when it was recorded. But when Levy bought out Goldner's holdings in his companies, he also bought out his rights to songs he was credited for, so Levy became the legal co-writer of \"Why Do Fools Fall in Love?\"\n\nIn 1992 Santiago and Merchant finally won the credit for having written \"Why Do Fools Fall In Love?\", but in 1996 the ruling was overturned. They'd apparently waited too long to take legal action over having their song stolen, and so the rights reverted to Lymon and Morris Levy -- who had never even met the band when they wrote the song.\n\nBut, of course, Lymon wasn't alive to get the money. But his widow was. Or rather, his widows, plural, were. In the 1980s, three separate women claimed to be Lymon's widow and thus his legitimate heir. One was his first wife, who he had married in 1964 while she was still married to her first husband. One was Zola Taylor, who Lymon supposedly married bigamously a year after his first marriage, but who couldn't produce any evidence of this, and the third was either his second or third wife, who he married bigamously in 1967 while still married to his first, and possibly his second, wife. That third wife eventually won the various legal battles and is now in charge of the Frankie Lymon legacy.\n\n\"Why Do Fools Fall In Love?\" has gone on to be a standard, recorded by everyone from Joni Mitchell to the Beach Boys to Diana Ross. But Frankie Lymon and the Teenagers stand as a cautionary tale, an example that all too many people were still all too eager to follow.",
  "itunes:subtitle": "Episode thirty-five of A History of Rock Music in Five Hundred Songs looks at Why Do Fools Fall in Love? by Frankie Lymon and the Teenagers, and at the terrible afterlife of child stardom. Click the full post to read liner notes, links to more informatio",
  "itunes:keywords": "Alan Freed,doo wop,Frankie Lymon,George Goldner,lawsuits,Morris Levy,racism,Rama Records,Richie Barrett,Roulette Records,the Diamonds,The Platters,the Valentines,vocal groups,white cover versions",
  "itunes:episodeType": "full",
  "itunes:episode": 35,
  "content:encoded": "Episode thirty-five of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Why Do Fools Fall in Love?\" by Frankie Lymon and the Teenagers, and at the terrible afterlife of child stardom. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/27340100\">on \"Space Guitar\" by Johnny \"Guitar\" Watson.</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-35-why-do-fools-fall-in-love/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThere are no books on the Teenagers, as far as I know, so as I so often do when talking about vocal groups I relied heavily on <a href=\"http://www.uncamarvy.com/Teenagers/teenagers.html\">Marv Goldberg's website</a>.\n\nSome information also comes from<a href=\"https://amzn.to/2VLllii\"><em> Big Beat Heat: Alan Freed and the Early Years of Rock & Roll</em></a> by John A. Jackson.\n\nSome background on George Goldner was from <a href=\"https://amzn.to/2SY9jkw\"><em>Hound Dog: The Leiber and Stoller Autobiography</em> by Jerry Leiber, Mike Stoller, and David Ritz.</a>\n\nAnd for more on Morris Levy, see <a href=\"https://amzn.to/2W9rXGJ\"><em>Me, the Mob, and the Music, </em>by Tommy James with Martin Fitzpatrick</a>.\n\n<a href=\"https://amzn.to/2IcQ5n1\">This compilation</a> contains every recording by Frankie Lymon and the Teenagers, together or separately, as well as recordings by Lewis Lymon and the Teenchords, a group led by Lymon's brother.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nThe story of Frankie Lymon and the Teenagers is, like so many of the stories we're dealing with in this series, a story of heartbreak and early death, a story of young people of colour having their work become massively successful and making no money off it because of wealthy businessmen stealing their work. But it's also a story of what happens when you get involved with the Mafia before you hit puberty, and your career peaks at thirteen.\n\nThe Teenagers only had one really big hit, but it was one of the biggest hits of the fifties, and it was a song that is almost universally known to this day. So today we're going to talk about \"Why Do Fools Fall in Love?\"\n\nThe Teenagers started when two black teenagers from New York, Jimmy Merchant and Sherman Garnes, left the vocal group they'd formed, which was named \"the Earth Angels\" after the Penguins song, and hooked up with two Latino neighbours, Joe Negroni and Herman Santiago. They named themselves the Ermines. Soon after, they were the support act for local vocal group the Cadillacs:\n\n[Excerpt, The Cadillacs, \"Speedoo\"]\n\nThey were impressed enough by the Cadillacs that in honour of them they changed their name, becoming the Coup de Villes, and after that the Premiers.\n\nThey used to practice in the hallway of the apartment block where Sherman Garnes lived, and eventually one of the neighbours got sick of hearing them sing the same songs over and over. The neighbour decided to bring out some love letters his girlfriend had written, some of which were in the form of poems, and say to the kids \"why don't you turn some of these into songs?\"\n\nAnd so they did just that -- they took one of the letters, containing the phrase \"why do birds sing so gay?\" and Santiago and Merchant worked out a ballad for Santiago to sing containing that phrase.\n\nSoon after this, the Premiers met up with a very young kid, Frankie Lymon, who sang and played percussion in a mambo group.\n\nI suppose I should pause here to talk briefly about the mambo craze. Rock and roll wasn't the only musical style that was making inroads in the pop markets in the fifties -- and an impartial observer, looking in 1953 or 1954, might easily have expected that the big musical trend that would shape the next few decades would be calypso music, which had become huge in the US for a brief period. But that wasn't the only music that was challenging rock and roll. There were a whole host of other musics, usually those from Pacific, Latin-American and/or Caribbean cultures, which tend to get lumped together as \"exotica\" now, and \"mambo\" was one of those.\n\nThis was a craze named after a song by the Cuban bandleader Perez Prado, \"Mambo Jambo\":\n\n[Excerpt: Perez Prado, \"Mambo Jambo\"]\n\nThat song was popular enough that soon everyone was jumping on the bandwagon -- for example, Bill Haley and the Comets with \"Mambo Rock\":\n\n[Excerpt: Bill Haley and the Comets, \"Mambo Rock\"]\n\nThe group that Frankie Lymon was performing with was one of those groups, but he was easily persuaded instead to join the Premiers. He was the young kid who hung around with them when they practiced, not the leader, and not even a major part of the group. Not yet, anyway.\n\nBut everything changed for the group when Richie Barrett heard them singing on a street corner near him.\n\nThese days, Barrett is best-known for his 1962 single \"Some Other Guy\", which was later covered by the Beatles, among others:\n\n[Excerpt: Richie Barrett, \"Some Other Guy\"]\n\nBut at the time he was the lead singer of a group called the Valentines:\n\n[Excerpt: The Valentines, \"Tonight Kathleen\"]\n\nHe was also working for George Goldner at Rama Records as a talent scout and producer, doing the same kind of things that Ike Turner had been doing for Chess and Modern, or that Jesse Stone did for Atlantic -- finding the acts, doing the arrangements, doing all the work involved in turning some teenage kid into someone who could become a star.\n\nGoldner was someone for whom most people in the music industry seem to have a certain amount of contempt -- he was, by most accounts, a fairly weak-willed figure who got himself into great amounts of debt with dodgy people. But one thing they're all agreed on is that he had a great ear for a hit, because as Jerry Leiber put it he had the taste of a fourteen-year-old girl.\n\nGeorge Goldner had actually got into R&B through the mambo craze. When Goldner had started in the music industry, it had been as the owner of a chain of nightclubs which featured Latin music. The clubs became popular enough that he also started Tico Records, a label that put out Latin records, most notably early recordings by Tito Puente.\n\n[Excerpt: Tito Puente: \"Vibe Mambo\"]\n\nWhen the mambo boom hit, a lot of black teenagers started attending Goldner's clubs, and he became interested in the other music they were listening to. He started first Rama Records, as a label for R&B singles, and then Gee records, named after the most successful record that had been put out on Rama, \"Gee\", by the Crows.\n\nHowever, Goldner had a business partner, and his name was Morris Levy, and Levy was *not* someone you wanted involved in your business in any way.\n\nIn this series we're going to talk about a lot of horrible people -- and in fact we've already covered more than a few of them -- yet Morris Levy was one of the worst people we're going to look at. While most of the people we've discussed are either terrible people in their personal life (if they were a musician) or a minor con artist who ripped off musicians and kept the money for themselves, Morris Levy was a terrible human being *and* a con artist, someone who used his Mafia connections to ensure that the artists he ripped off would never even think of suing him, because they valued their lives too much. We'll be looking at at least one rock and roll star, in the 1960s, who died in mysterious circumstances after getting involved with Levy.\n\nLevy had been the founder of Birdland, the world-famous jazz club, in the 1940s, but when ASCAP came to him asking for the money they were meant to get for their songwriters from live performances, Levy had immediately seen the possibilities in music publishing.\n\nLevy then formed a publishing company, Patricia Music, and a record label, Roulette, and started into the business of properly exploiting young black people, not just having them work in his clubs for a night, but having them create intellectual property he could continue exploiting for the rest of his life.\n\nIndeed, Levy was so keen to make money off dubious intellectual property that he actually formed a company with his friend Alan Freed which attempted to trademark the phrase \"rock and roll\", on the basis that this way any records that came out labelled as such would have to pay them for the privilege. Thankfully, the term caught on so rapidly that there was no way for them to enforce the trademark, and it became genericised.\n\nBut this is who Levy was, and how he made his money -- at least his more legitimate money. Where he got the rest from is a matter for the true crime podcasts.\n\nThere are several people who report death threats, or having to give up their careers, or suddenly move thousands of miles away from home, to avoid Levy's revenge on artists who didn't do exactly what he said. So when we're looking at a group of literal teenage kids -- and black teenagers at that, with the smallest amount of institutional privilege possible, you can be sure that he was not going to treat them with the respect that they were due.\n\nLevy owned fifty percent of Goldner's record companies, and would soon grow to own all of them, as Goldner accumulated more gambling debts and used his record labels to pay them off.\n\nBut at the start of their career, the group didn't yet have to worry about Levy. That would come later. For now, they were dealing with George Goldner.\n\nAnd Goldner was someone who was actually concerned with the music, and who had been producing hits consistently for the last few years. At the time the Premiers signed with him, for example, he had just produced \"You Baby You\" for the Cleftones.\n\n[Excerpt: The Cleftones, \"You Baby You\"]\n\nWhen Richie Barrett brought the Premiers to Goldner, he was intrigued because two of the members were Latino, and he was such a lover of Latin music. But he quickly latched on to the potential of Frankie Lymon as a star. Lymon was a captivating performer, and when you watch video footage of him now you can't help but think of Michael Jackson, who followed almost exactly the same early career trajectory a decade later. While the other band members were the normal kind of teenage kids who joined doo-wop groups, and were clearly a little reserved, Lymon just *went for it*, working the crowd like a young James Brown with absolutely no self-consciousness at all.\n\nHe also had a gorgeous falsetto voice, and knew how to use it. As we've heard, many of the doo-wop groups of the fifties weren't particularly proficient singers, but Lymon did have a real vocal talent. He was clearly a potential star.\n\nFrankie Lymon wasn't even originally meant to be the lead singer on \"Why Do Fools Fall in Love?\" -- that distinctive falsetto that makes the record so memorable was a late addition. The song was originally meant to be sung by Herman Santiago, and it was only in the studio that the song was rearranged to instead focus on the band's youngest -- and youngest-sounding -- member.\n\n[Excerpt: Frankie Lymon and the Teenagers, \"Why Do Fools Fall In Love?\"]\n\nWhen the record came out, it wasn't credited to the Premiers, but to \"The Teenagers, featuring Frankie Lymon\". Goldner hadn't liked the group's name, and decided to focus on their big selling point -- their youth, and in particular the youth of their new lead singer.\n\nMuch of the work to make the record sound that good was done not by the Teenagers or by Goldner, but by the session saxophone player Jimmy Wright, who ended up doing the arrangements on all of the Teenagers' records, and whose idea it was to start them with Sherman Garnes' bass intros.\n\nAgain, as with so many of these records, there was a white cover version that came out almost immediately -- this time by the Diamonds, a group of Canadians who copied the formula of their fellow countrymen the Crew Cuts and more or less cornered the market in white remakes of doo-wop hits.\n\n[Excerpt: The Diamonds, \"Why Do Fools Fall in Love?\"]\n\nBut in a sign of how the times were changing, the Diamonds' version of the song only went to number twelve, while the Teenagers' version went to number six, helped by a massive push from Morris Levy's good friend Alan Freed.\n\nPartly this may have been down to the fact that all the Diamonds were adults, and they simply couldn't compete with the novelty sound of a boy who sounded prepubescent, singing in falsetto.\n\nFalsetto had, of course, always been a part of the doo-wop vocal blend, but it had been a minor part up to this point. Lead vocals would generally be sung in a smooth high tenor, but would very rarely reach to the truly high notes. Lymon, by virtue of his voice not yet having broken, introduced a new timbre into rock and roll lead vocals, and he influenced almost every vocal group that followed. There might have been a Four Seasons or a Jan and Dean or a Beach Boys without Lymon, but I doubt it.\n\nThere was also a British cover version, by Alma Cogan, a middle-of-the-road singer known as \"the girl with the giggle in her voice\".\n\n[Excerpt: Alma Cogan, \"Why Do Fools Fall In Love?\"]\n\nThis sort of thing was common in Britain well into the sixties, as most US labels didn't have distribution in the UK, and so if British people wanted to hear American rock and roll songs, they would often get them in native cover versions. Cogan was a particular source of these, often recording songs that had been R&B hits.\n\nWe will see a lot more of this in future episodes, as we start to look more at the way rock and roll affected the UK.\n\nThe Teenagers followed the success of \"Why Do Fools Fall in Love?\" with \"I Want You to Be My Girl\":\n\n[Excerpt, Frankie Lymon and the Teenagers, \"I Want You to Be My Girl\"]\n\nThis one did almost as well, reaching a peak of number thirteen in the pop charts. But the singles after that did less well, although \"I'm Not A Juvenile Delinquent\" became a big hit in the UK.\n\nThe record label soon decided that Lymon needed to become a solo star, rather than being just the lead singer of the Teenagers. Quite why they made this decision was difficult to say, as one would not normally deliberately break up a hit act. But presumably the calculation was that they would then have two hit acts -- solo Frankie Lymon, and the Teenagers still recording together. It didn't work out like that.\n\nLymon inadvertently caused another crisis in the ongoing battle of rock and roll versus racism. Alan Freed had a new TV series, The Big Beat, which was a toned-down version of Freed's radio show. By this point, real rock and roll was already in a temporary decline as the major labels fought back, and so Freed's show was generally filled with the kind of pre-packaged major label act, usually named Bobby, that we'll be talking about when we get to the later fifties. For all that Freed had a reputation as a supporter of black music, what he really was was someone with the skill to see a bandwagon and jump on it.\n\nBut still, some of the black performers were still popular, and so Freed had Lymon on his showr. But his show was aimed at a white audience, and so the studio audience was white, and dancing. And Frankie Lymon started to dance as well. A black boy, dancing with a white girl.\n\nThis did not go down well at all with the Southern network affiliates, and within a couple of weeks Freed's show had been taken off the TV.\n\nAnd that appearance, the one that destroyed Freed's show, was almost certainly Lymon's very first ever solo performance. One might think that this did not augur well for his future career, and that assessment would be largely correct.\n\nNeither Lymon nor the Teenagers would ever have another hit after they split. The last few records credited to Frankie Lymon and the Teenagers were in fact Lymon solo recordings, performed with other backing singers. \"Goody Goody\" did manage to reach number twenty on the pop charts:\n\n[Excerpt: Frankie Lymon and the Teenagers, \"Goody Goody\"]\n\nEverything after that did worse. Lymon's first solo single, \"My Girl\", failed to chart:\n\n[Excerpt: Frankie Lymon, \"My Girl\"]\n\nHe continued making records for another couple of years, but nothing came of any of them, and when his voice broke he stopped sounding much like himself. The last recording he made that came even close to being a hit was a remake of Bobby Day's \"Little Bitty Pretty One\" from 1960.\n\n[Excerpt: Frankie Lymon, \"Little Bitty Pretty One\"]\n\nAnd the Teenagers didn't fare much better. They went through several new lead singers. There was Billy Lobrano, a white kid who according to Jimmy Merchant sounded more like Eddie Fisher than like Lymon:\n\n[Excerpt: The Teenagers, \"Mama Wanna Rock\"]\n\nThen there was Freddie Houston, who would go on to be the lead singer in one of the many Ink Spots lineups touring in the sixties, and then they started trying to focus on the other original group members, for example calling themselves \"Sherman and the Teenagers\" when performing the Leiber and Stoller song \"The Draw\":\n\n[Excerpt: Sherman and the Teenagers, \"The Draw\"]\n\nAs you can hear, none of these had the same sound as they'd had with Lymon, and they eventually hit on the idea of getting a woman into the group instead. They got in Sandra Doyle, who would later be Zola Taylor's replacement in the Platters, and struggled on until 1961, when they finally split up.\n\nLymon's life after leaving the Teenagers was one of nothing but tragedy. He married three times, every time bigamously, and his only child died two days after the birth. Lymon would apparently regularly steal from Zola Taylor, who became his second wife, to feed his heroin addiction.\n\nHe briefly reunited with the Teenagers in 1965, but they had little success. He spent a couple of years in the army, and appeared to have got himself clean, and even got a new record deal. But the night before he was meant to go back into the studio, he fell off the wagon, for what would be the last time.\n\nFrankie Lymon died, aged just twenty-five, and a has-been for almost half of his life, of a heroin overdose, in 1968.\n\nThe other Teenagers would reunite, with Lymon's brother joining them briefly, in the 70s. Sherman Garnes died in 1977, and Joe Negroni in 1978, but Santiago and Merchant continued, off and on, with a lineup of the Teenagers -- a version of the band continues to this day, still featuring Herman Santiago, and Merchant remained with the band until his retirement a few years ago.\n\nBut their first hit caused legal problems:\n\n[Excerpt: Frankie Lymon and the Teenagers, \"Why Do Fools Fall In Love?\"]\n\n\"Why Do Fools Fall In Love?\" was written by Herman Santiago, with the help of Jimmy Merchant. But neither Santiago or Merchant were credited on the song when it came out. The credited songwriters for the song are Frankie Lymon -- who did have some input into rewriting it in the studio -- and Morris Levy, who had never even heard the song until after it was a massive hit.\n\nGeorge Goldner was originally credited as Lymon's co-writer, and of course Goldner never wrote it either, but at least he was in the studio when it was recorded. But when Levy bought out Goldner's holdings in his companies, he also bought out his rights to songs he was credited for, so Levy became the legal co-writer of \"Why Do Fools Fall in Love?\"\n\nIn 1992 Santiago and Merchant finally won the credit for having written \"Why Do Fools Fall In Love?\", but in 1996 the ruling was overturned. They'd apparently waited too long to take legal action over having their song stolen, and so the rights reverted to Lymon and Morris Levy -- who had never even met the band when they wrote the song.\n\nBut, of course, Lymon wasn't alive to get the money. But his widow was. Or rather, his widows, plural, were. In the 1980s, three separate women claimed to be Lymon's widow and thus his legitimate heir. One was his first wife, who he had married in 1964 while she was still married to her first husband. One was Zola Taylor, who Lymon supposedly married bigamously a year after his first marriage, but who couldn't produce any evidence of this, and the third was either his second or third wife, who he married bigamously in 1967 while still married to his first, and possibly his second, wife. That third wife eventually won the various legal battles and is now in charge of the Frankie Lymon legacy.\n\n\"Why Do Fools Fall In Love?\" has gone on to be a standard, recorded by everyone from Joni Mitchell to the Beach Boys to Diana Ross. But Frankie Lymon and the Teenagers stand as a cautionary tale, an example that all too many people were still all too eager to follow.",
  "enclosure": "",
  "itunes:summary": "Episode thirty-five of A History of Rock Music in Five Hundred Songs looks at \"Why Do Fools Fall in Love?\" by Frankie Lymon and the Teenagers, and at the terrible afterlife of child stardom. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Space Guitar\" by Johnny \"Guitar\" Watson.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThere are no books on the Teenagers, as far as I know, so as I so often do when talking about vocal groups I relied heavily on Marv Goldberg's website.\n\nSome information also comes from Big Beat Heat: Alan Freed and the Early Years of Rock & Roll by John A. Jackson.\n\nSome background on George Goldner was from Hound Dog: The Leiber and Stoller Autobiography by Jerry Leiber, Mike Stoller, and David Ritz.\n\nAnd for more on Morris Levy, see Me, the Mob, and the Music, by Tommy James with Martin Fitzpatrick.\n\nThis compilation contains every recording by Frankie Lymon and the Teenagers, together or separately, as well as recordings by Lewis Lymon and the Teenchords, a group led by Lymon's brother.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nThe story of Frankie Lymon and the Teenagers is, like so many of the stories we're dealing with in this series, a story of heartbreak and early death, a story of young people of colour having their work become massively successful and making no money off it because of wealthy businessmen stealing their work. But it's also a story of what happens when you get involved with the Mafia before you hit puberty, and your career peaks at thirteen.\n\nThe Teenagers only had one really big hit, but it was one of the biggest hits of the fifties, and it was a song that is almost universally known to this day. So today we're going to talk about \"Why Do Fools Fall in Love?\"\n\nThe Teenagers started when two black teenagers from New York, Jimmy Merchant and Sherman Garnes, left the vocal group they'd formed, which was named \"the Earth Angels\" after the Penguins song, and hooked up with two Latino neighbours, Joe Negroni and Herman Santiago. They named themselves the Ermines. Soon after, they were the support act for local vocal group the Cadillacs:\n\n[Excerpt, The Cadillacs, \"Speedoo\"]\n\nThey were impressed enough by the Cadillacs that in honour of them they changed their name, becoming the Coup de Villes, and after that the Premiers.\n\nThey used to practice in the hallway of the apartment block where Sherman Garnes lived, and eventually one of the neighbours got sick of hearing them sing the same songs over and over. The neighbour decided to bring out some love letters his girlfriend had written, some of which were in the form of poems, and say to the kids \"why don't you turn some of these into songs?\"\n\nAnd so they did just that -- they took one of the letters, containing the phrase \"why do birds sing so gay?\" and Santiago and Merchant worked out a ballad for Santiago to sing containing that phrase.\n\nSoon after this, the Premiers met up with a very young kid, Frankie Lymon, who sang and played percussion in a mambo group.\n\nI suppose I should pause here to talk briefly about the mambo craze. Rock and roll wasn't the only musical style that was making inroads in the pop markets in the fifties -- and an impartial observer, looking in 1953 or 1954, might easily have expected that the big musical trend that would shape the next few decades would be calypso music, which had become huge in the US for a brief period. But that wasn't the only music that was challenging rock and roll. There were a whole host of other musics, usually those from Pacific, Latin-American and/or Caribbean cultures, which tend to get lumped together as \"exotica\" now, and \"mambo\" was one of those.\n\nThis was a craze named after a song by the Cuban bandleader Pere",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode thirty-five of A History of Rock Music in Five Hundred Songs looks at \"Why Do Fools Fall in Love?\" by Frankie Lymon and the Teenagers, and at the terrible afterlife of child stardom. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Space Guitar\" by Johnny \"Guitar\" Watson.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThere are no books on the Teenagers, as far as I know, so as I so often do when talking about vocal groups I relied heavily on Marv Goldberg's website.\n\nSome information also comes from Big Beat Heat: Alan Freed and the Early Years of Rock & Roll by John A. Jackson.\n\nSome background on George Goldner was from Hound Dog: The Leiber and Stoller Autobiography by Jerry Leiber, Mike Stoller, and David Ritz.\n\nAnd for more on Morris Levy, see Me, the Mob, and the Music, by T",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}