{
  "title": "Chinese spacecraft releases mystery object in orbit – US",
  "link": "https://www.rt.com/news/565978-chinese-spaceplane-releases-object-ufo/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565978-chinese-spaceplane-releases-object-ufo/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63662fde203027387b2107a5.jpg\" /> A Chinese spaceplane has released an unknown object into orbit, according to the US Space Force <br/><a href=\"https://www.rt.com/news/565978-chinese-spaceplane-releases-object-ufo/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The UFO is believed to be part of a reusable transport system being developed by Beijing</strong></p>\n            \n                        \n            <p>A Chinese reusable rocket orbiting Earth has released another object into orbit, according to the US Space Force, which detected the unknown craft on Monday. According to the Orbital Focus website, the second object is probably traveling less than 200 meters from its parent.</p>\n<p>With little official information to go on, US experts believe the new object is related to a project funded by the Natural Science Foundation of China. Specifically, the paired craft may be involved in the development of an orbital segment on a fully reusable two-stage-to-orbit space transport system. The system&rsquo;s suborbital component performed a second flight in September.</p>\n<p>Space watchers have hypothesized that the object may be a small satellite designed to monitor the larger craft, a service module, or the result of a test to see if the larger craft could successfully deploy satellite payloads.&nbsp;</p>\n<p>The<em> &ldquo;reusable experimental spacecraft&rdquo;</em> was launched August 4 from Jiuquan in the Gobi Desert, propelled by one of China&rsquo;s Long March 2F rockets, and has been in orbit for three months. It is possible the object was released some time ago and only became visible when the spacecraft shifted its orbit slightly two weeks ago.</p>\n<p>Beijing has been characteristically silent on the nature and details of the mission, and it is not clear when the spacecraft will land or where. It is being developed by the China Academy of Launch Vehicle Technology.</p>\n\n            \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/news/565558-pentagon-ufo-sightings-report/\">\n            <span>READ MORE: </span>US probe sheds light on UFO mystery – NYT\n        </a>\n    </p>\n\n    \n\n<p>As many as half of the 366<em> &ldquo;unidentified flying object&rdquo;</em> sightings logged by the Office of the Director of National Intelligence last year remain open, though some believe many of the craft &ndash; capable of performing maneuvers impossible for American planes &ndash; may be Chinese drones.</p>",
  "enclosure": "",
  "pubDate": "Sat, 05 Nov 2022 09:42:37 +0000",
  "dc:creator": "RT"
}