{
  "title": "S1E42 - Redefining Success with Olympic Hurdler Sarah Wells",
  "guid": "https://pinecast.com/guid/9767724c-7aad-426e-8a1b-f63063685708",
  "pubDate": "Tue, 27 Apr 2021 06:30:00 -0000",
  "itunes:duration": "00:47:56",
  "description": "<hr>\n<p>This week, Laura welcomes Olympic hurdler, Sarah Wells, to the podcast. Once an athlete who was cut from every high school team she tried out for, Sarah discovered track and field and went on to become an Olympic semi-finalist and Pan Am Games silver medallist in the 400m hurdles, building a reputation for overcoming challenges and achieving the ‘impossible’ along the way.  She is also the Founder of the Believe Initiative, where she now uses her story to help youth understand the importance of being resilient and the power of believing in themselves, and to help corporations build more resilient teams.\n \nSarah begins by recounting how she got her unique start in sports, the support networks which have sustained her throughout, her rapid development in the hurdles, and both working and learning through her injuries. She also shares her discovery of ‘her word’, her Olympics Trials and Games experience, managing her stress fractures, and preparing to qualify for Rio 2016. Sarah concludes the conversation by discussing her Believe Initiative, how to get involved in it, her retirement from sports, and her perspective and guide to redefining success. A gifted speaker with a truly inspiring story, Sarah Wells has learned so much from her journey which is so very pertinent to life both within and beyond the sporting arena, and she shares it all here today.\nEpisode Highlights:</p>\n<ul>\n<li>Sarah’s start in sports</li>\n<li>Her support networks</li>\n<li>Sarah’s rapid development in hurdles</li>\n<li>Working and learning through her femur injury</li>\n<li>Finding her word ‘Believe’</li>\n<li>Returning from her injury</li>\n<li>Her Olympics Trials and Games experience</li>\n<li>Managing her recurring stress fractures</li>\n<li>Preparing to qualify for Rio 2016</li>\n<li>The Believe Initiative and how to get involved</li>\n<li>Retiring from sport</li>\n<li>Sarah’s perspective and exercise regarding redefining success</li>\n</ul>\n<p>Quotes:\n </p>\n<ul>\n<li>“At that point I hadn't defined myself by sport and I also had some really amazing siblings.”</li>\n<li>“You go from zero to competing internationally in, like, eight months.”</li>\n<li>“When someone else says it, you know, you're instantly a bit more likely to believe it.”</li>\n<li>“I would almost, like, live and die by how my leg felt that morning.”</li>\n<li>“I just would get so mentally defeated and, like, halfway through an interval I would just start walking.”</li>\n<li>“In the most important races in my life, when the gun goes off, I hear nothing. I just lock into completing what I need to do.”</li>\n<li>“It hurts so much that I'm scared, tomorrow when I run, it could break in half.”</li>\n<li>“It's a hard line to figure out when to push and when to ease off.”</li>\n<li>“Success isn't linear, it’s this roller coaster ride of emotions.”</li>\n<li>“Rest would have been very productive in that moment.”</li>\n<li>“I miss qualifying by half a second.”</li>\n<li>“Clearly you don't build self-belief through achievements, you build it through action.”</li>\n<li>“It helps people everywhere take a passion they have with a problem they want solve, and they use that passion to solve that problem, and they build self-belief through action.”</li>\n<li>“While hard work doesn't always lead to success, being resilient will always lead to another opportunity for it.”</li>\n<li>“Far more people are inspired by the time where I didn't make the Olympics over the time where I did.”</li>\n<li>“If you're able to continuously embody and act from a place of those powerful character traits that lead to success, well then, even in a moment where things don't work out, you're going to be able to rely on those things and find your next opportunity for success.”</li>\n</ul>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold homepage</a>\n<a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">5 Smart Strategies to Confidence</a>\n<a href=\"https://laurawilkinson.mykajabi.com/email-capture-0d05ebf5-739d-43b0-a4ab-5f4ea91a24e6\" rel=\"nofollow\">Conquer Your Fear in 5 Days</a>\n \nLaura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura's Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura's Facebook page</a>\n \nConnect with Sarah:\n<a href=\"https://sarahwells.ca/\" rel=\"nofollow\">Sarah's Homepage</a>  \n<a href=\"https://www.believeinitiative.com/\" rel=\"nofollow\">Believe Initiative</a>\n<a href=\"https://www.believeinitiative.com/believe-leadership-course/\" rel=\"nofollow\">The Believe Leadership Course</a>\n<a href=\"https://sarahwells.ca/2021/04/21/redefining-success/\" rel=\"nofollow\">Redefining Success</a></p>",
  "itunes:title": "Redefining Success with Olympic Hurdler Sarah Wells",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 42
}