{
  "title": "Constraints on Cosmological Parameters with a Sample of Type Ia Supernovae from JWST. (arXiv:2210.00746v2 [astro-ph.CO] UPDATED)",
  "link": "http://arxiv.org/abs/2210.00746",
  "description": "<p>We investigate the potential of using a sample of very high-redshift\n($2\\lesssim z \\lesssim6$) (VHZ) Type Ia supernovae (SNe~Ia) attainable by the\nJames Webb Space Telescope (JWST) on constraining cosmological parameters. At\nsuch high redshifts, the age of the universe is young enough that the VHZ SNIa\nsample comprises the very first SNe~Ia of the universe, with progenitors among\nthe very first generation of low mass stars that the universe has made. We show\nthat the VHZ SNe~Ia can be used to disentangle systematic effects due to the\nluminosity distance evolution with redshifts intrinsic to SNIa standardization.\nAssuming that the systematic evolution can be described by a linear or\nlogarithmic formula, we found that the coefficients of this dependence can be\ndetermined accurately and decoupled from cosmological models. Systematic\nevolution as large as 0.15 mag and 0.45 mag out to $z=5$ can be robustly\nseparated from popular cosmological models for the linear and logarithmic\nevolution, respectively. The VHZ SNe~Ia will lay the foundation for quantifying\nthe systematic redshift evolution of SNIa luminosity distance scales. When\ncombined with SNIa surveys at comparatively lower redshifts, the VHZ SNe~Ia\nallow for a precise measurement of the history of the expansion of the universe\nfrom $z\\sim 0$ to the epoch approaching reionization.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Lu_J/0/1/0/all/0/1\">Jia Lu</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Wang_L/0/1/0/all/0/1\">Lifan Wang</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Chen_X/0/1/0/all/0/1\">Xingzhuo Chen</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Rubin_D/0/1/0/all/0/1\">David Rubin</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Perlmutter_S/0/1/0/all/0/1\">Saul Perlmutter</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Baade_D/0/1/0/all/0/1\">Dietrich Baade</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Mould_J/0/1/0/all/0/1\">Jeremy Mould</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Vinko_J/0/1/0/all/0/1\">Jozsef Vinko</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Regos_E/0/1/0/all/0/1\">Eniko Regos</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Koekemoer_A/0/1/0/all/0/1\">Anton M. Koekemoer</a>"
}