{
  "title": "Driving innovation through project based learning: A pre-university STEAM for Social Good initiative. (arXiv:2211.01998v1 [cs.CY])",
  "link": "http://arxiv.org/abs/2211.01998",
  "description": "<p>The Covid pandemic is a clarion call for increased sensitivity to the\ninterconnected nature of social problems facing our world today. A\nfuture-oriented education on critical issues, such as those outlined in the\nUnited Nations Sustainable Development Goals (UN SDGs) and designing potential\nsolutions for such problems is an imperative skill that must be imparted to\nchildren to help them navigate their future in today's unpredictable world.\nTowards this goal, we have been conducting 3.5 month-long mentoring programs\nfor pre-university students in India to participate in a STEAM for Social Good\ninnovation challenge conducted annually by the Government of India. Using\ndigital and physical computing skills, we helped children explore creative\nsolutions for social problems through a constructionist approach to learning,\nwherein they ideated and reflected upon the problems in their communities. The\nchildren learnt the Engineering Design Thinking process and worked in online\ngroups of two or three, from concept to completion. Despite the constraints\nposed by the pandemic, they explored creative ways to think about design and\ninnovation. They completed a variety of tasks by making, tinkering,\nengineering, assembling, and programming to grasp the intricate relationship\nbetween software and hardware. Subsequently, the children showcased their\ncreative abilities through video storytelling to a panel of domain experts. In\nthis paper, we present the children's perspective of their experiences through\nthis journey, the evaluation metrics based on IEEE design principles, and our\nlearnings from conducting this initiative as a university-school partnership\nmodel for 84 middle and high school students. The aspirational intent of this\ninitiative is to make the children better social problem solvers and help them\nperceive social problems as opportunities to enhance life for themselves and\ntheir communities.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Manikutty_G/0/1/0/all/0/1\">Gayathri Manikutty</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Sasidharan_S/0/1/0/all/0/1\">Sreejith Sasidharan</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Rao_B/0/1/0/all/0/1\">Bhavani Rao</a>"
}