{
  "title": "Volocopter Raises Additional USD 182 million",
  "link": "https://www.iaasiaonline.com/volocopter-raises-additional-usd-182-million/",
  "dc:creator": "Tzelong",
  "pubDate": "Tue, 01 Nov 2022 09:21:45 +0000",
  "category": [
    "Industry News",
    "Recent News",
    "volocopter",
    "Volocopter"
  ],
  "guid": "https://www.iaasiaonline.com/?p=38792",
  "description": "<p>Volocopter Raises Additional USD 182 million in Second Signing of Series E Financing Round Volocopter, the pioneer of urban air mobility (UAM), has raised an additional USD 182 million in the second signing of its Series E funding round. NEOM – the Red Sea&#8217;s smart, cognitive region project – and GLy Capital Management of Hong &#8230;</p>\n<p class=\"read-more\"> <a class=\"\" href=\"https://www.iaasiaonline.com/volocopter-raises-additional-usd-182-million/\"> <span class=\"screen-reader-text\">Volocopter Raises Additional USD 182 million</span> Read More &#187;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com/volocopter-raises-additional-usd-182-million/\">Volocopter Raises Additional USD 182 million</a> appeared first on <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com\">IAA - Industrial Automation</a>.</p>\n",
  "content:encoded": "<p>Volocopter Raises Additional USD 182 million in Second Signing of Series E Financing Round</p>\n<p><span id=\"more-38792\"></span></p>\n<p>Volocopter, the pioneer of urban air mobility (UAM), has raised an additional USD 182 million in the second signing of its Series E funding round. NEOM – the Red Sea&#8217;s smart, cognitive region project – and GLy Capital Management of Hong Kong have joined Volocopter&#8217;s diverse investor base. This will carry the company beyond the certification of its electric passenger aircraft, the VoloCity air taxi.</p>\n<p>&nbsp;</p>\n<p>Sustainable mobility is a tremendous challenge facing today&#8217;s world. Volocopter offers a suite of fully electric aircraft for urban missions. Crucially, Volocopter&#8217;s holistic UAM ecosystem approach connects all key global market players as it strives to get the industry off the ground. This includes developing multipurpose electric aircraft to bring passengers and goods safely to their destination (the VoloCity, VoloRegion, and VoloDrone), and enabling the physical and digital infrastructure to match (the VoloPort and VoloIQ).</p>\n<p>&#8220;Attracting NEOM And GLy as investors is a great success and highlights our pole position in the commercial certification race. This is the key requirement to launching commercial operations and starting to generate revenue,&#8221; said Dirk Hoke, CEO of Volocopter.</p>\n<p>Volocopter is a UAM leader, with over ten years of experience and upward of 1,500 successful test flights. As the first and only electric vertical takeoff and landing (eVTOL) company to receive Design Organisation Approval (DOA) from the European Union Aviation Safety Agency (EASA), Volocopter expects to launch its first commercial air taxi routes in the next two years in megacities like Singapore, Rome, Paris, and the NEOM region.</p>\n<p>Christian Bauer, CCO of Volocopter, added: &#8220;Raising over USD 180 million despite the generally tense economic climate highlights Volocopter&#8217;s robust technology strategy and its ongoing progress toward achieving market readiness. We appreciate the remarkable spirit of collaboration and the trust that our existing and new shareholders have placed in us as we forge ahead on our journey to bring the urban air mobility ecosystem to life.&#8221;</p>\n<p>Volocopter and NEOM signed a joint venture (JV) company in December 2021, becoming strategic partners to integrate the VoloCity and the VoloDrone into NEOM&#8217;s sustainable and smart mobility systems. The JV will design, integrate, and operate all-electric public flight routes for the initial seven years.</p>\n<p>&#8220;At Neom we strongly believe in the potential for urban air mobility to provide a new dimension to future integrated transport systems. Building on our successful collaboration with Volocopter, we are excited to strengthen our partnership and to make a strategic investment in the future of mobility. We believe Volocopter is the best partner to build an advanced air mobility ecosystem in Neom. We look forward to realising this exciting mission jointly with Volocopter and its global partners&#8221; said Florian Lennert, Head of Mobility of NEOM.</p>\n<p>GLy is backed by Geely Holding, and in their joint venture, Geely and Volocopter aim to bring UAM to China which is expected to become one of the largest markets for electric air taxis.</p>\n<p>&#8220;Volocopter&#8217;s vision encompasses industrial short- and medium-range commercial passenger applications to bring efficiency to the way we move around our cities. I look forward to supporting their journey; a journey that promises to be exciting, safe, and scenic in equal measure,&#8221; said Hrvoje Krkalo, co-CEO of GLy Capital.</p>\n<p>With many interested companies having passed the due diligence phase, Volocopter&#8217;s Series E funding round remains open.</p>\n<p><!--more--></p>\n<p><strong><b>CLICK </b></strong><a href=\"https://www.iaasiaonline.com/industry-news/\"><strong><u><b>HERE</b></u></strong></a><strong><b> FOR LATEST NEWS.</b></strong></p>\n<p><strong><b>READ CURRENT AND PAST </b></strong><a href=\"https://www.iaasiaonline.com/magazine/\"><strong><u><b>ISSUES</b></u></strong></a><strong><b> OF IAA.</b></strong></p>\n<p><strong><b>KEEP YOURSELF UPDATED, </b></strong><a href=\"https://www.iaasiaonline.com/subscription/\"><strong><u><b>SUBSCRIBE</b></u></strong></a><strong><b> TO IAA NOW!</b></strong></p>\n<p><strong><b>AND DON’T FORGET FOLLOW US ON </b></strong><a href=\"https://www.facebook.com/IAAsia/\"><strong><u><b>FACEBOOK</b></u></strong></a><strong><b>,</b></strong><a href=\"https://www.linkedin.com/showcase/industrial-automation-asia/\"><strong><u><b> LINKEDIN</b></u></strong></a><strong><b> AND </b></strong><a href=\"https://twitter.com/IAA_Asia\"><strong><u><b>TWITTER!</b></u></strong></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com/volocopter-raises-additional-usd-182-million/\">Volocopter Raises Additional USD 182 million</a> appeared first on <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com\">IAA - Industrial Automation</a>.</p>\n"
}