{
  "title": "212: Dateline: A Lonely Place",
  "link": "https://audioboom.com/posts/7986184",
  "itunes:episode": 212,
  "itunes:title": "Dateline: A Lonely Place",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3259,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>FAM! THIS IS APPARENTLY DATELINE'S 'MOST CHILLING EPISODE'! ALSO, KEITH SWEARS, IT'S PRETTY AMAZING.<br>\n<br>\nChris Smith was living his dream southern California life: close family, great friends, running a small business with trusted colleague. So when he emails his family to say he's giving it all up to travel the world with a, wait for it, Playboy Playmate, his family is confused, but happy for him. But when a year goes by and Chris's only contact is sporadic emails--never a phone call--the family gets suspicious and begins to unravel the real story of what is going on.<br>\n<br>\n<a href=\"https://shop.truecrimeobsessed.com/\">OUR MERCH STORE IS OPEN!</a> Want a \"Steve, I've Been Duped\" T-shirt, or how about \"Not A Mother\" baseball T? \"Let The Women Do The Work\" sweatshirt? We've got all that and more for a limited time only! <a href=\"https://shop.truecrimeobsessed.com/\">CHECK IT OUT HERE!</a><br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 200 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"John Wayne Gacy: Devil in Disguise\" </strong>\"<strong>Night Stalker</strong>\" <strong>\"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Thu, 25 Nov 2021 11:34:35 +0000",
  "guid": "tag:audioboom.com,2021-11-25:/posts/7986184",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}