{
  "title": "World’s biggest iPhone assembly plant under quarantine",
  "link": "https://www.rt.com/news/565780-apple-plant-china-lockdown/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565780-apple-plant-china-lockdown/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63622542203027657549ac1e.jpg\" /> The Zhengzhou Airport Economy Zone, which hosts Foxconn’s biggest iPhone assembly plant, has been placed under lockdown <br/><a href=\"https://www.rt.com/news/565780-apple-plant-china-lockdown/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>A strict lockdown has been imposed on a district in Zhengzhou, China due to an outbreak of Covid-19 </strong></p>\n            \n                        \n            <p></p>\n<p>The Chinese authorities have ordered&nbsp;that&nbsp;a key industrial area in the city of Zhengzhou be quarantined. The decision throws a wrench into the works for Apple, as this will affect an iPhone assembly plant which is crucial for the rollout of the new 14 series.</p>\n<p>The Zhengzhou Airport Economy Zone (ZAEZ) was placed under <em>&ldquo;static lockdown&rdquo;</em> on Wednesday for at least a week, according to a statement released by the local government. This means that all non-essential business and travel has been suspended in the district. People were ordered to work from home if possible, unless they join the volunteer forces for Covid-19 prevention.</p>\n<p>The move comes on the back of a reported exodus of workers from a plant in ZAEZ run by Foxconn Technology Group, which assembles iPhone devices. A video shared on Chinese social media last week shows people leaving the facility on foot because public transportation in the city was restricted over Covid-19 concerns.</p>\n<p>The factory employs around 300,000 workers. The walkout was apparently caused by an outbreak of the disease on the premises and fears of a full lockdown. Foxconn promised on Sunday to provide transportation for those who want to leave, as well as sanitary work conditions and daily PCR tests for those who wish to stay.</p>\n\n            <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Workers reportedly escaping <a href=\"https://twitter.com/hashtag/Apple?src=hash&ref_src=twsrc%5Etfw\">#Apple</a>’s largest <a href=\"https://twitter.com/hashtag/iPhone?src=hash&ref_src=twsrc%5Etfw\">#iPhone</a> factory in <a href=\"https://twitter.com/hashtag/China?src=hash&ref_src=twsrc%5Etfw\">#China</a> to avoid COVID-19 curbs<br> <br>The Foxconn plant in <a href=\"https://twitter.com/hashtag/Zhengzhou?src=hash&ref_src=twsrc%5Etfw\">#Zhengzhou</a>, <a href=\"https://twitter.com/hashtag/Henan?src=hash&ref_src=twsrc%5Etfw\">#Henan</a> province, is one of the largest factories in China that assembles products for <a href=\"https://twitter.com/hashtag/Apple?src=hash&ref_src=twsrc%5Etfw\">#Apple</a> Inc., including its latest iPhone 14 devices. <a href=\"https://t.co/7q993Z9ouB\">pic.twitter.com/7q993Z9ouB</a></p>&mdash; ANews (@anews) <a href=\"https://twitter.com/anews/status/1587169353317122048?ref_src=twsrc%5Etfw\">October 31, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n    \n\n<p>Some cities in the Henan province in central China, where Zhengzhou is located, offered assistance to workers, urging them to ask for buses to bring them to their hometowns. They are expected to undergo a quarantine.</p>\n<p>The factory was previously placed under a &lsquo;closed-loop management&rsquo; system, which involves limiting the movement of employees in the compound to prevent the transmission of infections. According to Reuters, the plant experienced a sharp decrease in output, projected to cause a monthly slump of up to 30%.</p>\n<p>The Chinese government maintains a zero-tolerance policy regarding Covid-19, imposing lockdowns to quash outbreaks. The Hanan province reported 359 new cases on Wednesday, up from 103 on Tuesday.</p>\n\n            \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/news/560422-china-taiwan-row-may-delay-iphone14/\">\n            <span>READ MORE: </span>Culprit for possible iPhone 14 rollout delay named – media\n        </a>\n    </p>\n\n    \n\n<p>Foxconn&rsquo;s plant in Zhengzhou is touted as the world&rsquo;s largest iPhone assembly facility. According to an estimate cited by Bloomberg, it is responsible for 80% of capacity for the new iPhone 14 series, including more than 85% of capacity for the iPhone 14 Pro. The line was first unveiled in September.</p>\n<p></p>",
  "enclosure": "",
  "pubDate": "Wed, 02 Nov 2022 09:06:41 +0000",
  "dc:creator": "RT"
}