{
  "title": "The Multi-Trillion Dollar Market Cap  | Part 2 of Tony’s conversation on the future of food, energy and space",
  "pubDate": "Wed, 27 Jan 2021 23:56:18 +0000",
  "guid": "b5731b16-18b2-43f8-af8e-752866e10c7e",
  "link": "https://tonyrobbins.libsyn.com/the-multi-trillion-dollar-market-cap-part-2-of-tonys-conversation-on-the-future-of-food-energy-and-space",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Welcome to today’s bonus episode. In the previous episode,</span> <span style= \"font-weight: 400;\">The Future of Food, Energy and Space,</span> <span style=\"font-weight: 400;\">you heard Tony introduce a group of groundbreaking entrepreneurs who are turning the status quo upside down for how we operate as humans. They shared what amazing technology we have to look forward to, not tomorrow, but</span> <em><span style=\"font-weight: 400;\">today</span></em><span style= \"font-weight: 400;\">. This is technology that will improve the lives of people all over the world and for generations to come. </span></p> <p><span style=\"font-weight: 400;\">Here Tony continues the conversation with Bill, Jason, Mikhail, and Dakin, but with a focus on the</span> <em><span style=\"font-weight: 400;\">business side</span></em> <span style=\"font-weight: 400;\">to bettering the lives of people everywhere. Bill speaks to his desire to do for energy what Elon Musk did for cars. Jason talks about the power of distribution, comparing Netflix to the food market. And Mikhail opens our eyes to the newest space race and how being business-minded with technology produces</span> <em><span style= \"font-weight: 400;\">incredible</span></em> <span style= \"font-weight: 400;\">results. </span></p> <p><span style=\"font-weight: 400;\">In this episode Tony calls each of us to be an</span> <em><span style= \"font-weight: 400;\">owner</span></em><span style= \"font-weight: 400;\">, not just a consumer. Entrepreneurship and investing is something he’s worked throughout his career to make accessible for all people. Enjoy this exciting episode and discover how you can get involved. </span></p>",
  "content:encoded": "<p>Welcome to today’s bonus episode. In the previous episode, The Future of Food, Energy and Space, you heard Tony introduce a group of groundbreaking entrepreneurs who are turning the status quo upside down for how we operate as humans. They shared what amazing technology we have to look forward to, not tomorrow, but <em>today</em>. This is technology that will improve the lives of people all over the world and for generations to come. </p> <p>Here Tony continues the conversation with Bill, Jason, Mikhail, and Dakin, but with a focus on the <em>business side</em> to bettering the lives of people everywhere. Bill speaks to his desire to do for energy what Elon Musk did for cars. Jason talks about the power of distribution, comparing Netflix to the food market. And Mikhail opens our eyes to the newest space race and how being business-minded with technology produces <em>incredible</em> results. </p> <p>In this episode Tony calls each of us to be an <em>owner</em>, not just a consumer. Entrepreneurship and investing is something he’s worked throughout his career to make accessible for all people. Enjoy this exciting episode and discover how you can get involved. </p>",
  "enclosure": "",
  "itunes:duration": "39:47",
  "itunes:explicit": false,
  "itunes:keywords": "Food,energy,technology,space,Innovation",
  "itunes:subtitle": "Welcome to today’s bonus episode. In the previous episode, The Future of Food, Energy and Space, you heard Tony introduce a group of groundbreaking entrepreneurs who are turning the status quo upside down for how we operate as humans. They shared...",
  "itunes:episodeType": "full"
}