{
  "title": "Casting Harry Styles and capturing England in the late 20th century in My Policeman",
  "link": "https://www.digitaltrends.com/movies/my-policeman-interviews/",
  "pubDate": "Fri, 04 Nov 2022 19:30:53 +0000",
  "dc:creator": "Jason Struss",
  "category": [
    "Features",
    "Movies & TV",
    "Amazon Prime Video",
    "dramas",
    "Entertainment interviews",
    "Harry Styles",
    "LGBTQ movies",
    "My Policeman"
  ],
  "guid": "https://www.digitaltrends.com/?p=3220358",
  "description": "In an interview with Digital Trends, director Michael Grandage and actress Gina McKee talk about working with Harry Styles in their new film, My Policeman.",
  "content:encoded": "<p>It&#8217;s only been a little over 50 years since <a href=\"https://theconversation.com/buggery-bribery-and-a-committee-the-story-of-how-gay-sex-was-decriminalised-in-britain-79597\" target=\"_blank\" rel=\"noopener\">homosexuality was decriminalized in England</a>, but the stories of those who were impacted by the law remain just as relevant and vital now as they did in the past. <em>My Policeman</em>, a new film based on the novel by Bethan Roberts, tells such a story and focuses on three people: Tom, the titular policeman, who is closeted; Patrick, an out gay man forced to live in the shadows; and Marion, a schoolteacher who loves Tom and wants him to be something he&#8217;s not.</p>\n<p>Now streaming on <a href=\"https://www.digitaltrends.com/movies/new-on-amazon-prime/\">Prime Video</a>, the film has attracted attention due primarily to the casting of <a href=\"https://www.digitaltrends.com/movies/my-policeman-new-trailer/\">popular singer Harry Styles as Tom</a>. In a conversation with Digital Trends, director Michael Grandage and actress Gina McKee discuss casting Styles as Tom, how the film captures a vital moment in <a href=\"https://www.digitaltrends.com/movies/queer-icons-hollywood-golden-age/\">LGBTQ history</a>, and why it&#8217;s important to confront past mistakes before it&#8217;s too late.</p>\n<p><em>Note: this interview has been condensed for length and clarity.</em></p>\n<p><strong>Digital Trends: What drew you both to this project?</strong></p>\n<p><strong>Gina McKee (actress, older Marion): </strong>For me, it was the dynamic of three people who are brought together in youth by love and divided by prejudice. Then, they are reunited four decades later by a catalyst. I&#8217;m being deliberately vague so I don&#8217;t give the story away. [Laughs]</p>\n<p>I liked that there was this love triangle where you&#8217;ve got three people who are victims of their time, and what they do to one another and for one another indelibly marks their lives. I think that is a really rich territory to explore, and that&#8217;s what originally drew me to it.</p>\n<figure class=\"alignnone\"><img  class=\" size-large wp-image-3220394\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/11/my-policeman-swimming-pool.jpg?fit=720%2C388&p=1\" alt=\"A man and a woman in a swimming pool in My Policeman.\"   /></figure>\n<p><strong>Michael Grandage (director): </strong>I wanted to bring my own voice to it. I was born in England in the early &#8217;60s. The law that criminalized homosexuality was still the same as it was in 1957, when Patrick and Tom were around.</p>\n<p>I&#8217;m thrilled, obviously, that <a href=\"https://www.digitaltrends.com/movies/best-lgbt-movies-on-paramount-plus/\">the whole LGBTQ community</a> has made such advances. It&#8217;s been an amazing 40 years since that time. But I am very aware that right now it&#8217;s a bit fragile again. I think part of why I was drawn to this film was I believe it&#8217;s great to make a film where you can look at something cinematically.</p>\n<p>How wonderful if you can make a film that could hopefully, fingers crossed, be seen by many young people, because it&#8217;s going to be that group that will help keep us moving forward and never allow us to move back to that time when gay people were persecuted.</p>\n<p>If they can see a film that helps them understand what the law in this country was like and what it did to people and how it destroyed lives. Then I hope they will become advocates for making sure that doesn&#8217;t happen again.</p>\n<figure class=\"alignnone\"><img  class=\" size-large wp-image-3220397\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/11/my-policeman-gina-mckee.jpg?fit=720%2C377&p=1\" alt=\"An older Marion looks at the horizon in My Policeman.\"   /></figure>\n<p><strong>Gina, I found out that during filming, Michael showed you dailies of Emma Corrin, who plays the younger version of your character in the &#8217;50s. How did that shape your performance when we see Marion as an older woman in the 1990s?</strong></p>\n<p><strong>McKee: </strong>It was really interesting. I think I saw about four of her scenes. It&#8217;s sort of like osmosis. It&#8217;s not like you can say, “Oh, it was one thing.” There&#8217;s something about the spirit of Emma, which I&#8217;ve seen in her past work and I also saw it in <strong>My Policeman</strong>, in how she observes, how she watches, and how she listens to others.</p>\n<p>Those elements of her character and her portrayal were certainly useful. And they kind of affirm an instinct that I already had, but just needed the courage of the affirmation to go with it. So, it was useful in that respect. She has a very interesting way of listening and observing.</p>\n<figure class=\"alignnone\"><img  class=\" size-large wp-image-3220395\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/11/my-policeman-emma-harry.jpg?fit=720%2C457&p=1\" alt=\"A man looks at a woman in My Policeman.\"   /></figure>\n<p><strong><em>My Policeman</em>’s cast boasts a terrific array of veteran and up-and-coming actors. For Tom, the central character, you cast a novice thespian, pop singer Harry Styles, and a veteran character actor, Linus Roache, to embody the character. What was it about both Harry and Linus that made them ideal for them to embody that role in different time periods?</strong></p>\n<p><strong>Michael Grandage: </strong>Well, it&#8217;s a difficult role, Tom, because he&#8217;s a policeman and is gay, but the law is against him and so he has to break the law to be his own true self. The result of those two factors mean that he gives absolutely nothing away and that he effectively closes down.</p>\n<p>As a result, he’s difficult to read. He&#8217;s shy. He’s beautiful, but his personality is hardly giving anything out at all. And that&#8217;s a very difficult acting challenge. I needed somebody as the young Tom to be able to want to take that on, where most of his performance is placed on him by others. Because it&#8217;s about what he isn&#8217;t giving out. When I met with Harry, he understood the very shy, insular nature of this man.</p>\n<p>When I was looking for somebody to play Tom 40 years later, I cast Linus partly because they share similar physical features. But it was more important for me to find an older actor who also understood that even after 40 years, Tom didn&#8217;t ever really come out of his shell. Linus understood that and that&#8217;s where the casting of those two came from.</p>\n<p><strong>It isn&#8217;t easy to categorize <em>My Policeman</em>. You can categorize it as a gay love story or a movie about marriage or a portrait of England in two time periods: the 1950s and the 1990s. Gina, how would you define the movie?</strong></p>\n<p><strong>McKee: </strong>That&#8217;s a brilliant question. I think <em>My Policeman</em> touches on a number of elements, but I think ultimately it&#8217;s a movie with a message that if you can find the courage to address your past, you need to do it before it&#8217;s too late.</p>\n<p><a href=\"https://www.amazon.com/My-Policeman-Harry-Styles/dp/B09Y8GB9R3?ref=DVM_US_DL_SL_GO_AST_MYPLCMN_mkw_sWl8iyY8w-dc&mrntrk=pcrid_632698891330_slid__pgrid_148806095451_pgeo_9067609_x__ptid_kwd-1670679631850&gclid=CjwKCAjw8JKbBhBYEiwAs3sxN4gnmKu_XpooIPLY_pqbbkQThl6db3zMuBAyWQcsuJqza284K1NLMxoCbY0QAvD_BwE\" target=\"_blank\" rel=\"sponsored noopener\">My Policeman</a> <em>is currently streaming on Prime Video and playing in select theaters.</em></p>\n",
  "thumbnail": "https://www.digitaltrends.com/wp-content/uploads/2022/11/my-policeman-swimming-pool.jpg?p=1",
  "enclosure": "",
  "post-id": 3220358
}