{
  "id": "tag:blogger.com,1999:blog-37798047.post-3133624835814497538",
  "published": "2021-07-26T20:52:00.002-04:00",
  "updated": "2021-07-26T20:52:15.510-04:00",
  "title": "Of course you can't trust scientists on politics",
  "content": "Many people make the same claim as this tweet. It's obviously wrong. Yes,, the right-wing has a problem with science, but this isn't it.<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">If you think you don't trust scientists, you're mistaken. You trust scientists in a million different ways every time you step on a plane, or for that matter turn on your tap or open a can of beans. The fact that you're unaware of this doesn't mean it's not so.</p>— Paul Graham (@paulg) <a href=\"https://twitter.com/paulg/status/1419765657080578052?ref_src=twsrc%5Etfw\">July 26, 2021</a></blockquote><p>First of all, people trust airplanes because of their long track record of safety, not because of any claims made by scientists. Secondly, people distrust \"scientists\" when politics is involved because of course scientists are human and can get corrupted by their political (or religious) beliefs.</p><p>And thirdly, the concept of \"trusting scientific authority\" is wrong, since the bedrock principle of science is distrusting authority. What defines sciences is how often prevailing scientific beliefs are challenged.</p><span><a name='more'></a></span><p>Carl Sagan has many quotes along these lines that eloquently expresses this:</p><p></p><blockquote>A central lesson of science is that to understand complex issues (or even simple ones), we must try to free our minds of dogma and to guarantee the freedom to publish, to contradict, and to experiment. Arguments from authority are unacceptable.</blockquote><p></p><p>If you are \"arguing from authority\", like Paul Graham is doing above, then you are fundamentally misunderstanding both the principles of science and its history.</p><p>We know where this controversy comes from: politics. The above tweet isn't complaining about the $400 billion U.S. market for alternative medicines, a largely non-political example. It's complaining about political issues like vaccines, global warming, and evolution.</p><p>The reason those on the right-wing resist these things isn't because they are inherently anti-science, it's because the left-wing is. They left has corrupted and politicized these topics. The \"Green New Deal\" contains very little that is \"Green\" and much that is \"New Deal\", for example. The left goes from the fact \"carbon dioxide absorbs infrared\" to justify \"we need to promote labor unions\".</p><p>Take Marjorie Taylor Green's (MTG) claim that she doesn't believe in the Delta variant because she doesn't believe in evolution. Her argument is laughably stupid, of course, but it starts with the way the left has politicized the term \"evolution\".</p><p>The \"Delta\" variant didn't arise from \"evolution\", it arose because of \"mutation\" and \"natural selection\". We know the \"mutation\" bit is true, because we can sequence the complete DNA and detect that changes happen. We know that \"selection\" happens, because we see some variants overtake others in how fast they spread.</p><p>Yes, \"evolution\" is synonymous with mutation plus selection, but it's also a politically loaded term that means a lot of additional things. The public doesn't understand mutation and natural-selection, because these concepts are not really taught in school. Schools don't teach students to <i>understand</i> these things, they teach students to <i>believe</i>.</p><p>The focus of science eduction in school is indoctrinating students into believing in \"evolution\" rather than teaching the mechanisms of \"mutation\" and \"natural-selection\". We see the conflict in things like describing the evolution of the eyeball, which Creationists \"reasonably\" believe is too complex to have evolved this way. I put \"reasonable\" in quotes here because it's just the \"Gods in the gaps\" argument, which credits God for everything that science can't explain, which isn't very smart. But at the same time, science textbooks go too far, refusing to admit their gaps in knowledge here. The fossil records shows a lot of complexity arising over time through steady change -- it just doesn't show anything about eyeballs.</p><p>In other words, it's possible for a kid to graduate high-school with a full understanding of science, including mutation, selection, and the fossil record, while believing God created the eyeball. This is anathema to educators, who would rather students \"believe in evolution\" than understand it.</p><p>Thus, \"believing\" in the \"evolution\" of the Delta variant becomes this horrible political debate because the left-wing has corrupted science. You have politicians like MTG virtue signaling their opposition to evolution in what should be a non-political, neutral science discussion.</p><p>The political debate over vaccines isn't the vaccines themselves, but forcing people to become vaccinated.</p><p>The evidence is clear that the covid vaccines are in your own (and your kids') best interest. If we left it there, few would be challenging the science. There is no inherent right-wing opposition to vaccines. Indeed, Trump championed the covid vaccines, trying to take credit for their development.&nbsp;</p><p>But the left-wing chose a different argument, that covid vaccines are in the best interest of society, and therefore, that government must coerce/force people to become vaccinated. It's at this point that political opposition appears on the right-wing. It's the same whether you are describing the debate in the United States, Europe, or Asia.</p><p>We know the juvenile method which people defend their political positions. Once people decide to oppose \"forcible vaccination\", they then build a position that vaccines aren't \"good\" anyway.</p><p>Thus, you'll get these nonsense arguments from people who have get their opinions from dodgy blogs/podcasts, like \"these don't even meet the definition of a vaccine\". The started from the political goal first, and then looked for things that might support it, no matter how intellectually vacuous. It's frustrating trying to argue against the garbage arguments they'll toss up.</p><p>But at the same time, the left is no better. The tweet above is equally a vacuous meme, that they repeat because it sounds good, not because they've put much thought into it. It's simply an argument that strokes the prejudices of those who repeat it, rather than being a robust argument that can change the minds of opponents. It's obviously false: people trust planes because of their track record, not because of scientists claim. They trust scientists and doctors on non-political things, but rightly distrust their pronouncements on politically-tainted issues. And lastly, the above argument is completely anti-scientific -- science is all about questioning and doubting.</p><p><br /></p> <script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Robert Graham",
    "uri": "http://www.blogger.com/profile/09879238874208877740",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 2
}