{
  "title": "Episode 99: &#8220;Surfin&#8217; Safari&#8221; by the Beach Boys",
  "link": "https://500songs.com/podcast/episode-99-surfin-safari-by-the-beach-boys/",
  "pubDate": "Fri, 25 Sep 2020 20:32:02 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-99-surfin-safari-by-the-beach-boys/",
  "description": "This week there are&nbsp;<em>two</em> episiodes of the podcast going up, both of them longer than normal. This one, episode ninety-nine, is on \"Surfin' Safari\" by the Beach Boys, and the group's roots in LA, and is fifty minutes long. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,<a href=\"https://www.patreon.com/posts/42023843\"> on \"Misirlou\" by Dick Dale and the Deltones</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nNo Mixclouds this week, as both episodes have far too many songs by one artist. The mixclouds will be back with episode 101.\n\nI used many resources for this episode, most of which will be used in future Beach Boys episodes too. It's difficult to enumerate everything here, because I have been an active member of the Beach Boys fan community for twenty-three years, and have at times just used my accumulated knowledge for this. But the resources I list here are ones I've checked for specific things.\n\n<a href=\"https://amzn.to/3i21aaf\"><em>Becoming the Beach Boys</em> by James B. Murphy</a> is an in-depth look at the group's early years.\n\nStephen McParland has published many, many books on the California surf and hot-rod music scenes, including several on both the Beach Boys and Gary Usher.&nbsp;<em>The Beach Boys: Inception and Creation</em> is the one I used most here, but I referred to several. His books can be found at <a href=\"https://payhip.com/CMusicBooks\">https://payhip.com/CMusicBooks</a>\n\nAndrew Doe's <a href=\"http://www.bellagio10452.com/\">Bellagio 10452 </a>site is an invaluable resource.\n\nJon Stebbins' <a href=\"https://amzn.to/2S0eQIs\">The Beach Boys FAQ </a>is a good balance between accuracy and readability.\n\nAnd <a href=\"https://amzn.to/3i22CcH\">Philip Lambert's&nbsp;<em>Inside the Music of Brian Wilson</em></a> is an excellent, though sadly out of print, musicological analysis of Wilson's music from 1962 through 67.\n\nThe Beach Boys' Morgan recordings and all the outtakes from them can be found on <a href=\"https://amzn.to/3cEitNG\">this 2-CD set.</a>\n\nThe&nbsp;<em>Surfin' Safari</em> album is now in the public domain, and so can be found cheaply, but the best version to get is still <a href=\"https://amzn.to/2G6Vw9I\">the twofer CD with the&nbsp;<em>Surfin' USA&nbsp;</em></a><a href=\"https://amzn.to/2G6Vw9I\">album</a>.\n\n*But*, those two albums are fairly weak, the Beach Boys in their early years were not really an album band, and you&nbsp;<em>will</em> want to investigate them further. I would recommend, rather than the two albums linked above, starting with <a href=\"https://amzn.to/3i0tsC9\">this budget-priced three-CD set</a>, which has a surprisingly good selection of their material on it.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday, there are going to be two podcast episodes. This one, episode ninety-nine, will be a normal-length episode, or maybe slightly longer than normal, and episode one hundred, which will follow straight after it, will be a super-length one that's at least three times the normal length of one of these podcasts.\n\nI'm releasing them together, because the two episodes really do go together. We've talked recently about how we're getting into the sixties of the popular imagination, and those 1960s began, specifically, in October 1962. That was the month of the Cuban Missile Crisis, which saw the world almost end. It was the month that James Brown released Live at the Apollo -- an album we'll talk about in a few weeks' time. And if you want one specific date that the 1960s started, it was October the fifth, 1962.\n\nOn that date, a film came out that we mentioned last week -- Doctor No, the first ever James Bond film. It was also the date that two records were released on EMI in Britain. One was a new release by a British band, the other a record originally released a few months earlier in the USA, by an American band. Both bands had previously released records on much smaller labels, to no success other than very locally, but this was their first to be released on a major label, and had a slightly different lineup from those earlier releases. Both bands would influence each other, and go on to be the most successful band from their respective country in the next decade. Both bands would revolutionise popular music. And the two bands would even be filed next to each other alphabetically, both starting \"the Bea\". In episode one hundred, we're going to look at \"Love Me Do\" by the Beatles, but right now, in episode ninety-nine, we're going to look at \"Surfin' Safari\" by the Beach Boys:\n\n[Excerpt: The Beach Boys, \"Surfin' Safari\"]\n\nBefore I start this story properly, I just want to say something -- there are a lot of different accounts of the formation of the Beach Boys, and those accounts are all different. What I've tried to do here is take one plausible account of how the group formed and tell it in a reasonable length of time. If you read the books I link in the show notes, you might find some disagreements about the precise order of some of these events, or some details I've glossed over. This episode is already running long, and I didn't want to get into that stuff, but it's important that I stress that this is just as accurate as I can get in the length of an episode.\n\nThe Beach Boys really were boys when they made their first records. David Marks, their youngest member, was only thirteen when \"Surfin' Safari\" came out, and Mike Love, the group's oldest member, was twenty-one.\n\nSo, as you might imagine when we're talking about children, the story really starts with the older generation. In particular, we want to start with Hite and Dorinda Morgan. The Morgans were part-time music business people in Los Angeles in the fifties. Hite Morgan owned an industrial flooring company, and that was his main source of income -- putting in floors at warehouses and factories that could withstand the particular stresses that such industrial sites faced.\n\nBut while that work was hard, it was well-paying and didn't take too much time. The company would take on two or three expensive jobs a year, and for the rest of the year Hite would have the money and time to help his wife with her work as a songwriter. She'd collaborated with Spade Cooley, one of the most famous Western Swing musicians of the forties, and she'd also co-written \"Don't Put All Your Dreams in One Basket\" for Ray Charles in 1948:\n\n[Excerpt: Ray Charles, \"Don't Put All Your Dreams in One Basket\"]\n\nHite and Dorinda's son, Bruce, was also a songwriter, though I've seen some claims that often the songs credited to him were actually written by his mother, who gave him credits in order to encourage him. One of Bruce Morgan's earliest songs was a piece called \"Proverb Boogie\", which was actually credited under his father's name, and which Louis Jordan retitled to \"Heed My Warning\" and took a co-writing credit on:\n\n[Excerpt: Louis Jordan, \"Heed My Warning\"]\n\nEventually the Morgans also started their own publishing company, and built their own small demo studio, which they used to use to record cheap demos for many other songwriters and performers.\n\nThe Morgans were only very minor players in the music industry, but they were friendly with many of the big names on the LA R&B scene, and knew people like John Dolphin, Bumps Blackwell, Sam Cooke, and the Hollywood Flames. Bruce Morgan would talk in interviews about Bumps Blackwell calling round to see his father and telling him about this new song \"You Send Me\" he was going to record with Cooke.\n\nBut although nobody could have realised it at the time, or for many years later, the Morgans' place in music history would be cemented in 1952, when Hite Morgan, working at his day job, met a man named Murry Wilson, who ran a machine-tool company based in Hawthorne, a small town in southwestern Los Angeles County. It turned out that Wilson, like Dorinda Morgan, was an aspiring songwriter, and Hite Morgan signed him up to their publishing company, Guild Music.\n\nWilson's tastes in music were already becoming old-fashioned even in the very early 1950s, but given the style of music he was working in he was a moderately talented writer. His proudest moment was writing a song called \"Two Step Side Step\" for the Morgans, which was performed on TV by Lawrence Welk -- Murry gathered the whole family round the television to watch his song being performed.\n\nThat song was a moderate success – it was never a hit for anyone, but it was recorded by several country artists, including the rockabilly singer Bonnie Lou, and most interestingly for our purposes by Johnny Lee Wills, Bob Wills' brother:\n\n[Excerpt: Johnny Lee Wills, \"Two Step Side Step\"]\n\nWilson wrote a few other songs for the Morgans, of which the most successful was \"Tabarin\", which was recorded by the Tangiers -- one of the several names under which the Hollywood Flames performed. Gaynel Hodge would later speak fondly of Murry Wilson, and how he was always bragging about his talented kids:\n\n[Excerpt: The Tangiers, \"Tabarin\"]\n\nBut as the fifties progressed, the Morgans published fewer and fewer of Wilson's songs, and none of them were hits. But the Morgans and Wilson stayed in touch, and around 1958 he heard from them about an opportunity for one of those talented kids.\n\nDorinda Morgan had written a song called \"Chapel of Love\" -- not the same song as the famous one by the Dixie Cups -- and Art Laboe had decided that that song would be perfect as the first record for his new label, Original Sound. Laboe was putting together a new group to sing it, called the Hitmakers, which was based around Val Poliuto. Poliuto had been the tenor singer of an integrated vocal group -- two Black members, one white, and one Hispanic -- which had gone by the names The Shadows and The Miracles before dismissing both names as being unlikely to lead to any success and taking the name The Jaguars at the suggestion of, of all people, Stan Freberg, the comedian and voice actor.\n\nThe Jaguars had never had much commercial success, but they'd recorded a version of \"The Way You Look Tonight\" which became a classic when Laboe included it on the massively successful \"Oldies But Goodies\", the first doo-wop nostalgia album:\n\n[Excerpt: The Jaguars, \"The Way You Look Tonight\"]\n\nThe Jaguars continued for many years, and at one point had Richard Berry guest as an extra vocalist on some of their tracks, but as with so many of the LA vocal groups we've looked at from the fifties, they all had their fingers in multiple pies, and so Poliuto was to be in this new group, along with Bobby Adams of the Calvanes, who had been taught to sing R&B by Cornell Gunter and who had recorded for Dootsie Williams:\n\n[Excerpt: The Calvanes, \"Crazy Over You\"]\n\nThose two were to be joined by two other singers, who nobody involved can remember much about except that their first names were Don and Duke, but Art Laboe also wanted a new young singer to sing the lead, and was auditioning singers. Murry Wilson suggested to the Morgans that his young son Brian might be suitable for the role, and he auditioned, but Laboe thought he was too young, and the role went to a singer called Rodney Goodens instead:\n\n[Excerpt: The Hitmakers, \"Chapel of Love\"]\n\nSo the audition was a failure, but it was a first contact between Brian Wilson and the Morgans, and also introduced Brian to Val Poliuto, from whom he would learn a lot about music for the next few years.\n\nBrian was a very sensitive kid, the oldest of three brothers, and someone who seemed to have some difficulty dealing with other people -- possibly because his father was abusive towards him and his brothers, leaving him frightened of many aspects of life. He did, though, share with his father a love of music, and he had a remarkable ear -- singular, as he's deaf in one ear. He had perfect pitch, a great recollection for melodies -- play him something once and it would stay in his brain -- and from a very young age he gravitated towards sweet-sounding music. He particularly loved Glenn Miller's version of \"Rhapsody in Blue\" as a child:\n\n[Excerpt: The Glenn Miller Orchestra, \"Rhapsody in Blue\"]\n\nBut his big musical love was a modern harmony group called the Four Freshmen -- a group made up of two brothers, their cousin, and a college friend. Modern harmony is an outdated term, but it basically meant that they were singing chords that went beyond the normal simple triads of most pop music. While there were four, obviously, of the Four Freshmen, they often achieved an effect that would normally be five-part harmony, by having the group members sing all the parts of the chord *except* the root note -- they'd leave the root note to a bass instrument. So while Brian was listening to four singers, he was learning five-part harmonies. The group would also sing their harmonies in unusual inversions -- they'd take one of the notes from the middle of the chord and sing it an octave lower.\n\nThere was another trick that the Four Freshmen used -- they varied their vocals from equal temperament.\n\nTo explain this a little bit -- musical notes are based on frequencies, and the ratio between them matters. If you double the frequency of a note, you get the same note an octave up -- so if you take an A at 440hz, and double the frequency to 880, you get another A, an octave up. If you go down to 220hz, you get the A an octave below.\n\nYou get all the different notes by multiplying or dividing a note, so A# is A multiplied by a tiny bit more than one, and A flat is A multiplied by a tiny bit less than one. But in the middle ages, this hit a snag -- A#. which is A multiplied by one and a bit, is very very slightly different from B flat, which is B multiplied by 0.9 something. And if you double those, so you go to the A# and B flat the next octave up, the difference between A# and B flat gets bigger. And this means that if you play a melody in the key of C, but then decide you want to play it in the key of B flat, you need to retune your instrument -- or have instruments with separate notes for A# and B flat -- or everything will sound out of tune.\n\nIt's very very hard to retune some instruments, especially ones like the piano, and also sometimes you want to play in different keys in the same piece. If you're playing a song in C, but it goes into C# in the last chorus to give it a bit of extra momentum, you lose that extra momentum if you stop the song to retune the piano. So a different system was invented, and popularised in the Baroque era, called \"equal temperament\". In that system, every note is very very slightly out of tune, but those tiny errors cancel out rather than multiply like they do in the old system. You're sort of taking the average of A# and B flat, and calling them the same note. And to most people's ears that sounds good enough, and it means you can have a piano without a thousand keys.\n\nBut the Four Freshmen didn't stick to that -- because you don't need to retune your throat to hit different notes (unless you're as bad a singer as me, anyway). They would sing B flat slightly differently than they would sing A#, and so they would get a purer vocal blend, with stronger harmonic overtones than singers who were singing the notes as placed on a piano:\n\n[Excerpt: the Four Freshmen, \"It's a Blue World\"]\n\nPlease note by the way that I'm taking the fact that they used those non-equal temperaments somewhat on trust -- Ross Barbour of the group said they did in interviews, and he would know, but I have relatively poor pitch so if you listened to that and thought \"Hang on, they're all singing dead-on equal tempered concert pitch, what's he talking about?\", then that's on him.\n\nWhen Brian heard them singing, he instantly fell for them, and became a major, major fan of their work, especially their falsetto singer Bob Flanigan, whose voice he decided to emulate. He decided that he was going to learn how they got that sound. Every day when he got home from school, he would go to the family's music room, where he had a piano and a record player. He would then play just a second or so of one of their records, and figure out on the piano what notes they were singing in that one second, and duplicating them himself. Then he would learn the next second of the song. He would spend hours every day on this, learning every vocal part, until he had the Four Freshmen's entire repertoire burned into his brain, and could sing all four vocal parts to every song.\n\nIndeed, at one point when he was about sixteen -- around the same time as the Art Laboe audition -- Brian decided to go and visit the Four Freshmen's manager, to find out how to form a successful vocal group of his own, and to find out more about the group themselves. After telling the manager that he could sing every part of every one of their songs, the manager challenged him with \"The Day Isn't Long Enough\", a song that they apparently had trouble with:\n\n[Excerpt: The Four Freshmen, \"The Day Isn't Long Enough\"]\n\nAnd Brian demonstrated every harmony part perfectly. He had a couple of tape recorders at home, and he would experiment with overdubbing his own voice -- recording on one tape recorder, playing it back and singing along while recording on the other. Doing this he could do his own imitations of the Four Freshmen, and even as a teenager he could sound spookily like them:\n\n[Excerpt: The Beach Boys [Brian Wilson solo recording released on a Beach Boys CD], \"Happy Birthday Four Freshmen\"]\n\nWhile Brian shared his love for this kind of sweet music with his father, he also liked the rock and roll music that was making its way onto the radio during his teen years -- though again, he would gravitate towards the sweet vocal harmonies of the Everly Brothers rather than to more raucous music.\n\nHe shared his love of the Everlys with his cousin Mike Love, whose tastes otherwise went more in the direction of R&B and doo-wop. Unlike Brian and his brothers, Mike attended Dorsey High School, a predominantly Black school, and his tastes were shaped by that -- other graduates of the school include Billy Preston, Eric Dolphy, and Arthur Lee, to give some idea of the kind of atmosphere that Dorsey High had. He loved the Robins, and later the Coasters, and he's been quoted as saying he \"worshipped\" Johnny Otis -- as did every R&B lover in LA at the time. He would listen to Otis' show on KFOX, and to Huggy Boy on KRKD. His favourite records were things like \"Smokey Joe's Cafe\" by the Robins, which combined an R&B groove with witty lyrics:\n\n[Excerpt: The Robins, \"Smokey Joe's Cafe\"]\n\nHe also loved the music of Chuck Berry, a passion he shared with Brian's youngest brother Carl, who also listened to Otis' show and got Brian listening to it. While Mike was most attracted to Berry's witty lyrics, Carl loved the guitar part -- he'd loved string instruments since he was a tiny child, and he and a neighbour, David Marks, started taking guitar lessons from another neighbour, John Maus. Maus had been friends with Ritchie Valens, and had been a pallbearer at Valens' funeral. John was recording at the time with his sister Judy, as the imaginatively-named duo \"John & Judy\":\n\n[Excerpt: John & Judy, \"Why This Feeling?\"]\n\nJohn and Judy later took on a bass player called Scott Engel, and a few years after that John and Scott changed their surnames to Walker and became two thirds of The Walker Brothers.\n\nBut at this time, John was still just a local guitar player, and teaching two enthusiastic kids to play guitar. Carl and David learned how to play Chuck Berry licks, and also started to learn some of the guitar instrumentals that were becoming popular at the time.\n\nAt the same time, Mike would sing with Brian to pass the time, Mike singing in a bass voice while Brian took a high tenor lead. Other times, Brian would test his vocal arranging out by teaching Carl and his mother Audree vocal parts -- Carl got so he could learn parts very quickly, so his big brother wouldn't keep him around all day and he could go out and play. And sometimes their middle brother Dennis would join in -- though he was more interested in going out and having fun at the beach than he was in making music.\n\nBrian was interested in nothing *but* making music -- at least once he'd quit the school football team (American football, for those of you like me who parse the word to mean what it does in Britain), after he'd got hurt for the first time. But before he did that, he had managed to hurt someone else -- a much smaller teammate named Alan Jardine, whose leg Brian broke in a game. Despite that, the two became friends, and would occasionally sing together -- like Brian, Alan loved to sing harmonies, and they found that they had an extraordinarily good vocal blend. While Brian mostly sang with his brothers and his cousin, all of whom had a family vocal resemblance, Jardine could sound spookily similar to that family, and especially to Brian. Jardine's voice was a little stronger and more resonant, Brian's a little sweeter, with a fuller falsetto, but they had the kind of vocal similarity one normally only gets in family singers.\n\nHowever, &nbsp;they didn't start performing together properly, because they had different tastes in music -- while Brian was most interested in the modern jazz harmonies of the Four Freshman, Jardine was a fan of the new folk revival groups, especially the Kingston Trio. Alan had a group called the Tikis when he was at high school, which would play Kingston Trio style material like \"The Wreck of the John B\", a song that like much of the Kingston Trio's material had been popularised by the Weavers, but which the Trio had recorded for their first album:\n\n[Excerpt: The Kingston Trio, \"The Wreck of the John B\"]\n\nJardine was inspired by that to write his own song, \"The Wreck of the Hesperus\", putting Longfellow's poem to music. One of the other Tikis had a tape recorder, and they made a few stabs at recording it. They thought that they sounded pretty good, and they decided to go round to Brian Wilson's house to see if he could help them -- depending on who you ask, they either wanted him to join the band, or knew that his dad had some connection with the music business and wanted to pick his brains. When they turned up, Brian was actually out, but Audree Wilson basically had an open-door policy for local teenagers, and she told the boys about Hite and Dorinda Morgan. The Tikis took their tape to the Morgans, and the Morgans responded politely, saying that they did sound good -- but they sounded like the Kingston Trio, and there were a million groups that sounded like the Kingston Trio. They needed to get an original sound.\n\nThe Tikis broke up, as Alan went off to Michigan to college. But then a year later, he came back to Hawthorne and enrolled in the same community college that Brian was enrolled in. Meanwhile, the Morgans had got in touch with Gary Winfrey, Alan's Tikis bandmate, and asked him if the Tikis would record a demo of one of Bruce Morgan's songs. As the Tikis no longer existed, Alan and Gary formed a new group along the same lines, and invited Brian to be part of one of these sessions. That group, The Islanders made a couple of attempts at Morgan's song, but nothing worked out. But this brought Brian back to the Morgans' attention -- at this point they'd not seen him in three years.\n\nAlan still wanted to record folk music with Brian, and at some point Brian suggested that they get his brother Carl and cousin Mike involved -- and then Brian's mother made him let his other brother Dennis join in.\n\nThe group went to see the Morgans, who once again told them that they needed some original material. Dennis piped up that the group had been fooling around with a song about surfing, and while the Morgans had never heard of the sport, they said it would be worth the group's while finishing off the song and coming back to them.\n\nAt this point, the idea of a song about surfing was something that was only in Dennis' head, though he may have mentioned the idea to Mike at some point. Mike and the Wilsons went home and started working out the song, without Al being involved at this time -- some of the rehearsal recordings we have seem to suggest that they thought Al was a little overbearing and thought of himself as a bit more professional than the others, and they didn't want him in the group at first.\n\nWhile surf music was definitely already a thing, there were very few vocal surf records. Brian and Mike wrote the song together, with Mike writing most of the lyrics and coming up with his own bass vocal line, while Brian wrote the rest of the music:\n\n[Excerpt: The Beach Boys, \"Surfin' (Rehearsal)\"]\n\nNone of the group other than Dennis surfed -- though Mike would later start surfing a little -- and so Dennis provided Mike with some surfing terms that they could add into the song. This led to what would be the first of many, many arguments about songwriting credit among the group, as Dennis claimed that he should get some credit for his contribution, while Mike disagreed:\n\n[Excerpt: The Beach Boys, “Surfin' (Rehearsal)”]\n\nThe credit was eventually assigned to Brian Wilson and Mike Love.\n\nEventually, they finished the song, and decided that they *would* get Al Jardine back into the group after all. When Murry and Audree Wilson went away for a long weekend and left their boys some money for emergencies, the group saw their chance. They took that money, along with some more they borrowed from Al's mother, and rented some instruments -- a drum kit and a stand-up bass. They had a party at the Wilsons' house where they played their new song and a few others, in front of their friends, before going back to the Morgans with their new song completed.\n\nFor their recording session, they used that stand-up bass, which Al played, along with Carl on an acoustic guitar, giving it that Kingston Trio sound that Al liked. Dennis was the group's drummer, but he wasn't yet very good and instead of drums the record has Brian thumping a dustbin lid as its percussion. As well as being the lead vocalist, Mike Love was meant to be the group's saxophone player, but he never progressed more than honking out a couple of notes, and he doesn't play on the session.\n\nThe song they came up with was oddly structured -- it had a nine-bar verse and a fourteen-bar chorus, the latter of which was based around a twelve-bar blues, but extended to allow the \"surf, surf with me\" hook. But other than the unusual bar counts it followed the structure that the group would set up most of their early singles. The song seems at least in part to have been inspired by the song \"Bermuda Shorts\" by the Delroys, which is a song the group have often cited and would play in their earliest live shows:\n\n[Excerpt: The Delroys, \"Bermuda Shorts\"]\n\nThey messed around with the structure in various ways in rehearsal, and those can be heard on the rehearsal recordings, but by the time they came into the studio they'd settled on starting with a brief statement of the chorus hook:\n\n[Excerpt: The Beach Boys, \"Surfin'\"]\n\nIt then goes into a verse with Mike singing a tenor lead, with the rest of the group doing block harmonies and then joining him on the last line of the verse:\n\n[Excerpt: The Beach Boys, \"Surfin'\"]\n\nAnd then we have Mike switching down into the bass register to sing wordless doo-wop bass during the blues-based chorus, while the rest of the group again sing in block harmony:\n\n[Excerpt: The Beach Boys, \"Surfin'\"]\n\nThat formula would be the one that the Beach Boys would stick with for several singles to follow -- the major change that would be made would be that Brian would soon start singing an independent falsetto line over the top of the choruses, rather than being in the block harmonies.\n\nThe single was licensed to Candix Records, along with a B-side written by Bruce Morgan, and it became a minor hit record, reaching number seventy-five on the national charts. But what surprised the group about the record was the name on it. They'd been calling themselves the Pendletones, because there was a brand of thick woollen shirt called Pendletons which was popular among surfers, and which the group wore. &nbsp;It might also have been intended as a pun on Dick Dale's Deltones, the preeminent surf music group of the time. But Hite Morgan had thought the name didn't work, and they needed something that was more descriptive of the music they were doing. He'd suggested The Surfers, but Russ Regan, a record promoter, had told him there was already a group called the Surfers, and suggested another name. So the first time the Wilsons realised they were now in the Beach Boys was when they saw the record label for the first time.\n\nThe group started working on follow-ups -- and as they were now performing live shows to promote their records, they switched to using electric guitars when they went into the studio to record some demos in February 1962. By now, Al was playing rhythm guitar, while Brian took over on bass, now playing a bass guitar rather than the double bass Al had played. For that session, as Dennis was still not that great a drummer, Brian decided to bring in a session player, and Dennis stormed out of the studio. However, the session player was apparently flashy and overplayed, and got paid off. Brian persuaded Dennis to come back and take over on drums again, and the session resumed. Val Poliuto was also at the session, in case they needed some keyboards, but he's not audible on any of the tracks they recorded, at least to my ears.\n\nThe most likely song for a follow-up was another one by Brian and Mike. This one was very much a rewrite of \"Surfin'\", but this time the verses were a more normal eight bars, and the choruses were a compromise between the standard twelve-bar blues and \"Surfin'\"s fourteen, landing on an unusual thirteen bars. With the electric guitars the group decided to bring in a Chuck Berry influence, and you can hear a certain similarity to songs like \"Brown-Eyed Handsome Man\" in the rhythm and phrasing:\n\n[Excerpt: The Beach Boys, \"Surfin' Safari [early version]\"]\n\nAround this time, Brian also wrote another song -- the song he generally describes as being the first song he ever wrote. Presumably, given that he'd already co-written \"Surfin'\", he means that it was the first song he wrote on his own, words and music. The song was inspired, melodically, by the song \"When You Wish Upon A Star\" from the Disney film Pinocchio:\n\n[Excerpt: Cliff Edwards \"When You Wish Upon a Star\"]\n\nThe song came to Brian in the car, and he challenged himself to write the whole thing in his head without going to the piano until he'd finished it. The result was a doo-wop ballad with Four Freshmen-like block harmonies, with lyrics inspired by Brian's then girlfriend Judy Bowles, which they recorded at the same session as that version of “Surfin' Safari”:\n\n[Excerpt: The Beach Boys, \"Surfer Girl [early version]\"]\n\nAt the same session, they also recorded two more songs -- a song by Brian called Judy, and a surf instrumental written by Carl called \"Karate\".\n\nHowever, shortly after that session, Al left the group. As the group had started playing electric instruments, they'd also started performing songs that were more suitable for those instruments, like \"What'd I Say\" and \"The Twist\". Al wasn't a fan of that kind of music, and he wanted to be singing \"Tom Dooley\" and \"Wreck of the John B\", not \"Come on baby, let's do the Twist\". He was also quite keen on completing his university studies -- he was planning on becoming a dentist -- and didn't want to spend time playing tons of small gigs when he could be working towards his degree. This was especially the case since Murry Wilson, who had by this point installed himself as the group's manager, was booking them on all sorts of cheap dates to get them exposure. As far as Al could see, being a Beach Boy was never going to make anyone any real money, and it wasn't worth disrupting his studies to keep playing music that he didn't even particularly like.\n\nHis place was taken by David Marks, Carl's young friend who lived nearby. Marks was only thirteen when he joined, and apparently it caused raised eyebrows among some of the other musicians who knew the group, because he was so much younger and less experienced than the rest. Unlike Al, he was never much of a singer -- he can hold a tune, and has a pleasant enough voice, but he wasn't the exceptional harmony singer that Al was -- but he was a competent rhythm player, and he and Carl had been jamming together since they'd both got guitars, and knew each other's playing style.\n\nHowever, while Al was gone from the group, he wasn't totally out of the picture, and he remained close enough that he was a part of the first ever Beach Boys spin-off side project a couple of months later. Dorinda Morgan had written a song inspired by the new children's doll, Barbie, that had come out a couple of years before and which, like the Beach Boys, was from Hawthorne. She wanted to put together a studio group to record it, under the name Kenny and the Cadets, and Brian rounded up Carl, Al, Val Poliuto, and his mother Audree, to sing on the record for Mrs Morgan:\n\n[Excerpt: Kenny and the Cadets, \"Barbie\"]\n\nBut after that, Al Jardine was out of the group for the moment -- though he would be back sooner than anyone expected.\n\nShortly after Al left, the new lineup went into a different studio, Western Studios, to record a new demo. Ostensibly produced by Murry Wilson, the session was actually produced by Brian and his new friend Gary Usher, who took charge in the studio and spent most of his time trying to stop Murry interfering.\n\nGary Usher is someone about whom several books have been written, and who would have a huge influence on West Coast music in the sixties. But at this point he was an aspiring singer, songwriter, and record producer, who had been making records for a few months longer than Brian and was therefore a veteran. He'd put out his first single, \"Driven Insane\", in March 1961:\n\n[Excerpt: Gary Usher, \"Driven Insane\"]\n\nUsher was still far from a success, but he was very good at networking, and had all sorts of minor connections within the music business. As one example, his girlfriend, Sandra Glanz, who performed under the name Ginger Blake, had just written \"You Are My Answer\" for Carol Connors, who had been the lead singer of the Teddy Bears but was now going solo:\n\n[Excerpt: Carol Connors, \"You Are My Answer\"]\n\nConnors, too, would soon become important in vocal surf music, while Ginger would play a significant part in Brian's life.\n\nBrian had started writing songs with Gary, and they were in the studio to record some demos by Gary, and some demos by the Beach Boys of songs that Brian and Gary had written together, along with a new version of \"Surfin' Safari\". Of the two Wilson/Usher songs recorded in the session, one was a slow doo-wop styled ballad called \"The Lonely Sea\", which would later become an album track, but the song that they were most interested in recording was one called \"409\", which had been inspired by a new, larger, engine that Chevrolet had introduced for top-of-the-line vehicles.\n\nMusically, \"409\" was another song that followed the \"Surfin' Safari\" formula, but it was regularised even more, lopping off the extra bar from \"Surfin' Safari\"'s chorus, and making the verses as well as the choruses into twelve-bar blues. But it still started with the hook, still had Mike sing his tenor lead in the verses, and still had him move to sing a boogie-ish bassline in the chorus while the rest of the group chanted in block harmonies over the top.\n\nBut it introduced a new lyrical theme to the group -- now, as well as singing about surfing and the beach, they could also sing about cars and car racing -- Love credits this as being one of the main reasons for the group's success in landlocked areas, because while there were many places in the US where you couldn't surf, there was nowhere where people didn't have cars.\n\nIt's also the earliest Beach Boys song over which there is an ongoing question of credit. For the first thirty years of the song's existence, it was credited solely to Wilson and Usher, but in the early nineties Love won a share of the songwriting credit in a lawsuit in which he won credit on many, many songs he'd not been credited for.\n\nLove claims that he came up with the \"She's real fine, my 409\" hook, and the \"giddy up\" bass vocal he sang. Usher always claimed that Love had nothing to do with the song, and that Love was always trying to take credit for things he didn't do. It's difficult to tell who was telling the truth, because both obviously had a financial stake in the credit (though Usher was dead by the time of the lawsuit). Usher was always very dismissive of all of the Beach Boys with the exception of Brian, and wouldn't credit them for making any real contributions, Love's name was definitely missed off the credits of a large number of songs to which he did make substantial contributions, including some where he wrote the whole lyric, and the bits of the song Love claims *do* sound like the kind of thing he contributed to other songs which have no credit disputes. On the other hand, Love also overreached in his claims of credit in that lawsuit, claiming to have co-written songs that were written when he wasn't even in the same country as the writers.\n\nWhere you stand on the question of whether Love deserves that credit usually depends on your views of Wilson, Love and Usher as people, and it's not a question I'm going to get into, but I thought I should acknowledge that the question is there.\n\nWhile \"409\" was still following the same pattern as the other songs, it's head and shoulders ahead of the Hite Morgan productions both in terms of performance and in terms of the sound. A great deal of that clearly owes to Usher, who was experimenting with things like sound effects, and so \"409\" starts with a recording that Brian and Usher made of Usher's car driving up and down the street:\n\n[Excerpt: The Beach Boys, \"409\"]\n\nMeanwhile the new version of \"Surfin' Safari\" was vastly superior to the recording from a couple of months earlier, with changed lyrics and a tighter performance:\n\n[Excerpt: The Beach Boys, \"Surfin' Safari (second version)\"]\n\nSo at the end of the session, the group had a tape of three new songs, and Murry WIlson wanted them to take it somewhere better than Candix Records. He had a contact somewhere much better -- at Capitol Records. He was going to phone Ken Nelson.\n\nOr at least, Murry *thought* he had a contact at Capitol. He phoned Ken Nelson and told him \"Years ago, you did me a favour, and now I'm doing one for you. My sons have formed a group and you have the chance to sign them!\"\n\nNow, setting aside the question of whether that would actually count as Murry doing Nelson a favour, there was another problem with this -- Nelson had absolutely no idea who Murry Wilson was, and no recollection of ever doing him a favour. It turned out that the favour he'd done, in Murry's eyes, was recording one of Murry's songs -- except that there's no record of Nelson ever having been involved in a recording of a Murry Wilson song.\n\nBy this time, Capitol had three A&R people, in charge of different areas. There was Voyle Gilmore, who recorded soft pop -- people like Nat \"King\" Cole. There was Nelson, who as we've seen in past episodes had some rockabilly experience but was mostly country -- he'd produced Gene Vincent and Wanda Jackson, but he was mostly working at this point with people like Buck Owens and the Louvin Brothers, producing some of the best country music ever recorded, but not really doing the kind of thing that the Beach Boys were doing.\n\nBut the third, and youngest, A&R man was doing precisely the kind of thing the Beach Boys did. That was Nik Venet, who we met back in the episode on \"LSD-25\", and who was one of the people who had been involved with the very first surf music recordings. Nelson suggested that Murry go and see Venet, and Venet was immediately impressed with the tape Murry played him -- so impressed that he decided to offer the group a contract, and to release \"Surfin' Safari\" backed with \"409\", buying the masters from Murry rather than rerecording them. Venet also tried to get the publishing rights for the songs for Beechwood Music, a publishing company owned by Capitol's parent company EMI (and known in the UK as Ardmore & Beechwood) but Gary Usher, who knew a bit about the business, said that he and Brian were going to set up their own publishing companies -- a decision which Murry Wilson screamed at him for, but which made millions of dollars for Brian over the next few years.\n\nThe single came out, and was a big hit, making number fourteen on the hot one hundred, and \"409\" as the B-side also scraped the lower reaches of the charts. Venet soon got the group into the studio to record an album to go with the single, with Usher adding extra backing vocals to fill out the harmonies in the absence of Al Jardine. While the Beach Boys were a self-contained group, Venet seems to have brought in his old friend Derry Weaver to add extra guitar, notably on Weaver's song \"Moon Dawg\":\n\n[Excerpt: The Beach Boys, \"Moon Dawg\"]\n\nIt's perhaps unsurprising that the Beach Boys recorded that, because not only was it written by Venet's friend, but Venet owned the publishing on the song. The group also recorded \"Summertime Blues\", which was co-written by Jerry Capehart, a friend of Venet and Weaver's who also may have appeared on the album in some capacity. Both those songs fit the group, but their choice was clearly influenced by factors other than the purely musical, and very soon Brian Wilson would get sick of having his music interfered with by Venet.\n\nThe album came out on October 1, and a few days later the single was released in the UK, several months after its release in the US. And on the same day, a British group who *had* signed to have their single published by Ardmore & Beechwood put out their own single on another EMI label. And we're going to look at that in the next episode...",
  "itunes:subtitle": "This week there are&nbsp;two episiodes of the podcast going up, both of them longer than normal. This one, episode ninety-nine, is on Surfin Safari by the Beach Boys, and the groups roots in LA, and is fifty minutes long. Click the full post to read line",
  "itunes:keywords": "Ardmore and Beechwood,Art Laboe,Brian Wilson,Capitol Records,Derry Weaver,doo wop,folk music,Gary Usher,Gaynel Hodge,Hollywood Flames,Jerry Capehart,Ken Nelson,Louis Jordan,Murry Wilson,Nik Venet,surf music,The Beach Boys,vocal groups,Walker Brothers",
  "itunes:episodeType": "full",
  "itunes:episode": 99,
  "content:encoded": "This week there are&nbsp;<em>two</em> episiodes of the podcast going up, both of them longer than normal. This one, episode ninety-nine, is on \"Surfin' Safari\" by the Beach Boys, and the group's roots in LA, and is fifty minutes long. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,<a href=\"https://www.patreon.com/posts/42023843\"> on \"Misirlou\" by Dick Dale and the Deltones</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nNo Mixclouds this week, as both episodes have far too many songs by one artist. The mixclouds will be back with episode 101.\n\nI used many resources for this episode, most of which will be used in future Beach Boys episodes too. It's difficult to enumerate everything here, because I have been an active member of the Beach Boys fan community for twenty-three years, and have at times just used my accumulated knowledge for this. But the resources I list here are ones I've checked for specific things.\n\n<a href=\"https://amzn.to/3i21aaf\"><em>Becoming the Beach Boys</em> by James B. Murphy</a> is an in-depth look at the group's early years.\n\nStephen McParland has published many, many books on the California surf and hot-rod music scenes, including several on both the Beach Boys and Gary Usher.&nbsp;<em>The Beach Boys: Inception and Creation</em> is the one I used most here, but I referred to several. His books can be found at <a href=\"https://payhip.com/CMusicBooks\">https://payhip.com/CMusicBooks</a>\n\nAndrew Doe's <a href=\"http://www.bellagio10452.com/\">Bellagio 10452 </a>site is an invaluable resource.\n\nJon Stebbins' <a href=\"https://amzn.to/2S0eQIs\">The Beach Boys FAQ </a>is a good balance between accuracy and readability.\n\nAnd <a href=\"https://amzn.to/3i22CcH\">Philip Lambert's&nbsp;<em>Inside the Music of Brian Wilson</em></a> is an excellent, though sadly out of print, musicological analysis of Wilson's music from 1962 through 67.\n\nThe Beach Boys' Morgan recordings and all the outtakes from them can be found on <a href=\"https://amzn.to/3cEitNG\">this 2-CD set.</a>\n\nThe&nbsp;<em>Surfin' Safari</em> album is now in the public domain, and so can be found cheaply, but the best version to get is still <a href=\"https://amzn.to/2G6Vw9I\">the twofer CD with the&nbsp;<em>Surfin' USA&nbsp;</em></a><a href=\"https://amzn.to/2G6Vw9I\">album</a>.\n\n*But*, those two albums are fairly weak, the Beach Boys in their early years were not really an album band, and you&nbsp;<em>will</em> want to investigate them further. I would recommend, rather than the two albums linked above, starting with <a href=\"https://amzn.to/3i0tsC9\">this budget-priced three-CD set</a>, which has a surprisingly good selection of their material on it.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday, there are going to be two podcast episodes. This one, episode ninety-nine, will be a normal-length episode, or maybe slightly longer than normal, and episode one hundred, which will follow straight after it, will be a super-length one that's at least three times the normal length of one of these podcasts.\n\nI'm releasing them together, because the two episodes really do go together. We've talked recently about how we're getting into the sixties of the popular imagination, and those 1960s began, specifically, in October 1962. That was the month of the Cuban Missile Crisis, which saw the world almost end. It was the month that James Brown released Live at the Apollo -- an album we'll talk about in a few weeks' time. And if you want one specific date that the 1960s started, it was October the fifth, 1962.\n\nOn that date, a film came out that we mentioned last week -- Doctor No, the first ever James Bond film. It was also the date that two records were released on EMI in Britain. One was a new release by a British band, the other a record originally released a few months earlier in the USA, by an American band. Both bands had previously released records on much smaller labels, to no success other than very locally, but this was their first to be released on a major label, and had a slightly different lineup from those earlier releases. Both bands would influence each other, and go on to be the most successful band from their respective country in the next decade. Both bands would revolutionise popular music. And the two bands would even be filed next to each other alphabetically, both starting \"the Bea\". In episode one hundred, we're going to look at \"Love Me Do\" by the Beatles, but right now, in episode ninety-nine, we're going to look at \"Surfin' Safari\" by the Beach Boys:\n\n[Excerpt: The Beach Boys, \"Surfin' Safari\"]\n\nBefore I start this story properly, I just want to say something -- there are a lot of different accounts of the formation of the Beach Boys, and those accounts are all different. What I've tried to do here is take one plausible account of how the group formed and tell it in a reasonable length of time. If you read the books I link in the show notes, you might find some disagreements about the precise order of some of these events, or some details I've glossed over. This episode is already running long, and I didn't want to get into that stuff, but it's important that I stress that this is just as accurate as I can get in the length of an episode.\n\nThe Beach Boys really were boys when they made their first records. David Marks, their youngest member, was only thirteen when \"Surfin' Safari\" came out, and Mike Love, the group's oldest member, was twenty-one.\n\nSo, as you might imagine when we're talking about children, the story really starts with the older generation. In particular, we want to start with Hite and Dorinda Morgan. The Morgans were part-time music business people in Los Angeles in the fifties. Hite Morgan owned an industrial flooring company, and that was his main source of income -- putting in floors at warehouses and factories that could withstand the particular stresses that such industrial sites faced.\n\nBut while that work was hard, it was well-paying and didn't take too much time. The company would take on two or three expensive jobs a year, and for the rest of the year Hite would have the money and time to help his wife with her work as a songwriter. She'd collaborated with Spade Cooley, one of the most famous Western Swing musicians of the forties, and she'd also co-written \"Don't Put All Your Dreams in One Basket\" for Ray Charles in 1948:\n\n[Excerpt: Ray Charles, \"Don't Put All Your Dreams in One Basket\"]\n\nHite and Dorinda's son, Bruce, was also a songwriter, though I've seen some claims that often the songs credited to him were actually written by his mother, who gave him credits in order to encourage him. One of Bruce Morgan's earliest songs was a piece called \"Proverb Boogie\", which was actually credited under his father's name, and which Louis Jordan retitled to \"Heed My Warning\" and took a co-writing credit on:\n\n[Excerpt: Louis Jordan, \"Heed My Warning\"]\n\nEventually the Morgans also started their own publishing company, and built their own small demo studio, which they used to use to record cheap demos for many other songwriters and performers.\n\nThe Morgans were only very minor players in the music industry, but they were friendly with many of the big names on the LA R&B scene, and knew people like John Dolphin, Bumps Blackwell, Sam Cooke, and the Hollywood Flames. Bruce Morgan would talk in interviews about Bumps Blackwell calling round to see his father and telling him about this new song \"You Send Me\" he was going to record with Cooke.\n\nBut although nobody could have realised it at the time, or for many years later, the Morgans' place in music history would be cemented in 1952, when Hite Morgan, working at his day job, met a man named Murry Wilson, who ran a machine-tool company based in Hawthorne, a small town in southwestern Los Angeles County. It turned out that Wilson, like Dorinda Morgan, was an aspiring songwriter, and Hite Morgan signed him up to their publishing company, Guild Music.\n\nWilson's tastes in music were already becoming old-fashioned even in the very early 1950s, but given the style of music he was working in he was a moderately talented writer. His proudest moment was writing a song called \"Two Step Side Step\" for the Morgans, which was performed on TV by Lawrence Welk -- Murry gathered the whole family round the television to watch his song being performed.\n\nThat song was a moderate success – it was never a hit for anyone, but it was recorded by several country artists, including the rockabilly singer Bonnie Lou, and most interestingly for our purposes by Johnny Lee Wills, Bob Wills' brother:\n\n[Excerpt: Johnny Lee Wills, \"Two Step Side Step\"]\n\nWilson wrote a few other songs for the Morgans, of which the most successful was \"Tabarin\", which was recorded by the Tangiers -- one of the several names under which the Hollywood Flames performed. Gaynel Hodge would later speak fondly of Murry Wilson, and how he was always bragging about his talented kids:\n\n[Excerpt: The Tangiers, \"Tabarin\"]\n\nBut as the fifties progressed, the Morgans published fewer and fewer of Wilson's songs, and none of them were hits. But the Morgans and Wilson stayed in touch, and around 1958 he heard from them about an opportunity for one of those talented kids.\n\nDorinda Morgan had written a song called \"Chapel of Love\" -- not the same song as the famous one by the Dixie Cups -- and Art Laboe had decided that that song would be perfect as the first record for his new label, Original Sound. Laboe was putting together a new group to sing it, called the Hitmakers, which was based around Val Poliuto. Poliuto had been the tenor singer of an integrated vocal group -- two Black members, one white, and one Hispanic -- which had gone by the names The Shadows and The Miracles before dismissing both names as being unlikely to lead to any success and taking the name The Jaguars at the suggestion of, of all people, Stan Freberg, the comedian and voice actor.\n\nThe Jaguars had never had much commercial success, but they'd recorded a version of \"The Way You Look Tonight\" which became a classic when Laboe included it on the massively successful \"Oldies But Goodies\", the first doo-wop nostalgia album:\n\n[Excerpt: The Jaguars, \"The Way You Look Tonight\"]\n\nThe Jaguars continued for many years, and at one point had Richard Berry guest as an extra vocalist on some of their tracks, but as with so many of the LA vocal groups we've looked at from the fifties, they all had their fingers in multiple pies, and so Poliuto was to be in this new group, along with Bobby Adams of the Calvanes, who had been taught to sing R&B by Cornell Gunter and who had recorded for Dootsie Williams:\n\n[Excerpt: The Calvanes, \"Crazy Over You\"]\n\nThose two were to be joined by two other singers, who nobody involved can remember much about except that their first names were Don and Duke, but Art Laboe also wanted a new young singer to sing the lead, and was auditioning singers. Murry Wilson suggested to the Morgans that his young son Brian might be suitable for the role, and he auditioned, but Laboe thought he was too young, and the role went to a singer called Rodney Goodens instead:\n\n[Excerpt: The Hitmakers, \"Chapel of Love\"]\n\nSo the audition was a failure, but it was a first contact between Brian Wilson and the Morgans, and also introduced Brian to Val Poliuto, from whom he would learn a lot about music for the next few years.\n\nBrian was a very sensitive kid, the oldest of three brothers, and someone who seemed to have some difficulty dealing with other people -- possibly because his father was abusive towards him and his brothers, leaving him frightened of many aspects of life. He did, though, share with his father a love of music, and he had a remarkable ear -- singular, as he's deaf in one ear. He had perfect pitch, a great recollection for melodies -- play him something once and it would stay in his brain -- and from a very young age he gravitated towards sweet-sounding music. He particularly loved Glenn Miller's version of \"Rhapsody in Blue\" as a child:\n\n[Excerpt: The Glenn Miller Orchestra, \"Rhapsody in Blue\"]\n\nBut his big musical love was a modern harmony group called the Four Freshmen -- a group made up of two brothers, their cousin, and a college friend. Modern harmony is an outdated term, but it basically meant that they were singing chords that went beyond the normal simple triads of most pop music. While there were four, obviously, of the Four Freshmen, they often achieved an effect that would normally be five-part harmony, by having the group members sing all the parts of the chord *except* the root note -- they'd leave the root note to a bass instrument. So while Brian was listening to four singers, he was learning five-part harmonies. The group would also sing their harmonies in unusual inversions -- they'd take one of the notes from the middle of the chord and sing it an octave lower.\n\nThere was another trick that the Four Freshmen used -- they varied their vocals from equal temperament.\n\nTo explain this a little bit -- musical notes are based on frequencies, and the ratio between them matters. If you double the frequency of a note, you get the same note an octave up -- so if you take an A at 440hz, and double the frequency to 880, you get another A, an octave up. If you go down to 220hz, you get the A an octave below.\n\nYou get all the different notes by multiplying or dividing a note, so A# is A multiplied by a tiny bit more than one, and A flat is A multiplied by a tiny bit less than one. But in the middle ages, this hit a snag -- A#. which is A multiplied by one and a bit, is very very slightly different from B flat, which is B multiplied by 0.9 something. And if you double those, so you go to the A# and B flat the next octave up, the difference between A# and B flat gets bigger. And this means that if you play a melody in the key of C, but then decide you want to play it in the key of B flat, you need to retune your instrument -- or have instruments with separate notes for A# and B flat -- or everything will sound out of tune.\n\nIt's very very hard to retune some instruments, especially ones like the piano, and also sometimes you want to play in different keys in the same piece. If you're playing a song in C, but it goes into C# in the last chorus to give it a bit of extra momentum, you lose that extra momentum if you stop the song to retune the piano. So a different system was invented, and popularised in the Baroque era, called \"equal temperament\". In that system, every note is very very slightly out of tune, but those tiny errors cancel out rather than multiply like they do in the old system. You're sort of taking the average of A# and B flat, and calling them the same note. And to most people's ears that sounds good enough, and it means you can have a piano without a thousand keys.\n\nBut the Four Freshmen didn't stick to that -- because you don't need to retune your throat to hit different notes (unless you're as bad a singer as me, anyway). They would sing B flat slightly differently than they would sing A#, and so they would get a purer vocal blend, with stronger harmonic overtones than singers who were singing the notes as placed on a piano:\n\n[Excerpt: the Four Freshmen, \"It's a Blue World\"]\n\nPlease note by the way that I'm taking the fact that they used those non-equal temperaments somewhat on trust -- Ross Barbour of the group said they did in interviews, and he would know, but I have relatively poor pitch so if you listened to that and thought \"Hang on, they're all singing dead-on equal tempered concert pitch, what's he talking about?\", then that's on him.\n\nWhen Brian heard them singing, he instantly fell for them, and became a major, major fan of their work, especially their falsetto singer Bob Flanigan, whose voice he decided to emulate. He decided that he was going to learn how they got that sound. Every day when he got home from school, he would go to the family's music room, where he had a piano and a record player. He would then play just a second or so of one of their records, and figure out on the piano what notes they were singing in that one second, and duplicating them himself. Then he would learn the next second of the song. He would spend hours every day on this, learning every vocal part, until he had the Four Freshmen's entire repertoire burned into his brain, and could sing all four vocal parts to every song.\n\nIndeed, at one point when he was about sixteen -- around the same time as the Art Laboe audition -- Brian decided to go and visit the Four Freshmen's manager, to find out how to form a successful vocal group of his own, and to find out more about the group themselves. After telling the manager that he could sing every part of every one of their songs, the manager challenged him with \"The Day Isn't Long Enough\", a song that they apparently had trouble with:\n\n[Excerpt: The Four Freshmen, \"The Day Isn't Long Enough\"]\n\nAnd Brian demonstrated every harmony part perfectly. He had a couple of tape recorders at home, and he would experiment with overdubbing his own voice -- recording on one tape recorder, playing it back and singing along while recording on the other. Doing this he could do his own imitations of the Four Freshmen, and even as a teenager he could sound spookily like them:\n\n[Excerpt: The Beach Boys [Brian Wilson solo recording released on a Beach Boys CD], \"Happy Birthday Four Freshmen\"]\n\nWhile Brian shared his love for this kind of sweet music with his father, he also liked the rock and roll music that was making its way onto the radio during his teen years -- though again, he would gravitate towards the sweet vocal harmonies of the Everly Brothers rather than to more raucous music.\n\nHe shared his love of the Everlys with his cousin Mike Love, whose tastes otherwise went more in the direction of R&B and doo-wop. Unlike Brian and his brothers, Mike attended Dorsey High School, a predominantly Black school, and his tastes were shaped by that -- other graduates of the school include Billy Preston, Eric Dolphy, and Arthur Lee, to give some idea of the kind of atmosphere that Dorsey High had. He loved the Robins, and later the Coasters, and he's been quoted as saying he \"worshipped\" Johnny Otis -- as did every R&B lover in LA at the time. He would listen to Otis' show on KFOX, and to Huggy Boy on KRKD. His favourite records were things like \"Smokey Joe's Cafe\" by the Robins, which combined an R&B groove with witty lyrics:\n\n[Excerpt: The Robins, \"Smokey Joe's Cafe\"]\n\nHe also loved the music of Chuck Berry, a passion he shared with Brian's youngest brother Carl, who also listened to Otis' show and got Brian listening to it. While Mike was most attracted to Berry's witty lyrics, Carl loved the guitar part -- he'd loved string instruments since he was a tiny child, and he and a neighbour, David Marks, started taking guitar lessons from another neighbour, John Maus. Maus had been friends with Ritchie Valens, and had been a pallbearer at Valens' funeral. John was recording at the time with his sister Judy, as the imaginatively-named duo \"John & Judy\":\n\n[Excerpt: John & Judy, \"Why This Feeling?\"]\n\nJohn and Judy later took on a bass player called Scott Engel, and a few years after that John and Scott changed their surnames to Walker and became two thirds of The Walker Brothers.\n\nBut at this time, John was still just a local guitar player, and teaching two enthusiastic kids to play guitar. Carl and David learned how to play Chuck Berry licks, and also started to learn some of the guitar instrumentals that were becoming popular at the time.\n\nAt the same time, Mike would sing with Brian to pass the time, Mike singing in a bass voice while Brian took a high tenor lead. Other times, Brian would test his vocal arranging out by teaching Carl and his mother Audree vocal parts -- Carl got so he could learn parts very quickly, so his big brother wouldn't keep him around all day and he could go out and play. And sometimes their middle brother Dennis would join in -- though he was more interested in going out and having fun at the beach than he was in making music.\n\nBrian was interested in nothing *but* making music -- at least once he'd quit the school football team (American football, for those of you like me who parse the word to mean what it does in Britain), after he'd got hurt for the first time. But before he did that, he had managed to hurt someone else -- a much smaller teammate named Alan Jardine, whose leg Brian broke in a game. Despite that, the two became friends, and would occasionally sing together -- like Brian, Alan loved to sing harmonies, and they found that they had an extraordinarily good vocal blend. While Brian mostly sang with his brothers and his cousin, all of whom had a family vocal resemblance, Jardine could sound spookily similar to that family, and especially to Brian. Jardine's voice was a little stronger and more resonant, Brian's a little sweeter, with a fuller falsetto, but they had the kind of vocal similarity one normally only gets in family singers.\n\nHowever, &nbsp;they didn't start performing together properly, because they had different tastes in music -- while Brian was most interested in the modern jazz harmonies of the Four Freshman, Jardine was a fan of the new folk revival groups, especially the Kingston Trio. Alan had a group called the Tikis when he was at high school, which would play Kingston Trio style material like \"The Wreck of the John B\", a song that like much of the Kingston Trio's material had been popularised by the Weavers, but which the Trio had recorded for their first album:\n\n[Excerpt: The Kingston Trio, \"The Wreck of the John B\"]\n\nJardine was inspired by that to write his own song, \"The Wreck of the Hesperus\", putting Longfellow's poem to music. One of the other Tikis had a tape recorder, and they made a few stabs at recording it. They thought that they sounded pretty good, and they decided to go round to Brian Wilson's house to see if he could help them -- depending on who you ask, they either wanted him to join the band, or knew that his dad had some connection with the music business and wanted to pick his brains. When they turned up, Brian was actually out, but Audree Wilson basically had an open-door policy for local teenagers, and she told the boys about Hite and Dorinda Morgan. The Tikis took their tape to the Morgans, and the Morgans responded politely, saying that they did sound good -- but they sounded like the Kingston Trio, and there were a million groups that sounded like the Kingston Trio. They needed to get an original sound.\n\nThe Tikis broke up, as Alan went off to Michigan to college. But then a year later, he came back to Hawthorne and enrolled in the same community college that Brian was enrolled in. Meanwhile, the Morgans had got in touch with Gary Winfrey, Alan's Tikis bandmate, and asked him if the Tikis would record a demo of one of Bruce Morgan's songs. As the Tikis no longer existed, Alan and Gary formed a new group along the same lines, and invited Brian to be part of one of these sessions. That group, The Islanders made a couple of attempts at Morgan's song, but nothing worked out. But this brought Brian back to the Morgans' attention -- at this point they'd not seen him in three years.\n\nAlan still wanted to record folk music with Brian, and at some point Brian suggested that they get his brother Carl and cousin Mike involved -- and then Brian's mother made him let his other brother Dennis join in.\n\nThe group went to see the Morgans, who once again told them that they needed some original material. Dennis piped up that the group had been fooling around with a song about surfing, and while the Morgans had never heard of the sport, they said it would be worth the group's while finishing off the song and coming back to them.\n\nAt this point, the idea of a song about surfing was something that was only in Dennis' head, though he may have mentioned the idea to Mike at some point. Mike and the Wilsons went home and started working out the song, without Al being involved at this time -- some of the rehearsal recordings we have seem to suggest that they thought Al was a little overbearing and thought of himself as a bit more professional than the others, and they didn't want him in the group at first.\n\nWhile surf music was definitely already a thing, there were very few vocal surf records. Brian and Mike wrote the song together, with Mike writing most of the lyrics and coming up with his own bass vocal line, while Brian wrote the rest of the music:\n\n[Excerpt: The Beach Boys, \"Surfin' (Rehearsal)\"]\n\nNone of the group other than Dennis surfed -- though Mike would later start surfing a little -- and so Dennis provided Mike with some surfing terms that they could add into the song. This led to what would be the first of many, many arguments about songwriting credit among the group, as Dennis claimed that he should get some credit for his contribution, while Mike disagreed:\n\n[Excerpt: The Beach Boys, “Surfin' (Rehearsal)”]\n\nThe credit was eventually assigned to Brian Wilson and Mike Love.\n\nEventually, they finished the song, and decided that they *would* get Al Jardine back into the group after all. When Murry and Audree Wilson went away for a long weekend and left their boys some money for emergencies, the group saw their chance. They took that money, along with some more they borrowed from Al's mother, and rented some instruments -- a drum kit and a stand-up bass. They had a party at the Wilsons' house where they played their new song and a few others, in front of their friends, before going back to the Morgans with their new song completed.\n\nFor their recording session, they used that stand-up bass, which Al played, along with Carl on an acoustic guitar, giving it that Kingston Trio sound that Al liked. Dennis was the group's drummer, but he wasn't yet very good and instead of drums the record has Brian thumping a dustbin lid as its percussion. As well as being the lead vocalist, Mike Love was meant to be the group's saxophone player, but he never progressed more than honking out a couple of notes, and he doesn't play on the session.\n\nThe song they came up with was oddly structured -- it had a nine-bar verse and a fourteen-bar chorus, the latter of which was based around a twelve-bar blues, but extended to allow the \"surf, surf with me\" hook. But other than the unusual bar counts it followed the structure that the group would set up most of their early singles. The song seems at least in part to have been inspired by the song \"Bermuda Shorts\" by the Delroys, which is a song the group have often cited and would play in their earliest live shows:\n\n[Excerpt: The Delroys, \"Bermuda Shorts\"]\n\nThey messed around with the structure in various ways in rehearsal, and those can be heard on the rehearsal recordings, but by the time they came into the studio they'd settled on starting with a brief statement of the chorus hook:\n\n[Excerpt: The Beach Boys, \"Surfin'\"]\n\nIt then goes into a verse with Mike singing a tenor lead, with the rest of the group doing block harmonies and then joining him on the last line of the verse:\n\n[Excerpt: The Beach Boys, \"Surfin'\"]\n\nAnd then we have Mike switching down into the bass register to sing wordless doo-wop bass during the blues-based chorus, while the rest of the group again sing in block harmony:\n\n[Excerpt: The Beach Boys, \"Surfin'\"]\n\nThat formula would be the one that the Beach Boys would stick with for several singles to follow -- the major change that would be made would be that Brian would soon start singing an independent falsetto line over the top of the choruses, rather than being in the block harmonies.\n\nThe single was licensed to Candix Records, along with a B-side written by Bruce Morgan, and it became a minor hit record, reaching number seventy-five on the national charts. But what surprised the group about the record was the name on it. They'd been calling themselves the Pendletones, because there was a brand of thick woollen shirt called Pendletons which was popular among surfers, and which the group wore. &nbsp;It might also have been intended as a pun on Dick Dale's Deltones, the preeminent surf music group of the time. But Hite Morgan had thought the name didn't work, and they needed something that was more descriptive of the music they were doing. He'd suggested The Surfers, but Russ Regan, a record promoter, had told him there was already a group called the Surfers, and suggested another name. So the first time the Wilsons realised they were now in the Beach Boys was when they saw the record label for the first time.\n\nThe group started working on follow-ups -- and as they were now performing live shows to promote their records, they switched to using electric guitars when they went into the studio to record some demos in February 1962. By now, Al was playing rhythm guitar, while Brian took over on bass, now playing a bass guitar rather than the double bass Al had played. For that session, as Dennis was still not that great a drummer, Brian decided to bring in a session player, and Dennis stormed out of the studio. However, the session player was apparently flashy and overplayed, and got paid off. Brian persuaded Dennis to come back and take over on drums again, and the session resumed. Val Poliuto was also at the session, in case they needed some keyboards, but he's not audible on any of the tracks they recorded, at least to my ears.\n\nThe most likely song for a follow-up was another one by Brian and Mike. This one was very much a rewrite of \"Surfin'\", but this time the verses were a more normal eight bars, and the choruses were a compromise between the standard twelve-bar blues and \"Surfin'\"s fourteen, landing on an unusual thirteen bars. With the electric guitars the group decided to bring in a Chuck Berry influence, and you can hear a certain similarity to songs like \"Brown-Eyed Handsome Man\" in the rhythm and phrasing:\n\n[Excerpt: The Beach Boys, \"Surfin' Safari [early version]\"]\n\nAround this time, Brian also wrote another song -- the song he generally describes as being the first song he ever wrote. Presumably, given that he'd already co-written \"Surfin'\", he means that it was the first song he wrote on his own, words and music. The song was inspired, melodically, by the song \"When You Wish Upon A Star\" from the Disney film Pinocchio:\n\n[Excerpt: Cliff Edwards \"When You Wish Upon a Star\"]\n\nThe song came to Brian in the car, and he challenged himself to write the whole thing in his head without going to the piano until he'd finished it. The result was a doo-wop ballad with Four Freshmen-like block harmonies, with lyrics inspired by Brian's then girlfriend Judy Bowles, which they recorded at the same session as that version of “Surfin' Safari”:\n\n[Excerpt: The Beach Boys, \"Surfer Girl [early version]\"]\n\nAt the same session, they also recorded two more songs -- a song by Brian called Judy, and a surf instrumental written by Carl called \"Karate\".\n\nHowever, shortly after that session, Al left the group. As the group had started playing electric instruments, they'd also started performing songs that were more suitable for those instruments, like \"What'd I Say\" and \"The Twist\". Al wasn't a fan of that kind of music, and he wanted to be singing \"Tom Dooley\" and \"Wreck of the John B\", not \"Come on baby, let's do the Twist\". He was also quite keen on completing his university studies -- he was planning on becoming a dentist -- and didn't want to spend time playing tons of small gigs when he could be working towards his degree. This was especially the case since Murry Wilson, who had by this point installed himself as the group's manager, was booking them on all sorts of cheap dates to get them exposure. As far as Al could see, being a Beach Boy was never going to make anyone any real money, and it wasn't worth disrupting his studies to keep playing music that he didn't even particularly like.\n\nHis place was taken by David Marks, Carl's young friend who lived nearby. Marks was only thirteen when he joined, and apparently it caused raised eyebrows among some of the other musicians who knew the group, because he was so much younger and less experienced than the rest. Unlike Al, he was never much of a singer -- he can hold a tune, and has a pleasant enough voice, but he wasn't the exceptional harmony singer that Al was -- but he was a competent rhythm player, and he and Carl had been jamming together since they'd both got guitars, and knew each other's playing style.\n\nHowever, while Al was gone from the group, he wasn't totally out of the picture, and he remained close enough that he was a part of the first ever Beach Boys spin-off side project a couple of months later. Dorinda Morgan had written a song inspired by the new children's doll, Barbie, that had come out a couple of years before and which, like the Beach Boys, was from Hawthorne. She wanted to put together a studio group to record it, under the name Kenny and the Cadets, and Brian rounded up Carl, Al, Val Poliuto, and his mother Audree, to sing on the record for Mrs Morgan:\n\n[Excerpt: Kenny and the Cadets, \"Barbie\"]\n\nBut after that, Al Jardine was out of the group for the moment -- though he would be back sooner than anyone expected.\n\nShortly after Al left, the new lineup went into a different studio, Western Studios, to record a new demo. Ostensibly produced by Murry Wilson, the session was actually produced by Brian and his new friend Gary Usher, who took charge in the studio and spent most of his time trying to stop Murry interfering.\n\nGary Usher is someone about whom several books have been written, and who would have a huge influence on West Coast music in the sixties. But at this point he was an aspiring singer, songwriter, and record producer, who had been making records for a few months longer than Brian and was therefore a veteran. He'd put out his first single, \"Driven Insane\", in March 1961:\n\n[Excerpt: Gary Usher, \"Driven Insane\"]\n\nUsher was still far from a success, but he was very good at networking, and had all sorts of minor connections within the music business. As one example, his girlfriend, Sandra Glanz, who performed under the name Ginger Blake, had just written \"You Are My Answer\" for Carol Connors, who had been the lead singer of the Teddy Bears but was now going solo:\n\n[Excerpt: Carol Connors, \"You Are My Answer\"]\n\nConnors, too, would soon become important in vocal surf music, while Ginger would play a significant part in Brian's life.\n\nBrian had started writing songs with Gary, and they were in the studio to record some demos by Gary, and some demos by the Beach Boys of songs that Brian and Gary had written together, along with a new version of \"Surfin' Safari\". Of the two Wilson/Usher songs recorded in the session, one was a slow doo-wop styled ballad called \"The Lonely Sea\", which would later become an album track, but the song that they were most interested in recording was one called \"409\", which had been inspired by a new, larger, engine that Chevrolet had introduced for top-of-the-line vehicles.\n\nMusically, \"409\" was another song that followed the \"Surfin' Safari\" formula, but it was regularised even more, lopping off the extra bar from \"Surfin' Safari\"'s chorus, and making the verses as well as the choruses into twelve-bar blues. But it still started with the hook, still had Mike sing his tenor lead in the verses, and still had him move to sing a boogie-ish bassline in the chorus while the rest of the group chanted in block harmonies over the top.\n\nBut it introduced a new lyrical theme to the group -- now, as well as singing about surfing and the beach, they could also sing about cars and car racing -- Love credits this as being one of the main reasons for the group's success in landlocked areas, because while there were many places in the US where you couldn't surf, there was nowhere where people didn't have cars.\n\nIt's also the earliest Beach Boys song over which there is an ongoing question of credit. For the first thirty years of the song's existence, it was credited solely to Wilson and Usher, but in the early nineties Love won a share of the songwriting credit in a lawsuit in which he won credit on many, many songs he'd not been credited for.\n\nLove claims that he came up with the \"She's real fine, my 409\" hook, and the \"giddy up\" bass vocal he sang. Usher always claimed that Love had nothing to do with the song, and that Love was always trying to take credit for things he didn't do. It's difficult to tell who was telling the truth, because both obviously had a financial stake in the credit (though Usher was dead by the time of the lawsuit). Usher was always very dismissive of all of the Beach Boys with the exception of Brian, and wouldn't credit them for making any real contributions, Love's name was definitely missed off the credits of a large number of songs to which he did make substantial contributions, including some where he wrote the whole lyric, and the bits of the song Love claims *do* sound like the kind of thing he contributed to other songs which have no credit disputes. On the other hand, Love also overreached in his claims of credit in that lawsuit, claiming to have co-written songs that were written when he wasn't even in the same country as the writers.\n\nWhere you stand on the question of whether Love deserves that credit usually depends on your views of Wilson, Love and Usher as people, and it's not a question I'm going to get into, but I thought I should acknowledge that the question is there.\n\nWhile \"409\" was still following the same pattern as the other songs, it's head and shoulders ahead of the Hite Morgan productions both in terms of performance and in terms of the sound. A great deal of that clearly owes to Usher, who was experimenting with things like sound effects, and so \"409\" starts with a recording that Brian and Usher made of Usher's car driving up and down the street:\n\n[Excerpt: The Beach Boys, \"409\"]\n\nMeanwhile the new version of \"Surfin' Safari\" was vastly superior to the recording from a couple of months earlier, with changed lyrics and a tighter performance:\n\n[Excerpt: The Beach Boys, \"Surfin' Safari (second version)\"]\n\nSo at the end of the session, the group had a tape of three new songs, and Murry WIlson wanted them to take it somewhere better than Candix Records. He had a contact somewhere much better -- at Capitol Records. He was going to phone Ken Nelson.\n\nOr at least, Murry *thought* he had a contact at Capitol. He phoned Ken Nelson and told him \"Years ago, you did me a favour, and now I'm doing one for you. My sons have formed a group and you have the chance to sign them!\"\n\nNow, setting aside the question of whether that would actually count as Murry doing Nelson a favour, there was another problem with this -- Nelson had absolutely no idea who Murry Wilson was, and no recollection of ever doing him a favour. It turned out that the favour he'd done, in Murry's eyes, was recording one of Murry's songs -- except that there's no record of Nelson ever having been involved in a recording of a Murry Wilson song.\n\nBy this time, Capitol had three A&R people, in charge of different areas. There was Voyle Gilmore, who recorded soft pop -- people like Nat \"King\" Cole. There was Nelson, who as we've seen in past episodes had some rockabilly experience but was mostly country -- he'd produced Gene Vincent and Wanda Jackson, but he was mostly working at this point with people like Buck Owens and the Louvin Brothers, producing some of the best country music ever recorded, but not really doing the kind of thing that the Beach Boys were doing.\n\nBut the third, and youngest, A&R man was doing precisely the kind of thing the Beach Boys did. That was Nik Venet, who we met back in the episode on \"LSD-25\", and who was one of the people who had been involved with the very first surf music recordings. Nelson suggested that Murry go and see Venet, and Venet was immediately impressed with the tape Murry played him -- so impressed that he decided to offer the group a contract, and to release \"Surfin' Safari\" backed with \"409\", buying the masters from Murry rather than rerecording them. Venet also tried to get the publishing rights for the songs for Beechwood Music, a publishing company owned by Capitol's parent company EMI (and known in the UK as Ardmore & Beechwood) but Gary Usher, who knew a bit about the business, said that he and Brian were going to set up their own publishing companies -- a decision which Murry Wilson screamed at him for, but which made millions of dollars for Brian over the next few years.\n\nThe single came out, and was a big hit, making number fourteen on the hot one hundred, and \"409\" as the B-side also scraped the lower reaches of the charts. Venet soon got the group into the studio to record an album to go with the single, with Usher adding extra backing vocals to fill out the harmonies in the absence of Al Jardine. While the Beach Boys were a self-contained group, Venet seems to have brought in his old friend Derry Weaver to add extra guitar, notably on Weaver's song \"Moon Dawg\":\n\n[Excerpt: The Beach Boys, \"Moon Dawg\"]\n\nIt's perhaps unsurprising that the Beach Boys recorded that, because not only was it written by Venet's friend, but Venet owned the publishing on the song. The group also recorded \"Summertime Blues\", which was co-written by Jerry Capehart, a friend of Venet and Weaver's who also may have appeared on the album in some capacity. Both those songs fit the group, but their choice was clearly influenced by factors other than the purely musical, and very soon Brian Wilson would get sick of having his music interfered with by Venet.\n\nThe album came out on October 1, and a few days later the single was released in the UK, several months after its release in the US. And on the same day, a British group who *had* signed to have their single published by Ardmore & Beechwood put out their own single on another EMI label. And we're going to look at that in the next episode...",
  "enclosure": "",
  "itunes:summary": "This week there are&nbsp;two episiodes of the podcast going up, both of them longer than normal. This one, episode ninety-nine, is on \"Surfin' Safari\" by the Beach Boys, and the group's roots in LA, and is fifty minutes long. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Misirlou\" by Dick Dale and the Deltones.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nNo Mixclouds this week, as both episodes have far too many songs by one artist. The mixclouds will be back with episode 101.\n\nI used many resources for this episode, most of which will be used in future Beach Boys episodes too. It's difficult to enumerate everything here, because I have been an active member of the Beach Boys fan community for twenty-three years, and have at times just used my accumulated knowledge for this. But the resources I list here are ones I've checked for specific things.\n\nBecoming the Beach Boys by James B. Murphy is an in-depth look at the group's early years.\n\nStephen McParland has published many, many books on the California surf and hot-rod music scenes, including several on both the Beach Boys and Gary Usher.&nbsp;The Beach Boys: Inception and Creation is the one I used most here, but I referred to several. His books can be found at https://payhip.com/CMusicBooks\n\nAndrew Doe's Bellagio 10452 site is an invaluable resource.\n\nJon Stebbins' The Beach Boys FAQ is a good balance between accuracy and readability.\n\nAnd Philip Lambert's&nbsp;Inside the Music of Brian Wilson is an excellent, though sadly out of print, musicological analysis of Wilson's music from 1962 through 67.\n\nThe Beach Boys' Morgan recordings and all the outtakes from them can be found on this 2-CD set.\n\nThe&nbsp;Surfin' Safari album is now in the public domain, and so can be found cheaply, but the best version to get is still the twofer CD with the&nbsp;Surfin' USA&nbsp;album.\n\n*But*, those two albums are fairly weak, the Beach Boys in their early years were not really an album band, and you&nbsp;will want to investigate them further. I would recommend, rather than the two albums linked above, starting with this budget-priced three-CD set, which has a surprisingly good selection of their material on it.\n\nPatreon\n\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\n\nTranscript\n\nToday, there are going to be two podcast episodes. This one, episode ninety-nine, will be a normal-length episode, or maybe slightly longer than normal, and episode one hundred, which will follow straight after it, will be a super-length one that's at least three times the normal length of one of these podcasts.\n\nI'm releasing them together, because the two episodes really do go together. We've talked recently about how we're getting into the sixties of the popular imagination, and those 1960s began, specifically, in October 1962. That was the month of the Cuban Missile Crisis, which saw the world almost end. It was the month that James Brown released Live at the Apollo -- an album we'll talk about in a few weeks' time. And if you want one specific date that the 1960s started, it was October the fifth, 1962.\n\nOn that date, a film came out that we mentioned last week -- Doctor No, the first ever James Bond film. It was also the date that two records were released on EMI in Britain. One was a new release by a British band, the other a record originally released a few months earlier in the USA, by an American band. Both bands had previously released records on much smaller labels, to no success other than very locally, but this was their first to be released on a major label, and had a slightly different lineup from those earlier releases. Bo",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "This week there are&nbsp;two episiodes of the podcast going up, both of them longer than normal. This one, episode ninety-nine, is on \"Surfin' Safari\" by the Beach Boys, and the group's roots in LA, and is fifty minutes long. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Misirlou\" by Dick Dale and the Deltones.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nNo Mixclouds this week, as both episodes have far too many songs by one artist. The mixclouds will be back with episode 101.\n\nI used many resources for this episode, most of which will be used in future Beach Boys episodes too. It's difficult to enumerate everything here, because I have been an active member of",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}