{
  "title": "“Epic Clusterf*ck” Unfolds At The Washington Post Following Dave Weigel Retweet",
  "itunes:title": "“Epic Clusterf*ck” Unfolds At The Washington Post Following Dave Weigel Retweet",
  "pubDate": "Fri, 10 Jun 2022 05:10:16 +0000",
  "guid": "fc18bc0f-8ef0-4d56-baf1-03d388e6f45a",
  "link": "https://thejimmydoreshow.libsyn.com/epic-clusterfck-unfolds-at-the-washington-post-following-dave-weigel-retweet",
  "itunes:image": "",
  "description": "<p>It was the retweet heard round the world — Washington Post reporter Dave Weigel’s ill-advised retweet of a mildly sexist joke that led not only to his suspension without pay, but to a wider conflagration at the Post centered around his fellow reporter, Felicia Sonmez. Jimmy and friends discuss the maelstrom of accusations, recrimination and distinct lack of collegiality on display in the “clusterfuck” underway at the Post.<br /> <br /> Plus a segment on British celebrity reporter Paul Mason's email leak revealing a plot to bring down the anti-war journalists at The Grayzone.<br /> <br /> Also featuring Stef Zamorano, Kurt Metzger, Max Blumenthal and Mike MacRae! And phone calls from Brad Pitt and Joe Biden!</p>",
  "content:encoded": "<p>It was the retweet heard round the world — Washington Post reporter Dave Weigel’s ill-advised retweet of a mildly sexist joke that led not only to his suspension without pay, but to a wider conflagration at the Post centered around his fellow reporter, Felicia Sonmez. Jimmy and friends discuss the maelstrom of accusations, recrimination and distinct lack of collegiality on display in the “clusterfuck” underway at the Post.  Plus a segment on British celebrity reporter Paul Mason's email leak revealing a plot to bring down the anti-war journalists at The Grayzone.  Also featuring Stef Zamorano, Kurt Metzger, Max Blumenthal and Mike MacRae! And phone calls from Brad Pitt and Joe Biden!</p>",
  "enclosure": "",
  "itunes:duration": "57:51",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "It was the retweet heard round the world — Washington Post reporter Dave Weigel’s ill-advised retweet of a mildly sexist joke that led not only to his suspension without pay, but to a wider conflagration at the Post centered around his fellow...",
  "itunes:episodeType": "full",
  "itunes:summary": "It was the retweet heard round the world — Washington Post reporter Dave Weigel’s ill-advised retweet of a mildly sexist joke that led not only to his suspension without pay, but to a wider conflagration at the Post centered around his fellow reporter, Felicia Sonmez. Jimmy and friends discuss the maelstrom of accusations, recrimination and distinct lack of collegiality on display in the “clusterfuck” underway at the Post. Plus a segment on British celebrity reporter Paul Mason's email leak revealing a plot to bring down the anti-war journalists at The Grayzone. Also featuring Stef Zamorano, Kurt Metzger, Max Blumenthal and Mike MacRae! And phone calls from Brad Pitt and Joe Biden!"
}