{
  "title": "Episode 98: Evolutionary Psychology - An Interview with Dr. David Buss",
  "pubDate": "Sat, 20 Jun 2009 23:53:19 +0000",
  "guid": "psychology-in-everyday-life-the-psych-files-podca-2",
  "link": "http://www.thepsychfiles.com/2009/06/episode-98-evolutionary-psychology-an-interview-with-dr-david-buss/",
  "itunes:image": "",
  "description": "Do you know your own mate value in the dating world?  Curious about evolutionary psychology?  In this interview with Dr. David Buss we discuss a number of interesting and controversial topics, such as the matching hypothesis and date rape.  Are there evolutionary roots to the battle of the sexes and can we change our behavior?  Find out in this interview.",
  "content:encoded": "Do you know your own mate value in the dating world?  Curious about evolutionary psychology?  In this interview with Dr. David Buss we discuss a number of interesting and controversial topics, such as the matching hypothesis and date rape.  Are there evolutionary roots to the battle of the sexes and can we change our behavior?  Find out in this interview.",
  "enclosure": "",
  "itunes:duration": "39:50",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,David,Evolution,psychology,lecture,evolutionary,buss",
  "itunes:subtitle": "Do you know your own mate value in the dating world? Dr. David Buss and I discuss interesting and controversial topics, such as the matching hypothesis and date rape.  Are there evolutionary roots to the battle of the sexes and can we change our behavior?",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Do you know your own mate value in the dating world? Curious about evolutionary psychology? In this interview with Dr. David Buss we discuss a number of interesting and controversial topics, such as the matching hypothesis and date rape. Are there evolutionary roots to the battle of the sexes and can we change our behavior? Find out in this interview."
}