{
  "title": "Hacking Academia: Data Science and the University",
  "link": "",
  "published": "2014-08-22T08:00:00-07:00",
  "updated": "2014-08-22T08:00:00-07:00",
  "author": {
    "name": "Jake VanderPlas"
  },
  "id": "tag:jakevdp.github.io,2014-08-22:blog/2014/08/22/hacking-academia/",
  "summary": "<p><em>A reflection on our <a href=\"http://www.digital-science.com/sciencefoo/\">SciFoo</a> breakout session, where we discussed issues of data science within academia.</em></p>\n<p>Almost a year ago, I wrote a post I called the <a href=\"http://jakevdp.github.io/blog/2013/10/26/big-data-brain-drain/\">Big Data Brain Drain</a>, lamenting the ways that academia is neglecting the skills of modern data-intensive research, and in doing so is driving away many of the men and women who are perhaps best equipped to enable progress in these fields. This seemed to strike a chord with a wide range of people, and has led me to some incredible opportunities for conversation and collaboration on the subject. One of those conversations took place at the recent SciFoo conference, and this article is my way of recording some reflections on that conversation.</p>\n<p><a href=\"http://www.digital-science.com/sciencefoo/\">SciFoo</a> is an annual gathering of several hundred scientists, writers, and thinkers sponsored by Digital Science, Nature, O'Reilly Media &amp; Google. SciFoo brings together an incredibly eclectic group of people: I met philosophers, futurists, alien hunters, quantum physicists, mammoth cloners, magazine editors, science funders, astrophysicists, musicians, mycologists, mesmerists, and many many more: the list could go on and on. The conference is about as unstructured as it can be: the organizers simply provide food, drink, and a venue for conversation, and attendees put together breakout discussions on nearly any imaginable topic. If you ever get the chance to go, my advice is to drop everything else and attend. It was one of the most quirky and intellectually stimulating weekends I've ever spent.</p>",
  "category": [
    "",
    ""
  ]
}