{
  "title": "Machine learning facilitates “turbulence tracking” in fusion reactors",
  "link": "https://news.mit.edu/2022/fusion-machine-learning-turbulence-1101",
  "description": "A new approach sheds light on the behavior of turbulent structures that can affect the energy generated during fusion reactions, with implications for reactor design.",
  "pubDate": "Tue, 01 Nov 2022 00:00:00 -0400",
  "guid": "https://news.mit.edu/2022/fusion-machine-learning-turbulence-1101",
  "dc:creator": "Adam Zewe | MIT News Office",
  "content:encoded": "<p>Fusion, which promises practically unlimited, carbon-free energy using the same processes that power the sun, is at the heart of a worldwide research effort that could help mitigate climate change.</p>\n\n<p></p>\n\n<p>A multidisciplinary team of researchers is now bringing tools and insights from machine learning to aid this effort. Scientists from MIT and elsewhere have used computer-vision models to identify and track turbulent structures that appear under the conditions needed to facilitate fusion reactions.</p>\n\n<p></p>\n\n<p>Monitoring the formation and movements of these structures, called filaments or “blobs,” is important for understanding the heat and particle flows exiting from the reacting fuel, which ultimately determines the engineering requirements for the reactor walls to meet those flows. However, scientists typically study blobs using averaging techniques, which trade details of individual structures in favor of aggregate statistics. Individual blob information must be tracked by marking them manually in video data.&nbsp;</p>\n\n<p></p>\n\n<p>The researchers built a synthetic video dataset of plasma turbulence to make this process more effective and efficient. They used it to train four computer vision models, each of which identifies and tracks blobs. They trained the models to pinpoint blobs in the same ways that humans would.</p>\n\n<p></p>\n\n<p>When the researchers tested the trained models using real video clips, the models could identify blobs with high accuracy — more than 80 percent in some cases. The models were also able to effectively estimate the size of blobs and the speeds at which they moved.</p>\n\n<p></p>\n\n<p>Because millions of video frames are captured during just one fusion experiment, using machine-learning models to track blobs could give scientists much more detailed information.</p>\n\n<p></p>\n\n<p>“Before, we could get a macroscopic picture of what these structures are doing on average. Now, we have a microscope and the computational power to analyze one event at a time. If we take a step back, what this reveals is the power available from these machine-learning techniques, and ways to use these computational resources to make progress,” says Theodore Golfinopoulos, a research scientist at the MIT Plasma Science and Fusion Center and co-author of <a href=\"https://www.nature.com/articles/s41598-022-21671-w\" target=\"_blank\">a paper</a> detailing these approaches.</p>\n\n<p></p>\n\n<p>His fellow co-authors include lead author Woonghee “Harry” Han, a physics PhD candidate; senior author Iddo Drori, a visiting professor in the Computer Science and Artificial Intelligence Laboratory (CSAIL), faculty associate professor at Boston University, and adjunct at Columbia University; as well as others from the MIT Plasma Science and Fusion Center, the MIT Department of Civil and Environmental Engineering, and the Swiss Federal Institute of Technology at Lausanne in Switzerland. The research appears today in <em>Nature Scientific Reports</em>.</p>\n\n<p></p>\n\n<p><strong>Heating things up</strong></p>\n\n<p></p>\n\n<p>For more than 70 years, scientists have sought to use controlled thermonuclear fusion reactions to develop an energy source. To reach the conditions necessary for a fusion reaction, fuel must be heated to temperatures above 100 million degrees Celsius. (The core of the sun is about 15 million degrees Celsius.)</p>\n\n<p></p>\n\n<p>A common method for containing this super-hot fuel, called plasma, is to use a tokamak. These devices utilize extremely powerful magnetic fields to hold the plasma in place and control the interaction between the exhaust heat from the plasma and the reactor walls.</p>\n\n<p></p>\n\n<p>However, blobs appear like filaments falling out of the plasma at the very edge, between the plasma and the reactor walls. These random, turbulent structures affect how energy flows between the plasma and the reactor.</p>\n\n<p></p>\n\n<p>“Knowing what the blobs are doing strongly constrains the engineering performance that your tokamak power plant needs at the edge,” adds Golfinopoulos.</p>\n\n<p></p>\n\n<p>Researchers use a unique imaging technique to capture video of the plasma’s turbulent edge during experiments. An experimental campaign may last months; a typical day will produce about 30 seconds of data, corresponding to roughly 60 million video frames, with thousands of blobs appearing each second. This makes it impossible to track all blobs manually, so researchers rely on average sampling techniques that only provide broad characteristics of blob size, speed, and frequency.</p>\n\n<p></p>\n\n<p>“On the other hand, machine learning provides a solution to this by blob-by-blob tracking for every frame, not just average quantities. This gives us much more knowledge about what is happening at the boundary of the plasma,” Han says.</p>\n\n<p></p>\n\n<p>He and his co-authors took four well-established computer vision models, which are commonly used for applications like autonomous driving, and trained them to tackle this problem.</p>\n\n<p></p>\n\n<p><strong>Simulating blobs</strong></p>\n\n<p></p>\n\n<p>To train these models, they created a vast dataset of synthetic video clips that captured the blobs’ random and unpredictable nature.</p>\n\n<p></p>\n\n<p>“Sometimes they change direction or speed, sometimes multiple blobs merge, or they split apart. These kinds of events were not considered before with traditional approaches, but we could freely simulate those behaviors in the synthetic data,” Han says.</p>\n\n<p></p>\n\n<p>Creating synthetic data also allowed them to label each blob, which made the training process more effective, Drori adds.</p>\n\n<p></p>\n\n<p>Using these synthetic data, they trained the models to draw boundaries around blobs, teaching them to closely mimic what a human scientist would draw.</p>\n\n<p></p>\n\n<p>Then they tested the models using real video data from experiments. First, they measured how closely the boundaries the models drew matched up with actual blob contours.</p>\n\n<p></p>\n\n<p>But they also wanted to see if the models predicted objects that humans would identify. They asked three human experts to pinpoint the centers of blobs in video frames and checked to see if the models predicted blobs in those same locations.</p>\n\n<p></p>\n\n<p>The models were able to draw accurate blob boundaries, overlapping with brightness contours which are considered ground-truth, about 80 percent of the time. Their evaluations were similar to those of human experts, and successfully predicted the theory-defined regime of the blob, which agrees with the results from a traditional method.</p>\n\n<p></p>\n\n<p>Now that they have shown the success of using synthetic data and computer vision models for tracking blobs, the researchers plan to apply these techniques to other problems in fusion research, such as estimating particle transport at the boundary of a plasma, Han says.</p>\n\n<p></p>\n\n<p>They also made the dataset and models publicly available, and look forward to seeing how other research groups apply these tools to study the dynamics of blobs, says Drori.</p>\n\n<p></p>\n\n<p>“Prior to this, there was a barrier to entry that mostly the only people working on this problem were plasma physicists, who had the datasets and were using their methods. There is a huge machine-learning and computer-vision community. One goal of this work is to encourage participation in fusion research from the broader machine-learning community toward the broader goal of helping solve the critical problem of climate change,” he adds.</p>\n\n<p></p>\n\n<p>This research is supported, in part, by the U.S. Department of Energy and the Swiss National Science Foundation.</p>",
  "media:content": {
    "media:description": "A team of researchers has demonstrated the use of computer vision models to monitor turbulent structures, known as \"blobs,\" that appear on the edge of the super-hot fuel used in controlled-nuclear-fusion research. The super-hot fuel, or plasma, is held inside a tokamak device (right photo). On the left, a \"blob\" highlighted in yellow is shown in a synthetic image.",
    "media:credit": "Tokamak image courtesy École Polytechnique Fédérale de Lausanne and A. Herzog. Foreground “blob” image courtesy of the researchers. Edited by MIT News."
  },
  "category": [
    "Research",
    "Fusion",
    "Energy",
    "Renewable energy",
    "Alternative energy",
    "Sustainability",
    "Computer science and technology",
    "Artificial intelligence",
    "Machine learning",
    "Plasma Science and Fusion Center",
    "Computer Science and Artificial Intelligence Laboratory (CSAIL)",
    "Electrical Engineering & Computer Science (eecs)",
    "Nuclear science and engineering",
    "School of Engineering",
    "School of Science"
  ]
}