{
  "title": "Episode 58: Speed Dating - You Don't Know What You Want",
  "pubDate": "Sun, 25 May 2008 21:03:17 +0000",
  "guid": "episode-58-speed-dating-you-dont-know-what-you",
  "link": "https://traffic.libsyn.com/secure/thepsychfiles/TPF_058_SpeedDating_052508.mp3",
  "itunes:image": "",
  "description": "Do you really know what you want in a romantic partner?  The answer is....no.  How often have you heard that men want women with great bodies and women want a good provider?  Do you agree with it?  It may not be true at all.  Surprised?  Learn more about what women (and men) really want in this fascinating study conducted in of all places a speed dating event.  Psychology studies finally get interesting for subjects!",
  "content:encoded": "Do you really know what you want in a romantic partner?  The answer is....no.  How often have you heard that men want women with great bodies and women want a good provider?  Do you agree with it?  It may not be true at all.  Surprised?  Learn more about what women (and men) really want in this fascinating study conducted in of all places a speed dating event.  Psychology studies finally get interesting for subjects!",
  "enclosure": "",
  "itunes:duration": "24:33",
  "itunes:explicit": false,
  "itunes:keywords": "Speed,fitness,dating,romance",
  "itunes:subtitle": "Do you really know what you want in a romantic partner? The answer is no. Learn more about what women (and men) really want in this fascinating study conducted in of all places a speed dating event. Psychology studies finally get interesting for subjects!",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Do you really know what you want in a romantic partner? The answer is....no. How often have you heard that men want women with great bodies and women want a good provider? Do you agree with it? It may not be true at all. Surprised? Learn more about what women (and men) really want in this fascinating study conducted in of all places a speed dating event. Psychology studies finally get interesting for subjects!"
}