{
  "title": "547: The Rise and Fall of Severus Snape and Lily Potter",
  "link": "https://audioboom.com/posts/8018352",
  "itunes:episode": 547,
  "itunes:title": "The Rise and Fall of Severus Snape and Lily Potter",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5447,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In light of Snape and Lily both being born in January, this week we're analyzing the rise and fall of the relationship between the two characters! What did Lily initially see in Snape? Should she have given him another chance? And just how creepy is Snape's life-long commitment to Lily? Then, we unveil the Top 7 pickup lines Snape used on Lily... no wonder things didn't work out!<br>\n<br>\n\n</div>\n<ul>\n<li>Welcome back to our guest host and HP super-fan, Irvin!</li>\n<li>Irvin's <a href=\"https://lifeandliesofdumbledore.com/\">book on Dumbledore</a> titled Dumbledore: The Life and Lies is available now wherever books are sold!</li>\n<li>MuggleCast is <a href=\"https://www.tiktok.com/@mugglecastpod\">now on TikTok, </a>aka Laura's favorite app. Subscribe to us at @mugglecastpod</li>\n<li>Our <a href=\"https://www.patreon.com/mugglecast\">2022 Patreon perks</a> have been announced! The new MuggleCast Collector's Club and Fandom Lookback features are sure to thrill all who subscribe to our Patreon.</li>\n<li>Our main discussion this week is on Lily Potter and Severus Snape, and their relationship throughout the series.</li>\n<li>Both Lily and Severus are born in January! But, they have different star signs. What in their zodiac aligns with their lives as they lived them?</li>\n<li>At what point in their lives did Lily and Snape's relationship go south?</li>\n<li>When does Snape's tragic home life cease to be a valid excuse for his Dark Arts tendencies?</li>\n<li>Did Lily even TRY to sway Snape towards the light? And what would that have looked like?</li>\n<li>How much of Snape is nature vs. nurture?</li>\n<li>What does Snape having Lily's Patronus say about him? And, similarly, why is his love for Lily unhealthy or one-sided?</li>\n<li>The MuggleCast hosts read aloud the Top 7 Pickup Lines that Snape Definitely Used on Lily.</li>\n<li>Quizzitch: For a chance at winning one of 5 copies of Irvin's book, what are the names of Snape's parents?  <a href=\"https://mugglecast.com/quizzitch/\">Submit your answer</a>! </li>\n<li>This week's episode is sponsored by MeUndies (Get 25% off Matching Pairs, 15% off your first order, free shipping, and a 100% satisfaction guarantee at <a href=\"http://www.MeUndies.com/mugglecast\">MeUndies.com/mugglecast</a>) and Warby Parker (Try 5 pairs of glasses at home for free at <a href=\"http://www.WarbyParker.com/mugglecast\">WarbyParker.com/mugglecast</a>)</li>\n</ul>\n",
  "pubDate": "Tue, 25 Jan 2022 10:00:00 +0000",
  "guid": "tag:audioboom.com,2022-01-24:/posts/8018352",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}