{
  "title": "Entrepreneur First to discontinue Singapore programme; to focus on Europe, N America, India",
  "link": "https://e27.co/entrepreneur-first-to-discontinue-singapore-program-20221101/",
  "dc:creator": "Sainul",
  "pubDate": "Tue, 01 Nov 2022 07:00:38 +0000",
  "category": [
    "News",
    "Singapore",
    "Startups",
    "Allozymes",
    "Entrepreneur First",
    "Green Li-ion",
    "Seppure",
    "SunGreen H2",
    "Transcelestial"
  ],
  "guid": "https://e27.co/?p=475404",
  "description": "<p>Entrepreneur First (EF), an investor supporting individuals building technology companies, announced today that it will discontinue its Singapore programme after the graduation of its ongoing twelfth cohort in 2023. This is part of its plans to focus its future growth in Europe, North America and India. &#8220;Entrepreneur First&#8217;s expansion to Singapore was a crucial milestone [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/entrepreneur-first-to-discontinue-singapore-program-20221101/\">Entrepreneur First to discontinue Singapore programme; to focus on Europe, N America, India</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<div id=\"attachment_475405\" style=\"width: 700px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-475405\" loading=\"lazy\" class=\"size-full wp-image-475405\" src=\"https://e27.co/wp-content/uploads/2022/11/EF_consolidation_news.png\" alt=\"\" width=\"690\" height=\"388\" /><p id=\"caption-attachment-475405\" class=\"wp-caption-text\">Entrepreneur First Co-Founders Alice Bentinck (L) and Matt Clifford</p></div>\n<p>Entrepreneur First (EF), an investor supporting individuals building technology companies, announced today that it will discontinue its <a rel=\"follow\" href=\"https://www.joinef.com/locations/singapore/\">Singapore programme</a> after the graduation of its ongoing twelfth cohort in 2023.</p>\n<p>This is part of its plans to focus its future growth in Europe, North America and India.</p>\n<p>&#8220;Entrepreneur First&#8217;s expansion to Singapore was a crucial milestone in our history; our first site outside London. The EF Singapore team has worked tirelessly to find and serve the entrepreneurs in our community. We&#8217;ll be seeing the legacy of their work for years to come with the growth of the EF Singapore portfolio,&#8221; said Co-Founder and CEO Matt Clifford.</p>\n<p>Per a statement, Entrepreneur First will also cease to run new programmes in Toronto and will instead roll its activity in Canada into a broader North American strategy.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/dont-chase-titles-chase-curiosity-and-let-it-lead-you-bernadette-cho-of-entrepreneur-first-20221017/\">‘Don’t chase titles; chase curiosity and let it lead you’: Bernadette Cho of Entrepreneur First</a></strong></p>\n<p>This is the result of a strategic shift in its growth strategy. Entrepreneur First will now focus on a smaller number of hubs where the size of the local talent pool positions them to scale to running multiple vertical programmes concurrently.</p>\n<p>This strategy is now rolling out first in London, where it has expanded beyond the core programme and added web3 and climate change cohorts.</p>\n<p>Founded in 2011 by Matt Clifford and Alice Bentinck in London, EF operates as an early-stage investor, helping talented people find co-founders to partner with before launching startups.</p>\n<p>Its Singapore portfolio companies include Transcelestial, Seppure, Allozymes, SunGreen H2, and Green Li-ion.</p>\n<p>Entrepreneur First will continue to support its Singapore portfolio through its global team and funding network.</p>\n<p>In June this year, Entrepreneur First <a rel=\"follow\" href=\"https://e27.co/stripe-linkedin-co-founders-back-entrepreneur-firsts-us158m-series-c-20220629/\">secured a US$158 million Series C funding</a> round from a group of veteran technology founders. The investors include John and Patrick Collison (Co-Founders of Stripe), Taavet Hinrikus (Co-Founder of Wise), Reid Hoffman (Co-Founder of LinkedIn), Matt Mullenweg (Co-Founder of WordPress), Tom Blomfield (Co-Founder of Monzo and GoCardless), Nat Friedman (former CEO of Github), Sara Clemens (former COO of Twitch and Pandora), Matt Robinson (Co-Founder of Nested and GoCardless), Patrick O’Shaughnessy (Positive Sum), Demis Hassabis and Mustafa Suleyman (Co-Founders of Deepmind), Sten Tamkivi, Elad Gil, and Lachy Groom.</p>\n<p>&#8212;</p>\n<div class=\"post-container x-post-content\">\n<p>Fundraising or preparing your startup for fundraising? Build your investor network, search from 400+ SEA investors on e27, and get connected or get insights regarding fundraising. <a class=\"ProsemirrorEditor-link\" rel=\"follow\" href=\"https://e27.co/membership/?utm_source=Boilerplate&utm_medium=Articles&utm_campaign=300TRIAL&utm_id=300TRIAL\" rel=\"follow\">Try e27 Pro for free today</a>.</p>\n</div>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/entrepreneur-first-to-discontinue-singapore-program-20221101/\">Entrepreneur First to discontinue Singapore programme; to focus on Europe, N America, India</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}