{
  "title": "Supporting Renewable Energy Technology Development with Modeling and Simulation",
  "link": "https://engineeringresources.spectrum.ieee.org/free/w_math07/prgm.cgi",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/supporting-renewable-energy-technology-development-with-modeling-and-simulation.gif?id=31942139&width=1245&height=700&coordinates=75%2C0%2C76%2C0\"/><br/><br/><p>In this webinar, MathWorks will discuss how to align modeling and simulation techniques with different stages in the technology development cycle for renewable energy systems. Through worked examples of both solar power and wind power systems, we will consider early-stage design - where the primary focus is on aspects such as system architecture, longer-term power production, and trade-studies, through to more detailed design - where the primary focus is on specific technology characteristics, energy management, and control. These considerations support design exploration and design rigor, meaning you can navigate the technology development cycle rapidly and with confidence.</p> <p><strong>Speakers</strong>:</p> <p><strong>Graham Dudgeon, MEng, PhD</strong>, <em>Principal Technologist </em>– <em>Electrical Systems, MathWorks</em></p> <ul> <li>Graham Dudgeon is principal technologist for electrical technology at MathWorks. Over the last two decades Graham has supported several industries in the electrical technology area, including aerospace, marine, automotive, industrial automation, medical devices, and power and utilities, with an emphasis on system modeling and simulation, control design, real-time simulation, machine learning, and data analytics. Prior to joining MathWorks, Graham was Senior Research Fellow at the Rolls-Royce University Technology Centre in Electrical Power Systems at the University of Strathclyde in Scotland, UK.</li> </ul>",
  "pubDate": "Thu, 13 Oct 2022 16:18:57 +0000",
  "guid": "https://engineeringresources.spectrum.ieee.org/free/w_math07/prgm.cgi",
  "category": "Type:webinar",
  "dc:creator": "MathWorks",
  "media:content": ""
}