{
  "title": "151: Who Killed Chandra Levy?",
  "link": "https://audioboom.com/posts/7693619",
  "itunes:episode": 151,
  "itunes:title": "Who Killed Chandra Levy?",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 2933,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In May of 2001, 24 year old Washingtond DC intern, Chandra Levy, vanished. As her parents and investigators frantically searched for her, rumors of a relationship with a powerful Congressman surface. A year later, when her body is found 4 miles from where she was last seen, it raises more questions than answers. A suspect is named and charged, but is he the right guy? What is the Congressman hiding? And most importantly, who killed Chandra?<br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n<br>\n<strong>FAM!! WE LAUNCHED A NEW PODCAST!! </strong><a href=\"https://www.unjustandunsolved.com/post/preview-unjust-and-unsolved\">Check out the trailer for \"Unjust and Unsolved\" with investigative journalist Maggie Freleng. </a>\"Unjust and Unsolved\" is a podcast about wrongful convictions. Each episode tells the story of a wrongfully convicted person who was convicted of a very serious crime despite substantial evidence pointing away from their guilt. The stories are told through Maggie's original interviews with the convicted, their loved ones and lawyers, exhaustive investigative work, and news footage. Maggie also tells the story of the crime, details how the person was convicted, and lays out all the evidence. <strong>FIND AND SUBSCRIBE TO \"UNJUST AND UNSOLVED WHEREVER YOU GET</strong><br>\n<br>\n\n</div>\n",
  "pubDate": "Tue, 29 Sep 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-09-29:/posts/7693619",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}