{
  "title": "What Robotics Experts Think of Tesla’s Optimus Robot",
  "link": "https://spectrum.ieee.org/robotics-experts-tesla-bot-optimus",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/tesla-s-optimus-robot-waves-at-audience-from-the-stage.jpg?id=31857078&width=1200&height=400&coordinates=0%2C277%2C0%2C278\"/><br/><br/><p>Last Friday, 30 September, <a href=\"https://spectrum.ieee.org/tesla-optimus-robot\" target=\"_blank\">Tesla introduced several prototypes of its new humanoid robot, Optimus</a>. After a year of speculation based on little more than <a href=\"https://spectrum.ieee.org/elon-musk-robot\" target=\"_blank\">a person in a robot suit combined with some optimistic assertions made by Tesla CEO Elon Musk</a>, many roboticists tuned in to the event live stream (or attended in person) to see what Tesla’s approach to humanoid robotics would turn out to be.</p><p>Reactions across the robotics community were diverse. Because robotics requires expertise in many different aspects of both software and hardware, getting a good sense of the present context of Tesla’s robot as well as its future potential means finding perspectives from a multitude of robotics experts, including people working in industry and academia and everywhere in between. And by scouring the Internet over the weekend, we found as many expert commenters as we could. Together, they offer the most detailed and nuanced understanding of Optimus we’re likely to get outside of Tesla itself.</p><hr/><p class=\"rm-anchors\" id=\"top\"> These robotics experts posted their thoughts on Twitter, LinkedIn, Substack, and elsewhere, and with their permission, we’ve collected them for you below. Many of these folks wrote a lot more than we have room to include, but you can follow the link in a particular expert’s name to see their complete commentary.</p><h3>Experts on Optimus</h3><br/><ul><li><a href=\"#georgia-chalvatzaki\">Georgia Chalvatzaki</a> — Assistant Professor, Technische Universität Darmstadt</li><li><a href=\"#kate-darling\">Kate Darling</a> — Research Specialist, MIT Media Lab</li><li><a href=\"#animesh-garg\">Animesh Garg</a> — Assistant Professor, University of Toronto</li><li><a href=\"https://spectrum.ieee.org/r/entryeditor/2658380182#animesh-garg\" target=\"_self\"></a><a href=\"https://spectrum.ieee.org/r/entryeditor/2658380182#animesh-garg\" target=\"_self\"></a><a href=\"#ryan-gariepy\">Ryan Gariepy</a> — CTO, Clearpath Robotics & OTTO Motors</li><li><a href=\"#keerthana-gopalakrishnan\">Keerthana Gopalakrishnan</a> — Roboticist, Google Brain</li><li><a href=\"https://spectrum.ieee.org/r/entryeditor/2658380182#keerthana-gopalakrishnan\" target=\"_self\"></a><a href=\"#dennis-hong\">Dennis Hong</a> — Professor, UCLA</li><li><a href=\"#christian-hubicki\">Christian Hubicki</a> — Assistant Professor, Florida State University</li></ul><h3></h3><br/><ul><li><a href=\"#will-jackson\">Will Jackson</a> — Founder and CEO, Engineered Arts</li><li><a href=\"#gary-marcus\">Gary Marcus</a> — Author, <em>Rebooting AI</em></li><li><a href=\"#brandon-rohrer\">Brandon Rohrer</a> — Machine Learning Engineer, LinkedIn</li><li><a href=\"#siddhartha-srinivasa\">Siddhartha Srinivasa</a> — Director of Robotics and AI, Amazon</li><li><a href=\"#mikell-taylor\">Mikell Taylor</a> — Principal Technical Program Manager, Amazon Robotics</li><li><a href=\"#cynthia-yeung\">Cynthia Yeung</a> — Founding Board Member, Women in Robotics</li></ul><h3></h3><br/><p>\n\tClick the link under each section to jump back up to the list of experts.</p><p>\n<br/>\n</p><div class=\"horizontal-rule\">\n</div><h3></h3><br><img alt=\"Georgia Chalvatzaki\" class=\"rm-shortcode\" data-rm-shortcode-id=\"d9ae0cc979b5793242204a6da7df6c63\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"4bca5\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/georgia-chalvatzaki.jpg?id=31856994&width=980\"/><h3 class=\"rm-anchors\" id=\"georgia-chalvatzaki\"><a href=\"https://twitter.com/georgiachal/status/1576161102110420992\" rel=\"noopener noreferrer\" target=\"_blank\">Georgia Chalvatzaki<br/>\n</a>Assistant Professor, Technische Universität Darmstadt</h3><p>\n\tLooking at the Tesla Bot as a roboticist, I am impressed by what the engineers achieved for this prototype in a year. However, the behaviors demonstrated are less impressive than that of Honda’s Asimo from 20 years ago.\n</p><p>\n\tWhat excites me is the idea of cheap and accessible hardware! The electric motors with the battery support could make a very good tool for academic research. It takes way more to solve manipulation, but Academia looks forward to getting your hardware!\n</p><p class=\"caption\">\n\t[ <a href=\"#top\">BACK TO TOP</a> ↑ ]\n</p><div class=\"horizontal-rule\">\n</div><h3></h3><br><img alt=\"Kate Darling\" class=\"rm-shortcode\" data-rm-shortcode-id=\"e521d4d82ad7a54e907c33e5beffbe6c\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"4bb67\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/kate-darling.jpg?id=31857019&width=980\"/><h3 class=\"rm-anchors\" id=\"kate-darling\"><a href=\"https://twitter.com/grok_/status/1576266024261128192\" rel=\"noopener noreferrer\" target=\"_blank\">Kate Darling<br/>\n</a>Research Specialist, MIT Media Lab</h3><p>\n\tThe sense I’m getting is that Optimus isn’t as bad as people thought, but also, nobody [in the robotics community] is very impressed or surprised by any of the tech.\n</p><p class=\"caption\">\n\t[\n\t<a href=\"#top\">BACK TO TOP</a> ↑ ]\n</p><div class=\"horizontal-rule\">\n</div><h3></h3><br><img alt=\"Animesh Garg\" class=\"rm-shortcode\" data-rm-shortcode-id=\"aa2820305a095e6496cef6b119d16b1d\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"6a5f7\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/animesh-garg.jpg?id=31857020&width=980\"/><h3 class=\"rm-anchors\" id=\"animesh-garg\"><a href=\"https://animeshgarg.substack.com/p/tesla-ai-day-2022-optimus\" target=\"_blank\">Animesh Garg</a><br/>\nAssistant Professor, University of Toronto</h3><p>\n\tThe Optimus effort is, in a sense, no different from \n\t<a href=\"https://asimo.honda.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Asimo</a>, <a href=\"https://www.bostondynamics.com/atlas\" rel=\"noopener noreferrer\" target=\"_blank\">Atlas</a>, <a href=\"https://global.toyota/en/detail/19666346\" rel=\"noopener noreferrer\" target=\"_blank\">T-HR3</a>, or <a href=\"https://agilityrobotics.com/news/2019/meet-digit-the-newest-robot-from-agility-robotics\" rel=\"noopener noreferrer\" target=\"_blank\">Digit</a>. All of them are backed by expert roboticists with years of design experience. However, the Tesla Robotics team has done a commendable job in fast iteration time for the design of the robot from the ground up, [following the path from] a good experimental study on actuator requirements, to designing new actuators, then creating the integrated system. The current locomotion stack is not using any machine learning, but rather trajectory optimization using reference controllers. This is a sensible design choice to get up and running, but would definitely need redoing for longer-term operation.\n</p><p>\n\tThe hand also seems exciting, with a metallic cable-driven system with four fingers and a thumb. In the brief demo, they showed it had a reasonably high loading capacity (holding plant-watering water cans, and lifting bars of aluminum in the factory). However, due to the cable-driven design, the system will have slower response time, harder to do learning-based control, and no backdrivability in autonomous mode. This will make general-purpose autonomous manipulation slightly challenging.\n</p><p>\n\tRobots, in the short term, have use cases in places where they do not necessarily need to interact with humans and the implications of failure are less severe. The community needs to find a revenue-positive pathway to support this development. And this could come from behind-the-scenes use cases for robot manipulation, in warehouses, retail stores, food preparation, and manufacturing. While automation-based solutions are still being pursued, it remains to be seen how a general-purpose hardware-based solution would stack up. We would need to look to low-volume, high-variability products which require quick adaptation.\n</p><p>\n\tTesla would benefit a lot from collaborating with the community. Tesla already has the community taking notice, and by being more open, Elon would only empower more people to work on the problem—which is, after all, “beneficial to humanity” —which Elon claims is their driving principle. Designing the whole stack of hardware, simulation, and data infrastructure is requiring Tesla to reinvent the wheel on many fronts.\n</p><p>\n\tOverall, the current design is a very good first step. Interest in building such systems is welcome because Tesla and Elon Musk’s involvement in the problem brings attention, talent, and resources to the problem, setting in motion a flywheel of progress. This effort should be lauded with cautious optimism by the community, for the compass points in the right direction, and Elon brings with him the heft of Tesla engineers as we trek through the AI/Robotics jungle.\n</p><p class=\"caption\">\n\t[\n\t<a href=\"#top\">BACK TO TOP</a> ↑ ]\n</p><div class=\"horizontal-rule\">\n</div><h3></h3><br><div class=\"rblad-ieee_in_content\"></div><h3></h3><br/><img alt=\"Ryan Gariepy\" class=\"rm-shortcode\" data-rm-shortcode-id=\"2df41b550b8220d431718c848d2168bf\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"5c7d6\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/ryan-gariepy.jpg?id=31857021&width=980\"/><h3 class=\"rm-anchors\" id=\"ryan-gariepy\"><a href=\"https://www.linkedin.com/feed/update/urn:li:activity:6982004775533887488/\" rel=\"noopener noreferrer\" target=\"_blank\">Ryan Gariepy<br/>\n</a>CTO, Clearpath Robotics & OTTO Motors</h3><p>\n\tGreat credit to the engineering team who pulled it off, of course, but I’m not seeing anything particularly impressive here which we can attribute specifically to Elon or Tesla. Specifically, there were lots of arguments ahead of the unveil that one or more of the “Tesla FSD stack/data/EV experience” was going to let them leapfrog all of the other companies in the space and I didn’t see any of that.\n</p><p>\n\tThere’s also lots of credit going to Elon for saying that “it’s going to cost 20K,” which reminds me of all the 3D lidar companies that have been saying “our lidar will only cost [US] $100...if you pre-order 100K+ units.”</p><p>\n\tIn short, I’d bet that any decent university or corporate robotics lab with a similar budget and an active PR team would be able to pull this off.\n</p><p class=\"caption\">\n\t[\n\t<a href=\"#top\">BACK TO TOP</a> ↑ ]\n</p><div class=\"horizontal-rule\">\n</div><h3></h3><br><img alt=\"Keerthana Gopalakrishnan\" class=\"rm-shortcode\" data-rm-shortcode-id=\"074d7da16678affa07f40465058f291b\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"fa515\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/keerthana-gopalakrishnan.jpg?id=31857023&width=980\"/><h3 class=\"rm-anchors\" id=\"keerthana-gopalakrishnan\"><a href=\"https://twitter.com/keerthanpg/status/1576227115761926144?s=46&t=10KkYNDyNatBBM64f63arw\" rel=\"noopener noreferrer\" target=\"_blank\">Keerthana Gopalakrishnan<br/>\n</a>Roboticist, Google Brain</h3><p>\n\tOptimus reveal: Mind blown with the velocity of the team and the very sleek hardware design elements. Yet to see autonomy. Surprised Tesla went full Boston Dynamics mode with classical control/planning when it’s been around for a while…\n</p><p class=\"caption\">\n\t[ <a href=\"#top\">BACK TO TOP</a> ↑ ]\n</p><div class=\"horizontal-rule\">\n</div><h3></h3><br><img alt=\"Dennis Hong\" class=\"rm-shortcode\" data-rm-shortcode-id=\"b60b346912293cfae8bf24c528eb8d1b\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"5c1a8\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/dennis-hong.jpg?id=31857024&width=980\"/><h3 class=\"rm-anchors\" id=\"dennis-hong\"><a href=\"https://twitter.com/DennisHongRobot/status/1576304407389487105\" rel=\"noopener noreferrer\" target=\"_blank\">Dennis Hong<br/>\n</a>Professor, UCLA</h3><p>\n\tThe energy and excitement at AI Day 2 was amazing. “AI Day” is actually a recruitment event, and in that sense I believe the event was a big success.\n</p><p>\n\tI am aware of critics who say that the prototype had nothing new that they haven’t seen elsewhere, and that there are other, more impressive humanoids. There are also people who have doubts about the aggressive timeline Elon had proposed, and I do not necessarily disagree with them.\n</p><p>\n\tThat being said, I am a true believer of the future with humanoid robots and their eventual applications; that they will be used in our everyday lives “one day” and make our lives better. And for that to happen, we need to start somewhere and project Optimus is just that.\n</p><p>\n\tWhat was most impressive to me was what the Optimus team was able to accomplish in such a short period of time. If you are in this field, you would agree, too. The prototype they have created will serve as an excellent beginning platform for them to learn from and to build upon.\n</p><p>\n\tI would say this is their good first step towards something big—if Tesla truly commits to put its resources, time, and efforts into it long term. The company has great engineers, and with the newly recruited talents, I am even more excited to see what they’ll be able to accomplish next.\n</p><p class=\"caption\">\n\t[ <a href=\"#top\">BACK TO TOP</a> ↑ ]\n</p><div class=\"horizontal-rule\">\n</div><h3></h3><br><div class=\"rblad-ieee_in_content\"></div><h3></h3><br/><img alt=\"Christian Hubicki\" class=\"rm-shortcode\" data-rm-shortcode-id=\"fecc0ce40b91f2e1955cdc715d381f4c\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"a23e0\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/christian-hubicki.jpg?id=31857025&width=980\"/><h3 class=\"rm-anchors\" id=\"christian-hubicki\"><a href=\"https://twitter.com/chubicki/status/1576087846405828608\" rel=\"noopener noreferrer\" target=\"_blank\">Christian Hubicki<br/>\n</a>Assistant Professor, Florida State University</h3><p>\n\tAm I blown away? No. Am I laughing? No.\n</p><p>\n\tFirst, the team did a good job. They came a long way in about a year(?), going from zero-to-robot from the ground up. Also, doing a live demo without a tether (safety-catch rope) is braver than people know.\n</p><p>\n\tLet’s talk walking. I told my lab today that I expected it to walk on stage, and it did, but I was a bit surprised at how they did it. It <em>seems</em> to use a method called zero-moment point to maintain balance. It’s been used in various forms since the 1990s. You see ZMP in the bent knees and how it shifts its weight over to its next foot before taking a step. It’s pretty safe, but not mind-blowing in 2022. Also, people don’t walk quite like this. We are more efficient—we stick our foot out, fall, catch, repeat.\n</p><p>\n\tThere’s a portion showing off the vision, manipulation, and “smarts.” It’s hard for me to glean the methods here because it’s a cut video, so I don’t have much to say. I don’t know how much is pre-canned vs. online planning. I will also let everyone in on a secret about humanoids: It’s all about reliability. How often does it fall down? You can’t tell from a cool video—or even a live demo.\n</p><p>\n\tMusk mentioned a [US] $20K price point, which would be a big deal. The cheapest human-size humanoids I’m aware of are in the $150K range (a long way from the olden days of $1M price tags)… But I’ll believe the price when I can actually buy one.\n</p><p class=\"caption\">\n\t[ <a href=\"#top\">BACK TO TOP</a> ↑ ]\n</p><div class=\"horizontal-rule\">\n</div><h3></h3><br><img alt=\"Will Jackson\" class=\"rm-shortcode\" data-rm-shortcode-id=\"3a61e9fb33d7c013026db50c5437929a\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"e48c2\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/will-jackson.jpg?id=31857027&width=980\"/><h3 class=\"rm-anchors\" id=\"will-jackson\"><a href=\"https://www.linkedin.com/feed/update/urn:li:activity:6981994999450116096/\" rel=\"noopener noreferrer\" target=\"_blank\">Will Jackson<br/>\n</a>Founder and CEO, Engineered Arts</h3><p>[I was] fortunate enough to have been at the Optimus unveil in Palo Alto last night. Had a chance to check out the design and talk with many of the engineers involved.<br/></p><p>It’s generally an old-school series chain of actuators, excepting wrists and ankles, which are differential roll/pitch. Nothing novel in the kinematics. No mechanical energy storage, parallel springs, etc.—it’s not going to be efficient unless they change that.<br/></p><p>Two main classes [of actuators]: rotary and linear. Rotary is an integrated strain wave gear reduction (harmonic drive). Linear actuators are more interesting, integrated inverted roller screw drive. Playing with a drive, it’s not inherently very transparent—you certainly wouldn’t get a free swinging knee or hip joint. All the actuators look like they need and use active force loops. This looks nasty to me: It will complicate the control, reduce efficiency, and raise complexity. If they really want to get to [US] $20,000 a unit, this is not the way to go.<br/></p><p>Hands: One novel feature here is a clutch on the finger flex/extend. Playing with an actual hand, it felt like it worked quite nicely to decouple the finger from the drive; this will have advantages. The design of the hands leaves very little room for a compliant (soft) layer, and bare metal hands are a terrible idea—try picking up a glass of water with two metal spoons and you will know what I mean. No finger ab/adduction, only two DOFs in the thumb—no chance of doing anything human-level dexterous here.<br/></p><p>[Tesla has] a large team of highly capable engineers and will iterate quickly to better designs—if they can find a leader for the mechanical architecture with better ideas than they are currently showing.<br/></p><p>The elephant in the room is the application ideas, which are frankly ridiculous. I am amazed that Musk can address an audience so rapturously enamored with the idea of a humanoid and totally fail to recognize that their desire to interact with a robot is the killer application. Did he think they were applauding because finally the world will have a humanoid robot that can lift a pipe in a car factory?<br/></p><p>Summary: An extraordinarily brave live demonstration of a herculean effort that sadly lacks novelty and imagination. Hopefully we will see a course correction by the time of next year’s event.</p><p class=\"caption\">\n\t[ <a href=\"#top\">BACK TO TOP</a> ↑ ]\n</p><div class=\"horizontal-rule\">\n</div><h3></h3><br><img alt=\"Gary Marcus\" class=\"rm-shortcode\" data-rm-shortcode-id=\"29900e925735192e44986110dbc4b51b\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"65a41\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/gary-marcus.jpg?id=31857028&width=980\"/><h3 class=\"rm-anchors\" id=\"gary-marcus\"><a href=\"https://garymarcus.substack.com/p/sub-optimal\" rel=\"noopener noreferrer\" target=\"_blank\">Gary Marcus<br/>\n</a>Author, <em>Rebooting AI</em></h3><p>\n\tThe Optimus demo turned out to be a bit of a dud.\n</p><p>\n\tThe challenge for Tesla isn’t really so much the mere fact that Boston Dynamics robots are ahead (or that Agility Robotics is also doing similar work). With enough investment, Tesla might \n\t<em>in principle</em> catch up. If Musk really wants to win the robotics race, he has the resources to do so. (Though he clearly has not invested nearly enough so far.)\n</p><p>\n\tWhat I didn’t see last night was \n\t<em>vision</em>.\n</p><p>\n\tI mean this in two different senses.\n</p><p>\n\tFirst, there was no clearly outlined vision for what Optimus would do, nor much justification for why Tesla is building the robot in this specific way. There was no decisive justification for why to use a humanoid robot (rather than, for example, just an arm), no clarity about the first big application, no clear go-to-market strategy, and no clear product differentiator.\n</p><p>\n\tSecond, there was very little vision for how Tesla would build the \n\t<em>cognitive</em> part of the AI they will need, beyond the basics of motor control (which Boston Dynamics already does so well), nor much recognition about <em>why</em> robotics is so hard in the real world.\n</p><p>\n\tFor me, the most worrisome part of last night’s presentation was not the lack of a world-beating demo, but a lack of recognition of what would even be required.\n</p><p class=\"caption\">\n\t[ <a href=\"#top\">BACK TO TOP</a> ↑ ]\n</p><div class=\"horizontal-rule\">\n</div><h3></h3><br><div class=\"rblad-ieee_in_content\"></div><h3></h3><br><img alt=\"Brandon Rohrer\" class=\"rm-shortcode\" data-rm-shortcode-id=\"abada70213d5c3b1abefb5ba5a9a6d2b\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"9a726\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/brandon-rohrer.jpg?id=31857029&width=980\"/><h3 class=\"rm-anchors\" id=\"brandon-rohrer\"><a href=\"https://twitter.com/_brohrer_/status/1576368293719736320\" rel=\"noopener noreferrer\" target=\"_blank\">Brandon Rohrer<br/>\n</a>Machine Learning Engineer, LinkedIn</h3><p>\n\tHuge kudos to the Tesla team for putting the Optimus prototype together this quickly. Clearly a world-class engineering team at the top of their game. A lot of nights and weekends there. But it’s only about 5 percent of the way to what’s being sold.\n</p><p>\n\tThe upper body actuators have harmonic drives and the leg actuators are screw driven. Backdrivability can be added to some actuators if you also include torque sensors and close a very fast control loop around them. But it doesn’t come without adding cost and complexity to your design. Low backdrivability leaves a robot rigid to external forces. When you try to compensate for it through software control loops, you can get a telltale wobble. If you watch Optimus’s hands as it walks, you can see this wobble is in the 4-hertz range.\n</p><p>\n\tWe were also teased with the almost finished, “almost production-ready” model. It can wiggle its fingers, but the backdrivability limitations have not been addressed. These are all tractable problems, but they’re hard. Probably not 12 months out.\n</p><p>\n\tI’m delighted to see such an ambitious robot project in the world! But it doesn’t help the field of robotics to over-promise. We already tried this in the ’80s, and it took us 30 years to recover.\n</p><p class=\"caption\">\n\t[ <a href=\"#top\">BACK TO TOP</a> ↑ ]\n</p><div class=\"horizontal-rule\">\n</div><h3></h3><br><img alt=\"Siddhartha Srinivasa\" class=\"rm-shortcode\" data-rm-shortcode-id=\"02a52d4a3e700609fa78dfb58a00db20\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"edc3a\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/siddhartha-srinivasa.jpg?id=31857030&width=980\"/><h3 class=\"rm-anchors\" id=\"siddhartha-srinivasa\"><a href=\"https://twitter.com/siddhss5/status/1576569786686877697\" rel=\"noopener noreferrer\" target=\"_blank\">Siddhartha Srinivasa<br/>\n</a>Director of Robotics and AI, Amazon</h3><p>\n\tMy take on the Tesla Bot: You’re not as good as you think you are. You’re also not as bad as they think you are.\n</p><p class=\"caption\">\n\t[ <a href=\"#top\">BACK TO TOP</a> ↑ ]\n</p><div class=\"horizontal-rule\">\n</div><h3></h3><br><img alt=\"Mikell Taylor\" class=\"rm-shortcode\" data-rm-shortcode-id=\"a7286234b44878ad6bf08dde630cf5e1\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"9b6a3\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/mikell-taylor.jpg?id=31857032&width=980\"/><h3 class=\"rm-anchors\" id=\"mikell-taylor\"><a href=\"https://twitter.com/MikellTaylor/status/1576554770659409921\" rel=\"noopener noreferrer\" target=\"_blank\">Mikell Taylor<br/>\n</a>Principal Technical Program Manager, Amazon Robotics</h3><p>\n\tThere is no “doing it first” with an all-purpose humanoid robot that can 1:1 replace people. That’s simply not where the tech is now and it’s not where it’s going to be in the next 10 years, I will say with complete confidence.\n</p><p>\n\tThose of us in the industry were watching to see if Tesla somehow knew something we didn’t know. And…nope. They did not. The tech isn’t there for anyone. And that’s why the more generous takes some of us try to make for the sake of the engineering team are “you did as well as you could and you’re figuring out the state of the art quickly.” It’s not that team’s fault. There was no way to achieve an impossible goal.\n</p><p>\n\tHere’s the thing. What humanoid robotics needs is a realistic vision. A “here is exactly where this, a humanoid form factor, is needed instead of literally anything else” vision that acknowledges the realities of the technology. But that’s not what it was. It was “today we have this, in a year we’ll have sci-fi.” And that’s just not going to happen. Frankly, it’s disappointingly un-visionary. “Everyone else just hasn’t engineered hard enough” is not a vision. It’s ignorance.\n</p><p class=\"caption\">\n\t[ <a href=\"#top\">BACK TO TOP</a> ↑ ]\n</p><div class=\"horizontal-rule\">\n</div><h3></h3><br><img alt=\"Cynthia Yeung\" class=\"rm-shortcode\" data-rm-shortcode-id=\"e3028a4995b4ff02397904229ca3e8d7\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"9d4e1\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/cynthia-yeung.jpg?id=31857033&width=980\"/><h3 class=\"rm-anchors\" id=\"cynthia-yeung\"><a href=\"https://twitter.com/ctwy\" rel=\"noopener noreferrer\" target=\"_blank\">Cynthia Yeung<br/></a>Founding Board Member, Women in Robotics</h3><p>\n\tThings I liked:\n</p><ul>\n<li>Sharing the spotlight with engineers</li>\n<li>Cool actuators and simulators</li>\n<li>Expression of humility toward the end when [Musk] admits they may be “barking up the wrong tree” in terms of technical approach</li>\n</ul><p>\n\tThings I didn’t:\n</p><ul>\n<li>Musk, referring to competitors’ robots, is claiming that Optimus will be autonomous and cost < [US] $20k (<a href=\"https://en.wikipedia.org/wiki/BOM\" target=\"_blank\">BOM</a> or retail price?). From a product perspective, <$20k <a href=\"https://en.wikipedia.org/wiki/Capital_expenditure\" target=\"_blank\">capex</a> with zero recurring fees isn’t a great revenue model when all the robotics startups are moving toward <a href=\"https://en.wikipedia.org/wiki/Robot_as_a_service\" target=\"_blank\">RaaS</a> models.</li>\n<li>Battery details: Tesla claims [2.3 kWh] will be enough for a full day’s work. Agility Robotics’ Digit batteries last 3 hours for light duty. This doesn’t pass the sniff test.</li>\n<li>A lot of talk about joints and actuators. I think Musk seems to be enamored of the Boston Dynamics approach toward robots (form over function) as opposed to what a lot of other folks are working on (function informs form). Look, actuators are cool and all, but that’s not the hardest part about creating useful robots!</li>\n<li>The AI part seems to be conspicuously missing from Tesla AI Day.</li>\n<li>I love that Tesla has decided to create a five-fingered hand as opposed to a two- or three-finger pincer or vacuum-based pick-and-place approach. There’s a reason why all the warehouse startups don’t use handlike manipulation mechanisms.</li>\n<li>Another Tesla robotics engineer is talking about controls in the real world and state estimation. This is coming off as a grad student/TA doing a class presentation for a bunch of undergrads. Feels very 101. None of this is cutting edge. Hire some Ph.D.s and go to some robotics conferences, Tesla: IROS 2022 is coming up in a few weeks!</li>\n</ul><p class=\"caption\">\n\t[ <a href=\"#top\">BACK TO TOP</a> ↑ ]\n</p><div class=\"horizontal-rule\">\n</div></br></br></br></br></br></br></br></br></br></br></br></br></br></br>",
  "pubDate": "Tue, 04 Oct 2022 14:32:59 +0000",
  "guid": "https://spectrum.ieee.org/robotics-experts-tesla-bot-optimus",
  "category": [
    "Tesla",
    "Tesla bot",
    "Optimus robot",
    "Home robots",
    "Humanoid robots"
  ],
  "dc:creator": "Erico Guizzo",
  "media:content": ""
}