{
  "id": "tag:blogger.com,1999:blog-2471378914199150966.post-133027011330334491",
  "published": "2022-01-10T09:41:00.005-08:00",
  "updated": "2022-01-27T11:02:59.906-08:00",
  "category": "",
  "title": "Chrome 98 Beta: Color Gradient Vector Fonts, Region Capture Origin Trial, and More",
  "content": "<p>Unless otherwise noted, changes described below apply to the newest Chrome beta channel release for Android, Chrome OS, Linux, macOS, and Windows. Learn more about the features listed here through the provided links or from the list on <a href=\"https://www.chromestatus.com/features#milestone%3D76\">ChromeStatus.com</a>. Chrome 98 is beta as of January 10, 2022. You can <a href=\"https://www.google.com/chrome/beta/\">download the latest on Google.com</a>&nbsp;for desktop or on Google Play Store on Android.&nbsp;</p> <h1>COLRv1 Color Gradient Vector Fonts</h1><p>In this version Chrome supports COLRv1 color gradient vector fonts as an additional new font format. A color font contains glyphs with multiple colors in them, which can be for example an emoji or a country flag or a multi-colored letter. </p> <p>COLRv1 is an evolution of the COLRv0 font format intended to make color fonts widespread on the web. COLRv1 fonts bring expressive visual capabilities such as gradients, transforms and compositions at a very small font size. COLRv1 fonts also support OpenType variations. Internal shape reuse and a compact font format definition, plus effective compression, lead to very small font sizes. </p> <p>The image illustrates the example of Noto Color Emoji, which is about 9MB as a bitmap font, but only 1.85MB as a COLRv1 vector font (after WOFF2 compression). </p> <p></p><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://lh3.googleusercontent.com/-Psa5x-7_TgM/Ydxu1936XbI/AAAAAAAAByk/6zDM2_Zznm8t-WjHWN05mbEqc9MNjgU2ACNcBGAsYHQ/image.png\" style=\"margin-left: auto; margin-right: auto;\"><img alt=\"Two national park emojis, one crisp, one blurry and a bar chart comparing binary size of Noto Emoji as Bitmap font and as COLRv1 font, about 9MB vs. 1.85MB\" data-original-height=\"1400\" data-original-width=\"1400\" height=\"320\" src=\"https://lh3.googleusercontent.com/-Psa5x-7_TgM/Ydxu1936XbI/AAAAAAAAByk/6zDM2_Zznm8t-WjHWN05mbEqc9MNjgU2ACNcBGAsYHQ/w320-h320/image.png\" width=\"320\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\"><em style=\"text-align: left;\">Crisp COLRv1 vector font (left) compared to a bitmap font (right).<br />Noto Emoji font size as bitmap font vs. COLRv1 font after WOFF2 compression.</em><br /></td></tr></tbody></table><p>For more information, see <a href=\"https://developer.chrome.com/blog/colrv1-fonts/\">COLRv1 Color Gradient Vector Fonts in Chrome 98</a>.</p> <h1>Preparing for a Three Digit Version Number</h1><p>This year, Chrome will release version 100, adding a digit to the version number reported in Chrome's user agent string. To help site owners test for the new string, Chrome 96 introduced a runtime flag that causes Chrome to return '100' in its user agent string. This new flag called chrome://flags/#force-major-version-to-100 has been available from Chrome 96 onward. For more information, see <a href=\"https://developer.chrome.com/blog/force-major-version-to-100/\">Force Chrome major version to 100 in the User-Agent string</a>.</p> <h1>Origin Trials</h1><p>This version of Chrome introduces the origin trials described below. Origin trials allow you to try new features and give feedback on usability, practicality, and effectiveness to the web standards community. To register for any of the origin trials currently supported in Chrome, including the ones described below, visit the <a href=\"https://developers.chrome.com/origintrials/#/trials/active\">Chrome Origin Trials dashboard</a>. To learn more about origin trials in Chrome, visit the <a href=\"https://web.dev/origin-trials/\">Origin Trials Guide for Web Developers</a>. Microsoft Edge runs its own origin trials separate from Chrome. To learn more, see the <a href=\"https://developer.microsoft.com/en-us/microsoft-edge/origin-trials/\">Microsoft Edge Origin Trials Developer Console</a>. </p> <h2>New Origin Trial</h2> <h3>Region Capture</h3><p>Region Capture is an <a href=\"https://www.chromestatus.com/feature/5712447794053120\">API for cropping a self-capture video track</a>. Applications can currently obtain a capture of the tab in which they run using <code>getDisplayMedia()</code>, either with or without <code>preferCurrentTab</code>. In this case, the application may want to crop the resulting video track to remove some content from it (typically before sharing it remotely). </p> <h1>Other Features in this Release</h1> <h2>Adding auto Keyword for contain-intrinsic-size</h2><p>Support for <a href=\"https://www.chromestatus.com/feature/6740477866934272\">the auto keyword in <code>contain-intrinsic-size</code></a> is added, letting websites use the last-remembered size of an element (if any), which provides for a better user experience than for elements with <code>content-visibility: auto</code>. Without this feature, web developers have to guess the rendered size of the element; when used with <code>content-visibility: auto</code>, this may lead to elements jumping around.</p> <h2>AudioContext.outputLatency</h2><p>The new <a href=\"https://www.chromestatus.com/feature/5682265146261504\"><code>AudioContext.outputLatency</code> property</a> is an estimate in seconds of audio output latency. Technically, this is the interval between the time the user agent requests the host system to buffer and the time at which the first sample in the buffer is processed by the audio output device. For devices such as speakers or headphones that produce an acoustic signal, this latter time refers to the time when a sample's sound is produced. This is already implemented in Firefox.</p> <h2>CSS Color Adjust: 'only' Keyword for color-scheme</h2><div>The <code>only</code> keyword, which has been re-added to the specification for <code>color-scheme</code>, is <a href=\"https://www.chromestatus.com/feature/5157621012103168\">now supported in Chrome</a>. It allows opting out of color-scheme for single, specific elements. For example, this allows overriding of force darkening. A few examples illustrate its use.</div><p><br /><code>div { color-scheme: light } </code></p> <p>This forces the div element out of color-scheme dark.<br /><br /><code>div { color-scheme: only light } </code></p> <p>This keeps the <code>color-scheme</code> for the element light as above, and opts it out of forced darkening by the user agent.</p> <h2>document.adoptedStyleSheets is Now Mutable</h2><div><b>Note:</b> This feature was incorrectly listed as shipping in Chrome 98. It actually shipped in Chrome 99.</div><p>In compliance with the spec, <a href=\"https://www.chromestatus.com/feature/5638996492288000\">the <code>document.adoptedStyleSheets</code> property is now mutable</a>, meaning operations such as <code>push()</code> and <code>pop()</code> now work on it. The previous implementation of <code>adoptedStyleSheets</code> was unwieldy. For example, to add a sheet, the entire array had to be re-assigned:<br /><br /><code>document.adoptedStyleSheets = [...adoptedStyleSheets, newSheet];<br /></code><br />With the new implementation, the same operation looks like this:</p> <pre>document.adoptedStyleSheets.push(newSheet);<br /></pre> <h2>High Dynamic Range Color Media Queries</h2><p>Chrome now supports the CSS media queries <code>'dynamic-range'</code> and <code>'video-dynamic-range'</code> for <a href=\"https://www.chromestatus.com/feature/5680926106320896\">detecting the current display device's support for HDR</a>. Possible values are <code>'standard'</code> and <code>'high'</code>. These queries allow pages to toggle CSS rules or respond using <code>Window.matchMedia()</code>.</p> <h2>New window.open() Behavior for Popups, Tabs, and Windows</h2><p>As per a spec update, this version of Chrome lets you <a href=\"https://www.chromestatus.com/feature/5663031909416960\">specify whether <code>window.open()</code> launches a new window or a new tab</a>. The following examples show the new syntax. The first will open a pop up window. The second will open a new tab or window.<br /><br /><code>const popup = window.open('_blank','','popup=1');<br /><br />const tab = window.open('_blank','','popup=0');</code><br /><br />Additionally, <code>window.statusbar.visible</code> now correctly returns correct values: specifically, <code>false</code> for popups, and <code>true</code> for tabs, and windows.</p> <h2>Private Network Access Preflight Requests for Subresources</h2><p>CORS preflight requests are <a href=\"https://www.chromestatus.com/feature/5737414355058688\">now sent ahead of private network requests for subresources</a>, asking for explicit permission from the target server. A private network request is any request from a public website to a private IP address or localhost, or from a private website (e.g. intranet) to localhost. Sending a preflight request mitigates the risk of cross-site request forgery attacks against private network devices such as routers, which are often not prepared to defend against this threat.</p> <h2>structuredClone() Method on Windows and Workers</h2><p>Windows and Workers now support the <code>structuredClone()</code> methods for making deep copies of objects. A deep copy is one that copies an object's properties, but invokes itself recursively when it finds a reference to another object, creating a copy of that object as well. This ensures that two pieces of code don't accidentally share an object and unknowingly manipulate each others' state. For an explanation of deep copies and how to use them, see <a href=\"https://web.dev/structured-clone/\">Deep-copying in JavaScript using structuredClone</a>.</p> <h2>WebAuthn minPinLength Extension</h2><p><a href=\"https://www.chromestatus.com/feature/5729885776510976\">Chrome now</a> exposes the <a href=\"https://fidoalliance.org/specs/fido-v2.1-ps-20210615/fido-client-to-authenticator-protocol-v2.1-ps-20210615.html#sctn-minpinlength-extension\">CTAP 2.1 minPinLength extension via Web Authentication</a>. This allows sites preconfigured for a security key to learn the configured minimum PIN length for the authenticator. </p> <h2>Window Controls Overlay for Installed Desktop Web Apps</h2><p>When the <a href=\"https://www.chromestatus.com/feature/5741247866077184\">window controls overlay</a> is enabled for installed desktop web apps, the app's client area is extended to cover the entire window—including the title bar area—and the window control buttons (close, maximize/restore, minimize) are overlaid on top of the client area. The web developer is responsible for drawing and input-handling for the entire window except for the window controls overlay. Developers can use this feature to make their installed desktop web apps look like OS apps.</p> <h2>WritableStream controller AbortSignal</h2><p><a href=\"https://www.chromestatus.com/feature/5698931422920704\"><code>WritableStreamDefaultController</code> now supports a signal property</a> which returns an instance of <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/AbortSignal\"><code>AbortSignal</code></a>, allowing a <code>WritableStream</code> operation to be stopped if needed. The streams APIs provide ubiquitous, interoperable primitives for creating, composing, and consuming streams of data. This change permits an underlying sink to rapidly abort an ongoing write or close when requested by the writer. Previously, when <code>writer.abort()</code> was called, a long-running write would still have to continue to completion before the stream could be aborted. With this change, the write can be aborted immediately. In addition to being exposed to streams authored in JavaScript, this facility will also be used by platform-provided streams such as <code>WebTransport</code>.</p> <h1>Deprecations, and Removals</h1><p>This version of Chrome introduces the deprecations and removals listed below. Visit ChromeStatus.com for lists of <a href=\"https://www.chromestatus.com/features#browsers.chrome.status%3A%22Deprecated%22\">current deprecations</a>  and <a href=\"https://www.chromestatus.com/features#browsers.chrome.status:%22Removed%22\">previous removals</a>.</p> <h2>Remove SDES Key Exchange for WebRTC  </h2><p>The SDES key exchange mechanism for WebRTC has been declared a MUST NOT in the relevant IETF standards since 2013. Its usage in Chrome has declined significantly over the last year. <a href=\"https://chromestatus.com/features/5695324321480704\">SDES is removed</a> because it is a security problem. It exposes session keys to Javascript, which means that entities with access to the negotiation exchange, or with the ability to subvert the Javascript, can decrypt the media sent over the connection.</p>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Chromium Blog",
    "uri": "http://www.blogger.com/profile/06394244468194711527",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}