{
  "title": "68: Productivity VS. Effectiveness with Ari Meisel",
  "pubDate": "Fri, 03 Aug 2018 13:24:01 +0000",
  "guid": "7efeb6f306f5455bb75dc06c478d9410",
  "link": "https://sites.libsyn.com/94610/68-productivity-vs-effectiveness-with-ari-meisel",
  "itunes:image": "",
  "description": "<p>Modern life is so busy that we all feel like we’re continually hustling yet still falling behind. We all want more resources and advantage, especially to know the secrets of how to use our minds better to become more productive.<br /> <br /> A productivity expert, CEO and best-selling author who has built his career on teaching others how to work smarter—not harder—today’s guest Ari Meisel is here to tell us how we can all learn to be more effective in our daily lives and free up time for the more important things in life.<br /> <br /> So many of us have been taught that being productive is all-important, but the truth is that we should be thinking about how we can be more effective—that is, learning how to do more with the resources we already have, rather than burning out trying to produce more. Innovation never comes from having too many resources—it comes from restricting your resources, thinking innovatively about effectiveness and asking yourself: what’s a better way to do this?<br /> <br /> In today’s conversation, we talk about the difference between productivity and effectiveness, why the brain works better with constraints in place, why you should outsource your brain, and why you should take a hard look at how you are spending your time and money. If you love this episode, watch out for our upcoming second episode with Ari, where we’ll discuss the technology he uses to maintain his incredible levels of productivity. <br /> <br /> ** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access.</p>",
  "content:encoded": "<p>Modern life is so busy that we all feel like we’re continually hustling yet still falling behind. We all want more resources and advantage, especially to know the secrets of how to use our minds better to become more productive.  A productivity expert, CEO and best-selling author who has built his career on teaching others how to work smarter—not harder—today’s guest Ari Meisel is here to tell us how we can all learn to be more effective in our daily lives and free up time for the more important things in life.  So many of us have been taught that being productive is all-important, but the truth is that we should be thinking about how we can be more effective—that is, learning how to do more with the resources we already have, rather than burning out trying to produce more. Innovation never comes from having too many resources—it comes from restricting your resources, thinking innovatively about effectiveness and asking yourself: what’s a better way to do this?  In today’s conversation, we talk about the difference between productivity and effectiveness, why the brain works better with constraints in place, why you should outsource your brain, and why you should take a hard look at how you are spending your time and money. If you love this episode, watch out for our upcoming second episode with Ari, where we’ll discuss the technology he uses to maintain his incredible levels of productivity.   ** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access.</p>",
  "enclosure": "",
  "itunes:duration": "10:53",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Modern life is so busy that we all feel like we’re continually hustling yet still falling behind. We all want more resources and advantage, especially to know the secrets of how to use our minds better to become more productive.  A productivity...",
  "itunes:episodeType": "full"
}