{
  "title": "TU85: Attachment in the Classroom with Guest Linno Rhodes",
  "link": "https://therapistuncensored.com/episodes/tu85-attachment-in-the-classroom-with-guest-linno-rhodes/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu85-attachment-in-the-classroom-with-guest-linno-rhodes",
  "pubDate": "Fri, 14 Dec 2018 05:29:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=6662",
  "description": "Using the science of attachment, mentalization and emotional regulation in the classroom, and in this case, adult learners. A look at the take-aways from a tour of relational science experts, guest Linno Rhodes joins co-host Dr. Ann Kelley as they look at applying the skills learned in one’s life and the workplace.\n\nOur guest today shares herself as a case example of how learning about the use of attachment science and how it affects one’s perceptions of co-workers, employees and students can change your life personally, and your effectiveness in the workplace. For her that meant the lucky adult literacy students she gets to work with.\n\nTherapist Uncensored co-host Ann Kelley joins guest Linno Rhodes to uncover the difficulties and nuances of adult education, with special attention to dysregulation, attachment and barriers like literacy. Rhodes and Kelley share personal experiences with adjusting their mindsets in regards to education and how these shifts can allow for tremendous personal growth.\n\nLinno was so enthusiastic about learning about the relational sciences in her own life that she went after and received a fellowship from The Victorian Adult Literacy Education Council in Melbourne Australia. With this she came to Austin and met Sue and Ann, and then traveled the US interviewing thought leaders on the relational sciences to bring back to Australia. Now that is enthusiasm + passion + savvy guts!!\n\nCheck out her PDF presentation below that addresses mindsight, growth mindset versus fixed mindset, ideas to teach regulation, and lot’s of great suggestions that apply to many settings, not just education!\nIn this episode, TU85, we discuss:\n\n \tLinno’s take-aways from her thought-leader attachment tour and bringing her best practices back to Victoria, Australia\n \tHer background, experience, and focus on adult education\n \tThe trends in the classroom that impact the desire to learn, such as the barrier between literacy and illiteracy\n \tSome important factors in education such as tone, board preparation, greetings and eye contact\n \tReframing learning as a growth mindset, instead of a fixed mindset\n \tThe role of emotion regulation in the classroom\n \tMirror neurons and their role in the classroom\n \tTeaching tools about the relational sciences (see powerpoint below)\n\nResources from this episode:\n\n \tLinno Rhodes has worked in Adult Literacy Education for 15 years. Prior to this she worked with women and children escaping family violence. Through the 2017 Department of Education and Training Higher Education and Skills Group and the International Specialized Skills Institute she was awarded an International Vocational Training Practitioner Fellowship, which brought her to study in the US.\n \tEmail: LinnoRhodes@gmail.com\n \tReading Between the Lines-Seeing Invisible trauma – teaching and learning PDF\n \tDweck, C. (2017) Mindset: Changing the Way You Think to Fulfill Your Potential. Random House, New York\n \tOlson,K. (2014) The Invisible Classroom. Relationships, Neuroscience and Mindfulness in School, Norton\n \tRogers, C.R. & Freiberg, H.J. (1994). Freedom to Learn (3rd Ed). Columbus, OH: Merrill/Macmillan.\n \tSiegel, DJ (2012) Mindsight: Change Your Brain and Your Life. Scribe\n \tInternational Specialised Skills Institute http://www.issinstitute.org.au/\n \tOlympic Adult Education www.oae.vic.edu.au\n\nEnjoying the podcast? Then you’ll probably enjoy this previous episode as well,  Why Do We Over (or Under) React? The Neurobiological Underpinnings of Attachment Categories.\n\nJoin the Conversation\n\nThe easiest way to dive in is to like our Facebook – it’s an active page and there is even a private FB community where you can discuss directly with other listeners. Also we do a bit on Twitter if that’s how you roll! And you can find a couple forays into videos on You Tube if ya can believe that?\n\nFinally, join our email list through the front page of our website  (this gets you access to our private FB group...",
  "enclosure": "",
  "itunes:subtitle": "Using the science of attachment, mentalization and emotional regulation in the classroom, and in this case, adult learners. A look at the take-aways from a tour of relational science experts, guest Linno Rhodes joins co-host Dr.",
  "itunes:summary": "Using the science of attachment, mentalizing and emotional regulation in the classroom.  A look at the take-aways from a tour of relational science experts, guest Linno Rhodes joins co-host Dr. Ann Kelley as they look at applying the skills learned in one&apos;s life and the workplace.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "50:23"
}