{
  "title": "Episode 86: &#8220;LSD-25&#8221; by the Gamblers",
  "link": "https://500songs.com/podcast/episode-86-lsd-25-by-the-gamblers/",
  "pubDate": "Wed, 10 Jun 2020 19:43:06 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-86-lsd-25-by-the-gamblers/",
  "description": "Episode eighty-six of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"LSD-25\" by the Gamblers, the first rock song ever to namecheck acid, and a song by a band so obscure no photos exist of them. (The photo here is of the touring lineup of the Hollywood Argyles. Derry Weaver, the Gamblers' lead guitarist, is top left). Patreon backers also have a fifteen-minute bonus episode, on<a href=\"https://www.patreon.com/posts/38101595\"> \"Papa Oom Mow Mow\" by the Rivingtons</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust%20\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Erratum</strong>\n\nI repeatedly misspell and mispronounce Richie Podolor's surname as Polodor. I have no idea how i got this wrong, as it's not an error in any of the resources I used.\n\n<strong>Resources</strong>\n\nAs usual, I have put together <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-86-lsd-25/\">a Mixcloud mix</a> with every song excerpted in this podcast.\n\nThis episode, more than most, required tiny bits of information from dozens of sources. Among those I used were the<a href=\"http://www.bigvjamboree.com/DERRY-WEAVER-STORY.html\"> one existing interview with Derry Weaver</a> I have been able to find, <a href=\"https://amzn.to/2UyYkAN\">Dean Torrence's autobiography</a> , <a href=\"https://amzn.to/30u7T7N\">a book about John Dolphin by his son</a>, and <a href=\"https://amzn.to/2YmJ6zR\"><em>He's A Rebel</em>,</a> a biography of Phil Spector by Mark Ribkowsky.\n\nBut more than anything else, I used the self-published books by Stephen McParland,  who is the premier expert on surf music, and which you can buy in PDF form <a href=\"https://payhip.com/CMusicBooks\">here</a>. The ones I used the most were <em>The Beach Boys: Inception and Conception, California Confidential</em>, and <em>Surf & Hot-Rod Music Chronicles: Bull Sessions With the Big Daddy.</em>\n\n\"LSD-25\" is on numerous various-artists compilations of surf music, of which t<a href=\"https://amzn.to/3f9VUjS\">his two-CD set</a> looks like the best value for the casual listener.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them</a>?\n\n<strong>Transcript</strong>\n\nOn the sixteenth of April, 1943, Albert Hoffman, a research scientist in Zurich, had a curious experience after accidentally touching a tiny speck of the chemical he was experimenting with at the pharmaceutical lab in which he worked, and felt funny afterwards. Three days later, he decided to experiment on himself, and took a tiny dose of the chemical, to see if anything happened. He felt fine at first, but asked a colleague to escort him as he rode home on his bicycle. By the time he got home, he was convinced that his neighbour was a witch and that he had been poisoned.\n\nBut a few hours later, he felt a little better, though still unusual. As he would later report, \"Little by little I could begin to enjoy the unprecedented colors and plays of shapes that persisted behind my closed eyes. Kaleidoscopic, fantastic images surged in on me, alternating, variegated, opening and then closing themselves in circles and spirals, exploding in colored fountains, rearranging and hybridizing themselves in constant flux\".\n\nThe chemical he had taken was a derivative of ergotamine that had been discovered about five years earlier and mostly ignored up until that time, a chemical called D-lysergic acid diethylamide tartrate. Sandoz, the company he worked for, were delighted with this unusual chemical and its effects. They came up with some variants of the molecule without those effects, but which still affected the brain, and marketed those as migraine treatments. The chemical itself, they decided to make available as an experimental drug for psychiatrists and psychologists who wanted to investigate unusual states of consciousness. It found some uptake, among experimenters who wished to experience psychotic symptoms in a controlled environment in order to get a better understanding of their patients, or who wanted to investigate neurochemistry, and it had some promise as a treatment for alcoholism and various other psychiatric illnesses, and throughout the 1950s it was the subject of much medical research, under the trade name Sandoz came up with for it, Delysid.\n\nBut in the sixties, it became better known as LSD-25:\n\n[Excerpt: The Gamblers, \"LSD-25\"]\n\nThere are some records that one can look back at retrospectively and see that while they seemed unimportant at the time, they signalled a huge change in the musical culture. The single \"Moon Dawg\", backed by \"LSD-25\", by the Gamblers, is one of those records.\n\nUnfortunately, everything about the Gamblers is shrouded in mystery. The story I am going to tell here is the one that I've been able to piece together from stray fragments of recollection from the main participants over the years, but it could very well be wrong. Put it this way, on the record, there are two guitarists, bass, drums, and keyboards. I have seen fifteen people credited as having been members of the group that recorded the track.\n\nObviously, those credits can't all be true, so I'm going to go here with the stories of the people who are most commonly credited, but with the caveat that the people I'm talking about could very easily not have been the people on the record. I have also made mistakes about this single before -- there are a couple of errors in the piece on it in my book California Dreaming.\n\nPart of the problem is that almost everyone who has laid claim to being involved in the record is -- or was, as many of them have died -- a well-known credit thief, someone who will happily place themselves at the centre of the story, happily put their name on copyright forms for music with which they had no involvement, and then bitterly complain that they were the real unsung geniuses behind other records, but that some evil credit thief stole all their work.\n\nThe other people involved -- those who haven't said that everything was them and they did everything -- were for the most part jobbing musicians who, when asked about the record, would not even be sure if they'd played on it, because they played on so many records, and weren't asked about them for decades later.\n\nJust as one example, Nik Venet, who is generally credited as the producer of this record, said for years that Derry Weaver, the credited co-composer of the song and the person who is generally considered to have played lead guitar on it, was a pseudonym for himself. Later, when confronted with evidence that Derry Weaver was a real person, he admitted that Weaver *had* been a real person, but claimed that it was still a pseudonym for himself. Venet claimed that Weaver had died in a car crash years earlier, and that as a result he had been able to use his social security number on forms to claim himself extra money he wasn't entitled to as a staff producer.\n\nThe only problem with that story is that Venet died in 1998, while the real Derry Weaver died in 2013, but Weaver only ever did one interview I've been able to track down, in 2001, so Venet's lies went unchallenged, and many books still claim that Weaver never existed.\n\nSo today, I'm going to tell the story of a music scene, and use a few people as a focus, with the understanding that they may not be the people on the record we're talking about. I'm going to look at the birth of the surf and hot-rod studio scene in LA, and at Bruce Johnston, Kim Fowley, Derry Weaver, Nik Venet, Sandy Nelson, Elliot Ingber, Larry Taylor, Howard Hirsch, and Rod Schaffer, some or all of whom may or may not have been the Gamblers:\n\n[Excerpt: The Gamblers, \"Moon Dawg\"]\n\nPossibly the best place to start the story is at University High School, Los Angeles, in the late 1950s. University High had always had more than its fair share of star students over the years -- Judy Garland, Marilyn Monroe, and Elizabeth Taylor had all attended in previous years, and over the succeeding decades members of Sonic Youth, the Doors, Black Flag, the Foo Fighters and the Partridge Family would all attend the school, among many others. But during the period in the late fifties, it had a huge number of students who would go on to define the California lifestyle in the pop culture of the next few years. There was Sandra Dee, who starred in Gidget, the first Beach Party film; Anette Funicello, who starred in most of the other Beach Party films; Randy Newman, who would document another side of California life a few years later; and Nancy Sinatra, who was then just her famous father's daughter, but who would go on to make a series of magnificent records in the sixties with Lee Hazelwood.\n\nAnd there was a vocal group at the school called the Barons, one of the few interracial vocal groups around at the time. They had a black lead singer, Chuck Steele, a Japanese tenor, Wally Yagi, two Jewish boys, Arnie Ginsburg and John Saligman, and two white kids, Jan Berry -- who was the leader of the group, and Dean Torrence, his friend who could sing a little falsetto. As they were all singers, they were backed by three instrumentalists who also went to the school -- Berry's neighbour Bruce Johnston on piano, Torrence's neighbour Sandy Nelson on drums, and Nelson's friend Dave Shostac on saxophone.\n\nThis group played several gigs together, but slowly split apart as people's mothers wanted them to concentrate on school, or they got cars that they wanted to fix up. In Sandy Nelson's case he was sacked by Berry for playing his drums so loud -- as he packed up his kit for the last time, he told Berry, \"You'll see, I'm going to have a hit record that's *only* drums\".\n\nSlowly they were whittled down to three people -- Berry, Torrence, and Ginsburg, with occasional help from Berry's friend Don Altfeld. The Barons cut a demo tape of a song about a prominent local stripper, named Jennie Lee, but then Torrence decided to sign up with the Army. He'd discovered that if he did six months' basic training and joined the Army Reserves, he would be able to avoid being drafted a short while later. He thought that six months sounded a lot better than two years, so signed up, and he was on basic training when he heard a very familiar sounding record on the radio:\n\n[Excerpt: Jan and Arnie, \"Jennie Lee\"]\n\nHe was surprised to hear it, and also surprised to hear it credited to \"Jan and Arnie\" rather than \"the Barons\". He called Berry, who told him that no, it was a completely new recording -- though Torrence was absolutely certain that he could hear his own voice on there as well. What had happened, according to Jan, was that there'd been a problem with the tape, and he and Arnie had decided to rerecord it. He'd then gone into a professional studio to get the tape cut into an acetate, so he could play it at parties, and someone in the next room had happened to hear it -- and that someone happened to be Joe Lubin. Lubin was the Vice President of Arwin Records, a label owned by Marty Melcher, Doris Day's husband. He told Berry that he would make Jan and Arnie bigger than the Everly Brothers, but Jan didn't believe him, though he let him have a copy of the disc.\n\nJan took his copy to play at a friend's party, where it went down well. That friend was Craig Bruderlin, who later changed his name to James Brolin and became a major film star. Presumably Bruderlin's best friend Ryan O'Neal, who also went to University High, was there as well. I told you, University High School had a lot of future stars.\n\nAnd Jan and Arnie became two more of those stars. Joe Lubin overdubbed extra instruments on the track and released it. He didn't quite make them bigger than the Everly Brothers, but for a while they were almost as big -- at one point, the Everly Brothers were at number one in the charts, number two was Sheb Wooley with \"The Purple People Eater\", and number three was Jan and Arnie with \"Jennie Lee\". And Dean Torrence was off in the Army, regretting his choices. We'll be picking up on what happened with those three in a few months' time...\n\nBut what of the other Barons? The instrumentalists, Bruce Johnston, Dave Shostac, and Sandy Nelson, formed their own band, the Sleepwalkers, with various guitarists sitting in, often a young blues player called Henry Vestine, who had already started taking LSD at this time, though none of the other band members indulged. They would often play parties organised by another University High student, Kim Fowley. Now, Fowley is the person who spoke most about this time on the record, but he was also possibly the least honest person involved in this episode (and, if the accusations made about him since his death are true, also one of the most despicable people in this episode, which is quite a high bar...), so take this with a grain of salt. But Fowley claimed in later years that these parties were his major source of income -- that he would hire sex workers to take fellow University High students who had big houses off to a motel to have sex with them. While the students were otherwise occupied, Fowley would break into their house and move all the furniture, so people could dance, he'd get the band in, and he'd invite everyone to come to the party. Then dope dealers would sell dope to the partygoers, giving Fowley a cut, and meanwhile friends of Fowley's would be outside breaking into the partygoers' cars and stealing their stuff.\n\nBut then Fowley got arrested -- according to him, for stealing wine from a liquor store owned by a girlfriend who was twice his age, and selling it to other students at the school. He was given a choice of joining the Army or going to prison, and he chose the Army, on the same deal as Dean Torrence, who he ended up going through some of his training with.\n\nMeanwhile, Johnston, Shostac, and Nelson were trying to get signed as a band. They went to see John Dolphin on February the first, 1958. We've talked about Dolphin before, in the episodes on Gene and Eunice and the Penguins. Dolphin owned Dolphin's of Hollywood, the biggest black-owned record store in the LA area, and was responsible for a large part of the success of many of the records we've covered, through getting them played on radio shows broadcast from his station. He also owned a series of small labels which would put out one or two singles by an artist before the artist was snapped up by a bigger label. For example, he owned Cash Records, which had put out \"Walkin' Stick Boogie\", by Jerry Capehart and Eddie and Hank Cochran:\n\n[Excerpt: Jerry Capehart and the Cochran Brothers, \"Walkin' Stick Boogie\"]\n\nHe also owned a publishing company, which owned the publishing on \"Buzz Buzz Buzz\" by the Hollywood Flames:\n\n[Excerpt: The Hollywood Flames, \"Buzz Buzz Buzz\"]\n\nJohnston, Shostac, and Nelson hoped that maybe they could get signed to one of Dolphin's labels, but they chose the worst possible day to do it. While they were waiting to see Dolphin, they got talking to an older man, Percy Ivy, who started to tell them that Dolphin couldn't be trusted and that he owed Ivy a lot of money. They were used to hearing this kind of thing about people in the music business, and decided they'd go in to see Dolphin anyway. When they did, Ivy came in with them. What happened next is told differently by different people. What's definitely the case is that Ivy and Dolphin got into a heated row. Ivy claimed that Dolphin pulled a knife on him. Witness statements seem confused on the matter, but most say that all that Dolphin had in his hand was a cigar. Ivy pulled out a gun and shot Dolphin -- one shot also hit Shostac in the leg. Sandy Nelson ran out of the room to get help. Johnston comforted the dying Dolphin, but by the time Nelson got back, he was busily negotiating with Ivy, talking about how they were going to make a record together when Ivy got out of jail.\n\nOne presumes he was trying to humour Ivy, to make sure nobody else got shot.\n\nObviously, with John Dolphin having died, he wasn't going to be running a record company any more. The shop part of his business was, from then on, managed by his assistant, a failed singer called Rudy Ray Moore who later went on to become famous playing the comedy character Dolemite.\n\nThen the Sleepwalkers got a call from another acquaintance. Kip Tyler had a band called the Flips who had had some moderate success with rockabilly records produced by Milt Gabler. And this is one of the points where the conflicting narratives become most confusing. According to every one of the few articles I can find about Tyler, before forming the Flips he was the lead singer of the Sleepwalkers, the toughest rock and roll band in the school, when he was at Union High School. According to those same articles, he was born in 1929. So either there were two bands at Union High School, a decade apart, called the Sleepwalkers, one of which was a rock and roll band before the term had been coined; or Tyler was still at high school aged twenty-eight; or someone is deeply mistaken somewhere.\n\nKip and the Flips didn't have much recording success, and kept moving to smaller and smaller labels, but they were considered a hot band in LA -- in particular, they were the house band at Art Laboe's regular shows at El Monte stadium -- the shows which would later be immortalised by the Penguins in \"Memories of El Monte\".\n\n[Excerpt: The Penguins, \"Memories of El Monte\"]\n\nBut then the group's piano player, Larry Knechtel, saxophone player, Steve Douglas, and drummer, Mike Bermani, all left to join Duane Eddy's group. Kim Fowley was by this point a roadie and general hanger-on for the Flips, and he happened to know a piano player, a saxophone player, and a drummer who were looking for a gig, and so the Sleepwalkers joined Kip Tyler and guitarist Mike Deasy in the Flips, and took over that role performing at El Monte, performing themselves but also backing other musicians, like Ritchie Valens, who played at these shows.\n\nSandy Nelson didn't stay long in the Flips, though -- he was replaced by another drummer, Jim Troxel, and it was this lineup, with extra sax from Duane Eddy's sax player Jim Horn, that recorded \"Rumble Rock\":\n\n[Excerpt: Kip Tyler, \"Rumble Rock\"]\n\nNelson's departure from the group coincided with him starting to get a great deal of session work from people who had seen him play live. One of those people was a young man named Harvey Philip Spector, who went by his middle name. Spector went to Fairfax High, a school which had a strong rivalry with University High and produced a similarly ludicrous list of famous people, and he'd got his own little clique of people around him with whom he was making music. These included his best friend Marshall Leib, and sometimes also Leib's girlfriend's younger brother Russ Titelman. Spector and Leib had formed a vocal group, the Teddy Bears, with a girl they knew who then went by a different name but is now called Carol Connors.\n\nTheir first single was called \"To Know Him Is To Love Him\", inspired by the epitaph on Spector's father's grave:\n\n[Excerpt: The Teddy Bears, \"To Know Him is to Love Him\"]\n\nSandy Nelson played the drums on that, and the track went to number one. I've also seen some credits say that Bruce Johnston played the bass on it, but at the time Johnston wasn't a bass player, so this seems unlikely. Even though Nelson's playing on the track is absolutely rudimentary, it gave him the cachet to get other gigs, for example playing on Gene Vincent's \"Crazy Times\" LP:\n\n[Excerpt: Gene Vincent, \"She She Little Sheila\"]\n\nAnother record Nelson played on reunited him with Bruce Johnston. Kim Fowley was by this point doing some work for American International Pictures, and was asked to come up with an instrumental for a film called Ghost of Dragstrip Hollow, a film about a drag-racing club that have a Halloween party inside a deserted mansion but then discover a real monster has shown up. It's not as fun as it sounds.\n\nA songwriter friend of Fowley's named Nik Venet is credited with writing \"Geronimo\", although Richie Polodor, the guitarist and bass player on the session says he came up with it. Polodor said \"There are three guys in the business who really have no scruples whatsoever. They are Bruce Johnston, Kim Fowley and Sandy Nelson. And I was Mr. Scruples... I wrote both Geronimo and Charge, but they were taken away from me. It was all my stuff, but between Nik Venet, Kim Fowley and Bruce Johnston I had no chance. It was cut in my studio. I did all the guitars. I wrote it all and Nik Venet walked away with the credit.\"\n\nVenet did the howls on the track, Johnston played piano, Nelson drums, Polodor guitar and bass, and Fowley produced:\n\n[Excerpt: The Renegades, \"Geronimo\"]\n\nMeanwhile, Phil Spector had become disenchanted with being in the Teddy Bears, and had put together a solo instrumental single, under the name Phil Harvey:\n\n[Excerpt: Phil Harvey, \"Bumbershoot\"]\n\nSpector wanted a band to play a gig to promote that single, and he put together the Phil Harvey band from the members of another band that Marshall Leib had been in before joining the Teddy Bears. The Moon Dogs had consisted of a singer called Jett Power, guitarists Derry Weaver and Elliot Ingber, and bass player Larry Taylor, along with Leib. Taylor and Ingber joined the Phil Harvey band, along with keyboard player Howard Hirsch, and drummer Rod Schaffer.\n\nThe Phil Harvey band only played one gig -- the band's concept was apparently a mix of Duane Eddy style rock guitar instrumentals and complex jazz, with the group all dressed as mobsters -- but Kim Fowley happened to be there and liked what he saw, and made a note of some of those musicians as people to work with. Spector, meanwhile, had decided to use his connection with Lester Sill to go and work with Leiber and Stoller, and we'll be picking up that story in a couple of months.\n\nMeanwhile, Derry Weaver from the Moon Dogs had started to date Mary Jo Sheeley, the sister of Sharon Sheeley, and Sharon started to take an interest in her little sister's boyfriend and his friends. She suggested that Jett Power change his name to P.J. Proby, and she would regularly have him sing on the demos of her songs in the sixties:\n\n[Excerpt: P.J. Proby, \"The Other Side of Town\"]\n\nAnd she introduced Weaver to Eddie Cochran and Jerry Capehart. Cochran taught Weaver several of the guitar licks he used, and Capehart produced a session for Weaver with Cochran on guitar, Jim Stivers on piano, Guybo Smith on bass and Gene Riggio on drums:\n\n[Excerpt: Derry Weaver, \"Bad Baby Doll\"]\n\nThat track was not released until decades later, but several other songs by Weaver, with no Cochran involvement, were released on Capehart's own label (under the misspelled name Darry Weaver), and Capehart was Weaver's manager for a little while. Weaver was actually living at the Sheeley residence when they received the phone call saying that Eddie had died and Sharon was in hospital, and it haunted him deeply for the rest of his life.\n\nAnother record on which Guybo Smith played at this time was one by Sandy Nelson. The Flips had split up by this point -- Mike Deasy had gone on to join Eddie Cochran's backing band, and Bruce Johnston was playing on random sessions, so he was here for what was going to be Nelson's \"single that was only drums\". It wasn't quite only drums -- as well as Nelson on drums, there was Smith on bass, Johnston on piano, and Polodor on guitar. The musicians on the record have said they all deserved songwriting credit for it, but the writing credit went to Art Laboe and Nelson:\n\n[Excerpt: Sandy Nelson, \"Teen Beat\"]\n\n\"Teen Beat\" went to number four on the charts, and Nelson had a handful of other hits under his own name, including \"Let There Be Drums\". Less successful was a ballad released under the name \"Bruce and Jerry\", released on Arwin records after the owner's son, Terry Melcher, had remembered seeing the Sleepwalkers, and was desperate for some more rock and roll success on the label like Jan and Arnie, even though Melcher was a student at Beverly High and, like Fairfax, everyone at Beverly hated people at University High. \"Take This Pearl\" was sung by Johnston and Jerry Cooper, with backing by Johnston, Shostac, Deasy, Nelson, and bass player Harper Cosby, who would later play for Sam Cooke:\n\n[Excerpt: Bruce and Jerry, \"Take This Pearl\"]\n\n\"Take This Pearl\" by Bruce and Jerry did nothing, but Terry Melcher did think that name sounded good, except maybe it should be Terry instead of Jerry...\n\nMeanwhile, Nik Venet had got a production role at World Pacific Records, and he wanted to put together yet another studio group. And this is where some of the confusion comes in. Because this record was important, and everyone later wanted a piece of the credit. According to Nik Venet, the Gamblers were originally going to be called Nik and the Gamblers, and consisted of himself, Bruce Johnston, Sandy Nelson, Larry Taylor, and the great guitarist James Burton, with Richie Polodor engineering, and Kim Fowley involved somehow. Meanwhile, Fowley says he was not involved at all -- and given that this is about the only record in the history of the world that Fowley ever said he *wasn't* on, I tend to believe him. Elliot Ingber said that the group was Ingber, Taylor, Derry Weaver, Howard Hirsch, and Rod Schaffer. Bruce Johnston says he has no memory of the record. I don't know if anyone's ever asked James Burton about it, but it doesn't sound like him playing.\n\nGiven that the A-side is called \"Moon Dawg\", that Weaver and Taylor were in a band called The Moondogs that used to play a song called \"Moon Dog\", and that Weaver is credited as the writer, I think we can assume that the lead guitar is Derry Weaver, and that Elliot Ingber's list of credits is mostly correct. But on the other hand, one of the voices singing the wordless harmonies sounds *very* much like Bruce Johnston to me, and he has a very distinctive voice that I know extremely well. so my guess is that the Gamblers on this occasion were Derry Weaver, Larry Taylor, Elliot Ingber, Bruce Johnston, and either Rod Schaffer or Sandy Nelson -- probably Schaffer, since no-one other than Venet has credited Nelson with being there. I suspect Ingber is understandably misremembering Howard Hirsch being there because Hirsch *did* play on the second Gamblers single.\n\nThe B-side of the record is credited as written by Weaver and Taylor:\n\n[Excerpt: The Gamblers, \"LSD-25\"]\n\nThat song is called \"LSD-25\", and while we have said over and over that there is no first anything in rock music, this is an exception -- that is, without any doubt whatsoever, the first rock and roll record to mention LSD, and so in its way a distant ancestor of psychedelic music. Weaver and Taylor have said in later years that neither of them knew anything about the drug (and it's very clear that Johnston, who takes a very hardline anti-drugs stance, never indulged) -- they've said they read a magazine article about acid and liked the name. On the other hand, Henry Vestine was part of the same circle and he was apparently already taking acid by then, though details are vague (every single article I can find about it uses the same phrasing that Wikipedia does, talking of having taken it with \"a close musician friend\" -- who might have been one of the Gamblers, but who might not).\n\nSo the B-side was a milestone in rock music history, and in a different way so was the A-side, just written by Weaver:\n\n[Excerpt: The Gamblers, \"Moon Dawg\"]\n\n\"Moon Dawg\" was a local hit, but sold nothing anywhere outside Southern California, and there were a couple of follow-ups by different lineups of Gamblers, featuring some but never all of the same musicians, along with other people we've mentioned like Fowley. The Gamblers stopped being a thing, and Derry Weaver went off to join another group.\n\nKim Fowley and his friend Gary Paxton had put together a novelty record, \"Alley Oop\", under the name The Hollywood Argyles, which featured Gaynel Hodge on piano and Sandy Nelson banging a bin lid:\n\n[Excerpt: The Hollywood Argyles, \"Alley Oop\"]\n\nThat became a hit, and they had to put together a band to tour as the Hollywood Argyles, and Weaver became one of them, as did Marshall Leib. After that Weaver hooked up again with Nik Venet, who started getting him regular session work, as Venet had taken a job at Capitol Records.\n\nAnd Venet doing that suddenly meant that \"Moon Dawg\" became very important indeed. Even though it had been only a minor success, because Venet owned the rights to the master tape, and also the publishing rights, he got \"Moon Dawg\" stuck on a various-artists compilation album put out on Capitol, Golden Gassers, which featured big acts like Sam Cooke and the Four Preps, and which exposed the song to a wider audience. Cover versions of it started to sprout up, by people like the Ventures, the Surfaris, and the Beach Boys -- Larry Taylor's brother Mel was the drummer for the Ventures, which might have helped bring the track to their attention, while Nik Venet was the Beach Boys' producer. Indeed, some have claimed that Derry Weaver played on the Beach Boys' version -- he's credited on the session sheets, but nobody involved with the session has ever said if it was actually him, or whether that was just Venet putting down a friend's name to claim some extra money:\n\n[Excerpt: The Beach Boys, \"Moon Dawg\"]\n\nWhile there had been twangy guitar instrumentals before \"Moon Dawg\", and as I said, there's never a first anything, historians of the surf music genre now generally point to it as the first surf music record ever, and it's as good a choice as any. We won't be seeing anything more from Derry Weaver, who fell into obscurity after a few years of session work, but Bruce Johnston, Larry Taylor, Elliot Ingber, Henry Vestine, Nik Venet, Kim Fowley, Phil Spector, Jan Berry, Terry Melcher, and Dean Torrence will be turning up throughout the sixties, and in some cases later. The records we looked at today were the start of a California music scene that would define American pop music in the sixties.\n\nAs a final note, I mentioned Gaynel Hodge as the piano player on \"Alley Oop\". As I was in the middle of writing this episode, I received word that Hodge had died earlier this week. As people who've listened to earlier episodes of this podcast will know, Gaynel Hodge was one of the most important people in the fifties LA vocal group scene, and without him there would have been no Platters, Penguins, or Jesse Belvin. He was also one of the few links between that fifties world of black R&B musicians and the white-dominated sixties LA pop music scene of surf, hot rods, folk rock, and sunshine. He's unlikely to turn up again in more than minor roles in future episodes, but I've made this week's Patreon episode be on another classic record he played on. As well as being an important musician in his own right, Hodge was someone without whom almost none of the music made in LA in the fifties or sixties would have happened. He'll be missed.",
  "itunes:subtitle": "Episode eighty-six of A History of Rock Music in Five Hundred Songs looks at LSD-25 by the Gamblers, the first rock song ever to namecheck acid, and a song by a band so obscure no photos exist of them. (The photo here is of the touring lineup of the Holl",
  "itunes:keywords": "Art Laboe,Bruce Johnston,Carol Connors,Dave Shostac,Dean Torrence,Derry Weaver,Don Altfeld,Doris Day,Duane Eddy,Eddie Cochran,Elliot Ingber,Gary Paxton,Gaynel Hodge,Gene Vincent,Henry Vestine,James Burton,Jan and Arnie,Jan and Dean,Jan Berry,Jerry Capehart,Jim Horn,John Dolphin,Kim Fowley,Kip and the Flips,Larry Knechtel,Larry Taylor,LSD,Mike Deasy,Milt Gabler,Nik Venet,P.J. Proby,Phil Spector,psychedelia,Russ Titelman,Sandy Nelson,Sharon Sheeley,Steve Douglas,surf music,Terry Melcher,the Barons,The Beach Boys,The Gamblers,The Hollywood Argyles,the Ventures",
  "itunes:episodeType": "full",
  "itunes:episode": 86,
  "content:encoded": "Episode eighty-six of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"LSD-25\" by the Gamblers, the first rock song ever to namecheck acid, and a song by a band so obscure no photos exist of them. (The photo here is of the touring lineup of the Hollywood Argyles. Derry Weaver, the Gamblers' lead guitarist, is top left). Patreon backers also have a fifteen-minute bonus episode, on<a href=\"https://www.patreon.com/posts/38101595\"> \"Papa Oom Mow Mow\" by the Rivingtons</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust%20\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Erratum</strong>\n\nI repeatedly misspell and mispronounce Richie Podolor's surname as Polodor. I have no idea how i got this wrong, as it's not an error in any of the resources I used.\n\n<strong>Resources</strong>\n\nAs usual, I have put together <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-86-lsd-25/\">a Mixcloud mix</a> with every song excerpted in this podcast.\n\nThis episode, more than most, required tiny bits of information from dozens of sources. Among those I used were the<a href=\"http://www.bigvjamboree.com/DERRY-WEAVER-STORY.html\"> one existing interview with Derry Weaver</a> I have been able to find, <a href=\"https://amzn.to/2UyYkAN\">Dean Torrence's autobiography</a> , <a href=\"https://amzn.to/30u7T7N\">a book about John Dolphin by his son</a>, and <a href=\"https://amzn.to/2YmJ6zR\"><em>He's A Rebel</em>,</a> a biography of Phil Spector by Mark Ribkowsky.\n\nBut more than anything else, I used the self-published books by Stephen McParland,  who is the premier expert on surf music, and which you can buy in PDF form <a href=\"https://payhip.com/CMusicBooks\">here</a>. The ones I used the most were <em>The Beach Boys: Inception and Conception, California Confidential</em>, and <em>Surf & Hot-Rod Music Chronicles: Bull Sessions With the Big Daddy.</em>\n\n\"LSD-25\" is on numerous various-artists compilations of surf music, of which t<a href=\"https://amzn.to/3f9VUjS\">his two-CD set</a> looks like the best value for the casual listener.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them</a>?\n\n<strong>Transcript</strong>\n\nOn the sixteenth of April, 1943, Albert Hoffman, a research scientist in Zurich, had a curious experience after accidentally touching a tiny speck of the chemical he was experimenting with at the pharmaceutical lab in which he worked, and felt funny afterwards. Three days later, he decided to experiment on himself, and took a tiny dose of the chemical, to see if anything happened. He felt fine at first, but asked a colleague to escort him as he rode home on his bicycle. By the time he got home, he was convinced that his neighbour was a witch and that he had been poisoned.\n\nBut a few hours later, he felt a little better, though still unusual. As he would later report, \"Little by little I could begin to enjoy the unprecedented colors and plays of shapes that persisted behind my closed eyes. Kaleidoscopic, fantastic images surged in on me, alternating, variegated, opening and then closing themselves in circles and spirals, exploding in colored fountains, rearranging and hybridizing themselves in constant flux\".\n\nThe chemical he had taken was a derivative of ergotamine that had been discovered about five years earlier and mostly ignored up until that time, a chemical called D-lysergic acid diethylamide tartrate. Sandoz, the company he worked for, were delighted with this unusual chemical and its effects. They came up with some variants of the molecule without those effects, but which still affected the brain, and marketed those as migraine treatments. The chemical itself, they decided to make available as an experimental drug for psychiatrists and psychologists who wanted to investigate unusual states of consciousness. It found some uptake, among experimenters who wished to experience psychotic symptoms in a controlled environment in order to get a better understanding of their patients, or who wanted to investigate neurochemistry, and it had some promise as a treatment for alcoholism and various other psychiatric illnesses, and throughout the 1950s it was the subject of much medical research, under the trade name Sandoz came up with for it, Delysid.\n\nBut in the sixties, it became better known as LSD-25:\n\n[Excerpt: The Gamblers, \"LSD-25\"]\n\nThere are some records that one can look back at retrospectively and see that while they seemed unimportant at the time, they signalled a huge change in the musical culture. The single \"Moon Dawg\", backed by \"LSD-25\", by the Gamblers, is one of those records.\n\nUnfortunately, everything about the Gamblers is shrouded in mystery. The story I am going to tell here is the one that I've been able to piece together from stray fragments of recollection from the main participants over the years, but it could very well be wrong. Put it this way, on the record, there are two guitarists, bass, drums, and keyboards. I have seen fifteen people credited as having been members of the group that recorded the track.\n\nObviously, those credits can't all be true, so I'm going to go here with the stories of the people who are most commonly credited, but with the caveat that the people I'm talking about could very easily not have been the people on the record. I have also made mistakes about this single before -- there are a couple of errors in the piece on it in my book California Dreaming.\n\nPart of the problem is that almost everyone who has laid claim to being involved in the record is -- or was, as many of them have died -- a well-known credit thief, someone who will happily place themselves at the centre of the story, happily put their name on copyright forms for music with which they had no involvement, and then bitterly complain that they were the real unsung geniuses behind other records, but that some evil credit thief stole all their work.\n\nThe other people involved -- those who haven't said that everything was them and they did everything -- were for the most part jobbing musicians who, when asked about the record, would not even be sure if they'd played on it, because they played on so many records, and weren't asked about them for decades later.\n\nJust as one example, Nik Venet, who is generally credited as the producer of this record, said for years that Derry Weaver, the credited co-composer of the song and the person who is generally considered to have played lead guitar on it, was a pseudonym for himself. Later, when confronted with evidence that Derry Weaver was a real person, he admitted that Weaver *had* been a real person, but claimed that it was still a pseudonym for himself. Venet claimed that Weaver had died in a car crash years earlier, and that as a result he had been able to use his social security number on forms to claim himself extra money he wasn't entitled to as a staff producer.\n\nThe only problem with that story is that Venet died in 1998, while the real Derry Weaver died in 2013, but Weaver only ever did one interview I've been able to track down, in 2001, so Venet's lies went unchallenged, and many books still claim that Weaver never existed.\n\nSo today, I'm going to tell the story of a music scene, and use a few people as a focus, with the understanding that they may not be the people on the record we're talking about. I'm going to look at the birth of the surf and hot-rod studio scene in LA, and at Bruce Johnston, Kim Fowley, Derry Weaver, Nik Venet, Sandy Nelson, Elliot Ingber, Larry Taylor, Howard Hirsch, and Rod Schaffer, some or all of whom may or may not have been the Gamblers:\n\n[Excerpt: The Gamblers, \"Moon Dawg\"]\n\nPossibly the best place to start the story is at University High School, Los Angeles, in the late 1950s. University High had always had more than its fair share of star students over the years -- Judy Garland, Marilyn Monroe, and Elizabeth Taylor had all attended in previous years, and over the succeeding decades members of Sonic Youth, the Doors, Black Flag, the Foo Fighters and the Partridge Family would all attend the school, among many others. But during the period in the late fifties, it had a huge number of students who would go on to define the California lifestyle in the pop culture of the next few years. There was Sandra Dee, who starred in Gidget, the first Beach Party film; Anette Funicello, who starred in most of the other Beach Party films; Randy Newman, who would document another side of California life a few years later; and Nancy Sinatra, who was then just her famous father's daughter, but who would go on to make a series of magnificent records in the sixties with Lee Hazelwood.\n\nAnd there was a vocal group at the school called the Barons, one of the few interracial vocal groups around at the time. They had a black lead singer, Chuck Steele, a Japanese tenor, Wally Yagi, two Jewish boys, Arnie Ginsburg and John Saligman, and two white kids, Jan Berry -- who was the leader of the group, and Dean Torrence, his friend who could sing a little falsetto. As they were all singers, they were backed by three instrumentalists who also went to the school -- Berry's neighbour Bruce Johnston on piano, Torrence's neighbour Sandy Nelson on drums, and Nelson's friend Dave Shostac on saxophone.\n\nThis group played several gigs together, but slowly split apart as people's mothers wanted them to concentrate on school, or they got cars that they wanted to fix up. In Sandy Nelson's case he was sacked by Berry for playing his drums so loud -- as he packed up his kit for the last time, he told Berry, \"You'll see, I'm going to have a hit record that's *only* drums\".\n\nSlowly they were whittled down to three people -- Berry, Torrence, and Ginsburg, with occasional help from Berry's friend Don Altfeld. The Barons cut a demo tape of a song about a prominent local stripper, named Jennie Lee, but then Torrence decided to sign up with the Army. He'd discovered that if he did six months' basic training and joined the Army Reserves, he would be able to avoid being drafted a short while later. He thought that six months sounded a lot better than two years, so signed up, and he was on basic training when he heard a very familiar sounding record on the radio:\n\n[Excerpt: Jan and Arnie, \"Jennie Lee\"]\n\nHe was surprised to hear it, and also surprised to hear it credited to \"Jan and Arnie\" rather than \"the Barons\". He called Berry, who told him that no, it was a completely new recording -- though Torrence was absolutely certain that he could hear his own voice on there as well. What had happened, according to Jan, was that there'd been a problem with the tape, and he and Arnie had decided to rerecord it. He'd then gone into a professional studio to get the tape cut into an acetate, so he could play it at parties, and someone in the next room had happened to hear it -- and that someone happened to be Joe Lubin. Lubin was the Vice President of Arwin Records, a label owned by Marty Melcher, Doris Day's husband. He told Berry that he would make Jan and Arnie bigger than the Everly Brothers, but Jan didn't believe him, though he let him have a copy of the disc.\n\nJan took his copy to play at a friend's party, where it went down well. That friend was Craig Bruderlin, who later changed his name to James Brolin and became a major film star. Presumably Bruderlin's best friend Ryan O'Neal, who also went to University High, was there as well. I told you, University High School had a lot of future stars.\n\nAnd Jan and Arnie became two more of those stars. Joe Lubin overdubbed extra instruments on the track and released it. He didn't quite make them bigger than the Everly Brothers, but for a while they were almost as big -- at one point, the Everly Brothers were at number one in the charts, number two was Sheb Wooley with \"The Purple People Eater\", and number three was Jan and Arnie with \"Jennie Lee\". And Dean Torrence was off in the Army, regretting his choices. We'll be picking up on what happened with those three in a few months' time...\n\nBut what of the other Barons? The instrumentalists, Bruce Johnston, Dave Shostac, and Sandy Nelson, formed their own band, the Sleepwalkers, with various guitarists sitting in, often a young blues player called Henry Vestine, who had already started taking LSD at this time, though none of the other band members indulged. They would often play parties organised by another University High student, Kim Fowley. Now, Fowley is the person who spoke most about this time on the record, but he was also possibly the least honest person involved in this episode (and, if the accusations made about him since his death are true, also one of the most despicable people in this episode, which is quite a high bar...), so take this with a grain of salt. But Fowley claimed in later years that these parties were his major source of income -- that he would hire sex workers to take fellow University High students who had big houses off to a motel to have sex with them. While the students were otherwise occupied, Fowley would break into their house and move all the furniture, so people could dance, he'd get the band in, and he'd invite everyone to come to the party. Then dope dealers would sell dope to the partygoers, giving Fowley a cut, and meanwhile friends of Fowley's would be outside breaking into the partygoers' cars and stealing their stuff.\n\nBut then Fowley got arrested -- according to him, for stealing wine from a liquor store owned by a girlfriend who was twice his age, and selling it to other students at the school. He was given a choice of joining the Army or going to prison, and he chose the Army, on the same deal as Dean Torrence, who he ended up going through some of his training with.\n\nMeanwhile, Johnston, Shostac, and Nelson were trying to get signed as a band. They went to see John Dolphin on February the first, 1958. We've talked about Dolphin before, in the episodes on Gene and Eunice and the Penguins. Dolphin owned Dolphin's of Hollywood, the biggest black-owned record store in the LA area, and was responsible for a large part of the success of many of the records we've covered, through getting them played on radio shows broadcast from his station. He also owned a series of small labels which would put out one or two singles by an artist before the artist was snapped up by a bigger label. For example, he owned Cash Records, which had put out \"Walkin' Stick Boogie\", by Jerry Capehart and Eddie and Hank Cochran:\n\n[Excerpt: Jerry Capehart and the Cochran Brothers, \"Walkin' Stick Boogie\"]\n\nHe also owned a publishing company, which owned the publishing on \"Buzz Buzz Buzz\" by the Hollywood Flames:\n\n[Excerpt: The Hollywood Flames, \"Buzz Buzz Buzz\"]\n\nJohnston, Shostac, and Nelson hoped that maybe they could get signed to one of Dolphin's labels, but they chose the worst possible day to do it. While they were waiting to see Dolphin, they got talking to an older man, Percy Ivy, who started to tell them that Dolphin couldn't be trusted and that he owed Ivy a lot of money. They were used to hearing this kind of thing about people in the music business, and decided they'd go in to see Dolphin anyway. When they did, Ivy came in with them. What happened next is told differently by different people. What's definitely the case is that Ivy and Dolphin got into a heated row. Ivy claimed that Dolphin pulled a knife on him. Witness statements seem confused on the matter, but most say that all that Dolphin had in his hand was a cigar. Ivy pulled out a gun and shot Dolphin -- one shot also hit Shostac in the leg. Sandy Nelson ran out of the room to get help. Johnston comforted the dying Dolphin, but by the time Nelson got back, he was busily negotiating with Ivy, talking about how they were going to make a record together when Ivy got out of jail.\n\nOne presumes he was trying to humour Ivy, to make sure nobody else got shot.\n\nObviously, with John Dolphin having died, he wasn't going to be running a record company any more. The shop part of his business was, from then on, managed by his assistant, a failed singer called Rudy Ray Moore who later went on to become famous playing the comedy character Dolemite.\n\nThen the Sleepwalkers got a call from another acquaintance. Kip Tyler had a band called the Flips who had had some moderate success with rockabilly records produced by Milt Gabler. And this is one of the points where the conflicting narratives become most confusing. According to every one of the few articles I can find about Tyler, before forming the Flips he was the lead singer of the Sleepwalkers, the toughest rock and roll band in the school, when he was at Union High School. According to those same articles, he was born in 1929. So either there were two bands at Union High School, a decade apart, called the Sleepwalkers, one of which was a rock and roll band before the term had been coined; or Tyler was still at high school aged twenty-eight; or someone is deeply mistaken somewhere.\n\nKip and the Flips didn't have much recording success, and kept moving to smaller and smaller labels, but they were considered a hot band in LA -- in particular, they were the house band at Art Laboe's regular shows at El Monte stadium -- the shows which would later be immortalised by the Penguins in \"Memories of El Monte\".\n\n[Excerpt: The Penguins, \"Memories of El Monte\"]\n\nBut then the group's piano player, Larry Knechtel, saxophone player, Steve Douglas, and drummer, Mike Bermani, all left to join Duane Eddy's group. Kim Fowley was by this point a roadie and general hanger-on for the Flips, and he happened to know a piano player, a saxophone player, and a drummer who were looking for a gig, and so the Sleepwalkers joined Kip Tyler and guitarist Mike Deasy in the Flips, and took over that role performing at El Monte, performing themselves but also backing other musicians, like Ritchie Valens, who played at these shows.\n\nSandy Nelson didn't stay long in the Flips, though -- he was replaced by another drummer, Jim Troxel, and it was this lineup, with extra sax from Duane Eddy's sax player Jim Horn, that recorded \"Rumble Rock\":\n\n[Excerpt: Kip Tyler, \"Rumble Rock\"]\n\nNelson's departure from the group coincided with him starting to get a great deal of session work from people who had seen him play live. One of those people was a young man named Harvey Philip Spector, who went by his middle name. Spector went to Fairfax High, a school which had a strong rivalry with University High and produced a similarly ludicrous list of famous people, and he'd got his own little clique of people around him with whom he was making music. These included his best friend Marshall Leib, and sometimes also Leib's girlfriend's younger brother Russ Titelman. Spector and Leib had formed a vocal group, the Teddy Bears, with a girl they knew who then went by a different name but is now called Carol Connors.\n\nTheir first single was called \"To Know Him Is To Love Him\", inspired by the epitaph on Spector's father's grave:\n\n[Excerpt: The Teddy Bears, \"To Know Him is to Love Him\"]\n\nSandy Nelson played the drums on that, and the track went to number one. I've also seen some credits say that Bruce Johnston played the bass on it, but at the time Johnston wasn't a bass player, so this seems unlikely. Even though Nelson's playing on the track is absolutely rudimentary, it gave him the cachet to get other gigs, for example playing on Gene Vincent's \"Crazy Times\" LP:\n\n[Excerpt: Gene Vincent, \"She She Little Sheila\"]\n\nAnother record Nelson played on reunited him with Bruce Johnston. Kim Fowley was by this point doing some work for American International Pictures, and was asked to come up with an instrumental for a film called Ghost of Dragstrip Hollow, a film about a drag-racing club that have a Halloween party inside a deserted mansion but then discover a real monster has shown up. It's not as fun as it sounds.\n\nA songwriter friend of Fowley's named Nik Venet is credited with writing \"Geronimo\", although Richie Polodor, the guitarist and bass player on the session says he came up with it. Polodor said \"There are three guys in the business who really have no scruples whatsoever. They are Bruce Johnston, Kim Fowley and Sandy Nelson. And I was Mr. Scruples... I wrote both Geronimo and Charge, but they were taken away from me. It was all my stuff, but between Nik Venet, Kim Fowley and Bruce Johnston I had no chance. It was cut in my studio. I did all the guitars. I wrote it all and Nik Venet walked away with the credit.\"\n\nVenet did the howls on the track, Johnston played piano, Nelson drums, Polodor guitar and bass, and Fowley produced:\n\n[Excerpt: The Renegades, \"Geronimo\"]\n\nMeanwhile, Phil Spector had become disenchanted with being in the Teddy Bears, and had put together a solo instrumental single, under the name Phil Harvey:\n\n[Excerpt: Phil Harvey, \"Bumbershoot\"]\n\nSpector wanted a band to play a gig to promote that single, and he put together the Phil Harvey band from the members of another band that Marshall Leib had been in before joining the Teddy Bears. The Moon Dogs had consisted of a singer called Jett Power, guitarists Derry Weaver and Elliot Ingber, and bass player Larry Taylor, along with Leib. Taylor and Ingber joined the Phil Harvey band, along with keyboard player Howard Hirsch, and drummer Rod Schaffer.\n\nThe Phil Harvey band only played one gig -- the band's concept was apparently a mix of Duane Eddy style rock guitar instrumentals and complex jazz, with the group all dressed as mobsters -- but Kim Fowley happened to be there and liked what he saw, and made a note of some of those musicians as people to work with. Spector, meanwhile, had decided to use his connection with Lester Sill to go and work with Leiber and Stoller, and we'll be picking up that story in a couple of months.\n\nMeanwhile, Derry Weaver from the Moon Dogs had started to date Mary Jo Sheeley, the sister of Sharon Sheeley, and Sharon started to take an interest in her little sister's boyfriend and his friends. She suggested that Jett Power change his name to P.J. Proby, and she would regularly have him sing on the demos of her songs in the sixties:\n\n[Excerpt: P.J. Proby, \"The Other Side of Town\"]\n\nAnd she introduced Weaver to Eddie Cochran and Jerry Capehart. Cochran taught Weaver several of the guitar licks he used, and Capehart produced a session for Weaver with Cochran on guitar, Jim Stivers on piano, Guybo Smith on bass and Gene Riggio on drums:\n\n[Excerpt: Derry Weaver, \"Bad Baby Doll\"]\n\nThat track was not released until decades later, but several other songs by Weaver, with no Cochran involvement, were released on Capehart's own label (under the misspelled name Darry Weaver), and Capehart was Weaver's manager for a little while. Weaver was actually living at the Sheeley residence when they received the phone call saying that Eddie had died and Sharon was in hospital, and it haunted him deeply for the rest of his life.\n\nAnother record on which Guybo Smith played at this time was one by Sandy Nelson. The Flips had split up by this point -- Mike Deasy had gone on to join Eddie Cochran's backing band, and Bruce Johnston was playing on random sessions, so he was here for what was going to be Nelson's \"single that was only drums\". It wasn't quite only drums -- as well as Nelson on drums, there was Smith on bass, Johnston on piano, and Polodor on guitar. The musicians on the record have said they all deserved songwriting credit for it, but the writing credit went to Art Laboe and Nelson:\n\n[Excerpt: Sandy Nelson, \"Teen Beat\"]\n\n\"Teen Beat\" went to number four on the charts, and Nelson had a handful of other hits under his own name, including \"Let There Be Drums\". Less successful was a ballad released under the name \"Bruce and Jerry\", released on Arwin records after the owner's son, Terry Melcher, had remembered seeing the Sleepwalkers, and was desperate for some more rock and roll success on the label like Jan and Arnie, even though Melcher was a student at Beverly High and, like Fairfax, everyone at Beverly hated people at University High. \"Take This Pearl\" was sung by Johnston and Jerry Cooper, with backing by Johnston, Shostac, Deasy, Nelson, and bass player Harper Cosby, who would later play for Sam Cooke:\n\n[Excerpt: Bruce and Jerry, \"Take This Pearl\"]\n\n\"Take This Pearl\" by Bruce and Jerry did nothing, but Terry Melcher did think that name sounded good, except maybe it should be Terry instead of Jerry...\n\nMeanwhile, Nik Venet had got a production role at World Pacific Records, and he wanted to put together yet another studio group. And this is where some of the confusion comes in. Because this record was important, and everyone later wanted a piece of the credit. According to Nik Venet, the Gamblers were originally going to be called Nik and the Gamblers, and consisted of himself, Bruce Johnston, Sandy Nelson, Larry Taylor, and the great guitarist James Burton, with Richie Polodor engineering, and Kim Fowley involved somehow. Meanwhile, Fowley says he was not involved at all -- and given that this is about the only record in the history of the world that Fowley ever said he *wasn't* on, I tend to believe him. Elliot Ingber said that the group was Ingber, Taylor, Derry Weaver, Howard Hirsch, and Rod Schaffer. Bruce Johnston says he has no memory of the record. I don't know if anyone's ever asked James Burton about it, but it doesn't sound like him playing.\n\nGiven that the A-side is called \"Moon Dawg\", that Weaver and Taylor were in a band called The Moondogs that used to play a song called \"Moon Dog\", and that Weaver is credited as the writer, I think we can assume that the lead guitar is Derry Weaver, and that Elliot Ingber's list of credits is mostly correct. But on the other hand, one of the voices singing the wordless harmonies sounds *very* much like Bruce Johnston to me, and he has a very distinctive voice that I know extremely well. so my guess is that the Gamblers on this occasion were Derry Weaver, Larry Taylor, Elliot Ingber, Bruce Johnston, and either Rod Schaffer or Sandy Nelson -- probably Schaffer, since no-one other than Venet has credited Nelson with being there. I suspect Ingber is understandably misremembering Howard Hirsch being there because Hirsch *did* play on the second Gamblers single.\n\nThe B-side of the record is credited as written by Weaver and Taylor:\n\n[Excerpt: The Gamblers, \"LSD-25\"]\n\nThat song is called \"LSD-25\", and while we have said over and over that there is no first anything in rock music, this is an exception -- that is, without any doubt whatsoever, the first rock and roll record to mention LSD, and so in its way a distant ancestor of psychedelic music. Weaver and Taylor have said in later years that neither of them knew anything about the drug (and it's very clear that Johnston, who takes a very hardline anti-drugs stance, never indulged) -- they've said they read a magazine article about acid and liked the name. On the other hand, Henry Vestine was part of the same circle and he was apparently already taking acid by then, though details are vague (every single article I can find about it uses the same phrasing that Wikipedia does, talking of having taken it with \"a close musician friend\" -- who might have been one of the Gamblers, but who might not).\n\nSo the B-side was a milestone in rock music history, and in a different way so was the A-side, just written by Weaver:\n\n[Excerpt: The Gamblers, \"Moon Dawg\"]\n\n\"Moon Dawg\" was a local hit, but sold nothing anywhere outside Southern California, and there were a couple of follow-ups by different lineups of Gamblers, featuring some but never all of the same musicians, along with other people we've mentioned like Fowley. The Gamblers stopped being a thing, and Derry Weaver went off to join another group.\n\nKim Fowley and his friend Gary Paxton had put together a novelty record, \"Alley Oop\", under the name The Hollywood Argyles, which featured Gaynel Hodge on piano and Sandy Nelson banging a bin lid:\n\n[Excerpt: The Hollywood Argyles, \"Alley Oop\"]\n\nThat became a hit, and they had to put together a band to tour as the Hollywood Argyles, and Weaver became one of them, as did Marshall Leib. After that Weaver hooked up again with Nik Venet, who started getting him regular session work, as Venet had taken a job at Capitol Records.\n\nAnd Venet doing that suddenly meant that \"Moon Dawg\" became very important indeed. Even though it had been only a minor success, because Venet owned the rights to the master tape, and also the publishing rights, he got \"Moon Dawg\" stuck on a various-artists compilation album put out on Capitol, Golden Gassers, which featured big acts like Sam Cooke and the Four Preps, and which exposed the song to a wider audience. Cover versions of it started to sprout up, by people like the Ventures, the Surfaris, and the Beach Boys -- Larry Taylor's brother Mel was the drummer for the Ventures, which might have helped bring the track to their attention, while Nik Venet was the Beach Boys' producer. Indeed, some have claimed that Derry Weaver played on the Beach Boys' version -- he's credited on the session sheets, but nobody involved with the session has ever said if it was actually him, or whether that was just Venet putting down a friend's name to claim some extra money:\n\n[Excerpt: The Beach Boys, \"Moon Dawg\"]\n\nWhile there had been twangy guitar instrumentals before \"Moon Dawg\", and as I said, there's never a first anything, historians of the surf music genre now generally point to it as the first surf music record ever, and it's as good a choice as any. We won't be seeing anything more from Derry Weaver, who fell into obscurity after a few years of session work, but Bruce Johnston, Larry Taylor, Elliot Ingber, Henry Vestine, Nik Venet, Kim Fowley, Phil Spector, Jan Berry, Terry Melcher, and Dean Torrence will be turning up throughout the sixties, and in some cases later. The records we looked at today were the start of a California music scene that would define American pop music in the sixties.\n\nAs a final note, I mentioned Gaynel Hodge as the piano player on \"Alley Oop\". As I was in the middle of writing this episode, I received word that Hodge had died earlier this week. As people who've listened to earlier episodes of this podcast will know, Gaynel Hodge was one of the most important people in the fifties LA vocal group scene, and without him there would have been no Platters, Penguins, or Jesse Belvin. He was also one of the few links between that fifties world of black R&B musicians and the white-dominated sixties LA pop music scene of surf, hot rods, folk rock, and sunshine. He's unlikely to turn up again in more than minor roles in future episodes, but I've made this week's Patreon episode be on another classic record he played on. As well as being an important musician in his own right, Hodge was someone without whom almost none of the music made in LA in the fifties or sixties would have happened. He'll be missed.",
  "enclosure": "",
  "itunes:summary": "Episode eighty-six of A History of Rock Music in Five Hundred Songs looks at \"LSD-25\" by the Gamblers, the first rock song ever to namecheck acid, and a song by a band so obscure no photos exist of them. (The photo here is of the touring lineup of the Hollywood Argyles. Derry Weaver, the Gamblers' lead guitarist, is top left). Patreon backers also have a fifteen-minute bonus episode, on \"Papa Oom Mow Mow\" by the Rivingtons.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nErratum\n\nI repeatedly misspell and mispronounce Richie Podolor's surname as Polodor. I have no idea how i got this wrong, as it's not an error in any of the resources I used.\n\nResources\n\nAs usual, I have put together a Mixcloud mix with every song excerpted in this podcast.\n\nThis episode, more than most, required tiny bits of information from dozens of sources. Among those I used were the one existing interview with Derry Weaver I have been able to find, Dean Torrence's autobiography , a book about John Dolphin by his son, and He's A Rebel, a biography of Phil Spector by Mark Ribkowsky.\n\nBut more than anything else, I used the self-published books by Stephen McParland,  who is the premier expert on surf music, and which you can buy in PDF form here. The ones I used the most were The Beach Boys: Inception and Conception, California Confidential, and Surf & Hot-Rod Music Chronicles: Bull Sessions With the Big Daddy.\n\n\"LSD-25\" is on numerous various-artists compilations of surf music, of which this two-CD set looks like the best value for the casual listener.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nOn the sixteenth of April, 1943, Albert Hoffman, a research scientist in Zurich, had a curious experience after accidentally touching a tiny speck of the chemical he was experimenting with at the pharmaceutical lab in which he worked, and felt funny afterwards. Three days later, he decided to experiment on himself, and took a tiny dose of the chemical, to see if anything happened. He felt fine at first, but asked a colleague to escort him as he rode home on his bicycle. By the time he got home, he was convinced that his neighbour was a witch and that he had been poisoned.\n\nBut a few hours later, he felt a little better, though still unusual. As he would later report, \"Little by little I could begin to enjoy the unprecedented colors and plays of shapes that persisted behind my closed eyes. Kaleidoscopic, fantastic images surged in on me, alternating, variegated, opening and then closing themselves in circles and spirals, exploding in colored fountains, rearranging and hybridizing themselves in constant flux\".\n\nThe chemical he had taken was a derivative of ergotamine that had been discovered about five years earlier and mostly ignored up until that time, a chemical called D-lysergic acid diethylamide tartrate. Sandoz, the company he worked for, were delighted with this unusual chemical and its effects. They came up with some variants of the molecule without those effects, but which still affected the brain, and marketed those as migraine treatments. The chemical itself, they decided to make available as an experimental drug for psychiatrists and psychologists who wanted to investigate unusual states of consciousness. It found some uptake, among experimenters who wished to experience psychotic symptoms in a controlled environment in order to get a better understanding of their patients, or who wanted to investigate neurochemistry, and it had some promise as a treatment for alcoholism and various other psychiatric illnesses, and throughout the 1950s it was the subject of much medical research, under the trade name Sandoz came up with for it, Delysid.\n\nBut in the sixties, it became better known as LSD-25:\n\n[Excerpt: The ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode eighty-six of A History of Rock Music in Five Hundred Songs looks at \"LSD-25\" by the Gamblers, the first rock song ever to namecheck acid, and a song by a band so obscure no photos exist of them. (The photo here is of the touring lineup of the Hollywood Argyles. Derry Weaver, the Gamblers' lead guitarist, is top left). Patreon backers also have a fifteen-minute bonus episode, on \"Papa Oom Mow Mow\" by the Rivingtons.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nErratum\n\nI repeatedly misspell and mispronounce Richie Podolor's surname as Polodor. I have no idea how i got this wrong, as it's not an error in any of the resources I used.\n\nResources\n\nAs usual, I have put together a Mixcloud mix with every song excerpted in this podcast.\n\nThis episode, more than most, required tiny bits of information from do",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}