{
  "title": "Drilling down on water access as drought becomes the ‘new normal’&#160;&#160;",
  "link": "https://publicintegrity.org/environment/natural-resources/drilling-down-on-water-access-as-drought-becomes-the-new-normal/",
  "dc:creator": "Yvette Cabrera",
  "pubDate": "Fri, 28 Oct 2022 11:30:00 +0000",
  "category": [
    "Natural Resources",
    "Watchdog newsletter"
  ],
  "guid": "https://publicintegrity.org/?p=116858",
  "description": "<figure><img width=\"300\" height=\"200\" src=\"https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?fit=300%2C200&ssl=1\" class=\"attachment-medium size-medium wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?w=2560&ssl=1 2560w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?resize=300%2C200&ssl=1 300w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?resize=1024%2C683&ssl=1 1024w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?resize=768%2C512&ssl=1 768w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?resize=1536%2C1024&ssl=1 1536w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?resize=2048%2C1365&ssl=1 2048w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?resize=1200%2C800&ssl=1 1200w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?resize=1568%2C1045&ssl=1 1568w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?resize=400%2C267&ssl=1 400w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?resize=150%2C100&ssl=1 150w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?w=2340&ssl=1 2340w\" sizes=\"(max-width: 34.9rem) calc(100vw - 2rem), (max-width: 53rem) calc(8 * (100vw / 12)), (min-width: 53rem) calc(6 * (100vw / 12)), 100vw\" /></figure>\n<p>Crystal Tulley-Cordova’s job is addressing one of the most pressing needs of the Navajo Nation: access to clean water.&#160; Water is a calling that Tulley-Cordova, 39 and an enrolled member of the Navajo Nation, was drawn to from an early age. She and her family experienced the struggles of accessing safe drinking water, traveling long [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://publicintegrity.org/environment/natural-resources/drilling-down-on-water-access-as-drought-becomes-the-new-normal/\">Drilling down on water access as drought becomes the ‘new normal’&nbsp;&nbsp;</a> appeared first on <a rel=\"nofollow\" href=\"https://publicintegrity.org\">Center for Public Integrity</a>.</p>\n",
  "content:encoded": "<figure><img width=\"300\" height=\"200\" src=\"https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?fit=300%2C200&ssl=1\" class=\"attachment-medium size-medium wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?w=2560&ssl=1 2560w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?resize=300%2C200&ssl=1 300w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?resize=1024%2C683&ssl=1 1024w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?resize=768%2C512&ssl=1 768w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?resize=1536%2C1024&ssl=1 1536w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?resize=2048%2C1365&ssl=1 2048w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?resize=1200%2C800&ssl=1 1200w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?resize=1568%2C1045&ssl=1 1568w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?resize=400%2C267&ssl=1 400w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?resize=150%2C100&ssl=1 150w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1240701723-scaled.jpg?w=2340&ssl=1 2340w\" sizes=\"(max-width: 34.9rem) calc(100vw - 2rem), (max-width: 53rem) calc(8 * (100vw / 12)), (min-width: 53rem) calc(6 * (100vw / 12)), 100vw\" /></figure><span class=\"rt-reading-time\" style=\"display: block;\"><span class=\"rt-label rt-prefix\">Reading Time: </span> <span class=\"rt-time\">9</span> <span class=\"rt-label rt-postfix\">minutes</span></span>\n<p>Crystal Tulley-Cordova’s job is addressing one of the most pressing needs of the Navajo Nation: access to clean water.&nbsp;</p>\n\n\n\n<p>Water is a calling that Tulley-Cordova, 39 and an enrolled member of the Navajo Nation, was drawn to from an early age. She and her family experienced the struggles of accessing safe drinking water, traveling long distances over dirt roads to meet their basic water needs on a daily basis.</p>\n\n\n\n<p>Today, she is the principal hydrologist for the Navajo Nation Department of Water Resources’ water management branch. She tackles a wide array of issues across more than 27,000 square miles of reservation land: securing water rights, providing access to clean water during the COVID-19 pandemic, offering her expertise on water development projects.&nbsp;&nbsp;</p>\n\n\n\n<div class=\"is-layout-flow wp-block-group alignwide newspack-pattern subscribe__style-6 is-style-border compress-newsletter has-secondary-background-color has-background\"><div class=\"wp-block-group__inner-container\">\n<div class=\"is-layout-flex wp-container-27 wp-block-columns are-vertically-aligned-center\">\n<div class=\"is-layout-flow wp-block-column is-vertically-aligned-center\">\n<p class=\"has-white-color has-text-color\"><meta charset=\"utf-8\"><strong>Watchdog delivered </strong></p>\n\n\n\n<p class=\"has-white-color has-text-color has-small-font-size\">Want our investigations in your inbox? Subscribe to our Watchdog newsletter.</p>\n</div>\n\n\n\n<div class=\"is-layout-flow wp-block-column is-vertically-aligned-center\"><amp-layout id=\"n047\">\n\t<div class=\"wp-block-jetpack-mailchimp\" data-blog-id=\"201594328\">\n\t\t<form\n\t\t\taria-describedby=\"wp-block-jetpack-mailchimp_consent-text\"\n\t\t\t\t\t>\n\t\t\t<p>\n\t\t\t\t<input\n\t\t\t\t\taria-label=\"Enter your email\"\n\t\t\t\t\tplaceholder=\"Enter your email\"\n\t\t\t\t\trequired\n\t\t\t\t\ttitle=\"Enter your email\"\n\t\t\t\t\ttype=\"email\"\n\t\t\t\t\tname=\"email\"\n\t\t\t\t/>\n\t\t\t</p>\n\t\t\t\t\t\t\t<input\n\t\t\t\t\tname=\"interests[3f37dae637]\"\n\t\t\t\t\ttype=\"hidden\"\n\t\t\t\t\tclass=\"mc-submit-param\"\n\t\t\t\t\tvalue=\"1\"\n\t\t\t\t/>\n\t\t\t\t\t\t\t\t\t\n<div class=\"wp-block-jetpack-button wp-block-button\" style=\"\"><button class=\"wp-block-button__link has-background has-primary-background-color\" style=\"\" data-id-attr=\"mailchimp-button-block-25\" id=\"mailchimp-button-block-25\" type=\"submit\"><strong>Sign up</strong></button></div>\n\t\t\t<p id=\"wp-block-jetpack-mailchimp_consent-text\">\n\t\t\t\t\t\t\t</p>\n\n\t\t\t\n\t\t</form>\n\t\t\n\t\t\t<div class=\"wp-block-jetpack-mailchimp_notification wp-block-jetpack-mailchimp_processing\" role=\"status\">\n\t\t\t\tProcessing…\t\t\t</div>\n\t\t\t<div class=\"wp-block-jetpack-mailchimp_notification wp-block-jetpack-mailchimp_success\" role=\"status\">\n\t\t\t\tSuccess! You&#039;re on the list.\t\t\t</div>\n\t\t\t<div class=\"wp-block-jetpack-mailchimp_notification wp-block-jetpack-mailchimp_error\" role=\"alert\">\n\t\t\t\tWhoops! There was an error and we couldn&#039;t process your subscription. Please reload the page and try again.\t\t\t</div>\n\n\t\t\t</div>\n\t</amp-layout></div>\n</div>\n</div></div>\n\n\n\n<p>When she joined the agency in 2018 she achieved a long-time goal: giving back to her community by working to improve water security for the Navajo people, the Diné. Last year, the American Indian Science and Engineering Society <a href=\"https://www.youtube.com/watch?v=M_-a7yLOznA\">selected</a> Tulley-Cordova as Professional of the Year.&nbsp;</p>\n\n\n\n<p>Tulley-Cordova sees water quality playing a critical role in people’s health. She witnessed first-hand the devastating impacts of environmental degradation on community members who lived in regions affected by uranium mining pollution, which seeped into drinking water and can trigger conditions including cancer.&nbsp;</p>\n\n\n\n<p>She grew up in Rock Springs, New Mexico, where she now lives with her husband, their two young children and her parents. Her mother, who hails from Rock Springs, fought and survived a painful battle with breast cancer when Tulley-Cordova was a teenager. Her maternal grandmother, who was diagnosed with lung cancer, did not survive. She is the eldest daughter of Earl Tulley, a longtime environmental justice advocate who has worked to address contamination issues impacting Navajo communities.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n\n\n\n<p>She has a doctoral degree in geology and an interdisciplinary graduate certificate in sustainability from the University of Utah.&nbsp;</p>\n\n\n\n<p><em>This conversation has been edited for length and clarity.</em></p>\n\n\n\n<p><strong>Q.</strong> <strong>You grew up within a community that had water access issues. Can you talk about how those experiences growing up inspired you to seek a career that would address those water access issues?</strong></p>\n\n\n\n<p>My earliest water memory is hearing water getting heated up on a stove so that I could take a bath. I was probably around two or three. After that, early water memories also consist of hauling water, so [going] to a livestock well to get water. We relied on unregulated water, and I didn&#8217;t know that until I began to learn about water — like there&#8217;s a Clean Water Act, there&#8217;s regulated water from a tap; how is that different than where we used to get water?&nbsp;</p>\n\n\n\n<p>I&#8217;ve always had an interest in water. I did a fourth-grade science project: a water filtration project, using different sediments, and filtering out water to [study] the turbidity of water.&nbsp;</p>\n\n\n\n<p>[In college] I took geology courses, and I really enjoy being in the field, enjoy this interaction between ground water, knowing about geology and where water is stored, because in the Navajo Nation we don&#8217;t have a lot of surface water. We have a lot of groundwater. So just having this understanding that water is so powerful that it can form things like Canyon de Chelly and the Grand Canyon.&nbsp;</p>\n\n\n\n<p>But also, water is so powerful that you can see exposed outcrops of places where we get water, like the Navajo sandstone, the coconino sandstone. That&#8217;s where we get our water from, so it&#8217;s just mind boggling as you look at the pores, using a hand lens, of those geologic formations, to think: Wow! The water that we have is coming from these formations.</p>\n\n\n\n<p>Also, a lot of the work that my dad did with environmental justice, being an environmental justice advocate, was also related to water. There&#8217;s this nexus between uranium contamination and water contamination. I just had a greater desire to learn more about it. Going to school, it used to be weird telling people I grew up without running water. And I realized then that there&#8217;s also social justice issues associated with who I am, where I am from, where our marginalized communities were impacted by social and environmental justice.&nbsp;</p>\n\n\n\n<p>Then going to college realizing that the <a href=\"https://www.usbr.gov/climate/secure/docs/2016secure/factsheet/ColoradoRiverBasinFactSheet.pdf\">Seven Basin States</a> had representatives that signed a <a href=\"https://www.usbr.gov/lc/region/pao/pdfiles/crcompct.pdf\">foundational document</a> for the Colorado River, but tribes didn&#8217;t have all of their water rights resolved. … There&#8217;s 30 tribes in the Colorado River Basin; there&#8217;s a portion that do have secured water rights. But there&#8217;s a good portion that doesn&#8217;t have secured water rights. And as climate change impacts continue to occur, our reliability on water is critical for not only Native Americans, but the human race.&nbsp;</p>\n\n\n\n<p>Everything in our environment is reliant upon water, and having that understanding, all of the complexity of it really intrigued me, but also the desire to improve the area that I come from. So to now be back in the Navajo Nation is like living the dream.&nbsp;</p>\n\n\n\n<p>But also, living the dream doesn&#8217;t mean that it&#8217;s always happy. It&#8217;s like a roller coaster where you experience great moments, but you also really experience sad, disheartening moments.</p>\n\n\n\n<p><strong>Q.</strong> <strong>Can you talk about the intersection of the environmental health issues and the potential exposure of the Navajo community to pollution issues that intersect with water like uranium contamination? How big of a role did that play in your decision to pursue a career in water resources?</strong></p>\n\n\n\n<p>My decision to be a water manager, specifically to be a hydrologist, was related to the opportunity to address the disparity of people not having water. There&#8217;s a lot of improvement of life that comes with having piped water. And not only that aspect, but also the aspect of environmental justice issues.&nbsp;</p>\n\n\n\n<p>I feel like the greatest way to make change is working from the inside out, meaning you&#8217;re a part of an organization; you make recommendations; you&#8217;re an adviser, an expert [working] to improve the quality of life. And in this case, working as a water manager, I am improving the quality of life for Navajo residents, so that we can get out of the survival mode and go into a thriving mode.&nbsp;</p>\n\n\n\n<p>For a long time, Indigenous people in this country, after contact, have had to learn how to survive. But the work that I&#8217;m a part of is really about the opportunity to help Indigenous people — the first Americans of this country ​​— be able to thrive. And how can we do that? We can do that through water development, because water development is a critical foundation to economic development, to improvement of reservations.</p>\n\n\n\n<p><strong>Q.</strong> <strong>What would you say are the most pressing issues facing the Navajo Nation connected to water?&nbsp;</strong></p>\n\n\n\n<p>The mission of what we do is to protect and manage water resources for the Navajo Nation, and there&#8217;s a large percentage of Navajo residents that don&#8217;t have piped water. So there&#8217;s this development push for improvement of water. That&#8217;s a mitigation strategy to address climate change impacts in the Navajo Nation specifically on water.&nbsp;</p>\n\n\n\n<p>At the time that I started my job, [we were facing] 20 years of drought. The Navajo Nation is experiencing short-term, long-term drought.</p>\n\n\n\n<p>And when you&#8217;re doing these projects like building regional water supply systems, working on securing water rights, you&#8217;re [addressing] a priority that secures water for your community and creates sustainability.&nbsp;&nbsp;</p>\n\n\n\n<p><strong>Q. The COVID-19 pandemic highlighted the needs around access to water. You came up with specific solutions in response to that. Could you talk about the work that you did in that area?</strong></p>\n\n\n\n<p>As the pandemic happened, it put a spotlight on the disparities and on the clean water access gap that was in existence in the Navajo Nation. Not only in the Navajo Nation: for other tribes and Alaska Native villages throughout the United States, and in addition to that, rural communities.&nbsp;</p>\n\n\n\n<p>When the COVID pandemic happened, at the start of it, the CDC [Centers for Disease Control and Prevention] asks you to wear a mask and wash your hands often. How do you do that if you&#8217;re a water hauler [who lacks running water]?&nbsp;</p>\n\n\n\n<p>And you&#8217;ll hear variable numbers, like almost 40% [of the population doesn’t have piped water] is what the president of the Navajo Nation has described in Senate testimony. And then you&#8217;ll hear from the Indian Health Service that maybe it&#8217;s closer to 10 to 20%, depending on what report you use.&nbsp;</p>\n\n\n\n<p>But in all honesty, no one knows the right number, because there&#8217;s never been a water census, meaning someone going to every home to ask who has piped water and who doesn&#8217;t. So that&#8217;s why there&#8217;s so much variability in the percentage of homes, the number of people impacted. No one knows those true numbers.&nbsp;</p>\n\n\n\n<p>So what did we do to be able to address the clean water access gap? In collaboration with the Indian Health Service, the Navajo Nation COVID-19 Water Access Coordination group formed, and the first wave of money came with the <a href=\"https://www.kff.org/coronavirus-covid-19/issue-brief/the-coronavirus-aid-relief-and-economic-security-act-summary-of-key-health-provisions/\">CARES Act</a>, $3.5 million, and that money was used to create 59 transitional water points. There&#8217;s 110 Navajo communities, and out of those 110 only a portion of them have permanent <a href=\"https://storymaps.arcgis.com/stories/1b4dc0d978c74d97a559e615730d4cd4\">watering points</a>, and that&#8217;s why the additional 59 had to be created for residents, for communities that didn&#8217;t have a previously existing watering point.&nbsp;</p>\n\n\n\n<p>And so now we&#8217;re in the phase of <a href=\"https://www.congress.gov/bill/117th-congress/house-bill/1319/text\">ARPA</a> , $3 million dollars from BIA [Bureau of Indian Affairs] for potable water service, potable water delivery, and then approximately $2.7 million from the Indian Health Service to also address potable water delivery.&nbsp;</p>\n\n\n\n<p>Some of the immediate relief was stop-gap measures to help with water haulers, but where the security and sustainability really comes from is under Bipartisan Infrastructure Law funding … and then additionally being able to use the ARPA funding to be able to create long-term projects. So these long-term projects are like water transmission lines, cistern and septic projects.&nbsp; Because in the Navajo Nation we have sparse population and rural living, so not everyone can get hooked up to piped water.&nbsp;</p>\n\n\n\n<p><strong>Q.</strong> <strong>Given your background in geology, can you talk a little bit about the work that you&#8217;re trying to do to address that intersection of the legacy uranium contamination with the water access issues?&nbsp;</strong></p>\n\n\n\n<p>One thing to understand is there are specific areas that are focused on addressing the legacy issues, like we have the Abandoned Mine Lands Department, we have Navajo EPA Superfund efforts that are specifically addressing those cleanup efforts, mitigation efforts, etc. How I lend my expertise to those is providing technical feedback regarding data that may need to be included.&nbsp;</p>\n\n\n\n<p>By bringing watering points closer to residents, and by working on these bulk water supply delivery projects, it is really creating that sustainability by interconnecting public water systems of Navajo Nation communities. We create more security, more sustainability, rather than having them as standalone public water systems. …</p>\n\n\n\n<p>I do a lot of technical support for the water rights efforts that are unresolved, as well as the ones that have been resolved and are currently going into place. Participating in those water rights efforts provides that opportunity to be able to secure water. Like diversifying our water portfolio. That&#8217;s what water rights is doing. Where we not only would have to rely upon groundwater, which historically we previously have done, but by adding surface water we&#8217;re creating that sustainability.</p>\n\n\n\n<p><strong>Q</strong>.<strong> Can you situate us as to the overall water rights access that the Navajo Nation has?&nbsp;</strong></p>\n\n\n\n<p>A large percentage of the Navajo Nation doesn&#8217;t have secured water rights. We haven&#8217;t resolved our water rights in Arizona, and Arizona is a large chunk of land of our nation.&nbsp;</p>\n\n\n\n<p>We have secured water rights with the <a href=\"https://www.navajonationcouncil.org/wp-content/uploads/2022/05/Navajo_Utah_Water_Rights_2022.05.27.pdf\">Navajo Utah Water Rights Settlement Act</a> in Utah along the San Juan River. We have secured water rights in the San Juan River Basin in New Mexico. We&#8217;re working to resolve our water rights in the Zuni River Basin in the Rio San Jose Basin.&nbsp;</p>\n\n\n\n<p>Water rights can be resolved in a couple of different manners, meaning through litigation or through settlement. Litigation — courts tell you what you get. [With] a settlement, you negotiate with other parties to secure what you’d like to get. It doesn&#8217;t mean everyone gets what they want.</p>\n\n\n\n<p><strong>Q. What keeps you up at night as far as drought challenges?</strong></p>\n\n\n\n<p>When you have a law of the river for the Colorado River Basin that&#8217;s not inclusive of tribes as sovereigns, that provides a challenge for the Colorado River Basin.&nbsp;</p>\n\n\n\n<p>And the way in which the Colorado River Basin is managed with the upper and the lower basin, that&#8217;s what keeps me up at night. Because right now, what climatologists are encouraging us to accept is to stop calling it drought. Drought indicates that it&#8217;s a short-term situation. What they&#8217;re encouraging us to use instead is aridification. That the conditions of dry are the new normal.&nbsp;</p>\n\n\n\n\n\n<p><strong>Q.</strong> <strong>In addition to economic development, how important of a role does water play in the lives of Navajo community members in terms of their culture?</strong></p>\n\n\n\n<p>Every time when I share presentations, I always share that I am of the Bitter Water clan, born from the Tangle People clan; that my maternal grandfather&#8217;s clan is the Yucca Fruit Strung On A Line, and my paternal grandfather&#8217;s clan is the Water That Flows Together.&nbsp;</p>\n\n\n\n<p>Through that identity there&#8217;s no doubt that we are water beings, meaning the Diné People of the Four Corners region of this land. And it&#8217;s important that I have that understanding of our cultural identity that comes through the clan system. And that provides a greater basis for the work that I do, being able to be a part of this vital work that is so needed for tribes, nations and pueblos throughout this country,</p>\n\n\n\n<p>As far as the cultural identity tie, there&#8217;s a lot of acknowledgment within Navajo Nation leadership about the reverence and respect for water: to be able to carry out ceremonies that have been done for generations, to be able to continue those in reverence and respect for water. So, even though the work that I do is science-driven, there is this spiritual aspect as Indigenous people that we have a connection to with regards to the world that we&#8217;re in. And being able to understand that spirituality is also a part of the work that we do.&nbsp;</p>\n\n\n\n<p><strong>Q.</strong> <strong>At the end of your career, what do you hope to have accomplished when it comes to providing safe drinking water across the Navajo Nation?</strong></p>\n\n\n\n<p>I hope to bring and provide sustainable solutions that provide a secure and sustainable water future. There&#8217;s a lot of work to be done.&nbsp;</p>\n\n\n\n<p>The capacity that we have is not sufficient enough to be able to address these issues. There&#8217;s all this money, unprecedented money that has come available. CARES Act, ARPA, the Bipartisan Infrastructure Law. We have a decreased workforce than we started with before the pandemic, and these additional resources are out there, and the challenge is everyone&#8217;s getting that money, not just tribes. And so there is a competition for people who can do the work as well.&nbsp;</p>\n\n\n\n<p>I know people have passed this legislation in good faith, meaning they really hope that this brings relief, aid to the places that need it. But I think even our best efforts sometimes are not good enough. And the same can be said for the work that I do.&nbsp;</p>\n\n\n\n<p>I am giving every day over 100 percent. I haven&#8217;t even had a vacation in over two years. So it&#8217;s just one of those things: We&#8217;re holding on the best that we can. We&#8217;re doing the best that we can with the little that we have.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://publicintegrity.org/environment/natural-resources/drilling-down-on-water-access-as-drought-becomes-the-new-normal/\">Drilling down on water access as drought becomes the ‘new normal’&nbsp;&nbsp;</a> appeared first on <a rel=\"nofollow\" href=\"https://publicintegrity.org\">Center for Public Integrity</a>.</p>\n",
  "post-id": 116858
}