{
  "title": "S14 Ep71: Supernatural News/Parashare: EnTerrorainment Edition",
  "link": "https://audioboom.com/posts/8098559",
  "itunes:episode": 71,
  "itunes:title": "Supernatural News/Parashare: EnTerrorainment Edition",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5185,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS EnTerrorainment Edition of Supernatural News & ParaShare is set to scare you and make you laugh,all at the same time!<br>\n<br>\nDiana's Deadly Prediction, Double-Headed Demons, Ghostly Children and More unusual stories PLUS your Supernatural Stories.<br>\n<br>\nPLUS:  There is an all new Darkness Radio app for IOS and IPhone!  Check the app store by searching \"Darkness Radio\" and looking for the picture of \"Skully\"! Best of all, it's free!<br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nCarnival Row is a one-hour fantasy drama series starring Orlando Bloom and Cara Delevingne . The series is set in a Victorian fantasy world filled with mythological immigrant creatures whose exotic homelands were invaded by the empires of man. Come together on August 30th to watch Carnival Row only on Amazon Prime Video this Labor Day Weekend!<br>\n<br>\nFeals naturally helps reduce stress, anxiety, pain, and sleeplessness.  Place a few drops of Feals under your tongue and feel the difference within minutes. Become a member today by going to <a href=\"http://Feals.com/DARKNESS\">Feals.com/DARKNESS</a> and you'll get 50% off your first order with free shipping",
  "itunes:summary": "BEYOND the DARKNESS EnTerrorainment Edition of Supernatural News & ParaShare is set to scare you and make you laugh,all at the same time!\n\nDiana's Deadly Prediction, Double-Headed Demons, Ghostly Children and More unusual stories...",
  "pubDate": "Sat, 31 Aug 2019 08:00:00 +0000",
  "guid": "7dc64409-eadb-4d70-81f8-2acb4f1a10bc",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}