{
  "title": "Algorithms of the Mind",
  "link": "https://medium.com/deep-learning-101/algorithms-of-the-mind-10eb13f61fc4?source=rss-b0cd2903e078------2",
  "guid": "https://medium.com/p/10eb13f61fc4",
  "category": [
    "machine-learning",
    "big-data",
    "cognition"
  ],
  "dc:creator": "Christopher Nguyen",
  "pubDate": "Fri, 22 May 2015 09:27:31 GMT",
  "atom:updated": "2016-02-15T18:37:29.306Z",
  "content:encoded": "<p><em>What Machine Learning Teaches Us About Ourselves</em></p><p><em>Originally published at </em><a href=\"http://arimo.com/blog/featured/2015/algorithms-of-the-mind/\"><em>blog.arimo.com</em></a><em>.<br></em><a href=\"https://twitter.com/intent/user?screen_name=pentagoniac\"><em>Follow me on Twitter</em></a><em> to keep informed of interesting developments on these topics.</em></p><p><em>“</em>Science often <em>follows</em> technology, because inventions give us new ways to think about the world and new phenomena in need of explanation.”</p><p>Or so Aram Harrow, an MIT physics professor, counter-intuitively argues in <em>“</em><a href=\"http://arxiv.org/abs/1501.00011\"><em>Why now is the right time to study quantum computing</em></a><em>”.</em></p><p>He suggests that the scientific idea of entropy could not really be conceived until steam engine technology necessitated understanding of thermodynamics. Quantum computing similarly arose from attempts to simulate quantum mechanics on ordinary computers.</p><p>So what does all this have to do with machine learning?</p><p>Much like steam engines, machine learning is a technology intended to solve specific classes of problems. Yet results from the field are indicating intriguing—possibly profound—scientific clues about how our own brains might operate, perceive, and learn. The <em>technology </em>of machine learning is giving us new ways to think about the <em>science</em> of human thought … and imagination.</p><h4>Not Computer Vision, But Computer Imagination</h4><p>Five years ago, deep learning pioneer <a href=\"http://www.cs.toronto.edu/~hinton/\">Geoff Hinton</a> (who currently splits his time between the University of Toronto and Google) published the following <a href=\"http://www.cs.toronto.edu/~hinton/adi/index.htm\">demo</a>.</p><iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FaY9crs69epI%3Ffeature%3Doembed&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DaY9crs69epI&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FaY9crs69epI%2Fhqdefault.jpg&key=d04bfffea46d4aeda930ec88cc64b87c&type=text%2Fhtml&schema=youtube\" width=\"854\" height=\"480\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/682bf3bb68b933897ceeded34e9713ee/href\">https://medium.com/media/682bf3bb68b933897ceeded34e9713ee/href</a></iframe><p>Hinton had trained a five-layer neural network to recognize handwritten digits when given their bitmapped images. It was a form of computer vision, one that made handwriting machine-readable.</p><p>But unlike previous works on the same topic, where the main objective is simply to recognize digits, Hinton’s network could also <em>run in reverse. </em>That is, given the <em>concept</em> of a digit, it can regenerate images corresponding to that very <em>concept</em>.</p><iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FhiBn1rUawvw%3Ffeature%3Doembed&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DhiBn1rUawvw&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FhiBn1rUawvw%2Fhqdefault.jpg&key=d04bfffea46d4aeda930ec88cc64b87c&type=text%2Fhtml&schema=youtube\" width=\"854\" height=\"480\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/8dee0a9682fbb15b4d7e11f460b049ee/href\">https://medium.com/media/8dee0a9682fbb15b4d7e11f460b049ee/href</a></iframe><p>We are seeing, quite literally, a machine imagining an image of the concept of “8”.</p><p>The magic is encoded in the layers between inputs and outputs. These layers act as a kind of <em>associative memory</em>, mapping back-and-forth from image and concept, from concept to image, all in one neural network.</p><blockquote>“Is this how human imagination might work?</blockquote><p>But beyond the simplistic, brain-inspired machine vision technology here, the broader scientific question is whether this is how human imagination — visualization — works. If so, there’s a huge <em>a-ha </em>moment here.</p><p>After all, isn’t this something our brains do quite naturally? When we see the digit 4, we think of the concept “4”. Conversely, when someone says “8”, we can conjure up in our minds’ eye an image of the digit 8.</p><p>Is it all a kind of “running backwards” by the brain from concept to images (or sound, smell, feel, etc.) through the information encoded in the layers? Aren’t we watching this network create new pictures — and perhaps in a more advanced version, even new internal connections — as it does so?</p><h4>On Concepts and Intuitions</h4><p>If visual recognition and imagination are indeed just back-and-forth mapping between images and concepts, what’s happening between those layers? Do deep neural networks have some insight or analogies to offer us here?</p><p>Let’s first go back 234 years, to Immanuel Kant’s <a href=\"https://books.google.com/books?id=4hYNXsazIUEC&printsec=frontcover&source=gbs_ge_summary_r&cad=0#v=onepage&q&f=false\"><em>Critique of Pure Reason</em></a><em>, </em>in which he argues that “Intuition is nothing but the <em>representation </em>of phenomena”.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/916/1*ihobuo6jX0CgGXQc4GeeiA.png\" /></figure><p>Kant railed against the idea that human knowledge could be explained purely as empirical and rational thought. It is necessary, he argued, to consider intuitions. In his definitions, “intuitions” are representations left in a person’s mind by sensory perceptions, where as “concepts” are descriptions of empirical objects or sensory data. Together, these make up human knowledge.</p><p>Fast forwarding two centuries later, Berkeley CS professor <a href=\"http://www.eecs.berkeley.edu/Faculty/Homepages/efros.html\">Alyosha Efros</a>, who specializes in Visual Understanding, pointed out that “there are many more things in our visual world than we have words to describe them with”. Using word labels to train models, Efros argues, exposes our techniques to a <em>language bottleneck. </em>There are many more un-namable intuitions than we have words for.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*pOq7J0t0EGswZ0iYtiJR2w.png\" /><figcaption>There is an intriguing mapping between ML Labels and human Concepts, and between ML Encodings and human Intuitions.</figcaption></figure><p>In training deep networks, such as <a href=\"http://googleblog.blogspot.com/2012/06/using-large-scale-brain-simulations-for.html\">the seminal “cat-recognition” work</a> led by <a href=\"http://www.technologyreview.com/lists/innovators-under-35/2014/visionary/quoc-le/\">Quoc Le at Google/Stanford</a>, we’re discovering that the activations in successive layers appear to go from lower to higher conceptual levels. An image recognition network encodes bitmaps at the lowest layer, then apparent corners and edges at the next layer, common shapes at the next, and so on. These intermediate layers don’t necessarily have any activations corresponding to explicit high-level concepts, like “cat” or “dog”, yet they do encode a <em>distributed representation</em> of the sensory inputs. Only the final, output layer has such a mapping to human-defined labels, because they are constrained to match those labels.</p><blockquote>“Is this Intuition staring at us in the face?</blockquote><p>Therefore, the above encodings and labels seem to correspond to exactly what Kant referred to as “intuitions” and “concepts”.</p><p>In yet another example of machine learning technology revealing insights about human thought, the network diagram above makes you wonder whether <em>this</em> is how the architecture of Intuition — albeit vastly simplified — is being expressed.</p><h4>The Sapir-Whorf Controversy</h4><p>If — as Efros has pointed out — there are a lot more conceptual patterns than words can describe, then do words constrain our thoughts? This question is at the heart of the Sapir-Whorf or <a href=\"http://en.wikipedia.org/wiki/Linguistic_relativity\">Linguistic Relativity Hypothesis</a>, and the debate about whether language completely determines the boundaries of our cognition, or whether we are unconstrained to conceptualize anything — regardless of the languages we speak.</p><p>In its strongest form, the hypothesis posits that the structure and lexicon of languages constrain how one perceives and conceptualizes the world.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/600/1*d93Jr9dsPFP2f2VU0ak8JQ.png\" /><figcaption>Can you pick the odd one out? The Himba — who have distinct words for the two shades of green — can pick it out instantly. Credit: <a href=\"http://boingboing.net/author/mark_frauenfelder_1\">Mark Frauenfelder</a>, <a href=\"http://boingboing.net/2011/08/12/how-language-affects-color-perception.html\"><em>How Language Affects Color Perception</em></a>, and <a href=\"https://medium.com/@arraymac\">Randy MacDonald</a> for verifying the RGB’s.</figcaption></figure><p>One of the most striking effects of this is demonstrated in the color test shown here. When asked to pick out the one square with a shade of green that’s distinct from all the others, the Himba people of northern Namibia — who have distinct words for the two shades of green — can find it almost instantly.</p><p>The rest of us, however, have a much harder time doing so.</p><p>The theory is that — once we have words to distinguish one shade from another, our brains will train itself to discriminate between the shades, so the difference would become more and more “obvious” over time. In seeing with our brain, not with our eyes, language drives perception.</p><blockquote>“We see with our brains, not with our eyes.</blockquote><p>With machine learning, we also observe something similar. In supervised learning, we train our models to best match images (or text, audio, etc.) against provided labels or categories. By definition, these models are trained to discriminate much more effectively between categories that have provided labels, than between other possible categories for which we have not provided labels. When viewed from the perspective of supervised machine learning, this outcome is not at all surprising. So perhaps we shouldn’t be too surprised by the results of the color experiment above, either. Language does indeed influence our perception of the world, in the same way that labels in supervised machine learning influence the model’s ability to discriminate among categories.</p><p>And yet, we also know that labels are not strictly required to discriminate between cues. In Google’s “cat-recognizing brain”, the network eventually discovers the concept of “cat”, “dog”, etc. all by itself — even without training the algorithm against explicit labels. After this unsupervised training, whenever the network is fed an image belonging to a certain category like “Cats”, the same corresponding set of “Cat” neurons always gets fired up. Simply by looking at the vast set of training images, this network has discovered the essential patterns of each category, as well as the differences of one category vs. another.</p><p>In the same way, an infant who is repeatedly shown a paper cup would soon recognize the visual pattern of such a thing, even before it ever learns the words “paper cup” to attach that pattern to a name. In this sense, the strong form of the Sapir-Whorf hypothesis cannot be entirely correct — we can, and do, discover concepts even without the words to describe them.</p><p>Supervised and unsupervised machine learning turn out to represent the two sides of the controversy’s coin. And if we recognized them as such, perhaps Sapir-Whorf would not be such a controversy, and more of a reflection of supervised and unsupervised human learning.</p><p>I find these correspondences deeply fascinating — and we’ve only scratched the surface. Philosophers, psychologists, linguists, and neuroscientists have studied these topics for a long time. The connection to machine learning and computer science is more recent, especially with the advances in big data and deep learning. When fed with huge amounts of text, images, or audio data, the latest deep learning architectures are demonstrating near or even better-than-human performance in language translation, image classification, and speech recognition.</p><p>Every new discovery in machine learning demystifies a bit more of what may be going on in our brains. We’re increasingly able to borrow from the vocabulary of machine learning to talk about our minds.</p><h4>Further Reading</h4><ol><li><a href=\"http://arxiv.org/abs/1501.00011\"><em>Why Now Is the Right Time to Study Quantum Computing</em></a>, Aram Harrow — arXiv, Dec. 2014.</li><li><a href=\"https://books.google.com/books?id=n53FAgAAQBAJ&pg=PA307&lpg=PA307&dq=geoff+hinton+adi&source=bl&ots=hVLVTqicEO&sig=gP383JySLvN-FayEBYRSsUP8UEU&hl=en&sa=X&ei=RjhhVYfqJ4zxoATmvYGAAQ&ved=0CDEQ6AEwAw#v=onepage&q=geoff%20hinton%20adi&f=false\"><em>The Anticipating Brain</em></a>, Thomas Trappenberg — Fundamentals of Computational Neuroscience, Oxford University Press, 2010.</li><li><a href=\"https://books.google.com/books?id=4hYNXsazIUEC&printsec=frontcover&source=gbs_ge_summary_r&cad=0#v=onepage&q&f=false\"><em>Critique of Pure Reason</em></a>, Immanuel Kant — The Colonial Press, 1899.</li><li><a href=\"https://www.smashwords.com/books/download/37727/1/latest/0/0/understanding-kant-concepts-and-intuitions.pdf\"><em>Understanding Kant: Concepts and Intuitions</em></a>, Hercules Bantas — The Reluctant Geek, 2011.</li><li><a href=\"http://static.googleusercontent.com/media/research.google.com/en/us/archive/unsupervised_icml2012.pdf\"><em>Building High-level Features Using Large Scale Unsupervised Learning</em></a>, Quoc Le et al. — International Conference on Machine Learning, July 2012.</li><li><a href=\"https://books.google.com/books?id=W2d1Q4el00QC&printsec=frontcover&source=gbs_ge_summary_r&cad=0#v=onepage&q&f=false\"><em>Language, Thought, and Reality</em></a>, John B. Carroll — Selected Writings of Benjamin Lee Whorf, 1956.</li><li><a href=\"http://www1.icsi.berkeley.edu/~kay/tics2.pdf\"><em>Language, Thought, and Color: Whorf Was Half Right</em></a><em>, </em>Terry Regier & Paul Kay — Trends in Cognitive Sciences, Oct. 2009.</li><li><a href=\"http://research.gold.ac.uk/4935/1/davidoff-goldstein-color-terms.pdf\"><em>Knowing Color Terms Enhances Recognition: Further Evidence from English and Himba</em></a>, Julie Goldstein, Jules Davidoff, Debi Roberson — Journal of Experimental Child Psychology, Feb. 2009.</li><li><a href=\"http://boingboing.net/2011/08/12/how-language-affects-color-perception.html\"><em>How Language Affects Color Perception</em></a>, Mark Frauenfelder — Boing Boing, Aug. 2011.</li><li><a href=\"http://strataconf.com/big-data-conference-ca-2015/public/schedule/detail/40181\"><em>Visual Understanding Beyond Naming</em></a>, Alyosha Efros — Strata+Hadoop World, Feb. 2015.</li><li><a href=\"https://www.youtube.com/watch?v=Q-B_ONJIEcE\"><em>Linguistics as a Window to Understanding the Brain</em></a>, Steven Pinker — Big Think, Oct. 2012.</li><li><a href=\"http://arxiv.org/abs/1501.02876\"><em>Deep Image: Scaling up Image Recognition</em></a>, Ren Wu et al. — arXiv, May 2015.</li><li><a href=\"https://medium.com/deep-learning-101/on-deep-learning-a-tweeted-bibliography-68ab095376e7\"><em>On Deep Learning, A Tweeted Bibliography</em></a>, Christopher Nguyen — medium.com, 2015.</li><li><a href=\"http://arxiv.org/pdf/1407.5104.pdf\"><em>Pixels to Voxels: Modeling Visual Representation in the Human Brain</em>,</a> Pulkit Agrawal et al. — arXiv, Jul. 2014.</li></ol><p><em>Thanks to </em><a href=\"https://twitter.com/smc90\"><em>Sonal Chokshi</em></a><em> and </em><a href=\"https://medium.com/@vupham\"><em>Vu Pham</em></a><em> for extensive review & edits. Also, </em><a href=\"https://medium.com/@chrisjagers\"><em>chrisjagers</em></a><em>, </em><a href=\"https://medium.com/@chickamade\"><em>chickamade</em></a><em>.</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=10eb13f61fc4\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/deep-learning-101/algorithms-of-the-mind-10eb13f61fc4\">Algorithms of the Mind</a> was originally published in <a href=\"https://medium.com/deep-learning-101\">Deep Learning 101</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
}