{
  "title": "Attachment Assessment Unpacked, Ann &#038; Sue Geek Out and Debrief Previous Episode with Carol George (163)",
  "link": "https://therapistuncensored.com/episodes/attachment-assessment-unpacked-163/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=attachment-assessment-unpacked-163",
  "pubDate": "Wed, 24 Nov 2021 01:44:47 +0000",
  "guid": "https://therapistuncensored.com/?p=12234",
  "description": "We are still excited by the exceptional opportunity to learn directly from Dr. George and for the privilege we have in getting to sit down with so many incredible experts in the field of attachment and the relational sciences. We thought there was no better way to follow up than to bring you an in-depth session with Ann and Sue to really get into the heart of attachment assessment. Follow along as they explore what attachment really means, how research has evolved, and how it is relevant on a clinical level. Guided by excerpts from the conversation with Dr. George, they share personal stories, and their own knowledge of the topic to give you 40 minutes of insightful, candid conversation to expand your knowledge even greater. You won&#039;t want to miss it!",
  "enclosure": "",
  "itunes:subtitle": "The nitty-gritty of what \"attachment\" means and Sue and Ann break down episode 162 with Dr. Carol George",
  "itunes:summary": "There were so many exciting moments in the previous interview with Carol George that we couldn&#039;t help but sit down and get into with you.  We use excerpts from Episode 162, TU162: Adult Attachment Projective (AAP) Assessment & Clinical Use with Dr. Carol George and geek out as we work to continue to learn and incorporate the feedback from this legend in the field of attachment.  We also worked to make this sometimes technical material more accessible to everybody, however, we&#039;d still call this episode dense.  Yeah, well, good content should not be over-simplified, you are welcome!  If you have not had the chance to listen to the previous episode with world-renowned Attachment Assessment pioneer, Dr. Carol George - that&#039;s ok, we cover a lot in this one but you will definitely get the most out of it as a follow up to hearing the original first. Be easy on yourself though, there is no right or wrong way to learn! Find show notes at www.therapistuncensored.com/163 and join our neuronerd community here www.therapistuncensored.com/join.",
  "itunes:author": "Sue Marriott LCSW, CGP, Ann Kelley PhD",
  "itunes:image": "",
  "itunes:season": 6,
  "itunes:episode": 163,
  "itunes:title": "Attachment Assessment Unpacked, Ann & Sue Geek Out and Debrief Previous Episode with Carol George (163)",
  "itunes:duration": "37:57"
}