{
  "title": "S14 Ep67: Supernatural News/Parashare: Weekend Weirdness Edition",
  "link": "https://audioboom.com/posts/8098563",
  "itunes:episode": 67,
  "itunes:title": "Supernatural News/Parashare: Weekend Weirdness Edition",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5799,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS Weekend Weirdness Edition of Supernatural News & ParaShare is finally here!<br>\n<br>\nWe have been flashed by planets, meteors and now a Black Hole! Tim finally finds a reason to Storm 51, we find evidence of a Vampire Witch, Bernie Sanders vs Disclosure & haunted baby monitors PLUS your weird calls and stories<br>\n<br>\nPLUS:  There is an all new Darkness Radio app for IOS and IPhone!  Check the app store by searching \"Darkness Radio\" and looking for the picture of \"Skully\"! Best of all, it's free! <br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.",
  "itunes:summary": "BEYOND the DARKNESS Weekend Weirdness Edition of Supernatural News & ParaShare is finally here!\n\nWe have been flashed by planets, meteors and now a Black Hole! Tim finally finds a reason to Storm 51, we find evidence of a Vampire Witch,...",
  "pubDate": "Sat, 17 Aug 2019 08:00:00 +0000",
  "guid": "4fe54215-aa26-4493-b669-687a5fb9ca8a",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}