{
  "title": "Gender-Affirming Care Gave My Daughter a Future. Lawmakers Want to Take it Away.",
  "link": "https://www.aclu.org/news/lgbtq-rights/gender-affirming-care-gave-my-daughter-a-future-lawmakers-want-to-take-it-away",
  "pubDate": "Fri, 28 Oct 2022 16:49:46 +0000",
  "dc:creator": "Lacey Jennen",
  "category": [
    "LGBTQ Rights",
    "LGBTQ Parenting",
    "LGBTQ Youth",
    "Trans and Gender-Nonconforming Youth",
    "Transgender People and Discrimination",
    "Transgender People and Health Care",
    "Transgender Rights"
  ],
  "guid": "https://www.aclu.org/news/lgbtq-rights/gender-affirming-care-gave-my-daughter-a-future-lawmakers-want-to-take-it-away",
  "description": "<p><em>Four families of transgender youth and two doctors have </em><a href=\"https://www.aclu.org/cases/brandt-et-al-v-rutledge-et-al\"><em>challenged an Arkansas law</em></a><em> that would prohibit healthcare professionals from providing or even referring transgender young people for medically-necessary health care. A trial </em><a href=\"https://www.aclu.org/news/lgbtq-rights/brandt-v-rutledge-what-to-know-about-the-arkansas-trial\"><em>began last week</em></a><em>. Here, one of our plaintiffs shares how the law would impact her daughter and family. </em></p>\n<p>My husband, Aaron, and I are raising our three daughters in Arkansas. Our entire family and community are here and we love our home state.</p>\n<p>My oldest daughter, Sabrina, is transgender and the medical treatment she has received for her gender dysphoria has changed her life. At one time, Sabrina shrank from the world. She was anxious and unsure of herself and struggled with severe dysphoria. Today, Sabrina is confident and has hopes for her future and a joy that we had not seen in her before she started this care. We are fighting to ensure the medical treatment that has given her the life she has today.</p>\n\n  <div class=\"wp-sizing-container sizing--half alignment--left\">\n      <figure class=\"wp-image mb-md\">\n\t\t  <img width=\"1000\" height=\"1333\" src=\"https://www.aclu.org/wp-content/uploads/2022/10/Jennen_Final_RYoung_08.jpg\" class=\"attachment-original size-original\" alt=\"Sabrina Jennen\" loading=\"lazy\" srcset=\"https://www.aclu.org/wp-content/uploads/2022/10/Jennen_Final_RYoung_08.jpg 1000w, https://www.aclu.org/wp-content/uploads/2022/10/Jennen_Final_RYoung_08-768x1024.jpg 768w, https://www.aclu.org/wp-content/uploads/2022/10/Jennen_Final_RYoung_08-400x533.jpg 400w, https://www.aclu.org/wp-content/uploads/2022/10/Jennen_Final_RYoung_08-600x800.jpg 600w, https://www.aclu.org/wp-content/uploads/2022/10/Jennen_Final_RYoung_08-800x1066.jpg 800w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />\t\n\t\t  <figcaption class=\"wp-image__caption is-caption mt-xs\"><p>Sabrina Jennen</p>\n</figcaption>\n\t\n\t\t  <span class=\"wp-image__credit is-credit\"><p>Credit: Rana Young</p>\n</span>\n\t  </figure>\n  </div>\n<p>When Sabrina was younger and before she started receiving medical treatment for her gender dysphoria, she expressed to us, the best she could at the time, that she couldn&#8217;t see a future for herself and didn&#8217;t know why. As parents, we were in agony watching her struggle. We saw her as a brilliant, gifted mind, with a very gentle soul. It was heartbreaking that she didn’t see the beautiful person that we saw in her.</p>\n<p>After she came out to us and began to receive medical treatment for her gender dysphoria, we began to notice her confidence. She began to smile again and found joy in shopping and styling outfits for not only herself, but her two sisters. They love to swap clothes and accessories, which is really fun to watch. She is also a gifted artist who has created some pretty amazing self-portraits that emphasize her beautiful red curls. Sabrina, who once was a very shy, reserved, and unhappy person, is now our confident social butterfly who loves a good selfie opportunity.</p>\n<p>As a parent, I never imagined I’d have to fight for my daughter to be able to receive medically necessary health care. I never imagined having to watch my child suffer and then get better only to have lawmakers take away the treatment she needs.</p>\n  <div class=\"alignfullwidth mb-md wp-pullquote \">\n    <div class=\" wp-pullquote-inner\">\n      <p>As a parent, I never imagined I’d have to fight for my daughter to be able to receive medically necessary health care.</p>\n      \n          </div>\n  </div>\n<p>The state of Arkansas has suggested that people are rushing into this care, but nothing could be further from the truth for us. My husband and I are very careful and thoughtful people. We had many long, serious discussions with each other, with Sabrina, and with her medical providers. We prayed about the decisions we all had to make as a family.</p>\n<p>Arkansas is our home. We have lived here our entire lives, and our parents, siblings, grandparents, church, and entire support system are all here in Arkansas. We do not want to have to leave our home simply to be able to provide necessary medical care for our daughter.</p>\n<p>Sabrina is an amazing, smart, beautiful person and an incredible daughter. I wish that those politicians who passed this law would take the time to listen to the experiences of trans youth and to get to know people like our daughter. I can’t imagine anyone who truly got to know and understand how this care has impacted Sabrina could take action that would jeopardize her joy, her smile, and her sense of possibility for her future.</p>\n\t\t<div class=\"rss-cta\"><div class=\"rss-cta__subtitle\">What you can do:</div><div class=\"rss-cta__title\">Take the Pledge: Support Trans Youth Now</div><a href=\"https://action.aclu.org/petition/take-pledge-support-trans-youth-now\" class=\"rss-cta__button\">Take the pledge</a></div>",
  "source": "American Civil Liberties Union"
}