{
  "id": "yt:video:8_vYHSnv3Js",
  "yt:videoId": "8_vYHSnv3Js",
  "yt:channelId": "UCZRoNJu1OszFqABP8AuJIuw",
  "title": "Why 40,000 Cancer Patients Are Suing Johnson & Johnson",
  "link": "",
  "author": {
    "name": "Logically Answered",
    "uri": "https://www.youtube.com/channel/UCZRoNJu1OszFqABP8AuJIuw"
  },
  "published": "2022-10-28T19:00:04+00:00",
  "updated": "2022-11-02T18:43:41+00:00",
  "media:group": {
    "media:title": "Why 40,000 Cancer Patients Are Suing Johnson & Johnson",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Johnson & Johnson is one of the most recognizable household brands in the world. They sell everything from soap and baby powder to band-aids and medicine. At first glance, the company seems completely harmless in nature, but when you take a closer look, you’ll quickly realize that that’s not exactly true. While the company did have wholesome beginnings as a generous family company, corporate greed has slowly corrupted the company over the decades leading to some of the worst scandals in history. First, we have the baby powder lawsuit. J&J’s baby powder is alleged to have asbestos in them which causes cancer. Furthermore, it is alleged that J&J has known about this since the 1970s and that they decided to just push it under the rug. Another massive scandal that J&J has been caught up in is the opioid epidemic. It turns out that many of the largest pharmaceutical companies have been lobbying and pushing for opioids to be easily accessible to everyday people. This has played a massive role in addiction across the US and has arguably played a role in the deaths of hundreds of thousands of people. This video explains how J&J transitioned from being a kind family business into being a ruthless corporate machine. \n\nDiscord Community: \nhttps://discord.gg/SJUNWNt\n\nTimestamps:\n0:00 - The Monster\n2:04 - Wholesome Beginnings\n5:36 - Slow Deterioration\n9:18 - Becoming The Predator\n12:18 - Spread The Word\n\nThumbnail Credits:\nJustin Sullivan - Getty Images\nhttps://bit.ly/3DuyHa3\nhttps://bit.ly/3gJGqsZ \n\nResources:\nhttps://pastebin.com/CYU2w3vb",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}