{
  "id": "yt:video:HghLGatbMWA",
  "yt:videoId": "HghLGatbMWA",
  "yt:channelId": "UC0-gvTKzYKQcjzKcSPfeIkA",
  "title": "This $1,000,000 Problem Can Revolutionize Weather Modeling - Navier-Stokes Existence and Smoothness",
  "link": "",
  "author": {
    "name": "Kinertia",
    "uri": "https://www.youtube.com/channel/UC0-gvTKzYKQcjzKcSPfeIkA"
  },
  "published": "2019-01-25T10:57:14+00:00",
  "updated": "2022-07-01T06:18:03+00:00",
  "media:group": {
    "media:title": "This $1,000,000 Problem Can Revolutionize Weather Modeling - Navier-Stokes Existence and Smoothness",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The Navier Stokes existence and smoothness millennium prize problem can open the way for accurate weather modelling, crazy new airplanes, and even more realistic video games; and solving it can get you a million dollars. And it all works around a mysterious group of equations called the Navier Stokes Equations. This video will explain it all: the Navier Stokes Millennium Problem: Explained!\n\nThese are the equations which model the properties of fluids, those which help our understanding of fluid dynamics reach new levels. This video explains the processes behind these equations and the existence and smoothness problems. \n\nIn 2000, the Clay mathematical institute offered a 1 million dollar prize for solving any of these seven mathematical problems which had been haunting people for a long time. All of these problems were either vital to their particular field, or contained something which could potentially be game changing.\n\nThe Navier-Stokes problem deals mostly with the properties of fluids. Fluids are basically things which flow, so they can be liquids, like water, or gases, like oxygen. There’s actually a whole branch of physics that deals with fluids, and it’s called fluid mechanics. In fluid mechanics we essentially make some assumptions about fluids, take note of their properties, and then try to model their behaviour.\n\nSo what’s the million dollar question? For fluids in 3 dimensions, can we determine if solutions to this equation exist? And if they exist, are they smooth, or differentiable everywhere?\n\n----\n\nMedia Attributions\n\nCristian V. [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], from Wikimedia Commons:\n\nhttps://commons.wikimedia.org/wiki/File:Chaos_Theory_%26_Double_Pendulum_-_1.jpg\n\nMusic: Which That Is This? by Doctor Turtle [CC BY 4.0]\n\nhttp://freemusicarchive.org/music/Doctor_Turtle/Jonahs_Message_for_New_York/Which_That_Is_This\n\nhttps://creativecommons.org/licenses/by/4.0/\n\nIntro: \n\nMusic: Summer from Bensound.com\nhttps://creativecommons.org/licenses/by-nd/3.0/legalcode\n----\n\nOther links:\n\nTerence Tao on the problem: https://terrytao.wordpress.com/2007/03/18/why-global-regularity-for-navier-stokes-is-hard/\n\nOfficial Statement By the Clay Mathematical Insitute:  \nhttp://www.claymath.org/sites/default/files/navierstokes.pdf\n\n---",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}