{
  "title": "Spectroscopic follow-up of a sub-set of the Gaia/IPHAS catalogue of H\\alpha-excess sources. (arXiv:2211.01694v1 [astro-ph.GA])",
  "link": "http://arxiv.org/abs/2211.01694",
  "description": "<p>State-of-the-art techniques to identify H\\alpha emission line sources in\nnarrow-band photometric surveys consist of searching for H\\alpha excess with\nreference to nearby objects in the sky (position-based selection). However,\nwhile this approach usually yields very few spurious detections, it may fail to\nselect intrinsically faint and/or rare H\\alpha-excess sources. In order to\nobtain a more complete representation of the heterogeneous emission line\npopulations, we recently developed a technique to find outliers relative to\nnearby objects in the colour-magnitude diagram (CMD-based selection). By\ncombining position-based and CMD-based selections, we built an updated\ncatalogue of H\\alpha-excess candidates in the northern Galactic Plane. Here we\npresent spectroscopic follow-up observations and classification of 114 objects\nfrom this catalogue, that enable us to test our novel selection method. Out of\nthe 70 spectroscopically confirmed H\\alpha emitters in our sample, 15 were\nidentified only by the CMD-based selection, and would have been thus missed by\nthe classic position-based technique. In addition, we explore the distribution\nof our spectroscopically confirmed emitters in the Gaia CMD. This information\ncan support the classification of emission line sources in large surveys, such\nas the upcoming WEAVE and 4MOST, especially if augmented with the introduction\nof other colours.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Fratta_M/0/1/0/all/0/1\">M. Fratta</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Scaringi_S/0/1/0/all/0/1\">S. Scaringi</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Monguio_M/0/1/0/all/0/1\">M. Mongui&#xf3;</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Pala_A/0/1/0/all/0/1\">A. F. Pala</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Drew_J/0/1/0/all/0/1\">J. E. Drew</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Knigge_C/0/1/0/all/0/1\">C. Knigge</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Ilkiewicz_K/0/1/0/all/0/1\">K. A. I&#x142;kiewicz</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Gandhi_P/0/1/0/all/0/1\">P. Gandhi</a>"
}