{
  "title": "S1E2 - Keys to a Gold Medal Mindset with USOPC Sports Psychologist Dr. Karen Cogan",
  "guid": "https://pinecast.com/guid/99bffd23-80f8-4603-b08f-10a159869e93",
  "pubDate": "Tue, 23 Jun 2020 07:35:00 -0000",
  "itunes:duration": "00:49:47",
  "description": "<p>This week’s guest is Dr. Karen Cogan, a Senior Sports Psychologist for the United States Olympic and Paralympic Committee (USOPC) who has attended 4 Olympic Games as the Sports Psychology Consultant for several Olympic medalists and their coaches. Dr. Cogan has a special set of skills, and she most certainly ‘knows her stuff’.</p>\n<p>In today’s episode, Laura and Dr. Cogan cover an incredible amount of territory including the Doctor’s journey to sports psychology, her direction for athletes dealing with the postponement of the 2020 Tokyo Olympics, and the benefits of implementing mindfulness techniques in both sports and life in general. They also look at the causes of burnout in athletes, some reasons behind athletes seeking Dr. Cogan’s assistance and what it means to honor their feelings, as well as some common characteristics of successful and struggling athletes. Finally, Dr. Cogan offers her advice on a number of topics ranging from helping struggling athletes to managing distractions, routines, and pressure, and she also shares some words of wisdom for parents and young athletes. This is an episode overflowing with amazing insight, unique perspective, and powerful ‘truth bombs’ from two highly accomplished experts in their fields. There truly is gold in your future, and today’s show marks the first in a series of formidable steps to help you pursue it.</p>\n<p>Episode Highlights:</p>\n<p>Dr. Cogan’s background and her journey to sports psychology\nHer direction for athletes trying to cope through this pandemic and who are preparing to get back to full swing when this isolation ends\nMindfulness training for sports and life\nThe causes of burnout in athletes and how to avoid it\nReasons that athletes have for talking with Dr. Cogan and how she honors their feelings\nCommon characteristics of both successful and struggling athletes\nDr. Cogan’s advice regarding helping struggling athletes, overcoming ‘fear of success’, dealing with pressure, managing distractions, routines, community, and technology\nHer advice for young athletes and parents of athletes</p>\n<p>Quotes:</p>\n<p>“What I have encouraged athletes to do is to really honor the feelings that they have, whatever those are.”</p>\n<p>“It’s okay to grieve dreams or hopes and things like that when it doesn’t play out like you want.”</p>\n<p>“When we try to push down those things we’re afraid are going to take over, we’re actually giving them power to take over, and that’s when they end up exploding in our face.”</p>\n<p>“Everything is a performance issue when it comes to the Olympics.”</p>\n<p>“An athlete has to be able to talk openly.”</p>\n<p>“Now’s the time to get rid of the bad habits and establish the good habits.”</p>\n<p>“Winning and losing does not define you as a person or an athlete.”</p>\n<p>“While the gold medal is awesome, and it’s a great goal to strive for, it’s that pursuit that’s going to make you who you are in the long run.”</p>\n<p>Links:\nThe Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a></p>\n<p>Dr. Karen Cogan LinkedIn:   <a href=\"https://www.linkedin.com/in/karen-cogan-93440a24/\" rel=\"nofollow\">https://www.linkedin.com/in/karen-cogan-93440a24/</a></p>",
  "itunes:title": "Keys to a Gold Medal Mindset with USOPC Sports Psychologist Dr. Karen Cogan",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 2
}