{
  "title": "YL Hooi (Ritual Community Music)",
  "itunes:author": "Liquid Architecture",
  "itunes:subtitle": "Ritual Community Music",
  "itunes:summary": "Folk, Noise, Electronics, Improvisation – how can radical music help us manifest new possibilities for thinking and imagine new ways of organising community through ritual behaviours, actions and languages?\n\nYL Hooi talks through the convergence of genres that influence her sound, her collaborative relationship with Tarquin Manek and how her songs have evolved over time.\n\nYL Hooi is the project of Valya Ying-Li Hooi, inhabiting a subtle and mysterious realm of furtive, dubbed-out song, sparse electronic percussion, and distant winds. Moving seamlessly from angelic song to gritty tape gunk, Hooi’s work opens onto a multitude of genres and directions while retaining a distinctly personal stamp through her obsessively zoned-out dub production tactics. \n\nhttps://liquidarchitecture.org.au/events/yl-hooi-bhairavi-raman-with-nanthesh-sivarajah\n\nRitual Community Music\n7 August 2022\nThe Oratory, Abbotsford Convent\nPresented by Abbotsford Convent and Liquid Architecture\n\nhttps://www.patreon.com/liquidarchitecture\n\nFinancial support from patrons at any level has a resounding impact on our work. You can support Liquid Architecture’s weekly podcast and our online journal Disclaimer, for new thinking and writing on listening and sound through a Patreon subscription, for as little as $5 a month. \n\nProduced by Mara Schwerdtfeger. \n\nhttps://www.patreon.com/liquidarchitecture\n\nFinancial support from patrons at any level has a resounding impact on our work. You can support Liquid Architecture’s weekly podcast and our online journal Disclaimer, for new thinking and writing on listening and sound through a Patreon subscription, for as little as $5 a month. \n\nhttps://liquidarchitecture.org.au/\n\nFor the past 20 years, Liquid Architecture has been Australia’s leading organisation for artists working with sound and listening. LA investigates the sounds themselves, but also the ideas communicated about, and the meaning of, sound and listening.",
  "itunes:image": "",
  "enclosure": "",
  "guid": "https://liquidarchitecture.org.au/podcast/yl-hooi-ritual-community-music",
  "pubDate": "Tue, 02 Aug 2022 08:00:00 +1000",
  "itunes:duration": "16:14",
  "itunes:explicit": "yes"
}