{
  "title": "Special Episode: COVID-19 - Omicron Variant Causes Concern",
  "description": "<p>Last week’s news of the Omicron variant of COVID-19 has raised questions about transmissibility, vaccine efficacy, and virus mortality. Where does this variant leave us in the fight against COVID-19 and how are markets reacting?</p><p><br></p><p>----- Transcript -----</p><p><strong>Andrew Sheets </strong>Welcome to Thoughts on the Market. I'm Andrew Sheets, chief cross asset strategist for Morgan Stanley Research.</p><p><br></p><p><strong>Matthew Harrison </strong>And I'm Matthew Harrison, Biotechnology Analyst</p><p><br></p><p><strong>Andrew Sheets </strong>And on this special edition of the podcast, we'll be talking about a new COVID variant and its impact on markets. It's Tuesday, November 30th at 2p.m. in London.</p><p><br></p><p><strong>Matthew Harrison </strong>And it's 9:00 a.m. in New York.</p><p><br></p><p><strong>Andrew Sheets </strong>So Matt, first things first, you know, we've seen a pretty major development over the American Thanksgiving holiday. We saw a new COVID variant, the omicron variant, kind of come into the market's attention. Can you talk just a little bit about why this variant has gotten so much focus and what do we know about it?</p><p><br></p><p><strong>Matthew Harrison </strong>Sure. I think there are probably three major factors that have driven the focus. The first thing is there was clear scientific concern because of the number of mutations in the variant. And specifically, there are over 50 mutations, 32 of which are in the spike protein region, which is where vaccines are targeted. And then a number in the receptor binding domain, which is where the antibodies typically tend to bind. So the antibodies that either vaccines or antibody therapies create. And what we know when we look at many of these mutations is they're present in other variants: gamma, delta, alpha, beta and we know that many of these mutations in a pair one or two have led to reduction in vaccine effectiveness. And so, when they're combined all together, from a scientific standpoint, people were very concerned about having all of those mutations together and what that would mean in terms of vaccine escape.</p><p><br></p><p><strong>Andrew Sheets </strong>So Matt, this is obviously a challenging situation because this is a new variant. It's just been discovered. And yet, you know, a lot of people are trying to figure out what the longer-term implications could be. So, you know, when you look at this with the kind of a limited amount of information, you know, what are the key characteristics that you're going to be watching that that you think we should care about?</p><p><br></p><p><strong>Matthew Harrison </strong>There are probably three things that I'm focused on and we can probably touch on in detail. So the first one is transmissibility, and the reason for that is if this variant overtakes Delta and becomes dominant globally, then we're going to care about the two other factors a lot more, which is vaccine escape and lethality. However, if it's not more transmissible than Delta and Delta remains the dominant variant, then this may be an issue in small pockets, but ultimately will fade and continue to be overtaken by Delta. And so that's why transmissibility is the primary focus. And so what do we know about transmissibility right now? We have a couple of pieces of information out of South Africa. The first is they have sequenced a number of recent COVID patients. And in those sequences, the vast majority or almost all of them have been Omicron. So that suggests that it is overtaking Delta. But again, sometimes sequence results can be biased because they're not a population sample and they're a selection of a certain subset of people. The second piece of information, which to me is more compelling, is I'm sure everybody's aware of the PCR tests. There's a certain kind of deletion here in this variant that that that you can pick up with a PCR test and so you can see the frequency of that deletion. And that that frequency has risen from about a background rate of about 5% in the last week and a half to about 50% of the PCR tests coming back suggestive of this variant in South Africa. And so that's a much bigger sample size than the sequencing sample size. And so that suggests at least in the small subset that you're seeing greater transmissibility compared to Delta. Now it's going to take time to confirm that. And now that we've seen cases globally in a lot of countries over the next week or two, everybody's going to be watching how quickly the Omicron cases rise compared to Delta to confirm whether or not it's more transmissible than Delta.</p><p><br></p><p><strong>Andrew Sheets </strong>This question of vaccine evasion. There's there has been some increased concern about this new variant that it might be able to evade vaccines. Why do people think that? And you know, how soon might we know?</p><p><br></p><p><strong>Matthew Harrison </strong>Why don't we start with the timeline, because that's the simpler part. The experiments to figure that out take about two weeks. And just so everybody has the background on this, you need to take the virus, you need to grow it up. And once you have a sample of it, then you take blood from people that have recovered from COVID and blood from people that have been vaccinated that are full of those antibodies. And you put them in the in the dish and you find out how much virus you kill. And that'll tell you how effective the serum from vaccinated or previously infected individuals are against the new variant. So that process typically takes about two weeks. So then why are people worried about vaccine evasion with this variant? Primarily because of the known mutations that it carries and the unknown mutations. And of the known mutations that it carries, it carries the same set of mutations as in beta, and the beta variant had significant vaccine evasion properties that never became dominant, but it did reduce vaccine effectiveness by about six-fold. And so, I think the concern is with those mutations, plus a range of other mutations known to have vaccine evasion properties, having them all together has really significantly increased concern about how much that may hurt the vaccine's ability to stop infection.</p><p><br></p><p><strong>Andrew Sheets </strong>And, Matt, so you talked about the importance of transmissibility, you know, you talked about some of the reasons why the concerns are higher around vaccine evasion with this variant. And the last thing you talked about was the lethality of this variant. And again, you know, what are you looking for there? Is there anything that concerns you with the information that we know and when might we know more?</p><p><br></p><p><strong>Matthew Harrison </strong>So this is the hardest question because as is typical, you get a lot of anecdotal reports about what's happening with recently infected patients, but it takes a while, on order of four to five weeks, to really understand if there is a significant difference in mortality or hospitalization. So we have very little information around those factors. You have seen in the capital region, in South Africa, where you've where you've seen these rising cases, a rise in hospitalizations, but we don't know if all those cases are Omicron cases or not. And we haven't seen mortality at all. But again, with recent infections, it usually takes four or five weeks to start to see the potential impact of those infections on mortality.</p><p><br></p><p><strong>Matthew Harrison </strong>And Andrew, I think one other thing which is important to mention is while we're while we're talking about severity of disease and lethality, we have to remember that in addition to vaccines, we do have now other effective treatments, including antibody therapies and oral therapies. And while some antibody therapies are likely not to work against Omicron, at least two or three of them are. And so you have you will have some effective antibody therapies. And then the oral therapies, given their mechanisms of action, should not be impacted. So we will have oral therapies in terms of treatment. So hopefully, even if we do get a scenario where there is significant impact on vaccine efficacy, this will not be like going back to the beginning of the pandemic, where we didn't have other effective treatments available.</p><p><br></p><p><strong>Matthew Harrison </strong>Andrew, unlike normal episodes, maybe it'll be my chance since the markets have been so volatile. How has this impacted your outlook on the markets in the near to medium term?</p><p><br></p><p><strong>Matthew Harrison </strong>I know inflation and the inflation debate and the impact of central banks on inflation has been a sort of key debate that I've heard you guys reflecting on.</p><p><br></p><p><strong>Andrew Sheets </strong>Yeah. So I think probably the thing I should say up front is at the moment, we don't think we have enough evidence around this variant to change our baseline economic forecast to change that optimistic view on growth. Now what it might change is some of the timing around it, and I think we saw a little bit of this with the Delta variant. Where, you know, that was a big development in 2021, you know, people didn't see that coming. And you know, if you step back and think about this year, the market was still good, yield still rose, there was a lot of market movement, very consistent with better economic growth if you take the year as a whole, even though you had this variant, but the variant did introduce some kind of twists and turns along the way. So you know, that's currently the way that we're thinking about this new omicron variant that it is not likely or we don't know enough yet to be confident that it would really change that economic outlook, especially because we think there are a lot of good reasons why growth could be solid, but it might introduce some near-term uncertainty. You know, the interesting thing about, as you mentioned, inflation is that it could affect inflation in both directions. It could cause inflation to be higher, for example, if it, you know, causes shutdowns in countries that are important for producing key goods. And you can't get the things that you want, and the price goes up. But it could also drive prices down. You know, on last Friday oil prices fell by over 10%. You know, that is a big part of inflation certainly as most people experience it. Gas prices will be lower based on what happened on Friday. So that can drive inflation down so it can cut both ways.</p><p><br></p><p><strong>Matthew Harrison </strong>Andrew, it's been great talking to you. Thanks for your thoughts.</p><p><br></p><p><strong>Andrew Sheets </strong>Matt, always a pleasure to talk to you.</p><p><br></p><p><strong>Matthew Harrison </strong>As a reminder, if you enjoy Thoughts on the Market, please take a moment to rate and review us on the Apple Podcast app. It helps more people find the show.</p>",
  "itunes:title": "Special Episode: COVID-19 - Omicron Variant Causes Concern",
  "itunes:episodeType": "full",
  "itunes:episode": 503,
  "itunes:summary": "Last week’s news of the Omicron variant of COVID-19 has raised questions about transmissibility, vaccine efficacy, and virus mortality. Where does this variant leave us in the fight against COVID-19 and how are markets reacting?",
  "content:encoded": "<p>Last week’s news of the Omicron variant of COVID-19 has raised questions about transmissibility, vaccine efficacy, and virus mortality. Where does this variant leave us in the fight against COVID-19 and how are markets reacting?</p><p><br></p><p>----- Transcript -----</p><p><strong>Andrew Sheets </strong>Welcome to Thoughts on the Market. I'm Andrew Sheets, chief cross asset strategist for Morgan Stanley Research.</p><p><br></p><p><strong>Matthew Harrison </strong>And I'm Matthew Harrison, Biotechnology Analyst</p><p><br></p><p><strong>Andrew Sheets </strong>And on this special edition of the podcast, we'll be talking about a new COVID variant and its impact on markets. It's Tuesday, November 30th at 2p.m. in London.</p><p><br></p><p><strong>Matthew Harrison </strong>And it's 9:00 a.m. in New York.</p><p><br></p><p><strong>Andrew Sheets </strong>So Matt, first things first, you know, we've seen a pretty major development over the American Thanksgiving holiday. We saw a new COVID variant, the omicron variant, kind of come into the market's attention. Can you talk just a little bit about why this variant has gotten so much focus and what do we know about it?</p><p><br></p><p><strong>Matthew Harrison </strong>Sure. I think there are probably three major factors that have driven the focus. The first thing is there was clear scientific concern because of the number of mutations in the variant. And specifically, there are over 50 mutations, 32 of which are in the spike protein region, which is where vaccines are targeted. And then a number in the receptor binding domain, which is where the antibodies typically tend to bind. So the antibodies that either vaccines or antibody therapies create. And what we know when we look at many of these mutations is they're present in other variants: gamma, delta, alpha, beta and we know that many of these mutations in a pair one or two have led to reduction in vaccine effectiveness. And so, when they're combined all together, from a scientific standpoint, people were very concerned about having all of those mutations together and what that would mean in terms of vaccine escape.</p><p><br></p><p><strong>Andrew Sheets </strong>So Matt, this is obviously a challenging situation because this is a new variant. It's just been discovered. And yet, you know, a lot of people are trying to figure out what the longer-term implications could be. So, you know, when you look at this with the kind of a limited amount of information, you know, what are the key characteristics that you're going to be watching that that you think we should care about?</p><p><br></p><p><strong>Matthew Harrison </strong>There are probably three things that I'm focused on and we can probably touch on in detail. So the first one is transmissibility, and the reason for that is if this variant overtakes Delta and becomes dominant globally, then we're going to care about the two other factors a lot more, which is vaccine escape and lethality. However, if it's not more transmissible than Delta and Delta remains the dominant variant, then this may be an issue in small pockets, but ultimately will fade and continue to be overtaken by Delta. And so that's why transmissibility is the primary focus. And so what do we know about transmissibility right now? We have a couple of pieces of information out of South Africa. The first is they have sequenced a number of recent COVID patients. And in those sequences, the vast majority or almost all of them have been Omicron. So that suggests that it is overtaking Delta. But again, sometimes sequence results can be biased because they're not a population sample and they're a selection of a certain subset of people. The second piece of information, which to me is more compelling, is I'm sure everybody's aware of the PCR tests. There's a certain kind of deletion here in this variant that that that you can pick up with a PCR test and so you can see the frequency of that deletion. And that that frequency has risen from about a background rate of about 5% in the last week and a half to about 50% of the PCR tests coming back suggestive of this variant in South Africa. And so that's a much bigger sample size than the sequencing sample size. And so that suggests at least in the small subset that you're seeing greater transmissibility compared to Delta. Now it's going to take time to confirm that. And now that we've seen cases globally in a lot of countries over the next week or two, everybody's going to be watching how quickly the Omicron cases rise compared to Delta to confirm whether or not it's more transmissible than Delta.</p><p><br></p><p><strong>Andrew Sheets </strong>This question of vaccine evasion. There's there has been some increased concern about this new variant that it might be able to evade vaccines. Why do people think that? And you know, how soon might we know?</p><p><br></p><p><strong>Matthew Harrison </strong>Why don't we start with the timeline, because that's the simpler part. The experiments to figure that out take about two weeks. And just so everybody has the background on this, you need to take the virus, you need to grow it up. And once you have a sample of it, then you take blood from people that have recovered from COVID and blood from people that have been vaccinated that are full of those antibodies. And you put them in the in the dish and you find out how much virus you kill. And that'll tell you how effective the serum from vaccinated or previously infected individuals are against the new variant. So that process typically takes about two weeks. So then why are people worried about vaccine evasion with this variant? Primarily because of the known mutations that it carries and the unknown mutations. And of the known mutations that it carries, it carries the same set of mutations as in beta, and the beta variant had significant vaccine evasion properties that never became dominant, but it did reduce vaccine effectiveness by about six-fold. And so, I think the concern is with those mutations, plus a range of other mutations known to have vaccine evasion properties, having them all together has really significantly increased concern about how much that may hurt the vaccine's ability to stop infection.</p><p><br></p><p><strong>Andrew Sheets </strong>And, Matt, so you talked about the importance of transmissibility, you know, you talked about some of the reasons why the concerns are higher around vaccine evasion with this variant. And the last thing you talked about was the lethality of this variant. And again, you know, what are you looking for there? Is there anything that concerns you with the information that we know and when might we know more?</p><p><br></p><p><strong>Matthew Harrison </strong>So this is the hardest question because as is typical, you get a lot of anecdotal reports about what's happening with recently infected patients, but it takes a while, on order of four to five weeks, to really understand if there is a significant difference in mortality or hospitalization. So we have very little information around those factors. You have seen in the capital region, in South Africa, where you've where you've seen these rising cases, a rise in hospitalizations, but we don't know if all those cases are Omicron cases or not. And we haven't seen mortality at all. But again, with recent infections, it usually takes four or five weeks to start to see the potential impact of those infections on mortality.</p><p><br></p><p><strong>Matthew Harrison </strong>And Andrew, I think one other thing which is important to mention is while we're while we're talking about severity of disease and lethality, we have to remember that in addition to vaccines, we do have now other effective treatments, including antibody therapies and oral therapies. And while some antibody therapies are likely not to work against Omicron, at least two or three of them are. And so you have you will have some effective antibody therapies. And then the oral therapies, given their mechanisms of action, should not be impacted. So we will have oral therapies in terms of treatment. So hopefully, even if we do get a scenario where there is significant impact on vaccine efficacy, this will not be like going back to the beginning of the pandemic, where we didn't have other effective treatments available.</p><p><br></p><p><strong>Matthew Harrison </strong>Andrew, unlike normal episodes, maybe it'll be my chance since the markets have been so volatile. How has this impacted your outlook on the markets in the near to medium term?</p><p><br></p><p><strong>Matthew Harrison </strong>I know inflation and the inflation debate and the impact of central banks on inflation has been a sort of key debate that I've heard you guys reflecting on.</p><p><br></p><p><strong>Andrew Sheets </strong>Yeah. So I think probably the thing I should say up front is at the moment, we don't think we have enough evidence around this variant to change our baseline economic forecast to change that optimistic view on growth. Now what it might change is some of the timing around it, and I think we saw a little bit of this with the Delta variant. Where, you know, that was a big development in 2021, you know, people didn't see that coming. And you know, if you step back and think about this year, the market was still good, yield still rose, there was a lot of market movement, very consistent with better economic growth if you take the year as a whole, even though you had this variant, but the variant did introduce some kind of twists and turns along the way. So you know, that's currently the way that we're thinking about this new omicron variant that it is not likely or we don't know enough yet to be confident that it would really change that economic outlook, especially because we think there are a lot of good reasons why growth could be solid, but it might introduce some near-term uncertainty. You know, the interesting thing about, as you mentioned, inflation is that it could affect inflation in both directions. It could cause inflation to be higher, for example, if it, you know, causes shutdowns in countries that are important for producing key goods. And you can't get the things that you want, and the price goes up. But it could also drive prices down. You know, on last Friday oil prices fell by over 10%. You know, that is a big part of inflation certainly as most people experience it. Gas prices will be lower based on what happened on Friday. So that can drive inflation down so it can cut both ways.</p><p><br></p><p><strong>Matthew Harrison </strong>Andrew, it's been great talking to you. Thanks for your thoughts.</p><p><br></p><p><strong>Andrew Sheets </strong>Matt, always a pleasure to talk to you.</p><p><br></p><p><strong>Matthew Harrison </strong>As a reminder, if you enjoy Thoughts on the Market, please take a moment to rate and review us on the Apple Podcast app. It helps more people find the show.</p>",
  "guid": "gid://art19-episode-locator/V0/ncr2t8vFsy6xFqOSynSmGHK7RPMcAd8SB25fdPT_lEI",
  "pubDate": "Wed, 01 Dec 2021 01:09:00 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:duration": "00:09:22",
  "enclosure": ""
}