{
  "title": "Ukraine lost access to 1,300 Starlink terminals over a funding issue",
  "description": "<p>As recently as October 24th, Ukraine’s military suffered a partial internet outage after 1,300 Starlink terminals went offline due to a funding shortage, <a href=\"https://www.cnn.com/2022/11/04/politics/spacex-ukraine-elon-musk-starlink-internet-outage/\">reports <em>CNN</em></a>. The blackout occurred amid ongoing talks between SpaceX and the Department of Defense that continue despite Elon Musk having said his company would continue to foot the bill for the country’s Starlink usage.</p><p>“Negotiations are very much underway. Everyone in our building knows we’re going to pay them,” a senior Pentagon official told the network, adding that the Defense Department wants to get something in writing “because we worry he’ll change his mind.”</p><span id=\"end-legacy-contents\"></span><p>In September, SpaceX <a href=\"https://www.engadget.com/spacex-starlink-ukraine-funding-defense-department-135027598.html\">sent a letter</a> to the Pentagon, asking the Defense Department to take over paying expenses related to Ukraine’s usage of its Starlink internet service. <a href=\"https://www.engadget.com/elon-musk-spacex-keep-funding-ukraine-starlink-satellite-internet-075616416.html\">On October 15th</a>, following public outcry, Musk appeared to backtrack on the decision to ask the US government for assistance. “To hell with it… we’ll just keep funding Ukraine govt for free,” Musk tweeted, later <a href=\"https://www.ft.com/content/5a66a547-a142-451e-80cd-a6d5e0775268\">telling <em>The Financial Times</em></a><em>&nbsp;</em>the company would do so “indefinitely.”</p><p>According to <em>CNN</em>, last month’s outage was a “huge problem” for Ukraine’s military. In March, the country purchased the 1,300 terminals from a British company. SpaceX reportedly charged Ukraine $2,500 per month to keep each unit operational. The country eventually couldn’t afford to pay the $3.25 million monthly bill anymore and asked for financial aid from the British Ministry of Defence. After some discussion, the two agreed to prioritize other military expenses.</p><p>“We support a number of terminals that have a direct tactical utility for Ukraine’s military in repelling Russia’s invasion,” a British official told <em>CNN</em>.  “We consider and prioritize all new requests in terms of the impact contributions would have in supporting Ukraine to defend its people against Putin’s deplorable invasion.”</p><p>Should SpaceX and the US Department of Defense eventually sign an agreement, it’s unclear if the Pentagon will have greater control over Starlink service in Ukraine. The company currently decides where Ukrainian troops can use the terminals.</p>",
  "link": "https://www.engadget.com/ukraine-starlink-outage-184124365.html?src=rss",
  "source_id": "engadget_479",
  "guid": "da3cdf85-9d73-4a3b-99b2-2c3e40ce2387",
  "dc:creator": "Igor Bonifacic",
  "source": "Engadget",
  "dc:publisher": "Engadget",
  "dc:rightsHolder": "Engadget",
  "pubDate": "Sat, 05 Nov 2022 18:41:24 +0000",
  "ingested": 1667674532,
  "modified": "2022-11-05T18:55:35+00:00",
  "category": [
    "Politics & Government",
    "Military & Defense",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Igor Bonifacic"
  ],
  "media:content": [
    {
      "media:keywords": "headline",
      "media:media_html": "",
      "dc:identifier": 1,
      "media:credit": "",
      "media:description": "",
      "media:title": ""
    },
    {
      "media:media_html": "",
      "dc:identifier": 2,
      "media:credit": "Michael Gonzalez via Getty Images",
      "media:description": "BOCA CHICA BEACH, TX - AUGUST 25: SpaceX founder Elon Musk speaks during a T-Mobile and SpaceX joint event on August 25, 2022 in Boca Chica Beach, Texas. The two companies announced plans to work together to provide T-Mobile cellular service using Starlink satellites. (Photo by Michael Gonzalez/Getty Images)",
      "media:title": "SpaceX And T-Mobile Hold Joint Event In Texas"
    }
  ]
}