{
  "title": "Martial Law nostalgia and Ilocano youth: reimagining the Marcos legacy",
  "link": "https://www.newmandala.org/martial-law-nostalgia-and-ilocano-youth-reimagining-the-marcos-legacy/",
  "dc:creator": "Athena Charanne “Ash” R. Presto and Aaron Abel T. Mallari",
  "pubDate": "Wed, 26 Oct 2022 07:30:57 +0000",
  "category": [
    "2022 Philippines election",
    "historiography",
    "History",
    "Identity",
    "Philippines",
    "Uncategorized"
  ],
  "guid": "https://www.newmandala.org/?p=60133",
  "description": "<p>Recounted experiences from elder generations in Ilocos clash with national facts, and young people have to choose between the two. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.newmandala.org/martial-law-nostalgia-and-ilocano-youth-reimagining-the-marcos-legacy/\">Martial Law nostalgia and Ilocano youth: reimagining the Marcos legacy</a> appeared first on <a rel=\"nofollow\" href=\"https://www.newmandala.org\">New Mandala</a>.</p>\n",
  "content:encoded": "<p>The ascent of Ferdinand “Bongbong” Marcos Jr to the presidency was historic. With 31 million votes, he secured over 50% of the electorate in <a href=\"https://newsinfo.inquirer.net/1596719/happy-with-31-million-votes-but-didnt-expect-it-says-bongbong-marcos-spox\">an election by plurality</a>. Three decades since the ouster of Ferdinand Marcos, Sr, his son and namesake staged a dramatic comeback prompting efforts by scholars and observers to make sense of the recent tectonic shift in Philippine politics.</p>\n<p>One puzzle that remains to be thoroughly nuanced, however, relates to the way young people in the Marcos home region of Ilocos view the Marcos legacy. Their perceptions have significant implications pre- and post-election, especially with respect to the freedoms that young people are willing to sacrifice under the younger Marcos’ administration.</p>\n<p>We have been conducting research in the last three months to unpack how Ilocano youth navigate political participation in a polarized society. Our insights are founded on 16 in-depth interviews, four focus group discussions and ethnography conducted in Ilocos Norte during the 50<sup>th</sup> anniversary of the declaration of Marcos martial law.</p>\n<p>In our discussions and fieldwork, young people who supported Bongbong Marcos expressed a desire to experience martial law. This desire is predicated on the pleasant stories about the Marcos martial law that their elder family members recount, having an Ilocano incumbent in the presidency, the current economic crisis that plagues the country, and the public history of the Marcos years that is constructed and maintained in Ilocos.</p>\n<p>Our interviewees recall how despite the acknowledgment of human rights violations during martial law, their grandparents share stories that paint a rosy picture of the period. Memories of peace and economic prosperity in the 1970s cultivate a nostalgia within young people of the supposed “Golden Age” of the Marcoses. This, despite the estimated <a href=\"https://newsinfo.inquirer.net/1034745/remembering-martial-law-under-the-marcos-regime\">70,000 arrests, 34,000 people tortured, and 3,240 people killed</a> in the Marcos martial law era. These stories are also used to rationalise that the violations happened to the “hard-headed people”. While this view is similarly characteristic of the unfreedoms that former president Rodrigo Duterte implemented in order to <a href=\"https://www.illiberalism.org/marco-garrido-a-conjunctural-account-of-upper-and-middle-class-support-for-rodrigo-duterte-2/\">“discipline democracy”</a>, the way the elder Ilocano seem to acknowledge and accept the narrative exerts influence on the views of the young people regarding martial law.</p>\n<p>It is crucial to note that older generations hail the supposed gains of martial law: in the minds of our young interviewees, elders continue to hold authority over collective memory and must therefore be respected. These generational dynamics animate the way young people understand politics. It is also extremely important that, in the minds of the young people we spoke to, martial law under the administration of a fellow Ilocano will not hurt them.</p>\n<p>Ilocanos protect fellow Ilocanos, they say. Consequently, the younger Marcos will favour the Ilocos region just as the elder Marcos did. This is consistent with the lived experience of the older generations and the oral history that is passed down from one generation to the next.</p>\n<p>We argue that the view that an Ilocano president will again favour Ilocos is valid yet incomplete. Marcos Sr initiated programmes that benefited the Ilocos, such as small ticket projects on land distribution, irrigation and infrastructure, which our interviewees refer to in our interviews.  Alongside this, though, is the record of human rights violations that Marcos inflicted in his fellow Ilocanos as well as the number of Ilocano activists that fought the Marcos dictatorship. One such instance is the killing of <a href=\"https://www.instagram.com/p/Ciw8iI3JM6B/\">Puri Pedro</a>, an Ilocana activist from Laoag City.</p>\n<p>That the plight of Ilocano activists under the Marcos martial law is unrecognised by our interviewees is unsurprising; the absence cultivates a misguided desire to experience a life constructed only by half-truths.</p>\n<p>We also found that public history in Ilocos binds Ilocano youth to a lifeworld that makes the support for the Marcoses not only viable, but also imperative. Our visit in Ilocos Norte in September 2022—the 50<sup>th</sup> anniversary of the declaration of martial law—revealed just how different Ilocos can be from the rest of the country.</p>\n<p>In contrast to Manila’s occasional streamers and graffiti exclaiming “<a href=\"https://www.reuters.com/world/asia-pacific/never-forget-filipino-activists-mark-50th-anniversary-martial-law-declaration-2022-09-21/\">Never Again, Never Forget”</a> and the <a href=\"https://www.rappler.com/nation/photos-students-wear-black-martial-law-declaration-anniversary-2022/\">campaigns to wear black</a> on the day commemorating the declaration of martial law, life in Ilocos carried on with virtually no mention of martial law. Instead, posters and tarpaulins from the previous weeks’ 105<sup>th</sup>commemoration of the senior Ferdinand Marcos’s birthday still abound. Walking around the streets of Batac and Laoag, one is confronted by the many murals where Marcos Sr is presented along the pantheon of the heroes of the Philippine Revolution.</p>\n<div id=\"attachment_60135\" style=\"width: 1034px\" class=\"wp-caption alignnone\"><img aria-describedby=\"caption-attachment-60135\" loading=\"lazy\" class=\"wp-image-60135 size-large\" src=\"http://www.newmandala.org/wp-content/uploads/2022/10/marcos-1-1024x768.jpg\" alt=\"\" width=\"1024\" height=\"768\" srcset=\"https://www.newmandala.org/wp-content/uploads/2022/10/marcos-1-1024x768.jpg 1024w, https://www.newmandala.org/wp-content/uploads/2022/10/marcos-1-300x225.jpg 300w, https://www.newmandala.org/wp-content/uploads/2022/10/marcos-1-768x576.jpg 768w, https://www.newmandala.org/wp-content/uploads/2022/10/marcos-1-965x724.jpg 965w, https://www.newmandala.org/wp-content/uploads/2022/10/marcos-1-1250x937.jpg 1250w, https://www.newmandala.org/wp-content/uploads/2022/10/marcos-1-400x300.jpg 400w, https://www.newmandala.org/wp-content/uploads/2022/10/marcos-1.jpg 1379w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p id=\"caption-attachment-60135\" class=\"wp-caption-text\">Image of Marcos Sr’s 105th birth anniversary commemoration at Tabacalera at the centre of Ilocos Norte’s capital of Laoag City. Image captured by author Presto.</p></div>\n<p>Inside the many museums of the province, there also exist narratives about the life and legacy of Marcos that present a life of conviction, grit, and love of country; and highlight how his presidency heralded several landmark policies. All these are woven within a story that is silent on the economic challenges of the martial law period, the human rights abuses, and the plunder and corruption that earned his regime global infamy. The fact that the <a href=\"https://www.ibon.org/golden-years-the-real-long-lasting-economic-damage-wrought-by-marcos/\">national debt increased fiftyfold</a> under the Marcos administration from 1965 to 1986 and that Marcos’ administration was included in the Guinness Book of World Records as the <a href=\"https://interaksyon.philstar.com/rumor-cop/2020/02/27/163043/ferdinand-marcos-world-record-corruption/\">greatest ever robbery by a government</a> are absent in Ilocos public history.</p>\n<p>Contestation of the Marcos legacy is scarce in Ilocos Norte. There is a narrow, if not singular, story about the life of the Marcoses and the legacy of martial law. This single story also provides a logic that young people use to rationalise pockets of resistance among the few Ilocanos who criticise the Marcoses. As many of our interviewees asserted regarding Ilocanos who continue to criticise the Marcoses, <em>“</em>They think like that because they left Ilocos.”</p>\n<div id=\"attachment_60136\" style=\"width: 1034px\" class=\"wp-caption alignnone\"><img aria-describedby=\"caption-attachment-60136\" loading=\"lazy\" class=\"wp-image-60136 size-large\" src=\"http://www.newmandala.org/wp-content/uploads/2022/10/marcos-2-1024x768.jpg\" alt=\"\" width=\"1024\" height=\"768\" srcset=\"https://www.newmandala.org/wp-content/uploads/2022/10/marcos-2-1024x768.jpg 1024w, https://www.newmandala.org/wp-content/uploads/2022/10/marcos-2-300x225.jpg 300w, https://www.newmandala.org/wp-content/uploads/2022/10/marcos-2-768x576.jpg 768w, https://www.newmandala.org/wp-content/uploads/2022/10/marcos-2-965x724.jpg 965w, https://www.newmandala.org/wp-content/uploads/2022/10/marcos-2-1250x937.jpg 1250w, https://www.newmandala.org/wp-content/uploads/2022/10/marcos-2-400x300.jpg 400w, https://www.newmandala.org/wp-content/uploads/2022/10/marcos-2.jpg 1379w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p id=\"caption-attachment-60136\" class=\"wp-caption-text\">Image shows a painting of Marcos Sr alongside Ilocano heroes in public spaces in Ilocos Norte. Image captured by author Presto.</p></div>\n<p>Public history, nonetheless, interacts with young people’ current and lived experiences. Young people lament the current state of the Philippine economy and wish that they would experience the same Golden age that their grandparents espouse.</p>\n<p>At first glance, this may seem ironic: the Marcoses ushered in one of the worst recessions in Philippine history, yet young people expect to experience economic mobility under the younger Marcos. This irony has a logic, though. Beyond facts and evidence about the economic plunder of Marcos shared by critics, elder people’s lived experiences continue to feed young people’s desire for martial law. As one of our interviewees said, “I hope to experience what they say that prices were down under Marcos… prices are high at the moment.”</p>\n<p>Recounted experiences from elder generations in Ilocos clash with national facts, and young people appear to have to choose between the two. In Ilocos, collective memories of elder generations and public history interact with contemporary realities, piquing young people’s curiosity and desire to experience martial law. While this picture looks grim, it also provides opportunities for activists and scholars to examine ways to move forward.</p>\n<p>First, we suggest activists and scholars could find more innovative ways to convey facts about Marcos martial law while at the same time acknowledging that collective memory and lived experiences of elder generations blur these facts. Our respondents tell us they do not engage in political conversations especially with people outside Ilocos because non-Ilocanos will not understand where they are coming from. This alone shows the need to carefully and creatively navigate between fact-checking and acknowledging a lifeworld that makes support for the Marcoses imperative.</p>\n<p>A second approach could leverage contemporary public issues that form young people’s <em>own </em>lived experiences and memories. As another Marcos sits in Malacañan, reiterating the unbroken link between the past, the present and the future could strike more meaningful conversations about how we could utilise the lessons of history. Within 100 days in office, Bongbong Marcos’ presidency has faced several challenges including the on-going pandemic, a super typhoon, sinking value of the Philippine Peso, and a ongoing squabble online and offline about his efficiency as the head of state. The precarity of the present under the regime of another Marcos should be made more salient to the younger generation, who face an uncertain future.</p>\n<p>We maintain the importance of looking at the perspectives of young people in Ilocos, as they live at the heart of the Marcos bailiwick. Theirs are the views of those who grew up knowing a single story and public history. Finally, we assert that knowing whether and why young people view Martial Law favourably is a central question in Marcos Jr’s Philippines, showing the results of mythmaking that will have ramifications for the country’s democracy.</p>\n<p><em>The research mentioned in this piece is a project funded by the Friedrich Naumann Foundation for Freedom in the Philippines.</em></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.newmandala.org/martial-law-nostalgia-and-ilocano-youth-reimagining-the-marcos-legacy/\">Martial Law nostalgia and Ilocano youth: reimagining the Marcos legacy</a> appeared first on <a rel=\"nofollow\" href=\"https://www.newmandala.org\">New Mandala</a>.</p>\n"
}