{
  "title": "To Catch a Falling Satellite",
  "link": "https://spectrum.ieee.org/space-junk-astrobee",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/animation-of-a-square-with-3-axis-arrows-maneuvering-towards-a-spinning-satellite.gif?id=29534835&width=1200&height=800&coordinates=50%2C0%2C50%2C0\"/><br/><br/><p>It is the fate of many a dead satellite to spend its last years tumbling out of control. A fuel line may burst, or solar wind may surge, or there may be drag from the outer reaches of the atmosphere—and unless a spacecraft has been designed in some way that keeps it naturally stable, chances are good that it will begin to turn end over end.<br/></p><p>That’s a problem, because Earth orbit is getting more and more crowded. Engineers would like to corral old pieces of <a href=\"https://spectrum.ieee.org/weve-already-passed-the-tipping-point-for-orbital-debris\" target=\"_self\">space junk</a>, but they can’t safely reach them, especially if they’re unstable. The European Space Agency says there are about 30,000 “<a href=\"https://www.esa.int/Safety_Security/Space_Debris/Space_debris_by_the_numbers\" rel=\"noopener noreferrer\" target=\"_blank\" title=\"Link: https://www.esa.int/Safety_Security/Space_Debris/Space_debris_by_the_numbers\">debris objects</a>” now being tracked in Earth orbit—derelict satellites, spent rocket stages, pieces sent flying from collisions in space. There may also be 900,000 smaller bits of orbital debris—everything from loose bolts to flecks of paint to shards of insulation. They may be less than 10 centimeters long, but they can still destroy a healthy satellite if they hit at orbital speeds.</p><p>“With more satellites being launched, we might encounter more situations where we have a defunct satellite that’s occupying a valuable orbit,” says <a href=\"https://aeroastro.mit.edu/people/richard-linares/\" rel=\"noopener noreferrer\" target=\"_blank\">Richard Linares</a>, an assistant professor of aeronautics and astronautics at MIT. He’s part of an American-German project, called <a href=\"https://news.mit.edu/2022/how-reach-tumbling-target-space-0225\" rel=\"noopener noreferrer\" target=\"_blank\">TumbleDock/ROAM</a>, researching ways to corral and stabilize tumbling satellites so they can be deorbited or, in some cases, perhaps even refueled or repaired.</p><p>Engineers have put up with orbital debris for decades, but Linares says the picture is changing. For one thing, satellite technology is becoming more and more affordable—just look at SpaceX, which has been launching <a href=\"https://www.starlink.com/\" rel=\"noopener noreferrer\" target=\"_blank\">40 satellites a week</a> so far this year. For another, he says, the economic benefits those satellites offer—high-speed internet, GPS, climate and crop monitoring and other applications—will be threatened if the risk of impacts keeps growing.</p><p>“I think in the next few years we’ll have the technology to do something about space debris,” says Linares. “And there are economic drivers that will incentivize companies to do this.”</p><p>The TumbleDock/ROAM team has just finished a series of tests in the cabin of the International Space Station, using NASA robots called <a href=\"https://spectrum.ieee.org/astrobee-nasa-gateway\" target=\"_blank\">Astrobees</a> to stand in for a tumbling satellite and a “chaser” spacecraft sent to catch it. The goal: to figure out <a href=\"https://www.frontiersin.org/articles/10.3389/frobt.2021.641338/full\" rel=\"noopener noreferrer\" target=\"_blank\">algorithms</a> so that a chaser can find its target, determine its tumble rates, and calculate the safest and most efficient approach to it.</p><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"e7214e6d1d9d95267aa3c03e4604d150\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/IsEpmzFGFh8?rel=0&start=43\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Astrobee robot experiment aboard the ISS to reach a tumbling target in space.</small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">\n<a href=\"https://www.youtube.com/watch?v=IsEpmzFGFh8&t=43s\" target=\"_blank\">www.youtube.com</a>\n</small>\n</p><p>“There’s a massive amount of large debris out there,” says <a href=\"https://ieeexplore.ieee.org/author/37086406826\" rel=\"noopener noreferrer\" target=\"_blank\">Keenan Albee</a>, a Ph.D. student on the team at MIT. “Look at some of them, with large solar panels that are ready to whack you if you don’t do the approach correctly.”</p><p>The researchers decided early on that a chase vehicle needs enough autonomy to close in on a disabled satellite on its own. Even the largest satellites are too distant for ground-based tracking stations to track their attitude with any precision. A chaser, perhaps equipped with navigation cameras, lidar, and other sensors, will need to do the job in real time.</p><p>“The tumbling motion of a satellite can be quite complex,” says <a href=\"https://rmc.dlr.de/rm/de/staff/roberto.lampariello/\" rel=\"noopener noreferrer\" target=\"_blank\">Roberto Lampariello</a>, the principal investigator on the project at the German Aerospace Center, or DLR. “And if you want to be sure you are not going to collide with any appendages while approaching the mating point, having an autonomous method of guidance is, I think, very attractive.”</p><p>The Astrobee tests on the space station showed that it can be done, at least in principle. Each Astrobee robot is a cube, about 30 centimeters on a side, with navigation cameras, compressed-air thrusters, and Snapdragon processors much like what you would find in a smartphone. For the latest test, last month, NASA astronaut <a href=\"https://www.nasa.gov/astronauts/biographies/mark-t-vande-hei\" rel=\"noopener noreferrer\" target=\"_blank\">Mark Vande Hei</a> set up two Astrobees a couple of meters apart. They then took their commands from Albee on the ground. He started the test runs, with one robot tumbling and the other trying to rendezvous with it. There have been glitches; the Astrobees needed help determining their precise location relative to the station walls. But the results of the tests were promising.</p><p>A next step, say the researchers, is to determine how best for a chase spacecraft to grapple its target, which is especially difficult if it’s a piece of debris with no docking mechanism. Other plans over the years have involved big nets or lasers; TumbleDock/ROAM team members say they’re intrigued by grippers that use <a href=\"https://spectrum.ieee.org/watch-astrobees-first-autonomous-flight-on-the-international-space-station\" target=\"_self\">van der Waals forces</a> between atoms, the kinds that help a gecko cling to a sheer surface.</p><p>The larger question is how to turn experiments like these into actual solutions to a growing, if lofty, problem. Low Earth orbit has been crowded enough, for long enough, that satellite makers add shielding to their vehicles and space agencies continuously scan the skies to prevent close calls. No space travelers have been killed, and there have only been a few cases in which satellites were actually pulverized. But the problem has become increasingly expensive and, in some cases, dangerous. SpaceX has launched 2,000 <a href=\"https://spectrum.ieee.org/spacex-preps-selfdriving-satellites-for-launch\" target=\"_self\">Starlink Internet satellites</a> so far, may launch 30,000 more, and has other companies (<a href=\"https://spectrum.ieee.org/amazons-project-kuiper-is-more-than-the-companys-response-to-spacex\" target=\"_self\">like Amazon</a>) racing to keep up. They see profits up there.</p><p>MIT’s Linares says that, in fact, is why it’s worth figuring out the space-junk problem. “There’s a reason why those orbits are valuable,” he says. Companies may spend billions to launch new satellites—and don’t want them threatened by old satellites.</p><p>“If your company’s benefiting from an orbit band,” he says, “then you’d probably better get someone to clean it up for you.”</p>",
  "pubDate": "Mon, 14 Mar 2022 16:55:14 +0000",
  "guid": "https://spectrum.ieee.org/space-junk-astrobee",
  "category": [
    "Space junk",
    "Astrobee",
    "Iss",
    "Esa",
    "Nasa",
    "Satellites"
  ],
  "dc:creator": "Ned Potter",
  "media:content": ""
}