{
  "title": "A Brief History of Men Singing Really High",
  "description": "Men singing high is so ubiquitous in modern pop that we might take it granted, never pausing to ask: has it always been this way? Estelle Caswell, who makes the Emmy-winning Earworm series for Vox, decided to find out, and she stops by to share results from her painstaking study of male falsetto in pop music from 1958 to today. Some of her findings may surprise, like 1996 was the peak year for falsetto, Justin Timberlake doesn't sing as you high at might think, and falsetto has been around as long as pop itself. \nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
  "pubDate": "Tue, 15 Oct 2019 09:30:00 -0000",
  "itunes:episodeType": "full",
  "itunes:author": "Vulture",
  "itunes:image": "",
  "itunes:subtitle": "Hits today favor male falsetto, but has it always been the case?",
  "itunes:summary": "Men singing high is so ubiquitous in modern pop that we might take it granted, never pausing to ask: has it always been this way? Estelle Caswell, who makes the Emmy-winning Earworm series for Vox, decided to find out, and she stops by to share results from her painstaking study of male falsetto in pop music from 1958 to today. Some of her findings may surprise, like 1996 was the peak year for falsetto, Justin Timberlake doesn't sing as you high at might think, and falsetto has been around as long as pop itself. \nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
  "content:encoded": "<p>Men singing high is so ubiquitous in modern pop that we might take it granted, never pausing to ask: has it always been this way? Estelle Caswell, who makes the Emmy-winning <a href=\"https://www.vox.com/earworm\"><em>Earworm</em></a><em> </em>series for Vox, decided to find out, and she stops by to share results from her painstaking study of male falsetto in pop music from 1958 to today. Some of her findings may surprise, like 1996 was the peak year for falsetto, Justin Timberlake doesn't sing as you high at might think, and falsetto has been around as long as pop itself. </p><p> </p><p>Learn more about your ad choices. Visit <a href=\"https://podcastchoices.com/adchoices\">podcastchoices.com/adchoices</a></p>",
  "itunes:duration": 2816,
  "guid": "8b746ce8-a250-11e8-9b32-7f0d7a6edf6b",
  "enclosure": ""
}