{
  "id": "https://bibleinoneyear.org/en/youth/157",
  "title": "Day 157: Kindness",
  "description": "Psalm 70:1–2a,4–5, 2 Samuel 9:3, 9:6b–7, Acts 3:1–10.  Unexpected kindness is the most powerful, least costly and most underrated agent of human change  When kindness is expressed, healthy relationships are created, community connections are nourished and people are inspired to pass on kindness",
  "pubDate": "Sun, 06 Jun 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/157/?ignore",
  "itunes:duration": "13:32",
  "guid": "enyouth06062021-157",
  "length": 812.43,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 157: Kindness",
  "itunes:subtitle": "Psalm 70:1–2a,4–5, 2 Samuel 9:3, 9:6b–7, Acts 3:1–10.  Unexpected kindness is the most powerful, least costly and most underrated agent of human change  When kindness is expressed, healthy relationships are created, community connections are nourished and people are inspired to pass on kindness",
  "itunes:summary": "Steve Sjogren wrote a book called Conspiracy of Kindness. He started a church in Cincinnati, Ohio, that grew rapidly to an average attendance of over 7,000. Their motto is, ‘Small things done with great love are changing the world.’ They carry out random acts of kindness like paying for a stranger’s coffee or writing a ‘thank you’ note to a shop assistant.\nKindness is love in work clothes. Showing God’s love in practical ways, they have discovered the power of kindness to effect positive change, both in their lives and in the lives of people around them. Unexpected kindness is the most powerful, least costly and most underrated agent of human change. When kindness is expressed, healthy relationships are created, community connections are nourished and people are inspired to pass on kindness.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 157
}