{
  "id": "yt:video:AV50ZJL4Qzg",
  "yt:videoId": "AV50ZJL4Qzg",
  "yt:channelId": "UC8OZsdWmGCM-vojiQmtUK8g",
  "title": "Lunz - Upper See (offical video)",
  "link": "",
  "author": {
    "name": "groenlandrecords",
    "uri": "https://www.youtube.com/channel/UC8OZsdWmGCM-vojiQmtUK8g"
  },
  "published": "2022-10-23T08:00:03+00:00",
  "updated": "2022-10-24T21:30:42+00:00",
  "media:group": {
    "media:title": "Lunz - Upper See (offical video)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Lunz 20th Anniversary Special Edition pre-order:\nNorth- and Sout America: https://www.curiousmusic.us\nEurope and rest of the world: https://www.groenland.com/shop\n\n***\nGroenland Records and Curious Music are pleased to announce the 20th anniversary special edition release of Lunz by Tim Story and Hans-Joachim Roedelius.\n\nLunz 20th Anniversary Special Edition releases on October 26th, 2022 (Roedelius’ 88th birthday) and is available for pre-order now:\nCurious Music webshop for North- and South America:\nhttps://www.curiousmusic.us/all-products/lunz-by-tim-story-and-hans-joachim-roedelius-20th-anniversary-special-edition-2lp-180-gram-vinyl-and-cd-with-four-collectors-covers\nGroenland Records webshop for Europe:\nhttps://www.groenland.com/product/hans-joachim-roedelius-tim-story-lunz-20th-anniversary-special-edition-cd-2/\n\nThis very special release comes newly remastered by Tim Story as a digtial download, collector’s edition cd with four covers (limited to 250 per cover worldwide), and a double 180-gram audiophile vinyl release with hand-numbered and signed art print (limited to 500 copies worldwide).\n\nLunz was the second collaboration of the German electronic music legend Hans-Joachim Roedelius (Cluster, Harmonia) and Grammy-nominated American composer/producer Tim Story. Lunz was the culmination of the composers’ 25-year mutual admiration and friendship, and the beginning of a prolific partnership that spawned six acclaimed albums, audio art installations and live concerts across Europe and the US.\n\nWhen Lunz originally hit the record shop shelves of London, listeners knew of the Roedelius/Story collaboration only via a few concerts and the abstract musique concrete of their limited edition cd Persistence of Memory. Lunz quickly changed that with 12 timeless and beautiful miniatures, each creating a unique sense of time and place with a surreal blend of melody, texture and mood. Lunz inhabits a world all its own, of lush acoustics and angular electronics, translucent pianos and dark ambiences. It's a mysterious world where the innocent and the distressed occupy the same singular environment, coalescing perfectly. 20 years on, Lunz remains a fan favorite and a landmark addition to both artists body of work.\n\nThe first-ever appearance of Lunz on vinyl comes in a spectacular double vinyl gatefold and hand-numbered Lunz art prints signed by Story/Roedelius. The cd is available in four different collector covers designed by Sebastian Boecking. Both vinyl and cd contain two previously unreleased bonus tracks from the Lunz sessions.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}