{
  "guid": "https://podcasts.nationalreview.com/?p=1769",
  "title": "Episode 15: Philip Wegmann / Creedence Clearwater Revival",
  "description": "<p>Scot and Jeff talk to Philip Wegmann about Creedence Clearwater Revival.</p>\n<p><span><b>Introducing the Band<br />\n</b></span>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\" target=\"_blank\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\" target=\"_blank\">@EsotericCD</a>) with guest Philip Wegmann, writer for the <i>Washington Examiner</i>. Follow Phil on Twitter at <a href=\"https://twitter.com/PhilipWegmann\" target=\"_blank\">@PhilipWegmann</a>, and read his past work <a href=\"http://www.washingtonexaminer.com/author/philip-wegmann\" target=\"_blank\">here</a>.</p>\n<p><span><b>Philip’s Musical Pick: Creedence Clearwater Revival<br />\n</b></span>It’s high times on the bayou as the gang discusses Creedence Clearwater Revival, a band that sounded like it crawled out of the swamps of Louisiana despite being composed entirely of guys from Nowheresville, northern California. Is it possible for a band with multiple #1 albums, five #2 hit singles and scads of nearly ubiquitous radio hits to be underrated? If so, then CCR fits the bill: a great band that is still somehow underappreciated as the superlative album act that they were. Maybe it’s because they packed all of their creativity into a brief span of time in the late ’60s (with six classic albums released in the span of two calendar years). Maybe it’s because their constant presence on the radio erroneously led people to think they were a singles act. Maybe it’s because they made it look too easy, pumping out songs with deceptively simple chord changes and instrumentation. Maybe it’s because their record label was famously awful. Maybe it’s because John Fogerty is kind of a jerk. Who knows. All that matters is that Creedence is one of the greatest American rock groups of all time, and it’s downright strange how few people realize that.</p>\n<p>As for Philip, he describes the joy of discovering CCR as a kid from downstate rural Indiana, listening to honest and plainspoken songs that spoke to his experiences growing up in what, culturally, is more South than Midwest. (If Phil’s parents are reading this, he would like to apologize for blowing out the family speaker system by blasting “Up Around The Bend” on max volume all the time.) Jeff can’t remember a time when Creedence wasn’t part of his life, from his dad’s old CD edition of <i>Chronicle</i>onwards. Only later did he get into the bands albums and realize that nearly every one of them was stuffed full of amazing music. Scot is perplexed that the popular perception of CCR as a singles act has no relationship to the quality of their full body of work.</p>\n<p><u>KEY TRACK</u>: “<a href=\"https://www.youtube.com/watch?v=mtQ9HkdIDg8\">Up Around The Bend</a>” (<i>Cosmo’s Factory</i>, 1970)</p>\n<p><span><b>The Long Hard Road from Tommy & The Blue Velvets to <i>Creedence Clearwater Revival<br />\n</i></b></span><b></b>Creedence may have had a brief but prolific reign as megastars, but they had been preparing for their shot at the title for years. Jeff briefly recounts CCR’s prehistory: the band, comprised of John Fogerty (vocals, lead guitar, songwriting/managing/autocracy), older brother Tom Fogerty (rhythm guitar), and junior high school friends Stu Cook (bass) and Doug Clifford (drums), had been playing together since <u>1959</u>. From sock hops to dive bars, high school proms to thankless opening gigs for bands with regional hits, the quartet paid their dues in a thousand different places just like the one described “Lodi,” even temporarily adopting the dire (and offensive) name “The Golliwogs” in order to pass themselves off as a faux-British Invasion act in 1964. John Fogerty and Doug Clifford even got <i>drafted into the Army</i>, and went and served two years in the Reserves while still trying to make it work. Finally, with their stints in the armed services finished, the band were finally given an opportunity by their record label’s new owner to record a full-length album. One condition: the name had to change. Thus The Golliwogs happily became Creedence Clearwater Revival, and John Fogerty was dead-set determined that they wouldn’t waste the chance they had finally, after nearly a decade of non-stop gigging, finally been given.</p>\n<p>The result? <i>Creedence Clearwater Revival</i> (1968), a self-titled debut album as impressive as any of the Sixties. Jeff argues that this is CCR’s most underrated record by far, with nary a wasted second on its brief 33 minute running time outside the clumsy instrumental jamming in the middle of “Susie Q” (the group’s first hit single, present here in a ‘spacey’ 8 minute long extended version). Scot disagrees somewhat, arguing that as entertaining as the debut album is, Fogerty’s songwriting isn’t there yet: the best songs in his opinion are the covers, particularly “I Put A Spell On You” and “Ninety-Nine And A Half.” Scot and Philip point to “Porterville” as the true turning point for the band, not only in terms of their soon-to-be-iconic instrumental sound, but in terms of Fogerty’s newfound ability to tell stories that feel authentic and real — in large part because they <i>do</i> draw upon the well of his personal experiences. Jeff also takes time to salute Fogerty’s lead guitar playing (perhaps the most overlooked part of the entire CCR equation), particularly the Neil Young-like guitar tone he gets on songs like “The Working Man.”</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=UGEuY6-3nYg\" target=\"_blank\">I Put A Spell On You</a>” (<i>Creedence Clearwater Revival</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=5AcUqzprb_c\" target=\"_blank\">Ninety-Nine And A Half (Won’t Do)</a>” (<i>Creedence Clearwater Revival</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=-z7IRav68VQ&list=PLDQcdXhUQ44maTTS6IHGQLGFONmbsOyej&index=9\" target=\"_blank\">Walking On The Water</a>” (<i>Creedence Clearwater Revival</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=TzAhx6cRyrY\" target=\"_blank\">Porterville</a>” (<i>Creedence Clearwater Revival</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=-FWl7BWHBjE\" target=\"_blank\">The Working Man</a>” (<i>Creedence Clearwater Revival</i>, 1968)</p>\n<p><span><b>An Explosion of Creativity: Creedence Clearwater Revival’s 1969<br />\n</b></span><b></b>There are few musical acts more impressive in their bravura-level prolificity than Creedence Clearwater Revival’s amazing run during the year of 1969. Driven by Fogerty’s manic fear that the band would blow the opportunity they had been given, CCR released not one, not two, but <i>three</i> classic albums during this year, each of them stacked with some of the most famous songs in the history of rock music.</p>\n<p>The gang is all agreed that the first of them, <i>Bayou Country</i> (January 1969), is the weakest of this legendary trio, too heavily dependent upon long bluesy instrumental jams that ramble on without going anywhere particularly interesting. But then it’s hard to care too much when this is the album that also contains “Proud Mary,” one of the greatest pieces of American popular music ever written. Jeff can’t even quite believe that “Proud Mary” was <i>written</i>; surely this song has been sung by people on Mississippi River for a hundred years or more, no? Scot loves “Born On The Bayou” and both he and Phil laugh at the fact that these guys were so amazingly good at counterfeiting Louisiana roots despite never having been within a thousand miles of the state. Jeff also shouts out to “Bootleg,” surely one of the most hypnotically simplistic rhythm beds ever laid down Sixties rock.</p>\n<p>If <i>Bayou Country </i>was impressive but flawed, there are no flaws on its follow-up <i>Green River</i> (August 1969). The gang agrees that <i>Green River</i> is such a titanic achievement that it almost defies standard commentary: these are songs that you have been singing your entire life, simple, elemental, immensely moving, with tinges of darkness and foreboding lurking in unexpected corners. Jeff calls “Wrote A Song For Everyone” one of the most devastating social comments — when interpreted on either a personal level or a more public/political one — ever written in rock. Scot marvels at “Bad Moon Rising”‘s ability to pack some of Fogerty’s bleakest lyrics into one of his peppiest instrumental tracks (a contrast which actually makes the lyric more grimly effective). And everyone pauses to pay their respects to “Lodi,” which may as well have been Creedence Clearwater’s pre-1968 autobiography.</p>\n<p>Three months after <i>Green River</i> Creedence was back at it again, with <i>Willy And The Poor Boys</i> (November 1969). Jeff refers to this as CCR’s “political” album, but considers the politics to be brilliantly subtle and infinitely more durable than the contemporaneous ventures of CCR’s San Francisco-scene counterculture rivals like Jefferson Airplane. “Fortunate Son” isn’t even an anti-war song, properly understood, so much as it is a coruscating commentary on class struggle: the working man paying the price and bearing the burden that the rich elite are insulated from. (“Don’t Look Now” is even more on-point in this regard.) Phil notes just how many sheerly bad protest songs there are out there, and how remarkable it is that not only are CCR’s uniformly excellent, they’re all radio hits too. Scot thinks that “The Midnight Special” is “Proud Mary” in reverse: instead of being an original that sounds like it’s been around for 70 years, it’s a 70-year-old song that CCR masters so perfectly that it seems pointless to cover it anymore.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=t7w5oA-MlL0\" target=\"_blank\">Proud Mary</a>” (<i>Bayou Country</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=PcSSphYaKv4\" target=\"_blank\">Born On The Bayou</a>” (<i>Bayou Country</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=lrh9KDixjqI\" target=\"_blank\">Bootleg</a>” (<i>Bayou Country</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=-LovA9jXALc\" target=\"_blank\">Wrote A Song For Everyone</a>” (<i>Green River</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=dpYVjctrlm4\" target=\"_blank\">Green River</a>” (<i>Green River</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=mttL96xbcBk\" target=\"_blank\">Commotion</a>” (<i>Green River</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=VhrlrUeNcEU\" target=\"_blank\">Lodi</a>” (<i>Green River</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=qoMO4eY156A\" target=\"_blank\">Bad Moon Rising</a>” (<i>Green River</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=rKuLtVXGRp8\" target=\"_blank\">Fortunate Son</a>” (<i>Willy And The Poor Boys</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=TYzCrW8qf1E\" target=\"_blank\">It Came Out Of Sky</a>” (<i>Willy And The Poor Boys</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=dm_03pPu3HU\" target=\"_blank\">Don’t Look Now (It Ain’t You Or Me)</a>” (<i>Willy And The Poor Boys</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=1_d9LtgicuQ\" target=\"_blank\">Down On The Corner</a>” (<i>Willy And The Poor Boys</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=-qEiAVVZLGI\" target=\"_blank\">The Midnight Special</a><i>” </i>(<i>Willy And The Poor Boys</i>, 1969)</p>\n<p><span><b>1970: Creedence reaches the summit of the mountain, and then begins to tumble down the other side<br />\n</b></span><b></b>When it comes to <i>Cosmo’s Factory</i> (1970), Jeff sums it up right from the start: “this is an album I think we’re going to be falling all over each other to agree about.” And indeed, the gang agrees that if you don’t own and adore <i>Cosmo’s Factory</i> then you pretty much have no taste. Out of 11 songs, exactly one is less than magnificent, and a full SEVEN of them are instantly recognizable hits. The gang’s discussion of <i>Cosmo</i> could have ended by just listing them (“Travelin’ Band,” “Who’ll Stop The Rain,” “Run Through The Jungle,” “Up Around The Bend,” “I Heard It Through The Grapevine,” “Long As I Can See The Light,” and “Lookin’ Out My Back Door”) and threatening you to punch you in the face if you don’t immediately go listen to it. But they continue anyway because Jeff needs to sing the praises of “Ramble Tamble,” a 7 minute long opening jam that demonstrates CCR’s artistic growth, a sophisticatedly layered and structured guitar showcase that departs from their formula and comes up aces. Phil is happy that John Fogerty finally seems happy for once in his life with the joyful country-pop of “Lookin’ Out My Back Door.” Scot observes that half of these songs are now used, essentially, as the movie/documentary-approved Official Soundtrack To Vietnam.</p>\n<p>At this point the gang discusses CCR’s unfortunate struggle for artistic acceptance among their counterculture peers in the SF rock scene, and how drove Fogerty in particular to distraction. The tribalism of the contemporaneous hippie disdain for CCR’s plaid-flannel-shirt meat & potatoes hitmaking ways is a sad comment on the same in-group/out-group dynamics that seem to operate eternally, and this led inevitably to <i>Pendulum</i> (1970), the last classic CCR album, where Fogerty insisted that every track be self-penned (to prove his <i>artiste</i> credentials) and in doing so sabotaged it with inexplicable album-concluding noise collage “Rude Awakening #2.” But the rest of the record remains a piker. Scot loves the smoother, organ-based Stax/Volt sound that defines most of <i>Pendulum </i>and all agree that “Have You Ever Seen The Rain?” might just be one of CCR’s finest songs. Phil notes the poignancy of the lyric, which was written about the internal turmoil in the band (primarily John’s worsening relationship with his older brother Tom) and how, even at this moment of triumph, all involved had to have known they were playing a song that signaled the death-knell of the band.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=0i_IspzKNVg\" target=\"_blank\">Ramble Tamble</a>” (<i>Cosmo’s Factory</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=eQc_BfkSknw\" target=\"_blank\">Lookin’ Out My Back Door</a>” (<i>Cosmo’s Factory</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=DZmKhHG9RD0\" target=\"_blank\">Who’ll Stop The Rain</a>” (<i>Cosmo’s Factory</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=XSIJ5eWtCug\" target=\"_blank\">Run Through The Jungle</a>” (<i>Cosmo’s Factory</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=cBSrQMwuqbU\" target=\"_blank\">Long As I Can See The Light</a>” (<i>Cosmo’s Factory</i>, ,1970); “<a href=\"https://www.youtube.com/watch?v=d83FwShxpsM\" target=\"_blank\">I Heard It Through The Grapevine</a>” (<i>Cosmo’s Factory</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=11qnp8Q0Kxo\" target=\"_blank\">Pagan Baby</a>” (<i>Pendulum</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=t7w5oA-MlL0\" target=\"_blank\">Have You Ever Seen The Rain?</a>” (<i>Pendulum</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=mBchRnXpm_o\" target=\"_blank\">Hey Tonight</a>” (<i>Pendulum</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=ZWXDl2NMQLg\" target=\"_blank\">It’s Just A Thought</a>” (<i>Pendulum</i>, 1970)</p>\n<p><span><b>The End: <i>Mardi Gras</i>, the Collapse of Creedence, and John Fogerty’s Intermittent Solo Career<br />\n</b></span><b></b>When the Reaper came for Creedence, he didn’t waste his time. The band really ended, at least in terms of being a quality group, almost immediately after <i>Pendulum</i>, when Tom Fogerty declared he’d had enough of his younger brother’s autocratic ways and quit the band. After a year spent touring that left CCR’s final release to be the almost perversely bad <i>Mardi Gras</i>(1972), where Fogerty petulantly responded to the longstanding requests for greater creative input from his bandmates by spitefully turning around and insisting that not only <i>could</i> Cook and Clifford contribute their own songs to the new album, they <i>had to</i> — in fact, they had to each write and sing a full third of the record. Given that neither Cook nor Clifford were John Fogerty, this necessarily meant that 2/3rds of <i>Mardi Gras</i> is near-unlistenable garbage, almost offensively bad. But even Fogerty’s songwriting/singing contributions seem distracted and second-rate; “Sweet Hitch-Hiker” is merely adequate as a Creedence rocker and the only real highlight, as Phil and Scot point out, is “Someday Never Comes,” an openly autobiographical song. It was such an unfortunate way to wrap up the legacy of a truly great band. And for what? All agree that John Fogerty’s solo career is mostly pointless, an intermittent affair that never resulted in a single album of any great worth and threw up only one song that anyone will remember ten years from now: the great baseball ode “Centerfield.”</p>\n<p>But at least they left us with all this great music.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=tMsjX3nb4SE\" target=\"_blank\">Sweet Hitch-Hiker</a>” (<i>Mardi Gras</i>, 1972); “<a href=\"https://www.youtube.com/watch?v=19JehBxoMR0\" target=\"_blank\">Someday Never Comes</a>” (<i>Mardi Gras</i>, 1972); “<a href=\"https://www.youtube.com/watch?v=04KQydlJ-qc\" target=\"_blank\">Centerfield</a>” [John Fogerty] (<i>Centerfield</i>, 1985)</p>\n<p><span><b>Finale<br />\n</b></span><b></b>Phil, Scot and Jeff each name their two key albums and five key songs from Creedence Clearwater Revival.</p>\n",
  "pubDate": "Sun, 3 Dec 2017 23:37:22 +0000",
  "author": "studio@nationalreview.com (National Review)",
  "link": "https://www.nationalreview.com/media/political-beats",
  "content:encoded": "<p>Scot and Jeff talk to Philip Wegmann about Creedence Clearwater Revival.</p>\n<p><span><b>Introducing the Band<br />\n</b></span>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\" target=\"_blank\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\" target=\"_blank\">@EsotericCD</a>) with guest Philip Wegmann, writer for the <i>Washington Examiner</i>. Follow Phil on Twitter at <a href=\"https://twitter.com/PhilipWegmann\" target=\"_blank\">@PhilipWegmann</a>, and read his past work <a href=\"http://www.washingtonexaminer.com/author/philip-wegmann\" target=\"_blank\">here</a>.</p>\n<p><span><b>Philip’s Musical Pick: Creedence Clearwater Revival<br />\n</b></span>It’s high times on the bayou as the gang discusses Creedence Clearwater Revival, a band that sounded like it crawled out of the swamps of Louisiana despite being composed entirely of guys from Nowheresville, northern California. Is it possible for a band with multiple #1 albums, five #2 hit singles and scads of nearly ubiquitous radio hits to be underrated? If so, then CCR fits the bill: a great band that is still somehow underappreciated as the superlative album act that they were. Maybe it’s because they packed all of their creativity into a brief span of time in the late ’60s (with six classic albums released in the span of two calendar years). Maybe it’s because their constant presence on the radio erroneously led people to think they were a singles act. Maybe it’s because they made it look too easy, pumping out songs with deceptively simple chord changes and instrumentation. Maybe it’s because their record label was famously awful. Maybe it’s because John Fogerty is kind of a jerk. Who knows. All that matters is that Creedence is one of the greatest American rock groups of all time, and it’s downright strange how few people realize that.</p>\n<p>As for Philip, he describes the joy of discovering CCR as a kid from downstate rural Indiana, listening to honest and plainspoken songs that spoke to his experiences growing up in what, culturally, is more South than Midwest. (If Phil’s parents are reading this, he would like to apologize for blowing out the family speaker system by blasting “Up Around The Bend” on max volume all the time.) Jeff can’t remember a time when Creedence wasn’t part of his life, from his dad’s old CD edition of <i>Chronicle</i>onwards. Only later did he get into the bands albums and realize that nearly every one of them was stuffed full of amazing music. Scot is perplexed that the popular perception of CCR as a singles act has no relationship to the quality of their full body of work.</p>\n<p><u>KEY TRACK</u>: “<a href=\"https://www.youtube.com/watch?v=mtQ9HkdIDg8\">Up Around The Bend</a>” (<i>Cosmo’s Factory</i>, 1970)</p>\n<p><span><b>The Long Hard Road from Tommy & The Blue Velvets to <i>Creedence Clearwater Revival<br />\n</i></b></span><b></b>Creedence may have had a brief but prolific reign as megastars, but they had been preparing for their shot at the title for years. Jeff briefly recounts CCR’s prehistory: the band, comprised of John Fogerty (vocals, lead guitar, songwriting/managing/autocracy), older brother Tom Fogerty (rhythm guitar), and junior high school friends Stu Cook (bass) and Doug Clifford (drums), had been playing together since <u>1959</u>. From sock hops to dive bars, high school proms to thankless opening gigs for bands with regional hits, the quartet paid their dues in a thousand different places just like the one described “Lodi,” even temporarily adopting the dire (and offensive) name “The Golliwogs” in order to pass themselves off as a faux-British Invasion act in 1964. John Fogerty and Doug Clifford even got <i>drafted into the Army</i>, and went and served two years in the Reserves while still trying to make it work. Finally, with their stints in the armed services finished, the band were finally given an opportunity by their record label’s new owner to record a full-length album. One condition: the name had to change. Thus The Golliwogs happily became Creedence Clearwater Revival, and John Fogerty was dead-set determined that they wouldn’t waste the chance they had finally, after nearly a decade of non-stop gigging, finally been given.</p>\n<p>The result? <i>Creedence Clearwater Revival</i> (1968), a self-titled debut album as impressive as any of the Sixties. Jeff argues that this is CCR’s most underrated record by far, with nary a wasted second on its brief 33 minute running time outside the clumsy instrumental jamming in the middle of “Susie Q” (the group’s first hit single, present here in a ‘spacey’ 8 minute long extended version). Scot disagrees somewhat, arguing that as entertaining as the debut album is, Fogerty’s songwriting isn’t there yet: the best songs in his opinion are the covers, particularly “I Put A Spell On You” and “Ninety-Nine And A Half.” Scot and Philip point to “Porterville” as the true turning point for the band, not only in terms of their soon-to-be-iconic instrumental sound, but in terms of Fogerty’s newfound ability to tell stories that feel authentic and real — in large part because they <i>do</i> draw upon the well of his personal experiences. Jeff also takes time to salute Fogerty’s lead guitar playing (perhaps the most overlooked part of the entire CCR equation), particularly the Neil Young-like guitar tone he gets on songs like “The Working Man.”</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=UGEuY6-3nYg\" target=\"_blank\">I Put A Spell On You</a>” (<i>Creedence Clearwater Revival</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=5AcUqzprb_c\" target=\"_blank\">Ninety-Nine And A Half (Won’t Do)</a>” (<i>Creedence Clearwater Revival</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=-z7IRav68VQ&list=PLDQcdXhUQ44maTTS6IHGQLGFONmbsOyej&index=9\" target=\"_blank\">Walking On The Water</a>” (<i>Creedence Clearwater Revival</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=TzAhx6cRyrY\" target=\"_blank\">Porterville</a>” (<i>Creedence Clearwater Revival</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=-FWl7BWHBjE\" target=\"_blank\">The Working Man</a>” (<i>Creedence Clearwater Revival</i>, 1968)</p>\n<p><span><b>An Explosion of Creativity: Creedence Clearwater Revival’s 1969<br />\n</b></span><b></b>There are few musical acts more impressive in their bravura-level prolificity than Creedence Clearwater Revival’s amazing run during the year of 1969. Driven by Fogerty’s manic fear that the band would blow the opportunity they had been given, CCR released not one, not two, but <i>three</i> classic albums during this year, each of them stacked with some of the most famous songs in the history of rock music.</p>\n<p>The gang is all agreed that the first of them, <i>Bayou Country</i> (January 1969), is the weakest of this legendary trio, too heavily dependent upon long bluesy instrumental jams that ramble on without going anywhere particularly interesting. But then it’s hard to care too much when this is the album that also contains “Proud Mary,” one of the greatest pieces of American popular music ever written. Jeff can’t even quite believe that “Proud Mary” was <i>written</i>; surely this song has been sung by people on Mississippi River for a hundred years or more, no? Scot loves “Born On The Bayou” and both he and Phil laugh at the fact that these guys were so amazingly good at counterfeiting Louisiana roots despite never having been within a thousand miles of the state. Jeff also shouts out to “Bootleg,” surely one of the most hypnotically simplistic rhythm beds ever laid down Sixties rock.</p>\n<p>If <i>Bayou Country </i>was impressive but flawed, there are no flaws on its follow-up <i>Green River</i> (August 1969). The gang agrees that <i>Green River</i> is such a titanic achievement that it almost defies standard commentary: these are songs that you have been singing your entire life, simple, elemental, immensely moving, with tinges of darkness and foreboding lurking in unexpected corners. Jeff calls “Wrote A Song For Everyone” one of the most devastating social comments — when interpreted on either a personal level or a more public/political one — ever written in rock. Scot marvels at “Bad Moon Rising”‘s ability to pack some of Fogerty’s bleakest lyrics into one of his peppiest instrumental tracks (a contrast which actually makes the lyric more grimly effective). And everyone pauses to pay their respects to “Lodi,” which may as well have been Creedence Clearwater’s pre-1968 autobiography.</p>\n<p>Three months after <i>Green River</i> Creedence was back at it again, with <i>Willy And The Poor Boys</i> (November 1969). Jeff refers to this as CCR’s “political” album, but considers the politics to be brilliantly subtle and infinitely more durable than the contemporaneous ventures of CCR’s San Francisco-scene counterculture rivals like Jefferson Airplane. “Fortunate Son” isn’t even an anti-war song, properly understood, so much as it is a coruscating commentary on class struggle: the working man paying the price and bearing the burden that the rich elite are insulated from. (“Don’t Look Now” is even more on-point in this regard.) Phil notes just how many sheerly bad protest songs there are out there, and how remarkable it is that not only are CCR’s uniformly excellent, they’re all radio hits too. Scot thinks that “The Midnight Special” is “Proud Mary” in reverse: instead of being an original that sounds like it’s been around for 70 years, it’s a 70-year-old song that CCR masters so perfectly that it seems pointless to cover it anymore.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=t7w5oA-MlL0\" target=\"_blank\">Proud Mary</a>” (<i>Bayou Country</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=PcSSphYaKv4\" target=\"_blank\">Born On The Bayou</a>” (<i>Bayou Country</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=lrh9KDixjqI\" target=\"_blank\">Bootleg</a>” (<i>Bayou Country</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=-LovA9jXALc\" target=\"_blank\">Wrote A Song For Everyone</a>” (<i>Green River</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=dpYVjctrlm4\" target=\"_blank\">Green River</a>” (<i>Green River</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=mttL96xbcBk\" target=\"_blank\">Commotion</a>” (<i>Green River</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=VhrlrUeNcEU\" target=\"_blank\">Lodi</a>” (<i>Green River</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=qoMO4eY156A\" target=\"_blank\">Bad Moon Rising</a>” (<i>Green River</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=rKuLtVXGRp8\" target=\"_blank\">Fortunate Son</a>” (<i>Willy And The Poor Boys</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=TYzCrW8qf1E\" target=\"_blank\">It Came Out Of Sky</a>” (<i>Willy And The Poor Boys</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=dm_03pPu3HU\" target=\"_blank\">Don’t Look Now (It Ain’t You Or Me)</a>” (<i>Willy And The Poor Boys</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=1_d9LtgicuQ\" target=\"_blank\">Down On The Corner</a>” (<i>Willy And The Poor Boys</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=-qEiAVVZLGI\" target=\"_blank\">The Midnight Special</a><i>” </i>(<i>Willy And The Poor Boys</i>, 1969)</p>\n<p><span><b>1970: Creedence reaches the summit of the mountain, and then begins to tumble down the other side<br />\n</b></span><b></b>When it comes to <i>Cosmo’s Factory</i> (1970), Jeff sums it up right from the start: “this is an album I think we’re going to be falling all over each other to agree about.” And indeed, the gang agrees that if you don’t own and adore <i>Cosmo’s Factory</i> then you pretty much have no taste. Out of 11 songs, exactly one is less than magnificent, and a full SEVEN of them are instantly recognizable hits. The gang’s discussion of <i>Cosmo</i> could have ended by just listing them (“Travelin’ Band,” “Who’ll Stop The Rain,” “Run Through The Jungle,” “Up Around The Bend,” “I Heard It Through The Grapevine,” “Long As I Can See The Light,” and “Lookin’ Out My Back Door”) and threatening you to punch you in the face if you don’t immediately go listen to it. But they continue anyway because Jeff needs to sing the praises of “Ramble Tamble,” a 7 minute long opening jam that demonstrates CCR’s artistic growth, a sophisticatedly layered and structured guitar showcase that departs from their formula and comes up aces. Phil is happy that John Fogerty finally seems happy for once in his life with the joyful country-pop of “Lookin’ Out My Back Door.” Scot observes that half of these songs are now used, essentially, as the movie/documentary-approved Official Soundtrack To Vietnam.</p>\n<p>At this point the gang discusses CCR’s unfortunate struggle for artistic acceptance among their counterculture peers in the SF rock scene, and how drove Fogerty in particular to distraction. The tribalism of the contemporaneous hippie disdain for CCR’s plaid-flannel-shirt meat & potatoes hitmaking ways is a sad comment on the same in-group/out-group dynamics that seem to operate eternally, and this led inevitably to <i>Pendulum</i> (1970), the last classic CCR album, where Fogerty insisted that every track be self-penned (to prove his <i>artiste</i> credentials) and in doing so sabotaged it with inexplicable album-concluding noise collage “Rude Awakening #2.” But the rest of the record remains a piker. Scot loves the smoother, organ-based Stax/Volt sound that defines most of <i>Pendulum </i>and all agree that “Have You Ever Seen The Rain?” might just be one of CCR’s finest songs. Phil notes the poignancy of the lyric, which was written about the internal turmoil in the band (primarily John’s worsening relationship with his older brother Tom) and how, even at this moment of triumph, all involved had to have known they were playing a song that signaled the death-knell of the band.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=0i_IspzKNVg\" target=\"_blank\">Ramble Tamble</a>” (<i>Cosmo’s Factory</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=eQc_BfkSknw\" target=\"_blank\">Lookin’ Out My Back Door</a>” (<i>Cosmo’s Factory</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=DZmKhHG9RD0\" target=\"_blank\">Who’ll Stop The Rain</a>” (<i>Cosmo’s Factory</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=XSIJ5eWtCug\" target=\"_blank\">Run Through The Jungle</a>” (<i>Cosmo’s Factory</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=cBSrQMwuqbU\" target=\"_blank\">Long As I Can See The Light</a>” (<i>Cosmo’s Factory</i>, ,1970); “<a href=\"https://www.youtube.com/watch?v=d83FwShxpsM\" target=\"_blank\">I Heard It Through The Grapevine</a>” (<i>Cosmo’s Factory</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=11qnp8Q0Kxo\" target=\"_blank\">Pagan Baby</a>” (<i>Pendulum</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=t7w5oA-MlL0\" target=\"_blank\">Have You Ever Seen The Rain?</a>” (<i>Pendulum</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=mBchRnXpm_o\" target=\"_blank\">Hey Tonight</a>” (<i>Pendulum</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=ZWXDl2NMQLg\" target=\"_blank\">It’s Just A Thought</a>” (<i>Pendulum</i>, 1970)</p>\n<p><span><b>The End: <i>Mardi Gras</i>, the Collapse of Creedence, and John Fogerty’s Intermittent Solo Career<br />\n</b></span><b></b>When the Reaper came for Creedence, he didn’t waste his time. The band really ended, at least in terms of being a quality group, almost immediately after <i>Pendulum</i>, when Tom Fogerty declared he’d had enough of his younger brother’s autocratic ways and quit the band. After a year spent touring that left CCR’s final release to be the almost perversely bad <i>Mardi Gras</i>(1972), where Fogerty petulantly responded to the longstanding requests for greater creative input from his bandmates by spitefully turning around and insisting that not only <i>could</i> Cook and Clifford contribute their own songs to the new album, they <i>had to</i> — in fact, they had to each write and sing a full third of the record. Given that neither Cook nor Clifford were John Fogerty, this necessarily meant that 2/3rds of <i>Mardi Gras</i> is near-unlistenable garbage, almost offensively bad. But even Fogerty’s songwriting/singing contributions seem distracted and second-rate; “Sweet Hitch-Hiker” is merely adequate as a Creedence rocker and the only real highlight, as Phil and Scot point out, is “Someday Never Comes,” an openly autobiographical song. It was such an unfortunate way to wrap up the legacy of a truly great band. And for what? All agree that John Fogerty’s solo career is mostly pointless, an intermittent affair that never resulted in a single album of any great worth and threw up only one song that anyone will remember ten years from now: the great baseball ode “Centerfield.”</p>\n<p>But at least they left us with all this great music.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=tMsjX3nb4SE\" target=\"_blank\">Sweet Hitch-Hiker</a>” (<i>Mardi Gras</i>, 1972); “<a href=\"https://www.youtube.com/watch?v=19JehBxoMR0\" target=\"_blank\">Someday Never Comes</a>” (<i>Mardi Gras</i>, 1972); “<a href=\"https://www.youtube.com/watch?v=04KQydlJ-qc\" target=\"_blank\">Centerfield</a>” [John Fogerty] (<i>Centerfield</i>, 1985)</p>\n<p><span><b>Finale<br />\n</b></span><b></b>Phil, Scot and Jeff each name their two key albums and five key songs from Creedence Clearwater Revival.</p>\n",
  "enclosure": "",
  "itunes:title": "Episode 15: Philip Wegmann / Creedence Clearwater Revival",
  "itunes:author": "National Review",
  "itunes:duration": "01:21:51",
  "itunes:summary": "Scot and Jeff talk to Philip Wegmann about Creedence Clearwater Revival.",
  "itunes:subtitle": "Scot and Jeff talk to Philip Wegmann about Creedence Clearwater Revival.",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:episode": 15
}