{
  "title": "The Old Friend | Best of RGSO",
  "link": "https://audioboom.com/posts/8120717",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2458,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>An old friend’s life comes to an end, however, her spirit never dies.<br>\n<br>\n\n</div>\n<div>Here is a preview of the story.<br>\n“Now a few months ago Margaret found out she is sick too and is going to die - so she sold the house to move three hundred miles south, closer to Mayo Clinic where she needs to be. She hired a great moving company and had me come make sure she did not forget anything she needed to do. Two moving trucks showed up on a Thursday and they started packing the house up. At one point Margaret had told me she was going to have the urn in her car with her on the way to her new home, but she forgot to tell the movers, and I did not remember either until they were working in her room. I said, \"excuse me, but did you see a wooden box on the floor by her bed?\" Oh yes ma'am, we have that all packed and ready to go. You should have seen the looks on their faces when I told them \"Can you please unpack that box again because that is actually Margaret's husband, and she wanted him in the car with her.\" lol. It was so funny! They assured us it was the first time they had ever packed a husband. lol. They handed me the box, all wrapped in a moving blanket and shrink wrapped and I put it in the passenger seat of the car for her. No worries. Until the next day.”<br>\n<br>\n\n</div>\n<div>Watch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\n\n</div>\n<div>If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n",
  "pubDate": "Sun, 31 Jul 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-07-14:/posts/8120717",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}