{
  "title": "Episode 151: &#8220;San Francisco&#8221; by Scott McKenzie",
  "link": "https://500songs.com/podcast/episode-151-san-francisco-by-scott-mckenzie/",
  "pubDate": "Mon, 22 Aug 2022 17:47:18 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=1281",
  "description": "We start season four of <em>A History of Rock Music in Five Hundred Songs</em> with an extra-long look at \"San Francisco\" by Scott McKenzie, and at the Monterey Pop Festival, and the careers of the Mamas and the Papas and P.F. Sloan.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/70877906\">on \"Up, Up, and Away\" by the 5th Dimension.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n<strong>Errata: </strong>An incorrect version of the file was previously uploaded, with the wrong section edited in at approximately 57 minutes. This was fixed about three hours after uploading, but some streaming services may have cached the wrong file.\n\nAlso I say that John Phillips wrote \"No, No, No, No\". I got this from an interview with McKenzie, but he must have been misremembering -- the song is a cover version of \"La Poupee Qui Fait Non\" by Michel Polnareff, with English-language lyrics by Geoff Stephens\n\n\n\n<strong>Resources</strong>\n\nAs usual, all the songs excerpted in the podcast can be heard in full at <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-151-san-francisco/\">Mixcloud</a>.\n\nScott McKenzie's first album is available <a href=\"https://amzn.to/3casXIS\">here</a>.\n\nThere are many compilations of the Mamas and the Papas' music, but sadly none that are in print in the UK have the original mono mixes. <a href=\"https://amzn.to/3KfZI40\">This set</a> is about as good as you're going to find, though, for the stereo versions.\n\nInformation on the Mamas and the Papas came from <a href=\"https://amzn.to/3dL3W7l\"><em>Go Where You Wanna Go: The Oral History of The Mamas and the Papas</em> by Matthew Greenwald</a>, <a href=\"https://amzn.to/3wp5j2a\"><em>California Dreamin': The True Story Of The Mamas and Papas</em> by Michelle Phillips</a>, and <a href=\"https://amzn.to/3AyR8cb\"><em>Papa John</em> by John Phillips and Jim Jerome.</a>\n\nInformation on P.F. Sloan came from <a href=\"https://payhip.com/b/efzi\"><em>PF - TRAVELLING BAREFOOT ON A ROCKY ROAD</em> by Stephen McParland</a> and <a href=\"https://amzn.to/3PBrmtf\"><em>What's Exactly the Matter With Me? </em>by P.F. Sloan and S.E. Feinberg.</a>\n\nThe film of the Monterey Pop Festival is available on this <a href=\"https://amzn.to/3QK91LI\">Criterion Blu-Ray set</a>. Sadly the CD of the performances seems to be deleted.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWelcome to season four of A History of Rock Music in Five Hundred Songs. It's good to be back.\n\nBefore we start this episode, I just want to say one thing. I get a lot of credit at times for the way I don't shy away from dealing with the more unsavoury elements of the people being covered in my podcast -- particularly the more awful men. But as I said very early on, I only cover those aspects of their life when they're relevant to the music, because this is a music podcast and not a true crime podcast. But also I worry that in some cases this might mean I'm giving a false impression of some people. In the case of this episode, one of the central figures is John Phillips of the Mamas and the Papas. Now, Phillips has posthumously been accused of some truly monstrous acts, the kind of thing that is truly unforgivable, and I believe those accusations. But those acts didn't take place during the time period covered by most of this episode, so I won't be covering them here -- but they're easily googlable if you want to know. I thought it best to get that out of the way at the start, so no-one's either anxiously waiting for the penny to drop or upset that I didn't acknowledge the elephant in the room.\n\nSeparately, this episode will have some discussion of fatphobia and diet culture, and of a death that is at least in part attributable to those things. Those of you affected by that may want to skip this one or read the transcript. There are also some mentions of drug addiction and alcoholism.\n\nAnyway, on with the show.\n\nOne of the things that causes problems with rock history is the tendency of people to have selective memories, and that's never more true than when it comes to the Summer of Love, summer of 1967. In the mythology that's built up around it, that was a golden time, the greatest time ever, a period of peace and love where everything was possible, and the world looked like it was going to just keep on getting better.\n\nBut what that means, of course, is that the people remembering it that way do so because it was the best time of their lives. And what happens when the best time of your life is over in one summer? When you have one hit and never have a second, or when your band splits up after only eighteen months, and you have to cope with the reality that your best years are not only behind you, but they weren't even best years, but just best months? What stories would you tell about that time? Would you remember it as the eve of destruction, the last great moment before everything went to hell, or would you remember it as a golden summer, full of people with flowers in their hair? And would either really be true?\n\n[Excerpt: Scott McKenzie, \"San Francisco\"]\n\nOther than the city in which they worked, there are a few things that seem to characterise almost all the important figures on the LA music scene in the middle part of the 1960s. They almost all seem to be incredibly ambitious, as one might imagine. There seem to be a huge number of fantasists among them -- people who will not only choose the legend over reality when it suits them, but who will choose the legend over reality even when it doesn't suit them. And they almost all seem to have a story about being turned down in a rude and arrogant manner by Lou Adler, usually more or less the same story.\n\nTo give an example, I'm going to read out a bit of Ray Manzarek's autobiography here. Now, Manzarek uses a few words that I can't use on this podcast and keep a clean rating, so I'm just going to do slight pauses when I get to them, but I'll leave the words in the transcript for those who aren't offended by them:\n\n\"Sometimes Jim and Dorothy and I went alone. The three of us tried Dunhill Records. Lou Adler was the head man. He was shrewd and he was hip. He had the Mamas and the Papas and a big single with Barry McGuire’s 'Eve of Destruction.' He was flush.\n\nWe were ushered into his office. He looked cool. He was California casually disheveled and had the look of a stoner, but his eyes were as cold as a shark’s. He took the twelve-inch acetate demo from me and we all sat down. He put the disc on his turntable and played each cut…for ten seconds. Ten seconds! You can’t tell jack [shit] from ten seconds. At least listen to one of the songs all the way through. I wanted to rage at him. 'How dare you! We’re the Doors! This is [fucking] Jim Morrison! He’s going to be a [fucking] star! Can’t you see that? Can’t you see how [fucking] handsome he is? Can’t you hear how groovy the music is? Don’t you [fucking] get it? Listen to the words, man!' My brain was a boiling, lava-filled Jell-O mold of rage. I wanted to eviscerate that shark.\n\nThe songs he so casually dismissed were 'Moonlight Drive,' 'Hello, I Love You,' 'Summer’s Almost Gone,' 'End of the Night,' 'I Looked at You,' 'Go Insane.'\n\nHe rejected the whole demo. Ten seconds on each song—maybe twenty seconds on 'Hello, I Love You' (I took that as an omen of potential airplay)—and we were dismissed out of hand. Just like that. He took the demo off the turntable and handed it back to me with an obsequious smile and said, 'Nothing here I can use.'\n\nWe were shocked. We stood up, the three of us, and Jim, with a wry and knowing smile on his lips, cuttingly and coolly shot back at him, 'That’s okay, man. We don’t want to be *used*, anyway.'\"\n\nNow, as you may have gathered from the episode on the Doors, Ray Manzarek was one of those print-the-legend types, and that's true of everyone who tells similar stories about Lou Alder. But... there are a *lot* of people who tell similar stories about Lou Adler.\n\nOne of those was Phil Sloan. You can get an idea of Sloan's attitude to storytelling from a story he always used to tell. Shortly after he and his family moved to LA from New York, he got a job selling newspapers on a street corner on Hollywood Boulevard, just across from Schwab's Drug Store. One day James Dean drove up in his Porsche and made an unusual request. He wanted to buy every copy of the newspaper that Sloan had -- around a hundred and fifty copies in total. But he only wanted one article, something in the entertainment section. Sloan didn't remember what the article was, but he did remember that one of the headlines was on the final illness of Oliver Hardy, who died shortly afterwards, and thought it might have been something to do with that. Dean was going to just clip that article from every copy he bought, and then he was going to give all the newspapers back to Sloan to sell again, so Sloan ended up making a lot of extra money that day.\n\nThere is one rather big problem with that story. Oliver Hardy died in August 1957, just after the Sloan family moved to LA. But James Dean died in September 1955, two years earlier.\n\nSloan admitted that, and said he couldn't explain it, but he was insistent. He sold a hundred and fifty newspapers to James Dean two years after Dean's death.\n\nWhen not selling newspapers to dead celebrities, Sloan went to Fairfax High School, and developed an interest in music which was mostly oriented around the kind of white pop vocal groups that were popular at the time, groups like the Kingston Trio, the Four Lads, and the Four Aces. But the record that made Sloan decide he wanted to make music himself was \"Just Goofed\" by the Teen Queens:\n\n[Excerpt: The Teen Queens, \"Just Goofed\"]\n\nIn 1959, when he was fourteen, he saw an advert for an open audition with Aladdin Records, a label he liked because of Thurston Harris. He went along to the audition, and was successful. His first single, released as by Flip Sloan -- Flip was a nickname, a corruption of \"Philip\" -- was produced by Bumps Blackwell and featured several of the musicians who played with Sam Cooke, plus Larry Knechtel on piano and Mike Deasey on guitar, but Aladdin shut down shortly after releasing it, and it may not even have had a general release, just promo copies. I've not been able to find a copy online anywhere.\n\nAfter that, he tried Arwin Records, the label that Jan and Arnie recorded for, which was owned by Marty Melcher (Doris Day's husband and Terry Melcher's stepfather). Melcher signed him, and put out a single, \"She's My Girl\", on Mart Records, a subsidiary of Arwin, on which Sloan was backed by a group of session players including Sandy Nelson and Bruce Johnston:\n\n[Excerpt: Philip Sloan, \"She's My Girl\"]\n\nThat record didn't have any success, and Sloan was soon dropped by Mart Records. He went on to sign with Blue Bird Records, which was as far as can be ascertained essentially a scam organisation that would record demos for songwriters, but tell the performers that they were making a real record, so that they would record it for the royalties they would never get, rather than for a decent fee as a professional demo singer would get.\n\nBut Steve Venet -- the brother of Nik Venet, and occasional songwriting collaborator with Tommy Boyce -- happened to come to Blue Bird one day, and hear one of Sloan's original songs. He thought Sloan would make a good songwriter, and took him to see Lou Adler at Columbia-Screen Gems music publishing. This was shortly after the merger between Columbia-Screen Gems and Aldon Music, and Adler was at this point the West Coast head of operations, subservient to Don Kirshner and Al Nevins, but largely left to do what he wanted.\n\nThe way Sloan always told the story, Venet tried to get Adler to sign Sloan, but Adler said his songs stunk and had no commercial potential. But Sloan persisted in trying to get a contract there, and eventually Al Nevins happened to be in the office and overruled Adler, much to Adler's disgust. Sloan was signed to Columbia-Screen Gems as a songwriter, though he wasn't put on a salary like the Brill Building songwriters, just told that he could bring in songs and they would publish them.\n\nShortly after this, Adler suggested to Sloan that he might want to form a writing team with another songwriter, Steve Barri, who had had a similar non-career non-trajectory, but was very slightly further ahead in his career, having done some work with Carol Connors, the former lead singer of the Teddy Bears. Barri had co-written a couple of flop singles for Connors, before the two of them had formed a vocal group, the Storytellers, with Connors' sister. The Storytellers had released a single, \"When Two People (Are in Love)\" , which was put out on a local independent label and which Adler had licensed to be released on Dimension Records, the label associated with Aldon Music:\n\n[Excerpt: The Storytellers \"When Two People (Are in Love)\"]\n\nThat record didn't sell, but it was enough to get Barri into the Columbia-Screen Gems circle, and Adler set him and Sloan up as a songwriting team -- although the way Sloan told it, it wasn't so much a songwriting team as Sloan writing songs while Barri was also there. Sloan would later claim \"it was mostly a collaboration of spirit, and it seemed that I was writing most of the music and the lyric, but it couldn't possibly have ever happened unless both of us were present at the same time\". One suspects that Barri might have a different recollection of how it went...\n\nSloan and Barri's first collaboration was a song that Sloan had half-written before they met, called \"Kick That Little Foot Sally Ann\", which was recorded by a West Coast Chubby Checker knockoff who went under the name Round Robin, and who had his own dance craze, the Slauson, which was much less successful than the Twist:\n\n[Excerpt: Round Robin, \"Kick that Little Foot Sally Ann\"]\n\nThat track was produced and arranged by Jack Nitzsche, and Nitzsche asked Sloan to be one of the rhythm guitarists on the track, apparently liking Sloan's feel. Sloan would end up playing rhythm guitar or singing backing vocals on many of the records made of songs he and Barri wrote together.\n\n\"Kick That Little Foot Sally Ann\" only made number sixty-one nationally, but it was a regional hit, and it meant that Sloan and Barri soon became what Sloan later described as \"the Goffin and King of the West Coast follow-ups.\" According to Sloan \"We'd be given a list on Monday morning by Lou Adler with thirty names on it of the groups who needed follow-ups to their hit.\"\n\nThey'd then write the songs to order, and they started to specialise in dance craze songs. For example, when the Swim looked like it might be the next big dance, they wrote \"Swim Swim Swim\", \"She Only Wants to Swim\", \"Let's Swim Baby\", \"Big Boss Swimmer\", \"Swim Party\" and \"My Swimmin' Girl\" (the last a collaboration with Jan Berry and Roger Christian).\n\nThese songs were exactly as good as they needed to be, in order to provide album filler for mid-tier artists, and while Sloan and Barri weren't writing any massive hits, they were doing very well as mid-tier writers. According to Sloan's biographer Stephen McParland, there was a three-year period in the mid-sixties where at least one song written or co-written by Sloan was on the national charts at any given time.\n\nMost of these songs weren't for Columbia-Screen Gems though. In early 1964 Lou Adler had a falling out with Don Kirshner, and decided to start up his own company, Dunhill, which was equal parts production company, music publishers, and management -- doing for West Coast pop singers what Motown was doing for Detroit soul singers, and putting everything into one basket. Dunhill's early clients included Jan and Dean and the rockabilly singer Johnny Rivers, and Dunhill also signed Sloan and Barri as songwriters.\n\nBecause of this connection, Sloan and Barri soon became an important part of Jan and Dean's hit-making process. The Matadors, the vocal group that had provided most of the backing vocals on the duo's hits, had started asking for more money than Jan Berry was willing to pay, and Jan and Dean couldn't do the vocals themselves -- as Bones Howe put it \"As a singer, Dean is a wonderful graphic artist\" -- and so Sloan and Barri stepped in, doing session vocals without payment in the hope that Jan and Dean would record a few of their songs. For example, on the big hit \"The Little Old Lady From Pasadena\", Dean Torrence is not present at all on the record -- Jan Berry sings the lead vocal, with Sloan doubling him for much of it, Sloan sings \"Dean\"'s falsetto, with the engineer Bones Howe helping out, and the rest of the backing vocals are sung by Sloan, Barri, and Howe:\n\n[Excerpt: Jan and Dean, \"The Little Old Lady From Pasadena\"]\n\nFor these recordings, Sloan and Barri were known as The Fantastic Baggys, a name which came from the Rolling Stones' manager Andrew Oldham and Mick Jagger, when the two were visiting California. Oldham had been commenting on baggys, the kind of shorts worn by surfers, and had asked Jagger what he thought of The Baggys as a group name. Jagger had replied \"Fantastic!\" and so the Fantastic Baggys had been born.\n\nAs part of this, Sloan and Barri moved hard into surf and hot-rod music from the dance songs they had been writing previously. The Fantastic Baggys recorded their own album, Tell 'Em I'm Surfin', as a quickie album suggested by Adler:\n\n[Excerpt: The Fantastic Baggys, \"Tell 'Em I'm Surfin'\"]\n\nAnd under the name The Rally Packs they recorded a version of Jan and Dean's \"Move Out Little Mustang\" which featured Berry's girlfriend Jill Gibson doing a spoken section:\n\n[Excerpt: The Rally Packs, \"Move Out Little Mustang\"]\n\nThey also wrote several album tracks for Jan and Dean, and wrote \"Summer Means Fun\" for Bruce and Terry -- Bruce Johnston, later of the Beach Boys, and Terry Melcher:\n\n[Excerpt: Bruce and Terry, \"Summer Means Fun\"]\n\nAnd they wrote the very surf-flavoured \"Secret Agent Man\" for fellow Dunhill artist Johnny Rivers:\n\n[Excerpt: Johnny Rivers, \"Secret Agent Man\"]\n\nBut of course, when you're chasing trends, you're chasing trends, and soon the craze for twangy guitars and falsetto harmonies had ended, replaced by a craze for jangly twelve-string guitars and closer harmonies. According to Sloan, he was in at the very beginning of the folk-rock trend -- the way he told the story, he was involved in the mastering of the Byrds' version of \"Mr. Tambourine Man\".\n\nHe later talked about Terry Melcher getting him to help out, saying \"He had produced a record called 'Mr. Tambourine Man', and had sent it into the head office, and it had been rejected. He called me up and said 'I've got three more hours in the studio before I'm being kicked out of Columbia. Can you come over and help me with this new record?' I did. I went over there. It was under lock and key. There were two guards outside the door. Terry asked me something about 'Summer Means Fun'.\n\n\"He said 'Do you remember the guitar that we worked on with that? How we put in that double reverb?'\n\n\"And I said 'yes'\n\n\"And he said 'What do you think if we did something like that with the Byrds?'\n\n\"And I said 'That sounds good. Let's see what it sounds like.'\n\nSo we patched into all the reverb centres in Columbia Music, and mastered the record in three hours.\"\n\nWhether Sloan really was there at the birth of folk rock, he and Barri jumped on the folk-rock craze just as they had the surf and hot-rod craze, and wrote a string of jangly hits including \"You Baby\" for the Turtles:\n\n[Excerpt: The Turtles, \"You Baby\"]\n\nand \"I Found a Girl\" for Jan and Dean:\n\n[Excerpt: Jan and Dean, \"I Found a Girl\"]\n\nThat song was later included on Jan and Dean's Folk 'n' Roll album, which also included... a song I'm not even going to name, but long-time listeners will know the one I mean. It was also notable in that \"I Found a Girl\" was the first song on which Sloan was credited not as Phil Sloan, but as P.F. Sloan -- he didn't have a middle name beginning with F, but rather the F stood for his nickname \"Flip\". Sloan would later talk of Phil Sloan and P.F. Sloan as almost being two different people, with P.F. being a far more serious, intense, songwriter.\n\nFolk 'n' Roll also contained another Sloan song, this one credited solely to Sloan. And that song is the one for which he became best known.\n\nThere are two very different stories about how \"Eve of Destruction\" came to be written. To tell Sloan's version, I'm going to read a few paragraphs from his autobiography:\n\n\"By late 1964, I had already written ‘Eve Of Destruction,’ ‘The Sins Of A Family,’ ‘This Mornin’,’ ‘Ain’t No Way I’m Gonna Change My Mind,’ and ‘What’s Exactly The Matter With Me?’ They all arrived on one cataclysmic evening, and nearly at the same time, as I worked on the lyrics almost simultaneously.\n\n‘Eve Of Destruction’ came about from hearing a voice, perhaps an angel’s. The voice instructed me to place five pieces of paper and spread them out on my bed. I obeyed the voice.\n\nThe voice told me that the first song would be called ‘Eve Of Destruction,’ so I wrote the title at the top of the page. For the next few hours, the voice came and went as I was writing the lyric, as if this spirit—or whatever it was—stood over me like a teacher: ‘No, no … not think of all the hate there is in Red Russia … Red China!’\n\nI didn’t understand. I thought the Soviet Union was the mortal threat to America, but the voice went on to reveal to me the future of the world until 2024. I was told the Soviet Union would fall, and that Red China would continue to be communist far into the future, but that communism was not going to be allowed to take over this Divine Planet—therefore, think of all the hate there is in Red China.\n\nI argued and wrestled with the voice for hours, until I was exhausted but satisfied inside with my plea to God to either take me out of the world, as I could not live in such a hypocritical society, or to show me a way to make things better. When I was writing ‘Eve,’ I was on my hands and knees, pleading for an answer.\"\n\nLou Adler's story is that he gave Phil Sloan a copy of Bob Dylan's Bringing it All Back Home album and told him to write a bunch of songs that sounded like that, and Sloan came back a week later as instructed with ten Dylan knock-offs. Adler said \"It was a natural feel for him. He's a great mimic.\"\n\nAs one other data point, both Steve Barri and Bones Howe, the engineer who worked on most of the sessions we're looking at today, have often talked in interviews about \"Eve of Destruction\" as being a Sloan/Barri collaboration, as if to them it's common knowledge that it wasn't written alone, although Sloan's is the only name on the credits.\n\nThe song was given to a new signing to Dunhill Records, Barry McGuire. McGuire was someone who had been part of the folk scene for years, He'd been playing folk clubs in LA while also acting in a TV show from 1961. When the TV show had finished, he'd formed a duo, Barry and Barry, with Barry Kane, and they performed much the same repertoire as all the other early-sixties folkies:\n\n[Excerpt: Barry and Barry, \"If I Had a Hammer\"]\n\nAfter recording their one album, both Barrys joined the New Christy Minstrels. We've talked about the Christys before, but they were -- and are to this day -- an ultra-commercial folk group, led by Randy Sparks, with a revolving membership of usually eight or nine singers which included several other people who've come up in this podcast, like Gene Clark and Jerry Yester.\n\nMcGuire became one of the principal lead singers of the Christys, singing lead on their version of the novelty cowboy song \"Three Wheels on My Wagon\", which was later released as a single in the UK and became a perennial children's favourite (though it has a problematic attitude towards Native Americans):\n\n[Excerpt: The New Christy Minstrels, \"Three Wheels on My Wagon\"]\n\nAnd he also sang lead on their big hit \"Green Green\", which he co-wrote with Randy Sparks:\n\n[Excerpt: The New Christy Minstrels, \"Green Green\"]\n\nBut by 1965 McGuire had left the New Christy Minstrels. As he said later \"I'd sung 'Green Green' a thousand times and I didn't want to sing it again. This is January of 1965. I went back to LA to meet some producers, and I was broke. Nobody had the time of day for me. I was walking down street one time to see Dr. Strangelove and I walked by the music store, and I heard \"Green Green\" comin' out of the store, ya know, on Hollywood Boulevard. And I heard my voice, and I thought, 'I got four dollars in my pocket!' I couldn't believe it, my voice is comin' out on Hollywood Boulevard, and I'm broke. And right at that moment, a car pulls up, and the radio is playing 'Chim Chim Cherie\" also by the Minstrels. So I got my voice comin' at me in stereo, standin' on the sidewalk there, and I'm broke, and I can't get anyone to sign me!\"\n\nBut McGuire had a lot of friends who he'd met on the folk scene, some of whom were now in the new folk-rock scene that was just starting to spring up. One of them was Roger McGuinn, who told him that his band, the Byrds, were just about to put out a new single, \"Mr. Tambourine Man\", and that they were about to start a residency at Ciro's on Sunset Strip. McGuinn invited McGuire to the opening night of that residency, where a lot of other people from the scene were there to see the new group. Bob Dylan was there, as was Phil Sloan, and the actor Jack Nicholson, who was still at the time a minor bit-part player in low-budget films made by people like American International Pictures (the cinematographer on many of Nicholson's early films was Floyd Crosby, David Crosby's father, which may be why he was there).\n\nSomeone else who was there was Lou Adler, who according to McGuire recognised him instantly. According to Adler, he actually asked Terry Melcher who the long-haired dancer wearing furs was, because \"he looked like the leader of a movement\", and Melcher told him that he was the former lead singer of the New Christy Minstrels. Either way, Adler approached McGuire and asked if he was currently signed -- Dunhill Records was just starting up, and getting someone like McGuire, who had a proven ability to sing lead on hit records, would be a good start for the label.\n\nAs McGuire didn't have a contract, he was signed to Dunhill, and he was given some of Sloan's new songs to pick from, and chose \"What's Exactly the Matter With Me?\" as his single:\n\n[Excerpt: Barry McGuire, \"What's Exactly the Matter With Me?\"]\n\nMcGuire described what happened next: \"It was like, a three-hour session. We did two songs, and then the third one wasn't turning out. We only had about a half hour left in the session, so I said 'Let's do this tune', and I pulled 'Eve of Destruction' out of my pocket, and it just had Phil's words scrawled on a piece of paper, all wrinkled up. Phil worked the chords out with the musicians, who were Hal Blaine on drums and Larry Knechtel on bass.\"\n\nThere were actually more musicians than that at the session -- apparently both Knechtel and Joe Osborn were there, so I'm not entirely sure who's playing bass -- Knechtel was a keyboard player as well as a bass player, but I don't hear any keyboards on the track. And Tommy Tedesco was playing lead guitar, and Steve Barri added percussion, along with Sloan on rhythm guitar and harmonica. The chords were apparently scribbled down for the musicians on bits of greasy paper that had been used to wrap some takeaway chicken, and they got through the track in a single take. According to McGuire \"I'm reading the words off this piece of wrinkled paper, and I'm singing 'My blood's so mad, feels like coagulatin'\", that part that goes 'Ahhh you can't twist the truth', and the reason I'm going 'Ahhh' is because I lost my place on the page. People said 'Man, you really sounded frustrated when you were singing.' I was. I couldn't see the words!\"\n\n[Excerpt: Barry McGuire, \"Eve of Destruction\"]\n\nWith a few overdubs -- the female backing singers in the chorus, and possibly the kettledrums, which I've seen differing claims about, with some saying that Hal Blaine played them during the basic track and others saying that Lou Adler suggested them as an overdub, the track was complete.\n\nMcGuire wasn't happy with his vocal, and a session was scheduled for him to redo it, but then a record promoter working with Adler was DJing a birthday party for the head of programming at KFWB, the big top forty radio station in LA at the time, and he played a few acetates he'd picked up from Adler. Most went down OK with the crowd, but when he played \"Eve of Destruction\", the crowd went wild and insisted he play it three times in a row. The head of programming called Adler up and told him that \"Eve of Destruction\" was going to be put into rotation on the station from Monday, so he'd better get the record out. As McGuire was away for the weekend, Adler just released the track as it was, and what had been intended to be a B-side became Barry McGuire's first and only number one record:\n\n[Excerpt: Barry McGuire, \"Eve of Destruction\"]\n\nSloan would later claim that that song was a major reason why the twenty-sixth amendment to the US Constitution was passed six years later, because the line \"you're old enough to kill but not for votin'\" shamed Congress into changing the constitution to allow eighteen-year-olds to vote. If so, that would make \"Eve of Destruction\" arguably the single most impactful rock record in history, though Sloan is the only person I've ever seen saying that\n\nAs well as going to number one in McGuire's version, the song was also covered by the other artists who regularly performed Sloan and Barri songs, like the Turtles:\n\n[Excerpt: The Turtles, \"Eve of Destruction\"]\n\nAnd Jan and Dean, whose version on Folk & Roll used the same backing track as McGuire, but had a few lyrical changes to make it fit with Jan Berry's right-wing politics, most notably changing \"Selma, Alabama\" to \"Watts, California\", thus changing a reference to peaceful civil rights protestors being brutally attacked and murdered by white supremacist state troopers to a reference to what was seen, in the popular imaginary, as Black people rioting for no reason:\n\n[Excerpt: Jan and Dean, \"Eve of Destruction\"]\n\nAccording to Sloan, he worked on the Folk & Roll album as a favour to Berry, even though he thought Berry was being cynical and exploitative in making the record, but those changes caused a rift in their friendship. Sloan said in his autobiography \"Where I was completely wrong was in helping him capitalize on something in which he didn’t believe. Jan wanted the public to perceive him as a person who was deeply concerned and who embraced the values of the progressive politics of the day. But he wasn’t that person. That’s how I was being pulled. It was when he recorded my actual song ‘Eve Of Destruction’ and changed a number of lines to reflect his own ideals that my principles demanded that I leave Folk City and never return.\"\n\nIt's true that Sloan gave no more songs to Jan and Dean after that point -- but it's also true that the duo would record only one more album, the comedy concept album Jan and Dean Meet Batman, before Jan's accident.\n\nIncidentally, the reference to Selma, Alabama in the lyric might help people decide on which story about the writing of \"Eve of Destruction\" they think is more plausible. Remember that Lou Adler said that it was written after Adler gave Sloan a copy of Bringing it All Back Home and told him to write a bunch of knock-offs, while Sloan said it was written after a supernatural force gave him access to all the events that would happen in the world for the next sixty years. Sloan claimed the song was written in late 1964. Selma, Alabama, became national news in late February and early March 1965. Bringing it All Back Home was released in late March 1965.\n\nSo either Adler was telling the truth, or Sloan really *was* given a supernatural insight into the events of the future.\n\nNow, as it turned out, while \"Eve of Destruction\" went to number one, that would be McGuire's only hit as a solo artist. His next couple of singles would reach the very low end of the Hot One Hundred, and that would be it -- he'd release several more albums, before appearing in the Broadway musical Hair, most famous for its nude scenes, and getting a small part in the cinematic masterpiece Werewolves on Wheels:\n\n[Excerpt: Werewolves on Wheels trailer]\n\nP.F. Sloan would later tell various stories about why McGuire never had another hit. Sometimes he would say that Dunhill Records had received death threats because of \"Eve of Destruction\" and so deliberately tried to bury McGuire's career, other times he would say that Lou Adler had told him that Billboard had said they were never going to put McGuire's records on the charts no matter how well they sold, because \"Eve of Destruction\" had just been too powerful and upset the advertisers.\n\nBut of course at this time Dunhill were still trying for a follow-up to \"Eve of Destruction\", and they thought they might have one when Barry McGuire brought in a few friends of his to sing backing vocals on his second album.\n\nNow, we've covered some of the history of the Mamas and the Papas already, because they were intimately tied up with other groups like the Byrds and the Lovin' Spoonful, and with the folk scene that led to songs like \"Hey Joe\", so some of this will be more like a recap than a totally new story, but I'm going to recap those parts of the story anyway, so it's fresh in everyone's heads.\n\nJohn Phillips, Scott McKenzie, and Cass Elliot all grew up in Alexandria, Virginia, just a few miles south of Washington DC. Elliot was a few years younger than Phillips and McKenzie, and so as is the way with young men they never really noticed her, and as McKenzie later said \"She lived like a quarter of a mile from me and I never met her until New York\".\n\nWhile they didn't know who Elliot was, though, she was aware who they were, as Phillips and McKenzie sang together in a vocal group called The Smoothies. The Smoothies were a modern jazz harmony group, influenced by groups like the Modernaires, the Hi-Los, and the Four Freshmen. John Phillips later said \"We were drawn to jazz, because we were sort of beatniks, really, rather than hippies, or whatever, flower children. So we used to sing modern harmonies, like Lambert, Hendricks, and Ross. Dave Lambert did a lot of our arrangements for us as a matter of fact.\"\n\nNow, I've not seen any evidence other than Phillips' claim that Dave Lambert ever arranged for the Smoothies, but that does tell you a lot about the kind of music that they were doing. Lambert, Hendricks, and Ross were a vocalese trio whose main star was Annie Ross, who had a career worthy of an episode in itself -- she sang with Paul Whiteman, appeared in a Little Rascals film when she was seven, had an affair with Lenny Bruce, dubbed Britt Ekland's voice in The Wicker Man, played the villain's sister in Superman III, and much more. Vocalese, you'll remember, was a style of jazz vocal where a singer would take a jazz instrumental, often an improvised one, and add lyrics which they would sing, like Lambert, Hendricks, and Ross' version of \"Cloudburst\":\n\n[Excerpt: Lambert, Hendricks, and Ross, \"Cloudburst\"]\n\nWhether Dave Lambert ever really did arrange for the Smoothies or not, it's very clear that the trio had a huge influence on John Phillips' ideas about vocal arrangement, as you can hear on Mamas and Papas records like \"Once Was a Time I Thought\":\n\n[Excerpt: The Mamas and the Papas, \"Once Was a Time I Thought\"]\n\nWhile the Smoothies thought of themselves as a jazz group, when they signed to Decca they started out making the standard teen pop of the era, with songs like \"Softly\":\n\n[Excerpt, The Smoothies, \"Softly\"]\n\nWhen the folk boom started, Phillips realised that this was music that he could do easily, because the level of musicianship among the pop-folk musicians was so much lower than in the jazz world. The Smoothies made some recordings in the style of the Kingston Trio, like \"Ride Ride Ride\":\n\n[Excerpt: The Smoothies, \"Ride Ride Ride\"]\n\nThen when the Smoothies split, Phillips and McKenzie formed a trio with a banjo player, Dick Weissman, who they met through Izzy Young's Folklore Centre in Greenwich Village after Phillips asked Young to name some musicians who could make a folk record with him. Weissman was often considered the best banjo player on the scene, and was a friend of Pete Seeger's, to whom Seeger sometimes turned for banjo tips.\n\nThe trio, who called themselves the Journeymen, quickly established themselves on the folk scene. Weissman later said \"we had this interesting balance. John had all of this charisma -- they didn't know about the writing thing yet -- John had the personality, Scott had the voice, and I could play. If you think about it, all of those bands like the Kingston Trio, the Brothers Four, nobody could really *sing* and nobody could really *play*, relatively speaking.\"\n\nThis is the take that most people seemed to have about John Phillips, in any band he was ever in. Nobody thought he was a particularly good singer or instrumentalist -- he could sing on key and play adequate rhythm guitar, but nobody would actually pay money to listen to him do those things. Mark Volman of the Turtles, for example, said of him \"John wasn't the kind of guy who was going to be able to go up on stage and sing his songs as a singer-songwriter. He had to put himself in the context of a group.\"\n\nBut he was charismatic, he had presence, and he also had a great musical mind. He would surround himself with the best players and best singers he could, and then he would organise and arrange them in ways that made the most of their talents.\n\nHe would work out the arrangements, in a manner that was far more professional than the quick head arrangements that other folk groups used, and he instigated a level of professionalism in his groups that was not at all common on the scene. Phillips' friend Jim Mason talked about the first time he saw the Journeymen -- \"They were warming up backstage, and John had all of them doing vocal exercises; one thing in particular that's pretty famous called 'Seiber Syllables' -- it's a series of vocal exercises where you enunciate different vowel and consonant sounds. It had the effect of clearing your head, and it's something that really good operetta singers do.\"\n\nThe group were soon signed by Frank Werber, the manager of the Kingston Trio, who signed them as an insurance policy. Dave Guard, the Kingston Trio's banjo player, was increasingly having trouble with the other members, and Werber knew it was only a matter of time before he left the group. Werber wanted the Journeymen as a sort of farm team -- he had the idea that when Guard left, Phillips would join the Kingston Trio in his place as the third singer. Weissman would become the Trio's accompanist on banjo, and Scott McKenzie, who everyone agreed had a remarkable voice, would be spun off as a solo artist. But until that happened, they might as well make records by themselves.\n\nThe Journeymen signed to MGM records, but were dropped before they recorded anything. They instead signed to Capitol, for whom they recorded their first album:\n\n[Excerpt: The Journeymen, \"500 Miles\"]\n\nAfter recording that album, the Journeymen moved out to California, with Phillips' wife and children. But soon Phillips' marriage was to collapse, as he met and fell in love with Michelle Gilliam. Gilliam was nine years younger than him -- he was twenty-six and she was seventeen -- and she had the kind of appearance which meant that in every interview with an older heterosexual man who knew her, that man will spend half the interview talking about how attractive he found her. Phillips soon left his wife and children, but before he did, the group had a turntable hit with \"River Come Down\", the B-side to \"500 Miles\":\n\n[Excerpt: The Journeymen, \"River Come Down\"]\n\nAround the same time, Dave Guard *did* leave the Kingston Trio, but the plan to split the Journeymen never happened. Instead Phillips' friend John Stewart replaced Guard -- and this soon became a new source of income for Phillips. Both Phillips and Stewart were aspiring songwriters, and they collaborated together on several songs for the Trio, including \"Chilly Winds\":\n\n[Excerpt: The Kingston Trio, \"Chilly Winds\"]\n\nPhillips became particularly good at writing songs that sounded like they could be old traditional folk songs, sometimes taking odd lines from older songs to jump-start new ones, as in \"Oh Miss Mary\", which he and Stewart wrote after hearing someone sing the first line of a song she couldn't remember the rest of:\n\n[Excerpt: The Kingston Trio, \"Oh Miss Mary\"]\n\nPhillips and Stewart became so close that Phillips actually suggested to Stewart that he quit the Kingston Trio and replace Dick Weissman in the Journeymen. Stewart did quit the Trio -- but then the next day Phillips suggested that maybe it was a bad idea and he should stay where he was. Stewart went back to the Trio, claimed he had only pretended to quit because he wanted a pay-rise, and got his raise, so everyone ended up happy.\n\nThe Journeymen moved back to New York with Michelle in place of Phillips' first wife (and Michelle's sister Russell also coming along, as she was dating Scott McKenzie) and on New Year's Eve 1962 John and Michelle married -- so from this point on I will refer to them by their first names, because they both had the surname Phillips.\n\nThe group continued having success through 1963, including making appearances on \"Hootenanny\":\n\n[Excerpt: The Journeymen, \"Stack O'Lee (live on Hootenanny)\"]\n\nBy the time of the Journeymen's third album, though, John and Scott McKenzie were on bad terms. Weissman said \"They had been the closest of friends and now they were the worst of enemies. They talked through me like I was a medium. It got to the point where we'd be standing in the dressing room and John would say to me 'Tell Scott that his right sock doesn't match his left sock...' Things like that, when they were standing five feet away from each other.\"\n\nEventually, the group split up. Weissman was always going to be able to find employment given his banjo ability, and he was about to get married and didn't need the hassle of dealing with the other two. McKenzie was planning on a solo career -- everyone was agreed that he had the vocal ability. But John was another matter. He needed to be in a group.  And not only that, the Journeymen had bookings they needed to complete.\n\nHe quickly pulled together a group he called the New Journeymen. The core of the lineup was himself, Michelle on vocals, and banjo player Marshall Brickman. Brickman had previously been a member of a folk group called the Tarriers, who had had a revolving lineup, and had played on most of their early-sixties recordings:\n\n[Excerpt: The Tarriers, \"Quinto (My Little Pony)\"]\n\nWe've met the Tarriers before in the podcast -- they had been formed by Erik Darling, who later replaced Pete Seeger in the Weavers after Seeger's socialist principles wouldn't let him do advertising, and Alan Arkin, later to go on to be a film star, and had had hits with \"Cindy, O Cindy\", with lead vocals from Vince Martin, who would later go on to be a major performer in the Greenwich Village scene, and with \"The Banana Boat Song\". By the time Brickman had joined, though, Darling, Arkin, and Martin had all left the group to go on to bigger things, and while he played with them for several years, it was after their commercial peak.\n\nBrickman would, though, also go on to a surprising amount of success, but as a writer rather than a musician -- he had a successful collaboration with Woody Allen in the 1970s, co-writing four of Allen's most highly regarded films -- Sleeper, Annie Hall, Manhattan, and Manhattan Murder Mystery -- and with another collaborator he later co-wrote the books for the stage musicals Jersey Boys and The Addams Family.\n\nBoth John and Michelle were decent singers, and both have their admirers as vocalists -- P.F. Sloan always said that Michelle was the best singer in the group they eventually formed, and that it was her voice that gave the group its sound -- but for the most part they were not considered as particularly astonishing lead vocalists. Certainly, neither had a voice that stood out the way that Scott McKenzie's had. They needed a strong lead singer, and they found one in Denny Doherty.\n\nNow, we covered Denny Doherty's early career in the episode on the Lovin' Spoonful, because he was intimately involved in the formation of that group, so I won't go into too much detail here, but I'll give a very abbreviated version of what I said there. Doherty was a Canadian performer who had been a member of the Halifax Three with Zal Yanovsky:\n\n[Excerpt: The Halifax Three, \"When I First Came to This Land\"]\n\nAfter the Halifax Three had split up, Doherty and Yanovsky had performed as a duo for a while, before joining up with Cass Elliot and her husband Jim Hendricks, who both had previously been in the Big Three with Tim Rose:\n\n[Excerpt: Cass Elliot and the Big 3, \"The Banjo Song\"]\n\nElliot, Hendricks, Yanovsky, and Doherty had formed The Mugwumps, sometimes joined by John Sebastian, and had tried to go in more of a rock direction after seeing the Beatles on Ed Sullivan. They recorded one album together before splitting up:\n\n[Excerpt: The Mugwumps, \"Searchin'\"]\n\nPart of the reason they split up was that interpersonal relationships within the group were put under some strain -- Elliot and Hendricks split up, though they would remain friends and remain married for several years even though they were living apart, and Elliot had an unrequited crush on Doherty.\n\nBut since they'd split up, and Yanovsky and Sebastian had gone off to form the Lovin' Spoonful, that meant that Doherty was free, and he was regarded as possibly the best male lead vocalist on the circuit, so the group snapped him up. The only problem was that the Journeymen still had gigs booked that needed to be played, one of them was in just three days, and Doherty didn't know the repertoire.\n\nThis was a problem with an easy solution for people in their twenties though -- they took a huge amount of amphetamines, and stayed awake for three days straight rehearsing. They made the gig, and Doherty was now the lead singer of the New Journeymen:\n\n[Excerpt: The New Journeymen, \"The Last Thing on My Mind\"]\n\nBut the New Journeymen didn't last in that form for very long, because even before joining the group, Denny Doherty had been going in a more folk-rock direction with the Mugwumps. At the time, John Phillips thought rock and roll was kids' music, and he was far more interested in folk and jazz, but he was also very interested in making money, and he soon decided it was an idea to start listening to the Beatles.\n\nThere's some dispute as to who first played the Beatles for John in early 1965 -- some claim it was Doherty, others claim it was Cass Elliot, but everyone agrees it was after Denny Doherty had introduced Phillips to something else -- he brought round some LSD for John and Michelle, and Michelle's sister Rusty, to try. And then he told them he'd invited round a friend.\n\nMichelle Phillips later remembered, \"I remember saying to the guys \"I don't know about you guys, but this drug does nothing for me.\" At that point there was a knock on the door, and as I opened the door and saw Cass, the acid hit me *over the head*. I saw her standing there in a pleated skirt, a pink Angora sweater with great big eyelashes on and her hair in a flip. And all of a sudden I thought 'This is really *quite* a drug!' It was an image I will have securely fixed in my brain for the rest of my life. I said 'Hi, I'm Michelle. We just took some LSD-25, do you wanna join us?' And she said 'Sure...'\"\n\nRusty Gilliam's description matches this -- \"It was mind-boggling. She had on a white pleated skirt, false eyelashes. These were the kind of eyelashes that when you put them on you were supposed to trim them to an appropriate length, which she didn't, and when she blinked she looked like a cow, or those dolls you get when you're little and the eyes open and close. And we're on acid. Oh my God! It was a sight! And everything she was wearing were things that you weren't supposed to be wearing if you were heavy -- white pleated skirt, mohair sweater. You know, until she became famous, she suffered so much, and was poked fun at.\"\n\nThis gets to an important point about Elliot, and one which sadly affected everything about her life. Elliot was *very* fat -- I've seen her weight listed at about three hundred pounds, and she was only five foot five tall -- and she also didn't have the kind of face that gets thought of as conventionally attractive. Her appearance would be cruelly mocked by pretty much everyone for the rest of her life, in ways that it's genuinely hurtful to read about, and which I will avoid discussing in detail in order to avoid hurting fat listeners.\n\nBut the two *other* things that defined Elliot in the minds of those who knew her were her voice -- every single person who knew her talks about what a wonderful singer she was -- and her personality. I've read a lot of things about Cass Elliot, and I have never read a single negative word about her as a person, but have read many people going into raptures about what a charming, loving, friendly, understanding person she was.\n\nMichelle later said of her \"From the time I left Los Angeles, I hadn't had a friend, a buddy. I was married, and John and I did not hang out with women, we just hung out with men, and especially not with women my age. John was nine years older than I was. And here was a fun-loving, intelligent woman. She captivated me. I was as close to in love with Cass as I could be to any woman in my life at that point.\n\nShe also represented something to me: freedom. Everything she did was because she wanted to do it. She was completely independent and I admired her and was in awe of her. And later on, Cass would be the one to tell me not to let John run my life. And John hated her for that.\"\n\nEither Elliot had brought round Meet The Beatles, the Beatles' first Capitol album, for everyone to listen to, or Denny Doherty already had it, but either way Elliot and Doherty were by this time already Beatles fans. Michelle, being younger than the rest and not part of the folk scene until she met John, was much more interested in rock and roll than any of them, but because she'd been married to John for a couple of years and been part of his musical world she hadn't really encountered the Beatles music, though she had a vague memory that she might have heard a track or two on the radio.\n\nJohn was hesitant -- he didn't want to listen to any rock and roll, but eventually he was persuaded, and the record was put on while he was on his first acid trip:\n\n[Excerpt: The Beatles, \"I Want to Hold Your Hand\"]\n\nWithin a month, John Phillips had written thirty songs that he thought of as inspired by the Beatles. The New Journeymen were going to go rock and roll.\n\nBy this time Marshall Brickman was out of the band, and instead John, Michelle, and Denny recruited a new lead guitarist, Eric Hord. Denny started playing bass, with John on rhythm guitar, and a violinist friend of theirs, Peter Pilafian, knew a bit of drums and took on that role. The new lineup of the group used the Journeymen's credit card, which hadn't been stopped even though the Journeymen were no more, to go down to St. Thomas in the Caribbean, along with Michelle's sister, John's daughter Mackenzie (from whose name Scott McKenzie had taken his stage name, as he was born Philip Blondheim), a pet dog, and sundry band members' girlfriends. They stayed there for several months, living in tents on the beach, taking acid, and rehearsing. While they were there, Michelle and Denny started an affair which would have important ramifications for the group later.\n\nThey got a gig playing at a club called Duffy's, whose address was on Creeque Alley, and soon after they started playing there Cass Elliot travelled down as well -- she was in love with Denny, and wanted to be around him. She wasn't in the group, but she got a job working at Duffy's as a waitress, and she would often sing harmony with the group while waiting at tables. Depending on who was telling the story, either she didn't want to be in the group because she didn't want her appearance to be compared to Michelle's, or John wouldn't *let* her be in the group because she was so fat.\n\nLater a story would be made up to cover for this, saying that she hadn't been in the group at first because she couldn't sing the highest notes that were needed, until she got hit on the head with a metal pipe and discovered that it had increased her range by three notes, but that seems to be a lie.\n\nOne of the songs the New Journeymen were performing at this time was \"Mr. Tambourine Man\". They'd heard that their old friend Roger McGuinn had recorded it with his new band, but they hadn't yet heard his version, and they'd come up with their own arrangement:\n\n[Excerpt: The New Journeymen, \"Mr. Tambourine Man\"]\n\nDenny later said \"We were doing three-part harmony on 'Mr Tambourine Man', but a lot slower... like a polka or something! And I tell John, 'No John, we gotta slow it down and give it a backbeat.' Finally we get the Byrds 45 down here, and we put it on and turn it up to ten, and John says 'Oh, like that?' Well, as you can tell, it had already been done. So John goes 'Oh, ah... that's it...' a light went on. So we started doing Beatles stuff. We dropped 'Mr Tambourine Man' after hearing the Byrds version, because there was no point.\"\n\nEventually they had to leave the island -- they had completely run out of money, and were down to fifty dollars. The credit card had been cut up, and the governor of the island had a personal vendetta against them because they gave his son acid, and they were likely to get arrested if they didn't leave the island. Elliot and her then-partner had round-trip tickets, so they just left, but the rest of them were in trouble. By this point they were unwashed, they were homeless, and they'd spent their last money on stage costumes.\n\nThey got to the airport, and John Phillips tried to write a cheque for eight air fares back to the mainland, which the person at the check-in desk just laughed at. So they took their last fifty dollars and went to a casino. There Michelle played craps, and she rolled seventeen straight passes, something which should be statistically impossible. She turned their fifty dollars into six thousand dollars, which they scooped up, took to the airport, and paid for their flights out in cash.\n\nThe New Journeymen arrived back in New York, but quickly decided that they were going to try their luck in California. They rented a car, using Scott McKenzie's credit card, and drove out to LA. There they met up with Hoyt Axton, who you may remember as the son of Mae Axton, the writer of \"Heartbreak Hotel\", and as the performer who had inspired Michael Nesmith to go into folk music:\n\n[Excerpt: Hoyt Axton, \"Greenback Dollar\"]\n\nAxton knew the group, and fed them and put them up for a night, but they needed somewhere else to stay. They went to stay with one of Michelle's friends, but after one night their rented car was stolen, with all their possessions in it. They needed somewhere else to stay, so they went to ask Jim Hendricks if they could crash at his place -- and they were surprised to find that Cass Elliot was there already. Hendricks had another partner -- though he and Elliot wouldn't have their marriage annulled until 1968 and were still technically married -- but he'd happily invited her to stay with them. And now all her friends had turned up, he invited them to stay as well, taking apart the beds in his one-bedroom apartment so he could put down a load of mattresses in the space for everyone to sleep on.\n\nThe next part becomes difficult, because pretty much everyone in the LA music scene of the sixties was a liar who liked to embellish their own roles in things, so it's quite difficult to unpick what actually happened. What seems to have happened though is that first this new rock-oriented version of the New Journeymen went to see Frank Werber, on the recommendation of John Stewart. Werber was the manager of the Kingston Trio, and had also managed the Journeymen. He, however, was not interested -- not because he didn't think they had talent, but because he had experience of working with John Phillips previously. When Phillips came into his office Werber picked up a tape that he'd been given of the group, and said \"I have not had a chance to listen to this tape. I believe that you are a most talented individual, and that's why we took you on in the first place. But I also believe that you're also a drag to work with. A pain in the ass. So I'll tell you what, before whatever you have on here sways me, I'm gonna give it back to you and say that we're not interested.\"\n\nMeanwhile -- and this part of the story comes from Kim Fowley, who was never one to let the truth get in the way of him taking claim for everything, but parts of it at least are corroborated by other people -- Cass Elliot had called Fowley, and told him that her friends' new group sounded pretty good and he should sign them. Fowley was at that time working as a talent scout for a label, but according to him the label wouldn't give the group the money they wanted. So instead, Fowley got in touch with Nik Venet, who had just produced the Leaves' hit version of \"Hey Joe\" on Mira Records:\n\n[Excerpt: The Leaves, \"Hey Joe\"]\n\nFowley suggested to Venet that Venet should sign the group to Mira Records, and Fowley would sign them to a publishing contract, and they could both get rich.\n\nThe trio went to audition for Venet, and Elliot drove them over -- and Venet thought the group had a great look as a quartet. He wanted to sign them to a record contract, but only if Elliot was in the group as well. They agreed, he gave them a one hundred and fifty dollar advance, and told them to come back the next day to see his boss at Mira.\n\nBut Barry McGuire was also hanging round with Elliot and Hendricks, and decided that he wanted to have Lou Adler hear the four of them. He thought they might be useful both as backing vocalists on his second album and as a source of new songs. He got them to go and see Lou Adler, and according to McGuire Phillips didn't want Elliot to go with them, but as Elliot was the one who was friends with McGuire, Phillips worried that they'd lose the chance with Adler if she didn't.\n\nAdler was amazed, and decided to sign the group right then and there -- both Bones Howe and P.F. Sloan claimed to have been there when the group auditioned for him and have said \"if you won't sign them, I will\", though exactly what Sloan would have signed them to I'm not sure. Adler paid them three thousand dollars in cash and told them not to bother with Nik Venet, so they just didn't turn up for the Mira Records audition the next day. Instead, they went into the studio with McGuire and cut backing vocals on about half of his new album:\n\n[Excerpt: Barry McGuire with the Mamas and the Papas, \"Hide Your Love Away\"]\n\nWhile the group were excellent vocalists, there were two main reasons that Adler wanted to sign them. The first was that he found Michelle Phillips extremely attractive, and the second is a song that John and Michelle had written which he thought might be very suitable for McGuire's album.\n\nMost people who knew John Phillips think of \"California Dreamin'\" as a solo composition, and he would later claim that he gave Michelle fifty percent just for transcribing his lyric, saying he got inspired in the middle of the night, woke her up, and got her to write the song down as he came up with it. But Michelle, who is a credited co-writer on the song, has been very insistent that she wrote the lyrics to the second verse, and that it's about her own real experiences, saying that she would often go into churches and light candles even though she was \"at best an agnostic, and possibly an atheist\" in her words, and this would annoy John, who had also been raised Catholic, but who had become aggressively opposed to expressions of religion, rather than still having nostalgia for the aesthetics of the church as Michelle did.\n\nThey were out walking on a particularly cold winter's day in 1963, and Michelle wanted to go into St Patrick's Cathedral and John very much did not want to. A couple of nights later, John woke her up, having written the first verse of the song, starting \"All the leaves are brown and the sky is grey/I went for a walk on a winter's day\", and insisting she collaborate with him. She liked the song, and came up with the lines \"Stopped into a church, I passed along the way/I got down on my knees and I pretend to pray/The preacher likes the cold, he knows I'm going to stay\", which John would later apparently dislike, but which stayed in the song.\n\nMost sources I've seen for the recording of \"California Dreamin'\" say that the lineup of musicians was the standard set of players who had played on McGuire's other records, with the addition of John Phillips on twelve-string guitar -- P.F. Sloan on guitar and harmonica, Joe Osborn on bass, Larry Knechtel on keyboards, and Hal Blaine on drums, but for some reason Stephen McParland's book on Sloan has Bones Howe down as playing drums on the track while engineering -- a detail so weird, and from such a respectable researcher, that I have to wonder if it might be true.\n\nIn his autobiography, Sloan claims to have rewritten the chord sequence to \"California Dreamin'\". He says \"Barry Mann had unintentionally showed me a suspended chord back at Screen Gems. I was so impressed by this beautiful, simple chord that I called Brian Wilson and played it for him over the phone. The next thing I knew, Brian had written ‘Don’t Worry Baby,’ which had within it a number suspended chords. And then the chord heard ’round the world, two months later, was the opening suspended chord of ‘A Hard Day’s Night.’\n\nI used these chords throughout ‘California Dreamin’,’ and more specifically as a bridge to get back and forth from the verse to the chorus.\"\n\nNow, nobody else corroborates this story, and both Brian Wilson and John Phillips had the kind of background in modern harmony that means they would have been very aware of suspended chords before either ever encountered Sloan, but I thought I should mention it.\n\nRather more plausible is Sloan's other claim, that he came up with the intro to the song. According to Sloan, he was inspired by \"Walk Don't Run\" by the Ventures:\n\n[Excerpt: The Ventures, \"Walk Don't Run\"]\n\nAnd you can easily see how this:\n\n[plays \"Walk Don't Run\"]\n\nCan lead to this:\n\n[plays \"California Dreamin'\"]\n\nAnd I'm fairly certain that if that was the inspiration, it was Sloan who was the one who thought it up. John Phillips had been paying no attention to the world of surf music when \"Walk Don't Run\" had been a hit -- that had been at the point when he was very firmly in the folk world, while Sloan of course had been recording \"Tell 'Em I'm Surfin'\", and it had been his job to know surf music intimately.\n\nSo Sloan's intro became the start of what was intended to be Barry McGuire's next single:\n\n[Excerpt: Barry McGuire, \"California Dreamin'\"]\n\nSloan also provided the harmonica solo on the track:\n\n[Excerpt: Barry McGuire, \"California Dreamin'\"]\n\nThe Mamas and the Papas -- the new name that was now given to the former New Journeymen, now they were a quartet -- were also signed to Dunhill as an act on their own, and recorded their own first single, \"Go Where You Wanna Go\", a song apparently written by John about Michelle, in late 1963, after she had briefly left him to have an affair with Russ Titelman, the record producer and songwriter, before coming back to him:\n\n[Excerpt: The Mamas and the Papas, \"Go Where You Wanna Go\"]\n\nBut while that was put out, they quickly decided to scrap it and go with another song. The \"Go Where You Wanna Go\" single was pulled after only selling a handful of copies, though its commercial potential was later proved when in 1967 a new vocal group, the 5th Dimension, released a soundalike version as their second single. The track was produced by Lou Adler's client Johnny Rivers, and used the exact same musicians as the Mamas and the Papas version, with the exception of Phillips. It became their first hit, reaching number sixteen on the charts:\n\n[Excerpt: The 5th Dimension, \"Go Where You Wanna Go\"]\n\nThe reason the Mamas and the Papas version of \"Go Where You Wanna Go\" was pulled was because everyone became convinced that their first single should instead be their own version of \"California Dreamin'\". This is the exact same track as McGuire's track, with just two changes. The first is that McGuire's lead vocal was replaced with Denny Doherty:\n\n[Excerpt: The Mamas and the Papas, \"California Dreamin'\"]\n\nThough if you listen to the stereo mix of the song and isolate the left channel, you can hear McGuire singing the lead on the first line, and occasional leakage from him elsewhere on the backing vocal track:\n\n[Excerpt: The Mamas and the Papas, \"California Dreamin'\"]\n\nThe other change made was to replace Sloan's harmonica solo with an alto flute solo by Bud Shank, a jazz musician who we heard about in the episode on \"Light My Fire\", when he collaborated with Ravi Shankar on \"Improvisations on the Theme  From Pather Panchali\":\n\n[Excerpt: Ravi Shankar, \"Improvisation on the Theme From Pather Panchali\"]\n\nShank was working on another session in Western Studios, where they were recording the Mamas and Papas track, and Bones Howe approached him while he was packing his instrument and asked if he'd be interested in doing another session. Shank agreed, though the track caused problems for him.\n\nAccording to Shank \"What had happened was that when they had made the original backing track, they had apparently not lined it up with anything with firm pitch; it was only guitars, and it was in the cracks -- really in the cracks. I listened to the song enough to learn it, then I pulled the head joint out of my alto flute about an inch, and played it up half a step, and somehow or other we lined it up, pitch-wise. It  sounded kinda strange, and it really blew my mind, but that was because my fingers were going in spots where they normally wouldn't go.\"\n\nAccording to Lou Adler, the flute solo is spliced together from two takes, at the point where the solo goes up an octave:\n\n[Excerpt: The Mamas and the Papas, \"California Dreamin'\"]\n\n\"California Dreamin'\" made the charts in January 1966, and eventually reached number four, but even though it didn't make number one it stayed on the charts so long that Cashbox magazine later listed it as the biggest hit of 1966. The follow-up, \"Monday Monday\", written by John Phillips alone, did reach number one:\n\n[Excerpt: The Mamas and the Papas, \"Monday Monday\"]\n\nThat also won the group a Grammy for Best Pop Performance by a Duo or Group with Vocal. It was also nominated for the Best Contemporary (Rock & Roll) Recording Grammy, but lost out there, as did the other nominees \"Last Train to Clarksville\", \"Good Vibrations\", \"Eleanor Rigby\", and \"Cherish\", to \"Winchester Cathedral\".\n\nThe group's first album, from which both those singles were taken, is generally considered the one on which John Phillips' reputation as a songwriter rests. Mark Volman of the Turtles said \"John was a really good songwriter who really hit his peak with one album. I mean, he wasn't like John Sebastian who wrote and wrote and was a working-class songwriter. John Phillips hit his stride one album. If you listen to that first album, If You Can Believe Your Eyes And Ears, it was John's one contribution. If you go to the next album, those songs were not as great. There were sporadic moments of good songwriting, but John Phillips' contribution to the landscape of musical history was on that one album\"\n\nEven there, only seven songs on the album were originals, with the other five being cover versions or, in the case of their version of \"You Baby\", a hit for the Turtles, they used a track that Sloan and Barri had recorded as a demo, onto which the group overdubbed new vocals.\n\nDuring the recording of the first album, the group were all living together, and getting on great. They made occasional live appearances -- their first performance as the Mamas and the Papas was a rather impromptu one at The Action, where the Mothers of Invention were the house band, and the Mamas and the Papas got up between their sets to do a performance with just the four voices and a twelve-string guitar, to a certain amount of confusion on the part of the audience. But for the most part they were just rehearsing and recording, and they got on great.\n\nBut that wasn't to last. There's an anecdote from Guy Webster, who photographed the group's first album cover: He said \"I said \"This'll probably be the last time where we get together like this where you'll want to shoot the cover...\" and they said \"What are you talking about? That's ridiculous!\" and I told them that it's just the nature of the business that little petty things come in and out of relationships in groups that are together, and after a while they don't even want to see you. I had photographed the Stones, and Brian Jones, who was a friend of mine, was kind of on the outs with the group, and nobody wanted to pose together. I'm telling this to the Mamas and the Papas, and they're like \"Yeah, right.\" Well, the next session, it was almost impossible to get the four of 'em together. That's how *fast* the insidiousness of the business started to splinter the group.\"\n\nThe thing that really caused problems, though, was when John found out about Michelle and Denny's relationship, which ended as soon as John found out. John was hurt because his wife had been having an affair, and Denny was hurt because the affair had ended, although both men took what one might call a \"Papas before Mamas\" approach and decided that it was Michelle's fault for being a temptress. Michelle moved out, but John and Denny stayed living together, bonding more closely over their shared blaming of the woman they both loved. Meanwhile Cass Elliot was hurt -- she was in love with Denny, and while that love was unrequited, Cass thought that Michelle could have literally any man she wanted, so why go for the man Cass was in love with?\n\nDoherty and John Phillips wrote \"I Saw Her Again\" about the affair, and it became the group's third single -- though Michelle always said that it was immensely cruel that they'd made her sing on the song:\n\n[Excerpt: The Mamas and the Papas, \"I Saw Her Again\"]\n\n\"I Saw Her Again\" is notable for one other reason as well. At one point, Denny Doherty came in at the wrong place, caught himself, and then came in at the right spot. Originally Bones Howe was going to edit out the mistake, but Lou Adler said to leave it in:\n\n[Excerpt: The Mamas and the Papas, \"I Saw Her Again\"]\n\nFor a while the group continued working together even though everything was strained, but while John and Michelle were split up, Michelle started having an affair with Gene Clark, formerly of the Byrds, who apparently later wrote \"Tried So Hard\" about their breakup:\n\n[Excerpt: Gene Clark, \"Tried So Hard\"]\n\nClark came to see one of the group's shows, which happened to be on Michelle's twenty-second birthday, June the fourth 1966, and sat in the front row, and Michelle sang at him the entire show. That was the last straw for John Phillips, who persuaded the rest of the group that they needed to sack Michelle. They sent her a letter reading:\n\n\"Dear Michelle,\n\nThis letter is to inform you that the undersigned no longer desire to record or perform with you in the future. Moreover, the undersigned desire to terminate any business relationship with you that may have heretofore existed. To the extent there may have been any agreement between us creating a partnership, the undersigned elect to terminate and dissolve any such partnership pursuant to California Corporation Code Section 15031(1)(b). This letter should not be construed as an admission that any such partnership exists.\n\nNothing contained in this letter should be construed as a waiver, abandonment, or relinquishment of any right or remedy which the undersigned, and each of them, may have against you. All such rights and remedies are expressly reserved.\n\nVery truly yours.\"\n\nMichelle was devastated, since this was basically her being cut out of the lives of everyone important to her. As she put it in her autobiography, \"since it was from the Mamas and the Papas, it was therefore from my husband, from my best friend, from my lover, from my manager, my label, and my attorney\". On her twenty-second birthday her entire emotional and professional support system had been taken away from her.\n\nAs a replacement, they got in Jill Gibson. Gibson had been Jan Berry's girlfriend, though they'd split up shortly before Jan's accident, and she'd had a bit of a recording career as a result of the connection -- we heard her earlier on \"Move On, Little Mustang\", and she also cowrote \"It's as Easy as 1,2,3\" with Don Altfeld, which was released as a Jan and Dean B-side but had Gibson singing lead:\n\n[Excerpt: Jan and Dean, \"It's As Easy as 1,2,3\"]\n\nGibson also looked quite like Michelle -- they had different jawlines, but there was a passing resemblance, especially from the distances concert audiences saw performers -- and she was dating Lou Adler. She could sing, she knew the material, and she was in.\n\nWork had already started on the second Mamas and Papas album, but Jill replaced Michelle's vocals on some, but not all, of the tracks. They'd even already taken a cover photo, so Guy Webster was called in to take a photo of Jill in exactly the same pose Michelle had been in, and paste her into the photo in Michelle's place.\n\nJill was in the group for three months, but while she was told it was a permanent position, almost from the start there seems to have been talk of getting Michelle back. John and Michelle had almost daily phone calls, which according to Michelle basically amounted to John saying that he wanted her back as his wife but he could no longer work with her, and her saying that she wanted to be back in the group but wasn't interested in getting back together with him.\n\nBut something was missing from the band's sound. Jill was a good singer -- by some accounts a better singer than Michelle -- but Michelle had a harsher, brassier, sound which contrasted well with Elliot and Doherty's voices. Michelle was the youngest of the group members, and the one who more than any of them was interested in rock and roll, and Lou Adler said of her \"I think she would have loved to have been a Ronette or one of the Shangri-Las\". Without that slight abrasive quality, the harmonies were missing something.\n\nEventually they reconciled, at least for a while, and Michelle was back in the marriage and the group, with Jill being given an undisclosed large sum of money as a payoff. Michelle then replaced some of Jill's vocals on the album, some of which had in turn been replacements for Michelle, and nobody is sure any more which songs have Michelle, which have Jill, which have both, and which have Cass Elliot overdubbing herself instead of either of them, though it's almost certain Jill is on about six of the twelve tracks, including \"Trip, Stumble, and Fall\", which John and Michelle had written together:\n\n[Excerpt: The Mamas and the Papas, \"Trip, Stumble, and Fall\"]\n\nAs well as the problems between John and Michelle, there were other problems starting with the second album. For the first album, the group had been living together for months beforehand and spending all their time together, so they knew the material -- and the material had been written around the group members' individual voices and shaped with them. Now the only time they saw each other was in the recording studio or on tour, and so they no longer had the chemistry they used  to, and nor did they have the familiarity with the material.\n\nEveryone was developing their own problems as well. Both John Phillips and Cass Elliot were heavy drug users, while Denny Doherty was becoming an alcoholic, and everyone talks about how they had to arrange sessions so that Doherty's vocals would be recorded during the window of time between him having drunk enough to loosen up and having drunk so much that he couldn't sing.\n\nAlso, John Phillips' stock of material had run dry, and they were so desperate for new material that when they were asked to guest on a TV show celebrating the songs of Rodgers and Hart they ended up using a song they recorded for the show on the album. Not only that, but they took another song from the show, \"Here in My Arms\":\n\n[Excerpt: The Mamas and the Papas, \"Here in My Arms\"]\n\nAnd turned it into an \"original\", \"No Salt on Her Tail\" -- John Phillips wrote new lyrics and melody to the existing track. To make the borrowing not quite so obvious, they got in organist Ray Manzarek, whose band The Doors were still unsigned at the time, to overdub a keyboard part:\n\n[Excerpt: The Mamas and the Papas, \"No Salt on Her Tail\"]\n\nAccording to Manzarek, Adler tried to just pay him twenty dollars for the session. Adler's response was \"I have no recollection of that. Boy, I doubt it. I have no memory of that. He remembers a lot of things about me.\"\n\nBut the lack of material wasn't too much of a problem. As Doherty would later say \"at that point, the momentum we'd created carried a lot of it. If we got one hit from each album, that was enough. One good single sold the album, and it didn't matter about the album cuts or whatever else was on the album.\"\n\nBut there were other problems happening too as the group moved into recording their third album. Cass Elliot was becoming increasingly distant from the rest of the group -- she got pregnant and wouldn't even tell the rest of them who the father was -- and she was constantly butting heads with John Phillips. Phillips thought of himself as the group's leader, and in his mind by being able to fire and rehire his own wife he had proved his dominance over the group. Michelle had been put firmly in her place by this and wasn't making waves, and Doherty was a naturally placid person. But while Elliot was hard-working, she insisted on knowing *why* certain things were being done -- she wouldn't take direction from Phillips without understanding his reasoning.\n\nAnd Phillips was becoming increasingly unwilling to accommodate that kind of thing. Between the problems in his marriage, his writer's block, and his worsening drug problems, he was becoming aggressive towards anyone he viewed as a challenge, even the musicians who'd been helping him make his hit records. Where previously he would ask P.F. Sloan to come up with his own guitar parts, now he was dictating them and shouting at Sloan when he suggested an idea. He would also sometimes add or drop bars during the recording, without realising he was doing so, and then scream at Hal Blaine for \"doing it wrong\" when Blaine played the part as written -- at one point Blaine actually almost came to blows with him, the only time in forty years as a studio musician that he came close to attacking an artist.\n\nThe third album, then, was stressful for everyone, though perhaps not as stressful as some of the stories about the group would later claim. Pretty much everyone involved would say that Cass Elliot was recording her parts for the album even up to the day she went into labour, but in fact her daughter wasn't born until two months after the record came out, though that's not to minimise how hard she had to work, being pregnant while making the album. And there are other stories about having to mic Denny Doherty up while he was lying flat on his back on top of a piano, too drunk to stand up, to get vocal takes.\n\nBut the album, the Mamas and the Papas Deliver, did produce two big hits. One was a song suggested by Michelle -- when the group had been looking for cover versions, she'd kept suggesting hits from her teenage years which the rest of the group didn't know, like \"I'm a Hog For You Baby\" by the Coasters, \"He's a Rebel\", and \"Will You Love Me Tomorrow?\"\n\nEventually she hit on a song which had been a hit in 1962 for the Shirelles:\n\n[Excerpt: The Shirelles, \"Dedicated to the One I Love\"]\n\nJohn came up with an arrangement of that, and it made number two on the charts, becoming the fifth of the group's six top five singles, and the only one with a lead from Michelle:\n\n[Excerpt: The Mamas and the Papas, \"Dedicated to the One I Love\"]\n\nThe sixth and final top five hit for the group, also on that album, was a song John and Michelle had written to explain the group's history to Lou Adler. The group had constantly been talking about all the folk-rock stars they'd known and been in bands with before any of them were successful, and \"Creeque Alley\" told the whole story:\n\n[Excerpt: The Mamas and the Papas, \"Creeque Alley\"]\n\nAfter the release of The Mamas and the Papas Deliver, John and Michelle took on a new project, one which would end up being one of the most important things they would ever do.\n\nJim Dickson, the manager of the Byrds, was in the process of splitting away from the band, but he had recently organised a rather big benefit concert featuring Hugh Masakela, the South African jazz trumpeter who had recently guested on the Byrds' single \"So You Want To Be A Rock 'n' Roll Star\":\n\n[Excerpt: The Byrds, \"So You Want to Be a Rock 'n' Roll Star\"]\n\nMasakela had enjoyed the benefit show, and had suggested to Dickson and his co-promoter Alan Pariser that they might want to put on another similar show. Masakela's initial idea was to do it in Mexico, but Dickson thought about the likely audience -- mostly American hippies -- and what would happen to several thousand long-haired drug users at the border between the two countries, and decided to do it closer to home. They decided that Monterey might be an option -- Monterey is a town in central California, about eighty miles south of San Francisco and about three hundred miles north of LA, and it already had an established and long-running annual jazz festival and a more recently established folk festival. Why not a pop festival? At least, that's the way Dickson told the story – the way Steve Stills would always tell the story, it had all been Stills' idea, and he'd suggested the whole thing, including the location, to Pariser.\n\nThey got in touch with Benny Shapiro, who ran the Monterey Folk Festival, to get some advice as to how to put something like that on in Monterey, and through him they booked the first act other than Masakela -- Shapiro was Ravi Shankar's West Coast promoter, and offered them Shankar's services for three thousand dollars. Shankar was at the time probably the single most admired musician among the hip crowd of musicians, and with him on board, they could get anyone they wanted.\n\nThe next people they asked were the Mamas and the Papas, and at that point everything changed. John Phillips and Lou Adler both fell *heavily* in love with the idea of doing a *big* pop festival, the first one devoted to pop music rather than jazz or folk. As it happened, it took so long to set up that Monterey would end up being the second pop festival, as the Fantasy Fair and Magic Mountain Music Festival near San Francisco happened just the week before, with several of the same acts. But Monterey, which took place over the weekend between the first two Beatles recording sessions for \"All You Need is Love\", became the model which all future rock and pop festivals would follow, and gets regarded by most as the start of the \"Summer of Love\".\n\nPhillips and Adler had a vision, and they quickly bought out the original promoters and took on the work themselves. They were going to make it a charity benefit, so none of the musicians would get paid for their appearances or for the film and live album they planned of the festival. Except Ravi Shankar, whose contract had already been signed, and who said that he wasn't going to work for free. But nobody *else* would be paid.\n\nJohn, Michelle, and Adler did most of the organisational work for the festival, with some help from Al Kooper and Derek Taylor, but they pulled together an advisory board of their friends in the music industry including Elliot, Lennon and McCartney, Andrew Oldham, Simon and Garfunkel, and Brian Wilson. Those people mostly did very little, with one exception we'll get to in a minute, but they all pitched in money to help pay for the festival's costs, and they also made suggestions of which artists to include. The Beatles and Oldham suggested the hot names from the British scene -- Eric Burdon and his New Animals, the Jimi Hendrix Experience, and the Who, the latter two of whom had not yet had any real success in the US -- and also suggested that Otis Redding, Lou Rawls, and Booker T and the MGs be included on the bill.\n\nMeanwhile the LA contingent were getting their own friends involved, and so as well as the Mamas and the Papas, the Beach Boys were booked to headline (though they pulled out for reasons we'll discuss in episode 153), and the Byrds and Buffalo Springfield were on the bill, as was the Dunhill act Johnny Rivers.\n\nBut if they were going to hold a festival near San Francisco, they also needed to get some of the local San Francisco bands on the bill. A huge music scene had sprung up there almost overnight, which we're going to look at in future episodes, and they would have to acknowledge that in some way.\n\nBut there was a problem. That scene had set itself up very consciously in opposition to the music coming out of LA, which was against everything they stood for -- it was Hollywood and plastic and commercial and made by big corporations. The San Francisco groups wouldn't even speak to any of the LA groups.\n\nSo Paul Simon was enlisted as an ambassador. He was neutral in the war between Northern and Southern California, as he was from New York, so he made the fraught trip into enemy territory, visiting the Grateful Dead in San Francisco, and coming back with their list of demands. The Grateful Dead, if they were going to do the show, wanted a day basically put aside for the San Francisco scene -- they wanted Big Brother and the Holding Company, Country Joe and the Fish, Quicksilver Messenger Service, and Jefferson Airplane all on, and all on the same day.\n\nAs it eventually worked out, all those acts did play, and all on the same day, but the Grateful Dead actually played the day after their San Francisco peers. But an agreement had been reached. And John Phillips had come up with a theme song for the event.\n\nAfter Scott McKenzie had left the Journeymen, his career had floundered. He had tried for a solo career, and had signed to Capitol records and recorded two singles for them, but tracks like his version of the old Webb Pierce country hit \"There Stands the Glass\" had not exactly set the world on fire:\n\n[Excerpt: Scott McKenzie, \"There Stands the Glass\"]\n\nCapitol had dropped him, and then he'd signed with Epic records, and John Phillips had written \"No, No, No, No\" for him, which Adler had produced:\n\n[Excerpt: Scott McKenzie, \"No, No, No, No\"]\n\nBy 1967 McKenzie was despondent. He was staying with the Phillipses in their house, and one day Paul McCartney had come to visit. McKenzie had given McCartney and Mal Evans a lift to the airport, and McCartney had asked him what he did for a living. McKenzie said he was a singer, and McCartney asked what kind of things he sang... and McKenzie realised he didn't know what kind of things he sang. John Phillips told him they would have to find something for him to sing, so then he would know.\n\nBy this point, Lou Adler had sold his shares in Dunhill to his business partners, and had started up a new label, Ode, with McKenzie as his first signing. He got John Phillips to write a song for McKenzie to sing, and John decided to make the song a message to anyone who was going to be travelling to the festival, to tell them that they should be cool and relaxed and not cause problems for anyone. The recording was arranged hastily and in secret -- they thought that Cass and Denny might complain about Phillips giving hits away to other artists, and they also worried that Adler's erstwhile partners might cause problems for John writing a song for anyone not on Dunhill. The song was released as a single a month before the festival, and became a worldwide hit, going top five in the USA and making number one in the UK:\n\n[Excerpt: Scott McKenzie, \"San Francisco (Wear Flowers in Your Hair)\"]\n\nThe Monterey International Pop Festival is something we're going to be coming back to time and again in the next few months, which is why I placed this episode at this point in the narrative, at the start of a new year of stories. In many ways it is *the* pivotal moment in the transition between pop and rock music. It was referred to as a pop festival, and at this point \"rock and roll\" was not a term that most successful bands would have used for themselves -- rock and roll either meant music from the fifties like Elvis and Gene Vincent, or it meant girl groups and soul singers -- the Supremes were a rock and roll group. Bands like the Beatles or the Rolling Stones would never have referred to themselves as rock bands at this point -- they were pop groups or R&B bands, not rock bands.\n\nBut Monterey was where that started to change, and it was where the narrative of what artists mattered to the hippie generation was really set. And in the war for the minds of the hippie generation, San Francisco beat LA so completely that it distorted the whole of rock history for decades, something that wasn't helped with the dawn of rock journalism happening around the same time and being dominated by the San Francisco partisans at Rolling Stone.\n\nThis even though right up until the last minute it was entirely possible that none of the San Francisco bands would even play. Many of them were being managed by Bob Dylan's manager Albert Grossman, who was well known for his extreme approach to management and brinksmanship, and he was attempting to renegotiate some of the contracts even as bands were going on stage.\n\nWe're going to look at many of these performances in greater detail in future, as we deal with many of these bands and artists in their own episodes, but the San Francisco bands were young and hungry and playing to the biggest audiences they'd ever played to, and so bands like Jefferson Airplane gave tight, convincing performances:\n\n[Excerpt: Jefferson Airplane, \"Somebody to Love\"]\n\nWhile the unknown band Big Brother and the Holding Company, with their lead singer Janis Joplin, became many people's highlight of the show with their version of Big Mama Thornton's \"Ball and Chain\":\n\n[Excerpt: Big Brother and the Holding Company, \"Ball and Chain\"]\n\nWhile the San Francisco bands blew everyone away, LA was much, much, less well represented. The Beach Boys had dropped out, and they'd decided not to invite the Monkees, even though they were the biggest band in the world at that point, because even the “LA plastic Hollywood types” thought they were above that kind of thing -- though both Micky Dolenz and Peter Tork came along anyway, and Tork introduced his friends The Buffalo Springfield. So the two most commercial acts from LA at the time weren't there.\n\nAs for the up-and-coming acts, Love were invited but Arthur Lee wouldn't travel out of LA, the Mothers of Invention were playing a month-long residency in New York on the other side of the continent, and Captain Beefheart and the Magic Band had to pull out shortly before the event after their guitarist, Ry Cooder, quit.  And I've seen multiple explanations for why the Doors weren't going to be playing, with some of the band members, notably Manzarek, saying it was because Lou Adler resented them for becoming successful after he'd turned them down, but other explanations I've seen include that the band were dealing with various small life emergencies like minor surgery and family members having kids, and that they were booked to play in New York\n\nSo that left the established but not absolute top-tier LA acts. The Association, who opened the whole festival, actually gave one of the tightest performances of the weekend:\n\n[Excerpt: The Association, \"Along Comes Mary (live at Monterey Pop)\"]\n\nUnfortunately, while they did a great set musically, they looked out of place. They had the same kind of suits, haircuts, and stage formation as the Beatles or Stones had in 1965. In June 1967 a band looking like that might as well have been from the Medieval era, and their performance wasn't even used in the film of the event.\n\nJohnny Rivers was wildly out of place with his set of fifties covers, and Buffalo Springfield were missing their guitarist, Neil Young. David Crosby sat in with them in his place, and while they managed just about to get through the set, they generally considered it an embarrassment:\n\n[Excerpt: Buffalo Springfield, \"Nowadays Clancy Can't Even Sing (live at Monterey)\"]\n\n71) And Crosby also dominated the Byrds' set, where they refused to play any of their old hits, and instead did a set that sounds almost garage-punk:\n\n[Excerpt: The Byrds, \"Hey Joe (live at Monterey)\"]\n\n72) Even though it had been organised entirely by LA people, the Monterey International Pop Festival seemed almost specifically designed to prove the San Francisco musicians right. On the evidence of that weekend, the LA groups were a bunch of posers who couldn't really play and relied on clever record production to make themselves seem half-decent, and that's largely how the LA scene went down in the first drafts of rock history as a result.\n\nBut the real highlights of the festival weren't from either of the warring Californian scenes. Rather they were the acts that had been suggested by the Beatles and Oldham. Otis Redding's performance was the set that brought him to the attention of the white rock audience, who had previously been largely unaware of how astonishing he was:\n\n[Excerpt: Otis Redding, \"Respect\"]\n\nAnd while the Grateful Dead had been seen as the one band that they *must* get, half the oral histories of the event literally forget that they were there, because they were on between the two biggest breakout stars of the show. At this point, while the Who were in the very top tier of bands in the UK, with seven top ten hits, and were regarded by their peers as the most exciting live act around, they'd only had one top thirty hit in the US, with their most recent single, \"Happy Jack\", which was not regarded as their best work and which had only got to number twenty-four:\n\n[Excerpt: The Who, \"Happy Jack\"]\n\nThe Who's show was devastating, with a psychedelic light show, Keith Moon setting off smoke bombs, and at the end of the set Pete Townshend smashing his guitar to pieces while Moon smashed his drumkit up -- as technicians busily ran around the stage trying to limit the damage being done to the festival's equipment. But as well as the pyrotechnics there was also actual musical quality to their performance:\n\n[Excerpt: The Who, \"My Generation (live at Monterey)\"]\n\nAfter that, the Who went on a fifty-five date US tour as the support act to Herman's Hermits. The other breakout Monterey act, the Jimi Hendrix Experience, also toured on a similarly incongruous bill after Micky Dolenz saw them at the festival and invited them to be the Monkees' support act. The Grateful Dead, stuck between those two powerhouse live acts, gave what they would later claim was one of their worst performances:\n\n[Excerpt: Jerry Garcia talking about Monterey ]\n\nThough the one song from their performance that was filmed, a version of \"Viola Lee Blues\" that's in the special features of the Critierion Blu-Ray edition of the film of the festival, is perfectly fine, if hardly life-changing:\n\n[Excerpt: The Grateful Dead, \"Viola Lee Blues (live at Monterey)\"]\n\nAnd then the Jimi Hendrix Experience came on, and Hendrix was determined to overshadow the Who. Hendrix had had three top ten hit singles in the UK in the previous six months, but had not yet charted in the US -- a double-A-side version of \"Purple Haze\" and \"The Wind Cries Mary\" was released the same weekend as the festival, presumably in the hopes of capitalising on any publicity from it, but it only reached the heady heights of number sixty-seven in the charts. But the group's performance at Monterey was one that nobody would ever forget. It had already been set up by David Crosby the day before, when he'd introduced the Byrds' version of \"Hey Joe\" by talking about Love, the Leaves, Tim Rose, and \"a cat who's gonna perform here, Jimi Hendrix\".\n\nHendrix was still so new to songwriting that half the Experience's set was cover versions, including of course their own version of \"Hey Joe\":\n\n[Excerpt: The Jimi Hendrix Experience, \"Hey Joe (live at Monterey)\"]\n\nAnd the closing song, a version of \"Wild Thing\":\n\n[Excerpt: The Jimi Hendrix Experience, \"Wild Thing (live at Monterey)\"]\n\nHendrix first played the song, then while the other musicians continued playing he humped his guitar, and then for a finale and a way to one-up Townshend smashing his guitar took a can of lighter fluid, held it out at approximately penis height, squirted the fluid all over his guitar, then set it on fire before smashing it. The sound you hear here is the sound of the crackling flames being picked up by the guitar's pickups and feeding back through the amps:\n\n[Excerpt: The Jimi Hendrix Experience, \"Wild Thing (live at Monterey)\"]\n\nWatching the footage of that performance, large chunks of the audience don't seem to know what's going on, but Michelle Phillips, Cass Elliot, and Micky Dolenz all seem to be in states of utter ecstasy watching him. One person who wasn't so ecstatic was Ravi Shankar. He'd thought Simon and Garfunkel were extremely good on the first night, and he'd been very impressed by both Otis Redding and Janis Joplin, who he thought \"sang from her guts, like some of the olden-days jazz singers\". But to a man to whom music was holy, smashing a musical instrument was sacrilege.\n\nAnd after Hendrix came the closing performance of the show, and what was meant to be the highlight for everyone who had organised it -- the Mamas and the Papas, with Scott McKenzie guesting to sing \"San Francisco\".\n\nBut there was a problem. The group hadn't rehearsed together in months. John and Michelle had been busy organising the festival, Cass had been busy with her newborn baby, and Denny had been so depressed that John and Michelle had got back together that he'd basically spent three months inside a bottle, drunk out of his mind and not even really registering that he was meant to be performing at the festival until the final day, when he flew into LA from the Virgin Islands, where he'd been for those three months. He also didn't have any coherent idea of the geography of California, despite having lived there for a couple of years, and vaguely thought that Monterey was \"just down the coast from Santa Barbara\" and was horrified to be told by his friend that it would be an eight-hour drive and they would have to leave *right then*.\n\nDepending on which version of the story you believe, he either arrived *right* before the group were due on stage or just before Hendrix's set -- either way, there was no time for even a cursory rehearsal before the group went on stage, with Joe Osborn, Larry Knechtel, touring guitarist Eric Horn, and their touring drummer \"Fast\" Eddie Hoh, and performed what was meant to be the great climax of the festival, but instead turned out to be the great anticlimax of it, and of the Mamas and the Papas' career. To quote from John Phillips' autobiography:\n\n\"We ran out on stage and did our songs completely out of tune from start to finish. In parts, we weren't even close. We hadn't sung in months. We hadn't rehearsed at Monterey because Denny wasn't around. Cass had been partying all weekend. Mitch and I were too busy at the site to worry about harmonies and arrangements. I was fried on speed. I had been up for most of the past week.\"\n\nEveryone agrees that the performance was possibly the worst the group ever gave, and they were the worst act on the festival, though listening to the recordings it doesn't sound *that* much more incompetent than many of the other performers, though there are some excruciatingly poor harmonies at points:\n\n[Excerpt: The Mamas and the Papas, \"Monday Monday (live at Monterey)\"]\n\nAs for Scott McKenzie, as John Phillips put it \"He was so off and out of it that he sang in a chord sequence that was the reverse of what the band were playing\":\n\n[Excerpt: Scott McKenzie and the Mamas and the Papas, \"San Francisco (live at Monterey)\"]\n\nThough I have to say that to my ears, the problem sounds more with the twelve-string guitar player, one John Phillips, than with McKenzie's singing.\n\nMonterey was essentially the end of the careers of both McKenzie and the Mamas and the Papas. McKenzie's follow-up single, \"Like an Old-Time Movie\", written by John Phillips, only made number twenty-four:\n\n[Excerpt: Scott McKenzie, \"Like an Old-Time Movie\"]\n\nHe recorded one more album, three years later, this time made up of songs he'd written himself, but never had another hit, and he retired from music for a time in 1970.\n\nMeanwhile the Mamas and the Papas struggled on for a while longer, and started work on a fourth album. But halfway through recording, they made a promotional trip to the UK, where Cass got arrested for reasons that are unclear, but seem to have been connected to some criminal associates of her then-partner. She was let go the next day, but had a traumatic time, including being strip-searched, and was telling someone about her horrific ordeal when John Phillips came up to her and started correcting her about her own experiences.\n\nThat was the last straw. She was not putting up with John Phillips for one second more, and she quit the group. She did come back long enough to finish up the album, which included a version of \"Dream a Little Dream of Me\", a song suggested by Michelle, who had known one of the song's writers when she was a kid. It was released as a single, but credited to \"Mama Cass with the Mamas and the Papas\" in the US, and just to \"Mama Cass\" in the UK:\n\n[Excerpt: Mama Cass, \"Dream a Little Dream of Me\"]\n\nThat made the top twenty, significantly outperforming the last few Mamas and Papas singles, and Elliot had a relatively successful solo career, with two more top thirty hits, both written by Mann and Weil, \"It's Getting Better\" and \"Make Your Own Kind of Music\":\n\n[Excerpt: Cass Elliot, \"Make Your Own Kind of Music\"]\n\nAfter a rough first attempt at a Las Vegas residency -- she lost a hundred pounds in weight, but as a result developed gastric and throat problems, and had to cancel almost straight away -- she became a beloved entertainer, appearing in several TV specials, and doing residencies in Las Vegas and the London Palladium.\n\nThe other group members all released solo records too, but with no success. Probably the best of them is Denny Doherty's version of the Millennium's \"To Claudia on Thursday\":\n\n[Excerpt: Denny Doherty, \"To Claudia on Thursday\"]\n\nJohn and Michelle's marriage fell apart for good, and John's drug use became much, much, worse. Eventually, the new owners of the group's record label sued them for a million dollars, and to settle the lawsuit they recorded a contractual obligation album, People Like Us, three years after they'd split, but they didn't get together for the recordings, just overdubbing parts as and when necessary.\n\nIn 1974, while staying in a flat owned by Harry Nilsson, Cass Elliot died of a heart attack, aged only thirty-two. She had just completed a residency at the London Palladium, for which she had once again lost a lot of weight after having put all the weight from her earlier attempt at weight loss back on. It's well known that repeated crash dieting, extreme weight loss, and yo-yoing weight can cause heart trouble.\n\nThat was the end of the Mamas and the Papas as the original band, but not quite the end for the group altogether. While Michelle Phillips went on to a successful acting career, and still acts today, John sank into depression and spent time in prison on drugs charges -- he would remain an addict for the rest of his life. As an attempt to get himself together after his prison time, he formed \"the New Mamas and Papas\", initially with a lineup of himself, Scott McKenzie, Denny Doherty, his daughter Mackenzie Phillips, and replacing Cass Elliot Elaine \"Spanky\" McFarlane of Spanky And Our Gang, and they started playing the nostalgia circuit:\n\n[Excerpt: The New Mamas and Papas, \"California Dreamin'\"]\n\nAt the same time, the Beach Boys were in a career slump, putting out odd one-off flop singles for film soundtracks, and often finding it difficult to get record contracts. One of the few recordings they made in the early eighties was for a cassette-only release, only sold through Radio Shack, put together by Terry Melcher and Daryl Dragon of the Captain & Tennille. The cassette contained new recordings by The Association, Paul Revere and the Raiders, and the Rip Chords, plus solo tracks by Mike Love and duets between Love and Dean Torrence, plus the Beach Boys' version of \"California Dreamin\", produced by Melcher, featuring a guest spot by Roger McGuinn on guitar.\n\nUnsurprisingly, the cassette didn't exactly set the music world alight, but a couple of years later the Beach Boys were putting out a new greatest hits album, and a slightly remixed version of \"California Dreamin'\" was stuck on that and put out as a single, and while it only made the lower reaches of the Hot One Hundred, it made the Adult Contemporary top ten, thanks in large part to a video which got a lot of play on MTV, featuring the Beach Boys, McGuinn, and cameos from Michelle and John, the latter as a saxophone-playing priest:\n\n[Excerpt: The Beach Boys, \"California Dreamin'\"]\n\nAt this point, there were lots of connections between the Beach Boys, Melcher, and the Mamas and the Papas, including that John and Michelle's daughter Chynna was a school friend of Brian Wilson's daughters Carnie and Wendy, and would soon form her own vocal group with them, and at some point Terry Melcher got hold of a demo that John Phillips had recorded, of a song he and Scott McKenzie had written together:\n\n[Excerpt: John Phillips, \"Kokomo\"]\n\nMelcher and Mike Love rewrote the lyric extensively, dropped Phillips' original middle eight altogether, and added a new chorus, listing place-names in the same way the Beach Boys had for \"California Girls\" and \"Surfin' USA\". It was put out as one of those throwaway film soundtrack singles, for a forgettable Tom Cruise film, Cocktail, but rather remarkably, thanks to a video featuring shots from the film intercut with the Beach Boys performing on a beach, it became the Beach Boys' first number one in twenty-two years, and their only one without any participation from Brian Wilson:\n\n[Excerpt: The Beach Boys, \"Kokomo\"]\n\nFor the rest of the eighties and nineties, the New Mamas and Papas toured with a revolving lineup. There would be various female singers, and usually at least one, sometimes two, of John Phillips, Denny Doherty, Scott McKenzie, and Barry McGuire, depending on who had fallen out with who, and who was in rehab. The New Mamas and Papas ended with Phillips' death in 2000, and Denny Doherty died in 2007, while Scott McKenzie died in 2012.\n\nBarry McGuire is still alive, and is now a contemporary Christian performer. His most recent album seems to have come out in 2000 -- it's called Eve of Destruction: 20 Inspirational Classics -- and he also rerecorded \"Eve of Destruction\" as \"Eve 2012\":\n\n[Excerpt: Barry McGuire, \"Eve 2012\"]\n\nAs for P.F. Sloan, he retired from the music business in 1972, for reasons he variously gave as being ill (he would suffer from chronic illnesses for decades before apparently being cured by a faith healer), being tired of making music, and having his life threatened by the owners of Dunhill Records. He infrequently gave interviews and made records over the next few decades, before recovering his strength enough to work on what he considered his magnum opus. He saw a performance of Beethoven's music and became fascinated at what he saw as the parallels between Beethoven and himself -- he very much saw Beethoven as the P.F. Sloan of his time. He immediately started work on a musical, Louis! Louis! (Louis is the French equivalent of Ludwig, Beethoven's first name), which eventually became his 2015 album, My Beethoven, a concept album that was equal parts autobiography and biography of Beethoven:\n\n[Excerpt: P.F. Sloan, \"This Love\"]\n\nBut by this point, Sloan was more myth than man. And this was largely because of Jimmy Webb. Webb had, in 1970, decided that he wasn't going to just be a songwriter for other people, but that he was going to be an artist in his own right, and put out a solo album. And one of the people who inspired him to do that was Sloan, who he thought of as one of the first of the great commercial songwriters to pursue his own artistic path. And as such, he wrote a tribute to him, a song called \"P.F. Sloan\".\n\nThe problem was, Sloan had already pretty much vanished from the scene -- as the song's lyrics said, starting \"I have been seeking P.F. Sloan, but no-one knows where he has gone\". Many people listening to the song assumed that Sloan was a character Webb had made up -- and Sloan would later claim that he and Webb had fallen out in the seventies and as a result Webb had gone around claiming just that, rather than acknowledging that Sloan was a real person, though I've not seen any interviews where Webb did that and have seen several where he very explicitly credits the real man as an inspiration.\n\nTo make matters worse, in the eighties, Eugene Landy, the abusive psychotherapist who used his position with his patient Brian Wilson to get himself credited as a co-writer and producer on many of Wilson's songs, insisted in many interviews that *he* was P.F. Sloan, claiming Sloan was a pseudonym and he had written all those songs. With Sloan out of the industry, many people believed him, at least until the extent of his other lies became clear.\n\nSo while Sloan did write his own autobiography, What's Exactly the Matter With Me? in 2014, by the time of his death, to most of those who knew his name at all, P.F. Sloan wasn't a man, a songwriter who had written for the Turtles and Jan and Dean and had a big folk-rock hit. He was an idea -- the idea of songwriting artistry, of inspiration, and of someone who would take his own path rather than submit to commercial pressures. The idea of musical innovation, of endless possibilities, and of being young in the mid-sixties, when it seemed the young people might still make a better world.\n\nThe truth? Well, that didn't matter. What mattered, always, was the song:\n\n[Excerpt: Jimmy Webb, \"P.F. Sloan\" into theme music]",
  "itunes:subtitle": "We start season four of A History of Rock Music in Five Hundred Songs with an extra-long look at San Francisco by Scott McKenzie, and at the Monterey Pop Festival, and the careers of the Mamas and the Papas and P.F. Sloan.  Click the full post to read li",
  "itunes:keywords": "\"Fast\" Eddie Hoh,Andrew Oldham,Barry McGuire,Big Brother and the Holding Company,Bones Howe,Bruce Johnston,Buffalo Springfield,Bumps Blackwell,Carol Connors,Cass Elliot,David Crosby,Denny Doherty,Gene Clark,Grateful Dead,Hal Blaine,Jack Nicholson,Jack Nitzsche,Jan and Dean,Jan Berry,Janis Joplin,Jefferson Airplane,Jill Gibson,Jimi Hendrix,Jimmy Webb,John Phillips,John Stewart,Johnny Rivers,Kim Fowley,Larry Knechtel,Lou Adler,Michelle Phillips,New Christie Minstrels,Nik Venet,Otis Redding,P.F. Sloan,Paul McCartney,Paul Simon,Ravi Shankar,scott mckenzie,Steve Barri,Terry Melcher,The Beach Boys,The Byrds,The Doors,The Mamas and the Papas,the Monkees,The Turtles,the who,The Wrecking Crew,Tim Rose,Zal Yanovsky",
  "itunes:episodeType": "full",
  "content:encoded": "We start season four of <em>A History of Rock Music in Five Hundred Songs</em> with an extra-long look at \"San Francisco\" by Scott McKenzie, and at the Monterey Pop Festival, and the careers of the Mamas and the Papas and P.F. Sloan.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/70877906\">on \"Up, Up, and Away\" by the 5th Dimension.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n<strong>Errata: </strong>An incorrect version of the file was previously uploaded, with the wrong section edited in at approximately 57 minutes. This was fixed about three hours after uploading, but some streaming services may have cached the wrong file.\n\nAlso I say that John Phillips wrote \"No, No, No, No\". I got this from an interview with McKenzie, but he must have been misremembering -- the song is a cover version of \"La Poupee Qui Fait Non\" by Michel Polnareff, with English-language lyrics by Geoff Stephens\n\n\n\n<strong>Resources</strong>\n\nAs usual, all the songs excerpted in the podcast can be heard in full at <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-151-san-francisco/\">Mixcloud</a>.\n\nScott McKenzie's first album is available <a href=\"https://amzn.to/3casXIS\">here</a>.\n\nThere are many compilations of the Mamas and the Papas' music, but sadly none that are in print in the UK have the original mono mixes. <a href=\"https://amzn.to/3KfZI40\">This set</a> is about as good as you're going to find, though, for the stereo versions.\n\nInformation on the Mamas and the Papas came from <a href=\"https://amzn.to/3dL3W7l\"><em>Go Where You Wanna Go: The Oral History of The Mamas and the Papas</em> by Matthew Greenwald</a>, <a href=\"https://amzn.to/3wp5j2a\"><em>California Dreamin': The True Story Of The Mamas and Papas</em> by Michelle Phillips</a>, and <a href=\"https://amzn.to/3AyR8cb\"><em>Papa John</em> by John Phillips and Jim Jerome.</a>\n\nInformation on P.F. Sloan came from <a href=\"https://payhip.com/b/efzi\"><em>PF - TRAVELLING BAREFOOT ON A ROCKY ROAD</em> by Stephen McParland</a> and <a href=\"https://amzn.to/3PBrmtf\"><em>What's Exactly the Matter With Me? </em>by P.F. Sloan and S.E. Feinberg.</a>\n\nThe film of the Monterey Pop Festival is available on this <a href=\"https://amzn.to/3QK91LI\">Criterion Blu-Ray set</a>. Sadly the CD of the performances seems to be deleted.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWelcome to season four of A History of Rock Music in Five Hundred Songs. It's good to be back.\n\nBefore we start this episode, I just want to say one thing. I get a lot of credit at times for the way I don't shy away from dealing with the more unsavoury elements of the people being covered in my podcast -- particularly the more awful men. But as I said very early on, I only cover those aspects of their life when they're relevant to the music, because this is a music podcast and not a true crime podcast. But also I worry that in some cases this might mean I'm giving a false impression of some people. In the case of this episode, one of the central figures is John Phillips of the Mamas and the Papas. Now, Phillips has posthumously been accused of some truly monstrous acts, the kind of thing that is truly unforgivable, and I believe those accusations. But those acts didn't take place during the time period covered by most of this episode, so I won't be covering them here -- but they're easily googlable if you want to know. I thought it best to get that out of the way at the start, so no-one's either anxiously waiting for the penny to drop or upset that I didn't acknowledge the elephant in the room.\n\nSeparately, this episode will have some discussion of fatphobia and diet culture, and of a death that is at least in part attributable to those things. Those of you affected by that may want to skip this one or read the transcript. There are also some mentions of drug addiction and alcoholism.\n\nAnyway, on with the show.\n\nOne of the things that causes problems with rock history is the tendency of people to have selective memories, and that's never more true than when it comes to the Summer of Love, summer of 1967. In the mythology that's built up around it, that was a golden time, the greatest time ever, a period of peace and love where everything was possible, and the world looked like it was going to just keep on getting better.\n\nBut what that means, of course, is that the people remembering it that way do so because it was the best time of their lives. And what happens when the best time of your life is over in one summer? When you have one hit and never have a second, or when your band splits up after only eighteen months, and you have to cope with the reality that your best years are not only behind you, but they weren't even best years, but just best months? What stories would you tell about that time? Would you remember it as the eve of destruction, the last great moment before everything went to hell, or would you remember it as a golden summer, full of people with flowers in their hair? And would either really be true?\n\n[Excerpt: Scott McKenzie, \"San Francisco\"]\n\nOther than the city in which they worked, there are a few things that seem to characterise almost all the important figures on the LA music scene in the middle part of the 1960s. They almost all seem to be incredibly ambitious, as one might imagine. There seem to be a huge number of fantasists among them -- people who will not only choose the legend over reality when it suits them, but who will choose the legend over reality even when it doesn't suit them. And they almost all seem to have a story about being turned down in a rude and arrogant manner by Lou Adler, usually more or less the same story.\n\nTo give an example, I'm going to read out a bit of Ray Manzarek's autobiography here. Now, Manzarek uses a few words that I can't use on this podcast and keep a clean rating, so I'm just going to do slight pauses when I get to them, but I'll leave the words in the transcript for those who aren't offended by them:\n\n\"Sometimes Jim and Dorothy and I went alone. The three of us tried Dunhill Records. Lou Adler was the head man. He was shrewd and he was hip. He had the Mamas and the Papas and a big single with Barry McGuire’s 'Eve of Destruction.' He was flush.\n\nWe were ushered into his office. He looked cool. He was California casually disheveled and had the look of a stoner, but his eyes were as cold as a shark’s. He took the twelve-inch acetate demo from me and we all sat down. He put the disc on his turntable and played each cut…for ten seconds. Ten seconds! You can’t tell jack [shit] from ten seconds. At least listen to one of the songs all the way through. I wanted to rage at him. 'How dare you! We’re the Doors! This is [fucking] Jim Morrison! He’s going to be a [fucking] star! Can’t you see that? Can’t you see how [fucking] handsome he is? Can’t you hear how groovy the music is? Don’t you [fucking] get it? Listen to the words, man!' My brain was a boiling, lava-filled Jell-O mold of rage. I wanted to eviscerate that shark.\n\nThe songs he so casually dismissed were 'Moonlight Drive,' 'Hello, I Love You,' 'Summer’s Almost Gone,' 'End of the Night,' 'I Looked at You,' 'Go Insane.'\n\nHe rejected the whole demo. Ten seconds on each song—maybe twenty seconds on 'Hello, I Love You' (I took that as an omen of potential airplay)—and we were dismissed out of hand. Just like that. He took the demo off the turntable and handed it back to me with an obsequious smile and said, 'Nothing here I can use.'\n\nWe were shocked. We stood up, the three of us, and Jim, with a wry and knowing smile on his lips, cuttingly and coolly shot back at him, 'That’s okay, man. We don’t want to be *used*, anyway.'\"\n\nNow, as you may have gathered from the episode on the Doors, Ray Manzarek was one of those print-the-legend types, and that's true of everyone who tells similar stories about Lou Alder. But... there are a *lot* of people who tell similar stories about Lou Adler.\n\nOne of those was Phil Sloan. You can get an idea of Sloan's attitude to storytelling from a story he always used to tell. Shortly after he and his family moved to LA from New York, he got a job selling newspapers on a street corner on Hollywood Boulevard, just across from Schwab's Drug Store. One day James Dean drove up in his Porsche and made an unusual request. He wanted to buy every copy of the newspaper that Sloan had -- around a hundred and fifty copies in total. But he only wanted one article, something in the entertainment section. Sloan didn't remember what the article was, but he did remember that one of the headlines was on the final illness of Oliver Hardy, who died shortly afterwards, and thought it might have been something to do with that. Dean was going to just clip that article from every copy he bought, and then he was going to give all the newspapers back to Sloan to sell again, so Sloan ended up making a lot of extra money that day.\n\nThere is one rather big problem with that story. Oliver Hardy died in August 1957, just after the Sloan family moved to LA. But James Dean died in September 1955, two years earlier.\n\nSloan admitted that, and said he couldn't explain it, but he was insistent. He sold a hundred and fifty newspapers to James Dean two years after Dean's death.\n\nWhen not selling newspapers to dead celebrities, Sloan went to Fairfax High School, and developed an interest in music which was mostly oriented around the kind of white pop vocal groups that were popular at the time, groups like the Kingston Trio, the Four Lads, and the Four Aces. But the record that made Sloan decide he wanted to make music himself was \"Just Goofed\" by the Teen Queens:\n\n[Excerpt: The Teen Queens, \"Just Goofed\"]\n\nIn 1959, when he was fourteen, he saw an advert for an open audition with Aladdin Records, a label he liked because of Thurston Harris. He went along to the audition, and was successful. His first single, released as by Flip Sloan -- Flip was a nickname, a corruption of \"Philip\" -- was produced by Bumps Blackwell and featured several of the musicians who played with Sam Cooke, plus Larry Knechtel on piano and Mike Deasey on guitar, but Aladdin shut down shortly after releasing it, and it may not even have had a general release, just promo copies. I've not been able to find a copy online anywhere.\n\nAfter that, he tried Arwin Records, the label that Jan and Arnie recorded for, which was owned by Marty Melcher (Doris Day's husband and Terry Melcher's stepfather). Melcher signed him, and put out a single, \"She's My Girl\", on Mart Records, a subsidiary of Arwin, on which Sloan was backed by a group of session players including Sandy Nelson and Bruce Johnston:\n\n[Excerpt: Philip Sloan, \"She's My Girl\"]\n\nThat record didn't have any success, and Sloan was soon dropped by Mart Records. He went on to sign with Blue Bird Records, which was as far as can be ascertained essentially a scam organisation that would record demos for songwriters, but tell the performers that they were making a real record, so that they would record it for the royalties they would never get, rather than for a decent fee as a professional demo singer would get.\n\nBut Steve Venet -- the brother of Nik Venet, and occasional songwriting collaborator with Tommy Boyce -- happened to come to Blue Bird one day, and hear one of Sloan's original songs. He thought Sloan would make a good songwriter, and took him to see Lou Adler at Columbia-Screen Gems music publishing. This was shortly after the merger between Columbia-Screen Gems and Aldon Music, and Adler was at this point the West Coast head of operations, subservient to Don Kirshner and Al Nevins, but largely left to do what he wanted.\n\nThe way Sloan always told the story, Venet tried to get Adler to sign Sloan, but Adler said his songs stunk and had no commercial potential. But Sloan persisted in trying to get a contract there, and eventually Al Nevins happened to be in the office and overruled Adler, much to Adler's disgust. Sloan was signed to Columbia-Screen Gems as a songwriter, though he wasn't put on a salary like the Brill Building songwriters, just told that he could bring in songs and they would publish them.\n\nShortly after this, Adler suggested to Sloan that he might want to form a writing team with another songwriter, Steve Barri, who had had a similar non-career non-trajectory, but was very slightly further ahead in his career, having done some work with Carol Connors, the former lead singer of the Teddy Bears. Barri had co-written a couple of flop singles for Connors, before the two of them had formed a vocal group, the Storytellers, with Connors' sister. The Storytellers had released a single, \"When Two People (Are in Love)\" , which was put out on a local independent label and which Adler had licensed to be released on Dimension Records, the label associated with Aldon Music:\n\n[Excerpt: The Storytellers \"When Two People (Are in Love)\"]\n\nThat record didn't sell, but it was enough to get Barri into the Columbia-Screen Gems circle, and Adler set him and Sloan up as a songwriting team -- although the way Sloan told it, it wasn't so much a songwriting team as Sloan writing songs while Barri was also there. Sloan would later claim \"it was mostly a collaboration of spirit, and it seemed that I was writing most of the music and the lyric, but it couldn't possibly have ever happened unless both of us were present at the same time\". One suspects that Barri might have a different recollection of how it went...\n\nSloan and Barri's first collaboration was a song that Sloan had half-written before they met, called \"Kick That Little Foot Sally Ann\", which was recorded by a West Coast Chubby Checker knockoff who went under the name Round Robin, and who had his own dance craze, the Slauson, which was much less successful than the Twist:\n\n[Excerpt: Round Robin, \"Kick that Little Foot Sally Ann\"]\n\nThat track was produced and arranged by Jack Nitzsche, and Nitzsche asked Sloan to be one of the rhythm guitarists on the track, apparently liking Sloan's feel. Sloan would end up playing rhythm guitar or singing backing vocals on many of the records made of songs he and Barri wrote together.\n\n\"Kick That Little Foot Sally Ann\" only made number sixty-one nationally, but it was a regional hit, and it meant that Sloan and Barri soon became what Sloan later described as \"the Goffin and King of the West Coast follow-ups.\" According to Sloan \"We'd be given a list on Monday morning by Lou Adler with thirty names on it of the groups who needed follow-ups to their hit.\"\n\nThey'd then write the songs to order, and they started to specialise in dance craze songs. For example, when the Swim looked like it might be the next big dance, they wrote \"Swim Swim Swim\", \"She Only Wants to Swim\", \"Let's Swim Baby\", \"Big Boss Swimmer\", \"Swim Party\" and \"My Swimmin' Girl\" (the last a collaboration with Jan Berry and Roger Christian).\n\nThese songs were exactly as good as they needed to be, in order to provide album filler for mid-tier artists, and while Sloan and Barri weren't writing any massive hits, they were doing very well as mid-tier writers. According to Sloan's biographer Stephen McParland, there was a three-year period in the mid-sixties where at least one song written or co-written by Sloan was on the national charts at any given time.\n\nMost of these songs weren't for Columbia-Screen Gems though. In early 1964 Lou Adler had a falling out with Don Kirshner, and decided to start up his own company, Dunhill, which was equal parts production company, music publishers, and management -- doing for West Coast pop singers what Motown was doing for Detroit soul singers, and putting everything into one basket. Dunhill's early clients included Jan and Dean and the rockabilly singer Johnny Rivers, and Dunhill also signed Sloan and Barri as songwriters.\n\nBecause of this connection, Sloan and Barri soon became an important part of Jan and Dean's hit-making process. The Matadors, the vocal group that had provided most of the backing vocals on the duo's hits, had started asking for more money than Jan Berry was willing to pay, and Jan and Dean couldn't do the vocals themselves -- as Bones Howe put it \"As a singer, Dean is a wonderful graphic artist\" -- and so Sloan and Barri stepped in, doing session vocals without payment in the hope that Jan and Dean would record a few of their songs. For example, on the big hit \"The Little Old Lady From Pasadena\", Dean Torrence is not present at all on the record -- Jan Berry sings the lead vocal, with Sloan doubling him for much of it, Sloan sings \"Dean\"'s falsetto, with the engineer Bones Howe helping out, and the rest of the backing vocals are sung by Sloan, Barri, and Howe:\n\n[Excerpt: Jan and Dean, \"The Little Old Lady From Pasadena\"]\n\nFor these recordings, Sloan and Barri were known as The Fantastic Baggys, a name which came from the Rolling Stones' manager Andrew Oldham and Mick Jagger, when the two were visiting California. Oldham had been commenting on baggys, the kind of shorts worn by surfers, and had asked Jagger what he thought of The Baggys as a group name. Jagger had replied \"Fantastic!\" and so the Fantastic Baggys had been born.\n\nAs part of this, Sloan and Barri moved hard into surf and hot-rod music from the dance songs they had been writing previously. The Fantastic Baggys recorded their own album, Tell 'Em I'm Surfin', as a quickie album suggested by Adler:\n\n[Excerpt: The Fantastic Baggys, \"Tell 'Em I'm Surfin'\"]\n\nAnd under the name The Rally Packs they recorded a version of Jan and Dean's \"Move Out Little Mustang\" which featured Berry's girlfriend Jill Gibson doing a spoken section:\n\n[Excerpt: The Rally Packs, \"Move Out Little Mustang\"]\n\nThey also wrote several album tracks for Jan and Dean, and wrote \"Summer Means Fun\" for Bruce and Terry -- Bruce Johnston, later of the Beach Boys, and Terry Melcher:\n\n[Excerpt: Bruce and Terry, \"Summer Means Fun\"]\n\nAnd they wrote the very surf-flavoured \"Secret Agent Man\" for fellow Dunhill artist Johnny Rivers:\n\n[Excerpt: Johnny Rivers, \"Secret Agent Man\"]\n\nBut of course, when you're chasing trends, you're chasing trends, and soon the craze for twangy guitars and falsetto harmonies had ended, replaced by a craze for jangly twelve-string guitars and closer harmonies. According to Sloan, he was in at the very beginning of the folk-rock trend -- the way he told the story, he was involved in the mastering of the Byrds' version of \"Mr. Tambourine Man\".\n\nHe later talked about Terry Melcher getting him to help out, saying \"He had produced a record called 'Mr. Tambourine Man', and had sent it into the head office, and it had been rejected. He called me up and said 'I've got three more hours in the studio before I'm being kicked out of Columbia. Can you come over and help me with this new record?' I did. I went over there. It was under lock and key. There were two guards outside the door. Terry asked me something about 'Summer Means Fun'.\n\n\"He said 'Do you remember the guitar that we worked on with that? How we put in that double reverb?'\n\n\"And I said 'yes'\n\n\"And he said 'What do you think if we did something like that with the Byrds?'\n\n\"And I said 'That sounds good. Let's see what it sounds like.'\n\nSo we patched into all the reverb centres in Columbia Music, and mastered the record in three hours.\"\n\nWhether Sloan really was there at the birth of folk rock, he and Barri jumped on the folk-rock craze just as they had the surf and hot-rod craze, and wrote a string of jangly hits including \"You Baby\" for the Turtles:\n\n[Excerpt: The Turtles, \"You Baby\"]\n\nand \"I Found a Girl\" for Jan and Dean:\n\n[Excerpt: Jan and Dean, \"I Found a Girl\"]\n\nThat song was later included on Jan and Dean's Folk 'n' Roll album, which also included... a song I'm not even going to name, but long-time listeners will know the one I mean. It was also notable in that \"I Found a Girl\" was the first song on which Sloan was credited not as Phil Sloan, but as P.F. Sloan -- he didn't have a middle name beginning with F, but rather the F stood for his nickname \"Flip\". Sloan would later talk of Phil Sloan and P.F. Sloan as almost being two different people, with P.F. being a far more serious, intense, songwriter.\n\nFolk 'n' Roll also contained another Sloan song, this one credited solely to Sloan. And that song is the one for which he became best known.\n\nThere are two very different stories about how \"Eve of Destruction\" came to be written. To tell Sloan's version, I'm going to read a few paragraphs from his autobiography:\n\n\"By late 1964, I had already written ‘Eve Of Destruction,’ ‘The Sins Of A Family,’ ‘This Mornin’,’ ‘Ain’t No Way I’m Gonna Change My Mind,’ and ‘What’s Exactly The Matter With Me?’ They all arrived on one cataclysmic evening, and nearly at the same time, as I worked on the lyrics almost simultaneously.\n\n‘Eve Of Destruction’ came about from hearing a voice, perhaps an angel’s. The voice instructed me to place five pieces of paper and spread them out on my bed. I obeyed the voice.\n\nThe voice told me that the first song would be called ‘Eve Of Destruction,’ so I wrote the title at the top of the page. For the next few hours, the voice came and went as I was writing the lyric, as if this spirit—or whatever it was—stood over me like a teacher: ‘No, no … not think of all the hate there is in Red Russia … Red China!’\n\nI didn’t understand. I thought the Soviet Union was the mortal threat to America, but the voice went on to reveal to me the future of the world until 2024. I was told the Soviet Union would fall, and that Red China would continue to be communist far into the future, but that communism was not going to be allowed to take over this Divine Planet—therefore, think of all the hate there is in Red China.\n\nI argued and wrestled with the voice for hours, until I was exhausted but satisfied inside with my plea to God to either take me out of the world, as I could not live in such a hypocritical society, or to show me a way to make things better. When I was writing ‘Eve,’ I was on my hands and knees, pleading for an answer.\"\n\nLou Adler's story is that he gave Phil Sloan a copy of Bob Dylan's Bringing it All Back Home album and told him to write a bunch of songs that sounded like that, and Sloan came back a week later as instructed with ten Dylan knock-offs. Adler said \"It was a natural feel for him. He's a great mimic.\"\n\nAs one other data point, both Steve Barri and Bones Howe, the engineer who worked on most of the sessions we're looking at today, have often talked in interviews about \"Eve of Destruction\" as being a Sloan/Barri collaboration, as if to them it's common knowledge that it wasn't written alone, although Sloan's is the only name on the credits.\n\nThe song was given to a new signing to Dunhill Records, Barry McGuire. McGuire was someone who had been part of the folk scene for years, He'd been playing folk clubs in LA while also acting in a TV show from 1961. When the TV show had finished, he'd formed a duo, Barry and Barry, with Barry Kane, and they performed much the same repertoire as all the other early-sixties folkies:\n\n[Excerpt: Barry and Barry, \"If I Had a Hammer\"]\n\nAfter recording their one album, both Barrys joined the New Christy Minstrels. We've talked about the Christys before, but they were -- and are to this day -- an ultra-commercial folk group, led by Randy Sparks, with a revolving membership of usually eight or nine singers which included several other people who've come up in this podcast, like Gene Clark and Jerry Yester.\n\nMcGuire became one of the principal lead singers of the Christys, singing lead on their version of the novelty cowboy song \"Three Wheels on My Wagon\", which was later released as a single in the UK and became a perennial children's favourite (though it has a problematic attitude towards Native Americans):\n\n[Excerpt: The New Christy Minstrels, \"Three Wheels on My Wagon\"]\n\nAnd he also sang lead on their big hit \"Green Green\", which he co-wrote with Randy Sparks:\n\n[Excerpt: The New Christy Minstrels, \"Green Green\"]\n\nBut by 1965 McGuire had left the New Christy Minstrels. As he said later \"I'd sung 'Green Green' a thousand times and I didn't want to sing it again. This is January of 1965. I went back to LA to meet some producers, and I was broke. Nobody had the time of day for me. I was walking down street one time to see Dr. Strangelove and I walked by the music store, and I heard \"Green Green\" comin' out of the store, ya know, on Hollywood Boulevard. And I heard my voice, and I thought, 'I got four dollars in my pocket!' I couldn't believe it, my voice is comin' out on Hollywood Boulevard, and I'm broke. And right at that moment, a car pulls up, and the radio is playing 'Chim Chim Cherie\" also by the Minstrels. So I got my voice comin' at me in stereo, standin' on the sidewalk there, and I'm broke, and I can't get anyone to sign me!\"\n\nBut McGuire had a lot of friends who he'd met on the folk scene, some of whom were now in the new folk-rock scene that was just starting to spring up. One of them was Roger McGuinn, who told him that his band, the Byrds, were just about to put out a new single, \"Mr. Tambourine Man\", and that they were about to start a residency at Ciro's on Sunset Strip. McGuinn invited McGuire to the opening night of that residency, where a lot of other people from the scene were there to see the new group. Bob Dylan was there, as was Phil Sloan, and the actor Jack Nicholson, who was still at the time a minor bit-part player in low-budget films made by people like American International Pictures (the cinematographer on many of Nicholson's early films was Floyd Crosby, David Crosby's father, which may be why he was there).\n\nSomeone else who was there was Lou Adler, who according to McGuire recognised him instantly. According to Adler, he actually asked Terry Melcher who the long-haired dancer wearing furs was, because \"he looked like the leader of a movement\", and Melcher told him that he was the former lead singer of the New Christy Minstrels. Either way, Adler approached McGuire and asked if he was currently signed -- Dunhill Records was just starting up, and getting someone like McGuire, who had a proven ability to sing lead on hit records, would be a good start for the label.\n\nAs McGuire didn't have a contract, he was signed to Dunhill, and he was given some of Sloan's new songs to pick from, and chose \"What's Exactly the Matter With Me?\" as his single:\n\n[Excerpt: Barry McGuire, \"What's Exactly the Matter With Me?\"]\n\nMcGuire described what happened next: \"It was like, a three-hour session. We did two songs, and then the third one wasn't turning out. We only had about a half hour left in the session, so I said 'Let's do this tune', and I pulled 'Eve of Destruction' out of my pocket, and it just had Phil's words scrawled on a piece of paper, all wrinkled up. Phil worked the chords out with the musicians, who were Hal Blaine on drums and Larry Knechtel on bass.\"\n\nThere were actually more musicians than that at the session -- apparently both Knechtel and Joe Osborn were there, so I'm not entirely sure who's playing bass -- Knechtel was a keyboard player as well as a bass player, but I don't hear any keyboards on the track. And Tommy Tedesco was playing lead guitar, and Steve Barri added percussion, along with Sloan on rhythm guitar and harmonica. The chords were apparently scribbled down for the musicians on bits of greasy paper that had been used to wrap some takeaway chicken, and they got through the track in a single take. According to McGuire \"I'm reading the words off this piece of wrinkled paper, and I'm singing 'My blood's so mad, feels like coagulatin'\", that part that goes 'Ahhh you can't twist the truth', and the reason I'm going 'Ahhh' is because I lost my place on the page. People said 'Man, you really sounded frustrated when you were singing.' I was. I couldn't see the words!\"\n\n[Excerpt: Barry McGuire, \"Eve of Destruction\"]\n\nWith a few overdubs -- the female backing singers in the chorus, and possibly the kettledrums, which I've seen differing claims about, with some saying that Hal Blaine played them during the basic track and others saying that Lou Adler suggested them as an overdub, the track was complete.\n\nMcGuire wasn't happy with his vocal, and a session was scheduled for him to redo it, but then a record promoter working with Adler was DJing a birthday party for the head of programming at KFWB, the big top forty radio station in LA at the time, and he played a few acetates he'd picked up from Adler. Most went down OK with the crowd, but when he played \"Eve of Destruction\", the crowd went wild and insisted he play it three times in a row. The head of programming called Adler up and told him that \"Eve of Destruction\" was going to be put into rotation on the station from Monday, so he'd better get the record out. As McGuire was away for the weekend, Adler just released the track as it was, and what had been intended to be a B-side became Barry McGuire's first and only number one record:\n\n[Excerpt: Barry McGuire, \"Eve of Destruction\"]\n\nSloan would later claim that that song was a major reason why the twenty-sixth amendment to the US Constitution was passed six years later, because the line \"you're old enough to kill but not for votin'\" shamed Congress into changing the constitution to allow eighteen-year-olds to vote. If so, that would make \"Eve of Destruction\" arguably the single most impactful rock record in history, though Sloan is the only person I've ever seen saying that\n\nAs well as going to number one in McGuire's version, the song was also covered by the other artists who regularly performed Sloan and Barri songs, like the Turtles:\n\n[Excerpt: The Turtles, \"Eve of Destruction\"]\n\nAnd Jan and Dean, whose version on Folk & Roll used the same backing track as McGuire, but had a few lyrical changes to make it fit with Jan Berry's right-wing politics, most notably changing \"Selma, Alabama\" to \"Watts, California\", thus changing a reference to peaceful civil rights protestors being brutally attacked and murdered by white supremacist state troopers to a reference to what was seen, in the popular imaginary, as Black people rioting for no reason:\n\n[Excerpt: Jan and Dean, \"Eve of Destruction\"]\n\nAccording to Sloan, he worked on the Folk & Roll album as a favour to Berry, even though he thought Berry was being cynical and exploitative in making the record, but those changes caused a rift in their friendship. Sloan said in his autobiography \"Where I was completely wrong was in helping him capitalize on something in which he didn’t believe. Jan wanted the public to perceive him as a person who was deeply concerned and who embraced the values of the progressive politics of the day. But he wasn’t that person. That’s how I was being pulled. It was when he recorded my actual song ‘Eve Of Destruction’ and changed a number of lines to reflect his own ideals that my principles demanded that I leave Folk City and never return.\"\n\nIt's true that Sloan gave no more songs to Jan and Dean after that point -- but it's also true that the duo would record only one more album, the comedy concept album Jan and Dean Meet Batman, before Jan's accident.\n\nIncidentally, the reference to Selma, Alabama in the lyric might help people decide on which story about the writing of \"Eve of Destruction\" they think is more plausible. Remember that Lou Adler said that it was written after Adler gave Sloan a copy of Bringing it All Back Home and told him to write a bunch of knock-offs, while Sloan said it was written after a supernatural force gave him access to all the events that would happen in the world for the next sixty years. Sloan claimed the song was written in late 1964. Selma, Alabama, became national news in late February and early March 1965. Bringing it All Back Home was released in late March 1965.\n\nSo either Adler was telling the truth, or Sloan really *was* given a supernatural insight into the events of the future.\n\nNow, as it turned out, while \"Eve of Destruction\" went to number one, that would be McGuire's only hit as a solo artist. His next couple of singles would reach the very low end of the Hot One Hundred, and that would be it -- he'd release several more albums, before appearing in the Broadway musical Hair, most famous for its nude scenes, and getting a small part in the cinematic masterpiece Werewolves on Wheels:\n\n[Excerpt: Werewolves on Wheels trailer]\n\nP.F. Sloan would later tell various stories about why McGuire never had another hit. Sometimes he would say that Dunhill Records had received death threats because of \"Eve of Destruction\" and so deliberately tried to bury McGuire's career, other times he would say that Lou Adler had told him that Billboard had said they were never going to put McGuire's records on the charts no matter how well they sold, because \"Eve of Destruction\" had just been too powerful and upset the advertisers.\n\nBut of course at this time Dunhill were still trying for a follow-up to \"Eve of Destruction\", and they thought they might have one when Barry McGuire brought in a few friends of his to sing backing vocals on his second album.\n\nNow, we've covered some of the history of the Mamas and the Papas already, because they were intimately tied up with other groups like the Byrds and the Lovin' Spoonful, and with the folk scene that led to songs like \"Hey Joe\", so some of this will be more like a recap than a totally new story, but I'm going to recap those parts of the story anyway, so it's fresh in everyone's heads.\n\nJohn Phillips, Scott McKenzie, and Cass Elliot all grew up in Alexandria, Virginia, just a few miles south of Washington DC. Elliot was a few years younger than Phillips and McKenzie, and so as is the way with young men they never really noticed her, and as McKenzie later said \"She lived like a quarter of a mile from me and I never met her until New York\".\n\nWhile they didn't know who Elliot was, though, she was aware who they were, as Phillips and McKenzie sang together in a vocal group called The Smoothies. The Smoothies were a modern jazz harmony group, influenced by groups like the Modernaires, the Hi-Los, and the Four Freshmen. John Phillips later said \"We were drawn to jazz, because we were sort of beatniks, really, rather than hippies, or whatever, flower children. So we used to sing modern harmonies, like Lambert, Hendricks, and Ross. Dave Lambert did a lot of our arrangements for us as a matter of fact.\"\n\nNow, I've not seen any evidence other than Phillips' claim that Dave Lambert ever arranged for the Smoothies, but that does tell you a lot about the kind of music that they were doing. Lambert, Hendricks, and Ross were a vocalese trio whose main star was Annie Ross, who had a career worthy of an episode in itself -- she sang with Paul Whiteman, appeared in a Little Rascals film when she was seven, had an affair with Lenny Bruce, dubbed Britt Ekland's voice in The Wicker Man, played the villain's sister in Superman III, and much more. Vocalese, you'll remember, was a style of jazz vocal where a singer would take a jazz instrumental, often an improvised one, and add lyrics which they would sing, like Lambert, Hendricks, and Ross' version of \"Cloudburst\":\n\n[Excerpt: Lambert, Hendricks, and Ross, \"Cloudburst\"]\n\nWhether Dave Lambert ever really did arrange for the Smoothies or not, it's very clear that the trio had a huge influence on John Phillips' ideas about vocal arrangement, as you can hear on Mamas and Papas records like \"Once Was a Time I Thought\":\n\n[Excerpt: The Mamas and the Papas, \"Once Was a Time I Thought\"]\n\nWhile the Smoothies thought of themselves as a jazz group, when they signed to Decca they started out making the standard teen pop of the era, with songs like \"Softly\":\n\n[Excerpt, The Smoothies, \"Softly\"]\n\nWhen the folk boom started, Phillips realised that this was music that he could do easily, because the level of musicianship among the pop-folk musicians was so much lower than in the jazz world. The Smoothies made some recordings in the style of the Kingston Trio, like \"Ride Ride Ride\":\n\n[Excerpt: The Smoothies, \"Ride Ride Ride\"]\n\nThen when the Smoothies split, Phillips and McKenzie formed a trio with a banjo player, Dick Weissman, who they met through Izzy Young's Folklore Centre in Greenwich Village after Phillips asked Young to name some musicians who could make a folk record with him. Weissman was often considered the best banjo player on the scene, and was a friend of Pete Seeger's, to whom Seeger sometimes turned for banjo tips.\n\nThe trio, who called themselves the Journeymen, quickly established themselves on the folk scene. Weissman later said \"we had this interesting balance. John had all of this charisma -- they didn't know about the writing thing yet -- John had the personality, Scott had the voice, and I could play. If you think about it, all of those bands like the Kingston Trio, the Brothers Four, nobody could really *sing* and nobody could really *play*, relatively speaking.\"\n\nThis is the take that most people seemed to have about John Phillips, in any band he was ever in. Nobody thought he was a particularly good singer or instrumentalist -- he could sing on key and play adequate rhythm guitar, but nobody would actually pay money to listen to him do those things. Mark Volman of the Turtles, for example, said of him \"John wasn't the kind of guy who was going to be able to go up on stage and sing his songs as a singer-songwriter. He had to put himself in the context of a group.\"\n\nBut he was charismatic, he had presence, and he also had a great musical mind. He would surround himself with the best players and best singers he could, and then he would organise and arrange them in ways that made the most of their talents.\n\nHe would work out the arrangements, in a manner that was far more professional than the quick head arrangements that other folk groups used, and he instigated a level of professionalism in his groups that was not at all common on the scene. Phillips' friend Jim Mason talked about the first time he saw the Journeymen -- \"They were warming up backstage, and John had all of them doing vocal exercises; one thing in particular that's pretty famous called 'Seiber Syllables' -- it's a series of vocal exercises where you enunciate different vowel and consonant sounds. It had the effect of clearing your head, and it's something that really good operetta singers do.\"\n\nThe group were soon signed by Frank Werber, the manager of the Kingston Trio, who signed them as an insurance policy. Dave Guard, the Kingston Trio's banjo player, was increasingly having trouble with the other members, and Werber knew it was only a matter of time before he left the group. Werber wanted the Journeymen as a sort of farm team -- he had the idea that when Guard left, Phillips would join the Kingston Trio in his place as the third singer. Weissman would become the Trio's accompanist on banjo, and Scott McKenzie, who everyone agreed had a remarkable voice, would be spun off as a solo artist. But until that happened, they might as well make records by themselves.\n\nThe Journeymen signed to MGM records, but were dropped before they recorded anything. They instead signed to Capitol, for whom they recorded their first album:\n\n[Excerpt: The Journeymen, \"500 Miles\"]\n\nAfter recording that album, the Journeymen moved out to California, with Phillips' wife and children. But soon Phillips' marriage was to collapse, as he met and fell in love with Michelle Gilliam. Gilliam was nine years younger than him -- he was twenty-six and she was seventeen -- and she had the kind of appearance which meant that in every interview with an older heterosexual man who knew her, that man will spend half the interview talking about how attractive he found her. Phillips soon left his wife and children, but before he did, the group had a turntable hit with \"River Come Down\", the B-side to \"500 Miles\":\n\n[Excerpt: The Journeymen, \"River Come Down\"]\n\nAround the same time, Dave Guard *did* leave the Kingston Trio, but the plan to split the Journeymen never happened. Instead Phillips' friend John Stewart replaced Guard -- and this soon became a new source of income for Phillips. Both Phillips and Stewart were aspiring songwriters, and they collaborated together on several songs for the Trio, including \"Chilly Winds\":\n\n[Excerpt: The Kingston Trio, \"Chilly Winds\"]\n\nPhillips became particularly good at writing songs that sounded like they could be old traditional folk songs, sometimes taking odd lines from older songs to jump-start new ones, as in \"Oh Miss Mary\", which he and Stewart wrote after hearing someone sing the first line of a song she couldn't remember the rest of:\n\n[Excerpt: The Kingston Trio, \"Oh Miss Mary\"]\n\nPhillips and Stewart became so close that Phillips actually suggested to Stewart that he quit the Kingston Trio and replace Dick Weissman in the Journeymen. Stewart did quit the Trio -- but then the next day Phillips suggested that maybe it was a bad idea and he should stay where he was. Stewart went back to the Trio, claimed he had only pretended to quit because he wanted a pay-rise, and got his raise, so everyone ended up happy.\n\nThe Journeymen moved back to New York with Michelle in place of Phillips' first wife (and Michelle's sister Russell also coming along, as she was dating Scott McKenzie) and on New Year's Eve 1962 John and Michelle married -- so from this point on I will refer to them by their first names, because they both had the surname Phillips.\n\nThe group continued having success through 1963, including making appearances on \"Hootenanny\":\n\n[Excerpt: The Journeymen, \"Stack O'Lee (live on Hootenanny)\"]\n\nBy the time of the Journeymen's third album, though, John and Scott McKenzie were on bad terms. Weissman said \"They had been the closest of friends and now they were the worst of enemies. They talked through me like I was a medium. It got to the point where we'd be standing in the dressing room and John would say to me 'Tell Scott that his right sock doesn't match his left sock...' Things like that, when they were standing five feet away from each other.\"\n\nEventually, the group split up. Weissman was always going to be able to find employment given his banjo ability, and he was about to get married and didn't need the hassle of dealing with the other two. McKenzie was planning on a solo career -- everyone was agreed that he had the vocal ability. But John was another matter. He needed to be in a group.  And not only that, the Journeymen had bookings they needed to complete.\n\nHe quickly pulled together a group he called the New Journeymen. The core of the lineup was himself, Michelle on vocals, and banjo player Marshall Brickman. Brickman had previously been a member of a folk group called the Tarriers, who had had a revolving lineup, and had played on most of their early-sixties recordings:\n\n[Excerpt: The Tarriers, \"Quinto (My Little Pony)\"]\n\nWe've met the Tarriers before in the podcast -- they had been formed by Erik Darling, who later replaced Pete Seeger in the Weavers after Seeger's socialist principles wouldn't let him do advertising, and Alan Arkin, later to go on to be a film star, and had had hits with \"Cindy, O Cindy\", with lead vocals from Vince Martin, who would later go on to be a major performer in the Greenwich Village scene, and with \"The Banana Boat Song\". By the time Brickman had joined, though, Darling, Arkin, and Martin had all left the group to go on to bigger things, and while he played with them for several years, it was after their commercial peak.\n\nBrickman would, though, also go on to a surprising amount of success, but as a writer rather than a musician -- he had a successful collaboration with Woody Allen in the 1970s, co-writing four of Allen's most highly regarded films -- Sleeper, Annie Hall, Manhattan, and Manhattan Murder Mystery -- and with another collaborator he later co-wrote the books for the stage musicals Jersey Boys and The Addams Family.\n\nBoth John and Michelle were decent singers, and both have their admirers as vocalists -- P.F. Sloan always said that Michelle was the best singer in the group they eventually formed, and that it was her voice that gave the group its sound -- but for the most part they were not considered as particularly astonishing lead vocalists. Certainly, neither had a voice that stood out the way that Scott McKenzie's had. They needed a strong lead singer, and they found one in Denny Doherty.\n\nNow, we covered Denny Doherty's early career in the episode on the Lovin' Spoonful, because he was intimately involved in the formation of that group, so I won't go into too much detail here, but I'll give a very abbreviated version of what I said there. Doherty was a Canadian performer who had been a member of the Halifax Three with Zal Yanovsky:\n\n[Excerpt: The Halifax Three, \"When I First Came to This Land\"]\n\nAfter the Halifax Three had split up, Doherty and Yanovsky had performed as a duo for a while, before joining up with Cass Elliot and her husband Jim Hendricks, who both had previously been in the Big Three with Tim Rose:\n\n[Excerpt: Cass Elliot and the Big 3, \"The Banjo Song\"]\n\nElliot, Hendricks, Yanovsky, and Doherty had formed The Mugwumps, sometimes joined by John Sebastian, and had tried to go in more of a rock direction after seeing the Beatles on Ed Sullivan. They recorded one album together before splitting up:\n\n[Excerpt: The Mugwumps, \"Searchin'\"]\n\nPart of the reason they split up was that interpersonal relationships within the group were put under some strain -- Elliot and Hendricks split up, though they would remain friends and remain married for several years even though they were living apart, and Elliot had an unrequited crush on Doherty.\n\nBut since they'd split up, and Yanovsky and Sebastian had gone off to form the Lovin' Spoonful, that meant that Doherty was free, and he was regarded as possibly the best male lead vocalist on the circuit, so the group snapped him up. The only problem was that the Journeymen still had gigs booked that needed to be played, one of them was in just three days, and Doherty didn't know the repertoire.\n\nThis was a problem with an easy solution for people in their twenties though -- they took a huge amount of amphetamines, and stayed awake for three days straight rehearsing. They made the gig, and Doherty was now the lead singer of the New Journeymen:\n\n[Excerpt: The New Journeymen, \"The Last Thing on My Mind\"]\n\nBut the New Journeymen didn't last in that form for very long, because even before joining the group, Denny Doherty had been going in a more folk-rock direction with the Mugwumps. At the time, John Phillips thought rock and roll was kids' music, and he was far more interested in folk and jazz, but he was also very interested in making money, and he soon decided it was an idea to start listening to the Beatles.\n\nThere's some dispute as to who first played the Beatles for John in early 1965 -- some claim it was Doherty, others claim it was Cass Elliot, but everyone agrees it was after Denny Doherty had introduced Phillips to something else -- he brought round some LSD for John and Michelle, and Michelle's sister Rusty, to try. And then he told them he'd invited round a friend.\n\nMichelle Phillips later remembered, \"I remember saying to the guys \"I don't know about you guys, but this drug does nothing for me.\" At that point there was a knock on the door, and as I opened the door and saw Cass, the acid hit me *over the head*. I saw her standing there in a pleated skirt, a pink Angora sweater with great big eyelashes on and her hair in a flip. And all of a sudden I thought 'This is really *quite* a drug!' It was an image I will have securely fixed in my brain for the rest of my life. I said 'Hi, I'm Michelle. We just took some LSD-25, do you wanna join us?' And she said 'Sure...'\"\n\nRusty Gilliam's description matches this -- \"It was mind-boggling. She had on a white pleated skirt, false eyelashes. These were the kind of eyelashes that when you put them on you were supposed to trim them to an appropriate length, which she didn't, and when she blinked she looked like a cow, or those dolls you get when you're little and the eyes open and close. And we're on acid. Oh my God! It was a sight! And everything she was wearing were things that you weren't supposed to be wearing if you were heavy -- white pleated skirt, mohair sweater. You know, until she became famous, she suffered so much, and was poked fun at.\"\n\nThis gets to an important point about Elliot, and one which sadly affected everything about her life. Elliot was *very* fat -- I've seen her weight listed at about three hundred pounds, and she was only five foot five tall -- and she also didn't have the kind of face that gets thought of as conventionally attractive. Her appearance would be cruelly mocked by pretty much everyone for the rest of her life, in ways that it's genuinely hurtful to read about, and which I will avoid discussing in detail in order to avoid hurting fat listeners.\n\nBut the two *other* things that defined Elliot in the minds of those who knew her were her voice -- every single person who knew her talks about what a wonderful singer she was -- and her personality. I've read a lot of things about Cass Elliot, and I have never read a single negative word about her as a person, but have read many people going into raptures about what a charming, loving, friendly, understanding person she was.\n\nMichelle later said of her \"From the time I left Los Angeles, I hadn't had a friend, a buddy. I was married, and John and I did not hang out with women, we just hung out with men, and especially not with women my age. John was nine years older than I was. And here was a fun-loving, intelligent woman. She captivated me. I was as close to in love with Cass as I could be to any woman in my life at that point.\n\nShe also represented something to me: freedom. Everything she did was because she wanted to do it. She was completely independent and I admired her and was in awe of her. And later on, Cass would be the one to tell me not to let John run my life. And John hated her for that.\"\n\nEither Elliot had brought round Meet The Beatles, the Beatles' first Capitol album, for everyone to listen to, or Denny Doherty already had it, but either way Elliot and Doherty were by this time already Beatles fans. Michelle, being younger than the rest and not part of the folk scene until she met John, was much more interested in rock and roll than any of them, but because she'd been married to John for a couple of years and been part of his musical world she hadn't really encountered the Beatles music, though she had a vague memory that she might have heard a track or two on the radio.\n\nJohn was hesitant -- he didn't want to listen to any rock and roll, but eventually he was persuaded, and the record was put on while he was on his first acid trip:\n\n[Excerpt: The Beatles, \"I Want to Hold Your Hand\"]\n\nWithin a month, John Phillips had written thirty songs that he thought of as inspired by the Beatles. The New Journeymen were going to go rock and roll.\n\nBy this time Marshall Brickman was out of the band, and instead John, Michelle, and Denny recruited a new lead guitarist, Eric Hord. Denny started playing bass, with John on rhythm guitar, and a violinist friend of theirs, Peter Pilafian, knew a bit of drums and took on that role. The new lineup of the group used the Journeymen's credit card, which hadn't been stopped even though the Journeymen were no more, to go down to St. Thomas in the Caribbean, along with Michelle's sister, John's daughter Mackenzie (from whose name Scott McKenzie had taken his stage name, as he was born Philip Blondheim), a pet dog, and sundry band members' girlfriends. They stayed there for several months, living in tents on the beach, taking acid, and rehearsing. While they were there, Michelle and Denny started an affair which would have important ramifications for the group later.\n\nThey got a gig playing at a club called Duffy's, whose address was on Creeque Alley, and soon after they started playing there Cass Elliot travelled down as well -- she was in love with Denny, and wanted to be around him. She wasn't in the group, but she got a job working at Duffy's as a waitress, and she would often sing harmony with the group while waiting at tables. Depending on who was telling the story, either she didn't want to be in the group because she didn't want her appearance to be compared to Michelle's, or John wouldn't *let* her be in the group because she was so fat.\n\nLater a story would be made up to cover for this, saying that she hadn't been in the group at first because she couldn't sing the highest notes that were needed, until she got hit on the head with a metal pipe and discovered that it had increased her range by three notes, but that seems to be a lie.\n\nOne of the songs the New Journeymen were performing at this time was \"Mr. Tambourine Man\". They'd heard that their old friend Roger McGuinn had recorded it with his new band, but they hadn't yet heard his version, and they'd come up with their own arrangement:\n\n[Excerpt: The New Journeymen, \"Mr. Tambourine Man\"]\n\nDenny later said \"We were doing three-part harmony on 'Mr Tambourine Man', but a lot slower... like a polka or something! And I tell John, 'No John, we gotta slow it down and give it a backbeat.' Finally we get the Byrds 45 down here, and we put it on and turn it up to ten, and John says 'Oh, like that?' Well, as you can tell, it had already been done. So John goes 'Oh, ah... that's it...' a light went on. So we started doing Beatles stuff. We dropped 'Mr Tambourine Man' after hearing the Byrds version, because there was no point.\"\n\nEventually they had to leave the island -- they had completely run out of money, and were down to fifty dollars. The credit card had been cut up, and the governor of the island had a personal vendetta against them because they gave his son acid, and they were likely to get arrested if they didn't leave the island. Elliot and her then-partner had round-trip tickets, so they just left, but the rest of them were in trouble. By this point they were unwashed, they were homeless, and they'd spent their last money on stage costumes.\n\nThey got to the airport, and John Phillips tried to write a cheque for eight air fares back to the mainland, which the person at the check-in desk just laughed at. So they took their last fifty dollars and went to a casino. There Michelle played craps, and she rolled seventeen straight passes, something which should be statistically impossible. She turned their fifty dollars into six thousand dollars, which they scooped up, took to the airport, and paid for their flights out in cash.\n\nThe New Journeymen arrived back in New York, but quickly decided that they were going to try their luck in California. They rented a car, using Scott McKenzie's credit card, and drove out to LA. There they met up with Hoyt Axton, who you may remember as the son of Mae Axton, the writer of \"Heartbreak Hotel\", and as the performer who had inspired Michael Nesmith to go into folk music:\n\n[Excerpt: Hoyt Axton, \"Greenback Dollar\"]\n\nAxton knew the group, and fed them and put them up for a night, but they needed somewhere else to stay. They went to stay with one of Michelle's friends, but after one night their rented car was stolen, with all their possessions in it. They needed somewhere else to stay, so they went to ask Jim Hendricks if they could crash at his place -- and they were surprised to find that Cass Elliot was there already. Hendricks had another partner -- though he and Elliot wouldn't have their marriage annulled until 1968 and were still technically married -- but he'd happily invited her to stay with them. And now all her friends had turned up, he invited them to stay as well, taking apart the beds in his one-bedroom apartment so he could put down a load of mattresses in the space for everyone to sleep on.\n\nThe next part becomes difficult, because pretty much everyone in the LA music scene of the sixties was a liar who liked to embellish their own roles in things, so it's quite difficult to unpick what actually happened. What seems to have happened though is that first this new rock-oriented version of the New Journeymen went to see Frank Werber, on the recommendation of John Stewart. Werber was the manager of the Kingston Trio, and had also managed the Journeymen. He, however, was not interested -- not because he didn't think they had talent, but because he had experience of working with John Phillips previously. When Phillips came into his office Werber picked up a tape that he'd been given of the group, and said \"I have not had a chance to listen to this tape. I believe that you are a most talented individual, and that's why we took you on in the first place. But I also believe that you're also a drag to work with. A pain in the ass. So I'll tell you what, before whatever you have on here sways me, I'm gonna give it back to you and say that we're not interested.\"\n\nMeanwhile -- and this part of the story comes from Kim Fowley, who was never one to let the truth get in the way of him taking claim for everything, but parts of it at least are corroborated by other people -- Cass Elliot had called Fowley, and told him that her friends' new group sounded pretty good and he should sign them. Fowley was at that time working as a talent scout for a label, but according to him the label wouldn't give the group the money they wanted. So instead, Fowley got in touch with Nik Venet, who had just produced the Leaves' hit version of \"Hey Joe\" on Mira Records:\n\n[Excerpt: The Leaves, \"Hey Joe\"]\n\nFowley suggested to Venet that Venet should sign the group to Mira Records, and Fowley would sign them to a publishing contract, and they could both get rich.\n\nThe trio went to audition for Venet, and Elliot drove them over -- and Venet thought the group had a great look as a quartet. He wanted to sign them to a record contract, but only if Elliot was in the group as well. They agreed, he gave them a one hundred and fifty dollar advance, and told them to come back the next day to see his boss at Mira.\n\nBut Barry McGuire was also hanging round with Elliot and Hendricks, and decided that he wanted to have Lou Adler hear the four of them. He thought they might be useful both as backing vocalists on his second album and as a source of new songs. He got them to go and see Lou Adler, and according to McGuire Phillips didn't want Elliot to go with them, but as Elliot was the one who was friends with McGuire, Phillips worried that they'd lose the chance with Adler if she didn't.\n\nAdler was amazed, and decided to sign the group right then and there -- both Bones Howe and P.F. Sloan claimed to have been there when the group auditioned for him and have said \"if you won't sign them, I will\", though exactly what Sloan would have signed them to I'm not sure. Adler paid them three thousand dollars in cash and told them not to bother with Nik Venet, so they just didn't turn up for the Mira Records audition the next day. Instead, they went into the studio with McGuire and cut backing vocals on about half of his new album:\n\n[Excerpt: Barry McGuire with the Mamas and the Papas, \"Hide Your Love Away\"]\n\nWhile the group were excellent vocalists, there were two main reasons that Adler wanted to sign them. The first was that he found Michelle Phillips extremely attractive, and the second is a song that John and Michelle had written which he thought might be very suitable for McGuire's album.\n\nMost people who knew John Phillips think of \"California Dreamin'\" as a solo composition, and he would later claim that he gave Michelle fifty percent just for transcribing his lyric, saying he got inspired in the middle of the night, woke her up, and got her to write the song down as he came up with it. But Michelle, who is a credited co-writer on the song, has been very insistent that she wrote the lyrics to the second verse, and that it's about her own real experiences, saying that she would often go into churches and light candles even though she was \"at best an agnostic, and possibly an atheist\" in her words, and this would annoy John, who had also been raised Catholic, but who had become aggressively opposed to expressions of religion, rather than still having nostalgia for the aesthetics of the church as Michelle did.\n\nThey were out walking on a particularly cold winter's day in 1963, and Michelle wanted to go into St Patrick's Cathedral and John very much did not want to. A couple of nights later, John woke her up, having written the first verse of the song, starting \"All the leaves are brown and the sky is grey/I went for a walk on a winter's day\", and insisting she collaborate with him. She liked the song, and came up with the lines \"Stopped into a church, I passed along the way/I got down on my knees and I pretend to pray/The preacher likes the cold, he knows I'm going to stay\", which John would later apparently dislike, but which stayed in the song.\n\nMost sources I've seen for the recording of \"California Dreamin'\" say that the lineup of musicians was the standard set of players who had played on McGuire's other records, with the addition of John Phillips on twelve-string guitar -- P.F. Sloan on guitar and harmonica, Joe Osborn on bass, Larry Knechtel on keyboards, and Hal Blaine on drums, but for some reason Stephen McParland's book on Sloan has Bones Howe down as playing drums on the track while engineering -- a detail so weird, and from such a respectable researcher, that I have to wonder if it might be true.\n\nIn his autobiography, Sloan claims to have rewritten the chord sequence to \"California Dreamin'\". He says \"Barry Mann had unintentionally showed me a suspended chord back at Screen Gems. I was so impressed by this beautiful, simple chord that I called Brian Wilson and played it for him over the phone. The next thing I knew, Brian had written ‘Don’t Worry Baby,’ which had within it a number suspended chords. And then the chord heard ’round the world, two months later, was the opening suspended chord of ‘A Hard Day’s Night.’\n\nI used these chords throughout ‘California Dreamin’,’ and more specifically as a bridge to get back and forth from the verse to the chorus.\"\n\nNow, nobody else corroborates this story, and both Brian Wilson and John Phillips had the kind of background in modern harmony that means they would have been very aware of suspended chords before either ever encountered Sloan, but I thought I should mention it.\n\nRather more plausible is Sloan's other claim, that he came up with the intro to the song. According to Sloan, he was inspired by \"Walk Don't Run\" by the Ventures:\n\n[Excerpt: The Ventures, \"Walk Don't Run\"]\n\nAnd you can easily see how this:\n\n[plays \"Walk Don't Run\"]\n\nCan lead to this:\n\n[plays \"California Dreamin'\"]\n\nAnd I'm fairly certain that if that was the inspiration, it was Sloan who was the one who thought it up. John Phillips had been paying no attention to the world of surf music when \"Walk Don't Run\" had been a hit -- that had been at the point when he was very firmly in the folk world, while Sloan of course had been recording \"Tell 'Em I'm Surfin'\", and it had been his job to know surf music intimately.\n\nSo Sloan's intro became the start of what was intended to be Barry McGuire's next single:\n\n[Excerpt: Barry McGuire, \"California Dreamin'\"]\n\nSloan also provided the harmonica solo on the track:\n\n[Excerpt: Barry McGuire, \"California Dreamin'\"]\n\nThe Mamas and the Papas -- the new name that was now given to the former New Journeymen, now they were a quartet -- were also signed to Dunhill as an act on their own, and recorded their own first single, \"Go Where You Wanna Go\", a song apparently written by John about Michelle, in late 1963, after she had briefly left him to have an affair with Russ Titelman, the record producer and songwriter, before coming back to him:\n\n[Excerpt: The Mamas and the Papas, \"Go Where You Wanna Go\"]\n\nBut while that was put out, they quickly decided to scrap it and go with another song. The \"Go Where You Wanna Go\" single was pulled after only selling a handful of copies, though its commercial potential was later proved when in 1967 a new vocal group, the 5th Dimension, released a soundalike version as their second single. The track was produced by Lou Adler's client Johnny Rivers, and used the exact same musicians as the Mamas and the Papas version, with the exception of Phillips. It became their first hit, reaching number sixteen on the charts:\n\n[Excerpt: The 5th Dimension, \"Go Where You Wanna Go\"]\n\nThe reason the Mamas and the Papas version of \"Go Where You Wanna Go\" was pulled was because everyone became convinced that their first single should instead be their own version of \"California Dreamin'\". This is the exact same track as McGuire's track, with just two changes. The first is that McGuire's lead vocal was replaced with Denny Doherty:\n\n[Excerpt: The Mamas and the Papas, \"California Dreamin'\"]\n\nThough if you listen to the stereo mix of the song and isolate the left channel, you can hear McGuire singing the lead on the first line, and occasional leakage from him elsewhere on the backing vocal track:\n\n[Excerpt: The Mamas and the Papas, \"California Dreamin'\"]\n\nThe other change made was to replace Sloan's harmonica solo with an alto flute solo by Bud Shank, a jazz musician who we heard about in the episode on \"Light My Fire\", when he collaborated with Ravi Shankar on \"Improvisations on the Theme  From Pather Panchali\":\n\n[Excerpt: Ravi Shankar, \"Improvisation on the Theme From Pather Panchali\"]\n\nShank was working on another session in Western Studios, where they were recording the Mamas and Papas track, and Bones Howe approached him while he was packing his instrument and asked if he'd be interested in doing another session. Shank agreed, though the track caused problems for him.\n\nAccording to Shank \"What had happened was that when they had made the original backing track, they had apparently not lined it up with anything with firm pitch; it was only guitars, and it was in the cracks -- really in the cracks. I listened to the song enough to learn it, then I pulled the head joint out of my alto flute about an inch, and played it up half a step, and somehow or other we lined it up, pitch-wise. It  sounded kinda strange, and it really blew my mind, but that was because my fingers were going in spots where they normally wouldn't go.\"\n\nAccording to Lou Adler, the flute solo is spliced together from two takes, at the point where the solo goes up an octave:\n\n[Excerpt: The Mamas and the Papas, \"California Dreamin'\"]\n\n\"California Dreamin'\" made the charts in January 1966, and eventually reached number four, but even though it didn't make number one it stayed on the charts so long that Cashbox magazine later listed it as the biggest hit of 1966. The follow-up, \"Monday Monday\", written by John Phillips alone, did reach number one:\n\n[Excerpt: The Mamas and the Papas, \"Monday Monday\"]\n\nThat also won the group a Grammy for Best Pop Performance by a Duo or Group with Vocal. It was also nominated for the Best Contemporary (Rock & Roll) Recording Grammy, but lost out there, as did the other nominees \"Last Train to Clarksville\", \"Good Vibrations\", \"Eleanor Rigby\", and \"Cherish\", to \"Winchester Cathedral\".\n\nThe group's first album, from which both those singles were taken, is generally considered the one on which John Phillips' reputation as a songwriter rests. Mark Volman of the Turtles said \"John was a really good songwriter who really hit his peak with one album. I mean, he wasn't like John Sebastian who wrote and wrote and was a working-class songwriter. John Phillips hit his stride one album. If you listen to that first album, If You Can Believe Your Eyes And Ears, it was John's one contribution. If you go to the next album, those songs were not as great. There were sporadic moments of good songwriting, but John Phillips' contribution to the landscape of musical history was on that one album\"\n\nEven there, only seven songs on the album were originals, with the other five being cover versions or, in the case of their version of \"You Baby\", a hit for the Turtles, they used a track that Sloan and Barri had recorded as a demo, onto which the group overdubbed new vocals.\n\nDuring the recording of the first album, the group were all living together, and getting on great. They made occasional live appearances -- their first performance as the Mamas and the Papas was a rather impromptu one at The Action, where the Mothers of Invention were the house band, and the Mamas and the Papas got up between their sets to do a performance with just the four voices and a twelve-string guitar, to a certain amount of confusion on the part of the audience. But for the most part they were just rehearsing and recording, and they got on great.\n\nBut that wasn't to last. There's an anecdote from Guy Webster, who photographed the group's first album cover: He said \"I said \"This'll probably be the last time where we get together like this where you'll want to shoot the cover...\" and they said \"What are you talking about? That's ridiculous!\" and I told them that it's just the nature of the business that little petty things come in and out of relationships in groups that are together, and after a while they don't even want to see you. I had photographed the Stones, and Brian Jones, who was a friend of mine, was kind of on the outs with the group, and nobody wanted to pose together. I'm telling this to the Mamas and the Papas, and they're like \"Yeah, right.\" Well, the next session, it was almost impossible to get the four of 'em together. That's how *fast* the insidiousness of the business started to splinter the group.\"\n\nThe thing that really caused problems, though, was when John found out about Michelle and Denny's relationship, which ended as soon as John found out. John was hurt because his wife had been having an affair, and Denny was hurt because the affair had ended, although both men took what one might call a \"Papas before Mamas\" approach and decided that it was Michelle's fault for being a temptress. Michelle moved out, but John and Denny stayed living together, bonding more closely over their shared blaming of the woman they both loved. Meanwhile Cass Elliot was hurt -- she was in love with Denny, and while that love was unrequited, Cass thought that Michelle could have literally any man she wanted, so why go for the man Cass was in love with?\n\nDoherty and John Phillips wrote \"I Saw Her Again\" about the affair, and it became the group's third single -- though Michelle always said that it was immensely cruel that they'd made her sing on the song:\n\n[Excerpt: The Mamas and the Papas, \"I Saw Her Again\"]\n\n\"I Saw Her Again\" is notable for one other reason as well. At one point, Denny Doherty came in at the wrong place, caught himself, and then came in at the right spot. Originally Bones Howe was going to edit out the mistake, but Lou Adler said to leave it in:\n\n[Excerpt: The Mamas and the Papas, \"I Saw Her Again\"]\n\nFor a while the group continued working together even though everything was strained, but while John and Michelle were split up, Michelle started having an affair with Gene Clark, formerly of the Byrds, who apparently later wrote \"Tried So Hard\" about their breakup:\n\n[Excerpt: Gene Clark, \"Tried So Hard\"]\n\nClark came to see one of the group's shows, which happened to be on Michelle's twenty-second birthday, June the fourth 1966, and sat in the front row, and Michelle sang at him the entire show. That was the last straw for John Phillips, who persuaded the rest of the group that they needed to sack Michelle. They sent her a letter reading:\n\n\"Dear Michelle,\n\nThis letter is to inform you that the undersigned no longer desire to record or perform with you in the future. Moreover, the undersigned desire to terminate any business relationship with you that may have heretofore existed. To the extent there may have been any agreement between us creating a partnership, the undersigned elect to terminate and dissolve any such partnership pursuant to California Corporation Code Section 15031(1)(b). This letter should not be construed as an admission that any such partnership exists.\n\nNothing contained in this letter should be construed as a waiver, abandonment, or relinquishment of any right or remedy which the undersigned, and each of them, may have against you. All such rights and remedies are expressly reserved.\n\nVery truly yours.\"\n\nMichelle was devastated, since this was basically her being cut out of the lives of everyone important to her. As she put it in her autobiography, \"since it was from the Mamas and the Papas, it was therefore from my husband, from my best friend, from my lover, from my manager, my label, and my attorney\". On her twenty-second birthday her entire emotional and professional support system had been taken away from her.\n\nAs a replacement, they got in Jill Gibson. Gibson had been Jan Berry's girlfriend, though they'd split up shortly before Jan's accident, and she'd had a bit of a recording career as a result of the connection -- we heard her earlier on \"Move On, Little Mustang\", and she also cowrote \"It's as Easy as 1,2,3\" with Don Altfeld, which was released as a Jan and Dean B-side but had Gibson singing lead:\n\n[Excerpt: Jan and Dean, \"It's As Easy as 1,2,3\"]\n\nGibson also looked quite like Michelle -- they had different jawlines, but there was a passing resemblance, especially from the distances concert audiences saw performers -- and she was dating Lou Adler. She could sing, she knew the material, and she was in.\n\nWork had already started on the second Mamas and Papas album, but Jill replaced Michelle's vocals on some, but not all, of the tracks. They'd even already taken a cover photo, so Guy Webster was called in to take a photo of Jill in exactly the same pose Michelle had been in, and paste her into the photo in Michelle's place.\n\nJill was in the group for three months, but while she was told it was a permanent position, almost from the start there seems to have been talk of getting Michelle back. John and Michelle had almost daily phone calls, which according to Michelle basically amounted to John saying that he wanted her back as his wife but he could no longer work with her, and her saying that she wanted to be back in the group but wasn't interested in getting back together with him.\n\nBut something was missing from the band's sound. Jill was a good singer -- by some accounts a better singer than Michelle -- but Michelle had a harsher, brassier, sound which contrasted well with Elliot and Doherty's voices. Michelle was the youngest of the group members, and the one who more than any of them was interested in rock and roll, and Lou Adler said of her \"I think she would have loved to have been a Ronette or one of the Shangri-Las\". Without that slight abrasive quality, the harmonies were missing something.\n\nEventually they reconciled, at least for a while, and Michelle was back in the marriage and the group, with Jill being given an undisclosed large sum of money as a payoff. Michelle then replaced some of Jill's vocals on the album, some of which had in turn been replacements for Michelle, and nobody is sure any more which songs have Michelle, which have Jill, which have both, and which have Cass Elliot overdubbing herself instead of either of them, though it's almost certain Jill is on about six of the twelve tracks, including \"Trip, Stumble, and Fall\", which John and Michelle had written together:\n\n[Excerpt: The Mamas and the Papas, \"Trip, Stumble, and Fall\"]\n\nAs well as the problems between John and Michelle, there were other problems starting with the second album. For the first album, the group had been living together for months beforehand and spending all their time together, so they knew the material -- and the material had been written around the group members' individual voices and shaped with them. Now the only time they saw each other was in the recording studio or on tour, and so they no longer had the chemistry they used  to, and nor did they have the familiarity with the material.\n\nEveryone was developing their own problems as well. Both John Phillips and Cass Elliot were heavy drug users, while Denny Doherty was becoming an alcoholic, and everyone talks about how they had to arrange sessions so that Doherty's vocals would be recorded during the window of time between him having drunk enough to loosen up and having drunk so much that he couldn't sing.\n\nAlso, John Phillips' stock of material had run dry, and they were so desperate for new material that when they were asked to guest on a TV show celebrating the songs of Rodgers and Hart they ended up using a song they recorded for the show on the album. Not only that, but they took another song from the show, \"Here in My Arms\":\n\n[Excerpt: The Mamas and the Papas, \"Here in My Arms\"]\n\nAnd turned it into an \"original\", \"No Salt on Her Tail\" -- John Phillips wrote new lyrics and melody to the existing track. To make the borrowing not quite so obvious, they got in organist Ray Manzarek, whose band The Doors were still unsigned at the time, to overdub a keyboard part:\n\n[Excerpt: The Mamas and the Papas, \"No Salt on Her Tail\"]\n\nAccording to Manzarek, Adler tried to just pay him twenty dollars for the session. Adler's response was \"I have no recollection of that. Boy, I doubt it. I have no memory of that. He remembers a lot of things about me.\"\n\nBut the lack of material wasn't too much of a problem. As Doherty would later say \"at that point, the momentum we'd created carried a lot of it. If we got one hit from each album, that was enough. One good single sold the album, and it didn't matter about the album cuts or whatever else was on the album.\"\n\nBut there were other problems happening too as the group moved into recording their third album. Cass Elliot was becoming increasingly distant from the rest of the group -- she got pregnant and wouldn't even tell the rest of them who the father was -- and she was constantly butting heads with John Phillips. Phillips thought of himself as the group's leader, and in his mind by being able to fire and rehire his own wife he had proved his dominance over the group. Michelle had been put firmly in her place by this and wasn't making waves, and Doherty was a naturally placid person. But while Elliot was hard-working, she insisted on knowing *why* certain things were being done -- she wouldn't take direction from Phillips without understanding his reasoning.\n\nAnd Phillips was becoming increasingly unwilling to accommodate that kind of thing. Between the problems in his marriage, his writer's block, and his worsening drug problems, he was becoming aggressive towards anyone he viewed as a challenge, even the musicians who'd been helping him make his hit records. Where previously he would ask P.F. Sloan to come up with his own guitar parts, now he was dictating them and shouting at Sloan when he suggested an idea. He would also sometimes add or drop bars during the recording, without realising he was doing so, and then scream at Hal Blaine for \"doing it wrong\" when Blaine played the part as written -- at one point Blaine actually almost came to blows with him, the only time in forty years as a studio musician that he came close to attacking an artist.\n\nThe third album, then, was stressful for everyone, though perhaps not as stressful as some of the stories about the group would later claim. Pretty much everyone involved would say that Cass Elliot was recording her parts for the album even up to the day she went into labour, but in fact her daughter wasn't born until two months after the record came out, though that's not to minimise how hard she had to work, being pregnant while making the album. And there are other stories about having to mic Denny Doherty up while he was lying flat on his back on top of a piano, too drunk to stand up, to get vocal takes.\n\nBut the album, the Mamas and the Papas Deliver, did produce two big hits. One was a song suggested by Michelle -- when the group had been looking for cover versions, she'd kept suggesting hits from her teenage years which the rest of the group didn't know, like \"I'm a Hog For You Baby\" by the Coasters, \"He's a Rebel\", and \"Will You Love Me Tomorrow?\"\n\nEventually she hit on a song which had been a hit in 1962 for the Shirelles:\n\n[Excerpt: The Shirelles, \"Dedicated to the One I Love\"]\n\nJohn came up with an arrangement of that, and it made number two on the charts, becoming the fifth of the group's six top five singles, and the only one with a lead from Michelle:\n\n[Excerpt: The Mamas and the Papas, \"Dedicated to the One I Love\"]\n\nThe sixth and final top five hit for the group, also on that album, was a song John and Michelle had written to explain the group's history to Lou Adler. The group had constantly been talking about all the folk-rock stars they'd known and been in bands with before any of them were successful, and \"Creeque Alley\" told the whole story:\n\n[Excerpt: The Mamas and the Papas, \"Creeque Alley\"]\n\nAfter the release of The Mamas and the Papas Deliver, John and Michelle took on a new project, one which would end up being one of the most important things they would ever do.\n\nJim Dickson, the manager of the Byrds, was in the process of splitting away from the band, but he had recently organised a rather big benefit concert featuring Hugh Masakela, the South African jazz trumpeter who had recently guested on the Byrds' single \"So You Want To Be A Rock 'n' Roll Star\":\n\n[Excerpt: The Byrds, \"So You Want to Be a Rock 'n' Roll Star\"]\n\nMasakela had enjoyed the benefit show, and had suggested to Dickson and his co-promoter Alan Pariser that they might want to put on another similar show. Masakela's initial idea was to do it in Mexico, but Dickson thought about the likely audience -- mostly American hippies -- and what would happen to several thousand long-haired drug users at the border between the two countries, and decided to do it closer to home. They decided that Monterey might be an option -- Monterey is a town in central California, about eighty miles south of San Francisco and about three hundred miles north of LA, and it already had an established and long-running annual jazz festival and a more recently established folk festival. Why not a pop festival? At least, that's the way Dickson told the story – the way Steve Stills would always tell the story, it had all been Stills' idea, and he'd suggested the whole thing, including the location, to Pariser.\n\nThey got in touch with Benny Shapiro, who ran the Monterey Folk Festival, to get some advice as to how to put something like that on in Monterey, and through him they booked the first act other than Masakela -- Shapiro was Ravi Shankar's West Coast promoter, and offered them Shankar's services for three thousand dollars. Shankar was at the time probably the single most admired musician among the hip crowd of musicians, and with him on board, they could get anyone they wanted.\n\nThe next people they asked were the Mamas and the Papas, and at that point everything changed. John Phillips and Lou Adler both fell *heavily* in love with the idea of doing a *big* pop festival, the first one devoted to pop music rather than jazz or folk. As it happened, it took so long to set up that Monterey would end up being the second pop festival, as the Fantasy Fair and Magic Mountain Music Festival near San Francisco happened just the week before, with several of the same acts. But Monterey, which took place over the weekend between the first two Beatles recording sessions for \"All You Need is Love\", became the model which all future rock and pop festivals would follow, and gets regarded by most as the start of the \"Summer of Love\".\n\nPhillips and Adler had a vision, and they quickly bought out the original promoters and took on the work themselves. They were going to make it a charity benefit, so none of the musicians would get paid for their appearances or for the film and live album they planned of the festival. Except Ravi Shankar, whose contract had already been signed, and who said that he wasn't going to work for free. But nobody *else* would be paid.\n\nJohn, Michelle, and Adler did most of the organisational work for the festival, with some help from Al Kooper and Derek Taylor, but they pulled together an advisory board of their friends in the music industry including Elliot, Lennon and McCartney, Andrew Oldham, Simon and Garfunkel, and Brian Wilson. Those people mostly did very little, with one exception we'll get to in a minute, but they all pitched in money to help pay for the festival's costs, and they also made suggestions of which artists to include. The Beatles and Oldham suggested the hot names from the British scene -- Eric Burdon and his New Animals, the Jimi Hendrix Experience, and the Who, the latter two of whom had not yet had any real success in the US -- and also suggested that Otis Redding, Lou Rawls, and Booker T and the MGs be included on the bill.\n\nMeanwhile the LA contingent were getting their own friends involved, and so as well as the Mamas and the Papas, the Beach Boys were booked to headline (though they pulled out for reasons we'll discuss in episode 153), and the Byrds and Buffalo Springfield were on the bill, as was the Dunhill act Johnny Rivers.\n\nBut if they were going to hold a festival near San Francisco, they also needed to get some of the local San Francisco bands on the bill. A huge music scene had sprung up there almost overnight, which we're going to look at in future episodes, and they would have to acknowledge that in some way.\n\nBut there was a problem. That scene had set itself up very consciously in opposition to the music coming out of LA, which was against everything they stood for -- it was Hollywood and plastic and commercial and made by big corporations. The San Francisco groups wouldn't even speak to any of the LA groups.\n\nSo Paul Simon was enlisted as an ambassador. He was neutral in the war between Northern and Southern California, as he was from New York, so he made the fraught trip into enemy territory, visiting the Grateful Dead in San Francisco, and coming back with their list of demands. The Grateful Dead, if they were going to do the show, wanted a day basically put aside for the San Francisco scene -- they wanted Big Brother and the Holding Company, Country Joe and the Fish, Quicksilver Messenger Service, and Jefferson Airplane all on, and all on the same day.\n\nAs it eventually worked out, all those acts did play, and all on the same day, but the Grateful Dead actually played the day after their San Francisco peers. But an agreement had been reached. And John Phillips had come up with a theme song for the event.\n\nAfter Scott McKenzie had left the Journeymen, his career had floundered. He had tried for a solo career, and had signed to Capitol records and recorded two singles for them, but tracks like his version of the old Webb Pierce country hit \"There Stands the Glass\" had not exactly set the world on fire:\n\n[Excerpt: Scott McKenzie, \"There Stands the Glass\"]\n\nCapitol had dropped him, and then he'd signed with Epic records, and John Phillips had written \"No, No, No, No\" for him, which Adler had produced:\n\n[Excerpt: Scott McKenzie, \"No, No, No, No\"]\n\nBy 1967 McKenzie was despondent. He was staying with the Phillipses in their house, and one day Paul McCartney had come to visit. McKenzie had given McCartney and Mal Evans a lift to the airport, and McCartney had asked him what he did for a living. McKenzie said he was a singer, and McCartney asked what kind of things he sang... and McKenzie realised he didn't know what kind of things he sang. John Phillips told him they would have to find something for him to sing, so then he would know.\n\nBy this point, Lou Adler had sold his shares in Dunhill to his business partners, and had started up a new label, Ode, with McKenzie as his first signing. He got John Phillips to write a song for McKenzie to sing, and John decided to make the song a message to anyone who was going to be travelling to the festival, to tell them that they should be cool and relaxed and not cause problems for anyone. The recording was arranged hastily and in secret -- they thought that Cass and Denny might complain about Phillips giving hits away to other artists, and they also worried that Adler's erstwhile partners might cause problems for John writing a song for anyone not on Dunhill. The song was released as a single a month before the festival, and became a worldwide hit, going top five in the USA and making number one in the UK:\n\n[Excerpt: Scott McKenzie, \"San Francisco (Wear Flowers in Your Hair)\"]\n\nThe Monterey International Pop Festival is something we're going to be coming back to time and again in the next few months, which is why I placed this episode at this point in the narrative, at the start of a new year of stories. In many ways it is *the* pivotal moment in the transition between pop and rock music. It was referred to as a pop festival, and at this point \"rock and roll\" was not a term that most successful bands would have used for themselves -- rock and roll either meant music from the fifties like Elvis and Gene Vincent, or it meant girl groups and soul singers -- the Supremes were a rock and roll group. Bands like the Beatles or the Rolling Stones would never have referred to themselves as rock bands at this point -- they were pop groups or R&B bands, not rock bands.\n\nBut Monterey was where that started to change, and it was where the narrative of what artists mattered to the hippie generation was really set. And in the war for the minds of the hippie generation, San Francisco beat LA so completely that it distorted the whole of rock history for decades, something that wasn't helped with the dawn of rock journalism happening around the same time and being dominated by the San Francisco partisans at Rolling Stone.\n\nThis even though right up until the last minute it was entirely possible that none of the San Francisco bands would even play. Many of them were being managed by Bob Dylan's manager Albert Grossman, who was well known for his extreme approach to management and brinksmanship, and he was attempting to renegotiate some of the contracts even as bands were going on stage.\n\nWe're going to look at many of these performances in greater detail in future, as we deal with many of these bands and artists in their own episodes, but the San Francisco bands were young and hungry and playing to the biggest audiences they'd ever played to, and so bands like Jefferson Airplane gave tight, convincing performances:\n\n[Excerpt: Jefferson Airplane, \"Somebody to Love\"]\n\nWhile the unknown band Big Brother and the Holding Company, with their lead singer Janis Joplin, became many people's highlight of the show with their version of Big Mama Thornton's \"Ball and Chain\":\n\n[Excerpt: Big Brother and the Holding Company, \"Ball and Chain\"]\n\nWhile the San Francisco bands blew everyone away, LA was much, much, less well represented. The Beach Boys had dropped out, and they'd decided not to invite the Monkees, even though they were the biggest band in the world at that point, because even the “LA plastic Hollywood types” thought they were above that kind of thing -- though both Micky Dolenz and Peter Tork came along anyway, and Tork introduced his friends The Buffalo Springfield. So the two most commercial acts from LA at the time weren't there.\n\nAs for the up-and-coming acts, Love were invited but Arthur Lee wouldn't travel out of LA, the Mothers of Invention were playing a month-long residency in New York on the other side of the continent, and Captain Beefheart and the Magic Band had to pull out shortly before the event after their guitarist, Ry Cooder, quit.  And I've seen multiple explanations for why the Doors weren't going to be playing, with some of the band members, notably Manzarek, saying it was because Lou Adler resented them for becoming successful after he'd turned them down, but other explanations I've seen include that the band were dealing with various small life emergencies like minor surgery and family members having kids, and that they were booked to play in New York\n\nSo that left the established but not absolute top-tier LA acts. The Association, who opened the whole festival, actually gave one of the tightest performances of the weekend:\n\n[Excerpt: The Association, \"Along Comes Mary (live at Monterey Pop)\"]\n\nUnfortunately, while they did a great set musically, they looked out of place. They had the same kind of suits, haircuts, and stage formation as the Beatles or Stones had in 1965. In June 1967 a band looking like that might as well have been from the Medieval era, and their performance wasn't even used in the film of the event.\n\nJohnny Rivers was wildly out of place with his set of fifties covers, and Buffalo Springfield were missing their guitarist, Neil Young. David Crosby sat in with them in his place, and while they managed just about to get through the set, they generally considered it an embarrassment:\n\n[Excerpt: Buffalo Springfield, \"Nowadays Clancy Can't Even Sing (live at Monterey)\"]\n\n71) And Crosby also dominated the Byrds' set, where they refused to play any of their old hits, and instead did a set that sounds almost garage-punk:\n\n[Excerpt: The Byrds, \"Hey Joe (live at Monterey)\"]\n\n72) Even though it had been organised entirely by LA people, the Monterey International Pop Festival seemed almost specifically designed to prove the San Francisco musicians right. On the evidence of that weekend, the LA groups were a bunch of posers who couldn't really play and relied on clever record production to make themselves seem half-decent, and that's largely how the LA scene went down in the first drafts of rock history as a result.\n\nBut the real highlights of the festival weren't from either of the warring Californian scenes. Rather they were the acts that had been suggested by the Beatles and Oldham. Otis Redding's performance was the set that brought him to the attention of the white rock audience, who had previously been largely unaware of how astonishing he was:\n\n[Excerpt: Otis Redding, \"Respect\"]\n\nAnd while the Grateful Dead had been seen as the one band that they *must* get, half the oral histories of the event literally forget that they were there, because they were on between the two biggest breakout stars of the show. At this point, while the Who were in the very top tier of bands in the UK, with seven top ten hits, and were regarded by their peers as the most exciting live act around, they'd only had one top thirty hit in the US, with their most recent single, \"Happy Jack\", which was not regarded as their best work and which had only got to number twenty-four:\n\n[Excerpt: The Who, \"Happy Jack\"]\n\nThe Who's show was devastating, with a psychedelic light show, Keith Moon setting off smoke bombs, and at the end of the set Pete Townshend smashing his guitar to pieces while Moon smashed his drumkit up -- as technicians busily ran around the stage trying to limit the damage being done to the festival's equipment. But as well as the pyrotechnics there was also actual musical quality to their performance:\n\n[Excerpt: The Who, \"My Generation (live at Monterey)\"]\n\nAfter that, the Who went on a fifty-five date US tour as the support act to Herman's Hermits. The other breakout Monterey act, the Jimi Hendrix Experience, also toured on a similarly incongruous bill after Micky Dolenz saw them at the festival and invited them to be the Monkees' support act. The Grateful Dead, stuck between those two powerhouse live acts, gave what they would later claim was one of their worst performances:\n\n[Excerpt: Jerry Garcia talking about Monterey ]\n\nThough the one song from their performance that was filmed, a version of \"Viola Lee Blues\" that's in the special features of the Critierion Blu-Ray edition of the film of the festival, is perfectly fine, if hardly life-changing:\n\n[Excerpt: The Grateful Dead, \"Viola Lee Blues (live at Monterey)\"]\n\nAnd then the Jimi Hendrix Experience came on, and Hendrix was determined to overshadow the Who. Hendrix had had three top ten hit singles in the UK in the previous six months, but had not yet charted in the US -- a double-A-side version of \"Purple Haze\" and \"The Wind Cries Mary\" was released the same weekend as the festival, presumably in the hopes of capitalising on any publicity from it, but it only reached the heady heights of number sixty-seven in the charts. But the group's performance at Monterey was one that nobody would ever forget. It had already been set up by David Crosby the day before, when he'd introduced the Byrds' version of \"Hey Joe\" by talking about Love, the Leaves, Tim Rose, and \"a cat who's gonna perform here, Jimi Hendrix\".\n\nHendrix was still so new to songwriting that half the Experience's set was cover versions, including of course their own version of \"Hey Joe\":\n\n[Excerpt: The Jimi Hendrix Experience, \"Hey Joe (live at Monterey)\"]\n\nAnd the closing song, a version of \"Wild Thing\":\n\n[Excerpt: The Jimi Hendrix Experience, \"Wild Thing (live at Monterey)\"]\n\nHendrix first played the song, then while the other musicians continued playing he humped his guitar, and then for a finale and a way to one-up Townshend smashing his guitar took a can of lighter fluid, held it out at approximately penis height, squirted the fluid all over his guitar, then set it on fire before smashing it. The sound you hear here is the sound of the crackling flames being picked up by the guitar's pickups and feeding back through the amps:\n\n[Excerpt: The Jimi Hendrix Experience, \"Wild Thing (live at Monterey)\"]\n\nWatching the footage of that performance, large chunks of the audience don't seem to know what's going on, but Michelle Phillips, Cass Elliot, and Micky Dolenz all seem to be in states of utter ecstasy watching him. One person who wasn't so ecstatic was Ravi Shankar. He'd thought Simon and Garfunkel were extremely good on the first night, and he'd been very impressed by both Otis Redding and Janis Joplin, who he thought \"sang from her guts, like some of the olden-days jazz singers\". But to a man to whom music was holy, smashing a musical instrument was sacrilege.\n\nAnd after Hendrix came the closing performance of the show, and what was meant to be the highlight for everyone who had organised it -- the Mamas and the Papas, with Scott McKenzie guesting to sing \"San Francisco\".\n\nBut there was a problem. The group hadn't rehearsed together in months. John and Michelle had been busy organising the festival, Cass had been busy with her newborn baby, and Denny had been so depressed that John and Michelle had got back together that he'd basically spent three months inside a bottle, drunk out of his mind and not even really registering that he was meant to be performing at the festival until the final day, when he flew into LA from the Virgin Islands, where he'd been for those three months. He also didn't have any coherent idea of the geography of California, despite having lived there for a couple of years, and vaguely thought that Monterey was \"just down the coast from Santa Barbara\" and was horrified to be told by his friend that it would be an eight-hour drive and they would have to leave *right then*.\n\nDepending on which version of the story you believe, he either arrived *right* before the group were due on stage or just before Hendrix's set -- either way, there was no time for even a cursory rehearsal before the group went on stage, with Joe Osborn, Larry Knechtel, touring guitarist Eric Horn, and their touring drummer \"Fast\" Eddie Hoh, and performed what was meant to be the great climax of the festival, but instead turned out to be the great anticlimax of it, and of the Mamas and the Papas' career. To quote from John Phillips' autobiography:\n\n\"We ran out on stage and did our songs completely out of tune from start to finish. In parts, we weren't even close. We hadn't sung in months. We hadn't rehearsed at Monterey because Denny wasn't around. Cass had been partying all weekend. Mitch and I were too busy at the site to worry about harmonies and arrangements. I was fried on speed. I had been up for most of the past week.\"\n\nEveryone agrees that the performance was possibly the worst the group ever gave, and they were the worst act on the festival, though listening to the recordings it doesn't sound *that* much more incompetent than many of the other performers, though there are some excruciatingly poor harmonies at points:\n\n[Excerpt: The Mamas and the Papas, \"Monday Monday (live at Monterey)\"]\n\nAs for Scott McKenzie, as John Phillips put it \"He was so off and out of it that he sang in a chord sequence that was the reverse of what the band were playing\":\n\n[Excerpt: Scott McKenzie and the Mamas and the Papas, \"San Francisco (live at Monterey)\"]\n\nThough I have to say that to my ears, the problem sounds more with the twelve-string guitar player, one John Phillips, than with McKenzie's singing.\n\nMonterey was essentially the end of the careers of both McKenzie and the Mamas and the Papas. McKenzie's follow-up single, \"Like an Old-Time Movie\", written by John Phillips, only made number twenty-four:\n\n[Excerpt: Scott McKenzie, \"Like an Old-Time Movie\"]\n\nHe recorded one more album, three years later, this time made up of songs he'd written himself, but never had another hit, and he retired from music for a time in 1970.\n\nMeanwhile the Mamas and the Papas struggled on for a while longer, and started work on a fourth album. But halfway through recording, they made a promotional trip to the UK, where Cass got arrested for reasons that are unclear, but seem to have been connected to some criminal associates of her then-partner. She was let go the next day, but had a traumatic time, including being strip-searched, and was telling someone about her horrific ordeal when John Phillips came up to her and started correcting her about her own experiences.\n\nThat was the last straw. She was not putting up with John Phillips for one second more, and she quit the group. She did come back long enough to finish up the album, which included a version of \"Dream a Little Dream of Me\", a song suggested by Michelle, who had known one of the song's writers when she was a kid. It was released as a single, but credited to \"Mama Cass with the Mamas and the Papas\" in the US, and just to \"Mama Cass\" in the UK:\n\n[Excerpt: Mama Cass, \"Dream a Little Dream of Me\"]\n\nThat made the top twenty, significantly outperforming the last few Mamas and Papas singles, and Elliot had a relatively successful solo career, with two more top thirty hits, both written by Mann and Weil, \"It's Getting Better\" and \"Make Your Own Kind of Music\":\n\n[Excerpt: Cass Elliot, \"Make Your Own Kind of Music\"]\n\nAfter a rough first attempt at a Las Vegas residency -- she lost a hundred pounds in weight, but as a result developed gastric and throat problems, and had to cancel almost straight away -- she became a beloved entertainer, appearing in several TV specials, and doing residencies in Las Vegas and the London Palladium.\n\nThe other group members all released solo records too, but with no success. Probably the best of them is Denny Doherty's version of the Millennium's \"To Claudia on Thursday\":\n\n[Excerpt: Denny Doherty, \"To Claudia on Thursday\"]\n\nJohn and Michelle's marriage fell apart for good, and John's drug use became much, much, worse. Eventually, the new owners of the group's record label sued them for a million dollars, and to settle the lawsuit they recorded a contractual obligation album, People Like Us, three years after they'd split, but they didn't get together for the recordings, just overdubbing parts as and when necessary.\n\nIn 1974, while staying in a flat owned by Harry Nilsson, Cass Elliot died of a heart attack, aged only thirty-two. She had just completed a residency at the London Palladium, for which she had once again lost a lot of weight after having put all the weight from her earlier attempt at weight loss back on. It's well known that repeated crash dieting, extreme weight loss, and yo-yoing weight can cause heart trouble.\n\nThat was the end of the Mamas and the Papas as the original band, but not quite the end for the group altogether. While Michelle Phillips went on to a successful acting career, and still acts today, John sank into depression and spent time in prison on drugs charges -- he would remain an addict for the rest of his life. As an attempt to get himself together after his prison time, he formed \"the New Mamas and Papas\", initially with a lineup of himself, Scott McKenzie, Denny Doherty, his daughter Mackenzie Phillips, and replacing Cass Elliot Elaine \"Spanky\" McFarlane of Spanky And Our Gang, and they started playing the nostalgia circuit:\n\n[Excerpt: The New Mamas and Papas, \"California Dreamin'\"]\n\nAt the same time, the Beach Boys were in a career slump, putting out odd one-off flop singles for film soundtracks, and often finding it difficult to get record contracts. One of the few recordings they made in the early eighties was for a cassette-only release, only sold through Radio Shack, put together by Terry Melcher and Daryl Dragon of the Captain & Tennille. The cassette contained new recordings by The Association, Paul Revere and the Raiders, and the Rip Chords, plus solo tracks by Mike Love and duets between Love and Dean Torrence, plus the Beach Boys' version of \"California Dreamin\", produced by Melcher, featuring a guest spot by Roger McGuinn on guitar.\n\nUnsurprisingly, the cassette didn't exactly set the music world alight, but a couple of years later the Beach Boys were putting out a new greatest hits album, and a slightly remixed version of \"California Dreamin'\" was stuck on that and put out as a single, and while it only made the lower reaches of the Hot One Hundred, it made the Adult Contemporary top ten, thanks in large part to a video which got a lot of play on MTV, featuring the Beach Boys, McGuinn, and cameos from Michelle and John, the latter as a saxophone-playing priest:\n\n[Excerpt: The Beach Boys, \"California Dreamin'\"]\n\nAt this point, there were lots of connections between the Beach Boys, Melcher, and the Mamas and the Papas, including that John and Michelle's daughter Chynna was a school friend of Brian Wilson's daughters Carnie and Wendy, and would soon form her own vocal group with them, and at some point Terry Melcher got hold of a demo that John Phillips had recorded, of a song he and Scott McKenzie had written together:\n\n[Excerpt: John Phillips, \"Kokomo\"]\n\nMelcher and Mike Love rewrote the lyric extensively, dropped Phillips' original middle eight altogether, and added a new chorus, listing place-names in the same way the Beach Boys had for \"California Girls\" and \"Surfin' USA\". It was put out as one of those throwaway film soundtrack singles, for a forgettable Tom Cruise film, Cocktail, but rather remarkably, thanks to a video featuring shots from the film intercut with the Beach Boys performing on a beach, it became the Beach Boys' first number one in twenty-two years, and their only one without any participation from Brian Wilson:\n\n[Excerpt: The Beach Boys, \"Kokomo\"]\n\nFor the rest of the eighties and nineties, the New Mamas and Papas toured with a revolving lineup. There would be various female singers, and usually at least one, sometimes two, of John Phillips, Denny Doherty, Scott McKenzie, and Barry McGuire, depending on who had fallen out with who, and who was in rehab. The New Mamas and Papas ended with Phillips' death in 2000, and Denny Doherty died in 2007, while Scott McKenzie died in 2012.\n\nBarry McGuire is still alive, and is now a contemporary Christian performer. His most recent album seems to have come out in 2000 -- it's called Eve of Destruction: 20 Inspirational Classics -- and he also rerecorded \"Eve of Destruction\" as \"Eve 2012\":\n\n[Excerpt: Barry McGuire, \"Eve 2012\"]\n\nAs for P.F. Sloan, he retired from the music business in 1972, for reasons he variously gave as being ill (he would suffer from chronic illnesses for decades before apparently being cured by a faith healer), being tired of making music, and having his life threatened by the owners of Dunhill Records. He infrequently gave interviews and made records over the next few decades, before recovering his strength enough to work on what he considered his magnum opus. He saw a performance of Beethoven's music and became fascinated at what he saw as the parallels between Beethoven and himself -- he very much saw Beethoven as the P.F. Sloan of his time. He immediately started work on a musical, Louis! Louis! (Louis is the French equivalent of Ludwig, Beethoven's first name), which eventually became his 2015 album, My Beethoven, a concept album that was equal parts autobiography and biography of Beethoven:\n\n[Excerpt: P.F. Sloan, \"This Love\"]\n\nBut by this point, Sloan was more myth than man. And this was largely because of Jimmy Webb. Webb had, in 1970, decided that he wasn't going to just be a songwriter for other people, but that he was going to be an artist in his own right, and put out a solo album. And one of the people who inspired him to do that was Sloan, who he thought of as one of the first of the great commercial songwriters to pursue his own artistic path. And as such, he wrote a tribute to him, a song called \"P.F. Sloan\".\n\nThe problem was, Sloan had already pretty much vanished from the scene -- as the song's lyrics said, starting \"I have been seeking P.F. Sloan, but no-one knows where he has gone\". Many people listening to the song assumed that Sloan was a character Webb had made up -- and Sloan would later claim that he and Webb had fallen out in the seventies and as a result Webb had gone around claiming just that, rather than acknowledging that Sloan was a real person, though I've not seen any interviews where Webb did that and have seen several where he very explicitly credits the real man as an inspiration.\n\nTo make matters worse, in the eighties, Eugene Landy, the abusive psychotherapist who used his position with his patient Brian Wilson to get himself credited as a co-writer and producer on many of Wilson's songs, insisted in many interviews that *he* was P.F. Sloan, claiming Sloan was a pseudonym and he had written all those songs. With Sloan out of the industry, many people believed him, at least until the extent of his other lies became clear.\n\nSo while Sloan did write his own autobiography, What's Exactly the Matter With Me? in 2014, by the time of his death, to most of those who knew his name at all, P.F. Sloan wasn't a man, a songwriter who had written for the Turtles and Jan and Dean and had a big folk-rock hit. He was an idea -- the idea of songwriting artistry, of inspiration, and of someone who would take his own path rather than submit to commercial pressures. The idea of musical innovation, of endless possibilities, and of being young in the mid-sixties, when it seemed the young people might still make a better world.\n\nThe truth? Well, that didn't matter. What mattered, always, was the song:\n\n[Excerpt: Jimmy Webb, \"P.F. Sloan\" into theme music]",
  "enclosure": "",
  "itunes:summary": "We start season four of A History of Rock Music in Five Hundred Songs with an extra-long look at \"San Francisco\" by Scott McKenzie, and at the Monterey Pop Festival, and the careers of the Mamas and the Papas and P.F. Sloan.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Up, Up, and Away\" by the 5th Dimension.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nErrata: An incorrect version of the file was previously uploaded, with the wrong section edited in at approximately 57 minutes. This was fixed about three hours after uploading, but some streaming services may have cached the wrong file.\n\nAlso I say that John Phillips wrote \"No, No, No, No\". I got this from an interview with McKenzie, but he must have been misremembering -- the song is a cover version of \"La Poupee Qui Fait Non\" by Michel Polnareff, with English-language lyrics by Geoff Stephens\n\n\n\nResources\n\nAs usual, all the songs excerpted in the podcast can be heard in full at Mixcloud.\n\nScott McKenzie's first album is available here.\n\nThere are many compilations of the Mamas and the Papas' music, but sadly none that are in print in the UK have the original mono mixes. This set is about as good as you're going to find, though, for the stereo versions.\n\nInformation on the Mamas and the Papas came from Go Where You Wanna Go: The Oral History of The Mamas and the Papas by Matthew Greenwald, California Dreamin': The True Story Of The Mamas and Papas by Michelle Phillips, and Papa John by John Phillips and Jim Jerome.\n\nInformation on P.F. Sloan came from PF - TRAVELLING BAREFOOT ON A ROCKY ROAD by Stephen McParland and What's Exactly the Matter With Me? by P.F. Sloan and S.E. Feinberg.\n\nThe film of the Monterey Pop Festival is available on this Criterion Blu-Ray set. Sadly the CD of the performances seems to be deleted.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nWelcome to season four of A History of Rock Music in Five Hundred Songs. It's good to be back.\n\nBefore we start this episode, I just want to say one thing. I get a lot of credit at times for the way I don't shy away from dealing with the more unsavoury elements of the people being covered in my podcast -- particularly the more awful men. But as I said very early on, I only cover those aspects of their life when they're relevant to the music, because this is a music podcast and not a true crime podcast. But also I worry that in some cases this might mean I'm giving a false impression of some people. In the case of this episode, one of the central figures is John Phillips of the Mamas and the Papas. Now, Phillips has posthumously been accused of some truly monstrous acts, the kind of thing that is truly unforgivable, and I believe those accusations. But those acts didn't take place during the time period covered by most of this episode, so I won't be covering them here -- but they're easily googlable if you want to know. I thought it best to get that out of the way at the start, so no-one's either anxiously waiting for the penny to drop or upset that I didn't acknowledge the elephant in the room.\n\nSeparately, this episode will have some discussion of fatphobia and diet culture, and of a death that is at least in part attributable to those things. Those of you affected by that may want to skip this one or read the transcript. There are also some mentions of drug addiction and alcoholism.\n\nAnyway, on with the show.\n\nOne of the things that causes problems with rock history is the tendency of people to have selective memories, and that's never more true than when it comes to the Summer of Love, summer of 1967. In the mythology that's built up around it, tha",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "We start season four of A History of Rock Music in Five Hundred Songs with an extra-long look at \"San Francisco\" by Scott McKenzie, and at the Monterey Pop Festival, and the careers of the Mamas and the Papas and P.F. Sloan.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Up, Up, and Away\" by the 5th Dimension.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nErrata: An incorrect version of the file was previously uploaded, with the wrong section edited in at approximately 57 minutes. This was fixed about three hours after uploading, but some streaming services may have cached the wrong file.\n\nAlso I say that John Phillips wrote \"No, No, No, No\". I got this from an interview with McKenzie, but ",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}