{
  "title": "Special Episode: Sanctions, Bonds and Currency Markets",
  "description": "<p>With multiple countries now imposing sanctions, investors in Russian government bonds and currencies will need to consider their options as the risk of default rises.</p><p><br></p><p><em>Important note regarding economic sanctions. This research references country/ies which are generally the subject of comprehensive or selective sanctions programs administered or enforced by the U.S. Department of the Treasury’s Office of Foreign Assets Control (“OFAC”), the European Union and/or by other countries and multi-national bodies. Any references in this report to entities, debt or equity instruments, projects or persons that may be covered by such sanctions are strictly informational, and should not be read as recommending or advising as to any investment activities in relation to such entities, instruments or projects. Users of this report are solely responsible for ensuring that their investment activities in relation to any sanctioned country/ies are carried out in compliance with applicable sanctions.</em></p><p><br></p><p>-----Transcript-----</p><p><br></p><p><strong>James Lord: </strong>Welcome to Thoughts on the Market. I'm James Lord, Head of FX and EM strategy.&nbsp;</p><p><br></p><p><strong>Simon Waever: </strong>And I'm Simon Waever, Global Head of Sovereign Credit Strategy.&nbsp;</p><p><br></p><p><strong>James Lord: </strong>And on this special episode of Thoughts on the Market, we'll be discussing the impact of recent sanctions on Russia for bonds and currency markets. It's Friday, March 11th at 1:00 p.m. in London.&nbsp;</p><p><br></p><p><strong>Simon Waever: </strong>and 8:00 a.m. in New York.&nbsp;</p><p><br></p><p><strong>James Lord: </strong>So, Simon, we've all been watching the recent events in Ukraine, which are truly tragic, and I think we've all been very saddened by everything that's happened. And it certainly feels a bit trite to be talking about the market implications of everything. But at the same time, there are huge economic and financial consequences from this invasion, and it has big implications for the whole world. So today, I think it would be great if we can provide a little bit of clarity on the impact for emerging markets. Simon, I want to start with Russia itself. The strong sanctions put in place have really had a big impact and increasing the likelihood that Russia could default on its debt. Can you walk us through where we stand on that debate and what the implications are?&nbsp;</p><p><br></p><p><strong>Simon Waever: </strong>That's right, it's had a huge impact already. So Russia's sovereign ratings have been downgraded all the way to Triple C and below, which is only just above default, and that's them having been investment grade just two weeks ago. If you look at the dollar denominated sovereign bonds, they're trading at around 20 cents on the dollar or below. But I think it all makes sense. The economic resilience needed to support an investment grade rating goes away when you remove a large part of the effect reserves, have sanctions on 80% of the banking sector, and with the economy likely to enter into a bigger recession, higher oil prices help, but just not enough. For now, the question is whether upcoming payments on the sovereign dollar bonds will be made. And I think it really comes down to two things. One, whether Russia wants to make the payments, so what we tend to call the willingness. And two whether US sanctions allow it, so the ability. Clarifications from the US Treasury suggests that beyond May 25th, payments cannot be made. So, either a missed payment happens on the first bond repayment after this, which is May 27th or Russia may also decide not to pay as soon as the next payment, which is on March 16th. And of course, the reason for Russia potentially not paying would be that they would want to conserve their foreign exchange. And actually, we've already had some issues on the local currency government bonds, so the ones denominated in Russian ruble. James, do you want to go over what those issues have been?&nbsp;</p><p><br></p><p><strong>James Lord: </strong>That's absolutely right. Already, foreigners do not appear to have received interest payments on their holdings of local currency government bonds. There was one due at the beginning of March, and it looks as though, although the Russian government has paid the interest on that bond, the institutions that are then supposed to transfer the interest payments onto the funds of the various bondholders haven't done so for at least the foreign holders of that bond. Does that count as default? Well, I mean, on the one hand, the government can claim to have paid, but at the same time, some bondholders clearly haven't received any money. There's also another interest payment due in the last week of March, so we'll see if anything changes with that payment. But in the end, there isn't a huge amount that bondholders can really do about it, since these are local currency bonds and they're governed under local law. There isn't really much in the way of legal recourse, and there isn't really much insurance that investors can take out to protect themselves. The situation is a bit different for Russian government bonds that are denominated in US dollars, though. So I'd like to dig a little bit more into what happens if Russia defaults on those bonds. For listeners that are unfamiliar, investors will sometimes take out insurance policies called CDSs or credit default swaps just for this type of situation, and they've been quite a lot of headlines around this. So, Simon, I'd be curious if you could walk us through the implications of default there.&nbsp;</p><p><br></p><p><strong>Simon Waever:</strong> So it's like two different products, right? So you have the bonds there, it can take a long time to recover some of the lost value. I mean, either you actually get the economic recovery and there's no default or you then go to a debt restructuring or litigation. But then on the other hand, you have the CDS contracts, they're going to pay out within a few weeks of the missed bond payment. But it's not unusual to find disagreement on exactly what that payment will look like. And that payment is, we call it, the recovery value perhaps is a bit like the uncertainty that sometimes happens when standard insurance needs to pay out. But if we start with the facts, if there is a missed payment on any of the upcoming dollar or euro denominated bonds, then CDS will trigger. Local currency bonds do not count and the sovereign rating does not matter either. So far I think it's clear, the uncertainty has been around what bonds can actually be delivered into the contract, as that's what determines the recovery value. As it stands, sanctions do allow secondary trading of the bonds. There have been some issues around settlement, but hopefully that can be resolved by the time an auction comes around. The main question is then where that recovery rate will end up, and I would say that given the amount of selling I think is yet to come I wouldn't be surprised if it ends up being among the lower recovery rates we've seen in E.M sovereign CDS.&nbsp;</p><p><br></p><p><strong>James Lord:</strong> Yeah, that makes sense on the recovery rates and the CDs. But I mean, clearly, if Russia defaults, there could be some big implications for the rest of emerging markets as well. And even if they don't default, I mean, there's been a lot of spill over into other asset classes and other emerging markets. How do you think about that?&nbsp;</p><p><br></p><p><strong>Simon Waever:</strong> So I try to think of it in two ways, and I would expect both to continue if we do not see a de-escalation in Ukraine. So first, it really impacts those countries physically close to Russia and Ukraine and those then with trade linkages, which mainly comes with agriculture, energy, tourism and remittances. And that points you towards Eastern Europe, Turkey and Egypt, for instance. Secondly, if we also then see this continued weaker risk backdrop, it would then impact those countries where investor positioning is heavier. But enough on sovereign credit, I wanted to cover currencies, too. The Russian central bank was sanctioned. What do you think that means for EM currencies?&nbsp;</p><p><br></p><p><strong>James Lord:</strong> Absolutely. The sanctions against the central Bank of Russia were really quite dramatic and have understandably had a very big impact on the Russian exchange rate. The ruble’s really depreciated in value quite significantly in the last couple of weeks. I mean, during periods of market uncertainty, the central Bank of Russia would ordinarily sell its foreign exchange assets to buy Ruble to keep the currency under control. But now that's not really possible. It's led to a whole range of countermeasures from Russia to try and protect the currency, such as lifting interest rates from just under 10% to 20%. There have also been significant restrictions on the ability of local residents to move capital abroad or buy dollars, and on the ability of foreigners that hold assets in Russia to actually sell and take their money home. All of that's designed to protect the exchange rate and keep foreign exchange reserves on home soil. I think the willingness of the US to go down that road, as well as the authorities in Europe and Canada and other jurisdictions, it does raise some important questions about whether or not investors will continue to want to hold dollars and US government bonds as part of their FX reserves. Many reserve asset holders may wonder whether or not similar action could be taken against them. This has become a big debate in the market. Some investors believe that this turn of events could ultimately lead to some long-term weakness in the dollar. But I think it's also important to remember that yes the U.S. is not the only country that has done this, and it's probably the case that actually any country could potentially freeze the foreign assets of another central bank. And if that's the case, then I don't see having a materially negative impact on the dollar over the long term, as many now seem to be suggesting. But I think that's all we have time for today. So let's leave it there. Simon, thanks very much for taking the time to talk.&nbsp;</p><p><br></p><p><strong>Simon Waever:</strong> Great speaking with you, James.&nbsp;</p><p><br></p><p><strong>James Lord:</strong> As a reminder, if you enjoy Thoughts on the Market, please take a moment to rate and review us on the Apple Podcasts app. It helps more people to find the show.&nbsp;</p>",
  "itunes:title": "Special Episode: Sanctions, Bonds and Currency Markets",
  "itunes:episodeType": "full",
  "itunes:episode": 572,
  "itunes:summary": "With multiple countries now imposing sanctions, investors in Russian government bonds and currencies will need to consider their options as the risk of default rises.",
  "content:encoded": "<p>With multiple countries now imposing sanctions, investors in Russian government bonds and currencies will need to consider their options as the risk of default rises.</p><p><br></p><p><em>Important note regarding economic sanctions. This research references country/ies which are generally the subject of comprehensive or selective sanctions programs administered or enforced by the U.S. Department of the Treasury’s Office of Foreign Assets Control (“OFAC”), the European Union and/or by other countries and multi-national bodies. Any references in this report to entities, debt or equity instruments, projects or persons that may be covered by such sanctions are strictly informational, and should not be read as recommending or advising as to any investment activities in relation to such entities, instruments or projects. Users of this report are solely responsible for ensuring that their investment activities in relation to any sanctioned country/ies are carried out in compliance with applicable sanctions.</em></p><p><br></p><p>-----Transcript-----</p><p><br></p><p><strong>James Lord: </strong>Welcome to Thoughts on the Market. I'm James Lord, Head of FX and EM strategy.&nbsp;</p><p><br></p><p><strong>Simon Waever: </strong>And I'm Simon Waever, Global Head of Sovereign Credit Strategy.&nbsp;</p><p><br></p><p><strong>James Lord: </strong>And on this special episode of Thoughts on the Market, we'll be discussing the impact of recent sanctions on Russia for bonds and currency markets. It's Friday, March 11th at 1:00 p.m. in London.&nbsp;</p><p><br></p><p><strong>Simon Waever: </strong>and 8:00 a.m. in New York.&nbsp;</p><p><br></p><p><strong>James Lord: </strong>So, Simon, we've all been watching the recent events in Ukraine, which are truly tragic, and I think we've all been very saddened by everything that's happened. And it certainly feels a bit trite to be talking about the market implications of everything. But at the same time, there are huge economic and financial consequences from this invasion, and it has big implications for the whole world. So today, I think it would be great if we can provide a little bit of clarity on the impact for emerging markets. Simon, I want to start with Russia itself. The strong sanctions put in place have really had a big impact and increasing the likelihood that Russia could default on its debt. Can you walk us through where we stand on that debate and what the implications are?&nbsp;</p><p><br></p><p><strong>Simon Waever: </strong>That's right, it's had a huge impact already. So Russia's sovereign ratings have been downgraded all the way to Triple C and below, which is only just above default, and that's them having been investment grade just two weeks ago. If you look at the dollar denominated sovereign bonds, they're trading at around 20 cents on the dollar or below. But I think it all makes sense. The economic resilience needed to support an investment grade rating goes away when you remove a large part of the effect reserves, have sanctions on 80% of the banking sector, and with the economy likely to enter into a bigger recession, higher oil prices help, but just not enough. For now, the question is whether upcoming payments on the sovereign dollar bonds will be made. And I think it really comes down to two things. One, whether Russia wants to make the payments, so what we tend to call the willingness. And two whether US sanctions allow it, so the ability. Clarifications from the US Treasury suggests that beyond May 25th, payments cannot be made. So, either a missed payment happens on the first bond repayment after this, which is May 27th or Russia may also decide not to pay as soon as the next payment, which is on March 16th. And of course, the reason for Russia potentially not paying would be that they would want to conserve their foreign exchange. And actually, we've already had some issues on the local currency government bonds, so the ones denominated in Russian ruble. James, do you want to go over what those issues have been?&nbsp;</p><p><br></p><p><strong>James Lord: </strong>That's absolutely right. Already, foreigners do not appear to have received interest payments on their holdings of local currency government bonds. There was one due at the beginning of March, and it looks as though, although the Russian government has paid the interest on that bond, the institutions that are then supposed to transfer the interest payments onto the funds of the various bondholders haven't done so for at least the foreign holders of that bond. Does that count as default? Well, I mean, on the one hand, the government can claim to have paid, but at the same time, some bondholders clearly haven't received any money. There's also another interest payment due in the last week of March, so we'll see if anything changes with that payment. But in the end, there isn't a huge amount that bondholders can really do about it, since these are local currency bonds and they're governed under local law. There isn't really much in the way of legal recourse, and there isn't really much insurance that investors can take out to protect themselves. The situation is a bit different for Russian government bonds that are denominated in US dollars, though. So I'd like to dig a little bit more into what happens if Russia defaults on those bonds. For listeners that are unfamiliar, investors will sometimes take out insurance policies called CDSs or credit default swaps just for this type of situation, and they've been quite a lot of headlines around this. So, Simon, I'd be curious if you could walk us through the implications of default there.&nbsp;</p><p><br></p><p><strong>Simon Waever:</strong> So it's like two different products, right? So you have the bonds there, it can take a long time to recover some of the lost value. I mean, either you actually get the economic recovery and there's no default or you then go to a debt restructuring or litigation. But then on the other hand, you have the CDS contracts, they're going to pay out within a few weeks of the missed bond payment. But it's not unusual to find disagreement on exactly what that payment will look like. And that payment is, we call it, the recovery value perhaps is a bit like the uncertainty that sometimes happens when standard insurance needs to pay out. But if we start with the facts, if there is a missed payment on any of the upcoming dollar or euro denominated bonds, then CDS will trigger. Local currency bonds do not count and the sovereign rating does not matter either. So far I think it's clear, the uncertainty has been around what bonds can actually be delivered into the contract, as that's what determines the recovery value. As it stands, sanctions do allow secondary trading of the bonds. There have been some issues around settlement, but hopefully that can be resolved by the time an auction comes around. The main question is then where that recovery rate will end up, and I would say that given the amount of selling I think is yet to come I wouldn't be surprised if it ends up being among the lower recovery rates we've seen in E.M sovereign CDS.&nbsp;</p><p><br></p><p><strong>James Lord:</strong> Yeah, that makes sense on the recovery rates and the CDs. But I mean, clearly, if Russia defaults, there could be some big implications for the rest of emerging markets as well. And even if they don't default, I mean, there's been a lot of spill over into other asset classes and other emerging markets. How do you think about that?&nbsp;</p><p><br></p><p><strong>Simon Waever:</strong> So I try to think of it in two ways, and I would expect both to continue if we do not see a de-escalation in Ukraine. So first, it really impacts those countries physically close to Russia and Ukraine and those then with trade linkages, which mainly comes with agriculture, energy, tourism and remittances. And that points you towards Eastern Europe, Turkey and Egypt, for instance. Secondly, if we also then see this continued weaker risk backdrop, it would then impact those countries where investor positioning is heavier. But enough on sovereign credit, I wanted to cover currencies, too. The Russian central bank was sanctioned. What do you think that means for EM currencies?&nbsp;</p><p><br></p><p><strong>James Lord:</strong> Absolutely. The sanctions against the central Bank of Russia were really quite dramatic and have understandably had a very big impact on the Russian exchange rate. The ruble’s really depreciated in value quite significantly in the last couple of weeks. I mean, during periods of market uncertainty, the central Bank of Russia would ordinarily sell its foreign exchange assets to buy Ruble to keep the currency under control. But now that's not really possible. It's led to a whole range of countermeasures from Russia to try and protect the currency, such as lifting interest rates from just under 10% to 20%. There have also been significant restrictions on the ability of local residents to move capital abroad or buy dollars, and on the ability of foreigners that hold assets in Russia to actually sell and take their money home. All of that's designed to protect the exchange rate and keep foreign exchange reserves on home soil. I think the willingness of the US to go down that road, as well as the authorities in Europe and Canada and other jurisdictions, it does raise some important questions about whether or not investors will continue to want to hold dollars and US government bonds as part of their FX reserves. Many reserve asset holders may wonder whether or not similar action could be taken against them. This has become a big debate in the market. Some investors believe that this turn of events could ultimately lead to some long-term weakness in the dollar. But I think it's also important to remember that yes the U.S. is not the only country that has done this, and it's probably the case that actually any country could potentially freeze the foreign assets of another central bank. And if that's the case, then I don't see having a materially negative impact on the dollar over the long term, as many now seem to be suggesting. But I think that's all we have time for today. So let's leave it there. Simon, thanks very much for taking the time to talk.&nbsp;</p><p><br></p><p><strong>Simon Waever:</strong> Great speaking with you, James.&nbsp;</p><p><br></p><p><strong>James Lord:</strong> As a reminder, if you enjoy Thoughts on the Market, please take a moment to rate and review us on the Apple Podcasts app. It helps more people to find the show.&nbsp;</p>",
  "guid": "gid://art19-episode-locator/V0/C2gssge1uBmB5RmTUZGdonZBZYUgC4HtUZfk4-M90ZM",
  "pubDate": "Fri, 11 Mar 2022 23:03:08 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:duration": "00:08:28",
  "enclosure": ""
}