{
  "title": "Is tech redefining the workplace for women?",
  "link": "https://audioboom.com/posts/7955590",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1716,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Today, work is often segregated by gender -- with great ramifications for women across the world. Will increased use of technology decrease or increase current discrepancies? What can we do today in our schools and workplaces to help women in the future?<br>\n<br>\n\n</div>\n<div>Bruegel's own <a href=\"https://www.bruegel.org/author/giuseppe-porcaro/\">Giuseppe Porcaro</a> spoke to Bruegel Research Fellow<a href=\"https://www.bruegel.org/author/laura-nurski/\"> Laura Nurski</a> and the Technical University of Vienna's Professor <a href=\"https://www.bruegel.org/?author_name=sabine-theresia-koszegi\">Sabine Theresia Köszegi</a> about the future of work and gender. Together, they explore the contemporary challenges women face in the workplace, and the potential for solutions in the future.<br>\n<br>\n\n</div>\n<div>Want to learn more about gender and the future of work? In this podcast, Sabine recommends the UNESCO report <a href=\"https://en.unesco.org/Id-blush-if-I-could\">\"I'd blush if I could\" closing gender divides in digital skills through education.\"<br>\n</a><br>\n\n</div>\n<div>You can also learn more about our Future of Work project at our website, <a href=\"https://www.bruegel.org/the-future-of-work-and-inclusive-growth-project/\">https://www.bruegel.org/the-future-of-work-and-inclusive-growth-project/</a>\n</div>\n",
  "itunes:summary": "Laura Nurski, Sabine Theresia Köszegi and Giuseppe Porcaro explore the relationship between artificial intelligence and job transformation and ask whether the impact differs by gender.",
  "pubDate": "Wed, 06 Oct 2021 15:08:49 +0000",
  "guid": "tag:audioboom.com,2021-10-06:/posts/7955590",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}