{
  "title": "The Present and Future Promise of Synthetic Biology",
  "description": " The Center for Strategic and International Studies (CSIS) invites you to attend the inaugural event in our <i>Synthetic Biology: The Ongoing Technology Revolution</i> Series. This initial event will introduce the science of synthetic biology, as well as the opportunities and risks it presents to both national security and the global economy. This event will serve as the first of four events, which will convene a diverse set of experts to discuss the security and economic policy implications of this critical emerging technology.<br />\n <br />\n<i>Synthetic Biology: The Ongoing Technology Revolution </i>Series<br />\n <br />\nEmerging technologies—such as artificial intelligence, quantum computing, 5G, and synthetic biology—drive security and economic competition and are increasingly shaping national strategies. To develop an effective strategy for synthetic biology, policy makers and the general public need a better understanding of synthetic biology’s underlying capabilities, state of development, and diverse applications. Through a series of four symposia, CSIS will explore synthetic biology’s wide-ranging applications—from advanced microelectronics and materials to nutrition and cosmetics —and opportunities to shape its future development in support of U.S. security and economic interests. This series will include targeted discussions on synthetic biology’s:\n<ul>\n\t<li>Present and future potential as a critical emerging technology;</li>\n\t<li>Economic, societal, and international implications;</li>\n\t<li>National security opportunities and risks; and</li>\n\t<li>Implications for emerging technology policy.</li>\n</ul>\nCSIS hopes you will join us for our inaugural event on February 6and will continue the discussion in the events that follow.<br />\n <br />\n<i>This series of events is sponsored by Ginkgo Bioworks, Inc.</i> ",
  "itunes:author": "CSIS",
  "pubDate": "Thu, 06 Feb 2020 14:00:00 -0500",
  "enclosure": "",
  "guid": "https://csis-website-prod.s3.amazonaws.com/s3fs-public/field_soundcloud_audio/The%20Present%20and%20Future%20Promise%20of%20Synthetic%20Biology.mp3"
}