{
  "guid": "urn:uuid:3f1b9f3a-5c06-4983-9ecf-83d392594f2f",
  "link": "https://www.who.int/news/item/31-03-2022-who-s-training-for-caregivers-of-children-with-autism-goes-online",
  "a10:author": {
    "a10:name": ""
  },
  "title": "WHO’s training for caregivers of children with autism goes online",
  "description": "In the lead-up to World Autism Awareness Day on 2 April, WHO is releasing an online version of its training programme for caregivers of children with developmental delays or disabilities, including autism. The programme, which has already been piloted in face-to-face format in more than 30 countries, such as Brazil, India, Italy and Kenya, teaches parents and other caregivers day-to-day skills that help boost the well-being and development of children with autism and other developmental disabilities.",
  "pubDate": "Wed, 30 Mar 2022 17:17:08 Z",
  "a10:content": "<p>In the lead-up to World Autism Awareness Day on 2 April, WHO is releasing an online version of its training programme for caregivers of children with developmental delays or disabilities, including autism. The programme, which has already been piloted in face-to-face format in more than 30 countries, such as Brazil, India, Italy and Kenya, teaches parents and other caregivers day-to-day skills that help boost the well-being and development of children with autism and other developmental disabilities. </p><p>&ldquo;In so many parts of the world, particularly &ndash; but not only &ndash; in low-income settings, people looking after autistic children often lack access to the information and services they need,&rdquo; said Dr Chiara Servili, an expert in the mental health and brain health of children and adolescents at the World Health Organization. &ldquo;During the pilot phase, the Caregiver Skills Training programme equipped families in a wide range of community settings with the knowledge and skills to better understand and engage with their children with developmental delays or disabilities. The launch of the e-version means that many more thousands of families will now be able to benefit from it.&rdquo;</p><p>The online training includes pre-recorded information sessions on topics such as using everyday routines as opportunities for children to learn, engaging with children through play and problem-solving. Sessions to help caregivers improve their own well-being are another important feature of the course. Quick tip videos, quizzes and reminders are included to support sustained learning. The training has been set up in such a way that caregivers can learn at their own pace, fitting the course into their schedules in a way that works for them. </p><p>The programme, which has been developed with the collaboration of the nongovernmental organization, Autism Speaks, has been specifically designed to be implemented by non-specialist providers, which is particularly helpful in low-resource communities. </p><p>The launch of the digital programme will be followed, later in April, with the launch of manuals that support in-person sessions of the training programme. The manuals, intended for facilitators of trainings, include learnings from the pilot trainings that have been conducted over the past five years, and will be used to deliver the training through demonstrations, coaching and group discussions. The format will enable programme participants to gain insight directly from trained community members and other families to further strengthen their local support network. </p><p>&nbsp;</p><p>To register for the online training:</p><p>Create an OpenWHO account:&nbsp;<a href=\"https://openwho.org/account/new\">Click here</a><br /></p><p><a href=\"https://openwho.org/pages/faq#11-how-do-i-create-an-account-on-openwho\">For additional instructions on how to create an account</a></p>To start the course: <a href=\"https://openwho.org/courses/caregiver-skills-training\">Open the training platform</a>&nbsp;then click on the button: Enrol me for this course <p></p><p>&nbsp;</p><p>&nbsp;</p>"
}