{
  "title": "Did A Dead Child Return In A Dream | Best of RGSO",
  "link": "https://audioboom.com/posts/8104772",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1782,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Did a parent return to their child in a dream long after their passing from this earth?<br>\n<br>\n\n</div>\n<div>Here is a preview of the story.<br>\n“After my father passed my son had a recurring dream where he was walking down the street and he sees my mother and father in the distance, getting into a car. He calls out to them, but my father does not hear him. My mother however gets out of the car and comes to him and grabs his arms and tells him that we will all be ok without them. She said my father had brought us up to be able to take care of ourselves. And then she walked back to the car. The strange thing about it was that my son had the same dream over and over for about a week. He did not tell anyone because he did not think much of it. His wife made him tell us all and after he told us, he did not have the dream again. My son is a sensitive, but he refuses to acknowledge it. When he was growing up, he heard voices and had bad dreams. I really wish he would give in to it and be a conduit for us and those who have passed. He just does not buy into it. Oh well. I told him when I die, I was going to come back and haunt him. I do not think he believes me.”<br>\n<br>\n\n</div>\n<div>Watch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\n\n</div>\n<div>If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n",
  "pubDate": "Sun, 19 Jun 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-06-17:/posts/8104772",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}