{
  "title": "Episode 115: &#8220;House of the Rising Sun&#8221; by the Animals",
  "link": "https://500songs.com/podcast/episode-115-house-of-the-rising-sun-by-the-animals/",
  "pubDate": "Sat, 27 Feb 2021 14:18:02 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-115-house-of-the-rising-sun-by-the-animals/",
  "description": "Episode one hundred and fifteen of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"House of the Rising Sun\" by the Animals, at the way the US and UK music scenes were influencing each other in 1964, and at the fraught question of attribution when reworking older songs. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/48081326\">\"Memphis\" by Johnny Rivers</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Erratum</strong>\n\nA couple of times I mispronounce Hoagy Lands' surname as Land.\n\n<strong>Resources</strong>\n\nAs always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-115-house-of-the-rising-sun/\">Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.\n\nInformation on the Animals comes largely from&nbsp;<a href=\"https://amzn.to/2MvNQRT\"><em>Animal Tracks&nbsp;</em> by Sean Egan</a>.\n\nThe two-CD set&nbsp;<a href=\"https://amzn.to/2O18edX\"><em>The Complete Animals</em> </a>isn't actually their complete recordings -- for that you'd also need to buy the Decca recordings -- but it is everything they recorded with Mickie Most, including all the big hits discussed in this episode.\n\nFor the information on Dylan's first album, I used <a href=\"https://amzn.to/3bMlkDu\">The Mayor of MacDougal Street by Dave Van Ronk and Elijah Wald,</a> the fascinating and funny autobiography of Dylan's mentor in his Greenwich Village period.\n\nI also referred to <a href=\"https://amzn.to/3bHUnRs\">Chronicles Volume 1 by Bob Dylan</a>, a partial, highly inaccurate, but thoroughly readable autobiography;&nbsp;<a href=\"https://amzn.to/2ZovBkl\">Bob Dylan: All The Songs by Phillipe Margotin and Jean-Michel Guesdon</a>; and <a href=\"https://amzn.to/3k7ct2a\">Revolution in the Air,</a>&nbsp;by Clinton Heylin.\n\n<strong>Transcript</strong>\n\nToday we're going to look at a song that, more than any other song we've looked at so far, shows how the influence between British and American music was working in the early 1960s. A song about New Orleans that may have its roots in English folk music, that became an Appalachian country song, performed by a blues band from the North of England, who learned it from a Minnesotan folk singer based in New York. We're going to look at \"House of the Rising Sun\", and the career of the Animals:\n\n[Excerpt: The Animals, \"House of the Rising Sun\"]\n\nThe story of the Animals, like so many of the British bands of this time period, starts at art school, when two teenagers named Eric Burdon and John Steel met each other.\n\nThe school they met each other at was in Newcastle, and this is important for how the band came together. If you're not familiar with the geography of Great Britain, Newcastle is one of the largest cities, but it's a very isolated city.\n\nBritain has a number of large cities. The biggest, of course, is London, which is about as big as the next five added together. Now, there's a saying that one of the big differences between Britain and America is that in America a hundred years is a long time, and in Britain a hundred miles is a long way, so take that into account when I talk about everything else here.\n\nMost of the area around London is empty of other big cities, and the nearest other big city to it is Birmingham, a hundred miles north-west of it. About seventy miles north of that, give or take, you hit Manchester, and Manchester is in the middle of a chain of large cities -- Liverpool, Manchester, Leeds, and Sheffield, and the slightly smaller Bradford, are more or less in a row, and the furthest distance between two adjacent cities is about thirty-five miles.\n\nBut then Newcastle is another hundred miles north of Leeds, the closest of those cities to it. And then it's another hundred miles or so further north before you hit the major Scottish cities, which cluster together like the ones near Manchester do.\n\nThis means Newcastle is, for a major city, incredibly isolated. Britain's culture is extraordinarily London-centric, but if you're in Liverpool or Manchester there are a number of other nearby cities. A band from Manchester can play a gig in Liverpool and make the last train home, and vice versa. This allows for the creation of regional scenes, centred on one city but with cross-fertilisation from others.\n\nNow, again, I am talking about a major city here, not some remote village, but it means that Newcastle in the sixties was in something of the same position as Seattle was, as we talked about in the episode on \"Louie, Louie\" -- a place where bands would play in their own immediate area and not travel outside it. A journey to Leeds, particularly in the time we're talking about when the motorway system was only just starting, would be a major trip, let alone travelling further afield. Local bands would play in Newcastle, and in large nearby towns like Gateshead, Sunderland, and Middlesborough, but not visit other cities.\n\nThis meant that there was also a limited pool of good musicians to perform with, and so if you wanted to be in a band, you couldn't be that picky about who you got on with, so long as they could play.\n\nSteel and Burdon, when they met at art school, were both jazz fanatics, and they quickly formed a trad jazz band. The band initially featured them on trumpet and trombone, but when rock and roll and skiffle hit the band changed its lineup to one based around guitars. Steel shifted to drums, while Burdon stopped playing an instrument and became the lead singer. Burdon's tastes at the time were oriented towards the jazzier side of R&B, people like Ray Charles, and he also particularly loved blues shouters like Jimmy Witherspoon and Big Joe Turner. He tried hard to emulate Turner, and one of the songs that's often mentioned as being in the repertoire of these early groups is \"Roll 'Em Pete\", the Big Joe Turner song we talked about back in episode two:\n\n[Excerpt: Big Joe Turner, \"Roll 'em Pete\"]\n\nThe jazz group that Burdon and Steel formed was called the Pagan Jazz Men, and when they switched instruments they became instead The Pagans R&B Band. The group was rounded out by Blackie Sanderson and Jimmy Crawford, but soon got a fifth member when a member from another band on an early bill asked if he could sit in with them for a couple of numbers. Alan Price was the rhythm guitarist in that band, but joined in on piano, and instantly gelled with the group, playing Jerry Lee Lewis style piano.\n\nThe other members would always later say that they didn't like Price either as a person or for his taste in music -- both Burdon and Steel regarded Price's tastes as rather pedestrian when compared to their own, hipper, tastes, saying he always regarded himself as something of a lounge player, while Burdon was an R&B and blues person and Steel liked blues and jazz.\n\nBut they all played well together, and in Newcastle there wasn't that much choice about which musicians you could play with, and so they stayed together for a while, as the Pagans evolved into the Kansas City Five or the Kansas City Seven, depending on the occasional presence of two brass players. The Kansas City group played mostly jump blues, which was the area of music where Burdon and Steel's tastes intersected -- musicians they've cited as ones they covered were Ray Charles, Louis Jordan, and Big Joe Turner.\n\nBut then the group collapsed, as Price didn't turn up to a gig -- he'd been poached by a pop covers band, the Kon-Tors, whose bass player, Chas Chandler, had been impressed with him when Chandler had sat in at a couple of Kansas City Five rehearsals. Steel got a gig playing lounge music, just to keep paying the bills, and Burdon would occasionally sit in with various other musicians. But a few members of the Kon-Tors got a side gig, performing as the Alan Price Rhythm & Blues Combo as the resident band at a local venue called the Club A Go-Go, which was the venue where visiting London jazzmen and touring American blues players would perform when they came to Newcastle. Burdon started sitting in with them, and then they invited Steel to replace their drummer, and in September 1963 the Alan Price Rhythm And Blues Combo settled on a lineup of Burdon on vocals, Price on piano, Steel on drums, Chandler on bass, and new member Hilton Valentine, who joined at the same time as Steel, on guitar.\n\nValentine was notably more experienced than the other members, and had previously performed in a rock and roll group called the Wildcats -- not the same band who backed Marty Wilde -- and had even recorded an album with them, though I've been unable to track down any copies of the album. At this point all the group members now had different sensibilities -- Valentine was a rocker and skiffle fan, while Chandler was into more mainstream pop music, though the other members emphasised in interviews that he liked *good* pop music like the Beatles, not the lesser pop music.\n\nThe new lineup was so good that a mere eight days after they first performed together, they went into a recording studio to record an EP, which they put out themselves and sold at their gigs. Apparently five hundred copies of the EP were sold. As well as playing piano on the tracks, Price also played melodica, which he used in the same way that blues musicians would normally use the harmonica:\n\n[Excerpt: The Alan Price Rhythm & Blues Combo, \"Pretty Thing\"]\n\nThis kind of instrumental experimentation would soon further emphasise the split between Price and Burdon, as Price would get a Vox organ rather than cart a piano between gigs, while Burdon disliked the sound of the organ, even though it became one of the defining sounds of the group. That sound can be heard on a live recording of them a couple of months later, backing the great American blues musician Sonny Boy Williamson II at the Club A Go Go:\n\n[Excerpt: Sonny Boy Williamson II and the Animals, “Fattening Frogs For Snakes”]\n\nOne person who definitely *didn't* dislike the sound of the electric organ was Graham Bond, the Hammond organ player with Alexis Korner's band who we mentioned briefly back in the episode on the Rolling Stones. Bond and a few other members of the Korner group had quit, and formed their own group, the Graham Bond Organisation, which had originally featured a guitarist named John McLaughlin, but by this point consisted of Bond, saxophone player Dick Heckstall-Smith, and the rhythm section Jack Bruce and Ginger Baker. They wouldn't make an album until 1965, but live recordings of them from around this time exist, though in relatively poor quality:\n\n[Excerpt: The Graham Bond Organisation, \"Wade in the Water\"]\n\nThe Graham Bond Organisation played at the Club A Go Go, and soon Bond was raving back in London about this group from Newcastle he'd heard. Arrangements were quickly made for them to play in London. By this time, the Rolling Stones had outgrown the small club venues they'd been playing, and a new band called the Yardbirds were playing all the Stones' old venues. A trade was agreed -- the Yardbirds would play all the Alan Price Rhythm & Blues Combo's normal gigs for a couple of weeks, and the Alan Price Rhythm & Blues Combo would play the Yardbirds'.\n\nOr rather, the Animals would. None of the members of the group could ever agree on how they got their new name, and not all of them liked it, but when they played those gigs in London in December 1963, just three months after getting together, that was how they were billed. And it was as the Animals that they were signed by Mickie Most.\n\nMickie Most was one of the new breed of independent producers that were cropping up in London, following in Joe Meek's footsteps, like Andrew Oldham. Most had started out as a singer in a duo called The Most Brothers, which is where he got his stage name. The Most Brothers had only released one single:\n\n[Excerpt: The Most Brothers, \"Whole Lotta Woman\"]\n\nBut then Most had moved to South Africa, where he'd had eleven number one hits with cover versions of American rock singles, backed by a band called the Playboys:\n\n[Excerpt: Mickie Most and the Playboys, \"Johnny B Goode\"]\n\nHe'd returned to the UK in 1963, and been less successful here as a performer, and so he decided to move into production, and the Animals were his first signing. He signed them up and started licensing their records to EMI, and in January 1964 the Animals moved down to London.\n\nThere has been a lot of suggestion over the years that the Animals resented Mickie Most pushing them in a more pop direction, but their first single was an inspired compromise between the group's blues purism and Most's pop instincts. The song they recorded dates back at least to 1935, when the State Street Boys, a group that featured Big Bill Broonzy, recorded \"Don't Tear My Clothes\":\n\n[Excerpt: The State Street Boys, \"Don't Tear My Clothes\"]\n\nThat song got picked up and adapted by a lot of other blues singers, like Blind Boy Fuller, who recorded it as \"Mama Let Me Lay It On You\" in 1938:\n\n[Excerpt: Blind Boy Fuller, \"Mama Let Me Lay it On You\"]\n\nThat had in turn been picked up by the Reverend Gary Davis, who came up with his own arrangement of the song:\n\n[Excerpt: Rev. Gary Davis, \"Baby, Let Me Lay It On You\"]\n\nEric von Schmidt, a folk singer in Massachusetts, had learned that song from Davis, and Bob Dylan had in turn learned it from von Schmidt, and included it on his first album as \"Baby Let Me Follow You Down\":\n\n[Excerpt: Bob Dylan, \"Baby Let Me Follow You Down\"]\n\nThe Animals knew the song from that version, which they loved, but Most had come across it in a different way. He'd heard a version which had been inspired by Dylan, but had been radically reworked. Bert Berns had produced a single on Atlantic for a soul singer called Hoagy Lands, and on the B-side had been a new arrangement of the song, retitled \"Baby Let Me Hold Your Hand\" and adapted by Berns and Wes Farrell, a songwriter who had written for the Shirelles. Land's version had started with an intro in which Lands is clearly imitating Sam Cooke:\n\n[Excerpt: Hoagy Lands, \"Baby Let Me Hold Your Hand\"]\n\nBut after that intro, which seems to be totally original to Berns and Farrell, Lands' track goes into a very upbeat Twist-flavoured song, with a unique guitar riff and Latin feel, both of them very much in the style of Berns' other songs, but clearly an adaptation of Dylan's version of the old song:\n\n[Excerpt: Hoagy Lands, \"Baby Let Me Hold Your Hand\"]\n\nMost had picked up that record on a trip to America, and decided that the Animals should record a version of the song based on that record. Hilton Valentine would later claim that this record, whose title and artist he could never remember (and it's quite possible that Most never even told the band who the record was by) was not very similar at all to the Animals' version, and that they'd just kicked around the song and come up with their own version, but listening to it, it is *very* obviously modelled on Lands' version. They cut out Lands' intro, and restored a lot of Dylan's lyric, but musically it's Lands all the way. The track starts like this:\n\n[Excerpt: The Animals, \"Baby Let Me Take You Home\"]\n\nBoth have a breakdown section with spoken lyrics over a staccato backing, though the two sets of lyrics are different -- compare the Animals:\n\n[Excerpt: The Animals, \"Baby Let Me Take You Home\"]\n\nand Lands:\n\n[Excerpt: Hoagy Lands, \"Baby Let Me Hold Your Hand\"]\n\nAnd both have the typical Bert Berns call and response ending -- Lands:\n\n[Excerpt: Hoagy Lands, \"Baby Let me Hold Your Hand\"]\n\nAnd the Animals:\n\n[Excerpt: The Animals, \"Baby Let Me Take You Home\"]\n\nSo whatever Valentine's later claims, the track very much was modelled on the earlier record, but it's still one of the strongest remodellings of an American R&B record by a British group in this time period, and an astonishingly accomplished record, which made number twenty-one.\n\nThe Animals' second single was another song that had been recorded on Dylan's first album. \"House of the Rising Sun\" has been argued by some, though I think it's a tenuous argument, to originally date to the seventeenth century English folk song \"Little Musgrave and Lady Barnard\":\n\n[Excerpt: Martin Carthy, \"Little Musgrave and Lady Barnard\"]\n\nWhat we do know is that the song was circulating in Appalachia in the early years of the twentieth century, and it's that version that was first recorded in 1933, under the name \"Rising Sun Blues\", by Clarence Ashley and Gwen Foster:\n\n[Excerpt: Clarence Ashley and Gwen Foster, \"Rising Sun Blues\"]\n\nThe song has been described as about several things -- about alcoholism, about sex work, about gambling -- depending on the precise version. It's often thought, for example, that the song was always sung by women and was about a brothel, but there are lots of variants of it, sung by both men and women, before it reached its most famous form.\n\nDave van Ronk, who put the song into the form by which it became best known, believed at first that it was a song about a brothel, but he later decided that it was probably about the New Orleans Women's Prison, which in his accounting used to have a carving of a rising sun over the doorway. Van Ronk's version traces back originally to a field recording Alan Lomax had made in 1938 of a woman named Georgia Turner, from Kentucky:\n\n[Excerpt: Georgia Turner, \"Rising Sun Blues\"]\n\nVan Ronk had learned the song from a record by Hally Wood, a friend of the Lomaxes, who had recorded a version based on Turner's in 1953:\n\n[Excerpt: Hally Wood, \"House of the Rising Sun\"]\n\nVan Ronk took Wood's version of Turner's version of the song, and rearranged it, changing the chords around, adding something that changed the whole song. He introduced a descending bassline, mostly in semitones, which as van Ronk put it is \"a common enough progression in jazz, but unusual among folksingers\". It's actually something you'd get a fair bit in baroque music as well, and van Ronk introducing this into the song is probably what eventually led to things like Procul Harum's \"A Whiter Shade of Pale\" ripping off Bach doing essentially the same thing.\n\nWhat van Ronk did was a simple trick. You play a descending scale, mostly in semitones, while holding the same chord shape which creates a lot of interesting chords. The bass line he played is basically this:\n\n[demonstrates]\n\nAnd he held an A minor shape over that bassline, giving a chord sequence Am, Am over G, Am over F#, F.\n\n[demonstrates]\n\nThis is a trick that's used in hundreds and hundreds of songs later in the sixties and onward -- everything from \"Sunny Afternoon\" by the Kinks to \"Go Now\" by the Moody Blues to \"Forever\" by the Beach Boys -- but it was something that at this point belonged in the realms of art music and jazz more than in folk, blues, or rock and roll.\n\nOf course, it sounds rather better when he did it:\n\n[Excerpt, Dave van Ronk, \"House of the Rising Sun\"]\n\n\"House of the Rising Sun\" soon became the highlight of van Ronk's live act, and his most requested song.\n\nDylan took van Ronk's arrangement, but he wasn't as sophisticated a musician as van Ronk, so he simplified the chords. Rather than the dissonant chords van Ronk had, he played standard rock chords that fit van Ronk's bassline, so instead of Am over G he played C with a G in the bass, and instead of Am over F# he played D with an F# in the bass. So van Ronk had:\n\n[demonstrates]\n\nWhile Dylan had:\n\n[demonstrates]\n\nThe movement of the chords now follows the movement of the bassline. It's simpler, but it's all from van Ronk's arrangement idea. Dylan recorded his version of van Ronk's version for his first album:\n\n[Excerpt: Bob Dylan, \"House of the Rising Sun\"]\n\nAs van Ronk later told the story (though I'm going to edit out one expletive here for the sake of getting past the adult content rating on Apple):\n\n\"One evening in 1962, I was sitting at my usual table in the back of the Kettle of Fish, and Dylan came slouching in. He had been up at the Columbia studios with John Hammond, doing his first album. He was being very mysterioso about the whole thing, and nobody I knew had been to any of the sessions except Suze, his lady. I pumped him for information, but he was vague. Everything was going fine and, “Hey, would it be okay for me to record your arrangement of ‘House of the Rising Sun?’”\n\n[expletive]. “Jeez, Bobby, I’m going into the studio to do that myself in a few weeks. Can’t it wait until your next album?”\n\nA long pause. “Uh-oh.”\n\nI did not like the sound of that. “What exactly do you mean, ‘Uh-oh’?”\n\n“Well,” he said sheepishly, “I’ve already recorded it.”\n\n“You did what?!” I flew into a Donald Duck rage, and I fear I may have said something unkind that could be heard over in Chelsea.\"\n\nvan Ronk and Dylan fell out for a couple of weeks, though they later reconciled, and van Ronk said of Dylan's performance \"it was essentially my arrangement, but Bobby’s reading had all the nuance and subtlety of a Neanderthal with a stone hand ax, and I took comfort thereby.\"\n\nvan Ronk did record his version, as we heard, but he soon stopped playing the song live because he got sick of people telling him to \"play that Dylan song\".\n\nThe Animals learned the song from the Dylan record, and decided to introduce it to their set on their first national tour, supporting Chuck Berry. All the other acts were only doing rock and roll and R&B, and they thought a folk song might be a way to make them stand out -- and it instantly became the highlight of their act.\n\nThe way all the members except Alan Price tell the story, the main instigators of the arrangement were Eric Burdon, the only member of the group who had been familiar with the song before hearing the Dylan album, and Hilton Valentine, who came up with the arpeggiated guitar part. Their arrangement followed Dylan's rearrangement of van Ronk's rearrangement, except they dropped the scalar bassline altogether, so for example instead of a D with an F# in the bass they just play a plain open D chord -- the F# that van Ronk introduced is still in there, as the third, but the descending line is now just implied by the chords, not explicitly stated in the bass, where Chas Chandler just played root notes.\n\nIn the middle of the tour, the group were called back into the studio to record their follow-up single, and they had what seemed like it might be a great opportunity. The TV show Ready Steady Go! wanted the Animals to record a version of the old Ray Charles song \"Talking 'Bout You\", to use as their theme. The group travelled down from Liverpool after playing a show there, and went into the studio in London at three o'clock in the morning, before heading to Southampton for the next night's show. But they needed to record a B-side first, of course, and so before getting round to the main business of the session they knocked off a quick one-take performance of their new live showstopper:\n\n[Excerpt: The Animals, \"House of the Rising Sun\"]\n\nOn hearing the playback, everyone was suddenly convinced that that, not \"Talking 'Bout You\", should be the A-side. But there was a problem. The record was four minutes and twenty seconds long, and you just didn't ever release a record that long. The rule was generally that songs didn't last longer than three minutes, because radio stations wouldn't play them, but Most was eventually persuaded by Chas Chandler that the track needed to go out as it was, with no edits.\n\nIt did, but when it went out, it had only one name on as the arranger -- which when you're recording a public domain song makes you effectively the songwriter. According to all the members other than Price, the group's manager, Mike Jeffrey, who was close to Price, had \"explained\" to them that you needed to just put one name down on the credits, but not to worry, as they would all get a share of the songwriting money. According to Price, meanwhile, he was the sole arranger. Whatever the truth, Price was the only one who ever got any songwriting royalties for their version of the song, which went to number one in the UK and the US. although the version released as a single in the US was cut down to three minutes with some brutal edits, particularly to the organ solo:\n\n[Excerpt: The Animals, \"House of the Rising Sun (US edit)\"]\n\nNone of the group liked what was done to the US single edit, and the proper version was soon released as an album track everywhere\n\nThe Animals' version was a big enough hit that it inspired Dylan's new producer Tom Wilson to do an experiment. In late 1964 he hired session musicians to overdub a new electric backing onto an outtake version of \"House of the Rising Sun\" from the sessions from Dylan's first album, to see what it would sound like:\n\n[Excerpt: Bob Dylan, \"House of the Rising Sun (1964 electric version)\"]\n\nThat wasn't released at the time, it was just an experiment Wilson tried, but it would have ramifications we'll be seeing throughout the rest of the podcast.\n\nIncidentally, Dave van Ronk had the last laugh at Dylan, who had to drop the song from his own sets because people kept asking him if he'd stolen it from the Animals.\n\nThe Animals' next single, \"I'm Crying\", was their first and only self-written A-side, written by Price and Burdon. It was a decent record and made the top ten in the UK and the top twenty in the US, but Price and Burdon were never going to become another Lennon and McCartney or Jagger and Richards -- they just didn't like each other by this point.\n\nThe record after that, \"Don't Let Me Be Misunderstood\", was written by the jazz songwriters Benny Benjamin and Horace Ott, and had originally been recorded by Nina Simone in an orchestral version that owed quite a bit to Burt Bacharach:\n\n[Excerpt: Nina Simone, \"Don't Let Me Be Misunderstood\"]\n\nThe Animals' version really suffers in comparison to that. I was going to say something about how their reinterpretation is as valid in its own way as Simone's original and stands up against it, but actually listening to them back to back as I was writing this, rather than separately as I always previously had, I changed my mind because I really don't think it does. It's a great record, and it's deservedly considered a classic single, but compared to Simone's version, it's lightweight, rushed, and callow:\n\n[Excerpt: The Animals, \"Don't Let Me Be Misunderstood\"]\n\nSimone was apparently furious at the Animals' recording, which they didn't understand given that she hadn't written the original, and according to John Steel she and Burdon later had a huge screaming row about the record. In Steel's version, Simone eventually grudgingly admitted that they weren't \"so bad for a bunch of white boys\", but that doesn't sound to me like the attitude Simone would take. But Steel was there and I wasn't...\n\n\"Don't Let Me Be Misunderstood\" was followed by a more minor single, a cover of Sam Cooke's \"Bring it on Home to Me\", which would be the last single by the group to feature Alan Price. On the twenty-eighth of April 1965, the group were about to leave on a European tour. Chas Chandler, who shared a flat with Price, woke Price up and then got in the shower. When he got out of the shower, Price wasn't in the flat, and Chandler wouldn't see Price again for eighteen months.\n\nChandler believed until his death that while he was in the shower, Price's first royalty cheque for arranging \"House of the Rising Sun\" had arrived, and Price had decided then and there that he wasn't going to share the money as agreed. The group quickly rushed to find a fill-in keyboard player for the tour, and nineteen-year-old Mick Gallagher was with them for a couple of weeks before being permanently replaced by Dave Rowberry. Gallagher would later go on to be the keyboard player with Ian Dury and the Blockheads, as well as playing on several tracks by the Clash.\n\nPrice, meanwhile, went on to have a number of solo hits over the next few years, starting with a version of \"I Put A Spell On You\", in an arrangement which the other Animals later claimed had originally been worked up as an Animals track:\n\n[Excerpt: The Alan Price Set, \"I Put A Spell On You\"]\n\nPrice would go on to make many great solo records, introducing the songs of Randy Newman to a wider audience, and performing in a jazz-influenced R&B style very similar to Mose Allison.\n\nThe Animals' first record with their new keyboard player was their greatest single. \"We Gotta Get Out Of This Place\" had been written by Barry Mann and Cynthia Weill, and had originally been intended for the Righteous Brothers, but they'd decided to have Mann record it himself:\n\n[Excerpt: Barry Mann, \"We Gotta Get Out Of This Place\"]\n\nBut before that version was released, the Animals had heard Mann's piano demo of the song and cut their own version, and Mann's was left on the shelf.\n\nWhat the Animals did to the song horrified Cynthia Weill, who considered it the worst record of one of her songs ever -- though one suspects that's partly because it sabotaged the chances for her husband's single -- but to my mind they vastly improved on the song. They tightened the melody up a lot, getting rid of a lot of interjections. They reworked big chunks of the lyric, for example changing \"Oh girl, now you're young and oh so pretty, staying here would be a crime, because you'll just grow old before your time\" to \"Now my girl, you're so young and pretty, and one thing I know is true, you'll be dead before your time is due\", and making subtler changes like changing \"if it's the last thing that we do\" to \"if it's the last thing we ever do\", improving the scansion. They kept the general sense of the lyrics, but changed more of the actual words than they kept -- and to my ears, at least, every change they made was an improvement.\n\nAnd most importantly, they excised the overlong bridge altogether. I can see what Mann and Weill were trying to do with the bridge -- Righteous Brothers songs would often have a call and response section, building to a climax, where Bill Medley's low voice and Bobby Hatfield's high one would alternate and then come together. But that would normally come in the middle, building towards the last chorus. Here it comes between every verse and chorus, and completely destroys the song's momentum -- it just sounds like noodling:\n\n[Excerpt: Barry Mann, \"We Gotta Get Out Of This Place\"]\n\nThe Animals' version, by contrast, is a masterpiece of dynamics, of slow builds and climaxes and dropping back down again. It's one of the few times I've wished I could just drop the entire record in, rather than excerpting a section, because it depends so much for its effect on the way the whole structure of the track works together:\n\n[Excerpt: The Animals, \"We Gotta Get Out Of This Place\"]\n\nFrom a creators' rights perspective, I entirely agree with Cynthia Weill that the group shouldn't have messed with her song. But from a listener's point of view, I have to say that they turned a decent song into a great one, and one of the greatest singles of all time\n\n\"We Gotta Get Out Of This Place\" was followed by another lesser but listenable single, \"It's My Life\", which seemed to reinforce a pattern of a great Animals single being followed by a merely OK one. But that was the point at which the Animals and Most would part company -- the group were getting sick of Most's attempts to make them more poppy.\n\nThey signed to a new label, Decca, and got a new producer, Tom Wilson, the man who we heard earlier experimenting with Dylan's sound, but the group started to fall apart. After their next single, \"Inside -- Looking Out\", a prison work song collected by the Lomaxes, and the album Animalisms, John Steel left the group, tired of not getting any money, and went to work in a shop.\n\nThe album after Animalisms, confusingly titled Animalism, was also mostly produced by Wilson, and didn't even feature the musicians in the band on two of the tracks, which Wilson farmed out to a protege of his, Frank Zappa, to produce. Those two tracks featured Zappa on guitar and members of the Wrecking Crew, with only Burdon from the actual group:\n\n[Excerpt: The Animals, \"All Night Long\"]\n\nSoon the group would split up, and would discover that their management had thoroughly ripped them off -- there had been a scheme to bank their money in the Bahamas for tax reasons, in a bank which mysteriously disappeared off the face of the Earth. Burdon would form a new group, known first as the New Animals and later as Eric Burdon and the Animals, who would have some success but not on the same level. There were a handful of reunions of the original lineup of the group between 1968 and the early eighties, but they last played together in 1983.\n\nBurdon continues to tour the US as Eric Burdon and the Animals. Alan Price continues to perform successfully as a solo artist. We'll be picking up with Chas Chandler later, when he moves from bass playing into management, so you'll hear more about him in future episodes.\n\nJohn Steel, Dave Rowberry, and Hilton Valentine reformed a version of the Animals in the 1990s, originally with Jim Rodford, formerly of the Kinks and Argent, on bass. Valentine left that group in 2001, and Rowberry died in 2003. Steel now tours the UK as \"The Animals and Friends\", with Mick Gallagher, who had replaced Price briefly in 1965, on keyboards. I've seen them live twice and they put on an excellent show -- though the second time, one woman behind me did indignantly say, as the singer started, \"That's not Eric Clapton!\", before starting to sing along happily...\n\nAnd Hilton Valentine moved to the US and played briefly with Burdon's Animals after quitting Steel's, before returning to his first love, skiffle. He died exactly four weeks ago today, and will be missed.",
  "itunes:subtitle": "Episode one hundred and fifteen of A History of Rock Music in Five Hundred Songs looks at House of the Rising Sun by the Animals, at the way the US and UK music scenes were influencing each other in 1964, and at the fraught question of attribution when r",
  "itunes:keywords": "Alan Lomax,Alan Price,art school,Barry Mann,Bert Berns,Bob Dylan,Brill Building,British rock,Chas Chandler,Cynthia Weil,Dave van Ronk,Eric Burdon,folk music,folk-rock,Frank Zappa,Ginger Baker,Graham Bond,Jack Bruce,John Hammond,Mickie Most,Ready Steady Go,Sonny Boy Williamson II,The Animals,the blues,The Wrecking Crew,The Yardbirds,Tom Wilson,trad jazz",
  "itunes:episodeType": "full",
  "itunes:episode": 115,
  "content:encoded": "Episode one hundred and fifteen of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"House of the Rising Sun\" by the Animals, at the way the US and UK music scenes were influencing each other in 1964, and at the fraught question of attribution when reworking older songs. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/48081326\">\"Memphis\" by Johnny Rivers</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Erratum</strong>\n\nA couple of times I mispronounce Hoagy Lands' surname as Land.\n\n<strong>Resources</strong>\n\nAs always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-115-house-of-the-rising-sun/\">Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.\n\nInformation on the Animals comes largely from&nbsp;<a href=\"https://amzn.to/2MvNQRT\"><em>Animal Tracks&nbsp;</em> by Sean Egan</a>.\n\nThe two-CD set&nbsp;<a href=\"https://amzn.to/2O18edX\"><em>The Complete Animals</em> </a>isn't actually their complete recordings -- for that you'd also need to buy the Decca recordings -- but it is everything they recorded with Mickie Most, including all the big hits discussed in this episode.\n\nFor the information on Dylan's first album, I used <a href=\"https://amzn.to/3bMlkDu\">The Mayor of MacDougal Street by Dave Van Ronk and Elijah Wald,</a> the fascinating and funny autobiography of Dylan's mentor in his Greenwich Village period.\n\nI also referred to <a href=\"https://amzn.to/3bHUnRs\">Chronicles Volume 1 by Bob Dylan</a>, a partial, highly inaccurate, but thoroughly readable autobiography;&nbsp;<a href=\"https://amzn.to/2ZovBkl\">Bob Dylan: All The Songs by Phillipe Margotin and Jean-Michel Guesdon</a>; and <a href=\"https://amzn.to/3k7ct2a\">Revolution in the Air,</a>&nbsp;by Clinton Heylin.\n\n<strong>Transcript</strong>\n\nToday we're going to look at a song that, more than any other song we've looked at so far, shows how the influence between British and American music was working in the early 1960s. A song about New Orleans that may have its roots in English folk music, that became an Appalachian country song, performed by a blues band from the North of England, who learned it from a Minnesotan folk singer based in New York. We're going to look at \"House of the Rising Sun\", and the career of the Animals:\n\n[Excerpt: The Animals, \"House of the Rising Sun\"]\n\nThe story of the Animals, like so many of the British bands of this time period, starts at art school, when two teenagers named Eric Burdon and John Steel met each other.\n\nThe school they met each other at was in Newcastle, and this is important for how the band came together. If you're not familiar with the geography of Great Britain, Newcastle is one of the largest cities, but it's a very isolated city.\n\nBritain has a number of large cities. The biggest, of course, is London, which is about as big as the next five added together. Now, there's a saying that one of the big differences between Britain and America is that in America a hundred years is a long time, and in Britain a hundred miles is a long way, so take that into account when I talk about everything else here.\n\nMost of the area around London is empty of other big cities, and the nearest other big city to it is Birmingham, a hundred miles north-west of it. About seventy miles north of that, give or take, you hit Manchester, and Manchester is in the middle of a chain of large cities -- Liverpool, Manchester, Leeds, and Sheffield, and the slightly smaller Bradford, are more or less in a row, and the furthest distance between two adjacent cities is about thirty-five miles.\n\nBut then Newcastle is another hundred miles north of Leeds, the closest of those cities to it. And then it's another hundred miles or so further north before you hit the major Scottish cities, which cluster together like the ones near Manchester do.\n\nThis means Newcastle is, for a major city, incredibly isolated. Britain's culture is extraordinarily London-centric, but if you're in Liverpool or Manchester there are a number of other nearby cities. A band from Manchester can play a gig in Liverpool and make the last train home, and vice versa. This allows for the creation of regional scenes, centred on one city but with cross-fertilisation from others.\n\nNow, again, I am talking about a major city here, not some remote village, but it means that Newcastle in the sixties was in something of the same position as Seattle was, as we talked about in the episode on \"Louie, Louie\" -- a place where bands would play in their own immediate area and not travel outside it. A journey to Leeds, particularly in the time we're talking about when the motorway system was only just starting, would be a major trip, let alone travelling further afield. Local bands would play in Newcastle, and in large nearby towns like Gateshead, Sunderland, and Middlesborough, but not visit other cities.\n\nThis meant that there was also a limited pool of good musicians to perform with, and so if you wanted to be in a band, you couldn't be that picky about who you got on with, so long as they could play.\n\nSteel and Burdon, when they met at art school, were both jazz fanatics, and they quickly formed a trad jazz band. The band initially featured them on trumpet and trombone, but when rock and roll and skiffle hit the band changed its lineup to one based around guitars. Steel shifted to drums, while Burdon stopped playing an instrument and became the lead singer. Burdon's tastes at the time were oriented towards the jazzier side of R&B, people like Ray Charles, and he also particularly loved blues shouters like Jimmy Witherspoon and Big Joe Turner. He tried hard to emulate Turner, and one of the songs that's often mentioned as being in the repertoire of these early groups is \"Roll 'Em Pete\", the Big Joe Turner song we talked about back in episode two:\n\n[Excerpt: Big Joe Turner, \"Roll 'em Pete\"]\n\nThe jazz group that Burdon and Steel formed was called the Pagan Jazz Men, and when they switched instruments they became instead The Pagans R&B Band. The group was rounded out by Blackie Sanderson and Jimmy Crawford, but soon got a fifth member when a member from another band on an early bill asked if he could sit in with them for a couple of numbers. Alan Price was the rhythm guitarist in that band, but joined in on piano, and instantly gelled with the group, playing Jerry Lee Lewis style piano.\n\nThe other members would always later say that they didn't like Price either as a person or for his taste in music -- both Burdon and Steel regarded Price's tastes as rather pedestrian when compared to their own, hipper, tastes, saying he always regarded himself as something of a lounge player, while Burdon was an R&B and blues person and Steel liked blues and jazz.\n\nBut they all played well together, and in Newcastle there wasn't that much choice about which musicians you could play with, and so they stayed together for a while, as the Pagans evolved into the Kansas City Five or the Kansas City Seven, depending on the occasional presence of two brass players. The Kansas City group played mostly jump blues, which was the area of music where Burdon and Steel's tastes intersected -- musicians they've cited as ones they covered were Ray Charles, Louis Jordan, and Big Joe Turner.\n\nBut then the group collapsed, as Price didn't turn up to a gig -- he'd been poached by a pop covers band, the Kon-Tors, whose bass player, Chas Chandler, had been impressed with him when Chandler had sat in at a couple of Kansas City Five rehearsals. Steel got a gig playing lounge music, just to keep paying the bills, and Burdon would occasionally sit in with various other musicians. But a few members of the Kon-Tors got a side gig, performing as the Alan Price Rhythm & Blues Combo as the resident band at a local venue called the Club A Go-Go, which was the venue where visiting London jazzmen and touring American blues players would perform when they came to Newcastle. Burdon started sitting in with them, and then they invited Steel to replace their drummer, and in September 1963 the Alan Price Rhythm And Blues Combo settled on a lineup of Burdon on vocals, Price on piano, Steel on drums, Chandler on bass, and new member Hilton Valentine, who joined at the same time as Steel, on guitar.\n\nValentine was notably more experienced than the other members, and had previously performed in a rock and roll group called the Wildcats -- not the same band who backed Marty Wilde -- and had even recorded an album with them, though I've been unable to track down any copies of the album. At this point all the group members now had different sensibilities -- Valentine was a rocker and skiffle fan, while Chandler was into more mainstream pop music, though the other members emphasised in interviews that he liked *good* pop music like the Beatles, not the lesser pop music.\n\nThe new lineup was so good that a mere eight days after they first performed together, they went into a recording studio to record an EP, which they put out themselves and sold at their gigs. Apparently five hundred copies of the EP were sold. As well as playing piano on the tracks, Price also played melodica, which he used in the same way that blues musicians would normally use the harmonica:\n\n[Excerpt: The Alan Price Rhythm & Blues Combo, \"Pretty Thing\"]\n\nThis kind of instrumental experimentation would soon further emphasise the split between Price and Burdon, as Price would get a Vox organ rather than cart a piano between gigs, while Burdon disliked the sound of the organ, even though it became one of the defining sounds of the group. That sound can be heard on a live recording of them a couple of months later, backing the great American blues musician Sonny Boy Williamson II at the Club A Go Go:\n\n[Excerpt: Sonny Boy Williamson II and the Animals, “Fattening Frogs For Snakes”]\n\nOne person who definitely *didn't* dislike the sound of the electric organ was Graham Bond, the Hammond organ player with Alexis Korner's band who we mentioned briefly back in the episode on the Rolling Stones. Bond and a few other members of the Korner group had quit, and formed their own group, the Graham Bond Organisation, which had originally featured a guitarist named John McLaughlin, but by this point consisted of Bond, saxophone player Dick Heckstall-Smith, and the rhythm section Jack Bruce and Ginger Baker. They wouldn't make an album until 1965, but live recordings of them from around this time exist, though in relatively poor quality:\n\n[Excerpt: The Graham Bond Organisation, \"Wade in the Water\"]\n\nThe Graham Bond Organisation played at the Club A Go Go, and soon Bond was raving back in London about this group from Newcastle he'd heard. Arrangements were quickly made for them to play in London. By this time, the Rolling Stones had outgrown the small club venues they'd been playing, and a new band called the Yardbirds were playing all the Stones' old venues. A trade was agreed -- the Yardbirds would play all the Alan Price Rhythm & Blues Combo's normal gigs for a couple of weeks, and the Alan Price Rhythm & Blues Combo would play the Yardbirds'.\n\nOr rather, the Animals would. None of the members of the group could ever agree on how they got their new name, and not all of them liked it, but when they played those gigs in London in December 1963, just three months after getting together, that was how they were billed. And it was as the Animals that they were signed by Mickie Most.\n\nMickie Most was one of the new breed of independent producers that were cropping up in London, following in Joe Meek's footsteps, like Andrew Oldham. Most had started out as a singer in a duo called The Most Brothers, which is where he got his stage name. The Most Brothers had only released one single:\n\n[Excerpt: The Most Brothers, \"Whole Lotta Woman\"]\n\nBut then Most had moved to South Africa, where he'd had eleven number one hits with cover versions of American rock singles, backed by a band called the Playboys:\n\n[Excerpt: Mickie Most and the Playboys, \"Johnny B Goode\"]\n\nHe'd returned to the UK in 1963, and been less successful here as a performer, and so he decided to move into production, and the Animals were his first signing. He signed them up and started licensing their records to EMI, and in January 1964 the Animals moved down to London.\n\nThere has been a lot of suggestion over the years that the Animals resented Mickie Most pushing them in a more pop direction, but their first single was an inspired compromise between the group's blues purism and Most's pop instincts. The song they recorded dates back at least to 1935, when the State Street Boys, a group that featured Big Bill Broonzy, recorded \"Don't Tear My Clothes\":\n\n[Excerpt: The State Street Boys, \"Don't Tear My Clothes\"]\n\nThat song got picked up and adapted by a lot of other blues singers, like Blind Boy Fuller, who recorded it as \"Mama Let Me Lay It On You\" in 1938:\n\n[Excerpt: Blind Boy Fuller, \"Mama Let Me Lay it On You\"]\n\nThat had in turn been picked up by the Reverend Gary Davis, who came up with his own arrangement of the song:\n\n[Excerpt: Rev. Gary Davis, \"Baby, Let Me Lay It On You\"]\n\nEric von Schmidt, a folk singer in Massachusetts, had learned that song from Davis, and Bob Dylan had in turn learned it from von Schmidt, and included it on his first album as \"Baby Let Me Follow You Down\":\n\n[Excerpt: Bob Dylan, \"Baby Let Me Follow You Down\"]\n\nThe Animals knew the song from that version, which they loved, but Most had come across it in a different way. He'd heard a version which had been inspired by Dylan, but had been radically reworked. Bert Berns had produced a single on Atlantic for a soul singer called Hoagy Lands, and on the B-side had been a new arrangement of the song, retitled \"Baby Let Me Hold Your Hand\" and adapted by Berns and Wes Farrell, a songwriter who had written for the Shirelles. Land's version had started with an intro in which Lands is clearly imitating Sam Cooke:\n\n[Excerpt: Hoagy Lands, \"Baby Let Me Hold Your Hand\"]\n\nBut after that intro, which seems to be totally original to Berns and Farrell, Lands' track goes into a very upbeat Twist-flavoured song, with a unique guitar riff and Latin feel, both of them very much in the style of Berns' other songs, but clearly an adaptation of Dylan's version of the old song:\n\n[Excerpt: Hoagy Lands, \"Baby Let Me Hold Your Hand\"]\n\nMost had picked up that record on a trip to America, and decided that the Animals should record a version of the song based on that record. Hilton Valentine would later claim that this record, whose title and artist he could never remember (and it's quite possible that Most never even told the band who the record was by) was not very similar at all to the Animals' version, and that they'd just kicked around the song and come up with their own version, but listening to it, it is *very* obviously modelled on Lands' version. They cut out Lands' intro, and restored a lot of Dylan's lyric, but musically it's Lands all the way. The track starts like this:\n\n[Excerpt: The Animals, \"Baby Let Me Take You Home\"]\n\nBoth have a breakdown section with spoken lyrics over a staccato backing, though the two sets of lyrics are different -- compare the Animals:\n\n[Excerpt: The Animals, \"Baby Let Me Take You Home\"]\n\nand Lands:\n\n[Excerpt: Hoagy Lands, \"Baby Let Me Hold Your Hand\"]\n\nAnd both have the typical Bert Berns call and response ending -- Lands:\n\n[Excerpt: Hoagy Lands, \"Baby Let me Hold Your Hand\"]\n\nAnd the Animals:\n\n[Excerpt: The Animals, \"Baby Let Me Take You Home\"]\n\nSo whatever Valentine's later claims, the track very much was modelled on the earlier record, but it's still one of the strongest remodellings of an American R&B record by a British group in this time period, and an astonishingly accomplished record, which made number twenty-one.\n\nThe Animals' second single was another song that had been recorded on Dylan's first album. \"House of the Rising Sun\" has been argued by some, though I think it's a tenuous argument, to originally date to the seventeenth century English folk song \"Little Musgrave and Lady Barnard\":\n\n[Excerpt: Martin Carthy, \"Little Musgrave and Lady Barnard\"]\n\nWhat we do know is that the song was circulating in Appalachia in the early years of the twentieth century, and it's that version that was first recorded in 1933, under the name \"Rising Sun Blues\", by Clarence Ashley and Gwen Foster:\n\n[Excerpt: Clarence Ashley and Gwen Foster, \"Rising Sun Blues\"]\n\nThe song has been described as about several things -- about alcoholism, about sex work, about gambling -- depending on the precise version. It's often thought, for example, that the song was always sung by women and was about a brothel, but there are lots of variants of it, sung by both men and women, before it reached its most famous form.\n\nDave van Ronk, who put the song into the form by which it became best known, believed at first that it was a song about a brothel, but he later decided that it was probably about the New Orleans Women's Prison, which in his accounting used to have a carving of a rising sun over the doorway. Van Ronk's version traces back originally to a field recording Alan Lomax had made in 1938 of a woman named Georgia Turner, from Kentucky:\n\n[Excerpt: Georgia Turner, \"Rising Sun Blues\"]\n\nVan Ronk had learned the song from a record by Hally Wood, a friend of the Lomaxes, who had recorded a version based on Turner's in 1953:\n\n[Excerpt: Hally Wood, \"House of the Rising Sun\"]\n\nVan Ronk took Wood's version of Turner's version of the song, and rearranged it, changing the chords around, adding something that changed the whole song. He introduced a descending bassline, mostly in semitones, which as van Ronk put it is \"a common enough progression in jazz, but unusual among folksingers\". It's actually something you'd get a fair bit in baroque music as well, and van Ronk introducing this into the song is probably what eventually led to things like Procul Harum's \"A Whiter Shade of Pale\" ripping off Bach doing essentially the same thing.\n\nWhat van Ronk did was a simple trick. You play a descending scale, mostly in semitones, while holding the same chord shape which creates a lot of interesting chords. The bass line he played is basically this:\n\n[demonstrates]\n\nAnd he held an A minor shape over that bassline, giving a chord sequence Am, Am over G, Am over F#, F.\n\n[demonstrates]\n\nThis is a trick that's used in hundreds and hundreds of songs later in the sixties and onward -- everything from \"Sunny Afternoon\" by the Kinks to \"Go Now\" by the Moody Blues to \"Forever\" by the Beach Boys -- but it was something that at this point belonged in the realms of art music and jazz more than in folk, blues, or rock and roll.\n\nOf course, it sounds rather better when he did it:\n\n[Excerpt, Dave van Ronk, \"House of the Rising Sun\"]\n\n\"House of the Rising Sun\" soon became the highlight of van Ronk's live act, and his most requested song.\n\nDylan took van Ronk's arrangement, but he wasn't as sophisticated a musician as van Ronk, so he simplified the chords. Rather than the dissonant chords van Ronk had, he played standard rock chords that fit van Ronk's bassline, so instead of Am over G he played C with a G in the bass, and instead of Am over F# he played D with an F# in the bass. So van Ronk had:\n\n[demonstrates]\n\nWhile Dylan had:\n\n[demonstrates]\n\nThe movement of the chords now follows the movement of the bassline. It's simpler, but it's all from van Ronk's arrangement idea. Dylan recorded his version of van Ronk's version for his first album:\n\n[Excerpt: Bob Dylan, \"House of the Rising Sun\"]\n\nAs van Ronk later told the story (though I'm going to edit out one expletive here for the sake of getting past the adult content rating on Apple):\n\n\"One evening in 1962, I was sitting at my usual table in the back of the Kettle of Fish, and Dylan came slouching in. He had been up at the Columbia studios with John Hammond, doing his first album. He was being very mysterioso about the whole thing, and nobody I knew had been to any of the sessions except Suze, his lady. I pumped him for information, but he was vague. Everything was going fine and, “Hey, would it be okay for me to record your arrangement of ‘House of the Rising Sun?’”\n\n[expletive]. “Jeez, Bobby, I’m going into the studio to do that myself in a few weeks. Can’t it wait until your next album?”\n\nA long pause. “Uh-oh.”\n\nI did not like the sound of that. “What exactly do you mean, ‘Uh-oh’?”\n\n“Well,” he said sheepishly, “I’ve already recorded it.”\n\n“You did what?!” I flew into a Donald Duck rage, and I fear I may have said something unkind that could be heard over in Chelsea.\"\n\nvan Ronk and Dylan fell out for a couple of weeks, though they later reconciled, and van Ronk said of Dylan's performance \"it was essentially my arrangement, but Bobby’s reading had all the nuance and subtlety of a Neanderthal with a stone hand ax, and I took comfort thereby.\"\n\nvan Ronk did record his version, as we heard, but he soon stopped playing the song live because he got sick of people telling him to \"play that Dylan song\".\n\nThe Animals learned the song from the Dylan record, and decided to introduce it to their set on their first national tour, supporting Chuck Berry. All the other acts were only doing rock and roll and R&B, and they thought a folk song might be a way to make them stand out -- and it instantly became the highlight of their act.\n\nThe way all the members except Alan Price tell the story, the main instigators of the arrangement were Eric Burdon, the only member of the group who had been familiar with the song before hearing the Dylan album, and Hilton Valentine, who came up with the arpeggiated guitar part. Their arrangement followed Dylan's rearrangement of van Ronk's rearrangement, except they dropped the scalar bassline altogether, so for example instead of a D with an F# in the bass they just play a plain open D chord -- the F# that van Ronk introduced is still in there, as the third, but the descending line is now just implied by the chords, not explicitly stated in the bass, where Chas Chandler just played root notes.\n\nIn the middle of the tour, the group were called back into the studio to record their follow-up single, and they had what seemed like it might be a great opportunity. The TV show Ready Steady Go! wanted the Animals to record a version of the old Ray Charles song \"Talking 'Bout You\", to use as their theme. The group travelled down from Liverpool after playing a show there, and went into the studio in London at three o'clock in the morning, before heading to Southampton for the next night's show. But they needed to record a B-side first, of course, and so before getting round to the main business of the session they knocked off a quick one-take performance of their new live showstopper:\n\n[Excerpt: The Animals, \"House of the Rising Sun\"]\n\nOn hearing the playback, everyone was suddenly convinced that that, not \"Talking 'Bout You\", should be the A-side. But there was a problem. The record was four minutes and twenty seconds long, and you just didn't ever release a record that long. The rule was generally that songs didn't last longer than three minutes, because radio stations wouldn't play them, but Most was eventually persuaded by Chas Chandler that the track needed to go out as it was, with no edits.\n\nIt did, but when it went out, it had only one name on as the arranger -- which when you're recording a public domain song makes you effectively the songwriter. According to all the members other than Price, the group's manager, Mike Jeffrey, who was close to Price, had \"explained\" to them that you needed to just put one name down on the credits, but not to worry, as they would all get a share of the songwriting money. According to Price, meanwhile, he was the sole arranger. Whatever the truth, Price was the only one who ever got any songwriting royalties for their version of the song, which went to number one in the UK and the US. although the version released as a single in the US was cut down to three minutes with some brutal edits, particularly to the organ solo:\n\n[Excerpt: The Animals, \"House of the Rising Sun (US edit)\"]\n\nNone of the group liked what was done to the US single edit, and the proper version was soon released as an album track everywhere\n\nThe Animals' version was a big enough hit that it inspired Dylan's new producer Tom Wilson to do an experiment. In late 1964 he hired session musicians to overdub a new electric backing onto an outtake version of \"House of the Rising Sun\" from the sessions from Dylan's first album, to see what it would sound like:\n\n[Excerpt: Bob Dylan, \"House of the Rising Sun (1964 electric version)\"]\n\nThat wasn't released at the time, it was just an experiment Wilson tried, but it would have ramifications we'll be seeing throughout the rest of the podcast.\n\nIncidentally, Dave van Ronk had the last laugh at Dylan, who had to drop the song from his own sets because people kept asking him if he'd stolen it from the Animals.\n\nThe Animals' next single, \"I'm Crying\", was their first and only self-written A-side, written by Price and Burdon. It was a decent record and made the top ten in the UK and the top twenty in the US, but Price and Burdon were never going to become another Lennon and McCartney or Jagger and Richards -- they just didn't like each other by this point.\n\nThe record after that, \"Don't Let Me Be Misunderstood\", was written by the jazz songwriters Benny Benjamin and Horace Ott, and had originally been recorded by Nina Simone in an orchestral version that owed quite a bit to Burt Bacharach:\n\n[Excerpt: Nina Simone, \"Don't Let Me Be Misunderstood\"]\n\nThe Animals' version really suffers in comparison to that. I was going to say something about how their reinterpretation is as valid in its own way as Simone's original and stands up against it, but actually listening to them back to back as I was writing this, rather than separately as I always previously had, I changed my mind because I really don't think it does. It's a great record, and it's deservedly considered a classic single, but compared to Simone's version, it's lightweight, rushed, and callow:\n\n[Excerpt: The Animals, \"Don't Let Me Be Misunderstood\"]\n\nSimone was apparently furious at the Animals' recording, which they didn't understand given that she hadn't written the original, and according to John Steel she and Burdon later had a huge screaming row about the record. In Steel's version, Simone eventually grudgingly admitted that they weren't \"so bad for a bunch of white boys\", but that doesn't sound to me like the attitude Simone would take. But Steel was there and I wasn't...\n\n\"Don't Let Me Be Misunderstood\" was followed by a more minor single, a cover of Sam Cooke's \"Bring it on Home to Me\", which would be the last single by the group to feature Alan Price. On the twenty-eighth of April 1965, the group were about to leave on a European tour. Chas Chandler, who shared a flat with Price, woke Price up and then got in the shower. When he got out of the shower, Price wasn't in the flat, and Chandler wouldn't see Price again for eighteen months.\n\nChandler believed until his death that while he was in the shower, Price's first royalty cheque for arranging \"House of the Rising Sun\" had arrived, and Price had decided then and there that he wasn't going to share the money as agreed. The group quickly rushed to find a fill-in keyboard player for the tour, and nineteen-year-old Mick Gallagher was with them for a couple of weeks before being permanently replaced by Dave Rowberry. Gallagher would later go on to be the keyboard player with Ian Dury and the Blockheads, as well as playing on several tracks by the Clash.\n\nPrice, meanwhile, went on to have a number of solo hits over the next few years, starting with a version of \"I Put A Spell On You\", in an arrangement which the other Animals later claimed had originally been worked up as an Animals track:\n\n[Excerpt: The Alan Price Set, \"I Put A Spell On You\"]\n\nPrice would go on to make many great solo records, introducing the songs of Randy Newman to a wider audience, and performing in a jazz-influenced R&B style very similar to Mose Allison.\n\nThe Animals' first record with their new keyboard player was their greatest single. \"We Gotta Get Out Of This Place\" had been written by Barry Mann and Cynthia Weill, and had originally been intended for the Righteous Brothers, but they'd decided to have Mann record it himself:\n\n[Excerpt: Barry Mann, \"We Gotta Get Out Of This Place\"]\n\nBut before that version was released, the Animals had heard Mann's piano demo of the song and cut their own version, and Mann's was left on the shelf.\n\nWhat the Animals did to the song horrified Cynthia Weill, who considered it the worst record of one of her songs ever -- though one suspects that's partly because it sabotaged the chances for her husband's single -- but to my mind they vastly improved on the song. They tightened the melody up a lot, getting rid of a lot of interjections. They reworked big chunks of the lyric, for example changing \"Oh girl, now you're young and oh so pretty, staying here would be a crime, because you'll just grow old before your time\" to \"Now my girl, you're so young and pretty, and one thing I know is true, you'll be dead before your time is due\", and making subtler changes like changing \"if it's the last thing that we do\" to \"if it's the last thing we ever do\", improving the scansion. They kept the general sense of the lyrics, but changed more of the actual words than they kept -- and to my ears, at least, every change they made was an improvement.\n\nAnd most importantly, they excised the overlong bridge altogether. I can see what Mann and Weill were trying to do with the bridge -- Righteous Brothers songs would often have a call and response section, building to a climax, where Bill Medley's low voice and Bobby Hatfield's high one would alternate and then come together. But that would normally come in the middle, building towards the last chorus. Here it comes between every verse and chorus, and completely destroys the song's momentum -- it just sounds like noodling:\n\n[Excerpt: Barry Mann, \"We Gotta Get Out Of This Place\"]\n\nThe Animals' version, by contrast, is a masterpiece of dynamics, of slow builds and climaxes and dropping back down again. It's one of the few times I've wished I could just drop the entire record in, rather than excerpting a section, because it depends so much for its effect on the way the whole structure of the track works together:\n\n[Excerpt: The Animals, \"We Gotta Get Out Of This Place\"]\n\nFrom a creators' rights perspective, I entirely agree with Cynthia Weill that the group shouldn't have messed with her song. But from a listener's point of view, I have to say that they turned a decent song into a great one, and one of the greatest singles of all time\n\n\"We Gotta Get Out Of This Place\" was followed by another lesser but listenable single, \"It's My Life\", which seemed to reinforce a pattern of a great Animals single being followed by a merely OK one. But that was the point at which the Animals and Most would part company -- the group were getting sick of Most's attempts to make them more poppy.\n\nThey signed to a new label, Decca, and got a new producer, Tom Wilson, the man who we heard earlier experimenting with Dylan's sound, but the group started to fall apart. After their next single, \"Inside -- Looking Out\", a prison work song collected by the Lomaxes, and the album Animalisms, John Steel left the group, tired of not getting any money, and went to work in a shop.\n\nThe album after Animalisms, confusingly titled Animalism, was also mostly produced by Wilson, and didn't even feature the musicians in the band on two of the tracks, which Wilson farmed out to a protege of his, Frank Zappa, to produce. Those two tracks featured Zappa on guitar and members of the Wrecking Crew, with only Burdon from the actual group:\n\n[Excerpt: The Animals, \"All Night Long\"]\n\nSoon the group would split up, and would discover that their management had thoroughly ripped them off -- there had been a scheme to bank their money in the Bahamas for tax reasons, in a bank which mysteriously disappeared off the face of the Earth. Burdon would form a new group, known first as the New Animals and later as Eric Burdon and the Animals, who would have some success but not on the same level. There were a handful of reunions of the original lineup of the group between 1968 and the early eighties, but they last played together in 1983.\n\nBurdon continues to tour the US as Eric Burdon and the Animals. Alan Price continues to perform successfully as a solo artist. We'll be picking up with Chas Chandler later, when he moves from bass playing into management, so you'll hear more about him in future episodes.\n\nJohn Steel, Dave Rowberry, and Hilton Valentine reformed a version of the Animals in the 1990s, originally with Jim Rodford, formerly of the Kinks and Argent, on bass. Valentine left that group in 2001, and Rowberry died in 2003. Steel now tours the UK as \"The Animals and Friends\", with Mick Gallagher, who had replaced Price briefly in 1965, on keyboards. I've seen them live twice and they put on an excellent show -- though the second time, one woman behind me did indignantly say, as the singer started, \"That's not Eric Clapton!\", before starting to sing along happily...\n\nAnd Hilton Valentine moved to the US and played briefly with Burdon's Animals after quitting Steel's, before returning to his first love, skiffle. He died exactly four weeks ago today, and will be missed.",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and fifteen of A History of Rock Music in Five Hundred Songs looks at \"House of the Rising Sun\" by the Animals, at the way the US and UK music scenes were influencing each other in 1964, and at the fraught question of attribution when reworking older songs. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Memphis\" by Johnny Rivers.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nErratum\n\nA couple of times I mispronounce Hoagy Lands' surname as Land.\n\nResources\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nInformation on the Animals comes largely from&nbsp;Animal Tracks&nbsp; by Sean Egan.\n\nThe two-CD set&nbsp;The Complete Animals isn't actually their complete recordings -- for that you'd also need to buy the Decca recordings -- but it is everything they recorded with Mickie Most, including all the big hits discussed in this episode.\n\nFor the information on Dylan's first album, I used The Mayor of MacDougal Street by Dave Van Ronk and Elijah Wald, the fascinating and funny autobiography of Dylan's mentor in his Greenwich Village period.\n\nI also referred to Chronicles Volume 1 by Bob Dylan, a partial, highly inaccurate, but thoroughly readable autobiography;&nbsp;Bob Dylan: All The Songs by Phillipe Margotin and Jean-Michel Guesdon; and Revolution in the Air,&nbsp;by Clinton Heylin.\n\nTranscript\n\nToday we're going to look at a song that, more than any other song we've looked at so far, shows how the influence between British and American music was working in the early 1960s. A song about New Orleans that may have its roots in English folk music, that became an Appalachian country song, performed by a blues band from the North of England, who learned it from a Minnesotan folk singer based in New York. We're going to look at \"House of the Rising Sun\", and the career of the Animals:\n\n[Excerpt: The Animals, \"House of the Rising Sun\"]\n\nThe story of the Animals, like so many of the British bands of this time period, starts at art school, when two teenagers named Eric Burdon and John Steel met each other.\n\nThe school they met each other at was in Newcastle, and this is important for how the band came together. If you're not familiar with the geography of Great Britain, Newcastle is one of the largest cities, but it's a very isolated city.\n\nBritain has a number of large cities. The biggest, of course, is London, which is about as big as the next five added together. Now, there's a saying that one of the big differences between Britain and America is that in America a hundred years is a long time, and in Britain a hundred miles is a long way, so take that into account when I talk about everything else here.\n\nMost of the area around London is empty of other big cities, and the nearest other big city to it is Birmingham, a hundred miles north-west of it. About seventy miles north of that, give or take, you hit Manchester, and Manchester is in the middle of a chain of large cities -- Liverpool, Manchester, Leeds, and Sheffield, and the slightly smaller Bradford, are more or less in a row, and the furthest distance between two adjacent cities is about thirty-five miles.\n\nBut then Newcastle is another hundred miles north of Leeds, the closest of those cities to it. And then it's another hundred miles or so further north before you hit the major Scottish cities, which cluster together like the ones near Manchester do.\n\nThis means Newcastle is, for a major city, incredibly isolated. Britain's culture is extraordinarily London-centric, but if you're in Liverpool or Manchester there are a number of other nearby cities. A band from Manchester can play",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and fifteen of A History of Rock Music in Five Hundred Songs looks at \"House of the Rising Sun\" by the Animals, at the way the US and UK music scenes were influencing each other in 1964, and at the fraught question of attribution when reworking older songs. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Memphis\" by Johnny Rivers.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nErratum\n\nA couple of times I mispronounce Hoagy Lands' surname as Land.\n\nResources\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nInformation on the Animals comes largely from&nbsp;Animal Tracks&nbsp; by Sean Egan.",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}