{
  "id": "yt:video:ntQYjNxEv2Y",
  "yt:videoId": "ntQYjNxEv2Y",
  "yt:channelId": "UCgRBRE1DUP2w7HTH9j_L4OQ",
  "title": "When Social Media Doctors Get Mixed Up With NFTs",
  "link": "",
  "author": {
    "name": "Medlife Crisis",
    "uri": "https://www.youtube.com/channel/UCgRBRE1DUP2w7HTH9j_L4OQ"
  },
  "published": "2022-04-17T10:58:44+00:00",
  "updated": "2022-05-22T16:04:52+00:00",
  "media:group": {
    "media:title": "When Social Media Doctors Get Mixed Up With NFTs",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The perils of being a medical influencer... I'm not saying this is an NFT scam. But the pre-test probability is high. With the added bonus of being an antivax fundraiser...oh dear.\n\nI can't actually recall how I found this, I just stumbled on it on twitter and had no idea what I was watching. The videos at the time had about 100 views each, the first one has now ticked past 180k views. One MIGHT suggest that I had secretly invested in these NFTs and I've just given them free publicity...muahaha. Well not really, as they're not on sale yet. Plus I'm not that smart anyway.\n\nSign up for my free newsletter: https://medlife.substack.com/\n\nI hope it's evident that I am not seeking drama and am working on the assumption that most/all of these medfluencers didn't get the full story, but I'd probably recommend others give NFTs a wide berth. Wanting to raise money for charity is a noble goal, but there are ways to do it without all this scammy overlay. NFT minting is ultimately a way of raising money from gullible people who receive very little in exchange. If the goal is delivering healthcare to remote areas, again the web3 angle seems unnecessary.\n\nhttps://twitter.com/MedCrisis/status/1514373761469980677\nhttps://www.metadocsnft.com/\n\nMillion rupee studio a reference to @Coffeezilla\nDan Olson a reference to his phenomenal video about NFTs @Folding Ideas https://youtu.be/YQ_xWvX1n9g\n\n-----------------\n\nMore Medlife Crisis:\n\nhttp://www.medlifecrisis.co.uk\nhttps://twitter.com/medcrisis\nhttps://www.youtube.com/channel/UCXFgI0Lgrwc_fY2ttqQ9Yhg\nhttps://watchnebula.com/medlifecrisis\nhttps://www.instagram.com/medcrisis\nhttps://www.facebook.com/Medlifecrisis",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}