{
  "title": "Episode 265 - Seve de Campo Interview",
  "itunes:episode": 265,
  "itunes:title": "Episode 265 - Seve de Campo Interview",
  "itunes:episodeType": "full",
  "guid": "85de65f6-e6b4-4478-8c1b-afbe4e223c72",
  "link": "https://share.transistor.fm/s/e0c67b41",
  "description": "<p>It's always a fun time when we get to talk cross-country skiing on the show and that time is now as we bring you a great chat with Australian Olympian Seve de Campo to learn more about his amazing career and his amazing sport! We find out from Seve how he came into the sport a little later than most and how a moment of inspiration from his father helped him on that journey. We also learn how the disappointment of not making the 2016 Youth Olympics helped spur him towards his ultimate goal of the 2022 Olympics and what paths that journey took him in between. Added to this we find out about a unique national championship he won, what classic sledges are used against the almighty Norwegian athletes in competition and just what aspect of Olympic village life he found extra inspirational despite it also being a tad unconventional in China. It's one hell of a chat  you won't want to miss!</p>",
  "content:encoded": "<p>It's always a fun time when we get to talk cross-country skiing on the show and that time is now as we bring you a great chat with Australian Olympian Seve de Campo to learn more about his amazing career and his amazing sport! We find out from Seve how he came into the sport a little later than most and how a moment of inspiration from his father helped him on that journey. We also learn how the disappointment of not making the 2016 Youth Olympics helped spur him towards his ultimate goal of the 2022 Olympics and what paths that journey took him in between. Added to this we find out about a unique national championship he won, what classic sledges are used against the almighty Norwegian athletes in competition and just what aspect of Olympic village life he found extra inspirational despite it also being a tad unconventional in China. It's one hell of a chat  you won't want to miss!</p>",
  "pubDate": "Fri, 09 Sep 2022 09:00:00 +1000",
  "author": "Ben Waterworth",
  "enclosure": "",
  "itunes:author": "Ben Waterworth",
  "itunes:image": "",
  "itunes:duration": 4407,
  "itunes:summary": "It's always a fun time when we get to talk cross-country skiing on the show and that time is now as we bring you a great chat with Australian Olympian Seve de Campo to learn more about his amazing career and his amazing sport! We find out from Seve how he came into the sport a little later than most and how a moment of inspiration from his father helped him on that journey. We also learn how the disappointment of not making the 2016 Youth Olympics helped spur him towards his ultimate goal of the 2022 Olympics and what paths that journey took him in between. Added to this we find out about a unique national championship he won, what classic sledges are used against the almighty Norwegian athletes in competition and just what aspect of Olympic village life he found extra inspirational despite it also being a tad unconventional in China. It's one hell of a chat  you won't want to miss!",
  "itunes:subtitle": "It's always a fun time when we get to talk cross-country skiing on the show and that time is now as we bring you a great chat with Australian Olympian Seve de Campo to learn more about his amazing career and his amazing sport! We find out from Seve how he",
  "itunes:keywords": "olympics, off the podium, comedy, funny, interview, colin hilding, jarrod loobeek, ben waterworth, olympic games, sport, australia, canada",
  "itunes:explicit": "No"
}