{
  "title": "PyDaddy: A Python package for discovering stochastic dynamical equations from timeseries data. (arXiv:2205.02645v2 [q-bio.QM] UPDATED)",
  "link": "http://arxiv.org/abs/2205.02645",
  "description": "<p>Most real-world ecological dynamics, ranging from ecosystem dynamics to\ncollective animal movement, are inherently stochastic in nature. Stochastic\ndifferential equations (SDEs) are a popular modelling framework to model\ndynamics with intrinsic randomness. Here, we focus on the inverse question: If\none has empirically measured time-series data from some system of interest, is\nit possible to discover the SDE model that best describes the data. Here, we\npresent PyDaddy (PYthon library for DAta Driven DYnamics), a toolbox to\nconstruct and analyze interpretable SDE models based on time-series data. We\ncombine traditional approaches for data-driven SDE reconstruction with an\nequation learning approach, to derive symbolic equations governing the\nstochastic dynamics. The toolkit is presented as an open-source Python library,\nand consists of tools to construct and analyze SDEs. Functionality is included\nfor visual examination of the stochastic structure of the data, guided\nextraction of the functional form of the SDE, and diagnosis and debugging of\nthe underlying assumptions and the extracted model. Using simulated time-series\ndatasets, exhibiting a wide range of dynamics, we show that PyDaddy is able to\ncorrectly identify underlying SDE models. We demonstrate the applicability of\nthe toolkit to real-world data using a previously published movement data of a\nfish school. Starting from the time-series of the observed polarization of the\nschool, pyDaddy readily discovers the SDE model governing the dynamics of group\npolarization. The model recovered by PyDaddy is consistent with the previous\nstudy. In summary, stochastic and noise-induced effects are central to the\ndynamics of many biological systems. In this context, we present an easy-to-use\npackage to reconstruct SDEs from timeseries data.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/q-bio/1/au:+Nabeel_A/0/1/0/all/0/1\">Arshed Nabeel</a>, <a href=\"http://arxiv.org/find/q-bio/1/au:+Karichannavar_A/0/1/0/all/0/1\">Ashwin Karichannavar</a>, <a href=\"http://arxiv.org/find/q-bio/1/au:+Palathingal_S/0/1/0/all/0/1\">Shuaib Palathingal</a>, <a href=\"http://arxiv.org/find/q-bio/1/au:+Jhawar_J/0/1/0/all/0/1\">Jitesh Jhawar</a>, <a href=\"http://arxiv.org/find/q-bio/1/au:+M_D/0/1/0/all/0/1\">Danny Raj M</a>, <a href=\"http://arxiv.org/find/q-bio/1/au:+Guttal_V/0/1/0/all/0/1\">Vishwesha Guttal</a>"
}