{
  "id": "tag:blogger.com,1999:blog-4371296950668142214.post-90587947536092540",
  "published": "2021-06-16T15:52:00.002+10:00",
  "updated": "2021-06-16T15:52:56.880+10:00",
  "category": "",
  "title": "Assessing the Economic, Societal, and Cultural Impact of YouTube in Australia",
  "content": "<div class=\"separator\" style=\"clear: both; text-align: center;\"><iframe allowfullscreen=\"\" class=\"BLOG_video_class\" height=\"266\" src=\"https://www.youtube.com/embed/mNCDyxppJlg\" width=\"320\" youtube-src-id=\"mNCDyxppJlg\"></iframe></div><br /><div>Every day, YouTube helps Australians learn new skills, start businesses, and enrich their lives. And this felt particularly true in 2020, when Australians turned to YouTube to learn, be entertainment or stay active with at-home fitness classes during the COVID-19 pandemic.&nbsp;</div><div>I personally tuned into a lot of <a href=\"https://www.youtube.com/channel/UCSnwORddxZG1SyB8lSxWQGg\">YBS Youngbloods</a> to escape into the Aussie wilderness, I got tips from <a href=\"https://www.youtube.com/channel/UCJZTjBlrnDHYmf0F-eYXA3Q\">Self Sufficient Me</a> to upgrade my veggie garden, and I followed <a href=\"https://www.youtube.com/channel/UCH6Oc4MAJzzmK0SM805ZnjQ\">Dr Matt &amp; Dr Mike</a> to learn more about COVID-19.&nbsp;</div><div>Now, for the first time, we’re quantifying what happens on YouTube with the effects of the ecosystem in Australia comprehensively examined in a detailed study. The independent consulting firm, <a href=\"https://www.oxfordeconomics.com/\">Oxford Economics</a>, based in England, with a branch in Sydney, has compiled <a href=\"https://kstatic.googleusercontent.com/files/c2f33cb4f0613a65db06d4d7d95951121a4c52fb45d369b163de619ed2e06597f60a4e4589821ea0500766b25ebbc9e23795952a03a1ce97c4274040eb6370d2\">A Platform for Australian Opportunity: Assessing the Economic, Societal, and Cultural Impact of YouTube in Australia</a>.&nbsp;</div><div><b><br /></b></div><div><b>So, what was the key finding?&nbsp;</b></div><div>The YouTube creative ecosystem contributed A$608 million to the Australian economy and supported 15,750 full time equivalent jobs in 2020.&nbsp;</div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-ckwGYJUsZ7k/YMmPIJ5V7PI/AAAAAAAAC0Y/P24vXm5P9osCXFZXBIMaku0Ng2jjHa-rACLcBGAsYHQ/s1201/Economic%2Bcontribution.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"986\" data-original-width=\"1201\" height=\"526\" src=\"https://1.bp.blogspot.com/-ckwGYJUsZ7k/YMmPIJ5V7PI/AAAAAAAAC0Y/P24vXm5P9osCXFZXBIMaku0Ng2jjHa-rACLcBGAsYHQ/w640-h526/Economic%2Bcontribution.png\" width=\"640\" /></a></div><br /><div>YouTube creators (regardless of whether they are independent creative entrepreneurs*, media companies or the music industry) benefit from income that is generated directly via YouTube, for example, as advertising income or license fees. And we can see that the number of YouTube channels making five figures or more in revenue is up more than 30% year over year.&nbsp;</div><div>In addition, YouTube helps many creators earn income from additional sources - whether that’s generating revenue by promoting a brand on video, or selling more of a product thanks to their YouTube profile. This off-platform income leads to further economic effects: for the creators themselves, across the corresponding Australian supply chains - as creators purchase goods for filming or pay for services like video editing - and, in turn, through expenses by employees.&nbsp;</div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-bPq64O7rxd8/YMmPZrQBHVI/AAAAAAAAC0g/5OXgnayFm5MF39IZ-x6olhur3iMo1MvtACLcBGAsYHQ/s2284/Marion%2Bquote.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"435\" data-original-width=\"2284\" height=\"122\" src=\"https://1.bp.blogspot.com/-bPq64O7rxd8/YMmPZrQBHVI/AAAAAAAAC0g/5OXgnayFm5MF39IZ-x6olhur3iMo1MvtACLcBGAsYHQ/w640-h122/Marion%2Bquote.png\" width=\"640\" /></a></div><br /><div><b>What did we learn about YouTube Creators?&nbsp;</b></div><div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-WlaaZ5r-ZpU/YMmPhI1aGkI/AAAAAAAAC0k/R0xNGQQ6cA0H6zAqUvYb0aHQ6k4_uDJvgCLcBGAsYHQ/s1551/Channel%2Bgrowth.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"282\" data-original-width=\"1551\" height=\"116\" src=\"https://1.bp.blogspot.com/-WlaaZ5r-ZpU/YMmPhI1aGkI/AAAAAAAAC0k/R0xNGQQ6cA0H6zAqUvYb0aHQ6k4_uDJvgCLcBGAsYHQ/w640-h116/Channel%2Bgrowth.png\" width=\"640\" /></a></div>Australian creators are finding opportunities and audiences on YouTube, often leading to new doorways opening away from the platform. The report showed:&nbsp;</div><div><ul style=\"text-align: left;\"><li>67% of creative entrepreneurs said YouTube has had a positive impact on their professional goals.&nbsp;</li><li>68% of creators agreeing YouTube gives them the opportunity to work in a way that suits their needs.&nbsp;</li><li>50% of creative entrepreneurs indicated YouTube had brought them additional opportunities away from the platform.&nbsp;</li></ul></div><div><a href=\"https://www.youtube.com/user/ChloesAddiction\">Chloe Ting</a> is just one of our homegrown stars and now one of the biggest fitness YouTube creators in the world. Her channel gained more than 14 million subscribers in 2020 alone, as she inspired a global movement of people staying healthy, connected and uplifted, particularly during COVID-19. Her accessible virtual classes and challenges not only help people move their bodies, but support their mental health by giving them a sense of belonging and a place to feel supported.&nbsp;</div><div><b><br /></b></div><div><b>How are businesses using YouTube?</b>&nbsp;</div><div>YouTube has become a significant tool for small and medium sized businesses (SMBs). Through their own channel, targeted adverts or simply from watching YouTube content, businesses use YouTube to grow sales, connect with customers, and become more competitive.&nbsp;</div><div><ul style=\"text-align: left;\"><li>75% of SMBs who advertise on YouTube agreed that YouTube ads have helped them grow sales.&nbsp;</li><li>63% of SMBs with a YouTube channel agreed their YouTube presence helps customers to find them.&nbsp;</li><li>75% of SMBs agreed or strongly agreed that YouTube is a convenient and cost-effective way of providing staff training.&nbsp;</li><li>68% of users agree YouTube has helped them learn about new career paths.&nbsp;</li></ul></div><div>When Sanjna Pathania’s morning routine video working for \"The Big Four\" went viral on YouTube, the former risk management consultant set out to help young Aussies kick start their career by sharing her corporate lifestyle and the lessons she had learned along the way. Now, <a href=\"https://www.youtube.com/watch?v=JyjBqXXwCWc\">Success by Sanjna</a> is a one-stop shop for young people to get job-ready, and her strategies and insights are so in-demand, she’s left behind the corporate world and used her channel to launch a professional development consulting service. It’s all part of her mission to support a generation of confident and ambitious goal-chasers.&nbsp;</div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-5C1qA8YZV8A/YMmQGdWcEdI/AAAAAAAAC0w/1BhQFU5Vvw0Q6SAFg1JgExW6A-eLILKsgCLcBGAsYHQ/s665/Success%2Bby%2BSanjna.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"664\" data-original-width=\"665\" height=\"400\" src=\"https://1.bp.blogspot.com/-5C1qA8YZV8A/YMmQGdWcEdI/AAAAAAAAC0w/1BhQFU5Vvw0Q6SAFg1JgExW6A-eLILKsgCLcBGAsYHQ/w400-h400/Success%2Bby%2BSanjna.png\" width=\"400\" /></a></div><br /><div><b>Who are our creators? What are they saying?&nbsp;</b></div><div>Anyone can become a creator - all you need is an idea or a passion. YouTube offers people with different backgrounds, of any age and from all parts of Australia the opportunity to share their voice. Because of this open culture, YouTube has now become a kind of content library. This content not only has the potential to generate a social dialogue and build new communities, but also to drive social change.&nbsp;</div><div><ul style=\"text-align: left;\"><li>76% of creators agreed that YouTube provides a platform for undiscovered talent that is not being surfaced by traditional media.&nbsp;</li><li>64% of creators who self-identified as a minority agreed that they feel like they have a place to belong as a YouTube creator.&nbsp;</li><li>77% of users agreed that YouTube is home to diverse content.&nbsp;</li></ul></div><div>Each day, YouTube allows millions of new voices to be heard and stories to be told, and provides a place to belong for people around the world. Feeling alienated and alone when she was diagnosed with autism, <a href=\"https://www.youtube.com/channel/UC2ZkhMUYD37tboIJJgMz-MA\">Chloé Hayden</a> channelled her emotions into building a YouTube channel that welcomes - and celebrates - diverse Australian voices in a safe and comforting space. Chloé’s channel is a place for people to find safety, share their experiences and offer support to each other. And her 33 thousand subscribers are more than her audience - they’re her inspiration and championing their stories helps the 23-year-old change the mindsets of the wider community and normalise discussions around disabilities.&nbsp;</div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-uAT2YlGlFpc/YMmQfcgxNTI/AAAAAAAAC04/Q5KONfPm6j8mPnzU6w-EyAx0dS4LdC1OQCLcBGAsYHQ/s670/Chloe%2BHayden.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"592\" data-original-width=\"670\" height=\"354\" src=\"https://1.bp.blogspot.com/-uAT2YlGlFpc/YMmQfcgxNTI/AAAAAAAAC04/Q5KONfPm6j8mPnzU6w-EyAx0dS4LdC1OQCLcBGAsYHQ/w400-h354/Chloe%2BHayden.png\" width=\"400\" /></a></div><br /><div><b>Is local culture being exported?&nbsp;</b></div><div>Australian creators and artists punch above their weight and are receiving local and global recognition. And we’re proud that, whether it’s amplifying local voices like <a href=\"https://www.youtube.com/channel/UCWndyMK_Dbxv0YIGKRexzRA\">Baker Boy</a> or promoting uniquely Aussie content like <a href=\"https://www.youtube.com/watch?v=5O0DttNwlEk\">Brinkley Davies</a>, YouTube has enabled homegrown talent to access audiences around the world. In fact, the report has shown us:&nbsp;</div><div>97% of music and media companies with a YouTube channel agreed that the platform helps them reach new audiences across the world.&nbsp;</div><div>Over 90% of watch time on content produced by Australian channels came from outside Australia in 2020.</div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-rXSxUcp6mDw/YMmQuHv5LgI/AAAAAAAAC08/9Gbs3pWmSgwmmKFhIxb-wq5pBqi2fp0MgCLcBGAsYHQ/s2362/Miiesha%2Bquote.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"437\" data-original-width=\"2362\" height=\"118\" src=\"https://1.bp.blogspot.com/-rXSxUcp6mDw/YMmQuHv5LgI/AAAAAAAAC08/9Gbs3pWmSgwmmKFhIxb-wq5pBqi2fp0MgCLcBGAsYHQ/w640-h118/Miiesha%2Bquote.png\" width=\"640\" /></a></div><br /><div><b>What did we find in terms of “learning”?&nbsp;</b></div><div>More and more people are coming to YouTube to access information and learn something new, and with over 500 hours of video uploaded every minute, there are constantly new learning opportunities at people’s fingertips. In both private and professional life, YouTube enables Australians to acquire a wide range of skills and knowledge - to save money, gain qualifications or even make a career jump.&nbsp;</div><div><a href=\"https://www.youtube.com/channel/UCH6Oc4MAJzzmK0SM805ZnjQ\">Dr Matt &amp; Dr Mike</a> are one example of creators helping audiences expand their minds. The lecturers unpack the mysteries of science in front of hundreds of thousands of people and democratise education through their fun and easy-to-understand YouTube tutorials. They first created their short videos as extra student resources, but their simple and relatable style soon triggered a world-wide reaction, and the pair are now on a mission to give everyone free access to world-class science and medical education.&nbsp;</div><div>From teachers to parents, to small businesses and students, YouTube is enabling Australian users to acquire a wide range of skills and knowledge.&nbsp;</div><div><ul style=\"text-align: left;\"><li>70% of teachers who use YouTube agreed that the platform gives students the flexibility to learn at their own pace.&nbsp;</li><li>71% of parents who use YouTube agreed that YouTube (or YouTube Kids for children under 13) makes learning more fun for their children.&nbsp;</li><li>77% of users agree YouTube has helped them supplement their formal education.&nbsp;</li><li>92% of users said they use YouTube to gather information and knowledge.&nbsp;</li></ul></div><div>These acquired skills and knowledge don’t go to waste. Leo Bailey turned to YouTube tutorials to teach himself how to make a range of different products after buying his first 3D printer. But when he saw a call-out for health-care supplies during COVID-19, the 13-year-old focused his attention towards making essential PPE supplies for hospitals across the state. During the pandemic, Leo made more than 100 masks for health staff and touchless ‘button pushers’ for local residents to use in public spaces to avoid directly touching surfaces.&nbsp;</div><div><br /></div><div>To read more about Australian creators and the report findings at <a href=\"http://yt.be/howyoutubeworks\">yt.be/howyoutubeworks</a>.&nbsp;</div><div><br /></div><div><i>*The term creative entrepreneur here stands for YouTube creators, regardless of their gender identity, with at least 10,000 subscribers on their largest channel and for creators with fewer subscribers who receive funds directly from YouTube, generate funds from other sources with their YouTube videos and / or permanently employ other people to support their YouTube activities.&nbsp;</i></div><div><br /></div><div><b>About Oxford Economics: </b>Oxford Economics was founded in 1981 as a joint venture of Oxford University's Business College to provide economic forecasting and models for UK companies and financial institutions planning to expand abroad. Since its inception, the organisation has grown into one of the leading global and independent consulting firms in the world, providing reports, forecasting and analysis tools in over 200 countries, 250 industries and 7,000 cities and regions.&nbsp;</div><div>With headquarters in Oxford, England and regional centers in Frankfurt, London, New York and Singapore, Oxford Economics employs 400 full-time employees, including 250 economists, industry experts and business writers. The highly qualified team offers a wide range of research techniques and has groundbreaking expertise, including in areas such as econometric modeling, scenario framing and impact analyses, but also market surveys, case studies, expert panels and web analyses.&nbsp;</div><div><br /></div><div><span class=\"byline-author\">Posted by Ed Miles, Director, YouTube Partnerships, Australia and New Zealand</span></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "anzprteam",
    "uri": "http://www.blogger.com/profile/06099752084931732403",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}