{
  "title": "Episode 56: &#8220;Bye Bye Love&#8221; by the Everly Brothers",
  "link": "https://500songs.com/podcast/episode-56-bye-bye-love-by-the-everly-brothers/",
  "pubDate": "Mon, 11 Nov 2019 17:29:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=572",
  "description": "<p>Episode fifty-six of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Bye Bye Love\" by The Everly Brotherss, and at the history of country close harmony. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n\n\n\n<p>Patreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/31476037\">on \"Short Fat Fannie\" by Larry Williams</a>.</p>\n\n\n\n\n\n<p><strong>Resources</strong></p>\n\n\n\n<p>As always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-56-bye-bye-love/\">Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.</p>\n\n\n\n<p>There are no first-rate biographies of the Everly Brothers in print, at least in English (apparently there's a decent one in French, but I don't speak French well enough for that).&nbsp;<a href=\"https://amzn.to/2CvoMSj\"><em>Ike's Boys</em>&nbsp;by Phyllis Karp</a>&nbsp;is the only full-length bio,&nbsp; and I relied on that in the absence of anything else, but it's been out of print for nearly thirty years, and is not worth the exorbitant price it goes for second-hand.</p>\n\n\n\n<p><a href=\"https://amzn.to/2qLkeo7\"><em>How Nashville Became Music City&nbsp;</em>by Michael Kosser</a>&nbsp;has a good amount of information on the Bryants.</p>\n\n\n\n<p><a href=\"http://www.hillmanweb.com/everly/refs/\">The Everlypedia</a>&nbsp;is a series of PDFs containing articles on anything related to the Everly Brothers, in alphabetical order.</p>\n\n\n\n<p>There are many, many cheap compilations of the Everly Brothers' early material available. I'd recommend&nbsp;<a href=\"https://amzn.to/2NyG6fq\">this one</a>, because as well as all the hits up to 1962 it has the complete&nbsp;<em>Songs our Daddy Taught Us.</em></p>\n\n\n\n<p><strong>Patreon</strong></p>\n\n\n\n<p>This podcast is brought to you by the generosity of my backers on Patreon.&nbsp;<a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a></p>\n\n\n\n<p><strong>Transcript</strong></p>\n\n\n\n<p>[Intro: Ike Everly introducing the Everly Brothers]</p>\n\n\n\n<p>We've talked before about how vocal harmonies are no longer a big part of rock music, but were essential to it in the fifties and sixties. But what we've not discussed is that there are multiple different types of harmony that we see in the music of that period.</p>\n\n\n\n<p>One, which we've already seen, is the vocal group sound -- the sound of doo-wop. There, there might be a lead singer, but everyone involved has their own important role to play, singing separate backing vocal lines that intertwine. One singer will be taking a bass melody, another will be singing a falsetto line, and so on. It's the sound of a collection of individual personalities, working together but to their own agendas.</p>\n\n\n\n<p>Another style which we're going to look at soon is the girl group sound. There you have a lead singer singing a line on her own, and two or three backing vocalists echoing lines on the chorus -- it's the sound of a couple of friends providing support for someone who's in trouble. The lead singer will sing her problems, and the friends will respond with something supportive.</p>\n\n\n\n<p>Then there's the style which Elvis used -- a single lead vocalist over a group of backing vocalists, mostly providing \"oohs\" and \"aahs\". The backing vocals here just work as another instrumental texture.</p>\n\n\n\n<p>But there's one style which would be as influential as any of these, and which was brought into rock and roll by a single act -- a duo who, more than anyone else in rock music, epitomised vocal harmony:</p>\n\n\n\n<p>[Excerpt: The Everly Brothers, \"Bye Bye Love\"]</p>\n\n\n\n<p>Don and Phil Everly were brought up in music. Their father, Ike Everly, had been a coalminer in Muhlenberg County, Kentucky, but decided to quit coal mining and become a professional musician when he was trapped in his second cave-in, deciding he wasn't ever going to go through that a third time. He had learned a particular guitar style, which would later become known as \"Travis picking\" after its most famous exponent, Merle Travis -- though Travis himself usually referred to it as \"Muhlenberg picking\". Travis and Ike Everly knew each other, and it was Ike Everly, and Ike's friend Mose Rager, who taught Travis how to play in that style, which they had learned from another friend, Kennedy Jones, who in turn learned it from a black country-blues player named Arnold Schultz, who had invented the style:</p>\n\n\n\n<p>[Excerpt, Ike Everly, \"Blue Smoke\"]</p>\n\n\n\n<p>Ike Everly was widely regarded as one of the greatest country guitarists of all time, and his \"Ike Everly's Rag\" was later recorded by Merle Travis and Joe Maphis:</p>\n\n\n\n<p>[Excerpt: Merle Travis and Joe Maphis, \"Ike Everly's Rag\"]</p>\n\n\n\n<p>But while Ike Everly was known as a country player, Don Everly would always later claim that deep down Ike was a blues man. He played country because that was what the audiences wanted to hear, but his first love was the blues.</p>\n\n\n\n<p>But even when playing country, he wasn't just playing the kind of music that was becoming popular at the time, but he was also playing the old Appalachian folk songs, and teaching them to his sons. He would play songs like \"Who's Going to Shoe Your Pretty Little Feet?\", which was most famously recorded by Woody Guthrie:</p>\n\n\n\n<p>[Excerpt: Woody Guthrie, \"Who's Gonna Shoe Your Pretty Little Feet?\"]</p>\n\n\n\n<p>The Everly family travelled all over the South and Midwest, moving between radio stations on which Ike Everly would get himself shows. As they grew old enough, his two sons, Don and Phil, would join him, as would his wife, though Margaret Everly was more of a manager than a performer. Don soon became good enough that he got his own fifteen-minute show, performing as \"Little Donnie\", as well as performing with his family.</p>\n\n\n\n<p>The Everly family would perform their show live, first thing in the morning -- they were playing country music and so they were supposed to be playing for the farmers, and their show began at 5AM, with the young boys heading off to school, still in the dark, after the show had finished.</p>\n\n\n\n<p>The radio show continued for many years, and the boys developed all sorts of tricks for keeping an audience entertained, which would stand them in good stead in future years. One thing they used to do was to have both brothers and their father play the same guitar simultaneously, with Phil fretting the bass notes, Ike Everly playing those notes, and Don playing lead on the top strings.</p>\n\n\n\n<p>I've not found a recording of them doing that together, but some footage does exist of them doing this with Tennessee Ernie Ford on his TV show -- Ford, of course, being someone whose biggest hit had been written by Ike Everly's old friend Merle Travis:</p>\n\n\n\n<p>[Excerpt: Tennessee Ernie Ford and the Everly Brothers, \"Rattlesnake Daddy\"]</p>\n\n\n\n<p>That kind of trick was fairly common among country acts at the time -- Buck Owens and Don Rich would do pretty much the same act together in the 1960s, and like the Everlys would play fairly straightforward blues licks while doing it.</p>\n\n\n\n<p>But while Ike Everly was primarily an instrumentalist, his sons would become known mostly as singers.</p>\n\n\n\n<p>People often, incorrectly, describe the Everly Brothers as singing \"bluegrass harmonies\". This is understandable, as bluegrass music comes from Kentucky, and does often have close harmonies in it. But the Everlys were actually singing in a style that was around for years before Bill Monroe started performing the music that would become known as bluegrass.</p>\n\n\n\n<p>There was a whole tradition of close harmony in country music that is usually dated back to the 1920s. The first people to really popularise it were a duo who were known as \"Mac and Bob\" -- Lester McFarland and Robert Gardner. The two men met in Kentucky, at the Kentucky School for the Blind, where they were both studying music, in 1916. They started singing close harmony together in the early 1920s, and while they sang in the overly-enunciated way that was popular at the time, you can hear the roots of the Everlys' style in their harmonies:</p>\n\n\n\n<p>[Excerpt: McFarland and Gardner, \"That Silver Haired Daddy of Mine\"]</p>\n\n\n\n<p>The style is known as \"close harmony\" because the singers are singing notes that are close to each other in the scale, and it was the foundation of country vocal harmonies. Usually in this style, there are two singers, singing about a third apart. The lower singer will sing the melody, while the higher singer will harmonise, following the melody line closely.</p>\n\n\n\n<p>This style of harmony was particularly suited to the vocal blend you can get from siblings, who tend to have extremely similar voices -- and if done well it can sound like one voice harmonising with itself. And so from the 1930s on there were a lot of brother acts who performed this kind of music. One duo who the Everlys would often point to as a particular influence was the Bailes Brothers:</p>\n\n\n\n<p>[Excerpt: the Bailes Brothers, \"Oh So Many Years\"]</p>\n\n\n\n<p>But at the time the Everly Brothers were coming up, there was one duo, more than any other, who were immensely popular in the close harmony style -- the Louvin Brothers:</p>\n\n\n\n<p>[Excerpt: The Louvin Brothers, \"Midnight Special\"]</p>\n\n\n\n<p>The Louvin Brothers, Charlie and Ira, were cousins of John D. Loudermilk, whose \"Sittin' in the Balcony\" we heard in the Eddie Cochran episode a few weeks ago. They were country and gospel singers, who are nowadays probably sadly best known for the cover of their album \"Satan is Real\", which often makes those Internet listicles about the most ridiculous album covers. But in the mid fifties, they were one of the most popular groups in country music, and influenced everyone -- they were particular favourites of Elvis, and regular performers on the Grand Ole Opry.</p>\n\n\n\n<p>Their style was a model for the Everlys, but sadly so was their personal relationship. Ira and Charlie never got on, and would often get into fights on stage, and the same was true of the Everly Brothers. In 1970, Phil Everly said \"We've only ever had one argument. It's lasted twenty-five years\", and that argument would continue for the rest of their lives.</p>\n\n\n\n<p>There were various explanations offered for their enmity over the years, ranging from them vying to be their father's favourite, to Don resenting Phil's sweeter voice upstaging him -- he was once quoted as saying \"I've been a has-been since I was ten\". But fundamentally the two brothers were just too different in everything from temperament to politics -- Don is a liberal Democrat, while Phil was a conservative Republican -- and their views on how life should be lived. It seems most likely that two such different people resented being forced into constant proximity with each other, and reacted against it.</p>\n\n\n\n<p>And so the Everlys became another of those sibling rivalries that have recurred throughout rock and roll history. But despite their personal differences, they had a vocal blend that was possibly even better than that of the Louvins, if that's possible.</p>\n\n\n\n<p>But talent on its own doesn't necessarily bring success, and for a while it looked like the Everlys were going to be washed up before the brothers got out of their teens. While they had some success with their radio show, by 1955 there was much less of a market for live music on the radio -- it was much cheaper for the radio stations to employ DJs to play records, now that the legal ban on broadcasting recordings had been lifted.</p>\n\n\n\n<p>The Everly family's radio show ended, and both Ike and Margaret got jobs cutting hair, while encouraging their sons in their music career. After a few months of this, Margaret decided she was going to move the boys to Nashville, to try to get them a record deal, while Ike remained in nearby Knoxville working as a barber.</p>\n\n\n\n<p>While the family had not had much success in the music industry, they had made contacts with several people, and Chet Atkins, in particular, was an admirer, not only of Ike Everly's guitar playing, but of his barbering skills as well -- according to at least one account I've read, Atkins was a regular customer of Ike's.</p>\n\n\n\n<p>Atkins seems to have been, at first, mostly interested in Don Everly as a songwriter and maybe a solo performer -- he carried out some correspondence with Don while Don was still in school, and got Kitty Wells, one of the biggest country stars of the fifties, to record one of Don's songs, \"Thou Shalt Not Steal\", when Don was only sixteen:</p>\n\n\n\n<p>[Excerpt: Kitty Wells, \"Thou Shalt Not Steal\"]</p>\n\n\n\n<p>That became a top twenty country hit, and Don looked like he might be on his way to a successful career, especially after another of his songs, \"Here We Are Again\", was recorded by Anita Carter of the famous Carter family:</p>\n\n\n\n<p>[Excerpt: Anita Carter, \"Here We Are Again\"]</p>\n\n\n\n<p>But Margaret Everly, the Everlys' mother and the person who seemed to have the ambition that drove them, didn't want Don to be a solo star -- she wanted the two brothers to be equal in every way, and would make sure they wore the same clothes, had the same toys growing up, and so on. She took Don's royalties from songwriting, and used them to get both brothers Musicians' union cards -- in the same way, when Don had had his own radio show, Margaret had made Don give Phil half of his five-dollar fee.</p>\n\n\n\n<p>So solo stardom was never going to be in Don Everly's future. Margaret wanted the Everly Brothers to be a successful duo, and that was that. Chet Atkins was going to help *both* her sons.</p>\n\n\n\n<p>Atkins got them a deal with Columbia Records in 1956 for a single, \"Keep A-Lovin' Me\", written by Don:</p>\n\n\n\n<p>[Excerpt: The Everly Brothers, \"Keep A-Lovin' Me\"]</p>\n\n\n\n<p>That record flopped, and the Everlys were later very dismissive of it -- Phil said of the two songs on that single \"they were stinko, boy! Really stinko!\" Columbia weren't interested in putting out anything else by the Everlys, and quickly dropped them.</p>\n\n\n\n<p>Part of the reason was that they were signed as a country act, but they already wanted to do more, and in particular to incorporate more influence from the rhythm and blues music they were listening to. Don worshipped Hank Williams, and Phil loved Lefty Frizzell, but they both also adored Bo Diddley, and were obsessed with his style.</p>\n\n\n\n<p>Don, in particular -- who was the more accomplished instrumentalist of the two, and who unlike Phil would play rhythm guitar on their records -- wanted to learn how Diddley played guitar, and would spend a lot of time with Chet Atkins, who taught him how to play in the open tunings Diddley used, and some of the rhythms he was playing with.</p>\n\n\n\n<p>Despite the brothers' lack of success on Columbia, Atkins still had faith in them, and he got in touch with his friend Wesley Rose, who was the president of Acuff-Rose publishing, the biggest music publishing company in Nashville at the time.</p>\n\n\n\n<p>Rose made a deal with the brothers. If they would sign to Acuff-Rose as songwriters, and if they'd agree to record only Acuff-Rose songs, he would look after their career and get them a record deal. They agreed, and Rose got them signed to Cadence Records, a mid-sized indie label whose biggest star at the time was Andy Williams.</p>\n\n\n\n<p>The first single they recorded for Cadence was a song that had been rejected by thirty other artists before it was passed on to the Everlys as a last resort.</p>\n\n\n\n<p>\"Bye Bye Love\" was written by the husband and wife team Felice and Boudleaux Bryant, who had been writing for a decade, for people such as Carl Smith and Moon Mullican. Their first hit had come in 1948, with \"Country Boy\", a song which Little Jimmy Dickens took to number seven on the country charts:</p>\n\n\n\n<p>[Excerpt: Little Jimmy Dickens, \"Country Boy\"]</p>\n\n\n\n<p>But they had not had much chart success after that, though they'd placed songs with various Nashville-based country singers. They were virtual unknowns, and their most recent song, \"Bye Bye Love\", had been written for a duo called Johnny and Jack. They hadn't been interested, so the Bryants had passed the song along to their friend Chet Atkins, who had tried to record it with Porter Wagoner, who had recorded other songs by the Bryants, like \"Tryin' to Forget the Blues\":</p>\n\n\n\n<p>[Excerpt: Porter Wagoner, \"Tryin' to Forget the Blues\"]</p>\n\n\n\n<p>But when Atkins took the song into the studio, he decided it wasn't strong enough for Wagoner. Atkins wanted to change a few chords, and Boudleaux Bryant told him that if the song wasn't strong enough as it was, he just shouldn't record it at all.</p>\n\n\n\n<p>But while the song might not have been strong enough for a big country star like Porter Wagoner, it was strong enough for Chet Atkins' new proteges, who were, after all, hardly going to have a big hit. So Atkins took the multiply-rejected song in for the duo to record as their first single for Cadence.</p>\n\n\n\n<p>In one of those coincidences that seems too good to be true, Ike Everly was Boudleaux Bryant's barber, and had been bragging to him for years about how talented his sons were, but Bryant had just dismissed this -- around Nashville, everyone is a major talent, or their son or daughter or husband or wife is.</p>\n\n\n\n<p>Two things happened to change the rather mediocre song into a classic that would change the face of popular music. The first was, simply, the brothers' harmonies. They had by this point developed an intuitive understanding of each other's voices, and a superb musicality. It's interesting to listen to the very first take of the song:</p>\n\n\n\n<p>[Excerpt: The Everly Brothers, \"Bye Bye Love (take 1)\"]</p>\n\n\n\n<p>That's Don singing the low lead and Phil taking the high harmony.</p>\n\n\n\n<p>Now, if you're familiar with the finished record, you can tell that what Phil's singing there isn't the closer harmony part he ended up singing on the final version. There are some note choices there that he decided against for the final record. But what you can tell is that they are instinctively great harmony singers. It's not the harmony part that would become famous, but it's a *good* one in its own right.</p>\n\n\n\n<p>The second thing is that they changed the song from the rather sedate country song the Bryants had come up with, radically rearranging it.</p>\n\n\n\n<p>Don had written a song called \"Give Me a Future\", which he'd intended to be in the Bo Diddley style, and one can hear something of Diddley's rhythm in the stop-start guitar part:</p>\n\n\n\n<p>[Excerpt: The Everly Brothers, \"Give Me a Future\"]</p>\n\n\n\n<p>Don took that guitar part, and attached it to the Bryants' song, and with the help of Chet Atkins' lead guitar fills turned it into something quite new -- a record with a rockabilly feel, but with country close harmony vocals:</p>\n\n\n\n<p>[Excerpt: The Everly Brothers, \"Bye Bye Love\"]</p>\n\n\n\n<p>The brothers were, at first, worried because almost as soon as it came out, a cover version by Webb Pierce, one of the biggest names in country music, came out:</p>\n\n\n\n<p>[Excerpt: Webb Pierce, \"Bye Bye Love\"]</p>\n\n\n\n<p>But they were surprised to discover that while Pierce's version did chart -- reaching the top ten in the country charts -- it was nowhere near as successful as their own version, which went to number one on the country charts and number two in pop, and charted on the R&B charts as well.</p>\n\n\n\n<p>After that success, the Bryants wrote a string of hits for the brothers, a run of classics starting with \"Wake Up Little Suzie\", a song which was banned on many stations because it suggested impropriety -- even though, listening to the lyrics, it very clearly states that no impropriety has gone on, and indeed that the protagonist is horrified at the suggestion that it might have:</p>\n\n\n\n<p>[Excerpt: The Everly Brothers, \"Wake Up Little Suzie\"]</p>\n\n\n\n<p>These records would usually incorporate some of Don's Bo Diddley influence, while remaining firmly in the country end of rock and roll. The Bryants also started to give the brothers ballads like \"Devoted to You\" and \"All I Have to Do is Dream\", which while they still deal with adolescent concerns, have a sweetness and melody to them quite unlike anything else that was being recorded by rock and roll artists of the time.</p>\n\n\n\n<p>After the first single, everything else that the Bryants wrote for the Everlys was tailored specifically to them -- Boudleaux Bryant, who would attend more of the sessions, would have long conversations with the brothers and try to write songs that fit with their lives and musical tastes, as well as fitting them to their voices.</p>\n\n\n\n<p>One of the things that's very noticeable about interviews with the brothers is that they both tend to credit Boudleaux alone with having written the songs that he co-wrote with his wife, even though everything suggests that the Bryants were a true partnership, and both have solo credits for songs that are stylistically indistinguishable from those written as a team. Whether this is pure sexism, or it's just because Boudleaux is the one who used to demo the songs for them and so they think of him as the primary author, is hard to tell -- probably a combination.</p>\n\n\n\n<p>This was also a perception that Boudleaux Bryant encouraged. While Felice was the person who had originally decided to go into songwriting, and was the one who came up with most of the ideas, Boudleaux was only interested in making money -- and he'd often sneak off to write songs by himself so he would get all the money rather than have to share it with his wife. Boudleaux would also on occasion be given incomplete songs by friends like Atkins, and finish them up with Felice -- but only Boudleaux and the original writer would get their names on it.</p>\n\n\n\n<p>The result was that Boudleaux got the credit from people around him, even when they knew better. One of my sources for this episode is an interview with the Bryants' son, Dane, and at one point in that interview he says \"Now, lots of times I will say, 'My father.' I mean Dad and Mom\".</p>\n\n\n\n<p>As the Everly brothers disagreed about almost everything, they of course disagreed about the quality of the material that the Bryants were bringing them. Phil Everly was always utterly unstinting in his praise of them, saying that the Bryants' songs were some of the best songs ever written.</p>\n\n\n\n<p>Don, on the other hand, while he definitely appreciated material like \"All I Have to Do is Dream\", wasn't so keen on their writing in general, mostly because it dealt primarily with adolescent concerns. He thought that the material the brothers were writing for themselves -- though still immature, as one would expect from people who were still in their teens at the start of their career -- was aiming at a greater emotional maturity than the material the Bryants wrote.</p>\n\n\n\n<p>And on the evidence of their first album, that's certainly true. The first album is, like many albums of the time, a patchy affair. It pulls together the hit singles the brothers had already released, together with a bunch of rather mediocre cover versions of then-current hits. Those cover versions tend to support Don's repeated claims that the brothers were as interested in R&B and blues as in country -- apart from a version of \"Be-Bop-A-Lula\", all the covers are of R&B hits of the time -- two by Little Richard, two by Ray Charles, and one by the relatively obscure blues singer Titus Turner.</p>\n\n\n\n<p>But among those songs, there are also a handful of Don Everly originals, and one in particular, \"I Wonder if I Care as Much\", is quite an astonishing piece of songwriting:</p>\n\n\n\n<p>[Excerpt: The Everly Brothers, \"I Wonder If I Care As Much\"]</p>\n\n\n\n<p>Don's songs were often B-sides – that one was the B-side to “Bye Bye Love” – and to my mind they're often rather more interesting than the A-sides.</p>\n\n\n\n<p>While that first album is rather patchy, the second album, Songs Our Daddy Taught Us, is a minor revelation, and one of the pillars on which the Everly Brothers' artistic reputation rests. It's been suggested that the album was done as a way of getting back at the record company for some slight or other, by making a record that was completely uncommercial. That might be the case, but I don't think so -- and if it was, it was a gesture that backfired magnificently, as it's still, sixty years on, a consistent seller.</p>\n\n\n\n<p>Songs Our Daddy Taught Us is precisely what it sounds like -- an album consisting of songs the brothers had been taught by their father. It's a mixture of Appalachian folk songs and country standards, performed by the brothers accompanied just by Don's acoustic guitar and Floyd Chance on upright bass:</p>\n\n\n\n<p>[Excerpt: The Everly Brothers, “Who's Gonna Shoe Your Pretty Little Feet?”]</p>\n\n\n\n<p>It's quite possibly the most artistically satisfying album made in the fifties by a rock and roll act, and it's had such an influence that as recently as 2013 Billie Joe Armstrong of Green Day and the jazz-pop singer Norah Jones recorded an album, Foreverly, that's just a cover version of the whole album:</p>\n\n\n\n<p>[Excerpt: Billie Joe Armstrong and Norah Jones, “Who's Gonna Shoe Your Pretty Little Feet?”]</p>\n\n\n\n<p>So as the 1950s drew to a close, the Everly Brothers were on top of the world. They'd had a run of classic singles, and they'd just released one of the greatest albums of all time. But there was trouble ahead, and when we pick up on their career again, we'll see exactly how wrong things could go for them.</p>",
  "itunes:subtitle": "Episode fifty-six of A History of Rock Music in Five Hundred Songs looks at Bye Bye Love by The Everly Brotherss, and at the history of country close harmony. Click the full post to read liner notes, links to more information, and a transcript of the epi",
  "itunes:keywords": "Bo Diddley,Cadence Records,Chet Atkins,country and western,Don Everly,Felice and Boudleaux Bryant,folk music,Ike Everly,Louvin Brothers,Merle Travis,Phil Everly,Tennessee Ernie Ford,The Everly Brothers,vocal groups",
  "itunes:episodeType": "full",
  "itunes:episode": 56,
  "content:encoded": "<p>Episode fifty-six of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Bye Bye Love\" by The Everly Brotherss, and at the history of country close harmony. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n\n\n\n<p>Patreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/31476037\">on \"Short Fat Fannie\" by Larry Williams</a>.</p>\n\n\n\n\n\n<p><strong>Resources</strong></p>\n\n\n\n<p>As always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-56-bye-bye-love/\">Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.</p>\n\n\n\n<p>There are no first-rate biographies of the Everly Brothers in print, at least in English (apparently there's a decent one in French, but I don't speak French well enough for that).&nbsp;<a href=\"https://amzn.to/2CvoMSj\"><em>Ike's Boys</em>&nbsp;by Phyllis Karp</a>&nbsp;is the only full-length bio,&nbsp; and I relied on that in the absence of anything else, but it's been out of print for nearly thirty years, and is not worth the exorbitant price it goes for second-hand.</p>\n\n\n\n<p><a href=\"https://amzn.to/2qLkeo7\"><em>How Nashville Became Music City&nbsp;</em>by Michael Kosser</a>&nbsp;has a good amount of information on the Bryants.</p>\n\n\n\n<p><a href=\"http://www.hillmanweb.com/everly/refs/\">The Everlypedia</a>&nbsp;is a series of PDFs containing articles on anything related to the Everly Brothers, in alphabetical order.</p>\n\n\n\n<p>There are many, many cheap compilations of the Everly Brothers' early material available. I'd recommend&nbsp;<a href=\"https://amzn.to/2NyG6fq\">this one</a>, because as well as all the hits up to 1962 it has the complete&nbsp;<em>Songs our Daddy Taught Us.</em></p>\n\n\n\n<p><strong>Patreon</strong></p>\n\n\n\n<p>This podcast is brought to you by the generosity of my backers on Patreon.&nbsp;<a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a></p>\n\n\n\n<p><strong>Transcript</strong></p>\n\n\n\n<p>[Intro: Ike Everly introducing the Everly Brothers]</p>\n\n\n\n<p>We've talked before about how vocal harmonies are no longer a big part of rock music, but were essential to it in the fifties and sixties. But what we've not discussed is that there are multiple different types of harmony that we see in the music of that period.</p>\n\n\n\n<p>One, which we've already seen, is the vocal group sound -- the sound of doo-wop. There, there might be a lead singer, but everyone involved has their own important role to play, singing separate backing vocal lines that intertwine. One singer will be taking a bass melody, another will be singing a falsetto line, and so on. It's the sound of a collection of individual personalities, working together but to their own agendas.</p>\n\n\n\n<p>Another style which we're going to look at soon is the girl group sound. There you have a lead singer singing a line on her own, and two or three backing vocalists echoing lines on the chorus -- it's the sound of a couple of friends providing support for someone who's in trouble. The lead singer will sing her problems, and the friends will respond with something supportive.</p>\n\n\n\n<p>Then there's the style which Elvis used -- a single lead vocalist over a group of backing vocalists, mostly providing \"oohs\" and \"aahs\". The backing vocals here just work as another instrumental texture.</p>\n\n\n\n<p>But there's one style which would be as influential as any of these, and which was brought into rock and roll by a single act -- a duo who, more than anyone else in rock music, epitomised vocal harmony:</p>\n\n\n\n<p>[Excerpt: The Everly Brothers, \"Bye Bye Love\"]</p>\n\n\n\n<p>Don and Phil Everly were brought up in music. Their father, Ike Everly, had been a coalminer in Muhlenberg County, Kentucky, but decided to quit coal mining and become a professional musician when he was trapped in his second cave-in, deciding he wasn't ever going to go through that a third time. He had learned a particular guitar style, which would later become known as \"Travis picking\" after its most famous exponent, Merle Travis -- though Travis himself usually referred to it as \"Muhlenberg picking\". Travis and Ike Everly knew each other, and it was Ike Everly, and Ike's friend Mose Rager, who taught Travis how to play in that style, which they had learned from another friend, Kennedy Jones, who in turn learned it from a black country-blues player named Arnold Schultz, who had invented the style:</p>\n\n\n\n<p>[Excerpt, Ike Everly, \"Blue Smoke\"]</p>\n\n\n\n<p>Ike Everly was widely regarded as one of the greatest country guitarists of all time, and his \"Ike Everly's Rag\" was later recorded by Merle Travis and Joe Maphis:</p>\n\n\n\n<p>[Excerpt: Merle Travis and Joe Maphis, \"Ike Everly's Rag\"]</p>\n\n\n\n<p>But while Ike Everly was known as a country player, Don Everly would always later claim that deep down Ike was a blues man. He played country because that was what the audiences wanted to hear, but his first love was the blues.</p>\n\n\n\n<p>But even when playing country, he wasn't just playing the kind of music that was becoming popular at the time, but he was also playing the old Appalachian folk songs, and teaching them to his sons. He would play songs like \"Who's Going to Shoe Your Pretty Little Feet?\", which was most famously recorded by Woody Guthrie:</p>\n\n\n\n<p>[Excerpt: Woody Guthrie, \"Who's Gonna Shoe Your Pretty Little Feet?\"]</p>\n\n\n\n<p>The Everly family travelled all over the South and Midwest, moving between radio stations on which Ike Everly would get himself shows. As they grew old enough, his two sons, Don and Phil, would join him, as would his wife, though Margaret Everly was more of a manager than a performer. Don soon became good enough that he got his own fifteen-minute show, performing as \"Little Donnie\", as well as performing with his family.</p>\n\n\n\n<p>The Everly family would perform their show live, first thing in the morning -- they were playing country music and so they were supposed to be playing for the farmers, and their show began at 5AM, with the young boys heading off to school, still in the dark, after the show had finished.</p>\n\n\n\n<p>The radio show continued for many years, and the boys developed all sorts of tricks for keeping an audience entertained, which would stand them in good stead in future years. One thing they used to do was to have both brothers and their father play the same guitar simultaneously, with Phil fretting the bass notes, Ike Everly playing those notes, and Don playing lead on the top strings.</p>\n\n\n\n<p>I've not found a recording of them doing that together, but some footage does exist of them doing this with Tennessee Ernie Ford on his TV show -- Ford, of course, being someone whose biggest hit had been written by Ike Everly's old friend Merle Travis:</p>\n\n\n\n<p>[Excerpt: Tennessee Ernie Ford and the Everly Brothers, \"Rattlesnake Daddy\"]</p>\n\n\n\n<p>That kind of trick was fairly common among country acts at the time -- Buck Owens and Don Rich would do pretty much the same act together in the 1960s, and like the Everlys would play fairly straightforward blues licks while doing it.</p>\n\n\n\n<p>But while Ike Everly was primarily an instrumentalist, his sons would become known mostly as singers.</p>\n\n\n\n<p>People often, incorrectly, describe the Everly Brothers as singing \"bluegrass harmonies\". This is understandable, as bluegrass music comes from Kentucky, and does often have close harmonies in it. But the Everlys were actually singing in a style that was around for years before Bill Monroe started performing the music that would become known as bluegrass.</p>\n\n\n\n<p>There was a whole tradition of close harmony in country music that is usually dated back to the 1920s. The first people to really popularise it were a duo who were known as \"Mac and Bob\" -- Lester McFarland and Robert Gardner. The two men met in Kentucky, at the Kentucky School for the Blind, where they were both studying music, in 1916. They started singing close harmony together in the early 1920s, and while they sang in the overly-enunciated way that was popular at the time, you can hear the roots of the Everlys' style in their harmonies:</p>\n\n\n\n<p>[Excerpt: McFarland and Gardner, \"That Silver Haired Daddy of Mine\"]</p>\n\n\n\n<p>The style is known as \"close harmony\" because the singers are singing notes that are close to each other in the scale, and it was the foundation of country vocal harmonies. Usually in this style, there are two singers, singing about a third apart. The lower singer will sing the melody, while the higher singer will harmonise, following the melody line closely.</p>\n\n\n\n<p>This style of harmony was particularly suited to the vocal blend you can get from siblings, who tend to have extremely similar voices -- and if done well it can sound like one voice harmonising with itself. And so from the 1930s on there were a lot of brother acts who performed this kind of music. One duo who the Everlys would often point to as a particular influence was the Bailes Brothers:</p>\n\n\n\n<p>[Excerpt: the Bailes Brothers, \"Oh So Many Years\"]</p>\n\n\n\n<p>But at the time the Everly Brothers were coming up, there was one duo, more than any other, who were immensely popular in the close harmony style -- the Louvin Brothers:</p>\n\n\n\n<p>[Excerpt: The Louvin Brothers, \"Midnight Special\"]</p>\n\n\n\n<p>The Louvin Brothers, Charlie and Ira, were cousins of John D. Loudermilk, whose \"Sittin' in the Balcony\" we heard in the Eddie Cochran episode a few weeks ago. They were country and gospel singers, who are nowadays probably sadly best known for the cover of their album \"Satan is Real\", which often makes those Internet listicles about the most ridiculous album covers. But in the mid fifties, they were one of the most popular groups in country music, and influenced everyone -- they were particular favourites of Elvis, and regular performers on the Grand Ole Opry.</p>\n\n\n\n<p>Their style was a model for the Everlys, but sadly so was their personal relationship. Ira and Charlie never got on, and would often get into fights on stage, and the same was true of the Everly Brothers. In 1970, Phil Everly said \"We've only ever had one argument. It's lasted twenty-five years\", and that argument would continue for the rest of their lives.</p>\n\n\n\n<p>There were various explanations offered for their enmity over the years, ranging from them vying to be their father's favourite, to Don resenting Phil's sweeter voice upstaging him -- he was once quoted as saying \"I've been a has-been since I was ten\". But fundamentally the two brothers were just too different in everything from temperament to politics -- Don is a liberal Democrat, while Phil was a conservative Republican -- and their views on how life should be lived. It seems most likely that two such different people resented being forced into constant proximity with each other, and reacted against it.</p>\n\n\n\n<p>And so the Everlys became another of those sibling rivalries that have recurred throughout rock and roll history. But despite their personal differences, they had a vocal blend that was possibly even better than that of the Louvins, if that's possible.</p>\n\n\n\n<p>But talent on its own doesn't necessarily bring success, and for a while it looked like the Everlys were going to be washed up before the brothers got out of their teens. While they had some success with their radio show, by 1955 there was much less of a market for live music on the radio -- it was much cheaper for the radio stations to employ DJs to play records, now that the legal ban on broadcasting recordings had been lifted.</p>\n\n\n\n<p>The Everly family's radio show ended, and both Ike and Margaret got jobs cutting hair, while encouraging their sons in their music career. After a few months of this, Margaret decided she was going to move the boys to Nashville, to try to get them a record deal, while Ike remained in nearby Knoxville working as a barber.</p>\n\n\n\n<p>While the family had not had much success in the music industry, they had made contacts with several people, and Chet Atkins, in particular, was an admirer, not only of Ike Everly's guitar playing, but of his barbering skills as well -- according to at least one account I've read, Atkins was a regular customer of Ike's.</p>\n\n\n\n<p>Atkins seems to have been, at first, mostly interested in Don Everly as a songwriter and maybe a solo performer -- he carried out some correspondence with Don while Don was still in school, and got Kitty Wells, one of the biggest country stars of the fifties, to record one of Don's songs, \"Thou Shalt Not Steal\", when Don was only sixteen:</p>\n\n\n\n<p>[Excerpt: Kitty Wells, \"Thou Shalt Not Steal\"]</p>\n\n\n\n<p>That became a top twenty country hit, and Don looked like he might be on his way to a successful career, especially after another of his songs, \"Here We Are Again\", was recorded by Anita Carter of the famous Carter family:</p>\n\n\n\n<p>[Excerpt: Anita Carter, \"Here We Are Again\"]</p>\n\n\n\n<p>But Margaret Everly, the Everlys' mother and the person who seemed to have the ambition that drove them, didn't want Don to be a solo star -- she wanted the two brothers to be equal in every way, and would make sure they wore the same clothes, had the same toys growing up, and so on. She took Don's royalties from songwriting, and used them to get both brothers Musicians' union cards -- in the same way, when Don had had his own radio show, Margaret had made Don give Phil half of his five-dollar fee.</p>\n\n\n\n<p>So solo stardom was never going to be in Don Everly's future. Margaret wanted the Everly Brothers to be a successful duo, and that was that. Chet Atkins was going to help *both* her sons.</p>\n\n\n\n<p>Atkins got them a deal with Columbia Records in 1956 for a single, \"Keep A-Lovin' Me\", written by Don:</p>\n\n\n\n<p>[Excerpt: The Everly Brothers, \"Keep A-Lovin' Me\"]</p>\n\n\n\n<p>That record flopped, and the Everlys were later very dismissive of it -- Phil said of the two songs on that single \"they were stinko, boy! Really stinko!\" Columbia weren't interested in putting out anything else by the Everlys, and quickly dropped them.</p>\n\n\n\n<p>Part of the reason was that they were signed as a country act, but they already wanted to do more, and in particular to incorporate more influence from the rhythm and blues music they were listening to. Don worshipped Hank Williams, and Phil loved Lefty Frizzell, but they both also adored Bo Diddley, and were obsessed with his style.</p>\n\n\n\n<p>Don, in particular -- who was the more accomplished instrumentalist of the two, and who unlike Phil would play rhythm guitar on their records -- wanted to learn how Diddley played guitar, and would spend a lot of time with Chet Atkins, who taught him how to play in the open tunings Diddley used, and some of the rhythms he was playing with.</p>\n\n\n\n<p>Despite the brothers' lack of success on Columbia, Atkins still had faith in them, and he got in touch with his friend Wesley Rose, who was the president of Acuff-Rose publishing, the biggest music publishing company in Nashville at the time.</p>\n\n\n\n<p>Rose made a deal with the brothers. If they would sign to Acuff-Rose as songwriters, and if they'd agree to record only Acuff-Rose songs, he would look after their career and get them a record deal. They agreed, and Rose got them signed to Cadence Records, a mid-sized indie label whose biggest star at the time was Andy Williams.</p>\n\n\n\n<p>The first single they recorded for Cadence was a song that had been rejected by thirty other artists before it was passed on to the Everlys as a last resort.</p>\n\n\n\n<p>\"Bye Bye Love\" was written by the husband and wife team Felice and Boudleaux Bryant, who had been writing for a decade, for people such as Carl Smith and Moon Mullican. Their first hit had come in 1948, with \"Country Boy\", a song which Little Jimmy Dickens took to number seven on the country charts:</p>\n\n\n\n<p>[Excerpt: Little Jimmy Dickens, \"Country Boy\"]</p>\n\n\n\n<p>But they had not had much chart success after that, though they'd placed songs with various Nashville-based country singers. They were virtual unknowns, and their most recent song, \"Bye Bye Love\", had been written for a duo called Johnny and Jack. They hadn't been interested, so the Bryants had passed the song along to their friend Chet Atkins, who had tried to record it with Porter Wagoner, who had recorded other songs by the Bryants, like \"Tryin' to Forget the Blues\":</p>\n\n\n\n<p>[Excerpt: Porter Wagoner, \"Tryin' to Forget the Blues\"]</p>\n\n\n\n<p>But when Atkins took the song into the studio, he decided it wasn't strong enough for Wagoner. Atkins wanted to change a few chords, and Boudleaux Bryant told him that if the song wasn't strong enough as it was, he just shouldn't record it at all.</p>\n\n\n\n<p>But while the song might not have been strong enough for a big country star like Porter Wagoner, it was strong enough for Chet Atkins' new proteges, who were, after all, hardly going to have a big hit. So Atkins took the multiply-rejected song in for the duo to record as their first single for Cadence.</p>\n\n\n\n<p>In one of those coincidences that seems too good to be true, Ike Everly was Boudleaux Bryant's barber, and had been bragging to him for years about how talented his sons were, but Bryant had just dismissed this -- around Nashville, everyone is a major talent, or their son or daughter or husband or wife is.</p>\n\n\n\n<p>Two things happened to change the rather mediocre song into a classic that would change the face of popular music. The first was, simply, the brothers' harmonies. They had by this point developed an intuitive understanding of each other's voices, and a superb musicality. It's interesting to listen to the very first take of the song:</p>\n\n\n\n<p>[Excerpt: The Everly Brothers, \"Bye Bye Love (take 1)\"]</p>\n\n\n\n<p>That's Don singing the low lead and Phil taking the high harmony.</p>\n\n\n\n<p>Now, if you're familiar with the finished record, you can tell that what Phil's singing there isn't the closer harmony part he ended up singing on the final version. There are some note choices there that he decided against for the final record. But what you can tell is that they are instinctively great harmony singers. It's not the harmony part that would become famous, but it's a *good* one in its own right.</p>\n\n\n\n<p>The second thing is that they changed the song from the rather sedate country song the Bryants had come up with, radically rearranging it.</p>\n\n\n\n<p>Don had written a song called \"Give Me a Future\", which he'd intended to be in the Bo Diddley style, and one can hear something of Diddley's rhythm in the stop-start guitar part:</p>\n\n\n\n<p>[Excerpt: The Everly Brothers, \"Give Me a Future\"]</p>\n\n\n\n<p>Don took that guitar part, and attached it to the Bryants' song, and with the help of Chet Atkins' lead guitar fills turned it into something quite new -- a record with a rockabilly feel, but with country close harmony vocals:</p>\n\n\n\n<p>[Excerpt: The Everly Brothers, \"Bye Bye Love\"]</p>\n\n\n\n<p>The brothers were, at first, worried because almost as soon as it came out, a cover version by Webb Pierce, one of the biggest names in country music, came out:</p>\n\n\n\n<p>[Excerpt: Webb Pierce, \"Bye Bye Love\"]</p>\n\n\n\n<p>But they were surprised to discover that while Pierce's version did chart -- reaching the top ten in the country charts -- it was nowhere near as successful as their own version, which went to number one on the country charts and number two in pop, and charted on the R&B charts as well.</p>\n\n\n\n<p>After that success, the Bryants wrote a string of hits for the brothers, a run of classics starting with \"Wake Up Little Suzie\", a song which was banned on many stations because it suggested impropriety -- even though, listening to the lyrics, it very clearly states that no impropriety has gone on, and indeed that the protagonist is horrified at the suggestion that it might have:</p>\n\n\n\n<p>[Excerpt: The Everly Brothers, \"Wake Up Little Suzie\"]</p>\n\n\n\n<p>These records would usually incorporate some of Don's Bo Diddley influence, while remaining firmly in the country end of rock and roll. The Bryants also started to give the brothers ballads like \"Devoted to You\" and \"All I Have to Do is Dream\", which while they still deal with adolescent concerns, have a sweetness and melody to them quite unlike anything else that was being recorded by rock and roll artists of the time.</p>\n\n\n\n<p>After the first single, everything else that the Bryants wrote for the Everlys was tailored specifically to them -- Boudleaux Bryant, who would attend more of the sessions, would have long conversations with the brothers and try to write songs that fit with their lives and musical tastes, as well as fitting them to their voices.</p>\n\n\n\n<p>One of the things that's very noticeable about interviews with the brothers is that they both tend to credit Boudleaux alone with having written the songs that he co-wrote with his wife, even though everything suggests that the Bryants were a true partnership, and both have solo credits for songs that are stylistically indistinguishable from those written as a team. Whether this is pure sexism, or it's just because Boudleaux is the one who used to demo the songs for them and so they think of him as the primary author, is hard to tell -- probably a combination.</p>\n\n\n\n<p>This was also a perception that Boudleaux Bryant encouraged. While Felice was the person who had originally decided to go into songwriting, and was the one who came up with most of the ideas, Boudleaux was only interested in making money -- and he'd often sneak off to write songs by himself so he would get all the money rather than have to share it with his wife. Boudleaux would also on occasion be given incomplete songs by friends like Atkins, and finish them up with Felice -- but only Boudleaux and the original writer would get their names on it.</p>\n\n\n\n<p>The result was that Boudleaux got the credit from people around him, even when they knew better. One of my sources for this episode is an interview with the Bryants' son, Dane, and at one point in that interview he says \"Now, lots of times I will say, 'My father.' I mean Dad and Mom\".</p>\n\n\n\n<p>As the Everly brothers disagreed about almost everything, they of course disagreed about the quality of the material that the Bryants were bringing them. Phil Everly was always utterly unstinting in his praise of them, saying that the Bryants' songs were some of the best songs ever written.</p>\n\n\n\n<p>Don, on the other hand, while he definitely appreciated material like \"All I Have to Do is Dream\", wasn't so keen on their writing in general, mostly because it dealt primarily with adolescent concerns. He thought that the material the brothers were writing for themselves -- though still immature, as one would expect from people who were still in their teens at the start of their career -- was aiming at a greater emotional maturity than the material the Bryants wrote.</p>\n\n\n\n<p>And on the evidence of their first album, that's certainly true. The first album is, like many albums of the time, a patchy affair. It pulls together the hit singles the brothers had already released, together with a bunch of rather mediocre cover versions of then-current hits. Those cover versions tend to support Don's repeated claims that the brothers were as interested in R&B and blues as in country -- apart from a version of \"Be-Bop-A-Lula\", all the covers are of R&B hits of the time -- two by Little Richard, two by Ray Charles, and one by the relatively obscure blues singer Titus Turner.</p>\n\n\n\n<p>But among those songs, there are also a handful of Don Everly originals, and one in particular, \"I Wonder if I Care as Much\", is quite an astonishing piece of songwriting:</p>\n\n\n\n<p>[Excerpt: The Everly Brothers, \"I Wonder If I Care As Much\"]</p>\n\n\n\n<p>Don's songs were often B-sides – that one was the B-side to “Bye Bye Love” – and to my mind they're often rather more interesting than the A-sides.</p>\n\n\n\n<p>While that first album is rather patchy, the second album, Songs Our Daddy Taught Us, is a minor revelation, and one of the pillars on which the Everly Brothers' artistic reputation rests. It's been suggested that the album was done as a way of getting back at the record company for some slight or other, by making a record that was completely uncommercial. That might be the case, but I don't think so -- and if it was, it was a gesture that backfired magnificently, as it's still, sixty years on, a consistent seller.</p>\n\n\n\n<p>Songs Our Daddy Taught Us is precisely what it sounds like -- an album consisting of songs the brothers had been taught by their father. It's a mixture of Appalachian folk songs and country standards, performed by the brothers accompanied just by Don's acoustic guitar and Floyd Chance on upright bass:</p>\n\n\n\n<p>[Excerpt: The Everly Brothers, “Who's Gonna Shoe Your Pretty Little Feet?”]</p>\n\n\n\n<p>It's quite possibly the most artistically satisfying album made in the fifties by a rock and roll act, and it's had such an influence that as recently as 2013 Billie Joe Armstrong of Green Day and the jazz-pop singer Norah Jones recorded an album, Foreverly, that's just a cover version of the whole album:</p>\n\n\n\n<p>[Excerpt: Billie Joe Armstrong and Norah Jones, “Who's Gonna Shoe Your Pretty Little Feet?”]</p>\n\n\n\n<p>So as the 1950s drew to a close, the Everly Brothers were on top of the world. They'd had a run of classic singles, and they'd just released one of the greatest albums of all time. But there was trouble ahead, and when we pick up on their career again, we'll see exactly how wrong things could go for them.</p>",
  "enclosure": "",
  "itunes:summary": "Episode fifty-six of A History of Rock Music in Five Hundred Songs looks at \"Bye Bye Love\" by The Everly Brotherss, and at the history of country close harmony. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nPatreon backers also have a ten-minute bonus episode available, on \"Short Fat Fannie\" by Larry Williams.\n\n\n\n\n\nResources\n\n\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\n\n\nThere are no first-rate biographies of the Everly Brothers in print, at least in English (apparently there's a decent one in French, but I don't speak French well enough for that).&nbsp;Ike's Boys&nbsp;by Phyllis Karp&nbsp;is the only full-length bio,&nbsp; and I relied on that in the absence of anything else, but it's been out of print for nearly thirty years, and is not worth the exorbitant price it goes for second-hand.\n\n\n\nHow Nashville Became Music City&nbsp;by Michael Kosser&nbsp;has a good amount of information on the Bryants.\n\n\n\nThe Everlypedia&nbsp;is a series of PDFs containing articles on anything related to the Everly Brothers, in alphabetical order.\n\n\n\nThere are many, many cheap compilations of the Everly Brothers' early material available. I'd recommend&nbsp;this one, because as well as all the hits up to 1962 it has the complete&nbsp;Songs our Daddy Taught Us.\n\n\n\nPatreon\n\n\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;Why not join them?\n\n\n\nTranscript\n\n\n\n[Intro: Ike Everly introducing the Everly Brothers]\n\n\n\nWe've talked before about how vocal harmonies are no longer a big part of rock music, but were essential to it in the fifties and sixties. But what we've not discussed is that there are multiple different types of harmony that we see in the music of that period.\n\n\n\nOne, which we've already seen, is the vocal group sound -- the sound of doo-wop. There, there might be a lead singer, but everyone involved has their own important role to play, singing separate backing vocal lines that intertwine. One singer will be taking a bass melody, another will be singing a falsetto line, and so on. It's the sound of a collection of individual personalities, working together but to their own agendas.\n\n\n\nAnother style which we're going to look at soon is the girl group sound. There you have a lead singer singing a line on her own, and two or three backing vocalists echoing lines on the chorus -- it's the sound of a couple of friends providing support for someone who's in trouble. The lead singer will sing her problems, and the friends will respond with something supportive.\n\n\n\nThen there's the style which Elvis used -- a single lead vocalist over a group of backing vocalists, mostly providing \"oohs\" and \"aahs\". The backing vocals here just work as another instrumental texture.\n\n\n\nBut there's one style which would be as influential as any of these, and which was brought into rock and roll by a single act -- a duo who, more than anyone else in rock music, epitomised vocal harmony:\n\n\n\n[Excerpt: The Everly Brothers, \"Bye Bye Love\"]\n\n\n\nDon and Phil Everly were brought up in music. Their father, Ike Everly, had been a coalminer in Muhlenberg County, Kentucky, but decided to quit coal mining and become a professional musician when he was trapped in his second cave-in, deciding he wasn't ever going to go through that a third time. He had learned a particular guitar style, which would later become known as \"Travis picking\" after its most famous exponent, Merle Travis -- though Travis himself usually referred to it as \"Muhlenberg picking\". Travis and Ike Everly knew each other, and it was Ike Everly, and Ike's friend Mose Rager, who taught Travis how to play in that style, which they had learned from another friend, Kennedy Jones, who in turn learned it from a black country-blues player named Arnold Schultz, who had invented the style:\n\n\n\n[Excerpt, Ike Everly, \"Blue Smoke\"]\n\n\n\nIke Everly was widely regar",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode fifty-six of A History of Rock Music in Five Hundred Songs looks at \"Bye Bye Love\" by The Everly Brotherss, and at the history of country close harmony. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nPatreon backers also have a ten-minute bonus episode available, on \"Short Fat Fannie\" by Larry Williams.\n\n\n\n\n\nResources\n\n\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\n\n\nThere are no first-rate biographies of the Everly Brothers in print, at least in English (apparently there's a decent one in French, but I don't speak French well enough for that).&nbsp;Ike's Boys&nbsp;by Phyllis Karp&nbsp;is the only full-length bio,&nbsp; and I relied on that in the absence of anything else, but it's been out of print for nearly thirty years, and is not worth the exorbitant price it goes for second-hand.\n\n\n\nHow Nashville Became Music City&nbsp;by Michael Kosser&nbsp;ha",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}