{
  "title": "Episode 126: SuperNormal Stimuli: Is This Why We're Overweight?",
  "pubDate": "Thu, 17 Jun 2010 00:14:50 +0000",
  "guid": "episode-126-supernormal-stimuli-is-this-why-wer",
  "link": "http://www.thepsychfiles.com/2010/06/episode-126-supernormal-stimuli-is-this-why-were-overweight/",
  "itunes:image": "",
  "description": "There are many reasons why it is difficult to lose weight, but have you considered how supernormal stimuli might be one of them?  In this episode I discuss some of the ideas in the books Waistland and Supernormal Stimuli by Dierdre Barrett.  Is it possible that the old saying Everything in Moderation might just be wrong?  And will Small Changes really help you to get in shape or are radical changes really the way to go?",
  "content:encoded": "There are many reasons why it is difficult to lose weight, but have you considered how supernormal stimuli might be one of them?  In this episode I discuss some of the ideas in the books Waistland and Supernormal Stimuli by Dierdre Barrett.  Is it possible that the old saying Everything in Moderation might just be wrong?  And will Small Changes really help you to get in shape or are radical changes really the way to go?",
  "enclosure": "",
  "itunes:duration": "14:11",
  "itunes:explicit": false,
  "itunes:keywords": "loss,psychology,research,weight,losing,psychological",
  "itunes:subtitle": "There are many reasons why it is difficult to lose weight, but have you considered how supernormal stimuli might be one of them?  In this episode I discuss some of the ideas in the books Waistland and Supernormal Stimuli by Dierdre Barrett.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "There are many reasons why it is difficult to lose weight, but have you considered how supernormal stimuli might be one of them? In this episode I discuss some of the ideas in the books Waistland and Supernormal Stimuli by Dierdre Barrett. Is it possible that the old saying Everything in Moderation might just be wrong? And will Small Changes really help you to get in shape or are radical changes really the way to go?"
}