{
  "title": "Episode 20: Just Say No to the War on Drugs",
  "itunes:title": "Episode 20: Just Say No to the War on Drugs",
  "pubDate": "Wed, 28 Jun 2017 16:00:00 +0000",
  "guid": "97b6a7d4d4e214003bbfc9c433451c58",
  "link": "https://wordsandnumbers.libsyn.com/just-say-no-to-the-war-on-drugs",
  "itunes:image": "",
  "description": "<p>Ted Cruz recently asserted that the United States military needs to be sent to Mexico to attack the drug cartels head-on.<br /> <br /> This is a bad idea. But so is the drug war itself, both constitutionally and logically.<br /> <br /> Forty-six years and one trillion dollars after its start, President Richard Nixon's War on Drugs is still going, with 300,000 people currently in jail on drug charges. Meanwhile, 26 times as many people suffer from alcoholism as do heroin abuse, and eight times as many die from alcohol abuse as do heroin.<br /> <br /> Many who support the war do so with the best of intentions, but has it really helped? Or has it done more harm than good, like the Prohibition of the 1920s? Is this war even legal in the first place?<br /> <br /> James Harrigan and Antony Davies discuss these questions in this week's Words and Numbers. </p>",
  "content:encoded": "<p>Ted Cruz recently asserted that the United States military needs to be sent to Mexico to attack the drug cartels head-on.  This is a bad idea. But so is the drug war itself, both constitutionally and logically.  Forty-six years and one trillion dollars after its start, President Richard Nixon's War on Drugs is still going, with 300,000 people currently in jail on drug charges. Meanwhile, 26 times as many people suffer from alcoholism as do heroin abuse, and eight times as many die from alcohol abuse as do heroin.  Many who support the war do so with the best of intentions, but has it really helped? Or has it done more harm than good, like the Prohibition of the 1920s? Is this war even legal in the first place?  James Harrigan and Antony Davies discuss these questions in this week's Words and Numbers. </p>",
  "enclosure": "",
  "itunes:duration": "14:11",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,words,politics,economics,economy,discussion,numbers",
  "itunes:subtitle": "Ted Cruz recently asserted that the United States military needs to be sent to Mexico to attack the drug cartels head-on.  This is a bad idea. But so is the drug war itself, both constitutionally and logically.  Forty-six years and one trillion...",
  "itunes:season": 1,
  "itunes:episode": 20,
  "itunes:episodeType": "full",
  "itunes:author": "Foundation for Economic Education"
}