{
  "title": "Greenpeace Denounces Plastic Recycling",
  "link": "https://conversableeconomist.com/2022/10/31/greenpeace-denounces-plastic-recycling/",
  "dc:creator": "conversableeconomist",
  "pubDate": "Mon, 31 Oct 2022 17:28:16 +0000",
  "category": "Uncategorized",
  "guid": "https://conversableeconomist.com/?p=13086",
  "description": "<p>Greenpeace and its philosophy of &#8220;non-violent creative action&#8221; in the service of environmentalist goals has inspired a wide range of reactions, but pretty much no one views the organization as a sell-out or a pawn for corporate interests. Thus, it&#8217;s intriguing that the organization has recently laid waste to the practicality and benefits of plastics &#8230; <a href=\"https://conversableeconomist.com/2022/10/31/greenpeace-denounces-plastic-recycling/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Greenpeace Denounces Plastic Recycling</span></a></p>\n<p>The post <a href=\"https://conversableeconomist.com/2022/10/31/greenpeace-denounces-plastic-recycling/\">Greenpeace Denounces Plastic Recycling</a> first appeared on <a href=\"https://conversableeconomist.com\">Conversable Economist</a>.</p>",
  "content:encoded": "<p><a href=\"https://www.greenpeace.org/international/\">Greenpeace</a> and its philosophy of &#8220;non-violent creative action&#8221; in the service of environmentalist goals has inspired a wide range of reactions, but pretty much no one views the organization as a sell-out or a pawn for corporate interests. Thus, it&#8217;s intriguing that the organization has recently laid waste to the practicality and benefits of plastics recycling in its recent report, <a href=\"https://www.greenpeace.org/usa/reports/circular-claims-fall-flat-again/\">Circular Claims Fall Flat Again</a> (October 24, 2022). </p>\n\n\n\n<p>Here&#8217;s what Greenpeace has to say (footnotes omitted): </p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<blockquote class=\"wp-block-quote\">\n<p>Mechanical and chemical recycling of plastic waste has largely failed and will always fail because plastic waste is: (1) extremely difficult to collect, (2) virtually impossible to sort for recycling, (3) environmentally harmful to reprocess, (4) often made of and contaminated by toxic materials, and (5) not economical to recycle. Paper, cardboard, metal, and glass do not have these problems, which is why they are recycled at much higher rates.</p>\n\n\n\n<p>Due to toxicity risks, post-consumer recycled plastic from household waste is not being produced at commercial scale for food-grade uses globally or in the U.S., and likely never will be. While there is limited availability of food-grade PET#1 for beverage bottles only, there are growing toxicity concerns there, too.</p>\n\n\n\n<p>As described in a May 2022 OpEd in <em>The Atlantic</em>, “The problem lies not with the concept or process of recycling but with the plastic material itself – it is plastic recycling that does not work.” The high recycling rates of post-consumer paper, cardboard, and metals in the U.S. prove that recycling can be an effective way to reclaim valuable natural material resources. Plastic recycling in particular has failed because the thousands of types of synthetic plastic materials produced are fundamentally not recyclable.</p>\n</blockquote>\n</blockquote>\n\n\n\n<p>As support for these claims, Greenpeace gathered evidence from 370 &#8220;material recovery facilities&#8221; across the US in the 2020, and the updated the survey this year. In other words, they aren&#8217;t looking at how much plastic was collected with a claim that it could be recycled, but at how much is actually recycled and reused. </p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>The failure of the concept of plastic recycling is finally becoming impossible for the companies and industry associations that promote it – and the nongovernmental organizations (NGOs) that they fund for this purpose – to ignore. After three decades and billions of dollars of taxpayer spending, the excuse offered by the American Chemistry Council (ACC) that plastic recycling is still “in its infancy” can now be seen for the delaying tactic that it is.</p>\n\n\n\n<p>Corporate plastic pledge performance reporting does not reflect the failure of plastic recycling because it relies on the theoretical possibility of recycling a plastic item, rather than actual plastic waste processing rates. The reported shares of recyclable, reusable, or compostable plastic packaging used by EMF NPE and U.S. Plastics Pact member companies – 65.3% at the global level and 37% in the U.S. – can hardly be taken at face value when credible estimates show that only 9% of plastic was recycled globally in 201921 and only 5–6% of plastic waste was recycled in the U.S. in 2021. </p>\n</blockquote>\n\n\n\n<p></p>\n\n\n\n<p>The Greenpeace argument is definitely not that, with some additional effort, plastic recycling will work.  The  argument is that given the nature of plastics, recycling plastic will never work. </p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>After more than 30 years, it is time to accept that plastic recycling is a failed concept. Unlike with paper or metals, there are two insurmountable barriers that prevent plastic recycling from ever working at scale: toxicity and economics. Plastic cannot be safely recycled from postconsumer household waste back into new food-grade plastic products. The flood of 400 million tons/year of cheap new plastic production  kills the business case for large-scale investment in plastic recycling. And the problem lies not with the concept or process of recycling but with the plastic material itself – it is plastic recycling that does not work.</p>\n\n\n\n<p></p>\n</blockquote>\n\n\n\n<p>If one accepts the Greenpeace indictment of plastics recycling, the question becomes what to do next. The Greenpeace solution is to phase out all single-use plastics. I&#8217;m not confident that the policy approach can or should be that absolute. But a first step to having that conversation would be a broader acceptance that the efforts at recycling plastics have largely failed.  </p>\n<p><a class=\"a2a_button_facebook\" href=\"https://www.addtoany.com/add_to/facebook?linkurl=https%3A%2F%2Fconversableeconomist.com%2F2022%2F10%2F31%2Fgreenpeace-denounces-plastic-recycling%2F&linkname=Greenpeace%20Denounces%20Plastic%20Recycling\" title=\"Facebook\" rel=\"nofollow noopener\" target=\"_blank\"></a><a class=\"a2a_button_twitter\" href=\"https://www.addtoany.com/add_to/twitter?linkurl=https%3A%2F%2Fconversableeconomist.com%2F2022%2F10%2F31%2Fgreenpeace-denounces-plastic-recycling%2F&linkname=Greenpeace%20Denounces%20Plastic%20Recycling\" title=\"Twitter\" rel=\"nofollow noopener\" target=\"_blank\"></a><a class=\"a2a_button_email\" href=\"https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fconversableeconomist.com%2F2022%2F10%2F31%2Fgreenpeace-denounces-plastic-recycling%2F&linkname=Greenpeace%20Denounces%20Plastic%20Recycling\" title=\"Email\" rel=\"nofollow noopener\" target=\"_blank\"></a><a class=\"a2a_dd addtoany_share_save addtoany_share\" href=\"https://www.addtoany.com/share#url=https%3A%2F%2Fconversableeconomist.com%2F2022%2F10%2F31%2Fgreenpeace-denounces-plastic-recycling%2F&#038;title=Greenpeace%20Denounces%20Plastic%20Recycling\" data-a2a-url=\"https://conversableeconomist.com/2022/10/31/greenpeace-denounces-plastic-recycling/\" data-a2a-title=\"Greenpeace Denounces Plastic Recycling\"></a></p><p>The post <a href=\"https://conversableeconomist.com/2022/10/31/greenpeace-denounces-plastic-recycling/\">Greenpeace Denounces Plastic Recycling</a> first appeared on <a href=\"https://conversableeconomist.com\">Conversable Economist</a>.</p>",
  "post-id": 13086
}