{
  "title": "A New Fund Helps IEEE-HKN Student Chapters Flourish",
  "link": "https://spectrum.ieee.org/ieee-hkn-student-chapters-fund",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/two-rows-of-people-in-formal-clothing-with-a-seated-front-row.jpg?id=31959195&width=1200&height=800&coordinates=0%2C0%2C0%2C6\"/><br/><br/><p>University chapters are the lifeblood of <a href=\"https://hkn.ieee.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE-Eta Kappa Nu</a>, the organization’s honor society. There are 269 chapters at universities worldwide.</p><p>A strong chapter helps ensure that members have a fulfilling experience. For the 2021–2022 academic year, IEEE-HKN chapters reported approximately 92,000 hours of activity and service, much more than the previous year—when chapters reported approximately 62,000 hours—and other years.</p><hr/><p>The chapters engaged in a variety of virtual and in-person activities including preuniversity functions, as well as joint activities with IEEE student branches.</p><p>Chapters can strengthen the IEEE-HKN organization while setting into motion a pipeline of engaged members who are prepared and motivated to enhance their volunteer experience throughout their career.</p><p>Support provided by universities to chapters varies widely, however—which can limit activities. The <a href=\"https://www.ieeefoundation.org/ieee_hkn\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE-HKN Student Chapter Support</a> Initiative was established through the <a href=\"https://www.ieeefoundation.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Foundation</a> to address the issue. The dedicated fund paves the way for creating new resources and enhancing existing ones, plus training and programs to help every chapter thrive.</p><p>The two facets of the initiative are the <a href=\"https://hkn.ieee.org/chapter-support-grant\" rel=\"noopener noreferrer\" target=\"_blank\">Student Chapter Support Grant program</a> and the supplemental <a href=\"https://hkn.ieee.org/alumni-news/2022/07/chapter-support-initiative-off-to-a-great-start\" rel=\"noopener noreferrer\" target=\"_blank\">Chapter Success Program</a>. </p>\n<h2>Grants help UC-Berkeley, the University of Texas, and others</h2><p>The grant program funds activities designed to support and strengthen chapters. Applications are accepted on a rolling basis. The first grants have been awarded to fund programs including chapter-building and visibility activities, mentoring, and alumni engagement events.</p><p>The officers of the <a href=\"https://hkn.ieee.org/hkn-chapters/all-chapters/mu-chapter\" rel=\"noopener noreferrer\" target=\"_blank\">Mu Chapter</a> at the <a href=\"https://eecs.berkeley.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">University of California, Berkeley</a>, spent the money to offset the cost of announcement whiteboards, which it uses to increase the visibility of its tutoring programs and events.</p><p>Officers at the <a href=\"https://hkn.ieee.org/hkn-chapters/all-chapters/mu-iota-chapter\" rel=\"noopener noreferrer\" target=\"_blank\">Mu Iota Chapter</a> at <a href=\"https://www.seattleu.edu/scieng/ece/\" rel=\"noopener noreferrer\" target=\"_blank\">Seattle University</a> used the grant to help pay for an electrical and computer engineering mentoring event it held. At the evening event, students met with industry professionals. The night was the chapter’s most-attended event to date.</p><p>For the <a href=\"https://hkn.ieee.org/hkn-chapters/all-chapters/delta-omega-chapter\" rel=\"noopener noreferrer\" target=\"_blank\">Delta Omega Chapter</a> at the <a href=\"https://manoa.hawaii.edu/catalog/schools-colleges/engineering/ee/\" rel=\"noopener noreferrer\" target=\"_blank\">University of Hawaii at Manoa</a>, the grant went toward its annual induction ceremony and banquet. The event brings students, faculty, and alumni together to recognize induction candidates’ hard work.</p><p>Later this year, the <a href=\"https://www.uta.edu/academics/schools-colleges/engineering/academics/departments/electrical\" rel=\"noopener noreferrer\" target=\"_blank\">University of Texas Arlington</a>’s <a href=\"https://hkn.ieee.org/hkn-chapters/all-chapters/epsilon-mu-chapter\" rel=\"noopener noreferrer\" target=\"_blank\">Epsilon Mu Chapter</a> plans to hold career development events for students. Chapter officers say they will use the grant money to enhance their résumé-building and interview-preparation workshops and to present a discussion about technology by industry representatives.</p>\n<h2>Training and coaching resources</h2><p>The Chapter Success program provides training and coaching resources. The program makes it possible for universities to establish new chapters and reinstate dormant ones. Since January, HKN volunteers and staff have been coaching 18 chapters on how to revitalize their activities, as students began returning to campus after staying home because of the COVID-19 pandemic.</p><p>A new HKN chapter, Nu Epsilon, was installed in April at <a href=\"https://www.kennesaw.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">Kennesaw State University</a>, in Georgia. The Gamma Lambda Chapter at <a href=\"https://www.engineering.columbia.edu/departments/electrical-engineering\" rel=\"noopener noreferrer\" target=\"_blank\">Columbia </a>inducted new members for the first time in at least seven years. The <a href=\"https://www.colorado.edu/engineering/\" rel=\"noopener noreferrer\" target=\"_blank\">University of Colorado, Boulder</a>, Rho Chapter marked the 100th anniversary of its installation this year by working to reactivate operations on campus.</p>\n<h2>Donations welcome</h2><p>IEEE Life Fellow <a href=\"https://www.ieeefoundation.org/2021-donor-stories#John_McDonald\" rel=\"noopener noreferrer\" target=\"_blank\">John McDonald</a>, a <a href=\"https://hkn.ieee.org/hkn-chapters/all-chapters/beta-chapter\" rel=\"noopener noreferrer\" target=\"_blank\">Beta Chapter</a> member, and his wife, Jo-Ann, provided the first gift to the dedicated fund. Consider joining the McDonalds and make a contribution to the Student Chapter Support Fund from the list of donor opportunities on the IEEE-HKN website.</p><div class=\"horizontal-rule\"></div><p>Remember, if you were inducted into the honor society you remain a member forever, even if you have lost touch. You can reconnect by completing <a href=\"https://hkn.ieee.org/ieee-hkn-alumni-reconnect-form\" target=\"_blank\">this form</a>.<br/></p><p>Visit the IEEE-HKN website to learn more about <a href=\"https://hkn.ieee.org/chapters/forming-a-new-chapter\" target=\"_blank\">forming a chapter</a> at your university or being inducted as a <a href=\"https://hkn.ieee.org/ieee-hkn-professional-nomination-form\" rel=\"noopener noreferrer\" target=\"_blank\">professional member</a>.</p>",
  "pubDate": "Tue, 18 Oct 2022 20:00:01 +0000",
  "guid": "https://spectrum.ieee.org/ieee-hkn-student-chapters-fund",
  "category": [
    "Ieee products services",
    "Students",
    "Ieee foundation",
    "Ieee-hkn",
    "Ieee eta kappa nu",
    "Type:ti"
  ],
  "dc:creator": "Sylvie Leal",
  "media:content": ""
}