{
  "title": "The Netherlands Joins in Repatriations from Northeast Syria",
  "link": "https://www.hrw.org/news/2022/11/03/netherlands-joins-repatriations-northeast-syria",
  "description": "Click to expand Image\n          \n\n\n\n\n  \n        \n                      \n      \n        A boy lugs water in Roj camp in northeast Syria, May 2022. \n                    © 2022 San Saravan for HRW  \n          \n\n  \n<p>This week, the Netherlands took the significant step of repatriating 12 Dutch women and their 28 children from northeast Syria. The Dutch nationals had been unlawfully detained for years in life-threatening and often inhuman conditions in camps for Islamic State (ISIS) suspects and family members.</p>\n\n<p>The Netherlands is the latest of several governments, including Germany and Canada, to recently bring home or resume repatriations of women and children from the squalid detention camps in northeast Syria. In countries such as the Netherlands and France, the repatriations took place amid rulings or looming decisions on the detainees by domestic courts and the European Court of Human Rights. In Australia, the repatriations followed a change in government and the death of an Australian boy unlawfully detained in a northeast Syrian prison with thousands of foreign men.</p>\n\n<p>Even if governments have repatriated these nationals reluctantly, they can now set examples for other countries by providing these returnees with the reintegration services they need to rebuild their lives.</p>\n\n<p>The children, most of whom were born in or brought to Syria by their parents, have endured years of unimaginable suffering, first under ISIS, then in the squalid, life-threatening camps guarded by a US-backed regional force. Yet social workers, foster parents, and others tell Human Rights Watch that many previously repatriated children are adjusting well to life in their home countries. There is every reason to assume that these newly returned children can, too. When feasible, providing the children with prompt, sustained access to family members is important to helping them adapt.</p>\n\n<p>While ensuring that any repatriated women who committed grave crimes face justice, the authorities should take into account that many women may, like their children, be victims of ISIS. Some may be survivors of human trafficking.</p>\n\n<p>Tens of thousands more foreigners from about 60 countries, most of them children, remain unlawfully detained in northeast Syria. Their countries of origin should promptly ensure that all detainees who wish to return can come home. In the meantime, they should work with the northeast Syrian authorities to immediately improve conditions for detainees who remain.</p>",
  "pubDate": "Thu, 03 Nov 2022 03:00:00 -0400",
  "dc:creator": "Human Rights Watch",
  "guid": "https://www.hrw.org/news/2022/11/03/netherlands-joins-repatriations-northeast-syria"
}