{
  "title": "S1E1 - An honest Conversation About the Olympic Postponement with Mariel Zagunis",
  "guid": "https://pinecast.com/guid/dd141e59-1b03-411c-8d4c-92af8c8c5267",
  "pubDate": "Tue, 23 Jun 2020 07:30:00 -0000",
  "itunes:duration": "00:50:27",
  "description": "<p>Laura is joined today by a very special guest, who is also her very good friend, Mariel Zagunis. In addition to being a four time Fencing Olympian, winning back to back Olympic Gold in 2004 and 2008 as well as a pair of team Bronze medals, Mariel was also selected by her fellow athletes to be the 2012 Team USA flag bearer in London. Today, this highly accomplished athlete engages with Laura in a frank discussion about the many ways that the Olympic postponement and COVID-19 have impacted their lives.</p>\n<p>In this episode, these two friends discuss many aspects surrounding this year’s Olympic postponement, including its effects upon their mental and physical training. They also share the positives to be found in the current circumstances, what they believe their sports will be like next year, what drives them to continue to compete, and their shared experiences of being both a Mom and an Olympic athlete. Finally, Mariel offers her advice to all athletes on handling this ‘difficult season’. As you listen, you will discover that these are two highly talented and committed athletes – kindred spirits in the quest for continued excellence during this pandemic and beyond – whose real, raw, and honest conversation proves as enlightening as it is heartfelt.</p>\n<p>Episode Highlights:</p>\n<p>The many effects of COVID-19 and the Olympic postponement upon Mariel and Laura’s lives and physical and mental training\nPositives to be found in the pandemic\nTheir predictions regarding the state of Fencing and Diving in 2021\nWhat drives Mariel to keep competing\nBeing a Mom and an Olympic athlete\nMariel’s advice for other athletes getting through this difficult season</p>\n<p>Quotes:</p>\n<p>“For athletes who have to prepare for one day or, you know, a series of tournaments, it’s very difficult right now to know what you have to do.”</p>\n<p>“We plan our entire life around the Olympics. The Olympics doesn’t wait for anybody. And now it’s like, we have to wait for the Olympics.”</p>\n<p>“It’s definitely a tough time mentally and emotionally, not so much physically.”</p>\n<p>“Just getting one more year to do that thing I love before maybe my body totally breaks down and doesn’t let me do it anymore - kind of excited about that.”</p>\n<p>“Any time you’re just so emotionally and physically invested into something and then it ends or it’s taken away…it just kind of sucks the wind out of you.”</p>\n<p>“I just want to set that example for the female athletes to show that we can do it and you can continue if you really want to.”</p>\n<p>“Focus on what you can control, and then you’re going to feel a lot more at peace.”\nLinks:\nThe Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a></p>\n<p>Mariel Zagunis Instagram: <a href=\"https://www.instagram.com/mariel.zagunis/\" rel=\"nofollow\">https://www.instagram.com/mariel.zagunis/</a> </p>\n<p>Mariel Zagunis bio:   <a href=\"https://www.teamusa.org/usa-fencing/athletes/Mariel-Zagunis\" rel=\"nofollow\">https://www.teamusa.org/usa-fencing/athletes/Mariel-Zagunis</a></p>",
  "itunes:title": "An honest Conversation About the Olympic Postponement with Mariel Zagunis",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 1
}