{
  "title": "Episode 149: &#8220;Respect&#8221; by Aretha Franklin",
  "link": "https://500songs.com/podcast/episode-149-respect-by-aretha-franklin/",
  "pubDate": "Sun, 22 May 2022 19:13:54 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=1165",
  "description": "Episode 149 of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Respect\", and the journey of Aretha Franklin from teenage gospel singer to the Queen of Soul. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/66751854\">\"I'm Just a Mops\" by the Mops</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\nAlso, people may be interested in a Facebook discussion group for the podcast, run by a friend of mine (I'm not on FB myself) which can be found at <a href=\"https://www.facebook.com/groups/293630102611672/\">https://www.facebook.com/groups/293630102611672/</a>\n\n\n\n<strong>Errata</strong>\n\nI say \"Rock-a-Bye Your Baby to a Dixie Melody\" instead of \"Rock-a-Bye Your Baby With a Dixie Melody\". Also I say Spooner Oldham co-wrote \"Do Right Woman\". I meant Chips Moman.\n<strong style=\"font-size: revert; color: initial;\">Resources</strong>\n\n\nNo Mixcloud this week, as there are too many songs by Aretha Franklin.\n\nMy main biographical source for Aretha Franklin is <a href=\"https://amzn.to/3a43LlF\"><em>Respect: The Life of Aretha Franklin</em> by David Ritz</a>, and this is where most of the quotes from musicians come from.\n\nI also relied heavily on <a href=\"https://amzn.to/3tdmulN\"><em>I Never Loved a Man the Way I Loved You</em> by Matt Dobkin.</a>\n\nInformation on C.L. Franklin came from <a href=\"https://amzn.to/3Lw6zVS\"><em>Singing in a Strange Land: C. L. Franklin, the Black Church, and the Transformation of America</em></a> by Nick Salvatore.\n\nRick Hall's <a href=\"https://amzn.to/3PEQ4Kf\"><em>The Man From Muscle Shoals: My Journey from Shame to Fame</em></a> contains his side of the story.\n\n<a href=\"https://amzn.to/3lul5BR\"><em>Country Soul</em> by Charles L Hughes</a> is a great overview of the soul music made in Muscle Shoals, Memphis, and Nashville in the sixties. Peter Guralnick's <a href=\"https://amzn.to/38C4Voo\"><em>Sweet Soul Music: Rhythm And Blues And The Southern Dream Of Freedom</em></a> is possibly less essential, but still definitely worth reading.\n\nAnd the <em>I Never Loved a Man</em> album is available in <a href=\"https://amzn.to/3Lw6XUk\">this five-album box set</a> for a ludicrously cheap price. But it's actually worth getting <a href=\"https://amzn.to/3MC1sod\">this nineteen-CD set</a> with her first sixteen Atlantic albums and a couple of bonus discs of demos and outtakes. There's barely a duff track in the whole nineteen discs.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\nBefore I start this episode,  I have to say that there are some things people may want to be aware of before listening to this. This episode has to deal, at least in passing, with subjects including child sexual abuse, intimate partner abuse, racism, and misogyny. I will of course try to deal with those subjects as tactfully as possible, but those of you who may be upset by those topics may want to check the episode transcript before or instead of listening.\n\nThose of you who leave comments or send me messages saying \"why can't you just talk about the music instead of all this woke virtue-signalling?\" may also want to skip this episode. You can go ahead and skip all the future ones as well, I won't mind.\n\nAnd one more thing to say before I get into the meat of the episode -- this episode puts me in a more difficult position than most other episodes of the podcast have. When I've talked about awful things that have happened in the course of this podcast previously, I have either been talking about perpetrators -- people like Phil Spector or Jerry Lee Lewis who did truly reprehensible things -- or about victims who have talked very publicly about the abuse they've suffered, people like Ronnie Spector or Tina Turner, who said very clearly \"this is what happened to me and I want it on the public record\".\n\nIn the case of Aretha Franklin, she has been portrayed as a victim *by others*, and there are things that have been said about her life and her relationships which suggest that she suffered in some very terrible ways. But she herself apparently never saw herself as a victim, and didn't want some aspects of her private life talking about. At the start of David Ritz's biography of her, which is one of my main sources here, he recounts a conversation he had with her:\n\n\"When I mentioned the possibility of my writing an independent biography, she said, “As long as I can approve it before it’s published.”\n“Then it wouldn’t be independent,” I said.\n“Why should it be independent?”\n“So I can tell the story from my point of view.”\n“But it’s not your story, it’s mine.”\n“You’re an important historical figure, Aretha. Others will inevitably come along to tell your story. That’s the blessing and burden of being a public figure.”\n“More burden than blessing,” she said.\"\n\nNow, Aretha Franklin is sadly dead, but I think that she still deserves the basic respect of being allowed privacy. So I will talk here about public matters, things she acknowledged in her own autobiography, and things that she and the people around her did in public situations like recording studios and concert venues. But there are aspects to the story of Aretha Franklin as that story is commonly told, which may well be true, but are of mostly prurient interest, don't add much to the story of how the music came to be made, and which she herself didn't want people talking about. So there will be things people might expect me to talk about in this episode, incidents where people in her life, usually men, treated her badly, that I'm going to leave out. That information is out there if people want to look for it, but I don't see myself as under any obligation to share it. That's not me making excuses for people who did inexcusable things, that's me showing some respect to one of the towering artistic figures of the latter half of the twentieth century.\n\nBecause, of course, respect is what this is all about:\n\n[Excerpt: Aretha Franklin, \"Respect\"]\n\nOne name that's come up a few times in this podcast, but who we haven't really talked about that much, is Bobby \"Blue\" Bland. We mentioned him as the single biggest influence on the style of Van Morrison, but Bland was an important figure in the Memphis music scene of the early fifties, which we talked about in several early episodes. He was one of the Beale Streeters, the loose aggregation of musicians that also included B.B. King and Johnny Ace, he worked with Ike Turner, and was one of the key links between blues and soul in the fifties and early sixties, with records like \"Turn on Your Love Light\":\n\n[Excerpt: Bobby \"Blue\" Bland, \"Turn on Your Love Light\"]\n\nBut while Bland was influenced by many musicians we've talked about, his biggest influence wasn't a singer at all. It was a preacher he saw give a sermon in the early 1940s. As he said decades later:\n\n\"Wasn’t his words that got me—I couldn’t tell you what he talked on that day, couldn’t tell you what any of it meant, but it was the way he talked. He talked like he was singing. He talked music. The thing that really got me, though, was this squall-like sound he made to emphasize a certain word. He’d catch the word in his mouth, let it roll around and squeeze it with his tongue. When it popped on out, it exploded, and the ladies started waving and shouting. I liked all that. I started popping and shouting too. That next week I asked Mama when we were going back to Memphis to church.\n“‘Since when you so keen on church?’ Mama asked.\n“‘I like that preacher,’ I said.\n“‘Reverend Franklin?’ she asked.\n“‘Well, if he’s the one who sings when he preaches, that’s the one I like.’\"\n\nBland was impressed by C.L. Franklin, and so were other Memphis musicians. Long after Franklin had moved to Detroit, they remembered him, and Bland and B.B. King would go to Franklin's church to see him preach whenever they were in the city. And Bland studied Franklin's records. He said later \"I liked whatever was on the radio, especially those first things Nat Cole did with his trio. Naturally I liked the blues singers like Roy Brown, the jump singers like Louis Jordan, and the ballad singers like Billy Eckstine, but, brother, the man who really shaped me was Reverend Franklin.\"\n\nBland would study Franklin's records, and would take the style that Franklin used in recorded sermons like \"The Eagle Stirreth Her Nest\":\n\n[Excerpt: C.L. Franklin, \"The Eagle Stirreth Her Nest\"]\n\nAnd you can definitely hear that preaching style on records like Bland's \"I Pity the Fool\":\n\n[Excerpt: Bobby \"Blue\" Bland, \"I Pity the Fool\"]\n\nBut of course, that wasn't the only influence the Reverend C.L. Franklin had on the course of soul music.\n\nC.L. Franklin had grown up poor, on a Mississippi farm, and had not even finished grade school because he was needed to work behind the mule, ploughing the farm for his stepfather. But he had a fierce intelligence and became an autodidact, travelling regularly to the nearest library, thirty miles away, on a horse-drawn wagon, and reading everything he could get his hands on. At the age of sixteen he received what he believed to be a message from God, and decided to become an itinerant preacher.\n\nHe would travel between many small country churches and build up audiences there -- and he would also study everyone else preaching there, analysing their sermons, seeing if he could anticipate their line of argument and get ahead of them, figuring out the structure.\n\nBut unlike many people in the conservative Black Baptist churches of the time, he never saw the spiritual and secular worlds as incompatible. He saw blues music and Black church sermons as both being part of the same thing -- a Black culture and folklore that was worthy of respect in both its spiritual and secular aspects.\n\nHe soon built up a small circuit of local churches where he would preach occasionally, but wasn't the main pastor at any of them. He got married aged twenty, though that marriage didn't last, and he seems to have been ambitious for a greater respectability. When that marriage failed, in June 1936, he married Barbara Siggers, a very intelligent, cultured, young single mother who had attended Booker T Washington High School, the best Black school in Memphis, and he adopted her son Vaughn. While he was mostly still doing churches in Mississippi, he took on one in Memphis as well, in an extremely poor area, but it gave him a foot in the door to the biggest Black city in the US. Barbara would later be called \"one of the really great gospel singers\" by no less than Mahalia Jackson.\n\nWe don't have any recordings of Barbara singing, but Mahalia Jackson certainly knew what she was talking about when it came to great gospel singers:\n\n[Excerpt: Mahalia Jackson, \"Precious Lord, Take My Hand\"]\n\nRev. Franklin was hugely personally ambitious, and he also wanted to get out of rural Mississippi, where the Klan were very active at this time, especially after his daughter Erma was born in 1938. They moved to Memphis in 1939, where he got a full-time position at New Salem Baptist Church, where for the first time he was able to earn a steady living from just one church and not have to tour round multiple churches.\nHe soon became so popular that if you wanted to get a seat for the service at noon, you had to turn up for the 8AM Sunday School or you'd be forced to stand. He also enrolled for college courses at LeMoyne College. He didn't get a degree, but spent three years as a part-time student studying theology, literature, and sociology, and soon developed a liberal theology that was very different from the conservative fundamentalism he'd grown up in, though still very much part of the Baptist church. Where he'd grown up with a literalism that said the Bible was literally true, he started to accept things like evolution, and to see much of the Bible as metaphor.\n\nNow, we talked in the last episode about how impossible it is to get an accurate picture of the lives of religious leaders, because their life stories are told by those who admire them, and that's very much the case for C.L. Franklin. Franklin was a man who had many, many, admirable qualities -- he was fiercely intelligent, well-read, a superb public speaker, a man who was by all accounts genuinely compassionate towards those in need, and he became one of the leaders of the civil rights movement and inspired tens of thousands, maybe even millions, of people, directly and indirectly, to change the world for the better. He also raised several children who loved and admired him and were protective of his memory.\n\nAnd as such, there is an inevitable bias in the sources on Franklin's life. And so there's a tendency to soften the very worst things he did, some of which were very, very bad.\n\nFor example in Nick Salvatore's biography of him, he talks about Franklin, in 1940, fathering a daughter with someone who is described as \"a teenager\" and \"quite young\". No details of her age other than that are given, and a few paragraphs later the age of a girl who was then sixteen *is* given, talking about having known the girl in question, and so the impression is given that the girl he impregnated was also probably in her late teens. Which would still be bad, but a man in his early twenties fathering a child with a girl in her late teens is something that can perhaps be forgiven as being a different time.\n\nBut while the girl in question may have been a teenager when she gave birth, she was *twelve years old* when she became pregnant, by C.L. Franklin, the pastor of her church, who was in a position of power over her in multiple ways. Twelve years old.\n\nAnd this is not the only awful thing that Franklin did -- he was also known to regularly beat up women he was having affairs with, in public. I mention this now because everything else I say about him in this episode is filtered through sources who saw these things as forgivable character flaws in an otherwise admirable human being, and I can't correct for those biases because I don't know the truth. So it's going to sound like he was a truly great man. But bear those facts in mind.\n\nBarbara stayed with Franklin for the present, after discovering what he had done, but their marriage was a difficult one, and they split up and reconciled a handful of times. They had three more children together -- Cecil, Aretha, and Carolyn -- and remained together as Franklin moved on first to a church in Buffalo, New York, and then to New Bethel Church, in Detroit, on Hastings Street, a street which was the centre of Black nightlife in the city, as immortalised in John Lee Hooker's \"Boogie Chillun\":\n\n[Excerpt: John Lee Hooker, \"Boogie Chillen\"]\n\nBefore moving to Detroit, Franklin had already started to get more political, as his congregation in Buffalo had largely been union members, and being free from the worst excesses of segregation allowed him to talk more openly about civil rights, but that only accelerated when he moved to Detroit, which had been torn apart just a couple of years earlier by police violence against Black protestors.\n\nFranklin had started building a reputation when in Memphis using radio broadcasts, and by the time he moved to Detroit he was able to command a very high salary, and not only that, his family were given a mansion by the church, in a rich part of town far away from most of his congregation. Smokey Robinson, who was Cecil Franklin's best friend and a frequent visitor to the mansion through most of his childhood, described it later, saying \"Once inside, I'm awestruck -- oil paintings, velvet tapestries, silk curtains, mahogany cabinets filled with ornate objects of silver and gold. Man, I've never seen nothing like that before!\"\n\nHe made a lot of money, but he also increased church attendance so much that he earned that money. He had already been broadcasting on the radio, but when he started his Sunday night broadcasts in Detroit, he came up with a trick of having his sermons run long, so the show would end before the climax. People listening decided that they would have to start turning up in person to hear the end of the sermons, and soon he became so popular that the church would be so full that crowds would have to form on the street outside to listen. Other churches rescheduled their services so they wouldn't clash with Franklin's, and most of the other Black Baptist ministers in the city would go along to watch him preach.\n\nIn 1948 though, a couple of years after moving to Detroit, Barbara finally left her husband. She took Vaughn with her and moved back to Buffalo, leaving the four biological children she'd had with C.L. with their father.  But it's important to note that she didn't leave her children -- they would visit her on a regular basis, and stay with her over school holidays. Aretha later said \"Despite the fact that it has been written innumerable times, it is an absolute lie that my mother abandoned us. In no way, shape, form, or fashion did our mother desert us.\"\n\nBarbara's place in the home was filled by many women -- C.L. Franklin's mother moved up from Mississippi to help him take care of the children, the ladies from the church would often help out, and even stars like Mahalia Jackson would turn up and cook meals for the children.\n\nThere were also the women with whom Franklin carried on affairs, including Anna Gordy, Ruth Brown, and Dinah Washington, the most important female jazz and blues singer of the fifties, who had major R&B hits with records like her version of \"Cold Cold Heart\":\n\n[Excerpt: Dinah Washington, \"Cold Cold Heart\"]\n\nAlthough my own favourite record of hers is \"Big Long Slidin' Thing\", which she made with arranger Quincy Jones:\n\n[Excerpt: Dinah Washington, \"Big Long Slidin' Thing\"]\n\nIt's about a trombone. Get your minds out of the gutter.\n\nWashington was one of the biggest vocal influences on young Aretha, but the single biggest influence was Clara Ward, another of C.L. Franklin's many girlfriends. Ward was the longest-lasting of these, and there seems to have been a lot of hope on both her part and Aretha's that she and Rev. Franklin would marry, though Franklin always made it very clear that monogamy wouldn't suit him.\n\nWard was one of the three major female gospel singers of the middle part of the century, and possibly even more technically impressive as a vocalist than the other two, Sister Rosetta Tharpe and Mahalia Jackson. Where Jackson was an austere performer, who refused to perform in secular contexts at all for most of her life, and took herself and her music very seriously, and Tharpe was a raunchier, funnier, more down-to-earth performer who was happy to play for blues audiences and even to play secular music on occasion, Ward was a *glamorous* performer, who wore sequined dresses and piled her hair high on her head.\n\nWard had become a singer in 1931 when her mother had what she later talked about as a religious epiphany, and decided she wasn't going to be a labourer any more, she was going to devote her life to gospel music. Ward's mother had formed a vocal group with her two daughters, and Clara quickly became the star and her mother's meal ticket -- and her mother was very possessive of that ticket, to the extent that Ward, who was a bisexual woman who mostly preferred men, had more relationships with women, because her mother wouldn't let her be alone with the men she was attracted to.\n\nBut Ward did manage to keep a relationship going with C.L. Franklin, and Aretha Franklin talked about the moment she decided to become a singer, when she saw Ward singing \"Peace in the Valley\" at a funeral:\n\n[Excerpt: Clara Ward, \"Peace in the Valley\"]\n\nAs well as looking towards Ward as a vocal influence, Aretha was also influenced by her as a person -- she became a mother figure to Aretha, who would talk later about watching Ward eat, and noting her taking little delicate bites, and getting an idea of what it meant to be ladylike from her.\n\nAfter Ward's death in 1973, a notebook was found in which she had written her opinions of other singers. For Aretha she wrote “My baby Aretha, she doesn’t know how good she is. Doubts self. Some day—to the moon. I love that girl.”\n\nWard's influence became especially important to Aretha and her siblings after their mother died of a heart attack a few years after leaving her husband, when Aretha was ten, and Aretha, already a very introverted child, became even more so. Everyone who knew Aretha said that her later diva-ish reputation came out of a deep sense of insecurity and introversion -- that she was a desperately private, closed-off, person who would rarely express her emotions at all, and who would look away from you rather than make eye contact. The only time she let herself express emotions was when she performed music.\n\nAnd music was hugely important in the Franklin household. Most preachers in the Black church at that time were a bit dismissive of gospel music, because they thought the music took away from their prestige -- they saw it as a necessary evil, and resented it taking up space when their congregations could have been listening to them. But Rev. Franklin was himself a rather good singer, and even made a few gospel records himself in 1950, recording for Joe Von Battle, who owned a record shop on Hastings Street and also put out records by blues singers:\n\n[Excerpt: C.L. Franklin, \"I Am Climbing Higher Mountains\" ]\n\nThe church's musical director was James Cleveland, one of the most important gospel artists of the fifties and sixties, who sang with groups like the Caravans:\n\n[Excerpt: The Caravans, \"What Kind of Man is This?\" ]\n\nCleveland, who had started out in the choir run by Thomas Dorsey, the writer of “Take My Hand Precious Lord” and “Peace in the Valley”, moved in with the Franklin family for a while, and he gave the girls tips on playing the piano -- much later he would play piano on Aretha's album Amazing Grace, and she said of him “He showed me some real nice chords, and I liked his deep, deep sound”. Other than Clara Ward, he was probably the single biggest musical influence on Aretha.\n\nAnd all the touring gospel musicians would make appearances at New Bethel Church, not least of them Sam Cooke, who first appeared there with the Highway QCs and would continue to do so after joining the Soul Stirrers:\n\n[Excerpt: The Soul Stirrers, \"Touch the Hem of his Garment\"]\n\nYoung Aretha and her older sister Erma both had massive crushes on Cooke, and there were rumours that he had an affair with one or both of them when they were in their teens, though both denied it. Aretha later said \"When I first saw him, all I could do was sigh... Sam was love on first hearing, love at first sight.\"\nBut it wasn't just gospel music that filled the house. One of the major ways that C.L. Franklin's liberalism showed was in his love of secular music, especially jazz and blues, which he regarded as just as important in Black cultural life as gospel music. We already talked about Dinah Washington being a regular visitor to the house, but every major Black entertainer would visit the Franklin residence when they were in Detroit. Both Aretha and Cecil Franklin vividly remembered visits from Art Tatum, who would sit at the piano and play for the family and their guests:\n\n[Excerpt: Art Tatum, \"Tiger Rag\"]\n\nTatum was such a spectacular pianist that there's now a musicological term, the tatum, named after him, for the smallest possible discernible rhythmic interval between two notes. Young Aretha was thrilled by his technique, and by that of Oscar Peterson, who also regularly came to the Franklin home, sometimes along with Ella Fitzgerald. Nat \"King\" Cole was another regular visitor.\n\nThe Franklin children all absorbed the music these people -- the most important musicians of the time -- were playing in their home, and young Aretha in particular became an astonishing singer and also an accomplished pianist. Smokey Robinson later said:\n\n“The other thing that knocked us out about Aretha was her piano playing. There was a grand piano in the Franklin living room, and we all liked to mess around. We’d pick out little melodies with one finger. But when Aretha sat down, even as a seven-year-old, she started playing chords—big chords. Later I’d recognize them as complex church chords, the kind used to accompany the preacher and the solo singer. At the time, though, all I could do was view Aretha as a wonder child. Mind you, this was Detroit, where musical talent ran strong and free. Everyone was singing and harmonizing; everyone was playing piano and guitar. Aretha came out of this world, but she also came out of another far-off magical world none of us really understood. She came from a distant musical planet where children are born with their gifts fully formed.”\n\nC.L. Franklin became more involved in the music business still when Joe Von Battle started releasing records of his sermons, which had become steadily more politically aware:\n\n[Excerpt: C.L. Franklin, \"Dry Bones in the Valley\"]\n\nFranklin was not a Marxist -- he was a liberal, but like many liberals was willing to stand with Marxists where they had shared interests, even when it was dangerous. For example in 1954, at the height of McCarthyism, he had James and Grace Lee Boggs, two Marxist revolutionaries, come to the pulpit and talk about their support for the anti-colonial revolution in Kenya, and they sold four hundred copies of their pamphlet after their talk, because he saw that the struggle of Black Africans to get out from white colonial rule was the same struggle as that of Black Americans.\n\nAnd Franklin's powerful sermons started getting broadcast on the radio in areas further out from Detroit, as Chess Records picked up the distribution for them and people started playing the records on other stations. People like future Congressman John Lewis and the Reverend Jesse Jackson would later talk about listening to C.L. Franklin's records on the radio and being inspired -- a whole generation of Black Civil Rights leaders took their cues from him, and as the 1950s and 60s went on he became closer and closer to Martin Luther King in particular.\n\nBut C.L. Franklin was always as much an ambitious showman as an activist, and he started putting together gospel tours, consisting mostly of music but with himself giving a sermon as the headline act. And he became very, very wealthy from these tours. On one trip in the south, his car broke down, and he couldn't find a mechanic willing to work on it. A group of white men started mocking him with racist terms, trying to provoke him, as he was dressed well and driving a nice car (albeit one that had broken down). Rather than arguing with them, he walked to a car dealership, and bought a new car with the cash that he had on him. By 1956 he was getting around $4000 per appearance, roughly equivalent to $43,000 today, and he was making a *lot* of appearances. He also sold half a million records that year.\n\nVarious gospel singers, including the Clara Ward Singers, would perform on the tours he organised, and one of those performers was Franklin's middle daughter Aretha. Aretha had become pregnant when she was twelve, and after giving birth to the child she dropped out of school, but her grandmother did most of the child-rearing for her, while she accompanied her father on tour.\n\nAretha's first recordings, made when she was just fourteen, show what an astonishing talent she already was at that young age. She would grow as an artist, of course, as she aged and gained experience, but those early gospel records already show an astounding maturity and ability. It's jaw-dropping to listen to these records of a fourteen-year-old, and immediately recognise them as a fully-formed Aretha Franklin.\n\n[Excerpt: Aretha Franklin, \"There is a Fountain Filled With Blood\"]\n\nSmokey Robinson's assessment that she was born with her gifts fully formed doesn't seem like an exaggeration when you hear that.\n\nFor the latter half of the fifties, Aretha toured with her father, performing on the gospel circuit and becoming known there. But the Franklin sisters were starting to get ideas about moving into secular music. This was largely because their family friend Sam Cooke had done just that, with \"You Send Me\":\n\n[Excerpt: Sam Cooke, \"You Send Me\"]\n\nAretha and Erma still worshipped Cooke, and Aretha would later talk about getting dressed up just to watch Cooke appear on the TV. Their brother Cecil later said \"I remember the night Sam came to sing at the Flame Show Bar in Detroit. Erma and Ree said they weren’t going because they were so heartbroken that Sam had recently married. I didn’t believe them. And I knew I was right when they started getting dressed about noon for the nine o’clock show. Because they were underage, they put on a ton of makeup to look older. It didn’t matter ’cause Berry Gordy’s sisters, Anna and Gwen, worked the photo concession down there, taking pictures of the party people. Anna was tight with Daddy and was sure to let my sisters in. She did, and they came home with stars in their eyes.”\n\nMoving from gospel to secular music still had a stigma against it in the gospel world, but Rev. Franklin had never seen secular music as sinful, and he encouraged his daughters in their ambitions. Erma was the first to go secular, forming a girl group, the Cleo-Patrettes, at the suggestion of the Four Tops, who were family friends, and recording a single for Joe Von Battle's J-V-B label, \"No Other Love\":\n\n[Excerpt: The Cleo-Patrettes, \"No Other Love\"]\n\nBut the group didn't go any further, as Rev. Franklin insisted that his eldest daughter had to finish school and go to university before she could become a professional singer. Erma missed other opportunities for different reasons, though -- Berry Gordy, at this time still a jobbing songwriter, offered her a song he'd written with his sister and Roquel Davis, but Erma thought of herself as a jazz singer and didn't want to do R&B, and so \"All I Could Do Was Cry\" was given to Etta James instead, who had a top forty pop hit with it:\n\n[Excerpt: Etta James, \"All I Could Do Was Cry\"]\n\nWhile Erma's move into secular music was slowed by her father wanting her to have an education, there was no such pressure on Aretha, as she had already dropped out. But Aretha had a different problem -- she was very insecure, and said that church audiences \"weren't critics, but worshippers\", but she was worried that nightclub audiences in particular were just the kind of people who would just be looking for flaws, rather than wanting to support the performer as church audiences did.\n\nBut eventually she got up the nerve to make the move. There was the possibility of her getting signed to Motown -- her brother was still best friends with Smokey Robinson, while the Gordy family were close to her father -- but Rev. Franklin had his eye on bigger things. He wanted her to be signed to Columbia, which in 1960 was the most prestigious of all the major labels. As Aretha's brother Cecil later said \"He wanted Ree on Columbia, the label that recorded Mahalia Jackson, Duke Ellington, Johnny Mathis, Tony Bennett, Percy Faith, and Doris Day. Daddy said that Columbia was the biggest and best record company in the world. Leonard Bernstein recorded for Columbia.\"\n\nThey went out to New York to see Phil Moore, a legendary vocal coach and arranger who had helped make Lena Horne and Dorothy Dandridge into stars, but Moore actually refused to take her on as a client, saying \"She does not require my services. Her style has already been developed. Her style is in place. It is a unique style that, in my professional opinion, requires no alteration. It simply requires the right material. Her stage presentation is not of immediate concern. All that will come later. The immediate concern is the material that will suit her best. And the reason that concern will not be easily addressed is because I can’t imagine any material that will not suit her.\"\n\nThat last would become a problem for the next few years, but the immediate issue was to get someone at Columbia to listen to her, and Moore could help with that -- he was friends with John Hammond.\n\nHammond is a name that's come up several times in the podcast already -- we mentioned him in the very earliest episodes, and also in episode ninety-eight, where we looked at his signing of Bob Dylan. But Hammond was a legend in the music business. He had produced sessions for Bessie Smith, had discovered Count Basie and Billie Holiday, had convinced Benny Goodman to hire Charlie Christian and Lionel Hampton, had signed Pete Seeger and the Weavers to Columbia, had organised the Spirituals to Swing concerts which we talked about in the first few episodes of this podcast, and was about to put out the first album of Robert Johnson's recordings. Of all the executives at Columbia, he was the one who had the greatest eye for talent, and the greatest understanding of Black musical culture.\n\nMoore suggested that the Franklins get Major Holley to produce a demo recording that he could get Hammond to listen to. Major Holley was a family friend, and a jazz bassist who had played with Oscar Peterson and Coleman Hawkins among others, and he put together a set of songs for Aretha that would emphasise the jazz side of her abilities, pitching her as a Dinah Washington style bluesy jazz singer. The highlight of the demo was a version of \"Today I Sing the Blues\", a song that had originally been recorded by Helen Humes, the singer who we last heard of recording “Be Baba Leba” with Bill Doggett:\n\n[Excerpt: Helen Humes, \"Today I Sing the Blues\"]\n\nThat original version had been produced by Hammond, but the song had also recently been covered by Aretha's idol, Sam Cooke:\n\n[Excerpt: Sam Cooke, \"Today I Sing the Blues\"]\n\nHammond was hugely impressed by the demo, and signed Aretha straight away, and got to work producing her first album. But he and Rev. Franklin had different ideas about what Aretha should do. Hammond wanted to make a fairly raw-sounding bluesy jazz album, the kind of recording he had produced with Bessie Smith or Billie Holiday, but Rev. Franklin wanted his daughter to make music that would cross over to the white pop market -- he was aiming for the same kind of audience that Nat \"King\" Cole or Harry Belafonte had, and he wanted her recording standards like \"Over the Rainbow\".\n\nThis showed a lack of understanding on Rev. Franklin's part of how such crossovers actually worked at this point. As Etta James later said, \"If you wanna have Black hits, you gotta understand the Black streets, you gotta work those streets and work those DJs to get airplay on Black stations... Or looking at it another way, in those days you had to get the Black audience to love the hell outta you and then hope the love would cross over to the white side. Columbia didn’t know nothing ’bout crossing over.”\n\nBut Hammond knew they had to make a record quickly, because Sam Cooke had been working on RCA Records, trying to get them to sign Aretha, and Rev. Franklin wanted an album out so they could start booking club dates for her, and was saying that if they didn't get one done quickly he'd take up that offer, and so they came up with a compromise set of songs which satisfied nobody, but did produce two R&B top ten hits, \"Won't Be Long\" and Aretha's version of \"Today I Sing the Blues\":\n\n[Excerpt: Aretha Franklin, \"Today I Sing the Blues\"]\n\nThis is not to say that Aretha herself saw this as a compromise -- she later said \"I have never compromised my material. Even then, I knew a good song from a bad one. And if Hammond, one of the legends of the business, didn’t know how to produce a record, who does? No, the fault was with promotion.\"\n\nAnd this is something important to bear in mind as we talk about her Columbia records. Many, *many* people have presented those records as Aretha being told what to do by producers who didn't understand her art and were making her record songs that didn't fit her style. That's not what's happening with the Columbia records. Everyone actually involved said that Aretha was very involved in the choices made -- and there are some genuinely great tracks on those albums.\n\nThe problem is that they're *unfocused*. Aretha was only eighteen when she signed to the label, and she loved all sorts of music -- blues, jazz, soul, standards, gospel, middle-of-the-road pop music -- and wanted to sing all those kinds of music. And she *could* sing all those kinds of music, and sing them well. But it meant the records weren't coherent. You didn't know what you were getting, and there was no artistic personality that dominated them, it was just what Aretha felt like recording.\n\nAround this time, Aretha started to think that maybe her father didn't know what he was talking about when it came to popular music success, even though she idolised him in most areas, and she turned to another figure, who would soon become both her husband and manager. Ted White. Her sister Erma, who was at that time touring with Lloyd Price, had introduced them, but in fact Aretha had first seen White years earlier, in her own house -- he had been Dinah Washington's boyfriend in the fifties, and her first sight of him had been carrying a drunk Washington out of the house after a party.\n\nIn interviews with David Ritz, who wrote biographies of many major soul stars including both Aretha Franklin and Etta James, James had a lot to say about White, saying “Ted White was famous even before he got with Aretha. My boyfriend at the time, Harvey Fuqua, used to talk about him. Ted was supposed to be the slickest pimp in Detroit. When I learned that Aretha married him, I wasn’t surprised. A lot of the big-time singers who we idolized as girls—like Billie Holiday and Sarah Vaughan—had pimps for boyfriends and managers. That was standard operating procedure. My own mother had made a living turning tricks. When we were getting started, that way of life was part of the music business. It was in our genes. Part of the lure of pimps was that they got us paid.\"\n\nShe compared White to Ike Turner, saying \"Ike made Tina, no doubt about it. He developed her talent. He showed her what it meant to be a performer. He got her famous. Of course, Ted White was not a performer, but he was savvy about the world. When Harvey Fuqua introduced me to him—this was the fifties, before he was with Aretha—I saw him as a super-hip extra-smooth cat. I liked him. He knew music. He knew songwriters who were writing hit songs. He had manners. Later, when I ran into him and Aretha—this was the sixties—I saw that she wasn’t as shy as she used to be.\"\n\nWhite was a pimp, but he was also someone with music business experience -- he owned an unsuccessful publishing company, and also ran a chain of jukeboxes. He was also thirty, while Aretha was only eighteen.\n\nBut White didn't like the people in Aretha's life at the time -- he didn't get on well with her father, and he also clashed with John Hammond. And Aretha was also annoyed at Hammond, because her sister Erma had signed to Epic, a Columbia subsidiary, and was releasing her own singles:\n\n[Excerpt: Erma Franklin, \"Hello Again\"]\n\nAretha was certain that Hammond had signed Erma, even though Hammond had nothing to do with Epic Records, and Erma had actually been recommended by Lloyd Price. And Aretha, while for much of her career she would support her sister, was also terrified that her sister might have a big hit before her and leave Aretha in her shadow.\n\nHammond was still the credited producer on Aretha's second album, <em>The Electrifying Aretha Franklin</em>, but his lack of say in the sessions can be shown in the choice of lead-off single. \"Rock-a-Bye Your Baby With a Dixie Melody\" was originally recorded by Al Jolson in 1918:\n\n[Excerpt: Al Jolson, \"Rock-a-Bye Your Baby With a Dixie Melody\"]\n\nRev. Franklin pushed for the song, as he was a fan of Jolson -- Jolson, oddly, had a large Black fanbase, despite his having been a blackface performer, because he had *also* been a strong advocate of Black musicians like Cab Calloway, and the level of racism in the media of the twenties through forties was so astonishingly high that even a blackface performer could seem comparatively OK.\n\nAretha's performance was good, but it was hardly the kind of thing that audiences were clamouring for in 1961:\n\n[Excerpt: Aretha Franklin, \"Rock-a-Bye Your Baby With a Dixie Melody\"]\n\nThat single came out the month after _Down Beat_ magazine gave Aretha the \"new-star female vocalist award\", and it oddly made the pop top forty, her first record to do so, and the B-side made the R&B top ten, but for the next few years both chart success and critical acclaim eluded her. None of her next nine singles would make higher than number eighty-six on the Hot One Hundred, and none would make the R&B charts at all.\n\nAfter that transitional second album, she was paired with producer Bob Mersey, who was precisely the kind of white pop producer that one would expect for someone who hoped for crossover success. Mersey was the producer for many of Columbia's biggest stars at the time -- people like Barbra Streisand, Andy Williams, Julie Andrews, Patti Page, and Mel Tormé -- and it was that kind of audience that Aretha wanted to go for at this point. To give an example of the kind of thing that Mersey was doing, just the month before he started work on his first collaboration with Aretha, _The Tender, the Moving, the Swinging Aretha Franklin_, his production of Andy Williams singing \"Moon River\" was released:\n\n[Excerpt: Andy Williams, \"Moon River\"]\n\nThis was the kind of audience Aretha was going for when it came to record sales – the person she compared herself to most frequently at this point was Barbra Streisand – though in live performances she was playing with a small jazz group in jazz venues, and going for the same kind of jazz-soul crossover audience as Dinah Washington or Ray Charles. The strategy seems to have been to get something like the success of her idol Sam Cooke, who could play to soul audiences but also play the Copacabana, but the problem was that Cooke had built an audience before doing that -- she hadn't.\nBut even though she hadn't built up an audience, musicians were starting to pay attention. Ted White, who was still in touch with Dinah Washington, later said “Women are very catty. They’ll see a girl who’s dressed very well and they’ll say, Yeah, but look at those shoes, or look at that hairdo. Aretha was the only singer I’ve ever known that Dinah had no negative comments about. She just stood with her mouth open when she heard Aretha sing.”\n\nThe great jazz vocalist Carmen McRea went to see Aretha at the Village Vanguard in New York around this time, having heard the comparisons to Dinah Washington, and met her afterwards. She later said \"Given how emotionally she sang, I expected her to have a supercharged emotional personality like Dinah. Instead, she was the shyest thing I’ve ever met. Would hardly look me in the eye. Didn’t say more than two words. I mean, this bitch gave bashful a new meaning. Anyway, I didn’t give her any advice because she didn’t ask for any, but I knew goddamn well that, no matter how good she was—and she was absolutely wonderful—she’d have to make up her mind whether she wanted to be Della Reese, Dinah Washington, or Sarah Vaughan. I also had a feeling she wouldn’t have minded being Leslie Uggams or Diahann Carroll. I remember thinking that if she didn’t figure out who she was—and quick—she was gonna get lost in the weeds of the music biz.\"\n\nSo musicians were listening to Aretha, even if everyone else wasn't. The Tender, the Moving, the Swinging Aretha Franklin, for example, was full of old standards like \"Try a Little Tenderness\":\n\n[Excerpt: Aretha Franklin, \"Try a Little Tenderness\"]\n\nThat performance inspired Otis Redding to cut his own version of that song a few years later:\n\n[Excerpt: Otis Redding, \"Try a Little Tenderness\"]\n\nAnd it might also have inspired Aretha's friend and idol Sam Cooke to include the song in his own lounge sets.\n\nThe Tender, the Moving, the Swinging Aretha Franklin also included Aretha's first original composition, but in general it wasn't a very well-received album.\n\nIn 1963, the first cracks started to develop in Aretha's relationship with Ted White. According to her siblings, part of the strain was because Aretha's increasing commitment to the civil rights movement was costing her professional opportunities. Her brother Cecil later said \"Ted White had complete sway over her when it came to what engagements to accept and what songs to sing. But if Daddy called and said, ‘Ree, I want you to sing for Dr. King,’ she’d drop everything and do just that. I don’t think Ted had objections to her support of Dr. King’s cause, and he realized it would raise her visibility. But I do remember the time that there was a conflict between a big club gig and doing a benefit for Dr. King. Ted said, ‘Take the club gig. We need the money.’ But Ree said, ‘Dr. King needs me more.’ She defied her husband. Maybe that was the start of their marital trouble. Their thing was always troubled because it was based on each of them using the other. Whatever the case, my sister proved to be a strong soldier in the civil rights fight. That made me proud of her and it kept her relationship with Daddy from collapsing entirely.\"\n\nIn part her increasing activism was because of her father's own increase in activity. The benefit that Cecil is talking about there is probably one in Chicago organised by Mahalia Jackson, where Aretha headlined on a bill that also included Jackson, Eartha Kitt, and the comedian Dick Gregory.\n\nThat was less than a month before her father organised the Detroit Walk to Freedom, a trial run for the more famous March on Washington a few weeks later. The Detroit Walk to Freedom was run by the Detroit Council for Human Rights, which was formed by Rev. Franklin and Rev. Albert Cleage, a much more radical Black nationalist who often differed with Franklin's more moderate integrationist stance. They both worked together to organise the Walk to Freedom, but Franklin's stance predominated, as several white liberal politicians, like the Mayor of Detroit, Jerome Cavanagh, were included in the largely-Black March. It drew crowds of 125,000 people, and Dr. King called it \"one of the most wonderful things that has happened in America\", and it was the largest civil rights demonstration in American history up to that point.\n\nKing's speech in Detroit was recorded and released on Motown Records:\n\n[Excerpt: Martin Luther King, \"Original 'I Have a Dream' Speech”]\n\nHe later returned to the same ideas in his more famous speech in Washington.\n\nDuring that civil rights spring and summer of 1963, Aretha also recorded what many think of as the best of her Columbia albums, a collection of jazz standards  called Laughing on the Outside, which included songs like \"Solitude\", \"Ol' Man River\" and \"I Wanna Be Around\":\n\n[Excerpt: Aretha Franklin, \"I Wanna Be Around\"]\n\nThe opening track, \"Skylark\", was Etta James' favourite ever Aretha Franklin performance, and is regarded by many as the definitive take on the song:\n\n[Excerpt: Aretha Franklin, \"Skylark\"]\n\nEtta James later talked about discussing the track with the great jazz singer Sarah Vaughan, one of Aretha's early influences, who had recorded her own version of the song: \"Sarah said, ‘Have you heard of this Aretha Franklin girl?’ I said, ‘You heard her do “Skylark,” didn’t you?’ Sarah said, ‘Yes, I did, and I’m never singing that song again.”\n\nBut while the album got noticed by other musicians, it didn't get much attention from the wider public. Mersey decided that a change in direction was needed, and they needed to get in someone with more of a jazz background to work with Aretha. He brought in pianist and arranger Bobby Scott, who had previously worked with people like Lester Young, and Scott said of their first meeting “My first memory of Aretha is that she wouldn’t look at me when I spoke. She withdrew from the encounter in a way that intrigued me. At first I thought she was just shy—and she was—but I also felt her reading me...For all her deference to my experience and her reluctance to speak up, when she did look me in the eye, she did so with a quiet intensity before saying, ‘I like all your ideas, Mr. Scott, but please remember I do want hits.’”\n\nThey started recording together, but the sides they cut wouldn't be released for a few years. Instead, Aretha and Mersey went in yet another direction. Dinah Washington died suddenly in December 1963, and given that Aretha was already being compared to Washington by almost everyone, and that Washington had been a huge influence on her, as well as having been close to both her father and her husband/manager, it made sense to go into the studio and quickly cut a tribute album, with Aretha singing Washington's hits:\n\n[Excerpt: Aretha Franklin, \"Cold Cold Heart\"]\n\nUnfortunately, while Washington had been wildly popular, and one of the most important figures in jazz and R&B in the forties and fifties, her style was out of date. The tribute album, titled Unforgettable, came out in February 1964, the same month that Beatlemania hit the US. Dinah Washington was the past, and trying to position Aretha as \"the new Dinah Washington\" would doom her to obscurity. John Hammond later said \"I remember thinking that if Aretha never does another album she will be remembered for this one. No, the problem was timing. Dinah had died, and, outside the black community, interest in her had waned dramatically. Popular music was in a radical and revolutionary moment, and that moment had nothing to do with Dinah Washington, great as she was and will always be.”\n\nAt this point, Columbia brought in Clyde Otis, an independent producer and songwriter who had worked with artists like Washington and Sarah Vaughan, and indeed had written one of the songs on Unforgettable, but had also worked with people like Brook Benton, who had a much more R&B audience. For example, he'd written \"Baby, You Got What It Takes\" for Benton and Washington to do as a duet:\n\n[Excerpt: Brook Benton and Dinah Washington, \"Baby, You Got What it Takes\"]\n\nIn 1962, when he was working at Mercury Records before going independent, Otis had produced thirty-three of the fifty-one singles the label put out that year that had charted. Columbia had decided that they were going to position Aretha firmly in the R&B market, and assigned Otis to do just that.\n\nAt first, though, Otis had no more luck with getting Aretha to sing R&B than anyone else had. He later said \"Aretha, though, couldn’t be deterred from her determination to beat Barbra Streisand at Barbra’s own game. I kept saying, ‘Ree, you can outsing Streisand any day of the week. That’s not the point. The point is to find a hit.’ But that summer she just wanted straight-up ballads. She insisted that she do ‘People,’ Streisand’s smash. Aretha sang the hell out of it, but no one’s gonna beat Barbra at her own game.\"\n\nBut after several months of this, eventually Aretha and White came round to the idea of making an R&B record. Otis produced an album of contemporary R&B, with covers of music from the more sophisticated end of the soul market, songs like \"My Guy\", \"Every Little Bit Hurts\", and \"Walk on By\", along with a few new originals brought in by Otis. The title track, \"Runnin' Out of Fools\", became her biggest hit in three years, making number fifty-seven on the pop charts and number thirty on the R&B charts:\n\n[Excerpt: Aretha Franklin, \"Runnin' Out of Fools\"]\n\nAfter that album, they recorded another album with Otis producing, a live-in-the-studio jazz album, but again nobody involved could agree on a style for her. By this time it was obvious that she was unhappy with Columbia and would be leaving the label soon, and they wanted to get as much material in the can as they could, so they could continue releasing material after she left. But her working relationship with Otis was deteriorating -- Otis and Ted White did not get on, Aretha and White were having their own problems, and Aretha had started just not showing up for some sessions, with nobody knowing where she was.\n\nColumbia passed her on to yet another producer, this time Bob Johnston, who had just had a hit with Patti Page, \"Hush, Hush, Sweet Charlotte\":\n\n[Excerpt: Patti Page, \"Hush, Hush, Sweet Charlotte\"]\n\nJohnston was just about to hit an incredible hot streak as a producer. At the same time as his sessions with Aretha, he was also producing Bob Dylan's Highway 61 Revisited, and just after the sessions finished he'd go on to produce Simon & Garfunkel's Sounds of Silence album. In the next few years he would produce a run of classic Dylan albums like Blonde on Blonde, John Wesley Harding, and New Morning, Simon & Garfunkel's follow up Parsley, Sage, Rosemary & Thyme, Leonard Cohen's first three albums, and Johnny Cash's comeback with the Live at Folsom Prison album and its follow up At San Quentin. He also produced records for Marty Robbins, Flatt & Scruggs, the Byrds, and Burl Ives during that time period.\n\nBut you may notice that while that's as great a run of records as any producer was putting out at the time, it has little to do with the kind of music that Aretha Franklin was making then, or would become famous with. Johnston produced a string-heavy session in which Aretha once again tried to sing old standards by people like Oscar Hammerstein and Jerome Kern. She then just didn't turn up for some more sessions, until one final session in August, when she recorded songs like \"Swanee\" and \"You Made Me Love You\".\nFor more than a year, she didn't go into a studio. She also missed many gigs and disappeared from her family's life for periods of time. Columbia kept putting out records of things she'd already recorded, but none of them had any success at all.\n\nMany of the records she'd made for Columbia had been genuinely great -- there's a popular perception that she was being held back by a record company that forced her to sing material she didn't like, but in fact she *loved* old standards, and jazz tunes, and contemporary pop at least as much as any other kind of music. Truly great musicians tend to have extremely eclectic tastes, and Aretha Franklin was a truly great musician if anyone was. Her Columbia albums are as good as any albums in those genres put out in that time period, and she remained proud of them for the rest of her life.\n\nBut that very eclecticism had meant that she hadn't established a strong identity as a performer -- everyone who heard her records knew she was a great singer, but nobody knew what \"an Aretha Franklin record\" really meant -- and she hadn't had a single real hit, which was the thing she wanted more than anything.\n\nAll that changed when in the early hours of the morning, Jerry Wexler was at FAME Studios in Muscle Shoals recording a Wilson Pickett track -- from the timeline, it was probably the session for \"Mustang Sally\", which coincidentally was published by Ted White's publishing company, as Sir Mack Rice, the writer, was a neighbour of White and Franklin, and to which Aretha had made an uncredited songwriting contribution:\n\n[Excerpt: Wilson Pickett, \"Mustang Sally\"]\n\nWhatever the session, it wasn't going well. Percy Sledge, another Atlantic artist who recorded at Muscle Shoals, had turned up and had started winding Pickett up, telling him he sounded just like James Brown. Pickett *hated* Brown -- it seems like almost every male soul singer of the sixties hated James Brown -- and went to physically attack Sledge. Wexler got between the two men to protect his investments in them -- both were the kind of men who could easily cause some serious damage to anyone they hit -- and Pickett threw him to one side and charged at Sledge. At that moment the phone went, and Wexler yelled at the two of them to calm down so he could talk on the phone.\n\nThe call was telling him that Aretha Franklin was interested in recording for Atlantic.\n\nRev. Louise Bishop, later a Democratic politician in Pennsylvania, was at this time a broadcaster, presenting a radio gospel programme, and she knew Aretha. She'd been to see her perform, and had been astonished by Aretha's performance of a recent Otis Redding single, \"Respect\":\n\n[Excerpt: Otis Redding, \"Respect\"]\n\nRedding will, by the way, be getting his own episode in a few months' time, which is why I've not covered the making of that record here.\n\nBishop thought that Aretha did the song even better than Redding -- something Bishop hadn't thought possible. When she got talking to Aretha after the show, she discovered that her contract with Columbia was up, and Aretha didn't really know what she was going to do -- maybe she'd start her own label or something. She hadn't been into the studio in more than a year, but she did have some songs she'd been working on.\n\nBishop was good friends with Jerry Wexler, and she knew that he was a big fan of Aretha's, and had been saying for a while that when her contract was up he'd like to sign her. Bishop offered to make the connection, and then went back home and phoned Wexler's wife, waking her up -- it was one in the morning by this point, but Bishop was accustomed to phoning Wexler late at night when it was something important. Wexler's wife then phoned him in Muscle Shoals, and he phoned Bishop back and made the arrangements to meet up.\n\nInitially, Wexler wasn't thinking about producing Aretha himself -- this was still the period when he and the Ertegun brothers were thinking of selling Atlantic and getting out of the music business, and so while he signed her to the label he was originally going to hand her over to Jim Stewart at Stax to record, as he had with Sam and Dave.\n\nBut in a baffling turn of events, Jim Stewart didn't actually want to record her, and so Wexler determined that he had better do it himself. And he didn't want to do it with slick New York musicians -- he wanted to bring out the gospel sound in her voice, and he thought the best way to do that was with musicians from what Charles Hughes refers to as \"the country-soul triangle\" of Nashville, Memphis, and Muscle Shoals. So he booked a week's worth of sessions at FAME studios, and got in FAME's regular rhythm section, plus a couple of musicians from American Recordings in Memphis -- Chips Moman and Spooner Oldham. Oldham's friend and songwriting partner Dan Penn came along as well -- he wasn't officially part of the session, but he was a fan of Aretha's and wasn't going to miss this.\n\nPenn had been the first person that Rick Hall, the owner of FAME, had called when Wexler had booked the studio, because Hall hadn't actually heard of Aretha Franklin up to that point, but didn't want to let Wexler know that. Penn had assured him that Aretha was one of the all-time great talents, and that she just needed the right production to become massive. As Hall put it in his autobiography, \"Dan tended in those days to hate anything he didn’t write, so I figured if he felt that strongly about her, then she was probably going to be a big star.\"\n\nCharlie Chalmers, a horn player who regularly played with these musicians, was tasked with putting together a horn section.\n\nThe first song they recorded that day was one that the musicians weren't that impressed with at first. \"I Never Loved a Man (the Way I Love You)\" was written by a songwriter named Ronnie Shannon, who had driven from Georgia to Detroit hoping to sell his songs to Motown. He'd popped into a barber's shop where Ted White was having his hair cut to ask for directions to Motown, and White had signed him to his own publishing company and got him to write songs for Aretha.\n\nOn hearing the demo, the musicians thought that the song was mediocre and a bit shapeless:\n\n[Excerpt: Aretha Franklin \"I Never Loved a Man (the Way I Love You) (demo)\"]\n\nBut everyone there was agreed that Aretha herself was spectacular. She didn't speak much to the musicians, just went to the piano and sat down and started playing, and Jerry Wexler later compared her playing to Thelonius Monk (who was indeed one of the jazz musicians who had influenced her). While Spooner Oldham had been booked to play piano, it was quickly decided to switch him to electric piano and organ, leaving the acoustic piano for Aretha to play, and she would play piano on all the sessions Wexler produced for her in future.\n\nAlthough while Wexler is the credited producer (and on this initial session Rick Hall at FAME is a credited co-producer), everyone involved, including Wexler, said that the musicians were taking their cues from Aretha rather than anyone else. She would outline the arrangements at the piano, and everyone else would fit in with what she was doing, coming up with head arrangements directed by her. But Wexler played a vital role in mediating between her and the musicians and engineering staff, all of whom he knew and she didn't. As Rick Hall said \"After her brief introduction by Wexler, she said very little to me or anyone else in the studio other than Jerry or her husband for the rest of the day. I don’t think Aretha and I ever made eye contact after our introduction, simply because we were both so totally focused on our music and consumed by what we were doing.\"\n\nThe musicians started working on \"I Never Loved a Man (the Way I Love You)\", and at first found it difficult to get the groove, but then Oldham came up with an electric piano lick which everyone involved thought of as the key that unlocked the song for them:\n\n[Excerpt: Aretha Franklin, \"I Never Loved a Man (the Way I Love You)\"]\n\nAfter that, they took a break. Most of them were pleased with the track, though Rick Hall wasn't especially happy. But then Rick Hall wasn't especially happy about anything at that point. He'd always used mono for his recordings until then, but had been basically forced to install at least a two-track system by Tom Dowd, Atlantic's chief engineer, and was resentful of this imposition.\n\nDuring the break, Dan Penn went off to finish a song he and Spooner Oldham had been writing, which he hoped Aretha would record at the session:\n\n[Excerpt: Dan Penn and Spooner Oldham, \"Do Right Woman, Do Right Man\"]\n\nThey had the basic structure of the song down, but hadn't quite finished the middle eight, and both Jerry Wexler and Aretha Franklin chipped in uncredited lyrical contributions -- Aretha's line was \"as long as we're together baby, you'd better show some respect to me\".\n\nPenn, Oldham, Chips Moman, Roger Hawkins, and Tommy Cogbill started cutting a backing track for the song, with Penn singing lead initially with the idea that Aretha would overdub her vocal. But while they were doing this, things had been going wrong with the other participants.\n\nAll the FAME and American rhythm section players were white, as were Wexler, Hall, and Dowd, and Wexler had been very aware of this, and of the fact that they were recording in Alabama, where Aretha and her husband might not feel totally safe, so he'd specifically requested that the horn section at least contain some Black musicians. But Charlie Chalmers hadn't been able to get any of the Black musicians he would normally call when putting together a horn section, and had ended up with an all-white horn section as well, including one player, a trumpet player called Ken Laxton, who had a reputation as a good player but had never worked with any of the other musicians there -- he was an outsider in a group of people who regularly worked together and had a pre-existing relationship.\n\nAs the two outsiders, Laxton and Ted White had, at first, bonded, and indeed had started drinking vodka together, passing a bottle between themselves, in a way that Rick Hall would normally not allow in a session -- at the time, the county the studio was in was still a dry county. But as Wexler said, “A redneck patronizing a Black man is a dangerous camaraderie,” and White and Laxton soon had a major falling out.\nEveryone involved tells a different story about what it was that caused them to start rowing, though it seems to have been to do with Laxton not showing the proper respect for Aretha, or even actually sexually assaulting her -- Dan Penn later said “I always heard he patted her on the butt or somethin’, and what would have been wrong with that anyway?”, which says an awful lot about the attitudes of these white Southern men who thought of themselves as very progressive, and were -- for white Southern men in early 1967.\n\nEither way, White got very, very annoyed, and insisted that Laxton get fired from the session, which he was, but that still didn't satisfy White, and he stormed off to the motel, drunk and angry.\n\nThe rest of them finished cutting a basic track for \"Do Right Woman\", but nobody was very happy with it. Oldham said later “She liked the song but hadn’t had time to practice it or settle into it I remember there was Roger playing the drums and Cogbill playing the bass. And I’m on these little simplistic chords on organ, just holding chords so the song would be understood. And that was sort of where it was left. Dan had to sing the vocal, because she didn’t know the song, in the wrong key for him. That’s what they left with—Dan singing the wrong-key vocal and this little simplistic organ and a bass and a drum. We had a whole week to do everything—we had plenty of time—so there was no hurry to do anything in particular.”\nPenn was less optimistic, saying \"But as I remember, I went home that night and I was so dejected. I thought—you ain’t gonna make any money on that, kid. Because all it was, was Cogbill going bum-bum, and Spooner had his little organ holdin’ there, and me screaming at the top of my voice—it sounded pitiful.”\n\nHall thought it was pitiful as well, and he was also not at all impressed with \"I Never Loved a Man\". He thought the session was a total loss, and he went back with Wexler to the motel room where Wexler was staying -- in the same motel as White and Franklin were -- and got very drunk. And then he had one of those great ideas drunk people get -- he decided he was going to go and talk to Ted White and straighten everything out. He was going to be the great diplomat and save the day. Wexler begged him not to, but Hall knew better.\n\nHe went up and knocked on the door of the room where White and Franklin were staying, and White started complaining to him, saying he should have known better than to let his wife record with a bunch of rednecks. After a couple of minutes of White using terms like \"redneck\" and \"whitey\", Hall had had enough, and said that if White called him a redneck once more, he would call White the n word -- except that Hall used the actual word in question. The two started exchanging blows, and according to various of the more lurid accounts either tried to push each other off a fifth-floor balcony or even exchanged gunshots.\n\nMost accounts of these altercations tend to blame White, Laxton, and Hall about equally, and that's largely because White had a generally unpleasant reputation and was not easy to get along with. In this particular instance, though, given that he'd first seen his wife sexually assaulted and then been woken up by a drunk man who used racial slurs at him, I don't think he deserves much of the blame.\n\nHall then had a screaming row with Jerry Wexler, still on the fifth-floor balcony, then went down to the hotel lobby and used a payphone to call White's room and scream more abuse at him, threatening him that he had better get out of town if he knew what was good for him. Meanwhile, Aretha and Ted also had a row, which ended with her leaving the motel in the middle of the night and phoning Wexler in tears from a diner saying they had split up -- though awkwardly for both of them, they met in the airport the next day as they both decided to get out of town.\n\nAretha and Ted did eventually reconcile, though their marriage didn't last that much longer, but Wexler and Hall would never work together again. And Aretha did another of her disappearing acts for a couple of weeks, with nobody able to find her. Wexler had a single usable track from the session -- \"I Never Loved a Man\" -- and when he gave a couple of DJs acetate copies of that he found it became a turntable hit, but he couldn't find his singer to record a B-side.\n\nEventually, Aretha turned up, and Wexler got her into the studio to finish \"Do Right Woman\". To the backing track cut at FAME, Aretha added lead vocals and piano, and backing vocals by her sisters Erma and Carolyn and their friend Cissy Houston -- the aunt of Dionne Warwick and mother of Whitney Houston.\nThere was a slight problem which Moman would later point out, saying “The only thing I found wrong and I still find wrong: Obviously, Rick Hall’s machine and the machine in New York were traveling at a slightly different speed. The piano is out of tune on that record, and it bothered me immensely. The piano is sharp to the track. If you listen to the piano, you hear it—it’s almost a quarter-tone sharp to the track.”\n\nBut that didn't stop the B-side becoming a top forty R&B hit and one of the all-time country-soul classics:\n\n[Excerpt: Aretha Franklin, \"Do Right Woman, Do Right Man\"]\n\nThe A-side, meanwhile, made the top ten on the pop charts and number one on the R&B charts. But Wexler had a problem. He wanted a full album to go with the single, and he wanted the same musicians playing on it -- with the exception, of course, of Ken Laxton. But many of those musicians were employed more-or-less full-time by Rick Hall. He knew that if Hall knew they were going to be working on an Aretha Franklin album without him, Hall would realise that he'd been cut off by Wexler and not let them go.\n\nSo instead, he invited them all up to New York to record an album by the great R&B saxophone player King Curtis, <em>King Curtis Plays Great Memphis Hits</em> -- a quick set of instrumental cover versions of records several of them had played on at Stax or American for Atlantic, so it wouldn't arouse suspicion:\n\n[Excerpt: King Curtis, \"Green Onions\"]\n\nAnd then, once they were there in the studio, he casually suggested to them that, you know, while you're here, you might want to do some more tracks with Aretha as well. This time there would be a more relaxed atmosphere, and a more integrated group of people in the studio -- as well as the white musicians, Aretha's sisters and Cissy Houston were there, and King Curtis stayed around to add saxophone.\n\nHall found out what was happening after about three days, and called the musicians back, but in that time they managed to cut most of what became a classic album -- and Wexler would a couple of years later help some of the FAME musicians start their own Muscle Shoals studio in competition with Hall's, giving them some of the start-up capital they needed.\n\nThe highlight of the album, and second single, was \"Respect\", the song that had so impressed Bishop when she'd heard Aretha perform it live:\n\n[Excerpt: Aretha Franklin, \"Respect\"]\n\nAretha had been working on the song for a year at this point, honing it live, and had come up with several changes to the arrangement. For a start, there were the backing vocals, where her sisters sang \"re, re, re, re, respect\" -- \"Re\" was her family's nickname for Aretha, and several people have pointed out that this effectively makes Aretha herself the embodiment of the concept of respect.\n\nBut even in the studio they would still make changes. One was to introduce a key change for Curtis' saxophone solo, and create a bridge to do that in. According to Wexler, they took the bridge from \"When Something is Wrong With My Baby\" by Sam and Dave:\n\n[Excerpt: Sam and Dave, \"When Something is Wrong With My Baby\"]\n\nAnd turned that into the solo:\n\n[Excerpt: Aretha Franklin, \"Respect\"]\n\nArif Mardin, who was assisting Wexler at the session, said later “We thought, How could we lift this song up? ‘Respect’ is in C. But that bridge, Curtis’s saxophone solo is in F sharp—a totally unrelated key, but we liked it! We liked those chords! So we put it in. And then, from the F sharp, ‘Respect’ starts with a G chord—the five of the G [I think he means the five of the C here]. So from the F sharp we went to the G—it sounded like a half-tone modulation, but it wasn’t. It was a very interesting solo construction and we did it right there. There was nothing haphazard on Aretha’s part. But the way we came up with that strange key change, which led back naturally—it was done there on the spot.\"\n\nNow, everyone involved with that session talks about that change as something \"We\" did, without specifying whose idea it was, but I have a strong suspicion it was Aretha's, and I think I know what inspired her. Because that quote of Mardin's reminded me of something Paul Simon said in an interview about the change to the bridge in his much later song \"Still Crazy After All These Years\":\n\n[Excerpt: Simon and Garfunkel \"Still Crazy After All These Years (live in Central Park)\"]\n\nIn an interview from the eighties, Simon was asked about that key change, and replied:\n\n\"Yeah, I used to do that. It was something I noticed in Antonio Jobim's music. In fact I once mentioned that to him and he said that he wasn't aware of it at all. It was kind of an exercise that I did, which was to try and get every note from a twelve-tone scale into the song. So what would happen is that I would cover most of the notes in the song and there would be maybe three notes that you couldn't get into the scale of the key of the song. And those three notes were really the key to the bridge. Usually it would be a tritone away from whatever key you were using. If you were in the key of C, the farthest away you can go is F sharp. That's the key that's the least related to C.\"\n\nNow, I would just think this was an interesting coincidence, except that a few days after reading that Mardin quote, while researching this episode, I found a quote by Luther Vandross talking about another song on the I Never Loved a Man album -- \"When I produced Aretha in the eighties, the first thing I told her was how much I loved ‘Don’t Let Me Lose This Dream.’ It had this bossa nova–ish silky groove that was pure heaven. I asked her where the song came from. She said she’d been listening to Astrud Gilberto, the girl who sang with Stan Getz, and she wanted to write something with the feeling of Latin soul.\"\n\nNow, Gilberto became famous for recording the songs of Jobim -- the very same person that Paul Simon cited as doing this same kind of key change that we have in \"Respect\". So while she never spoke about it, I would put money on it having been Aretha who came up with that key change, and on it having been inspired by Jobim.\n\nOther changes were made to tie the song into Aretha's other songs. She'd already added the line about \"respect\" to \"Do Right Woman\", but on the tag she sang \"You're running out of fools, and I ain't lyin'\", referencing her last hit on Columbia of any size. And in \"Dr. Feelgood\", one of the songs she'd written herself for the album, she sang “taking care of business is really this man’s game”, and so in the most famous addition to the song, she sang \"take care of T.C.B.\" -- T.C.B. being a slang abbreviation for \"take care of business\":\n\n[Excerpt: Aretha Franklin, \"Respect\"]\n\nAnother bit of slang was that backing vocal phrase, \"sock it to me\", which Aretha's sister Carolyn had heard someone say and had decided would make a good background line. \"Respect\" popularised the phrase, and it soon became a national catchphrase, becoming a running gag on the comedy show Rowan & Martin's Laugh-In, to the extent that even Richard Nixon joined in with it in a desperate attempt to seem down with the kids prior to his election as President:\n\n[Excerpt: Rowan and Martin's Laugh-In]\n\nSeveral people have – rather fancifully, in my opinion – credited that appearance with Nixon winning the election two months later, and it wouldn't have happened without “Respect”.\n\nWhen he heard Aretha's version of \"Respect\", Otis Redding jokingly asked Jerry Wexler to burn the tape, before saying \"It's her song now\". But in becoming Aretha's song, it became *everyone's* song. It went to number one on the pop charts, and this song, which had originally been a rather macho piece, a man demanding respect from his wife, became an anthem of both Black civil rights and the burgeoning feminist movement. This song, recorded in the aftermath of racial violence and drunken machismo, became a rallying cry for Black people wanting civil rights, for women wanting to be treated as human beings, and for queer people wanting to be free from oppression -- and while I haven't talked much about queerness compared to those other aspects here, it is important to note for context that the two biggest musical influences on Aretha's life, Clara Ward and James Cleveland, were both queer (Cleveland was gay and Ward was bi) and that Carolyn Franklin, who helped Aretha arrange the song, was lesbian. Aretha's music was profoundly shaped by those queer influences, just as it was shaped by her being a Black woman.\n\n1967 was the start of Aretha's reign as the \"Queen of Soul\", a title she took on at a ceremony towards the end of the year, but it was also the start of a dramatic turn in Black politics as it related to culture. The day before \"Respect\" hit the charts, Mohammed Ali had his heavyweight title taken from him after refusing to be drafted into the Vietnam War, saying \"No Viet Cong ever called me\" and then using that same slur that Rick Hall used to Ted White. Marginalised people of all kinds were starting to demand the respect they were owed, and which was long overdue, and to do so without the ambiguity and euphemisms they had previously used to make themselves acceptable in the eyes of respectable moderates. And we will see how that plays out in soul and R&B as we look at the rest of the sixties and early seventies.",
  "itunes:subtitle": "Episode 149 of A History of Rock Music in Five Hundred Songs looks at “Respect, and the journey of Aretha Franklin from teenage gospel singer to the Queen of Soul. Click the full post to read liner notes, links to more information, and a transcript of th",
  "itunes:keywords": "Anna Gordy,Aretha Franklin,Arif Mardin,Berry Gordy,Bob Johnston,Bobby Blue Bland,Chips Moman,Clara Ward,Dan Penn,Dinah Washington,Erma Franklin,Etta James,Harvey Fuqua,Jerry Wexler,John Hammond,King Curtis,Lloyd Price,Mahalia Jackson,Martin Luther King,Otis Redding,Percy Sledge,Rick Hall,Sam Cooke,Smokey Robinson,Spooner Oldham,Wilson Pickett",
  "itunes:episode": 149,
  "content:encoded": "Episode 149 of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Respect\", and the journey of Aretha Franklin from teenage gospel singer to the Queen of Soul. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/66751854\">\"I'm Just a Mops\" by the Mops</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\nAlso, people may be interested in a Facebook discussion group for the podcast, run by a friend of mine (I'm not on FB myself) which can be found at <a href=\"https://www.facebook.com/groups/293630102611672/\">https://www.facebook.com/groups/293630102611672/</a>\n\n\n\n<strong>Errata</strong>\n\nI say \"Rock-a-Bye Your Baby to a Dixie Melody\" instead of \"Rock-a-Bye Your Baby With a Dixie Melody\". Also I say Spooner Oldham co-wrote \"Do Right Woman\". I meant Chips Moman.\n<strong style=\"font-size: revert; color: initial;\">Resources</strong>\n\n\nNo Mixcloud this week, as there are too many songs by Aretha Franklin.\n\nMy main biographical source for Aretha Franklin is <a href=\"https://amzn.to/3a43LlF\"><em>Respect: The Life of Aretha Franklin</em> by David Ritz</a>, and this is where most of the quotes from musicians come from.\n\nI also relied heavily on <a href=\"https://amzn.to/3tdmulN\"><em>I Never Loved a Man the Way I Loved You</em> by Matt Dobkin.</a>\n\nInformation on C.L. Franklin came from <a href=\"https://amzn.to/3Lw6zVS\"><em>Singing in a Strange Land: C. L. Franklin, the Black Church, and the Transformation of America</em></a> by Nick Salvatore.\n\nRick Hall's <a href=\"https://amzn.to/3PEQ4Kf\"><em>The Man From Muscle Shoals: My Journey from Shame to Fame</em></a> contains his side of the story.\n\n<a href=\"https://amzn.to/3lul5BR\"><em>Country Soul</em> by Charles L Hughes</a> is a great overview of the soul music made in Muscle Shoals, Memphis, and Nashville in the sixties. Peter Guralnick's <a href=\"https://amzn.to/38C4Voo\"><em>Sweet Soul Music: Rhythm And Blues And The Southern Dream Of Freedom</em></a> is possibly less essential, but still definitely worth reading.\n\nAnd the <em>I Never Loved a Man</em> album is available in <a href=\"https://amzn.to/3Lw6XUk\">this five-album box set</a> for a ludicrously cheap price. But it's actually worth getting <a href=\"https://amzn.to/3MC1sod\">this nineteen-CD set</a> with her first sixteen Atlantic albums and a couple of bonus discs of demos and outtakes. There's barely a duff track in the whole nineteen discs.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\nBefore I start this episode,  I have to say that there are some things people may want to be aware of before listening to this. This episode has to deal, at least in passing, with subjects including child sexual abuse, intimate partner abuse, racism, and misogyny. I will of course try to deal with those subjects as tactfully as possible, but those of you who may be upset by those topics may want to check the episode transcript before or instead of listening.\n\nThose of you who leave comments or send me messages saying \"why can't you just talk about the music instead of all this woke virtue-signalling?\" may also want to skip this episode. You can go ahead and skip all the future ones as well, I won't mind.\n\nAnd one more thing to say before I get into the meat of the episode -- this episode puts me in a more difficult position than most other episodes of the podcast have. When I've talked about awful things that have happened in the course of this podcast previously, I have either been talking about perpetrators -- people like Phil Spector or Jerry Lee Lewis who did truly reprehensible things -- or about victims who have talked very publicly about the abuse they've suffered, people like Ronnie Spector or Tina Turner, who said very clearly \"this is what happened to me and I want it on the public record\".\n\nIn the case of Aretha Franklin, she has been portrayed as a victim *by others*, and there are things that have been said about her life and her relationships which suggest that she suffered in some very terrible ways. But she herself apparently never saw herself as a victim, and didn't want some aspects of her private life talking about. At the start of David Ritz's biography of her, which is one of my main sources here, he recounts a conversation he had with her:\n\n\"When I mentioned the possibility of my writing an independent biography, she said, “As long as I can approve it before it’s published.”\n“Then it wouldn’t be independent,” I said.\n“Why should it be independent?”\n“So I can tell the story from my point of view.”\n“But it’s not your story, it’s mine.”\n“You’re an important historical figure, Aretha. Others will inevitably come along to tell your story. That’s the blessing and burden of being a public figure.”\n“More burden than blessing,” she said.\"\n\nNow, Aretha Franklin is sadly dead, but I think that she still deserves the basic respect of being allowed privacy. So I will talk here about public matters, things she acknowledged in her own autobiography, and things that she and the people around her did in public situations like recording studios and concert venues. But there are aspects to the story of Aretha Franklin as that story is commonly told, which may well be true, but are of mostly prurient interest, don't add much to the story of how the music came to be made, and which she herself didn't want people talking about. So there will be things people might expect me to talk about in this episode, incidents where people in her life, usually men, treated her badly, that I'm going to leave out. That information is out there if people want to look for it, but I don't see myself as under any obligation to share it. That's not me making excuses for people who did inexcusable things, that's me showing some respect to one of the towering artistic figures of the latter half of the twentieth century.\n\nBecause, of course, respect is what this is all about:\n\n[Excerpt: Aretha Franklin, \"Respect\"]\n\nOne name that's come up a few times in this podcast, but who we haven't really talked about that much, is Bobby \"Blue\" Bland. We mentioned him as the single biggest influence on the style of Van Morrison, but Bland was an important figure in the Memphis music scene of the early fifties, which we talked about in several early episodes. He was one of the Beale Streeters, the loose aggregation of musicians that also included B.B. King and Johnny Ace, he worked with Ike Turner, and was one of the key links between blues and soul in the fifties and early sixties, with records like \"Turn on Your Love Light\":\n\n[Excerpt: Bobby \"Blue\" Bland, \"Turn on Your Love Light\"]\n\nBut while Bland was influenced by many musicians we've talked about, his biggest influence wasn't a singer at all. It was a preacher he saw give a sermon in the early 1940s. As he said decades later:\n\n\"Wasn’t his words that got me—I couldn’t tell you what he talked on that day, couldn’t tell you what any of it meant, but it was the way he talked. He talked like he was singing. He talked music. The thing that really got me, though, was this squall-like sound he made to emphasize a certain word. He’d catch the word in his mouth, let it roll around and squeeze it with his tongue. When it popped on out, it exploded, and the ladies started waving and shouting. I liked all that. I started popping and shouting too. That next week I asked Mama when we were going back to Memphis to church.\n“‘Since when you so keen on church?’ Mama asked.\n“‘I like that preacher,’ I said.\n“‘Reverend Franklin?’ she asked.\n“‘Well, if he’s the one who sings when he preaches, that’s the one I like.’\"\n\nBland was impressed by C.L. Franklin, and so were other Memphis musicians. Long after Franklin had moved to Detroit, they remembered him, and Bland and B.B. King would go to Franklin's church to see him preach whenever they were in the city. And Bland studied Franklin's records. He said later \"I liked whatever was on the radio, especially those first things Nat Cole did with his trio. Naturally I liked the blues singers like Roy Brown, the jump singers like Louis Jordan, and the ballad singers like Billy Eckstine, but, brother, the man who really shaped me was Reverend Franklin.\"\n\nBland would study Franklin's records, and would take the style that Franklin used in recorded sermons like \"The Eagle Stirreth Her Nest\":\n\n[Excerpt: C.L. Franklin, \"The Eagle Stirreth Her Nest\"]\n\nAnd you can definitely hear that preaching style on records like Bland's \"I Pity the Fool\":\n\n[Excerpt: Bobby \"Blue\" Bland, \"I Pity the Fool\"]\n\nBut of course, that wasn't the only influence the Reverend C.L. Franklin had on the course of soul music.\n\nC.L. Franklin had grown up poor, on a Mississippi farm, and had not even finished grade school because he was needed to work behind the mule, ploughing the farm for his stepfather. But he had a fierce intelligence and became an autodidact, travelling regularly to the nearest library, thirty miles away, on a horse-drawn wagon, and reading everything he could get his hands on. At the age of sixteen he received what he believed to be a message from God, and decided to become an itinerant preacher.\n\nHe would travel between many small country churches and build up audiences there -- and he would also study everyone else preaching there, analysing their sermons, seeing if he could anticipate their line of argument and get ahead of them, figuring out the structure.\n\nBut unlike many people in the conservative Black Baptist churches of the time, he never saw the spiritual and secular worlds as incompatible. He saw blues music and Black church sermons as both being part of the same thing -- a Black culture and folklore that was worthy of respect in both its spiritual and secular aspects.\n\nHe soon built up a small circuit of local churches where he would preach occasionally, but wasn't the main pastor at any of them. He got married aged twenty, though that marriage didn't last, and he seems to have been ambitious for a greater respectability. When that marriage failed, in June 1936, he married Barbara Siggers, a very intelligent, cultured, young single mother who had attended Booker T Washington High School, the best Black school in Memphis, and he adopted her son Vaughn. While he was mostly still doing churches in Mississippi, he took on one in Memphis as well, in an extremely poor area, but it gave him a foot in the door to the biggest Black city in the US. Barbara would later be called \"one of the really great gospel singers\" by no less than Mahalia Jackson.\n\nWe don't have any recordings of Barbara singing, but Mahalia Jackson certainly knew what she was talking about when it came to great gospel singers:\n\n[Excerpt: Mahalia Jackson, \"Precious Lord, Take My Hand\"]\n\nRev. Franklin was hugely personally ambitious, and he also wanted to get out of rural Mississippi, where the Klan were very active at this time, especially after his daughter Erma was born in 1938. They moved to Memphis in 1939, where he got a full-time position at New Salem Baptist Church, where for the first time he was able to earn a steady living from just one church and not have to tour round multiple churches.\nHe soon became so popular that if you wanted to get a seat for the service at noon, you had to turn up for the 8AM Sunday School or you'd be forced to stand. He also enrolled for college courses at LeMoyne College. He didn't get a degree, but spent three years as a part-time student studying theology, literature, and sociology, and soon developed a liberal theology that was very different from the conservative fundamentalism he'd grown up in, though still very much part of the Baptist church. Where he'd grown up with a literalism that said the Bible was literally true, he started to accept things like evolution, and to see much of the Bible as metaphor.\n\nNow, we talked in the last episode about how impossible it is to get an accurate picture of the lives of religious leaders, because their life stories are told by those who admire them, and that's very much the case for C.L. Franklin. Franklin was a man who had many, many, admirable qualities -- he was fiercely intelligent, well-read, a superb public speaker, a man who was by all accounts genuinely compassionate towards those in need, and he became one of the leaders of the civil rights movement and inspired tens of thousands, maybe even millions, of people, directly and indirectly, to change the world for the better. He also raised several children who loved and admired him and were protective of his memory.\n\nAnd as such, there is an inevitable bias in the sources on Franklin's life. And so there's a tendency to soften the very worst things he did, some of which were very, very bad.\n\nFor example in Nick Salvatore's biography of him, he talks about Franklin, in 1940, fathering a daughter with someone who is described as \"a teenager\" and \"quite young\". No details of her age other than that are given, and a few paragraphs later the age of a girl who was then sixteen *is* given, talking about having known the girl in question, and so the impression is given that the girl he impregnated was also probably in her late teens. Which would still be bad, but a man in his early twenties fathering a child with a girl in her late teens is something that can perhaps be forgiven as being a different time.\n\nBut while the girl in question may have been a teenager when she gave birth, she was *twelve years old* when she became pregnant, by C.L. Franklin, the pastor of her church, who was in a position of power over her in multiple ways. Twelve years old.\n\nAnd this is not the only awful thing that Franklin did -- he was also known to regularly beat up women he was having affairs with, in public. I mention this now because everything else I say about him in this episode is filtered through sources who saw these things as forgivable character flaws in an otherwise admirable human being, and I can't correct for those biases because I don't know the truth. So it's going to sound like he was a truly great man. But bear those facts in mind.\n\nBarbara stayed with Franklin for the present, after discovering what he had done, but their marriage was a difficult one, and they split up and reconciled a handful of times. They had three more children together -- Cecil, Aretha, and Carolyn -- and remained together as Franklin moved on first to a church in Buffalo, New York, and then to New Bethel Church, in Detroit, on Hastings Street, a street which was the centre of Black nightlife in the city, as immortalised in John Lee Hooker's \"Boogie Chillun\":\n\n[Excerpt: John Lee Hooker, \"Boogie Chillen\"]\n\nBefore moving to Detroit, Franklin had already started to get more political, as his congregation in Buffalo had largely been union members, and being free from the worst excesses of segregation allowed him to talk more openly about civil rights, but that only accelerated when he moved to Detroit, which had been torn apart just a couple of years earlier by police violence against Black protestors.\n\nFranklin had started building a reputation when in Memphis using radio broadcasts, and by the time he moved to Detroit he was able to command a very high salary, and not only that, his family were given a mansion by the church, in a rich part of town far away from most of his congregation. Smokey Robinson, who was Cecil Franklin's best friend and a frequent visitor to the mansion through most of his childhood, described it later, saying \"Once inside, I'm awestruck -- oil paintings, velvet tapestries, silk curtains, mahogany cabinets filled with ornate objects of silver and gold. Man, I've never seen nothing like that before!\"\n\nHe made a lot of money, but he also increased church attendance so much that he earned that money. He had already been broadcasting on the radio, but when he started his Sunday night broadcasts in Detroit, he came up with a trick of having his sermons run long, so the show would end before the climax. People listening decided that they would have to start turning up in person to hear the end of the sermons, and soon he became so popular that the church would be so full that crowds would have to form on the street outside to listen. Other churches rescheduled their services so they wouldn't clash with Franklin's, and most of the other Black Baptist ministers in the city would go along to watch him preach.\n\nIn 1948 though, a couple of years after moving to Detroit, Barbara finally left her husband. She took Vaughn with her and moved back to Buffalo, leaving the four biological children she'd had with C.L. with their father.  But it's important to note that she didn't leave her children -- they would visit her on a regular basis, and stay with her over school holidays. Aretha later said \"Despite the fact that it has been written innumerable times, it is an absolute lie that my mother abandoned us. In no way, shape, form, or fashion did our mother desert us.\"\n\nBarbara's place in the home was filled by many women -- C.L. Franklin's mother moved up from Mississippi to help him take care of the children, the ladies from the church would often help out, and even stars like Mahalia Jackson would turn up and cook meals for the children.\n\nThere were also the women with whom Franklin carried on affairs, including Anna Gordy, Ruth Brown, and Dinah Washington, the most important female jazz and blues singer of the fifties, who had major R&B hits with records like her version of \"Cold Cold Heart\":\n\n[Excerpt: Dinah Washington, \"Cold Cold Heart\"]\n\nAlthough my own favourite record of hers is \"Big Long Slidin' Thing\", which she made with arranger Quincy Jones:\n\n[Excerpt: Dinah Washington, \"Big Long Slidin' Thing\"]\n\nIt's about a trombone. Get your minds out of the gutter.\n\nWashington was one of the biggest vocal influences on young Aretha, but the single biggest influence was Clara Ward, another of C.L. Franklin's many girlfriends. Ward was the longest-lasting of these, and there seems to have been a lot of hope on both her part and Aretha's that she and Rev. Franklin would marry, though Franklin always made it very clear that monogamy wouldn't suit him.\n\nWard was one of the three major female gospel singers of the middle part of the century, and possibly even more technically impressive as a vocalist than the other two, Sister Rosetta Tharpe and Mahalia Jackson. Where Jackson was an austere performer, who refused to perform in secular contexts at all for most of her life, and took herself and her music very seriously, and Tharpe was a raunchier, funnier, more down-to-earth performer who was happy to play for blues audiences and even to play secular music on occasion, Ward was a *glamorous* performer, who wore sequined dresses and piled her hair high on her head.\n\nWard had become a singer in 1931 when her mother had what she later talked about as a religious epiphany, and decided she wasn't going to be a labourer any more, she was going to devote her life to gospel music. Ward's mother had formed a vocal group with her two daughters, and Clara quickly became the star and her mother's meal ticket -- and her mother was very possessive of that ticket, to the extent that Ward, who was a bisexual woman who mostly preferred men, had more relationships with women, because her mother wouldn't let her be alone with the men she was attracted to.\n\nBut Ward did manage to keep a relationship going with C.L. Franklin, and Aretha Franklin talked about the moment she decided to become a singer, when she saw Ward singing \"Peace in the Valley\" at a funeral:\n\n[Excerpt: Clara Ward, \"Peace in the Valley\"]\n\nAs well as looking towards Ward as a vocal influence, Aretha was also influenced by her as a person -- she became a mother figure to Aretha, who would talk later about watching Ward eat, and noting her taking little delicate bites, and getting an idea of what it meant to be ladylike from her.\n\nAfter Ward's death in 1973, a notebook was found in which she had written her opinions of other singers. For Aretha she wrote “My baby Aretha, she doesn’t know how good she is. Doubts self. Some day—to the moon. I love that girl.”\n\nWard's influence became especially important to Aretha and her siblings after their mother died of a heart attack a few years after leaving her husband, when Aretha was ten, and Aretha, already a very introverted child, became even more so. Everyone who knew Aretha said that her later diva-ish reputation came out of a deep sense of insecurity and introversion -- that she was a desperately private, closed-off, person who would rarely express her emotions at all, and who would look away from you rather than make eye contact. The only time she let herself express emotions was when she performed music.\n\nAnd music was hugely important in the Franklin household. Most preachers in the Black church at that time were a bit dismissive of gospel music, because they thought the music took away from their prestige -- they saw it as a necessary evil, and resented it taking up space when their congregations could have been listening to them. But Rev. Franklin was himself a rather good singer, and even made a few gospel records himself in 1950, recording for Joe Von Battle, who owned a record shop on Hastings Street and also put out records by blues singers:\n\n[Excerpt: C.L. Franklin, \"I Am Climbing Higher Mountains\" ]\n\nThe church's musical director was James Cleveland, one of the most important gospel artists of the fifties and sixties, who sang with groups like the Caravans:\n\n[Excerpt: The Caravans, \"What Kind of Man is This?\" ]\n\nCleveland, who had started out in the choir run by Thomas Dorsey, the writer of “Take My Hand Precious Lord” and “Peace in the Valley”, moved in with the Franklin family for a while, and he gave the girls tips on playing the piano -- much later he would play piano on Aretha's album Amazing Grace, and she said of him “He showed me some real nice chords, and I liked his deep, deep sound”. Other than Clara Ward, he was probably the single biggest musical influence on Aretha.\n\nAnd all the touring gospel musicians would make appearances at New Bethel Church, not least of them Sam Cooke, who first appeared there with the Highway QCs and would continue to do so after joining the Soul Stirrers:\n\n[Excerpt: The Soul Stirrers, \"Touch the Hem of his Garment\"]\n\nYoung Aretha and her older sister Erma both had massive crushes on Cooke, and there were rumours that he had an affair with one or both of them when they were in their teens, though both denied it. Aretha later said \"When I first saw him, all I could do was sigh... Sam was love on first hearing, love at first sight.\"\nBut it wasn't just gospel music that filled the house. One of the major ways that C.L. Franklin's liberalism showed was in his love of secular music, especially jazz and blues, which he regarded as just as important in Black cultural life as gospel music. We already talked about Dinah Washington being a regular visitor to the house, but every major Black entertainer would visit the Franklin residence when they were in Detroit. Both Aretha and Cecil Franklin vividly remembered visits from Art Tatum, who would sit at the piano and play for the family and their guests:\n\n[Excerpt: Art Tatum, \"Tiger Rag\"]\n\nTatum was such a spectacular pianist that there's now a musicological term, the tatum, named after him, for the smallest possible discernible rhythmic interval between two notes. Young Aretha was thrilled by his technique, and by that of Oscar Peterson, who also regularly came to the Franklin home, sometimes along with Ella Fitzgerald. Nat \"King\" Cole was another regular visitor.\n\nThe Franklin children all absorbed the music these people -- the most important musicians of the time -- were playing in their home, and young Aretha in particular became an astonishing singer and also an accomplished pianist. Smokey Robinson later said:\n\n“The other thing that knocked us out about Aretha was her piano playing. There was a grand piano in the Franklin living room, and we all liked to mess around. We’d pick out little melodies with one finger. But when Aretha sat down, even as a seven-year-old, she started playing chords—big chords. Later I’d recognize them as complex church chords, the kind used to accompany the preacher and the solo singer. At the time, though, all I could do was view Aretha as a wonder child. Mind you, this was Detroit, where musical talent ran strong and free. Everyone was singing and harmonizing; everyone was playing piano and guitar. Aretha came out of this world, but she also came out of another far-off magical world none of us really understood. She came from a distant musical planet where children are born with their gifts fully formed.”\n\nC.L. Franklin became more involved in the music business still when Joe Von Battle started releasing records of his sermons, which had become steadily more politically aware:\n\n[Excerpt: C.L. Franklin, \"Dry Bones in the Valley\"]\n\nFranklin was not a Marxist -- he was a liberal, but like many liberals was willing to stand with Marxists where they had shared interests, even when it was dangerous. For example in 1954, at the height of McCarthyism, he had James and Grace Lee Boggs, two Marxist revolutionaries, come to the pulpit and talk about their support for the anti-colonial revolution in Kenya, and they sold four hundred copies of their pamphlet after their talk, because he saw that the struggle of Black Africans to get out from white colonial rule was the same struggle as that of Black Americans.\n\nAnd Franklin's powerful sermons started getting broadcast on the radio in areas further out from Detroit, as Chess Records picked up the distribution for them and people started playing the records on other stations. People like future Congressman John Lewis and the Reverend Jesse Jackson would later talk about listening to C.L. Franklin's records on the radio and being inspired -- a whole generation of Black Civil Rights leaders took their cues from him, and as the 1950s and 60s went on he became closer and closer to Martin Luther King in particular.\n\nBut C.L. Franklin was always as much an ambitious showman as an activist, and he started putting together gospel tours, consisting mostly of music but with himself giving a sermon as the headline act. And he became very, very wealthy from these tours. On one trip in the south, his car broke down, and he couldn't find a mechanic willing to work on it. A group of white men started mocking him with racist terms, trying to provoke him, as he was dressed well and driving a nice car (albeit one that had broken down). Rather than arguing with them, he walked to a car dealership, and bought a new car with the cash that he had on him. By 1956 he was getting around $4000 per appearance, roughly equivalent to $43,000 today, and he was making a *lot* of appearances. He also sold half a million records that year.\n\nVarious gospel singers, including the Clara Ward Singers, would perform on the tours he organised, and one of those performers was Franklin's middle daughter Aretha. Aretha had become pregnant when she was twelve, and after giving birth to the child she dropped out of school, but her grandmother did most of the child-rearing for her, while she accompanied her father on tour.\n\nAretha's first recordings, made when she was just fourteen, show what an astonishing talent she already was at that young age. She would grow as an artist, of course, as she aged and gained experience, but those early gospel records already show an astounding maturity and ability. It's jaw-dropping to listen to these records of a fourteen-year-old, and immediately recognise them as a fully-formed Aretha Franklin.\n\n[Excerpt: Aretha Franklin, \"There is a Fountain Filled With Blood\"]\n\nSmokey Robinson's assessment that she was born with her gifts fully formed doesn't seem like an exaggeration when you hear that.\n\nFor the latter half of the fifties, Aretha toured with her father, performing on the gospel circuit and becoming known there. But the Franklin sisters were starting to get ideas about moving into secular music. This was largely because their family friend Sam Cooke had done just that, with \"You Send Me\":\n\n[Excerpt: Sam Cooke, \"You Send Me\"]\n\nAretha and Erma still worshipped Cooke, and Aretha would later talk about getting dressed up just to watch Cooke appear on the TV. Their brother Cecil later said \"I remember the night Sam came to sing at the Flame Show Bar in Detroit. Erma and Ree said they weren’t going because they were so heartbroken that Sam had recently married. I didn’t believe them. And I knew I was right when they started getting dressed about noon for the nine o’clock show. Because they were underage, they put on a ton of makeup to look older. It didn’t matter ’cause Berry Gordy’s sisters, Anna and Gwen, worked the photo concession down there, taking pictures of the party people. Anna was tight with Daddy and was sure to let my sisters in. She did, and they came home with stars in their eyes.”\n\nMoving from gospel to secular music still had a stigma against it in the gospel world, but Rev. Franklin had never seen secular music as sinful, and he encouraged his daughters in their ambitions. Erma was the first to go secular, forming a girl group, the Cleo-Patrettes, at the suggestion of the Four Tops, who were family friends, and recording a single for Joe Von Battle's J-V-B label, \"No Other Love\":\n\n[Excerpt: The Cleo-Patrettes, \"No Other Love\"]\n\nBut the group didn't go any further, as Rev. Franklin insisted that his eldest daughter had to finish school and go to university before she could become a professional singer. Erma missed other opportunities for different reasons, though -- Berry Gordy, at this time still a jobbing songwriter, offered her a song he'd written with his sister and Roquel Davis, but Erma thought of herself as a jazz singer and didn't want to do R&B, and so \"All I Could Do Was Cry\" was given to Etta James instead, who had a top forty pop hit with it:\n\n[Excerpt: Etta James, \"All I Could Do Was Cry\"]\n\nWhile Erma's move into secular music was slowed by her father wanting her to have an education, there was no such pressure on Aretha, as she had already dropped out. But Aretha had a different problem -- she was very insecure, and said that church audiences \"weren't critics, but worshippers\", but she was worried that nightclub audiences in particular were just the kind of people who would just be looking for flaws, rather than wanting to support the performer as church audiences did.\n\nBut eventually she got up the nerve to make the move. There was the possibility of her getting signed to Motown -- her brother was still best friends with Smokey Robinson, while the Gordy family were close to her father -- but Rev. Franklin had his eye on bigger things. He wanted her to be signed to Columbia, which in 1960 was the most prestigious of all the major labels. As Aretha's brother Cecil later said \"He wanted Ree on Columbia, the label that recorded Mahalia Jackson, Duke Ellington, Johnny Mathis, Tony Bennett, Percy Faith, and Doris Day. Daddy said that Columbia was the biggest and best record company in the world. Leonard Bernstein recorded for Columbia.\"\n\nThey went out to New York to see Phil Moore, a legendary vocal coach and arranger who had helped make Lena Horne and Dorothy Dandridge into stars, but Moore actually refused to take her on as a client, saying \"She does not require my services. Her style has already been developed. Her style is in place. It is a unique style that, in my professional opinion, requires no alteration. It simply requires the right material. Her stage presentation is not of immediate concern. All that will come later. The immediate concern is the material that will suit her best. And the reason that concern will not be easily addressed is because I can’t imagine any material that will not suit her.\"\n\nThat last would become a problem for the next few years, but the immediate issue was to get someone at Columbia to listen to her, and Moore could help with that -- he was friends with John Hammond.\n\nHammond is a name that's come up several times in the podcast already -- we mentioned him in the very earliest episodes, and also in episode ninety-eight, where we looked at his signing of Bob Dylan. But Hammond was a legend in the music business. He had produced sessions for Bessie Smith, had discovered Count Basie and Billie Holiday, had convinced Benny Goodman to hire Charlie Christian and Lionel Hampton, had signed Pete Seeger and the Weavers to Columbia, had organised the Spirituals to Swing concerts which we talked about in the first few episodes of this podcast, and was about to put out the first album of Robert Johnson's recordings. Of all the executives at Columbia, he was the one who had the greatest eye for talent, and the greatest understanding of Black musical culture.\n\nMoore suggested that the Franklins get Major Holley to produce a demo recording that he could get Hammond to listen to. Major Holley was a family friend, and a jazz bassist who had played with Oscar Peterson and Coleman Hawkins among others, and he put together a set of songs for Aretha that would emphasise the jazz side of her abilities, pitching her as a Dinah Washington style bluesy jazz singer. The highlight of the demo was a version of \"Today I Sing the Blues\", a song that had originally been recorded by Helen Humes, the singer who we last heard of recording “Be Baba Leba” with Bill Doggett:\n\n[Excerpt: Helen Humes, \"Today I Sing the Blues\"]\n\nThat original version had been produced by Hammond, but the song had also recently been covered by Aretha's idol, Sam Cooke:\n\n[Excerpt: Sam Cooke, \"Today I Sing the Blues\"]\n\nHammond was hugely impressed by the demo, and signed Aretha straight away, and got to work producing her first album. But he and Rev. Franklin had different ideas about what Aretha should do. Hammond wanted to make a fairly raw-sounding bluesy jazz album, the kind of recording he had produced with Bessie Smith or Billie Holiday, but Rev. Franklin wanted his daughter to make music that would cross over to the white pop market -- he was aiming for the same kind of audience that Nat \"King\" Cole or Harry Belafonte had, and he wanted her recording standards like \"Over the Rainbow\".\n\nThis showed a lack of understanding on Rev. Franklin's part of how such crossovers actually worked at this point. As Etta James later said, \"If you wanna have Black hits, you gotta understand the Black streets, you gotta work those streets and work those DJs to get airplay on Black stations... Or looking at it another way, in those days you had to get the Black audience to love the hell outta you and then hope the love would cross over to the white side. Columbia didn’t know nothing ’bout crossing over.”\n\nBut Hammond knew they had to make a record quickly, because Sam Cooke had been working on RCA Records, trying to get them to sign Aretha, and Rev. Franklin wanted an album out so they could start booking club dates for her, and was saying that if they didn't get one done quickly he'd take up that offer, and so they came up with a compromise set of songs which satisfied nobody, but did produce two R&B top ten hits, \"Won't Be Long\" and Aretha's version of \"Today I Sing the Blues\":\n\n[Excerpt: Aretha Franklin, \"Today I Sing the Blues\"]\n\nThis is not to say that Aretha herself saw this as a compromise -- she later said \"I have never compromised my material. Even then, I knew a good song from a bad one. And if Hammond, one of the legends of the business, didn’t know how to produce a record, who does? No, the fault was with promotion.\"\n\nAnd this is something important to bear in mind as we talk about her Columbia records. Many, *many* people have presented those records as Aretha being told what to do by producers who didn't understand her art and were making her record songs that didn't fit her style. That's not what's happening with the Columbia records. Everyone actually involved said that Aretha was very involved in the choices made -- and there are some genuinely great tracks on those albums.\n\nThe problem is that they're *unfocused*. Aretha was only eighteen when she signed to the label, and she loved all sorts of music -- blues, jazz, soul, standards, gospel, middle-of-the-road pop music -- and wanted to sing all those kinds of music. And she *could* sing all those kinds of music, and sing them well. But it meant the records weren't coherent. You didn't know what you were getting, and there was no artistic personality that dominated them, it was just what Aretha felt like recording.\n\nAround this time, Aretha started to think that maybe her father didn't know what he was talking about when it came to popular music success, even though she idolised him in most areas, and she turned to another figure, who would soon become both her husband and manager. Ted White. Her sister Erma, who was at that time touring with Lloyd Price, had introduced them, but in fact Aretha had first seen White years earlier, in her own house -- he had been Dinah Washington's boyfriend in the fifties, and her first sight of him had been carrying a drunk Washington out of the house after a party.\n\nIn interviews with David Ritz, who wrote biographies of many major soul stars including both Aretha Franklin and Etta James, James had a lot to say about White, saying “Ted White was famous even before he got with Aretha. My boyfriend at the time, Harvey Fuqua, used to talk about him. Ted was supposed to be the slickest pimp in Detroit. When I learned that Aretha married him, I wasn’t surprised. A lot of the big-time singers who we idolized as girls—like Billie Holiday and Sarah Vaughan—had pimps for boyfriends and managers. That was standard operating procedure. My own mother had made a living turning tricks. When we were getting started, that way of life was part of the music business. It was in our genes. Part of the lure of pimps was that they got us paid.\"\n\nShe compared White to Ike Turner, saying \"Ike made Tina, no doubt about it. He developed her talent. He showed her what it meant to be a performer. He got her famous. Of course, Ted White was not a performer, but he was savvy about the world. When Harvey Fuqua introduced me to him—this was the fifties, before he was with Aretha—I saw him as a super-hip extra-smooth cat. I liked him. He knew music. He knew songwriters who were writing hit songs. He had manners. Later, when I ran into him and Aretha—this was the sixties—I saw that she wasn’t as shy as she used to be.\"\n\nWhite was a pimp, but he was also someone with music business experience -- he owned an unsuccessful publishing company, and also ran a chain of jukeboxes. He was also thirty, while Aretha was only eighteen.\n\nBut White didn't like the people in Aretha's life at the time -- he didn't get on well with her father, and he also clashed with John Hammond. And Aretha was also annoyed at Hammond, because her sister Erma had signed to Epic, a Columbia subsidiary, and was releasing her own singles:\n\n[Excerpt: Erma Franklin, \"Hello Again\"]\n\nAretha was certain that Hammond had signed Erma, even though Hammond had nothing to do with Epic Records, and Erma had actually been recommended by Lloyd Price. And Aretha, while for much of her career she would support her sister, was also terrified that her sister might have a big hit before her and leave Aretha in her shadow.\n\nHammond was still the credited producer on Aretha's second album, <em>The Electrifying Aretha Franklin</em>, but his lack of say in the sessions can be shown in the choice of lead-off single. \"Rock-a-Bye Your Baby With a Dixie Melody\" was originally recorded by Al Jolson in 1918:\n\n[Excerpt: Al Jolson, \"Rock-a-Bye Your Baby With a Dixie Melody\"]\n\nRev. Franklin pushed for the song, as he was a fan of Jolson -- Jolson, oddly, had a large Black fanbase, despite his having been a blackface performer, because he had *also* been a strong advocate of Black musicians like Cab Calloway, and the level of racism in the media of the twenties through forties was so astonishingly high that even a blackface performer could seem comparatively OK.\n\nAretha's performance was good, but it was hardly the kind of thing that audiences were clamouring for in 1961:\n\n[Excerpt: Aretha Franklin, \"Rock-a-Bye Your Baby With a Dixie Melody\"]\n\nThat single came out the month after _Down Beat_ magazine gave Aretha the \"new-star female vocalist award\", and it oddly made the pop top forty, her first record to do so, and the B-side made the R&B top ten, but for the next few years both chart success and critical acclaim eluded her. None of her next nine singles would make higher than number eighty-six on the Hot One Hundred, and none would make the R&B charts at all.\n\nAfter that transitional second album, she was paired with producer Bob Mersey, who was precisely the kind of white pop producer that one would expect for someone who hoped for crossover success. Mersey was the producer for many of Columbia's biggest stars at the time -- people like Barbra Streisand, Andy Williams, Julie Andrews, Patti Page, and Mel Tormé -- and it was that kind of audience that Aretha wanted to go for at this point. To give an example of the kind of thing that Mersey was doing, just the month before he started work on his first collaboration with Aretha, _The Tender, the Moving, the Swinging Aretha Franklin_, his production of Andy Williams singing \"Moon River\" was released:\n\n[Excerpt: Andy Williams, \"Moon River\"]\n\nThis was the kind of audience Aretha was going for when it came to record sales – the person she compared herself to most frequently at this point was Barbra Streisand – though in live performances she was playing with a small jazz group in jazz venues, and going for the same kind of jazz-soul crossover audience as Dinah Washington or Ray Charles. The strategy seems to have been to get something like the success of her idol Sam Cooke, who could play to soul audiences but also play the Copacabana, but the problem was that Cooke had built an audience before doing that -- she hadn't.\nBut even though she hadn't built up an audience, musicians were starting to pay attention. Ted White, who was still in touch with Dinah Washington, later said “Women are very catty. They’ll see a girl who’s dressed very well and they’ll say, Yeah, but look at those shoes, or look at that hairdo. Aretha was the only singer I’ve ever known that Dinah had no negative comments about. She just stood with her mouth open when she heard Aretha sing.”\n\nThe great jazz vocalist Carmen McRea went to see Aretha at the Village Vanguard in New York around this time, having heard the comparisons to Dinah Washington, and met her afterwards. She later said \"Given how emotionally she sang, I expected her to have a supercharged emotional personality like Dinah. Instead, she was the shyest thing I’ve ever met. Would hardly look me in the eye. Didn’t say more than two words. I mean, this bitch gave bashful a new meaning. Anyway, I didn’t give her any advice because she didn’t ask for any, but I knew goddamn well that, no matter how good she was—and she was absolutely wonderful—she’d have to make up her mind whether she wanted to be Della Reese, Dinah Washington, or Sarah Vaughan. I also had a feeling she wouldn’t have minded being Leslie Uggams or Diahann Carroll. I remember thinking that if she didn’t figure out who she was—and quick—she was gonna get lost in the weeds of the music biz.\"\n\nSo musicians were listening to Aretha, even if everyone else wasn't. The Tender, the Moving, the Swinging Aretha Franklin, for example, was full of old standards like \"Try a Little Tenderness\":\n\n[Excerpt: Aretha Franklin, \"Try a Little Tenderness\"]\n\nThat performance inspired Otis Redding to cut his own version of that song a few years later:\n\n[Excerpt: Otis Redding, \"Try a Little Tenderness\"]\n\nAnd it might also have inspired Aretha's friend and idol Sam Cooke to include the song in his own lounge sets.\n\nThe Tender, the Moving, the Swinging Aretha Franklin also included Aretha's first original composition, but in general it wasn't a very well-received album.\n\nIn 1963, the first cracks started to develop in Aretha's relationship with Ted White. According to her siblings, part of the strain was because Aretha's increasing commitment to the civil rights movement was costing her professional opportunities. Her brother Cecil later said \"Ted White had complete sway over her when it came to what engagements to accept and what songs to sing. But if Daddy called and said, ‘Ree, I want you to sing for Dr. King,’ she’d drop everything and do just that. I don’t think Ted had objections to her support of Dr. King’s cause, and he realized it would raise her visibility. But I do remember the time that there was a conflict between a big club gig and doing a benefit for Dr. King. Ted said, ‘Take the club gig. We need the money.’ But Ree said, ‘Dr. King needs me more.’ She defied her husband. Maybe that was the start of their marital trouble. Their thing was always troubled because it was based on each of them using the other. Whatever the case, my sister proved to be a strong soldier in the civil rights fight. That made me proud of her and it kept her relationship with Daddy from collapsing entirely.\"\n\nIn part her increasing activism was because of her father's own increase in activity. The benefit that Cecil is talking about there is probably one in Chicago organised by Mahalia Jackson, where Aretha headlined on a bill that also included Jackson, Eartha Kitt, and the comedian Dick Gregory.\n\nThat was less than a month before her father organised the Detroit Walk to Freedom, a trial run for the more famous March on Washington a few weeks later. The Detroit Walk to Freedom was run by the Detroit Council for Human Rights, which was formed by Rev. Franklin and Rev. Albert Cleage, a much more radical Black nationalist who often differed with Franklin's more moderate integrationist stance. They both worked together to organise the Walk to Freedom, but Franklin's stance predominated, as several white liberal politicians, like the Mayor of Detroit, Jerome Cavanagh, were included in the largely-Black March. It drew crowds of 125,000 people, and Dr. King called it \"one of the most wonderful things that has happened in America\", and it was the largest civil rights demonstration in American history up to that point.\n\nKing's speech in Detroit was recorded and released on Motown Records:\n\n[Excerpt: Martin Luther King, \"Original 'I Have a Dream' Speech”]\n\nHe later returned to the same ideas in his more famous speech in Washington.\n\nDuring that civil rights spring and summer of 1963, Aretha also recorded what many think of as the best of her Columbia albums, a collection of jazz standards  called Laughing on the Outside, which included songs like \"Solitude\", \"Ol' Man River\" and \"I Wanna Be Around\":\n\n[Excerpt: Aretha Franklin, \"I Wanna Be Around\"]\n\nThe opening track, \"Skylark\", was Etta James' favourite ever Aretha Franklin performance, and is regarded by many as the definitive take on the song:\n\n[Excerpt: Aretha Franklin, \"Skylark\"]\n\nEtta James later talked about discussing the track with the great jazz singer Sarah Vaughan, one of Aretha's early influences, who had recorded her own version of the song: \"Sarah said, ‘Have you heard of this Aretha Franklin girl?’ I said, ‘You heard her do “Skylark,” didn’t you?’ Sarah said, ‘Yes, I did, and I’m never singing that song again.”\n\nBut while the album got noticed by other musicians, it didn't get much attention from the wider public. Mersey decided that a change in direction was needed, and they needed to get in someone with more of a jazz background to work with Aretha. He brought in pianist and arranger Bobby Scott, who had previously worked with people like Lester Young, and Scott said of their first meeting “My first memory of Aretha is that she wouldn’t look at me when I spoke. She withdrew from the encounter in a way that intrigued me. At first I thought she was just shy—and she was—but I also felt her reading me...For all her deference to my experience and her reluctance to speak up, when she did look me in the eye, she did so with a quiet intensity before saying, ‘I like all your ideas, Mr. Scott, but please remember I do want hits.’”\n\nThey started recording together, but the sides they cut wouldn't be released for a few years. Instead, Aretha and Mersey went in yet another direction. Dinah Washington died suddenly in December 1963, and given that Aretha was already being compared to Washington by almost everyone, and that Washington had been a huge influence on her, as well as having been close to both her father and her husband/manager, it made sense to go into the studio and quickly cut a tribute album, with Aretha singing Washington's hits:\n\n[Excerpt: Aretha Franklin, \"Cold Cold Heart\"]\n\nUnfortunately, while Washington had been wildly popular, and one of the most important figures in jazz and R&B in the forties and fifties, her style was out of date. The tribute album, titled Unforgettable, came out in February 1964, the same month that Beatlemania hit the US. Dinah Washington was the past, and trying to position Aretha as \"the new Dinah Washington\" would doom her to obscurity. John Hammond later said \"I remember thinking that if Aretha never does another album she will be remembered for this one. No, the problem was timing. Dinah had died, and, outside the black community, interest in her had waned dramatically. Popular music was in a radical and revolutionary moment, and that moment had nothing to do with Dinah Washington, great as she was and will always be.”\n\nAt this point, Columbia brought in Clyde Otis, an independent producer and songwriter who had worked with artists like Washington and Sarah Vaughan, and indeed had written one of the songs on Unforgettable, but had also worked with people like Brook Benton, who had a much more R&B audience. For example, he'd written \"Baby, You Got What It Takes\" for Benton and Washington to do as a duet:\n\n[Excerpt: Brook Benton and Dinah Washington, \"Baby, You Got What it Takes\"]\n\nIn 1962, when he was working at Mercury Records before going independent, Otis had produced thirty-three of the fifty-one singles the label put out that year that had charted. Columbia had decided that they were going to position Aretha firmly in the R&B market, and assigned Otis to do just that.\n\nAt first, though, Otis had no more luck with getting Aretha to sing R&B than anyone else had. He later said \"Aretha, though, couldn’t be deterred from her determination to beat Barbra Streisand at Barbra’s own game. I kept saying, ‘Ree, you can outsing Streisand any day of the week. That’s not the point. The point is to find a hit.’ But that summer she just wanted straight-up ballads. She insisted that she do ‘People,’ Streisand’s smash. Aretha sang the hell out of it, but no one’s gonna beat Barbra at her own game.\"\n\nBut after several months of this, eventually Aretha and White came round to the idea of making an R&B record. Otis produced an album of contemporary R&B, with covers of music from the more sophisticated end of the soul market, songs like \"My Guy\", \"Every Little Bit Hurts\", and \"Walk on By\", along with a few new originals brought in by Otis. The title track, \"Runnin' Out of Fools\", became her biggest hit in three years, making number fifty-seven on the pop charts and number thirty on the R&B charts:\n\n[Excerpt: Aretha Franklin, \"Runnin' Out of Fools\"]\n\nAfter that album, they recorded another album with Otis producing, a live-in-the-studio jazz album, but again nobody involved could agree on a style for her. By this time it was obvious that she was unhappy with Columbia and would be leaving the label soon, and they wanted to get as much material in the can as they could, so they could continue releasing material after she left. But her working relationship with Otis was deteriorating -- Otis and Ted White did not get on, Aretha and White were having their own problems, and Aretha had started just not showing up for some sessions, with nobody knowing where she was.\n\nColumbia passed her on to yet another producer, this time Bob Johnston, who had just had a hit with Patti Page, \"Hush, Hush, Sweet Charlotte\":\n\n[Excerpt: Patti Page, \"Hush, Hush, Sweet Charlotte\"]\n\nJohnston was just about to hit an incredible hot streak as a producer. At the same time as his sessions with Aretha, he was also producing Bob Dylan's Highway 61 Revisited, and just after the sessions finished he'd go on to produce Simon & Garfunkel's Sounds of Silence album. In the next few years he would produce a run of classic Dylan albums like Blonde on Blonde, John Wesley Harding, and New Morning, Simon & Garfunkel's follow up Parsley, Sage, Rosemary & Thyme, Leonard Cohen's first three albums, and Johnny Cash's comeback with the Live at Folsom Prison album and its follow up At San Quentin. He also produced records for Marty Robbins, Flatt & Scruggs, the Byrds, and Burl Ives during that time period.\n\nBut you may notice that while that's as great a run of records as any producer was putting out at the time, it has little to do with the kind of music that Aretha Franklin was making then, or would become famous with. Johnston produced a string-heavy session in which Aretha once again tried to sing old standards by people like Oscar Hammerstein and Jerome Kern. She then just didn't turn up for some more sessions, until one final session in August, when she recorded songs like \"Swanee\" and \"You Made Me Love You\".\nFor more than a year, she didn't go into a studio. She also missed many gigs and disappeared from her family's life for periods of time. Columbia kept putting out records of things she'd already recorded, but none of them had any success at all.\n\nMany of the records she'd made for Columbia had been genuinely great -- there's a popular perception that she was being held back by a record company that forced her to sing material she didn't like, but in fact she *loved* old standards, and jazz tunes, and contemporary pop at least as much as any other kind of music. Truly great musicians tend to have extremely eclectic tastes, and Aretha Franklin was a truly great musician if anyone was. Her Columbia albums are as good as any albums in those genres put out in that time period, and she remained proud of them for the rest of her life.\n\nBut that very eclecticism had meant that she hadn't established a strong identity as a performer -- everyone who heard her records knew she was a great singer, but nobody knew what \"an Aretha Franklin record\" really meant -- and she hadn't had a single real hit, which was the thing she wanted more than anything.\n\nAll that changed when in the early hours of the morning, Jerry Wexler was at FAME Studios in Muscle Shoals recording a Wilson Pickett track -- from the timeline, it was probably the session for \"Mustang Sally\", which coincidentally was published by Ted White's publishing company, as Sir Mack Rice, the writer, was a neighbour of White and Franklin, and to which Aretha had made an uncredited songwriting contribution:\n\n[Excerpt: Wilson Pickett, \"Mustang Sally\"]\n\nWhatever the session, it wasn't going well. Percy Sledge, another Atlantic artist who recorded at Muscle Shoals, had turned up and had started winding Pickett up, telling him he sounded just like James Brown. Pickett *hated* Brown -- it seems like almost every male soul singer of the sixties hated James Brown -- and went to physically attack Sledge. Wexler got between the two men to protect his investments in them -- both were the kind of men who could easily cause some serious damage to anyone they hit -- and Pickett threw him to one side and charged at Sledge. At that moment the phone went, and Wexler yelled at the two of them to calm down so he could talk on the phone.\n\nThe call was telling him that Aretha Franklin was interested in recording for Atlantic.\n\nRev. Louise Bishop, later a Democratic politician in Pennsylvania, was at this time a broadcaster, presenting a radio gospel programme, and she knew Aretha. She'd been to see her perform, and had been astonished by Aretha's performance of a recent Otis Redding single, \"Respect\":\n\n[Excerpt: Otis Redding, \"Respect\"]\n\nRedding will, by the way, be getting his own episode in a few months' time, which is why I've not covered the making of that record here.\n\nBishop thought that Aretha did the song even better than Redding -- something Bishop hadn't thought possible. When she got talking to Aretha after the show, she discovered that her contract with Columbia was up, and Aretha didn't really know what she was going to do -- maybe she'd start her own label or something. She hadn't been into the studio in more than a year, but she did have some songs she'd been working on.\n\nBishop was good friends with Jerry Wexler, and she knew that he was a big fan of Aretha's, and had been saying for a while that when her contract was up he'd like to sign her. Bishop offered to make the connection, and then went back home and phoned Wexler's wife, waking her up -- it was one in the morning by this point, but Bishop was accustomed to phoning Wexler late at night when it was something important. Wexler's wife then phoned him in Muscle Shoals, and he phoned Bishop back and made the arrangements to meet up.\n\nInitially, Wexler wasn't thinking about producing Aretha himself -- this was still the period when he and the Ertegun brothers were thinking of selling Atlantic and getting out of the music business, and so while he signed her to the label he was originally going to hand her over to Jim Stewart at Stax to record, as he had with Sam and Dave.\n\nBut in a baffling turn of events, Jim Stewart didn't actually want to record her, and so Wexler determined that he had better do it himself. And he didn't want to do it with slick New York musicians -- he wanted to bring out the gospel sound in her voice, and he thought the best way to do that was with musicians from what Charles Hughes refers to as \"the country-soul triangle\" of Nashville, Memphis, and Muscle Shoals. So he booked a week's worth of sessions at FAME studios, and got in FAME's regular rhythm section, plus a couple of musicians from American Recordings in Memphis -- Chips Moman and Spooner Oldham. Oldham's friend and songwriting partner Dan Penn came along as well -- he wasn't officially part of the session, but he was a fan of Aretha's and wasn't going to miss this.\n\nPenn had been the first person that Rick Hall, the owner of FAME, had called when Wexler had booked the studio, because Hall hadn't actually heard of Aretha Franklin up to that point, but didn't want to let Wexler know that. Penn had assured him that Aretha was one of the all-time great talents, and that she just needed the right production to become massive. As Hall put it in his autobiography, \"Dan tended in those days to hate anything he didn’t write, so I figured if he felt that strongly about her, then she was probably going to be a big star.\"\n\nCharlie Chalmers, a horn player who regularly played with these musicians, was tasked with putting together a horn section.\n\nThe first song they recorded that day was one that the musicians weren't that impressed with at first. \"I Never Loved a Man (the Way I Love You)\" was written by a songwriter named Ronnie Shannon, who had driven from Georgia to Detroit hoping to sell his songs to Motown. He'd popped into a barber's shop where Ted White was having his hair cut to ask for directions to Motown, and White had signed him to his own publishing company and got him to write songs for Aretha.\n\nOn hearing the demo, the musicians thought that the song was mediocre and a bit shapeless:\n\n[Excerpt: Aretha Franklin \"I Never Loved a Man (the Way I Love You) (demo)\"]\n\nBut everyone there was agreed that Aretha herself was spectacular. She didn't speak much to the musicians, just went to the piano and sat down and started playing, and Jerry Wexler later compared her playing to Thelonius Monk (who was indeed one of the jazz musicians who had influenced her). While Spooner Oldham had been booked to play piano, it was quickly decided to switch him to electric piano and organ, leaving the acoustic piano for Aretha to play, and she would play piano on all the sessions Wexler produced for her in future.\n\nAlthough while Wexler is the credited producer (and on this initial session Rick Hall at FAME is a credited co-producer), everyone involved, including Wexler, said that the musicians were taking their cues from Aretha rather than anyone else. She would outline the arrangements at the piano, and everyone else would fit in with what she was doing, coming up with head arrangements directed by her. But Wexler played a vital role in mediating between her and the musicians and engineering staff, all of whom he knew and she didn't. As Rick Hall said \"After her brief introduction by Wexler, she said very little to me or anyone else in the studio other than Jerry or her husband for the rest of the day. I don’t think Aretha and I ever made eye contact after our introduction, simply because we were both so totally focused on our music and consumed by what we were doing.\"\n\nThe musicians started working on \"I Never Loved a Man (the Way I Love You)\", and at first found it difficult to get the groove, but then Oldham came up with an electric piano lick which everyone involved thought of as the key that unlocked the song for them:\n\n[Excerpt: Aretha Franklin, \"I Never Loved a Man (the Way I Love You)\"]\n\nAfter that, they took a break. Most of them were pleased with the track, though Rick Hall wasn't especially happy. But then Rick Hall wasn't especially happy about anything at that point. He'd always used mono for his recordings until then, but had been basically forced to install at least a two-track system by Tom Dowd, Atlantic's chief engineer, and was resentful of this imposition.\n\nDuring the break, Dan Penn went off to finish a song he and Spooner Oldham had been writing, which he hoped Aretha would record at the session:\n\n[Excerpt: Dan Penn and Spooner Oldham, \"Do Right Woman, Do Right Man\"]\n\nThey had the basic structure of the song down, but hadn't quite finished the middle eight, and both Jerry Wexler and Aretha Franklin chipped in uncredited lyrical contributions -- Aretha's line was \"as long as we're together baby, you'd better show some respect to me\".\n\nPenn, Oldham, Chips Moman, Roger Hawkins, and Tommy Cogbill started cutting a backing track for the song, with Penn singing lead initially with the idea that Aretha would overdub her vocal. But while they were doing this, things had been going wrong with the other participants.\n\nAll the FAME and American rhythm section players were white, as were Wexler, Hall, and Dowd, and Wexler had been very aware of this, and of the fact that they were recording in Alabama, where Aretha and her husband might not feel totally safe, so he'd specifically requested that the horn section at least contain some Black musicians. But Charlie Chalmers hadn't been able to get any of the Black musicians he would normally call when putting together a horn section, and had ended up with an all-white horn section as well, including one player, a trumpet player called Ken Laxton, who had a reputation as a good player but had never worked with any of the other musicians there -- he was an outsider in a group of people who regularly worked together and had a pre-existing relationship.\n\nAs the two outsiders, Laxton and Ted White had, at first, bonded, and indeed had started drinking vodka together, passing a bottle between themselves, in a way that Rick Hall would normally not allow in a session -- at the time, the county the studio was in was still a dry county. But as Wexler said, “A redneck patronizing a Black man is a dangerous camaraderie,” and White and Laxton soon had a major falling out.\nEveryone involved tells a different story about what it was that caused them to start rowing, though it seems to have been to do with Laxton not showing the proper respect for Aretha, or even actually sexually assaulting her -- Dan Penn later said “I always heard he patted her on the butt or somethin’, and what would have been wrong with that anyway?”, which says an awful lot about the attitudes of these white Southern men who thought of themselves as very progressive, and were -- for white Southern men in early 1967.\n\nEither way, White got very, very annoyed, and insisted that Laxton get fired from the session, which he was, but that still didn't satisfy White, and he stormed off to the motel, drunk and angry.\n\nThe rest of them finished cutting a basic track for \"Do Right Woman\", but nobody was very happy with it. Oldham said later “She liked the song but hadn’t had time to practice it or settle into it I remember there was Roger playing the drums and Cogbill playing the bass. And I’m on these little simplistic chords on organ, just holding chords so the song would be understood. And that was sort of where it was left. Dan had to sing the vocal, because she didn’t know the song, in the wrong key for him. That’s what they left with—Dan singing the wrong-key vocal and this little simplistic organ and a bass and a drum. We had a whole week to do everything—we had plenty of time—so there was no hurry to do anything in particular.”\nPenn was less optimistic, saying \"But as I remember, I went home that night and I was so dejected. I thought—you ain’t gonna make any money on that, kid. Because all it was, was Cogbill going bum-bum, and Spooner had his little organ holdin’ there, and me screaming at the top of my voice—it sounded pitiful.”\n\nHall thought it was pitiful as well, and he was also not at all impressed with \"I Never Loved a Man\". He thought the session was a total loss, and he went back with Wexler to the motel room where Wexler was staying -- in the same motel as White and Franklin were -- and got very drunk. And then he had one of those great ideas drunk people get -- he decided he was going to go and talk to Ted White and straighten everything out. He was going to be the great diplomat and save the day. Wexler begged him not to, but Hall knew better.\n\nHe went up and knocked on the door of the room where White and Franklin were staying, and White started complaining to him, saying he should have known better than to let his wife record with a bunch of rednecks. After a couple of minutes of White using terms like \"redneck\" and \"whitey\", Hall had had enough, and said that if White called him a redneck once more, he would call White the n word -- except that Hall used the actual word in question. The two started exchanging blows, and according to various of the more lurid accounts either tried to push each other off a fifth-floor balcony or even exchanged gunshots.\n\nMost accounts of these altercations tend to blame White, Laxton, and Hall about equally, and that's largely because White had a generally unpleasant reputation and was not easy to get along with. In this particular instance, though, given that he'd first seen his wife sexually assaulted and then been woken up by a drunk man who used racial slurs at him, I don't think he deserves much of the blame.\n\nHall then had a screaming row with Jerry Wexler, still on the fifth-floor balcony, then went down to the hotel lobby and used a payphone to call White's room and scream more abuse at him, threatening him that he had better get out of town if he knew what was good for him. Meanwhile, Aretha and Ted also had a row, which ended with her leaving the motel in the middle of the night and phoning Wexler in tears from a diner saying they had split up -- though awkwardly for both of them, they met in the airport the next day as they both decided to get out of town.\n\nAretha and Ted did eventually reconcile, though their marriage didn't last that much longer, but Wexler and Hall would never work together again. And Aretha did another of her disappearing acts for a couple of weeks, with nobody able to find her. Wexler had a single usable track from the session -- \"I Never Loved a Man\" -- and when he gave a couple of DJs acetate copies of that he found it became a turntable hit, but he couldn't find his singer to record a B-side.\n\nEventually, Aretha turned up, and Wexler got her into the studio to finish \"Do Right Woman\". To the backing track cut at FAME, Aretha added lead vocals and piano, and backing vocals by her sisters Erma and Carolyn and their friend Cissy Houston -- the aunt of Dionne Warwick and mother of Whitney Houston.\nThere was a slight problem which Moman would later point out, saying “The only thing I found wrong and I still find wrong: Obviously, Rick Hall’s machine and the machine in New York were traveling at a slightly different speed. The piano is out of tune on that record, and it bothered me immensely. The piano is sharp to the track. If you listen to the piano, you hear it—it’s almost a quarter-tone sharp to the track.”\n\nBut that didn't stop the B-side becoming a top forty R&B hit and one of the all-time country-soul classics:\n\n[Excerpt: Aretha Franklin, \"Do Right Woman, Do Right Man\"]\n\nThe A-side, meanwhile, made the top ten on the pop charts and number one on the R&B charts. But Wexler had a problem. He wanted a full album to go with the single, and he wanted the same musicians playing on it -- with the exception, of course, of Ken Laxton. But many of those musicians were employed more-or-less full-time by Rick Hall. He knew that if Hall knew they were going to be working on an Aretha Franklin album without him, Hall would realise that he'd been cut off by Wexler and not let them go.\n\nSo instead, he invited them all up to New York to record an album by the great R&B saxophone player King Curtis, <em>King Curtis Plays Great Memphis Hits</em> -- a quick set of instrumental cover versions of records several of them had played on at Stax or American for Atlantic, so it wouldn't arouse suspicion:\n\n[Excerpt: King Curtis, \"Green Onions\"]\n\nAnd then, once they were there in the studio, he casually suggested to them that, you know, while you're here, you might want to do some more tracks with Aretha as well. This time there would be a more relaxed atmosphere, and a more integrated group of people in the studio -- as well as the white musicians, Aretha's sisters and Cissy Houston were there, and King Curtis stayed around to add saxophone.\n\nHall found out what was happening after about three days, and called the musicians back, but in that time they managed to cut most of what became a classic album -- and Wexler would a couple of years later help some of the FAME musicians start their own Muscle Shoals studio in competition with Hall's, giving them some of the start-up capital they needed.\n\nThe highlight of the album, and second single, was \"Respect\", the song that had so impressed Bishop when she'd heard Aretha perform it live:\n\n[Excerpt: Aretha Franklin, \"Respect\"]\n\nAretha had been working on the song for a year at this point, honing it live, and had come up with several changes to the arrangement. For a start, there were the backing vocals, where her sisters sang \"re, re, re, re, respect\" -- \"Re\" was her family's nickname for Aretha, and several people have pointed out that this effectively makes Aretha herself the embodiment of the concept of respect.\n\nBut even in the studio they would still make changes. One was to introduce a key change for Curtis' saxophone solo, and create a bridge to do that in. According to Wexler, they took the bridge from \"When Something is Wrong With My Baby\" by Sam and Dave:\n\n[Excerpt: Sam and Dave, \"When Something is Wrong With My Baby\"]\n\nAnd turned that into the solo:\n\n[Excerpt: Aretha Franklin, \"Respect\"]\n\nArif Mardin, who was assisting Wexler at the session, said later “We thought, How could we lift this song up? ‘Respect’ is in C. But that bridge, Curtis’s saxophone solo is in F sharp—a totally unrelated key, but we liked it! We liked those chords! So we put it in. And then, from the F sharp, ‘Respect’ starts with a G chord—the five of the G [I think he means the five of the C here]. So from the F sharp we went to the G—it sounded like a half-tone modulation, but it wasn’t. It was a very interesting solo construction and we did it right there. There was nothing haphazard on Aretha’s part. But the way we came up with that strange key change, which led back naturally—it was done there on the spot.\"\n\nNow, everyone involved with that session talks about that change as something \"We\" did, without specifying whose idea it was, but I have a strong suspicion it was Aretha's, and I think I know what inspired her. Because that quote of Mardin's reminded me of something Paul Simon said in an interview about the change to the bridge in his much later song \"Still Crazy After All These Years\":\n\n[Excerpt: Simon and Garfunkel \"Still Crazy After All These Years (live in Central Park)\"]\n\nIn an interview from the eighties, Simon was asked about that key change, and replied:\n\n\"Yeah, I used to do that. It was something I noticed in Antonio Jobim's music. In fact I once mentioned that to him and he said that he wasn't aware of it at all. It was kind of an exercise that I did, which was to try and get every note from a twelve-tone scale into the song. So what would happen is that I would cover most of the notes in the song and there would be maybe three notes that you couldn't get into the scale of the key of the song. And those three notes were really the key to the bridge. Usually it would be a tritone away from whatever key you were using. If you were in the key of C, the farthest away you can go is F sharp. That's the key that's the least related to C.\"\n\nNow, I would just think this was an interesting coincidence, except that a few days after reading that Mardin quote, while researching this episode, I found a quote by Luther Vandross talking about another song on the I Never Loved a Man album -- \"When I produced Aretha in the eighties, the first thing I told her was how much I loved ‘Don’t Let Me Lose This Dream.’ It had this bossa nova–ish silky groove that was pure heaven. I asked her where the song came from. She said she’d been listening to Astrud Gilberto, the girl who sang with Stan Getz, and she wanted to write something with the feeling of Latin soul.\"\n\nNow, Gilberto became famous for recording the songs of Jobim -- the very same person that Paul Simon cited as doing this same kind of key change that we have in \"Respect\". So while she never spoke about it, I would put money on it having been Aretha who came up with that key change, and on it having been inspired by Jobim.\n\nOther changes were made to tie the song into Aretha's other songs. She'd already added the line about \"respect\" to \"Do Right Woman\", but on the tag she sang \"You're running out of fools, and I ain't lyin'\", referencing her last hit on Columbia of any size. And in \"Dr. Feelgood\", one of the songs she'd written herself for the album, she sang “taking care of business is really this man’s game”, and so in the most famous addition to the song, she sang \"take care of T.C.B.\" -- T.C.B. being a slang abbreviation for \"take care of business\":\n\n[Excerpt: Aretha Franklin, \"Respect\"]\n\nAnother bit of slang was that backing vocal phrase, \"sock it to me\", which Aretha's sister Carolyn had heard someone say and had decided would make a good background line. \"Respect\" popularised the phrase, and it soon became a national catchphrase, becoming a running gag on the comedy show Rowan & Martin's Laugh-In, to the extent that even Richard Nixon joined in with it in a desperate attempt to seem down with the kids prior to his election as President:\n\n[Excerpt: Rowan and Martin's Laugh-In]\n\nSeveral people have – rather fancifully, in my opinion – credited that appearance with Nixon winning the election two months later, and it wouldn't have happened without “Respect”.\n\nWhen he heard Aretha's version of \"Respect\", Otis Redding jokingly asked Jerry Wexler to burn the tape, before saying \"It's her song now\". But in becoming Aretha's song, it became *everyone's* song. It went to number one on the pop charts, and this song, which had originally been a rather macho piece, a man demanding respect from his wife, became an anthem of both Black civil rights and the burgeoning feminist movement. This song, recorded in the aftermath of racial violence and drunken machismo, became a rallying cry for Black people wanting civil rights, for women wanting to be treated as human beings, and for queer people wanting to be free from oppression -- and while I haven't talked much about queerness compared to those other aspects here, it is important to note for context that the two biggest musical influences on Aretha's life, Clara Ward and James Cleveland, were both queer (Cleveland was gay and Ward was bi) and that Carolyn Franklin, who helped Aretha arrange the song, was lesbian. Aretha's music was profoundly shaped by those queer influences, just as it was shaped by her being a Black woman.\n\n1967 was the start of Aretha's reign as the \"Queen of Soul\", a title she took on at a ceremony towards the end of the year, but it was also the start of a dramatic turn in Black politics as it related to culture. The day before \"Respect\" hit the charts, Mohammed Ali had his heavyweight title taken from him after refusing to be drafted into the Vietnam War, saying \"No Viet Cong ever called me\" and then using that same slur that Rick Hall used to Ted White. Marginalised people of all kinds were starting to demand the respect they were owed, and which was long overdue, and to do so without the ambiguity and euphemisms they had previously used to make themselves acceptable in the eyes of respectable moderates. And we will see how that plays out in soul and R&B as we look at the rest of the sixties and early seventies.",
  "enclosure": "",
  "itunes:summary": "Episode 149 of A History of Rock Music in Five Hundred Songs looks at “Respect\", and the journey of Aretha Franklin from teenage gospel singer to the Queen of Soul. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, on \"I'm Just a Mops\" by the Mops.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nAlso, people may be interested in a Facebook discussion group for the podcast, run by a friend of mine (I'm not on FB myself) which can be found at https://www.facebook.com/groups/293630102611672/\n\n\n\nErrata\n\nI say \"Rock-a-Bye Your Baby to a Dixie Melody\" instead of \"Rock-a-Bye Your Baby With a Dixie Melody\". Also I say Spooner Oldham co-wrote \"Do Right Woman\". I meant Chips Moman.\nResources\n\n\nNo Mixcloud this week, as there are too many songs by Aretha Franklin.\n\nMy main biographical source for Aretha Franklin is Respect: The Life of Aretha Franklin by David Ritz, and this is where most of the quotes from musicians come from.\n\nI also relied heavily on I Never Loved a Man the Way I Loved You by Matt Dobkin.\n\nInformation on C.L. Franklin came from Singing in a Strange Land: C. L. Franklin, the Black Church, and the Transformation of America by Nick Salvatore.\n\nRick Hall's The Man From Muscle Shoals: My Journey from Shame to Fame contains his side of the story.\n\nCountry Soul by Charles L Hughes is a great overview of the soul music made in Muscle Shoals, Memphis, and Nashville in the sixties. Peter Guralnick's Sweet Soul Music: Rhythm And Blues And The Southern Dream Of Freedom is possibly less essential, but still definitely worth reading.\n\nAnd the I Never Loved a Man album is available in this five-album box set for a ludicrously cheap price. But it's actually worth getting this nineteen-CD set with her first sixteen Atlantic albums and a couple of bonus discs of demos and outtakes. There's barely a duff track in the whole nineteen discs.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\nBefore I start this episode,  I have to say that there are some things people may want to be aware of before listening to this. This episode has to deal, at least in passing, with subjects including child sexual abuse, intimate partner abuse, racism, and misogyny. I will of course try to deal with those subjects as tactfully as possible, but those of you who may be upset by those topics may want to check the episode transcript before or instead of listening.\n\nThose of you who leave comments or send me messages saying \"why can't you just talk about the music instead of all this woke virtue-signalling?\" may also want to skip this episode. You can go ahead and skip all the future ones as well, I won't mind.\n\nAnd one more thing to say before I get into the meat of the episode -- this episode puts me in a more difficult position than most other episodes of the podcast have. When I've talked about awful things that have happened in the course of this podcast previously, I have either been talking about perpetrators -- people like Phil Spector or Jerry Lee Lewis who did truly reprehensible things -- or about victims who have talked very publicly about the abuse they've suffered, people like Ronnie Spector or Tina Turner, who said very clearly \"this is what happened to me and I want it on the public record\".\n\nIn the case of Aretha Franklin, she has been portrayed as a victim *by others*, and there are things that have been said about her life and her relationships which suggest that she suffered in some very terrible ways. But she herself apparently never saw herself as a victim, and didn't want some aspects of her private life talking about. At the start of David Ritz's biography of her, which is one of my",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode 149 of A History of Rock Music in Five Hundred Songs looks at “Respect\", and the journey of Aretha Franklin from teenage gospel singer to the Queen of Soul. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, on \"I'm Just a Mops\" by the Mops.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nAlso, people may be interested in a Facebook discussion group for the podcast, run by a friend of mine (I'm not on FB myself) which can be found at https://www.facebook.com/groups/293630102611672/\n\n\n\nErrata\n\nI say \"Rock-a-Bye Your Baby to a Dixie Melody\" instead of \"Rock-a-Bye Your Baby With a Dixie Melody\". Also I say Spooner Oldham co-wrote \"Do Right Woman\". I meant Chips Moman.\nResources\n\n\nNo Mixcloud ",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}