{
  "title": "Rent Control and the Housing Debate with Ash Navabi",
  "pubDate": "Sat, 22 Dec 2018 17:03:15 +0000",
  "guid": "e8c0fc434b8b48f39f3cf31b528a563d",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP111Navabi_EDR.mp3",
  "itunes:image": "",
  "description": "<p>Today on the podcast, Ash Navabi returns to discuss his recent work on housing and rent control. Ash published an opinion piece entitled <a href= \"https://www.cbc.ca/news/opinion/rent-control-opinion-1.4934398\" target=\"_blank\" rel=\"noopener\">\"Why low-income earners should actually welcome Ontario's reversal on rent control.\"</a> In that article, Ash pushes back on the kneejerk reaction to the Ontario government's reversal of its rent control policy on new units:</p> <blockquote>There's no question that there are problems with affordability and livability in certain areas of Ontario, but implementing rigid rent control measures is not the way to fix them.<br /> <br /> Economists agree: rent control reduces both the quantity and quality of housing available. In a 1988 survey of 443 Canadian economists, fully 95 per cent agreed (in full or with some provisos) with that statement. A more recent survey of 40 economists (including several Nobel laureates) yielded a similar result: only one respondent believed that rent control increased quantity and quality of the housing supply.<br /> <br /> The reason there is near unanimity on this question is simple: there is ample theory and data in support of the answer. The theory is simple enough. A maximum price policy (which is what rent control is) has two contradictory effects — namely, it increases the quantity demanded for the good, while also decreasing the quantity supplied. In other words, it creates a shortage.</blockquote> <p>We discuss the policy change that prompted the article, and the backlash the article itself generated, as well as many things related to housing policy.</p>",
  "content:encoded": "<p>Today on the podcast, Ash Navabi returns to discuss his recent work on housing and rent control. Ash published an opinion piece entitled <a href= \"https://www.cbc.ca/news/opinion/rent-control-opinion-1.4934398\" target=\"_blank\" rel=\"noopener\">\"Why low-income earners should actually welcome Ontario's reversal on rent control.\"</a> In that article, Ash pushes back on the kneejerk reaction to the Ontario government's reversal of its rent control policy on new units:</p> There's no question that there are problems with affordability and livability in certain areas of Ontario, but implementing rigid rent control measures is not the way to fix them.  Economists agree: rent control reduces both the quantity and quality of housing available. In a 1988 survey of 443 Canadian economists, fully 95 per cent agreed (in full or with some provisos) with that statement. A more recent survey of 40 economists (including several Nobel laureates) yielded a similar result: only one respondent believed that rent control increased quantity and quality of the housing supply.  The reason there is near unanimity on this question is simple: there is ample theory and data in support of the answer. The theory is simple enough. A maximum price policy (which is what rent control is) has two contradictory effects — namely, it increases the quantity demanded for the good, while also decreasing the quantity supplied. In other words, it creates a shortage. <p>We discuss the policy change that prompted the article, and the backlash the article itself generated, as well as many things related to housing policy.</p>",
  "enclosure": "",
  "itunes:duration": "01:11:03",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today on the podcast, Ash Navabi returns to discuss his recent work on housing and rent control. Ash published an opinion piece entitled  In that article, Ash pushes back on the kneejerk reaction to the Ontario government's reversal of its rent...",
  "itunes:episode": 111,
  "itunes:episodeType": "full"
}