{
  "title": "S15 Ep5: Spiritual Science with Aage Nost",
  "link": "https://audioboom.com/posts/8098518",
  "itunes:episode": 5,
  "itunes:title": "Spiritual Science with Aage Nost",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4895,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS begins the experiment with Spiritual Science with guest Aage Nost!<br>\n<br>\nCan we turn back the aging process? Can we travel in time? How close are we to a Universal Global Consciousness? We discuss this and What and Who has been on the Mars and our own Moon.<br>\n<br>\nVisit his site here: <a href=\"http://www.aage-nost.com/\">http://www.aage-nost.com/</a><br>\n<br>\nGet his book here: <a href=\"https://amazon.com\">https://amazon.com</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nAre you playing along with Beyond the Darkness on the Podcast One/ <a href=\"http://Betonline.AG\">Betonline.AG</a> Sportsnet Challenge?!  Each Week Dave and Tim are picking the winners of five NFL gam,es and playing against the hosts of different Podcast One shows!  If you play aloing with Dave and Tim on <a href=\"http://BetOnline.AG\">BetOnline.AG</a>, and they win the week, you qualify to be one of five winners splitting a $500 weekly prize! To sign up go to <a href=\"https://promotions.betonline.ag/podcastone\">https://promotions.betonline.ag/podcastone</a><br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !<br>\n<br>\nLooking to cut out stressful meal planning and prepping?  Tired of stressful trips to the grocery store? Looking for fresh ingredients and inventive gourmet recipes that are easy and quick to make?  Hello Fresh is the solution you are looking for and right now if you Go to <a href=\"http://HelloFresh.com/10beyond\">HelloFresh.com/10beyond</a> and use code 10beyond during HelloFresh’s New Year’s sale, you get 10 free meals including free shipping!",
  "itunes:summary": "BEYOND the DARKNESS begins the experiment with Spiritual Science with guest Aage Nost!\n\nCan we turn back the aging process? Can we travel in time? How close are we to a Universal Global Consciousness? We discuss this and What and Who has...",
  "pubDate": "Sun, 12 Jan 2020 10:00:00 +0000",
  "guid": "ea3d84ba-7dc5-4c78-8c2a-83481d2ab3ff",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}