{
  "title": "Trial by Firing Line",
  "description": "You didn’t have to agree with William F. Buckley to marvel at his intellect, his swiftness, and his wit. Starting in 1966, Buckley got to show off his skills every week on Firing Line, his pioneering television show devoted to debate. Heather Hendershot watched nearly 1,500 episodes of the show, and though she still doesn’t agree with Buckley, she admires how he created a place for high-minded argument. Hendershot is the author of Open to Debate: How William F. Buckley Put Liberal America on the Firing Line. For the Spiel, is the circus shutting down or will confirmation hearings be going for a bit longer?\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "pubDate": "Thu, 19 Jan 2017 00:09:03 -0000",
  "itunes:episodeType": "full",
  "itunes:author": "Peach Fish Productions",
  "itunes:subtitle": "How conservative champion William F. Buckley argued with his friends, how he argued with his foes, and why he thought there should be no argument about Donald Trump.",
  "itunes:summary": "You didn’t have to agree with William F. Buckley to marvel at his intellect, his swiftness, and his wit. Starting in 1966, Buckley got to show off his skills every week on Firing Line, his pioneering television show devoted to debate. Heather Hendershot watched nearly 1,500 episodes of the show, and though she still doesn’t agree with Buckley, she admires how he created a place for high-minded argument. Hendershot is the author of Open to Debate: How William F. Buckley Put Liberal America on the Firing Line. For the Spiel, is the circus shutting down or will confirmation hearings be going for a bit longer?\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "content:encoded": "<p>You didn’t have to agree with William F. Buckley to marvel at his intellect, his swiftness, and his wit. Starting in 1966, Buckley got to show off his skills every week on <em>Firing Line,</em> his pioneering television show devoted to debate. <a href=\"http://cmsw.mit.edu/profile/heather-hendershot/\">Heather Hendershot</a> watched nearly 1,500 episodes of the show, and though she still doesn’t agree with Buckley, she admires how he created a place for high-minded argument. Hendershot is the author of <a href=\"http://www.amazon.com/dp/0062430459/?tag=slatmaga-20\"><em>Open to Debate: How William F. Buckley Put Liberal America on the Firing Line</em></a>. For the Spiel, is the circus shutting down or will confirmation hearings be going for a bit longer?</p><p> </p><p>Learn more about your ad choices. Visit <a href=\"https://megaphone.fm/adchoices\">megaphone.fm/adchoices</a></p>",
  "itunes:duration": 1774,
  "itunes:explicit": "no",
  "guid": "9a2399fc-4d17-11e6-aabd-97ea1aa34fbb",
  "enclosure": ""
}