{
  "title": "Episode 262 - Sean Murray & Doug Beal Interview",
  "itunes:episode": 262,
  "itunes:title": "Episode 262 - Sean Murray & Doug Beal Interview",
  "itunes:episodeType": "full",
  "guid": "1b3fbf87-485d-4dcf-96f2-f7e996607c0e",
  "link": "https://share.transistor.fm/s/42ca7cd5",
  "description": "<p>We are pumped and excited to be visiting the sport of volleyball for the first time today on the show as we chat with Sean Murray, the author of a brand new book <em>If Gold Is Our Destiny, </em>which details the amazing story behind the US men's volleyball team and their groundbreaking gold medal win at the 1984 Olympics, as well as the coach of that team from 1984, the legendary Doug Beal. In this chat we learn just why this story was chosen by Sean to write a book about and why it should be more well known out there amongst sports fans. We also learn from Doug some of the innovative ideas he had during the lead up to the 1984 Olympics and why some of them wouldn't work today. We also find out which Hollywood superstar helped them on their journey to gold as well as just why they might be involved in the next Los Angeles Olympics in 2028. It's a great chat that you simply can't miss!</p>",
  "content:encoded": "<p>We are pumped and excited to be visiting the sport of volleyball for the first time today on the show as we chat with Sean Murray, the author of a brand new book <em>If Gold Is Our Destiny, </em>which details the amazing story behind the US men's volleyball team and their groundbreaking gold medal win at the 1984 Olympics, as well as the coach of that team from 1984, the legendary Doug Beal. In this chat we learn just why this story was chosen by Sean to write a book about and why it should be more well known out there amongst sports fans. We also learn from Doug some of the innovative ideas he had during the lead up to the 1984 Olympics and why some of them wouldn't work today. We also find out which Hollywood superstar helped them on their journey to gold as well as just why they might be involved in the next Los Angeles Olympics in 2028. It's a great chat that you simply can't miss!</p>",
  "pubDate": "Fri, 19 Aug 2022 09:00:00 +1000",
  "author": "Ben Waterworth",
  "enclosure": "",
  "itunes:author": "Ben Waterworth",
  "itunes:image": "",
  "itunes:duration": 4317,
  "itunes:summary": "We are pumped and excited to be visiting the sport of volleyball for the first time today on the show as we chat with Sean Murray, the author of a brand new book If Gold Is Our Destiny, which details the amazing story behind the US men's volleyball team and their groundbreaking gold medal win at the 1984 Olympics, as well as the coach of that team from 1984, the legendary Doug Beal. In this chat we learn just why this story was chosen by Sean to write a book about and why it should be more well known out there amongst sports fans. We also learn from Doug some of the innovative ideas he had during the lead up to the 1984 Olympics and why some of them wouldn't work today. We also find out which Hollywood superstar helped them on their journey to gold as well as just why they might be involved in the next Los Angeles Olympics in 2028. It's a great chat that you simply can't miss!",
  "itunes:subtitle": "We are pumped and excited to be visiting the sport of volleyball for the first time today on the show as we chat with Sean Murray, the author of a brand new book If Gold Is Our Destiny, which details the amazing story behind the US men's volleyball team a",
  "itunes:keywords": "olympics, off the podium, comedy, funny, interview, colin hilding, jarrod loobeek, ben waterworth, olympic games, sport, australia, canada",
  "itunes:explicit": "No"
}