{
  "title": "No Cash On Hand",
  "description": "<p>Rummaging through your pockets in search of change and crumpled bills to pay for your morning coffee may still feel routine, but in some parts of the world, this familiar scene is just a memory. The cashless economy is already starting to take shape, and as we continue to create innovative ways to exchange money without pulling out our wallets, cash might become a thing of the past. And while some countries struggle with questions of fairness and inclusivity as governments and businesses forgo cash, others have already stepped into a cashless future where digital transactions are the only way to pay.</p><p><br></p><p>In this episode of the Ideas podcast, we travel to Sweden, a country where cash makes up just one percent of the entire economy.&nbsp;First, we hear from Charlie Warzel, a senior technology reporter at Buzzfeed News, who literally puts skin in the cashless game while on a trip to Stockholm and receives an RFID chip implant that allows him to pay for anything with his hand.&nbsp;We also follow Swedish journalist, Asa Secher, as she navigates her daily routine in a society that has already embraced a nearly-cashless economy. Next, we go to Lisa Servon, the chair of the City and Regional Planning Department at the University of Pennsylvania, to understand the potential impacts of going cashless here in the U.S.: who wins, who loses, and who gets left behind.&nbsp;And James Faucette, leader of Morgan Stanley’s Payments and US Comm Systems research efforts, explains what it takes for a country to go cashless, and how such a dramatic shift will affect more than just our bank accounts.</p><p><br></p><p><br></p><p><br></p><p><em>The host Ashley Milne-Tyte is a contractor of Pineapple Street Media.&nbsp;Certain guest speakers may be&nbsp;neither employees nor affiliated with Morgan Stanley Smith Barney LLC or its affiliates (“Morgan Stanley”). The views and opinions expressed herein by non-affiliated speakers do not necessarily reflect those of Morgan Stanley. The information and figures contained herein may have been obtained from sources outside of Morgan Stanley and Morgan Stanley makes no representations or guarantees as to the accuracy or completeness of information or data from sources outside of Morgan Stanley. Morgan Stanley is not responsible for the information or data contained in this podcast.&nbsp;The content of this podcast is solely for informational purposes and based on information available when created. This podcast does not provide individually tailored investment advice and is not a solicitation of any offer to buy or sell any security or other financial instrument or to participate in any trading strategy. It has been prepared without regard to the individual financial circumstances and objectives of persons who receive it.</em></p><p><em>© 2019 Morgan Stanley & Co. LLC and Morgan Stanley Smith Barney LLC.&nbsp;Members SIPC.</em></p>",
  "itunes:title": "No Cash On Hand",
  "itunes:episodeType": "full",
  "itunes:episode": 1,
  "itunes:summary": "Rummaging through your pockets in search of change and crumpled bills to pay for your morning coffee may still feel routine, but in some parts of the world, this familiar scene is just a memory. The cashless economy is already starting to take shape, and as we continue to create innovative ways to exchange money without pulling out our wallets, cash might become a thing of the past. And while some countries struggle with questions of fairness and inclusivity as governments and businesses forgo cash, others have already stepped into a cashless future where digital transactions are the only way to pay.\n\n\n\n\nIn this episode of the Ideas podcast, we travel to Sweden, a country where cash makes up just one percent of the entire economy. First, we hear from Charlie Warzel, a senior technology reporter at Buzzfeed News, who literally puts skin in the cashless game while on a trip to Stockholm and receives an RFID chip implant that allows him to pay for anything with his hand. We also follow Swedish journalist, Asa Secher, as she navigates her daily routine in a society that has already embraced a nearly-cashless economy. Next, we go to Lisa Servon, the chair of the City and Regional Planning Department at the University of Pennsylvania, to understand the potential impacts of going cashless here in the U.S.: who wins, who loses, and who gets left behind. And James Faucette, leader of Morgan Stanley’s Payments and US Comm Systems research efforts, explains what it takes for a country to go cashless, and how such a dramatic shift will affect more than just our bank accounts.\n\n\n\n\n\n\n\n\n\n\nThe host Ashley Milne-Tyte is a contractor of Pineapple Street Media. Certain guest speakers may be neither employees nor affiliated with Morgan Stanley Smith Barney LLC or its affiliates (“Morgan Stanley”). The views and opinions expressed herein by non-affiliated speakers do not necessarily reflect those of Morgan Stanley. The information and figures contained herein may have been obtained from sources outside of Morgan Stanley and Morgan Stanley makes no representations or guarantees as to the accuracy or completeness of information or data from sources outside of Morgan Stanley. Morgan Stanley is not responsible for the information or data contained in this podcast. The content of this podcast is solely for informational purposes and based on information available when created. This podcast does not provide individually tailored investment advice and is not a solicitation of any offer to buy or sell any security or other financial instrument or to participate in any trading strategy. It has been prepared without regard to the individual financial circumstances and objectives of persons who receive it.\n\n© 2019 Morgan Stanley &amp; Co. LLC and Morgan Stanley Smith Barney LLC. Members SIPC.",
  "content:encoded": "<p>Rummaging through your pockets in search of change and crumpled bills to pay for your morning coffee may still feel routine, but in some parts of the world, this familiar scene is just a memory. The cashless economy is already starting to take shape, and as we continue to create innovative ways to exchange money without pulling out our wallets, cash might become a thing of the past. And while some countries struggle with questions of fairness and inclusivity as governments and businesses forgo cash, others have already stepped into a cashless future where digital transactions are the only way to pay.</p><p><br></p><p>In this episode of the Ideas podcast, we travel to Sweden, a country where cash makes up just one percent of the entire economy.&nbsp;First, we hear from Charlie Warzel, a senior technology reporter at Buzzfeed News, who literally puts skin in the cashless game while on a trip to Stockholm and receives an RFID chip implant that allows him to pay for anything with his hand.&nbsp;We also follow Swedish journalist, Asa Secher, as she navigates her daily routine in a society that has already embraced a nearly-cashless economy. Next, we go to Lisa Servon, the chair of the City and Regional Planning Department at the University of Pennsylvania, to understand the potential impacts of going cashless here in the U.S.: who wins, who loses, and who gets left behind.&nbsp;And James Faucette, leader of Morgan Stanley’s Payments and US Comm Systems research efforts, explains what it takes for a country to go cashless, and how such a dramatic shift will affect more than just our bank accounts.</p><p><br></p><p><br></p><p><br></p><p><em>The host Ashley Milne-Tyte is a contractor of Pineapple Street Media.&nbsp;Certain guest speakers may be&nbsp;neither employees nor affiliated with Morgan Stanley Smith Barney LLC or its affiliates (“Morgan Stanley”). The views and opinions expressed herein by non-affiliated speakers do not necessarily reflect those of Morgan Stanley. The information and figures contained herein may have been obtained from sources outside of Morgan Stanley and Morgan Stanley makes no representations or guarantees as to the accuracy or completeness of information or data from sources outside of Morgan Stanley. Morgan Stanley is not responsible for the information or data contained in this podcast.&nbsp;The content of this podcast is solely for informational purposes and based on information available when created. This podcast does not provide individually tailored investment advice and is not a solicitation of any offer to buy or sell any security or other financial instrument or to participate in any trading strategy. It has been prepared without regard to the individual financial circumstances and objectives of persons who receive it.</em></p><p><em>© 2019 Morgan Stanley & Co. LLC and Morgan Stanley Smith Barney LLC.&nbsp;Members SIPC.</em></p>",
  "itunes:season": 4,
  "guid": "gid://art19-episode-locator/V0/i-SuHsgkNeDLQN0aP8jGXMzr5eBy28b9u_s5MNfhDE8",
  "pubDate": "Mon, 18 Mar 2019 18:03:58 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:keywords": "morganstanley,Finance,personalstories",
  "itunes:duration": "00:20:39",
  "enclosure": ""
}