{
  "title": "Episode #358:  Shame.  And Hope.",
  "link": "https://www.krpoliticaljunkie.com/episode-358-shame-and-hope/",
  "pubDate": "Sun, 17 Jan 2021 16:56:19 +0000",
  "guid": "https://www.krpoliticaljunkie.com/?p=19381",
  "description": "<p>January 2021 is the final month of Donald Trump&#039;s presidency.  It also was the month where he was, for the second time, impeached by the House ... this time for inciting an insurrection.  And we remember the 1954 attack on the House by Puerto Rican nationalists.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com/episode-358-shame-and-hope/\">Episode #358:  Shame.  And Hope.</a> appeared first on <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com\">Ken Rudin&#039;s Political Junkie</a>.</p>",
  "enclosure": "",
  "itunes:subtitle": "January 2021 is the final month of Donald Trump&#039;s presidency.  It also was the month where he was, for the second time, impeached by the House ... this time for inciting an insurrection.  And we remember the 1954 attack on the House by Puerto Rican nat...",
  "itunes:summary": "A somber look at January 2021, starting with President Trump&#8217;s attempt to get Georgia officials to rig the election in his favor, and continuing on with a Trump speech exhorting his followers to head to the Capitol, a melee that took five lives and rocked the foundation of democracy to its core, and ending with his impeachment for inciting an insurrection.  And now we wait for the inauguration of the nation&#8217;s 46th President, Joe Biden, and hoping against hope that there won&#8217;t be more mob violence.<br />\nThe last time the nation&#8217;s capitol ever endured anything close to this came in 1954, when five Puerto Rican nationalists sprayed the House floor with bullets, injuring a handful of congressmen.  Former Pennsylvania Congressman Paul Kanjorski, who back in &#8217;54 was a House page and happened to be on the floor when the shots rang out, talks about that harrowing moment.<br />\nPhoto by Reuters.<br />\nMusic in this episode<br />\n<a href=\"https://www.youtube.com/watch?v=eW9l8FNJaMg\">Problems by the Sex Pistols</a><br />\n<a href=\"https://www.youtube.com/watch?v=pokyLl-633o\">A Mistake by Fiona Apple</a><br />\n&nbsp;<br />",
  "itunes:author": "Ken Rudin",
  "itunes:image": "",
  "itunes:episode": 358,
  "itunes:title": "Shame.  And Hope.",
  "itunes:duration": "30:23"
}