{
  "title": "Micron Is First to Deliver 3D Flash Chips With More Than 200 Layers",
  "link": "https://spectrum.ieee.org/micron-is-first-to-deliver-3d-flash-chips-with-more-than-200-layers",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-gold-rectangle-resembling-a-tall-apartment-building.jpg?id=30263105&width=1200&height=800&coordinates=0%2C83%2C0%2C84\"/><br/><br/><p><sup></sup>Boise, Idaho-based memory manufacturer <a href=\"https://www.micron.com/\" target=\"_blank\">Micron Technology</a> says it has reached volume production of a 232-layer NAND flash-memory chip. It’s the first such chip to pass the 200-layer mark, and it’s been a tight race. Competitors are currently providing 176-layer technology, and some already <a href=\"https://news.samsung.com/global/editorial-extraordinary-innovation-for-a-more-unforgettable-world-the-story-behind-samsungs-pioneering-v-nand-memory-solution\" target=\"_blank\">have working chips</a> with 200+ layers <a href=\"https://news.skhynix.com/sk-hynix-develops-worlds-highest-238-layer-4d-nand-flash/\" target=\"_blank\">in hand</a>.<br/></p><p>The new Micron tech as much as doubles the density of bits stored per unit area versus competing chips, packing in 14.6 gigabits per square millimeter. Its 1-terabit chips are bundled into 2-terabyte packages, each of which is barely more than a centimeter on a side and can store about two weeks worth of 4K video.</p><p>With 81 trillion gigabytes (81 zettabytes) of data generated in 2021 and International Data Corp.  <br/>(<a href=\"https://www.idc.com/\" target=\"_blank\">IDC</a>) predicting 221 ZB in 2026, “storage has to innovate to keep up,” says Alvaro Toledo, Micron’s vice president of data-center storage.</p><p>The move to 223 layers is a combination and extension of many technologies Micron has already deployed. To get a handle on them, you need to know the basic structure and function of 3D NAND flash. The chip itself is made up of a bottom layer of CMOS logic and other circuitry that’s responsible for controlling reading and writing operations and getting data on and off the chip as quickly and efficiently as possible. Improvements to this layer, such as optimizing the path data travels and reducing the capacitance of the chip’s inputs and outputs, yielded a 50 percent improvement in the data transfer rate to 2.4 Gb/s.</p><p>Above the CMOS are layers upon layers of NAND flash cells. Unlike other devices, Flash-memory cells are built vertically. They start as a (relatively) deep, narrow hole etched through alternating layers of conductor and insulator. Then the holes are filled with material and processed to form the bit-storing part of the device. It’s the ability to reliably etch and fill the holes through all those layers that’s a key limit to the technology. Instead of etching through all 232 layers in one go, Micron’s process builds them in two parts and stacks one atop the other. Even so, “it’s an astounding engineering feat,” says Alvaro. “That was one of the biggest challenges we overcame.”</p><p>According to Toledo, there is a path toward even more layers in future NAND chips. “There are definitely challenges,” he says. But “we haven’t seen the end of that path.”</p><p>Competitors are hot on Micron's heels. <a href=\"https://news.skhynix.com/sk-hynix-develops-worlds-highest-238-layer-4d-nand-flash/\" rel=\"noopener noreferrer\" target=\"_blank\">SK Hynix says it is shipping samples of a 238-layer TLC product </a>that will be in full production in 2023. Samsung says it has working chips with <a href=\"https://news.samsung.com/global/editorial-extraordinary-innovation-for-a-more-unforgettable-world-the-story-behind-samsungs-pioneering-v-nand-memory-solution\" rel=\"noopener noreferrer\" target=\"_blank\">more than 200-layers</a>, but it hasn't detailed when these will go into full production.</p><p>In addition to adding more and more layers, NAND flash makers have been increasing the density of stored bits by packing multiple bits into a single device. Each of the Micron chip’s memory cells is capable of storing three bits per cell. That is, the charge stored in each cell produces a distinct enough effect to discern eight different states. Though 3-bit-per-cell products (called TLC) are the majority, <a href=\"https://www.micron.com/products/nand-flash/qlc-nand\" rel=\"noopener noreferrer\" target=\"_blank\">four-bit products</a> (called QLC) are also available. One QLC chip presented by Western Digital researchers at the <a href=\"https://www.isscc.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE International Solid State Circuits Conference</a> earlier this year achieved a <a href=\"https://ieeexplore.ieee.org/document/9731110\" rel=\"noopener noreferrer\" target=\"_blank\">15 Gb/mm<sup>2 </sup>areal density in a 162-layer chip</a>. And Kioxia engineers reported <a href=\"https://ieeexplore.ieee.org/document/9830513\" rel=\"noopener noreferrer\" target=\"_blank\">5-bit cells</a> last month at the <a href=\"https://www.vlsisymposium.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Symposium on VLSI Technology and Circuits</a>. There has even been a <a href=\"https://ieeexplore.ieee.org/document/9779301\" rel=\"noopener noreferrer\" target=\"_blank\">7-bit cell demonstrated</a>, but it required dunking the chip in 77-kelvin liquid nitrogen.</p><p><em>This post was updated on 2 August 2022 to clarify the state of SK Hynix's and Samsung's plans.</em></p>",
  "pubDate": "Tue, 26 Jul 2022 18:00:00 +0000",
  "guid": "https://spectrum.ieee.org/micron-is-first-to-deliver-3d-flash-chips-with-more-than-200-layers",
  "category": [
    "Flash memory",
    "Nand flash memory",
    "Micron technologies"
  ],
  "dc:creator": "Samuel K. Moore",
  "media:content": ""
}