{
  "title": "Josephson junctions of 2D time-reversal invariant superconductors: signatures of the topological phase. (arXiv:2205.14993v3 [cond-mat.supr-con] UPDATED)",
  "link": "http://arxiv.org/abs/2205.14993",
  "description": "<p>We determine the current-phase relation (CPR) of two-terminal configurations\nof Josephson junctions containing two-dimensional (2D) time-reversal invariant\ntopological superconductors (TRITOPS), including TRITOPS-TRITOPS, as well as\njunctions between topological and non-topological superconductors (TRITOPS-S).\nWe focus on long junctions for which several channels intervene in the\ntunneling coupling through the junction. We present a description of the\ntopological edge modes for different TRITOPS models including $p$-wave pairing\nand the combination of $s$-wave pairing with spin-orbit coupling. We derive\neffective low-energy Hamiltonians to describe the Josephson junction, which can\nbe solved analytically to explain the contribution of the edge states to the\nJosephson current as a function of the phase bias. We find that edge-modes\nyield singular corrections to the CPR for both junction types. The primary\neffects occur for the response of the Majorana zero-modes at half-flux quantum\nphase $\\phi\\approx \\pi$ in TRITOPS-TRITOPS junctions and for integer flux\nquantum phase $\\phi \\approx 0$ for TRITOPS-S junctions, respectively. The\nformer effect is particularly strong two-component nematic superconductors. The\nlatter effect leads to a spontaneously broken time-reversal symmetry in the\nTRITOPS-S junction and to a breakdown of the bulk-boundary correspondence.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cond-mat/1/au:+Ruiz_G/0/1/0/all/0/1\">Gabriel F. Rodr&#xed;guez Ruiz</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Rampp_M/0/1/0/all/0/1\">Michael A. Rampp</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Aligia_A/0/1/0/all/0/1\">A. A. Aligia</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Schmalian_J/0/1/0/all/0/1\">Joerg Schmalian</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Arrachea_L/0/1/0/all/0/1\">Liliana Arrachea</a>"
}