{
  "title": "Episode 145: &#8220;Tomorrow Never Knows&#8221; by the Beatles",
  "link": "https://500songs.com/podcast/episode-145-tomorrow-never-knows-by-the-beatles/",
  "pubDate": "Sat, 05 Mar 2022 02:43:50 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=1072",
  "description": "This week’s episode looks at “Tomorrow Never Knows”, the making of <em>Revolver</em> by the Beatles, and the influence of Timothy Leary on the burgeoning psychedelic movement. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, <a href=\"https://www.patreon.com/posts/63391596\">on \"Keep on Running\" by the Spencer Davis Group.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Errata</strong>\n\nA few things -- I say \"Fairfield\" at one point when I mean \"Fairchild\". While Timothy Leary was imprisoned in 1970 he wasn't actually placed in the cell next to Charles Manson until 1973. Sources differ on when Geoff Emerick started at EMI, and he *may* not have worked on \"Sun Arise\", though I've seen enough reliable sources saying he did that I think it's likely. And I've been told that Maureen Cleave denied having an affair with Lennon -- though note that I said it was \"strongly rumoured\" rather than something definite.\n\n<strong>Resources</strong>\n\nAs usual, a mix of all the songs excerpted in this episode is available <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-145-tomorrow-never-knows/\">at Mixcloud.com.</a>\n\nI have read literally dozens of books on the Beatles, and used bits of information from many of them. All my Beatles episodes refer to: <a href=\"https://amzn.to/3tc1YzZ\"><em>The Complete Beatles Chronicle</em> by Mark Lewisohn</a>, <a href=\"https://amzn.to/3r70SUA\"><em>All The Songs: The Stories Behind Every Beatles Release</em> by Jean-Michel Guesdon</a>, <a href=\"https://amzn.to/3oyiWVN\"><em>And The Band Begins To Play: The Definitive Guide To The Songs of The Beatles </em>by Steve Lambley</a>, <a href=\"https://amzn.to/3r5ACd3\"><em>The Beatles By Ear</em> by Kevin Moore</a>, <a href=\"https://amzn.to/3j20800\"><em>Revolution in the Head</em> by Ian MacDonald</a>, and <a href=\"https://amzn.to/3tbphu4\"><em>The Beatles Anthology</em>.</a>\n\nFor this episode, I also referred to <a href=\"https://amzn.to/3IFDTci\"><em>Last Interview</em> by David Sheff,</a> a longform interview with John Lennon and Yoko Ono from shortly before Lennon's death; <a href=\"https://amzn.to/3pCtR44\"><em>Many Years From Now</em></a> by Barry Miles, an authorised biography of Paul McCartney; and <a href=\"https://amzn.to/36RVYWv\"><em>Here, There, and Everywhere: My Life Recording the Music of the Beatles</em></a> by Geoff Emerick and Howard Massey.\n\nFor information on Timothy Leary I used a variety of sources including <a href=\"https://amzn.to/35QbqSq\"><em>The Most Dangerous Man in America</em></a> by Bill Minutaglio and Steven L. Davis; <a href=\"https://amzn.to/3HK4tQ4\"><em>Timothy Leary: Outside Looking In</em></a> by Robert Forte; <a href=\"https://amzn.to/3IEjRip\"><em>The Starseed Signals</em></a> by Robert Anton Wilson; and especially <a href=\"https://amzn.to/35QbVfB\"><em>The Harvard Psychedelic Club</em> </a>by Don Lattin.\n\nI also referred to both <a href=\"https://amzn.to/3sJ7Q5S\"><em>The Tibetan Book of the Dead</em></a> and to <a href=\"https://amzn.to/3sIeKbq\"><em>The Psychedelic Experience</em></a>.\n\nLeary's much-abridged audiobook version of <em>The Psychedelic Experience</em> can be purchased from <a href=\"https://folkways.si.edu/timothy-leary/readings-from-the-book-the-psychedelic-experience-a-manual-based-on-the-tibetan-book-of-the-dead/documentary-prose/album/smithsonian\">Folkways Records</a>.\n\nSadly the first mono mix of \"Tomorrow Never Knows\" has been out of print since it was first issued. The only way to get the second mono mix is on <a href=\"https://amzn.to/2U0tGmS\">this ludicrously-expensive out-of-print box set,</a> but the stereo mix is easily available on <a href=\"https://amzn.to/34ibCtu\"><em>Revolver</em></a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nBefore I start this episode, I'd like to note that it deals with a number of subjects some listeners might find upsetting, most notably psychedelic drug use, mental illness, and suicide. I think I've dealt with those subjects fairly respectfully, but you still may want to check the transcript if you have worries about these subjects.\n\nAlso, we're now entering a period of music history with the start of the psychedelic era where many of the songs we're looking at are influenced by non-mainstream religious traditions, mysticism, and also increasingly by political ideas which may seem strange with nearly sixty years' hindsight. I'd just like to emphasise that when I talk about these ideas, I'm trying as best I can to present the thinking of the people I'm talking about, in an accurate and unbiased way, rather than talking about my own beliefs. We're going to head into some strange places in some of these episodes, and my intention is neither to mock the people I'm talking about nor to endorse their ideas, but to present those ideas to you the listener so you can understand the music, the history, and the mindset of the people involved,\n\nIs that clear? Then lets' turn on, tune in, and drop out back to 1955...\n\n[Opening excerpt from The Psychedelic Experience]\n\nThere is a phenomenon in many mystical traditions, which goes by many names, including the dark night of the soul and the abyss. It's an experience that happens to mystics of many types, in which they go through unimaginable pain near the beginning of their journey towards greater spiritual knowledge. That pain usually involves a mixture of internal and external events -- some terrible tragedy happens to them, giving them a new awareness of the world's pain, at the same time they're going through an intellectual crisis about their understanding of the world, and it can last several years. It's very similar to the more common experience of the mid-life crisis, except that rather than buying a sports car and leaving their spouse, mystics going through this are more likely to found a new religion. At least, those who survive the crushing despair intact. Those who come out of the experience the other end often find themselves on a totally new path, almost like they're a different person.\n\nIn 1955, when Dr. Timothy Leary's dark night of the soul started, he was a respected academic psychologist, a serious scientist who had already made several substantial contributions to his field, and was considered a rising star. By 1970, he would be a confirmed mystic, sentenced to twenty years in prison, in a cell next to Charles Manson, and claiming to different people that he was the reincarnation of Gurdjieff, Aleister Crowley, and Jesus Christ.\n\nIn the fifties, Leary and his wife had an open relationship, in which they were both allowed to sleep with other people, but weren't allowed to form emotional attachments to them. Unfortunately, Leary *had* formed an emotional attachment to another woman, and had started spending so much time with her that his wife was convinced he was going to leave her. On top of that, Leary was an alcoholic, and was prone to get into drunken rows with his wife.\n\nHe woke up on the morning of his thirty-fifth birthday, hung over after one of those rows, to find that she had died by suicide while he slept, leaving a note saying that she knew he was going to leave her and that her life would be meaningless without him.\n\nThis was only months after Leary had realised that the field he was working in, to which he had devoted his academic career, was seriously broken. Along with a colleague, Frank Barron, he published a paper on the results of clinical psychotherapy, \"Changes in psychoneurotic patients with and without psychotherapy\" which analysed the mental health of a group of people who had been through psychotherapy, and found that a third of them improved, a third stayed the same, and a third got worse. The problem was that there was a control group, of people with the same conditions who were put on a waiting list and told to wait the length of time that the therapy patients were being treated. A third of them improved, a third stayed the same, and a third got worse.\n\nIn other words, psychotherapy as it was currently practised had no measurable effect at all on patients' health.\n\nThis devastated Leary, as you might imagine. But more through inertia than anything else, he continued working in the field, and in 1957 he published what was regarded as a masterwork -- his book Interpersonal Diagnosis of Personality: A Functional Theory and Methodology for Personality Evaluation.\n\nLeary's book was a challenge to the then-dominant idea in psychology, behaviourism, which claimed that it made no sense to talk about anyone's internal thoughts or feelings -- all that mattered was what could be measured, stimuli and responses, and that in a very real sense the unmeasurable thoughts people had didn't exist at all. Behaviourism looked at every human being as a mechanical black box, like a series of levers.\n\nLeary, by contrast, analysed human interactions as games, in which people took on usual roles, but were able, if they realised this, to change the role or even the game itself. It was very similar to the work that Eric Berne was doing at the same time, and which would later be popularised in Berne's book Games People Play. Berne's work was so popular that it led to the late-sixties hit record \"Games People Play\" by Joe South:\n\n[Excerpt: Joe South: \"Games People Play\"]\n\nBut in 1957, between Leary and Berne, Leary was considered the more important thinker among his peers -- though some thought of him as more of a showman, enthralled by his own ideas about how he was going to change psychology, than a scientist, and some thought that he was unfairly taking credit for the work of lesser-known but better researchers.\n\nBut by 1958, the effects of the traumas Leary had gone through a couple of years earlier were at their worst. He was starting to become seriously ill -- from the descriptions, probably from something stress-related and psychosomatic -- and he took his kids off to Europe, where he was going to write the great American novel. But he rapidly ran through his money, and hadn't got very far with the novel. He was broke, and ill, and depressed, and desperate, but then in 1959 his old colleague Frank Barron, who was on holiday in the area, showed up, and the two had a conversation that changed Leary's life forever in multiple ways.\n\nThe first of the conversational topics would have the more profound effect, though that wouldn't be apparent at first. Barron talked to Leary about his previous holiday, when he'd visited Mexico and taken psilocybin mushrooms. These had been used by Mexicans for centuries, but the first publication about them in English had only been in 1955 -- the same year when Leary had had other things on his mind -- and they were hardly known at all outside Mexico. Barron talked about the experience as being the most profound, revelatory, experience of his life. Leary thought his friend sounded like a madman, but he humoured him for the moment.\n\nBut Barron also mentioned that another colleague was on holiday in the same area. David McClelland, head of the Harvard Center for Personality Research, had mentioned to Barron that he had just read Diagnosis of Personality and thought it a work of genius. McClelland hired Leary to work for him at Harvard, and that was where Leary met Ram Dass.\n\n[Excerpt from \"The Psychedelic Experience\"]\n\nRam Dass was not the name that Dass was going by at the time -- he was going by his birth name, and only changed his name a few years later, after the events we're talking about -- but as always, on this podcast we don't use people's deadnames, though his is particularly easy to find as it's still the name on the cover of his most famous book, which we'll be talking about shortly.\n\nDass was another psychologist at the Centre for Personality Research, and he would be Leary's closest collaborator for the next several years. The two men would become so close that at several points Leary would go travelling and leave his children in Dass' care for extended periods of time. The two were determined to revolutionise academic psychology.\n\nThe start of that revolution didn't come until summer 1960. While Leary was on holiday in Cuernavaca in Mexico, a linguist and anthropologist he knew, Lothar Knauth, mentioned that one of the old women in the area collected those magic mushrooms that Barron had been talking about. Leary decided that that might be a fun thing to do on his holiday, and took a few psilocybin mushrooms.\n\nThe effect was extraordinary. Leary called this, which had been intended only as a bit of fun, \"the deepest religious experience of my life\".\n\n[Excerpt from \"The Psychedelic Experience\"]\n\nHe returned to Harvard after his summer holiday and started what became the Harvard Psilocybin Project. Leary and various other experimenters took controlled doses of psilocybin and wrote down their experiences, and Leary believed this would end up revolutionising psychology, giving them insights unattainable by other methods. The experimenters included lecturers, grad students, and people like authors Allen Ginsberg and William Burroughs, jazz trumpeter Maynard Ferguson, and Alan Watts, who popularised Zen Buddhism in the West.\n\nDass didn't join the project until early 1961 -- he'd actually been on the holiday with Leary, but had arrived a few days after the mushroom experiment, and nobody had been able to get hold of the old woman who knew where to find the mushrooms, so he'd just had to deal with Leary telling him about how great it was rather than try it himself.\n\nHe then spent a semester as a visiting scholar at Berkeley, so he didn't get to try his first trip until February 1961. Dass, on his first trip, first had a revelation about the nature of his own true soul, then decided at three in the morning that he needed to go and see his parents, who lived nearby, and tell them the good news. But there was several feet of snow, and so he decided he must save his parents from the snow, and shovel the path to their house. At three in the morning. Then he saw them looking out the window at him, he waved, and then started dancing around the shovel. He later said “Until that moment I was always trying to be the good boy, looking at myself through other people’s eyes. What did the mothers, fathers, teachers, colleagues want me to be? That night, for the first time, I felt good inside. It was OK to be me.”\n\nThe Harvard Psilocybin Project soon became the Harvard Psychedelic Project. The term \"psychedelic\", meaning \"soul revealing\", was coined by the British psychiatrist Humphrey Osmond, who had been experimenting with hallucinogens for years, and had guided Aldous Huxley on the mescaline trip described in The Doors of Perception. Osmond and Huxley had agreed that the term \"psychotomimetic\", in use at the time, which meant \"mimicking psychosis\", wasn't right -- it was too negative. They started writing letters to each other, suggesting alternative terms. Huxley came up with \"phanerothyme\", the Greek for \"soul revealing\", and wrote a little couplet to Osmond:\n\nTo make this trivial world sublime\n\nTake half a gramme of phanerothyme.\n\nOsmond countered with the Latin equivalent:\n\nTo fathom hell or soar angelic\n\nJust take a pinch of psychedelic\n\nOsmond also inspired Leary's most important experimental work of the early sixties. Osmond had got to know Bill W., the founder of Alcoholics Anonymous, and had introduced W. to LSD. W. had become sober after experiencing a profound spiritual awakening and a vision of white light while being treated for his alcoholism using the so-called \"belladonna cure\" -- a mixture of various hallucinogenic and toxic substances that was meant to cure alcoholism. When W. tried LSD, he found it replicated his previous spiritual experience and became very evangelistic about its use by alcoholics, thinking it could give them the same kind of awakening he'd had.\n\nLeary became convinced that if LSD could work on alcoholics, it could also be used to help reshape the personalities of habitual criminals and lead them away from reoffending. His idea for how to treat people was based, in part, on the ideas of transactional analysis. There is always a hierarchical relationship between a therapist and their patient, and that hierarchical relationship itself, in Leary's opinion, forced people into particular game roles and made it impossible for them to relate as equals, and thus impossible for the therapist to truly help the patient. So his idea was that there needed to be a shared bonding experience between patient and doctor. So in his prison experiments, he and the other people involved, including Ralph Metzner, one of his grad students, would take psilocybin *with* the patients.\n\nIn short-term follow-ups the patients who went through this treatment process were less depressed, felt better, and were only half as likely to reoffend as normal prisoners. But critics pointed out that the prisoners had been getting a lot of individual attention and support, and there was no control group getting that support without the psychedelics.\n\n[Excerpt: The Psychedelic Experience]\n\nAs the experiments progressed, though, things were becoming tense within Harvard. There was concern that some of the students who were being given psilocybin were psychologically vulnerable and were being put at real risk. There was also worry about the way that Leary and Dass were emphasising experience over analysis, which was felt to be against the whole of academia. Increasingly it looked like there was a clique forming as well, with those who had taken part in their experiments on the inside and looking down on those outside, and it looked to many people like this was turning into an actual cult. This was simply not what the Harvard psychology department was meant to be doing.\n\nAnd one Harvard student was out to shut them down for good, and his name was Andrew Weil.\n\nWeil is now best known as one of the leading lights in alternative health, and has made appearances on Oprah and Larry King Live, but for many years his research interest was in mind-altering chemicals -- his undergraduate thesis was on the use of nutmeg to induce different states of consciousness.\n\nAt this point Weil was an undergraduate, and he and his friend Ronnie Winston had both tried to get involved in the Harvard Psilocybin Project, but had been turned down -- while they were enthusiastic about it, they were also undergraduates, and Leary and Dass had agreed with the university that they wouldn't be using undergraduates in their project, and that only graduate students, faculty, and outsiders would be involved.\n\nSo Weil and Winston had started their own series of experiments, using mescaline after they'd been unable to get any psilocybin -- they'd contacted Aldous Huxley, the author of The Doors of Perception and an influence on Leary and Dass' experiments, and asked him where they could get mescaline, and he'd pointed them in the right direction.\n\nBut then Winston and Dass had become friends, and Dass had given Winston some psilocybin -- not as part of his experiments, so Dass didn't think he was crossing a line, but just socially. Weil saw this as a betrayal by Winston, who stopped hanging round with him once he became close to Dass, and also as a rejection of him by Dass and Leary. If they'd give Winston psilocybin, why wouldn't they give it to him?\n\nWeil was a writer for the Harvard Crimson, Harvard's newspaper, and he wrote a series of exposes on Leary and Dass for the Crimson. He went to his former friend Winston's father and told him \"Your son is getting drugs from a faculty member. If your son will admit to that charge, we’ll cut out your son’s name. We won’t use it in the article.\"  Winston did admit to the charge, under pressure from his father, and was brought to tell the Dean, saying to the Dean “Yes, sir, I did, and it was the most educational experience I’ve had at Harvard.”\n\nWeil wrote about this for the Crimson, and the story was picked up by the national media. Weil eventually wrote about Leary and Dass for Look magazine, where he wrote “There were stories of students and others using hallucinogens for seductions, both heterosexual and homosexual.”\n\nAnd this seems actually to have been a big part of Weil's motivation. While Dass and Winston always said that their relationship was purely platonic, Dass was bisexual, and Weil seems to have assumed his friend had been led astray by an evil seducer. This was at a time when homophobia and biphobia were even more prevalent in society than they are now, and part of the reason Leary and Dass fell out in the late sixties is that Leary started to see Dass' sexuality as evil and perverted and something they should be trying to use LSD to cure.\n\nThe experiments became a national scandal, and one of the reasons that LSD was criminalised a few years later. Dass was sacked for giving drugs to undergraduates; Leary had gone off to Mexico to get away from the stress, leaving his kids with Dass. He would be sacked for going off without permission and leaving his classes untaught.\n\nAs Leary and Dass were out of Harvard, they had to look for other sources of funding. Luckily, Dass turned William Mellon Hitchcock, the heir to the Mellon oil fortune, on to acid, and he and his brother Tommy and sister Peggy gave them the run of a sixty-four room mansion, named Millbrook. When they started there, they were still trying to be academics, but over the five years they were at Millbrook it became steadily less about research and more of a hippie commune, with regular visitors and long-term residents including Alan Ginsberg, William Burroughs, and the jazz musician Maynard Ferguson, who would later get a small amount of fame with jazz-rock records like his version of \"MacArthur Park\":\n\n[Excerpt: Maynard Ferguson, \"MacArthur Park\"]\n\nIt was at Millbrook that Leary, Dass, and Metzner would write the book that became The Psychedelic Experience.\n\nThis book was inspired by the Bardo Thödol, a book allegedly written by Padmasambhava, the man who introduced Buddhism to Tibet in the eighth century, though no copies of it are known to have existed before the fourteenth century, when it was supposedly discovered by Karma Lingpa.\n\nIts title translates as Liberation Through Hearing During the Intermediate State, but it was translated into English under the name The Tibetan Book of the Dead, as Walter Evans-Wentz, who compiled and edited the first English translation was, like many Westerners who studied Buddhism in the early part of the twentieth century, doing so because he was an occultist and a member of the Theosophical Society, which believes the secret occult masters of the world live in Tibet, but which also considered the Egyptian Book of the Dead -- a book which bears little relationship to the Bardo Thödol, and which was written thousands of years earlier on a different continent -- to be a major religious document. So it was through that lens that Evans-Wentz was viewing the Bardo Thödol, and he renamed the book to emphasise what he perceived as its similarities.\n\nPart of the Bardo Thödol is a description of what happens to someone between death and rebirth -- the process by which the dead person becomes aware of true reality, and then either transcends it or is dragged back into it by their lesser impulses -- and a series of meditations that can be used to help with that transcendence.\n\nIn the version published as The Tibetan Book of the Dead, this is accompanied by commentary from Evans-Wentz, who while he was interested in Buddhism didn't actually know that much about Tibetan Buddhism, and was looking at the text through a Theosophical lens, and mostly interpreting it using Hindu concepts.\n\nLater editions of Evans-Wentz's version added further commentary by Carl Jung, which looked at Evans-Wentz's version of the book through Jung's own lens, seeing it as a book about psychological states, not about anything more supernatural (although Jung's version of psychology was always a supernaturalist one, of course). His Westernised, psychologised, version of the book's message became part of the third edition.\n\nMetzner later said \"At the suggestion of Aldous Huxley and Gerald Heard we began using the Bardo Thödol ( Tibetan Book of the Dead) as a guide to psychedelic sessions. The Tibetan Buddhists talked about the three phases of experience on the “intermediate planes” ( bardos) between death and rebirth. We translated this to refer to the death and the rebirth of the ego, or ordinary personality. Stripped of the elaborate Tibetan symbolism and transposed into Western concepts, the text provided a remarkable parallel to our findings.\"\n\nLeary, Dass, and Metzner rewrote the book into a form that could be used to guide a reader through a psychedelic trip, through the death of their ego and its rebirth. Later, Leary would record an abridged audiobook version, and it's this that we've been hearing excerpts of during this podcast so far:\n\n[Excerpt: The Psychedelic Experience \"Turn off your mind, relax, float downstream\" about 04:15]\n\nWhen we left the Beatles, they were at the absolute height of their fame, though in retrospect the cracks had already begun to show.  Their second film had been released, and the soundtrack had contained some of their best work, but the title track, \"Help!\", had been a worrying insight into John Lennon's current mental state.\n\nImmediately after making the film and album, of course, they went back out touring, first a European tour, then an American one, which probably counts as the first true stadium tour.\n\nThere had been other stadium shows before the Beatles 1965 tour -- we talked way back in the first episodes of the series about how Sister Rosetta Tharpe had a *wedding* that was a stadium gig. But of course there are stadiums and stadiums, and the Beatles' 1965 tour had them playing the kind of venues that no other musician, and certainly no other rock band, had ever played.\n\nMost famously, of course, there was the opening concert of the tour at Shea Stadium, where they played to an audience of fifty-five thousand people -- the largest audience a rock band had ever played for, and one which would remain a record for many years. Most of those people, of course, couldn't actually hear much of anything -- the band weren't playing through a public address system designed for music, just playing through the loudspeakers that were designed for commentating on baseball games. But even if they had been playing through the kind of modern sound systems used today, it's unlikely that the audience would have heard much due to the overwhelming noise coming from the crowd. Similarly, there were no live video feeds of the show or any of the other things that nowadays make it at least possible for the audience to have some idea what is going on on stage.\n\nThe difference between this and anything that anyone had experienced before was so great that the group became overwhelmed. There's video footage of the show -- a heavily-edited version, with quite a few overdubs and rerecordings of some tracks was broadcast on TV, and it's also been shown in cinemas more recently as part of promotion for an underwhelming documentary about the Beatles' tours -- and you can see Lennon in particular becoming actually hysterical during the performance of \"I'm Down\", where he's playing the organ with his elbows. Sadly the audio nature of this podcast doesn't allow me to show Lennon's facial expression, but you can hear something of the exuberance in the performance.\n\nThis is from what is labelled as a copy of the raw audio of the show -- the version broadcast on TV had a fair bit of additional sweetening work done on it:\n\n[Excerpt: The Beatles, \"I'm Down (Live at Shea Stadium)\"]\n\nAfter their American tour they had almost six weeks off work to write new material before going back into the studio to record their second album of the year, and one which would be a major turning point for the group. The first day of the recording sessions for this new album, Rubber Soul, started with two songs of Lennon's. The first of these was \"Run For Your Life\", a song Lennon never later had much good to say about, and which is widely regarded as the worst song on the album. That song was written off a line from Elvis Presley's version of \"Baby Let's Play House\", and while Lennon never stated this, it's likely that it was brought to mind by the Beatles having met with Elvis during their US tour.\n\nBut the second song was more interesting. Starting with \"Help!\", Lennon had been trying to write more interesting lyrics. This had been inspired by two conversations with British journalists -- Kenneth Allsop had told Lennon that while he liked Lennon's poetry, the lyrics to his songs were banal in comparison and he found them unlistenable as a result, while Maureen Cleave, a journalist who was a close friend with Lennon, had told him that she hadn't noticed a single word in any of his lyrics with more than two syllables, so he made more of an effort with \"Help!\", putting in words like \"independence\" and \"insecure\". As he said in one of his last interviews, \"I was insecure then, and things like that happened more than once. I never considered it before. So after that I put a few words with three syllables in, but she didn’t think much of them when I played it for her, anyway.”\n\nCleave may have been an inspiration for \"Norwegian Wood (This Bird Has Flown)\". There are very strong rumours that Lennon had an affair with Cleave in the mid-sixties, and if that's true it would definitely fit into a pattern. Lennon had many, many, affairs during his first marriage, both brief one-night stands and deeper emotional attachments, and those emotional attachments were generally with women who were slightly older, intellectual, somewhat exotic looking by the standards of 1960s Britain, and in the arts. Lennon later claimed to have had an affair with Eleanor Bron, the Beatles' co-star in Help!, though she always denied this, and it's fairly widely established that he did have an affair with Alma Cogan, a singer who he'd mocked during her peak of popularity in the fifties, but who would later become one of his closest friends:\n\n[Excerpt: Alma Cogan, \"Why Do Fools Fall in Love?\"]\n\nAnd \"Norwegian Wood\", the second song recorded for Rubber Soul, started out as a confession to one of these affairs, a way of Lennon admitting it to his wife without really admitting it. The figure in the song is a slightly aloof, distant woman, and the title refers to the taste among Bohemian British people at the time for minimalist decor made of Scandinavian pine -- something that would have been a very obvious class signifier at the time.\n\n[Excerpt: The Beatles, \"Norwegian Wood (This Bird Has Flown)\"]\n\nLennon and McCartney had different stories about who wrote what in the song, and Lennon's own story seems to have changed at various times. What seems to have happened is that Lennon wrote the first couple of verses while on holiday with George Martin, and finished it off later with McCartney's help. McCartney seems to have come up with the middle eight melody -- which is in Dorian mode rather than the Mixolydian mode of the verses -- and to have come up with the twist ending, where the woman refuses to sleep with the protagonist and laughs at him, he goes to sleep in the bath rather than her bed, wakes up alone, and sets fire to the house in revenge.\n\nThis in some ways makes \"Norwegian Wood\" the thematic centrepiece of the album that was to result, combining several of the themes its two songwriters came back to throughout the album and the single recorded alongside it. Like Lennon's \"Run For Your Life\" it has a misogynistic edge to it, and deals with taking revenge against a woman, but like his song \"Girl\", it deals with a distant, unattainable, woman, who the singer sees as above him but who has a slightly cruel edge -- the kind of girl who puts you down when friends are there,  you feel a fool, is very similar to the woman who tells you to sit down but has no chairs in her minimalist flat. A big teaser who takes you half the way there is likely to laugh at you as you crawl off to sleep in the bath while she goes off to bed alone.\n\nMeanwhile, McCartney's two most popular contributions to the album, \"Michelle\" and \"Drive My Car\", also feature unattainable women, but are essentially comedy songs -- \"Michelle\" is a pastiche French song which McCartney used to play as a teenager while pretending to be foreign to impress girls, dug up and finished for the album, while \"Drive My Car\" is a comedy song with a twist in the punchline, just like \"Norwegian Wood\", though \"Norwegian Wood\"s twist is darker.\n\nBut \"Norwegian Wood\" is even more famous for its music than for its lyric. The basis of the song is Lennon imitating Dylan's style -- something that Dylan saw, and countered with \"Fourth Time Around\", a song which people have interpreted multiple ways, but one of those interpretations has always been that it's a fairly vicious parody of \"Norwegian Wood\":\n\n[Excerpt: Bob Dylan, \"Fourth Time Around\"]\n\nCertainly Lennon thought that at first, saying a few years later \"I was very paranoid about that. I remember he played it to me when he was in London. He said, what do you think? I said, I don’t like it. I didn’t like it. I was very paranoid. I just didn’t like what I felt I was feeling – I thought it was an out and out skit, you know, but it wasn’t. It was great. I mean he wasn’t playing any tricks on me. I was just going through the bit.\"\n\nBut the aspect of \"Norwegian Wood\" that has had more comment over the years has been the sitar part, played by George Harrison:\n\n[Excerpt: The Beatles, \"Norwegian Wood\"]\n\nThis has often been called the first sitar to be used on a rock record, and that may be the case, but it's difficult to say for sure. Indian music was very much in the air among British groups in September 1965, when the Beatles recorded the track. That spring, two records had almost simultaneously introduced Indian-influenced music into the pop charts. The first had been the Yardbirds' \"Heart Full of Soul\", released in June and recorded in April. In fact, the Yardbirds had actually used a sitar on their first attempt at recording the song, which if it had been released would have been an earlier example than the Beatles:\n\n[Excerpt: The Yardbirds, \"Heart Full of Soul (first version)\"]\n\nBut in the finished recording they had replaced that with Jeff Beck playing a guitar in a way that made it sound vaguely like a sitar, rather than using a real one:\n\n[Excerpt: The Yardbirds, \"Heart Full of Soul (single)\"]\n\nMeanwhile, after the Yardbirds had recorded that but before they'd released it, and apparently without any discussion between the two groups, the Kinks had done something similar on their \"See My Friends\", which came out a few weeks after the Yardbirds record:\n\n[Excerpt: The Kinks, \"See My Friends\"]\n\n(Incidentally, that track is sometimes titled \"See My Friend\" rather than \"See My Friends\", but that's apparently down to a misprint on initial pressings rather than that being the intended title).\n\nAs part of this general flowering of interest in Indian music, George Harrison had become fascinated with the sound of the sitar while recording scenes in Help! which featured some Indian musicians. He'd then, as we discussed in the episode on \"Eight Miles High\" been introduced by David Crosby on the Beatles' summer US tour to the music of Ravi Shankar.\n\n\"Norwegian Wood\" likely reminded Harrison of Shankar's work for a couple of reasons. The first is that the melody is very modal -- as I said before, the verses are in Mixolydian mode, while the middle eights are in Dorian -- and as we saw in the \"Eight Miles High\" episode Indian music is very modal.\n\nThe second is that for the most part, the verse is all on one chord -- a D chord as Lennon originally played it, though in the final take it's capoed on the second fret so it sounds in E. The only time the chord changes at all is on the words \"once had\" in the phrase “she once had me” where for one beat each Lennon plays a C9 and a G (sounding as a D9 and A). Both these chords, in the fingering Lennon is using, feel to a guitarist more like \"playing a D chord and lifting some fingers up or putting some down\" rather than playing new chords, and this is a fairly common way of thinking about stuff particularly when talking about folk and folk-rock music -- you'll tend to get people talking about the \"Needles and Pins\" riff as being \"an A chord where you twiddle your finger about on the D string\" rather than changing between A, Asus2, and Asus4.\n\nSo while there are chord changes, they're minimal and of a kind that can be thought of as \"not really\" chord changes, and so that may well have reminded Harrison of the drone that's so fundamental to Indian classical music.\n\nEither way, he brought in his sitar, and they used it on the track, both the version they cut on the first day of recording and the remake a week later which became the album track:\n\n[Excerpt: The Beatles, \"Norwegian Wood (This Bird Has Flown)\"]\n\nAt the same time as the group were recording Rubber Soul, they were also working on two tracks that would become their next single -- released as a double A-side because the group couldn't agree which of the two to promote. Both of these songs were actual Lennon/McCartney collaborations, something that was increasingly rare at this point. One, \"We Can Work it Out\" was initiated by McCartney, and like many of his songs of this period was inspired by tensions in his relationship with his girlfriend Jane Asher -- two of his other songs for Rubber Soul were \"I'm Looking Through You\" and \"You Won't See Me\".  The other, \"Day Tripper\",  was initiated by Lennon, and had other inspirations:\n\n[Excerpt: The Beatles, \"Day Tripper\"]\n\nJohn Lennon and George Harrison's first acid trip had been in spring of 1965, around the time they were recording Help!\n\nThe fullest version of how they came to try it I've read was in an interview George Harrison gave to Creem magazine in 1987, which I'll quote a bit of:\n\n\"I had a dentist who invited me and John and our ex-wives to dinner, and he had this acid he’d got off the guy who ran Playboy in London. And the Playboy guy had gotten it off, you know, the people who had it in America. What’s his name, Tim Leary. And this guy had never had it himself, didn’t know anything about it, but he thought it was an aphrodisiac and he had this girlfriend with huge breasts. He invited us down there with our blonde wives and I think he thought he was gonna have a scene. And he put it in our coffee without telling us—he didn’t take any himself. We didn’t know we had it, and we’d made an arrangement earlier—after we had dinner we were gonna go to this nightclub to see some friends of ours who were playing in a band. And I was saying, \"OK, let’s go, we’ve got to go,\" and this guy kept saying, \"No, don’t go, finish your coffee. Then, 20 minutes later or something, I’m saying, \"C’mon John, we’d better go now. We’re gonna miss the show.\" And he says we shouldn’t go ’cause we’ve had LSD.\"\n\nThey did leave anyway, and they had an experience they later remembered as being both profound and terrifying -- nobody involved had any idea what the effects of LSD actually were, and they didn't realise it was any different from cannabis or amphetamines. Harrison later described feelings of universal love, but also utter terror -- believing himself to be in hell, and that world war III was starting.\n\nAs he said later \"We’d heard of it, but we never knew what it was about and it was put in our coffee maliciously. So it really wasn’t us turning each other or the world or anything—we were the victims of silly people.\"\n\nBut both men decided it was an experience they needed to have again, and one they wanted to share with their friends. Their next acid trip was the one that we talked about in the episode on \"Eight Miles High\", with Roger McGuinn, David Crosby, and Peter Fonda. That time Neil Aspinall and Ringo took part as well, but at this point Paul was still unsure about taking it -- he would later say that he was being told by everyone that it changed your worldview so radically you'd never be the same again, and he was understandably cautious about this.\n\nCertainly it had a profound effect on Lennon and Harrison -- Starr has never really talked in detail about his own experiences. Harrison would later talk about how prior to taking acid he had been an atheist, but his experiences on the drug gave him an unshakeable conviction in the existence of God -- something he would spend the rest of his life exploring.\n\nLennon didn't change his opinions that drastically, but he did become very evangelistic about the effects of LSD. And \"Day Tripper\" started out as a dig at what he later described as weekend hippies, who took acid but didn't change the rest of their lives -- which shows a certain level of ego in a man who had at that point only taken acid twice himself -- though in collaboration with McCartney it turned into another of the rather angry songs about unavailable women they were writing at this point. The line \"she's a big teaser, she took me half the way there\" apparently started as \"she's a prick teaser\":\n\n[Excerpt: The Beatles, \"Day Tripper\"]\n\nIn the middle of the recording of Rubber Soul, the group took a break to receive their MBEs from the Queen. Officially the group were awarded these because they had contributed so much to British exports. In actual fact, they received them because the Prime Minister, Harold Wilson, had a government with a majority of only four MPs and was thinking about calling an election to boost his majority. He represented a Liverpool constituency, and wanted to associate his Government and the Labour Party with the most popular entertainers in the UK.\n\n\"Day Tripper\" and \"We Can Work it Out\" got their TV premiere on a show recorded for Granada TV,  The Music of Lennon and McCartney, and fans of British TV trivia will be pleased to note that the harmonium Lennon plays while the group mimed \"We Can Work it Out\" in that show is the same one that was played in Coronation Street by Ena Sharples -- the character we heard last episode being Davy Jones' grandmother.\n\nAs well as the Beatles themselves, that show included other Brian Epstein artists like Cilla Black and Billy J Kramer singing songs that Lennon and McCartney had given to them, plus Peter Sellers, the Beatles' comedy idol, performing \"A Hard Day's Night\" in the style of Laurence Olivier as Richard III:\n\n[Excerpt: Peter Sellers, \"A Hard Day's Night\"]\n\nAnother performance on the show was by Peter and Gordon, performing a hit that Paul had given to them, one of his earliest songs:\n\n[Excerpt: Peter and Gordon, \"A World Without Love\"]\n\nPeter Asher, of Peter and Gordon, was the brother of Paul McCartney's girlfriend, the actor Jane Asher. And while the other three Beatles were living married lives in mansions in suburbia, McCartney at this point was living with the Asher family in London, and being introduced by them to a far more Bohemian, artistic, hip crowd of people than he had ever before experienced. They were introducing him to types of art and culture of which he had previously been ignorant, and while McCartney was the only Beatle so far who hadn't taken LSD, this kind of mind expansion was far more appealing to him. He was being introduced to art film, to electronic composers like Stockhausen, and to ideas about philosophy and art that he had never considered.\n\nPeter Asher was a friend of John Dunbar, who at the time was Marianne Faithfull's husband, though Faithfull had left him and taken up with Mick Jagger, and of Barry Miles, a writer, and in September 1965 the three men had formed a company, Miles, Asher and Dunbar Limited, or MAD for short, which had opened up a bookshop and art gallery, the Indica Gallery, which was one of the first places in London to sell alternative or hippie books and paraphernalia, and which also hosted art events by people like members of the Fluxus art movement.\n\nMcCartney was a frequent customer, as you might imagine, and he also encouraged the other Beatles to go along, and the Indica Gallery would play an immense role in the group's history, which we'll look at in a future episode.\n\nBut the first impact it had on the group was when John and Paul went to the shop in late 1965, just after the recording and release of Rubber Soul and the \"Day Tripper\"/\"We Can Work It Out\" single, and John bought a copy of The Psychedelic Experience by Leary, Dass, and Metzner. He read the book on a plane journey while going on holiday -- reportedly while taking his third acid trip -- and was inspired.\n\nWhen he returned, he wrote a song which became the first track to be recorded for the group's next album, Revolver:\n\n[Excerpt: The Beatles, \"Tomorrow Never Knows\"]\n\nThe lyrics were inspired by the parts of The Psychedelic Experience which were in turn inspired by the Tibetan Book of the Dead.\n\nNow, it's important to put it this way because most people who talk about this record have apparently never read the book which inspired it. I've read many, many, books on the Beatles which claim that The Psychedelic Experience simply *is* the Tibetan Book of the Dead, slightly paraphrased.\n\nIn fact, while the authors use the Tibetan Book of the Dead as a structure on which to base their book, much of the book is detailed descriptions of Leary, Dass, and Metzner's hypotheses about what is actually happening during a psychedelic trip, and their notes on the book -- in particular they provide commentaries to the commentaries, giving their view of what Carl Jung meant when he talked about it, and of Evans-Wentz's opinions, and especially of a commentary by Anagarika Govinda, a Westerner who had taken up Tibetan Buddhism seriously and become a monk and one of its most well-known exponents in the West. By the time it's been filtered through so many different viewpoints and perspectives, each rewriting and reinterpreting it to suit their own preconceived ideas, they could have started with a book on the habitat of the Canada goose and ended with much the same result.\n\nMuch of this is the kind of mixture between religious syncretism and pseudoscience that will be very familiar to anyone who has encountered New Age culture in any way, statements like \"The Vedic sages knew the secret; the Eleusinian Initiates knew it; the Tantrics knew it. In all their esoteric writings they whisper the message: It is possible to cut beyond ego-consciousness, to tune in on neurological processes which flash by at the speed of light, and to become aware of the enormous treasury of ancient racial knowledge welded into the nucleus of every cell in your body\".\n\nThis kind of viewpoint is one that has been around in one form or another since the nineteenth century religious revivals in America that led to Mormonism, Christian Science, and the New Thought. It's found today in books and documentaries like The Secret and the writings of people like Deepak Chopra, and the idea is always the same one -- people thousands of years ago had a lost wisdom that has only now been rediscovered through the miracle of modern science. This always involves a complete misrepresentation of both the lost wisdom and of the modern science.\n\nIn particular, Leary, Dass, and Metzner's book freely mixes between phrases that sound vaguely scientific, like \"There are no longer things and persons but only the direct flow of particles\", things that are elements of Tibetan Buddhism, and references to ego games and \"game-existence\" which come from Leary's particular ideas of psychology as game interactions. All of this is intermingled, and so the claims that some have made that Lennon based the lyrics on the Tibetan Book of the Dead itself are very wrong. Rather the song, which he initially called \"The Void\", is very much based on Timothy Leary.\n\nThe song itself was very influenced by Indian music. The melody line consists of only four notes -- E, G, C, and B flat, over a space of an octave:\n\n[Demonstrates]\n\nThis sparse use of notes is very similar to the pentatonic scales in a lot of folk music, but that B-flat makes it the Mixolydian mode, rather than the E minor pentatonic scale our ears at first make it feel like. The B-flat also implies a harmony change -- Lennon originally sang the whole song over one chord, a C, which has the notes C, E, and G in it, but a B-flat note implies instead a chord of C7 -- this is another one of those occasions where you just put one finger down to change the chord while playing, and I suspect that's what Lennon did:\n\n[Demonstrates]\n\nLennon's song was inspired by Indian music, but what he wanted was to replicate the psychedelic experience, and this is where McCartney came in. McCartney was, as I said earlier, listening to a lot of electronic composers as part of his general drive to broaden his mind, and in particular he had been listening to quite a bit of Karlheinz Stockhausen.\n\nStockhausen was a composer who had studied with Olivier Messiaen in the 1940s, and had then become attached to the Groupe de Recherche de Musique Concrète along with Messiaen, Pierre Boulez, Edgard Varese and others, notably Pierre Schaeffer and Pierre Henry.\n\nThese composers were interested in a specific style of music called musique concrète, a style that had been pioneered by Schaeffer. Musique concrète is music that is created from, or at least using, prerecorded sounds that have been electronically altered, rather than with live instruments. Often this would involve found sound -- music made not by instruments at all, but by combining recorded sounds of objects, like with the first major work of musique concrète, Pierre Schaeffer's Cinq études de bruits:\n\n[Excerpt: Pierre Schaeffer, \"Etude aux Chemins de faire\" (from Cinq études de bruits)]\n\nEarly on, musique concrète composers worked in much the same way that people use turntables to create dance music today -- they would have multiple record players, playing shellac discs, and a mixing desk, and they would drop the needle on the record players to various points, play the records backwards, and so forth.\n\nOne technique that Schaeffer had come up with was to create records with a closed groove, so that when the record finished, the groove would go back to the start -- the record would just keep playing the same thing over and over and over.\n\nLater, when magnetic tape had come into use, Schaeffer had discovered you could get the same effect much more easily by making an actual loop of tape, and had started making loops of tape whose beginnings were stuck to their ending -- again creating something that could keep going over and over.\n\nStockhausen had taken up the practice of using tape loops, most notably in a piece that McCartney was a big admirer of, Gesang der Jeunglinge:\n\n[Excerpt: Karlheinz Stockhausen, \"Gesang der Jeunglinge\"]\n\nMcCartney suggested using tape loops on Lennon's new song, and everyone was in agreement. And this is the point where George Martin really starts coming into his own as a producer for the group.\n\nMartin had always been a good producer, but his being a good producer had up to this point mostly consisted of doing little bits of tidying up and being rather hands-off. He'd scored the strings on \"Yesterday\", played piano parts, and made suggestions like speeding up \"Please Please Me\" or putting the hook of \"Can't Buy Me Love\" at the beginning. Important contributions, contributions that turned good songs into great records, but nothing that Tony Hatch or Norrie Paramor or whoever couldn't have done. Indeed, his biggest contribution had largely been *not* being a Hatch or Paramor, and not imposing his own songs on the group, letting their own artistic voices flourish.\n\nBut at this point Martin's unique skillset came into play. Martin had specialised in comedy records before his work with the Beatles, and he had worked with Peter Sellers and Spike Milligan of the Goons, making records that required a far odder range of sounds than the normal pop record:\n\n[Excerpt: The Goons, \"Unchained Melody\"]\n\nThe Goons' radio show had used a lot of sound effects created by the BBC Radiophonic Workshop, a department of the BBC that specialised in creating musique concrète, and Martin had also had some interactions with the Radiophonic Workshop. In particular, he had worked with Maddalena Fagandini of the Workshop on an experimental single combining looped sounds and live instruments, under the pseudonym \"Ray Cathode\":\n\n[Excerpt: Ray Cathode, \"Time Beat\"]\n\nHe had also worked on a record that is if anything even more relevant to \"Tomorrow Never Knows\". Unfortunately, that record is by someone who has been convicted of very serious sex offences. In this case, Rolf Harris, the man in question, was so well-known in Britain before his arrest, so beloved, and so much a part of many people's childhoods, that it may actually be traumatic for people to hear his voice knowing about his crimes. So while I know that showing the slightest consideration for my listeners' feelings will lead to a barrage of comments from angry old men calling me a \"woke snowflake\" for daring to not want to retraumatise vulnerable listeners, I'll give a little warning before I play the first of two segments of his recordings in a minute. When I do, if you skip forward approximately ninety seconds, you'll miss that section out.\n\nHarris was an Australian all-round entertainer, known in Britain for his novelty records, like the unfortunately racist \"Tie Me Kangaroo Down Sport\" -- which the Beatles later recorded with him in a non-racist version for a BBC session. But he had also, in 1960, recorded and released in Australia a song he'd written based on his understanding of Aboriginal Australian religious beliefs, and backed by Aboriginal musicians on didgeridoo. And we're going to hear that clip now:\n\n[Excerpt. Rolf Harris, \"Sun Arise\" original]\n\nEMI, his British label, had not wanted to release that as it was, so he'd got together with George Martin and they'd put together a new version, for British release. That had included a new middle-eight, giving the song a tiny bit of harmonic movement, and Martin had replaced the didgeridoos with eight cellos, playing a drone:\n\n[Excerpt: Rolf Harris, \"Sun Arise\", 1962 version ]\n\nOK, we'll just wait a few seconds for anyone who skipped that to catch up...\n\nNow, there are some interesting things about that track. That is a track based on a non-Western religious belief, based around a single drone -- the version that Martin produced had a chord change for the middle eight, but the verses were still on the drone -- using the recording studio to make the singer's voice sound different, with a deep, pulsating, drum sound, and using a melody with only a handful of notes, which doesn't start on the tonic but descends to it.\n\nSound familiar? Oh, and a young assistant engineer had worked with George Martin on that session in 1962, in what several sources say was their first session together, and all sources say was one of their first. That young assistant engineer was Geoff Emerick, who had now been promoted to the main engineer role, and was working his first Beatles session in that role on “Tomorrow Never Knows”. Emerick was young and eager to experiment, and he would become a major part of the Beatles' team for the next few years, acting as engineer on all their recordings in 1966 and 67, and returning in 1969 for their last album.\n\nTo start with, the group recorded a loop of guitar and drums, heavily treated:\n\n[Excerpt: \"Tomorrow Never Knows\", loop]\n\nThat loop was slowed down to half its speed, and played throughout:\n\n[Excerpt: \"Tomorrow Never Knows\", loop]\n\nOnto that the group overdubbed a second set of live drums and Lennon's vocal. Lennon wanted his voice to sound like the Dalai Lama singing from a mountaintop, or like thousands of Tibetan monks. Obviously the group weren't going to fly to Tibet and persuade monks to sing for them, so they wanted some unusual vocal effect.\n\nThis was quite normal for Lennon, actually. One of the odd things about Lennon is that while he's often regarded as one of the greatest rock vocalists of all time, he always hated his own voice and wanted to change it in the studio. After the Beatles' first album there's barely a dry Lennon solo vocal anywhere on any record he ever made. Either he would be harmonising with someone else, or he'd double-track his vocal, or he'd have it drenched in reverb, or some other effect -- anything to stop it sounding quite so much like him.\n\nAnd Geoff Emerick had the perfect idea. There's a type of speaker called a Leslie speaker, which was originally used to give Hammond organs their swirling sound, but which can be used with other instruments as well. It has two rotating speakers inside it, a bass one and a treble one, and it's the rotation that gives the swirling sound. Ken Townsend, the electrical engineer working on the record, hooked up the speaker from Abbey Road's Hammond organ to Lennon's mic, and Lennon was ecstatic with the sound:\n\n[Excerpt: The Beatles, \"Tomorrow Never Knows\", take one]\n\nAt least, he was ecstatic with the sound of his vocal, though he did wonder if it might be more interesting to get the same swirling effect by tying himself to a rope and being swung round the microphone\n\nThe rest of the track wasn't quite working, though, and they decided to have a second attempt. But Lennon had been impressed enough by Emerick that he decided to have a chat with him about music -- his way of showing that Emerick had been accepted. He asked if Emerick had heard the new Tiny Tim record -- which shows how much attention Lennon was actually paying to music at this point. This was two years before Tim's breakthrough with \"Tiptoe Through the Tulips\", and his first single (unless you count a release from 1963 that was only released as a 78, in the sixties equivalent of a hipster cassette-only release), a version of \"April Showers\" backed with \"Little Girl\" -- the old folk song also known as \"In the Pines\" or \"Where Did You Sleep Last Night?\":\n\n[Excerpt: Tiny Tim, \"Little Girl\"]\n\nUnfortunately for Emerick, he hadn't heard the record, and rather than just say so he tried bluffing, saying \"Yes, they're great\".\n\nLennon laughed at his attempt to sound like he knew what he was talking about, before explaining that Tiny Tim was a solo artist, though he did say \"Nobody's really sure if it's actually a guy or some drag queen\".\n\nFor the second attempt, they decided to cut the whole backing track live rather than play to a loop. Lennon had had trouble staying in sync with the loop, but they had liked the thunderous sound that had been got from slowing the tape down. As Paul talked with Ringo about his drum part, suggesting a new pattern for him to play, Emerick went down into the studio from the control room and made some adjustments. He first deadened the sound of the bass drum by sticking a sweater in it -- it was actually a promotional sweater with eight arms, made when the film Help! had been provisionally titled Eight Arms to Hold You, which Mal Evans had been using as packing material.\n\nHe then moved the mics much, much closer to the drums that EMI studio rules allowed -- mics can be damaged by loud noises, and EMI had very strict rules about distance, not allowing them within two feet of the drum kit. Emerick decided to risk his job by moving the mics mere inches from the drums, reasoning that he would probably have Lennon's support if he did this. He then put the drum signal through an overloaded Fairfield limiter, giving it a punchier sound than anything that had been recorded in a British studio up to that point:\n\n[Excerpt: The Beatles, \"Tomorrow Never Knows\", isolated drums]\n\nThat wasn't the only thing they did to make the record sound different though.  As well as Emerick's idea for the Leslie speaker, Ken Townsend had his own idea of how to make Lennon's voice sound different. Lennon had often complained about the difficulty of double-tracking his voice, and so Townsend had had an idea -- if you took a normal recording, fed it to another tape machine a few milliseconds out of sync with the first, and then fed it back into the first, you could create a double-tracked effect without having to actually double-track the vocal.\n\nTownsend suggested this, and it was used for the first time on the first half of \"Tomorrow Never Knows\", before the Leslie speaker takes over. The technique is now known as \"artificial double-tracking\" or ADT, but the session actually gave rise to another term, commonly used for a similar but slightly different tape-manipulation effect that had already been used by Les Paul among others. Lennon asked how they'd got the effect and George Martin started to explain, but then realised Lennon wasn't really interested in the technical details, and said \"we take the original image and we split it through a double-bifurcated sploshing flange\". From that point on, Lennon referred to ADT as \"flanging\", and the term spread, though being applied to the other technique.\n\n(Just as a quick aside, some people have claimed other origins for the term \"flanging\", and they may be right, but I think this is the correct story).\n\nOver the backing track they added tambourine and organ overdubs -- with the organ changing to a B flat chord when the vocal hits the B-flat note, even though the rest of the band stays on C -- and then a series of tape loops, mostly recorded by McCartney. There's a recording that circulates which has each of these loops isolated, played first forwards and then backwards at the speed they were recorded, and then going through at the speed they were used on the record, so let's go through these. There's what people call the \"seagull\" sound, which is apparently McCartney laughing, very distorted:\n\n[Excerpt: Tomorrow Never Knows loop]\n\nThen there's an orchestral chord:\n\n[Excerpt: Tomorrow Never Knows loop]\n\nA mellotron on its flute setting:\n\n[Excerpt: Tomorrow Never Knows loop]\n\nAnd on its string setting:\n\n[Excerpt: Tomorrow Never Knows loop]\n\nAnd a much longer loop of sitar music supplied by George:\n\n[Excerpt: Tomorrow Never Knows loop]\n\nEach of these loops were played on a different tape machine in a different part of Abbey Road -- they commandeered the entire studio complex, and got engineers to sit with the tapes looped round pencils and wine-glasses, while the Beatles supervised Emerick and Martin in mixing the loops into a single track. They then added a loop of a tamboura drone played by George, and the result was one of the strangest records ever released by a major pop group:\n\n[Excerpt: The Beatles, \"Tomorrow Never Knows\"]\n\nWhile Paul did add some backwards guitar -- some sources say that this is a cut-up version of his solo from George's song \"Taxman\", but it's actually a different recording, though very much in the same style -- they decided that they were going to have a tape-loop solo rather than a guitar solo:\n\n[Excerpt: The Beatles, \"Tomorrow Never Knows\"]\n\nAnd finally, at the end, there's some tack piano playing from McCartney, inspired by the kind of joke piano parts that used to turn up on the Goon Show. This was just McCartney messing about in the studio, but it was caught on tape, and they asked for it to be included at the end of the track. It's only faintly audible on the standard mixes of the track, but there was actually an alternative mono mix which was only released on British pressings of the album pressed on the first day of its release, before George Martin changed his mind about which mix should have been used, and that has a much longer excerpt of the piano on it.\n\nI have to say that I personally like that mix more, and the extra piano at the end does a wonderful job of undercutting what could otherwise be an overly-serious track, in much the same way as the laughter at the end of \"Within You, Without You\", which they recorded the next year. The same goes for the title -- the track was originally called \"The Void\", and the tape boxes were labelled \"Mark One\", but Lennon decided to name the track after one of Starr's malapropisms, the same way they had with \"A Hard Day's Night\", to avoid the track being too pompous.\n\n[Excerpt: Beatles interview]\n\nA track like that, of course, had to end the album. Now all they needed to do was to record another thirteen tracks to go before it. But that -- and what they did afterwards, is a story for another time.\n\n[Excerpt, \"Tomorrow Never Knows (alternate mono mix)\" piano tag into theme music]",
  "itunes:subtitle": "This week’s episode looks at “Tomorrow Never Knows”, the making of Revolver by the Beatles, and the influence of Timothy Leary on the burgeoning psychedelic movement. Click the full post to read liner notes, links to more information, and a transcript of",
  "itunes:keywords": "Aldous Huxley,BBC Radiophonic Workshop,Geoff Emerick,George Harrison,George Martin,Indica Gallery,John Dunbar,John Lennon,Karlheinz Stockhausen,musique concrète,Paul McCartney,Peter Asher,Peter Sellers,Ram Dass,Ringo Starr,Rolf Harris,The Beatles,the Goons,The Kinks,The Yardbirds,Timothy Leary,Tiny Tim",
  "itunes:episodeType": "full",
  "itunes:episode": 145,
  "content:encoded": "This week’s episode looks at “Tomorrow Never Knows”, the making of <em>Revolver</em> by the Beatles, and the influence of Timothy Leary on the burgeoning psychedelic movement. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, <a href=\"https://www.patreon.com/posts/63391596\">on \"Keep on Running\" by the Spencer Davis Group.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Errata</strong>\n\nA few things -- I say \"Fairfield\" at one point when I mean \"Fairchild\". While Timothy Leary was imprisoned in 1970 he wasn't actually placed in the cell next to Charles Manson until 1973. Sources differ on when Geoff Emerick started at EMI, and he *may* not have worked on \"Sun Arise\", though I've seen enough reliable sources saying he did that I think it's likely. And I've been told that Maureen Cleave denied having an affair with Lennon -- though note that I said it was \"strongly rumoured\" rather than something definite.\n\n<strong>Resources</strong>\n\nAs usual, a mix of all the songs excerpted in this episode is available <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-145-tomorrow-never-knows/\">at Mixcloud.com.</a>\n\nI have read literally dozens of books on the Beatles, and used bits of information from many of them. All my Beatles episodes refer to: <a href=\"https://amzn.to/3tc1YzZ\"><em>The Complete Beatles Chronicle</em> by Mark Lewisohn</a>, <a href=\"https://amzn.to/3r70SUA\"><em>All The Songs: The Stories Behind Every Beatles Release</em> by Jean-Michel Guesdon</a>, <a href=\"https://amzn.to/3oyiWVN\"><em>And The Band Begins To Play: The Definitive Guide To The Songs of The Beatles </em>by Steve Lambley</a>, <a href=\"https://amzn.to/3r5ACd3\"><em>The Beatles By Ear</em> by Kevin Moore</a>, <a href=\"https://amzn.to/3j20800\"><em>Revolution in the Head</em> by Ian MacDonald</a>, and <a href=\"https://amzn.to/3tbphu4\"><em>The Beatles Anthology</em>.</a>\n\nFor this episode, I also referred to <a href=\"https://amzn.to/3IFDTci\"><em>Last Interview</em> by David Sheff,</a> a longform interview with John Lennon and Yoko Ono from shortly before Lennon's death; <a href=\"https://amzn.to/3pCtR44\"><em>Many Years From Now</em></a> by Barry Miles, an authorised biography of Paul McCartney; and <a href=\"https://amzn.to/36RVYWv\"><em>Here, There, and Everywhere: My Life Recording the Music of the Beatles</em></a> by Geoff Emerick and Howard Massey.\n\nFor information on Timothy Leary I used a variety of sources including <a href=\"https://amzn.to/35QbqSq\"><em>The Most Dangerous Man in America</em></a> by Bill Minutaglio and Steven L. Davis; <a href=\"https://amzn.to/3HK4tQ4\"><em>Timothy Leary: Outside Looking In</em></a> by Robert Forte; <a href=\"https://amzn.to/3IEjRip\"><em>The Starseed Signals</em></a> by Robert Anton Wilson; and especially <a href=\"https://amzn.to/35QbVfB\"><em>The Harvard Psychedelic Club</em> </a>by Don Lattin.\n\nI also referred to both <a href=\"https://amzn.to/3sJ7Q5S\"><em>The Tibetan Book of the Dead</em></a> and to <a href=\"https://amzn.to/3sIeKbq\"><em>The Psychedelic Experience</em></a>.\n\nLeary's much-abridged audiobook version of <em>The Psychedelic Experience</em> can be purchased from <a href=\"https://folkways.si.edu/timothy-leary/readings-from-the-book-the-psychedelic-experience-a-manual-based-on-the-tibetan-book-of-the-dead/documentary-prose/album/smithsonian\">Folkways Records</a>.\n\nSadly the first mono mix of \"Tomorrow Never Knows\" has been out of print since it was first issued. The only way to get the second mono mix is on <a href=\"https://amzn.to/2U0tGmS\">this ludicrously-expensive out-of-print box set,</a> but the stereo mix is easily available on <a href=\"https://amzn.to/34ibCtu\"><em>Revolver</em></a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nBefore I start this episode, I'd like to note that it deals with a number of subjects some listeners might find upsetting, most notably psychedelic drug use, mental illness, and suicide. I think I've dealt with those subjects fairly respectfully, but you still may want to check the transcript if you have worries about these subjects.\n\nAlso, we're now entering a period of music history with the start of the psychedelic era where many of the songs we're looking at are influenced by non-mainstream religious traditions, mysticism, and also increasingly by political ideas which may seem strange with nearly sixty years' hindsight. I'd just like to emphasise that when I talk about these ideas, I'm trying as best I can to present the thinking of the people I'm talking about, in an accurate and unbiased way, rather than talking about my own beliefs. We're going to head into some strange places in some of these episodes, and my intention is neither to mock the people I'm talking about nor to endorse their ideas, but to present those ideas to you the listener so you can understand the music, the history, and the mindset of the people involved,\n\nIs that clear? Then lets' turn on, tune in, and drop out back to 1955...\n\n[Opening excerpt from The Psychedelic Experience]\n\nThere is a phenomenon in many mystical traditions, which goes by many names, including the dark night of the soul and the abyss. It's an experience that happens to mystics of many types, in which they go through unimaginable pain near the beginning of their journey towards greater spiritual knowledge. That pain usually involves a mixture of internal and external events -- some terrible tragedy happens to them, giving them a new awareness of the world's pain, at the same time they're going through an intellectual crisis about their understanding of the world, and it can last several years. It's very similar to the more common experience of the mid-life crisis, except that rather than buying a sports car and leaving their spouse, mystics going through this are more likely to found a new religion. At least, those who survive the crushing despair intact. Those who come out of the experience the other end often find themselves on a totally new path, almost like they're a different person.\n\nIn 1955, when Dr. Timothy Leary's dark night of the soul started, he was a respected academic psychologist, a serious scientist who had already made several substantial contributions to his field, and was considered a rising star. By 1970, he would be a confirmed mystic, sentenced to twenty years in prison, in a cell next to Charles Manson, and claiming to different people that he was the reincarnation of Gurdjieff, Aleister Crowley, and Jesus Christ.\n\nIn the fifties, Leary and his wife had an open relationship, in which they were both allowed to sleep with other people, but weren't allowed to form emotional attachments to them. Unfortunately, Leary *had* formed an emotional attachment to another woman, and had started spending so much time with her that his wife was convinced he was going to leave her. On top of that, Leary was an alcoholic, and was prone to get into drunken rows with his wife.\n\nHe woke up on the morning of his thirty-fifth birthday, hung over after one of those rows, to find that she had died by suicide while he slept, leaving a note saying that she knew he was going to leave her and that her life would be meaningless without him.\n\nThis was only months after Leary had realised that the field he was working in, to which he had devoted his academic career, was seriously broken. Along with a colleague, Frank Barron, he published a paper on the results of clinical psychotherapy, \"Changes in psychoneurotic patients with and without psychotherapy\" which analysed the mental health of a group of people who had been through psychotherapy, and found that a third of them improved, a third stayed the same, and a third got worse. The problem was that there was a control group, of people with the same conditions who were put on a waiting list and told to wait the length of time that the therapy patients were being treated. A third of them improved, a third stayed the same, and a third got worse.\n\nIn other words, psychotherapy as it was currently practised had no measurable effect at all on patients' health.\n\nThis devastated Leary, as you might imagine. But more through inertia than anything else, he continued working in the field, and in 1957 he published what was regarded as a masterwork -- his book Interpersonal Diagnosis of Personality: A Functional Theory and Methodology for Personality Evaluation.\n\nLeary's book was a challenge to the then-dominant idea in psychology, behaviourism, which claimed that it made no sense to talk about anyone's internal thoughts or feelings -- all that mattered was what could be measured, stimuli and responses, and that in a very real sense the unmeasurable thoughts people had didn't exist at all. Behaviourism looked at every human being as a mechanical black box, like a series of levers.\n\nLeary, by contrast, analysed human interactions as games, in which people took on usual roles, but were able, if they realised this, to change the role or even the game itself. It was very similar to the work that Eric Berne was doing at the same time, and which would later be popularised in Berne's book Games People Play. Berne's work was so popular that it led to the late-sixties hit record \"Games People Play\" by Joe South:\n\n[Excerpt: Joe South: \"Games People Play\"]\n\nBut in 1957, between Leary and Berne, Leary was considered the more important thinker among his peers -- though some thought of him as more of a showman, enthralled by his own ideas about how he was going to change psychology, than a scientist, and some thought that he was unfairly taking credit for the work of lesser-known but better researchers.\n\nBut by 1958, the effects of the traumas Leary had gone through a couple of years earlier were at their worst. He was starting to become seriously ill -- from the descriptions, probably from something stress-related and psychosomatic -- and he took his kids off to Europe, where he was going to write the great American novel. But he rapidly ran through his money, and hadn't got very far with the novel. He was broke, and ill, and depressed, and desperate, but then in 1959 his old colleague Frank Barron, who was on holiday in the area, showed up, and the two had a conversation that changed Leary's life forever in multiple ways.\n\nThe first of the conversational topics would have the more profound effect, though that wouldn't be apparent at first. Barron talked to Leary about his previous holiday, when he'd visited Mexico and taken psilocybin mushrooms. These had been used by Mexicans for centuries, but the first publication about them in English had only been in 1955 -- the same year when Leary had had other things on his mind -- and they were hardly known at all outside Mexico. Barron talked about the experience as being the most profound, revelatory, experience of his life. Leary thought his friend sounded like a madman, but he humoured him for the moment.\n\nBut Barron also mentioned that another colleague was on holiday in the same area. David McClelland, head of the Harvard Center for Personality Research, had mentioned to Barron that he had just read Diagnosis of Personality and thought it a work of genius. McClelland hired Leary to work for him at Harvard, and that was where Leary met Ram Dass.\n\n[Excerpt from \"The Psychedelic Experience\"]\n\nRam Dass was not the name that Dass was going by at the time -- he was going by his birth name, and only changed his name a few years later, after the events we're talking about -- but as always, on this podcast we don't use people's deadnames, though his is particularly easy to find as it's still the name on the cover of his most famous book, which we'll be talking about shortly.\n\nDass was another psychologist at the Centre for Personality Research, and he would be Leary's closest collaborator for the next several years. The two men would become so close that at several points Leary would go travelling and leave his children in Dass' care for extended periods of time. The two were determined to revolutionise academic psychology.\n\nThe start of that revolution didn't come until summer 1960. While Leary was on holiday in Cuernavaca in Mexico, a linguist and anthropologist he knew, Lothar Knauth, mentioned that one of the old women in the area collected those magic mushrooms that Barron had been talking about. Leary decided that that might be a fun thing to do on his holiday, and took a few psilocybin mushrooms.\n\nThe effect was extraordinary. Leary called this, which had been intended only as a bit of fun, \"the deepest religious experience of my life\".\n\n[Excerpt from \"The Psychedelic Experience\"]\n\nHe returned to Harvard after his summer holiday and started what became the Harvard Psilocybin Project. Leary and various other experimenters took controlled doses of psilocybin and wrote down their experiences, and Leary believed this would end up revolutionising psychology, giving them insights unattainable by other methods. The experimenters included lecturers, grad students, and people like authors Allen Ginsberg and William Burroughs, jazz trumpeter Maynard Ferguson, and Alan Watts, who popularised Zen Buddhism in the West.\n\nDass didn't join the project until early 1961 -- he'd actually been on the holiday with Leary, but had arrived a few days after the mushroom experiment, and nobody had been able to get hold of the old woman who knew where to find the mushrooms, so he'd just had to deal with Leary telling him about how great it was rather than try it himself.\n\nHe then spent a semester as a visiting scholar at Berkeley, so he didn't get to try his first trip until February 1961. Dass, on his first trip, first had a revelation about the nature of his own true soul, then decided at three in the morning that he needed to go and see his parents, who lived nearby, and tell them the good news. But there was several feet of snow, and so he decided he must save his parents from the snow, and shovel the path to their house. At three in the morning. Then he saw them looking out the window at him, he waved, and then started dancing around the shovel. He later said “Until that moment I was always trying to be the good boy, looking at myself through other people’s eyes. What did the mothers, fathers, teachers, colleagues want me to be? That night, for the first time, I felt good inside. It was OK to be me.”\n\nThe Harvard Psilocybin Project soon became the Harvard Psychedelic Project. The term \"psychedelic\", meaning \"soul revealing\", was coined by the British psychiatrist Humphrey Osmond, who had been experimenting with hallucinogens for years, and had guided Aldous Huxley on the mescaline trip described in The Doors of Perception. Osmond and Huxley had agreed that the term \"psychotomimetic\", in use at the time, which meant \"mimicking psychosis\", wasn't right -- it was too negative. They started writing letters to each other, suggesting alternative terms. Huxley came up with \"phanerothyme\", the Greek for \"soul revealing\", and wrote a little couplet to Osmond:\n\nTo make this trivial world sublime\n\nTake half a gramme of phanerothyme.\n\nOsmond countered with the Latin equivalent:\n\nTo fathom hell or soar angelic\n\nJust take a pinch of psychedelic\n\nOsmond also inspired Leary's most important experimental work of the early sixties. Osmond had got to know Bill W., the founder of Alcoholics Anonymous, and had introduced W. to LSD. W. had become sober after experiencing a profound spiritual awakening and a vision of white light while being treated for his alcoholism using the so-called \"belladonna cure\" -- a mixture of various hallucinogenic and toxic substances that was meant to cure alcoholism. When W. tried LSD, he found it replicated his previous spiritual experience and became very evangelistic about its use by alcoholics, thinking it could give them the same kind of awakening he'd had.\n\nLeary became convinced that if LSD could work on alcoholics, it could also be used to help reshape the personalities of habitual criminals and lead them away from reoffending. His idea for how to treat people was based, in part, on the ideas of transactional analysis. There is always a hierarchical relationship between a therapist and their patient, and that hierarchical relationship itself, in Leary's opinion, forced people into particular game roles and made it impossible for them to relate as equals, and thus impossible for the therapist to truly help the patient. So his idea was that there needed to be a shared bonding experience between patient and doctor. So in his prison experiments, he and the other people involved, including Ralph Metzner, one of his grad students, would take psilocybin *with* the patients.\n\nIn short-term follow-ups the patients who went through this treatment process were less depressed, felt better, and were only half as likely to reoffend as normal prisoners. But critics pointed out that the prisoners had been getting a lot of individual attention and support, and there was no control group getting that support without the psychedelics.\n\n[Excerpt: The Psychedelic Experience]\n\nAs the experiments progressed, though, things were becoming tense within Harvard. There was concern that some of the students who were being given psilocybin were psychologically vulnerable and were being put at real risk. There was also worry about the way that Leary and Dass were emphasising experience over analysis, which was felt to be against the whole of academia. Increasingly it looked like there was a clique forming as well, with those who had taken part in their experiments on the inside and looking down on those outside, and it looked to many people like this was turning into an actual cult. This was simply not what the Harvard psychology department was meant to be doing.\n\nAnd one Harvard student was out to shut them down for good, and his name was Andrew Weil.\n\nWeil is now best known as one of the leading lights in alternative health, and has made appearances on Oprah and Larry King Live, but for many years his research interest was in mind-altering chemicals -- his undergraduate thesis was on the use of nutmeg to induce different states of consciousness.\n\nAt this point Weil was an undergraduate, and he and his friend Ronnie Winston had both tried to get involved in the Harvard Psilocybin Project, but had been turned down -- while they were enthusiastic about it, they were also undergraduates, and Leary and Dass had agreed with the university that they wouldn't be using undergraduates in their project, and that only graduate students, faculty, and outsiders would be involved.\n\nSo Weil and Winston had started their own series of experiments, using mescaline after they'd been unable to get any psilocybin -- they'd contacted Aldous Huxley, the author of The Doors of Perception and an influence on Leary and Dass' experiments, and asked him where they could get mescaline, and he'd pointed them in the right direction.\n\nBut then Winston and Dass had become friends, and Dass had given Winston some psilocybin -- not as part of his experiments, so Dass didn't think he was crossing a line, but just socially. Weil saw this as a betrayal by Winston, who stopped hanging round with him once he became close to Dass, and also as a rejection of him by Dass and Leary. If they'd give Winston psilocybin, why wouldn't they give it to him?\n\nWeil was a writer for the Harvard Crimson, Harvard's newspaper, and he wrote a series of exposes on Leary and Dass for the Crimson. He went to his former friend Winston's father and told him \"Your son is getting drugs from a faculty member. If your son will admit to that charge, we’ll cut out your son’s name. We won’t use it in the article.\"  Winston did admit to the charge, under pressure from his father, and was brought to tell the Dean, saying to the Dean “Yes, sir, I did, and it was the most educational experience I’ve had at Harvard.”\n\nWeil wrote about this for the Crimson, and the story was picked up by the national media. Weil eventually wrote about Leary and Dass for Look magazine, where he wrote “There were stories of students and others using hallucinogens for seductions, both heterosexual and homosexual.”\n\nAnd this seems actually to have been a big part of Weil's motivation. While Dass and Winston always said that their relationship was purely platonic, Dass was bisexual, and Weil seems to have assumed his friend had been led astray by an evil seducer. This was at a time when homophobia and biphobia were even more prevalent in society than they are now, and part of the reason Leary and Dass fell out in the late sixties is that Leary started to see Dass' sexuality as evil and perverted and something they should be trying to use LSD to cure.\n\nThe experiments became a national scandal, and one of the reasons that LSD was criminalised a few years later. Dass was sacked for giving drugs to undergraduates; Leary had gone off to Mexico to get away from the stress, leaving his kids with Dass. He would be sacked for going off without permission and leaving his classes untaught.\n\nAs Leary and Dass were out of Harvard, they had to look for other sources of funding. Luckily, Dass turned William Mellon Hitchcock, the heir to the Mellon oil fortune, on to acid, and he and his brother Tommy and sister Peggy gave them the run of a sixty-four room mansion, named Millbrook. When they started there, they were still trying to be academics, but over the five years they were at Millbrook it became steadily less about research and more of a hippie commune, with regular visitors and long-term residents including Alan Ginsberg, William Burroughs, and the jazz musician Maynard Ferguson, who would later get a small amount of fame with jazz-rock records like his version of \"MacArthur Park\":\n\n[Excerpt: Maynard Ferguson, \"MacArthur Park\"]\n\nIt was at Millbrook that Leary, Dass, and Metzner would write the book that became The Psychedelic Experience.\n\nThis book was inspired by the Bardo Thödol, a book allegedly written by Padmasambhava, the man who introduced Buddhism to Tibet in the eighth century, though no copies of it are known to have existed before the fourteenth century, when it was supposedly discovered by Karma Lingpa.\n\nIts title translates as Liberation Through Hearing During the Intermediate State, but it was translated into English under the name The Tibetan Book of the Dead, as Walter Evans-Wentz, who compiled and edited the first English translation was, like many Westerners who studied Buddhism in the early part of the twentieth century, doing so because he was an occultist and a member of the Theosophical Society, which believes the secret occult masters of the world live in Tibet, but which also considered the Egyptian Book of the Dead -- a book which bears little relationship to the Bardo Thödol, and which was written thousands of years earlier on a different continent -- to be a major religious document. So it was through that lens that Evans-Wentz was viewing the Bardo Thödol, and he renamed the book to emphasise what he perceived as its similarities.\n\nPart of the Bardo Thödol is a description of what happens to someone between death and rebirth -- the process by which the dead person becomes aware of true reality, and then either transcends it or is dragged back into it by their lesser impulses -- and a series of meditations that can be used to help with that transcendence.\n\nIn the version published as The Tibetan Book of the Dead, this is accompanied by commentary from Evans-Wentz, who while he was interested in Buddhism didn't actually know that much about Tibetan Buddhism, and was looking at the text through a Theosophical lens, and mostly interpreting it using Hindu concepts.\n\nLater editions of Evans-Wentz's version added further commentary by Carl Jung, which looked at Evans-Wentz's version of the book through Jung's own lens, seeing it as a book about psychological states, not about anything more supernatural (although Jung's version of psychology was always a supernaturalist one, of course). His Westernised, psychologised, version of the book's message became part of the third edition.\n\nMetzner later said \"At the suggestion of Aldous Huxley and Gerald Heard we began using the Bardo Thödol ( Tibetan Book of the Dead) as a guide to psychedelic sessions. The Tibetan Buddhists talked about the three phases of experience on the “intermediate planes” ( bardos) between death and rebirth. We translated this to refer to the death and the rebirth of the ego, or ordinary personality. Stripped of the elaborate Tibetan symbolism and transposed into Western concepts, the text provided a remarkable parallel to our findings.\"\n\nLeary, Dass, and Metzner rewrote the book into a form that could be used to guide a reader through a psychedelic trip, through the death of their ego and its rebirth. Later, Leary would record an abridged audiobook version, and it's this that we've been hearing excerpts of during this podcast so far:\n\n[Excerpt: The Psychedelic Experience \"Turn off your mind, relax, float downstream\" about 04:15]\n\nWhen we left the Beatles, they were at the absolute height of their fame, though in retrospect the cracks had already begun to show.  Their second film had been released, and the soundtrack had contained some of their best work, but the title track, \"Help!\", had been a worrying insight into John Lennon's current mental state.\n\nImmediately after making the film and album, of course, they went back out touring, first a European tour, then an American one, which probably counts as the first true stadium tour.\n\nThere had been other stadium shows before the Beatles 1965 tour -- we talked way back in the first episodes of the series about how Sister Rosetta Tharpe had a *wedding* that was a stadium gig. But of course there are stadiums and stadiums, and the Beatles' 1965 tour had them playing the kind of venues that no other musician, and certainly no other rock band, had ever played.\n\nMost famously, of course, there was the opening concert of the tour at Shea Stadium, where they played to an audience of fifty-five thousand people -- the largest audience a rock band had ever played for, and one which would remain a record for many years. Most of those people, of course, couldn't actually hear much of anything -- the band weren't playing through a public address system designed for music, just playing through the loudspeakers that were designed for commentating on baseball games. But even if they had been playing through the kind of modern sound systems used today, it's unlikely that the audience would have heard much due to the overwhelming noise coming from the crowd. Similarly, there were no live video feeds of the show or any of the other things that nowadays make it at least possible for the audience to have some idea what is going on on stage.\n\nThe difference between this and anything that anyone had experienced before was so great that the group became overwhelmed. There's video footage of the show -- a heavily-edited version, with quite a few overdubs and rerecordings of some tracks was broadcast on TV, and it's also been shown in cinemas more recently as part of promotion for an underwhelming documentary about the Beatles' tours -- and you can see Lennon in particular becoming actually hysterical during the performance of \"I'm Down\", where he's playing the organ with his elbows. Sadly the audio nature of this podcast doesn't allow me to show Lennon's facial expression, but you can hear something of the exuberance in the performance.\n\nThis is from what is labelled as a copy of the raw audio of the show -- the version broadcast on TV had a fair bit of additional sweetening work done on it:\n\n[Excerpt: The Beatles, \"I'm Down (Live at Shea Stadium)\"]\n\nAfter their American tour they had almost six weeks off work to write new material before going back into the studio to record their second album of the year, and one which would be a major turning point for the group. The first day of the recording sessions for this new album, Rubber Soul, started with two songs of Lennon's. The first of these was \"Run For Your Life\", a song Lennon never later had much good to say about, and which is widely regarded as the worst song on the album. That song was written off a line from Elvis Presley's version of \"Baby Let's Play House\", and while Lennon never stated this, it's likely that it was brought to mind by the Beatles having met with Elvis during their US tour.\n\nBut the second song was more interesting. Starting with \"Help!\", Lennon had been trying to write more interesting lyrics. This had been inspired by two conversations with British journalists -- Kenneth Allsop had told Lennon that while he liked Lennon's poetry, the lyrics to his songs were banal in comparison and he found them unlistenable as a result, while Maureen Cleave, a journalist who was a close friend with Lennon, had told him that she hadn't noticed a single word in any of his lyrics with more than two syllables, so he made more of an effort with \"Help!\", putting in words like \"independence\" and \"insecure\". As he said in one of his last interviews, \"I was insecure then, and things like that happened more than once. I never considered it before. So after that I put a few words with three syllables in, but she didn’t think much of them when I played it for her, anyway.”\n\nCleave may have been an inspiration for \"Norwegian Wood (This Bird Has Flown)\". There are very strong rumours that Lennon had an affair with Cleave in the mid-sixties, and if that's true it would definitely fit into a pattern. Lennon had many, many, affairs during his first marriage, both brief one-night stands and deeper emotional attachments, and those emotional attachments were generally with women who were slightly older, intellectual, somewhat exotic looking by the standards of 1960s Britain, and in the arts. Lennon later claimed to have had an affair with Eleanor Bron, the Beatles' co-star in Help!, though she always denied this, and it's fairly widely established that he did have an affair with Alma Cogan, a singer who he'd mocked during her peak of popularity in the fifties, but who would later become one of his closest friends:\n\n[Excerpt: Alma Cogan, \"Why Do Fools Fall in Love?\"]\n\nAnd \"Norwegian Wood\", the second song recorded for Rubber Soul, started out as a confession to one of these affairs, a way of Lennon admitting it to his wife without really admitting it. The figure in the song is a slightly aloof, distant woman, and the title refers to the taste among Bohemian British people at the time for minimalist decor made of Scandinavian pine -- something that would have been a very obvious class signifier at the time.\n\n[Excerpt: The Beatles, \"Norwegian Wood (This Bird Has Flown)\"]\n\nLennon and McCartney had different stories about who wrote what in the song, and Lennon's own story seems to have changed at various times. What seems to have happened is that Lennon wrote the first couple of verses while on holiday with George Martin, and finished it off later with McCartney's help. McCartney seems to have come up with the middle eight melody -- which is in Dorian mode rather than the Mixolydian mode of the verses -- and to have come up with the twist ending, where the woman refuses to sleep with the protagonist and laughs at him, he goes to sleep in the bath rather than her bed, wakes up alone, and sets fire to the house in revenge.\n\nThis in some ways makes \"Norwegian Wood\" the thematic centrepiece of the album that was to result, combining several of the themes its two songwriters came back to throughout the album and the single recorded alongside it. Like Lennon's \"Run For Your Life\" it has a misogynistic edge to it, and deals with taking revenge against a woman, but like his song \"Girl\", it deals with a distant, unattainable, woman, who the singer sees as above him but who has a slightly cruel edge -- the kind of girl who puts you down when friends are there,  you feel a fool, is very similar to the woman who tells you to sit down but has no chairs in her minimalist flat. A big teaser who takes you half the way there is likely to laugh at you as you crawl off to sleep in the bath while she goes off to bed alone.\n\nMeanwhile, McCartney's two most popular contributions to the album, \"Michelle\" and \"Drive My Car\", also feature unattainable women, but are essentially comedy songs -- \"Michelle\" is a pastiche French song which McCartney used to play as a teenager while pretending to be foreign to impress girls, dug up and finished for the album, while \"Drive My Car\" is a comedy song with a twist in the punchline, just like \"Norwegian Wood\", though \"Norwegian Wood\"s twist is darker.\n\nBut \"Norwegian Wood\" is even more famous for its music than for its lyric. The basis of the song is Lennon imitating Dylan's style -- something that Dylan saw, and countered with \"Fourth Time Around\", a song which people have interpreted multiple ways, but one of those interpretations has always been that it's a fairly vicious parody of \"Norwegian Wood\":\n\n[Excerpt: Bob Dylan, \"Fourth Time Around\"]\n\nCertainly Lennon thought that at first, saying a few years later \"I was very paranoid about that. I remember he played it to me when he was in London. He said, what do you think? I said, I don’t like it. I didn’t like it. I was very paranoid. I just didn’t like what I felt I was feeling – I thought it was an out and out skit, you know, but it wasn’t. It was great. I mean he wasn’t playing any tricks on me. I was just going through the bit.\"\n\nBut the aspect of \"Norwegian Wood\" that has had more comment over the years has been the sitar part, played by George Harrison:\n\n[Excerpt: The Beatles, \"Norwegian Wood\"]\n\nThis has often been called the first sitar to be used on a rock record, and that may be the case, but it's difficult to say for sure. Indian music was very much in the air among British groups in September 1965, when the Beatles recorded the track. That spring, two records had almost simultaneously introduced Indian-influenced music into the pop charts. The first had been the Yardbirds' \"Heart Full of Soul\", released in June and recorded in April. In fact, the Yardbirds had actually used a sitar on their first attempt at recording the song, which if it had been released would have been an earlier example than the Beatles:\n\n[Excerpt: The Yardbirds, \"Heart Full of Soul (first version)\"]\n\nBut in the finished recording they had replaced that with Jeff Beck playing a guitar in a way that made it sound vaguely like a sitar, rather than using a real one:\n\n[Excerpt: The Yardbirds, \"Heart Full of Soul (single)\"]\n\nMeanwhile, after the Yardbirds had recorded that but before they'd released it, and apparently without any discussion between the two groups, the Kinks had done something similar on their \"See My Friends\", which came out a few weeks after the Yardbirds record:\n\n[Excerpt: The Kinks, \"See My Friends\"]\n\n(Incidentally, that track is sometimes titled \"See My Friend\" rather than \"See My Friends\", but that's apparently down to a misprint on initial pressings rather than that being the intended title).\n\nAs part of this general flowering of interest in Indian music, George Harrison had become fascinated with the sound of the sitar while recording scenes in Help! which featured some Indian musicians. He'd then, as we discussed in the episode on \"Eight Miles High\" been introduced by David Crosby on the Beatles' summer US tour to the music of Ravi Shankar.\n\n\"Norwegian Wood\" likely reminded Harrison of Shankar's work for a couple of reasons. The first is that the melody is very modal -- as I said before, the verses are in Mixolydian mode, while the middle eights are in Dorian -- and as we saw in the \"Eight Miles High\" episode Indian music is very modal.\n\nThe second is that for the most part, the verse is all on one chord -- a D chord as Lennon originally played it, though in the final take it's capoed on the second fret so it sounds in E. The only time the chord changes at all is on the words \"once had\" in the phrase “she once had me” where for one beat each Lennon plays a C9 and a G (sounding as a D9 and A). Both these chords, in the fingering Lennon is using, feel to a guitarist more like \"playing a D chord and lifting some fingers up or putting some down\" rather than playing new chords, and this is a fairly common way of thinking about stuff particularly when talking about folk and folk-rock music -- you'll tend to get people talking about the \"Needles and Pins\" riff as being \"an A chord where you twiddle your finger about on the D string\" rather than changing between A, Asus2, and Asus4.\n\nSo while there are chord changes, they're minimal and of a kind that can be thought of as \"not really\" chord changes, and so that may well have reminded Harrison of the drone that's so fundamental to Indian classical music.\n\nEither way, he brought in his sitar, and they used it on the track, both the version they cut on the first day of recording and the remake a week later which became the album track:\n\n[Excerpt: The Beatles, \"Norwegian Wood (This Bird Has Flown)\"]\n\nAt the same time as the group were recording Rubber Soul, they were also working on two tracks that would become their next single -- released as a double A-side because the group couldn't agree which of the two to promote. Both of these songs were actual Lennon/McCartney collaborations, something that was increasingly rare at this point. One, \"We Can Work it Out\" was initiated by McCartney, and like many of his songs of this period was inspired by tensions in his relationship with his girlfriend Jane Asher -- two of his other songs for Rubber Soul were \"I'm Looking Through You\" and \"You Won't See Me\".  The other, \"Day Tripper\",  was initiated by Lennon, and had other inspirations:\n\n[Excerpt: The Beatles, \"Day Tripper\"]\n\nJohn Lennon and George Harrison's first acid trip had been in spring of 1965, around the time they were recording Help!\n\nThe fullest version of how they came to try it I've read was in an interview George Harrison gave to Creem magazine in 1987, which I'll quote a bit of:\n\n\"I had a dentist who invited me and John and our ex-wives to dinner, and he had this acid he’d got off the guy who ran Playboy in London. And the Playboy guy had gotten it off, you know, the people who had it in America. What’s his name, Tim Leary. And this guy had never had it himself, didn’t know anything about it, but he thought it was an aphrodisiac and he had this girlfriend with huge breasts. He invited us down there with our blonde wives and I think he thought he was gonna have a scene. And he put it in our coffee without telling us—he didn’t take any himself. We didn’t know we had it, and we’d made an arrangement earlier—after we had dinner we were gonna go to this nightclub to see some friends of ours who were playing in a band. And I was saying, \"OK, let’s go, we’ve got to go,\" and this guy kept saying, \"No, don’t go, finish your coffee. Then, 20 minutes later or something, I’m saying, \"C’mon John, we’d better go now. We’re gonna miss the show.\" And he says we shouldn’t go ’cause we’ve had LSD.\"\n\nThey did leave anyway, and they had an experience they later remembered as being both profound and terrifying -- nobody involved had any idea what the effects of LSD actually were, and they didn't realise it was any different from cannabis or amphetamines. Harrison later described feelings of universal love, but also utter terror -- believing himself to be in hell, and that world war III was starting.\n\nAs he said later \"We’d heard of it, but we never knew what it was about and it was put in our coffee maliciously. So it really wasn’t us turning each other or the world or anything—we were the victims of silly people.\"\n\nBut both men decided it was an experience they needed to have again, and one they wanted to share with their friends. Their next acid trip was the one that we talked about in the episode on \"Eight Miles High\", with Roger McGuinn, David Crosby, and Peter Fonda. That time Neil Aspinall and Ringo took part as well, but at this point Paul was still unsure about taking it -- he would later say that he was being told by everyone that it changed your worldview so radically you'd never be the same again, and he was understandably cautious about this.\n\nCertainly it had a profound effect on Lennon and Harrison -- Starr has never really talked in detail about his own experiences. Harrison would later talk about how prior to taking acid he had been an atheist, but his experiences on the drug gave him an unshakeable conviction in the existence of God -- something he would spend the rest of his life exploring.\n\nLennon didn't change his opinions that drastically, but he did become very evangelistic about the effects of LSD. And \"Day Tripper\" started out as a dig at what he later described as weekend hippies, who took acid but didn't change the rest of their lives -- which shows a certain level of ego in a man who had at that point only taken acid twice himself -- though in collaboration with McCartney it turned into another of the rather angry songs about unavailable women they were writing at this point. The line \"she's a big teaser, she took me half the way there\" apparently started as \"she's a prick teaser\":\n\n[Excerpt: The Beatles, \"Day Tripper\"]\n\nIn the middle of the recording of Rubber Soul, the group took a break to receive their MBEs from the Queen. Officially the group were awarded these because they had contributed so much to British exports. In actual fact, they received them because the Prime Minister, Harold Wilson, had a government with a majority of only four MPs and was thinking about calling an election to boost his majority. He represented a Liverpool constituency, and wanted to associate his Government and the Labour Party with the most popular entertainers in the UK.\n\n\"Day Tripper\" and \"We Can Work it Out\" got their TV premiere on a show recorded for Granada TV,  The Music of Lennon and McCartney, and fans of British TV trivia will be pleased to note that the harmonium Lennon plays while the group mimed \"We Can Work it Out\" in that show is the same one that was played in Coronation Street by Ena Sharples -- the character we heard last episode being Davy Jones' grandmother.\n\nAs well as the Beatles themselves, that show included other Brian Epstein artists like Cilla Black and Billy J Kramer singing songs that Lennon and McCartney had given to them, plus Peter Sellers, the Beatles' comedy idol, performing \"A Hard Day's Night\" in the style of Laurence Olivier as Richard III:\n\n[Excerpt: Peter Sellers, \"A Hard Day's Night\"]\n\nAnother performance on the show was by Peter and Gordon, performing a hit that Paul had given to them, one of his earliest songs:\n\n[Excerpt: Peter and Gordon, \"A World Without Love\"]\n\nPeter Asher, of Peter and Gordon, was the brother of Paul McCartney's girlfriend, the actor Jane Asher. And while the other three Beatles were living married lives in mansions in suburbia, McCartney at this point was living with the Asher family in London, and being introduced by them to a far more Bohemian, artistic, hip crowd of people than he had ever before experienced. They were introducing him to types of art and culture of which he had previously been ignorant, and while McCartney was the only Beatle so far who hadn't taken LSD, this kind of mind expansion was far more appealing to him. He was being introduced to art film, to electronic composers like Stockhausen, and to ideas about philosophy and art that he had never considered.\n\nPeter Asher was a friend of John Dunbar, who at the time was Marianne Faithfull's husband, though Faithfull had left him and taken up with Mick Jagger, and of Barry Miles, a writer, and in September 1965 the three men had formed a company, Miles, Asher and Dunbar Limited, or MAD for short, which had opened up a bookshop and art gallery, the Indica Gallery, which was one of the first places in London to sell alternative or hippie books and paraphernalia, and which also hosted art events by people like members of the Fluxus art movement.\n\nMcCartney was a frequent customer, as you might imagine, and he also encouraged the other Beatles to go along, and the Indica Gallery would play an immense role in the group's history, which we'll look at in a future episode.\n\nBut the first impact it had on the group was when John and Paul went to the shop in late 1965, just after the recording and release of Rubber Soul and the \"Day Tripper\"/\"We Can Work It Out\" single, and John bought a copy of The Psychedelic Experience by Leary, Dass, and Metzner. He read the book on a plane journey while going on holiday -- reportedly while taking his third acid trip -- and was inspired.\n\nWhen he returned, he wrote a song which became the first track to be recorded for the group's next album, Revolver:\n\n[Excerpt: The Beatles, \"Tomorrow Never Knows\"]\n\nThe lyrics were inspired by the parts of The Psychedelic Experience which were in turn inspired by the Tibetan Book of the Dead.\n\nNow, it's important to put it this way because most people who talk about this record have apparently never read the book which inspired it. I've read many, many, books on the Beatles which claim that The Psychedelic Experience simply *is* the Tibetan Book of the Dead, slightly paraphrased.\n\nIn fact, while the authors use the Tibetan Book of the Dead as a structure on which to base their book, much of the book is detailed descriptions of Leary, Dass, and Metzner's hypotheses about what is actually happening during a psychedelic trip, and their notes on the book -- in particular they provide commentaries to the commentaries, giving their view of what Carl Jung meant when he talked about it, and of Evans-Wentz's opinions, and especially of a commentary by Anagarika Govinda, a Westerner who had taken up Tibetan Buddhism seriously and become a monk and one of its most well-known exponents in the West. By the time it's been filtered through so many different viewpoints and perspectives, each rewriting and reinterpreting it to suit their own preconceived ideas, they could have started with a book on the habitat of the Canada goose and ended with much the same result.\n\nMuch of this is the kind of mixture between religious syncretism and pseudoscience that will be very familiar to anyone who has encountered New Age culture in any way, statements like \"The Vedic sages knew the secret; the Eleusinian Initiates knew it; the Tantrics knew it. In all their esoteric writings they whisper the message: It is possible to cut beyond ego-consciousness, to tune in on neurological processes which flash by at the speed of light, and to become aware of the enormous treasury of ancient racial knowledge welded into the nucleus of every cell in your body\".\n\nThis kind of viewpoint is one that has been around in one form or another since the nineteenth century religious revivals in America that led to Mormonism, Christian Science, and the New Thought. It's found today in books and documentaries like The Secret and the writings of people like Deepak Chopra, and the idea is always the same one -- people thousands of years ago had a lost wisdom that has only now been rediscovered through the miracle of modern science. This always involves a complete misrepresentation of both the lost wisdom and of the modern science.\n\nIn particular, Leary, Dass, and Metzner's book freely mixes between phrases that sound vaguely scientific, like \"There are no longer things and persons but only the direct flow of particles\", things that are elements of Tibetan Buddhism, and references to ego games and \"game-existence\" which come from Leary's particular ideas of psychology as game interactions. All of this is intermingled, and so the claims that some have made that Lennon based the lyrics on the Tibetan Book of the Dead itself are very wrong. Rather the song, which he initially called \"The Void\", is very much based on Timothy Leary.\n\nThe song itself was very influenced by Indian music. The melody line consists of only four notes -- E, G, C, and B flat, over a space of an octave:\n\n[Demonstrates]\n\nThis sparse use of notes is very similar to the pentatonic scales in a lot of folk music, but that B-flat makes it the Mixolydian mode, rather than the E minor pentatonic scale our ears at first make it feel like. The B-flat also implies a harmony change -- Lennon originally sang the whole song over one chord, a C, which has the notes C, E, and G in it, but a B-flat note implies instead a chord of C7 -- this is another one of those occasions where you just put one finger down to change the chord while playing, and I suspect that's what Lennon did:\n\n[Demonstrates]\n\nLennon's song was inspired by Indian music, but what he wanted was to replicate the psychedelic experience, and this is where McCartney came in. McCartney was, as I said earlier, listening to a lot of electronic composers as part of his general drive to broaden his mind, and in particular he had been listening to quite a bit of Karlheinz Stockhausen.\n\nStockhausen was a composer who had studied with Olivier Messiaen in the 1940s, and had then become attached to the Groupe de Recherche de Musique Concrète along with Messiaen, Pierre Boulez, Edgard Varese and others, notably Pierre Schaeffer and Pierre Henry.\n\nThese composers were interested in a specific style of music called musique concrète, a style that had been pioneered by Schaeffer. Musique concrète is music that is created from, or at least using, prerecorded sounds that have been electronically altered, rather than with live instruments. Often this would involve found sound -- music made not by instruments at all, but by combining recorded sounds of objects, like with the first major work of musique concrète, Pierre Schaeffer's Cinq études de bruits:\n\n[Excerpt: Pierre Schaeffer, \"Etude aux Chemins de faire\" (from Cinq études de bruits)]\n\nEarly on, musique concrète composers worked in much the same way that people use turntables to create dance music today -- they would have multiple record players, playing shellac discs, and a mixing desk, and they would drop the needle on the record players to various points, play the records backwards, and so forth.\n\nOne technique that Schaeffer had come up with was to create records with a closed groove, so that when the record finished, the groove would go back to the start -- the record would just keep playing the same thing over and over and over.\n\nLater, when magnetic tape had come into use, Schaeffer had discovered you could get the same effect much more easily by making an actual loop of tape, and had started making loops of tape whose beginnings were stuck to their ending -- again creating something that could keep going over and over.\n\nStockhausen had taken up the practice of using tape loops, most notably in a piece that McCartney was a big admirer of, Gesang der Jeunglinge:\n\n[Excerpt: Karlheinz Stockhausen, \"Gesang der Jeunglinge\"]\n\nMcCartney suggested using tape loops on Lennon's new song, and everyone was in agreement. And this is the point where George Martin really starts coming into his own as a producer for the group.\n\nMartin had always been a good producer, but his being a good producer had up to this point mostly consisted of doing little bits of tidying up and being rather hands-off. He'd scored the strings on \"Yesterday\", played piano parts, and made suggestions like speeding up \"Please Please Me\" or putting the hook of \"Can't Buy Me Love\" at the beginning. Important contributions, contributions that turned good songs into great records, but nothing that Tony Hatch or Norrie Paramor or whoever couldn't have done. Indeed, his biggest contribution had largely been *not* being a Hatch or Paramor, and not imposing his own songs on the group, letting their own artistic voices flourish.\n\nBut at this point Martin's unique skillset came into play. Martin had specialised in comedy records before his work with the Beatles, and he had worked with Peter Sellers and Spike Milligan of the Goons, making records that required a far odder range of sounds than the normal pop record:\n\n[Excerpt: The Goons, \"Unchained Melody\"]\n\nThe Goons' radio show had used a lot of sound effects created by the BBC Radiophonic Workshop, a department of the BBC that specialised in creating musique concrète, and Martin had also had some interactions with the Radiophonic Workshop. In particular, he had worked with Maddalena Fagandini of the Workshop on an experimental single combining looped sounds and live instruments, under the pseudonym \"Ray Cathode\":\n\n[Excerpt: Ray Cathode, \"Time Beat\"]\n\nHe had also worked on a record that is if anything even more relevant to \"Tomorrow Never Knows\". Unfortunately, that record is by someone who has been convicted of very serious sex offences. In this case, Rolf Harris, the man in question, was so well-known in Britain before his arrest, so beloved, and so much a part of many people's childhoods, that it may actually be traumatic for people to hear his voice knowing about his crimes. So while I know that showing the slightest consideration for my listeners' feelings will lead to a barrage of comments from angry old men calling me a \"woke snowflake\" for daring to not want to retraumatise vulnerable listeners, I'll give a little warning before I play the first of two segments of his recordings in a minute. When I do, if you skip forward approximately ninety seconds, you'll miss that section out.\n\nHarris was an Australian all-round entertainer, known in Britain for his novelty records, like the unfortunately racist \"Tie Me Kangaroo Down Sport\" -- which the Beatles later recorded with him in a non-racist version for a BBC session. But he had also, in 1960, recorded and released in Australia a song he'd written based on his understanding of Aboriginal Australian religious beliefs, and backed by Aboriginal musicians on didgeridoo. And we're going to hear that clip now:\n\n[Excerpt. Rolf Harris, \"Sun Arise\" original]\n\nEMI, his British label, had not wanted to release that as it was, so he'd got together with George Martin and they'd put together a new version, for British release. That had included a new middle-eight, giving the song a tiny bit of harmonic movement, and Martin had replaced the didgeridoos with eight cellos, playing a drone:\n\n[Excerpt: Rolf Harris, \"Sun Arise\", 1962 version ]\n\nOK, we'll just wait a few seconds for anyone who skipped that to catch up...\n\nNow, there are some interesting things about that track. That is a track based on a non-Western religious belief, based around a single drone -- the version that Martin produced had a chord change for the middle eight, but the verses were still on the drone -- using the recording studio to make the singer's voice sound different, with a deep, pulsating, drum sound, and using a melody with only a handful of notes, which doesn't start on the tonic but descends to it.\n\nSound familiar? Oh, and a young assistant engineer had worked with George Martin on that session in 1962, in what several sources say was their first session together, and all sources say was one of their first. That young assistant engineer was Geoff Emerick, who had now been promoted to the main engineer role, and was working his first Beatles session in that role on “Tomorrow Never Knows”. Emerick was young and eager to experiment, and he would become a major part of the Beatles' team for the next few years, acting as engineer on all their recordings in 1966 and 67, and returning in 1969 for their last album.\n\nTo start with, the group recorded a loop of guitar and drums, heavily treated:\n\n[Excerpt: \"Tomorrow Never Knows\", loop]\n\nThat loop was slowed down to half its speed, and played throughout:\n\n[Excerpt: \"Tomorrow Never Knows\", loop]\n\nOnto that the group overdubbed a second set of live drums and Lennon's vocal. Lennon wanted his voice to sound like the Dalai Lama singing from a mountaintop, or like thousands of Tibetan monks. Obviously the group weren't going to fly to Tibet and persuade monks to sing for them, so they wanted some unusual vocal effect.\n\nThis was quite normal for Lennon, actually. One of the odd things about Lennon is that while he's often regarded as one of the greatest rock vocalists of all time, he always hated his own voice and wanted to change it in the studio. After the Beatles' first album there's barely a dry Lennon solo vocal anywhere on any record he ever made. Either he would be harmonising with someone else, or he'd double-track his vocal, or he'd have it drenched in reverb, or some other effect -- anything to stop it sounding quite so much like him.\n\nAnd Geoff Emerick had the perfect idea. There's a type of speaker called a Leslie speaker, which was originally used to give Hammond organs their swirling sound, but which can be used with other instruments as well. It has two rotating speakers inside it, a bass one and a treble one, and it's the rotation that gives the swirling sound. Ken Townsend, the electrical engineer working on the record, hooked up the speaker from Abbey Road's Hammond organ to Lennon's mic, and Lennon was ecstatic with the sound:\n\n[Excerpt: The Beatles, \"Tomorrow Never Knows\", take one]\n\nAt least, he was ecstatic with the sound of his vocal, though he did wonder if it might be more interesting to get the same swirling effect by tying himself to a rope and being swung round the microphone\n\nThe rest of the track wasn't quite working, though, and they decided to have a second attempt. But Lennon had been impressed enough by Emerick that he decided to have a chat with him about music -- his way of showing that Emerick had been accepted. He asked if Emerick had heard the new Tiny Tim record -- which shows how much attention Lennon was actually paying to music at this point. This was two years before Tim's breakthrough with \"Tiptoe Through the Tulips\", and his first single (unless you count a release from 1963 that was only released as a 78, in the sixties equivalent of a hipster cassette-only release), a version of \"April Showers\" backed with \"Little Girl\" -- the old folk song also known as \"In the Pines\" or \"Where Did You Sleep Last Night?\":\n\n[Excerpt: Tiny Tim, \"Little Girl\"]\n\nUnfortunately for Emerick, he hadn't heard the record, and rather than just say so he tried bluffing, saying \"Yes, they're great\".\n\nLennon laughed at his attempt to sound like he knew what he was talking about, before explaining that Tiny Tim was a solo artist, though he did say \"Nobody's really sure if it's actually a guy or some drag queen\".\n\nFor the second attempt, they decided to cut the whole backing track live rather than play to a loop. Lennon had had trouble staying in sync with the loop, but they had liked the thunderous sound that had been got from slowing the tape down. As Paul talked with Ringo about his drum part, suggesting a new pattern for him to play, Emerick went down into the studio from the control room and made some adjustments. He first deadened the sound of the bass drum by sticking a sweater in it -- it was actually a promotional sweater with eight arms, made when the film Help! had been provisionally titled Eight Arms to Hold You, which Mal Evans had been using as packing material.\n\nHe then moved the mics much, much closer to the drums that EMI studio rules allowed -- mics can be damaged by loud noises, and EMI had very strict rules about distance, not allowing them within two feet of the drum kit. Emerick decided to risk his job by moving the mics mere inches from the drums, reasoning that he would probably have Lennon's support if he did this. He then put the drum signal through an overloaded Fairfield limiter, giving it a punchier sound than anything that had been recorded in a British studio up to that point:\n\n[Excerpt: The Beatles, \"Tomorrow Never Knows\", isolated drums]\n\nThat wasn't the only thing they did to make the record sound different though.  As well as Emerick's idea for the Leslie speaker, Ken Townsend had his own idea of how to make Lennon's voice sound different. Lennon had often complained about the difficulty of double-tracking his voice, and so Townsend had had an idea -- if you took a normal recording, fed it to another tape machine a few milliseconds out of sync with the first, and then fed it back into the first, you could create a double-tracked effect without having to actually double-track the vocal.\n\nTownsend suggested this, and it was used for the first time on the first half of \"Tomorrow Never Knows\", before the Leslie speaker takes over. The technique is now known as \"artificial double-tracking\" or ADT, but the session actually gave rise to another term, commonly used for a similar but slightly different tape-manipulation effect that had already been used by Les Paul among others. Lennon asked how they'd got the effect and George Martin started to explain, but then realised Lennon wasn't really interested in the technical details, and said \"we take the original image and we split it through a double-bifurcated sploshing flange\". From that point on, Lennon referred to ADT as \"flanging\", and the term spread, though being applied to the other technique.\n\n(Just as a quick aside, some people have claimed other origins for the term \"flanging\", and they may be right, but I think this is the correct story).\n\nOver the backing track they added tambourine and organ overdubs -- with the organ changing to a B flat chord when the vocal hits the B-flat note, even though the rest of the band stays on C -- and then a series of tape loops, mostly recorded by McCartney. There's a recording that circulates which has each of these loops isolated, played first forwards and then backwards at the speed they were recorded, and then going through at the speed they were used on the record, so let's go through these. There's what people call the \"seagull\" sound, which is apparently McCartney laughing, very distorted:\n\n[Excerpt: Tomorrow Never Knows loop]\n\nThen there's an orchestral chord:\n\n[Excerpt: Tomorrow Never Knows loop]\n\nA mellotron on its flute setting:\n\n[Excerpt: Tomorrow Never Knows loop]\n\nAnd on its string setting:\n\n[Excerpt: Tomorrow Never Knows loop]\n\nAnd a much longer loop of sitar music supplied by George:\n\n[Excerpt: Tomorrow Never Knows loop]\n\nEach of these loops were played on a different tape machine in a different part of Abbey Road -- they commandeered the entire studio complex, and got engineers to sit with the tapes looped round pencils and wine-glasses, while the Beatles supervised Emerick and Martin in mixing the loops into a single track. They then added a loop of a tamboura drone played by George, and the result was one of the strangest records ever released by a major pop group:\n\n[Excerpt: The Beatles, \"Tomorrow Never Knows\"]\n\nWhile Paul did add some backwards guitar -- some sources say that this is a cut-up version of his solo from George's song \"Taxman\", but it's actually a different recording, though very much in the same style -- they decided that they were going to have a tape-loop solo rather than a guitar solo:\n\n[Excerpt: The Beatles, \"Tomorrow Never Knows\"]\n\nAnd finally, at the end, there's some tack piano playing from McCartney, inspired by the kind of joke piano parts that used to turn up on the Goon Show. This was just McCartney messing about in the studio, but it was caught on tape, and they asked for it to be included at the end of the track. It's only faintly audible on the standard mixes of the track, but there was actually an alternative mono mix which was only released on British pressings of the album pressed on the first day of its release, before George Martin changed his mind about which mix should have been used, and that has a much longer excerpt of the piano on it.\n\nI have to say that I personally like that mix more, and the extra piano at the end does a wonderful job of undercutting what could otherwise be an overly-serious track, in much the same way as the laughter at the end of \"Within You, Without You\", which they recorded the next year. The same goes for the title -- the track was originally called \"The Void\", and the tape boxes were labelled \"Mark One\", but Lennon decided to name the track after one of Starr's malapropisms, the same way they had with \"A Hard Day's Night\", to avoid the track being too pompous.\n\n[Excerpt: Beatles interview]\n\nA track like that, of course, had to end the album. Now all they needed to do was to record another thirteen tracks to go before it. But that -- and what they did afterwards, is a story for another time.\n\n[Excerpt, \"Tomorrow Never Knows (alternate mono mix)\" piano tag into theme music]",
  "enclosure": "",
  "itunes:summary": "This week’s episode looks at “Tomorrow Never Knows”, the making of Revolver by the Beatles, and the influence of Timothy Leary on the burgeoning psychedelic movement. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, on \"Keep on Running\" by the Spencer Davis Group.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nErrata\n\nA few things -- I say \"Fairfield\" at one point when I mean \"Fairchild\". While Timothy Leary was imprisoned in 1970 he wasn't actually placed in the cell next to Charles Manson until 1973. Sources differ on when Geoff Emerick started at EMI, and he *may* not have worked on \"Sun Arise\", though I've seen enough reliable sources saying he did that I think it's likely. And I've been told that Maureen Cleave denied having an affair with Lennon -- though note that I said it was \"strongly rumoured\" rather than something definite.\n\nResources\n\nAs usual, a mix of all the songs excerpted in this episode is available at Mixcloud.com.\n\nI have read literally dozens of books on the Beatles, and used bits of information from many of them. All my Beatles episodes refer to: The Complete Beatles Chronicle by Mark Lewisohn, All The Songs: The Stories Behind Every Beatles Release by Jean-Michel Guesdon, And The Band Begins To Play: The Definitive Guide To The Songs of The Beatles by Steve Lambley, The Beatles By Ear by Kevin Moore, Revolution in the Head by Ian MacDonald, and The Beatles Anthology.\n\nFor this episode, I also referred to Last Interview by David Sheff, a longform interview with John Lennon and Yoko Ono from shortly before Lennon's death; Many Years From Now by Barry Miles, an authorised biography of Paul McCartney; and Here, There, and Everywhere: My Life Recording the Music of the Beatles by Geoff Emerick and Howard Massey.\n\nFor information on Timothy Leary I used a variety of sources including The Most Dangerous Man in America by Bill Minutaglio and Steven L. Davis; Timothy Leary: Outside Looking In by Robert Forte; The Starseed Signals by Robert Anton Wilson; and especially The Harvard Psychedelic Club by Don Lattin.\n\nI also referred to both The Tibetan Book of the Dead and to The Psychedelic Experience.\n\nLeary's much-abridged audiobook version of The Psychedelic Experience can be purchased from Folkways Records.\n\nSadly the first mono mix of \"Tomorrow Never Knows\" has been out of print since it was first issued. The only way to get the second mono mix is on this ludicrously-expensive out-of-print box set, but the stereo mix is easily available on Revolver.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nBefore I start this episode, I'd like to note that it deals with a number of subjects some listeners might find upsetting, most notably psychedelic drug use, mental illness, and suicide. I think I've dealt with those subjects fairly respectfully, but you still may want to check the transcript if you have worries about these subjects.\n\nAlso, we're now entering a period of music history with the start of the psychedelic era where many of the songs we're looking at are influenced by non-mainstream religious traditions, mysticism, and also increasingly by political ideas which may seem strange with nearly sixty years' hindsight. I'd just like to emphasise that when I talk about these ideas, I'm trying as best I can to present the thinking of the people I'm talking about, in an accurate and unbiased way, rather than talking about my own beliefs. We're going to head into some strange places in some of these episodes, and my intention is neither to mock the people I'm talking about nor to endorse their ideas, but to present those ideas to you the listener so you ca",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "This week’s episode looks at “Tomorrow Never Knows”, the making of Revolver by the Beatles, and the influence of Timothy Leary on the burgeoning psychedelic movement. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, on \"Keep on Running\" by the Spencer Davis Group.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nErrata\n\nA few things -- I say \"Fairfield\" at one point when I mean \"Fairchild\". While Timothy Leary was imprisoned in 1970 he wasn't actually placed in the cell next to Charles Manson until 1973. Sources differ on when Geoff Emerick started at EMI, and he *may* not have worked on \"Sun Arise\", though I've seen enough reliable sources saying he did that I think it's likely. And I've been ",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}