{
  "title": "Kristin Hannah on FOUR WINDS",
  "pubDate": "Thu, 12 Aug 2021 10:00:00 +0000",
  "guid": "c9625eca-ac9b-4612-9fe4-18bcd64cd724",
  "link": "http://pouredover.libsyn.com/kristin-hannah-on-four-winds",
  "itunes:image": "",
  "description": "<div>Vianne and Isabelle, Leni, Elsa: Millions of readers have fallen head-over-heels for the heroines of Kristin Hannah’s most recent blockbusters, each one an unforgettable literary page-turner combining character, story and emotional payoff. Kristin joins us on the show to take readers behind the scenes of three of her biggest books, her evolution as a writer and more. Featured books: The Four Winds, The Great Alone and The Nightingale by Kristin Hannah; We Begin at the End by Chris Whitaker (a B&N Book Club Pick); Lightning Strike by William Kent Krueger; The Nickel Boys and Harlem Shuffle by Colson Whitehead; The Hobbit by J.R.R. Tolkien; and Whose Names Are Unknown by Sanora Babb. Produced/Hosted by Miwa Messer and engineered by Harry Liang.<br /> <br /> Poured Over is available on Apple Podcasts, Spotify and Stitcher. New episodes land Tuesdays and Thursdays.</div> <div> </div> <div>Follow us here for new episodes every Tuesday and Thursday.</div>",
  "content:encoded": "Vianne and Isabelle, Leni, Elsa: Millions of readers have fallen head-over-heels for the heroines of Kristin Hannah’s most recent blockbusters, each one an unforgettable literary page-turner combining character, story and emotional payoff. Kristin joins us on the show to take readers behind the scenes of three of her biggest books, her evolution as a writer and more. Featured books: The Four Winds, The Great Alone and The Nightingale by Kristin Hannah; We Begin at the End by Chris Whitaker (a B&N Book Club Pick); Lightning Strike by William Kent Krueger; The Nickel Boys and Harlem Shuffle by Colson Whitehead; The Hobbit by J.R.R. Tolkien; and Whose Names Are Unknown by Sanora Babb. Produced/Hosted by Miwa Messer and engineered by Harry Liang.  Poured Over is available on Apple Podcasts, Spotify and Stitcher. New episodes land Tuesdays and Thursdays.   Follow us here for new episodes every Tuesday and Thursday.",
  "enclosure": "",
  "itunes:duration": "35:32",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Vianne and Isabelle, Leni, Elsa: Millions of readers have fallen head-over-heels for the heroines of Kristin Hannah’s most recent blockbusters, each one an unforgettable literary page-turner combining character, story and emotional payoff. Kristin...",
  "itunes:episodeType": "full"
}