{
  "id": "tag:blogger.com,1999:blog-8878620400258430757.post-6302077960687598761",
  "published": "2019-10-01T07:53:00.000-07:00",
  "updated": "2019-10-01T10:35:05.689-07:00",
  "category": "",
  "title": "My Path to Google - Caile Collins, Software Engineer",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\">Welcome to the 36th installment of our blog series “My Path to Google.” These are real stories from Googlers, interns, and alumni highlighting how they got to Google, what their roles are like, and even some tips on how to prepare for interviews.<br /><br />This special edition comes out just in time for the annual Grace Hopper Celebration of Women in Computing and features Caile Collins, a software engineer who interviewed for her current job at a previous GHC — and will be returning to #GHC19 this year as a Googler. Read On!<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-OvQO0SuFh5s/XZNkMCl5oDI/AAAAAAAAAqs/sDL7xlMd3EEXeuqaY4MF_Jr49ERHV2J1ACLcBGAsYHQ/s1600/cute%2Bpup.PNG\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"969\" data-original-width=\"730\" height=\"400\" src=\"https://1.bp.blogspot.com/-OvQO0SuFh5s/XZNkMCl5oDI/AAAAAAAAAqs/sDL7xlMd3EEXeuqaY4MF_Jr49ERHV2J1ACLcBGAsYHQ/s400/cute%2Bpup.PNG\" width=\"301\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><b>Can you tell us a bit about yourself?</b><br />I grew up in Buffalo, NY, home to Buffalo wings and Niagara Falls. I entered college as an English major, and I came out with a B.A. in Linguistics with minors in Computer Science and Spanish at Cornell University. When I’m not working, you can find me taking yoga and dance classes, walking dogs, embroidering/weaving/sewing (multi-threaded tasks!), and attending lots of musicals, plays, and comedy shows.<br /><br /><div style=\"text-align: left;\"><b>What’s your role at Google?</b></div>I am a software engineer working in Google Research on an early-stage project to help language learners achieve their goals. I was really eager to get involved with this project because it ties together my Linguistics background with my role as a product/infrastructure engineer.<br /><br />I had the chance to join the team from its inception, so it’s been really rewarding to watch it develop, and I’ve been able to be very hands-on and have a lot of impact since it started as such a small team. It’s also been interesting to work together with research engineers, user experience researchers, and product managers to figure out the best path for our project; it’s a very dynamic environment, and everyone contributes different perspectives.<br /><div style=\"text-align: left;\"><b><br /></b><b>Can you tell us about your decision to enter the process?</b></div>I originally wanted to be a speech pathologist; though I was taking more and more Computer Science classes (reaching beyond the requirements for the minor), it didn’t occur to me that I would ever pursue a career in that area. A friend of mine from my Natural Language Processing class encouraged me to come to an on-campus panel of female Google interns that she was going to be participating in (it became my introduction to Cornell’s Women in Computing Club). As I recall, the discussion centered around breaking down impostor syndrome; it clearly drove home the point well enough, because I went back to my dorm and applied to a dozen internships on a whim.<br /><br /><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto; text-align: center;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://1.bp.blogspot.com/-_LArMYaEJJ8/XZNk3fzfWjI/AAAAAAAAAq0/pHr21r0n3o8qk1sgS2GejRtoAD4Y-Rp0QCLcBGAsYHQ/s1600/team%2Bpic.PNG\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"914\" data-original-width=\"1219\" height=\"476\" src=\"https://1.bp.blogspot.com/-_LArMYaEJJ8/XZNk3fzfWjI/AAAAAAAAAq0/pHr21r0n3o8qk1sgS2GejRtoAD4Y-Rp0QCLcBGAsYHQ/s640/team%2Bpic.PNG\" width=\"640\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">Caile, her team, and Seattle’s Fremont Troll at a team offsite.</td></tr></tbody></table><b><br /></b><b>How did the recruitment process go for you?</b><br />I applied directly for my first internship, and then I interviewed in-person at the end of summer in order to come back for another internship the following year. During that summer, I learned I’d be attending the Grace Hopper Celebration of Women in Computing for the first time in October, and my Google recruiter said that I could do my final full-time interviews there. I was extremely anxious about interviewing so I decided to just jump in headfirst and do as many practice interviews as I could – with full-time engineers before my internship ended, with friends at school, and then with real companies at the career fair at school. It gradually became less scary.<br /><br />When I finally got to Grace Hopper, I showed up to the interview booth extremely early to make sure I’d know where to find it; I kept circling back there, and the recruiters would give me a friendly wave and chuckle because they knew they’d be seeing a lot of me until my interviews finally happened.<br /><br />Afterwards, it was really great to be able to relax and join in the celebration of Grace Hopper. I love being in female-driven environments, and having that at such a large scale, especially in my newly selected field of work, was pretty amazing. I particularly remember the keynote speeches were really inspiring; I was excited to hear Susan Wojcicki speak since I had met her that summer while interning on a team at YouTube.<br /><br /><div style=\"text-align: left;\"><div style=\"text-align: left;\"><b>Can you tell us about the resources you used to prepare for your interview or role?</b></div>Other than my very generous friends’ time and support, my most reliable resource was Programming Interviews Exposed. I’ve read it front-to-back more times than I can count, and I’ve lent it out to others since then. In my experience, working through problems alone in your head is very different from solving them out loud in front of someone, so it’s important to practice in a real interview-like setting, even if it’s just with your peers.<br /><div><br /></div><div style=\"text-align: left;\"><b>What do you wish you’d known when you started the process?</b></div></div>I wish I had known that software engineering isn’t all about what specific skills you already know, but largely about how much you’re willing to learn and adapt when tackling new challenges. Moreover, software engineering requires patience and communication to build an end-to-end product that’s meant to last. Those are great skills to have in all aspects of life, and they’ll help you on a microscale - debugging! - and a macroscale - launching!<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto; text-align: center;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://1.bp.blogspot.com/-FbE1CwsTaVs/XZNlU1hYvAI/AAAAAAAAAq8/3wy91ESwhSMW_LX_Hqy_Tg7cTU0dKJeVgCLcBGAsYHQ/s1600/weaving.PNG\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"940\" data-original-width=\"707\" height=\"320\" src=\"https://1.bp.blogspot.com/-FbE1CwsTaVs/XZNlU1hYvAI/AAAAAAAAAq8/3wy91ESwhSMW_LX_Hqy_Tg7cTU0dKJeVgCLcBGAsYHQ/s320/weaving.PNG\" width=\"240\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">When not writing code, Caile’s hobbies include other multi-threaded tasks like weaving!</td></tr></tbody></table><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><div style=\"text-align: left;\"><br /><b>What inspires you to come in every day?</b></div>I’ve had a lot of inspiring women in my life, from my mom, sister, and aunts, to my teachers and co-workers. In my career, I’ve been lucky to have met women who have shown me that (1) I can dare to be a software engineer, (2) I can do really well in this field by continuously learning and adapting, and (3) I can find community here.<br /><br />Once I started at Google full-time, I really want to pass that impact forward. I quickly got involved in intern mentoring. Beyond feeling very lucky to work on a project I’m personally interested in and that contributes positively to the world, I’m grateful for the opportunity to act as a mentor, while continuing to feel supported by those in my own life.<br /><div><br /></div><div style=\"text-align: left;\"><b>Do you have any tips you’d like to share with aspiring Googlers?</b></div><div><div>You don’t need to have been coding since you were twelve in order to be a great programmer. If you’re already studying it or working in it now, just think how much you’ve learned since you first started. I didn’t know Computer Science existed as a field until I heard that a friend was studying it in college.</div><div></div><div>Occasionally I’ll look back at early project notes and remember how little I initially knew about something that I’m now very knowledgeable about and comfortable with. Everybody has to start from somewhere, so just be patient with yourself and know that getting stuck is okay; you can always try again.</div><div><br /></div><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto; text-align: center;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://1.bp.blogspot.com/-LlbduNiAXEU/XZNnOcNS7DI/AAAAAAAAArQ/TO1wmR2IpS8YbQhgw_TZKi00yPn_ET0KgCLcBGAsYHQ/s1600/IMG_20190930_145602.jpg\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"1200\" data-original-width=\"1600\" height=\"480\" src=\"https://1.bp.blogspot.com/-LlbduNiAXEU/XZNnOcNS7DI/AAAAAAAAArQ/TO1wmR2IpS8YbQhgw_TZKi00yPn_ET0KgCLcBGAsYHQ/s640/IMG_20190930_145602.jpg\" width=\"640\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">The 2019 Grace Hopper Celebration of Women in Computing is underway!</td></tr></tbody></table><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><div><br /></div><div><br /></div><div><br /></div><div style=\"font-weight: bold;\"><br /></div></div></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google Students",
    "uri": "http://www.blogger.com/profile/15517669815238556768",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 14
}