{
  "title": "Machine Learning is not BS in Monitoring",
  "description": "<p>Recently I came across provocatively titled <a href=\"https://medium.com/the-opsee-blog/machine-learning-in-monitoring-is-bs-134e362faee2\">“Machine Learning in Monitoring is BS”</a> and decided to reply but the response came out longer than typical comment so I posted it separately.</p>\n\n<ol>\n  <li>\n    <p>Ambiguity of the data - true point. It’s impossible to build a single universal model that eats any data and alert when it’s wrong. But it’s possible to build different models for different cases with the help of humans. And yes, it’s possible for machine learning to find if a bump on EEG is good or bad, see <a href=\"https://www.kaggle.com/c/seizure-prediction\">Epilepsy Seizure Prediction Challenge</a></p>\n  </li>\n  <li>\n    <p>Multiplicity of variables. It’s true that mass of metrics doesn’t make a lot of sense without context but adding context back and applying dimensionality reduction methods (<a href=\"https://mabrek.github.io/blog/multivariate-svd-pca/\">SVD</a>) allows to reduce the mass into handful. If ECG of one cow is quite different from ECGs of all other cows then it’s quite likely to be sick.</p>\n  </li>\n  <li>\n    <p>User experience. Not all machine learning methods are opaque. <a href=\"https://en.wikipedia.org/wiki/Deep_learning\">Deep learning</a> and <a href=\"https://en.wikipedia.org/wiki/Gradient_boosting\">gradient boosting</a> models are black boxes but there are many interpretable models like <a href=\"https://en.wikipedia.org/wiki/Linear_regression\">regularized linear</a> and <a href=\"https://en.wikipedia.org/wiki/Logistic_regression\">logistic regression</a>. They can give answers like “sales tomorrow will be higher than the previous Monday because it’s a first working day after long holidays and sales are usually higher in that case”.</p>\n  </li>\n  <li>\n    <p>Visualization. Traditional monitoring that is built around dashboards and staring at graphs doesn’t scale. At the same time there are different ways to present loads of data in compact visual form that makes sense to human (like <a href=\"https://mabrek.github.io/blog/multivariate-mds-tsne\">MDS, T-SNE</a>). Machine learning  could be used to produce better visualization to help humans understand what’s going on.</p>\n  </li>\n</ol>\n\n<p>There is a lot of hype around machine learning and as it usually happens some of overhyped technologies fail to deliver. The same problem was faced by information security community as explained in “Secure because Math” (<a href=\"https://www.blackhat.com/docs/us-14/materials/us-14-Pinto-Secure-Because-Math-A-Deep-Dive-On-Machine-Learning-Based-Monitoring-WP.pdf\">pdf</a>, <a href=\"https://www.youtube.com/watch?v=TYVCVzEJhhQ\">video</a>) talk by <a href=\"https://twitter.com/alexcpsec\">@alexcpsec</a></p>\n\n<p>Machine learning is not a magic that would digest uncleaned and unlabeled metrics and point out when and how the system was broken. It’s rather a set of tools which when used appropriately will reduce manual labor for devops looking after production systems.</p>",
  "pubDate": "Sat, 09 Jan 2016 00:00:00 +0000",
  "link": "https://mabrek.github.io/blog/machine-learning-is-not-bs/",
  "guid": "https://mabrek.github.io/blog/machine-learning-is-not-bs/"
}