{
  "title": "When It Comes to Reducing Global Poverty, Bono Is Right and the Anti-Capitalists Are Wrong",
  "link": "https://www.aei.org/economics/when-it-comes-to-reducing-global-poverty-bono-is-right-and-the-anti-capitalists-are-wrong/",
  "dc:creator": "Josiah Johnson",
  "pubDate": "Wed, 26 Oct 2022 14:00:59 +0000",
  "category": [
    "Economic Fluctuations and Growth",
    "Economics",
    "Pethokoukis",
    "Capitalism",
    "Globalization",
    "Poverty"
  ],
  "guid": "https://www.aei.org/?p=1008663734",
  "description": "<p>Maybe you find U2 lead singer Bono to be a bit much, even for a rock star. That's fine, but to dislike Bono for his views on the best way to ameliorate global poverty is to run afoul of an objective truth: capitalist trade and globalization are the keys to lifting billions out of poverty.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/economics/when-it-comes-to-reducing-global-poverty-bono-is-right-and-the-anti-capitalists-are-wrong/\">When It Comes to Reducing Global Poverty, Bono Is Right and the Anti-Capitalists Are Wrong</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n",
  "content:encoded": "\n<p>The rock group U2 has sold some 175 million records globally, but I get that they might not be everybody’s cup of Irish tea. Maybe you don’t like their post-punk, anthemic music style. Maybe you think too many of their songs sound the same. Maybe you find lead singer Bono to be a bit much, even for a rock star. Whatever, one’s take in music is subjective. But to dislike Bono for his views on the best way to ameliorate global poverty is to run afoul of an objective truth and provable facts. The anti-capitalists on social media are all in a tizzy over these comments in a new <a href=\"https://www.nytimes.com/interactive/2022/10/24/magazine/bono-interview.html\" target=\"_blank\" rel=\"noreferrer noopener\">interview </a>with the <em>New York Times</em>:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>There’s a funny moment when you realize that as an activist: The off-ramp out of extreme poverty is, ugh, commerce, it’s entrepreneurial capitalism. I spend a lot of time in countries all over Africa, and they’re like, “Eh, we wouldn’t mind a little more globalization actually. I would point out that there has been a lot of progress over the years.” . . .&nbsp;Capitalism is a wild beast. We need to tame it. But globalization has brought more people out of poverty than any other -ism. If somebody comes to me with a better idea, I’ll sign up. I didn’t grow up to like the idea that we’ve made heroes out of businesspeople, but if you’re bringing jobs to a community and treating people well, then you are a hero.</p></blockquote>\n\n\n\n<p>This should be an uncontroversial view, and it is among most economists. As the World Bank <a href=\"https://blogs.worldbank.org/developmenttalk/trade-has-been-global-force-less-poverty-and-higher-incomes\" target=\"_blank\" rel=\"noreferrer noopener\">noted</a> in 2017,&nbsp;“Trade and global integration have raised incomes across the world, while dramatically cutting poverty and global inequality.” And now this beautiful chart from Our World In Data:</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh4.googleusercontent.com/XBqz4vQThYdMKMr48DtGaLMKDCR7zBZFOpFHinYhcTiW66C4rR076iinlsQQJC4ClaKUssMXllpNajah-qqf3ZRk8X7iPUAi0QH8JA3I5O8jquAxzTNZDNoTIT1vxb0TBYEvBUQEw8zzgItLd2dvCZLIkniRUw_WKjwy5cmHcAlmAbqu4vLykrmEww\" alt=\"\"/></figure>\n\n\n\n<p>I love this bit from economist Deirdre McCloskey in<em> </em><a href=\"https://www.amazon.com/Bourgeois-Dignity-Economics-Explain-Modern/dp/0226556654/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=&sr=\"><em>Bourgeois Dignity: Why Economics Can&#8217;t Explain the Modern World</em></a>:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Innovation backed by liberal economic ideas has made billions of poor people pretty well off, without hurting other people.&nbsp;By now the pretty good innovation has helped quite a few people even in China and India. . . . The Big Economic Story of our own times is that the Chinese in 1978 and then the Indians in 1991 adopted opted liberal ideas in the economy, and came to attribute a dignity and a liberty to the bourgeoisie formerly denied. And then China and India exploded in economic growth. The important moral, therefore, is that in achieving a pretty good life for the mass of humankind, and a chance at a fully human existence, ideas have mattered more than the usual material causes. As the economic historian Joel Mokyr put it recently in the opening sentence of one of his luminous books, &#8220;Economic change in all periods depends, more than most economists think, on what people believe.&#8221;5 The Big Story of the past two hundred years is the innovation after 1700 or 1800 around the North Sea, and recently in once poor places like Taiwan or Ireland, and most noticeably now in the world&#8217;s biggest tyranny and the world&#8217;s biggest democracy. It has given many formerly poor and ignorant people the scope to flourish. And contrary to the usual declarations of the economists since Adam Smith or Karl Marx, the Biggest Economic Story was not caused by trade or investment or exploitation. It was caused by ideas.</p></blockquote>\n\n\n\n<p>One could be deliberately obtuse and ignore these facts, of course. But polling shows that many people <a href=\"https://www.aei.org/economics/extreme-poverty-declining-americans-have-no-idea/\" target=\"_blank\" rel=\"noreferrer noopener\">really don’t know</a> about both the decline in global poverty and why it happened. Then again, it’s been happening for decades. So everybody probably should know by this time. Bono obviously does. And so should you.</p>\n\n\n\n<div class=\"related-items shortcode \"><p><strong>Learn more: </strong><a href=\"https://www.aei.org/economics/some-thoughts-on-moving-beyond-neoliberal-globalization/\">Some Thoughts on Moving Beyond \"Neoliberal Globalization\"</a> | <a href=\"https://www.aei.org/economics/a-few-thoughts-about-capitalism-and-inequality/\"><strong>A Few Thoughts About Capitalism and Inequality&nbsp;</strong></a> | <a href=\"https://www.aei.org/pethokoukis/more-on-the-trade-offs-of-rejecting-nuclear-energy/\">More on the Trade-Offs of Rejecting Nuclear Energy</a> | <a href=\"https://www.aei.org/economics/housing-prices-and-elections/\">Housing Prices and Elections</a></p></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/economics/when-it-comes-to-reducing-global-poverty-bono-is-right-and-the-anti-capitalists-are-wrong/\">When It Comes to Reducing Global Poverty, Bono Is Right and the Anti-Capitalists Are Wrong</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n"
}