{
  "title": "3 Strategic Mistakes Leaders Can Easily Avoid When Thinking About AI Integration",
  "link": "https://kavita-ganesan.com/ai-leadership-mistakes/",
  "comments": "https://kavita-ganesan.com/ai-leadership-mistakes/#respond",
  "dc:creator": "Kavita Ganesan",
  "pubDate": "Fri, 09 Sep 2022 17:17:45 +0000",
  "category": [
    "AI Strategy",
    "Business AI",
    "ai for leaders",
    "ai in business",
    "ai mistakes",
    "ai strategy"
  ],
  "guid": "https://kavita-ganesan.com/?p=8204",
  "description": "Rushing through AI integration can result in unintended failures. Learn 3 AI integration mistakes leaders can easily avoid to limit confusion, reduce waste, and truly reap the benefits from AI.   ",
  "content:encoded": "\n<p>Several years ago, a product manager at a tech company had a <strong>data collection problem</strong>: to scrape software security vulnerability data from multiple web sources, consolidate the vulnerabilities and store them in a database.<br><br>As this was an automation problem relating to data, the product manager (PM) immediately concluded that this was a <strong><em><a href=\"https://kavita-ganesan.com/common-ai-problem-types-cheat-sheet/\">machine learning problem</a></em></strong>. The PM then “hired” the company’s data science team to build ML models to solve the problem.&nbsp;</p>\n\n\n\n<p>The data science team agreed to the <a href=\"https://kavita-ganesan.com/machine-learning-training-data-generation/\">data collection task</a> without making any promises on “models.” They realized that their attempts to educate the PM that this <strong><em>was a simple script</em></strong> (not a sophisticated ML model) would be a losing battle as there was a big internal push to use AI, and the PM was sold on the idea.</p>\n\n\n\n<p>Several weeks passed, and when the time came to “deploy” the models, there wasn’t a model to be deployed. Just a software script that would continually read specific webpages, heuristically scrape security vulnerability entries and populate them into a database.&nbsp;</p>\n\n\n\n<p>Although the PM was eventually informed that no ML models were used or necessary, the scraping software was sold to the entire company as a machine learning powered security solution.&nbsp;</p>\n\n\n\n<p>This is not uncommon.&nbsp;</p>\n\n\n\n<p>Such <strong>confusion </strong>around AI and where it’s best employed happens more often than we think. In the case of this tech firm, the confusion didn’t do much damage as it was a small project, and the only thing wasted was the data science team’s precious time for that few weeks.&nbsp;&nbsp;</p>\n\n\n\n<p>In many other situations, the damage from such miscategorization, poor understanding of AI, and the use of wrong resources can be <strong>extremely costly</strong>.</p>\n\n\n\n<p>Imagine if the data collection problem above was <strong>forced to use machine learning</strong>, although unnecessary. Maintaining an ML solution costs much more than a simple software script. Plus, if the project had gone on for an entire year, the data scientists would have been paid to solve a problem that a single contracted software engineer could&#8217;ve solved. More importantly, these data scientists could’ve been working on high-impact AI initiatives.&nbsp;</p>\n\n\n\n<p><br>Based on this story, let’s narrow down three strategic mistakes leaders can easily avoid to prevent confusion, reduce waste, and ensure that you’re genuinely reaping the<em> benefits from AI.</em></p>\n\n\n\n<p></p>\n\n\n\n<h2>3 Mistakes Leaders Can Avoid When Thinking About AI Integration</h2>\n\n\n\n<figure class=\"wp-block-image aligncenter size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"753\" src=\"https://kavita-ganesan.com/wp-content/uploads/ai-leadership-mistakes-to-avoid-1024x753.png\" alt=\"ai leadership mistakes to avoid\" class=\"wp-image-8240\" srcset=\"https://kavita-ganesan.com/wp-content/uploads/ai-leadership-mistakes-to-avoid-1024x753.png 1024w, https://kavita-ganesan.com/wp-content/uploads/ai-leadership-mistakes-to-avoid-300x221.png 300w, https://kavita-ganesan.com/wp-content/uploads/ai-leadership-mistakes-to-avoid-150x110.png 150w, https://kavita-ganesan.com/wp-content/uploads/ai-leadership-mistakes-to-avoid-768x565.png 768w, https://kavita-ganesan.com/wp-content/uploads/ai-leadership-mistakes-to-avoid-1536x1130.png 1536w, https://kavita-ganesan.com/wp-content/uploads/ai-leadership-mistakes-to-avoid.png 1794w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /></figure>\n\n\n\n<p class=\"has-text-align-center\">Summary of AI leadership mistakes to avoid</p>\n\n\n\n<h3><strong>#1: Expecting “Others” to Understand AI</strong></h3>\n\n\n\n<p>In 2018, industry research firm Gartner made a bold prediction—that 85% of AI projects will “not deliver.” This is a shocking prediction, given how important AI has become in recent years.&nbsp;</p>\n\n\n\n<p>One reason for this prediction is confusion among leaders on what AI is and what it can do.</p>\n\n\n\n<p>It&#8217;s a given that your technical teams need to understand AI. However, executives, technology leaders, and product managers looking to make AI an integral part of their business should also be well-versed with the technology.&nbsp;</p>\n\n\n\n<p>We’re not talking about getting into AI model development. Still, you need to know AI at the <em>right level </em>to be comfortable exploring the possibility of using AI to solve business problems.&nbsp;</p>\n\n\n\n<p>Further, this AI knowledge can be handy in several ways.</p>\n\n\n\n<ul><li><strong>Closing AI adoption gaps: </strong>Once you understand AI, you’ll start seeing the building blocks for preparing your organization for its adoption. You’ll start noticing gaps in your company infrastructure, cultural readiness, and talent pool, allowing you to develop strategies to lay the necessary foundation.</li><li><strong>Vendor selection and hiring: </strong>The AI knowledge will also help you when talking to AI vendors and job candidates, where you’ll be able to ask the right questions, separate the good from the bad, and make sound purchase and hiring decisions.</li><li><strong>Maximize investments:</strong> A breadth of AI understanding will also help you use the proper thought process and frameworks in evaluating which problems would benefit the most from AI, helping you solve the rest of the problems with alternative approaches. With this, you’re increasing the odds of seeing meaningful results from AI.</li></ul>\n\n\n\n<p></p>\n\n\n\n<h5 class=\"has-ast-global-color-4-background-color has-background\"><strong><span style=\"color: #ad2033;\" class=\"stk-highlight\">Take Action:</span></strong> If you’re a leader new to AI, <strong>start by building a foundation</strong> around understanding AI use cases, what it is, and what makes AI initiatives different from traditional software engineering. Understanding the <strong>misconceptions of the field</strong> and how to <strong>spot opportunities</strong> will also significantly help identify high-impact use cases. <br><br>You can get some of this information by reading <a href=\"https://www.google.com/search?q=ai+business+books\">relevant books</a> as well as industry reports from big consulting firms. Attending AI leadership seminars and presentations can also be helpful. Podcasts? I wouldn’t recommend podcasts to build your foundation. The scattered nature of podcasts can be confusing and should be supplemental knowledge once you have a general foundation.</h5>\n\n\n\n<h2>&nbsp;</h2>\n\n\n\n<h3><strong>#2: Expecting a Quick Financial Return from AI&nbsp;</strong></h3>\n\n\n\n<p>Yes, AI has the promise of cost savings and boosting revenues. Although you may observe an immediate financial impact for some problems, in most cases, you may never see a noticeable financial impact from AI, just from a single initiative.&nbsp;</p>\n\n\n\n<p>It may take multiple related initiatives coming together to change your financial trajectory, or it&#8217;s something you’ll observe over the long haul.&nbsp;</p>\n\n\n\n<p>So, when it comes to the ROI of AI, you need to focus on the benefits of employing AI (in the short term and long term). Ask these questions:</p>\n\n\n\n<ul><li>What <strong>immediate pain point</strong> would the AI solution ease for your organization?</li><li>What <strong>benefits </strong>would you see by addressing the pain point?</li><li>What’s the<strong> added advantage</strong> of an AI solution over a simpler one, such as a manual approach?</li></ul>\n\n\n\n<p>Answering such questions will clarify why AI is necessary and guide you in tracking the right business metrics</p>\n\n\n\n<p></p>\n\n\n\n<h5 class=\"has-ast-global-color-4-background-color has-background\"><span style=\"color: #ad2033;\" class=\"stk-highlight\"><strong>Take Action:</strong> </span>When you’re looking to track the success of AI, <strong>always start with metrics that tie into its direct impact </strong>first. Once this is well underway and delivering results, track metrics that relate to the longer-term implications, which can take months or even years to observe.&nbsp;</h5>\n\n\n\n<p></p>\n\n\n\n<h3><strong>#3: Leaving AI Completely in the Hands of Data Scientists</strong></h3>\n\n\n\n<p>In the rush to adopt AI, companies often start by hiring a team of data scientists. This happens long before leaders understand AI or have an AI strategy.</p>\n\n\n\n<p>These data scientists are then let loose on the data to discover potential AI opportunities. While several identified projects may be meaningful, many are better suited for publishing a research paper—not so much for creating value for the business.<br></p>\n\n\n\n<p>This is not entirely the fault of the data scientists. Data scientists newly brought in to solve AI problems for the company will have a limited view of the company’s business challenges.&nbsp;</p>\n\n\n\n<p>Exploring the data tells them nothing about the process and workflow inefficiencies in the company. Further, your company may not be collecting data for problems that would most benefit from AI. Instead of twiddling thumbs, these data scientists are left with no choice but to tackle “made-up” problems with relevant data.<br></p>\n\n\n\n<p>On the contrary, business unit leaders, executives, and domain experts deal with the organization&#8217;s daily challenges—whether it’s customer complaints, a media coverage issue, or friction in your business processes.&nbsp;</p>\n\n\n\n<p>These employees should be equally capable of spotting opportunities for automation and workflow augmentation with AI. They should feel empowered to bring relevant business problems for data scientists to solve.&nbsp;</p>\n\n\n\n<p>For companies to succeed with AI, there must be a deep collaboration between business leaders, domain experts, and their technical counterparts.</p>\n\n\n\n<p></p>\n\n\n\n<h5 class=\"has-ast-global-color-4-background-color has-background\"><strong><span style=\"color: #ad2033;\" class=\"stk-highlight\">Take Action:</span></strong> When you witness <strong>process inefficiencies, repetitive manual tasks, and lagging accuracy</strong> of existing software systems, start taking note. Have your team track current baseline performance numbers and determine if the problem relates to solving a complex decision-making task. Such problems are often great candidates for AI. Involve your technical experts to help study the problem further and determine if AI is a good fit and, if not, recommend alternate approaches.&nbsp;&nbsp;</h5>\n\n\n\n<p></p>\n\n\n\n<h2>How Will You Accelerate Your AI Adoption?</h2>\n\n\n\n<p>While many leaders believe that the success of AI adoption is in the excellence of their technical teams, in reality, it starts at the top.&nbsp;</p>\n\n\n\n<p>Executives and functional leaders deal with the everyday challenges that the organization faces. With a good AI understanding, they’re better positioned to <strong>recognize problems </strong>that AI will solve and consequently <strong>fund impactful initiatives.</strong> This, coupled with the <strong>right expectations and success metrics</strong>, will translate to better outcomes for the organization.</p>\n\n\n\n<p></p>\n\n\n\n<p></p>\n\n\n\n<p></p>\n\n\n\n<div class=\"inherit-container-width is-layout-constrained wp-block-group has-ast-global-color-4-background-color has-background\" style=\"border-style:dotted;border-width:1px;padding-top:10px;padding-right:10px;padding-bottom:10px;padding-left:10px\"><div class=\"wp-block-group__inner-container\">\n<h2>Keep Learning From Me:</h2>\n\n\n\n<ul><li><strong>Join my&nbsp;<a href=\"https://kavita-ganesan.com/blog\">AI Integrated newsletter</a>,&nbsp;</strong>which clears the AI confusion and teaches you how to successfully integrate AI to achieve profitability and growth in your business.</li><li><strong>Read&nbsp;&nbsp;<a href=\"http://amazon.aibusinesscasebook.com/?utm_source=newsletter&utm_medium=email&utm_campaign=why_starting_without_ai_improves_outcomes_even_if_ai_is_your_goal&utm_term=2022-08-19\" target=\"_blank\" rel=\"noreferrer noopener\">The Business Case for AI</a></strong>&nbsp;to learn applications, strategies, and best practices to be successful with AI (select companies using the book: government agencies, automakers like Mercedes Benz, beverage makers, and e-commerce companies such as Flipkart).</li></ul>\n</div></div>\n\n\n\n<p></p>\n\n\n\n<div class=\"inherit-container-width is-layout-constrained wp-block-group has-ast-global-color-2-color has-ast-global-color-4-background-color has-text-color has-background has-medium-font-size\" style=\"border-style:solid\"><div class=\"wp-block-group__inner-container\">\n<div class=\"inherit-container-width is-layout-constrained wp-block-group has-ast-global-color-5-background-color has-background\"><div class=\"wp-block-group__inner-container\">\n<h2 style=\"font-style:normal;font-weight:500\">Recommended Reading</h2>\n\n\n\n<ul class=\"has-medium-font-size\"><li><a href=\"https://kavita-ganesan.com/how-to-improve-ai-outcomes-in-business/\">Even if AI is your goal, why start without it to improve AI success</a></li><li><a href=\"https://kavita-ganesan.com/common-ai-problem-types-cheat-sheet/\">15 Common AI Problem Types</a></li></ul>\n</div></div>\n</div></div>\n",
  "wfw:commentRss": "https://kavita-ganesan.com/ai-leadership-mistakes/feed/",
  "slash:comments": 0,
  "post-id": 8204
}