{
  "title": "Brian Williams' Cringeworthy Retirement Speech",
  "itunes:title": "Brian Williams' Cringeworthy Retirement Speech",
  "pubDate": "Fri, 31 Dec 2021 06:25:38 +0000",
  "guid": "2e4fe623-75f1-4083-9d5d-b857d0341391",
  "link": "https://traffic.libsyn.com/secure/thejimmydoreshow/TJDS_20211231_Podcast_-_123021_9.23_PM.mp3",
  "itunes:image": "",
  "description": "<p>MSNBC anchor and noted stolen valor aficionado Brian Williams is leaving his show, 11th Hour, and his farewell announcement was equal parts self-aggrandizing, terrifying and elite-fluffing. Jimmy and comedian Kurt Metzger discuss the story.<br /> <br /> Plus a segment on the corporate capture of purported leftists on \"BreadTube\" with The Grayzone's Max Bluementhal.</p> <p>Also featuring Stef Zamorano and Mike MacRae! Phone calls from Joe Biden and Al Pacino!</p>",
  "content:encoded": "<p>MSNBC anchor and noted stolen valor aficionado Brian Williams is leaving his show, 11th Hour, and his farewell announcement was equal parts self-aggrandizing, terrifying and elite-fluffing. Jimmy and comedian Kurt Metzger discuss the story.  Plus a segment on the corporate capture of purported leftists on \"BreadTube\" with The Grayzone's Max Bluementhal.</p> <p>Also featuring Stef Zamorano and Mike MacRae! Phone calls from Joe Biden and Al Pacino!</p>",
  "enclosure": "",
  "itunes:duration": "01:06:57",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "MSNBC anchor and noted stolen valor aficionado Brian Williams is leaving his show, 11th Hour, and his farewell announcement was equal parts self-aggrandizing, terrifying and elite-fluffing. Jimmy and comedian Kurt Metzger discuss the story.  Plus a...",
  "itunes:episodeType": "full",
  "itunes:summary": "MSNBC anchor and noted stolen valor aficionado Brian Williams is leaving his show, 11th Hour, and his farewell announcement was equal parts self-aggrandizing, terrifying and elite-fluffing. Jimmy and comedian Kurt Metzger discuss the story. Plus a segment on the corporate capture of purported leftists on \"BreadTube\" with The Grayzone's Max Bluementhal. Also featuring Stef Zamorano and Mike MacRae! Phone calls from Joe Biden and Al Pacino!"
}