{
  "title": "Special Episode: All Eyes on Ukraine",
  "description": "<p>The ongoing situation around Ukraine has captivated headlines and investors alike. While the resolution remains unclear, we can begin to predict how markets would react to possible outcomes.</p><p><br></p><p><em>This presentation references actual or potential sanctions, which may prohibit U.S. persons from buying certain securities, making certain investments and/or engaging in other activities in or pertaining to Russia. The content of&nbsp;this presentation is for informational purposes and does not represent Morgan Stanley’s view as to whether or not any of the Persons, instruments or investments discussed are or will become subject to sanctions. Any references in this presentation to entities, debt or equity instruments that may be covered by such sanctions should not be read as recommending or advising as to any investment activities in relation to such entities or instruments. Audience members are solely responsible for ensuring that their investment activities in relation to any sanctioned entities and/or securities are carried out in compliance with applicable sanctions.</em></p><p><br></p><p>----- Transcript -----</p><p><strong>Michael Zezas </strong>Welcome to Thoughts on the Market. I'm Michael Zezas Head of U.S. Public Policy Research and Municipal Strategy for Morgan Stanley.</p><p><br></p><p><strong>Marina Zavolock </strong>And I'm Marina Zavalock, Head of Emerging Europe, Middle East, and Africa Equity Strategy at Morgan Stanley.</p><p><br></p><p><strong>Michael Zezas </strong>And on this special edition of the podcast, we'll be discussing ongoing developments around Ukraine and how markets might react to various outcomes. It's Thursday, February 17th at 9:00 a.m. in New York.</p><p><br></p><p><strong>Marina Zavolock </strong>And it's 2:00 p.m. in London.</p><p><br></p><p><strong>Michael Zezas </strong>So, Marina, we've spent a lot of time in recent weeks tracking developments in the ongoing situation around Ukraine, on whose border Russia's amassed a substantial military presence and there are warnings of a potential invasion. This would be no small event, potentially the largest military action in Europe since World War Two, with great risk to many people. Recent news has all sides continuing to express hope for a diplomatic solution, and let's hope that can be achieved. But for this podcast, we want to focus narrowly on the market's impact because this situation has been a key driver of recent moves in many global markets. So, let's keep it simple to start, which markets are most vulnerable to a military confrontation and why?</p><p><br></p><p><strong>Marina Zavolock </strong>So, of course, we see Ukrainian and Russian markets as most directly vulnerable. Ukraine is directly exposed from an economic perspective, and the Ukrainian market has more downside risks due to this direct fundamental exposure and the country's reliance on external financing as well. The risk for Russian markets are more related to sanctions, given the strong economic backdrop. There are various sanctions under discussion aimed firstly at deterring a Russian invasion of Ukraine. Should Russia invade, we would expect the U.S. and Europe to act quickly to impose new sanctions, both to impact Russia’s decision making and ability to sustain any invasion, while at the same time limiting the impact on global commodities and supply chains to the extent possible.</p><p><br></p><p><strong>Marina Zavolock </strong>The situation is, of course, very fluid, as you described. Sanctions have not yet been finalized, but I'll mention three of the material sanctions that are reportedly under discussion. First, SDN list sanctions on a number of Russian banks and possibly other Russian companies. This would mean US persons would be prohibited from dealing with these companies, be it in business transactions or trading of securities. Second, Export controls restricting the export of technology products containing U.S. made components or software to Russia.&nbsp;Third, New sovereign debt sanctions on the secondary market – adding to the primary market sanctions already in place – this could mean exclusion from large fixed income indices in a worst case.&nbsp;Overall, from a Russian stock market perspective, we see the Russian banking sector as potentially most exposed, given a number of banks appear targeted by SDN list sanctions, and would also be affected meaningfully by any ban on U.S. technology.</p><p><strong>&nbsp;</strong></p><p><strong>Michael Zezas </strong>So those outcomes seem pretty substantial here in terms of their impact. So obviously the outcome of this confrontation matters quite a bit. How do you think the stock markets you're tracking are set up to react to various outcomes, whether it be de-escalation from here or some form of further escalation?</p><p><br></p><p><strong>Marina Zavolock </strong>So to assess the risk reward for different Russian and Ukraine related assets and commodities, we published a framework earlier this year to outline these scenarios: de-escalation, limbo (where uncertainty persists), partial escalation, and material escalation. For Russian equities in particular, we use two key variables that investors tend to focus on: the market's implied cost of equity and dividend yield. On implied cost of equity, Russia currently trades at 19%, which is about in line with the peak seen around many prior escalation periods in geopolitics, such as during the 2018 probe into U.S. election interference. But it is below the 26% level reached following Crimea annexation in 2014. On dividend yield, Russia trades at extraordinary levels of 16% at current commodity prices. We've never seen such levels before for any major country, or Russia, historically.</p><p><s>&nbsp;</s></p><p><strong>Marina Zavolock </strong>So coming back to the scenarios. Using these two variables I outlined, analyzing historical geopolitical escalation periods for Russia, we see about 50% potential upside to Russian stocks in a de-escalation scenario and at least 30% downside in the event of material escalation. Russian equities are currently trading roughly in line with our 'limbo' scenario, meaning the market is assuming continued talks and uncertainty without a breakthrough agreement. It's also worth noting here that although Russian equities are down about 20% from their pre-geopolitical escalation highs in October, they have also recovered 20% from their recent lows. And at the lows, the Russian market was already pricing in a partial escalation in Ukraine.</p><p><br></p><p><strong>Michael Zezas </strong>So those are some pretty substantial differences based on different outcomes. What are some of the signposts or signals that you're watching for that might tell us what direction we're headed in?</p><p><br></p><p><strong>Marina Zavolock </strong>So for the de-escalation scenario to become evident, the key signpost we're watching for is a meaningful reduction in Russian troops on Ukraine's border. Earlier this week, Russia’s defense ministry announced that Russia would start a pullback of some ot its forces after completing military drills – we are watching whether troops are actually being withdrawn, and to what extent.&nbsp;The reason we're watching troop movements particularly closely is that when there was a related buildup of Russian troops on Ukraine's borders last spring, it was Russia's announcement of a meaningful troop removal and the subsequent move of troops that allowed the market to recover by about 40% over the following months.</p><p><br></p><p><strong>Marina Zavolock </strong>As for the escalation scenarios, of course, a further buildup of troops, any movement of troops across the border, any breakdown of ongoing talks with the West, these are all key signposts we're watching. We're also watching both local and international key government official commentary and news flow, which cover the situation differently. I'd also note that for those that aren't following all of these signposts very closely, the Russian equities market is rapidly reacting to developments, we think a step ahead of global markets, which have only recently begun to react to these risks.</p><p><br></p><p><strong>Michael Zezas </strong>And Marina, outside of Russian equities, are there other markets you're watching that could experience spillover effects?</p><p><br></p><p><strong>Marina Zavolock </strong>From a broader perspective, Russia is a key global exporter of various commodities. It's not just the well-known oil and European gas, but Russia also produces 37% of the world's palladium, which is essential for global autos manufacturing. It's a meaningful producer of nickel, aluminum, and a dozen other commodities. Many of these commodities recently started to rally, pricing in some risk premium on the back of the rise in global focus on these geopolitical risks. Our European equity strategist, Graham Secker, also anticipates European equities may be vulnerable to mid-single digit underperformance versus global equities in the case of escalation. That said, as I mentioned before, we see a low probability of spillover to these markets from a fundamental perspective. So, the impact is likely to be short term and more market sentiment driven in the case of escalation.</p><p><br></p><p><strong>Michael Zezas </strong>Alright so, even if we assume that perhaps the diplomatic solution takes hold. What are the risks that this could repeat itself again as an escalation and then de-escalation cycle? And what would that mean for your coverage universe?</p><p><br></p><p><strong>Marina Zavolock </strong>Even in a de-escalation scenario, long-term geopolitical risk to Russia will remain. I don't think the market will price these risks out quickly, and we've had increases in geopolitical risk and then de-escalation many times before since the 2014 Crimea invasion, and even before that. Regular investors in Russian markets have grown accustomed to these geopolitical risks. And there have been, over recent years, windows when Russian equities can have material returns, followed by sell offs on the back of increases in geopolitical tensions and incremental sanctions. That said, from 2014 lows to the recent peak in Russian equities, the Russian Equities Index has outperformed emerging markets by about 13% per year and returned 15% total, including dividends, per year. This is on the back of many structural drivers, like a tripling in dividend payout ratios over this time. In fact, recently, the Russian stock market has seen record levels of buybacks, dividend levels,&nbsp;and retail inflows.</p><p><br></p><p><strong>Michael Zezas </strong>Marina, thank you. This has been really insightful. Thank you for taking the time to talk.</p><p><br></p><p><strong>Marina Zavolock </strong>Thank you, Michael.</p><p><br></p><p><strong>Michael Zezas </strong>And thanks for listening. If you enjoy Thoughts on the Market, please be sure to rate and review us on the Apple Podcasts app. It helps more people find the show.</p>",
  "itunes:title": "Special Episode: All Eyes on Ukraine",
  "itunes:episodeType": "full",
  "itunes:episode": 557,
  "itunes:summary": "The ongoing situation around Ukraine has captivated headlines and investors alike. While the resolution remains unclear, we can begin to predict how markets would react to possible outcomes.",
  "content:encoded": "<p>The ongoing situation around Ukraine has captivated headlines and investors alike. While the resolution remains unclear, we can begin to predict how markets would react to possible outcomes.</p><p><br></p><p><em>This presentation references actual or potential sanctions, which may prohibit U.S. persons from buying certain securities, making certain investments and/or engaging in other activities in or pertaining to Russia. The content of&nbsp;this presentation is for informational purposes and does not represent Morgan Stanley’s view as to whether or not any of the Persons, instruments or investments discussed are or will become subject to sanctions. Any references in this presentation to entities, debt or equity instruments that may be covered by such sanctions should not be read as recommending or advising as to any investment activities in relation to such entities or instruments. Audience members are solely responsible for ensuring that their investment activities in relation to any sanctioned entities and/or securities are carried out in compliance with applicable sanctions.</em></p><p><br></p><p>----- Transcript -----</p><p><strong>Michael Zezas </strong>Welcome to Thoughts on the Market. I'm Michael Zezas Head of U.S. Public Policy Research and Municipal Strategy for Morgan Stanley.</p><p><br></p><p><strong>Marina Zavolock </strong>And I'm Marina Zavalock, Head of Emerging Europe, Middle East, and Africa Equity Strategy at Morgan Stanley.</p><p><br></p><p><strong>Michael Zezas </strong>And on this special edition of the podcast, we'll be discussing ongoing developments around Ukraine and how markets might react to various outcomes. It's Thursday, February 17th at 9:00 a.m. in New York.</p><p><br></p><p><strong>Marina Zavolock </strong>And it's 2:00 p.m. in London.</p><p><br></p><p><strong>Michael Zezas </strong>So, Marina, we've spent a lot of time in recent weeks tracking developments in the ongoing situation around Ukraine, on whose border Russia's amassed a substantial military presence and there are warnings of a potential invasion. This would be no small event, potentially the largest military action in Europe since World War Two, with great risk to many people. Recent news has all sides continuing to express hope for a diplomatic solution, and let's hope that can be achieved. But for this podcast, we want to focus narrowly on the market's impact because this situation has been a key driver of recent moves in many global markets. So, let's keep it simple to start, which markets are most vulnerable to a military confrontation and why?</p><p><br></p><p><strong>Marina Zavolock </strong>So, of course, we see Ukrainian and Russian markets as most directly vulnerable. Ukraine is directly exposed from an economic perspective, and the Ukrainian market has more downside risks due to this direct fundamental exposure and the country's reliance on external financing as well. The risk for Russian markets are more related to sanctions, given the strong economic backdrop. There are various sanctions under discussion aimed firstly at deterring a Russian invasion of Ukraine. Should Russia invade, we would expect the U.S. and Europe to act quickly to impose new sanctions, both to impact Russia’s decision making and ability to sustain any invasion, while at the same time limiting the impact on global commodities and supply chains to the extent possible.</p><p><br></p><p><strong>Marina Zavolock </strong>The situation is, of course, very fluid, as you described. Sanctions have not yet been finalized, but I'll mention three of the material sanctions that are reportedly under discussion. First, SDN list sanctions on a number of Russian banks and possibly other Russian companies. This would mean US persons would be prohibited from dealing with these companies, be it in business transactions or trading of securities. Second, Export controls restricting the export of technology products containing U.S. made components or software to Russia.&nbsp;Third, New sovereign debt sanctions on the secondary market – adding to the primary market sanctions already in place – this could mean exclusion from large fixed income indices in a worst case.&nbsp;Overall, from a Russian stock market perspective, we see the Russian banking sector as potentially most exposed, given a number of banks appear targeted by SDN list sanctions, and would also be affected meaningfully by any ban on U.S. technology.</p><p><strong>&nbsp;</strong></p><p><strong>Michael Zezas </strong>So those outcomes seem pretty substantial here in terms of their impact. So obviously the outcome of this confrontation matters quite a bit. How do you think the stock markets you're tracking are set up to react to various outcomes, whether it be de-escalation from here or some form of further escalation?</p><p><br></p><p><strong>Marina Zavolock </strong>So to assess the risk reward for different Russian and Ukraine related assets and commodities, we published a framework earlier this year to outline these scenarios: de-escalation, limbo (where uncertainty persists), partial escalation, and material escalation. For Russian equities in particular, we use two key variables that investors tend to focus on: the market's implied cost of equity and dividend yield. On implied cost of equity, Russia currently trades at 19%, which is about in line with the peak seen around many prior escalation periods in geopolitics, such as during the 2018 probe into U.S. election interference. But it is below the 26% level reached following Crimea annexation in 2014. On dividend yield, Russia trades at extraordinary levels of 16% at current commodity prices. We've never seen such levels before for any major country, or Russia, historically.</p><p><s>&nbsp;</s></p><p><strong>Marina Zavolock </strong>So coming back to the scenarios. Using these two variables I outlined, analyzing historical geopolitical escalation periods for Russia, we see about 50% potential upside to Russian stocks in a de-escalation scenario and at least 30% downside in the event of material escalation. Russian equities are currently trading roughly in line with our 'limbo' scenario, meaning the market is assuming continued talks and uncertainty without a breakthrough agreement. It's also worth noting here that although Russian equities are down about 20% from their pre-geopolitical escalation highs in October, they have also recovered 20% from their recent lows. And at the lows, the Russian market was already pricing in a partial escalation in Ukraine.</p><p><br></p><p><strong>Michael Zezas </strong>So those are some pretty substantial differences based on different outcomes. What are some of the signposts or signals that you're watching for that might tell us what direction we're headed in?</p><p><br></p><p><strong>Marina Zavolock </strong>So for the de-escalation scenario to become evident, the key signpost we're watching for is a meaningful reduction in Russian troops on Ukraine's border. Earlier this week, Russia’s defense ministry announced that Russia would start a pullback of some ot its forces after completing military drills – we are watching whether troops are actually being withdrawn, and to what extent.&nbsp;The reason we're watching troop movements particularly closely is that when there was a related buildup of Russian troops on Ukraine's borders last spring, it was Russia's announcement of a meaningful troop removal and the subsequent move of troops that allowed the market to recover by about 40% over the following months.</p><p><br></p><p><strong>Marina Zavolock </strong>As for the escalation scenarios, of course, a further buildup of troops, any movement of troops across the border, any breakdown of ongoing talks with the West, these are all key signposts we're watching. We're also watching both local and international key government official commentary and news flow, which cover the situation differently. I'd also note that for those that aren't following all of these signposts very closely, the Russian equities market is rapidly reacting to developments, we think a step ahead of global markets, which have only recently begun to react to these risks.</p><p><br></p><p><strong>Michael Zezas </strong>And Marina, outside of Russian equities, are there other markets you're watching that could experience spillover effects?</p><p><br></p><p><strong>Marina Zavolock </strong>From a broader perspective, Russia is a key global exporter of various commodities. It's not just the well-known oil and European gas, but Russia also produces 37% of the world's palladium, which is essential for global autos manufacturing. It's a meaningful producer of nickel, aluminum, and a dozen other commodities. Many of these commodities recently started to rally, pricing in some risk premium on the back of the rise in global focus on these geopolitical risks. Our European equity strategist, Graham Secker, also anticipates European equities may be vulnerable to mid-single digit underperformance versus global equities in the case of escalation. That said, as I mentioned before, we see a low probability of spillover to these markets from a fundamental perspective. So, the impact is likely to be short term and more market sentiment driven in the case of escalation.</p><p><br></p><p><strong>Michael Zezas </strong>Alright so, even if we assume that perhaps the diplomatic solution takes hold. What are the risks that this could repeat itself again as an escalation and then de-escalation cycle? And what would that mean for your coverage universe?</p><p><br></p><p><strong>Marina Zavolock </strong>Even in a de-escalation scenario, long-term geopolitical risk to Russia will remain. I don't think the market will price these risks out quickly, and we've had increases in geopolitical risk and then de-escalation many times before since the 2014 Crimea invasion, and even before that. Regular investors in Russian markets have grown accustomed to these geopolitical risks. And there have been, over recent years, windows when Russian equities can have material returns, followed by sell offs on the back of increases in geopolitical tensions and incremental sanctions. That said, from 2014 lows to the recent peak in Russian equities, the Russian Equities Index has outperformed emerging markets by about 13% per year and returned 15% total, including dividends, per year. This is on the back of many structural drivers, like a tripling in dividend payout ratios over this time. In fact, recently, the Russian stock market has seen record levels of buybacks, dividend levels,&nbsp;and retail inflows.</p><p><br></p><p><strong>Michael Zezas </strong>Marina, thank you. This has been really insightful. Thank you for taking the time to talk.</p><p><br></p><p><strong>Marina Zavolock </strong>Thank you, Michael.</p><p><br></p><p><strong>Michael Zezas </strong>And thanks for listening. If you enjoy Thoughts on the Market, please be sure to rate and review us on the Apple Podcasts app. It helps more people find the show.</p>",
  "guid": "gid://art19-episode-locator/V0/g6_DvIeSh-OxUVrZOUDTCNlz_2vj7d1CoxkAeMye8bI",
  "pubDate": "Thu, 17 Feb 2022 21:32:09 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:duration": "00:09:22",
  "enclosure": ""
}