{
  "title": "Supporting Sam Harris on Company Autonomy",
  "link": "https://danielmiessler.com/blog/supporting-sam-harris-on-company-autonomy/",
  "dc:creator": "Daniel Miessler",
  "pubDate": "Sun, 21 Aug 2022 21:49:34 +0000",
  "category": "Culture",
  "guid": "https://danielmiessler.com/?p=138146",
  "description": "The internet&#8217;s gone a bit crazy about Sam Harris supposedly supporting censorship. As in most cases, a careful review of the source material reveals this not to be true. I can&#8217;t say for sure if we perfectly align on the grey areas. Because it appears I almost perfectly align with Sam on this, I&#8217;m going to give and&#8230;",
  "content:encoded": "<p><img decoding=\"async\" loading=\"lazy\" src=\"https://danielmiessler.com/images/censorship-free-speech-1-620x650.png\" alt=\"censorship-free-speech\" width=\"620\" height=\"650\" class=\"aligncenter size-medium wp-image-138149\" /></p>\n\n<p>The internet&#8217;s gone a bit crazy about Sam Harris <a href=\"https://www.google.com/search?q=sam+harris+censorship&#038;sxsrf=ALiCzsa7iWMJ2ruZEONWUAeg2-UuqtkIMw:1661114000876&#038;source=lnms&#038;tbm=nws&#038;sa=X&#038;ved=2ahUKEwi9l9Dv49j5AhWwEEQIHfyGCwQQ_AUoAXoECAEQAw&#038;biw=1457&#038;bih=1556&#038;dpr=2\">supposedly supporting censorship</a>. As in most cases, a careful review of the source material reveals this not to be true.</p>\n\n<p class=\"note\">I can&#8217;t say for sure if we perfectly align on the grey areas.</p>\n\n<p>Because it appears I almost perfectly align with Sam on this, I&#8217;m going to give and defend my own perspective on this topic. The source material in question seems to have been <a href=\"https://podcasts.apple.com/us/podcast/triggernometry/id1375568988?i=1000576426254\">the Triggernometry Podcast</a> where Sam appeared recently.</p>\n\n<p>The pivotal quote was something like, &#8220;There was a liberal conspiracy to keep Trump out of office and that was ok.&#8221; This melted the minds of the hosts, and Sam quickly explained the meaning of his comment. Note: he didn&#8217;t retract it; he explained it.</p>\n\n<p>He said it all depends on what you mean by conspiracy, which is completely valid. He said if it means a bunch of people sitting around in a room plotting how to keep him from being elected again, then that qualifies, and it definitely happened.</p>\n\n<p>Again, completely logical.</p><div data-inline-related-post data-inline-related-post-index=0></div>\n\n<p>His analogy was a conspiracy to stop an asteroid from hitting the earth. Are there people sitting around plotting against the asteroid? Damn straight. Same with Trump. Of course we can disagree on whether or not he&#8217;s an asteroid, but once it&#8217;s granted that some people do belive that, his point stands.</p>\n\n<p>He then went on to clarify that he didn&#8217;t mean stuffing ballots or doing anything <em>illegal</em> to keep him out of office. It can be a conspiracy and be completely legally carried out.</p>\n\n<p>So yeah, that was the main lightning rod statement from the interview as far as I can tell. Now onto the bigger point of companies being able to self-sensor.</p>\n\n<p>Sam&#8217;s point there was that it should be ok, in 2022, to have a podcast only for tall pretty people. So like Sam wouldn&#8217;t be allowed on there (his words, lol). He said he wouldn&#8217;t support such a thing a few decades ago, but he would now.</p>\n\n<p>This is where the grey starts for me.</p>\n\n<p>I&#8217;m with Sam on this. That&#8217;s where the free market, and the freedom of a company should come in. But here&#8217;s the problem: what happens when all identifying attributes can become the source of discrimination.</p><div data-inline-related-post data-inline-related-post-index=1></div>\n\n<ul>\n<li>Men</li>\n<li>Women</li>\n<li>Non-binary</li>\n<li>Not funny</li>\n<li>Funny</li>\n<li>Tall</li>\n<li>Athletic</li>\n<li>Beautiful</li>\n<li>Black, White, Asian, Hispanic</li>\n<li>Comedians</li>\n<li>Professionals</li>\n</ul>\n\n<p>There are infinite ways to slice things and people if you try. And people do try. So the question is if you try to go on the new TallnPretty Podcast network, but you are 6&#8217;3&#8243; and you&#8217;re rejected, what does that mean?</p>\n\n<p>And what if you&#8217;re also considered pretty, but the show has never had a gay person on it yet. Were you rejected because you were gay or because you weren&#8217;t pretty enough? Nobody on the outside will ever know the reason. And this would be theoretical if we didn&#8217;t have cake makers saying they don&#8217;t want to make cakes for gay couples.</p>\n\n<p>That&#8217;s my cognitive dissonace right there. Here it is in steps.</p>\n\n<ol>\n<li>Yes, companies should be able to choose who to have and not have as customers, or on a media show</li>\n<li>But not if they&#8217;re discriminating based on something harmful and toxic to society, like race or gender</li>\n<li>Ok, fine, but what about all the other things that aren&#8217;t as bad as race and gender, but are still very similar?</li>\n</ol>\n\n<p>That&#8217;s where it all turns grey and falls apart.</p>\n\n<p>Oh, and then you have the public square issue.</p><div class=\"inline-auto-newsletter\"><div class=\"inline-subscribe px-2 pb-8 pt-8 mb-8 border-t border-b\">\n<div class=\"text-lg font-bold\">The UL Newsletter: Finding the Patterns in the Noise…</div>\n<div class=\"text-sm text-gray-700 max-w-lg\">Get a weekly analysis of what's happening in security and tech—<em>and why it matters</em>.</div>\n<div class=\"mt-2\"><form action=\"https://danielmiessler.us8.list-manage.com/subscribe/post?u=6a9e465ab1570df8aaecb2292&id=49fdb7d723\" method=\"post\" name=\"mc-embedded-subscribe-form\" class=\"mc-embedded-subscribe-form validate inline\" novalidate > \n            <div>\n            <div class=\"mc-field-group\">\n            <input  placeholder=\"your best email\" type=\"email\" value=\"\" name=\"EMAIL\" class=\"required email\" id=\"mce-EMAIL\">\n            <input type=\"submit\" value=\"Subscribe\" name=\"subscribe\" id=\"mc-embedded-subscribe\" class=\"button text-system\">\n            </div>\n            <div style=\"position: absolute; left: -5000px;\" aria-hidden=\"true\"><input type=\"text\" name=\"b_6a9e465ab1570df8aaecb2292_49fdb7d723\" tabindex=\"-1\" value=\"\"></div>\n            </div>\n            </form></div>\n</div>\n</div>\n\n<p>Twitter isn&#8217;t just one twitter among many. It&#8217;s the only one. Or one of very few anyway.</p>\n\n<p>Censorship is supposed to only apply to the government disallowing things, but in our changing reality it&#8217;s starting to arguably become &#8220;that with overwhelming force&#8221;. That would still include government of course, but it would also encompass bigger things like &#8220;the media&#8221; or monopolistic media platforms, like Twitter.</p>\n\n<p>So, what is one to do? I don&#8217;t know, and neither does anyone else. This is hard.</p>\n\n<p>Here are some guidelines though:</p>\n\n<ol>\n<li>Companies should start with the ability to do whatever they want, except for as it pertains to discrimination based on historic and toxic discrimination like race and gender.</li>\n<li>If you want to only allow tall and beautiful people on your podcast, you should be allowed to do that. No organization should be able to compel you to invite and host short and less attractive people. That&#8217;s super gross and dysfunctional.</li>\n<li>In other words, any company should be able to publish a policy and follow it. Such as banning Jones and Trump. Ideally such a policy would be fair, but in the case of Twitter it seems to be highly biased against the right. But perhaps because the right is more often violating their policy. Again, that policy is up to them.</li>\n<li>However, once a company hits a certain size or influence (or lack of competition), perhaps it should lose some of these freedoms in the spirit of the government-aimed free speech laws? That seems logical. I do so Twitter as something like a Town Square. And it does seem clearly biased towards the left. But I don&#8217;t know what to do about that other than to start another company like Truth Social to counter it. And if Twitter were to try to stop that somehow in a gross way now we&#8217;re in monopoly conversations.</li>\n<li>So fundamentally the market should help us fight out of this problem by having a biased actor get penalized by the customer. </li>\n</ol>\n\n<p>The irony here, which Sam has brought up multiple times, is that this is normally the conservative argument. But now they&#8217;ve somehow forgotten it because they really want to be on Twitter. Too bad. Free market, remember?</p>\n\n<p>And a bunch of liberals are somehow mad at Sam and others making similar arguments, as I am here. Sam and I have only voted for Democrats in our lives. No Republicans. Ever.</p><div data-inline-related-post data-inline-related-post-index=3></div>\n\n<p>Yet somehow we&#8217;re making the free market argument against Conservatives, who want the government to force Twitter to go easy on the Right.</p>\n\n<p>Strange world.</p>\n\n<p>Bottom line here is that this is really hard, but the principles above are the somewhat lighted path.</p>\n\n<ol>\n<li>Freedom by default</li>\n<li>Except for historic discrimination</li>\n<li>And if the thing gets too big with no competition, maybe exert some kind of corrective force to fix things</li>\n</ol>\n\n<p>What am I missing?</p>\n</p>"
}