{
  "id": "tag:blogger.com,1999:blog-6959495683334200101.post-2640342815530127430",
  "published": "2020-05-07T10:00:00.000-07:00",
  "updated": "2020-05-07T10:00:09.424-07:00",
  "title": "Three steps to keep your YouTube account secure",
  "content": "In the spirit of World Password Day, we encourage all creators to bolster the security of their Google accounts. Unfortunately, over the past several months we've seen a rise in the hijacking of YouTube channels. We take account security seriously and, in addition to continuously improving our monitoring and systems, want to help creators keep their accounts safe by encouraging them to take these three steps:<br /><br /><br /><br /><h3>1.  <a href=\"https://www.blog.google/technology/safety-security/five-things-you-can-do-right-now-to-stay-safer-online/\" target=\"_blank\">Create a strong password</a> and never share it or reuse it on other sites. </h3><br /><br /><br />A secure password and <a href=\"https://support.google.com/accounts/answer/7299973?hl=en&amp;ref_topic=3382255\" target=\"_blank\">updated recovery information</a>, like adding your phone number to your Google Account, can help protect it. Also, never enter your password information on any page other than account.google.com since that’s one way passwords are stolen. If you work with a team, do not share your password with them, either. <br /><br /><br /><br /><h3>2. Enable <a href=\"https://www.google.com/landing/2step/\" target=\"_blank\">2-Step Verification</a> on your Google account for extra protection in addition to monitoring who has access to your account. </h3><br /><br /><br />It's easier than you think for someone to steal your password, through phishing, malware, data breaches and more. Adding 2-Step Verification means that you’ll protect your account with both your password and additional information — like a prompt on your phone, or a physical device like a security key — to confirm it's really you.<br /><br /><br /><br />For your account to be as secure as possible, you should make sure all Google accounts with access to your channel have 2-Step Verification enabled. This includes everyone listed under the <a href=\"https://support.google.com/youtube/answer/6351520?hl=en\" target=\"_blank\">channel permissions</a> section in your settings. Also consider using the <a href=\"https://landing.google.com/advancedprotection/\" target=\"_blank\">Advanced Protection Program</a> for an extra level of security.<br /><br /><br /><br /><h3>3. Stay vigilant of phishing and malware scams. </h3><br /><br /><br />Knowing what to look for means you can get ahead of potential scams. Look out for any emails that ask for your account login information — legitimate emails from YouTube about your account will never ask for your login information. If you suspect an email may be a phishing or malware scam, don’t click on any links before verifying they are correct by hovering over them. Ensure the email address and sender names match, and look out for any downloads or attachments — especially ones that are very large or run a program on your computer. These can be malware that when downloaded may cause extensive damage to data and computers or may be used to gain unauthorized access to your network.<br /><br /><br /><br />On World Password Day and every day, we want to help you ensure your accounts are secure. Follow these three simple tips and go to the <a href=\"https://myaccount.google.com/security-checkup?pli=1&amp;otzr=1\" target=\"_blank\">Google Security checkup</a> to review and adjust your security settings to help you keep your account secure.",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube Creators",
    "uri": "http://www.blogger.com/profile/00450486760991148551",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}