{
  "title": "245: How to Become More Confident with Sandy Grigsby",
  "pubDate": "Mon, 23 Aug 2021 14:58:04 +0000",
  "guid": "fcde93fb-2503-46bb-bbee-7db00a8286e8",
  "link": "https://sites.libsyn.com/94610/245-how-to-become-more-confident-with-sandy-grigsby",
  "itunes:image": "",
  "description": "<p>How do you become more confident?<br /> <br /> Confidence is something we talk about a lot in the Kwik Brain community. We know confidence is the cornerstone of learning, leadership, and life. But it can be easy to feel like everyone around you has far more confidence and is surer of themselves than you feel. The truth is, they probably have as many doubts as you do.</p> <p>I’m excited to have this conversation with empowerment coach and personal brand expert, Sandy Grigsby. She helps people discover their potential and unlock their inner confidence.</p> <p>If you’ve ever struggled with finding your confidence and want to know the secret to become more confident, this episode is for you.</p> <p class=\"p1\">*** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. ***</p> <p class=\"p1\">Or text me <strong>310-299-9362</strong> to get your burning questions answered and an insider sneak peek of exciting updates. I do my best to answer as many as I can each day, so shoot me a message today. </p>",
  "content:encoded": "<p>How do you become more confident?  Confidence is something we talk about a lot in the Kwik Brain community. We know confidence is the cornerstone of learning, leadership, and life. But it can be easy to feel like everyone around you has far more confidence and is surer of themselves than you feel. The truth is, they probably have as many doubts as you do.</p> <p>I’m excited to have this conversation with empowerment coach and personal brand expert, Sandy Grigsby. She helps people discover their potential and unlock their inner confidence.</p> <p>If you’ve ever struggled with finding your confidence and want to know the secret to become more confident, this episode is for you.</p> <p class=\"p1\">*** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. ***</p> <p class=\"p1\">Or text me 310-299-9362 to get your burning questions answered and an insider sneak peek of exciting updates. I do my best to answer as many as I can each day, so shoot me a message today. </p>",
  "enclosure": "",
  "itunes:duration": "19:26",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "How do you become more confident?  Confidence is something we talk about a lot in the Kwik Brain community. We know confidence is the cornerstone of learning, leadership, and life. But it can be easy to feel like everyone around you has far more...",
  "itunes:episodeType": "full"
}