{
  "id": "yt:video:JTZNLwCOD6M",
  "yt:videoId": "JTZNLwCOD6M",
  "yt:channelId": "UCbu2SsF-Or3Rsn3NxqODImw",
  "title": "God of War Ragnarok Review Roundup | GameSpot News",
  "link": "",
  "author": {
    "name": "GameSpot",
    "uri": "https://www.youtube.com/channel/UCbu2SsF-Or3Rsn3NxqODImw"
  },
  "published": "2022-11-03T21:30:05+00:00",
  "updated": "2022-11-04T09:06:43+00:00",
  "media:group": {
    "media:title": "God of War Ragnarok Review Roundup | GameSpot News",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "God of War Ragnarok reviews are here, a tease at a second Warzone 2.0 map, and Modern Warfare 2 gets its first post launch patch. All this on today’s GameSpot News.\n#Gaming #GodOfWarRagnarok #Warzone2.0 \n\nGod of War Ragnarok reviews are here, a tease at a second Warzone 2.0 map, and Modern Warfare II gets its first post launch patch. All this on today’s GameSpot News.\n\nRagnarok Reviews are here, and it sounds like the game Ragnarocks. \n\nLook. I’m sorry. I tried to write this script and not make that joke, but I just couldn’t do it. I promise it’s the only one.\n\nOn Metacritic, which, full disclosure, is a sister site to GameSpot, the game at the time of recording has a 94 avg based on 112 reviews. That is the exact same score its 2018 predecessor has on the site as well based on 118 reviews.\n\nOur own review from Tamoor Hussain states, “God of War Ragnarok is a lavish production with pristine visuals, jaw-dropping scale, crunchy combat that is as satisfying as it is brutal, and a world that begs to have its every corner and crevice explored.” Hussain’s singular gripe with the game stems from elements of its combat, noting, “ the mechanics can struggle under the pressure of the increased speed and aggression [as the game progresses]”\n\nLeon Hurley at Games Radar has some light criticism of the game’s first half, saying, “I found God of War Ragnarok an oddly split experience overall. There's a light start that feels padded – still good but missing depth – which leads into a weighty finish that's every bit the equal of its predecessor.”\n\nGame Informer’s Kyle Hilliard, who used to be GameSpot’s Kyle Hilliard — they won him over by saying he could review Ragnarok, I’m sure — writes, “God of War Ragnarök feels a lot like God of War (2018), which is a compliment considering how fantastic that game is. Sony Santa Monica was right to not break what wasn't broken and it has expertly continued the story threads that were left hanging from the previous game. Any complaints about the overall experience (familiar combat, collecting and leveling up equipment isn't particularly interesting) are quickly forgotten in the face of the compelling narrative, believable character relationships, and incredible visuals and animation.”\n\nNot too Badnarok. \n\nTIMESTAMPS: \n00:14 - Ragnarok review roundup\n02:15 - Warzone 2.0 map easter egg\n03:15 - Modern Warfare 2 patch",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}