{
  "title": "Password Rules Are Bullshit",
  "description": "<!--kg-card-begin: markdown--><p>Of the many, many, <em>many</em> <a href=\"https://blog.codinghorror.com/the-dirty-truth-about-web-passwords/\">bad things about passwords</a>, you know what the worst is? Password rules.</p>\n<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">If we don't solve the password problem for users in my lifetime I am gonna haunt you from beyond the grave as a ghost <a href=\"http://t.co/Tf9EnwgoZv\">pic.twitter.com/Tf9EnwgoZv</a></p>&#x2014; Jeff Atwood</blockquote>",
  "link": "https://blog.codinghorror.com/password-rules-are-bullshit/",
  "guid": "5988f60721f57d0019a2e128",
  "dc:creator": "Jeff Atwood",
  "pubDate": "Fri, 10 Mar 2017 11:16:26 GMT",
  "content:encoded": "<!--kg-card-begin: markdown--><p>Of the many, many, <em>many</em> <a href=\"https://blog.codinghorror.com/the-dirty-truth-about-web-passwords/\">bad things about passwords</a>, you know what the worst is? Password rules.</p>\n<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">If we don't solve the password problem for users in my lifetime I am gonna haunt you from beyond the grave as a ghost <a href=\"http://t.co/Tf9EnwgoZv\">pic.twitter.com/Tf9EnwgoZv</a></p>&#x2014; Jeff Atwood (@codinghorror) <a href=\"https://twitter.com/codinghorror/status/631238409269309440\">August 11, 2015</a></blockquote>\n<script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Let this pledge be duly noted on the permanent record of the Internet. I don't know if there's an afterlife, but I'll be finding out soon enough, and I plan to go out <em>mad as hell</em>.</p>\n<p>The world is absolutely awash in terrible password rules:</p>\n<ul>\n<li><a href=\"https://github.com/duffn/dumb-password-rules\">Dumb Password Rules</a></li>\n<li><a href=\"http://badpasswordpolicies.tumblr.com/\">Bad Password Policies</a></li>\n<li><a href=\"http://password-shaming.tumblr.com/\">Password Requirements Shaming</a></li>\n</ul>\n<p>But I don't need to tell you this. The more likely you are to use a truly random password generation tool, like us &#xFC;ber-geeks are supposed to, the more likely you have suffered mightily &#x2013; and daily &#x2013; under this regime.</p>\n<p>Have you seen the classic XKCD <a href=\"https://xkcd.com/936/\">about passwords</a>?</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2017/03/password_strength.png\" alt=\"To anyone who understands information theory and security and is in an infuriating argument with someone who does not (possibly involving mixed case), I sincerely apologize.\" loading=\"lazy\"></p>\n<p>We <a href=\"https://security.stackexchange.com/questions/6095/xkcd-936-short-complex-password-or-long-dictionary-passphrase\">can certainly debate</a> whether \"correct horse battery staple\" is a viable password strategy or not, but the argument here is mostly that <em>length matters</em>.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2017/03/twss.jpg\" alt=\"That's What She Said\" loading=\"lazy\"></p>\n<p>No, seriously, it does. I'll go so far as to say <a href=\"https://blog.codinghorror.com/your-password-is-too-damn-short/\">your password is too damn short</a>. These days, given the state of cloud computing and GPU password hash cracking, any password of 8 characters or less is perilously close to <em>no password at all</em>.</p>\n<p>So then perhaps we have one rule, that <strong>passwords must not be short</strong>. A long password is much more likely to be secure than a short one &#x2026; right?</p>\n<p>What about this four character password?</p>\n<h1 id>&#x2705;&#x1F40E;&#x1F50B;&#x1F587;&#xFE0F;</h1>\n<p>What about this eight character password?</p>\n<h1 id>&#x6B63;&#x786E;&#x9A6C;&#x7535;&#x6C60;&#x8BA2;&#x4E66;&#x9489;</h1>\n<p>Or this (hypothetical, but all too real) seven character password?</p>\n<h1>&#x634;&#x5BFC;&#xE1E;&#xE34;&#xD55C;<img src=\"https://blog.codinghorror.com/content/images/2017/06/klingon-char.png\" width=\"35\" height=\"42\" alt style=\"display:inline; vertical-align:middle\">&#x270C;&#xFE0E;&#x1F696;</h1>\n<blockquote class=\"twitter-tweet\" data-conversation=\"none\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/codinghorror\">@codinghorror</a> I'm sorry but your password must contain 1 char each from: Arabic, Chinese, Thai, Korean, Klingon, Wingdings and an emoji</p>&#x2014; Finley Creative (@FinleyCreative) <a href=\"https://twitter.com/FinleyCreative/status/705349059217784833\">March 3, 2016</a></blockquote>\n<script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>You may also be surprised, if you paste the above four Unicode emojis into your favorite login dialog (go ahead &#x2013; try it), to discover that it &#x2026; <em>isn't</em> in fact four characters.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2017/03/discourse-login-emoji-password.png\" alt loading=\"lazy\"></p>\n<p>Oh dear.</p>\n<pre><code>\"&#x1F4A9;\".length === 2\n</code></pre>\n<p>Our old pal Unicode <a href=\"http://blog.jonnew.com/posts/poo-dot-length-equals-two\">strikes again</a>.</p>\n<p>As it turns out, even the simple rule that \"your password must be of reasonable length\" &#x2026; ain't necessarily so. Particularly if we stop thinking like <a href=\"https://blog.codinghorror.com/the-ugly-american-programmer/\">Ugly ASCII Americans</a>.</p>\n<p>And what of those nice, long passwords? Are they <em>always</em> secure?</p>\n<pre><code>aaaaaaaaaaaaaaaaaaa\n0123456789012345689\npasswordpassword\nusernamepassword\n</code></pre>\n<p>Of course not, because <em>have you met any users lately?</em></p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2017/03/incorrect-password.jpg\" alt=\"I changed all my passwords to \"incorrect\"\" loading=\"lazy\"></p>\n<p>They consistently ruin every piece of software I've ever written. Yes, yes, I know you, Mr. or Ms. &#xFC;ber-geek, know <em>all</em> about the concept of entropy. But expressing your love of entropy as terrible, idiosyncratic password rules &#x2026;</p>\n<ul>\n<li>must contain uppercase</li>\n<li>must contain lowercase</li>\n<li>must contain a number</li>\n<li>must contain a special character</li>\n</ul>\n<p>&#x2026; is a spectacular failure of imagination in a world of Unicode and Emoji.</p>\n<p>As we built <a href=\"https://discourse.org\">Discourse</a>, I discovered that <a href=\"https://blog.codinghorror.com/the-god-login/\">the login dialog was a remarkably complex piece of software</a>, despite its surface simplicity. The primary password rule we used was also the simplest one: <strong>length</strong>. Since I wrote that, we've already increased our minimum password default length from 8 to 10 characters. And if you happen to be an admin or moderator, we decided the minimum has to be even more, <strong>15</strong> characters.</p>\n<p>I also advocated <strong>checking passwords against the 100,000 most common passwords</strong>. If you look at <a href=\"https://blog.keepersecurity.com/2017/01/13/most-common-passwords-of-2016-research-study/\">10 million passwords from data breaches in 2016</a>, you'll find the top 25 most used passwords are:</p>\n<table width=\"320px\">\n<tr>\n<td style=\"vertical-align:top\">\n<code>123456</code><br>\n<code>123456789</code><br>\n<code>qwerty</code><br>\n<code>12345678</code><br>\n<code>111111</code><br>\n<code>1234567890</code><br>\n<code>1234567</code><br>\n<code>password</code><br>\n<code>123123</code><br>\n<code>987654321</code><br>\n<code>qwertyuiop</code><br>\n<code>mynoob</code><br>\n</td>\n<td style=\"vertical-align:top\">\n<code>123321</code><br>\n<code>666666</code><br>\n<code>18atcskd2w</code><br>\n<code>7777777</code><br>\n<code>1q2w3e4r</code><br>\n<code>654321</code><br>\n<code>555555</code><br>\n<code>3rjs1la7qe</code><br>\n<code>google</code><br>\n<code>1q2w3e4r5t</code><br>\n<code>123qwe</code><br>\n<code>zxcvbnm</code><br>\n<code>1q2w3e</code><br>\n</td>\n</tr>\n</table>\n<p>Even this data betrays some ASCII-centrism. The numbers are the same in any culture I suppose, but I find it hard to believe the average Chinese person will ever choose the passwords \"password\", \"quertyuiop\", or \"mynoob\". So this list <em>has</em> to be customizable, localizable.</p>\n<p>(One interesting idea is to search for common shorter password matches inside longer passwords, but I think this would cause too many false positives.)</p>\n<p>If you examine the data, this also turns into an argument in favor of password length. Note that only 5 of the top 25 passwords are 10 characters, so if we require 10 character passwords, we've already reduced our exposure to the most common passwords by 80%. I saw this originally when I <a href=\"https://github.com/danielmiessler/SecLists/tree/master/Passwords\">gathered millions and millions of leaked passwords for Discourse research</a>, then filtered the list down to just those passwords reflecting our new minimum requirement of 10 characters or more.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2017/03/top-million-common-passwords-by-length.png\" alt loading=\"lazy\"></p>\n<p>It suddenly became a <em>tiny</em> list. (If you've done similar common password research, please do share your results in the comments.)</p>\n<p>I'd like to offer the following common sense advice to my fellow developers:</p>\n<h4 id=\"1passwordrulesarebullshit\">1. Password rules are bullshit</h4>\n<ul>\n<li>They don't work.</li>\n<li>They heavily penalize your ideal audience, people that use real random password generators. Hey guess what, that password randomly <em>didn't</em> have a number or symbol in it. I just double checked my math textbook, and yep, it's possible. I'm pretty sure.</li>\n<li>They frustrate average users, who then become uncooperative and use \"creative\" workarounds that make their passwords <em>less</em> secure.</li>\n<li>They are often wrong, in the sense that the rules chosen are grossly incomplete and/or insane, per the many shaming links I've shared above.</li>\n<li>Seriously, for the <em>love of God</em>, stop with this arbitrary password rule nonsense already. If you won't take my word for it, read <a href=\"https://nakedsecurity.sophos.com/2016/08/18/nists-new-password-rules-what-you-need-to-know/\">this 2016 NIST password rules recommendation</a>. It's right there, \"no composition rules\". However, I do see one error, it should have said \"no <em>bullshit</em> composition rules\".</li>\n</ul>\n<h4 id=\"2enforceaminimumunicodepasswordlength\">2. Enforce a minimum <em>Unicode</em> password length</h4>\n<p>One rule is at least easy to remember, understand, and enforce. This is the proverbial one rule to bring them all, and in the darkness bind them.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2017/03/one-donut-to-bind-them-all.jpg\" alt loading=\"lazy\"></p>\n<ul>\n<li>It's simple. Users can count. Most of them, anyway.</li>\n<li>It works. The data <em>shows us</em> it works; just download any common password list of your choice and group by password length.</li>\n<li>The math doesn't lie. All other things being equal, a longer password <em>will</em> be more random &#x2013; and thus more secure &#x2013; than a short password.</li>\n<li>Accept that even this one rule isn't inviolate. A minimum password length of 6 on a Chinese site <em>might</em> be perfectly reasonable. A 20 character password <em>can</em> be ridiculously insecure.</li>\n<li>If you don't allow (almost) every single unicode character in the password input field, you are probably doing it wrong.</li>\n<li>It's a bit of an implementation detail, but make sure <em>maximum</em> password length is reasonable as well.</li>\n</ul>\n<h4 id=\"3checkforcommonpasswords\">3. Check for common passwords</h4>\n<p>As I've already noted, the definition of \"common\" depends on your audience, and language, but it is a terrible disservice to users when you let them choose passwords that exist in the list of 10k, 100k, or million most common known passwords from data breaches. There's <em>no question</em> that a hacker will submit these common passwords in a hack attempt &#x2013; and it's shocking how far you can get, even with aggressive password attempt rate limiting, using <a href=\"https://xato.net/10-000-top-passwords-6d6380716fe0\">just the 1,000 most common passwords</a>.</p>\n<ul>\n<li>1.6% have a password from the top 10 passwords</li>\n<li>4.4% have a password from the top 100 passwords</li>\n<li>9.7% have a password from the top 500 passwords</li>\n<li>13.2% have a password from the top 1,000 passwords</li>\n<li>30% have a password from the top 10,000 passwords</li>\n</ul>\n<p>Lucky you, there are millions and millions of real breached password lists out there to sift through. It is sort of fun to do data forensics, because these aren't hypothetical synthetic Jack the Ripper password rules some bored programmer dreamed up, these are <em>real</em> passwords used by <em>real</em> users.</p>\n<p>Do the research. Collect the data. Protect your users from themselves.</p>\n<h4 id=\"4checkforbasicentropy\">4. Check for basic entropy</h4>\n<p>No need to get fancy here; pick the measure of entropy that satisfies you deep in the truthiness of your gut. But remember you have to be able to <em>explain</em> it to users when they fail the check, too.</p>\n<p><a href=\"http://www.digifail.com/software/spectra.shtml\"><img src=\"https://blog.codinghorror.com/content/images/2017/03/entropy2.png\" alt=\"entropy visualized\" loading=\"lazy\"></a></p>\n<p>I had a bit of a sad when I realized that we  were perfectly fine with users selecting a 10 character password that was literally \"aaaaaaaaaa\". In my opinion, the simplest way to do this is to ensure that there are at least (x) unique characters out of (y) total characters. And that's what we do as of the current beta version of Discourse. But I'd love your ideas in the comments, too. The simpler and clearer the better!</p>\n<h4 id=\"5checkforspecialcasepasswords\">5. Check for special case passwords</h4>\n<p>I'm embarrassed to admit that when building the Discourse login, <a href=\"https://blog.codinghorror.com/the-god-login/\">as I discussed in The God Login</a>, we missed two common cases that you really <em>have</em> to block:</p>\n<ul>\n<li>password equal to username</li>\n<li>password equal to email address</li>\n</ul>\n<p>&#x1F926; If you are using Discourse versions earlier than 1.4, I'm so sorry and <em>please upgrade immediately</em>.</p>\n<p>Similarly, you might also want to block other special cases like</p>\n<ul>\n<li>password equal to URL or domain of website</li>\n<li>password equal to app name</li>\n</ul>\n<p>In short, try to think outside the password input box, like a user would.</p>\n<blockquote>\n<p>&#x1F514; <strong>Clarification</strong></p>\n<p>A few people have interpreted this post as \"all the <em>other</em> password rules are bullshit, except these four I will now list.\" That's not what I'm trying to say here.</p>\n<p>The idea is to focus on the one understandable, simple, practical, works-in-real-life-in-every-situation rule: <strong>length</strong>. Users can enter (almost) anything, in proper Unicode, <em>provided it's long enough</em>. That's the <strong>one rule to bind them all</strong> that we need to teach users: length!</p>\n<p>Items #3 through #5 are more like genie-special-exception checks, a <a href=\"https://www.youtube.com/watch?v=Bwic3hJ4q1A\">you can't wish for infinite wishes</a> kind of thing. It doesn't need to be discussed up front because it <em>should</em> be really rare. Yes, you must stop users from having comically bad passwords that equal their username, or <code>aaaaaaaaaaa</code> or <code>0123456789</code>, but only as post-entry checks, not as rules that need to be explained in advance.</p>\n<p>So TL;DR: one rule. Length. Enter whatever you want, just make sure it's long enough to be a reasonable password.</p>\n</blockquote>\n<table>\n<tr><td class=\"welovecodinghorror\">\n[advertisement] Building out your tech team? <a href=\"http://careers.stackoverflow.com/products\" rel=\"nofollow\">Stack Overflow Careers</a> helps you hire from the largest community for programmers on the planet. We built our site with developers like you in mind.\n</td></tr>\n</table>\n<!--kg-card-end: markdown-->"
}