{
  "title": "S1 Ep50: #50 - Demons, Hauntings, and Paranormal Encounters",
  "link": "https://audioboom.com/posts/7874588",
  "itunes:episode": 50,
  "itunes:title": "#50 - Demons, Hauntings, and Paranormal Encounters",
  "itunes:season": 1,
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5781,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>Greetings foolish mortals, the spirits told us you were coming... But we could have told you that, because it’s our season one finale, baby! It’s been a wild ride and we are all extremely thankful for the support of our viewers that has brought us this far. So we got to thinking that such a spectacular first season should have a truly SPOOKtacular finale! After much anticipation, here it is ladies and gents, boos and ghouls... THE PARANORMAL EPISODE. Tap into the ether and hear us talk about past lives, ghostly hauntings, and our personal interactions with beings from the beyond. Find out who is a believer in the supernatural and who’s third eye has yet to open. And uncover what transpired when the gang went on a late-night trip to Turnbull Canyon: a spot with a dark history of satanic cult rituals, UFO sightings, mysterious plane crashes, and an abandoned insane asylum! Plus, the team bonding continues when we all get some frighteningly accurate psychic readings from an acclaimed medium.</p>\n<p><br>\n</p>\n<p>And although we are laying rest to season one of Zane and Heath: UNFILTERED, we WILL rise again with a vengeance in season two. So before that happens make sure to sage the room, consult your crystal ball, and while you’re at it do the monster mash with us, because we are just weeks away from revealing what has been bubbling in our cauldron.</p>\n<p><br>\n</p>\n<p>Visit <a href=\"http://joinhoney.com/UNFILTERED\">http://joinhoney.com/UNFILTERED</a></p>\n<p><br>\n</p>\n<p>Head over to <a href=\"http://att.com/galaxynote20ultra5g\">http://att.com/galaxynote20ultra5g</a> to learn how you can get the Samsung Galaxy Note 20 5G for free or the Galaxy Note 20 Ultra 5G for $299.99 for a limited time!</p>\n<p><br>\n</p>\n<p>Go to <a href=\"http://hellofresh.com/80unfiltered\">http://hellofresh.com/80unfiltered</a> to get a total of $80 off your first month, including free shipping on your first box!</p>\n",
  "pubDate": "Mon, 28 Sep 2020 10:21:00 +0000",
  "guid": "efd0df10-0175-11eb-8def-532e45d52c47",
  "itunes:author": "Zane & Heath",
  "dc:creator": "Zane & Heath",
  "media:rights": ""
}