{
  "id": "https://bibleinoneyear.org/en/youth/107",
  "title": "Day 107: Six Steps to a God-Centred Life",
  "description": "Psalm 47:1,5–7, Deuteronomy 28:23,47, Luke 18:1–30.  If you put God first in your life all kinds of blessings follow  Because God loves you he warns you of the dangers of disregarding the design for your life",
  "pubDate": "Sat, 17 Apr 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/107/?ignore",
  "itunes:duration": "13:50",
  "guid": "enyouth17042021-107",
  "length": 830.22,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 107: Six Steps to a God-Centred Life",
  "itunes:subtitle": "Psalm 47:1,5–7, Deuteronomy 28:23,47, Luke 18:1–30.  If you put God first in your life all kinds of blessings follow  Because God loves you he warns you of the dangers of disregarding the design for your life",
  "itunes:summary": "William Temple, like his father before him, was Archbishop of Canterbury (1942–1944). Among his many remarkable achievements, he wrote a superb commentary on the Gospel of John. He wrote the entire commentary, entitled Readings in St John’s Gospel, while praying on his knees before God.\nAbout worship, he wrote: ‘Worship is a submission of all our nature to God. It is the quickening of conscience by his holiness; the nourishment of mind with his truth; the purifying of imagination by his beauty; the opening of the heart to his love; the surrender of will to his purpose – and all this gathered up in adoration.’\nWorship saves us from being self-centred and makes us God-centred. You were created to live in a relationship with God. That should be your number one priority. If you put God first in your life all kinds of blessings follow. Because God loves you he warns you of the dangers of disregarding the design for your life.\nBut what does it mean to lead a God-centred life and what steps do you need to take in order to get there?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 107
}