{
  "title": "Episode 60: &#8220;You Send Me&#8221; by Sam Cooke",
  "link": "https://500songs.com/podcast/episode-60-you-send-me-by-sam-cooke/",
  "pubDate": "Mon, 09 Dec 2019 16:29:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=555",
  "description": "Episode sixty of&nbsp;<em>A History of Rock Music in Five Hundred Songs</em>&nbsp;looks at \"You Send Me\" by Sam Cooke Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,&nbsp;<a href=\"https://www.patreon.com/posts/500-songs-bonus-32212138\">on \"Little Darlin'\" by The Gladiolas</a>.\n\nAlso, an announcement -- the book version of the first fifty episodes is now available for purchase. See the show notes, or the&nbsp;<a href=\"https://www.500songs.com/e/book-announcement/\">previous mini-episode announcing this</a>, for details.\n\n\n\n<strong>Resources</strong>\n\nMy main source for this episode is&nbsp;<a href=\"https://amzn.to/2s7UCmk\"><em>Dream Boogie: The Triumph of Sam Cooke</em></a>&nbsp;by Peter Guralnick. Like all Guralnick's work, it's an essential book if you're even slightly interested in the subject.\n\n<a href=\"https://amzn.to/36eZZic\">This</a>&nbsp;is the best compilation of Sam Cooke's music for the beginner.\n\nA note on spelling: Sam Cooke was born Sam Cook, the rest of his family all kept the surname Cook, and he only added the \"e\" from the release of \"You Send Me\", so for almost all the time covered in this episode he was Cook. I didn't feel the need to mention this in the podcast, as the two names are pronounced identically. I've spelled him as Cooke and everyone else as Cook throughout.\n\n<strong>Book of the Podcast</strong>\n\nRemember that there's a book available based on the first fifty episodes of the podcast. You can buy it at&nbsp;<a href=\"https://books2read.com/u/mVrzYM\">this link</a>, which will take you to your preferred online bookstore.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nWe've talked before about how the music that became known as soul had its roots in gospel music, but today we're going to have a look at the first big star of that music to get his start as a professional gospel singer, rather than as a rhythm and blues singer who included a little bit of gospel feeling.\n\nSam Cooke was, in many ways, the most important black musician of the late fifties and early sixties, and without him it's doubtful whether we would have the genre of soul as we know it today. But when he started out, he was someone who worked exclusively in the gospel field, and within that field he was something of a superstar.\n\nHe was also someone who, as admirable as he was as a singer, was far less admirable in his behaviour towards other people, especially the women in his life, and while that's something that will come up more in future episodes, it's worth noting here.\n\nCooke started out as a teenager in the 1940s, performing in gospel groups around Chicago, which as we've talked about before was the city where a whole new form of gospel music was being created at that point, spearheaded by Thomas Dorsey. Dorsey, Mahalia Jackson, and Sister Rosetta Tharpe were all living and performing in the city during young Sam's formative years, but the biggest influence on him was a group called the Soul Stirrers.\n\nThe Soul Stirrers had started out in 1926 as a group in what was called the \"jubilee\" style -- the style that black singers of spiritual music sang in the period before Thomas Dorsey revolutionised gospel music. There are no recordings of the Soul Stirrers in that style, but this is probably the most famous jubilee recording:\n\n[Excerpt: The Fisk Jubilee Singers, \"Swing Low, Sweet Chariot\"]\n\nBut as Thomas Dorsey and the musicians around him started to create the music we now think of as gospel, the Soul Stirrers switched styles, and became one of the first -- and best -- gospel quartets in the new style.\n\nIn the late forties, the Soul Stirrers signed to Specialty Records, one of the first acts to sign to the label, and recorded a series of classic singles led by R.H. Harris, who was regarded by many as the greatest gospel singer of the age:\n\n[Excerpt: The Soul Stirrers feat. R.H. Harris, \"In That Awful Hour\"]\n\nSam Cooke was one of seven children, the son of Reverend Charles Cook and his wife Annie Mae, and from a very early age the Reverend Cook had been training them as singers -- five of them would perform regularly around churches in the area, under the name The Singing Children.\n\nYoung Sam was taught religion by his father, but he was also taught that there was no prohibition in the Bible against worldly success. Indeed the Reverend Cook taught him two things that would matter in his life even more than his religion would. The first was that whatever it is you do in life, you try to do it the best you can -- you never do anything by halves, and if a thing's worth doing it's worth doing properly. And the second was that you do whatever is necessary to give yourself the best possible life, and don't worry about who you step on to do it.\n\nAfter spending some time with his family group, Cooke joined a newly-formed gospel group, who had heard him singing the Ink Spots song \"If I Didn't Care\" to a girl. That group was called the Highway QCs, and a version of the group still exists to this day. Sam Cooke only stayed with them a couple of years, and never recorded with them, but they replaced him with a soundalike singer, Johnnie Taylor, and listening to Taylor's recordings with the group you can get some idea of what they sounded like when Sam was a member:\n\n[Excerpt: Johnnie Taylor and the Highway QCs, \"I Dreamed That Heaven Was Like This\"]\n\nThe rest of the group were decent singers, but Sam Cooke was absolutely unquestionably the star of the Highway QCs. Creadell Copeland, one of the group's members, later said “All we had to do was stand behind Sam. Our claim to fame was that Sam’s voice was so captivating we didn’t have to do anything else.”\n\nThe group didn't make a huge amount of money, and they kept talking about going in a pop direction, rather than just singing gospel songs, and Sam was certainly singing a lot of secular music in his own time -- he loved gospel music as much as anyone, but he was also learning from people like Gene Autry or Bill Kenny of the Ink Spots, and he was slowly developing into a singer who could do absolutely anything with his voice.\n\nBut his biggest influence was still R.H. Harris of the Soul Stirrers, who was the most important person in the gospel quartet field. This wasn't just because he was the most talented of all the quartet singers -- though he was, and that was certainly part of it -- but because he was the joint leader of a movement to professionalise the gospel quartet movement.\n\n(Just as a quick explanation -- in both black gospel, and in the white gospel music euphemistically called \"Southern Gospel\", the term \"quartet\" is used for groups which might have five, six, or even more people in them. I'll generally refer to all of these as \"groups\", because I'm not from the gospel world, but I'll use the term \"quartet\" when talking about things like the National Quartet Convention, and I may slip between the two interchangeably at times. Just know that if I mention quartets, I'm not just talking about groups with exactly four people in them).\n\nHarris worked with a less well known singer called Abraham Battle, and with Charlie Bridges, of another popular group, the Famous Blue Jays:\n\n[Excerpt: The Famous Blue Jay Singers, “Praising Jesus Evermore”]\n\nTogether they founded the National Quartet Convention, which existed to try to take all the young gospel quartets who were springing up all over the place, and most of whom had casual attitudes to their music and their onstage appearance, and teach them how to comport themselves in a manner that the organisation's leaders considered appropriate for a gospel singer.\n\nThe Highway QCs joined the Convention, of course, and they considered themselves to be disciples, in a sense, of the Soul Stirrers, who they simultaneously considered to be their mentors and thought were jealous of the QCs.\n\nIt was normal at the time for gospel groups to turn up at each other's shows, and if they were popular enough they would be invited up to sing, and sometimes even take over the show. When the Highway QCs turned up at Soul Stirrers shows, though, the Soul Stirrers would act as if they didn't know them, and would only invite them on to the stage if the audience absolutely insisted, and would then limit their performance to a single song.\n\nFrom the Highway QCs' point of view, the only possible explanation was that the Soul Stirrers were terrified of the competition. A more likely explanation is probably that they were just more interested in putting on their own show than in giving space to some young kids who thought they were the next big thing.\n\nOn the other hand, to all the younger kids around Chicago, the Highway QCs were clearly the group to beat -- and people like a young singer named Lou Rawls looked up to them as something to aspire to.\n\nAnd soon the QCs found themselves being mentored by R.B. Robinson, one of the Soul Stirrers. Robinson would train them, and help them get better gigs, and the QCs became convinced that they were headed for the big time.\n\nBut it turned out that behind the scenes, there had been trouble in the Soul Stirrers. Harris had, more and more, come to think of himself as the real star of the group, and quit to go solo. It had looked likely for a while that he would do so, and when Robinson had appeared to be mentoring the QCs, what he was actually doing was training their lead singer, so that when R.H. Harris eventually quit, they would have someone to take his place.\n\nThe other Highway QCs were heartbroken, but Sam took the advice of his father, the Reverend Cook, who told him \"Anytime you can make a step higher, you go higher. Don’t worry about the other fellow. You hold up for other folks, and they’ll take advantage of you.\"\n\nAnd so, in March 1951, Sam Cooke went into the studio with the Soul Stirrers for his first ever recording session, three months after joining the group.\n\nArt Rupe, the head of Specialty Records, was not at all impressed that the group had got a new singer without telling him. Rupe had to admit that Cooke could sing, but his performance on the first few songs, while impressive, was no R.H. Harris:\n\n[Excerpt: the Soul Stirrers, \"Come, Let Us Go Back to God\"]\n\nBut towards the end of the session, the Soul Stirrers insisted that they should record \"Jesus Gave Me Water\", a song that had always been a highlight of the Highway QCs' set. Rupe thought that this was ridiculous -- the Pilgrim Travellers had just had a hit with the song, on Specialty, not six months earlier. What could Specialty possibly do with another version of the song so soon afterwards?\n\nBut the group insisted, and the result was absolutely majestic:\n\n[Excerpt: The Soul Stirrers, \"Jesus Gave Me Water\"]\n\nRupe lost his misgivings, both about the song and about the singer -- that was clearly going to be the group's next single.\n\nThe group themselves were still not completely sure about Cooke as their singer -- he was younger than the rest of them, and he didn't have Harris' assurance and professionalism, yet. But they knew they had something with that song, which was released with \"Peace in the Valley\" on the B-side. That song had been written by Thomas Dorsey fourteen years earlier, but this was the first time it had been released on a record, at least by anyone of any prominence.\n\n\"Jesus Gave Me Water\" was a hit, but the follow-ups were less successful, and meanwhile Art Rupe was starting to see the commercial potential in black styles of music other than gospel. Even though Rupe loved gospel music, he realised when \"Lawdy Miss Clawdy\" became the biggest hit Specialty had ever had to that point that maybe he should refocus the label away from gospel and towards more secular styles of music.\n\n“Jesus Gave Me Water” had consolidated Sam as the lead singer of the Soul Stirrers, but while he was singing gospel, he wasn't living a very godly life. He got married in 1953, but he'd already had at least one child with another woman, who he left with the baby, and he was sleeping around constantly while on the road, and more than once the women involved became pregnant. But Cooke treated women the same way he treated the groups he was in – use them for as long as they've got something you want, and then immediately cast them aside once it became inconvenient.\n\nFor the next few years, the Soul Stirrers would have one recording session every year, and the group continued touring, but they didn't have any breakout success, even as other Specialty acts like Lloyd Price, Jesse Belvin, and Guitar Slim were all selling hand over fist. The Soul Stirrers were more popular as a live act than as a recording act, and hearing the live recording of them that Bumps Blackwell produced in 1955, it's easy to see why:\n\n[Excerpt: Sam Cooke and the Soul Stirrers, \"Nearer to Thee\"]\n\nBumps Blackwell was convinced that Cooke needed to go solo and become a pop singer, and he was more convinced than ever when he produced the Soul Stirrers in the studio for the first time.\n\nThe reason, actually, was to do with Cooke's laziness. They'd gone into the studio, and it turned out that Cooke hadn't written a song, and they needed one. The rest of the group were upset with him, and he just told them to hand him a Bible. He started flipping through, skimming to find something, and then he said \"I got one\". He told the guitarist to play a couple of chords, and he started singing -- and the song that came out, improvised off the top of his head, \"Touch the Hem of His Garment\", was perfect just as it was, and the group quickly cut it:\n\n[Excerpt: Sam Cooke and the Soul Stirrers, \"Touch the Hem of His Garment\"]\n\nBlackwell knew then that Cooke was a very, very special talent, and he and the rest of the people at Specialty became more and more insistent as 1956 went on that Sam Cooke should become a secular solo performer, rather than performing in a gospel group. The Soul Stirrers were only selling in the low tens of thousands -- a reasonable amount for a gospel group, but hardly the kind of numbers that would make anyone rich. Meanwhile, gospel-inspired performers were having massive hits with gospel songs with a couple of words changed.\n\nThere's an episode of South Park where they make fun of contemporary Christian music, saying you just have to take a normal song and change the word \"Baby\" to \"Jesus\". In the mid-fifties things seemed to be the other way -- people were having hits by taking Gospel songs and changing the word \"Jesus\" to \"baby\", or near as damnit. Most famously and blatantly, there was Ray Charles, who did things like take \"This Little Light of Mine\":\n\n[Excerpt: The Louvin Brothers, \"This Little Light of Mine\"]\n\nand turn it into \"This Little Girl of Mine:\n\n[Excerpt: Ray Charles, \"This Little Girl of Mine\"]\n\nBut there were a number of other acts doing things that weren't that much less blatant.\n\nAnd so Sam Cooke travelled to New Orleans, to record in Cosimo Matassa's studio with the same musicians who had been responsible for so many rock and roll hits. Or, rather, Dale Cook did.\n\nSam was still a member of the Soul Stirrers at the time, and while he wanted to make himself into a star, he was also concerned that if he recorded secular music under his own name, he would damage his career as a gospel singer, without necessarily getting a better career to replace it. So the decision was made to put the single out under the name \"Dale Cook\", and maintain a small amount of plausible deniability. If necessary, they could say that Dale was Sam's brother, because it was fairly well known that Sam came from a singing family, and indeed Sam's brother L.C. (whose name was just the initials L.C.) later went on to have some minor success as a singer himself, in a style very like Sam's.\n\nAs his first secular recording, they decided to record a new version of a gospel song that Cooke had recorded with the Soul Stirrers, \"Wonderful\":\n\n[Excerpt: Sam Cooke and the Soul Stirrers, \"Wonderful\"]\n\nOne quick rewrite later, and that song became, instead, \"Lovable\":\n\n[Excerpt: Dale Cook, \"Lovable\"]\n\nAround the time of the Dale Cook recording session, Sam's brother L.C. went to Memphis, with his own group, where they appeared at the bottom of the bill for a charity Christmas show in aid of impoverished black youth. The lineup of the show was almost entirely black – people like Ray Charles, B.B. King, Rufus Thomas, and so on – but Elvis Presley turned up briefly to come out on stage and wave to the crowd and say a few words – the Colonel wouldn't allow him to perform without getting paid, but did allow him to make an appearance, and he wanted to support the black community in Memphis.\n\nBackstage, Elvis was happy to meet all the acts, but when he found out that L.C. was Sam's brother, he spent a full twenty minutes talking to L.C. about how great Sam was, and how much he admired his singing with the Soul Stirrers.\n\nSam was such a distinctive voice that while the single came out as by \"Dale Cook\", the DJs playing it would often introduce it as being by \"Dale Sam Cook\", and the Soul Stirrers started to be asked if they were going to sing \"Lovable\" in their shows.\n\nSam started to have doubts as to whether this move towards a pop style was really a good idea, and remained with the Soul Stirrers for the moment, though it's noticeable that songs like \"Mean Old World\" could easily be refigured into being secular songs, and have only a minimal amount of religious content:\n\n[Excerpt: Sam Cooke and the Soul Stirrers, \"Mean Old World\"]\n\nBut barely a week after the session that produced “Mean Old World”, Sam was sending Bumps Blackwell demos of new pop songs he'd written, which he thought Blackwell would be interested in producing. Sam Cooke was going to treat the Soul Stirrers the same way he'd treated the Highway QCs.\n\nCooke flew to LA, to meet with Blackwell and with Clifton White, a musician who had been for a long time the guitarist for the Mills Brothers, but who had recently left the band and started working with Blackwell as a session player. White was very unimpressed with Cooke – he thought that the new song Cooke sang to them, \"You Send Me\", was just him repeating the same thing over and over again.\n\nArt Rupe helped them whittle the song choices down to four. Rupe had very particular ideas about what made for a commercial record – for example, that a record had to be exactly two minutes and twenty seconds long – and the final choices for the session were made with Rupe's criteria in mind. The songs chosen were \"Summertime\", \"You Send Me\", another song Sam had written called \"You Were Made For Me\", and \"Things You Do to Me\", which was written by a young man Bumps Blackwell had just taken on as his assistant, named Sonny Bono.\n\nThe recording session should have been completely straightforward. Blackwell supervised it, and while the session was in LA, almost everyone there was a veteran New Orleans player – along with Clif White on guitar there was René Hall, a guitarist from New Orleans who had recently quit Billy Ward and the Dominoes, and acted as instrumental arranger; Harold Battiste, a New Orleans saxophone player who Bumps had taken under his wing, and who wasn't playing on the session but ended up writing the vocal arrangements for the backing singers; Earl Palmer, who had just moved to LA from New Orleans and was starting to make a name for himself as a session player there after his years of playing with Little Richard, Lloyd Price, and Fats Domino in Cosimo Matassa's studio, and Ted Brinson, the only LA native, on bass -- Brinson was a regular player on Specialty sessions, and also had connections with almost every LA R&B act, to the extent that it was his garage that \"Earth Angel\" by the Penguins had been recorded in.\n\nAnd on backing vocals were the Lee Gotch singers, a white vocal group who were among the most in-demand vocalists in LA.\n\nSo this should have been a straightforward session, and it was, until Art Rupe turned up just after they'd recorded \"You Send Me\":\n\n[Excerpt: Sam Cooke, \"You Send Me\"]\n\nRupe was horrified that Bumps and Battiste had put white backing vocalists behind Cooke's vocals. They were, in Rupe's view, trying to make Sam Cooke sound like Billy Ward and his Dominoes at best, and like a symphony orchestra at worst. The Billy Ward reference was because René Hall had recently arranged a version of \"Stardust\" for the Dominoes:\n\n[Excerpt: Billy Ward and the Dominoes, \"Stardust\"]\n\nAnd the new version of \"Summertime\" had some of the same feel:\n\n[Excerpt: Sam Cooke, \"Summertime\"]\n\nIf Sam Cooke was going to record for Specialty, he wasn't going to have *white* vocalists backing him. Rupe wanted black music, not something trying to be white -- and the fact that he, a white man, was telling a room full of black musicians what counted as black music, was not lost on Bumps Blackwell.\n\nEven worse than the whiteness of the singers, though, was that some of them were women.\n\nRupe and Blackwell had already had one massive falling-out, over \"Rip it Up\" by Little Richard. When they'd agreed to record that, Blackwell had worked out an arrangement beforehand that Rupe was happy with -- one that was based around piano triplets. But then, when he'd been on the plane to the session, Blackwell had hit upon another idea -- to base the song around a particular drum pattern:\n\n[Excerpt: Little Richard, \"Rip it Up\"]\n\nRupe had nearly fired Blackwell over that, and only relented when the record became a massive hit. Now that instead of putting a male black gospel group behind Cooke, as agreed, Blackwell had disobeyed him a second time and put white vocalists, including women, behind him, Rupe decided it was the last straw. Blackwell had to go.\n\nHe was also convinced that Sam Cooke was only after money, because once Cooke discovered that his solo contract only paid him a third of the royalties that the Soul Stirrers had been getting as a group, he started pushing for a greater share of the money. Rupe didn't like that kind of greed from his artists -- why *should* he pay the artist more than one cent per record sold? But he still owed Blackwell a great deal of money. They eventually came to an agreement -- Blackwell would leave Specialty, and take Sam Cooke, and Cooke's existing recordings with him, since he was so convinced that they were going to be a hit. Rupe would keep the publishing rights to any songs Sam wrote, and would have an option on eight further Sam Cooke recordings in the future, but Cooke and Blackwell were free to take \"You Send Me\", \"Summertime\", and the rest to a new label that wanted them for its first release, Keen.\n\nWhile they waited around for Keen to get itself set up, Sam made himself firmly a part of the Central Avenue music scene, hanging around with Gaynel Hodge, Jesse Belvin, Dootsie Williams, Googie Rene, John Dolphin, and everyone else who was part of the LA R&B community. Meanwhile, the Soul Stirrers got Johnnie Taylor, the man who had replaced Sam in the Highway QCs, to replace him in the Stirrers. While Sam was out of the group, for the next few years he would be regularly involved with them, helping them out in recording sessions, producing them, and more.\n\nWhen the single came out, everyone thought that \"Summertime\" would be the hit, but \"You Send Me\" quickly found itself all over the airwaves and became massive:\n\n[Excerpt: Sam Cooke, \"You Send Me\"]\n\nSeveral cover versions came out almost immediately. Sam and Bumps didn't mind the versions by Jesse Belvin:\n\n[Excerpt: Jesse Belvin, \"You Send Me\"]\n\nOr Cornell Gunter:\n\n[Excerpt: Cornell Gunter, \"You Send Me\"]\n\nThey were friends and colleagues, and good luck to them if they had a hit with the song -- and anyway, they knew that Sam's version was better. What they did object to was the white cover version by Teresa Brewer:\n\n[Excerpt: Teresa Brewer, \"You Send Me\"]\n\nEven though her version was less of a soundalike than the other LA R&B versions, it was more offensive to them -- she was even copying Sam's \"whoa-oh\"s. She was nothing more than a thief, Blackwell argued -- and her version was charting, and made the top ten.\n\nFortunately for them, Sam's version went to number one, on both the R&B and pop charts, despite a catastrophic appearance on the Ed Sullivan Show, which accidentally cut him off half way through a song.\n\nBut there was still trouble with Art Rupe. Sam was still signed to Rupe's company as a songwriter, and so he'd put \"You Send Me\" in the name of his brother L.C., so Rupe wouldn't get any royalties. Rupe started legal action against him, and meanwhile, he took a demo Sam had recorded, \"I'll Come Running Back To You\", and got René Hall and the Lee Gotch singers, the very people whose work on \"You Send Me\" and \"Summertime\" he'd despised so much, to record overdubs to make it sound as much like \"You Send Me\" as possible:\n\n[Excerpt: Sam Cooke, \"I'll Come Running Back To You\"]\n\nAnd in retaliation for *that* being released, Bumps Blackwell took a song that he'd recorded months earlier with Little Richard, but which still hadn't been released, and got the Specialty duo Don and Dewey to provide instrumental backing for a vocal group called the Valiants, and put it out on Keen:\n\n[Excerpt: The Valiants, \"Good Golly Miss Molly\"]\n\nSpecialty had to rush-release Little Richard's version to make sure it became the hit -- a blow for them, given that they were trying to dripfeed the public what few Little Richard recordings they had left.\n\nAs 1957 drew to a close, Sam Cooke was on top of the world. But the seeds of his downfall were already in place. He was upsetting all the right people with his desire to have control of his own career, but he was also hurting a lot of other people along the way -- people who had helped him, like the Highway QCs and the Soul Stirrers, and especially women. He was about to divorce his first wife, and he had fathered a string of children with different women, all of whom he refused to acknowledge or support.\n\nHe was taking his father's maxims about only looking after yourself, and applying them to every aspect of life, with no regard to who it hurt. But such was his talent and charm, that even the people he hurt ended up defending him. Over the next couple of times we see Sam Cooke, we'll see him rising to ever greater artistic heights, but we'll also see the damage he caused to himself and to others. Because the story of Sam Cooke gets very, very unpleasant.",
  "itunes:subtitle": "Episode sixty of&nbsp;A History of Rock Music in Five Hundred Songs&nbsp;looks at You Send Me by Sam Cooke Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus ",
  "itunes:keywords": "Art Rupe,Bumps Blackwell,Cornell Gunter,Cosimo Matassa,Earl Palmer,Elvis Presley,gospel,Harold Battiste,Jesse Belvin,Little Richard,Sam Cooke,Sonny Bono,soul,Specialty Records,the Highway QCs,the Soul Stirrers,white cover versions",
  "itunes:episodeType": "full",
  "itunes:episode": 60,
  "content:encoded": "Episode sixty of&nbsp;<em>A History of Rock Music in Five Hundred Songs</em>&nbsp;looks at \"You Send Me\" by Sam Cooke Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,&nbsp;<a href=\"https://www.patreon.com/posts/500-songs-bonus-32212138\">on \"Little Darlin'\" by The Gladiolas</a>.\n\nAlso, an announcement -- the book version of the first fifty episodes is now available for purchase. See the show notes, or the&nbsp;<a href=\"https://www.500songs.com/e/book-announcement/\">previous mini-episode announcing this</a>, for details.\n\n\n\n<strong>Resources</strong>\n\nMy main source for this episode is&nbsp;<a href=\"https://amzn.to/2s7UCmk\"><em>Dream Boogie: The Triumph of Sam Cooke</em></a>&nbsp;by Peter Guralnick. Like all Guralnick's work, it's an essential book if you're even slightly interested in the subject.\n\n<a href=\"https://amzn.to/36eZZic\">This</a>&nbsp;is the best compilation of Sam Cooke's music for the beginner.\n\nA note on spelling: Sam Cooke was born Sam Cook, the rest of his family all kept the surname Cook, and he only added the \"e\" from the release of \"You Send Me\", so for almost all the time covered in this episode he was Cook. I didn't feel the need to mention this in the podcast, as the two names are pronounced identically. I've spelled him as Cooke and everyone else as Cook throughout.\n\n<strong>Book of the Podcast</strong>\n\nRemember that there's a book available based on the first fifty episodes of the podcast. You can buy it at&nbsp;<a href=\"https://books2read.com/u/mVrzYM\">this link</a>, which will take you to your preferred online bookstore.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nWe've talked before about how the music that became known as soul had its roots in gospel music, but today we're going to have a look at the first big star of that music to get his start as a professional gospel singer, rather than as a rhythm and blues singer who included a little bit of gospel feeling.\n\nSam Cooke was, in many ways, the most important black musician of the late fifties and early sixties, and without him it's doubtful whether we would have the genre of soul as we know it today. But when he started out, he was someone who worked exclusively in the gospel field, and within that field he was something of a superstar.\n\nHe was also someone who, as admirable as he was as a singer, was far less admirable in his behaviour towards other people, especially the women in his life, and while that's something that will come up more in future episodes, it's worth noting here.\n\nCooke started out as a teenager in the 1940s, performing in gospel groups around Chicago, which as we've talked about before was the city where a whole new form of gospel music was being created at that point, spearheaded by Thomas Dorsey. Dorsey, Mahalia Jackson, and Sister Rosetta Tharpe were all living and performing in the city during young Sam's formative years, but the biggest influence on him was a group called the Soul Stirrers.\n\nThe Soul Stirrers had started out in 1926 as a group in what was called the \"jubilee\" style -- the style that black singers of spiritual music sang in the period before Thomas Dorsey revolutionised gospel music. There are no recordings of the Soul Stirrers in that style, but this is probably the most famous jubilee recording:\n\n[Excerpt: The Fisk Jubilee Singers, \"Swing Low, Sweet Chariot\"]\n\nBut as Thomas Dorsey and the musicians around him started to create the music we now think of as gospel, the Soul Stirrers switched styles, and became one of the first -- and best -- gospel quartets in the new style.\n\nIn the late forties, the Soul Stirrers signed to Specialty Records, one of the first acts to sign to the label, and recorded a series of classic singles led by R.H. Harris, who was regarded by many as the greatest gospel singer of the age:\n\n[Excerpt: The Soul Stirrers feat. R.H. Harris, \"In That Awful Hour\"]\n\nSam Cooke was one of seven children, the son of Reverend Charles Cook and his wife Annie Mae, and from a very early age the Reverend Cook had been training them as singers -- five of them would perform regularly around churches in the area, under the name The Singing Children.\n\nYoung Sam was taught religion by his father, but he was also taught that there was no prohibition in the Bible against worldly success. Indeed the Reverend Cook taught him two things that would matter in his life even more than his religion would. The first was that whatever it is you do in life, you try to do it the best you can -- you never do anything by halves, and if a thing's worth doing it's worth doing properly. And the second was that you do whatever is necessary to give yourself the best possible life, and don't worry about who you step on to do it.\n\nAfter spending some time with his family group, Cooke joined a newly-formed gospel group, who had heard him singing the Ink Spots song \"If I Didn't Care\" to a girl. That group was called the Highway QCs, and a version of the group still exists to this day. Sam Cooke only stayed with them a couple of years, and never recorded with them, but they replaced him with a soundalike singer, Johnnie Taylor, and listening to Taylor's recordings with the group you can get some idea of what they sounded like when Sam was a member:\n\n[Excerpt: Johnnie Taylor and the Highway QCs, \"I Dreamed That Heaven Was Like This\"]\n\nThe rest of the group were decent singers, but Sam Cooke was absolutely unquestionably the star of the Highway QCs. Creadell Copeland, one of the group's members, later said “All we had to do was stand behind Sam. Our claim to fame was that Sam’s voice was so captivating we didn’t have to do anything else.”\n\nThe group didn't make a huge amount of money, and they kept talking about going in a pop direction, rather than just singing gospel songs, and Sam was certainly singing a lot of secular music in his own time -- he loved gospel music as much as anyone, but he was also learning from people like Gene Autry or Bill Kenny of the Ink Spots, and he was slowly developing into a singer who could do absolutely anything with his voice.\n\nBut his biggest influence was still R.H. Harris of the Soul Stirrers, who was the most important person in the gospel quartet field. This wasn't just because he was the most talented of all the quartet singers -- though he was, and that was certainly part of it -- but because he was the joint leader of a movement to professionalise the gospel quartet movement.\n\n(Just as a quick explanation -- in both black gospel, and in the white gospel music euphemistically called \"Southern Gospel\", the term \"quartet\" is used for groups which might have five, six, or even more people in them. I'll generally refer to all of these as \"groups\", because I'm not from the gospel world, but I'll use the term \"quartet\" when talking about things like the National Quartet Convention, and I may slip between the two interchangeably at times. Just know that if I mention quartets, I'm not just talking about groups with exactly four people in them).\n\nHarris worked with a less well known singer called Abraham Battle, and with Charlie Bridges, of another popular group, the Famous Blue Jays:\n\n[Excerpt: The Famous Blue Jay Singers, “Praising Jesus Evermore”]\n\nTogether they founded the National Quartet Convention, which existed to try to take all the young gospel quartets who were springing up all over the place, and most of whom had casual attitudes to their music and their onstage appearance, and teach them how to comport themselves in a manner that the organisation's leaders considered appropriate for a gospel singer.\n\nThe Highway QCs joined the Convention, of course, and they considered themselves to be disciples, in a sense, of the Soul Stirrers, who they simultaneously considered to be their mentors and thought were jealous of the QCs.\n\nIt was normal at the time for gospel groups to turn up at each other's shows, and if they were popular enough they would be invited up to sing, and sometimes even take over the show. When the Highway QCs turned up at Soul Stirrers shows, though, the Soul Stirrers would act as if they didn't know them, and would only invite them on to the stage if the audience absolutely insisted, and would then limit their performance to a single song.\n\nFrom the Highway QCs' point of view, the only possible explanation was that the Soul Stirrers were terrified of the competition. A more likely explanation is probably that they were just more interested in putting on their own show than in giving space to some young kids who thought they were the next big thing.\n\nOn the other hand, to all the younger kids around Chicago, the Highway QCs were clearly the group to beat -- and people like a young singer named Lou Rawls looked up to them as something to aspire to.\n\nAnd soon the QCs found themselves being mentored by R.B. Robinson, one of the Soul Stirrers. Robinson would train them, and help them get better gigs, and the QCs became convinced that they were headed for the big time.\n\nBut it turned out that behind the scenes, there had been trouble in the Soul Stirrers. Harris had, more and more, come to think of himself as the real star of the group, and quit to go solo. It had looked likely for a while that he would do so, and when Robinson had appeared to be mentoring the QCs, what he was actually doing was training their lead singer, so that when R.H. Harris eventually quit, they would have someone to take his place.\n\nThe other Highway QCs were heartbroken, but Sam took the advice of his father, the Reverend Cook, who told him \"Anytime you can make a step higher, you go higher. Don’t worry about the other fellow. You hold up for other folks, and they’ll take advantage of you.\"\n\nAnd so, in March 1951, Sam Cooke went into the studio with the Soul Stirrers for his first ever recording session, three months after joining the group.\n\nArt Rupe, the head of Specialty Records, was not at all impressed that the group had got a new singer without telling him. Rupe had to admit that Cooke could sing, but his performance on the first few songs, while impressive, was no R.H. Harris:\n\n[Excerpt: the Soul Stirrers, \"Come, Let Us Go Back to God\"]\n\nBut towards the end of the session, the Soul Stirrers insisted that they should record \"Jesus Gave Me Water\", a song that had always been a highlight of the Highway QCs' set. Rupe thought that this was ridiculous -- the Pilgrim Travellers had just had a hit with the song, on Specialty, not six months earlier. What could Specialty possibly do with another version of the song so soon afterwards?\n\nBut the group insisted, and the result was absolutely majestic:\n\n[Excerpt: The Soul Stirrers, \"Jesus Gave Me Water\"]\n\nRupe lost his misgivings, both about the song and about the singer -- that was clearly going to be the group's next single.\n\nThe group themselves were still not completely sure about Cooke as their singer -- he was younger than the rest of them, and he didn't have Harris' assurance and professionalism, yet. But they knew they had something with that song, which was released with \"Peace in the Valley\" on the B-side. That song had been written by Thomas Dorsey fourteen years earlier, but this was the first time it had been released on a record, at least by anyone of any prominence.\n\n\"Jesus Gave Me Water\" was a hit, but the follow-ups were less successful, and meanwhile Art Rupe was starting to see the commercial potential in black styles of music other than gospel. Even though Rupe loved gospel music, he realised when \"Lawdy Miss Clawdy\" became the biggest hit Specialty had ever had to that point that maybe he should refocus the label away from gospel and towards more secular styles of music.\n\n“Jesus Gave Me Water” had consolidated Sam as the lead singer of the Soul Stirrers, but while he was singing gospel, he wasn't living a very godly life. He got married in 1953, but he'd already had at least one child with another woman, who he left with the baby, and he was sleeping around constantly while on the road, and more than once the women involved became pregnant. But Cooke treated women the same way he treated the groups he was in – use them for as long as they've got something you want, and then immediately cast them aside once it became inconvenient.\n\nFor the next few years, the Soul Stirrers would have one recording session every year, and the group continued touring, but they didn't have any breakout success, even as other Specialty acts like Lloyd Price, Jesse Belvin, and Guitar Slim were all selling hand over fist. The Soul Stirrers were more popular as a live act than as a recording act, and hearing the live recording of them that Bumps Blackwell produced in 1955, it's easy to see why:\n\n[Excerpt: Sam Cooke and the Soul Stirrers, \"Nearer to Thee\"]\n\nBumps Blackwell was convinced that Cooke needed to go solo and become a pop singer, and he was more convinced than ever when he produced the Soul Stirrers in the studio for the first time.\n\nThe reason, actually, was to do with Cooke's laziness. They'd gone into the studio, and it turned out that Cooke hadn't written a song, and they needed one. The rest of the group were upset with him, and he just told them to hand him a Bible. He started flipping through, skimming to find something, and then he said \"I got one\". He told the guitarist to play a couple of chords, and he started singing -- and the song that came out, improvised off the top of his head, \"Touch the Hem of His Garment\", was perfect just as it was, and the group quickly cut it:\n\n[Excerpt: Sam Cooke and the Soul Stirrers, \"Touch the Hem of His Garment\"]\n\nBlackwell knew then that Cooke was a very, very special talent, and he and the rest of the people at Specialty became more and more insistent as 1956 went on that Sam Cooke should become a secular solo performer, rather than performing in a gospel group. The Soul Stirrers were only selling in the low tens of thousands -- a reasonable amount for a gospel group, but hardly the kind of numbers that would make anyone rich. Meanwhile, gospel-inspired performers were having massive hits with gospel songs with a couple of words changed.\n\nThere's an episode of South Park where they make fun of contemporary Christian music, saying you just have to take a normal song and change the word \"Baby\" to \"Jesus\". In the mid-fifties things seemed to be the other way -- people were having hits by taking Gospel songs and changing the word \"Jesus\" to \"baby\", or near as damnit. Most famously and blatantly, there was Ray Charles, who did things like take \"This Little Light of Mine\":\n\n[Excerpt: The Louvin Brothers, \"This Little Light of Mine\"]\n\nand turn it into \"This Little Girl of Mine:\n\n[Excerpt: Ray Charles, \"This Little Girl of Mine\"]\n\nBut there were a number of other acts doing things that weren't that much less blatant.\n\nAnd so Sam Cooke travelled to New Orleans, to record in Cosimo Matassa's studio with the same musicians who had been responsible for so many rock and roll hits. Or, rather, Dale Cook did.\n\nSam was still a member of the Soul Stirrers at the time, and while he wanted to make himself into a star, he was also concerned that if he recorded secular music under his own name, he would damage his career as a gospel singer, without necessarily getting a better career to replace it. So the decision was made to put the single out under the name \"Dale Cook\", and maintain a small amount of plausible deniability. If necessary, they could say that Dale was Sam's brother, because it was fairly well known that Sam came from a singing family, and indeed Sam's brother L.C. (whose name was just the initials L.C.) later went on to have some minor success as a singer himself, in a style very like Sam's.\n\nAs his first secular recording, they decided to record a new version of a gospel song that Cooke had recorded with the Soul Stirrers, \"Wonderful\":\n\n[Excerpt: Sam Cooke and the Soul Stirrers, \"Wonderful\"]\n\nOne quick rewrite later, and that song became, instead, \"Lovable\":\n\n[Excerpt: Dale Cook, \"Lovable\"]\n\nAround the time of the Dale Cook recording session, Sam's brother L.C. went to Memphis, with his own group, where they appeared at the bottom of the bill for a charity Christmas show in aid of impoverished black youth. The lineup of the show was almost entirely black – people like Ray Charles, B.B. King, Rufus Thomas, and so on – but Elvis Presley turned up briefly to come out on stage and wave to the crowd and say a few words – the Colonel wouldn't allow him to perform without getting paid, but did allow him to make an appearance, and he wanted to support the black community in Memphis.\n\nBackstage, Elvis was happy to meet all the acts, but when he found out that L.C. was Sam's brother, he spent a full twenty minutes talking to L.C. about how great Sam was, and how much he admired his singing with the Soul Stirrers.\n\nSam was such a distinctive voice that while the single came out as by \"Dale Cook\", the DJs playing it would often introduce it as being by \"Dale Sam Cook\", and the Soul Stirrers started to be asked if they were going to sing \"Lovable\" in their shows.\n\nSam started to have doubts as to whether this move towards a pop style was really a good idea, and remained with the Soul Stirrers for the moment, though it's noticeable that songs like \"Mean Old World\" could easily be refigured into being secular songs, and have only a minimal amount of religious content:\n\n[Excerpt: Sam Cooke and the Soul Stirrers, \"Mean Old World\"]\n\nBut barely a week after the session that produced “Mean Old World”, Sam was sending Bumps Blackwell demos of new pop songs he'd written, which he thought Blackwell would be interested in producing. Sam Cooke was going to treat the Soul Stirrers the same way he'd treated the Highway QCs.\n\nCooke flew to LA, to meet with Blackwell and with Clifton White, a musician who had been for a long time the guitarist for the Mills Brothers, but who had recently left the band and started working with Blackwell as a session player. White was very unimpressed with Cooke – he thought that the new song Cooke sang to them, \"You Send Me\", was just him repeating the same thing over and over again.\n\nArt Rupe helped them whittle the song choices down to four. Rupe had very particular ideas about what made for a commercial record – for example, that a record had to be exactly two minutes and twenty seconds long – and the final choices for the session were made with Rupe's criteria in mind. The songs chosen were \"Summertime\", \"You Send Me\", another song Sam had written called \"You Were Made For Me\", and \"Things You Do to Me\", which was written by a young man Bumps Blackwell had just taken on as his assistant, named Sonny Bono.\n\nThe recording session should have been completely straightforward. Blackwell supervised it, and while the session was in LA, almost everyone there was a veteran New Orleans player – along with Clif White on guitar there was René Hall, a guitarist from New Orleans who had recently quit Billy Ward and the Dominoes, and acted as instrumental arranger; Harold Battiste, a New Orleans saxophone player who Bumps had taken under his wing, and who wasn't playing on the session but ended up writing the vocal arrangements for the backing singers; Earl Palmer, who had just moved to LA from New Orleans and was starting to make a name for himself as a session player there after his years of playing with Little Richard, Lloyd Price, and Fats Domino in Cosimo Matassa's studio, and Ted Brinson, the only LA native, on bass -- Brinson was a regular player on Specialty sessions, and also had connections with almost every LA R&B act, to the extent that it was his garage that \"Earth Angel\" by the Penguins had been recorded in.\n\nAnd on backing vocals were the Lee Gotch singers, a white vocal group who were among the most in-demand vocalists in LA.\n\nSo this should have been a straightforward session, and it was, until Art Rupe turned up just after they'd recorded \"You Send Me\":\n\n[Excerpt: Sam Cooke, \"You Send Me\"]\n\nRupe was horrified that Bumps and Battiste had put white backing vocalists behind Cooke's vocals. They were, in Rupe's view, trying to make Sam Cooke sound like Billy Ward and his Dominoes at best, and like a symphony orchestra at worst. The Billy Ward reference was because René Hall had recently arranged a version of \"Stardust\" for the Dominoes:\n\n[Excerpt: Billy Ward and the Dominoes, \"Stardust\"]\n\nAnd the new version of \"Summertime\" had some of the same feel:\n\n[Excerpt: Sam Cooke, \"Summertime\"]\n\nIf Sam Cooke was going to record for Specialty, he wasn't going to have *white* vocalists backing him. Rupe wanted black music, not something trying to be white -- and the fact that he, a white man, was telling a room full of black musicians what counted as black music, was not lost on Bumps Blackwell.\n\nEven worse than the whiteness of the singers, though, was that some of them were women.\n\nRupe and Blackwell had already had one massive falling-out, over \"Rip it Up\" by Little Richard. When they'd agreed to record that, Blackwell had worked out an arrangement beforehand that Rupe was happy with -- one that was based around piano triplets. But then, when he'd been on the plane to the session, Blackwell had hit upon another idea -- to base the song around a particular drum pattern:\n\n[Excerpt: Little Richard, \"Rip it Up\"]\n\nRupe had nearly fired Blackwell over that, and only relented when the record became a massive hit. Now that instead of putting a male black gospel group behind Cooke, as agreed, Blackwell had disobeyed him a second time and put white vocalists, including women, behind him, Rupe decided it was the last straw. Blackwell had to go.\n\nHe was also convinced that Sam Cooke was only after money, because once Cooke discovered that his solo contract only paid him a third of the royalties that the Soul Stirrers had been getting as a group, he started pushing for a greater share of the money. Rupe didn't like that kind of greed from his artists -- why *should* he pay the artist more than one cent per record sold? But he still owed Blackwell a great deal of money. They eventually came to an agreement -- Blackwell would leave Specialty, and take Sam Cooke, and Cooke's existing recordings with him, since he was so convinced that they were going to be a hit. Rupe would keep the publishing rights to any songs Sam wrote, and would have an option on eight further Sam Cooke recordings in the future, but Cooke and Blackwell were free to take \"You Send Me\", \"Summertime\", and the rest to a new label that wanted them for its first release, Keen.\n\nWhile they waited around for Keen to get itself set up, Sam made himself firmly a part of the Central Avenue music scene, hanging around with Gaynel Hodge, Jesse Belvin, Dootsie Williams, Googie Rene, John Dolphin, and everyone else who was part of the LA R&B community. Meanwhile, the Soul Stirrers got Johnnie Taylor, the man who had replaced Sam in the Highway QCs, to replace him in the Stirrers. While Sam was out of the group, for the next few years he would be regularly involved with them, helping them out in recording sessions, producing them, and more.\n\nWhen the single came out, everyone thought that \"Summertime\" would be the hit, but \"You Send Me\" quickly found itself all over the airwaves and became massive:\n\n[Excerpt: Sam Cooke, \"You Send Me\"]\n\nSeveral cover versions came out almost immediately. Sam and Bumps didn't mind the versions by Jesse Belvin:\n\n[Excerpt: Jesse Belvin, \"You Send Me\"]\n\nOr Cornell Gunter:\n\n[Excerpt: Cornell Gunter, \"You Send Me\"]\n\nThey were friends and colleagues, and good luck to them if they had a hit with the song -- and anyway, they knew that Sam's version was better. What they did object to was the white cover version by Teresa Brewer:\n\n[Excerpt: Teresa Brewer, \"You Send Me\"]\n\nEven though her version was less of a soundalike than the other LA R&B versions, it was more offensive to them -- she was even copying Sam's \"whoa-oh\"s. She was nothing more than a thief, Blackwell argued -- and her version was charting, and made the top ten.\n\nFortunately for them, Sam's version went to number one, on both the R&B and pop charts, despite a catastrophic appearance on the Ed Sullivan Show, which accidentally cut him off half way through a song.\n\nBut there was still trouble with Art Rupe. Sam was still signed to Rupe's company as a songwriter, and so he'd put \"You Send Me\" in the name of his brother L.C., so Rupe wouldn't get any royalties. Rupe started legal action against him, and meanwhile, he took a demo Sam had recorded, \"I'll Come Running Back To You\", and got René Hall and the Lee Gotch singers, the very people whose work on \"You Send Me\" and \"Summertime\" he'd despised so much, to record overdubs to make it sound as much like \"You Send Me\" as possible:\n\n[Excerpt: Sam Cooke, \"I'll Come Running Back To You\"]\n\nAnd in retaliation for *that* being released, Bumps Blackwell took a song that he'd recorded months earlier with Little Richard, but which still hadn't been released, and got the Specialty duo Don and Dewey to provide instrumental backing for a vocal group called the Valiants, and put it out on Keen:\n\n[Excerpt: The Valiants, \"Good Golly Miss Molly\"]\n\nSpecialty had to rush-release Little Richard's version to make sure it became the hit -- a blow for them, given that they were trying to dripfeed the public what few Little Richard recordings they had left.\n\nAs 1957 drew to a close, Sam Cooke was on top of the world. But the seeds of his downfall were already in place. He was upsetting all the right people with his desire to have control of his own career, but he was also hurting a lot of other people along the way -- people who had helped him, like the Highway QCs and the Soul Stirrers, and especially women. He was about to divorce his first wife, and he had fathered a string of children with different women, all of whom he refused to acknowledge or support.\n\nHe was taking his father's maxims about only looking after yourself, and applying them to every aspect of life, with no regard to who it hurt. But such was his talent and charm, that even the people he hurt ended up defending him. Over the next couple of times we see Sam Cooke, we'll see him rising to ever greater artistic heights, but we'll also see the damage he caused to himself and to others. Because the story of Sam Cooke gets very, very unpleasant.",
  "enclosure": "",
  "itunes:summary": "Episode sixty of&nbsp;A History of Rock Music in Five Hundred Songs&nbsp;looks at \"You Send Me\" by Sam Cooke Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,&nbsp;on \"Little Darlin'\" by The Gladiolas.\n\nAlso, an announcement -- the book version of the first fifty episodes is now available for purchase. See the show notes, or the&nbsp;previous mini-episode announcing this, for details.\n\n\n\nResources\n\nMy main source for this episode is&nbsp;Dream Boogie: The Triumph of Sam Cooke&nbsp;by Peter Guralnick. Like all Guralnick's work, it's an essential book if you're even slightly interested in the subject.\n\nThis&nbsp;is the best compilation of Sam Cooke's music for the beginner.\n\nA note on spelling: Sam Cooke was born Sam Cook, the rest of his family all kept the surname Cook, and he only added the \"e\" from the release of \"You Send Me\", so for almost all the time covered in this episode he was Cook. I didn't feel the need to mention this in the podcast, as the two names are pronounced identically. I've spelled him as Cooke and everyone else as Cook throughout.\n\nBook of the Podcast\n\nRemember that there's a book available based on the first fifty episodes of the podcast. You can buy it at&nbsp;this link, which will take you to your preferred online bookstore.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;Why not join them?\n\nTranscript\n\nWe've talked before about how the music that became known as soul had its roots in gospel music, but today we're going to have a look at the first big star of that music to get his start as a professional gospel singer, rather than as a rhythm and blues singer who included a little bit of gospel feeling.\n\nSam Cooke was, in many ways, the most important black musician of the late fifties and early sixties, and without him it's doubtful whether we would have the genre of soul as we know it today. But when he started out, he was someone who worked exclusively in the gospel field, and within that field he was something of a superstar.\n\nHe was also someone who, as admirable as he was as a singer, was far less admirable in his behaviour towards other people, especially the women in his life, and while that's something that will come up more in future episodes, it's worth noting here.\n\nCooke started out as a teenager in the 1940s, performing in gospel groups around Chicago, which as we've talked about before was the city where a whole new form of gospel music was being created at that point, spearheaded by Thomas Dorsey. Dorsey, Mahalia Jackson, and Sister Rosetta Tharpe were all living and performing in the city during young Sam's formative years, but the biggest influence on him was a group called the Soul Stirrers.\n\nThe Soul Stirrers had started out in 1926 as a group in what was called the \"jubilee\" style -- the style that black singers of spiritual music sang in the period before Thomas Dorsey revolutionised gospel music. There are no recordings of the Soul Stirrers in that style, but this is probably the most famous jubilee recording:\n\n[Excerpt: The Fisk Jubilee Singers, \"Swing Low, Sweet Chariot\"]\n\nBut as Thomas Dorsey and the musicians around him started to create the music we now think of as gospel, the Soul Stirrers switched styles, and became one of the first -- and best -- gospel quartets in the new style.\n\nIn the late forties, the Soul Stirrers signed to Specialty Records, one of the first acts to sign to the label, and recorded a series of classic singles led by R.H. Harris, who was regarded by many as the greatest gospel singer of the age:\n\n[Excerpt: The Soul Stirrers feat. R.H. Harris, \"In That Awful Hour\"]\n\nSam Cooke was one of seven children, the son of Reverend Charles Cook and his wife Annie Mae, and from a very early age the Reverend Cook had been training them as singers -- five of them would perform regularly around churches in th",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode sixty of&nbsp;A History of Rock Music in Five Hundred Songs&nbsp;looks at \"You Send Me\" by Sam Cooke Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,&nbsp;on \"Little Darlin'\" by The Gladiolas.\n\nAlso, an announcement -- the book version of the first fifty episodes is now available for purchase. See the show notes, or the&nbsp;previous mini-episode announcing this, for details.\n\n\n\nResources\n\nMy main source for this episode is&nbsp;Dream Boogie: The Triumph of Sam Cooke&nbsp;by Peter Guralnick. Like all Guralnick's work, it's an essential book if you're even slightly interested in the subject.\n\nThis&nbsp;is the best compilation of Sam Cooke's music for the beginner.\n\nA note on spelling: Sam Cooke was born Sam Cook, the rest of his family all kept the surname Cook, and he only added the \"e\" from the release of \"You Send Me\", so for almost all the time covered in thi",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}