{
  "title": "the psychology of the enterprise buyer",
  "link": "https://medriscoll.com/2013/03/25/enterprises-are-from-mars-start-ups-are-from-venus/",
  "comments": "https://medriscoll.com/2013/03/25/enterprises-are-from-mars-start-ups-are-from-venus/#respond",
  "dc:creator": "Michael Driscoll",
  "pubDate": "Mon, 25 Mar 2013 04:00:00 +0000",
  "category": "Uncategorized",
  "guid": "https://medriscoll.com/2013/03/25/enterprises-are-from-mars-start-ups-are-from-venus/",
  "description": "<p>Consumer startups like Facebook, Twitter, Pinterest, and even DropBox are built by founders who wanted to “make something cool” for their own benefit. Their teams intuitively understand what works because they are their own target audience: young, tech-savvy people looking for better ways to connect, share, and organize their digital stuff. When it comes to<a class=\"more-link\" href=\"https://medriscoll.com/2013/03/25/enterprises-are-from-mars-start-ups-are-from-venus/\">Continue reading <span class=\"screen-reader-text\">\"the psychology of the enterprise buyer\"</span></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://medriscoll.com/2013/03/25/enterprises-are-from-mars-start-ups-are-from-venus/\">the psychology of the enterprise buyer</a> appeared first on <a rel=\"nofollow\" href=\"https://medriscoll.com\">m. e. driscoll</a>.</p>\n",
  "content:encoded": "\n<div class=\"wp-block-image tmblr-full\"><figure class=\"aligncenter\"><img decoding=\"async\" src=\"https://i0.wp.com/64.media.tumblr.com/dc572e0bd4e24d4de1ce4cdf2ba9cf37/tumblr_inline_pc7phi5sZo1qhkweo_540.jpg?w=750&#038;ssl=1\" alt=\"image\" data-recalc-dims=\"1\" /></figure></div>\n\n\n\n<p>Consumer startups like Facebook, Twitter, Pinterest, and even DropBox are built by founders who wanted to “make something cool” for their own benefit. Their teams intuitively understand what works because they are their own target audience: young, tech-savvy people looking for better ways to connect, share, and organize their digital stuff.</p>\n\n\n\n<p><strong>When it comes to buyer psychology, corporations are not people</strong></p>\n\n\n\n<p>By contrast, the challenge for enterprise startups, is that corporations are not really people (their legal personhood aside) — and certainly not our people.</p>\n\n\n\n<p>When you’re hungry for lunch, you go and buy a sandwich for a few dollars. When an enterprise is hungry for lunch, it solicits bids from multiple catering companies, negotiates for weeks to months, and signs a contract for a few million dollars.</p>\n\n\n\n<p>This gap between the psychology of enterprises and the startups that sell to them is a challenge that consumer startups do not face. Worse, early team members in startups have limited enterprise experience; they are a poor fit to the process-orientation and risk-aversion (or to put it more kindly, risk-balancing) that is rewarded at the higher levels of corporate environments.</p>\n\n\n\n<p><strong>Less Goldilocks, more Dunder-Mifflin</strong></p>\n\n\n\n<p>Lacking this enterprise DNA, younger startups often build their sales processes in the image of how startups buy rather than how enterprises buy. When startups seek to purchase a software solution, they favor simple, scalable pricing: click a box, swipe a credit card, and start running. Hence the canonical three-column SaaS pricing page (call it Goldilocks pricing) that you see at many SaaS companies—where the middle column invariably feels “just right.”</p>\n\n\n\n<p>But large enterprise buyers are less adventure-embracing Goldilocks, and more&nbsp;<em>The Office</em>’s Dunder Mifflin. They require more than three sizes of self-serve, they don’t do click-through contracts, and they rarely pay with credit cards. The reasons are both economic and cultural. Economically, as buying decisions grow larger, the cost of sales — product customization, negotiated contracts, and invoicing — become marginally small. Culturally, Fortune 500 companies expect to have a relationship.</p>\n\n\n\n<p>As Box CEO Aaron Levie recently told me, “Look, when Coca Cola writes you a big check, they want to meet you in person.”</p>\n\n\n\n<p><strong>Silicon Valley IT is not enterprise IT</strong></p>\n\n\n\n<p>Startups also often underestimate the importance of professional services and training for enterprises. They believe every company has a cadre of engineers smart enough to set up and tailor an application accordingly, and business users who can quickly figure it out — whether it be Google Analytics, Hubspot, or Expensify — and get up and running.</p>\n\n\n\n<p>But this is not the case in most enterprises. The success of firms like RedHat, MySQL AB, and more recently, Cloudera, testify to the enormous value lies in integration and support, even when that software – whether Linux, MySQL, or Hadoop – is free and open-source.</p>\n\n\n\n<p><strong>Seasoned sales executives: The “growth hackers” of enterprise startups</strong></p>\n\n\n\n<p>As the venture investing pendulum swings back towards enterprise technology companies, founders and venture capitalists will need to augment their teams with sales executives who can nimbly step around the often woolly, sometimes mammoth challenges of contract negotiations, channel partnerships, and client services engagements. These experienced leaders will be the “growth hackers” of the enterprise realm.</p>\n\n\n\n<p><em>This essay originally appeared in <a href=\"http://venturebeat.com/2013/03/25/startups-are-from-mars-enterprises-are-from-venus/\" target=\"_blank\" rel=\"noopener\">VentureBeat.</a>&nbsp;</em></p>\n<p>The post <a rel=\"nofollow\" href=\"https://medriscoll.com/2013/03/25/enterprises-are-from-mars-start-ups-are-from-venus/\">the psychology of the enterprise buyer</a> appeared first on <a rel=\"nofollow\" href=\"https://medriscoll.com\">m. e. driscoll</a>.</p>\n",
  "wfw:commentRss": "https://medriscoll.com/2013/03/25/enterprises-are-from-mars-start-ups-are-from-venus/feed/",
  "slash:comments": 0,
  "post-id": 71
}