{
  "title": "Turing Award Winner On His Pioneering Algorithms",
  "link": "https://spectrum.ieee.org/2021-turing-award-winner",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/man-in-blue-sweater-posing-in-front-of-a-white-board.jpg?id=30298777&width=2000&height=1500&coordinates=0%2C0%2C226%2C0\"/><br/><br/><p>\n<a href=\"https://netlib3.cs.utk.edu/utk/people/JackDongarra/index.html\" rel=\"noopener noreferrer\" target=\"_blank\">Jack Dongarra</a>’s dream job growing up was to teach science at a public high school in Chicago.\n</p><p>\n\t“I was pretty good in math and science, but I wasn’t a particularly good student,” Dongarra says, laughing.\n</p><p>\n\tAfter he graduated high school, there was only one university he wanted to attend:<a href=\"https://www.csu.edu/\" rel=\"noopener noreferrer\" target=\"_blank\"> Chicago State</a>. That’s because, he says, it was known for “churning out teachers.” Chicago State accepted his application, and he decided to major in mathematics.\n</p><hr/><p>\n\tHis physics professor suggested that Dongarra apply for an internship at the<a href=\"https://www.anl.gov/\" rel=\"noopener noreferrer\" target=\"_blank\"> Argonne National Laboratory</a>, in Lemont, Ill., a nearby U.S. <a href=\"https://www.energy.gov/\" rel=\"noopener noreferrer\" target=\"_blank\">Department of Energy</a> science and engineering research center. For 16 weeks he worked with a group of researchers designing and developing<a href=\"https://en.wikipedia.org/wiki/EISPACK\" rel=\"noopener noreferrer\" target=\"_blank\"> EISPACK</a>, a package of Fortran routines that compute the eigenvalues and eigenvectors of matrices—calculations common in scientific computing.\n</p><p>\n\tDongarra acknowledges he didn’t have a background in or knowledge of eigenvalues and eigenvectors—or of linear algebra—but he loved what he was doing. The experience at Argonne, he says, was transformative. He had found his passion.\n</p><p>\n\t“I thought it was a cool thing to do,” he says, “so I kept pursuing it.”\n</p><h3>About Jack Dongarra</h3><br/><p><strong></strong><strong>Employer: </strong>University of Tennessee, Knoxville</p><p><strong>Title: </strong>Professor emeritus, computer science</p><p><strong>Member grade: </strong>Life Fellow</p><p><strong>Alma mater: </strong>Chicago State University</p><p>\n\tThe IEEE Life Fellow has since made pioneering contributions to numerical algorithms and libraries for linear algebra, which allowed software to make good use of high-performance hardware. His open-source software libraries are used in just about every computer, from laptops to the world’s fastest supercomputers.\n</p><p>\n\tThe libraries include basic linear algebra subprograms (<a href=\"https://en.wikipedia.org/wiki/Basic_Linear_Algebra_Subprograms\" rel=\"noopener noreferrer\" target=\"_blank\">BLAS</a>), the linear-algebra package <a href=\"https://en.wikipedia.org/wiki/LAPACK\" rel=\"noopener noreferrer\" target=\"_blank\">LAPACK</a>, parallel virtual machines (<a href=\"https://en.wikipedia.org/wiki/Parallel_Virtual_Machine\" rel=\"noopener noreferrer\" target=\"_blank\">PVMs</a>), automatically tuned linear algebra software (<a href=\"https://en.wikipedia.org/wiki/Automatically_Tuned_Linear_Algebra_Software\" rel=\"noopener noreferrer\" target=\"_blank\">ATLAS</a>), and the high-performance conjugate gradient <a href=\"https://en.wikipedia.org/wiki/HPCG_benchmark\" rel=\"noopener noreferrer\" target=\"_blank\">(HPCG)</a> benchmark.\n</p><p>\n\tFor his work, he was honored this year with the 2021<a href=\"https://amturing.acm.org/\" rel=\"noopener noreferrer\" target=\"_blank\"> A.M. Turing Award</a> from the<a href=\"https://www.acm.org/\" rel=\"noopener noreferrer\" target=\"_blank\"> Association for Computing Machinery</a>. He received US $1 million as part of the award, which is known as the Nobel Prize of computing.\n</p><p>\n\t\t\t“When I think about previous Turing Award recipients, I’m humbled to think about what I’ve learned from their books and papers,” Dongarra says. “Their programming languages, theorems, techniques, and standards have helped me develop my algorithms.\n\t\t</p><p>\n\t\t\t“It’s a tremendous honor to be this year’s recipient. The award is a recognition by the computer-science community that the contributions we are making in high-performance computing are important and have an impact in the broader computer-science community and science in general.”\n\t\t</p><p>\n\t\t\tDongarra didn’t end up teaching science to high school students. Instead, he became a professor of electrical engineering and computer science at the<a href=\"https://www.utk.edu/\" rel=\"noopener noreferrer\" target=\"_blank\"> University of Tennessee</a> in Knoxville, where he taught for 33 years. The university recently named him professor emeritus.\n\t\t</p><h2>Entrepreneurial Spirit</h2><p>\n\tAfter graduating from Chicago State in 1972 with a bachelor’s degree in mathematics, Dongarra went on to pursue a master’s degree in computer science at the<a href=\"https://www.iit.edu/\" rel=\"noopener noreferrer\" target=\"_blank\"> Illinois Institute of Technology</a>, also in Chicago. While there he worked one day a week for Argonne with the same team of researchers. After he got his degree in 1973, the lab hired him full time as a researcher.\n</p><p>\n\tWith encouragement from his colleagues to pursue a Ph.D., he left the lab to study applied mathematics at the<a href=\"https://www.unm.edu/\" rel=\"noopener noreferrer\" target=\"_blank\"> University of New Mexico</a> in Albuquerque. He honed his knowledge of linear algebra there and began working out algorithms and writing software.\n</p><p>\n\tHe returned to Argonne after getting his doctorate in 1980 and worked there as a senior scientist until 1989, when he got the opportunity to fulfill his dream of teaching.\n</p><p>\n\tHe was offered a joint position teaching computer science at the University of Tennessee and conducting research at the nearby<a href=\"https://www.ornl.gov/\" rel=\"noopener noreferrer\" target=\"_blank\"> Oak Ridge National Laboratory</a> which, like Argonne, is a Department of Energy facility.\n</p><p>\n\t“It was time for me to try out some new things,” he says. “I was ready to try my hand at academia.”\n</p><p>\n\tHe says Oak Ridge operated in a similar way to Argonne, and the culture there was more or less the same.\n</p><p>\n\t“The challenge,” he says, “was becoming a university professor.”\n</p><p class=\"pull-quote\">\"The Turing Award is a recognition by the computer science community that the contributions we are making in high-performance computing are important, and have an impact in the broader computer science community and science in general.”</p><p>University culture is very different from that at a government laboratory, he says, but he quickly fell into the rhythm of the academic setting.\n</p><p>\n\tAlthough he loved teaching, he says, he also was attracted to the opportunity the university gave its instructors to work on technology they are passionate about.\n</p><p>\n\t“You follow your own path and course of research,” he says. “I’ve prospered in that environment. I interact with smart people, I have the ability to travel around the world, and I have collaborations going on with people in many countries.\n</p><p>\n\t“Academia gives you this freedom to do things and not be constrained by a company’s drive or its motivation. Rather, I get to work on what motivates me. That’s why I’ve stayed in academia for so many years.”\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Man with glasses and checkered shirt sitting in front of a Tektronix computer.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"f75ef322062e4ffb0960422014ccfa71\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"cb1e5\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/man-with-glasses-and-checkered-shirt-sitting-in-front-of-a-tektronix-computer.jpg?id=30298837&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">In 1980, Dongarra worked as a senior scientist at Argonne National Laboratory, in Lemont, Ill.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Jack Dongarra</small></p><p>\n\tDongarra founded the university’s<a href=\"https://www.icl.utk.edu/\" rel=\"noopener noreferrer\" target=\"_blank\"> Innovative Computing Laboratory</a>, whose mission is to provide tools for high-performance computing to the scientific community. He also directs the school’s <a href=\"https://citr.utk.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">Center for Information Technology Research</a>.\n</p><p>\n\tHe is now a distinguished researcher at Oak Ridge, which he calls “a wonderful place, with its state-of-the-art equipment and the latest computers.”\n</p><h2>Software for Supercomputers</h2><p>\n\tIt was working in creative environments that led Dongarra to come up with what many describe as world-changing software libraries, which have contributed to the growth of high-performance computing in many areas including artificial intelligence, data analytics, genomics, and health care.\n</p><p>\n\t“The libraries we designed have basic components that are needed in many areas of science so that users can draw on those components to help them solve their computational problems,” he says. “That software is portable and efficient. It has all the attributes that we want in terms of being understandable and providing reliable results.”\n</p><p>\n\tHe’s currently working on creating a software library for the world’s fastest supercomputer, <a href=\"https://spectrum.ieee.org/frontier-exascale-supercomputer\" target=\"_self\">Frontier</a>, which recently was installed at the Oak Ridge lab. It is the first computer that can process more than 1 quintillion operations per second.\n</p><h2>Computer-Science Recognition</h2><p>\n\tDongarra has been an IEEE member for more than 30 years.\n</p><p>\n\t“I enjoy interacting with the community,” he says in explaining why he continues to belong. “Also I enjoy reading <em>IEEE Spectrum</em> and journals that are relevant to my specific field.”\n</p><p>\n\tHe has served as an editor for several IEEE journals including <a href=\"https://proceedingsoftheieee.ieee.org/\" rel=\"noopener noreferrer\" target=\"_blank\"><em>Proceedings of the IEEE</em></a>, <a href=\"https://www.computer.org/csdl/journal/ca\" rel=\"noopener noreferrer\" target=\"_blank\"><em>IEEE Computer Architecture Letters</em></a>, and <a href=\"https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=71\" rel=\"noopener noreferrer\" target=\"_blank\"><em>IEEE Transactions on Parallel and Distributed Systems</em></a>.\n</p><p>\n\tDongarra says he’s a big promoter of IEEE meetings and workshops, especially the<a href=\"https://sc22.supercomputing.org/\" rel=\"noopener noreferrer\" target=\"_blank\"> International Conference for High Performance Computing, Networking, Storage, and Analysis</a>, sponsored by ACM and the<a href=\"http://computer.org\" rel=\"noopener noreferrer\" target=\"_blank\"> IEEE Computer Society</a>, of which he is a member. He’s been attending the event every year since 1988. He has won many awards at the conference for his papers.\n</p><p>\n\t“That conference is really a homecoming for the high-performance computing community,” he says, “and IEEE plays a major role.”\n</p><p>\n\tIEEE is proud of Dongarra’s contributions to computing and has honored him over the years. In 2008 he received the first<a href=\"http://www.ieee-tcsc.org/achievement.php\" rel=\"noopener noreferrer\" target=\"_blank\"> IEEE Medal of Excellence in Scalable Computing</a>. He also received the 2020 <a href=\"https://www.eecs.utk.edu/jack-dongarra-selected-to-receive-the-2020-ieee-computer-societys-computer-pioneer-award/\" rel=\"noopener noreferrer\" target=\"_blank\">Computer Pioneer Award</a>, the 2013<a href=\"https://awards.acm.org/kennedy/award-winners\" rel=\"noopener noreferrer\" target=\"_blank\"> ACM/IEEE Ken Kennedy Award</a>, the 2011<a href=\"https://www.computer.org/volunteering/awards/babbage\" rel=\"noopener noreferrer\" target=\"_blank\"> IEEE Charles Babbage Award</a> and the 2003<a href=\"https://www.sighpc.org/celebrate/sid-fernbach-award\" rel=\"noopener noreferrer\" target=\"_blank\"> Sidney Fernbach Award</a>.\n</p><p>\n\t“I’m very happy and proud to be a member of IEEE,” he says. “I think it provides a valuable service to the community.”\n</p>",
  "pubDate": "Wed, 27 Jul 2022 18:00:00 +0000",
  "guid": "https://spectrum.ieee.org/2021-turing-award-winner",
  "category": [
    "Ieee member news",
    "Supercomputers",
    "Careers",
    "Ieee computer society",
    "Awards",
    "High-performance computing",
    "Computing",
    "Computers",
    "Software",
    "Software libraries",
    "Type:ti"
  ],
  "dc:creator": "Kathy Pretz",
  "media:content": ""
}