{
  "guid": "78a8f6c1-9638-4616-ae3d-858726713c86",
  "title": "Protect the Tradition",
  "description": "<p>It’s Election Day in Southlake, Texas — time to see if all the fighting over the school district’s Cultural Competence Action Plan translates into votes. A handful of candidates and supporters who want to see new diversity programs rally in Town Square, across from a much larger, rowdier crowd of those backing the conservative slate. “It’s a great town,” one voter shouts over her shoulder. “We want to keep it that way.” After the votes are counted, Southlake becomes a national poster child in the movement to redefine and root out critical race theory. Stuck in the middle is Lane Ledbetter, Carroll’s new school superintendent, who is tasked with bringing the community together — but in a rare interview, he struggles to answer questions about racism in Southlake. On graduation day, Nikki Olaleye says she hopes Southlake’s future doesn’t mirror its past.</p>\n",
  "pubDate": "Mon, 27 Sep 2021 08:00:00 +0000",
  "author": "news.podcasts@nbcuni.com (Antonia Hylton, Mike Hixenbaugh)",
  "link": "https://www.nbcnews.com/southlake-podcast",
  "content:encoded": "<p>It’s Election Day in Southlake, Texas — time to see if all the fighting over the school district’s Cultural Competence Action Plan translates into votes. A handful of candidates and supporters who want to see new diversity programs rally in Town Square, across from a much larger, rowdier crowd of those backing the conservative slate. “It’s a great town,” one voter shouts over her shoulder. “We want to keep it that way.” After the votes are counted, Southlake becomes a national poster child in the movement to redefine and root out critical race theory. Stuck in the middle is Lane Ledbetter, Carroll’s new school superintendent, who is tasked with bringing the community together — but in a rare interview, he struggles to answer questions about racism in Southlake. On graduation day, Nikki Olaleye says she hopes Southlake’s future doesn’t mirror its past.</p>\n",
  "enclosure": "",
  "itunes:title": "Protect the Tradition",
  "itunes:author": "Antonia Hylton, Mike Hixenbaugh",
  "itunes:duration": "00:39:24",
  "itunes:summary": "It’s Election Day in Southlake, Texas — time to see if the fight over the Carroll school district’s Cultural Competence Action Plan translates into votes.",
  "itunes:subtitle": "It’s Election Day in Southlake, Texas — time to see if the fight over the Carroll school district’s Cultural Competence Action Plan translates into votes.",
  "itunes:keywords": "partisan, councilman, education, high school, carroll, racist, john huffman, council, southlake, blm, texas gop, diversity training, progressive, spokesperson, football, racism, left-wing ideology, administrator, crt, public school, vote, gop, carroll senior high school, student, south, antiracist, diversity and inclusion training, nbc, fort worth, segregation, donations, school district, southlake families pac, lake, allen west, south lake, nbc news, conservative, political action committee, voters, playbook, critical race theory, pac, mayor, texas, fox news, dallas, school board, reverse racism, inclusion, suburb, cisd, laura ingraham, marine, classroom, culture war, teacher, cancel culture, diversity plan, blueprint, backlash, legacy, carroll high school, school board member, dana loesch, politics, learning, high school football, shawn duhon, election, campaign, superintendent, dei, anti-racist, race, graduation, michelle moore, black lives matter, trump, hannah smith, results",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:episode": 6,
  "itunes:season": 1
}