{
  "title": "The Student Perspective: Wolfram Summer School 2022",
  "link": "https://blog.wolfram.com/2022/09/20/the-student-perspective-wolfram-summer-school-2022/",
  "comments": "https://blog.wolfram.com/2022/09/20/the-student-perspective-wolfram-summer-school-2022/#comments",
  "pubDate": "Tue, 20 Sep 2022 14:52:13 +0000",
  "dc:creator": "Mads Bahrami",
  "category": "Computational Thinking, Education, Events",
  "guid": "https://blog.wolfram.com/?p=85713",
  "description": "For the past 20 years, Stephen Wolfram has hosted the annual Wolfram Summer School: four weeks of intensive mentorship and teamwork and the completion of computational and research projects on a variety of topics, ranging from pure math to humanities, engineering, physics and more. Students from all over the world participate in Socratic classroom discussions, [&#8230;]",
  "content:encoded": "<p><img class=\"aligncenter box-shadow\" title=\"The Student Perspective: Wolfram Summer School 2022\" src=\"https://content.wolfram.com/uploads/sites/39/2022/09/wss2022-hero.png\" alt=\"The Student Perspective: Wolfram Summer School 2022\" width=\"620\" height=\"315\" /></p>\n<p>For the past 20 years, <a href='https://www.stephenwolfram.com/'>Stephen Wolfram</a> has hosted the annual <a href='https://education.wolfram.com/summer-school'>Wolfram Summer School</a>: four weeks of intensive mentorship and teamwork and the completion of computational and research projects on a variety of topics, ranging from pure math to humanities, engineering, physics and more. Students from all over the world participate in Socratic classroom discussions, lecture series, casual networking events and coding sessions to help them design and complete original projects.<span id=\"more-85713\"></span></p>\n<p>With the help of their assigned mentors, one another and Stephen himself, students are guided through a process designed to help them understand the capabilities and mechanics of the <a href='https://www.wolfram.com/language/'>Wolfram Language</a> and then apply their own creativity and backgrounds to develop unique projects. Through a series of discussion-based meetings with Stephen and their mentors, students define the scope of a project, explore it, tweak it if necessary and ultimately complete it. At the end of the program, students package their project results in a <a href='https://www.wolfram.com/notebooks/'>Wolfram Notebook</a>, create a summary as a post on <a href='https://community.wolfram.com/'>Wolfram Community</a>, generate a poster and give a two-minute presentation including discussion with their classmates. </p>\n<p>The team behind the Wolfram Summer School is superb and highly dedicated to providing the best environment for doing real science. This year, we invited some of our students to share their experience and journey through the Summer School. Here, Athina, Cayden and Fizra discuss their experience with the Wolfram team.</p>\n<h2 id='athina:-electrical-and-computer-engineering'>Athina: Electrical and Computer Engineering</h2>\n<p><em>Athina’s project focused on infinite lists to operate in self-referential expressions by developing </em><tt>ConsList</tt><em> and </em><tt>ConsTree</tt><em> functions. Her </em><em><a href='https://community.wolfram.com/groups/-/m/t/2575855'>full project</a></em><em> can be found on Wolfram Community.</em></p>\n<table>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img class='' src=\"https://content.wolfram.com/uploads/sites/39/2022/09/mb092022img1.png\" alt='Framework for self-referential data structures: ConsList &#038; ConsTree' title='Framework for self-referential data structures: ConsList &#038; ConsTree' width='470' height='308' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/39/2022/09/mb092022img1_copy.txt\">\n\t\t\t\t\t<span class='close' id='1_out'>&#10005</span></p>\n<pre class='text' id='1_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p><span></p>\n<p>Attending the Wolfram Summer School this year was a unique and fruitful experience for me. A few weeks after my return to my hometown, I found myself reminiscing (and processing) moments that unconsciously got stuck in my mind. The four most beneficial experiences were the program’s courses, the interactions with the company’s staff, the interactions with the rest of the Summer School students and taking a closer look into a corporate workplace for the first time.</p>\n<p>Passing quickly—but efficiently—from the introduction phase on to more advanced Wolfram Language features was something that challenged me. Even though I didn’t completely understand all of the code I was presented, I was introduced to the logic of functional programming through some built-in courses. The courses, both my failed and successful attempts at coding, and discovering how the Wolfram Language works at its core triggered my interest in writing Wolfram Language code and in constantly trying to improve my project.</p>\n<p>From programming courses based on data-organization techniques, manipulating data and time-efficient programming to image processing, artificial intelligence and quantum mechanics courses, each day was filled with interesting lectures given by the company’s staff. The plethora of lectures raised my interest in various fields of science and motivated me to seek out further information afterward. Furthermore, these lecture hours were also a way for me to clear my mind and think about something else apart from my project.</p>\n<table>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img class='' src=\"https://content.wolfram.com/uploads/sites/39/2022/09/mb092022img2.png\" alt='Lectures with Stephen Wolfram' title='Lectures with Stephen Wolfram' width='470' height='290' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/39/2022/09/mb092022img2_copy.txt\">\n\t\t\t\t\t<span class='close' id='2_out'>&#10005</span></p>\n<pre class='text' id='2_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p><span></p>\n<p>My mentors and all the staff in general were willing to answer all my questions and guide me to the next steps in my project. What left a positive impression was the fact that each time I had a question, apart from the ones that were answered by my mentors, I was referred to a Wolfram employee who knew exactly how to help me. Furthermore, mentors played a major role in welcoming me to the Summer School and making me feel comfortable. Dr. Stephen Wolfram also helped me to integrate into the Summer School community as he turned me from a listener to a speaker by giving me the chance to express my thoughts.</p>\n<p>People with diverse backgrounds gathering to exchange thoughts and share knowledge and experiences was something that I had not had the chance to experience before. During one of the last days of the Summer School, a few hours were devoted to an informal project presentation from the students. This was like a Q&#038;A session where each student was available to answer questions based on their project. During the session, I asked so many questions and I was so happy that everyone was willing to explain their work and was so open to discussion. I found it challenging when it was my turn to share and answer questions about my project.</p>\n<p>Each one of the students was friendly and approachable, and as we got to know each other, we encouraged and helped each other when we reached stumbling blocks with our projects. We had a common space full of desks where we all coded together, which contributed to motivating each other—and lots of laughs. When it was time for lunch or dinner, we would make an outing of it together. When we weren’t working, we were walking through downtown Champaign, running in the nearest park or bouldering.</p>\n<table>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img class='' src=\"https://content.wolfram.com/uploads/sites/39/2022/09/mb092022img3.png\" alt='Students playing foosball' title='Students playing foosball' width='470' height='211' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/39/2022/09/mb092022img3_copy.txt\">\n\t\t\t\t\t<span class='close' id='3_out'>&#10005</span></p>\n<pre class='text' id='3_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p><span></p>\n<h2 id='cayden:-software-and-electrical-engineering'>Cayden: Software and Electrical Engineering</h2>\n<p><em>Cayden’s project focused on extracting relations from word embeddings and language models. His </em><em><a href='https://community.wolfram.com/groups/-/m/t/2575414'>full project</a></em><em> can be found on Wolfram Community.</em></p>\n<table>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img class='' src=\"https://content.wolfram.com/uploads/sites/39/2022/09/mb092022img4.png\" alt='Extracting linguistic relations fr. word embeddings&#038;language models' title='Extracting linguistic relations fr. word embeddings&#038;language models' width='470' height='136' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/39/2022/09/mb092022img4_copy.txt\">\n\t\t\t\t\t<span class='close' id='4_out'>&#10005</span></p>\n<pre class='text' id='4_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p><span></p>\n<p>I attended the 2022 Wolfram Summer School, an intensive four-week program focused on exploring and creating projects at the frontiers of science, technology and innovation. While there, I met and interacted with brilliant scientists, engineers, academics, entrepreneurs and students. Everyone had an interesting backstory and area of expertise, which made the daily, far-ranging conversations about physics, neuroscience, mathematics, etc. incredibly fun and interesting. Every student and mentor involved in the school seemed to bring with them a gleam in their eye to understand the world and progress human science and technology. It was the perfect environment for exploration, learning and progress.</p>\n<p>The program is largely based around three pillars: your project, your mentor and lectures. Each day, there are lectures on a variety of subjects, from neural networks to category theory, all of which show how to explore the respective area using the Wolfram Language. Before the school begins, each student is assigned a mentor who helps the student with their project, from ideas, to coding help, to finding the right people to talk to and more. At the start of the school, each student worked with their mentor and directly with Stephen Wolfram to select a project they would pursue for the next three weeks.</p>\n<p>In the first couple of days, every student crowded in for welcome keynote talks by the heads of the school. The first day had a large focus on meeting mentors, teaching assistants, the other students and Stephen Wolfram through a social pizza party. Everyone there was super friendly and social, and this was a common theme throughout the program. By the end of the summer, I had met and talked to nearly every attendee. </p>\n<table>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img class='' src=\"https://content.wolfram.com/uploads/sites/39/2022/09/mb092022img5.png\" alt='Pizza party for students and faculty' title='Pizza party for students and faculty' width='470' height='352' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/39/2022/09/mb092022img5_copy.txt\">\n\t\t\t\t\t<span class='close' id='5_out'>&#10005</span></p>\n<pre class='text' id='5_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p><span></p>\n<p>The first night of the program, we decided to have some casual team bonding among students and mentors by heading over to a local pub. The conversation revolved around science, technology and everyone’s research interests. We also discussed our personal backgrounds, as this is an international program with a diverse range of people flying in from all over the world.</p>\n<p>Before the school began, I wondered if students would have much chance to interact directly with Stephen Wolfram, whose book <em><a href='https://www.wolframscience.com/'>A New Kind of Science</a></em> and <a href='https://writings.stephenwolfram.com/'>blog</a> were my impetus to apply for the Summer School. I was pleasantly surprised that on the first day and on many occasions after his lectures, Stephen was happy to hang around and engage in all kinds of conversation and held office hours during the program. I joined in on a couple late-night conversations with Stephen where a small group gathered and discussed everything from ruliology and physics to communicating with animals and extraterrestrials. Talking to Stephen was fun and engaging, as he asked many questions and had his own fun stories of his past to share.</p>\n<p>The team of mentors that supported students daily throughout the program was excellent. My learning, project outcome and overall experience were greatly improved by my interactions with the many brilliant mentors that the Summer School put together.</p>\n<table>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img class='' src=\"https://content.wolfram.com/uploads/sites/39/2022/09/mb092022img6.png\" alt='Student and mentor working one on one' title='Student and mentor working one on one' width='470' height='352' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/39/2022/09/mb092022img6_copy.txt\">\n\t\t\t\t\t<span class='close' id='6_out'>&#10005</span></p>\n<pre class='text' id='6_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p><span></p>\n<p>My project explored the relationships between words as a step toward a symbolic and computable representation of language. Much of my four weeks was spent “digging for gold” in meaning space (word embedding/language model latent space), exploring the space and looking for all kinds of relationships.</p>\n<p>All of the information and code about my project can be found on my Community post, “<a href='https://community.wolfram.com/groups/-/m/t/2575414?p_p_auth=G5e8CeoW'>Extracting Linguistic Relations fr. Word Embeddings &#038; Language Models</a>.&rdquo;</p>\n<p>After four weeks of working hard on our projects and preparing artifacts for submission, every student does a two-minute presentation on their project. This is a fascinating day, as one gets to see and hear about the many interesting projects that other students completed at the school.</p>\n<p>On the day after presentations, we all graduated. Upon graduation, we received signed books by Stephen Wolfram, mini-diplomas, NFTs of our projects and even Wolfram Language cupcakes to celebrate our graduation.</p>\n<p>I had an excellent time at the Summer School. It was a month of intense learning, exploration, meeting new people and having fun. I’d highly recommend the program to anyone with a curiosity about STEM and understanding how the world works. The program had students ranging from undergraduates to late-career PhDs, and every one of them got immense value from the program.</p>\n<p><a href='https://www.youtube.com/watch?v=Pr2zMre-BdE' target=_blank rel=noopener>I filmed bits and pieces</a> of my time at the Wolfram Summer School and put them all together into a single video that tells (part of) the story of my experience.</p>\n<h2 id='fizra:-biomedical-engineering'>Fizra: Biomedical Engineering</h2>\n<p><em>Fizra’s project focused on modeling the visual hallucinations caused by migraines and occipital epilepsy. Her </em><em><a href='https://community.wolfram.com/groups/-/m/t/2575919'>full project</a></em><em> can be found on Wolfram Community.</em></p>\n<table>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img class='' src=\"https://content.wolfram.com/uploads/sites/39/2022/09/mb092022img7.png\" alt='Modeling migraine aura in convolutional neural networks (CNN)' title='Modeling migraine aura in convolutional neural networks (CNN)' width='470' height='312' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/39/2022/09/mb092022img7_copy.txt\">\n\t\t\t\t\t<span class='close' id='7_out'>&#10005</span></p>\n<pre class='text' id='7_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p><span></p>\n<p>When I heard about the Wolfram Summer School, I was curious. Except for randomly using <a href='https://www.wolframalpha.com/'>Wolfram|Alpha</a> for some college assignments, I had no knowledge of the Wolfram Language. After some exploration, I was more intrigued by the Summer School program. The extensive but perspicuous nature of it felt like an excellent opportunity to hone and learn a new skill, meet talented people and, most importantly, create something. I had little idea of what to expect from the school, but it turned out to be a far more fulfilling experience than I had imagined.</p>\n<p>The whole process of project selection, from shortlisting a few projects to finalizing the final project with Stephen and my mentor, was specifically catered to my budding interest in neuroscience and its applications in computation. My project was to model migraine auras in artificial neural networks, which allowed me to get some hands-on experience and dive deep into the world of computational neuroscience.</p>\n<p>Since I was new to the Wolfram Language and the overall functional programming paradigm, my mentor was extremely patient and helpful while I struggled to sail through my project and the Summer School. He helped me get a good grasp of the Wolfram Language in a relatively short amount of time and spent hours with me brainstorming ideas and coding, as well as making sure I stayed on track, completed the project and, most importantly, learned from the process. The Summer School team very diligently supported us with all the resources and motivation to complete our projects in time. Teaching assistants were always available to help with coding problems and errors that seemed impossible to conquer at the beginning. The Summer School lectures from experts within and outside the Wolfram team, plus interactions with Stephen, helped me in my project and in navigating disciplines other than my academic background. One of my favorite parts was how Stephen was involved not just in the execution of all the projects, but also guided the students personally to help them move in the right direction.</p>\n<table>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img class='' src=\"https://content.wolfram.com/uploads/sites/39/2022/09/mb092022img8.png\" alt='Students presented their projects' title='Students presented their projects' width='470' height='352' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/39/2022/09/mb092022img8_copy.txt\">\n\t\t\t\t\t<span class='close' id='8_out'>&#10005</span></p>\n<pre class='text' id='8_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p><span></p>\n<p>It was difficult to manage participating remotely with a huge time difference, but the team made sure to keep all remote students in the loop and connected throughout the program. The four weeks of the Summer School were the most hectic, challenging and stimulating weeks of my life. This experience made me realize that when you have the right tools, mentors and resources, you are capable of pushing yourself far more than you imagined. For anyone interested in computational sciences, whether in engineering, finance, economics or social sciences, the Wolfram Summer School is the best place to start, as it will help you get out of your comfort zone and give you a chance to do some original research!</p>\n<h2 id='planning-ahead'>Planning Ahead</h2>\n<p>As we continue planning for the Wolfram Summer School 2023, we invite you to explore the <a href='https://www.wolframcloud.com/obj/microsites/summerschool/projects.html'>projects created</a> and sign up for the <a href='https://education.wolfram.com/summer-school/mailing-list/'>mailing list</a> to be informed when applications open for 2023. We hope to see you there!</p>\n<div class=\"special-offer blue\" style=\"padding-bottom: 20px\">\n<table>\n<tbody>\n<tr>\n<td width=590px>Learn more and stay informed about <a href='https://education.wolfram.com/summer-school'>Wolfram Summer School</a>!</td>\n</tr>\n</tbody>\n</table>\n</div>\n",
  "wfw:commentRss": "https://blog.wolfram.com/2022/09/20/the-student-perspective-wolfram-summer-school-2022/feed/",
  "slash:comments": 1
}