{
  "title": "Build a Passive Radar With Software-Defined Radio",
  "link": "https://spectrum.ieee.org/passive-radar-with-sdr",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-flat-building-rooftop-with-a-chimney-stack-in-the-distance-through-the-tops-of-some-trees-the-top-of-the-empire-state-buildi.png?id=31994527&width=1200&height=800&coordinates=0%2C179%2C0%2C180\"/><br/><br/><p>\n<strong>Normally, when it </strong>comes to radio-related projects, my home of New York City is a <em>terrible</em> place to be. If we could see and hear radio waves, it would make an <a href=\"https://youtu.be/hvIg3PTJWxs?t=312\" rel=\"noopener noreferrer\" target=\"_blank\">EDM rave</a> feel like a sensory deprivation tank. Radio interference plagues the metropolis. But for once, I realized I could use this kaleidoscope of electromagnetism to my advantage—with a passive radar station.\n</p><p>\n\tUnlike conventional radar, \n\t<a href=\"https://en.wikipedia.org/wiki/Passive_radar\" rel=\"noopener noreferrer\" target=\"_blank\">passive radar</a> doesn’t send out pulses of its own and watch for reflections. Instead, it uses ambient signals. A reference antenna picks up a signal from, say, a cell tower, while a surveillance antenna is tuned to the same frequency. The reference and surveillance signals are compared. If a reflection from an object is detected, then the time it took to arrive at the surveillance antenna gives a range. Frequency shifts indicate the object’s speed via the <a href=\"https://en.wikipedia.org/wiki/Doppler_effect\" rel=\"noopener noreferrer\" target=\"_blank\">Doppler effect</a>.\n</p><hr/><p>\n\tI was interested in passive radar because I wanted to put a new software-defined radio (SDR) through its paces. I’ve checked in with amateur SDR developments for \n\t<em>IEEE Spectrum</em> since 2006, when <a href=\"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=1705782\" rel=\"noopener noreferrer\" target=\"_blank\">SDR became something remotely within a maker’s budget</a>. The biggest leap forward happened in 2012 when it was discovered that USB stick TV tuners using the <a href=\"https://www.realtek.com/en/products/communications-network-ics/item/rtl2832u\" rel=\"noopener noreferrer\" target=\"_blank\">RTL2832U demodulator</a> chip could be tapped <a href=\"https://spectrum.ieee.org/a-40-softwaredefined-radio\" target=\"_self\">to make very cheap but effective SDR receivers</a>. An explosion of interest in SDRs followed. Building off the demand stimulated by this activity, a number of manufacturers have started making premium, but still relatively cheap, SDRs. This includes RTLx-based USB sticks built with better supporting components and designs versus the original TV tuners, and completely new receivers such as the <a href=\"https://www.sdrplay.com/rspdx/\" rel=\"noopener noreferrer\" target=\"_blank\">RSPDx</a>. Some of these new SDRs can transmit as well as receive, such as the <a href=\"https://greatscottgadgets.com/hackrf/one/\" rel=\"noopener noreferrer\" target=\"_blank\">HackRF One</a> or<a href=\"https://www.crowdsupply.com/lime-micro/limesdr-mini-2\" rel=\"noopener noreferrer\" target=\"_blank\"> Lime Mini</a>.\n</p><p>\n\tI was researching diving back into SDR with one of these devices when I spotted the CrowdSupply campaign for the US $399\n\t<a href=\"https://www.krakenrf.com/\" rel=\"noopener noreferrer\" target=\"_blank\"> KrakenSDR</a>. It’s receive only, but it boasts not one or two tuners, but five! The tuners are based on the <a href=\"https://www.rtl-sdr.com/tag/r820t2/\" rel=\"noopener noreferrer\" target=\"_blank\">RTL R820T2/R860 chip</a>, and they are combined with hardware that can automatically do coherence synchronization among them.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"The Kraken RF is a rectangular box with a cooling fan. The Pi 4 is single board computer whose width and height is that of a credit card. The battery pack is a large portable unit with a handle. The TV antennas have a long pole with a receiving element about a third of the way along. It sits in front of a longer reflecting element and behind a series of nine smaller elements.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"0633199b94e1c2b4ced6bb5e8637b16e\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"8de7f\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/the-kraken-rf-is-a-rectangular-box-with-a-cooling-fan-the-pi-4-is-single-board-computer-whose-width-and-height-is-that-of-a-cre.png?id=31994356&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Both the KrakenRF SDR and the Raspberry Pi 4 [middle bottom] require a fair amount of power via USB C cables, so a battery pack [top middle] is needed for mobile operation. The Pi is connected to the SDR via a data link, and in turn the SDR is connected via coaxial cables to two directional TV antennas [right and left].</small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">James Provost</small>\n</p><p>\n\tWhat that means is that, for example, you can arrange five omnidirectional antennas in a circle, and do radio direction finding by looking at when a transmission arrives at each antenna. Normally, \n\t<a href=\"https://spectrum.ieee.org/chasing-weather-balloons-with-sdr\" target=\"_self\">an amateur looking to do direction finding</a> would have to wave around a directional antenna, something difficult to do while, for example, driving a car.\n</p><p>\n\tBut it was the KrakenSDR’s ability to do passive radar that really caught my eye as a new capability in lowish-cost radio tech , so I plonked down the money. The next step was to get suitable antennas. The radio’s manufacturer, KrakenRF, recommends directional Yagi TV antennas for two reasons. First, while the KrakenSDR can work with many signals including FM radio or cell-tower transmissions, digital TV signals are best to work with because they are fairly evenly distributed across the channel’s broadcast band, unlike the narrower and more variable signals from an FM station. (KrakenRF notes that if you \n\t<em>must</em> use an FM signal, pick a heavy-metal station “since heavy metal is closer to white noise.”) The second reason is that pointing a directional antenna away from the reference source means that it’s less likely to be swamped by the reference signal.\n</p><p>\n\tI ordered two small and light\n\t<a href=\"https://www.homedepot.com/p/Outdoor-TV-Antenna-Digital-UHF-with-100-Miles-Range-744841871152/316916810\" rel=\"noopener noreferrer\" target=\"_blank\"> $19 TV antennas</a>. Portability was important because I needed to carry my entire setup to and from my apartment building’s roof, where my particular location in an outer borough of the city provided more advantages. First, the sky above has a regular supply of aircraft landing and taking off from NYC’s airports—and large metal assemblies moving against an empty background are perfect radar test objects. Second, my roof has a line of sight to the Empire State Building, giving me the ability to choose as a reference signal any one of<a href=\"https://www.necrat.us/empiretv.html\" rel=\"noopener noreferrer\" target=\"_blank\"> more than half a dozen</a> TV channels transmitted from its spire.\n</p><p>\n\tI deployed my rig: a heavy-duty battery pack, the KrakenSDR, cables and antennas, along with a Raspberry Pi 4 to process data from the SDR. KrakenRF offers \n\t<a href=\"https://github.com/krakenrf/krakensdr_doa/releases/\" rel=\"noopener noreferrer\" target=\"_blank\">an SD card image</a> for the Pi that bundles an operating system configured to work with its preinstalled open-source software. It also sets up the Pi as a Wi-Fi access point with a Web interface. I really wish more companies would adopt this approach, as installing open-source software is often a frustrating exercise in trying to replicate the precise system environment it was developed in. Even if you want to ultimately install the KrakenSDR software somewhere other than a Pi, having a known-good setup is useful as a reference, and allows you to test the hardware.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"An illustration of an antenna on a building with arrows pointing from the Empire State Building to the antenna to an airplane.  \" class=\"rm-shortcode\" data-rm-shortcode-id=\"6ca27cc2d5229db1b7127f92884d2378\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"6362b\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/an-illustration-of-an-antenna-on-a-building-with-arrows-pointing-from-the-empire-state-building-to-the-antenna-to-an-airplane.png?id=31994357&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\"> Comparing the time between the arrival of a signal from a broadcast transmitter and the arrival of a reflection of that signal lets you detect objects such as airplanes and estimate their range. Frequency shifts between the two signals allow you to plot the speed of the object away or toward the antennas along with the range. The trace on the right shows a plane moving away as it increases its speed.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">James Provost</small>\n</p><p>\n\tI pointed the reference antenna toward the Empire State Building and retreated with the surveillance antenna behind the superstructure of my building’s stairwell. This was in a bid to shield the antenna from the reference signal and myself from the wind. Checking the feed from the antennas using the Web interface’s built-in spectrum analyzer, I discovered I was almost \n\t<em>too</em> successful in choosing the Empire State’s transmitter tower as a source of radio illumination: The reference signal was saturating the receiver with the default gain setting of 27 <a href=\"https://en.wikipedia.org/wiki/Decibel\" rel=\"noopener noreferrer\" target=\"_blank\">decibels</a>, so I dropped it down to just 2.7 dB.\n</p><p>\n\tBut intense illumination means bright reflections. With one hand I pointed the surveillance antenna at the overcast skies and held my phone in the other. Gratifyingly, I almost instantly started seeing a blip on the speed-versus-range radar plot, matched a few moments later by the rumble of an approaching jet. (The plot updates about once every 3 seconds.) Because of the strength of the echoes, I was able to raise the signal-cutoff threshold significantly, giving me radar returns uncluttered with noise, and often with multiple aircraft. A win for SDR!\n</p><p>\n\tAdmittedly, my passive radar setup doesn’t have much everyday value. But as a demonstration of how far and fast inexpensive SDR technology is advancing, it’s a clear signal.\n</p><p>\n<em>This article appears in the November 2022 print issue as “Passive Radar With the KrakenSDR.”</em>\n</p>",
  "pubDate": "Tue, 25 Oct 2022 15:00:00 +0000",
  "guid": "https://spectrum.ieee.org/passive-radar-with-sdr",
  "category": [
    "Diy",
    "Sdr",
    "Software defined radio",
    "Type:departments"
  ],
  "dc:creator": "Stephen Cass",
  "media:content": ""
}