{
  "id": "https://bibleinoneyear.org/en/youth/225",
  "title": "Day 225: Who You Need to Know",
  "description": "Psalm 95:3,6–8, Ecclesiastes 7:11,13–16, 1 Corinthians 8:1b–13.  Even this is not the end though  It is never enough simply to have knowledge – you must also have love",
  "pubDate": "Sat, 13 Aug 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/225/",
  "itunes:duration": "14:09",
  "guid": "enyouth13082022-225",
  "length": 849.01,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 225: Who You Need to Know",
  "itunes:subtitle": "Psalm 95:3,6–8, Ecclesiastes 7:11,13–16, 1 Corinthians 8:1b–13.  Even this is not the end though  It is never enough simply to have knowledge – you must also have love",
  "itunes:summary": "We lived in Oxford for three years. I was training for ordination in the Church of England and studying for a degree in Theology at Oxford University. One of the things we noticed while we were there was that, compared to London, Oxford seemed to be relatively non-materialistic. People, on the whole, were not impressed by wealth. Success was measured differently.\nThe people in Oxford tended to be more impressed by brains than by money or beauty. Success was measured in starred firsts, distinctions, PhDs, professorships and published works. It made me wonder whether intelligence and ‘knowledge’ could be as much a false god as money and wealth.\nKnowledge is, on the whole, good. The facts are your friends. Education is good – reading, learning and discovering are all good activities. However, as Lord Byron wrote, ‘The Tree of Knowledge is not that of Life.’ We need to see ‘knowledge’ in perspective. Our knowledge is very limited. The more we know, the more we realise how little we know. God is our creator and he alone knows everything.\nThere are also different types of knowledge, and they are not all equally valuable. In French, there are two different words for ‘to know’. One (savoir) means to know a fact, the other (connaître) means to know a person. God is more interested in us knowing people than facts. The most important knowledge of all is knowing God and being known by him. Even this is not the end though. It is never enough simply to have knowledge – you must also have love.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 590
}