{
  "title": "Episode 92: &#8220;The Lion Sleeps Tonight&#8221; by the Tokens",
  "link": "https://500songs.com/podcast/episode-92-the-lion-sleeps-tonight-by-the-tokens/",
  "pubDate": "Sun, 02 Aug 2020 12:46:24 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-92-the-lion-sleeps-tonight-by-the-tokens/",
  "description": "Episode ninety-two of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"The Lion Sleeps Tonight\" by The Tokens, and at a seventy-year-long story of powerful people repeatedly ripping off less powerful people, then themselves being ripped off in turn by more powerful people, and at how racism meant that a song that earned fifteen million dollars for other people paid its composer ten shillings. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/40005049\">on \"Tossin' and Turnin'\" by Bobby Lewis</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n<strong>ERRATUM:</strong> I say “Picture in Your Wallet” when I mean “Picture in My Wallet”.\n\n<strong>Resources</strong>\n\nAs always, I've created&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-92-the-lion-sleeps-tonight/\">a Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.\n\nRian Malan's 2000 article on Solomon Linda and&nbsp;<em>The Lion Sleeps Tonight</em> can be found <a href=\"https://www.rollingstone.com/music/music-features/in-the-jungle-inside-the-long-hidden-genealogy-of-the-lion-sleeps-tonight-108274/\">here</a>.\n\n<a href=\"https://traxploitation.co.uk/solomon-linda\">This 2019 article </a>brings the story of the legal disputes up to date.\n\nThe information about isicathamiya comes from <a href=\"https://amzn.to/3gpjbiL\"><em>Nightsong: Performance, Power and Practice in South Africa</em> by Veit Erlmann</a>.\n\n<a href=\"https://amzn.to/2Pk5eqx\">This collection</a> of early isicathamiya and Mbube music includes several tracks by the Evening Birds.\n\nInformation on Pete Seeger and the Weavers primarily comes from <a href=\"https://amzn.to/319PGep\"><em>Pete Seeger vs. The Un-Americans: A Tale of the Blacklist</em> by Edward Renehan</a>.\n\n<a href=\"https://amzn.to/2ED2nqp\">This collection</a> has everything the Weavers recorded before their first split.\n\n<a href=\"https://casetext.com/case/folkways-music-publishers-inc-v-weiss\">This</a> is the record of one of the legal actions taken during Weiss' dispute with Folkways in the late eighties and early nineties.\n\nInformation on the Tokens came from <a href=\"http://tims.blackcat.nl/messages/tokens.htm\">This is My Story</a>.\n\nThere are, surprisingly, no budget compilations of the Tokens' music, but <a href=\"https://amzn.to/3hWbReX\">this best-of</a> has everything you need.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nToday we're going to look at a song that became a worldwide hit in multiple versions, and which I can guarantee everyone listening to this podcast has heard many times. A song that has been recorded by REM, that featured in a Disney musical, and which can be traced back from a white doo-wop group through a group of Communist folk singers to a man who was exploited by racist South African society -- a man who invented an entire genre of music, which got named after his most famous song, but who never saw any of the millions that his song earned for others, and died in poverty. We're going to look at the story of \"The Lion Sleeps Tonight\":\n\n[Excerpt: The Tokens, \"The Lion Sleeps Tonight\"]\n\nThe story of \"The Lion Sleeps Tonight\" is a story that goes back to 1939, when a singer called Solomon Linda was performing in South Africa. Linda was a Zulu, and thus in the racist regime of South Africa was largely without rights.\n\nLinda was, in the thirties and forties, probably the single most important performer in South Africa. He was the leader of a vocal group called the Evening Birds, who were the most popular isicathamiya group in South Africa.\n\nIsicathamiya -- and I hope I'm pronouncing that right -- was a form of music which has a lot of parallels to some of the American vocal group music we've looked at, largely because it comes from some of the same roots. I don't pretend to be an expert on the music by any means -- I'll put a link on the podcast webpage to a book which has far more information about this -- but as best I understand it, it's a music created when rural black people were forcibly displaced in the late nineteenth century and forced to find work in the city.\n\nThose people combined elements of traditional Zulu music with two more Western elements. The first was the religious music that they heard from Church missions, and the second was American minstrel songs, heard from troupes of minstrels that toured the country, especially a black performer named Orpheus McAdoo, who led a troupe of minstrel and gospel performers who toured South Africa a lot in the late nineteenth century.\n\nThis new style of music was usually performed a capella, though sometimes there might be a single instrument added, and it gained a relatively formalised structure -- it would almost always have very specific parts based on European choral music, with parts for a tenor, a soprano, an alto, and a bass, in strict four-part harmony -- though the soprano and alto parts would be sung in falsetto by men. It would usually be based around the same I, IV, and V chords that most Western popular music was based on, and the Zulu language would often be distorted to fit Western metres, though the music was still more freeform than most of the Western music of the time.\n\nThis music started to be recorded in around 1930, and you can get an idea of the stylistic range from two examples. Here's \"Umteto we Land Act\" by Caluza's Double Quartet:\n\n[Excerpt, \"Umteto We Land Act\", Caluza's Double Quartet\"]\n\nWhile here's the Bantu Glee Singers, singing \"Jim Takata Kanjani\":\n\n[Excerpt: The Bantu Glee Singers, \"Jim Takata Kanjani\"]\n\nSolomon Linda's group, the Evening Birds, sang in this style, but incorporated a number of innovations. One was that they dressed differently -- they wore matching striped suits, rather than the baggy trousers that the older groups wore -- but also, they had extra bass singers. Up until this point, there would be four singers or multiples of four, with one singer singing each part. The Evening Birds, at Linda's instigation, had a much thicker bass part, and in some ways prefigured the sound of doo-wop that would take over in America twenty years later.\n\nTheir music was often political -- while the South African regime was horribly oppressive in the thirties, it wasn't as oppressive as it later became, and a certain amount of criticism of the government was allowed in ways it wouldn't be in future decades.\n\nAt the time, the main way in which this music would be performed was at contests with several groups, most of whom would be performing the same repertoire. An audience member would offer to pay one of the groups a few pennies to start singing -- and then another audience member, when they got bored with the first group, would offer that group some more money to stop singing, before someone else offered another group some money. The Evening Birds quickly became the centre of this scene, and between 1933 and 1948, when they split, they were the most popular group around. As with many of the doo-wop groups they so resembled, they had a revolving lineup with members coming and going, and joining other groups like the Crocodiles and the Dundee Wandering Singers. There was even a second group called the Evening Birds, with a singer who sounded like Linda, and who had a long-running feud with Linda's group.\n\nBut it wasn't this popularity that got the Evening Birds recorded. It was because Solomon Linda got a day job packing records for Gallo Records, the only record label in South Africa, which owned the only recording studio in sub-Saharan Africa. While he was working in their factory, packing records, he managed to get the group signed to make some records themselves. In the group's second session, they recorded a song that Linda had written, called \"Mbube\", which means \"lion\", and was about hunting the lions that would feed on his family's cattle when he was growing up:\n\n[Excerpt: Solomon Linda and the Evening Birds, \"Mbube\"]\n\nThere's some dispute as to whether Linda wrote the whole song, or whether it's based on a traditional Zulu song -- I tend to fall on the side of Linda having written the whole thing, because very often when people say something is based on a traditional song, what they actually mean is \"I don't believe that an uneducated or black person can have written a whole song\".\n\nBut whatever the circumstances of most of the composition, one thing is definitely known – Linda was the one who came up with this falsetto melody:\n\n[Excerpt: Solomon Linda and the Evening Birds, \"Mbube\"]\n\nThe song became massively, massively popular -- so popular that eventually the master copy of the record disintegrated, as they'd pressed so many copies from it. It gave its name to a whole genre of music -- in the same way that late fifties American vocal groups are doo-wop groups, South African groups like Ladysmith Black Mambazo are, more than eighty years later, still known as \"mbube groups\".\n\nLinda and the Evening Birds would make many more records, like \"Anodu Gonda\":\n\n[Excerpt: Solomon Linda and the Evening Birds, \"Anodu Gonda\"]\n\nBut it was \"Mbube\" that was their biggest hit. It sold a hundred thousand copies on Gallo Records -- and earned Solomon Linda, its writer and lead singer, ten shillings. The South African government at the time estimated that a black family could survive on thirty-seven shillings and sixpence a week. So for writing the most famous melody ever to come out of Africa, Linda got a quarter of a week's poverty-level wages. When Linda died in 1962, he had a hundred rand -- equivalent then to fifty British pounds -- in his bank account. He was buried in an unmarked grave.\n\nAnd, a little over a year before his death, his song had become an international number one hit record. To see why, we have to go back to 1952, and a folk group called the Weavers.\n\nPete Seeger, the most important member of the Weavers, is a figure who is hugely important in the history of the folk music rebirth of the 1960s. Like most of the white folk singers of the period, he had an incredibly privileged background -- he had attended Harvard as a classmate of John F Kennedy -- but he also had very strong socialist principles. He had been friends with both Woody Guthrie and Lead Belly in the forties, and he dedicated his later career to the same kind of left-wing activism that Guthrie had taken part in.\n\nIndeed, Guthrie and Seeger had both been members of the Almanac Singers, a folk group of the forties who had been explicitly pro-Communist. They'd been pacifists up until the Soviet entry into the Second World War, at which point they had immediately turned round and become the biggest cheerleaders of the war:\n\n[Excerpt: The Almanac Singers, \"Round and Round Hitler's Grave\"]\n\nThe Almanac Singers had a revolving door membership, including everyone from Burl Ives to Cisco Houston at one point or another, but the core of the group had been Seeger and Lee Hays, and those two had eventually formed another group, more or less as a continuation of the Almanac Singers, but with a less explicitly political agenda -- they would perform Guthrie and Lead Belly songs, and songs they wrote themselves, but not be tied to performing music that fit the ideological line of the Communist Party.\n\nThe Weavers immediately had far more commercial success than the Almanac Singers ever had, and recorded such hits as their version of Lead Belly's \"Goodnight Irene\", with orchestration by Gordon Jenkins:\n\n[Excerpt: The Weavers, \"Goodnight Irene\"]\n\nAnd one of the hits they recorded was a version of \"Mbube\", which they titled \"Wimoweh\".\n\nAlan Lomax, the folk song collector, had discovered somewhere a big stack of African records, which were about to be thrown out, and he thought to himself that those would be exactly the kind of thing that Pete Seeger might want, and gave them to him. Seeger loved the recording of \"Mbube\", but neither man had any clear idea of what the song was or where it came from. Seeger couldn't make out the lyrics -- he thought Linda was singing something like \"Wimoweh\", and he created a new arrangement of the song, taking Linda's melody from the end of the song and singing it repeatedly throughout:\n\n[Excerpt: The Weavers, \"Wimoweh\"]\n\nAt the time, the Weavers were signed as songwriters to Folkways, a company that was set up to promote folk music, but was part of a much bigger conglomerate, The Richmond Organisation. When they were informed that the Weavers were going to record \"Wimoweh\", Folkways contacted the South African record company and were informed that \"Mbube\" was a traditional folk song. So Folkways copyrighted \"Mbube\", as \"Wimoweh\", in the name Paul Campbell -- a collective pseudonym that the Weavers used for their arrangements of traditional songs.\n\nShortly after this, Gallo realised their mistake and tried to copyright \"Mbube\" themselves in the USA, under Solomon Linda's name, only to be told that Folkways already had the copyright. Now, in the 1950s the USA was not yet a signatory to the Berne Convention, the international agreement on copyright laws, and so it made no difference that in South Africa the song had been copyrighted under Linda's name -- in the USA it was owned by Folkways, because they had registered it first.\n\nBut Folkways wanted the rights for other countries, too, and so they came to an agreement with Gallo that would be to Gallo's immense disadvantage. Because they agreed that they would pay Gallo a modest one-off fee, and \"let\" Gallo have the rights to the song in a few territories in Africa, and in return Folkways would get the copyright everywhere else. Gallo agreed, and so \"Mbube\" by Solomon Linda and \"Wimoweh\" by Paul Campbell became separate copyrights -- Gallo had, without realising it, given up their legal rights to the song throughout the world.\n\n\"Wimoweh\" by the Weavers went to number six on the charts, but then Senator McCarthy stepped in. Both Pete Seeger and Lee Hays had been named as past Communist Party members, and were called before the House Unamerican Activities Committee to testify. Hays stood on his fifth amendment rights, refusing to testify against himself, but Seeger took the riskier option of simply refusing on first amendment grounds. He said, quite rightly, that his political activities, voting history, and party membership were nobody's business except his, and he wasn't going to testify about them in front of Congress. He spent much of the next decade with the threat of prison hanging over his head.\n\nAs a result, the Weavers were blacklisted from radio and TV, as was Seeger as a solo artist. \"Wimoweh\" dropped off the charts, and the group's recording catalogue was deleted. The group split up, though they did get back together again a few years later, and managed to have a hit live album of a concert they performed at Carnegie Hall in 1955, which also included \"Wimoweh\":\n\n[Excerpt: The Weavers, \"Wimoweh (live at Carnegie Hall)\"]\n\nSeeger left the group permanently a couple of years after that, when they did a commercial for tobacco -- the group were still blacklisted from the radio and TV, and saw it as an opportunity to get some exposure, but Seeger didn't approve of tobacco or advertising, and quit the group because of it -- though because he'd made a commitment to the group, he did appear on the commercial, not wanting to break his word. At his suggestion, he was replaced by Erik Darling, from another folk group, The Tarriers. Darling was an Ayn Rand fan and a libertarian, so presumably didn't have the same attitudes towards advertising.\n\nAs you might have gathered from this, Seeger was a man of strong principles, and so you might be surprised that he would take credit for someone else's song. As it turned out, he didn't. When he discovered that Solomon Linda had written the song, that it wasn't just a traditional song, he insisted that all future money he would have made from it go to Linda, and sent Linda a cheque for a thousand dollars for the money he'd already earned. But Seeger was someone who didn't care much about money at all -- he donated the vast majority of his money to worthy causes, and lived frugally, and he assumed that the people he was working with would behave honourably and keep to agreements, and didn't bother checking on them. They didn't, and Linda saw nothing from them.\n\nOver the years after 1952, \"Wimoweh\" became something of a standard in America, with successful versions like the one by Yma Sumac:\n\n[Excerpt: Yma Sumac, \"Wimoweh\"]\n\nAnd in the early sixties it was in the repertoire of almost every folk group, being recorded by groups like the Kingston Trio, who had taken the Weavers' place as the most popular folk group in the country.\n\nAnd then the Tokens entered the picture. We've mentioned the Tokens before, in the episode on \"Will You Love Me Tomorrow?\" -- they were the group, also known as the Linc-Tones, that was led by Carole King's friend Neil Sedaka, and who'd recorded \"While I Dream\" with Sedaka on lead vocals:\n\n[Excerpt: Neil Sedaka and the Tokens, \"While I Dream\"]\n\nAfter recording that, one member of the group had gone off to college, and been replaced by the falsetto singer Jay Siegel. But then the group had split up, and Sedaka had gone on to a very successful career as a solo performer and a songwriter.\n\nBut Siegel and one of the other group members, Hank Medress, had carried on performing together, and had formed a new group, Darrell and the Oxfords, with two other singers. That group had made a couple of records for Roulette Records, one of which, \"Picture in Your Wallet\", was a local hit:\n\n[Excerpt: Darrell and the Oxfords, \"Picture in Your Wallet\"]\n\nBut that group had also split up. So the duo invited yet another pair of singers to join them -- Mitch Margo, who was around their age, in his late teens, and his twelve-year-old brother Phil. The group reverted to their old name of The Tokens, and recorded a song called \"Tonight I Fell In Love\", which they leased to a small label called Warwick Records:\n\n[Excerpt: The Tokens, \"Tonight I Fell In Love\"]\n\nWarwick Records sat on the track for six months before releasing it. When they did, in 1961, it went to number fifteen on the charts. But by then, the group had signed to RCA Records, and were now working with Hugo and Luigi, the production duo who you might remember from the episode on \"Shout\".\n\nThe group put out a couple of flop singles on RCA, including a remake of the Moonglows' \"Sincerely\":\n\n[Excerpt: The Tokens, \"Sincerely\"]\n\nBut after those two singles flopped, the group made the record that would define them for the rest of their lives.\n\nThe Tokens had been performing \"Wimoweh\" in their stage act, and they played it for Hugo and Luigi, who thought there was something there, but they didn't think it would be commercial as it was. They decided to get a professional writer in to fix the song up, and called in George David Weiss, a writer with whom they'd worked before. The three of them had previously co-written \"Can't Help Falling In Love\" for Elvis Presley, basing it on a traditional melody, which is what they thought they were doing here:\n\n[Excerpt: Elvis Presley, \"Can't Help Falling In Love\"]\n\nWeiss took the song home and reworked it. Weiss decided to find out what the original lyrics had been about, and apparently asked the South African consulate, who told him that it was about lions, so he came up with new lyrics -- \"in the jungle, the mighty jungle, the lion sleeps tonight\".\n\nHugo and Luigi came up with an arrangement for Weiss' new version of the song, and brought in an opera singer named Anita Darian to replicate the part that Yma Sumac had sung on her version. The song was recorded, and released on the B-side of the Tokens' third flop in a row:\n\n[Excerpt: The Tokens, \"The Lion Sleeps Tonight\"]\n\nAs it was believed by everyone involved that the song was a traditional one, the new song was copyrighted in the names of Weiss, Hugo, and Luigi. And as it was released as a B-side of a flop single, nobody cared at first.\n\nBut then a DJ flipped the record and started playing the B-side, and suddenly the song was a hit. Indeed, it went to number one. And it didn't just go to number one, it became a standard, recorded over the years by everyone from Brian Eno to Billy Joel, The New Christy Minstrels to They Might Be Giants.\n\nObviously, the publishers of \"Wimoweh\", who knew that the song wasn't a traditional piece at all, wanted to get their share of the money. However, the owner of the publishing company was also a good friend of Weiss -- and Weiss was someone who had a lot of influence in the industry, and who nobody wanted to upset, and so they came to a very amicable agreement. The three credited songwriters would stay credited as the songwriters and keep all the songwriting money -- after all, Pete Seeger didn't want it, and the publishers were only under a moral obligation to Solomon Linda, not a legal one -- but the Richmond Organisation would get the publishing money.\n\nEveryone seemed to be satisfied with the arrangement, and Solomon Linda's song went on earning a lot of money for a lot of white men he never met.\n\nThe Tokens tried to follow up with a version of an actual African folk song, \"Bwa Nina\", but that wasn't a hit, and nor was a version of \"La Bamba\". While they continued their career for decades, the only hit they had as performers was in 1973, by which point Hank Medress had left and the other three had changed their name to Cross Country and had a hit with a remake of \"In the Midnight Hour\":\n\n[Excerpt: Cross Country, \"The Midnight Hour\"]\n\nI say that was the only hit they had as performers, because they went into record production themselves. There they were far more successful, and as a group they produced records like the Chiffons' \"He's So Fine\", making them the first vocal group to produce a hit for another vocal group:\n\n[Excerpt: The Chiffons, \"He's So Fine\"]\n\nThat song would, of course, generate its own famous authorial dispute case in later years. After Hank Medress left the group, he worked as a producer on his own, producing hits for Tony Orlando and Dawn, and also producing one of the later hit versions of \"The Lion Sleeps Tonight\", Robert John's version, which made number three in 1972:\n\n[Excerpt: Robert John, \"The Lion Sleeps Tonight\"]\n\nToday there are two touring versions of the Tokens, one led by Jay Siegel and one by Phil Margo.\n\nBut while in 1961 the Richmond Organisation, Hugo and Luigi, and George Weiss all seemed happy with their agreement, things started to go wrong in 1989.\n\nAmerican copyright law has had several changes over the years, and nothing of what I'm saying applies now, but for songs written before 1978 and the first of the Mickey Mouse copyright extensions, the rule used to be that a song would be in copyright for twenty-eight years. The writer could then renew it for a second twenty-eight-year term. (The rule is now that songs published in America remain in copyright until seventy years after the writer's death).\n\nAnd it's specifically the *writer* who could renew it for that second term, not the publishers. George Weiss filed notice that he was going to renew the copyright when the twenty-eight-year term expired, and that he wasn't going to let the Richmond Organisation publish the song.\n\nAs soon as the Richmond Organisation heard about this, they took Weiss to court, saying that he couldn't take the publishing rights away from them, because the song was based on \"Wimoweh\", which they owned. Weiss argued that if the song was based on \"Wimoweh\", the copyright should have reflected that for the twenty-eight years that the Richmond Organisation owned it. They'd signed papers agreeing that Weiss and Hugo and Luigi were the writers, and if they'd had a problem with that they should have said so back in 1961.\n\nThe courts sided with Weiss, but they did say that the Richmond Organisation might have had a bit of a point about the song's similarity to \"Wimoweh\", so they had to pay a small amount of money to Solomon Linda's family.\n\nAnd the American writers getting the song back coincided with two big boosts in the income from the song. First, R.E.M recorded a song called \"The Sidewinder Sleeps Tonite\", on their album Automatic For the People (a record we will definitely be talking about in 2026, assuming I'm still around and able to do the podcast by then). The album was one of the biggest records of the decade, and on the song, Michael Stipe sang a fragment of Solomon Linda's melody:\n\n[Excerpt: R.E.M. \"The Sidewinder Sleeps Tonite\"]\n\nThe owners of \"The Lion Sleeps Tonight\" took legal action about that, and got themselves credited as co-writers of R.E.M.'s song, and the group also had to record \"The Lion Sleeps Tonight\", releasing it as a B-side to the hit single version of \"Sidewinder\":\n\n[Excerpt: R.E.M. \"The Lion Sleeps Tonight\"]\n\nEven better from their point of view, the song was featured in the Disney film The Lion King, which on its release in 1994 became the second highest-grossing film of all time and the most successful animated film ever, and in its Broadway adaptation, which became the most successful Broadway show of all time.\n\nAnd in 2000, Rian Malan, a South African journalist based in America, who mostly dedicated his work to expunging his ancestral guilt -- he's a relative of Daniel Malan, the South African dictator who instituted the apartheid system, and of Magnus Malan, one of the more monstrous ministers in the regime in its last days of the eighties and early nineties -- found out that while Solomon Linda's family had been getting some money, it amounted at most to a couple of thousand dollars a year, shared between Linda's daughters. At the same time, Malan estimated that over the years the song had generated something in the region of fifteen million dollars for its American copyright owners.\n\nMalan published an article about this, and just before that, the daughters got a minor windfall -- Pete Seeger noticed a six thousand dollar payment, which came to him when a commercial used \"Wimoweh\", rather than \"The Lion Sleeps Tonight\". He realised that he'd been receiving the royalties for \"Wimoweh\" all along, even though he'd asked that they be sent to Linda, so he totalled up how much he'd earned from the song over the years, which came to twelve thousand dollars, and he sent a cheque for that amount to Linda's daughters.\n\nThose daughters were living in such poverty that in 2001, one of the four died of AIDS -- a disease which would have been completely treatable if she'd been able to afford the anti-retroviral medication to treat it.\n\nThe surviving sisters were told that the copyright in \"Mbube\" should have reverted to them in the eighties, and that they had a very good case under South African law to get a proper share of the rights to both \"Wimoweh\" and \"The Lion Sleeps Tonight\".\n\nThey just needed to find someone in South Africa that they could sue. Abilene Music, the current owners of \"The Lion Sleeps Tonight\", were based in the USA and had no assets in South Africa. Suing them would be pointless.\n\nBut they could sue someone else:\n\n[Excerpt: Timon and Pumbaa, \"The Lion Sleeps Tonight\"]\n\nDisney had assets in South Africa. Lots of them. And they'd used Solomon Linda's song in their film, which under South African law would be copyright infringement. It would even be possible, if the case went really badly for Disney, that Linda's family could get total ownership of all Disney assets in South Africa.\n\nSo in 2006, Disney came to an out of court settlement with Linda's family, and they appear to have pressured Abilene Music to do the same thing. Under South African law, \"Mbube\" would go out of copyright by 2012, but it was agreed that Linda's daughters would receive royalties on \"The Lion Sleeps Tonight\" until 2017, even after the South African copyright had expired, and they would get a lump sum from Disney. The money they were owed would be paid into a trust.\n\nAfter 2017, they would still get money from \"Wimoweh\", but not from \"The Lion Sleeps Tonight\", whose rights would revert fully to its American owners.\n\nUnfortunately, most of the money they got seems to have gone on legal bills. The three surviving sisters each received, in total, about eighty-three thousand dollars over the ten-year course of the agreement after those bills, which is much, much, more than they were getting before, but only a fraction of what the song would have earned them if they'd been paid properly.\n\nIn 2017, the year the agreement expired, Disney announced they were making a photorealistic CGI remake of The Lion King. That, too, featured \"The Lion Sleeps Tonight\", and that, too, became the most successful animated film of all time.\n\nUnder American copyright law, \"Wimoweh\" will remain in copyright until 2047, unless further changes are made to the law. Solomon Linda's family will continue to receive royalties on that song. \"The Lion Sleeps Tonight\", the much more successful song, will remain in copyright until 2057, and the money from that will mostly go to Claire Weiss-Creatore, who was George Weiss' third wife, and who after he died in 2010 became the third wife of Luigi Creatore, of Hugo and Luigi, who died himself in 2015. Solomon Linda's daughters won't see a penny of it.\n\nAccording to George Weiss' obituary in the Guardian, he \"was a familiar figure at congressional hearings into copyright reform and music piracy, testifying as to the vital importance of intellectual property protection for composers\".",
  "itunes:subtitle": "Episode ninety-two of A History of Rock Music in Five Hundred Songs looks at The Lion Sleeps Tonight by The Tokens, and at a seventy-year-long story of powerful people repeatedly ripping off less powerful people, then themselves being ripped off in turn ",
  "itunes:keywords": "Alan Lomax,Communist Party,copyright law,Disney,doo wop,folk music,Gallo Records,Hugo and Luigi,lawsuits,Lead Belly,McCarthyism,Neil Sedaka,Pete Seeger,racism,RCA Records,Roulette Records,Solomon Linda,South Africa,The Chiffons,The Tokens,The Weavers,vocal groups,white cover versions,Woody Guthrie",
  "itunes:episodeType": "full",
  "itunes:episode": 92,
  "content:encoded": "Episode ninety-two of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"The Lion Sleeps Tonight\" by The Tokens, and at a seventy-year-long story of powerful people repeatedly ripping off less powerful people, then themselves being ripped off in turn by more powerful people, and at how racism meant that a song that earned fifteen million dollars for other people paid its composer ten shillings. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/40005049\">on \"Tossin' and Turnin'\" by Bobby Lewis</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n<strong>ERRATUM:</strong> I say “Picture in Your Wallet” when I mean “Picture in My Wallet”.\n\n<strong>Resources</strong>\n\nAs always, I've created&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-92-the-lion-sleeps-tonight/\">a Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.\n\nRian Malan's 2000 article on Solomon Linda and&nbsp;<em>The Lion Sleeps Tonight</em> can be found <a href=\"https://www.rollingstone.com/music/music-features/in-the-jungle-inside-the-long-hidden-genealogy-of-the-lion-sleeps-tonight-108274/\">here</a>.\n\n<a href=\"https://traxploitation.co.uk/solomon-linda\">This 2019 article </a>brings the story of the legal disputes up to date.\n\nThe information about isicathamiya comes from <a href=\"https://amzn.to/3gpjbiL\"><em>Nightsong: Performance, Power and Practice in South Africa</em> by Veit Erlmann</a>.\n\n<a href=\"https://amzn.to/2Pk5eqx\">This collection</a> of early isicathamiya and Mbube music includes several tracks by the Evening Birds.\n\nInformation on Pete Seeger and the Weavers primarily comes from <a href=\"https://amzn.to/319PGep\"><em>Pete Seeger vs. The Un-Americans: A Tale of the Blacklist</em> by Edward Renehan</a>.\n\n<a href=\"https://amzn.to/2ED2nqp\">This collection</a> has everything the Weavers recorded before their first split.\n\n<a href=\"https://casetext.com/case/folkways-music-publishers-inc-v-weiss\">This</a> is the record of one of the legal actions taken during Weiss' dispute with Folkways in the late eighties and early nineties.\n\nInformation on the Tokens came from <a href=\"http://tims.blackcat.nl/messages/tokens.htm\">This is My Story</a>.\n\nThere are, surprisingly, no budget compilations of the Tokens' music, but <a href=\"https://amzn.to/3hWbReX\">this best-of</a> has everything you need.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nToday we're going to look at a song that became a worldwide hit in multiple versions, and which I can guarantee everyone listening to this podcast has heard many times. A song that has been recorded by REM, that featured in a Disney musical, and which can be traced back from a white doo-wop group through a group of Communist folk singers to a man who was exploited by racist South African society -- a man who invented an entire genre of music, which got named after his most famous song, but who never saw any of the millions that his song earned for others, and died in poverty. We're going to look at the story of \"The Lion Sleeps Tonight\":\n\n[Excerpt: The Tokens, \"The Lion Sleeps Tonight\"]\n\nThe story of \"The Lion Sleeps Tonight\" is a story that goes back to 1939, when a singer called Solomon Linda was performing in South Africa. Linda was a Zulu, and thus in the racist regime of South Africa was largely without rights.\n\nLinda was, in the thirties and forties, probably the single most important performer in South Africa. He was the leader of a vocal group called the Evening Birds, who were the most popular isicathamiya group in South Africa.\n\nIsicathamiya -- and I hope I'm pronouncing that right -- was a form of music which has a lot of parallels to some of the American vocal group music we've looked at, largely because it comes from some of the same roots. I don't pretend to be an expert on the music by any means -- I'll put a link on the podcast webpage to a book which has far more information about this -- but as best I understand it, it's a music created when rural black people were forcibly displaced in the late nineteenth century and forced to find work in the city.\n\nThose people combined elements of traditional Zulu music with two more Western elements. The first was the religious music that they heard from Church missions, and the second was American minstrel songs, heard from troupes of minstrels that toured the country, especially a black performer named Orpheus McAdoo, who led a troupe of minstrel and gospel performers who toured South Africa a lot in the late nineteenth century.\n\nThis new style of music was usually performed a capella, though sometimes there might be a single instrument added, and it gained a relatively formalised structure -- it would almost always have very specific parts based on European choral music, with parts for a tenor, a soprano, an alto, and a bass, in strict four-part harmony -- though the soprano and alto parts would be sung in falsetto by men. It would usually be based around the same I, IV, and V chords that most Western popular music was based on, and the Zulu language would often be distorted to fit Western metres, though the music was still more freeform than most of the Western music of the time.\n\nThis music started to be recorded in around 1930, and you can get an idea of the stylistic range from two examples. Here's \"Umteto we Land Act\" by Caluza's Double Quartet:\n\n[Excerpt, \"Umteto We Land Act\", Caluza's Double Quartet\"]\n\nWhile here's the Bantu Glee Singers, singing \"Jim Takata Kanjani\":\n\n[Excerpt: The Bantu Glee Singers, \"Jim Takata Kanjani\"]\n\nSolomon Linda's group, the Evening Birds, sang in this style, but incorporated a number of innovations. One was that they dressed differently -- they wore matching striped suits, rather than the baggy trousers that the older groups wore -- but also, they had extra bass singers. Up until this point, there would be four singers or multiples of four, with one singer singing each part. The Evening Birds, at Linda's instigation, had a much thicker bass part, and in some ways prefigured the sound of doo-wop that would take over in America twenty years later.\n\nTheir music was often political -- while the South African regime was horribly oppressive in the thirties, it wasn't as oppressive as it later became, and a certain amount of criticism of the government was allowed in ways it wouldn't be in future decades.\n\nAt the time, the main way in which this music would be performed was at contests with several groups, most of whom would be performing the same repertoire. An audience member would offer to pay one of the groups a few pennies to start singing -- and then another audience member, when they got bored with the first group, would offer that group some more money to stop singing, before someone else offered another group some money. The Evening Birds quickly became the centre of this scene, and between 1933 and 1948, when they split, they were the most popular group around. As with many of the doo-wop groups they so resembled, they had a revolving lineup with members coming and going, and joining other groups like the Crocodiles and the Dundee Wandering Singers. There was even a second group called the Evening Birds, with a singer who sounded like Linda, and who had a long-running feud with Linda's group.\n\nBut it wasn't this popularity that got the Evening Birds recorded. It was because Solomon Linda got a day job packing records for Gallo Records, the only record label in South Africa, which owned the only recording studio in sub-Saharan Africa. While he was working in their factory, packing records, he managed to get the group signed to make some records themselves. In the group's second session, they recorded a song that Linda had written, called \"Mbube\", which means \"lion\", and was about hunting the lions that would feed on his family's cattle when he was growing up:\n\n[Excerpt: Solomon Linda and the Evening Birds, \"Mbube\"]\n\nThere's some dispute as to whether Linda wrote the whole song, or whether it's based on a traditional Zulu song -- I tend to fall on the side of Linda having written the whole thing, because very often when people say something is based on a traditional song, what they actually mean is \"I don't believe that an uneducated or black person can have written a whole song\".\n\nBut whatever the circumstances of most of the composition, one thing is definitely known – Linda was the one who came up with this falsetto melody:\n\n[Excerpt: Solomon Linda and the Evening Birds, \"Mbube\"]\n\nThe song became massively, massively popular -- so popular that eventually the master copy of the record disintegrated, as they'd pressed so many copies from it. It gave its name to a whole genre of music -- in the same way that late fifties American vocal groups are doo-wop groups, South African groups like Ladysmith Black Mambazo are, more than eighty years later, still known as \"mbube groups\".\n\nLinda and the Evening Birds would make many more records, like \"Anodu Gonda\":\n\n[Excerpt: Solomon Linda and the Evening Birds, \"Anodu Gonda\"]\n\nBut it was \"Mbube\" that was their biggest hit. It sold a hundred thousand copies on Gallo Records -- and earned Solomon Linda, its writer and lead singer, ten shillings. The South African government at the time estimated that a black family could survive on thirty-seven shillings and sixpence a week. So for writing the most famous melody ever to come out of Africa, Linda got a quarter of a week's poverty-level wages. When Linda died in 1962, he had a hundred rand -- equivalent then to fifty British pounds -- in his bank account. He was buried in an unmarked grave.\n\nAnd, a little over a year before his death, his song had become an international number one hit record. To see why, we have to go back to 1952, and a folk group called the Weavers.\n\nPete Seeger, the most important member of the Weavers, is a figure who is hugely important in the history of the folk music rebirth of the 1960s. Like most of the white folk singers of the period, he had an incredibly privileged background -- he had attended Harvard as a classmate of John F Kennedy -- but he also had very strong socialist principles. He had been friends with both Woody Guthrie and Lead Belly in the forties, and he dedicated his later career to the same kind of left-wing activism that Guthrie had taken part in.\n\nIndeed, Guthrie and Seeger had both been members of the Almanac Singers, a folk group of the forties who had been explicitly pro-Communist. They'd been pacifists up until the Soviet entry into the Second World War, at which point they had immediately turned round and become the biggest cheerleaders of the war:\n\n[Excerpt: The Almanac Singers, \"Round and Round Hitler's Grave\"]\n\nThe Almanac Singers had a revolving door membership, including everyone from Burl Ives to Cisco Houston at one point or another, but the core of the group had been Seeger and Lee Hays, and those two had eventually formed another group, more or less as a continuation of the Almanac Singers, but with a less explicitly political agenda -- they would perform Guthrie and Lead Belly songs, and songs they wrote themselves, but not be tied to performing music that fit the ideological line of the Communist Party.\n\nThe Weavers immediately had far more commercial success than the Almanac Singers ever had, and recorded such hits as their version of Lead Belly's \"Goodnight Irene\", with orchestration by Gordon Jenkins:\n\n[Excerpt: The Weavers, \"Goodnight Irene\"]\n\nAnd one of the hits they recorded was a version of \"Mbube\", which they titled \"Wimoweh\".\n\nAlan Lomax, the folk song collector, had discovered somewhere a big stack of African records, which were about to be thrown out, and he thought to himself that those would be exactly the kind of thing that Pete Seeger might want, and gave them to him. Seeger loved the recording of \"Mbube\", but neither man had any clear idea of what the song was or where it came from. Seeger couldn't make out the lyrics -- he thought Linda was singing something like \"Wimoweh\", and he created a new arrangement of the song, taking Linda's melody from the end of the song and singing it repeatedly throughout:\n\n[Excerpt: The Weavers, \"Wimoweh\"]\n\nAt the time, the Weavers were signed as songwriters to Folkways, a company that was set up to promote folk music, but was part of a much bigger conglomerate, The Richmond Organisation. When they were informed that the Weavers were going to record \"Wimoweh\", Folkways contacted the South African record company and were informed that \"Mbube\" was a traditional folk song. So Folkways copyrighted \"Mbube\", as \"Wimoweh\", in the name Paul Campbell -- a collective pseudonym that the Weavers used for their arrangements of traditional songs.\n\nShortly after this, Gallo realised their mistake and tried to copyright \"Mbube\" themselves in the USA, under Solomon Linda's name, only to be told that Folkways already had the copyright. Now, in the 1950s the USA was not yet a signatory to the Berne Convention, the international agreement on copyright laws, and so it made no difference that in South Africa the song had been copyrighted under Linda's name -- in the USA it was owned by Folkways, because they had registered it first.\n\nBut Folkways wanted the rights for other countries, too, and so they came to an agreement with Gallo that would be to Gallo's immense disadvantage. Because they agreed that they would pay Gallo a modest one-off fee, and \"let\" Gallo have the rights to the song in a few territories in Africa, and in return Folkways would get the copyright everywhere else. Gallo agreed, and so \"Mbube\" by Solomon Linda and \"Wimoweh\" by Paul Campbell became separate copyrights -- Gallo had, without realising it, given up their legal rights to the song throughout the world.\n\n\"Wimoweh\" by the Weavers went to number six on the charts, but then Senator McCarthy stepped in. Both Pete Seeger and Lee Hays had been named as past Communist Party members, and were called before the House Unamerican Activities Committee to testify. Hays stood on his fifth amendment rights, refusing to testify against himself, but Seeger took the riskier option of simply refusing on first amendment grounds. He said, quite rightly, that his political activities, voting history, and party membership were nobody's business except his, and he wasn't going to testify about them in front of Congress. He spent much of the next decade with the threat of prison hanging over his head.\n\nAs a result, the Weavers were blacklisted from radio and TV, as was Seeger as a solo artist. \"Wimoweh\" dropped off the charts, and the group's recording catalogue was deleted. The group split up, though they did get back together again a few years later, and managed to have a hit live album of a concert they performed at Carnegie Hall in 1955, which also included \"Wimoweh\":\n\n[Excerpt: The Weavers, \"Wimoweh (live at Carnegie Hall)\"]\n\nSeeger left the group permanently a couple of years after that, when they did a commercial for tobacco -- the group were still blacklisted from the radio and TV, and saw it as an opportunity to get some exposure, but Seeger didn't approve of tobacco or advertising, and quit the group because of it -- though because he'd made a commitment to the group, he did appear on the commercial, not wanting to break his word. At his suggestion, he was replaced by Erik Darling, from another folk group, The Tarriers. Darling was an Ayn Rand fan and a libertarian, so presumably didn't have the same attitudes towards advertising.\n\nAs you might have gathered from this, Seeger was a man of strong principles, and so you might be surprised that he would take credit for someone else's song. As it turned out, he didn't. When he discovered that Solomon Linda had written the song, that it wasn't just a traditional song, he insisted that all future money he would have made from it go to Linda, and sent Linda a cheque for a thousand dollars for the money he'd already earned. But Seeger was someone who didn't care much about money at all -- he donated the vast majority of his money to worthy causes, and lived frugally, and he assumed that the people he was working with would behave honourably and keep to agreements, and didn't bother checking on them. They didn't, and Linda saw nothing from them.\n\nOver the years after 1952, \"Wimoweh\" became something of a standard in America, with successful versions like the one by Yma Sumac:\n\n[Excerpt: Yma Sumac, \"Wimoweh\"]\n\nAnd in the early sixties it was in the repertoire of almost every folk group, being recorded by groups like the Kingston Trio, who had taken the Weavers' place as the most popular folk group in the country.\n\nAnd then the Tokens entered the picture. We've mentioned the Tokens before, in the episode on \"Will You Love Me Tomorrow?\" -- they were the group, also known as the Linc-Tones, that was led by Carole King's friend Neil Sedaka, and who'd recorded \"While I Dream\" with Sedaka on lead vocals:\n\n[Excerpt: Neil Sedaka and the Tokens, \"While I Dream\"]\n\nAfter recording that, one member of the group had gone off to college, and been replaced by the falsetto singer Jay Siegel. But then the group had split up, and Sedaka had gone on to a very successful career as a solo performer and a songwriter.\n\nBut Siegel and one of the other group members, Hank Medress, had carried on performing together, and had formed a new group, Darrell and the Oxfords, with two other singers. That group had made a couple of records for Roulette Records, one of which, \"Picture in Your Wallet\", was a local hit:\n\n[Excerpt: Darrell and the Oxfords, \"Picture in Your Wallet\"]\n\nBut that group had also split up. So the duo invited yet another pair of singers to join them -- Mitch Margo, who was around their age, in his late teens, and his twelve-year-old brother Phil. The group reverted to their old name of The Tokens, and recorded a song called \"Tonight I Fell In Love\", which they leased to a small label called Warwick Records:\n\n[Excerpt: The Tokens, \"Tonight I Fell In Love\"]\n\nWarwick Records sat on the track for six months before releasing it. When they did, in 1961, it went to number fifteen on the charts. But by then, the group had signed to RCA Records, and were now working with Hugo and Luigi, the production duo who you might remember from the episode on \"Shout\".\n\nThe group put out a couple of flop singles on RCA, including a remake of the Moonglows' \"Sincerely\":\n\n[Excerpt: The Tokens, \"Sincerely\"]\n\nBut after those two singles flopped, the group made the record that would define them for the rest of their lives.\n\nThe Tokens had been performing \"Wimoweh\" in their stage act, and they played it for Hugo and Luigi, who thought there was something there, but they didn't think it would be commercial as it was. They decided to get a professional writer in to fix the song up, and called in George David Weiss, a writer with whom they'd worked before. The three of them had previously co-written \"Can't Help Falling In Love\" for Elvis Presley, basing it on a traditional melody, which is what they thought they were doing here:\n\n[Excerpt: Elvis Presley, \"Can't Help Falling In Love\"]\n\nWeiss took the song home and reworked it. Weiss decided to find out what the original lyrics had been about, and apparently asked the South African consulate, who told him that it was about lions, so he came up with new lyrics -- \"in the jungle, the mighty jungle, the lion sleeps tonight\".\n\nHugo and Luigi came up with an arrangement for Weiss' new version of the song, and brought in an opera singer named Anita Darian to replicate the part that Yma Sumac had sung on her version. The song was recorded, and released on the B-side of the Tokens' third flop in a row:\n\n[Excerpt: The Tokens, \"The Lion Sleeps Tonight\"]\n\nAs it was believed by everyone involved that the song was a traditional one, the new song was copyrighted in the names of Weiss, Hugo, and Luigi. And as it was released as a B-side of a flop single, nobody cared at first.\n\nBut then a DJ flipped the record and started playing the B-side, and suddenly the song was a hit. Indeed, it went to number one. And it didn't just go to number one, it became a standard, recorded over the years by everyone from Brian Eno to Billy Joel, The New Christy Minstrels to They Might Be Giants.\n\nObviously, the publishers of \"Wimoweh\", who knew that the song wasn't a traditional piece at all, wanted to get their share of the money. However, the owner of the publishing company was also a good friend of Weiss -- and Weiss was someone who had a lot of influence in the industry, and who nobody wanted to upset, and so they came to a very amicable agreement. The three credited songwriters would stay credited as the songwriters and keep all the songwriting money -- after all, Pete Seeger didn't want it, and the publishers were only under a moral obligation to Solomon Linda, not a legal one -- but the Richmond Organisation would get the publishing money.\n\nEveryone seemed to be satisfied with the arrangement, and Solomon Linda's song went on earning a lot of money for a lot of white men he never met.\n\nThe Tokens tried to follow up with a version of an actual African folk song, \"Bwa Nina\", but that wasn't a hit, and nor was a version of \"La Bamba\". While they continued their career for decades, the only hit they had as performers was in 1973, by which point Hank Medress had left and the other three had changed their name to Cross Country and had a hit with a remake of \"In the Midnight Hour\":\n\n[Excerpt: Cross Country, \"The Midnight Hour\"]\n\nI say that was the only hit they had as performers, because they went into record production themselves. There they were far more successful, and as a group they produced records like the Chiffons' \"He's So Fine\", making them the first vocal group to produce a hit for another vocal group:\n\n[Excerpt: The Chiffons, \"He's So Fine\"]\n\nThat song would, of course, generate its own famous authorial dispute case in later years. After Hank Medress left the group, he worked as a producer on his own, producing hits for Tony Orlando and Dawn, and also producing one of the later hit versions of \"The Lion Sleeps Tonight\", Robert John's version, which made number three in 1972:\n\n[Excerpt: Robert John, \"The Lion Sleeps Tonight\"]\n\nToday there are two touring versions of the Tokens, one led by Jay Siegel and one by Phil Margo.\n\nBut while in 1961 the Richmond Organisation, Hugo and Luigi, and George Weiss all seemed happy with their agreement, things started to go wrong in 1989.\n\nAmerican copyright law has had several changes over the years, and nothing of what I'm saying applies now, but for songs written before 1978 and the first of the Mickey Mouse copyright extensions, the rule used to be that a song would be in copyright for twenty-eight years. The writer could then renew it for a second twenty-eight-year term. (The rule is now that songs published in America remain in copyright until seventy years after the writer's death).\n\nAnd it's specifically the *writer* who could renew it for that second term, not the publishers. George Weiss filed notice that he was going to renew the copyright when the twenty-eight-year term expired, and that he wasn't going to let the Richmond Organisation publish the song.\n\nAs soon as the Richmond Organisation heard about this, they took Weiss to court, saying that he couldn't take the publishing rights away from them, because the song was based on \"Wimoweh\", which they owned. Weiss argued that if the song was based on \"Wimoweh\", the copyright should have reflected that for the twenty-eight years that the Richmond Organisation owned it. They'd signed papers agreeing that Weiss and Hugo and Luigi were the writers, and if they'd had a problem with that they should have said so back in 1961.\n\nThe courts sided with Weiss, but they did say that the Richmond Organisation might have had a bit of a point about the song's similarity to \"Wimoweh\", so they had to pay a small amount of money to Solomon Linda's family.\n\nAnd the American writers getting the song back coincided with two big boosts in the income from the song. First, R.E.M recorded a song called \"The Sidewinder Sleeps Tonite\", on their album Automatic For the People (a record we will definitely be talking about in 2026, assuming I'm still around and able to do the podcast by then). The album was one of the biggest records of the decade, and on the song, Michael Stipe sang a fragment of Solomon Linda's melody:\n\n[Excerpt: R.E.M. \"The Sidewinder Sleeps Tonite\"]\n\nThe owners of \"The Lion Sleeps Tonight\" took legal action about that, and got themselves credited as co-writers of R.E.M.'s song, and the group also had to record \"The Lion Sleeps Tonight\", releasing it as a B-side to the hit single version of \"Sidewinder\":\n\n[Excerpt: R.E.M. \"The Lion Sleeps Tonight\"]\n\nEven better from their point of view, the song was featured in the Disney film The Lion King, which on its release in 1994 became the second highest-grossing film of all time and the most successful animated film ever, and in its Broadway adaptation, which became the most successful Broadway show of all time.\n\nAnd in 2000, Rian Malan, a South African journalist based in America, who mostly dedicated his work to expunging his ancestral guilt -- he's a relative of Daniel Malan, the South African dictator who instituted the apartheid system, and of Magnus Malan, one of the more monstrous ministers in the regime in its last days of the eighties and early nineties -- found out that while Solomon Linda's family had been getting some money, it amounted at most to a couple of thousand dollars a year, shared between Linda's daughters. At the same time, Malan estimated that over the years the song had generated something in the region of fifteen million dollars for its American copyright owners.\n\nMalan published an article about this, and just before that, the daughters got a minor windfall -- Pete Seeger noticed a six thousand dollar payment, which came to him when a commercial used \"Wimoweh\", rather than \"The Lion Sleeps Tonight\". He realised that he'd been receiving the royalties for \"Wimoweh\" all along, even though he'd asked that they be sent to Linda, so he totalled up how much he'd earned from the song over the years, which came to twelve thousand dollars, and he sent a cheque for that amount to Linda's daughters.\n\nThose daughters were living in such poverty that in 2001, one of the four died of AIDS -- a disease which would have been completely treatable if she'd been able to afford the anti-retroviral medication to treat it.\n\nThe surviving sisters were told that the copyright in \"Mbube\" should have reverted to them in the eighties, and that they had a very good case under South African law to get a proper share of the rights to both \"Wimoweh\" and \"The Lion Sleeps Tonight\".\n\nThey just needed to find someone in South Africa that they could sue. Abilene Music, the current owners of \"The Lion Sleeps Tonight\", were based in the USA and had no assets in South Africa. Suing them would be pointless.\n\nBut they could sue someone else:\n\n[Excerpt: Timon and Pumbaa, \"The Lion Sleeps Tonight\"]\n\nDisney had assets in South Africa. Lots of them. And they'd used Solomon Linda's song in their film, which under South African law would be copyright infringement. It would even be possible, if the case went really badly for Disney, that Linda's family could get total ownership of all Disney assets in South Africa.\n\nSo in 2006, Disney came to an out of court settlement with Linda's family, and they appear to have pressured Abilene Music to do the same thing. Under South African law, \"Mbube\" would go out of copyright by 2012, but it was agreed that Linda's daughters would receive royalties on \"The Lion Sleeps Tonight\" until 2017, even after the South African copyright had expired, and they would get a lump sum from Disney. The money they were owed would be paid into a trust.\n\nAfter 2017, they would still get money from \"Wimoweh\", but not from \"The Lion Sleeps Tonight\", whose rights would revert fully to its American owners.\n\nUnfortunately, most of the money they got seems to have gone on legal bills. The three surviving sisters each received, in total, about eighty-three thousand dollars over the ten-year course of the agreement after those bills, which is much, much, more than they were getting before, but only a fraction of what the song would have earned them if they'd been paid properly.\n\nIn 2017, the year the agreement expired, Disney announced they were making a photorealistic CGI remake of The Lion King. That, too, featured \"The Lion Sleeps Tonight\", and that, too, became the most successful animated film of all time.\n\nUnder American copyright law, \"Wimoweh\" will remain in copyright until 2047, unless further changes are made to the law. Solomon Linda's family will continue to receive royalties on that song. \"The Lion Sleeps Tonight\", the much more successful song, will remain in copyright until 2057, and the money from that will mostly go to Claire Weiss-Creatore, who was George Weiss' third wife, and who after he died in 2010 became the third wife of Luigi Creatore, of Hugo and Luigi, who died himself in 2015. Solomon Linda's daughters won't see a penny of it.\n\nAccording to George Weiss' obituary in the Guardian, he \"was a familiar figure at congressional hearings into copyright reform and music piracy, testifying as to the vital importance of intellectual property protection for composers\".",
  "enclosure": "",
  "itunes:summary": "Episode ninety-two of A History of Rock Music in Five Hundred Songs looks at \"The Lion Sleeps Tonight\" by The Tokens, and at a seventy-year-long story of powerful people repeatedly ripping off less powerful people, then themselves being ripped off in turn by more powerful people, and at how racism meant that a song that earned fifteen million dollars for other people paid its composer ten shillings. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Tossin' and Turnin'\" by Bobby Lewis.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\nERRATUM: I say “Picture in Your Wallet” when I mean “Picture in My Wallet”.\n\nResources\n\nAs always, I've created&nbsp;a Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nRian Malan's 2000 article on Solomon Linda and&nbsp;The Lion Sleeps Tonight can be found here.\n\nThis 2019 article brings the story of the legal disputes up to date.\n\nThe information about isicathamiya comes from Nightsong: Performance, Power and Practice in South Africa by Veit Erlmann.\n\nThis collection of early isicathamiya and Mbube music includes several tracks by the Evening Birds.\n\nInformation on Pete Seeger and the Weavers primarily comes from Pete Seeger vs. The Un-Americans: A Tale of the Blacklist by Edward Renehan.\n\nThis collection has everything the Weavers recorded before their first split.\n\nThis is the record of one of the legal actions taken during Weiss' dispute with Folkways in the late eighties and early nineties.\n\nInformation on the Tokens came from This is My Story.\n\nThere are, surprisingly, no budget compilations of the Tokens' music, but this best-of has everything you need.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;Why not join them?\n\nTranscript\n\nToday we're going to look at a song that became a worldwide hit in multiple versions, and which I can guarantee everyone listening to this podcast has heard many times. A song that has been recorded by REM, that featured in a Disney musical, and which can be traced back from a white doo-wop group through a group of Communist folk singers to a man who was exploited by racist South African society -- a man who invented an entire genre of music, which got named after his most famous song, but who never saw any of the millions that his song earned for others, and died in poverty. We're going to look at the story of \"The Lion Sleeps Tonight\":\n\n[Excerpt: The Tokens, \"The Lion Sleeps Tonight\"]\n\nThe story of \"The Lion Sleeps Tonight\" is a story that goes back to 1939, when a singer called Solomon Linda was performing in South Africa. Linda was a Zulu, and thus in the racist regime of South Africa was largely without rights.\n\nLinda was, in the thirties and forties, probably the single most important performer in South Africa. He was the leader of a vocal group called the Evening Birds, who were the most popular isicathamiya group in South Africa.\n\nIsicathamiya -- and I hope I'm pronouncing that right -- was a form of music which has a lot of parallels to some of the American vocal group music we've looked at, largely because it comes from some of the same roots. I don't pretend to be an expert on the music by any means -- I'll put a link on the podcast webpage to a book which has far more information about this -- but as best I understand it, it's a music created when rural black people were forcibly displaced in the late nineteenth century and forced to find work in the city.\n\nThose people combined elements of traditional Zulu music with two more Western elements. The first was the religious music that they heard from Church missions, and the second was American minstrel songs, heard from tr",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode ninety-two of A History of Rock Music in Five Hundred Songs looks at \"The Lion Sleeps Tonight\" by The Tokens, and at a seventy-year-long story of powerful people repeatedly ripping off less powerful people, then themselves being ripped off in turn by more powerful people, and at how racism meant that a song that earned fifteen million dollars for other people paid its composer ten shillings. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Tossin' and Turnin'\" by Bobby Lewis.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\nERRATUM: I say “Picture in Your Wallet” when I mean “Picture in My Wallet”.\n\nResources\n\nAs always, I've created&nbsp;a Mixcloud streaming playlist&nbsp;",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}