{
  "title": "Car plows through pro-Bolsonaro protesters blocking road (VIDEO)",
  "link": "https://www.rt.com/news/565853-brazil-car-plows-protesters/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565853-brazil-car-plows-protesters/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6363748820302778bd57ce62.jpg\" /> A man drove his car through a crowd of pro-Bolsonaro protesters who blocked a highway <br/><a href=\"https://www.rt.com/news/565853-brazil-car-plows-protesters/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Supporters unhappy with the Brazilian president’s election loss have been disrupting traffic</strong></p>\n            \n                        \n            <p></p>\n<p>A man was arrested in Brazil after driving his car through a crowd of supporters of Brazilian President Jair Bolsonaro, injuring nine people.</p>\n<p>The incident happened on Tuesday afternoon on the Washington Luis Highway, according to national media. A group of people protesting the incumbent president&rsquo;s election defeat were demonstrating in the middle of the road.</p>\n<p>The driver, who was later identified by state military police as a 28-year-old man, asked the crowd to let him pass through the blockade, but was denied. He then took off and drove through the crowd, carrying a number of protesters on the hood, footage of the incident shows.</p>\n<p>The vehicle stopped shortly thereafter, and officers had to protect the driver from angry demonstrators who attempted to retaliate. He was arrested, and his 74-year-old mother, who was also in the car, was let go.</p>\n\n            <blockquote class=\"twitter-tweet\"><p lang=\"es\" dir=\"ltr\">Brasil: Un auto atropelló a varios militantes de Jair Bolsonaro que cortaban hoy uno de los ingresos a Río Janeiro, en reclamo de que se revise el funcionamiento del voto electrónico tras el triunfo de Lula. <a href=\"https://t.co/6R861RIDAm\">pic.twitter.com/6R861RIDAm</a></p>&mdash; @diarioconurbano (@DiarioConurbano) <a href=\"https://twitter.com/DiarioConurbano/status/1587927947540733952?ref_src=twsrc%5Etfw\">November 2, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n    \n\n<p>The suspect is facing charges of attempted murder. He injured nine people, including a 12-year-old girl and two law enforcement officers, the military police said in a statement. The incident took place in the Mirassol municipality in the state of Sao Paulo, around 400km northwest of the provincial capital.</p>\n\n    \n        \n\n    <iframe\n         width=\"100%\"         height=\"100%\"                src=\"\"\n        frameborder=\"0\"></iframe>\n\n\n\n\n<p>Mass protests erupted in Brazil after Bolsonaro suffered a narrow defeat at the hands of former President Luiz Inacio Lula da Silva on Sunday. Before the election, he claimed that he could only lose if there was fraud, and he never formally conceded defeat. The protesters are demanding a military takeover of the government and an inquiry into the nation&rsquo;s electronic voting system.</p>\n\n            \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/news/565843-bolsonaro-protests-clear-roadblocks/\">\n            <span>READ MORE: </span>Bolsonaro urges protesters to clear roadblocks\n        </a>\n    </p>\n\n    \n\n<p>On Wednesday, Bolsonaro asked his supporters not to block federal highways, stating that by doing so, they were only undermining the legitimacy of their movement. He urged them instead to gather in squares and other proper places for rallies.&nbsp;</p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 09:55:14 +0000",
  "dc:creator": "RT"
}