{
  "title": "Marijuana Taxes: How to Do It?",
  "link": "https://conversableeconomist.com/2022/10/21/marijuana-taxes-how-to-do-it/",
  "dc:creator": "conversableeconomist",
  "pubDate": "Fri, 21 Oct 2022 20:38:50 +0000",
  "category": "Uncategorized",
  "guid": "https://conversableeconomist.com/?p=12993",
  "description": "<p>Nineteen states have enacted marijuana taxes, although five of them (Connecticut, New York, Rhode Island, Vermont, and Virginia) have not yet actually collected any revenue from them. But there is no common model. Some states impose the tax as a percentage of the purchase price: some based on the weight of the product sold; and &#8230; <a href=\"https://conversableeconomist.com/2022/10/21/marijuana-taxes-how-to-do-it/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Marijuana Taxes: How to Do It?</span></a></p>\n<p>The post <a href=\"https://conversableeconomist.com/2022/10/21/marijuana-taxes-how-to-do-it/\">Marijuana Taxes: How to Do It?</a> first appeared on <a href=\"https://conversableeconomist.com\">Conversable Economist</a>.</p>",
  "content:encoded": "<p>Nineteen states have enacted marijuana taxes, although five of them (Connecticut, New York, Rhode Island, Vermont, and Virginia) have not yet actually collected any revenue from them.  But there is no common model. Some states impose the tax as a percentage of the purchase price: some based on the weight of the product sold; and some based on the potency of the product. Some use more than one of these approaches. <a href=\"https://www.urban.org/research/publication/pros-and-cons-cannabis-taxes\">Richard Auxier and Nikhita Airi discuss what&#8217;s happening and look at the tradeoffs in &#8220;The Pros and Cons of Cannabis Taxes&#8221; </a>(Tax Policy Center, September 28, 2022).  </p>\n\n\n\n<p>Here&#8217;s the selection of state taxes used: </p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img data-attachment-id=\"12998\" data-permalink=\"https://conversableeconomist.com/2022/10/21/marijuana-taxes-how-to-do-it/image-4-11/\" data-orig-file=\"https://i0.wp.com/conversableeconomist.com/wp-content/uploads/2022/10/image-4.png?fit=717%2C621&ssl=1\" data-orig-size=\"717,621\" data-comments-opened=\"0\" data-image-meta=\"{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}\" data-image-title=\"image-4\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/conversableeconomist.com/wp-content/uploads/2022/10/image-4.png?fit=300%2C260&ssl=1\" data-large-file=\"https://i0.wp.com/conversableeconomist.com/wp-content/uploads/2022/10/image-4.png?fit=712%2C617&ssl=1\" decoding=\"async\" loading=\"lazy\" width=\"712\" height=\"617\" src=\"https://i0.wp.com/conversableeconomist.com/wp-content/uploads/2022/10/image-4.png?resize=712%2C617&#038;ssl=1\" alt=\"\" class=\"wp-image-12998\" srcset=\"https://i0.wp.com/conversableeconomist.com/wp-content/uploads/2022/10/image-4.png?w=717&ssl=1 717w, https://i0.wp.com/conversableeconomist.com/wp-content/uploads/2022/10/image-4.png?resize=300%2C260&ssl=1 300w\" sizes=\"(max-width: 712px) 100vw, 712px\" data-recalc-dims=\"1\" /></figure>\n\n\n\n<p></p>\n\n\n\n<p>Given the different kinds of taxes used, and the underlying differences in ordinary sales taxes, comparing marijuana taxes across states isn&#8217;t simple. But based on assumptions about a standard price per ounce,, weight, and potency, they find that the total state and local tax burden on marijuana, including both marijuana-specific taxes and general sales taxes, is in typically in the range of 20-40%. Alaska, Colorado, Nevada and Washington all collect from 1.2% to 1.7% of state tax revenue from marijuana excise taxes; indeed, &#8220;[a]mong all 11 states that collected cannabis tax revenue for the entire 2022 fiscal year, eight collected more revenue from cannabis taxes than alcohol taxes, while Colorado, Nevada, and Washington collected more from cannabis taxes than cigarette taxes. &#8230; Colorado and Washington both collected more from state cannabis taxes than state alcohol and cigarette taxes in fiscal year 2022.&#8221;</p>\n\n\n\n<p>A sales tax approach has the advantage of simplicity, especially if it can just be combined with an existing state-level sales tax, similarly to the way that some places impose additional sales taxes on hotels or car rental sales. A downside is that when marijuana is legalized, the price often starts fairly high and the declines over time&#8211;and so it&#8217;s possible that a sales tax approach may generate declining revenue over time. Of course, a state could also adjust its marijuana tax rates over time. </p>\n\n\n\n<p>For examples of a weight-based tax, &#8220;Alaska levies a $50-per-ounce tax on flower and $25-per-ounce tax on leaves while Maine levies roughly a $20-per-ounce tax on flower and a $6-per-ounce tax on leaves,&#8221; while the New Jersey weight-based tax is the same for all parts of the plant. From the state&#8217;s point of view, a weight-based tax will also generate records of the quantity of marijuana produced. With a weight-based tax, state tax revenues don&#8217;t shift with the price of marijuana, but only with the quantity.  In addition, it creates a record of the quantity being produced&#8211;which can help in checking that marijuana producers are not diverting part of their production to the illegal and untaxed market. On the other side, a weight-based tax requires a new bureaucracy to administer it, which is the main reason that California (and other states) repealed their original weight-based tax and went with the sales tax approach instead. </p>\n\n\n\n<p>A potency-based tax is similar in intention to alcohol taxes that impose lower rates on beer and higher rates on whiskey. A main concern here is that if the marijuana tax is based on price or weight, there is some incentive to choose whatever price or weight provides the highest dose, while a potency-based tax rewards choosing a lower potency. In addition, a potency-based tax means that relatively low-potency legal marijuana would not be at a tax disadvantage vs. low-potency illegal marijuana&#8211;and thus help to put a damper on the untaxed illegal market.  A potency-based tax does require a new bureaucracy to monitor the sampling of products, lab processes, and retention of records. But these steps could be simplified in a future where marijuana potency was more clearly labelled.</p>\n\n\n\n<p>Ultimately, the main problem with choosing between these methods is that different policy goals are involved. One goal is raising tax revenue, which will tend to imply that the state desires high total sales. Another goal is offsetting the cost of externalities from legalizing marijuana use, like social costs of driving under the influence, which involve discouraging overuse in certain situations.  Yet another goal is discouraging the use of extremely potent products, which is also aimed at both social harms and potential harms to the user. </p>\n\n\n\n<p>The discussion above has focused on taxation of marijuana for recreational use. The authors also point out that of the 37 states that have legalized marijuana for medicinal uses, 10 of them have imposed specific taxes on this particular medicine. Indeed,  &#8220;both medical and recreational cannabis are subject to the same excise tax in California (15 percent retail excise tax), Illinois (7 percent cannabis cultivation privilege tax), and Nevada (15 percent weight-based tax).&#8221; Of course, when medical and recreational uses of marijuana have the same tax, it implies that the costs and benefits of such use are the same, however they are labelled. </p>\n\n\n\n<p> </p>\n<p><a class=\"a2a_button_facebook\" href=\"https://www.addtoany.com/add_to/facebook?linkurl=https%3A%2F%2Fconversableeconomist.com%2F2022%2F10%2F21%2Fmarijuana-taxes-how-to-do-it%2F&linkname=Marijuana%20Taxes%3A%20How%20to%20Do%20It%3F\" title=\"Facebook\" rel=\"nofollow noopener\" target=\"_blank\"></a><a class=\"a2a_button_twitter\" href=\"https://www.addtoany.com/add_to/twitter?linkurl=https%3A%2F%2Fconversableeconomist.com%2F2022%2F10%2F21%2Fmarijuana-taxes-how-to-do-it%2F&linkname=Marijuana%20Taxes%3A%20How%20to%20Do%20It%3F\" title=\"Twitter\" rel=\"nofollow noopener\" target=\"_blank\"></a><a class=\"a2a_button_email\" href=\"https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fconversableeconomist.com%2F2022%2F10%2F21%2Fmarijuana-taxes-how-to-do-it%2F&linkname=Marijuana%20Taxes%3A%20How%20to%20Do%20It%3F\" title=\"Email\" rel=\"nofollow noopener\" target=\"_blank\"></a><a class=\"a2a_dd addtoany_share_save addtoany_share\" href=\"https://www.addtoany.com/share#url=https%3A%2F%2Fconversableeconomist.com%2F2022%2F10%2F21%2Fmarijuana-taxes-how-to-do-it%2F&#038;title=Marijuana%20Taxes%3A%20How%20to%20Do%20It%3F\" data-a2a-url=\"https://conversableeconomist.com/2022/10/21/marijuana-taxes-how-to-do-it/\" data-a2a-title=\"Marijuana Taxes: How to Do It?\"></a></p><p>The post <a href=\"https://conversableeconomist.com/2022/10/21/marijuana-taxes-how-to-do-it/\">Marijuana Taxes: How to Do It?</a> first appeared on <a href=\"https://conversableeconomist.com\">Conversable Economist</a>.</p>",
  "post-id": 12993
}