{
  "title": "Episode 15: Government Can't Stop Creative Destruction",
  "itunes:title": "Episode 15: Government Can't Stop Creative Destruction",
  "pubDate": "Wed, 24 May 2017 16:00:00 +0000",
  "guid": "1eba69124d7b7d2b0cd7e3b2a8d7b7bc",
  "link": "https://wordsandnumbers.libsyn.com/government-cant-stop-creative-destruction",
  "itunes:image": "",
  "description": "<p>Technology doesn’t just change things, it utterly destroys things. And that’s just fine. It happens so often that people barely even notice when it does. Think about all the new services that have come to market just over the past few years: Uber, Airbnb, Redbox … the list goes on and on.<br /> <br /> But that’s only half the story. In turn, the list of services replaced by these new ones is similarly long: taxis, hotels, Blockbuster, etc. And workers in these industries often lose their jobs in the line of creative destruction. We generally accept this as the price of innovation, but many people try to use the government to stop this by blocking the new services.<br /> <br /> Today we’re seeing this with more politically well-connected industries like taxis and hotels. Pressure is put on Uber and Airbnb, respectively, to “protect” the established industries they are upending. <br /> <br /> This week, Ant and James talk about why this is always a mistake.<br /> <br /> Learn More:<br /> <a href= \"https://fee.org/articles/government-cant-stop-creative-destruction/\"> https://fee.org/articles/government-cant-stop-creative-destruction/</a></p> <p> </p>",
  "content:encoded": "<p>Technology doesn’t just change things, it utterly destroys things. And that’s just fine. It happens so often that people barely even notice when it does. Think about all the new services that have come to market just over the past few years: Uber, Airbnb, Redbox … the list goes on and on.  But that’s only half the story. In turn, the list of services replaced by these new ones is similarly long: taxis, hotels, Blockbuster, etc. And workers in these industries often lose their jobs in the line of creative destruction. We generally accept this as the price of innovation, but many people try to use the government to stop this by blocking the new services.  Today we’re seeing this with more politically well-connected industries like taxis and hotels. Pressure is put on Uber and Airbnb, respectively, to “protect” the established industries they are upending.   This week, Ant and James talk about why this is always a mistake.  Learn More: <a href= \"https://fee.org/articles/government-cant-stop-creative-destruction/\"> https://fee.org/articles/government-cant-stop-creative-destruction/</a></p> <p> </p>",
  "enclosure": "",
  "itunes:duration": "12:58",
  "itunes:explicit": false,
  "itunes:keywords": "creative,technology,education,politics,government,economics,Opinion,destruction",
  "itunes:subtitle": "Technology doesn’t just change things, it utterly destroys things. And that’s just fine. It happens so often that people barely even notice when it does. Think about all the new services that have come to market just over the past few years: Uber,...",
  "itunes:season": 1,
  "itunes:episode": 15,
  "itunes:episodeType": "full",
  "itunes:author": "Foundation for Economic Education"
}