{
  "title": "Good Businesses in Bad Times",
  "pubDate": "Sat, 26 Feb 2022 17:00:00 +0000",
  "guid": "0e6bf6cc-4d5b-48f2-bc27-93aab5a47c9b",
  "link": "https://fool.libsyn.com/good-businesses-in-bad-times",
  "itunes:image": "",
  "description": "<p>If you want to do well as an investor, you have to get comfortable with the idea of holding great companies through difficult times. (Like the one we're in right now.<br aria-hidden= \"true\" /> <br aria-hidden=\"true\" /> Motley Fool senior analysts John Rotonti, Maria Gallagher, and Ron Gross take a look at how strong companies bounced back from difficult times, and how investors can apply those lessons today. They discuss:<br aria-hidden=\"true\" /> - The tough decisions from management at Domino’s and Apple that ultimately rewarded shareholders<br aria-hidden=\"true\" /> - How Disney found strength in its intellectual property<br aria-hidden=\"true\" /> - Key takeaways from investing through the Great Recession<br aria-hidden=\"true\" /> - Best Buy rebounding from being \"Amazon’s showroom\"<br aria-hidden=\"true\" /> <br aria-hidden=\"true\" /> Stocks discussed: DPZ, DIS, AAPL, BBY, AMZN, AMD, SBUX, PTON<br aria-hidden=\"true\" /> <br aria-hidden=\"true\" /> Host: John Rotonti<br aria-hidden=\"true\" /> Guests: Ron Gross, Maria Gallagher<br aria-hidden=\"true\" /> Producer: Ricky Mulvey<br aria-hidden=\"true\" /> Engineer: Rick Engdahl, Austin Morgan</p>",
  "content:encoded": "<p>If you want to do well as an investor, you have to get comfortable with the idea of holding great companies through difficult times. (Like the one we're in right now.  Motley Fool senior analysts John Rotonti, Maria Gallagher, and Ron Gross take a look at how strong companies bounced back from difficult times, and how investors can apply those lessons today. They discuss: - The tough decisions from management at Domino’s and Apple that ultimately rewarded shareholders - How Disney found strength in its intellectual property - Key takeaways from investing through the Great Recession - Best Buy rebounding from being \"Amazon’s showroom\"  Stocks discussed: DPZ, DIS, AAPL, BBY, AMZN, AMD, SBUX, PTON  Host: John Rotonti Guests: Ron Gross, Maria Gallagher Producer: Ricky Mulvey Engineer: Rick Engdahl, Austin Morgan</p>",
  "enclosure": "",
  "itunes:duration": "23:05",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "If you want to do well as an investor, you have to get comfortable with the idea of holding great companies through difficult times. (Like the one we're in right now.  Motley Fool senior analysts John Rotonti, Maria Gallagher, and Ron Gross take a...",
  "itunes:episodeType": "full"
}