{
  "title": "Important questions",
  "link": "https://statmodeling.stat.columbia.edu/2022/11/04/important-questions/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/11/04/important-questions/#comments",
  "dc:creator": "Lizzie",
  "pubDate": "Fri, 04 Nov 2022 13:01:24 +0000",
  "category": [
    "Decision Theory",
    "Political Science",
    "Sociology",
    "Zombies"
  ],
  "guid": "https://statmodeling.stat.columbia.edu/?p=48161",
  "description": "This post is by Lizzie. I have been robbed twice in my life: first as a grad student when I was traveling and most of my belongings were in a rental car, and second when some teenagers crow-barred the apartment &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/11/04/important-questions/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p><a href=\"https://statmodeling.stat.columbia.edu/wp-content/uploads/2022/11/P1090890sm-1.jpg\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-48163\" src=\"https://statmodeling.stat.columbia.edu/wp-content/uploads/2022/11/P1090890sm-1.jpg\" alt=\"\" width=\"889\" height=\"667\" srcset=\"https://statmodeling.stat.columbia.edu/wp-content/uploads/2022/11/P1090890sm-1.jpg 889w, https://statmodeling.stat.columbia.edu/wp-content/uploads/2022/11/P1090890sm-1-300x225.jpg 300w, https://statmodeling.stat.columbia.edu/wp-content/uploads/2022/11/P1090890sm-1-768x576.jpg 768w, https://statmodeling.stat.columbia.edu/wp-content/uploads/2022/11/P1090890sm-1-400x300.jpg 400w\" sizes=\"(max-width: 889px) 100vw, 889px\" /></a>This post is by Lizzie.</p>\n<p>I have been robbed twice in my life: first as a grad student when I was traveling and most of my belongings were in a rental car, and second when some teenagers crow-barred the apartment I was staying in. The first time I was robbed I learned a some useful information that made getting robbed the second time easier: when you tell people you&#8217;ve been robbed they often say the most useless things. People who purported to be my friends would reply immediately with, &#8216;what type of car was it?&#8217; or &#8216;where exactly did you park?&#8217; While there are definitely predictors that increased the probability of me being robbed, I didn&#8217;t fully see the point of these questions.</p>\n<p>Eventually my Mum or some other soul wiser than me explained this to me. They&#8217;re asking these questions to construct a model of the world in which they don&#8217;t get robbed. I sort of get this: it can be traumatic to have most of your worldly possessions stolen. I hope they didn&#8217;t also know that it can be painful to have your friends be so lame and self-centered.</p>\n<p>I was trying to explain something similar the other night when a friend and colleague caught me after a group zoom call to ask me something. She had met someone who was a graduate student when I interviewed at their graduate institution for a faculty job. I always enjoyed meeting grad students on interviews; they were so much fun, asked interesting questions and made me hopeful about the world. I interviewed at many places and have run into some of these students since and always really enjoy it, so I thought this was where the conversation was going. No.</p>\n<p>The student had recounted that at the end of my job talk a senior white faculty member got up and made an obnoxious and gendered comment that in no way related to my science.</p>\n<p>I don&#8217;t remember this. I suspect I don&#8217;t because it was the least of my troubles back then. I remembered the guy though. In our one-on-one interview he asked me if I was planning to freeze my eggs. And in case you as a reader want to chock this up to a one-off, my notes from asking a female faculty member in the department are: &#8220;Everyone has had totally weird interactions with him, when she interviewed he told her all about his relationship with his wife. Someone else interviewing told him to **** off. And nothing slows him down, he&#8217;s gotten worse with age.&#8221;</p>\n<p>What I told my colleague on the Zoom call, though, was what hurt was how people replied to it. How many people tried to brush it off in one way or another (even when I couched it in my reality &#8212; I liked this guy in many ways and people are multifaceted and complex, they are rarely all good or evil).</p>\n<p>I was trying to recount this an hour later over beers but I didn&#8217;t get to finish the thought. One woman worked to come up with witty quips that I should have said back. And the one guy said, &#8216;oh, I know him. He likes to shock people. You know how you should handle this guy is &#8230;.&#8217; which led onward to &#8216;I wanted to invite him a few years back and my colleague said &#8216;I dunno&#8217; so then we invited him and someone known to be even crazier! And let me tell you about him. He got into a physical altercation with someone &#8230;.&#8217;</p>\n<p>So, I just wanted to make a public service announcement to folks who want to reply in similar ways to people telling you about harassment they received &#8212; consider keeping these thoughts to yourself. And then maybe take some time to figure out why you so desperately jump at saying them.</p>\n<p>In other news, look what I saw on my hike on Wednesday!</p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/11/04/important-questions/feed/",
  "slash:comments": 47
}