{
  "title": "Reader Case Study: Is it Okay to Subsidize my Spendypants Adult Children?",
  "link": "https://www.mrmoneymustache.com/2022/01/27/case-study-adult-children/",
  "comments": "https://www.mrmoneymustache.com/2022/01/27/case-study-adult-children/#comments",
  "dc:creator": "Mr. Money Mustache",
  "pubDate": "Thu, 27 Jan 2022 21:16:52 +0000",
  "category": [
    "Case Studies",
    "The MMM Blog"
  ],
  "guid": "https://www.mrmoneymustache.com/?p=18037",
  "description": "It has been a good while since we&#8217;ve done a reader case study here on MMM, but that hasn&#8217;t stopped them from arriving in my inbox. And since 2022 is becoming a year of interesting financial changes, it&#8217;s time to spark things up again, go back to our roots, and start covering some of the [&#8230;]",
  "content:encoded": "<a class=\"featured_image_link\" href=\"https://www.mrmoneymustache.com/2022/01/27/case-study-adult-children/\"><img style=\"max-width:100%;height:auto\" width=\"800\" height=\"542\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/01/comfort-eagle.jpg\" class=\"attachment-full size-full wp-post-image\" alt=\"\" loading=\"lazy\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/01/comfort-eagle.jpg 800w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/comfort-eagle-300x203.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/comfort-eagle-200x136.jpg 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/comfort-eagle-768x520.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/comfort-eagle-150x102.jpg 150w\" sizes=\"(max-width: 800px) 100vw, 800px\" /></a>\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/01/comfort-eagle.jpg\" alt=\"\" class=\"wp-image-18064\" width=\"436\" height=\"296\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/01/comfort-eagle.jpg 800w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/comfort-eagle-300x203.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/comfort-eagle-200x136.jpg 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/comfort-eagle-768x520.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/comfort-eagle-150x102.jpg 150w\" sizes=\"(max-width: 436px) 100vw, 436px\" /></figure></div>\n\n\n\n<p>It has been a good while since we&#8217;ve done a reader case study here on MMM, but that hasn&#8217;t stopped them from arriving in my inbox. And since 2022 is becoming a year of interesting financial changes, it&#8217;s time to spark things up again, go back to our roots, and start covering some of the many subjects that are cropping up in this latest incarnation of our economic world. </p>\n\n\n\n<p>Today&#8217;s case study deals with family wealth, rapidly rising house prices, and a desire to be generous. What would <em>you </em>do in the following situation?</p>\n\n\n\n<div class=\"mmm-box\"><strong><em>Dear MMM,</em></strong></p>\n\n\n\n<p><em>As long-time readers, we have seen quite a few <a href=\"https://www.mrmoneymustache.com/category/case-studies/\" target=\"_blank\" rel=\"noreferrer noopener\"><span style=\"text-decoration: underline;\">case studies</span></a> written up here, but never one addressing the rather common issue of <strong>helping out family members.</strong></em></p>\n\n\n\n<p><em>I am a retired, married Navy veteran living in beautiful (but expensive) San Diego. While we are no great example of financial success, we do own a nice home, have a reasonably sized investment portfolio and receive a solid pension income. We are also fortunate to have our grown kids (and grandkids) living nearby. Which also brings up the problem/question:</em></p>\n\n\n\n<p><em>Our eldest son is married with two very young children. He and his spouse both work in demanding careers that can sometimes lead to 12-hour days, which means that paid childcare is part of the equation, on top of the child care we are able to contribute as grandparents.</em></p>\n\n\n\n<p><em>They were living in a very small condo and wanted to upgrade with the arrival of the second child. With house prices in this area skyrocketing, this was an impossibility for them. That&#8217;s where we came in.</em></p>\n\n\n\n<p><em>&nbsp;My spouse and I offered to co-sign a mortgage and contribute a portion of the mortgage payment  ($500 per month) until they can manage on their own. Fortunately, that small condo had almost doubled in value such that there would be equity to help with the purchase. So far, so good.</em></p>\n\n\n\n<p><em>What we didn&#8217;t know was:&nbsp;</em></p>\n\n\n\n<p>1. <em>They had taken out a line of credit and spent a good portion of the home equity over these past few years.</em></p>\n\n\n\n<p>2.<em> Instead of transferring their equity from house one to house two, they were planning to spend the rest of it on renovations to the new house. Which means their new place will be almost 100% borrowed money, leaving them vulnerable or even underwater if we see another housing market correction.</em></p>\n\n\n\n<p><em>Here is the main problem: their lifestyle is pretty much an exact opposite of the MMM way. They consume restaurant food, on average, 7 days a week. They spend thousands per month on daycare. They buy new stuff almost every day for the adults and children alike. I could go on, but in short, for the last few years they have probably been spending even more than they make.</em></p>\n\n\n\n<p><em>I have tried to speak with them about financial planning, but they really do not want unsolicited advice &#8211; particularly from their parents. I should also mention that they are very intelligent, kind and wonderful people.</em></p>\n\n\n\n<p><em>So, are we crazy to try and help? Thoughts?</em></p>\n\n\n\n<p><em><strong>Concerned Captain&nbsp;</strong></em></p>\n\n\n\n<p></div>\n\n\n\n<p>.</p>\n\n\n\n<p><strong>Dear CC,</strong></p>\n\n\n\n<p>First of all I hear you! I can imagine your situation perfectly and I can see how frustrating that would feel.</p>\n\n\n\n<p>&nbsp;If it’s any consolation at all, you are in very good company because a similar story plays out across the world thousands of times every day. In fact, it’s so common that there are several age-old pieces of wisdom which address it:</p>\n\n\n\n<div class=\"mmm-box\"></p>\n\n\n\n<p class=\"has-text-align-center\"><em>&#8220;<strong>Never Lend Money To A Friend (or Family Member)</strong>&#8220;</em></p>\n\n\n\n<p class=\"has-text-align-center\"><em>&#8220;<strong>If you do lend money to someone, think of it in your mind as a gift and kiss that money goodbye in advance.</strong>&#8221; You can still structure it as a loan and encourage repayment, but this way you won’t throw away the relationship along with the money in the event it doesn’t happen.</em></p>\n\n\n\n<p class=\"has-text-align-center\"><em>&#8220;<strong>Did you ever notice how banks will only lend you money after they carefully verify that you don’t really need it?</strong>&#8220;</em></p>\n\n\n\n<p></div>\n\n\n\n<p>.</p>\n\n\n\n<p>With all that in mind, let’s dig into your situation a bit more.</p>\n\n\n\n<p>First of all, as Mr. Money Mustache I may need to set aside my own opinions because they won’t help in this situation. But just to get them out of my system:</p>\n\n\n\n<p class=\"has-text-align-center\"><strong><em>&#8220;WHAT?!? I can’t believe these people are buying anything other than potatoes, let alone doing $100,000 of renovations and living like multimillionaires in a situation where they are in multiple layers of debt and getting help from retired parents to pay the monthly bills!?</em></strong></p>\n\n\n\n<p class=\"has-text-align-center\">and</p>\n\n\n\n<p class=\"has-text-align-center\"><strong><em>AAAUUUUGGGHH!!! With all due respect CC, why did you get into this arrangement in the first place? Adult children don’t need money from their parents except maybe in the case of severe medical emergencies!!!&#8221;</em></strong></p>\n\n\n\n<p>Okay, whew. That’s just me, and it’s one of many reasons I don’t even <em>talk </em>about money with friends and family members unless I know they already have the same philosophy as I do: that <span style=\"text-decoration: underline;\"><a rel=\"noreferrer noopener\" href=\"https://www.mrmoneymustache.com/2012/04/18/news-flash-your-debt-is-an-emergency/\" target=\"_blank\">debt is an emergency</a></span>, and thus you don’t spend money until you’ve actually got it. </p>\n\n\n\n<p>On top of that, I&#8217;m a big fan of the idea of <strong>preparing for parenthood</strong> in advance, if you are young enough to have this luxury. In other words, do the 12-hour days and buckling down and hardcore saving in your 20s as a <span style=\"text-decoration: underline;\"><a rel=\"noreferrer noopener\" href=\"https://www.mrmoneymustache.com/2014/11/11/are-you-giving-the-shaft-to-your-future-self/\" target=\"_blank\">gift to your future self</a></span>. That way, when you start a family around 30, both parents can afford to work part-time and share the burden of the real hard<strong> </strong>work: babies.</p>\n\n\n\n<p>With all that off my chest, now for some more practical ideas:</p>\n\n\n\n<p>In reality, your situation is not the end of the world, because everybody is going to be just fine in the long run, and family relationships are <em>much </em>more important than a few dollars here and there. On top of that, you’ve made this gesture from a position of love and generosity, which is the best reason to do anything.</p>\n\n\n\n<p>What it really sounds like is that the two sides have a difference of expectations. You expected a certain level of military-inspired discipline and efficiency, while your son’s family &#8211; perhaps feeling stressed and overloaded by kids and work already &#8211; is trying to make life bearable and fun. And for many people, making purchases is a way to try to get that feeling.</p>\n\n\n\n<p>So this difference of opinion creates tension between the Saver and the Spender. The Spender feels the judgment of the Saver, even if it is not spoken aloud.&nbsp;</p>\n\n\n\n<p>And because of this, they will often try to hide their spending, or justify it based on life’s hardships, or emphasize their frugality &#8211; <em>“look I got these baby clothes on Craigslist!”</em> &#8211; whenever they <em>do </em>score a good deal on something.</p>\n\n\n\n<p>The tricky part of this situation is that as the Saver, you have little to no control over the situation. You generally can’t guilt or shame the Spender into submission &#8211; he or she will just fight back. Any change generally has to come from their side, but it’s also entirely possible that it will never come at all, and that is something we Savers need to learn to live with. Or in some cases, <em>live without</em> if you choose to separate your financial lives.</p>\n\n\n\n<p>What both sides <em>can </em>do is simply share your feelings in the least threatening way possible. For example:</p>\n\n\n\n<div class=\"mmm-box\"></p>\n\n\n\n<p><em><strong>Parents:</strong> “We are proud of your work and happy that we had the chance to support you. But to be honest, I am a bit concerned that you didn’t tell us about this line of credit until after we bought the new house. </em></p>\n\n\n\n<p><em>Were you afraid that we would judge you and perhaps not help with the deal if we had found out?”</em></p>\n\n\n\n<p><em><strong>Son:</strong> “Yeah, we feel stressed too &#8211; I know that I have disappointed you with this support arrangement, but I am stuck between two immovable objects here &#8211; my parents, and my spouse and the wants of my family I am raising. Perhaps we could come to some sort of agreement or compromise?”</em></p>\n\n\n\n<p><em><strong>Parents:</strong> “Yeah, that’s a good idea. I want all of your family to know we love and support you, which is why we came up with this idea in the first place. Maybe we could agree that the this financial life support will <strong>continue for two years</strong> while you get up on your feet in the new house, and then you’ll be on your own. Then, after that period (February 2024), we can end the support payments. And you will have the goal of refinancing the mortgage so that we are no longer co-signers in it</em>?</p>\n\n\n\n<p><em>For our part, we will learn not to judge your lifestyle and spending or compare it to ours, and I hope this will show in the form of less tension between us.</em>&#8220;</p>\n\n\n\n<p><em><strong>Son: </strong>“Yeah, that works for our family, if you and Mom can handle it!”</em></p>\n\n\n\n<p></div>\n\n\n\n<p>&#8212;</p>\n\n\n\n<p>As long as everyone is an adult in this situation, I think it might give you the best outcome because you are focusing on trust, responsibility and some concrete financial targets (an eventual end of the support and a refinancing), which you can both live with.</p>\n\n\n\n<p><strong>A chance to get ahead</strong></p>\n\n\n\n<p>On top of this, the great news is that it sounds like there is plenty of room for improvement in your son’s lifestyle. Cutting out restaurants and home food deliveries <em>alone </em>can make a difference of $1000 per month in some food budgets, and other discretionary things can add hundreds or thousands more. In other words, if they choose to read and implement a few things from, say, the <span style=\"text-decoration: underline;\"><a href=\"https://mrmoneymustache.ck.page/68f9e9826c\" target=\"_blank\" rel=\"noreferrer noopener\">MMM Boot Camp series</a></span>, they can end up with <em>much more money</em> even after cutting out the support money from Mom and Dad.</p>\n\n\n\n<p><strong>A Cautionary Tale for Everyone Else</strong></p>\n\n\n\n<p>Situations like this happen to almost everyone: you get into a business or financial arrangement with someone, and it turns out you have vastly different expectations. </p>\n\n\n\n<p>And people like me are bound to have the worst surprises: as a natural “optimizer” of everything including money, I tend to notice waste a lot more than other people. </p>\n\n\n\n<p>Leaving the window open on a winter day or a car idling on the street for half an hour are completely normal for some people, but to me they would feel like <strong><em>!!!</em></strong><em><strong>BEES JAMMED UNDER MY EYELIDS!!!</strong></em> &#8211; it would be hard to even concentrate on anything else before I sprinted over to shut the damn window and turn off the damned car.</p>\n\n\n\n<p>So if you are an optimizer, you need to work around this situation. Either <em>don’t get into a relationship </em>with someone on the opposite end of the scale in the first place, or <em>learn to chill</em> &#8211; which might be an even better outcome because chilling out is the ultimate life skill for people like us to learn.</p>\n\n\n\n<p><strong>License to Chill &#8211; What’s the Worst Case Scenario?</strong></p>\n\n\n\n<p>One thing that has worked for me is to set aside the buzzing bees of emotion and replace them with some cool, calm numbers. I’m often surprised at how things aren’t as bad as they feel. A few examples:</p>\n\n\n\n<p>The open window feels like an emergency, but in reality <em>how bad is it exactly?</em> My calculations indicate that leaving a medium-sized window open for several hours is only about as expensive as choosing to drink one of the beers in your own fridge*.</p>\n\n\n\n<p>I used to feel great frustration and rage whenever I saw a car left idling (sometimes even empty!) So I did the math on that too**. And as it turns out, even <em>a full hour</em> of your dumbass neighbor unnecessarily idling his car is only as bad as dumping one beer out onto the driveway. Sure, it’s a&nbsp; big dumb waste, but it’s not worth digging out the sledgehammer.</p>\n\n\n\n<p>And back to CC’s situation: sure, you are subsidizing a lifestyle that is less efficient than your own. But $500 per month is still only $6000 per year, or 12 grand if you continue it for two more years.&nbsp;</p>\n\n\n\n<p>I’m guessing that $12,000 over two years is not a catastrophic sum to you, and even if we stretch this example out for a decade, $60,000 <em>sounds </em>like a lot of money, but it’s probably only the amount that each your own house and your retirement stock portfolio will increase in value <em>in a single year </em>in the current market conditions.</p>\n\n\n\n<p>So the worst case scenario is still not all that bad. Which means it’s not a huge emergency, which means that while the whole family does need to talk things out and come to an agreement, it can all be done from a position of strength and the emotions really don’t need to run all that high.</p>\n\n\n\n<p>So, good luck Captain, and please let us know how it all turns out!</p>\n\n\n\n<p><em><strong>In the comments:</strong> do you have any similar situations in your own family? How have you been dealing with them? Do you have any advice for the Concerned Captain or would you do things differently?</em></p>\n\n\n\n<p>&#8212;</p>\n\n\n\n<p><em>*<strong>Open window vs beer calculation:</strong> Leaving a window open in winter will <a rel=\"noreferrer noopener\" href=\"https://www.energystar.gov/campaign/seal_insulate/why_seal_and_insulate\" target=\"_blank\">roughly double</a> your home’s energy loss for that period it is left open. Since heating a house in a cold climate costs about $4 per day, the open window is actually only wasting about <strong>17 cents per hour </strong>of heat! You could leave that sucker open for six hours and you still have only wasted the same amount of money as choosing to drink one of the beers in your fridge.</em></p>\n\n\n\n<p><em><strong>**Idling car vs beer calculation:</strong> If left idling, a mid-sized gasoline car burns about 0.3 gallons of fuel per hour, which is about $1.20 at today’s prices. Electric cars do much better still, keeping you warm (or cool) and entertained for only about 10-20 cents per hour, mostly for the climate control.</em></p>\n\n\n\n<p><em><strong>** Update: many people asked, &#8220;but it&#8217;s not just money, what about the  environmental effect of idling cars?&#8221; </strong>&#8211; the answer is that a gallon is a gallon, whether you burn it standing still or driving on the interstate. At highway speed, a car burns about 2.5 GPH &#8211; 8 times more than idling. In other words, choosing to drive less is FAR more important than choosing not to idle.</em></p>\n\n\n\n<p><em> Although idling a car engine near a <strong>school </strong>is an especially dick move, because you are concentrating the toxic fumes right in the lungs of the children. And it&#8217;s enough to measure directly with any cheap air quality metering device. So don&#8217;t do it. </em></p>\n",
  "wfw:commentRss": "https://www.mrmoneymustache.com/2022/01/27/case-study-adult-children/feed/",
  "slash:comments": 210,
  "post-id": 18037
}