{
  "title": "TU116: Fight Flight Freeze … and “Fawn”?? Can People-Pleasing Be a Sign of Trauma?",
  "link": "https://therapistuncensored.com/episodes/tu116-fight-flight-freeze-and-fawn-can-people-pleasing-be-a-sign-of-trauma/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu116-fight-flight-freeze-and-fawn-can-people-pleasing-be-a-sign-of-trauma",
  "pubDate": "Thu, 27 Feb 2020 14:00:00 +0000",
  "guid": "http://6f43ec2c-e9d8-4d2e-9d79-bb62d251f79c",
  "description": "Freeze Appease Dissociate... Appease is Fawning when it comes to C-PTSD\n\nAre you a huge people-pleaser, conflict avoider, peace-keeper? Maybe you are just being nice, but if you are compelled to do it, driven to not take up much space, to not impose... and you don&#039;t have much of a choice about it, there may be something deeper going on. If so, today&#039;s episode talks to you, friend.\nIf you haven’t joined us in the 30-Day Challenge, you can start at any time by CLICKING HERE! No sales, no gimmicks, just 4 supportive email over a month to support you in changing an emotional health habit that no longer works for you.\nShout out to all those on the 30-day Challenge! You&#039;ve been getting a series of emails.... this show discusses a topic that will help MANY of you with your personal emotional growth challenge.\nFawning\nThis is actually an old term coined by Peter Walker in 2003 discussing Complex Post-Traumatic Stress Disorder (C-PTSD)\n\nFawn types seek safety by merging with the wishes, needs and demands of others. They act as if they unconsciously believe that the price of admission to any relationship is the forfeiture of all their needs, rights, preferences and boundaries. - Peter Walker on his website.\n\nYou may be familiar with fight flight and freeze - the 3 common threat responses that our autonomic nervous system unconsciously engages when it perceives danger. If not, there is a TON of information about this in many previous episodes of Therapist Uncensored. We are interested because it affects how we relate to others and makes us act really stupid at times. :) Well, it&#039;s smart from an old survival perspective but can be really bone-headed in our adult lives when the reaction is triggered and yet the threat doesn&#039;t warrant such survival response.\n\nWell, when we can&#039;t escape the trauma and thus fighting or fleeing isn&#039;t an option, our bodies will freeze, appease or dissociate. The appease portion of the response is what Walker refers to as \"Fawn.\" It is another survival response which is often associated with complex post-traumatic stress disorder. It occurs when survivors recognize danger signals and stay safe by complying and minimizing confrontation.\nFreeze, Appease or Dissociate - Fawning refers to Appease. \n\n \tPeople-pleasing\n \tBeing unable to say how you really think or feel\n \tCaring for others to your own detriment\n \tAlways saying “yes” to requests\n \tFlattering others\n \tStruggling with low self-esteem\n \tAvoiding conflict\n \tFeeling taken advantage of\n \tBeing very concerned about fitting in with others\n\nComplex Post-Traumatic Stress Disorder C-PTSD\nWho doesn’t love special offers? Discounted course – It’s Not Me It’s My Amygdala! Advanced Course Connecting the Science(s) of the Mind to Interpersonal Relationships\n\nOur advanced course on attachment and relational neuroscience has been recently released and is now available (wahoo)! Since you are now deep into these shownotes, then you are one of us, use the code OURCLAN for an immediate discount for the course.\nWhile this course is popular with clinicians (CE’s available!), it is also for all who are interested in deepening security in yourselves and your relationship!. 4 hours of curated content!\nCLICK HERE FOR MORE INFORMATION\nDive in and get more involved – join us on Patreon! \nJoin our exclusive community of Therapist Uncensored Neuronerds for as little as $5 a month!\n\nIncrease your access, join a kick-ass like-minded community, get discounts on our courses and get exclusive content.\n\nHelp us create a ripple of security by supporting us in freely sharing the science of relationships around the globe!\nNEURONERDS UNITE! Click here to sign up.\nBOOK of the MONTH \nMaybe You Should Talk to Someone– A Therapist, HER Therapist and a Life Revealed, by Lori Gottlieb.\n\nIf you are looking for something to inspire you – make you laugh – tear up a bit and generally move towards being a better human this is the book we are recommending this mo...",
  "enclosure": "",
  "itunes:subtitle": "Freeze Appease Dissociate... Appease is Fawning when it comes to C-PTSD - Are you a huge people-pleaser, conflict avoider, peace-keeper? Maybe you are just being nice, but if you are compelled to do it, driven to not take up much space,",
  "itunes:summary": "Are you a huge people-pleaser, conflict avoider, peace-keeper? Maybe you are just being nice, but if you are compelled to do it, driven, don&apos;t have much of a choice about it, there may be something deeper going on.  If so, today&apos;s episode talks to you, friend.  Freeze Appease Dissociate... Appease is Fawning in Complex Post-Traumatic Stress Disorder (C-PTSD)",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW, CGP",
  "itunes:image": "",
  "itunes:duration": "29:26"
}