{
  "title": "#433: Gettin' Figgy (OOTP Chapter 1, Dudley Demented)",
  "link": "https://audioboom.com/posts/7363181",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4616,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Sequoia from <a href=\"https://www.fanaticalfics.com/\">Fanatical Fics and Where To Find Them</a> joins the show!</li>\n<li>We discuss the recent banning of Harry Potter at St. Edward Catholic School... and give them a call!</li>\n<li>Cursed Child gets a new marketing campaign, with the logo now matching the one from the books/films</li>\n<li>Chapter-by-Chapter returns with Harry Potter and the Order of the Phoenix, Chapter 1: Dudley Demented</li>\n<li>7-Word Summary: Harry Potter fights with Dudley and Dementors</li>\n<li>The introduction of Harry is very much one of a neglected child</li>\n<li>What does it say about the Dursleys that they take pride in the fact that Dudley doesn’t watch the news and has no clue who the Prime Minister is?</li>\n<li>What do we make of Ms. Figg  asking Harry over for tea frequently throughout the summer?</li>\n<li>Are Vernon and Petunia overreacting to the “crack” that pretty much the entire neighborhood hears? Or is it fair they suspect Harry?</li>\n<li>Harry's isolation: let the conversation about Dumbledore’s approach to Harry begin!</li>\n<li>We analyze Harry's dreams: Cedric's death, long corridors, locked doors and more!</li>\n<li>Harry is itching for a fight and tries to provoke Dudley with name-calling. What do we make of this version of Harry?</li>\n<li>Who is Mark Evans? J.K. Rowling <a href=\"http://web.archive.org/web/20110720082643/http://www.jkrowling.com:80/textonly/en/faq_view.cfm?id=49\">once addressed rampant speculation</a>.</li>\n<li>When the Dementors attack and Harry hears the voice inside his head - is it Voldemort or the Horcrux speaking to him?</li>\n<li>Have we ever seen Harry control a Patronus through spoken word before?</li>\n<li>Surprise! There's more to Ms. Figg than meets the eye!</li>\n<li>We debut a new chapter-by-chapter segment... Umbridge Sucks!</li>\n<li>Connecting the Threads, MVP of the Week and Rename The Chapter return!</li>\n<li>We answer an email on frame narratives and take a very cute voicemail on midnight book release parties</li>\n<li>Quizzitch: J.K. Rowling once said on her old website that Ms. Figg deals in the roaring trade of cross-bred cats and what?</li>\n<li>Micah and Eric will be at LeakyCon 2019 from October 11-13 in Boston <a href=\"http://www.leakycon.com/muggle\">register today</a> using code MUGGLE for $10 off!</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Become a member of our community</a> today on Patreon and receive awesome, magical benefits!</li>\n<li>This week’s episode is brought to you by ThirdLove: Visit <a href=\"http://www.thirdlove.com/MuggleCast\">ThirdLove.com/MuggleCast</a> for 15% off your first order!</li>\n</ul>\n",
  "pubDate": "Mon, 09 Sep 2019 15:19:06 +0000",
  "guid": "tag:audioboom.com,2019-09-09:/posts/7363181",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}