{
  "id": "https://bibleinoneyear.org/en/youth/296",
  "title": "Day 296: Twenty-Five Ways to Be Useful to God",
  "description": "Proverbs 25:21-28, Jeremiah 50:4, 2 Timothy 2:1–24. 21) starts with dedicating your life to him and re-dedicating it regularly to his service St Paul encourages us, ‘Become the kind of container God can use to present any and every kind of gift to his guests for their blessing’ (2 Timothy 2:20–21, MSG)",
  "pubDate": "Sun, 23 Oct 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/296/",
  "itunes:duration": "14:51",
  "guid": "enyouth23102022-296",
  "length": 891.98,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 296: Twenty-Five Ways to Be Useful to God",
  "itunes:subtitle": "Proverbs 25:21-28, Jeremiah 50:4, 2 Timothy 2:1–24. 21) starts with dedicating your life to him and re-dedicating it regularly to his service St Paul encourages us, ‘Become the kind of container God can use to present any and every kind of gift to his guests for their blessing’ (2 Timothy 2:20–21, MSG)",
  "itunes:summary": "Queen Elizabeth II declared on her twenty-first birthday broadcast, ‘My whole life, whether it be long or short, shall be devoted to your service…’\nAs the Archbishop of Canterbury, Justin Welby, said in his address at her funeral on 19 September 2022, ‘Rarely has such a promise been so well kept... Her example was not set through her position or her ambition, but through whom she followed. In silent prayer… her allegiance to God was given before any person gave allegiance to her. Her service to so many people in this nation, the Commonwealth and the world, had its foundation in her following Christ.’\nIn the seventy years of her reign, Queen Elizabeth has set an example of a leader who dedicated her life to the service of Christ and of others.\nAs John Stott wrote: ‘No higher honour could be imagined than to be an instrument in the hand of Jesus Christ, to be at his disposal for the furtherance of his purposes, to be available whenever wanted for his service.’\nBeing ‘useful to the Master’ and ‘instruments for noble purposes’ (v.21) starts with dedicating your life to him and re-dedicating it regularly to his service.\nSt Paul encourages us, ‘Become the kind of container God can use to present any and every kind of gift to his guests for their blessing’ (2 Timothy 2:20–21, MSG).\nHow can you be useful to God?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 661
}