{
  "title": "Oracle Analysis of Representations for Deep Open Set Detection. (arXiv:2209.11350v2 [cs.CV] UPDATED)",
  "link": "http://arxiv.org/abs/2209.11350",
  "description": "<p>The problem of detecting a novel class at run time is known as Open Set\nDetection &amp; is important for various real-world applications like medical\napplication, autonomous driving, etc. Open Set Detection within context of deep\nlearning involves solving two problems: (i) Must map the input images into a\nlatent representation that contains enough information to detect the outliers,\nand (ii) Must learn an anomaly scoring function that can extract this\ninformation from the latent representation to identify the anomalies. Research\nin deep anomaly detection methods has progressed slowly. One reason may be that\nmost papers simultaneously introduce new representation learning techniques and\nnew anomaly scoring approaches. The goal of this work is to improve this\nmethodology by providing ways of separately measuring the effectiveness of the\nrepresentation learning and anomaly scoring. This work makes two methodological\ncontributions. The first is to introduce the notion of Oracle anomaly detection\nfor quantifying the information available in a learned latent representation.\nThe second is to introduce Oracle representation learning, which produces a\nrepresentation that is guaranteed to be sufficient for accurate anomaly\ndetection. These two techniques help researchers to separate the quality of the\nlearned representation from the performance of the anomaly scoring mechanism so\nthat they can debug and improve their systems. The methods also provide an\nupper limit on how much open category detection can be improved through better\nanomaly scoring mechanisms. The combination of the two oracles gives an upper\nlimit on the performance that any open category detection method could achieve.\nThis work introduces these two oracle techniques and demonstrates their utility\nby applying them to several leading open category detection methods.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Garrepalli_R/0/1/0/all/0/1\">Risheek Garrepalli</a>"
}