{
  "title": "Insight Summer Session 2020 Update",
  "link": "https://blog.insightdatascience.com/insight-summer-session-2020-update-999e20b5b2d0?source=rss----d02e65779d7b---4",
  "guid": "https://medium.com/p/999e20b5b2d0",
  "category": "insight-data-science",
  "dc:creator": "Insight",
  "pubDate": "Mon, 17 Aug 2020 16:09:08 GMT",
  "atom:updated": "2020-08-28T13:01:13.624Z",
  "content:encoded": "<p>Insight recently completed its first totally remote session. This summer, we hosted more than 350 Fellows from across 33 different U.S. states, Canada, and around the world. As they move on to the post-session experience and continue to interview with hiring companies, we thought we’d share a recap of their first 7-weeks with Insight.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/602/1*4b_VA4Qq-f4x5syqL6JYnw.png\" /></figure><h3>The Remote Experience</h3><p>While this was the first session for Insight in which all Fellows participated remotely, we’ve been offering a remote data science program since 2015. We’re happy to report that we successfully adapted what we’ve learned during that time to all 7 of our programs across all locations. While certain aspects of the remote experience looked a bit different than the on-site offering, <a href=\"https://blog.insightdatascience.com/insights-remote-fellows-program-f5d027f237d3\">many remained the same</a>, and there are also <a href=\"https://blog.insightdatascience.com/remote-fellow-superpowers-cb863c1c1ee0\">several benefits</a> to a remote program that a more restrictive in-person session simply can’t offer. Insight continues to provide Fellows with full support from our teams:</p><ul><li><strong>Program Directors</strong> work directly with Fellows to provide expert mentorship, advising on project selection, development, and demoing with hiring companies.</li><li><strong>Program Operations Team</strong> provides expertise for managing the crucial program operations (communications, planning, logistics, tracking, etc.) necessary to ensure the success of each Fellow.</li><li><strong>Coaching & Development Team</strong> provides high-quality training, coaching, and feedback via workshops and small group sessions, helping Fellows identify the best roles at this stage of their careers and build the self-awareness and confidence to communicate their unique value-add.</li><li><strong>Interview Strategy Team</strong> is fully dedicated to the post-session experience, providing support and mentorship services through dedicated training and coaching groups in service of helping Fellows build the bridge to thriving careers.</li><li><strong>Partnerships Team </strong>works directly with hiring companies to understand their specific needs and secure exciting opportunities for our Fellows across all programs and locations.</li></ul><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/690/1*ZG-PX_TxPDLv-5EbE2dTJg.png\" /><figcaption>Kim Vo (Coaching & Development Lead, Interview Strategy Team) and Emily Kearney (Program Director, Data Science) during the fall session, September 2019.</figcaption></figure><p>Fellows benefit from the same small cohort sizes that the in-person Fellowship offered. None of our program cohorts have grown beyond 30, with the average being about 20 Fellows. Technical advisor and alumni mentoring meetings provide opportunities for even smaller groups to gain feedback and advice, and personalized interview preparation is conducted on a one-on-one basis, tailored to relevant skills required for that company, and based on the existing skills of the individual Fellow.</p><p>Fellows now also enjoy the technical advantages of using industry-standard distributed tools such as presentations via Zoom, internal messaging platforms (like Slack), and Github to contribute to a shared codebase. The remote session enabled Fellows’ increased flexibility and a more expansive reach. This summer, Fellows reported that they enjoyed the ease of meeting with other Fellows and Insight staff members every day without the wasted time of having to commute. Participating remotely also meant that Fellows were better able to set their own work times, instead of the more strict 9:00am — 6:00pm that is required during the in-person session. The remote experience made it much easier to connect and work with Fellows from other locations, and expanded access to Industry Leader Mentor presentations that are generally restricted to Fellows located in the city where the mentor visit is hosted.</p><h3>Industry Leader Mentor Sessions</h3><p>An exciting aspect of Insight’s Fellows Programs is the opportunity to participate in Industry Leader Mentoring Sessions, in which some of the tech industry’s top professionals visit with Fellows to speak about their experiences, share perspectives, and answer questions.</p><h3></h3><p>hey @jakeklamka, thank you for having me last week for an AMA with your @InsightFellows cohort! pic.twitter.com/6QEL8WW1yH</p><p>During the summer session, Insight was proud to host an impressive lineup of industry leaders, which included:</p><p><a href=\"https://alexisohanian.com/\"><strong>Alexis Ohanian</strong></a><strong>, </strong>the co-founder and managing partner of Initialized Capital. He was the co-founder, and later Executive Chairman, of Reddit. Ohanian is also the best selling author of <em>Without Their Permission</em>.</p><p><a href=\"https://norvig.com/\"><strong>Peter Norvig</strong></a><strong>, </strong>a<strong> </strong>Director of Research at Google. He was previously head of Google’s core search algorithms group, and of NASA Ames’s Computational Sciences Division, making him NASA’s senior computer scientist. Norvig is co-author of <em>Artificial Intelligence: A Modern Approach</em>.</p><p><a href=\"https://www.linkedin.com/in/dpatil/\"><strong>DJ Patil</strong></a><strong>, </strong>who served as the first Chief Data Scientist of the United States Office of Science and Technology Policy, and is currently the Head of Technology at Devoted Health. Patil is credited with coining the term “data science”.</p><p><a href=\"https://hilarymason.com/\"><strong>Hilary Mason</strong></a><strong>, </strong>the co-founder of Hidden Door, founder of Fast Forward Labs, a machine intelligence research company, and the Data Scientist in Residence at Accel. Mason was previously the Chief Scientist at bitly and co-founder of hackNY.</p><p><a href=\"https://www.linkedin.com/in/solomonhykes/\"><strong>Solomon Hykes</strong></a><strong>, </strong>the Founder, Chief Technology Officer and Chief Architect of Docker and the creator of the Docker open source initiative. In his role at Docker, Solomon is focused on building a platform for developers and system administrators to build, ship, run and orchestrate distributed applications.</p><p><a href=\"http://drewconway.com/\"><strong>Drew Conway</strong></a><strong>, </strong>the Senior Vice President at Two Sigma. He was previously the founder and CEO of Alluvium, and is a leading expert in the application of computational methods to social and behavioral problems at large-scale.</p><p><a href=\"https://www.linkedin.com/in/wiggins/\"><strong>Chris Wiggins</strong></a><strong>, </strong>the Chief Data Scientist at The New York Times, and an associate professor of applied mathematics at Columbia University. At Columbia, Wiggins is a founding member of the executive committee of the Data Science Institute, and of the Department of Systems Biology. He is also a co-founder and co-organizer of hackNY.</p><p><a href=\"https://www.linkedin.com/in/ahbauer/\"><strong>Anne Bauer</strong></a><strong>, </strong>the Director of Data Science at The New York Times, leading the team in charge of algorithmic content recommendations. Bauer is also an alum of the 2015 Insight Data Science Fellowship Program.</p><p><a href=\"https://wesmckinney.com/\"><strong>Wes McKinney</strong></a><strong>, </strong>an open source software developer focusing on data analysis tools. He created the Python pandas project and is a co-creator of Apache Arrow. McKinney is currently a director at Ursa Labs, a member of The Apache Software Foundation, and a PMC member for Apache Parquet.</p><h3>Diversity, Equity, and Inclusion Summit</h3><p>This session, Insight hosted a Diversity, Equity, and Inclusion (DEI) Summit, with the goal of facilitating discussions to share insights, challenge perspectives, pose stimulating questions and build community with each other so that Fellows are better able to enact positive change in their new roles. This event brought together Insight Fellows, staff, and thought leaders from our community to discuss a range of social issues that impact how we work together, and society at-large.</p><p>Lightning talks from Insight staff, an alumni panel, and a keynote speaker were utilized to spark conversation for discussing important — and sometimes difficult — topics that we don’t often have the chance to talk about candidly in our day-to-day work; topics that nevertheless tie into how we experience the workplace and interact with each other.</p><p>The event Included:</p><p><strong>Lightning Talks</strong> with Insight Program Directors, who discussed a toolkit for recognizing and addressing your unconscious bias, and reflecting on anti-Black violence.</p><p><strong>Alumni Panel</strong> with Insight alumni Melecia Wright & Che Smith, who discussed the role of companies and technology in building a more equitable and socially just future.</p><p><strong>Keynote Speaker</strong> <a href=\"https://www.brandeismarshall.com/\">Brandeis Marshall</a> presented, Deepfake Technology: The (Mis-) Representation of Data. In this session, Dr. Marshall described deepfake technology and discussed issues related to ethics, privacy, and accountability for companies who use “black box” algorithms to make decisions and the respective societal impacts.</p><iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FNbedWhzx1rs%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DNbedWhzx1rs&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FNbedWhzx1rs%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" width=\"854\" height=\"480\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/4b102d85b0c521351e09d68537aefb73/href\">https://medium.com/media/4b102d85b0c521351e09d68537aefb73/href</a></iframe><p>As Fellows prepare to enter the job market and join a professional community, we want to help them think critically about how they can contribute to creating more diverse, equitable, and inclusive work environments. Below are a few reactions that Fellows shared about the event:</p><ul><li>“Thank you to every person for exposing your vulnerability to such a large group. It really helped me to engage with the conversation because I felt safe there.”</li><li>“…I have attended many diversity training workshops in my schools and my previous job. However, this was the best and most genuine of them all. I can see all the effort put in it. Thank you!”</li><li>“I am so grateful to Insight for letting us pause for a moment and think about our mission and responsibilities to make this world a better place through science, tech, education, communication, and reaching out to the congress to hear our voices. And most of all, I found a group of inspiring women during our discussion time through Insight platform.”</li></ul><h3>Fellow Spotlights</h3><p>We have been working with so many incredibly talented Fellows this summer, and spotlighted a few to reflect their wide range of backgrounds, special skills, and experience.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/647/1*nVoNZYd0xvCLyJFRnvwlbw.png\" /><figcaption>Top row (left to right): Jayakrishnan Parappalliyali, Paige Chang, Cameron Jones; Middle row (left to right): Karen Larson, Javed, Jaghai, Saba Khalid; bottom row (left to right): Justin Kaseman, Doaa Altarawy, Sarah Uludag</figcaption></figure><p><a href=\"https://www.linkedin.com/in/parappalliyalil/\"><strong>Jayakrishnan Parappalliyali</strong></a>, DevOps Fellow from San Francisco. At Insight, he built an autonomous stateful application in a cost-efficient cloud infrastructure.</p><p><a href=\"https://www.linkedin.com/in/p-chang/\"><strong>Paige Chang</strong></a>, Artificial Intelligence Fellow from NYC. During the session, she applied a cutting-edge approach (reinforcement learning) to a classic data problem (song recommendation), all deployed using AWS and Tensorflow.</p><p><a href=\"https://www.linkedin.com/in/camantis/\"><strong>Cameron Jones</strong></a>, Data Science Fellow in San Francisco. Cameron built an app for streaming positive, relevant news for Black audiences by scraping and processing articles through Natural Language Processing (Google’s BERT model).</p><p><a href=\"https://www.linkedin.com/in/saba-khalid/\"><strong>Saba Khalid</strong></a>, Data Engineering Fellow from New York City. For her project, Saba built an efficient data pipeline to ETL Federal Elections Committee (FEC) data to map changing trends in individual campaign contributions.</p><p><a href=\"https://www.linkedin.com/in/karenruthlarson/\"><strong>Karen Larson</strong></a>, Health Data Science Fellow from Boston. Karen has been consulting for University Hospitals, building a tool to help doctors avoid ordering unnecessary lymph node biopsies for melanoma patients.</p><p><a href=\"https://www.linkedin.com/in/javed-jaghai/\"><strong>Javed Jaghai</strong></a><strong>,</strong> Data Science Fellow based in Washington D.C. Javed leveraged a deep learning RNN model to build the world’s first two-way translator between English and Jamaican Creole.</p><p><a href=\"https://www.linkedin.com/in/justin-kaseman/\"><strong>Justin Kaseman</strong></a>, Decentralized Consensus Fellow based in the Bay Area. At Insight, Justin built a tool to easily bootstrap and deploy a decentralized application to help bring new developers into the space.</p><p><a href=\"https://www.linkedin.com/in/daltarawy/\"><strong>Doaa Altarawy</strong></a>, Data Science Fellow in Toronto. As a Fellow, Doaa applied her strong data and engineering skills to an incredibly timely project: screening chest x-rays for quick detection of COVID-19, using fastai’s deep neural net model.</p><p><a href=\"https://www.linkedin.com/in/sarah-u/\"><strong>Sarah Uludag</strong></a>, Data Engineering Fellow from Los Angeles. Sarah built a tool for finding and marking public keys used in Bitcoin transactions on the Dark Web using Apache Spark, Cassandra, and Neo4J.</p><h3>Post Session Experience</h3><p>The initial 7-week program of the Fellowship has come to an end, but Insight’s work with Fellows has only just begun. Fellows spent the session building projects and demoing their work, and are now engaged in interviewing with hiring companies. As of August 28, there are 356 opportunities from 238 companies, and that list continues to grow. This is a difficult time for the economy, but we’re happy to report that our current growth rate of hiring opportunities is on par with our summer session in 2019. Companies currently interviewing Fellows include Netflix, Amazon, Facebook, Google, Yelp, Apple, Pinterest, The New York Times, Johnson & Johnson, Humana, CVS, ProtonMail, Bolt Labs, and many more!</p><p>Insight’s Interview Strategy Team is currently working with our Fellows on an individual level to provide personalized interview preparation support and mentorship services. We’re investing in our Fellows to honor our <a href=\"https://insightfellows.com/guarantee\">guarantee</a> and ensure they’re hired quickly to launch exciting new careers in tech.</p><p><strong>The Insight Guarantee</strong></p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*K0phjQcsB6A1N4BTp0338A.png\" /></figure><h3>Looking ahead to our Fall 2020 Session</h3><p>Insight is currently selecting our next Fellow cohort for the fall session, and continuing to work to help reduce the barriers that keep potential Fellows from participating in Insight’s programs, taking those first steps to launch their thriving careers.</p><p><strong>Scholarships</strong></p><p>We’re expanding our current <a href=\"https://insightfellows.com/scholarships\">offering of scholarships</a> beyond our Need-based Scholarship, which has been available for several years to help fund essential day-to-day living needs related to the program. Starting this fall, we will now offer two additional scholarships:</p><ul><li><strong>Scholarship for Underrepresented Minority Groups</strong> — This fund has been established to help remove barriers for our Fellows from racial and ethnic backgrounds that are traditionally underrepresented in tech. Eligible Fellows will have the opportunity to complete a simple application process in order to be considered, and those selected will receive up to $3000.</li><li><strong>Gender Diversity in Tech Scholarship</strong> — Insight is proud to continue our partnership with Clover Health, who is sponsoring this scholarship fund to help remove barriers based on gender in the tech industry. Eligible Fellows who complete the application process will be considered for a $5000 scholarship.</li></ul><p><strong>Mentorship Opportunities</strong></p><p>This fall, Insight is also piloting a mentorship program for candidates who identify as one or more historically underrepresented groups in tech (American Indian, Black/African American, Hispanic, Latinx, or Native Hawaiian/Pacific Islander). The purpose of this mentoring program is to provide an opportunity for applicants to ask questions about the interview process, program, post-program experience, and workforce more broadly. Many applicants do not have existing connections to the Insight network that they can turn to for information that may be available to other applicants. As we learn from this pilot program, we’ll continue to improve upon the offering with the goal of providing a more inclusive experience for all.</p><p>Insight’s core value is to put Fellows first, and we are, first and foremost, committed to the long-term success of our Fellows. As we plan for the future, we’re excited to not only reach the same impressive <a href=\"https://insightfellows.com/outcomes\">outcomes</a>, but to exceed them. We’ll continue to set a high bar for what constitutes success within the program, and maintain the guarantee of a job in a relevant field, earning at least a $100,000 salary within 6 months of the end of the program. In addition to our guarantee, we’re committed to improving upon and expanding our accessibility to an even broader audience.</p><p><strong><em>Are you ready to make a change & transition to a career in tech? </em></strong><a href=\"https://notify.insightdatascience.com/notify?utm_source=20brecap&utm_medium=blog\"><em>Sign up</em></a><em> to learn more about </em><a href=\"https://insightfellows.com/?utm_source=20brecap&utm_medium=blog\"><em>Insight Fellows programs</em></a><em> and </em><a href=\"https://apply.insightdatascience.com/?utm_source=20brecap&utm_medium=blog\"><em>start your application today</em></a><em>.</em></p><p><em>This post was revised on August 28, 2020 to update the number of company opportunities.</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=999e20b5b2d0\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://blog.insightdatascience.com/insight-summer-session-2020-update-999e20b5b2d0\">Insight Summer Session 2020 Update</a> was originally published in <a href=\"https://blog.insightdatascience.com\">Insight</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
}