{
  "title": "Surviving the trauma of war in Ukraine, with Laura Murray, PhD",
  "itunes:title": "Surviving the trauma of war in Ukraine, with Laura Murray, PhD",
  "pubDate": "Wed, 13 Apr 2022 10:30:00 +0000",
  "guid": "d46f527e-372c-426d-a8ae-cbc0fe858bbc",
  "link": "http://sopapa.libsyn.com/the-trauma-of-war-in-ukraine-with-laura-murray-phd",
  "itunes:image": "",
  "description": "<p>Since Russia invaded Ukraine in late February, more than 4 million Ukrainians have had to flee the country as refugees, more than 6 million others have been internally displaced, and tens of millions more have lived through shelling and other traumas. Laura Murray, PhD, of the Johns Hopkins University School of Public Health, talks about mental health care during war and other disasters, what providers in Ukraine are experiencing on the ground, and what we know about the mental health effects of living through war.<br /> <br /> Links:<br /> <br /> <a href= \"https://publichealth.jhu.edu/faculty/2085/laura-k-murray\">Laura Murray, PhD</a><br /> <a href= \"https://www.apa.org/news/podcasts/speaking-of-psychology\">Speaking of Psychology Homepage</a></p> <p>Sponsor:<br /> <br /> <a href=\"https://www.newporthealthcare.com\">Newport Healthcare</a></p>",
  "content:encoded": "<p>Since Russia invaded Ukraine in late February, more than 4 million Ukrainians have had to flee the country as refugees, more than 6 million others have been internally displaced, and tens of millions more have lived through shelling and other traumas. Laura Murray, PhD, of the Johns Hopkins University School of Public Health, talks about mental health care during war and other disasters, what providers in Ukraine are experiencing on the ground, and what we know about the mental health effects of living through war.  Links:  <a href= \"https://publichealth.jhu.edu/faculty/2085/laura-k-murray\">Laura Murray, PhD</a> <a href= \"https://www.apa.org/news/podcasts/speaking-of-psychology\">Speaking of Psychology Homepage</a></p> <p>Sponsor:  <a href=\"https://www.newporthealthcare.com\">Newport Healthcare</a></p>",
  "enclosure": "",
  "itunes:duration": "36:07",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Since Russia invaded Ukraine in late February, more than 4 million Ukrainians have had to flee the country as refugees, more than 6 million others have been internally displaced, and tens of millions more have lived through shelling and other traumas....",
  "itunes:episode": 186,
  "itunes:episodeType": "full",
  "itunes:author": "American Psychological Association"
}