{
  "title": "Sustainable Weather Balloon Wins Student a $10,000 Scholarship",
  "link": "https://spectrum.ieee.org/2022-ieee-presidents-scholarship-recipients",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/four-females-and-one-male-holding-certificates-are-pictured-in-front-of-a-banner-that-says-isef.jpg?id=30155006&width=1200&height=800&coordinates=0%2C0%2C0%2C0\"/><br/><br/><p>Every day thousands of weather balloons are released all over the world, using radiosondes to measure pressure, relative humidity, and temperature. The balloons aren’t environmentally friendly, though, in part because they’re made out of nonrecyclable materials such as latex. Also, there’s a lot of waste.</p><p>After a few hours in the air, a weather balloon bursts and its radiosonde falls to the ground via a parachute. Out of the 75,000 radiosondes launched every year in the United States, only 20 percent are found and returned, according to the <a href=\"https://www.weather.gov/bmx/kidscorner_weatherballoons#:~:text=About%2020%25%20of%20the%2075%2C000,of%20data%20above%20the%20ground\" rel=\"noopener noreferrer\" target=\"_blank\">National Weather Service</a>. The cost of replacing them adds up. </p><hr/><p>Amon Schumann, a senior at the <a href=\"https://www.robert-havemann-gymnasium.de/\" rel=\"noopener noreferrer\" target=\"_blank\">Robert-Havemann-Gymnasium</a> school, in Berlin, has invented eco-friendly, cost-effective solutions.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"A young man holding a device called a radiosonde\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"90b7fd0ff78d3965413f226539feef5e\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"863e5\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-young-man-holding-a-device-called-a-radiosonde.jpg?id=30155174&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Amon Schumann’s radiosonde for weather balloons is equipped with a solar-powered battery and GPS.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Lynn Bowlby</small></p><p>Schumann built a coin-size, solar-powered radiosonde that weighs 4.8 grams—far more compact than current models, which weigh about 96 g. The weather balloon he designed can stay in the air longer than traditional models as well. </p><p>His <a href=\"https://projectboard.world/isef/finalist-booth/etsd005---small-radiosondes-on-a-great-mission\" rel=\"noopener noreferrer\" target=\"_blank\">Small Radiosondes on a Great Mission</a> project was showcased in May at the <a href=\"https://www.societyforscience.org/isef/\" rel=\"noopener noreferrer\" target=\"_blank\">Regeneron International Science and Engineering Fair</a> held in Atlanta.</p><p>At a special awards ceremony, Schumann was caught by surprise when it was announced that his project received the <a href=\"https://www.ieee.org/education/preuniversity/scholarship.html\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Presidents’ Scholarship</a>. The award was established by the <a href=\"https://www.ieeefoundation.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Foundation</a> to acknowledge a deserving student for a project that demonstrates an understanding of electrical or electronics engineering, computer science, or other IEEE field of interest. The scholarship is administered on behalf of <a href=\"https://www.ieee.org/education/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Educational Activities</a> and is payable over four years of undergraduate university study. Schumann also received a complimentary IEEE student membership. <a href=\"https://susankathyland.com/\" target=\"_blank\">Susan K. “Kathy” Land</a>, the 2021 IEEE president, presented Schumann with this year’s scholarship.</p><p class=\"pull-quote\">“In comparison to launching 2,000 to 5,000 balloons that stay up for just two to three hours, my balloon can stay up in the air for 52 days.” </p><p>Schumann was motivated to improve radiosondes and weather balloons during a visit to a local meteorology museum. There he learned that radiosondes have not significantly changed in the past 100 years.</p><p><strong>Environmentally Friendly</strong></p><p>Because of the increase in air pressure at high altitudes, weather balloons burst at around 35 kilometers. To address the problem, Schumann used layers of foil welded together, plus a heated Teflon wheel, to create a balloon that is able to withstand higher altitudes.</p><p>“In comparison to launching 2,000 to 5,000 balloons that stay up for just two to three hours, my balloon can stay up in the air for 52 days, so fewer balloons have to be launched,” he says. </p><p>His radiosonde provides several times more measurement data per day compared with traditional ones launched every two weeks. The radiosondes are equipped with a solar-powered battery, which is about 20 grams lighter than a lithium battery.</p><p>Schumann also developed an extension module with a camera to record additional data such as cloud formation.</p><p>“The camera can take aerial images of the clouds,” he says, “which allows for a more accurate view of their formation and connections in comparison to a traditional radar system.” </p><p>He added GPS to track his radiosonde in real time. The radiosonde’s location is uploaded to his <a href=\"https://do4as.github.io/\" rel=\"noopener noreferrer\" target=\"_blank\">balloon flight tracker</a>, which he hopes will be of use to those needing weather data.</p><p>The software he designed allows for the radio weather data packets to be transmitted in real time from his radiosonde to an analysis unit in his home. The data is then sent to the <a href=\"https://www.weather.gov/cle/CWOP\" rel=\"noopener noreferrer\" target=\"_blank\">Citizen Weather Observer Program</a>, a volunteer-based network. From there it’s forwarded to the <a href=\"https://www.noaa.gov/\" rel=\"noopener noreferrer\" target=\"_blank\">National Oceanic and Atmospheric Administration</a> for possible use in general weather forecasting.</p><p>Schumann says he plans to study electrical engineering at a technical university in Berlin.</p><p><strong>Brain-Computer Interface</strong></p><p>This year’s second-place recipient was Navya Ramakrishnan, a senior at<a href=\"https://www.pisd.edu/pshs\" rel=\"noopener noreferrer\" target=\"_blank\"> Plano Senior High School</a>, in Texas. Her <a href=\"https://projectboard.world/isef/finalist-booth/soft016---bci-based-home-automation-system\" rel=\"noopener noreferrer\" target=\"_blank\">interface</a> uses brain signals to complete household tasks such as turning on a television. </p><p>Ramakrishnan’s brain-computer interface was designed for people with paralysis and neuromuscular disorders including amyotrophic lateral sclerosis. She says her inspiration came from the machine Steven Hawking built that used his eye movements to communicate.</p><p>“That was definitely the starting point, when I thought about a way to have a universal communication-aid machine for ALS patients,” Ramakrishnan says. Instead of using eye movements, she used brain waves measured by an EEG headset to gauge activity.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"A female student wearing a lanyard identifying her as a finalist at ISEF.\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"71a2aa8f8dc8c13d2d1bde612376f193\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"c034a\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-female-student-wearing-a-lanyard-identifying-her-as-a-finalist-at-isef.jpg?id=30155203&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Second-place recipient Navya Ramakrishnan designed a brain-computer interface to help those with paralysis and neuromuscular disorders do household tasks such as turning on a television. </small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Lynn Bowlby</small></p><p>She discovered that a spike in the EEG data, a P300 signal, occurs in reaction to an event. Using a computer monitor, she created a visual display of commonly used home-automation command phrases. The BCI system is connected with the home’s circuit, which controls lights, appliances, and more. The command is performed via wireless transmission to the part of the circuit in control of that task.<br/></p><p>When users see their desired command flash on the monitor, they count in their head until it stops—which triggers a reaction and creates a P300 signal. The BCI system pinpoints which command lit up at the time the signal occurred. </p><p>“Let’s say the user wants to turn on a light. Every time that ‘Light on’ command flashes on the screen I ask them to count in their head,” she explains. “The counting will generate that ‘Oh, there’s the <em>light on</em> command,’ reaction, and it will generate that spike in the EEG data. </p><p>“Essentially what my system does,” she says, “is ask, ‘Where did those P300 signals occur?’ Because where they occur means the user just reacted to the command that flashed on the screen.”</p><p>Ramakrishnan said she will be attending <a href=\"https://www.harvard.edu/\" target=\"_blank\">Harvard </a>this year to pursue a degree in computer science with a concentration in mind, brain, and behavior. </p><p><strong>Detecting Leukemia</strong></p><p>Adelle Jia Xin Yong, a junior at <a href=\"https://whs.eanesisd.net/\" target=\"_blank\">Westlake High School</a> in Austin, Texas, was awarded third place for her <a href=\"https://projectboard.world/isef/finalist-booth/enbm023---smart-leukemia-labs\" rel=\"noopener noreferrer\" target=\"_blank\">Smart Leukemia Labs</a> project. Her portable microscope and diagnostic tool accurately and quickly detects acute lymphoblastic leukemia.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"A female student holding a black portable microscope and diagnostic tool.\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"d2a66b88b00c595353c9453906a5ff21\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"fe205\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-female-student-holding-a-black-portable-microscope-and-diagnostic-tool.jpg?id=30155240&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Adelle Jia Xin Yong was awarded third place for her portable microscope and diagnostic tool that accurately and quickly detects acute lymphoblastic leukemia from a drop of blood.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Lynn Bowlby</small></p><p>The invention is compatible with smartphones. An attachment magnifies a drop of blood on a 0.5-millimeter glass slide up to 1,000 times. An app that uses object detection, image recognition, and semantic segmentation identifies abnormal blood cells to diagnose leukemia.</p><p>Yong says her invention combines her passion for helping the community and improving access to health care.</p><p>“In seventh grade I had a friend who unfortunately had leukemia,” she says. “As I saw her go through the treatments, I wondered how people who didn’t have access to the technology she had were able to obtain treatments or even a diagnosis.” </p><p>Yong’s diagnostic tool is targeted at those living in underserved regions. It costs about US $28 to make and uses low-cost materials, most of which can be found around the home, such as a metal pin and a tiny plastic tube. </p><p>When Yong heard her name called at the fair, she was shocked, she says.</p><p>“ISEF is a really big thing,” she says. “I was happy with my invention, but I didn’t know I would win something. I am just absolutely thrilled.” </p><p>Yong’s father introduced her to engineering. In 2020 she taught herself how to code by watching <a href=\"https://www.youtube.com/\" rel=\"noopener noreferrer\" target=\"_blank\">YouTube</a> videos.</p><p>She founded GStar, a club at her high school that is focused on empowering women in science, technology, engineering, and math fields.</p><p>She says she hopes to attend medical school and become a doctor. Her goal is to turn her patented prototype into a viable product with the help of manufacturers and labs.</p>",
  "pubDate": "Tue, 19 Jul 2022 18:00:00 +0000",
  "guid": "https://spectrum.ieee.org/2022-ieee-presidents-scholarship-recipients",
  "category": [
    "Ieee news",
    "Stem",
    "Ieee presidents’ scholarship",
    "Ieee educational activities",
    "Ieee foundation",
    "Education",
    "Students",
    "Weather balloon",
    "Brain computer interface",
    "Bci diagnostic tool",
    "Type:ti"
  ],
  "dc:creator": "Amanda Weissman",
  "media:content": ""
}