{
  "title": "Ultrafast Racetrack Memory Enters the Third Dimension",
  "link": "https://spectrum.ieee.org/racetrack-memory",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/an-artist-s-depiction-of-a-3d-racetrack-memory-device.jpg?id=31879936&width=2000&height=1500&coordinates=0%2C0%2C0%2C0\"/><br/><br/><p>Racetrack memory could hold vast amounts of data that can be accessed extraordinarily quickly. Now, in a new study, scientists reveal 3D racetrack memory devices that may greatly increase the potential of this technology.</p><p><a href=\"https://spectrum.ieee.org/making-memory-with-light\" target=\"_self\">Racetrack memory</a> encodes bits of data in the form of <a href=\"https://spectrum.ieee.org/domain-wall\" target=\"_blank\">magnetic domain walls</a>. These walls divide a material into <u><a href=\"https://spectrum.ieee.org/antiferromagnets-ram\" target=\"_self\">domains</a>,</u> inside which magnetic poles all point in the same direction. Electric pulses can push these domain walls back and forth within nanowires, making them run like race cars down a track. Magnetic sensors and other electronics can then read and write data on any point on this racetrack.</p><p><a href=\"https://spectrum.ieee.org/swirly-skyrmions-could-be-the-future-of-data-storage\" target=\"_self\">Racetrack memory</a> potentially “has unrivaled density compared to other memory technologies,” says <a href=\"https://en.wikipedia.org/wiki/Stuart_Parkin\" target=\"_blank\">Stuart Parkin</a>, director of the <a href=\"https://www.mpi-halle.mpg.de/home\" target=\"_blank\">Max Planck Institute of Microstructure Physics</a> in Halle, Germany, and <a href=\"https://www.ibm.com/ibm/history/ibm100/us/en/icons/racetrack/\" rel=\"noopener noreferrer\" target=\"_blank\">who developed the concept while at IBM</a>. Racetrack memory is solid-state like flash memory, lacking unwieldy moving parts, and is nonvolatile, storing data even after the power is removed.</p><p>In addition, racetrack memory’s electric pulses can move domain walls at speeds of up to <a href=\"https://www.nature.com/articles/s41467-021-25292-1\" rel=\"noopener noreferrer\" target=\"_blank\">kilometers per second</a>. This suggests devices using <a href=\"https://spectrum.ieee.org/ferroelectric-domain-wall-memory-shows-its-promise\" target=\"_blank\">this kind of memory</a> can perform exceptionally quickly.</p><p>“Memories that operate at speeds of less than 1 nanosecond per write operation are possible,” Parkin says. “This is as fast or faster than the fastest write speeds of any commercially available memory today.”</p><p>Most research on <a href=\"https://spectrum.ieee.org/singing-to-data-gets-it-to-move\" target=\"_self\">racetrack memory</a> to date has focused on 2D devices. However, Parkin had long suggested it could be a 3D technology, with arrays of vertical racetracks much like a city filled with skyscrapers. An extra dimension added to racetrack memory would greatly increase the amount of data it could hold on a given footprint. But assembling such complex 3D structures, given the standard fabrication techniques used by the microelectronics industry, has proven difficult.</p><p>Now Parkin and his colleagues have developed a 3D racetrack memory device using a new method that lets them drape a 2D racetrack onto a 3D surface. They detailed <u><a href=\"https://www.nature.com/articles/s41565-022-01213-1\" rel=\"noopener noreferrer\" target=\"_blank\">their findings</a></u> online 22 September in the journal <em>Nature Nanotechnology</em>.</p><p>The scientists fabricated a complex ultrathin film made of layers of tantalum nitride, cobalt, nickel, platinum, ruthenium, and magnesium oxide onto a water-soluble layer of strontium aluminate. They then immersed the film in water, releasing a freestanding magnetic film.</p><p>The researchers next transferred this magnetic film onto a sapphire surface engineered with speed-bump-like 3D ridges, a bit like one might drape a drop cloth over furniture while painting a room. Standard photolithography techniques then let them create racetracks made of wires—each 3 micrometers wide—with arching segments rising up to 900 nanometers high, following the shape of the sapphire surface.</p><p>“The 3D racetrack structure prepared and handled in this way survived intact, and behaves almost identically to the originally deposited structure before it was detached,” Parkin says.</p><p>In experiments, domain walls in the 3D racetracks traveled at speeds of up to 600 meters per second. “We believe that the speed can be increased by more than 10 times in related structures using novel materials,” Parkin says.</p><p>The scientists are exploring “many different ways of building 3D racetrack memories,” Parkin adds. “There are many interesting challenges that are still to be explored, which makes research into racetrack memory very exciting.”</p>",
  "pubDate": "Sun, 09 Oct 2022 14:00:00 +0000",
  "guid": "https://spectrum.ieee.org/racetrack-memory",
  "category": [
    "Nanowires",
    "Spintronics",
    "Domain wall",
    "Memory",
    "Antiferromagnetism",
    "Racetrack memory"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}