{
  "title": "Bringing hope to a refugee family, using Google Translate",
  "link": "https://blog.google/products/translate/refugee-family-translate/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>In 2015, I joined Google to be a part of a company using technology to help others. I’m proud that Google’s commitment to its mission—to organize the world’s information and make it universally accessible and useful—remains <a href=\"https://www.blog.google/inside-google/company-announcements/marking-20ish-years-google/\">strong</a> 20 years in. I knew I wanted to be a part of it all, but had no idea that I would experience the power of our mission firsthand, and that it would help me to forge a friendship when I least expected it.</p><p>For the past three years, my wife and I have been working with organizations involved with refugee resettlement efforts. We both have immigrant parents, so we’ve heard stories about resettling in a country to make a better life for your children, but being forced to leave a country is very different. These refugees are often fleeing from life threatening situations. Aside from dealing with their past trauma and being in an unfamiliar place without a support system, they often can’t speak the local language.</p><p>My wife and I learned of a family of four—Nour, Mariam, three-year old Sanah and six-month-old Yousuf—who settled in Rialto, 45 minutes from where my wife and I grew up in Southern California. Through the assistance of organizations such as <a href=\"https://www.heartsofmercy.org/\">Hearts of Mercy</a> and <a href=\"https://miryslist.org/\">Miry’s List</a>, they settled into an apartment shortly before giving birth to Yousuf. Still recovering from injuries sustained in Syria, Nour was unable to work, and had to rely on the help of others to get by. Without a car, their options were further limited. Then, in April of this year, they faced their hardest challenge yet: their daughter Sanah was diagnosed with Stage 4 <a href=\"https://www.cancer.org/cancer/neuroblastoma/about/what-is-neuroblastoma.html\">Neuroblastoma</a>.</p><p>We wanted to help, but didn’t know where to start—and as new parents ourselves, we could relate on a personal level. We fundraised for the family and collected toys for Yousuf and Sanah in hopes that they could feel supported. Moreso, we wanted to help them get through Sanah’s treatments with as little to worry about as possible.</p><p>A few weeks after we first heard of their story, we went to their home to meet in person. Nour was waiting outside for us, and we quickly realized there was a challenge that we had overlooked: the family only spoke Arabic. There I was, face to face with Nour, wanting to hear his story and reassure him that he’s surrounded by a supportive community, but couldn't convey those thoughts or give Nour the ability to convey his. The only option I could think of was Google Translate, which I had used in previous international trips, and hoped would bridge this gap.</p><p>I opened the app to translate a few words, but we couldn’t get far by manually typing sentences. Instead, I tried \"conversation\" mode, which allows for real-time audio translations and makes the interaction feel more natural. We talked about his family’s story and what they were up against. I learned that back in Syria, Nour was shot twice in the back, and endured the deaths of his brothers. Now, Nour and Mariam are giving up everything to take care of Sanah and spend up to two hours commuting on a bus to and from her hospital treatments. Through all of this, they continue to be optimistic and hopeful, and are grateful for being able to make it to America.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image__is-caption h-c-grid__col-l--6 h-c-grid__col--8 h-c-grid__col-l--offset-3 h-c-grid__col--offset-2\"><a class=\"article-image--link\"><img alt=\"image (2).png\" class=\"article-image--large\" data-loading='{\n                \"mobile\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/image_2_4AMNXMU.max-500x500.png\",\n                \"desktop\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/image_2_4AMNXMU.max-1000x1000.png\"\n              }' loading=\"lazy\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/images/image_2_4AMNXMU.max-100x100.png \" tabindex=\"0\"/></a></div><figcaption class=\"article-image__caption article-image__is-caption-image h-c-grid__col--8 h-c-grid__col--offset-2 h-c-grid__col-l--6 h-c-grid__col-l--offset-3\"><div class=\"rich-text\"><p>A snapshot of my visit with Nour.</p></div></figcaption></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p>I never imagined that we could sustain a 90-minute conversation in two languages, and that it would bring us closer together, inspiring me in a way I didn’t expect. Without Translate, we would have exchanged a few pleasantries, shared poorly communicated words and parted ways. Instead, we walked away with a bond built on an understanding of one another—we were just two fathers, talking about our fears and hopes for our family’s future. To this day, we stay connected on how the family is doing, and I’m looking forward to keeping this relationship going for a long time.</p><p>Refugee families often find themselves in situations that may seem normal to you and me—like at the DMV trying to get a driver’s license—or worse, in a dire situation like a hospital, with no way of communicating. We generally think of technology as an enabler of change, driving efficiency or making the impossible happen. But in this case, technology allowed me to make a life-changing connection, and brought me closer to family who was very far away from home.</p></div></div></body></html>",
  "pubDate": "Thu, 20 Sep 2018 17:00:00 +0000",
  "guid": "https://blog.google/products/translate/refugee-family-translate/",
  "category": [
    "Translate",
    "Googlers"
  ],
  "og": {
    "type": "article",
    "title": "Bringing hope to a refugee family, using Google Translate",
    "description": "How one Googler used Google Translate to help a refugee family.",
    "site_name": "Google",
    "url": "https://blog.google/products/translate/refugee-family-translate/"
  },
  "author": {
    "name": "Abid Kapadya",
    "title": "Retail Innovation & Partnerships",
    "department": "",
    "company": ""
  }
}