{
  "title": "Episode 37: \"A Winter's Tale\" Act 4",
  "pubDate": "Tue, 18 Feb 2020 06:00:00 +0000",
  "guid": "a877950c-ee2c-4fa8-bc42-b6d01e07f9d3",
  "link": "https://theliterarylife.libsyn.com/episode-37-a-winters-tale-act-4",
  "itunes:image": "",
  "description": "<p>This week on The Literary Life, Angelina, Cindy and Thomas dive in to Act 4 of Shakespeare’s <em>A Winter’s Tale</em>. We are excited to announce a new online conference coming on March 13-14, 2020. Our theme will be <a href= \"https://houseofhumaneletters.com/eventss/\">Re-enchanting the World: The Legacy of the Inklings</a>. Our keynote speaker is Inklings scholar, Joseph Pearce. Go to Angelina and Thomas’ new website <a href= \"https://houseofhumaneletters.com/\">HouseofHumaneLetters.com</a> for all the info and to register.</p> <p>This act is jam packed with action and important plot points, but Cindy points out the connection between the shepherd and his son and the tale that Mamillius was telling Hermoine in an earlier act. Angelina brings up the juxtaposition of winter and spring in this play. She also talks about how Shakespeare departs from Aristotle’s “rules” for unity of time and place in playwriting. This act is all about redeeming what was lost, and it is also full of disguises. Thomas explains the connection between Perdita and Flora.</p> <p>Our hosts discuss the wedding customs of Shakespeare’s day as well as the festivities we see in this play. Thomas gives us a little overview of the myth of Persephone and how <em>A Winter’s Tale</em> alludes to this myth. Angelina also highlights the importance of the kiss in the fairy tale. Cindy encourages us to read and re-read because there is such depth in Shakespeare that we can never get to the bottom of it all. We are also invited to look for the mirrors of the characters and action in this act to things that happen in the first three acts. Angelina also instructs us on the two classic fairy tale story patterns and how <em>A Winter’s Tale</em> follows both of those patterns.</p> <h3>The Winter’s Tale Show Schedule:</h3> <ul> <li>February 25: Act V</li> <li>March: Live Q&A for Patreon Fellows</li> </ul> <h3>Commonplace Quotes:</h3> <blockquote class=\"wp-block-quote\"> <p><em>She Dwelt Among the Untrodden Ways</em></p> <p>She dwelt among the untrodden ways<br /> Beside the springs of Dove,<br /> A Maid whom there were none to praise<br /> And very few to love:<br /> <br /> A violet by a mossy stone<br /> Half hidden from the eye!<br /> —Fair as a star, when only one<br /> Is shining in the sky.<br /> <br /> She lived unknown, and few could know<br /> When Lucy ceased to be;<br /> But she is in her grave, and, oh,<br /> The difference to me!</p> <cite>William Wordsworth</cite></blockquote> <blockquote class=\"wp-block-quote\"> <p>In the 12th-century Church of San Clemente in Rome, the brilliant mosaic apse over the main altar presents us with a view of reality that is both Cosmic and Eucharistic. The central image is of the crucified Christ, mildly accepting his suffering and death, his face full of peace. But spiraling forth from the foot of the cross, where it is watered by the blood of Christ, a stupendous acanthus bush curls outward and upward, encircling nearly a hundred separate images. The spiraling branches of the acanthus embrace even two pagan Roman gods, Baby Jupiter, formerly king of the gods, and Baby Neptune, formerly king of the deep, who rides a slippery looking dolphin. Even the ancient pagans have been redeemed, and their mythologies are usable by us.</p> <cite>Thomas Cahill</cite></blockquote> <blockquote class=\"wp-block-quote\"> <p>Whatever happens will be for the worse, and therefore it is in our interest that as little should happen as possible.</p> <cite>Lord Salisbury</cite></blockquote> <h3>You Ask My Why, Tho’ Ill at Ease</h3> <p><em>by Alfred, Lord Tennyson</em></p> <p>You ask me, why, tho’ ill at ease,<br /> Within this region I subsist,<br /> Whose spirits falter in the mist,<br /> And languish for the purple seas.<br /> <br /> It is the land that freemen till,<br /> That sober-suited Freedom chose,<br /> The land, where girt with friends or foes<br /> A man may speak the thing he will;<br /> <br /> A land of settled government,<br /> A land of just and old renown,<br /> Where Freedom slowly broadens down<br /> From precedent to precedent:<br /> <br /> Where faction seldom gathers head,<br /> But by degrees to fullness wrought,<br /> The strength of some diffusive thought<br /> Hath time and space to work and spread.<br /> <br /> Should banded unions persecute<br /> Opinion, and induce a time<br /> When single thought is civil crime,<br /> And individual freedom mute;<br /> <br /> Tho’ Power should make from land to land<br /> The name of Britain trebly great—<br /> Tho’ every channel of the State<br /> Should fill and choke with golden sand—<br /> <br /> Yet waft me from the harbour-mouth,<br /> Wild wind! I seek a warmer sky,<br /> And I will see before I die<br /> The palms and temples of the South.</p> <h3>Book List:</h3> <p><em><a href=\"https://amzn.to/2OZjZ2l\">Mysteries of the Middle Ages</a></em> by Thomas Cahill</p> <p><em><a href=\"https://amzn.to/2uEpVXz\">Shakespeare After All</a></em> by Marjorie Garber</p> <p><em><a href=\"https://amzn.to/2OXnaaL\">Pandosto</a></em> by Robert Greene</p> <p> </p> <h3>Support The Literary Life:</h3> <p>Become a patron of The Literary Life podcast as part of the “Friends and Fellows Community” on <a href= \"https://www.patreon.com/theliterarylife/overview\">Patreon,</a> and get some amazing bonus content! Thanks for your support!</p> <h3>Connect with Us:</h3> <p>You can find Angelina and Thomas at <a href= \"https://houseofhumaneletters.com/\">HouseofHumaneLetters.com</a>, on Instagram <a href= \"https://www.instagram.com/angelinastanford/\">@angelinastanford</a>, and on Facebook at <a href= \"https://www.facebook.com/ANGStanford/\">https://www.facebook.com/ANGStanford/</a></p> <p>Find Cindy at <a href= \"https://cindyrollins.net\">https://cindyrollins.net</a>, on Instagram <a href= \"https://www.instagram.com/cindyordoamoris/\">@cindyordoamoris</a> and on Facebook at <a href= \"https://www.facebook.com/cindyrollins.net/\">https://www.facebook.com/cindyrollins.net/</a>. Check out <a href= \"https://www.patreon.com/cindyrollins?fbclid=IwAR3acx7P6FGt1Us_buk7cIzIaK31FxMaNlK53pKfV5vr8SYphKVywNIAqZ8\"> Cindy’s own Patreon page</a> also!</p> <p>Follow <a href= \"https://www.instagram.com/literarylifepodcast/\">The Literary Life</a> on Instagram, and jump into our private Facebook group, The Literary Life Discussion Group, and let’s get the book talk going! <a href= \"http://bit.ly/literarylifeFB\">http://bit.ly/literarylifeFB</a></p>",
  "content:encoded": "<p>This week on The Literary Life, Angelina, Cindy and Thomas dive in to Act 4 of Shakespeare’s <em>A Winter’s Tale</em>. We are excited to announce a new online conference coming on March 13-14, 2020. Our theme will be <a href= \"https://houseofhumaneletters.com/eventss/\">Re-enchanting the World: The Legacy of the Inklings</a>. Our keynote speaker is Inklings scholar, Joseph Pearce. Go to Angelina and Thomas’ new website <a href= \"https://houseofhumaneletters.com/\">HouseofHumaneLetters.com</a> for all the info and to register.</p> <p>This act is jam packed with action and important plot points, but Cindy points out the connection between the shepherd and his son and the tale that Mamillius was telling Hermoine in an earlier act. Angelina brings up the juxtaposition of winter and spring in this play. She also talks about how Shakespeare departs from Aristotle’s “rules” for unity of time and place in playwriting. This act is all about redeeming what was lost, and it is also full of disguises. Thomas explains the connection between Perdita and Flora.</p> <p>Our hosts discuss the wedding customs of Shakespeare’s day as well as the festivities we see in this play. Thomas gives us a little overview of the myth of Persephone and how <em>A Winter’s Tale</em> alludes to this myth. Angelina also highlights the importance of the kiss in the fairy tale. Cindy encourages us to read and re-read because there is such depth in Shakespeare that we can never get to the bottom of it all. We are also invited to look for the mirrors of the characters and action in this act to things that happen in the first three acts. Angelina also instructs us on the two classic fairy tale story patterns and how <em>A Winter’s Tale</em> follows both of those patterns.</p> The Winter’s Tale Show Schedule: <ul> <li>February 25: Act V</li> <li>March: Live Q&A for Patreon Fellows</li> </ul> Commonplace Quotes:  <p><em>She Dwelt Among the Untrodden Ways</em></p> <p>She dwelt among the untrodden ways Beside the springs of Dove, A Maid whom there were none to praise And very few to love:  A violet by a mossy stone Half hidden from the eye! —Fair as a star, when only one Is shining in the sky.  She lived unknown, and few could know When Lucy ceased to be; But she is in her grave, and, oh, The difference to me!</p> William Wordsworth  <p>In the 12th-century Church of San Clemente in Rome, the brilliant mosaic apse over the main altar presents us with a view of reality that is both Cosmic and Eucharistic. The central image is of the crucified Christ, mildly accepting his suffering and death, his face full of peace. But spiraling forth from the foot of the cross, where it is watered by the blood of Christ, a stupendous acanthus bush curls outward and upward, encircling nearly a hundred separate images. The spiraling branches of the acanthus embrace even two pagan Roman gods, Baby Jupiter, formerly king of the gods, and Baby Neptune, formerly king of the deep, who rides a slippery looking dolphin. Even the ancient pagans have been redeemed, and their mythologies are usable by us.</p> Thomas Cahill  <p>Whatever happens will be for the worse, and therefore it is in our interest that as little should happen as possible.</p> Lord Salisbury You Ask My Why, Tho’ Ill at Ease <p><em>by Alfred, Lord Tennyson</em></p> <p>You ask me, why, tho’ ill at ease, Within this region I subsist, Whose spirits falter in the mist, And languish for the purple seas.  It is the land that freemen till, That sober-suited Freedom chose, The land, where girt with friends or foes A man may speak the thing he will;  A land of settled government, A land of just and old renown, Where Freedom slowly broadens down From precedent to precedent:  Where faction seldom gathers head, But by degrees to fullness wrought, The strength of some diffusive thought Hath time and space to work and spread.  Should banded unions persecute Opinion, and induce a time When single thought is civil crime, And individual freedom mute;  Tho’ Power should make from land to land The name of Britain trebly great— Tho’ every channel of the State Should fill and choke with golden sand—  Yet waft me from the harbour-mouth, Wild wind! I seek a warmer sky, And I will see before I die The palms and temples of the South.</p> Book List: <p><em><a href=\"https://amzn.to/2OZjZ2l\">Mysteries of the Middle Ages</a></em> by Thomas Cahill</p> <p><em><a href=\"https://amzn.to/2uEpVXz\">Shakespeare After All</a></em> by Marjorie Garber</p> <p><em><a href=\"https://amzn.to/2OXnaaL\">Pandosto</a></em> by Robert Greene</p> <p> </p> Support The Literary Life: <p>Become a patron of The Literary Life podcast as part of the “Friends and Fellows Community” on <a href= \"https://www.patreon.com/theliterarylife/overview\">Patreon,</a> and get some amazing bonus content! Thanks for your support!</p> Connect with Us: <p>You can find Angelina and Thomas at <a href= \"https://houseofhumaneletters.com/\">HouseofHumaneLetters.com</a>, on Instagram <a href= \"https://www.instagram.com/angelinastanford/\">@angelinastanford</a>, and on Facebook at <a href= \"https://www.facebook.com/ANGStanford/\">https://www.facebook.com/ANGStanford/</a></p> <p>Find Cindy at <a href= \"https://cindyrollins.net\">https://cindyrollins.net</a>, on Instagram <a href= \"https://www.instagram.com/cindyordoamoris/\">@cindyordoamoris</a> and on Facebook at <a href= \"https://www.facebook.com/cindyrollins.net/\">https://www.facebook.com/cindyrollins.net/</a>. Check out <a href= \"https://www.patreon.com/cindyrollins?fbclid=IwAR3acx7P6FGt1Us_buk7cIzIaK31FxMaNlK53pKfV5vr8SYphKVywNIAqZ8\"> Cindy’s own Patreon page</a> also!</p> <p>Follow <a href= \"https://www.instagram.com/literarylifepodcast/\">The Literary Life</a> on Instagram, and jump into our private Facebook group, The Literary Life Discussion Group, and let’s get the book talk going! <a href= \"http://bit.ly/literarylifeFB\">http://bit.ly/literarylifeFB</a></p>",
  "enclosure": "",
  "itunes:duration": "01:16:31",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "This week on The Literary Life, Angelina, Cindy and Thomas dive in to Act 4 of Shakespeare’s A Winter’s Tale. We are excited to announce a new online conference coming on March 13-14, 2020. Our theme will be . Our keynote speaker is Inklings...",
  "itunes:season": 2,
  "itunes:episode": 37,
  "itunes:episodeType": "full",
  "itunes:author": "Angelina Stanford and Cindy Rollins"
}