{
  "id": "tag:blogger.com,1999:blog-582368152716771238.post-7899214761100277728",
  "published": "2022-10-10T09:18:00.006-05:00",
  "updated": "2022-10-10T09:18:58.198-05:00",
  "category": [
    "",
    ""
  ],
  "title": "Mind the store",
  "content": "<p>On the same page in today's WSJ:</p><p>One third of DC bus riders <a href=\"https://www.wsj.com/articles/the-d-c-bus-fare-is-a-polite-suggestion-evasion-budget-shortfall-enforcement-action-virginia-maryland-11665341012?mod=opinion_lead_pos4\" target=\"_blank\">don't bother to pay the fare</a>. Also in <a href=\"https://nypost.com/2022/05/22/mta-losing-119m-and-counting-to-fare-evasion-officials-say/\" target=\"_blank\">New York</a>.&nbsp;</p><p>The State Department is so dysfunctional that <a href=\"https://www.wsj.com/articles/the-other-immigration-crisis-endless-visa-waits-delays-embassies-consulates-processing-reform-canada-businesses-talent-11665338857?mod=opinion_lead_pos9\" target=\"_blank\">processing visa requests takes years</a>.&nbsp;</p><blockquote><p>In New Delhi, an appointment for a nonimmigrant visitor visa takes more than 800 calendar days, or nearly three years; for a student visa, nearly 450 days. The Cato Institute found that more than half of U.S. embassies and consulates world-wide have a waiting time greater than six months for a visitor or business visa appointment, compared with 1% before the pandemic. More than 1 in 4 have a waiting time of a year or more.</p></blockquote><blockquote><p>In March Congress enacted the EB-5 Reform and Integrity Act of 2022 to streamline the immigrant-visa process for foreign investors who commit significant capital to the U.S. But that reform is swamped by slow administration. U.S. Citizenship and Immigration Services advises applicants that 80% of cases (excluding Chinese nationals, who take even longer to process) are resolved within 52 months, or nearly 4½ years.</p></blockquote><p>A central part of the immigration problem is that asylum claims languish in courts for years. And regular criminal courts also take years. Either spend the money to administer the laws, or change the laws (immigration and visas in particular) to not require administration that we can't provide. &nbsp;</p><p>These are just two tips of the iceberg of general incompetence in many parts of our government. &nbsp;Not all: I've had some pleasant interactions with very well run low-level government offices lately. It can be done.&nbsp;</p><p>Wanted for the elections: politicians who will campaign simply to administer competently and remedy dysfunction. Efficient government offices, court systems, transit systems and so forth are also crucial infrastructure. Don't lead new grand causes, just mind the store.&nbsp;</p><p>&nbsp;</p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "John H. Cochrane",
    "uri": "http://www.blogger.com/profile/04842601651429471525",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 12
}