{
  "id": "yt:video:VSaLplPTS84",
  "yt:videoId": "VSaLplPTS84",
  "yt:channelId": "UC3WoPalcYf7d_x4DC2BXAfw",
  "title": "So I played AC Revelations in 2022...",
  "link": "",
  "author": {
    "name": "jayvee",
    "uri": "https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw"
  },
  "published": "2022-09-23T15:00:32+00:00",
  "updated": "2022-09-27T08:09:31+00:00",
  "media:group": {
    "media:title": "So I played AC Revelations in 2022...",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Download and play AFK Arena for free ► https://bit.ly/AFKArena_jayvee\nMeet Geralt and Yennefer in AFK Arena, and use bonus codes: thewitcher3 to get awesome rewards!\n\nMaster of the Feast by Kevin MacLeod is licensed under a Creative Commons Attribution 4.0 license. https://creativecommons.org/licenses/by/4.0/\n\nSource: http://incompetech.com/music/royalty-free/index.html?isrc=USUAN1400019\n\nArtist: http://incompetech.com/\n\nSubscribe to jayveeonYT for more videos!\n► ​https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw?sub_confirmation=1\n\nWatch more videos on jayveeonYT! \n► https://youtube.com/playlist?list=PLGdQpBjWmxqVuXKKNVcccm81dpDwsJPvH\n\n- - - - - - - - - - - - - - - -\n\nFollow jayveeonYT!\n► Twitter: https://twitter.com/jayveeonYT​\n► Discord: https://discord.gg/jayveeonyt\n► Instagram: https://www.instagram.com/jayvee.yt/​\n\nWatch More jayveeonYT!\nLatest Uploads:  \n\nSo I ranked ALL the AC games...\n► https://youtu.be/Z9_Tb_TcPYI\n\nSo I played AC Rogue in 2021...\n► https://youtu.be/LUmOm2whuvY\n\nSo I played AC Syndicate in 2021...\n► https://youtu.be/swJN5NO2gJ8\n\nSo I played AC Unity in 2021...\n► https://youtu.be/UjTt4KtAZO8\n\nSo I played AC Odyssey in 2021…\n► https://youtu.be/guMObmtv54s\n\n- - - - - - - - - - - - - - - -\n\nAbout jayveeonYT:\nNews, reactions, and gameplay of all the biggest RPGs, open world, and action-adventure video games! Jayvee covers Assassin's Creed, Cyberpunk, Fallout, and more!\n\n- - - - - - - - - - - - - - - -\n\nAssassin's Creed: Revelations is a 2011 action-adventure video game developed by Ubisoft Montreal and published by Ubisoft. It is the fourth major installment in the Assassin's Creed series, and a direct sequel to 2010's Assassin's Creed: Brotherhood, concluding the \"Ezio Trilogy\". The game was released on PlayStation 3, Xbox 360, and Microsoft Windows in November and December 2011. A remastered version of Revelations, along with Assassin's Creed II and Brotherhood, was released as part of The Ezio Collection for the PlayStation 4 and Xbox One on November 15, 2016, and for the Nintendo Switch on February 17, 2022.\n\nThe plot is set in a fictional history of real-world events and follows the millennia-old struggle between the Assassins, who fight to preserve peace and free will, and the Templars, who desire peace through control. The framing story is set in the 21st century and features the series protagonist Desmond Miles who, after falling into a coma during the events of Brotherhood, must relive the memories of his ancestors through the Animus device in order to awaken and find a way to avert the 2012 apocalypse. The main story spans the years 1511–1512, and follows an aged Ezio Auditore da Firenze (the protagonist of the trilogy) as he travels to Constantinople to find five keys needed to unlock a vault built three centuries ago by Altaïr Ibn-LaʼAhad (the protagonist of the first game in the series). While searching for the keys, Ezio becomes caught in a feud between the Ottomans and the Byzantines, and discovers that the Templars are also attempting to unlock Altaïr's vault and its secrets.\n\nRevelations features an open world and is played from the third-person perspective, with a primary focus on using Ezio's and Altaïr's combat, climbing and stealth abilities to eliminate targets and explore the environment. Ezio, who the player controls throughout the majority of the game, can freely explore Constantinople and complete side missions unrelated to the main storyline. Altaïr is playable in a smaller capacity, as he is featured only in a series of flashback missions set in Masyaf from 1189 to 1257. In the modern-day, the player controls Desmond in a series of first-person platforming levels within the Animus. The multiplayer mode returns from Assassin's Creed: Brotherhood, and has been expanded with additional maps, characters, and game modes.\n\nThe game was released with multiple editions, some of which featured exclusive limited-time content. Most notably, several editions included an animated short film, titled Assassin's Creed: Embers, which serves as a proper conclusion to Ezio's story, and which was later re-released as a free download on the PlayStation Store. Downloadable content (DLC) released for the game includes new maps and characters for the multiplayer mode, and a story expansion titled The Lost Archive, which adds more platforming levels to the modern-day.\n\nUpon release, Revelations received largely positive reviews, with praise directed at the world design and narrative, although some reviewers noted that the gameplay of the series was getting overly familiar and the newly introduced features felt lacking in comparison to the ones introduced in previous titles. The game was a large commercial success, outperforming the sales of its predecessors. It was followed in October 2012 by Assassin's Creed III, which introduces a new storyline and protagonist in the New World during the 18th century, while also concluding Desmond's story arc\n\n#gaming #assassinscreed #jayvee",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}