{
  "guid": "7126c952-735f-4bc7-be87-8afc56ecea86",
  "title": "The Cathedral in Time - 7th Day Rest E5",
  "description": "<p>QUOTE</p><p><i>\"The Sabbath is to time what the tabernacle and temple are to space: a cathedral in time. On the seventh day, we experience in time what the temple and tabernacle represented in spaces, which is eternal life with God in a complete creation.\"</i></p><p>KEY TAKEAWAYS</p><ul><li>The building of the tabernacle in Exodus 40 has deep connections with the theme of seventh-day rest and the creation account in Genesis.</li><li>The tabernacle is presented as a mini cosmos, brought into being by the seven acts of divine speech by God. When Moses builds this symbolic mini cosmos, seven times over he obeys the divine command.</li></ul><p>SHOW NOTES:</p><p>In part 1 (0-8:30), Tim and Jon recap their conversation so far. They go over the story of the Passover and review how it reflects the creation account in Genesis.</p><p>In part 2 (8:30-22:30), Tim transitions to the story of Israel collecting manna in the wilderness in Exodus 16.</p><p>Exodus 16:4-35</p><p><i>Then the Lord said to Moses, “Behold, I am about to rain bread from heaven for you, and the people shall go out and gather a day's portion every day, that I may test them, whether they will walk in my law or not. On the sixth day, when they prepare what they bring in, it will be twice as much as they gather daily.” So Moses and Aaron said to all the people of Israel, “At evening you shall know that it was the Lord who brought you out of the land of Egypt, and in the morning you shall see the glory of the Lord, because he has heard your grumbling against the Lord. For what are we, that you grumble against us?” And Moses said, “When the Lord gives you in the evening meat to eat and in the morning bread to the full, because the Lord has heard your grumbling that you grumble against him—what are we? Your grumbling is not against us but against the Lord.”</i></p><p><i>Then Moses said to Aaron, “Say to the whole congregation of the people of Israel, ‘Come near before the Lord, for he has heard your grumbling.’” And as soon as Aaron spoke to the whole congregation of the people of Israel, they looked toward the wilderness, and behold, the glory of the Lord appeared in the cloud. And the Lord said to Moses, “I have heard the grumbling of the people of Israel. Say to them, ‘At twilight you shall eat meat, and in the morning you shall be filled with bread. Then you shall know that I am the Lord your God.’”</i></p><p><i>In the evening quail came up and covered the camp, and in the morning dew lay around the camp. And when the dew had gone up, there was on the face of the wilderness a fine, flake-like thing, fine as frost on the ground. When the people of Israel saw it, they said to one another, “What is it? For they did not know what it was. And Moses said to them, “It is the bread that the Lord has given you to eat. This is what the Lord has commanded: ‘Gather of it, each one of you, as much as he can eat. You shall each take an omer, according to the number of the persons that each of you has in his tent.’” And the people of Israel did so. They gathered, some more, some less. But when they measured it with an omer, whoever gathered much had nothing left over, and whoever gathered little had no lack. Each of them gathered as much as he could eat. And Moses said to them, “Let no one leave any of it over till the morning.” But they did not listen to Moses. Some left part of it till the morning, and it bred worms and stank. And Moses was angry with them. Morning by morning they gathered it, each as much as he could eat; but when the sun grew hot, it melted.</i></p><p><i>On the sixth day they gathered twice as much bread, two omers each. And when all the leaders of the congregation came and told Moses, he said to them, “This is what the Lord has commanded: ‘Tomorrow is a day of solemn rest, a holy Sabbath to the Lord; bake what you will bake and boil what you will boil, and all that is left over lay aside to be kept till the morning.’” So they laid it aside till the morning, as Moses commanded them, and it did not stink, and there were no worms in it. Moses said, “Eat it today, for today is a Sabbath to the Lord; today you will not find it in the field. Six days you shall gather it, but on the seventh day, which is a Sabbath, there will be none.”</i></p><p><i>On the seventh day some of the people went out to gather, but they found none. And the Lord said to Moses, “How long will you refuse to keep my commandments and my laws? See! The Lord has given you the Sabbath; therefore on the sixth day he gives you bread for two days. Remain each of you in his place; let no one go out of his place on the seventh day.” So the people rested on the seventh day.</i></p><p><i>Now the house of Israel called its name manna. It was like coriander seed, white, and the taste of it was like wafers made with honey. Moses said, “This is what the Lord has commanded: ‘Let an omer of it be kept throughout your generations, so that they may see the bread with which I fed you in the wilderness, when I brought you out of the land of Egypt.’” And Moses said to Aaron, “Take a jar, and put an omer of manna in it, and place it before the Lord to be kept throughout your generations.” As the Lord commanded Moses, so Aaron placed it before the testimony to be kept. The people of Israel ate the manna forty years, till they came to a habitable land. They ate the manna till they came to the border of the land of Canaan.</i></p><p>Tim notes that manna was supposed to be a little taste of the new creation. Manna was a new work of creation that violated normal creation while also fitting within God’s ideal purpose for creation (i.e., within the seven-day scheme). Manna was a divine gift that came from proximity to the divine glory (Ex 16:9-10). This miraculous provision didn’t behave like normal food, and there was more than enough each day, no matter how much was gathered.</p><p>Tim also shares that the rhythms of gathering and not gathering on the Sabbath is an imitation of God’s own patterns of work and rest in Genesis 1. Similarly, God announced “good” days one through six and “very good” on day seven. This parallels with Israel collecting manna on days one through six and “double manna” on day seven. Furthermore, on the seventh day God “rested” (took up residence in his temple), and on the seventh day Israel “rests” and Moses “rested” a perpetual sample of manna “before Yahweh” and “before the testimony.”</p><p>Tim cites scholar Stephen Geller:</p><p>“... manna is presented as a new work of creation that disrupts the established order of creation. In fact, there is a clear parallelism between the creation account in Gen 1-2:4 and Exod 16. In both passages there is a dichotomy between the first six days and the seventh day. In Gen 1, the work of each day is stated by God to be \"good,\" a term that marks its completion. But on the sixth day the phrase \"very good\" marks the completion not just of the acts of creation on that day, but of the first six days as a whole. Genesis 2:1 states explicitly that \"the heaven and earth were completed.\" Yet, to the perplex­ity of exegesis, the very next verse says that \"God completed on the seventh day the work he did and ceased on the seventh day all work he did.\" The second of these two statements must be viewed as an explanation of the first: God completed his work by ceasing.”</p><p>(Stephen Geller, “Exodus 16: A Literary and Theological Reading,” Interpretation vol. (2005), p. 13.)</p><p>In part 3 (22:30-36:30), the guys dive into the actual Sabbath command as part of the Ten Commandments, which is given in seven Hebrew sentences. The Sabbath command in Exodus 20:8-11 is expressed in seven statements arranged in a chiastic symmetry. Tim says this is another fascinating layer of the theme of seventh-day rest in the Bible.</p><p>Exodus 20:8-11</p><p><i>A – Remember the sabbath day, to keep it holy.</i></p><p><i>B – Six days you will labor</i></p><p><i>C – and do all your work,</i></p><p><i>D – but the seventh day is a sabbath of the Lord your God;</i></p><p><i>C’ – you shall not do any work,</i></p><p><i>you or your son or your daughter, your male or your female servant,</i></p><p><i>or your cattle or your sojourner who stays with you.</i></p><p><i>B’ – For in six days the Lord made the heavens and the earth,</i></p><p><i>the sea and all that is in them, and rested on the seventh day;</i></p><p><i>A’ – therefore the Lord blessed the sabbath day and made it holy.</i></p><p>Tim cites scholar Leigh Trevaskis to make his point:</p><p>“The sabbatical rest seems to remind Israel of her covenant obligations as YHWH’s new creation. Though this rest is more immediately connected to the exodus in these chapters, it has its roots in the creation story (Gen 2:1-3; cf. Exod 20:11) and by connecting Israel’s remembrance of her redemption from Egypt with the sabbatical rest, the exodus becomes infused with further theological significance: just as Gods seventh day rest in the creation story marks the emergence of his new creation, so does Israel’s sabbatical rest attest to her emergence as YHWH’s new creation through his act of redemption. And since her identity as a new creation is tied up with the covenant (cf. Exod 15:1-19; 19:4-5), Israel’s sabbatical rests… presumably recall her obligation to remain faithful to this covenant, encouraging her to live according to the Creators will.” (Leigh Trevaskis, “The Purpose of Leviticus 24 within its Literary Context,” 298-299.)</p><p>Tim then walks through Exodus 24, which is the start of God giving the tabernacle instructions to Moses. This story is a crucial layer to understanding how the building of the tabernacle (the “tent of meeting”) weaves into the theme of seventh-day rest.</p><p>Exodus 24:1-11</p><p><i>Then he said to Moses, “Come up to the Lord, you and Aaron, Nadab, and Abihu, and seventy of the elders of Israel, and worship from afar. Moses alone shall come near to the Lord, but the others shall not come near, and the people shall not come up with him.”</i></p><p><i>Moses came and told the people all the words of the Lord and all the rules. And all the people answered with one voice and said, “All the words that the Lord has spoken we will do.” And Moses wrote down all the words of the Lord. He rose early in the morning and built an altar at the foot of the mountain, and twelve pillars, according to the twelve tribes of Israel. And he sent young men of the people of Israel, who offered burnt offerings and sacrificed peace offerings of oxen to the Lord. And Moses took half of the blood and put it in basins, and half of the blood he threw against the altar. Then he took the Book of the Covenant and read it in the hearing of the people. And they said, “All that the Lord has spoken we will do, and we will be obedient.” And Moses took the blood and threw it on the people and said, “Behold the blood of the covenant that the Lord has made with you in accordance with all these words.”</i></p><p><i>Then Moses and Aaron, Nadab, and Abihu, and seventy of the elders of Israel went up, and they saw the God of Israel. There was under his feet as it were a pavement of sapphire stone, like the very heaven for clearness. And he did not lay his hand on the chief men of the people of Israel; they beheld God, and ate and drank.</i></p><p>In part 4 (36:30-49:50), Tim continues the story in Exodus 24.</p><p>Exodus 24:12-18</p><p><i>The Lord said to Moses, “Come up to me on the mountain and wait there, that I may give you the tablets of stone, with the law and the commandment, which I have written for their instruction.” So Moses rose with his assistant Joshua, and Moses went up into the mountain of God. And he said to the elders, “Wait here for us until we return to you. And behold, Aaron and Hur are with you. Whoever has a dispute, let him go to them.” Then Moses went up on the mountain, and the cloud covered the mountain. The glory of the Lord dwelt on Mount Sinai, and the cloud covered it six days. And on the seventh day he called to Moses out of the midst of the cloud. Now the appearance of the glory of the Lord was like a devouring fire on the top of the mountain in the sight of the people of Israel. Moses entered the cloud and went up on the mountain. And Moses was on the mountain forty days and forty nights.</i></p><p>Tim notes that the theme of sixth and seventh day is now clearly established. God appears to Moses on the seventh day.</p><p>Here in Exodus 25-31, God presents Moses with the plans for the tabernacle. These plans are dispensed in seven speeches by God.</p><p>[1] <i>“And YHWH spoke to Moses, saying…”</i> [Exodus 25:1]</p><p>[2] <i>“And YHWH spoke to Moses, saying…”</i> [Exodus 30:11]</p><p>[3] <i>“And YHWH spoke to Moses, saying…”</i> [Exodus 30:17]</p><p>[4] <i>“And YHWH spoke to Moses, saying…”</i> [Exodus 30:22]</p><p>[5] <i>“And YHWH spoke to Moses, saying…”</i> [Exodus 30:34]</p><p>[6] <i>“And YHWH spoke to Moses, saying…”</i> [Exodus 31:1]</p><p>[7] <i>“And YHWH spoke to Moses, saying…”</i> [Exodus 31:12]</p><p>The seventh and final act of speech covers the Sabbath.</p><p>After this, in Exodus 40, the completion of the tabernacle is given with seven statements of Moses completing the work God commanded him.</p><p>Exodus 40:17-18a</p><p><i>And it came about in the beginning month, in the second year, on the first of the month, the tabernacle was set up</i> (הוקם),<i> and Moses set up </i>(ותקם) <i>the tabernacle…</i></p><p>[1] <i>“…just as Yahweh commanded Moses”</i> [Exodus 40:19]</p><p>[2] <i>“…just as Yahweh commanded Moses”</i> [Exodus 40:21]</p><p>[3] <i>“…just as Yahweh commanded Moses”</i> [Exodus 40:23]</p><p>[4] <i>“…just as Yahweh commanded Moses”</i> [Exodus 40:25]</p><p>[5] <i>“…just as Yahweh commanded Moses”</i> [Exodus 40:27]</p><p>[6] <i>“…just as Yahweh commanded Moses”</i> [Exodus 40:29]</p><p>[7] <i>“…just as Yahweh commanded Moses”</i> [Exodus 40:32]</p><p>“And Moses completed (ויכל) the work (המלאכה)” [Exodus 40:33b]</p><p>Tim cites scholar Howard Wallace to make the following point:</p><p>“The structuring of the narrative in Exodus 25-40 binds the Sabbath observance closely with the construction of the sanctuary. Both are tightly connected with the question of the presence of Yahweh with his people…. The Sabbath is a significant element in the celebration of the presence of Yahweh with his people. Just as the tabernacle was built along lines specified by divine decree, so too in the sequence is the human sabbath institution modeled on the divine pattern. Since the tabernacle, which is patterned on the divine plan, reveals the presence and shares in the role of the heavenly temple to proclaim the sovereignty of Israel’s God, so the Sabbath shares in the proclamation of the sovereignty of Yahweh.”</p><p>(Howard Wallace, “Creation and Sabbath in Genesis 2:1-3,” 246.)</p><p>Tim also shares a quote from Rabbi Abraham Heschel.</p><p>“The sabbath is to time what the temple and tabernacle are to space. The sabbath is a cathedral in time. On the seventh day we experience in time what the tabernacle and temple represented as spaces which is eternal life, God in the complete creation.”</p><p>(<i>The Sabbath</i>, Abraham Joshua Heschel)</p><p>In part 5 (49:50-end), the guys finish up their conversation. Tim notes that the cliffhanger at the end of Exodus is that Moses and all of Israel have successfully built the tabernacle (or the tent of meeting) and God then comes to dwell in it, to meet with Israel. But when he does, his presence is too intense, and Moses is unable to go in. So what will happen? Find out next week when we turn to Numbers and Leviticus.</p><p>Thank you to all our supporters!</p><p> </p><p>Show Resources:</p><ul><li><a href=\"https://journals.sagepub.com/doi/abs/10.1177/1030570X8800100301?journalCode=paaa\">Howard Wallace, “Creation and Sabbath in Genesis 2:1-3”</a></li><li><a href=\"https://amzn.to/35xzaq6\">Abraham Joshua Heschel, <i>The Sabbath</i></a></li><li><a href=\"https://www.jstor.org/stable/20699957?seq=1#page_scan_tab_contents\">Leigh Trevaskis, “The Purpose of Leviticus 24 within its Literary Context”</a></li><li><a href=\"https://books.google.com/books?id=CiqF7sVqDQcC&pg=PA29&lpg=PA29&dq=Stephen+Geller+Exodus+16:+A+Literary+and+Theological+Reading&source=bl&ots=PA1z-ZZ4M2&sig=ACfU3U0bJFwv0noT72VZDMopVJ1SHRswFA&hl=en&sa=X&ved=2ahUKEwjr5a3gwtPlAhVBo54KHfmXDkcQ6AEwAHoECAcQAQ#v=onepage&q=Stephen%20Geller%20Exodus%2016%3A%20A%20Literary%20and%20Theological%20Reading&f=false\">Stephen Geller, “Exodus 16: A Literary and Theological Reading”</a></li></ul><p> </p><p>Find all our resources at www.thebibleproject.com</p><p>Show Music:</p><ul><li><i>The Hymn of the Cherubim</i> by Tchaikovsky</li><li><i>Nature</i> by KV</li><li><i>Feather</i> by Waywell</li><li><i>Solace</i> by Nomyn</li></ul><p> </p><p>Show Produced by:</p><p>Dan Gummel</p><p> </p><p>Powered and distributed by Simplecast.</p>\n",
  "pubDate": "Mon, 11 Nov 2019 08:00:02 +0000",
  "author": "admin@bibleproject.com (Jon Collins, Tim Mackie)",
  "link": "http://www.bibleproject.com",
  "content:encoded": "<p>QUOTE</p><p><i>\"The Sabbath is to time what the tabernacle and temple are to space: a cathedral in time. On the seventh day, we experience in time what the temple and tabernacle represented in spaces, which is eternal life with God in a complete creation.\"</i></p><p>KEY TAKEAWAYS</p><ul><li>The building of the tabernacle in Exodus 40 has deep connections with the theme of seventh-day rest and the creation account in Genesis.</li><li>The tabernacle is presented as a mini cosmos, brought into being by the seven acts of divine speech by God. When Moses builds this symbolic mini cosmos, seven times over he obeys the divine command.</li></ul><p>SHOW NOTES:</p><p>In part 1 (0-8:30), Tim and Jon recap their conversation so far. They go over the story of the Passover and review how it reflects the creation account in Genesis.</p><p>In part 2 (8:30-22:30), Tim transitions to the story of Israel collecting manna in the wilderness in Exodus 16.</p><p>Exodus 16:4-35</p><p><i>Then the Lord said to Moses, “Behold, I am about to rain bread from heaven for you, and the people shall go out and gather a day's portion every day, that I may test them, whether they will walk in my law or not. On the sixth day, when they prepare what they bring in, it will be twice as much as they gather daily.” So Moses and Aaron said to all the people of Israel, “At evening you shall know that it was the Lord who brought you out of the land of Egypt, and in the morning you shall see the glory of the Lord, because he has heard your grumbling against the Lord. For what are we, that you grumble against us?” And Moses said, “When the Lord gives you in the evening meat to eat and in the morning bread to the full, because the Lord has heard your grumbling that you grumble against him—what are we? Your grumbling is not against us but against the Lord.”</i></p><p><i>Then Moses said to Aaron, “Say to the whole congregation of the people of Israel, ‘Come near before the Lord, for he has heard your grumbling.’” And as soon as Aaron spoke to the whole congregation of the people of Israel, they looked toward the wilderness, and behold, the glory of the Lord appeared in the cloud. And the Lord said to Moses, “I have heard the grumbling of the people of Israel. Say to them, ‘At twilight you shall eat meat, and in the morning you shall be filled with bread. Then you shall know that I am the Lord your God.’”</i></p><p><i>In the evening quail came up and covered the camp, and in the morning dew lay around the camp. And when the dew had gone up, there was on the face of the wilderness a fine, flake-like thing, fine as frost on the ground. When the people of Israel saw it, they said to one another, “What is it? For they did not know what it was. And Moses said to them, “It is the bread that the Lord has given you to eat. This is what the Lord has commanded: ‘Gather of it, each one of you, as much as he can eat. You shall each take an omer, according to the number of the persons that each of you has in his tent.’” And the people of Israel did so. They gathered, some more, some less. But when they measured it with an omer, whoever gathered much had nothing left over, and whoever gathered little had no lack. Each of them gathered as much as he could eat. And Moses said to them, “Let no one leave any of it over till the morning.” But they did not listen to Moses. Some left part of it till the morning, and it bred worms and stank. And Moses was angry with them. Morning by morning they gathered it, each as much as he could eat; but when the sun grew hot, it melted.</i></p><p><i>On the sixth day they gathered twice as much bread, two omers each. And when all the leaders of the congregation came and told Moses, he said to them, “This is what the Lord has commanded: ‘Tomorrow is a day of solemn rest, a holy Sabbath to the Lord; bake what you will bake and boil what you will boil, and all that is left over lay aside to be kept till the morning.’” So they laid it aside till the morning, as Moses commanded them, and it did not stink, and there were no worms in it. Moses said, “Eat it today, for today is a Sabbath to the Lord; today you will not find it in the field. Six days you shall gather it, but on the seventh day, which is a Sabbath, there will be none.”</i></p><p><i>On the seventh day some of the people went out to gather, but they found none. And the Lord said to Moses, “How long will you refuse to keep my commandments and my laws? See! The Lord has given you the Sabbath; therefore on the sixth day he gives you bread for two days. Remain each of you in his place; let no one go out of his place on the seventh day.” So the people rested on the seventh day.</i></p><p><i>Now the house of Israel called its name manna. It was like coriander seed, white, and the taste of it was like wafers made with honey. Moses said, “This is what the Lord has commanded: ‘Let an omer of it be kept throughout your generations, so that they may see the bread with which I fed you in the wilderness, when I brought you out of the land of Egypt.’” And Moses said to Aaron, “Take a jar, and put an omer of manna in it, and place it before the Lord to be kept throughout your generations.” As the Lord commanded Moses, so Aaron placed it before the testimony to be kept. The people of Israel ate the manna forty years, till they came to a habitable land. They ate the manna till they came to the border of the land of Canaan.</i></p><p>Tim notes that manna was supposed to be a little taste of the new creation. Manna was a new work of creation that violated normal creation while also fitting within God’s ideal purpose for creation (i.e., within the seven-day scheme). Manna was a divine gift that came from proximity to the divine glory (Ex 16:9-10). This miraculous provision didn’t behave like normal food, and there was more than enough each day, no matter how much was gathered.</p><p>Tim also shares that the rhythms of gathering and not gathering on the Sabbath is an imitation of God’s own patterns of work and rest in Genesis 1. Similarly, God announced “good” days one through six and “very good” on day seven. This parallels with Israel collecting manna on days one through six and “double manna” on day seven. Furthermore, on the seventh day God “rested” (took up residence in his temple), and on the seventh day Israel “rests” and Moses “rested” a perpetual sample of manna “before Yahweh” and “before the testimony.”</p><p>Tim cites scholar Stephen Geller:</p><p>“... manna is presented as a new work of creation that disrupts the established order of creation. In fact, there is a clear parallelism between the creation account in Gen 1-2:4 and Exod 16. In both passages there is a dichotomy between the first six days and the seventh day. In Gen 1, the work of each day is stated by God to be \"good,\" a term that marks its completion. But on the sixth day the phrase \"very good\" marks the completion not just of the acts of creation on that day, but of the first six days as a whole. Genesis 2:1 states explicitly that \"the heaven and earth were completed.\" Yet, to the perplex­ity of exegesis, the very next verse says that \"God completed on the seventh day the work he did and ceased on the seventh day all work he did.\" The second of these two statements must be viewed as an explanation of the first: God completed his work by ceasing.”</p><p>(Stephen Geller, “Exodus 16: A Literary and Theological Reading,” Interpretation vol. (2005), p. 13.)</p><p>In part 3 (22:30-36:30), the guys dive into the actual Sabbath command as part of the Ten Commandments, which is given in seven Hebrew sentences. The Sabbath command in Exodus 20:8-11 is expressed in seven statements arranged in a chiastic symmetry. Tim says this is another fascinating layer of the theme of seventh-day rest in the Bible.</p><p>Exodus 20:8-11</p><p><i>A – Remember the sabbath day, to keep it holy.</i></p><p><i>B – Six days you will labor</i></p><p><i>C – and do all your work,</i></p><p><i>D – but the seventh day is a sabbath of the Lord your God;</i></p><p><i>C’ – you shall not do any work,</i></p><p><i>you or your son or your daughter, your male or your female servant,</i></p><p><i>or your cattle or your sojourner who stays with you.</i></p><p><i>B’ – For in six days the Lord made the heavens and the earth,</i></p><p><i>the sea and all that is in them, and rested on the seventh day;</i></p><p><i>A’ – therefore the Lord blessed the sabbath day and made it holy.</i></p><p>Tim cites scholar Leigh Trevaskis to make his point:</p><p>“The sabbatical rest seems to remind Israel of her covenant obligations as YHWH’s new creation. Though this rest is more immediately connected to the exodus in these chapters, it has its roots in the creation story (Gen 2:1-3; cf. Exod 20:11) and by connecting Israel’s remembrance of her redemption from Egypt with the sabbatical rest, the exodus becomes infused with further theological significance: just as Gods seventh day rest in the creation story marks the emergence of his new creation, so does Israel’s sabbatical rest attest to her emergence as YHWH’s new creation through his act of redemption. And since her identity as a new creation is tied up with the covenant (cf. Exod 15:1-19; 19:4-5), Israel’s sabbatical rests… presumably recall her obligation to remain faithful to this covenant, encouraging her to live according to the Creators will.” (Leigh Trevaskis, “The Purpose of Leviticus 24 within its Literary Context,” 298-299.)</p><p>Tim then walks through Exodus 24, which is the start of God giving the tabernacle instructions to Moses. This story is a crucial layer to understanding how the building of the tabernacle (the “tent of meeting”) weaves into the theme of seventh-day rest.</p><p>Exodus 24:1-11</p><p><i>Then he said to Moses, “Come up to the Lord, you and Aaron, Nadab, and Abihu, and seventy of the elders of Israel, and worship from afar. Moses alone shall come near to the Lord, but the others shall not come near, and the people shall not come up with him.”</i></p><p><i>Moses came and told the people all the words of the Lord and all the rules. And all the people answered with one voice and said, “All the words that the Lord has spoken we will do.” And Moses wrote down all the words of the Lord. He rose early in the morning and built an altar at the foot of the mountain, and twelve pillars, according to the twelve tribes of Israel. And he sent young men of the people of Israel, who offered burnt offerings and sacrificed peace offerings of oxen to the Lord. And Moses took half of the blood and put it in basins, and half of the blood he threw against the altar. Then he took the Book of the Covenant and read it in the hearing of the people. And they said, “All that the Lord has spoken we will do, and we will be obedient.” And Moses took the blood and threw it on the people and said, “Behold the blood of the covenant that the Lord has made with you in accordance with all these words.”</i></p><p><i>Then Moses and Aaron, Nadab, and Abihu, and seventy of the elders of Israel went up, and they saw the God of Israel. There was under his feet as it were a pavement of sapphire stone, like the very heaven for clearness. And he did not lay his hand on the chief men of the people of Israel; they beheld God, and ate and drank.</i></p><p>In part 4 (36:30-49:50), Tim continues the story in Exodus 24.</p><p>Exodus 24:12-18</p><p><i>The Lord said to Moses, “Come up to me on the mountain and wait there, that I may give you the tablets of stone, with the law and the commandment, which I have written for their instruction.” So Moses rose with his assistant Joshua, and Moses went up into the mountain of God. And he said to the elders, “Wait here for us until we return to you. And behold, Aaron and Hur are with you. Whoever has a dispute, let him go to them.” Then Moses went up on the mountain, and the cloud covered the mountain. The glory of the Lord dwelt on Mount Sinai, and the cloud covered it six days. And on the seventh day he called to Moses out of the midst of the cloud. Now the appearance of the glory of the Lord was like a devouring fire on the top of the mountain in the sight of the people of Israel. Moses entered the cloud and went up on the mountain. And Moses was on the mountain forty days and forty nights.</i></p><p>Tim notes that the theme of sixth and seventh day is now clearly established. God appears to Moses on the seventh day.</p><p>Here in Exodus 25-31, God presents Moses with the plans for the tabernacle. These plans are dispensed in seven speeches by God.</p><p>[1] <i>“And YHWH spoke to Moses, saying…”</i> [Exodus 25:1]</p><p>[2] <i>“And YHWH spoke to Moses, saying…”</i> [Exodus 30:11]</p><p>[3] <i>“And YHWH spoke to Moses, saying…”</i> [Exodus 30:17]</p><p>[4] <i>“And YHWH spoke to Moses, saying…”</i> [Exodus 30:22]</p><p>[5] <i>“And YHWH spoke to Moses, saying…”</i> [Exodus 30:34]</p><p>[6] <i>“And YHWH spoke to Moses, saying…”</i> [Exodus 31:1]</p><p>[7] <i>“And YHWH spoke to Moses, saying…”</i> [Exodus 31:12]</p><p>The seventh and final act of speech covers the Sabbath.</p><p>After this, in Exodus 40, the completion of the tabernacle is given with seven statements of Moses completing the work God commanded him.</p><p>Exodus 40:17-18a</p><p><i>And it came about in the beginning month, in the second year, on the first of the month, the tabernacle was set up</i> (הוקם),<i> and Moses set up </i>(ותקם) <i>the tabernacle…</i></p><p>[1] <i>“…just as Yahweh commanded Moses”</i> [Exodus 40:19]</p><p>[2] <i>“…just as Yahweh commanded Moses”</i> [Exodus 40:21]</p><p>[3] <i>“…just as Yahweh commanded Moses”</i> [Exodus 40:23]</p><p>[4] <i>“…just as Yahweh commanded Moses”</i> [Exodus 40:25]</p><p>[5] <i>“…just as Yahweh commanded Moses”</i> [Exodus 40:27]</p><p>[6] <i>“…just as Yahweh commanded Moses”</i> [Exodus 40:29]</p><p>[7] <i>“…just as Yahweh commanded Moses”</i> [Exodus 40:32]</p><p>“And Moses completed (ויכל) the work (המלאכה)” [Exodus 40:33b]</p><p>Tim cites scholar Howard Wallace to make the following point:</p><p>“The structuring of the narrative in Exodus 25-40 binds the Sabbath observance closely with the construction of the sanctuary. Both are tightly connected with the question of the presence of Yahweh with his people…. The Sabbath is a significant element in the celebration of the presence of Yahweh with his people. Just as the tabernacle was built along lines specified by divine decree, so too in the sequence is the human sabbath institution modeled on the divine pattern. Since the tabernacle, which is patterned on the divine plan, reveals the presence and shares in the role of the heavenly temple to proclaim the sovereignty of Israel’s God, so the Sabbath shares in the proclamation of the sovereignty of Yahweh.”</p><p>(Howard Wallace, “Creation and Sabbath in Genesis 2:1-3,” 246.)</p><p>Tim also shares a quote from Rabbi Abraham Heschel.</p><p>“The sabbath is to time what the temple and tabernacle are to space. The sabbath is a cathedral in time. On the seventh day we experience in time what the tabernacle and temple represented as spaces which is eternal life, God in the complete creation.”</p><p>(<i>The Sabbath</i>, Abraham Joshua Heschel)</p><p>In part 5 (49:50-end), the guys finish up their conversation. Tim notes that the cliffhanger at the end of Exodus is that Moses and all of Israel have successfully built the tabernacle (or the tent of meeting) and God then comes to dwell in it, to meet with Israel. But when he does, his presence is too intense, and Moses is unable to go in. So what will happen? Find out next week when we turn to Numbers and Leviticus.</p><p>Thank you to all our supporters!</p><p> </p><p>Show Resources:</p><ul><li><a href=\"https://journals.sagepub.com/doi/abs/10.1177/1030570X8800100301?journalCode=paaa\">Howard Wallace, “Creation and Sabbath in Genesis 2:1-3”</a></li><li><a href=\"https://amzn.to/35xzaq6\">Abraham Joshua Heschel, <i>The Sabbath</i></a></li><li><a href=\"https://www.jstor.org/stable/20699957?seq=1#page_scan_tab_contents\">Leigh Trevaskis, “The Purpose of Leviticus 24 within its Literary Context”</a></li><li><a href=\"https://books.google.com/books?id=CiqF7sVqDQcC&pg=PA29&lpg=PA29&dq=Stephen+Geller+Exodus+16:+A+Literary+and+Theological+Reading&source=bl&ots=PA1z-ZZ4M2&sig=ACfU3U0bJFwv0noT72VZDMopVJ1SHRswFA&hl=en&sa=X&ved=2ahUKEwjr5a3gwtPlAhVBo54KHfmXDkcQ6AEwAHoECAcQAQ#v=onepage&q=Stephen%20Geller%20Exodus%2016%3A%20A%20Literary%20and%20Theological%20Reading&f=false\">Stephen Geller, “Exodus 16: A Literary and Theological Reading”</a></li></ul><p> </p><p>Find all our resources at www.thebibleproject.com</p><p>Show Music:</p><ul><li><i>The Hymn of the Cherubim</i> by Tchaikovsky</li><li><i>Nature</i> by KV</li><li><i>Feather</i> by Waywell</li><li><i>Solace</i> by Nomyn</li></ul><p> </p><p>Show Produced by:</p><p>Dan Gummel</p><p> </p><p>Powered and distributed by Simplecast.</p>\n",
  "enclosure": "",
  "itunes:title": "The Cathedral in Time - 7th Day Rest E5",
  "itunes:author": "Jon Collins, Tim Mackie",
  "itunes:duration": "00:57:08",
  "itunes:summary": "The tabernacle was also known as “the tent of meeting.” Learn more about the importance of this sacred space and its surprising importance to understanding the theme of seventh-day rest.",
  "itunes:subtitle": "The tabernacle was also known as “the tent of meeting.” Learn more about the importance of this sacred space and its surprising importance to understanding the theme of seventh-day rest.",
  "itunes:keywords": "tabernacle, jon collins, exodus, israel, 7th day rest, shabbat, john collins, christianity, torah, sabbath, bible, theology, tim mackie, bible project, christian, genesis",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:episode": 163
}