{
  "id": "yt:video:6EjYW7P4Wts",
  "yt:videoId": "6EjYW7P4Wts",
  "yt:channelId": "UCEnl2ZDocvt4aoIyT3fl8SQ",
  "title": "Firing  from gun cannons HD Stock Footage",
  "link": "",
  "author": {
    "name": "CriticalPast",
    "uri": "https://www.youtube.com/channel/UCEnl2ZDocvt4aoIyT3fl8SQ"
  },
  "published": "2014-07-16T12:05:03+00:00",
  "updated": "2022-05-13T01:41:15+00:00",
  "media:group": {
    "media:title": "Firing  from gun cannons HD Stock Footage",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "CriticalPast is an archive of historic footage. The vintage footage in this video has been uploaded for research purposes, and is presented in unedited form. Some viewers may find some scenes or audio in this archival material to be unsettling or distressing. CriticalPast makes this media available for researchers and documentarians, and does not endorse or condone any behavior or message, implied or explicit, that is seen or heard in this video.\nLink to order this clip:\nhttp://www.criticalpast.com/video/65675041024_Gun-cannons_bomb-explosion_smoke-trailing_plane-falling-in-flames\nHistoric Stock Footage Archival and Vintage Video Clips in HD.\n\nFiring  from gun cannons\n\nFiring from gun cannons. Smoke seen trailing. A war plane falling in flames on the ground. Smoke and fire seen rising. Location: Germany. Date:  1940.\n\nVisit us at www.CriticalPast.com:\n57,000+ broadcast-quality historic clips for immediate download.\nFully digitized and searchable, the CriticalPast collection is one of the largest archival footage collections in the world. All clips are licensed royalty-free, worldwide, in perpetuity. CriticalPast offers immediate downloads of full-resolution HD and SD masters and full-resolution time-coded screeners, 24 hours a day, to serve the needs of broadcast news, TV, film, and publishing professionals worldwide. Still photo images extracted from the vintage footage are also available for immediate download.  CriticalPast is your source for imagery of worldwide events, people, and B-roll spanning the 20th century.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}