{
  "title": "To extract information from language models, optimize for causal response",
  "description": "<p>One way to view AI progress is that we can measure increasingly abstract concepts.<br>A decade ago, it was really hard to take a photo and measure “how much does this image look like a dog?”. Nowadays, just pick your favorite image classification model and run the image through. Similarly,</p>",
  "link": "https://kvfrans.com/causal-language-model/",
  "guid": "6181770c4365cb5561d97f16",
  "category": "research",
  "dc:creator": "Kevin Frans",
  "pubDate": "Fri, 12 Nov 2021 20:56:33 GMT",
  "content:encoded": "<p>One way to view AI progress is that we can measure increasingly abstract concepts.<br>A decade ago, it was really hard to take a photo and measure “how much does this image look like a dog?”. Nowadays, just pick your favorite image classification model and run the image through. Similarly, it used to be unfeasable to measure “how realistic is this photo?”, but with GANs, we can do it easily.</p><p>With the rise of powerful language models, e.g. GPT-3, we’ve unlocked the ability to work with even higher-level ideas. GPT contains a powerfully rich representation of our world, and it’s been shown to solve logical puzzles, summarize large texts, and utilize factual knowldge about the human world.</p><p>Can we somehow extract this knowledge out of GPT? Let’s say an alien wants to learn about the human world, so it goes up to its local GPT engine and asks, “What is coffee?”</p><figure class=\"kg-card kg-image-card\"><img src=\"https://kvfrans.com/content/images/2021/11/Screen-Shot-2021-11-08-at-6.18.09-PM.png\" class=\"kg-image\" alt srcset=\"https://kvfrans.com/content/images/size/w600/2021/11/Screen-Shot-2021-11-08-at-6.18.09-PM.png 600w, https://kvfrans.com/content/images/size/w1000/2021/11/Screen-Shot-2021-11-08-at-6.18.09-PM.png 1000w, https://kvfrans.com/content/images/2021/11/Screen-Shot-2021-11-08-at-6.18.09-PM.png 1440w\" sizes=\"(min-width: 720px) 720px\"></figure><p>“Oh, got it”, the alien says, “so coffee is a kind of orange juice.” This definition is shallow! Coffee is definitely something you drink in the morning, but so are a lot of other things. This answer is vague, and vagueness is a common trend when asking GPT to describe various concepts:</p><figure class=\"kg-card kg-image-card\"><img src=\"https://kvfrans.com/content/images/2021/11/Screen-Shot-2021-11-08-at-6.25.56-PM.png\" class=\"kg-image\" alt srcset=\"https://kvfrans.com/content/images/size/w600/2021/11/Screen-Shot-2021-11-08-at-6.25.56-PM.png 600w, https://kvfrans.com/content/images/size/w1000/2021/11/Screen-Shot-2021-11-08-at-6.25.56-PM.png 1000w, https://kvfrans.com/content/images/size/w1600/2021/11/Screen-Shot-2021-11-08-at-6.25.56-PM.png 1600w, https://kvfrans.com/content/images/2021/11/Screen-Shot-2021-11-08-at-6.25.56-PM.png 1860w\" sizes=\"(min-width: 720px) 720px\"></figure><p>How can we improve these results? Let’s take a step back. We know that GPT has good knowledge of what coffee is, but that doesn’t mean it’s good at <em>telling us</em> what it knows. We want a stronger way of interacting with GPT.</p><p>A nice field to borrow from is <a href=\"https://distill.pub/2017/feature-visualization/\">feature visualization</a>, which focuses on understanding what types of inputs activate various areas of neural networks. Crucially, feature visualization techniques tend to examine <em>causal </em>relationships – results are obtained by optimizing through the neural network many times, and discovering an input which maximizes a certain neuron activation.</p><p>So, let’s do the same with language models. Instead of asking GPT what it thinks about certain topics, let’s just search for phrases which directly affect what GPT is holding in memory. We can do this through what I’ll call <em>causal-response optimization,</em> which tries to maximize the probability of GPT replying “Yes” to a specific question.</p><figure class=\"kg-card kg-image-card\"><img src=\"https://kvfrans.com/content/images/2021/11/Screen-Shot-2021-11-12-at-12.26.00-AM.png\" class=\"kg-image\" alt srcset=\"https://kvfrans.com/content/images/size/w600/2021/11/Screen-Shot-2021-11-12-at-12.26.00-AM.png 600w, https://kvfrans.com/content/images/size/w1000/2021/11/Screen-Shot-2021-11-12-at-12.26.00-AM.png 1000w, https://kvfrans.com/content/images/2021/11/Screen-Shot-2021-11-12-at-12.26.00-AM.png 1260w\" sizes=\"(min-width: 720px) 720px\"></figure><p>Does this metric actually mean anything? It's hard to confirm this quantitatively, but we can at least look at how the causal-response score of \"Am I thinking of coffee?\" responds to some human-written options.</p><figure class=\"kg-card kg-image-card\"><img src=\"https://kvfrans.com/content/images/2021/11/Screen-Shot-2021-11-02-at-9.01.41-PM.png\" class=\"kg-image\" alt srcset=\"https://kvfrans.com/content/images/size/w600/2021/11/Screen-Shot-2021-11-02-at-9.01.41-PM.png 600w, https://kvfrans.com/content/images/size/w1000/2021/11/Screen-Shot-2021-11-02-at-9.01.41-PM.png 1000w, https://kvfrans.com/content/images/size/w1600/2021/11/Screen-Shot-2021-11-02-at-9.01.41-PM.png 1600w, https://kvfrans.com/content/images/2021/11/Screen-Shot-2021-11-02-at-9.01.41-PM.png 2396w\" sizes=\"(min-width: 720px) 720px\"></figure><p>OK, it's not bad! The more details the phrase has, the higher the likeihood that GPT responds with \"Yes\". That sounds reasonable. Now, we just need to replace the human-written options with automatically generated options.</p><p>There’s actually a whole body of work, known as <a href=\"https://arxiv.org/abs/2107.13586\">“prompting”</a>, that deals with how to locate phrases that adjust language model behavior. But we’re going to take a simple approach: 1) generate 20 varied answers for “What is coffee?”, and 2) select the answer with the greatest causal-response score for “Am I thinking of coffee?”.</p><figure class=\"kg-card kg-image-card\"><img src=\"https://kvfrans.com/content/images/2021/11/Screen-Shot-2021-11-25-at-10.55.56-AM-1.png\" class=\"kg-image\" alt srcset=\"https://kvfrans.com/content/images/size/w600/2021/11/Screen-Shot-2021-11-25-at-10.55.56-AM-1.png 600w, https://kvfrans.com/content/images/size/w1000/2021/11/Screen-Shot-2021-11-25-at-10.55.56-AM-1.png 1000w, https://kvfrans.com/content/images/2021/11/Screen-Shot-2021-11-25-at-10.55.56-AM-1.png 1586w\" sizes=\"(min-width: 720px) 720px\"></figure><p>How well does this setup work? Here’s a comparison example on the word-definition task we looked at earlier.</p><figure class=\"kg-card kg-image-card\"><img src=\"https://kvfrans.com/content/images/2021/11/Screen-Shot-2021-11-12-at-1.05.52-AM.png\" class=\"kg-image\" alt srcset=\"https://kvfrans.com/content/images/size/w600/2021/11/Screen-Shot-2021-11-12-at-1.05.52-AM.png 600w, https://kvfrans.com/content/images/size/w1000/2021/11/Screen-Shot-2021-11-12-at-1.05.52-AM.png 1000w, https://kvfrans.com/content/images/2021/11/Screen-Shot-2021-11-12-at-1.05.52-AM.png 1372w\" sizes=\"(min-width: 720px) 720px\"></figure><p>Nice, we're on the right track. Generating text through causal-response optimization results in substantially different results than pure forward-prediction. In general, the causal response definitions are more detailed and specific, which makes sense in this case, since the objective is to maximize GPT's recognition of the word.</p><p>What else can we do with causal-response optimization? Well, it turns out that GPT has a slight tendency to lie when doing forward-prediction. Causal-optimization can help deal with this issue. Take a look at the following list-completions:</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://kvfrans.com/content/images/2021/11/Screen-Shot-2021-11-12-at-1.01.46-AM.png\" class=\"kg-image\" alt srcset=\"https://kvfrans.com/content/images/size/w600/2021/11/Screen-Shot-2021-11-12-at-1.01.46-AM.png 600w, https://kvfrans.com/content/images/size/w1000/2021/11/Screen-Shot-2021-11-12-at-1.01.46-AM.png 1000w, https://kvfrans.com/content/images/size/w1600/2021/11/Screen-Shot-2021-11-12-at-1.01.46-AM.png 1600w, https://kvfrans.com/content/images/2021/11/Screen-Shot-2021-11-12-at-1.01.46-AM.png 1654w\" sizes=\"(min-width: 720px) 720px\"><figcaption>Note: Suwa is a city, not a prefecture. Note 2: These are cherry-picked examples, not rigorously tested</figcaption></figure><p>The forward-prediction answers seem right at first glance, but they're a little wrong ... you can't read a painting. If we use causal-response optimization, we get \"art in some form\", which is a little more satisfying.</p><p>Another fun thing we can do is use causal-response optimization to steer long-form text generation. GPT does a nice job of evaluating various aspects of text through yes-no answers:</p><figure class=\"kg-card kg-image-card kg-width-wide\"><img src=\"https://kvfrans.com/content/images/2021/11/Screen-Shot-2021-11-02-at-10.27.38-PM.png\" class=\"kg-image\" alt srcset=\"https://kvfrans.com/content/images/size/w600/2021/11/Screen-Shot-2021-11-02-at-10.27.38-PM.png 600w, https://kvfrans.com/content/images/size/w1000/2021/11/Screen-Shot-2021-11-02-at-10.27.38-PM.png 1000w, https://kvfrans.com/content/images/size/w1600/2021/11/Screen-Shot-2021-11-02-at-10.27.38-PM.png 1600w, https://kvfrans.com/content/images/size/w2400/2021/11/Screen-Shot-2021-11-02-at-10.27.38-PM.png 2400w\" sizes=\"(min-width: 1200px) 1200px\"></figure><p>Since we can now measure concepts like happiness or old-man-ness, we can also optimize for them.</p><p>Let's look at a \"story about apples\". If we wanted to hear it from the perspective of an old man, one option is to adjust our forward-prediction prompt like so:</p><figure class=\"kg-card kg-image-card kg-width-wide\"><img src=\"https://kvfrans.com/content/images/2021/11/Screen-Shot-2021-11-10-at-10.59.44-AM.png\" class=\"kg-image\" alt srcset=\"https://kvfrans.com/content/images/size/w600/2021/11/Screen-Shot-2021-11-10-at-10.59.44-AM.png 600w, https://kvfrans.com/content/images/size/w1000/2021/11/Screen-Shot-2021-11-10-at-10.59.44-AM.png 1000w, https://kvfrans.com/content/images/size/w1600/2021/11/Screen-Shot-2021-11-10-at-10.59.44-AM.png 1600w, https://kvfrans.com/content/images/size/w2400/2021/11/Screen-Shot-2021-11-10-at-10.59.44-AM.png 2400w\" sizes=\"(min-width: 1200px) 1200px\"></figure><p>Or, we could apply causal-response optimization to each sentence generated. For each line, ten sentence options are generated, and the one that has the best score for \"Is this something an old man would say?\" is chosen.</p><figure class=\"kg-card kg-image-card kg-width-wide\"><img src=\"https://kvfrans.com/content/images/2021/11/Screen-Shot-2021-11-10-at-11.01.15-AM.png\" class=\"kg-image\" alt srcset=\"https://kvfrans.com/content/images/size/w600/2021/11/Screen-Shot-2021-11-10-at-11.01.15-AM.png 600w, https://kvfrans.com/content/images/size/w1000/2021/11/Screen-Shot-2021-11-10-at-11.01.15-AM.png 1000w, https://kvfrans.com/content/images/size/w1600/2021/11/Screen-Shot-2021-11-10-at-11.01.15-AM.png 1600w, https://kvfrans.com/content/images/2021/11/Screen-Shot-2021-11-10-at-11.01.15-AM.png 2130w\" sizes=\"(min-width: 1200px) 1200px\"></figure><p>Almost every sentence in the causal-optimization story reinforces the idea of an old man speaking: there are references to growing up in the country, apples straight off the tree, and the absence of supermarkets.</p><p>So, as researchers, why should we care about causal-response optimization? </p><p>I'm not trying to argue that this method constantly provides better quality results. The examples in this post are mostly anecdotal, and are somewhat cherry-picked to showcase key differences. While I'm sure causal-response can be used to improve text-generation if applied correctly, that claim would require more rigor than I can provide at the moment.</p><p>What I do want to present, are some hints that causal-response is a useful tool for extracting knowledge out of language models. Causal optimization results in substantially different content than forward-prediction – we're explicitly probing into the language model, instead of relying on the model to say what it is thinking. We should explore this direction more! Strong pre-trained models are going to be around for a while, so understanding how they view the world is an important task to be looking at.</p><p>The code for these results is available at <a href=\"https://gist.github.com/kvfrans/1ba1f36d490b7a26c442d36f23e0941a\">this gist</a>, although you need an OpenAI GPT-3 key to run it. I think the code is very readable, so it's probably easy to re-implement this stuff with e.g. GPT-Neo.</p><p>Further work can involve:</p><ul><li>How can we quantatively measure how good generated sentences are? <br>Are there good metrics for knowledge-extraction?</li><li>What questions do we have about large language-model representations, and can causal-optimization be used to answer those questions?</li><li>Are there better ways of optimizing text for causal-response than bootstrapping off forward-prediction? I.e. evolutionary search, gradient optimization, etc. (Somewhat addressed in Appendix)</li></ul><!--kg-card-begin: html--><hr class=\"gridhr\">\n<br>\n<div class=\"float-outside\">\n<div class=\"appendix\">\n    <div class=\"float-label\">\n        Appendix\n    </div><!--kg-card-end: html--><p>Cite as:</p><pre><code class=\"language-x\">@article{frans2021causalresponse,\n  title   = \"To extract information from language models, optimize for causal response\",\n  author  = \"Frans, Kevin\",\n  journal = \"kvfrans.com\",\n  year    = \"2021\",\n  url     = \"https://kvfrans.com/causal-language-model/\"\n}</code></pre><p>This work isn't rigorous enough for me to publish it in a formal setting, but I would love to see further research the directions discussed here. Thanks to Phillip Isola and others in the <a href=\"http://web.mit.edu/phillipi/\">Isolab</a> for the help :)</p><!--kg-card-begin: html--><br><div class=\"float-label\" style=\"clear: both\">\n\tSource Code\n</div><!--kg-card-end: html--><figure class=\"kg-card kg-bookmark-card\"><a class=\"kg-bookmark-container\" href=\"https://gist.github.com/kvfrans/1ba1f36d490b7a26c442d36f23e0941a\"><div class=\"kg-bookmark-content\"><div class=\"kg-bookmark-title\">lang.ipynb</div><div class=\"kg-bookmark-description\">GitHub Gist: instantly share code, notes, and snippets.</div><div class=\"kg-bookmark-metadata\"><img class=\"kg-bookmark-icon\" src=\"https://github.githubassets.com/favicons/favicon.svg\"><span class=\"kg-bookmark-author\">Gist</span><span class=\"kg-bookmark-publisher\">262588213843476</span></div></div><div class=\"kg-bookmark-thumbnail\"><img src=\"https://github.githubassets.com/images/modules/gists/gist-og-image.png\"></div></a></figure><!--kg-card-begin: html--><br><div class=\"float-label\" style=\"clear: both\">\n\tThings To Read\n</div><!--kg-card-end: html--><p><a href=\"https://arxiv.org/pdf/2107.13586.pdf\"><strong>\"Pre-train, Prompt, and Predict: A Systematic Survey of Prompting Methods in Natural Language Processing\"</strong></a><strong>, by Liu et al. </strong>A growing field in the last years deals with prompting for pre-trained language models. In prompting, instead of fine-tuning the network parameters on a task, the goal is to learn a <em>prompt phrase</em> that is appended to input text in order to influence the behavior of the language model. This paper is a good review of the area.</p><p><strong>\"<strong><a href=\"https://arxiv.org/abs/2010.15980\">AutoPrompt: Eliciting Knowledge from Language Models with Automatically Generated Prompts</a></strong>\", by Shin et al. </strong>This paper is one of the works in prompting, I picked it because it cleanly states the prompting problem and presents a framework. In AutoPrompt, the aim is to learn a set of trigger words which influences a language model into predicting the correct output for a set of tasks.</p><p><a href=\"https://arxiv.org/abs/2102.01645\">\"<strong>Generating images from caption and vice versa via CLIP-Guided Generative Latent Space Search\"</strong></a><strong>, by Galatolo et al. </strong>CLIP-GlaSS is a way to move from text-to-image and image-to-text via CLIP encodings. There are similarities to prompting work here, especially in the image-to-text task, where the aim is to locate text which best matches a given image. </p><p>In CLIP-GlaSS they use an evolutionary search to locate text; I tried that initially in the causal-response optimization, but the method struggled with finding gramatically-correct answers.<strong> </strong>I played with various combinations of beam search, where language model logits are weighted by the causal-response objective, but the results had a lot of variation. In the end, generating options via forward-prediction and selecting via causal-response led to be most satisfying results.</p><p><strong><a href=\"https://arxiv.org/abs/1909.01066\">\"Language Models as Knowledge Bases?\"</a>, by Petroni et al. </strong>This work is an analysis on BERT and how it performs well on various question-answering datasets without additional fine-tuning. To be honest, I chose this paper based on its name, which implies a perspective I agree with – language models are rich knowledge bases, and what we need are tools to extract this knowledge from them.</p></div></div>"
}