{
  "id": "https://bibleinoneyear.org/en/youth/268",
  "title": "Day 268: Spirit-Powered Living",
  "description": "Proverbs 23:19, Isaiah 61:1–8, Ephesians 4:1–16. The book of Proverbs anticipates what Spirit-powered living should look like  Then, in the New Testament, we see the fulfilment of Spirit-powered living",
  "pubDate": "Sat, 25 Sep 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/268/?ignore",
  "itunes:duration": "14:31",
  "guid": "enyouth25092021-268",
  "length": 871.44,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 268: Spirit-Powered Living",
  "itunes:subtitle": "Proverbs 23:19, Isaiah 61:1–8, Ephesians 4:1–16. The book of Proverbs anticipates what Spirit-powered living should look like  Then, in the New Testament, we see the fulfilment of Spirit-powered living",
  "itunes:summary": "‘I felt ablaze with a desire to go through the length and breadth of Wales to tell of the Saviour: and had it been possible, I was willing to pay God for doing so,’ wrote Evan Roberts, the man at the centre of the Welsh revival of 1904–1905. He spoke about how the Spirit of God gave him an overwhelming experience of God’s love. He was filled with compassion and a desire to tell others about Jesus.\nWe live in the age of the Spirit. In the Old Testament, the Holy Spirit came on particular people at particular times for particular purposes. We see an example of this in today’s reading, when the Holy Spirit came on Isaiah (Isaiah 61). This event was a foretaste of the Holy Spirit coming upon Jesus (Luke 4:14–18), as well as of the outpouring of the Holy Spirit on all Christians, from the day of Pentecost onwards.\nThe book of Proverbs anticipates what Spirit-powered living should look like. Then, in the New Testament, we see the fulfilment of Spirit-powered living.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 268
}