{
  "title": "40: SARK & Dr. John Waddell- Succulent Wild Love",
  "pubDate": "Thu, 17 Dec 2015 06:40:20 +0000",
  "guid": "fa90d32cedc0ee4936066d97ea2f37ea",
  "link": "https://lifeonpurpose.libsyn.com/40-sark-dr-john-waddell-succulent-wild-love",
  "itunes:image": "",
  "description": "<p><strong>For Life on Purpose Episode #40,</strong> my guests are <strong>SARK</strong> <em>(Susan Ariel Rainbow Kennedy)</em> an international expert in personal well-being and transformation whose name has become synonymous with transformation, color, healing, movement and fun AND her husband <strong>Dr. John Waddell</strong>, who has been helping individuals and couples lead happier lives for over 30 years through his clinical psychology practice and metaphysical teachings.</p>\n<p><strong>SARK</strong> and <strong>Dr. John</strong> join me for an inspiration conversation about their brand new book, <em><strong>Succulent Wild Love: Six Powerful Habits for Feeling More Love More Often</strong></em>, in which they offer powerful relationship advice including \"Joyful Solutions\" <em>(where no one needs to compromise or sacrifice)</em>, being \"Soufully Single\", and listening to your Inner Wise Self.</p>\n<p>We also discuss their unique life journeys, some unexpected recent news in their life, and much, much more!</p>\n<p>About the book: <em><strong>Succulent Wild Love: Six Powerful Habits for Feeling More Love More Often</strong></em> combines<strong> SARK's</strong> trademark creativity with the more left-brain psychological perspective <strong>Dr. John</strong> brings to the table. Using real life examples, they offer six simple but profound habits for feeling more love more often that speak to readers at every stage in a relationship — whether they are looking for love, happily partnered, or in the midst of uncoupling.</p>\n<p>About <strong>SARK</strong>: I’m <strong>SARK</strong>, also known as <strong>Susan Ariel Rainbow Kennedy</strong>- which spells SARK. The name was given to me by the author Henry Miller in the early 1980’s. Soon after, I started taking notes as spirit spoke through me. Those notes turned into all the books and art and everything SARKian. I love representing the SARK spirit and I know that that spirit is inside everyone!</p>\n<p>Throughout the course of my life and career as an international expert in personal well-being and transformation, my name has become synonymous with transformation, color, healing, movement & FUN.</p>\n<p>I’m inviting you to play and connect with me, letting gladness expand into your heart and touch that place deep inside of you- your inner Wise Self- that already knows everything you’ll ever need in this world is within you.</p>\n<p>I’ve written countless books and created programs that I offer to provide a powerfull, grounded and practical approach to feeling glad more often, transforming what hurts into what helps and living a life of joyfull creative expression. No matter what!</p>\n<p>About <strong>Dr. John</strong>: <strong>Dr. John Waddell</strong> has spent over 30 years as a practicing psychologist helping individuals and couples lead more joyful lives.</p>\n<p>While a psychologist by training, he also spent many years studying metaphysics. This enables him to integrate the tools from both these ﬁelds to help people create richer, more fulﬁlling lives.</p>\n<p>His interest in metaphysics led him to specialize in the practical application of the Law of Attraction. And he wrote two novels showing how the characters are able to consciously change their lives using this approach. (<em>John and Jeanie Fly: Living the Law of Attraction</em> and<em> John and Jeanie Fly: Our World and The Law of Attraction</em>).</p>\n<p>In understanding his own life and in working with others, he begins with the attitude that we have the power to change any experience, and we have the ability to rendezvous with more joyful and fulfilling experiences, whether it’s with someone close to us, a physical situation, or a desire for more abundance. John created significant wealth and is exploring the true nature of wealth in all forms.</p>\n<p><strong>John</strong> was able to transform the painful loss of his wife in 2011, into a marriage where the honeymoon never ended.</p>\n<p>His vision was to continue to grow, to be with someone in a relationship that was just as nourishing and would continue to new levels. John kept his vision and in 2012 met Susan Kennedy (<strong>SARK</strong>). Their lifestyles and spiritual connection are uplifting in more ways than John had even imagined. John and Susan live and create happily together in San Francisco.</p>\n<p>To learn more about <strong>SARK</strong> and her work: <a href=\"http://planetsark.com/\" target=\"_blank\">http://planetsark.com/</a>.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #40, my guests are SARK <em>(Susan Ariel Rainbow Kennedy)</em> an international expert in personal well-being and transformation whose name has become synonymous with transformation, color, healing, movement and fun AND her husband Dr. John Waddell, who has been helping individuals and couples lead happier lives for over 30 years through his clinical psychology practice and metaphysical teachings.</p>\n<p>SARK and Dr. John join me for an inspiration conversation about their brand new book, <em>Succulent Wild Love: Six Powerful Habits for Feeling More Love More Often</em>, in which they offer powerful relationship advice including \"Joyful Solutions\" <em>(where no one needs to compromise or sacrifice)</em>, being \"Soufully Single\", and listening to your Inner Wise Self.</p>\n<p>We also discuss their unique life journeys, some unexpected recent news in their life, and much, much more!</p>\n<p>About the book: <em>Succulent Wild Love: Six Powerful Habits for Feeling More Love More Often</em> combines SARK's trademark creativity with the more left-brain psychological perspective Dr. John brings to the table. Using real life examples, they offer six simple but profound habits for feeling more love more often that speak to readers at every stage in a relationship — whether they are looking for love, happily partnered, or in the midst of uncoupling.</p>\n<p>About SARK: I’m SARK, also known as Susan Ariel Rainbow Kennedy- which spells SARK. The name was given to me by the author Henry Miller in the early 1980’s. Soon after, I started taking notes as spirit spoke through me. Those notes turned into all the books and art and everything SARKian. I love representing the SARK spirit and I know that that spirit is inside everyone!</p>\n<p>Throughout the course of my life and career as an international expert in personal well-being and transformation, my name has become synonymous with transformation, color, healing, movement & FUN.</p>\n<p>I’m inviting you to play and connect with me, letting gladness expand into your heart and touch that place deep inside of you- your inner Wise Self- that already knows everything you’ll ever need in this world is within you.</p>\n<p>I’ve written countless books and created programs that I offer to provide a powerfull, grounded and practical approach to feeling glad more often, transforming what hurts into what helps and living a life of joyfull creative expression. No matter what!</p>\n<p>About Dr. John: Dr. John Waddell has spent over 30 years as a practicing psychologist helping individuals and couples lead more joyful lives.</p>\n<p>While a psychologist by training, he also spent many years studying metaphysics. This enables him to integrate the tools from both these ﬁelds to help people create richer, more fulﬁlling lives.</p>\n<p>His interest in metaphysics led him to specialize in the practical application of the Law of Attraction. And he wrote two novels showing how the characters are able to consciously change their lives using this approach. (<em>John and Jeanie Fly: Living the Law of Attraction</em> and<em> John and Jeanie Fly: Our World and The Law of Attraction</em>).</p>\n<p>In understanding his own life and in working with others, he begins with the attitude that we have the power to change any experience, and we have the ability to rendezvous with more joyful and fulfilling experiences, whether it’s with someone close to us, a physical situation, or a desire for more abundance. John created significant wealth and is exploring the true nature of wealth in all forms.</p>\n<p>John was able to transform the painful loss of his wife in 2011, into a marriage where the honeymoon never ended.</p>\n<p>His vision was to continue to grow, to be with someone in a relationship that was just as nourishing and would continue to new levels. John kept his vision and in 2012 met Susan Kennedy (SARK). Their lifestyles and spiritual connection are uplifting in more ways than John had even imagined. John and Susan live and create happily together in San Francisco.</p>\n<p>To learn more about SARK and her work: <a href=\"http://planetsark.com/\" target=\"_blank\">http://planetsark.com/</a>.</p>",
  "enclosure": "",
  "itunes:duration": "01:14:10",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #40, my guests are SARK (Susan Ariel Rainbow Kennedy) an international expert in personal well-being and transformation whose name has become synonymous with transformation, color, healing, movement and fun AND her husband..."
}