{
  "title": "How To Generate Quality Training Data For Your Machine Learning Projects",
  "link": "https://kavita-ganesan.com/machine-learning-training-data-generation/",
  "comments": "https://kavita-ganesan.com/machine-learning-training-data-generation/#respond",
  "dc:creator": "Kavita Ganesan",
  "pubDate": "Sun, 01 Aug 2021 21:42:41 +0000",
  "category": [
    "AI Project Management",
    "AI Strategy",
    "Business AI"
  ],
  "guid": "https://kavita-ganesan.com/?p=6039",
  "description": "Learn 5 strategies for generating high-quality machine learning training data. Warning: some of these approaches have been tried and tested. ",
  "content:encoded": "\n<p>Have you run into issues acquiring the <em>right</em> type of data for your machine learning (ML) projects?</p>\n\n\n\n<p>You’re not alone. Many teams do. And data is one of the key sticking points in starting AI initiatives at companies. In fact, according to IBM’s CEO, Arvind Krishna, <a href=\"https://www.wsj.com/articles/data-challenges-are-halting-ai-projects-ibm-executive-says-11559035800\">data-related challenges </a>are the top reason <a href=\"https://www.wsj.com/articles/data-challenges-are-halting-ai-projects-ibm-executive-says-11559035800\">IBM clients</a> have halted or canceled AI projects.&nbsp;</p>\n\n\n\n<p>Often what happens in practice is that the relevant ML training data is either not collected, or collected but the data lacks the required <strong>labels </strong>for training a model. It could also be that the existing <strong>volume </strong>of data is insufficient for ML model development.&nbsp;</p>\n\n\n\n<p>As I’ve discussed in one of my previous<a href=\"https://www.opinosis-analytics.com/blog/big-data-strategy/\"> data</a> articles, such issues result in delays, project cancellation, biased predictions, and an overall lack of trust in AI initiatives. Bottom line: having the right data, in the right volume is critical for any ML project.&nbsp;</p>\n\n\n\n<p>But, what if your company does not have a solid <a href=\"https://kavita-ganesan.com/big-data-strategy/\">big data strategy</a>, or you’re just getting started with data collection? How can you safely start machine learning projects for your automation tasks?</p>\n\n\n\n<p>In this article, we’ll explore four strategies for obtaining high-quality machine learning training data for your projects, even if you’re new to AI or your data strategy is still in the works.&nbsp;&nbsp;For convenience, use the table of contents below to explore the strategies of interest to you.</p>\n\n\n\n<div id=\"ub_table-of-contents-46a9a976-f5cb-4008-801f-5e596997174c\" class=\"ub_table-of-contents\" data-showtext=\"show\" data-hidetext=\"hide\" data-scrolltype=\"auto\" data-initiallyhideonmobile=\"false\" data-initiallyshow=\"true\">\n<div class=\"ub_table-of-contents-header\">&nbsp;</div>\n</div>\n\n\n\t\t\t\t<div class=\"wp-block-uagb-table-of-contents uagb-toc__align-left uagb-toc__columns-1  uagb-block-fcbe2c73    \"\n\t\t\t\t\tdata-scroll= \"1\"\n\t\t\t\t\tdata-offset= \"30\"\n\t\t\t\t>\n\t\t\t\t<div class=\"uagb-toc__wrap\">\n\t\t\t\t\t\t<div class=\"uagb-toc__title\">\n\t\t\t\t\t\t\tTable Of Contents\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div class=\"uagb-toc__list-wrap\">\n\t\t\t\t\t\t<ol class=\"uagb-toc__list\"><li class=\"uagb-toc__list\"><a href=\"#5-strategies-for-generating-machine-learning-training-data\">5 Strategies for Generating Machine Learning Training Data</a><ul class=\"uagb-toc__list\"><li class=\"uagb-toc__list\"><a href=\"#1-start-manually-with-domain-experts\">#1: Start Manually with Domain Experts</a><li class=\"uagb-toc__list\"><a href=\"#2-start-manually-with-customers\">#2: Start Manually with Customers</a><li class=\"uagb-toc__list\"><a href=\"#3-pair-humans-with-software-rules-ie-semi-automatic\">#3: Pair Humans With Software Rules (i.e., Semi-Automatic)</a><li class=\"uagb-toc__list\"><a href=\"#4-crowdsource-internally\">#4: Crowdsource Internally</a><li class=\"uagb-toc__list\"><a href=\"#5-crowdsource-externally\">#5: Crowdsource Externally</a></li></ul></li><li class=\"uagb-toc__list\"><a href=\"#comparison-of-all-training-data-generation-strategies\">Comparison of ALL Training Data Generation Strategies</a><li class=\"uagb-toc__list\"><a href=\"#final-word\">Final Word</a></li></ul></ol>\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t</div>\n\t\t\t\n\n\n<hr class=\"wp-block-separator has-css-opacity\"/>\n\n\n\n<div style=\"height:42px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<h2 id=\"0-5-strategies-for-generating-machine-learning-training-data\">5 Strategies for Generating Machine Learning Training Data</h2>\n\n\n\n<h3 id=\"1-1-start-manually-with-domain-experts\">#1: Start Manually with Domain Experts</h3>\n\n\n\n<p>If you have zero data for an automation problem or your data is limited, you can put together a team of <strong>experts</strong> who’ll manually complete tasks, while at the same time start generating high-quality data.</p>\n\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-13639\" src=\"https://www.opinosis-analytics.com/wp-content/uploads/2021/07/How-ai-training-data-collection-works-using-a-team-of-experts-1024x509.png\" alt=\"data collection using a team of domain experts\" width=\"1024\" height=\"509\">\n<figcaption>How data collection works using a team of experts</figcaption>\n</figure>\n</div>\n\n\n\n<p>Say you’re looking to develop an AI tool that detects fraudulent website logins. If you’ve never tracked fraudulent login attempts, you’ll have limited to no data to train a model. But you can start the process manually with a team of security experts to start generating high-quality data. This data can later be used to train a machine to detect fraud just like its human counterpart. All the data from the manual process can be tracked, collected, and stored for model training.</p>\n\n\n\n<h4 id=\"2-when-is-a-manual-strategy-with-domain-experts-suitable-\"><strong>When is a manual strategy with domain experts suitable?</strong></h4>\n\n\n\n<p>As a manual approach can be slow, it’s especially suitable for problems that require deep domain expertise and when people’s health and safety are at stake. For example, in a tumor detection task, you can’t just train models on image data produced by a layperson or even a general practitioner. You need data from experienced radiologists as it requires deep domain expertise to detect and label tumors correctly. Otherwise, there’s a higher risk of problematic predictions, putting people’s health at risk.</p>\n\n\n\n<h4 id=\"3-pros-and-cons-of-a-manual-approach-with-domain-experts-\"><strong>Pros and cons of a manual approach with domain experts:</strong></h4>\n\n\n\n<p>There is no better data than a manually generated and vetted one. Manually generated data, especially data produced by subject matter experts (SMEs), is usually accurate. Plus, there is an added advantage that doing a task manually, to begin with gives you insights into the idiosyncrasies of the task, which can help teams better handle edge cases as automation is introduced.</p>\n\n\n\n<p>But the downside of this is, of course—volume. If you have a small team working on the tasks manually, it can take months to generate sufficient data.</p>\n\n\n\n<h3 id=\"4-2-start-manually-with-customers\">#2: Start Manually with Customers</h3>\n\n\n\n<p>When you’re trying to develop AI-driven productivity enhancements tools for customers, who better to tell you what’s expected than customers themselves? Instead of starting with automation right off the bat, why not augment existing software such that customers can complete the task manually first.&nbsp;</p>\n\n\n\n<p>I once worked with a company that wanted to introduce a machine learning model to detect duplicate discussion threads on their software platform. But since the relevant data was non-existent, we first went manual. We introduced a mechanism to allow users to manually specify if a discussion thread was a duplicate of another. In this case, the customers were the “domain experts,” and they decided which threads were duplicates. All the customer-generated data was later leveraged to build an AI-driven duplicate detection solution. You can use a similar approach for many other automation tasks, such as automatically tagging documents with topics and tagging objects in images. With this approach, you are leveraging the power of volume and the expertise of your very own customers.&nbsp;</p>\n\n\n\n<h4 id=\"5-when-is-a-manual-strategy-with-customers-suitable-\"><strong>When is a manual strategy with customers suitable?</strong></h4>\n\n\n\n<p>A manual strategy with customers makes the most sense when you have a large customer base, and the task benefits the customer. For example, the duplicate detection task we discussed earlier, helped customers explore related discussion threads. So, they were willing to complete the task manually. If completing a task doesn’t benefit the customer, you could still generate data, but the volume could be much lower.&nbsp;</p>\n\n\n\n<h4 id=\"6-pros-and-cons-of-a-manual-strategy-with-customers-\"><strong>Pros and cons of a manual strategy with customers:</strong></h4>\n\n\n\n<p>When you have motivated customers willing to complete the manual tasks, this strategy ensures that you’re getting volume and a variety in your data in a relatively short time. I’ve personally found that providing sufficient variety in data helps build robust models. On the flip side, this approach may end up generating poor quality data if customers “game” the system for their benefit. Additionally, if customers couldn’t care less about the task, the volume of data could end up being sparse.&nbsp;</p>\n\n\n\n<h3 id=\"7-3-pair-humans-with-software-rules-ie-semi-automatic\">#3: Pair Humans With Software Rules (i.e., Semi-Automatic)</h3>\n\n\n\n<p>Another approach to collecting good quality training data is to pair rules encoded in software with humans in the loop. Essentially, you encode rules a human would use to perform a task as a set of software rules. At the same time, you still have a few humans in the loop to act as a quality control layer. If the corrected and vetted data is stored, you can use it for model training in months to come.</p>\n\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-13669\" src=\"https://www.opinosis-analytics.com/wp-content/uploads/2021/07/How-machine-learning-training-data-generation-works-with-the-use-of-simple-software-automation-and-humans-in-the-loop.-1024x567.png\" alt=\"AI training data collection with humans in the loop and simple software automation\" width=\"1024\" height=\"567\">\n<p>&nbsp;</p>\n<figcaption>How machine learning training data generation works with the use of simple software automation and humans in the loop.</figcaption>\n</figure>\n</div>\n\n\n\n<p>If we reimagine this approach for the fraudulent login example, the software will flag all suspicious login attempts. Then a human goes in and fixes problematic classification.&nbsp; Or, in the case of the duplicate thread detection problem, the software may suggest potential duplicates to customers. But in the end, customers decide if two discussion threads are, in fact, duplicates. This reduces the amount of manual work that customers or domain experts would have to put in—hastening data generation.&nbsp;</p>\n\n\n\n<h4 id=\"8-when-is-a-semi-automatic-approach-suitable\">When is a semi-automatic approach suitable?</h4>\n\n\n\n<p>A semi-automatic approach is suitable for problems that can be encoded fairly quickly using software rules. For example, you could potentially express conditions that lead to fraudulent website logins using a set of rules. Of course, these rules may not be 100 or even 90 percent accurate. But it can be good enough to get started, allowing the humans-in-the-loop to be the final decision-makers.</p>\n\n\n\n<h4 id=\"9-pros-and-cons-of-a-semi-automatic-approach-\"><strong>Pros and cons of a semi-automatic approach:</strong></h4>\n\n\n\n<p>The benefit of using a semi-automatic approach is an<strong> improvement in speed</strong> over a manual method. That’s because you can drastically reduce manual work for a human decision-maker with a rules-based software in the mix. This in turn speeds up task completion and the potential to generate a higher volume of data in a shorter time.&nbsp;</p>\n\n\n\n<p>The downside of this approach is that it may be hard to form a reliable set of rules for certain problems. Plus, it can take additional time and monetary investments to develop the rules-based software automation.</p>\n\n\n\n<h3 id=\"10-4-crowdsource-internally\">#4: Crowdsource Internally</h3>\n\n\n\n<p>Crowdsourcing internally means asking a group of people you know and trust (e.g., within the company or your friend’s circle) to complete a certain labeling task.</p>\n\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-13626\" src=\"https://www.opinosis-analytics.com/wp-content/uploads/2021/07/internal-crowdsourcing-to-generate-machine-learning-training-data-1024x554.png\" alt=\"internal crowdsourcing to generate ML training data\" width=\"1024\" height=\"554\">\n<p>&nbsp;</p>\n<figcaption>How internal crowdsourcing works to generate data for machine learning</figcaption>\n</figure>\n</div>\n\n\n\n<p>Say you’re looking to build a sentiment classification tool; You could ask colleagues to label phrases such as “prompt customer service” and “flawed design” as containing a positive or negative sentiment, specifically to generate labeled data to develop the ML tool. This is different from a manual or semi-automatic approach as you’re taking the task out of its natural context and presenting it to different people to generate labels.&nbsp;</p>\n\n\n\n<p>Internal crowdsourcing requires some extra setup work to acquire labels. I’ve personally used online platforms such as <a href=\"https://www.lighttag.io/\">LightTag</a> to collect labels from SMEs, but there are many others out there.</p>\n\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-13642\" src=\"https://www.opinosis-analytics.com/wp-content/uploads/2021/07/name-labeling-task--1024x610.png\" alt=\"Labeling with lighttag to generate data for training ML models\" width=\"797\" height=\"474\">\n<p>&nbsp;</p>\n<figcaption>Example Labeling of people and places with LightTag</figcaption>\n</figure>\n</div>\n\n\n\n<p>The trick is to find a tool that fits the task. Some companies end up building their own systems to collect labels as the off-the-shelf tools are either not flexible enough for their needs or they’re concerned about data privacy.&nbsp;</p>\n\n\n\n<h4 id=\"11-when-is-crowdsourcing-internally-suitable\">When is crowdsourcing internally suitable?</h4>\n\n\n\n<p>Data generation tasks that can be easily taken out of context or don’t require domain expertise make great internal crowdsourcing candidates. For example, these can be tasks that only require “common sense” or knowledge of a particular language. People in your trusted circle are unlikely to be spammers and are inclined to complete tasks properly to support your cause. Internal crowdsourcing can also work with complex tasks—but you must use the right SMEs. I’ve personally had several successes with crowdsourcing using a team of SMEs within the healthcare domain. You can do the same.&nbsp;</p>\n\n\n\n<h4 id=\"12-pros-and-cons-of-internal-crowdsourcing-\"><strong>Pros and cons of internal crowdsourcing:</strong></h4>\n\n\n\n<p>The benefit of crowdsourcing internally is that you can generate a good volume of high-quality labeled data for many problems. But you need to be extra careful with tasks that require domain expertise. For example, if you’re asking a group of radiologists from different hospitals to study a set of digital images and label tumor location, you may need labels from different SMEs for a single task to ensure accuracy. This can slow things down, but at least you’re sure you’re generating quality data. Also, there may not be an appropriate off-the-shelf tool to help you obtain the necessary labels, and you may have to build the tool first. Not to forget, you’d also need to train your labelers to complete tasks adequately.&nbsp;&nbsp;</p>\n\n\n\n<h3 id=\"13-5-crowdsource-externally\">#5: Crowdsource Externally</h3>\n\n\n\n<p>Crowdsourcing externally is about paying <em>unknown</em> human workers to generate the necessary data for your ML projects. These workers could very well be in different countries.</p>\n\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-13631\" src=\"https://www.opinosis-analytics.com/wp-content/uploads/2021/07/How-external-crowdsourcing-works-to-generate-training-data-for-ML-1024x770.png\" alt=\"How external crowdsourcing works to generate training data for ML\" width=\"790\" height=\"593\">\n<p>&nbsp;</p>\n<figcaption>How external crowdsourcing works to generate training data for ML</figcaption>\n</figure>\n</div>\n\n\n\n<p><a href=\"https://www.mturk.com/\">Amazon Mechanical Turk</a>, for example, is an online platform that allows you to outsource labeling tasks to workers around the world, to generate data for machine learning projects quickly. There are also data labeling companies that hire workers specifically to <a href=\"https://www.sama.com/\">generate data</a> for AI projects.&nbsp;</p>\n\n\n\n<p>Crowdsourcing externally is a speedy way of generating large volumes of data. For example, I’ve received sentiment annotations for several thousand sentences from Mechanical Turk in a matter of minutes. But as with anything this easy, there’s always a catch. The labeling may not always be accurate. This means that you need to vet the quality of workers, or pay higher costs per labeling task to get more “trustworthy” workers on your task. You may also need multiple workers to complete the same task to ensure that the labels are accurate.&nbsp;</p>\n\n\n\n<h4 id=\"14-when-is-crowdsourcing-externally-suitable\">When is crowdsourcing externally suitable?</h4>\n\n\n\n<p>External crowdsourcing is very effective for simple labeling tasks that don’t require special domain knowledge and can be taken out of their natural context. For example:</p>\n\n\n\n<ul><li>Tagging people and objects within images</li><li>Casting a sentiment opinion on pieces of text</li><li>Tagging people, places, and products in text</li></ul>\n\n\n\n<h4 id=\"15-pros-and-cons-of-a-external-crowdsourcing-\"><strong>Pros and cons of a external crowdsourcing:</strong></h4>\n\n\n\n<p>Crowdsourcing externally is the fastest way to generate huge amounts of data in a short period of time. But this comes with several downsides. First, the quality of labels may not be as accurate as you’d like it to be. So, this approach should be reserved for tasks that can tolerate some “noise” in the predictions. You’d also need to think about how to account for spam labels by workers randomly completing tasks, and also how best to improve the accuracy of labels produced by your unknown workers.&nbsp;</p>\n\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-13612\" src=\"https://www.opinosis-analytics.com/wp-content/uploads/2021/07/generating-machine-learning-training-data-manual-vs.-crowdsourced-1024x576.png\" alt=\"generating synthetic data for machine learning using crowdsourcing approaches\" width=\"961\" height=\"541\">\n<p>&nbsp;</p>\n<figcaption>Key differences between a manual or semi-automatic approach and a crowdsourcing approach in generating data for machine learning</figcaption>\n</figure>\n</div>\n\n\n\n<h2 id=\"16-comparison-of-all-training-data-generation-strategies\">Comparison of ALL Training Data Generation Strategies</h2>\n\n\n\n<p>Here’s a quick comparison of the different machine learning training data generation strategies discussed in this article. I hope this guides you towards the best approach for your machine learning projects.</p>\n\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-13616\" src=\"https://www.opinosis-analytics.com/wp-content/uploads/2021/07/how-to-generate-machine-learning-training-data-comparison-1024x1024.png\" alt=\"how to generate synthetic training data for machine learning training comparison\" width=\"1024\" height=\"1024\">\n<p>&nbsp;</p>\n<figcaption>Comparison of the different strategies for generating ML training data</figcaption>\n</figure>\n</div>\n\n\n\n<h2 id=\"17-final-word\">Final Word</h2>\n\n\n\n<p>We’ve seen that there are many ways to get started with AI initiatives without an elaborate <a href=\"https://kavita-ganesan.com/big-data-strategy/\">data strategy.</a> If you’re looking to automate a new problem with AI,&nbsp; but you don’t have the data, you can generate it by starting with a manual process. Alternatively, you can augment your manual process with a semi-automatic approach to increase data generation speed.</p>\n\n\n\n<p>Further, if a task can be taken out of its natural context and you don’t need deep domain expertise, you can think about crowdsourcing internally within a trusted circle or externally, with unknown human workers. But external crowdsourcing requires extra care to counter quality issues such as spam and unreliable labels.</p>\n\n\n\n<p>So which approach should you consider? This is entirely task-dependent. If you’re dealing with tasks where <strong>accuracy</strong> is of utmost importance, a manual or semi-automatic strategy and internal crowdsourcing with SMEs can work well. If you need labeled data for a task that anyone can easily complete, you could consider internal or external crowdsourcing. If you’re having data struggles for your ML projects, would you consider any of these approaches? Leave a comment below to share your thoughts!</p>\n\n\n\n<div class=\"inherit-container-width is-layout-constrained wp-block-group has-ast-global-color-4-background-color has-background\" style=\"border-style:dotted;border-width:1px;padding-top:10px;padding-right:10px;padding-bottom:10px;padding-left:10px\"><div class=\"wp-block-group__inner-container\">\n<h2>Keep Learning From Me:</h2>\n\n\n\n<ul><li><strong>Join my&nbsp;<a href=\"https://kavita-ganesan.com/blog\">AI Integrated newsletter</a>,&nbsp;</strong>which clears the AI confusion and teaches you how to successfully integrate AI to achieve profitability and growth in your business.</li><li><strong>Read&nbsp;&nbsp;<a href=\"http://amazon.aibusinesscasebook.com/?utm_source=newsletter&utm_medium=email&utm_campaign=why_starting_without_ai_improves_outcomes_even_if_ai_is_your_goal&utm_term=2022-08-19\" target=\"_blank\" rel=\"noreferrer noopener\">The Business Case for AI</a></strong>&nbsp;to learn applications, strategies, and best practices to be successful with AI (select companies using the book: government agencies, automakers like Mercedes Benz, beverage makers, and e-commerce companies such as Flipkart).</li></ul>\n</div></div>\n\n\n\n<p></p>\n\n\n\n<p></p>\n",
  "wfw:commentRss": "https://kavita-ganesan.com/machine-learning-training-data-generation/feed/",
  "slash:comments": 0,
  "post-id": 6039
}