{
  "id": "tag:blogger.com,1999:blog-4371296950668142214.post-3135096470596184759",
  "published": "2021-02-09T09:00:00.005+11:00",
  "updated": "2021-02-12T13:28:53.776+11:00",
  "title": "Wear a mask, wash your hands, don’t reuse your password!",
  "content": "Parenting was especially challenging in 2020. Our families needed to learn new habits like social distancing, wearing masks and frequently washing our hands. As a large part of our everyday lives moved online, it was necessary to teach our children to take extra precautions as well.&nbsp;<div>Parents have always been concerned for the digital safety of their families, and with online learning becoming the main mode of school for many, this might be even more of a concern. So we worked with our Trust and Safety Research team to survey parents all over Asia-Pacific, including here in Australia, and found that parents with children attending school online were more concerned about online safety than those whose children attended school in-person.&nbsp;</div><div>As we moved to home working and learning, and children continued their education through digital means, 47% of Aussie parents expressed increased concern about online safety for their children. But interestingly, more than a third of parents interviewed said they had never spoken to their children about online safety, and only half of those interviewed said they were currently using online family safety features.&nbsp;</div><div>As kids of different ages use the internet in very different ways, instilling safe habits can be a challenge. So today, on Safer Internet Day, here are some tips to address the top three parental concerns when it comes to keeping our children safe online.&nbsp;</div><div><b><br /></b></div><div><b>1.&nbsp;Protect their digital identities.</b>&nbsp;</div><div>The privacy and security of their children’s information was the top concern of parents we surveyed across all regions. Parents cited concerns around scams or hacking of their child’s accounts. Here are some simple ways to safeguard your kids’ information:&nbsp;</div><div><ul style=\"text-align: left;\"><li>Teach your children how to choose strong passwords that cannot be easily guessed. Avoid simple passwords that use names, birthdates, or even favourite cartoon characters.&nbsp;</li><li>&nbsp;It is also useful to stick to platforms that have a strong reputation for user safety. For instance, using an email service like Gmail comes with built-in safety filters to detect phishing emails, blocking 99.9% of phishing attacks from ever reaching your inbox.&nbsp;</li></ul><b><div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-RF2j3xu0zQo/YCXnXRR-fkI/AAAAAAAACvI/F6pj3fdTSaMrhpFuMwmd-WWSzmtPL3L1gCLcBGAsYHQ/s2048/SID-APAC.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"2048\" data-original-width=\"1424\" height=\"640\" src=\"https://1.bp.blogspot.com/-RF2j3xu0zQo/YCXnXRR-fkI/AAAAAAAACvI/F6pj3fdTSaMrhpFuMwmd-WWSzmtPL3L1gCLcBGAsYHQ/w445-h640/SID-APAC.png\" width=\"445\" /></a></div><b><br /></b></div>2. Know who they talk to.</b>&nbsp;</div><div>Social isolation is a difficult outcome of the COVID-19 pandemic, and our children connect with their friends online, whether through messaging apps or voice chat while playing games. It is important for parents to be aware that these channels can also be used by ill-intentioned strangers to reach out to our children. Just as in real life, it is important to be aware of who our children talk to online.&nbsp;</div><div><ul style=\"text-align: left;\"><li>Try to talk to your kids about the games they play or the videos they watch, and also the people they play with online. I always remind my son to come to me immediately if he faces any situation online that makes him feel uncomfortable. More than 70% of parents in Asia-Pacific were not very confident that their children would come to them if they encountered unsafe situations online. Considering more than a third of the parents we interviewed had never spoken to their children about online safety we need to work hard to reassure our children that we are here to guide and protect them.&nbsp;</li><li>When assessing if a game is suitable for your child, it is important to check not only the content of the game, but also whether the app allows online communications with others. Some multiplayer games allow only a few options for social interaction, like a thumbs up rather than a text chat. This reduces risks of unwanted social interactions by quite a lot.&nbsp;</li></ul></div><div><br /></div><div><b>3. Offer appropriate content at the appropriate age.</b>&nbsp;</div><div>The fear of children encountering inappropriate content has long been among the top concerns of parents in surveys. There are family safety features that parents can use to help guard their children from content that may not be suitable for their age. However, we learned that only 50% of Aussie parents we surveyed are using these features. Here are some features that you can start using today:&nbsp;</div><div><ul style=\"text-align: left;\"><li><a href=\"https://support.google.com/websearch/answer/510?hl=en&amp;ref_topic=3425457\">Turning on SafeSearch on Google</a> helps filter out explicit content in Google’s search results for all searches, including images, videos and websites. SafeSearch is designed to help block explicit results like pornography from Google search results.&nbsp;</li><li>Manage your child’s device by creating a <a href=\"https://support.google.com/families/answer/7103338\">Google account for your child and using Family Link</a>. This allows you to add filters on Google Search, block websites or only give access to the ones you allow or track the location of your child if they have their own device.&nbsp;</li><li>Many <a href=\"https://www.youtube.com/kids/parent-resources/\">parental controls are available on YouTube Kids</a>. You are able to limit screen time, only show videos that you approve or select suitable content based on the age of your child.&nbsp;</li></ul>Some other time-tested tips include allowing children to use the internet only in common areas in the home such as the living room. But the tough part is leading by example!&nbsp;</div><div><br /></div><div>At the end of the day, the core of parenting lies in the relationships we build with our children. They require our guidance on the internet as much as they do in the real world.&nbsp;</div><div>Let’s work together to make the internet a safe place for our children to learn, create and explore.&nbsp;</div><div><br /></div><div><span class=\"byline-author\">Posted by Samantha Yorke, Online Safety Lead, Government Affairs and Public Policy</span><span data-about-syndication=\"\" style=\"display: none; font-size: 0px; line-height: 0; max-height: 0px; overflow: hidden;\"> <!--INSTRUCTIONS   In order to support google.com/about site blog syndication, fill in the info below (after the example). Leave elements empty if there is no valid data.    Example:   <span class=\"post-image\">http://1.bp.blogspot.com/-mX0dxJxp8dg/Vo8MSdxypWI/AAAAAAAARsI/EjaFhvgAEgc/s1600/Beutler_Google_Giftwrap_-v2TW.png</span>  <span class=\"post-author-name\">Abbi Tatton</span>  <span class=\"post-author-title\">Editorial Elf</span>  <span class=\"post-author-team\">Google</span>--> <span class=\"post-image\"></span><span class=\"post-author-name\"></span><span class=\"post-author-title\"></span><span class=\"post-author-team\"></span></span></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "anzprteam",
    "uri": "http://www.blogger.com/profile/06099752084931732403",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}