{
  "published": "2022-11-05T09:00:00-04:00",
  "updated": "2022-11-05T09:00:00-04:00",
  "title": "Matter is here, but it’s still a long road to the simple smart home",
  "content": "<figure>\n      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/J3dsPXVXVdqsorjnKlnW9ddTLw0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/71588234/226392_Matter_event_JTuohy_0006.0.jpg\" />\n        <figcaption><em>A Matter QR code on an Eve Energy smart plug. To pair a device to a Matter app, you’ll just need to scan this code.</em></figcaption>\n    </figure>\n\n  <p class=\"p--has-dropcap p-large-text\" id=\"7q16Ys\">At the official <a href=\"https://www.theverge.com/2022/11/3/23438304/matter-launch-event-smart-home-amsterdam-announcements\">launch event for Matter this week</a>, I saw a lot of exciting things: a Google Nest Hub controlling an Eve Energy smart plug; a Wiz light bulb working with Apple Home; a Yale smart lock talking to a SmartThings hub over Thread. None of these things were possible before <a href=\"https://www.theverge.com/22787729/matter-smart-home-standard-apple-amazon-google\">Matter</a>. And all of these things worked well in their demos using voice, app, and other smart home control interfaces — even in the interference hell of a mini-trade show floor.</p>\n<p id=\"cJqjGN\">But I also saw that Matter has a long way to go before it fully delivers on its promise of an interoperable and simple smart home. A phrase I heard a lot throughout the two-day event was, “Matter is a journey,” followed by, “This is just the beginning.”</p>\n<p id=\"QzOcUM\">In the short term, don’t expect to be using Matter in your home reliably until early next year. Too many companies have yet to fully implement Matter support despite having had a lot of time to prepare. It’ll take even longer before you can just look for the Matter logo on a box and confidently manage it seamlessly in your smart home.</p>\n<div class=\"c-wide-block\">  <figure class=\"e-image\">\n        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/I7e7falCt2I4ScuS1N-jZwWH5kY=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/24168431/226392_Matter_event_JTuohy_0005.jpg\">\n      <figcaption><em>This new Thread Netatmo Security Sensor — a motion and contact sensor — shown at the event is the first product we’ve seen with the Matter logo. But it won’t be available until next year.</em></figcaption>\n  </figure>\n</div>\n<h2 id=\"2retaQ\">More Matter controllers please</h2>\n<p id=\"4xSXKM\">The initial problem is Matter controllers. By my count we only have three that are certified and have been updated to support Matter. You need a Matter controller to pair devices to Matter and to control them over Matter. </p>\n<p id=\"LsdWKg\">Matter is an application layer standard, meaning it sits over an existing protocol. There are two protocols to start with: Matter-over-Wi-Fi and Matter-over-Thread. Plus, Matter-over-Ethernet/Bridge will bring devices attached to a bridge (like Philips Hue Zigbee bulbs) into Matter.  </p>\n<p id=\"vbUm5h\">A Matter controller can support one, two or all of these. Right now, Apple’s controllers (the HomePod Mini and some Apple TV models) can do all three, and Samsung’s SmartThings hub (v2 and v3) can do Matter-over-Wi-Fi and Matter-over-Thread. </p>\n<div class=\"c-wide-block\"><aside id=\"ZzeOcN\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"We’re getting our first look at Matter devices today, and here’s what’s coming next&amp;nbsp;\",\"url\":\"https://www.theverge.com/2022/11/3/23438304/matter-launch-event-smart-home-amsterdam-announcements\"},{\"title\":\"Amazon announces a phased rollout of Matter to its Alexa smart home platform\",\"url\":\"https://www.theverge.com/2022/11/3/23438286/amazon-matter-support-alexa-echo-smart-home-platform\"}]}'></div></aside></div>\n<p id=\"A6Uv9t\">Amazon says it will <a href=\"https://www.theverge.com/2022/11/3/23438286/amazon-matter-support-alexa-echo-smart-home-platform\">only be launching its Matter-over-Wi-Fi controllers</a> this year, and Google hasn’t said anything about when it will update its Nest speakers, hubs and routers to be Matter controllers. </p>\n<p id=\"xs4nV4\">Additionally, the current Alexa, SmartThings, and Google Home apps on iOS do not work with Matter. And, based on the timelines the companies have given, they won’t until next year. So, if you have an iPhone, the only option you have for using Matter this year is the Apple Home app. </p>\n<div class=\"c-float-left c-float-hang\">  <figure class=\"e-image\">\n        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/5K_MBmsjUpRWcAYT_RzoIIHwnqw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/24168433/226392_Matter_event_JTuohy_0007.jpg\">\n      <figcaption><em>The Matter device pairing screen on a Pixel smartphone. The process should be similar on the other platforms.</em></figcaption>\n  </figure>\n</div>\n<p id=\"CgU6AH\">Without the basic controller and app infrastructure in place, Matter’s not really here yet. So what is the holdup? Twan Kamp, director of engineering at Signify, which owns Hue, put it best when I asked him why we have to wait until next year for the <a href=\"https://www.theverge.com/2022/11/3/23438437/philips-hue-bridge-matter-certified-smart-home-update\">newly Matter-certified Hue Bridge</a> to work with Matter. “It’s a bit of a chicken-and-egg problem,” he said. “We’re waiting for them, and they’re waiting for us.” Platforms want to make sure devices work before they update their controllers, but devices need controllers to test on.</p>\n<h2 id=\"8gFxd6\">Thread routers aren’t ready</h2>\n<p id=\"Wi8MpC\">In the near term, there are some problems around <a href=\"https://www.theverge.com/2022/7/19/23269460/thread-1-3-0-matter-border-routers-homepod-mini-echo-nest\">Thread border routers</a> — the device that links a <a href=\"https://www.theverge.com/23165855/thread-smart-home-protocol-matter-apple-google-interview\">Thread network</a> to the other IP-based networks that work with Matter, like Wi-Fi and Ethernet. </p>\n<p id=\"SDMFd9\">There aren’t enough of them yet, and only Apple’s and SmartThings’ are Matter certified. Thread is a key part of Matter, and while there aren’t many Thread devices yet, they are coming. (<a href=\"https://www.theverge.com/2022/11/3/23436125/nanoleaf-essentials-matter-over-thread-light-bulbs-price\">Nanoleaf announced the first Thread-over-Matter lightbulbs</a> this week, and <a href=\"https://www.theverge.com/2022/11/3/23438752/level-locks-thread-matter-firmware-update-google-samsung\">Level Home</a> has said its locks will get updated to Thread).</p>\n<div class=\"c-wide-block\"><aside id=\"R30KIE\"><div data-anthem-component=\"readmore\" data-anthem-component-data='{\"stories\":[{\"title\":\"Thread is Matter’s secret sauce for a better&amp;nbsp;smart home\",\"url\":\"https://www.theverge.com/23165855/thread-smart-home-protocol-matter-apple-google-interview\"},{\"title\":\"Matter: what you need to know \",\"url\":\"https://www.theverge.com/23390726/matter-smart-home-faq-questions-answers\"}]}'></div></aside></div>\n<p id=\"537dcR\">You need a Thread border router to use a Thread device. The big promise of Matter — that if you buy a device and plug it in, it will just work and work with everything in your home — will not be true if you don’t have a working Thread border router in your home.</p>\n<p id=\"9Rcqk2\">The holdup is that Apple, Google, Samsung, and Amazon (who have all promised us border routers) need to share credentials with each other so that you only end up with one all-inclusive Thread network in your home and not two or three competing ones.</p>\n<div class=\"c-wide-block\">  <figure class=\"e-image\">\n        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/FzU4WbkJu4DYQmKI63z0q1g6tLg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/24168429/226392_Matter_event_JTuohy_0003.jpg\">\n      <figcaption><em>The Eve booth had four potential Thread border routers in action (the SmartThings hub was under the table). The Thread radios in the Nest Hub and Echo haven’t been turned on yet.</em></figcaption>\n  </figure>\n</div>\n<p id=\"UoiwRC\">So far, only Amazon and Samsung have announced that they’re working together on this (just working on it, not that it’s here). “We all want Thread to be an infrastructure in the home. It will happen,” Samsung SmartThings director of product Mark Tekippe told me when I asked about the delay. “It just takes time. There’s a lot of pieces to figure out.” It’s a long, winding road.</p>\n<h2 id=\"dW54gt\">Partners still need to play nice</h2>\n<p id=\"TQgVAO\">All this makes me feel like cracks are starting to appear in the united front we’ve seen from the big players up to this point. Now that they have to work directly with each other to make the user experience better, cabals are starting to form. </p>\n<p id=\"XhLxF6\">Samsung and Google announced they’re <a href=\"https://www.theverge.com/2022/10/12/23398987/google-matter-samsung-smartthings-multi-admin-partnership\">working together on a better form of multi-admin</a>. (<a href=\"https://csa-iot.org/newsroom/all-about-choice-multi-admin-in-matter-gives-users-more-flexibility-and-unlocks-smart-home-innovation/\">Multi-admin</a> will let you operate any device with any voice assistant or smartphone app of your choice). Their “extra” features will let you add all your Matter devices to each platform simultaneously, rather than having to individually add them — as is the current flow.</p>\n<p id=\"hTOq3S\">Amazon and Samsung have <a href=\"https://www.theverge.com/2022/11/3/23438286/amazon-matter-support-alexa-echo-smart-home-platform\">announced a similar partnership</a>. But Amazon hasn’t said it's doing this with Google, and Apple doesn’t seem to be working with anyone on “better” multi-admin. At least not that the company’s revealed and when I asked, Apple wouldn’t provide anyone to speak on the record.</p>\n<div class=\"c-wide-block\"><div id=\"32HRqe\">\n<div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Matter Multi-Admin Apple Home|109597\" data-volume-uuid=\"0330cb5f6\" data-volume-id=\"109597\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"true\" id=\"volume-placement-300\" class=\"volume-video\"></div>\n<div class=\"caption\"><em>A demo of Eve Energy working over Thread and how you will share a device from the Apple Home app to another Matter-enabled platform.</em></div>\n</div></div>\n<p id=\"9m8aaC\">We may also have to wait for these types of partnerships to get better experiences when using Matter devices. I was shown several demos of how you will share a Matter-enabled device to a platform after you’ve paired it with another. While it doesn’t seem to be a bad experience, there are times when it may involve cutting and pasting a code from one app to another. Somehow that feels wrong in 2022.</p>\n<p id=\"qM6ZlZ\">What was also disappointing to see is that the device shows up in the new platform as if it had never been set up before. So, “Vanity” in “Bathroom” in Apple Home, for example, will show up as “Light Bulb 1” in the Amazon Alexa app, essentially making you set it up all over again (see the video below).</p>\n<div class=\"c-wide-block\"><div id=\"ua46Pn\">\n<div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Matter Multi-Admin Google SmartThings Alexa|109598\" data-volume-uuid=\"8d1ab3b06\" data-volume-id=\"109598\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"true\" id=\"volume-placement-674\" class=\"volume-video\"></div>\n<div class=\"caption\"><em>A video of sharing a device from SmartThings to Google Home using the basic multi-admin feature.</em></div>\n</div></div>\n<p id=\"8TBARv\">Plus, once it’s in the separate apps, if you change its name or location in one app, that won’t be reflected in the other app, according to Chris LaPré, head of technology at the CSA. </p>\n<p id=\"eWXmga\">He also told me that the CSA had wanted to add this type of functionality but the platform makers pushed back. What we have today “Is what the members agreed to,” he said. Back to that journey idea, though, LaPré says that doesn’t mean it won’t happen in a future update or with future cooperation between platforms.</p>\n<div class=\"c-wide-block\"><div class=\"c-image-grid\">\n<div class=\"c-image-grid__item\">  <figure class=\"e-image\">\n        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/2t-iIJbIPvypLHSFZd3OlIB-99o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/24168434/226392_Matter_event_JTuohy_0008.jpg\">\n      <figcaption><em>A prototype of the new Thread-based Aqara P2 Door &amp; Window Sensor was part of an NXP demo at the Matter event. </em></figcaption>\n  </figure>\n</div>\n<div class=\"c-image-grid__item\">  <figure class=\"e-image\">\n        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/RdQkp_Yzp6IBGG-vt--GM57XQOI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/24168428/226392_Matter_event_JTuohy_0002.jpg\">\n      <figcaption><em>The new Nanoleaf Essentials Light Strip with Matter over Thread. It looks identical to the existing product but will work with Matter.</em></figcaption>\n  </figure>\n</div>\n</div></div>\n<h2 id=\"Teft8i\">More device categories may mean more problems</h2>\n<p id=\"ufXtKp\">In the longer term, once (and if) these issues are ironed out, it’s clear more will crop up as we move beyond the fairly simple devices categories of light bulbs, switches, and door locks into more complicated categories like cameras, robot vacuums, home appliances, and Wi-Fi routers (part of the new device types coming next that <a href=\"https://www.theverge.com/2022/11/3/23438304/matter-launch-event-smart-home-amsterdam-announcements\">were announced at the event</a>). </p>\n<div class=\"c-float-left c-float-hang\">  <figure class=\"e-image\">\n        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/cSxOCKL9iF6TAE0StcCEzhqq8qA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/24168435/226392_Matter_event_JTuohy_0009.jpg\">\n      <figcaption><em>The Schlage Encode Plus lock on display in the SI Labs booth. It was damaged in transit, so it wasn’t working, but it’s a sign that the Thread-enabled lock is getting Matter.</em></figcaption>\n  </figure>\n</div>\n<p id=\"Br9n2K\">Additionally, I heard nothing about where audio-streaming from speaker companies like Sonos and Bose fits into the Matter roadmap. (There is a <a href=\"https://www.theverge.com/2021/12/9/22824559/matter-tv-streaming-devices-smart-home-casting-protocol-support\">Matter casting feature</a> in the specification). While I was told the topic has been discussed within the Alliance, there’s no formal working group currently attempting to make it a part of the Matter specification. </p>\n<p id=\"TNMnlP\">We are also not saying goodbye to bridges and hubs anytime soon. There may be a future where we no longer need to connect white boxes to our routers to make our smart homes work, but if you want to use the products already in your home, in most cases, a bridge or hub will be the way to bring it into Matter.</p>\n<p id=\"4OJjlX\">Honestly, I don’t mind this. We need bridges in Matter to make it easy to bring your existing devices into this new smart home. Hue’s demo had a smart bulb from 2012 working with Matter through the Hue bridge, and <a href=\"https://www.theverge.com/23420136/ikeas-dirigera-smart-home-review-price-specs\">Ikea</a> and <a href=\"https://www.theverge.com/2022/11/3/23436897/aqara-matter-dates-update-hub-m3-thread\">Aqara</a> announced that their hubs and bridges will bring existing products into Matter, too. Ten-year-old technology needs to be part of Matter just as much as the shiny new thing that will be released next month.</p>\n<h2 id=\"nVC5zy\">Matter works and it works well</h2>\n<p id=\"gkbY8M\">Speaking of shiny new things, while I was disappointed not to see a lot of new products at the event, it was encouraging to see plenty of existing products that will get Matter upgrades. </p>\n<p id=\"Ye8Wz6\">Those included an Eve Energy smart plug, a Schlage Encode Plus lock, a TCL television, and an Echo speaker, all there to demo how they will work with Matter. I was able to use many of these devices — and more — in the demos. In large part, everything worked smoothly and very quickly.</p>\n<div class=\"c-float-left c-float-hang\"><aside id=\"rXo6U7\"><q>Ten-year-old technology needs to be part of Matter just as much as the shiny new things.</q></aside></div>\n<p id=\"ZTqS05\">A Yale Assure Lock 2 unlocked within two seconds of tapping the Good Night routine icon on the Galaxy smartwatch. It was running on Thread over a SmartThings Aeotec hub. Raising the Eve blinds using a Hue Smart Dimmer Switch paired to a Matter-enabled Hue Bridge through a Thread border router (an Apple TV) was also super fast. And controlling three Wiz smart lights using the Apple Home app with Matter-over-Wi-Fi worked in under a second. </p>\n<p id=\"4Kpall\">The slowest demo I saw was the Echo fourth-gen speaker controlling five different lights across different protocols using Matter over Wi-Fi. The lights popped on randomly over a few seconds. The Matter-over-Thread demo on an Echo fourth-gen with Thread enabled was much faster. But that integration won’t be live until next year.</p>\n<div class=\"c-wide-block\">  <figure class=\"e-image\">\n        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/KtdU197-Gzdv30TW_sFGc1u43Wk=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/24168430/226392_Matter_event_JTuohy_0004.jpg\">\n      <figcaption><em>I was able to control non-Apple Home compatible Wiz light bulbs with the Apple Home app using Matter-over-Wi-Fi.</em></figcaption>\n  </figure>\n</div>\n<p id=\"KVo4bm\">The Wiz demo working with Apple Home and Google Assistant was one of the few examples of a completely new integration enabled by Matter. Most everything else I saw could already be done in some fashion — although it would involve more steps and possibly more hardware to get it set it up than it will with Matter. </p>\n<p id=\"4soE59\">Wiz — <a href=\"https://www.signify.com/global/our-company/news/press-releases/2022/20221103-wiz-smart-lighting-platform-first-support-matter-standard#:~:text=All%20new%20WiZ%20smart%20lighting,part%20of%20the%20Matter%20ecosystem.\">a smart lighting line owned by Signify</a> — has never worked with Apple Home. But with Matter-over-Wi-Fi coming to its line with a firmware update by the end of the year, according to Danny Lousberg head of product management at Signify, these inexpensive, color-changing bulbs can be added to Apple Home through Matter.</p>\n<h2 id=\"xke8E3\">Matter does matter</h2>\n<p id=\"cPyvyi\">It’s clear that Matter is not going to solve all the problems of the smart home in the next few years. It may not solve any in the next six months (the CSA said it’s targeting spring and fall updates annually). </p>\n<p id=\"JL2EvS\">But it was also clear from this event that once the underlying infrastructure is fully in place, Matter will make it easier for manufacturers to build better smart home devices and for platforms to create better smart home experiences. And that is really what will put the industry on the right road to the simple, interoperable smart home. </p>\n<p class=\"c-end-para\" id=\"5zwkjb\">It’s going to be a journey, folks. Let’s just hope it’s not too wild of a ride.</p>\n<p id=\"FlZlp9\"><em>Photos and video by Jennifer Pattison Tuohy / The Verge</em></p>",
  "link": "",
  "id": "https://www.theverge.com/23440189/matter-launch-event-hands-on-rollout",
  "author": {
    "name": "Jennifer Pattison Tuohy"
  }
}