{
  "title": "Collaborative Honeypot Defense in UAV Networks: A Learning-Based Game Approach. (arXiv:2211.01772v1 [cs.SY])",
  "link": "http://arxiv.org/abs/2211.01772",
  "description": "<p>The proliferation of unmanned aerial vehicles (UAVs) opens up new\nopportunities for on-demand service provisioning anywhere and anytime, but also\nexposes UAVs to a variety of cyber threats. Low/medium interaction honeypots\noffer a promising lightweight defense for actively protecting mobile Internet\nof things, particularly UAV networks. While previous research has primarily\nfocused on honeypot system design and attack pattern recognition, the incentive\nissue for motivating UAV's participation (e.g., sharing trapped attack data in\nhoneypots) to collaboratively resist distributed and sophisticated attacks\nremains unexplored. This paper proposes a novel game-theoretical collaborative\ndefense approach to address optimal, fair, and feasible incentive design, in\nthe presence of network dynamics and UAVs' multi-dimensional private\ninformation (e.g., valid defense data (VDD) volume, communication delay, and\nUAV cost). Specifically, we first develop a honeypot game between UAVs and the\nnetwork operator under both partial and complete information asymmetry\nscenarios. The optimal VDD-reward contract design problem with partial\ninformation asymmetry is then solved using a contract-theoretic approach that\nensures budget feasibility, truthfulness, fairness, and computational\nefficiency. In addition, under complete information asymmetry, we devise a\ndistributed reinforcement learning algorithm to dynamically design optimal\ncontracts for distinct types of UAVs in the time-varying UAV network. Extensive\nsimulations demonstrate that the proposed scheme can motivate UAV's cooperation\nin VDD sharing and improve defensive effectiveness, compared with conventional\nschemes.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Wang_Y/0/1/0/all/0/1\">Yuntao Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Su_Z/0/1/0/all/0/1\">Zhou Su</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Benslimane_A/0/1/0/all/0/1\">Abderrahim Benslimane</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Xu_Q/0/1/0/all/0/1\">Qichao Xu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Dai_M/0/1/0/all/0/1\">Minghui Dai</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Li_R/0/1/0/all/0/1\">Ruidong Li</a>"
}