{
  "title": "S1E28 - When Your Passion Becomes Your Way of Life with Olympic Swimmer Cammile Adams",
  "guid": "https://pinecast.com/guid/4eb49fc9-5e35-422b-9f74-9bcaa66f14dd",
  "pubDate": "Tue, 15 Dec 2020 07:30:00 -0000",
  "itunes:duration": "01:07:05",
  "description": "<p>Laura is very excited to welcome two-time Olympic swimmer, Cammile Adams, to the podcast today. Originally from Houston, Cammile started swimming at four years old, and went on to specialize in the 200m butterfly, eventually becoming a two-time NCAA Champion and seven-time NCAA All-American. She also competed for Team USA at the World Championships, earning a silver medal in 2015, and also represented her country at the London and Rio Olympics. Having retired from competitive swimming after Rio, Cammile currently runs a number of SafeSplash Swim Schools in and around Houston.\n \nIn this episode, Cammile describes her swimming career starting with her twin sister and her father at an early age, through her college, professional and Olympic experiences, and finishing with her dream job running her swim schools. Along the way she shares the influence her coaches and mentors have had upon her, her unique fly stroke, one of the darkest moments in her life, and the importance of building a ‘tribe’, of having wise counsel around, and of balancing life within and outside of the pool. She concludes the conversation with her valuable advice for young athletes, borne out of her vast amount of experience and earned wisdom. Fully evident throughout today’s episode is the idea that sports can teach a person so much about themselves and help them grow the skills necessary for life in general. Cammile Adams provides living proof of this fact, as her incredible learning journey, shared here today, clearly demonstrates.</p>\n<p>Episode Highlights:\n </p>\n<ul>\n<li>The USA House</li>\n<li>Cammile’s early start into swimming</li>\n<li>Competing with her twin sister</li>\n<li>The story of Cammile and Ashley’s college recruitment</li>\n<li>The influence of her coaches and mentors</li>\n<li>Cammile’s unique fly stroke</li>\n<li>Her college experience</li>\n<li>The value of working on things ‘outside of your normal box’</li>\n<li>Her first Olympics</li>\n<li>Moments in life where ‘your tribe’ speak truth to you</li>\n<li>One of the darkest moments in Cammile’s life</li>\n<li>The importance of having wise counsel around you</li>\n<li>Balancing life outside of the pool and in the pool</li>\n<li>The transition to going pro</li>\n<li>The road to her 2016 Olympics</li>\n<li>Her 2016 Olympics experience</li>\n<li>Cammile’s SafeSplash Swim Schools</li>\n<li>Cammile’s advice for young athletes</li>\n</ul>\n<p>Quotes:\n </p>\n<ul>\n<li>“I’ve actually never played another sport.”</li>\n<li>“Ashley really swam for the friends.”</li>\n<li>“I think I learned more about the person I want to be from Steve, than, like, the swimmer I want to be…he did truly change my life.”</li>\n<li>“Sports isn’t just about sports.”</li>\n<li>“I think shoulder surgery may be one of the best things that happened to my swimming career.”</li>\n<li>“This is not always a fun, comfortable feeling to be in, but this is an opportunity.”</li>\n<li>“I got to become a student of the sport of swimming and that was my entire focus.”</li>\n<li>“Think about what you can do outside of the water to make yourself better in the water.”</li>\n<li>“I needed to figure out how to fight through.”</li>\n<li>“I also just truly believed that it was an absolute privilege to swim for Texas A&M.”</li>\n<li>“Not letting the highs be too high and the lows be too low…within life and within sport.”</li>\n<li>“One of these is not like the others.”</li>\n<li>“It made me to be very aware of my emotions.”</li>\n<li>“You have all these, almost like, end of life kind of thoughts…it’s very real stuff.”</li>\n<li>“No one had warned me that that feeling was coming.”</li>\n<li>“I needed that, like, roundhouse kick in the face – grow up!”</li>\n<li>“How much growth I had made, not only in the sport, but also personally…2015 was just a really special summer for me…all the parts were just aligned.”</li>\n<li>“You train your entire life for this, and then it’s gone within seconds.”</li>\n<li>“It’s one of those ways, like, God teaches you to deal with adversity.”</li>\n<li>“It was such a hard lesson for me, I think.”</li>\n<li>“It was just like the perfect life balance that I needed.”</li>\n<li>“This is my dream job, and I have it at, you know, 27 years old…and I honestly can’t imagine ever doing anything else.”</li>\n<li>“If you fail to prepare, you are preparing to fail…a statement that I live by.”</li>\n</ul>\n<p>Links:\nThe Pursuit of Gold homepage: <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">  http://thepursuitofgold.com/</a> \nMental Training: <a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">  https://www.laurawilkinson.com/learn </a>\nLaura’s Social Media:\nInstagram: <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">https://www.instagram.com/lala_the_diver</a>  \nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">https://www.facebook.com/TheLauraWilkinson</a> \n \nConnect with Cammile:\nSafeSplash Swim School:  <a href=\"https://www.safesplash.com/\" rel=\"nofollow\"> https://www.safesplash.com/</a>\nCammile’s Instagram:  <a href=\"https://www.instagram.com/cammileadams/\" rel=\"nofollow\"> https://www.instagram.com/cammileadams/</a></p>",
  "itunes:title": "When Your Passion Becomes Your Way of Life with Olympic Swimmer Cammile Adams",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 28
}