{
  "id": "yt:video:g3vf0I_j9kk",
  "yt:videoId": "g3vf0I_j9kk",
  "yt:channelId": "UCX6b17PVsYBQ0ip5gyeme-Q",
  "title": "How the Environment Affects Your Health: Crash Course Public Health #3",
  "link": "",
  "author": {
    "name": "CrashCourse",
    "uri": "https://www.youtube.com/channel/UCX6b17PVsYBQ0ip5gyeme-Q"
  },
  "published": "2022-08-18T17:00:23+00:00",
  "updated": "2022-08-22T06:15:29+00:00",
  "media:group": {
    "media:title": "How the Environment Affects Your Health: Crash Course Public Health #3",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "There is no denying the effect that our environment has on us. Things like water and air pollution are detrimental to our health. In this episode of Crash Course Public Health, we’ll take a look at some of the ways our environment impacts us, why marginalized and low-income populations are disproportionately exposed to environmental pollution, and what we can do about it.\n\nCheck out our shared playlist with APHA: https://www.youtube.com/playlist?list=PLDjqc55aK3kywF2dd97_Jh5iP0d2ARhdo \n\nVanessa’s channel: https://www.youtube.com/braincraft \n\nTranscript: https://docs.google.com/document/d/1nr2bGvV_5mHgZFDEtKziDIlKo931U74Ab744ppcqNmE/edit?usp=sharing \nSources: https://docs.google.com/document/d/1OHJiQ1njj5jWJC1YLDBzQgKC1QfnVgqJbbpK6qs7ekA/edit?usp=sharing\n\nChapters:\nIntroduction: The Environment and Your Health 00:00\nDefining our Environment 2:09\nAir Pollution 3:43\nWater Pollution 6:27\nThe Neighborhood Factor 8:11\nEnvironmental Justice 11:59\nClimate Change 12:11\nReview & Credits 13:28\n\n***\nWatch our videos and review your learning with the Crash Course App! \nDownload here for Apple Devices: https://apple.co/3d4eyZo\nDownload here for Android Devices: https://bit.ly/2SrDulJ\n\nCrash Course is on Patreon! You can support us directly by signing up at http://www.patreon.com/crashcourse\n\nThanks to the following patrons for their generous monthly contributions that help keep Crash Course free for everyone forever:\nKatie, Hilary Sturges, Austin Zielman, Tori Thomas, Justin Snyder, daniel blankstein, Hasan Jamal, DL Singfield, Amelia Ryczek, Ken Davidian, Stephen Akuffo, Toni Miles, Steve Segreto, Michael M. Varughese, Kyle & Katherine Callahan, Laurel Stevens, Michael Wang, Stacey Gillespie (Stacey J), Burt Humburg, Allyson Martin, Aziz Y, Shanta, DAVID MORTON HUDSON, Perry Joyce, Scott Harrison, Mark & Susan Billian, Junrong Eric Zhu, Alan Bridgeman, Rachel Creager, Breanna Bosso, Matt Curls, Tim Kwist, Jonathan Zbikowski, Jennifer Killen, Sarah & Nathan Catchings, team dorsey, Trevin Beattie, Divonne Holmes à Court, Eric Koslow, Jennifer Dineen, Indika Siriwardena, Jason Rostoker, Shawn Arnold, Siobhán, Ken Penttinen, Nathan Taylor, Les Aker, William McGraw, ClareG, Rizwan Kassim, Constance Urist, Alex Hackman, Jirat, Pineapples of Solidarity, Katie Dean, NileMatotle, Wai Jack Sin, Ian Dundore, Justin, Mark, Caleb Weeks\n__\n\nWant to find Crash Course elsewhere on the internet?\nFacebook - http://www.facebook.com/YouTubeCrashCourse\nTwitter - http://www.twitter.com/TheCrashCourse\nInstagram - https://www.instagram.com/thecrashcourse/\n\nCC Kids: http://www.youtube.com/crashcoursekids",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}