{
  "title": "A Round and Bipartize Approximation Algorithm for Vertex Cover. (arXiv:2211.01699v1 [cs.DS])",
  "link": "http://arxiv.org/abs/2211.01699",
  "description": "<p>The vertex cover problem is a fundamental and widely studied combinatorial\noptimization problem. It is known that its standard linear programming\nrelaxation is integral for bipartite graphs and half-integral for general\ngraphs. As a consequence, the natural rounding algorithm based on this\nrelaxation computes an optimal solution for bipartite graphs and a\n$2$-approximation for general graphs. This raises the question of whether one\ncan obtain improved bounds on the approximation ratio, depending on how close\nthe graph is to being bipartite.\n</p>\n<p>In this paper, we consider a round-and-bipartize algorithm that exploits the\nknowledge of an induced bipartite subgraph to attain improved approximation\nratios. Equivalently, we suppose that we have access to a subset of vertices\n$S$ whose removal bipartizes the graph.\n</p>\n<p>If $S$ is an independent set, we prove an approximation ratio of $1 +\n1/\\rho$, where $2\\rho -1$ denotes the odd girth of the contracted graph\n$\\tilde{\\mathcal{G}} := \\mathcal{G} /S$ and thus satisfies $\\rho \\geq 2$. We\nshow that this is tight for any graph and independent set by providing a family\nof weight functions for which this bound is attained. In addition, we give\ntight upper bounds for the fractional chromatic number and the integrality gap\nof such graphs, both of which also depend on the odd girth.\n</p>\n<p>If $S$ is an arbitrary set, we prove a tight approximation ratio of\n$\\left(1+1/\\rho \\right) (1 - \\alpha) + 2 \\alpha$, where $\\alpha \\in [0,1]$\ndenotes the total normalized dual sum of the edges lying inside of the set $S$.\nAs an algorithmic application, we show that for any efficiently $k$-colorable\ngraph with $k \\geq 4$ we can find a bipartizing set satisfying $\\alpha \\leq 1 -\n4/k$. This provides an approximation algorithm recovering the bound of $2 -\n2/k$ in the worst case (i.e., when $\\rho = 2$), which is best possible for this\nsetting when using the standard relaxation.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Kashaev_D/0/1/0/all/0/1\">Danish Kashaev</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Schafer_G/0/1/0/all/0/1\">Guido Sch&#xe4;fer</a>"
}