{
  "title": "Software Turns Promise Up for Offshore Wind",
  "link": "https://spectrum.ieee.org/vertical-axis-wind-turbine",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/illustration-shows-two-versions-of-a-turbine-design-in-sun-and-in-stormy-weather.jpg?id=31179195&width=2000&height=1500&coordinates=0%2C0%2C0%2C1\"/><br/><br/><p><span style=\"background-color: initial;\">A radical new idea for offshore wind turbines would replace tall unwieldy towers that had blades on top with lightweight, towerless machines whose blades resemble the loops of a whisk. Now new software can help optimize these unusual designs to help make them a reality, researchers say.</span><br/></p><p>This new work comes as the U.S. government plans to boost <a href=\"https://spectrum.ieee.org/more-stagger-more-wind-power\" target=\"_self\">offshore wind energy</a>. In March, the White House announced <a href=\"https://www.energy.gov/articles/energy-secretary-granholm-announces-ambitious-new-30gw-offshore-wind-deployment-target\" target=\"_blank\">a national goal</a> to deploy 30 gigawatts of new offshore wind power by 2030. The federal government suggested this initiative could help power more than 10 million homes, support roughly 77,000 jobs, cut 78 million tonnes in carbon emissions, and spur US $12 billion in private investment per year. As part of this new plan, in <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2022/06/23/fact-sheet-biden-administration-launches-new-federal-state-offshore-wind-partnership-to-grow-american-made-clean-energy/\" rel=\"noopener noreferrer\" target=\"_blank\">June</a>, the White House and eleven governors from along the East Coast launched a Federal-State Offshore Wind Implementation Partnership to further develop the offshore wind supply chain, including manufacturing facilities and port capabilities.</p><p>One reason offshore wind is attractive is the high demand for electricity on the coasts. People often live far away from where onshore wind is the strongest, and there is not enough space in cities for enough solar panels to power them, says <a href=\"https://energy.sandia.gov/programs/renewable-energy/water-power/water-power-personnel/ryan-coe/\" rel=\"noopener noreferrer\" target=\"_blank\">Ryan Coe</a>, a mechanical engineer in Sandia National Laboratories’ water-power group in Albuquerque.</p><p class=\"pull-quote\">The guy wires can be shortened or lengthened to adjust the height of the blades in response to wind conditions, much as modifying the amount of tension in a bowstring can help change the curve of a bow.</p><p>However, nearly 60 percent of the accessible offshore wind in the United States blows across water more than 60 meters deep. At such depths, it would prove very expensive to build a foundation for wind turbines on the seafloor. However, this deeper offshore wind energy remains attractive, as it roughly equals the entire annual electricity consumption in the United States.<br/></p><p>Wind turbines that can float above the seafloor could help play a key role in renewable energy. However, floating offshore wind turbines face their own challenges, such as their cost.</p><p>“Floating offshore wind is currently estimated to be three to five times more expensive than land-based wind in the United States,” says mechanical engineer <a href=\"https://energy.sandia.gov/programs/renewable-energy/wind-power/wind-energy-staff/brandon-ennis\" target=\"_blank\">Brandon Ennis</a>, Sandia’s offshore wind technical lead in Albuquerque.</p><p>The aim of the U.S. Department of Energy’s <a href=\"https://spectrum.ieee.org/underwater-manta-kites-tidal-power-harvesting\" target=\"_self\">Advanced Research Project Agency–Energy</a>’s <a href=\"https://arpa-e.energy.gov/technologies/programs/atlantis\" target=\"_blank\">ATLANTIS</a> project is to optimize the design of floating offshore wind turbines to maximize their power while minimizing their expense. The new, towerless design might help reduce both their mass and cost, Ennis says.</p><p>When it comes to land-based wind power, the turbines themselves represent about 65 percent of their levelized cost of energy—that is, their lifetime costs divided by energy production. In comparison, when it comes to floating offshore wind power, the turbines represent only about 20 percent of their levelized costs, Ennis says. Instead, their floating platforms are the biggest factors behind these costs.</p><p>“Given this difference in contribution to the levelized cost of energy of the turbine itself, it makes sense that the turbine design for floating offshore wind could be radically different than what is optimal on land,” Ennis says.</p><p>Most land-based wind turbines nowadays are <a href=\"https://en.wikipedia.org/wiki/Wind_turbine#Types\" rel=\"noopener noreferrer\" target=\"_blank\">horizontal-axis machines</a>. They each possess a tower with blades that spin on a horizontal shaft, which cranks a generator behind the blades in the turbine’s nacelle, the box at the top of the turbine.</p><p>In contrast, the new design is a <a href=\"https://spectrum.ieee.org/are-vertical-axis-turbines-the-future-of-offshore-wind-power\" target=\"_self\">vertical-axis wind turbine</a> (VAWT). These can resemble <a href=\"https://en.wikipedia.org/wiki/Revolving_door\" rel=\"noopener noreferrer\" target=\"_blank\">revolving doors</a>—they each possess blades that spin on a vertical shaft, with a generator below the blades. Placing a wind turbine’s massive generator at the base of the machine instead of high up on a tower makes it much less top heavy, which reduces the size and cost of the floating platform needed to keep it afloat.</p><p>One challenge when it comes to VAWTs is protecting them from extreme winds. Traditional horizontal-axis wind turbines (HAWTs) can rotate away from intense, damaging winds, but previous VAWTs catch wind from every direction.</p><p>The new design replaces the central vertical tower often used in previous VAWTs with a set of taut wires. These wires can be shortened or lengthened to adjust the height of the blades in response to wind conditions, much as modifying the amount of tension in a bowstring can help change the curve of a bow.</p><p>This new design can help maximize each wind turbine’s energy capture while controlling strain. In addition, replacing the shaft with wires further reduces the weight of the turbine, allowing the floating platform to be significantly smaller and less expensive.</p><p>Previous VAWTs with towers often weighed more than HAWTs. In contrast, the new towerless design may weigh less than traditional HAWT designs, Ennis says.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A photograph looking skyward at a white tower with a large loop around it.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"13c97d001d3cb427c6607ae4f8c50082\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"b681c\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-photograph-looking-skyward-at-a-white-tower-with-a-large-loop-around-it.jpg?id=31179342&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">A historical photo shows Sandia’s experimental 34-meter-diameter vertical-axis wind turbine, built in Texas in the 1980s.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Randy Montoya/Sandia National Laboratories</small></p><p>Less mass above the water level requires less mass below the water level, leading to a lighter, cheaper platform, Ennis notes. “The optimal wind energy system would remove all mass and cost that is not directly capturing energy from the wind, and the towerless VAWT design concept moves toward that goal by reducing the turbine mass and the associated platform mass,” Ennis says. Sandia filed a patent application for the new design in 2020.</p><p>However, a key challenge with all VAWTs is how they were not the focus of research as the wind industry steadily grew for the past 30 years, Ennis says. As such, where HAWTs possess software to help in their design, VAWTS did not.</p><p>Now Sandia researchers have developed a new tool to model the way in which VAWTs and their floating platforms might respond to different wind and sea conditions. This new Offshore Wind Energy Simulator (<a href=\"https://arc.aiaa.org/doi/pdf/10.2514/1.J060476\" rel=\"noopener noreferrer\" target=\"_blank\">OWENS</a>) can help optimize the design and control of these machines.</p><p>“Without a tool like ours, there cannot be a floating offshore VAWT industry, and it has been exciting to see our team advance that capability in such a short time compared to the historical development of design tools in the wind industry,” Ennis says.</p><p>The OWENS tool can also simulate land-based VAWTs. Moreover, with some modifications, it can model unconventional HAWTs, such as <a href=\"https://newsroom.ucla.edu/releases/innovative-biplane-design-next-generation-wind-turbines\" rel=\"noopener noreferrer\" target=\"_blank\">bi-wing blades</a> or <a href=\"https://iopscience.iop.org/article/10.1088/1757-899X/1034/1/012042/meta\" rel=\"noopener noreferrer\" target=\"_blank\">shrouded concepts</a>, as well as cross-flow marine hydrokinetic turbines, which are essentially VAWTs submerged in water instead of air, Ennis says.</p><p>Popular misinformation does exist concerning VAWTs, Ennis says. “People claim that VAWTs have lower aerodynamic performance,” he says. “That’s wrong. Lift-based VAWTs are predicted to have the ability to slightly exceed the maximum efficiency of a horizontal-axis wind turbine.”</p><p>Ennis does note that “VAWTs that were commercialized in the ’90s had fatigue issues. They also used aluminum blades with bolted joints, which is almost the worst material decision you could make for fatigue, and the design standards weren’t sufficient to characterize the operational life of a wind turbine.” However, modern designs can overcome these concerns, he says.</p><p>The researchers are validating OWENS with a land-based 34-meter-diameter VAWT built at Sandia in the ’80s. This research can eventually help certify VAWT models against pertinent design standards. They plan to submit their findings to the journal <em>Wind Energy Science</em>.</p><p>The scientists hope to have an optimized floating VAWT design by the end of the year, Ennis says. They next aim to have a small physical demo machine to verify its performance.</p><p>“Vertical-axis wind turbines offer some meaningful advantages over traditional horizontal-axis wind turbines, particularly for floating offshore wind energy,” Ennis says. “With our new design software, we are in a good position to evaluate just how significant these advantages might be for our towerless VAWT system.”</p>",
  "pubDate": "Wed, 24 Aug 2022 19:25:08 +0000",
  "guid": "https://spectrum.ieee.org/vertical-axis-wind-turbine",
  "category": [
    "Offshore wind",
    "Wind turbines",
    "Wind energy",
    "Arpa-e",
    "Sandia national laboratories",
    "Wind power"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}