{
  "title": "Ukraine’s Grid Needs Parts—Will Western Firms Step Up?",
  "link": "https://spectrum.ieee.org/russia-targets-ukraine-grid",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-truck-with-a-ukrainian-license-plate-and-a-vehicle-with-a-cherry-picker-multiple-workers-fix-electric-wires-on-poles.jpg?id=32034055&width=1245&height=700&coordinates=0%2C359%2C0%2C65\"/><br/><br/><p>“Soldiers on the power front.” That’s what grid operator <a href=\"https://www.linkedin.com/company/ukrenergo/\" rel=\"noopener noreferrer\" target=\"_blank\">Ukrenergo</a> calls the workers who’ve kept Ukraine’s high-voltage trunk lines buzzing since Russia invaded in February, risking live fire, mines, and missiles to restore war-damaged power lines and substations. Their sometimes deadly job intensified suddenly last month when Russian forces launched a focused assault on Ukraine’s power system that’s still underway. </p><p>“It has been the largest attack on energy infrastructure in history,” said Ukrenergo chairman Volodymyr Kudrytskyi in an email to <em>IEEE Spectrum</em>. “The scale of damage is now very large, the shelling continues, and no one can tell when it stops.” </p><p><a href=\"https://www.cnn.com/2022/10/28/europe/ukraine-russia-war-winter-intl-cmd/index.html\" target=\"_blank\">Russia has destroyed several coal-fired power plants</a>, including a cogeneration plant that heats large areas of Kyiv. But most of the barrage has targeted <a href=\"https://news.yahoo.com/as-temperatures-begin-to-fall-russia-steps-up-attacks-on-ukraines-vulnerable-power-grid-190531785.html\" target=\"_blank\">outdoor equipment</a>: the switchyards that link power stations to the grid, and over one-third of Ukrenergo’s substations.</p><p>The intensity can be fearsome. On Monday, Russia launched <a href=\"https://meduza.io/en/feature/2022/10/31/we-ll-tough-it-out-but-their-disgrace-will-cost-them-dearly?utm_source=email&utm_medium=briefly&utm_campaign=2022-11-01\" target=\"_blank\">50 cruise missiles as well as explosive drones during just one 2-hour span</a>. As a result, a majority of Kyiv’s population, along with much of central Ukraine, again lost power, water, and heat.</p><p>Ukraine, for obvious reasons, is disseminating only a blurry picture of the grid damage. Ukrenergo and <a href=\"https://dtek.com/en/\" rel=\"noopener noreferrer\" target=\"_blank\">DTEK</a>, which operates most of Ukraine’s coal-fired power stations plus power distribution in eastern Ukraine, restrict location-specific damage details fearing such intel will improve Russia’s targeting.</p><p class=\"pull-quote\">DTEK and Ukrenergo say they need access to parts stockpiles held by grid operators and generators abroad. The reason comes down to the number, rarity, and manufacturing time for the parts that Russia is destroying.</p><p>The invader is already disturbingly precise. Kudrytskyi and DTEK executive director Dmytro Sakharuk say Russia hits the grid nodes most crucial to delivering power over large areas. That insight, they suggest, implies involvement of experts at Russian firms such as Moscow-based grid operator <a href=\"http://www.fsk-ees.ru\" target=\"_blank\">Rosseti</a> and electricity conglomerate <a href=\"https://www.fsk-ees.ru/eng/\" rel=\"noopener noreferrer\" target=\"_blank\">InterRAO</a>.</p><p>“There are several very important substations through which big parts of Ukraine are connected. Those look very similar to many others, some of which are closer to the border and easier to hit. They could also hit even bigger substations. But they mainly target those important substations,” Sakharuk told <em>IEEE </em><em>Spectrum</em> last week from a bunker in Kyiv during an air-raid warning. (Rosseti and InterRAO did not respond to requests for comment by our deadline.)</p><p>Damage now exceeds what Ukraine’s line worker/soldiers can repair, says Sakharuk, because they have run out of crucial components.</p><p>Governments are pledging to act. For example USAID’s Kyiv-based <a href=\"https://energysecurityua.org/\" target=\"_blank\">Energy Security Project</a> told <em>Spectrum</em> it is already acquiring “repair material” for power distribution in Sumy and Kharkiv and plans to help Ukrenergo with critical components and a backup control center in western Ukraine.</p><p>DTEK, however, had no offers from fellow power firms that it believes are most capable of supplying <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:6985936295122341888?utm_source=share&utm_medium=member_desktop\" rel=\"noopener noreferrer\" target=\"_blank\">critical equipment</a> that it needs as soon as possible. </p><p>Most European, U.S., and U.K. utilities contacted for comment did not respond, or referred questions to trade associations that did not respond. </p><h3>Missing in Action</h3><p>For Ukraine’s grid operators, the impact of Russia’s antigrid campaign is poignant and permanent. Within DTEK, 11 workers were injured on the job since 10 October, and one was killed. That brings DTEK’s occupational death toll since February to four. Ukrenergo lost four on the job since the invasion, including two killed in the northeast on 10 October and one in the north on 17 October when missiles struck substations.</p><p>Losses would be greater if Ukraine’s forces didn’t shoot down so many missiles. Western countries have promised to send more and better antimissile systems, spurred by the grid attacks. Also helping is <a href=\"https://mediacenter.org.ua/strong-some-nato-representatives-shown-interest-in-the-ukrainian-made-eppo-app-strong/\" target=\"_blank\">an app enabling citizens to report incoming missiles</a> hugging the ground to avoid radar detection.</p><p>Russia’s antigrid campaign has been deadly for Ukraine’s population, and it’s caused more blackouts followed by more and longer rolling blackouts. Losing power for hours or days adds one more burden to life under siege, but it is a necessary evil to prevent a nationwide grid collapse that could take days to unravel.</p><p>Also helping keep the grid from collapsing is <a href=\"https://spectrum.ieee.org/ukraine-europe-electricity-grid\" target=\"_self\">Ukraine’s snap synchronization with Europe’s grid</a> in March. When attacks suddenly knock lines and plants out of operation in Ukraine, generators and batteries across the world’s largest interconnected power system ramp up to buffer the shock and maintain Ukraine’s 50-hertz AC frequency. </p><p>Until last month the same grid links enabled Ukraine to export power to Europe, earning crucial cash, but now they deliver European power <a href=\"https://uacrisis.org/en/day-246\" target=\"_blank\">to shore up domestic supplies</a>. Last week, amidst fears of energy shortages, <a href=\"https://www.upstreamonline.com/production/ukraine-braced-for-difficult-winter-after-missile-attacks/2-1-1341493\" rel=\"noopener noreferrer\" target=\"_blank\">Kyiv advised refugees wanting to return to wait until the spring</a>. </p><p>But to keep power on through the winter, DTEK and Ukrenergo say they need access to parts stockpiles held by grid operators and generators abroad. The reason comes down to the number, rarity, and manufacturing time for the parts that Russia is destroying.</p><p>Switchgear and circuit breakers are needed in great number, but easiest to replace. In some cases DTEK engineers can use two or three damaged units to assemble one working part, and a broad range of suppliers inside and outside Ukraine make equipment with the required specifications. </p><p>Harder components to find are digital control systems, which may require custom design, and transformers delivering the required Soviet-standard voltage conversions, which are rarely produced now outside Ukraine and Russia and take months to produce. </p><p class=\"pull-quote\">Western utilities could be heeding Ukraine’s reticence to provide details that could help Russia. Or they could fear that supporting Ukraine’s power engineers could hang a bulls’-eye for Russian cyberattackers on their own operations.</p><p>DTEK has raised the possibility of retrieving some transformers from retired coal-fired power plants or substations in the former Soviet-block states of Eastern Europe. Sakharuk says international firms could also help by letting Ukraine jump ahead in  manufacturing queues.<br/></p><p>European companies have delivered supplies worth over €10 million to Ukraine during the war, according to the European Commission. Most have gone to Ukrenergo, which says it has received “substantial assistance from European system operators.”</p><p>More equipment is likely, but as yet there is little tangible to point to since 10 October. </p><p>Sakharuk said he knew of only one company, Warsaw-based grid operator <a href=\"https://www.pse.pl/web/pse-eng\" target=\"_blank\">Polskie Sieci Elektroenergetyczne</a> (PSE), that had committed new equipment, and it was for Ukrenergo. A spokesperson for PSE said it is also restoring a 400-kilovolt transmission link with Ukraine this year that will enable Europe’s grid to provide more support.</p><p>Germany’s <a href=\"https://www.amprion.net/index-2.html\" target=\"_blank\">Amprion</a> is also likely to provide more equipment according to Vitaliy Krusch, a Ukrainian-born operations planner for the Dortmund-based grid operator. </p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"3 men hold a Ukrainian flag in front of electrical equipment\" class=\"rm-shortcode\" data-rm-shortcode-id=\"32a538563893431d2c3df5efea570c64\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"03be4\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/3-men-hold-a-ukrainian-flag-in-front-of-electrical-equipment.jpg?id=32034064&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Vitaliy Krusch of Amprion [left], Oleg Lysak of Ukrenergo [center], and Frank Lamberty of Amprion display the Ukrainian flag.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Amprion</small></p><p>With Amprion’s backing, Krusch has spearheaded five aid convoys delivering over €2 million worth of supplies, including two large emergency generators, 160 tonnes of humanitarian and medical aid, and 15 ambulances. On return trips he has brought 78 refugees to Germany.</p><p>The scale of the work was visible during a video call last week with <em>Spectrum</em>, as Krusch’s 3-year-old daughter clamored for his attention. Krusch explained that she’s had less time with him since the war, between the aid work and night shifts in Amprion’s control room.</p><h3>Confronting War Crimes</h3><p>Krusch is gearing up for a sixth convoy to roll in mid-November. But when asked if it would carry grid components needed immediately in Ukraine, an Amprion spokesperson redirected that question to the Brussels-based <a href=\"https://www.entsoe.eu/\" target=\"_blank\">European Network of Transmission System Operators</a> (ENTSO-E), saying, “They are coordinating all aid.” </p><p>ENTSO-E, however, responded with a statement denying it was coordinating aid. “ENTSO-E is not involved in coordinating this activity on behalf of the member [transmission system operators],” wrote the organization’s spokesperson.</p><p>Other inquiries led to similar dead ends. <a href=\"https://www.nationalgrid.com/\" rel=\"noopener noreferrer\" target=\"_blank\">National Grid</a>, which operates in the United States and the United Kingdom, referred <em>Spectrum</em> to the London-based <a href=\"https://www.energynetworks.org/\" target=\"_blank\">Energy Networks Association</a>, which sent a press release from March about donated generators. U.S. transmission heavyweight <a href=\"https://aep.com/\" rel=\"noopener noreferrer\" target=\"_blank\">American Electric Power</a> suggested contacting the <a href=\"https://www.eei.org/\" target=\"_blank\">Edison Electric Institute</a>, a Washington, D.C.–based utility trade group. It didn’t respond. </p><p>Some of the nonresponse may be strategic. Western utilities could be heeding Ukraine’s reticence to provide details that could help Russia. Or they could fear that supporting Ukraine’s power engineers could hang a bulls’-eye for Russian cyberattackers on their own operations. </p><p>Russian power engineers may be fearing negative consequences as well, if they have provided expertise to maximize damage to Ukraine’s power system. </p><p>Experts on crimes against humanity conclude that <a href=\"http://unlawful,%20and%20many%20undoubtedly%20are,%20but%20are%20not%20necessarily%20so.\" rel=\"noopener noreferrer\" target=\"_blank\">at least some of Russia’s attacks on the grid are war crimes</a>. And a recent investigation shows that those targeting Russia’s missiles and drones deserve serious scrutiny.</p><p>On 24 October, Amsterdam-based investigative organization <a href=\"https://www.bellingcat.com/news/uk-and-europe/2022/10/24/the-remote-control-killers-behind-russias-cruise-missile-strikes-on-ukraine/\" target=\"_blank\">Bellingcat uncloaked the “remote control killers” in the Russian Armed Forces</a> involved in missile targeting. </p><p>The secretive group includes dozens of mostly young military engineers with experience in missile programming, IT, and computer gaming, some of whom also worked at Russia’s Damascus command center while Russian cruise missiles struck anti-Assad forces in Syria. </p><p>Among other investigative tools, Bellingcat obtained phone records showing that calls between the group members and their officers “spiked shortly before many of the high-precision Russian cruise missile strikes that have killed hundreds and deprived millions in Ukraine of access to electricity and heating.” </p>",
  "pubDate": "Wed, 02 Nov 2022 15:15:32 +0000",
  "guid": "https://spectrum.ieee.org/russia-targets-ukraine-grid",
  "category": [
    "Russia-ukraine war",
    "Power grid",
    "Ukraine",
    "Russia",
    "Drones",
    "Ukraine conflict"
  ],
  "dc:creator": "Peter Fairley",
  "media:content": ""
}