{
  "id": "https://bibleinoneyear.org/en/youth/239",
  "title": "Day 239: Anointed by God",
  "description": "Psalm 103:13–14,17–18,22, 2 Chronicles 29:1–5,11,20-21, 30:18-20, 2 Corinthians 1:20-22. 21, MSG)  By giving you the Holy Spirit, God has already given you this deposit in advance of what one day you will receive in full",
  "pubDate": "Fri, 27 Aug 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/239/?ignore",
  "itunes:duration": "13:51",
  "guid": "enyouth27082021-239",
  "length": 831.01,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 239: Anointed by God",
  "itunes:subtitle": "Psalm 103:13–14,17–18,22, 2 Chronicles 29:1–5,11,20-21, 30:18-20, 2 Corinthians 1:20-22. 21, MSG)  By giving you the Holy Spirit, God has already given you this deposit in advance of what one day you will receive in full",
  "itunes:summary": "Do you realise that right now you are ‘anointed’ by God? ‘Anointing’ is not just for special Christian leaders or speakers. It is for all of us. Do you know that this anointing gives you power over sin, temptation and evil? Do you know that this anointing gives you access to God in prayer and worship? Do you know that this anointing enables you to proclaim God’s message to other people?\nAll of this is possible because God has given you the Holy Spirit. The Holy Spirit not only guarantees your future; he is the down payment in advance. ‘He anointed us, set his seal of ownership on us, and put his Spirit in our hearts as a deposit guaranteeing what is to come’ (2 Corinthians 1:21–22).\nWhen you exchange contracts on a house it is usually accompanied by a deposit, which not only guarantees what is to come but is also a part payment in advance. God ‘by his Spirit has stamped us with an eternal pledge – a sure beginning of what he is destined to complete’ (v.21, MSG). By giving you the Holy Spirit, God has already given you this deposit in advance of what one day you will receive in full. What does this anointing of the Holy Spirit mean in practice?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 239
}