{
  "title": "Head Over To margint.blog",
  "link": "",
  "updated": "2017-12-26T11:34:00+01:00",
  "published": "2017-12-26T11:34:00+01:00",
  "author": {
    "name": "Mikio L. Braun",
    "uri": "http://mikiobraun.de",
    "email": "mikiobraun@gmail.com"
  },
  "id": "http://blog.mikiobraun.de/2017/12/head-over-to-margint-blog",
  "content": "<p><p>Hello Fellow Readers,</p>\n\n<p>I’ve set up a new blog at <a href=\"http://margint.blog/\">margint.blog</a> and will continue posting there (hopefully more frequently than I did in the past two years). This blog here will stay around indefinitely, of course, but I’ve also started to repost best-ofs to the new blog.</p>\n\n<p>I moved over to a wordpress hosted blog instead of my handrolled <a href=\"https://jekyllrb.com\">Jekyll</a> plus static files setup. If you’re interested, here are my main reasons to make the switch:</p>\n\n<ul>\n  <li>The main reason was that editing files became more and more difficult. Recompiling took longer and longer. I couldn’t just drag and drop images, and I was starting to want a WYSIWYG style editor (yeah, I’m getting old…).</li>\n  <li>Having full control is nice, but the last redesign, moving from my own CSS files to something more responsive took all my mental capacities to make it through.</li>\n  <li>I was considering again rolling my own based on <a href=\"http://ghost.org/\">ghost</a> or something like it, but I would have needed to do some customization, for example, to make old URLs work. Also, I never found the time.</li>\n  <li>It was nice to have full Google Analytics integration, but let’s be honest, I never needed the full feature set of that anyway, daily graphs of what people are reading were enough for my post-publishing-are-people-reading-this-urges.</li>\n  <li>I was becoming interesting in scheduled posts and having updates automatically propagated to social media.</li>\n</ul>\n\n<p>I don’t know how I ended up with wordpress, but they’ve been around forever and they seem to know their business. There was also a pleasant surprise, they essentially give you one domain for free. No idea whether it’s for the first year only or not, but that was definitely nice.</p>\n\n<p>In any case, if you want to continue reading, bookmark <a href=\"http://margint.blog/\">margint.blog</a>, or start following me on <a href=\"http://twitter.com/mikiobraun\">Twitter</a> or <a href=\"https://www.linkedin.com/in/mikiobraun/\">LinkedIn</a>.</p>\n\n<p>Thanks for reading!</p>\n</p>\n   <p><a href=\"http://blog.mikiobraun.de/2017/12/head-over-to-margint-blog.html\">Click here for the full article</a>"
}