{
  "title": "Achieve ultimate health in 10 days | Dr. Mark Hyman on how to defeat brain fog, depression and other ailments",
  "pubDate": "Fri, 12 Jan 2018 21:13:27 +0000",
  "guid": "aa61ddb45cf0eae720ed89617f9a97cd",
  "link": "https://tonyrobbins.libsyn.com/achieve-ultimate-health-in-10-days-dr-mark-hyman-on-how-to-defeat-brain-fog-depression-and-other-ailments",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Think back to a time when you felt physically unstoppable – when you were in peak shape. How did it feel to have that kind of energy? What did it feel like to be on the top of your game? And what if I told you that you could feel like that every single day?</span></p> <p><span style=\"font-weight: 400;\">In this episode of the Tony Robbins Podcast, your host, Ana Yoerg, is joined by renowned medical expert, Dr. Mark Hyman.</span></p> <p><span style=\"font-weight: 400;\">Dr. Hyman is a practicing family physician, a 10-time #1</span> <em><span style= \"font-weight: 400;\">New York Times</span></em> <span style= \"font-weight: 400;\">best-selling author, and an internationally recognized leader, speaker, educator, and advocate in his field. He is a guest speaker at Tony’s Unleash the Power Within event. And he is the Director of the Cleveland Clinic Center for Functional Medicine, and the founder and medical director of The Ultra Wellness Center, which has a 30,000 person waiting list.</span></p> <p><span style=\"font-weight: 400;\">You may have already read some of his works -- his books include The 10-Day Detox Diet, Eat Fat Get Thin and The Blood Sugar Solution. He is also a medical editor at</span> <em><span style=\"font-weight: 400;\">The Huffington Post,</span></em> <span style=\"font-weight: 400;\">has been featured on CBS This Morning, the Today Show, Good Morning America, CNN, The View and The Dr. Oz Show. He also just released a new docuseries called Broken Brain, which premiered in October and will be available again on January 17, 2018. To watch all 8 episodes, go to BrokenBrain.com.</span></p>",
  "content:encoded": "<p>Think back to a time when you felt physically unstoppable – when you were in peak shape. How did it feel to have that kind of energy? What did it feel like to be on the top of your game? And what if I told you that you could feel like that every single day?</p> <p>In this episode of the Tony Robbins Podcast, your host, Ana Yoerg, is joined by renowned medical expert, Dr. Mark Hyman.</p> <p>Dr. Hyman is a practicing family physician, a 10-time #1 <em>New York Times</em> best-selling author, and an internationally recognized leader, speaker, educator, and advocate in his field. He is a guest speaker at Tony’s Unleash the Power Within event. And he is the Director of the Cleveland Clinic Center for Functional Medicine, and the founder and medical director of The Ultra Wellness Center, which has a 30,000 person waiting list.</p> <p>You may have already read some of his works -- his books include The 10-Day Detox Diet, Eat Fat Get Thin and The Blood Sugar Solution. He is also a medical editor at <em>The Huffington Post,</em> has been featured on CBS This Morning, the Today Show, Good Morning America, CNN, The View and The Dr. Oz Show. He also just released a new docuseries called Broken Brain, which premiered in October and will be available again on January 17, 2018. To watch all 8 episodes, go to BrokenBrain.com.</p>",
  "enclosure": "",
  "itunes:duration": "45:36",
  "itunes:explicit": false,
  "itunes:keywords": "mark,health,Dr,tony,robbins,hyman",
  "itunes:subtitle": "Think back to a time when you felt physically unstoppable – when you were in peak shape. How did it feel to have that kind of energy? What did it feel like to be on the top of your game? And what if I told you that you could feel like that every...",
  "itunes:episodeType": "full"
}