{
  "title": "ZBT #290: Michael Phelps Is A Shitty Athlete",
  "description": "<p>SEVEN ROUNDS for this Friday episode. That's a record, folks\n\n-GetRoman.com/Zero for your first month free on Roman Swipes-\n-3chi.com promo code \"Zero\" for 5% some amazing Delta8 THC products-\n\nROUND 1: With the 30k Marines currently in quarantine in preparation for a large-scale training exercise in the Pacific, we were reminded of the classic lie from lots of recruiters. See the world, they said… The ZBT gang shares where the military has taken them across the country & around the world. \n\nROUND 2: There’s a notorious relationship between the military & off-base car dealerships, and keeping with that theme we’ve got an Army soldier who’s been locked in a battle with Honda over a $1 discrepancy for over a year now\n\nROUND 3: A military helicopter was on a routine training mission when it was shot at from the ground over Manassas, VA, injuring one of those on board. Scary stuff. \n\nROUND 4: Shifting gears now, a Soldier tried to steal car in Germany but was thwarted not by the cops, but by a stick shift \n\nROUND 5: (quick) FIRE WATCH - We’ve found one of the most obnoxious men in the military on a Reddit post & look forward to shaming & giving him the worst firewatch shift for the weekend\n\nROUND 6: Grab the mops, babygirls. President Trump wants to get you WET. \n\nRound 7: A classic question of right or wrong. Some sneaky folks in Washington State are up to no good…. Or are they???</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/ZeroBlog30\">barstool.link/ZeroBlog30</a></p>",
  "guid": "6c95d8be-a8b8-4d1f-91cc-5b6169f5e482",
  "pubDate": "Fri, 14 Aug 2020 07:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/zero-blog-thirty",
  "itunes:explicit": "yes",
  "itunes:duration": "01:30:21",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}