{
  "id": "yt:video:DVU0sk7kTkg",
  "yt:videoId": "DVU0sk7kTkg",
  "yt:channelId": "UCZRoNJu1OszFqABP8AuJIuw",
  "title": "Exactly How Equifax Leaked The SSNs Of 146 Million People",
  "link": "",
  "author": {
    "name": "Logically Answered",
    "uri": "https://www.youtube.com/channel/UCZRoNJu1OszFqABP8AuJIuw"
  },
  "published": "2022-10-21T19:00:08+00:00",
  "updated": "2022-10-21T20:52:24+00:00",
  "media:group": {
    "media:title": "Exactly How Equifax Leaked The SSNs Of 146 Million People",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Are you familiar with a company called Equifax? You might’ve come across the company when checking your credit score or applying for a loan. Equifax is one of the three major credit bureaus in the world alongside TransUnion and Experian. Given the nature of their business, it’s not surprising that they deal with sensitive financial data on a regular basis. Considering this, you would expect that Equifax has top-tier security measures in place to prevent this data from being leaked and stolen. However, it doesn’t seem like Equifax did enough because a few years ago, they had one of the largest leaks in history. This leak exposed the date of birth, names, and social security numbers of over 140 million people just in the US. This means that if you were a US adult in 2017 and had some sort of credit file, there’s a higher probability that your data was leaked than your data not being leaked. To make things worse, it seems like Equifax got several indications that its cybersecurity needs to be upgraded. Yet, they didn’t take sufficient action before it was too late. If this was Google or Facebook, people would be up in riots, but since it’s a background company, most people don’t even know about the situation. This video explains the story of how the devastating Equifax data breach transpired and what you may be able to do today to claim damages.  \n\nDiscord Community: \nhttps://discord.gg/SJUNWNt\n\nTimestamps:\n0:00 - Leaked SSNS\n2:32 - Data Breach\n5:21 - Public Backlash\n8:42 - The Fallout\n11:14 - The Takeaway\n\nResources: \nhttps://pastebin.com/1a3aYgdu",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}