{
  "id": "tag:blogger.com,1999:blog-8913912091036362264.post-7265397043088115275",
  "published": "2020-03-08T00:01:00.000-08:00",
  "updated": "2020-03-08T00:01:10.129-08:00",
  "title": "9 womenbosses who inspire us on YouTube",
  "content": "Every time International Women’s Day rolls around, it’s an opportunity to reflect on all the women who push YouTube to be even better. They make this community the best that it can be. <br /><br />Here are nine women, from around the globe, who inspire us with their creative and entrepreneurial spirit. They’re teachers, leaders and artists. They’re often in traditionally male-driven communities, breaking glass ceilings, everywhere they go. We’re proud to feature some of their answers to our Q&amp;A, and we’re so, so lucky to call them YouTubers. <br /><br /><h3>1. <a href=\"https://www.youtube.com/user/rachanaphadke\" target=\"_blank\">Rachana Phadke Ranade</a></h3><br /><br /><div style=\"text-align: center;\"><div style=\"text-align: left;\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/Xn7KWR9EOGQ\" width=\"560\"></iframe></div></div><br />Rachana is a chartered accountant, faculty member at the Institute of Chartered Accountants of India, trained in Indian classical music, a mom, and is at the helm of a 400K+ strong YouTube channel, where she educates her viewers on finance, business, and markets. Her channel team has grown from two people to five, including researchers and a video producer.  <br /><br />A NextUp Women to Watch winner in India, she's passionate about equipping women to be financially independent. She’s one of the few creators in a traditionally male-driven arena of financial education in India.   <br /><br /><b>YT:&nbsp;What are you most proud of from your work on YouTube? </b><br /><b><br /></b><b>Rachana:</b> “I feel proud of the fact that my most viewed lecture on Youtube which has crossed 2.4 million views is a 1.5 hours lecture! Encouraging people to click on such a long lecture and keeping them glued to it for a substantial time makes me feel really good. <br /><br />I also feel proud that people from the Indian Navy, Indian Airforce and Indian Army also watch my lectures. I have received many comments from them on many of my videos! So, I feel proud of the fact that I am able to serve those who serve our nation!” <br /><br /><br /><br /><h3>2. Emma Jakobi, <a href=\"https://www.youtube.com/channel/UCrRiVfHqBIIvSgKmgnSY66g\" target=\"_blank\">mmmEnglish</a></h3><br /><br /><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/K2R6KQRmCIA\" width=\"560\"></iframe><br /><br />Emma Jakobi is an English teacher from Australia and is also the brain behind mmmEnglish, one of Australia’s top learning channels. Emma created mmmEnglish to help her students learn while she wasn’t teaching. The channel took off quickly, and Emma saw the opportunity to build a business helping people learn English, using YouTube to reach an engaged global audience.  <br /><br /><b>YT: What are you most proud of from your work on YouTube? </b><br /><br /><b>Emma:</b> “YouTube has been the catalyst that has taken my career and my life in a new direction - one that I couldn’t have imagined 5 years ago! In particular, it has allowed me to create a second business that I am completely in love with, The Ladies’ Project, a community for international women learning English as a second language. It takes away the pain of finding genuine speaking partners to practise with online, while empowering women to build confidence in themselves (their English conversation skills!) and create opportunities to thrive.” <br /><br /><br /><br /><h3>3. Refika Birgül, <a href=\"https://www.youtube.com/channel/UCO3MaQR-Vh6cgBZRlD44jWg\" target=\"_blank\">Refika'nın Mutfağı </a></h3><br /><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/SHTrWXsNzG0\" width=\"560\"></iframe><br /><br /><a href=\"https://www.youtube.com/channel/UCO3MaQR-Vh6cgBZRlD44jWg\" target=\"_blank\">Refika</a> is a Turkish food writer, TV presenter and YouTube sensation. Her mission is to teach cooking to an audience of all ages and promote Turkish cuisine while also having fun. In the course of a year, she’s become the largest cooking channel in Turkey with a diverse audience across generations. <br /><br />She now has a large team of 35 supporting her on production, sales and merchandise. She recently more than doubled the staff to handle the launch of her physical merch store and her globalization efforts via her English channel. Refika says YouTube has helped her both financially and emotionally, allowing her to grow her business and pursue her dreams.    <br /><br /><b>YT: How do you balance between being a creator and a businesswoman?  </b><br /><br /><b>Refika:</b> “It’s definitely not easy finding the balance. As a creator and business person, I am the product, I am the creative who keeps the product shiny and interesting, and I’m the operations person managing everything from top to bottom. I always have this feeling that there’s never enough time, and this weighs on me. I always have this heavy feeling of guilt, never feeling enough, but at the end of the day, I do my best!” <br /><br /><br /><br /><h3>4. Nikkie de Jager, <a href=\"https://www.youtube.com/channel/UCzTKskwIc_-a0cGvCXA848Q\">NikkieTutorials</a></h3><br /><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/QOOw2E_qAsE\" width=\"560\"></iframe><br /><br /><a href=\"https://www.youtube.com/channel/UCzTKskwIc_-a0cGvCXA848Q\" target=\"_blank\">Nikkie de Jager</a>, better known by her YouTube channel name NikkieTutorials, is a Dutch makeup artist and beauty vlogger. Nikkie first began uploading videos in 2008 at the age of 14, after watching MTV’s “The Hills.” Now, she’s an emerging media brand with brand collaborations ranging from Ofra and Maybelline. Nikkie has also worked with Lady Gaga, promoting her makeup brand, Haus Laboratories. Earlier this year, it was announced she’ll be the online host of Eurovision. <br /><br /><b>YT: How do you balance between being a creator and a businesswoman? </b><br /><br /><b>Nikkie:</b> “In the beginning you need to learn what a ‘business person’ is because you are the brand and sometimes it might feel weird to talk about your own work, etc., but you get used to it. I now know I am my channel and my channel is my brand.  <br /><br />Also, I’ve been very fortunate to have help from very good, trustworthy people who help me on the business side so I can focus on creativity.” <br /><br /><b>YT: What is one important lesson learned from being a YouTube boss? </b><br /><br /><b>Nikkie:</b> “Don't get comfortable. As a platform,YouTube continues to evolve, so stay flexible and don't take any opportunity for granted.” <br /><br /><br /><br /><h3>5. Lucy Bella Earl, <a href=\"https://www.youtube.com/channel/UCz4tgANd4yy8Oe0iXCdSWfA\">English with Lucy</a></h3><br /><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/6I9yAohpf2E\" width=\"560\"></iframe><br /><br />This <a href=\"https://www.youtube.com/channel/UCz4tgANd4yy8Oe0iXCdSWfA\" target=\"_blank\">country-side Brit</a> manages two channels — she vlogs about her daily life on one (Lucy Bella Earl), while teaching folks the queen’s English on the other. Lucy currently has over 3 million subscribers.  <br /><br /><b>YT: What is one important lesson learned from being a YouTube boss? </b><br /><br /><b>Lucy:</b> “No matter how hard you try, you're not going to be everyone's cup of tea. I was brought up to be a people pleaser, and it's taken a long time for me to accept that some people aren't going to like me and that is totally fine! In fact, sometimes, it can work in your favor.” <br /><br /><br /><br /><h3>6. Mindy McKnight, <a href=\"https://www.youtube.com/user/CuteGirlsHairstyles\" target=\"_blank\">Cute Girls Hairstyles</a></h3><br /><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/0TBBf-MFOyE\" width=\"560\"></iframe><br /><br /><a href=\"https://www.youtube.com/user/CuteGirlsHairstyles\">Mindy McKnight</a> owns and operates the #1  hair channel on YouTube, Cute Girls Hairstyles. Mindy’s hairstyle tutorials began as a hobby, but have since led to a family social media empire, including over 23 million followers across all social platforms, six successful YouTube channels totaling over 2 billion views worldwide, and several highly successful off-platform businesses, such as the haircare brand, Hairitage, which is currently sold in Walmarts nationwide.  <br /><br /><b>YT: What is one important lesson learned from being a YouTube boss? </b><br /><br /><b>Mindy:</b> “One of the most important lessons I’ve learned from being a YouTube boss is that your career doesn’t have to be ancillary to your family. There’s a way to build a career around the things you’re most passionate about, and for me that was family and hair. That was the magic recipe for us, and I love that we didn’t have to choose one or the other.” <br /><br /><br /><br /><h3>7. Sabrina, <a href=\"https://www.youtube.com/user/TeraBriteGames\" target=\"_blank\">TeraBrite Games</a></h3><br /><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/s3bhZ0EFYxI\" width=\"560\"></iframe> <br /><a href=\"https://www.youtube.com/user/TeraBriteGames\" target=\"_blank\">Sabrina</a> is known for her Roblox game content, from music videos and game development to being one of the producers of the first ever Roblox Influencer Championship event. She’s grown to nearly 1 million subscribers. <br /><br /><b>YT: What is one important lesson learned from being a YouTube boss? </b><br /><br /><b>Sabrina:</b> “It takes a lot of trial and error to find a middle ground between what you want to do and what the community wants to see. When you find it, it's extremely rewarding because both you and your viewers are happy and that's sustainable.”  <br /><br /><br /><br /><h3>8. Nathalia Arcuri, <a href=\"https://www.youtube.com/channel/UC8mDF5mWNGE-Kpfcvnn0bUg\">Me poupe!</a></h3><br /><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/JUo2wMjBJkE\" width=\"560\"></iframe><br /><br /><a href=\"https://www.youtube.com/channel/UC8mDF5mWNGE-Kpfcvnn0bUg\">Nathalia Arcuri</a> quit her job as a journalist to start Me poupe!, the country’s first platform dedicated to financial education and women’s empowerment. She now has the largest financial entertainment channel in the world and is considered one of the most influential women in Brazil. <br /><br /><b>YT: What are you most proud of from your work on YouTube? </b> <br /><br /><b>Nathalia:</b> “I am proud to have created a new vertical of content within YouTube, which is entertainment applied to education. It is knowing that I was able to open a door to other financial channels, which today makes the subject have much more impact in the lives of many many people. …. We are talking to a huge number of Brazilians who have never had access to financial education. And the moment Me Poupe! democratized access through a simpler and more fun language, and people started to understand that it is possible to talk about a subject that is so tense, that it is so hard in a light way, it broke several barriers and made that subject, that it is so important for people to be freer and make better decisions with money, not be so hostage to debt and have this financial education. So what I'm most proud of is being at the forefront of this segment on YouTube.”  <br /><br /><h3><b>9.&nbsp;<a href=\"https://www.youtube.com/channel/UCQh6LB206jF3JxpCDD-fp5Q\">Tate McRae </a></b></h3><br />Singer/songwriter/dancer <a href=\"https://www.youtube.com/channel/UCQh6LB206jF3JxpCDD-fp5Q\">Tate McRa</a>e released her debut EP “all the things i never said” in January, featuring her hit song “stupid.” Tate is set to kick off her “All The Things I Never Said Pt. II” tour on April 1.  <br /><br /><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/4juPE9oCuyQ\" width=\"560\"></iframe> <br /><b>YT: How do you balance between being an artist and a businesswoman? </b><br /><br /><br /><br /><b>Tate:</b> “I’m the type of person that works best under pressure. I love keeping myself busy and working at all points of the day, otherwise I can drive myself crazy. Having to maintain a heavy workload just motivates me to continue to push through and be the best version of myself.” <br /><br /><b>YT: What is one important lesson learned from being a YouTube boss? </b><br /><br /><b>Tate: </b>“Always stay authentic. Stay true to your roots and (as cliche as it sounds) be yourself. I feel like it’s so obvious when a person/artist puts on a false persona of themselves – it can be read so easily through the screen.” <br /><br /><i>Answers edited for clarity and brevity. </i>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube",
    "uri": "http://www.blogger.com/profile/03369985352764236236",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}