{
  "title": "Open-Endedness 1: Cellworld",
  "description": "<p>When I look into the pond at my local park, there’s an amazing ecosystem of life at play. Algae covers the surface, and small fish come up to nibble on the meal. In the mud, bottom-feeding clams and large eels wait for prey.</p><p>My pond is only one example</p>",
  "link": "https://kvfrans.com/open-endedness/",
  "guid": "60225e9617e26d47c77e8ecc",
  "category": "research",
  "dc:creator": "Kevin Frans",
  "pubDate": "Thu, 15 Oct 2020 03:56:00 GMT",
  "content:encoded": "<p>When I look into the pond at my local park, there’s an amazing ecosystem of life at play. Algae covers the surface, and small fish come up to nibble on the meal. In the mud, bottom-feeding clams and large eels wait for prey.</p><p>My pond is only one example of the diversity of life on Earth. Just outside the city are dozens of lakes and grasslands, each with their own interconnected ecosystems. How did life emerge into so many coexisting species?</p><p>The answer is hidden in a property called <strong>open-endedness</strong>. In an open-ended world, innovation never ends. Instead, <strong>solutions create opportunities for more solutions</strong>. The algae create a food source for the fish. The fish create an opportunity for larger predators, who provide food for bottom-feeders when they die.</p><p>If you look closely, you can see open-endedness in many domains. In Ancient China, local farmers formed towns and villages, which became the foundation for feudal empires. The computers we use today are built off of semiconductors, which were discovered after research into radio waves.</p><p>The key feature of open-ended systems is that they never stop developing. Life will never be done evolving, and people will never be done creating new technology. As an AI researcher, this is a very useful property – it means we can train AI agents on potentially limitless tasks. It’s hard to imagine achieving general intelligence by classifying cats and dogs, but an AI that can invent increasingly complex technology would surely show us interesting behavior.</p><h2 id=\"cellworld\">Cellworld</h2><hr><p>In this post, let’s explore basic open-ended principles through a cell-based gridworld.</p><!--kg-card-begin: html--><div class=\"float-outside\">\n<div class=\"float-figure\">\n<img style=\"width:100%\" src=\"https://kvfrans.com/static/open/1/1.5_cell.png\">\n    <figcaption>A basic cell with three Photo parts and one Duplicator part.</figcaption>\n</div>\n    In our primitive Cellworld, a cell consists of a 4x4 grid of parts. Green squares represent Photo parts, which generate energy over time. Yelllow squares are Duplicator parts, which allow a cell to self-replicate.\n    <br>\n    <br>\nWhen the yellow outline is full, a cell has enough energy to replicate, and will create a clone of itself in a nearby square.\n</div><!--kg-card-end: html--><p>Let's take a look at how this simple cell will behave when we set it loose in an 8x8 world.</p><!--kg-card-begin: html--><hr class=\"gridhr\">\n<figure class=\"kg-card kg-gallery-card\">\n    <div class=\"kg-gallery-container gridsmall\">\n        <div class=\"kg-gallery-row\">\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/1/1_replicate_1.mp4\"></video>\n                <figcaption>\n                    Cells begin replicating.\n                </figcaption>\n            </div>\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/1/1_replicate_2.mp4\"></video>\n                <figcaption>\n                    Cells spread through the whole world.\n                </figcaption>\n            </div>\n        </div>\n    </div>\n</figure>\n<hr class=\"gridhr\"><!--kg-card-end: html--><p>Easily, the origin cell spreads everywhere. But once the world fills up, the simulation reaches its end.</p><p>This is a common issue when designing open-endedness: the world can reach a stable state, where no more progress can be made.</p><p>In our case, the problem is there’s no space. Let’s try introducing a death timer. A few seconds after being born, cells will die off. In addition, let's introduce a small chance for a cell to mutate its genome when duplicating.</p><p>Together, these changes define a <strong>search algorithm</strong> for new genomes. When a cell dies, there is an opportunity for a new cell to take its place. So if a cell has a mutation that lets it duplicate faster than its neighbors, its genome will become more prevalent.</p><!--kg-card-begin: html--><hr class=\"gridhr\">\n<figure class=\"kg-card kg-gallery-card\">\n    <div class=\"kg-gallery-container\">\n        <div class=\"kg-gallery-row\">\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/1/2_stall.mp4\"></video>\n                <figcaption>\n                    The original genome only allows a cell to produce a single offspring before dying, so the species is stuck in a low-progress loop.\n                </figcaption>\n            </div>\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/1/3_spread.mp4\"></video>\n                <figcaption>\n                    A mutation occurs giving the cell more Photo parts. Now, it can produce two offspring, and the spread of life begins.\n                </figcaption>\n            </div>\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/1/4_optimal.mp4\"></video>\n                <figcaption>\n                    Photo-dense cells are more likely to produce offspring and claim space. Over time, the population evolves to favor high-Photo genomes.\n\n                </figcaption>\n            </div>\n        </div>\n    </div>\n</figure>\n<hr class=\"gridhr\"><!--kg-card-end: html--><p>Success! New genomes appear. Our search algorithm is working.</p><p>However, once Photo-rich genomes have spread, progress stops.</p><p>The problem here is a lack of <strong>peer dependency</strong>. The most crucial aspect of open-endedness is that solutions must create opportunities for more solutions. In other words, when new organisms appear, new niches must develop. Our lake is full of algae; now it’s time for the algae-eating fish to appear.</p><p>To try and see this effect, let’s introduce two more variations into Cellworld.</p><ol><li>Cells can mutate a Killer part, which will periodically kill nearby cells that do not share the same genome.</li><li>Duplicator and Killer parts are now directional. For example, a cell with a Duplicator part in its upper-right quadrant will only be able to replicate up or right.</li></ol><p>How will these changes affect the complexity of our little world? Let's take a peek.</p><!--kg-card-begin: html--><hr class=\"gridhr\">\n<figure class=\"kg-card kg-gallery-card\">\n    <div class=\"kg-gallery-container\">\n        <div class=\"kg-gallery-row\">\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/1/7_lifeonwall.mp4\"></video>\n                <figcaption>\n                    At first, life is constrained to the right edge of the world. Cells have not yet developed Duplicator parts on their left side, so they cannot spread in that direction.\n                </figcaption>\n            </div>\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/1/8_spread.mp4\"></video>\n                <figcaption>\n                    Species 66 develops a left-side Duplicator, and its offspring begin to spread across the world.\n                </figcaption>\n            </div>\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/1/9_green.mp4\"></video>\n                <figcaption>\n                    For a brief period, life looks similar to before. Cells begin to fill every corner, and cells with more Photo parts begin to display their dominance.\n                </figcaption>\n            </div>\n        </div>\n        <div class=\"kg-gallery-row\">\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/1/10_takeover.mp4\"></video>\n                <figcaption>\n                    The bottleneck to survival is not energy, but space. In comes species AD, who with a crucial Killer part in the top-right corner, begins clearing way for its own children.\n                </figcaption>\n            </div>\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/1/11_war.mp4\"></video>\n                <figcaption>\n                    Soon, two species come out on top. E0 and AD begin a long war, where neither side can gain an upper hand.\n                </figcaption>\n            </div>\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/1/12_03.mp4\"></video>\n                <figcaption>\n                    Breaking the stalemate, a mutation of AD appears and backstabs its ancestor. AD is wiped off the board.\n                </figcaption>\n            </div>\n        </div>\n        <div class=\"kg-gallery-row\">\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/1/13_rebel_a2.mp4\"></video>\n                <figcaption>\n                    Cruicially, 03 cannot attack downwards or left. It cannot defeat E0, the other rival. Luckily, a new species, A2, attacks from the corner and quickly wipes out E0.\n                </figcaption>\n            </div>\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/1/13_world_over.mp4\"></video>\n                <figcaption>\n                    A2 is too small to hold its position. 03 sweeps downwards to take control of the entire world, emerging victorious as the dominant species.\n                </figcaption>\n            </div>\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/1/14_takeover.mp4\"></video>\n                <figcaption>\n                    All empires must fall. Since 03 cannot attack down or left, it has a single weakness -- the bottom-left corner. Species 22 mutates there, and quickly takes the throne. The cycle will continue.\n                </figcaption>\n            </div>\n        </div>\n    </div>\n</figure>\n<hr class=\"gridhr\"><!--kg-card-end: html--><p>So, that was a bit of overdramatization. But you have to admit, with just these two modifications, much more interesting stories emerge. Instead of a single optimal species, we now have a cycle, where a new species can potentially overthrow an older one.</p><p>The key here is that <strong>there is always an opportunity for new genomes.</strong>. When the world is full of Photo cells, a Killer cell can emerge. When the world is full of Killer cells, a new species can take over by attacking from the right direction.</p><p>In an open-ended world, solutions must create opportunities for more solutions. For worlds of interacting organisms, there are three key principles to sustain this behavior:</p><ul><li><strong>Possibility Space:</strong> Organisms must have a large enough genome to describe arbitrarily complex behaviors.</li><li><strong>Peer Dependency:</strong> When new organisms appear, an environment must develop new niches.</li><li><strong>Search Algorithm:</strong> A procedure must find new organisms to fit new niches.</li></ul><p>Since this Cellworld was fairly simple, both the possibility space and peer dependency of cells were limited, so we eventually stopped seeing novel behavior.</p><p>Further work can involve:</p><ul><li>What rules lead to greater peer dependency? Do we need more complex interactions, or perhaps some form of resource system? Can emergent symbiosis occur?</li><li>Is mutation-based evolution the best search algorithm to fulfill new niches?</li></ul><!--kg-card-begin: html--><hr class=\"gridhr\">\n<br>\n<div class=\"float-outside\">\n<div class=\"appendix\">\n    <div class=\"float-label\">\n        Things to Read\n    </div><!--kg-card-end: html--><p><strong><a href=\"https://www.oreilly.com/radar/open-endedness-the-last-grand-challenge-youve-never-heard-of/\">\"Open-endedness: The last grand challenge you’ve never heard of\"</a>, by Kenneth O. Stanley, Joel Lehman and Lisa Soros. </strong>This article is a great motivator for why we should care about open-endedness -- namely, its potential to create innovations that are too complex to be designed for directly. The article also gives an overview of past work in the field their reasonings.</p><p><strong><a href=\"http://eplex.cs.ucf.edu/papers/soros_alife14.pdf\">\"Identifying Necessary Conditions for Open-Ended Evolution through the Artificial Life World of Chromaria\"</a>, by Lisa Soros and Kenneth O. Stanley</strong>. This paper gives a good foundation for finding the principles that allow open-ended evolution to occur. They propose a minimum criterion for survival, and define peer dependency as creating novel ways for new individuals to achieve this minimum criterion.</p><p><strong><a href=\"https://openreview.net/pdf?id=160xFQdp7HR\">\"Self-Organizing Intelligent Matter: A Blueprint for an AI Generating Algorithm\"</a> (Anonymous)</strong>. This recent paper works with open-endedness in the neural network domain. They show an interesting formulation where cells are neural networks that can push/pull chemicals in a gradient around them.</p><!--kg-card-begin: html--><div class=\"float-label\">\n\tAppendix\n</div>    \n<div class=\"float-figure\">\n\t<video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/1/behave.mp4\"></video>\n</div>\n    \n    \nIn a follow-up experiment, here is a Cellworld with a slightly more complicated ruleset. At any timestep, a cell may decide to gain energy, replicate itself, or attack a neighboring cell. A cell's genome is defined as a behavior tree of these actions, along with conditions for them to take place. For exmaple, the origin cell's behavior tree says: duplicate if I have more than 50 energy, otherwise gain energy.\n\nThere are two main evolutionary milestones. First is when species E7 learns an attacking behavior. The second is when species 3E learns to not attack its own offspring, a mutation so strong that it takes over the world.<!--kg-card-end: html--><figure class=\"kg-card kg-image-card\"><img src=\"https://kvfrans.com/content/images/2021/02/behave-1.png\" class=\"kg-image\" alt srcset=\"https://kvfrans.com/content/images/size/w600/2021/02/behave-1.png 600w, https://kvfrans.com/content/images/size/w1000/2021/02/behave-1.png 1000w, https://kvfrans.com/content/images/size/w1600/2021/02/behave-1.png 1600w, https://kvfrans.com/content/images/2021/02/behave-1.png 2222w\" sizes=\"(min-width: 720px) 720px\"></figure><!--kg-card-begin: html--><br><!--kg-card-end: html--><!--kg-card-begin: html--></div><!--kg-card-end: html--></div>"
}