{
  "title": "Implicit Neural Representation as a Differentiable Surrogate for Photon Propagation in a Monolithic Neutrino Detector. (arXiv:2211.01505v1 [physics.ins-det])",
  "link": "http://arxiv.org/abs/2211.01505",
  "description": "<p>Optical photons are used as signal in a wide variety of particle detectors.\nModern neutrino experiments employ hundreds to tens of thousands of photon\ndetectors to observe signal from millions to billions of scintillation photons\nproduced from energy deposition of charged particles. These neutrino detectors\nare typically large, containing kilotons of target volume, with different\noptical properties. Modeling individual photon propagation in form of look-up\ntable requires huge computational resources. As the size of a table increases\nwith detector volume for a fixed resolution, this method scales poorly for\nfuture larger detectors. Alternative approaches such as fitting a polynomial to\nthe model could address the memory issue, but results in poorer performance.\nBoth look-up table and fitting approaches are prone to discrepancies between\nthe detector simulation and the data collected. We propose a new approach using\nSIREN, an implicit neural representation with periodic activation functions, to\nmodel the look-up table as a 3D scene and reproduces the acceptance map with\nhigh accuracy. The number of parameters in our SIREN model is orders of\nmagnitude smaller than the number of voxels in the look-up table. As it models\nan underlying functional shape, SIREN is scalable to a larger detector.\nFurthermore, SIREN can successfully learn the spatial gradients of the photon\nlibrary, providing additional information for downstream applications. Finally,\nas SIREN is a neural network representation, it is differentiable with respect\nto its parameters, and therefore tunable via gradient descent. We demonstrate\nthe potential of optimizing SIREN directly on real data, which mitigates the\nconcern of data vs. simulation discrepancies. We further present an application\nfor data reconstruction where SIREN is used to form a likelihood function for\nphoton statistics.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Lei_M/0/1/0/all/0/1\">Minjie Lei</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Tsang_K/0/1/0/all/0/1\">Ka Vang Tsang</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Gasiorowski_S/0/1/0/all/0/1\">Sean Gasiorowski</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Li_C/0/1/0/all/0/1\">Chuan Li</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Nashed_Y/0/1/0/all/0/1\">Youssef Nashed</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Petrillo_G/0/1/0/all/0/1\">Gianluca Petrillo</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Piazza_O/0/1/0/all/0/1\">Olivia Piazza</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Ratner_D/0/1/0/all/0/1\">Daniel Ratner</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Terao_K/0/1/0/all/0/1\">Kazuhiro Terao</a>"
}