{
  "id": "yt:video:Ln_cVjJl680",
  "yt:videoId": "Ln_cVjJl680",
  "yt:channelId": "UCAczr0j6ZuiVaiGFZ4qxApw",
  "title": "How to Rangify Your Code - Tina Ulbrich - C++ on Sea 2022",
  "link": "",
  "author": {
    "name": "cpponsea",
    "uri": "https://www.youtube.com/channel/UCAczr0j6ZuiVaiGFZ4qxApw"
  },
  "published": "2022-09-24T15:00:13+00:00",
  "updated": "2022-09-24T20:22:10+00:00",
  "media:group": {
    "media:title": "How to Rangify Your Code - Tina Ulbrich - C++ on Sea 2022",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "C++ on Sea Website: https://cpponsea.uk/\nC++ on Sea Twitter: https://twitter.com/cpponsea\n---\n\nHow to Rangify Your Code - Tina Ulbrich - C++ on Sea 2022\nSlides: https://github.com/philsquared/cpponsea-slides/tree/master/2022\n\nBy now you probably know about ranges in C++20. You may have also watched a talk or two about how to create your own view. But now, what do you do with that knowledge? How do you rangify your code? If you find yourself using pre C++20 code because you don't know where to start using ranges, this talk is for you. I'm going to rangify different code examples and try to show you how to think in ranges. I'm going to use the standard library and the range-v3 library.\n---\n\nTina Ulbrich  \n\nTina works at Rosen, a service provider in the oil and gas industry. She writes and maintains numerical and data processing algorithms for pipeline inspection data. She highly values simple, modern and clean code, using the latest language features. She promotes refactoring, high test coverage and collaboration between developers. She also teaches modern C++ in internal tech talks. Tina holds a university degree in Bio-Mathematics from the University of Applied Science in Zittau/Görlitz. She is an active member of the #include Discord community.\n---\n\nC++ on Sea is an annual C++ and coding conference, in Folkestone, in the UK. The 2022 conference was conducted as a two part, physical and online C++ event. \n- Annual C++ on Sea,  C++ conference: https://cpponsea.uk/\n- 2022 Program: https://cpponsea.uk/2022/schedule/\n---\n\nProduced and Edited by Digital Medium Ltd: https://events.digital-medium.co.uk\nEnquiries: events@digital-medium.co.uk\n\n#Programming​​ #CppOnSea​ #ranges",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}