{
  "title": "Faster, Meaner, Deadlier: The Evolution of “BattleBots”",
  "link": "https://spectrum.ieee.org/battlebots-tech-evolution",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-green-and-purple-battlebot-hovers-in-the-air-amid-a-large-number-of-sparks-below-it-is-a-purple-and-red-battlebot.jpg?id=31708905&width=1200&height=800&coordinates=0%2C67%2C0%2C68\"/><br/><br/><p>Earlier this year, <a href=\"https://spectrum.ieee.org/u/anouk-wipprecht\" target=\"_blank\">friend-of-</a><em><a href=\"https://spectrum.ieee.org/u/anouk-wipprecht\">IEEE Spectrum</a></em> and fashiontech designer <a href=\"http://www.anoukwipprecht.nl/bio\" target=\"_blank\">Anouk Wipprecht</a> gave a peek of what it’s like to be a competitor on “BattleBots,” the 22-year-old robot-combat competition, from the preparation “pit” to the arena. Her team, <a href=\"https://battlebots.com/robot/ghost-raptor-2021/\" target=\"_blank\">Ghostraptor</a>, was knocked out of the regular competition after losing its <a href=\"https://spectrum.ieee.org/inside-story-of-battlebots\" target=\"_blank\">first</a> and <a href=\"https://spectrum.ieee.org/battlebot-carnage\" target=\"_blank\">second</a> fights, though they regained some glory by winning a round in the bonus Golden Bolt tournament, which recently finished airing on <a href=\"https://www.tbs.com/shows/battlebots/season-6/episode-15/champions-let-the-slugfest-begin\" target=\"_blank\">the TBS TV channel</a>.</p><p>This week, <a href=\"https://battlebots.com/tickets/\" target=\"_blank\">tickets went on sale</a> for audience seating for the next season of “BattleBots”; filming will commence in October in Las Vegas. We thought it was a good moment to get a different perspective on the show, so <em>Spectrum</em> asked one of the founders of “BattleBots” and its current executive producer, <a href=\"https://www.linkedin.com/in/megagreg\" target=\"_blank\">Greg Munson</a>, about how two decades’ worth of technological progress has impacted the competition. <br/></p><p><strong>What are the biggest changes you’ve seen, technology-wise, over 20 years or so?</strong></p><p><strong>Greg Munson:</strong> Probably the biggest is battery technology. “BattleBots” premiered on Comedy Central in, I think it was, 2000. Now we’re 22 years later. In the early days, people were using car batteries. Then NiCad packs became very popular. But with the advent of lithium technology, when the battery packs could be different sizes and shapes, that’s when things just took off in terms of power-to-weight ratio. Now you can have these massively spinning disk weapons, or bar weapons, or drum weapons that can literally obliterate the other robot.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"A bearded man in a black hat and t-shirt that say Battlebots\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"059a5cf434bfa97bdde2a79a781eebc1\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"04f07\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-bearded-man-in-a-black-hat-and-t-shirt-that-say-battlebots.jpg?id=31709031&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Greg Munson</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Gabe Ginsberg/Getty Images</small></p><p>Second is the [improvement in electronic speed control (ESC) circuitry]. We built a robot called Bombmachine back in the day. And besides its giant gel cell batteries, which were probably a third of the [bot’s total] weight, we had this big old Vantex speed controller with a big giant heat sink. The ESC form factors have gotten smaller. They’ve gotten more efficient. They’re able to handle way more amperage through the system, so they don’t blow up. They’ve got more technology built into them, so the team can have a person monitoring things like heat, and they’ll know when to, for instance, shut a weapon down. You see this a lot now on the show where they’re spinning up really fast, going in for a hit. And then they actually back off the weapon. And watchers will think, “Oh, the weapon’s dead.” But no, they’re actually just letting it cool down because the monitor guy has told his driver, “Hey, the weapon’s hot. I’m getting some readings from the ESC. The weapon’s hot. Give me five seconds.” That kind of thing. And that’s a tremendous strategy boon.</p><p><strong>So instead of just one-way remote control, teams are getting telemetry back from the robots now as well?</strong></p><p><strong>Munson: </strong>A lot of that is starting to happen more and more, and teams like <a href=\"https://battlebots.com/robot/ribbot-2021/\" rel=\"noopener noreferrer\" target=\"_blank\">Ribbot</a> are using that. I think they’re influencing other teams to go that route as well, which is great. Just having that extra layer of data during the fight is huge.</p><p class=\"pull-quote\">CAD gives the robots more personality and character, which is perfect for a TV show.</p><p><strong>What other technologies have made a big difference?</strong></p><p><strong>Munson:</strong> CAD is probably just as big of a technology boost since the ’90s compared to now. In the early “BattleBots” era, a lot of teams were using pencil and paper or little wooden prototypes. Only the most elite, fancy teams back then would use some early version of <a href=\"https://www.solidworks.com/\" target=\"_blank\">Solidworks</a> or <a href=\"https://www.autodesk.com/\" target=\"_blank\">Autodesk</a>. We were actually being hit up by the CAD companies to get more builders into designing in CAD. Back in the day, if you’re going to build a robot without CAD, you think very pragmatically and very form-follows-function. So you saw a lot of robots that were boxes with wheels and a weapon on top. That’s something you can easily just draw on a piece of paper and figure out. And now CAD is just a given. High-school students are designing things in CAD. But when you’ve got CAD, you can play around and reshape items, and you can get a robot like <a href=\"https://battlebots.com/robot/hypershock-2021/\" target=\"_blank\">HyperShock</a>—it looks like there’s no right-angled pieces on HyperShock.</p><p>CAD gives the robots more personality and character, which is perfect for a TV show because we want the audience to go, “Hey, <em>that’s</em> HyperShock, my favorite!” Because of the silhouettes, because of the shape, it’s branded, it’s instantly identifiable—as opposed to a silver aluminum box that has no paint.</p><p class=\"pull-quote\">It quickly became obvious that if there’s a battery fire in the pit, with the smoke and whatnot, that’s a no-go.</p><p><strong>When Anouk was writing about being a competitor, she pointed out that there’s quite a strict safety regime teams have to follow, especially with regard to batteries, which are stored and charged in a separate area where competitors have to bring their robots before a fight. How did those rules evolve?</strong></p><p><strong>Munson:</strong> It’s part “necessity is the mother of invention” and part you just know the lithium technology is more volatile. We have a really smart team that helps us do the rules—there are some EEs on there and some mechanical engineers. They know about technology issues even before they hit the awareness of the general public. The warning shots were there from the beginning—lithium technology can burn, and it keeps on burning. We started out with your basic bucket full of sand and special fire extinguishers along the arena side and in the pit where people were fixing the robots. Every row had a bucket of sand and a protocol for disposing of the batteries properly and safely. But it quickly became obvious that if there’s a battery fire in the pit, with the smoke and whatnot, that’s a no-go. So we quickly pivoted away from that [to a separate] battery charging pit.</p><p>We’ve seen batteries just go up, and they don’t happen in the main pit; they happen in the battery pit—which is a huge, huge win for us because that’s a place where we know exactly how to deal with that. There’s staff at the ready to put the fires out and deal with them. We also have a battery cool-down area for after a fight. When the batteries have just discharged massive amounts of energy, they’re hot and some of them are puffing. They get a full inspection. You can’t go back to the pit after your match. You have to go to the battery cool-down area—it’s outside, it’s got fans, it’s cool. A dedicated safety inspector is there inspecting the batteries, making sure they’re not on the verge of causing a fire or puffing in any kind of way. If it’s all good, they let them cool down and stay there for 10, 15 minutes, and then they can go back to the battery-charging tent, take the batteries out and recharge them, and then go back to fixing the robot. If the batteries are not good, they are disposed of properly.</p><p><strong>The technology has become more flexible, but how do you prevent competitors from just converging on a handful of optimal design solutions, and all start looking alike?</strong></p><p><strong>Munson: </strong>That’s a constant struggle. Sometimes we win, and sometimes we lose. A lot of it is in the judging rules, the criteria. We’ve gone through so many iterations of the judging rules because builders love to put either a fork, a series of forks, or a wedge on their bot. Makes total sense because you can scoop the guy up and hit them with your weapon or launch them in the air. So okay, if you’re just wedging the whole fight, is that aggressive? Is that control? Is that damage? And so back in the day, we were probably more strict and ruled that if you all you do is just wedge, we actually count it against you. We’ve loosened up there. Now, if all you do is wedge, it only counts against you just a little bit. But you’ll never win the aggression category if all you’re going to do is wedge.</p><p>Because a wedge can beat everything. We often saw the finals would be between a big gnarly spinner and a wedge. Wedges are a very effective, simple machine that can clean up in robot combat. So we’re tweaking how we count the effectiveness of wedges and our judging guide if the fight goes to judges. Meanwhile, we don’t <em>want</em> it to go to judges. We want to see a knockout. So we demand that you have to have an active weapon. You can’t just have a wedge. It has to be a robust, active weapon that can actually cause damage. You just can’t put a Home Depot drill on the top of your robot and call it a day. That was just something we knew we needed to have to push the sport forward. What seems to be happening is the vertical spinners are now sort of the dominant class.</p><p>We don’t want the robots to be homogenized. That’s one of the reasons why we allow modifications during the actual tournament. Certain fans have gotten mad at us, like, “Why’d you let them add this thing during the middle of the tournament?” Because we <em>want</em> that. We want that spirit of ingenuity and resourcefulness. We want to break any idea of “vertical spinners will always win.” We want to see different kinds of fights because people will get bored otherwise. Even if there’s massive amounts of destruction, which always seems to excite us, if it’s the same kind of destruction over and over again, it starts to be like an explosion in <em>Charlie’s Angels</em> that I’ve seen 100 times, right? A lot of robots are modular now, where they can swap out a vertical spinner for a horizontal undercutter and so on. This will be a constant evolution for our entire history. If you ask me this question 20 years from now, I’m going to still be saying it’s a struggle!</p>",
  "pubDate": "Thu, 15 Sep 2022 16:13:51 +0000",
  "guid": "https://spectrum.ieee.org/battlebots-tech-evolution",
  "category": [
    "Battlebots",
    "Batteries",
    "Cad",
    "Robots"
  ],
  "dc:creator": "Stephen Cass",
  "media:content": ""
}