{
  "id": "yt:video:RHCA5b9TkVg",
  "yt:videoId": "RHCA5b9TkVg",
  "yt:channelId": "UCX6b17PVsYBQ0ip5gyeme-Q",
  "title": "Rap and Hip Hop: Crash Course Black American History #47",
  "link": "",
  "author": {
    "name": "CrashCourse",
    "uri": "https://www.youtube.com/channel/UCX6b17PVsYBQ0ip5gyeme-Q"
  },
  "published": "2022-09-20T19:00:08+00:00",
  "updated": "2022-10-27T02:12:36+00:00",
  "media:group": {
    "media:title": "Rap and Hip Hop: Crash Course Black American History #47",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Music is an integral part of Black American culture. Today, Clint Smith will teach you about rap & hip hop, and the cultural significance of artists including Public Enemy, Wu-Tang Clan, the Notorious B.I.G., Tupac, N.W.A., Queen Latifah, and Missy Elliott. And he just might break dance while doing it.\n\nClint's book, How the Word is Passed is available now! https://bookshop.org/books/how-the-word-is-passed-a-reckoning-with-the-history-of-slavery-across-america/9780316492935 \n\nSOURCES:\nhttps://www.nbcnews.com/id/wbna19680493\nJanell Hobson and R. Dianne Bartlow eds., Representin’: Women, Hip-Hop, and Popular Music (Durham, N.C.: Duke University Press, 2008). \nBrittney Cooper, Susana M. Morris, and Robin M. Boylorn eds., The Crunk Feminist Collection (New York: The Feminist Press at CUNY, 2017). \n Robin D. G. Kelley, Race Rebels: Culture, Politics, and the Black Working Class (New York: Free Press, 1994). \nJames Haskins, One Nation Under a Groove: Rap Music and its Roots (New York: Hyperion Books, 2000).\nAdam Woog, From Ragtime to Hip-Hop: A Century of Black American Music (Detroit: Lucent Books, 2007).\n\nWatch our videos and review your learning with the Crash Course App! \nDownload here for Apple Devices: https://apple.co/3d4eyZo\nDownload here for Android Devices: https://bit.ly/2SrDulJ\n\nCrash Course is on Patreon! You can support us directly by signing up at http://www.patreon.com/crashcourse\n\nThanks to the following patrons for their generous monthly contributions that help keep Crash Course free for everyone forever:\nDylan Mandelblatt, Katie, Hilary Sturges, Austin Zielman, Tori Thomas, Justin Snyder, Hasan Jamal, DL Singfield, Amelia Ryczek, Ken Davidian, Stephen Akuffo, Toni Miles, Steve Segreto, Kyle & Katherine Callahan, Laurel Stevens, Michael Wang, Stacey J, Burt Humburg, Allyson Martin, Aziz Y, Shanta, DAVID MORTON HUDSON, Perry Joyce, Scott Harrison, Mark & Susan Billian, Alan Bridgeman, Rachel Creager, Breanna Bosso, Matt Curls, Tim Kwist, Jonathan Zbikowski, Jennifer Killen, Sarah & Nathan Catchings, team dorsey, Trevin Beattie, Eric Koslow, Jennifer Dineen, Indika Siriwardena, Jason Rostoker, Shawn Arnold, Siobhán, Ken Penttinen, Nathan Taylor, Les Aker, William McGraw, ClareG, Rizwan Kassim, Constance Urist, Alex Hackman, Jirat, Pineapples of Solidarity, Katie Dean, Wai Jack Sin, Ian Dundore, Justin, Mark, Caleb Weeks\n__\n\nWant to find Crash Course elsewhere on the internet?\nFacebook - http://www.facebook.com/YouTubeCrashCourse\nTwitter - http://www.twitter.com/TheCrashCourse\nInstagram - https://www.instagram.com/thecrashcourse/\n\nCC Kids: http://www.youtube.com/crashcoursekids",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}