{
  "title": "Teenagers could be missing out on a stash of cash",
  "link": "https://www.asianexpress.co.uk/2022/10/teenagers-could-be-missing-out-on-a-stash-of-cash/",
  "comments": "https://www.asianexpress.co.uk/2022/10/teenagers-could-be-missing-out-on-a-stash-of-cash/#respond",
  "dc:creator": "Andleeb Hanif",
  "pubDate": "Thu, 27 Oct 2022 13:38:11 +0000",
  "category": [
    "News",
    "child trust fund",
    "government&#039;s child trust fund",
    "how to find a lost child trust fund",
    "lost child trust fund",
    "money for teenagers"
  ],
  "guid": "https://www.asianexpress.co.uk/?p=45708",
  "description": "<p>Tens of thousands of teenagers in the UK who have not yet claimed their matured Child Trust Funds savings could have thousands of pounds waiting for them, reminds HM Revenue and Customs (HMRC). Child Trust Funds are long-term savings accounts set up for every child born between 1 September 2002 and 2 January 2011. To [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.asianexpress.co.uk/2022/10/teenagers-could-be-missing-out-on-a-stash-of-cash/\">Teenagers could be missing out on a stash of cash</a> appeared first on <a rel=\"nofollow\" href=\"https://www.asianexpress.co.uk\">Asian Express Newspaper</a>.</p>\n",
  "content:encoded": "\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"684\" height=\"1024\" src=\"https://www.asianexpress.co.uk/wp-content/uploads/2022/10/child-kisses-mums-head-bank-card_22-684x1024.jpeg\" alt=\"\" class=\"wp-image-45711\"/></figure>\n\n\n\n<p>Tens of thousands of teenagers in the UK who have not yet claimed their matured Child Trust Funds savings could have thousands of pounds waiting for them, reminds HM Revenue and Customs (HMRC).</p>\n\n\n\n<p>Child Trust Funds are long-term savings accounts set up for every child born between 1 September 2002 and 2 January 2011. To encourage future saving and start the account, the government provided an initial deposit of at least £250.</p>\n\n\n\n<p>The savings accounts mature when the child turns 18 years old. Eligible teenagers, who are aged 18 or over and have yet to access their Child Trust Fund account, could have savings waiting for them worth an average of £2,100.</p>\n\n\n\n<p>If teenagers or their parents and guardians already know who their Child Trust Fund provider is, they can contact them directly. This might be a bank, building society or other savings provider.</p>\n\n\n\n<p>Alternatively, they can visit <a href=\"https://www.gov.uk/\" target=\"_blank\" rel=\"noreferrer noopener\">GOV.UK</a> and complete an online form to find out where their Child Trust Fund is held.</p>\n\n\n\n<p>Many eligible teenagers who have yet to claim their savings might be starting university, apprenticeships or their first job. The lump-sum amount could offer a financial boost at a time when they need it most.</p>\n\n\n\n<p>Angela MacDonald, HMRC’s Second Permanent Secretary and Deputy Chief Executive, said: “Teenagers could have a pot of money waiting for them worth thousands of pounds and not even realise it. We want to help you access your savings and the money you’re entitled to.</p>\n\n\n\n<p>An estimated 6.3 million Child Trust Fund accounts were set up throughout the duration of the scheme, containing about £9 billion. If a parent or guardian was not able to set up an account for their child, HMRC opened a savings account on the child’s behalf.</p>\n\n\n\n<p>Teenagers aged 16 or over can take control of their own Child Trust Fund if they wish, although the funds can only be withdrawn once they turn 18 years old.</p>\n\n\n\n<p>Where children have a Child Trust Fund, families can still pay in up to £9,000 a year tax-free. The account matures once the child turns 18 years old and no further money can be deposited. They can either withdraw the funds from the matured Child Trust Fund account or reinvest it into another savings account.</p>\n\n\n\n<p>Until the child withdraws or transfers the money, it stays in an account that no-one else has access to.</p>\n\n\n\n<p>The Child Trust Fund scheme closed in January 2011 and was replaced with Junior Individual Savings Accounts (ISA).</p>\n\n\n\n<p class=\"has-white-color has-black-background-color has-text-color has-background\">To find out more search <a href=\"https://www.gov.uk/child-trust-funds\" target=\"_blank\" rel=\"noreferrer noopener\">‘Child Trust Fund’</a> on GOV.UK</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.asianexpress.co.uk/2022/10/teenagers-could-be-missing-out-on-a-stash-of-cash/\">Teenagers could be missing out on a stash of cash</a> appeared first on <a rel=\"nofollow\" href=\"https://www.asianexpress.co.uk\">Asian Express Newspaper</a>.</p>\n",
  "wfw:commentRss": "https://www.asianexpress.co.uk/2022/10/teenagers-could-be-missing-out-on-a-stash-of-cash/feed/",
  "slash:comments": 0
}