{
  "id": "yt:video:g5C5bwS4p7s",
  "yt:videoId": "g5C5bwS4p7s",
  "yt:channelId": "UC0-gvTKzYKQcjzKcSPfeIkA",
  "title": "Yang-Mills and Mass Gap (Millennium Prize Problem!)",
  "link": "",
  "author": {
    "name": "Kinertia",
    "uri": "https://www.youtube.com/channel/UC0-gvTKzYKQcjzKcSPfeIkA"
  },
  "published": "2019-03-16T05:44:44+00:00",
  "updated": "2022-05-25T11:49:39+00:00",
  "media:group": {
    "media:title": "Yang-Mills and Mass Gap (Millennium Prize Problem!)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The Yang-Mills and mass gap problem is another one of the elusive millennium prize problems – a set of seven problems given in the year 2000 by the Clay Mathematical Institute, and solving one of them can earn you a million dollars. The Yang-Mills problem is one of them. \n\nThe mathematical framework on which quantum mechanics is based is not elementary. There is no concept of what we would call velocity or the trajectory of a particle. Instead, particles are indistinguishable from waves. You can imagine a particle in quantum mechanics as simply a region of space with some properties. Now, in school you probably learnt of the concept of a plane, a region on which it’s possible to draw figures like lines, triangles, circles, or other interesting types of curves. Similarly, you can make 3-Dimensional space, which differs from a plane by having an extra dimension – height. Usually, the three dimensions of length, breadth, and height comprise space.\n\nThe problem is phrased as follows:\n\nYang–Mills Existence and Mass Gap: Prove that for any compact simple gauge group G, a non-trivial quantum Yang–Mills theory exists on R^4 and has a mass gap Δ is greater than zero. Existence includes establishing axiomatic properties at least as strong as those cited in Streater & Wightman (1964), Osterwalder & Schrader (1973) and Osterwalder & Schrader (1975).\n\n-----\n\nMusic: http://www.bensound.com/royalty-free-music\nhttps://creativecommons.org/licenses/by-nd/3.0/legalcode\n\nDr Turtle - Which that is this? \n(https://freemusicarchive.org/music/Doctor_Turtle/Jonahs_Message_for_New_York/Which_That_Is_This)\n(https://creativecommons.org/licenses/by/4.0/legalcode)\n-------\n\nImages:\n\nPanoptik [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0/)]\nhttps://commons.wikimedia.org/wiki/File:Nuclear_fusion_forces_diagram.svg\n\nJoel Holdsworth (Joelholdsworth) - Non-Derived SVG of Radiate_gluon.png, originally the work of SilverStar at Feynmann-diagram-gluon-radiation.svg\nhttps://creativecommons.org/licenses/by-sa/3.0/legalcode\n\nOriginal:No machine-readable author provided. NekoJaNekoJa assumed (based on copyright claims).Vector:Johannes Kalliauer [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)]\nhttps://upload.wikimedia.org/wikipedia/commons/c/cd/Double-slit.svg\n\n------",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}