{
  "title": "A Dose of Hope: Psychedelic-Assisted Therapy for PTSD And Other Conditions With Dr. Dan Engle (167)",
  "link": "https://therapistuncensored.com/episodes/psychedelic-assisted-therapy-with-dr-dan-engle-167/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=psychedelic-assisted-therapy-with-dr-dan-engle-167",
  "pubDate": "Tue, 18 Jan 2022 01:00:08 +0000",
  "guid": "https://therapistuncensored.com/?p=12412",
  "description": "What&#039;s the excitement about?  Catch up on psychedelic-assisted therapy by learning more about psilocybin, MDMA, ketamine, ibogaine and more with this episode featuring Dr. Dan Engle of Kuya Institue of Transformational Medicine.",
  "enclosure": "",
  "itunes:subtitle": "Modern healing and personal transformation using ancient practices and molecules",
  "itunes:summary": "The use of psychedelics is slowly gaining favor as part of a holistic approach and is radically changing the way we think about therapy and psychiatric medicine. In this episode, Sue Marriott LCSW, CGP discusses the therapeutic use of psychedelics with Dr. Dan Engle, the Founder and Medical Director of Kuya Institute for Transformational Medicine in Austin, Texas.<br />\n<br />\nPsychedelic-assisted psychotherapy (PAP) refers to professionally supervised use of ketamine, MDMA, psilocybin, LSD and ibogaine as part of a carefully elaborated psychotherapeutic process. Clinical results so far have shown safety and efficacy, even for “treatment resistant” conditions, and far superior effects than traditional therapies alone, or traditional medicines such as antidepressants.  In addition, the treatment is short-term and typically has little side effects or risk with careful and adequate screening.<br />\nThis treatment isn&#039;t new, actually, the use of plants to achieve non-ordinary states of mind for wellbeing is ancient.  But there has been a renaissance in exploring non-ordinary states as route to healing and the PAP model opens up interesting questions regarding diagnostics and explanation of psychological distress.  It may serve to advance novel explanations for mental disorders and their treatment, in a way that considers social and cultural factors, historical adversities, and acute trauma.  Find more www.therapistuncensored.com/episodes",
  "itunes:author": "Dr. Dan Engle",
  "itunes:image": "",
  "itunes:season": 6,
  "itunes:episode": 167,
  "itunes:title": "A Dose of Hope Psychedelic-Assisted Therapy with Dr. Dan Engle",
  "itunes:duration": "1:10:40"
}