{
  "id": "tag:blogger.com,1999:blog-8698702854482141883.post-2740640598188240659",
  "published": "2022-10-04T09:00:00.001-07:00",
  "updated": "2022-10-04T09:00:00.228-07:00",
  "category": [
    "",
    "",
    "",
    ""
  ],
  "title": "Flutter SLSA Progress & Identity and Access Management through Infrastructure As Code",
  "content": "We are excited to announce several new achievements in <a href=\"https://dart.dev/\" target=\"_blank\">Dart</a> and <a href=\"https://flutter.dev/\" target=\"_blank\">Flutter's</a>&nbsp;mission to <a href=\"https://github.com/flutter/flutter/wiki/Roadmap#infrastructure\" target=\"_blank\">harden security</a>. We have achieved Supply Chain Levels for Software Artifacts (SLSA) <a href=\"https://slsa.dev/spec/v0.1/levels#summary-of-levels\" target=\"_blank\">Level 2</a> security on Flutter’s Cocoon application, reduced our Identity and Access Management permissions to the minimum required access, and implemented Infrastructure-as-Code to manage permissions for some of our applications. These achievements follow our recent success to <a href=\"https://opensource.googleblog.com/2022/06/Dart-and-Flutter-enable-Allstar-and-Security-Scorecards.html\" target=\"_blank\">enable Allstar and Security Scorecards</a>.<br /><h2 style=\"text-align: left;\">Highlights</h2><b>Achieving Flutter’s Cocoon SLSA level 2:</b> Cocoon application provides continuous integration orchestration for Flutter Infrastructure. Cocoon also helps integrate several CI services with Github and provides tools to make Github development easier. Achieving SLSA Level 2 for Cocoon means we have addressed all the security concerns of levels 1 and 2 across the application. Under SLSA Level 2, Cocoon has “<a href=\"https://slsa.dev/spec/v0.1/levels#detailed-explanation\" target=\"_blank\">extra resistance to specific threats</a>” to its supply chain. The Google Open Source Security team has audited and validated our achievement of SLSA Level 2 for Cocoon.<div><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhGrRztFuB4D1jf6rJg5vMZUIa560sKRC8eQlV8Oco5d2N2PmO4pHMxiSW88wW4eLIoEX4F7YTuKpwLuKYt_JQFRXVR8DFAWKEfodyDN77OfKLaC33ZCm6ZoRNMKShYC919PE2e4CLqxq58zTjbauMBKjp52Lj6B6L6acVgkm5rhhGr7yYa9wYW_W5V/s512/unnamed%20(13).png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"288\" data-original-width=\"512\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhGrRztFuB4D1jf6rJg5vMZUIa560sKRC8eQlV8Oco5d2N2PmO4pHMxiSW88wW4eLIoEX4F7YTuKpwLuKYt_JQFRXVR8DFAWKEfodyDN77OfKLaC33ZCm6ZoRNMKShYC919PE2e4CLqxq58zTjbauMBKjp52Lj6B6L6acVgkm5rhhGr7yYa9wYW_W5V/s16000/unnamed%20(13).png\" /></a></div><br /><b>Implementing Identity &amp; Access Management (IAM) via Infrastructure-as-Code: </b>We have implemented additional security hardening features by onboarding docs-flutter-dev, master-docs-flutter-dev, and flutter-dashboard to use Identity and Access Management through an Infrastructure-as-Code system. These projects host applications, provide public documentation for Flutter, and contain a dashboard website for Flutter build status.<br /><br />Using our Infrastructure-as-Code approach, security permission changes require code changes, ensuring approval is granted before the change is made. This also means that changes to security permissions are audited through source control and contain associated reasoning for the change. Existing IAM roles for these applications have been pared so that the applications <a href=\"https://cloud.google.com/blog/products/application-development/least-privilege-for-cloud-functions-using-cloud-iam\" target=\"_blank\">follow the Principle of Least Privilege</a>.<br /><h2 style=\"text-align: left;\">Advantages</h2><ul style=\"text-align: left;\"><li>Achieving SLSA Level 2 for Cocoon means we have addressed all the security concerns of levels 1 and 2 across the application. Under SLSA Level 2, Cocoon has “extra resistance to specific threats” to its supply chain.</li></ul><ul style=\"text-align: left;\"><li>Provenance is now generated for both, flutter-dashboard and auto-submit, artifacts through Cocoon’s automated build process. Provenance on these artifacts shows proof of their code source and tamper-proof build evidence. This work helps harden the security on the multiple tools used during the Cocoon build process: Google Cloud Platform, Cloudbuild, App Engine, and Artifact Registry.</li></ul><ul style=\"text-align: left;\"><li>Overall we addressed <b>83% of all SLSA requirements across all levels</b> for the Cocoon application. We have identified the work across the application which will need to be completed for each level and category of SLSA compliance. Because of this, we know we are well positioned to continue future work toward SLSA Level 4. </li></ul><h2 style=\"text-align: left;\">Learnings and Best Practices</h2> <ol> <li>Relatively small changes to the Cocoon application’s build process significantly increased the security of its supply chain. Google Cloud Build made this simple, since <a href=\"https://cloud.google.com/build/docs/securing-builds/view-build-provenance\">provenance metadata is created automatically</a> during the Cloud Build process.</li><p></p><li>Regulating IAM permissions through code changes adds many additional benefits and can make granting first time access simpler.</li><p></p><li>Upgrading the SLSA level of an application sometimes requires varying efforts depending on the different factors of the application build process. Working towards SLSA level 4 will likely necessitate different configuration and code changes than required for SLSA level 2.</li><p></p><p></p></ol><h3 style=\"text-align: left;\">Coming Soon</h3>Since this is the beginning of the Flutter and Dart journey toward greater SLSA level accomplishments, we hope to apply our learnings to more applications. We hope to begin work toward SLSA level 2 and beyond <b>for more complex repositories</b> like <a href=\"https://github.com/flutter/flutter\" target=\"_blank\">Flutter/flutter</a>. Also, we hope to achieve an <b>even higher level of SLSA</b> compliance for the Cocoon application.<br /><div style=\"text-align: left;\"><h3>References</h3><a href=\"https://slsa.dev/\" target=\"_blank\">Supply Chain Levels for Software Artifacts (SLSA)</a> is a security framework which outlines levels of supply chain security for an application as a checklist.<br /><br /><i>By Jesse Seales, Software Engineer – Dart and Flutter Security Working Group</i></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Open Source Programs Office",
    "uri": "http://www.blogger.com/profile/11192158996903493674",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}