{
  "itunes:episodeType": "full",
  "itunes:title": "Boundaries We Need and Deserve (with Nedra Tawwab)",
  "title": "Boundaries We Need and Deserve (with Nedra Tawwab)",
  "itunes:author": "JLML Press",
  "description": "<p>Janet is joined by Nedra Tawwab: therapist, relationship expert, and author of the NY Times best-seller “Set Boundaries, Find Peace.” Nedra and Janet discuss how our personal boundaries with friends, family, co-workers, and children are crucial for building positive, healthy relationships. Nedra emphasizes how boundaries begin with being kinder to ourselves. \"We are in relationships from the time we're born,” Nedra says, “and the biggest relationship, the most consistent relationship we have is the one with ourselves. And that is the relationship that I'm constantly trying to improve.\" Ultimately, the boundaries and self-image we nurture for ourselves teach our children what they deserve in their relationships, now and in the future.</p><p>For more information and resources from Nedra, including her best-selling book \"Set Boundaries, Find Peace,\" go to: https://www.nedratawwab.com/</p><p>Thanks to Better Help for sponsoring this episode. Learn more and save 10% off your first month at BetterHelp.com/RESPECT.</p><p>For more advice on common parenting issues, please check out Janet's best-selling books on Audible, FREE with a 30-day trial membership if you use this link: adbl.co/2OBVztZ.</p><p>Paperbacks and e-books are available at Amazon, Google Play, Barnes & Noble, and Apple Books. </p><p>Janet's exclusive audio series \"Sessions\" is available for download. This is a collection of recorded one-on-one consultations with parents discussing their most immediate and pressing concerns (www.SessionsAudio.com). </p><br/><br/>Advertising Inquiries: <a href='https://redcircle.com/brands'>https://redcircle.com/brands</a><br/><br/>Privacy & Opt-Out: <a href='https://redcircle.com/privacy'>https://redcircle.com/privacy</a>",
  "content:encoded": "<p>Janet is joined by Nedra Tawwab: therapist, relationship expert, and author of the NY Times best-seller “Set Boundaries, Find Peace.” Nedra and Janet discuss how our personal boundaries with friends, family, co-workers, and children are crucial for building positive, healthy relationships. Nedra emphasizes how boundaries begin with being kinder to ourselves. &#34;We are in relationships from the time we&#39;re born,” Nedra says, “and the biggest relationship, the most consistent relationship we have is the one with ourselves. And that is the relationship that I&#39;m constantly trying to improve.&#34; Ultimately, the boundaries and self-image we nurture for ourselves teach our children what they deserve in their relationships, now and in the future.</p><p>For more information and resources from Nedra, including her best-selling book &#34;Set Boundaries, Find Peace,&#34; go to: https://www.nedratawwab.com/</p><p>Thanks to Better Help for sponsoring this episode. Learn more and save 10% off your first month at BetterHelp.com/RESPECT.</p><p>For more advice on common parenting issues, please check out Janet&#39;s best-selling books on Audible, FREE with a 30-day trial membership if you use this link: adbl.co/2OBVztZ.</p><p>Paperbacks and e-books are available at Amazon, Google Play, Barnes &amp; Noble, and Apple Books. </p><p>Janet&#39;s exclusive audio series &#34;Sessions&#34; is available for download. This is a collection of recorded one-on-one consultations with parents discussing their most immediate and pressing concerns (www.SessionsAudio.com). </p><br/><br/>Advertising Inquiries: <a href='https://redcircle.com/brands'>https://redcircle.com/brands</a><br/><br/>Privacy & Opt-Out: <a href='https://redcircle.com/privacy'>https://redcircle.com/privacy</a>",
  "enclosure": "",
  "guid": "6bb6fbf6-5dee-42aa-82bc-28f78095f1b2",
  "link": "http://www.janetlansbury.com",
  "pubDate": "Tue, 01 Nov 2022 10:00:00 &#43;0000",
  "itunes:duration": 1684,
  "itunes:explicit": "no"
}