{
  "title": "Alibaba Cloud announces final nominees for AsiaStar 10×10 campaign to recognize innovation in Southeast Asia",
  "link": "https://www.digitalnewsasia.com/startups/alibaba-cloud-announces-final-nominees-asiastar-10-10-campaign-recognize-innovation",
  "description": "<!-- START FIELD TEMPLATE -->\n\n\n<div class=\"d-flex justify-content-start flex-wrap\">\n      <div class=\"body\">\n      <ul>\n<li><em><strong>11 out of 100 awardees are based in Malaysia including Saora Industries</strong></em></li>\n<li><em><strong>Part of Project AsiaForward initiative to celebrate tech led entities in SEA</strong></em></li>\n</ul>\n<p><img alt=\"The Malaysian awardees with Alibaba Cloud executives at the Aspara Conference held on Nov 4th in Kuala Lumpur.\" class=\"caption\" src=\"/sites/default/files/images/Alibaba%20Cloud%20AsiaStar%20Malaysian%20winners.jpg\" style=\"width: 100%;\" /></p>\n<p>As part of its Project AsiaForward initiative, Alibaba Cloud has teamed up with tech ecosystem partners to celebrate the diverse achievements of tech-driven entities in Southeast Asia.</p>\n<p>Known as <a href=\"https://asiastar10x10.kr-asia.com/\">AsiaStar 10</a><a href=\"https://asiastar10x10.kr-asia.com/\">×</a><a href=\"https://asiastar10x10.kr-asia.com/\">10</a>, the initiative gives recognition to 100 companies, communities, and projects in ten categories across the region. Ten awardees were chosen for each category. The categories are:</p>\n<ol>\n<li><strong>Trailblazers</strong> are Series B to pre-IPO companies that have played an essential role in driving technological innovation in the region.</li>\n<li><strong>Gamechangers</strong> made moves that set precedents or broke records in Southeast Asia.</li>\n<li><strong>Growth</strong> includes early-stage startups that are developing unique and innovative products and solutions, and have raised funds up to Series B.</li>\n<li><strong>Enablers</strong> are SaaS companies that provide crucial support to enterprises of every stripe.</li>\n<li><strong>Explorers</strong> are Chinese startups that have successfully ventured into the region and established a strong presence.</li>\n<li><strong>Open Source</strong> highlights projects that have accelerated the region’s digitalization by giving other entities the tools they need to build new applications.</li>\n<li><strong>Frontiers</strong> includes startups that are developing deeply technical products, such as quantum computing, biotech and medical advancements, space tech, and more.</li>\n<li><strong>Impact</strong> comprises startups that have brought about significant grassroots-level advancements where they operate.</li>\n<li><strong>Investors</strong> are the equity firms that provide the fuel startups need to grow, and are evaluated for the impact they showcase.</li>\n<li><strong>Launchpads</strong> are educational institutions, incubators, and accelerators that have provided safe environments to nurture great startups.</li>\n</ol>\n<p>The awardees were selected from the list of final nominees curated by representatives of Alibaba Cloud, government agencies, investors, industry experts, and media outlets. They considered a variety of factors, such as revenue, funding, impact, uniqueness, potential, and more.</p>\n<p>The following are some of the final awardees for each category, with a focus on the 11 Malaysian based companies. The full list can be viewed <a href=\"https://asiastar10x10.kr-asia.com/awardees-2022/\">here</a>.</p>\n<p><img alt=\"\" src=\"/sites/default/files/images/Asiastar%2010x10.jpg\" style=\"width: 100%;\" /></p>\n<p><em><u><strong>Trailblazers</strong></u></em></p>\n<p><em>Series B to pre-IPO companies that have played an essential role in driving technological innovation in the region</em></p>\n<ul>\n<li><strong>Aerodyne</strong> — A DT3 (Drone tech, data tech, and digital transformation) solutions provider, Malaysia headquartered Aerodyne has operations in 35 countries and manages the infrastructure assets of over 300,000 clients, making it the world’s second-largest drone service company. Its Drone as a Service (DaaS) program helps to scale projects such as infrastructure planning and risk identification by collecting data with drones and processing it via AI analysis.</li>\n<li><strong>eFishery</strong> — eFishery offers an integrated end-to-end platform providing fish and shrimp farmers access to technology, feed, financing, and markets. The company started out by offering fish and shrimp farmers in Indonesia a digitally-controlled ‘smart feeder’ which offers automatic feeding coinciding with a mobile app where farmers can input variables such as fish and shrimp type, feed quantity and pellet size, feeding frequency, and feeding schedule. Since launching in 2013, eFishery has deployed thousands of its smart feeders to more than <a href=\"https://agfundernews.com/efishery-nets-90m-for-series-c-round-aquaculture\">30,000 fish and shrimp farmers across 27 of Indonesia’s 34 provinces</a>.</li>\n<li><strong>Jirnexu</strong> — Jirnexu develops digital acquisition and lifecycle management solutions for Malaysian banks, insurance companies, and service providers. Solutions developed by Jirnexu are known to offer expansive reach, lower acquisition costs, and added convenience for customers. Reduction in acquisition costs enables its clients to pass on savings to their customers, making financial services more accessible. Jirnexu is the parent company of three main products: RinggitPlus, KreditGoGo, and XpressApply.</li>\n</ul>\n<h3> </h3>\n<p><em><u><strong>Gamechangers</strong></u></em></p>\n<p><em>Company moves that set precedents or broke records in Southeast Asia</em></p>\n<ul>\n<li><strong>Grab’s IPO</strong> — Grab went public on NASDAQ in a US$40 billion SPAC deal in December 2021, allowing the ride-hailing company to raise US$4.5 billion in cash proceeds. Grab’s listing is the largest U.S. listing so far by a Southeast Asian company. As the first SPAC merger of an SEA unicorn, this marks an inspirational and mind-blowing event in the region.</li>\n<li><strong>Bukalapak’s IPO</strong> — At the time of its listing, Bukalapak claimed the largest IPO in IDX&#039;s history. It is Indonesia&#039;s first tech unicorn that got listed on the stock exchange, raising US$1.5 billion in August 2021. Bukalapak&#039;s stock price rose almost 25% only minutes after the market was opened on its debut day.</li>\n<li><strong>Merger deal between Gojek and Tokopedia</strong> — Grab&#039;s biggest competitor in Indonesia merged with ecommerce provider Tokopedia in May 2021 to allow for a move to become a super app in the biggest merger deal in Indonesia. The company debuted on Indonesia’s IDX in Apr 2022, raising US$1.1 billion. As an entity, GoTo contributes 2% to the country’s GDP,  more than <a href=\"https://businesschief.asia/corporate-finance/gojek-tokopedia-story-indonesias-biggest-merger\">US$1.8 billion</a> in transactions, and has over 100 million monthly active users.</li>\n</ul>\n<h3><u><em style=\"font-size: 1rem;\">Growth</em></u></h3>\n<h3><em style=\"font-size: 1rem;\">Early-stage startups that are developing unique and innovative products and solutions, and have raised funds up to Series B</em></h3>\n<ul>\n<li><strong>Rovula</strong> — Rovula is a subsea robotics developer building new machines for subsea inspection, repair, and maintenance. While conventional methods of subsea inspection and maintenance are costly in terms of money and time, Rovula&#039;s products, including unmanned vessels and a data platform, can cut those costs by <a href=\"https://kr-asia.com/rovula-is-developing-efficient-tools-for-subsea-operational-upkeep\">50%</a>.</li>\n<li><strong>Eatcosys</strong> — Malaysian based Eatcosys is an F&amp;B and retail technology solution provider to help businesses transform and reinvent their business models. It offers over ten services and solutions including catering and event venue booking, food delivery, loyalty and retail management solutions, food search insights, venture capital, and money lending to local businesses.  Examples of their solutions include FoodAdvisor, MyCookingStory, and FeedMyGuest.</li>\n<li><strong>PolicyStreet</strong> — PolicyStreet offers a digital platform that allows consumers and businesses to purchase insurance products and services in a more affordable and accessible manner. It currently has 40 insurance partners, served more than 250,000 customers in Malaysia, and empowered them with more than 50,000 insurance policies.</li>\n<li><strong>GlobalTrack Smart Logistics</strong> — GlobalTrack Smart Logistics is a platform that aims to help SMEs in Malaysia to track and manage their fleet operations safely and effectively through remote GPS monitoring. Its delivery management and fleet telematics systems are able to help fleet owners to monitor their logistic operations, fleet vehicles, and drivers in real-time, minimizing vehicle downtime and ensuring timely maintenance.</li>\n</ul>\n<h3><u><strong><em style=\"font-size: 1rem;\">Enablers</em></strong></u></h3>\n<h3><em style=\"font-size: 1rem;\">SaaS companies that provide crucial support to enterprises of every stripe</em></h3>\n<ul>\n<li><strong>Dropee</strong> — Malaysian headquartered Dropee hosts over 80,000 SME businesses procure wholesale inventories in its marketplace, annually totaling more than US$100 million in transaction value. In the five years since its launch, Dropee has established itself as one of the fastest-growing B2B wholesale SaaS-enabled marketplaces in Southeast Asia with a market presence in Malaysia, Singapore, and Indonesia. On top of its SaaS and marketplace businesses, Dropee has also expanded its product line to support loan and financing deployment. The company has built a successful track record with credit financing portfolios over the past year and is ready to scale its offering by working with strategic partners, including regional banks and non-banking financial institutions.</li>\n<li><strong>Mekari</strong> — An Indonesia-based SaaS startup, the company has more than 35,000 clients and 800,000 active users. Mekari is the parent brand of Talenta, Jurnal, Qontak, Klikpajak, and Flex. The company has recorded 11x growth between 2018 and 2022.</li>\n<li><strong>NexMind </strong>— Malaysian based NexMind provides cloud-based and algorithmic solutions based on artificial intelligence, machine learning, natural language processing (NLP), and deep learning. The company has served over 350 clients, including notable companies such as Panasonic, Sogo, Volkswagen, OCBC Bank, UOB, Zurich Insurance, and more. In addition to existing markets in Southeast Asia, North America, Europe, Oceania, Japan, China, Hong Kong, and Taiwan, NexMind is also considering an entry into the Middle East.</li>\n</ul>\n<p><em><u><strong>Explorers</strong></u> </em></p>\n<p><em>Chinese startups that have successfully ventured into the region and established a strong presence</em></p>\n<ul>\n<li><strong>SUNMI</strong> — Based on the quality products and advanced business model developed in its domestic market, SUNMI, the smart IoT devices and digital solutions provider, leverages its capability to digitize local economies overseas. As of 2022, SUNMI has set up branches in 15 countries, with over 3 million monthly active devices in more than 200 countries and regions. The company accounts for 61.8% of the non-financial handheld device market share worldwide.</li>\n<li><strong>Hago</strong> — Hago is a multiplayer social interactive product that enhances the metaverse and 3D avatar interactive socialization applications. The company pioneers a variety of social gameplay such as livestreaming, interactive games, and multiplayer voice chat. In April 2018, Hago was launched in 33 countries and quickly became popular among the younger local generation. For several months, Hago topped the list of the most popular apps in some countries, such as Indonesia and Vietnam.</li>\n</ul>\n<h3><u><strong><em style=\"font-size: 1rem;\">Open Source</em></strong></u></h3>\n<h3><em style=\"font-size: 1rem;\">Projects that have accelerated the region’s digitalization by giving other entities the tools they need to build new applications</em></h3>\n<ul>\n<li><strong>LottieFiles</strong> — LottieFiles, headquartered in Malaysia, simplifies the workflow for creating animation in software like Adobe After Effects by allowing app designers to preview how their animation looks in the app and then ship it without hours of coding. LottieFiles has been used by animation and motion designers at 150,000 companies, including Google, TikTok, Disney, Uber, Airbnb, and Netflix.</li>\n<li><strong>MAPID</strong> — MAPID is a geographic information system platform that connects various kinds of location data from trusted sources, and connects all users through real-time mapping collaboration. The company’s products have been used by more than 20 different industries, including transit-oriented development, logistics, citizen journalism, healthcare distribution, and public policy.</li>\n<li><strong>Supabase</strong> — Supabase bills itself as an open-source alternative to services like Google’s Firebase. Its service offers many of the core features that developers need to get started, including a database, storage, and authentication services. The company saw rapid growth in 2021 with a community that has now grown to more than 80,000 developers and the creation of over 100,000 databases on the service.</li>\n</ul>\n<h3><sup><sub><u><strong><em>Frontiers </em></strong></u></sub></sup></h3>\n<p><em>Startups that are developing deeply technical products, such as quantum computing, biotech and medical advancements, space tech, and more</em></p>\n<ul>\n<li><strong>Cortical Labs</strong> — Cortical Labs grows biological computer chips by incorporating human neurons in processors. Named Dishbrain, this \"brain on a chip\" is meant to eventually take over tasks that can be automated. Dishbrain may also have applications in the robotics field, with its ability to process the vast amounts of input data that a robot may encounter in real-life scenarios.</li>\n<li><strong>Transcelestial</strong> — Transcelestial is a laser communications startup that provides a point-to-point wireless communication network. Its infrastructure, requiring zero spectrum costs or right-of-way, combines 10 Gbps speed with the security of fiber optic cables. With a space laser network, it can potentially replace wireless networks and deliver high-speed internet anywhere on earth, potentially benefiting four billion people globally who do not have internet access.</li>\n</ul>\n<h3><em><sub><sup><u><strong>Startups</strong></u></sup></sub> </em></h3>\n<p><em>Startups that have brought about significant grassroots-level advancements where they operate</em></p>\n<ul>\n<li><strong>Magorium </strong>— Magorium is a deep-tech startup with a solution to the world’s plastic waste problem. Through advanced processes and equipment, their technology converts plastic waste into an innovative synthetic material, NEWBitumen. So far, Magorium has recycled 4,500 kg of plastic waste into NEWBitumen to build roads, and has reduced more than 1,000 kg of natural resources consumed for road construction.</li>\n<li><strong>Saora Industries</strong> — Based in Malaysia, Saora Industries utilizes affordable and green technology without compromising the environment, and making a positive impact on underprivileged and marginalized communities. According to Saora, it has purified 11,388,00 liters of water and helped 5200 beneficiaries across 42 initiatives and 24 project sites. Amid the COVID-19 pandemic, Saora invented the Ethovent semi-ventilator, an automated bagging machine that assists patients with breathing difficulties. It replaces the need for a handheld manual resuscitation device, which in turn reduces the workload of medical personnel. Saora Industries plans to distribute this low-cost automated smart ventilator to rural hospitals where medical supplies are severely lacking, as well as to every public clinic and hospital outside the Klang Valley.</li>\n</ul>\n<h3><em><u><sup><sub>Launchpads</sub></sup></u></em></h3>\n<p><em>Educational institutions, incubators, and accelerators that have provided safe environments to nurture great startups</em></p>\n<ul>\n<li><strong>BLOCK71 (NUS)</strong> — An initiative by NUS Enterprise in partnership with government and corporate organizations, BLOCK71 is a community-based incubation program that provides mentorship and growth opportunities in local and global markets. Each startup is provided a unique experience, optimized based on the research capabilities and technologies of the university, and the investment and business acumen of its partners. The BLOCK71 initiative brings together these startups into a tech ecosystem that enables them to leverage NUS Enterprise’s network of resources and contacts and access mentoring support.</li>\n<li><strong>ScaleUp Malaysia</strong> — Scaleup Malaysia is an accelerator for companies looking to scale and grow, offering an RM200,000 (US$42,185) investment for startups selected to take part in ScaleUp&#039;s acceleration programs. ScaleUp educates founders and entrepreneurs that are building businesses with high revenue growth and helps them identify a path to profitability.</li>\n</ul>\n<h3><u><em><strong><sub><sup>Investors</sup></sub></strong></em></u></h3>\n<p><em>Equity firms that provide the fuel startups need to grow, and are evaluated for the impact they showcase</em></p>\n<ul>\n<li><strong>Alpha JWC</strong> — Alpha JWC Ventures is an Indonesia-based venture capital firm that invests in early-to-growth stage startups in Southeast Asia. It is one of the region’s largest and best-performing early-stage funds, with its AUM estimated to be worth US$650 million. The firm invests in early-stage—or pre-seed, seed, and pre-Series A—and is often the first institutional investor on a startup’s cap table. Notably, Alpha JWC provides significant post-investment support to portfolio companies through its Alpha-X Academy initiative, covering four main areas: strategic communications, human capital planning, talent sourcing, and branding. Alpha JWC also drives the iGnite program, in partnership with universities and associations, to identify and nurture future founders with the passion to make an impact on society.</li>\n<li><strong>Gobi Partners</strong> — Headquartered in Kuala Lumpur and Shanghai, Gobi Partners has USD 1.5 billion in AUM to date, supporting entrepreneurs from the early to growth stages. It has raised 15 funds to date and has invested in over 320 startups. Gobi has also nurtured nine unicorns, namely Animoca, Amber, Prenetics, Carsome, AutoX, WeLab, GoGoX, Airwallex, and Esign.  It supports its portfolio companies by providing management guidance, operational know-how, and access to its strategic partner network.</li>\n<li><strong>Quest Ventures</strong> — Quest Ventures is headquartered in Singapore, with locations in China, Indonesia, Kazakhstan, Malaysia, Thailand, the Philippines, Vietnam, South Korea, and the USA. It has invested in over 100 startups that operate in more than 150 cities across Asia, including 2 unicorns Carousell and Carro. Quest Ventures provides accelerator solutions, communities, mentoring, and talent recruitment to its portfolio companies.</li>\n</ul>\n<p>The awardees received their accolades at the <a href=\"https://www.notion.so/Announcement-Article-fbcd437ca4fd4ceaa17677a411e42d31\">Apsara Conference</a>, held yesterday, Nov 4, in China, Singapore, Malaysia, and Indonesia.</p>\n<hr />\n<p> </p>\n    </div>\n  </div>\n\n<div class=\"clearfix\">&nbsp;</div>\n<!-- END FIELD TEMPLATE -->\n<!-- START FIELD TEMPLATE -->\n\n\n<div class=\"d-flex justify-content-start flex-wrap\">\n      <div class=\"field_social_media_links\">\n      <p><em><strong>For more technology news and the latest updates, follow us on </strong></em><a href=\"https://www.facebook.com/DNewsAsia/\" target=\"_blank\"><em><strong>Facebook,</strong></em></a><a href=\"https://twitter.com/DNewsAsia\" target=\"_blank\"><em><strong> Twitter</strong></em></a><em><strong> or </strong></em><a href=\"http://www.linkedin.com/company/digital-news-asia\" target=\"_blank\"><em><strong>LinkedIn</strong></em></a></p>\n    </div>\n  </div>\n\n<div class=\"clearfix\">&nbsp;</div>\n<!-- END FIELD TEMPLATE -->\n<!-- START FIELD TEMPLATE -->\n\n  <h6 class=\"field-label font-weight-bold text-dark\">Keyword(s) :</h6>\n\n<div class=\"d-flex justify-content-start flex-wrap\">\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/alibaba-cloud\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Alibaba Cloud</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/final-nominees\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Final Nominees</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/asiastar-10-10\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">AsiaStar 10×10</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/innovation\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Innovation</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/sea\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">SEA</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/project-asiaforward\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Project AsiaForward</a>    </div>\n  </div>\n\n<div class=\"clearfix\">&nbsp;</div>\n<!-- END FIELD TEMPLATE -->\n<!-- START FIELD TEMPLATE -->\n\n  <h6 class=\"field-label font-weight-bold text-dark\">Author Name :</h6>\n\n<div class=\"d-flex justify-content-start flex-wrap\">\n      <div class=\"field_article_author_name\">\n      <a href=\"/author/digital-news-asia\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Digital News Asia</a>    </div>\n  </div>\n\n<div class=\"clearfix\">&nbsp;</div>\n<!-- END FIELD TEMPLATE --><span class=\"a2a_kit a2a_kit_size_24 a2a_target addtoany_list\" id=\"da2a_20\">\n      <a class=\"a2a_button_facebook a2a_counter\"></a>\n<a class=\"a2a_button_twitter a2a_counter\"></a>\n<a class=\"a2a_button_linkedin a2a_counter\"></a>\n<a class=\"a2a_button_email  a2a_counter\"></a>\n<a class=\"a2a_button_whatsapp  a2a_counter\"></a>\n<a class=\"a2a_button_telegram  a2a_counter\"></a\n      <a class=\"a2a_dd addtoany_share_save\" href=\"https://www.addtoany.com/share#url=https%3A%2F%2Fwww.digitalnewsasia.com%2Fstartups%2Falibaba-cloud-announces-final-nominees-asiastar-10-10-campaign-recognize-innovation&amp;title=Alibaba%20Cloud%20announces%20final%20nominees%20for%20AsiaStar%2010%C3%9710%20campaign%20to%20recognize%20innovation%20in%20Southeast%20Asia\"></a>\n      \n    </span>",
  "pubDate": "Sat, 05 Nov 2022 09:49:29 +0000",
  "dc:creator": "karamjit",
  "guid": "74469 at https://www.digitalnewsasia.com"
}