{
  "title": "The Positive Side of Social Media",
  "link": "https://www.aei.org/society-and-culture/the-positive-side-of-social-media/",
  "dc:creator": "Josiah Johnson",
  "pubDate": "Mon, 31 Oct 2022 16:37:16 +0000",
  "category": [
    "Society and Culture",
    "college",
    "Generation Z",
    "Social media",
    "students",
    "technology"
  ],
  "guid": "https://www.aei.org/?p=1008664075",
  "description": "<p>Global social media platforms like TikTok and Instagram have been blamed for creating a plethora of problems. But there's a silver lining: Social media can improve the ability of students to process and integrate huge amounts of information and then communicate their ideas clearly and succinctly to others.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/society-and-culture/the-positive-side-of-social-media/\">The Positive Side of Social Media</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n",
  "content:encoded": "\n<p>Global social media platforms like TikTok and Instagram have been blamed for creating a plethora of problems in young people’s lives. From helping foster insular and narrow socio-political outlooks to a fixation on <a href=\"https://www.theguardian.com/lifeandstyle/2018/jul/23/social-media-and-celebrity-culture-harming-young-people\" target=\"_blank\" rel=\"noreferrer noopener\">celebrity culture, materialism, and consumption</a> to increasing concerns about <a href=\"https://www.bostonglobe.com/2022/09/26/opinion/an-us-vs-them-mentality-campuses-turns-potential-friends-into-allies-or-enemies/\" target=\"_blank\" rel=\"noreferrer noopener\">self-harm, mental health, and inclusion</a>, social media has altered the way students engage with the world as well as themselves <a href=\"https://www.hsph.harvard.edu/news/features/how-social-medias-toxic-content-sends-teens-into-a-dangerous-spiral/\" target=\"_blank\" rel=\"noreferrer noopener\">in significant and harmful ways</a>.</p>\n\n\n\n<p>As a college professor, I have sadly seen these effects play out in front of me to the detriment of open inquiry and student sanity. But I want to share that there has been one appreciable effect of social media that has been quite positive: the improved ability of students to process and integrate huge amounts of information and then communicate their ideas clearly and succinctly to others.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><img loading=\"lazy\" width=\"700\" height=\"700\" src=\"https://www.aei.org/wp-content/uploads/2022/10/Abrams-10-31-featured-1.png?x91208\" alt=\"\" class=\"wp-image-1008664080\"/><figcaption>Via AdobeStock</figcaption></figure></div>\n\n\n<p>This change in how students share and debate ideas has clearly emerged in my seminars. My students are tasked to summarize the week’s readings and then present critical questions to the group beyond the central research questions or problems raised by the author. Students must lay out core concepts, evidence, and research methods and then explain the various up- and downsides of the author’s choices. They are asked to talk about any sources of bias in the work, and I often push the students to share what they believe it would require to persuade them to think differently about the work. I also want my students to identify the key norms, agents, and institutions in the various works, and I regularly ask them to suggest if it is possible to improve an argument with further empirical evidence or historical study.</p>\n\n\n\n<p>These tasks are not easy. But I have been doing this for almost 15 years with very powerful results. There are two particular reasons behind making this pedagogical decision. First, I am pushing the students to directly and actively engage with ideas and arguments in various works. This allows each student to come away with a nuanced understanding of the key questions posed by the author(s) and how they answered those questions. This exercise highlights what has been learned from the work and what still needs to be explored. Doing so requires pulling together competing ideas and separating key signals from quite a bit of noise.</p>\n\n\n\n<p>The second impetus behind these presentations is that I want students to actively listen, question, and wrestle with their ideas and the thoughts of others; it means that students must take the lead themselves and cannot passively record and regurgitate my ideas and thoughts. Presenting in class helps improve intimacy as a group and often compels students to share their views and logic and defend their ideas in front of others. It pushes students to refine their thinking, deeply criticize and evaluate work, and develop into effective public presenters outside of their bubbles. While often jarring and initially uncomfortable, many students have come to thank me, saying it helped them become active learners and comfortable in more open and public settings.</p>\n\n\n\n<p>When I first started with this approach, as a general phenomenon, students were uncomfortable speaking and making eye contact with their peers and had difficulty pulling their ideas together and then critically evaluating evidence to reach a conclusion. I worked with many students for countless hours over the years, trying to help them become comfortable public speakers and help them to cultivate the skill set of evaluating evidence and competing ideas. This was a huge but rewarding challenge. Today, in contrast, students come to my seminars prepared with quasi-professional presentations, have little trouble or fear of speaking in front of others, and happily criticize ideas while trying to make sense of arguments without as much involvement from me.</p>\n\n\n\n<p>Social media and its video-based format has clearly played a potent role in this momentous change. Our Gen Z students have grown up and are maturing in a world of social media ubiquity. With so many apps and platforms that promote video and sharing, students have become far more comfortable publicly expressing their ideas and presenting themselves to others. Students have also become proficient in sorting and managing countless sources of information and are seemingly untroubled by a world filled with disagreement and viewpoint diversity. There are so many threads and sources online and managing information and searching for narratives and truths has almost become second nature.</p>\n\n\n\n<p>Students now come to class with a desire to make sense of the noise and with a genuine excitement to search for the truth. Thus, while social media is causing countless social problems, this represents quite a positive change for not only teaching but also for politics and the chances of Gen Zers finding solutions and common ground on public policy questions today.</p>\n\n\n\n<p><em>Samuel J. Abrams is a professor of politics at Sarah Lawrence College and a senior fellow at the American Enterprise Institute.</em></p>\n\n\n\n<div class=\"related-items shortcode \"><p><strong>Learn more: </strong><a href=\"https://www.aei.org/politics-and-public-opinion/finding-third-places-across-america/\">Finding Third Places Across America</a> | <a href=\"https://www.aei.org/politics-and-public-opinion/southern-schools-are-more-ideologically-diverse/\">Southern Schools Are More Ideologically Diverse</a> | <a href=\"https://www.aei.org/politics-and-public-opinion/more-liberal-hypocrisy-on-college-campuses/\">More Liberal Hypocrisy on College Campuses</a> | <a href=\"https://www.aei.org/education/college-students-with-no-faith-are-more-likely-to-want-to-shut-down-speech/\">College Students with No Faith Are More Likely to Want to Shut Down Speech</a></p></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/society-and-culture/the-positive-side-of-social-media/\">The Positive Side of Social Media</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n"
}