{
  "title": "Keeping Humans in the (Feedback) Loop: Orangetheory Fitness’s Ameen Kazerouni",
  "link": "https://sloanreview.mit.edu/audio/keeping-humans-in-the-feedback-loop-orangetheory-fitnesss-ameen-kazerouni/",
  "comments": "https://sloanreview.mit.edu/audio/keeping-humans-in-the-feedback-loop-orangetheory-fitnesss-ameen-kazerouni/#respond",
  "pubDate": "Tue, 11 Oct 2022 11:00:23 +0000",
  "dc:creator": "Sam Ransbotham and Shervin Khodabandeh. <p>Sam Ransbotham (<a href=\"https://twitter.com/ransbotham\">@ransbotham</a>) is a professor in the information systems department at the Carroll School of Management at Boston College, as well as guest editor for <cite>MIT Sloan Management Review</cite>’s Artificial Intelligence and Business Strategy Big Ideas initiative. Shervin Khodabandeh is a senior partner and managing director at BCG and the coleader of BCG GAMMA (BCG’s AI practice) in North America. He can be contacted at <a href=\"mailto:shervin@bcg.com\">shervin@bcg.com</a>.</p>\n<p class=\"mt20\"><cite>Me, Myself, and AI</cite> is a collaborative podcast from <cite>MIT Sloan Management Review</cite> and Boston Consulting Group and is hosted by Sam Ransbotham and Shervin Khodabandeh. Our engineer is David Lishansky, and the coordinating producers are Allison Ryder and Sophie Rüdinger.</p>\n",
  "category": [
    "Analytics & Business Intelligence",
    "Artificial Intelligence",
    "Customer Data",
    "Decision-Making",
    "Information Management",
    "Wearables",
    "AI & Machine Learning",
    "Customers",
    "Data & Data Culture",
    "Data, AI, & Machine Learning",
    "Artificial Intelligence and Business Strategy"
  ],
  "description": "Ameen Kazerouni, chief data and analytics officer at Orangetheory Fitness (OTF), believes that AI’s role isn’t to replace human experts but rather to help them make better decisions. That’s why OTF collects heart rate and telemetry data during its in-studio fitness classes: so that AI algorithms can turn that data into feedback that empowers people [&#8230;]",
  "content:encoded": "<p></p>\n<p>Ameen Kazerouni, chief data and analytics officer at Orangetheory Fitness (OTF), believes that AI’s role isn’t to replace human experts but rather to help them make better decisions. That’s why OTF collects heart rate and telemetry data during its in-studio fitness classes: so that AI algorithms can turn that data into feedback that empowers people to make real-time choices about their workouts and enables coaches to offer personalized recommendations. </p>\n<p>On this episode of the <cite>Me, Myself, and AI</cite> podcast, Ameen joins Sam and Shervin to describe how OTF’s data collection and algorithms are used to create a curated fitness experience for its members, and he explains why it’s critical to keep humans in the feedback loop when implementing artificial intelligence. </p>\n<aside class=\"callout-info\">\n<img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/09/MMAI-s5-Kazerouni-headshot-3000-scaled.jpg\" alt=\"Ameen Kazerouni\"></p>\n<h4>Ameen Kazerouni, Orangetheory Fitness</h4>\n<p>Ameen Kazerouni is chief data and analytics officer at Orangetheory Fitness. Over the course of his career, Kazerouni has had the opportunity to use machine learning in a variety of fields, including clinical research, medical imaging, data warehouse design, e-commerce, and now health and wellness. He is currently focused on the challenges of operationalizing large volumes of data into scalable customer solutions and strategic initiatives.</p>\n<p>A core belief of his is to “build experiences, not algorithms,” which drives his team to put forward scalable solutions with measurable impact on real-world use cases. In his free time, Kazerouni enjoys keeping up to date with the latest methods in artificial intelligence and the newest comedy specials on Netflix, burning his savings on expanding his smart home, and marching down the path of becoming bionic by quantifying himself with any and all wearable fitness tech.</p>\n</aside>\n<aside class=\"callout-info fl mobile-fn mt40\">\n<h5>\n\t\tAI for Leaders on LinkedIn<br />\n\t</h5>\n<p style=\"font-size:1.4rem;\">If you’re enjoying the <cite>Me, Myself, and AI</cite> podcast, continue the conversation with us on LinkedIn. Join the <a href=\"https://www.linkedin.com/groups/13977401/\" class=\"marketing-click\" id=\"AI_for_leaders_link[MMAI]\">AI for Leaders</a> group today.</p>\n<p class=\"is-button mt20\">\n\t\t<a href=\"https://www.linkedin.com/groups/13977401/\" class=\"marketing-click\" id=\"AI_for_leaders_link[MMAI]\">Join now »</a>\n\t</p>\n</aside>\n<p>Read more about our show and follow along with the series at <a href=\"https://sloanreview.mit.edu/audio-series/me-myself-and-ai/\">https://sloanreview.mit.edu/aipodcast</a>.</p>\n<p>Subscribe to <cite>Me, Myself, and AI</cite> on <a href=\"https://podcasts.apple.com/us/podcast/me-myself-and-ai/id1533115958\">Apple Podcasts</a>, <a href=\"https://open.spotify.com/show/7ysPBcYtOPVgI6W5an6lup\">Spotify</a>, or <a href=\"https://podcasts.google.com/feed/aHR0cHM6Ly9tZW15c2VsZmFuZGFpLmxpYnN5bi5jb20vcnNz\">Google Podcasts</a>.</p>\n<p>Give your <a href=\"https://survey.qualtrics.com/jfe/form/SV_esbiI980aHIrUpM\">feedback</a> in this two-question survey.</p>\n<h4>Transcript</h4>\n<p><strong>Sam Ransbotham:</strong> Real-time data collection means organizations can make many more informed choices based on metrics. But when do they still need humans? Find out on today’s episode.</p>\n<p><strong>Ameen Kazerouni:</strong> I’m Ameen Kazerouni from Orangetheory Fitness, and you’re listening to <cite>Me, Myself, and AI</cite>.</p>\n<p><strong>Sam Ransbotham:</strong> Welcome to <cite>Me, Myself, and AI</cite>, a podcast on artificial intelligence in business. Each episode, we introduce you to someone innovating with AI. I’m Sam Ransbotham, professor of analytics at Boston College. I’m also the AI and business strategy guest editor at <cite>MIT Sloan Management Review</cite>.</p>\n<p><strong>Shervin Khodabandeh:</strong> And I’m Shervin Khodabandeh, senior partner with BCG, and I colead BCG’s AI practice in North America. Together, <cite>MIT SMR</cite> and BCG have been researching and publishing on AI for six years, interviewing hundreds of practitioners and surveying thousands of companies on what it takes to build and to deploy and scale AI capabilities and really transform the way organizations operate.</p>\n<p><strong>Sam Ransbotham:</strong> Today, Shervin and I are excited to be joined by Ameen Kazerouni, chief data and analytics officer for Orangetheory Fitness. Ameen, thanks for joining us. Welcome.</p>\n<p><strong>Ameen Kazerouni:</strong> Thank you, Sam. It’s great to be here. Excited for the conversation. </p>\n<p><strong>Sam Ransbotham:</strong> Currently, you lead the data and analytics function at Orangetheory Fitness. Maybe tell us a little bit about the organization.</p>\n<p><strong>Ameen Kazerouni:</strong> Absolutely. Orangetheory Fitness is a heart-rate-based, total-body group workout. It combines science, great coaching, technology, and it’s designed to provide what we like to think of as a more vibrant life. The workout’s developed to motivate each individual member to achieve their desired results. And, you know, if you’re starting on your wellness journey or you’re a seasoned fitness enthusiast, each OTF workout creates a community of shared experience but also uses heart-rate-based training to allow you to experience the workout in a way that’s most comfortable for you, and that’s honestly where my role comes in. There’s a tremendous amount of second-by-second telemetry data from the fitness equipment, from the heart rate monitors, that allows us to create the most curated, personalized kind of boutique fitness experience in the world. That’s Orangetheory.</p>\n<p><strong>Sam Ransbotham:</strong> All right, what do you do with all this? You’ve collected all this data, you’ve got it, this telemetry, you’ve got heart rate information, I assume, since you’re heart-rate-based. How does the process work? Take us through the steps. </p>\n<p><strong>Ameen Kazerouni:</strong> Most Orangetheory members in the studio will be wearing what we call an OTbeat heart rate monitor, which is a proprietary piece of wearable technology. There’s two purposes to that. One is, it gives you a real-time feedback loop as to how you’re performing, what intensity level you’re outputting in the studio, but it also allows the coach to see the intensity level that you’re outputting in the studio and help effectively provide a kind of personalized fitness training experience in a studio, in a group setting. My role is focused on kind of unlocking that telemetry data and helping personalize the experience even more. </p>\n<p>A really cool example is that we recently launched a personalized max heart rate algorithm, and members now experience a much more curated experience in the studio, and that’s allowing us to use proprietary algorithms to determine what the max heart rate — which is a physiological term for the maximum output that your heart can beat at — is for an individual member. And percentages of that max heart rate tell you which heart rate zone you’re training in. So anaerobic training versus aerobic training have different physiological impacts. Time spent in different intensity zones has been proven to have varying effects on longevity and health in general. And by being able to personalize that for a member, we’re able to make this experience even more curated in the studio, while most places that leverage max heart rate will rely on a generic age-based kind of equation. And … as you can imagine, every 30-year-old or 40-year-old doesn’t have the same heart. So things like that are an example of how we curate the experience for our members using this data. </p>\n<p><strong>Shervin Khodabandeh:</strong> That is a supercool example, right? Not the average for your age and gender. And then that goes by bands of 10 anyway, right?</p>\n<p><strong>Ameen Kazerouni:</strong> Yeah.</p>\n<p><strong>Shervin Khodabandeh:</strong> As if all 50-year-old males exactly have the same ability.  </p>\n<p><strong>Ameen Kazerouni:</strong> Yeah. It makes the experience safer, it makes you more aware of what you’re doing, what your capability is, and you see that cardiorespiratory fitness climb over your time with the program.</p>\n<p><strong>Shervin Khodabandeh:</strong> And I like what’s sort of inherent in what you’re saying — the rapid feedback, right? Within a few seconds, you get feedback, but also, in a broader, symbolic sense, what you’ve been proposing is more and more experimentation in general as you build AI algorithms. So it’s not just the algo, but it’s also experimentation <em>because</em> you get feedback. </p>\n<p>The philosophy of how to build AI models, which relies on feedback, you’re also translating that into a real use case based on rapid feedback. There’s some poetry there.</p>\n<p><strong>Ameen Kazerouni:</strong> I didn’t think of it that way, but absolutely there’s poetry there. I think that one of the beauties of artificial intelligence algorithms is that they’re so reliant on things they’ve seen before and constant feedback loops to get smarter. And that’s exactly what the Orangetheory experience is indexed on is, as the members are getting stronger, we’re getting smarter and making sure that we move with them.</p>\n<p><strong>Shervin Khodabandeh:</strong> Tell us more a bit about your data science development philosophy and how you balance experimentation with more methodical “get the algorithm to be perfect before you launch it.” Just give us a sense of the trade-offs and how you and your teams think about that.</p>\n<p><strong>Ameen Kazerouni:</strong> I love that question, and it’s almost like I’ll take it even a step outside of developing algorithms. I’m a firm believer that companies have started indexing so heavily on collecting as much data as is humanly possible; as much as their compute and their storage costs, and their boards and their investors, will allow them to, companies collect data. And I think that what happens is, once you have the data, the expectation is, “Let’s jump to machine learning, let’s jump to AI.” And I would argue that those ... How many debates have you been in on “What’s AI, and what’s machine learning, and what do the words mean?” </p>\n<p>My philosophy is to go and find those mundane, repetitive tasks and automate them first with your data, where possible. Go and find intuitive, gut-based decisions that your stakeholders and verticals are uncomfortable making based off of intuition and would love to make off of data, and make that data democratized, clean, and available. </p>\n<p>And after that, you start the whole machine learning journey. And I think when it comes to machine learning and AI, and developing an algorithm in particular, it really depends on the context and the domain in which you’re working — whether you’re focusing on that precision, whether you’re focusing on that recall — and it really depends on what the implications of the prediction are. But generally speaking, I always err on the side of, if it’s safe enough, experiment and learn rather than relying on training and validation sets to chase perfection. It’s kind of my rule-of-thumb philosophy.</p>\n<p><strong>Sam Ransbotham:</strong> There’s something also interesting, and I know you’ve shifted slightly into thinking about how your organization uses data, but maybe going back to how you’re using it within the studios, how do you incorporate data from outside? You know, let’s say that I’ve been training and working and improving within the studio, but little do you know that I’ve hurt my foot or I’ve pulled a leg muscle. How does that sort of outside information come in? </p>\n<p><strong>Ameen Kazerouni:</strong> I like that question a lot, Sam, because I’ve got two answers there. </p>\n<p>One is, the coach is the hero at Orangetheory. And the way we think about it is, there’s 20 to 30 people in a class, but you don’t want to think of it as group fitness as much as you want to think of it as — probably, at least I think of it as — subsidized personal training. So you’ve got a pretty good personal relationship with that coach, and there’s no algorithm that I’m going to build that’s going to be better than you telling your coach, “Hey, I hurt my foot last night. What do you think I should do?” And we’ve got alternative, low-impact cardio equipment in the studio so you don’t get on a treadmill and start trying to run 8 miles an hour. In fact, one of the things the coach says before every class starts is, “If you got any orthopedic issues, please let me know,” and so on and so forth. So I think that one thing that I’ve learned about data over the course of my career is that data is valuable, and it’s really good to make decisions with, but if there’s a human in the loop that can scalably provide the answer instead, it’s likely going be hard to beat that expert with an algorithm. So don’t get in the way of the expert. </p>\n<p>The second part of that answer is, let’s say you had a bunch of caffeine, or you ran a marathon the previous day, or you didn’t sleep very well; all those external factors affect your cardiac output when you’re in the studio. So that real-time feedback loop allows you and the coach to modulate yourself. </p>\n<p>One thing that we encourage is, if you’re not feeling it, take a “green day.” ... The zones are broken up into colors, orange and red being the anaerobic zones — zones 4 and 5 — green being your zone 3, blue being your zone 2. So we recommend, don’t shoot for those 12 to 20 minutes in the orange and red zone. Look at your heart rate zones, listen to that real-time feedback loop, and take a green day if you need to. So it’s a bit of a cop-out answer there, but we’ve got the coach, we’ve got the member, and we’ve got a real-time feedback loop. And when there’s an intuitive answer like that right in front of you, I don’t think you should interfere with an algorithm, is kind of the thought process there. </p>\n<p><strong>Sam Ransbotham:</strong> I don’t think that’s a cop-out answer at all, because historically, you had a … OK, you could have a personal trainer, or you could be in a group setting. I think I personally identify [with] this because you could either teach someone one-on-one as a tutor or you could teach someone in a giant classroom. And I’m just excited about applications like this that are letting us pull together the best of both of those worlds. I’m hungry for it in education, but I can see that you’re making a lot of progress on that — and Shervin and I have talked with Peloton as well. They’re starting to think about how you get to an individual-level experience at scale, and that seems like what you’re really trying to do. </p>\n<p><strong>Ameen Kazerouni:</strong> Absolutely. I couldn’t have put it better myself. I think that’s exactly it.</p>\n<p><strong>Shervin Khodabandeh:</strong> I like that a lot. This is all about rapid feedback, which is a cornerstone of building expertise in any system, whether it’s chess, or whether it’s running, or whether it’s machine learning. The more you combine experimentation and rapid feedback <em>and</em> the human in the loop and apply that across different industries, the more opportunity and values you’re going to unleash for personalized everything, not just fitness or shopping for pants but also education and everything else. You’re on to something here.</p>\n<p><strong>Ameen Kazerouni:</strong> Absolutely. In my prior life, I was in retail. And when you think about the role of machine learning and deep learning in retail, it’s that: You’re trying to re-create the in-person shopping experience on a website. Like, how do we curate this? How do we create a personal shopper? How do we create that boutique experience? How do we predict the size correctly? How do we use AR [augmented reality] so that you can see what a shoe looks like on your foot? We’re always trying to close that gap and arrive back at what the real thing would be like — personalized, but at scale. And I think that’s the secret sauce there: … a rapid feedback loop, algorithmic support with large volumes of data, but then also not trying to circumnavigate around the expert, the human in the loop.</p>\n<p><strong>Shervin Khodabandeh:</strong> Exactly. And I think that’s really critical, Sam, because I remember when we did the first few years of the <a href=\"https://sloanreview.mit.edu/big-ideas/artificial-intelligence-business-strategy\">AI report</a>, like back in 2018-2019. </p>\n<p><strong>Sam Ransbotham:</strong> So long ago.</p>\n<p><strong>Shervin Khodabandeh:</strong> There were still a lot of folks — I mean, that’s only three years ago, but a lot of folks still today are thinking of AI as that which replaces human and that which must automate. And the more we think that narrowly, the more outcomes we’re leaving on the table, the more successful workforces and humans we’re disenfranchising, and also the more opportunities we’re leaving unaddressed because we think, “Well, there’s no way I can fully replace a human here, so I’m not going to do it.”</p>\n<p>And there are so many of these things where it’s not just AI versus human but it’s AI <em>and</em> human.</p>\n<p><strong>Ameen Kazerouni:</strong> Yep. You know, I think that there is a conflation of companies where the product is AI. Like, when you think of AI, you think of Tesla, and there’s different industries all of them play in, but there’s a very core part of the product that’s a stand-alone piece of intellectual property that’s heavily rooted in artificial intelligence, and that’s not how a majority of the world is going to use artificial intelligence. And I think that’s one of the kind of key differences in what you were just talking about, Shervin — is that people try and use AI the way those companies use AI and see them as the gold standard, but our product is not AI. Our product is a curated, science-backed, coach-inspired fitness experience that’s just merely augmented in parts by AI.</p>\n<p><strong>Sam Ransbotham:</strong> This is something that Shervin and I are pretty excited about. I don’t want to foreshadow too much, but we’re thinking about these mini uses of AI beyond just this kind of poster use of AI that you’re talking about. I mean, yes, we all are attracted to the Boston Dynamics robots that look very cool, but there’s a lot going on that isn’t that level, and there’s so much value in those. And I think you’re starting to capture some of that. </p>\n<p><strong>Shervin Khodabandeh:</strong> I wanted to segue from this. We talked quite a lot about the importance of a human in the loop, experimentation, being hypothesis-driven, all these things you said. Maybe tell us a bit around the operating model and the ways of working in a company that is not an AI <em>product</em> company but is a company like yours with a strong mission. What does it take to take a use case and bring it to life? </p>\n<p><strong>Ameen Kazerouni:</strong> I think it honestly comes down to three things. It’s having the data; you can’t really get around not having the data. Investment. I think a big mistake companies make is not investing in data engineers early, thinking that you can just sprinkle AI like some kind of magic powder on raw data sets and it’s going to produce something. I think data engineers are a critical commodity that you want to invest in early so your data is at a point where you can actually use it. So that investment is really important. Wherever it’s coming from, there needs to be a serious decision made to invest in your data practice if you’re going to really try and build one. And then finally, it’s buy-in. When the product is not AI, you’re convincing domain experts — in our case, fitness experts — that have been doing this for a long time, that are formally educated in these fields of study, that are always going to know more about the product than you do, that an algorithm is going to help them and make their job easier. </p>\n<p>And I think that that relationship can be a beautiful partnership or it can be an extremely antagonistic one. One of the things that I’ve kind of strived toward in my role at Orangetheory is to have a strong partnership with our template design team, our workout design team, because at the end of the day, they are the protectors and designers of that product, and we’re, again, just a tool that’s supporting them. Their buy-in is very critical, because their understanding of the algorithms is what then makes it to coaches in learning and development material. </p>\n<p>At the end of the day, we’ve got thousands of coaches across 24 countries explaining that max heart rate algorithm that I mentioned. And they’re not explaining it like a piece of mathematics; they’re explaining it like a piece of exercise fitness, like a piece of exercise physiology. And that requires that buy-in. The AI, the data team, and the fitness team need to be in lockstep; otherwise, it’s destined to fail. </p>\n<p><strong>Shervin Khodabandeh:</strong> And what does that mean in terms of the talent and the team — the technical team that you oversee and you hire and recruit? </p>\n<p><strong>Ameen Kazerouni:</strong> That they’re difficult to find, is what it means. I think there’s already a scarcity of talent in this space. I think in a mission-driven, purpose-driven company like Orangetheory, you’d think it’s harder to find, but it’s actually easier in the sense that if you find someone that’s aligned with the mission, it’s almost exciting to them that there’s an opportunity to apply that skill set on what they considered an outside-the-job passion. </p>\n<p>But we’ve also focused on our data organization being a separate entity. So we’ve got my role, chief data and analytics officer, running a data organization reporting in to our CEO. And we’ve got our chief digital and technology officer running a separate digital and technology organization. And what’s really powerful about that is that we’re able to riff off of each other and have one team provide building blocks to the other team and vice versa. And what you’d imagine creates an interesting working experience actually drives a lot of velocity and drives a really cool partnership that’s very exciting to be a part of as well. So I think it’s all about that: partnerships and buy-ins and collaboration across teams.</p>\n<p><strong>Shervin Khodabandeh:</strong> Very well said. Ameen, we have a special segment here where we ask you five rapid-fire-style questions. Just give us the first thing that comes to your mind. The key thing is intuitive, whatever comes to your mind, and short and sweet answers. So, ready for that? </p>\n<p><strong>Ameen Kazerouni:</strong> Let’s do it. </p>\n<p><strong>Shervin Khodabandeh:</strong> All right. What’s your proudest AI moment?</p>\n<p><strong>Ameen Kazerouni:</strong> When we solved it using a linear regression. </p>\n<p><strong>Shervin Khodabandeh:</strong> Love it. All right. What worries you about AI?</p>\n<p><strong>Ameen Kazerouni:</strong> A lack of consultation with domain experts.</p>\n<p><strong>Shervin Khodabandeh:</strong> Well said. Your favorite activity that involves no technology?</p>\n<p><strong>Ameen Kazerouni:</strong> Hiking. </p>\n<p><strong>Shervin Khodabandeh:</strong> Was that a question?</p>\n<p><strong>Ameen Kazerouni:</strong> It’s a very simple one. I was going to say Orangetheory, but there’s too much technology in there.</p>\n<p><strong>Shervin Khodabandeh:</strong> The first career you wanted — like, what you wanted to be when you grew up.</p>\n<p><strong>Ameen Kazerouni:</strong> Environmental biologist. </p>\n<p><strong>Shervin Khodabandeh:</strong> Your greatest wish for AI in the future?</p>\n<p><strong>Ameen Kazerouni:</strong> More access. </p>\n<p><strong>Shervin Khodabandeh:</strong> Great. </p>\n<p><strong>Sam Ransbotham:</strong> Actually, I’ve got to follow up: Access for who? Who needs access? </p>\n<p><strong>Ameen Kazerouni:</strong> I think it would be great if some of the simpler portions of AI that unlocked decisioning off of data that companies have collected was easier to tap into without the financial and human capital that you’re required to invest as an organization. I think the general efficiency of the world will just go up, you know.</p>\n<p><strong>Shervin Khodabandeh:</strong> More open-source kind of stuff.</p>\n<p><strong>Ameen Kazerouni:</strong> Yeah, yeah.</p>\n<p><strong>Shervin Khodabandeh:</strong> Ameen, this has been exceedingly insightful and a lot of fun. Thank you for making time for us. </p>\n<p><strong>Sam Ransbotham:</strong> Yeah, thanks for coming.</p>\n<p><strong>Ameen Kazerouni:</strong> Thanks for having me. This was a lot of fun. I truly enjoyed it. </p>\n<p><strong>Sam Ransbotham:</strong> On our next episode, we’ll speak with Khatereh Khodavirdi, senior director of data science and analytics at PayPal, where she oversees data teams at Venmo and Honey. Please join us. </p>\n<p><strong>Allison Ryder:</strong> Thanks for listening to <cite>Me, Myself, and AI</cite>. We believe, like you, that the conversation about AI implementation doesn’t start and stop with this podcast. That’s why we’ve created a group on LinkedIn specifically for listeners like you. It’s called AI for Leaders, and if you join us, you can chat with show creators and hosts, ask your own questions, share your insights, and gain access to valuable resources about AI implementation from <cite>MIT SMR</cite> and BCG. You can access it by visiting <a href=\"https://mitsmr.com/AIforLeaders\">mitsmr.com/AIforLeaders</a>. We’ll put that link in the show notes, and we hope to see you there.</p>\n<p></p>\n",
  "wfw:commentRss": "https://sloanreview.mit.edu/audio/keeping-humans-in-the-feedback-loop-orangetheory-fitnesss-ameen-kazerouni/feed/",
  "slash:comments": 0
}