{
  "title": "Startup Makes It Easier to Detect Fires With IoT and Flir Cameras",
  "link": "https://spectrum.ieee.org/startup-fire-detection-system",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-tablet-computer-shows-blueprints-overlaid-with-thermal-imagery.jpg?id=29844523&width=1200&height=800&coordinates=0%2C153%2C0%2C154\"/><br/><br/><p>Fires at recycling sorting facilities, ignited by combustible materials in the waste stream, can cause millions of dollars in damage, injuring workers and first responders and contaminating the air.</p><p>Detecting the blazes early is key to preventing them from getting out of control.</p><hr/><p>Startup <a href=\"https://movitherm.com/\" rel=\"noopener noreferrer\" target=\"_blank\">MoviTHERM</a> aims to do that. The company sells cloud-based fire-detection monitoring systems to recycling facilities. Using thermal imaging and heat and smoke sensors, the system alerts users—on and off the site—when a fire is about to break out.</p><p>To date, MoviTHERM’s system operates in five recycling facilities. The company’s founder, IEEE Member <a href=\"https://www.linkedin.com/in/movimed/\" rel=\"noopener noreferrer\" target=\"_blank\">Markus Tarin</a><em>,</em> says the product also can be used in coal stockpiling operations, industrial laundries, scrapyards, and warehouses.</p><p>In 1999 Tarin launched a consulting business in Irvine, Calif., to do product design and testing, mostly for medical clients. Then thermal-camera manufacturer Flir hired him to write software to automate non-contact temperature measurement processes to give Flir’s customers the ability to act quickly on temperature changes spotted by their camera.</p><p>“That was the beginning of me going into the thermal-imaging world and applying my knowledge,” he says. “I saw a lot of need out there because there weren’t very many companies doing this sort of thing.”</p><p>Tarin started MoviTHERM in 2008 to be a distributor and systems integrator for <a href=\"https://www.flir.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Flir</a> thermal imagers. The company, now with 11 employees and Tarin at the helm, is still in that business. However, Tarin became frustrated by the fact that the software he developed was not scalable; rather, it was tailored to each customer’s specific needs. And he began to discover around 2015 that interest in such custom software had fallen off.</p><p>“I could no longer easily sell a customized solution,” he says, “because it was perceived as too risky and too expensive.”</p><p class=\"pull-quote\">“We are trying to prevent catastrophic losses and environmental damage.”</p><p><strong>INTELLIGENT MODULE</strong></p><p>In 2016 he began developing the MoviTHERM Series Intelligent I/O module (MIO). He targeted it at fire detection in recycling facilities, he says, because “we had a lot of customers reaching out for solutions in that field.”<br/></p><p>The Ethernet-connected programmable device includes eight digital alarm switches and eight channels of 4- to 20-milliampere outputs that can be used with up to seven Flir cameras. Once the module is connected to a camera, it starts monitoring. MIO can be expanded by adding more modules, Tarin says.</p><p>MoviTHERM sells the MIOs for Flirs in several versions for different camera models. Each variant supports from one to seven cameras, and they range in price from US $895 to $5,995.</p><p>MIO allows customers to “just click and connect multiple Flir cameras and set up the alarms without programming any software,” Tarin says. “The intelligent module sits on the network along with the cameras and sounds an alarm if a camera detects a hot spot,” he says. MIO won the <a href=\"https://www.vision-systems.com/home/article/16742105/movitherm-receives-2016-innovators-award-from-vision-systems-design\" target=\"_blank\">2016 Innovators Award</a> for industry-best product from <em>Vision Systems Design</em> magazine.</p><p>Tarin says Flir was “so fascinated by MIO that it began distributing the module worldwide.”</p><p>“It’s the only product the company is distributing that’s not a Flir product,” he says.</p><p>But, he says, that MIO series lacks the ability to send alerts to customers via voice, text, or email. It can use its built-in digital alarm outputs only to announce an alarm via a connected tool such as a siren or a flashing light.</p><p><strong>SMARTER FEATURES</strong></p><p>To add those features and more, Tarin late last year introduced MoviTHERM’s subscription-based iEFD early fire detection system, which can monitor and record a facility’s temperatures throughout the day. The system uses interconnected sensors, instruments, and other tools connected to cloud-based industrial software applications. It can check its own cameras and sensors to make sure they are working. Users can monitor and analyze data via an online dashboard.</p><p>If a camera detects a hot spot that could potentially develop into a fire, the system can send an alert to the phones of workers near the area to warn them, potentially giving them time to remove an item before it ignites, Tarin says.</p><p>The system also includes an interactive real-time map view of the facility that can be emailed to firefighters and first responders. The map can include information about the best way to access a facility and the location of utilities at the site, such as water, gas, and electricity.</p><p>“Firefighters often aren’t familiar with the facility, so they lose valuable time by driving around, figuring out how to enter the facility, and where to go,” Tarin says. “The map shows the best entry point to the facility and where the fire hydrants, water valves, electrical cabinets, gas lines, and so on are located. It also shows them where the fire is.</p><p>“We recently demonstrated this map to a fire marshal for a recycling facility, and he was blown away by it.”</p><p>By stopping fires, Tarin says, his system helps prevent toxic emissions from entering the atmosphere.</p><p>“Once you put the fire out, you have more or less an environmental disaster on your hands because you’re flushing all the hazardous stuff with fire suppressant, which itself might also be hazardous to the environment,” he says. “We are trying to prevent catastrophic losses and environmental damage.”</p>",
  "pubDate": "Tue, 24 May 2022 18:00:01 +0000",
  "guid": "https://spectrum.ieee.org/startup-fire-detection-system",
  "category": [
    "Ieee member news",
    "Startups",
    "Internet of things",
    "Iot",
    "Fire detection",
    "Remote sensing",
    "Flir",
    "Thermal cameras",
    "Predictive analytics",
    "Ai",
    "Artificial intelligence",
    "Careers",
    "Type:ti"
  ],
  "dc:creator": "Kathy Pretz",
  "media:content": ""
}