{
  "title": "430: Fish Heads",
  "guid": "/americanpublicmedia/podcasts/theslowdown/2020/07/theslowdown_20200717_20200717_128.mp3",
  "itunes:author": "American Public Media",
  "description": "<p><em>This week, we’re featuring poems about food and all the many ways it sustains us. Because food is community and memory. It’s struggle, joy, and so much more.</em></p>\n<hr>\n<p><a class=\"amat-apm-attachment application-pdf\" href=\"https://files.apmcdn.org/production/f9a931aff2e8908b7cc3f67230625b4c.pdf\">Read an automated transcript</a>\n</p>\n<p><strong>Fish Heads </strong><br><strong>by R.A. Villanueva</strong></p>\n<pre class='verse'>Yanked free at the gills from cartilage and spine,\nthese fish heads my mother cleans, whose bodies she scales, throws\nall into salt water and crushed tamarind. At dinner she alone\nwill spoon out their eyes with her fingers,\n\nsuck down each pair as we watch. <em>See, this is why the three of you\ncould never hide anything from me</em>—as though these organs\nbrought her sight to be soaked through the tongue.\nWhen I tell her that I have tried to make this stew from memory,\n\nshe warns, <em>Don’t waste what should be eaten. </em>Reminds me\nof every delicate gift we have thrown away: tilapia stomach\nbest soured with vinegar, milkfish liver to melt\nagainst the dome of the mouth. That after church,\n\na bucket of chicken soon became a blessing of wing gristle\nand skin, dark meat no one else wanted to save. We refused\nto taste her gizzards and hearts fried in fat, mocked\nthe smell of pig blood curdled on the stove, wished gone \n\nher tripe steamed with beef bouillon and onion broth.\nAfter my brother and sister push aside bowls of baby squid\nin garlic ink, gag at my mention of ducks in their shells, boiled\nalive in brine, my mother believes I was the only one to share\n\nin such things. <em>Which maybe means, </em>she says,<em> in some former life\nyou and I were seabirds or vampires or wolves</em>. \n</pre>\n<p><em>\"Fish Heads,\" by R.A. Villanueva, from </em><em><a href=\"https://www.nebraskapress.unl.edu/university-of-nebraska-press/9780803296381/\" title=\"RELIQUARIA\">RELIQUARIA</a></em><em> by R.A. Villanueva, copyright © 2014 University of Nebraska Press. Used by permission of University of Nebraska Press.</em><br></p>\n",
  "enclosure": "",
  "pubDate": "Fri, 17 Jul 2020 09:04:00 +0000",
  "itunes:duration": "00:04:59",
  "itunes:explicit": "no"
}