{
  "title": "Why You Should Make Friends at Work",
  "link": "https://sloanreview.mit.edu/article/why-you-should-make-friends-at-work/",
  "comments": "https://sloanreview.mit.edu/article/why-you-should-make-friends-at-work/#respond",
  "pubDate": "Thu, 13 Oct 2022 11:00:37 +0000",
  "dc:creator": "Lynda Gratton. <p>Lynda Gratton (<a href=\"https://twitter.com/lyndagratton\">@lyndagratton</a>) is a professor of management practice at London Business School and founder of the advisory practice HSM. Her newest book is <cite>Redesigning Work: How to Transform Your Organization and Make Hybrid Work for Everyone</cite> (MIT Press, 2022).</p>\n",
  "category": [
    "Employee Morale",
    "Employee Recruitment and Retention",
    "Employee Turnover",
    "Hybrid Work",
    "Talent Acquisition and Management",
    "Trust",
    "Culture",
    "Leadership",
    "Organizational Behavior",
    "Remote Work",
    "Talent Management",
    "Workplace, Teams, & Culture"
  ],
  "description": "The past few years have been tough and chaotic for many working people. Assumptions, habits, and ways of working have changed, and as we look forward, many of us realize that building personal resilience will be key. One of the crucial elements of personal resilience is friendship. It helps if we have a trusted confidant [&#8230;]",
  "content:encoded": "<p></p>\n<figure class=\"article-inline\">\n<img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/10/2022_1013_Gratton_work_friends_animated_1290x860.gif\" alt=\"\" /><br />\n</figure>\n<p>The past few years have been tough and chaotic for many working people. Assumptions, habits, and ways of working have changed, and as we look forward, many of us realize that building personal resilience will be key. </p>\n<p>One of the crucial elements of personal resilience is friendship. It helps if we have a trusted confidant at our organization — someone who makes us feel worthwhile and whom we can celebrate and commiserate with. </p>\n<p>Friendships at work matter. When so many hours are spent working, having someone who understands our situation — the players involved, the office dynamics, and the general organizational culture — can help buffer routine stress. When we share our experiences, it often reminds us that others have gone through similar ones. </p>\n<p></p>\n<p><a href=\"https://news.gallup.com/topic/element-10-best-friend.aspx\">Gallup research</a> found that agreement with the statement “I have a best friend at work” is a strong predictor of whether you are likely to stay in your job. Gallup also found a concrete link between having a best friend at work and the amount of effort a worker expends on their job. For example, “Women who strongly agree they have a best friend at work are more than twice as likely to be engaged (63%) compared with those who say otherwise (29%),” according to <a href=\"https://www.gallup.com/workplace/236213/why-need-best-friends-work.aspx\">Gallup’s 2018 research</a>.</p>\n<p>Yet friendships at work is a complex topic, as I discovered when I recently spoke on a <em>Financial Times</em> podcast and wrote an <em>FT</em> article about the joys of friendship at work. Many people responded to each, and I discovered that while some felt positive about their experiences, many were more wary. Typical comments included “People are friends with you at work only because they want something from you,” “It’s hard to be a good friend with someone who is more/less senior,” and “I cannot trust people at work.”</p>\n<p>These are all legitimate concerns that really go to the heart of friendship and work. And they illustrate why friendship among work colleagues has never been more fragile. During the pandemic, 59% of people in hybrid work environments and 56% who were entirely remote reported that they had fewer work friendships, according to the Microsoft 2022 Work Trend Index. Even before work was uprooted by COVID-19, 76% of executives said they had difficulty making connections with their work teammates, and 58% described their social relationships at work as “superficial,” according to research by Constance N. Hadley and Mark Mortensen, who reported their findings in <cite>MIT Sloan Management Review</cite>’s “<a href=\"https://sloanreview.mit.edu/article/are-your-team-members-lonely/\">Are Your Team Members Lonely?</a>” Young people are feeling the sting especially acutely: Forty percent of those ages 16 to 24 surveyed by the BBC in 2018 reported feeling lonely “often or very often.”</p>\n<p>So here is the paradox: People often feel isolated, both in general and at work — what Hadley and Mortensen termed “alone together” in the organization. Yet they are wary of making the workplace relationships that could reduce their loneliness. </p>\n<p></p>\n<h3>Ways to Build Workplace Friendship</h3>\n<p>To understand this paradox more deeply, I turned to my friend Robert Waldinger, who is the current director of the Harvard Study of Adult Development. This <a href=\"https://news.harvard.edu/gazette/story/2017/04/over-nearly-80-years-harvard-study-has-been-showing-how-to-live-a-healthy-and-happy-life/\">long-term research project</a> by Harvard Medical School and Massachusetts General Hospital has been tracking groups of people over their lifetimes. The studies show conclusively that people with close long-term friends are more resilient and happier than those who lack such friendships. </p>\n<p>But what of friendships at work? In Robert’s view, it is important that we acknowledge the potential for complexity in work-based friendships. Take, for example, a close friendship between two people who started out as peers, but one is now more senior — perhaps even the boss. These friends are now managing dual roles — as a friend and a boss, and as a friend and a subordinate. These power differentials are real, and they do create complications. And while all relationships are to some extent transactional (think about the relationship between romantic partners), working relationships are more delineated: “You are my boss; you pay me.” </p>\n<p>Yet Robert and I agree that there are ways of coming to terms with these complexities — and we offer two strategies: </p>\n<p><strong>Test for trustworthiness.</strong> Relationships bridge from transactions into friendships through the steady accumulation of personal affection and trust. Our friendships are based on intimacy, and you become friends with people because both of you reveal your innermost thoughts and memories. Yet to reveal oneself (particularly to someone at work) is potentially dangerous — could they use this information against you or tell others? So perhaps even more so than in relationships outside of work, establishing whether a potential new friend is trustworthy is crucial. You have to decide, “Can I have confidence in this person?” </p>\n<p>Knowing whether trust is possible is a process that begins by first being careful and paying close attention to the other person. How do they behave when they don’t believe they are being observed, such as in their treatment of subordinates? How do they talk about others? Do they show what Robert calls <em>sympathetic joy</em>, or are they envious and calculating? How do they deal with confidential information? Are they telling you secrets they are not supposed to tell? Do they overshare? Remember: You don’t have to be friends with everyone, and each relationship has to be considered on its own merits. No situation is identical to another.</p>\n<p></p>\n<p><strong>Start with mutual sharing.</strong> Friendship builds as you begin to take the risk of leaning on each other. If it keeps feeling right, then it’s possible to take more risks. When it does not feel right, then it moves back to a more detached, businesslike relationship. Friendship develops over time based on incremental actions that are frequent and informal. Saying “hi” through an open door and chatting in the kitchen area gradually shifts into sharing interests and volunteering information. Especially for people who are working partially at home, in-office interactions during those infrequent times together has been shown to <a href=\"https://sloanreview.mit.edu/article/the-loneliness-of-the-hybrid-worker/\">reduce feelings of aloneness</a> and improve job satisfaction.</p>\n<p></p>\n<p>Friendships build from reciprocal effort; they involve telling your friend something and listening to them share their thoughts. By asking, “How is your mother doing?” or offering information like, “I am worried — I think my daughter is depressed,” you are acknowledging the other person and both your and their unique situations. In the workplace, asking about what the other person is experiencing and engaging with them about their stories and opinions is showing what Robert calls <em>radical curiosity</em>: “Hearing an accurate understanding of your own experience coming from another person, articulated in their words, can be thrilling.” I really feel this for myself. I have a close friend at work and share with her my innermost worries, successes, and frustrations. My life feels chaotic at times, but our friendship has been a steady and nurturing force. Sharing strengthens a sense of belonging. </p>\n<p>The alternative of not sharing and not establishing friendships is that so much of the “real” parts of our lives have to be separated from the “work” parts. I believe that friendship at work is a risk worth taking. Many of us spend eight hours a day working, and if we compartmentalize and silo, we have no one to talk to about what we are struggling with or celebrating. That is the foundation of loneliness — which has tremendous costs and negative consequences. </p>\n<p>So let’s embrace complexity rather than shutting it down. It’s sad if we cannot have friends at work because we believe the risks are too high. Let’s not overestimate the mess of trying to build friendships at work and underestimate the benefits of having a close friend at work. </p>\n<p></p>\n",
  "wfw:commentRss": "https://sloanreview.mit.edu/article/why-you-should-make-friends-at-work/feed/",
  "slash:comments": 0
}