{
  "title": "187: White Boy",
  "link": "https://audioboom.com/posts/7895459",
  "itunes:episode": 187,
  "itunes:title": "White Boy",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3193,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Fam, if you thought New York in the 70s, was bad, WELCOME TO DETROIT IN THE 80s. It’s the height of “the war on drugs” and, according to local law enforcement, it seems that a new drug gang is popping up every week. Enter the notorious White Boy Rick—a SIXTEEN YEAR OLD DRUG KINGPIN WHO IS RUNNING DETROIT LIKE A MAFIA BOSS…or so the legend went. In reality, he was a14-year-old informant for the FBI who was thrust into the world of drugs and gun by his father, and then sold out by everybody. <br>\n<br>\n<a href=\"https://www.unionstage.com/shows/true-crime-obsessed-capital-turnaround/\"><strong>COME SEE US LIVE IN DC</strong></a><strong>!! Friday, September 17th at 8pm! WITH RABIA CHAUDRY AND SUSAN SIMPSON OF \"UNDISCLOSED.\" We're covering HBO's \"The Case Against Adnan Syed.\" We're gonna talk about Don for like 6 hours (just kidding...but maybe?). It will be our hilarious, informative, and outrageous live show AND RABIA AND SUSAN WILL SHARE ALL THE SHOCKING NEW INFORMATION ON THE CASE! </strong><a href=\"https://www.unionstage.com/shows/true-crime-obsessed-capital-turnaround/\"><strong>Get your tickets here!</strong></a><strong> (IF YOU HAD TICKETS FOR THE PREVIOUS DATE, DO NOTHING! YOUR TICKETS STILL WORK!)<br>\n <br>\nLOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 200 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>Night Stalker</strong>\" <strong>\"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Tue, 29 Jun 2021 10:18:44 +0000",
  "guid": "tag:audioboom.com,2021-06-29:/posts/7895459",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}