{
  "title": "N-photon Bound States In The Continuum For Strong Intensity Squeezing And Deterministic Stabilization Of Large Photonic Fock States. (arXiv:2211.01514v1 [quant-ph])",
  "link": "http://arxiv.org/abs/2211.01514",
  "description": "<p>Large non-Gaussian states of light are a highly coveted resource in quantum\nscience and technology. An important example of such states are n-photon states\nof light (Fock states), which, besides being the most fundamental states of the\nquantized radiation field, are theoretically believed to be valuable for many\ntasks including metrology, communication, simulation, quantum state generation,\nand information processing. However, the deterministic creation of even\napproximate large-number Fock states at optical frequencies is a long-standing\nopen problem. Here, we present a fundamental new effect in nonlinear photonic\nsystems, called n-photon bound states in the continuum, which can be applied to\ndeterministically create large Fock states, as well as very highly\nintensity-squeezed states of light. The effect is one in which destructive\ninterference gives a certain quantum state of light an infinite lifetime,\ndespite coexisting in frequency with a radiative continuum. For Kerr nonlinear\nsystems, that state is an Fock state of a particular and tunable n. We develop\nthe theory using experimentally-realizable examples (showing examples of\nproducing 30-photon Fock states, and states with very large intensity squeezing\n(10 dB)), and we describe schemes to pump and probe the generated quantum\nstates. The effect requires only Kerr nonlinearity and linear\nfrequency-dependent (non-Markovian) dissipation, and is in principle applicable\nat any frequency. The theory and concepts are also immediately applicable to\nnonlinear bosons besides photons, and should be implementable in many other\nfields (e.g., superconducting circuits, magnonics, phononics). Further, we\nexpect the broader possibility of using engineered nonlinear photonic\nstructures with highly tailorable radiation loss as a basis to create many of\nthe other quantum photonic states that have traditionally been hard to\ngenerate.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/quant-ph/1/au:+Rivera_N/0/1/0/all/0/1\">Nicholas Rivera</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Sloan_J/0/1/0/all/0/1\">Jamison Sloan</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Salamin_Y/0/1/0/all/0/1\">Yannick Salamin</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Soljacic_M/0/1/0/all/0/1\">Marin Soljacic</a>"
}