{
  "title": "Episode 106: Your Sexual Orientation - How Did It Develop?",
  "pubDate": "Mon, 12 Oct 2009 03:02:00 +0000",
  "guid": "episode-106-your-sexual-orientation-how-did-it",
  "link": "http://www.thepsychfiles.com/2009/10/episode-106-your-sexual-orientation-how-did-it-develop/",
  "itunes:image": "",
  "description": "<p>How did you get to be heterosexual?  Homosexual?  Bisexual?  Was it nature or nurture (or both?).  Were you born with a sexual orientation or did it develop as you grew? What role did your parents play?  In this episode I present the most recent scientific research on the topic of how we develop our sexual preference.  You'll find out whether heterosexual men have more testosterone than homosexual men, how most people know their sexual orientation when they are as young as 10 years old, how your third intersitial nucleus might be playing a role and finally, finally, could it something to do with the length of your fingers?</p>",
  "content:encoded": "<p>How did you get to be heterosexual?  Homosexual?  Bisexual?  Was it nature or nurture (or both?).  Were you born with a sexual orientation or did it develop as you grew? What role did your parents play?  In this episode I present the most recent scientific research on the topic of how we develop our sexual preference.  You'll find out whether heterosexual men have more testosterone than homosexual men, how most people know their sexual orientation when they are as young as 10 years old, how your third intersitial nucleus might be playing a role and finally, finally, could it something to do with the length of your fingers?</p>",
  "enclosure": "",
  "itunes:duration": "32:03",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology,lecture",
  "itunes:subtitle": "How did you get to be heterosexual?  Homosexual?  Bisexual? Were you born with a sexual orientation or did it develop as you grew? In this episode I present the most recent scientific research on the topic of how we develop our sexual preference.  ",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "How did you get to be heterosexual? Homosexual? Bisexual? Was it nature or nurture (or both?). Were you born with a sexual orientation or did it develop as you grew? What role did your parents play? In this episode I present the most recent scientific research on the topic of how we develop our sexual preference. You'll find out whether heterosexual men have more testosterone than homosexual men, how most people know their sexual orientation when they are as young as 10 years old, how your third intersitial nucleus might be playing a role and finally, finally, could it something to do with the length of your fingers?"
}