{
  "title": "Why the world needs a non-profit search engine",
  "link": "",
  "updated": "2022-07-10T00:00:00+00:00",
  "id": "http://daoudclarke.github.com/search%20engines/2022/07/10/non-profit-search-engine",
  "content": "<p>Sometimes I forget why I’ve taken on this crazy, huge task. Why am I <a href=\"https://github.com/mwmbl/\">building</a> a <a href=\"https://mwmbl.org\">search engine</a>? Will\nit really be better than Google one day? Will people support it? Will people even use it?</p>\n\n<p>And then I read something like <a href=\"https://pxlnv.com/blog/bullshit-web/\">The Bullshit Web</a> and I remember, that, yes, there\nis a point. Even if I make the web better for one person, it’s worth it. Because the way things are is just wrong.</p>\n\n<p>Search engines are in a unique position to fix the situation. Not only do we create a view on the world’s knowledge, we\ninfluence it too. If we promote bullshit-free sites, then people will create more bullshit-free sites.</p>\n\n<p>More importantly, search engines are a filter on the world’s\nknowledge. Do you really want your filter to be “whatever makes\n$SEARCH_ENGINE more money”, particularly when that means, “show ads\ninstead of search results, and prioritise search results that also\nmake us more money”?  We can and should do better.</p>\n\n<h3 id=\"what-will-it-mean-in-practice\">What will it mean in practice?</h3>\n\n<p>What would the ideal non-profit search engine look like in practice,\nand what would make it better than what we have now?</p>\n\n<ol>\n  <li><strong>Ad-free.</strong> While this can be achieved now with ad-blockers,\nthis is clearly not a sustainable solution if everyone were to\napply it.</li>\n  <li><strong>Open source.</strong> The technology for organising the world’s\nknowledge should be owned by everyone.</li>\n  <li><strong>Profit agnostic ranking.</strong> Google has an incentive to rank\npages that contain Google ads because it makes them more\nrevenue. More generally, Google has an incentive to rank\nprofit-making sites higher so that they make more money. This both\ngives them more money to spend on advertising, and makes them\ndependent on their Google ranking, making them more likely to\nspend on advertising should their ranking get worse.</li>\n  <li><strong>Community powered ranking.</strong> Google tries to work out which\nsites are interesting by how long you spend on the site. This has\nan unfortunate side effect for e.g. recipe sites, where there is\nan absurd incentive to hide the actual recipe after a ton of\nbackground and repetitive descriptions of the recipe, to make it\nmore likely for you to get distracted on the way to get to the\nactual recipe. Instead of looking at how long people spend on a\nsite, we would encourage users to give explicit feedback on\nrankings and use this to improve our ranking system.</li>\n  <li><strong>Fast.</strong> Google search is surprisingly slow, taking up to half a\nsecond for a page load to complete in my measurements. It doesn’t\nneed to be this way. In 2010, Google announced <a href=\"https://searchengineland.com/google-instant-complete-users-guide-50136\">Instant\nSearch</a>\nthat would search as you typed. This was meant to <a href=\"https://www.theatlantic.com/technology/archive/2010/09/the-pros-and-cons-of-google-instant/62666/\">save users two\nto five seconds per\nsearch</a>. Yet\nGoogle quietly <a href=\"https://searchengineland.com/google-dropped-google-instant-search-279674\">dropped this\nfeature</a>\nin 2017, ostensibly to bring search more in line with mobile. I do\nwonder though, if the change was more motivated by some\nrequirement around adverts. It must be hard to manage auctioning\nadverts in real-time as users type, particularly if you want the\nadverts to blend into the search results.</li>\n  <li><strong>Frictionless.</strong> Google has an incentive to show you a results\npage, so that you see some adverts and are thus more likely to\nclick on them. But often you don’t need to see a results page, for\nexample if there is a single page you need. For example if you are\ntyping “facebook” or “hmrc login” you <em>could</em> go straight there\nfrom the address bar. But Google wants you to see a results page\nfirst.</li>\n</ol>\n\n<p>Our current implementation of <a href=\"https://mwmbl.org\">Mwmbl</a> is a long way\nfrom doing all these things well, but this is what we’re aiming\ntowards.</p>\n\n<h3 id=\"the-funding-question\">The funding question</h3>\n\n<p>Search funded by advertising is a recipe for disaster because there will always be a conflict of interest. Get the user\nto the site as quickly as possible, or show them some ads on the way? Guess which one you will choose if you care about\nrevenue.</p>\n\n<p>There are two ways forward that I can see:</p>\n\n<ul>\n  <li>The paid subscription model, like <a href=\"https://kagi.com\">kagi.com</a></li>\n  <li>Donation funded, non-profit model, like Mwmbl - <a href=\"https://github.com/sponsors/mwmbl\">donate here!</a></li>\n</ul>\n\n<p>There is no guarantee that either approach will work - but it’s got to be worth a try.</p>\n\n<h3 id=\"the-donation-model\">The donation model</h3>\n\n<p>While I wish Kagi the best, we have chosen the donation model because\nwe want to make the best search engine possible available to\neveryone. Not everyone can afford to pay for search.</p>\n\n<p>When I read the numbers it makes me feel a little sick. Google’s revenue for search was around <a href=\"https://searchengineland.com/alphabet-q1-microsoft-q3-earnings-search-advertising-383869\">$40 billion in Q1 2022</a>.\nA number so large, I can’t even conceive how big it is. Just 1% of 1% of this would be more money than I’d know what to\ndo with ($4m).</p>\n\n<p>But it also makes me hopeful. If I can create something that just a\ntiny fraction of people find useful, then I can create a huge amount\nof value. If there is value, then people will pay for it, if we find\nthe right way to ask.  Our current plan is to offer different\nsponsorship tiers with intangible rewards, for example virtual badges\ndisplayed on the user’s profile page.</p>\n\n<p>Of course, there are plenty of non-profits in adjacent spaces that have been successful. I think Wikimedia is the best\nexample to look up to. Also, I believe our values are very closely aligned. If they were open to collaborating or taking\non this project then I would seriously consider it, because I think it would give it a much greater chance of success.</p>\n\n<h3 id=\"what-next\">What next?</h3>\n\n<p>Our current goals are:</p>\n<ul>\n  <li>Index 1 billion pages a month. Help us by <a href=\"https://addons.mozilla.org/en-GB/firefox/addon/mwmbl-web-crawler/\">installing our Firefox\nextension</a>\nto crawl the web. Our ranking evaluations have shown that the\nbiggest improvements come from indexing more pages. So that is our\nfirst priority.</li>\n  <li>Raise enough money to form an official non-profit\norganisation. This will be the first step in making Mwmbl\nsustainable, beyond being a side-project for a few people.</li>\n  <li>Get to £50 monthly recurring revenue to enable us to upgrade our\nserver (currently costing under €5 a month) - <a href=\"https://github.com/sponsors/mwmbl\">donate\nhere</a>! This will allow us to\nincrease the size of our index, improving our search results.</li>\n</ul>\n\n<p>If you’re interested in helping out, we’re <a href=\"https://github.com/mwmbl/mwmbl/wiki/Open-positions\">recruiting\nvolunteers</a>, or if\nyou’re a developer, check out the <a href=\"https://github.com/mwmbl/mwmbl/issues\">open issues</a>.</p>\n\n<h3 id=\"thanks\">Thanks</h3>\n\n<p>Thank you so much to all those that have helped out so far, whether by <a href=\"https://addons.mozilla.org/en-GB/firefox/addon/mwmbl-web-crawler/\">donating\nyour CPU and bandwidth</a> to crawl the web, <a href=\"https://github.com/sponsors/mwmbl\">giving money</a> to cover our\ncosts, giving your time and skills to <a href=\"https://github.com/mwmbl/mwmbl/issues\">fix issues</a> or giving feedback on our\n<a href=\"https://matrix.to/#/#mwmbl:matrix.org\">Matrix server</a>.</p>\n\n<p>In particular, <a href=\"https://matrix.to/#/#mwmbl:matrix.org\">Colin Espinas</a>\nhas been instrumental in designing and building the new front end, and\nsupporting the development of the extension - thanks Colin!</p>\n\n<!-- ### The motivation question -->\n\n<!-- At the moment, I'm loving working on Mwmbl. I relish the technical challenges, and I enjoy seeing something I've created -->\n<!-- come to life. But I know I have limits. I tend to get bored of my side projects after a few months. This is by far the -->\n<!-- longest I've worked on something - and it hasn't by any means been continuous. I've realised that I sometimes need to -->\n<!-- step away for a while, and that's ok. -->\n\n<!-- At this point, I'm not going to force myself to work on something I don't enjoy. If I don't feel like it, I'll take a -->\n<!-- break. No one's paying me to do this (see above!) - perhaps if they were, then I could consider this a job, which -->\n<!-- would be amazing. -->"
}