{
  "title": "Analyzing Performance Issues of Virtual Reality Applications. (arXiv:2211.02013v1 [cs.SE])",
  "link": "http://arxiv.org/abs/2211.02013",
  "description": "<p>Extended Reality (XR) includes Virtual Reality (VR), Augmented Reality (AR)\nand Mixed Reality (MR). XR is an emerging technology that simulates a realistic\nenvironment for users. XR techniques have provided revolutionary user\nexperiences in various application scenarios (e.g., training, education,\nproduct/architecture design, gaming, remote conference/tour, etc.). Due to the\nhigh computational cost of rendering real-time animation in limited-resource\ndevices and constant interaction with user activity, XR applications often face\nperformance bottlenecks, and these bottlenecks create a negative impact on the\nuser experience of XR software. Thus, performance optimization plays an\nessential role in many industry-standard XR applications. Even though\nidentifying performance bottlenecks in traditional software (e.g., desktop\napplications) is a widely explored topic, those approaches cannot be directly\napplied within XR software due to the different nature of XR applications.\nMoreover, XR applications developed in different frameworks such as Unity and\nUnreal Engine show different performance bottleneck patterns and thus,\nbottleneck patterns of Unity projects can't be applied for Unreal Engine\n(UE)-based XR projects. To fill the knowledge gap for XR performance\noptimizations of Unreal Engine-based XR projects, we present the first\nempirical study on performance optimizations from seven UE XR projects, 78 UE\nXR discussion issues and three sources of UE documentation. Our analysis\nidentified 14 types of performance bugs, including 12 types of bugs related to\nUE settings issues and two types of CPP source code-related issues. To further\nassist developers in detecting performance bugs based on the identified bug\npatterns, we also developed a static analyzer, UEPerfAnalyzer, that can detect\nperformance bugs in both configuration files and source code.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Hogan_J/0/1/0/all/0/1\">Jason Hogan</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Salo_A/0/1/0/all/0/1\">Aaron Salo</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Rzig_D/0/1/0/all/0/1\">Dhia Elhaq Rzig</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Hassan_F/0/1/0/all/0/1\">Foyzul Hassan</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Maxim_B/0/1/0/all/0/1\">Bruce Maxim</a>"
}