{
  "title": "African Rights Commission’s Work More Important Than Ever",
  "link": "https://www.hrw.org/news/2022/11/02/african-rights-commissions-work-more-important-ever",
  "description": "Click to expand Image\n          \n\n\n\n\n  \n        \n                      \n      \n        The 73rd session of the African Commission on Human and Peoples’ Rights in Banjul, Gambia.\n                    © 2022 Francisco Perez\n          \n\n  \n<p>(Nairobi) – The growing importance of intensified protection of human rights on the African continent comes into sharp focus at a time when several countries across the continent are facing acute human rights crises, Human Rights Watch said today, noting that the African Commission on Human and Peoples’ Rights marks its 35th anniversary during its 73rd ordinary session in November 2022.<br /><br />\nThe African Commission, based in Banjul, Gambia, is a quasi-judicial mechanism tasked with promoting and protecting human rights and collective rights as well as interpreting the African Charter on Human and Peoples’ Rights. The Commission receives complaints from states parties, individuals, and nongovernmental organizations (NGOs) from all 55 African Union member states.<br /><br />\n“The Commission’s establishment 35 years ago is an important reminder that political independence and the liberation of Africa are best achieved when underpinned by human rights and democratic governance,” said Carine Kaneza Nantulya, deputy Africa director at Human Rights Watch. “African leaders should ensure its independence and respect its rulings.”<br /><br />\nThe Commission was founded to defend both individual and collective human rights following a period when the Organization of African Unity (OAU), the AU’s predecessor, did not place emphasis on individual rights and freedoms. In the 1970s, with no regional human rights mechanism, civil society groups and international organizations worked to expose human rights abuses on the continent. In 1979, a group of experts produced a draft charter on human and peoples’ rights, which was unanimously adopted at a 1981 OAU heads of state meeting in Nairobi, Kenya, thus creating the Commission on November 2, 1987.<br /><br />\nBeginning in 2020, Human Rights Watch spoke to 46 African activists, thought leaders, experts, and former and current members of the Commission and the African Court on Human and Peoples’ Rights who reflected on the Commission’s impact and its challenges.<br /><br />\nApart from the Commission, the AU created the African Court on Human and Peoples’ Rights by a protocol to the African Charter adopted on June 9, 1998, which entered into force on January 25, 2004. The court has jurisdiction over cases and disputes concerning human rights violations and complements the Commission’s mandate.<br /><br />\nThe Commission has issued critical decisions, including the 2016 ruling on the Democratic Republic of Congo (DRC), that have expanded standards and understanding on human rights in Africa and the rest of the world, including on the right to development, Indigenous peoples’ rights, women’s rights, children’s rights, media freedoms, and rights-focused government responses to the Covid-19 pandemic. <br /><br />\nThe Commission, in its 2016 landmark ruling, stated that the Congolese government violated numerous human rights in its brutal repression of peaceful protests against the harmful operations of a foreign mining company. This ruling had a significant impact on the jurisprudence of development as it included a breach of the rights to housing, while highlighting the need and legal imperative for entities engaged in extractive industries to undertake their operations with due regard to the rights of the host communities.<br /><br />\nAnother landmark ruling of the Commission was its 2010 ruling in the Endorois case where it found multiple violations of the African Charter in the eviction of the Endorois people from their homeland in central Kenya. It was the first ruling of any international tribunal to find a violation of the right to development, and the first ruling to explain who Indigenous peoples in Africa are, and what are their rights to land.<br /><br />\nThe Commission has also adopted resolutions on various human rights issues across the continent. In 2020, it issued a resolution reaffirming that human rights and freedoms should be central in governments’ responses to the Covid-19 pandemic.<br /><br />\nIn 2021, the Commission adopted a resolution to respect, without restriction, the principle of nonrefoulement of asylum seekers and refugees. The resolution condemned all expulsions of asylum seekers and refugees to countries where their lives or freedoms would be threatened.<br /><br />\nIn a March 2022 resolution, the Commission urged AU member states to take steps to protect marginalized groups and ensure their right to food and nutrition, including during protracted crisis, conflicts, and natural disasters.<br /><br />\nNotably, the Commission has also developed legal guidance on how to implement many key human rights set out in the African Charter and other human rights treaties and documents such as the Protocol to the African Charter on Human and Peoples’ Rights on the Rights of Women in Africa (the “Maputo Protocol”). This legal guidance includes general comments and guidelines aimed at building upon existing legal obligations of African States. The guidelines are a key tool for formulating standards, principles, and rules on which African governments can base their legislation. In May 2022, the Commission adopted its Guidelines on the Protection of All Persons from Enforced Disappearances in Africa.<br /><br />\nThe Commission, in collaboration with African activists, has been a driving force in African norms setting and standards development, including through the creation of important mechanisms such as a Special Rapporteur on Prisons, Conditions of Detention and Policing in Africa in 1996, a Special Rapporteur for Women’s Rights in 1999, a Special Rapporteur on Human Rights Defenders and Focal Point on Reprisals in Africa, and a Special Rapporteur on Freedom of Expression and Access to Information in 2004, among others. The dynamic relationship between the Commission and regional civil society groups has led to an increase in the number of groups with observer status at the Commission from a few dozen in the 1980s to more than 500 today.<br /><br />\nWhile these examples provide ample evidence that the Commission has in many ways delivered on its protection and promotion mandate, it continues to face challenges that impede its effectiveness, especially because AU member states refuse to carry out decisions of the Commission and other AU organs on the deepening human rights violations and democratic crises affecting the continent. <br /><br />\nThe situation is compounded by the decision in June 2018 of the AU Executive Council to restrict the mandate and independence of the Commission, threatening to leave it obsolete and irrelevant and undermine the Commission’s progress in the last three decades.<br /><br />\n“Despite serious challenges, the Commission has stood its ground and sided with countless victims of rights violations by using resolutions and rulings against abusive governments and introducing complaints before the African Court,” Kaneza Nantulya said. “The Commission is probably the most important institution that Africans created to realize the objectives and foundational values of the AU.”<br /><br />For key human rights crises in Africa and quotes from leaders interviewed, please see below.<br /><br />Key Human Rights Crises in Africa<br /><br />\nIn Ethiopia, the Commission is conducting a Commission of Inquiry into serious crimes in Tigray, but despite leading a negotiation process, the AU Peace Security Council has consistently failed to address allegations of war crimes and crimes against humanity committed by the warring parties since the Tigray war broke out in November 2020.<br /><br />\nIn Sudan, the Commission has urged the Sudanese authorities to restore constitutional order and protect the rights of the Sudanese people and urged Sudan’s regional and international partners to up their efforts at addressing security and governance crisis. Despite the Commission’s urging, the AU, acting as a mediator, has not supported calls by Sudanese activists and victims for reforms, justice, and accountability into the June 3 killings and the October 2021 coup.<br /><br />\nIn South Sudan, the AU’s 2014 Commission of Inquiry recommended creating a hybrid court as “an Africa-led, Africa-owned, Africa-resourced legal mechanism under the aegis of the African Union,” which would include South Sudanese judges and lawyers, to bring justice for international crimes committed during South Sudan’s conflict. But eight years later, the AU has not established South Sudan’s hybrid court.<br /><br />\nIn the Sahel, AU leaders have yet to adequately address unlawful killings by soldiers and Islamist armed groups, which fuel recruitment into abusive armed groups and deepen the security crisis in the region. In Mali, while the Commission has called on authorities to respect fundamental freedoms, the AU has failed to press them to investigate serious abuses by the Malian security forces and allied forces including the Russia-linked Wagner Group, a private military security contractor, during military operations.<br /><br />\nIn several African countries, including Burundi, Cameroon, the Democratic Republic of Congo, Mali, Mozambique, Niger, and South Sudan, despite multiple calls by African civil society organizations and the Commission, AU leadership has failed to publicly denounce serious crimes by government forces and to press for justice for the victims.<br /><br />Civil Society Leaders Comment on the African Commission<br /><br />Some of those interviewed asked not to be identified by name so they could comment freely. <br /><br />Importance of Civil Society Involvement<br /><br />\nThe work of civil society activists and organizations has been pivotal to the effectiveness of the African Commission. <br /><br />\nFatou Jagne Senghore, Regional Director of ARTICLE 19 West Africa said:<br /></p>\n\n\n<p>One of the biggest prizes was to advocate for the adoption of a Declaration and a special rapporteur for freedom of expression. When I joined ARTICLE 19 in February 2002, my role was to support the ACHPR to finalize the draft and mobilize for the adoption of the Declaration. We organized consultations across the table to get African CSOs [civil society organizations], media, and freedom of expression advocates and media organizations to provide their inputs and support. We had two sessions of negotiations with a core group of Commissioners in February, in May with other stakeholders, and in October 2002, we had the African Declaration, which was one of the best and most progressive at the time in terms of the standards it set. We continued the advocacy and consultations to get support and inputs from various institutions, including African Union member states, the UN human rights bodies, the Inter-American human rights organizations, and CSOs. It was humbling to be part of and to have contributed substantially to the process of setting up the mandate of the special rapporteur. In 2004, a full office of the Special Rapporteur on Freedom of Expression was established. <br /><br />\nThe appointment of a Special Rapporteur on Freedom of Expression had an impact on people who were not interested and felt distant from the ACHPR. The Commission was not very visible until then and the fact that the ACHPR created such a mechanism had a tremendous impact especially on media and freedom of expression advocates. </p>\n\n\n<p><br />\nSome interviewees stressed that advocating and supporting human rights issues at the Commission, even those deemed controversial by African leaders, were essential in securing civil society participation and input into the work of the Commission.<br /><br />\nSibongile Ndashe, executive director of Initiative for Strategic Litigation in Africa (ISLA), said:<br /></p>\n\n\n<p>The advocacy on Sexual Orientation and Gender Identity (SOGI), which started around 2006, was about investigating ways in which the ACHPR could be used to add value on [the] SOGI issue. There were several international NGOs mobilizing and organizing African activists, at that time, like the Coalition of African Lesbians (CAL) and African Men for Sexual Health and Rights (AMSHeR). So, the work was led by internationals, but nevertheless it created a space where people could really have difficult, yet meaningful and timely conversations about what could be done at the African Commission.<br /><br />\nI joined this group around 2009. We believed that LGBTI [lesbian, gay, bisexual, transgender and intersex] work had to be anchored in mainstream organizations to ensure that these issues are not marginalized and become insular. Our main goal was to acquire observer status to be able to make statements on SOGI issues at the ACHPR, and this shaped the nature of the partnership. We had to build trust, find the resources, coordinate the movement, and ensure that there was sufficient support for regional organizations like CAL. Our main task was to help push for these organizations to be the voices, the face of this movement.</p>\n\n\n<p><br />\nDon Deya, executive director of the Pan African Lawyers Union (PALU):<br /></p>\n\n\n<p>The Commission has provided a pillar, a foundation where African citizens and friends of Africa meet around the NGO forum, this has built a strong platform of African actors who talk to each other. Besides the case law, the soft law, the principles, declarations, and recommendations, the fact that there is place where citizens go twice a year to interact, is important and it is one invaluable benefit that has been under-recorded and understated.”</p>\n\n\n<p><br />\nA former chairperson of the ACHPR said:<br /></p>\n\n\n<p>The contribution of African NGOs to the work of the ACHPR has been invaluable over time. They have been at the center of the reflections which have permitted the progressive and qualitative development of the work of the ACHPR, and the creation of some of its important subsidiary mechanisms, such as the Working Groups on Extractive Industries and Human Rights, and on Indigenous Populations, the HIV/AIDS and Human Rights Committee, or the creation of the focal point against reprisals attached to the mechanism of the Special Rapporteur on Human Rights Defenders.<br /><br />\nThey have forged a lasting and unique interaction and synergy around all themes in the field of human rights, by setting up specific discussion caucuses within the NGO Forum. This makes the NGO forum a dynamic space for evaluation, analysis, information, and proposals for recommendations on the human rights situation on the continent.</p>\n\n\n<p><br />\nA former legal officer of the ACHPR said:<br /></p>\n\n\n<p>CSOs have also fueled the work of African jurists and researchers leading to the creation of an African Court of human rights to complete and strengthen the protection mandate of the ACHPR. They have created a dynamic coalition with this jurisdiction since its operationalization and continue to support its activities through strong advocacy with the state parties.</p>\n\n\n<p><br />Expansion of Economic, Social, and Cultural Rights<br /><br />\nInterviewees recalled landmark rulings by the Commission and their impact on rights protection at the national level, especially on economic, social, and cultural rights.<br /><br />\nKipsang Kipkazi, former executive director of the Endorois Welfare Council said:<br /></p>\n\n\n<p>Getting the African Commission to act was done through serious lobbying and advocacy during its annual sessions to ensure that the Kenyan government answers to specific questions around domestic human rights violations. We had to ensure that we attended all the international forums to challenge their reports e.g. at UN Geneva and New York forums. An important outcome of the involvement of the ACHPR is that the draft Kenya constitution recognized many of the issues we had raised in our case including communal land ownership and added, for example, chapter 4, which highlights human rights issues. In addition, an act of parliament on community land was established.</p>\n\n\n<p><br />Complementary Jurisdictions of the Commission and the African Court <br /><br />\nSome experts shared what they see as defining moments in the life of the Commission, including times when states agreed to appear before the African Court to respond to their citizens’ and the Commission’s allegations of serious violations.<br /><br />\nDon Deya described a momentous experience regarding Libya, in a case filed at the Commission by the Egyptian Initiative on Personal Rights, Human Rights Watch, and Interights:</p>\n\n\n<p>When the crisis in Libya broke out, what others call the Arab Spring, the administration was abusive and violated citizens’ rights on the street. Libyan CSOs had strong relationships with their colleagues around the world, who filed a series of complaints at the ACHPR in March 2011 accusing the Libyan government of committing massive human rights violations in the context of responding to the demonstrations and protests. The Commission received this communication literally on the last day of an extraordinary session, and for the first time, they referred the case to the African Court, citing the principle of complementarity. The court accepted the ACHPR referral, ordered provisional measures instructing the Libyan government to stop killing their civilians and to present within one month to the court what measures they had taken. It was fantastic!<br /><br />\nLibya, to our surprise, accepted the Court’s jurisdiction, and confirmed that they would defend their case. So here was an opportunity for us, African citizens, in the middle of a conflict, to engage with and confront a government, not in a political way, but on a judicial basis, with facts and evidence on both sides. Unfortunately, there were other dynamics elsewhere. The UNSC [United Nations Security Council] passed Resolution 1972 which authorized NATO military intervention, which took its own momentum. Ultimately neither the people nor the outgoing Libyan administration had a chance to come before an impartial judicial mechanism. But it showed that the system can work. It just requires citizens to be robust and audacious enough, and for institutions to focus on substantive justice. For me that’s one of the most profound stories I would tell because it brings together the citizens, the Commission, and the Court.</p>\n\n\n<p><br />\nA former judge of the African Court said:</p>\n\n\n<p>Strong complementarity between the Commission and the Court is essential for holding governments to account. Often, these institutions are the course of last resort for countless victims. From the time the Court became judicially operational – around 2008/2009 – CSOs began to lodge cases before it based on Article 3 (5) and 34 (6) of the 10 June 1998 Protocol establishing the Court.<br /><br />\nAs of September 2019, 12 applications had been brought by various CSOs on various rights issues, including the freedom of association; right to an impartial electoral commission; right to participation; right to inheritance and to nondiscrimination for women and children born out of wedlock; and States’ obligation to eliminate traditional and cultural practices harmful to the rights of women and children. But only some of these were considered by the Court on the merits.</p>\n\n\n<p><br />\nA former commissioner said:</p>\n\n\n<p>Another important case was the African court decision in African Commission on Human and Peoples’ Rights v. Republic of Kenya, of 26 May 2017. The Court found numerous violations of the rights of Indigenous peoples, including the right to land, nondiscrimination, freedom of religion; the right to freely take part in the cultural life of the community and to the promotion and protection of morals and traditional values recognized by the community; as well as the rights of community to freely dispose of its wealth and natural resources and to economic, social, and cultural development.</p>\n\n\n<p><br />Confronting Justice and Accountability for Serious Crimes<br /><br />\nAlmost all interviewees shared their frustration over the pervasive culture of impunity and injustice, despite the establishment of AU-led human rights investigations processes in various countries.<br /><br />\nA Kenyan lawyer noted:<br /></p>\n\n\n<p>It has been a journey, still is, for states to accept accountability, especially African states to accept accountability for rights violation in their countries – that’s the one thing the Commission has achieved – it has issued landmarked judgments, that clarified the laws and doctrines that hold states to account on specific human rights violations.</p>\n\n\n<p><br />\nAn activist, based in Addis Ababa, Ethiopia said:<br /></p>\n\n\n<p>For me, Ethiopia and South Sudan are a stark reminder of how the AU has let down millions of Africans. On both countries, we have had AU-led commissions of inquiry and UN mechanisms. On both, AU member states have either reversed commitments they made on justice and accountability or actively undermined the work of the Commission.”</p>\n\n\n<p><br />\nA member of an organization that recently acquired observer status at the Commission said:<br /></p>\n\n\n<p>There is a clear need for the ACHPR to have more power to issue binding decisions and launch in-country investigations. Countries should not be exempt from scrutiny. Otherwise, why would we have such a body?”</p>\n\n\n<p><br />Media’s Role in Advancing Human Rights in Africa<br /><br />\nSome journalists said that the media needs to do more to publicize and effectively communicate the mission, mandate, and work of the ACHPR.<br /><br />\nAn African journalist from Voice of America said:<br /></p>\n\n\n<p>Unfortunately, the media pays more attention to UN sessions, like the UN General Assembly (UNGA) and rather than sessions that happen in the region. The issue with the Commission is that many people don’t really know its mandate. Journalists feel removed from its work. It would be good to organize a media campaign in two or three countries in each subregion to raise awareness and explain its mission, ensure public participation in the debate, and organize a training of journalists on human rights in Africa and the work of the Commission.</p>\n\n\n<p><br />\nA Nairobi-based journalist from Radio France International (RFI), said:</p>\n\n\n<p>The Commission is so key to Africans, albeit being less publicized than Western human rights institutions. The Commission has a better grasp of human rights in Africa. It should target the media more, provide us with timely reports and information. The media should show more interest, especially African journalists at engaging the Commission.</p>\n\n\n<p><br />\nDouadé Alexis Gbansé, editor-in-chief of Connectionivoirienne.net, based in Cote d’Ivoire:</p>\n\n\n<p>As surprising as it may seem, with more than 15 years as a journalist, I have no knowledge of the presence of the headquarters of the ACHPR in Banjul, Gambia. The media should do more in terms of covering the activities of this Commission. But more importantly, the press and communication department of this Commission in Banjul should communicate more with the media.</p>\n\n\n<p><br />Recommendations to AU Policy Organs and African Human Rights Institutions<br /><br />\nSeveral people addressed what they see as challenges, including the lack of CSO engagement at the AU headquarters in Addis Ababa, the ACHPR’s operational challenges, and the AU’s reluctance to uphold its commitments toward promoting and protecting human rights. They also offered some recommendations. Many raised the disconnect they feel between African civil society organizations and the Economic, Social and Cultural Council (ECOSOCC). ECOSOCC was established in July 2004 as an advisory organ composed of different social and professional groups of AU member states whose task is to provide an opportunity for African CSOs to play an active role in contributing to the AU’s principles, policies, and programs.<br /><br />\nA human rights defender said:<br /></p>\n\n\n<p>My wish is for the AU policy organs to recommit to its foundational values and be more constructive in their engagement with Africans. ECOSOCC should play its role and not always sound like a government’s spokesperson. Some NGOs are members of ECOSOCC, others not because they don’t feel fully integrated and accepted as activists whose work goes against government’s selfish interests. We as CSOs also must be more creative and boost our mobilization in Addis. For example, the only treaties that have been ratified are the ones backed and pushed by CSOs. We need to come up with a more innovative way to engage locally, regionally, and internationally to think outside the box. Sometimes the best strategy is the one combining local knowledge and international visibility.</p>\n\n\n<p><br />\nA prominent activist said:<br /></p>\n\n\n<p>What we really need is a critical mass – we only have 100 organizations that regularly attend the commission’s sessions, whereas Africa has more than 1.4 billion citizens. Only a few organizations that work closely with the AU policy organs, not more than 10, and yet in Brussels, more than 3,000 civil society organizations engage with the European Union. We therefore need a critical mass of youth, women, private sector, etc. to advocate at the AU, ACHPR, NEPAD, Pan African Union. We need to identify the areas of excellence, establish a clear division of labor, and engage consistently and strategically. But we also need AU member states to engage with us all, openly and consistently.”</p>\n\n\n<p><br />\nThe head of a regional human rights organization said:<br /></p>\n\n\n<p>One of our lowest moments has been on Burundi, in 2015; Africa has successfully built a solid human rights system, with strong doctrine and jurisprudence, but when the Burundi crisis occurred, and followed with killings of protesters in December 2015, the Permanent Representatives Committee invoked Article 4 of the AU Constitutional act. That decision did not happen in a vacuum, it was built on AU’s precedent in South Sudan, including the first Commission of Inquiry instituted by the AU in the middle of a conflict – then the Heads of State decided to shut it down. It was literally like a slap to our face.</p>\n\n\n<p>A former ACHPR commissioner said:</p>\n\n\n<p>There are several areas that still need to be strengthened to create an environment truly conducive to the respect for human rights through effective implementation of ACHPR resolutions, recommendations, and decisions by the States Parties. The capacity of NGOs needs to be strengthened so that they can be focal points and effective messengers of the ACHPR’s work with populations on the ground.<br /><br />\nAnother challenge is the shortage of human and financial resources of the ACHPR, which undermines any effective interaction between NGOs and the ACHPR’s promotion and protection mandate, particularly in emerging fields such as climate change, digital rights, the weaponization of information, and terrorism.<br /><br />\nThe priority today is for AU member states to respect the independence of the Commission and implement its recommendations. We have seen increasing hostility of the deliberative bodies of the AU, whose decisions are likely to deconstruct, question, and weaken relations between the ACHPR and NGOs. We will never forget how in August 2018, following a decision by the AU Executive Council, the ACHPR withdrew the Coalition of African Lesbians’ (CAL) observer status. That’s an act that should never become a pattern. NGOs should develop an offensive and advocacy strategy including by highlighting the role of NGOs in the initiatives and programs of the AU.<br /><br />\nThe AU Ten-Year Human Rights Action Plan should be made more accessible and shared amongst NGOs in a more inclusive manner, to ensure their appropriate responses to the challenges and concerns.</p>\n\n\n<p><br />\nAn activist said:<br /></p>\n\n\n<p>A major current issue is the backlog of cases that are still pending before the ACHPR. The commissioners work part-time and have a small secretariat –they have little resources to follow through processes. The lack of adequate human resources is a serious problem.<br /><br />\nAnother challenge is that there is still little reporting by states. African governments should value their own institutions. It’s always sad to see the difference between the huge number of submissions before UN mechanisms compared to states’ reports before the African Commission. Finally, the Commission and the African court need to cooperate effectively to maintain their independence and protect their legacy for future generations.</p>\n\n\n<p><br />\nA female litigator said:</p>\n\n\n<p>Most importantly, AU leaders should cease trying to weaken the Commission by treating it as an AU organ, when it is a treaty-based body. This is why it must remain independent and respected by African leaders.</p>",
  "pubDate": "Wed, 02 Nov 2022 00:00:00 -0400",
  "dc:creator": "Human Rights Watch",
  "guid": "https://www.hrw.org/news/2022/11/02/african-rights-commissions-work-more-important-ever"
}