{
  "id": "tag:blogger.com,1999:blog-8878620400258430757.post-6900981545538753263",
  "published": "2019-08-18T18:57:00.000-07:00",
  "updated": "2019-08-19T11:35:37.937-07:00",
  "category": "",
  "title": "My Path to Google: Snehal Thorat, Campaign Manager",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\">Welcome to the 34th installment of our blog series “My Path to Google.” These are real stories from Googlers, interns, and alumni highlighting how they got to Google, what their roles are like, and even some tips on how to prepare for interviews.<br /><br />Today’s post is all about Campaign Manager, Snehal Thorat. Read on!<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-Kwb897lUr80/XVoBDPF7TDI/AAAAAAAAAoA/75qzvmon1sgyxgrVWnh8xk9tbSNr8mGOgCEwYBhgL/s1600/00100dPORTRAIT_00100_BURST20190409100905819_COVER-02-01.jpeg\" imageanchor=\"1\"><img border=\"0\" data-original-height=\"1600\" data-original-width=\"1200\" height=\"640\" src=\"https://1.bp.blogspot.com/-Kwb897lUr80/XVoBDPF7TDI/AAAAAAAAAoA/75qzvmon1sgyxgrVWnh8xk9tbSNr8mGOgCEwYBhgL/s640/00100dPORTRAIT_00100_BURST20190409100905819_COVER-02-01.jpeg\" width=\"480\" /></a></div><b>Can you tell us a bit about yourself and your path to Google?</b><br />Hello! I grew up in Pune, India and recently graduated from NMIMS, Mumbai, where I earned an MBA in marketing. I currently work as a Campaign Manager in our&nbsp;Hyderabad office.<br /><br />In my 2nd year, Google launched its Case Study Competition. Like others, I was extremely excited, as I wanted to learn more about the company, its various teams, and Google culture.<br /><br />The entire concept of the competition was very entrepreneurial. As part of the competition, we had to provide innovative solutions to critical business problems in the fields of hardware and digital marketing. The case my team was working on required us to provide a marketing and sales strategy to increase the sales of Google Pixel in India by 10x in the next 2-3 years.<br /><br />We worked on our idea for four long months. It was tough as well as enthralling. With the hard work we put in, as well as the guidance received from Google mentors and our institute professors,&nbsp; we won the competition. It was such a proud moment. After winning the competition, I interviewed with Google and here I am now.<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-bTHnG457pWU/XVoBCwNxklI/AAAAAAAAAn8/5z-nBe2Y078bWaa1b7mhYnV-80iEl2sTwCEwYBhgL/s1600/DSC_0377-01.jpeg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1329\" data-original-width=\"1600\" height=\"530\" src=\"https://1.bp.blogspot.com/-bTHnG457pWU/XVoBCwNxklI/AAAAAAAAAn8/5z-nBe2Y078bWaa1b7mhYnV-80iEl2sTwCEwYBhgL/s640/DSC_0377-01.jpeg\" width=\"640\" /></a></div><b>What’s your role at Google?&nbsp;</b><br />I am a Campaign Manager on the gTech Professional Services MediaOps (gPS MediaOps) team. I am responsible for managing the marketing objectives for some of Google's largest advertisers. I advise our clients on how our products can help grow their business and maximize returns on their marketing investment. Being able to work at such scale and drive growth across businesses is the most rewarding part of my work.<br /><b><br /></b><b>What inspires you to come in every day?</b><br />The googliest part of Google are the Googlers! It is gratifying to work with so many inspiring people — each with unique identities, backgrounds, and experiences. This makes the entire experience of working at Google extremely enthralling, as well as humbling.<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-7y3oKsFQ0mg/XVoBEEWhZQI/AAAAAAAAAoY/sg_DMHBc_HsBhRt8956D8X2_GOMweC5WwCEwYBhgL/s1600/IMG_20190403_185838_3-01.jpeg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1086\" data-original-width=\"1600\" height=\"434\" src=\"https://1.bp.blogspot.com/-7y3oKsFQ0mg/XVoBEEWhZQI/AAAAAAAAAoY/sg_DMHBc_HsBhRt8956D8X2_GOMweC5WwCEwYBhgL/s640/IMG_20190403_185838_3-01.jpeg\" width=\"640\" /></a></div><b>Can you tell us about your decision to enter the process?</b><br />As a student, Google as an org always inspired me. I have always been in awe of the interesting projects and products Google works on.<br /><br />In the final national round of the Google Case Study, each team was assigned a Googler mentor and ours was Anand Devsharma — he motivated us and made us believe in our idea. I learned a lot as an individual from him, and discovered that Google is the organization where I would love to be.<br /><b><br /></b><b>How did the interview process go for you?</b><br />The entire process was exciting. Interviewing with Google felt like an accomplishment in itself. For me, the entire process was conducted virtually. The excitement increased after each of the interview rounds. In total, three interviews were conducted.<br /><b><br /></b><b>What do you wish you’d known when you started the process?&nbsp;</b><br />Coming into the role of Campaign Manager straight out of college, I never thought I would have so much influence and responsibility so early on. I am grateful for this opportunity. Today I work with some of Google’s largest clients, who seek my advice on how they can remain successful and grow profitably.<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-PbjdBF6280U/XVoBD6aCK1I/AAAAAAAAAoQ/3sCyZhGQBMIXfylGK3GHbYIKfOTZCZBUQCEwYBhgL/s1600/IMG_20181221_170049.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1200\" data-original-width=\"1600\" height=\"480\" src=\"https://1.bp.blogspot.com/-PbjdBF6280U/XVoBD6aCK1I/AAAAAAAAAoQ/3sCyZhGQBMIXfylGK3GHbYIKfOTZCZBUQCEwYBhgL/s640/IMG_20181221_170049.jpg\" width=\"640\" /></a></div><b>Can you tell us about the resources you used to prepare for your interview or role?</b><br />There were two main resources I used - the job description itself and the Google Students Career website. It is essential to have complete clarity of the role one is interviewing for. I prepared in such a way that, for each skill and responsibility mentioned in the job description, I had references from my experiences of demonstrating those skills and responsibilities.<br /><b><br /></b><b>Do you have any tips you’d like to share with aspiring Googlers?</b><br />Never feel like anything is out of reach. Whether it was winning the competition or getting into Google, not once did I think that the goal was impossible. Work for things you are passionate about and lean into your strengths.<br /><br />I strongly believe in, and live by, the following words by Sundar Pichai, “It is important to follow your dreams and heart. Do something that excites you.”<br /><br /></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google Students",
    "uri": "http://www.blogger.com/profile/15517669815238556768",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 35
}