{
  "id": "https://bibleinoneyear.org/en/youth/24",
  "title": "Day 24: How to Listen to God",
  "description": "Proverbs 3:1–10, Genesis 47:31, 48:11–16, Matthew 16:21–25, 17:1–5.  We have the voices of family, friends and colleagues  And sometimes we have the voice of Satan tempting us to disbelieve God’s word and to doubt that God has our best interests at heart",
  "pubDate": "Mon, 24 Jan 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/24/",
  "itunes:duration": "12:52",
  "guid": "enyouth24012022-24",
  "length": 772.68,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 24: How to Listen to God",
  "itunes:subtitle": "Proverbs 3:1–10, Genesis 47:31, 48:11–16, Matthew 16:21–25, 17:1–5.  We have the voices of family, friends and colleagues  And sometimes we have the voice of Satan tempting us to disbelieve God’s word and to doubt that God has our best interests at heart",
  "itunes:summary": "Suppose I go to the doctor and say, ‘Doctor, I have a lot of problems: I twisted my knee... my eyes itch... my finger is swollen... I have backache...’ Then, having got through my list of complaints, I look at my watch and say, ‘Goodness me, time is getting on. I must be off.’ The doctor might say, ‘Hang on, do you not want to hear what I have to say?’\nIf we only speak to God and never take time to listen, we make the same mistake. We do all the talking and we don’t actually listen to him. But our relationship with God is meant to be a two-way conversation. When I’m praying, I find it helpful to write down thoughts that come into my mind that may come from the Spirit of God.\nIn a media-saturated age we have many voices that come to us on TV, radio, the Internet, Twitter, Facebook, Instagram, email and text message. We have the voices of family, friends and colleagues. And sometimes we have the voice of Satan tempting us to disbelieve God’s word and to doubt that God has our best interests at heart.\nHow do you hear the voice of God in the midst of the noise and distractions of life?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 389
}