{
  "id": "yt:video:sMnw28M-fMg",
  "yt:videoId": "sMnw28M-fMg",
  "yt:channelId": "UC9NuJImUbaSNKiwF2bdSfAw",
  "title": "Deterministic debugging with Delve And the state of Delve",
  "link": "",
  "author": {
    "name": "FOSDEM",
    "uri": "https://www.youtube.com/channel/UC9NuJImUbaSNKiwF2bdSfAw"
  },
  "published": "2020-11-19T13:05:14+00:00",
  "updated": "2022-01-12T18:29:08+00:00",
  "media:group": {
    "media:title": "Deterministic debugging with Delve And the state of Delve",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "by Derek Parker\n\nAt: FOSDEM 2020\nhttps://video.fosdem.org/2020/UB2.252A/debuggingwithdelve.webm\n\nIn this talk I will begin by delivering the \"State of Delve\" update. In similar fashion to the popular \"State of Go\" talk I will begin by discussing all of the exciting new features and changes that have happened over the past year, since last FOSDEM. Following that I will go into a live demo showcasing how Delve can leverage Mozilla RR in order to perform deterministic debugging. This talk will begin by introducing users to the concept of deterministic debugging and the power that comes with it. Following that I will launch into a demo showcasing how to leverage this concept to debug an otherwise unpredictable highly concurrent program. Users will walk away with immediate practical knowledge they can begin applying in their day to day debugging.\nIt's been a year since last FOSDEM and a lot has changed with Delve! I will discuss all the new features and changes that have been implemented in the last year.\n\n\nFollowing the \"State of Delve\" introduction, I will dig into how Delve can be utilized to perform deterministic debugging. This style of debugging enables users to record the execution of their process and \"play it back\" in a deterministic fashion in order to more quickly and efficiently perform root cause analysis on a bug that may otherwise be difficult to reproduce or track down. This section of the talk will begin by introducing the concept of deterministic debugging and why it is so useful and powerful. Once everyone is familiar with the concept I will launch into a live demo showcasing how to leverage this debugging approach to track down and fix a bug which is hard to reproduce and happens only intermittently.\n\n\nAttendees will walk away with practical knowledge that they can begin applying to their debugging problems immediately.\n\nRoom: UB2.252A (Lameere)\nScheduled start: 2020-02-02 11:00:00",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}