{
  "id": "yt:video:NXVJKPQu7rI",
  "yt:videoId": "NXVJKPQu7rI",
  "yt:channelId": "UCMm211NGh4Ls5SAMZJF7E8A",
  "title": "SM64 - Elevate for 8 Red Coins - 0.5x A Presses [OUTDATED]",
  "link": "",
  "author": {
    "name": "pannenkoek2012",
    "uri": "https://www.youtube.com/channel/UCMm211NGh4Ls5SAMZJF7E8A"
  },
  "published": "2015-07-18T15:23:27+00:00",
  "updated": "2022-06-10T12:55:04+00:00",
  "media:group": {
    "media:title": "SM64 - Elevate for 8 Red Coins - 0.5x A Presses [OUTDATED]",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "THIS VIDEO IS OUTDATED - SEE A BETTER VERSION OF THIS VIDEO HERE:\nhttps://youtu.be/lT3SnMMLY0w\n\nI collect the star Elevate for 8 Red Coins in Hazy Maze Cave using 0.5 A presses. The A press is to perform AB kicks on the rising elevators in order to maintain the hyper speed while going up.\n\nThis video is an improvement from my previous video in which I collected this star in 1 A press. You can find that video here: https://youtu.be/zQgBScffFXI. Since then, Tyler Kehne discovered that hyper speed walking could be performed in the underground lake in order to accumulate 1500+ speed [https://youtu.be/EX2CCKfXBpc]. Additionally, Plush collaborated with Sonicpacker to figure out how to bring hyper speed up an elevator without losing too much of it [https://youtu.be/4e6neRw-32E]. Expanding upon this, I figured out that by relocating the scuttlebug in the rolling rocks room, we could bounce on it to cross the gap back to the beginning area, and from there clip into the red coin room on the other side of the red wall [https://youtu.be/4ekMOxfn0bs]. And from there, it's it's history!\n\nSo how does hyper speed walking work? It involves a steep slope that descends into water. Normally, Mario wouldn't be able to stand on a slope this steep, but the shallow water gives the ground special properties that allows him to do so. Furthermore, if Mario tries to run uphill on this ground, he will end up running backwards at an increasingly fast rate. Usually, this walking can't be used to accumulate all that much speed, because (1) the slope runs out, (2) the slope connects to a wall at angle that isn't 90 degrees and so running backwards into it moves Mario either uphill or downhill, or (3) Mario gains too much speed and can no longer properly follow along the shallow water. Of course, all of this was already known. What wasn't known (and what Tyler discovered) was that the red wall stops Mario from moving while allowing his backwards speed to increase.\n\nIf you're wondering about the half A press, read this before commenting to ask why. I use a special notation that allows for half A presses. Specifically, if you enter a level already holding the A button, then that A press only counts as half. It's actually pretty important to distinguish between the A button being PRESSED and the A button being HELD. While pressing A allows Mario to execute several kinds of jumps, the holding of A allows Mario to swim in water, do little kicks up slopes, grab the owl, and twirl slowly. So if a star requires the A button to be held, the pressing of the A button could have been done at some point in the past, and just held until that moment. For instance, let's say there are two stars: one that requires the A button to be pressed (1x A presses), and another that only requires the A button to be held (0.5x A presses). Individually, these stars would both require a full A press. But if these stars were collected one after the other, then the A button could be pressed during the former, and held all the way through to the next star to be used in the latter. In this manner, these stars together would only use 1 A press, whereas they would take 2 A presses if done individually. So during a 120 star run, you would round these half A presses down, but on a star-by-star basis you would round them up.\n\nABC Playlist: https://www.youtube.com/playlist?list=PLmvvhlevqC2d6vis077yFHuLJHYtTtqe_\nABC Routes: https://docs.google.com/document/d/1ypRVVRyf4x-v8GqCSmKYnicrfKSIjao3Y1ZVl52RIyM/edit",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}