{
  "title": "Moving AdSense to a first-price auction",
  "link": "https://blog.google/products/adsense/our-move-to-a-first-price-auction/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>Creating great content takes time, but earning money from it shouldn’t. That’s why we built AdSense, to help you make money from your site with an easy-to-use advertising platform. AdSense simplifies advertising for you by automatically tailoring ads to your site’s layout, optimizing for mobile web and connecting you to millions of advertisers.</p><p>In our continued effort to simplify AdSense, we will be moving the AdSense (AdSense for Content, Video, and Games) auction from second-price to first-price in the coming months. This change will make it easier for buyers to purchase your ad space sold on AdSense. There is no action for you and you will likely not see a change in your earnings. We’re making this announcement now to help our advertiser partners prepare before we change how the AdSense auction works. View our <a href=\"https://support.google.com/adsense/answer/10858748#faqs\">FAQ page</a> for full details across the AdSense product range.</p><p><b>What’s happening:</b></p><p>In the early days of online display advertising, ad space was sold to advertisers in a second-price auction, where the final price paid by the winner was determined by the amount of the second-highest bid. Over time, many ad selling platforms in the display advertising ecosystem, including Google Ad Manager and Google AdMob, switched their auction to first-price. In a first-price auction, the final price reflects the winning bid. In the coming months, AdSense will move to a first-price auction. This will help advertisers by simplifying how they buy online ads and make it easier for them to buy your ad space sold on AdSense.</p><p><b>Benefits to publishers and advertisers:</b></p><p>By streamlining the auction model across AdSense, Ad Manager, and AdMob, we are aligning our process with other ad selling platforms in the display advertising ecosystem. We believe this will help grow advertiser spending confidence in digital advertising and an increase in spending confidence over time will benefit publishers (that's you).</p><p><b>Preparing for the change</b></p><p>We expect the transition to a first-price auction to be completed later this year. As we said above, you do not need to do anything, because these changes will update automatically.</p><p>For more information and future updates, please check out our AdSense first-price auction <a href=\"https://support.google.com/adsense/answer/10858748\">help page</a>.</p><p><br/></p></div></div></body></html>",
  "pubDate": "Thu, 07 Oct 2021 16:00:00 +0000",
  "guid": "https://blog.google/products/adsense/our-move-to-a-first-price-auction/",
  "category": "AdSense",
  "og": {
    "type": "article",
    "title": "Moving AdSense to a first-price auction",
    "description": "AdSense for Content is announcing the intention to move its auction to first price to simplify the ad selling and buying experience.",
    "site_name": "Google",
    "url": "https://blog.google/products/adsense/our-move-to-a-first-price-auction/"
  },
  "author": {
    "name": "Matt Wong",
    "title": "Product Manager",
    "department": "",
    "company": ""
  }
}