{
  "title": "Quantitative science is (indirectly) relevant to the real world, also some comments on a book called The Case Against Education",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/10/quantitative-science-is-indirectly-relevant-to-the-real-world-also-some-comments-on-the-case-against-education/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/10/quantitative-science-is-indirectly-relevant-to-the-real-world-also-some-comments-on-the-case-against-education/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Mon, 10 Oct 2022 13:49:49 +0000",
  "category": [
    "Economics",
    "Political Science",
    "Sociology"
  ],
  "guid": "https://statmodeling.stat.columbia.edu/?p=47181",
  "description": "Joe Campbell points to this post by economist Bryan Caplan, who writes: The most painful part of writing The Case Against Education was calculating the return to education. I spent fifteen months working on the spreadsheets. I came up with &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/10/quantitative-science-is-indirectly-relevant-to-the-real-world-also-some-comments-on-the-case-against-education/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>Joe Campbell points to <a href=\"https://www.econlib.org/no-one-cared-about-my-spreadsheets/\">this post</a> by economist Bryan Caplan, who writes:</p>\n<blockquote><p>The most painful part of writing The Case Against Education was calculating the return to education.  I spent fifteen months working on the spreadsheets.  I came up with the baseline case, did scores of “variations on a theme,”  noticed a small mistake or blind alley, then started over. . . .  About half a dozen friends gave up whole days of their lives to sit next to me while I gave them a guided tour of the reasoning behind my number-crunching. . . . When the book finally came out, I published final versions of all the spreadsheets . . . </p>\n<p>Now guess what?  Since the 2018 publication of The Case Against Education, precisely zero people have emailed me about those spreadsheets. . . . Don’t get me wrong; The Case Against Education drew plenty of criticism.  Almost none of it, however, was quantitative. . . .</p>\n<p>It’s hard to avoid a disheartening conclusion: Quantitative social science is barely relevant in the real world – and almost every social scientist covertly agrees.  The complex math that researchers use is disposable.   You deploy it to get a publication, then move on with your career.  When it comes time to give policy advice, the math is AWOL.  If you’re lucky, researchers default to common sense.  Otherwise, they go with their ideology and status-quo bias, using the latest prestigious papers as fig leaves.</p></blockquote>\n<p>Regarding the specifics, I suspect that commenter Andrew (no relation) has a point when he <a href=\"https://www.econlib.org/no-one-cared-about-my-spreadsheets/#comment-291132\">responded</a>:</p>\n<blockquote><p>You didn’t waste your time. If you had made your arguments without the spreadsheets&#8212;just guesstimating &#038; eyeballing, you would’ve gotten quantitative criticism. A man who successfully deters burglars didn’t waste his money on a security system just because it never got used.</p></blockquote>\n<p>But then there&#8217;s the general question about quantitative social science.  I actually wrote a post on this topic last year, <a href=\"https://statmodeling.stat.columbia.edu/2021/03/12/the-social-sciences-are-useless-so-why-do-we-study-them-heres-a-good-reason/\">The social sciences are useless. So why do we study them? Here’s a good reason</a>.  Here was my summary:</p>\n<blockquote><p>The utilitarian motivation for the natural sciences is that can make us healthier, happier, and more comfortable. The utilitarian motivation for the social sciences is they can protect us from bad social-science reasoning. It’s a lesser thing, but that’s what we’ve got, and it’s not nothing.</p></blockquote>\n<p>That post stirred some people up, as it sounded like I was making some techbro-type argument that society didn&#8217;t matter.  But I wasn&#8217;t saying that <em>society</em> was useless, I was saying that <em>social science</em> was useless, at least relative to the natural sciences.  Some social science research is really cool, but it&#8217;s nothing compared to natural-science breakthroughs such as transistors, plastics, vaccines, etc.</p>\n<p>Anyway, my point is that quantitative social science has value in that it can displace empty default social science arguments.  Caplan is disappointed that people didn&#8217;t engage with his spreadsheets, but I think that&#8217;s partly because he was presenting his ideas in book form.  My colleagues and I had a similar experience with our Red State Blue State book a few years ago:  our general point got out there, but people didn&#8217;t seem to really engage with the details.  We had lots of quantitative analyses in there, but it was a book, so people weren&#8217;t expecting to engage in that way.  Frustrating, but it would be a mistake to generalize from that experience to all of social science.  If you want people to engage with your spreadsheets, I think you&#8217;re better off publishing an article rather than a book.</p>\n<p>As a separate matter, Caplan&#8217;s &#8220;move on with your career&#8221; statement is all too true, but that&#8217;s a separate issue.  Biology, physics, electrical engineering, etc., are all undeniably useful, but researchers in these fields also move on with their careers, etc.  That just is telling us that research doesn&#8217;t have 100% efficiency, which is a product of the decentralized system that we have.  It&#8217;s not like WW2 where the government was assigning people to projects.</p>\n<p><strong>Comments on The Case Against Education</strong></p>\n<p>This discussion reminded me that six years ago Caplan sent me a draft of his book, and I sent him comments.  I might as well share them here:</p>\n<blockquote><p>1.  Your intro is fine, it’s good to tell the reader where you’re coming from.  But . . . the way it’s framed, it looks a bit like the “professors are pampered” attack on higher education.  I don’t think this is the tack you want to be taking, for two reasons:  First, most teaching jobs are not like yours:  most teaching jobs are at the elementary or secondary level, and even at the college level, much of the teaching is done by adjuncts.  So, while your presentation of _your_ experience is valid, it’s misleading if it is taken as a description of the education system in general.  Second—and I know you’re aware of this too—if education were useful, there’d be no good reason to complain that some of its practitioners have good working conditions.  Again, this does not affect your main argument but I think you want to avoid sounding like the proudly-overpaid guy discussed here:  http://andrewgelman.com/2011/06/01/the_cushy_life/</p>\n<p>This comes up again in your next chapter where you say you have very few skills and that “The stereotype of the head-in-the-clouds Ivory Tower professor is funny because it’s true.”  Ummm, I don’t know about that.  The stereotype of the head-in-the-clouds Ivory Tower professor is not so true, in the statistical sense.  The better stereotype might be that adjunct working 5 jobs.</p>\n<p>2.  You write, “Junior high and high schools add higher mathematics, classic literature, and foreign languages – vital for a handful of budding scientists, authors, and translators, irrelevant for everyone else.”  This seems pretty extreme.  One point of teaching math—even the “higher mathematics” that is taught in high school—is to give people the opportunity to find out that they are “budding scientists” or even budding accountants.  As to “authors,” millions of people are authors:  you’ve heard of blogs, right?  It can useful to understand how sentences, paragraphs, and chapters are put together, even if you’re not planning to be Joyce Carol Oates.  As to foreign languages:  millions of people speak multiple languages, it’s a way of understand the world that I think is very valuable.  If _you_ want to say that you’re happy only speaking one language, or that many other people are happy speaking just one language, that’s fine—but I think it’s a real plus to give kids the opportunity to learn to speak and read in other languages.  Now, at this point you might argue that most education in math, literature, and foreign language is crappy—that’s a case you can make, but I think you’re way overdoing it my minimizing the value of these subjects.</p>\n<p>3.  Regarding signaling:  Suppose I take a biology course at a good college and get an A, but I don’t go into biology.  Still, the A contributes to my GPA and to my graduation from the good college, which is a job signal.  You might count this as part of the one-third signaling.  But that would be a mistake!  You’re engaging in retrospective reasoning.  Even if I never use that biology in my life, I didn’t know that when took the course.  Taking that bio course was an investment.  I invest the time and effort to learn some biology in order to decide whether to do more of it.  And even if I don’t become a biologist I might end up working in some area that uses biology.  I won’t know ahead of time.  This is not a new idea, it’s the general principle of a “well-rounded education,” which is popular in the U.S. (maybe not so much in Europe, where their post-secondary education is more focused on a student’s major.)  Also relevant on this “signaling” point is this comment:  http://andrewgelman.com/2011/02/17/credentialism_a/#comment-58035</p>\n<p>4.  Also, signaling is complicated and even non-monotonic!  Consider this example (which I wrote up here:  http://andrewgelman.com/2011/02/17/credentialism_a/):<br />\n&#8220;My senior year I applied to some grad schools (in physics and in statistics) and to some jobs. I got into all the grad schools and got zero job interviews. Not just zero jobs. Zero interviews. And these were not at McKinsey, Goldman Sachs, etc. (none of which I’d heard of). They were places like TRW, etc. The kind of places that were interviewing MIT physics grads (which is how I thought of applying for these jobs in the first place). And after all, what could a company like that do with a kid with perfect physics grades from MIT? Probably not enough of a conformist, eh?”<br />\nThis is not to say your signaling story is wrong, just that I think it’s much more complicated than you’re portraying.</p>\n<p>5.  This is a minor point, but you write, “If the point of education is certifying the quality of labor, society would be better off if we all got less.”  This is not so clear.  From psychometric principles, more information will allow better discrimination.  It’s naive to think of all students as being ranked on a single dimension so that employers just need to pick from the “top third.”  There are many dimensions of abilities and it could take a lot of courses at different levels to make the necessary distinctions.  Again, this isn’t central to your argument but you just have to be careful here because you’re saying something that’s not quite correct, statistically speaking.</p>\n<p>6.  You write, &#8220;Consider the typical high school curriculum. English is the international language of business, but American high school students spend years studying Spanish, or even French. During English, many students spend more time deciphering the archaic language of Shakespeare than practicing business writing. Few jobs require knowledge of higher mathematics, but over 80% of high school grads suffer through geometry.”  I think all these topics could be taught better, but my real issue here is that this argument contradicts what you said back on page 6, that you were <em>not</em> going to just “complain we aren’t spending our money in the right way.”</p>\n<p>To put it another way:  </p>\n<p>7.  You write, “The Ivory Tower ignores the real world.”  I think you need to define your terms.  Is “Ivory Tower” all of education?  All college education?  All education at certain departments at certain colleges?  Lots of teachers of economics are engaged with the real world, no?  Actually it’s not so clear to me what you mean by the real world.  I guess it does not include the world of teaching and learning.  So what parts of the economy do count as real?  I’m not saying you can’t make a point here, but I think you need to define your terms in some way to keep your statements from being meaningless!</p>\n<p>And a couple things you didn’t talk about in your book, but I think you should:</p>\n<p>&#8211; Side effects of Big Education:  Big Ed provides jobs for a bunch of politically left-wing profs and grad students, it also gives them influence.  For example, Paul Krugman without the existence of a big economics educational establishment would, presumably, not be as influential as the actual Paul Krugman.  One could say the same thing about, say, Greg Mankiw, but the point is that academia as a whole, and prestigious academia in particular, contains lots more liberal Krugmans than conservative Mankiws.  Setting aside one’s personal political preferences, one might consider this side effect of Big Ed to be bad (in that it biases the political system) or good (in that it provides a counterweight to the unavoidable conservative biases of Big Business) or neutral.  Another side effect of Big Ed is powerful teachers unions.  Which, once again, could be considered a plus, a minus, or neutral, depending on your political perspective.  Yet another side effect of Big Ed is that it funds various things associated with schools, such as high school sports (they’re a big deal in Texas, or so I’ve heard!), college sports, and research in areas ranging from Shakespeare to statistics.  Again, one can think of these extracurricular activities as a net benefit, a net cost, or a washout.</p>\n<p>In any case, I think much of the debate over the <em>value</em> of education and the <em>structuring</em> of education is driven by attitudes toward its side effects.  This is not something you discuss in your book but I think it’s worth mentioning.  Where <em>you </em>stand on the side effects can well affect your attitude toward the efficacy of the education establishment.  There’s a political dimension here.  You’re a forthright guy and I think your book will be strengthened if you openly acknowledge the political dimension rather than leaving it implicit.</p></blockquote>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/10/quantitative-science-is-indirectly-relevant-to-the-real-world-also-some-comments-on-the-case-against-education/feed/",
  "slash:comments": 92
}