{
  "id": "yt:video:5JK-0nlbM7k",
  "yt:videoId": "5JK-0nlbM7k",
  "yt:channelId": "UCZRoNJu1OszFqABP8AuJIuw",
  "title": "How Everyday People Have Been Scamming Amazon For Billions",
  "link": "",
  "author": {
    "name": "Logically Answered",
    "uri": "https://www.youtube.com/channel/UCZRoNJu1OszFqABP8AuJIuw"
  },
  "published": "2022-10-31T19:00:02+00:00",
  "updated": "2022-11-05T23:23:29+00:00",
  "media:group": {
    "media:title": "How Everyday People Have Been Scamming Amazon For Billions",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The idea that Amazon has been ripping off its employees has been a popular concept for a long time. Amazon employees are often worked to the bone and paid minimal wages. Not to mention, drivers often have to pee in bottles, and managers squash unions before they even appear. But, have you ever heard of the idea of everyday people scamming Amazon? For years, people have been buying products on Amazon just to claim that they didn’t receive them or return a fake version of the product so that they can get a full refund. While simple, in theory, this is not a small scam by any means. On average, 5 to 15% of Amazon purchases are returned out of which 10% are fraudulent returns. This means that roughly 1% of all purchases on Amazon end up with fraudulent returns. And given that Amazon receives hundreds of billions of dollars worth of sales every year, this scam costs Amazon billions every single year. This video explains the mechanics of the Amazon return scam and how this scam is spreading to other companies and industries as well.\n\nDiscord Community: \nhttps://discord.gg/SJUNWNt\n\nTimestamps:\n0:00 - Scamming Amazon\n1:54 - Return Scam Explained\n4:57 - This Is Messed Up\n9:46 - A Spreading Parasite\n\nThumbnail Credit:\nAlex Wong - Getty Images\nhttps://bit.ly/3FuMkIT\n\nResources:\nhttps://pastebin.com/PgaVq5ug",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}