{
  "id": "yt:video:kC6U900CvwY",
  "yt:videoId": "kC6U900CvwY",
  "yt:channelId": "UCP3alkHEJhoxTpy3iVON-lg",
  "title": "How to Succeed at Physics Without Really Trying",
  "link": "",
  "author": {
    "name": "Physics with Elliot",
    "uri": "https://www.youtube.com/channel/UCP3alkHEJhoxTpy3iVON-lg"
  },
  "published": "2021-12-22T22:11:32+00:00",
  "updated": "2022-09-28T00:15:49+00:00",
  "media:group": {
    "media:title": "How to Succeed at Physics Without Really Trying",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Units are your physics superpower! With dimensional analysis, you can get 90% of the way to the answer for many physics problems with next to no work! Get the notes for free here: https://courses.physicswithelliot.com/notes-sign-up\n\nIn any given physics problem, you have a certain list of parameters at your disposal: masses, charges, lengths, and so on, and fundamental constants like G and c. And you're looking for an answer with some particular units. Dimensional analysis is a strategy to figure out how you can combine the given parameters to get the correct units of the answer you want. And often times this approach can get you 90% of the answer with minimal effort. I'll show you how to apply it to three very different problems: the period of a pendulum, the binding energy of a hydrogen atom, and the event horizon radius of a black hole.\n\nGet the links here: https://www.physicswithelliot.com/dimensional-analysis-help-room\n\nMore about the pendulum period: https://youtu.be/NvOvmgHSFx0\n\nHow to catch your own mistakes by checking units: https://youtu.be/iDVaoU8MmVw\n\nAll about pendulums: https://youtu.be/0q0L7Fj4dk8\n\nTutoring inquiries: https://www.physicswithelliot.com/tutoring\n\nIf you find the content I’m creating valuable and would like to help make it possible for me to continue sharing more, please consider supporting me! You can make a recurring contribution at https://www.Patreon.com/PhysicsWithElliot, or make a one time contribution at https://www.physicswithelliot.com/support-me. Thank you so much!\n\nAbout physics help room videos:\nThese are intro-level physics videos aimed at students taking their first physics classes. In each video, I'll teach you the fundamentals of a particular physics topic you're likely to meet in your first classes on mechanics and electromagnetism.\n\nAbout me:\nI’m Dr. Elliot Schneider. I love physics, and I want to help others learn (and learn to love) physics, too. Whether you’re a beginner just starting out with your physics studies, a more advanced student, or a lifelong learner, I hope you’ll find resources here that enable you to deepen your understanding of the laws of nature. For more cool physics stuff, visit me at https://www.physicswithelliot.com.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}