{
  "title": "Tell Us How Religious Organizations in Your Area Involve Themselves in Elections",
  "link": "https://www.propublica.org/getinvolved/religious-organizations-elections-johnson-amendment",
  "pubDate": "Sun, 30 Oct 2022 05:59:00 -0400",
  "guid": "https://www.propublica.org/getinvolved/religious-organizations-elections-johnson-amendment",
  "description": "\n                <p class=\"byline\">\n                by <a class=\"name\" href=\"https://www.propublica.org/people/jessica-priest\">Jessica Priest</a> and <a class=\"name\" href=\"https://www.propublica.org/people/jeremy-schwartz\">Jeremy Schwartz</a>                </p>\n                                          \n\n        \n\t<p data-pp-blocktype=\"copy\" data-pp-id=\"1.0\">Under federal law, churches and other nonprofit organizations are prohibited from electioneering.</p>\n            \n\t<p data-pp-blocktype=\"copy\" data-pp-id=\"2.0\">The Johnson Amendment, a 1954 congressional measure, bans tax-exempt organizations from interfering directly or indirectly in a political campaign on behalf of or in opposition to a candidate. Violators risk having their tax-exempt status revoked by the IRS.</p>\n            \n\t<p data-pp-blocktype=\"copy\" data-pp-id=\"3.0\">ProPublica and the Texas Tribune want to understand how the amendment is enforced — or isn’t. That’s where you come in: <strong>We can’t be everywhere, so we need your help identifying violations and understanding the government’s response to them.</strong></p>\n            \n\t<p data-pp-blocktype=\"copy\" data-pp-id=\"4.0\">What does a Johnson Amendment violation look like? The IRS says pastors endorsing candidates from the pulpit is “clearly prohibited,” but other situations are less clear. Please send us examples of any political activity you see at churches or other religious organizations, and we’ll look into whether it breaks the rules. These could include, but are not limited to:</p>\n            \n\t<ul>\n<li>Criticizing or praising candidates, politicians or political parties during a religious sermon or function.</li>\n<li>Helping a candidate raise funds.</li>\n<li>Sharing campaign literature or posting signs.</li>\n<li>Publishing a voter guide.</li>\n<li>Hosting candidates.</li>\n</ul>\n</p>\n            \n\t<p data-pp-blocktype=\"copy\" data-pp-id=\"6.0\">We know that some people think religious institutions should be more involved in politics. No matter what you believe, we want to hear about examples across the political spectrum. </p>\n\t\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.1\">You don’t have to belong to a congregation to participate. If you’re a ProPublica or Texas Tribune reader, we’d love your help.</p>\n            \n\t<p data-pp-blocktype=\"copy\" data-pp-id=\"7.0\"><strong>A note about our commitment to your privacy:</strong> We appreciate you sharing your story, and we take your privacy seriously. We are gathering this information for the purposes of our reporting, and we will not publish your name or information without your consent.</p>\n                                   ",
  "dc:subject": "Politics",
  "dc:date": "2022-10-30T05:59:00-04:00",
  "dc:creator": "by Jessica Priest and Jeremy Schwartz"
}