{
  "title": "Chinese Whispers: reinventing the Chinese language",
  "link": "https://audioboom.com/posts/8060309",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2747,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>After defeat in the Second Opium War, Chinese intellectuals wracked their minds for how the Chinese nation can survive in the new industrialised world. It’s a topic that has been discussed on this podcast before – listeners may remember the <a href=\"https://www.spectator.co.uk/podcast/what-is-it-to-be-chinese-\">episode with Bill Hayton</a>, author of <em>The Invention of China</em>, where we discussed the reformers and revolutionaries like Liang Qichao and Kang Youwei. But for some reformers, the problem with China wasn’t just feudal politics or Confucian staleness, but its ancient language.<br>\n<br>\n\n</div>\n<div>Spoken Chinese could be any of a vast number of regional dialects which were too often mutually unintelligible. Meanwhile, written Chinese was extremely complicated, not helping the rock bottom literacy rates of the common people (30 per cent for men and 2 per cent for women). Literary and official writing were also uniformly written in 'classical Chinese', a concise poetic form of the language which was not the way that people spoke (the vernacular). The difference can be thought of as the difference between Latin and English pre-Reformation. Of even more concern was the fact that Chinese wasn’t easily adaptable to the new communication technologies that were revolutionising the world at the time, like telegraphy and typewriters (above, a picture of a 1986 model of the Chinese typewriter). These western-invented methods were based on alphabetic languages – which Chinese simply isn't.<br>\n<br>\n\n</div>\n<div>Earlier this year, I <a href=\"https://www.spectator.co.uk/article/the-great-chinese-puzzle-how-to-adapt-the-language-to-modern-communication-technologies\">reviewed</a> <em>Kingdom of Characters</em>, the new book from Jing Tsu, who is Professor of East Asian Languages and Literatures at Yale. Jing’s book is an excellent account of the efforts to simplify, modernise and adapt this ancient language from Chinese and westerners alike. She joins me on this episode to talk through all of the problems outlined briefly here, and how a series of reformers, politicians and linguists throughout the 20th century tried to resolve these problems – sometimes with solutions nothing short of extraordinary. Of her mission, Jing says: 'I wanted to put a western reader in the shoes of these adorable, curmudgeonly, hard to take but utterly human Chinese characters'.<br>\n<br>\n\n</div>\n<div>We discuss the different upbringings we had – me in the People's Republic of China and Jing in the Republic of China (Taiwan) – and how that impacts our relationship to the traditional and simplified versions of the Chinese script and how important that script is to the Chinese national identity. We talk about the incredible and often positive influence westerners had on this language revolution (a narrative to do with that century of humiliation I didn't hear much about in a traditional Chinese upbringing). And explore whether Chinese could ever be the <em>lingua franca </em>that English is. </div>\n",
  "pubDate": "Mon, 04 Apr 2022 16:02:25 +0000",
  "guid": "tag:audioboom.com,2022-04-04:/posts/8060309",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}