{
  "title": "2018 DSB Tutorial (&#034;Kernel&#034;) Winners Announced",
  "link": "https://datasciencebowl.com/2018tutorialwinners/",
  "dc:creator": "admin",
  "pubDate": "Tue, 17 Apr 2018 19:30:42 +0000",
  "category": "Data Science",
  "guid": "https://datasciencebowl.com/2018_close-copy/",
  "description": "<p>The Data Science Bowl has made a truly impressive and positive impact using data science for social good. Participating in the challenge is an extraordinary opportunity to apply strategy and skills, gain new ones and fully embrace being a part of the analytics community. Data Science Bowl presenters, Booz Allen Hamilton and Kaggle, are pleased [...]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://datasciencebowl.com/2018tutorialwinners/\">2018 DSB Tutorial (\"Kernel\") Winners Announced</a> appeared first on <a rel=\"nofollow\" href=\"https://datasciencebowl.com\">The Data Science Bowl</a>.</p>\n",
  "content:encoded": "<p>The Data Science Bowl has made a truly impressive and positive impact using data science for social good. Participating in the challenge is an extraordinary opportunity to apply strategy and skills, gain new ones and fully embrace being a part of the analytics community.</p>\n<p>Data Science Bowl presenters, Booz Allen Hamilton and Kaggle, are pleased to recognize the Top 3 voted on Tutorials &#8211; known as &#8220;Kernels&#8221; within the Kaggle competition platform. This recognition was based on the community’s response to posted Kernels during the 2018 Data Science Bowl competition. Prize packs will be awarded to:</p>\n<ol>\n<li><a href=\"https://www.kaggle.com/keegil/keras-u-net-starter-lb-0-277?scriptVersionId=2164855\">Keras U-Net starter tutorial</a> by Kjetil Amdal-Saevik with 739 upvotes</li>\n<li><a href=\"https://www.kaggle.com/stkbailey/teaching-notebook-for-total-imaging-newbies\">Teaching notebook for total imaging newbies tutorial</a> by Stephen Bailey with 354 upvotes</li>\n<li><a href=\"https://www.kaggle.com/kmader/nuclei-overview-to-submission\">Nuclei overview to submission tutorial</a> by Kevin Mader with 240 upvotes</li>\n</ol>\n<p>Congratulations to each of our winners! You truly embraced the spirit of the competition and we thank each of you for helping us to advance the art of data science.<br />\nKaggle will reach out to each of our winners privately about next steps for claiming their prize pack.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://datasciencebowl.com/2018tutorialwinners/\">2018 DSB Tutorial (\"Kernel\") Winners Announced</a> appeared first on <a rel=\"nofollow\" href=\"https://datasciencebowl.com\">The Data Science Bowl</a>.</p>\n"
}