{
  "title": "S1E33 - How to Keep Moving Forward in Uncertain Times with Our Host, Laura Wilkinson",
  "guid": "https://pinecast.com/guid/78d51219-993c-4d4e-8013-c06c1b9c6492",
  "pubDate": "Tue, 09 Feb 2021 07:30:00 -0000",
  "itunes:duration": "00:24:05",
  "description": "<p>Today’s episode is a little different as Laura doesn’t interview a guest, but instead addresses head-on an issue that is impacting athletes throughout the world. There is a sense of weariness and exhaustion that Laura is observing in many athletes as they deal with postponements, cancellations, and what feels like an eternal holding pattern in their lives as this pandemic drags on. With her vast amount of experience, Laura possesses a great deal of wisdom and she shares it here today to help you navigate these ever changing circumstances and continue moving forward to achieve the goals you have set for yourself.\n \nShe starts by sharing her own recent history and current situation, reviewing the pandemic’s impact upon herself and other athletes, and explaining what it means to train with a moving target as well as how to accomplish it. Laura also stresses the importance of staying in the moment, looking at this unusual time as one of life’s precious opportunities, and offers a stirring analysis of the greatest gift you can give yourself. Laura sugarcoats nothing in today’s episode, demonstrating that life is filled with difficult patches to navigate, that it is up to us to decide who we want to be as we face these difficulties, and also passionately reinforcing the fact that we do, indeed, have the potential to not only get through all this but to thrive in the process.</p>\n<p>Episode Highlights:\n \n·   Laura’s recent history and current situation\n·   The pandemic’s impact on athletes\n·   Training with a moving target\n·   Staying in the moment\n·   This precious opportunity\n·   ‘Cool Runnings’\n·   The greatest gift you can give yourself\n·   Who do you want to be?</p>\n<p>Quotes:\n \n“I actually have a nice titanium plate and 6 screws in my neck now.”\n \n“It was devastating to so many athletes on different levels.”\n \n“Now there’s pretty much nothing on our schedule until the Olympic trials in June.”\n \n“Even though the target may be shifting and moving around, you’re aiming for that bullseye, and that has not changed.”\n \n“We are going to have to adapt.”\n \n“You are capable of getting through this and thriving.”\n \n“You could handle anything as long as you stayed in the moment and gave it everything that you had.”\n \n“They get back up and try again.”\n \n“Instant gratification is actually not normal.”\n \n“If it’s important to you, it is worth fighting for in that long term.”\n \n“We need to remember that there’s so much more that goes on than just what we’re seeing in that little clip.”\n \n“A gold medal is a wonderful thing, but if you’re not enough without one, you’ll never be enough with one.”\n \n“Those moments magnify your character for better or for worse.”\n \n“I have not only won all those things, I have failed miserably at all of those events as well.”\n \n“I choose to be a champion both in character and in integrity.”\n \n“If I may lose, let me stand by the road and cheer as the winners go by.”\n \n“What can you do right now in this moment to the very best of your ability to help you continue working toward that goal?”\n \n“It will give you peace.”</p>\n<p>Links:\nThe Pursuit of Gold homepage:  <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a> \n5 Smart Strategies to Confidence:   <a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">https://www.laurawilkinson.com/learn </a>\nLaura’s Social Media:\n       Instagram:   <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">https://www.instagram.com/lala_the_diver</a>  \n       Facebook:   <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">https://www.facebook.com/TheLauraWilkinson</a> </p>\n<p>References:</p>\n<p><a href=\"https://www.laurawilkinson.com/podcast-episodes/how-to-be-resilient-through-adversity-improve-performance-with-dr-ben-houltberg\" rel=\"nofollow\">Episode 27 with Dr. Ben Houltberg</a></p>",
  "itunes:title": "How to Keep Moving Forward in Uncertain Times with Our Host, Laura Wilkinson",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 33
}