{
  "title": "How Wayfair partnered with Google Cloud to upskill their engineers",
  "link": "https://cloud.google.com/blog/topics/training-certifications/wayfair-upskill-their-team-with-google-cloud-training-programs/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>Over the past ten years, Wayfair, an online furniture and home goods retailer, experienced exceptional growth, with online shoppers engagement (i.e., website, app). This surge in traffic and revenue generation  was supported by the decision to engage Google Cloud services. About 4 years ago, Wayfair realized the need for increased elasticity to handle traffic spikes, yet also recognized that the solution needed to be cost-effective. The strategy included removing Wayfair Storefront systems from existing private data centers– already proven to be expensive to scale, and included sustained risk of under-provisioning for traffic spikes—to move those complex systems to the public cloud. Wayfair chose Google Cloud Customer Experience services, due to its comprehensive capabilities including simplicity, high performance, and scalability. </p><p>Beginning with the successful migration of their image processor to the cloud, Wayfair’s confidence grew in their decision to move all of their data centers to Google Cloud. This required migration of all infrastructure, apps, machine learning (ML) platforms, and data science development platforms to the cloud, while ensuring minimal to no disruption to day-to-day business operations. The scale of this business transformation surfaced another essential need to perform an enterprise-wide, upskilling initiative for aligned teams including ML engineers, data engineers, and application developers to assure the highest productivity as teams were brought up-to-speed on the latest cloud technologies and processes.  Wayfair decided to partner with two pillars of the Google Cloud Customer Experience, Google Cloud Learning and Google Customer Care, to collaboratively tackle their business challenges and assure transformation success. </p><p>With proactive planning and guidance from Google Cloud Learning services, Wayfair built an interactive, hybrid educational program that included weekly one-hour “virtual study halls” and quizzes, a live chat group, and leaderboards to help motivate learners. Instructor-led training was also intentionally woven into the program to ensure that teams were on track with the transformation scheduled. As well, the program was built to optimize the variety of learning patterns with prizes awarded to participants who passed exams and won quizzes.</p><p>With Google Cloud Customer Care, Wayfair leaders were able to navigate their new cloud platform with confidence, and modernize tools to cope with the fluctuating demands of their customers. <a href=\"http://cloud.google.com/support/docs/premium\">Premium Support</a>, the selected tier of Customer Care, delivered a team of Technical Account Managers (TAMs) who proactively activated support tools in the early stages of the migration process. This enabled the very same ML Engineers, data engineers and app developers, who were in the Google Cloud Learning services to appropriately place their time and focus on core-business initiatives, while participating in cloud training which encouraged innovation and drove higher performance and productivity. TAMs continue to support Wayfair’s ongoing operational health, including during peak online events and providing deep technical expertise as technical issues arise. They also play a critical role in the delivery and progression of the Google Cloud Learning services by serving as subject-matter-experts (SMEs) to guide, answer questions, and provide best practices and strategies for successful certification to participants.</p><p>With Google Cloud Customer Experience services, Wayfair employees successfully completed two, 12-week training programs for Professional Cloud Architect with more than 75 participants per cohort engaged. In addition, a Cloud Hero training event for infrastructure, and a professional data engineering pilot were completed with 15 participants motivated to complete their certification exams.  As a result of the collaborative learning programs, Wayfair has more than 100 certified employees, and has achieved consistent year-over-year growth in cloud skills.  Wayfair employees shared feedback with Google Cloud which was leveraged to establish a new community of practice, where participants are enabled to team with Google Cloud to learn and study for certification exams.</p></div></div><div class=\"block-pull_quote\"><div class=\"uni-pull-quote h-c-page\"><section class=\"h-c-grid\"><div class=\"uni-pull-quote__wrapper h-c-grid__col h-c-grid__col--8 h-c-grid__col-m--6 h-c-grid__col-l--6 h-c-grid__col--offset-2 h-c-grid__col-m--offset-3 h-c-grid__col-l--offset-3\"><div class=\"uni-pull-quote__inner-wrapper h-c-copy h-c-copy\"><q class=\"uni-pull-quote__text\">The training partnership we have with Google Cloud enabled hundreds of Wayfairians to build cloud native skills. This has been instrumental in our successful cloud migration and transformational efforts.</q> <cite class=\"uni-pull-quote__author\"><span class=\"uni-pull-quote__author-meta\"><strong class=\"h-u-font-weight-medium\">Jordan Chernev, Head of Cloud Infrastructure, Wayfair</strong><br/></span></cite></div></div></section></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p>Building on these tangible successes, Wayfair and Google Cloud Customer Experience launched their first Associate Cloud Engineer cohort, and are preparing to introduce another cohort focused on Professional Machine Learning during the fourth quarter of 2022. A more targeted approach developed in collaboration with Wayfair enabled specific cohorts to learn directly from Google Cloud AI and ML engineers via the <a href=\"https://cloud.google.com/asl\">Advanced Solutions Lab</a>. A team of ten Wayfair data scientists worked side by side with Google ML Solutions Engineers to gain hands-on training and deep-dive on ML topics with a focus to improve their engineering and data scientist best practices. This training engagement culminated with capstone project results, where four, real-world Wayfair use cases were tackled incorporating topics and tools like BigQuery ML, Kubeflow pipelines, NLP, Vertex AI, Explainable AI, and image generation to enable the creation of practical solutions and working prototypes that could immediately be implemented to better inform decision-making for Wayfair business owners and internal data science teams.</p><p>Wayfair has always had a focus to empower their employees, so they fully embraced this opportunity to further develop their employees’ expertise and technical competencies with Google Cloud. The partnership with Google Cloud Learning services and Customer Care helped equip their employees with the advanced skills needed to continue their transformative ecommerce journey, while maintaining a high quality of online services with commitment to relentless customer satisfaction.</p><p>To learn more about how Google Cloud Customer Experience services can support your organization’s business imperatives, visit:</p><ul><li><p> <a href=\"https://services.google.com/fh/files/misc/2022_ps_one-pager.pdf\" target=\"_blank\">Google Cloud Premium Support</a> to empower business innovation with expert-led technical guidance and support</p></li><li> <a href=\"https://cloud.google.com/training/\">Google Cloud Training &amp; Certification</a> to expand and diversify your team’s cloud education</li></ul></div></div></body></html>",
  "pubDate": "Thu, 03 Nov 2022 16:00:00 -0000",
  "guid": "https://cloud.google.com/blog/topics/training-certifications/wayfair-upskill-their-team-with-google-cloud-training-programs/",
  "category": "Training and Certifications",
  "media:content": "",
  "og": {
    "type": "article",
    "title": "How Wayfair partnered with Google Cloud to upskill their engineers",
    "description": "Wayfair partner with Google Cloud to develop an innovative education and skilling program that motivates employees to take ownership of their own learning experience.",
    "image": "https://storage.googleapis.com/gweb-cloudblog-publish/images/wayfair_Z2FDawK.max-600x600.jpg",
    "site_name": "Google",
    "url": "https://cloud.google.com/blog/topics/training-certifications/wayfair-upskill-their-team-with-google-cloud-training-programs/"
  },
  "author": {
    "name": "Maribeth Baldassarri",
    "title": "Cloud Customer Experience Account Lead, Google Cloud",
    "department": "",
    "company": ""
  }
}