{
  "title": "Compensating Blood and Organ Donors with Mario Macis",
  "pubDate": "Mon, 13 Aug 2018 18:39:08 +0000",
  "guid": "3999f5ca9047408fadeaa04712e02248",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP102Macis_EDR.mp3",
  "itunes:image": "",
  "description": "<p>My guest today, <a href=\"https://sites.google.com/site/mmacis/\" target=\"_blank\" rel=\"noopener\">Mario Macis</a> of Johns Hopkins University, has done a number of interesting studies related to blood and organ donation, particularly the compensation of blood and organ donors. For instance, Mario and his coauthor, Nicola Lacetera, <a href= \"https://www.dropbox.com/s/mck5po8k85z33dg/lm-awards-jebo.pdf?dl=0\" target=\"_blank\" rel=\"noopener\">observed the effect of an incentive system</a> that offered symbolic rewards to blood donors in a particular Italian town. They found that when prizes for frequent donation were publicly announced, people donated more blood, indicating that social image concerns are a factor in blood donation.</p> <p>Through <a href= \"https://www.dropbox.com/s/w24387yet2fqax4/LMS_AEJpol.pdf?dl=0\" target=\"_blank\" rel=\"noopener\">a large-scale natural field experiment with the American Red Cross</a>, Mario and his coauthors showed that offering donors economic incentives to donate blood increases donation without increasing the fraction of ineligible donors.</p> <p>Mario's <a href= \"https://site.stanford.edu/sites/default/files/4760-ethical_concerns.pdf\" target=\"_blank\" rel=\"noopener\">more recent research</a> deals with people's attitudes towards compensated kidney donation. Using a choice experiment, Mario and his coauthors study the determinants of Americans' views on these repugnant transactions:</p> <blockquote>Regulation and public policies are often the result of competition and compromise between different views and interests. In several cases, strongly held moral beliefs voiced by societal groups lead lawmakers to prohibit certain transactions or to prevent them from occurring through markets. However, there is limited evidence about the specific nature of the general population’s opposition to using prices in such contentious transactions. We conducted a choice experiment on a representative sample of Americans to examine preferences for legalizing payments to kidney donors. We found strong polarization, with many participants in favor or against payments regardless of potential supply gains. However, about 20% of respondents would switch to supporting payments for large enough supply gains. Preferences for compensation have strong moral foundations. Respondents especially reject direct payments by patients, which they find would violate principles of fairness. We corroborate the interpretation of our findings with the analysis of a costly decision to donate money to a foundation that supports donor compensation.</blockquote> <p>Finally, we discuss some <a href= \"https://cartwright.house.gov/media-center/press-releases/cartwright-announces-legislation-to-increase-organ-donation\" target=\"_blank\" rel=\"noopener\">proposed legislation</a> that would allow limited experiments in compensating kidney donors.</p> <p> </p>",
  "content:encoded": "<p>My guest today, <a href=\"https://sites.google.com/site/mmacis/\" target=\"_blank\" rel=\"noopener\">Mario Macis</a> of Johns Hopkins University, has done a number of interesting studies related to blood and organ donation, particularly the compensation of blood and organ donors. For instance, Mario and his coauthor, Nicola Lacetera, <a href= \"https://www.dropbox.com/s/mck5po8k85z33dg/lm-awards-jebo.pdf?dl=0\" target=\"_blank\" rel=\"noopener\">observed the effect of an incentive system</a> that offered symbolic rewards to blood donors in a particular Italian town. They found that when prizes for frequent donation were publicly announced, people donated more blood, indicating that social image concerns are a factor in blood donation.</p> <p>Through <a href= \"https://www.dropbox.com/s/w24387yet2fqax4/LMS_AEJpol.pdf?dl=0\" target=\"_blank\" rel=\"noopener\">a large-scale natural field experiment with the American Red Cross</a>, Mario and his coauthors showed that offering donors economic incentives to donate blood increases donation without increasing the fraction of ineligible donors.</p> <p>Mario's <a href= \"https://site.stanford.edu/sites/default/files/4760-ethical_concerns.pdf\" target=\"_blank\" rel=\"noopener\">more recent research</a> deals with people's attitudes towards compensated kidney donation. Using a choice experiment, Mario and his coauthors study the determinants of Americans' views on these repugnant transactions:</p> Regulation and public policies are often the result of competition and compromise between different views and interests. In several cases, strongly held moral beliefs voiced by societal groups lead lawmakers to prohibit certain transactions or to prevent them from occurring through markets. However, there is limited evidence about the specific nature of the general population’s opposition to using prices in such contentious transactions. We conducted a choice experiment on a representative sample of Americans to examine preferences for legalizing payments to kidney donors. We found strong polarization, with many participants in favor or against payments regardless of potential supply gains. However, about 20% of respondents would switch to supporting payments for large enough supply gains. Preferences for compensation have strong moral foundations. Respondents especially reject direct payments by patients, which they find would violate principles of fairness. We corroborate the interpretation of our findings with the analysis of a costly decision to donate money to a foundation that supports donor compensation. <p>Finally, we discuss some <a href= \"https://cartwright.house.gov/media-center/press-releases/cartwright-announces-legislation-to-increase-organ-donation\" target=\"_blank\" rel=\"noopener\">proposed legislation</a> that would allow limited experiments in compensating kidney donors.</p> <p> </p>",
  "enclosure": "",
  "itunes:duration": "50:43",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "My guest today,  of Johns Hopkins University, has done a number of interesting studies related to blood and organ donation, particularly the compensation of blood and organ donors. For instance, Mario and his coauthor, Nicola Lacetera,  that offered...",
  "itunes:episode": 103,
  "itunes:episodeType": "full"
}