{
  "title": "Court Reminds Cops That Pointing A Bunch Of Guns At Someone Doesn&#8217;t Make A Search Consensual",
  "link": "https://www.techdirt.com/2022/11/03/court-reminds-cops-that-pointing-a-bunch-of-guns-at-someone-doesnt-make-a-search-consensual/",
  "comments": "https://www.techdirt.com/2022/11/03/court-reminds-cops-that-pointing-a-bunch-of-guns-at-someone-doesnt-make-a-search-consensual/#comments",
  "dc:creator": "Tim Cushing",
  "pubDate": "Fri, 04 Nov 2022 03:16:44 +0000",
  "category": [
    1,
    "4th amendment",
    "consent",
    "florida",
    "new port richey",
    "new port richey pd",
    "police"
  ],
  "guid": "https://www.techdirt.com/?p=381048&#038;preview=true&#038;preview_id=381048",
  "description": "Perhaps the last people who should be asked to define &#8220;consent&#8221; would be cops. They exist in an alternate reality where only those cuffed and/or beaten to a pulp can plausibly raise a claim that their questioning or search was non-consensual. This possibly explains why so many cops get charged with sexual assault, as well [&#8230;]",
  "content:encoded": "<p>Perhaps the last people who should be asked to <a href=\"https://www.techdirt.com/2021/10/14/court-says-google-translate-isnt-reliable-enough-to-determine-consent-search/\" data-type=\"URL\" data-id=\"https://www.techdirt.com/2021/10/14/court-says-google-translate-isnt-reliable-enough-to-determine-consent-search/\">define &#8220;consent&#8221;</a> would be cops. They exist <a href=\"https://www.techdirt.com/2016/12/07/cops-who-repeatedly-treated-refusal-as-consent-watch-their-seized-evidence-vanish/\" data-type=\"URL\" data-id=\"https://www.techdirt.com/2016/12/07/cops-who-repeatedly-treated-refusal-as-consent-watch-their-seized-evidence-vanish/\">in an alternate reality</a> where only those cuffed and/or beaten to a pulp can plausibly raise a claim that their questioning or search was non-consensual. This possibly explains why so many cops <a href=\"https://www.google.com/search?q=officer+charged+with+sexual+assault&rlz=1CAYGYA_enUS1029&oq=officer+charged+with+sexual+assault&aqs=chrome..69i57j0i22i30l9.4911j0j7&sourceid=chrome&ie=UTF-8\" data-type=\"URL\" data-id=\"https://www.google.com/search?q=officer+charged+with+sexual+assault&rlz=1CAYGYA_enUS1029&oq=officer+charged+with+sexual+assault&aqs=chrome..69i57j0i22i30l9.4911j0j7&sourceid=chrome&ie=UTF-8\">get charged with sexual assault</a>, as well as their ongoing inability to exist in domestic situations <a href=\"https://digitalcommons.usf.edu/etd/1862/#:~:text=Abstract,respectively%20(Sgambelluri%2C%202000).\" data-type=\"URL\" data-id=\"https://digitalcommons.usf.edu/etd/1862/#:~:text=Abstract,respectively%20(Sgambelluri%2C%202000).\">without engaging in violence</a>.</p>\n<p>This case is just another data point in law enforcement&#8217;s disconnection with reality when it comes to plausible definitions of consent. (via <a href=\"http://fourthamendment.com/?p=53445\" data-type=\"URL\" data-id=\"http://fourthamendment.com/?p=53445\">FourthAmendment.com</a>)</p>\n<p>The background is this: a housekeeper found a gun under a pillow in a room no one was currently renting. The motel owner called the New Port Richey PD to report the gun. Officers arrived to check things out. The owner said the last people to rent the room were now located in another room in the motel. The owner gave the officers information on the previous renters as well as their new location in the motel. </p>\n<p>The officers considered this to be about as open-and-shut as reasonable suspicion gets. However, as the court <a href=\"https://s3.documentcloud.org/documents/23234572/consent-my-ass.pdf\" data-type=\"URL\" data-id=\"https://s3.documentcloud.org/documents/23234572/consent-my-ass.pdf\">decision</a> [PDF] points out, lots of crucial information was ignored or omitted in arriving at this conclusion.</p>\n<blockquote class=\"wp-block-quote\">\n<p><em>The State offered no evidence to show how long the man and woman had occupied the first room, when they had left it, how many beds were in either room, or when either room had been last cleaned. No evidence suggested that the officers examined the room in which the gun was found.</em></p>\n</blockquote>\n<p> Despite this dearth of connective information, the officers moved ahead with their plan to confront the person they assumed had left the gun behind. All they had to work with was the motel owner&#8217;s claims and a firearm database search that said nothing more than the gun had been stolen. Again, the court points out the lack of information the officers chose to believe was actionable information.</p>\n<blockquote class=\"wp-block-quote\">\n<p><em>The record before the circuit court was silent about any other details of the Pinellas case—no evidence was offered about the circumstances, location or date of the theft, or the identity of any suspects.</em></p>\n</blockquote>\n<p>No positive link between the former tenants and the gun. No link between the target of the impromptu investigation. The only other piece of information the officers had was the fact that the relocated room renter had a felony conviction on his record, hardly evidence of ongoing guilt. And yet, the officers, in their testimony, claimed this all added up to enough to approach their target &#8212; Keith Vandawalker &#8212; for questioning. </p>\n<p>They staked out the room for a little while in order to verify the person in the room fit the description provided by the renter&#8217;s ID. And while he did match the vague &#8220;middle age white male,&#8221; the person in the room was not Keith Vandawalker. It was Gary Dydek, one of millions of middle aged white males residing in this country. </p>\n<p>Of course, officers did not discover this until after they&#8217;d decided they had the man they were looking for. Armed with this dearth of information, they made their move. Dramatically.</p>\n<p>The court notes the officers knew they did not have probable cause to search the room or effect an arrest. But they did believe they could do a knock-and-talk. However, their interpretation of a knock-and-talk was just as off-base as their interpretation of consent.</p>\n<blockquote class=\"wp-block-quote\">\n<p><em>They opted instead to &#8220;knock on the door and try to make contact – peaceful contact.&#8221; But their idea of &#8220;peaceful contact&#8221; was anything but. </em></p>\n<p><em>The officers recounted that once they were &#8220;set up . . . with enough officers&#8221;—five, to be precise—they got &#8220;into position&#8221; so that they could &#8220;approach safely and tactically.&#8221; One officer positioned himself on the other side of the hotel pool and trained a rifle on the hotel room. The four others, at least three with drawn handguns, </em> <em>loudly knocked and announced themselves as New Port Richey police. Dydek later testified that he opened the door and saw both the rifle and at least one handgun drawn and at the ready.</em></p>\n</blockquote>\n<p>These facts are undisputed, says the court. However, after performing this guns-drawn accosting of Dydek, leading to a search that recovered illicit substances in a pouch carried by the room renter, the officers and their legal reps claimed the whole thing was nothing more than a citizen voluntarily cooperating with a request to search his person.</p>\n<blockquote class=\"wp-block-quote\">\n<p><em>[T]he State argued at the suppression hearing that Dydek&#8217;s encounter with the officers was consensual or, alternatively, that the officers had reasonable suspicion sufficient to support a brief investigatory stop under the Florida&#8217;s Stop and Frisk Law&#8230;</em></p>\n</blockquote>\n<p>The lower court denied Dydek&#8217;s motion to suppress. The state appeals court says the lower court got this wrong. While the lower court did not make the determination the search was consensual, it did not engage in any fact-finding about the officers&#8217; actions and their claims about consent. </p>\n<p>The appeals court is succinct in its determination: </p>\n<blockquote class=\"wp-block-quote\">\n<p><em>Certainly, the encounter in this case was not consensual.</em></p>\n</blockquote>\n<p>Then it goes into detail, destroying the State&#8217;s weak claims about consent.</p>\n<blockquote class=\"wp-block-quote\">\n<p><em>Manifestly, in this case the officers&#8217; extreme display of authority and their &#8220;overbearing tactics&#8221; negated any possibility that their encounter with Dydek was consensual.</em></p>\n<p><em>It makes no difference that, as the State notes, there was conflicting testimony as to whether Dydek stepped out of his hotel room or was grabbed and pulled out. Under no reasonable view of either version was Dydek&#8217;s exit from his hotel room voluntary. No reasonable person would feel unrestricted and free to leave upon opening his door to be confronted by multiple officers with firearms drawn and with a rifle trained at the room from a few dozen yards away. And Dydek was definitively not free to leave when the officers laid hands on him, hauled him down the hall, attempted to handcuff him, and smashed his face into the ground.</em></p>\n</blockquote>\n<p>The court doesn&#8217;t find the State&#8217;s other argument &#8212; that this was an investigatory stop &#8212; any more persuasive. The cops had nothing approaching reasonable suspicion. Instead, they had a hunch and bunch of disconnected info pointing at nothing in particular.</p>\n<blockquote class=\"wp-block-quote\">\n<p><em>First, the officers had no more than a hunch that <strong>anyone</strong> had committed the crime of felon in possession of a firearm. Hotel staff found the handgun in a <strong>vacant</strong> room. And the officers had only established that one of the two prior occupants of that room had a felony conviction. Further, they did not know how long those two people had been in the room, how much time had passed between their departure from the room and the hotel staff&#8217;s discovery of the firearm, or whether anyone had entered the room in the interim.</em></p>\n<p><em>Nor was there any reasonable suspicion that there was a felon possessing a firearm in the second room. The handgun at issue was possessed by the officers when they engaged with the room&#8217;s occupant, so he could not have possessed it.</em></p>\n</blockquote>\n<p>Even more amazingly, the court calls the State out for its assertion that Dydek resisted arrest, thus justifying the arrest he was resisting &#8212; the State&#8217;s way of reframing the search as the inevitable outcome of a search incident to arrest, albeit one engaged in before an actual arrest was made. State law does not allow officers to arrest people for resisting unlawful arrests.</p>\n<blockquote class=\"wp-block-quote\">\n<p><em>The State also argues on appeal that the search of the pouch was lawful because it was after Dydek&#8217;s arrest for resisting without violence, for which the State asserts there was probable cause. But if officers detain an individual without lawful authority to do so, they are not acting in the lawful execution of their duties; therefore the individual&#8217;s nonviolent effort to oppose or avoid the detention is not unlawful. See A.R. v. State, 127 So. 3d 650, 654 (Fla. 4th DCA 2013); see also § 843.02, Fla. Stat. (2019) (defining the offense of resisting an officer without violence as resisting an officer who is engaged in &#8220;the lawful execution of any legal duty&#8221;). Thus, &#8220;[i]n resisting cases involving an investigatory detention, the state must prove that the officer had a reasonable suspicion of criminal activity.&#8221; A.R., 127 So. 3d at 654. As discussed above, the State failed to do so in this case.</em></p>\n</blockquote>\n<p>It&#8217;s a complete shut out. The officers lose their credibility and the State loses its prosecution. Everything recovered from the illegal search is suppressed. </p>\n<p>This should be a learning experience for cops in the state and the prosecutors who work with them. Sadly, I think it will just be viewed as more &#8220;evidence&#8221; courts are &#8220;soft on crime&#8221; and that too many criminals are getting freed on &#8220;technicalities&#8221; &#8212; the term prosecutors and cops often use to refer to rights violations they&#8217;ve committed.</p>\n",
  "wfw:commentRss": "https://www.techdirt.com/2022/11/03/court-reminds-cops-that-pointing-a-bunch-of-guns-at-someone-doesnt-make-a-search-consensual/comments/feed/",
  "slash:comments": 8
}