{
  "title": "Scientists chart how exercise affects the body",
  "link": "https://news.mit.edu/2022/genes-pathways-exercise-fat-loss-1004",
  "description": "A new study maps the genes and cellular pathways that contribute to exercise-induced weight loss.",
  "pubDate": "Tue, 04 Oct 2022 11:00:00 -0400",
  "guid": "https://news.mit.edu/2022/genes-pathways-exercise-fat-loss-1004",
  "dc:creator": "Anne Trafton | MIT News Office",
  "content:encoded": "<p>Exercise is well-known to help people lose weight and avoid gaining it. However, identifying the cellular mechanisms that underlie this process has proven difficult because so many cells and tissues are involved.</p>\n\n<p></p>\n\n<p>In a <a href=\"https://www.sciencedirect.com/science/article/pii/S1550413122003941?via%3Dihub\" target=\"_blank\">new study</a> in mice that expands researchers’ understanding of how exercise and diet affect the body, MIT and Harvard Medical School researchers have mapped out many of the cells, genes, and cellular pathways that are modified by exercise or high-fat diet. The findings could offer potential targets for drugs that could help to enhance or mimic the benefits of exercise, the researchers say.</p>\n\n<p></p>\n\n<p>“It is extremely important to understand the molecular mechanisms that are drivers of the beneficial effects of exercise and the detrimental effects of a high-fat diet, so that we can understand how we can intervene, and develop drugs that mimic the impact of exercise across multiple tissues,” says Manolis Kellis, a professor of computer science in MIT’s Computer Science and Artificial Intelligence Laboratory (CSAIL) and a member of the Broad Institute of MIT and Harvard.</p>\n\n<p></p>\n\n<p>The researchers studied mice with high-fat or normal diets, who were either sedentary or given the opportunity to exercise whenever they wanted. Using single-cell RNA sequencing, the researchers cataloged the responses of 53 types of cells found in skeletal muscle and two types of fatty tissue.</p>\n\n<p></p>\n\n<p>“One of the general points that we found in our study, which is overwhelmingly clear, is how high-fat diets push all of these cells and systems in one way, and exercise seems to be pushing them nearly all in the opposite way,” Kellis says. “It says that exercise can really have a major effect throughout the body.”</p>\n\n<p></p>\n\n<p>Kellis and Laurie Goodyear, a professor of medicine at Harvard Medical School and senior investigator at the Joslin Diabetes Center, are the senior authors of the study, which appears today in the journal <em>Cell Metabolism</em>. Jiekun Yang, a research scientist in MIT CSAIL; Maria Vamvini, an instructor of medicine at the Joslin Diabetes Center; and Pasquale Nigro, an instructor of medicine at the Joslin Diabetes Center, are the lead authors of the paper.</p>\n\n<p></p>\n\n<p><strong>The risks of obesity</strong></p>\n\n<p></p>\n\n<p>Obesity is a growing health problem around the world. In the United States, more than 40 percent of the population is considered obese, and nearly 75 percent is overweight. Being overweight is a risk factor for many diseases, including heart disease, cancer, Alzheimer’s disease, and even infectious diseases such as Covid-19.</p>\n\n<p></p>\n\n<p>“Obesity, along with aging, is a global factor that contributes to every aspect of human health,” Kellis says.</p>\n\n<p></p>\n\n<p>Several years ago, his lab <a href=\"https://news.mit.edu/2015/pathway-controls-metabolism-underlying-obesity-0819\">performed a study</a> on the FTO gene region, which has been strongly linked to obesity risk. In that 2015 study, the research team found that genes in this region control a pathway that prompts immature fat cells called progenitor adipocytes to either become fat-burning cells or fat-storing cells.</p>\n\n<p></p>\n\n<p>That finding, which demonstrated a clear genetic component to obesity, motivated Kellis to begin looking at how exercise, a well-known behavioral intervention that can prevent obesity, might act on progenitor adipocytes at the cellular level.</p>\n\n<p></p>\n\n<p>To explore that question, Kellis and his colleagues decided to perform single-cell RNA sequencing of three types of tissue — skeletal muscle, visceral white adipose tissue (found packed around internal organs, where it stores fat), and subcutaneous white adipose tissue (which is found under the skin and primarily burns fat).</p>\n\n<p></p>\n\n<p>These tissues came from mice from four different experimental groups. For three weeks, two groups of mice were fed either a normal diet or a high-fat diet. For the next three weeks, each of those two groups were further divided into a sedentary group and an exercise group, which had continuous access to a treadmill.</p>\n\n<p></p>\n\n<p>By analyzing tissues from those mice, the researchers were able to comprehensively catalog the genes that were activated or suppressed by exercise in 53 different cell types.</p>\n\n<p></p>\n\n<p>The researchers found that in all three tissue types, mesenchymal stem cells (MSCs) appeared to control many of the diet and exercise-induced effects that they observed. MSCs are stem cells that can differentiate into other cell types, including fat cells and fibroblasts. In adipose tissue, the researchers found that a high-fat diet modulated MSCs’ capacity to differentiate into fat-storing cells, while exercise reversed this effect.</p>\n\n<p></p>\n\n<p>In addition to promoting fat storage, the researchers found that a high-fat diet also stimulated MSCs to secrete factors that remodel the extracellular matrix (ECM) — a network of proteins and other molecules that surround and support cells and tissues in the body. This ECM remodeling helps provide structure for enlarged fat-storing cells and also creates a more inflammatory environment.</p>\n\n<p></p>\n\n<p>“As the adipocytes become overloaded with lipids, there’s an extreme amount of stress, and that causes low-grade inflammation, which is systemic and preserved for a long time,” Kellis says. “That is one of the factors that is contributing to many of the adverse effects of obesity.”</p>\n\n<p></p>\n\n<p><strong>Circadian effects</strong></p>\n\n<p></p>\n\n<p>The researchers also found that high-fat diets and exercise had opposing effects on cellular pathways that control circadian rhythms — the 24-hour cycles that govern many functions, from sleep to body temperature, hormone release, and digestion. The study revealed that exercise boosts the expression of genes that regulate these rhythms, while a high-fat diet suppresses them.</p>\n\n<p></p>\n\n<p>“There have been a lot of studies showing that when you eat during the day is extremely important in how you absorb the calories,” Kellis says. “The circadian rhythm connection is a very important one, and shows how obesity and exercise are in fact directly impacting that circadian rhythm in peripheral organs, which could act systemically on distal clocks and regulate stem cell functions and immunity.”</p>\n\n<p></p>\n\n<p>The researchers then compared their results to a database of human genes that have been linked with metabolic traits. They found that two of the circadian rhythm genes they identified in this study, known as DBP and CDKN1A, have genetic variants that have been associated with a higher risk of obesity in humans.</p>\n\n<p></p>\n\n<p>“These results help us see the translational values of these targets, and how we could potentially target specific biological processes in specific cell types,” Yang says.</p>\n\n<p></p>\n\n<p>The researchers are now analyzing samples of small intestine, liver, and brain tissue from the mice in this study, to explore the effects of exercise and high-fat diets on those tissues. They are also conducting work with human volunteers to sample blood and biopsies and study similarities and differences between human and mouse physiology. They hope that their findings will help guide drug developers in designing drugs that might mimic some of the beneficial effects of exercise.</p>\n\n<p></p>\n\n<p>“The message for everyone should be, eat a healthy diet and exercise if possible,” Kellis says. “For those for whom this is not possible, due to low access to healthy foods, or due to disabilities or other factors that prevent exercise, or simply lack of time to have a healthy diet or a healthy lifestyle, what this study says is that we now have a better handle on the pathways, the specific genes, and the specific molecular and cellular processes that we should be manipulating therapeutically.”</p>\n\n<p></p>\n\n<p>The research was funded by the National Institutes of Health and the Novo Nordisk Research Center in Seattle.</p>",
  "media:content": {
    "media:description": "MIT and Harvard Medical School researchers mapped out many of the cells, genes, and cellular pathways that are modified by exercise or high-fat diet."
  },
  "category": [
    "Research",
    "Food",
    "Behavior",
    "Health",
    "Medicine",
    "Drug discovery",
    "Electrical Engineering & Computer Science (eecs)",
    "Broad Institute",
    "School of Engineering",
    "Computer Science and Artificial Intelligence Laboratory (CSAIL)",
    "MIT Schwarzman College of Computing",
    "National Institutes of Health (NIH)"
  ]
}