{
  "itunes:episodeType": "full",
  "itunes:title": "The Power of Bias and How to Disrupt It in Our Children (with Dr. Jennifer Eberhardt)",
  "title": "The Power of Bias and How to Disrupt It in Our Children (with Dr. Jennifer Eberhardt)",
  "itunes:author": "JLML Press",
  "itunes:subtitle": "Dr. Jennifer Eberhart, author of the best-selling…",
  "itunes:summary": "Dr. Jennifer Eberhart, author of the best-selling book “Biased: Uncovering the Hidden Prejudice That Shapes What We See, Think, and Do,” joins Janet to discuss how racial bias develops in the brain and creates disparities in our neighborhoods, schools, workplaces, and the criminal justice system.  As the mother of three sons, Jennifer has also witnessed the effects of bias in real time.  She and Janet explore some of the steps parents can take to combat the development of bias in their children. \"Preschoolers are picking this up and determining who's a good person, who's a bad person… They need our help in comprehending what's going on around them and helping them to make sense of it.\" \n \nJennifer is a Stanford University professor and a faculty director of SPARQ , a university initiative to use social psychological research to address pressing social problems. She has been named a MacArthur Fellow, one of “Foreign Policy”’s 100 Leading Global Thinkers, and elected to both the American Academy of Arts and Sciences and the National Academy of Sciences.\n\nFor more advice on common parenting issues, please check out Janet's best-selling books on Audible, FREE with a 30-day trial membership if you use this link: adbl.co/2OBVztZ. Paperbacks and e-books are also available at Amazon, Google Play, Barnes & Noble and Apple Books. \n\nJanet's exclusive audio series \"Sessions\" is available for download. This is a collection of recorded one-on-one consultations with parents discussing their most immediate and pressing concerns (www.SessionsAudio.com).\n\nAdvertising Inquiries: https://redcircle.com/brands\n\nPrivacy & Opt-Out: https://redcircle.com/privacy",
  "description": "<p>Dr. Jennifer Eberhart, author of the best-selling book “Biased: Uncovering the Hidden Prejudice That Shapes What We See, Think, and Do,” joins Janet to discuss how racial bias develops in the brain and creates disparities in our neighborhoods, schools, workplaces, and the criminal justice system. As the mother of three sons, Jennifer has also witnessed the effects of bias in real time. She and Janet explore some of the steps parents can take to combat the development of bias in their children. \"Preschoolers are picking this up and determining who's a good person, who's a bad person… They need our help in comprehending what's going on around them and helping them to make sense of it.\" </p><p>Jennifer is a Stanford University professor and a faculty director of SPARQ , a university initiative to use social psychological research to address pressing social problems. She has been named a MacArthur Fellow, one of “Foreign Policy”’s 100 Leading Global Thinkers, and elected to both the American Academy of Arts and Sciences and the National Academy of Sciences. </p><p>For more advice on common parenting issues, please check out Janet's best-selling books on Audible, FREE with a 30-day trial membership if you use this link: adbl.co/2OBVztZ. </p><p>Paperbacks and e-books are also available at Amazon, Google Play, Barnes & Noble and Apple Books. </p><p>Janet's exclusive audio series \"Sessions\" is available for download. This is a collection of recorded one-on-one consultations with parents discussing their most immediate and pressing concerns (www.SessionsAudio.com).</p><br/><br/>Advertising Inquiries: <a href='https://redcircle.com/brands'>https://redcircle.com/brands</a><br/><br/>Privacy & Opt-Out: <a href='https://redcircle.com/privacy'>https://redcircle.com/privacy</a>",
  "content:encoded": "<p>Dr. Jennifer Eberhart, author of the best-selling book “Biased: Uncovering the Hidden Prejudice That Shapes What We See, Think, and Do,” joins Janet to discuss how racial bias develops in the brain and creates disparities in our neighborhoods, schools, workplaces, and the criminal justice system. As the mother of three sons, Jennifer has also witnessed the effects of bias in real time. She and Janet explore some of the steps parents can take to combat the development of bias in their children. &#34;Preschoolers are picking this up and determining who&#39;s a good person, who&#39;s a bad person… They need our help in comprehending what&#39;s going on around them and helping them to make sense of it.&#34; </p><p>Jennifer is a Stanford University professor and a faculty director of SPARQ , a university initiative to use social psychological research to address pressing social problems. She has been named a MacArthur Fellow, one of “Foreign Policy”’s 100 Leading Global Thinkers, and elected to both the American Academy of Arts and Sciences and the National Academy of Sciences. </p><p>For more advice on common parenting issues, please check out Janet&#39;s best-selling books on Audible, FREE with a 30-day trial membership if you use this link: adbl.co/2OBVztZ. </p><p>Paperbacks and e-books are also available at Amazon, Google Play, Barnes &amp; Noble and Apple Books. </p><p>Janet&#39;s exclusive audio series &#34;Sessions&#34; is available for download. This is a collection of recorded one-on-one consultations with parents discussing their most immediate and pressing concerns (www.SessionsAudio.com).</p><br/><br/>Advertising Inquiries: <a href='https://redcircle.com/brands'>https://redcircle.com/brands</a><br/><br/>Privacy & Opt-Out: <a href='https://redcircle.com/privacy'>https://redcircle.com/privacy</a>",
  "enclosure": "",
  "guid": "tag:soundcloud,2010:tracks/858503584",
  "link": "https://soundcloud.com/janet-lansbury/the-power-of-bias-and-how-to-disrupt-it-in-our-children-with-dr-jennifer-eberhardt",
  "pubDate": "Wed, 15 Jul 2020 17:43:24 &#43;0000",
  "itunes:image": "",
  "itunes:duration": 2509,
  "itunes:explicit": "no"
}