{
  "title": "Tales of Wagadu: The Curse of the Spider Queen - Episode 5 \"The Swarm\"",
  "itunes:title": "Tales of Wagadu: The Curse of the Spider Queen - Episode 5 \"The Swarm\"",
  "description": "<p>After passing through a series of deeply unsettling memories, our heroes find themselves in a grove filled with even more mysteries. Something has brought them here, and whatever it is doesn't want them to leave...</p>\n<p>CONTENT WARNING:</p>\n<p>This episode contains a depiction of a parental death, as well as vague references to alcoholism. Please see below for a full summary of the episode. </p>\n<p>Starring: Shamini Bundell (she/her) as Reth (they/she, Eland's Blessing Swala, Squared Circle Pugilist) <br>Liv Kennedy (she/her) as Juji Osei (she/her, Bloom Emere, Circle of Stars Druid 4/Twilight Cleric 1) <br>Jonathan Charles (he/him) as Aboade (he/him, Copper Ironmaster, Battle Smith Artificer) <br>and Jeremy Cobb as your Very Neighborhood Dungeon Master!</p>\n<p>Post-production by Seth Leue and Daniel Ramos</p>\n<p>EPISODE SUMMARY:</p>\n<p>Our heroes find themselves in a grove surrounded by incredibly thick vines. The light is very low. There are items scattered all around them, mostly covered by the thick undergrowth. In the center of the grove stands a cracked idol, surrounding the idol is a beautiful arrangement of yellow stones, and kneeling at the edge of the arrangement an elderly Emere man. The man's body is connected to the idol by vein-like vines that are attached to each of his major articulation points (elbows, shoulders, knees, etc.).</p>\n<p>As Juji panics, and Reth is in shock, the party regroups. No one is quite sure of how they got here. They suspect that what they saw were illusions drawn from their memories. Juji reveals that the giant tree that she and Aboade fell down was from her past. She used to live in the tree, and they shared a powerful bond, but then things \"went awry\". Aboade and Reth note that the people they encountered in their memories all seemed to be made of some sticky substance. Aboade reveals that he has no memory of Dagbeor the automatons, although they did seem familiar and he did notice that the automatons bore a strong resemblance to Yim. Reth interrupts their speculation by going over to inspect the elderly Emere man, whom the group surmises is likely Jimoh.</p>\n<p>Reth walks over to Jimoh and touches him to test if he's sticky. While he thankfully isn't stick, Reth is drawn into his memories the moment they touch. They see how Jimoh fell to Wagadu as a child and was found by other Emere who were dressed very differently than the other Emere Reth has seen thus far. Among the Emere was another boy with whom Jimoh felt an immediate connection, like love at first sight. Reth relates this to the group, so Juji checks the vines and sees that they appear to have pierced into Jimoh's body and are forming some kind of vine network under his skin. The vines piercing Jimoh, as well as the vines covering all the objects spread around the room, all originate from the idol.</p>\n<p>Aboade decides to try and strike up a conversation with the old man, who has yet to react in any way to the party's presence. However, on his way over he trips on a vine and sees one of the overgrown items on the ground. It's an extremely old kalabash with an inscription in a language Aboade doesn't understand. Aboade rolls a 19 Calligrapher's Tools check to copy down the inscription, and then he decides to investigate the arrangement of yellow stones. He takes out his stone to compare, and immediately notices its similarity to the ones in the arrangement. He rolls a 27 Investigation check to notice that there are numerous, possibly hundreds of stones missing from the formation, which at one point might have covered the entire grove. The arrangement itself seems to be a 2-D rendering of a complex 3-D shape. Aboade decides to try and place his stone into the arrangement, but his task is made more difficult by the thick undergrowth among the stones. He accidentally knocks one of the stones out of place, and suddenly the stones all sprout legs and begin scuttling toward Aboade. Time to roll initiative!</p>\n<p>As the stones come to life, 8 thick vines rise up around the idol and begin lashing out at the party. One hits Aboade, sprouting smaller vines that wrap around his arm and grapple him, but two others miss Reth and Juji. Unfortunately, a fourth vine manages to whip around and successfully grapple Reth as well. Both Reth and Aboade are then dragged forward toward the idol. Aboade, who was closer to the idol, is dragged all the way to it and is forced to make a Wisdom saving throw, which he succeeds. Reth successfully tears away from the vine, breaking the grapple. The rocks swarm over Aboade, but their attacks are unable to break through his protection. Aboade uses his Ironmaster fetish charm to completely sever the vine that was grappling him, leaving it a smoking stump. He uses his second attack to swing at the spiders, but he fails to hit their AC as they dance over the blade of his weapon. Aboade then turns and tries to run, making it through the difficult terrain to the edge of the formation. Seeing all of this, Juji bends down, collects some of the twisted old vines, and casts Wither and Bloom, restoring HP to Aboade, deactivating a huge portion of the spidery rock swarm and damaging the vines. After dealing this damage, she has to make another one of her mysterious, unexplained rolls, which she succeeds on.</p>\n<p>At the top of the next round, the vines attack again, successfully grappling all 3 PCs. They dig into Reth's temple, forcing Reth to make a Wisdom save, which they fail. Upon failing the save, Reth is forced to relive a traumatic childhood memory of their parent, implied to have been an alcoholic, passing away in their sleep next to Reth when Reth was very young. Reth remembers staying in the room with them for a full day before leaving home into an uncertain future in the big city. As a result of this horrific memory, Reth gains another level of \"psychic exhaustion\", which essentially places them under the effects of the Slow spell. Their speed is halved, they suffer a -2 penalty to AC and Dex saves, they can't use reactions, and on their turn they can either use an action or a bonus action, but not both. Reth is completely demoralized by this vision, and their half-hearted attempt to break the grapple fails as a result. The spidery rocks swarm over them, dealing 5 points of piercing damage. Seeing Reth in distress, Aboade pulls out his pistol and begins blasting at the swarm, hitting both times and dealing 24 damage. Aboade's first shot deactivates the entire swarm, and his second shot shreds the vine, freeing Reth once more. With his bonus action, Aboade commands Yim to charge in and attack the idol itself. Yim bounds springily through the undergrowth and tears into the idol, dealing 6 points of force damage. Juji fires a 2nd level Guiding Bolt at the idol, but misses. She narrowly succeeds on another mysterious roll, and the air around her grows bitterly cold as the mysterious \"she\" approaches.</p>\n<p>On the vines' next turn, one successfully re-grapples Reth. Then, it's Juji's turn to fail a Wisdom save, which plunges her into the memory of a traumatic family dinner. Her entire family (a mother, father, two older sisters, and two older brothers) looks down on her for her lack of academic acumen. They devalue her again and again throughout her life, negatively comparing her to her siblings and constantly being disappointed in her. Juji takes a level of psychic exhaustion as well, giving her disadvantage on ability checks. Reth tries to kick out at the idol, but they miss yet again and stub their toe. Reth is feeling broken, lost, and hopeless as a result of their latest memory. Some of the spidery stones reactivate and begin attacking Aboade, but once again completely fail to harm him. Aboade shoots his pistol at the idol twice, doing 11 damage and blasting off a chunk, then Yim runs over to attack the spidery rocks, dealing 10 force damage and deactivating almost all of the stones once more. Aboade disappears under a flurry of coils as Yim goes to town. Juji uses her inspiration (gained for making a pun in a previous episode) to fire a 3rd level Guiding Bolt at the idol, but rolls two 4s and misses. She then rolls a Nat 1 on her mysterious roll, and even more chaos breaks loose. From Juji's perspective, a piercingly cold squall surrounds her as shriveled, gray hands grasp her shoulders. From Reth and Aboade's perspective, Juji is sucked screaming into a black hole that opens up inside of her her, then a shriveled, dessicated, terryfying woman drags herself out. The Withered Woman has arrived! Her eyes are so dark that they seem to swallow light rather than reflect it. From inside the black hole, Juji can see the flesh on her shoulders begin to decay where the Withered Woman is touching her. The Withered Woman is chaos incarnate, and her necrotic energy is lashing out, threatening to harm Juji's friends. Juji rolls a 19 on a Wisdom Save to divert the energy away from her friends and towards the idol, dealing 24 necrotic damage to it and causing it to begin to crumble.</p>\n<p>At the top of the round, Aboade succeeds on a Wisdom Save, but he, Reth, and the Withered Woman are dragged in towards the idol, which begins to glow. On Reth's turn, they remember Nzito's words and call out to the Forest Father for help. They roll a pivotal a Religion check and, bolstered by Nzito's love, succeed! The ground rumbles, the wall of vines that surround the grove shredded, and a glowing manifestation of the Forest Father bursts into the grove. He stands 10 feet tall, his entire body covered by hundreds of upside-down palm fronds. He glides into the room on rapidly dancing feet, draws a bow made of two rainbows tied together, and fires a glowing arrow into the heart of the idol. The idol shatters, the yellow stones go flying, and all the attacking vines shrivel and dissolve into light. The Withered Woman is also banished back into the black hole by this incredible power, and Juji reappears, still bearing faint marks where the Woman had touched her. The Forest Father says nothing, but gestures warmly to the party, shoots them a thumbs up, and then dances into the sky. Reth kneels as he leaves, Aboade offers a meek wave and a \"er, thank you!\", and Juji sits in a catatonic state. Yim also waves at the retreating Forest Father, looks around at the group and says \"well, snap!\"</p>\n<p>The End</p>\n<p>Watch the video version on YouTube, and join us on Patreon for our talkback episodes, Wagadu Watches!</p>\n<p><strong>Join us for D&D in a Castle!</strong><br>D&D in a Castle Round 8 (27th- 31st October) - Jeremy DMing <a href=\"https://shop.dndinacastle.com/collections/2022-events/products/2022-round-8\">https://shop.dndinacastle.com/collections/2022-events/products/2022-round-8</a> </p>\n<p>You can now buy merchandise <a href=\"https://store.dftba.com/collections/three-black-halflings\">here! </a>as featured on Critical Role!</p>\n<p>Support us on Patreon at <a href=\"patreon.com/tbhalflings\">patreon.com/tbhalflings </a>for your Shirefolk Shoutout and Bonus Episodes.</p>\n<p>Connect with us on Twitter, Instagram, and Facebook @3blackhalflings, on our Discord, or email secondbreakfast@tbhalflings.com</p>\n<p>See omnystudio.com/listener for privacy information.</p><p>See <a href=\"https://omnystudio.com/listener\">omnystudio.com/listener</a> for privacy information.</p>",
  "content:encoded": "<p>After passing through a series of deeply unsettling memories, our heroes find themselves in a grove filled with even more mysteries. Something has brought them here, and whatever it is doesn't want them to leave...</p>\n<p>CONTENT WARNING:</p>\n<p>This episode contains a depiction of a parental death, as well as vague references to alcoholism. Please see below for a full summary of the episode. </p>\n<p>Starring: Shamini Bundell (she/her) as Reth (they/she, Eland's Blessing Swala, Squared Circle Pugilist) <br>Liv Kennedy (she/her) as Juji Osei (she/her, Bloom Emere, Circle of Stars Druid 4/Twilight Cleric 1) <br>Jonathan Charles (he/him) as Aboade (he/him, Copper Ironmaster, Battle Smith Artificer) <br>and Jeremy Cobb as your Very Neighborhood Dungeon Master!</p>\n<p>Post-production by Seth Leue and Daniel Ramos</p>\n<p>EPISODE SUMMARY:</p>\n<p>Our heroes find themselves in a grove surrounded by incredibly thick vines. The light is very low. There are items scattered all around them, mostly covered by the thick undergrowth. In the center of the grove stands a cracked idol, surrounding the idol is a beautiful arrangement of yellow stones, and kneeling at the edge of the arrangement an elderly Emere man. The man's body is connected to the idol by vein-like vines that are attached to each of his major articulation points (elbows, shoulders, knees, etc.).</p>\n<p>As Juji panics, and Reth is in shock, the party regroups. No one is quite sure of how they got here. They suspect that what they saw were illusions drawn from their memories. Juji reveals that the giant tree that she and Aboade fell down was from her past. She used to live in the tree, and they shared a powerful bond, but then things \"went awry\". Aboade and Reth note that the people they encountered in their memories all seemed to be made of some sticky substance. Aboade reveals that he has no memory of Dagbeor the automatons, although they did seem familiar and he did notice that the automatons bore a strong resemblance to Yim. Reth interrupts their speculation by going over to inspect the elderly Emere man, whom the group surmises is likely Jimoh.</p>\n<p>Reth walks over to Jimoh and touches him to test if he's sticky. While he thankfully isn't stick, Reth is drawn into his memories the moment they touch. They see how Jimoh fell to Wagadu as a child and was found by other Emere who were dressed very differently than the other Emere Reth has seen thus far. Among the Emere was another boy with whom Jimoh felt an immediate connection, like love at first sight. Reth relates this to the group, so Juji checks the vines and sees that they appear to have pierced into Jimoh's body and are forming some kind of vine network under his skin. The vines piercing Jimoh, as well as the vines covering all the objects spread around the room, all originate from the idol.</p>\n<p>Aboade decides to try and strike up a conversation with the old man, who has yet to react in any way to the party's presence. However, on his way over he trips on a vine and sees one of the overgrown items on the ground. It's an extremely old kalabash with an inscription in a language Aboade doesn't understand. Aboade rolls a 19 Calligrapher's Tools check to copy down the inscription, and then he decides to investigate the arrangement of yellow stones. He takes out his stone to compare, and immediately notices its similarity to the ones in the arrangement. He rolls a 27 Investigation check to notice that there are numerous, possibly hundreds of stones missing from the formation, which at one point might have covered the entire grove. The arrangement itself seems to be a 2-D rendering of a complex 3-D shape. Aboade decides to try and place his stone into the arrangement, but his task is made more difficult by the thick undergrowth among the stones. He accidentally knocks one of the stones out of place, and suddenly the stones all sprout legs and begin scuttling toward Aboade. Time to roll initiative!</p>\n<p>As the stones come to life, 8 thick vines rise up around the idol and begin lashing out at the party. One hits Aboade, sprouting smaller vines that wrap around his arm and grapple him, but two others miss Reth and Juji. Unfortunately, a fourth vine manages to whip around and successfully grapple Reth as well. Both Reth and Aboade are then dragged forward toward the idol. Aboade, who was closer to the idol, is dragged all the way to it and is forced to make a Wisdom saving throw, which he succeeds. Reth successfully tears away from the vine, breaking the grapple. The rocks swarm over Aboade, but their attacks are unable to break through his protection. Aboade uses his Ironmaster fetish charm to completely sever the vine that was grappling him, leaving it a smoking stump. He uses his second attack to swing at the spiders, but he fails to hit their AC as they dance over the blade of his weapon. Aboade then turns and tries to run, making it through the difficult terrain to the edge of the formation. Seeing all of this, Juji bends down, collects some of the twisted old vines, and casts Wither and Bloom, restoring HP to Aboade, deactivating a huge portion of the spidery rock swarm and damaging the vines. After dealing this damage, she has to make another one of her mysterious, unexplained rolls, which she succeeds on.</p>\n<p>At the top of the next round, the vines attack again, successfully grappling all 3 PCs. They dig into Reth's temple, forcing Reth to make a Wisdom save, which they fail. Upon failing the save, Reth is forced to relive a traumatic childhood memory of their parent, implied to have been an alcoholic, passing away in their sleep next to Reth when Reth was very young. Reth remembers staying in the room with them for a full day before leaving home into an uncertain future in the big city. As a result of this horrific memory, Reth gains another level of \"psychic exhaustion\", which essentially places them under the effects of the Slow spell. Their speed is halved, they suffer a -2 penalty to AC and Dex saves, they can't use reactions, and on their turn they can either use an action or a bonus action, but not both. Reth is completely demoralized by this vision, and their half-hearted attempt to break the grapple fails as a result. The spidery rocks swarm over them, dealing 5 points of piercing damage. Seeing Reth in distress, Aboade pulls out his pistol and begins blasting at the swarm, hitting both times and dealing 24 damage. Aboade's first shot deactivates the entire swarm, and his second shot shreds the vine, freeing Reth once more. With his bonus action, Aboade commands Yim to charge in and attack the idol itself. Yim bounds springily through the undergrowth and tears into the idol, dealing 6 points of force damage. Juji fires a 2nd level Guiding Bolt at the idol, but misses. She narrowly succeeds on another mysterious roll, and the air around her grows bitterly cold as the mysterious \"she\" approaches.</p>\n<p>On the vines' next turn, one successfully re-grapples Reth. Then, it's Juji's turn to fail a Wisdom save, which plunges her into the memory of a traumatic family dinner. Her entire family (a mother, father, two older sisters, and two older brothers) looks down on her for her lack of academic acumen. They devalue her again and again throughout her life, negatively comparing her to her siblings and constantly being disappointed in her. Juji takes a level of psychic exhaustion as well, giving her disadvantage on ability checks. Reth tries to kick out at the idol, but they miss yet again and stub their toe. Reth is feeling broken, lost, and hopeless as a result of their latest memory. Some of the spidery stones reactivate and begin attacking Aboade, but once again completely fail to harm him. Aboade shoots his pistol at the idol twice, doing 11 damage and blasting off a chunk, then Yim runs over to attack the spidery rocks, dealing 10 force damage and deactivating almost all of the stones once more. Aboade disappears under a flurry of coils as Yim goes to town. Juji uses her inspiration (gained for making a pun in a previous episode) to fire a 3rd level Guiding Bolt at the idol, but rolls two 4s and misses. She then rolls a Nat 1 on her mysterious roll, and even more chaos breaks loose. From Juji's perspective, a piercingly cold squall surrounds her as shriveled, gray hands grasp her shoulders. From Reth and Aboade's perspective, Juji is sucked screaming into a black hole that opens up inside of her her, then a shriveled, dessicated, terryfying woman drags herself out. The Withered Woman has arrived! Her eyes are so dark that they seem to swallow light rather than reflect it. From inside the black hole, Juji can see the flesh on her shoulders begin to decay where the Withered Woman is touching her. The Withered Woman is chaos incarnate, and her necrotic energy is lashing out, threatening to harm Juji's friends. Juji rolls a 19 on a Wisdom Save to divert the energy away from her friends and towards the idol, dealing 24 necrotic damage to it and causing it to begin to crumble.</p>\n<p>At the top of the round, Aboade succeeds on a Wisdom Save, but he, Reth, and the Withered Woman are dragged in towards the idol, which begins to glow. On Reth's turn, they remember Nzito's words and call out to the Forest Father for help. They roll a pivotal a Religion check and, bolstered by Nzito's love, succeed! The ground rumbles, the wall of vines that surround the grove shredded, and a glowing manifestation of the Forest Father bursts into the grove. He stands 10 feet tall, his entire body covered by hundreds of upside-down palm fronds. He glides into the room on rapidly dancing feet, draws a bow made of two rainbows tied together, and fires a glowing arrow into the heart of the idol. The idol shatters, the yellow stones go flying, and all the attacking vines shrivel and dissolve into light. The Withered Woman is also banished back into the black hole by this incredible power, and Juji reappears, still bearing faint marks where the Woman had touched her. The Forest Father says nothing, but gestures warmly to the party, shoots them a thumbs up, and then dances into the sky. Reth kneels as he leaves, Aboade offers a meek wave and a \"er, thank you!\", and Juji sits in a catatonic state. Yim also waves at the retreating Forest Father, looks around at the group and says \"well, snap!\"</p>\n<p>The End</p>\n<p>Watch the video version on YouTube, and join us on Patreon for our talkback episodes, Wagadu Watches!</p>\n<p><strong>Join us for D&D in a Castle!</strong><br>D&D in a Castle Round 8 (27th- 31st October) - Jeremy DMing <a href=\"https://shop.dndinacastle.com/collections/2022-events/products/2022-round-8\">https://shop.dndinacastle.com/collections/2022-events/products/2022-round-8</a> </p>\n<p>You can now buy merchandise <a href=\"https://store.dftba.com/collections/three-black-halflings\">here! </a>as featured on Critical Role!</p>\n<p>Support us on Patreon at <a href=\"patreon.com/tbhalflings\">patreon.com/tbhalflings </a>for your Shirefolk Shoutout and Bonus Episodes.</p>\n<p>Connect with us on Twitter, Instagram, and Facebook @3blackhalflings, on our Discord, or email secondbreakfast@tbhalflings.com</p>\n<p>See omnystudio.com/listener for privacy information.</p><p>See <a href=\"https://omnystudio.com/listener\">omnystudio.com/listener</a> for privacy information.</p>",
  "itunes:episodeType": "full",
  "itunes:season": 2,
  "itunes:episode": 5,
  "itunes:author": "Three Black Halflings",
  "itunes:image": "",
  "media:content": [
    {
      "media:player": ""
    },
    ""
  ],
  "guid": "dacf5ca7-357c-474f-99a1-af12003adb77",
  "omny:clipId": "dacf5ca7-357c-474f-99a1-af12003adb77",
  "pubDate": "Thu, 22 Sep 2022 11:12:28 +0000",
  "itunes:duration": 6592,
  "enclosure": "",
  "link": "https://omny.fm/shows/three-black-halflings/tales-of-wagadu-the-curse-of-the-spider-queen-ep-4"
}