{
  "title": "Chinese Whispers: Taiwan deals with the fallout from Pelosi's tour",
  "link": "https://audioboom.com/posts/8133955",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1508,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Nancy Pelosi’s controversial trip to Taiwan made headlines across the world this week, after President Xi’s warnings to the US ‘not to play with fire’. Furious, Beijing has responded with economic sanctions and a flurry of missiles over and around the island, as well as sanctioning Pelosi and her family. But as the West frets about possible escalation, often lacking from the discussion is what Taiwanese people actually think. In fact, as Taipei-based journalist Brian Hioe explains to Cindy Yu in this episode, most people there were less worried about the visit than you might expect. ‘There’s been so much in terms of Chinese military drilling or activity directed at Taiwan for a decade, people are quite used to it.’ <br>\n<br>\nComparisons to the calm in Ukraine before the Russian invasion are unfounded: ‘we are not seeing troops massing’. That is not to say, though, that the situation is without danger. A more limited and realistic threat is of China imposing a blockade, or attacking one of Taiwan’s outlying islands. Other possible repercussions include a salvo of cyberattacks, one pro-China actor having already hacked supermarkets and train station displays on the island this week.<br>\n<br>\nSo given all these dangers, why did Pelosi come at all? Perhaps telling is the Taiwanese government’s silence over whether it actually invited her. US domestic politics is probably a factor, as is her own legacy. Regardless of her motivation, President Biden said the move was unwise, and the situation remains delicate.<br>\n<br>\nCareful diplomatic management of the crisis requires reliable information. But in the context of Taiwan, that is by no means a given. Brian explains the bizarre dynamic that exists between international and Taiwanese media, where each assumes the other is better informed. ‘The two sides are actually somewhat bad at fact-checking each other. Then they’re just amplifying what is sometimes discrimination but primarily misinformation.’<br>\n<br>\nTune in to hear more about the view from Taipei.</div>\n",
  "pubDate": "Fri, 05 Aug 2022 11:24:32 +0000",
  "guid": "tag:audioboom.com,2022-08-05:/posts/8133955",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}