{
  "title": "S1E61 - The State of Doping in Sports with Olympic Medalist and USADA Director Allison Wagner",
  "guid": "https://pinecast.com/guid/3b966b89-2f2c-4294-aa13-8c65f137c705",
  "pubDate": "Thu, 21 Apr 2022 06:30:00 -0000",
  "itunes:duration": "00:44:16",
  "description": "<p>Drug scandals are unfortunately notorious in sports, as the Beijing Winter Olympics so recently illustrated with its flashbacks to the vast Russian doping scandal of the 2014 Sochi Games. These doping issues have cheated many clean athletes out of their rightful medals and can take several Olympic cycles to sort out, leaving the true champions in the shadow of the doper and their scandal. Today’s guest, Allison Wagner, has very personal experience with this issue and is now in a place to start making effective changes in sport for athletes. Allison is an Olympic silver medalist, a three-time World silver medalist, a thirteen-time national champion, and even held a world record in swimming for over fourteen years. On several occasions, Allison was beaten in major championships by swimmers who are highly suspected or have proven to be users of banned performance-enhancing substances. She now works for the US Anti-Doping Agency (USADA) as their first Director of Athlete and International Relations. On today’s podcast, Allison shares her story and gives us a basic understanding of how the drug testing process works and our rights as athletes. We also dig into the Russian doping scandal that started way back in 2014 and what we can do as athletes and coaches to affect change.</p>\n<p>Allison begins the episode with a rundown of her history as an athlete and her personal experience competing against dopers. She shares the frustration of not being protected by those in positions of power and influence and how that led to her current position working for USADA, where she’s committed to driving changes in the global anti-doping system. Allison then gives some advice for current athletes on what to do if they find themselves up against dopers and an overview of how doping controls function, including the requirements enforced by the Whereabouts System. She also explains what rights athletes have to appeal in the event they miss a test or receive a positive result. The conversation then switches gears to discuss the Russian doping scandal at the 2014 Winter Olympics in Sochi, the failure to effectively punish those involved, and the negative impact that has had on trust in governing bodies in sport. Alison points out that there are still major issues regarding trust and transparency in sports governance, as highlighted recently with the Kamila Valieva scandal at the 2022 Beijing Games, and calls out the lack of concern and acknowledgment for the harm done to the clean athletes competing against Valieva. She calls for those in positions of power to speak up and take action and suggests ways that athletes can push for change by speaking to their sponsors and representatives, emphasizing that communication is key to making those in power take notice and change their priorities.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>Allison’s history as an athlete</li>\n<li>Competing against dopers as a clean athlete</li>\n<li>Allison’s advice for current athletes on dealing with dopers</li>\n<li>How doping controls work</li>\n<li>Athletes’ right to appeal</li>\n<li>Turnaround times for sample analysis</li>\n<li>The Russian doping scandal at Sochi and its influence</li>\n<li>Issues of trust and transparency in sports governance</li>\n<li>The Kamila Valieva scandal</li>\n<li>How and where change can happen</li>\n<li>Speaking truth from positions of power</li>\n<li>How athletes can push for change</li>\n</ul>\n<p>Quotes:</p>\n<ul>\n<li>“Over the years, these doping issues have become front and center in the news to the detriment of the clean athletes. Sometimes, several Olympic cycles will pass before athletes are even found to have cheated, and the clean athletes are finally awarded their rightful medals and place on the podium. But that’s long after the world has forgotten about the event and moved on, leaving the true champions forever in the shadows of the doper and their scandal.”</li>\n<li>“That experience, for me, was gradually and more increasingly frustrating and defeating. You know, realizing that my devotion to respecting the rules and a fair playing field and respecting my competitors, you know, that devotion wasn’t being protected by those people in positions of power and influence.”</li>\n<li>“This is how things change, if people get engaged and involved. While there’s a lot of room for improvement in terms of how athletes have or don’t have power, decision-making power in sport-governance structures, I think it only helps if athletes can engage.”</li>\n<li>“I had a DCO once accompany me to a theater show. I had just emptied my bladder, and I had tickets to this show. And so, they just came with me. So I could, like, provide a sample again.”</li>\n<li>“I think that it’s pretty unfair as an athlete to have to compete against a system that wasn’t effectively sanctioned. And what we see now is that I don’t think anybody’s really confident that they’ve not been coordinating doping amongst their athletes. And that any punishment, or the lack of punishment basically, has led us to where we are today.”</li>\n<li>“It’s unfair to everybody. It’s unfair to the Olympic Games and the Olympic system overall. You know, people lost confidence in the Olympic Games being clean, they lost confidence that there would be bold action taken in response to the state-sponsored doping that was proved.”</li>\n<li>“What was concerning to me as well was that there was no acknowledgment for the irreparable harm to the clean athletes in competition, as well. So it was all focused on the harm to Kamila, but what about the harm to the clean athletes and also the sport and the Olympic Games?”</li>\n<li>“The Olympics in LA in 2028 are going to be a great opportunity for the US to assert concerns and create a new stage for the Olympics that is more dedicated to protecting athletes—clean athletes and athletes in general—from injustices.”</li>\n<li>“The Olympic spirit, as we know, and the Olympic values are a cherished part of the Olympic movement, I think by everybody, but they’re not being sufficiently protected. And the Olympic Games are not being, and the Paralympic Games are not being sufficiently protected.”</li>\n<li>“Speaking truth is something that takes, you know, courage and boldness, and it’s to be respected and supported. And I think we need more people doing that.”</li>\n<li>“I’m just trying to find a way to change this, you know, I don’t want to just leave it the way it is. I love sports, and I want it to be this awesome thing for my kids coming up, for the next generations coming up. I want it to be this beautiful thing that made us fight for things and want to be these amazing people, you know, in this pure, beautiful way.”</li>\n<li>“What I’m hearing is the moral of the story is we just can’t stop pushing. I guess we just need to be this consistent drumbeat where we just don’t let it go.”</li>\n<li>“I’ve experienced the downsides of sports. And I am happy to keep any concerns confidential. And there will be no selling out on my behalf. Because I just, you know, I paid too high of a cost personally, for what I experienced in sport, to take anything lightly. Most especially confidence.”</li>\n<li>“We need to start speaking up. We are courageous athletes, we need to be courageous people as well, you know, outside of our arena, outside of the sport, when it has to do with these things like our sport that we love.”</li>\n<li>“The conversations I have with people from the IOC, WADA, and other sport-governance people is that they just have no idea. You know, they’re living in this bubble of unicorns and rainbows, and that is not in touch with the reality of how athletes fight their way through their careers oftentimes. And athletes need more support in lots of ways, and they need more advocates.”</li>\n</ul>\n<p><a href=\"https://www.kaatsu.com/go/PURSUIT\" rel=\"nofollow\">Pursuit of Gold Podcast is brought to you by Kaatsu Global</a><a href=\"https://kaatsu.com/\" rel=\"nofollow\">.</a></p>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold</a>\n<a href=\"https://www.laurawilkinson.com/journal\" rel=\"nofollow\">The Confidence Journal</a>\n<a href=\"https://www.amazon.com/Life-10-Meters-Lessons-Champion/dp/B096CQW2L7/ref=sr_1_3?crid=2AXVGI3HL987J&dchild=1&keywords=laura+wilkinson+life+at+10+meters&qid=1624113646&sprefix=Laura+Wilkinson%2Caps%2C227&sr=8-3\" rel=\"nofollow\">Life at 10 Meters: Lessons from an Olympic Champion</a>\n<a href=\"http://laurawilkinson.com/shop\" rel=\"nofollow\">Laura Wilkinson Designs- Shop</a>\n<a href=\"http://laurawilkinson.com/coffee\" rel=\"nofollow\">Buy Laura a Coffee</a></p>\n<p>Laura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura’s Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura’s Facebook</a></p>\n<p>Allison’s Contact Info:\nAllison’s email: awagner@usada.org\nAllison’s phone number: 802-380-0688</p>",
  "itunes:title": "The State of Doping in Sports with Olympic Medalist and USADA Director Allison Wagner",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 61
}