{
  "id": "https://bibleinoneyear.org/en/youth/129",
  "title": "Day 129: How to Reap Far More Than You Sow",
  "description": "Psalm 58:11, Judges 9:56–57a, John 6:8–9,11–13,16-20.  ‘For years, we have this friendship in which he comes to lunch and I do my best to make him very happy, and he is always good to me in return  So of course I say, “Don&#039;t worry – I can give you a kidney",
  "pubDate": "Mon, 09 May 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/129/",
  "itunes:duration": "13:26",
  "guid": "enyouth09052022-129",
  "length": 806.5,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 129: How to Reap Far More Than You Sow",
  "itunes:subtitle": "Psalm 58:11, Judges 9:56–57a, John 6:8–9,11–13,16-20.  ‘For years, we have this friendship in which he comes to lunch and I do my best to make him very happy, and he is always good to me in return  So of course I say, “Don&#039;t worry – I can give you a kidney",
  "itunes:summary": "Walter Nishioka knew that the service was good at the Hawaiian hotel where he ate brunch on Wednesdays. But he found out just how good it was when he was offered something that was definitely not on the menu – one of the waiter’s own kidneys.\nMr Nishioka, aged seventy, was a local businessman. He was seriously ill with kidney disease and had been told by doctors that he needed a transplant urgently. He had almost given up hope of finding a matching donor until the waiter, Jose Rocasa, fifty-two, volunteered one of his own. Nishioka said, ‘I didn&#039;t have long to survive and the doctors said that it was unlikely that they could find a match in time. But with this good man here and a lot of help from above, now I am alive and well.’\nIn the twenty-two years that Mr Nishioka had frequented the hotel, Jose Rocasa had been his waiter, and recalled that he had always been kind and affable – and had tipped generously. ‘I just wanted to help him,’ he said. ‘For years, we have this friendship in which he comes to lunch and I do my best to make him very happy, and he is always good to me in return. So of course I say, “Don&#039;t worry – I can give you a kidney.”’\nMr Nishioka sowed generosity and he reaped generosity!\nToday, we see that:\n\nYou reap what you sow\nYou reap later than you sow\nYou reap more than you sow",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 494
}