{
  "title": "Observational Signatures of Frame Dragging in Strong Gravity. (arXiv:2211.01810v1 [gr-qc])",
  "link": "http://arxiv.org/abs/2211.01810",
  "description": "<p>Objects orbiting in the presence of a rotating massive body experience a\ngravitomagnetic frame-dragging effect, known as the Lense-Thirring effect, that\nhas been experimentally confirmed in the weak-field limit. In the strong-field\nlimit, near the horizon of a rotating black hole, frame dragging becomes so\nextreme that all objects must co-rotate with the black hole's angular momentum.\nIn this work, we perform general relativistic numerical simulations to identify\nobservable signatures of frame dragging in the strong-field limit that appear\nwhen infalling gas is forced to flip its direction of rotation as it is being\naccreted. In total intensity images, infalling streams exhibit \"S\"-shaped\nfeatures due to the switch in the tangential velocity. In linear polarization,\na flip in the handedness of spatially resolved polarization ticks as a function\nof radius encodes a transition in the magnetic field geometry that occurs due\nto magnetic flux freezing in the dragged plasma. Using a network of telescopes\naround the world, the Event Horizon Telescope collaboration has demonstrated\nthat it is now possible to directly image black holes on event horizon scales.\nWe show that the phenomena described in this work would be accessible to the\nnext-generation Event Horizon Telescope (ngEHT) and extensions of the array\ninto space, which would produce spatially resolved images on event horizon\nscales with higher spatial resolution and dynamic range.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/gr-qc/1/au:+Ricarte_A/0/1/0/all/0/1\">Angelo Ricarte</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Palumbo_D/0/1/0/all/0/1\">Daniel C. M. Palumbo</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Narayan_R/0/1/0/all/0/1\">Ramesh Narayan</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Roelofs_F/0/1/0/all/0/1\">Freek Roelofs</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Emami_R/0/1/0/all/0/1\">Razieh Emami</a>"
}