{
  "title": "From the FBI to Google Cloud, meet CISO Director MK Palmore",
  "link": "https://cloud.google.com/blog/topics/inside-google-cloud/meet-the-people-of-google-cloud-mk-palmore/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p><i><b>Editor's note</b>: MK Palmore is a director in Google Cloud's Office of the Chief Information Security Officer, or CISO, a group that works with private- and public-sector organizations to understand and guard against cybersecurity threats. He came to Google Cloud  in 2021 from Palo Alto Networks, which he joined following three decades in the Marines and the FBI.</i></p><hr/><p><b>Do you see a common thread in your career?</b></p><p>I've always wanted to be a part of something bigger than myself. I grew up in Washington, D.C., where I rode the Metro bus daily and had a front row seat to the monuments, democracy, and freedom. When I was a senior in high school, I only applied to two schools – the United States Naval Academy at Annapolis, and West Point. I was accepted into both, but chose the Naval Academy, in part, because it was the more difficult school to get into. </p><p>I became a Marine Captain, then joined the FBI, where I worked closely on cases related to bank robberies, domestic terrorism, and hate crimes. After I moved from Los Angeles to the Sacramento Division of the FBI, I became involved with cybersecurity. I started looking at how terrorists were using the Internet to recruit, propagandize, and take action. That experience opened the door to working with technology that was constantly evolving, and I was challenged to learn many new things. </p><hr/><p><b>That must have been a change of gears.</b></p><p>The FBI recognized that many employees need to get up to speed digitally, so it allowed us to take as many related courses as we wanted to achieve that. As a result, I secured a <a href=\"https://www.isc2.org/Certifications/CISSP#\" target=\"_blank\">CISSP</a>—a pretty advanced cybersecurity qualification—which allowed me to lead multiple teams that were working on national security and cybercriminal cases. In that position, I enjoyed working directly with several CISOs and cybersecurity boards.</p><hr/><p><b>What's the biggest challenge moving from government to the private sector?</b></p><p>When joining the private sector, many government superstars have a tough time layering in an understanding of business and its complexity into their work. My first role in the private sector allowed me the opportunity to get in front of customers as a representative of the business, which gave me a different perspective on how to help companies achieve their cybersecurity goals. Customers have a lot to manage — technology and budget constraints, staffing, dependencies with suppliers, partners, customers, and keeping information flowing while maintaining the best security posture. Observing this definitely increased my empathy for the customer journey.</p><hr/><p><b>Why Google Cloud?</b></p><p>Google Cloud is in the business of tackling hard problems, and I love how much of the threat landscape we take on. Both public and private sector organizations can benefit from Google Cloud’s vision and capabilities. </p><hr/><p><b>How does the culture here compare with the FBI?</b></p><p>At Google Cloud, there's a willingness to be engaged with tough problems beyond what I've seen at any other organization—nobody here wants moss growing under their feet. I'm constantly talking to and surrounded by thoughtful people who are building new things, and I think the customers appreciate that. They want to know how Google thinks about problems and protects itself, because that's the start of how we'll protect them.</p></div></div><div class=\"block-pull_quote\"><div class=\"uni-pull-quote h-c-page\"><section class=\"h-c-grid\"><div class=\"uni-pull-quote__wrapper h-c-grid__col h-c-grid__col--8 h-c-grid__col-m--6 h-c-grid__col-l--6 h-c-grid__col--offset-2 h-c-grid__col-m--offset-3 h-c-grid__col-l--offset-3\"><div class=\"uni-pull-quote__inner-wrapper h-c-copy h-c-copy\"><q class=\"uni-pull-quote__text\">They want to know how Google thinks about problems and protects itself, because that's the start of how we'll protect them.</q></div></div></section></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><hr/><p><b>You say you like a challenge. What's next?</b></p><p>I spend a fair amount of time advocating for Diversity, Equity, and Inclusion in the cybersecurity space. We're better thinkers about solutions when we bring in diverse perspectives, but I've been struck by how much the security sector is a monoculture in appearance, and sometimes in thinking. In my own case, the odds that I was accepted into the Naval Academy or FBI were about as high as the odds of being an African-American in this field—odds that aren’t very high.</p><p>I'm on the board of directors of a nonprofit in this space and am always advocating inside of Google Cloud. People think a Black female CISO is a unicorn, but I know several who are technically sound and would be highly capable in that role. They just need the opportunity to share their talent and skills. Helping to nuture that talent is why I want to start focusing on being an executive recruiter and talent-spotter of women and people of color who have the capabilities to take our industry to the next level.</p></div></div><div class=\"block-related_article_tout\"><div class=\"uni-related-article-tout h-c-page\"><section class=\"h-c-grid\"><a class=\"uni-related-article-tout__wrapper h-c-grid__col h-c-grid__col--8 h-c-grid__col-m--6 h-c-grid__col-l--6 h-c-grid__col--offset-2 h-c-grid__col-m--offset-3 h-c-grid__col-l--offset-3 uni-click-tracker\" data-analytics='{\n                       \"event\": \"page interaction\",\n                       \"category\": \"article lead\",\n                       \"action\": \"related article - inline\",\n                       \"label\": \"article: {slug}\"\n                     }' href=\"https://gweb-cloudblog-publish.appspot.com/topics/inside-google-cloud/meet-the-people-of-google-cloud-cloud-anella-bokhari/\"><div class=\"uni-related-article-tout__inner-wrapper\"><p class=\"uni-related-article-tout__eyebrow h-c-eyebrow\">Related Article</p><div class=\"uni-related-article-tout__content-wrapper\"><div class=\"uni-related-article-tout__image-wrapper\"><div class=\"uni-related-article-tout__image\" style=\"background-image: url('https://storage.googleapis.com/gweb-cloudblog-publish/images/Anella_Bokhari.max-500x500.jpg')\"></div></div><div class=\"uni-related-article-tout__content\"><h4 class=\"uni-related-article-tout__header h-has-bottom-margin\">Sales specialist, mentor, and woman in Web3: Anella Bokhari is building community and helping others tell their story along the way</h4><p class=\"uni-related-article-tout__body\">Sales Specialist, Mentor, and Woman in Web3: Anella Bokhari Wears Many Hats But Has the Same “Why” – Helping Others Find &amp; Tell Their Sto...</p><div class=\"cta module-cta h-c-copy uni-related-article-tout__cta muted\"><span class=\"nowrap\">Read Article<svg class=\"icon h-c-icon\" role=\"presentation\"><use xlink:href=\"#mi-arrow-forward\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"></use></svg></span></div></div></div></div></a></section></div></div></body></html>",
  "pubDate": "Thu, 03 Nov 2022 16:00:00 -0000",
  "guid": "https://cloud.google.com/blog/topics/inside-google-cloud/meet-the-people-of-google-cloud-mk-palmore/",
  "category": [
    "Identity & Security",
    "Inside Google Cloud"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "From the FBI to Google Cloud, meet CISO Director MK Palmore",
    "description": "Office of the CISO Director MK Palmore on his transition from government to private sector, his next big challenge, and diversifying cybersecurity.",
    "image": "https://storage.googleapis.com/gweb-cloudblog-publish/images/MK_Palmore.max-600x600.jpg",
    "site_name": "Google",
    "url": "https://cloud.google.com/blog/topics/inside-google-cloud/meet-the-people-of-google-cloud-mk-palmore/"
  },
  "author": {
    "name": "Google Cloud Content & Editorial",
    "title": "",
    "department": "",
    "company": ""
  }
}