{
  "title": "#450: Weekend at Hogwarts (OOTP 14, 'Percy and Padfoot')",
  "link": "https://audioboom.com/posts/7483103",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5043,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Micah's back and FINALLY received a Wizarding World Gold pin!</li>\n<li>Muggle Mail covers Founder wands, House points, SPEW and Harry Potter tattoos</li>\n<li>Chapter-by-Chapter continues with Order of the Phoenix - Chapter 14: Percy and Padfoot</li>\n<li>7-Word Summary: Saturday begins with letter sending from Harry</li>\n<li>Harry does a really good job of hiding the truth when writing to Sirius. Do we think this a quality that Harry possesses or just JKR’s clever writing?</li>\n<li>The hosts take a shot at cryptically describing each other</li>\n<li>Thestrals Alert! If we were Harry, would we be concerned we’re seeing ominous creatures randomly around Hogwarts? We compare it to the grim in Book 3 and the basilisk in Book 2!</li>\n<li>The hosts discuss what it means for Cho to believe in Harry</li>\n<li>The Daily Prophet: Padfoot and Podmore</li>\n<li>Why was Slytherin allowed to watch Gryffindor’s Quidditch practice? Shouldn’t it be closed, especially to opposing teams?</li>\n<li>Percy's letter: what does it reveal about the Ministry? About his true character? We read several of Percy's passages in our best Dr. Evil voices!</li>\n<li>Does Percy truly believe Dolores Umbridge is a nice person? Do we think he is really concerned about Ron? Or is this an attempt by Fudge and Umbridge to sow discord between Ron and Harry?</li>\n<li>Which Fireplace Sirius was better: Goblet of Fire or Order of the Phoenix?</li>\n<li>The world isn't split into good people and Death Eaters</li>\n<li>The Ministry believes Dumbledore is forming an Army!</li>\n<li>Reckless and bitter Sirius: do his comments about James hurt Harry?</li>\n<li>Umbridge Suck Count, Connecting The Threads, MVP of the Week and Rename The Chapter</li>\n<li>Quizzitch: Professor McGonagall has been teaching at Hogwarts for how many years (at the time of Order of the Phoenix)?</li>\n<li>This week's episode is sponsored by OpenFit, a fantastic way to workout at home at great prices! Text 'mugglecast' to 505050 to get a free two-week trial.</li>\n</ul>\n<div><br>\n</div>\n<div><br>\n</div>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 21 Jan 2020 12:00:00 +0000",
  "guid": "tag:audioboom.com,2020-01-20:/posts/7483103",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}