{
  "id": "tag:blogger.com,1999:blog-24784288.post-8556161725729867920",
  "published": "2022-02-25T21:59:00.000-05:00",
  "updated": "2022-02-25T21:59:33.465-05:00",
  "title": "My Heart is Breaking",
  "content": "<p>I was born in New Jersey, grew up in New Jersey, and have spent most of adult life in Massachusetts, but I have always felt a kinship with Ukraine. All four of my grandparents were born there. They left as teenagers early in the 20th century, before World War I and the Russian Revolution made a return to their homeland untenable.&nbsp;</p><p>I grew up attending a Ukrainian Orthodox Church. Every week, we would pray for a free Ukraine, independent of the Soviet Union. As a snarky, know-it-all teenager, I rolled my eyes, thinking the idea preposterous.</p><p>My family celebrated Ukrainian Christmas on January 7 every year. We ate Ukrainian food.&nbsp; My parents sent me to Ukrainian School to learn the language (though the effort was unsuccessful, as I have never been a good student of languages). At Easter, my family made Pysanky, Ukrainian Easter Eggs. Below is a picture of a bowl of these eggs that to this day sit in my home study.&nbsp;</p><p><table cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto; text-align: center;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/a/AVvXsEh_BuAjutB0RTaDDGFH8lV6hjucUNL_eK9eCbqMy-0OtPFsS9jRUTaDL5ZhWq-3Yr-AoWrDpXwv3z9NmH0mB3fiVlXKJHLhvLTZhkX9c1eGAxHYt78Ax6-hCix37cqCTTOsylBffvsyC49l5Rs_yZljonR2A9uuIYmuC2bDX03X8x6581qsUg=s4032\" imageanchor=\"1\" style=\"clear: left; margin-bottom: 1em; margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"4032\" data-original-width=\"3024\" height=\"400\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEh_BuAjutB0RTaDDGFH8lV6hjucUNL_eK9eCbqMy-0OtPFsS9jRUTaDL5ZhWq-3Yr-AoWrDpXwv3z9NmH0mB3fiVlXKJHLhvLTZhkX9c1eGAxHYt78Ax6-hCix37cqCTTOsylBffvsyC49l5Rs_yZljonR2A9uuIYmuC2bDX03X8x6581qsUg=w300-h400\" width=\"300\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\"></td></tr></tbody></table>I have visited Ukraine only once, when my intermediate macroeconomics textbook was translated in Ukrainian and I was invited to give a series of lectures. I took <a href=\"http://gregmankiw.blogspot.com/2020/04/dorothy-theresa-sawchak-mankiw.html\" target=\"_blank\">my mother</a> on the trip. She was then in her 60s, and she was visiting the land of her parents' birth for the first and only time. The two of us spent about 10 days there, mostly in Kyiv.</p><p>As I have watched recent events unfold, I cannot help but feel endless sadness. I am sure that I have distant relatives there. When I was a child, my grandmother corresponded with her family in Ukraine. This occurred during the days of the Soviet Union, and she would send them blankets and other basic supplies. Never money, because she feared it would never make it. After she died, this connection to our relatives was lost to history.</p><p>I will not comment on the Biden administration response to this crisis. I have no expertise in foreign policy, and I know that the tradeoffs involved are too complex for me to fully comprehend. But I pray that our leaders have the courage and wherewithal to do the right thing. For the long haul. For humanity.</p>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Greg Mankiw",
    "uri": "http://www.blogger.com/profile/18161221774770492266",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}