{
  "title": "#441: Brian? (OOTP Chapter 8, The Hearing)",
  "link": "https://audioboom.com/posts/7414333",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4636,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Mike from Potterless Podcast joins the show! He shares why he got into the series so late and some of the moments that shocked him the most.</li>\n<li>Chapter-by-Chapter continues with Order of the Phoenix, Chapter 8 - The Hearing</li>\n<li>7-Word Summary: Harry is attacked by Fudge but Dumbledore prevails</li>\n<li>Have any of us ever been before a judge?</li>\n<li>Given Harry is being charged with UNDERAGE magic, isn’t it ridiculous an adult can’t accompany him to trial?</li>\n<li>Where exactly was Harry’s owl sent? Was it even sent at all?</li>\n<li>We’re introduced to Fudge’s “right-hand“ woman... Dolores Jane Umbridge!</li>\n<li>Why do we think Dumbledore arrived at the Ministry three hours early?</li>\n<li>Given the number of people required for this trial, there is no way the time and location wasn’t changed at least the night prior!</li>\n<li>By changing the time, is the Ministry hoping Harry would need to use magic, getting him into further trouble?</li>\n<li>Is Ms. Figg a credible witness? We debate if she really saw the Dementors!</li>\n<li>Dumbledore makes Fudge SUPER uncomfortable!</li>\n<li>Who really sent the Dementors? Voldemort? The Ministry?</li>\n<li>Do we think Fudge made the decision to implement Umbridge at Hogwarts before or after the trial?</li>\n<li>Would Harry have prevailed without Dumbledore present?</li>\n<li>What’s up with Harry’s heart swelling to unnatural size?</li>\n<li>This could have all been solved with a little bit of Veritaserum! </li>\n<li>The Umbridge sucks count grows by 2!</li>\n<li>We Connect The Threads, Rename The Chapter and give our MVPs of the Week</li>\n<li>Quizzitch: What nickname does Malfoy give Harry while at the Ministry?</li>\n<li>Join our community at <a href=\"http://Patreon.com/MuggleCast\">Patreon.com/MuggleCast</a> and receive magical benefits, including early access to the show via our live streams!</li>\n<li>Thanks to this week's sponsor: Wondery's <a href=\"https://wondery.com/shows/bad-batch/\">new podcast Bad Batch</a>, an investigative series. </li>\n</ul>\n",
  "pubDate": "Mon, 04 Nov 2019 18:55:19 +0000",
  "guid": "tag:audioboom.com,2019-11-04:/posts/7414333",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}