{
  "title": "Algo Hour - Large Scale Data & ML Monitoring with whylogs | Alessya Visnjic",
  "description": "<h3 id=\"title\">Title:</h3>\n\n<p>Large Scale Data &amp; ML Monitoring with whylogs</p>\n\n<h3 id=\"talk-abstract\">Talk Abstract:</h3>\n\n<p><img src=\"https://external-preview.redd.it/5PGoA8K2MVCIC_h7k-H0OArTtADCLNhye8fFBcfk-lM.jpg?auto=webp&amp;s=3764d7449d4475306f15278752a033cdd72d8cf7\" alt=\"whylogs\" />\nIn the era of microservices, decentralized ML architectures and complex data pipelines, data quality has become a bigger challenge than ever. When data is involved in complex business processes and decisions, bad data can, and will, affect the bottom line. As a result, ensuring data quality across the entire ML pipeline is both costly, and cumbersome while data monitoring is often fragmented and performed ad hoc. An open source library called <a href=\"https://github.com/whylabs/whylogs\">whylogs</a> is built to address these challenges. It is a lightweight data profiling library that enables end-to-end data monitoring across the entire software stack. The library implements a language and platform agnostic approach to data quality and data monitoring. It’s been deployed at massive-scale data environments, on structured and unstructured data modalities, and across a range of points in the ML lifecycle. In this talk, we will provide an overview of the whylogs architecture, including its lightweight statistical data collection approach and we will show how users can apply this library to existing data and ML pipelines.</p>\n\n<h3 id=\"date-and-time\">Date and Time:</h3>\n\n<p>The talk will be held on Tuesday, October 11th at 1:00PM PDT.</p>\n\n<h3 id=\"recording-info\">Recording Info:</h3>\n<p>This talk was recorded live and is viewable below:</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/UK2b1pG1xbo\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n\n<h3 id=\"speaker-info\">Speaker Info:</h3>\n\n<p>Alessya Visnjic is the CEO of WhyLabs, the AI Observability company building tools that power robust and responsible AI deployment. Prior to WhyLabs, Alessya was a CTO-in-residence at the Allen Institute for AI, where she evaluated commercial potential for the latest AI research. Earlier, Alessya spent 9 years at Amazon leading ML initiatives, including forecasting and data science platforms. Alessya is also the founder of Rsqrd AI, a global community of 1,000+ AI practitioners who are committed to making enterprise AI technology responsible.</p>",
  "pubDate": "Thu, 29 Sep 2022 09:00:00 +0000",
  "link": "https://multithreaded.stitchfix.com/blog/2022/09/29/alessya-algo-hour-announcement/",
  "guid": "https://multithreaded.stitchfix.com/blog/2022/09/29/alessya-algo-hour-announcement/"
}