{
  "title": "Space Debris, Governance, and the Economics of Space with Alex Salter",
  "pubDate": "Sat, 05 Nov 2016 06:09:00 +0000",
  "guid": "6082995903f4f1074e09584483519813",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EpSalter_EDR.mp3",
  "itunes:image": "",
  "description": "<p>What follows is an edited transcript of my interview with Alex Salter about the economics of space. The first half deals primarily with the issue of space debris, while the second half deals with the possibility of private governance in space. There's something in this episode for everyone to enjoy, so I hope you'll listen, read, and share it with your friends.</p> <hr /> <p><strong>Petersen:</strong> My guest today is <a href= \"http://www.awsalter.com/\" target=\"_blank\">Alex Salter</a> of Texas Tech University. Alex, welcome to Economics Detective Radio.</p> <p><strong>Salter:</strong> Thanks very much for having me.</p> <p><strong>Petersen:</strong> Our topic today is the economics of space. Alex has written two papers on the subject. The first is entitled, <a href= \"https://journals.law.stanford.edu/sites/default/files/stanford-technology-law-review/print/2016/04/19-2-2-salter-final_0.pdf\" target=\"_blank\">\"Space Debris: A Law and Economics Analysis of the Orbital Commons.\"</a> The second is, <a href= \"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2840856\" target=\"_blank\">\"Ordering the Cosmos: Private Law and Celestial Property Rights.\"</a></p> <p>So Alex, let's start by talking about space debris. What is it and why does it matter?</p> <p><strong>Salter:</strong> So space debris is basically junk in space that no longer serves any useful purpose. So as you can imagine, since the first piece of space debris launched up in 1957---which was the rocket body from Sputnik I---a lot of orbits around the Earth, especially low Earth orbit, have become kind of cluttered with space junk. And the reason it gets cluttered is because no one has an incentive to clean it up.</p> <p>It's a problem because a lot of this stuff is big enough and moving fast enough that if it strikes something like a communications satellite, it can take it out. So the probability of a collision right now that will cause serious damage is currently low, but there are a lot of worries among scientists who study the problem that as debris occasionally collides with more debris, you get a sort of snowballing effect of the clutter. So if we're going to get a handle on it, it needs to be earlier rather than later.</p> <p><strong>Petersen:</strong> I think intuitively it seems like the sky is so big and satellites are so small that we'd never have to worry about collisions. So why is that not the case?</p> <p><strong>Salter:</strong> So there's obviously quite a bit of room up there, but the problem is that some orbits are more valuable than others. In particular, geosynchronous orbit, which is I think 36 thousand kilometers above the Earth, is a really valuable place for specific satellites. And also low Earth orbit is a valuable place for specific satellites. Now, there's still a lot of room there, but it's significantly restricted. If my communications satellite is taking up a particular orbit, your satellite can't be in the same place. So there's only so much of it to go around, and again, what we're really worried about is debris colliding with something, which creates more debris, which can collide with more stuff. We're really worried that snowball effect, which is sometimes called the Kessler syndrome after the scientist who first wrote about it.</p> <p><strong>Petersen:</strong> So the odds of a single collision might be low, but given one collision, it becomes much more likely that we'll have two and three and four---a chain reaction of collisions.</p> <p><strong>Salter:</strong> Exactly. So right now the probability of collision is pretty low over the life of a satellite, for example in low Earth orbit, it's no more than one in a thousand. But conditional on getting hit, that can cause a pretty serious business disruption and economic losses, and as you said, given that one increases the likelihood of all future collisions, it's kind of like a positive feedback loop. So that can get pretty nasty pretty quick.</p> <p><strong>Petersen:</strong> Have there been any collisions in the past?</p> <p><strong>Salter:</strong> There have been many collisions in the past. I think the most notable one was actually intentional. In 2007, China performed an anti-satellite test, where it purposefully took out one of its old satellites that was no longer useful. And it created, I think, about a hundred and fifty thousand new pieces of space debris with that one anti-satellite test. So I'm not aware of any instances of grave, private sector disruptions caused by space debris collisions, but honestly unless there's some means of cleaning this stuff up or it de-orbits on its own, it really is only a matter of time.</p> <p><strong>Petersen:</strong> So, you make a distinction in the paper between access to orbit and particular orbits. Can you explain what those are?</p> <p><strong>Salter:</strong> Right. So access to orbit is basically getting your payload up into space. If you have a communications satellite, it's getting it to the orbit you want. And economically that has the characteristics of a public good. The standard definition of a public good in economics is anything that we like which is not rivalrous in consumption and non-excludable. So if I consume one more unit of it, that doesn't stop you from consuming more. And also non-excludable, the second part, means it's costly or very difficult for me to stop other people from enjoying that. So both of those characteristics fit getting a satellite into your desired orbit---going through space to get to where you want to go.</p> <p>Once your satellite is in position though, a particular orbit has the properties of what we call a common-pool resource. It's rivalrous---if I have it you can't also have it---but it's also non-excludable. I can't really stop you from using it. As orthodox public finance theory will tell you, sometimes the provision of those goods, public goods and common-pool resources, are difficult because if they're non-excludable you can't stop people from enjoying the benefits and so that limits the incentive for producers to make the stuff in the first place.</p> <p><strong>Petersen:</strong> Right, so in order to prevent someone from launching a satellite into your orbit, you'd have to somehow police every potential launch site on the globe, which of course we can't do. And that's what makes it [non-excludable].</p> <p><strong>Salter:</strong> It's incredibly expensive and therefore not really feasible.</p> <p><strong>Petersen:</strong> Right, so from reading your paper I know other researchers have looked at this problem and they suggested taxing people who create space debris. So do you want to comment on that suggestion, and maybe what are the pros and cons of taking that approach?</p> <p><strong>Salter:</strong> Sure. Let me first start by saying that the case for a corrective tax here stems from the fact that we have a common-pool resources problem, or a public goods problem. Nobody owns orbit, and so nobody really has an incentive to worry about how clean it is. If I'm launching a communications satellite, I don't really worry that I'm also imposing a cost on other potential launchers with my useless rocket body. So if everyone thinks that way, then the debris problem becomes unmanageable. So there is a textbook rationale for some correction to what we call this external cost in economics. Because nobody owns orbit or access to orbit, nobody has an incentive to care for it or clean it up. At least not as much as we would like.</p> <p>So the argument for a corrective tax is basically, we want to bring the private costs of polluting space more in line with the social costs of polluting space. So if you tax a polluter, someone who's contributing to space debris, you raise the expensiveness of creating debris. And as economic theory will tell you, when something gets more expensive, all else being equal, people will do less of it. That's the theoretical argument for what's called a Pigouvian or corrective tax.</p> <p>The problem here---and this is not specific to space debris, this is specific to all taxes correcting external cost problems---is that you don't really know how big to make the tax in order to get to the efficient amount of pollution mitigation. And even if you did, you have to take political economy considerations into concern. Corrective taxes are not run and operated by benevolent social planners. They're typically run and operated by bureaucracies, and bureaucrats have their own incentives to which they respond. And the incentives facing politicians and bureaucrats may not be the same as incentives for contributing to social efficiency or maximal wellbeing.</p> <p><strong>Petersen:</strong> Right, so we might worry that the body that determines the tax on potentially space-junk-producing private actors might be less concerned with the externality and more concerned with their own revenue and so set the tax not at the social-welfare-maximizing point but at the revenue-maximizing point.</p> <p><strong>Salter:</strong> Right, that's one potential worry with that sort of a solution. Again I want to emphasize, though, that's in the abstract. It's still very very difficult---in fact I would even say impossible---to know what the right size of the tax should be. I think that there is an inherent knowledge problem that sometimes gets overlooked at the expense of the incentive problem that you just talked about. Both are very important, and they're related, and they complement each other in terms of the critique, but they are distinct problems. And public policy has to be able to present credible solutions to both of those problems if we're going to argue that a corrective tax would improve social welfare.</p> <p><strong>Petersen:</strong> Right, so you launch a satellite, maybe you leave a piece of large debris like a rocket body, but you also create a risk that the satellite will explode or be hit by something and create a snowball effect of more debris. It's really hard to compute the net cost because you not only need to know how likely is it to create more debris and how likely is that debris to impact something. You also need to know the value of the future satellites the debris might impact, which means forecasting the future of space and the future of the economy and all these things into the deep future. Have other researchers at least tried to tackle this problem? Are there some attempts?</p> <p><strong>Salter:</strong> There have been some attempts, and as you noted, any estimate is going to be very imprecise because there's a lot of variables moving in the background. But you could look at scientific studies that estimate the damage to useful communications satellite or other valuable space equipment from a collision can range anywhere from 20 to 200 million. That's a reasonable interval for estimating the damages if you count not just the initial collision but also the potential snowballing which can destroy other things.</p> <p>And you can also look at what private companies are doing right now to get an appreciation of the magnitude of the problem. For example, if you're a communications satellite launcher you can buy insurance for your communications satellite. In 2011, market premiums for these kinds of space risks totalled about 800 million dollars. And also in 2011 there were about 600 million in claimed damages. So private actors are spending a lot to insure themselves against risks such as these and that in combination with some of the scientific studies can help build your intuition for understanding that we're talking about a lot of money here: a stream of valuable services into the future which can be risked by space debris.</p> <p><strong>Petersen:</strong> So we do have a ballpark estimate, but nothing so precise that we could set an optimal Pigouvian tax even if we had a government that was benevolent enough to try to reach that optimum. So in your paper you suggest alternatives to the Pigouvian route. In particular you suggest potential private solutions. So what private solutions are there to reduce the creation of space debris?</p> <p><strong>Salter:</strong> That's a really interesting question because the standard response that economists would give to externality problems seems impractical here. Usually when you have an externality problem, a public goods problem, the solution is to create property rights. Property rights align incentives so if we create property rights to a common pool resource, that will cause people to take better account of the effects of their behaviour on others. But how do you really create a property right to something like an orbit? Is it a specific volume of space? How big is it? Under what conditions can somebody else move through it when your satellite is not in that orbit?</p> <p>I think in this case we have to take seriously the idea that creating property rights to orbit and to access to orbit is simply too costly. It's not feasible given the costs and benefits of the situation. I think the most promising way forward in this particular issue is using market mechanisms to mitigate the problem.</p> <p>So in order to talk about market mechanisms I need to do a little background on international law. There's this treaty, the <a href=\"https://en.wikipedia.org/wiki/Outer_Space_Treaty\" target= \"_blank\">1967 Outer Space Treaty</a>, which basically says among other things that nations retain jurisdiction over the stuff they put in space. Now that's important because if debris is big enough to be tracked, we can tell more or less who made it. So if you have, for example, a piece of Chinese space debris, it's technically contrary to international law for a US organization to go up there and do anything without the Chinese' permission. So if the US wants to do something it has to take care of its own space debris. If the Chinese want to do something, they have to take care of their space debris.</p> <p>Given that constraint, I think one potential is for the US government to auction off contracts to go and mitigate this stuff. Another potential is instead of auctioning off contracts to go remove it, auctioning off a contract to debris itself. One thing that's not often realized about space debris is that a lot of that stuff is valuable metal, material, that's already in orbit. The most costly part of space commerce is actually getting stuff out of Earth's gravity. So if you have debris that's currently up there that can be re-used, perhaps at a later date for in-situ manufacturing and repairs, then that's a valuable asset. Firms should be willing to pay for that. So I think we need to look at market mechanisms within particular nations to address this problem until and unless we can get a more favourable framework in international law.</p> <p><strong>Petersen:</strong> So something big like a rocket body has a lot of scrap metal that you don't have to burn fuel to get it there because it's already there. That's really interesting. So it could be a resource in itself.</p> <p>But then there's the issue of much smaller debris, something that isn't a resource in itself. A paint chip or a little fragment of debris that is not useful and is more of just a pure hazard. How would you deal with that?</p> <p><strong>Salter:</strong> That's extremely difficult. I'm not sure that there is a good solution to that right now. My guess is there has to be a technological solution in the sense of just developing thicker plating for spacecraft. Because a lot of that stuff is so small that it can't be tracked, but it's still big enough that if it hits you, you're going to be in trouble. I think that the only way to really be safe against something like that is just to wait for material to get more robust. And that's obviously not going to solve the problem but it's going to mitigate it.</p> <p><strong>Petersen:</strong> It's too bad. In science fiction they would just say \"raise shields\" and it would be dealt with, but I guess we can't do that.</p> <p><strong>Salter:</strong> That's another imaginative technological innovation and maybe something like that will be feasible some day. There's an actual technological literature on this, of people thinking up contraptions and devices for going out and removing specifically that kind of debris, but none of them are economically feasible and I think most of them aren't even technologically feasible at this point. We just can't even make the stuff apart from economic considerations.</p> <p><strong>Petersen:</strong> So there's a future in building technology to deflect or remove tiny bits of debris from Earth orbit. I don't know if you saw the move Wall-E? It was a Pixar film.</p> <p><strong>Salter:</strong> Yeah.</p> <p><strong>Petersen:</strong> Yeah, humanity had to leave Earth because it was too full of garbage, and there's the scene where not only is Earth covered in garbage but its orbit is full of old satellites.</p> <p><strong>Salter:</strong> Right.</p> <p><strong>Petersen:</strong> The ship is just sort of pushing its way through comically. But in real life, it could really happen, but it wouldn't be so easy to just push through it. It would be flying so fast and hit you with such force that it would likely cause serious damage unless you could defend against it somehow.</p> <p><strong>Salter:</strong> Right, this stuff is moving fast. In low Earth orbit it's going about seven to eight kilometers per second. And there's about 300 thousand pieces of debris that we know about that can destroy a satellite upon impact. So obviously, even if it's small, the fact that it's moving so fast can cause you some serious problems. If we get to the point where we develop strong enough technological---not like energy shielding---but the strength of metal and the strength of materials to push through that, we're a ways off from that. I don't even think that's on the horizon.</p> <p><strong>Petersen:</strong> And of course there's the issue that if it makes the satellite heavier, then it becomes much more costly to launch it. So there's the issue of being able to make something strong enough to withstand an impact while light enough to be able to actually launch it in the first place.</p> <p><strong>Salter:</strong> Right. As always there are tradeoffs, which is precisely why economics has a valuable perspective to offer on this problem.</p> <p><strong>Petersen:</strong> So let's move on to your other paper which deals with property rights in space. It starts with a discussion of the <a href= \"https://en.wikipedia.org/wiki/SPACE_Act_of_2015\" target= \"_blank\">2015 SPACE Act</a>, signed into law by President Obama. What can you tell me about that act?</p> <p><strong>Salter:</strong> So the SPACE Act is largely intended to guarantee that the US government will do something to protect commercial entities' property rights to celestial resources. Celestial property rights, basically. There's no specific commitment to what that protection will look like, it's more a statement of intent to encourage private sector development and exploration of space by the US government saying, \"Look, we know this lack of property rights thing is a problem. We just wanted to let you know that in the event of a dispute, we are going to protect your property rights as governments are supposed to do.</p> <p>The problem with that is that we get into some pretty thorny issues with international law. Again, talking about the 1967 Outer Space Treaty, which was signed by all of the current spacefaring nations, Article II of that treaty states that nation states cannot extend their territorial jurisdiction into outer space. And a lot of legal scholars think if a government is protecting private property rights, it's de facto extended its territorial jurisdiction over those rights. So if deep space industries or planetary resources, asteroid mining companies, eventually go out and claim an asteroid, and Uncle Sam says, \"Yep, we'll recognize and defend your claim to that asteroid,\" many legal scholars say that's a de facto extension of territorial sovereignty to that asteroid, which Article II of the space treaty explicitly forbids.</p> <p>So we're in a bit of a sticky situation international-law wise. At best the legal framework is unclear and at worst the 2015 SPACE Act contains provisions that are not compatible with existing international law.</p> <p><strong>Petersen:</strong> It seems like the 1967 treaty was a little bit short sighted in blocking people from owning parts of space. I guess it was during the Cold War and you can see why the Americans would not want to Soviets claiming the moon or vice versa.</p> <p>So recently, Elon Musk unveiled a plan to send colonists to Mars some time during this century. And if you literally have a colony there on Mars you're going to need property rights. And to have a treaty that might be a hundred or more years old at that point blocking that, it seems like a hurdle that we'll need to clear. People could potentially just ignore the treaty once they're on Mars.</p> <p>So, what kind of solutions do you see for this problem in the future?</p> <p><strong>Salter:</strong> Well I think that international law on this should be expanded and clarified on this just for clarity's sake. I don't think we need to rely on publically protected and enforced property rights to get things like space commerce or Mars colonies or all that cool science fiction stuff that actually now doesn't seem so infeasible.</p> <p>If you look throughout history, there are many, many examples of legal systems that are purely private and voluntary. And they are purely voluntary because the property claims underlying that legal system are self enforcing. We don't need to rely on the state, a monopoly enforcer of social rules. We don't need to rely on the state to enforce our property rights. Given the situation we find ourselves in, I will respect your property rights because it's in my self-interest to do so and you will respect my property rights because it's in your self-interest to do so. And it seems like that's incredible. If there's no monopoly enforcer protecting things, how can we have a viable legal order? But again if we look throughout history we see lots and lots of examples of these private legal regimes.</p> <p>In fact, one of them exists today. International trade law is almost entirely privately produced. International trade is almost entirely privately governed. And it's not hard to see why: there's no international super sovereign that can enforce property rights over disputes if Al is from one country and Bob is from another country. And so given that problem, traders going all the way back to the middle ages had to come up with a body of voluntary and self-enforcing law if they wanted to exchange across political boundaries. And it turns out that this law has worked out very, very well. The basics haven't changed in pretty much a thousand years and while it's being applied in newer and more interesting ways, the foundation is solid. And I think that the situation in which international traders find themselves in today---\"international anarchy\" because again there is no international super sovereign---closely matches the situation that commercial entities would find themselves in in doing space commerce. So I think that there's a lot of potential for existing international and commercial trade law to provide a governance framework for outer-space commerce going forward.</p> <p><strong>Petersen:</strong> Yeah, there's a quote from your paper I wanted to read, that deals with these international frameworks going back to the middle ages. It says:</p> <blockquote>Following the collapse of the Roman Empire in the West, the volume of international trade shrank considerably. The legal infrastructure provided by the Empire no longer stood, and the transition away from this order caused significant commercial disruption. By the ninth and tenth centuries, trade was recovering. Across Europe, a professional merchant class emerged and developed mechanisms to resolve disputes over property rights and contract enforcement, even when subjects were from different polities and thus no national court had jurisdiction.</blockquote> <p>So can you explain more about how that system developed, and how something that we developed here on Earth a millennium ago, how can that apply to space? They would seem to be very different settings.</p> <p><strong>Salter:</strong> So they're different settings geographically, but I think the economic and legal problem is the same: facilitating coordination and cooperation among disparate entities when there is no possibility of turning to something like a state to serve as an overarching referee and arbiter. And so the medieval law merchant, called the <em><a href= \"https://en.wikipedia.org/wiki/Lex_mercatoria\" target=\"_blank\">Lex Mercatoria</a></em>, was basically a self-enforcing system of property law and the legal rules that went along with it.</p> <p>And what's interesting about that is that when we think of law we normally think of a body of rules and then we talk about applying those rules in specific circumstances. This most closely works the other way. Law is created whenever international traders enter a contract. And provided that commercial instrument became widespread and actually helped traders achieve their goals---and was mutually beneficial of course---then arbitration courts overseeing merchant disputes would come to see that sort of contractual arrangement as valid. And so the arbitrator is less making law than recognizing law---a body of rules for coordinating behaviour---that actually exists.</p> <p>So if I'm a trader form some country in medieval Europe and I'm trading with another guy in another country, obviously I can't turn to my king to enforce my property rights because he doesn't have jurisdiction over your country. You can't turn to your king to enforce jurisdiction. In some situations maybe Church court can act as a venue for arbitration and dispute resolution, but most of the time what they did was---if they had a dispute---they would find some neutral third-party merchant who was an expert in the area and say, \"Look, we have this dispute. Here is this contract. I think I was supposed to do X, my trading partner disagrees. He thought I was supposed to do Y. Can you help us sort this out?\" The arbitrator, using his expertise, would look at it and come to a decision, and for the most part they were complied with voluntarily. Because if you went to commercial arbitration in the <em>Lex Mercatoria</em> system and then you ignored a ruling, you would become known as a defector, as a cheater, as someone who didn't act or uphold his or her word. And international trade was a relatively small and close-knit community and so that information would get around. You'd be branded as someone as not worthy of doing business with.</p> <p>And so you could cheat and get a payoff now, but you would risk that no one would trade with you in the future. So you'd be losing all future business, which is why most agreements, both for the medieval law merchant and the current law merchant---the current system of international commercial law---are actually complied with and adhered to voluntarily.</p> <p><strong>Petersen:</strong> OK, so what kind of legal disputes do you see potentially arising in space? What sort of resources might people come to have conflicts over?</p> <p><strong>Salter:</strong> Good question. I think the most obvious one, at least to me, is probably with asteroid mining companies. So if I go land on an asteroid and I want to mine it for valuable minerals, do I own the entire asteroid? Do I own just a portion of its surface? What happens if there's water underneath the asteroid and someone wants to go in and get the water while you're getting the minerals? How deep, literally geographically, down into the center of the asteroid do my property claims go? And water, once you're actually in space, is pretty valuable because it's used for making rocket fuel, essentially. And also, water is very heavy. As we discussed earlier, it's really expensive to get water into orbit. So if there's water already in space, in an asteroid, that's a valuable resource. People are going to want that. What happens if you want the minerals and I want the water? But me going to get the water creates a situation where you can't go and get the minerals. Maybe my mining operation is in the way of yours. Those are very real disputes that there are actually very real analogues of here on Earth that we're going to have to go and settle in space.</p> <p><strong>Petersen:</strong> I'm reminded of, during the California gold rush they developed an elaborate set of rules for how large a claim an individual gold miner could mine. And how you would draw the lines between different people's claims, and they established de facto courts to deal with claim jumpers. So we're thinking that California during the gold rush might as well have been outer space, it was so far from the rest of civilization. And so we're more or less thinking that something like that would occur.</p> <p><strong>Salter:</strong> Exactly. Economically, I think this situation is very closely analogous. Gold miners in California are outside of the reach of the formal US Government. They're in the metaphorical Hobbesian jungle, a state of nature with respect to each other. Orthodox theories of social cooperation says they shouldn't be able to cooperate and yet they clearly did, historically. The gold rush is a really interesting period of American history to study for that.</p> <p>There's also a book by scholars Anderson and Hill called <a href=\"http://amzn.to/2exE0uJ\" target=\"_blank\">The Not So Wild, Wild West</a>. We have this impression from Hollywood that the American frontier was a violent and lawless place, when in fact most likely the opposite was true, because people knew that they didn't have access to formal dispute resolution mechanisms offered by the US Government they had to come up with their own. And they worked relatively well.</p> <p>And I think that's the situation we find ourselves in in space. There are governments \"nearby\" but given current international law they can't actually extend their jurisdiction into space and therefore mediate space-related disputes. Or at lease some disputes. And so we have to have space tourism companies coming to agreements with asteroid mining companies coming into agreements with communication satellite providers. There needs to be a body of voluntary and self-enforcing rules, and again I think that there are numerous historical examples you can point to that should lead us to be actually pretty optimistic about this. Private law is not just feasible but it is also desirable because it has some pretty nice consequences in terms of creating incentives for making and stewarding wealth.</p> <p><strong>Petersen:</strong> So, the nice thing about private law, you sort of alluded to it earlier but Hayek makes this distinction between <a href=\"http://amzn.to/2enqjeN\" target=\"_blank\">law and legislation</a>, and the nice thing is it's adaptive. When you encounter new issues and new problems you set new precedents that can change and adapt with the circumstances. That's one major advantage of private law, right?</p> <p><strong>Salter:</strong> It's important to recognize that that's not unique to private law. That also exists in the common law legal system that exists in the Anglo-American tradition. So the benefits of specifically private law---I think we're talking about private law here as opposed to some sort of common-law extension into space which again, Article II of the space treaty seems to say that's not OK. So given that, are these adaptive features of a purely private legal system good enough to facilitate social cooperation and basically get people to not fight with each other? And I think they are. It's sort of a bottom-up process for discovering rather than creating law.</p> <p>There are many rules that are probably equally feasible. It's a question of finding the rules that best give individuals incentives to act in a socially responsible way. And we also want those rules to provide for orderly, quick, and low-cost dispute resolution. People are going to disagree; it's inevitable. What we want is for a legal system that is sufficiently adaptable so it can tend to specific circumstances, but also sufficiently general that individuals can form reliable expectations of their trading partners' behaviour. And as Hayek pointed out, private law is one kind of law that has that dual feature that we like so much: adaptability yet at the same time predictability.</p> <p>So it's not the case that only private law can have that. That's not what I'm saying. I'm saying that private law can have that, and given current international law, that's the only ball game in town.</p> <p><strong>Petersen:</strong> So, when you said about clarifying the rules, do you feel that if the governments of the world were to say right now that, \"disputes in outer space are not our jurisdiction, you're on your own,\" and codify that and maybe have another treaty, do you think that would hasten the development of these private mechanisms?</p> <p>strong>Salter: I think it would. The private mechanisms are only going to arise as needed in a private law system. When there's no actual dispute and no actual thing being tested, there doesn't need to be a rule for overcoming one party's disputes or claims against the other.</p> <p>So I personally actually not only think that private law is desirable in space just because of current international law. I would actually like to see space kept \"safe\" for private law. Because it has all these nice, socially beneficial properties in terms of aligning people's incentives and giving them the information they need to do good things.</p> <p>And if you look at the most likely counterpart---imagine international law were amended---what's likely to happen is there would be some international governance body, a regulatory body that's given authority over space activities. And once we embrace that sort of bureaucratic regulatory solution, that comes with all sorts of political economy and public choice problems. How do the regulators get the information necessary to make good rules? What are the incentives to make good rules?</p> <p>I think that several schools of economics and legal thought have shown that in this case embracing a top-down regulatory solution would actually be pretty dangerous. So I would like to see international law clarified, but I would also like to see private law prevail in space.</p> <p><strong>Petersen:</strong> Right, and if we're talking about particularly humans in space, as in the case of a Mars colony, it would seem to be undesirable to bring our baggage and our governance here to a place as distant as Mars. The people there are likely to face all sorts of their own problems. And if there was part of Mars that was governed by, say, the US Government you would almost face the same problems the Thirteen Colonies had being governed by the British. You have this vast gulf between the people who are doing the governing and the people who are being governed. So could a Mars colony function on private law?</p> <p><strong>Salter:</strong> Wow, that's a fascinating question and one that I didn't tackle in the paper. That's actually a little beyond my expertise in this area. I don't see any reason why it couldn't, simply because I don't see the economic and legal problems that potential Martian colonists would face are any different than people on the international law merchant scenario would face. Or individuals in medieval Iceland---who had their own body of voluntary and private law---face.</p> <p>I think the best analogy for these sorts of situations is the economic literature for what is sometimes called \"analytic anarchy.\" And people are sometimes scared of it because the word \"anarchy\" is in there. But all anarchy means in this context is we don't have recourse to a nation state to solve our disputes for us. So if we're going to get governance, we're going to have to find a way to do it ourselves. It has to be voluntary, it has to be agreeable to all parties, and it has to do a good job at facilitating social cooperation.</p> <p>So how do people actually do that when they don't have access to the nation state? Which is again pretty new in human history. So if you're looking at any time prior to 1648, there's got to be some way of generating order. And if you look at history I think you have a lot of examples of proprietary communities and voluntary communities which can be models for a Martian colony. So to make a long point short, I don't see any evidence that a Martian colony cannot be purely privately governed. And I don't think we have any reasons to think so because the problems they're going to face have been faced historically and overcome by people in various times and places.</p> <p><strong>Petersen:</strong> Do you have any closing thoughts about the future of space and the role of economics in helping us achieve our goals there?</p> <p><strong>Salter:</strong> I think that economics is going to be particularly useful in helping us highlight exactly which potential problems are worth caring about and, of those problems, which ones deserve or merit public policy responses. So, for example, I don't think there's any reason to be afraid of creating a private law governing space. I'm actually encouraged by that prospect.</p> <p>But that doesn't mean that domestic agencies, especially national agencies, don't have a role in making space a formidable and habitable environment. We just spent the first half an hour talking about space debris, right? And there's lots of things that US agencies can do to mitigate space debris for example. Various agencies can have a rule, and there are such rules in place now, saying if you're going to orbit a space craft you’ve got to provide for de-orbiting the debris and also de-orbiting the space craft when it's no longer useful.</p> <p>So economics, and particularly the economic way of thinking, can help us identify, OK this anarchy in space problem is not actually a problem. Private law is viable, so we don't have to worry about that. Oh, space debris is a problem because we have this common pool resources problem, externality problems, and the usual solutions---taxes and or property rights---aren't feasible. So we need to find some other way, maybe harnessing market mechanisms at the margin to address these. And I think the economic perspective is going to do a good job at cautioning us at taking a top-down approach at space governance.</p> <p>The temptation is huge to say, \"OK, we're on the verge of major space breakthroughs. Let's sit down and write down a body of rules that's going to govern space.\" That's really dangerous because there's no way that you and I sitting in our armchairs can see all the eventualities or problems that people will confront in space. And so the rules that we write are almost certainly going to have little to no relationship to those problems, and therefore won't help commercial and or government actors solve those problems. So figuring out what's important and avoiding the temptation to engage in what Hayek called <a href= \"http://www.nobelprize.org/nobel_prizes/economic-sciences/laureates/1974/hayek-lecture.html\" target=\"_blank\">\"The Pretense of Knowledge.\"</a> Thinking that we can learn and know and plan more than we can actually do.</p> <p><strong>Petersen:</strong> My guest today has been Alex Salter. Alex, thanks for being part of Economics Detective Radio.</p> <p><strong>Salter:</strong> It's been a pleasure. Thanks again for having me.</p> <hr /> <p> </p>",
  "content:encoded": "<p>What follows is an edited transcript of my interview with Alex Salter about the economics of space. The first half deals primarily with the issue of space debris, while the second half deals with the possibility of private governance in space. There's something in this episode for everyone to enjoy, so I hope you'll listen, read, and share it with your friends.</p>  <p>Petersen: My guest today is <a href= \"http://www.awsalter.com/\" target=\"_blank\">Alex Salter</a> of Texas Tech University. Alex, welcome to Economics Detective Radio.</p> <p>Salter: Thanks very much for having me.</p> <p>Petersen: Our topic today is the economics of space. Alex has written two papers on the subject. The first is entitled, <a href= \"https://journals.law.stanford.edu/sites/default/files/stanford-technology-law-review/print/2016/04/19-2-2-salter-final_0.pdf\" target=\"_blank\">\"Space Debris: A Law and Economics Analysis of the Orbital Commons.\"</a> The second is, <a href= \"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2840856\" target=\"_blank\">\"Ordering the Cosmos: Private Law and Celestial Property Rights.\"</a></p> <p>So Alex, let's start by talking about space debris. What is it and why does it matter?</p> <p>Salter: So space debris is basically junk in space that no longer serves any useful purpose. So as you can imagine, since the first piece of space debris launched up in 1957---which was the rocket body from Sputnik I---a lot of orbits around the Earth, especially low Earth orbit, have become kind of cluttered with space junk. And the reason it gets cluttered is because no one has an incentive to clean it up.</p> <p>It's a problem because a lot of this stuff is big enough and moving fast enough that if it strikes something like a communications satellite, it can take it out. So the probability of a collision right now that will cause serious damage is currently low, but there are a lot of worries among scientists who study the problem that as debris occasionally collides with more debris, you get a sort of snowballing effect of the clutter. So if we're going to get a handle on it, it needs to be earlier rather than later.</p> <p>Petersen: I think intuitively it seems like the sky is so big and satellites are so small that we'd never have to worry about collisions. So why is that not the case?</p> <p>Salter: So there's obviously quite a bit of room up there, but the problem is that some orbits are more valuable than others. In particular, geosynchronous orbit, which is I think 36 thousand kilometers above the Earth, is a really valuable place for specific satellites. And also low Earth orbit is a valuable place for specific satellites. Now, there's still a lot of room there, but it's significantly restricted. If my communications satellite is taking up a particular orbit, your satellite can't be in the same place. So there's only so much of it to go around, and again, what we're really worried about is debris colliding with something, which creates more debris, which can collide with more stuff. We're really worried that snowball effect, which is sometimes called the Kessler syndrome after the scientist who first wrote about it.</p> <p>Petersen: So the odds of a single collision might be low, but given one collision, it becomes much more likely that we'll have two and three and four---a chain reaction of collisions.</p> <p>Salter: Exactly. So right now the probability of collision is pretty low over the life of a satellite, for example in low Earth orbit, it's no more than one in a thousand. But conditional on getting hit, that can cause a pretty serious business disruption and economic losses, and as you said, given that one increases the likelihood of all future collisions, it's kind of like a positive feedback loop. So that can get pretty nasty pretty quick.</p> <p>Petersen: Have there been any collisions in the past?</p> <p>Salter: There have been many collisions in the past. I think the most notable one was actually intentional. In 2007, China performed an anti-satellite test, where it purposefully took out one of its old satellites that was no longer useful. And it created, I think, about a hundred and fifty thousand new pieces of space debris with that one anti-satellite test. So I'm not aware of any instances of grave, private sector disruptions caused by space debris collisions, but honestly unless there's some means of cleaning this stuff up or it de-orbits on its own, it really is only a matter of time.</p> <p>Petersen: So, you make a distinction in the paper between access to orbit and particular orbits. Can you explain what those are?</p> <p>Salter: Right. So access to orbit is basically getting your payload up into space. If you have a communications satellite, it's getting it to the orbit you want. And economically that has the characteristics of a public good. The standard definition of a public good in economics is anything that we like which is not rivalrous in consumption and non-excludable. So if I consume one more unit of it, that doesn't stop you from consuming more. And also non-excludable, the second part, means it's costly or very difficult for me to stop other people from enjoying that. So both of those characteristics fit getting a satellite into your desired orbit---going through space to get to where you want to go.</p> <p>Once your satellite is in position though, a particular orbit has the properties of what we call a common-pool resource. It's rivalrous---if I have it you can't also have it---but it's also non-excludable. I can't really stop you from using it. As orthodox public finance theory will tell you, sometimes the provision of those goods, public goods and common-pool resources, are difficult because if they're non-excludable you can't stop people from enjoying the benefits and so that limits the incentive for producers to make the stuff in the first place.</p> <p>Petersen: Right, so in order to prevent someone from launching a satellite into your orbit, you'd have to somehow police every potential launch site on the globe, which of course we can't do. And that's what makes it [non-excludable].</p> <p>Salter: It's incredibly expensive and therefore not really feasible.</p> <p>Petersen: Right, so from reading your paper I know other researchers have looked at this problem and they suggested taxing people who create space debris. So do you want to comment on that suggestion, and maybe what are the pros and cons of taking that approach?</p> <p>Salter: Sure. Let me first start by saying that the case for a corrective tax here stems from the fact that we have a common-pool resources problem, or a public goods problem. Nobody owns orbit, and so nobody really has an incentive to worry about how clean it is. If I'm launching a communications satellite, I don't really worry that I'm also imposing a cost on other potential launchers with my useless rocket body. So if everyone thinks that way, then the debris problem becomes unmanageable. So there is a textbook rationale for some correction to what we call this external cost in economics. Because nobody owns orbit or access to orbit, nobody has an incentive to care for it or clean it up. At least not as much as we would like.</p> <p>So the argument for a corrective tax is basically, we want to bring the private costs of polluting space more in line with the social costs of polluting space. So if you tax a polluter, someone who's contributing to space debris, you raise the expensiveness of creating debris. And as economic theory will tell you, when something gets more expensive, all else being equal, people will do less of it. That's the theoretical argument for what's called a Pigouvian or corrective tax.</p> <p>The problem here---and this is not specific to space debris, this is specific to all taxes correcting external cost problems---is that you don't really know how big to make the tax in order to get to the efficient amount of pollution mitigation. And even if you did, you have to take political economy considerations into concern. Corrective taxes are not run and operated by benevolent social planners. They're typically run and operated by bureaucracies, and bureaucrats have their own incentives to which they respond. And the incentives facing politicians and bureaucrats may not be the same as incentives for contributing to social efficiency or maximal wellbeing.</p> <p>Petersen: Right, so we might worry that the body that determines the tax on potentially space-junk-producing private actors might be less concerned with the externality and more concerned with their own revenue and so set the tax not at the social-welfare-maximizing point but at the revenue-maximizing point.</p> <p>Salter: Right, that's one potential worry with that sort of a solution. Again I want to emphasize, though, that's in the abstract. It's still very very difficult---in fact I would even say impossible---to know what the right size of the tax should be. I think that there is an inherent knowledge problem that sometimes gets overlooked at the expense of the incentive problem that you just talked about. Both are very important, and they're related, and they complement each other in terms of the critique, but they are distinct problems. And public policy has to be able to present credible solutions to both of those problems if we're going to argue that a corrective tax would improve social welfare.</p> <p>Petersen: Right, so you launch a satellite, maybe you leave a piece of large debris like a rocket body, but you also create a risk that the satellite will explode or be hit by something and create a snowball effect of more debris. It's really hard to compute the net cost because you not only need to know how likely is it to create more debris and how likely is that debris to impact something. You also need to know the value of the future satellites the debris might impact, which means forecasting the future of space and the future of the economy and all these things into the deep future. Have other researchers at least tried to tackle this problem? Are there some attempts?</p> <p>Salter: There have been some attempts, and as you noted, any estimate is going to be very imprecise because there's a lot of variables moving in the background. But you could look at scientific studies that estimate the damage to useful communications satellite or other valuable space equipment from a collision can range anywhere from 20 to 200 million. That's a reasonable interval for estimating the damages if you count not just the initial collision but also the potential snowballing which can destroy other things.</p> <p>And you can also look at what private companies are doing right now to get an appreciation of the magnitude of the problem. For example, if you're a communications satellite launcher you can buy insurance for your communications satellite. In 2011, market premiums for these kinds of space risks totalled about 800 million dollars. And also in 2011 there were about 600 million in claimed damages. So private actors are spending a lot to insure themselves against risks such as these and that in combination with some of the scientific studies can help build your intuition for understanding that we're talking about a lot of money here: a stream of valuable services into the future which can be risked by space debris.</p> <p>Petersen: So we do have a ballpark estimate, but nothing so precise that we could set an optimal Pigouvian tax even if we had a government that was benevolent enough to try to reach that optimum. So in your paper you suggest alternatives to the Pigouvian route. In particular you suggest potential private solutions. So what private solutions are there to reduce the creation of space debris?</p> <p>Salter: That's a really interesting question because the standard response that economists would give to externality problems seems impractical here. Usually when you have an externality problem, a public goods problem, the solution is to create property rights. Property rights align incentives so if we create property rights to a common pool resource, that will cause people to take better account of the effects of their behaviour on others. But how do you really create a property right to something like an orbit? Is it a specific volume of space? How big is it? Under what conditions can somebody else move through it when your satellite is not in that orbit?</p> <p>I think in this case we have to take seriously the idea that creating property rights to orbit and to access to orbit is simply too costly. It's not feasible given the costs and benefits of the situation. I think the most promising way forward in this particular issue is using market mechanisms to mitigate the problem.</p> <p>So in order to talk about market mechanisms I need to do a little background on international law. There's this treaty, the <a href=\"https://en.wikipedia.org/wiki/Outer_Space_Treaty\" target= \"_blank\">1967 Outer Space Treaty</a>, which basically says among other things that nations retain jurisdiction over the stuff they put in space. Now that's important because if debris is big enough to be tracked, we can tell more or less who made it. So if you have, for example, a piece of Chinese space debris, it's technically contrary to international law for a US organization to go up there and do anything without the Chinese' permission. So if the US wants to do something it has to take care of its own space debris. If the Chinese want to do something, they have to take care of their space debris.</p> <p>Given that constraint, I think one potential is for the US government to auction off contracts to go and mitigate this stuff. Another potential is instead of auctioning off contracts to go remove it, auctioning off a contract to debris itself. One thing that's not often realized about space debris is that a lot of that stuff is valuable metal, material, that's already in orbit. The most costly part of space commerce is actually getting stuff out of Earth's gravity. So if you have debris that's currently up there that can be re-used, perhaps at a later date for in-situ manufacturing and repairs, then that's a valuable asset. Firms should be willing to pay for that. So I think we need to look at market mechanisms within particular nations to address this problem until and unless we can get a more favourable framework in international law.</p> <p>Petersen: So something big like a rocket body has a lot of scrap metal that you don't have to burn fuel to get it there because it's already there. That's really interesting. So it could be a resource in itself.</p> <p>But then there's the issue of much smaller debris, something that isn't a resource in itself. A paint chip or a little fragment of debris that is not useful and is more of just a pure hazard. How would you deal with that?</p> <p>Salter: That's extremely difficult. I'm not sure that there is a good solution to that right now. My guess is there has to be a technological solution in the sense of just developing thicker plating for spacecraft. Because a lot of that stuff is so small that it can't be tracked, but it's still big enough that if it hits you, you're going to be in trouble. I think that the only way to really be safe against something like that is just to wait for material to get more robust. And that's obviously not going to solve the problem but it's going to mitigate it.</p> <p>Petersen: It's too bad. In science fiction they would just say \"raise shields\" and it would be dealt with, but I guess we can't do that.</p> <p>Salter: That's another imaginative technological innovation and maybe something like that will be feasible some day. There's an actual technological literature on this, of people thinking up contraptions and devices for going out and removing specifically that kind of debris, but none of them are economically feasible and I think most of them aren't even technologically feasible at this point. We just can't even make the stuff apart from economic considerations.</p> <p>Petersen: So there's a future in building technology to deflect or remove tiny bits of debris from Earth orbit. I don't know if you saw the move Wall-E? It was a Pixar film.</p> <p>Salter: Yeah.</p> <p>Petersen: Yeah, humanity had to leave Earth because it was too full of garbage, and there's the scene where not only is Earth covered in garbage but its orbit is full of old satellites.</p> <p>Salter: Right.</p> <p>Petersen: The ship is just sort of pushing its way through comically. But in real life, it could really happen, but it wouldn't be so easy to just push through it. It would be flying so fast and hit you with such force that it would likely cause serious damage unless you could defend against it somehow.</p> <p>Salter: Right, this stuff is moving fast. In low Earth orbit it's going about seven to eight kilometers per second. And there's about 300 thousand pieces of debris that we know about that can destroy a satellite upon impact. So obviously, even if it's small, the fact that it's moving so fast can cause you some serious problems. If we get to the point where we develop strong enough technological---not like energy shielding---but the strength of metal and the strength of materials to push through that, we're a ways off from that. I don't even think that's on the horizon.</p> <p>Petersen: And of course there's the issue that if it makes the satellite heavier, then it becomes much more costly to launch it. So there's the issue of being able to make something strong enough to withstand an impact while light enough to be able to actually launch it in the first place.</p> <p>Salter: Right. As always there are tradeoffs, which is precisely why economics has a valuable perspective to offer on this problem.</p> <p>Petersen: So let's move on to your other paper which deals with property rights in space. It starts with a discussion of the <a href= \"https://en.wikipedia.org/wiki/SPACE_Act_of_2015\" target= \"_blank\">2015 SPACE Act</a>, signed into law by President Obama. What can you tell me about that act?</p> <p>Salter: So the SPACE Act is largely intended to guarantee that the US government will do something to protect commercial entities' property rights to celestial resources. Celestial property rights, basically. There's no specific commitment to what that protection will look like, it's more a statement of intent to encourage private sector development and exploration of space by the US government saying, \"Look, we know this lack of property rights thing is a problem. We just wanted to let you know that in the event of a dispute, we are going to protect your property rights as governments are supposed to do.</p> <p>The problem with that is that we get into some pretty thorny issues with international law. Again, talking about the 1967 Outer Space Treaty, which was signed by all of the current spacefaring nations, Article II of that treaty states that nation states cannot extend their territorial jurisdiction into outer space. And a lot of legal scholars think if a government is protecting private property rights, it's de facto extended its territorial jurisdiction over those rights. So if deep space industries or planetary resources, asteroid mining companies, eventually go out and claim an asteroid, and Uncle Sam says, \"Yep, we'll recognize and defend your claim to that asteroid,\" many legal scholars say that's a de facto extension of territorial sovereignty to that asteroid, which Article II of the space treaty explicitly forbids.</p> <p>So we're in a bit of a sticky situation international-law wise. At best the legal framework is unclear and at worst the 2015 SPACE Act contains provisions that are not compatible with existing international law.</p> <p>Petersen: It seems like the 1967 treaty was a little bit short sighted in blocking people from owning parts of space. I guess it was during the Cold War and you can see why the Americans would not want to Soviets claiming the moon or vice versa.</p> <p>So recently, Elon Musk unveiled a plan to send colonists to Mars some time during this century. And if you literally have a colony there on Mars you're going to need property rights. And to have a treaty that might be a hundred or more years old at that point blocking that, it seems like a hurdle that we'll need to clear. People could potentially just ignore the treaty once they're on Mars.</p> <p>So, what kind of solutions do you see for this problem in the future?</p> <p>Salter: Well I think that international law on this should be expanded and clarified on this just for clarity's sake. I don't think we need to rely on publically protected and enforced property rights to get things like space commerce or Mars colonies or all that cool science fiction stuff that actually now doesn't seem so infeasible.</p> <p>If you look throughout history, there are many, many examples of legal systems that are purely private and voluntary. And they are purely voluntary because the property claims underlying that legal system are self enforcing. We don't need to rely on the state, a monopoly enforcer of social rules. We don't need to rely on the state to enforce our property rights. Given the situation we find ourselves in, I will respect your property rights because it's in my self-interest to do so and you will respect my property rights because it's in your self-interest to do so. And it seems like that's incredible. If there's no monopoly enforcer protecting things, how can we have a viable legal order? But again if we look throughout history we see lots and lots of examples of these private legal regimes.</p> <p>In fact, one of them exists today. International trade law is almost entirely privately produced. International trade is almost entirely privately governed. And it's not hard to see why: there's no international super sovereign that can enforce property rights over disputes if Al is from one country and Bob is from another country. And so given that problem, traders going all the way back to the middle ages had to come up with a body of voluntary and self-enforcing law if they wanted to exchange across political boundaries. And it turns out that this law has worked out very, very well. The basics haven't changed in pretty much a thousand years and while it's being applied in newer and more interesting ways, the foundation is solid. And I think that the situation in which international traders find themselves in today---\"international anarchy\" because again there is no international super sovereign---closely matches the situation that commercial entities would find themselves in in doing space commerce. So I think that there's a lot of potential for existing international and commercial trade law to provide a governance framework for outer-space commerce going forward.</p> <p>Petersen: Yeah, there's a quote from your paper I wanted to read, that deals with these international frameworks going back to the middle ages. It says:</p> Following the collapse of the Roman Empire in the West, the volume of international trade shrank considerably. The legal infrastructure provided by the Empire no longer stood, and the transition away from this order caused significant commercial disruption. By the ninth and tenth centuries, trade was recovering. Across Europe, a professional merchant class emerged and developed mechanisms to resolve disputes over property rights and contract enforcement, even when subjects were from different polities and thus no national court had jurisdiction. <p>So can you explain more about how that system developed, and how something that we developed here on Earth a millennium ago, how can that apply to space? They would seem to be very different settings.</p> <p>Salter: So they're different settings geographically, but I think the economic and legal problem is the same: facilitating coordination and cooperation among disparate entities when there is no possibility of turning to something like a state to serve as an overarching referee and arbiter. And so the medieval law merchant, called the <em><a href= \"https://en.wikipedia.org/wiki/Lex_mercatoria\" target=\"_blank\">Lex Mercatoria</a></em>, was basically a self-enforcing system of property law and the legal rules that went along with it.</p> <p>And what's interesting about that is that when we think of law we normally think of a body of rules and then we talk about applying those rules in specific circumstances. This most closely works the other way. Law is created whenever international traders enter a contract. And provided that commercial instrument became widespread and actually helped traders achieve their goals---and was mutually beneficial of course---then arbitration courts overseeing merchant disputes would come to see that sort of contractual arrangement as valid. And so the arbitrator is less making law than recognizing law---a body of rules for coordinating behaviour---that actually exists.</p> <p>So if I'm a trader form some country in medieval Europe and I'm trading with another guy in another country, obviously I can't turn to my king to enforce my property rights because he doesn't have jurisdiction over your country. You can't turn to your king to enforce jurisdiction. In some situations maybe Church court can act as a venue for arbitration and dispute resolution, but most of the time what they did was---if they had a dispute---they would find some neutral third-party merchant who was an expert in the area and say, \"Look, we have this dispute. Here is this contract. I think I was supposed to do X, my trading partner disagrees. He thought I was supposed to do Y. Can you help us sort this out?\" The arbitrator, using his expertise, would look at it and come to a decision, and for the most part they were complied with voluntarily. Because if you went to commercial arbitration in the <em>Lex Mercatoria</em> system and then you ignored a ruling, you would become known as a defector, as a cheater, as someone who didn't act or uphold his or her word. And international trade was a relatively small and close-knit community and so that information would get around. You'd be branded as someone as not worthy of doing business with.</p> <p>And so you could cheat and get a payoff now, but you would risk that no one would trade with you in the future. So you'd be losing all future business, which is why most agreements, both for the medieval law merchant and the current law merchant---the current system of international commercial law---are actually complied with and adhered to voluntarily.</p> <p>Petersen: OK, so what kind of legal disputes do you see potentially arising in space? What sort of resources might people come to have conflicts over?</p> <p>Salter: Good question. I think the most obvious one, at least to me, is probably with asteroid mining companies. So if I go land on an asteroid and I want to mine it for valuable minerals, do I own the entire asteroid? Do I own just a portion of its surface? What happens if there's water underneath the asteroid and someone wants to go in and get the water while you're getting the minerals? How deep, literally geographically, down into the center of the asteroid do my property claims go? And water, once you're actually in space, is pretty valuable because it's used for making rocket fuel, essentially. And also, water is very heavy. As we discussed earlier, it's really expensive to get water into orbit. So if there's water already in space, in an asteroid, that's a valuable resource. People are going to want that. What happens if you want the minerals and I want the water? But me going to get the water creates a situation where you can't go and get the minerals. Maybe my mining operation is in the way of yours. Those are very real disputes that there are actually very real analogues of here on Earth that we're going to have to go and settle in space.</p> <p>Petersen: I'm reminded of, during the California gold rush they developed an elaborate set of rules for how large a claim an individual gold miner could mine. And how you would draw the lines between different people's claims, and they established de facto courts to deal with claim jumpers. So we're thinking that California during the gold rush might as well have been outer space, it was so far from the rest of civilization. And so we're more or less thinking that something like that would occur.</p> <p>Salter: Exactly. Economically, I think this situation is very closely analogous. Gold miners in California are outside of the reach of the formal US Government. They're in the metaphorical Hobbesian jungle, a state of nature with respect to each other. Orthodox theories of social cooperation says they shouldn't be able to cooperate and yet they clearly did, historically. The gold rush is a really interesting period of American history to study for that.</p> <p>There's also a book by scholars Anderson and Hill called <a href=\"http://amzn.to/2exE0uJ\" target=\"_blank\">The Not So Wild, Wild West</a>. We have this impression from Hollywood that the American frontier was a violent and lawless place, when in fact most likely the opposite was true, because people knew that they didn't have access to formal dispute resolution mechanisms offered by the US Government they had to come up with their own. And they worked relatively well.</p> <p>And I think that's the situation we find ourselves in in space. There are governments \"nearby\" but given current international law they can't actually extend their jurisdiction into space and therefore mediate space-related disputes. Or at lease some disputes. And so we have to have space tourism companies coming to agreements with asteroid mining companies coming into agreements with communication satellite providers. There needs to be a body of voluntary and self-enforcing rules, and again I think that there are numerous historical examples you can point to that should lead us to be actually pretty optimistic about this. Private law is not just feasible but it is also desirable because it has some pretty nice consequences in terms of creating incentives for making and stewarding wealth.</p> <p>Petersen: So, the nice thing about private law, you sort of alluded to it earlier but Hayek makes this distinction between <a href=\"http://amzn.to/2enqjeN\" target=\"_blank\">law and legislation</a>, and the nice thing is it's adaptive. When you encounter new issues and new problems you set new precedents that can change and adapt with the circumstances. That's one major advantage of private law, right?</p> <p>Salter: It's important to recognize that that's not unique to private law. That also exists in the common law legal system that exists in the Anglo-American tradition. So the benefits of specifically private law---I think we're talking about private law here as opposed to some sort of common-law extension into space which again, Article II of the space treaty seems to say that's not OK. So given that, are these adaptive features of a purely private legal system good enough to facilitate social cooperation and basically get people to not fight with each other? And I think they are. It's sort of a bottom-up process for discovering rather than creating law.</p> <p>There are many rules that are probably equally feasible. It's a question of finding the rules that best give individuals incentives to act in a socially responsible way. And we also want those rules to provide for orderly, quick, and low-cost dispute resolution. People are going to disagree; it's inevitable. What we want is for a legal system that is sufficiently adaptable so it can tend to specific circumstances, but also sufficiently general that individuals can form reliable expectations of their trading partners' behaviour. And as Hayek pointed out, private law is one kind of law that has that dual feature that we like so much: adaptability yet at the same time predictability.</p> <p>So it's not the case that only private law can have that. That's not what I'm saying. I'm saying that private law can have that, and given current international law, that's the only ball game in town.</p> <p>Petersen: So, when you said about clarifying the rules, do you feel that if the governments of the world were to say right now that, \"disputes in outer space are not our jurisdiction, you're on your own,\" and codify that and maybe have another treaty, do you think that would hasten the development of these private mechanisms?</p> <p>strong>Salter: I think it would. The private mechanisms are only going to arise as needed in a private law system. When there's no actual dispute and no actual thing being tested, there doesn't need to be a rule for overcoming one party's disputes or claims against the other.</p> <p>So I personally actually not only think that private law is desirable in space just because of current international law. I would actually like to see space kept \"safe\" for private law. Because it has all these nice, socially beneficial properties in terms of aligning people's incentives and giving them the information they need to do good things.</p> <p>And if you look at the most likely counterpart---imagine international law were amended---what's likely to happen is there would be some international governance body, a regulatory body that's given authority over space activities. And once we embrace that sort of bureaucratic regulatory solution, that comes with all sorts of political economy and public choice problems. How do the regulators get the information necessary to make good rules? What are the incentives to make good rules?</p> <p>I think that several schools of economics and legal thought have shown that in this case embracing a top-down regulatory solution would actually be pretty dangerous. So I would like to see international law clarified, but I would also like to see private law prevail in space.</p> <p>Petersen: Right, and if we're talking about particularly humans in space, as in the case of a Mars colony, it would seem to be undesirable to bring our baggage and our governance here to a place as distant as Mars. The people there are likely to face all sorts of their own problems. And if there was part of Mars that was governed by, say, the US Government you would almost face the same problems the Thirteen Colonies had being governed by the British. You have this vast gulf between the people who are doing the governing and the people who are being governed. So could a Mars colony function on private law?</p> <p>Salter: Wow, that's a fascinating question and one that I didn't tackle in the paper. That's actually a little beyond my expertise in this area. I don't see any reason why it couldn't, simply because I don't see the economic and legal problems that potential Martian colonists would face are any different than people on the international law merchant scenario would face. Or individuals in medieval Iceland---who had their own body of voluntary and private law---face.</p> <p>I think the best analogy for these sorts of situations is the economic literature for what is sometimes called \"analytic anarchy.\" And people are sometimes scared of it because the word \"anarchy\" is in there. But all anarchy means in this context is we don't have recourse to a nation state to solve our disputes for us. So if we're going to get governance, we're going to have to find a way to do it ourselves. It has to be voluntary, it has to be agreeable to all parties, and it has to do a good job at facilitating social cooperation.</p> <p>So how do people actually do that when they don't have access to the nation state? Which is again pretty new in human history. So if you're looking at any time prior to 1648, there's got to be some way of generating order. And if you look at history I think you have a lot of examples of proprietary communities and voluntary communities which can be models for a Martian colony. So to make a long point short, I don't see any evidence that a Martian colony cannot be purely privately governed. And I don't think we have any reasons to think so because the problems they're going to face have been faced historically and overcome by people in various times and places.</p> <p>Petersen: Do you have any closing thoughts about the future of space and the role of economics in helping us achieve our goals there?</p> <p>Salter: I think that economics is going to be particularly useful in helping us highlight exactly which potential problems are worth caring about and, of those problems, which ones deserve or merit public policy responses. So, for example, I don't think there's any reason to be afraid of creating a private law governing space. I'm actually encouraged by that prospect.</p> <p>But that doesn't mean that domestic agencies, especially national agencies, don't have a role in making space a formidable and habitable environment. We just spent the first half an hour talking about space debris, right? And there's lots of things that US agencies can do to mitigate space debris for example. Various agencies can have a rule, and there are such rules in place now, saying if you're going to orbit a space craft you’ve got to provide for de-orbiting the debris and also de-orbiting the space craft when it's no longer useful.</p> <p>So economics, and particularly the economic way of thinking, can help us identify, OK this anarchy in space problem is not actually a problem. Private law is viable, so we don't have to worry about that. Oh, space debris is a problem because we have this common pool resources problem, externality problems, and the usual solutions---taxes and or property rights---aren't feasible. So we need to find some other way, maybe harnessing market mechanisms at the margin to address these. And I think the economic perspective is going to do a good job at cautioning us at taking a top-down approach at space governance.</p> <p>The temptation is huge to say, \"OK, we're on the verge of major space breakthroughs. Let's sit down and write down a body of rules that's going to govern space.\" That's really dangerous because there's no way that you and I sitting in our armchairs can see all the eventualities or problems that people will confront in space. And so the rules that we write are almost certainly going to have little to no relationship to those problems, and therefore won't help commercial and or government actors solve those problems. So figuring out what's important and avoiding the temptation to engage in what Hayek called <a href= \"http://www.nobelprize.org/nobel_prizes/economic-sciences/laureates/1974/hayek-lecture.html\" target=\"_blank\">\"The Pretense of Knowledge.\"</a> Thinking that we can learn and know and plan more than we can actually do.</p> <p>Petersen: My guest today has been Alex Salter. Alex, thanks for being part of Economics Detective Radio.</p> <p>Salter: It's been a pleasure. Thanks again for having me.</p>  <p> </p>",
  "enclosure": "",
  "itunes:duration": "37:18",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "What follows is an edited transcript of my interview with Alex Salter about the economics of space. The first half deals primarily with the issue of space debris, while the second half deals with the possibility of private governance in space. There's..."
}