{
  "title": "How WWII hung in the balance in the Mediterranean Sea – Interview with Sir Max Hastings",
  "link": "http://warscholar.org/how-wwii-hung-in-the-balance-in-the-mediterranean-sea-interview-with-sir-max-hastings/",
  "pubDate": "Tue, 01 Jun 2021 02:49:42 +0000",
  "guid": "http://warscholar.org/?p=3179",
  "comments": "http://warscholar.org/how-wwii-hung-in-the-balance-in-the-mediterranean-sea-interview-with-sir-max-hastings/#respond",
  "wfw:commentRss": "http://warscholar.org/how-wwii-hung-in-the-balance-in-the-mediterranean-sea-interview-with-sir-max-hastings/feed/",
  "slash:comments": 0,
  "category": [
    "All Naval Warfare",
    "All WWII",
    "audio interviews",
    "author",
    "books",
    "Britain",
    "germany",
    "Harper",
    "Naval warfare",
    "podcast",
    "United States",
    "wwII"
  ],
  "description": "How WWII hung in the balance in the Mediterranean Sea – Interview with Sir Max Hastings Check out this book here   https://amzn.to/3p5MJHk Interview Timeline Sir Max Hastings is the author of twenty-six books, most about conflict, and between 1986 and 2002 served as editor-in-chief of the Daily Telegraph, then editor of the Evening Standard. He…",
  "enclosure": "",
  "itunes:subtitle": "How WWII hung in the balance in the Mediterranean Sea – Interview with Sir Max Hastings Check out this book here   https://amzn.to/3p5MJHk Interview Timeline Sir Max Hastings is the author of twenty-six books, most about conflict,",
  "itunes:summary": "<br />\nHow WWII hung in the balance in the Mediterranean Sea – Interview with Sir Max Hastings<br />\n<a href=\"https://amzn.to/3p5MJHk\">Check out this book here</a>   <a href=\"https://amzn.to/3p5MJHk\">https://amzn.to/3p5MJHk</a><br />\nInterview Timeline<br />\nSir Max Hastings is the author of twenty-six books, most about conflict, and between 1986 and 2002 served as editor-in-chief of the Daily Telegraph, then editor of the Evening Standard. He has won prizes for journalism and his books. He has recently published a history of WWII Operation Pedestal. We spoke about the book and the operation.  Operation Pedestal: The Fleet That Battled to Malta, 1942 (Harper, 2021)<br />\n1:22 &#8211; Sir Max explains why he wrote about Operation Pedestal.<br />\n3:29 &#8211; Sir Max talks about Churchill&#8217;s thinking about Malta and Operation Pedestal.<br />\n6:45 &#8211; Sir Max discusses operations in the Mediterranean.<br />\n8:26 &#8211; Sir Max talks about the first few days of the Operation.<br />\n8:55 &#8211; Sir Max talks about how he balances the book between the Axis and Allies actions.<br />\n12:07 &#8211; Sir Max talks about Hitler&#8217;s thinking in regards to Malta.<br />\n14:55 &#8211; Sir Max talks about British successes early in the operation.<br />\n15:54 &#8211; Sir Max talks about the constant threats the British were facing each day of the operation.<br />\n21:40 &#8211; Sir Max talks about a dangerous sunset Italian and German air attack.<br />\n22:22 &#8211; Sir Max talks about how quickly the events in the operation got back to world leaders.<br />\n27:59 &#8211; Sir Max talks about the difficulties of being a ship captain.<br />\n31:46 &#8211; Sir Max talks about the civilians participating in the convoy operation.<br />\n33:31 &#8211; Sir Max talks about the Ohio and the attacks it endured.<br />\n37:10 &#8211; Sir Max talks about how mad the Royal Navy was at the Royal Air Force.<br />\n38:27 &#8211; Sir Max talks about how he got some of his information.<br />\n42:20 &#8211; Sir Max talks about the Arctic convoy.<br />\n43:19 &#8211; Sir Max talks about the sheer exhaustion of the men who were part of the operation.<br />\n46:02 &#8211; Sir Max talks about the risks taken in the operation as far as the amount of resources used.<br />\n47:47 &#8211; Sir Max talks about the emotional aspect of the burials at sea during the operation.<br />\n49:59 &#8211; Sir Max talks about the civilian burial practices and how the civilian crews acted.<br />\n52:33 &#8211; Sir Max talks about having visited Malta and their courage during the war.<br />\n54:00 &#8211; Sir Max talks about the war scars still left at Malta.<br />\n55:12 &#8211; Sir Max talks about how pivotal the few weeks of Pedestal were.<br />\n56:45 &#8211; Sir Max talks about the importance of willpower in the war.<br />\n59:22 &#8211; Sir Max talks about how little known this operation is despite its importance.<br />\n1:00:04 &#8211; Sir Max talks about his next project being about the Cuban Missile Crisis.<br />\n1:01:20 &#8211; Sir Max talks about his excitement in studying history,<br />\n1:02:35 &#8211; Sir Max talks about the importance of the story of Pedestal.<br />\nLinks of interest<br />\n<a href=\"https://amzn.to/3p5MJHk\">https://amzn.to/3p5MJHk</a><br />\n<a href=\"https://www.harpercollins.com/products/operation-pedestal-max-hastings?variant=32306180489250\">https://www.harpercollins.com/products/operation-pedestal-max-hastings?variant=32306180489250</a><br />\nContact Information<br />\nFor more “Military History Inside Out” please follow me at <a href=\"http://www.warscholar.org/\">www.warscholar.org</a>, on Facebook at <a href=\"https://www.facebook.com/Warscholarorg-Military-History-News-and-Education-115795938127/\">warscholar</a>, on twitter at <a href=\"https://twitter.com/Warscholar\">Warscholar</a>, on youtube at <a href=\"https://www.youtube.com/user/warscholar1945/\">warscholar1945</a> and on Instagram <a href=\"https://www.instagram.",
  "itunes:author": "Cris Alvarez",
  "itunes:image": "",
  "itunes:duration": "1:05:51",
  "post-id": 3179
}