{
  "title": "What Was The Mysterious Mist? | Best of Real Ghost Stories Online",
  "link": "https://audioboom.com/posts/8138514",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2133,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>What was the dark mist that seemed to suddenly appear in a bedroom and disappear just as fast?<br>\nHere is a preview of the story.<br>\n“My eyes snapped opened, head jerking to the right just in time to see the mist collecting in the open closet – mist somehow darker than the pitch-black room. I knew what would happen next; it had happened every night that week. The mist would condense, solidify, and he would take form. The Figure. Mere silhouette though he was, every time I saw that tall, broad-shouldered form lumber out of the closet to resume a familiar position in the bedroom doorway, my heart would start to beat out of my chest. I wanted to run, but… somehow, I knew passing through this shadow man was the worst thing I could do. There was no choice but to lie there under his gaze and wonder if anything awful had ever happened in this apartment.<br>\nIndeed, the complex itself was aggressively average for a college town – nothing ominous except a faulty boiler and a few rusted aircons. My roommate Danny and I thought we were getting a good deal for a couple of undergraduates, despite the fact that we had to share a bedroom. But, well… I will skip the cliches and just say that it felt like there was something off about our unit as soon as we moved in. Even when I opened the blinds and turned on all the lights – which I became obsessive about as time went on – nothing could overcome the persistent dinginess of the place. There were also a lot of… trivial things…”<br>\n<br>\nWatch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\nIf you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n<br>\n<br>\n\n</div>\n",
  "pubDate": "Sat, 13 Aug 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-08-12:/posts/8138514",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}