{
  "id": "yt:video:kP0EkiBAfIU",
  "yt:videoId": "kP0EkiBAfIU",
  "yt:channelId": "UCQSEAbOs6vsJfy7WN7iYaGQ",
  "title": "100% Speedrunning Batman Was A Mistake",
  "link": "",
  "author": {
    "name": "EazySpeezy",
    "uri": "https://www.youtube.com/channel/UCQSEAbOs6vsJfy7WN7iYaGQ"
  },
  "published": "2022-10-21T00:30:09+00:00",
  "updated": "2022-10-30T04:57:24+00:00",
  "media:group": {
    "media:title": "100% Speedrunning Batman Was A Mistake",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Today we're speedrunning every single part of Batman: Arkham Asylum. This game has a total of 240 collectibles scattered throughout the map and was probably one of my hardest speedruns yet\n\nMy 2nd channel (WEEKLY UPLOADS): https://www.youtube.com/eaziestspeezy\nWatch live at: https://twitch.tv/EazySpeezy\n\n▶ Twitter: https://twitter.com/EazySpeezy\n▶ Instagram: https://instagram.com/EazySpeezy/\n▶ Merch: https://eazyspeezy.com\n\nEdited by: @The Suited Bird \nWatch the world record speedrun here: https://youtu.be/VpKsBHXv_Oo\n\nMy channel generally focuses on a more casual side of speedruns. With these videos I want to show off cool speedruns, explain how they work, and entertain. Hopefully you enjoy the content and maybe even take up speedrunning yourself, because it is truly a lot of fun!\n\nBatman Arkham Asylum description (from Steam):\n\nCritically acclaimed Batman: Arkham Asylum returns with a remastered Game of the Year Edition, featuring 4 extra Challenge Maps. The additional Challenge Maps are Crime Alley; Scarecrow Nightmare; Totally Insane and Nocturnal Hunter (both from the Insane Night Map Pack).\nUtilize the unique FreeFlow combat system to chain together unlimited combos seamlessly and battle with huge groups of The Joker’s henchmen in brutal melee brawls\nInvestigate as Batman, the WORLD’S GREATEST DETECTIVE, by solving intricate puzzles with the help of cutting edge forensic tools including x-ray scanning, fingerprint scans, ‘Amido Black’ spray and a pheromone tracker\nFace off against Gotham’s greatest villains including The Joker, HARLEY QUINN, POISON IVY and KILLER CROC\nBecome the Invisible Predator with Batman’s fear takedowns and unique vantage point system to move without being seen and hunt enemies\nChoose multiple takedown methods, including swooping from the sky and smashing through walls.\nExplore every inch of Arkham Asylum and roam freely on the infamous island, presented for the first time ever in its gritty and realistic entirety\nExperience what it’s like to be BATMAN using BATARANGS, explosive gel aerosol, The Batclaw, sonar resonator and the line launcher\nUnlock more secrets by completing hidden challenges in the world and develop and customize equipment by earning experience points\nEnjoy complete superhero freedom in the environment with the use of Batman’s grapnel gun to get to any place you can see, jump from any height and glide in any direction\n\n#EazySpeezy #Batman #Speedrun #ArkhamAsylum",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}