{
  "title": "Climate, Disease, and the Fall of Rome with Kyle Harper",
  "pubDate": "Fri, 22 May 2020 17:26:32 +0000",
  "guid": "5fe4f947-fe8d-4a83-a2fd-c7b53a55c905",
  "link": "https://economicsdetective.libsyn.com/climate-disease-and-the-fall-of-rome-with-kyle-harper",
  "itunes:image": "",
  "description": "<div style=\"float: right; padding-left: 10px;\"><a href= \"https://www.amazon.com/Fate-Rome-Climate-Disease-Princeton-ebook/dp/B071SLPWVL/ref=as_li_ss_il?ie=UTF8&linkCode=li3&tag=economicsde0f-20&linkId=02cd8029d0830c03a010f14e72a405cc&language=en_US\" target=\"_blank\" rel=\"noopener\"><img src= \"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B071SLPWVL&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=economicsde0f-20&language=en_US\" border=\"0\" /></a><img style= \"border: none !important; margin: 0px !important;\" src= \"https://ir-na.amazon-adsystem.com/e/ir?t=economicsde0f-20&language=en_US&l=li3&o=1&a=B071SLPWVL\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" /></div> <p>Historian Kyle Harper joins the show to discuss his book <a href=\"https://amzn.to/3eeTvnl\" target=\"_blank\" rel= \"noopener\">The Fate of Rome: Climate, Disease, and the End of an Empire</a>. We discuss the fall of the Roman empire and the new scientific discoveries that have shed more light on its nature and causes. Kyle's work looks at the epidemics and climatic changes that hit the empire, contributing to its disintegration.</p> <blockquote>Interweaving a grand historical narrative with cutting-edge climate science and genetic discoveries, Kyle Harper traces how the fate of Rome was decided not just by emperors, soldiers, and barbarians but also by volcanic eruptions, solar cycles, climate instability, and devastating viruses and bacteria. He takes readers from Rome’s pinnacle in the second century, when the empire seemed an invincible superpower, to its unraveling by the seventh century, when Rome was politically fragmented and materially depleted. Harper describes how the Romans were resilient in the face of enormous environmental stress, until the besieged empire could no longer withstand the combined challenges of a “little ice age” and recurrent outbreaks of bubonic plague.</blockquote> <hr />",
  "content:encoded": "<a href= \"https://www.amazon.com/Fate-Rome-Climate-Disease-Princeton-ebook/dp/B071SLPWVL/ref=as_li_ss_il?ie=UTF8&linkCode=li3&tag=economicsde0f-20&linkId=02cd8029d0830c03a010f14e72a405cc&language=en_US\" target=\"_blank\" rel=\"noopener\"></a> <p>Historian Kyle Harper joins the show to discuss his book <a href=\"https://amzn.to/3eeTvnl\" target=\"_blank\" rel= \"noopener\">The Fate of Rome: Climate, Disease, and the End of an Empire</a>. We discuss the fall of the Roman empire and the new scientific discoveries that have shed more light on its nature and causes. Kyle's work looks at the epidemics and climatic changes that hit the empire, contributing to its disintegration.</p> Interweaving a grand historical narrative with cutting-edge climate science and genetic discoveries, Kyle Harper traces how the fate of Rome was decided not just by emperors, soldiers, and barbarians but also by volcanic eruptions, solar cycles, climate instability, and devastating viruses and bacteria. He takes readers from Rome’s pinnacle in the second century, when the empire seemed an invincible superpower, to its unraveling by the seventh century, when Rome was politically fragmented and materially depleted. Harper describes how the Romans were resilient in the face of enormous environmental stress, until the besieged empire could no longer withstand the combined challenges of a “little ice age” and recurrent outbreaks of bubonic plague. ",
  "enclosure": "",
  "itunes:duration": "01:01:02",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Historian Kyle Harper joins the show to discuss his book . We discuss the fall of the Roman empire and the new scientific discoveries that have shed more light on its nature and causes. Kyle's work looks at the epidemics and climatic changes that hit...",
  "itunes:episode": 144,
  "itunes:episodeType": "full"
}