{
  "title": "Introducing WebQA : A Multi-hop, Multi-modal & Open Domain Reasoning Challenge & Benchmark ",
  "link": "https://blogs.bing.com/search-quality-insights/october-2021/Introducing-WebQA-A-Multi-hop,-Multi-modal-Open-Domain-Reasoning-Challenge-Benchmark",
  "pubDate": "Tue, 19 Oct 2021 08:00:00 -0700",
  "dc:creator": "Bing Team",
  "category": [
    "bing",
    "engineering"
  ],
  "guid": "b5da7b4d-f239-43fc-99da-bbcd7db8602f",
  "description": "We are proud to introduce <b>WebQA</b>, a dataset for <b>multi-hop, multi-modal open-domain question answering</b> challenge, to be hosted at <a href=\"https://nam06.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwebqna.github.io%2F&data=04%7C01%7CAshish.Jaiman%40microsoft.com%7C0840eaa66e9f44e61dbe08d98dbcd362%7C72f988bf86f141af91ab2d7cd011db47%7C0%7C0%7C637696664682014914%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C1000&sdata=CbpS7SqiGbD6svF%2BTkx34X3Jw0h9pagPGJjUVi25WWc%3D&reserved=0\">NeurIPS 2021 Competition Track</a>. Designed to simulate the heterogeneous information landscape one might expect when performing web search, WebQA contains 46K knowledge-seeking queries whose answers are to be found in either images or text snippets, where a system must determine relevant sources first before reasoning to obtain and present an answer in natural language.",
  "content:encoded": "<p>Web navigation and exploration is an area of reasoning wherein users consume and assimilate information from multiple sources like text, images, or other modalities. In addition, it is multi-hop and exploratory in nature where users often use multiple sources to aggregate different facets of information. Most question answering (QA) systems treat the web primarily as a text-only landscape and this may limit the scope of information that can be extracted. For example, when searching for a query like &lsquo;<i>what color is the belly of a green tree frog&rsquo;</i>, surfacing the image of the green tree frog along with content associating the image to the species is much more effective than wading through pages trying to find this information documented explicitly somewhere.</p>\n\n<p>Large amounts of (labeled) training data have been vital to the advancement of approaches in QA systems. Datasets are rapidly emerging to solve reasoning over multi-modal and multi-hop QA pairs as well. But most of these approaches either use pre-defined templates for curation of data or encourage a &lsquo;question-decomposition followed by re-routing to a uni-modal model&rsquo; approach. However, if we could disentangle extracting knowledge from understanding it, then there would be no need to differentiate whether the knowledge was learned from books versus images, or whether an abstract piece of knowledge is a composite of multiple scattered fragments versus being carried by a single one.</p>\n\n<p>Long term genuine progress for such systems needs reasoning over linguistic notions of meanings and visually grounded ones, ideally - under the same representation framework. This depends on the development of a unified system that indiscriminately treats text snippets and images or other information modalities as knowledge carriers. The newly proposed WebQA benchmark is aimed at advancing this goal as a <b><i>multi-hop, multi-modal, open-domain</i></b> question-answering system where questions are knowledge-seeking and resemble real-world use cases over text and images.</p>\n<br />\n<img alt=\"image002.gif\" src=\"https://blogs.bing.com/getattachment/c11de05a-b525-48ec-98ac-f89046f2c7c0/image002.gif.aspx\" title=\"image002.gif\" />\n<p><br />\n<b>Figure 1: Example WebQA dataset pipeline</b><br />\nThe question requires finding and reasoning about relevant sources and discarding distractors to produce the correct natural language answer</p>\n\n<h3>Task Formulation</h3>\n\n<p>Consider textual question <i>Q = &lsquo;What color is the belly of a green tree frog?&rsquo;</i>, a set of <i>n </i>sources consisting of supporting sources [s<sub>1</sub>, s<sub>2</sub>, ..., s<sub>m</sub>] and a set of distractor sources [s<sub>m+1</sub>, s<sub>m+2</sub>, ..., s<sub>n</sub>], where each source can be either a snippet or an image with a caption associated with it. Ideally, the task would be addressed in a single stage wherein a system jointly processes <i>Q</i>, s<sub>1</sub>, s<sub>2 &hellip;</sub> s<sub>n </sub>to produce <i>A</i>. However, there aren't any modeling approaches that can consume sufficiently large multimodal contexts to achieve this currently. With that in mind, the task can be practically broken down into a two-stage process to derive answer <i>A</i>. The first stage requires the model to identify the sources from which to derive the answer (i.e., <i>multimodal information extraction</i>). The second stage is <i>question answering</i> where the model takes<i> Q</i>, sources as context <i>C</i>, to generate an answer <i>A</i>. From the shown example (Figure 1), the sources contain&nbsp; several distracting pieces of information. They include colors of different types of frogs (yellow, brown, blue etc.), sometimes other parts of a frog than its belly (thighs, glands, hand etc.) and varied related images of frogs. This setting mimics real-world scenarios of retrieving and sifting through vast amount of multi-modal information sources. Furthermore, no text snippet contains the answer directly. In this image-based query example the distractors are mined such that they do not leak the correct answer. It is, therefore, not straightforward for the model to derive information about the species of the frog and the caption is needed to first identify the right image and then generate the answer using image understanding. This two-stage reasoning process is multi-hop and multi-modal.</p>\n\n<p>In above example, for source retrieval phase, all distractor sources talking about other body parts of frog e.g., green/brown dorsal surface; yellow pigments etc. and other specific type of frog species <i>e.g., European tree frog, pacific tree frog</i> etc. should be discarded while facts supporting the association of green tree frog image should be selected. For the second phase of question answering, the model is expected to perform reasoning to infer that the belly of the green tree frog is &lsquo;<i>white&rsquo;</i> using the supporting source (image + text caption) with high confidence.</p>\n\n<h3>WebQA Data</h3>\n\n<p>The first version of WebQA data is open-domain and the task is targeted to be as close as possible to real world scenarios by considering sources from open world topics and derived from prompts from real world queries. It targets queries and facts that have answers which can be found either via image search or general web (text) search. For getting rich multi-hop and multiple source questions we use crowdsourcing for curating both image and text-based examples. For both text and image examples the data has a set of both text and image-based hard negatives for models to sift through.</p>\n\n<h3>Answers from Images</h3>\n\n<p>The annotators are presented with a set of six related images and asked to produce QA-pairs by selecting one or two images per pair that are necessary to answer the question. A requirement is that at least one in the three pairs utilizes two distinct images. Additionally, they need to avoid questions that: a) are simple facts (e.g., \"How many wheels does a car have\"); b) are easily answered by a text-only search; c) are bound to a specific image. (c) ensures every question is meaningful without paired context.</p>\n\n<p>Text distractors are based on extracting relevant passages from publicly available content based on noun chunks in the question, while limiting overlap to avoid false negatives. For image distractors, we use both the metadata and visual content to find similar images. The former relies on the Bing Image Search API while the latter uses the Bing Image Insight function for visual similarity. In total, we collect 25K image-based questions.</p>\n\n<p>Question prefixes are visualized in Figure 2. Questions are also categorized into open and closed classes. Closed class questions include color, shape, number (i.e. &ldquo;how many&rdquo;), Yes/No, and &ldquo;choose&rdquo; (i.e. questions that ask to choose from entities with a particular property). To reward models with better generalization and reasoning the test set is constructed to be out-of-distribution when possible. For color, shape, and number questions, the answer set is partitioned to ensure that the majority class during training does not carry over to testing. For the \"Yes/No\" and \"choose\" classes, multiple models were trained on 10 random train-test splits. Consistently difficult samples across splits were considered &ldquo;hard,&rdquo; and placed in the test set. Finally, open-class &ldquo;other&rdquo; questions were randomly split between train and test.</p>\n\n<h2><img alt=\"image004.jpg\" src=\"https://blogs.bing.com/getattachment/a2736861-3e06-42a8-827c-9388a2b03de1/image004.jpg.aspx?width=452&height=500\" style=\"width: 452px; height: 500px;\" title=\"image004.jpg\" /></h2>\n\n<h3>Answers from Text</h3>\n\n<p>To generate diverse, yet consistent, topics for mining difficult multi-hop reasoning questions, we construct clusters of similar entities, but where text snippets had low overall n-gram overlap or semantic similarity (resulting in 8K clusters). We provide annotators with four snippets to prevent information overload, and (by<b> </b>request) allow them to contribute facts they researched to help answer the question. For text distractors passages are mined from publicly available content that contain noun phrases from the question and the ones with the highest lexical overlap that lack reference to the answer are chosen. For image distractors, the images and captions present on the aforementioned publicly available content pages are used, again filtering for those with high lexical overlap. In total, the set contains 25K text-based questions and since they lack clear criteria for question categorization, we do not construct an adversarial test split, but instead simply sample randomly.</p>\n\n<p>Table 1 shows the distribution of the both the Image and Text set for train, dev and test samples. Qualitatively WebQA covers a wide range of topics as can be observed from Figure 3. Also, on comparing the topic clouds, it can be observed that image-based queries relate to physical entities while text-based queries are more abstract.<br />\n<br />\n<img alt=\"image006.jpg\" src=\"https://blogs.bing.com/getattachment/5a9c6ccd-f0b0-44de-959f-371fd6b62797/image006.jpg.aspx?width=800&height=251\" style=\"width: 800px; height: 251px;\" title=\"image006.jpg\" /></p>\n\n<h3>Metrics</h3>\n\n<p>The benchmark task expects fluent and complete sentences as answers, which are appropriate for applications such as voice assistants or conversation agents. Therefore, the quality is measured as both <b>fluency</b> and <b>accuracy</b>. For each testing sample there are five full-sentence answers provided by humans. In addition, it also contains one keyword answer by asking human annotators to rephrase the full-sentence answer into a succinct minimal semantic form. We measure <b>fluency (FL)</b> via an adapted variation of BARTScore, a newly proposed NLG evaluation metric based on accurate measurement of paraphrase similarity. This is combined with <b>accuracy (Acc)</b>, measured with answer keywords. Answer keywords a) detect the presence of key entities b) penalize the use of any incorrect entities c) avoid penalizing semantically relevant but superfluous words. Systems are given a combined score <b>FL*Acc</b> across all test samples.</p>\n\n<h3>New WebQA Challenge for AI Models &nbsp;</h3>\n\n<p>WebQA is a new multi-hop, multi-modal question answering challenge which is open-domain and close to real world application task settings. It is aimed at propelling development of more holistic AI models. Designed to simulate the heterogeneous information landscape one might expect when performing web search, WebQA in its first version contains 46K knowledge-seeking oriented queries whose answers are to find in either images or snippets. Hard negatives add complexity to the task by requiring a system to determine relevant sources first before reasoning. Table 2 below shows that even state-of-the-art large scale multimodal models that perform at human levels on other visual and text QA tasks, fail to perform well on WebQA, performing significantly worse than humans. In fact, humans can perform this task with ease (i.e., achieving >94 Acc and >55 FL) computed via cross-evaluation on six references provided by different annotators to prove robustness and consensus. While advanced models like VLP and VLP combined with VinVL (state-of-the-art visual representation) achieve high fluency scores, reaching human-level accuracy is not within sight.<br />\n<br />\n<img alt=\"image008.jpg\" src=\"https://blogs.bing.com/getattachment/d1a80bb9-4777-4d61-b5a2-1cc0d2bd73af/image008.jpg.aspx?width=800&height=210\" style=\"width: 800px; height: 210px;\" title=\"image008.jpg\" /><br />\n<br />\nThese results reveal the prospect of model improvements that will benefit more holistic real-world applications which are increasingly multi-hop (across sources) and multi-modal (across modality options). Qualitative analysis of outputs from these advanced model failed cases for both image and text-based questions reveals some interest insights.<br />\n<br />\n<img alt=\"image010.jpg\" src=\"https://blogs.bing.com/getattachment/ae0df469-ca17-4b3c-b283-00c29babcfa4/image010.jpg.aspx?width=800&height=198\" style=\"width: 800px; height: 198px;\" title=\"image010.jpg\" /><br />\n<br />\n<img alt=\"image012.jpg\" src=\"https://blogs.bing.com/getattachment/009a7612-745b-411c-b673-41648fd4ec7b/image012.jpg.aspx?width=800&height=188\" style=\"width: 800px; height: 188px;\" title=\"image012.jpg\" /><br />\n<br />\nBoth above examples for image-based QA reveal that the model can produce logically consistent and fluent sentences but the predictions of these are incorrect. The first matches the negation but the answer should have been yes, while in the second, the model runs away with a very logical hallucination (heads wear helmets) but this is due to not understanding the image.<br />\n<br />\n<img alt=\"image014.jpg\" src=\"https://blogs.bing.com/getattachment/fba143f1-5a03-4238-8df9-48c381726b71/image014.jpg.aspx?width=800&height=238\" style=\"width: 800px; height: 238px;\" title=\"image014.jpg\" /><br />\n<img alt=\"image016.jpg\" src=\"https://blogs.bing.com/getattachment/7b6a1551-3f2c-4f62-96b6-21155d4aea9f/image016.jpg.aspx?width=800&height=252\" style=\"width: 800px; height: 252px;\" title=\"image016.jpg\" /><br />\n<br />\nIn the text examples, we see a different pattern. Here the model is more easily able to copy facts from the source texts, but still demonstrates a lack of understanding or reasoning. In the first example, the model appears to know it is looking for a number but choosing one via direct copying rather than performing the arithmetic necessary to combine both facts. In the second case, the model finds a relevant span selection (as is commonly the only thing necessary for text QA tasks) but does not understand that the question is asking about a method of diagnoses versus a symptom.<br />\nWhile it is well known that current models are often weak at reasoning or arithmetic, none of the questions presented here require complex information aggregation or analysis. They, as is common in the dataset, follow rather simple implication, addition, or visual extraction patterns which happen to be out of reach for current models (uni- or multi-modal).</p>\n\n<h3>Call to Action</h3>\n\n<p>WebQA not only closely mirrors our everyday experience on the web, but that it provides a playground for the community to explore important sub-challenges.&nbsp; Specifically, around reasoning, knowledge aggregation, rich visual understanding, and the use of a singular model across modalities. There have been a number of recent advances in document level understanding or processing of large context windows. However, WebQA presents a novel challenge in this direction, by pushing for the construction of a single model which can process and integrate information across multiple paragraphs and images despite the substantial contextual window required. We hope the work on WebQA dataset and its upcoming versions in future will drive progress on benchmarking, modeling, and evaluation in the multimodal reasoning as well as the broader AI research.<br />\n<br />\nWe welcome researchers to participate and engage with us to contribute to solve this exciting area of problems and to collaborate and develop more congruent and cogent reasoning models! WebQA will be part of the <a href=\"https://neurips.cc/Conferences/2021/CompetitionTrack\">NeurIPS competition track</a> and will announce the winners at the end of the competition.<br />\n<br />\nPlease read our <a href=\"https://arxiv.org/abs/2109.00590\">paper</a> for more details, reach out to us at @ webqna.github.io and follow the leaderboard at <a href=\"https://eval.ai/web/challenges/challenge-page/1255/overview\">https://eval.ai/web/challenges/challenge-page/1255/overview</a>.<br />\n<br />\n-&nbsp;<a href=\"https://zdxdsw.github.io/\">Yingshan Chang</a>, Mridu Narang, Hisami Suzuki, Guihong Cao, <a href=\"https://www.microsoft.com/en-us/research/people/jfgao/\">Jianfeng Gao</a>, <a href=\"https://yonatanbisk.com/\">Yonatan Bisk</a></p>\n\n<h3>Acknowledgments</h3>\n\n<p>We thank Jordi Ribas, Xiaodong Fan, Levi Melnick, Jared Fernandez, Ruotong Wu, MSR and Bing NLP group and leadership for their support, discussions, and suggestions at various stages in the project.</p>\n"
}