{
  "title": "EMS Workers Have A Shocking Paranormal Encounter | Best of RGSO",
  "link": "https://audioboom.com/posts/8075275",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1917,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>What happens on the job for one EMS worker is anything but “routine”, its paranormal!<br>\n<br>\n\n</div>\n<div>Here is a preview of the story.<br>\n“I've always been a light sleeper and especially had trouble falling asleep on shift, so, past midnight if I ever did sleep it was fitful at best. One night, around 2 am, while I was lying awake at the station, I got a call from the dispatcher asking me to come to the dispatch, which was connected to crew quarters at station 3. When I got there, she was clearly shaken and asked me if there were any other crews there. I said I hadn't seen or heard any. She claimed to have looked up and, through the windows separating dispatch from the hall outside, seen a crew member, in uniform, facing away from her, studying the bulletin board. She had glanced away, not immediately recognizing that anything was out of place, as a crew member being at the main station getting supplies or something was not terribly uncommon even at that time of night. A moment later when, having realized that the crew member in question was neither my partner nor me, when we were the only crew that had checked in at the station in the last few hours, she looked up and the figure was gone. She had not heard him leave, though he would have had to walk right past her window, nor had enough time elapsed for him to sneak past.<br>\nWhen I first started working there a few years before, my very first day was a tragic one. One of the employees had committed suicide the night before. Though I had not worked with him, I had done clinical ride-outs with the service during EMT school, and he had been one of my preceptors. Years later the dispatcher, who had not worked there at the time and would not have known this employee, in describing the figure she saw, seemed to be describing the deceased paramedic. Granted this was done from a brief glance at his back, but she got the hair color and the general build just right.”<br>\n<br>\n\n</div>\n<div>\n<br>\nThe day after this happened, my son and his family had to go home. I was sitting in my favorite spot outside after they left; it was a beautiful sunny day with no wind - and I'd only been sitting there alone for a few minutes when I saw movement out of the corner of my eye - a beautiful white feather was descending to the ground in a circular movement as in a straight down coil, about 3 feet from me - I looked up - there were no birds. There was no breeze. there were no trees over me. But I saw that feather and I felt good. In my head, I felt the words \"thank you.\"”<br>\n<br>\n\n</div>\n<div>Watch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\n\n</div>\n<div>If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n",
  "pubDate": "Sun, 01 May 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-04-29:/posts/8075275",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}