{
  "title": "Germany tells Serbia to choose between Russia and EU – Reuters",
  "link": "https://www.rt.com/news/565761-serbia-choice-eu-russia/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565761-serbia-choice-eu-russia/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6361691085f54002e72ce93c.jpg\" /> Serbia must choose between its partnership with Russia and a future in the EU, a German official told Reuters <br/><a href=\"https://www.rt.com/news/565761-serbia-choice-eu-russia/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Belgrade will face “consequences” if it partners with Moscow, a German representative told the news agency</strong></p>\n            \n                        \n            <p>Serbia must decide to align itself with either Russia or the EU, a German official told Reuters on Tuesday. While Berlin has warned Belgrade against looking eastwards, the country&rsquo;s government remains skeptical of Brussels and the West.&nbsp;</p>\n<p><em>&ldquo;The need for a decision is coming to a head in view of geopolitical developments,&rdquo;</em> the unnamed German representative told reporters. The official was referring specifically to the conflict in Ukraine, which Serbia has refused to sanction Russia over. Moreover, Belgrade and Moscow signed an agreement in September to expand cooperation on matters of foreign policy.</p>\n<p>Alignment with Brussels&rsquo; stance on global affairs is a precondition to joining the European Union. Serbia has been a candidate for membership since 2009. Should Serbian President Aleksandar Vucic renege on his agreement with Moscow and turn to the EU, Germany will offer its support, the representative revealed to Reuters.&nbsp;</p>\n<p><em>\"Should he decide to go the other way, this will have consequences in reverse,&rdquo;</em> the official explained.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/634c07f5203027773b334377.jpg\" alt=\"A pedestrian walks past an anti-EU and anti-NATO mural painting in Belgrade, Serbia, April 2, 2022\" />\n            <figcaption><a href=\"https://www.rt.com/news/564770-serbia-eu-blackmail-kosovo/\">EU blackmailing Serbia – interior minister</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Delegations from five Balkan countries &ndash; Albania, Bosnia and Herzegovina, Montenegro, North Macedonia, and Serbia &ndash; as well as the partially recongnized province of Kosovo, will meet in Berlin later this week.&nbsp;</p>\n<p>Last month, Vucic stated that Germany and France have <a href=\"https://www.trtworld.com/europe/serbia-rejects-recognition-of-kosovo-as-condition-to-speed-up-eu-membership-61481\" target=\"_blank\" rel=\"noopener noreferrer\">offered</a> to <em>&ldquo;accelerate&rdquo;</em> Serbia&rsquo;s path to EU membership if it recognizes the independence of Kosovo.&nbsp;</p>\n<p><em>&ldquo;They think this will settle one of Europe&rsquo;s internal issues&hellip; [but] Serbia will not accept Kosovo&rsquo;s membership in the UN for both constitutional and other reasons,&rdquo;</em> the president stressed during a televised address to the nation.&nbsp;</p>\n<p><em>&ldquo;The question is not whether we want to join the EU, but whether the EU wants Serbia,&rdquo;</em> Interior Minister Aleksandar Vulin told the Novosti news site in October. <em>&ldquo;I believe that friendship with Russia is of the greatest importance and that without it we risk the physical disappearance of Serbia,&rdquo;</em> the official added.&nbsp;</p>\n<p></p>",
  "enclosure": "",
  "pubDate": "Tue, 01 Nov 2022 20:10:58 +0000",
  "dc:creator": "RT"
}