{
  "id": "https://bibleinoneyear.org/en/youth/133",
  "title": "Day 133: How to Deal with Desperate Times",
  "description": "Psalm 60:1-4, Judges 16:28a, John 7:45–52, 8:3-11.  Maybe even now you are facing a desperate situation – perhaps with your health, a bereavement, the breakdown of a relationship, work problems, family difficulties, financial trouble or a combination of these  Even in desperate times, you can find the three great virtues of faith, hope and love",
  "pubDate": "Thu, 13 May 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/133/?ignore",
  "itunes:duration": "14:42",
  "guid": "enyouth13052021-133",
  "length": 882.94,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 133: How to Deal with Desperate Times",
  "itunes:subtitle": "Psalm 60:1-4, Judges 16:28a, John 7:45–52, 8:3-11.  Maybe even now you are facing a desperate situation – perhaps with your health, a bereavement, the breakdown of a relationship, work problems, family difficulties, financial trouble or a combination of these  Even in desperate times, you can find the three great virtues of faith, hope and love",
  "itunes:summary": "I remember so well interviewing Rick and Kay Warren at our Leadership Conference at the Royal Albert Hall in London. A year had passed since the devastating death of their son by suicide, aged twenty seven. They spoke of how God can work even in the ruins of our lives.\nKay said, ‘We definitely felt our lives had been ruined when our son died. But one of the things that kept me tethered to life and to hope was believing that God was not helpless in those ruins. God was still working his plan of love in those circumstances that were so devastating.\n‘I might be on my face in agony and tears, and not know what to do, but I believe that with God’s help I can rise again. There is hope. There is a new dawn. There are new beginnings. God does bring beauty out of ashes. He does bring good out of evil. He does triumph over death. I will cling to God with all that I have. I will put my trust in his goodness.’\nDavid, in the Psalms, speaks of ‘desperate times’ (Psalm 60:3). There are times in life when everything seems to go wrong. Maybe even now you are facing a desperate situation – perhaps with your health, a bereavement, the breakdown of a relationship, work problems, family difficulties, financial trouble or a combination of these. Even in desperate times, you can find the three great virtues of faith, hope and love.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 133
}