{
  "title": "Episode 85: How to Make Learning Fun Again? Constructivism and Democratic Schools - Part 2",
  "pubDate": "Fri, 30 Jan 2009 22:15:48 +0000",
  "guid": "episode-85-how-to-make-learning-fun-again-constr",
  "link": "http://www.thepsychfiles.com/2009/01/30/episode-85-how-to-make-learning-fun-again-constructivism-and-democratic-schools-part-2/",
  "itunes:image": "",
  "description": "What the heck is constructivism anyway?  In this episode I explore that topic with Dr. Eugene Geist.  We also  explore what some would consider a radical concept in education:democratic schools.  What would happen if we let children decide how they wanted to learn?  Complete Chaos? Or an exciting new way to get students involved in and taking responsibility for learning? Find out in this episode of The Psych Files.",
  "content:encoded": "What the heck is constructivism anyway?  In this episode I explore that topic with Dr. Eugene Geist.  We also  explore what some would consider a radical concept in education:democratic schools.  What would happen if we let children decide how they wanted to learn?  Complete Chaos? Or an exciting new way to get students involved in and taking responsibility for learning? Find out in this episode of The Psych Files.",
  "enclosure": "",
  "itunes:duration": "25:28",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology,lecture,schools,Democratic,constructivism",
  "itunes:subtitle": "In this episode I explore that topic with Dr. Eugene Geist. We also explore what some would consider a radical concept in education: democratic schools. An exciting way to get students involved in learning.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "What the heck is constructivism anyway? In this episode I explore that topic with Dr. Eugene Geist. We also explore what some would consider a radical concept in education:democratic schools. What would happen if we let children decide how they wanted to learn? Complete Chaos? Or an exciting new way to get students involved in and taking responsibility for learning? Find out in this episode of The Psych Files."
}