{
  "title": "Global Imbalances: The Role of Exchange Rates and Other Policies in External Adjustments",
  "description": " Concern over external imbalances – specifically “excessive” trade deficits and surpluses – is nothing new. But the current environment of escalating trade tensions between the world’s two largest economies underscores the importance of understanding the actual drivers of trade outcomes. Exchange rates are part of the story, but only a part.<br />\n<br />\nIn the wake of the Global Financial Crisis, and at the direction of the world’s largest economies, the IMF began publishing an annual report to identify the key sources and drivers of external imbalances. The IMF’s latest ESR estimates that about 35 to 45 percent of overall current account surpluses and deficits were “excessive” in 2018, are increasingly concentrated in advanced economies, and are now driven mainly by fiscal policies and structural factors.<br />\n<br />\nOn September 13, Dr. Gita Gopinath, Economic Counsellor and Director of the Research Department at the IMF, will speak to the findings of the latest ESR in a keynote address at CSIS. She will then be joined by an expert panel to discuss global imbalances and the dynamics of external adjustment.<br />\n<br />\n<b>Keynote address</b><b>:</b><br />\n<a href=\"https://blogs.imf.org/bloggers/gita-gopinath/\">Gita Gopinath</a>, Economic Counsellor and Director of the Research Department at the International Monetary Fund (IMF)<br />\n<br />\n<i>Introduced by</i><br />\n<a href=\"https://www.csis.org/people/matthew-p-goodman\">Matthew P. Goodman</a>, Senior Vice President and Simon Chair in Political Economy, CSIS<br />\n<br />\n<b>Expert panel featuring:</b><br />\n<a href=\"https://www.iif.com/About-Us/Our-Leadership\">Robin Brooks</a>, Managing Director and Chief Economist, Institute of International Finance<br />\n<a href=\"https://www.omfif.org/about/team/mark-sobel/\">Mark Sobel</a>, US Chairman, OMFIF; former Deputy Assistant Secretary, US Treasury; and former US representative at the IMF<br />\n<br />\n<i>Moderated by</i><br />\n<a href=\"https://www.csis.org/people/stephanie-segal\">Stephanie Segal</a>, Simon Chair Senior Fellow, CSIS<br />\n<br />\n<i>This event was made possible by general support to CSIS.</i> ",
  "itunes:author": "Matthew P. Goodman, Stephanie Segal, Mark Sobel",
  "pubDate": "Fri, 13 Sep 2019 09:00:00 -0400",
  "enclosure": "",
  "itunes:duration": "1:30:36",
  "guid": "https://csis-website-prod.s3.amazonaws.com/s3fs-public/field_soundcloud_audio/Global%20Imbalances-%20The%20Role%20of%20Exchange%20Rates%20and%20Other%20Policies%20in%20External%20Adjustments.mp3"
}