{
  "id": "https://bibleinoneyear.org/en/youth/240",
  "title": "Day 240: Just Love",
  "description": "Proverbs 21:13,15, 2 Chronicles 32:7–8,22–26, 2 Corinthians 2:3–11.  He is also just  In his book *Justice in Love*, Nicholas Wolterstorff points out that justice is a necessary constituent part of any properly formed conception of love",
  "pubDate": "Sun, 28 Aug 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/240/",
  "itunes:duration": "14:07",
  "guid": "enyouth28082022-240",
  "length": 847.05,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 240: Just Love",
  "itunes:subtitle": "Proverbs 21:13,15, 2 Chronicles 32:7–8,22–26, 2 Corinthians 2:3–11.  He is also just  In his book *Justice in Love*, Nicholas Wolterstorff points out that justice is a necessary constituent part of any properly formed conception of love",
  "itunes:summary": "The prison governor was an immensely impressive, dynamic, eloquent and young African-American woman known as ‘Chief Jennifer’.\nOur team assembled at the start of the visit, together with those who ran the prison. Chief Jennifer welcomed us with these words: ‘Greetings in the name of our Lord and Saviour Jesus Christ.’\nShe told us that there were 2.5 million people in prison in the USA, each costing the taxpayer $24,000 a year. Only 3% will stay in prison for the rest of their lives. 97% of those presently incarcerated will, at some point, be released back into society. For that reason, she continued, there was good secular motivation for wanting to see change in their lives, besides her own desire, as a Christian, for them to experience redemption.\nThe prison was run not only with justice, but also with love. All wrong attitudes and actions were lovingly confronted. There was no bad language, no graffiti and a learned respectful behaviour. We spent some time with a group of men who had recently completed Alpha there and heard their testimonies of changed lives.\nGod is love. He is also just. In his book Justice in Love, Nicholas Wolterstorff points out that justice is a necessary constituent part of any properly formed conception of love.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 605
}