{
  "guid": "urn:uuid:275bb930-975c-451f-8cb8-073b85dd3420",
  "link": "https://www.who.int/news/item/28-09-2022-who-and-ilo-call-for-new-measures-to-tackle-mental-health-issues-at-work",
  "a10:author": {
    "a10:name": ""
  },
  "title": "WHO and ILO call for new measures to tackle mental health issues at work",
  "description": "<p><em>New global WHO guidelines on mental health at work are reinforced by practical strategies outlined in a joint WHO/ILO policy brief.</em></p><p>WHO and the International Labour Organization (ILO) have called for concrete actions to address mental health concerns in the working population.</p><p>An estimated 12 billion workdays are lost annually due to depression and anxiety costing the global economy nearly US$ 1 trillion. Two new publications which aim to address this issue are published today - WHO Guidelines on mental health at work and a\n    derivative WHO/ILO policy brief. </p><p>WHO&rsquo;s global guidelines on mental health at work recommend actions to tackle risks to mental health such as heavy workloads, negative behaviours, and other factors that create distress at work. For the first time WHO recommends manager training,\n    to build their capacity to prevent stressful work environments and respond to workers in distress. </p><p>WHO&rsquo;s <a href=\"https://www.who.int/publications-detail-redirect/9789240049338\">World Mental Health Report</a>,\n published in June 2022, showed that of one billion people living with a mental disorder in 2019, 15% of working-age adults experienced a mental disorder. Work amplifies wider societal issues that negatively affect mental health, including discrimination\n    and inequality. Bullying and psychological violence (also known as &ldquo;mobbing&rdquo;) is a key complaint of workplace harassment that has a negative impact on mental health. Yet discussing or disclosing mental health remains a taboo in work settings\n    globally. </p><p>The guidelines also recommend better ways to accommodate the needs of workers with mental health conditions, propose interventions that support their return to work and, for those with severe mental health conditions, provide interventions that facilitate\n    entry into paid employment. Importantly, the guidelines call for interventions aimed at the protection of health, humanitarian, and emergency workers. </p><p>&ldquo;It&rsquo;s time to focus on the detrimental effect work can have on our mental health,&rdquo; said Dr Tedros Adhanom Ghebreyesus, WHO Director-General. &ldquo;The well-being of the individual is reason enough to act, but poor mental health can\n    also have a debilitating impact on a person&rsquo;s performance and productivity. These new guidelines can help prevent negative work situations and cultures and offer much-needed mental health protection and support for working people.&rdquo;</p><p>A separate WHO/ILO policy brief explains the WHO guidelines in terms of practical strategies for governments, employers and workers, and their organizations, in the public and private sectors. The aim is to support the prevention of mental health risks,\n    protect and promote mental health at work, and support those with mental health conditions, so they can participate and thrive in the world of work. Investment and leadership will be critical to the implementation of the strategies.</p><p>&ldquo;As people spend a large proportion of their lives in work &ndash; a safe and healthy working environment is critical. We need to invest to build a culture of prevention around mental health at work, reshape the work environment to stop stigma and\n    social exclusion, and ensure employees with mental health conditions feel protected and supported,&rdquo; said, Guy Ryder, ILO Director-General.</p><p>The <a href=\"https://www.ilo.org/dyn/normlex/en/f?p=NORMLEXPUB:12100:0::NO::P12100_ILO_CODE:C155\" target=\"_blank\">ILO Occupational Safety and Health Convention (No. 155)</a> and <a href=\"https://www.ilo.org/dyn/normlex/en/f?p=NORMLEXPUB:12100:0::NO::P12100_ILO_CODE:R164\" target=\"_blank\">Recommendation (No. 164)</a> provides legal frameworks to protect the health and safety of workers. However, the <a href=\"https://www.who.int/publications-detail-redirect/9789240036703\">WHO Mental Health Atlas</a> found that only 35% of countries reported having national programmes for work-related mental health promotion and prevention.</p><p><a href=\"https://www.who.int/news/item/02-03-2022-covid-19-pandemic-triggers-25-increase-in-prevalence-of-anxiety-and-depression-worldwide\">COVID-19 triggered a 25% increase in general anxiety and depression worldwide</a>, exposing how unprepared governments were for its impact on mental health, and revealing a chronic global shortage of mental health resources. In 2020, governments worldwide\n    spent an average of just 2% of health budgets on mental health, with lower-middle income countries investing less than 1%.</p><p>&nbsp;</p>",
  "pubDate": "Tue, 27 Sep 2022 10:07:13 Z"
}