{
  "title": "Turkey criticizes NATO applicants over lack of progress",
  "link": "https://www.rt.com/news/565859-turkey-extraditions-finland-sweden/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565859-turkey-extraditions-finland-sweden/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6363970185f5404c79089d7c.jpg\" /> Turkish Justice Minister Bekir Bozdag said Finland and Sweden have not extradited people that are wanted by Türkiye <br/><a href=\"https://www.rt.com/news/565859-turkey-extraditions-finland-sweden/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Helsinki and Stockholm had pledged to address Ankara's concerns about suspected terrorists</strong></p>\n            \n                        \n            <p>Finland and Sweden have not extradited a single \"terrorism\" suspect to T&uuml;rkiye since pledging to review Ankara's requests, a top official has complained.</p>\n<p>T&uuml;rkiye made support from the two Nordic countries, in this area, a condition for NATO entry.</p>\n<p>Turkish Justice Minister Bekir Bozdag reported a lack of progress with extraditions in an interview with the TV new channel A Haber on Thursday.</p>\n<p><em>&ldquo;There are positive conversations. They offered some explanations. They have reviews underway. There were no people who have been extradited from Finland and Sweden to us,&rdquo;</em> the official said.</p>\n<p>He noted that his country wants the two Nordic nations to <em>&ldquo;support T&uuml;rkiye&rsquo;s fight against terrorism&rdquo;</em> before Ankara would agree to their NATO bids. The US-led military bloc gives every member state a veto on expansion.</p>\n<p>Finland and Sweden applied for NATO membership in May, claiming that such a move was necessary to gain protection against Russia. Hungary and T&uuml;rkiye are the only members of the organization that have not yet ratified the applications. Budapest pledged to do so by mid-December, but Ankara has not set a deadline.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6361475a20302727b05a92a0.jpg\" alt=\"FILE PHOTO.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565752-turkey-sweden-nato-not-ready/\">Türkiye not ready to approve Sweden’s NATO bid</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>The two prospective members signed an agreement with T&uuml;rkiye in June in which they pledged to address a list of Turkish concerns. Among other things, Ankara accused the Nordic nations of harboring <em>&ldquo;terrorists&rdquo;</em> on their soil and failing to crack down on their operations to finance activities against T&uuml;rkiye.</p>\n<p>The Turkish allegations were referring to individuals whom it suspects of having ties with the Kurdistan Workers Party (PKK) and the movement of US-based Turkish cleric Fethullah Gulen.</p>\n<p>The PKK waged a decades-long guerrilla war against T&uuml;rkiye and is considered a terrorist organization by the EU. Ankara blamed Gulen for masterminding a failed military coup in 2016.</p>\n<p>NATO Secretary General Jens Stoltenberg will visit T&uuml;rkiye this week to discuss, among other things, the bids of Finland and Sweden, according to the news agency Anadolu.</p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 10:53:31 +0000",
  "dc:creator": "RT"
}