{
  "title": "TU86: Mentalization and Regression, Responding to Listener’s Questions with Sue Marriott",
  "link": "https://therapistuncensored.com/episodes/86-mentalization-and-regression-responding-to-listeners-questions-with-sue-marriott/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=86-mentalization-and-regression-responding-to-listeners-questions-with-sue-marriott",
  "pubDate": "Fri, 21 Dec 2018 02:46:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=6682",
  "description": "Therapist Uncensored co-host Sue Marriott ends the year with an episode answering two great questions about mentalization, regression and attachment left by listeners. By the way she totally missed her co-host and partner in crime, Dr. Ann Kelley, who was out of town and could not make it work before end of year. Hi Ann! Can’t wait to have you back on air!\nIn this episode, we discuss:\nQuestion 1: “If someone is so far on the blue spectrum, they are completely out of touch with emotions and needs and intimate relationships, trying to think of what the other person feels or staying curious seems almost impossible. It feels like mentalizing is too much to ask from that person. Is there something of an approach you can recommend prior to mentalizing, to basically make it even possible?”\n\n \tA recap on what mentalizing is and how it works – conscious and unconscious examples\n \tThe Three Pillars model for treating secure attachment – mentalizing isn’t the only intervention. You need to work on gaining an agreement, or getting collaboration that this is even a goal. Also introducing safety via imagery or real relationships to move the person to a more secure, confident place to begin to open up and not be so righteous and certain.\n \tAll this helps to move from certainty to curiosity – and curiousity helps with mentalization/mindsight/mirror neurons/reflective function….\n\nQuestion 2: “How to deal with regression and attachment, especially when we are facing frustrating times and emotionally heightened situations? How do we avoid steering into the deep dark corner of your personal attachment which is making the relationship at risk? How do we secure ourselves or your partner?”\n\n \tDiscussion of difference between regression and just having attachment insecurity as a whole, living in the blue vs. resorting to dismissiveness or avoidance due to current environmental or internal stressors.\n \tNoticing the signs of regression\n \tLearning about your triggers, patterns and warning flags of regression – know where your bones are buried. Make a map of your psyche so you can more fully trust yourself and know when not to trust your (usually very strong) reactions.\n \tJournaling is a great way to make your map and keep yourself on course. If nothing else, do this to continue to grow your secure coherent narrative towards integration. Integration protects relationships.\n\n \nResources from this episode:\nThis video is a must watch even if you’ve seen the concept discussed before… Study it, learn it, use it in daily life. Please!\n\nMore on Dan’s handmodel of the brain – Psychalive. \n\nHealing Attachment Disruptions in Adults, Comprehensive Treatment and Repair by Dan Brown and David Elliott This is MUST HAVE book for your professional library. If it’s too dense… stay in touch we have a few options available soon for you from both Elliott and Brown…. Fun stuff to be announced soon.\n\nMinding Emotions Cultivating Mentalization in Psychotherapy – by Elliot Jurist\n\nThank you to our brave listeners who allowed us to use their great questions – Sina from Berlin, Germany and Avy! Please uncensor yourself and leave us a message on our voicemail ! So fun! \n\nEnjoying this episode? Then you’ll probably enjoy this previous publication as well, Reading Between the Lines, Attachment in the Classrooms with Linnno Rhodes\n\nWant to ensure we can keep it going and have more access to more content?\n\nBecome a supporter of the show at http://www.patreon.com/therapistuncensored\n\n \nJoin the Conversation\nThe easiest way to dive in is to like our Facebook – it’s an active page and there is even a private FB community where you can discuss directly with other listeners. Also, we do a bit on Twitter if that’s how you roll! And you can find a couple forays into videos on You Tube if ya can believe that?\n\nFinally, join our email list through the front page of our website (this gets you access to our private FB group if you want to sign up for that ...",
  "enclosure": "",
  "itunes:subtitle": "Therapist Uncensored co-host Sue Marriott ends the year with an episode answering two great questions about mentalization, regression and attachment left by listeners. By the way she totally missed her co-host and partner in crime, Dr. Ann Kelley,",
  "itunes:summary": "We end the year by co-host Sue Marriott addressing in depth 2 questions from our audience.  These focus on mentalization, the attachment spectrum and regression.  We look at how we can lose the capacity to mentalize when we are in a dismissing state of mind and what happens when we regress into early modes of functioning - fun juicy topics!  Enjoy!",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "32:41"
}