{
  "title": "Analyzing Analysts",
  "link": "",
  "published": "2015-02-08T14:15:00-08:00",
  "updated": "2015-02-08T14:15:00-08:00",
  "author": {
    "name": "Dustin McIntosh"
  },
  "id": "tag:efavdb.com,2015-02-08:/analyzinganalysts",
  "summary": "<p>In this post, Dustin provides an overview of some of his work from his time in the <a href=\"http://insightdatascience.com/\">Insight Data Science Fellowship</a> program — work done in collaboration with <a href=\"https://modeanalytics.com/\">Mode Analytics</a>, an online collaborative <span class=\"caps\">SQL</span>&nbsp;platform.</p>\n<p><strong><a href=\"//www.slideshare.net/DustinMcIntosh/insight-demo-44864932\" title=\"Insight Demo\">Insight Demo</a></strong> from <strong><a href=\"//www.slideshare.net/DustinMcIntosh\">Dustin&nbsp;McIntosh</a></strong></p>\n<p>Many high-value business insights have their answers rooted in data. Companies …</p>",
  "content": "<p>In this post, Dustin provides an overview of some of his work from his time in the <a href=\"http://insightdatascience.com/\">Insight Data Science Fellowship</a> program — work done in collaboration with <a href=\"https://modeanalytics.com/\">Mode Analytics</a>, an online collaborative <span class=\"caps\">SQL</span>&nbsp;platform.</p>\n<p><strong><a href=\"//www.slideshare.net/DustinMcIntosh/insight-demo-44864932\" title=\"Insight Demo\">Insight Demo</a></strong> from <strong><a href=\"//www.slideshare.net/DustinMcIntosh\">Dustin&nbsp;McIntosh</a></strong></p>\n<p>Many high-value business insights have their answers rooted in data. Companies hire data analysts to extract these insights by dissecting their data, largely through querying databases with <span class=\"caps\">SQL</span> (Structured Query&nbsp;Language).</p>\n<p>However, data analysis can often be difficult. <a href=\"https://modeanalytics.com\">Mode Analytics</a> is a company that aims to streamline the process of learning and engaging in data analysis with <span class=\"caps\">SQL</span>, both for experts and novices alike. As an Insight Data Science Fellow, I have been working with Mode to help them analyze their users&#8217; <span class=\"caps\">SQL</span> code, mistakes and all, to identify opportunities for product improvement. Specifically, I&#8217;ve been trying to address the following&nbsp;questions:</p>\n<ul>\n<li>What types of <span class=\"caps\">SQL</span> errors do users make? Do these vary with user ability&nbsp;level?</li>\n<li>Do early struggles dishearten beginners, hampering them from becoming power&nbsp;users?</li>\n<li>More generally, what characteristics differentiate the <span class=\"caps\">SQL</span> queries of aspiring and expert&nbsp;analysts?</li>\n<li>Given answers to these questions, how can Mode modify their product to make analysis easier for their&nbsp;users?</li>\n</ul>\n<p>My analysis uncovered a number of actionable insights for&nbsp;Mode:</p>\n<ol>\n<li>Mostly, analysts make the same sorts of errors regardless of their ability level. The good news is that many of these errors are avoidable: Mode can&nbsp;help.</li>\n<li>Novice users actually do not seem to churn due to frustration with errors. It&#8217;s more likely that they leave due simply to having completed the tutorials - Mode can increase user retention by proactively encouraging users to upload and interact with their own private data after finishing the&nbsp;tutorials.</li>\n<li>Mode can customize the user experience soon after a user joins the site in order to better serve users based on their <span class=\"caps\">SQL</span> skills. To this end, I built a model to classify users as experts or novices based on the content of their queries. This model reveals that experts take extra care in the formatting of their queries, implying an advanced knowledge of the <span class=\"caps\">SQL</span> structure that could be emphasized in the&nbsp;tutorials.</li>\n</ol>\n<p><strong><span class=\"caps\">WHAT</span> <span class=\"caps\">IS</span> <span class=\"caps\">MODE</span> <span class=\"caps\">AND</span> <span class=\"caps\">WHO</span> <span class=\"caps\">ARE</span> <span class=\"caps\">THEIR</span> <span class=\"caps\">USERS</span>?</strong></p>\n<p><a href=\"https://modeanalytics.com/\">Mode Analytics</a> provides a one-stop shop for all the needs of a data analyst. Users can easily connect their data to Mode&#8217;s web-based app, query it with <span class=\"caps\">SQL</span>, and create and share visualizations of their analysis to convey the insights they&#8217;ve extracted. In addition, Mode offers free instruction via their <a href=\"http://sqlschool.modeanalytics.com/\"><span class=\"caps\">SQL</span> school</a>, which instructs novices on the basics of <span class=\"caps\">SQL</span> while querying some public, tutorial datasets.<br>\n<a href=\"https://efavdb.com/wp-content/uploads/2015/02/errorRate31.png\"><img alt=\"errorRate3\" src=\"https://efavdb.com/wp-content/uploads/2015/02/errorRate31.png\"></a><br>\nWith the goal of cohorting users based on their ability level, I group users based on the number of queries they have submitted to Mode (see plot at right of tutorial reference rate and error rate by&nbsp;cohort):</p>\n<ol>\n<li>Power users (1000 + queries): this group primarily queries private data sources with no need for the tutorials, making only occasional&nbsp;errors.</li>\n<li>Novices (10-1000 queries): the majority of these users are heavily invested in the tutorials and are making a lot more errors than the experts as they&nbsp;learn.</li>\n<li>Infrequent queriers (&lt;10 queries): these users have only visited Mode&#8217;s website long enough to make a few queries - most of which are easy tutorial exercises on which they are making very few&nbsp;errors.</li>\n</ol>\n<p>The demarcations at 10 and 1000 queries are somewhat arbitrary at this point. Undoubtedly, there are many experts hidden in the 10-1000 category who already possess advanced <span class=\"caps\">SQL</span> knowledge, but are yet to extensively use Mode’s platform for their analysis. As we will see, we can build a model to distinguish these users based on the content of their queries rather than their query&nbsp;count.</p>\n<p>The primary goal, from a business perspective, is to move users up this list: get infrequent queriers invested in the product and get novice tutorial users up to speed with <span class=\"caps\">SQL</span> so they can enjoy all aspects of Mode&#8217;s product. For the remainder of the post, I ignore the infrequent queriers [1] in favor of analyzing novices and the differences between them and the&nbsp;experts.</p>\n<p><strong><span class=\"caps\">WHAT</span> <span class=\"caps\">ERRORS</span> <span class=\"caps\">DO</span> <span class=\"caps\">SQL</span> <span class=\"caps\">USERS</span> <span class=\"caps\">MAKE</span>?</strong></p>\n<p><span class=\"caps\">SQL</span> is a very simple language. With a simple, declarative style and only about 200 keywords in total, of which only a few dozen are in common usage [2], there is very little to memorize for <span class=\"caps\">SQL</span> users. Thus, most errors should be recognizable and avoidable in product design. Examining the types of errors <span class=\"caps\">SQL</span> users make informs us how we can make an analyst&#8217;s experience better through the Mode platform.  In the plot below, I count the number of each type of error made by the two cohorts (experts and novices).<br>\n<a href=\"https://efavdb.com/wp-content/uploads/2015/02/errorClass1.png\"><img alt=\"errorClass\" src=\"https://efavdb.com/wp-content/uploads/2015/02/errorClass1.png\"></a></p>\n<p>The most striking thing about this analysis is that the two most common error types are forgetting and/or misspelling table and column names. Fortunately, these errors are easily addressed through product design: simply prominently displaying the table/column names may significantly reduce errors. It may even be possible in some instances to auto-fill the&nbsp;names.</p>\n<p>There are a few subtle differences between expert and novice errors worth noting. Novice users tend to make more syntax errors, which is not a surprise given they are less familiar with the language. Power users, on the other hand, make a broader distribution of errors (e.g., a lot more rare errors). Further, experts much more frequently run into the limits of the system (e.g., timeouts, internal errors), an indication that they are running more complex queries. From a product perspective, correcting errors for novices is the priority as they make the most errors and are less likely to know how to correct them. Further, as novices tend to make a narrower range of errors, it is likely possible to parse out many of these errors and either auto-correct them or provide more personalized help to the user than the standard <span class=\"caps\">SQL</span> error&nbsp;messages.</p>\n<p><strong><span class=\"caps\">DO</span> <span class=\"caps\">NOVICES</span> <span class=\"caps\">GET</span> <span class=\"caps\">FRUSTRATED</span> <span class=\"caps\">AND</span> <span class=\"caps\">QUIT</span>?</strong></p>\n<p>A principal concern for educating the novice users is that they may consistently run into certain types of errors, not understand how to correct them, and quit out of frustration. Should Mode customize the standard error messages to better direct novices to their problems? To see whether or not this is the case, I looked at the set of churned novice users (those that have not made a query since November) and examined their final few queries. If user frustration is causing churn, we expect the error rate to increase as the users approach churn.<br>\n<a href=\"https://efavdb.com/wp-content/uploads/2015/02/errorChurn.png\"><img alt=\"errorChurn\" src=\"https://efavdb.com/wp-content/uploads/2015/02/errorChurn.png\"></a></p>\n<p>Surprisingly, the rate at which users commit errors before they churn is actually lower than the group&#8217;s average error rate and decreases until they churn. Thus, we can infer that the average novice does <strong>not</strong> quit due to frustration with errors they are making - this is not a major concern for customer&nbsp;retention.</p>\n<p>However, Mode could be more proactive about transitioning customers from their <span class=\"caps\">SQL</span> school to connecting their own data and using their visualization tools. 88% of users that churn have not connected their own data sources and are working exclusively on the tutorial datasets. One potential product enhancement is to periodically remind tutorial users of the possibility of connecting their own data and to add tutorial exercises introducing the visualization&nbsp;tools.</p>\n<p><strong><span class=\"caps\">WHAT</span>&#8217;S <span class=\"caps\">IN</span> A <span class=\"caps\">SQL</span> <span class=\"caps\">EXPERT</span>&#8217;S <span class=\"caps\">QUERY</span>?</strong></p>\n<p>As discussed above, drawing a line at 1000 queries is not a very useful classification metric for experts versus novices. There are many experts that come to Mode with a lot of expertise in <span class=\"caps\">SQL</span>, but have not made 1000 queries yet.  Thus, I developed a model based on a Random Forest classifier to differentiate expert and novice <span class=\"caps\">SQL</span> users based on the content of their queries [3]. This model accurately classifies users based on a single query roughly 65% of the time for both classes. Accuracy of the prediction will go up the more unique queries a user submits; for example, after ten queries accuracy may be as high as 90%&nbsp;[4].</p>\n<p><a href=\"https://efavdb.com/wp-content/uploads/2015/02/featureImportance5.png\"><img alt=\"featureImportance5\" src=\"https://efavdb.com/wp-content/uploads/2015/02/featureImportance5.png\"></a></p>\n<p>One interesting aspect of the Random Forest model is that it determines the most important features that define an expert&#8217;s query from a novice&#8217;s. The result is clear: Of the top five most important features, three of them have to do with formatting; experts take more care in their use of white space, line breaks, and parentheses. In particular, in their queries, experts have a higher density of white space, a lower density of line breaks, and a higher density of parentheses. Thus, experts tend to have longer lines of code with more white space. The two remaining features in the top five, query length and frequency of “select” and “from”, indicate that experts tend to write longer queries with more&nbsp;subqueries.</p>\n<p>Being able to classify a user as an expert or novice based on the content of their queries would be extremely useful for personalizing user experience. If a user connects their data early on and it becomes clear that they have limited experience with <span class=\"caps\">SQL</span>, Mode would like to be able to direct those users to relevant tutorials or perhaps to work related to theirs that was performed by experts. Likewise, if a user immediately demonstrates advanced <span class=\"caps\">SQL</span> knowledge, Mode would like to direct them to, for example, the data visualization tools that make Mode&#8217;s platform uniquely useful to the experienced analyst. Implementation of my model would permit&nbsp;this.</p>\n<p><strong><span class=\"caps\">CONCLUSIONS</span></strong></p>\n<p>This analysis provides a number of actionable insights for Mode in serving their user&nbsp;base:</p>\n<ol>\n<li>Everyone using the platform is affected by errors relating to misspelling or altogether forgetting the names of the tables and their contained fields in their databases. Implementing an auto-complete of these names or prominently displaying them for the user could considerably reduce the number of errors encountered on&nbsp;Mode.</li>\n<li>Most users that churn are not leaving out of frustration with the errors they are making. The vast majority of churning users, however, are exclusively querying tutorial datasets. Mode can try to get tutorial users more invested in their product by prompting them to connect their data periodically throughout the&nbsp;tutorial.</li>\n<li>In addition to tutorial-using novices and the true <span class=\"caps\">SQL</span> experts, Mode has a third class of users. Their query history does not reveal much about them: they only visit Mode briefly, submitting just a few tutorial exercises without making many errors. Looking into who these visitors are via, for example, google analytics data, may provide insight into how to retain these potential&nbsp;users.</li>\n<li>User ability level can be determined based on the content of their first several queries to Mode. This is useful as Mode can effectively personalize response to users as they join the&nbsp;platform.</li>\n</ol>\n<p><strong><span class=\"caps\">FOOTNOTES</span></strong></p>\n<p>[1] The query history of the infrequent queriers does not provide very much information as to who these users are. Gathering additional information on these users may prove useful in determining how to retain these&nbsp;customers.</p>\n<p>[2] <em>Top-Heavy Nature of <span class=\"caps\">SQL</span> -</em>Of the approximately 200 keywords in the <span class=\"caps\">SQL</span> vocabulary, a very small subset are even remotely common. Looking at the fraction of queries containing each keyword from the expert dataset demonstrates just how top heavy the language is. Each keyword not present on this plot appears in fewer than 4% of all unique queries in the dataset.<br>\n<a href=\"https://efavdb.com/wp-content/uploads/2015/02/SQL_keywords_expert.png\"><img alt=\"SQL_keywords_expert\" src=\"https://efavdb.com/wp-content/uploads/2015/02/SQL_keywords_expert.png\"></a>[3] <em>Labeling the Training Set -</em>I define users with &gt;1000 queries as experts and take only a subset of their most recent queries (those submitted since November 2014) - assuming that they have become better queriers with time. For the novice training set, it is not possible to strictly take the users from the 10-1000 query group as there are likely some new-comer experts in that category (experienced <span class=\"caps\">SQL</span> users that have just recently joined Mode). Instead, I took only users with 100-1000 queries that had participated extensively in the tutorials. I then remove those tutorial queries from their set and label those remaining as novice queries for training.<br>\n<em>Feature Selection/Engineering</em>- I use a bag-of-words approach with language defined by <span class=\"caps\">SQL</span>&#8217;s keywords. Additional features include query length, number of unique keywords in the query (diversity), as well as fraction of the query that is white space, line breaks, and parentheses. Several keywords are strongly correlated with one another; for this reason, I combine some together (e.g., “select” and “from”) and remove others from the analysis entirely (e.g., “as”, “by” and&nbsp;“on”).</p>\n<p>[4]<em>Growing confidence of classification -</em>If a user&#8217;s successive queries were independent of one another we would expect confidence in the prediction to grow in accordance with a binomial distribution: <span class=\"math\">\\(P(\\)</span>misclassify<span class=\"math\">\\() = \\sum_{i = 0}^{\\lfloor n/2 \\rfloor} \\binom{n}{i} p^i (1-p)^{n-i}\\)</span> with <span class=\"math\">\\(p \\approx 0.65\\)</span> and <span class=\"math\">\\(n\\)</span> the number of queries. After ten queries the misclassification error reduces to roughly 10%; after 20 queries - 5%. However, a user&#8217;s queries are typically not independent of one another, so this is likely a generous&nbsp;estimate.</p>\n<script type=\"text/javascript\">if (!document.getElementById('mathjaxscript_pelican_#%@#$@#')) {\n    var align = \"center\",\n        indent = \"0em\",\n        linebreak = \"false\";\n\n    if (false) {\n        align = (screen.width < 768) ? \"left\" : align;\n        indent = (screen.width < 768) ? \"0em\" : indent;\n        linebreak = (screen.width < 768) ? 'true' : linebreak;\n    }\n\n    var mathjaxscript = document.createElement('script');\n    mathjaxscript.id = 'mathjaxscript_pelican_#%@#$@#';\n    mathjaxscript.type = 'text/javascript';\n    mathjaxscript.src = 'https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.3/latest.js?config=TeX-AMS-MML_HTMLorMML';\n\n    var configscript = document.createElement('script');\n    configscript.type = 'text/x-mathjax-config';\n    configscript[(window.opera ? \"innerHTML\" : \"text\")] =\n        \"MathJax.Hub.Config({\" +\n        \"    config: ['MMLorHTML.js'],\" +\n        \"    TeX: { extensions: ['AMSmath.js','AMSsymbols.js','noErrors.js','noUndefined.js'], equationNumbers: { autoNumber: 'none' } },\" +\n        \"    jax: ['input/TeX','input/MathML','output/HTML-CSS'],\" +\n        \"    extensions: ['tex2jax.js','mml2jax.js','MathMenu.js','MathZoom.js'],\" +\n        \"    displayAlign: '\"+ align +\"',\" +\n        \"    displayIndent: '\"+ indent +\"',\" +\n        \"    showMathMenu: true,\" +\n        \"    messageStyle: 'normal',\" +\n        \"    tex2jax: { \" +\n        \"        inlineMath: [ ['\\\\\\\\(','\\\\\\\\)'] ], \" +\n        \"        displayMath: [ ['$$','$$'] ],\" +\n        \"        processEscapes: true,\" +\n        \"        preview: 'TeX',\" +\n        \"    }, \" +\n        \"    'HTML-CSS': { \" +\n        \"        availableFonts: ['STIX', 'TeX'],\" +\n        \"        preferredFont: 'STIX',\" +\n        \"        styles: { '.MathJax_Display, .MathJax .mo, .MathJax .mi, .MathJax .mn': {color: 'inherit ! important'} },\" +\n        \"        linebreaks: { automatic: \"+ linebreak +\", width: '90% container' },\" +\n        \"    }, \" +\n        \"}); \" +\n        \"if ('default' !== 'default') {\" +\n            \"MathJax.Hub.Register.StartupHook('HTML-CSS Jax Ready',function () {\" +\n                \"var VARIANT = MathJax.OutputJax['HTML-CSS'].FONTDATA.VARIANT;\" +\n                \"VARIANT['normal'].fonts.unshift('MathJax_default');\" +\n                \"VARIANT['bold'].fonts.unshift('MathJax_default-bold');\" +\n                \"VARIANT['italic'].fonts.unshift('MathJax_default-italic');\" +\n                \"VARIANT['-tex-mathit'].fonts.unshift('MathJax_default-italic');\" +\n            \"});\" +\n            \"MathJax.Hub.Register.StartupHook('SVG Jax Ready',function () {\" +\n                \"var VARIANT = MathJax.OutputJax.SVG.FONTDATA.VARIANT;\" +\n                \"VARIANT['normal'].fonts.unshift('MathJax_default');\" +\n                \"VARIANT['bold'].fonts.unshift('MathJax_default-bold');\" +\n                \"VARIANT['italic'].fonts.unshift('MathJax_default-italic');\" +\n                \"VARIANT['-tex-mathit'].fonts.unshift('MathJax_default-italic');\" +\n            \"});\" +\n        \"}\";\n\n    (document.body || document.getElementsByTagName('head')[0]).appendChild(configscript);\n    (document.body || document.getElementsByTagName('head')[0]).appendChild(mathjaxscript);\n}\n</script>",
  "category": ""
}