{
  "id": "yt:video:VKWEwBxDd9k",
  "yt:videoId": "VKWEwBxDd9k",
  "yt:channelId": "UCX6b17PVsYBQ0ip5gyeme-Q",
  "title": "Barack Obama: Crash Course Black American History #50",
  "link": "",
  "author": {
    "name": "CrashCourse",
    "uri": "https://www.youtube.com/channel/UCX6b17PVsYBQ0ip5gyeme-Q"
  },
  "published": "2022-11-02T21:39:23+00:00",
  "updated": "2022-11-04T18:05:04+00:00",
  "media:group": {
    "media:title": "Barack Obama: Crash Course Black American History #50",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Barack Obama was the first Black man elected President in the United States in 2008. In this episode, Clint Smith will explore the early life, political career, presidential campaign, and legislative milestones of Barack Obama.\n\nClint's book, How the Word is Passed, is available now! https://bookshop.org/books/how-the-word-is-passed-a-reckoning-with-the-history-of-slavery-across-america/9780316492935 \n\nWatch our videos and review your learning with the Crash Course App! \nDownload here for Apple Devices: https://apple.co/3d4eyZo\nDownload here for Android Devices: https://bit.ly/2SrDulJ\n\nCrash Course is on Patreon! You can support us directly by signing up at http://www.patreon.com/crashcourse\n\nThanks to the following patrons for their generous monthly contributions that help keep Crash Course free for everyone forever:\nKatie, Hilary Sturges, Austin Zielman, Tori Thomas, Justin Snyder, DL Singfield, Amelia Ryczek, Ken Davidian, Stephen Akuffo, Toni Miles, Steve Segreto, Kyle & Katherine Callahan, Laurel Stevens, Stacey Gillespie (Stacey J), Burt Humburg, Allyson Martin, Aziz Y, DAVID MORTON HUDSON, Perry Joyce, Scott Harrison, Mark & Susan Billian, Alan Bridgeman, Rachel Creager, Breanna Bosso, Matt Curls, Jonathan Zbikowski, Jennifer Killen, Sarah & Nathan Catchings, team dorsey, Trevin Beattie, Eric Koslow, Jennifer Dineen, Indika Siriwardena, Jason Rostoker, Shawn Arnold, Siobhán, Ken Penttinen, Nathan Taylor, Les Aker, William McGraw, ClareG, Rizwan Kassim, Constance Urist, Alex Hackman, Jirat, Pineapples of Solidarity ,Katie Dean, Thomas Greinert, Wai Jack Sin, Ian Dundore, Justin, Mark, Caleb Weeks\n\n__\n\nWant to find Crash Course elsewhere on the internet?\nFacebook - http://www.facebook.com/YouTubeCrashCourse\nTwitter - http://www.twitter.com/TheCrashCourse\nInstagram - https://www.instagram.com/thecrashcourse/\n\nCC Kids: http://www.youtube.com/crashcoursekids",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}