{
  "title": "The Science of Trust and Attachment with Dr. Steve Finn (180)",
  "link": "https://therapistuncensored.com/episodes/the-science-of-trust-and-attachment-with-dr-steve-finn-180/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=the-science-of-trust-and-attachment-with-dr-steve-finn-180",
  "pubDate": "Tue, 19 Jul 2022 00:46:13 +0000",
  "guid": "https://therapistuncensored.com/?p=13441",
  "description": "The science of trust is key.  Deciding who to trust in today&#039;s world is especially hard - fake news, political polarization and societal strife amplifies our already on guard nervous system. When our trust has been broken, whether early in childhood or in our adult relationships, learning who to trust can prove even more challenging. In today&#039;s episode, Dr. Steve Finn and Dr. Ann Kelley discuss the science behind epistemic trust and why many of us may have broken trust meters. They discuss how trust issues can create a mess in our relationship, whether we are the constant skeptic who resists taking in new information or we tend to trust blindly, without testing or holding healthy doubts. Together they provide deep and compassionate insights into these struggles and how they relate to internal working models. A fan favorite, Dr. Finn returns to bring his years of expertise to our listeners about ways to build curiosity and tools of mentalization, including our ability to handle healthy skepticism.  Shownotest at www.therapistuncensored.com/180",
  "enclosure": "",
  "itunes:subtitle": "The science of trust is key.  Deciding who to trust in today&#039;s world is especially hard - fake news, political polarization and societal strife amplifies our already on guard nervous system. When our trust has been broken,",
  "itunes:summary": "Deciding who to trust in today&#039;s world is especially hard - fake news, political polarization, and societal strife amplify our already on-guard nervous system. When our trust has been broken, whether early in childhood or in our adult relationships, learning who to trust can prove even more challenging. In today&#039;s episode, Dr. Steve Finn and Dr. Ann Kelley discuss the science behind epistemic trust and why many of us may have broken trust meters. They discuss how trust issues can create a mess in our relationship, whether we are the constant skeptic who resists taking in new information or we tend to trust blindly, without testing or holding healthy doubts. Together they provide deep and compassionate insights into these struggles and how they relate to internal working models. A fan favorite, Dr. Finn returns to bring his years of expertise to our listeners about ways to use science to build trust using curiosity and tools of mentalization, including our ability to handle healthy skepticism.",
  "itunes:author": "Sue Marriott LCSW, CGP & Ann Kelley PhD",
  "itunes:image": "",
  "itunes:season": 6,
  "itunes:episode": 180,
  "itunes:title": "The Science of Trust and Attachment with Dr. Steve Finn",
  "itunes:duration": "1:03:19"
}