{
  "title": "JASON NASH ON TRISHA PAYTAS BREAKUP, WITTEK VS DOBRIK LAWSUIT — BFFs EP. 92",
  "description": "<p>We are joined by Jason Nash in a home and home after Dave did his new podcast and we talk everything from Dave looking far younger than him, his relationship with Jeff Wittek and David Dobrik and having to be in the middle for Jeff's lawsuit, his background in comedy and how Dobrik saved him, his relationship and breakup with Trisha Paytas, and Bryce Hall not inviting Dave to his roast despite telling Jason he would. \n\nWe then get into headlines with Monty Lopez going crazy on the internet firing at anyone and everyone including Tana Mongeau and Yung Gravy, Kim Kardashian and Pete Davidson splitting, Dixie D'Amelio being the one who set up Landon Barker and Charli, Addison Rae getting heat for her \"Father Son Holy Spirit\" Adidas bikini, Jake Paul potentially fighting Andrew Tate, Vanessa Hudgens viral old picture with Kaia Gerber, Balenciaga selling $1,800 trash bags, and The Most Hated Man On The Internet.\n\nWe finish with BFFs corner finding out if Josh brought Livvy Dunne as a date to Nessa's Birthday party, Ethan Klein and H3 redeclaring war on us, Bri getting into beef with her ex online, and some videos to react to that Josh may or may not be a fan of us playing (spoiler, he's not).\n\nSupport our sponsors:\n\nGametime: Download the Gametime app at https://barstool.link/GametimeApp and redeem code BFF for $20 off your first purchase (terms apply).\n\nWhatnot: Download the Whatnot App today. Go to https://barstool.link/WhatnotBSS to get $10 off your first purchase on Whatnot.\n\nWould: Shop Would at https://barstool.link/wouldBSS  or at your local CVS.</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/bffspod\">barstool.link/bffspod</a></p>",
  "guid": "4234d709-3bc8-49b7-bd4a-3487f21e6e02",
  "pubDate": "Thu, 11 Aug 2022 00:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/134/Bffs",
  "itunes:explicit": "yes",
  "itunes:duration": "00:58:37",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}