{
  "title": "Kevin Bacon & Carly Aquilino Interviews, Chris D'Elia's Many Allegations",
  "description": "<p>Subscribe, Rate, and Leave a Review.\n\nWe start off the episode talking about the many allegations that have come out against Chris D'Elia. We talk about the people who spoke up immediately, those who didn't, and why you can't trust someone who doesn't have a vice. We go on to talk about the viral video of the cop who freaked out about McDonalds. Feits has a hot take. AITA Thursday returns with an adoption and hot sauce sex. Voicemails include winnable game shows, mapquest, and what grade missed out the most during the pandemic.\n\nCarly Aquilino (Girl Code, The King of Staten Island) joins the show. We discuss the clip KFC saw of hers that made him know she'd fit it on the show. She also gives us her perspective on the Chris D'Elia allegations. We go on to discuss why she doesn't drive, stand up comedy, acting, and much more.\n\nCheck out her podcast Secret Keepers Club here: https://podcasts.apple.com/us/podcast/secret-keepers-club/id1412042369\n\nKevin Bacon returns to the show. He has a new scary movie coming out (June 18th) called You Should Have Left. We talk about the what he likes about scary movies, adapting them from novels, and more. We also get his take on celebrity selfie video compilations (Imagine, I Take Responsibility), their intention, and their reception on social media. \nMake sure to check out his movie on demand. You can catch the trailer here:\nhttps://youtu.be/Bw0-cV_J9q4\n\nLet us know what you think on twitter:\n@KfcRadio @KfcBarstool @feitsbarstool @carlyaquilino @kevinbacon\n\nSubscribe to our Youtube Channel for daily clips and full video podcasts (Wed, Fri):\nhttps://www.youtube.com/user/KFCradio</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/kfcr\">barstool.link/kfcr</a></p>",
  "guid": "820f298e-5436-40d4-aaba-ef96b8e3c263",
  "pubDate": "Thu, 18 Jun 2020 08:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/kfc-radio",
  "itunes:explicit": "yes",
  "itunes:duration": "02:35:46",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}