{
  "id": "yt:video:2RV5D0xK-9I",
  "yt:videoId": "2RV5D0xK-9I",
  "yt:channelId": "UCjmJDM5pRKbUlVIzDYYWb6g",
  "title": "Black Adam | Darkness",
  "link": "",
  "author": {
    "name": "Warner Bros. Pictures",
    "uri": "https://www.youtube.com/channel/UCjmJDM5pRKbUlVIzDYYWb6g"
  },
  "published": "2022-09-20T17:17:35+00:00",
  "updated": "2022-09-22T07:23:25+00:00",
  "media:group": {
    "media:title": "Black Adam | Darkness",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "#BlackAdam Only in theaters October 21.\n\n-----------------\nhttps://www.facebook.com/blackadammovie\nhttps://www.instagram.com/blackadammo...\nhttps://twitter.com/blackadammovie\n-----------------\n\nFrom New Line Cinema, Dwayne Johnson stars in the action adventure “Black Adam.” The first-ever feature film to explore the story of the DC Super Hero comes to the big screen under the direction of Jaume Collet-Serra (“Jungle Cruise”).\n\nIn ancient Kahndaq, Teth Adam was bestowed the almighty powers of the gods. After using these powers for vengeance, he was imprisoned, becoming Black Adam. Nearly 5,000 years have passed and Black Adam has gone from man, to myth, to legend. Now released, his unique form of justice, born out of rage, is challenged by modern day heroes who form the Justice Society: Hawkman, Dr. Fate, Atom Smasher and Cyclone.\n\nJohnson stars alongside Aldis Hodge (“City on a Hill,” “One Night in Miami”) as Hawkman, Noah Centineo (“To All the Boys I’ve Loved Before”) as Atom Smasher, Sarah Shahi (“Sex/Life,” “Rush Hour 3”), Marwan Kenzari (“Murder on the Orient Express,” “The Mummy”), Quintessa Swindell (“Voyagers,” “Trinkets”) as Cyclone, Mo Amer (“Mo,” “Ramy”), Bodhi Sabongui (“A Million Little Things”), and Pierce Brosnan (the “Mamma Mia!” and James Bond franchises) as Dr. Fate.\n\nCollet-Serra directed from a screenplay written by Adam Sztykiel and Rory Haines & Sohrab Noshirvani, based on characters from DC, based on characters created by Bill Parker and C.C. Beck. The film’s producers are Beau Flynn, Hiram Garcia, Dwayne Johnson and Dany Garcia, with Toby Emmerich, Richard Brener, Dave Neustadter, Chris Pan, Walter Hamada, Adam Schlagman, Geoff Johns, Eric McLeod and Scott Sheldon executive producing.\n\nThe director’s behind-the-scenes creative team includes Oscar-nominated director of \nphotography Lawrence Sher (“Joker”), production designer Tom Meyer (“Real Steel”), editors Mike Sale (“Red Notice,” “Skyscraper”) and John Lee (“Anyone Home?”), costume designers Kurt and Bart (“Deadpool 2,” “The Hunger Games: Mockingjay – Part 1 & 2”), Oscar-winning visual effects supervisor Bill Westenhofer (“Life of Pi,” “Wonder Woman”), and composer Lorne Balfe (“Black Widow”).\n\nNew Line Cinema Presents a Seven Bucks/Flynn Co. Production, A Jaume Collet-Serra Film, “Black Adam,” smashing into theaters and IMAX internationally beginning 19 October 2022, in North America on October 21, 2022. It will be distributed worldwide by Warner Bros. Pictures.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}