{
  "title": "Write online about what you love",
  "link": "",
  "published": "2013-03-16T00:00:00-07:00",
  "updated": "2022-11-03T04:16:07-07:00",
  "author": {
    "name": "Greg Reda"
  },
  "id": "tag:www.gregreda.com,2013-03-16:/2013/03/16/why-you-should-write-online/",
  "summary": "<p>The other week, I wrote a <a href=\"http://www.gregreda.com/2013/03/03/web-scraping-101-with-python/\">very basic intro to web scraping with Python</a>.  Some friends knew that I had experience scraping data and they wanted to learn, so I figured it would be a great opportunity to write something publicly and test how well I could explain it.</p>\n<p>I'll …</p>",
  "content": "<p>The other week, I wrote a <a href=\"http://www.gregreda.com/2013/03/03/web-scraping-101-with-python/\">very basic intro to web scraping with Python</a>.  Some friends knew that I had experience scraping data and they wanted to learn, so I figured it would be a great opportunity to write something publicly and test how well I could explain it.</p>\n<p>I'll be extending that scraping post a bit more in the future, but first I wanted to write about how the week and a half since I posted it has gone - or, explain why I think you should write online about what you love.</p>\n<h4>How it started</h4>\n<p>Shortly after finishing the post and feeling fairly satisfied with the way it turned out, I posted it and e-mailed a link to three of my friends - two of which were the ones who asked me to teach them.  One of them, <a href=\"https://twitter.com/kennylong\">Kenny</a>, immediately messaged me, read through the post, and said I should share it on Twitter.  <a href=\"https://twitter.com/gjreda/status/308337050065727489\">So I did</a>.  To me, any feedback was better than no feedback, so I posted it <a href=\"http://www.reddit.com/r/Python/comments/19lnth/web_scraping_101_with_python_and_beautifulsoup/\">in the Python subreddit</a> too.</p>\n<p>I was really just hoping some people would see it and let me know what they thought.</p>\n<p>Turns out, quite a few more people than my 92 followers (at the time) have seen it in the week and a half since.  About 32,000 more.</p>\n<p>It was pretty exhilarating to watch something I wrote be shared in real-time.  Many of the <a href=\"https://twitter.com/siah/status/308719789524799488\">data</a> <a href=\"https://twitter.com/treycausey/status/308342790180458496\">nerds</a> that I admire and follow on Twitter were sharing it.  Hell, even Philadelphia's Chief Data Officer <a href=\"https://twitter.com/mheadd/status/308576308810637312\">shared it</a>.  It was a ton of fun to watch and read both (fairly) positive and constructive comments about it on /r/python.  It immediately made me want to write the post you're currently reading, which I started working on two days later.</p>\n<h4>A week later</h4>\n<p>Sitting around the following Sunday, making minor CSS tweaks to this site and finishing up the previously mentioned post, I decided to check my Google Analytics to see what the final traffic from /r/python and Twitter looked like.  Surprisingly, the real-time section of Analytics showed 250+ on the site.  What?  How?!</p>\n<p>That's when I realized it wound up at the top of <a href=\"https://news.ycombinator.com/item?id=5353347\">Hacker News</a>.  And then <a href=\"http://www.reddit.com/r/programming/comments/1a20lf/web_scraping_101_with_python/\">/r/programming</a>.  Traffic went through the roof.</p>\n<p><img alt=\"Hacker News, /r/programming, and lots of Twitter sharing\" src=\"/images/more-traffic-20130313.png\"></p>\n<p>And again, the comments were positive and constructive.</p>\n<h4>Lesson learned</h4>\n<p>And this leads me to why you should write about things you're passionate about online.  When you're truly passionate about something, you spend a lot of time thinking and learning about it - you try to make it a part of your life.  You try to become a reputable source on the topic (or even an expert).  It can be something as broad as beer, personal finance, or film; or as niche as stand-up comedy, vegan baking, or <a href=\"http://en.wikipedia.org/wiki/Emo#Underground_popularity:_mid-1990s\">90s midwest emo bands</a> (guilty).  It doesn't matter what it is as long as <em>you</em> love it.</p>\n<p>Like me, you're likely ecstatic when you find someone you're able to get nerdy with about something you love.  You truly enjoy the topic and are always looking for ways to <em>learn more</em> and <em>teach others</em> about it (or just banter).</p>\n<p>That's why you should share your knowledge about whatever the field may be.  <em>It doesn't matter whether 10 or 10,000 people see what you've shared</em>.  There are people interested, but might not know where to start.  And that's the best way to reinforce how well we know something - by teaching it to others.  You'll be prompted with questions you hadn't thought about before, which will only further your own curiosity.  You're forced to explain concepts in simple terms that anyone can understand - you become a better teacher and communicator.  Sometimes, someone else crazily passionate about the same topic will even come along and teach you a thing or two.</p>\n<p>We all have a thirst for knowledge in some form.  The internet's a magnificent place to test our existing knowledge by teaching others and learning more throughout the process thanks to feedback from those with differing experiences.</p>\n<p>Put your passions out there.  More often than not, you'll be amazed at what you get back.</p>",
  "category": [
    "",
    "",
    ""
  ]
}