{
  "title": "Military FIRE &#8211; The Tax, Investing, and Travel Benefits of Military Service",
  "link": "https://www.madfientist.com/military-fire/",
  "comments": "https://www.madfientist.com/military-fire/#comments",
  "dc:creator": "The Mad Fientist",
  "pubDate": "Fri, 11 Dec 2020 10:12:00 +0000",
  "category": [
    "FIRE (Financial Independence / Retire Early)",
    "Tax Avoidance"
  ],
  "guid": "http://www.madfientist.com/?p=6908",
  "description": "<p class=\"lead\">Military servicemembers have access to incredible tax, investing, and travel benefits that can accelerate the journey to FI!</p>\n<p class=\"more-link-p\"><a class=\"btn btn-danger\" href=\"https://www.madfientist.com/military-fire/\">Read more &#8594;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/military-fire/\">Military FIRE &#8211; The Tax, Investing, and Travel Benefits of Military Service</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "content:encoded": "\n<p><em>Today, I&#8217;m happy to feature a guest post from Spencer of <a href=\"https://militarymoneymanual.com/\">MilitaryMoneyManual.com</a>.  For members of the military who want to achieve FI, this post is for you!  Take it away, Spencer&#8230;</em></p>\n\n\n\n<p>If you serve in the US military, you live in a unique financial ecosystem that enables you to rapidly achieve financial independence. As a Mad Fientist reader, you are probably interested in <a href=\"https://www.madfientist.com/category/tax-avoidance/\" target=\"_blank\" rel=\"noopener\">tax minimization</a>, <a href=\"https://www.madfientist.com/category/travel-hacking/\">travel card maximizing</a>, and <a href=\"https://www.madfientist.com/category/investing/\">investing for early financial independence</a>.</p>\n\n\n\n<p>You can do all of these things in the military and usually quicker than your civilian peers. Here are three unique techniques for military FIRE:</p>\n\n\n\n<ul><li>Combat zone tax hacking</li><li>Maximizing your military investment opportunities while you serve</li><li>Annual fee waived travel reward credit cards</li></ul>\n\n\n\n<p>Military service provides a structure to achieve financial freedom. Military life can naturally promote frugality, independence, and self-motivation. Health care is not a concern and the amenities on base like a gym, grocery store, and gas station keep costs low. Whether deployed to the Middle East or on a submarine, it can be hard to spend any money for months at a time.</p>\n\n\n\n<p>Many troops make the mistake of spending all of their money as quickly as they can when they return from deployment. The stereotype of the young soldier with the Dodge Charger with a 27% APR loan is based on real experience. However, if you make FI a priority, you will find military life conducive to achieving your financial freedom.</p>\n\n\n\n<p>By using the techniques the Mad Fientist talks about on this site, you can achieve FI well before your military pension at 20 years. The principles of FI are the same whether you are a civilian or a servicemember: spend less than you earn and invest the difference.</p>\n\n\n\n<p>The fastest option initially is to lower your expenses. Then you can focus on increasing your income over time, while continuing to keep your expenses low. The more you increase your savings rate, the faster you will reach FI.</p>\n\n\n\n<p>Commissioning as a military officer definitely helps, but enlisted troops can achieve FI as well. If you happen to find a partner in the military, dual military couples are well compensated. For instance, a dual military officer couple stationed in Hawaii after 10 years of service would make a household income $250,000 per year in 2020 if they lived off base.</p>\n\n\n\n<h2>Tax Hacking on Combat Deployments</h2>\n\n\n\n<p>By far one of the best ways to accelerate your journey to FIRE is to volunteer for an overseas tour or a combat zone deployment.</p>\n\n\n\n<p>You can drop your expenses to zero and increase your income substantially. Deployed troops get free health care, food, gym, lodging, internet, and just about everything else. You can store your vehicle and reduce your insurance, freeze your cell phone plan, and cancel your subscription services.</p>\n\n\n\n<p>On a few of my deployments my wife moved to be closer with her family and we rented out our apartment on AirBnB. This paid the mortgage while I was gone. Get creative and see how frugal you can live on a deployment. Save your deployment income to spend when you are reunited with your loved ones.</p>\n\n\n\n<p>On a combat deployment, you receive the advantage of tax-free income. This is known as CZTE or Combat Zone Tax Exclusion. Combat zones are designated by the President and IRS.&nbsp;</p>\n\n\n\n<p>Here’s an <a href=\"https://www.irs.gov/newsroom/combat-zones\" rel=\"nofollow\">updated list from the IRS</a>. Notice that you don’t need to be shooting it out in the streets of Baghdad to earn tax free pay. For instance, I lived for 2 years in the United Arab Emirates, one of the richest and safest countries in the world. While there I received 24 months of tax free pay. Even Kosovo, Albania, and the Adriatic Sea are still listed as combat zones, an anachronism from 1999.</p>\n\n\n\n<p>Combat zone tax free pay can take the Mad Fientist’s <a href=\"https://www.madfientist.com/category/tax-avoidance/\">tax avoidance strategies</a> to the extreme. Optimally you should stuff your and your spouse’s Roth IRA and Roth TSP full of untaxed income. Tax free income provides a triple whammy: the contributions go in untaxed, grow untaxed, and withdraw untaxed after age 59.5.</p>\n\n\n\n<p>After you have maxed out your tax advantaged retirement space, put the tax free income into a taxable brokerage account. Now you will only pay long term capital gains tax on the money if you sell the assets after 1 year.</p>\n\n\n\n<p>The TSP or Thrift Savings Plan is the military’s 401k plan. It has a Roth and Traditional option. When your tax rate is 0% on deployment, it makes sense to get that money into your Roth accounts!</p>\n\n\n\n<p>An even more advanced strategy while on a longer deployment is to convert some or all of your Traditional IRA money to Roth IRA. While this is normally a taxable event, your taxable income for a year with a deployment in it may be $0 or close to it.</p>\n\n\n\n<p>That leaves over $24,000 of deduction space that you could use to <a href=\"https://www.madfientist.com/how-to-access-retirement-funds-early/\">convert your Traditional IRA to Roth IRA</a> and pay no taxes on the conversion. Now you successfully locked that money away tax free for life. I use <a href=\"http://www.moneychimp.com/features/tax_calculator.htm\" rel=\"nofollow\">MoneyChimp’s Tax Calculator</a> to help me with my tax plan.</p>\n\n\n\n<p>One other deployed investment you need to use is the SDP or Savings Deposit Program. This is a US government savings account that pays 10% interest on all money deposited up to $10,000. If you fill it up early in your deployment, you can grow it to $11,000 after a year.</p>\n\n\n\n<p>This is a great place to park your emergency fund, as the money can be withdrawn in less than a week and it gets an interest rate 100x better than what most banks offer.</p>\n\n\n\n<h2>Investing While Serving in the Military</h2>\n\n\n\n<p>The number one place to start investing when in the military is the Thrift Savings Plan or TSP. The TSP offers only five index fund investments covering the S&P 500, small cap US stocks, stocks from the largest markets outside the US, and a corporate and government bond fund. The expense ratios are as low or lower than comparable Vanguard funds.</p>\n\n\n\n<p>By combining C Fund (S&P 500) with the S Fund (the other 2500 US stocks not in the S&P 500) you can build your own Total US Stock Market Fund, like VTSAX. If you are not sure how to <a href=\"https://www.madfientist.com/my-portfolio/\">build your own asset allocation</a>, the TSP Lifecycle Funds are the way to go.</p>\n\n\n\n<p>The L 2065 fund is 99% stocks in 2020 and will slowly move to more bonds over your lifetime. That’s plenty of time for you to read and understand more about constructing your own asset allocation plan. You might even decide that just setting it and forgetting it in a target date fund is the right way to go. Plenty of investors become millionaires that way.</p>\n\n\n\n<p>Even when you are not deployed, military tax rates are incredibly low since much of your income is paid in the form of untaxed allowances. For instance, if you live off base you receive Basic Allowance for Housing, or BAH. In Hawaii, a married officer with 10 years of service can make nearly $4000 per month just from BAH.</p>\n\n\n\n<p>Since military tax rates are so low, it usually makes sense to contribute to your Roth TSP and Roth IRA early in your career. As you promote up the ranks, make more money and deploy less often, switching to Traditional contributions can make sense when your income trips over the 24% bracket.</p>\n\n\n\n<h2>Fee Waived Travel Rewards Credit Cards</h2>\n\n\n\n<p>Military travel hackers have a cheat code that civilians do not: they do not need to pay annual fees on their travel cards. This is thanks to 2 laws: SCRA and MLA.</p>\n\n\n\n<p>Because of these 2 laws, military servicemembers, and their civilian spouses, can get all personal Chase and American Express cards without an annual fee. A few other banks also waive fees but these two are the big ones with the best travel rewards credit cards.</p>\n\n\n\n<p>SCRA stands for Servicemembers Civil Relief Act and is applied to credit accounts opened before active duty service. MLA is Military Lending Act and applies to accounts opened after active duty service started.</p>\n\n\n\n<p>SCRA caps your maximum interest rate at 6%. MLA caps your interest rate at 36% but this is inclusive of annual fees.</p>\n\n\n\n<p>For example, if a card has a $550 annual fee, and you only put $1000 of spending on it in a year, that is calculated as a 55% interest rate under MLA. The banks are not interested in getting slapped with huge fines and fees from government enforcement agencies, so they just waive annual fees on their cards for military troops and their spouses.</p>\n\n\n\n<p>Thanks to the MLA, military families can open <a href=\"https://www.madfientist.com/to-travel-cards/\" rel=\"nofollow noopener\" target=\"_blank\">travel reward credit cards</a> on active duty and pay no annual fees. They can get the best premium travel rewards credit cards with airport lounge access, free annual hotel nights, upgrades to Diamond status, travel credits, restaurant credits, etc. This is the best military discount I ever saw!</p>\n\n\n\n<p>The <a href=\"https://militarymoneymanual.com/american-express-waives-all-card-holder-fees-for-active-duty-military/\">Amex Platinum military</a> benefits have been well known in the military community for several years, but the <a href=\"https://cards.madfientist.com/cards/74\" target=\"_blank\" rel=\"nofollow noopener\">Chase Sapphire Reserve</a> is arguably an even better deal for servicemembers. The CSR offers a $300 annual travel credit and much wider global acceptance because it is a Visa card. Amex is not as widely as accepted outside the US and Japan.</p>\n\n\n\n<p>Let’s assume a military couple each opened a Chase Sapphire Reserve, Amex Platinum, and Amex Hilton Honors Aspire card. The welcome bonuses alone are worth thousands on these three cards. And you can double the bonuses because you and your spouse can both open an account with the fees waived.</p>\n\n\n\n<p>Better yet, you can refer your spouse for his or her own card and earn a referral bonus. Annually, you receive the following benefits from your and your spouses six cards (as of December 11, 2020):</p>\n\n\n\n<ul><li>$400 Uber or Uber Eats credit ($30 per month, $70 in December)</li><li>$900 annual airline fee credit</li><li>$500 credit at Hilton hotels and resorts</li><li>$600 travel credit</li><li>2 free weekend nights at Hilton</li></ul>\n\n\n\n<p>I cover all of this in my <a href=\"https://militarymoneymanual.com/umc3\">Ultimate Military Travel Hacking course</a>. Sign up today with just your email and I will send you all of my best material on military travel hacking. Mad Fientist also has a series of great posts to get you started travel hacking.</p>\n\n\n\n<h2>Your Journey to Military FI</h2>\n\n\n\n<p>To continue your education towards military financial independence, I recommend you check out my site Military Money Manual and sign up for my free 5 day course on military travel hacking. There is also a growing and friendly community on Reddit at <a href=\"http://www.reddit.com/r/militaryfinance\" rel=\"nofollow\">reddit.com/r/MilitaryFinance/</a> that can help you on your journey to FI.</p>\n\n\n\n<p>Don’t waste the opportunities available to you while you serve! Just serving for 4 years can propel you far ahead of your peers on your path to financial independence. Take advantage of all the investment, tax, and travel opportunities the US military presents you.</p>\n\n\n\n<p><em>Spencer serves as an active duty Air Force officer in Hawaii. He’s investing for financial independence by age 40. His site </em><a href=\"https://militarymoneymanual.com/\"><em>MilitaryMoneyManual.com</em></a><em> shows servicemembers how to travel hack with annual fee waived credit cards and maximize their military benefits. Since 2012 he’s helped over 1 million people with their military personal finance questions.</em></p>\n\n\n\n<h2>Related Post</h2><div><a href='https://www.madfientist.com/the-military-guide-interview/' target='_blank'><div class='post_card'><div class='post_card_text'><h3 style='color:#399da8;'>The Military Guide - Angel Investing, Market Crashes, & 14 Years of Early Retirement</h3><p class='post_card_excerpt'>Doug Nordman (a.k.a. Nords) from The Military Guide joined me on the Financial Independence Podcast to talk about retiring early on a military salary!</p></div><div class='post_card_image'><img src='https://www.madfientist.com/wp-content/uploads/2016/09/the-military-guide.jpg' style='border-radius:7px;'/></div></div></a></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/military-fire/\">Military FIRE &#8211; The Tax, Investing, and Travel Benefits of Military Service</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "wfw:commentRss": "https://www.madfientist.com/military-fire/feed/",
  "slash:comments": 11
}