{
  "title": "525: What Lies Ahead For Tina Goldstein in 'Fantastic Beasts'?",
  "link": "https://audioboom.com/posts/7921258",
  "itunes:episode": 525,
  "itunes:title": "What Lies Ahead For Tina Goldstein in 'Fantastic Beasts'?",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4736,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode of MuggleCast, we're discussing Tina Goldstein's role following the events of The Crimes of Grindelwald, and what lies ahead! Plus, we revisit our predictions made after seeing her in the first Fantastic Beasts movie.<br>\n<br>\n\n</div>\n<ul>\n<li>Welcome to Slug Club Member Deanna and Alohomora's Katy Haile!</li>\n<li>Fantastic Beasts Character Discussion: Tina Goldstein and her role in The Crimes of Grindelwald</li>\n<li>We revisit some of the things we mentioned back in <a href=\"https://www.mugglecast.com/episode-320-tina/\">Episode 320</a> during our initial Tina discussion to see if anything held true in Crimes of Grindelwald!</li>\n<li>Did her standoffishness subside? Did she get her mojo back after catching Grindelwald? What does Tina's horoscope say about her character? What happened to Tina's story between movies? Why did she never reach out to Newt about the photo of him and Leta? Why didn't Queenie help to clarify the situation?</li>\n<li>Tina The Auror & The Search for Credence</li>\n<li>Why was she so easily duped by Yusuf Kama?</li>\n<li>What will Tina and Queenie’s relationship be like now that she has (supposedly) sided with Grindelwald? Are we headed toward a showdown between sisters?</li>\n<li>Knowing World War II will serve as a backdrop to future Fantastic Beasts films, how concerned should we be for the Goldstein family?</li>\n<li>What can we expect of her future relationship with Newt? Will it be a very minor subplot?</li>\n<li>Was Tina catching Grindelwald at the end of the first movie foreshadowing of what’s to come? Will Credence save her much like she has saved him?</li>\n<li>New Game: Whose Eyes Are They?</li>\n<li>Quizzitch: As of the late 20th century, Tina Goldstein lived with her husband Newt Scamander in Dorset with their pet Kneazles, what were their pets’ names? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week’s episode is sponsored by <a href=\"http://getquip.com/muggle5\">Quip</a> (get $5 off their mouthwash starter kit) and <a href=\"http://www.thirdlove.com/mugglecast\">ThirdLove</a> (get 20% off your first purchase)!</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, including our new physical gifts! Also access to our recording studio, Bonus MuggleCast, a personalized thank you video from one of the hosts and more!</li>\n</ul>\n",
  "pubDate": "Tue, 10 Aug 2021 09:00:00 +0000",
  "guid": "tag:audioboom.com,2021-08-10:/posts/7921258",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}