{
  "id": "https://bibleinoneyear.org/en/youth/181",
  "title": "Day 181: The Most Powerful Message in the World",
  "description": "Psalm 78:40-41, 52–53a, 2 Kings 2:7–15a, Acts 20:17–24.  Yet it is also a message that provokes opposition  God equips you to pass on this message by giving you the Holy Spirit",
  "pubDate": "Thu, 30 Jun 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/181/",
  "itunes:duration": "15:05",
  "guid": "enyouth30062022-181",
  "length": 905.95,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 181: The Most Powerful Message in the World",
  "itunes:subtitle": "Psalm 78:40-41, 52–53a, 2 Kings 2:7–15a, Acts 20:17–24.  Yet it is also a message that provokes opposition  God equips you to pass on this message by giving you the Holy Spirit",
  "itunes:summary": "Recently I had the privilege of interviewing Mojtaba Hosseini for our HTB services. He is a young pastor who was imprisoned, aged 20, for running house churches in Iran. He was imprisoned alongside murderers and drug dealers. He spent long periods in solitary confinement, not knowing if or when he would be released.\nMojtaba felt prompted by the Holy Spirit to share the good news of Jesus. So when the opportunity arose, he began sharing his testimony and the gospel with the other prisoners, proclaiming, ‘Jesus is alive.’\nHe said, ‘It doesn’t matter what situation I’m in. I can work in God’s kingdom wherever he places me. And at that time God placed me among the prisoners.’\nOf one fellow prisoners that he helped lead to Christ, Mojtaba said:\n‘I heard this message from God: “Mojtaba, whatever you have been through, being away from your family, all the humiliation, all the suffering, all the pain and solitary confinement and everything you will still go through… It’s worth it for this man who came to Christ.”’\nThe message of Jesus is the most powerful message in the world. It is good news. It changes lives. It changes cities and cultures. Yet it is also a message that provokes opposition. God equips you to pass on this message by giving you the Holy Spirit.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 546
}