{
  "title": "Cloud Lock-in and Open Standards",
  "link": "",
  "updated": "2018-08-19T00:00:00+00:00",
  "id": "https://mrocklin.github.io/blog/work/2018/08/19/cloud-lockin-and-open-standards",
  "content": "<p><em>This post is from conversations with <a href=\"https://github.com/pzwang\">Peter Wang</a>,\n<a href=\"https://github.com/yuvipanda\">Yuvi Panda</a>, and several others.  Yuvi expresses\nhis own views on this topic <a href=\"http://words.yuvi.in/post/oss-in-the-cloud/\">on his\nblog</a>.</em></p>\n\n<h3 id=\"summary\">Summary</h3>\n\n<p>When moving to the cloud we should be mindful to avoid vendor lock-in by\nadopting open standards.</p>\n\n<h3 id=\"adoption-of-cloud-computing\">Adoption of cloud computing</h3>\n\n<p>Cloud computing is taking over both for-profit enterprises and\npublic/scientific institutions.  The Cloud is cheap, flexible, requires little\nup-front investment, and enables greater collaboration.  Cloud vendors like\nAmazon Web Services (AWS), Google Cloud Platform (GCP), and Microsoft Azure\ncompete to create stable, easy to use platforms to serve the needs of a variety\nof institutions, both big and small.  This presents both a great opportunity\nfor society, but also a risk of future lock-in at a large scale.</p>\n\n<h3 id=\"cloud-vendors-build-services-to-lock-in-users\">Cloud vendors build services to lock in users</h3>\n\n<p>Some of the competition between cloud vendors is about providing lower costs,\nhigher availability, improved scaling, and so on, that are strictly a benefit\nfor consumers.  This is great.</p>\n\n<p>However some of the competition is in the form of services that are specialized\nto a particular commercial cloud, like Amazon Lambda, Google Tensor Processing\nUnits (TPUs), or Azure Notebooks.  These services are valuable to enterprise\nand public institutions alike, but they lock users in long-term.  If you build\nyour system around one of these systems then moving to a different cloud in the\nfuture becomes expensive.  This stickiness to your current cloud “locks you in”\nto using that particular cloud, even if policies change in the future in\nways that you dislike.</p>\n\n<p>This is OK, lock-in is a standard business practice.  We shouldn’t fault these\ncommercial companies for making good business decisions.  However, it’s\nsomething that we should keep in mind as we invest public effort in these\ntechnologies.</p>\n\n<h3 id=\"open-standards-counter-lock-in-technologies\">Open standards counter lock-in technologies</h3>\n\n<p>One way to counter lock-in is to promote the adoption of open standard\ntechnologies that are shared among cloud platforms.  If these open standard\ntechnologies become popular enough then cloud platforms <em>must</em> offer them\nalongside their proprietary technologies in order to stay competitive, removing\none of their options for lock-in.</p>\n\n<h3 id=\"examples-with-kubernetes-and-parquet\">Examples with Kubernetes and Parquet</h3>\n\n<p>For example, consider Kubernetes, a popular resource manager for clusters.\nWhile Kubernetes was originally promoted by Google, it was developed in the\nopen by a broader community, gained global adoption, and is now available\nacross all three major commercial clouds.  Today if you write your\ninfrastructure on Kubernetes you can move your distributed services between\nclouds easily, or can move your system onto an on-premises cluster if that\nbecomes necessary.  You retain the freedom to move around in the future with\nlow cost.</p>\n\n<p>Consider also the open Parquet data format.  If you store your data in Parquet\nthen you can move that data between any cloud’s storage system easily, or can\nmove that data to your in-house hardware without going through a painful\ndatabase export process.</p>\n\n<p>Technologies like Kubernetes and Parquet displace proprietary technologies like\nAmazon’s Elastic Container Service (ECS), which locks users into AWS, or\nGoogle’s BigQuery which keeps users on GCP with data gravity.  This is fine,\nAmazon and Google can still compete for users with any of their other excellent\nservices, but they’ve been pushed up the stack a bit, away from technologies\nthat are infrastructural and towards technologies that are more about\nconvenience and high-level usability.</p>\n\n<h3 id=\"what-we-can-do\">What we can do</h3>\n\n<p>Wide adoption of open standard infrastructure protects us from the control of\ncloud vendors.</p>\n\n<p>If you are a public institution considering the cloud then please consider the\nservices that you plan to adopt, and their potential to lock your institutions\nin the long run.  These services may still make sense, but you should probably\nhave a conversation with your team and do it mindfully.  You might consider\ndeveloping a plan to extract yourself from that cloud in the future and see how\nyour decisions affect the cost of that plan.</p>\n\n<p>If you are an open source developer then please consider investing your effort\naround open standards instead of around proprietary tooling.  By focusing our\neffort on open standards we provide public institutions with viable options for\na safe cloud.</p>"
}