{
  "title": "TU155: Speakably Sexy – Communicating to Make Sex Hotter and Relationships More Alive with Dr. Susan Ansorge REPLAY",
  "link": "https://therapistuncensored.com/episodes/tu155-speakably-sexy-communicating-to-make-sex-hotter-replay/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu155-speakably-sexy-communicating-to-make-sex-hotter-replay",
  "pubDate": "Tue, 31 Aug 2021 16:22:42 +0000",
  "guid": "https://therapistuncensored.com/?p=11868",
  "description": "In this episode Therapist Uncensored co-host Dr. Ann Kelley joins guest Dr. Susan Ansorge to talk about was to communicate about sex.",
  "enclosure": "",
  "itunes:subtitle": "In this episode Therapist Uncensored co-host Dr. Ann Kelley joins guest Dr. Susan Ansorge to talk about was to communicate about sex.",
  "itunes:summary": "What makes the ins and outs of sexuality so hard to talk about? We're diving into it in this replay episode, so get ready. We're talking about all things sex and overcoming the fears of communicating about it. It turns out if couples do talk about sex, the conversation often only covers the frequency, instead of the other important aspects like pleasure (or the lack thereof), fantasies (or the lack thereof), desires (or the lack thereof),thoughts and feelings towards intimacy, and even the basic mechanics as well. Learn more about how to have these understandably anxiety-inducing conversations, and overcome the difficulties of opening up to yourself and your sexual partner with Dr. Ann Kelley, and Dr. Susan Ansorage.<br />\n<br />\nDr. Susan Ansorge is a practicing psychologist in Austin, TX. Her interest, training and experience in working with sexual issues began during her tenure as a staff psychologist at the UT Counseling and Mental Health Center, and has continued through her 17 years of private practice with individuals and couples. Dr. Ansorge was also member of the Austin Women’s Psychotherapy Project, bringing leaders in the field of gender-aware Psychotherapy to the Austin area, as well as presenting locally and nationally on topics in the areas of gender and sexuality as they relate to psychotherapy. Her written work has appeared in the National Center for PTSD Quarterly.<br />\nCheck out our original show notes for this episode, <a href=\"https://therapistuncensored.com/episodes/tu71-speakably-sexy-communicating-to-make-sex-hotter-and-relationships-more-alive/\">here</a>! And follow us on our social media pages to get the latest updates and information: <a href=\"https://www.youtube.com/channel/UC6jBm7bgot52i_P8FliUWMA\">Youtube</a>, <a href=\"https://www.instagram.com/therapist_uncensored_podcast/?hl=en\">Instagram</a>, <a href=\"https://www.facebook.com/austinshrinks/\">Facebook</a>, <a href=\"https://twitter.com/austinshrinks?lang=en\">Twitter</a> & <a href=\"https://www.linkedin.com/company/therapist-uncensored\">LinkedIn</a>!<br />\nLike what you're hearing? A great way to help others find these resources is to rate and review wherever you get your podcasts. This is an easy and effective way for those seeking assistance to be able to find it. Thank you so much for your support.",
  "itunes:author": "Sue Marriott LCSW, CGP & Ann Kelley PhD",
  "itunes:image": "",
  "itunes:season": 5,
  "itunes:episode": 155,
  "itunes:title": "TU155: Speakably Sexy – Communicating to Make Sex Hotter and Relationships More Alive with Dr. Susan Ansorge REPLAY",
  "itunes:explicit": "clean",
  "itunes:duration": "38:18"
}