{
  "title": "S1E34 - Turning the Tables on the Media with Emmy Award Winner Randy McIlvoy",
  "guid": "https://pinecast.com/guid/115ea3d1-d7ef-4b7c-91ff-dc0a6e93dda6",
  "pubDate": "Tue, 16 Feb 2021 07:30:00 -0000",
  "itunes:duration": "00:55:43",
  "description": "<p>Randy McIlvoy, Sports Director and anchor of KPRC 2 Television in Houston, is Laura’s very special guest on the podcast this week. A four-time Emmy winner, Randy has received numerous additional nominations, as well as honors from the Texas Associated Press Broadcasters Association. He and Laura have known each other for quite some time, but this is the first time that she has had the opportunity to turn the tables and be the one to interview this celebrated interviewer.</p>\n<p>Randy begins by sharing his own history in sports, his development into sports reporting, and his tips for athletes who are interested in doing so themselves. He then discusses many aspects of his job including the most important character trait for it, the most difficult aspect to it, the importance of establishing relationships, and his advice for athletes preparing for interviews. Randy also reviews some of his most memorable moments in his job over the years, and offers his perspective on the sport that has transformed the most, the quality he feels elite athletes share, how COVID has impacted his work, and the sporting events he would like to cover that he hasn’t yet. The mutual respect between these two remarkably successful individuals is palpable during this conversation that is as comfortable as it is revealing, providing a behind the scenes glimpse into the world of sports reporting and the joy that can be found in making your passion your occupation.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>Randy’s history in sports</li>\n<li>His development into a sports reporter</li>\n<li>Randy’s tips for athletes wanting to get into reporting</li>\n<li>The most important character trait for his work</li>\n<li>The most difficult aspect of Randy’s job</li>\n<li>The importance of developing relationships</li>\n<li>Advice for athletes preparing for interviews</li>\n<li>His favorite sport and game he’s covered</li>\n<li>Keeping viewers excited</li>\n<li>Randy’s memorable stories</li>\n<li>His play-by-play experience</li>\n<li>Interviews that made Randy nervous</li>\n<li>The quality he feels elite athletes share</li>\n<li>What has surprised him the most in interviews</li>\n<li>The sport he believes has transformed the most and become the most competitive over the years</li>\n<li>The ‘Tiger Factor’</li>\n<li>How COVID has changed covering sports</li>\n<li>The sporting events that Randy would still like to cover in person</li>\n</ul>\n<p>Quotes:</p>\n<p>“My dream was to play college baseball.”</p>\n<p>“Breaking into TV, you know, I would have been willing to do whatever…I wanted to cover sports, I wanted to tell stories.”</p>\n<p>“You’ve got to have a skillset that’s a little broader now that can kind of separate yourself from others trying to get after these jobs.”</p>\n<p>“You can’t just sit back and let it come to you…you’ve got to grind. You’ve got to always look to improve what you’re doing.”</p>\n<p>“You could easily let this job that we do, this profession, kind of consume you if you don’t find a balance.”</p>\n<p>“Act like the camera’s not there.”</p>\n<p>“Just have a conversation with the person asking the question.”</p>\n<p>“You do know we just witnessed one of the greatest all time moments in college football history, right?</p>\n<p>“It can get monotonous if you let it…you’ve got to go find stories.”</p>\n<p>“You’re constantly in the planning stages.”</p>\n<p>“I almost drove off the road.”</p>\n<p>“You seem to experience everything with the athletes.”</p>\n<p>“I’ve got to act like I’ve been here before.”</p>\n<p>“You’ve got to be committed to what you’re doing.”</p>\n<p>“You’ve got college golfers that come out and are just lighting it up.”</p>\n<p>“The athletes were becoming a bit of the reporter for you.”</p>\n<p>“You miss the contact, that’s what you miss. You miss the face-to-face stuff with them.”</p>\n<p>“The Olympic Games would be cool to cover.”</p>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold homepage</a>\n<a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">5 Smart Strategies to Confidence</a>\nLaura’s Social Media:\nInstagram:   <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura's Instagram</a>\nFacebook:   <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura's Facebook page</a></p>\n<p>Connect with Randy:\n<a href=\"https://www.click2houston.com/\" rel=\"nofollow\">Click2Houston homepage</a>\n<a href=\"https://www.click2houston.com/team/LBEINGM7IJAI5PVLPLDMKRPQOY/\" rel=\"nofollow\">Randy's Click2Houston page</a>\n<a href=\"https://twitter.com/kprc2randymc?lang=en\" rel=\"nofollow\">Randy on Twitter</a>\n<a href=\"https://www.facebook.com/RandyMcIlvoy/\" rel=\"nofollow\">Randy's Facebook page</a>\n<a href=\"https://instagram.com/kprc2randymcilvoy?igshid=168ix5zlub4yv\" rel=\"nofollow\">Randy's Instagram page</a></p>\n<p>References:\n<a href=\"https://www.laurawilkinson.com/podcast-episodes/mindset-is-everything-with-speed-skater-apolo-ohno\" rel=\"nofollow\">Apolo Ohno Episode</a></p>",
  "itunes:title": "Turning the Tables on the Media with Emmy Award Winner Randy McIlvoy",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 34
}