{
  "title": "Import AI 305: GPT3 can simulate real people; AI discovers better matrix multiplication; Microsoft worries about next-gen deepfakes",
  "link": "https://jack-clark.net/2022/10/11/import-ai-305-gpt3-can-simulate-real-people-ai-discovers-better-matrix-multiplication-microsoft-worries-about-next-gen-deepfakes/",
  "comments": "https://jack-clark.net/2022/10/11/import-ai-305-gpt3-can-simulate-real-people-ai-discovers-better-matrix-multiplication-microsoft-worries-about-next-gen-deepfakes/#respond",
  "dc:creator": "Jack Clark",
  "pubDate": "Tue, 11 Oct 2022 21:16:00 +0000",
  "category": "Uncategorized",
  "guid": "http://jack-clark.net/?p=2380",
  "description": "GPT-3 can simulate people very, very well &#8211; social science might change:…Turns out a synthesis engine trained on the exhaust of human culture can be pretty good at simulating people… Researchers with Brigham Young University have written a paper which I think is among the most significant things I&#8217;ve ever covered in this newsletter. Specifically, [&#8230;]",
  "content:encoded": "\n<p><strong>GPT-3 can simulate people very, very well &#8211; social science might change:</strong><strong><br></strong><em>…Turns out a synthesis engine trained on the exhaust of human culture can be pretty good at simulating people…</em></p>\n\n\n\n<p>Researchers with Brigham Young University have written a paper which I think is among the most significant things I&#8217;ve ever covered in this newsletter. Specifically, they do three social science experiments on GPT-3 and discover that GPT-3 has biases that are &#8220;fine-grained and demographically correlated, meaning that proper conditioning will cause it to accurately emulate response distributions from a wide variety of human subgroups.&#8221;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;Put another way: You can simulate people in GPT-3 and they might respond with uncanny similarity to real people in real life.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;Sit with that for a minute and spool out the implications, while mentally turning the crank on model size advancements.&nbsp;</p>\n\n\n\n<p><strong>What their study showed: </strong>The authors did this research by &#8220;conditioning GPT3 on thousands of socio-demographic backstories from real human participants in multiple large surveys in the United States: the 2012, 2016, and 2020 waves of the American National Election Studies (ANES)[16], and Rothschild et al.’s “Pigeonholing Partisans” data &#8220;. They found that GPT3 &#8220;when properly conditioned, is able to produce outputs biased both toward and against specific groups and perspectives in ways that strongly correspond with human response patterns along fine-grained demographic axes. In other words, these language models do not contain just one bias, but many&#8221;.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;In other words: When they did some tests to try and see if GPT3 would make similar responses as people when given the priors of the same demographic background data, GPT3 responds in a remarkably similar-to-people way. :&#8221;We provide evidence that algorithmic fidelity is a crucial attribute of tools like GPT-3 because it demonstrates that these language models can be used prior to or in the absence of human data.&#8221;</p>\n\n\n\n<p><strong>Silicon Sampling: </strong>The researchers call this approach &#8216;silicon sampling&#8217;; simulate people in GPT3, then poll them as a substitute for real world data. The approach seems sufficiently useful that some people will do this as a way to try out a few variations of survey design ahead of polling a real population, for instance.&nbsp;</p>\n\n\n\n<p><strong>Social science simulation is cool, but do you know other people think is cool?</strong> Full-Spectrum AI-Facilitated Information Warfare! Because models like GPT3 can, at a high level, simulate how different human populations respond to certain things, we can imagine people using these models to simulate large-scale information war and influence operations, before carrying them out on the internet. &#8220;Models with such fidelity, coupled with other computational and methodological advances, could be used to target human groups for misinformation, manipulation, fraud, and so forth,&#8221; the authors note.&nbsp;</p>\n\n\n\n<p><strong>&nbsp;&nbsp;&nbsp;Read more:</strong> ​<a href=\"https://arxiv.org/abs/2209.06899\">Out of One, Many: Using Language Models to Simulate Human Samples (arXiv)</a>.</p>\n\n\n\n<p>####################################################</p>\n\n\n\n<p><strong>We might have figured out some &#8216;scaling laws&#8217; for reinforcement learning:</strong><br><em>…RL agents could be better if they have bigger neural nets, study suggests…</em></p>\n\n\n\n<p>Researchers with Goethe University have tried to figure out some &#8216;scaling laws&#8217; for reinforcement learning agents. &#8220;Scaling laws&#8221; help researchers figure out the right mix of compute and data to allocate to a machine learning model to get a particular level of performance and have been widely studied in fields like natural language and image generation.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;Here, the researchers try to do a &#8216;scaling law&#8217; style analysis of AlphaZero RL agents playing two distinct games; Connect Four and Pentago. &#8220;These two games are non-trivial to learn and light enough to allow for training a larger number of agents with a reasonable amount of resources,&#8221; the researchers write.&nbsp;</p>\n\n\n\n<p><strong>What they found: </strong>In tests, they found that &#8220;playing strength scales as a power law with neural network size when models are trained until convergence at the limit of abundant compute,&#8221; and they extrapolate their results to indicate AlphaGo Zero and AlphaZero (two landmark DeepMind research systems for playing Go) likely used neural nets that were too small and they could therefore &#8220;achieve better performance with larger neural nets&#8221;.&nbsp;</p>\n\n\n\n<p><strong>Why this matters:</strong> &#8220;We find it noteworthy that scaling laws that are common to language and other supervised learning models are also present in one of the most important MARL models. This scaling behavior could be common to other reinforcement learning algorithms, which would provide an opportunity to optimize their resource allocation,&#8221; they write.&nbsp;</p>\n\n\n\n<p><strong>&nbsp;&nbsp;&nbsp;Read more:</strong> <a href=\"https://arxiv.org/abs/2210.00849\">Scaling Laws for a Multi-Agent Reinforcement Learning Model (arXiv)</a>.</p>\n\n\n\n<p>####################################################</p>\n\n\n\n<p><strong>Want to train an LM with RL? Now there&#8217;s some free software to help you:</strong><strong><br></strong><em>…Train up to 20B parameter models using RL…</em></p>\n\n\n\n<p>Researchers with CarperAI, a language model collective which span off from the open source model people at Eleuther, has released Transformer Reinforcement Learning X (trlX), software for training language models with reinforcement learning.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;&#8220;the trlX repo allows you to fine-tune Huggingface supported language models up to 20B parameters via either reinforcement learning using a provided scoring function or reward-labeled dataset. We aim to support a range of both online and offline RL algorithms including Proximal Policy Optimization (PPO), Natural Language Policy Optimization (NLPO), Actor Critic (A2C), and Implicit Q Learning (ILQL),&#8221; they write. &#8220;The library supports gpt2 and gptj with plans to include GPT-NeoX, T5 and more.&#8221;</p>\n\n\n\n<p><strong>Why this matters: </strong>Reinforcement learning training is a super effective way to &#8216;bake in&#8217; additional capabilities for a given language model. RL training is also pretty difficult and buggy. Software like trLX will make it easier for more people to train more capable language models.&nbsp;</p>\n\n\n\n<p><strong>&nbsp;&nbsp;&nbsp;Read more</strong>: <a href=\"https://github.com/CarperAI/trlx\">Welcome to Transformer Reinforcement Learning X (trlX) (GitHub)</a>.</p>\n\n\n\n<p><br>####################################################<br></p>\n\n\n\n<p><strong>Microsoft warns about smart deepfakes, and deepfake-realworld influence campaigns:</strong><br><em>…Reality collapse via sub-sentient generative avatars…</em></p>\n\n\n\n<p>Microsoft&#8217;s Chief Scientific Officer, Eric Horvitz, is very worried about the future of deepfakes in two particular ways: first, deepfakes are going to soon become a lot more intelligent and will be able to carry out plausible conversations, and second, people are going to conduct well-resourced influence campaigns that pair deepfake disinformation with carefully scripted real world events.&nbsp;</p>\n\n\n\n<p><strong>Interactive deepfakes:</strong> &#8220;Automated interactive deepfakes could be endowed with basic understandings of the status of flow of a conversation to inform decisions about if and when to interject,&#8221; Horvitz notes. These kinds of deepfakes will lever all the advances happening in generative imagery, video, audio, language, and so on, and create increasingly capable and persuasive fake avatars.&nbsp;</p>\n\n\n\n<p><strong>Compositional deepfakes: </strong>The other big worry is what happens when people use deepfakes as part of lengthy influence campaigns. &#8220;Compositional deepfakes can be designed to create fictional narratives that are persuasive in their ability to tie together and provide powerful explanations of sets of events in the world to citizens and government leaders,&#8221; Horvitz writes. &#8220;It is not hard to</p>\n\n\n\n<p>imagine how the explanatory power of custom-tailored synthetic histories could out-compete the explanatory power of the truthful narratives&#8221;.</p>\n\n\n\n<p><strong>What can we do: </strong>Horvitz does list out a few interventions that we can make, which all net out to &#8220;invest a ton more money in X&#8221;, where X is any of the following: Journalism and reporting; media literacy; authenticity protocols; content provenance; watermarks and fingerprints; detection; regulation and self-regulation, and red-teaming and continuous monitoring.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;While these are all nice, viable technocrat solutions to the various problems deepfakes imply, I&#8217;m skeptical they&#8217;ll work. The fact so many people around the world these days are retreating to choose-your-own adventure fantasies is because of some deep changes in culture in past few years, ranging from boom in production of media content to flattening of the world via things like the internet, and more. Put bluntly: Horvitz&#8217;s solutions are all nice but assuming we had all of them, I still suspect deepfakes will become an increasingly significant driver of strange cultural phenomena, and people may even knowingly interact with known-fake entities and do it all the same.</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;<strong>Read more</strong>: <a href=\"https://arxiv.org/abs/2209.01714\">On the Horizon: Interactive and Compositional Deepfakes (arXiv)</a>.</p>\n\n\n\n<p><br>####################################################<br></p>\n\n\n\n<p><strong>DeepMind trains an RL agent which figures out a more efficient form of matrix multiplication:</strong><br><em>…AI accelerating AI at a hugely basic level…</em></p>\n\n\n\n<p>DeepMind has built AlphaTensor, an AlphaZero-style agent which discovered algorithms that improve upon human ones for basic tasks like matrix multiplication. &#8220;Our AI-designed algorithms outperform human-designed ones, which is a major step forward in the field of algorithmic discovery,&#8221; DeepMind writes.&nbsp;</p>\n\n\n\n<p><strong>It&#8217;s </strong><strong><em>probably </em></strong><strong>a big deal, folks! </strong>DeepMind CEO Demis Hassabis <a href=\"https://twitter.com/demishassabis/status/1577705369425543169\">writes</a>: &#8220;Since 1969 Strassen’s algorithm has famously stood as the fastest way to multiply 2 matrices &#8211; but with #AlphaTensor we’ve found a new algorithm that’s faster, with potential to improve efficiency by 10-20% across trillions of calculations per day!&#8221; DeepMind also designed specific ways to do matrix multiplication optimizations for Nvidia V100 GPus and Google TPU v2, illustrating how you can couple this system to target particular hardware.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;<strong>Possibly overhyped</strong>: The practical implications of this result might be a bit overhyped &#8211; I myself thought &#8216;cool, this seems like a drop-in speedup&#8217;, but others who know more about this area than me are somewhat disagreeing with that. E.g, <a href=\"https://twitter.com/jekbradbury/status/1577949087470522370\">James Bradbury writes</a>: &#8220;these algorithms are helpful for integer multiplication (but require some extra bits) and high precision floats, but not so much for the lower precision floats that drive most ML work. And at low precision multiplies are no longer as dominant (vs adds).&#8221;<br>&nbsp; <strong>Regardless, this matters: </strong>Even if the practical implications are small, the fact we were able to further refine a math thing that humans have been trying to further optimize for 50 years is a big deal. This is a case where an AI has had an insight that the combined efforts of many human brains have failed to have.&nbsp;</p>\n\n\n\n<p><strong>How they did it &#8211; everything&#8217;s a game: </strong>To get this to work, DeepMind reframed the problem of algorithm discovery as a single player game, which they then trained an RL agent in.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;&#8221; At each step of TensorGame, the player selects how to combine different entries of the matrices to multiply. A score is assigned based on the number of selected operations required to reach the correct multiplication result,&#8221; DeepMind writes. &#8220;This is a challenging game with an enormous action space (more than 1012 actions for most interesting cases) that is much larger than that of traditional board games such as chess and Go (hundreds of actions).&#8221;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;They design an RL agent, AlphaTensor, which comes with some inductive biases for tensor inputs.&nbsp;</p>\n\n\n\n<p><strong>Why this matters:</strong> &#8220;The discovery of matrix multiplication algorithms has far-reaching implications, as matrix multiplication sits at the core of many computational tasks, such as matrix inversion, computing the determinant and solving linear systems,&#8221; DeepMind writes.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;More broadly, this work sits within the subfield of AI research where we&#8217;re using AI systems to improve the efficiency of the things we use to develop AI; for example, we&#8217;ve already used RL agents to improve the design of TPUs which will be used to train future AI systems (<a href=\"https://jack-clark.net/2021/06/21/import-ai-254-facebook-uses-ai-for-copyright-enforcement-google-uses-rl-to-design-better-chips/\">Import AI 254</a>), and this work uses an RL agent to speed up one of the most basic and widely performed operations in deep learning.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;<strong>Read more: </strong><a href=\"https://www.deepmind.com/blog/discovering-novel-algorithms-with-alphatensor\">Discovering novel algorithms with AlphaTensor (DeepMind blog)</a>.</p>\n\n\n\n<p><strong>&nbsp;&nbsp;&nbsp;Get the code </strong><a href=\"https://github.com/deepmind/alphatensor\">(including the better matrix multiplication) here (DeepMind GitHub)</a>.</p>\n\n\n\n<p><strong>&nbsp;&nbsp;&nbsp;Read more:</strong> <a href=\"https://www.nature.com/articles/s41586-022-05172-4\">Discovering faster matrix multiplication algorithms with reinforcement learning (Nature)</a>.</p>\n\n\n\n<p>####################################################</p>\n\n\n\n<p><strong>The US government comes up with an AI &#8220;Bill of Rights&#8221; (minus the broad enforcement):</strong><br><em>…The rights are one way the government can alter how AI systems show up to the American public…</em></p>\n\n\n\n<p>The White House&#8217;s Office of Science and Technology Policy (OSTP) has published a &#8216;Bill of Rights&#8217; for AI systems. The idea is that the federal government will try to build and deploy AI systems in line with these rights, and the announcement of the Bill of Rights was paired with actions by federal agencies in line with the rights.<br></p>\n\n\n\n<p><strong>&#8220;The rights&#8221;:</strong> These rights are framed, at a high level, as five &#8220;common sense protections&#8221;. These include the right to use safe and effective systems, protection from algorithmic discrimination protections, data privacy, notice and explanation about the use of AI, and the ability to use human alternatives and/or opt out of certain systems.&nbsp;</p>\n\n\n\n<p><strong>Those rights in full:</strong></p>\n\n\n\n<ul>\n<li>You should be protected from unsafe or ineffective systems.</li>\n\n\n\n<li>You should not face discrimination by algorithms and systems should be used and designed in an equitable way.&nbsp;</li>\n\n\n\n<li>You should be protected from abusive data practices via built-in protections and you should have agency over how data about you is used.&nbsp;</li>\n\n\n\n<li>You should not face discrimination by algorithms and systems should be used and designed in an equitable way.&nbsp;</li>\n\n\n\n<li>You should be protected from abusive data practices via built-in protections and you should have agency over how data about you is used.&nbsp;</li>\n\n\n\n<li>You should know that an automated system is being used and understand how and why it contributes to outcomes that impact you.&nbsp;</li>\n\n\n\n<li>You should be able to opt out, where appropriate, and have access to a person who can quickly consider and remedy problems you encounter.&nbsp;</li>\n</ul>\n\n\n\n<p><strong>Why this matters: </strong>Ultimately, how much the AI Bill of RIghts matters seems to rest on two things: a) how much the White House is able to enforce alignment with the Bill of Rights across federal agencies, and b) whether third-parties like academic or corporate research groups build systems that themselves fall in line with the Bill of Rights. It&#8217;ll take time, but these rights may serve as a good way to develop more of the norms around the use of AI.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;<strong>Read more:</strong> <a href=\"https://www.whitehouse.gov/ostp/news-updates/2022/10/04/blueprint-for-an-ai-bill-of-rightsa-vision-for-protecting-our-civil-rights-in-the-algorithmic-age/\">Blueprint for an AI Bill of Rights: A Vision for Protecting Our Civil Rights in the Algorithmic Age (White House blog)</a>.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;<strong>Read more:</strong> <a href=\"https://www.whitehouse.gov/ostp/news-updates/2022/10/04/fact-sheet-biden-harris-administration-announces-key-actions-to-advance-tech-accountability-and-protect-the-rights-of-the-american-public/\">FACT SHEET: Biden-⁠Harris Administration Announces Key Actions to Advance Tech Accountability and Protect the Rights of the American Public (White House blog)</a>.</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;<strong>Read</strong> the <a href=\"https://www.whitehouse.gov/wp-content/uploads/2022/10/Blueprint-for-an-AI-Bill-of-Rights.pdf\">Bill of Rights: BLUEPRINT FOR AN AI BILL OF RIGHTS MAKING AUTOMATED</a></p>\n\n\n\n<p><a href=\"https://www.whitehouse.gov/wp-content/uploads/2022/10/Blueprint-for-an-AI-Bill-of-Rights.pdf\">SYSTEMS WORK FOR THE AMERICAN PEOPLE (White House, PDF)</a>.</p>\n\n\n\n<p>####################################################</p>\n\n\n\n<p><strong>Maybe it is Crazy, Maybe it is Magic</strong></p>\n\n\n\n<p>I didn&#8217;t think the route to intelligence was through insanity, but at this point, I&#8217;m open to being wrong about any of my assumptions.&nbsp;</p>\n\n\n\n<p>We&#8217;d been banging our heads against a model for a few months and though it was very capable in a bunch of ways, it couldn&#8217;t really reflect on things or update its own priors or do any of the things that felt important for creating an actual no-shit superintelligence.&nbsp;</p>\n\n\n\n<p>So one day we shipped something cwe called &#8216;the personality system&#8217;. I coded it in partnership with the AI model. I forget which of us came up with the term, but we gave it something we called &#8216;a Greek chorus prompt&#8217;; a whole bunch of distinct personalities which modeled over different problems and exchanged information with each other.&nbsp;</p>\n\n\n\n<p>The way I visualized it in my head was when we talked to the model, the model now spent a while talking to itself before answering us.&nbsp;</p>\n\n\n\n<p>The results surprised us; model capabilities went up across the board, and its answers attained a new level of specificity and detailed. So then we trained the model using reinforcement learning to try and bake the &#8216;greek chorus prompt&#8217; into the model at a deeper level.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;&nbsp;After that was done, the model started to freak us out. It was now significantly faster and generally more capable.&nbsp;</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;When we hooked it up to some interpretability tools, we realized our mistake. The different personalities had formed into what we called &#8216;personality circuits&#8217;; different personalities interacted with eachother to apply different methods of reasoning to tasks, and try as we might, we could never work out what rules governed how these personalities were used or exactly what they did &#8211; they were too high-dimensional, or perhaps a better way to put it is we were staring at the shadows on the wall from something of incalculably large dimensionality, projected back down.&nbsp;</p>\n\n\n\n<p>What would you do with a deeply capable person who was smarter than you, but who you knew to be, in terms of how we&#8217;d evaluate people, functionally insane? How much power would you give that thing?</p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;Perhaps, based on how things are these days, you can guess what we decided to do.&nbsp;</p>\n\n\n\n<p><strong>Things that inspired this story: </strong>Magic and mysticism in deep learning; prompting; RLHF; finetuning; various pitfalls in AI development; interpretability; the fact people are generally uninterpretable; capabilities versus safety overhangs.</p>\n",
  "wfw:commentRss": "https://jack-clark.net/2022/10/11/import-ai-305-gpt3-can-simulate-real-people-ai-discovers-better-matrix-multiplication-microsoft-worries-about-next-gen-deepfakes/feed/",
  "slash:comments": 0,
  "media:content": {
    "media:title": "Jack Clark"
  }
}