{
  "title": "TU56: How We Come to Define Ourselves &#8211; Attachment Research Over Decades with Guest Alan Sroufe",
  "link": "https://therapistuncensored.com/episodes/tu56-how-we-come-to-define-ourselves-attachment-research-over-decades-with-guest-alan-sroufe/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu56-how-we-come-to-define-ourselves-attachment-research-over-decades-with-guest-alan-sroufe",
  "pubDate": "Tue, 06 Mar 2018 12:00:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=5921",
  "description": "Pick the brain of a leading attachment researcher to more deeply understand how attachment styles from infancy are both stable and can change over time. Dr. Sroufe leads us through his 40 years of research to give us his reflections on what is important in parenting and in relationships to grow security.\n\n—-\n\nIf you’ve ever wanted to know how much you can predict a person’s development years in advance, then you’ll enjoy our conversation with Dr. Alan Sroufe. Co-host Sue Marriott LCSW, CGP talks with Dr. Sroufe about his research findings over the years and how insecure and secure attachment tendencies can develop and affect an individual through their lives.\n\nIs change possible? Yes, we will tell you how. Also, can reinforcing positive expectations and taking good care of yourself as a parent truly affect your child’s growth? You’ll learn about the legacies of attachment and the importance of being able to turn to someone when in need of support. This is a hopeful journey, please join us!\n\nDr. Alan Sroufe is an internationally recognized expert on early attachment relationships, emotional development, and developmental psychopathology and has published seven books and 140 articles on these and related topics!\n\nDr. Sroufe is Professor Emeritus of Child Psychology in the Institute of Child Development at the University of Minnesota and he has been an Associate Editor of Developmental Psychology and Development and Psychopathology.  His awards include the Distinguished Scientific Contribution Award from the Society for Research in Child Development, the Bowlby Ainsworth Award for Contributions to Attachment Research, the G. Stanley Hall Award for Distinguished Scientific Contribution to Developmental Psychology from Division 7 of the American Psychology Association, an Honorary Doctorate Degree from the University of Leiden, and the Distinguished Teaching Award from the College of Education, University of Minnesota.\n\nSIGN UP FOR OUR LIVE CONFERENCE ON ATTACHMENT APRIL 7, 2018 –  Healing Adult Attachment, the 3 Pillars of Integrated Treatment  with Dr. David Elliott (Thank you to our co-sponsor Austin IN Connection.)\n\nOnline reading group to start mid April, 2018 for Elliott’s book – Attachment Disturbances in Adults Comprehensive Treatment and Repair (Norton 2016) by Daniel Brown and David Elliott. Reserve your slot today!\n\n0:00-15:00\n\nIntroduction\n\nGuiding question behind Sroufe’s ongoing 1974 study\n\nCorrelation between stress in parents and anxious/secure attachment in children\n\nImportance of healthy relational questions\n\nWhy is change difficult? Negative expectations can result in off-putting behavior\n\nChronic early stress and early predictors\n\nLife stress\n\n15:00-30:00\n\nIntergenerational transmission and the importance of taking care of yourself as a parent for your child\n\nAttachment in children, positive expectations through parents, learning to manage yourself at a young age\n\nPositive relationships with teachers reported for those with secure attachment backgrounds\n\nAnecdote about Vera’s dream\n\n30:00-45:00\n\nThe importance of a supportive relationship as a predictor\n\nThose with secure history who experience bad times don’t lose their secure history\n\n“Earned” secure attachment and its neurological intricacies\n\nDavid Elliot, Healing Trauma\n\nTransitional moments in development\n\n45:00-60:00\n\nAdolescents, capacity for vulnerability\n\nImportance of being able to turn to someone, giving and receiving support, legacies of attachment\n\nThe difficulty of self-reporting, necessity of being observed, AAI\n\nImpact of culture and class on development\n\nImpact of socioeconomic situation\n\nAttachment in primates\n\nWrap Up & Outro\n\nResources:\n\nThe Development of the Person The Minnesota Study of Risk and Adaptation from Birth Through Adulthood \n\nby Dr. Alan Sroufe et al.\n\nTo reach Dr. Sroufe\n\nDr. Sroufe’s CV\n\nLessons from the Minnesota Longitudinal Study",
  "enclosure": "",
  "itunes:subtitle": "Pick the brain of a leading attachment researcher to more deeply understand how attachment styles from infancy are both stable and can change over time. Dr. Sroufe leads us through his 40 years of research to give us his reflections on what is importan...",
  "itunes:summary": "Pick the brain of a leading attachment researcher to more deeply understand how attachment styles from infancy are both stable and can change over time.  Dr. Sroufe leads us through his 40 years of research to give us his reflections on what is important in parenting and in relationships to grow security.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "1:00:05"
}