{
  "id": "yt:video:TOnB8rcHGHY",
  "yt:videoId": "TOnB8rcHGHY",
  "yt:channelId": "UC2iUwfYi_1FCGGqhOUNx-iA",
  "title": "Avatar: The Last Airbender: 20 Tiny Details Only Fans Noticed",
  "link": "",
  "author": {
    "name": "Screen Rant",
    "uri": "https://www.youtube.com/channel/UC2iUwfYi_1FCGGqhOUNx-iA"
  },
  "published": "2022-11-04T16:15:01+00:00",
  "updated": "2022-11-04T16:15:01+00:00",
  "media:group": {
    "media:title": "Avatar: The Last Airbender: 20 Tiny Details Only Fans Noticed",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Fans of Avatar: The Last Airbender unite! The long-awaited live action series is finally coming to Netflix. And while we eagerly await it, let’s take a look back at our favorite group of air, fire, water, and earthbenders. In this video, we’re taking a look at some fun details about the first series that you might have missed. We’re talking sneaky little things snuck in by the animators, like faces in cabbage, and scars on feet. Then there are some fun character traits you might have missed, like the way these intrepid folks handle their budding romances. Or how they carefully craft their jasmine tea (looking at you, Uncle Iroh!) We also take a look at some behind the scene factoids about the making of the show. Like, did you know one character who plays a villain is actually known best for playing one of the greatest heroes in cinema history? Ok, maybe you knew that one, but you might now know some of the other VO-based tidbits we’ve got in here for you. Plus we go over a few pop culture references that the show sneaks in there, from WWE, to SpongeBob. Any big fan of Avatar: The Last Airbender has likely watched the series at least a couple times, so maybe you will have already caught some of these details. But hopefully there are some in here that’ll surprise you. If nothing else, they’ll get you hyped for the upcoming release of the new live-action show!\n\nSubscribe: http://bit.ly/Subscribe-to-Screenrant\n\nChapters:\n0:00 Intro \n00:28 The Rock and the Skywalker\n03:01 Fun Voiceover Details\n04:54 Faces, Faces, Faces\n06:40 Feet Don’t Fail Me Now\n08:03 Mental Health Appreciation\n09:11 Foodie Details\n10:40 Cabbage!\n11:56 Kissing, Romance, and Crushes\n13:22 In the Nick(elodeon) of Time\n\nCheck out Screen Rant’s official TikTok! \nhttps://www.tiktok.com/@screenrant \n\nOur Social Media:\nhttps://twitter.com/screenrant \nhttps://www.facebook.com/ScreenRant  \nhttps://www.linkedin.com/company/screen-rant/ \n\nOur Website:\nhttp://screenrant.com/\n\nWritten by: Tim Blane\nNarrated by: Tim Blane\nEdited by: Vitalii V.\n\nFor copyright matters please contact us at: legal@valnetinc.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}