{
  "title": "The Best and Worst Thing About Financial Independence",
  "link": "https://www.madfientist.com/best-and-worst-about-fi/",
  "comments": "https://www.madfientist.com/best-and-worst-about-fi/#comments",
  "dc:creator": "The Mad Fientist",
  "pubDate": "Thu, 19 Sep 2019 18:29:55 +0000",
  "category": "FIRE (Financial Independence / Retire Early)",
  "guid": "http://www.madfientist.com/?p=6448",
  "description": "<p class=\"lead\">The best thing about financial independence is also the worst. I explain what it is and also share details about the secret project I've been working on!</p>\n<p class=\"more-link-p\"><a class=\"btn btn-danger\" href=\"https://www.madfientist.com/best-and-worst-about-fi/\">Read more &#8594;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/best-and-worst-about-fi/\">The Best and Worst Thing About Financial Independence</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "content:encoded": "<p>I&#8217;ve never had a paragraph smack me in the face before.</p>\n<p>This one did and it hit me like a brick&#8230;</p>\n<blockquote><p>Here is Maggie, the aspiring writer:</p>\n<p>&#8220;I recognized that when it comes to artistic or creative endeavors I had internalized a fixed mindset. I believed that people were inherently artistic or creative and that you could not improve through effort. This directly affected my life because I have always wanted to be a writer, but have been afraid to pursue any writing classes or share my creative writing with others. This is directly related to my mindset because any negative criticism would mean that I’m not a writer inherently. I was too scared to expose myself to the possibility that I might not be a &#8216;natural'&#8221;</p>\n<p>Maggies’ internal monologue used to say: Don’t do it. Don’t take a writing class. Don’t share your writing with others. It’s not worth the risk. Your dream could be destroyed. Protect it.</p></blockquote>\n<p>When I read that last paragraph, it became clear that I&#8217;ve been sabotaging myself my entire adult life.</p>\n<p>For as long as I can remember, I&#8217;ve dreamt of creating something (more on that below).</p>\n<p>What&#8217;s crazy is, I hadn&#8217;t worked towards achieving that goal.</p>\n<p>It wasn&#8217;t until I read that paragraph in <a href=\"https://amzn.to/2ZZyryH?tag=madfientist-20\" target=\"_blank\" rel=\"nofollow    noopener\">Mindset</a> by Carol Dweck that I realized what had been happening.</p>\n<p>Like Maggie, I hadn&#8217;t taken any steps towards achieving my goal because I didn&#8217;t want to risk losing the dream completely.</p>\n<p>But not working toward the goal would guarantee failure so why would I choose that?!</p>\n<h2>My Goal</h2>\n<p>Before I discuss why I was sabotaging myself, I first better come clean with this big goal&#8230;</p>\n<p><em>I want to write, record, and release an album</em></p>\n<p>It&#8217;s crazy I&#8217;ve never talked about this before but I&#8217;ve been reluctant to share because then I&#8217;d finally have to try (and possibly fail).</p>\n<p>Music has played such a huge role in my life.</p>\n<p>From dancing to Michael Jackson as a toddler&#8230;</p>\n<p><div id=\"attachment_6465\" style=\"width: 510px\" class=\"wp-caption aligncenter\"><a href=\"https://www.madfientist.com/wp-content/uploads/2019/09/mad-fientist-jackson.jpg\"><img aria-describedby=\"caption-attachment-6465\" loading=\"lazy\" class=\"size-full wp-image-6465\" src=\"https://www.madfientist.com/wp-content/uploads/2019/09/mad-fientist-jackson.jpg\" alt=\"Mad Fientist Jackson\" width=\"500\" height=\"559\" srcset=\"//www.madfientist.com/wp-content/uploads/2019/09/mad-fientist-jackson.jpg 500w, //www.madfientist.com/wp-content/uploads/2019/09/mad-fientist-jackson-268x300.jpg 268w\" sizes=\"(max-width: 500px) 100vw, 500px\" /></a><p id=\"caption-attachment-6465\" class=\"wp-caption-text\">I sadly didn&#8217;t have a sequin glove but you better believe I had a tube sock</p></div></p>\n<p>&#8230;to getting into grunge as a pre-teen&#8230;</p>\n<p><div id=\"attachment_6466\" style=\"width: 510px\" class=\"wp-caption aligncenter\"><a href=\"https://www.madfientist.com/wp-content/uploads/2019/09/mad-fientist-cobain.jpg\"><img aria-describedby=\"caption-attachment-6466\" loading=\"lazy\" class=\"size-full wp-image-6466\" src=\"https://www.madfientist.com/wp-content/uploads/2019/09/mad-fientist-cobain.jpg\" alt=\"Mad Fientist Cobain\" width=\"500\" height=\"609\" srcset=\"//www.madfientist.com/wp-content/uploads/2019/09/mad-fientist-cobain.jpg 500w, //www.madfientist.com/wp-content/uploads/2019/09/mad-fientist-cobain-246x300.jpg 246w\" sizes=\"(max-width: 500px) 100vw, 500px\" /></a><p id=\"caption-attachment-6466\" class=\"wp-caption-text\">My Grandpap used cutting-edge 90&#8217;s software to put my 12-year-old face on Kurt&#8217;s</p></div></p>\n<p>&#8230;to exploring more experimental music in my early teens&#8230;</p>\n<p><div id=\"attachment_6467\" style=\"width: 510px\" class=\"wp-caption aligncenter\"><a href=\"https://www.madfientist.com/wp-content/uploads/2019/09/mad-fientist-angst.jpg\"><img aria-describedby=\"caption-attachment-6467\" loading=\"lazy\" class=\"size-full wp-image-6467\" src=\"https://www.madfientist.com/wp-content/uploads/2019/09/mad-fientist-angst.jpg\" alt=\"Mad Fientist Angst\" width=\"500\" height=\"501\" srcset=\"//www.madfientist.com/wp-content/uploads/2019/09/mad-fientist-angst.jpg 500w, //www.madfientist.com/wp-content/uploads/2019/09/mad-fientist-angst-150x150.jpg 150w, //www.madfientist.com/wp-content/uploads/2019/09/mad-fientist-angst-300x300.jpg 300w\" sizes=\"(max-width: 500px) 100vw, 500px\" /></a><p id=\"caption-attachment-6467\" class=\"wp-caption-text\">Wearing a Sonic Youth shirt while playing guitar <br />(my <a href=\"https://www.madfientist.com/my-brother-interview/\" target=\"_blank\" rel=\"noopener\">goofy brother</a> didn&#8217;t understand my teenage angst)</p></div></p>\n<p>&#8230;to having bands like Brainiac and Polvo change the entire trajectory of my life.</p>\n<p><div id=\"attachment_6470\" style=\"width: 464px\" class=\"wp-caption aligncenter\"><a href=\"https://www.madfientist.com/wp-content/uploads/2019/09/brainiac.jpg\"><img aria-describedby=\"caption-attachment-6470\" loading=\"lazy\" class=\"size-full wp-image-6470\" src=\"https://www.madfientist.com/wp-content/uploads/2019/09/brainiac.jpg\" alt=\"brainiac\" width=\"454\" height=\"454\" srcset=\"//www.madfientist.com/wp-content/uploads/2019/09/brainiac.jpg 454w, //www.madfientist.com/wp-content/uploads/2019/09/brainiac-150x150.jpg 150w, //www.madfientist.com/wp-content/uploads/2019/09/brainiac-300x300.jpg 300w\" sizes=\"(max-width: 454px) 100vw, 454px\" /></a><p id=\"caption-attachment-6470\" class=\"wp-caption-text\">Brainiac&#8217;s aesthetic inspired me to embrace my math and science skills, which lead to me studying computer science</p></div></p>\n<p>Music has enhanced my life in so many ways and it&#8217;s been my dream to take my love of music even further by writing and releasing my own.</p>\n<p>I don&#8217;t have grand visions of becoming a star or anything and I have no desire for the fame, money, or other &#8220;benefits&#8221; that mainstream success in the music business would bring.</p>\n<p>I simply want to make weird music that I enjoy.</p>\n<div class=\"bonus_box\">\n<p>To hear some of the incredible bands that influenced me most over the years, check out this <a href=\"https://open.spotify.com/playlist/13wSoKa6Ua7oLD78y0drhj\" target=\"_blank\" rel=\"nofollow    noopener\">Spotify playlist</a> I created.</p>\n<p><iframe src=\"https://open.spotify.com/embed/playlist/13wSoKa6Ua7oLD78y0drhj\" width=\"800\" height=\"80\" frameborder=\"0\"></iframe></p>\n<p>And make sure you click the heart button in Spotify to save the playlist to your library because I plan to add more music for my next article (and will hopefully be including some of my own soon!)</p>\n</div>\n<p>This goal isn&#8217;t overly-ambitious and it&#8217;s obviously important to me so why wasn&#8217;t I working towards achieving it?</p>\n<h2>Fixed vs. Growth Mindset</h2>\n<p>Turns out, I had a &#8220;fixed mindset&#8221; when it came to making music.</p>\n<p>I had built up this identity of being an analytical &#8220;math and science guy&#8221; but that is the opposite of the creative musician I wanted to become.</p>\n<p>I could sit down and study for hours until I learned a programming concept but I didn&#8217;t think hard work would help me be creative.</p>\n<p>I thought I either had it in me to write good songs or I didn&#8217;t.</p>\n<p>So rather than throw a bunch of hard work at the problem, as I did in other areas of my life, I was too scared to try because I didn&#8217;t want to find out that I didn&#8217;t have what it took (which would kill the dream).</p>\n<p>Do you have anything in your life like that? Are there things you want to do but aren&#8217;t even trying to do?</p>\n<p>Thankfully, Dweck&#8217;s book made me realize that songwriting is no different from anything else and I can get better at it with practice, just like I can get stronger by lifting weights or I can learn more about math by studying.</p>\n<p>Although my body is a bit too old to achieve my boyhood dreams of becoming an NHL star, my mind is still capable of changing.</p>\n<p><div id=\"attachment_6468\" style=\"width: 510px\" class=\"wp-caption aligncenter\"><a href=\"https://www.madfientist.com/wp-content/uploads/2019/09/mad-fientist-lemieux.jpg\"><img aria-describedby=\"caption-attachment-6468\" loading=\"lazy\" class=\"size-full wp-image-6468\" src=\"https://www.madfientist.com/wp-content/uploads/2019/09/mad-fientist-lemieux.jpg\" alt=\"Mad Fientist Lemieux\" width=\"500\" height=\"587\" srcset=\"//www.madfientist.com/wp-content/uploads/2019/09/mad-fientist-lemieux.jpg 500w, //www.madfientist.com/wp-content/uploads/2019/09/mad-fientist-lemieux-256x300.jpg 256w\" sizes=\"(max-width: 500px) 100vw, 500px\" /></a><p id=\"caption-attachment-6468\" class=\"wp-caption-text\">More of my Grandpap&#8217;s handiwork</p></div></p>\n<p>Dweck&#8217;s <a href=\"https://amzn.to/2ZZyryH?tag=madfientist-20\" target=\"_blank\" rel=\"nofollow    noopener\">Mindset</a> showed me that brains can form new connections and improve existing connections through practice and repetition (a great example she gave is how the brains of blind people start using the visual cortex when reading Braille, even though their eyes aren&#8217;t doing anything).</p>\n<p>This helped me believe that it is possible to get better at something creative like songwriting so I&#8217;m finally giving it a shot.</p>\n<h2>Unhappiness Before FI</h2>\n<p>Looking back, I can now see that not pursuing this dream for all those years was a big source of my unhappiness.</p>\n<p>Even though it seemed like my brain was quite content tricking itself into inaction, deep down I must have known what was going on.</p>\n<p>Actually, I know for a fact that I knew what was going on.  Check out this quote from <a href=\"https://www.madfientist.com/emotions-of-fi/\" target=\"_blank\" rel=\"noopener\">an article I wrote in 2013</a>:</p>\n<blockquote><p>After achieving FI, I won’t have full-time employment as an excuse anymore. Will I find other ways to procrastinate or will I finally start pursuing some of my creative goals? If I do start working towards my goals, will I fail? Has my procrastination been a way of keeping my dreams alive even though, deep down, I realize they are probably not attainable?</p></blockquote>\n<p>I knew what was going on but I was able to fool myself because I had something to blame for not making any progress &#8211; my job.</p>\n<p>&#8220;I&#8217;d be writing music if I didn&#8217;t have to work 40 hours a week!&#8221;</p>\n<p>&#8220;My commute tires me out so that&#8217;s why I&#8217;m not working on anything after I get home from work.&#8221;</p>\n<p>&#8220;Watching TV isn&#8217;t getting me closer to releasing an album but can you blame me for needing to unwind after a hard day in the office?&#8221;</p>\n<p>I had a perfect scapegoat and it allowed me to continue down the path of doing nothing (yet keeping my dream alive).</p>\n<p>Then came FI&#8230;</p>\n<h2>No More Excuses</h2>\n<p>I wanted to achieve FI so that I didn&#8217;t have to have a job and could instead work on music full-time.</p>\n<p>It&#8217;ll be great! I&#8217;ll have all the time in the world and then I&#8217;ll finally do it, after all these years of thinking about it!</p>\n<p>Sadly, my brain kept ruining that plan too.</p>\n<p>I couldn&#8217;t get started. Even though I had all day to work on music, I&#8217;d still find other things to do instead.</p>\n<p>The problem is, I didn&#8217;t have a scapegoat to blame for this. I didn&#8217;t have a boss telling me what to do. I didn&#8217;t have anywhere to be or anything I needed to do.</p>\n<p>I only had myself to blame.</p>\n<p>But brains don&#8217;t like blaming themselves for things.</p>\n<p>So that&#8217;s when I started trying to put the blame elsewhere&#8230;</p>\n<p>&#8220;Ugh, replying to all these emails is taking up my entire day.&#8221;</p>\n<p>&#8220;I can&#8217;t do anything in this small apartment in Scotland&#8230;I need to move to a house and get a proper studio to work in.&#8221;</p>\n<p>&#8220;If only Jill would stop planning so many events with friends and family, I could finally get something done.&#8221;</p>\n<p>&#8220;Once I get a new synthesizer, the songs will start pouring out of me.&#8221;</p>\n<p>Those excuses were obviously bullshit though.</p>\n<p>And even though I realized deep down that my job wasn&#8217;t the reason I wasn&#8217;t making progress before, these new excuses were even flimsier so it was more obvious that I was the problem.</p>\n<h2>Hazard of FI</h2>\n<p>This is a potential hazard of post-FI life.</p>\n<p>If you&#8217;re unhappy when you&#8217;re working and you blame your job for all your problems, you may struggle after FI if you&#8217;re still unhappy.</p>\n<p>What do you do when your biggest scapegoat disappears?</p>\n<p>Your job doesn&#8217;t have feelings so you can blame it for all your issues and it won&#8217;t care. But when your job is gone and you start blaming your wife, your friends, or your kids instead, it&#8217;s not going to go down as well.</p>\n<p>You&#8217;ll hopefully realize that those external things aren&#8217;t the reason you&#8217;re unhappy but, as I mentioned before, it&#8217;s very hard to do&#8230;especially when it&#8217;s you that&#8217;s the problem.</p>\n<p>Thankfully, I realize now what had caused most of my unhappiness both before and after leaving work &#8211; I wasn&#8217;t making progress on these types of important projects.</p>\n<h2>The Best Thing About FI</h2>\n<p>This leads us to the best and worst things about financial independence.</p>\n<p>They&#8217;re actually the same thing&#8230;</p>\n<p><em>Financial independence gives you the freedom to do anything you want with your life.</em></p>\n<p>Let&#8217;s explore why this is good first&#8230;</p>\n<h3>The Opportunity of a Lifetime</h3>\n<p>You don’t have to worry about money and you have the time and freedom to accomplish almost anything you want to.</p>\n<p>During last year&#8217;s Winter Olympics, I was at my brother-in-law&#8217;s house and we joked that it&#8217;d be amazing to compete in a future Winter Olympics together in curling.</p>\n<p>I thought about this more afterward and realized that this could be achievable now that I&#8217;m FI.</p>\n<p>When you&#8217;re financially independent and you decide you want to become a world-class curler, you could:</p>\n<ul>\n<li>Practice all day while everyone else is working to pay the bills</li>\n<li>Volunteer your time at a local ice rink in exchange for more ice access and more practice time</li>\n<li>Use some of your savings to pay for a coach so that you progress even faster</li>\n</ul>\n<p>If you are persistent and dedicated, there&#8217;s no doubt you could excel.</p>\n<h3>Reborn after FI</h3>\n<p>Achieving FI is like being reborn.</p>\n<p>Who you were before FI doesn&#8217;t matter and who you are after is completely up to you.</p>\n<p>I am already quite different than the person I was before I quit my job and I imagine I&#8217;ll change even more in the years to come.</p>\n<p>Shifting your identity is difficult and takes time (more on that in future articles/podcasts) but it is achievable.</p>\n<h2>The Worst Thing About FI</h2>\n<p>These benefits are amazing but the best thing about FI is also the worst thing:</p>\n<p><em>Financial independence gives you the freedom to do anything you want with your life.</em></p>\n<p>Now, if you aren&#8217;t living the life you want, you only have yourself to blame.</p>\n<p>We are all great at making excuses and fooling ourselves.  How many of you are putting off pursuing your big life goals because you &#8220;don&#8217;t have time&#8221; or you are &#8220;waiting until you hit FI to start&#8221;?</p>\n<p>Do you say you don&#8217;t have time to go to the gym but somehow, you&#8217;ve been able to watch all the Game of Thrones episodes?</p>\n<p>Guess what&#8230;</p>\n<p>When you achieve financial independence and you leave your job, you&#8217;re going to have all the time in the world.</p>\n<p>That means those convenient little excuses that have kept you from feeling bad about yourself go away.</p>\n<p>You finally have to put up or shut up.</p>\n<p>You have to become the person you&#8217;ve planned to be (or already thought you were).</p>\n<p>It&#8217;s amazing how a person&#8217;s image of themselves in their heads differs from the actions they take.</p>\n<p>As I mentioned, I think this is the cause of a lot of unhappiness. I know it made me unhappy but I&#8217;m only realizing that now.</p>\n<h3>What to Choose?</h3>\n<p>Another reason that having the freedom to do anything can be problematic is because it&#8217;s hard to choose what to do.</p>\n<p>What&#8217;s a good use of your time when you don&#8217;t have a normal script to follow? What motivates you now that money doesn&#8217;t matter as much?  What brings you happiness and fulfillment when the normal goalposts and measuring sticks people use no longer apply to you?</p>\n<h2>Takeaway</h2>\n<p>So what should you do?</p>\n<p>Don&#8217;t wait until FI to start these important things.</p>\n<p>Start exercising now.</p>\n<p>Eat better now.</p>\n<p>Start making progress on the things that matter to you now.</p>\n<p>Work on improving your happiness and mental health now.</p>\n<p>Start building your ideal life before you hit FI.</p>\n<p>Yes, it&#8217;ll be a bit easier to do everything when you don&#8217;t have a full-time job taking up so much of your time but FI is not a magic bullet and it&#8217;s not going to instantly change you into a new person.</p>\n<p>You&#8217;re still going to have to do the hard work to change yourself into the person you want to be so you might as well start doing that now while you still have a nice scapegoat to blame when things don&#8217;t go exactly as planned.</p>\n<p>And if you&#8217;re already FI and are struggling with similar challenges, know that the struggle is worthwhile.</p>\n<p>There&#8217;ve been many times I wished I could forget about this dream of mine and just enjoy my job-free life to the fullest (instead of struggling so much with completing difficult tasks, battling self-doubt, maintaining motivation, etc.).</p>\n<p>I&#8217;m glad I persevered though because <span style=\"font-size: inherit;\">I&#8217;m a lot happier now that I&#8217;m finally doing what I&#8217;ve always known I should be doing.</span></p>\n<p>In his book, <a href=\"https://amzn.to/2O1j1mp?tag=madfientist-20\" target=\"_blank\" rel=\"nofollow    noopener\">Ultralearning</a>, Scott Young (who is my next <a href=\"https://www.madfientist.com/podcast/\" target=\"_blank\" rel=\"noopener\">podcast</a> guest!) shares the following:</p>\n<blockquote><p>Your deepest moments of happiness don’t come from doing easy things; they come from realizing your potential and overcoming your own limiting beliefs about yourself.</p></blockquote>\n<p>I am in the process of tackling my most-formidable limiting belief and although I still have a long way to go, I&#8217;m thankfully starting to see what he means.</p>\n<h2>What do you think?</h2>\n<p>Have you struggled with similar issues? Do you have a fixed mindset about certain topics? Do you have any advice for tackling tasks you don&#8217;t feel like you can accomplish?</p>\n<p>Please share in the comments below!</p>\n<p>And if you&#8217;re a musician and have any songwriting tips, I&#8217;d love to hear them because I still feel like I need all the help I can get!</p>\n<p>I&#8217;d also love to hear what you think of all the music I shared on the <a href=\"https://open.spotify.com/playlist/13wSoKa6Ua7oLD78y0drhj\" target=\"_blank\" rel=\"nofollow    noopener\">Spotify playlist</a>.  Are there any Brainiac fans out there?  Anyone into similar music?</p>\n<p><h2>Related Post</h2><div><a href='https://www.madfientist.com/james-clear-interview/' target='_blank'><div class='post_card'><div class='post_card_text'><h3 style='color:#399da8;'>James Clear - Atomic Habits and Building a New Identity After Retirement</h3><p class='post_card_excerpt'>James Clear joins me on the Financial Independence Podcast to talk about productivity, deliberate practice, fasting, and his new book - Atomic Habits!</p></div><div class='post_card_image'><img src='https://www.madfientist.com/wp-content/uploads/2018/10/james-clear-interview.jpg' style='border-radius:7px;'/></div></div></a></div></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/best-and-worst-about-fi/\">The Best and Worst Thing About Financial Independence</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "wfw:commentRss": "https://www.madfientist.com/best-and-worst-about-fi/feed/",
  "slash:comments": 122
}