{
  "title": "TU96: Treating Attachment &#038; Self-Protective Strategies With Guest Patricia Crittenden(Part 1)",
  "link": "https://therapistuncensored.com/episodes/tu96-treating-attachment-self-protective-strategies-with-guest-patricia-crittenden-part-1/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu96-treating-attachment-self-protective-strategies-with-guest-patricia-crittenden-part-1",
  "pubDate": "Wed, 15 May 2019 20:04:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=7102",
  "description": "Treating Attachment & Self-Protective Strategies\n“If it protects you, it’s the right strategy.” – Dr Patricia Crittenden, creator of the Dynamic Maturational Model of Attachment & Adaptation (DMM) using culture and context.\nLOOKING FOR THE SLIDES?\nDOWNLOAD THE PDF HERE: Rudiments-of-the-DMM-PDF VERSION \nOR THE POWERPOINT VERSION HERE:  Rudiments of the DMM Powerpoint version \n\nOr if you have great eyesight :) you can view them here.\n\n          \n\nAre you ready to move from describing injured developmental pathways and symptoms – to addressing how to heal from disrupted development? We are on the case! In this episode co-host Sue Marriott LCSW, CGP discusses exactly that with Dr. Patrica Crittenden, founder of the Dynamic Maturational Model of Attachment & Adaption (DMM) using culture and context to understand, decode and heal early relational injuries.\n\nTheir conversation was deep and wide, thus will be published in two sections. In today’s episode, TU96, Dr. Crittenden focuses on wide-reaching cultural aspects of development, safety and danger. She uses decades of observations, assessment, research and clinical work to describe her take on what she refers to as the American Attachment researchers and elucidates how her model is similar and where and why it differs.\n\nDr. Crittenden’s focus on applying this rich research clinically aligns perfectly with the mission of this podcast. Whether you are a clinician, foster parent, educator or are interested for your own personal reasons, you will find her perspective fresh and thought-provoking!\n\nPlease see the PACKED resources and show notes below!\nWho is Patricia Crittenden and why do want to know her….\nDr. Mary Ainsworth\n\nDr. Crittenden studied under Mary. D. Ainsworth from 1978 until 1983, when she received her Ph.D. as a psychologist in the Social Ecology and Development Program at the University of Virginia.\n\nIn addition to Mary Ainsworth’s constant guidance and support, her psychology master’s thesis on the CARE-Index, was developed in consultation with John Bowlby and her family systems research, on patterns of family functioning in maltreating families, was accomplished with guidance from E. Mavis Hetherington.\n\nJohn Bowbly\n\nDr. Crittenden has served on the Faculties of Psychology at the Universities of Virginia and Miami and held visiting professorships at the Universities of Helsinki (Finland) and Bologna (Italy) as well as San Diego State University (USA) and Edith Cowan University (Australia).\n\nIn 1992 she received a Senior Post-doctoral Fellowship, with a focus on child sexual abuse and the development of individual differences in human sexuality, at the Family Research Laboratory, University of New Hampshire. In 1993-4 she was awarded the Beverley Professorship at the Clark Institute of Psychiatry (Canada).\n\nIn the last two decades, Dr. Patricia Crittenden has worked cross-culturally as a developmental psychopathologist developing the Dynamic-Maturational Model (DMM) of attachment and adaptation, along with a developmentally attuned, life-span set of procedures for assessing self-protective strategies. She has received a career achievement award for “Outstanding Contributions to the Field of Child and Family Development” from the European Family Therapy Association in Berlin.\n\nCurrently, Dr. Crittenden’s work is focused on preventive and culture- sensitive applications of the DMM to mental health treatment, child protection, and criminal rehabilitation.\nBefore we begin:\n\n \tA’s (Red in the DMM)=Historically referred to as Blue on TU\n \tB’s (Blue in the DMM)=Historically referred to as Green on TU\n \tC’s (Green in the DMM)=Historically referred to as Red on TU\n \tAC’s = Historically referred to Tie Dye on TU\n\n**Note: We know the colors may be a bit confusing, but it is important to us that you receive information as Dr Crittenden has published it. It is by happenstance that our colors are the same (with the exception of tie dye),",
  "enclosure": "",
  "itunes:subtitle": "Treating Attachment & Self-Protective Strategies “If it protects you, it’s the right strategy.” – Dr Patricia Crittenden, creator of the Dynamic Maturational Model of Attachment & Adaptation (DMM) using culture and context. LOOKING FOR THE SLIDES?",
  "itunes:summary": "Discover a new voice and unique perspective in the treatment and assessment of attachment injuries.  Dr. Patricia Crittenden shares her model, the Dynamic Maturational Model of Attachment and Adaptation, and uses her rich international background to deepen our understanding of culture and context on self-survival strategies.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "41:35"
}