{
  "title": "90: Say Her Name: The Life and Death of Sandra Bland",
  "link": "https://audioboom.com/posts/7298344",
  "itunes:episode": 90,
  "itunes:title": "Say Her Name: The Life and Death of Sandra Bland",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3376,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On July 10, 2015, a 28 year-old black woman named Sandra Bland was pulled over in a small Texas town for failing to use a turn signal when she changed lanes. She was ultimately arrested and taken to the county jail. Three days later, she was found dead in her cell. The official coroner's report ruled the death a suicide, but many people believe that Sandra Bland was murdered. Sandy, as she was known to her family and friends, became a national figure in the Black Lives Matter Movement and \"Say Her Name\" attempts to uncover the truth behind her arrest and death. <br>\n<br>\n<strong>LOOKING FOR MORE TCO? WHO COULD BLAME YOU</strong>! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Join our Patreon famand</a> instantly get over <strong>80 FULL BONUS episodes to BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!<br>\n<br>\n</a><a href=\"https://www.patreon.com/TrueCrimeObsessed/posts\">Check our our TCO After Party to hear our recap of our recap!</a> This week we're giving you ALL THE STORIES from our time in Nashville for PODX ad New Orleans for CrimeCon. And Things get a little bit.....steamy.....<br>\n<br>\n\n</div>\n<div>\n<a href=\"https://www.truecrimeobsessed.com/see-us-live\"><strong>COME TO OUR PRIDE SHOW!</strong></a><strong> </strong>Come hang with us in NYC on Saturday, June 29th--the 50th Anniversary of The Stonewall Riots! It will be one of our most special and memorable live shows to date! <strong>All ticket holders are welcome to join Patrick on a FREE walking tour of the West Village on the morning of the show!</strong> He'll show you all the spots from the gay liberation movement, old New York movies, and even Sex and the City--all within a few blocks! <a href=\"https://www.truecrimeobsessed.com/see-us-live\">Get tickets to the Pride Show here!<br>\n</a><br>\n\n</div>\n<div>\n<br>\n<br>\n<br>\n<br>\n<br>\n\n</div>\n",
  "pubDate": "Tue, 25 Jun 2019 04:01:00 +0000",
  "guid": "tag:audioboom.com,2019-06-25:/posts/7298344",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}