{
  "title": "Data Science Trend Forecast: 2020",
  "link": "https://dimensionless.in/2020-trends-data-science/",
  "comments": "https://dimensionless.in/2020-trends-data-science/#respond",
  "dc:creator": "Samadrita Ghosh",
  "pubDate": "Sun, 29 Dec 2019 23:50:44 +0000",
  "category": [
    "Data Science",
    "Trending",
    2019,
    "2019 trends",
    "AI",
    "Big Data",
    "BlockChain",
    "Cloud Computing",
    "data science careers",
    "Data Science Trends"
  ],
  "guid": "https://dimensionless.in/?p=218409",
  "description": "Taking into consideration the positive trends of Data Science from previous years, there lies an immense well of possibilities that awaits us in the future, that is, the upcoming year 2020. Some of these Data Science Trend Forecast for 2020 can be foreseen as follows: Augmented Analysis Complicated code and extensions will no longer be [&#8230;]",
  "content:encoded": "<p>Taking into consideration the positive trends of <a href=\"https://dimensionless.in/2019-trends-data-science/\">Data Science from previous years</a>, there lies an immense well of possibilities that awaits us in the future, that is, the upcoming year 2020. Some of these Data Science Trend Forecast for 2020 can be foreseen as follows:</p>\n<ul>\n<li>\n<h4>Augmented Analysis</h4>\n</li>\n</ul>\n<p>Complicated code and extensions will no longer be required to get deep insights from data. The augmented analysis helps layman users/analysts (in machine learning/data science) to make use of AI to analyze data. This will change the way data is consumed, created and shared across all data-intensive fields. Already several BI and analytics tools are trying to implement AI assistance full force in their platforms.</p>\n<ul>\n<li>\n<h4>Continuous/ Real-time Intelligence</h4>\n</li>\n</ul>\n<p>There is intensive activity ongoing every second in real-time platforms. If through some method, one can plug into this data, real-time user experience can be enhanced manifold. Continuous or real-time intelligence aims to do just that by analyzing data in real-time so that instant results can be provided to the user while he is still surfing the platform. It can also help increase profit margins by re-aligning the platform as per the observed interaction of the user.</p>\n<ul>\n<li>\n<h4>NLP</h4>\n</li>\n</ul>\n<p>Natural Language Processing is a very important segment of Artificial Intelligence since most real-world data are in text or voice format. To process such data, advanced NLP techniques are required which are being innovated with each passing data. Today, we can read, understand, classify and even create unique text documents with the help of machines. Further developments like intelligent summarization, entity recognition and task management using text input and much more are expected to happen, owing to the intense research and increasing data-science experts choosing NLP specialisation.</p>\n<ul>\n<li>\n<h4>Conversational technology</h4>\n</li>\n</ul>\n<p>There has already been a visible surge in the performance of voice assistants in 2019. In 2020, it is expected to further improve such that the conversational systems become more sensitive to the human language and also more humane in their response. By more humane, it will mean that the systems can keep track of previous responses and questions (which is not a very developed feature in any voice assistant in the market to this day). Also, most client interactions are expected to be taken over by conversational technology, thus, increasing response rate and efficiency.</p>\n<ul>\n<li>\n<h4>Explainable AI</h4>\n</li>\n</ul>\n<p>The last decade has seen massive growth in AI aided decisions for sure, but it has been a persistent problem to be able to explain these decisions or why the AI wants to go a certain way instead of another. Recently, however, a lot of research has increased the scope of explainable AI. 2020 can further be invested in understanding problems like say, how and why a certain neural network arrived at a certain decision. This will indefinitely increase the faith of clients on adolescent technology.</p>\n<ul>\n<li>\n<h4>Persistent memory/ In-memory computation</h4>\n</li>\n</ul>\n<p>In-memory computing or IMC can deliver extremely high-performance tasks due to optimized memory architecture. It also has become more feasible due to the decreasing expense of memory which owes credit to constantly emerging innovations.</p>\n<ul>\n<li>\n<h4>Data Fabric</h4>\n</li>\n</ul>\n<p>Data Fabric helps in the smooth access and sharing of data in distributed environments. It is usually custom made and helps in the transfer and store of data, data pipelines, APIs and previously used data services that have a chance of being re-invoked. Trusted and efficient data fabric can help to catalyze data science pipelines and reduce delays in customer-client interaction/iterations.</p>\n<ul>\n<li>\n<h4>Advances in Quantum Computing</h4>\n</li>\n</ul>\n<p>The research in Quantum Computing has a very high momentum at the moment. Even though the whole architecture of Quantum computing is at a very basic stage, increased investments and research are helping the field to grow by inches every passing day. A quantum computer is said to perform calculations which will take general computers a few years, in just a few seconds! As remarkable as it sounds, it can bestow superpowers to mankind! Imagine munching on years and years of historical data to arrive at conclusions about the future in just a few seconds. A whole lot of astonishing things await us, and we must be blessed to be a part of this century.</p>\n<p>It is expected that India’s job openings in the analytics sector will double to about 200000 or two lakh jobs in 2020. Here is what 2020 for job seekers in data science will look like:</p>\n<ul>\n<li>Fields like finance, IT, professional services and insurance will see a boom in demand for data science and analytics.</li>\n<li>Having analytics skills like MapReduce, Apache Pig, Machine learning and Hadoop can provide an edge over other competitors in the field. The most fundamental in-demand skills will be Python and Machine Learning. Statistics is an added advantage.</li>\n<li>Vacancies for roles like data developers, data engineers and data scientists will go over 700,000 by 2020.</li>\n<li>The most promising sectors that will tend to create increasing opportunities include Aviation, Agriculture, Security, Healthcare and Automation.</li>\n<li>The average salaries in India in development roles like Data Scientist or Data Engineer will range from 5 to 8 Lakh per annum.</li>\n<li>The average salaries in India in management/strategizing roles like data architect or business intelligence manager will range from 10 to 20 Lakh per annum.</li>\n</ul>\n<p>As exciting as all of it sounds, there is always a bag of unforeseen advancements that are bound to take us all by surprise, as has always happened with Data Science and AI in the past. So, hold tight for yet another mind-boggling ride through the lanes of technology this 2020!</p>\n",
  "wfw:commentRss": "https://dimensionless.in/2020-trends-data-science/feed/",
  "slash:comments": 0
}