{
  "title": "EPISODE 15 Ted Roosevelt (Part 3): The Man In The Arena",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Sun, 18 Dec 2016 10:00:00 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2016/12/18/episode-15-ted-roosevelt-part-3-the-man-in-the-arena",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5853b1a5725e254f8b5d3cdf",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1481881488599-8J967Q5M1WTF379A6964/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"5853b78c15d5dbf946a54d39\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1481881488599-8J967Q5M1WTF379A6964/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“Ladies and gentlemen, I don't know whether you fully understand that I have just been shot, but it takes more than that to kill a Bull Moose</em>.<em>”&nbsp;</em><br><em>—&nbsp;</em>Theodore Roosevelt&nbsp;</p><p class=\"\">He was the first American to receive a brown belt in Judo.&nbsp;<br>He won the largest percentage of the vote ever by a third-party candidate.<br>He once took a bullet to the chest shot at point blank range, and rather than going to the hospital went to deliver a 90 minute speech.&nbsp;<br>He survived tragedies that would break lesser men.<br>He spent his life fighting against the inner demons trying to destroy him.&nbsp;<br>He was a perfect embodiment of what Nietzsche probably had in mind when he wrote,&nbsp;<em>“You must still have chaos in yourself to be able to give birth to a dancing star.\"</em>&nbsp;<br>He was a warmonger with a diplomatic tact. He was a hunter and an environmentalist. He was a nerd and an athlete. He flirted with white supremacist ideas and yet was very progressive about race by the standards of his day. He was a big proponent of personal responsibility and supported quasi-Socialist policies.</p><p class=\"\">Love him or hate him, he was larger than life.&nbsp;</p><p class=\"\">He was Theodore Roosevelt.</p><p class=\"\">In this episode:&nbsp;</p><ul data-rte-list=\"default\"><li><p class=\"\">“I am really sorry for Taft… I am sure he means well, but he means well feebly.”</p></li><li><p class=\"\">The end of a friendship</p></li><li><p class=\"\">“To destroy this invisible government, to dissolve the unholy alliance between corrupt business and corrupt politics is the first task of the statesmanship of the day.”</p></li><li><p class=\"\">“My hat is in the ring. The fight is on and I’m stripped to the buff.”</p></li><li><p class=\"\">“The Republican Party must stand for the rights of humanity, or else it must stand for special privilege.”</p></li><li><p class=\"\">TR’s relationship with Socialism</p></li><li><p class=\"\">A bullet in the chest</p></li><li><p class=\"\">Challenging the two party system</p></li><li><p class=\"\">The trip in the Amazon: “I had to go. It was my last chance to be a boy”</p></li><li><p class=\"\">“I need not grumble about fate; I had my day, and it was a good day.”</p></li><li><p class=\"\">Heartbreak in WW I</p></li><li><p class=\"\">Roosevelt and the limits of binary thinking</p></li><li><p class=\"\">“It is not the critic who counts; not the man who points out how the strong man stumbles, or where the doer of deeds could have done them better. The credit belongs to the man who is actually in the arena, whose face is marred by dust and sweat and blood; who strives valiantly; who errs, who comes short again and again, because there is no effort without error and shortcoming; but who does actually strive to do the deeds; who knows great enthusiasms, the great devotions; who spends himself in a worthy cause; who at the best knows in the end the triumph of high achievement, and who at the worst, if he fails, at least fails while daring greatly, so that his place shall never be with those cold and timid souls who neither know victory nor defeat.”</p></li></ul><p class=\"\">This episode is sponsored by <a href=\"http://audible.com/presidents\" target=\"_blank\">http://audible.com/presidents</a>. Thanks to Audible Channels for supporting our podcast. Check out their new original series “Presidents Are People Too!” at <a href=\"http://audible.com/presidents\" target=\"_blank\">http://audible.com/presidents</a></p><p class=\"\">Please, also show some love to my regular sponsors by shopping for supplements, special foods, clothing and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a>&nbsp;and receive a 10% discount.&nbsp;</p><p class=\"\">And if you are in the market for backpacks, computer bags and other hemp gear, check out my favorites at <a href=\"http://www.dsgear.com\">http://www.dsgear.com</a>&nbsp;and use the code “daniele” at checkout for a discount.&nbsp;</p><p class=\"\">My lady (and author of History on Fire logo) has a FB public page about her art & fighting:&nbsp;<a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>. Thank you to Onnit, Datsusara, Float Clinic, Shaman’s Simple Solutions, and Fight Chix for sponsoring her for her first MMA fight. If you’d like to check out Fight Chix merchandise, you can get a 20% discount by going to <a href=\"http://www.fightchix.com/\">http://www.fightchix.com/</a>&nbsp;and entering the code \"Fire20\" upon checkout.</p><p class=\"\">This is my public FB page:&nbsp;<a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”:&nbsp;<a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy:&nbsp;<a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "1:25:18",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 15,
  "itunes:title": "EPISODE 15 Ted Roosevelt (Part 3): The Man In The Arena",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 15 Ted Roosevelt (Part 3): The Man In The Arena"
  }
}