{
  "title": "On the genesis of spiral galaxies -- Classical and pseudo bulges as extremities of a continuous sequence. (arXiv:2210.10038v2 [astro-ph.GA] UPDATED)",
  "link": "http://arxiv.org/abs/2210.10038",
  "description": "<p>A tantalizing enigma in extragalactic astronomy concerns the chronology and\ndriving mechanisms of the build-up of late-type galaxies (LTGs). The standard\nscenario envisages two formation routes, with classical bulges (CBs) assembling\nfirst in a quick quasi-monolithic episode followed by gradual disk assembly,\nand pseudo-bulges (PBs) forming over the Gyr-long secular evolution of LTGs.\nThe expectation is, therefore, the segregation of present-day LTG bulges into\ntwo distinct groups. Here we analyse the star formation histories (SFHs) of\nbulges and disks for 135 LTGs from the CALIFA survey covering the relevant\nrange in LTG mass. In addition, their physical properties were contrasted with\npredictions from evolutionary synthesis models, adopting exponentially\ndeclining SFHs, with an e-folding time 0.1 &lt; $\\tau$ &lt; 20 Gyr. Analysis of the\nSFHs of ~ half-million spaxels consistently reveals that the main properties of\nbulges and disks show a continuous distribution across total stellar mass.\nMoreover, the $\\tau$ in high-mass LTGs radially increases, suggesting that\nthese grow in an inside-out fashion, while lower-mass LTGs display roughly the\nsame $\\tau$ throughout their entire radial extent. Evolutionary synthesis\npredictions are consistent with observations. Finally, bulges and disks of\nhigher mass LTGs exhibit shorter formation timescales as compared to their\nlower mass counterparts. Collectively, the obtained results evince a coherent\nand unified picture for the formation and evolution of LTGs, in which PBs and\nCBs denote extremities of a continuous sequence. This analysis is consistent\nwith the framework where bulges are assembled with their parent disks by\ngradual inside-out growth, at a pace that is regulated by the depth of the\ngalactic potential. In accordance is the utter absence of bimodal correlations,\nas expected if CBs and PBs were to emerge from two distinct formation routes.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Breda_I/0/1/0/all/0/1\">Iris Breda</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Papaderos_P/0/1/0/all/0/1\">Polychronis Papaderos</a>"
}