{
  "title": "Published in Nature Methods &#8211; Nucleus segmentation across imaging experiments: the 2018 Data Science Bowl",
  "link": "https://datasciencebowl.com/published-in-nature-methods-nucleus-segmentation-across-imaging-experiments-the-2018-data-science-bowl/",
  "dc:creator": "admin",
  "pubDate": "Wed, 20 Nov 2019 14:38:54 +0000",
  "category": "Data Science",
  "guid": "https://datasciencebowl.com/?p=5898",
  "description": "<p>The Broad Institute of MIT and Harvard has recently published its analysis of the 2018 Data Science Bowl in Nature Methods. (here) (PDF here). As stated by Dr. Anne Carpenter of the Broad Institute, “The top three solutions were very different from each other and offered unique insights to the problem, especially in pre/post processing [...]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://datasciencebowl.com/published-in-nature-methods-nucleus-segmentation-across-imaging-experiments-the-2018-data-science-bowl/\">Published in Nature Methods &#8211; Nucleus segmentation across imaging experiments: the 2018 Data Science Bowl</a> appeared first on <a rel=\"nofollow\" href=\"https://datasciencebowl.com\">The Data Science Bowl</a>.</p>\n",
  "content:encoded": "<p>The Broad Institute of MIT and Harvard has recently published its analysis of the 2018 Data Science Bowl in Nature Methods. (<a href=\"https://www.ncbi.nlm.nih.gov/pubmed/31636459\">here</a>) (<a href=\"https://personal.broadinstitute.org/anne/publications/127_Caicedo_NatMethods_2019.pdf\">PDF here</a>).</p>\n<p>As stated by Dr. Anne Carpenter of the Broad Institute, “The top three solutions were very different from each other and offered unique insights to the problem, especially in pre/post processing techniques. Overall, the Broad Institute conclude that the challenge was successful: top models can instantly segment an image from an unseen experiment with no parameter tweaking or fine tuning or image annotations to a level that exceeds an expert quickly tuning a classical image processing pipeline. There is even a user-friendly web interface for one of the models stemming from this competition (<a href=\"https://www.nucleaizer.org\">https://www.nucleaizer.org</a>) and already we are seeing many computer vision papers citing use of the annotated images from this competition, a tremendous resource for the community!”</p>\n<p>All authors are members of the Broad Institute lab with the exception of d CherKeng Heng, whom they invited to contribute based on his many helpful comments during the course of the 2018 competition.</p>\n<p>Overview: Segmenting the nuclei of cells in microscopy images is often the first step in the quantitative analysis of imaging data for biological and biomedical applications. Many bioimage analysis tools can segment nuclei in images but need to be selected and configured for every experiment. The 2018 Data Science Bowl attracted 3,891 teams worldwide to make the first attempt to build a segmentation method that could be applied to any two-dimensional light microscopy image of stained nuclei across experiments, with no human interaction. Top participants in the challenge succeeded in this task, developing deep-learning-based models that identified cell nuclei across many image types and experimental conditions without the need to manually adjust segmentation parameters. This represents an important step toward configuration-free bioimage analysis software tools. To continue reading, visit Nature Methods (<a href=\"https://www.ncbi.nlm.nih.gov/pubmed/31636459\">here</a>) (<a href=\"https://personal.broadinstitute.org/anne/publications/127_Caicedo_NatMethods_2019.pdf\">PDF here</a>).</p>\n<p>The post <a rel=\"nofollow\" href=\"https://datasciencebowl.com/published-in-nature-methods-nucleus-segmentation-across-imaging-experiments-the-2018-data-science-bowl/\">Published in Nature Methods &#8211; Nucleus segmentation across imaging experiments: the 2018 Data Science Bowl</a> appeared first on <a rel=\"nofollow\" href=\"https://datasciencebowl.com\">The Data Science Bowl</a>.</p>\n"
}