{
  "id": "tag:theatlantic.com,2022:50-671765",
  "content": "<p dir=\"ltr\"><em><small>Updated at 3:30 p.m. ET on October 17, 2022</small></em></p><p dir=\"ltr\">In the fall of 1988, <a href=\"https://parentsguidecordblood.org/en/news/interview-matt-farrow-recipient-worlds-1st-cord-blood-transplant\">Matthew Farrow</a>, a 5-year-old boy with a rare blood disorder, received the world’s first transplant of umbilical-cord blood from a newborn sibling. It worked: Farrow was cured. This miraculous outcome broke open a whole new field in medicine—and, not long after, a whole new industry aimed at getting expecting parents to bank their baby’s umbilical-cord blood, just in case.</p><p dir=\"ltr\">These days, in fact, being pregnant means being bombarded at the doctor’s office and on Instagram with ads touting cord blood as too precious to waste. For <a href=\"https://parentsguidecordblood.org/en/family-banking\">several hundred dollars upfront</a>, plus a storage fee of $100 to $200 every year, the banks’ ads proclaim, you could save your child’s life. Cord-blood banking has been likened to a <a href=\"https://parentsguidecordblood.org/en/news/cord-blood-insurance-peace-mind-families-need\">“biological insurance policy.”</a></p><p dir=\"ltr\">In the U.S., the <a href=\"https://parentsguidecordblood.org/en/news/worlds-top-10-cord-blood-banks-inventory-and-industry-consolidation\">two biggest private cord blood banks</a> are Cord Blood Registry and ViaCord. Together, they have collected more than 1 million units. But only a few hundred units of this privately banked cord blood have ever been used in transplants, the great <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3120215/\">majority by families</a> who chose to bank because they already had a child with a specific and rare disorder treatable with a transplant. For everyone else, the odds of using privately banked cord blood are minuscule—so minuscule that the <a href=\"https://publications.aap.org/pediatrics/article/140/5/e20172695/37866/Cord-Blood-Banking-for-Potential-Future?autologincheck=redirected?nfToken=00000000-0000-0000-0000-000000000000\">American Academy of Pediatrics (AAP) recommends</a> against private banking. It does make an exception for families with that disease history. “But that’s a rare circumstance,” says Steve Joffe, a pediatric oncologist and ethicist at the University of Pennsylvania, “and not one that anybody is going to build a successful business model around.”</p><p dir=\"ltr\">ViaCord and Cord Blood Registry do offer <a href=\"https://www.viacord.com/cord-banking/sibling-connection/\">free services</a> <a href=\"https://www.cordblood.com/family-programs\">for families</a> in which someone has already been diagnosed with a condition treatable with cord blood. In general, the companies reiterated to me, cord blood does save lives and they are simply providing an option for families who want it.</p><p dir=\"ltr\">But the marketing also gives the impression of much more expansive uses for cord blood. The private banks’ websites list nearly 80 diseases treatable with transplantation—an impressive number, though many are extremely uncommon or closely related to one another. (For example: refractory anemia, refractory anemia with ringed sideroblasts, refractory anemia with excess blasts, refractory anemia with excess blasts in transformation.) They have also recently taken to highlighting the promise of still-unproven treatments: Temporary infusions of cord blood, they say, could eventually treat more common conditions such as cerebral palsy and autism. <a href=\"https://www.youtube.com/watch?v=5i_fmK6GO0s&amp;t=7s\">Video testimonials feature</a> parents talking excitedly about the potential of cord blood for their children. But the evidence isn’t there yet—and may never appear. Nonetheless, says Paul Knoepfler, a stem-cell scientist at UC Davis, “the cord-blood companies seem to be trying to expand their base of potential customers.”</p><hr class=\"c-section-divider\"><p dir=\"ltr\">The initial exuberance around cord blood came from a real place. The blood left over in umbilical cords is replete with cells that have the special ability to turn into any kind of blood, including red blood cells, which carry oxygen, and white blood cells, which make up the immune system. Adults have stem cells in their bone marrow and blood—which can also be used for a transplant—but those in a baby’s umbilical cord are more immunologically naive. That means they are less likely to go awry and attack a recipient’s body. “They don’t cause as much havoc,” says Karen Ballen, an oncologist at the University of Virginia. This allows doctors to use cord blood that matches only four out of six <a href=\"https://parentsguidecordblood.org/en/faqs/what-is-hla-type-and-how-is-it-used\">immunological markers</a>.</p><p dir=\"ltr\">Because cord blood is so valuable, publicly run banks have been collecting donations since the 1990s. Despite amassing fewer units overall, public banks worldwide have provided <a href=\"https://pubmed.ncbi.nlm.nih.gov/26030051/\">30 times as many units of blood for treatment</a>—and saved more lives—than private ones, because they are accessible by any patient in need. Although the AAP recommends against private banking, it does recommend donating to public banks.</p><p dir=\"ltr\">One appeal of private banking, though, as the companies highlight, is that the cells in a baby’s umbilical cord are a perfect match for them in later childhood or adulthood. But this is usually irrelevant: In most of the diseases that can be cured by a cord-blood transplant, <a href=\"https://parentsguidecordblood.org/en/diseases\">doctors would, for medical reasons, not use the patient’s own cells</a>. In cases of inherited disorders such as sickle cell anemia, for example, a child’s own cord-blood stems have the same problematic mutation. For children with one of many types of leukemia, the concern is that cord blood could contain leukemia-precursor cells that cause the cancer to reappear; in addition, donor blood-stem cells are better because they can mop up remaining leukemia cells. Doctors would “never” use banked cord blood from a child with these types of leukemia, says Joanne Kurtzberg, a pediatrician and cord-blood pioneer at Duke University, who <a href=\"https://dukespace.lib.duke.edu/dspace/bitstream/handle/10161/24625/p333%20Kurtzberg.pdf?sequence=2\">helped treat Farrow</a> when he was a young boy.</p><p dir=\"ltr\">When privately banked cord blood is used in transplants, it is more likely to go to a sibling. Genetically, siblings have about a <a href=\"https://bethematch.org/transplant-basics/matching-patients-with-donors/how-donors-and-patients-are-matched/hla-basics/\">25 percent chance</a> of being perfect matches for each other. The chances of finding a suitable match among unrelated bone-marrow or cord-blood donors from a public bank, on the other hand, range from <a href=\"https://bethematch.org/transplant-basics/matching-patients-with-donors/how-does-a-patients-ethnic-background-affect-matching/\">29 to 79 percent</a>, depending on one’s ethnic background. (The majority of donors are white, so it’s highest for white patients.) In any case, not banking a matched sibling’s cord blood doesn’t foreclose the possibility of a transplant, because that sibling can still donate bone marrow. “I often encounter families who have some guilt around not storing the cord blood, and I will point out, ‘Well, your donor child that matches our patient is still here,’” says Ann Haight, a pediatric hematologist and oncologist at Emory University.</p><p dir=\"ltr\">Even if a baby’s cord blood is banked, there’s no guarantee that it will contain enough cells for a transplant. In fact, most may not: <a href=\"https://www.rand.org/pubs/research_briefs/RB9977.html\">Public banks only keep 5 to 40 percent of their donations</a>, as the rest don’t meet their standards. Private banks will save much smaller samples, which they argue serve a different purpose. Whereas public banks are looking for large samples that are mostly likely to be used for transplants, says Kate Girard, the director of medical and scientific affairs at ViaCord, “when families are banking with us, this is that child’s only cord, so our threshold is way lower.”</p><p dir=\"ltr\">Another reason to bank these smaller samples, a spokesperson for Cord Blood Registry pointed out, is that they can still be used for experimental infusions treating conditions such as cerebral palsy and autism. (About <a href=\"https://www.cordblood.com/science-in-action\">80 percent of units</a> released by CBR have been used this way, as have about <a href=\"https://www.viacord.com/Images/Consumer%20CB%20Use%20Summary%20-%20Over%20500-0920_tcm117-230237.pdf\">half from ViaCord.</a>) The private banks partner with researchers, such as Kurtzberg at Duke, who are running clinical trials to test these treatments. The theory goes that cells from cord blood can make it to the brain, where they might have <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6566649/\">some neuroprotective role—but </a>the mechanism remains unknown, and the effects are not entirely clear. As Kurtzberg told me, “The therapy is not proven.”</p><p dir=\"ltr\">The current state of cord-blood science might be summed up thus: Proven uses are very uncommon, and unproven uses are, well, unproven. Of course, a future discovery could lead to a real breakthrough in the use of stem cells from cord blood—an idea private banks trade on. Who knows what might be in store for cord blood later, when your baby is 30, 50, 70 years old? In a recent Cord Blood Registry survey of new parents, a spokesperson told me by email, 45 percent named “belief in future treatments” as the primary reason for banking their child’s cord blood and tissue. Knoepfler, the stem-cell scientist, notes that scientists have been excited for decades about the promise of stem cells. But translating interesting results in the lab to a doctor’s office, he says, “​​is really much harder than many of us realized. I include myself in that.”</p><p dir=\"ltr\">Medical discoveries have actually changed the ways cord blood is used over years, but they have so far resulted in less use of cord blood. In the past several years, doctors have refined a protocol to use <a href=\"https://bethematch.org/patients-and-families/about-transplant/what-is-a-bone-marrow-transplant/haploidentical-transplant/\">half-matched donors</a> in transplants. Doctors generally get more cells from these donors than from an infant’s banked cord blood, which means the transplants “take” more quickly and the patient spends less time in the hospital. For this reason, cord blood has been falling out of favor. Public banks have started scaling down their collections; the New York Blood Center, which had launched the world’s first public bank, <a href=\"https://parentsguidecordblood.org/en/banks/ny-blood-center-national-cord-blood-program#:~:text=For%20many%20years%20they%20could,the%20National%20Cord%20Blood%20Program.\">recently stopped collecting</a> new donations. How cord blood gets used in the future is still unknown.</p><hr class=\"c-section-divider\"><p>More than 30 years ago after Kurtzberg first treated Farrow, she is still in touch with him. He’s 39 now, and doing well. Having watched cord banking grow and evolve over the years, she remains a proponent of public banking and the possibilities ahead. When it comes to private banks, however, she says, “I don’t think it's a necessity. I think it’s nice to have if you can do it.” There isn’t much harm in private banking, after all, as long as parents can afford the several thousand dollars over their child’s lifetime.</p><p dir=\"ltr\"><em>Afford</em> might be the key word here. The ads for cord-blood banking feel a lot like those for any number of “nice to have” baby products aimed at anxious parents, be they organic diapers or BPA-free wooden toys tailored to your child’s age and cognitive development. If anything, the stakes of cord-blood banking are higher than anything else you might choose to buy. The opportunity only comes around “<a href=\"https://www.facebook.com/CordBloodRegistry/videos/10152696402232332/\">once in a lifetime,</a>” and it could literally save your child’s life—even if the chances of that are very, very small. “It’s playing to parental guilt and the desire for parents to have healthy children and do whatever they can for their kids,” says Timothy Caulfield, a health-law professor at the University of Alberta who has studied cord-blood banks. “There’s a huge market based on exactly that.”</p><p dir=\"ltr\">It’s telling, perhaps, that Cord Blood Registry ran a giveaway of $20,000 worth of baby products this summer. The curated package of luxury “baby essentials” resembled the registry of parents who want the best for their kid, and can afford it. Included were a Snoo smart bassinet (<a href=\"https://www.happiestbaby.com/products/snoo-smart-bassinet\">$1,695</a>), an Uppababy stroller and car seat (<a href=\"https://www.amazon.com/UPPAbaby-Vista-V2-Stroller-Chestnut/dp/B084K4C3K1/\">$1,400</a>), Coterie diapers (<a href=\"https://www.coterie.com/products/diapers\">$100</a> for a month’s supply, guaranteed to be “free of fragrance, lotion, latex, rubber, dyes, alcohol, heavy metals, parabens, phthalates, chlorine bleaching, VOCs, and optical brighteners”), and, of course, a lifetime of cord-blood and tissue banking ($11,860).</p><hr><p><small><em>This article originally misspelled Kate Girard's last name.</em></small></p>",
  "author": {
    "name": "Sarah Zhang",
    "uri": "http://www.theatlantic.com/author/sarah-zhang/?utm_source=feed"
  },
  "media:content": {
    "media:credit": "The Atlantic"
  },
  "title": "Don’t Pay for Cord-Blood Banking",
  "published": "2022-10-17T13:12:02-04:00",
  "updated": "2022-10-17T17:44:27-04:00",
  "summary": "Umbilical blood can be a valuable treatment for rare diseases. But that doesn’t mean you need to pay thousands of dollars to bank your baby’s.",
  "link": ""
}