{
  "title": "The Superconducting Shields Behind MRIs’ Triumph",
  "link": "https://spectrum.ieee.org/the-superconducting-shields-behind-mris",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/looking-through-the-opening-of-an-mri-machine.jpg?id=31214851&width=1200&height=800&coordinates=260%2C0%2C261%2C0\"/><br/><br/><p>Magnetic resonance imaging (MRI) is a common strategy physicians use to diagnose diseases such as cancer. The patient is placed on a table that slides into the bore of a scanner, which contains a strong magnet and various coils. The machine uses the resulting magnetic field and radio waves to create images of the patient’s insides.</p><p>Full-body MRI scanners were first used clinically in hospitals in the early 1980s, but they were bulky and expensive. Because the magnetic field produced by the machines sometimes strayed outside the room where the MRI scanner was located, safety measures had to be implemented. The stray field was dangerous as it could affect pacemakers and other metal medical devices. </p><hr/><p>To confine the magnetic field to the room, <a href=\"https://prizmedimaging.com/pages/mri-shielding-and-rf-shield-enclosure-design-considerations\" rel=\"noopener noreferrer\" target=\"_blank\">iron sheets</a> were placed on the walls, ceiling, and floors. The strategy, known as <em>passive shielding</em>, increased construction costs and the time it took to install a scanner, however. The method also restricted where the machines could be built and used.</p><p>The addition of secondary actively shielded superconducting magnets in MRI systems in 1986 eliminated the need for iron sheets. The enhancement, unveiled by a team of scientists at Oxford Instruments (now part of <a href=\"https://www.siemens-healthineers.com/en-uk/magnetic-resonance-imaging/siemens-magnet-technology\" rel=\"noopener noreferrer\" target=\"_blank\">Siemens</a>), in Oxfordshire, England, lowered installation costs and shortened construction times.</p><p>The IEEE commemorated the magnets as an IEEE Milestone during a ceremony on 17 June at the Siemens Oxfordshire facility.</p><p>“The magnets made MRI widely available,” says <a href=\"https://www.westminster.ac.uk/about-us/our-people/directory/kale-izzet\" rel=\"noopener noreferrer\" target=\"_blank\">Izzet Kale</a>. The IEEE member is chair of the <a href=\"https://www.ieee-ukandireland.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE U.K. and Ireland Section</a>, which sponsored the Milestone nomination.</p><h2>Magnetic fields and radio waves</h2><p>Images produced by MRI scanners aren’t really images in the usual sense. They are constructed by a computer using magnetic fields and radio waves.</p><p>Nearly 70 percent of the human body consists of water, and each water molecule has two hydrogen protons. The protons’ magnetic moments (the measure of its tendency to align with a magnetic field) are usually oriented in various directions, but when they are subjected to a strong magnetic field, the protons become polarized and <a href=\"https://global.canon/en/technology/support28.html\" rel=\"noopener noreferrer\" target=\"_blank\">point in the same direction</a>, according to an <a href=\"https://global.canon/en/technology/support28.html\" rel=\"noopener noreferrer\" target=\"_blank\">article about MRI</a> on <a href=\"https://us.medical.canon/about/\" rel=\"noopener noreferrer\" target=\"_blank\">Canon Medical</a>. The application of radio waves at the right frequency makes the protons’ orientation oscillate. When the radio waves are turned off, the protons revert to their prior state and emit a signal (also a radio wave). The interaction is magnetic resonance.</p><p>The strength of the magnetic field produced by an MRI machine can be altered using three sets of gradient electric coils that are made of copper or aluminum, as explained in an <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1121941/\" rel=\"noopener noreferrer\" target=\"_blank\">article</a> published by the U.S. <a href=\"https://www.ncbi.nlm.nih.gov/\" rel=\"noopener noreferrer\" target=\"_blank\">National Library of Medicine</a>. <a href=\"https://mriquestions.com/how-to-reduce-fringe.html\" rel=\"noopener noreferrer\" target=\"_blank\">Gradient electric coils</a> are loops of wire or thin conductive sheets that are located on the innermost part of the scanner’s tube. When current passes through the coils, a secondary magnetic field, or gradient field, is created. The gradient field slightly distorts the main magnetic field and modifies its strength.</p><p>Protons in different areas of the patient’s body will resonate at different frequencies depending on how strong the magnetic field is. Receiver coils in the scanner tube improve the detection of the emitted signal.</p><p>MRI scanners use those signals to produce images, showing differences in the way protons react.</p><h2>Making MRI a staple of medical diagnostics</h2><p>When MRI scanners were introduced in hospitals, up to 40 tonnes of iron were required to prevent the external magnetic field from straying beyond the room, according to the <a href=\"https://ieeemilestones.ethw.org/w/images/2/21/US4587504.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">actively shielded superconducting magnets’ patent</a>. But the extra safety measures made installing a scanner more expensive and difficult because the machine often had to be built in a freestanding building or in the hospital’s basement.</p><p>To help lower the cost and make it easier to install scanners, four Oxford Instruments scientists—John Bird, Frank Davis, IEEE Member <a href=\"https://indico.cern.ch/event/445667/contributions/2654717/attachments/1516432/2366717/Or20-01_DGH_MT25_Memorial_final_.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">David Hawksworth</a>, and John Woodgate—in 1986 enhanced the scanner with a second set of actively shielded superconducting magnets. Bird was the project’s lead engineer, Davis was the company’s technical director, Hawksworth was its engineering director, and Woodgate was the managing director.</p><p class=\"pull-quote\">“Actively shielded superconducting magnets made MRI widely available.”</p><p>They created secondary electromagnets that, like the primary ones, operate in a superconducting state: they have no resistance to the flow of an electrical current and can carry large currents without overheating. The electromagnets were forced into a superconducting state by being continually bathed in liquid helium at minus 269.1 °C, according to an <a href=\"https://ieeemilestones.ethw.org/Milestone-Proposal:Active_shielding_of_superconducting_magnets\" rel=\"noopener noreferrer\" target=\"_blank\">entry about the Milestone</a> on the <a href=\"https://ethw.org/Main_Page\" rel=\"noopener noreferrer\" target=\"_blank\">Engineering and Technology History Wiki</a>.</p><p>The magnets are made of two coils of wire, either of niobium and titanium or niobium and tin. The coils are embedded in copper.</p><p>An electrical current is passed through the coils, each producing its own magnetic field. The coils are oriented so that the magnetic fields they produce oppose each other, according to the technology’s patent.</p><p>If, for example, the first coil produces a magnetic field of 2 Teslas and the second coil generates a field that’s 0.5 T, it reduces the strength of the overall magnetic field to 1.5 T. The Tesla is the unit of measurement of a magnetic field’s magnitude.</p><p>Although the strength of the scanner’s magnetic field is reduced by the active shielding, it keeps the stray magnetic field inside the room, the developers noted in their patent application.</p><p>Thanks to actively shielded superconducting magnets, MRI is now a fundamental diagnostic tool “on which modern medicine depends,” Kale says. “Active shielding was a key enabler to MRI becoming so widespread and important.”</p><p>Administered by the <a href=\"http://www.ieee.org/about/history_center/index.html\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE History Center</a> and <a href=\"https://www.ieeefoundation.org/donate_history\" rel=\"noopener noreferrer\" target=\"_blank\">supported by donors</a>, the Milestone program recognizes outstanding technical developments around the world. The magnets’ Milestone plaque, which is to be displayed inside the Siemens Magnet Technology building in the Eynsham section of Oxfordshire reads:</p><p><em>“At this site, the first actively shielded superconducting magnets for diagnostic magnetic resonance imaging (MRI) use were conceived, designed, and produced. Active shielding reduced the size, weight, and installed cost of MRI systems, allowing them to be more easily transported and advantageously located, thereby benefiting advanced medical diagnosis worldwide.”</em></p>",
  "pubDate": "Thu, 25 Aug 2022 18:00:00 +0000",
  "guid": "https://spectrum.ieee.org/the-superconducting-shields-behind-mris",
  "category": [
    "Ieee history",
    "Ieee news",
    "Ieee milestone",
    "Biomedical engineering",
    "Mri",
    "Type:ti"
  ],
  "dc:creator": "Joanna Goodrich",
  "media:content": ""
}