{
  "title": "Evaluating chemically homogeneous evolution in stellar binaries: Electromagnetic implications -- Ionizing photons, SLSN-I, GRB, Ic-BL. (arXiv:2208.03999v2 [astro-ph.SR] UPDATED)",
  "link": "http://arxiv.org/abs/2208.03999",
  "description": "<p>We investigate the occurrence of rapid-rotation induced chemically\nhomogeneous evolution (CHE) due to strong tides and mass accretion in binaries.\nTo this end, we generalize the relation in Packet (1981) to calculate the\nminimum angular momentum (AM) accretion required by a secondary star to\nexperience accretion-induced CHE. Contrary to traditionally assumed 5-10\npercent accretion of initial mass ($Z \\lesssim 0.004$, $M \\gtrsim$ 20\nM$_{\\odot}$) for spinning up the accretor (resulting in CHE) this value can\ndrop to $\\sim$ 2 percent for efficient AM accretion while for certain systems\nit could be substantially larger. We conduct a population study using\n\\textsc{bpass} by evolving stars under the influence of strong tides in\nshort-period binaries and also account for the updated effect of\naccretion-induced spin-up. We find accretion CHE (compared to tidal CHE) to be\nthe dominant means of producing homogeneous stars even at 10 percent AM\naccretion efficiency during mass transfer. Unlike tidal CHE, it is seen that CH\nstars arising due to accretion can retain a larger fraction of their AM till\ncore collapse. Thus we show that accretion CHE could be an important formation\nchannel for energetic electromagnetic transients like GRBs, Ic-BL (SLSN-I,\nIc-BL) under the collapsar (magnetar) formalism and a single CH star could lead\nto both the transients under their respective formation scenario. Lastly, we\nshow that under the current treatment of CHE, the emission rate of ionizing\nphotons by such stars decreases more rapidly at higher metallicities than\npreviously predicted.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Ghodla_S/0/1/0/all/0/1\">Sohan Ghodla</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Eldridge_J/0/1/0/all/0/1\">J. J. Eldridge</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Stanway_E/0/1/0/all/0/1\">Elizabeth R. Stanway</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Stevance_H/0/1/0/all/0/1\">H&#xe9;lo&#xef;se F. Stevance</a>"
}