{
  "guid": "urn:uuid:32caa6a6-2838-49aa-8c6e-66bee7e0431b",
  "link": "https://www.who.int/news/item/23-03-2022-learning-from-women-s-experiences-during-childbirth-to-improve-quality-of-care",
  "a10:author": {
    "a10:name": ""
  },
  "title": "Learning from women’s experiences during childbirth to improve quality of care",
  "description": "More and more evidence shows that women across the world face unacceptable mistreatment during childbirth. Women everywhere face violations of their rights – including rights to privacy, informed consent, and the right have a trusted companion of choice throughout childbirth.  \nMistreatment can seriously erode trust in the health facility, which can mean that women are less likely to access facility-based care before, during and after birth.",
  "pubDate": "Tue, 22 Mar 2022 16:36:11 Z",
  "a10:content": "<a href=\"https://www.who.int/teams/sexual-and-reproductive-health-and-research-(srh)/human-reproduction-programme\"><img src=\"https://www.who.int/images/default-source/departments/reproductive-health/logos/hrp-logo.jpg?Status=Master&amp;sfvrsn=f5dfc11f_6\" style=\"float:right;margin:0px 0px 15px 15px;\" class=\"-align-right\" alt=\"Logo of the HRP special programme\" sf-size=\"20697\" /></a>\n<p>A <a href=\"https://gh.bmj.com/content/5/Suppl_2\" target=\"_blank\">special supplement from WHO and HRP</a>, newly published in <em>BMJ Global Health</em>, spotlights how women and their newborn babies are treated during childbirth\n    and offers a path to improved facility-based care.</p><p>More and more evidence shows that women across the world face unacceptable mistreatment during childbirth. Women everywhere face violations of their rights &ndash; including rights to privacy, informed consent, and the right have a trusted companion of\n    choice throughout childbirth.&nbsp;&nbsp;</p><p><strong>Mistreatment can seriously erode trust in the health facility</strong>, which can mean that women are less likely to access facility-based care before, during and after birth. This can have grave consequences for the health and well-being of women\n    and their babies and can even put their lives at risk.</p><p>As &Ouml;zge Tun&ccedil;alp, Medical Officer at WHO and the Human Reproductive Program (HRP) explains, &ldquo;<strong>Improving the experience of women throughout labour and childbirth is essential to help increase women&rsquo;s trust in facility-based care &ndash;\n    as well as ensuring access to quality postnatal care following birth</strong>.&rdquo;<br /></p><p>More research &ndash; and research capacity &ndash; is urgently needed to better understand and improve women&rsquo;s experiences of mistreatment during childbirth but also across the continuum maternity care. This includes research on novel methods of\n    collecting data, understanding how experiences vary depending on context and how these experiences impact overall outcomes.</p><h2>About the new supplement</h2><p>In recognition of this gap, <a href=\"https://gh.bmj.com/content/5/Suppl_2\" target=\"_blank\">the new supplement</a> presents evidence from a WHO multi-country study on the positive impact of labour companions, the need for increased\n    privacy measures and improved ways to measure the experiences and satisfaction women have when giving birth at any given health care facility.</p><p>Within the collection, <a href=\"https://gh.bmj.com/content/5/Suppl_2/e003564\" target=\"_blank\">the analysis on labour companionship</a> showed women without a companion were more likely to report physical abuse, non-consented medical\n    procedures and poor communication compared with women with a labour companion. In contrast, when women had a companion of choice, they experienced lower levels of some forms of mistreatment - although this was dependent on the setting.</p><p>Three of the papers show the importance of understanding the experiences of women to improve care during childbirth through better research and treatment. Measuring both experiences and satisfaction gives insight into what can be improved to <a href=\"https://gh.bmj.com/content/5/Suppl_2/e003688\" target=\"_blank\">increase satisfaction</a>.&nbsp;An increased accountability for mistreatment in childbirth will improve experiences.<br /></p><p>The paper on<a href=\"https://gh.bmj.com/content/5/Suppl_2/e006640\" target=\"_blank\"> vaginal examination</a> and mistreatment during childbirth based on labor observations showed the crucial importance of good communication and\n    clear consent processes during childbirth. Additionally, the research offered up a practical way to reduce women&rsquo;s exposure and increase privacy such as curtains. <br /></p><p>When <a href=\"https://gh.bmj.com/content/5/Suppl_2/e004822\" target=\"_blank\">considering adolescents</a>, mistreatment contributes to dissatisfaction and misses the opportunity for engagement and education with this demographic.&nbsp;<br /></p><p>The final two papers show that the development of concise, valid and reliable measures for mistreatment applicable across settings would offer facilities the opportunity to instigate initiatives to make quality improvements for lasting change. <a href=\"https://gh.bmj.com/content/5/Suppl_2/e004080\"></a>&nbsp;\n <a href=\"https://gh.bmj.com/content/5/Suppl_2/e004822\"></a><br /></p><p><em>The <a href=\"https://gh.bmj.com/content/5/Suppl_2\" target=\"_blank\">WHO and HRP special supplement on understanding mistreatment of women during childbirth to improve quality of care</a> </em>&nbsp;identifies risk factors and\n    aims to take a step closer toward positive pregnancy, childbirth and postnatal experiences for all. <br /></p><p>&ldquo;<strong>When women and their babies receive respectful, quality, person-centred care, they are more likely to access contacts with health workers and they are more likely to access potentially life-saving care at a health-facility</strong>,&rdquo;\n comments Dr &Ouml;zge Tun&ccedil;alp, &ldquo;<strong>Now that we have this evidence we will be able to take more steps towards reducing mistreatment worldwide</strong>.&rdquo;</p><h3>&nbsp;</h3>"
}