{
  "guid": "85f101f9-b178-46f2-bb6b-b6944bc3cc02",
  "title": "The Circus Comes to Town",
  "description": "<p>Parents in Southlake discover a new label for what's been bothering them about all this diversity, equity and inclusion talk: critical race theory. A new fixation on the academic concept muddies the debate, drowning out the voices of students who’d come forward with stories about racism. Kimberlé Crenshaw, one of the founding scholars of CRT, sheds light on the national battle over the theory, warning of dire consequences. And Tucker Carlson, Dana Loesch, and even Demi Lovato all put a spotlight on Southlake, where the local fight has grown even more divisive — and more personal.</p>\n",
  "pubDate": "Mon, 13 Sep 2021 08:00:00 +0000",
  "author": "news.podcasts@nbcuni.com (Antonia Hylton, Kimberlé Crenshaw, Mike Hixenbaugh)",
  "link": "https://www.nbcnews.com/southlake-podcast",
  "content:encoded": "<p>Parents in Southlake discover a new label for what's been bothering them about all this diversity, equity and inclusion talk: critical race theory. A new fixation on the academic concept muddies the debate, drowning out the voices of students who’d come forward with stories about racism. Kimberlé Crenshaw, one of the founding scholars of CRT, sheds light on the national battle over the theory, warning of dire consequences. And Tucker Carlson, Dana Loesch, and even Demi Lovato all put a spotlight on Southlake, where the local fight has grown even more divisive — and more personal.</p>\n",
  "enclosure": "",
  "itunes:title": "The Circus Comes to Town",
  "itunes:author": "Antonia Hylton, Kimberlé Crenshaw, Mike Hixenbaugh",
  "itunes:duration": "00:38:41",
  "itunes:summary": "A new fixation on critical race theory muddies the debate in Southlake, drowning out the voices of students who’d come forward with stories about racism.",
  "itunes:subtitle": "A new fixation on critical race theory muddies the debate in Southlake, drowning out the voices of students who’d come forward with stories about racism.",
  "itunes:keywords": "education, high school, carroll, racist, council, southlake, blm, demi lovato, diversity training, football, racism, left-wing ideology, administrator, crt, public school, gop, student, restraining order, antiracist, think tank, diversity and inclusion training, nbc, criminal charges, fort worth, segregation, school district, allen west, kimberlé crenshaw, south lake, nbc news, conservative, political action committee, critical race theory, pac, mayor, texas, fox news, warning, dallas, convicted, school board, indicted, reverse racism, christopher rufo, inclusion, suburb, cisd, classroom, culture war, teacher, cancel culture, carroll high school, white supremacy, dana loesch, tucker carlson, politics, learning, high school football, superintendent, kimberle crenshaw, charges, dei, anti-racist, race, black lives matter, donald trump",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:episode": 4,
  "itunes:season": 1
}