{
  "title": "Twenty Years Later: The Surprising Greater Implications of A New Kind of Science",
  "link": "https://writings.stephenwolfram.com/2022/05/twenty-years-later-the-surprising-greater-implications-of-a-new-kind-of-science/",
  "comments": "https://writings.stephenwolfram.com/2022/05/twenty-years-later-the-surprising-greater-implications-of-a-new-kind-of-science/#comments",
  "pubDate": "Mon, 16 May 2022 18:47:47 +0000",
  "dc:creator": "Stephen Wolfram",
  "category": [
    "Big Picture",
    "New Kind of Science"
  ],
  "guid": "https://writings.stephenwolfram.com/?p=36963",
  "description": "<span class=\"thumbnail\"><img width=\"128\" height=\"108\" src=\"https://content.wolfram.com/uploads/sites/43/2022/05/icon-nks-20th.png\" class=\"attachment-thumbnail size-thumbnail wp-post-image\" alt=\"\" /></span>See also: “A New Kind of Science: A 15-Year View”. From the Foundations Laid by A New Kind of Science When A New Kind of Science was published twenty years ago I thought what it had to say was important. But what&#8217;s become increasingly clear—particularly in the last few years—is that it&#8217;s actually even much [&#8230;]",
  "content:encoded": "<span class=\"thumbnail\"><img width=\"128\" height=\"108\" src=\"https://content.wolfram.com/uploads/sites/43/2022/05/icon-nks-20th.png\" class=\"attachment-thumbnail size-thumbnail wp-post-image\" alt=\"\" /></span><p><!--margin img--></p>\n<style>\nh2.bookpost{display:block;}\nimg.bookpost{padding-top:20px}\n</style>\n<div class=\"purplestripe\" style=\"background-color: #eee;max-width: 660px;\">\nSee also: “<a href=\"https://writings.stephenwolfram.com/2017/05/a-new-kind-of-science-a-15-year-view/\" style=\"color: #19749a;\"><b><i>A New Kind of Science</i>: A 15-Year View</b></a>”.\n</div>\n<p><img class=\"aligncenter box-shadow\" title=\"Twenty Years Later: The Surprising Greater Implications of A New Kind of Science\" src=\"https://content.wolfram.com/uploads/sites/43/2022/05/nks20-hero2.png\" alt=\"Twenty Years Later: The Surprising Greater Implications of A New Kind of Science\" width=\"660\" height=\"305\" /></p>\n<h2 id='from-the-foundations-laid-by-a-new-kind-of-science'>From the Foundations Laid by A New Kind of Science</h2>\n<p>When <em><a href='https://www.wolframscience.com/nks/'>A New Kind of Science</a></em> was published twenty years ago I thought what it had to say was important. But what&#8217;s become increasingly clear—particularly in the last few years—is that it&#8217;s actually even much more important than I ever imagined. My <a href='https://www.wolframscience.com/nks/p1--an-outline-of-basic-ideas/'>original goal</a> in <em>A New Kind of Science</em> was to take a step beyond the mathematical paradigm that had defined the state of the art in science for three centuries—and to introduce a new paradigm based on computation and on the exploration of the <a href='https://www.wolframscience.com/nks/chap-3--the-world-of-simple-programs/'>computational universe of possible programs</a>. And already in <em>A New Kind of Science</em> one can see that there&#8217;s immense richness to what can be done with this new paradigm. <span id=\"more-36963\"></span></p>\n<p>There’s a new abstract basic science—that I <a href='https://writings.stephenwolfram.com/2021/09/charting-a-course-for-complexity-metamodeling-ruliology-and-more/'>now call ruliology</a>—that’s concerned with studying the detailed properties of systems with simple rules. There’s a vast new source of “raw material” to “mine” from the computational universe, both for making models of things and for developing technology. And there are new, computational ways to think about fundamental features of how systems in nature and elsewhere work.</p>\n<p>But what’s now becoming clear is that there’s actually something still bigger, still more overarching that the paradigm of <em>A New Kind of Science</em> lays the foundations for. In a sense, <em>A New Kind of Science</em> defines how one can use computation to think about things. But what we’re now realizing is that actually computation is not just a way to think about things: it is at a very fundamental level what everything actually is. </p>\n<p>One can see this as a kind of ultimate limit of <em>A New Kind of Science</em>. What we call <a href='https://writings.stephenwolfram.com/2021/11/the-concept-of-the-ruliad/'>the ruliad</a> is the entangled limit of all possible computations. And what we, for example, experience as physical reality is in effect just our particular sampling of the ruliad. And it’s the ideas of <em>A New Kind of Science—</em>and particularly things like the <a href='https://www.wolframscience.com/nks/chap-12--the-principle-of-computational-equivalence/'>Principle of Computational Equivalence</a>—that lay the foundations for understanding how this works.</p>\n<p>When I wrote <em>A New Kind of Science</em> I <a href='https://www.wolframscience.com/nks/chap-9--fundamental-physics/'>discussed the possibility</a> that there might be a way to find a fundamental model of physics based on simple programs. And from that seed has now come the <a href='https://www.wolframphysics.org/' target=_blank rel=noopener>Wolfram Physics Project</a>, which, with its broad connections to existing mathematical physics, now seems to show that, yes, it&#8217;s really true that our physical universe is “<a href='https://writings.stephenwolfram.com/2020/04/finally-we-may-have-a-path-to-the-fundamental-theory-of-physics-and-its-beautiful/'>computational all the way down</a>”. </p>\n<p>But there&#8217;s more. It&#8217;s not just that at the lowest level there&#8217;s some specific rule operating on a vast network of atoms of space. It&#8217;s that underneath everything is all possible computation, encapsulated in the single unique construct that is <a href='https://writings.stephenwolfram.com/2021/11/the-concept-of-the-ruliad/'>the ruliad</a>. And what determines our experience—and the science we use to summarize it—is what characteristics we as observers have in sampling the ruliad. </p>\n<p>There is a tower of ideas that relate to fundamental questions about the nature of existence, and the foundations not only of physics, but also of <a href='https://writings.stephenwolfram.com/2022/03/the-physicalization-of-metamathematics-and-its-implications-for-the-foundations-of-mathematics/'>mathematics</a>, <a href='https://www.wolframphysics.org/bulletins/2020/06/exploring-rulial-space-the-case-of-turing-machines/' target=_blank rel=noopener>computer science</a> and a host of other fields. And these ideas build crucially on the paradigm of <em>A New Kind of Science</em>. But they need something else as well: what I now call the <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/'>multicomputational paradigm</a>. There were hints of it in <em>A New Kind of Science</em> when I <a href='https://www.wolframscience.com/nks/chap-5--two-dimensions-and-beyond#sect-5-6--multiway-systems'>discussed multiway systems</a>. But it has only been within the past couple of years that this whole new paradigm has begun to come into focus. In <em>A New Kind of Science</em> I explored some of the remarkable things that individual computations out in the computational universe can do. What the multicomputational paradigm now does is to consider the aggregate of multiple computations—and in the end the entangled limit of all possible computations, the ruliad.</p>\n<p>The Principle of Computational Equivalence is in many ways the intellectual culmination of <em>A New Kind of Science</em>—and it has many deep consequences. And one of them is the idea—and uniqueness—of the ruliad. The Principle of Computational Equivalence provides a very general statement about what all possible computational systems do. What the ruliad then does is to pull together the behaviors and relationships of all these systems into a single object that is, in effect, an ultimate representation of everything computational, and indeed in a certain sense simply of everything. </p>\n<h2 id='the-intellectual-journey:-from-physics-to-physics,-and-beyond'>The Intellectual Journey: From Physics to Physics, and Beyond</h2>\n<p>The <a href='https://writings.stephenwolfram.com/2022/05/the-making-of-a-new-kind-of-science/'>publication of <em>A New Kind of Science</em> 20 years ago</a> was for me already the culmination of an <a href='https://www.stephenwolfram.com/scrapbook/'>intellectual journey</a> that had begun more than 25 years earlier. I had started in theoretical physics as a teenager in the 1970s. And stimulated by my needs in physics, I had then <a href='https://writings.stephenwolfram.com/2013/06/there-was-a-time-before-mathematica/'>built my first computational language</a>. A couple of years later I returned to basic science, now interested in some very fundamental questions. And from my blend of experience in physics and computing I was led to start trying to formulate things in terms of computation, and computational experiments. And soon <a href='https://www.wolframscience.com/nks/chap-2--the-crucial-experiment/'>discovered the remarkable fact</a> that in the computational universe, even very simple programs can generate immensely complex behavior.</p>\n<p>For several years I <a href='https://www.stephenwolfram.com/publications/academic/cellular-automata'>studied the basic science</a> of the particular class of simple programs known as <a href='https://www.wolframscience.com/nks/chap-2--the-crucial-experiment#sect-2-1--how-do-simple-programs-behave'>cellular automata</a>—and the things I saw led me to identify some important general phenomena, most notably <a href='https://www.wolframscience.com/nks/chap-12--the-principle-of-computational-equivalence#sect-12-6--computational-irreducibility'>computational irreducibility</a>. Then in 1986—having “answered most of the obvious questions I could see”—I left basic science again, and for five years concentrated on <a href='https://www.wolfram.com/mathematica/scrapbook/'>creating Mathematica</a> and what’s now the <a href='https://www.wolfram.com/language/'>Wolfram Language</a>. But in 1991 I took the tools I’d built, and <a href='https://writings.stephenwolfram.com/2022/05/the-making-of-a-new-kind-of-science/'>again immersed myself in basic science</a>. The decade that followed brought a long string of exciting and unexpected discoveries about the computational universe and its implications—leading finally in 2002 to the publication of <em>A New Kind of Science</em>.</p>\n<p>In many ways, <em>A New Kind of Science</em> is a very complete book—that in <a href='https://www.wolframscience.com/nks/colophon/'>its 1280 pages</a> does well at “answering all the obvious questions”, save, notably, for some about the “application area” of fundamental physics. For a couple of years after the book was published, <a href='https://writings.stephenwolfram.com/2020/04/how-we-got-here-the-backstory-of-the-wolfram-physics-project/#please-dont-do-that-project'>I continued to explore some of these remaining questions</a>. But pretty soon I was swept up in the building of <a href='https://www.wolframalpha.com/'>Wolfram|Alpha</a> and then the Wolfram Language, and in all the complicated and often deep questions involved in for the first time creating a <a href='https://writings.stephenwolfram.com/2019/05/what-weve-built-is-a-computational-language-and-thats-very-important/'>full-scale computational language</a>. And so for nearly 17 years I did almost no basic science. </p>\n<p>The ideas of <em>A New Kind of Science</em> nevertheless continued to exert a deep influence—and I came to see my decades of work on computational language as ultimately being about <a href='https://writings.stephenwolfram.com/2015/11/how-should-we-talk-to-ais/'>creating a bridge</a> between the vast capabilities of the computational universe revealed by <em>A New Kind of Science</em>, and the specific kinds of ways we humans are able to think about things. This point of view led me to all kinds of <a href='https://writings.stephenwolfram.com/2016/10/computational-law-symbolic-discourse-and-the-ai-constitution/'>important conclusions</a> about the role of computation and its implications for the future. But through all this I kept on thinking that one day I should look at physics again. And finally in 2019, stimulated by a small technical breakthrough, as well as enthusiasm from physicists of a new generation, <a href='https://writings.stephenwolfram.com/2020/04/how-we-got-here-the-backstory-of-the-wolfram-physics-project/'>I decided it was time to try diving into physics again</a>.</p>\n<p>My <a href='https://reference.wolfram.com/language/'>practical tools</a> had developed a lot since I’d worked on <em>A New Kind of Science</em>. And—as I have found so often—the passage of years had given me greater clarity and perspective about what I’d discovered in <em>A New Kind of Science</em>. And it turned out we were rather quickly able to make spectacular progress. <em>A New Kind of Science</em> had <a href='https://www.wolframscience.com/nks/chap-9--fundamental-physics/'>introduced definite ideas about how fundamental physics might work</a>. Now we could see that these ideas were very much on the right track, but on their own they did not go far enough. Something else was needed. </p>\n<p>In <em>A New Kind of Science</em> I’d introduced what I called <a href='https://www.wolframscience.com/nks/chap-5--two-dimensions-and-beyond#sect-5-6--multiway-systems'>multiway systems</a>, but I’d treated them as a kind of <a href='https://www.wolframscience.com/nks/chap-9--fundamental-physics#sect-9-11--uniqueness-and-branching-in-time'>sideshow</a>. Now—particularly <a href='https://writings.stephenwolfram.com/2020/04/finally-we-may-have-a-path-to-the-fundamental-theory-of-physics-and-its-beautiful/#the-inevitability-of-quantum-mechanics'>tipped off by quantum mechanics</a>—we realized that multiway systems were not a sideshow but were actually in a sense the main event. They had come out of the computational paradigm of <em>A New Kind of Science</em>, but they were really harbingers of a new paradigm: the <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/'>multicomputational paradigm</a>.</p>\n<p>In <em>A New Kind of Science</em>, I’d already talked about space—and everything else in the universe—ultimately being <a href='https://www.wolframscience.com/nks/chap-9--fundamental-physics#sect-9-7--space-as-a-network'>made up of a network of discrete elements</a> that I’d now call “atoms of space”. And I’d talked about time being associated with the inexorable progressive application of computationally irreducible rules. But now we were thinking not just of a single thread of computation, but instead of a whole multiway system of branching and merging threads—representing in effect a multicomputational history for the universe. </p>\n<p>In <em>A New Kind of Science</em> I’d devoted a whole chapter to “<a href='https://www.wolframscience.com/nks/chap-10--processes-of-perception-and-analysis/'>Processes of Perception and Analysis</a>”, recognizing the importance of the observer in computational systems. But with multicomputation there was yet more focus on this, and on how a physical observer knits things together to <a href='https://writings.stephenwolfram.com/2021/03/what-is-consciousness-some-new-perspectives-from-our-physics-project/'>form a coherent thread of experience</a>. Indeed, it became clear that it’s certain features of the observer that ultimately determine the laws of physics we perceive. And in particular it seems that as soon as we—somehow reflecting core <a href='https://writings.stephenwolfram.com/2021/03/what-is-consciousness-some-new-perspectives-from-our-physics-project/'>features of our conscious experience</a>—believe that we exist persistently through time, but are computationally bounded, then it follows that we will attribute to the universe the central known laws of spacetime and quantum mechanics.</p>\n<p>At the level of atoms of space and individual threads of history everything is full of computational irreducibility. But the key point is that observers like us don’t experience this; instead we sample certain computationally reducible features—that we can describe in terms of meaningful “laws of physics”.</p>\n<p style=\"display: inline-block;float: right;padding: 0px;margin: 0px;\"><img title=\"\" class=\"bookpost\" src=\"https://content.wolfram.com/uploads/sites/43/2022/05/1-inset-phyzA.png\" alt=\"\" width=\"163\" height=\"134\" style=\"margin: 0px; padding: 0px;\"></a></p>\n<p>I never expected it would be so easy, but by early 2020—only a few months into our <a href='https://www.wolframphysics.org/' target=_blank rel=noopener>Wolfram Physics Project</a>—we seemed to have successfully identified how the “machine code” of our universe must work. <em>A New Kind of Science</em> had established that computation was a powerful way of thinking about things. But now it was becoming clear that actually our whole universe is in a sense “computational all the way down”. </p>\n<p>But where did this leave the traditional mathematical view? To my surprise, far from being at odds it seemed as if our computation-all-the-way-down model of physics perfectly plugged into a great many of the more abstract existing mathematical approaches. Mediated by multicomputation, the concepts of <em>A New Kind of Science—</em>which began as an effort to go beyond mathematics—seemed now to be finding a kind of ultimate convergence with mathematics.</p>\n<p>But despite our success in working out the structure of the “machine code” for our universe, a major mystery remained. Let’s say we could find a particular rule that could generate everything in our universe. Then we’d have to ask “Why this rule, and not another?” And if “our rule” was simple, how come we’d “lucked out” like that? Ever since I was working on <em>A New Kind of Science</em> I’d <a href='https://writings.stephenwolfram.com/2007/09/my-hobby-hunting-for-our-universe/'>wondered about this</a>.</p>\n<p>And just as we were getting ready to announce the Physics Project in May 2020 the answer <a href='https://writings.stephenwolfram.com/2020/04/finally-we-may-have-a-path-to-the-fundamental-theory-of-physics-and-its-beautiful/#why-this-universe-the-relativity-of-rules'>began to emerge</a>. It came out of the multicomputational paradigm. And in a sense it was an ultimate version of it. Instead of imagining that the universe follows some particular rule—albeit applying it multicomputationally in all possible ways—what if the universe follows all possible rules? </p>\n<p>And then we realized: this is something much more general than physics. And in a sense it’s the ultimate computational construct. It’s what one gets if one takes all the programs in the computational universe that I studied in <em>A New Kind of Science</em> and runs them together—as a single, giant, multicomputational system. It’s a single, unique object that I call <a href='https://writings.stephenwolfram.com/2021/11/the-concept-of-the-ruliad/'>the ruliad</a>, formed as the entangled limit of all possible computations.</p>\n<p>There’s no choice about the ruliad. Everything about it is abstractly necessary—emerging as it does just from the formal concept of computation. <em>A New Kind of Science</em> developed the abstraction of thinking about things in terms of computation. The ruliad takes this to its ultimate limit—capturing the whole entangled structure of all possible computations—and defining an object that in some sense describes everything.</p>\n<p>Once we believe—as the <a href='https://www.wolframscience.com/nks/chap-12--the-principle-of-computational-equivalence/'>Principle of Computational Equivalence</a> implies—that things like our universe are computational, it then inevitably follows that they are described by the ruliad. But the observer has a crucial role here. Because while as a matter of theoretical science we can discuss the whole ruliad, our experience of it inevitably has to be based on sampling it according to our actual capabilities of perception.</p>\n<p>In the end, it’s deeply analogous to something that—as <a href='https://www.wolframscience.com/nks/p17--the-personal-story-of-the-science-in-this-book/'>I mention in <em>A New Kind of Science</a></em>—first got me interested in fundamental questions in science 50 years ago: the <a href='https://www.wolframscience.com/nks/p441--irreversibility-and-the-second-law-of-thermodynamics/'>Second Law of thermodynamics</a>. The molecules in a gas move around and interact according to certain rules. But as <em>A New Kind of Science</em> argues, one can think about this as a computational process, which can show computational irreducibility. If one didn’t worry about the “mechanics” of the observer, one might imagine that one could readily “see through” this computational irreducibility, to the detailed behavior of the molecules underneath. But the point is that a realistic, computationally bounded observer—like us—will be forced by computational irreducibility to perceive only certain “coarse-grained” aspects of what’s going on, and so will consider the gas to be behaving in a standard large-scale thermodynamic way. </p>\n<p>And so it is, at a grander level, with the ruliad. Observers like us can only perceive certain aspects of what’s going on in the ruliad, and a key result of our Physics Project is that with only quite loose constraints on what we’re like as observers, it’s inevitable that we will perceive our universe to operate according to particular precise known laws of physics. And indeed the <a href='https://writings.stephenwolfram.com/2021/03/what-is-consciousness-some-new-perspectives-from-our-physics-project/'>attributes that we associate with “consciousness”</a> seem closely tied to what’s needed to get the features of spacetime and quantum mechanics that we know from physics. In <em>A New Kind of Science</em> one of the conclusions is that the Principle of Computational Equivalence <a href='https://www.wolframscience.com/nks/chap-12--the-principle-of-computational-equivalence#sect-12-10--intelligence-in-the-universe'>implies a fundamental equivalence between systems (like us)</a> that we consider “intelligent” or “conscious”, and systems that we consider “merely computational”. </p>\n<p>But what’s now become clear in the multicomputational paradigm is that there’s more to this story. It’s not (as people have often assumed) that there’s something more powerful about “conscious observers” like us. Actually, <a href='https://writings.stephenwolfram.com/2021/03/what-is-consciousness-some-new-perspectives-from-our-physics-project/'>it&#8217;s rather the opposite</a>: that in order to have consistent “conscious experience” we have to have certain limitations (in particular, computational boundedness, and a belief of <a href='https://writings.stephenwolfram.com/2022/03/on-the-concept-of-motion/'>persistence in time</a>), and these limitations are what make us “see the ruliad” in the way that corresponds to our usual view of the physical world.</p>\n<p style=\"display: inline-block;float:left;padding: 0px;margin: 0px; margin-top: 7px; margin-right: 8px;\"><img class=\"bookpost\" title=\"\" src=\"https://content.wolfram.com/uploads/sites/43/2022/05/2-inset-ultimate-universe.png\" alt=\"\" width=\"131\" height=\"117\" style=\"margin: 0px;padding: 0px;margin-left: 0px;\"></a></p>\n<p>The concept of the ruliad is a powerful one, with implications that significantly transcend the traditional boundaries of science. For example, last year I realized that thinking in terms of the ruliad potentially provides a <a href='https://writings.stephenwolfram.com/2021/04/why-does-the-universe-exist-some-perspectives-from-our-physics-project/'>meaningful answer to the ultimate question of why our universe exists</a>. The answer, I posit, is that the ruliad—as a “purely formal” object—“necessarily exists”. And what we perceive as “our universe” is then just the “slice” that corresponds to what we can “see” from the particular place in “rulial space” at which we happen to be. There has to be “something there”—and the remarkable fact is that for an observer with our general characteristics, that something has to have features that are like our usual laws of physics.</p>\n<p>In <em>A New Kind of Science</em> I discussed how the Principle of Computational Equivalence implies that <a href='https://www.wolframscience.com/nks/chap-12--the-principle-of-computational-equivalence#sect-12-10--intelligence-in-the-universe'>almost any system can be thought of as being “like a mind”</a> (as in, “the weather has a mind of its own”). But the issue—that for example is of central importance in talking about extraterrestrial intelligence—is how similar to us that mind is. And now with the ruliad we have a more definite way to discuss this. Different minds (even different human ones) can be thought of as being at different places in the ruliad, and thus in effect attributing different rules to the universe. The Principle of Computational Equivalence implies that there must ultimately be a way to translate (or, in effect, move) from one place to another. But the question is how far it is. </p>\n<p>Our senses and measuring devices—together with our general paradigms for thinking about things—define the basic area over which our understanding extends, and for which we can readily produce a high-level narrative description of what’s going on. And in the past we might have assumed that this was all we’d ever need to reach with whatever science we built. But what <em>A New Kind of Science—</em>and now the ruliad—show us is that there’s much more out there. There’s a whole computational universe of possible programs—many of which behave in ways that are far from our current domain of high-level understanding.</p>\n<p>Traditional science we can view as operating by gradually expanding our domain of understanding. But in a sense the key methodological idea that launched <em>A New Kind of Science</em> is to do computational experiments, which in effect just “jump without prior understanding” out into the wilds of the computational universe. And that’s in the end why <a href='https://www.wolframscience.com/nks/chap-3--the-world-of-simple-programs/'>all that ruliology</a> in <em>A New Kind of Science</em> at first looks so alien: we’ve effectively jumped quite far from our familiar place in rulial space, so there’s no reason to expect we’ll recognize anything. And in effect, as the title of the book says, we need to be doing a new kind of science.</p>\n<p>In <em>A New Kind of Science</em>, an important part of the story has to do with the phenomenon of computational irreducibility, and the way in which it prevents any computationally bounded observer (like us) from being able to “reduce” the behavior of systems, and thereby perceive them as anything other than complex. But now that we’re thinking not just about computation, but about multicomputation, other attributes of other observers start to be important too. And with the ruliad ultimately representing everything, the question of what will be perceived in any particular case devolves into one about the characteristics of observers.</p>\n<p>In <em>A New Kind of Science</em> I give examples of how the same kinds of simple programs (such as cellular automata) can <a href='https://www.wolframscience.com/nks/chap-8--implications-for-everyday-systems/'>provide good “metamodels” for a variety of kinds of systems</a> in nature and elsewhere, that show up in very different areas of science. But one feature of different areas of science is that they’re often concerned with different kinds of questions. And with the focus on the characteristics of the observer this is something we get to capture—and we get to discuss, for example, what the <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/#chemistry-molecular-biology'>chemical observer</a>, or the <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/#economics'>economic observer</a>, might be like, and how that affects their perception of what’s ultimately in the ruliad.</p>\n<p>In <a href='https://www.wolframscience.com/nks/chap-12--the-principle-of-computational-equivalence/'>Chapter 12 of <em>A New Kind of Science</a></em> there’s a long section on “<a href='https://www.wolframscience.com/nks/chap-12--the-principle-of-computational-equivalence#sect-12-9--implications-for-mathematics-and-its-foundations'>Implications for Mathematics and Its Foundations</a>”, which begins with the observation that just as many models in science seem to be able to start from simple rules, mathematics is traditionally specifically set up to start from simple axioms. I then analyzed how <a href='https://www.wolframscience.com/nks/p777--implications-for-mathematics-and-its-foundations/'>multiway systems could be thought of as defining possible derivations</a> (or proofs) of new mathematical theorems from axioms or other theorems—and I discussed how the difficulty of doing mathematics can be thought of as a reflection of computational irreducibility.</p>\n<p style=\"display: inline-block;float: right;padding: 0px;margin: 0px;\"><img title=\"\" class=\"bookpost\" src=\"https://content.wolfram.com/uploads/sites/43/2022/05/3-inset-metamath-project.png\" alt=\"\" width=\"150\" height=\"123\" style=\"margin: 0px; padding: 0px;\"></a></p>\n<p>But informed by our Physics Project I realized that there&#8217;s much more to say about the foundations of mathematics—and this has led to our recently launched <a href='https://www.wolframscience.com/metamathematics/'>Metamathematics Project</a>. At the core of this project is the idea that mathematics, like physics, is ultimately just a sampling of the ruliad. And just as the ruliad defines the lowest-level machine code of physics, so does it also for mathematics.</p>\n<p>The traditional axiomatic level of mathematics (with its built-in notions of variables and operators and so on) is already higher level than the “raw ruliad”. And a crucial observation is that just like physical observers operate at a level far above things like the atoms of space, so “mathematical observers” mostly operate at a level far above the raw ruliad, or even the “assembly code” of axioms. In an analogy with gases, the ruliad—or even axiom systems—are talking about the “molecular dynamics” level; but “mathematical observers” operate more at the “fluid dynamics” level. </p>\n<p>And the result of this is what I call the physicalization of metamathematics: the realization that our “perception” of mathematics is like our perception of physics. And that, for example, the very possibility of consistently doing higher-level mathematics where we don&#8217;t always have to drop down to the level of axioms or the raw ruliad has the same origin as the fact that “observers like us” typically view space as something continuous, rather than something made up of lots of atoms of space.</p>\n<p>In <em>A New Kind of Science</em> I <a href='https://www.wolframscience.com/nks/p815--implications-for-mathematics-and-its-foundations/'>considered it a mystery</a> why phenomena like undecidability are not more common in typical pure mathematics. But now our Metamathematics Project provides an answer that&#8217;s based on the character of mathematical observers. </p>\n<p>My stated goal at the beginning of <em>A New Kind of Science</em> was to go beyond the mathematical paradigm, and that&#8217;s exactly what was achieved. But now there&#8217;s almost a full circle—because we see that building on <em>A New Kind of Science</em> and the computational paradigm we reach the <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/'>multicomputational paradigm</a> and <a href='https://writings.stephenwolfram.com/2021/11/the-concept-of-the-ruliad/'>the ruliad</a>, and then we realize that mathematics, like physics, is part of the ruliad. Or, put another way, mathematics, like physics—and like everything else—is “made of computation”, and all computation is in the ruliad.</p>\n<p>And that means that insofar as we consider there to be physical reality, <a href='https://writings.stephenwolfram.com/2021/04/why-does-the-universe-exist-some-perspectives-from-our-physics-project/#the-relation-to-mathematics'>so also we must consider there to be “mathematical reality”</a>. Physical reality arises from the sampling of the ruliad by physical observers; so similarly mathematical reality must arise from the sampling of the ruliad by mathematical observers. Or, in other words, if we believe that the physical world exists, so we must—essentially like Plato—also believe that the mathematics exists, and that there is an underlying reality to mathematics.</p>\n<p>All of these ideas rest on what was achieved in <em>A New Kind of Science</em> but now go significantly beyond it. <a href='https://writings.stephenwolfram.com/2022/05/the-making-of-a-new-kind-of-science/#the-lost-epilog,-and-other-outtakes-from-the-book'>In an “Epilog” that I eventually cut</a> from the final version of <em>A New Kind of Science</em> I speculated that “major new directions” might be built in 15–30 years. And when I wrote that, I wasn&#8217;t really expecting that I would be the one to be central in doing that. And indeed I suspect that had I simply continued the direct path in basic science defined by my work on <em>A New Kind of Science</em>, it wouldn&#8217;t have been me. </p>\n<p>It&#8217;s not something I&#8217;ve explicitly planned, but at this point I can look back on my life so far and see it as a repeated alternation between <a href='https://writings.stephenwolfram.com/2016/04/my-life-in-technology-as-told-at-the-computer-history-museum/'>technology</a> and <a href='https://writings.stephenwolfram.com/2020/04/how-we-got-here-the-backstory-of-the-wolfram-physics-project/'>basic science</a>. Each builds on the other, giving me both ideas and tools—and creating in the end a taller and taller intellectual tower. But what&#8217;s crucial is that every alternation is in many ways a fresh start, where I&#8217;m able to use what I&#8217;ve done before, but have a chance to reexamine everything from a new perspective. And so it has been in the past few years with <em>A New Kind of Science</em>: having returned to basic science after 17 years away, it&#8217;s been possible to make remarkably rapid and dramatic progress that&#8217;s taken things to a new and wholly unexpected level. </p>\n<h2 id='the-arrival-of-a-fourth-scientific-paradigm'>The Arrival of a Fourth Scientific Paradigm</h2>\n<p style=\"display: inline-block;float: right;padding: 0px;margin: 0px;\"><img title=\"\" class=\"bookpost\" src=\"https://content.wolfram.com/uploads/sites/43/2022/05/4-inset-opening-sentence.png\" alt=\"\" width=\"124\" height=\"149\" style=\"margin: 0px; padding: 0px;\"></a></p>\n<p>In the course of intellectual history, there’ve been <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/'>very few fundamentally different paradigms</a> introduced for theoretical science. The first is what one might call the “structural paradigm”, in which one’s basically just concerned with what things are made of. And beginning in antiquity—and continuing for two millennia—this was pretty much the only paradigm on offer. But in the 1600s there was, as I described it in the <a href='https://www.wolframscience.com/nks/p1--an-outline-of-basic-ideas/'>opening sentence of<em> A New Kind of Science</a></em>, a “dramatic new idea”—that one could describe not just how things are, but also what they can do, in terms of mathematical equations.</p>\n<p>And for three centuries this “mathematical paradigm” defined the state of the art for theoretical science. But as I <a href='https://www.wolframscience.com/nks/p1--an-outline-of-basic-ideas/'>went on to explain in the opening paragraph of <em>A New Kind of Science</a></em>, my goal was to develop a new “computational paradigm” that would describe things not in terms of mathematical equations but instead in terms of computational rules or programs. There’d been <a href='https://www.wolframscience.com/nks/chap-1--the-foundations-for-a-new-kind-of-science#sect-1-4--the-personal-story-of-the-science-in-this-book'>precursors to this in my own work in the 1980s</a>, but despite the <a href='https://www.wolfram.com/mathematica/'>practical use of computers in applying the mathematical paradigm</a>, there wasn’t much of a concept of describing things, say in nature, in a fundamentally computational way.</p>\n<p>One feature of a mathematical equation is that it aims to encapsulate “in one fell swoop” the whole behavior of a system. Solve the equation and you’ll know everything about what the system will do. But in the computational paradigm it’s a different story. The underlying computational rules for a system in principle determine what it will do. But to actually find out what it does, you have to run those rules—which is often a computationally irreducible process. </p>\n<p>Put another way: in the structural paradigm, one doesn’t talk about time at all. In the mathematical paradigm, time is there, but it’s basically just a parameter, that if you can solve the equations you can set to whatever value you want. In the computational paradigm, however, time is something more fundamental: it’s associated with the actual irreducible progression of computation in a system.</p>\n<p>It’s an important distinction that cuts to the core of theoretical science. Heavily influenced by the mathematical paradigm, it’s often been assumed that science is fundamentally about being able to make predictions, or in a sense having a model that can “outrun” the system you’re studying, and say what it’s going to do with much less computational effort than the system itself. </p>\n<p>But <a href='https://www.wolframscience.com/nks/chap-12--the-principle-of-computational-equivalence#sect-12-6--computational-irreducibility'>computational irreducibility</a> implies that there’s a fundamental limit to this. There are systems whose behavior is in effect “too complex” for us to ever be able to “find a formula for it”. And this is not something we could, for example, resolve just by increasing our mathematical sophistication: it is a fundamental limit that arises from the whole structure of the computational paradigm. In effect, from deep inside science we’re learning that there are <a href='https://www.wolframscience.com/nks/chap-12--the-principle-of-computational-equivalence#sect-12-12--historical-perspectives'>fundamental limitations on what science can achieve</a>.</p>\n<p>But as I <a href='https://www.wolframscience.com/nks/chap-12--the-principle-of-computational-equivalence#sect-12-7--the-phenomenon-of-free-will'>mentioned in <em>A New Kind of Science</a></em>, computational irreducibility has an upside as well. If everything were computationally reducible, the passage of time wouldn’t in any fundamental sense add up to anything; we’d always be able to “jump ahead” and see what the outcome of anything would be without going through the steps, and we’d never have something we could reasonably experience as free will.</p>\n<p>In practical computing it’s pretty common to want to go straight from “question” to “answer”, and not be interested in “what happened inside”. But in <em>A New Kind of Science</em> there is in a sense an immediate emphasis on “what happens inside”. I don’t just show the initial input and final output for a cellular automaton. I show its whole “spacetime” history. And now that we have a computational theory of fundamental physics we can see that all the richness of our physical experience is contained in the “process inside”. We don’t just want to know the endpoint of the universe; we want to live the ongoing computational process that corresponds to our experience of the passage of time.</p>\n<p style=\"display: inline-block;float:left;padding: 0px;margin: 0px; margin-top: 2px; margin-right: 8px;\"><img class=\"bookpost\" title=\"\" src=\"https://content.wolfram.com/uploads/sites/43/2022/05/5-inset-multicomp.png\" alt=\"\" width=\"144\" height=\"128\" style=\"margin: 0px;padding: 0px;margin-left: 0px;\"></a></p>\n<p>But, OK, so in <em>A New Kind of Science</em> we reached what we might identify as the third major paradigm for theoretical science. But the exciting—and surprising—thing is that inspired by our Physics Project we can now <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/'>see a fourth paradigm: the multicomputational paradigm</a>. And while the computational paradigm involves considering the progression of particular computations, the multicomputational paradigm involves considering the entangled progression of many computations. The computational paradigm involves a single thread of time. The multicomputational paradigm involves multiple threads of time that branch and merge.</p>\n<p>What in a sense forced us into the multicomputational paradigm was <a href='https://writings.stephenwolfram.com/2020/04/finally-we-may-have-a-path-to-the-fundamental-theory-of-physics-and-its-beautiful/#the-inevitability-of-quantum-mechanics'>thinking about quantum mechanics in our Physics Project</a>, and realizing that multicomputation was inevitable in our models. But the idea of multicomputation is vastly more general, and in fact immediately applies to any system where at any given step multiple things can happen. In <em>A New Kind of Science</em> I studied many kinds of computational systems—like cellular automata and Turing machines—where one definite thing happens at each step. I looked a little at <a href='https://www.wolframscience.com/nks/chap-5--two-dimensions-and-beyond#sect-5-6--multiway-systems'>multiway systems</a>—primarily ones based on string rewriting. But now in general in the multicomputational paradigm one is interested in studying multiway systems of all kinds. They can be based on simple iterations, <a href='https://www.wolframphysics.org/bulletins/2021/10/multicomputation-with-numbers-the-case-of-simple-multiway-systems' target=_blank rel=noopener>say involving numbers</a>, in which multiple functions can be applied at each step. They can be based on <a href='https://writings.stephenwolfram.com/2022/03/the-physicalization-of-metamathematics-and-its-implications-for-the-foundations-of-mathematics/#he-topology-of-proof-space'>systems like games</a> where there are multiple moves at each step. And they can be based on a whole range of systems in nature, technology and elsewhere where there are multiple <a href='https://writings.stephenwolfram.com/2021/05/the-problem-of-distributed-consensus/#asynchronous-updating'>“asynchronous” choices of events</a> that can occur.</p>\n<p>Given the basic description of multicomputational systems, one might at first assume that whatever difficulties there are in deducing the behavior of computational systems, they would only be greater for multicomputational systems. But the crucial point is that whereas with a purely computational system (like a cellular automaton) it’s perfectly reasonable to imagine “experiencing” its whole evolution—say just by seeing a picture of it, the same is not true of a multicomputational system. Because for observers like us, who fundamentally experience time in a single thread, we have no choice but to somehow “sample” or “coarse grain” a multicomputational system if we are to reduce its behavior to something we can “experience”. </p>\n<p>And there’s then a remarkable formal fact: if one has a system that shows fundamental computational irreducibility, then computationally bounded “single-thread-of-time” observers inevitably perceive certain effective behavior in the system, that follows something like the typical laws of physics. Once again we can make an analogy with gases made from large numbers of molecules. Large-scale (computationally bounded) observers will essentially inevitably perceive gases to follow, say, the standard gas laws, quite independent of the detailed properties of individual molecules. </p>\n<p>In other words, the interplay between an “observer like us” and a multicomputational system will effectively select out a slice of computational reducibility from the underlying computational irreducibility. And although I didn’t see this coming, it’s in the end fairly obvious that something like this has to happen. The Principle of Computational Equivalence makes it basically inevitable that the underlying processes in the universe will be computationally irreducible. But somehow the particular features of the universe that we perceive and care about have to be ones that have enough computational reducibility that we can, for example, make consistent decisions about what to do, and we’re not just continually confronted by irreducible unpredictability.</p>\n<p>So how general can we expect this picture of multicomputation to be, with its connection to the kinds of things we’ve seen in physics? It seems to be extremely general, and to provide a <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/'>true fourth paradigm for theoretical science</a>. </p>\n<p>There are <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/#potential-application-areas'>many kinds of systems</a> for which the multicomputational paradigm seems to be immediately relevant. Beyond physics and metamathematics, there seems to be near-term promise in <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/#chemistry-molecular-biology'>chemistry</a>, <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/#chemistry-molecular-biology'>molecular biology</a>, <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/#evolutionary-biology'>evolutionary biology</a>, <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/#neuroscience'>neuroscience</a>, <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/#immunology'>immunology</a>, <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/#linguistics'>linguistics</a>, <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/#economics'>economics</a>, <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/#machine-learning'>machine learning</a>, <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/#distributed-computing'>distributed computing</a> and more. In each case there are underlying low-level elements (such as molecules) that interact through some kind of events (say collisions or reactions). And then there’s a big question of what the relevant observer is like.</p>\n<p>In <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/#chemistry-molecular-biology'>chemistry</a>, for example, the observer could just measure the overall concentration of some kind of molecule, coarse-graining together all the individual instances of those molecules. Or the observer could be sensitive, for example, to detailed causal relationships between collisions among molecules. In traditional chemistry, things like this generally aren’t “observed”. But in biology (for example in connection with membranes), or in molecular computing, they may be crucial. </p>\n<p>When I began the project that became <em>A New Kind of Science</em> the central question I wanted to answer is <a href='https://writings.stephenwolfram.com/2021/09/charting-a-course-for-complexity-metamodeling-ruliology-and-more/'>why we see so much complexity</a> in so many kinds of systems. And with the computational paradigm and the ubiquity of computational irreducibility we had an answer, which also in a sense told us why it was difficult to make certain kinds of progress in a whole range of areas.</p>\n<p>But now we’ve got a new paradigm, the multicomputational paradigm. And the <a href='https://writings.stephenwolfram.com/2021/09/charting-a-course-for-complexity-metamodeling-ruliology-and-more/#multicomputation-and-the-surprise-return-of-reducibility-'>big surprise</a> is that through the intermediation of the observer we can tap into computational reducibility, and potentially find “physics-like” laws for all sorts of fields. This may not work for the questions that have traditionally been asked in these fields. But the point is that with the “right kind of observer” there’s computational reducibility to be found. And that computational reducibility may be something we can tap into for understanding, or to use some kind of system for technology.</p>\n<p style=\"display: inline-block;float: right;padding: 0px;margin: 0px;\"><img title=\"\" class=\"bookpost\" src=\"https://content.wolfram.com/uploads/sites/43/2022/05/6-inset-ruliad.png\" alt=\"\" width=\"121\" height=\"126\" style=\"margin: 0px; padding: 0px;\"></a></p>\n<p>It can all be seen as starting with <a href='https://writings.stephenwolfram.com/2021/11/the-concept-of-the-ruliad/'>the ruliad</a>, and involving almost philosophical questions of what one can call “observer theory”. But in the end it gives us very practical ideas and methods that I think have the potential to lead to unexpectedly dramatic progress in a remarkable range of fields.</p>\n<p>I knew that <em>A New Kind of Science</em> would have practical applications, particularly in modeling, in <a href='https://writings.stephenwolfram.com/2017/05/a-new-kind-of-science-a-15-year-view/#a-world-of-discovered-technology'>technology</a> and in <a href='https://writings.stephenwolfram.com/2011/06/music-mathematica-and-the-computational-universe/'>producing creative material</a>. And indeed it has. But for our Physics Project applications seemed much further away, perhaps centuries. But a great surprise has been that through the multicomputational paradigm it seems as if there are going to be some quite immediate and very practical applications of the Physics Project.</p>\n<p>In a sense the reason for this is that through the intermediation of multicomputation we see that many kinds of systems share the same underlying “metastructure”. And this means that as soon as there are things to say about one kind of system these can be applied to other systems. And in particular the great successes of physics can be applied to a whole range of systems that share the same multicomputational metastructure.</p>\n<p>An immediate example is in practical computing, and particularly in the <a href='https://www.wolfram.com/language/'>Wolfram Language</a>. It’s something of a <a href='https://writings.stephenwolfram.com/2020/04/how-we-got-here-the-backstory-of-the-wolfram-physics-project/#the-beginning-of-the-story'>personal irony</a> that the Wolfram Language is based on transformation rules for symbolic expressions, which is a structure very similar to what ends up being what’s involved in the Physics Project. But there’s a crucial difference: in the usual case of the Wolfram Language, everything works in a purely computational way, with a <a href='https://writings.stephenwolfram.com/2020/12/combinators-a-centennial-view/#the-question-of-evaluation-order'>particular transformation being done at each step</a>. But now there’s the potential to generalize that to the multicomputational case, and in effect to trace the multiway system of every possible transformation.</p>\n<p>It’s not easy to pick out of that structure things that we can readily understand. But there are important lessons from physics for this. And as we build out the multicomputational capabilities of the Wolfram Language I fully expect that the “notational clarity” it will bring will help us to formulate much more in terms of the multicomputational paradigm.</p>\n<p>I built the Wolfram Language as a tool that would help me explore the computational paradigm, and from that paradigm there emerged principles like the Principle of Computational Equivalence, which in turn led me to <a href='https://writings.stephenwolfram.com/2009/05/7-years-of-nks-and-its-first-killer-app/'>see the possibility</a> of something like <a href='https://www.wolframalpha.com/'>Wolfram|Alpha</a>. But now from the latest basic science built on the foundations of <em>A New Kind of Science</em>, together with the practical tooling of the Wolfram Language, it’s becoming possible again to see how to make conceptual advances that can drive technology that will again in turn let us make—likely dramatic—progress in basic science. </p>\n<h2 id='harvesting-seeds-from-a-new-kind-of-science'>Harvesting Seeds from A New Kind of Science</h2>\n<p><em>A New Kind of Science</em> is full of intellectual seeds. And in the past few years—having now returned to basic science—I’ve been harvesting a few of those seeds. The <a href='https://www.wolframphysics.org/' target=_blank rel=noopener>Physics Project</a> and the Metamathematics Project are two major results. But there’s been quite a bit more. And in fact it’s rather remarkable how many things that were barely more than footnotes in <em>A New Kind of Science</em> have <a href='https://writings.stephenwolfram.com/category/new-kind-of-science/'>turned into major projects</a>, with important results.</p>\n<p>Back in 2018—a year before beginning the Physics Project—I <a href='https://writings.stephenwolfram.com/2018/11/logic-explainability-and-the-future-of-understanding/'>returned, for example,</a> to what’s become known as the Wolfram Axiom: the <a href='https://www.wolframscience.com/nks/p808--implications-for-mathematics-and-its-foundations/'>axiom that I found in <em>A New Kind of Science</a></em> that is the very simplest possible axiom for Boolean algebra. But my focus now was not so much on the axiom itself as on the automated process of proving its correctness, and the effort to see the relation between “pure computation” and what one might consider a human-absorbable “narrative proof”.</p>\n<p>Computational irreducibility appeared many times, notably in my efforts to understand <a href='https://writings.stephenwolfram.com/2016/10/a-short-talk-on-ai-ethics/'>AI ethics</a> and the implications of <a href='https://writings.stephenwolfram.com/2016/10/computational-law-symbolic-discourse-and-the-ai-constitution/'>computational contracts</a>. I’ve no doubt that in the years to come, the concept of computational irreducibility will become increasingly important in everyday thinking—a bit like how concepts such as energy and momentum from the mathematical paradigm have become important. And in 2019, for example, computational irreducibility made an <a href='https://www.commerce.senate.gov/2019/6/optimizing-for-engagement-understanding-the-use-of-persuasive-technology-on-internet-platforms' target=_blank rel=noopener>appearance in government affairs</a>, as a result of me <a href='https://writings.stephenwolfram.com/2019/06/testifying-at-the-senate-about-a-i-selected-content-on-the-internet/'>testifying about its implications for legislation about AI selection</a> of content on the internet.</p>\n<p>In <em>A New Kind of Science</em> I explored many specific systems about which one can ask all sorts of questions. And one might think that after 20 years “all the obvious questions” would have been answered. But they have not. And in a sense the fact that they have not is a direct reflection of the ubiquity of computational irreducibility. But it’s a fundamental feature that whenever there’s computational irreducibility, there must also be pockets of computational reducibility: in other words, the very existence of computational irreducibility implies an infinite frontier of potential progress. </p>\n<p>Back in 2007, we’d had great success with our <a href='https://www.wolframscience.com/prizes/tm23/'>Turing Machine Prize</a>, and the Turing machine that I’d suspected was the very simplest possible universal Turing machine was <a href='https://blog.wolfram.com/2007/10/24/the-prize-is-won-the-simplest-universal-turing-machine-is-proved/'>indeed proved universal</a>—providing another piece of evidence for the Principle of Computational Equivalence. And in a sense there’s a general question that’s raised by <em>A New Kind of Science</em> about where the threshold of universality—or computational equivalence—really is in different kinds of systems.</p>\n<p style=\"display: inline-block;float: right;padding: 0px;margin: 0px; margin-left: 8px; margin-top: 2px;\"><img title=\"\" class=\"bookpost\" src=\"https://content.wolfram.com/uploads/sites/43/2022/05/7-inset-rule30prize.png\" alt=\"\" width=\"140\" height=\"116\" style=\"margin: 0px; padding: 0px;\"></a></p>\n<p>But there are simpler-to-define questions as well. And ever since I <a href='https://www.stephenwolfram.com/publications/academic/statistical-mechanics-cellular-automata.pdf'>first studied rule 30</a> in 1984 I’d wondered about many questions related to it. And in October 2019 I decided to launch the <a href='https://www.rule30prize.org/' target=_blank rel=noopener>Rule 30 Prizes</a>, defining <a href='https://writings.stephenwolfram.com/2019/10/announcing-the-rule-30-prizes'>three specific easy-to-state questions about rule 30</a>. So far I don’t know of progress on them. And for all I know they’ll be open problems for centuries. From the point of view of <a href='https://writings.stephenwolfram.com/2021/11/the-concept-of-the-ruliad/'>the ruliad</a> we can think of them as distant explorations in rulial space, and the question of when they can be answered is like the question of when we’ll have the technology to get to some distant place in physical space.</p>\n<p>Having launched the Physics Project in April 2020, it was rapidly clear that its ideas could also be applied to metamathematics. And it even seemed as if it might be easier to make relevant “real-world” observations in metamathematics than in physics. And the seed for this was in a note in <em>A New Kind of Science</em> entitled “<a href='https://www.wolframscience.com/nks/notes-12-9--empirical-metamathematics/'>Empirical Metamathematics</a>”. That note contained one picture of the theorem-dependency graph of Euclid’s <em>Elements</em>, which in the summer of 2020 <a href='https://writings.stephenwolfram.com/2020/09/the-empirical-metamathematics-of-euclid-and-beyond/'>expanded into a 70-page study</a>. And in my recent “<a href='https://writings.stephenwolfram.com/2022/03/the-physicalization-of-metamathematics-and-its-implications-for-the-foundations-of-mathematics/'>Physicalization of Metamathematics</a>” there’s a continuation of that—beginning to <a href='https://writings.stephenwolfram.com/2022/03/the-physicalization-of-metamathematics-and-its-implications-for-the-foundations-of-mathematics/#empirical-metamathematics'>map out empirical metamathematical space</a>, as explored in the practice of mathematics, with the idea that multicomputational phenomena that in physics may take technically infeasible particle accelerators or telescopes might actually be within reach.</p>\n<p style=\"display: inline-block;float:left;padding: 0px;margin: 0px; margin-top: 5px; margin-right: 8px;\"><img class=\"bookpost\" title=\"\" src=\"https://content.wolfram.com/uploads/sites/43/2022/05/8-inset-combinators.png\" alt=\"\" width=\"142\" height=\"139\" style=\"margin: 0px;padding: 0px;margin-left: 0px;\"></a></p>\n<p>In addition to being the year we launched our Physics Project, 2020 was also the <a href='https://writings.stephenwolfram.com/2020/12/combinators-and-the-story-of-computation/'>100th anniversary of combinators</a>—the first concrete formalization of universal computation. In <em>A New Kind of Science</em> I devoted a <a href='https://www.wolframscience.com/nks/p711--universality-in-turing-machines-and-other-systems/'>few pages</a> and some <a href='https://www.wolframscience.com/nks/notes-11-12--combinators/'>notes</a> to combinators, but I decided to <a href='https://writings.stephenwolfram.com/2020/12/combinators-a-centennial-view/'>do a deep dive</a> and use both what I’d learned from <em>A New Kind of Science</em> and from the Physics Project to take a new look at them. Among other things the result was another <a href='https://writings.stephenwolfram.com/2020/12/combinators-a-centennial-view/#updating-schemes-and-multiway-systems'>application of multicomputation</a>, as well as the realization that even though the S, K combinators from 1920 seemed very minimal, it was possible that <a href='https://writings.stephenwolfram.com/2021/06/1920-2020-and-a-20000-prize-announcing-the-s-combinator-challenge/'>S alone might also be universal</a>, though with something different than the usual input &#8594; output “workflow” of computation. </p>\n<p>In <em>A New Kind of Science </em>a <a href='https://www.wolframscience.com/nks/notes-5-6--non-deterministic-systems/'>single footnote mentions multiway Turing machines</a>. And early last year I turned this seed into a <a href='https://www.wolframphysics.org/bulletins/2021/02/multiway-turing-machines/' target=_blank rel=noopener>long and detailed study</a> that provides further foundational examples of multicomputation, and explores the question of just what it means to “do a computation” multicomputationally—something which I believe is highly relevant not only for practical distributed computing but also for things like molecular computing.</p>\n<p>In 2021 it was the <a href='https://youtu.be/ultMxODJE7o' target=_blank rel=noopener>centenary of Post tag systems</a>, and again I turned a <a href='https://www.wolframscience.com/nks/chap-3--the-world-of-simple-programs#sect-3-7--tag-systems'>few pages in <em>A New Kind of Science</a></em> into a <a href='https://writings.stephenwolfram.com/2021/03/after-100-years-can-we-finally-crack-posts-problem-of-tag-a-story-of-computational-irreducibility-and-more/'>long and detailed study</a>. And what’s important about both this and my study of combinators is that they provide foundational examples (much like cellular automata in <em>A New Kind of Science</em>), which even in the past year or so I’ve <a href='https://writings.stephenwolfram.com/2022/03/the-physicalization-of-metamathematics-and-its-implications-for-the-foundations-of-mathematics/#going-below-axiomatic-mathematics'>used multiple times</a> in different projects.</p>\n<p>In mid-2021, yet another <a href='https://www.wolframscience.com/nks/p339--origins-of-discreteness/'>few-page discussion in <em>A New Kind of Science</a></em> turned into a <a href='https://writings.stephenwolfram.com/2021/05/the-problem-of-distributed-consensus/'>detailed study of “The Problem of Distributed Consensus”</a>. And once again, this turned out to have a multicomputational angle, at first in understanding the multiway character of possible outcomes, but later with the realization that the formation of consensus is deeply related to the process of measurement and the coarse-graining involved in it—and the fundamental way that observers extract “coherent experiences” from systems.</p>\n<p>In <em>A New Kind of Science</em>, there’s a short note about <a href='https://www.wolframscience.com/nks/notes-5-6--multiway-systems-based-on-numbers/'>multiway systems based on numbers</a>. And once again, in fall 2021 I expanded on this to produce an <a href='https://www.wolframphysics.org/bulletins/2021/10/multicomputation-with-numbers-the-case-of-simple-multiway-systems/' target=_blank rel=noopener>extensive study of such systems</a>, as a certain kind of very minimal example of multicomputation, that at least in some cases connects with traditional mathematical ideas.</p>\n<p>From the vantage point of multicomputation and our Physics Project it’s interesting to look back at <em>A New Kind of Science</em>, and see some of what it describes with more clarity. In the fall of 2021, for example, I <a href='https://writings.stephenwolfram.com/2021/09/charting-a-course-for-complexity-metamodeling-ruliology-and-more/'>reviewed what had become of the original goal of &#8220;understanding complexity&#8221;</a>, and what methodological ideas had emerged from that effort. I identified two primary ones, which I called “<a href='https://writings.stephenwolfram.com/2021/09/charting-a-course-for-complexity-metamodeling-ruliology-and-more/#the-pure-basic-science-of-ruliology'>ruliology</a>” and “<a href='https://writings.stephenwolfram.com/2021/09/charting-a-course-for-complexity-metamodeling-ruliology-and-more/#metamodeling-and-the-metatheory-of-models'>metamodeling</a>”. Ruliology, as I’ve mentioned above, is my new name for the pure, basic science of studying the behavior of systems with simple rules: in effect, it’s the science of exploring the computational universe.</p>\n<p>Metamodeling is the key to making connections to systems in nature and elsewhere that one wants to study. Its goal is to find the “minimal models for models”. Often there are existing models for systems. But the question is what the ultimate essence of those models is. Can everything be reduced to a cellular automaton? Or a multiway system? What is the <a href='https://www.wolframscience.com/nks/chap-8--implications-for-everyday-systems#sect-8-1--issues-of-modelling'>minimal &#8220;computational essence&#8221; of a system</a>? And as we begin to <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/#potential-application-areas'>apply the multicomputational paradigm to different fields</a>, a key step will be metamodeling. </p>\n<p>Ruliology and metamodeling are in a sense already core concepts in <em>A New Kind of Science</em>, though not under those names. Observer theory is much less explicitly covered. And many concepts—like <a href='https://www.wolframphysics.org/technical-introduction/the-updating-process-for-string-substitution-systems/the-concept-of-branchial-graphs/' target=_blank rel=noopener>branchial space</a>, <a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/#the-formal-structure-of-multicomputation'>token-event graphs</a>, the <a href='https://www.wolframphysics.org/technical-introduction/the-updating-process-for-string-substitution-systems/the-relationship-between-graphs-and-the-multiway-causal-graph/' target=_blank rel=noopener>multiway causal graph</a> and <a href='https://writings.stephenwolfram.com/2021/11/the-concept-of-the-ruliad/'>the ruliad</a>—have only emerged now, with the Physics Project and the arrival of the multicomputational paradigm. </p>\n<p><a href='https://writings.stephenwolfram.com/2021/09/multicomputation-a-fourth-paradigm-for-theoretical-science/'>Multicomputation</a>, the <a href='https://www.wolframphysics.org/' target=_blank rel=noopener>Physics Project</a> and the <a href='https://www.wolframscience.com/metamathematics/'>Metamathematics Project</a> are sowing their own seeds. But there are still many more seeds to harvest even from <em>A New Kind of Science</em>. And just as the multicomputational paradigm was not something that I, for one, could foresee from <em>A New Kind of Science</em>, no doubt there will in time be other major new directions that will emerge. But, needless to say, one should expect that it will be computationally irreducible to determine what will happen: a metacontribution of the science to the consideration of its own future. </p>\n<h2 id='the-doing-of-science'>The Doing of Science</h2>\n<p>The creation of <em>A New Kind of Science</em> <a href='https://writings.stephenwolfram.com/2022/05/the-making-of-a-new-kind-of-science/'>took me a decade of intense work</a>, none of which saw the light of day until the moment the book was published on May 14, 2002. Returning to basic science 17 years later the world had changed and it was possible for me to adopt a quite different approach, in a sense making the process of doing science as open and incremental as possible.</p>\n<p style=\"display: inline-block;float: right;padding: 0px;margin: 0px;\"><img title=\"\" class=\"bookpost\" src=\"https://content.wolfram.com/uploads/sites/43/2022/05/9-inset-wolfram-language.png\" alt=\"\" width=\"127\" height=\"126\" style=\"margin: 0px; padding: 0px;\"></a></p>\n<p>It’s helped that there’s the web, <a href='https://wolframcloud.com' target=_blank rel=noopener>the cloud</a> and <a href='https://www.stephenwolfram.com/livestreams'>livestreaming</a>. But in a sense the most crucial element has been the <a href='https://www.wolfram.com/language/'>Wolfram Language</a>, and its <a href='https://writings.stephenwolfram.com/2019/05/what-weve-built-is-a-computational-language-and-thats-very-important/'>character as a full-scale computational language</a>. Yes, I use English to tell the story of what we’re doing. But fundamentally I’m doing science in the Wolfram Language, using it both as a practical tool, and as a medium for organizing my thoughts, and sharing and communicating what I’m doing.</p>\n<p>Starting in 2003, we’ve had an annual <a href='https://education.wolfram.com/summer-school'>Wolfram Summer School</a> at which a long string of talented students have explored ideas based on <em>A New Kind of Science</em>, always through the medium of the Wolfram Language. In the last couple of years we’ve added a <a href='https://education.wolfram.com/summer-school/programs/physics/'>Physics track</a>, connected to the Physics Project, and this year we’re adding a Metamathematics track, connected to the Metamathematics Project.</p>\n<p>During the 17 years that I wasn’t focused on basic science, I was doing technology development. And I think it’s fair to say that at <a href='https://www.wolfram.com/'>Wolfram Research</a> over the past 35 years we’ve created a remarkably effective “machine” for doing innovative research and development. Mostly it’s been producing <a href='https://www.wolfram.com/technologies'>technology</a> and <a href='https://www.wolfram.com/products'>products</a>. But one of the very interesting features of the Physics Project and the projects that have followed it is that we’ve been applying the same managed approach to innovation to them that we have been using so successfully for so many years at our company. And I consider the results to be quite spectacular: in a matter of weeks or months I think we’ve managed to deliver what might otherwise have taken years, if it could have been done at all. </p>\n<p>And particularly with the arrival of the multicomputational paradigm there’s quite a challenge. There are a huge number of exceptionally promising directions to follow, that have the potential to deliver revolutionary results. And with our concepts of managed research, open science and broad connection to talent it should be possible to make great progress even fairly quickly. But to do so requires significant scaling up of our efforts so far, which is why we’re now <a href='https://writings.stephenwolfram.com/2022/04/weve-got-a-science-opportunity-overload-its-time-to-launch-the-wolfram-institute/'>launching the Wolfram Institute</a> to serve as a focal point for these efforts.</p>\n<p>When I think about <em>A New Kind of Science</em>, I can’t help but be struck by all the things that had to align to make it possible. My early experiences in science and technology, the personal environment I’d created—and the tools I built. I wondered at the time whether the five years I took “away from basic science” to <a href='https://www.wolfram.com/mathematica/scrapbook/'>launch Mathematica</a> and what’s now the Wolfram Language might have slowed down what became <em>A New Kind of Science</em>. Looking back I can say that the answer was definitively no. Because without the Wolfram Language the creation of <em>A New Kind of Science</em> would have needed “not just a decade”, but likely more than a lifetime. </p>\n<p>And a similar pattern has repeated now, though even more so. The Physics Project and everything that has developed from it has been made possible by a tower of specific circumstances that stretch back nearly half a century—including my 17-year hiatus from basic science. Had all these circumstances not aligned, it is hard to say when something like the Physics Project would have happened, but my guess is that it would have been at least a significant part of a century away. </p>\n<p>It is a lesson of the history of science that the <a href='https://writings.stephenwolfram.com/2012/05/living-a-paradigm-shift-looking-back-on-reactions-to-a-new-kind-of-science/'>absorption of major new paradigms</a> is a slow process. And normally the timescales are long compared to the 20 years since <em>A New Kind of Science</em> was published. But in a sense we’ve managed to jump far ahead of schedule with the Physics Project and with the development of the multicomputational paradigm. Five years ago, when I <a href='https://writings.stephenwolfram.com/2017/05/a-new-kind-of-science-a-15-year-view/'>summarized the first 15 years of <em>A New Kind of Science</a></em> I had no idea that any of this would happen. </p>\n<p>But now that it has—and with all the methodology we’ve developed for getting science done—it feels as if we have a certain obligation to see just what can be achieved. And to see just what can be built in the years to come on the foundations laid down by <em>A New Kind of Science</em>. </p>\n",
  "wfw:commentRss": "https://writings.stephenwolfram.com/2022/05/twenty-years-later-the-surprising-greater-implications-of-a-new-kind-of-science/feed/",
  "slash:comments": 3
}