{
  "title": "108 - Peter Gray (Free-Range Childhood)",
  "description": "<p>Peter Gray is an American psychologist who currently occupies the position of research professor of psychology at Boston College. He is the author of a widely used introductory psychology textbook, Psychology, now in its sixth edition. The book broke new ground when the first edition was published (in 1991) as the first general introductory psychology textbook that brought a Darwinian perspective to the entire field. He is also author of <em><a href=\"http://www.amazon.com/Free-Learn-Unleashing-Instinct-Self-Reliant/dp/0465025994/ref=sr_1_1?ie=UTF8&qid=1421370498&sr=8-1&keywords=peter+gray\" target=\"_blank\">Free to Learn: Why Unleashing the Instinct to Play Will Make Our Children Happier, More Self-Reliant, and Better Students for Life</a></em> (Basic Books, 2013), and he writes a popular blog for Psychology Today magazine entitled \"<a href=\"http://www.psychologytoday.com/blog/freedom-learn\" target=\"_blank\">Freedom to Learn</a>.\"</p><br/><p>Gray is a well-known critic of our standard educational system who is frequently invited to speak to groups of parents, educators, and researchers about children’s needs for free play, the psychological damage inflicted on children through our present methods of schooling, and the ways in which children are designed, by natural selection, to control their own education. Along with a group of other concerned citizens, he has created a website, <a href=\"http://alternativestoschool.com\" class=\"linkified\" target=\"_blank\">AlternativesToSchool.com</a>, aimed at helping families find alternative, more natural, routes to education. (From the Wikipedia profile of Peter)</p> <br/><br/>This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit <a href=\"https://chrisryan.substack.com/subscribe?utm_medium=podcast&utm_campaign=CTA_2\">chrisryan.substack.com/subscribe</a>",
  "link": "https://chrisryan.substack.com/p/108-peter-gray-free-range-childhood-453",
  "guid": "b524793a7e6e0c23bc6840fa7a9145b0",
  "dc:creator": "Chris Ryan",
  "pubDate": "Mon, 19 Jan 2015 14:00:00 GMT",
  "enclosure": "",
  "itunes:author": "Chris Ryan",
  "itunes:subtitle": "Peter Gray is an American psychologist who currently occupies the position of research professor of psychology at Boston College. He is the author of a widely used introductory psychology textbook, Psychology, now in its sixth edition. The book broke...",
  "itunes:explicit": "No",
  "itunes:duration": 5041,
  "itunes:image": ""
}