{
  "title": "Episode #195: The Betting Man Returns",
  "link": "https://audioboom.com/posts/7337564",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5521,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>We discuss all the latest Wizarding World theme park news a bit more.</li>\n<li>Listen to our MuggleMiniCast and read Eric’s reviews for more!</li>\n<li>Andrew visited the Deathly Hallows set but can’t say much at all.</li>\n<li>Emma Thompson is back for Deathly Hallows! How’d they convince her?</li>\n<li>Deathly Hallows footage screened at ShoWest – why they showed it to them and not us (the fans).</li>\n<li>Why on earth is Bloomsbury re-releasing the Potter books this soon?</li>\n<li>Chapter by Chapter covers Chapters 13 – 15 of Prisoner of Azkaban.</li>\n<li>Our first look at the love between Harry and Cho.</li>\n<li>How could Draco and co. have been so stupid?</li>\n<li>Why does Ron refuse to let go of his grudge against Hermione?</li>\n<li>We analyze Sirius’ actions in this latest attack.</li>\n<li>Snape starts to reveal some history between him and James – we bask in it.</li>\n<li>Hermione’s anger towards Trelawney and vise versa – is it all justified?</li>\n<li>Listeners write in with what they think our patronous’ would be.</li>\n<li>MuggleMail address last episode’s hot topics.</li>\n<li>Eric makes a new friends and tries to taking it to the next level.</li>\n<li>Chicken Soup for the MuggleCast Soul.</li>\n<li>We’ll be hosting a live podcast and more at Infinitus 2010.</li>\n<li>Andrew talks about MuggleCast’s new regular release schedule.</li>\n<li>This week’s episode of MuggleCast is sponsored by <a href=\"http://AudiblePodcast.com/MuggleCast\">AudiblePodcast.com/MuggleCast</a>!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Thu, 01 Apr 2010 00:00:00 +0000",
  "guid": "tag:audioboom.com,2019-08-09:/posts/7337564",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}