{
  "id": "https://bibleinoneyear.org/en/youth/255",
  "title": "Day 255: How to Stay on God’s Paths",
  "description": "Psalm 107:1–9, Isaiah 29:13–16, 30:1-18, 2 Corinthians 12:19-21.  The signs on the Italian Riviera were erected to keep people safe  The words of Jesus, the New Testament and the Bible as a whole, are designed to keep us on the path that leads to life",
  "pubDate": "Sun, 12 Sep 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/255/?ignore",
  "itunes:duration": "14:42",
  "guid": "enyouth12092021-255",
  "length": 882.83,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 255: How to Stay on God’s Paths",
  "itunes:subtitle": "Psalm 107:1–9, Isaiah 29:13–16, 30:1-18, 2 Corinthians 12:19-21.  The signs on the Italian Riviera were erected to keep people safe  The words of Jesus, the New Testament and the Bible as a whole, are designed to keep us on the path that leads to life",
  "itunes:summary": "I remember reading, years ago, about an incident that occurred on the Italian Riviera. A young man was driving his sports car along a road near the sea. It was a beautiful and scenic route. But the road was not what it seemed.\nAll along the way were warning signs. Yet, to the young man, the road seemed perfectly good. Disaster awaited him. A landslide had recently created a precipice. No one should have been on that road. He continued at great speed. He ignored all the warning signs. He went straight over the cliff.\nSometimes we are not sure where a path will lead. At other times, we are well aware of where it leads but choose to follow it nevertheless.\nJesus said that there is a path that leads to life. There is also a path that leads to destruction (Matthew 7:13–14). Warning signs are not put up as a threat, but out of love. The signs on the Italian Riviera were erected to keep people safe. The words of Jesus, the New Testament and the Bible as a whole, are designed to keep us on the path that leads to life.\nHow do you make sure that you are on the right path? Once you are on that path, how do you stay on it?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 255
}