{
  "title": "EPISODE 93: The Beast of Gevaudan",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Wed, 17 Aug 2022 18:00:00 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2022/8/15/episode-93-the-beast-of-gevaudan",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:62fab3f85b501b0e16f5cb8c",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/3ec1098e-94c5-4107-9f89-6be6db282e58/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"62fab978d04f611aec2cc3ed\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/3ec1098e-94c5-4107-9f89-6be6db282e58/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“This animal is a monster whose father is a lion; it remains open what the mother is.”</em> — Jean-Baptiste Boulanger Duhamel</p><p class=\"\"><em>“I would be tempted to imagine that we are dealing with a witch, or the devil in person, if only I could believe it.” —</em> Jean-Baptiste Boulanger Duhamel</p><p class=\"\">It’s the 1760s, in the Gevaudan area of South Central France. Imagine being a kid. Maybe 12 years old. Maybe as young as 8. You have heard the rumors. Maybe, you saw the mangled bodies. There’s a monster out there. A monster that hunts people and eats them. It has killed people in the woods, on the pastures, and even just a few feet out of their homes. Time and time again, the men have gone out to try to put an end to the monster’s reign of terror, but time and time again the monster has outsmarted them. Some say it’s an animal that escaped a private zoo—a lion or a hyena, or something else you have never seen. Some people say it’s a giant wolf. Some say a demon that can’t be killed by bullets. Maybe, it’s a werewolf.&nbsp;</p><p class=\"\">Just knowing that this monster wanders the countryside, right around your village… that would be terrifying. With this bloodthirsty beast roaming around, the door to your house doesn’t seem that solid anymore, and any suspicious noise outside can make you jump. So, it’s more than legitimate for you to think this is scary. But the reality is that this is nothing. Things don’t get truly scary until you take into account the fact that someone has to go outside and take care of the animals. And I don’t mean simply walking to the barn a few yards away from your house. I mean having to leave the relative safety of your home, go out there in the forest, and take them to the pastures, possibly for days at a time. Authorities have been warning people to stay home. Yeah… right… that’s a sweet concept but is practically impossible. If you stay home, your whole family starves. Your father and mother have other jobs that require their presence on the land. Taking animals to pasture… that’s your job. If you are lucky, you get to band with few other friends your age, and tend to the animals together, while you pray that the monster doesn’t choose to come for you. Think about being a 10-year old kid, and that’s your lot in life.&nbsp;</p><p class=\"\">This is the story of a monster that killed in the neighborhood of 100 people during the 1760s in France as well as the story of the men sent to hunt it. In the course of this episode, we’ll tackle the entire saga of the monster’s reign of terror, the mystery of the monster’s identity, and the role that the press played in shaping the events. Honorable mentions to the film <em>Brotherhood of the Wolf</em>, Georges St. Pierre, Alan Watts & The Wisdom of Insecurity. &nbsp;</p><p class=\"\">If you feel generous and enjoy History on Fire, please consider joining my Patreon at <a href=\"https://www.patreon.com/historyonfire\">https://www.patreon.com/historyonfire</a> to access plenty of bonus content.&nbsp;</p><p class=\"\">If you’d like to go to Japan for a historical tour with yours truly as a guide, please check out <a href=\"https://geeknationtours.com/tours/signature-battlefield-series-classic-samurai-from-the-gempei-war-to-the-mongol-invasions-2023/\">https://geeknationtours.com/tours/signature-battlefield-series-classic-samurai-from-the-gempei-war-to-the-mongol-invasions-2023/</a></p><p class=\"\">Big thank you to Athletic Greens for sponsoring this episode. Athletic Greens is going to give you a FREE 1 year supply of immune-supporting Vitamin D AND 5 FREE travel packs with your first purchase. All you have to do is visit <a href=\"https://athleticgreens.com/HOF\">https://athleticgreens.com/HOF</a><strong><em>&nbsp;</em></strong></p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 93,
  "itunes:title": "EPISODE 93: The Beast of Gevaudan",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 93: The Beast of Gevaudan"
  }
}