{
  "title": "Telework, Childcare, and Mothers’ Labor Supply",
  "link": "https://fedinprint.org/item/fedmoi/93472/original",
  "description": "We study the impact of increased pandemic-related childcare responsibilities on custodial mothers by telework compatibility of their job. We estimate changes in employment outcomes of these mothers in a difference-in-difference framework relative to prime-age women without children and a triple-difference framework relative to prime-age custodial fathers. Mothers' labor force participation decreased between 0.1 to 1.5 percentage points (ppts) relative to women without dependent children and 0.3 to 2.0 ppts compared to custodial fathers. Conditional on being in the labor force, the probability of being unemployed fell by 0.7 ppts relative to childless women. Conditional on being employed, leave take-up increased by 0.7 ppts. These patterns were especially prominent among custodial mothers with a college degree or higher in telework-compatible jobs. Compared to women without children, mothers working as teachers and white-collar workers disproportionately left the labor market at the end of the 2020-2021 virtual school year. These mothers likely struggled balancing remote work while simultaneously supporting their children's virtual schooling needs. The disparity between mothers and fathers widened over time, indicating the prevalence of inequality in sharing household duties even today. By the start of the 2021-2022 school year, eighteen months after the pandemic began, mothers' employment was still adversely impacted by childcare disruptions. Our findings emphasize that while flexible work has been shown to increase women's labor supply, it is not sufficient to ensure continued and increasing levels of women's labor force participation if accessible and affordable childcare is unavailable while they work for pay.",
  "guid": "https://fedinprint.org/item/fedmoi/93472/original",
  "dc:creator": "Heggeness, Misty; Suri, Palak",
  "dc:date": "2021-11-16",
  "rdau:hasExtent": 53,
  "dc:subject": "Labor supply; Gender telework; Difference-in-difference",
  "swpo:hasNumber": 52,
  "identifiers:doi": "10.21034/iwp.52",
  "bibo:series": "Opportunity and Inclusive Growth Institute Working Papers"
}