{
  "id": "yt:video:7YjY00Cd_MI",
  "yt:videoId": "7YjY00Cd_MI",
  "yt:channelId": "UCqnbDFdCpuN8CMEg0VuEBqA",
  "title": "The Real Threat to American Democracy | NYT Opinion",
  "link": "",
  "author": {
    "name": "The New York Times",
    "uri": "https://www.youtube.com/channel/UCqnbDFdCpuN8CMEg0VuEBqA"
  },
  "published": "2022-09-21T14:00:04+00:00",
  "updated": "2022-10-16T18:08:43+00:00",
  "media:group": {
    "media:title": "The Real Threat to American Democracy | NYT Opinion",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "For the past two years, Americans have been overwhelmed by a deluge of headlines suggesting democracy in the United States is under threat: Voter suppression. A shortage of drop boxes. Election deniers seeking key state offices. It can be difficult to gauge what stories suggest a truly terrifying threat to democracy, and which are simply disheartening or even petty. The Opinion Video film above aims to unpack one of the most dire threats to democracy, which includes a sophisticated plot to control not only who can vote, but which votes get counted.\n\nOne thing is certain: The 2020 race was not stolen. But Mr. Trump and his Republican enablers have been working to rig future elections to their advantage. (Of course it’s the people shrieking most loudly about fraud that you really need to watch.) The former president has convinced his followers that the electoral system has been so corrupted that the only way to save America is for MAGA patriots to take over the system to ensure that the “right” candidates win going forward. His allies have been busy engineering such a legal takeover, and key pieces of the plan are already in place.\n\nIn this short film, we shine a light on those machinations, so that those who care about democracy can act to stop them.\n\nFor our Democracy to survive, we need to agree on a shared reality and for the losers — that is those who lose in honest and fair elections — to accept defeat.\n&#13;\nSubscribe: http://bit.ly/U8Ys7n&#13;\nMore from The New York Times Video:  http://nytimes.com/video&#13;\n----------&#13;\nWhether it's reporting on conflicts abroad and political divisions at home, or covering the latest style trends and scientific developments, New York Times video journalists provide a revealing and unforgettable view of the world. It's all the news that's fit to watch.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}