{
  "id": "yt:video:xDq7vBuJaOk",
  "yt:videoId": "xDq7vBuJaOk",
  "yt:channelId": "UCkLHy_jxeaHTZCfGalg6QaA",
  "title": "Preventing and Responding to Workplace Violence",
  "link": "",
  "author": {
    "name": "Conn Maciel Carey LLP",
    "uri": "https://www.youtube.com/channel/UCkLHy_jxeaHTZCfGalg6QaA"
  },
  "published": "2022-10-14T14:28:22+00:00",
  "updated": "2022-10-15T13:25:23+00:00",
  "media:group": {
    "media:title": "Preventing and Responding to Workplace Violence",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "In 2020, physical assault was identified as the 4th leading cause of workplace deaths. Nearly 2 million American workers experience violent acts at work annually. As the COVID-19 pandemic appears to be entering the endemic phase and workers begin to transition back into the workplace, experts predict even more of an increase in workplace violence. Thus, employers will want to be prepared to prevent these types of incidents and protect their employees to the extent possible, as well as ensure they are doing all that’s required from a regulatory standpoint.\n\nWorkplace violence has been a focus for both the Occupational Safety and Health Administration (“OSHA”) and the Equal Employment Opportunity Commission (“EEOC”) well before the pandemic and remains so now. While OSHA has no specific standard for workplace violence, the OSH Act's General Duty Clause requires employers to provide a workplace free from recognized serious hazards, and OSHA has instituted enforcement actions under its General Duty Clause after incidents of workplace violence. OSHA has also initiated a rulemaking to address workplace violence in specific industries. For its part, the EEOC has also prioritized ways to effectively prevent and address workplace violence, particularly in the form of workplace harassment. And outside of OSHA and the EEOC, employers can also be held liable for workplace violence through other claims such as negligent hiring and supervision.\n\nIn this webinar, attendees learned:\n\n• What constitutes workplace violence\n• EEOC and OSHA enforcement priorities related to workplace violence\n• Best practices for workplace violence prevention\n• Tips for responding to a workplace violence incident in your work environment\n\nA webinar from Conn Maciel Carey LLP.\n\nUse of this video does not in any manner constitute or establish an attorney-client relationship between Conn Maciel Carey and the viewer. This video may be deemed \"attorney advertising\" in jurisdictions from which it is accessed. The decision to hire a lawyer is a serious one and should be undertaken after consideration of all relevant information, not only information on this video.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}