{
  "title": "S1E48 - How to Have a Championship Mindset with Chad Busick",
  "guid": "https://pinecast.com/guid/1cd32bb3-11ea-4359-a356-f5d70d6dab6d",
  "pubDate": "Tue, 22 Jun 2021 06:30:00 -0000",
  "itunes:duration": "00:55:53",
  "description": "<p>Joining Laura on the podcast this week is Chad Busick, owner of Championship Mindset, an organization that works with both corporate and athletic teams. Chad is a Master Facilitator with Advance Sports Technology, working with college teams at the DI, DII, DIII and NAIA levels as well as high school and competitive teams across various sports. In addition, he is a certified trainer for The Power of Positive Leadership training with The Jon Gordon Companies.  Chad is also the host of ‘The Championship Mindset Podcast’ as well as the author of his new book, The Rock Tumbler. \n \nLaura begins by sharing some exciting information about her own new book, and then Chad details his background and his journey to the work he does now, including some of the principles and techniques he employs in that work. Along the way, he shares a number of excellent resources and examples of his philosophy in action, offers valuable advice to athletes and parents alike, and provides a glimpse into his new book. As you will hear, Laura resonates with so much of Chad’s work, and you will undoubtedly do the same with the many lessons revealed here today regarding the world of sport, and, indeed, life in general.</p>\n<p>Episode Highlights:    \n </p>\n<ul>\n<li>Laura’s new book</li>\n<li>Chad’s background and his journey to the work he does now</li>\n<li>The Ten Principles of Entelechy and sports mindset</li>\n<li>His Championship Mindset brand and company</li>\n<li>The hardest part of achieving the championship mindset</li>\n<li>Emotional safety</li>\n<li>‘Taking change by the hand’ during the pandemic</li>\n<li>Jon Gordon’s The Power of Positive Leadership</li>\n<li>Mark Batterson’s Win the Day</li>\n<li>Chad’s Championship Mindset chart and how to apply it</li>\n<li>Working with a team vs. working with an individual</li>\n<li>Chad’s The Rock Tumbler and his favorite lessons from it</li>\n<li>His advice regarding parental involvement</li>\n<li>Jessica Lahey’s The Gift of Failure</li>\n</ul>\n<p>Quotes: \n  </p>\n<ul>\n<li>“It's the seven fundamentals of mental fitness. I've been a master facilitator with that for the last six or seven years, which has led me now to start my own company called Championship Mindset, and a lot of other things.”</li>\n<li>“Whether we're working with corporate clients, whether we're working with athletes, coaches, teams, it's really just focusing on helping them be the best that they can be.”</li>\n<li>“This championship mindset is the formula for success in all areas of our lives.”</li>\n<li>“At the end of the day, it really comes down to our talent, our hard work, our attitude, our mental toughness, our teamwork, and our passion into everything that we do.”</li>\n<li>“The things that I've learned through diving are the very things that helped me in my life outside of the pool.”</li>\n<li>“I would say everything for me starts with culture, we have to have the right culture.”</li>\n<li>“The first thing that we have to build is we have to build emotional safety.”</li>\n<li>“Players don't care about how much you know, until they know about how much you care about them.”</li>\n<li>“When we really think about what we've gone through this last 14 to 16 months, what we've really been doing is, we've been grieving.”</li>\n<li>“Just be there for your students be there for your players in this moment.”</li>\n<li>“It's okay to grieve the dream, but don't stay there.”</li>\n<li>“Regardless of those tough events that we go through, we still get to choose how we respond.”</li>\n<li>“How you do anything is how you do everything - and to me, that's the core of the championship mindset.”</li>\n<li>“How we view the world and more importantly, how we interact with the world, greatly affects what you get out of the world.”</li>\n<li>“If you have to go through it, you might as well grow through it.”</li>\n<li>“Own your journey, it's your journey, own it to the best that you can.”</li>\n<li>“We need to let our kids fail.”</li>\n<li>“The most powerful thing that you can say to your athlete when they're done competing is, ‘I love watching you compete. I love watching you play.’ ”</li>\n</ul>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold Homepage</a>\n<a href=\"https://www.amazon.com/Life-10-Meters-Lessons-Champion/dp/B096CQW2L7/ref=sr_1_3?crid=2AXVGI3HL987J&dchild=1&keywords=laura+wilkinson+life+at+10+meters&qid=1624113646&sprefix=Laura+Wilkinson%2Caps%2C227&sr=8-3\" rel=\"nofollow\">Life at 10 Meters: Lessons from an Olympic Champion</a>\n<a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">5 Smart Strategies to Confidence</a>\n<a href=\"https://laurawilkinson.mykajabi.com/email-capture-0d05ebf5-739d-43b0-a4ab-5f4ea91a24e6\" rel=\"nofollow\">Conquer Your Fear in 5 Days</a>                \n \nLaura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura's Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura's Facebook page</a>\n \n \nConnect with Chad:\n \n<a href=\"https://championshipmindset.net/\" rel=\"nofollow\">Champion Mindset Homepage</a>\n \n<a href=\"https://championshipmindset.net/the-rock-tumbler/\" rel=\"nofollow\">The Rock Tumbler</a>\n \n<a href=\"https://linktr.ee/championshipmindset\" rel=\"nofollow\">Championship Mindset Linktree</a>\n \n<a href=\"https://championship-mindset.simplecast.com/\" rel=\"nofollow\">Championship Mindset Podcast</a>\n \n<a href=\"https://twitter.com/champ_mindset?lang=en\" rel=\"nofollow\">Championship Mindset Twitter</a>\n \n<a href=\"https://www.facebook.com/ChampionshipMindsetLLC/\" rel=\"nofollow\">Championship Mindset Facebook</a>\n \n<a href=\"https://www.instagram.com/ChampionshipMindsetLLC/\" rel=\"nofollow\">Championship Mindset Instagram</a>\n \n \nResources:\n \n<a href=\"https://jongordon.com/books/positiveleadership/\" rel=\"nofollow\">The Power of Positive Leadership</a>\n \n<a href=\"https://www.jessicalahey.com/the-gift-of-failure/\" rel=\"nofollow\">The Gift of Failure</a>\n \n<a href=\"https://www.markbatterson.com/books/wintheday/\" rel=\"nofollow\">Win the Day</a></p>",
  "itunes:title": "How to Have a Championship Mindset with Chad Busick",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 48
}