{
  "published": "2022-11-02T18:40:00-04:00",
  "updated": "2022-11-02T18:40:00-04:00",
  "title": "Netanyahu and the far right have triumphed. Here’s what it means for Israel.",
  "content": "<figure>\n      <img alt=\"Benjamin Netanyahu speaking from a stage behind which is a large picture of his face and pointing finger.\" src=\"https://cdn.vox-cdn.com/thumbor/BtDRkXRhCRYvSwcrCyBE6NZo46M=/0x0:4000x3000/1310x983/cdn.vox-cdn.com/uploads/chorus_image/image/71577217/1244329512.0.jpg\" />\n        <figcaption>Former Israeli Prime Minister and Likud party leader Benjamin Netanyahu speaks to supporters through inside a modified truck with a side bulletproof glass during a campaign event on October 29, 2022 in Bnei Brak. | Amir Levy/Getty Images</figcaption>\n    </figure>\n\n  <p>The radical rightward shift of the Israeli body politic, explained by an expert.</p> <p id=\"RtvWja\">As votes are being tabulated in Israel’s fifth election since 2019, Benjamin Netanyahu’s coalition has taken the lead, meaning he is likely the country’s next leader. He’s been prime minister several times before, but there’s something different this time — and it’s not only that he’s under investigation for <a href=\"https://www.vox.com/policy-and-politics/2019/11/21/20974465/benjamin-netanyahu-indicted-bribery-corruption\">serious corruption charges</a>.</p>\n<p id=\"ojdZ4o\">Bibi Netanyahu is poised to lead a coalition that is more ideologically unified and further to the extreme right than previous coalitions he’s led. His Likud party has become more radical, and so have the parties it’s willing to build a government with. Some members of his likely parliamentary majority believe in Jewish supremacy and support racist policies that may ultimately change the way the state of Israel protects the rights of its citizens, whether Palestinians who hold citizenship or leftists, activists, and critics who seek equal rights for Palestinians in the occupied territory.</p>\n<p id=\"ZndbYi\">The other big winner is Itamar Ben-Gvir of the Jewish Strength Party, who is a keystone of Netanyahu’s parliamentary coalition and a radical lawyer who espouses a <a href=\"https://jewishcurrents.org/kahanisms-raucous-return\">Kahanist worldview</a> (Rabbi Meir Kahane was an American-born extremist ideologue who was an Israeli parliamentarian in the 1980s).</p>\n<p id=\"H1gSoD\">To understand the complexity of the Knesset — Israel’s parliamentary system — and its radical shift toward extremism, I spoke with Daniel Levy, a keen observer of Israeli politics and former negotiator for the Israeli government in its peace talks with the Palestine Liberation Organization. He’s currently the president of the <a href=\"https://www.usmep.us/\">US/Middle East Project</a>. </p>\n<p id=\"2L53wK\">Levy’s major takeaway: “It’s important to not fall into the trap of just seeing this as an aberration. It might be an ‘upgrade’ in extremism, but I think it’s correct to place this on a continuum of the absorption into Israeli politics of the most extreme.”</p>\n<p id=\"fROsmZ\">Netanyahu and President Joe Biden, it also might be noted, have a long history. One of my first jobs out of college, in 2009, was working as a researcher on Levy’s team at a think tank, as we thought through how then-President Barack Obama might approach Israel-Palestine. The rockiness of the Obama-Netanyahu relationship cannot be understated. Obama sought a partial freeze of Israeli settlement growth in the occupied West Bank, but when then-Vice President Biden arrived on a trip to Israel, Netanyahu <a href=\"https://www.nytimes.com/2010/03/10/world/middleeast/10biden.html\">snubbed him</a> and US policy by announcing the expansion of new settlement building in East Jerusalem. </p>\n<p id=\"7EgKVs\">I asked Levy about what another Netanyahu premiership would mean for America’s relationship with Israel, its closest Middle East partner. Though the prospects for an <a href=\"https://www.vox.com/world/2022/11/1/23434741/israel-election-palestine-under-siege-lions-den\">independent and viable Palestinian state seem less likely than ever</a>, Levy offered a small dose of optimism. Since Biden has already visited Israel as president, he may have the clout and the cred to offer hard truths to an Israel whose policies toward Palestinians in the occupied territories and its own citizens are increasingly beyond the pale and in contradiction of human rights, let alone American values. It remains unlikely, however, as Biden did no such thing publicly on his trip to Israel in July.  </p>\n<p id=\"6pckTJ\">Levy also discussed where the Israeli left has gone, the role of Palestinian voters and parties, and what all this might mean for the policies of the emerging Israeli government. Our conversation has been lightly edited for length and clarity.</p>\n<h4 id=\"0bwz8u\">Jonathan Guyer</h4>\n<p id=\"Gov3Sj\">This is Netanyahu’s umpteenth time as prime minister. What’s going to be different this time?</p>\n<h4 id=\"5PydG1\">Daniel Levy  </h4>\n<p id=\"fABK0c\">First, we just have to acknowledge that he’s returning to the premiership at a quite advanced stage of court cases proceeding, where he’s had to spend time in court [defending himself against corruption charges]. Those carry on. He’s not going to come in blundering on this, but it needs to be resolved. </p>\n<p id=\"UCatHj\">He has a coalition that will be a partner in resolving it. I don’t know exactly what the resolution of it looks like. It could be as simple as — not him, but one of the coalition allies — proposing immunity for the prime minister. Quite literally, his return to the prime minister’s office is his get-out-of-jail card. Whether it’s through legislation, or whether certain personnel are changed, and the file [against him] is revisited — it could be done where the police minister insists that has to be resolved. </p>\n<p id=\"DyfHEm\">Number two, he is likely to have a more ideologically coherent and homogenous government than has been the case for most of his time as prime minister. The nature of his coalition alliance looks different.</p>\n<p id=\"KaupZW\">Netanyahu has tended to favor having bits of his coalition that he can dangle in front of some foreign audiences to say, “Look, you know, these guys are in my government with me.” Yair Lapid’s been there with him before, Benny Gantz has been there with him before, Labor have been there with him before. The line that “I want to do X” — X can be annexation [of occupied Palestinian territory], X can be other steps — “but I don’t have the coalition for it” no longer exists. </p>\n<p id=\"hVMxYn\">What’s more, he has a powerful coalition ally to his right. They have two options. Either they manage to get something passed that hasn’t been passed before, whether it’s changing the status at the Temple Mount, which is very, very high risk; whether it’s laws that have not heretofore been applied in the occupied territories; whether it’s laws against Palestinian citizens of Israel that have not heretofore been applied; whether it’s rescinding of citizenship for people, which is something they’ve talked about, or things that are more directly hostile to Palestinians, perhaps annexation. That’s difficult because you can never sate the appetite, in terms of what should be annexed. </p>\n<p id=\"Bi7iuN\">So they need one of two things, either something they can say, “We’ve delivered,” or that they can turn around and say, “Bibi stopped us.”</p>\n<p id=\"nJh7V3\">The other thing is that Netanyahu has a Likud party made much more in his own image, with very few heavyweight independent actors now, if any.</p>\n<h4 id=\"kQWRqI\">Jonathan Guyer</h4>\n<p id=\"ebT8cy\">What does this coalition look like? What is this more coherent government likely to look like?</p>\n<h4 id=\"C6PpVs\">Daniel Levy</h4>\n<p id=\"yCwsmo\">Israel has a very pure form of proportional representation where the entire country is one district of 120 seats. This is super relevant in this election. As long as you hit a 3.25 percent threshold of support, you get representation in parliament, which means the smallest number of seats a party can get in the 120-seat Knesset is four. Then you build from there. </p>\n<p id=\"3jbES9\">This is unusually small in terms of the number of parties that constitute this coalition. It will be composed of four party “<a href=\"https://m.knesset.gov.il/en/mk/pages/elections.aspx\">lists</a>.”</p>\n<p id=\"PJuGf6\">The Likud party is the traditional party of the right. As the center of gravity of Israeli politics has continually shifted rightward, so too has the Likud party. Likud have no qualms this time around. In the past it was, “Well can we really have been Ben Gvir in the government?” They’ve paved the way for that. There’s no question. No one today is saying, “Well, you know, this party is so extreme.” No one’s questioning it. </p>\n<p id=\"aIHri6\">You have two parties representing the ultra-Orthodox Haredi public, who are the other big winners, by the way. They’ve scored a phenomenal success and increased their numbers. That does tend to happen when your community is having six, seven, eight, nine children per family and everyone else isn’t. So that demography is now manifesting itself in votes. So you have the two ultra-Orthodox factions: one representing the Ashkenazi ultra-Orthodox community, the other representing the Sefardi ultra-Orthodox community. </p>\n<p id=\"BgRJjA\">The fourth party is this amalgamation of hard-right, national-religious extremists, which is known as religious Zionism. </p>\n<h4 id=\"AYQm9i\">Jonathan Guyer</h4>\n<p id=\"VNidqv\">This fourth one<strong> </strong>is the Jewish Strength Party. Tell me about that. Israel has been drifting to the right as long as I can remember. But this is pretty extreme, bigoted, Jewish supremacist, homophobic party that is normalizing the Kahanist worldview.</p>\n<h4 id=\"wcyPJu\">Daniel Levy</h4>\n<p id=\"Fl3znM\">This is now the third-largest party in the Israeli parliament. Just pause on that. </p>\n<p id=\"970IEP\">The third largest party in the Israeli parliament is a party that derives its ideological inspiration from the most extreme strand. Now, the leader of one element of this party is Ben Gvir, who everyone in Israel considers to be the big winner of the election. He’s a lawyer who tends to <a href=\"https://www.france24.com/en/live-news/20221029-ben-gvir-israel-s-powerful-extreme-right-leader\">represent</a> Jewish murderers of Palestinians, <a href=\"https://www.haaretz.com/israel-news/2016-01-04/ty-article/.premium/jewish-terrorisms-star-lawyer/0000017f-eda1-da6f-a77f-fdaff1f00000\">who commit terror acts</a>, not in uniform, as civilians. Just before [Israeli Prime Minister Yitzhak] Rabin’s assassination [at the hands of a Jewish extremist in 1995], he appeared in a famous TV clip with the emblem of Rabin’s car, and he said, “We got to his car, and we’ll get to him, too.” </p>\n  <figure class=\"e-image\">\n        <img alt=\"Protesters stand on and behind police barricades with signs and raised arms.\" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ic3uRmkDDydgJDHtIJkGMi1l-tg=/800x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/24163470/1242882982.jpg\">\n      <cite>Eyad Tawil/Anadolu Agency via Getty Images</cite>\n      <figcaption>Dozens of Jewish settlers led by far-right member of Knesset Itamar Ben Gvir chanted anti-Arab slogans with Israeli flags and raided the village of Nabi Samuel in northwest Jerusalem, September 2.</figcaption>\n  </figure>\n<p id=\"QkKrQk\">He will appear in Palestinian neighborhoods where settlers are trying to move in, brandishing a pistol, using his parliamentary immunity. He has faced 50 criminal charges, of which he has been convicted of 12, including racist incitement and support of a terrorist organization. He’s also been accused of destroying evidence of Israeli attacks against Palestinians, in his role as their lawyer.</p>\n<p id=\"iF1imz\">He has, for instance, proposed that Palestinian citizens of Israel and Jewish leftists be stripped of their citizenship. </p>\n<p id=\"XtEwfS\">He is a serial inciter. He’s the one who would lead the marches where there are chants of “Death to the Arabs.” Last night, at the gathering was “Death to the Terrorists” with a smirk. They’d replaced the Arabs with terrorists, but that’s how they define terrorists, so it’s pretty much the same there. </p>\n<p id=\"BprKh6\">However, it’s important to not fall into the trap of just seeing this as an aberration. It might be an “upgrade” in extremism, but I think it’s correct to place this on a continuum of the absorption into Israeli politics of the most extreme. </p>\n<p id=\"WfvKri\">It’s really important to understand that when Rabbi Meir Kahane came over from America and came into the Knesset, there was a cordon sanitaire built around him — people would literally leave the plenary, Likudnicks would stand up and leave the plenum when he spoke, and then he got banned for being racist. That was almost four decades ago. Since then, the reverse has happened. </p>\n<p id=\"0Q4EJJ\">Since then, you have seen that serial absorption into the Israeli body politic, into Israeli government coalitions.</p>\n<p id=\"vbi7E6\">You have Avigdor Lieberman, who now people say, “Oh, he’s part of normal Israel.” No, Lieberman ran on a card of a loyalty test for citizenship, you had to be loyal to the Jewish state — as a Palestinian citizen of Israel, you had to say “I declare my loyalty not to Israel, but to the Jewish state of Israel.” He gets absorbed.</p>\n<p id=\"7DuNeW\">Naftali Bennett, who is an annexationist, and Ayelet Shaket, who came out with the most horrific racist statements, they get absorbed. </p>\n<p id=\"iIuKlx\">Each time extremism gets absorbed, and each time what happens is the center of gravity shifts further to the right. And we move on. Then the next one gets absorbed, center of gravity shifts further to the right — reset, move on.</p>\n<p id=\"HBppQe\">The permissive environment is the key here. The enabling environment has led to this party [Jewish Strength] getting 14 seats, as things currently stand, and Ben Gvir coming forward. </p>\n<p id=\"bET6Nr\">It’s crucial to look at what was the record, for instance, of the [outgoing] Lapid-Bennett government, and how they have also paved the way to this happening. Lapid does things that I think Bibi would have felt, “Hm, can I get away with this?” in criminalizing Palestinian civil society groups, including a famous human rights organization Al-Haq and others. They issued new regulations, more harsh regulations, on who can study, work, live, love in the West Bank (if your partner is in the West Bank or Gaza). They’ve returned to a policy of extrajudicial assassinations. This is with Labor, with the Zionist left in the government. They do all these things. And of course, what they’re doing is paving the way for more and more extremism. </p>\n<h4 id=\"VQcIvO\">Jonathan Guyer</h4>\n<p id=\"LjXhxr\">Where’s the Israeli left? Is there an Israeli left?</p>\n<h4 id=\"41pFEZ\">Daniel Levy</h4>\n<p id=\"Bv6oRl\">Let’s define our terms, because there is a left Arab party that will be the largest party on the left now, which is Hadash-Ta’al — the Communist Party and the party for renewal. This is a secular left Arab party. </p>\n<p id=\"1uNZej\">The Zionist left, if the current results hold, will be reduced to four seats, which is the remnant of the Labor Party, which is on the threshold of extinction, once you’re at four seats. </p>\n<p id=\"Q3DnHo\">Meretz seems to have dropped off altogether. They went into government with Bennett an avowed annexationist and hard-rightist a year ago. In that government, they did nothing to stand up for equality and human rights in practice. And unfortunately, they have earned their own certificate of extinction. </p>\n<p id=\"qFN2bh\">We have to say another thing, because it would be remiss not to give an honorable mention to the other great enabler of this, which is the impunity accorded Israel day in, day out, year in, year out, no matter what it does, by way of violating international law, violating human rights, violating UN resolutions. Unfortunately, America takes pride of place in that.</p>\n<h4 id=\"P7XxlK\">Jonathan Guyer</h4>\n<p id=\"pRjHYe\">Before we talk about that, what about the Palestinian citizens of Israel? How have they been voting in this election?</p>\n<h4 id=\"xjN0Lh\">Daniel Levy</h4>\n<p id=\"WXADkV\">This has been one of the most interesting stories in this election. You had in the last government something unprecedented, which is a party of Palestinian citizens of Israel that was a full coalition member. That party was an Islamist party, a conservative party, and they basically said — and I’m paraphrasing here — “We don’t really believe in the system, but we want to get the best for our community, and we know we’re not going to win on the Palestinian issue. And let’s set them aside.” They actually said that. They managed to deliver very little for their community. Their inclusion in the government became a rallying cry for the other side. It’s one of the reasons I think extremists did so well in this election. </p>\n<p id=\"PQL05Y\">The other party that didn’t go in [to the government], the Joint List, split. A faction called Balad broke away and ran a fascinating, independent campaign. No one was paying any attention to Balad.</p>\n<p id=\"vSAMz8\">Everyone expected, by the way — because Palestinians rarely see the efficacy of their participation — another very low turnout. We don’t have the numbers yet, but it seems that turnout was quite high. </p>\n<p id=\"VAZIU8\">The Palestinian citizens of Israel voted 13 seat’s worth of members of Knesset. Strange choice of language — why did I choose it? Because it seems that, according to the current statistics, both the party that was in the government, the United Arab List (Ra’am), and the remaining part of the Joint List will get five seats each, and this Balad party has three seats’ worth of votes. They won’t get in. There was an almost richly ironically comic moment during election night, when it seemed like the only way of preventing Netanyahu from forming a government was if Balad would cross the threshold. You had all these Israeli Jews who constantly pillory and spew bile against Balad praying for them to get into the Knesset. </p>\n<p id=\"ZOYS8O\">Why am I mentioning this? Balad ran <em>the</em> campaign of this election in the Arab sector, and they ran on a platform of, “We will not lend a hand or recommend either of these potential leaders, because neither of them stands against the occupation, neither of them believes in equality, neither of them will change the structural discrimination faced by our community.”</p>\n<p id=\"Do0z9l\">They ran this really mobilizing campaign and did way better than anyone expected. Politics will become more interesting in that space in the coming period.</p>\n<h4 id=\"TzXBw3\">Jonathan Guyer</h4>\n<p id=\"QOBSTp\">Back to the question about the US. Netanyahu has this long rapport with Biden. What’s the outlook after this election for US-Israel relations?</p>\n<h4 id=\"L6dzdD\">Daniel Levy</h4>\n<p id=\"4XMjcB\">I do not think the Biden administration wants a fight. </p>\n<p id=\"LpgFYO\">[That said,]<strong> </strong>Netanyahu has a history of playing partisan politics in America. There is still a very bad taste in a lot of people’s mouths in terms of how Bibi treated Obama as a person and the Obama administration. </p>\n<p id=\"FCVxp5\">Of course, you now have a cohort of Democrats who have made clear that they’re not comfortable with the exceptionalism with which Israel is treated in US politics. Throw into the mix how extreme this government is likely to be — no cover from any party that calls itself centrist. Not only are the coalition allies overtly racist, they also are a pretty hard group to sell if you’re in the business of pink-washing, given that they are extremely homophobic and their response to Gay Pride marches was to hold “Beast Pride” marches. </p>\n<p id=\"czCuZj\">But let’s see what happens in the American midterms. Let’s see how much partisan politics Bibi plays.</p>\n<p id=\"cQnuT0\">Sadly, I do not anticipate a real change and a recognition on the American side. By failing permanently to hold Israel accountable, America has played a key role in the permanent denial of Palestinian rights and the creation of a reality which, for significant reasons, the blue-chip human rights organizations have defined as one of an apartheid reality — Human Rights Watch, Amnesty International, following in the wake of B’tselem and others inside Israel, and in the wake of Palestinian human rights groups.</p>\n<p id=\"WFzMDS\">But I would say this, and it’s important: Biden visited Israel in a trip that also took him elsewhere in the region. It was an obsequious visit, but what it did is it put a heckuva lot of credit in the bank. It is very hard to now depict Biden, as you know, “Joseph Hussein Obiden,” who’s an anti-Israel guy. </p>\n<p id=\"ZvKXyw\">He comes with a far greater ability to do so. Let’s see if that is used and if he puts that to the test if he needs to, and I’m pretty damn sure he needs to. We should have done it with the Lapid government.</p>",
  "link": "",
  "id": "https://www.vox.com/2022/11/2/23437462/israel-elections-benjamin-netanyahu-coalition-explained",
  "author": {
    "name": "Jonathan Guyer"
  }
}