{
  "guid": "urn:uuid:024ac370-0724-4d19-bc81-82a7e48ef1e5",
  "link": "https://www.who.int/news/item/08-03-2022-interim-statement-on-covid-19-vaccines-in-the-context-of-the-circulation-of-the-omicron-sars-cov-2-variant-from-the-who-technical-advisory-group-on-covid-19-vaccine-composition-(tag-co-vac)-08-march-2022",
  "a10:author": {
    "a10:name": ""
  },
  "title": "Interim statement on COVID-19 vaccines in the context of the circulation of the Omicron SARS-CoV-2 variant from the WHO Technical Advisory Group on COVID-19 Vaccine Composition (TAG-CO-VAC), 08 March 2022",
  "description": "<p><strong>Key messages:</strong></p><ul><li>The TAG-CO-VAC is reviewing available data to optimize vaccine mediated protection against prevalent circulating variants. The TAG-CO-VAC strongly supports urgent and broad access to current COVID-19 vaccines for primary series and booster doses,\n        particularly for groups at risk of developing severe disease, given that current COVID-19 vaccines continue to provide high levels of protection against severe disease and death, even in the context of the circulation of Omicron.</li><li>However, to ensure COVID-19 vaccines provide optimal protection into the future, they may need to be updated as new, antigenically distinct variants emerge. The updated vaccines may be monovalent targeting the predominant circulating variant, or multivalent\n        based on different variants.</li><li>Ideally, COVID-19 vaccines will prevent infection and transmission, in addition to providing protection against severe disease and death. The development of pan SARS-CoV-2 or pansarbecovirus vaccines, as well as the development of vaccines that are\n        able to elicit mucosal immunity, may be desirable options, but the timeframe for their development and production is uncertain.&nbsp;</li><li>The TAG-CO-VAC continues to encourage COVID-19 vaccine manufacturers to generate and provide data to WHO on performance of current and variant-specific COVID-19 vaccines so that they can be considered as part of a broad decision-making framework on\n        COVID-19 vaccine composition, allowing the TAG-CO-VAC to issue more specific advice to WHO on adjustments needed to COVID-19 vaccine strain composition.</li></ul><p>&nbsp;</p><p>The World Health Organization, with the support of the <a href=\"https://www.who.int/groups/technical-advisory-group-on-covid-19-vaccine-composition-(tag-co-vac)\">Technical Advisory Group on COVID-19 Vaccine Composition (TAG-CO-VAC)</a>,\n continues to review and assess the public health implications of emerging SARS-CoV-2 Variants of Concern (VOC) on the performance of COVID-19 vaccines. Since the publication of the <a href=\"https://www.who.int/news/item/11-01-2022-interim-statement-on-covid-19-vaccines-in-the-context-of-the-circulation-of-the-omicron-sars-cov-2-variant-from-the-who-technical-advisory-group-on-covid-19-vaccine-composition\">interim statement on COVID-19 vaccines </a>on 11 January 2022, Omicron has become the dominant VOC globally,\n    rapidly replacing other circulating variants. This statement highlights the global epidemiological situation, challenges of updating vaccine composition and provides the current position of the TAG-CO-VAC. &nbsp;\n</p><h3>Epidemiological situation</h3><p>The current global epidemiological situation is characterized by rapid and relatively synchronous dominance of Omicron variant in all six WHO regions. While global cases are declining, there are reduced testing resources and capacities in some areas and\n    the epidemiological situation remains heterogeneous, with a number of regions and countries reporting increases in new weekly cases, while others are now reporting declines.</p><p>Omicron is comprised of several genetically related sublineages, including BA.1, BA.2 and BA.3, each of which is being monitored by WHO and partners. At a global level, BA.1 has been the predominant Omicron lineage, however, the proportion of reported\n    sequences designated as BA.2 has been increasing relative to BA.1 in recent weeks, and is the predominant Omicron lineage in several countries. BA.1 and BA.2 have some genetic differences, which may make them antigenically distinct. Reinfection with\n    BA.2 following infection with BA.1 has been documented, however, initial data from population-level studies suggest that infection with BA.1 provides substantial protection against reinfection with BA.2, at least for the limited period for which data\n    are available. For more details on the Omicron sublineages, please refer to the <a href=\"https://www.who.int/news/item/22-02-2022-statement-on-omicron-sublineage-ba.2\">statement by WHO on the Omicron sublineage BA.2 </a>, published on 22 February 2022.</p><h3>Updating current COVID-19 vaccines</h3><p>The public health goal of COVID-19 vaccination prioritizes protection against severe disease and death. Current vaccines appear to confer high levels of protection against severe disease outcomes associated with Omicron infection. The TAG-CO-VAC therefore\n    strongly supports urgent and broad access to current COVID-19 vaccines for primary series and booster doses, particularly for groups at risk of developing severe disease. The near- and medium-term supply of the available vaccines has increased substantially,\n    however, vaccine equity remains an important challenge and all efforts to address such inequities are strongly encouraged.</p><p>The first interim statement from the TAG-CO-VAC highlighted the need for the development of vaccines that provide protection against infection and prevent transmission, in addition to the protection from severe disease and death, as a means to achieve\n    a greater public health impact from COVID-19 vaccination. In this context, vaccines that are able to elicit mucosal immunity, in addition to systemic immunity, are an important goal. One of the options proposed in the first statement was the development\n    of pan SARS-CoV-2 or pansarbecovirus vaccines. Such vaccines would provide protection that would effectively be variant-proof, and work in this area should be accelerated. &nbsp;</p><p>Current vaccines are based on the virus that circulated early in the pandemic (ancestral virus  e.g. GISAID: hCoV-19/Wuhan/WIV04/2019). Since then, there has been continuous and substantial virus evolution and it is likely that this evolution will continue,\n    resulting in the emergence of new variants. The composition of current COVID-19 vaccines may therefore need to be updated. Any update to current COVID-19 vaccine composition would aim to, at a minimum, retain protection against severe disease and\n    death, while ensuring the breadth of the immune response against circulating and emerging variants, which may be antigenically distinct. &nbsp;</p><p>The TAG-CO-VAC considered a number of issues, all of which are important in any decision on COVID-19 vaccine composition:</p><ul><li>There are heterogeneous levels of population immunity between countries due to different waves of VOCs and different types, levels and timing of vaccination, but robust data on the global immunologic landscape are limited. The performance of any updated\n        vaccine(s) may vary depending on the nature and magnitude of previously acquired immunity.</li><li>When updated vaccines become available, a substantial proportion of the global population will have been exposed to SARS-CoV-2, either as a result of vaccination and/or prior infection. As above, the performance of any updated vaccine(s) may vary\n        depending on the nature and magnitude of previously acquired immunity.</li><li>There are also considerable uncertainties as to how the virus will continue to evolve and the antigenic characteristics of future variants. Given widespread transmission of Omicron globally, the possibility of its continued evolution is high and a\n        new variant may emerge before an updated vaccine can be produced and delivered at scale.</li><li>WHO is tracking lineages under the &lsquo;umbrella&rsquo; of Omicron, including BA.1 and BA.2. Though data are emerging, additional antigenic and virologic characterization of these lineages is needed both independently and in comparison, to the other\n        lineages.\n    </li><li>While the body of evidence on the immune response to Omicron following infection is rapidly growing, data on breadth, magnitude, and durability of humoral and cell-mediated immune responses to variants from variant-specific candidate vaccines using\n        different vaccine platforms remain limited.</li><li>In addition to the current COVID-19 vaccines, there are many other COVID-19 vaccines in various stages of clinical and preclinical development. Any decision from the TAG-CO-VAC on COVID-19 vaccine composition would apply primarily to current COVID-19\n        vaccines.\n    </li></ul><h3>Position of the TAG-CO-VAC</h3><p>The TAG-CO-VAC welcomes, where feasible, the development and initiation of clinical trials on variant-specific candidate vaccines against WHO-designated VOCs, including Omicron. In this context, the TAG-CO-VAC is seeking evidence of robust homologous\n    immune responses in primed and unprimed individuals and cross-reactivity data in primed individuals. The TAG-CO-VAC encourages collection of data following one and two doses of any modified vaccine across a variety of relevant vaccine platforms.</p><p>The TAG-CO-VAC continues to encourage COVID-19 vaccine manufacturers to generate and provide data to WHO on the performance of current and variant-specific candidate COVID-19 vaccines, including the breadth, magnitude, and durability of humoral and cell-mediated\n    immune responses to variants through monovalent and/or multivalent vaccines. The TAG-CO-VAC will carefully consider these data as part of a broader decision-making framework on COVID-19 vaccine composition, allowing the TAG-CO-VAC to issue more specific\n    advice on any adjustments that may be needed to COVID-19 vaccine strain composition, developed either as a monovalent vaccine targeting the predominant circulating variant(s) or a multivalent vaccine derived from different variants.</p><p>The TAG-CO-VAC recognizes the independent role and procedures of relevant regulatory authorities in establishing the necessary requirements for evaluation under the currently established regulatory pathways, and the role of WHO in ensuring alignment,\n    collaboration and a continuous exchange of information between WHO and its expert groups, the TAG-CO-VAC, regulatory authorities, and COVID-19 vaccine manufacturers.</p><p><em>The statement reflects the current vaccine performance and landscape of vaccine development. The statement will therefore be updated as data become available.</em></p><p><em>&nbsp;</em></p><p><em>&nbsp;</em></p>",
  "pubDate": "Tue, 08 Mar 2022 07:26:40 Z"
}