{
  "title": "The First Digital Camera Was the Size of a Toaster",
  "link": "https://spectrum.ieee.org/first-digital-camera-history",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/photo-of-a-smiling-man-with-a-large-camera-with-several-cameras-in-front-of-him.jpg?id=29644015&width=1200&height=800&coordinates=0%2C0%2C0%2C100\"/><br/><br/><p>In the past two weeks, you’ve probably shared at least one embarrassing photo with family or friends. The process, from taking the photo to sharing it, was practically instantaneous. Yet only 20 years ago, you would have had to load and unload film in your camera, drop the film off for processing, and then wait days before you’d know if you even had any images worth sharing.</p>\n<p>Digital cameras have been around a lot longer than you might think, however. Invented in 1975 at <a href=\"https://www.kodak.com/en\" rel=\"noopener noreferrer\" target=\"_blank\">Eastman Kodak</a> in Rochester, N.Y., the first digital camera displayed photos on its screen.</p><hr/>\n<p>The <a href=\"https://www.diyphotography.net/worlds-first-digital-camera-introduced-man-invented/\" rel=\"noopener noreferrer\" target=\"_blank\">Kodak digital camera</a> has been commemorated as an <a href=\"http://ieeemilestones.ethw.org/Main_Page\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Milestone</a>. The dedication ceremony is scheduled for 26 April at the <a href=\"https://www.kodakcenter.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Kodak Center</a> in Rochester. <a href=\"https://events.vtools.ieee.org/m/308439\" rel=\"noopener noreferrer\" target=\"_blank\">Registration is open</a>; guests can attend in person or virtually.</p>\n<p>“This was more than just a camera,” IEEE Member <a href=\"https://spectrum.ieee.org/ten-on-tech-spotlight-on-steven-j-sasson\" target=\"_self\">Steven J. Sasson</a>, inventor of the device, told <a href=\"https://lens.blogs.nytimes.com/2015/08/12/kodaks-first-digital-moment/\" rel=\"noopener noreferrer\" target=\"_blank\"><em>The New York Times</em></a> in 2015. “It was a photographic system to demonstrate the idea of an all-electronic camera that didn’t use any consumables in the capturing and display of still photographic images.”</p>\n<p>Sasson says he never anticipated how the imaging of everything would become so ubiquitous.</p>\n<p>“Photos have become the universal form of casual conversation,” he said in a 2018 <a href=\"https://spectrum.ieee.org/ten-on-tech-spotlight-on-steven-j-sasson\" target=\"_self\">interview</a> with <em>The Institute</em>. “And cameras are present in almost every type of environment, including in our own homes.” </p><p><strong>COMPLETING A DIFFICULT TASK</strong></p><p>Eastman Kodak wanted to find a way to digitize images using a charged coupled device—specifically <a href=\"https://www.mouser.com/manufacturer/fairchild-semiconductor/\" rel=\"noopener noreferrer\" target=\"_blank\">Fairchild Semiconductor</a>’s 100-by-100-pixel CCD. The company assigned the job to Sasson in 1974, when he joined Kodak as an electronics engineer working in the apparatus division’s research lab.</p><p>CCDs, which were invented in 1969 by <a href=\"https://en.wikipedia.org/wiki/Willard_Boyle\" rel=\"noopener noreferrer\" target=\"_blank\">Willard Boyle</a> and <a href=\"https://en.wikipedia.org/wiki/George_E._Smith\" rel=\"noopener noreferrer\" target=\"_blank\">George E. Smith</a> at <a href=\"https://en.wikipedia.org/wiki/Bell_Labs\" rel=\"noopener noreferrer\" target=\"_blank\">Bell Labs</a>, consist of a sensor that converts an incoming two-dimensional light pattern into an electrical signal that in turn becomes an image. In the case of Fairchild’s CCD, the image would be a square: 100 by 100 pixels.</p>\n<p>Although the CCDs could capture an image, they couldn’t store it. So Sasson built a CCD into a camera with RAM to capture image data, which was then transferred to a cassette tape. In a 2016 interview with <a href=\"https://www.diyphotography.net/worlds-first-digital-camera-introduced-man-invented/\" rel=\"noopener noreferrer\" target=\"_blank\">DIY Photography</a>, he said cassettes were the only permanent form of “digital storage” available to him at the time. He designed it so each tape would store 30 images.</p>\n<p>To build his digital camera, Sasson scavenged a lens and an exposure mechanism from a Kodak XL55 movie camera. They served as his camera’s optics and were enclosed in a blue, rectangular box. The box also had a switch on the side that turned the device on and off and served as the camera’s shutter-release button. The blue box sat atop a layer of a half dozen circuit boards and 16 AA batteries. Enclosed in an open steel frame, all of the parts could be seen. The frame also could unfold to make it easier to modify the camera. A portable Memodyne cassette recorder that was attached to the side of the frame held the tape. The camera weighed 3.6 kilograms and was about the size of a toaster.</p>\n<p>The photographer flipped the switch once to turn on the camera and flipped it a second time to take a photo. The CCD would capture the image, which would then run through a <a href=\"https://www.motorola.com/us/about\" rel=\"noopener noreferrer\" target=\"_blank\">Motorola</a> analog-to-digital converter and be stored temporarily in a DRAM array of a dozen 4,096-bit chips. The image was then transferred to the cassette.</p>\n<p>Sasson and his colleagues invented a device to take the information stored on the tape and turn it into digital images. This playback unit converted the data to a standard NTSC signal so the images could be displayed on a TV screen.</p>\n<p>After a year of working on the camera, Sasson took his first photo in December 1975. It was of a Kodak lab technician, Joy Marshall.</p>\n<p>“It only took 50 milliseconds to capture the image, but it took 23 seconds to record it to the tape,” Sasson said in the 2015 <em>Times</em> article. “I’d pop the cassette tape out, hand it to my assistant, and he would put it in our playback unit. About 30 seconds later, up popped the 100-pixel-by-100-pixel black-and-white image.”</p>\n<p>But when Sasson displayed the photo on the lab’s computer, the image’s flaws were apparent. The camera could render shades that were clearly dark or light, things in between appeared as static, according to a 2020 <a href=\"https://spectrum.ieee.org/how-the-digital-camera-transformed-our-concept-of-history\" target=\"_self\"><em>IEEE Spectrum</em> article</a> about digital cameras. Therefore, Marshall’s face was not visible in the photograph. </p>\n<p>Sasson fixed those problems and was granted a <a href=\"https://patents.google.com/patent/US4131919A/en\" rel=\"noopener noreferrer\" target=\"_blank\">U.S. patent</a> for the camera in 1978, but it was never put into production. Even after a few demonstrations of how the camera worked, Kodak executives said they didn’t see a market for it. Sasson wasn’t allowed to publicly talk about the camera or show his prototype to anyone outside of Kodak, according to an article on the camera on<a href=\"https://www.thevintagenews.com/2016/07/25/steve-sasson-invented-the-first-digital-camera-in-1975-but-was-forced-to-keep-it-hidden/?chrome=1&A1c=1\" rel=\"noopener noreferrer\" target=\"_blank\"> <em>The Vintage News</em></a>.</p>\n<p>That didn’t deter Sasson, who continued to build more cameras for Kodak. In 1994 he built one of the first commercially available digital cameras—the <a href=\"https://www.digitalkameramuseum.de/en/cameras/item/kodak-ap-nc2000\" rel=\"noopener noreferrer\" target=\"_blank\">AP NC2000</a>—in collaboration with <a href=\"https://www.nikon.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Nikon</a>.</p><p>Today Sasson’s original digital camera is on display at the <a href=\"https://www.si.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">Smithsonian Institution</a>’s <a href=\"https://americanhistory.si.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">National Museum of American History</a>, in Washington, D.C.</p><p>Administered by the <a href=\"http://www.ieee.org/about/history_center/index.html\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE History Center</a> and <a href=\"https://www.ieeefoundation.org/donate_history\" rel=\"noopener noreferrer\" target=\"_blank\">supported by donors</a>, the Milestone program recognizes outstanding technical developments around the world. The <a href=\"https://r1.ieee.org/rochester/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Rochester (N.Y.) Section</a> sponsored the nomination for the digital camera. Its Milestone plaque, which is to be displayed in the lobby of the Kodak Center, reads:</p>\n<p><em>A self-contained portable digital camera was invented at an Eastman Kodak Company laboratory. It used movie camera optics, a charge-coupled device as an electronic light sensor, a temporary buffer of random-access memory, and image storage on a digital cassette. Subsequent commercial digital cameras using flash memory storage revolutionized how images are captured, processed, and shared, creating opportunities in commerce, education, and global communications.</em></p>",
  "pubDate": "Wed, 06 Apr 2022 18:00:01 +0000",
  "guid": "https://spectrum.ieee.org/first-digital-camera-history",
  "category": [
    "Ieee history",
    "Ieee milestone",
    "Digital camera",
    "Kodak",
    "Steven sasson",
    "History of technology",
    "Type:ti"
  ],
  "dc:creator": "Joanna Goodrich",
  "media:content": ""
}