{
  "id": "yt:video:ujl0-YOenuc",
  "yt:videoId": "ujl0-YOenuc",
  "yt:channelId": "UCkLHy_jxeaHTZCfGalg6QaA",
  "title": "Appearance Discrimination Issues, the CROWN Act, and Unconscious Bias",
  "link": "",
  "author": {
    "name": "Conn Maciel Carey LLP",
    "uri": "https://www.youtube.com/channel/UCkLHy_jxeaHTZCfGalg6QaA"
  },
  "published": "2022-07-22T13:40:30+00:00",
  "updated": "2022-10-21T20:37:36+00:00",
  "media:group": {
    "media:title": "Appearance Discrimination Issues, the CROWN Act, and Unconscious Bias",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Appearance-based discrimination occurs when someone is treated differently based on how they look. Although there is no federal law that prohibits “appearance discrimination” in employment, claims involving such issues are typically brought in the context of prohibited race, sex, or disability discrimination allegations. While there was a case several years ago that garnered a good deal of media attention involving a female bank employee who claimed she was told she was “too sexy” for her position, it is more common to encounter claims by women (and men) that they were treated less favorably than a coworker whom the boss found attractive. Obese workers have alleged that they were perceived as disabled because of their weight and employees who wear certain garments and/or jewelry as part of their religion have also filed claims of discrimination. Meanwhile, hairstyles and types are now on the cutting edge of fair employment law compliance.\n\nFor years, savvy employers recognized that there may be a need to accommodate certain religious beliefs pertaining to hairstyles, but a growing number of jurisdictions have passed or are considering laws that prohibit race-based hair discrimination such as the CROWN Act (“Creating a Respectful and Open World for Natural Hair”) which is focused on ending the denial of employment and educational opportunities because of hair texture or protective hairstyles including braids, locs, twists or bantu knots.\n\nParticipants in this webinar will learn:\n\n• How the EEOC and other fair employment agencies evaluate appearance discrimination claims\n• What proactive employers can and should do to avoid such claims\n• Which states and local jurisdiction have passed or will likely soon pass CROWN Act laws\n• How employers can create policies and procedures that address appearance discrimination\n• Best practices for avoiding appearance discrimination claims\n\nA webinar from Conn Maciel Carey LLP.\n\nUse of this video does not in any manner constitute or establish an attorney-client relationship between Conn Maciel Carey and the viewer. This video may be deemed \"attorney advertising\" in jurisdictions from which it is accessed. The decision to hire a lawyer is a serious one and should be undertaken after consideration of all relevant information, not only information on this video.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}