{
  "title": "Episode 3: &#8220;Ida Red&#8221; by Bob Wills and his Texas Playboys",
  "link": "https://500songs.com/podcast/ida-red-by-bob-wills-and-his-texas-playboys/",
  "pubDate": "Sun, 21 Oct 2018 23:00:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/ida-red-by-bob-wills-and-his-texas-playboys/",
  "description": "Welcome to episode three of&nbsp;<em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at Bob Wills and \"Ida Red\".\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-3-ida-red/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI mention a PhD thesis on the history of the backbeat in the episode. <a href=\"https://www.tagg.org/xpdfs/TamlynPhD1.pdf\">Here's a link to it</a>.\n\nBob Wills' music is now in the public domain, so there are many different compilations available, of different levels of quality. <a href=\"https://amzn.to/2RLxq5M\">This</a> is an expensive but exhaustive one, while <a href=\"https://amzn.to/2RLxq5M\">this</a> is a cheap one which seems to have most of the important hits on it.\n\nThe definitive book on Bob Wills,&nbsp;<em>San Antonio Rose</em>, is available <a href=\"https://amzn.to/2RKobCQ\">here</a>, though it's a bit pricey.\n\nAnd for all the episodes on pre-1954 music, one invaluable source is the book <a href=\"https://amzn.to/2OS4iaN\">\"Before Elvis\" by Larry Birnbaum.</a>\n\nClarification\n\nIn the episode I talk about two tracks as being \"by Django Reinhardt\", but the clips I play happen to be ones featuring violin solos. Those solos are, of course, by Reinhardt's longtime collaborator Stephane Grapelli. I assume most people will know this, but just in case.\n\n<strong>Transcript</strong>\n\n\"Rock and Roll? Why, man, that's the same kind of music we've been playin' since 1928! ... We didn't call it rock and roll back when we introduced it as our style back in 1928, and we don't call it rock and roll the way we play it now. But it's just basic rhythm and has gone by a lot of different names in my time. It's the same, whether you just follow a drum beat like in Africa or surround it with a lot of instruments. The rhythm's what's important.\"\n\nBob Wills said that in 1957, and it brings up an interesting question. What's in a name?\n\nGenre names are a strange thing, aren't they? In particular, did you ever notice how many of them had the word \"and\" in them? Rock and roll, rhythm and blues, country and western? There's sort of a reason for that.\n\nRock and roll is a special case, but the other two were names that were coined by Billboard, and they weren't originally meant to be descriptors of a single genre, but of collections of genres -- they were titles for its different charts. Rhythm and blues is a name that was used to replace the earlier name, of \"race\" records, because that was thought a bit demeaning. It was for the chart of \"music made by black people\", basically, whatever music those black people were making, so they could be making \"rhythm\" records, or they could be making \"blues\" records.\n\nOnly once you give a collection of things a name, the way people's minds work, they start thinking that because those things share a name they're the same kind of thing. And people start thinking about \"rhythm and blues\" records as being a particular kind of thing. And then they start making \"rhythm and blues\" records, and suddenly it is a thing.\n\nThe same thing goes for country and western. That was, again, two different genres. Country music was the music made by white people who lived in the rural areas, of the Eastern US basically -- people like the Carter Family, for example.\n\n[Excerpt of “Keep on the Sunny Side” by the Carter Family]\n\nWe'll hear more about the Carter family in the future, but that's what country music was. Not country and western, just country. And that was the music made in Appalachia, especially Kentucky and Tennessee, and especially especially Nashville.\n\nWestern music was a bit different. That was the music being made in Texas, Oklahoma, and California, and it tended to use similar instrumentation to country music -- violins and guitars and so on -- but it had different subject matter -- lots of songs about cowboys and outlaws and so on -- and at the time we're talking about, the thirties and forties, it was a little bit slicker than country music.\n\nThis is odd in retrospect, because not many years later the Western musicians influenced people like Johnny Cash, Buck Owens, and Merle Haggard, who made very gritty, raw, unpolished music compared to the country music coming out of Nashville, but the thirties and forties were the heyday of singing cowboy films, with people like Gene Autry and Roy Rogers becoming massive, massive stars, and so there was a lot of Hollywoodisation of the music, lots of crooning and orchestras and so on.\n\nWestern music was big, big business -- and so was swing music. And so it's perhaps not surprising that there was a new genre that emerged around that time. Western swing.\n\nWestern swing is, to simplify it ridiculously, swing music made in the West of the USA. But it's music that was made in the west -- largely in places like California --by the same kinds of people who in the east were making country music, and with a lot of the same influences.\n\nIt took the rhythms of swing music, but played them with the same instrumentation as the country musicians were using, so you'd get hot jazz style performances, but they'd be played on fiddle, banjo, guitar, and stand-up bass. There were a few other instruments that you'd usually get included as well -- the steel guitar, for example. Western swing usually also included a drum kit, which was one of the big ways it differed from country music as it was then. The drum kit was, in the early decades of the twentieth century, primarily a jazz instrument, and it was only because Western swing was a hybrid of jazz and Western music that it got included in those bands -- and for a long time drum kits were banned from country music shows like the Grand Ole Opry, and when they did finally relent and let Western swing bands play there, they made the drummers hide behind a curtain.\n\nThey would also include other instruments that weren't normally included in country or Western music at the time, like the piano. Less often, you'd have a saxophone or a trumpet, but basically the typical Western swing lineup would be a guitar, a steel guitar, a violin or two, a piano, a bass, and drums.\n\nAgain, as we saw in the episode about \"Flying Home\", where we talked about *non*-Western swing, you can see the rock band lineup starting to form. It was a gradual process though.\n\nTake Bob Wills, the musician whose drummer had to hide behind a curtain.\n\nWills originally performed as a blackface comedian -- sadly, blackface performances were very, very common in the US in the 1930s (but then, they were common in the UK well into my lifetime. I'm not judging the US in particular here), but he soon became more well known as a fiddle player and occasional singer.\n\nIn 1929 Wills, the singer Milton Brown, and guitarist Herman Arnspiger, got together to perform a song at a Christmas dance party. They soon added Brown's brother Derwood on guitar and fiddle player John Dunnam, and became the Light Crust Doughboys.\n\n[clip of the Light Crust Doughboys singing their theme]\n\nThat might seem like a strange name for a band, and it would be if that had been the name they chose themselves, but it wasn't. Their name was originally The Aladdin Laddies, as they got sponsored by the Aladdin Lamp Company to perform on WBAP radio under that name, but when that sponsorship fell through, they performed for a while as the Wills Fiddle Band, before they found a new sponsor -- Pappy O'Daniel.\n\nYou may know that name, as the name of the governor of Mississippi in the film \"O Brother, Where Art Thou?\", and that was... not an *entirely* inaccurate portrayal, though the character in that film definitely wasn't the real man. The real Pappy O'Daniel didn't actually become governor of Mississippi, but he did become the governor of Texas, in the 1940s.\n\nBut in the late 1920s and early thirties he was the head of advertising for Burrus Mill and Elevator Company, who made \"Light Crust Flour\", and he started to sponsor the show.\n\nThe band became immensely successful, but they were not particularly well paid -- in fact, O'Daniel insisted that everyone in the band would have to actually work a day job at the mill as well. Bob Wills was a truck driver as well as being a fiddle player, and the others had different jobs in the factory.\n\nPappy O'Daniel at first didn't like this hillbilly music being played on the radio show he was paying for -- in fact he wanted to cancel the show after two weeks. But Wills invited him down to the radio station to be involved in the broadcasts, and O'Daniel became the show's MC, as well as being the band's manager and the writer of their original material. O'Daniel even got his own theme song, \"Pass the Biscuits, Pappy\".\n\n[insert Hillbilly Boys playing \"Pass the Biscuits, Pappy\"]\n\nThat's not the Light Crust Doughboys playing the song -- that's the Hillbilly Boys, another band Pappy O'Daniel hired a few years later, when Burrus Mill fired him and he formed his own company, Hillbilly Flour -- but that's the song that the Light Crust Doughboys used to play for O'Daniel, and the singer on that recording, Leon Huff, sang with the Doughboys from 1934 onwards. So you get the idea.\n\nIn 1932, the Light Crust Doughboys made their first recording, though they did so under the name the Fort Worth Doughboys -- Pappy O'Daniel didn't approve of them doing anything which might take them out of his control, so they didn't use the same name. This is \"Nancy\"\n\n[insert clip of \"Nancy\"]\n\nNow the music the Light Crust Doughboys were playing wasn't yet what we'd call Western Swing but they were definitely as influenced by jazz music as they were by Western music. In fact, the original lineup of the Light Crust Doughboys can be seen as the prototypical example of the singer-guitarist creative tension in rock music, except here it was a tension between the singer and the fiddle player. Milton Brown was, by all accounts, wanting to experiment more with a jazz style, while Bob Wills wanted to stick with a more traditional hillbilly string band sound. That creative tension led them to create a totally new form of music.\n\nTo see this, we're going to look forward a little bit to 1936, to a slightly different lineup of the band. Take a listen to this, for example -- \"Dinah\".\n\n[insert section of Light Crust Doughboys playing \"Dinah\"]\n\nAnd this -- \"Limehouse Blues\".\n\n[insert section of Light Crust Doughboys playing \"Limehouse Blues\"]\n\nAnd now listen to this -- Django Reinhardt playing \"Dinah\"\n\n[insert section of Reinhardt playing \"Dinah\"]\n\nAnd Reinhardt playing \"Limehouse Blues\"\n\n[Reinhardt playing \"Limehouse Blues\"]\n\nThose recordings were made a few years after the Light Crust Doughboys versions, but you can see the similarities. The Light Crust Doughboys were doing the same things as Stephane Grapelli and Django Reinhardt, years before them, even though we would now think of the Light Crust Doughboys as being \"a country band\", while Grapelli and Reinhardt are absolutely in the jazz category.\n\nNow, I said that that's a different lineup of the Light Crust Doughboys, and it is. A version of the Light Crust Doughboys continues today, and one member, Smoky Montgomery, who joined the band in 1935, continued with them until his death in 2001. Smoky Montgomery's on those tracks you just heard, but Bob Wills and Milton Brown weren't. They both left, because Pappy O'Daniel was apparently not a very good person to work for.\n\nIn particular, O'Daniel wouldn't let the Doughboys play any venues where alcohol was served, or play dances generally. O'Daniel was only paying the band members $15 a week, and they could get $40 a night playing gigs, and so Brown left in 1932 to form his own band, the Musical Brownies.\n\nThe Musical Brownies are now largely forgotten, but they're considered the first band ever to play proper Western Swing, and they introduced a lot of things that defined the genre. In particular, they introduced electric steel guitar to the Western music genre, with the great steel player Bob Dunn.\n\nFor a while, the Musical Brownies were massively popular, but sadly Brown died in a car crash in 1936.\n\nBob Wills stayed in the Doughboys for a while longer, as the band's leader, as O'Daniel gave him a raise to $38 a week. And he continued to make the kind of music he'd made when Brown was in the band -- both Brown and Wills clearly recognised that what they'd come up with together was something better and more interesting than just jazz or just Western.\n\nWills recruited a new singer, Tommy Duncan, but in 1933 Wills was fired by O'Daniel, partly because of rows over Wills wanting his brother in the band, and partly because Wills' drinking was already starting to affect his professionalism. He formed his own band and took Duncan and bass player Kermit Whalen with him. The Doughboys' steel guitar player, Leon McAuliffe, soon followed, and they became Bob Wills and his Texas Playboys. They advertised themselves as \"formerly the Light Crust Doughboys\" -- although that wasn't entirely true, as they weren't the whole band, though they were the core of it -- and Pappy O'Daniel sued them, unsuccessfully.\n\nAnd the Texas Playboys then became the first Western Swing band to add a drum kit, and become a more obviously rhythm-oriented band.\n\nThe Texas Playboys were the first massively, massively successful Western swing band, and their style was one that involved taking elements from everywhere and putting them together. They had the drums and horns that a jazz band would have, the guitars and fiddles that country or Western bands would have, the steel guitar that a Hawaiian band would have, and that meant they could play all of those styles of music if they wanted to. And they did. They mixed jazz, and Western, and blues, and pop, and came up with something different from all of them.\n\nThis was music for dancing, and as music for dancing it had a lot of aspects that would later make their way into rock and roll. In particular it had that backbeat we talked about in episode two, although here it was swung less -- when you listen to them play with a heavy backbeat but with the fiddle as the main instrument, you can hear the influence of polka music, which was a big influence on all the Western swing musicians, and through them on rock and roll. Polka music is performed in 2/4 time, and there's a very, *very* strong connection between the polka beat and the backbeat.\n\n(I won't go into that too much more here -- I already talked about the backbeat quite a bit in episode two -- but while researching these episodes I found a hugely informative but very detailed look at the development of the rock backbeat -- someone's PhD thesis from twenty years ago, four hundred pages just on that topic, which I'll link on the webpage if you want a much more detailed explanation)\n\nNow by looking at the lineup of the Texas Playboys, we can see how the rock band lineup evolved. In 1938 the Texas Playboys had a singer, two guitars (one doubling on fiddle), three fiddlers, a banjo player, steel guitar, bass, drums, piano, trumpet, trombone, and two saxes. A *huge* band, and one at least as swing as it was Western. But around that time, Wills started to use electric guitars -- electric guitars only really became \"a thing\" in 1938 musically, and a lot of people started using them at the same time, like Benny Goodman's band as we heard about in the first episode. Wills' band was one of the first to use them, and Western musicians generally were more likely to use them, as they were already using amplified *steel* guitars.\n\nWe talked in episode two about how the big bands died between 1942 and 1944, and Wills was able to make his band considerably smaller with the aid of amplification, so by 1944 he'd got rid of most of his horn section apart from a single trumpet, having his electric guitars play what would previously have been horn lines.\n\nSo by 1944 the band would consist of two fiddles, two basses, two electric guitars, steel guitar, drums, and a trumpet. A smaller band, an electrified band, and one which, other than the fiddles and the trumpet, was much closer to the kind of lineups that you would get in the 50s and 60s. A smaller, tighter, band.\n\nNow, Wills' band quickly became the most popular band in its genre, and he became widely known as \"the king of Western Swing\", but Wills' music was more than just swing. He was pulling together elements from country, from the blues, from jazz, from anything that could make him popular.\n\nAnd, sadly, that would sometimes include plagiarism.\n\nNow, the question of black influence on white music is a fraught one, and one that will come up a lot in the course of this history. And a lot of the time people will get things wrong. There were, of course, white people who made their living by taking black people's music and watering it down. There were also, though, plenty of more complicated examples, and examples of mutual influence.\n\nThere was a constant bouncing of ideas back and forth between country, western, blues, jazz, swing... all of these genres were coded as belonging to one or other race, but all of them had musicians who were listening to one another. This is not to say that racism was not a factor in who was successful -- of course it was, and this episode is, after all, about someone who started out as a blackface performer, race was a massive factor, and sadly still is -- but the general culture among musicians at the time was that good musicians of whatever genre respected good musicians of any other genre, and there were songs that everyone, or almost everyone, played, in their own styles, simply because a good song was a good song and at that time there wasn't the same tight association of performer and song that there is now -- you'd sometimes have five or six people in the charts with hit versions of the same song. You'd have a country version and a blues version and a swing version of a song, not because anyone was stealing anyone else's music, but because it was just accepted that everyone would record a hit song in their own style.\n\nAnd certainly, in the case of Bob Wills, he was admired by -- and admired -- musicians across racial boundaries. The white jazz guitarist Les Paul -- of whom we'll almost certainly be hearing more -- used to tell a story. Paul was so amazed by Bob Wills' music that in 1938 he travelled from Waukesha Wisconsin, where he was visiting his mother, to Tulsa, Oklahoma, to hear Wills' band play, after his mother made him listen to Bob Wills on the radio. Paul was himself a famous guitarist at the time, and he got drawn on stage to jam with the band.\n\nAnd then, in an interval, a black man in the audience -- presumably this must have been an integrated audience, which would have been *very* unusual in 1938 in Oklahoma, but this is how Les Paul told the story, and other parts of it check out so we should probably take his word for it absent better evidence -- came up and asked for Les Paul's autograph. He told Paul that he played guitar, and Paul said for the young man to show him what he could do. The young man did, and Paul said “Jesus, you *are* good. You want to come up and sit in with us?”\n\nAnd he did -- that was the first time that Les Paul met his friend Charlie Christian, shortly before Christian got the offer from Benny Goodman. Hanging out and jamming at a Bob Wills gig.\n\nSo we can, for the most part, safely put Bob Wills into the mutual respect and influence category. He was someone who had the respect of his peers, and was part of a chain of influences crossing racial and stylistic boundaries.\n\nIt gets more difficult when you get to someone like Pat Boone, a few years later, who would record soundalike versions of black musicians' hits specifically to sell to people who wouldn't buy music by black people and act as a spoiler for their records. That's ethically very, very dodgy, plus Boone was a terrible musician.\n\nBut what I think we can all agree on is that just outright stealing a black musician's song, crediting it to a white musician, and making it a massive hit is just wrong. And sadly that happened with Bob Wills' band at least once.\n\nNow, Leon McAuliffe, the Texas Playboys' steel guitar player, is the credited composer of \"Steel Guitar Rag\", which is the instrumental which really made the steel guitar a permanent fixture in country and western music. Without this instrumental, country music would be totally different.\n\n[insert a section of \"Steel Guitar Rag\" by Bob Wills]\n\nThat's from 1936. Now, in 1927, the guitarist Sylvester Weaver made a pioneering recording, which is now often called the first recorded country blues, the first recorded blues instrumental, and the first slide guitar recording (as I've said before, there is never a first, but Weaver's recording is definitely important). That track is called \"Guitar Rag\" and... well...\n\n[insert \"Guitar Rag\" by Sylvester Weaver].\n\nLeon McAuliffe always claimed he'd never heard Sylvester Weaver's song, and came up with Steel Guitar Rag independently. Do you believe him?\n\nSo, the Texas Playboys were not averse to a bit of plagiarism. But the song we're going to talk about for the rest of the episode is one that would end up plagiarised itself, very famously.\n\n\"Ida Red\" is an old folk song, first recorded in 1924. In fact, structurally it's a hokum song. As is often the case with this kind of song, it's part of a massive family tree of other songs -- there are blues and country songs with the same melody, songs with different melodies but mentions of Ida Red, songs which contain different lines from the song... many folk songs aren't so much songs in themselves as they are labels you can put on a whole family. There's no one song \"Ida Red\", there's a whole bunch of songs which are, to a greater or lesser extent, Ida Red. \"Ida Red\" is just a name you can slap on that family, something you can point to.\n\nMost versions of \"Ida Red\" had the same chorus -- \"Ida Red, Ida Red, I'm plum fool about Ida Red\" -- but different lyrics, often joking improvised ones. Here's the first version of \"Ida Red\" to be recorded -- oddly, this version doesn't even have the chorus, but it does have the chorus melody played on the fiddle. This is Fiddlin' Powers and Family, singing about Ida Red who weighs three hundred and forty pounds, in 1924:\n\n[insert Fiddlin Powers version of \"Ida Red\"]\n\nWills' version is very differently structured. It has totally different lyrics -- it has the familiar chorus, but the verses are totally different and have nothing to do with the character of Ida Red -- \"Light's in the parlour, fire's in the grate/Clock on the mantle says it's a'gettin' late/Curtains on the window, snowy white/The parlour's pleasant on Sunday night\"\n\n[insert Bob Wills version of \"Ida Red\"]\n\nThose lyrics -- and all the other lyrics in Wills' version except the chorus, were taken from an 1878 parlour song called \"Sunday Night\" by George Frederick Root, a Civil War era songwriter who is now best known as the writer of the melody we now know as \"Jesus Loves the Little Children\". They're cut down to fit into the fast-patter do-si-do style of the song, but they're still definitely the same lyrics as Root's.\n\n\"Ida Red\" was one of many massive hits for Wills and the Texas Playboys, who continued to be hugely successful through the 1940s, at one point becoming a bigger live draw than Benny Goodman or Tommy Dorsey, although the band's success started to decline when Tommy Duncan quit in 1948 over Wills' drinking -- Wills would often miss shows because of his binge drinking, and Duncan was the one who had to deal with the angry fans. Wills replaced Duncan with various other singers, but never found anyone who would have the same success with him.\n\nBob Wills and the Texas Playboys had a couple of hits in the very early 1950s -- one of them, indeed, was a sequel to Ida Red -- \"Ida Red Likes The Boogie\", a novelty boogie song of the type we discussed last week. (And think back to what I said then about the boogie fad persisting much longer than it should have. \"Ida Red Likes The Boogie\" was recorded in 1949 and went top ten in 1950, yet those boogie novelty songs I talked about last week were from 1940).\n\n[insert \"Ida Red Likes The Boogie\"]\n\nBut even as his kind of music was getting more into fashion under the name rock and roll, Wills himself became less popular. The band were still a popular live attraction through most of the 1950s, but they never again reached the heights of the 30s and 40s, and Wills' deteriorating health and the band's lack of success made them split up in 1965.\n\nBut before they'd split, Wills' music had had a lasting influence on rock and roll, and not just on the people you might expect. Remember how I talked about plagiarism? Well, in 1955, a musician went into Chess studios with a slight rewrite of \"Ida Red\" that he called \"Ida May\". Leonard Chess persuaded him to change the name because otherwise it would be too obvious where he stole the tune... and we will talk about \"Maybellene\" by Chuck Berry in a few weeks' time.\n\n<strong>Patreon</strong>\nAs always, this podcast only exists because of the donations of my backers on Patreon. If you enjoy it, <a href=\"http://patreon.com/andrewhickey\">why not join them</a>?",
  "itunes:subtitle": "Welcome to episode three of&nbsp;A History of Rock Music in Five Hundred Songs. Today were looking at Bob Wills and Ida Red.\n\n\n\nResources\n\nAs always, Ive created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI mention",
  "itunes:keywords": "backbeat,Bob Wills,Charlie Christian,country and western,Django Reinhardt,Les Paul,Light Crust Doughboys,plagiarism,racism,swing,western swing",
  "itunes:episodeType": "full",
  "itunes:episode": 3,
  "content:encoded": "Welcome to episode three of&nbsp;<em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at Bob Wills and \"Ida Red\".\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-3-ida-red/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI mention a PhD thesis on the history of the backbeat in the episode. <a href=\"https://www.tagg.org/xpdfs/TamlynPhD1.pdf\">Here's a link to it</a>.\n\nBob Wills' music is now in the public domain, so there are many different compilations available, of different levels of quality. <a href=\"https://amzn.to/2RLxq5M\">This</a> is an expensive but exhaustive one, while <a href=\"https://amzn.to/2RLxq5M\">this</a> is a cheap one which seems to have most of the important hits on it.\n\nThe definitive book on Bob Wills,&nbsp;<em>San Antonio Rose</em>, is available <a href=\"https://amzn.to/2RKobCQ\">here</a>, though it's a bit pricey.\n\nAnd for all the episodes on pre-1954 music, one invaluable source is the book <a href=\"https://amzn.to/2OS4iaN\">\"Before Elvis\" by Larry Birnbaum.</a>\n\nClarification\n\nIn the episode I talk about two tracks as being \"by Django Reinhardt\", but the clips I play happen to be ones featuring violin solos. Those solos are, of course, by Reinhardt's longtime collaborator Stephane Grapelli. I assume most people will know this, but just in case.\n\n<strong>Transcript</strong>\n\n\"Rock and Roll? Why, man, that's the same kind of music we've been playin' since 1928! ... We didn't call it rock and roll back when we introduced it as our style back in 1928, and we don't call it rock and roll the way we play it now. But it's just basic rhythm and has gone by a lot of different names in my time. It's the same, whether you just follow a drum beat like in Africa or surround it with a lot of instruments. The rhythm's what's important.\"\n\nBob Wills said that in 1957, and it brings up an interesting question. What's in a name?\n\nGenre names are a strange thing, aren't they? In particular, did you ever notice how many of them had the word \"and\" in them? Rock and roll, rhythm and blues, country and western? There's sort of a reason for that.\n\nRock and roll is a special case, but the other two were names that were coined by Billboard, and they weren't originally meant to be descriptors of a single genre, but of collections of genres -- they were titles for its different charts. Rhythm and blues is a name that was used to replace the earlier name, of \"race\" records, because that was thought a bit demeaning. It was for the chart of \"music made by black people\", basically, whatever music those black people were making, so they could be making \"rhythm\" records, or they could be making \"blues\" records.\n\nOnly once you give a collection of things a name, the way people's minds work, they start thinking that because those things share a name they're the same kind of thing. And people start thinking about \"rhythm and blues\" records as being a particular kind of thing. And then they start making \"rhythm and blues\" records, and suddenly it is a thing.\n\nThe same thing goes for country and western. That was, again, two different genres. Country music was the music made by white people who lived in the rural areas, of the Eastern US basically -- people like the Carter Family, for example.\n\n[Excerpt of “Keep on the Sunny Side” by the Carter Family]\n\nWe'll hear more about the Carter family in the future, but that's what country music was. Not country and western, just country. And that was the music made in Appalachia, especially Kentucky and Tennessee, and especially especially Nashville.\n\nWestern music was a bit different. That was the music being made in Texas, Oklahoma, and California, and it tended to use similar instrumentation to country music -- violins and guitars and so on -- but it had different subject matter -- lots of songs about cowboys and outlaws and so on -- and at the time we're talking about, the thirties and forties, it was a little bit slicker than country music.\n\nThis is odd in retrospect, because not many years later the Western musicians influenced people like Johnny Cash, Buck Owens, and Merle Haggard, who made very gritty, raw, unpolished music compared to the country music coming out of Nashville, but the thirties and forties were the heyday of singing cowboy films, with people like Gene Autry and Roy Rogers becoming massive, massive stars, and so there was a lot of Hollywoodisation of the music, lots of crooning and orchestras and so on.\n\nWestern music was big, big business -- and so was swing music. And so it's perhaps not surprising that there was a new genre that emerged around that time. Western swing.\n\nWestern swing is, to simplify it ridiculously, swing music made in the West of the USA. But it's music that was made in the west -- largely in places like California --by the same kinds of people who in the east were making country music, and with a lot of the same influences.\n\nIt took the rhythms of swing music, but played them with the same instrumentation as the country musicians were using, so you'd get hot jazz style performances, but they'd be played on fiddle, banjo, guitar, and stand-up bass. There were a few other instruments that you'd usually get included as well -- the steel guitar, for example. Western swing usually also included a drum kit, which was one of the big ways it differed from country music as it was then. The drum kit was, in the early decades of the twentieth century, primarily a jazz instrument, and it was only because Western swing was a hybrid of jazz and Western music that it got included in those bands -- and for a long time drum kits were banned from country music shows like the Grand Ole Opry, and when they did finally relent and let Western swing bands play there, they made the drummers hide behind a curtain.\n\nThey would also include other instruments that weren't normally included in country or Western music at the time, like the piano. Less often, you'd have a saxophone or a trumpet, but basically the typical Western swing lineup would be a guitar, a steel guitar, a violin or two, a piano, a bass, and drums.\n\nAgain, as we saw in the episode about \"Flying Home\", where we talked about *non*-Western swing, you can see the rock band lineup starting to form. It was a gradual process though.\n\nTake Bob Wills, the musician whose drummer had to hide behind a curtain.\n\nWills originally performed as a blackface comedian -- sadly, blackface performances were very, very common in the US in the 1930s (but then, they were common in the UK well into my lifetime. I'm not judging the US in particular here), but he soon became more well known as a fiddle player and occasional singer.\n\nIn 1929 Wills, the singer Milton Brown, and guitarist Herman Arnspiger, got together to perform a song at a Christmas dance party. They soon added Brown's brother Derwood on guitar and fiddle player John Dunnam, and became the Light Crust Doughboys.\n\n[clip of the Light Crust Doughboys singing their theme]\n\nThat might seem like a strange name for a band, and it would be if that had been the name they chose themselves, but it wasn't. Their name was originally The Aladdin Laddies, as they got sponsored by the Aladdin Lamp Company to perform on WBAP radio under that name, but when that sponsorship fell through, they performed for a while as the Wills Fiddle Band, before they found a new sponsor -- Pappy O'Daniel.\n\nYou may know that name, as the name of the governor of Mississippi in the film \"O Brother, Where Art Thou?\", and that was... not an *entirely* inaccurate portrayal, though the character in that film definitely wasn't the real man. The real Pappy O'Daniel didn't actually become governor of Mississippi, but he did become the governor of Texas, in the 1940s.\n\nBut in the late 1920s and early thirties he was the head of advertising for Burrus Mill and Elevator Company, who made \"Light Crust Flour\", and he started to sponsor the show.\n\nThe band became immensely successful, but they were not particularly well paid -- in fact, O'Daniel insisted that everyone in the band would have to actually work a day job at the mill as well. Bob Wills was a truck driver as well as being a fiddle player, and the others had different jobs in the factory.\n\nPappy O'Daniel at first didn't like this hillbilly music being played on the radio show he was paying for -- in fact he wanted to cancel the show after two weeks. But Wills invited him down to the radio station to be involved in the broadcasts, and O'Daniel became the show's MC, as well as being the band's manager and the writer of their original material. O'Daniel even got his own theme song, \"Pass the Biscuits, Pappy\".\n\n[insert Hillbilly Boys playing \"Pass the Biscuits, Pappy\"]\n\nThat's not the Light Crust Doughboys playing the song -- that's the Hillbilly Boys, another band Pappy O'Daniel hired a few years later, when Burrus Mill fired him and he formed his own company, Hillbilly Flour -- but that's the song that the Light Crust Doughboys used to play for O'Daniel, and the singer on that recording, Leon Huff, sang with the Doughboys from 1934 onwards. So you get the idea.\n\nIn 1932, the Light Crust Doughboys made their first recording, though they did so under the name the Fort Worth Doughboys -- Pappy O'Daniel didn't approve of them doing anything which might take them out of his control, so they didn't use the same name. This is \"Nancy\"\n\n[insert clip of \"Nancy\"]\n\nNow the music the Light Crust Doughboys were playing wasn't yet what we'd call Western Swing but they were definitely as influenced by jazz music as they were by Western music. In fact, the original lineup of the Light Crust Doughboys can be seen as the prototypical example of the singer-guitarist creative tension in rock music, except here it was a tension between the singer and the fiddle player. Milton Brown was, by all accounts, wanting to experiment more with a jazz style, while Bob Wills wanted to stick with a more traditional hillbilly string band sound. That creative tension led them to create a totally new form of music.\n\nTo see this, we're going to look forward a little bit to 1936, to a slightly different lineup of the band. Take a listen to this, for example -- \"Dinah\".\n\n[insert section of Light Crust Doughboys playing \"Dinah\"]\n\nAnd this -- \"Limehouse Blues\".\n\n[insert section of Light Crust Doughboys playing \"Limehouse Blues\"]\n\nAnd now listen to this -- Django Reinhardt playing \"Dinah\"\n\n[insert section of Reinhardt playing \"Dinah\"]\n\nAnd Reinhardt playing \"Limehouse Blues\"\n\n[Reinhardt playing \"Limehouse Blues\"]\n\nThose recordings were made a few years after the Light Crust Doughboys versions, but you can see the similarities. The Light Crust Doughboys were doing the same things as Stephane Grapelli and Django Reinhardt, years before them, even though we would now think of the Light Crust Doughboys as being \"a country band\", while Grapelli and Reinhardt are absolutely in the jazz category.\n\nNow, I said that that's a different lineup of the Light Crust Doughboys, and it is. A version of the Light Crust Doughboys continues today, and one member, Smoky Montgomery, who joined the band in 1935, continued with them until his death in 2001. Smoky Montgomery's on those tracks you just heard, but Bob Wills and Milton Brown weren't. They both left, because Pappy O'Daniel was apparently not a very good person to work for.\n\nIn particular, O'Daniel wouldn't let the Doughboys play any venues where alcohol was served, or play dances generally. O'Daniel was only paying the band members $15 a week, and they could get $40 a night playing gigs, and so Brown left in 1932 to form his own band, the Musical Brownies.\n\nThe Musical Brownies are now largely forgotten, but they're considered the first band ever to play proper Western Swing, and they introduced a lot of things that defined the genre. In particular, they introduced electric steel guitar to the Western music genre, with the great steel player Bob Dunn.\n\nFor a while, the Musical Brownies were massively popular, but sadly Brown died in a car crash in 1936.\n\nBob Wills stayed in the Doughboys for a while longer, as the band's leader, as O'Daniel gave him a raise to $38 a week. And he continued to make the kind of music he'd made when Brown was in the band -- both Brown and Wills clearly recognised that what they'd come up with together was something better and more interesting than just jazz or just Western.\n\nWills recruited a new singer, Tommy Duncan, but in 1933 Wills was fired by O'Daniel, partly because of rows over Wills wanting his brother in the band, and partly because Wills' drinking was already starting to affect his professionalism. He formed his own band and took Duncan and bass player Kermit Whalen with him. The Doughboys' steel guitar player, Leon McAuliffe, soon followed, and they became Bob Wills and his Texas Playboys. They advertised themselves as \"formerly the Light Crust Doughboys\" -- although that wasn't entirely true, as they weren't the whole band, though they were the core of it -- and Pappy O'Daniel sued them, unsuccessfully.\n\nAnd the Texas Playboys then became the first Western Swing band to add a drum kit, and become a more obviously rhythm-oriented band.\n\nThe Texas Playboys were the first massively, massively successful Western swing band, and their style was one that involved taking elements from everywhere and putting them together. They had the drums and horns that a jazz band would have, the guitars and fiddles that country or Western bands would have, the steel guitar that a Hawaiian band would have, and that meant they could play all of those styles of music if they wanted to. And they did. They mixed jazz, and Western, and blues, and pop, and came up with something different from all of them.\n\nThis was music for dancing, and as music for dancing it had a lot of aspects that would later make their way into rock and roll. In particular it had that backbeat we talked about in episode two, although here it was swung less -- when you listen to them play with a heavy backbeat but with the fiddle as the main instrument, you can hear the influence of polka music, which was a big influence on all the Western swing musicians, and through them on rock and roll. Polka music is performed in 2/4 time, and there's a very, *very* strong connection between the polka beat and the backbeat.\n\n(I won't go into that too much more here -- I already talked about the backbeat quite a bit in episode two -- but while researching these episodes I found a hugely informative but very detailed look at the development of the rock backbeat -- someone's PhD thesis from twenty years ago, four hundred pages just on that topic, which I'll link on the webpage if you want a much more detailed explanation)\n\nNow by looking at the lineup of the Texas Playboys, we can see how the rock band lineup evolved. In 1938 the Texas Playboys had a singer, two guitars (one doubling on fiddle), three fiddlers, a banjo player, steel guitar, bass, drums, piano, trumpet, trombone, and two saxes. A *huge* band, and one at least as swing as it was Western. But around that time, Wills started to use electric guitars -- electric guitars only really became \"a thing\" in 1938 musically, and a lot of people started using them at the same time, like Benny Goodman's band as we heard about in the first episode. Wills' band was one of the first to use them, and Western musicians generally were more likely to use them, as they were already using amplified *steel* guitars.\n\nWe talked in episode two about how the big bands died between 1942 and 1944, and Wills was able to make his band considerably smaller with the aid of amplification, so by 1944 he'd got rid of most of his horn section apart from a single trumpet, having his electric guitars play what would previously have been horn lines.\n\nSo by 1944 the band would consist of two fiddles, two basses, two electric guitars, steel guitar, drums, and a trumpet. A smaller band, an electrified band, and one which, other than the fiddles and the trumpet, was much closer to the kind of lineups that you would get in the 50s and 60s. A smaller, tighter, band.\n\nNow, Wills' band quickly became the most popular band in its genre, and he became widely known as \"the king of Western Swing\", but Wills' music was more than just swing. He was pulling together elements from country, from the blues, from jazz, from anything that could make him popular.\n\nAnd, sadly, that would sometimes include plagiarism.\n\nNow, the question of black influence on white music is a fraught one, and one that will come up a lot in the course of this history. And a lot of the time people will get things wrong. There were, of course, white people who made their living by taking black people's music and watering it down. There were also, though, plenty of more complicated examples, and examples of mutual influence.\n\nThere was a constant bouncing of ideas back and forth between country, western, blues, jazz, swing... all of these genres were coded as belonging to one or other race, but all of them had musicians who were listening to one another. This is not to say that racism was not a factor in who was successful -- of course it was, and this episode is, after all, about someone who started out as a blackface performer, race was a massive factor, and sadly still is -- but the general culture among musicians at the time was that good musicians of whatever genre respected good musicians of any other genre, and there were songs that everyone, or almost everyone, played, in their own styles, simply because a good song was a good song and at that time there wasn't the same tight association of performer and song that there is now -- you'd sometimes have five or six people in the charts with hit versions of the same song. You'd have a country version and a blues version and a swing version of a song, not because anyone was stealing anyone else's music, but because it was just accepted that everyone would record a hit song in their own style.\n\nAnd certainly, in the case of Bob Wills, he was admired by -- and admired -- musicians across racial boundaries. The white jazz guitarist Les Paul -- of whom we'll almost certainly be hearing more -- used to tell a story. Paul was so amazed by Bob Wills' music that in 1938 he travelled from Waukesha Wisconsin, where he was visiting his mother, to Tulsa, Oklahoma, to hear Wills' band play, after his mother made him listen to Bob Wills on the radio. Paul was himself a famous guitarist at the time, and he got drawn on stage to jam with the band.\n\nAnd then, in an interval, a black man in the audience -- presumably this must have been an integrated audience, which would have been *very* unusual in 1938 in Oklahoma, but this is how Les Paul told the story, and other parts of it check out so we should probably take his word for it absent better evidence -- came up and asked for Les Paul's autograph. He told Paul that he played guitar, and Paul said for the young man to show him what he could do. The young man did, and Paul said “Jesus, you *are* good. You want to come up and sit in with us?”\n\nAnd he did -- that was the first time that Les Paul met his friend Charlie Christian, shortly before Christian got the offer from Benny Goodman. Hanging out and jamming at a Bob Wills gig.\n\nSo we can, for the most part, safely put Bob Wills into the mutual respect and influence category. He was someone who had the respect of his peers, and was part of a chain of influences crossing racial and stylistic boundaries.\n\nIt gets more difficult when you get to someone like Pat Boone, a few years later, who would record soundalike versions of black musicians' hits specifically to sell to people who wouldn't buy music by black people and act as a spoiler for their records. That's ethically very, very dodgy, plus Boone was a terrible musician.\n\nBut what I think we can all agree on is that just outright stealing a black musician's song, crediting it to a white musician, and making it a massive hit is just wrong. And sadly that happened with Bob Wills' band at least once.\n\nNow, Leon McAuliffe, the Texas Playboys' steel guitar player, is the credited composer of \"Steel Guitar Rag\", which is the instrumental which really made the steel guitar a permanent fixture in country and western music. Without this instrumental, country music would be totally different.\n\n[insert a section of \"Steel Guitar Rag\" by Bob Wills]\n\nThat's from 1936. Now, in 1927, the guitarist Sylvester Weaver made a pioneering recording, which is now often called the first recorded country blues, the first recorded blues instrumental, and the first slide guitar recording (as I've said before, there is never a first, but Weaver's recording is definitely important). That track is called \"Guitar Rag\" and... well...\n\n[insert \"Guitar Rag\" by Sylvester Weaver].\n\nLeon McAuliffe always claimed he'd never heard Sylvester Weaver's song, and came up with Steel Guitar Rag independently. Do you believe him?\n\nSo, the Texas Playboys were not averse to a bit of plagiarism. But the song we're going to talk about for the rest of the episode is one that would end up plagiarised itself, very famously.\n\n\"Ida Red\" is an old folk song, first recorded in 1924. In fact, structurally it's a hokum song. As is often the case with this kind of song, it's part of a massive family tree of other songs -- there are blues and country songs with the same melody, songs with different melodies but mentions of Ida Red, songs which contain different lines from the song... many folk songs aren't so much songs in themselves as they are labels you can put on a whole family. There's no one song \"Ida Red\", there's a whole bunch of songs which are, to a greater or lesser extent, Ida Red. \"Ida Red\" is just a name you can slap on that family, something you can point to.\n\nMost versions of \"Ida Red\" had the same chorus -- \"Ida Red, Ida Red, I'm plum fool about Ida Red\" -- but different lyrics, often joking improvised ones. Here's the first version of \"Ida Red\" to be recorded -- oddly, this version doesn't even have the chorus, but it does have the chorus melody played on the fiddle. This is Fiddlin' Powers and Family, singing about Ida Red who weighs three hundred and forty pounds, in 1924:\n\n[insert Fiddlin Powers version of \"Ida Red\"]\n\nWills' version is very differently structured. It has totally different lyrics -- it has the familiar chorus, but the verses are totally different and have nothing to do with the character of Ida Red -- \"Light's in the parlour, fire's in the grate/Clock on the mantle says it's a'gettin' late/Curtains on the window, snowy white/The parlour's pleasant on Sunday night\"\n\n[insert Bob Wills version of \"Ida Red\"]\n\nThose lyrics -- and all the other lyrics in Wills' version except the chorus, were taken from an 1878 parlour song called \"Sunday Night\" by George Frederick Root, a Civil War era songwriter who is now best known as the writer of the melody we now know as \"Jesus Loves the Little Children\". They're cut down to fit into the fast-patter do-si-do style of the song, but they're still definitely the same lyrics as Root's.\n\n\"Ida Red\" was one of many massive hits for Wills and the Texas Playboys, who continued to be hugely successful through the 1940s, at one point becoming a bigger live draw than Benny Goodman or Tommy Dorsey, although the band's success started to decline when Tommy Duncan quit in 1948 over Wills' drinking -- Wills would often miss shows because of his binge drinking, and Duncan was the one who had to deal with the angry fans. Wills replaced Duncan with various other singers, but never found anyone who would have the same success with him.\n\nBob Wills and the Texas Playboys had a couple of hits in the very early 1950s -- one of them, indeed, was a sequel to Ida Red -- \"Ida Red Likes The Boogie\", a novelty boogie song of the type we discussed last week. (And think back to what I said then about the boogie fad persisting much longer than it should have. \"Ida Red Likes The Boogie\" was recorded in 1949 and went top ten in 1950, yet those boogie novelty songs I talked about last week were from 1940).\n\n[insert \"Ida Red Likes The Boogie\"]\n\nBut even as his kind of music was getting more into fashion under the name rock and roll, Wills himself became less popular. The band were still a popular live attraction through most of the 1950s, but they never again reached the heights of the 30s and 40s, and Wills' deteriorating health and the band's lack of success made them split up in 1965.\n\nBut before they'd split, Wills' music had had a lasting influence on rock and roll, and not just on the people you might expect. Remember how I talked about plagiarism? Well, in 1955, a musician went into Chess studios with a slight rewrite of \"Ida Red\" that he called \"Ida May\". Leonard Chess persuaded him to change the name because otherwise it would be too obvious where he stole the tune... and we will talk about \"Maybellene\" by Chuck Berry in a few weeks' time.\n\n<strong>Patreon</strong>\nAs always, this podcast only exists because of the donations of my backers on Patreon. If you enjoy it, <a href=\"http://patreon.com/andrewhickey\">why not join them</a>?",
  "enclosure": "",
  "itunes:summary": "Welcome to episode three of&nbsp;A History of Rock Music in Five Hundred Songs. Today we're looking at Bob Wills and \"Ida Red\".\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI mention a PhD thesis on the history of the backbeat in the episode. Here's a link to it.\n\nBob Wills' music is now in the public domain, so there are many different compilations available, of different levels of quality. This is an expensive but exhaustive one, while this is a cheap one which seems to have most of the important hits on it.\n\nThe definitive book on Bob Wills,&nbsp;San Antonio Rose, is available here, though it's a bit pricey.\n\nAnd for all the episodes on pre-1954 music, one invaluable source is the book \"Before Elvis\" by Larry Birnbaum.\n\nClarification\n\nIn the episode I talk about two tracks as being \"by Django Reinhardt\", but the clips I play happen to be ones featuring violin solos. Those solos are, of course, by Reinhardt's longtime collaborator Stephane Grapelli. I assume most people will know this, but just in case.\n\nTranscript\n\n\"Rock and Roll? Why, man, that's the same kind of music we've been playin' since 1928! ... We didn't call it rock and roll back when we introduced it as our style back in 1928, and we don't call it rock and roll the way we play it now. But it's just basic rhythm and has gone by a lot of different names in my time. It's the same, whether you just follow a drum beat like in Africa or surround it with a lot of instruments. The rhythm's what's important.\"\n\nBob Wills said that in 1957, and it brings up an interesting question. What's in a name?\n\nGenre names are a strange thing, aren't they? In particular, did you ever notice how many of them had the word \"and\" in them? Rock and roll, rhythm and blues, country and western? There's sort of a reason for that.\n\nRock and roll is a special case, but the other two were names that were coined by Billboard, and they weren't originally meant to be descriptors of a single genre, but of collections of genres -- they were titles for its different charts. Rhythm and blues is a name that was used to replace the earlier name, of \"race\" records, because that was thought a bit demeaning. It was for the chart of \"music made by black people\", basically, whatever music those black people were making, so they could be making \"rhythm\" records, or they could be making \"blues\" records.\n\nOnly once you give a collection of things a name, the way people's minds work, they start thinking that because those things share a name they're the same kind of thing. And people start thinking about \"rhythm and blues\" records as being a particular kind of thing. And then they start making \"rhythm and blues\" records, and suddenly it is a thing.\n\nThe same thing goes for country and western. That was, again, two different genres. Country music was the music made by white people who lived in the rural areas, of the Eastern US basically -- people like the Carter Family, for example.\n\n[Excerpt of “Keep on the Sunny Side” by the Carter Family]\n\nWe'll hear more about the Carter family in the future, but that's what country music was. Not country and western, just country. And that was the music made in Appalachia, especially Kentucky and Tennessee, and especially especially Nashville.\n\nWestern music was a bit different. That was the music being made in Texas, Oklahoma, and California, and it tended to use similar instrumentation to country music -- violins and guitars and so on -- but it had different subject matter -- lots of songs about cowboys and outlaws and so on -- and at the time we're talking about, the thirties and forties, it was a little bit slicker than country music.\n\nThis is odd in retrospect, because not many years later the Western musicians influenced people like Johnny Cash, Buck Owens, and Merle Haggard, who made very gritty, raw, unpolished music compared to the country music coming out of Nashville, but the thirties an",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode three of&nbsp;A History of Rock Music in Five Hundred Songs. Today we're looking at Bob Wills and \"Ida Red\".\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI mention a PhD thesis on the history of the backbeat in the episode. Here's a link to it.\n\nBob Wills' music is now in the public domain, so there are many different compilations available, of different levels of quality. This is an expensive but exhaustive one, while this is a cheap one which seems to have most of the important hits on it.\n\nThe definitive book on Bob Wills,&nbsp;San Antonio Rose, is available here, though it's a bit pricey.\n\nAnd for all the episodes on pre-1954 music, one invaluable source is the book \"Before Elvis\" by Larry Birnbaum.\n\nClarification\n\nIn the episode I talk about two tracks as being \"by Django Reinhardt\", but the clips I play happen to be ones featuring violin solos. Those solos are, of course, by Reinhardt'",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}