{
  "title": "Sean Bobbitt - Cinematographer",
  "pubDate": "Wed, 16 Jun 2021 09:00:00 +0000",
  "guid": "9609ad70-246b-49a4-b91b-1d3b49c2b7a9",
  "link": "https://teamdeakins.libsyn.com/sean-bobbitt-cinematographer",
  "itunes:image": "",
  "description": "<p>EPISODE 124 - SEAN BOBBITT - Cinematographer<br /> <br /> Team Deakins has an interesting conversation with cinematographer, Sean Bobbitt (JUDAS AND THE BLACK MESSIAH, WIDOWS, 12 YEARS A SLAVE). We cover a lot of ground, starting with his beginnings in news coverage. We learn how cinematographer Billy Williams set him on his path and he shares his experience of shooting the film Wonderland and working with director, Michael Winterbottom. We also talk about his experiences with directors Steve Mcqueen and Neil Jordan. He also shares how he mixes color temperatures to create depth and interest, how he works in prep and how he lights a set. An in-depth conversation with a talented DP!</p>",
  "content:encoded": "<p>EPISODE 124 - SEAN BOBBITT - Cinematographer  Team Deakins has an interesting conversation with cinematographer, Sean Bobbitt (JUDAS AND THE BLACK MESSIAH, WIDOWS, 12 YEARS A SLAVE). We cover a lot of ground, starting with his beginnings in news coverage. We learn how cinematographer Billy Williams set him on his path and he shares his experience of shooting the film Wonderland and working with director, Michael Winterbottom. We also talk about his experiences with directors Steve Mcqueen and Neil Jordan. He also shares how he mixes color temperatures to create depth and interest, how he works in prep and how he lights a set. An in-depth conversation with a talented DP!</p>",
  "enclosure": "",
  "itunes:duration": "01:24:42",
  "itunes:explicit": false,
  "itunes:keywords": "filmmaking,cinematographer,deakins,stevemcqueen,visualarts,filmlighting,seanbobbitt",
  "itunes:subtitle": "EPISODE 124 - SEAN BOBBITT - Cinematographer  Team Deakins has an interesting conversation with cinematographer, Sean Bobbitt (JUDAS AND THE BLACK MESSIAH, WIDOWS, 12 YEARS A SLAVE). We cover a lot of ground, starting with his beginnings in news...",
  "itunes:episode": 124,
  "itunes:episodeType": "full"
}