{
  "title": "Episode 19: The Population Boom Could Save the World",
  "itunes:title": "Episode 19: The Population Boom Could Save the World",
  "pubDate": "Wed, 21 Jun 2017 16:00:00 +0000",
  "guid": "5a883eb744bc3b76d6813f0e21bf140b",
  "link": "https://wordsandnumbers.libsyn.com/the-population-boom-could-save-the-world",
  "itunes:image": "",
  "description": "<p>In 1798, 95 percent of the world lived in poverty. Today, less than 10 percent do, in spite of the world’s population growing by 700 percent in that same time.<br /> <br /> The common thought among young people is that this 700 percent population growth is going to overpopulate the earth. But given the number of people in poverty, it looks like population growth is actually good for poverty – more people means more brains, which means more ideas, inventions, and innovations.<br /> <br /> This week on Words and Numbers, Antony Davies and James R. Harrigan talk about how and why the world is improving despite widespread negativity towards the idea of a growing world population, and why that negativity persists regardless of the prosperity we see every day.</p>",
  "content:encoded": "<p>In 1798, 95 percent of the world lived in poverty. Today, less than 10 percent do, in spite of the world’s population growing by 700 percent in that same time.  The common thought among young people is that this 700 percent population growth is going to overpopulate the earth. But given the number of people in poverty, it looks like population growth is actually good for poverty – more people means more brains, which means more ideas, inventions, and innovations.  This week on Words and Numbers, Antony Davies and James R. Harrigan talk about how and why the world is improving despite widespread negativity towards the idea of a growing world population, and why that negativity persists regardless of the prosperity we see every day.</p>",
  "enclosure": "",
  "itunes:duration": "13:46",
  "itunes:explicit": false,
  "itunes:keywords": "education,politics,government,economics,Opinion,overpopulation",
  "itunes:subtitle": "In 1798, 95 percent of the world lived in poverty. Today, less than 10 percent do, in spite of the world’s population growing by 700 percent in that same time.  The common thought among young people is that this 700 percent population growth is...",
  "itunes:season": 1,
  "itunes:episode": 19,
  "itunes:episodeType": "full",
  "itunes:author": "Foundation for Economic Education"
}