{
  "id": "tag:blogger.com,1999:blog-8913912091036362264.post-2065962055776445822",
  "published": "2020-04-28T09:00:00.000-07:00",
  "updated": "2020-04-28T09:04:14.342-07:00",
  "title": "Expanding fact checks on YouTube to the United States",
  "content": "Over the past several years, we've seen more and more people coming to YouTube for news and information. They want to get the latest on an election, to find multiple perspectives on a topic, or to learn about a major breaking news event. More recently, the outbreak of COVID-19 and its spread around the world has reaffirmed how important it is for viewers to get accurate information during fast-moving events. That's why we're continuing to improve the news experience on YouTube, including <a href=\"https://youtube.googleblog.com/2019/12/the-four-rs-of-responsibility-raise-and-reduce.html\" target=\"_blank\">raising up authoritative sources</a> of information across the site. Today, we’re continuing this work by expanding our <a href=\"https://support.google.com/youtube/answer/9229632?hl=en\" target=\"_blank\">fact check information panels</a>&nbsp;<span style=\"background-color: white; color: #222222; font-family: &quot;roboto&quot; , &quot;arial&quot; , sans-serif; font-size: 16px;\">—&nbsp;</span>which we launched in Brazil and India last year&nbsp;<span style=\"background-color: white; color: #222222; font-family: &quot;roboto&quot; , &quot;arial&quot; , sans-serif; font-size: 16px;\">—&nbsp;</span>to the United States.<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-EhceewYPahY/XqcyETmZqYI/AAAAAAAAAyg/t8EYnOShQRsILncZIb3E1z8YGKIGOJutgCLcBGAsYHQ/s1600/Fact%2Bcheck_Covid%2B%252B%2Bibuprofen%2B%25281%2529.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1600\" data-original-width=\"832\" src=\"https://1.bp.blogspot.com/-EhceewYPahY/XqcyETmZqYI/AAAAAAAAAyg/t8EYnOShQRsILncZIb3E1z8YGKIGOJutgCLcBGAsYHQ/s1600/Fact%2Bcheck_Covid%2B%252B%2Bibuprofen%2B%25281%2529.png\" /></a></div><br /><br />The fact check feature expands upon the other ways we raise and connect people with authoritative sources. For example, our <a href=\"https://support.google.com/youtube/answer/9057101?hl=en&amp;ref_topic=9257092\" target=\"_blank\">Breaking News and Top News shelves</a> help our viewers find information from authoritative sources both on their YouTube homepage and when searching for news topics. In 2018, we introduced information panels that help surface a wide array of contextual information, from links to sources like Encyclopedia Britannica and Wikipedia for topics prone to longstanding misinformation (e.g. \"flat earth\" theories), or more recently, linking to the WHO, CDC or local health authorities for videos and searches related to COVID-19. We're now using these panels to help address an additional challenge: Misinformation that comes up quickly as part of a fast-moving news cycle, where unfounded claims and uncertainty about facts are common. (For example, a false report that COVID-19 is a bio-weapon.) Our <a href=\"https://support.google.com/youtube/answer/9229632?hl=en\" target=\"_blank\">fact check information panels</a> provide fresh context in these situations by highlighting relevant, third-party fact-checked articles above search results for relevant queries, so that our viewers can make their own informed decision about claims made in the news. <br /><br />There are a few factors that determine whether a fact check information panel will appear for any given search. Most important, there must be a relevant fact check article available from an eligible publisher. And in order to match a viewer’s needs with the information we provide, fact checks will only show when people search for a specific claim. For example, if someone searches for \"did a tornado hit Los Angeles,\" they might see a relevant fact check article, but if they search for a more general query like  \"tornado,\" they may not. All fact check articles must also comply with our Community Guidelines, and viewers can <a href=\"https://support.google.com/youtube/answer/4347644?hl=en&amp;co=GENIE.Platform=Desktop\" target=\"_blank\">send feedback</a> to our team. <br /><br />Our fact check information panel relies on an open network of third-party publishers and leverages the <a href=\"https://www.claimreviewproject.com/\" target=\"_blank\">ClaimReview</a> tagging system. All U.S. publishers are welcome to participate as long as they follow the publicly-available ClaimReview standards and are either a verified signatory of the International Fact-Checking Network’s (IFCN) Code of Principles or are an <a href=\"https://support.google.com/youtube/answer/9229632?hl=en&amp;ref_topic=9257092\" target=\"_blank\">authoritative publisher</a>. Over a dozen U.S. publishers are participating today, including The Dispatch, FactCheck.org, PolitiFact and The Washington Post Fact Checker, and we encourage more publishers and fact checkers to explore using ClaimReview. In addition to this roll out, YouTube will provide $1M through the <a href=\"https://newsinitiative.withgoogle.com/\" target=\"_blank\">Google News Initiativ</a>e to the IFCN to bolster fact-checking and verification efforts across the world. This follows Google’s <a href=\"https://www.blog.google/outreach-initiatives/google-news-initiative/covid-19-65-million-help-fight-coronavirus-misinformation/\" target=\"_blank\">efforts</a> to support the ecosystem in the midst of the challenging COVID-19 environment, and we'll be looking for more ways to support the fact check ecosystem in the future. <br /><br />As always, it will take some time for our systems to fully ramp up. Our systems will become more accurate, and over time, we'll roll this feature out to more countries. We are committed to our responsibility to protect the YouTube community, and expanding our fact check information panels is one of the many steps we are taking to raise up authoritative sources, provide relevant and authoritative context to our users, and continue to reduce the spread of harmful misinformation on YouTube.",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube",
    "uri": "http://www.blogger.com/profile/03369985352764236236",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}