{
  "title": "Patricia Norland interview &#8211; Vietnam War and Indochina War military history book &#8211; &#8220;Saigon Sisters&#8221; (Cornell University Press, 2020)",
  "link": "http://warscholar.org/vietnam-war-and-indochina-war-military-history-book-saigon-sisters-cornell-university-press-2020-patricia-norland-interview/",
  "pubDate": "Fri, 17 Jul 2020 01:45:46 +0000",
  "guid": "http://warscholar.org/?p=1540",
  "comments": "http://warscholar.org/vietnam-war-and-indochina-war-military-history-book-saigon-sisters-cornell-university-press-2020-patricia-norland-interview/#respond",
  "wfw:commentRss": "http://warscholar.org/vietnam-war-and-indochina-war-military-history-book-saigon-sisters-cornell-university-press-2020-patricia-norland-interview/feed/",
  "slash:comments": 0,
  "category": [
    "All Modern War",
    "author",
    "France",
    "interview",
    "United States",
    "Vietnam War",
    "afghanistan",
    "black pajamas",
    "church world service",
    "communism",
    "conflict",
    "cornell university press",
    "double agent",
    "double lives",
    "French",
    "French Army",
    "French colonial",
    "French Lycee",
    "history",
    "International Workers day",
    "Japan",
    "Ken Burns",
    "maquis",
    "military",
    "military history",
    "National day of the student",
    "NIU",
    "non-fiction book",
    "podcast",
    "resistance",
    "Saigon",
    "US Embassy",
    "US Navy",
    "Viet Cong",
    "vietnam war",
    "war",
    "wwII"
  ],
  "description": "Check out this book here   https://amzn.to/392NdWN Patricia worked for many years in the US Foreign Service. Before this time, she was with a non-profit organization and met nine women who fought against the French and the Americans in the Vietnam War. Patricia kept in touch with these women and after retiring from the foreign service…",
  "enclosure": "",
  "itunes:subtitle": "Check out this book here   https://amzn.to/392NdWN Patricia worked for many years in the US Foreign Service. Before this time, she was with a non-profit organization and met nine women who fought against the French and the Americans in the Vietnam War....",
  "itunes:summary": "<a href=\"https://amzn.to/392NdWN\">Check out this book here</a>   <a href=\"https://amzn.to/392NdWN\">https://amzn.to/392NdWN</a><br />\nPatricia worked for many years in the US Foreign Service. Before this time, she was with a non-profit organization and met nine women who fought against the French and the Americans in the Vietnam War. Patricia kept in touch with these women and after retiring from the foreign service she wrote a book about these women&#8217;s wartime experiences. We spoke about the book, Saigon Sisters, these women, and the Indochina and Vietnam Wars.<br />\n(THE AUDIO PLAYER IS AT THE BOTTOM OF THE POST.)<br />\nEditor’s note: Patricia Norland sent an email clarifying a statement she made during the Interview: “Separately, I should clarify my statement about &#8220;managing&#8221; the Fulbright program while serving in HCMC; my job was to manage exchange programs, but Fulbright, wisely, establishes a Commission in each country (with ED) that &#8212; while coordinating with others&#8211; runs the program.&#8221;<br />\n0:42 &#8211; Patricia talks about why she wrote this book and how she met the women she wrote about.<br />\n5:09 &#8211; We talk about how these nine women gave up privileged lives to fight the French and Americans in the Indochina Wars.<br />\n7:04 &#8211; Patricia talks about how she breaks the book into two parts- the lives they had before war to 1950 and then 1954, the war years to post 1975.<br />\n13:07 &#8211; Patricia reads an excerpt from the book discussing the patriotic zeal of the women the book is about.<br />\n15:13 &#8211; Patricia talks about the conservative nationalism that motivated the Vietnamese Communist revolution.<br />\n16:59 &#8211; Patricia shares some of the revolutionary poems that these fighters wrote.<br />\n19:51 &#8211; Patricia talks about how these teenagers were recruited into the revolution.<br />\n23:39 &#8211; Patricia reads a passage regarding the Japanese occupation of Vietnam and their misuse of rice by troops.<br />\n25:59 &#8211; Patricia talks about where these women ended up once they joined up with the revolution.<br />\n30:42 &#8211; Patricia reads a passage from the first woman in the group who joined the Vietnamese Maquis.<br />\n33:14 &#8211; Patricia talks about the research she did for the book and the interviews she did.<br />\n38:19 &#8211; Patricia talks about the personal items from the war that these women showed her.<br />\n41:41 &#8211; Patricia talks about how these women could have had much easier lives if they had turned away from the war. She also addresses how there is disappointment about what happened after 1975.<br />\n44:06 &#8211; Patricia talks more about the disillusionment of their struggle.<br />\n46:21 &#8211; Patricia talks about the American presence in Vietnam.<br />\n49:53 &#8211; Patricia talks about how these women continued fighting against the Americans once they replaced the French.<br />\n51:20 &#8211; Patricia talks about gender inequality within the revolutionary ranks.<br />\n52:28 &#8211; Patricia talks about some moving moments in their story.<br />\n1:04:05 &#8211; Information on the book can be found on the Cornell University Press website.<br />\n&nbsp;<br />\nLinks of interest<br />\n<a href=\"https://amzn.to/392NdWN\">https://amzn.to/392NdWN</a><br />\n<a href=\"https://www.cornellpress.cornell.edu/book/9781501749735/the-saigon-sisters/\">https://www.cornellpress.cornell.edu/book/9781501749735/the-saigon-sisters/</a><br />\n<a href=\"https://www.cornellpress.cornell.edu/vietnamese-women-privilege-and-persistence/\">https://www.cornellpress.cornell.edu/vietnamese-women-privilege-and-persistence/</a><br />\n&nbsp;<br />\nFor more “Military History Inside Out” please follow me at <a href=\"http://www.warscholar.org/\">www.warscholar.org</a>, on Facebook at <a href=\"https://www.facebook.com/Warscholarorg-Military-History-News-and-Education-115795938127/\">warscholar</a>, on twitter at <a href=\"https://twitter.com/Warscholar\">Warscholar</a>,",
  "itunes:author": "Cris Alvarez",
  "itunes:image": "",
  "itunes:duration": "1:10:34",
  "post-id": 1540
}