{
  "title": "NATO country announces plan to tackle public support for Russia",
  "link": "https://www.rt.com/news/565970-slovakia-facebook-ukraine-narratives/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565970-slovakia-facebook-ukraine-narratives/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63655f3020302719b573a941.jpg\" /> Bratislava wants AI tools to fight Russian “disinformation” as nearly half of Slovaks reportedly trust Moscow more than Washington <br/><a href=\"https://www.rt.com/news/565970-slovakia-facebook-ukraine-narratives/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Slovakian officials respond as polls reveal half of the population trusts Moscow more than Washington</strong></p>\n            \n                        \n            <p>The Slovakian government has accused Russia of waging a <em>&ldquo;disinformation campaign&rdquo;</em> on Facebook and announced it would invest in artificial intelligence programs to help its Hybrid Threats division cope with social media narratives.</p>\n<p>This comes as polls showed that 44% of Slovaks don&rsquo;t think Russia caused the ongoing conflict in Ukraine.&nbsp;</p>\n<p>Slovakia&rsquo;s Center for Countering Hybrid Threats &ndash; a subsidiary of the Finland-based European Centre of Excellence &ndash; is run from the Interior Ministry, which is charged with domestic law enforcement. The unit&rsquo;s director, Daniel Milo, told Bloomberg on Friday that the AI will <em>&ldquo;allow us to have a better overview of what is happening online and whether it is managed from abroad.&rdquo;</em></p>\n<p><strong></strong>According to Milo, pro-Ukrainian and pro-Russian narratives on social media were at parity in February, when the current conflict in Ukraine escalated, <em>&ldquo;but in the course of a few months, the situation shifted.&rdquo;</em></p>\n<p><strong></strong><em>&ldquo;Pro-Russian Facebook posts prevailed more and more. It is the result of this disinformation campaign, part of the population is indoctrinated by pro-Russian propaganda,&rdquo;</em> Milo said, adding that Slovaks are prone to believing in conspiracy theories.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6364da3785f5402cd913ffa9.jpg\" alt=\"FILE PHOTO. Frankfurt, Germany.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565941-study-more-germans-agree-russian-narratives/\">Number of Germans who agree with Russia's position on Ukraine increasing – study</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p><strong></strong>A May survey&nbsp;by the Bratislava-based think-tank GLOBSEC, referenced in the article, showed that 51% of Slovaks blamed Russia for the conflict in Ukraine, while 28% said the West had provoked Russia, and 16% said it was Ukraine's fault for violating the rights of Russian-speaking residents. Bloomberg also referenced another survey that reportedly showed more Slovaks trust Russia over the US, Bratislava&rsquo;s NATO ally.</p>\n<p><strong></strong>Slovakia has taken in thousands of refugees from neighboring Ukraine and sent Kiev military aid in the form of tanks&nbsp;and air defense missiles, even hinting at the possibility of delivering fighter jets.&nbsp;</p>\n<p><strong></strong>Bratislava&rsquo;s apparent disdain for domestic dissenters resembles the attitude of the neighboring Czechs. After over 70,000 demonstrators marched against his policies in Prague at the start of September, Czech PM Petr Fiala said that <em>&ldquo;Russian propaganda and disinformation campaigns are present on our territory and some people simply listen to them.&rdquo;</em></p>\n<p><strong></strong>Russia sent troops into Ukraine on February 24, citing Kiev&rsquo;s failure to implement the Minsk agreements, designed to give the regions of Donetsk and Lugansk special status within the Ukrainian state. The protocols, brokered by Germany and France, were first signed in 2014. Former Ukrainian President Pyotr Poroshenko has since admitted that Kiev&rsquo;s main goal was to use the ceasefire to buy time and <em>&ldquo;create powerful armed forces.&rdquo;</em></p>\n<p><strong></strong>In February 2022, the Kremlin recognized the Donbass republics as independent states and demanded that Ukraine officially declare itself a neutral country that will never join any Western military bloc. Kiev insists the Russian offensive was completely unprovoked.</p>",
  "enclosure": "",
  "pubDate": "Fri, 04 Nov 2022 21:21:10 +0000",
  "dc:creator": "RT"
}