{
  "id": "https://bibleinoneyear.org/en/youth/231",
  "title": "Day 231: Sixteen Characteristics of Love",
  "description": "Psalm 100:3–5, Song of Songs 8:6–7, 1 Corinthians 12:27–31, 13:1–8a,13.  It should be the main thing in your life  It is, in the words of St Paul, ‘the most excellent way’ (1 Corinthians 12:31)",
  "pubDate": "Fri, 19 Aug 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/231/",
  "itunes:duration": "14:52",
  "guid": "enyouth19082022-231",
  "length": 892.66,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 231: Sixteen Characteristics of Love",
  "itunes:subtitle": "Psalm 100:3–5, Song of Songs 8:6–7, 1 Corinthians 12:27–31, 13:1–8a,13.  It should be the main thing in your life  It is, in the words of St Paul, ‘the most excellent way’ (1 Corinthians 12:31)",
  "itunes:summary": "I tried following the example of a missionary I once heard about who, each day, would read the four verses from today’s New Testament passage, which lists sixteen characteristics of love. For the word ‘love’ she would substitute her own name. When she reached a characteristic that she knew was not true of her, she had to stop. Her aim was, one day, to get through the whole list.\nThe four verses (1 Corinthians 13:4–7) start with ‘love is patient’. So I substituted my own name and started with ‘Nicky is patient’. I do not think it will come as any surprise to those who know me well that I had to stop there!\nThe great evangelist D.L. Moody was once staying with friends in England. One evening they asked Henry Drummond to expound on a portion of Scripture. After some urging, Henry drew a small New Testament from his pocket, opened it at 1 Corinthians 13 and began to speak on the subject of love. D.L. Moody wrote in response:\n‘It seemed to me that I had never heard anything so beautiful. The one great need in our Christian life is love, more love to God and to each other. Would that we could all move into that love chapter and live there.’\nWe get an idea of what Drummond must have said that evening in his book, The Greatest Thing in the World. He writes: ‘What is... the supreme good? You have life before you. Once only you can live it. What is the noblest object of desire, the supreme gift to covet?’ In 1 Corinthians 13 ‘Paul takes us to Christianity at its source; and there we see, “The greatest of these is love.”’\nGod is love. We deceive ourselves if we think we can love God and hate other people (1 John 4:20). Love should be number one on your spiritual priority list. It should be the main thing in your life. It is, in the words of St Paul, ‘the most excellent way’ (1 Corinthians 12:31).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 596
}