{
  "id": "yt:video:o4mERYo9edo",
  "yt:videoId": "o4mERYo9edo",
  "yt:channelId": "UC9_p50tH3WmMslWRWKnM7dQ",
  "title": "One-pan tuna noodle casserole (that actually tastes like something)",
  "link": "",
  "author": {
    "name": "Adam Ragusea",
    "uri": "https://www.youtube.com/channel/UC9_p50tH3WmMslWRWKnM7dQ"
  },
  "published": "2022-10-20T18:00:30+00:00",
  "updated": "2022-10-24T21:33:27+00:00",
  "media:group": {
    "media:title": "One-pan tuna noodle casserole (that actually tastes like something)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Thanks to Squarespace for sponsoring this video! Go to Squarespace.com for a free trial, and when you’re ready to launch, go to http://squarespace.com/ragusea and add code “RAGUSEA\" at checkout to save 10% off your first purchase of a website or domain.\n\nSeafoodwatch.org's guide for buying sustainable canned tuna: https://www.seafoodwatch.org/stories/tips-for-choosing-sustainable-canned-tuna\n\n***RECIPE, SERVES 6-8***\n\n1 12 oz (340g) bag dried egg noodles\n4 5 oz (140g) cans of tuna\n1 12 oz (340g) jar of marinated artichokes\n1 lb (454g) fresh green beans\n1 sweet red pepper\n3-4 small hot peppers (or another sweet pepper)\n2 bunches of green onions\n1 qt (1 liter) milk (or non-dairy milk, or stock, or water)\n1 750mL bottle of dry white wine (or less, or none)\n1 stick (113g) butter (or 1/2 cup, 120mL olive oil)\n1/2 gup (60g) all-purpose flour\ngrated parmesan or pecorino cheese (optional)\ngarlic powder\nonion powder\ndried thyme (or other dried herbs)\nsalt\npepper\n\nHeat a large, stove-safe baking dish over medium. Melt in the butter then whisk in the flour until smooth. Keep whisking as the roux cooks for a minute or two until it's just starting to turn brown and it starts to smell a little nutty. Gradually whisk in the milk until smooth. Bring the sauce to a simmer until it thickens, then take the heat down to low, and remember to stir it occasionally while you do everything else, so the bottom doesn't burn.\n\nSnip the stem ends off all the green beans and then just them into large chunks. Stir those into the sauce. Seed the peppers, cut into thin slices and stir into the sauce. Tear any decaying outer layers off the green onions, trim off the roots, thinly slice both the whites and greens and stir into the sauce. Stir in the artichokes and their marinade. Dump in the tuna, season heavily with garlic powder, onion powder, dry herbs, black pepper and a big pinch of salt. Stir, taking care to not break up the tuna too much (there's more stirring to come, so go easy on it).\n\nStir in the dry, uncooked egg noodles. Top off with enough wine (or water, or stock, etc) to just barely cover everything and stir. Taste the liquid and add more seasoning if needed — it should taste a little too salty on its own. Make sure all the noodles are pushed down just below the water line. Grate some cheese on top, if you want.\n\nCover the pan tightly with foil and bake at 400ºF/200ºC until the noodles are soft and most of the liquid is absorbed, 45-60 min. Uncover and bake until the top is nice and brown, another 20 min or so. Let rest to solidify before scooping. Leftovers reheat great.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}