{
  "id": "yt:video:LoTaJE16uLk",
  "yt:videoId": "LoTaJE16uLk",
  "yt:channelId": "UCrlZs71h3mTR45FgQNINfrg",
  "title": "Why care about complex analysis? | Essence of complex analysis #1",
  "link": "",
  "author": {
    "name": "Mathemaniac",
    "uri": "https://www.youtube.com/channel/UCrlZs71h3mTR45FgQNINfrg"
  },
  "published": "2021-08-02T14:00:09+00:00",
  "updated": "2022-09-27T14:15:43+00:00",
  "media:group": {
    "media:title": "Why care about complex analysis? | Essence of complex analysis #1",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Complex analysis is an incredibly powerful tool used in many applications, specifically in solving differential equations (Laplace's and others via inverse Fourier / Laplace transforms), and of course, fundamental theorem of algebra, Riemann hypothesis, as well as solving complicated integrals to show off!\n\nThis is the start of a series on complex analysis, which focuses on the visual insights rather than the more traditional rigorous approach, so it is not very likely that we will touch upon more advanced, yet very remarkable theorems in complex analysis, like Riemann mapping theorem, or the Picard's theorems. This is more likely of more use to the applied mathematicians, physicists and engineers, at least in the first few videos, simply because the interesting theorems are most likely pushed towards the end, and grouped as \"applications of complex analysis\", like FTA and RH.\n\nThis is only currently my plan, and things are likely to change, but hopefully this is the backbone of what's coming next. I might not be uploading like weekly, but hopefully as frequently as I hope. \n\nVideos mentioned:\nhttps://www.youtube.com/playlist?list=PLiaHhY2iBX9g6KIvZ_703G3KJXapKkNaF (Welch Labs complex numbers playlist)\nhttps://www.youtube.com/watch?v=0z1fIsUNhO4 (Möbius transformations video)\nhttps://www.youtube.com/watch?v=b8_3PFjiJvY (Zach Star complex derivatives)\nhttps://www.youtube.com/playlist?list=PLSQl0a2vh4HC5feHa6Rc5c0wbRTx56nF7 (Khan academy playlist on vector calculus)\nhttps://www.youtube.com/playlist?list=PLHXZ9OQGMqxfW0GMqeUE1bLKaYor6kbHa (Dr Trefor Bazett’s playlist on vector calculus)\n\nSome (sort of) unexpected applications / connections to complex analysis:\nhttps://en.wikipedia.org/wiki/Joukowsky_transform (historical aerofoil application)\nhttp://math.colorado.edu/~kstange/papers/notes-Spin.pdf (Relationship between Möbius map and special relativity)\n\nOther than commenting on the video, you are very welcome to fill in a Google form linked below, which helps me make better videos by catering for your math levels:\nhttps://forms.gle/QJ29hocF9uQAyZyH6\n\nIf you want to know more interesting Mathematics, stay tuned for the next video!\n\nSUBSCRIBE and see you in the next video!\n\nIf you are wondering how I made all these videos, even though it is stylistically similar to 3Blue1Brown, I don't use his animation engine Manim, but I will probably reveal how I did it in a potential subscriber milestone, so do subscribe!\n\nSocial media:\n\nFacebook: https://www.facebook.com/mathemaniacyt\nInstagram: https://www.instagram.com/_mathemaniac_/\nTwitter: https://twitter.com/mathemaniacyt\nPatreon: https://www.patreon.com/mathemaniac (support if you want to and can afford to!)\n\nFor my contact email, check my About page on a PC.\n\nSee you next time!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}