{
  "itunes:episode": 77,
  "title": "Wedding March to One's Own Offbeat Drummer with Ariel Meadow Stallings",
  "pubDate": "Thu, 29 May 2014 15:04:24 +0000",
  "link": "http://newdisrupt.org/blog/2014/5/29/77-wedding-march-to-ones-own-offbeat-drummer-with-ariel-meadow-stallings",
  "description": "<p>Ariel Meadow Stallings is the proprietor of several \"offbeat\" sites about weddings, home and life, and families under the rubric <a href=\"http://offbeatempire.com/\">Offbeat Empire</a>. She started the wedding site in 2007 to promote a book on creative alternatives for brides, which built an audience hungry for much more of the same. She obliged and has been building her empire full-time since 2009.</p>\n\n<h2>Sponsors & patrons</h2>\n\n<p>This podcast is made possible through the support of sponsors and patrons.</p>\n\n<p>We've started a new kind of ad: \"indie ads\"! If you're a solo creator or small firm, we're offering discounted short ads with the kind underwriting of <a href=\"http://cardsagainsthumanity.com/\">Cards Against Humanity</a>. (CAH just launched a site where you can buy directly from them, including their Bigger Blacker Box and their 2012 and 2013 holiday packs, the profits from which are donated to charity.)</p>\n\n<p>Our indie advertisers this week are:</p>\n\n<p><a href=\"https://www.kickstarter.com/projects/1889906682/heat/\">Heat</a>, a new card game by Dave Chalker that's quick to learn and takes about 15 to 30 minutes to play. Players plan heists and try to keep the \"heat\" off themselves. It features snazzy art and is being funded on Kickstarter. <a href=\"https://www.kickstarter.com/projects/1889906682/heat/\">Visit the campaign</a> for more details.</p>\n\n<p>The surreal and sublime Andrew Ferguson. He has no product to sell you and he has no URL for you to visit.</p>\n\n<p>Thanks also to patrons Bryan Clark, Rönne Ogland, and Mike Mansor for <a href=\"http://www.patreon.com/newdisruptors\">supporting us directly through Patreon</a>! You can back this podcast for as little as $1 per month. At higher levels, we'll thank you on the air and send you mugs and T-shirts!</p>\n\n<h2>Show notes</h2>\n\n<p>Teresa Valdez Klein and Noah Iliinsky met through Ignite Seattle and <a href=\"http://www.geekwire.com/2014/video-watch-geeky-seattle-couple-get-married-five-minutes-ignite/\">got married during an event</a> in May. My wife, Lynn, and I were married in a chapel at Fort Worden and had our reception in <a href=\"https://flic.kr/p/6MhT2q\">a former dirigible hangar</a> (now a theater).</p>\n\n<p>Ariel's book is <em><a href=\"http://isbn.nu/1580053157\">Offbeat Bride: Creative Alternatives for Independent Brides</a></em>. <a href=\"http://www.economist.com/node/13174365\">My <em>Economist</em> article</a> about people who leave the 3,000th review on a popular book or item. Facebook's director of product <a href=\"https://www.facebook.com/mhudack/posts/10152148792566194\">ranted</a> about the trivialization of news.</p>\n\n<p>Marisa McClellan runs the <a href=\"https://www.facebook.com/mhudack/posts/10152148792566194\">Food in Jars</a> blog, and found her following of nearly 150,000 \"likers\" on Facebook resulted in 80 people seeing a recent post. Huh. She and I <a href=\"http://newdisrupt.org/blog/2013/8/29/episode-38-yes-we-can-with-marisa-mcclellan\">spoke last summer</a> for the podcast. <a href=\"http://theoatmeal.com/\">The Oatmeal</a> is a popular webcomic; its creator is based in Seattle.</p>\n\n<p>Offbeat Bride covered <a href=\"http://offbeatbride.com/2014/05/brooklyn-winter-wedding\">a wedding at reBar</a> in Brooklyn, which shut down shortly afterwards. The article went up after its owner had been charged with tax evasion, and the site <a href=\"http://offbeatbride.com/2014/05/brooklyn-winter-wedding/comment-page-1#comment-391976\">dealt with criticism</a> rather superbly in the comments.</p>\n\n<p>We ran an article in <em>The Magazine</em> about <a href=\"http://the-magazine.com/15/feed-me-see-more\">BuzzFeed's use of images</a> that they often don't license, and discovered that their methods likely fall within fair use.</p>\n\n<p>Co-working has become hot again. In Seattle, <a href=\"http://officenomads.com/\">Office Nomads</a> is the veteran shop and is expanding. Ariel and I met at <a href=\"https://www.wework.com/location/south-lake-union/\">We Work</a>, a new high-end space for startups that's quite affordable given the amenities. I'm looking into co-working at <a href=\"http://seattletechnicalbooks.com/\">Ada's Technical Books and Café</a>, the owner of which I interviewed in a podcast not long ago.</p>\n\n<p>(Photo of Ariel by Jenny Jimenez for Tugboat Yards.)</p>\n",
  "guid": "tag:soundcloud,2010:tracks/151791165",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "01:03:42",
  "itunes:subtitle": "Ariel Meadow Stallings is the proprietor of several \"offbeat\" sites about weddings, home and life, and families under the rubric Offbeat Empire.",
  "itunes:summary": "Ariel Meadow Stallings is the proprietor of several \"offbeat\" sites about weddings, home and life, and families under the rubric Offbeat Empire. She started the wedding site in 2007 to promote a book on creative alternatives for brides, which built an audience hungry for much more of the same. She obliged and has been building her empire full-time since 2009."
}