{
  "id": "https://bibleinoneyear.org/en/youth/182",
  "title": "Day 182: Seven Characteristics of Great Leaders",
  "description": "Psalm 78:56-57, 70-72, 2 Kings 4:1,3–13a,25b–26,32–34, Acts 21:10b–20. The task of an overseer is to pastor God’s flock, following the example of Jesus who said, ‘I am *the good shepherd*’ (John 10:11)  In the passages for today we see seven characteristics of good shepherds which are seen in all great Christian leaders",
  "pubDate": "Thu, 01 Jul 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/182/?ignore",
  "itunes:duration": "15:28",
  "guid": "enyouth01072021-182",
  "length": 928.86,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 182: Seven Characteristics of Great Leaders",
  "itunes:subtitle": "Psalm 78:56-57, 70-72, 2 Kings 4:1,3–13a,25b–26,32–34, Acts 21:10b–20. The task of an overseer is to pastor God’s flock, following the example of Jesus who said, ‘I am *the good shepherd*’ (John 10:11)  In the passages for today we see seven characteristics of good shepherds which are seen in all great Christian leaders",
  "itunes:summary": "An online survey listed all the qualities that people expect from ‘perfect’ pastors:\nThey preach for exactly twelve minutes.\nThey are twenty-eight years of age, but have been preaching for thirty years.\nThey work from 8 am until midnight every day, but are also the caretaker.\nThey frequently condemn sin, but never upset anyone.\nThey wear good clothes, buy good books, drive a good car, give generously to the poor and have a low salary.\nThey make fifteen daily calls to parish families, visit the housebound and the hospitalised, spend all their time evangelising the un-churched and are always in the office when they are needed.\nThey are also very good-looking!\nOf course, we all know that there is no such thing as a ‘perfect pastor’. Nevertheless, daunted by the high expectations that people have of their church leaders, on 1 July 2004 (when I had been asked to take on the role of Vicar at HTB in London), I felt both excited and a little overwhelmed by the responsibility. That day, I wrote my prayer in the margin of my Bible in One Year: that I, like David, would shepherd the people with integrity of heart and lead them with skilful hands (Psalm 78:72). This is still my prayer today.\nIn yesterday’s passage we saw how Paul said to the Ephesian elders, ‘Keep watch over yourselves and all the flock of which the Holy Spirit has made you overseers. Be shepherds of the church of God, which he bought with his own blood’ (Acts 20:28). Pope Francis urged the spiritual leaders of the church to ‘be shepherds living with the smell of sheep’.\nThe task of an overseer is to pastor God’s flock, following the example of Jesus who said, ‘I am the good shepherd’ (John 10:11). In the passages for today we see seven characteristics of good shepherds which are seen in all great Christian leaders.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 182
}