{
  "title": "Episode 103: &#8220;Hitch-Hike&#8221; by Marvin Gaye",
  "link": "https://500songs.com/podcast/episode-103-hitch-hike-by-marvin-gaye/",
  "pubDate": "Thu, 05 Nov 2020 12:41:55 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-103-hitch-hike-by-marvin-gaye/",
  "description": "Episode one hundred and three of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Hitch-Hike\" by Marvin Gaye, and the early career of one of Motown's defining artists. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/43562761\">\"Any Other Way\" by Jackie Shane</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Erratum</strong>\n\nI say that Smokey Robinson was the only person allowed to be both a writer/producer and performer at Motown. That was Marvin Gaye's later statement, but at this point Eddie Holland was also still doing all those things.\n\n<strong>Resources</strong>\n\nAs usual, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-103-hitch-hike-by-marvin-gaye/\">a Mixcloud streaming playlist </a>with full versions of all the songs in the episode.\n\nFor Motown-related information in this and other Motown episodes, I've used the following resources:\n\n<a href=\"https://amzn.to/2QTOvdM\"><em>Where Did Our Love Go? The Rise and Fall of the Motown Sound</em>&nbsp;by Nelson George</a>&nbsp;is an excellent popular history of the various companies that became Motown.\n\n<a href=\"https://amzn.to/2QQhXRZ\"><em>To Be Loved</em>&nbsp;by Berry Gordy</a>&nbsp;is Gordy's own, understandably one-sided, but relatively well-written, autobiography.\n\n<a href=\"https://amzn.to/2VIpXII\"><em>Women of Motown: An Oral History</em>&nbsp;by Susan Whitall</a> is a collection of interviews with women involved in Motown.\n\n<a href=\"https://amzn.to/2xVdvfD\"><em>I Hear a Symphony: Motown and Crossover R&B&nbsp;</em>by J. Andrew Flory</a>&nbsp;is an academic look at Motown.\n\n<a href=\"https://amzn.to/2VLquJX\"><em>The Motown Encyclopaedia</em>&nbsp;by Graham Betts</a>&nbsp;is an exhaustive look at the people and records involved in Motown's thirty-year history.\n\nAnd&nbsp;<a href=\"https://motownjunkies.co.uk/\">Motown Junkies</a>&nbsp;is an infrequently-updated blog looking at (so far) the first 693 tracks released on Motown singles.\n\nThere is a Complete Motown Singles 1959-62 box available from Hip-O-Select with comprehensive liner notes, but if you just want the music, I recommend instead&nbsp;<a href=\"https://amzn.to/2YbX0qa\">this much cheaper bare-bones box</a>&nbsp;from Real Gone Music.\n\nFor information on Gaye specifically, I relied on&nbsp;<a href=\"https://amzn.to/38eqYPi\"><em>Divided Soul: The Life of Marvin Gaye</em> by David Ritz</a>.\n\nThe best collection of Gaye's music is&nbsp;<a href=\"https://amzn.to/365uZD0\"><em>The Master</em></a>, a four-disc box covering his recordings from \"Stubborn Kind of Fellow\" to the very last recordings of his life.\n\n<strong>Transcript</strong>\n\nA brief note -- this week's episode contains some minor mentions of parental and domestic abuse, and some discussions of homophobia. I don't think those mentions will be upsetting for anyone, but if you're unsure you might want to check the transcript before listening.\n\nToday we're going to look at the start of one of the great careers in soul music, and one of the great artists to come out of the Motown hit factory. We're going to look at the continued growth of the Motown company, and at the personal relationships that would drive it in the 1960s, but would also eventually lead to its downfall. We're going to look at \"Hitch-Hike\", and the early career of Marvin Gaye:\n\n[Excerpt: Marvin Gaye, \"Hitch-Hike\"]\n\nOne thing we've not talked about much in the podcast so far is the way that the entertainment industry, until relatively recently, acted as a safety valve for society, a place where people who didn't fit in anywhere could build themselves a life and earn a living without playing along with the normal social conventions. And by instinct, temperament, and upbringing, Marvin Gaye was one of those people.\n\nHe was always someone who rubbed up against authority. He spent his youth fighting with his abusive father, and eventually left home to join the Air Force just to get away from his father. But he didn't stay long in the Air Force either -- he was discharged due to mental problems, which he later claimed he'd faked, with his honourable discharge stating \"Marvin Gay cannot adjust to regimentation and authority\".\n\nBack in Washington DC, where he'd grown up, and feeling like a failure, he formed a doo-wop group called the Marquees -- in later years, Gaye would state that he'd come up with the name as a reference to the Marquis de Sade, but in fact Gaye hadn't heard of de Sade at the time. The Marquees were like a million doo-wop groups of the time, and leaned towards the sweeter end of doo-wop, particularly modelling themselves on the Moonglows.\n\nThe group performed around Washington, and came to the attention of Bo Diddley, who was living in the area and friends with a neighbour of the group. Diddley took them under his wing and wrote and produced both sides of their first single, which had another member, Reese Palmer, singing lead -- Palmer also claimed that he wrote both songs, but Diddley is credited and they certainly sound like Diddley's work to me. The tracks were originally backed by Diddley's band, but Okeh, the record label for whom they were recording, asked that one of the two sides, \"Wyatt Earp\", be rerecorded with session musicians like Panama Francis who played on almost every R&B record made on the East Coast at the time. Oddly, listening to both versions, the version with the session musicians sounds rather more raw and Bo-Diddleyesque than the one with Diddley's band. The result had a lot of the sound of the records the Coasters were making around the same time:\n\n[Excerpt: The Marquees, \"Wyatt Earp\"]\n\nAt the same initial session, the Marquees also sang backing vocals on a record by Billy Stewart. We've encountered Stewart briefly before -- his first single, \"Billy's Blues\", was the first appearance of the guitar figure that later became the basis for \"Love is Strange\", and he played piano in Diddley's band. With Diddley's band and the Marquees he recorded \"Billy's Heartache\":\n\n[Excerpt: Billy Stewart, \"Billy's Heartache\"]\n\nHowever, the Marquees' first record did nothing, and the group were dropped by the label and went back to just playing clubs around Washington DC. It looked like their dreams of stardom were over. But one of the group's members, Chester Simmons, took a job as Bo Diddley's driver, and that was to lead to the group's second big break.\n\nDiddley was on a tour with the Moonglows, who as well as being fellow Chess artists had also backed Diddley on records like \"Diddley Daddy\":\n\n[Excerpt: Bo Diddley, \"Diddley Daddy\"]\n\nHarvey Fuqua, the group's leader, was complaining to Diddley about the rest of the group, and in particular about Bobby Lester, the group's tenor singer. He was thinking of dropping the entire group and getting a new, better, set of Moonglows to work with. Simmons heard Fuqua talking with Diddley about this, and suggested that the Marquees might be suitable for the job. When the tour hit DC, Fuqua auditioned the Marquees, and started working with them to get them up to the standard he needed, even while he was still continuing to tour with the original Moonglows.\n\nFuqua trained the Marquees in things like breath control. In particular, he had a technique he called \"blow harmony\", getting the group to sing with gentle, breathy, \"whoo\" sounds rather than the harder-edged \"doo\" sounds that most doo-wop groups used -- Fuqua was contemptuous of most doo-wop groups, calling them \"gang groups\". He taught the Marquees how to shape their mouths, how to use the muscles in their throats, and all the other techniques that most singers have to pick up intuitively or never learn at all. The breathy sound that Fuqua taught them was to become one of the most important techniques that Gaye would use as a vocalist throughout his career.\n\nFuqua took the group back with him to Chicago, and they added a sixth singer, Chuck Barkside, who doubled Simmons on the bass. There were attempts at expanding the group still further, as well -- David Ruffin, later the lead singer of the Temptations, auditioned for the group, but was turned down by Fuqua.\n\nThe group, now renamed Harvey and the Moonglows, cut a few tracks for Chess, but most were never released, but they did better as backing vocalists. Along with Etta James, they sang the backing vocals on two hits by Chuck Berry, \"Almost Grown\" and \"Back in the USA\":\n\n[Excerpt: Chuck Berry, \"Back in the USA\"]\n\nAt the time, Etta and Harvey were in a relationship, and Marvin took note -- being in a relationship with someone else in the industry could be good for your career. Marvin was starting to discover some other things, as well -- like that he really didn't enjoy being on stage, even though he loved singing, and that the strain of touring could be eased with the use of cannabis. Marvin didn't want to be on the stage at all -- he wanted to be making records. The studio was where he was comfortable.\n\nThe new Moonglows did release some recordings of their own, one of which, \"Mama Loochie\", had Marvin on lead vocals, and was cowritten by Marvin and Harvey:\n\n[Excerpt: Harvey and the Moonglows, \"Mama Loochie\"]\n\nAnother record that featured Marvin, though not as lead vocalist, was \"Twelve Months of the Year\", an attempt to recapture the success of the original Moonglows' \"Ten Commandments of Love\". On that one, Marvin does the spoken recitation at the beginning and end, as well as singing backing vocals:\n\n[Excerpt: Harvey and the Moonglows, \"Twelve Months of the Year\"]\n\nBut the Moonglows were coming to the end of their career -- and Harvey was also coming to the end of his relationship with Etta James. Anna Records, one of the labels owned by members of the Gordy family, had made a distribution agreement with Chess Records, and Leonard Chess suggested to Harvey that he move to Detroit and work with Anna as a Chess liaison. Soon Harvey Fuqua was fully part of the Gordy family, and he split up with Etta James and got into a relationship with Gwen Gordy. Gwen had split up with her own partner to be with Harvey -- and then Gwen and her ex, Roquel Davis, co-wrote a song about the split, which Etta James sang:\n\n[Excerpt: Etta James, \"All I Could Do Was Cry\"]\n\nMarvin had come with Harvey -- he'd signed with him as a solo artist, and Harvey thought that Marvin could become a Black Frank Sinatra, or better. Marvin was signed to Harvey Records, Harvey's label, but after Harvey and Gwen got together romantically, their various labels all got rolled up in the Motown family. At first, Marvin wasn't sure whether he would be recording at all once Harvey Records was shut down, but he made an impression on Berry Gordy by gatecrashing the Motown Christmas party in 1960 and performing \"Mr. Sandman\" at the piano.\n\nSoon he found that Berry Gordy had bought out his recording contract, as well as a fifty percent share of his management, and he was now signed with Tamla. Marvin was depressed by this to an extent -- he saw Fuqua as a father figure -- but he soon came to respect Gordy. He also found that Gordy's sister Anna was very interested in him, and while she was seventeen years older than him, he didn't see that as something that should stand in the way of his getting together with the boss' sister. There was a real love between the twenty year old Marvin Gaye and the thirty-seven-year-old Anna Gordy, but Gaye also definitely realised that there was an advantage to becoming part of the family -- and Berry Gordy, in turn, thought that having his artists be part of his family would be an advantage in controlling them.\n\nBut right from the start, Marvin and Berry had different ideas about where Marvin's career should go. Marvin saw himself becoming a singer in the same style as Nat \"King\" Cole or Jesse Belvin, while Gordy wanted him to be an R&B singer like everyone else at Motown. While Marvin liked singers like Sam Cooke, he was also an admirer of people like Dean Martin and Perry Como -- he would later say that the sweaters he wore in many photos in the sixties were inspired by Como, and that \"I always felt like my personality and Perry's had a lot in common\".\n\nThey eventually compromised -- Marvin would record an album of old standards, but there would be an R&B single on it, one side written by Berry, and the other written by Harvey and Anna. The Soulful Moods of Marvin Gaye was only the second album released by Motown, which otherwise concentrated on singles, but neither it nor the single Berry wrote, \"Let Your Conscience Be Your Guide\", had any commercial success:\n\n[Excerpt: Marvin Gaye, \"Let Your Conscience Be Your Guide\"]\n\nAs well as singing on the album, Marvin also played drums and piano, and while his singing career wasn't doing wonderfully at this point, he was becoming known around Motown for turning his hand to whatever was needed, from drumming on a session to sweeping the floor.\n\nThe most notable thing about the album, though, was that he changed the spelling of his surname, from Gay spelled G-a-y to G-a-y-e. He gave three different reasons for this, at least two of which were connected.\n\nThe first one was that he was inspired by Sam Cooke, whose career he wanted to emulate. Cooke had added an \"e\" to his surname, and so Marvin was doing the same.\n\nThe second reason, though, was that by this time the word \"gay\" was already being used to refer to sexuality, and there were rumours floating around about Marvin's sexuality which he didn't want to encourage. He did like to wear women's clothing in private, and he said some things about his experience of gender which might suggest that he wasn't entirely cis, but he was only interested in women sexually, and was (like many people at the time) at least mildly homophobic. And like many people he confused sexuality and gender, and he desperately didn't want to be thought of as anything other than heterosexual.\n\nBut there was another aspect to this as well. His father was also someone who wore women's clothing, and tied in with Marvin's wish not to be thought of as gay was a wish not to be thought of as like his father, who was physically and emotionally abusive of him throughout his life. And his father was Marvin Gay senior. By adding the \"e\", as well as trying to avoid being thought of as gay, he was also trying to avoid being thought of as like his father.\n\nWhile Marvin's first album was not a success, he was doing everything he could to get more involved with the label as a whole. He played drums on records, despite never having played the instrument before, simply because he wanted to be around the studio -- he played on a record we've already looked at, \"Please Mr. Postman\" by the Marvelettes:\n\n[Excerpt: The Marvelettes, \"Please Mr. Postman\"]\n\nHe played with the Miracles on occasion, and he also played on \"I Call It Pretty Music, But the Old People Call it the Blues\" by Little Stevie Wonder:\n\n[Excerpt, Little Stevie Wonder, \"I Call It Pretty Music, But the Old People Call it the Blues\"]\n\nAnd on \"That's What Girls are Made For”by the Spinners (the group known in the UK as the Detroit Spinners):\n\n[Excerpt: The Spinners, \"That's What Girls are Made For\"]\n\nAnd he both co-wrote and played drums on \"Beechwood 4-5789\" by the Marvelettes, which made the top twenty:\n\n[Excerpt: The Marvelettes, \"Beechwood 4-5789\"]\n\nBut this kind of thing ended up with Gaye being pushed by Berry Gordy in the direction of writing, which was not something he wanted to do. At that time in Motown, there was a strict demarcation, and the only person who was allowed to write *and* perform *and* produce was Smokey Robinson -- everyone else was either a writer/producer or a singer, and Marvin knew he wanted to be a singer first and foremost.\n\nBut Marvin's own records were flopping, and it was only because of Anna Gordy's encouragement that he was able to continue releasing records at all &nbsp;-- if he hadn't given up himself, he would almost certainly have been dropped by the label. And indirectly, his first hit was inspired by Anna.\n\nMarvin's attitude to authority was coming out again in his attitude towards Motown and Berry Gordy. By this point, Motown had set up its famous charm school -- a department of the label that taught its singers things like elocution, posture, how to dress and how to dance. Marvin absolutely refused to do any of that, although he later said he regretted it.\n\nAnna told him all the time that he was stubborn, and he started thinking about this, and jamming with Mickey Stevenson, the Motown staff songwriter and producer with whom he worked most closely, and who had started out as a singer with Lionel Hampton. The two of them came up with what Marvin later described as a \"basic jazz feeling\", and then Berry Gordy suggested a few extra chords they could stick in, and the result was \"Stubborn Kind of Fellow\":\n\n[Excerpt: Marvin Gaye, \"Stubborn Kind of Fellow\"]\n\nYou can hear what he meant about that starting out with a jazz feel, most notably with Beans Bowles' flute part, but the finished product was very much an R&B record -- Marvin sounds more like Ray Charles than Sinatra or Como, and the backing vocals by Martha and the Vandellas are certainly not anything that you would have got behind a crooner. The record went right up the R&B chart, making the R&B top ten, but it didn't cross over to the pop audience that Gaye was after. He was disappointed, because what he wanted more than anything else was to get a white audience, because he knew that was where the money was, but after getting an R&B hit, he knew he would have to do as so many other Black entertainers had, and play to Black audiences for a long time before he crossed over.\n\nAnd that also meant going out on tour, something he hated. At the end of 1962 he was put on the bill of the Motortown Revue, along with the Contours, the Supremes, the Marvelettes, Little Stevie Wonder, Mary Wells, and the Miracles. On the live album from that tour, recorded at the Apollo, you can hear Gaye still trying to find a balance between his desire to be a Sinatra-type crooner appealing to a white audience, and his realisation that he was going to have to appeal to a Black audience. The result has him singing \"What Kind of Fool Am I?\", the Anthony Newley show tune, but sticking in interpolations inspired by Ray Charles:\n\n[Excerpt: Marvin Gaye, \"What Kind of Fool Am I?\"]\n\nThis was a real concern for him. He would later say \"Commercially, though, I learned quickly that it was primarily my people who were going to support me. I vowed always to take care of them, give 'em the funk they wanted. It wasn't my first choice, but there's integrity in the idea of pleasing your own people. Secretly, I yearned to sing for rich Republicans in tuxes and tails at the Copacabana. No matter.\"\n\nHe hated that tour, but some of the musicians on the tour thought it was what made him into a star -- specifically, they knew that Gaye had stage fright, hated being on stage, and would not put his all into a live performance. Unless they put Little Stevie Wonder on before him. Wonder's performances were so exciting that Gaye had to give the audience everything he had or he'd get booed off the stage, and Gaye started to rise to the challenge. He would still get stage fright, and try to get out of performing live at all, but when he turned up and went on stage he became a captivating performer.\n\nAnd that was something that was very evident on the first recording he made after coming off the tour. The Apollo recording we just heard was from the last week of the tour, and two days after it concluded, on December 19th 1962, Marvin Gaye was back in the studio, where he felt most comfortable, writing a song with Mickey Stevenson and Clarence Paul. While there were three writers of the song, the bulk of it was written by Gaye, who came up with the basic groove before the other writers got involved, and who played both piano and drums on the record:\n\n[Excerpt: Marvin Gaye, \"Hitch-Hike\"]\n\n\"Hitch-Hike\" became Gaye's first real crossover hit -- it made number twelve on the R&B chart, but also made the top forty on the pop chart, largely because of his appearances on American Bandstand, where he demonstrated a new dance he'd made up, involving sticking your thumb out like a hitch-hiker, which became a minor craze among Bandstand's audiences -- we're still in the period where a novelty dance was the most important thing in having a hit. The song also became the first Marvin Gaye song to get covered on a regular basis. The first cover version of it was by the Vandellas, who sang backing vocals on Marvin's version, and who used the same backing track for their own recording -- this was something that happened often with Motown, and if you listen to albums by Motown artists in the sixties, you'll frequently hear a hit single with different vocals on it:\n\n[Excerpt: Martha and the Vandellas, \"Hitch-Hike\"]\n\nBut while Martha and the Vandellas were the first to cover \"Hitch-Hike\", they were far from the only ones -- it became a favourite for white rock groups like the Sonics or the Rolling Stones to cover, and it would be the inspiration for many more rock records by people who wanted to show they could play soul.\n\nBy June 1963, Marvin Gaye was a bona fide star, and married to Anna Gordy. He was even able to buy his mother a house. But while everything seemed to be going swimmingly as far as the public were concerned, there were already problems -- at their wedding reception, Gaye and Anna got into a huge row which ended up with Anna hitting Gaye on the head with her shoe heel. And while he'd bought the house for his mother, his father was still living with her, and still as toxic as he had ever been.\n\nBut for the moment, those things didn't matter. Marvin Gaye was on top of the world, and had started a run of singles that would come to define the Motown sound, and he was also becoming a successful songwriter -- and the next time we look at him, it'll be for a classic song he wrote for someone else.",
  "itunes:subtitle": "Episode one hundred and three of A History of Rock Music in Five Hundred Songs looks at Hitch-Hike by Marvin Gaye, and the early career of one of Motowns defining artists. Click the full post to read liner notes, links to more information, and a transcri",
  "itunes:keywords": "Anna Gordy,Anna Records,Berry Gordy,Bo Diddley,Chess Records,Chuck Berry,doo wop,Etta James,Gwen Gordy,Harvey Fuqua,Harvey Records,Martha and the Vandellas,Marvin Gaye,Mickey Stevenson,Motown,Okeh Records,Roquel Davis,soul,The Moonglows",
  "itunes:episodeType": "full",
  "itunes:episode": 103,
  "content:encoded": "Episode one hundred and three of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Hitch-Hike\" by Marvin Gaye, and the early career of one of Motown's defining artists. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/43562761\">\"Any Other Way\" by Jackie Shane</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Erratum</strong>\n\nI say that Smokey Robinson was the only person allowed to be both a writer/producer and performer at Motown. That was Marvin Gaye's later statement, but at this point Eddie Holland was also still doing all those things.\n\n<strong>Resources</strong>\n\nAs usual, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-103-hitch-hike-by-marvin-gaye/\">a Mixcloud streaming playlist </a>with full versions of all the songs in the episode.\n\nFor Motown-related information in this and other Motown episodes, I've used the following resources:\n\n<a href=\"https://amzn.to/2QTOvdM\"><em>Where Did Our Love Go? The Rise and Fall of the Motown Sound</em>&nbsp;by Nelson George</a>&nbsp;is an excellent popular history of the various companies that became Motown.\n\n<a href=\"https://amzn.to/2QQhXRZ\"><em>To Be Loved</em>&nbsp;by Berry Gordy</a>&nbsp;is Gordy's own, understandably one-sided, but relatively well-written, autobiography.\n\n<a href=\"https://amzn.to/2VIpXII\"><em>Women of Motown: An Oral History</em>&nbsp;by Susan Whitall</a> is a collection of interviews with women involved in Motown.\n\n<a href=\"https://amzn.to/2xVdvfD\"><em>I Hear a Symphony: Motown and Crossover R&B&nbsp;</em>by J. Andrew Flory</a>&nbsp;is an academic look at Motown.\n\n<a href=\"https://amzn.to/2VLquJX\"><em>The Motown Encyclopaedia</em>&nbsp;by Graham Betts</a>&nbsp;is an exhaustive look at the people and records involved in Motown's thirty-year history.\n\nAnd&nbsp;<a href=\"https://motownjunkies.co.uk/\">Motown Junkies</a>&nbsp;is an infrequently-updated blog looking at (so far) the first 693 tracks released on Motown singles.\n\nThere is a Complete Motown Singles 1959-62 box available from Hip-O-Select with comprehensive liner notes, but if you just want the music, I recommend instead&nbsp;<a href=\"https://amzn.to/2YbX0qa\">this much cheaper bare-bones box</a>&nbsp;from Real Gone Music.\n\nFor information on Gaye specifically, I relied on&nbsp;<a href=\"https://amzn.to/38eqYPi\"><em>Divided Soul: The Life of Marvin Gaye</em> by David Ritz</a>.\n\nThe best collection of Gaye's music is&nbsp;<a href=\"https://amzn.to/365uZD0\"><em>The Master</em></a>, a four-disc box covering his recordings from \"Stubborn Kind of Fellow\" to the very last recordings of his life.\n\n<strong>Transcript</strong>\n\nA brief note -- this week's episode contains some minor mentions of parental and domestic abuse, and some discussions of homophobia. I don't think those mentions will be upsetting for anyone, but if you're unsure you might want to check the transcript before listening.\n\nToday we're going to look at the start of one of the great careers in soul music, and one of the great artists to come out of the Motown hit factory. We're going to look at the continued growth of the Motown company, and at the personal relationships that would drive it in the 1960s, but would also eventually lead to its downfall. We're going to look at \"Hitch-Hike\", and the early career of Marvin Gaye:\n\n[Excerpt: Marvin Gaye, \"Hitch-Hike\"]\n\nOne thing we've not talked about much in the podcast so far is the way that the entertainment industry, until relatively recently, acted as a safety valve for society, a place where people who didn't fit in anywhere could build themselves a life and earn a living without playing along with the normal social conventions. And by instinct, temperament, and upbringing, Marvin Gaye was one of those people.\n\nHe was always someone who rubbed up against authority. He spent his youth fighting with his abusive father, and eventually left home to join the Air Force just to get away from his father. But he didn't stay long in the Air Force either -- he was discharged due to mental problems, which he later claimed he'd faked, with his honourable discharge stating \"Marvin Gay cannot adjust to regimentation and authority\".\n\nBack in Washington DC, where he'd grown up, and feeling like a failure, he formed a doo-wop group called the Marquees -- in later years, Gaye would state that he'd come up with the name as a reference to the Marquis de Sade, but in fact Gaye hadn't heard of de Sade at the time. The Marquees were like a million doo-wop groups of the time, and leaned towards the sweeter end of doo-wop, particularly modelling themselves on the Moonglows.\n\nThe group performed around Washington, and came to the attention of Bo Diddley, who was living in the area and friends with a neighbour of the group. Diddley took them under his wing and wrote and produced both sides of their first single, which had another member, Reese Palmer, singing lead -- Palmer also claimed that he wrote both songs, but Diddley is credited and they certainly sound like Diddley's work to me. The tracks were originally backed by Diddley's band, but Okeh, the record label for whom they were recording, asked that one of the two sides, \"Wyatt Earp\", be rerecorded with session musicians like Panama Francis who played on almost every R&B record made on the East Coast at the time. Oddly, listening to both versions, the version with the session musicians sounds rather more raw and Bo-Diddleyesque than the one with Diddley's band. The result had a lot of the sound of the records the Coasters were making around the same time:\n\n[Excerpt: The Marquees, \"Wyatt Earp\"]\n\nAt the same initial session, the Marquees also sang backing vocals on a record by Billy Stewart. We've encountered Stewart briefly before -- his first single, \"Billy's Blues\", was the first appearance of the guitar figure that later became the basis for \"Love is Strange\", and he played piano in Diddley's band. With Diddley's band and the Marquees he recorded \"Billy's Heartache\":\n\n[Excerpt: Billy Stewart, \"Billy's Heartache\"]\n\nHowever, the Marquees' first record did nothing, and the group were dropped by the label and went back to just playing clubs around Washington DC. It looked like their dreams of stardom were over. But one of the group's members, Chester Simmons, took a job as Bo Diddley's driver, and that was to lead to the group's second big break.\n\nDiddley was on a tour with the Moonglows, who as well as being fellow Chess artists had also backed Diddley on records like \"Diddley Daddy\":\n\n[Excerpt: Bo Diddley, \"Diddley Daddy\"]\n\nHarvey Fuqua, the group's leader, was complaining to Diddley about the rest of the group, and in particular about Bobby Lester, the group's tenor singer. He was thinking of dropping the entire group and getting a new, better, set of Moonglows to work with. Simmons heard Fuqua talking with Diddley about this, and suggested that the Marquees might be suitable for the job. When the tour hit DC, Fuqua auditioned the Marquees, and started working with them to get them up to the standard he needed, even while he was still continuing to tour with the original Moonglows.\n\nFuqua trained the Marquees in things like breath control. In particular, he had a technique he called \"blow harmony\", getting the group to sing with gentle, breathy, \"whoo\" sounds rather than the harder-edged \"doo\" sounds that most doo-wop groups used -- Fuqua was contemptuous of most doo-wop groups, calling them \"gang groups\". He taught the Marquees how to shape their mouths, how to use the muscles in their throats, and all the other techniques that most singers have to pick up intuitively or never learn at all. The breathy sound that Fuqua taught them was to become one of the most important techniques that Gaye would use as a vocalist throughout his career.\n\nFuqua took the group back with him to Chicago, and they added a sixth singer, Chuck Barkside, who doubled Simmons on the bass. There were attempts at expanding the group still further, as well -- David Ruffin, later the lead singer of the Temptations, auditioned for the group, but was turned down by Fuqua.\n\nThe group, now renamed Harvey and the Moonglows, cut a few tracks for Chess, but most were never released, but they did better as backing vocalists. Along with Etta James, they sang the backing vocals on two hits by Chuck Berry, \"Almost Grown\" and \"Back in the USA\":\n\n[Excerpt: Chuck Berry, \"Back in the USA\"]\n\nAt the time, Etta and Harvey were in a relationship, and Marvin took note -- being in a relationship with someone else in the industry could be good for your career. Marvin was starting to discover some other things, as well -- like that he really didn't enjoy being on stage, even though he loved singing, and that the strain of touring could be eased with the use of cannabis. Marvin didn't want to be on the stage at all -- he wanted to be making records. The studio was where he was comfortable.\n\nThe new Moonglows did release some recordings of their own, one of which, \"Mama Loochie\", had Marvin on lead vocals, and was cowritten by Marvin and Harvey:\n\n[Excerpt: Harvey and the Moonglows, \"Mama Loochie\"]\n\nAnother record that featured Marvin, though not as lead vocalist, was \"Twelve Months of the Year\", an attempt to recapture the success of the original Moonglows' \"Ten Commandments of Love\". On that one, Marvin does the spoken recitation at the beginning and end, as well as singing backing vocals:\n\n[Excerpt: Harvey and the Moonglows, \"Twelve Months of the Year\"]\n\nBut the Moonglows were coming to the end of their career -- and Harvey was also coming to the end of his relationship with Etta James. Anna Records, one of the labels owned by members of the Gordy family, had made a distribution agreement with Chess Records, and Leonard Chess suggested to Harvey that he move to Detroit and work with Anna as a Chess liaison. Soon Harvey Fuqua was fully part of the Gordy family, and he split up with Etta James and got into a relationship with Gwen Gordy. Gwen had split up with her own partner to be with Harvey -- and then Gwen and her ex, Roquel Davis, co-wrote a song about the split, which Etta James sang:\n\n[Excerpt: Etta James, \"All I Could Do Was Cry\"]\n\nMarvin had come with Harvey -- he'd signed with him as a solo artist, and Harvey thought that Marvin could become a Black Frank Sinatra, or better. Marvin was signed to Harvey Records, Harvey's label, but after Harvey and Gwen got together romantically, their various labels all got rolled up in the Motown family. At first, Marvin wasn't sure whether he would be recording at all once Harvey Records was shut down, but he made an impression on Berry Gordy by gatecrashing the Motown Christmas party in 1960 and performing \"Mr. Sandman\" at the piano.\n\nSoon he found that Berry Gordy had bought out his recording contract, as well as a fifty percent share of his management, and he was now signed with Tamla. Marvin was depressed by this to an extent -- he saw Fuqua as a father figure -- but he soon came to respect Gordy. He also found that Gordy's sister Anna was very interested in him, and while she was seventeen years older than him, he didn't see that as something that should stand in the way of his getting together with the boss' sister. There was a real love between the twenty year old Marvin Gaye and the thirty-seven-year-old Anna Gordy, but Gaye also definitely realised that there was an advantage to becoming part of the family -- and Berry Gordy, in turn, thought that having his artists be part of his family would be an advantage in controlling them.\n\nBut right from the start, Marvin and Berry had different ideas about where Marvin's career should go. Marvin saw himself becoming a singer in the same style as Nat \"King\" Cole or Jesse Belvin, while Gordy wanted him to be an R&B singer like everyone else at Motown. While Marvin liked singers like Sam Cooke, he was also an admirer of people like Dean Martin and Perry Como -- he would later say that the sweaters he wore in many photos in the sixties were inspired by Como, and that \"I always felt like my personality and Perry's had a lot in common\".\n\nThey eventually compromised -- Marvin would record an album of old standards, but there would be an R&B single on it, one side written by Berry, and the other written by Harvey and Anna. The Soulful Moods of Marvin Gaye was only the second album released by Motown, which otherwise concentrated on singles, but neither it nor the single Berry wrote, \"Let Your Conscience Be Your Guide\", had any commercial success:\n\n[Excerpt: Marvin Gaye, \"Let Your Conscience Be Your Guide\"]\n\nAs well as singing on the album, Marvin also played drums and piano, and while his singing career wasn't doing wonderfully at this point, he was becoming known around Motown for turning his hand to whatever was needed, from drumming on a session to sweeping the floor.\n\nThe most notable thing about the album, though, was that he changed the spelling of his surname, from Gay spelled G-a-y to G-a-y-e. He gave three different reasons for this, at least two of which were connected.\n\nThe first one was that he was inspired by Sam Cooke, whose career he wanted to emulate. Cooke had added an \"e\" to his surname, and so Marvin was doing the same.\n\nThe second reason, though, was that by this time the word \"gay\" was already being used to refer to sexuality, and there were rumours floating around about Marvin's sexuality which he didn't want to encourage. He did like to wear women's clothing in private, and he said some things about his experience of gender which might suggest that he wasn't entirely cis, but he was only interested in women sexually, and was (like many people at the time) at least mildly homophobic. And like many people he confused sexuality and gender, and he desperately didn't want to be thought of as anything other than heterosexual.\n\nBut there was another aspect to this as well. His father was also someone who wore women's clothing, and tied in with Marvin's wish not to be thought of as gay was a wish not to be thought of as like his father, who was physically and emotionally abusive of him throughout his life. And his father was Marvin Gay senior. By adding the \"e\", as well as trying to avoid being thought of as gay, he was also trying to avoid being thought of as like his father.\n\nWhile Marvin's first album was not a success, he was doing everything he could to get more involved with the label as a whole. He played drums on records, despite never having played the instrument before, simply because he wanted to be around the studio -- he played on a record we've already looked at, \"Please Mr. Postman\" by the Marvelettes:\n\n[Excerpt: The Marvelettes, \"Please Mr. Postman\"]\n\nHe played with the Miracles on occasion, and he also played on \"I Call It Pretty Music, But the Old People Call it the Blues\" by Little Stevie Wonder:\n\n[Excerpt, Little Stevie Wonder, \"I Call It Pretty Music, But the Old People Call it the Blues\"]\n\nAnd on \"That's What Girls are Made For”by the Spinners (the group known in the UK as the Detroit Spinners):\n\n[Excerpt: The Spinners, \"That's What Girls are Made For\"]\n\nAnd he both co-wrote and played drums on \"Beechwood 4-5789\" by the Marvelettes, which made the top twenty:\n\n[Excerpt: The Marvelettes, \"Beechwood 4-5789\"]\n\nBut this kind of thing ended up with Gaye being pushed by Berry Gordy in the direction of writing, which was not something he wanted to do. At that time in Motown, there was a strict demarcation, and the only person who was allowed to write *and* perform *and* produce was Smokey Robinson -- everyone else was either a writer/producer or a singer, and Marvin knew he wanted to be a singer first and foremost.\n\nBut Marvin's own records were flopping, and it was only because of Anna Gordy's encouragement that he was able to continue releasing records at all &nbsp;-- if he hadn't given up himself, he would almost certainly have been dropped by the label. And indirectly, his first hit was inspired by Anna.\n\nMarvin's attitude to authority was coming out again in his attitude towards Motown and Berry Gordy. By this point, Motown had set up its famous charm school -- a department of the label that taught its singers things like elocution, posture, how to dress and how to dance. Marvin absolutely refused to do any of that, although he later said he regretted it.\n\nAnna told him all the time that he was stubborn, and he started thinking about this, and jamming with Mickey Stevenson, the Motown staff songwriter and producer with whom he worked most closely, and who had started out as a singer with Lionel Hampton. The two of them came up with what Marvin later described as a \"basic jazz feeling\", and then Berry Gordy suggested a few extra chords they could stick in, and the result was \"Stubborn Kind of Fellow\":\n\n[Excerpt: Marvin Gaye, \"Stubborn Kind of Fellow\"]\n\nYou can hear what he meant about that starting out with a jazz feel, most notably with Beans Bowles' flute part, but the finished product was very much an R&B record -- Marvin sounds more like Ray Charles than Sinatra or Como, and the backing vocals by Martha and the Vandellas are certainly not anything that you would have got behind a crooner. The record went right up the R&B chart, making the R&B top ten, but it didn't cross over to the pop audience that Gaye was after. He was disappointed, because what he wanted more than anything else was to get a white audience, because he knew that was where the money was, but after getting an R&B hit, he knew he would have to do as so many other Black entertainers had, and play to Black audiences for a long time before he crossed over.\n\nAnd that also meant going out on tour, something he hated. At the end of 1962 he was put on the bill of the Motortown Revue, along with the Contours, the Supremes, the Marvelettes, Little Stevie Wonder, Mary Wells, and the Miracles. On the live album from that tour, recorded at the Apollo, you can hear Gaye still trying to find a balance between his desire to be a Sinatra-type crooner appealing to a white audience, and his realisation that he was going to have to appeal to a Black audience. The result has him singing \"What Kind of Fool Am I?\", the Anthony Newley show tune, but sticking in interpolations inspired by Ray Charles:\n\n[Excerpt: Marvin Gaye, \"What Kind of Fool Am I?\"]\n\nThis was a real concern for him. He would later say \"Commercially, though, I learned quickly that it was primarily my people who were going to support me. I vowed always to take care of them, give 'em the funk they wanted. It wasn't my first choice, but there's integrity in the idea of pleasing your own people. Secretly, I yearned to sing for rich Republicans in tuxes and tails at the Copacabana. No matter.\"\n\nHe hated that tour, but some of the musicians on the tour thought it was what made him into a star -- specifically, they knew that Gaye had stage fright, hated being on stage, and would not put his all into a live performance. Unless they put Little Stevie Wonder on before him. Wonder's performances were so exciting that Gaye had to give the audience everything he had or he'd get booed off the stage, and Gaye started to rise to the challenge. He would still get stage fright, and try to get out of performing live at all, but when he turned up and went on stage he became a captivating performer.\n\nAnd that was something that was very evident on the first recording he made after coming off the tour. The Apollo recording we just heard was from the last week of the tour, and two days after it concluded, on December 19th 1962, Marvin Gaye was back in the studio, where he felt most comfortable, writing a song with Mickey Stevenson and Clarence Paul. While there were three writers of the song, the bulk of it was written by Gaye, who came up with the basic groove before the other writers got involved, and who played both piano and drums on the record:\n\n[Excerpt: Marvin Gaye, \"Hitch-Hike\"]\n\n\"Hitch-Hike\" became Gaye's first real crossover hit -- it made number twelve on the R&B chart, but also made the top forty on the pop chart, largely because of his appearances on American Bandstand, where he demonstrated a new dance he'd made up, involving sticking your thumb out like a hitch-hiker, which became a minor craze among Bandstand's audiences -- we're still in the period where a novelty dance was the most important thing in having a hit. The song also became the first Marvin Gaye song to get covered on a regular basis. The first cover version of it was by the Vandellas, who sang backing vocals on Marvin's version, and who used the same backing track for their own recording -- this was something that happened often with Motown, and if you listen to albums by Motown artists in the sixties, you'll frequently hear a hit single with different vocals on it:\n\n[Excerpt: Martha and the Vandellas, \"Hitch-Hike\"]\n\nBut while Martha and the Vandellas were the first to cover \"Hitch-Hike\", they were far from the only ones -- it became a favourite for white rock groups like the Sonics or the Rolling Stones to cover, and it would be the inspiration for many more rock records by people who wanted to show they could play soul.\n\nBy June 1963, Marvin Gaye was a bona fide star, and married to Anna Gordy. He was even able to buy his mother a house. But while everything seemed to be going swimmingly as far as the public were concerned, there were already problems -- at their wedding reception, Gaye and Anna got into a huge row which ended up with Anna hitting Gaye on the head with her shoe heel. And while he'd bought the house for his mother, his father was still living with her, and still as toxic as he had ever been.\n\nBut for the moment, those things didn't matter. Marvin Gaye was on top of the world, and had started a run of singles that would come to define the Motown sound, and he was also becoming a successful songwriter -- and the next time we look at him, it'll be for a classic song he wrote for someone else.",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and three of A History of Rock Music in Five Hundred Songs looks at \"Hitch-Hike\" by Marvin Gaye, and the early career of one of Motown's defining artists. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Any Other Way\" by Jackie Shane.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nErratum\n\nI say that Smokey Robinson was the only person allowed to be both a writer/producer and performer at Motown. That was Marvin Gaye's later statement, but at this point Eddie Holland was also still doing all those things.\n\nResources\n\nAs usual, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nFor Motown-related information in this and other Motown episodes, I've used the following resources:\n\nWhere Did Our Love Go? The Rise and Fall of the Motown Sound&nbsp;by Nelson George&nbsp;is an excellent popular history of the various companies that became Motown.\n\nTo Be Loved&nbsp;by Berry Gordy&nbsp;is Gordy's own, understandably one-sided, but relatively well-written, autobiography.\n\nWomen of Motown: An Oral History&nbsp;by Susan Whitall is a collection of interviews with women involved in Motown.\n\nI Hear a Symphony: Motown and Crossover R&B&nbsp;by J. Andrew Flory&nbsp;is an academic look at Motown.\n\nThe Motown Encyclopaedia&nbsp;by Graham Betts&nbsp;is an exhaustive look at the people and records involved in Motown's thirty-year history.\n\nAnd&nbsp;Motown Junkies&nbsp;is an infrequently-updated blog looking at (so far) the first 693 tracks released on Motown singles.\n\nThere is a Complete Motown Singles 1959-62 box available from Hip-O-Select with comprehensive liner notes, but if you just want the music, I recommend instead&nbsp;this much cheaper bare-bones box&nbsp;from Real Gone Music.\n\nFor information on Gaye specifically, I relied on&nbsp;Divided Soul: The Life of Marvin Gaye by David Ritz.\n\nThe best collection of Gaye's music is&nbsp;The Master, a four-disc box covering his recordings from \"Stubborn Kind of Fellow\" to the very last recordings of his life.\n\nTranscript\n\nA brief note -- this week's episode contains some minor mentions of parental and domestic abuse, and some discussions of homophobia. I don't think those mentions will be upsetting for anyone, but if you're unsure you might want to check the transcript before listening.\n\nToday we're going to look at the start of one of the great careers in soul music, and one of the great artists to come out of the Motown hit factory. We're going to look at the continued growth of the Motown company, and at the personal relationships that would drive it in the 1960s, but would also eventually lead to its downfall. We're going to look at \"Hitch-Hike\", and the early career of Marvin Gaye:\n\n[Excerpt: Marvin Gaye, \"Hitch-Hike\"]\n\nOne thing we've not talked about much in the podcast so far is the way that the entertainment industry, until relatively recently, acted as a safety valve for society, a place where people who didn't fit in anywhere could build themselves a life and earn a living without playing along with the normal social conventions. And by instinct, temperament, and upbringing, Marvin Gaye was one of those people.\n\nHe was always someone who rubbed up against authority. He spent his youth fighting with his abusive father, and eventually left home to join the Air Force just to get away from his father. But he didn't stay long in the Air Force either -- he was discharged due to mental problems, which he later claimed he'd faked, with his honourable discharge stating \"Marvin Gay cannot adjust to regimentation and authority\".\n\nBack in Washington DC, where he'd grown up, and feeling like a failure, he formed a doo-wop ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and three of A History of Rock Music in Five Hundred Songs looks at \"Hitch-Hike\" by Marvin Gaye, and the early career of one of Motown's defining artists. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Any Other Way\" by Jackie Shane.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nErratum\n\nI say that Smokey Robinson was the only person allowed to be both a writer/producer and performer at Motown. That was Marvin Gaye's later statement, but at this point Eddie Holland was also still doing all those things.\n\nResources\n\nAs usual, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nFor Motown-related information in th",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}