{
  "guid": "https://podcasts.nationalreview.com/?p=1508",
  "title": "Episode 11: Robert Dean Lurie / Hall and Oates",
  "description": "<p>Scot and Jeff talk to Robert Dean Lurie about Hall and Oates.</p>\n<p><span><b>Introducing the Band<br />\n</b></span>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\" target=\"_blank\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\" target=\"_blank\">@EsotericCD</a>) with guest Robert Dean Lurie, author of <a href=\"http://www.amazon.com/No-Certainty-Attached-Kilbey-Church/dp/1891241222\" target=\"_blank\">No Certainty Attached: Steve Kilbey </a><a href=\"http://www.amazon.com/No-Certainty-Attached-Kilbey-Church/dp/1891241222\" target=\"_blank\">and The Church</a> and <a href=\"https://www.amazon.com/We-Can-Be-Heroes-Individualism/dp/1534984526\" target=\"_blank\">We Can Be Heroes: The Radical Individualism of David Bowie</a>. Producer and performer on the tribute album <a href=\"http://www.amazon.com/Koot-Hoomi-Presents-Oates-Tribute/dp/B0037UVB44/\" target=\"_blank\">The Dark Side of Hall and Oates</a>. Read Robert’s work in the pages of NRO, the Federalist, <a href=\"http://www.robertdeanlurie.com/\" target=\"_blank\">and on his own website</a>.</p>\n<p><span><b>Robert’s Musical Pick: Hall & Oates<br />\n</b></span>This week, the gang is excited to be discussing one of the most underrated musical acts of the ’70s and ’80s (at least to the extent that any group that scored SIX #1 singles and over 30 chart hits can be considered underrated): Hall & Oates. Robert contends that today’s podcast represents Important Work: correcting the slander that has been directed at Hall & Oates over the years as “disposable pop” when even a brief survey of their career makes it immediately obvious that they are so much more than that. Jeff remembers his introduction to Hall & Oates as a child no moreso than any living creature remembers its first “introduction” to oxygen; their music was always just <i>there</i>, on the radio, in the family’s CD collection, on TV…ubiquitous, in the best possible way.</p>\n<p><u>KEY TRACK</u>: “<a href=\"https://www.youtube.com/watch?v=yRYFKcMa_Ek\" target=\"_blank\">Maneater</a>” (<i>H2O</i>, 1982)</p>\n<p><span><b>Folk-rock and Philly soul: the Atlantic Years: 1972-1974<br />\n</b></span>Before Hall & Oates became multiplatinum megastars in the early 1980s, they were a scrappy, semi-experimental folk duo signed to Atlantic Records, a label which allowed them to indulge their initial folk-soul fusionist predilections with the help of the finest musicians and orchestration Atlantic’s legendary producer Arif Mardin was capable of rustling up for them. While all agree that the duo’s first LP <i>Whole Oats</i> (1972) is tentative, Scot cites “Fall In Philadelphia” and “Lilly” as two that distinguish themselves from the rest. Jeff argues that “it sounds like The Grass Roots, and not in a good way” (he then mis-cites to a Hamilton, Joe Frank & Reynolds song, because of course he does). However, as the sucker for piano ballads that he is, he argues that the gorgeous “Waterwheel” is the highlight.</p>\n<p>There are no such reservations about H&O’s second record, <i>Abandoned Luncheonette </i>(1973). Jeff argues that this is their finest album, despite the fact that, sonically, it’s miles away from their classic hitmaking-era stuff like <i>Voices</i> or <i>H20. </i>Soulful, assured, with weird progressive touches to boot, there isn’t a single subpar track on <i>Abandoned Luncheonette</i> as far as he’s concerned, and on top of all that it also happens to contain one of greatest singles ever recorded in the history of American popular music. Robert shares his dark reading of “I’m Just A Kid (Don’t Make Me Feel Like A Man)” and notes that <i>Luncheonette</i> is Hall & Oates as a true duo: both write an equal amount of material, and both members’ contributions are sterling. Jeff praises the obscure corners of this record, from “Laughing Boy” (Daryl Hall alone at a piano, with a flugelhorn) to</p>\n<p>The final record of Hall & Oates’ Atlantic era is the extremely bizarre <i>War Babies</i>. Those hints of prog heard on <i>Abandoned Luncheonette</i> (which recur throughout H&O’s 1970s career) come further to the fore with this LP, produced by Todd Rundgren and featuring his progressive-rock band Utopia as the backing band. There’s a reason you’ve never heard of this record; despite a much more modern-sounding production, it’s such a weird thematic left-turn that it sticks out like a sore thumb from the rest of their discography. Jeff admits that, no matter much he genuinely loves the song, he has difficulty recommending a song named “War Baby Son Of Zorro” to others and expecting to be taken seriously. Robert likens <i>War Babies</i>‘ casual oddball fusion to a proto-“Beck” aesthetic — an easy junk-shop mashup of styles that flopped at the time but sounds better and better as time goes by.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=Lxpjj3Bp5zg\" target=\"_blank\">Fall In Philadelphia</a>” (<i>Whole Oats</i>, 1972); “<a href=\"https://www.youtube.com/watch?v=9tnU-eM-u0A\" target=\"_blank\">Lilly (Are You Happy)</a>” (<i>Whole Oats</i>, 1972); “<a href=\"https://www.youtube.com/watch?v=vO9vd34raKk\" target=\"_blank\">Waterwheel</a>” (<i>Whole Oats</i>, 1972); “<a href=\"https://www.youtube.com/watch?v=V1hkCoZcmB4\" target=\"_blank\">When The Morning Comes</a>” (<i>Abandoned Luncheonette</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=up0qIJlETO4\" target=\"_blank\">Las Vegas Turnaround (The Stewardess Song)</a>” (<i>Abandoned Luncheonette</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=W2T_eTraa14\" target=\"_blank\">I’m Just A Kid (Don’t Make Me Feel Like A Man)</a>” (<i>Abandoned Luncheonette</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=nideTyZM1J0\" target=\"_blank\">Laughing Boy</a>” (<i>Abandoned Luncheonette</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=3yiic8QOoos\" target=\"_blank\">Everytime I Look At You</a>” (<i>Abandoned Luncheonette</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=87Q042KlxI4\" target=\"_blank\">She’s Gone</a>” (<i>Abandoned Luncheonette</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=RNj2b2dN3_Y\" target=\"_blank\">You’re Much Too Soon</a>” (<i>War Babies</i>, 1974); “<a href=\"https://www.youtube.com/watch?v=8JF6E0_cSvU\" target=\"_blank\">’70s Scenario</a>” (<i>War Babies</i>, 1974); “<a href=\"https://www.youtube.com/watch?v=9KkYN9I7RYw\" target=\"_blank\">War Baby Son Of Zorro</a>” (<i>War Babies</i>, 1974); “<a href=\"https://www.youtube.com/watch?v=UCM4BMvEISk\" target=\"_blank\">Better Watch Your Back</a>” (<i>War Babies</i>, 1974)</p>\n<p><span><b>The Commercial Breakthrough: Darryl Hall & John Oates and <em>Bigger Than The Both Of Us</em><i><br />\n</i></b></span>Hall & Oates hire a new manager (Tommy Mottola, later to gain additional fame for discovering–and marrying–Mariah Carey) who pushes them to get it together and put out some tighter, more commercial material. They respond with aplomb, and the result is the duo’s commercial breakthrough, <i>Daryl Hall & John Oates</i> (1975)…a record which also contains a snarky tribute to Mottola in the obscure gem “Gino (The Manager).” But “Sara Smile” is the one everyone remembers from this record, and even though Jeff doesn’t care for it, Scot and Robert are all in favor. Scot in fact prefers this to <i>Abandoned Luncheonette</i>, particularly due to the presence of “Camellia,” one of his favorite H&O tracks.</p>\n<p><i>Bigger Than The Both Of Us </i>(1976) was where Hall & Oates really broke into the mainstream, and it’s all because of “Rich Girl,” which children after 1976 are actually required to be born knowing under Federal law. Aside from that #1 hit, however, there is a remarkable amount of top-shelf material on an album that is otherwise neglected. Robert calls out “Crazy Eyes” (one of John Oates’ best songs) and both he and Jeff cannot rave enough about “Falling,” which in its gorgeous, ghostly playout sounds more like Genesis circa-<i>A Trick Of The Tail</i> than anything you would ever associate with Hall & Oates: prog-soul. That, as you will soon see, was no accident.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=DOu0orvpe5o\" target=\"_blank\">Camellia</a>” (<i>Daryl Hall & John Oates</i>, 1975); “<a href=\"https://www.youtube.com/watch?v=Op8nAB_JMkE\" target=\"_blank\">Sara Smile</a>” (<i>Daryl Hall & John Oates</i>, 1975); “<a href=\"https://www.youtube.com/watch?v=flSVN2Ksyuc\" target=\"_blank\">Gino (The Manager)</a>” (<i>Daryl Hall & John Oates</i>, 1975); “<a href=\"https://www.youtube.com/watch?v=AmHE65RAkSY\" target=\"_blank\">Rich Girl</a>” (<i>Bigger Than The Both Of Us</i>, 1976); “<a href=\"https://www.youtube.com/watch?v=7uq3oZ5r1Wc\" target=\"_blank\">Crazy Eyes</a>” (<i>Bigger Than The Both Of Us</i>, 1976); “<a href=\"https://www.youtube.com/watch?v=R5HDae6r5XY\" target=\"_blank\">Do What You Want, Be What You Are</a>” (<i>Bigger Than The Both Of Us</i>, 1976); “<a href=\"https://www.youtube.com/watch?v=RUjnjKDEf8s\" target=\"_blank\">Falling</a>” (<i>Bigger Than The Both Of Us</i>, 1976)</p>\n<p><strong><span>Sacred Songs and the Late ’70s Dip in Fortunes</span></strong><br />\nAs it turns out, Daryl Hall had always harbored a secret yearning to make progressive-rock, a side of him that had been showing up on the duo’s records in fits and starts ever since <i>Abandoned Luncheonette</i>. That was finally given a voice in <i>Sacred Songs</i>, Hall’s 1977 solo collaboration with Robert Fripp (of King Crimson). As prog-soul (a heretofore unknown genre), <i>Sacred Songs</i> is one of the most underrated records of its era, a true cult favorite known only to particularly tuned-in prog-rock fans, a position it was destined for after Hall’s manager Tommy Mottola suppressed it and prevented its release for fear it would damage Hall’s commercial reputation with H&O. That led directly to <i>Beauty On A Back Street</i> (1977), a record which both Daryl Hall and John Oates loudly claim to dislike (they even kept it off their 4CD boxed set) but which Jeff and Robert actually think might be one of their finest records. Loud, rockist, angry and surprisingly weird (scan the lyrics of “Bad Habits & Infections” someday), <i>Back Street</i> is the secret gem of the H&O catalogue and it’s a shame that pretty much nobody except the sorts of people who would tape this podcast have even heard of it.</p>\n<p>Scot, on the other hand, is a bigger fan of 1978’s <i>Along The Red Ledge</i>, which finds H&O recording with a star-studded array of guests and allies (Todd Rundgren, Robert Fripp, George Harrison, and Rick Nielsen of Cheap Trick, among others) and coming up with their one great commercial success of the era, the sparkling “It’s A Laugh.” Scot really enjoys the Cheap Trick-isms of “Alley Katz” as well, and singles out “August Day” as another one of those arresting “Daryl Hall at a piano” moments strewn throughout the Hall & Oates discography. The more dance-oriented <i>X-Static</i> (1979) is a comparative disappointment, but Robert loves “Wait For Me” (he argues that the best way to appreciate it is in its occasional Daryl Hall solo performances), and he’s even more spun around by an <i>outtake</i> from the record: the perfect pop confection “Time’s Up (Alone Tonight).”</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=VJaMfQtvuis\" target=\"_blank\">NYCNY</a>” (<i>Sacred Songs</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=PKAG-JtN6lk\" target=\"_blank\">Something In 4/4 Time</a>” (<i>Sacred Songs</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=BUySLoHPV10\" target=\"_blank\">Babs And Bads</a>” (<i>Sacred Songs</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=hK6CroZ4-YM\" target=\"_blank\">You Burn Me Up I’m A Cigarette</a>” <span>[Robert Fripp]</span> (<i>Exposure</i>, 1978) “<a href=\"https://www.youtube.com/watch?v=xiFKnfpN8cM\" target=\"_blank\">You Must Be Good For Something</a>” (<i>Beauty On A Back Street</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=OrcMY5oyog0\" target=\"_blank\">The Emptyness</a>” (<i>Beauty On A Back Street</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=7IxQvrIsohc\" target=\"_blank\">Bad Habits & Infections</a>” (<i>Beauty On A Back Street</i>, 1977); “Winged Bull” (<i>Beauty On A Back Street</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=2QAkHlmbAwo\" target=\"_blank\">It’s A Laugh</a>” (<i>Along The Red Ledge</i>, 1978); “<a href=\"https://www.youtube.com/watch?v=tP3EnJdPn1I\" target=\"_blank\">Alley Katz</a>” (<i>Along The Red Ledge</i>, 1978); “<a href=\"https://www.youtube.com/watch?v=GkHacEnV-EE\" target=\"_blank\">Don’t Blame It On Love</a>” (<i>Along The Red Ledge</i>, 1978); “<a href=\"https://www.youtube.com/watch?v=YovKUQlSWik\" target=\"_blank\">August Day</a>” (<i>Along The Red Ledge</i>, 1978); “<a href=\"https://www.youtube.com/watch?v=pfdp3xuu5RQ\" target=\"_blank\">Wait For Me</a>” (<i>X-Static</i>, 1979); “<a href=\"https://www.youtube.com/watch?v=4CPZa21DFA8\" target=\"_blank\">Running From Paradise</a>” (<i>X-Static</i>, 1979); “<a href=\"https://www.youtube.com/watch?v=IgyVWGonOJo\" target=\"_blank\">Time’s Up (Alone Tonight)</a>” (outtake from <i>X-Static</i>, 1979)</p>\n<p><span><b>Megastardom: Voices, Private Eyes, H2O, and the 1980s<br />\n</b></span>Sick of their relative misfortunes amidst the dominance of disco and dance music in the late ’70s (which had the effect of dampening the commercial prospects of their own brand of ‘rock & soul’ pop), Hall & Oates decided to quit trying to compete with the trends and, in doing so, ironically began to set trends themselves. <i>Voices</i> (1980) was the duo’s move toward a fusion of new-wave spareness, soul, and pop, and the results turned them into superstars. Jeff spends over a minute patiently explaining why “Kiss On My List” is a work of pure genius from a songwriting perspective, while Robert chimes in to point out that it is, for all intents and purposes, a demo recording with overdubbed voices. Scot is even more enthusiastic about the Devo-goes-pop twitch of “You Make My Dreams” and praises Hall’s preternaturally catchy vocal tics. Jeff thinks that half of <i>Voices</i> is actually fairly dodgy (which is what you get from an album that is basically a set of self-produced demo recordings), but who cares when the other half has stuff like “How Does It Feel To Be Back”?</p>\n<p>If <i>Voices</i> was a flawed triumph, there are no such questions from the gang about <i>Private Eyes</i> (1981): Robert, Scot, and Jeff are unanimous in agreeing that this is one of the greatest Hall & Oates albums ever, and in fact one of the greatest early ’80s pop-rock albums full-stop. “Private Eyes” (Scot: “If you don’t clap your hands along to the chorus, I don’t think you’re cool”), “Did It In A Minute,” “Your Imagination,” “Head Above Water”…this record is great from start to finish. Jeff mentions the importance of Sara Allen (Hall’s longtime partner) and her sister Janna as co-writing partners during this era, and also praises the classic #1 single “Billie Jea”–erm, wait, he meant “I Can’t Go For That (No Can Do).” (The story of how Michael Jackson nicked the bassline of “I Can’t Go For That” is recounted.)</p>\n<p>Scot, interestingly enough, does not care nearly as much for <i>H2O</i>, the platinum-selling followup to “Private Eyes” (and home of “Maneater,” among other famous singles), citing a mechanical feel and downing particularly on “Art Of Heartbreak” and “Open All Night.” Robert is having none of this, however, claiming that he has been waiting his entire life to mount a defense of this record — which he then does, admirably. Jeff mostly just can’t believe that Mike Oldfield (he of <a href=\"https://www.youtube.com/watch?v=TXvtDm820zI\" target=\"_blank\"><i>Tubular Bells</i> fame</a>) wrote a Hall & Oates hit single.</p>\n<p>After Jeff takes time to praise the non-album hit “Say It Isn’t So,” the band addresses Hall & Oates’ final hit album, <i>Big Bam Boom</i>(1984), and then wraps up the rest of their career. All involved agree that it’s all about “Out Of Touch” (both Scot and Jeff even identify it as one of their five key H&O tracks); so much of the rest of <i>Big Bam Boom </i>is sabotaged by unfortunate ’80s production choices. The gang then concludes by reflecting on the remainder of Hall & Oates’ post-1984 output. All agree that there are still good songs to be found, but that the fire had gone out of Hall’s heart in a lot of ways.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=5KNXXmr2PPI\" target=\"_blank\">How Does It Feel To Be Back</a>” (<i>Voices</i>, 1980); “<a href=\"https://www.youtube.com/watch?v=0pIHILw_ekA\" target=\"_blank\">Kiss On My List</a>” (<i>Voices</i>, 1980); “<a href=\"https://www.youtube.com/watch?v=E4CZuj7solw\" target=\"_blank\">You Make My Dreams</a>” (<i>Voices</i>, 1980); “<a href=\"https://www.youtube.com/watch?v=m5Y0S6nMMWM\" target=\"_blank\">Everytime You Go Away</a>” (<i>Voices</i>, 1980); “<a href=\"https://www.youtube.com/watch?v=0aQKmbtp6Pc\" target=\"_blank\">Private Eyes</a>” (<i>Private Eyes</i>, 1981); “<a href=\"https://www.youtube.com/watch?v=Y380bkHlye8\" target=\"_blank\">I Can’t Go For That (No Can Do)</a>” (<i>Private Eyes</i>, 1981); “<a href=\"https://www.youtube.com/watch?v=xGsCagn16TQ\" target=\"_blank\">Did It In A Minute</a>” (<i>Private Eyes</i>, 1981); “<a href=\"https://www.youtube.com/watch?v=YMpFVVQZgck\" target=\"_blank\">Mano A Mano</a>” (<i>Private Eyes</i>, 1981); “<a href=\"https://www.youtube.com/watch?v=VuhUQTAx4hU\" target=\"_blank\">Head Above Water</a>” (<i>Private Eyes</i>, 1981); “<a href=\"https://www.youtube.com/watch?v=xmPVpU8cpa8\" target=\"_blank\">Maneater</a>” (<i>H2O</i>, 1982); “<a href=\"https://www.youtube.com/watch?v=Zov9Y62zctg\" target=\"_blank\">One On One</a>” (<i>H</i><i>2</i><i>O</i>, 1982); “<a href=\"https://www.youtube.com/watch?v=OHJeXetgnO8\" target=\"_blank\">Family Man</a>” (<i>H2O</i>, 1982); “<a href=\"https://www.youtube.com/watch?v=wCNlU7gI8TQ\" target=\"_blank\">Go Solo</a>” (<i>H2O</i>, 1982); “<a href=\"https://www.youtube.com/watch?v=KGyOWbmB05U\" target=\"_blank\">Say It Isn’t So</a>” (<i>Rock ‘N Soul, Part 1</i>, 1983); “<a href=\"https://www.youtube.com/watch?v=sPQJ1FiOOJA\" target=\"_blank\">Dance On Your Knees</a>” (<i>Big Bam Boom</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=FMPKkJQm1U8\" target=\"_blank\">Out Of Touch</a>” (<i>Big Bam Boom</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=FwCfeQq8ewQ\" target=\"_blank\">Some Things Are Better Left Unsaid</a>” (<i>Big Bam Boom</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=Nm4e1pyWKyU\" target=\"_blank\">So Close (unplugged)</a>” (<i>Change Of Season</i>, 1990)</p>\n<p><b><span>Finale</span><br />\n</b>Robert, Scot and Jeff each pick their two key albums and five key tracks by Hall & Oates</p>\n",
  "pubDate": "Mon, 30 Oct 2017 16:36:38 +0000",
  "author": "studio@nationalreview.com (National Review)",
  "link": "https://www.nationalreview.com/media/political-beats",
  "content:encoded": "<p>Scot and Jeff talk to Robert Dean Lurie about Hall and Oates.</p>\n<p><span><b>Introducing the Band<br />\n</b></span>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\" target=\"_blank\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\" target=\"_blank\">@EsotericCD</a>) with guest Robert Dean Lurie, author of <a href=\"http://www.amazon.com/No-Certainty-Attached-Kilbey-Church/dp/1891241222\" target=\"_blank\">No Certainty Attached: Steve Kilbey </a><a href=\"http://www.amazon.com/No-Certainty-Attached-Kilbey-Church/dp/1891241222\" target=\"_blank\">and The Church</a> and <a href=\"https://www.amazon.com/We-Can-Be-Heroes-Individualism/dp/1534984526\" target=\"_blank\">We Can Be Heroes: The Radical Individualism of David Bowie</a>. Producer and performer on the tribute album <a href=\"http://www.amazon.com/Koot-Hoomi-Presents-Oates-Tribute/dp/B0037UVB44/\" target=\"_blank\">The Dark Side of Hall and Oates</a>. Read Robert’s work in the pages of NRO, the Federalist, <a href=\"http://www.robertdeanlurie.com/\" target=\"_blank\">and on his own website</a>.</p>\n<p><span><b>Robert’s Musical Pick: Hall & Oates<br />\n</b></span>This week, the gang is excited to be discussing one of the most underrated musical acts of the ’70s and ’80s (at least to the extent that any group that scored SIX #1 singles and over 30 chart hits can be considered underrated): Hall & Oates. Robert contends that today’s podcast represents Important Work: correcting the slander that has been directed at Hall & Oates over the years as “disposable pop” when even a brief survey of their career makes it immediately obvious that they are so much more than that. Jeff remembers his introduction to Hall & Oates as a child no moreso than any living creature remembers its first “introduction” to oxygen; their music was always just <i>there</i>, on the radio, in the family’s CD collection, on TV…ubiquitous, in the best possible way.</p>\n<p><u>KEY TRACK</u>: “<a href=\"https://www.youtube.com/watch?v=yRYFKcMa_Ek\" target=\"_blank\">Maneater</a>” (<i>H2O</i>, 1982)</p>\n<p><span><b>Folk-rock and Philly soul: the Atlantic Years: 1972-1974<br />\n</b></span>Before Hall & Oates became multiplatinum megastars in the early 1980s, they were a scrappy, semi-experimental folk duo signed to Atlantic Records, a label which allowed them to indulge their initial folk-soul fusionist predilections with the help of the finest musicians and orchestration Atlantic’s legendary producer Arif Mardin was capable of rustling up for them. While all agree that the duo’s first LP <i>Whole Oats</i> (1972) is tentative, Scot cites “Fall In Philadelphia” and “Lilly” as two that distinguish themselves from the rest. Jeff argues that “it sounds like The Grass Roots, and not in a good way” (he then mis-cites to a Hamilton, Joe Frank & Reynolds song, because of course he does). However, as the sucker for piano ballads that he is, he argues that the gorgeous “Waterwheel” is the highlight.</p>\n<p>There are no such reservations about H&O’s second record, <i>Abandoned Luncheonette </i>(1973). Jeff argues that this is their finest album, despite the fact that, sonically, it’s miles away from their classic hitmaking-era stuff like <i>Voices</i> or <i>H20. </i>Soulful, assured, with weird progressive touches to boot, there isn’t a single subpar track on <i>Abandoned Luncheonette</i> as far as he’s concerned, and on top of all that it also happens to contain one of greatest singles ever recorded in the history of American popular music. Robert shares his dark reading of “I’m Just A Kid (Don’t Make Me Feel Like A Man)” and notes that <i>Luncheonette</i> is Hall & Oates as a true duo: both write an equal amount of material, and both members’ contributions are sterling. Jeff praises the obscure corners of this record, from “Laughing Boy” (Daryl Hall alone at a piano, with a flugelhorn) to</p>\n<p>The final record of Hall & Oates’ Atlantic era is the extremely bizarre <i>War Babies</i>. Those hints of prog heard on <i>Abandoned Luncheonette</i> (which recur throughout H&O’s 1970s career) come further to the fore with this LP, produced by Todd Rundgren and featuring his progressive-rock band Utopia as the backing band. There’s a reason you’ve never heard of this record; despite a much more modern-sounding production, it’s such a weird thematic left-turn that it sticks out like a sore thumb from the rest of their discography. Jeff admits that, no matter much he genuinely loves the song, he has difficulty recommending a song named “War Baby Son Of Zorro” to others and expecting to be taken seriously. Robert likens <i>War Babies</i>‘ casual oddball fusion to a proto-“Beck” aesthetic — an easy junk-shop mashup of styles that flopped at the time but sounds better and better as time goes by.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=Lxpjj3Bp5zg\" target=\"_blank\">Fall In Philadelphia</a>” (<i>Whole Oats</i>, 1972); “<a href=\"https://www.youtube.com/watch?v=9tnU-eM-u0A\" target=\"_blank\">Lilly (Are You Happy)</a>” (<i>Whole Oats</i>, 1972); “<a href=\"https://www.youtube.com/watch?v=vO9vd34raKk\" target=\"_blank\">Waterwheel</a>” (<i>Whole Oats</i>, 1972); “<a href=\"https://www.youtube.com/watch?v=V1hkCoZcmB4\" target=\"_blank\">When The Morning Comes</a>” (<i>Abandoned Luncheonette</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=up0qIJlETO4\" target=\"_blank\">Las Vegas Turnaround (The Stewardess Song)</a>” (<i>Abandoned Luncheonette</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=W2T_eTraa14\" target=\"_blank\">I’m Just A Kid (Don’t Make Me Feel Like A Man)</a>” (<i>Abandoned Luncheonette</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=nideTyZM1J0\" target=\"_blank\">Laughing Boy</a>” (<i>Abandoned Luncheonette</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=3yiic8QOoos\" target=\"_blank\">Everytime I Look At You</a>” (<i>Abandoned Luncheonette</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=87Q042KlxI4\" target=\"_blank\">She’s Gone</a>” (<i>Abandoned Luncheonette</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=RNj2b2dN3_Y\" target=\"_blank\">You’re Much Too Soon</a>” (<i>War Babies</i>, 1974); “<a href=\"https://www.youtube.com/watch?v=8JF6E0_cSvU\" target=\"_blank\">’70s Scenario</a>” (<i>War Babies</i>, 1974); “<a href=\"https://www.youtube.com/watch?v=9KkYN9I7RYw\" target=\"_blank\">War Baby Son Of Zorro</a>” (<i>War Babies</i>, 1974); “<a href=\"https://www.youtube.com/watch?v=UCM4BMvEISk\" target=\"_blank\">Better Watch Your Back</a>” (<i>War Babies</i>, 1974)</p>\n<p><span><b>The Commercial Breakthrough: Darryl Hall & John Oates and <em>Bigger Than The Both Of Us</em><i><br />\n</i></b></span>Hall & Oates hire a new manager (Tommy Mottola, later to gain additional fame for discovering–and marrying–Mariah Carey) who pushes them to get it together and put out some tighter, more commercial material. They respond with aplomb, and the result is the duo’s commercial breakthrough, <i>Daryl Hall & John Oates</i> (1975)…a record which also contains a snarky tribute to Mottola in the obscure gem “Gino (The Manager).” But “Sara Smile” is the one everyone remembers from this record, and even though Jeff doesn’t care for it, Scot and Robert are all in favor. Scot in fact prefers this to <i>Abandoned Luncheonette</i>, particularly due to the presence of “Camellia,” one of his favorite H&O tracks.</p>\n<p><i>Bigger Than The Both Of Us </i>(1976) was where Hall & Oates really broke into the mainstream, and it’s all because of “Rich Girl,” which children after 1976 are actually required to be born knowing under Federal law. Aside from that #1 hit, however, there is a remarkable amount of top-shelf material on an album that is otherwise neglected. Robert calls out “Crazy Eyes” (one of John Oates’ best songs) and both he and Jeff cannot rave enough about “Falling,” which in its gorgeous, ghostly playout sounds more like Genesis circa-<i>A Trick Of The Tail</i> than anything you would ever associate with Hall & Oates: prog-soul. That, as you will soon see, was no accident.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=DOu0orvpe5o\" target=\"_blank\">Camellia</a>” (<i>Daryl Hall & John Oates</i>, 1975); “<a href=\"https://www.youtube.com/watch?v=Op8nAB_JMkE\" target=\"_blank\">Sara Smile</a>” (<i>Daryl Hall & John Oates</i>, 1975); “<a href=\"https://www.youtube.com/watch?v=flSVN2Ksyuc\" target=\"_blank\">Gino (The Manager)</a>” (<i>Daryl Hall & John Oates</i>, 1975); “<a href=\"https://www.youtube.com/watch?v=AmHE65RAkSY\" target=\"_blank\">Rich Girl</a>” (<i>Bigger Than The Both Of Us</i>, 1976); “<a href=\"https://www.youtube.com/watch?v=7uq3oZ5r1Wc\" target=\"_blank\">Crazy Eyes</a>” (<i>Bigger Than The Both Of Us</i>, 1976); “<a href=\"https://www.youtube.com/watch?v=R5HDae6r5XY\" target=\"_blank\">Do What You Want, Be What You Are</a>” (<i>Bigger Than The Both Of Us</i>, 1976); “<a href=\"https://www.youtube.com/watch?v=RUjnjKDEf8s\" target=\"_blank\">Falling</a>” (<i>Bigger Than The Both Of Us</i>, 1976)</p>\n<p><strong><span>Sacred Songs and the Late ’70s Dip in Fortunes</span></strong><br />\nAs it turns out, Daryl Hall had always harbored a secret yearning to make progressive-rock, a side of him that had been showing up on the duo’s records in fits and starts ever since <i>Abandoned Luncheonette</i>. That was finally given a voice in <i>Sacred Songs</i>, Hall’s 1977 solo collaboration with Robert Fripp (of King Crimson). As prog-soul (a heretofore unknown genre), <i>Sacred Songs</i> is one of the most underrated records of its era, a true cult favorite known only to particularly tuned-in prog-rock fans, a position it was destined for after Hall’s manager Tommy Mottola suppressed it and prevented its release for fear it would damage Hall’s commercial reputation with H&O. That led directly to <i>Beauty On A Back Street</i> (1977), a record which both Daryl Hall and John Oates loudly claim to dislike (they even kept it off their 4CD boxed set) but which Jeff and Robert actually think might be one of their finest records. Loud, rockist, angry and surprisingly weird (scan the lyrics of “Bad Habits & Infections” someday), <i>Back Street</i> is the secret gem of the H&O catalogue and it’s a shame that pretty much nobody except the sorts of people who would tape this podcast have even heard of it.</p>\n<p>Scot, on the other hand, is a bigger fan of 1978’s <i>Along The Red Ledge</i>, which finds H&O recording with a star-studded array of guests and allies (Todd Rundgren, Robert Fripp, George Harrison, and Rick Nielsen of Cheap Trick, among others) and coming up with their one great commercial success of the era, the sparkling “It’s A Laugh.” Scot really enjoys the Cheap Trick-isms of “Alley Katz” as well, and singles out “August Day” as another one of those arresting “Daryl Hall at a piano” moments strewn throughout the Hall & Oates discography. The more dance-oriented <i>X-Static</i> (1979) is a comparative disappointment, but Robert loves “Wait For Me” (he argues that the best way to appreciate it is in its occasional Daryl Hall solo performances), and he’s even more spun around by an <i>outtake</i> from the record: the perfect pop confection “Time’s Up (Alone Tonight).”</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=VJaMfQtvuis\" target=\"_blank\">NYCNY</a>” (<i>Sacred Songs</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=PKAG-JtN6lk\" target=\"_blank\">Something In 4/4 Time</a>” (<i>Sacred Songs</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=BUySLoHPV10\" target=\"_blank\">Babs And Bads</a>” (<i>Sacred Songs</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=hK6CroZ4-YM\" target=\"_blank\">You Burn Me Up I’m A Cigarette</a>” <span>[Robert Fripp]</span> (<i>Exposure</i>, 1978) “<a href=\"https://www.youtube.com/watch?v=xiFKnfpN8cM\" target=\"_blank\">You Must Be Good For Something</a>” (<i>Beauty On A Back Street</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=OrcMY5oyog0\" target=\"_blank\">The Emptyness</a>” (<i>Beauty On A Back Street</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=7IxQvrIsohc\" target=\"_blank\">Bad Habits & Infections</a>” (<i>Beauty On A Back Street</i>, 1977); “Winged Bull” (<i>Beauty On A Back Street</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=2QAkHlmbAwo\" target=\"_blank\">It’s A Laugh</a>” (<i>Along The Red Ledge</i>, 1978); “<a href=\"https://www.youtube.com/watch?v=tP3EnJdPn1I\" target=\"_blank\">Alley Katz</a>” (<i>Along The Red Ledge</i>, 1978); “<a href=\"https://www.youtube.com/watch?v=GkHacEnV-EE\" target=\"_blank\">Don’t Blame It On Love</a>” (<i>Along The Red Ledge</i>, 1978); “<a href=\"https://www.youtube.com/watch?v=YovKUQlSWik\" target=\"_blank\">August Day</a>” (<i>Along The Red Ledge</i>, 1978); “<a href=\"https://www.youtube.com/watch?v=pfdp3xuu5RQ\" target=\"_blank\">Wait For Me</a>” (<i>X-Static</i>, 1979); “<a href=\"https://www.youtube.com/watch?v=4CPZa21DFA8\" target=\"_blank\">Running From Paradise</a>” (<i>X-Static</i>, 1979); “<a href=\"https://www.youtube.com/watch?v=IgyVWGonOJo\" target=\"_blank\">Time’s Up (Alone Tonight)</a>” (outtake from <i>X-Static</i>, 1979)</p>\n<p><span><b>Megastardom: Voices, Private Eyes, H2O, and the 1980s<br />\n</b></span>Sick of their relative misfortunes amidst the dominance of disco and dance music in the late ’70s (which had the effect of dampening the commercial prospects of their own brand of ‘rock & soul’ pop), Hall & Oates decided to quit trying to compete with the trends and, in doing so, ironically began to set trends themselves. <i>Voices</i> (1980) was the duo’s move toward a fusion of new-wave spareness, soul, and pop, and the results turned them into superstars. Jeff spends over a minute patiently explaining why “Kiss On My List” is a work of pure genius from a songwriting perspective, while Robert chimes in to point out that it is, for all intents and purposes, a demo recording with overdubbed voices. Scot is even more enthusiastic about the Devo-goes-pop twitch of “You Make My Dreams” and praises Hall’s preternaturally catchy vocal tics. Jeff thinks that half of <i>Voices</i> is actually fairly dodgy (which is what you get from an album that is basically a set of self-produced demo recordings), but who cares when the other half has stuff like “How Does It Feel To Be Back”?</p>\n<p>If <i>Voices</i> was a flawed triumph, there are no such questions from the gang about <i>Private Eyes</i> (1981): Robert, Scot, and Jeff are unanimous in agreeing that this is one of the greatest Hall & Oates albums ever, and in fact one of the greatest early ’80s pop-rock albums full-stop. “Private Eyes” (Scot: “If you don’t clap your hands along to the chorus, I don’t think you’re cool”), “Did It In A Minute,” “Your Imagination,” “Head Above Water”…this record is great from start to finish. Jeff mentions the importance of Sara Allen (Hall’s longtime partner) and her sister Janna as co-writing partners during this era, and also praises the classic #1 single “Billie Jea”–erm, wait, he meant “I Can’t Go For That (No Can Do).” (The story of how Michael Jackson nicked the bassline of “I Can’t Go For That” is recounted.)</p>\n<p>Scot, interestingly enough, does not care nearly as much for <i>H2O</i>, the platinum-selling followup to “Private Eyes” (and home of “Maneater,” among other famous singles), citing a mechanical feel and downing particularly on “Art Of Heartbreak” and “Open All Night.” Robert is having none of this, however, claiming that he has been waiting his entire life to mount a defense of this record — which he then does, admirably. Jeff mostly just can’t believe that Mike Oldfield (he of <a href=\"https://www.youtube.com/watch?v=TXvtDm820zI\" target=\"_blank\"><i>Tubular Bells</i> fame</a>) wrote a Hall & Oates hit single.</p>\n<p>After Jeff takes time to praise the non-album hit “Say It Isn’t So,” the band addresses Hall & Oates’ final hit album, <i>Big Bam Boom</i>(1984), and then wraps up the rest of their career. All involved agree that it’s all about “Out Of Touch” (both Scot and Jeff even identify it as one of their five key H&O tracks); so much of the rest of <i>Big Bam Boom </i>is sabotaged by unfortunate ’80s production choices. The gang then concludes by reflecting on the remainder of Hall & Oates’ post-1984 output. All agree that there are still good songs to be found, but that the fire had gone out of Hall’s heart in a lot of ways.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=5KNXXmr2PPI\" target=\"_blank\">How Does It Feel To Be Back</a>” (<i>Voices</i>, 1980); “<a href=\"https://www.youtube.com/watch?v=0pIHILw_ekA\" target=\"_blank\">Kiss On My List</a>” (<i>Voices</i>, 1980); “<a href=\"https://www.youtube.com/watch?v=E4CZuj7solw\" target=\"_blank\">You Make My Dreams</a>” (<i>Voices</i>, 1980); “<a href=\"https://www.youtube.com/watch?v=m5Y0S6nMMWM\" target=\"_blank\">Everytime You Go Away</a>” (<i>Voices</i>, 1980); “<a href=\"https://www.youtube.com/watch?v=0aQKmbtp6Pc\" target=\"_blank\">Private Eyes</a>” (<i>Private Eyes</i>, 1981); “<a href=\"https://www.youtube.com/watch?v=Y380bkHlye8\" target=\"_blank\">I Can’t Go For That (No Can Do)</a>” (<i>Private Eyes</i>, 1981); “<a href=\"https://www.youtube.com/watch?v=xGsCagn16TQ\" target=\"_blank\">Did It In A Minute</a>” (<i>Private Eyes</i>, 1981); “<a href=\"https://www.youtube.com/watch?v=YMpFVVQZgck\" target=\"_blank\">Mano A Mano</a>” (<i>Private Eyes</i>, 1981); “<a href=\"https://www.youtube.com/watch?v=VuhUQTAx4hU\" target=\"_blank\">Head Above Water</a>” (<i>Private Eyes</i>, 1981); “<a href=\"https://www.youtube.com/watch?v=xmPVpU8cpa8\" target=\"_blank\">Maneater</a>” (<i>H2O</i>, 1982); “<a href=\"https://www.youtube.com/watch?v=Zov9Y62zctg\" target=\"_blank\">One On One</a>” (<i>H</i><i>2</i><i>O</i>, 1982); “<a href=\"https://www.youtube.com/watch?v=OHJeXetgnO8\" target=\"_blank\">Family Man</a>” (<i>H2O</i>, 1982); “<a href=\"https://www.youtube.com/watch?v=wCNlU7gI8TQ\" target=\"_blank\">Go Solo</a>” (<i>H2O</i>, 1982); “<a href=\"https://www.youtube.com/watch?v=KGyOWbmB05U\" target=\"_blank\">Say It Isn’t So</a>” (<i>Rock ‘N Soul, Part 1</i>, 1983); “<a href=\"https://www.youtube.com/watch?v=sPQJ1FiOOJA\" target=\"_blank\">Dance On Your Knees</a>” (<i>Big Bam Boom</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=FMPKkJQm1U8\" target=\"_blank\">Out Of Touch</a>” (<i>Big Bam Boom</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=FwCfeQq8ewQ\" target=\"_blank\">Some Things Are Better Left Unsaid</a>” (<i>Big Bam Boom</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=Nm4e1pyWKyU\" target=\"_blank\">So Close (unplugged)</a>” (<i>Change Of Season</i>, 1990)</p>\n<p><b><span>Finale</span><br />\n</b>Robert, Scot and Jeff each pick their two key albums and five key tracks by Hall & Oates</p>\n",
  "enclosure": "",
  "itunes:title": "Episode 11: Robert Dean Lurie / Hall and Oates",
  "itunes:author": "National Review",
  "itunes:duration": "02:05:25",
  "itunes:summary": "Scot and Jeff talk to Robert Dean Lurie about Hall and Oates.",
  "itunes:subtitle": "Scot and Jeff talk to Robert Dean Lurie about Hall and Oates.",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:episode": 11
}