{
  "title": "Improving the status quo: can severe asthma be better treated?",
  "link": "https://audioboom.com/posts/8001228",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1699,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Everyone knows somebody who has asthma. 5.4 million people in the UK are currently receiving treatment and 200,000 of them have severe asthma. A form of the condition that doesn’t typically respond well to medication. For many, asthma is a severe and debilitating condition but there exists a disconnect between its severity and the organisation of resources to treat it. When it comes to treating an illness, remission is rarely black and white, but for asthma it's commonly steroids.<br>\n<br>\n\n</div>\n<div>What if anything is the alternative? Steroids have become the frenemy of both patients and the healthcare system. On the one hand, they’re cheap to administer and largely effective. But on the other, the side effects they produce can be very difficult for patients and costly.<br>\n<br>\n\n</div>\n<div>Joining Kate Andrews to discuss all this is Gabby Perry, who is a student and has severe asthma; Syed Ali, medical affairs manager at AstraZeneca; David Price, professor of primary respiratory medicine at the University of Aberdeen who's currently leading the first international severe asthma registry.<em><br>\n<br>\n</em><br>\n\n</div>\n<div>\n<strong><em>This podcast is kindly sponsored and co-created by AstraZeneca.</em></strong><em><br>\n<br>\nThe patient's individual experience of severe asthma and discussion in this podcast are not medical advice. If you have questions about your own health please discuss with your health care professional.</em>\n</div>\n",
  "pubDate": "Wed, 22 Dec 2021 10:00:00 +0000",
  "guid": "tag:audioboom.com,2021-12-21:/posts/8001228",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}