{
  "title": "The 11 Commandments of Hugging Robots",
  "link": "https://spectrum.ieee.org/robot-hugs",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-smiling-woman-hugs-a-robotic-torso-with-a-soft-grey-sweatshirt-the-robot-s-head-has-a-purple-computer-screen-with-a-smiling-f.jpg?id=29615031&width=1200&height=800&coordinates=0%2C302%2C0%2C329\"/><br/><br/><p>If we’ve learned anything over the past few years, it’s how important it is not to take physical contact for granted. Unfortunately, physical contact with humans is something that robots find especially difficult and occasionally dangerous, so that we cannot (yet) safely use them as a proxy for nuanced physical contact with another person. It’s not just that robots are strong and humans are squishy (although both of those things are true), it’s that there are a lot of complex facets to human-on-human interaction that robots simply don’t understand.</p><p>In 2018, <a href=\"https://spectrum.ieee.org/the-importance-of-teaching-robots-to-hug\" target=\"_blank\">we wrote about research by Alexis E. Block and Katherine J. Kuchenbecker from the Haptic Intelligence Department at the Max Planck Institute for Intelligent Systems in Stuttgart, Germany, on teaching robots to give good hugs</a>. Over the last several years, they’ve continued this research (along with coauthors Sammy Christen, Hasti Seifi, Otmar Hilliges, and Roger Gassert), and have <a href=\"https://dl.acm.org/doi/10.1145/3526110\" target=\"_blank\">just published a paper</a> outlining the introduction of a new hugging robot along with 11 commandments that robots can follow to give hugs that humans will be able to appreciate and enjoy—without getting squished.<br/></p><p>To grasp why the apparently simple act of hugging demands so much research effort, next time you hug another person pay careful attention to what you’re doing and what they’re doing, and you’ll begin to understand. Hugs are interactive, emotional, and complex, and giving a good hug (especially to someone whom you don’t know well or have never hugged before) is challenging. It takes a lot of social experience and intuition, which is another way of saying that it’s a hard robotics problem, because social experience and intuition are things that robots tend not to be great at. Obviously, robotic embraces are never going to supplant human hugs, but the idea here is that sometimes getting physical human comfort is difficult or impossible, and in these cases, maybe robots could have something useful to offer.</p><p><a href=\"https://dl.acm.org/doi/10.1145/3526110\" target=\"_blank\">In this paper—just accepted in the <em>ACM Transactions on Human-Robot Interaction (THRI)</em></a>—Block used a data-driven approach to develop the commandments for hugging robots, building off of <a href=\"https://dl.acm.org/doi/10.1145/3434073.3444656\" target=\"_blank\">research also presented at the 2021 Human-Robot Interaction Conference</a>. Through a series of hardware iterations and user studies, the original <a href=\"https://robots.ieee.org/robots/pr2/\" target=\"_blank\">PR2</a>-based robotic hugging platform (HuggieBot) was been completely rebuilt and upgraded to HuggieBot 3.0, which is “the first fully autonomous human-sized hugging robot that recognizes and responds to the user’s intra-hug gestures.”</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"On left, a humanoid robot in a purple skirt and grey sweatshirt and grey mittens stands in an office. On right, the human robot hugging a woman.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"7be91d65a9895296c9b1f24b0a9faa98\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"01e6c\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/on-left-a-humanoid-robot-in-a-purple-skirt-and-grey-sweatshirt-and-grey-mittens-stands-in-an-office-on-right-the-human-robot.jpg?id=29615018&width=980\"/>\n</p><p>HuggieBot 3.0 is built around two six-degree-of-freedom Kinova JACO arms mounted horizontally on a custom metal frame, on top of a v-shaped horizontal base that makes it easier for humans to get in nice and close. The arms are padded, and the end effectors have mittens on them. Placed over the frame are chest and back panels made of air-filled chambers that provide softness as well as pressure sensing, and there’s a heating pad on top of each air chamber to make sure that the robot is nice and warm.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A humanoid robot torso with exposed robotic arms, a monitor for a head with a smiling face on it, with inflated chambers and heating pads on the torso.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"7801131fa70071a2419c33ceeff8076d\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"77637\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-humanoid-robot-torso-with-exposed-robotic-arms-a-monitor-for-a-head-with-a-smiling-face-on-it-with-inflated-chambers-and-hea.jpg?id=29615020&width=980\"/>\n</p><p>When HuggieBot detects a user in its personal space, it opens its arms and invites the user in for a hug. Based on the height and size of the user, the robot does its best to appropriately place its arms, even making sure that its wrist joints are oriented to keep the end effector contact as flat as possible. The robot, being a robot, will hug you until you’re all hugged out, but releasing your embrace or starting to back away will signal HuggieBot that you’re done and it’ll let you go, presumably with some reluctance. But if you want another hug, go for it, because no two hugs from the robot will ever be identical.</p><p>“Hugging HuggieBot 3.0 is (in my humble and unbiased opinion) really enjoyable,” author Alexis E. Block tells <em>IEEE Spectrum</em>. “We are not trying to fool anyone by saying that it feels like hugging a person, because it does not. You’re hugging a robot, but that doesn’t mean that it can’t be enjoyable.”</p><p>Part of making hugs enjoyable for humans involves the use of intrahug gestures, the development and test of which is one of the major contributions of the new paper. Intrahug gestures are the things you do with your arms and hands midhug, and while you may not always be consciously aware that you’re doing them, they could include things like gentle rubbing, pats, or squeezes.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A graphic showing hold (staying still), rub (moving vertically), pat (tapping on back), and squeeze (tightening hold) motions that are analogous to these motions performed by a human\" class=\"rm-shortcode\" data-rm-shortcode-id=\"3d213034bc1ccd1540fe1579c0da6e49\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"8cad7\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-graphic-showing-hold-staying-still-rub-moving-vertically-pat-tapping-on-back-and-squeeze-tightening-hold-motions-th.jpg?id=29615021&width=980\"/>\n</p><p>The hug “background” gesture is a hold, but (and you should absolutely try this at home), just doing an extended static hold-type hug will definitely make a hug feel kind of robotic. Human hugs involve extra gestures, and HuggieBot is now equipped for this. It’s able to classify the gestures that the human makes and respond with gestures of its own, although (to avoid being too robotic) those gestures aren’t always directly reciprocal, and sometimes the robot will initiate them independently. While the current version of HuggieBot can only rub, pat, or squeeze, future versions may also be able to perform other intrahug gestures, like leaning, or even tickling, if you’re into that.</p><p>Here are all 11 the commandments that HuggieBot 3.0 follows:</p><ol><li>A hugging robot shall be soft.</li><li>A hugging robot shall be warm.</li><li>A hugging robot shall be sized similar to an adult human.</li><li>When a hugging robot is the one initiating the interaction, it shall autonomously invite the user for a hug when it detects someone in its personal space. A hugging robot should wait for the user to begin walking toward it before closing its arms to ensure a consensual and synchronous hugging experience. </li><li>A hugging robot shall autonomously adapt its embrace to the size and position of the user’s body, rather than hug in a constant manner</li><li>A hugging robot shall reliably detect and react to a user’s desire to be released from a hug regardless of his or her arm positions.</li><li>A good hugging robot shall perceive the user’s height and adapt its arm positions accordingly to comfortably fit around the user at appropriate body locations.</li><li>It is advantageous for a hugging robot to accurately detect and classify gestures applied to its torso in real time, regardless of the user’s hand placement.</li><li>Users like a robot that responds quickly to their intrahug gestures.</li><li>To avoid appearing too robotic and to help conceal inevitable errors in gesture perception, a hugging robot shall not attempt perfect reciprocation of intrahug gestures. Rather, the robot should adopt a gesture response paradigm that blends user preferences with slight variety and spontaneity.</li><li>To evoke user feelings that the robot is alive and caring, a hugging robot shall occasionally provide unprompted, proactive affective social touch to the user through intrahug gestures.</li></ol><p>The researchers tested out HuggieBot 3.0 with actual human volunteers who seemed perfectly okay being partially crushed by an experimental hugging robot. Some of them couldn’t seem to get enough, in fact:</p><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"d24664e39b2a2edfc8779dd131302c35\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/nhq2Ps2wsUs?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n</p><p>The study participants were generally able to successfully detect and classify the majority of HuggieBot’s intrahug gestures. People appreciated the gestures, too, commenting that they helped the robot feel more alive, more social, and more realistic. Squeezes were particularly popular, with participants commenting that it felt “closest to a real human hug” and gave them “a sense of security and comfort.” Interestingly, some people characterized the hugs that they received from the robot in very specific, anthropomorphic ways, often attributing emotions, mood swings, and attitudes to the robot depending on their perception of the hug. Hugs were described as “a comforting hug from a mother,” “a distant relative at a funeral,” “receiving a pity hug from someone who doesn’t want to,” and even “hugging a lover.” Overall, the majority of the study participants felt that the experience was pretty great, and 40 percent of them said that they came to think of HuggieBot as their friend. </p><p>It’s important to note that this is not an “in-the-wild” study of HuggieBot. It took place in a laboratory environment, and all of the participants specifically signed up to be part of a robot hugging study, for which they were compensated. “We look forward to conducting a thorough in-the-wild study to see how many everyday people would and would not be interested in hugging a robot,” say the researchers. Ideally, such a study would take place over weeks and months, to help determine how much of HuggieBot’s appeal is simply due to novelty—always a potential problem for new robots.</p><p> The other thing to keep in mind is that, as the researchers point out, HuggieBot does not in any way understand what hugs mean:</p><blockquote>We acknowledge that the current version of our robot does not deliver on the full aspirational goal of a hugging robot. Rather, HuggieBot simulates a hug in a reasonably compelling way, and our data suggest that users enjoy the hug and can engage with the robot and relate to it as an autonomous being. However, in its current state, HuggieBot does not have an internal emotional model similar to humans, and thus it is not capable of engaging in the embodied emotional experience of a hug.</blockquote><p>Fortunately, hugs are both an emotional thing <em>and</em> a physical thing, and even an emotionless robot can use physical contact to potentially have a tangible, measurable impact on the emotional states of humans—something that the researchers do in fact hope to measure in a quantitative way.</p><p class=\"pull-quote\">We certainly are not trying to replace human hugs but to provide a supplement when it might be difficult or impossible to receive a hug from another person. —Alexis Block</p><p>We’ll talk about their future work in just a minute, but first, <em>IEEE Spectrum</em> spoke with first author <a href=\"https://is.mpg.de/~alexis\" target=\"_blank\">Alexis Block</a> (who <a href=\"https://is.mpg.de/en/news/otto-hahn-medal-awarded-to-alexis-e-block\" target=\"_blank\">just received the Max Planck Society’s Otto Hahn Medal for her work on HuggieBot</a>) for more details on this new generation robot hugs:</p><p><strong><a href=\"https://spectrum.ieee.org/the-importance-of-teaching-robots-to-hug\" target=\"_blank\">We asked you in 2018 why teaching robots to hug is important</a>. Three years on, what do you now think the importance of this research is?</strong></p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"A woman with long hair smiles while resting an arm on a sweatshirt-clad robot.\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"0d5d371010d24464fe7a0086dd20ce00\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"4c772\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-woman-with-long-hair-smiles-while-resting-an-arm-on-a-sweatshirt-clad-robot.jpg?id=29615053&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\" style=\"max-width: 100%;\">Alexis Block with her hugging robot</small></p><p><strong>Alexis Block: </strong>I think the COVID-19 pandemic has made the importance of this research more salient than ever. While we could never have foreseen a situation like we are currently experiencing, in 2018 we were researching robot hugs so we could one day provide the emotional support and health benefits of human hugs to people wherever or whenever they needed it. At the time, my advisor Katherine Kuchenbecker and I were primarily thinking of friends and family separated by a physical distance, like how we were separated from our families (living in Germany and our families living in the United States). Before the pandemic, we hugged, high-fived, and otherwise socially contacted our friends and family without a second thought. Now, many of us have realized that social distancing and the resulting lack of physical contact can harm our overall well-being. Even after we return to “normal,” some members of our society may be medically more vulnerable and will not be able to join us. We believe HuggieBot could be used as a tool to supplement, not replace, human hugs for situations when it is difficult or uncomfortable to get the support you need or want from another person. </p><p><strong>Can you share some qualitative feedback from study participants? </strong></p><p><strong>Block: </strong>In our validation study with HuggieBot 3.0, the average user hug duration was about 25 seconds long. For comparison, the average hug between humans is 2 to 3 seconds. To receive the positive benefits of deep pressure touch, researchers have found <a href=\"https://pubmed.ncbi.nlm.nih.gov/15206831/\" rel=\"noopener noreferrer\" target=\"_blank\">20 seconds of constant hugging between romantic partners is necessary</a>, and our users, on average, hugged our robot for even longer. We made it clear to our users that they were free to hug the robot for as long or as short a duration as they liked. Compare hugging a stranger or acquaintance (2 to 3 seconds) to hugging a partner, a friend, or a family member (20 seconds). </p><p>On average, based on the duration of how long our users felt comfortable hugging our robot, we think users treated HuggieBot 3.0 more like a partner, friend, or family member than a stranger or acquaintance. That was impressive because they had never met HuggieBot before! In their free-response questionnaires, several of our users mentioned that they thought the robot was their “friend” by the end of the experiment. We believe these results speak to the quality of the embrace users felt during the embrace; they truly felt like they were hugging a friend, which was especially meaningful because we conducted this study during the pandemic.</p><p><strong>Many participants seemed very happy while hugging the robot! But did you have anyone react negatively? </strong></p><p><strong>Block: </strong>While most users had positive things to say about the robot and their experience during the study, two users still mentioned that while they enjoyed the interaction, they didn’t understand the purpose of a hugging robot because they felt that human hugs are “irreplaceable.” We certainly are not trying to replace human hugs but to provide a supplement when it might be difficult or impossible to receive a hug from another person.</p><p><strong>Are there any ways in which robot hugs are potentially superior to human hugs?</strong></p><p><strong>Block: </strong>The main way robot hugs are potentially superior to human hugs is due to the lack of social pressure. When you’re hugging HuggieBot, you know you’re hugging a robot and not another person, and that’s part of its beauty. You don’t have to worry about being judged for needing to be held “too long” to “too tight.” Instead, the robot is there to support you and your needs. Many users commented that they feel more comfortable hugging the robot than other people because they don’t have to worry about the timing or judgment aspect involved with hugging another person. </p><p><strong>You are likely the world’s foremost expert on robot hugs—what have you learned over the past several years that was most surprising to you?</strong></p><p><strong>Block: </strong>One surprising result was that when investigating how the robot should respond to users’ intrahug gestures, we initially thought the robot should mimic the gestures it felt. But, interestingly, users expressed that they wanted a variety of gestures in response to theirs instead of one-to-one reciprocation. Furthermore, they explained that it felt superficial and mechanical when the robot parroted back their gestures. However, when the robot responded with a different gesture of a similar “emotional investment level,” they mentioned feeling like the robot “understands [them] and makes his own decision.” </p><p>We also were unsure how users would respond to proactive robotic intrahug gestures, which is when the robot squeezes, pats, or rubs a user who is holding still within the hug. We worried, particularly with the squeeze, that the users would be alarmed by the unprompted motion and think that the robot was malfunctioning. In this instance, we were pleasantly surprised to find that users really enjoyed proactive robotic intrahug gestures, mentioning that they felt the robot was comforting them rather than responding to their inputs. Furthermore, they attributed emotions and feelings to the robot, saying they felt the robot cared about them when it chose to perform its own gesture.</p><p class=\"pull-quote\">Ultimately, if we can help even just a few people be a little happier by giving them a way to hug friends and family they thought they wouldn’t be able to, I think that would be an incredible outcome. —Alexis Block</p><p><strong>How do you hope that your research will be applied in useful ways in the future?</strong></p><p><strong>Block: </strong>Back in 2016, when Katherine and I started this work as my master’s thesis at the University of Pennsylvania, we were inspired because our families lived far away, and we missed them. Especially given the COVID-19 pandemic and the resulting isolation, I think many people now understand first-hand the significant effect social touch with friends and loved ones has on our mental health. I hope that in the future, this research can be used to help strengthen personal relationships separated by a physical distance. Ultimately, if we can help even just a few people be a little happier by giving them a way to hug friends and family they thought they wouldn’t be able to, I think that would be an incredible outcome.</p><div class=\"horizontal-rule\"></div><p>Block is already testing an upgraded version of HuggieBot: HuggieBot 4.0 is the best hugging robot yet, featuring improved hug positioning and better prehug technique, among other upgrades. “With these improvements to HuggieBot, we finally felt we had a version of a hugging robot that was of high enough quality to compare to hugging another person,” says Block. This comparison will be physiological, measuring whether and to what extent hugging a robot may elicit physical responses that are similar to hugging a real human. The researchers plan to “induce stress upon voluntary participants” (!) and then provide either an active human hug, a passive human hug, an active robot hug, or a passive robot hug and use periodic saliva measurements to measure cortisol and oxytocin levels. Hopefully, the results will show that humans can derive real benefits from robot hugs, and that when human hugs are not an option, we can look for a soft, warm robotics embrace instead.</p>",
  "pubDate": "Thu, 31 Mar 2022 18:42:46 +0000",
  "guid": "https://spectrum.ieee.org/robot-hugs",
  "category": [
    "Hri",
    "Robotics"
  ],
  "dc:creator": "Evan Ackerman",
  "media:content": ""
}