{
  "title": "#471: PUNK'd (OOTP 33 and 34, 'Fight or Flight' and 'The Department of Mysteries')",
  "link": "https://audioboom.com/posts/7619047",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5072,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>News covers The Blair Partnership controversy and suspended Chapter Readings</li>\n<li>This week: It's a double dose of <a href=\"https://www.mugglecast.com/harry-potter-chapter-chapter-analysis-archive/\">Chapter-by-Chapter</a>!</li>\n<li>First up, Order of the Phoenix – Chapter 33: Fight or Flight</li>\n<li>7-Word Summary #1: Centaurs react aggressively to Hermione’s faulty argument</li>\n<li>Did Umbridge fail to search Hagrid's Hut after she gave him the boot?</li>\n<li>Leading Umbridge into the Forbidden Forest: was it Hermione's top Gryffindor moment? Listeners weigh in with their thoughts.</li>\n<li>Umbridge vs. The Centaurs: What happened to Umbridge when she was attacked by the Centaurs?</li>\n<li>For additional information on Centaurs and what may have happened to Umbridge, check out: <a href=\"https://www.greekmythology.com/Myths/Creatures/Centaur/centaur.html\">GreekMythology.com</a>, <a href=\"https://www.kialo.com/in-greek-mythology-a-main-characteristic-for-centaurs-is-that-they-take-away-human-women-and-rape-them-jk-rowling-knows-15795.2\">Kialo.com</a>, and <a href=\"https://ijfs.padovauniversitypress.it/system/files/papers/17_2_02.pdf\">Pandova University Press</a>\n</li>\n<li>Is there any symbolism to the Centaurs breaking Umbridge's wand in half?</li>\n<li>Did Hermione really think through what would happen to Umbridge? Should she have let Harry do the talking with the Centaurs?</li>\n<li>Why does Harry look down upon Ginny, Neville and Luna?</li>\n<li>Next up, Order of the Phoenix – Chapter 34: The Department of Mysteries</li>\n<li>7-Word Summary #2: Prophecies are exposed when doors are opened</li>\n<li>For a breakdown of the actual departments, give a listen to <a href=\"https://www.mugglecast.com/episode-374-department-of-mysteries-harry-potter/\">Episode 374</a>\n</li>\n<li>The Ministry of Magic is A SECURITY NIGHTMARE!</li>\n<li>Why is Harry so entranced by The Veil?</li>\n<li>Did The Veil exist before the Ministry of Magic?</li>\n<li>What exactly was Harry's plan if he discovered Voldemort in the Hall of Prophecy?</li>\n<li>Umbridge Suck Count, MVP of the Week and Rename The Chapter return!</li>\n<li>Quizzitch: What planet does not survive the battle in the Department of Mysteries?</li>\n<li>This week’s episode is sponsored by MeUndies (Underwear that’s so good, Dobby would never take it off his head! Get 15% off your first order and free shipping by going to <a href=\"http://www.meundies.com/MuggleCast\">MeUndies.com/MuggleCast</a>)!</li>\n<li>Join our community at <a href=\"http://www.patreon.com/mugglecast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 30 Jun 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-06-29:/posts/7619047",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}