{
  "itunes:episode": 58,
  "title": "Gaze Deeply Into My Crowdfunding Navel with Guest Glenn Fleishman",
  "pubDate": "Thu, 16 Jan 2014 15:04:24 +0000",
  "link": "http://newdisrupt.org/blog/2014/1/16/gaze-deeply-into-guest-glenn-58",
  "description": "<p>Guest host Jason Snell talks to regular host Glenn Fleishman about Glenn's <a href=\"http://www.kickstarter.com/projects/glennf/the-magazine-the-book-year-one\">recent Kickstarter campaign</a> to fund a book of non-fiction articles from <em>The Magazine</em>. Jason, host of <a href=\"http://www.theincomparable.com/\">The Incomparable</a> and an editorial director at a major magazine firm, quizzes Glenn about failure, success, fulfillment (product and otherwise), and the reason we solicit funds from our fans, friends, family, and strangers.</p>\n\n<p>This episode is sponsored by <a target=\"_blank\" href=\"http://mediatemple.net/?utm_source=thenewdisruptors&utm_medium=banner&utm_content=jan_podcast&utm_campaign=general\">Media Temple</a>: Web hosting for artists, designers, and Web developers since 1998. World-class support available 24x7 through phone and chat—and even Twitter. Media Temple hosts beautiful websites and great ideas. Sign up with coupon code \"tnd\" to get 25% off your first month of hosting.</p>\n\n<p>We're also sponsored this time by Smile Software's <a target=\"_blank\" href=\"http://smilesoftware.com/nd\">TextExpander</a>! TextExpander avoids the tedium of retyping common text, shortening URLs, and much more. Get a copy today and let the computer do the hard work!</p>",
  "guid": "tag:soundcloud,2010:tracks/129846535",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "01:18:24",
  "itunes:subtitle": "Guest host Jason Snell talks to regular host Glenn Fleishman about Glenn's recent Kickstarter campaign.",
  "itunes:summary": "Guest host Jason Snell talks to regular host Glenn Fleishman about Glenn's recent Kickstarter campaign to fund a book of non-fiction articles from The Magazine. Jason, host of The Incomparable and an editorial director at a major magazine firm, quizzes Glenn about failure, success, fulfillment (product and otherwise), and the reason we solicit funds from our fans, friends, family, and strangers.\n\nThis episode is sponsored by Media Temple: Web hosting for artists, designers, and Web developers since 1998. Use code \"tnd\" at mediatemple.net to get 25% off your first month of hosting. Also sponsored by Smile Software's time-saving TextExpander http://smilesoftware.com/nd"
}