{
  "title": "An Open Platform for Simulating the Physical Layer of 6G Communication Systems with Multiple Intelligent Surfaces. (arXiv:2211.01659v1 [cs.ET])",
  "link": "http://arxiv.org/abs/2211.01659",
  "description": "<p>Reconfigurable Intelligent Surfaces (RIS) constitute a promising technology\nthat could fulfill the extreme performance and capacity needs of the upcoming\n6G wireless networks, by offering software-defined control over wireless\npropagation phenomena. Despite the existence of many theoretical models\ndescribing various aspects of RIS from the signal processing perspective (e.g.,\nchannel fading models), there is no open platform to simulate and study their\nactual physical-layer behavior, especially in the multi-RIS case. In this\npaper, we develop an open simulation platform, aimed at modeling the\nphysical-layer electromagnetic coupling and propagation between RIS pairs. We\npresent the platform by initially designing a basic unit cell, and then\nproceeding to progressively model and simulate multiple and larger RISs. The\nplatform can be used for producing verifiable stochastic models for wireless\ncommunication in multi-RIS deployments, such as vehicle-to-everything (V2X)\ncommunications in autonomous vehicles and cybersecurity schemes, while its code\nis freely available to the public.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Papadopoulos_A/0/1/0/all/0/1\">Alexandros Papadopoulos</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Lalas_A/0/1/0/all/0/1\">Antonios Lalas</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Votis_K/0/1/0/all/0/1\">Konstantinos Votis</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Tyrovolas_D/0/1/0/all/0/1\">Dimitrios Tyrovolas</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Karagiannidis_G/0/1/0/all/0/1\">George K. Karagiannidis</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ioannidis_S/0/1/0/all/0/1\">Sotiris Ioannidis</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liaskos_C/0/1/0/all/0/1\">Christos Liaskos</a>"
}