{
  "title": "504 - Confirming a Wuhan Seafood Market as the Origin of COVID-19",
  "itunes:title": "504 - Confirming a Wuhan Seafood Market as the Origin of COVID-19",
  "pubDate": "Fri, 12 Aug 2022 10:00:00 +0000",
  "guid": "2e2f91c5-51a2-46dd-a9f4-57417f029ffe",
  "link": "https://johnshopkinssph.libsyn.com/504-confirming-a-wuhan-seafood-market-as-the-origin-of-covid-19",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">A new report confirms the origins of SARS-CoV-2 as a spillover event from a seafood market in Wuhan, China. Biosecurity expert</span> <strong>Gigi Gronvall</strong> <span style=\"font-weight: 400;\">returns to the podcast to talk with</span> <strong>Lindsay Smith Rogers</strong> <span style=\"font-weight: 400;\">about what we now know happened, why it took so long to pinpoint and confirm COVID’s origins, and why this information is crucial for research and preventing future pandemics. Read the report</span> <a href= \"https://www.science.org/doi/10.1126/science.abp8715\"><span style= \"font-weight: 400;\">here</span></a><span style= \"font-weight: 400;\">.</span></p>",
  "content:encoded": "<p>A new report confirms the origins of SARS-CoV-2 as a spillover event from a seafood market in Wuhan, China. Biosecurity expert Gigi Gronvall returns to the podcast to talk with Lindsay Smith Rogers about what we now know happened, why it took so long to pinpoint and confirm COVID’s origins, and why this information is crucial for research and preventing future pandemics. Read the report <a href= \"https://www.science.org/doi/10.1126/science.abp8715\">here</a>.</p>",
  "enclosure": "",
  "itunes:duration": "18:33",
  "itunes:explicit": false,
  "itunes:keywords": "China,Pandemic,virus,coronavirus,wuhan,endemic,covid19,covid",
  "itunes:subtitle": "A new report confirms the origins of SARS-CoV-2 as a spillover event from a seafood market in Wuhan, China. Biosecurity expert Gigi Gronvall returns to the podcast to talk with Lindsay Smith Rogers about what we now know happened, why it took so long...",
  "itunes:season": 6,
  "itunes:episode": 504,
  "itunes:episodeType": "full",
  "itunes:author": "The Johns Hopkins Bloomberg School of Public Health"
}