{
  "id": "tag:blogger.com,1999:blog-1747027701196237068.post-4798701598197028269",
  "published": "2021-12-01T09:00:00.016-05:00",
  "updated": "2021-12-01T13:00:03.020-05:00",
  "title": "Canadian Actor Simu Liu named ambassador for Google Pixel 6",
  "content": "<div style=\"text-align: center;\">Liu working on ad and social media projects to promote Google’s flagship smartphone&nbsp;</div><div style=\"text-align: center;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-80Gt7Rk7d4c/YaeIug1eieI/AAAAAAAAEq8/b5oh7peqlV4QHxjqpX549sCrsYRqIaj2wCNcBGAsYHQ/s2048/Simu%2Bx%2BGoogle%2BAnnouncement%2BPost%2B%2528TW%2529%2B%25281%2529.jpg\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1366\" data-original-width=\"2048\" src=\"https://1.bp.blogspot.com/-80Gt7Rk7d4c/YaeIug1eieI/AAAAAAAAEq8/b5oh7peqlV4QHxjqpX549sCrsYRqIaj2wCNcBGAsYHQ/s16000/Simu%2Bx%2BGoogle%2BAnnouncement%2BPost%2B%2528TW%2529%2B%25281%2529.jpg\" /></a></div><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><div><div><br /></div><div>Google Canada has recruited film and TV star Simu Liu to act as the spokesperson for their latest smartphones, the <a href=\"https://store.google.com/ca/product/pixel_6_pro?hl=en-US\" rel=\"nofollow\" target=\"_blank\">Pixel 6 and Pixel 6 Pro</a>.&nbsp;</div><div><br /></div><div>Liu, fresh off his star-making role playing superhero Shang-Chi in the Marvel Cinematic Universe film Shang-Chi and The Legend of The Ten Rings, will now collaborate with Google to create content for Canadian audiences that celebrates the latest generation of Pixel smartphones, which launched in Canada on October 28. In the same way that Simu has helped spearhead conversations about representation in film and TV, Simu’s vision  seamlessly lines up with Google’s values of helpfulness and inclusivity. Liu will now shoot a series of digital ad and social media spots that contextualize some of the new phones’ most interesting features in a style that puts Simu’s personality front and centre.&nbsp;</div><div><br /></div><div>“In my industry, everyone tends to gravitate towards one way of communicating. But I think it’s time for me to make a change and shake things up with Google.” says Liu. “I’ve been trying out the Pixel 6 Pro for a couple weeks now, and I’m excited to share my thoughts on Pixel with the world.”&nbsp;</div><div><br /></div><div>Born in China before moving to Canada at the age of five, Liu first gained acclaim on the CBC comedy series Kim’s Convenience. In both his acting career and personal life, Liu has broken barriers around Asian representation, serving as a champion for his community. Google Canada has identified Simu’s important role in the space of representation, making him a perfect fit for the Pixel 6.&nbsp;</div><div><br /></div><div>“Simu Liu has captured the hearts of Canadians with his inspirational story and newfound stardom, and we’re excited to continue telling that story through the Pixel 6,”says Laura Pearce, Head of Marketing, Google Canada. \"The Pixel 6 is our most progressive phone, bringing out what makes people unique and connecting them to those around them; perfectly aligned with the message that Simu is bringing to fans in Canada and across the world.\"&nbsp;</div><div><br /></div><div>The Pixel 6 and Pixel 6 Pro are a culmination of Google’s long-term investments in AI and machine learning, featuring its first System on a Chip (SoC), the <a href=\"https://blog.google/products/pixel/introducing-google-tensor/\" rel=\"nofollow\" target=\"_blank\">Google Tensor</a>. With the Pixel 6 being the first true all-Google phone inside and out, the powerful Google Tensor chip unlocks the full potential of the phone’s camera system, Android user interface and AI that Google is known for.&nbsp;</div><div><br /></div><div>Google Tensor allows the Pixel 6 to adapt to each individual user and provide some of the most accommodating and inclusive features ever offered on a Pixel phone. This includes Real Tone technology, which uses camera tuning models and algorithms to help more accurately highlight the nuances and details of darker skin tones, and Live Translate, which combines Pixel’s  speech recognition with Google’s translation capabilities to help users to communicate in languages other than their own across a number of applications².&nbsp;</div><div><br /></div><div>Liu will film the new spots and social media content later this month, with the content beginning to appear in Canada and his social media channels (<a href=\"https://blog.google/products/pixel/introducing-google-tensor/\" rel=\"nofollow\" target=\"_blank\">@simuliu</a>) this holiday season. The Google Pixel 6 and Pixel 6 Pro are now available on <a href=\"https://store.google.com/ca/product/pixel_6?gclid=Cj0KCQjw5oiMBhDtARIsAJi0qk1sfLPZTvkoGN8csgY3hAjYu8iIMxQ7k320t54T2DFBg2MvwKVGV5YaAj8VEALw_wcB&amp;gclsrc=aw.ds&amp;hl=en-GB\" rel=\"nofollow\" target=\"_blank\">the Google Store</a>.&nbsp;</div><div><br /></div><div><span style=\"font-size: x-small;\">1 Based on a survey conducted by Google using pre-production devices in early September 2021.&nbsp;</span></div><div><span style=\"font-size: x-small;\">2 Not available in all languages or countries. Not available on all media or apps. See g.co/pixel/livetranslate for more information.</span></div></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Aaron Brindle",
    "uri": "http://www.blogger.com/profile/13885417405401273013",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}