{
  "title": "517: The Potter Fandom's Life-Changing Support for LGBTQ+ People",
  "link": "https://audioboom.com/posts/7886503",
  "itunes:episode": 517,
  "itunes:title": "The Potter Fandom's Life-Changing Support for LGBTQ+ People",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4736,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Welcome <a href=\"https://www.swishflickcast.com/\">Swish and Flick</a>'s Meg & Katie!</li>\n<li>Main Discussion: Celebrating Pride Month in the Harry Potter fandom</li>\n<li>Andrew, Meg & Katie share their personal experiences of coming out and the feeling of safety in the Potter fan community</li>\n<li>What is it about the Harry Potter fandom that makes it a welcoming place for diversity? What have the hosts noticed about inclusion at Potter events?</li>\n<li>What’s a “different” thing about the other hosts that the fandom didn’t judge them for?</li>\n<li>Why was it such a big deal to reveal Dumbledore's sexuality? What other gay characters were in pop culture at the time?</li>\n<li>How important is it for us to remember the time at which the Harry Potter series was written?</li>\n<li>Does the lack of an LGBTQ+ character in the Harry Potter series speak to its larger diversity issue?</li>\n<li>Would J.K. Rowling  have viewed including a gay character as a risk? Would publishers be concerned about how parents might react to a gay character? </li>\n<li>We discuss the possible sexualities of several Potter characters, including Nymphadora Tonks, Charlie Weasley, Remus Lupin, Sirius Black and more</li>\n<li>Quizzitch: A witch named Glenda Chittock hosts this program on the Wizarding Wireless Network, dedicated to interviewing musicians. What is the name of the program? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week’s episode is sponsored by MasterClass (Get 15% off an annual subscription at <a href=\"https://www.masterclass.com/mugglecast\">MasterClass.com/mugglecast</a>) and MeUndies, makers of the most comfortable underwear (get 15% off your first order at <a href=\"http://meundies.com/mugglecast\">MeUndies.com/mugglecast</a>).</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like access to our recording studio, Bonus MuggleCast, a personalized thank you video from one of the hosts and more!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 15 Jun 2021 09:00:00 +0000",
  "guid": "tag:audioboom.com,2021-06-14:/posts/7886503",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}