{
  "title": "Lower-Income Americans are Taxed Much Less Heavily Than Lower-Income Europeans",
  "description": "<p>&nbsp;</p>\n<blockquote>\n<p style=\"font-weight: 400;\">The top 10 percent of households in the United States earn about 33.5 percent of all income, but they pay 45.1 percent of income-related taxes, including Social Security and Medicare taxes. In other words, their share of all income-related taxes is 1.35 times <del>larger than</del> as large as their share of income. That is the most progressive income tax share of any OECD nation. In Germany, the top 10 percent earn 29.2 percent of the income and pay 31.2 percent of income-related taxes, 1.07 times their share of income. The French top 10 percent earn 25.5 percent of the income and pay 28.0 percent of the income taxes, 1.10 times their share of income.</p>\n<p style=\"font-weight: 400;\">If the top earners pay a smaller share of income taxes in other countries, that means everybody else pays a greater share. In the United States, the top 10 percent of income earners pay 7.6 percent of GDP in income-related taxes, and the bottom 90 percent pay 9.2 percent. In Germany, the top 10 percent of earners pay a similar 7.4 percent of GDP in income-based taxes, but the remaining 90 percent in Germany pay 16.4 percent of GDP, 77 percent more than in the United States. In France, the top 10 percent pay 7.1 percent of GDP; the remaining 90 percent of taxpayers pay 18.2 percent of GDP, 97 percent more than in the United States. Even in Sweden, the top 10 percent of earners pay only 5.9 percent of GDP in income-related taxes, 22 percent less than in the United States; the other 90 percent of earners pay 16.3 percent, 77 percent more than in the United States.</p>\n</blockquote>\n<p>This is from page 54 of Phil Gramm, Robert Ekelund, and John Early, <a href=\"https://amzn.to/3zFKyR9\"><em>The Myth of American Inequality: How Government Biases Policy Debate</em></a>. It was published in September.</p>\n<div class=\"block-quote\">\n<div class=\"pull-quote-blue\"><img loading=\"lazy\" class=\"alignnone size-medium wp-image-62183\" src=\"https://www.econlib.org/wp-content/uploads/2022/11/9781538167397-189x300.jpg\" alt=\"\" width=\"189\" height=\"300\" srcset=\"https://www.econlib.org/wp-content/uploads/2022/11/9781538167397-189x300.jpg 189w, https://www.econlib.org/wp-content/uploads/2022/11/9781538167397.jpg 315w\" sizes=\"(max-width: 189px) 100vw, 189px\" /></div>\n</div>\n<p>The book is first rate and their deep dive into the data is very careful. I learned a lot. My review of the book will be published on the Hoover Institution&#8217;s <em>Defining Ideas</em> site tomorrow. It&#8217;s a long review and so I didn&#8217;t have space to deal with the comparison between taxes in the United States and taxes in the OECD countries, most of which are in Europe.</p>\n<p>When I first read the paragraphs above, I said to myself, &#8220;Well, of course; that&#8217;s because most of the European countries have a stiff value-added tax (VAT.)&#8221; Then I read the paragraphs more carefully and saw that it&#8217;s about simply taxes on income and, therefore, doesn&#8217;t include the VAT.</p>\n<p>They drive that point home in the very next paragraph, on page 55, writing:</p>\n<blockquote>\n<p style=\"font-weight: 400;\">Even these numbers understate just how progressive the total tax burden is in America. The United States collects only 35.8 percent of all tax revenues from sources other than income, such as sales and excise taxes, the smallest share of any country in the OECD. Most OECD members have large value-added taxes (VATs). These taxes are paid on most purchases by all consumers. The VAT is one of the most regressive forms of taxation, which means that the tax systems of the rest of the developed world are even less progressive than indicated by the income tax comparisons.</p>\n</blockquote>\n<p>Wow! Remember that <a href=\"https://taxfoundation.org/consumption-tax-policies/\">two thirds of OECD countries</a> have a VAT of 20 percent or more.</p>\n(38 COMMENTS)",
  "link": "https://www.econlib.org/lower-income-americans-are-taxed-much-less-heavily-than-lower-income-europeans/",
  "guid": "https://www.econlib.org/lower-income-americans-are-taxed-much-less-heavily-than-lower-income-europeans/",
  "category": [
    "Books: Reviews and Suggested Readings",
    "Taxation",
    "Europe",
    "inequality",
    "John Early",
    "OECD",
    "Phil Gramm",
    "Robert Ekelund",
    "tax burden",
    "VAT"
  ],
  "pubDate": "Thu, 03 Nov 2022 12:00:14 +0000"
}