{
  "id": "https://bibleinoneyear.org/en/youth/109",
  "title": "Day 109: God’s Strategic Plan",
  "description": "Psalm 48:1–3,8, Deuteronomy 30:19, 31:8-11, Luke 11:12–41. It is not surprising, therefore, that cities have always had an important role in the purposes of God  In particular, one city has been at the heart of God’s strategy for the world",
  "pubDate": "Mon, 19 Apr 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/109/?ignore",
  "itunes:duration": "13:31",
  "guid": "enyouth19042021-109",
  "length": 811.89,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 109: God’s Strategic Plan",
  "itunes:subtitle": "Psalm 48:1–3,8, Deuteronomy 30:19, 31:8-11, Luke 11:12–41. It is not surprising, therefore, that cities have always had an important role in the purposes of God  In particular, one city has been at the heart of God’s strategy for the world",
  "itunes:summary": "I live in London. With a population of over 8 million, it is the largest city in Europe and one of the largest in the world. It usually receives over 18 million visitors a year. It is a city where over 300 languages are spoken.\nCities are strategic places for the spread of the gospel. They always have been. The apostle Paul took the gospel from city to city. As early as AD 100, more than 40 Christian communities existed in cities across the Mediterranean world, including North Africa and parts of Italy. By AD 300 half the citizens of that region were Christian while 90% of the countryside was still pagan. Most of Paul’s letters were written to cities.\nCities tend to be places where culture is formed. Many of the spheres of influence emanate from the city, including government, politicians and law-makers; arts and entertainment; business and the marketplace; universities and other places of education; media and communication centres. The river of influence tends to flow from the city to the suburbs and rural areas. The way to transform a culture is to transform the city.\nIt is not surprising, therefore, that cities have always had an important role in the purposes of God. In particular, one city has been at the heart of God’s strategy for the world.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 109
}