{
  "title": "SecSkyline: Fast Privacy-Preserving Skyline Queries over Encrypted Cloud Databases. (arXiv:2209.07064v2 [cs.CR] UPDATED)",
  "link": "http://arxiv.org/abs/2209.07064",
  "description": "<p>The well-known benefits of cloud computing have spurred the popularity of\ndatabase service outsourcing, where one can resort to the cloud to conveniently\nstore and query databases. Coming with such popular trend is the threat to data\nprivacy, as the cloud gains access to the databases and queries which may\ncontain sensitive information, like medical or financial data. A large body of\nwork has been presented for querying encrypted databases, which has been mostly\nfocused on secure keyword search. In this paper, we instead focus on the\nsupport for secure skyline query processing over encrypted outsourced\ndatabases, where little work has been done. Skyline query is an advanced kind\nof database query which is important for multi-criteria decision-making systems\nand applications. We propose SecSkyline, a new system framework building on\nlightweight cryptography for fast privacy-preserving skyline queries.\nSecSkyline ambitiously provides strong protection for not only the content\nconfidentiality of the outsourced database, the query, and the result, but also\nfor data patterns that may incur indirect data leakages, such as dominance\nrelationships among data points and search access patterns. Extensive\nexperiments demonstrate that SecSkyline is substantially superior to the\nstate-of-the-art in query latency, with up to 813$\\times$ improvement.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Zheng_Y/0/1/0/all/0/1\">Yifeng Zheng</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_W/0/1/0/all/0/1\">Weibo Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_S/0/1/0/all/0/1\">Songlei Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Jia_X/0/1/0/all/0/1\">Xiaohua Jia</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Huang_H/0/1/0/all/0/1\">Hejiao Huang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_C/0/1/0/all/0/1\">Cong Wang</a>"
}