{
  "title": "Minkorrekt Folge 22 „Bierkanneneffekt“",
  "itunes:title": "Minkorrekt Folge 22 „Bierkanneneffekt“",
  "description": "Heute mit Riesenviren, Nanoschmetterlinge, sadistischen Trollen und gefährlichen Nanopartikeln. Experiment der Woche: \"Bierkanneneffekt\".\n\nDu möchtest mehr über unsere Werbepartner erfahren? Hier findest du alle Infos & Rabatte: https://linktr.ee/methodischinkorrekt",
  "pubDate": "Tue, 11 Mar 2014 08:34:00 +0000",
  "link": "https://minkorrekt.podigee.io/24-minkorrekt-folge-22-bierkanneneffekt",
  "guid": "http://methodischinkorrekt.wordpress.com/?p=283",
  "content:encoded": "„Bierkanneneffekt“ direkt von der Prunksitzung der Wissenschaften.\n<p>&nbsp;</p>\n<p>Gar nichts ist am Aschermittwoch vorbei! Hier ist Folge 22 unserer wissenschaftlichen Prunk- und Stunksitzung!</p>\n<p>Zunächst ein bisschen was Administratives:</p>\n<p>Wir sind in Dresden und werden am 2. April in einer noch zu benennenden Kneipe ein Bier trinken (Merkt man wie wir das Wort Hörertreffen meiden?). Wer eine Kneipe in Dresden kennt, in der man sich auch ein bisschen unterhalten kann, trägt die Vorschläge bitte in die Kommentare zu dieser Sendung ein.</p>\n<p>In der gleichen Woche wird Reinhard am 3. April beim Einstein-Slam auftreten. Es lohnt sich zu kommen. Es gibt allerdings auch noch diverse andere Möglichkeiten ihn in ganz Deutschland zu sehen. Der einzig sichere Ort vor ihm ist eigentlich nur sein Labor.</p>\n<p>Nicolas spricht auf der <a href=\"http://re-publica.de\">re:publica 14</a> in Berlin (6. bis 8. Mai) zum Thema „Diamonds are a quantum computer’s best friend“.</p>\n<p>Zuschauerfrage: Max hatte eine interessante Frage zu <a href=\"http://de.wikipedia.org/wiki/Absorption_(Physik)#Elektromagnetische_Wellen\">Elektromagnetischen Wellen</a> die wir gerne beantworten.</p>\n<p>„Previously on stem cell research&#8230;“ – Unsere Stammzellen-Soap geht in die nächste Runde. Ein <a href=\"http://www.cdb.riken.jp/jp/04_news/articles/pdf/14/protocol_exchange_v1.pdf\">Versuchsprotokoll</a> wurde von unseren Soap-Darstellern veröffentlicht. Ob es damit klappt die Ergebnisse zu reproduzieren? Wir bleiben dran&#8230;</p>\n<p><span id=\"more-935\"></span></p>\n<p>Thema 1: „Das Ding aus einer anderen Welt“ – Nicolas startet <a href=\"http://www.youtube.com/watch?v=HEQ6FFksUoQ\">reißerisch</a> und bleibt auch im weiteren Verlauf methodisch unsauber und schürrt Angst vor <a href=\"http://www.pnas.org/content/early/2014/02/26/1320670111\">Riesenviren</a> die aus dem sibirischen Eis stammen.</p>\n<p>Thema 2: „Mach mal bunt!“ – Reinhard zeigt einen spannenden Ansatz für neue, bunte <a href=\"http://onlinelibrary.wiley.com/doi/10.1002/ange.201309306/abstract;jsessionid=6BC4F95E239653D356BB9210CFCB6BC7.f04t03\">Farbpigmente</a>. Im Prinzip Nanoschmetterlinge.</p>\n<p>Experiment der Woche: „Bierkanneneffekt“ – Reinhard trinkt mal wieder billiges Dosenbier und saut dabei den ganzen Schreibtisch voll. Reicht seine Feinmotorik nicht für das unfallfreie Einschenken eines Bieres, oder steckt da mehr hinter? Wir gehen dem <a href=\"http://de.wikipedia.org/wiki/Teekanneneffekt\">Teekanneneffekt</a> auf den Grund.</p>\n<p>Musikvideo: „<a href=\"http://www.youtube.com/watch?v=bmzMmkAekWo\">Don’t stop pipetting!</a>“</p>\n<p>Thema 3: „Don’t feed the trolls!“ – Was sind das eigentlich für Menschen die <a href=\"http://www.sciencedirect.com/science/article/pii/S0191886914000324?via=ihub\">im Internet trollen</a>? Kurze knappen Antwort: Sadisten!</p>\n<p>Thema 4: „Berufsrisiko: schnelles Altern“ – Reinhard ärgert mal wieder den Hypochonder Nicolas und garantiert damit, dass Kontrollbesuche im Labor auf ein Minimum reduziert werden. Nanopartikel machen <a href=\"http://pubs.acs.org/doi/abs/10.1021/nn403443r\">alt und gebrechlich!</a></p>\n<p>Thema &#8220;Math up your life! oder Mathematik der Hunger Games“ – Dank Hörer Tobias sind wir auf die sehr interessante Rubrik „<a href=\"http://blog.zeit.de/mathe/wahrscheinlichkeitsrechnung/ist-darwins-evolutionstheorie-falsch/#comments\">Math up you life!</a>“ von Christian Hesse auf Zeit-online aufmerksam geworden. Wir stellen Euch eine mathematische Spielerei von Christian in unseren eigenen Worten vor: Was ist die richtige Strategie bei den Hunger-Games? „Let the odds be ever in your favor!“</p>\n<p>Rausschmeißer: „<a href=\"http://www.youtube.com/watch?v=oHg5SJYRHA0&list=RDoHg5SJYRHA0 - t=6\">The best science song ever!</a>“</p>\n<p>Du möchtest mehr über unsere Werbepartner erfahren? <a href=\"https://linktr.ee/methodischinkorrekt\"><strong>Hier findest du alle Infos & Rabatte</strong></a></p>",
  "itunes:image": "",
  "itunes:episode": 24,
  "itunes:episodeType": "full",
  "itunes:subtitle": "„Bierkanneneffekt“ direkt von der Prunksitzung der Wissenschaften.",
  "itunes:summary": "Heute mit Riesenviren, Nanoschmetterlinge, sadistischen Trollen und gefährlichen Nanopartikeln. Experiment der Woche: \"Bierkanneneffekt\".\n\nDu möchtest mehr über unsere Werbepartner erfahren? Hier findest du alle Infos & Rabatte: https://linktr.ee/methodischinkorrekt",
  "itunes:explicit": "no",
  "itunes:keywords": "",
  "itunes:author": "Methodisch inkorrekt!",
  "enclosure": "",
  "itunes:duration": 8297
}