{
  "title": "Part 2: Entering the Wilderness",
  "pubDate": "Fri, 27 Sep 2013 02:34:19 +0000",
  "guid": "d526e9a9a850c011d1a938fe3a33796f",
  "link": "https://tarabrach.libsyn.com/part-2-entering-the-wilderness",
  "itunes:image": "",
  "description": "<p>2013-09-25 - Part 2: Entering the Wilderness - On all spiritual paths, we journey into the inner wilderness to discover the nature of nature - the truth of who we are. The entry is through bringing a kind and full presence to the life of our bodies. These two talks explore the conditioning that leads us to dissociation, and the blessings of full aliveness, open heartedness and wisdom that arise when we come home to embodied presence.<br /> <br /> Please support this podcast by donating at <a href=\"http://www.tarabrach.com/donate.html\">www.tarabrach.com</a> or <a href=\"http://imcw.org/Giving.aspx\">www.imcw.org</a>. Your donations allow us to continue to freely offer the teachings!</p>",
  "content:encoded": "<p>2013-09-25 - Part 2: Entering the Wilderness - On all spiritual paths, we journey into the inner wilderness to discover the nature of nature - the truth of who we are. The entry is through bringing a kind and full presence to the life of our bodies. These two talks explore the conditioning that leads us to dissociation, and the blessings of full aliveness, open heartedness and wisdom that arise when we come home to embodied presence.  Please support this podcast by donating at <a href=\"http://www.tarabrach.com/donate.html\">www.tarabrach.com</a> or <a href=\"http://imcw.org/Giving.aspx\">www.imcw.org</a>. Your donations allow us to continue to freely offer the teachings!</p>",
  "enclosure": "",
  "itunes:duration": "53:48",
  "itunes:explicit": false,
  "itunes:keywords": "love,fear,Meditation,stress,healing,compassion,tara,joy,trauma,forgiveness,grief,kindness,selfacceptance,brach",
  "itunes:subtitle": "2013-09-25 - Part 2: Entering the Wilderness - On all spiritual paths, we journey into the inner wilderness to discover the nature of nature - the truth of who we are. The entry is through bringing a kind and full presence to the life of our bodies...."
}