{
  "id": "https://bibleinoneyear.org/en/youth/356",
  "title": "Day 356: Purity and Power",
  "description": "Proverbs 31:8-9, Ezra 8:21–23, Revelation 14:1–7,11b–13.  The two are connected  As Pastor Rick Warren has tweeted, ‘In ministry, *private purity* is the source of *public power*",
  "pubDate": "Wed, 22 Dec 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/356/?ignore",
  "itunes:duration": "09:34",
  "guid": "enyouth22122021-356",
  "length": 574.88,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 356: Purity and Power",
  "itunes:subtitle": "Proverbs 31:8-9, Ezra 8:21–23, Revelation 14:1–7,11b–13.  The two are connected  As Pastor Rick Warren has tweeted, ‘In ministry, *private purity* is the source of *public power*",
  "itunes:summary": "Christmas at HTB is usually one of the biggest events in our church calendar. This year things have had to be scaled back due to COVID-19 and I’ve missed the excitement, the crowds and grandeur of our carol services. At our Christmas services, I sit right by our orchestra and choir. There are usually around fifty musicians in the orchestra and ninety in the choir – all members of the congregation volunteering their time and gifts. I’m not at all musical. In fact, I’m virtually tone deaf. However, I am always stunned by the beauty of the marvellous music and singing. It is a foretaste of heaven.\nThe apostle John writes, ‘And I heard a sound from heaven like the roar of rushing waters and like a loud peal of thunder. The sound I heard was like that of harpists playing their harps. And they sang a new song before the throne’ (Revelation 14:2–3). The heavenly orchestra and choir will sing a new song before a heavenly audience.\nJohn goes on to describe the completed church in heaven – their purity and their power. The two are connected. As Pastor Rick Warren has tweeted, ‘In ministry, private purity is the source of public power.’",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 356
}