{
  "title": "Programmable Blocks Tease Self-Assembling Space Structures",
  "link": "https://spectrum.ieee.org/self-configurable-electrovoxel",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/martin-nisser-of-mit-csail-tests-two-robotic-cubes-ability-to-pivot-in-microgravity.jpg?id=29513645&width=1500&height=2000&coordinates=415%2C0%2C587%2C0\"/><br/><br/><p><p>\n<em>This article is part of our exclusive <a href=\"https://spectrum.ieee.org/collections/journal-watch/\" rel=\"noopener noreferrer\" target=\"_self\">IEEE Journal Watch series</a> in partnership with IEEE Xplore.</em>\n</p></p><p>Self-assembling and self-reconfiguring robots depicted in films like <em>Transformers</em> are becoming closer to reality, thanks to a team of researchers at MIT’s <a href=\"https://www.csail.mit.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">Computer Science and Artificial Intelligence Laboratory</a> (CSAIL). Scientists at CSAIL have created what they call ElectroVoxels, modular robotic cubes that use embedded electromagnets to move. The accompanying <a href=\"http://groups.csail.mit.edu/hcie/files/research-projects/ElectroVoxel/Nisser_ICRA_22_CamReady_0207.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">paper</a> will be presented at the IEEE International Conference on Robotics and Automation in May.</p><p>“I originally wanted to call them Transformers because they’re essentially robots that can change their shape,” says <a href=\"https://www.csail.mit.edu/person/martin-nisser\" rel=\"noopener noreferrer\" target=\"_blank\">Martin Nisser</a>, a Ph.D. student in the human-computer interaction group at MIT CSAIL and lead author on the paper. Due to copyright reasons, however, the team decided against it and settled on combining the term “electromagnet” with “voxel,” a volumetric pixel that’s the 3D equivalent of a pixel. “You can think of ElectroVoxels as voxels with electromagnets embedded in them,” he says.</p><p>An ElectroVoxel cube indeed has an electromagnet—a ferrite core wrapped with copper wire—embedded into each of its 12 edges. “When you send a current through an electromagnet, the polarization depends on the direction in which you send the current,” Nisser says. “It’s like a permanent magnet, except you can change the polarity depending on the direction of the current.”</p><p>ElectroVoxel blocks move by either pivoting to a block it shares an edge with or traversing the face of one block to another. When a pair of electromagnets in a cube are polarized oppositely, they attract each other, creating a hinge. You can then use another pair of electromagnets polarized in the same direction to repel each other and perform a pivoting maneuver. Once that pivoting is complete, you can use two separate pairs of electromagnets to attract each other and hold the faces of the two cubes together.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img class=\"rm-shortcode\" data-rm-shortcode-id=\"b9f29d886deb0a926f8bdaff3550e79d\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"0461e\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/electrovoxels-are-modular-robotic-cubes-that-use-embedded-electromagnets-to-move.jpg?id=29513646&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">ElectroVoxels are modular robotic cubes that use embedded electromagnets to move.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">MIT CSAIL/Martin Nisser</small></p><p>The blocks are also programmable. “When you have more than two or three ElectroVoxels, it becomes hard to address each electromagnet individually and predict what will happen,” says Nisser. “So we created a user interface that lets you specify which ElectroVoxel should pivot in what direction. Then all the underlying electromagnet assignments are computed for you, and we can put that directly onto the microcontroller.”</p><p>Unlike other self-assembling robots whose hardware consists of bulky motors or expensive actuators, ElectroVoxels promise scalability. They’re light, with each cube weighing 103 grams; cheaper, with each electromagnet costing around US $0.60; and easy to build, with each cube taking about 80 minutes to construct.</p><p>But ElectroVoxels are not without their limitations, and the team took advantage of a particular one as a perfect vehicle for space applications. “One of the drawbacks of ElectroVoxels is that their force is relatively weak compared to other actuators. Yet we also realized that they can be used effectively in space,” Nisser says. “In a microgravity environment, even very low forces can contribute to significant velocities, so a very small force like the ones we have in ElectroVoxels could contribute to moving large objects. We saw this opportunity to explore reconfigurable robots for space applications, where you want to try to change the inertial properties of spacecraft, or to help build temporary structures that can aid in various activities such as structure inspection by astronauts.”</p><p>To verify their theory and establish reconfiguration in space, the team conducted experiments in a microgravity environment. First, they used an air table, a flat table with holes in it and chutes around it to create pillows of air that simulate microgravity conditions. The ElectroVoxels successfully performed pivots and traversals on the air table. Then, the team flew the cubes aboard a <a href=\"https://www.nasa.gov/analogs/parabolic-flight\" rel=\"noopener noreferrer\" target=\"_blank\">parabolic flight</a> to observe pivoting. They encountered some difficulties, but the ElectroVoxels were able to pivot in flight.</p><p>“On a typical flight, an aircraft flies these parabolas about 20 times, and each of the parabolas lasts for around 15 seconds. But the quality of the microgravity inside those parabolas tends to vary a bit,” says Nisser. “What ended up happening is that we only had about 4 seconds of microgravity, so the main challenge was fine-tuning everything to make sure we were as prepared as possible for it to work, because with just 4 seconds, there was no time or capability to update things.”</p><p>While the team has demonstrated the ability of ElectroVoxels for use in space, they hope to do the same in the future for Earth. “We’re looking at trying to optimize ElectroVoxels for torque-to-inertia ratios to be able to pivot against gravity,” Nisser says.</p><p>Another fit-for-Earth application for these reconfigurable robots is recyclable rapid prototyping. “3D printers are typically used to create one-off, low-fidelity prototypes, which aren’t necessarily functional,” says Nisser. “If you can create prototypes with a modular system, then you can create one structure and have it automatically pivot into a second structure, making rapid prototyping more sustainable. You wouldn’t have to discard the plastic after each print—you could just use the same modules to create new structures.”</p>",
  "pubDate": "Fri, 11 Mar 2022 16:00:25 +0000",
  "guid": "https://spectrum.ieee.org/self-configurable-electrovoxel",
  "category": [
    "Aerospace",
    "Robotics",
    "Zero-g",
    "Self-assembly"
  ],
  "dc:creator": "Rina Diane Caballar",
  "media:content": ""
}