{
  "title": "S16 Ep26: Holzer's Ghosts - Ancient Evil: The Haunting of America's Stonehenge",
  "link": "https://audioboom.com/posts/8098385",
  "itunes:episode": 26,
  "itunes:title": "Holzer's Ghosts - Ancient Evil: The Haunting of America's Stonehenge",
  "itunes:season": 16,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5426,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>Darkness Radio presents Holzer's Ghosts - Ancient Evil: The Haunting of America's Stonehenge with guests Alexandra Holzer, Dennis Stone & Scott Wolter. </p>\n\n<p>Lead investigator of the #HolzerFiles Dave Schrader welcomes special guests, investigator and daughter of Hans Holzer, Alexandra Holzer, from America Unearthed; Scott Wolter and owner caretaker of America's Stonehenge, Dennis Stone as they review the past episode and dig deeper into the casefile. </p>\n\n<p>Throughout his storied career, legendary Ghost Hunter Hans Holzer visited Mystery Hill in Salem, New Hampshire, countless times in an attempt to uncover the origin of the hauntings that lie in the strange rock formation. He found that, for centuries, people have encountered a menacing shadow figure roaming the grounds, heard voices and cries of children, and were even physically attacked. </p>\n\n<p>However, despite Holzer's extensive research and repeated visits, he refused to discuss the haunting with his family, preferring to protect them from the seemingly dark truths buried on the site. </p>\n\n<p>Now, Holzer's hidden case file is finally reopened, and his half-century of research continues as paranormal investigator Dave Schrader, psychic medium Cindy Kaza, equipment expert Shane Pittman along with new insights from researcher Gabe Roth and Holzer's own daughter, Alexandra venture into the haunted hilltop of southern New Hampshire and face what Holzer called \"an ancient evil.\" </p>\n\n<p>As they unearth the site's haunted past, they soon discover that they are dealing with more than restless spirits, and see for themselves why Holzer insisted on keeping his family far away from the horrors of Mystery Hill.</p>\n\n<p>Watch new episodes of Holzer Files on #DiscoveryPlus and check local listings for upcoming Holzer Files marathons on #TravelChannel</p>\n",
  "pubDate": "Fri, 05 Mar 2021 09:00:00 +0000",
  "guid": "2f86f16b-a650-4a3d-9fd4-ace20066d4d3",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}