{
  "guid": "prx_137_b365eb88-4918-46fb-9fbb-d87e2005ad06",
  "title": "761 - Coronation Lantern - Sleepin' With Doctor Who S2 E8",
  "pubDate": "Sun, 07 Apr 2019 23:00:00 -0000",
  "link": "https://beta.prx.org/stories/271403",
  "description": "<p>You can find all of our sponsors or become a patron on our new website <a href=\"http://www.sleepwithmepodcast.com/\" rel=\"nofollow\" target=\"_blank\">http://www.sleepwithmepodcast.com</a> story starts at about 18:00)<br>\n<br>\nCheck out “Start With This” in your podcast app or at <a href=\"http://www.nightvalepresents.com/startwiththis\" rel=\"nofollow\" target=\"_blank\">http://www.nightvalepresents.com/startwiththis</a>“Start With This” is a podcast gone creativity playground designed to put your ideas in motion, from the creators of “Welcome to Night Vale”, Joseph Fink and Jeffrey Cranor.<br>\n<br>\nTonight’s show is sponsored by Quip! The sensitive sonic toothbrush I have been using for over two years (not over and over! Changing out the brush heads every three months!) Quip starts at just $25 and if you go to <a href=\"http://www.getquip.com/sleep\" rel=\"nofollow\" target=\"_blank\">http://www.getquip.com/sleep</a>, you get your first refill pack for FREE with a quip electric toothbrush.<br>\n<br>\nWelcome our newest sponsor Robinhood - an investing app that lets you buy and sell stocks, E-T-F’s (exchange-traded funds), options, and cryptos- all commission-free. They strive to make financial services work for everyone, not just the wealthy.<br>\nRobinhood is giving listeners a FREE stock like Apple, Ford or Sprint to help build your portfolio. Sign up at <a href=\"http://www.sleep.robinhood.com/\" rel=\"nofollow\" target=\"_blank\">http://www.sleep.robinhood.com</a>!<br>\n<br>\nTonight’s episode is sponsored by Brooklinen, luxury bedding, at amazing prices. You have to try these sheets today! There is an exclusive offer just for Sleep With Me listeners.<br>\nGet $20 off AND free shipping when you use promo code [WITHME] at <a href=\"http://www.brooklinen.com/\" rel=\"nofollow\" target=\"_blank\">http://www.brooklinen.com</a>.<br>\n<br>\nBrooklinen is SO confident that they offer **a risk-free 60-night satisfaction guarantee and a lifetime warranty on all of their sheets and comforters! **</p>",
  "enclosure": "",
  "itunes:title": "Coronation Lantern - Sleepin' With Doctor Who S2 E8",
  "itunes:subtitle": "Gather round for a long meandering parade with a sleepy celebration.",
  "itunes:episodeType": "full",
  "itunes:episode": 761,
  "itunes:duration": "01:07:29"
}