{
  "id": "https://bibleinoneyear.org/en/youth/161",
  "title": "Day 161: Troubles Do Not Have the Last Word",
  "description": "Psalm 71:19c–21, 2 Samuel 15:13–14,23,30, 16:14, Acts 6:8–10, 7:9–10a.  Jesus faced trouble and so did the apostles, David and all the people of God  However, as Matheson’s hymn beautifully articulates, *troubles do not have the last word*",
  "pubDate": "Thu, 10 Jun 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/161/?ignore",
  "itunes:duration": "15:21",
  "guid": "enyouth10062021-161",
  "length": 921.6,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 161: Troubles Do Not Have the Last Word",
  "itunes:subtitle": "Psalm 71:19c–21, 2 Samuel 15:13–14,23,30, 16:14, Acts 6:8–10, 7:9–10a.  Jesus faced trouble and so did the apostles, David and all the people of God  However, as Matheson’s hymn beautifully articulates, *troubles do not have the last word*",
  "itunes:summary": "George Matheson was born in Glasgow, the eldest of eight children. He had only partial vision as a boy. By the age of twenty he was completely blind. When his fiancée learnt he was going blind and that there was nothing the doctors could do, she told him she could not go through life with a blind man. He never married.\nHe was helped by a devoted sister throughout his ministry. She learnt Greek, Latin and Hebrew in order to aid him in his studies. Despite his blindness, Matheson had a brilliant career at the Glasgow Academy, University of Glasgow and the Church of Scotland Seminary.\nWhen he was forty years old, something bittersweet happened. His sister married. Not only did this mean that he lost her companionship, it also brought a fresh reminder of his own heartbreak. In the midst of this intense sadness, on the eve of his sister’s marriage, he wrote one of the most popular and best loved hymns of the Christian church – ‘O Love That Wilt Not Let Me Go’. He completed the whole work in five minutes and never edited, corrected or retouched it. ‘This came,’ he wrote, ‘like a dayspring from on high.’\nO Joy that seekest me through pain,\nI cannot close my heart to thee;\nI trace the rainbow through the rain,\nAnd feel the promise is not vain,\nThat morn shall tearless be.\nTroubles are part of life. Jesus faced trouble and so did the apostles, David and all the people of God. However, as Matheson’s hymn beautifully articulates, troubles do not have the last word.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 161
}