{
  "id": "yt:video:1PN2I_6DoAI",
  "yt:videoId": "1PN2I_6DoAI",
  "yt:channelId": "UCbmNph6atAoGfqLoCL_duAg",
  "title": "Christina Ho | Be Bold & Fly with Passion | Talks at Google",
  "link": "",
  "author": {
    "name": "Talks at Google",
    "uri": "https://www.youtube.com/channel/UCbmNph6atAoGfqLoCL_duAg"
  },
  "published": "2022-10-01T16:00:01+00:00",
  "updated": "2022-10-04T16:32:45+00:00",
  "media:group": {
    "media:title": "Christina Ho | Be Bold & Fly with Passion | Talks at Google",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Christina Ho (何紫婷) discusses her journey from fine arts graduate and cabin crew member to  becoming a pilot. Her story inspires and reminds us to stay curious and dare to try.\n\nChristina Ho is currently an airline pilot at one of the world’s leading airlines based in Hong Kong and one of the few female pilots in the industry. Before becoming a pilot, she was a fine arts graduate and former cabin crew member without an engineering background or flying experience. She discovered her passion in aviation and decided to sign up for the cadet pilot program after seeing pilots in action at the cockpit jumpseats. As of today, she has accumulated 4 years of flying experience. Her dedication and confidence in flying further developed after she calmly managed an emergency situation during her solo flight training. She described her journey as “intensive and challenging yet rewarding.” \n\nShe is passionate in empowering and inspiring youth and women to pursue their dreams, using her story of turning impossible to possible through learning with passion and courage. Christina is an avid volunteer and works with the Hong Kong Youth Aviation Academy as an instructor,  at Female Pilot Advisory Group, and the Peer Assistant Network (PAN) within her company. She and her colleagues at the Female Pilot Advisory Group successfully advocated for updating the operation menu by aircraft manufacturers, Boeing and Airbus, from \"He should\" to \"Pilot should,\" which is the first step toward eliminating stereotypes.\n\nOutside of aviation, she continues to create – creating the #christtina_meow character and launching a series called #LifeLessonsFromTheSky (#天空教會我的事) with motivation quotes – and promote positive thinking. In her own words, “Everyone has roles and responsibilities to make our society a better place, whether you are at work, at home or in the community.”\n\nModerated by Ada Au.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}