{
  "id": "yt:video:2bvO2gdTBac",
  "yt:videoId": "2bvO2gdTBac",
  "yt:channelId": "UCccafaIN6dwBwyl1cwNH90w",
  "title": "The Entropic Brain Hypothesis of How Psychedelics Work EXPLAINED | Dr. Robin Carhart-Harris's Theory",
  "link": "",
  "author": {
    "name": "The Psychedelic Scientist",
    "uri": "https://www.youtube.com/channel/UCccafaIN6dwBwyl1cwNH90w"
  },
  "published": "2020-12-11T21:07:10+00:00",
  "updated": "2022-08-19T06:01:24+00:00",
  "media:group": {
    "media:title": "The Entropic Brain Hypothesis of How Psychedelics Work EXPLAINED | Dr. Robin Carhart-Harris's Theory",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "In this video, I go over The Entropic Brain Hypothesis of how psychedelic drugs affect the brain and mind. \n\nThis theory was originally proposed by leading psychedelic neuroscientist Dr. Robin Carhart-Harris in his 2014 paper, available at: https://www.frontiersin.org/articles/10.3389/fnhum.2014.00020/full\n\nAs always, I do my best to present the ideas in a way that anyone can understand, whether they have a scientific background or not!\n\nThis video is also preparation for my deep dive into Dr. Carhart-Harris's more recent theory, which integrates these ideas into a larger framework. This framework is called the RElaxed Beliefs under pSychedelics (REBUS) model. Look for a video on that in the near future!\n\n---\n\nThe amazing editing in this video was done by Anthony Liscio of http://havencreative.studio/, and sponsored by Mindleap Health.\n\n---\n\nMindleap Health is a mental health platform for psychedelic integration. They provide easy access to mental health specialists (via your smartphone) to help you get the most out of your psychedelic trip. Check them out! https://mindleap.health/\n\n---\n\nMy t-shirt is from The Flying Sage - go check them out as well for some awesome psychedelic apparel! https://theflyingsage.ca/\n\n---\n\nDon't forget to follow me on social media for all the latest updates. Especially Instagram where I post the most!\n\nInstagram\nhttps://www.instagram.com/thepsychedelicscientist \n\nTwitter\nhttps://twitter.com/ThePsychedSci\n\nFacebook\nhttps://www.facebook.com/The-Psychedelic-Scientist-113887593677455 \n\nMore info about me:\n\nManesh Girn is a Neuroscience PhD student at McGill University and has been lead or co-author on over a dozen scientific publications and book chapters on topics including psychedelics, meditation, daydreaming, and brain networks. \n\nManesh currently has ongoing collaborations with Robin Carhart-Harris and others at the Imperial College Center for Psychedelic Research and is investigating the brain changes underlying psilocybin, LSD, and DMT.\n\nhttps://twitter.com/MGirnNeuro\nhttps://www.researchgate.net/profile/Manesh_Girn",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}