{
  "id": "https://bibleinoneyear.org/en/youth/357",
  "title": "Day 357: How to Live in Hope",
  "description": "Psalm 146:3–9, Ezra 10:1,2b–3a, Revelation 14:14–16, 15:1–4.  I doubt we really ever will  One day we’ll know… These are the foundational principles of living in hope",
  "pubDate": "Thu, 23 Dec 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/357/?ignore",
  "itunes:duration": "09:49",
  "guid": "enyouth23122021-357",
  "length": 589.98,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 357: How to Live in Hope",
  "itunes:subtitle": "Psalm 146:3–9, Ezra 10:1,2b–3a, Revelation 14:14–16, 15:1–4.  I doubt we really ever will  One day we’ll know… These are the foundational principles of living in hope",
  "itunes:summary": "In July 1999, Ralph Crathorne spoke at our church about the recent death of his eight-year-old daughter, Sasha, from a brain tumour.\nI remember so well going to visit Sasha in hospital. On the way, in the taxi, I was desperately trying to think and pray about what God would want me to say. Only one word came into my mind: hope.\nIn his talk Ralph said, ‘That one word exploded in my spirit. It was as though I suddenly saw the fullness of what God has meant us to understand about “living in hope”. It’s not the kind of wishy-washy, “I hope this will happen, but it probably won’t happen.” It’s the sure, confident, positive hope – the way God designed us to live.\n‘Our hope was placed not in an outcome but in the Lord.\n‘Sasha, too, held onto hope – not necessarily to be healed, although that was included, but a deeper hope, the hope that comes from the certainty of being in the palm of the hand of an all-loving God.’\nIn the final two weeks of her life, she went blind. Ralph said, ‘I remember lying in the bed saying to her, “Sasha do you ever see angels?”\n‘She didn’t have much energy to speak. She said, “No dad.”\n‘I was a bit disappointed. So, I thought, we’ll go for the big one. “Do you ever see Jesus?” I asked.\n‘“Of course, I do. He holds my hand.”’\n‘The dream that she would be healed was shattered, but we’re not disappointed with God. He hasn’t changed. He still pours his love into our hearts. We don’t understand her death. I doubt we really ever will. One day we’ll know… These are the foundational principles of living in hope.”",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 357
}