{
  "title": "50 Forward: An evening with the SPLC looks ahead to the next half century",
  "link": "https://www.splcenter.org/news/2022/10/21/50-forward-evening-splc-looks-ahead-next-half-century",
  "description": "<div class=\"field field-name-field-story-type field-type-list-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \">Features and Stories</div>\n      </div>\n</div>\n<div class=\"field field-name-field-image field-type-image field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"></div>\n      </div>\n</div>\n<div class=\"field field-name-title-field field-type-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><h1>50 Forward: An evening with the SPLC looks ahead to the next half century</h1>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><p>The Southern Poverty Law Center commemorated its <a href=\"https://www.splcenter.org/50-forward-live\">51<sup>st</sup> anniversary tonight</a> at a celebration that recalled its singular, historic achievements as one of the country’s most prominent civil rights organizations.</p>\n<div data-embed-button=\"media\" data-entity-id=\"35264\" data-entity-label=\"Media\" data-entity-type=\"file\" data-entity-uuid=\"e7ace6a2-a3fd-4055-9504-3b28a93ff46a\" data-splc-media-url=\"\" data-view-mode=\"full\" class=\"align-right\">\n<div id=\"file-35264\" class=\"file file-image file-image-jpeg\">\n<h2 class=\"element-invisible\"><a href=\"/files/web50forwardinline1jpg\"></a></h2>\n<div class=\"content\">\n    <img src=\"https://www.splcenter.org/sites/default/files/web_50forward_inline1.jpg\" width=\"1200\" height=\"900\" alt=\"Event crowd\" title=\"splc-50-forward\" /><br />\n<div class=\"field field-name-field-file-caption field-type-text-long field-label-hidden\">\n<div class=\"field-items\">\n<div class=\"field-item even \">50 Forward attendees included Lecia Brooks, Karol V. Mason, Joseph J. Levin Jr., Tafeni English and Seth Levi. (Credit: Mhandy Gerard/SPLC)</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<p>SPLC President and CEO Margaret Huang laid out the vision for the organization’s next 50 years by sharing the SPLC’s new vision for racial justice in the South. This vision recognizes that activists and freedom fighters in the South have demonstrated courage and resilience, and we will continue to support the movement for justice despite the challenges we face today.</p>\n<p>The event, <em>50 Forward: An Evening with the SPLC</em>, held at Atlanta’s <a href=\"https://novareevents.com/foundry-at-puritan-mill/\">Foundry at Puritan Mill</a>, brought SPLC senior leaders together with the organization’s partners, including <a href=\"https://www.splcenter.org/vote-your-voice\">Vote Your Voice</a> grant recipients, community allies and SPLC supporters. Members of the audience included Georgia state representatives David Wilkerson and William Boddie, whom Huang recognized from the podium.</p>\n<p>Karol V. Mason, the SPLC board vice chair, said at the beginning of the event, “The name of tonight’s event is 50 Forward, and a major purpose of our gathering is to learn about the course that the SPLC will be charting into the future. I know how proud the SPLC community is of the numerous victories achieved during the organization’s first 50 years. But I also know that so much work remains to be done — and that we will not be satisfied until our ‘vision for a just future’ becomes a reality.”</p>\n<p>The SPLC, Huang said, will focus on key issues including fighting hate and extremism, promoting democracy and civil rights, and pursuing legal, immigrant and economic justice on behalf of Black and Brown communities.</p>\n<p>To highlight the work of these partners and give the audience an understanding of how the SPLC collaborates with them, during panel discussions partner representatives discussed efforts to promote democracy and counter the effects of hate and extremism on immigration policy.</p>\n<p>“Our overarching vision is to have a significant impact on the issues affecting the communities we seek to serve in our Southern states,” Huang said. “We will never accomplish this work alone – it will take the entire movement working together.”</p>\n<h2>Investing in communities</h2>\n<p>In its largest, most direct community investment, the SPLC will move its metro Atlanta office to a historically Black community. While the location of a newly constructed office building has not yet been determined, it will have spaces and programming for the benefit of the area residents, activists and allies, according to SPLC Chief Strategy Officer Seth Levi, who discussed the move in a separate conversation before tonight’s event.</p>\n<p>“We’re trying to rethink how we use our office spaces, exploring how they can be a tool to achieve our strategic framework,” Levi said. “An office building can be so much more than a place where staff come in to work at their computers and meet in conference rooms. We’re trying to imagine all of the ways in which our property spaces can be used to directly impact the communities we serve.”</p>\n<p>The building may also include commercial spaces designed to help create jobs and build wealth, such as discounted retail rental space for Black and Brown entrepreneurs in their first years in business, when receipts are typically low. The SPLC is also exploring ways to make a local investment in affordable housing.</p>\n<p>Huang explained how the redevelopment aligns with the SPLC’s new strategic framework.</p>\n<p>“We view these investments in communities as opportunities that will make economic improvement in people’s lives. … We think it’s time to start using our resources and our capacity to do that,” she said in another conversation before tonight’s event.</p>\n<p>The SPLC’s direction for the future will be visible in another way.</p>\n<h2>Rebranding the SPLC</h2>\n<div data-embed-button=\"media\" data-entity-id=\"35265\" data-entity-label=\"Media\" data-entity-type=\"file\" data-entity-uuid=\"02b38f41-7c62-4267-b2b6-afa44c36ae23\" data-splc-media-url=\"\" data-view-mode=\"full\" class=\"align-right\">\n<div id=\"file-35265\" class=\"file file-image file-image-jpeg\">\n<h2 class=\"element-invisible\"><a href=\"/files/splcrebrandpostersjpg\"></a></h2>\n<div class=\"content\">\n    <img src=\"https://www.splcenter.org/sites/default/files/splc_rebrand_posters.jpg\" width=\"3375\" height=\"2250\" alt=\"SPLC brand\" title=\"splc-brand\" /><br />\n<div class=\"field field-name-field-file-caption field-type-text-long field-label-hidden\">\n<div class=\"field-items\">\n<div class=\"field-item even \">During the 50 Forward event, SPLC President and CEO Margaret Huang unveiled the organization&#039;s new logo.</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<p>At tonight’s event, Huang introduced the SPLC’s rebranding and logo, which will become the new symbol of the SPLC’s vision of a more inclusive, holistic organization and a reflection of the multifaceted nature of its work.</p>\n<p>The individual SPLC letters of the logo <em>are</em> the logo and were designed to evoke both historic and modern sensibilities. The letters are punctuated with a vertically centered dot, known as an interpunct. The new design also was driven in part by the emergence of the New South, which has seen growing diversification, and now has the <a href=\"https://williamsinstitute.law.ucla.edu/lgbtdivide/#/ethnicity\" target=\"_blank\">highest LGBTQ+ population</a> in the country.</p>\n<p>The full set of rebranding imagery will appear anywhere that the SPLC logo appears: on the forthcoming new SPLC website, stationery, in email signature lines, on social media, business cards, branded T-shirts, tote bags, posters, stickers and Learning for Justice materials.</p>\n<p>The challenges of the future and the triumphs and struggles of the past are also reflected at the SPLC’s <a href=\"https://www.splcenter.org/civil-rights-memorial\">Civil Rights Memorial Center</a> (CRMC), which announced how it plans to further its mission of educating and connecting communities.</p>\n<h2>Connecting through technology</h2>\n<div data-embed-button=\"media\" data-entity-id=\"35261\" data-entity-label=\"Media\" data-entity-type=\"file\" data-entity-uuid=\"a4a08630-5f39-40f9-afcc-44e03778d37b\" data-splc-media-url=\"\" data-view-mode=\"full\" class=\"align-right\">\n<div id=\"file-35261\" class=\"file file-image file-image-jpeg\">\n<h2 class=\"element-invisible\"><a href=\"/files/webcrmc-appinline-promo1044jpg\"></a></h2>\n<div class=\"content\">\n    <img src=\"https://www.splcenter.org/sites/default/files/web_crmc-app_inline-promo_1044.jpg\" width=\"1044\" height=\"773\" alt=\"CRMC app on mobile devices\" title=\"crmc-app-display\" /><br />\n<div class=\"field field-name-field-file-caption field-type-text-long field-label-hidden\">\n<div class=\"field-items\">\n<div class=\"field-item even \">During the SPLC&#039;s 50 Forward event, the Civil Rights Memorial Center unveiled its new mobile app, which will feature virtual tours of the Center and a condensed version of the film Apathy Is Not an Option.</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<p>The CRMC has launched a mobile phone app, which CRMC Director Tafeni English introduced to the audience tonight. The app will enable students and others who cannot visit the CRMC in person to tour galleries virtually and learn about the modern civil rights movement.</p>\n<p>Imploring audience members to pull out their phones at tonight’s event, English said, “You can download the Civil Rights Memorial Center app, and we don’t want you to just download it and keep it to yourself. We want you to share it. Share it with your family. Share it with educators. Share it with activists. … Whether they’re doing it virtually or in person, we hope to impart this message into each of our visitors: We are still marching, and we still have a long way to go.”</p>\n<p>The CRMC, a project of the SPLC, is a cultural institution for racial justice and is now the first museum in Montgomery to employ an app. English first conceived of adding the app to the <a href=\"https://www.splcenter.org/what-we-do/civil-rights-memorial/experience\">museum’s experience</a> before the COVID-19 pandemic struck, but the idea gained steam in 2020 when museums, including the CRMC, closed and struggled to stay relevant when programming became virtual.</p>\n<p>“The app increases our visibility [in areas] where we know the pandemic has impacted schools’ ability to take field trips,” English said. “We aren’t seeing as many visitors as before the pandemic. Those who engage with the app will have the opportunity to learn about the SPLC’s current work.”</p>\n<p>The app can be downloaded free from the <a href=\"https://apps.apple.com/us/app/civil-rights-memorial-center/id1644410341\">Apple Store</a> or <a href=\"https://play.google.com/store/apps/details?id=com.mytoursapp.android.app6113\">Google Play</a>.</p>\n<p>The announcement of the app wasn’t the only instance of recognizing the importance of the past and its impact on the future.</p>\n<h2>Looking back and ahead</h2>\n<div data-embed-button=\"media\" data-entity-id=\"35262\" data-entity-label=\"Media\" data-entity-type=\"file\" data-entity-uuid=\"92cbf6df-2da9-4e74-8574-18bb7b4c4879\" data-splc-media-url=\"\" data-view-mode=\"full\" class=\"align-right\">\n<div id=\"file-35262\" class=\"file file-image file-image-jpeg\">\n<h2 class=\"element-invisible\"><a href=\"/files/50forward-eventrecap-3jpg\"></a></h2>\n<div class=\"content\">\n    <img src=\"https://www.splcenter.org/sites/default/files/50forward-eventrecap-_3.jpg\" width=\"1200\" height=\"900\" alt=\"Lecia Brooks\" title=\"lecia-brooks-splc-50forward\" /><br />\n<div class=\"field field-name-field-file-caption field-type-text-long field-label-hidden\">\n<div class=\"field-items\">\n<div class=\"field-item even \">Lecia Brooks, the SPLC&#039;s chief of staff and culture, reflects on the organization&#039;s history during her remarks at the 50 Forward event in Atlanta. (Credit: Mhandy Gerard/SPLC)</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<p>SPLC co-founder Joe Levin and Lecia Brooks, chief of staff and culture, who joined the SPLC in 2004, described the beginnings of the organization and its evolution over the past 51 years to the present.</p>\n<p>Levin recalled the founders’ inspiration to establish the SPLC by “witnessing the cruelty of institutional racial injustice and the violence of vigilante groups, particularly the Ku Klux Klan.”</p>\n<p>Tonight, Levin declared, “Our fragile, imperfect democracy is in crisis.” He cited the normalization of white supremacy, the spread of the “great replacement” conspiracy theory, the Jan. 6, 2021, insurrection at the U.S. Capitol, and the rise in hate crimes against racial, religious, ethnic and LGBTQ+ communities. Still, he said, the SPLC of today is up to its task.</p>\n<p>“It is reassuring and empowering to know that we are not the same SPLC that we were in the 20th century. We’ve transformed into an organization that is prepared to meet the South’s new challenges. … I could not be more impressed with the outstanding leadership of Margaret Huang, with our diverse and engaged board and with our unrelenting and brilliant staff. This event is a remarkable way to pass the torch to a new generation of Southern Poverty Law Center leadership. The visionary strategy presented today is proof that the future of the SPLC is in excellent hands.”</p>\n<p>Brooks said she has seen the growing depth and breadth of the good work of the SPLC. She recalled just some of that growth: the opening of the CRMC in 2005, where she was founding director; the establishment of the Immigrant Justice Project, also in 2005; the opening of regional offices; the transformation of the original “Klanwatch” into <a href=\"https://www.splcenter.org/hatewatch/\">Hatewatch</a>; and some of the seminal legal cases that the SPLC won, such as <a href=\"https://www.splcenter.org/news/2015/07/14/20-million-settlement-agreement-reached-labor-trafficking-cases-coordinated-splc-behalf\"><em>David v. Signal International</em></a>, a labor trafficking case decided in 2015. Brooks noted that when she arrived at the SPLC, there were about 100 employees. Today there are about 450.</p>\n<p>Huang summed up the powerful arc of the SPLC’s past and future.</p>\n<p>“The SPLC has been doing incredible work for 50 years,” she said. “I wanted to celebrate that. We’ve had successes in litigation, but the problems are just as compelling and just as urgent for us to tackle as ever before. ... The SPLC is still going strong, but we recognize how much work we still have ahead of us.”</p>\n<p>Concluding her remarks to the audience, Huang said, “Change is possible. A better future for the South is on the horizon. A future of justice, of inclusion, of multiracial democracy. And I know we can achieve it together.”</p>\n<p><em>Picture at top: SPLC President and CEO Margaret Huang speaks during the organization’s 50 Forward event in Atlanta. (Credit: Mhandy Gerard/SPLC)</em></p>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-person field-type-entityreference field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><article id=\"node-16901\" class=\"node node-person node-teaser node-even\">\n\n  \n  <div class=\"content\">\n    <div class=\"group-text-field-group\"><div class=\"field field-name-title-field field-type-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><a href=\"/about/staff/rhonda-sonnenberg\">Rhonda Sonnenberg</a></div>\n      </div>\n</div>\n<div class=\"field field-name-field-person-title field-type-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \">Senior Staff Writer</div>\n      </div>\n</div>\n</div>  </div> <!-- /content -->\n\n  \n      <div class=\"links\">\n          </div> <!-- /links -->\n  \n  </article> <!-- /article #node --></div>\n      </div>\n</div>\n<div class=\"field field-name-field-addthis field-type-addthis field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><div class=\"addthis_toolbox addthis_default_style  \" addthis:title=\"50 Forward: An evening with the SPLC looks ahead to the next half century - Southern Poverty Law Center\" addthis:url=\"https://www.splcenter.org/news/2022/10/21/50-forward-evening-splc-looks-ahead-next-half-century\"><a href=\" \" class=\"addthis_button_facebook\" aria-label=\"Facebook: Share this page\"></a>\n<a href=\" \" class=\"addthis_button_twitter\" aria-label=\"Twitter: Share this page\"></a>\n</div>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-publish-date field-type-date field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><span class=\"date-display-single\">October 21, 2022</span></div>\n      </div>\n</div>",
  "pubDate": "Sat, 22 Oct 2022 01:52:20 +0000",
  "dc:creator": "rudy.isaza_2663",
  "guid": "17198 at https://www.splcenter.org"
}