{
  "title": "Extreme Politicians Want to Ban Abortion. We Can Stop Them.",
  "link": "https://www.aclu.org/news/reproductive-freedom/extreme-politicians-want-to-ban-abortion-we-can-stop-them",
  "pubDate": "Fri, 04 Nov 2022 16:46:16 +0000",
  "dc:creator": "Carolyn Ehrlich",
  "category": [
    "Reproductive Freedom",
    "Abortion",
    "State Abortion Legislation",
    "Federal Abortion Legislation"
  ],
  "guid": "https://www.aclu.org/news/reproductive-freedom/extreme-politicians-want-to-ban-abortion-we-can-stop-them",
  "description": "<p>Everything is on the line next week. From Congress to down-ballot races and a record-breaking number of abortion measures on the ballot, we have an unprecedented opportunity to send a clear message to out-of-step politicians that we won’t let them take away our right to abortion. Given the Supreme Court’s decision to overturn <i>Roe v. Wade</i>, a federal right we have relied on for 50 years, we must send a clear message by voting for candidates and on measures that reflect our values.</p>\n<p>This is an historic year for abortion measures on the ballot. In August, Kansas voters resoundingly defeated a ballot measure that would have paved the way for extreme politicians to ban abortion in the state. More abortion measures are on the ballot next week in several states, including in Michigan and Kentucky where measures would significantly alter state constitutional protections for abortion.</p>\n<p>We need everyone who believes in the right to abortion and reproductive freedom more broadly to make a plan to vote, ensure your friends and family understand <a href=\"https://www.aclu.org/vote-your-values\">what’s at stake</a> in the upcoming election, and even if you have just one hour to spare, <strong>lend your time to critical campaigns</strong> to encourage people to vote their values in the final days of the election. In particular, you can sign up to volunteer on our friends’ Mobilize pages, <a href=\"https://www.mobilize.us/mireprofreedom/\">Reproductive Freedom for All in Michigan</a> and <a href=\"https://www.mobilize.us/mobilize/event/477383/\">Protect Kentucky Access</a>, to make a difference in the outcome.</p>\n  <div class=\"alignfullwidth mb-md wp-pullquote \">\n    <div class=\" wp-pullquote-inner\">\n      <p>Given the Supreme Court’s decision to overturn <i>Roe v. Wade</i>, a federal right we have relied on for 50 years, we must send a clear message by voting for candidates and on measures that reflect our values.</p>\n      \n          </div>\n  </div>\n\t<div class=\"wp-heading mb-md\">\n\t\t\t\t\t<hr class=\"mark\" />\n\t\t\n\t\t\t\t\t<h2 id=\"\" class=\"wp-heading-h2 with-mark\">Yes on Michigan Proposal 3</h2>\n\t\t\n\t\t\t</div>\n<p>We couldn’t be more enthusiastic about Proposal 3 in Michigan, spearheaded by the Reproductive Freedom for All campaign. This first-of-its-kind, citizen-led ballot measure would cement the right to reproductive freedom in the state constitution. It has seen overwhelming support in Michigan, from the historic number of signatures submitted to qualify for the ballot to the outpouring of volunteers and grassroots contributions. And the stakes couldn’t be higher for Michiganders, with a 1931 abortion ban threatening to eliminate care entirely in the state and put doctors in jail for serving their patients. The Michigan measure, championed by Reproductive Freedom for All, would not only secure the right to abortion in the state and block the arcane 1931 abortion ban, it would also ensure protections for birth control and for safe and respectful care during childbirth and protect people from punishment for having a miscarriage, stillbirth, or abortion.</p>\n<p>But the impact won’t stop there. Folks from all over the country are supporting this campaign because if we win, we will have a tested path to securing our fundamental right to reproductive freedom in more states with gerrymandered legislatures. In other words, we believe that when we appeal directly to voters, the majority of whom <a href=\"https://www.wsj.com/articles/support-for-legalized-abortion-grows-since-dobbs-ruling-wsj-poll-shows-11662210020\">support</a> the right to abortion and abortion access, we can win and protect access in states where citizens have the ability to pass ballot measures. That’s why at the ACLU, we have donated nearly $5 million to this campaign and involved our whole organization in supporting the Reproductive Freedom for All ballot committee.</p>\n<p>Unfortunately, opponents in Michigan have used every trick in the book to confuse voters and spread misinformation about Proposal 3, even using trans youth as pawns in their cruel crusade to ban abortion. This race may come down to just a few votes, a testament to the extraordinary momentum this campaign has built despite anti-abortion deception and a stark reminder that we must all do everything we can to push it across the finish line. Sign up to volunteer with the Reproductive Freedom for All ballot committee on their <a href=\"https://www.mobilize.us/mireprofreedom/\">Mobilize page</a>.</p>\n\n  <div class=\"wp-sizing-container sizing--wide\">\n      <figure class=\"wp-image mb-md\">\n\t\t  <img width=\"1110\" height=\"740\" src=\"https://www.aclu.org/wp-content/uploads/2022/11/ABORTION_BALLOT-Blog-V2B.jpg\" class=\"attachment-original size-original\" alt=\"A woman pointing to her t-shirt reading &quot;Roe Roe Roe Your Vote&quot; at an early voting polling site in New York City.\" loading=\"lazy\" srcset=\"https://www.aclu.org/wp-content/uploads/2022/11/ABORTION_BALLOT-Blog-V2B.jpg 1110w, https://www.aclu.org/wp-content/uploads/2022/11/ABORTION_BALLOT-Blog-V2B-768x512.jpg 768w, https://www.aclu.org/wp-content/uploads/2022/11/ABORTION_BALLOT-Blog-V2B-400x267.jpg 400w, https://www.aclu.org/wp-content/uploads/2022/11/ABORTION_BALLOT-Blog-V2B-600x400.jpg 600w, https://www.aclu.org/wp-content/uploads/2022/11/ABORTION_BALLOT-Blog-V2B-800x533.jpg 800w, https://www.aclu.org/wp-content/uploads/2022/11/ABORTION_BALLOT-Blog-V2B-1000x667.jpg 1000w\" sizes=\"(max-width: 1110px) 100vw, 1110px\" />\t\n\t\t  <figcaption class=\"wp-image__caption is-caption mt-xs\"><p>A voter pointing out her position on abortion rights at an early voting polling site in New York City.</p>\n</figcaption>\n\t\n\t\t  <span class=\"wp-image__credit is-credit\"><p>AP Photo/Ted Shaffrey</p>\n</span>\n\t  </figure>\n  </div>\n\t<div class=\"wp-heading mb-md\">\n\t\t\t\t\t<hr class=\"mark\" />\n\t\t\n\t\t\t\t\t<h2 id=\"\" class=\"wp-heading-h2 with-mark\">No on Kentucky Amendment 2</h2>\n\t\t\n\t\t\t</div>\n<p>In Kentucky, voters face an anti-abortion ballot measure that is similar to the one Kansans rejected in August. This measure would make it impossible for state courts to strike down a total abortion ban on the books that has pushed care out of reach in the commonwealth for months, forcing countless Kentuckians to carry pregnancies against their will and suffer the life-altering, and life-threatening for some, consequences of forced pregnancy and childbirth. The impacts have been devastating.</p>\n<p>Make no mistake: The politicians who put this measure on the ballot don’t just want to assert that there is no constitutional right to abortion in the state, they want to keep abortion banned entirely. The ACLU has filed a challenge against two abortion bans in the state, and we’ll be arguing before the state supreme court exactly one week after Election Day. This is a one-two punch: we must defeat this anti-abortion amendment so that we can then win in court and restore access to abortion care in the state.</p>\n<p>The good news is that we can shut down this amendment just like we did in Kansas, but it will take all of us banding together to get the job done. Sign up to volunteer with Protect Kentucky Access on their <a href=\"https://www.mobilize.us/mobilize/event/477383/\">Mobilize page</a>.</p>\n<p>Every person has a role to play in this election to ensure our laws and the people elected to represent us reflect the overwhelming majority of people who want to protect the right to abortion. Whether you talk to your friends and family about the election using <a href=\"https://www.aclu.org/vote-your-values\">conversation guides</a> like the one we developed in the lead up to the election or are able to volunteer with the campaigns directly, we need your energy and activism in this moment.</p>\n<p>It’s time to show up with everything we have and fight for our rights — too much is at stake.</p>\n<p><i>Paid for by American Civil Liberties Union, Inc., 125 Broad Street, New York, New York 10004, in coordination with Reproductive Freedom for All.</i></p>\n<p><i>Paid for by American Civil Liberties Union, Inc. in coordination with Protect Kentucky Access.</i></p>\n\t\t<div class=\"rss-cta\"><div class=\"rss-cta__subtitle\">What you can do:</div><div class=\"rss-cta__title\">Be a Defender of Abortion Rights</div><a href=\"https://go.peoplepower.org/signup/take-pledge-commit-being-defender-abortion-rights\" class=\"rss-cta__button\">Join People Power</a></div>",
  "source": "American Civil Liberties Union"
}