{
  "title": "Episode 33: &#8220;Mystery Train&#8221;, by Elvis Presley",
  "link": "https://500songs.com/podcast/episode-33-mystery-train-by-elvis-presley/",
  "pubDate": "Mon, 20 May 2019 02:28:04 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-33-mystery-train-by-elvis-presley/",
  "description": "Welcome to episode thirty-three of <em>A History of Rock Music in Five Hundred Songs</em>. This one looks at \"Mystery Train\" by Elvis Presley. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-33-mystery-train/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThere are many, many books about Elvis Presley out there, but the one I'm using as my major resource for information on him, and which has guided my views as to the kind of person he was, is <a href=\"https://amzn.to/2EjL4b9\"><em>Last Train to Memphis</em> by Peter Guralnick</a>, generally considered the best biography of him.\n\nI'm also relying heavily on another book by Guralnick -- <a href=\"https://amzn.to/2VDGeeo\"><em>Sam Phillips: the Man Who Invented Rock and Roll</em></a> -- for all the episodes dealing with Phillips and Sun Records.\n\n<a href=\"https://amzn.to/2Vw2yGU\"><em>The Colonel</em> </a>by Alanna Nash is a little more tabloidy than those two, but is the only full-length biography I know of of Colonel Tom Parker.\n\nAll the Sun Records excerpted here -- the ones by Junior Parker, Elvis Presley, Rufus Thomas, and Johnny Cash, are on <a href=\"https://amzn.to/2I6Tx5A\">this ten-disc set,</a> which charts the history of Sun Records, with the A- and B-sides of ninety of the first Sun singles for an absurdly low price.\n\n<a href=\"https://amzn.to/2DtTafM\">And this three-CD box set</a> contains literally every recording Elvis made from 1953 through 1955, including live recordings and session outtakes, along with a handsome book.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWe talked a few weeks back about how Elvis Presley got started in the music business, but of course Elvis was important enough to rock and roll that we're not going to stop there. Today we're going to look at the rest of his career at Sun Records -- and at how and why he ended up leaving Sun for a major label, with consequences that would affect the whole of music history. We're going to tell a tale of two Parkers.\n\nThe first Parker we're going to talk about is Junior Parker, the blues musician who had been one of the Beale Streeters with Johnny Ace, Bobby \"Blue\" Bland, and B.B. King.\n\nJunior Parker had been working with Howlin' Wolf for a while, before in 1952 he formed his own band, the Blue Flames (which should not be confused with all the other Flames bands we've talked about -- for some reason there is a profusion of Flames that we'll be dealing with well into the seventies). Ike Turner discovered them, and initially got them signed to Modern Records, though as with many Modern Records acts they were recording mostly in Sam Phillips' studio.\n\nTurner contributed piano to the Blue Flames' first single, \"You're My Angel\":\n\n[Excerpt: Junior Parker and the Blue Flames, \"You're My Angel\"]\n\nBut after that one single, Parker and his band started recording directly for Sun records.\n\nThe first single they recorded for Sun was a minor hit, but wasn't particularly interesting -- \"Feelin' Good\" was basically a John Lee Hooker knock-off:\n\n[Excerpt: Little Junior's Blue Flames: \"Feelin' Good\"]\n\nBut it's their second single for Sun we want to talk about here, and both sides of it. The A-side of Junior Parker and the Blue Flames' second Sun single is one of the best blues records Sun ever put out, \"Love my Baby\":\n\n[Excerpt: Junior Parker, \"Love My Baby\"]\n\nThat record was one that Sam Phillips -- a man who made a lot of great records -- considered among the greatest he'd ever made. Talking to his biographer Peter Guralnick about it decades later, he said “I mean you tell me a better record that you’ve ever heard,” and Guralnick couldn't.\n\nBut it was the B-side that made an impression. The B-side was a song called \"Mystery Train\".\n\nThat song actually dates back to the old folk song, \"Worried Man Blues\", which was recorded in 1930 by the Carter Family:\n\n[excerpt: \"Worried Man Blues\", the Carter Family]\n\nThe Carter Family were, along with Jimmie Rodgers, the people who defined what country music is. Everyone in country music followed from either the Carters or Rodgers, and we'll be seeing some members of the extended Carter family much later. But the important thing here is that A.P. Carter, the family patriarch, was one of the most important songwriters of his generation, but he would also go out and find old folk songs that he would repurpose and credit himself with having written.\n\n\"Worried Man Blues\" was one of those, and those lyrics, \"the train arrived, sixteen coaches long\" became part of the floating lyrics that all blues singers could call upon, and they became the basis for Junior Parker's song:\n\n[Excerpt: Junior Parker, \"Mystery Train\"]\n\nThat song's composition was credited to Parker and to Sam Phillips. Phillips would later claim that he made three major changes to the song, and that these were why he got the co-writing credit. The first was to give the song the title \"Mystery Train\", which has been a big part of the song's appeal ever since. The second was to insist that the number of coaches for the train should be sixteen -- Parker had been singing \"fifty coaches long\". And the final one was to suggest that the band start the song slowly and build up the tempo like a train gathering steam.\n\nParker and his Blue Flames also backed Rufus Thomas on \"Tiger Man\", a song that Elvis would later go on to perform in the sixties, and would play as a medley with \"Mystery Train\" in the seventies:\n\n[Excerpt: Rufus Thomas, \"Tiger Man\"]\n\nBut the Rufus Thomas connection proved a signifier of what was to come. Don Robey was still annoyed with Sam Phillips over \"Bear Cat\", the track that Phillips had produced for Thomas as an answer to \"Hound Dog\", and Robey would take pleasure in poaching Phillips' artists for his own label. Phillips was soon reading in Cash Box magazine that Robey was grooming Little Junior Parker for big things. Robey signed Parker to an exclusive contract, and even an unsuccessful hundred-thousand-dollar lawsuit from Sam Phillips couldn't stop Robey from having Parker on his label.\n\nJunior Parker would go on to have a distinguished career in R&B, having occasional hit singles until shortly before his death from a brain tumour in 1971.\n\nLuckily for Phillips, he had other artists he could work with, not least of them Elvis Presley. But before we talk more about Elvis, let's talk about that other Parker.\n\nTom Parker was to become the most well-known manager in the music industry, even though for most of his career he only managed one act, so today we're going to look at him in some detail, as he became the template for all the worst, most grasping, managers in the music business. When we deal with Allen Klein or Peter Grant or Don Arden, we'll be dealing with people who are following in the Colonel's footsteps.\n\nIt's difficult to separate fact from fiction in the case of Colonel Parker, though there are biographies devoted entirely to doing so, with some success. What we know for sure was that Parker was an undocumented immigrant to the United States, originally from the Netherlands, who had taken the name Parker upon his arrival.\n\nWe also know that the same day that he disappeared from his home in the Netherlands to travel to the US for the final time, a woman was found bludgeoned to death in his home town. And we know that he was dishonourably discharged from the US Army as a psychopath. And that there were rumours around his home town decades later that Parker was responsible for the murder.\n\nWe also know that he desperately hid his undocumented status long past the time when he would have been eligible for citizenship, and that he completely cut off all contact with his family, even though he had been close to them before emigrating.\n\nWhether he was a killer or not, Parker was certainly an unsavoury character -- as, to be fair, were most people involved in the business side of the music industry in the 1950s. He had his start in the entertainment industry as a con-man, and throughout his life he loved to manipulate people, playing humiliating practical jokes on them that weren't so much jokes as demonstrations of his power over them. He was, by all accounts, a cruel man who loved to hurt people -- except when he loved to be outlandishly sentimental towards them instead, of course.\n\nParker had started out as a carny -- working in travelling shows, doing everything from running a dancing chicken show (in which he'd put a hot-plate under a chicken's feet so it would keep lifting its legs up and look like it was dancing) to telling fortunes, to being the person whose job it was to tempt the geek to come back to the show with a bottle of whisky when he became too sickened by his job.\n\n(The geek, for those who don't know, was a person in a carnival who would perform acts that would disgust most people, such as biting the head off live chickens, to the amused disgust of the audience. Usually a geek would be someone who had severe mental health and substance abuse problems, degrading himself as the only way to make enough money to feed his habit.)\n\nAll this had taught Parker a lot -- it had led him to the conclusion that audiences were there to be ripped off, and that absolutely nothing mattered to them other than the promise of sexuality. As far as Parker was concerned, in showbusiness it didn't matter what the show was -- what mattered was how you sold it to the audience, and how much merchandise you could sell during the show.\n\nIn his time with the carnivals, Parker had become extremely good at creating publicity stunts. One that he did many times was to fake a public wedding. He and a female staff member would pretend to be just two customers in love, and they would \"get married\" at the top of the Ferris wheel, drawing huge crowds.\n\nIt was during World War II that Parker had moved into country music promotion. He first became involved in music when he got to know Gene Austin, one of the biggest stars of the 1920s:\n\n[Excerpt: Gene Austin, \"Ain't She Sweet?\"]\n\nAustin had been a huge star, but by the time Parker got to know him in the late thirties, he was much less popular. Parker helped him organise some shows (according to some claims, Parker was his manager, though other sources disagree), but at this time Austin had fallen on such hard times that he would fill his car at a petrol station, pay by cheque, and then tell them that his autograph was probably worth more than the money, so why not just leave that cheque uncashed and frame it?\n\nParker learned a valuable lesson from Austin, with whom he would remain friends for years. That lesson was that the stars come and go, and rise and fall in popularity, but managers can keep making money no matter how old they are. Parker determined to get into music management. And given that he didn't actually like music himself, he decided to go for the music of the common people, the music that was selling to the same people who'd been coming to the carnivals. Country music.\n\nAnd so to start with he put on a show by the up-and-coming star Roy Acuff:\n\n[Excerpt: Roy Acuff, \"You're the Only Star in My Blue Heaven\"]\n\nIn later years Roy Acuff would become, for a time, the single biggest star in country music, and Hank Williams would say of him, \"For drawing power in the South, it was Roy Acuff, then God.\" But in 1941 he was merely very popular, rather than a superstar.\n\nAnd Parker had used his promotional knowledge to make the show he promoted one of the biggest in Acuff's career thus far. In particular, he'd tried a new trick that no-one else had ever done before. He'd cut a deal with a local grocery chain that they would sell cut-price tickets to anyone who brought in a clipping from a newspaper. This meant that the show had, in effect, multiple box offices, while the grocery chain paid for the advertising to increase their own footfall.\n\nHaving seen what kind of money he could make from country music, Parker approached Acuff about becoming Acuff's manager. Acuff was initially interested, but after a couple of dates he was put off from working further with Parker, because Parker had what Acuff thought an un-Christian attitude to money. Acuff was playing dates for fixed fees, and Parker started insisting that as well as the fixed fee, Acuff should get a percentage of the gross. Acuff didn't want to be that grasping, and so he gave up on working with Parker -- though as a consolation, Acuff did give Parker a stake in his merchandising -- Parker got the rights to market Roy Acuff Flour in Florida.\n\nBut Acuff did more than that. He pointed Parker in the direction of Eddy Arnold, a young singer who was then working with Pee Wee King's Golden West Cowboys. He told Parker that Arnold would almost certainly be going solo soon, and that he would need a manager.\n\nArnold was a fan of Gene Austin, and so eagerly linked up with Parker. Parker quickly got Arnold signed to RCA records as a solo artist, and Arnold's second single, in 1945, \"Each Minute Seems Like a Million Years\", reached number five in the country charts:\n\n[Excerpt: Eddy Arnold, \"Each Minute Seems Like a Million Years\"]\n\nEddy Arnold was to go on to become one of the biggest stars in country music, and that was in large part because of the team that Tom Parker built around him. Parker would handle the management, Steve Sholes, the head of country and R&B at RCA, would handle the record production. Parker cut a deal with Hill and Range music publishers so that Arnold would perform songs they published in return for kickbacks, and any songs that Arnold wrote himself would go through them. And the William Morris Agency would handle the bookings. Both Sholes and Arnold were given money by Hill and Range for Arnold recording the publishers' songs, Parker had Sholes in his pocket because he knew that Sholes was taking kickbacks and could inform Sholes' bosses at RCA, and Parker in turn took twenty-five percent of the twenty thousand dollar bribe that Hill and Range paid Arnold, as Arnold's manager.\n\nThis whole team, put together by a mutual love of ripping each other and their artists off, would go on to work with Parker on every other artist he managed, and would be the backbone of his success in the industry.\n\nParker soon used his music industry connections to get an honorary Colonel's commission from Louisiana Governor Jimmie Davis, himself a former country musician, and from that point until the end of his life insisted on being addressed as \"Colonel\", even though in reality he was a draft-dodger who had deliberately piled on weight during the Second World War so he could become too fat to draft.\n\nBut Parker and Arnold eventually split up -- Parker was originally meant to be Arnold's exclusive manager, but in 1953 Arnold found out that Parker was putting together a tour of other RCA acts, headed by Hank Snow. Arnold fired the Colonel, and the Colonel quickly instead became the \"exclusive\" manager of Hank Snow.\n\n[Excerpt: Hank Snow, \"I Went to Your Wedding\"]\n\nOf course, Parker didn't leave his association with Eddy Arnold empty handed -- he insisted on Arnold giving him a severance package of fifty thousand dollars, because of how much money Arnold was making from the contracts that Parker had negotiated for him.\n\nHis association with Hank Snow would only last two years, and would break up very acrimoniously -- with Snow later saying \"I have worked with several managers over the years and have had respect for them all except one. Tom Parker was the most egotistical, obnoxious human being I've ever had dealings with.\"\n\nThe reason Snow said this was because the Colonel tricked Snow out of the greatest business opportunity in the history of the music business. The two of them had formed a management company to manage other artists, and when Parker found another artist he wanted to manage, Snow naturally assumed that they were partners -- right up until he discovered they weren't.\n\nSince his first single, Elvis Presley had been putting out singles on Sun that largely stuck to the same formula -- a blues number on one side, a country number on the other, and a sparse backing by Elvis, Scotty, and Bill.\n\nIn general, the blues sides were rather better than the country sides, not least because the country sides, after the first couple of singles, started to be songs that were especially written for Elvis by outside songwriters, and tended to be based on rather obvious wordplay -- songs like \"I'm Left, You're Right, She's Gone\".\n\n[Excerpt: Elvis Presley, “I'm Left, You're Right, She's Gone”]\n\nThe blues songs, on the other hand, were chosen from among Elvis' own favourites and songs that got kicked around in the studio. This would set the template for his work in the future -- whenever Elvis got to choose his own material, and follow his own instincts, the results would be good music. Whenever he was working on music that was chosen for him by someone else -- even someone as sympathetic to his musical instincts as Sam Phillips -- the music would suffer, though at this stage even the songs Elvis wasn't as keen on sounded great.\n\nBy the time of Elvis' last Sun single, he had finally made one more change that would define the band he would work with for the rest of the fifties. He had introduced a drummer, DJ Fontana, and while Fontana didn't play on the single – session drummer Johnny Bernero played on it instead – he would be a part of the core band from now on. The trio of Elvis, Scotty, and Bill had now become a singer and his backup band -- Elvis Presley and the Blue Moon Boys.\n\nThe A-side of Elvis' fifth single for Sun Records was one of those country songs that had been written especially for Elvis, \"I Forgot to Remember to Forget\":\n\n[Excerpt: Elvis Presley, \"I Forgot to Remember to Forget\"]\n\nThat's a perfectly adequate country pop song, but the B-side, his version of \"Mystery Train\", was astonishing. It was actually a merger of elements from the A-side and the B-side of Junior Parker's single, as \"Love My Baby\" provided the riff that Scotty Moore used on Elvis' version of \"Mystery Train\". Elvis, Scotty, and Bill melded the two different songs together, and they came up with something that would become an absolute classic of the rockabilly genre:\n\n[Excerpt: Elvis Presley, \"Mystery Train\"]\n\nThe song was probably chosen because Sam Phillips was one of the credited songwriters -- as he was currently battling Don Robey in court over Junior Parker, he naturally wanted to make as much money off his former artist as he could. But at the same time, it was a song Elvis clearly liked, and one he would still be performing live in the 1970s. This wasn't a song that was being forced on to Elvis.\n\nIndeed, Elvis almost certainly saw Junior Parker live when he was playing with the Beale Streeters -- B.B. King would talk in later years about the teenage Elvis having been one of the very few white people who went to see them, and even allowing for later exaggerations, it's likely that he did see them at least a few times.\n\nSo this was one of those rare cases where the financial and artistic incentives perfectly overlapped.\n\nBut while he was recording for Sun, Elvis was also touring, and he was drawing bigger and bigger crowds, and they were going wilder and wilder. And when Tom Parker saw one of those crowds, he knew he had to have Elvis. He didn't understand at all why those girls were screaming at him -- he would never, in all his life, ever understand the appeal of Elvis' music -- but he knew that a crowd like that would spend money, and he definitely understood that.\n\nParker worked on Elvis, and more importantly he worked on Elvis' family -- and even more importantly than that, he got Hank Snow to work on Elvis' family. Elvis' parents were big Hank Snow fans, and after being told by their idol how much the Colonel had helped him they were practically salivating to get Elvis signed with him.\n\nElvis himself was young, and naive, and would go along with whatever his parents suggested. Carl Perkins would later describe him as the most introverted person ever to enter a recording studio, and he just wanted to make some money to look after his parents. His daddy had a bad back and couldn't work, and his mama was so tired and sick all the time. If they said the Colonel would help him earn more money, well, he'd do what his parents said. Maybe he could earn them enough money to buy them a nice big house, so his mama could give up her job. They could maybe raise chickens in the yard.\n\nIt was only after the documents were signed that Snow realised that the contracts didn't mention himself at all. His partner had cut him out, and the two parted company.\n\nMeanwhile, Sam Phillips was finding some more country singers he could work with, and starting to transition into country and rockabilly rather than the blues. A couple of months before “Mystery Train”, he put out another single by a two-guitar and bass rockabilly act – “Hey Porter” by Johnny Cash and the Tennessee Two:\n\n[Excerpt: Johnny Cash, “Hey Porter”]\n\nWe'll be hearing more from Johnny Cash later, but right now he didn't seem to be star material.\n\nColonel Parker knew that if Elvis was to become the star he could become, he would have to move to one of the major labels. Sun Records was a little nothing R&B label in Memphis; it barely registered on the national consciousness. If Elvis was going to do what Tom Parker wanted him to do, he was going to have to move to a big label -- a big label like RCA Records. Colonel Parker was in the country music business after all, and if you were going to be anything at all in the country music business, you were going to work in Nashville. Not Memphis. Parker started hinting to people that Sam Phillips wanted to sell Elvis' contract, without bothering to check with Phillips.\n\nThe problem was that Sam Phillips didn't want to give up on Elvis so easily. Phillips was, after all, a great judge of talent, and not only had he discovered Elvis, he had nurtured his ability. It was entirely likely that without Sam Phillips, Elvis would never have been anything more than a truck driver with a passable voice. Elvis the artist was as much the creation of Sam Phillips as he was of Elvis Presley himself.\n\nBut there was a downside to Elvis' success, and it was one that every independent label dreads. Sun Records was having hits. And the last thing you want as an indie is to have a hit.\n\nThe problem is cashflow. Suppose the distributors want a hundred thousand copies of your latest single. That's great! Except they will not pay you for several months -- if they pay you at all. And meanwhile, you need to pay the pressing plant for the singles *before* you get them to the distributors. If you've been selling in small but steady numbers and you suddenly start selling a lot, that can destroy your company. Nothing is more deadly to the indie label than a hit.\n\nAnd then on top of that there was the lawsuit with Don Robey over Junior Parker. That was eating Phillips' money, and he didn't have much of it.\n\nBut at that point, Sam Phillips didn't have any artists who could take Elvis' place. He'd found the musician he'd been looking for -- the one who could unite black and white people in Phillips' dream of ending racism. So he came up with a plan. He decided to tell Tom Parker that Elvis' contract would be for sale, like Parker wanted -- but only for $35,000.\n\nNow, that doesn't sound like a huge amount for Elvis' contract *today*, but in 1955 that would be the highest sum of money ever paid for a recording artist's contract. It was certainly an absurd amount for someone who had so far failed to trouble the pop charts at all. Phillips' view was that it was a ridiculous amount to ask for, but if he got it he could cover his spiralling costs, and if he didn't -- as seemed likely -- he would still have Elvis.\n\nAs Phillips later said, “I thought, hey, I’ll make ’em an offer that I know they will refuse, and then I’ll tell ’em they’d better not spread this poison any more. I absolutely did not think Tom Parker could raise the $35,000, and that would have been fine. But he raised the money, and damn, I couldn’t back out then.”\n\nHe gave the Colonel an unreasonably tight deadline to get him a five thousand dollar unrefundable deposit, and another unreasonably tight deadline to get the other thirty thousand. Amazingly, the Colonel called his bluff. He got him the five thousand almost straight away out of his own pocket, and by the deadline had managed to persuade Steve Sholes at RCA to pay it back to him, to pay Sam Phillips the outstanding thirty thousand, and to pay Elvis a five thousand dollar signing bonus -- of which, of course, a big chunk went directly into Tom Parker's pocket.\n\nRCA quickly reissued \"I Forgot to Remember to Forget\" and \"Mystery Train\", while they were waiting for Elvis' first recording session for his new label. With Elvis was now on a major label, and Sam Phillips had to find a new rockabilly star to promote. Luckily, there was a new young country boy who had come to audition for him. Carl Perkins had definite possibilities.",
  "itunes:subtitle": "Welcome to episode thirty-three of A History of Rock Music in Five Hundred Songs. This one looks at Mystery Train by Elvis Presley. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs alwa",
  "itunes:keywords": "B.B. King,Bill Black,Colonel Tom Parker,country and western,D.J. Fontana,Don Robey,Eddy Arnold,Elvis Presley,Gene Austin,Hank Snow,Hill and Range publishing,Ike Turner,Johnny Bernero,Johnny Cash,Junior Parker,lawsuits,Modern Records,RCA Records,rockabilly,Roy Acuff,Rufus Thomas,Sam Phillips,Scotty Moore,Steve Sholes,Sun Records,The Beale Streeters",
  "itunes:episodeType": "full",
  "itunes:episode": 33,
  "content:encoded": "Welcome to episode thirty-three of <em>A History of Rock Music in Five Hundred Songs</em>. This one looks at \"Mystery Train\" by Elvis Presley. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-33-mystery-train/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThere are many, many books about Elvis Presley out there, but the one I'm using as my major resource for information on him, and which has guided my views as to the kind of person he was, is <a href=\"https://amzn.to/2EjL4b9\"><em>Last Train to Memphis</em> by Peter Guralnick</a>, generally considered the best biography of him.\n\nI'm also relying heavily on another book by Guralnick -- <a href=\"https://amzn.to/2VDGeeo\"><em>Sam Phillips: the Man Who Invented Rock and Roll</em></a> -- for all the episodes dealing with Phillips and Sun Records.\n\n<a href=\"https://amzn.to/2Vw2yGU\"><em>The Colonel</em> </a>by Alanna Nash is a little more tabloidy than those two, but is the only full-length biography I know of of Colonel Tom Parker.\n\nAll the Sun Records excerpted here -- the ones by Junior Parker, Elvis Presley, Rufus Thomas, and Johnny Cash, are on <a href=\"https://amzn.to/2I6Tx5A\">this ten-disc set,</a> which charts the history of Sun Records, with the A- and B-sides of ninety of the first Sun singles for an absurdly low price.\n\n<a href=\"https://amzn.to/2DtTafM\">And this three-CD box set</a> contains literally every recording Elvis made from 1953 through 1955, including live recordings and session outtakes, along with a handsome book.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWe talked a few weeks back about how Elvis Presley got started in the music business, but of course Elvis was important enough to rock and roll that we're not going to stop there. Today we're going to look at the rest of his career at Sun Records -- and at how and why he ended up leaving Sun for a major label, with consequences that would affect the whole of music history. We're going to tell a tale of two Parkers.\n\nThe first Parker we're going to talk about is Junior Parker, the blues musician who had been one of the Beale Streeters with Johnny Ace, Bobby \"Blue\" Bland, and B.B. King.\n\nJunior Parker had been working with Howlin' Wolf for a while, before in 1952 he formed his own band, the Blue Flames (which should not be confused with all the other Flames bands we've talked about -- for some reason there is a profusion of Flames that we'll be dealing with well into the seventies). Ike Turner discovered them, and initially got them signed to Modern Records, though as with many Modern Records acts they were recording mostly in Sam Phillips' studio.\n\nTurner contributed piano to the Blue Flames' first single, \"You're My Angel\":\n\n[Excerpt: Junior Parker and the Blue Flames, \"You're My Angel\"]\n\nBut after that one single, Parker and his band started recording directly for Sun records.\n\nThe first single they recorded for Sun was a minor hit, but wasn't particularly interesting -- \"Feelin' Good\" was basically a John Lee Hooker knock-off:\n\n[Excerpt: Little Junior's Blue Flames: \"Feelin' Good\"]\n\nBut it's their second single for Sun we want to talk about here, and both sides of it. The A-side of Junior Parker and the Blue Flames' second Sun single is one of the best blues records Sun ever put out, \"Love my Baby\":\n\n[Excerpt: Junior Parker, \"Love My Baby\"]\n\nThat record was one that Sam Phillips -- a man who made a lot of great records -- considered among the greatest he'd ever made. Talking to his biographer Peter Guralnick about it decades later, he said “I mean you tell me a better record that you’ve ever heard,” and Guralnick couldn't.\n\nBut it was the B-side that made an impression. The B-side was a song called \"Mystery Train\".\n\nThat song actually dates back to the old folk song, \"Worried Man Blues\", which was recorded in 1930 by the Carter Family:\n\n[excerpt: \"Worried Man Blues\", the Carter Family]\n\nThe Carter Family were, along with Jimmie Rodgers, the people who defined what country music is. Everyone in country music followed from either the Carters or Rodgers, and we'll be seeing some members of the extended Carter family much later. But the important thing here is that A.P. Carter, the family patriarch, was one of the most important songwriters of his generation, but he would also go out and find old folk songs that he would repurpose and credit himself with having written.\n\n\"Worried Man Blues\" was one of those, and those lyrics, \"the train arrived, sixteen coaches long\" became part of the floating lyrics that all blues singers could call upon, and they became the basis for Junior Parker's song:\n\n[Excerpt: Junior Parker, \"Mystery Train\"]\n\nThat song's composition was credited to Parker and to Sam Phillips. Phillips would later claim that he made three major changes to the song, and that these were why he got the co-writing credit. The first was to give the song the title \"Mystery Train\", which has been a big part of the song's appeal ever since. The second was to insist that the number of coaches for the train should be sixteen -- Parker had been singing \"fifty coaches long\". And the final one was to suggest that the band start the song slowly and build up the tempo like a train gathering steam.\n\nParker and his Blue Flames also backed Rufus Thomas on \"Tiger Man\", a song that Elvis would later go on to perform in the sixties, and would play as a medley with \"Mystery Train\" in the seventies:\n\n[Excerpt: Rufus Thomas, \"Tiger Man\"]\n\nBut the Rufus Thomas connection proved a signifier of what was to come. Don Robey was still annoyed with Sam Phillips over \"Bear Cat\", the track that Phillips had produced for Thomas as an answer to \"Hound Dog\", and Robey would take pleasure in poaching Phillips' artists for his own label. Phillips was soon reading in Cash Box magazine that Robey was grooming Little Junior Parker for big things. Robey signed Parker to an exclusive contract, and even an unsuccessful hundred-thousand-dollar lawsuit from Sam Phillips couldn't stop Robey from having Parker on his label.\n\nJunior Parker would go on to have a distinguished career in R&B, having occasional hit singles until shortly before his death from a brain tumour in 1971.\n\nLuckily for Phillips, he had other artists he could work with, not least of them Elvis Presley. But before we talk more about Elvis, let's talk about that other Parker.\n\nTom Parker was to become the most well-known manager in the music industry, even though for most of his career he only managed one act, so today we're going to look at him in some detail, as he became the template for all the worst, most grasping, managers in the music business. When we deal with Allen Klein or Peter Grant or Don Arden, we'll be dealing with people who are following in the Colonel's footsteps.\n\nIt's difficult to separate fact from fiction in the case of Colonel Parker, though there are biographies devoted entirely to doing so, with some success. What we know for sure was that Parker was an undocumented immigrant to the United States, originally from the Netherlands, who had taken the name Parker upon his arrival.\n\nWe also know that the same day that he disappeared from his home in the Netherlands to travel to the US for the final time, a woman was found bludgeoned to death in his home town. And we know that he was dishonourably discharged from the US Army as a psychopath. And that there were rumours around his home town decades later that Parker was responsible for the murder.\n\nWe also know that he desperately hid his undocumented status long past the time when he would have been eligible for citizenship, and that he completely cut off all contact with his family, even though he had been close to them before emigrating.\n\nWhether he was a killer or not, Parker was certainly an unsavoury character -- as, to be fair, were most people involved in the business side of the music industry in the 1950s. He had his start in the entertainment industry as a con-man, and throughout his life he loved to manipulate people, playing humiliating practical jokes on them that weren't so much jokes as demonstrations of his power over them. He was, by all accounts, a cruel man who loved to hurt people -- except when he loved to be outlandishly sentimental towards them instead, of course.\n\nParker had started out as a carny -- working in travelling shows, doing everything from running a dancing chicken show (in which he'd put a hot-plate under a chicken's feet so it would keep lifting its legs up and look like it was dancing) to telling fortunes, to being the person whose job it was to tempt the geek to come back to the show with a bottle of whisky when he became too sickened by his job.\n\n(The geek, for those who don't know, was a person in a carnival who would perform acts that would disgust most people, such as biting the head off live chickens, to the amused disgust of the audience. Usually a geek would be someone who had severe mental health and substance abuse problems, degrading himself as the only way to make enough money to feed his habit.)\n\nAll this had taught Parker a lot -- it had led him to the conclusion that audiences were there to be ripped off, and that absolutely nothing mattered to them other than the promise of sexuality. As far as Parker was concerned, in showbusiness it didn't matter what the show was -- what mattered was how you sold it to the audience, and how much merchandise you could sell during the show.\n\nIn his time with the carnivals, Parker had become extremely good at creating publicity stunts. One that he did many times was to fake a public wedding. He and a female staff member would pretend to be just two customers in love, and they would \"get married\" at the top of the Ferris wheel, drawing huge crowds.\n\nIt was during World War II that Parker had moved into country music promotion. He first became involved in music when he got to know Gene Austin, one of the biggest stars of the 1920s:\n\n[Excerpt: Gene Austin, \"Ain't She Sweet?\"]\n\nAustin had been a huge star, but by the time Parker got to know him in the late thirties, he was much less popular. Parker helped him organise some shows (according to some claims, Parker was his manager, though other sources disagree), but at this time Austin had fallen on such hard times that he would fill his car at a petrol station, pay by cheque, and then tell them that his autograph was probably worth more than the money, so why not just leave that cheque uncashed and frame it?\n\nParker learned a valuable lesson from Austin, with whom he would remain friends for years. That lesson was that the stars come and go, and rise and fall in popularity, but managers can keep making money no matter how old they are. Parker determined to get into music management. And given that he didn't actually like music himself, he decided to go for the music of the common people, the music that was selling to the same people who'd been coming to the carnivals. Country music.\n\nAnd so to start with he put on a show by the up-and-coming star Roy Acuff:\n\n[Excerpt: Roy Acuff, \"You're the Only Star in My Blue Heaven\"]\n\nIn later years Roy Acuff would become, for a time, the single biggest star in country music, and Hank Williams would say of him, \"For drawing power in the South, it was Roy Acuff, then God.\" But in 1941 he was merely very popular, rather than a superstar.\n\nAnd Parker had used his promotional knowledge to make the show he promoted one of the biggest in Acuff's career thus far. In particular, he'd tried a new trick that no-one else had ever done before. He'd cut a deal with a local grocery chain that they would sell cut-price tickets to anyone who brought in a clipping from a newspaper. This meant that the show had, in effect, multiple box offices, while the grocery chain paid for the advertising to increase their own footfall.\n\nHaving seen what kind of money he could make from country music, Parker approached Acuff about becoming Acuff's manager. Acuff was initially interested, but after a couple of dates he was put off from working further with Parker, because Parker had what Acuff thought an un-Christian attitude to money. Acuff was playing dates for fixed fees, and Parker started insisting that as well as the fixed fee, Acuff should get a percentage of the gross. Acuff didn't want to be that grasping, and so he gave up on working with Parker -- though as a consolation, Acuff did give Parker a stake in his merchandising -- Parker got the rights to market Roy Acuff Flour in Florida.\n\nBut Acuff did more than that. He pointed Parker in the direction of Eddy Arnold, a young singer who was then working with Pee Wee King's Golden West Cowboys. He told Parker that Arnold would almost certainly be going solo soon, and that he would need a manager.\n\nArnold was a fan of Gene Austin, and so eagerly linked up with Parker. Parker quickly got Arnold signed to RCA records as a solo artist, and Arnold's second single, in 1945, \"Each Minute Seems Like a Million Years\", reached number five in the country charts:\n\n[Excerpt: Eddy Arnold, \"Each Minute Seems Like a Million Years\"]\n\nEddy Arnold was to go on to become one of the biggest stars in country music, and that was in large part because of the team that Tom Parker built around him. Parker would handle the management, Steve Sholes, the head of country and R&B at RCA, would handle the record production. Parker cut a deal with Hill and Range music publishers so that Arnold would perform songs they published in return for kickbacks, and any songs that Arnold wrote himself would go through them. And the William Morris Agency would handle the bookings. Both Sholes and Arnold were given money by Hill and Range for Arnold recording the publishers' songs, Parker had Sholes in his pocket because he knew that Sholes was taking kickbacks and could inform Sholes' bosses at RCA, and Parker in turn took twenty-five percent of the twenty thousand dollar bribe that Hill and Range paid Arnold, as Arnold's manager.\n\nThis whole team, put together by a mutual love of ripping each other and their artists off, would go on to work with Parker on every other artist he managed, and would be the backbone of his success in the industry.\n\nParker soon used his music industry connections to get an honorary Colonel's commission from Louisiana Governor Jimmie Davis, himself a former country musician, and from that point until the end of his life insisted on being addressed as \"Colonel\", even though in reality he was a draft-dodger who had deliberately piled on weight during the Second World War so he could become too fat to draft.\n\nBut Parker and Arnold eventually split up -- Parker was originally meant to be Arnold's exclusive manager, but in 1953 Arnold found out that Parker was putting together a tour of other RCA acts, headed by Hank Snow. Arnold fired the Colonel, and the Colonel quickly instead became the \"exclusive\" manager of Hank Snow.\n\n[Excerpt: Hank Snow, \"I Went to Your Wedding\"]\n\nOf course, Parker didn't leave his association with Eddy Arnold empty handed -- he insisted on Arnold giving him a severance package of fifty thousand dollars, because of how much money Arnold was making from the contracts that Parker had negotiated for him.\n\nHis association with Hank Snow would only last two years, and would break up very acrimoniously -- with Snow later saying \"I have worked with several managers over the years and have had respect for them all except one. Tom Parker was the most egotistical, obnoxious human being I've ever had dealings with.\"\n\nThe reason Snow said this was because the Colonel tricked Snow out of the greatest business opportunity in the history of the music business. The two of them had formed a management company to manage other artists, and when Parker found another artist he wanted to manage, Snow naturally assumed that they were partners -- right up until he discovered they weren't.\n\nSince his first single, Elvis Presley had been putting out singles on Sun that largely stuck to the same formula -- a blues number on one side, a country number on the other, and a sparse backing by Elvis, Scotty, and Bill.\n\nIn general, the blues sides were rather better than the country sides, not least because the country sides, after the first couple of singles, started to be songs that were especially written for Elvis by outside songwriters, and tended to be based on rather obvious wordplay -- songs like \"I'm Left, You're Right, She's Gone\".\n\n[Excerpt: Elvis Presley, “I'm Left, You're Right, She's Gone”]\n\nThe blues songs, on the other hand, were chosen from among Elvis' own favourites and songs that got kicked around in the studio. This would set the template for his work in the future -- whenever Elvis got to choose his own material, and follow his own instincts, the results would be good music. Whenever he was working on music that was chosen for him by someone else -- even someone as sympathetic to his musical instincts as Sam Phillips -- the music would suffer, though at this stage even the songs Elvis wasn't as keen on sounded great.\n\nBy the time of Elvis' last Sun single, he had finally made one more change that would define the band he would work with for the rest of the fifties. He had introduced a drummer, DJ Fontana, and while Fontana didn't play on the single – session drummer Johnny Bernero played on it instead – he would be a part of the core band from now on. The trio of Elvis, Scotty, and Bill had now become a singer and his backup band -- Elvis Presley and the Blue Moon Boys.\n\nThe A-side of Elvis' fifth single for Sun Records was one of those country songs that had been written especially for Elvis, \"I Forgot to Remember to Forget\":\n\n[Excerpt: Elvis Presley, \"I Forgot to Remember to Forget\"]\n\nThat's a perfectly adequate country pop song, but the B-side, his version of \"Mystery Train\", was astonishing. It was actually a merger of elements from the A-side and the B-side of Junior Parker's single, as \"Love My Baby\" provided the riff that Scotty Moore used on Elvis' version of \"Mystery Train\". Elvis, Scotty, and Bill melded the two different songs together, and they came up with something that would become an absolute classic of the rockabilly genre:\n\n[Excerpt: Elvis Presley, \"Mystery Train\"]\n\nThe song was probably chosen because Sam Phillips was one of the credited songwriters -- as he was currently battling Don Robey in court over Junior Parker, he naturally wanted to make as much money off his former artist as he could. But at the same time, it was a song Elvis clearly liked, and one he would still be performing live in the 1970s. This wasn't a song that was being forced on to Elvis.\n\nIndeed, Elvis almost certainly saw Junior Parker live when he was playing with the Beale Streeters -- B.B. King would talk in later years about the teenage Elvis having been one of the very few white people who went to see them, and even allowing for later exaggerations, it's likely that he did see them at least a few times.\n\nSo this was one of those rare cases where the financial and artistic incentives perfectly overlapped.\n\nBut while he was recording for Sun, Elvis was also touring, and he was drawing bigger and bigger crowds, and they were going wilder and wilder. And when Tom Parker saw one of those crowds, he knew he had to have Elvis. He didn't understand at all why those girls were screaming at him -- he would never, in all his life, ever understand the appeal of Elvis' music -- but he knew that a crowd like that would spend money, and he definitely understood that.\n\nParker worked on Elvis, and more importantly he worked on Elvis' family -- and even more importantly than that, he got Hank Snow to work on Elvis' family. Elvis' parents were big Hank Snow fans, and after being told by their idol how much the Colonel had helped him they were practically salivating to get Elvis signed with him.\n\nElvis himself was young, and naive, and would go along with whatever his parents suggested. Carl Perkins would later describe him as the most introverted person ever to enter a recording studio, and he just wanted to make some money to look after his parents. His daddy had a bad back and couldn't work, and his mama was so tired and sick all the time. If they said the Colonel would help him earn more money, well, he'd do what his parents said. Maybe he could earn them enough money to buy them a nice big house, so his mama could give up her job. They could maybe raise chickens in the yard.\n\nIt was only after the documents were signed that Snow realised that the contracts didn't mention himself at all. His partner had cut him out, and the two parted company.\n\nMeanwhile, Sam Phillips was finding some more country singers he could work with, and starting to transition into country and rockabilly rather than the blues. A couple of months before “Mystery Train”, he put out another single by a two-guitar and bass rockabilly act – “Hey Porter” by Johnny Cash and the Tennessee Two:\n\n[Excerpt: Johnny Cash, “Hey Porter”]\n\nWe'll be hearing more from Johnny Cash later, but right now he didn't seem to be star material.\n\nColonel Parker knew that if Elvis was to become the star he could become, he would have to move to one of the major labels. Sun Records was a little nothing R&B label in Memphis; it barely registered on the national consciousness. If Elvis was going to do what Tom Parker wanted him to do, he was going to have to move to a big label -- a big label like RCA Records. Colonel Parker was in the country music business after all, and if you were going to be anything at all in the country music business, you were going to work in Nashville. Not Memphis. Parker started hinting to people that Sam Phillips wanted to sell Elvis' contract, without bothering to check with Phillips.\n\nThe problem was that Sam Phillips didn't want to give up on Elvis so easily. Phillips was, after all, a great judge of talent, and not only had he discovered Elvis, he had nurtured his ability. It was entirely likely that without Sam Phillips, Elvis would never have been anything more than a truck driver with a passable voice. Elvis the artist was as much the creation of Sam Phillips as he was of Elvis Presley himself.\n\nBut there was a downside to Elvis' success, and it was one that every independent label dreads. Sun Records was having hits. And the last thing you want as an indie is to have a hit.\n\nThe problem is cashflow. Suppose the distributors want a hundred thousand copies of your latest single. That's great! Except they will not pay you for several months -- if they pay you at all. And meanwhile, you need to pay the pressing plant for the singles *before* you get them to the distributors. If you've been selling in small but steady numbers and you suddenly start selling a lot, that can destroy your company. Nothing is more deadly to the indie label than a hit.\n\nAnd then on top of that there was the lawsuit with Don Robey over Junior Parker. That was eating Phillips' money, and he didn't have much of it.\n\nBut at that point, Sam Phillips didn't have any artists who could take Elvis' place. He'd found the musician he'd been looking for -- the one who could unite black and white people in Phillips' dream of ending racism. So he came up with a plan. He decided to tell Tom Parker that Elvis' contract would be for sale, like Parker wanted -- but only for $35,000.\n\nNow, that doesn't sound like a huge amount for Elvis' contract *today*, but in 1955 that would be the highest sum of money ever paid for a recording artist's contract. It was certainly an absurd amount for someone who had so far failed to trouble the pop charts at all. Phillips' view was that it was a ridiculous amount to ask for, but if he got it he could cover his spiralling costs, and if he didn't -- as seemed likely -- he would still have Elvis.\n\nAs Phillips later said, “I thought, hey, I’ll make ’em an offer that I know they will refuse, and then I’ll tell ’em they’d better not spread this poison any more. I absolutely did not think Tom Parker could raise the $35,000, and that would have been fine. But he raised the money, and damn, I couldn’t back out then.”\n\nHe gave the Colonel an unreasonably tight deadline to get him a five thousand dollar unrefundable deposit, and another unreasonably tight deadline to get the other thirty thousand. Amazingly, the Colonel called his bluff. He got him the five thousand almost straight away out of his own pocket, and by the deadline had managed to persuade Steve Sholes at RCA to pay it back to him, to pay Sam Phillips the outstanding thirty thousand, and to pay Elvis a five thousand dollar signing bonus -- of which, of course, a big chunk went directly into Tom Parker's pocket.\n\nRCA quickly reissued \"I Forgot to Remember to Forget\" and \"Mystery Train\", while they were waiting for Elvis' first recording session for his new label. With Elvis was now on a major label, and Sam Phillips had to find a new rockabilly star to promote. Luckily, there was a new young country boy who had come to audition for him. Carl Perkins had definite possibilities.",
  "enclosure": "",
  "itunes:summary": "Welcome to episode thirty-three of A History of Rock Music in Five Hundred Songs. This one looks at \"Mystery Train\" by Elvis Presley. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThere are many, many books about Elvis Presley out there, but the one I'm using as my major resource for information on him, and which has guided my views as to the kind of person he was, is Last Train to Memphis by Peter Guralnick, generally considered the best biography of him.\n\nI'm also relying heavily on another book by Guralnick -- Sam Phillips: the Man Who Invented Rock and Roll -- for all the episodes dealing with Phillips and Sun Records.\n\nThe Colonel by Alanna Nash is a little more tabloidy than those two, but is the only full-length biography I know of of Colonel Tom Parker.\n\nAll the Sun Records excerpted here -- the ones by Junior Parker, Elvis Presley, Rufus Thomas, and Johnny Cash, are on this ten-disc set, which charts the history of Sun Records, with the A- and B-sides of ninety of the first Sun singles for an absurdly low price.\n\nAnd this three-CD box set contains literally every recording Elvis made from 1953 through 1955, including live recordings and session outtakes, along with a handsome book.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nWe talked a few weeks back about how Elvis Presley got started in the music business, but of course Elvis was important enough to rock and roll that we're not going to stop there. Today we're going to look at the rest of his career at Sun Records -- and at how and why he ended up leaving Sun for a major label, with consequences that would affect the whole of music history. We're going to tell a tale of two Parkers.\n\nThe first Parker we're going to talk about is Junior Parker, the blues musician who had been one of the Beale Streeters with Johnny Ace, Bobby \"Blue\" Bland, and B.B. King.\n\nJunior Parker had been working with Howlin' Wolf for a while, before in 1952 he formed his own band, the Blue Flames (which should not be confused with all the other Flames bands we've talked about -- for some reason there is a profusion of Flames that we'll be dealing with well into the seventies). Ike Turner discovered them, and initially got them signed to Modern Records, though as with many Modern Records acts they were recording mostly in Sam Phillips' studio.\n\nTurner contributed piano to the Blue Flames' first single, \"You're My Angel\":\n\n[Excerpt: Junior Parker and the Blue Flames, \"You're My Angel\"]\n\nBut after that one single, Parker and his band started recording directly for Sun records.\n\nThe first single they recorded for Sun was a minor hit, but wasn't particularly interesting -- \"Feelin' Good\" was basically a John Lee Hooker knock-off:\n\n[Excerpt: Little Junior's Blue Flames: \"Feelin' Good\"]\n\nBut it's their second single for Sun we want to talk about here, and both sides of it. The A-side of Junior Parker and the Blue Flames' second Sun single is one of the best blues records Sun ever put out, \"Love my Baby\":\n\n[Excerpt: Junior Parker, \"Love My Baby\"]\n\nThat record was one that Sam Phillips -- a man who made a lot of great records -- considered among the greatest he'd ever made. Talking to his biographer Peter Guralnick about it decades later, he said “I mean you tell me a better record that you’ve ever heard,” and Guralnick couldn't.\n\nBut it was the B-side that made an impression. The B-side was a song called \"Mystery Train\".\n\nThat song actually dates back to the old folk song, \"Worried Man Blues\", which was recorded in 1930 by the Carter Family:\n\n[excerpt: \"Worried Man Blues\", the Carter Family]\n\nThe Carter Family were, along with Jimmie Rodgers, the people who defined what country music is. Everyone in country music followed from either the Carters or Rodgers",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode thirty-three of A History of Rock Music in Five Hundred Songs. This one looks at \"Mystery Train\" by Elvis Presley. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThere are many, many books about Elvis Presley out there, but the one I'm using as my major resource for information on him, and which has guided my views as to the kind of person he was, is Last Train to Memphis by Peter Guralnick, generally considered the best biography of him.\n\nI'm also relying heavily on another book by Guralnick -- Sam Phillips: the Man Who Invented Rock and Roll -- for all the episodes dealing with Phillips and Sun Records.\n\nThe Colonel by Alanna Nash is a little more tabloidy than those two, but is the only full-length biography I know of of Colonel Tom Parker.\n\nAll the Sun Records excerpted here -- the ones by ",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}