{
  "id": "yt:video:5Xpx0l6FXJU",
  "yt:videoId": "5Xpx0l6FXJU",
  "yt:channelId": "UCqNpjt_UcMPgm_9gphZgHYA",
  "title": "Gary Vee: The Youth Pastor of Capitalism",
  "link": "",
  "author": {
    "name": "münecat",
    "uri": "https://www.youtube.com/channel/UCqNpjt_UcMPgm_9gphZgHYA"
  },
  "published": "2021-10-28T16:00:02+00:00",
  "updated": "2022-05-17T13:15:29+00:00",
  "media:group": {
    "media:title": "Gary Vee: The Youth Pastor of Capitalism",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Grab the Atlas VPN deal for only $1.39 here: https://atlasv.pn/munecat\n\nToday we're looking at Gary Vee - analysing how he runs his business, makes his money and separates himself from all the 'fake gurus' out there. But is he as legit as he likes to try and make out...?\n\nCheck out my Patreon where I will be covering some extra Gary Vee gossip I found but couldn't fit in this video: https://www.patreon.com/munecat\n\nMerch store: https://teespring.com/en-GB/stores/munecat-store\nInstagram https://www.instagram.com/munecatmusic\nTwitter https://www.twitter.com/munecatmusic\n\nCopy to stroke the YT algo under its chinny chin chin like a little kitten:\n\nGary Vaynerchuk has always been one of those entrepreneur guru type figures on social media, constantly pumping out endless content on TikTok, Instagram, Youtube and Facebook to the younger generations with motivational content for young business wannabes needing inspiration. He's also used the fact that he was an early investor in Facebook and Twitter to market himself as some sort of genius of the digital age. He has also made a couple of accurate predictions, such as Joe Rogan moving to Spotify. But his predictions aren't always correct.\n\nBut he's managed to skirt the same reputation as the likes of Tai Lopez and his ilk of 'contrepreneurs' by not directly and aggressively pushing an expensive course or event. He seems to be very concerned about separating himself from these people, and he makes his money in many other subtle ways, which I discuss in this video. This includes angel investing, in which he can get himself generous equity deals from startups just by simply being Gary Vee. \n\nHe also likely gets a huge chunk, if not most of his income through keynote speeches. He will get paid allegedly up to around $200,000 for a 1 hour keynote. However he doesn't seem to have much of a moral compass around who he makes keynote speeches for. For instance, he has accepted money to make keynote speeches at MLM events and at Success Resources events, at which he gets paid to be the bait to lure people to sit infront of 8 hours of speeches from get rich quick gurus, so his fans who have come to see him get suckered into paying grifters up to $10,000 to become a 'millionaire'.\n\nGary also runs Vaynermedia, which is a marketing agency that targets millennials and Gen Z. Billionaires will invest in this company to ensure it stays afloat because they believe Gary Vaynerchuk is the marketing gateway to the youth because he has positioned himself as this on social media. Gary seems to be underpaying his young workers at Vaynermedia however, and there are plently of accusations of a poor workplace environment there, unpaid overtime and a toxic hustle culture. \n\nGary's message also includes advocating for toxic, over the top work ethic and constantly insinuates that hustling hard is the only thing that matters for getting rich. He also reckons being born poor or in an ethnic minority or being an immigrant or being African American is actually a privilege, because it makes you 'tougher', and that capitalism will rise you up if you're tough enough and just work hard enough.\n\nSources & further reading: https://docs.google.com/document/d/1NlcjdWNHyJXk9bRPe9M8oe9AoJPSRlZ0bX9D7cj2zJY/edit?usp=sharing  \n\nAFFILIATE LINKS\n \nCAMERA EQUIPMENT\nMy camera: https://amzn.to/3BtyOj6\nMy lens: https://amzn.to/3baf7Tg\nMy ringlight: https://amzn.to/3e9D5zZ\nMy teleprompter: https://amzn.to/3bWBTxb\nMy mic: https://amzn.to/3uR6wwQ\nMic mount: https://amzn.to/3e2dx81\nGreen screen: https://amzn.to/2NYssp1\n \nVideos are edited with Adobe Premiere Pro, I also use Photoshop for thumbnails etc.\n \nMUSIC EQUIPMENT\nAbleton Push 2: https://amzn.to/3qhEWoF\nKeyboard: https://amzn.to/3qgmsVE\nAudio Interface: https://amzn.to/3beqs4E\nAbleton Live Suite software: https://amzn.to/3bbfvks\nKomplete 13 Ultimate software: https://amzn.to/3bZahaB\nSoundproofing: https://amzn.to/3uQC5Xv and https://amzn.to/2NW6jHO\nSpeakers: https://amzn.to/3bVJ4Wo\nHeadphones: https://amzn.to/2PwMdo8\n\nTimestamps:\n00:00 Intro\n00:50 The origin story\n11:39 Where does his money come from?\n22:04 Protect your privacy!\n23:46 Vee for Vendetta (against social progress)\n33:15 Endorsing MLMs (The Beachbody Speech) & dodgy companies\n36:46 Vaynermedia's awful employee reviews, opinions on social media\n43:32 Conclusion\n46:19 Song (Flashing Images!)",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}