{
  "title": "Growing Ingredients at Home with Zac Posen and Candice Walker",
  "description": "Whether you’re talking tomatoes or turmeric, homecooks can benefit greatly from growing ingredients at home. And the best part is you don’t need to have a huge yard or a green thumb to do so. Today, Homemade host Martie Duncan is joined by two guests who swear by the ability to throw in a spice or a veggie at a moment’s notice from their own hard work! Acclaimed clothing designer to the stars and former Project Runway judge Zac Posen joins Martie to discuss the similarities between food and fashion, as well as how cooking has been a respite for him away from the glitz and glamour. Then, Allrecipes All-Star Candice Walker stops by to encourage us to forgo the shame and guilt that comes with eating, and she chats about how her mixed heritage influences her culinary palette. \nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "pubDate": "Wed, 28 Jul 2021 09:00:00 -0000",
  "itunes:episodeType": "full",
  "itunes:season": 2,
  "itunes:episode": 21,
  "itunes:author": "Allrecipes",
  "itunes:subtitle": "",
  "itunes:summary": "Whether you’re talking tomatoes or turmeric, homecooks can benefit greatly from growing ingredients at home. And the best part is you don’t need to have a huge yard or a green thumb to do so. Today, Homemade host Martie Duncan is joined by two guests who swear by the ability to throw in a spice or a veggie at a moment’s notice from their own hard work! Acclaimed clothing designer to the stars and former Project Runway judge Zac Posen joins Martie to discuss the similarities between food and fashion, as well as how cooking has been a respite for him away from the glitz and glamour. Then, Allrecipes All-Star Candice Walker stops by to encourage us to forgo the shame and guilt that comes with eating, and she chats about how her mixed heritage influences her culinary palette. \nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "content:encoded": "<p>Whether you’re talking tomatoes or turmeric, homecooks can benefit greatly from growing ingredients at home. And the best part is you don’t need to have a huge yard or a green thumb to do so. Today,<strong> </strong>Homemade host Martie Duncan is joined by two guests who swear by the ability to throw in a spice or a veggie at a moment’s notice from their own hard work! Acclaimed clothing designer to the stars and former Project Runway judge Zac Posen joins Martie to discuss the similarities between food and fashion, as well as how cooking has been a respite for him away from the glitz and glamour. Then, Allrecipes All-Star Candice Walker stops by to encourage us to forgo the shame and guilt that comes with eating, and she chats about how her mixed heritage influences her culinary palette. </p><p> </p><p>Learn more about your ad choices. Visit <a href=\"https://megaphone.fm/adchoices\">megaphone.fm/adchoices</a></p>",
  "itunes:duration": 2763,
  "itunes:explicit": "no",
  "guid": "a88ca6ea-ebec-11eb-aa3b-b3b70d238873",
  "enclosure": ""
}