{
  "id": "yt:video:qJPKVDZy1vU",
  "yt:videoId": "qJPKVDZy1vU",
  "yt:channelId": "UCzJ3EGLJbFcHJJ8r1rNGSJQ",
  "title": "How I became the best Final Fantasy player...",
  "link": "",
  "author": {
    "name": "Pint",
    "uri": "https://www.youtube.com/channel/UCzJ3EGLJbFcHJJ8r1rNGSJQ"
  },
  "published": "2022-10-31T01:59:01+00:00",
  "updated": "2022-11-05T06:21:47+00:00",
  "media:group": {
    "media:title": "How I became the best Final Fantasy player...",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Install Raid for Free ✅ IOS/ANDROID/PC: https://clcr.me/Oct22_Pint and get a special starter pack💥 Available only for the next 30 days\nVisit Halloween event page 🎃👻 https://trickortreat.plarium.com to win a bunch of real-life and in-game prizes 💥 Available only for new users. The event ends on November 5, 2022 at 23:59 pm ET.\nFor the best possible experience make sure to use the desktop version\n\nMeeowww!!!!\n\n💜 FOLLOW MY TWITCH: https://www.twitch.tv/pint\n🔵 FOLLOW MY TWITTER: https://twitter.com/PintLive\n🎓BECOME A PATREON: https://www.patreon.com/PintYoutube \n🔴 JOIN MY DISCORD: https://discord.gg/pint\nSpecial thanks to Quaide, Kaj, Scarlet, and Jub for helpin cooka da pizza (video)\n\n\nFinal fantasy 14 is a video game with emet selch and thancred and minfilia and alphinaud and hydaelyn and zodiark and hot zenos man. The world of warcraft wow game is also a game. The MMO of game is funny game final fantasy 14 ffxiv riot games mmo also hi marta svetek voice of roxy from five nights at freddys im so sorry its late. Ultimate legend uwu prog parse yoshi P. 6.3 patch idk keywords is this even real? does this even work? im so lonely. meowww~~ :3\n\n\nRaid Shadow Legends PRIZE PROMOTION TRICK OR TREAT. NO PURCHASE NECESSARY TO ENTER OR TO WIN A PRIZE. A PURCHASE DOES NOT IMPROVE YOUR CHANCES OF WINNING.\nEntry is Open to legal residents of THE 50 UNITED STATES AND THE DISTRICT OF COLUMBIA (EXCLUDING NEW YORK AND FLORIDA), who are 18 years or older. VOID WHERE PROHIBITED. Open only to RAID users with valid Raid Player ID. Promotion Period: 15.10 at 00:00 UTC – 05.11 at 23:59 UTC. Sponsor: Plarium Global Ltd.  Administrator:  JMG Brands & Talents GmbH. The Official Rules and Privacy Policy set forth here [trickortreat.plarium.com].",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}