{
  "guid": "urn:uuid:7d3b2d98-ebd0-4f50-ad09-b0c351bae115",
  "link": "https://www.who.int/news/item/28-10-2022-on-world-cities-day-2022--who-calls-on-countries-to--act-local-to-go-global",
  "a10:author": {
    "a10:name": ""
  },
  "title": "On World Cities Day 2022, WHO calls on countries to “Act Local to Go Global”",
  "description": "<p>By 2050, nearly 7 out of 10 people globally will live in cities and other urban settings. While cities face many health challenges, on World Cities Day 2022 WHO and partners examine how city leaders are uniquely positioned to understand local needs and respond rapidly to changing conditions to safeguard health. <br /></p><p>Although living in cities brings many advantages, rapid and unplanned urbanization can have negative social and environmental health impacts. These include not only issues linked to climate change, pandemics and noncommunicable diseases, but also to malaria and other vector-borne diseases. While the burden of malaria is currently still higher in rural areas, current trends in urbanization mean that in a few years most people living in malaria-endemic countries will reside in urban areas.<em> </em><br /></p><p>In this regard, and on the occasion of World Cities Day 2022, WHO and UN Habitat have produced the <em>Global f</em><em>ramework for the response to malaria in urban areas</em>. The Framework provides guidance to city government officials, health professionals and urban planners for a comprehensive malaria response specifically in urban areas, where the dynamics of transmission and burden of vector-borne diseases can be different from that of rural areas. The Framework acknowledges that the global fight against malaria and other vector-borne diseases requires strong action from local governments, in areas such as health, housing and infrastructure.<br /></p><p>&ldquo;By offering specific guidance to local officials, this new Framework can help ensure that malaria control forms an integral part of the broader urban planning, policy-making and budgeting processes,&rdquo; explains Dr Abdisalan Noor, Head of the Strategic Information for Response Unit in the WHO Global Malaria Programme. &ldquo;For each urban context, the strategic use of data can inform effective, tailored responses and help build resilience against the threat of malaria and other vector-borne diseases.&rdquo;<br /></p><p>On World Cities Day 2022, WHO is also launching the <em>Urban health research agenda</em>, a comprehensive strategy to help cities build better evidence around what works to address urban health challenges. The agenda calls for building evidence on the environmental, economic and social impacts of urban health policies, so that they can be addressed through a coordinated approach that involves the different sectors working together to improve the health of their residents. <br /></p><p>&ldquo;We desperately need to get ahead of the challenges that are impacting the health and well-being of people living in cities,&rdquo; notes Dr Etienne Krug, Director of the Department of Social Determinants of Health at WHO. &ldquo;Strong urban policies must prioritize health, to ensure resilient and vibrant communities for people to live, work, go to school and play, all while protecting those who are most vulnerable.&rdquo;<br /></p><p>Urban health is a growing priority for WHO, which addresses the issue in multiple cross-cutting ways, such as better air quality, a safe water supply and improved sanitation; healthy urban planning; smoke-free environments; road safety; prevention of violence and injuries; healthy food systems and diets; environmental management of vector-borne diseases; and preparedness for health and humanitarian emergencies. Addressing the needs of specific population groups, such as children and older people and migrants, is also a priority.&nbsp;The interlinked nature of urban health challenges means that action in one sector can have benefits for many others.<br /></p><p>To help Member States address the above priorities, WHO is supporting the strengthening of the evidence base to allow policy-makers to make informed decisions when addressing health risks. We provide tools and guidance on what works and support monitoring of key health-related indicators. In addition, we lead and engage in partnership activities that foster city-to-city exchanges and help develop institutional and policy frameworks for good governance for health and well-being in cities.&nbsp;</p>",
  "pubDate": "Fri, 28 Oct 2022 08:59:26 Z"
}