{
  "title": "North Korea fired intercontinental ballistic missile – Seoul",
  "link": "https://www.rt.com/news/565844-north-korea-icbm-launch/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565844-north-korea-icbm-launch/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63634c4185f54005914ce3f9.jpg\" /> North Korea fired an intercontinental ballistic missile in a show of force against US-South Korean drills, Seoul’s military has said <br/><a href=\"https://www.rt.com/news/565844-north-korea-icbm-launch/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The launch failed during the second-stage separation, a South Korean military official told Yonhap</strong></p>\n            \n                        \n            <p>North Korea has launched an intercontinental ballistic missile (ICBM) as part of a large-scale show of force against the ongoing war games between the US and South Korea, according to Seoul&rsquo;s armed forces.</p>\n<p><strong></strong>The South Korean Joint Chiefs of Staff <a href=\"https://en.yna.co.kr/view/AEN20221005004354325?section=nk/nk\" target=\"_blank\" rel=\"noopener noreferrer\">said</a> the military detected <em>&ldquo;what is presumed to be a long-range ballistic missile launch from the Sunan area in Pyongyang&rdquo;</em> early on Thursday morning, noting that two additional short-range missiles followed about one hour later.&nbsp;</p>\n<p>After analyzing details of the launch, the military <a href=\"https://en.yna.co.kr/view/AEN20221005004356325\" target=\"_blank\" rel=\"noopener noreferrer\">added</a> that the weapon traveled a distance of around 760km (472 miles) and reached a top speed of Mach 15. However, a defense source later told Yonhap that <em>&ldquo;the missile seems to have failed in normal flight&rdquo;</em> after its second-stage separation.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6360a36f2030274d80227d7d.jpg\" alt=\"FILE PHOTO: North Korean flags are carried during a celebration of the nation&#039;s 73rd founding anniversary in Pyongyang, North Korea, September 9, 2021.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565703-north-korea-nuclear-plans/\">North Korea claims US has put ‘nuclear script’ into ‘final Stage’</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>In a statement later on Thursday, the Joint Chiefs said <em>&ldquo;Our military has beefed up surveillance and vigilance&rdquo;</em> and would maintain a <em>&ldquo;readiness posture in close cooperation with the US.&rdquo;</em></p>\n<p><strong></strong>Thursday&rsquo;s launch marks the first time Pyongyang has fired an ICBM since May, though it comes amid a record number of missile tests overall this year. The DPRK has also unleashed hundreds of rockets, missiles, and artillery shells into the sea in recent days as a demonstration to Washington and Seoul, which are in the middle of some of their <a href=\"https://www.rt.com/news/565634-south-korea-us-air-exercises/\" target=\"_blank\" rel=\"noopener noreferrer\">largest&nbsp;air drills ever</a>.&nbsp;</p>\n<p><strong></strong>With tensions soaring on the peninsula, the North has repeatedly condemned the exercises as a rehearsal for a full-scale invasion, even suggesting earlier this week that Washington could be preparing a nuclear attack. The US and South Korea, meanwhile, have denounced each missile launch by Pyongyang as a dangerous provocation and have vowed to continue strengthening military ties.</p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 05:08:48 +0000",
  "dc:creator": "RT"
}