{
  "id": "https://bibleinoneyear.org/en/youth/228",
  "title": "Day 228: How to Raise Your Game",
  "description": "Proverbs 20:5-7,9, 2 Chronicles 6:7–10,12a,13b–14,21, 1 Corinthians 11:23-24,31-33, 11:1. There is no greater example in human history than the example of Christ  Paul writes, ‘Follow *my* example, as *I follow the example of Christ*’ (1 Corinthians 11:1)",
  "pubDate": "Mon, 16 Aug 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/228/?ignore",
  "itunes:duration": "13:34",
  "guid": "enyouth16082021-228",
  "length": 814.24,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 228: How to Raise Your Game",
  "itunes:subtitle": "Proverbs 20:5-7,9, 2 Chronicles 6:7–10,12a,13b–14,21, 1 Corinthians 11:23-24,31-33, 11:1. There is no greater example in human history than the example of Christ  Paul writes, ‘Follow *my* example, as *I follow the example of Christ*’ (1 Corinthians 11:1)",
  "itunes:summary": "Some of the world’s top squash players used to practise at the club where I played. I remember well the first time I saw at close hand a high-level game. It was the son of one of our regular group of players. At the time, he was ranked number 11 in the world. He came to practise at our club with the world number 2.\nWe all watched in amazement. We had never seen anything like it. In fact, if that was ‘squash’, what we played should be called something else!\nWatching them always raised our game. Suddenly we realised that it was possible to return practically any shot your opponent could serve you, however good they were. We saw how important it was to get back to the middle of the court after each shot. We watched how deep they hit the ball. We noticed the shots that they avoided playing.\nWhen we went on court after that, we astonished ourselves by how well we played. Of course, we did not play anywhere near as well as them. But, inspired by their example, we played a whole lot better than usual.\nDuring my Christian life, I have found the same pattern. For example, I had the privilege of working for Sandy Millar for nineteen years. Through watching his life and hearing him preach, I was always inspired by his example. Even though reaching the level of those who are examples to us might not be possible, hopefully it inspires us to raise our game.\nA Christian is someone who believes in Jesus, puts their faith in him, knows him and lives ‘in Christ’. It is also someone who follows his example.\nThere is no greater example in human history than the example of Christ. Paul writes, ‘Follow my example, as I follow the example of Christ’ (1 Corinthians 11:1).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 228
}