{
  "title": "Luchidor Cigars: Pre-release inside the Diamond Crown Cigar Lounge",
  "itunes:title": "Luchidor Cigars: Pre-release inside the Diamond Crown Cigar Lounge",
  "link": "https://thecigarauthority.podbean.com/e/luchidor-cigars-pre-release-inside-the-diamond-crown-cigar-lounge/",
  "comments": "https://thecigarauthority.podbean.com/e/luchidor-cigars-pre-release-inside-the-diamond-crown-cigar-lounge/#comments",
  "pubDate": "Sat, 03 May 2014 14:52:29 -0400",
  "guid": "http://thecigarauthority.podbean.com/e/luchidor-cigars-pre-release-inside-the-diamond-crown-cigar-lounge/",
  "description": "This week on The Cigar Authority it's the world premier of the pre-release of the Luchidor Cigars live inside the Diamond Crown Cigar Lounge at Two Guys Smoke Shop in Nashua, NH. We light up the JC Newman Julius Caesar 1885 Perfecto cigar, and the all new Luchidor by Leccia Tabacco.                      \n",
  "content:encoded": "This week on The Cigar Authority it's the world premier of the pre-release of the Luchidor Cigars live inside the Diamond Crown Cigar Lounge at Two Guys Smoke Shop in Nashua, NH. We light up the JC Newman Julius Caesar 1885 Perfecto cigar, and the all new Luchidor by Leccia Tabacco.                      \n",
  "enclosure": "",
  "itunes:subtitle": "This week on The Cigar Authority it's the world premier of the pre-release of the Luchidor Cigars live inside the Diamond Crown Cigar Lounge at Two Guys Smoke Shop in Nashua, NH. We light up the JC Newman Julius Caesar 1885 Perfecto cigar, and the all ne...",
  "itunes:summary": "THE CIGAR AUTHORITY (TCA) is a weekly CIGAR PODCAST featuring guest interviews from tobacco growers, cigar makers and manufacturers, CIGAR NEWS and CIGAR REVIEWS. Join TCA for the longest lasting cigar podcast, voted The Ambassadors of Cigars by Cigar Journal Magazine, Voted the Top 10 Educational Podcasts by Podbean 4 years in a row and the most Listened to Cigar Podcast in the World and on the Internet. For you, THE CIGAR AUTHORITY, The Authority on everything Cigars. Listen to The Cigar Authority before you spend your good money on what could be a bad cigar or a great cigar. Whether you’re an amateur, a newbie, or a Cigar Aficionado you’ll learn something on every episode. Be sure to check out the TCA Daily Blog on www.TheCIgarAuthority.com, CIGAR RADIO at its finest and a proud member of The United Podcast Network.",
  "itunes:author": "United Podcast Network",
  "itunes:explicit": "yes",
  "itunes:block": "No",
  "itunes:duration": "01:58:56",
  "itunes:image": ""
}