{
  "title": "Episode 113: &#8220;Needles and Pins&#8221; by The Searchers",
  "link": "https://500songs.com/podcast/episode-113-needles-and-pins-by-the-searchers/",
  "pubDate": "Mon, 08 Feb 2021 00:50:24 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-113-needles-and-pins-by-the-searchers/",
  "description": "This week's episode looks at \"Needles and Pins\", and the story of the second-greatest band to come out of Liverpool in the sixties, The Searchers. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a sixteen-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/47258892\">\"Farmer John\" by Don and Dewey</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nNo Mixcloud this week, as there are too many recordings by the Searchers.\n\nMy two main resources for this episode have been the autobiographies of members of the group -- Frank Allen's&nbsp;<a href=\"https://amzn.to/3cPw6LT\"><em>The Searchers and Me</em> </a>and Mike Pender's&nbsp;<em><a href=\"https://amzn.to/3pYojz3\">The Search For Myself.</a>&nbsp;</em>\n\nAll the Searchers tracks and Tony Jackson or Chris Curtis solo recordings excerpted here, except the live excerpt of \"What'd I Say\", can be found on <a href=\"https://amzn.to/36StuZR\">this box set</a>, which is out of print as a physical box, but still available digitally. For those who want a good budget alternative, though,<a href=\"https://amzn.to/3oWarnB\"> this double-CD set </a>contains fifty Searchers tracks, including all their hits, for under three pounds.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nLast week we had a look at the biggest group ever to come out of Liverpool, and indeed the biggest group ever to play rock and roll music. But the Beatles weren't the only influential band on the Merseybeat scene, and while we won't have much chance to look at Merseybeat in general, we should at least briefly touch on the other bands from the scene. So today we're going to look at a band who developed a distinctive sound that would go on to be massively influential, even though they're rarely cited as an influence in the way some of their contemporaries are. We're going to look at The Searchers, and \"Needles and Pins\":\n\n[Excerpt: The Searchers, \"Needles and Pins\"]\n\nThe story of the early origins of the Searchers is, like everything about the Searchers, the subject of a great deal of dispute. The two surviving original members of the group, John McNally and Mike Pender, haven't spoken to each other in thirty-six years, and didn't get on for many years before that, and there have been several legal disputes between them over the years. As a result, literally everything about the group's history has become a battlefield in their ongoing arguments.\n\nAccording to a book by Frank Allen, the group's bass player from 1964 on and someone who took McNally's side in the split and subsequent legal problems, McNally formed a skiffle group, which Mike Pender later joined, and was later joined first by Tony Jackson and then by a drummer then known as Chris Crummey, but who changed his name to the more euphonic Chris Curtis.\n\nAccording to Pender, he never liked skiffle, never played skiffle, and \"if McNally had a skiffle group, it must have been before I met him\". He is very insistent on this point -- he liked country music, and later rock and roll, but never liked skiffle. According to him, he and McNally got together and formed a group that was definitely absolutely not in any way a skiffle group and wasn't led by McNally but was formed by both of them. That group split up, and then Pender became friends with Tony Jackson -- and he's very insistent that he became friends with Jackson during &nbsp;a period when he didn't know McNally -- and the group reformed around the three of them, when McNally and Pender got back in touch.\n\nThe origin of the group's name is similarly disputed. Everyone agrees that it came from the John Wayne film The Searchers -- the same film which had inspired the group's hero Buddy Holly to write \"That'll Be The Day\" -- but there is disagreement as to whose idea the name was. Pender claims that it was his idea, while McNally says that the name was coined by a singer named \"Big Ron\", who sang with the band for a bit before disappearing into obscurity.\n\nBig Ron's replacement was a singer named Billy Beck, who at the time he was with the Searchers used the stage name Johnny Sandon (though he later reverted to his birth name). The group performed as Johnny Sandon and The Searchers for two years, before Sandon quit the group to join the Remo Four, a group that was managed by Brian Epstein. Sandon made some records with the Remo Four in 1963, but they went nowhere, but they'll give some idea of how Sandon sounded:\n\n[Excerpt: Johnny Sandon and the Remo Four, \"Lies\"]\n\nThe Remo Four later moved on to back Tommy Quickly, who we heard last week singing a song the Beatles wrote for him.\n\nWith Sandon out of the picture, the group had no lead singer or frontman, and were in trouble -- they were known around Liverpool as Johnny Sandon's backing group, not as a group in their own right. They started splitting the lead vocals between themselves, but with Tony Jackson taking most of them. And, in a move which made them stand out, Chris Curtis moved his drum kit to the front line, started playing standing up, and became the group's front-man and second lead singer.\n\nEven at this point, though, there seemed to be cracks in the group. The Searchers were the most clean-living of the Liverpool bands -- they were all devout Catholics who would go to Mass every Sunday without fail, and seem to have never indulged in most of the vices that pretty much every other rock star indulged in. But Curtis and Jackson were far less so than Pender and McNally -- Jackson in particular was a very heavy drinker and known to get very aggressive when drunk, while Curtis was known as eccentric in other ways -- he seems to have had some sort of mental illness, though no-one's ever spoken about a diagnosis -- the Beatles apparently referred to him as \"Mad Henry\".\n\nCurtis and Jackson didn't get on with each other, and while Jackson started out as a close friend of Pender's, the two soon drifted apart, and by the time of their first recording sessions they appeared to most people to be a group of three plus one outsider, with Jackson not getting on well with any of the others.\n\nThere was also a split in the band's musical tastes, but that would be the split that would drive much of their creativity. Pender and McNally were drawn towards softer music -- country and rockabilly, the Everly Brothers and Buddy Holly -- while Jackson preferred harder, stomping, music. But it was Chris Curtis who took charge of the group's repertoire, and who was the group's unofficial leader. While the other band members had fairly mainstream musical tastes, it was Curtis who would seek out obscure R&B B-sides that he thought the group could make their own, by artists like The Clovers and Richie Barrett -- while many Liverpool groups played Barrett's \"Some Other Guy\", the Searchers would also play the B-side to that, \"Tricky Dicky\", a song written by Leiber and Stoller. Curtis also liked quite a bit of folk music, and would also get the group to perform songs by Joan Baez and Peter, Paul, and Mary.\n\nThe result of this combination of material and performers was that the Searchers ended up with a repertoire rooted in R&B, and a heavy rhythm section, but with strong harmony vocals inspired more by the Everlys than by the soul groups that were inspiring the other groups around Liverpool. Other than the Beatles, the Searchers were the best harmony group in Liverpool, and were the only other one to have multiple strong lead vocalists.\n\nLike the Beatles, the Searchers went off to play at the Star Club in Hamburg in 1962. Recordings were made of their performances there, and their live version of Brenda Lee's \"Sweet Nothin's\" later got released as a single after they became successful:\n\n[Excerpt: The Searchers, \"Sweet Nothin's\"]\n\nEven as every talent scout in the country seemed to be turning up in Liverpool, and even bands from nearby Manchester were getting signed up in the hope of repeating the Beatles' success, the Searchers were having no luck getting any attention from the London music industry. In part that was because of one bit of bad luck -- the day that Brian Epstein turned up to see them, with the thought of maybe managing them, Tony Jackson was drunk and fell off the stage, and Epstein decided that he was going to give them a miss.\n\nAs no talent scouts were coming to see them, they decided that they would record a demo session at the Iron Door, the club they regularly played, and send that out to A&R people. That demo session produced a full short album, which shows them at their stompiest and hardest-driving. Most of the Merseybeat bands sounded much more powerful in their earlier live performances than in the studio, and the Searchers were no exception, and it's interesting to compare the sound of these recordings to the studio ones from only a few months later:\n\n[Excerpt: The Searchers, \"Let's Stomp\"]\n\nThe group eventually signed to Pye Records. Pye was the third or fourth biggest record label in Britain at the time, but that was a relative matter -- EMI and Decca between them had something like eighty-five percent of the market, and basically *were* the record industry in Britain at the time. Pye was chronically underfunded, and when they signed an artist who managed to have any success, they would tend to push that artist to keep producing as many singles as possible, chasing trends, rather than investing in their long-term career survival.\n\nThat said, they did have some big acts, most notably Petula Clark -- indeed the company had been formed from the merger of two other companies, one of which had been formed specifically to issue Clark's records. Clark was yet to have her big breakthrough hit in the USA, but she'd had several big hits in the UK, including the number one hit \"Sailor\":\n\n[Excerpt: Petula Clark, \"Sailor\"]\n\nThe co-producer on that track had been Tony Hatch, a songwriter and producer who would go on to write and produce almost all of Clark's hit records. Hatch had a track record of hits -- we've heard several songs he was involved in over the course of the series. Most recently, we heard last week how \"She Loves You\" was inspired by \"Forget Him\", which Hatch wrote and produced for Bobby Rydell:\n\n[Excerpt: Bobby Rydell, \"Forget Him\"]\n\nHatch heard the group's demo, and was impressed, and offered to sign them. The Searchers' manager at the time agreed, on one condition -- that Hatch also sign another band he managed, The Undertakers. Astonishingly, Hatch agreed, and so the Undertakers also got a record contract, and released several flop singles produced by Hatch, including this cover version of a Coasters tune:\n\n[Excerpt: The Undertakers, \"What About Us?\"]\n\nThe biggest mark that the Undertakers would make on music would come many years later, when their lead singer Jackie Lomax would release a solo single, \"Sour Milk Sea\", which George Harrison wrote for him.\n\nThe Searchers, on the other hand, made their mark immediately. The group's first single was a cover version of a song written by Doc Pomus and Mort Shuman, which had been a top twenty hit in the US for the Drifters a couple of years earlier:\n\n[Excerpt: The Drifters, \"Sweets For My Sweet\"]\n\nThat had become a regular fixture in the Searchers' live set, with Tony Jackson singing lead and Chris Curtis singing the high backing vocal part in falsetto. In much the same way that the Beatles had done with \"Twist and Shout\", they'd flattened out the original record's Latin cha-cha-cha rhythm into a more straightforward thumping rocker for their live performances, as you can hear on their original demo version from the Iron Door sessions:\n\n[Excerpt: The Searchers, \"Sweets For My Sweet (live at the Iron Door)\"]\n\nAs you can hear, they'd also misheard a chunk of the lyrics, and so instead of \"your tasty kiss\", Jackson sang \"Your first sweet kiss\".\n\nIn the studio, they slowed the song down very slightly, and brought up the harmony vocal from Pender on the choruses, which on the demo he seems to have been singing off-mic. The result was an obvious hit:\n\n[Excerpt: The Searchers, \"Sweets For My Sweet\"]\n\nThat went to number one, helped by an endorsement from John Lennon, who said it was the best record to come out of Liverpool, and launched the Searchers into the very top tier of Liverpool groups, their only real competition being the Beatles and Gerry and the Pacemakers -- and though nobody could have known it at the time, the Pacemakers' career had already peaked at this point.\n\nTheir first album, Meet The Searchers, featured \"Sweets For My Sweet\", along with a selection of songs that mixed the standard repertoire of every Merseybeat band -- \"Money\", \"Da Doo Ron Ron\", \"Twist and Shout\", \"Stand By Me\", and the Everly Brothers' \"Since You Broke My Heart\", with more obscure songs like \"Ain't Gonna Kiss Ya\", by the then-unknown P.J. Proby, \"Farmer John\" by Don and Dewey, which hadn't yet become a garage-rock standard (and indeed seems to have become so largely because of the Searchers' version), and a cover of \"Love Potion #9\", a song that Leiber and Stoller had written for the Clovers, which was not released as a single in the UK, but later became their biggest hit in the US (and a quick content note for this one -- the lyric contains a word for Romani people which many of those people regard as a slur):\n\n[Excerpt: The Searchers, \"Love Potion #9\"]\n\nTheir second single was an attempt to repeat the \"Sweets For My Sweet\" formula, and was written by Tony Hatch, although the group didn't know that at the time. Hatch, like many producers of the time, was used to getting his artists to record his own songs, written under pseudonyms so the record label didn't necessarily realise this was what he was doing. In this case he brought the group a song that he claimed had been written by one \"Fred Nightingale\", and which he thought would be perfect for them. The song in question, \"Sugar and Spice\", was a blatant rip-off of \"Sweets For My Sweet\", and recorded in a near-identical arrangement:\n\n[Excerpt: The Searchers, \"Sugar and Spice\"]\n\nThe group weren't keen on the song, and got very angry later on when they realised that Tony Hatch had lied to them about its origins, but the record was almost as big a hit as the first one, peaking at number two on the charts.\n\nBut it was their third single that was the group's international breakthrough, and which both established a whole new musical style and caused the first big rift in the group.\n\nThe song chosen for that third single was one they learned in Hamburg, from Cliff Bennett and the Rebel Rousers, a London group who had recorded a few singles with Joe Meek, like \"You Got What I Like\":\n\n[Excerpt: Cliff Bennett and the Rebel Rousers, \"You Got What I Like\"]\n\nThe Rebel Rousers had picked up on a record by Jackie DeShannon, a singer-songwriter who had started up a writing partnership with Sharon Sheeley, the writer who had been Eddie Cochran's girlfriend and in the fatal car crash with him. The record they'd started covering live, though, was not one that DeShannon was the credited songwriter on. \"Needles and Pins\" was credited to two other writers, both of them associated with Phil Spector.\n\nSonny Bono was a young songwriter who had written songs at Specialty Records for people like Sam Cooke, Larry Williams, and Don and Dewey, and his most famous song up to this point was \"She Said Yeah\", the B-side to Williams' \"Bad Boy\":\n\n[Excerpt: Larry Williams, \"She Said Yeah\"]\n\nAfter working at Specialty, he'd gone on to work as Phil Spector's assistant, doing most of the hands-on work in the studio while Spector sat in the control room. While working with Spector he'd got to know Jack Nitzsche, who did most of the arrangements for Spector, and who had also had hits on his own like \"The Lonely Surfer\":\n\n[Excerpt: Jack Nitzsche, \"The Lonely Surfer\"]\n\nBono and Nitzsche are the credited writers on \"Needles and Pins\", but Jackie DeShannon insists that she co-wrote the song with them, but her name was left off the credits. I tend to believe her -- both Nitzsche and Bono were, like their boss, abusive misogynist egomaniacs, and it's easy to see them leaving her name off the credits. Either way, DeShannon recorded the song in early 1963, backed by members of the Wrecking Crew, and it scraped into the lower reaches of the US Hot One Hundred, though it actually made number one in Canada:\n\n[Excerpt: Jackie DeShannon, \"Needles and Pins\"]\n\nCliff Bennett and the Rebel Rousers had been covering that song, and Chris Curtis picked up on it as an obvious hit. The group reshaped the song, and fixed the main flaw with DeShannon's original.\n\nThere's really only about ninety seconds' worth of actual song in \"Needles and Pins\", and DeShannon's version ends with a minute or so of vamping -- it sounds like it's still a written lyric, but it's full of placeholders where entire lines are \"whoa-oh\", the kind of thing that someone like Otis Redding could make sound great, but that didn't really work for her record.\n\nThe Searchers tightened the song up and altered its dynamics -- instead of the middle eight leading to a long freeform section, they started the song with Mike Pender singing solo, and then on the middle eight they added a high harmony from Curtis, then just repeated the first verse and chorus, in the new key of C sharp, with Curtis harmonising this time:\n\n[Excerpt: The Searchers, \"Needles and Pins\" (middle eight on)]\n\nThe addition of the harmony gives the song some much-needed dynamic variation not present in DeShannon's version, while repeating the original verse after the key change, and adding in Curtis' high harmony, gives it an obsessive quality. The protagonist here is spiralling – he keeps thinking the same things over and over, at a higher and higher pitch, getting more and more desperate. It's a simple change, but one that improves the song immensely.\n\nIncidentally, one thing I should note here because it's not something I normally do -- in these excerpts of the Searchers' version of \"Needles and Pins\", I'm actually modifying the recording slightly. The mix used for the original single version of the song, which is what I'm excerpting here, is marred by an incredibly squeaky bass pedal on Chris Curtis' drumkit, which isn't particularly audible if you're listening to it on early sixties equipment, which had little dynamic range, but which on modern digital copies of the track overpowers everything else, to the point that the record sounds like that Monty Python sketch where someone plays a tune by hitting mice with hammers.\n\nHere's a couple of seconds of the unmodified track, so you can see what I mean:\n\n[Excerpt: The Searchers, \"Needles and Pins\"]\n\nMost hits compilations have a stereo mix of the song, and have EQ'd it so that the squeaky bass pedal isn't noticeable, but I try wherever possible to use the mixes that people were actually listening to at the time, so I've compromised and used the mono mix but got rid of the squeaky frequencies, so you can hear the music I'm talking about rather than being distracted by the squeaks.\n\nAnyway, leaving the issue of nobody telling Chris Curtis to oil his pedals aside, the change in the structure of the song turned it from something a little baggy and aimless into a tight two-and-a-half minute pop song, but the other major change they made was emphasising the riff, and in doing so they inadvertently invented a whole new genre of music.\n\nThe riff in DeShannon's version is there, but it's just one element -- an acoustic guitar strumming through the chords. It's a good, simple, play-in-a-day riff -- you basically hold a chord down and then move a single finger at a time and you can get that riff -- and it's the backbone of the song, but there's also a piano, and horns, and the Blossoms singing:\n\n[Excerpt: Jackie DeShannon, \"Needles and Pins\"]\n\nBut what the Searchers did was to take the riff and play it simultaneously on two electric guitars, and then added reverb. They also played the first part of the song in A, rather than the key of C which DeShannon's version starts in, which allowed the open strings to ring out more. The result came out sounding like an electric twelve-string, and soon both they and the Beatles would be regularly using twelve-string Rickenbackers to get the same sound:\n\n[Excerpt: The Searchers, \"Needles and Pins\"]\n\nThat record is the root of jangle-pop and folk-rock. That combination of jangling, reverb-heavy, trebly guitars and Everly Brothers inspired harmonies is one that leads directly to the Byrds, Love, Big Star, Tom Petty, REM, the Smiths, and the Bangles, among many others. While the Beatles were overall obviously the more influential group by a long way, \"Needles and Pins\" has a reasonable claim to be the most influential single track from the Merseybeat era.\n\nIt went to number one in the UK, and became the group's breakthrough hit in the US, reaching number sixteen. The follow-up, \"Don't Throw Your Love Away\", a cover of a B-side by the Orlons, again featuring Pender on lead vocals and Curtis on harmonies, also made number one in the UK and the US top twenty, giving them a third number one out of four singles. But the next single, \"Someday We're Gonna Love Again\", a cover of a Barbara Lewis song, only made number eleven, and caused journalists to worry if the Searchers had lost their touch. There was even some talk in the newspapers that Mike Pender might leave the group and start a solo career, which he denied.\n\nAs it turned out, one of the group's members was going to leave, but it wasn't Mike Pender. Tony Jackson had sung lead on the first two singles, and on the majority of the tracks on the first album, and he thus regarded himself as the group's lead singer. With Pender taking over the lead on the more recent hit singles, Jackson was being edged aside. By the third album, It's The Searchers, which included \"Needles and Pins\", Jackson was the only group member not to get a solo lead vocal -- even John McNally got one, while Jackson's only lead was an Everlys style close harmony with Mike Pender. Everything else was being sung by Pender or Curtis.\n\nJackson was also getting involved in personality conflicts with the other band members -- at one point it actually got to the point that he and Pender had a fistfight on stage.\n\nJackson was also not entirely keen on the group's move towards more melodic material. It's important to remember that the Searchers had started out as an aggressive, loud, R&B band, and they still often sounded like that on stage -- listen for example to their performance of \"What'd I Say\" at the NME poll-winners' party in April 1964, with Chris Curtis on lead vocals clearly showing why he had a reputation for eccentricity:\n\n[Excerpt: The Searchers, \"What'd I Say (live)\"]\n\nThe combination of these musical differences and his feelings about having his place usurped meant that Jackson was increasingly getting annoyed at the other three band members. Eventually he left the group -- whether he was fired or quit depends on which version of the story you read -- and was replaced by Frank Allen of Cliff Bennett and the Rebel Rousers.\n\nJackson didn't take this replacement well, and publicly went round telling people that he had been pushed out of the band so that Curtis could get his boyfriend into the band, and there are some innuendoes to this effect in Mike Pender's autobiography -- although Allen denies that he and Curtis were in a relationship, and says that he doesn't actually know what Curtis' sexuality was, because they never discussed that kind of thing, and presumably Allen would know better than anyone else whether he was in a relationship with Curtis.\n\nCurtis is widely described as having been gay or bi by his contemporaries, but if he was he never came out publicly, possibly due to his strong religious views. There's some suggestion, indeed, that one reason Jackson ended up out of the band was that he blackmailed the band, saying that he would publicly out Curtis if he didn't get more lead vocals.\n\nWhatever the truth, Jackson left the group, and his first solo single, \"Bye Bye Baby\", made number thirty-eight on the charts:\n\n[Excerpt: Tony Jackson and the Vibrations, \"Bye Bye Baby\"]\n\nHowever, his later singles had no success -- he was soon rerecording \"Love Potion Number Nine\" in the hope that that would be a UK chart success as it had been in the US:\n\n[Excerpt: Tony Jackson and the Vibrations, \"Love Potion Number Nine\"]\n\nMeanwhile, Allen was fitting in well with his new group, and it appeared at first that the group's run of hits would carry on uninterrupted without Jackson. The first single by the new lineup, \"When You Walk In The Room\", was a cover of another Jackie DeShannon song, this time written by DeShannon on her own, and originally released as a B-side:\n\n[Excerpt: Jackie DeShannon, \"When You Walk In The Room\"]\n\nThe Searchers rearranged that, once again emphasising the riff from DeShannon's original, and by this time playing it on real twelve-strings, and adding extra compression to them. Their version featured a joint lead vocal by Pender and Allen:\n\n[Excerpt: The Searchers, \"When You Walk In the Room\"]\n\nDo you think the Byrds might have heard that?\n\nThat went to number three on the charts. The next single was less successful, only making number thirteen, but was interesting in other ways -- from the start, as well as their R&B covers, Curtis had been adding folk songs to the group's repertoire, and there'd been one or two covers of songs like \"Where Have All the Flowers Gone?\" on their albums, but \"What Have They Done to the Rain?\" was the first one to become a single.\n\nIt was written by Malvina Reynolds, who was a socialist activist who only became a songwriter in her early fifties, and who also wrote \"Morningtown Ride\" and \"Little Boxes\". \"What Have They Done to The Rain?\" was a song written to oppose nuclear weapons testing, and Curtis had learned it from a Joan Baez album. Even though it wasn't as big a success as some of their other hits, given how utterly different it was from their normal style, and how controversial the subject was, getting it into the top twenty at all seems quite an achievement.\n\n[Excerpt: The Searchers, “What Have They Done To The Rain?”]\n\nTheir next single, \"Goodbye My Love\", was their last top ten hit, and the next few singles only made the top forty, even when the Rolling Stones gave them \"Take It Or Leave It\". The other group members started to get annoyed at Curtis, who they thought had lost his touch at picking songs, and whose behaviour had become increasingly erratic. Eventually, on an Australian tour, they took his supply of uppers and downers, which he had been using as much to self-medicate as for enjoyment as far as I can tell, and flushed them down the toilet. When they got back to the UK, Curtis was out of the group.\n\nTheir first single after Curtis' departure, \"Have You Ever Loved Somebody\", was given to them by the Hollies, who had originally written it as an Everly Brothers album track:\n\n[Excerpt: The Searchers, \"Have You Ever Loved Somebody\"]\n\nUnfortunately for the Searchers, Chris Curtis had also heard the song, decided it was a likely hit, and had produced a rival version for Paul and Barry Ryan, which got rushed out to compete with it:\n\n[Excerpt: Paul and Barry Ryan, \"Have You Ever Loved Somebody\"]\n\nNeither single made the top forty, and the Searchers would never have a hit single again. Nor would Curtis. Curtis only released one solo single, \"Aggravation\", a cover of a Joe South song:\n\n[Excerpt: Chris Curtis, \"Aggravation\"]\n\nThe musicians on that included Jimmy Page, John Paul Jones, and Joe Moretti, but it didn't chart. Curtis then tried to form a band, which he named Roundabout, based on the concept that musicians could hop on or hop off at any point, with Curtis as the only constant member. The guitarist and keyboard player quickly decided that it would be more convenient for them if Curtis was the one to hop off, and without Curtis Jon Lord and Richie Blackmore went on to form Deep Purple.\n\nThe Searchers didn't put out another album for six years after Curtis left. They kept putting out singles on various labels, but nothing came close to charting. Their one album between 1966 and 1979 was a collection of rerecordings of their old hits, in 1972. But then in 1979 Seymour Stein, the owner of Sire Records, a label which was having success with groups like the Ramones, Talking Heads, and the Pretenders, was inspired by the Ramones covering \"Needles and Pins\" to sign the Searchers to a two-album deal, which produced records that fit perfectly into the late seventies New Wave pop landscape, while still sounding like the Searchers:\n\n[Excerpt: The Searchers, \"Hearts in Her Eyes\"]\n\nApparently during those sessions, Curtis, who had given up music and become a civil servant, would regularly phone the studio threatening to burn it down if he wasn't involved. Unfortunately, while those albums had some critical success, they did nothing commercially, and Sire dropped them.\n\nBy 1985, the Searchers were at breaking point. They hadn't recorded any new material in several years, and Mike Pender and John McNally weren't getting on at all -- which was a particular problem as the two of them were now the only two members based in Liverpool, and so they had to travel to and from gigs together without the other band members -- the group were so poor that McNally and Pender had one car between the two of them. One of them would drive them both to the gig, the other would drive back to Liverpool and keep the car until the next gig, when they would swap over again. No-one except them knows what conversations they had on those long drives, but apparently they weren't amicable.\n\nPender thought of himself as the star of the group, and he particularly resented that he had to split the money from the band three ways (the drummers the group got in after Curtis were always on a salary rather than full partners in the group). Pender decided that he could make more money by touring on his own but still doing essentially the same show, with hired backing musicians.\n\nPender and the other Searchers eventually reached an agreement that he could tour as \"Mike Pender's Searchers\", so long as he made sure that all the promotional material put every word at the same size, while the other members would continue as The Searchers with a new singer. A big chunk of the autobiographies of both Pender and Allen are taken up with the ensuing litigation, as there were suits and countersuits over matters of billing which on the outside look incredibly trivial, but which of course mattered greatly to everyone involved -- there were now two groups with near-identical names, playing the same sets, in the same venues, and so any tiny advantage that one had was a threat to the other, to the extent that at one point there was a serious danger of Pender going to prison over their contractual disputes. The group had been earning very little money anyway, comparatively, and there was a real danger that the two groups undercutting each other might lead to everyone going bankrupt.\n\nThankfully, that didn't happen. Pender still tours -- or at least has tour dates booked over the course of the next year -- and McNally and Allen's band continued playing regularly until 2019, and only stopped performing because of McNally's increasing ill health. Having seen both, Pender's was the better show -- McNally and Allen's lineup of the group relied rather too heavily on a rather cheesy sounding synthesiser for my tastes, while Pender stuck closer to a straight guitar/bass/drums sound -- but both kept audiences very happy for decades.\n\nMike Pender was made an MBE in 2020, as a reward for his services to the music industry. Tony Jackson and Chris Curtis both died in the 2000s, and John McNally and Frank Allen are now in well-deserved retirement. While Allen and Pender exchanged pleasantries and handshakes at their former bandmates' funerals, McNally and Pender wouldn't even say hello to each other, and even though McNally and Allen's band has retired, there's still a prominent notice on their website that they own the name \"The Searchers\" and nobody else is allowed to use it. But every time you hear a jangly twelve-string electric guitar, you're hearing a sound that was originally created by Mike Pender and John McNally playing in unison, a sound that proved to be greater than any of its constituent parts.",
  "itunes:subtitle": "This weeks episode looks at Needles and Pins, and the story of the second-greatest band to come out of Liverpool in the sixties, The Searchers. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon ",
  "itunes:keywords": "Brian Epstein,Brill Building,British rock,Chris Curtis,Doc Pomus,folk-rock,Hamburg,Jack Nitzsche,Jackie DeShannon,Jimmy Page,Joe Moretti,John Paul Jones,Jon Lord,lawsuits,Liverpool,Merseybeat,Mort Shuman,Phil Spector,Pye Records,Ritchie Blackmore,Seymour Stein,Sire Records,skiffle,Sonny Bono,The Searchers,The Wrecking Crew,Tony Hatch",
  "itunes:episodeType": "full",
  "itunes:episode": 113,
  "content:encoded": "This week's episode looks at \"Needles and Pins\", and the story of the second-greatest band to come out of Liverpool in the sixties, The Searchers. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a sixteen-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/47258892\">\"Farmer John\" by Don and Dewey</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nNo Mixcloud this week, as there are too many recordings by the Searchers.\n\nMy two main resources for this episode have been the autobiographies of members of the group -- Frank Allen's&nbsp;<a href=\"https://amzn.to/3cPw6LT\"><em>The Searchers and Me</em> </a>and Mike Pender's&nbsp;<em><a href=\"https://amzn.to/3pYojz3\">The Search For Myself.</a>&nbsp;</em>\n\nAll the Searchers tracks and Tony Jackson or Chris Curtis solo recordings excerpted here, except the live excerpt of \"What'd I Say\", can be found on <a href=\"https://amzn.to/36StuZR\">this box set</a>, which is out of print as a physical box, but still available digitally. For those who want a good budget alternative, though,<a href=\"https://amzn.to/3oWarnB\"> this double-CD set </a>contains fifty Searchers tracks, including all their hits, for under three pounds.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nLast week we had a look at the biggest group ever to come out of Liverpool, and indeed the biggest group ever to play rock and roll music. But the Beatles weren't the only influential band on the Merseybeat scene, and while we won't have much chance to look at Merseybeat in general, we should at least briefly touch on the other bands from the scene. So today we're going to look at a band who developed a distinctive sound that would go on to be massively influential, even though they're rarely cited as an influence in the way some of their contemporaries are. We're going to look at The Searchers, and \"Needles and Pins\":\n\n[Excerpt: The Searchers, \"Needles and Pins\"]\n\nThe story of the early origins of the Searchers is, like everything about the Searchers, the subject of a great deal of dispute. The two surviving original members of the group, John McNally and Mike Pender, haven't spoken to each other in thirty-six years, and didn't get on for many years before that, and there have been several legal disputes between them over the years. As a result, literally everything about the group's history has become a battlefield in their ongoing arguments.\n\nAccording to a book by Frank Allen, the group's bass player from 1964 on and someone who took McNally's side in the split and subsequent legal problems, McNally formed a skiffle group, which Mike Pender later joined, and was later joined first by Tony Jackson and then by a drummer then known as Chris Crummey, but who changed his name to the more euphonic Chris Curtis.\n\nAccording to Pender, he never liked skiffle, never played skiffle, and \"if McNally had a skiffle group, it must have been before I met him\". He is very insistent on this point -- he liked country music, and later rock and roll, but never liked skiffle. According to him, he and McNally got together and formed a group that was definitely absolutely not in any way a skiffle group and wasn't led by McNally but was formed by both of them. That group split up, and then Pender became friends with Tony Jackson -- and he's very insistent that he became friends with Jackson during &nbsp;a period when he didn't know McNally -- and the group reformed around the three of them, when McNally and Pender got back in touch.\n\nThe origin of the group's name is similarly disputed. Everyone agrees that it came from the John Wayne film The Searchers -- the same film which had inspired the group's hero Buddy Holly to write \"That'll Be The Day\" -- but there is disagreement as to whose idea the name was. Pender claims that it was his idea, while McNally says that the name was coined by a singer named \"Big Ron\", who sang with the band for a bit before disappearing into obscurity.\n\nBig Ron's replacement was a singer named Billy Beck, who at the time he was with the Searchers used the stage name Johnny Sandon (though he later reverted to his birth name). The group performed as Johnny Sandon and The Searchers for two years, before Sandon quit the group to join the Remo Four, a group that was managed by Brian Epstein. Sandon made some records with the Remo Four in 1963, but they went nowhere, but they'll give some idea of how Sandon sounded:\n\n[Excerpt: Johnny Sandon and the Remo Four, \"Lies\"]\n\nThe Remo Four later moved on to back Tommy Quickly, who we heard last week singing a song the Beatles wrote for him.\n\nWith Sandon out of the picture, the group had no lead singer or frontman, and were in trouble -- they were known around Liverpool as Johnny Sandon's backing group, not as a group in their own right. They started splitting the lead vocals between themselves, but with Tony Jackson taking most of them. And, in a move which made them stand out, Chris Curtis moved his drum kit to the front line, started playing standing up, and became the group's front-man and second lead singer.\n\nEven at this point, though, there seemed to be cracks in the group. The Searchers were the most clean-living of the Liverpool bands -- they were all devout Catholics who would go to Mass every Sunday without fail, and seem to have never indulged in most of the vices that pretty much every other rock star indulged in. But Curtis and Jackson were far less so than Pender and McNally -- Jackson in particular was a very heavy drinker and known to get very aggressive when drunk, while Curtis was known as eccentric in other ways -- he seems to have had some sort of mental illness, though no-one's ever spoken about a diagnosis -- the Beatles apparently referred to him as \"Mad Henry\".\n\nCurtis and Jackson didn't get on with each other, and while Jackson started out as a close friend of Pender's, the two soon drifted apart, and by the time of their first recording sessions they appeared to most people to be a group of three plus one outsider, with Jackson not getting on well with any of the others.\n\nThere was also a split in the band's musical tastes, but that would be the split that would drive much of their creativity. Pender and McNally were drawn towards softer music -- country and rockabilly, the Everly Brothers and Buddy Holly -- while Jackson preferred harder, stomping, music. But it was Chris Curtis who took charge of the group's repertoire, and who was the group's unofficial leader. While the other band members had fairly mainstream musical tastes, it was Curtis who would seek out obscure R&B B-sides that he thought the group could make their own, by artists like The Clovers and Richie Barrett -- while many Liverpool groups played Barrett's \"Some Other Guy\", the Searchers would also play the B-side to that, \"Tricky Dicky\", a song written by Leiber and Stoller. Curtis also liked quite a bit of folk music, and would also get the group to perform songs by Joan Baez and Peter, Paul, and Mary.\n\nThe result of this combination of material and performers was that the Searchers ended up with a repertoire rooted in R&B, and a heavy rhythm section, but with strong harmony vocals inspired more by the Everlys than by the soul groups that were inspiring the other groups around Liverpool. Other than the Beatles, the Searchers were the best harmony group in Liverpool, and were the only other one to have multiple strong lead vocalists.\n\nLike the Beatles, the Searchers went off to play at the Star Club in Hamburg in 1962. Recordings were made of their performances there, and their live version of Brenda Lee's \"Sweet Nothin's\" later got released as a single after they became successful:\n\n[Excerpt: The Searchers, \"Sweet Nothin's\"]\n\nEven as every talent scout in the country seemed to be turning up in Liverpool, and even bands from nearby Manchester were getting signed up in the hope of repeating the Beatles' success, the Searchers were having no luck getting any attention from the London music industry. In part that was because of one bit of bad luck -- the day that Brian Epstein turned up to see them, with the thought of maybe managing them, Tony Jackson was drunk and fell off the stage, and Epstein decided that he was going to give them a miss.\n\nAs no talent scouts were coming to see them, they decided that they would record a demo session at the Iron Door, the club they regularly played, and send that out to A&R people. That demo session produced a full short album, which shows them at their stompiest and hardest-driving. Most of the Merseybeat bands sounded much more powerful in their earlier live performances than in the studio, and the Searchers were no exception, and it's interesting to compare the sound of these recordings to the studio ones from only a few months later:\n\n[Excerpt: The Searchers, \"Let's Stomp\"]\n\nThe group eventually signed to Pye Records. Pye was the third or fourth biggest record label in Britain at the time, but that was a relative matter -- EMI and Decca between them had something like eighty-five percent of the market, and basically *were* the record industry in Britain at the time. Pye was chronically underfunded, and when they signed an artist who managed to have any success, they would tend to push that artist to keep producing as many singles as possible, chasing trends, rather than investing in their long-term career survival.\n\nThat said, they did have some big acts, most notably Petula Clark -- indeed the company had been formed from the merger of two other companies, one of which had been formed specifically to issue Clark's records. Clark was yet to have her big breakthrough hit in the USA, but she'd had several big hits in the UK, including the number one hit \"Sailor\":\n\n[Excerpt: Petula Clark, \"Sailor\"]\n\nThe co-producer on that track had been Tony Hatch, a songwriter and producer who would go on to write and produce almost all of Clark's hit records. Hatch had a track record of hits -- we've heard several songs he was involved in over the course of the series. Most recently, we heard last week how \"She Loves You\" was inspired by \"Forget Him\", which Hatch wrote and produced for Bobby Rydell:\n\n[Excerpt: Bobby Rydell, \"Forget Him\"]\n\nHatch heard the group's demo, and was impressed, and offered to sign them. The Searchers' manager at the time agreed, on one condition -- that Hatch also sign another band he managed, The Undertakers. Astonishingly, Hatch agreed, and so the Undertakers also got a record contract, and released several flop singles produced by Hatch, including this cover version of a Coasters tune:\n\n[Excerpt: The Undertakers, \"What About Us?\"]\n\nThe biggest mark that the Undertakers would make on music would come many years later, when their lead singer Jackie Lomax would release a solo single, \"Sour Milk Sea\", which George Harrison wrote for him.\n\nThe Searchers, on the other hand, made their mark immediately. The group's first single was a cover version of a song written by Doc Pomus and Mort Shuman, which had been a top twenty hit in the US for the Drifters a couple of years earlier:\n\n[Excerpt: The Drifters, \"Sweets For My Sweet\"]\n\nThat had become a regular fixture in the Searchers' live set, with Tony Jackson singing lead and Chris Curtis singing the high backing vocal part in falsetto. In much the same way that the Beatles had done with \"Twist and Shout\", they'd flattened out the original record's Latin cha-cha-cha rhythm into a more straightforward thumping rocker for their live performances, as you can hear on their original demo version from the Iron Door sessions:\n\n[Excerpt: The Searchers, \"Sweets For My Sweet (live at the Iron Door)\"]\n\nAs you can hear, they'd also misheard a chunk of the lyrics, and so instead of \"your tasty kiss\", Jackson sang \"Your first sweet kiss\".\n\nIn the studio, they slowed the song down very slightly, and brought up the harmony vocal from Pender on the choruses, which on the demo he seems to have been singing off-mic. The result was an obvious hit:\n\n[Excerpt: The Searchers, \"Sweets For My Sweet\"]\n\nThat went to number one, helped by an endorsement from John Lennon, who said it was the best record to come out of Liverpool, and launched the Searchers into the very top tier of Liverpool groups, their only real competition being the Beatles and Gerry and the Pacemakers -- and though nobody could have known it at the time, the Pacemakers' career had already peaked at this point.\n\nTheir first album, Meet The Searchers, featured \"Sweets For My Sweet\", along with a selection of songs that mixed the standard repertoire of every Merseybeat band -- \"Money\", \"Da Doo Ron Ron\", \"Twist and Shout\", \"Stand By Me\", and the Everly Brothers' \"Since You Broke My Heart\", with more obscure songs like \"Ain't Gonna Kiss Ya\", by the then-unknown P.J. Proby, \"Farmer John\" by Don and Dewey, which hadn't yet become a garage-rock standard (and indeed seems to have become so largely because of the Searchers' version), and a cover of \"Love Potion #9\", a song that Leiber and Stoller had written for the Clovers, which was not released as a single in the UK, but later became their biggest hit in the US (and a quick content note for this one -- the lyric contains a word for Romani people which many of those people regard as a slur):\n\n[Excerpt: The Searchers, \"Love Potion #9\"]\n\nTheir second single was an attempt to repeat the \"Sweets For My Sweet\" formula, and was written by Tony Hatch, although the group didn't know that at the time. Hatch, like many producers of the time, was used to getting his artists to record his own songs, written under pseudonyms so the record label didn't necessarily realise this was what he was doing. In this case he brought the group a song that he claimed had been written by one \"Fred Nightingale\", and which he thought would be perfect for them. The song in question, \"Sugar and Spice\", was a blatant rip-off of \"Sweets For My Sweet\", and recorded in a near-identical arrangement:\n\n[Excerpt: The Searchers, \"Sugar and Spice\"]\n\nThe group weren't keen on the song, and got very angry later on when they realised that Tony Hatch had lied to them about its origins, but the record was almost as big a hit as the first one, peaking at number two on the charts.\n\nBut it was their third single that was the group's international breakthrough, and which both established a whole new musical style and caused the first big rift in the group.\n\nThe song chosen for that third single was one they learned in Hamburg, from Cliff Bennett and the Rebel Rousers, a London group who had recorded a few singles with Joe Meek, like \"You Got What I Like\":\n\n[Excerpt: Cliff Bennett and the Rebel Rousers, \"You Got What I Like\"]\n\nThe Rebel Rousers had picked up on a record by Jackie DeShannon, a singer-songwriter who had started up a writing partnership with Sharon Sheeley, the writer who had been Eddie Cochran's girlfriend and in the fatal car crash with him. The record they'd started covering live, though, was not one that DeShannon was the credited songwriter on. \"Needles and Pins\" was credited to two other writers, both of them associated with Phil Spector.\n\nSonny Bono was a young songwriter who had written songs at Specialty Records for people like Sam Cooke, Larry Williams, and Don and Dewey, and his most famous song up to this point was \"She Said Yeah\", the B-side to Williams' \"Bad Boy\":\n\n[Excerpt: Larry Williams, \"She Said Yeah\"]\n\nAfter working at Specialty, he'd gone on to work as Phil Spector's assistant, doing most of the hands-on work in the studio while Spector sat in the control room. While working with Spector he'd got to know Jack Nitzsche, who did most of the arrangements for Spector, and who had also had hits on his own like \"The Lonely Surfer\":\n\n[Excerpt: Jack Nitzsche, \"The Lonely Surfer\"]\n\nBono and Nitzsche are the credited writers on \"Needles and Pins\", but Jackie DeShannon insists that she co-wrote the song with them, but her name was left off the credits. I tend to believe her -- both Nitzsche and Bono were, like their boss, abusive misogynist egomaniacs, and it's easy to see them leaving her name off the credits. Either way, DeShannon recorded the song in early 1963, backed by members of the Wrecking Crew, and it scraped into the lower reaches of the US Hot One Hundred, though it actually made number one in Canada:\n\n[Excerpt: Jackie DeShannon, \"Needles and Pins\"]\n\nCliff Bennett and the Rebel Rousers had been covering that song, and Chris Curtis picked up on it as an obvious hit. The group reshaped the song, and fixed the main flaw with DeShannon's original.\n\nThere's really only about ninety seconds' worth of actual song in \"Needles and Pins\", and DeShannon's version ends with a minute or so of vamping -- it sounds like it's still a written lyric, but it's full of placeholders where entire lines are \"whoa-oh\", the kind of thing that someone like Otis Redding could make sound great, but that didn't really work for her record.\n\nThe Searchers tightened the song up and altered its dynamics -- instead of the middle eight leading to a long freeform section, they started the song with Mike Pender singing solo, and then on the middle eight they added a high harmony from Curtis, then just repeated the first verse and chorus, in the new key of C sharp, with Curtis harmonising this time:\n\n[Excerpt: The Searchers, \"Needles and Pins\" (middle eight on)]\n\nThe addition of the harmony gives the song some much-needed dynamic variation not present in DeShannon's version, while repeating the original verse after the key change, and adding in Curtis' high harmony, gives it an obsessive quality. The protagonist here is spiralling – he keeps thinking the same things over and over, at a higher and higher pitch, getting more and more desperate. It's a simple change, but one that improves the song immensely.\n\nIncidentally, one thing I should note here because it's not something I normally do -- in these excerpts of the Searchers' version of \"Needles and Pins\", I'm actually modifying the recording slightly. The mix used for the original single version of the song, which is what I'm excerpting here, is marred by an incredibly squeaky bass pedal on Chris Curtis' drumkit, which isn't particularly audible if you're listening to it on early sixties equipment, which had little dynamic range, but which on modern digital copies of the track overpowers everything else, to the point that the record sounds like that Monty Python sketch where someone plays a tune by hitting mice with hammers.\n\nHere's a couple of seconds of the unmodified track, so you can see what I mean:\n\n[Excerpt: The Searchers, \"Needles and Pins\"]\n\nMost hits compilations have a stereo mix of the song, and have EQ'd it so that the squeaky bass pedal isn't noticeable, but I try wherever possible to use the mixes that people were actually listening to at the time, so I've compromised and used the mono mix but got rid of the squeaky frequencies, so you can hear the music I'm talking about rather than being distracted by the squeaks.\n\nAnyway, leaving the issue of nobody telling Chris Curtis to oil his pedals aside, the change in the structure of the song turned it from something a little baggy and aimless into a tight two-and-a-half minute pop song, but the other major change they made was emphasising the riff, and in doing so they inadvertently invented a whole new genre of music.\n\nThe riff in DeShannon's version is there, but it's just one element -- an acoustic guitar strumming through the chords. It's a good, simple, play-in-a-day riff -- you basically hold a chord down and then move a single finger at a time and you can get that riff -- and it's the backbone of the song, but there's also a piano, and horns, and the Blossoms singing:\n\n[Excerpt: Jackie DeShannon, \"Needles and Pins\"]\n\nBut what the Searchers did was to take the riff and play it simultaneously on two electric guitars, and then added reverb. They also played the first part of the song in A, rather than the key of C which DeShannon's version starts in, which allowed the open strings to ring out more. The result came out sounding like an electric twelve-string, and soon both they and the Beatles would be regularly using twelve-string Rickenbackers to get the same sound:\n\n[Excerpt: The Searchers, \"Needles and Pins\"]\n\nThat record is the root of jangle-pop and folk-rock. That combination of jangling, reverb-heavy, trebly guitars and Everly Brothers inspired harmonies is one that leads directly to the Byrds, Love, Big Star, Tom Petty, REM, the Smiths, and the Bangles, among many others. While the Beatles were overall obviously the more influential group by a long way, \"Needles and Pins\" has a reasonable claim to be the most influential single track from the Merseybeat era.\n\nIt went to number one in the UK, and became the group's breakthrough hit in the US, reaching number sixteen. The follow-up, \"Don't Throw Your Love Away\", a cover of a B-side by the Orlons, again featuring Pender on lead vocals and Curtis on harmonies, also made number one in the UK and the US top twenty, giving them a third number one out of four singles. But the next single, \"Someday We're Gonna Love Again\", a cover of a Barbara Lewis song, only made number eleven, and caused journalists to worry if the Searchers had lost their touch. There was even some talk in the newspapers that Mike Pender might leave the group and start a solo career, which he denied.\n\nAs it turned out, one of the group's members was going to leave, but it wasn't Mike Pender. Tony Jackson had sung lead on the first two singles, and on the majority of the tracks on the first album, and he thus regarded himself as the group's lead singer. With Pender taking over the lead on the more recent hit singles, Jackson was being edged aside. By the third album, It's The Searchers, which included \"Needles and Pins\", Jackson was the only group member not to get a solo lead vocal -- even John McNally got one, while Jackson's only lead was an Everlys style close harmony with Mike Pender. Everything else was being sung by Pender or Curtis.\n\nJackson was also getting involved in personality conflicts with the other band members -- at one point it actually got to the point that he and Pender had a fistfight on stage.\n\nJackson was also not entirely keen on the group's move towards more melodic material. It's important to remember that the Searchers had started out as an aggressive, loud, R&B band, and they still often sounded like that on stage -- listen for example to their performance of \"What'd I Say\" at the NME poll-winners' party in April 1964, with Chris Curtis on lead vocals clearly showing why he had a reputation for eccentricity:\n\n[Excerpt: The Searchers, \"What'd I Say (live)\"]\n\nThe combination of these musical differences and his feelings about having his place usurped meant that Jackson was increasingly getting annoyed at the other three band members. Eventually he left the group -- whether he was fired or quit depends on which version of the story you read -- and was replaced by Frank Allen of Cliff Bennett and the Rebel Rousers.\n\nJackson didn't take this replacement well, and publicly went round telling people that he had been pushed out of the band so that Curtis could get his boyfriend into the band, and there are some innuendoes to this effect in Mike Pender's autobiography -- although Allen denies that he and Curtis were in a relationship, and says that he doesn't actually know what Curtis' sexuality was, because they never discussed that kind of thing, and presumably Allen would know better than anyone else whether he was in a relationship with Curtis.\n\nCurtis is widely described as having been gay or bi by his contemporaries, but if he was he never came out publicly, possibly due to his strong religious views. There's some suggestion, indeed, that one reason Jackson ended up out of the band was that he blackmailed the band, saying that he would publicly out Curtis if he didn't get more lead vocals.\n\nWhatever the truth, Jackson left the group, and his first solo single, \"Bye Bye Baby\", made number thirty-eight on the charts:\n\n[Excerpt: Tony Jackson and the Vibrations, \"Bye Bye Baby\"]\n\nHowever, his later singles had no success -- he was soon rerecording \"Love Potion Number Nine\" in the hope that that would be a UK chart success as it had been in the US:\n\n[Excerpt: Tony Jackson and the Vibrations, \"Love Potion Number Nine\"]\n\nMeanwhile, Allen was fitting in well with his new group, and it appeared at first that the group's run of hits would carry on uninterrupted without Jackson. The first single by the new lineup, \"When You Walk In The Room\", was a cover of another Jackie DeShannon song, this time written by DeShannon on her own, and originally released as a B-side:\n\n[Excerpt: Jackie DeShannon, \"When You Walk In The Room\"]\n\nThe Searchers rearranged that, once again emphasising the riff from DeShannon's original, and by this time playing it on real twelve-strings, and adding extra compression to them. Their version featured a joint lead vocal by Pender and Allen:\n\n[Excerpt: The Searchers, \"When You Walk In the Room\"]\n\nDo you think the Byrds might have heard that?\n\nThat went to number three on the charts. The next single was less successful, only making number thirteen, but was interesting in other ways -- from the start, as well as their R&B covers, Curtis had been adding folk songs to the group's repertoire, and there'd been one or two covers of songs like \"Where Have All the Flowers Gone?\" on their albums, but \"What Have They Done to the Rain?\" was the first one to become a single.\n\nIt was written by Malvina Reynolds, who was a socialist activist who only became a songwriter in her early fifties, and who also wrote \"Morningtown Ride\" and \"Little Boxes\". \"What Have They Done to The Rain?\" was a song written to oppose nuclear weapons testing, and Curtis had learned it from a Joan Baez album. Even though it wasn't as big a success as some of their other hits, given how utterly different it was from their normal style, and how controversial the subject was, getting it into the top twenty at all seems quite an achievement.\n\n[Excerpt: The Searchers, “What Have They Done To The Rain?”]\n\nTheir next single, \"Goodbye My Love\", was their last top ten hit, and the next few singles only made the top forty, even when the Rolling Stones gave them \"Take It Or Leave It\". The other group members started to get annoyed at Curtis, who they thought had lost his touch at picking songs, and whose behaviour had become increasingly erratic. Eventually, on an Australian tour, they took his supply of uppers and downers, which he had been using as much to self-medicate as for enjoyment as far as I can tell, and flushed them down the toilet. When they got back to the UK, Curtis was out of the group.\n\nTheir first single after Curtis' departure, \"Have You Ever Loved Somebody\", was given to them by the Hollies, who had originally written it as an Everly Brothers album track:\n\n[Excerpt: The Searchers, \"Have You Ever Loved Somebody\"]\n\nUnfortunately for the Searchers, Chris Curtis had also heard the song, decided it was a likely hit, and had produced a rival version for Paul and Barry Ryan, which got rushed out to compete with it:\n\n[Excerpt: Paul and Barry Ryan, \"Have You Ever Loved Somebody\"]\n\nNeither single made the top forty, and the Searchers would never have a hit single again. Nor would Curtis. Curtis only released one solo single, \"Aggravation\", a cover of a Joe South song:\n\n[Excerpt: Chris Curtis, \"Aggravation\"]\n\nThe musicians on that included Jimmy Page, John Paul Jones, and Joe Moretti, but it didn't chart. Curtis then tried to form a band, which he named Roundabout, based on the concept that musicians could hop on or hop off at any point, with Curtis as the only constant member. The guitarist and keyboard player quickly decided that it would be more convenient for them if Curtis was the one to hop off, and without Curtis Jon Lord and Richie Blackmore went on to form Deep Purple.\n\nThe Searchers didn't put out another album for six years after Curtis left. They kept putting out singles on various labels, but nothing came close to charting. Their one album between 1966 and 1979 was a collection of rerecordings of their old hits, in 1972. But then in 1979 Seymour Stein, the owner of Sire Records, a label which was having success with groups like the Ramones, Talking Heads, and the Pretenders, was inspired by the Ramones covering \"Needles and Pins\" to sign the Searchers to a two-album deal, which produced records that fit perfectly into the late seventies New Wave pop landscape, while still sounding like the Searchers:\n\n[Excerpt: The Searchers, \"Hearts in Her Eyes\"]\n\nApparently during those sessions, Curtis, who had given up music and become a civil servant, would regularly phone the studio threatening to burn it down if he wasn't involved. Unfortunately, while those albums had some critical success, they did nothing commercially, and Sire dropped them.\n\nBy 1985, the Searchers were at breaking point. They hadn't recorded any new material in several years, and Mike Pender and John McNally weren't getting on at all -- which was a particular problem as the two of them were now the only two members based in Liverpool, and so they had to travel to and from gigs together without the other band members -- the group were so poor that McNally and Pender had one car between the two of them. One of them would drive them both to the gig, the other would drive back to Liverpool and keep the car until the next gig, when they would swap over again. No-one except them knows what conversations they had on those long drives, but apparently they weren't amicable.\n\nPender thought of himself as the star of the group, and he particularly resented that he had to split the money from the band three ways (the drummers the group got in after Curtis were always on a salary rather than full partners in the group). Pender decided that he could make more money by touring on his own but still doing essentially the same show, with hired backing musicians.\n\nPender and the other Searchers eventually reached an agreement that he could tour as \"Mike Pender's Searchers\", so long as he made sure that all the promotional material put every word at the same size, while the other members would continue as The Searchers with a new singer. A big chunk of the autobiographies of both Pender and Allen are taken up with the ensuing litigation, as there were suits and countersuits over matters of billing which on the outside look incredibly trivial, but which of course mattered greatly to everyone involved -- there were now two groups with near-identical names, playing the same sets, in the same venues, and so any tiny advantage that one had was a threat to the other, to the extent that at one point there was a serious danger of Pender going to prison over their contractual disputes. The group had been earning very little money anyway, comparatively, and there was a real danger that the two groups undercutting each other might lead to everyone going bankrupt.\n\nThankfully, that didn't happen. Pender still tours -- or at least has tour dates booked over the course of the next year -- and McNally and Allen's band continued playing regularly until 2019, and only stopped performing because of McNally's increasing ill health. Having seen both, Pender's was the better show -- McNally and Allen's lineup of the group relied rather too heavily on a rather cheesy sounding synthesiser for my tastes, while Pender stuck closer to a straight guitar/bass/drums sound -- but both kept audiences very happy for decades.\n\nMike Pender was made an MBE in 2020, as a reward for his services to the music industry. Tony Jackson and Chris Curtis both died in the 2000s, and John McNally and Frank Allen are now in well-deserved retirement. While Allen and Pender exchanged pleasantries and handshakes at their former bandmates' funerals, McNally and Pender wouldn't even say hello to each other, and even though McNally and Allen's band has retired, there's still a prominent notice on their website that they own the name \"The Searchers\" and nobody else is allowed to use it. But every time you hear a jangly twelve-string electric guitar, you're hearing a sound that was originally created by Mike Pender and John McNally playing in unison, a sound that proved to be greater than any of its constituent parts.",
  "enclosure": "",
  "itunes:summary": "This week's episode looks at \"Needles and Pins\", and the story of the second-greatest band to come out of Liverpool in the sixties, The Searchers. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a sixteen-minute bonus episode available, on \"Farmer John\" by Don and Dewey.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nNo Mixcloud this week, as there are too many recordings by the Searchers.\n\nMy two main resources for this episode have been the autobiographies of members of the group -- Frank Allen's&nbsp;The Searchers and Me and Mike Pender's&nbsp;The Search For Myself.&nbsp;\n\nAll the Searchers tracks and Tony Jackson or Chris Curtis solo recordings excerpted here, except the live excerpt of \"What'd I Say\", can be found on this box set, which is out of print as a physical box, but still available digitally. For those who want a good budget alternative, though, this double-CD set contains fifty Searchers tracks, including all their hits, for under three pounds.\n\nPatreon\n\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\n\nTranscript\n\nLast week we had a look at the biggest group ever to come out of Liverpool, and indeed the biggest group ever to play rock and roll music. But the Beatles weren't the only influential band on the Merseybeat scene, and while we won't have much chance to look at Merseybeat in general, we should at least briefly touch on the other bands from the scene. So today we're going to look at a band who developed a distinctive sound that would go on to be massively influential, even though they're rarely cited as an influence in the way some of their contemporaries are. We're going to look at The Searchers, and \"Needles and Pins\":\n\n[Excerpt: The Searchers, \"Needles and Pins\"]\n\nThe story of the early origins of the Searchers is, like everything about the Searchers, the subject of a great deal of dispute. The two surviving original members of the group, John McNally and Mike Pender, haven't spoken to each other in thirty-six years, and didn't get on for many years before that, and there have been several legal disputes between them over the years. As a result, literally everything about the group's history has become a battlefield in their ongoing arguments.\n\nAccording to a book by Frank Allen, the group's bass player from 1964 on and someone who took McNally's side in the split and subsequent legal problems, McNally formed a skiffle group, which Mike Pender later joined, and was later joined first by Tony Jackson and then by a drummer then known as Chris Crummey, but who changed his name to the more euphonic Chris Curtis.\n\nAccording to Pender, he never liked skiffle, never played skiffle, and \"if McNally had a skiffle group, it must have been before I met him\". He is very insistent on this point -- he liked country music, and later rock and roll, but never liked skiffle. According to him, he and McNally got together and formed a group that was definitely absolutely not in any way a skiffle group and wasn't led by McNally but was formed by both of them. That group split up, and then Pender became friends with Tony Jackson -- and he's very insistent that he became friends with Jackson during &nbsp;a period when he didn't know McNally -- and the group reformed around the three of them, when McNally and Pender got back in touch.\n\nThe origin of the group's name is similarly disputed. Everyone agrees that it came from the John Wayne film The Searchers -- the same film which had inspired the group's hero Buddy Holly to write \"That'll Be The Day\" -- but there is disagreement as to whose idea the name was. Pender claims that it was his idea, while McNally says that the name was coined by a singe",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "This week's episode looks at \"Needles and Pins\", and the story of the second-greatest band to come out of Liverpool in the sixties, The Searchers. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a sixteen-minute bonus episode available, on \"Farmer John\" by Don and Dewey.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nNo Mixcloud this week, as there are too many recordings by the Searchers.\n\nMy two main resources for this episode have been the autobiographies of members of the group -- Frank Allen's&nbsp;The Searchers and Me and Mike Pender's&nbsp;The Search For Myself.&nbsp;\n\nAll the Searchers tracks and Tony Jackson or Chris Curtis solo recordings excerpted here, except the live excerpt of \"What'd I Say\", ",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}