{
  "id": "yt:video:anzUS24y9zw",
  "yt:videoId": "anzUS24y9zw",
  "yt:channelId": "UCEnl2ZDocvt4aoIyT3fl8SQ",
  "title": "Huge numbers of European soldiers liberated from a German prison camp in World Wa...HD Stock Footage",
  "link": "",
  "author": {
    "name": "CriticalPast",
    "uri": "https://www.youtube.com/channel/UCEnl2ZDocvt4aoIyT3fl8SQ"
  },
  "published": "2014-07-16T11:31:57+00:00",
  "updated": "2022-05-19T07:27:21+00:00",
  "media:group": {
    "media:title": "Huge numbers of European soldiers liberated from a German prison camp in World Wa...HD Stock Footage",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "CriticalPast is an archive of historic footage. The vintage footage in this video has been uploaded for research purposes, and is presented in unedited form. Some viewers may find some scenes or audio in this archival material to be unsettling or distressing. CriticalPast makes this media available for researchers and documentarians, and does not endorse or condone any behavior or message, implied or explicit, that is seen or heard in this video.\nLink to order this clip:\nhttp://www.criticalpast.com/video/65675040697_liberated-prisoners_Stalag-Luft-III_soldiers-leaving-camp_repatriated-soldiers\nHistoric Stock Footage Archival and Vintage Video Clips in HD.\n\nHuge numbers of European soldiers liberated from a German prison camp in World War II\n\nLarge numbers of French and other European prisoners, along with displaced persons (carrying their belongings in carts) are seen filling the roads and paths in an exodus from a German prison camp, in final days of World War 2. Several boys pose outside the gate of a German Army establishment. The military evacuees are all dressed in uniform and seem in relatively good health. Several carry a French tricolor flag. They proceed along a path beside a river, and assemble in a grassy area near a town. Location: Germany. Date: April 24, 1945.\n\nVisit us at www.CriticalPast.com:\n57,000+ broadcast-quality historic clips for immediate download.\nFully digitized and searchable, the CriticalPast collection is one of the largest archival footage collections in the world. All clips are licensed royalty-free, worldwide, in perpetuity. CriticalPast offers immediate downloads of full-resolution HD and SD masters and full-resolution time-coded screeners, 24 hours a day, to serve the needs of broadcast news, TV, film, and publishing professionals worldwide. Still photo images extracted from the vintage footage are also available for immediate download.  CriticalPast is your source for imagery of worldwide events, people, and B-roll spanning the 20th century.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}