{
  "title": "CHARLI D’AMELIO GOES AT DAVE PORTNOY OVER PAST COMMENTS — BFFs EP. 100 WITH DIXIE D’AMELIO",
  "description": "<p>Nearly two years after a 45 year old man and a teenage Tik Tok star met up in LA, we have reached our 100th episode of BFFs. Like the first episode we are without Bri, but unlike the first episode she missed the pod as she is filming a video with Mr. Beast.\n\nWe start with headlines of Dixie and Noah having broken up in the past (but are now back together), Dave not being happy with her keeping that from him, Josh calling Dixie to see what’s up, and internet issues derail the pod.\n\nWe pick back up with Nessa and Jaden seemingly on good terms and them potentially performing together next month, Josh deleting posts that had to do with Nessa, Josh’s mom untagging her from a family photo, and where Josh and Nessa stand today.\n\nWe finish up headlines with Hailey Bieber’s appearance on Call Her Daddy and her talking about Selena Gomez publicly for the first time, Taylor Swift and Drake allegedly having a Kanye diss track, Dream revealing his face and nearly breaking the internet (and Dave also learns what minecraft is), Kim Kardashian getting busted in a crypto scam, Mr. Beast being offered $1,000,000,000 for his YouTube channel, Tom Hanks saying he only had “four pretty good movies”, Antonio going crazy in a public pool, Dua Lipa and Trevor Noah potentially dating, and Bella Hadid rocking a painted on dress.\n\nWe then get into the interview everyone has been waiting for: Charli and Dixie D’Amelio. We talk about everything from why it took so long for Charli to come on the pod, her being the genesis for the start of the show, her relationship with Landon Barker and the drama it started with Lil Huddy, where Dixie is at with Noah Beck now,  and finish with a game of “Celebrity Word Association” where Dixie and Charli have to give their feelings on every single influencer that you would want to know their opinions on. \n\n\nSupport Our Sponsors!\nRaising Canes: Get your Cane’s fix fast by ordering through their app or online at https://www.raisingcanes.com\nTakis: Try Takis and face the intensity!</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/bffspod\">barstool.link/bffspod</a></p>",
  "guid": "c480413b-f854-4ab9-bbb8-4c0a77105cfe",
  "pubDate": "Thu, 6 Oct 2022 00:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/134/Bffs",
  "itunes:explicit": "yes",
  "itunes:duration": "01:30:33",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}