{
  "title": "529: Celebrating and Criticizing Ravenclaw House",
  "link": "https://audioboom.com/posts/7936756",
  "itunes:episode": 529,
  "itunes:title": "Celebrating and Criticizing Ravenclaw House",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5442,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Intelligence. Wisdom. Learning. Wit. Our four-part series on the Houses of Hogwarts continues this week with Ravenclaw (be sure to check out our <a href=\"https://www.mugglecast.com/episode-526-in-defense-of-slytherin-house/\">Slytherin</a> and <a href=\"https://www.mugglecast.com/episode-527-in-defense-of-hufflepuff-house/\">Hufflepuff</a> episodes)! Andrew and Eric are surprised with just how critical Micah and Laura are of their own house (but, honestly, would you expect anything less of Ravenclaws?). Join us as we \"look down\" upon the Hogwarts grounds from high atop Ravenclaw Tower and discuss some of the House's most notable members!<br>\n<br>\n\n</div>\n<ul>\n<li>Main Discussion: Ravenclaw House</li>\n<li>Could Ravenclaw be the house we know the least about?</li>\n<li>Does the Sorting Hat group Ravenclaws together based on academic prowess, regardless of their intent? </li>\n<li>Why was Hermione not sorted into Ravenclaw?</li>\n<li>What makes Micah and Laura Ravenclaws... Andrew and Eric have some ideas!</li>\n<li>Do certain descriptions of Ravenclaws, especially that of their common room, make them come across as elitist?</li>\n<li>What sort of students were the hosts during their younger years?</li>\n<li>What does it mean for Ravenclaw House that Luna was the character most often referred to as being authentically herself?</li>\n<li>What do we make of Cho Chang, a Ravenclaw, being Harry’s first love interest?</li>\n<li>Would the reader's perspective have changed at all knowing the first two Defense Against the Dark Arts professors/frauds were both Ravenclaws?</li>\n<li>We discuss other notable Ravenclaws, including Garrick Ollivander, Sybill Trelawney, Filus Flitwick, The Grey Lady and more !</li>\n<li>Quizzitch: On which floor at Hogwarts can you find the staircase that leads directly to the door to Ravenclaw’s common room? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week's episode is sponsored by <a href=\"http://www.thirdlove.com/mugglecast\">ThirdLove</a> (get 20% off your first purchase) and <a href=\"http://www.hellofresh.com/muggle14\">HelloFresh</a> (use code muggle14 for up to 14 free meals, including free shipping)!</li>\n</ul>\n",
  "pubDate": "Tue, 07 Sep 2021 09:00:00 +0000",
  "guid": "tag:audioboom.com,2021-09-06:/posts/7936756",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}