{
  "id": "tag:blogger.com,1999:blog-6959495683334200101.post-6049033526483405532",
  "published": "2019-08-15T11:00:00.000-07:00",
  "updated": "2019-08-15T11:00:00.149-07:00",
  "title": "Updates to our manual Content ID claiming policies",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\">In Susan’s April <a href=\"https://youtube-creators.googleblog.com/2019/04/addressing-creator-feedback-and-update.html\" target=\"_blank\">Creator Letter,</a> she shared that improving creators’ experience with copyright claims is one of our top priorities. One concerning trend we’ve seen is aggressive manual claiming of very short music clips used in monetized videos. These claims can feel particularly unfair, as they transfer all revenue from the creator to the claimant, regardless of the amount of music claimed. <a href=\"https://youtube-creators.googleblog.com/2019/07/better-tools-to-resolve-manual-Content-ID-claims.html\" target=\"_blank\">A little over a month ago,</a> we took a first step in addressing this by requiring copyright owners to provide timestamps for all manual claims so you know exactly which part of your video is being claimed. We also made updates to our editing tools in Creator Studio that allow you to use those timestamps to remove manually claimed content from your videos, automatically releasing the claim and restoring monetization. <br /><br /><br /><br />Today, we’re announcing additional changes to our <a href=\"https://support.google.com/youtube/answer/9142671#manual_claiming\" target=\"_blank\">manual claiming policies</a> intended to improve fairness in the creator ecosystem, while still respecting copyright owners’ rights to prevent unlicensed use of their content. <br /><br /><br /><br />Including someone else’s content without permission — regardless of how short the clip is — means your video can still be claimed and copyright owners will still be able to prevent monetization or block the video from being viewed. However, going forward, our policies will forbid copyright owners from using our Manual Claiming tool to monetize creator videos with very short or unintentional uses of music. This change only impacts claims made with the Manual Claiming tool, where the rightsholder is actively reviewing the video. Claims created by the Content ID match system, which are the vast majority, are not impacted by this policy. Without the option to monetize, some copyright owners may choose to leave very short or unintentional uses unclaimed. Others may choose to prevent monetization of the video by any party. And some may choose to apply a <a href=\"https://support.google.com/youtube/answer/2797370#c-subject\" target=\"_blank\">block policy.   </a><br /><br /><br /><br />As always, the best way to avoid these issues is to not use unlicensed content in your videos, even when it’s unintentional music playing in the background (i.e. vlogging in a store with music playing in the background). Instead, choose content from trusted sources such as the <a href=\"https://www.youtube.com/audiolibrary/music?nv=1\" target=\"_blank\">YouTube Audio Library</a>, which has new tracks added every month. If you do find yourself with an unintended claim, you can use our editing tools to remove the claimed content and the restrictions that come with it. And, of course, if you feel that your use qualifies for an exception to copyright, like <a href=\"https://www.youtube.com/yt/about/copyright/fair-use/\" target=\"_blank\">Fair Use</a>, be sure you understand what that means and how our <a href=\"https://support.google.com/youtube/answer/2797454\" target=\"_blank\">dispute process</a> works before uploading your video. <br /><br /><br /><br />Our enforcement of these new policies will apply to all new manual claims beginning in mid-September, providing adequate time for copyright owners to adapt. Once we start enforcement, copyright owners who repeatedly fail to adhere to these policies will have their access to Manual Claiming suspended.<br /><br /><br /><br />We strive to make YouTube a fair ecosystem for everyone, including songwriters, artists, and YouTube creators. We acknowledge that these changes may result in more blocked content in the near-term, but we feel this is an important step toward striking the right balance over the long-term. Our goal is to unlock new value for everyone by powering creative reuse and content mashups, while fairly compensating all rightsholders.<br /><br /><br /><br /><i>— The YouTube Team</i></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube Creators",
    "uri": "http://www.blogger.com/profile/00450486760991148551",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}