{
  "title": "How to make the transition from academia to data science",
  "link": "",
  "published": "2017-04-23T00:00:00-04:00",
  "updated": "2017-04-23T00:00:00-04:00",
  "author": {
    "name": "Tommy Blanchard"
  },
  "id": "tag:tommyblanchard.com,2017-04-23:/how-to-make-the-transition-from-academia-to-data-science",
  "summary": "<p>Ever since I've started writing about my transition from academia to industry (both <a href=\"http://tommyblanchard.com/reasons-i-left-academia\">my reasons for leaving</a> and <a href=\"http://tommyblanchard.com/retrospective-on-leaving-academia-for-industry-data-science\">what I think about the transition in retrospect</a>), I've started receiving a lot of requests for advice on making that transition. Sometimes these requests come from former peers, former professors looking to …</p>",
  "content": "<p>Ever since I've started writing about my transition from academia to industry (both <a href=\"http://tommyblanchard.com/reasons-i-left-academia\">my reasons for leaving</a> and <a href=\"http://tommyblanchard.com/retrospective-on-leaving-academia-for-industry-data-science\">what I think about the transition in retrospect</a>), I've started receiving a lot of requests for advice on making that transition. Sometimes these requests come from former peers, former professors looking to advise students, or just someone who read one of my blog posts online.</p>\n<p>I'm always happy to reply to these requests as best as I can given my experiences, but I figured since so many people seem interested I it might be useful to put my thoughts in a blog post.</p>\n<h2>What do I need to know to be a data scientist?</h2>\n<p>My main message to most of the people that have been asking me for advice is not to worry too much. People seem to think you need to know everything to be a data scientist. If you have a PhD in the sciences or any quantitative discipline, you're likely most of the way to having the skills you need, so don't be scared to take that next step (by just looking at and applying to jobs). Put yourself out there and let potential employers decide whether you have the skills to work for them or not, don't do their job for them.</p>\n<p>If you really want to know what I think are the essentials to get a first data science position, the main classes of skills you need to have should come as no surprise:</p>\n<ol>\n<li><strong>Be a decent programmer</strong>: Python and R are the languages that are most common. Being comfortable in both opens more doors, but you can make due with one or the other. SQL is also used frequently, so at least do a short tutorial on it (basic queries are simple enough that it's not super difficult to pick up the necessities).</li>\n<li><strong>Know some machine-learning</strong>: You should understand basic machine-learning concepts and have at some experience with some of the most common algorithms (like tree-based methods, logistic regression, dimensionality reduction, etc.)</li>\n<li><strong>Know some traditional stats</strong>: You should know about p-values, regressions, t-tests, statistical significance.</li>\n</ol>\n<p>These are the bare essentials. You'll need to be more than just 'decent' in at least one of these categories (which one depends on the job, read on), but the point is, these should be skills you already have or could gain in a short period of time through some additional reading/practice. The skills involved in data science are so broad, no one is an expert in all of them. As long as you know the basics, and have some areas where you're particularly strong, you should be able to find a somewhere that your skills could be useful.</p>\n<h2>Other skills that are useful</h2>\n<p>Some people seem convinced that they need an understanding of every big data technology under the sun to be a data scientist. To the uninitiated, the bizarre names you might hear (Hadoop, Spark, MongoDB, etc.) just sound intimidating. The truth is, they're not that complicated, and you don't need to be an expert in them to get a data science job.</p>\n<p>Different data science teams use different tools. Some may use some big data tools for everything and really need someone who can jump into that workflow right away. But in my experience, the majority of data science jobs have these skills listed as 'Preferred but not required', if they're listed at all.</p>\n<p>Knowing specific packages and algorithms might be required by specific jobs. <strong>The best way to figure out what you might need to know for the kinds of jobs your interested in is to just start looking.</strong> Go to <a href=\"https://www.indeed.com/\">Indeed</a> or any other job posting site and just start looking at jobs. Find some that interest you, and figure out what skills they want, and get to work on those skills.</p>\n<h2>Where do I learn these skills?</h2>\n<p>Once you get a sense of what skills you might need to gain or strengthen, where do you go to get them? For almost any package under the sun, it's easy to just google a tutorial or free online course to learn the basics.</p>\n<p>Some people opt to go to boot camps. My overall opinion is that they are good for getting a general overview if you can afford to take a couple of months off full-time, but I don't think they are necessary.</p>\n<h4>Start applying/interviewing as early as possible</h4>\n<p>I find I learn best by being forced to solve problems. I think what taught me the most about being a data scientist was <em>applying and interviewing</em>. Interviewers will often give you a coding challenge or small project to work on at home before they bring you in for an in-person interview. These can be anything from a quick one hour coding exercise to a multi-day project where you have to implement a recommendation engine. These are great for learning, because they're nice small projects that are, by definition, what interviewers want you to know. Treating them as a learning exercise helps in two ways. First, they're efficient for learning skills. Second, it will take the edge off when, inevitably, you get rejected repeatedly after interviewing. Interviewing is hard and it can really suck to get rejected after you've put in a lot of time and effort and fallen in love with the idea of working at a particular company. A better mentality is to approach interviews as being a success as long as you've learned something.</p>\n<p>There are plenty of other good resources for learning some of the essential skills to being a data scientist. Here's a woefully incomplete guide:</p>\n<ol>\n<li>To brush up on programming, try the <a href=\"https://www.hackerrank.com/domains/tutorials/cracking-the-coding-interview\">Cracking the Coding Interview resources at HackerRank</a></li>\n<li>For machine-learning, <a href=\"https://www.amazon.com/gp/product/1461471370/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=1461471370&amp;linkCode=as2&amp;tag=tommyblanchar-20&amp;linkId=274873f56d6b671eec6503342836a1b7\">An Introduction to Statistical Learning</a> is excellent. <a href=\"https://www.amazon.com/gp/product/0387848576/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=0387848576&amp;linkCode=as2&amp;tag=tommyblanchar-20&amp;linkId=2bff6a12fa8c459f1187ee75759152df\">The Elements of Statistical Learning</a> is more comprehensive but denser.</li>\n<li>To just learn some basic packages and data skills, try working your way through some of the <a href=\"https://www.kaggle.com/c/titanic/details/tutorials\">Titanic tutorials at Kaggle</a></li>\n</ol>\n<h2>Conclusion</h2>\n<p>I think my main piece of advice is this: You're probably closer than you know to getting a data science interview, and you should take the next steps (looking at job listings, or applying to some of them) as early as possible to better guide your search. Good luck!</p>",
  "category": [
    "",
    "",
    "",
    "",
    ""
  ]
}