{
  "title": "How the OSS supported Yugoslavia independence movements in WWII &#8211; Interview with Blaz Torkar",
  "link": "http://warscholar.org/blaz-torkar-discusses-his-wwii-history-book-mission-yugoslavia-mcfarland-2020/",
  "pubDate": "Tue, 23 Feb 2021 03:22:00 +0000",
  "guid": "http://warscholar.org/?p=2636",
  "comments": "http://warscholar.org/blaz-torkar-discusses-his-wwii-history-book-mission-yugoslavia-mcfarland-2020/#respond",
  "wfw:commentRss": "http://warscholar.org/blaz-torkar-discusses-his-wwii-history-book-mission-yugoslavia-mcfarland-2020/feed/",
  "slash:comments": 0,
  "category": [
    "All WWII",
    "academic",
    "audio interviews",
    "author",
    "books",
    "Britain",
    "espionage",
    "germany",
    "McFarland",
    "podcast",
    "Russia",
    "United States",
    "wwII"
  ],
  "description": "How the OSS supported Yugoslavia independence movements in WWII – Interview with Blaz Torkar Check out this book here   https://amzn.to/2ZDmiwM Interview Timeline Blaž Torkar is an assistant professor of history at the Military Schools Centre of the Slovenian Armed forces. He researches the history of intelligence services, Allied military missions in Yugoslavia during WWII, the…",
  "enclosure": "",
  "itunes:subtitle": "How the OSS supported Yugoslavia independence movements in WWII – Interview with Blaz Torkar Check out this book here   https://amzn.to/2ZDmiwM Interview Timeline Blaž Torkar is an assistant professor of history at the Military Schools Centre of the Sl...",
  "itunes:summary": "<br />\nHow the OSS supported Yugoslavia independence movements in WWII &#8211; Interview with Blaz Torkar<br />\n<a href=\"https://amzn.to/2ZDmiwM\">Check out this book here</a>   <a href=\"https://amzn.to/2ZDmiwM\">https://amzn.to/2ZDmiwM</a><br />\nInterview Timeline<br />\nBlaž Torkar is an assistant professor of history at the Military Schools Centre of the Slovenian Armed forces. He researches the history of intelligence services, Allied military missions in Yugoslavia during WWII, the Yugoslav People&#8217;s Army and Territorial Defense, and the Slovenian War of Independence in 1991. He wrote a book on the OSS in Yugoslavia during WWII and we spoke about the book, the OSS, and Yugoslavian resistance movements. Mission Yugoslavia (McFarland, 2020)<br />\nK. Lyn Wurth talks about her novel about Calamity Jane <a href=\"https://wp.me/p7CDU9-56U\">https://wp.me/p7CDU9-56U</a><br />\nLaird Thompson talks about how he helped discover cosmic voids <a href=\"http://spacewalksmoneytalks.com/p/748\">http://spacewalksmoneytalks.com/p/748</a><br />\n1:05 &#8211; Blaz talks about his interest in the OSS in Yugoslavia.<br />\n2:18 &#8211; Blaz describes the OSS and SOE.<br />\n4:12 &#8211; Blaz talks about the resistance movements in Yugoslavia.<br />\n5:56 &#8211; Blaz talks about Churchill&#8217;s ULTRA reports.<br />\n8:54 &#8211; Blaz talks about OSS support to the Yugoslavian resistance movements.<br />\n11:11 &#8211; Blaz talks about problems between the US and the movements they supported.<br />\n12:54 &#8211; Blaz talks how the OSS did some fighting in Yugoslavia.<br />\n14:06 &#8211; Blaz talks about Soviet advisors in Yugoslavia in 1944.<br />\n14:36 &#8211; Blaz talks about the physical security used for the operations<br />\n16:03 &#8211; Blaz goes into details about how operations were run.<br />\n18:15 &#8211; Blaz talks about the Yugoslavs who worked for OSS.<br />\n20:39 &#8211; Blaz talks about prisoner exchanges for OSS members.<br />\n22:10 &#8211; Blaz talks about Americans captured by the Germans.<br />\n23:22 &#8211; Blaz talks about partisans who killed Americans.<br />\n23:52 &#8211; Blaz talks about the resistance in Serbian areas. [Note: Blaz noted later that he accidentally neglected to mention the first Serbian resistance at the start of the country and region&#8217;s occupation.  He states by email that at the beginning of the occupation of Serbia in 1941 the resistance largely spread but it it was brutally suppressed by the Germans.  Then resistance continued in Serbia in 1944.]<br />\n25:18 &#8211; Blaz talks about the impact the OSS had.<br />\n27:18 &#8211; Blaz talks about the archives he used.<br />\n28:38 &#8211; Blaz talks about speaking with OSS and SOE veterans.<br />\n29:39 &#8211; Blaz talks about the airfields used to fly OSS and Soe into Yugoslavia.<br />\n30:26 &#8211; Blaz talks about how the partisans kept these airfields secret.<br />\n34:56 &#8211; Blaz talks about the Americans picked for these missions.<br />\n35:24 &#8211; Blaz talks about some of the exceptions to whom the OSS recruited.<br />\n36:00 &#8211; Blaz talks about how OSS and MI-6 were treated in Yugoslavia.<br />\n36:55 &#8211; Blaz talks about how many missions were working in Yugoslavia but they refused to send troops there.<br />\n39:55 &#8211; Blaz talks about the OSS sending people into the wrong areas of Yugoslavia.<br />\n41:23 &#8211; Blaz talks about German spies among the partisans.<br />\n42:42 &#8211; Blaz talks about how he focused on northern Yugoslavia missions.<br />\n43:41 &#8211; Blaz talks about the strongly preserved memory of this fighting even today.<br />\n45:49 &#8211; Blaz talks about the memorials to US and British soldiers.<br />\n46:42 &#8211; Blaz talks about Yugoslav preservation of allied memorials.<br />\n48:28 &#8211; Blaz talks about the discussions of the Yugoslavia post-war regimes.<br />\n49:30 &#8211; Blaz talks about Yugoslav history books highlighted Soviet help.<br />\n51:24 &#8211; Blaz talks about the so called betrayal o...",
  "itunes:author": "Cris Alvarez",
  "itunes:image": "",
  "itunes:duration": "1:04:27",
  "post-id": 2636
}