{
  "title": "Do you want to be happy? | Tony, Sage and Michael Singer on breaking patterns and finding inner peace",
  "pubDate": "Wed, 21 Nov 2018 23:08:15 +0000",
  "guid": "ba09525c902649c7b9a67e620753d1b2",
  "link": "https://tonyrobbins.libsyn.com/do-you-want-to-be-happy-tony-sage-and-michael-singer-on-breaking-patterns-and-finding-inner-peace",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">What does it take to be happy?</span></p> <p><span style=\"font-weight: 400;\">We live in a culture where happiness is largely based on external forces - like what we get and what we achieve. And when our life conditions don’t match our expectations, we experience pain and fear. We suffer. But imagine what it would feel like to create a constant sense of inner peace and freedom, and live each day in a beautiful state.</span></p> <p><span style=\"font-weight: 400;\">In this episode of the Tony Robbins Podcast, you’ll hear a very special conversation with Tony, Sage and Michael Singer, renowned teacher and author of the #1 New York Times bestseller</span> <a href= \"https://untetheredsoul.com/\"><span style=\"font-weight: 400;\">The Untethered Soul</span></a><span style=\"font-weight: 400;\">. They discuss what happiness really is, and what’s preventing you from living a life of peace and joy. They dive into the thoughts, beliefs and behaviors that are limiting your consciousness, and shed light on the ways you can commit to the new habits and patterns that will allow you to let go of pain and suffering and start living a life of self-realization.</span></p> <p><span style=\"font-weight: 400;\">Discover what’s holding you back from being happy. Tap into unique methods of meditation and mindfulness that you can use to start living in the present moment. This is the time to take the risk and let go of your pain, step into the unknown, and allow life to unfold in the beautiful way it is meant to.</span></p> <p><br /></p>",
  "content:encoded": "<p>What does it take to be happy?</p> <p>We live in a culture where happiness is largely based on external forces - like what we get and what we achieve. And when our life conditions don’t match our expectations, we experience pain and fear. We suffer. But imagine what it would feel like to create a constant sense of inner peace and freedom, and live each day in a beautiful state.</p> <p>In this episode of the Tony Robbins Podcast, you’ll hear a very special conversation with Tony, Sage and Michael Singer, renowned teacher and author of the #1 New York Times bestseller <a href= \"https://untetheredsoul.com/\">The Untethered Soul</a>. They discuss what happiness really is, and what’s preventing you from living a life of peace and joy. They dive into the thoughts, beliefs and behaviors that are limiting your consciousness, and shed light on the ways you can commit to the new habits and patterns that will allow you to let go of pain and suffering and start living a life of self-realization.</p> <p>Discover what’s holding you back from being happy. Tap into unique methods of meditation and mindfulness that you can use to start living in the present moment. This is the time to take the risk and let go of your pain, step into the unknown, and allow life to unfold in the beautiful way it is meant to.</p> <p></p>",
  "enclosure": "",
  "itunes:duration": "01:25:57",
  "itunes:explicit": false,
  "itunes:keywords": "happiness,Michael,singer,Spirituality,tony,robbins",
  "itunes:subtitle": "What does it take to be happy? We live in a culture where happiness is largely based on external forces - like what we get and what we achieve. And when our life conditions don’t match our expectations, we experience pain and fear. We suffer. But...",
  "itunes:episodeType": "full"
}