{
  "title": "Dead And Decaying On The Floor | True Ghost Stories",
  "link": "https://audioboom.com/posts/8165758",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2106,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Today on a chilling episode of real ghost stories online that some believe was the inspiration for Tammy Faye Bakers makeup and eventual divorce from Jim Baker. <br>\n<br>\nWe asked Jim to comment, but we didn’t hear back, as he was too busy convincing a bunch of rubes to purchase water laced with Silver! As this evil, demented man lines his pockets and claims that the lord spoke to him and encouraged him to rape the wallets of these idiots he calls followers. <br>\n<br>\nSatan did however get back to us, and let us know that he as a special place in hell for Jim Baker once he kicks it.   <br>\n<br>\nWhen a woman learns that her neighbor has been laying on the floor of his own home, dead and decaying for weeks before someone noticed,  a grim feeling begins to set in around the neighborhood. <br>\n<br>\nAs slowly, items start moving on their own, and a very real sense that this former neighbor may not have traveled all too far from the place of his death. As his spirit seems to take up new residence with unsuspecting neighbors that fear what he could do on the other side. <br>\n<br>\nThat’s story and much more, today, on Real Ghost Stories Online.<br>\n<br>\n<strong>If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!</strong><br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\nWatch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\nFollow Tony:<br>\nInstagram: <a href=\"http://http//www.instagram.com/tonybrueski\">HTTP://www.instagram.com/tonybrueski</a><br>\nTikToc: <a href=\"https://www.tiktok.com/@tonybrueski\">https://www.tiktok.com/@tonybrueski</a><br>\nFacebook: <a href=\"https://www.facebook.com/tony.brueski\">https://www.facebook.com/tony.brueski</a>\n</div>\n",
  "pubDate": "Tue, 11 Oct 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-09-29:/posts/8165758",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}