{
  "title": "WHAT HAPPENED BETWEEN OLIVIA O'BRIEN AND PETE DAVIDSON? — BFFs EP. 87",
  "description": "<p>We are joined this episode by Olivia O'Brien for the (technically) second time after she made a cameo in Mike Majlak's appearance. We start the show with what turns out to be an absolute evisceration of Olivia's latest ex, and are not at all shocked to find out that he follows Dave.\n\nWe then get into Olivia's music career, her strategy of releasing songs instead albums to get her music out there, Alex Cooper starring in her music video, Logan Paul coming out at her Coachella set, and we end with a teaser of her new song \"Got My Bitch Back\" (rendition in the podcast performed by Tommy Smokes as the actual song is not out until early July).\n\nWe find out what is really going on with her and Logan, her past relationship with Todd Smith, and may have actually stumbled into some Pete Davidson tea that no one has talked about before. \n\nWe finish Olivia's interview with a game of FMK including Logan Paul, Mike Majlak, Jake Paul, Stassie Baby, Father Kels, Victoria Villarroel, Pete Davidson, Todd Smith, Bryce Hall, Griffin Johnson, and Josh Richards.\n\nNext up are headlines with Khaby Lame passing Charli D'Amelio as the most followed Tik Tokker and the Post getting cancelled for their headline, Charli and Landon Barker dating leading to Huddy unfollowing Charli and her whole family, Tommy Fury backing out of the Jake Paul fight, Jeff Wittek suing David Dobrik for $10m and David being defended by Johnny Depp's lawyers, Zack Bia and Olivia Rodrigo dating and if it is a coverup for a real Vinnie Hacker relationship, Ben Affleck's 10 year old son taking his dad's Lambo for a joyride, and Hailey Bieber being sued over her company Rhode.\n\nWe finish with BFFs corner where Josh may have went as Jaden at VidCon, his new deal with Amazon TNF, and Harry Jowsey potentially having beef with O'Malley.\n\nSupport our sponsors!\n\nSummer: Download Summer today at https://barstool.link/SummerBFFs \n\nWould: Shop Would at https://barstool.link/wouldBSS or at your local CVS.\n\nWhatnot: Download the Whatnot App today. Go to https://barstool.link/WhatnotBSS to get $10 off your first purchase on Whatnot.</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/bffspod\">barstool.link/bffspod</a></p>",
  "guid": "e74c7fb1-bed7-401a-acb0-936926e5309b",
  "pubDate": "Thu, 30 Jun 2022 00:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/134/Bffs",
  "itunes:explicit": "yes",
  "itunes:duration": "01:05:42",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}