{
  "title": "Apply Al Techniques to Solve Wireless Communications System Design Challenges",
  "link": "https://engineeringresources.spectrum.ieee.org/free/w_math06/prgm.cgi",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/apply-al-techniques-to-solve-wireless-communications-system-design-challenges.gif?id=31450905&width=1200&height=800&coordinates=82%2C0%2C82%2C0\"/><br/><br/><p>The webinar explores the use of artificial intelligence (AI) to solve wireless communications problems. After brief introductions of machine learning, deep leaning and reinforcement learning methodologies, we will cover typical applications, including how standards bodies are incorporating AI techniques in wireless standards. Learn the AI-driven system design workflow, and how to streamline data generation process, AI networks training, and design validation and testing. And, how to simplify deployment of your AI networks on embedded devices, enterprise systems and easily leverage existing deep learning networks outside MATLAB.</p> <p>Highlights include:</p> <ul> <li>Generate training data in the form of synthetic and over-the-air signals</li> <li>Design and train AI models using interactive tools</li> <li>Perform large-scale simulation to test and validate trained networks</li> <li>Deploy validated models to enterprise or embedded systems</li> <li>How to easily interoperate with models developed in 3rd party environments such as python</li> </ul> <p><strong>Speakers</strong>:</p> <p><strong>Houman Zarrinkoub, PhD.</strong>, <em>Principal Wireless Communications Product Manager, MathWorks</em></p> <ul> <li>Dr. Houman Zarrinkoub is the principal product manager at MathWorks responsible for wireless communications products. During his 20-year tenure at MathWorks, he has also served as a development manager and has been responsible for multiple signal processing and communications software tools. Prior to MathWorks, he was a research scientist working on mobile and voice coding technologies in the Wireless Group at Nortel Networks. He has been awarded multiple patents on topics related to computer simulations of signal processing applications. Houman is the author of the book Understanding LTE with MATLAB: From Mathematical Modeling to Simulation and Prototyping. He holds a B.Sc. degree in electrical engineering from McGill University and M.Sc. and Ph.D. degrees in telecommunications from the University of Quebec, in Canada.</li> </ul>",
  "pubDate": "Fri, 02 Sep 2022 15:41:18 +0000",
  "guid": "https://engineeringresources.spectrum.ieee.org/free/w_math06/prgm.cgi",
  "category": "Type:webinar",
  "dc:creator": "MathWorks",
  "media:content": ""
}