{
  "title": "Solar-to-Jet-Fuel System Readies for Takeoff",
  "link": "https://spectrum.ieee.org/solar-to-jet-fuel-system-readies-for-take-off",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-large-outdoor-tower-reflects-sunlight-on-large-mirrors.jpg?id=30458951&width=1200&height=800&coordinates=0%2C125%2C0%2C125\"/><br/><br/><p><sub></sub>As climate change edges from crisis to emergency, the aviation sector looks set <a href=\"https://apnews.com/article/climate-technology-travel-england-airlines-bc00fe2b83f362f58d4ecbe2d1f7c1d7\" target=\"_blank\">to miss its 2050 goal</a> of net-zero emissions. In the five years preceding the pandemic, the top four U.S. airlines—<a href=\"https://www.aa.com/homePage.do\" target=\"_blank\">American</a>, <a href=\"https://www.delta.com/\" target=\"_blank\">Delta</a>, <a href=\"https://www.southwest.com/\" target=\"_blank\">Southwest</a>, and <a href=\"https://www.united.com/en/us\" target=\"_blank\">United</a>—saw a 15 percent increase in the use of jet fuel. Despite continual improvements in engine efficiencies, that number is projected to keep rising.<br/></p><p>A glimmer of hope, however, comes from solar fuels. For the first time, scientists and engineers at the <a href=\"https://ethz.ch/en.html\" target=\"_blank\">Swiss Federal Institute of Technology</a> (ETH) in Zurich have reported a successful demonstration of <a href=\"https://www.cell.com/joule/fulltext/S2542-4351(22)00286-0\" target=\"_blank\">an integrated fuel-production plant for solar kerosene</a>. Using concentrated solar energy, they were able to produce kerosene from water vapor and carbon dioxide directly from air. Fuel thus produced is a drop-in alternative to fossil-derived fuels and can be used with existing storage and distribution infrastructures, and engines.</p><p>Fuels derived from <a href=\"https://www.sciencedirect.com/topics/engineering/syngas\" target=\"_blank\">synthesis gas</a> (or syngas)—an intermediate product that is a specific mixture of carbon monoxide and hydrogen—is a known alternative to conventional, fossil-derived fuels. Syngas is produced by <a href=\"https://www.sciencedirect.com/topics/engineering/fischer-tropsch-process\" rel=\"noopener noreferrer\" target=\"_blank\">Fischer-Tropsch (FT) synthesis</a>, in which chemical reactions convert carbon monoxide and water vapor into hydrocarbons. The team of researchers at ETH found that a solar-driven thermochemical method to split water and carbon dioxide using a metal oxide redox cycle can produce renewable syngas. They <a href=\"https://spectrum.ieee.org/rooftop-solar-refinery-produces-carbonneutral-fuels\" target=\"_blank\">demonstrated the process</a> in a rooftop solar refinery at the <a href=\"https://www.ittenbrechbuehl.ch/en/projects/machine-laboratory-eth-zurich/\" target=\"_blank\">ETH Machine Laboratory</a> in 2019.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Close-up of a spongy looking material\" class=\"rm-shortcode\" data-rm-shortcode-id=\"2a0b09362fae33e4f819e43a52223952\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"2f2cf\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/close-up-of-a-spongy-looking-material.jpg?id=30459194&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Reticulated porous structure made of ceria used in the solar reactor to thermochemically split CO2 and H2O and produce syngas, a specific mixture of H2 and CO.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">ETH Zurich</small></p><p>The current pilot-scale solar tower plant was set up at the <a href=\"https://www.energy.imdea.org/\" target=\"_blank\">IMDEA Energy Institute</a> in Spain. It scales up the solar reactor of the 2019 experiment by a factor of 10, says <a href=\"https://ipe.ethz.ch/people/iepe-professors/Steinfeld.html\" rel=\"noopener noreferrer\" target=\"_blank\">Aldo Steinfeld</a>, an engineering professor at ETH who led the study. The fuel plant brings together three subsystems—the solar tower concentrating facility, solar reactor, and gas-to-liquid unit.</p><p>First, a heliostat field made of mirrors that rotate to follow the sun concentrates solar irradiation into a reactor mounted on top of the tower. The reactor is a cavity receiver lined with reticulated porous ceramic structures made of ceria (or cerium(IV) oxide). Within the reactor, the concentrated sunlight creates a high-temperature environment of about 1,500 °C which is hot enough to split captured carbon dioxide and water from the atmosphere to produce syngas. Finally, the syngas is processed to kerosene in the gas-to-liquid unit. A centralized control room operates the whole system.</p><p>Fuel produced using this method closes the fuel carbon cycle as it only produces as much carbon dioxide as has gone into its manufacture. “The present pilot fuel plant is still a demonstration facility for research purposes,” says Steinfeld, “but it is a fully integrated plant and uses a solar-tower configuration at a scale that is relevant for industrial implementation.”</p><p>“The solar reactor produced syngas with selectivity, purity, and quality suitable for FT synthesis,” the authors noted in their paper. They also reported good material stability for multiple consecutive cycles. They observed a value of 4.1 percent solar-to-syngas energy efficiency, which Steinfeld says is a record value for thermochemical fuel production, even though better efficiencies are required to make the technology economically competitive.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Schematic of the solar tower fuel plant.  \" class=\"rm-shortcode\" data-rm-shortcode-id=\"33a694ae31e02b5fac627152ccbe2551\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"ff8ef\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/schematic-of-the-solar-tower-fuel-plant.jpg?id=30459216&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">A heliostat field concentrates solar radiation onto a solar reactor mounted on top of the solar tower. The solar reactor cosplits water and carbon dioxide and produces a mixture of molecular hydrogen and carbon monoxide, which in turn is processed to drop-in fuels such as kerosene.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">ETH Zurich</small></p><p>“The measured value of energy conversion efficiency was obtained without any implementation of heat recovery,” he says. The heat rejected during the redox cycle of the reactor accounted for more than 50 percent of the solar-energy input. “This fraction can be partially recovered via thermocline heat storage. Thermodynamic analyses indicate that sensible heat recovery could potentially boost the energy efficiency to values exceeding 20 percent.”</p><p>To do so, more work is needed to optimize the ceramic structures lining the reactor, something the ETH team is actively working on, by looking at 3D-printed structures for improved volumetric radiative absorption. “In addition, alternative material compositions, that is, perovskites or aluminates, may yield improved redox capacity, and consequently higher specific fuel output per mass of redox material,” Steinfeld adds.</p><p>The next challenge for the researchers, he says, is the scale-up of their technology for higher solar-radiative power inputs, possibly using an array of solar cavity-receiver modules on top of the solar tower.</p><p>To bring solar kerosene into the market, Steinfeld envisages a quota-based system. “Airlines and airports would be required to have a minimum share of sustainable aviation fuels in the total volume of jet fuel that they put in their aircraft,” he says. This is possible as solar kerosene can be mixed with fossil-based kerosene. This would start out small, as little as 1 or 2 percent, which would raise the total fuel costs at first, though minimally—adding “only a few euros to the cost of a typical flight,” as Steinfeld puts it</p><p>Meanwhile, rising quotas would lead to investment, and to falling costs, eventually replacing fossil-derived kerosene with solar kerosene. “By the time solar jet fuel reaches 10 to 15 percent of the total jet-fuel volume, we ought to see the costs for solar kerosene nearing those of fossil-derived kerosene,” he adds.</p><p>However, we may not have to wait too long for flights to operate solely on solar fuel. A commercial spin-off of Steinfeld’s laboratory, <a href=\"https://synhelion.com/\" target=\"_blank\">Synhelion</a>, is working on commissioning the first industrial-scale solar fuel plant in 2023. The company has also collaborated with the <a href=\"https://synhelion.com/news/swiss-will-be-the-world-s-first-airline-to-use-synhelion-s-solar-fuels\" rel=\"noopener noreferrer\" target=\"_blank\">airline SWISS</a> to conduct a flight solely using its solar kerosene.</p>",
  "pubDate": "Wed, 03 Aug 2022 17:00:00 +0000",
  "guid": "https://spectrum.ieee.org/solar-to-jet-fuel-system-readies-for-take-off",
  "category": [
    "Jet fuel",
    "Aviation",
    "Solar power",
    "Solar energy"
  ],
  "dc:creator": "Payal Dhar",
  "media:content": ""
}