{
  "title": "Stop Building Prisons w/ Sashi James, Maggie Luna, Avalon Betts-Gaston",
  "link": "https://failedarchitecture.com/podcast/stop-building-prisons-w-sashi-maggie-avalon-and-christin/",
  "pubDate": "Tue, 09 Aug 2022 03:47:29 +0000",
  "dc:creator": "Christin Hu",
  "guid": "https://failedarchitecture.com/?post_type=podcast&#038;p=29167",
  "description": "",
  "itunes:subtitle": "",
  "itunes:keywords": "abolitionism,affordable housing,Design as Protest,design justice,FreeHer,housing,mass incarceration,no new jails,no new prisons,prison industrial complex,reimagining communities,Restorative justice",
  "content:encoded": "<p><em>Listen to this episode and subscribe to the FA podcast on </em><a href=\"https://podcasts.apple.com/nl/podcast/failed-architecture/id1384867713?l=en#episodeGuid=https%3A%2F%2Ffailedarchitecture.com%2F%3Fpost_type%3Dpodcast%26p%3D18764\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Apple Podcasts</em></a><em>, </em><a href=\"https://open.spotify.com/show/5EhtD8p4pBAq4kY7P8ChKu?si=DLkn-JLDQIC4cI48pOQrgg\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Spotify</em></a><em>, </em><a href=\"https://www.stitcher.com/podcast/failed-architecture\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Stitcher</em></a> or<em> </em><a href=\"https://overcast.fm/\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Overcast</em></a><em>.<br />\n</em><br />\nFor Breezeblock #30, editor christin hu chats with community organizers <span style=\"font-weight: 400;\">Maggie Luna, Avalon Betts-Gaston, and Sashi James about their recent action at HDR (Henningson, Durham, Richardson), one of the largest architecture firms in the world, who are responsible for designing hundreds of prisons. Together, they discuss the reasons why architects should refuse to take part in the building of prisons and what they can do instead.</span></p>\n<p>On June 24, <a href=\"https://www.nationalcouncil.us/\" target=\"_blank\" rel=\"noopener\">The National Council for Incarcerated and Formerly Incarcerated Women and Girls</a>,<a href=\"https://www.justiceashealing.org/\" target=\"_blank\" rel=\"noopener\"> Families for Justice as Healing</a>,<a href=\"https://www.lionessjiwa.org/\" target=\"_blank\" rel=\"noopener\"> Lioness: Justice Impacted Women’s Alliance</a>,<a href=\"https://www.dapcollective.com/\" target=\"_blank\" rel=\"noopener\"> Design as Protest</a>, <a href=\"https://texascje.org/\" target=\"_blank\" rel=\"noopener\">Texas Statewide Leadership Council</a>, and<a href=\"https://www.ilarj.org/\" target=\"_blank\" rel=\"noopener\"> Illinois Alliance for Reentry & Justice</a> organized an action outside of HDR&#8217;s office in Chicago (same day as the AIA conference) demanding that this international Architecture, Engineering, and Planning firm stop designing prisons (they have designed over 275). This marks just one of many actions inviting HDR to work with (rather than against) communities over the past years.</p>\n<p>Read the full statement of demands <a href=\"http://bit.ly/HDRNoNewPrisons\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">here</span></a> and original letter to HDR <a href=\"https://docs.google.com/document/d/16mvQC1NwgTsEIf78HaAB7KWk-LGPlxyjfSaFUXuKQpk/edit\" target=\"_blank\" rel=\"noopener\">here</a>. Below is an edited transcription of the conversation. Some links and resources are provided at the end of the article.</p>\n<p>TRANSCRIPTION</p>\n<p><strong>christin (CH):</strong> Hello and welcome to Failed Architecture Breezeblocks, where our editors share their thoughts on works in progress, urgent matters and current happenings in architecture and spatial politics. My name is christin hu and I&#8217;m an editor on Failed Architecture&#8217;s New York City team, and I&#8217;m here with Maggie Luna, Avalon Betts-Gaston and Sashi James, who have been organizing against the building of prisons.</p>\n<p><strong>Maggie (ML):</strong> Hi, I&#8217;m Maggie Luna. I am in Texas. I work with the Statewide Leadership Council. I am a community outreach coordinator and lead organizer for formerly incarcerated people and advocates in Texas.</p>\n<p><strong>Avalon (AB):</strong> Hi, thanks for having me. My name is Avalon Betts-Gaston. I am the project manager for the Illinois Alliance for Reentry and Justice. Obviously, we&#8217;re out of Illinois. We&#8217;re a coalition of directly impacted people, service providers, stakeholders and allies all united to remaking the criminal legal system. Thanks for having me.</p>\n<p><strong>Sashi (SJ):</strong> Hi, I&#8217;m Sashi James, and I&#8217;m in Families for Justice as Healing, and the National Council for Incarcerated and Formerly Incarcerated Women and Girls. I am a daughter of formerly incarcerated parents, and I&#8217;m the Reimagining Communities director based in Massachusetts, but I&#8217;m from New York. And I&#8217;m really excited to be here. Thank you for giving us this platform.</p>\n<p><strong>CH:</strong> Awesome. Just to kind of kick off our conversation give an intro to the folks who are listening in&#8230; On June 24, The National Council for Incarcerated and Formerly Incarcerated Women and Girls, Families for Justice as Healing, Lioness: Justice Impacted Women&#8217;s Alliance, Design As Protest, Statewide Leadership Council, and Illinois Alliance for Reentry and Justice organized an action outside of HDR&#8217;s office in Chicago, which was the same day as the AIA (American Institute of Architects) Conference. They were demanding that this international architecture, engineering and planning firm, stop designing prisons, of which they’ve designed over 275. So just to kind of kick off our questions here, and I’ll direct this to Sashi, who has been lead organizer for this effort, but since the action, have you been able to meet with HDR leadership at all?</p>\n<p><strong>SJ:</strong> No, we have not heard anything from the HDR leadership team. And I just wanted to also say that the standout that we had was one of many standouts. We have come to their front door many times in Massachusetts &#8211; we actually organized about a two-month stand out in front of their office right in downtown. We never heard anything then, and we still haven&#8217;t heard anything now. And this is multiple times that we&#8217;ve actually met them where they&#8217;re at. So it’s disappointing as a community organizer.</p>\n<p><strong>AB:</strong> I mean, I&#8217;d like to jump in, I feel like they’re being unresponsive to our invitation to work with us, to design things that our communities need. And the last thing that we need are more jails and prisons, because those have only really produced more harm in the communities that have been disproportionately affected by the building of jails and prisons. And so this has been an open invitation to begin to discuss what different looks like. How can we actually work together in concert to build communities up, and not prisons and jails. And so we can&#8217;t stop. This campaign, this project, this effort can&#8217;t stop, because we&#8217;re really talking about lives and liberty of actual human beings. So the importance of the stopping of designing and buildings of jails and prisons is, is vital to our communities. And so, you know, we will continue to put pressure on different pressure points in the industry. So we again, extended an invitation for HDR to come and talk to us, to understand what our concerns are and why we don&#8217;t need new jails and prisons to be built in our country. And their refusal to even engage in a conversation with us is really more indicative of them and the position that they&#8217;re taking, than of us, because we focus on harm reduction in every aspect. And so that is why we wanted to speak with them, to explain to them how this hurts our communities. And if their only consideration is how much money they can make off the caging of people, then that&#8217;s going to be their problem. We&#8217;re going to continue to put pressure on new architects, and students who want to become architects. We&#8217;re going to find and talk to everybody in this industry to explain to them why the building of prisons and jails is very harmful to communities, and specifically, communities of color and poor communities. And so their reticence to speak with us is not going to diminish our efforts in any way, shape, or form.</p>\n<p><strong>CH:</strong> Yeah, I hear that. And actually, a lot of our audiences are young architects or, you know, folks who are entering the profession. So hopefully they listen in and hear this. It&#8217;s really important discussion. And on that point, too—I know you haven&#8217;t heard anything from HDR specifically—but perhaps you&#8217;ve heard other questions or oppositions?</p>\n<p><strong>ML:</strong> I think the most common opposition that I hear whenever I bring this up in any conversation is, “Well, we just want to make it ‘better’ for women.” And that is aggravating because none of these people who have spoken to me have actually been inside of a prison, and there&#8217;s nothing that you can do. I don&#8217;t care if you give me Louis Vuitton sheets and house slippers, you know? I&#8217;m still in a prison, I&#8217;m still separated from my family, I&#8217;m still not being prepared with resources to reenter society successfully, and then I&#8217;m still going to have that stigma when I walk out that I have now a felony or whatever that I have to take care of. So, it doesn&#8217;t matter how pretty you make it, how many gardens you put on it. The fact is, there’s harm. And we&#8217;re doing harm not only to that person, but to the families. And so when you harm those families, you&#8217;re harming communities. At the end of the day, if you really say you care about community safety, then you should be focusing on investing in housing for families to stay together, so the communities can stay safe.</p>\n<p><strong>CH:</strong> That point could not be emphasized more. It&#8217;s still a prison. And I&#8217;ve seen a lot of architects also labeling these as “justice centers,” or, you know, using these euphemisms, like “feminist jail.” I&#8217;m like, “Okay, well, look, it&#8217;s still a jail, right?”</p>\n<p><strong>AB:</strong> And I&#8217;d like to add to what sister Maggie just talked about. So above and beyond the immediate and direct harm to the family—and therefore, by extension to the community—of removing someone, specifically people who the system identifies as women or who may self-identify as female, and putting them into these women&#8217;s facilities, there is one other glaring truth: the culture inside of these institutions is such that every single day, women are either witness to, or the subject of sexual, verbal, and/or physical abuse—and that is driven by the culture. There is no amount of paint, there is no amount of posh, and there is no amount of anything else that you can use to design away the culture. That is really the problem with the so-called “feminist jails” and “trauma informed prisons”. Using this language is to soften what these buildings actually are; because of that culture that is embedded in and cannot be taken out of those institutions, by paint, by design, by any of those things, because you cannot remove that—you [architects] cannot prevent the people who are housed in those institutions from experiencing that specific type of harm. So when you think about it, there&#8217;s no there&#8217;s no workaround for that cultural problem that is just pervasive in every single facility that houses women, or people who are nonbinary, or people who identify as women. And you don&#8217;t have to believe me, just do Google searches on how many prisons in Illinois or in the United States have had officers arrested as a result of sexual misconduct—that&#8217;s the most egregious one: rape and sexual misconduct. What&#8217;s not being reported are the everyday verbal and physical assaults that are happening, and so when you think about how much harm is committed inside of those institutions, I just need to really emphasize that there&#8217;s no designing that away, you cannot design that away.</p>\n<p><strong>SJ:</strong> Touching on what Miss Avalon and Miss Maggie said is that, also, the prison or jail does not get to the root issue of why women are even getting inside of the prison in the first place. And then on top of not addressing the root issue of the harm that they already were dealing with, now it&#8217;s [the building of prisons and jails] only causing more harm to these women. And my issue with HDR is, when I was actually on the call when they were presenting what a so-called “trauma-informed prison” would look like, one of the things that stood out to me the most was that they are putting a nursery inside of this prison, and allowing women that are pregnant and incarcerated to have their child for up to one year to be with the child when their child is born. And so as a mother, I&#8217;m like, okay, so we feel safe enough to allow our women to be inside of a cage, inside of this violent community, because we know what Miss Avalon said about all the all the harm that&#8217;s happening inside of prisons, where it&#8217;s supposed to just be a place where you [the institution] are supposed to be caring for people&#8217;s lives—because if you take women from the community, that&#8217;s your responsibility to make sure that they&#8217;re safe, where they&#8217;re at, but there is still harm being done. Now we&#8217;re putting children inside of this cage, I mean, with women who are supposedly not even safe enough to be in the community—where are we going with this, right? How do you even feel comfortable allowing a woman to have a baby if she&#8217;s so harmful? So that means we need to start to reevaluate the situation, and figure out how we can allow this mother to be a mother in her community. And that&#8217;s all that we&#8217;re saying.</p>\n<p>I don&#8217;t know what it&#8217;s like in Texas or Chicago, but in Massachusetts, it costs $162,000 to keep a woman incarcerated. And for us, the number one reason why a woman is incarcerated is because they don&#8217;t have access to housing. And so when you talk about a woman, I have an access to housing 82% of those women are mothers not having access to housing. And as a mother, as a mother myself, I would do the most vulnerable thing to provide for my child. So if we had $50 million here in Massachusetts, to build a new women&#8217;s prison, why aren’t we thinking about using some of that funding to build housing for our mothers and our children, so that they&#8217;re not causing more harm in the community? And so to go back to what I was talking about, we don&#8217;t want to take money from architects! We understand that y&#8217;all have to feed your families, just like we have to feed our families. But what we know is that if you build a new prison, they&#8217;re gonna figure out how to put our children in those new prisons—our granddaughters in those new prisons. And that&#8217;s what we&#8217;re putting a stop to, because change starts with us, and we&#8217;re going to be that change. We&#8217;re saying that we don&#8217;t need a new women&#8217;s prison and that we need different. And so that&#8217;s why we&#8217;re calling on y&#8217;all [architects and building industry professionals] to respond. And so I just felt like I had to get that out.</p>\n<p><strong>CH:</strong> Thank you so much for sharing that—that&#8217;s a really critical message. If the main cause for being incarcerated in Massachusetts is lack of housing, well, architects, we could design housing!</p>\n<p><strong>ML:</strong> I want to just want to add to what both Avalon and Sashi said. The humiliation that I experienced inside of jails and prison, had nothing to do with the architect with the way it was built. These people get into these positions, and go on these power trips and feel like it is their mission to dehumanize you, it just makes me so fearful that they are thinking about putting children in these situations. There might be six wonderful COs [Correctional Officers] that would be very loving, but there&#8217;s going to be that one that wants to come in and ruin that person&#8217;s life. And it doesn&#8217;t matter what they say, you know, some of these things stick with us for the rest of our lives, and I mean, that just has to be remembered that you cannot build a feminist jail—it’s an oxymoron—it doesn&#8217;t make sense. It’s ridiculous that we&#8217;re even thinking like that.</p>\n<p><strong>AB:</strong> I serve time with women who gave birth, while incarcerated, and the trauma of giving birth shackled and chained to a hospital bed with an officer in the room with you, as if you are going to pop out and run with a baby coming out of your body, as if you&#8217;re some type of threat in the midst of childbirth or your visits when you go to have your prenatal care—if you get prenatal care, let&#8217;s just say that, if you even get proper prenatal care—being handcuffed and shackled during those visits, just the thought of that experience just breaks my heart. And then we&#8217;re going to say we want to bring children into that culture for year. And I&#8217;m not advocating for extending that, but whether I snatch that baby out of that mother&#8217;s arms on day one, or day 366, I&#8217;m still snatching that baby out of that mother&#8217;s arms. If we allow women to care and nurture their children for a year—to just kind of emphasize and echo what Sashi said—if we said, “hey, it&#8217;s safe enough for you to do this with this child, so you are safe enough to have this baby around you for 12 months,” how then can we in the same breath, say that this person, this parent, is not safe enough to be in their community? I don&#8217;t understand that logic. It doesn&#8217;t make any sense to me. And then the harm on that family and especially on that child, like Maggie said, you could have—I can&#8217;t say we had six good COs—but you could have six good COs, but there&#8217;s always going to be the one who is bound and determined to harm you with words and action. They will denigrate your child just as much as they denigrate you.</p>\n<p>Again, just pointing out this cultural problem, architects cannot fix that [harm]. And here&#8217;s one of the main reasons why you can&#8217;t fix it, which is why you shouldn&#8217;t partake in it: the training. They train them [COs] using military training techniques and strategies. When you think about that, when we train our military, there has to be an enemy, right? So there has to be an enemy. Who do you think the enemy is, inside of our prisons and jails? Those that are incarcerated in those cages are, as a result of the training that they receive, are the enemy. And if you are the enemy, I don&#8217;t have to treat you as if you&#8217;re human, I don&#8217;t have to do things in a way that I would to someone that is not my enemy, right? Pretty will not change that right? Like pretty can&#8217;t change that. And so that is why it&#8217;s imperative that those in the industry of design, engineering, and building recognize that you’re contributing to that very distinct harm happening inside of those facilities that you build. You do not get to say, “Well, we just built it, we&#8217;re not responsible for happens for what happens on the inside.” And that is really the message that I am trying to get across. Like Sashi said, we&#8217;re not trying to take money, we want you to be able to feed and take care of your family. That&#8217;s the goal that we&#8217;re trying to have for the people in our community. The problem is, is that you&#8217;re [architects] not just “doing it [your job].” That&#8217;s not just the outcome. Yes, it takes care of your family, but it hurts whole communities.</p>\n<p><strong>CH:</strong> Yeah, exactly. And that&#8217;s a huge point, right? I mean, in asking an architect, who is further along the chain, they might not be the root cause of people getting incarcerated, but they&#8217;re still a part of that system. And so it&#8217;s almost like the bare minimum for architecture firms to just be like, actually, we just won&#8217;t do this [design and build prisons]. Right? You know, it&#8217;s not something too complicated. And we have seen architecture firms take a stance on, for example, the war in Ukraine, and being like, “Oh, we&#8217;re not going to work with Russia.” Okay, so you&#8217;re not gonna work with Russia, but you can&#8217;t stop building prisons, right? It&#8217;s like there&#8217;s this dissonance in the architecture industry: you&#8217;re saying you can&#8217;t do this, but at the same time, you&#8217;ve literally done this very thing. You know, I think that&#8217;s a really important point to hit home. And I mean, I really appreciate all of you sharing your experiences. And I know that there&#8217;s also a lot of labor that goes into this—this is very brave. I personally feel that architects need to do way more [to listen and learn from communities]. But you know, we appreciate the effort and the labor that it takes to bring the conversation to their doors, right to meet people where they&#8217;re at. And this [next question] is even going a step further, really. Let&#8217;s imagine HDR, or some other architecture firm, has agreed to stop building prisons or agree to be a part of a reparative process, let&#8217;s say, between grassroots organizations. What do you think that process would look like?</p>\n<p><strong>AB:</strong> Communities know what they need. Sashi outlines that, you know, one of the biggest contributors to harms that are happening in communities that result in the criminalization of specifically women, and those that identify as women and nonbinary, is lack of housing. All right, let&#8217;s get together, and instead of having $50 million dollars go towards building the prison, let the design industry and architecture say “No, you know what, we stand with them [the community], and we demand that the $50 million be spent on housing. And we will still do the work, but we want to go in this direction.” When we know that there are things like parks that communities don&#8217;t have that need them, communities who have been devastated by the war on drugs and mass incarceration, like all of the infrastructure, you know, that needs to be built and designed. When we think about like the City of Flint, that still to this day, does not have clean water! And I mean, and I know that that&#8217;s that goes a little bit beyond, but someone still has to design those systems right in that infrastructure to ensure that those children and those families in that city have access to clean water. So I&#8217;m just saying, there are a million projects that we can identify based on those hyperlocal needs for that community, that if the architecture industry just stood with us and said, “Yeah, wait a minute, no, we can spend that money and build this [community projects].” So they still make the same money, right? It’s not cutting out their profits or their revenues. But what the end result is something that builds up communities and helps to create thriving communities versus devastating them. And so that to me, is again, it&#8217;s just a matter of if they stand with us and say, “Yeah, here are all these projects that we would love to build, and we are demanding that we build, because this is what the community needs,”—they still get their money.</p>\n<p><strong>CH:</strong> I mean, it’s like you said before, architecture by itself can&#8217;t fix things—it can’t. So in working together with communities with organizations, and developing housing… that seems like the best way to move forward because you can&#8217;t just have architecture by itself.</p>\n<p><strong>ML:</strong> What helped me when I got out of prison this time, was a community. And the times that I cycled in and out, in and out, in and out of prison wasn’t any contribution to what I am today. I use that experience for others, but it was not of any help. And so what I do want to say is that, a community is what needs to be invested in. We need to invest in places for families to be together, and grow together, and I tell this to everybody: I didn&#8217;t need a hand out, I needed a hand up. Whenever somebody embraced me empowered me and helped me to build up, build myself up. I mean, the sky&#8217;s the limit, you know. And so, if we stopped thinking of people as “us” and “them”, and realizing that we do come out, we do come into your communities, we do live next door, we do work in places that we are allowed to work, you know, in the community. Investing in us and with us will help the community stay safer. And if you want to learn more about the Statewide Leadership Council, go to https://texascje.org/.</p>\n<p><strong>SJ:</strong> I think that was really beautiful, Maggie, and I really appreciate that. Because I feel like, you know, even as a community, even as our own community members, we have a lot of work to do with building each other up. We can save each other, we don&#8217;t need other people to save us. And so, I really appreciate that.</p>\n<p>But also, you know, specifically regarding HDR being the fourth largest architectural firm in the country, I feel as though we, as a community, as all of us nationwide, statewide, state-to-state have an obligation to support architects that are smaller than HDR, who take that knee to say, “You know what, we&#8217;re not going to build a new prison in jail, we&#8217;re going to build what the community looks like,” because there are architects that agree with us, and that stand with us. And we need to begin to shift those dollars into those architects so that way they can now level up and be the fourth largest architecture company in the country, right? We need to start investing in our people that stand with us. HDR has not only been over 275, prisons and jails, but they took place in building churches, schools—those are all places of healing—you can&#8217;t build a place of healing and a place to harm and be equal [be ambivalent, provide equal experiences to all]. And so if you&#8217;re allowing a harmful company to build a place of healing, you are participating in the harm that is now being done to other communities that are not equal [where the places of harm are built]. And we need to stop that. And we need to pause and figure out, okay, who is working on our project, and I think that is the most important part. And we have a beautiful model in Massachusetts, because this has been a three year war for us here in Massachusetts against HDR. In the first round, we were able to meet with one of our architects and brought women like Maggie, women like Avalon, children like—Well, I&#8217;m not a child anymore—but children that had incarcerated parents to the table and talk to them about how harmful this project was and they had no idea! They [the architects] thought that this was what we wanted. And when we talked to them about what we needed and wanted, they pulled out of the project. They reached back out to us and said, “Okay, how can we help you build what you like?” and now they&#8217;re a part of the process of building what we want. This is what we need, you know what I mean? And we have a hydroponic farm, and we get land in different states, and we need people to help us build because we&#8217;re coming up! We&#8217;re not going to stop until all of our women are free. We work to end incarceration of women and girls. We&#8217;re not going to stop until all community members have the resources that they need. We&#8217;re not going to stop until our children can play in the parks and feel comfortable. We&#8217;re not going to stop until our children have the same education that everybody else has. We are not going to stop until all people are equal, and our people are free. So you have no choice but to get on the level that we&#8217;re talking about, and meet us where we&#8217;re at so that we can meet y&#8217;all where y&#8217;all are at, so that we can be equal, and women can come home to good communities.</p>\n<p>Maggie, I really appreciate what you said, again, when you said that the community saved you, because change can only happen inside of a community. And I hate the fact that there&#8217;s a narrative saying that we can help substance use and mental health inside of prisons and jails, and then send people back to the community that they came from. That&#8217;s an automatic design for failure. We need to build treatment centers in our community, we need to build mental health centers, community centers, parks, schools—everything that other communities have, we need to build the same thing and communities that are under-resourced and over-incarcerated. And so it takes a village and we&#8217;re building that village, and we need architects to help us build the village. So join the team! And if you want to support the National Council, you can become a member at https://www.nationalcouncil.us/. Also follow <a href=\"https://www.nationalcouncil.us/reimagining-communities\">Reimagining Communities</a> infrastructure.</p>\n<p><strong>CH:</strong> Awesome. Thank you so much, all of you, for joining us today. And if you&#8217;re an architect and you want to get involved, one of the organizations that you could join is Design As Protest. Reach out, you know, don&#8217;t be afraid. We&#8217;re building this community, and it takes a village, and we keep us safe.</p>\n<p><strong> </strong><strong>LINKS & RESOURCES</strong></p>\n<ul>\n<li>The National Council for Incarcerated and Formerly Incarcerated Women and Girls: <a href=\"https://www.nationalcouncil.us/\" target=\"_blank\" rel=\"noopener\">https://www.nationalcouncil.us/</a></li>\n<li>Families for Justice as Healing: <a href=\"https://www.justiceashealing.org/\" target=\"_blank\" rel=\"noopener\">https://www.justiceashealing.org/</a></li>\n<li>Lioness: Justice Impacted Women’s Alliance: <a href=\"https://www.lionessjiwa.org/\" target=\"_blank\" rel=\"noopener\">https://www.lionessjiwa.org/</a></li>\n<li>Texas Statewide Leadership Council: <a href=\"https://texascje.org/\" target=\"_blank\" rel=\"noopener\">https://texascje.org/</a></li>\n<li>Illinois Alliance for Reentry & Justice: <a href=\"https://www.ilarj.org/\" target=\"_blank\" rel=\"noopener\">https://www.ilarj.org/</a></li>\n<li>Design As Protest: <a href=\"https://www.dapcollective.com/\" target=\"_blank\" rel=\"noopener\">https://www.dapcollective.com/</a></li>\n<li>State Budget Information: <a href=\"https://www.nasbo.org/mainsite/resources/proposed-enacted-budgets\" target=\"_blank\" rel=\"noopener\">https://www.nasbo.org/mainsite/resources/proposed-enacted-budgets</a></li>\n<li>The Sentencing Project: <a href=\"https://www.sentencingproject.org/the-facts/#map\" target=\"_blank\" rel=\"noopener\">https://www.sentencingproject.org/the-facts/#map</a></li>\n<li>Bureau of Justice Statistics: <a href=\"https://bjs.ojp.gov/data\" target=\"_blank\" rel=\"noopener\">https://bjs.ojp.gov/data</a></li>\n</ul>\n",
  "itunes:summary": "<p><em>Listen to this episode and subscribe to the FA podcast on </em><a href=\"https://podcasts.apple.com/nl/podcast/failed-architecture/id1384867713?l=en#episodeGuid=https%3A%2F%2Ffailedarchitecture.com%2F%3Fpost_type%3Dpodcast%26p%3D18764\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Apple Podcasts</em></a><em>, </em><a href=\"https://open.spotify.com/show/5EhtD8p4pBAq4kY7P8ChKu?si=DLkn-JLDQIC4cI48pOQrgg\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Spotify</em></a><em>, </em><a href=\"https://www.stitcher.com/podcast/failed-architecture\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Stitcher</em></a> or<em> </em><a href=\"https://overcast.fm/\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Overcast</em></a><em>.<br />\n</em><br />\nFor Breezeblock #30, editor christin hu chats with community organizers <span style=\"font-weight: 400;\">Maggie Luna, Avalon Betts-Gaston, and Sashi James about their recent action at HDR (Henningson, Durham, Richardson), one of the largest architecture firms in the world, who are responsible for designing hundreds of prisons. Together, they discuss the reasons why architects should refuse to take part in the building of prisons and what they can do instead.</span></p>\n<p>On June 24, <a href=\"https://www.nationalcouncil.us/\" target=\"_blank\" rel=\"noopener\">The National Council for Incarcerated and Formerly Incarcerated Women and Girls</a>,<a href=\"https://www.justiceashealing.org/\" target=\"_blank\" rel=\"noopener\"> Families for Justice as Healing</a>,<a href=\"https://www.lionessjiwa.org/\" target=\"_blank\" rel=\"noopener\"> Lioness: Justice Impacted Women’s Alliance</a>,<a href=\"https://www.dapcollective.com/\" target=\"_blank\" rel=\"noopener\"> Design as Protest</a>, <a href=\"https://texascje.org/\" target=\"_blank\" rel=\"noopener\">Texas Statewide Leadership Council</a>, and<a href=\"https://www.ilarj.org/\" target=\"_blank\" rel=\"noopener\"> Illinois Alliance for Reentry & Justice</a> organized an action outside of HDR&#8217;s office in Chicago (same day as the AIA conference) demanding that this international Architecture, Engineering, and Planning firm stop designing prisons (they have designed over 275). This marks just one of many actions inviting HDR to work with (rather than against) communities over the past years.</p>\n<p>Read the full statement of demands <a href=\"http://bit.ly/HDRNoNewPrisons\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">here</span></a> and original letter to HDR <a href=\"https://docs.google.com/document/d/16mvQC1NwgTsEIf78HaAB7KWk-LGPlxyjfSaFUXuKQpk/edit\" target=\"_blank\" rel=\"noopener\">here</a>. Below is an edited transcription of the conversation. Some links and resources are provided at the end of the article.</p>\n<p>TRANSCRIPTION</p>\n<p><strong>christin (CH):</strong> Hello and welcome to Failed Architecture Breezeblocks, where our editors share their thoughts on works in progress, urgent matters and current happenings in architecture and spatial politics. My name is christin hu and I&#8217;m an editor on Failed Architecture&#8217;s New York City team, and I&#8217;m here with Maggie Luna, Avalon Betts-Gaston and Sashi James, who have been organizing against the building of prisons.</p>\n<p><strong>Maggie (ML):</strong> Hi, I&#8217;m Maggie Luna. I am in Texas. I work with the Statewide Leadership Council. I am a community outreach coordinator and lead organizer for formerly incarcerated people and advocates in Texas.</p>\n<p><strong>Avalon (AB):</strong> Hi, thanks for having me. My name is Avalon Betts-Gaston. I am the project manager for the Illinois Alliance for Reentry and Justice. Obviously, we&#8217;re out of Illinois. We&#8217;re a coalition of directly impacted people, service providers, stakeholders and allies all united to remaking the criminal legal system. Thanks for having me.</p>\n<p><strong>Sashi (SJ):</strong> Hi, I&#8217;m Sashi James, and I&#8217;m in Families for Justice as Healing, and the National Council for Incarcerated and Formerly Incarcerated ",
  "googleplay:description": "<p><em>Listen to this episode and subscribe to the FA podcast on </em><a href=\"https://podcasts.apple.com/nl/podcast/failed-architecture/id1384867713?l=en#episodeGuid=https%3A%2F%2Ffailedarchitecture.com%2F%3Fpost_type%3Dpodcast%26p%3D18764\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Apple Podcasts</em></a><em>, </em><a href=\"https://open.spotify.com/show/5EhtD8p4pBAq4kY7P8ChKu?si=DLkn-JLDQIC4cI48pOQrgg\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Spotify</em></a><em>, </em><a href=\"https://www.stitcher.com/podcast/failed-architecture\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Stitcher</em></a> or<em> </em><a href=\"https://overcast.fm/\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Overcast</em></a><em>.<br />\n</em><br />\nFor Breezeblock #30, editor christin hu chats with community organizers <span style=\"font-weight: 400;\">Maggie Luna, Avalon Betts-Gaston, and Sashi James about their recent action at HDR (Henningson, Durham, Richardson), one of the largest architecture firms in the world, who are responsible for designing hundreds of prisons. Together, they discuss the reasons why architects should refuse to take part in the building of prisons and what they can do instead.</span></p>\n<p>On June 24, <a href=\"https://www.nationalcouncil.us/\" target=\"_blank\" rel=\"noopener\">The National Council for Incarcerated and Formerly Incarcerated Women and Girls</a>,<a href=\"https://www.justiceashealing.org/\" target=\"_blank\" rel=\"noopener\"> Families for Justice as Healing</a>,<a href=\"https://www.lionessjiwa.org/\" target=\"_blank\" rel=\"noopener\"> Lioness: Justice Impacted Women’s Alliance</a>,<a href=\"https://www.dapcollective.com/\" target=\"_blank\" rel=\"noopener\"> Design as Protest</a>, <a href=\"https://texascje.org/\" target=\"_blank\" rel=\"noopener\">Texas Statewide Leadership Council</a>, and<a href=\"https://www.ilarj.org/\" target=\"_blank\" rel=\"noopener\"> Illinois Alliance for Reentry & Justice</a> organized an action outside of HDR&#8217;s office in Chicago (same day as the AIA conference) demanding that this international Architecture, Engineering, and Planning firm stop designing prisons (they have designed over 275). This marks just one of many actions inviting HDR to work with (rather than against) communities over the past years.</p>\n<p>Read the full statement of demands <a href=\"http://bit.ly/HDRNoNewPrisons\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">here</span></a> and original letter to HDR <a href=\"https://docs.google.com/document/d/16mvQC1NwgTsEIf78HaAB7KWk-LGPlxyjfSaFUXuKQpk/edit\" target=\"_blank\" rel=\"noopener\">here</a>. Below is an edited transcription of the conversation. Some links and resources are provided at the end of the article.</p>\n<p>TRANSCRIPTION</p>\n<p><strong>christin (CH):</strong> Hello and welcome to Failed Architecture Breezeblocks, where our editors share their thoughts on works in progress, urgent matters and current happenings in architecture and spatial politics. My name is christin hu and I&#8217;m an editor on Failed Architecture&#8217;s New York City team, and I&#8217;m here with Maggie Luna, Avalon Betts-Gaston and Sashi James, who have been organizing against the building of prisons.</p>\n<p><strong>Maggie (ML):</strong> Hi, I&#8217;m Maggie Luna. I am in Texas. I work with the Statewide Leadership Council. I am a community outreach coordinator and lead organizer for formerly incarcerated people and advocates in Texas.</p>\n<p><strong>Avalon (AB):</strong> Hi, thanks for having me. My name is Avalon Betts-Gaston. I am the project manager for the Illinois Alliance for Reentry and Justice. Obviously, we&#8217;re out of Illinois. We&#8217;re a coalition of directly impacted people, service providers, stakeholders and allies all united to remaking the criminal legal system. Thanks for having me.</p>\n<p><strong>Sashi (SJ):</strong> Hi, I&#8217;m Sashi James, and I&#8217;m in Families for Justice as Healing, and the National Council for Incarcerated and Formerly Incarcerated ",
  "itunes:image": "",
  "googleplay:image": "",
  "enclosure": "",
  "itunes:explicit": "clean",
  "googleplay:explicit": "No",
  "itunes:block": "no",
  "googleplay:block": "no",
  "itunes:duration": "00:26:49",
  "itunes:author": "Christin Hu"
}