{
  "title": "The Economy Is a Mess: What Lessons Will We Learn?",
  "link": "https://mises.org/node/60645",
  "description": "<p>It is relatively common that what should be recognized as a warning flag of major trouble is often ignored until things get so bad that it is almost impossible not to notice (unless one is mightily determined not to see them). Leonard Read channeled such thoughts about the damage public policy has caused Americans. He even went so far as to say “Thank God for the Mess We’re In,” (<em>The Freeman</em>, March 1975), because our mess is so great we might finally start thinking about how to undo the causes:</p>\n<blockquote><p>There is a reason for our mess. We are now reaping the bitter harvest of the poisonous seed sowed intermittently during the past … bad effects whose causation can be traced to the employment of wrong means. We suffer the natural consequences of our folly.</p>\n<p>As it is, we need only take our heads out of the sand to see clearly that interventionism not only has failed to provide the promised something for nothing but has led to all sorts of undesirable consequences.</p>\n<p>[Many] fail to get the message the mess is meant to convey. Indeed, many are just beginning to realize that we are moving toward disaster, even though we have been on a wrong heading for decades.</p>\n<p>Why then do I thank God for the mess we’re in? Simply because the mess is sending up signals—messages loud and clear—that our past is filled with errors which inexorably produced their evil results. The consequences we suffer now were caused by past mistakes, and we need to know what wrong actions are responsible for these bad effects. The fact is, we are being graced with warnings which, when and if read aright, can lead to our salvation.</p></blockquote>\n<p>Read then turns to the issue of how to “see” both the blessings of liberty and how government violations of liberty have gotten us into the mess we’re in:</p>\n<blockquote><p>Our past is filled not only with moral but politico-economic errors, and our present likewise. How are we to identify these wrong actions and find the right ones, that is, how expose the fallacies of state interventionism and reveal the merits of human liberty as related to the interest and benefit of every one of us?</p>\n<p>When liberty prevails, every individual … is free to bring persons and other scarce resources into complementary and workable combinations … millions who can and do bring individuals and other resources into association that render a fantastic service of all sorts to King Consumer. And, when liberty prevails so does competition, a constructive force that assures that the efficient servants rise to serve all of us better.</p>\n<p>The aggregate of these energies—the bringing into combination of things and persons—is beyond the power of anyone to even imagine.</p></blockquote>\n<p>The problem: government interventions supposedly to advance the general welfare commonly do the opposite, by undermining the liberty that is truly essential to our well-being:</p>\n<blockquote><p>Let us now observe what happens to these sources of creative energy when the state regulates and controls them. What are the consequences when organized physical force—government—controls our creativity, our varied and unique potentialities? To accurately observe and appraise these consequences is to discover the errors—moral and economic—which account for the mess we are in. And the task is to free ourselves from these malpractices.</p>\n<p>We have [many] governments—federal, state, and local … commanding millions of us as to what to produce, what and with whom to exchange, what our money is worth; they dictate hours of labor, wages, what our children must study; on and on and on … they have frustrated, to a marked extent, the morals and the creativity of the citizenry.</p>\n<p>As a result of this governmental intervention, the varied talents and the uniqueness of each citizen are more or less imprisoned.</p>\n<p>To repeat, when liberty prevails, all are free to bring things and people into workable combinations to the betterment of all … But when the police and their subsidized minions regulate and control, a do-as-­I-say-or-else action replaces, to a great extent, the bringing together actions of free and creative people, and to the detriment of all.</p></blockquote>\n<p>Read concludes with a call to finally heed the red flags that have been flying for so long, along with a reference to inflation that seems quite prescient for our situation today:</p>\n<blockquote><p>The signals are loud and clear—far too numerous to recount. The messages are that every one of these evils we now experience are but consequences of past and present errors … we must work on the causes … if we would repair our ways!</p>\n<p>Let me conclude by calling attention to but one signal, a warning that is fretting millions … the rapid decline in the purchasing power of the dollar. The cause? Inflation! Its causes? Excessive governmental expenditures which in turn are caused by people from all walks of life running to government for every conceivable kind of succor—people feathering their own nests at the expense of others. The remedy? Remove the causes.</p>\n<p>In any event, I thank God for the mess we’re in and its timely warning that we must change our course to avert disaster.</p></blockquote>\n<p>I have heard many people in recent years echo Leonard Read’s recognition that we are in a real mess. Such recognition is an important and necessary first step. But it is far from sufficient to undo the mess. What Read was thankful for was the heightened potential it offered for careful thinking, to be followed by action to undo the causes. It is that last step that offers a payoff for society. But our near-at-hand midterm election campaigns don’t seem to deliver on Read’s hope, but instead promise a doubling down on every policy ever conceived to violate citizens’ persons and property to give power to government and favors to those whose votes are thought to be most effectively buyable.</p>\n<p>And it is profoundly depressing to see us creating still bigger red flags, while continuing to avert our eyes from virtually anything they have to teach us. It seems that rather than having a problem with a boy who cried wolf, we have a problem of many crying that there is no wolf, even when we see him at the door.</p>\n\n",
  "author": "Gary Galles",
  "enclosure": "",
  "guid": 60645,
  "pubDate": "Mon, 31 Oct 2022 12:00:00 -0500",
  "source": "Mises Wire"
}