{
  "title": "“Pandemic Is Over!” Declares President Biden",
  "itunes:title": "“Pandemic Is Over!” Declares President Biden",
  "pubDate": "Fri, 23 Sep 2022 16:15:41 +0000",
  "guid": "c9d658b9-c091-4d2c-ba4d-4cdcf4787594",
  "link": "https://thejimmydoreshow.libsyn.com/pandemic-is-over-declares-president-biden",
  "itunes:image": "",
  "description": "<p>At the Detroit Auto Show for an appearance on 60 Minutes, President Joe Biden declared that the pandemic is over. Not surprisingly, handlers immediately started walking back the President’s comments, but the impromptu announcement nevertheless caused a great deal of controversy and heated reactions, both from COVID skeptics and COVID alarmists.</p> <p>Jimmy and his panel of The Dive’s Jackson Hinkle and Convo Couch’s Craig “Pasta” Jardula discuss whether the pandemic really is “over” and what that even means.<br /> <br /> Plus segments on the arrival of 50 Venezuelan migrants to Martha's Vineyard and the media freakout over Ben Shapiro allegedly grooming a new generation of incels online.<br /> <br /> Also featuring Stef Zamorano and Mike MacRae! And phone calls from  Jeff Bridges and Joe Biden!</p>",
  "content:encoded": "<p>At the Detroit Auto Show for an appearance on 60 Minutes, President Joe Biden declared that the pandemic is over. Not surprisingly, handlers immediately started walking back the President’s comments, but the impromptu announcement nevertheless caused a great deal of controversy and heated reactions, both from COVID skeptics and COVID alarmists.</p> <p>Jimmy and his panel of The Dive’s Jackson Hinkle and Convo Couch’s Craig “Pasta” Jardula discuss whether the pandemic really is “over” and what that even means.  Plus segments on the arrival of 50 Venezuelan migrants to Martha's Vineyard and the media freakout over Ben Shapiro allegedly grooming a new generation of incels online.  Also featuring Stef Zamorano and Mike MacRae! And phone calls from  Jeff Bridges and Joe Biden!</p>",
  "enclosure": "",
  "itunes:duration": "01:10:45",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "At the Detroit Auto Show for an appearance on 60 Minutes, President Joe Biden declared that the pandemic is over. Not surprisingly, handlers immediately started walking back the President’s comments, but the impromptu announcement nevertheless...",
  "itunes:episodeType": "full",
  "itunes:summary": "At the Detroit Auto Show for an appearance on 60 Minutes, President Joe Biden declared that the pandemic is over. Not surprisingly, handlers immediately started walking back the President’s comments, but the impromptu announcement nevertheless caused a great deal of controversy and heated reactions, both from COVID skeptics and COVID alarmists. Jimmy and his panel of The Dive’s Jackson Hinkle and Convo Couch’s Craig “Pasta” Jardula discuss whether the pandemic really is “over” and what that even means. Plus segments on the arrival of 50 Venezuelan migrants to Martha's Vineyard and the media freakout over Ben Shapiro allegedly grooming a new generation of incels online. Also featuring Stef Zamorano and Mike MacRae! And phone calls from  Jeff Bridges and Joe Biden!"
}