{
  "title": "Episode 133: &#8220;My Girl&#8221; by the Temptations",
  "link": "https://500songs.com/podcast/episode-133-my-girl-by-the-temptations/",
  "pubDate": "Fri, 24 Sep 2021 00:17:43 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=884",
  "description": "Episode one hundred and thirty-three of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"My Girl\" by the Temptations, and is part three of a three-episode look at Motown in 1965. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/56531824\">on \"Yeh Yeh\" by Georgie Fame and the Blue Flames.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I've put together <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-133-my-girl-by-the-temptations/\">a Mixcloud playlist</a> of all the recordings excerpted in this episode.\n\n<a href=\"https://amzn.to/3CDtE4Q\">This box set</a> is the definitive collection of the Temptations' work, but is a bit pricey. For those on a budget, <a href=\"https://amzn.to/3i3Enh1\">this two-CD set</a> contains all the hits.\n\nAs well as the general Motown information listed below, I've also referred to <a href=\"https://amzn.to/2XIYuKa\"><em>Ain't Too Proud to Beg: The Troubled Lives and Enduring Soul of the Temptations</em> by Mark Ribowsky,</a> and to <a href=\"https://amzn.to/3nYCru9\">Smokey Robinson's autobiography</a>.\n\nFor Motown-related information in this and other Motown episodes, I’ve used the following resources:\n\n<a href=\"https://amzn.to/2QTOvdM\"><em>Where Did Our Love Go? The Rise and Fall of the Motown Sound</em> by Nelson George</a> is an excellent popular history of the various companies that became Motown.\n\n<a href=\"https://amzn.to/2QQhXRZ\"><em>To Be Loved</em> by Berry Gordy</a> is Gordy’s own, understandably one-sided, but relatively well-written, autobiography.\n\n<a href=\"https://amzn.to/2VIpXII\"><em>Women of Motown: An Oral History</em> by Susan Whitall</a> is a collection of interviews with women involved in Motown.\n\n<a href=\"https://amzn.to/2xVdvfD\"><em>I Hear a Symphony: Motown and Crossover R&B </em>by J. Andrew Flory</a> is an academic look at Motown.\n\n<a href=\"https://amzn.to/2VLquJX\"><em>The Motown Encyclopaedia</em> by Graham Betts</a> is an exhaustive look at the people and records involved in Motown’s thirty-year history.\n\n<a href=\"https://amzn.to/3bZd5q6\"><em>How Sweet It Is</em> by Lamont Dozier and Scott B. Bomar </a>is Dozier’s autobiography, while <a href=\"https://amzn.to/3903ey8\"><em>Come and Get These Memories </em>by Brian and Eddie Holland and Dave Thompson</a> is the Holland brothers’.\n\nAnd <a href=\"https://motownjunkies.co.uk/\">Motown Junkies</a> is an infrequently-updated blog looking at (so far) the first 694 tracks released on Motown singles.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nFor the last few weeks we've been looking at Motown in 1965, but now we're moving away from Holland, Dozier, and Holland, we're also going to move back in time a little, and look at a record that was released in December 1964.\n\nI normally try to keep this series in more or less chronological order, but to tell this story I had to first show the new status quo of the American music industry after the British Invasion, and some of what had to be covered there was covered in songs from early 1965.\n\nAnd the reason I wanted to show that status quo before doing this series of Motown records is that we're now entering into a new era of musical segregation, and really into the second phase of this story.\n\nIn 1963, Billboard had actually stopped having an R&B chart -- Cashbox magazine still had one, but Billboard had got rid of theirs. The reasoning was simple -- by that point there was so much overlap between the R&B charts and the pop charts that it didn't seem necessary to have both. The stuff that was charting on the R&B charts was also charting pop -- people like Ray Charles or Chubby Checker or the Ronettes or Sam Cooke. The term \"rock and roll\" had originally been essentially a marketing campaign to get white people to listen to music made by Black people, and it had worked.\n\nThere didn't seem to be a need for a separate category for music listened to by Black people, because that was now the music listened to by *everybody*.\n\nOr it had been, until the Beatles turned up.\n\nAt that point, the American charts were flooded by groups with guitars, mostly British, mostly male, and mostly white.\n\nThe story of rock and roll from 1954 through 1964 had been one of integration, of music made by Black people becoming the new mainstream of music in the USA. The story for the next decade or more would be one of segregation, of white people retaking the pop charts, and rebranding \"rock and roll\" so thoroughly that by the early 1970s nobody would think of the Supremes or the Shirelles or Sam Cooke as having been rock and roll performers at all. And so today we're going to look at the record that was number one the week that Billboard reinstated its R&B chart, and which remains one of the most beloved classics of the time period. We're going to look at the careers of two different groups at Motown, both of whom managed to continue having hits, and even become bigger, after the British Invasion, and at the songwriter and producer who was responsible for those hits -- and who was also an inspiration for the Beatles, who inadvertently caused that invasion. We're going to look at Smokey Robinson, and at \"My Girl\" by the Temptations:\n\n[Excerpt: The Temptations, \"My Girl\"]\n\nThe story of the Temptations both starts and ends with Otis Williams. As I write this, Williams is the only living member of the classic Temptations lineup, and is the leader of the current group. And Williams also started the group that, after many lineup changes and mergers, became the Temptations, and was always the group's leader, even though he has never been its principal lead singer.\n\nThe group that eventually became the Temptations started out when Williams formed a group with a friend, Al Bryant, in the late 1950s. They were inspired by a doo-wop group called the Turbans, who had had a hit in 1956 with a song called \"When You Dance\":\n\n[Excerpt: The Turbans, \"When You Dance\"]\n\nThe Turbans, appropriately enough, used to wear turbans on their heads when they performed, and Williams and Bryant's new group wanted to use the same gimmick, so they decided to come up with a Middle-Eastern sounding group name that would justify them wearing Arabic style costumes. Unfortunately, they didn't have the greatest grasp of geography in the world, and so this turban-wearing group named themselves the Siberians.\n\nThe Siberians recorded one single under that name -- a single that has been variously reported as being called \"The Pecos Kid\" and \"Have Gun Will Travel\", but which sold so poorly that now no copies are known to exist anywhere -- before being taken on by a manager called Milton Jenkins, who was as much a pimp as he was a manager, but who definitely had an eye for talent. Jenkins was the manager of two other groups -- the Primes, a trio from Alabama who he'd met in Cleveland when they'd travelled there to see if they could get discovered, and who had moved with him to Detroit, and a group he put together, called the Primettes, who later became the Supremes.\n\nThe Primes consisted of three singers -- Eddie Kendricks, Paul Williams (no relation to Otis, or to the soft-pop singer and actor of the same name), and Kell Osborne, who sang lead. The Primes became known around Detroit as some of the best performers in the city -- no mean feat considering that Jackie Wilson, Aretha Franklin, the Miracles and the Four Tops, just for a start, were performing regularly on the same circuit.\n\nJenkins had big plans for his groups, and he sent them all to dance school to learn to perform choreographed routines. But then Jenkins became ill and disappeared from the scene, and the Primes split up. Kendricks and Paul Williams went back to Alabama, while Osborne moved on to California, where he made several unsuccessful records, including \"The Bells of St. Mary\", produced by Lester Sill and Lee Hazelwood and arranged by Phil Spector:\n\n[Excerpt: Kell Osborne, \"The Bells of St. Mary\"]\n\nBut while the Primes had split up, the Siberians hadn't. Instead, they decided to get new management, which came in the person of a woman named Johnnie Mae Matthews. Matthews was the lead singer of a group called the Five Dapps, who'd had a local hit with a track called \"Do Whap A Do\", one of the few Dapps songs she didn't sing lead on:\n\n[Excerpt: The Five Dapps, \"Do Whap A Do\"]\n\nAfter that had become successful, Matthews had started up her own label, Northern -- which was apparently named after a brand of toilet paper -- to put out records of her group, often backed by the same musicians who would later become the core of the Funk Brothers. Her group, renamed Johnnie Mae Matthews and the Dapps, put out two more singles on her label, with her singing lead:\n\n[Excerpt: Johnnie Mae Matthews and the Dapps, \"Mr. Fine\"]\n\nMatthews had become something of an entrepreneur, managing other local acts like Mary Wells and Popcorn Wylie, and she wanted to record the Siberians, but two of the group had dropped out after Jenkins had disappeared, and so they needed some new members. In particular they needed a bass singer -- and Otis Williams knew of a good one.\n\nMelvin Franklin had been singing with various groups around Detroit, but Williams was thinking in particular of Franklin's bass vocal on \"Needed\" by the Voice Masters.\n\nWe've mentioned the Voice Masters before, but they were a group with a rotating membership that included David Ruffin and Lamont Dozier. Franklin hadn't been a member of the group, but he had been roped in to sing bass on \"Needed\", which was written and produced by Gwen Gordy and Roquel Davis, and was a clear attempt at sounding like Jackie Wilson:\n\n[Excerpt: The Voice Masters, \"Needed\"]\n\nWilliams asked Franklin to join the group, and Franklin agreed, but felt bad about leaving his current group. However, the Siberians also needed a new lead singer, and so Franklin brought in Richard Street from his group.\n\nMatthews renamed the group the Distants and took them into the studio. They actually got there early, and got to see another group, the Falcons, record what would become a million-selling hit:\n\n[Excerpt: The Falcons, \"You're So Fine\"]\n\nThe Falcons, whose lead vocalist Joe Stubbs was Levi Stubbs' brother, were an important group in their own right, and we'll be picking up on them next week, when we look at a single by Joe Stubbs' replacement in the group.\n\nThe Distants' single wouldn't be quite as successful as the Falcons', but it featured several people who would go on to become important in Motown. As well as several of the Funk Brothers in the backing band, the record also featured additional vocals by the Andantes, and on tambourine a local pool-hall hustler the group knew named Norman Whitfield.\n\nThe song itself was written by Williams, and was essentially a rewrite of \"Shout!\" by the Isley Brothers:\n\n[Excerpt: The Distants, \"Come On\"]\n\nThe Distants recorded a second single for Northern, but then Williams made the mistake of asking Matthews if they might possibly receive any royalties for their records. Matthews said that the records had been made with her money, that she owned the Distants' name, and she was just going to get five new singers.\n\nMatthews did actually get several new singers to put out a single under the Distants name, with Richard Street still singing lead -- Street left the group when they split from Matthews, as did another member, leaving the group as a core of Otis Williams, Melvin Franklin, and Al Bryant.\n\nBut before the split with Matthews, Berry Gordy had seen the group and suggested they come in to Motown for an audition. Otis, Melvin, and Al, now renamed the Elgins, wanted to do just that. But they needed a new lead singer.\n\nAnd happily, they had one. Eddie Kendricks phoned up Otis Williams and said that he and Paul Williams were back in town, and did Otis know of any gigs that were going? Otis did indeed know of such a gig, and Paul and Eddie joined the Elgins, Paul as lead singer and Eddie as falsetto singer.\n\nThis new lineup of the group were auditioned by Mickey Stevenson, Motown's head of A&R, and he liked them enough that he signed them up. But he insisted that the name had to change -- there was another group already called the Elgins (though that group never had a hit, and Motown would soon sign up yet another group and change their name to the Elgins, leading to much confusion). The group decided on a new name -- The Temptations.\n\nTheir first record was co-produced by Stevenson and Andre Williams. Williams, who was no relation to either Otis or Paul (and as a sidenote I do wish there weren't so many people with the surname Williams in this story, as it means I can't write it in my usual manner of referring to people by their surname) was a minor R&B star who co-wrote \"Shake a Tail Feather\", and who had had a solo hit with his record \"Bacon Fat\":\n\n[Excerpt: Andre Williams, \"Bacon Fat\"]\n\nAndre Williams, who at this point in time was signed to Motown though not having much success, was brought in because the perception at Motown was that the Temptations would be one of their harder-edged R&B groups, rather than going for the softer pop market, and he would be able to steer the recording in that direction. The song they chose to record was one that Otis Williams had written, though Mickey Stevenson gets a co-writing credit and may have helped polish it:\n\n[Excerpt: The Temptations, \"Oh Mother of Mine\"]\n\nThe new group lineup became very close, and started thinking of each other like family and giving each other nicknames -- though they also definitely split into two camps. Otis Williams and Melvin Franklin were always a pair, and Eddie Kendricks and Paul Williams had come up together and thought of themselves as a team. Al Bryant, even though he had been with Otis from the beginning, was a bit of an outlier in this respect. He wasn't really part of either camp, and he was the only one who didn't get a nickname from the other band members. He was also the only one who kept his day job -- while the other four were all determined that they were going to make it as professional singers, he was hesitant and kept working at the dairy.\n\nAs a result, whenever there were fights in the group -- and the fights would sometimes turn physical -- the fighting would tend to be between Eddie Kendricks and Melvin Franklin. Otis was the undisputed leader, and nobody wanted to challenge him, but from the beginning Kendricks and Paul Williams thought of Otis as a bit too much of a company man. They also thought of Melvin as Otis' sidekick and rubber stamp, so rather than challenge Otis they'd have a go at Melvin.\n\nBut, for the most part, they were extremely close at this point.\n\nThe Temptations' first single didn't have any great success, but Berry Gordy had faith in the group, and produced their next single himself, a song that he cowrote with Otis, Melvin, and Al, and which Brian Holland also chipped in some ideas for. That was also unsuccessful, but the next single, written by Gordy alone, was slightly more successful. For \"(You're My) Dream Come True\", Gordy decided to give the lead to Kendricks, the falsetto singer, and the track also featured a prominent instrumental line by Gordy's wife Raynoma -- what sounds like strings on the record is actually a primitive synthesiser called an ondioline:\n\n[Excerpt: The Temptations, \"(You're My) Dream Come True\"]\n\nThat made number twenty-two on the R&B chart, and was the first sign of any commercial potential for the group -- and so Motown went in a totally different direction and put out a cover version, of a record by a group called the Diablos, whose lead singer was Barrett Strong's cousin Nolan. The Temptations' version of \"Mind Over Matter\" wasn't released as by the Temptations, but as by the Pirates:\n\n[Excerpt: The Pirates, \"Mind Over Matter\"]\n\nThat was a flop, and at the same time as they released it, they also released another Gordy song under their own name, a song called \"Paradise\" which seems to have been an attempt at making a Four Seasons soundalike, which made number 122 on the pop charts and didn't even do that well on the R&B charts.\n\nAnnoyingly, the Temptations had missed out on a much bigger hit. Gordy had written \"Do You Love Me?\" for the group, but had been hit with a burst of inspiration and wanted to do the record *NOW*. He'd tried phoning the various group members, but got no answer -- they were all in the audience at a gospel music show at the time, and had no idea he was trying to get in touch with them. So he'd pulled in another group, The Contours, and their version of the song went to number three on the pop charts:\n\n[Excerpt: The Contours, \"Do You Love Me?\"]\n\nAccording to the biography of the Temptations I'm using as a major source for this episode, that was even released on the same day as both \"Paradise\" and \"Mind Over Matter\", though  other sources I've consulted have it coming out a few months earlier.\n\nDespite \"Paradise\"'s lack of commercial success, though, it did introduce an element that would become crucial for the group's future -- the B-side was the first song for the group written by Smokey Robinson.\n\nWe've mentioned Robinson briefly in previous episodes on Motown, but he's worth looking at in a lot more detail, because he is in some ways the most important figure in Motown's history, though also someone who has revealed much less of himself than many other Motown artists.\n\nBoth of these facts stem from the same thing, which is that Robinson is the ultimate Motown company man. He was a vice president of the company, and he was Berry Gordy's best friend from before the company even started. While almost every other artist, writer, or producer signed to Motown has stories to tell of perceived injustices in the way that Motown treated them, Robinson has always positioned himself on the side of the company executives rather than as one of the other artists.\n\nHe was the only person outside the Gordy family who had a place at the very centre of the organisation -- and he was also one of a very small number of people during Motown's golden age who would write, produce, *and* perform.\n\nNow, there were other people who worked both as artists and on the backroom side of things -- we've seen that Marvin Gaye and Stevie Wonder would sometimes write songs for other artists, and that Eddie Holland and Lamont Dozier had started out as performers before moving into songwriting. But these were mostly little dalliances -- in general, in Motown in the sixties, you were either a performer or you were a writer-producer.\n\nBut Smokey Robinson was both -- and he was *good* at both, someone who was responsible for creating many of the signature hits of Motown.\n\nAt this point in his career, Robinson had, as we've heard previously, been responsible for Motown's second big hit, after \"Money\", when he'd written \"Shop Around\" for his own group The Miracles:\n\n[Excerpt: The Miracles, \"Shop Around\"]\n\nThe Miracles had continued to have hits, though none as big as \"Shop Around\", with records like \"What's So Good About Goodbye?\":\n\n[Excerpt: The Miracles, \"What's So Good About Goodbye?\"]\n\nBut Robinson had also been writing regularly for other artists. He'd written some stuff that the Supremes had recorded, though like all the Supremes material at this point it had been unsuccessful, and he'd also started a collaboration with the label's biggest star at this point, Mary Wells, for whom he'd written top ten hits like \"The One Who Really Loves You\":\n\n[Excerpt: Mary Wells, \"The One Who Really Loves You\"]\n\nand \"You Beat Me To The Punch\", co-written with fellow Miracle Ronnie White, which as well as going top ten pop made number one on the R&B charts:\n\n[Excerpt: Mary Wells, \"You Beat Me to The Punch\"]\n\nBetween 1962 and 1964, Robinson would consistently write huge hits for Wells, as well as continuing to have hits with the Miracles, and his writing was growing in leaps and bounds. He was regarded by almost everyone at Motown as the best writer the company had, both for his unique melodic sensibility and for the literacy of his lyrics. When he'd first met Berry Gordy, he'd been a writer with a lot of potential, but he hadn't understood how to structure a lyric -- he'd thrown in a lot of unrelated ideas. Gordy had taken him under his wing and shown him how to create a song with a beginning, a middle, and an end, and Robinson had immediately understood what he needed to do. His lyrics, with their clever conceits and internal rhymes, became the ones that everyone else studied -- when Eddie Holland decided to become a songwriter rather than a singer, he'd spent months just studying Robinson's lyrics to see how they worked.\n\nRobinson was even admired by the Beatles, especially John Lennon -- one can hear his melismatic phrases all over Lennon's songwriting in this period, most notably in songs like \"Ask Me Why\", and the Beatles covered one of Robinson's songs on their second album, With the Beatles:\n\n[Excerpt: The Beatles, \"You Really Got a Hold On Me\"]\n\nAfter writing the B-side to \"Paradise\", Robinson was given control of the Temptations' next single. His \"I Want a Love I Can See\" didn't do any better than \"Paradise\", and is in some ways more interesting for the B-side, \"The Further You Look, The Less You See\":\n\n[Excerpt: The Temptations, \"The Further You Look, The Less You See\"]\n\nThat track's interesting because it's a collaboration between Robinson and Norman Whitfield, that pool-hall hustler who'd played tambourine on the Distants' first single. Whitfield had produced the records by the later Distants, led by Richard Street, and had then gone to work for a small label owned by Berry Gordy's ex-mother-in-law. Gordy had bought out that label, and with it Whitfield's contract, and at this point Whitfield was very much an apprentice to Robinson.\n\nBoth men were huge admirers of the Temptations, and for the next few years both would want to be the group's main producer and songwriter, competing for the right to record their next single -- though for a good chunk of time this would not really be a competition, as Whitfield was minor league compared to Robinson.\n\n\"I Want a Love I Can See\" was a flop, and the Temptations' next single was another Berry Gordy song. When that flopped too, Gordy seriously started considering dropping the group altogether.\n\nWhile this was happening, though, Robinson was busily writing more great songs for his own group and for Mary Wells, songs like \"What Love Has Joined Together\", co-written with his bandmate Bobby Rogers:\n\n[Excerpt: Mary Wells, \"What Love Has Joined Together\"]\n\nAnd the Temptations were going through their own changes. Al was becoming more and more of an outsider in the group, while also thinking of himself as the real star. He thought this even though he was the weak link -- Paul and Eddie were the lead singers, Otis was the band's leader, Melvin had a hugely distinctive bass voice, and Al was... just \"the other one\".\n\nThings came to a head at a gig in October 1963, when a friend of the group showed up. David Ruffin was so friendly with Melvin Franklin that Franklin called him his cousin, and he was also a neighbour of Otis'. He had been a performer from an early age -- he'd been in a gospel group with his older brother Jimmy and their abusive father. Once he'd escaped his father, he'd gone on to perform in a duo with his brother, and then in a series of gospel groups, including stints in the Dixie Nightingales and the Soul Stirrers.\n\nRuffin had been taken on by a manager called Eddie Bush, who adopted him -- whether legally or just in their minds is an open question -- and had released his first single as Little David Bush when he was seventeen, in 1958:\n\n[Excerpt: Little David Bush, \"You and I\"]\n\nRuffin and Bush had eventually parted ways, and Ruffin had taken up with the Gordy family, helping Berry Gordy Sr out in his construction business -- he'd actually helped build the studio that Berry Jr owned and where most of the Motown hits were recorded -- and singing on records produced by Gwen Gordy. He'd been in the Voice Masters, who we heard earlier this episode, and had also recorded solo singles with the Voice Masters backing, like \"I'm In Love\":\n\n[Excerpt: David Ruffin, \"I'm In Love\"]\n\nWhen Gwen Gordy's labels had been absorbed into Motown, so had Ruffin, who had also got his brother Jimmy signed to the label. They'd planned to record as the Ruffin Brothers, but then Jimmy had been drafted, and Ruffin was at a loose end -- he technically had a Motown contract, but wasn't recording anything.\n\nBut then in October 1963 he turned up to a Temptations gig. For the encore, the group always did the Isley Brothers song \"Shout!\", and Ruffin got up on stage with them and started joining in, dancing more frantically than the rest of the group. Al started trying to match him, feeling threatened by this interloper. They got wilder and wilder, and the audience loved it so much that the group were called back for another encore, and Ruffin joined them again. They did the same song again, and got an even better reaction. They came back for a third time, and did it again, and got an even better reaction. Ruffin then disappeared into the crowd.\n\nThe group decided that enough was enough -- except for Al, who was convinced that they should do a fourth encore without Ruffin. The rest of the group were tired, and didn't want to do the same song for a fourth time, and thought they should leave the audience wanting more. Al, who had been drinking, got aggressive, and smashed a bottle in Paul Williams' face, hospitalising him. Indeed, it was only pure luck that kept Williams from losing his vision, and he was left with a scar but no worse damage.\n\nOtis, Eddie, and Melvin decided that they needed to sack Al, but Paul, who was the peacemaker in the group, insisted that they shouldn't, and also refused to press charges. Out of respect for Paul, the rest of the group agreed to give Al one more chance. But Otis in particular was getting sick of Al and thought that the group should just try to get David Ruffin in. Everyone agreed that if Al did anything to give Otis the slightest reason, he could be sacked.\n\nTwo months later, he did just that. The group were on stage at the annual Motown Christmas show, which was viewed by all the acts as a competition, and Paul had worked out a particularly effective dance routine for the group, to try to get the crowd going. But while they were performing, Al came over to Otis and suggested that the two of them, as the \"pretty boys\" should let the other three do all the hard work while they just stood back and looked good for the women. Otis ignored him and carried on with the routine they'd rehearsed, and Al was out as soon as they came offstage. And David Ruffin was in.\n\nBut for now, Ruffin was just the missing element in the harmony stack, not a lead vocalist in his own right. For the next single, both Smokey Robinson and Berry Gordy came up with songs for the new lineup of the group, and they argued about which song should be the A-side -- one of the rare occasions where the two disagreed on anything. They took the two tracks to Motown's quality control meeting, and after a vote it was agreed that the single should be the song that Robinson had written for Eddie Kendricks to sing, \"The Way You Do the Things You Do\":\n\n[Excerpt: The Temptations, \"The Way You Do the Things You Do\"]\n\nAt first, the group hadn't liked that song, and it wasn't until they rehearsed it a few times that they realised that Robinson was being cleverer than they'd credited him for with the lyrics. Otis Williams would later talk about how lines like \"You've got a smile so bright, you know you could have been a candle\" had seemed ridiculous to them at first, but then they'd realised that the lyric was parodying the kinds of things that men say when they don't know what to say to a woman, and that it's only towards the end of the song that the singer stops trying bad lines and just starts speaking honestly -- \"you really swept me off my feet, you make my life complete, you make my life so bright, you make me feel all right\":\n\n[Excerpt: The Temptations, \"The Way You Do the Things You Do\"]\n\nThat track was also the first one that the group cut to a prerecorded backing track, Motown having upgraded to a four-track system. That allowed the group to be more subtle with their backing vocal arrangements, and \"The Way You Do the Things You Do\" is the point at which the Temptations become fully themselves.\n\nBut the group didn't realise that at first. They spent the few weeks after the record's release away from Detroit, playing at the Michigan state fair, and weren't aware that it was starting to do things. It was only when Otis and David popped in to the Motown offices and people started talking to them about them having a hit that they realised the record had made the pop charts. Both men had been trying for years to get a big hit, with no success, and they started crying in each other's arms, Ruffin saying ‘Otis, this is the first time in my life I feel like I’ve been accepted, that I’ve done something.’”\n\nThe record eventually made number eleven on the pop charts, and number one on the Cashbox R&B chart -- Billboard, as we discussed earlier, having discontinued theirs, but Otis Williams still thinks that given the amount of airplay that the record was getting it should have charted higher, and that something fishy was going on with the chart compilation at that point. Perhaps, but given that the record reached the peak of its chart success in April 1964, the high point of Beatlemania, when the Beatles had five records in the top ten, it's also just possible that it was a victim of bad timing.\n\nBut either way, number eleven on the pop charts was a significant hit.\n\nShortly after that, though, Smokey Robinson came up with an even bigger hit. \"My Guy\", written for Mary Wells, had actually only been intended as a bit of album filler. Motown were putting together a Mary Wells album, and as with most albums at the time it was just a collection of tracks that had already been released as singles and stuff that hadn't been considered good enough to release. But they were a track short, and Smokey was asked to knock together something quickly. He recorded a backing track at the end of a day cutting tracks for a *Temptations* album -- The Temptations Sing Smokey -- and everyone was tired by the time they got round to recording it, but you'd never guess that from the track itself, which is as lively as anything Motown put out.\n\n\"My Guy\" was a collaborative creation, with an arrangement that was worked on by the band -- it was apparently the Funk Brothers who came up with the intro, which was lifted from a 1956 record, \"Canadian Sunset\" by Hugo Winterhalter. Compare that:\n\n[Excerpt: Hugo Winterhalter, \"Canadian Sunset\"]\n\nto “My Guy”:\n\n[Excerpt: Mary Wells, \"My Guy\"]\n\nThe record became one of the biggest hits of the sixties -- Motown's third pop number one, and a million-seller. It made Mary Wells into a superstar, and the Beatles invited her to be their support act on their UK summer tour. So of course Wells immediately decided to get a better deal at another record label, and never had another hit again.\n\nMeanwhile, Smokey kept plugging away, both at his own records -- though the Miracles went through a bit of a dry patch at this point, as far as the charts go -- and at the Temptations. The group's follow-up, \"I'll Be in Trouble\", was very much a remake of \"The Way You Do the Things You Do\", and while it was good it didn't quite make the top thirty.\n\nThis meant that Norman Whitfield got another go. He teamed up with Eddie Holland to write \"Girl (Why You Wanna Make Me Blue)\", which did only slightly better than \"I'll Be in Trouble\":\n\n[Excerpt: The Temptations, \"Girl (Why You Wanna Make Me Blue)\"]\n\nThe competition between Robinson and Whitfield for who got to make the Temptations' records was heating up -- both men were capable of giving the group hits, but neither had given them the truly massive record that they were clearly capable of having.\n\nSo Smokey did the obvious thing. He wrote a sequel to his biggest song ever, and he gave it to the new guy to sing.\n\nUp until this point, David Ruffin hadn't taken a lead vocal on a Temptations record -- Paul Williams was the group's official \"lead singer\", while all the hits had ended up having Eddie's falsetto as the most prominent vocal. But Smokey had seen David singing \"Shout\" with the group, and knew that he had lead singer potential.\n\nWith his fellow Miracle Ronald White, Smokey crafted a song that was the perfect vehicle for Ruffin's vocal, an answer song to \"My Guy\", which replaced that song's bouncy exuberance with a laid-back carefree feeling:\n\n[Excerpt: The Temptations, \"My Girl\"]\n\nBut it's not just Ruffin's record -- everyone talking about the track talks about Ruffin's vocal, or the steady pulse of James Jamerson's bass playing, and both those things are definitely worthy of praise, as of course are Robinson's production and Robinson and White's song, but this is a *Temptations* record, and the whole group are doing far more here than the casual listener might realise. It's only when you listen to the a capella version released on the group's Emperors of Soul box set that you notice all the subtleties of the backing vocal parts.\n\nOn the first verse, the group don't come in until half way through the verse, with Melvin Franklin's great doo-wop bass introducing the backing vocalists, who sing just straight chords:\n\n[Excerpt: The Temptations, \"My Girl (a capella)\"]\n\nIt's not until the chorus that the other group members stretch out a little, taking solo lines and singing actual words rather than just oohs:\n\n[Excerpt: The Temptations, \"My Girl (a capella)\"]\n\nThey then drop back until the same point in the next verse, but this time rather than singing just the plain chords, they're embellishing a little, playing with the rhythm slightly, and Eddie Kendricks' falsetto is moving far more freely than at the same point in the first verse.\n\n[Excerpt: The Temptations, \"My Girl (a capella)\"]\n\nThe backing vocals slowly increase in complexity until you get the complex parts on the tag. Note that on the first chorus they sang the words \"My Girl\" absolutely straight with no stresses, but by the end of the song they're all emphasising every word. They've gone from Jordanaires style precise straight harmony to a strong Black gospel feel in their voices, and you've not even noticed the transition:\n\n[Excerpt: The Temptations, \"My Girl (a capella)\"]\n\nThe track went to number one on the pop charts, knocking off \"This Diamond Ring\" by Gary Lewis and the Playboys, before itself being knocked off by \"Eight Days a Week\" by the Beatles. But it also went to number one on the newly reestablished R&B charts, and stayed there for six weeks:\n\n[Excerpt: The Temptations, \"My Girl\"]\n\nSmokey Robinson was now firmly established as the Temptations' producer, and David Ruffin as the group's lead singer. In 1965 Robinson and Pete Moore of the Miracles would write three more top-twenty pop hits for the group, all with Ruffin on lead -- and also manage to get a B-side sung by Paul Williams, \"Don't Look Back\", to the top twenty on the R&B chart.\n\nNot only that, but the Miracles were also on a roll, producing two of the biggest hits of their career. Pete Moore and Marv Tarplin had been messing around with a variant of the melody for \"The Banana Boat Song\", and came up with an intro for a song:\n\n[Excerpt: The Miracles, \"The Tracks of My Tears\"]\n\nRobinson took that as a jumping-off point and turned it into the song that would define their career:\n\n[Excerpt: The Miracles, \"The Tracks of My Tears\"]\n\nAnd later that year they came up with yet another million-seller for the Miracles with \"Going to a Go-Go\":\n\n[Excerpt: The Miracles, \"Going to a Go-Go\"]\n\nRobinson and his collaborators were being rather overshadowed in the public perception at this point by the success of Holland-Dozier-Holland with the Supremes and the Four Tops, but by any standards the records the Temptations and the Miracles were putting out were massive successes, both commercially and artistically.\n\nBut there were two things that were going to upset this balance. The first was David Ruffin. When he'd joined the group, he'd been the new boy and just eager to get any kind of success at all. Now he was the lead singer, and his ego was starting to get the better of him.\n\nThe other thing that was going to change things was Norman Whitfield. Whitfield hadn't given up on the Temptations just because of Smokey's string of hits with them. Whitfield knew, of course, that Smokey was the group's producer while he was having hits with them, but he also knew that sooner or later everybody slips up. He kept saying, in every meeting, that he had the perfect next hit for the Temptations, and every time he was told \"No, they're Smokey's group\". He knew this would be the reaction, but he also knew that if he kept doing this he would make sure that he was the next in line -- that nobody else could jump the queue and get a shot at them if Smokey failed.\n\nHe badgered Gordy, and wore him down, to the point that Gordy finally agreed that if Smokey's next single for the group didn't make the top twenty on the pop charts like his last four had, Whitfield would get his turn.\n\nThe next single Smokey produced for the group had Eddie Kendricks on lead, and became the group's first R&B number one since \"My Girl\":\n\n[Excerpt: The Temptations, \"Get Ready\"]\n\nBut the R&B and pop charts were diverging, as we saw at the start. While that was their biggest R&B hit in a year, \"Get Ready\" was a comparative failure on the pop charts, only reaching number twenty-nine -- still a hit, but not the top twenty that Gordy had bet on. So Norman Whitfield got a chance. His record featured David Ruffin on lead, as all the group's previous run of hits from \"My Girl\" on had, and was co-written with Eddie Holland. Whitfield decided to play up the Temptations' R&B edge, rather than continue in the softer pop style that had brought them success with Robinson, and came up with something that owed as much to the music coming out of Stax and Atlantic at the time as it did to Motown's pop sensibilities:\n\n[Excerpt: The Temptations, \"Ain't Too Proud to Beg\"]\n\nWhitfield's instinct to lean harder into the R&B sound paid off. \"Ain't Too Proud to Beg\" returned the group to the pop top twenty, as well as going to number one on the R&B charts. From this point on, the Temptations were no longer Smokey's group, they were Norman Whitfield's, and he would produce all their hits for the next eight years.\n\nAnd the group were also now definitively David Ruffin's group -- or so it seemed. When we pick up on the story of the Temptations, we'll discover how Ruffin's plans for solo stardom worked out, and what happened to the rest of the Temptations under Whitfield's guidance.",
  "itunes:subtitle": "Episode one hundred and thirty-three of A History of Rock Music in Five Hundred Songs looks at My Girl by the Temptations, and is part three of a three-episode look at Motown in 1965. Click the full post to read liner notes, links to more information, an",
  "itunes:keywords": "Andre Williams,Berry Gordy,Mary Wells,Mickey Stevenson,Motown,Norman Whitfield,Smokey Robinson,The Funk Brothers,The Miracles,The Temptations",
  "content:encoded": "Episode one hundred and thirty-three of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"My Girl\" by the Temptations, and is part three of a three-episode look at Motown in 1965. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/56531824\">on \"Yeh Yeh\" by Georgie Fame and the Blue Flames.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I've put together <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-133-my-girl-by-the-temptations/\">a Mixcloud playlist</a> of all the recordings excerpted in this episode.\n\n<a href=\"https://amzn.to/3CDtE4Q\">This box set</a> is the definitive collection of the Temptations' work, but is a bit pricey. For those on a budget, <a href=\"https://amzn.to/3i3Enh1\">this two-CD set</a> contains all the hits.\n\nAs well as the general Motown information listed below, I've also referred to <a href=\"https://amzn.to/2XIYuKa\"><em>Ain't Too Proud to Beg: The Troubled Lives and Enduring Soul of the Temptations</em> by Mark Ribowsky,</a> and to <a href=\"https://amzn.to/3nYCru9\">Smokey Robinson's autobiography</a>.\n\nFor Motown-related information in this and other Motown episodes, I’ve used the following resources:\n\n<a href=\"https://amzn.to/2QTOvdM\"><em>Where Did Our Love Go? The Rise and Fall of the Motown Sound</em> by Nelson George</a> is an excellent popular history of the various companies that became Motown.\n\n<a href=\"https://amzn.to/2QQhXRZ\"><em>To Be Loved</em> by Berry Gordy</a> is Gordy’s own, understandably one-sided, but relatively well-written, autobiography.\n\n<a href=\"https://amzn.to/2VIpXII\"><em>Women of Motown: An Oral History</em> by Susan Whitall</a> is a collection of interviews with women involved in Motown.\n\n<a href=\"https://amzn.to/2xVdvfD\"><em>I Hear a Symphony: Motown and Crossover R&B </em>by J. Andrew Flory</a> is an academic look at Motown.\n\n<a href=\"https://amzn.to/2VLquJX\"><em>The Motown Encyclopaedia</em> by Graham Betts</a> is an exhaustive look at the people and records involved in Motown’s thirty-year history.\n\n<a href=\"https://amzn.to/3bZd5q6\"><em>How Sweet It Is</em> by Lamont Dozier and Scott B. Bomar </a>is Dozier’s autobiography, while <a href=\"https://amzn.to/3903ey8\"><em>Come and Get These Memories </em>by Brian and Eddie Holland and Dave Thompson</a> is the Holland brothers’.\n\nAnd <a href=\"https://motownjunkies.co.uk/\">Motown Junkies</a> is an infrequently-updated blog looking at (so far) the first 694 tracks released on Motown singles.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nFor the last few weeks we've been looking at Motown in 1965, but now we're moving away from Holland, Dozier, and Holland, we're also going to move back in time a little, and look at a record that was released in December 1964.\n\nI normally try to keep this series in more or less chronological order, but to tell this story I had to first show the new status quo of the American music industry after the British Invasion, and some of what had to be covered there was covered in songs from early 1965.\n\nAnd the reason I wanted to show that status quo before doing this series of Motown records is that we're now entering into a new era of musical segregation, and really into the second phase of this story.\n\nIn 1963, Billboard had actually stopped having an R&B chart -- Cashbox magazine still had one, but Billboard had got rid of theirs. The reasoning was simple -- by that point there was so much overlap between the R&B charts and the pop charts that it didn't seem necessary to have both. The stuff that was charting on the R&B charts was also charting pop -- people like Ray Charles or Chubby Checker or the Ronettes or Sam Cooke. The term \"rock and roll\" had originally been essentially a marketing campaign to get white people to listen to music made by Black people, and it had worked.\n\nThere didn't seem to be a need for a separate category for music listened to by Black people, because that was now the music listened to by *everybody*.\n\nOr it had been, until the Beatles turned up.\n\nAt that point, the American charts were flooded by groups with guitars, mostly British, mostly male, and mostly white.\n\nThe story of rock and roll from 1954 through 1964 had been one of integration, of music made by Black people becoming the new mainstream of music in the USA. The story for the next decade or more would be one of segregation, of white people retaking the pop charts, and rebranding \"rock and roll\" so thoroughly that by the early 1970s nobody would think of the Supremes or the Shirelles or Sam Cooke as having been rock and roll performers at all. And so today we're going to look at the record that was number one the week that Billboard reinstated its R&B chart, and which remains one of the most beloved classics of the time period. We're going to look at the careers of two different groups at Motown, both of whom managed to continue having hits, and even become bigger, after the British Invasion, and at the songwriter and producer who was responsible for those hits -- and who was also an inspiration for the Beatles, who inadvertently caused that invasion. We're going to look at Smokey Robinson, and at \"My Girl\" by the Temptations:\n\n[Excerpt: The Temptations, \"My Girl\"]\n\nThe story of the Temptations both starts and ends with Otis Williams. As I write this, Williams is the only living member of the classic Temptations lineup, and is the leader of the current group. And Williams also started the group that, after many lineup changes and mergers, became the Temptations, and was always the group's leader, even though he has never been its principal lead singer.\n\nThe group that eventually became the Temptations started out when Williams formed a group with a friend, Al Bryant, in the late 1950s. They were inspired by a doo-wop group called the Turbans, who had had a hit in 1956 with a song called \"When You Dance\":\n\n[Excerpt: The Turbans, \"When You Dance\"]\n\nThe Turbans, appropriately enough, used to wear turbans on their heads when they performed, and Williams and Bryant's new group wanted to use the same gimmick, so they decided to come up with a Middle-Eastern sounding group name that would justify them wearing Arabic style costumes. Unfortunately, they didn't have the greatest grasp of geography in the world, and so this turban-wearing group named themselves the Siberians.\n\nThe Siberians recorded one single under that name -- a single that has been variously reported as being called \"The Pecos Kid\" and \"Have Gun Will Travel\", but which sold so poorly that now no copies are known to exist anywhere -- before being taken on by a manager called Milton Jenkins, who was as much a pimp as he was a manager, but who definitely had an eye for talent. Jenkins was the manager of two other groups -- the Primes, a trio from Alabama who he'd met in Cleveland when they'd travelled there to see if they could get discovered, and who had moved with him to Detroit, and a group he put together, called the Primettes, who later became the Supremes.\n\nThe Primes consisted of three singers -- Eddie Kendricks, Paul Williams (no relation to Otis, or to the soft-pop singer and actor of the same name), and Kell Osborne, who sang lead. The Primes became known around Detroit as some of the best performers in the city -- no mean feat considering that Jackie Wilson, Aretha Franklin, the Miracles and the Four Tops, just for a start, were performing regularly on the same circuit.\n\nJenkins had big plans for his groups, and he sent them all to dance school to learn to perform choreographed routines. But then Jenkins became ill and disappeared from the scene, and the Primes split up. Kendricks and Paul Williams went back to Alabama, while Osborne moved on to California, where he made several unsuccessful records, including \"The Bells of St. Mary\", produced by Lester Sill and Lee Hazelwood and arranged by Phil Spector:\n\n[Excerpt: Kell Osborne, \"The Bells of St. Mary\"]\n\nBut while the Primes had split up, the Siberians hadn't. Instead, they decided to get new management, which came in the person of a woman named Johnnie Mae Matthews. Matthews was the lead singer of a group called the Five Dapps, who'd had a local hit with a track called \"Do Whap A Do\", one of the few Dapps songs she didn't sing lead on:\n\n[Excerpt: The Five Dapps, \"Do Whap A Do\"]\n\nAfter that had become successful, Matthews had started up her own label, Northern -- which was apparently named after a brand of toilet paper -- to put out records of her group, often backed by the same musicians who would later become the core of the Funk Brothers. Her group, renamed Johnnie Mae Matthews and the Dapps, put out two more singles on her label, with her singing lead:\n\n[Excerpt: Johnnie Mae Matthews and the Dapps, \"Mr. Fine\"]\n\nMatthews had become something of an entrepreneur, managing other local acts like Mary Wells and Popcorn Wylie, and she wanted to record the Siberians, but two of the group had dropped out after Jenkins had disappeared, and so they needed some new members. In particular they needed a bass singer -- and Otis Williams knew of a good one.\n\nMelvin Franklin had been singing with various groups around Detroit, but Williams was thinking in particular of Franklin's bass vocal on \"Needed\" by the Voice Masters.\n\nWe've mentioned the Voice Masters before, but they were a group with a rotating membership that included David Ruffin and Lamont Dozier. Franklin hadn't been a member of the group, but he had been roped in to sing bass on \"Needed\", which was written and produced by Gwen Gordy and Roquel Davis, and was a clear attempt at sounding like Jackie Wilson:\n\n[Excerpt: The Voice Masters, \"Needed\"]\n\nWilliams asked Franklin to join the group, and Franklin agreed, but felt bad about leaving his current group. However, the Siberians also needed a new lead singer, and so Franklin brought in Richard Street from his group.\n\nMatthews renamed the group the Distants and took them into the studio. They actually got there early, and got to see another group, the Falcons, record what would become a million-selling hit:\n\n[Excerpt: The Falcons, \"You're So Fine\"]\n\nThe Falcons, whose lead vocalist Joe Stubbs was Levi Stubbs' brother, were an important group in their own right, and we'll be picking up on them next week, when we look at a single by Joe Stubbs' replacement in the group.\n\nThe Distants' single wouldn't be quite as successful as the Falcons', but it featured several people who would go on to become important in Motown. As well as several of the Funk Brothers in the backing band, the record also featured additional vocals by the Andantes, and on tambourine a local pool-hall hustler the group knew named Norman Whitfield.\n\nThe song itself was written by Williams, and was essentially a rewrite of \"Shout!\" by the Isley Brothers:\n\n[Excerpt: The Distants, \"Come On\"]\n\nThe Distants recorded a second single for Northern, but then Williams made the mistake of asking Matthews if they might possibly receive any royalties for their records. Matthews said that the records had been made with her money, that she owned the Distants' name, and she was just going to get five new singers.\n\nMatthews did actually get several new singers to put out a single under the Distants name, with Richard Street still singing lead -- Street left the group when they split from Matthews, as did another member, leaving the group as a core of Otis Williams, Melvin Franklin, and Al Bryant.\n\nBut before the split with Matthews, Berry Gordy had seen the group and suggested they come in to Motown for an audition. Otis, Melvin, and Al, now renamed the Elgins, wanted to do just that. But they needed a new lead singer.\n\nAnd happily, they had one. Eddie Kendricks phoned up Otis Williams and said that he and Paul Williams were back in town, and did Otis know of any gigs that were going? Otis did indeed know of such a gig, and Paul and Eddie joined the Elgins, Paul as lead singer and Eddie as falsetto singer.\n\nThis new lineup of the group were auditioned by Mickey Stevenson, Motown's head of A&R, and he liked them enough that he signed them up. But he insisted that the name had to change -- there was another group already called the Elgins (though that group never had a hit, and Motown would soon sign up yet another group and change their name to the Elgins, leading to much confusion). The group decided on a new name -- The Temptations.\n\nTheir first record was co-produced by Stevenson and Andre Williams. Williams, who was no relation to either Otis or Paul (and as a sidenote I do wish there weren't so many people with the surname Williams in this story, as it means I can't write it in my usual manner of referring to people by their surname) was a minor R&B star who co-wrote \"Shake a Tail Feather\", and who had had a solo hit with his record \"Bacon Fat\":\n\n[Excerpt: Andre Williams, \"Bacon Fat\"]\n\nAndre Williams, who at this point in time was signed to Motown though not having much success, was brought in because the perception at Motown was that the Temptations would be one of their harder-edged R&B groups, rather than going for the softer pop market, and he would be able to steer the recording in that direction. The song they chose to record was one that Otis Williams had written, though Mickey Stevenson gets a co-writing credit and may have helped polish it:\n\n[Excerpt: The Temptations, \"Oh Mother of Mine\"]\n\nThe new group lineup became very close, and started thinking of each other like family and giving each other nicknames -- though they also definitely split into two camps. Otis Williams and Melvin Franklin were always a pair, and Eddie Kendricks and Paul Williams had come up together and thought of themselves as a team. Al Bryant, even though he had been with Otis from the beginning, was a bit of an outlier in this respect. He wasn't really part of either camp, and he was the only one who didn't get a nickname from the other band members. He was also the only one who kept his day job -- while the other four were all determined that they were going to make it as professional singers, he was hesitant and kept working at the dairy.\n\nAs a result, whenever there were fights in the group -- and the fights would sometimes turn physical -- the fighting would tend to be between Eddie Kendricks and Melvin Franklin. Otis was the undisputed leader, and nobody wanted to challenge him, but from the beginning Kendricks and Paul Williams thought of Otis as a bit too much of a company man. They also thought of Melvin as Otis' sidekick and rubber stamp, so rather than challenge Otis they'd have a go at Melvin.\n\nBut, for the most part, they were extremely close at this point.\n\nThe Temptations' first single didn't have any great success, but Berry Gordy had faith in the group, and produced their next single himself, a song that he cowrote with Otis, Melvin, and Al, and which Brian Holland also chipped in some ideas for. That was also unsuccessful, but the next single, written by Gordy alone, was slightly more successful. For \"(You're My) Dream Come True\", Gordy decided to give the lead to Kendricks, the falsetto singer, and the track also featured a prominent instrumental line by Gordy's wife Raynoma -- what sounds like strings on the record is actually a primitive synthesiser called an ondioline:\n\n[Excerpt: The Temptations, \"(You're My) Dream Come True\"]\n\nThat made number twenty-two on the R&B chart, and was the first sign of any commercial potential for the group -- and so Motown went in a totally different direction and put out a cover version, of a record by a group called the Diablos, whose lead singer was Barrett Strong's cousin Nolan. The Temptations' version of \"Mind Over Matter\" wasn't released as by the Temptations, but as by the Pirates:\n\n[Excerpt: The Pirates, \"Mind Over Matter\"]\n\nThat was a flop, and at the same time as they released it, they also released another Gordy song under their own name, a song called \"Paradise\" which seems to have been an attempt at making a Four Seasons soundalike, which made number 122 on the pop charts and didn't even do that well on the R&B charts.\n\nAnnoyingly, the Temptations had missed out on a much bigger hit. Gordy had written \"Do You Love Me?\" for the group, but had been hit with a burst of inspiration and wanted to do the record *NOW*. He'd tried phoning the various group members, but got no answer -- they were all in the audience at a gospel music show at the time, and had no idea he was trying to get in touch with them. So he'd pulled in another group, The Contours, and their version of the song went to number three on the pop charts:\n\n[Excerpt: The Contours, \"Do You Love Me?\"]\n\nAccording to the biography of the Temptations I'm using as a major source for this episode, that was even released on the same day as both \"Paradise\" and \"Mind Over Matter\", though  other sources I've consulted have it coming out a few months earlier.\n\nDespite \"Paradise\"'s lack of commercial success, though, it did introduce an element that would become crucial for the group's future -- the B-side was the first song for the group written by Smokey Robinson.\n\nWe've mentioned Robinson briefly in previous episodes on Motown, but he's worth looking at in a lot more detail, because he is in some ways the most important figure in Motown's history, though also someone who has revealed much less of himself than many other Motown artists.\n\nBoth of these facts stem from the same thing, which is that Robinson is the ultimate Motown company man. He was a vice president of the company, and he was Berry Gordy's best friend from before the company even started. While almost every other artist, writer, or producer signed to Motown has stories to tell of perceived injustices in the way that Motown treated them, Robinson has always positioned himself on the side of the company executives rather than as one of the other artists.\n\nHe was the only person outside the Gordy family who had a place at the very centre of the organisation -- and he was also one of a very small number of people during Motown's golden age who would write, produce, *and* perform.\n\nNow, there were other people who worked both as artists and on the backroom side of things -- we've seen that Marvin Gaye and Stevie Wonder would sometimes write songs for other artists, and that Eddie Holland and Lamont Dozier had started out as performers before moving into songwriting. But these were mostly little dalliances -- in general, in Motown in the sixties, you were either a performer or you were a writer-producer.\n\nBut Smokey Robinson was both -- and he was *good* at both, someone who was responsible for creating many of the signature hits of Motown.\n\nAt this point in his career, Robinson had, as we've heard previously, been responsible for Motown's second big hit, after \"Money\", when he'd written \"Shop Around\" for his own group The Miracles:\n\n[Excerpt: The Miracles, \"Shop Around\"]\n\nThe Miracles had continued to have hits, though none as big as \"Shop Around\", with records like \"What's So Good About Goodbye?\":\n\n[Excerpt: The Miracles, \"What's So Good About Goodbye?\"]\n\nBut Robinson had also been writing regularly for other artists. He'd written some stuff that the Supremes had recorded, though like all the Supremes material at this point it had been unsuccessful, and he'd also started a collaboration with the label's biggest star at this point, Mary Wells, for whom he'd written top ten hits like \"The One Who Really Loves You\":\n\n[Excerpt: Mary Wells, \"The One Who Really Loves You\"]\n\nand \"You Beat Me To The Punch\", co-written with fellow Miracle Ronnie White, which as well as going top ten pop made number one on the R&B charts:\n\n[Excerpt: Mary Wells, \"You Beat Me to The Punch\"]\n\nBetween 1962 and 1964, Robinson would consistently write huge hits for Wells, as well as continuing to have hits with the Miracles, and his writing was growing in leaps and bounds. He was regarded by almost everyone at Motown as the best writer the company had, both for his unique melodic sensibility and for the literacy of his lyrics. When he'd first met Berry Gordy, he'd been a writer with a lot of potential, but he hadn't understood how to structure a lyric -- he'd thrown in a lot of unrelated ideas. Gordy had taken him under his wing and shown him how to create a song with a beginning, a middle, and an end, and Robinson had immediately understood what he needed to do. His lyrics, with their clever conceits and internal rhymes, became the ones that everyone else studied -- when Eddie Holland decided to become a songwriter rather than a singer, he'd spent months just studying Robinson's lyrics to see how they worked.\n\nRobinson was even admired by the Beatles, especially John Lennon -- one can hear his melismatic phrases all over Lennon's songwriting in this period, most notably in songs like \"Ask Me Why\", and the Beatles covered one of Robinson's songs on their second album, With the Beatles:\n\n[Excerpt: The Beatles, \"You Really Got a Hold On Me\"]\n\nAfter writing the B-side to \"Paradise\", Robinson was given control of the Temptations' next single. His \"I Want a Love I Can See\" didn't do any better than \"Paradise\", and is in some ways more interesting for the B-side, \"The Further You Look, The Less You See\":\n\n[Excerpt: The Temptations, \"The Further You Look, The Less You See\"]\n\nThat track's interesting because it's a collaboration between Robinson and Norman Whitfield, that pool-hall hustler who'd played tambourine on the Distants' first single. Whitfield had produced the records by the later Distants, led by Richard Street, and had then gone to work for a small label owned by Berry Gordy's ex-mother-in-law. Gordy had bought out that label, and with it Whitfield's contract, and at this point Whitfield was very much an apprentice to Robinson.\n\nBoth men were huge admirers of the Temptations, and for the next few years both would want to be the group's main producer and songwriter, competing for the right to record their next single -- though for a good chunk of time this would not really be a competition, as Whitfield was minor league compared to Robinson.\n\n\"I Want a Love I Can See\" was a flop, and the Temptations' next single was another Berry Gordy song. When that flopped too, Gordy seriously started considering dropping the group altogether.\n\nWhile this was happening, though, Robinson was busily writing more great songs for his own group and for Mary Wells, songs like \"What Love Has Joined Together\", co-written with his bandmate Bobby Rogers:\n\n[Excerpt: Mary Wells, \"What Love Has Joined Together\"]\n\nAnd the Temptations were going through their own changes. Al was becoming more and more of an outsider in the group, while also thinking of himself as the real star. He thought this even though he was the weak link -- Paul and Eddie were the lead singers, Otis was the band's leader, Melvin had a hugely distinctive bass voice, and Al was... just \"the other one\".\n\nThings came to a head at a gig in October 1963, when a friend of the group showed up. David Ruffin was so friendly with Melvin Franklin that Franklin called him his cousin, and he was also a neighbour of Otis'. He had been a performer from an early age -- he'd been in a gospel group with his older brother Jimmy and their abusive father. Once he'd escaped his father, he'd gone on to perform in a duo with his brother, and then in a series of gospel groups, including stints in the Dixie Nightingales and the Soul Stirrers.\n\nRuffin had been taken on by a manager called Eddie Bush, who adopted him -- whether legally or just in their minds is an open question -- and had released his first single as Little David Bush when he was seventeen, in 1958:\n\n[Excerpt: Little David Bush, \"You and I\"]\n\nRuffin and Bush had eventually parted ways, and Ruffin had taken up with the Gordy family, helping Berry Gordy Sr out in his construction business -- he'd actually helped build the studio that Berry Jr owned and where most of the Motown hits were recorded -- and singing on records produced by Gwen Gordy. He'd been in the Voice Masters, who we heard earlier this episode, and had also recorded solo singles with the Voice Masters backing, like \"I'm In Love\":\n\n[Excerpt: David Ruffin, \"I'm In Love\"]\n\nWhen Gwen Gordy's labels had been absorbed into Motown, so had Ruffin, who had also got his brother Jimmy signed to the label. They'd planned to record as the Ruffin Brothers, but then Jimmy had been drafted, and Ruffin was at a loose end -- he technically had a Motown contract, but wasn't recording anything.\n\nBut then in October 1963 he turned up to a Temptations gig. For the encore, the group always did the Isley Brothers song \"Shout!\", and Ruffin got up on stage with them and started joining in, dancing more frantically than the rest of the group. Al started trying to match him, feeling threatened by this interloper. They got wilder and wilder, and the audience loved it so much that the group were called back for another encore, and Ruffin joined them again. They did the same song again, and got an even better reaction. They came back for a third time, and did it again, and got an even better reaction. Ruffin then disappeared into the crowd.\n\nThe group decided that enough was enough -- except for Al, who was convinced that they should do a fourth encore without Ruffin. The rest of the group were tired, and didn't want to do the same song for a fourth time, and thought they should leave the audience wanting more. Al, who had been drinking, got aggressive, and smashed a bottle in Paul Williams' face, hospitalising him. Indeed, it was only pure luck that kept Williams from losing his vision, and he was left with a scar but no worse damage.\n\nOtis, Eddie, and Melvin decided that they needed to sack Al, but Paul, who was the peacemaker in the group, insisted that they shouldn't, and also refused to press charges. Out of respect for Paul, the rest of the group agreed to give Al one more chance. But Otis in particular was getting sick of Al and thought that the group should just try to get David Ruffin in. Everyone agreed that if Al did anything to give Otis the slightest reason, he could be sacked.\n\nTwo months later, he did just that. The group were on stage at the annual Motown Christmas show, which was viewed by all the acts as a competition, and Paul had worked out a particularly effective dance routine for the group, to try to get the crowd going. But while they were performing, Al came over to Otis and suggested that the two of them, as the \"pretty boys\" should let the other three do all the hard work while they just stood back and looked good for the women. Otis ignored him and carried on with the routine they'd rehearsed, and Al was out as soon as they came offstage. And David Ruffin was in.\n\nBut for now, Ruffin was just the missing element in the harmony stack, not a lead vocalist in his own right. For the next single, both Smokey Robinson and Berry Gordy came up with songs for the new lineup of the group, and they argued about which song should be the A-side -- one of the rare occasions where the two disagreed on anything. They took the two tracks to Motown's quality control meeting, and after a vote it was agreed that the single should be the song that Robinson had written for Eddie Kendricks to sing, \"The Way You Do the Things You Do\":\n\n[Excerpt: The Temptations, \"The Way You Do the Things You Do\"]\n\nAt first, the group hadn't liked that song, and it wasn't until they rehearsed it a few times that they realised that Robinson was being cleverer than they'd credited him for with the lyrics. Otis Williams would later talk about how lines like \"You've got a smile so bright, you know you could have been a candle\" had seemed ridiculous to them at first, but then they'd realised that the lyric was parodying the kinds of things that men say when they don't know what to say to a woman, and that it's only towards the end of the song that the singer stops trying bad lines and just starts speaking honestly -- \"you really swept me off my feet, you make my life complete, you make my life so bright, you make me feel all right\":\n\n[Excerpt: The Temptations, \"The Way You Do the Things You Do\"]\n\nThat track was also the first one that the group cut to a prerecorded backing track, Motown having upgraded to a four-track system. That allowed the group to be more subtle with their backing vocal arrangements, and \"The Way You Do the Things You Do\" is the point at which the Temptations become fully themselves.\n\nBut the group didn't realise that at first. They spent the few weeks after the record's release away from Detroit, playing at the Michigan state fair, and weren't aware that it was starting to do things. It was only when Otis and David popped in to the Motown offices and people started talking to them about them having a hit that they realised the record had made the pop charts. Both men had been trying for years to get a big hit, with no success, and they started crying in each other's arms, Ruffin saying ‘Otis, this is the first time in my life I feel like I’ve been accepted, that I’ve done something.’”\n\nThe record eventually made number eleven on the pop charts, and number one on the Cashbox R&B chart -- Billboard, as we discussed earlier, having discontinued theirs, but Otis Williams still thinks that given the amount of airplay that the record was getting it should have charted higher, and that something fishy was going on with the chart compilation at that point. Perhaps, but given that the record reached the peak of its chart success in April 1964, the high point of Beatlemania, when the Beatles had five records in the top ten, it's also just possible that it was a victim of bad timing.\n\nBut either way, number eleven on the pop charts was a significant hit.\n\nShortly after that, though, Smokey Robinson came up with an even bigger hit. \"My Guy\", written for Mary Wells, had actually only been intended as a bit of album filler. Motown were putting together a Mary Wells album, and as with most albums at the time it was just a collection of tracks that had already been released as singles and stuff that hadn't been considered good enough to release. But they were a track short, and Smokey was asked to knock together something quickly. He recorded a backing track at the end of a day cutting tracks for a *Temptations* album -- The Temptations Sing Smokey -- and everyone was tired by the time they got round to recording it, but you'd never guess that from the track itself, which is as lively as anything Motown put out.\n\n\"My Guy\" was a collaborative creation, with an arrangement that was worked on by the band -- it was apparently the Funk Brothers who came up with the intro, which was lifted from a 1956 record, \"Canadian Sunset\" by Hugo Winterhalter. Compare that:\n\n[Excerpt: Hugo Winterhalter, \"Canadian Sunset\"]\n\nto “My Guy”:\n\n[Excerpt: Mary Wells, \"My Guy\"]\n\nThe record became one of the biggest hits of the sixties -- Motown's third pop number one, and a million-seller. It made Mary Wells into a superstar, and the Beatles invited her to be their support act on their UK summer tour. So of course Wells immediately decided to get a better deal at another record label, and never had another hit again.\n\nMeanwhile, Smokey kept plugging away, both at his own records -- though the Miracles went through a bit of a dry patch at this point, as far as the charts go -- and at the Temptations. The group's follow-up, \"I'll Be in Trouble\", was very much a remake of \"The Way You Do the Things You Do\", and while it was good it didn't quite make the top thirty.\n\nThis meant that Norman Whitfield got another go. He teamed up with Eddie Holland to write \"Girl (Why You Wanna Make Me Blue)\", which did only slightly better than \"I'll Be in Trouble\":\n\n[Excerpt: The Temptations, \"Girl (Why You Wanna Make Me Blue)\"]\n\nThe competition between Robinson and Whitfield for who got to make the Temptations' records was heating up -- both men were capable of giving the group hits, but neither had given them the truly massive record that they were clearly capable of having.\n\nSo Smokey did the obvious thing. He wrote a sequel to his biggest song ever, and he gave it to the new guy to sing.\n\nUp until this point, David Ruffin hadn't taken a lead vocal on a Temptations record -- Paul Williams was the group's official \"lead singer\", while all the hits had ended up having Eddie's falsetto as the most prominent vocal. But Smokey had seen David singing \"Shout\" with the group, and knew that he had lead singer potential.\n\nWith his fellow Miracle Ronald White, Smokey crafted a song that was the perfect vehicle for Ruffin's vocal, an answer song to \"My Guy\", which replaced that song's bouncy exuberance with a laid-back carefree feeling:\n\n[Excerpt: The Temptations, \"My Girl\"]\n\nBut it's not just Ruffin's record -- everyone talking about the track talks about Ruffin's vocal, or the steady pulse of James Jamerson's bass playing, and both those things are definitely worthy of praise, as of course are Robinson's production and Robinson and White's song, but this is a *Temptations* record, and the whole group are doing far more here than the casual listener might realise. It's only when you listen to the a capella version released on the group's Emperors of Soul box set that you notice all the subtleties of the backing vocal parts.\n\nOn the first verse, the group don't come in until half way through the verse, with Melvin Franklin's great doo-wop bass introducing the backing vocalists, who sing just straight chords:\n\n[Excerpt: The Temptations, \"My Girl (a capella)\"]\n\nIt's not until the chorus that the other group members stretch out a little, taking solo lines and singing actual words rather than just oohs:\n\n[Excerpt: The Temptations, \"My Girl (a capella)\"]\n\nThey then drop back until the same point in the next verse, but this time rather than singing just the plain chords, they're embellishing a little, playing with the rhythm slightly, and Eddie Kendricks' falsetto is moving far more freely than at the same point in the first verse.\n\n[Excerpt: The Temptations, \"My Girl (a capella)\"]\n\nThe backing vocals slowly increase in complexity until you get the complex parts on the tag. Note that on the first chorus they sang the words \"My Girl\" absolutely straight with no stresses, but by the end of the song they're all emphasising every word. They've gone from Jordanaires style precise straight harmony to a strong Black gospel feel in their voices, and you've not even noticed the transition:\n\n[Excerpt: The Temptations, \"My Girl (a capella)\"]\n\nThe track went to number one on the pop charts, knocking off \"This Diamond Ring\" by Gary Lewis and the Playboys, before itself being knocked off by \"Eight Days a Week\" by the Beatles. But it also went to number one on the newly reestablished R&B charts, and stayed there for six weeks:\n\n[Excerpt: The Temptations, \"My Girl\"]\n\nSmokey Robinson was now firmly established as the Temptations' producer, and David Ruffin as the group's lead singer. In 1965 Robinson and Pete Moore of the Miracles would write three more top-twenty pop hits for the group, all with Ruffin on lead -- and also manage to get a B-side sung by Paul Williams, \"Don't Look Back\", to the top twenty on the R&B chart.\n\nNot only that, but the Miracles were also on a roll, producing two of the biggest hits of their career. Pete Moore and Marv Tarplin had been messing around with a variant of the melody for \"The Banana Boat Song\", and came up with an intro for a song:\n\n[Excerpt: The Miracles, \"The Tracks of My Tears\"]\n\nRobinson took that as a jumping-off point and turned it into the song that would define their career:\n\n[Excerpt: The Miracles, \"The Tracks of My Tears\"]\n\nAnd later that year they came up with yet another million-seller for the Miracles with \"Going to a Go-Go\":\n\n[Excerpt: The Miracles, \"Going to a Go-Go\"]\n\nRobinson and his collaborators were being rather overshadowed in the public perception at this point by the success of Holland-Dozier-Holland with the Supremes and the Four Tops, but by any standards the records the Temptations and the Miracles were putting out were massive successes, both commercially and artistically.\n\nBut there were two things that were going to upset this balance. The first was David Ruffin. When he'd joined the group, he'd been the new boy and just eager to get any kind of success at all. Now he was the lead singer, and his ego was starting to get the better of him.\n\nThe other thing that was going to change things was Norman Whitfield. Whitfield hadn't given up on the Temptations just because of Smokey's string of hits with them. Whitfield knew, of course, that Smokey was the group's producer while he was having hits with them, but he also knew that sooner or later everybody slips up. He kept saying, in every meeting, that he had the perfect next hit for the Temptations, and every time he was told \"No, they're Smokey's group\". He knew this would be the reaction, but he also knew that if he kept doing this he would make sure that he was the next in line -- that nobody else could jump the queue and get a shot at them if Smokey failed.\n\nHe badgered Gordy, and wore him down, to the point that Gordy finally agreed that if Smokey's next single for the group didn't make the top twenty on the pop charts like his last four had, Whitfield would get his turn.\n\nThe next single Smokey produced for the group had Eddie Kendricks on lead, and became the group's first R&B number one since \"My Girl\":\n\n[Excerpt: The Temptations, \"Get Ready\"]\n\nBut the R&B and pop charts were diverging, as we saw at the start. While that was their biggest R&B hit in a year, \"Get Ready\" was a comparative failure on the pop charts, only reaching number twenty-nine -- still a hit, but not the top twenty that Gordy had bet on. So Norman Whitfield got a chance. His record featured David Ruffin on lead, as all the group's previous run of hits from \"My Girl\" on had, and was co-written with Eddie Holland. Whitfield decided to play up the Temptations' R&B edge, rather than continue in the softer pop style that had brought them success with Robinson, and came up with something that owed as much to the music coming out of Stax and Atlantic at the time as it did to Motown's pop sensibilities:\n\n[Excerpt: The Temptations, \"Ain't Too Proud to Beg\"]\n\nWhitfield's instinct to lean harder into the R&B sound paid off. \"Ain't Too Proud to Beg\" returned the group to the pop top twenty, as well as going to number one on the R&B charts. From this point on, the Temptations were no longer Smokey's group, they were Norman Whitfield's, and he would produce all their hits for the next eight years.\n\nAnd the group were also now definitively David Ruffin's group -- or so it seemed. When we pick up on the story of the Temptations, we'll discover how Ruffin's plans for solo stardom worked out, and what happened to the rest of the Temptations under Whitfield's guidance.",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and thirty-three of A History of Rock Music in Five Hundred Songs looks at \"My Girl\" by the Temptations, and is part three of a three-episode look at Motown in 1965. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Yeh Yeh\" by Georgie Fame and the Blue Flames.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, I've put together a Mixcloud playlist of all the recordings excerpted in this episode.\n\nThis box set is the definitive collection of the Temptations' work, but is a bit pricey. For those on a budget, this two-CD set contains all the hits.\n\nAs well as the general Motown information listed below, I've also referred to Ain't Too Proud to Beg: The Troubled Lives and Enduring Soul of the Temptations by Mark Ribowsky, and to Smokey Robinson's autobiography.\n\nFor Motown-related information in this and other Motown episodes, I’ve used the following resources:\n\nWhere Did Our Love Go? The Rise and Fall of the Motown Sound by Nelson George is an excellent popular history of the various companies that became Motown.\n\nTo Be Loved by Berry Gordy is Gordy’s own, understandably one-sided, but relatively well-written, autobiography.\n\nWomen of Motown: An Oral History by Susan Whitall is a collection of interviews with women involved in Motown.\n\nI Hear a Symphony: Motown and Crossover R&B by J. Andrew Flory is an academic look at Motown.\n\nThe Motown Encyclopaedia by Graham Betts is an exhaustive look at the people and records involved in Motown’s thirty-year history.\n\nHow Sweet It Is by Lamont Dozier and Scott B. Bomar is Dozier’s autobiography, while Come and Get These Memories by Brian and Eddie Holland and Dave Thompson is the Holland brothers’.\n\nAnd Motown Junkies is an infrequently-updated blog looking at (so far) the first 694 tracks released on Motown singles.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nFor the last few weeks we've been looking at Motown in 1965, but now we're moving away from Holland, Dozier, and Holland, we're also going to move back in time a little, and look at a record that was released in December 1964.\n\nI normally try to keep this series in more or less chronological order, but to tell this story I had to first show the new status quo of the American music industry after the British Invasion, and some of what had to be covered there was covered in songs from early 1965.\n\nAnd the reason I wanted to show that status quo before doing this series of Motown records is that we're now entering into a new era of musical segregation, and really into the second phase of this story.\n\nIn 1963, Billboard had actually stopped having an R&B chart -- Cashbox magazine still had one, but Billboard had got rid of theirs. The reasoning was simple -- by that point there was so much overlap between the R&B charts and the pop charts that it didn't seem necessary to have both. The stuff that was charting on the R&B charts was also charting pop -- people like Ray Charles or Chubby Checker or the Ronettes or Sam Cooke. The term \"rock and roll\" had originally been essentially a marketing campaign to get white people to listen to music made by Black people, and it had worked.\n\nThere didn't seem to be a need for a separate category for music listened to by Black people, because that was now the music listened to by *everybody*.\n\nOr it had been, until the Beatles turned up.\n\nAt that point, the American charts were flooded by groups with guitars, mostly British, mostly male, and mostly white.\n\nThe story of rock and roll from 1954 through 1964 had been one of integration, of music made by Black people becoming the new mains",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and thirty-three of A History of Rock Music in Five Hundred Songs looks at \"My Girl\" by the Temptations, and is part three of a three-episode look at Motown in 1965. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Yeh Yeh\" by Georgie Fame and the Blue Flames.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, I've put together a Mixcloud playlist of all the recordings excerpted in this episode.\n\nThis box set is the definitive collection of the Temptations' work, but is a bit pricey. For those on a budget, this two-CD set contains all the hits.\n\nAs well as the general Motown information listed below, I've also referred to Ain't Too Proud to Beg: The Troubl",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}