{
  "title": "130: CBS's \"The Case of: JonBenet Ramsey\" Part 2",
  "link": "https://audioboom.com/posts/7567174",
  "itunes:episode": 130,
  "itunes:title": "CBS's \"The Case of: JonBenet Ramsey\" Part 2",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3263,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>\n<strong>This is part 2 of our 2-part series. To hear episode 1, </strong><a href=\"https://www.truecrimeobsessed.com/post/129-cbs-s-the-case-of-jonbenet-ramsey\"><strong>go here!</strong></a><br>\n<br>\nOn December 26, 1996, 6-year-old JonBenet Ramsey was found murdered in the basement of her family home. The case quickly became one of the most famous murder mysteries in American history. 20 years after the murder, a team of famous investigators, including Dr. Werner Spitz (known for is work on the JFK assassination, The West Memphis Three, OJ Simpson, and the death of Caylee Anthony) and Dr. Henry Lee (known for his work in \"The Staircase\" The OJ Simpson case, and the case of Laci Peterson) re-investigate the case. <strong>In part 2, our experts tell us exactly what they think happened and who they think is responsible for JonBenet's death.</strong><br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 100 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n<br>\n<a href=\"https://www.obsessedwithpod.com/\"><strong>WE LAUNCHED A NEW PODCAST!</strong></a> \"Obsessed With: Abducted In Plain Sight\" is a 4-part podcast series hosted by Patrick Hinds and Skye Borgman, the director of <em>Abducted in Plain Sight. </em>The podcast takes you behind the scenes of the smash hit documentary by sharing new interview with Jan and her parents, deleted scenes, AN INSANE PLOT LINE THAT LEFT OUT OF THE FILM THAT YOU WON'T BELIEVE, and audio journal recorded by the kidnapper himself and later recovered by the FBI. <strong>BINGE ALL 4 EPISODES NOW WHEREVER YOU GET YOUR PODCASTS!</strong>\n</div>\n",
  "pubDate": "Tue, 28 Apr 2020 04:00:00 +0000",
  "guid": "tag:audioboom.com,2020-04-27:/posts/7567174",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}