{
  "title": "Are Sanctions Working?",
  "description": " <a href=\"https://home.treasury.gov/news/press-releases/sm748\">Click here for Under Secretary Mandelker’s complete remarks.</a><br />\n<br />\nThe CSIS Energy & National Security Program is pleased to invite you to <i>Are Sanctions Working?</i>, a conference examining the state of U.S. sanctions―what is different, what is and is not working, and implications for U.S. foreign policy, the global economy, and the energy sector.<br />\n<br />\nThe United States has employed sanctions as a foreign policy mechanism for decades.  In recent years, the United States has developed a new generation of more targeted, more agile economic sanctions.  It has become increasingly reliant on these new tools, and its ambitions for their impact have increased.<br />\n<br />\nWhether more robust sanctions regimes have won any clear victories is a matter of debate.   In the last three years, U.S.-imposed unilateral and secondary sanctions regimes have sought to influence North Korea, Russia, Iran, and Venezuela.  But countries that have been subject to sanctions for years have found ways to adjust to U.S. moves.<br />\n<br />\nThis conference will review the efficacy of the new style of U.S. sanctions, understand what is contributing to their success or failure, and gauge their future.  Speakers will also explore how sustained use of sanctions is impacting one universally important sector: the energy sector.<br />\n \n\n\n<p><b>Welcome & Opening Remarks</b><br />\n<i>Dr. John Hamre, President and CEO, CSIS</i><br />\n<br />\n<b>Keynote </b><br />\n<i>Sigal Mandelker, Under Secretary for Terrorism and Financial Intelligence, U.S. Department of the Treasury</i><br />\n<br />\n<b>Sanctions and Foreign Policy</b><br />\n<i>Heather Conley, Jon Alterman, Jeffrey Mankoff, Moises Rendon, Matthew Goodman</i><br />\n<br />\n<b>Sanctions and the Energy Sector</b><br />\n<i>Peter Flanagan, Sarah Ladislaw, Kevin Book, Stephanie Segal</i></p>\n<br />\n<i>This event is made possible by general funding to CSIS and the CSIS Energy & National Security Program.</i>\n\n\n ",
  "itunes:author": "John J. Hamre, Sarah Ladislaw, Matthew P. Goodman, Jon B. Alterman, Stephanie Segal, Kevin Book, Jeffrey Mankoff, Moises Rendon",
  "pubDate": "Wed, 31 Jul 2019 09:00:00 -0400",
  "enclosure": "",
  "itunes:duration": "2:47:32",
  "guid": "https://csis-website-prod.s3.amazonaws.com/s3fs-public/field_soundcloud_audio/Are%20Sanctions%20Working_0.mp3"
}