{
  "id": "yt:video:WNgi8E3NPkQ",
  "yt:videoId": "WNgi8E3NPkQ",
  "yt:channelId": "UCEnl2ZDocvt4aoIyT3fl8SQ",
  "title": "U.S. Marine SBDs and other aircraft attack Japanese-held Islands in the Pacific d...HD Stock Footage",
  "link": "",
  "author": {
    "name": "CriticalPast",
    "uri": "https://www.youtube.com/channel/UCEnl2ZDocvt4aoIyT3fl8SQ"
  },
  "published": "2014-07-16T12:00:24+00:00",
  "updated": "2022-06-28T07:02:24+00:00",
  "media:group": {
    "media:title": "U.S. Marine SBDs and other aircraft attack Japanese-held Islands in the Pacific d...HD Stock Footage",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "CriticalPast is an archive of historic footage. The vintage footage in this video has been uploaded for research purposes, and is presented in unedited form. Some viewers may find some scenes or audio in this archival material to be unsettling or distressing. CriticalPast makes this media available for researchers and documentarians, and does not endorse or condone any behavior or message, implied or explicit, that is seen or heard in this video.\nLink to order this clip:\nhttp://www.criticalpast.com/video/65675037765_Pacific-Milk-Run_B-25-bombers_SDB-dauntless_dropping-bombs\nHistoric Stock Footage Archival and Vintage Video Clips in HD.\n\nU.S. Marine SBDs and other aircraft attack Japanese-held Islands in the Pacific during world war II.\n\nA film titled 'Pacific Milk Run' . Formations of U.S. B-25 bombers, TBF torpedo bombers,and F4U Corsair fighters, in flight. U.S. Marines flying Douglas SBD Dauntless aircraft. A map shows the Japanese-held Gilbert, Marshall, Marianas, Caroline, and Solomon Islands in the Pacific. Marine Corps SBDs taking off and landing on a coral runway. Marine aircrews at breakfast mess. Intelligence officer confers with Marine Major General. Marine aircrews being briefed about a mission. Pilot and rear gunner board an SBD and take off on a mission with other SBDs as well as F4U Corsairs, and B-25 Mitchell bombers. SBDs peel off to attack Japanese targets. View from cockpit of a B-25 in formation with others. B-25s dropping bombs. Japanese aircraft rise to defend against the U.S. aircraft, including Zekes (Mitsubishi A6M Zeros); Nates (Nakajima Ki-27s) and Tonys ( Kawasaki Ki-61 aircraft). U.S. Corsairs engage the Japanese aircraft in dogfights. Marine SBD bombs a Japanese transport ship. U.S. aircraft formations returning from mission. An SBD lands and parks. Crew chief is briefed by pilot and begins repairs of battle damage. Marine aircrews play baseball and later drink beer. Location: South Pacific Ocean. Date:  1943.\n\nVisit us at www.CriticalPast.com:\n57,000+ broadcast-quality historic clips for immediate download.\nFully digitized and searchable, the CriticalPast collection is one of the largest archival footage collections in the world. All clips are licensed royalty-free, worldwide, in perpetuity. CriticalPast offers immediate downloads of full-resolution HD and SD masters and full-resolution time-coded screeners, 24 hours a day, to serve the needs of broadcast news, TV, film, and publishing professionals worldwide. Still photo images extracted from the vintage footage are also available for immediate download.  CriticalPast is your source for imagery of worldwide events, people, and B-roll spanning the 20th century.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}