{
  "title": "74: Emilie Wapnick- How To Be Everything: ﻿﻿Channel Your Diverse Passions & Skills To Work For You",
  "pubDate": "Thu, 08 Jun 2017 18:23:36 +0000",
  "guid": "f44a41167ef62cb1150925b562ba0db1",
  "link": "https://lifeonpurpose.libsyn.com/74-emilie-wapnick-how-to-be-everything-channel-your-diverse-passions-skills-to-work-for-you",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #74</strong>, my guest is writer, artist, career coach and community leader <strong>Emilie Wapnick</strong>, the Founder and Creative Director at Puttylike, where she helps multipotentialites <em>(people with many passions, skills, and creative pursuits)</em> integrate all of their interests to create dynamic, fulfilling and fruitful careers and lives.<br /> <br /> In this inspiring conversation, we discussed her brand new book, <em><strong>How To Be Everything, A Guide for Those Who (Still) Don't Know What They Want to Be When They Grow Up</strong></em> <em>(Harper Collins)</em>, in which she flips the script on conventional career advice. Instead of suggesting that you specialize, choose a niche, or accumulate 10,000 hours of practice in a single area, she provides a practical framework for building a sustainable life around ALL of your passions.<br /> <br /> <em>“You don't have to choose one thing! That's the big secret no one tells you. \"</em><br /> <br /> About: <strong>Emilie Wapnick</strong> is a writer, career coach, blogger, and community leader. She is the founder and creative director at Puttylike.com, where she helps multipotentialites (people with many passions and creative pursuits) integrate all of their interests to create dynamic, fulfilling, and fruitful careers and lives. Unable to settle on one path herself, Emilie studied music, art, film production and law, graduating from the Law Faculty at McGill University.<br /> <br /> Emilie’s TED talk has been viewed over 3.7 million times, and has been translated into 36 languages. She’s been featured in Fast Company, Forbes, Financial Times, The Huffington Post, BBC, and Lifehacker. Her book How to Be Everything: A Guide for Those Who (Still) Don’t Know What They Want to Be When They Grow Up, came out with HarperCollins in May 2017.<br /> <br /> To learn more about <strong>Emilie's</strong> work, visit: http://puttylike.com/ or http://howtobeeverything.com/.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #74, my guest is writer, artist, career coach and community leader Emilie Wapnick, the Founder and Creative Director at Puttylike, where she helps multipotentialites <em>(people with many passions, skills, and creative pursuits)</em> integrate all of their interests to create dynamic, fulfilling and fruitful careers and lives.  In this inspiring conversation, we discussed her brand new book, <em>How To Be Everything, A Guide for Those Who (Still) Don't Know What They Want to Be When They Grow Up</em> <em>(Harper Collins)</em>, in which she flips the script on conventional career advice. Instead of suggesting that you specialize, choose a niche, or accumulate 10,000 hours of practice in a single area, she provides a practical framework for building a sustainable life around ALL of your passions.  <em>“You don't have to choose one thing! That's the big secret no one tells you. \"</em>  About: Emilie Wapnick is a writer, career coach, blogger, and community leader. She is the founder and creative director at Puttylike.com, where she helps multipotentialites (people with many passions and creative pursuits) integrate all of their interests to create dynamic, fulfilling, and fruitful careers and lives. Unable to settle on one path herself, Emilie studied music, art, film production and law, graduating from the Law Faculty at McGill University.  Emilie’s TED talk has been viewed over 3.7 million times, and has been translated into 36 languages. She’s been featured in Fast Company, Forbes, Financial Times, The Huffington Post, BBC, and Lifehacker. Her book How to Be Everything: A Guide for Those Who (Still) Don’t Know What They Want to Be When They Grow Up, came out with HarperCollins in May 2017.  To learn more about Emilie's work, visit: http://puttylike.com/ or http://howtobeeverything.com/.</p>",
  "enclosure": "",
  "itunes:duration": "48:14",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #74, my guest is writer, artist, career coach and community leader Emilie Wapnick, the Founder and Creative Director at Puttylike, where she helps multipotentialites (people with many passions, skills, and creative..."
}