{
  "guid": "http://themoth.prx.org/?p=3181",
  "title": "The Moth Radio Hour: Finding Your Calling",
  "pubDate": "Mon, 28 Dec 2020 21:00:00 -0000",
  "link": "http://themoth.prx.org/the-moth-radio-hour-finding-your-calling/",
  "description": "<p>A speech writer has a defining moment at the White House; a young Carl Bernstein gets his first job as a copy boy in a news room; a firefighter charges into his first big blaze; and a doctor struggles with duty and identity while serving in a medical camp in Syria.</p>\n\n<p>Hosted by The Moth’s Artistic Director, Catherine Burns. The Moth Radio Hour is produced by The Moth and Jay Allison of Atlantic Public Media.</p>\n\n<p>Storytellers: David Litt, Carl Bernstein, Nick Baskerville, and Vivian Huang.</p>",
  "enclosure": "",
  "itunes:subtitle": "A speech writer has a defining moment at the White House; a young Carl Bernstein gets his first job as a copy boy in a news room; a firefighter charges into his first big blaze; and a doctor struggles with duty and identity while serving in a medical c...",
  "itunes:explicit": true,
  "itunes:episodeType": "full",
  "itunes:duration": "53:34",
  "category": [
    "Podcasts",
    "WNYC",
    "five",
    "mothradiohour",
    "newer"
  ],
  "itunes:author": "The Moth",
  "itunes:summary": "A speech writer has a defining moment at the White House; a young Carl Bernstein gets his first job as a copy boy in a news room; a firefighter charges into his first big blaze; and a doctor struggles with duty and identity while serving in a medical camp in Syria. Hosted by The Moth’s […]",
  "itunes:image": "",
  "media:content": "",
  "content:encoded": "<p>A speech writer has a defining moment at the White House; a young Carl Bernstein gets his first job as a copy boy in a news room; a firefighter charges into his first big blaze; and a doctor struggles with duty and identity while serving in a medical camp in Syria.</p>\n\n<p>Hosted by The Moth’s Artistic Director, Catherine Burns. The Moth Radio Hour is produced by The Moth and Jay Allison of Atlantic Public Media.</p>\n\n<p>Storytellers: David Litt, Carl Bernstein, Nick Baskerville, and Vivian Huang.</p>"
}