{
  "itunes:episode": 53,
  "title": "The Year of Living Disruptively with Guests from Early Episodes",
  "pubDate": "Thu, 12 Dec 2013 15:04:23 +0000",
  "link": "http://newdisrupt.org/blog/2013/12/11/a-year-of-living-disruptively-with-guests-from-early-episodes-53",
  "description": "<p>The New Disruptors launched on December 5, 2012. I wanted to talk to people making stuff, creating art, or helping others get their work out there. The show is now at episode 53, and it's been a delightful year. I wanted to look back at early guests, and was able to get the folks who appeared on the first four episodes to chat briefly about what happened next. I talk in this show with Lisanne Pajot and James Swirksy, <a href=\"http://www.indiegamethemovie.com/\"><em>Indie Game: The Movie</em></a>; Chris Anderson, then <em>Wired</em> and now <a href=\"http://3drobotics.com/\">3DRobotics</a>; Tony Konecny, <a href=\"https://tonx.org/\">Tonx</a> (coffee); and Evan Ratliff, of <a href=\"https://www.atavist.com/\"><em>The Atavist</em> and Creativist</a>.</p>\n\n<p>Thanks to Smile Software's <a href=\"http://smilesoftware.com/nd\">TextExpander</a> for sponsoring this week's episode! TextExpander avoids the tedium of retyping common text, shortening URLs, and much more.</p>\n\n<p>And thanks to our patrons, supporting us by <a href=\"http://www.patreon.com/glennf\">pledging an amount via Patreon</a> for each episode we produce. Thanks this time to GravityFish and Elliott Payne! You help make it all happen. </p>",
  "guid": "tag:soundcloud,2010:tracks/124449419",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "01:21:19",
  "itunes:subtitle": "The New Disruptors is a year old! We catch up with the guests of our first four episodes.",
  "itunes:summary": "The New Disruptors launched on December 5, 2012. I wanted to talk to people making stuff, creating art, or helping others get their work out there. The show is now at episode 53, and it's been a delightful year. I wanted to look back at early guests, and was able to get the folks who appeared on the first four episodes to chat briefly about what happened next. I talk in this show with Lisanne Pajot and James Swirksy, Indie Game: The Movie; Chris Anderson, then Wired and now 3DRobotics; Tony Konecny, Tonx (coffee); and Evan Ratliff, of The Atavist and Creativist. This episode is sponsored by TextExpander from Smile Software. http://smilesoftware.com/nd"
}