{
  "title": "46: Kira Asatryan on The Loneliness Epidemic & How To Stop It",
  "pubDate": "Mon, 22 Feb 2016 17:46:43 +0000",
  "guid": "2a70146919257eb1a87c67cddace6b53",
  "link": "https://lifeonpurpose.libsyn.com/46-kira-asatryan-on-the-loneliness-epidemic-how-to-stop-it",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #46</strong>, my guest is is certified relationship coach, author, blogger, and speaker <strong>Kira Asatryan</strong>, an expert on loneliness, which she believes is a problem of epidemic proportions in our modern times. In her new book, <em><strong>Stop Being Lonely: Three Simple Steps to Developing Close Friendships and Deep Relationships</strong> (just published on New World Library)</em>, she says it’s not a lack of people in our lives, it is a lack of feeling that speaks to the heart of this new loneliness.<br /><br />But there is good news — YOU have the power to create closeness with any willing partner. Closeness is the foundation of all happy and long-lasting relationships, whether romantic, platonic, familial, or business, she writes.<br /><br />About <strong>Kira Asatryan</strong>: I'm a certified relationship coach, author, blogger, loneliness expert, and speaker. I love to speak publicly on the topic of loneliness, as it's a problem of epidemic proportions in our modern times. I maintain a private coaching practice in San Francisco where I help business partners, couples, and individuals develop closeness - the antidote to loneliness - in their relationships.<br /><br />I have a unique passion for those who feel lonely in this world. I understand the unique challenges that lonely people face because I face them as well. I've struggled with loneliness my whole life and have come to find that there are many others out there like me.<br /><br />We are the people who, despite excellent intentions, find it hard to get to know people and find it hard to believe that anyone cares about us. If you relate to this, I can assure you you're not alone.<br /><br />I've spent my coaching career researching, pondering, and reflecting upon what specifically makes relationships feel good or bad. The results of my efforts can be found in my book, my articles, my talks, and I believe they will help you immensely.<br /><br />You can stop being lonely. You've already taken the first step.<br /><br />To learn more about <strong>Kira</strong> and her work, visit: <a href=\"http://www.kiraasatryan.com/\">http://www.kiraasatryan.com/</a>.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #46, my guest is is certified relationship coach, author, blogger, and speaker Kira Asatryan, an expert on loneliness, which she believes is a problem of epidemic proportions in our modern times. In her new book, <em>Stop Being Lonely: Three Simple Steps to Developing Close Friendships and Deep Relationships (just published on New World Library)</em>, she says it’s not a lack of people in our lives, it is a lack of feeling that speaks to the heart of this new loneliness.But there is good news — YOU have the power to create closeness with any willing partner. Closeness is the foundation of all happy and long-lasting relationships, whether romantic, platonic, familial, or business, she writes.About Kira Asatryan: I'm a certified relationship coach, author, blogger, loneliness expert, and speaker. I love to speak publicly on the topic of loneliness, as it's a problem of epidemic proportions in our modern times. I maintain a private coaching practice in San Francisco where I help business partners, couples, and individuals develop closeness - the antidote to loneliness - in their relationships.I have a unique passion for those who feel lonely in this world. I understand the unique challenges that lonely people face because I face them as well. I've struggled with loneliness my whole life and have come to find that there are many others out there like me.We are the people who, despite excellent intentions, find it hard to get to know people and find it hard to believe that anyone cares about us. If you relate to this, I can assure you you're not alone.I've spent my coaching career researching, pondering, and reflecting upon what specifically makes relationships feel good or bad. The results of my efforts can be found in my book, my articles, my talks, and I believe they will help you immensely.You can stop being lonely. You've already taken the first step.To learn more about Kira and her work, visit: <a href=\"http://www.kiraasatryan.com/\">http://www.kiraasatryan.com/</a>.</p>",
  "enclosure": "",
  "itunes:duration": "58:02",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #46, my guest is is certified relationship coach, author, blogger, and speaker Kira Asatryan, an expert on loneliness, which she believes is a problem of epidemic proportions in our modern times. In her new book, Stop Being..."
}