{
  "id": "yt:video:NTdYSB5MRng",
  "yt:videoId": "NTdYSB5MRng",
  "yt:channelId": "UCv0aU2eKry3kdSTnFa8QAWA",
  "title": "How lizards balance keeping their tails on and peeling them off",
  "link": "",
  "author": {
    "name": "Science Magazine",
    "uri": "https://www.youtube.com/channel/UCv0aU2eKry3kdSTnFa8QAWA"
  },
  "published": "2022-02-17T19:01:43+00:00",
  "updated": "2022-08-19T15:40:16+00:00",
  "media:group": {
    "media:title": "How lizards balance keeping their tails on and peeling them off",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "To get out of sticky situations, some lizards detach their tails from their bodies and scurry away. Scientists have long wondered how the bones and muscles in these tails—which help with balance and movement—can sever with ease when needed, but stay firmly in place when not.\n\nPrevious studies showed the vertebrae in a lizard’s tail are ringed by muscles that fit together like plugs and sockets, with each conical “plug” covered in microscopic bumps. In a new study, researchers zoomed in on the sockets with a scanning electron microscope. They thought they would find concave notches for the bumps to fit in to—like fingers in a glove. Instead, they found only small indents—hardly the secure lock-and-release mechanism they were expecting.\n\nBut they also found that the top of each bump was dotted with holes called nanopores. To see if they played a role in the detachment, the researchers made model tails out of glass, either with or without silicone patches dotted with nanopore-like grooves. The fake tails with nanopore patches were the toughest to pry apart. Small cracks created by the pores allowed the “tail” to move flexibly without cleaving off at the wrong moment.\n\nSo how do the lizards activate their escape mechanism when needed? It all depends on how they bend and yank their tails, the researchers report today in Science. They filmed real lizards’ tails with high-speed video (above), and found that when the lizards want to detach, they bend their tails at a side angle rather than by yanking straight back. The researchers tested the motion with their silicone models, and found the patches were much easier to peel off like a sticker than to pull off like a plug. But no need to worry—most missing appendages grow back, though in the form of a cartilage “stump,” in a matter of weeks.\n\nRead the research: https://www.science.org/doi/10.1126/science.abh1614",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}