{
  "title": "How This Startup Cut Production Costs of Millimeter Wave Power Amplifiers",
  "link": "https://spectrum.ieee.org/millimeter-wave-power-amplifier-startup",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/group-of-people-standing-outside-under-a-tree-smiling-at-camera.jpg?id=32001512&width=1200&height=800&coordinates=0%2C0%2C0%2C209\"/><br/><br/><p><a href=\"https://elvespeed.com/founder\" rel=\"noopener noreferrer\" target=\"_blank\">Diana Gamzina</a> is on a mission to drastically reduce the price of millimeter-wave power amplifiers. The vacuum-electronics devices are used for communication with distant space probes and for other applications that need the highest data rates available.</p><p>The amplifiers can cost as much as US $1 million apiece because they’re made using costly, high-precision manufacturing and manual assembly. Gamzina’s startup,<a href=\"https://elvespeed.com/\" rel=\"noopener noreferrer\" target=\"_blank\"> Elve</a>, is using advanced materials and new manufacturing technologies to lower the unit price.</p><hr/><p>It can take up to a year to produce one of the amplifiers using conventional manufacturing processes, but Elve is already making about one per week, Gamzina says. Elve’s process enables sales at about 10 percent of the usual price, making large-volume markets more accessible.</p><p>Launched in June 2020, the startup produces affordable systems for wireless connections that deliver optical fiber quality, or what Gamzina calls <em>elvespeed </em><em>connectivity</em>. The company’s name, she says, refers to atmospheric emission of light and very low frequency perturbations due to electromagnetic pulse sources. Elves can be seen as a flat ring glowing in Earth’s upper atmosphere. They appear for just a few milliseconds and can grow to be up to 320 kilometers wide.</p><p>Based in Davis, Calif., Elve employs 12 people as well as a handful of consultants and advisors.</p><p>For her work with amplifiers, Gamzina, an IEEE senior member, was recognized with this year’s<a href=\"https://vacuumelectronics.org/veysaward.html\" rel=\"noopener noreferrer\" target=\"_blank\"> Vacuum Electronics Young Scientist Award</a> from the<a href=\"https://eds.ieee.org/\" rel=\"noopener noreferrer\" target=\"_blank\"> IEEE Electron Devices Society</a>. She received the award in April at the<a href=\"https://www.ieeeivec.org/index.html\" rel=\"noopener noreferrer\" target=\"_blank\"> IEEE International Vacuum Electronics Conference</a>, in Monterey, Calif.</p><p>“Dr. Gamzina’s innovation and contributions to the industry are remarkable,” IEEE Member <a href=\"https://ieeexplore.ieee.org/author/37272687400\" target=\"_blank\">Jack Tucek</a>, general chair of the conference, said in a<a href=\"https://www.businesswire.com/news/home/20220510005453/en/Elve-CEO-Recognized-with-IEEE-Vacuum-Electronics-Young-Scientist-Award\" rel=\"noopener noreferrer\" target=\"_blank\"> news release</a> about the award.</p><h2>Interactions between millimeter-wave signals and electrons</h2><p>In addition to running her company, Ganzima works as a staff scientist at the <a href=\"https://www6.slac.stanford.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">SLAC National Accelerator Laboratory</a>, in Menlo Park, Calif.—a U.S. <a href=\"https://www.energy.gov/national-laboratories\" rel=\"noopener noreferrer\" target=\"_blank\">Department of Energy national lab</a> operated by Stanford University. It was in this role that she began speaking to industry representatives about how to expand the market for high-performance millimeter-wave amplifiers.</p><p>From those discussions, she found that lowering the price was key.</p><p>“Customers are paying between $250,000 and $1 million for each individual device,” she says. “When you hear these numbers, you realize why people don’t think this price is anywhere close to affordable for growing the market.”</p><p>Elve’s millimeter-wave power amplifier system weighs 4 kilograms, measures 23 centimeters by 15 cm by 8 cm, and is powered by a 28-volt DC input bus. The heart of the amplifier system is a set of traveling-wave tubes. TWTs are a subset of vacuum electronics that can amplify electromagnetic signals by more than a hundredfold over a wide bandwidth of frequencies. They’re commonly used for communications and radar imaging applications, Gamzina says.</p><p class=\"pull-quote\">“Our ultimate goal is to be part of the terrestrial market such that the amplifiers are installed on cellphone towers, enabling high-data-rate communication in remote and rural locations all over the world.”</p><p>The TWT takes a millimeter-wave signal and makes it “interact with a high-energy electron beam so that the signal steals the energy from the electron beam. That’s how it gets amplified,” Gamzina says. “In some ways, it’s a simple concept, but it requires excellence in RF design, manufacturing, vacuum science, electron emission, and thermal management to make it all work.”</p><p>Elve’s millimeter-wave amplifiers enable communication with satellite networks and create long-distance ground-to-ground links.</p><p>“This allows enormous amounts of data to be sent, leading to higher data rates that are comparable to fiber or laser-type communication devices,” Gamzina says. “Another advantage is that the amplifier can operate in most inclement weather.”</p><p>The initial market for Elve’s amplifiers is the communications field, she says, especially for backhaul: the connections between base stations and the core network infrastructure.</p><p>“Our ultimate goal is to be part of the terrestrial market such that the amplifiers are installed on cellphone towers,” Gamzina says, “enabling high-data-rate communication in remote and rural locations all over the world.”</p><p>The company plans to develop millimeter-wave amplifiers for imaging and radar applications as well.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"a red device on a white background\" class=\"rm-shortcode\" data-rm-shortcode-id=\"2636656805d5139450a4e44b2384684e\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"40950\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-red-device-on-a-white-background.jpg?id=32001526&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Elve’s power amplifier containers house a traveling-wave tube, electronic power conditioner, and a cooling system.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Elve</small></p><h2>Building on research done at the SLAC Lab</h2><p>Gamzina’s work at Elve is related to research she is conducting at the SLAC lab as well as previous work she did as a development engineer with the millimeter-wave research group at the<a href=\"https://www.ucdavis.edu/\" rel=\"noopener noreferrer\" target=\"_blank\"> University of California, Davis</a>. There she studied vacuum devices that operate at terahertz frequencies for use as power sources in particle accelerators, broadcast transmitters, industrial heating, radar systems, and communication satellites. She also led research programs in additive manufacturing techniques. She holds three U.S. patents related to the manufacture of vacuum-electronics devices.</p><p>To learn how to launch a startup, she took a class at<a href=\"https://www.stanford.edu/\" rel=\"noopener noreferrer\" target=\"_blank\"> Stanford</a> on the subject and she attended a 10-week training course for founders offered by <a href=\"https://4thly.com/\" rel=\"noopener noreferrer\" target=\"_blank\">4thly</a>, a global startup accelerator. She also says she learned a few things as a youngster while helping out at her father’s hydraulic equipment manufacturing company.</p><p>Raising funds to keep one’s business afloat is difficult for many startups, but it wasn’t the case for Elve, Gamzina says.</p><p>“We have good market traction, a good product, and a good team,” she says. “There’s been a lot of interest in what we’re doing.”</p><p>What has been a concern, she says, is that the company is growing so rapidly, it might be difficult to scale up production.</p><p>“Making hundreds or thousands of these has been a challenge to even comprehend,” she says. “But we are ready to go from the state we’re in to the next big jump.”</p>",
  "pubDate": "Thu, 27 Oct 2022 18:00:01 +0000",
  "guid": "https://spectrum.ieee.org/millimeter-wave-power-amplifier-startup",
  "category": [
    "Ieee member news",
    "Telecommunications",
    "Career",
    "Startups",
    "Communications",
    "Vacuum electronics",
    "Millimeter wave power amplifiers",
    "Type:ti"
  ],
  "dc:creator": "Kathy Pretz",
  "media:content": ""
}