{
  "id": "yt:video:G4vpDhBUuPk",
  "yt:videoId": "G4vpDhBUuPk",
  "yt:channelId": "UCbzRzJNHx7ZLlJML9BjZQVQ",
  "title": "🔋 Vasiliy Lomachenko turned up the dials. #LomaOrtiz #shorts",
  "link": "",
  "author": {
    "name": "Top Rank Boxing",
    "uri": "https://www.youtube.com/channel/UCbzRzJNHx7ZLlJML9BjZQVQ"
  },
  "published": "2022-10-30T05:45:01+00:00",
  "updated": "2022-10-31T09:06:37+00:00",
  "media:group": {
    "media:title": "🔋 Vasiliy Lomachenko turned up the dials. #LomaOrtiz #shorts",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "In this short, watch the #highlights from the main event of #lomaortiz featuring and #vasiliylomachenko and Jamaine Ortiz. In the a classic fight of the year #loma poured it on late to beat Ortiz and set up a possible fight with Devin Haney.\n\nNext up for Top Rank Boxing, Boxing’s most avoided world champion finally has a dance partner.\n \nWBO middleweight world champion Janibek “Qazaq Style” Alimkhanuly, a southpaw power puncher from Kazakhstan, will make the first defense of his title against two-time British champion Denzel Bentley on Saturday, Nov. 12 at Pearl Concert Theater at Palms Casino Resort in Las Vegas.\n \nIn the co-feature, undefeated pound-for-pound queen Seniesa “Super Bad” Estrada will defend her WBA minimumweight world title against Jazmin Gala Villarino.\n \nJanibek-Bentley, Estrada-Villarino, and undercard bouts will stream live and exclusively in the U.S. on ESPN+.\n\nPromoted by Top Rank, in association with Frank Warren’s Queensberry Promotions, tickets starting at $25 go on sale Friday, Oct 7 at 12 p.m. PT and can be purchased at Ticketmaster.com.\n\nTry ESPN+ For Free: https://watch.espnplus.com/toprank/\n\nSubscribe to our YouTube channel to get notified about the latest highlights, free full fights, and fight week content as it's posted.\n\nFollow Top Rank on Twitter: http://www.twitter.com/trboxing\nFollow Top Rank on Instagram: http://www.instagram.com/toprank\nLike Top Rank on Facebook: http://www.facebook.com/trboxing",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}