{
  "title": "157: How to Have an Infinite Mindset with Simon Sinek",
  "pubDate": "Mon, 23 Dec 2019 17:36:23 +0000",
  "guid": "74a9ae52-4e36-4e1d-97a2-90a80c424a32",
  "link": "https://sites.libsyn.com/94610/157-how-to-have-an-infinite-mindset-with-simon-sinek",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">How do you live with an infinite mind?</span></p> <p><span style=\"font-weight: 400;\">Today’s guest and a dear friend, Simon Sinek, is</span> <span style=\"font-weight: 400;\">an unshakable optimist who believes in a bright future and our ability to build it together. A bestselling author, Simon has recently written a new book,</span> <a href= \"https://simonsinek.com/product/the-infinite-game/\"><span style= \"font-weight: 400;\">The Infinite Game</span></a><span style= \"font-weight: 400;\">. Described as “a visionary thinker with a rare intellect,” Simon is also a speaker and business leader.</span> <span style=\"font-weight: 400;\">On today’s show, he’ll be drawing on his experience teaching leaders and organizations how to inspire people to explain how learning to apply an infinite mindset will change our careers and lives.</span></p> <p><span style=\"font-weight: 400;\">In today’s conversation, we’ll explain the difference between a finite and infinite game, and how choosing an infinite mindset will change your working life. Simon will tell us about the journey that led him to write his bestselling books, explain why an infinite mindset will lead to better results in your career, and tell us about visionary thinkers who had an infinite mindset.   We’ll leave you with some quick tips on how you can learn to apply an infinite mindset in your everyday life.</span></p> <p class=\"p1\">** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. **</p> <p class=\"p1\"> </p>",
  "content:encoded": "<p>How do you live with an infinite mind?</p> <p>Today’s guest and a dear friend, Simon Sinek, is an unshakable optimist who believes in a bright future and our ability to build it together. A bestselling author, Simon has recently written a new book, <a href= \"https://simonsinek.com/product/the-infinite-game/\">The Infinite Game</a>. Described as “a visionary thinker with a rare intellect,” Simon is also a speaker and business leader. On today’s show, he’ll be drawing on his experience teaching leaders and organizations how to inspire people to explain how learning to apply an infinite mindset will change our careers and lives.</p> <p>In today’s conversation, we’ll explain the difference between a finite and infinite game, and how choosing an infinite mindset will change your working life. Simon will tell us about the journey that led him to write his bestselling books, explain why an infinite mindset will lead to better results in your career, and tell us about visionary thinkers who had an infinite mindset.   We’ll leave you with some quick tips on how you can learn to apply an infinite mindset in your everyday life.</p> <p class=\"p1\">** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. **</p> <p class=\"p1\"> </p>",
  "enclosure": "",
  "itunes:duration": "19:35",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "How do you live with an infinite mind? Today’s guest and a dear friend, Simon Sinek, is an unshakable optimist who believes in a bright future and our ability to build it together. A bestselling author, Simon has recently written a new book, ....",
  "itunes:episodeType": "full"
}