{
  "title": "230: Adrienne (The Murder of Adrienne Shelly)",
  "link": "https://audioboom.com/posts/8047577",
  "itunes:episode": 230,
  "itunes:title": "Adrienne (The Murder of Adrienne Shelly)",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3329,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Adrienne Shelly was a writer and actress best known for writing and co-starring the film <em>Waitress</em>, which was later turned into a Broadway musical. But on the evening of November 1st, 2006 she was fond dead--hanging in the bathroom of her West Village, NYC office. The initial assumption by investigators was suicide, but her husband Andy didn't believe it and pushed the cops to work the case like a murder. Ultimately Andy was right, and the killer was found. But why did he do it? This documentary examines both the murder and the extraordinary life of the woman who was killed. <br>\n<br>\n<a href=\"https://www.truecrimeobsessed.com/see-us-live\">COME SEE US ON TOUR</a>!! In May we're hitting Chicago, Boston, Seattle, and Los Angeles!<br>\nWe're covering \"CLASS ACTION PARK.\" You know you want to see us do that one LIVE AND IN-PERSON! <a href=\"https://www.truecrimeobsessed.com/see-us-live\">GET YOUR TICKETS HERE!!! </a><br>\n<br>\n<a href=\"https://www.indiegogo.com/projects/obsessed-fest-2022#/\">COME TO OBSESSED FEST!!</a> It's the first-ever OBSESSED NETWORK FAMILY WEEKEND! It's going to be a weekend full of live shows--OWD Friday night, TCO Saturday night (and two non-Obsessed Network live shows as well!), meet & greets, KARAOKE!, meetups, panel chats AND. ONE. INSANE. DRAG. BRUNCH!!! It's all happening at the Hyatt Regency in Columbus, Ohio from September 30 - October 2nd. <a href=\"https://www.indiegogo.com/projects/obsessed-fest-2022#/\">TICKETS ARE ALMOST GONE!! GET YOUR TICKET HERE!!</a><br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 200 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"LuLaRich\"</strong> <strong>\"John Wayne Gacy: Devil in Disguise\" </strong>\"<strong>Night Stalker</strong>\" <strong>\"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>  </div>\n<div>\n<a href=\"https://audioboom.com/posts/8039739-times-square-killer-part-2/edit\">Update Description<br>\n</a><br>\n\n</div>\n<div>\n<br>\n<br>\n\n</div>\n",
  "pubDate": "Tue, 15 Mar 2022 11:15:14 +0000",
  "guid": "tag:audioboom.com,2022-03-15:/posts/8047577",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}