{
  "id": "yt:video:a1ssL4HcoNc",
  "yt:videoId": "a1ssL4HcoNc",
  "yt:channelId": "UCmh7afBz-uWwOSSNTqUBAhg",
  "title": "This Billionaire Overcame Bankruptcy to Become Boston’s Second Richest Entrepreneur | Forbes",
  "link": "",
  "author": {
    "name": "Forbes",
    "uri": "https://www.youtube.com/channel/UCmh7afBz-uWwOSSNTqUBAhg"
  },
  "published": "2022-11-01T12:30:00+00:00",
  "updated": "2022-11-01T12:30:00+00:00",
  "media:group": {
    "media:title": "This Billionaire Overcame Bankruptcy to Become Boston’s Second Richest Entrepreneur | Forbes",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Rob Hale, 56, likes routine. His typical workday includes nabbing the parking lot’s fifth spot (five is his lucky number), downing four extra-large decaf Dunkin’ coffees (two in the morning, two in the afternoon), overseeing a second group workout at noon (this one, mercifully, 20 minutes), then getting home in time for dinner with Karen, his wife of 28 years. “My life is very regimented,” Hale explains. “It doesn’t deviate much at all.”\n\nSuch discipline pays big dividends. Privately held Granite generated over $1.6 billion in sales last year and has no long-term debt. Twenty years after Hale’s first company collapsed, he boasts a $5 billion fortune from his estimated 70% stake in Granite and is one of America’s 400 wealthiest people for the second year running.\n\nHow did he do it? Forget about the blockchain, the metaverse or the cloud. The Bostonian built a 21st-century telecommunications empire on the back of 150-year-old technology: twisted-copper-wire telephone lines, or “plain old telephone service” (POTS, as it’s known in the industry). Granite, a telecom wholesaler, leases these old-fashioned lines from phone companies, then sells the service back to businesses at a premium.\n\nPOTS has one huge advantage over fiber-optic cables and wireless: unmatchable reliability. Unlike glass fiber, twisted copper can transmit electric power, meaning POTS keeps working even during a blackout. That makes it attractive for powering essentials such as fire alarms, security systems and emergency elevator phones. “Wall Street thinks they’re dead, but every retailer on the planet has a couple of POTS lines,” Hale says.\n\nGranite’s angle is to sell POTS to national retailers (Nike, CVS and PepsiCo are clients) whose IT chiefs want a single point of contact for their many phone lines in many different states. When a POTS line in Montana goes down, techies at CVS don’t have to chase after the local phone carrier to fix it; they call Granite, which does it for them.\n\n“Any national brand you can think of, they don’t want to deal with seven phone companies,” Hale explains. “They want to deal with one.”\n\nThat deceptively simple formula has worked for years. But now Granite faces an existential crisis: Hang up on landlines or get left behind.\n\nRead the full story on Forbes: https://www.forbes.com/sites/johnhyatt/2022/10/04/this-dot-com-crash-survivor-bet-on-100-year-old-landlines-now-hes-bostons-second-richest-entrepreneur/?sh=53e58a5529da\n\nSubscribe to FORBES: https://www.youtube.com/user/Forbes?sub_confirmation=1\n\nStay Connected\nForbes newsletters: https://newsletters.editorial.forbes.com\nForbes on Facebook: http://fb.com/forbes\nForbes Video on Twitter: http://www.twitter.com/forbes\nForbes Video on Instagram: http://instagram.com/forbes\nMore From Forbes:  http://forbes.com\n\nForbes covers the intersection of entrepreneurship, wealth, technology, business and lifestyle with a focus on people and success.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}