{
  "id": "yt:video:WHpqT2nDrfY",
  "yt:videoId": "WHpqT2nDrfY",
  "yt:channelId": "UCNhX3WQEkraW3VHPyup8jkQ",
  "title": "Turkish vs Azerbaijani (How SIMILAR are they?)",
  "link": "",
  "author": {
    "name": "Langfocus",
    "uri": "https://www.youtube.com/channel/UCNhX3WQEkraW3VHPyup8jkQ"
  },
  "published": "2021-12-18T14:56:31+00:00",
  "updated": "2022-06-11T05:48:22+00:00",
  "media:group": {
    "media:title": "Turkish vs Azerbaijani (How SIMILAR are they?)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "In this video I compare two closely related Turkic languages: Turkish and Azerbaijani. \n\n►Learn a language with native teachers online using italki: http://go.italki.com/1Ojye8x\n\nSpecial thanks to the following people:\n\nAbdullahzeki Ilgun - consultant and Turkish audio samples\nRza İsmayıl - Azerbaijani audio samples \n\n► Support the Langfocus channel on Patreon: https://patreon.com/langfocus. Current patrons include these special people:\n\nAmateurTextualCriticism, Andrew Doehler, Auguste Fields, Bennett Seacrist, Bill Walderman, Brian King, Bruce C, CFitz17, Chuck Davis, Colin Milner, Damaran Kos, Irina Bruce, Italy Made Easy, J Choi, Jacob Madsen, John Moffat, Karl-Erik Wångstedt, Kenny, Kirk Kirkpatrick, Michael Arbagi, Michael Cuomo, Michael J Synnott, Mody, Neil Sills, Nobbi Lampe-Strang, Paul Falstad, Rosalind Resnick, Ruben Sanchez Jr, ShadowCrossZero, Ulf Hermjakob, Victoria Goh, Vincent David, Walter Moore, Wolfgang Egon Schroder, Yuko Sunda, 19jks94, Abdullah Al-Kazaz, Adam Vanderpluym, \nAitona, Al Fung, Alana Kalinowski, Aleksei, Alen, Alex McKenzie, Ali Muhammed Alshehri, Alice, Amittai Aviram, Andrew Woods, Anthony Kinread, Anthony Peter Swallow, Aous Mansouri, Arnoud Hoorn, Ashley Dierolf, Avital Levant, Bartosz Czarnotta, Ben, Benjamin Tipton, Billy Billy, Brent Warner, Brian Begnoche, Bruce Stark, C Boudreau, chris brown, Chris Shifman, Christian Langreiter, \nChristopher Lowell, contumaciousCulimancer, Cyrus Shahrivar, Daniel Young, Darek, David Eggleston, David Golub, David LeCount, Dean Cary, Debbie, Diana Fulger, Diane Young, DickyBoa, \nDina Trageser, divad, Divadrax, Don Ross, Donald Tilley, Doug, Drew Gatewood, Edward Wilson, Elaine Salmon, Emilia Bruns, Eric Loewenthal, Eric Nutt, Fabio Martini, fatimahl, Fawad Quraishi, \nfrederick shiels, G Bot, Grace Wagner, Grégoire Le Corre, Guillaume Brodar, Gustavo Villegas, Henrik Flyvbjerg, Herr K, Hila Ghebrehiwot, Howard Clark, Hugh AULT, Ihor Khodzhaniiazov,\nIna Mwanda, James and Amanda Soderling, James Lillis, JAMES ORR, Jay Bernard, Jaye Ferrone, \nJens Aksel Takle, Jesús Horacio Báez Ávila, Jim McLaughlin, JL Bumgarner, Joe Dubya, Johannes, \nJohn E. McLaughlin, John Flanagan, John Gavin, John Hyaduck, John Lloyd, Josh Rotenberg, Julie Sriken, Kimball Pierce, kingvaeonic, Konrad, Konstantin Bredyuk, Krzysztof Dobrzanski, KW, Lance, Bedasie, Laura Morland, Lee Dedmon, Leo Barudi, Lincoln Hutton, Lissette Talledo, Louie dela, Fuente, Luke Jensen, m, maiku, Manuel Rosales, Margaret Langendorf, Margrét, Mark, Mark Bonneaux, Mark Judge, Mark Kemp, Markzipan , Martin Blackwell, Melanie Falk, Merrick Bobb, Merrick Bobb, MH, Michael Regal, Mike Frysinger, Mike Smigielski, Mohammed A. Abahussain,\nMário Pegado, Naama and Geoff Shang, Nicholas Gentry, Nick Michaels, Nicolas Elsishans, Niro, \nOleksandr Ivanov, Ondra, Oto Kohulák, Patrick smith, Patriot Nurse, Paul Flynn, Paul Shutler, Paulla Fetzek, Peter Andersson, Peter Nikitin, Peter Scollar, piero, Pudim de Cana, Raymond Thomas, Richard Kelly, Robert Brockway, Robert Williams, Roger Smith, Roland Seuhs, Ronald Brady, \nRyan Rubinstein, S. P., Sergio Pascalin, Sheila Perryman, Sierra Rooney, Sigbjørn Nerland, Simon Blanchet, sinastral, SJWS, Srga91, Stefan Reichenberger, Steven Severance, Suzanne Jacobs, \nTara Pride, Theophagous, Thomas Chapel, Thomas Gijsbers, Tim Hopmann, tommy dahill, Tony DeSantis, Tumble Bug, Ty Ovendale, Vinicius Marchezini, Vitor, W. Guillemets, Waltraud Seemann, \nWarren McKenzie, William MacKenzie, William O Beeman, Yagub Alserkal, Yeshar Hadi, Yuriy Vrublevskiy, Yuval Filmus, Zachary Root, zhangyimo, Éric Martin, Вайзефакнот, 洋平 木嶋\n\n●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●\n\nMap of the Ottoman Empire licensed from istock.com\n\n●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●\n\nThe following images are used under Creative Commons license:\n\nhttps://commons.wikimedia.org/wiki/File:Idioma_azer%C3%AD.png. Creative Commons Attribution-Share Alike 3.0 Unported license. Author: Fobos92.\n\nhttps://en.m.wikipedia.org/wiki/File:Ottoman_Turkish_in_Nastaliq.png. Creative Commons Attribution-Share Alike 4.0 International license. Author: ThatDohDude.\n\nhttps://commons.wikimedia.org/wiki/File:Person_reading_book_in_Ottoman_language.jpg.  Creative Commons Attribution-Share Alike 4.0 International license. Author: Vouliagmeni.\n\nhttps://commons.wikimedia.org/wiki/File:Seljuk_Empire_(greatest_extent).svg. Creative Commons Attribution-Share Alike 4.0 International license. Author: Ali Zifan.\n\nhttps://en.wikipedia.org/wiki/File:Common_Turkic_Languages_distribution_map.png. Creative Commons Attribution-Share Alike 4.0 International license. Author: GalaxMaps.\n\nhttps://commons.wikimedia.org/wiki/File:20141231_142414_Turkish_second_national_assembly.jpg. Creative Commons Attribution-Share Alike 4.0 International license. Author: Kafkasmurat.\n\n●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●\n\nOutro Music: \"Fly Forward\" licensed from Storyblocks.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}