{
  "title": "Google licenses content from news publishers under the EU Copyright Directive",
  "link": "https://blog.google/around-the-globe/google-europe/google-licenses-content-from-news-publishers-under-the-eu-copyright-directive/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"ng60t\">We are continuing our broad program of complying with Article 15 of the 2019 European Directive on Copyright in the Digital Single Market by striking licensing agreements with owners of press publications. Alongside these efforts, we’re constantly updating our products to help people find information by linking to news sites and other websites.</p><p data-block-key=\"5jvng\">Since my last message (see below), I am happy to say we’ve made more progress on our commitment to license press publisher content under the new law. We now have licensing agreements that cover more than 1,000 publications across eleven European countries, with many more discussions ongoing.</p><p data-block-key=\"b0s1n\">We also announced the recipients of the Google News Initiative’s <a href=\"https://blog.google/outreach-initiatives/google-news-initiative/celebrating-the-success-of-47-european-news-innovators/\">Innovation Challenge for Europe</a>. Forty seven recipients across 21 countries in Europe are now embarking on innovation projects ranging from audience engagement to community building. This demonstrates a new wave of news innovation in Europe that’s focused on building relationships with readers, listeners or viewers.</p><p data-block-key=\"b9pgs\">When I wrote that last message, below, we were testing a <a href=\"https://support.google.com/webmasters/answer/11317369\">new tool</a> in Germany and Hungary to help us reach press publishers. We explain how this works in the previous blog post below. We have since rolled it out in Romania, Estonia, Lithuania, Ireland and the Netherlands, with expansion to additional EU countries planned over the coming months.</p><p data-block-key=\"d2i89\">Our licensing program under the 2019 European Directive on Copyright in the Digital Single Market will eventually cover all countries that transpose the Directive, and considers variances in language, cross-border usage, and the needs of publishers large and small. We’re encouraged by the progress that’s already been made, but know that plenty of work remains to be done. And we’re motivated by our publisher partners who are innovating and growing, as we continue to play our part in building a thriving European news ecosystem.</p><p data-block-key=\"55n85\"></p><p data-block-key=\"1t5em\"><b><i>Previous post, published May 2022</i></b></p><p data-block-key=\"181a0\">For many years, Google has helped people find information by linking to news and other websites, and supported publishers and journalists through <a href=\"http://blog.google/supportingnews\">products, advertising technology and funding</a>. Over the past year, we have also launched a licensing programme called <a href=\"https://blog.google/products/news/google-news-showcase/\">Google News Showcase</a>, working with more than 750 publications across Europe.</p><p data-block-key=\"d19ic\">Alongside these efforts, we have been <a href=\"https://blog.google/around-the-globe/google-europe/googles-approach-to-europes-copyright-law/\">negotiating with news publishers</a> to license content under the European Copyright Directive, which EU countries are in the process of implementing into national law. So far, we have agreements that cover more than 300 national, local and specialist news publications in Germany, Hungary, France, Austria, the Netherlands and Ireland, with many more discussions ongoing.</p><p data-block-key=\"f4k7r\">We are now announcing the launch of a <a href=\"https://support.google.com/webmasters/answer/11317369\">new tool</a> to make offers to thousands more news publishers, starting in Germany and Hungary, and rolling out to other EU countries over the coming months.</p><h3 data-block-key=\"fh5n5\">How it works</h3><p data-block-key=\"1pbl0\">The Directive allows search engines like Google to freely link to, and use “very short extracts” of press publishers' content. The law also creates new rights for publishers when longer previews of their content are used online - but without defining what exactly a short extract or a longer preview is.</p><p data-block-key=\"1lbpr\">Despite this uncertainty, we announced last year that we will pay news publishers for <a href=\"https://blog.google/around-the-globe/google-europe/googles-approach-to-europes-copyright-law/\">content which goes beyond links and short extracts</a>, as we are already doing in <a href=\"https://blog.google/intl/de-de/unternehmen/engagement/web-tool-fuer-verlage-leistungsschutzrecht/\">countries such as Germany</a>.</p><p data-block-key=\"co97t\">Through this new tool, which will be available via <a href=\"https://support.google.com/webmasters/answer/11317369#using_search_console\">Search Console</a>, publishers will be offered an Extended News Preview (ENP) agreement with Google for this content. This will include information about what the offer is for, how to sign up and how to provide feedback.</p><p data-block-key=\"ej40s\">All offers are based on consistent criteria which respect the law and existing copyright guidance, including how often a news website is displayed and how much ad revenue is generated on pages that also display previews of news content.</p><p data-block-key=\"3kjf6\">As always, publishers continue to have <a href=\"https://developers.google.com/search/docs/advanced/robots/intro\">full control</a> over whether or not their content appears in Google Search and how that content can be previewed. Publishers can change their preferences and enroll in the ENP program at any time.</p><p data-block-key=\"7i7j3\">Alongside our negotiations, we will continue to invest in products and programs to provide even more support for journalism in Europe and around the world. We recently announced the <a href=\"https://blog.google/outreach-initiatives/google-news-initiative/innovation-challenge-europe/\">Innovation Challenge for Europe</a> and the <a href=\"https://www.inma.org/blogs/main/post.cfm/8-european-publishers-selected-for-google-news-initiative-subscriptions-academy-2022\">Google News Initiative Subscriptions Academy</a> which provides publishers with an intense 8-month program focused on digital growth. We look forward to working with publishers and journalists on all these efforts in the coming months, building on our long track record of <a href=\"http://blog.google/supportingnews\">support for journalism</a>.</p></div></div></body></html>",
  "pubDate": "Tue, 01 Nov 2022 08:00:00 +0000",
  "guid": "https://blog.google/around-the-globe/google-europe/google-licenses-content-from-news-publishers-under-the-eu-copyright-directive/",
  "category": "Google in Europe",
  "og": {
    "type": "article",
    "title": "Google licenses content from news publishers under the EU Copyright Directive",
    "description": "Google is licensing content under the copyright law in Europe",
    "site_name": "Google",
    "url": "https://blog.google/around-the-globe/google-europe/google-licenses-content-from-news-publishers-under-the-eu-copyright-directive/"
  },
  "author": {
    "name": "Sulina Connal",
    "title": "Managing Director, News and Publishing Partnerships",
    "department": "",
    "company": ""
  }
}