{
  "title": "Advertisers continue to flee Twitter as civil rights groups call for a boycott",
  "description": "<p>As Elon Musk looks for <a href=\"https://www.engadget.com/elon-musk-verification-twitter-blue-161532924.html\">new ways</a> to make money from Twitter’s he’s facing a much more urgent problem: advertisers are fleeing the platform. Musk said Friday that “Twitter has had a massive drop in revenue” due to advertisers’ concerns about content moderation and other issues raised by activists.</p><p>A number of major companies have paused ads in recent days, including <a href=\"https://www.engadget.com/gm-suspends-advertising-on-twitter-090026887.html\">GM</a>, Audi, Pfizer, General Mills, Volkswagen and other <a href=\"https://www.wsj.com/articles/general-mills-audi-and-pfizer-join-growing-list-of-companies-pausing-twitter-ads-11667507765\">big names</a> who are wary of potential changes to Twitter’s policies as well as the departure of top executives. Industry groups have also expressed concern about <a href=\"https://wfanet.org/knowledge/item/2022/10/31/GARM-calls-on-Twitter-to-uphold-existing-commitments-on-brand-safety-and-deepen-future-collaboration\">brand safety </a>under Musk, and <em>The New York Times </em><a href=\"https://www.nytimes.com/2022/11/01/technology/elon-musk-twitter-advertisers.html\">reported</a> this week that  “IPG, one of the world’s largest advertising companies, issued a recommendation … for clients to temporarily pause their spending on Twitter.”</p><span id=\"end-legacy-contents\"></span><p>On Friday, the NAACP joined other civil rights groups in calling for an <a href=\"https://www.stophateforprofit.org/statement-calling-on-advertisers\">advertiser boycott</a> of the platform. “It is immoral, dangerous, and highly destructive to our democracy for any advertiser to fund a platform that fuels hate speech, election denialism and conspiracy theories,” NAACP President Derrick Johnson said in a statement.</p><div id=\"77d784b7892549038b95c27a30dbb58b\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">It is immoral, dangerous, and highly destructive to our democracy for any advertiser to fund a platform that fuels hate speech, election denialism and conspiracy theories. Until actions are taken to make this a safe space, we call on companies to pause all advertising on Twitter.</p>— Derrick Johnson (@DerrickNAACP) <a href=\"https://twitter.com/DerrickNAACP/status/1588600470259789824?ref_src=twsrc%5Etfw\">November 4, 2022</a></blockquote></div><p>Advertisers' pullback amid calls for an ad boycott  show just how quickly Twitter’s ad business has deteriorated under Musk. It also comes barely a week after Musk tried <a href=\"https://www.engadget.com/elon-musk-advertisers-hellscape-172909516.html\">to reassure</a> the industry he didn’t want to turn the platform into a “free-for-all hellscape.” Twitter saw a <a href=\"https://www.engadget.com/elon-musk-twitter-takeover-has-already-emboldened-trolls-203418376.html\">significant spike</a> in hate speech and racial slurs immediately following the news of Musk’s take over of the company. Twitter’s head of safety later blamed the activity on <a href=\"https://www.engadget.com/twitter-coordinated-trolling-campaign-musk-takeover-184938884.html\">a coordinated</a> trolling campaign. But the activity further fueled the concerns of civil rights groups, prompting Musk to meet with civil rights leaders this week.</p><p>On Friday he seemed to  blame the drop in ad revenue on many of the same activists. “Twitter has had a massive drop in revenue, due to activist groups pressuring advertisers, even though nothing has changed with content moderation and we did everything we could to appease the activists,” he tweeted.</p><div id=\"3e4f8d59b0b94acb8f56dc115a6663eb\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Twitter has had a massive drop in revenue, due to activist groups pressuring advertisers, even though nothing has changed with content moderation and we did everything we could to appease the activists.<br><br>Extremely messed up! They’re trying to destroy free speech in America.</p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1588538640401018880?ref_src=twsrc%5Etfw\">November 4, 2022</a></blockquote></div><p>But a coalition of civil rights groups and activists rejected Musk’s characterization. During a call with reporters on Friday, they said that Musk’s <a href=\"https://www.engadget.com/twitter-layoffs-010148183.html\">mass layoffs</a> of Twitter staff, including people who work in moderation and safety, undermine <a href=\"https://twitter.com/elonmusk/status/1587668703834955778\">the commitments </a>he made following their meeting.</p><p>“When you lay off almost 50% of your staff, including teams that are in charge of actually tracking, monitoring and enforcing content moderation rules, that necessarily means that content moderation has changed,” said Jessica González, co-CEO of Free Press.</p><p>The group also raised concerns about Musk's amplification of far-right conspiracies regarding the attack on House Speaker Nancy Pelosi's husband; it also cited reports the now-CEO could <a href=\"https://www.bloomberg.com/news/articles/2022-11-01/musk-mulls-major-changes-to-twitter-and-hits-some-roadblocks\">chip away</a> at current Twitter rules protecting trans users. \"If Twitter does not take immediate concrete actions that illustrate a true commitment to maintaining best practices that protect users that companies then companies will not support with ad dollars and we're seeing it happen in real time,” said GLAAD CEO Sarah Ellis.</p>",
  "link": "https://www.engadget.com/twitter-losing-advertisers-boycott-193748977.html?src=rss",
  "source_id": "engadget_479",
  "guid": "6e8e708d-5b38-42ba-8d1a-d917d0885a30",
  "dc:creator": "Karissa Bell",
  "source": "Engadget",
  "dc:publisher": "Engadget",
  "dc:rightsHolder": "Engadget",
  "pubDate": "Fri, 04 Nov 2022 19:37:48 +0000",
  "ingested": 1667593287,
  "modified": "2022-11-04T20:21:31+00:00",
  "category": [
    "Politics & Government",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Karissa Bell"
  ],
  "media:content": [
    {
      "media:keywords": "headline",
      "media:media_html": "",
      "dc:identifier": 1,
      "media:credit": "",
      "media:description": "",
      "media:title": ""
    },
    {
      "media:media_html": "",
      "dc:identifier": 2,
      "media:credit": "Carlos Barria / reuters",
      "media:description": "A view of the Twitter logo at its corporate headquarters in San Francisco, California, U.S. October 27, 2022. REUTERS/Carlos Barria",
      "media:title": "TWITTER-M&A/MUSK"
    }
  ]
}