{
  "title": "Elon Musk threatens ‘thermonuclear name and shame’",
  "link": "https://www.rt.com/news/566018-twitter-owner-may-expose-boycotting-advertisers/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/566018-twitter-owner-may-expose-boycotting-advertisers/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6366b45885f54038525f5d48.jpg\" /> Twitter owner Elon Musk has warned that he may ‘name and shame’ advertisers that boycott Twitter under pressure from leftist groups <br/><a href=\"https://www.rt.com/news/566018-twitter-owner-may-expose-boycotting-advertisers/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The billionaire has warned that he may identify advertisers that boycott Twitter, enabling backers of free speech to punish them</strong></p>\n            \n                        \n            <p>Twitter owner Elon Musk has warned that he may identify advertisers that are boycotting his social media platform under pressure from leftist groups, a move that would likely trigger counter-boycotts as the billionaire&rsquo;s supporters push back against corporate America in defense of free speech.</p>\n<p><em>&ldquo;A thermonuclear name and shame is exactly what will happen if this continues,&rdquo;</em> Musk said on Friday night, referring to the sharp drop in revenue that he&rsquo;s seen at Twitter because activist groups are pressuring advertisers to stop using the platform.</p>\n<p>He made the comment in response to a Twitter post by former US Senate aide Mike Davis, who suggested that exposing the advertisers would enable Musk&rsquo;s 114 million followers on the platform to launch a counter-boycott.</p>\n<p>The Tesla CEO completed his $44 billion takeover of Twitter last week, vowing to restore freedom of speech in America by providing a <em>&ldquo;digital town square&rdquo;</em> where a wide range of beliefs can be freely debated. Dozens of left-wing activist groups responded by trying to persuade advertisers to stop doing business with Twitter, arguing that Musk would make it a <em>&ldquo;direct threat to public safety&rdquo;</em> by allowing <em>&ldquo;harmful&rdquo;</em> content. Some of the groups, such as Media Matters, are backed by activist billionaire George Soros.</p>\n\n            <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Thank you. <br><br>A thermonuclear name & shame is exactly what will happen if this continues.</p>&mdash; Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1588676939463946241?ref_src=twsrc%5Etfw\">November 4, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n    \n\n<p>Twitter relies on advertising for more than 90% of its revenue, though that may change under Musk, who has begun charging users $8 monthly to have <em>&ldquo;verified&rdquo;</em> status on their accounts.</p>\n\n            \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/news/565985-biden-musk-twitter-lies/\">\n            <span>READ MORE: </span>Biden lashes out at Twitter and Musk\n        </a>\n    </p>\n\n    \n\n<p>Musk, who ranks as the <a href=\"https://www.forbes.com/real-time-billionaires/#77d59dab3d78\" target=\"_blank\" rel=\"noopener noreferrer\">world&rsquo;s richest person</a> with a fortune estimated by Forbes at over $208 billion, said earlier on Friday that Twitter had suffered a <em>&ldquo;massive drop in revenue, due to activist groups pressuring advertisers, even though nothing has changed with content moderation. We did everything we could to appease the activists.&rdquo;</em> He added that the activists were <em>&ldquo;trying to destroy free speech in America.&rdquo;</em></p>\n\n            \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/business/565948-twitter-sued-workers-layoffs/\">\n            <span>READ MORE: </span>Ex-workers sue Twitter over layoffs\n        </a>\n    </p>\n\n    \n\n<p>Musk fired about half of Twitter&rsquo;s 7,500 employees to shore up the finances of a business that he claimed was operating at a loss before he took over. <em>&ldquo;Regarding Twitter&rsquo;s reduction in force, unfortunately, there is no choice when the company is losing over $4 million a day,&rdquo;</em> he said. Affected employees were offered three months of severance pay.</p>\n<p>&nbsp;</p>\n<p></p>",
  "enclosure": "",
  "pubDate": "Sat, 05 Nov 2022 19:16:49 +0000",
  "dc:creator": "RT"
}