{
  "id": "yt:video:KHlWu9PNh5M",
  "yt:videoId": "KHlWu9PNh5M",
  "yt:channelId": "UCG_nvdTLdijiAAuPKxtvBjA",
  "title": "The Secrets of Dumbledore — Death by Author | Anatomy Of A Failure",
  "link": "",
  "author": {
    "name": "Filmento",
    "uri": "https://www.youtube.com/channel/UCG_nvdTLdijiAAuPKxtvBjA"
  },
  "published": "2022-06-11T15:45:00+00:00",
  "updated": "2022-06-19T01:58:09+00:00",
  "media:group": {
    "media:title": "The Secrets of Dumbledore — Death by Author | Anatomy Of A Failure",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Get 20% off your first Bespoke Post box at https://bespokepost.com/filmento by using code FILMENTO at checkout. Thanks to Bespoke Post for sponsoring the video.\n\nFantastic Beasts: The Secrets of Dumbledore is another not-Harry Potter movie from Warner Brothers that is much like its predecessor The Crimes of Grindelwald: amazing to look at but boring to watch because of bad writing. And as before, most of the narrative faults come from JK Rowling doing the writing despite not being a screenwriter. She has had success with books but she keeps doing book things that do not work on screen. We talked about this in the last video \"Crimes of Grindewald — Death by Author\" but let's do it more. Here are a few more dangers to avoid when writing a film as a book author.\n\nSupport:     https://patreon.com/filmento\nFollow:       https://twitter.com/filmento\n\n\nMusic:\nhttps://youtu.be/m0o5OwN4ab0\n\n#FantasticBeasts #AnatomyOfAFailure #SecretsOfDumbledore\n\n\n\n-\nFantastic Beasts: The Secrets of Dumbledore\nWarner Bros. Pictures’ “Fantastic Beasts: The Secrets of Dumbledore” is the newest adventure in the Wizarding World created by J.K. Rowling. Professor Albus Dumbledore (Jude Law) knows the powerful Dark wizard Gellert Grindelwald (Mads Mikkelsen) is moving to seize control of the wizarding world.  Unable to stop him alone, he entrusts Magizoologist Newt Scamander (Eddie Redmayne) to lead an intrepid team of everything wrong with secrets of dumbledore honest trailer secrets of dumbledore ending explained after credits final fight dumbledore vs grindelwald fight secrets of dumbledore trailer official secrets of dumbledore full movie watch online free 4k clip hd best moments secrets of dumbledore fight scenes dungeon brother monster scene secrets of dumbledore bad movie box office flop great movie fantastic beasts 3 fantastic beasts 4 secrets of dumbledore funny moments mistakes movie dumbledore vs credence fight wizards, witches and one brave Muggle baker on a dangerous mission, where they encounter old and new beasts and clash with Grindelwald’s growing legion of followers.  But with the stakes so high, how long can Dumbledore remain on the sidelines?",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}