{
  "title": "How Hollywood Keeps Artificial Intelligence at a Distance",
  "link": "https://datamining.typepad.com/data_mining/2015/05/how-hollywood-keeps-artificial-intelligence-at-a-distance.html",
  "description": "When something doesn't exist (like artificial intelligence) it's easy to think that there is some missing piece of magic required to bring it in to existence. There has been a growing interest in movie depictions of AI of late, and...",
  "content:encoded": "<p>When something doesn&#39;t exist (like artificial intelligence) it&#39;s easy to think that there is some missing piece of magic required to bring it in to existence. There has been a growing interest in movie depictions of AI of late, and these all seem to require some sort of non-linear step to realize this technology.</p>\n<ul>\n<li><a href=\"http://en.wikipedia.org/wiki/Ex_Machina_(film)\" target=\"_self\">Ex Machina</a> (which I really enjoyed) required a new sort of hard/software in the form of a jelly like substance.</li>\n<li><a href=\"http://en.wikipedia.org/wiki/Chappie_(film)\" target=\"_self\">Chappie</a>&#0160;(which I also liked, though I generally prefer cheese and ham combined in a sandwich) required &#39;terabytes of coding&#39; and a good amount of luck to produce its AI.</li>\n<li><a href=\"http://en.wikipedia.org/wiki/Avengers:_Age_of_Ultron\" target=\"_self\">Age of Ultron</a> (a film about one liners and explosions) required a magic jewel from Loki&#39;s staff no less to create its AI.</li>\n<li><a href=\"http://en.wikipedia.org/wiki/Transcendence_(2014_film)\" target=\"_self\">Transcendence</a> (<a href=\"http://www.kurzweilai.net/\" target=\"_self\">Kurzweil</a> summarized) gives up on AI and simply loads a human brain into the ether.</li>\n</ul>\n<p>The message in all of these movies is - the reason we don&#39;t have AI is that we haven&#39;t taken some non-linear step.</p>",
  "dc:subject": "AI",
  "dc:creator": "Matthew Hurst",
  "dc:date": "2015-05-03T23:40:48-04:00"
}