{
  "title": "Rethinking Executive Incentives Can Boost ESG Performance",
  "link": "https://sloanreview.mit.edu/article/rethinking-executive-incentives-can-boost-esg-performance/",
  "comments": "https://sloanreview.mit.edu/article/rethinking-executive-incentives-can-boost-esg-performance/#respond",
  "pubDate": "Tue, 25 Oct 2022 11:00:30 +0000",
  "dc:creator": "Martin Skladany. <p>Martin Skladany is the Samuel Weiss Faculty Scholar and a professor of intellectual property, law and technology, and law and international development at Pennsylvania State University.</p>\n",
  "category": [
    "Chief Executive Officer",
    "Compensation",
    "Stakeholder Management",
    "Corporate Social Responsibility",
    "Equality",
    "Leadership",
    "Social Responsibility"
  ],
  "description": "Anytime the economy hits a downturn, it’s a familiar story: Companies cut expenses through layoffs, and top executives get bonuses for keeping stock prices up. Today, this arguably hurts employees more than it used to. Even before the pandemic, 17% of adults could not pay their bills, and 24% skipped medical care because they didn’t [&#8230;]",
  "content:encoded": "<p></p>\n<figure class=\"article-inline\">\n<img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/10/2022_1025_Skladany-1290X860.jpg\" alt=\"\" /><br />\n</figure>\n<p>Anytime the economy hits a downturn, it’s a familiar story: Companies cut expenses through layoffs, and top executives get bonuses for keeping stock prices up. Today, this arguably hurts employees more than it used to. Even before the pandemic, 17% of adults <a href=\"https://www.federalreserve.gov/publications/2019-economic-well-being-of-us-households-in-2018-dealing-with-unexpected-expenses.htm\">could not pay their bills</a>, and 24% skipped medical care because they didn’t have the money. And given the bruising, consistent rise in income inequality, the average employee <a href=\"https://www.cnbc.com/2022/09/30/stubborn-inflation-forces-more-americans-to-live-paycheck-to-paycheck-.html\">lives paycheck to paycheck</a>.</p>\n<p>Meanwhile, in 2021 the average <a href=\"https://aflcio.org/paywatch\">ratio of CEO pay to worker pay</a> among S&P 500 companies was 324-to-1, and during the pandemic, 20 CEOs furloughed workers while maintaining a CEO-to-worker pay ratio <a href=\"https://aflcio.org/press/releases/sp-500-ceos-received-average-148-million-total-compensation-2019\">greater than 1,000-to-1</a>. Their collective total compensation could have covered the wages of over 30,000 of their employees. Yet this has become standard practice: CEOs have used the actions of fellow executives as cover to pay themselves obscene amounts, reduce employee benefits, and send jobs offshore.</p>\n<p></p>\n<p>Nonetheless, some companies are already trying to do better by their workers. Early in the pandemic, from March to May 2020, 259 U.S. companies <a href=\"https://news.bloomberglaw.com/bloomberg-law-analysis/analysis-s-p-500-buyback-suspensions-dropped-to-zero-in-june?context=article-related\">suspended share buyback programs</a>. Costco raised its minimum wage from $15 to $16 an hour and further <a href=\"https://edition.cnn.com/2021/10/27/business/costco-minimum-wage/index.html\">upped it to $17 in 2021</a>. Target, CVS Health, Walgreens, and others also <a href=\"https://www.forbes.com/advisor/personal-finance/companies-paying-15-an-hour/\">increased minimum wages</a>. Yet more tools are needed to guide and motivate the vast majority of CEOs to decisively protect employees during future crises. </p>\n<p>The existing incentive structure for executives rewards them when things go right without motivating them to minimize the chance that things will go wrong. A new federal <a href=\"https://www.federalregister.gov/documents/2022/09/08/2022-18771/pay-versus-performance\">pay-versus-performance rule</a> that went into effect Oct. 11 begins to address this by mandating that companies provide details on executive renumeration and financial performance from the past five years. Companies also have to disclose the performance measures that are linked to leaders’ compensation. Yet the new rule does not tie executive pay to employee wages in downturns. </p>\n<h3>Rethinking Executive Incentives With Parity Pills</h3>\n<p>A <a href=\"https://slate.com/business/2020/09/parity-pills-ceos-pay-cuts-layoffs-coronavirus-recession.html\"><em>parity pill</em></a> — a term of my own — is a clause in a company’s governing documents that would automatically redistribute executives’ pay in the event of a business downturn, to avert layoffs or augment the salaries of the lowest-paid workers. Parity pills would allow CEOs to keep the spoils they are accustomed to in good times but ensure that they share gains during bad times, too. </p>\n<p>Changing their incentive structures to incorporate parity pills is a single step that companies could take to operate more ethically in the long run. Of necessity, doing so would also save companies from the throes of short-term thinking and emergency decision-making, which may propel larger long-term profits. Parity pills could more virtuously align the interests of workers and leaders in a way that strengthens the company while it makes good on its commitment to stakeholder capitalism. </p>\n<p></p>\n<p>Parity pills were inspired by poison pills, which aim to shield businesses from other corporations’ CEOs by blocking takeovers, whereas parity pills would protect workers from their own bosses. Similar to the proposed <a href=\"https://www.nytimes.com/2011/12/19/opinion/dont-tax-the-rich-tax-inequality-itself.html\">Brandeis tax</a>, which would increase the highest marginal income tax bracket if income inequality exceeded a certain level nationally, parity pills aim to reduce inequality at a time of crisis. They would do so by creating a set of sticks when executives’ actions create financial pain for the company to parallel executives’ existing carrots of stock options and bonuses. </p>\n<p></p>\n<h3>Putting Parity Pills Into Practice</h3>\n<p>Parity pills are a mechanism designed to be triggered by a set of conditions — external shocks like pandemics and recessions, or internal factors like revenue declines or pay inequality exceeding a predetermined amount. Each company must customize its own triggering conditions and the details of its parity plan. The board or CEO could determine how many executives (or board members, if paid) would be asked to sacrifice compensation and by how much. Alternatively, leadership could set a minimum floor for redistribution, allowing executives the choice to forgo even more if they wish. </p>\n<p>When such a pill was triggered, workers would benefit; parity pills could prevent layoffs and the elimination of employee benefits, such as matching retirement contributions. Parity pill proceeds could be used to strengthen <a href=\"https://hbr.org/2020/05/employee-hardship-funds-help-companies-help-their-people\">employee hardship funds</a>. Most ambitiously, parity pills could be the mirror image of executive bonuses in good times; that is, the lowest-paid workers could see their salaries increase when times get tough. </p>\n<p>For parity pills to effectively lower total executive compensation, they must be tailored to each company’s particular compensation structure. Most importantly, companies should consider the ways in which executives are likely to benefit during a downturn. </p>\n<p>A small minority of executives took a pay cut during the pandemic; for those who have, the reduction has overwhelmingly been <em>only</em> to their base salary — which amounts to a minor sacrifice. (For example, two-thirds of <a href=\"https://www.nytimes.com/2020/07/29/business/economy/ceo-pay-pandemic-layoffs.html\">CEOs who took a pay cut</a> in 2020 had their overall pay lowered by 10% or less compared with their 2019 total compensation.) A small group of companies has instead deferred a portion of executive compensation or <a href=\"https://corpgov.law.harvard.edu/2020/08/21/the-pandemic-and-executive-pay/\">paid executive salaries</a> in restricted stock units — options that could result in sizable future payouts.  </p>\n<p>To be clear, many executives’ annual bonuses would disappear in a downturn if a parity pill were in place, though parity pills could still apply to their base pay, reduce future payouts, or even require them to return past compensation. Plus, many CEOs still receive their cash bonuses and stock options during recessions. </p>\n<p>Parity pills should explicitly forbid bonus payouts in the case of company bankruptcy, especially when employee pensions are at risk. From March to October 2020, at least 18 major companies distributed executive bonuses that totaled more than $135 million <a href=\"https://www.washingtonpost.com/business/2020/10/26/chapter-11-bankruptcy-executive-bonuses/?arc404=true\">before entering bankruptcy</a> with a collective $79 billion in debt. The traditional argument for such payouts is to retain skilled leadership during bankruptcy proceedings, but these bonuses often go to the executives who sank the ship. Beyond the inequity of rewarding executive failure while simultaneously cutting the benefits and jobs of employees, there is the question of why a board would entrust executives to get out of their own mess. Implementing a parity pill would still leave open the possibility of appropriately compensating new leadership brought in to successfully steer the company out of bankruptcy. </p>\n<h3>Unexpected Benefits of Parity Pills</h3>\n<p>While the advantages to workers are clear, why would CEOs, board members, and shareholders — who would be the ones to design and implement these clauses — choose to do so? Because, perhaps counterintuitively, it’s in their self-interest. </p>\n<p><strong>Clear costs for risky decisions.</strong> Parity pills incentivize leaders to prevent foreseeable crises. By redistributing executive compensation to workers, parity pills impose a price on risky activity in which executives benefit if the plans succeed but workers pay if they fail. The known risk of income loss can drive executives to focus on long-term value over short-term profit. </p>\n<p>Such an equitable financial policy can also improve recruitment of future executives that are more likely to prioritize the long-term vision of the organization and not be driven by short-term, personal gains. This is because <a href=\"https://journals.sagepub.com/doi/abs/10.1177/1059601120905728\">dark triad executives</a> — whose narcissism, psychopathy, and Machiavellianism can harm organizations — would likely be turned off from ever seeking employment at companies with parity pills in place. </p>\n<p><strong>Reputational advantages.</strong> Implementing and publicizing a company's positive social policies can drive the loyalty of socially conscious consumers. For example, Unilever’s “<a href=\"https://www.campaignlive.co.uk/article/unilever-says-brands-purpose-growing-twice-speed-others-portfolio/1345772?src_site=marketingmagazine\">sustainable living brands</a>,” such as Dove and Ben & Jerry’s, are growing at twice the pace as its other brands. </p>\n<p></p>\n<p>Parity pills and labor-friendly policies can also improve employee morale and sense of equity, further enhancing the company’s ability to attract candidates. Employee satisfaction leads to <a href=\"https://fortune.com/2018/02/27/the-best-companies-to-work-for-are-beating-the-market/\">stronger financial performance</a>, as the example of Patagonia shows. The company boasts a 4% turnover rate, due in part to worker-friendly benefits like onsite child care and perks that align with its emphasis on sustainability. Patagonia has even offered to <a href=\"https://www.inc.com/scott-mautz/how-can-patagonia-have-only-4-percent-worker-turnover-hint-they-pay-activist-employees-bail.html\">pay workers’ legal fees</a> if they’re arrested for peaceful environmental protest. </p>\n<p>To be clear, this competitive advantage based on reputation can increase company financial returns and executive compensation tied to such performance criteria. Similarly, CEOs who voluntarily implemented a parity pill could benefit from a reputational boost, whether or not the pill ever impacted them personally. </p>\n<p>Parity pills offer board members a tangible response to the <a href=\"https://corpgov.law.harvard.edu/2020/01/24/shareholder-activism-in-2020-new-risks-and-opportunities-for-boards/\">social justice issues</a> that are high on many shareholders’ agendas. This could also benefit them financially. During crises, companies with <a href=\"https://www.issuelab.org/resources/22448/22448.pdf\">strong corporate responsibility reputations</a> do not see meaningful share price declines, while those with poor reputations for corporate responsibility were found to decline by 2.4% to 3%, an average $378 million market capitalization loss per company. </p>\n<p></p>\n<p>Meanwhile, CEOs and boards uninterested in parity pills could see them thrust upon them by shareholder resolutions, given the fact that asset managers and pension trustees make decisions for millions of investors. This has become increasingly relevant; for example, as <a href=\"https://www.economist.com/leaders/2022/04/23/the-push-for-shareholder-democracy-should-be-accelerated\"><cite>The Economist</cite> reported</a>, BlackRock, State Street, and Vanguard “together own over a fifth of the average company in the S&P 500, but wield even greater clout, because only 30% of retail investors bother to vote their shares.”</p>\n<p>Finally, parity pills would aid activists and unions because they provide a mechanism to retain their members’ jobs during downturns. Parity pills are a practical, clear demand of leadership that does not already have such pills in place. </p>\n<p>CEOs no longer have the excuse that their obligations to shareholders require them to implement fiscal austerity in downturns, at a time when their lofty compensation is increasingly being called into question. Parity pills are a concrete tool that could enable companies to privately spread the pain of future crises while increasing the financial or reputational interests of all those involved. </p>\n<p></p>\n",
  "wfw:commentRss": "https://sloanreview.mit.edu/article/rethinking-executive-incentives-can-boost-esg-performance/feed/",
  "slash:comments": 0
}