{
  "title": "Gaining a sense of control over the COVID-19 pandemic | A Winner’s Interview with Daniel Wolffram",
  "link": "https://medium.com/kaggle-blog/gaining-a-sense-of-control-over-the-covid-19-pandemic-a-winners-interview-with-daniel-wolffram-1320fb2717c4?source=rss----4b0982ce16a3---4",
  "guid": "https://medium.com/p/1320fb2717c4",
  "category": [
    "data-science",
    "kaggle",
    "covid19",
    "machine-learning",
    "kaggle-competition"
  ],
  "dc:creator": "Kaggle Team",
  "pubDate": "Thu, 23 Jul 2020 15:11:33 GMT",
  "atom:updated": "2020-07-23T15:11:33.423Z",
  "content:encoded": "<p>How one Kaggler took top marks across multiple Covid-related challenges.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*R0Q-WzdtzvK5Q64I-_yqdA.jpeg\" /><figcaption>Photo by <a href=\"https://unsplash.com/@markusspiske?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Markus Spiske</a> on <a href=\"https://unsplash.com/s/photos/coronavirus?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Unsplash</a></figcaption></figure><p><em>Today we interview Daniel, whose notebooks earned him top marks in Kaggle’s CORD-19 challenges. Kaggle hosted multiple challenges that worked with the Kaggle CORD-19 dataset, and Daniel won 1st place three times, including by a huge margin in the TREC-COVID challenge. (He had a score of 0.9, 2nd place overall had a score of 0.75, and 2nd place on Kaggle had a score of 0.6.)</em></p><h3>Let’s meet Daniel!</h3><h3>Daniel, tell us a bit about yourself.</h3><p><strong>Daniel: </strong>I’m <a href=\"https://www.kaggle.com/danielwolffram\">Daniel Wolffram</a>, a graduate student in mathematics and a data science student assistant at Karlsruhe Institute of Technology (KIT), in Germany. My research interests include probabilistic forecasting, causal inference and machine learning.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/960/1*WD9rOxRkCfoNw4qaMXAX-w.png\" /></figure><p>As part of the Kaggle CORD-19 challenge I developed <a href=\"http://discovid.ai\">discovid.ai</a> — a search engine for COVID-19 literature. Right now, I’m working on the German COVID-19 forecast hub and writing my master thesis about building and evaluating forecast ensembles for COVID-19 death counts.</p><h4>Well, it’s no surprise you took top marks in the CORD-19 Challenge! That’s quite relevant!</h4><p><strong>Daniel:</strong> Indeed. I’m also a student assistant where I’ve worked on several data science projects for the last 3 years and had the opportunity to work with real world data from different companies in highly diverse domains — from predicting the waste in a sawmill to analyzing flaws in the process of surface galvanization and testing the efficiency of a marketing campaign.</p><p>During my time as a student assistant, we’ve also consulted a company that works with a lot of text data — that’s where I gained my first experience in NLP and also came across the idea of finding similar documents with the help of a topic model. At that time, our client wanted to stick with another approach, so I never really got to try out the LDA approach, but it always stayed in the back of my mind.</p><h4>How did you get started competing on Kaggle?</h4><p>During my undergraduate studies I joined a university group where we taught ourselves the basics of data science — mostly by working on Kaggle projects such as the <a href=\"https://www.kaggle.com/c/titanic\">Titanic </a>or <a href=\"https://www.kaggle.com/c/instacart-market-basket-analysis\">Instacart </a>challenge. That’s also how I got my job as a student assistant, because I met one of my now-colleagues there.</p><h4>What made you decide to enter this particular competition?</h4><p>A friend of mine showed me this competition and I was excited right away. I remembered the LDA approach and just wanted to try it out.</p><p>Moreover, when the competition was launched, Covid cases were climbing in Germany, where I live. The first protective measures to flatten the curve were taken here — all restaurants, shops (except supermarkets and drugstores) and leisure facilities were closed. My university was closed and all exams got cancelled. More shocking were the numbers from Italy and elsewhere. It was a very intimidating and uncertain atmosphere, so this challenge was actually a way to gain back some control by facing the crisis head on by simply using my skills for the best. I was aware that it might not have the biggest impact, but what kept me going was the thought that if even one medical researcher uses my model and stumbles upon something useful, my efforts were already worth it.</p><h3><strong>Let’s get technical</strong></h3><h4>What preprocessing and feature engineering did you do?</h4><p>To normalize the documents I removed stop words and performed tokenization and lemmatization. This last step was rather critical here, since the CORD-19 dataset contains highly technical papers with scientific language that can’t be processed successfully by standard packages. It was important to use <em>scispacy</em>, which is a package that is specialized on processing biomedical, scientific or clinical text and thus could also normalize technical terms (such as chemical elements, drug names, etc.).</p><p>For the topic model to work properly, it was also necessary to perform language detection and remove non-English documents.</p><p>All the details can be found in my preprocessing notebook: <a href=\"https://www.kaggle.com/danielwolffram/cord-19-create-dataframe\">https://www.kaggle.com/danielwolffram/cord-19-create-dataframe</a>.</p><p>To further augment the data, I also searched each article for clinical trial ids to link the document to the <a href=\"https://www.who.int/ictrp/en/\">WHO International Clinical Trials Registry Platform (ICTRP)</a>, which required hand crafting several regular expressions — the details can be found in <a href=\"https://www.kaggle.com/danielwolffram/cord-19-match-clinical-trials\">https://www.kaggle.com/danielwolffram/cord-19-match-clinical-trials</a>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*k9koDBnl9JTruDjx\" /></figure><h4>What machine learning methods did you use?</h4><p>I used Latent Dirichlet Allocation (LDA), which is an unsupervised topic model that learns hidden semantic relationships within the corpus. Initially, this was used to find relevant articles for each task of the CORD-19 challenge. But as we moved the approach to our website, we implemented a more common search engine with <em>Whoosh</em>, that allows for classical keyword searches or more complex boolean queries.</p><p>On discovid.ai the topic model is now used to find related articles — the idea is that each article is composed of a set of underlying topics and if we find articles with a similar topic mixture or an overlap in topics, they might be interesting for the reader and could spark new insights.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*HXfLXKp91RzAyiT5\" /><figcaption>Topic mixture of a selected paper and of a related article</figcaption></figure><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*33Ri3eM7JuMmAPFjBv6Pkw.png\" /><figcaption>Click through for interactivity: <a href=\"https://dwolffram.github.io/cord19_lda_topics/#topic=0&lambda=1&term=\">https://dwolffram.github.io/cord19_lda_topics/</a></figcaption></figure><p><a href=\"https://dwolffram.github.io/cord19_lda_topics/\">Here</a> you can explore 50 topics that our model found within the corpus — each topic is a distribution over words and each document can then be seen as a mixture of these topics.</p><h4>What was your most important insight into the data?</h4><p>Before removing the non-English articles from the corpus, interestingly, the following topics had been discovered by our topic model:</p><ul><li>Topic #46: der die und bei mit von eine ist werden zu für sind oder einer des den nicht das als nach zur auf durch auch ein</li><li>Topic #40: de les des en une est dans du par un ou sont pour plus au que avec chez sur d’une qui cas être pas ces</li><li>Topic #32: de en el los que se con las por un es para pacientes como más virus son tratamiento su infección puede ha casos enfermedad entre</li><li>Topic #7: un che con sono nel alla più ha tra gli degli come rischio ed pazienti nella nei osteonecrosis ad essere stato studio salute anche have</li></ul><p>As you can see, there was one for German, French, Spanish and Italian. To me this was very encouraging, because it demonstrates how powerful LDA is in learning hidden structures and that <strong>it actually learns something meaningful</strong>.</p><h4>Were you surprised by any of your findings?</h4><p>When people first tried out our search engine, it became clear that they only search for a few keywords — unlike the tasks on Kaggle, that were composed of much more text. This was quite a problem, because the queries were simply too short to infer topics in a useful manner. That’s when I decided to implement a more common search engine with <em>Whoosh </em>as an initial search (<a href=\"https://www.kaggle.com/danielwolffram/whoosh-search\">https://www.kaggle.com/danielwolffram/whoosh-search</a>). The topic model is now only used to find related articles that are composed of similar topics, which enables users to easily browse the corpus and discover new insights.</p><h4>How did you spend your time on this competition?</h4><p>As so often, most of my efforts went into data preparation and cleaning, especially in the beginning there were many changes in the data structure which required a lot of adjustments. I’ve also read a lot in the forum and talked to some people with medical background to identify needs of the community. That’s why we are also extracting methodological keywords as a first quality indicator and add cross references to clinical trials that are mentioned in the papers. I’ve also spent a good amount of time learning and figuring out new things, such as language detection or building a custom search engine with Whoosh, which I’ve never done before.</p><h4>What was the run time for both training and prediction of your winning solution?</h4><p>Transforming the documents and training the topic model takes roughly a day.</p><h3><strong>Teamwork</strong></h3><h4>How did your team form?</h4><p>I started out on my own and built some widgets in a Kaggle notebook to easily explore the CORD-19 dataset. But with the good feedback and increasing interest in my approach, I wanted to make it more user-friendly, so it could also be used without a technical background. That’s when I got in touch with one of my colleagues, who didn’t hesitate to assist me and who assembled a small team to build our website discovid.ai.</p><h4>How did your team work together?</h4><p>Two of my colleagues were working on the backend and frontend, another one got it up and running on the server and my girlfriend came up with the great design and also animated our introduction video.</p><iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FebrPwrBx4cw%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DebrPwrBx4cw&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FebrPwrBx4cw%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" width=\"854\" height=\"480\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/a3bafdc8ddb3721e6d80e83cd060a088/href\">https://medium.com/media/a3bafdc8ddb3721e6d80e83cd060a088/href</a></iframe><h4>How did competing on a team help you succeed?</h4><p>It definitely helped me to build a more well-rounded solution that is user-friendly and accessible by anyone.</p><h3><strong>Just for fun</strong></h3><h4>What is your dream job?</h4><p>I’m really drawn to data science in the medical field, because I wish to use my analytical skills in a meaningful project that helps others. I think that’s also what kept me going throughout the CORD-19 challenge — it was never about winning, but more about using my strengths for the best and doing my part in this global crisis.</p><h3>Words of wisdom</h3><h4>What have you taken away from this competition?</h4><p>It was a very meaningful project to me and along the way I got to know many interesting and inspiring people from all over the world. It was great to see how researchers from all around the globe rushed together to search answers to this global pandemic that affects each one of us in different ways and paradoxically unites us all.</p><h4>Do you have any advice for those just getting started in data science?</h4><p>Just get started! I think it’s important to get practical experience and learn how to handle different kinds of data, so you can easily transform it to a format you can work with. But as a math student, I also have to say that you shouldn’t neglect the fundamentals such as probability theory and statistics, because after all data science is a science, so it’s important to get an intuition about uncertainty and the limitations of different approaches.</p><p>Also, I think it’s always important to first get a clear understanding of the problem you are trying to solve, before throwing the most complex machine learning models on it.</p><p>…</p><p>You can find Daniel’s winning submission for CORD-19 here: <a href=\"https://www.kaggle.com/danielwolffram/discovid-ai-a-search-and-recommendation-engine\">https://www.kaggle.com/danielwolffram/discovid-ai-a-search-and-recommendation-engine</a></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=1320fb2717c4\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/kaggle-blog/gaining-a-sense-of-control-over-the-covid-19-pandemic-a-winners-interview-with-daniel-wolffram-1320fb2717c4\">Gaining a sense of control over the COVID-19 pandemic | A Winner’s Interview with Daniel Wolffram</a> was originally published in <a href=\"https://medium.com/kaggle-blog\">Kaggle Blog</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
}