{
  "title": "Relay Hindsight Experience Replay: Self-Guided Continual Reinforcement Learning for Sequential Object Manipulation Tasks with Sparse Rewards. (arXiv:2208.00843v2 [cs.RO] UPDATED)",
  "link": "http://arxiv.org/abs/2208.00843",
  "description": "<p>Exploration with sparse rewards remains a challenging research problem in\nreinforcement learning (RL). Especially for sequential object manipulation\ntasks, the RL agent always receives negative rewards until completing all\nsub-tasks, which results in low exploration efficiency. To solve these tasks\nefficiently, we propose a novel self-guided continual RL framework, RelayHER\n(RHER). RHER first decomposes a sequential task into new sub-tasks with\nincreasing complexity and ensures that the simplest sub-task can be learned\nquickly by utilizing Hindsight Experience Replay (HER). Secondly, we design a\nmulti-goal &amp; multi-task network to learn these sub-tasks simultaneously.\nFinally, we propose a Self-Guided Exploration Strategy (SGES). With SGES, the\nlearned sub-task policy will guide the agent to the states that are helpful to\nlearn more complex sub-task with HER. By this self-guided exploration and relay\npolicy learning, RHER can solve these sequential tasks efficiently stage by\nstage. The experimental results show that RHER significantly outperforms\nvanilla-HER in sample-efficiency on five singleobject and five complex\nmulti-object manipulation tasks (e.g., Push, Insert, ObstaclePush, Stack,\nTStack, etc.). The proposed RHER has also been applied to learn a contact-rich\npush task on a physical robot from scratch, and the success rate reached 10/10\nwith only 250 episodes.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Luo_Y/0/1/0/all/0/1\">Yongle Luo</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_Y/0/1/0/all/0/1\">Yuxin Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Dong_K/0/1/0/all/0/1\">Kun Dong</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhang_Q/0/1/0/all/0/1\">Qiang Zhang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Cheng_E/0/1/0/all/0/1\">Erkang Cheng</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Sun_Z/0/1/0/all/0/1\">Zhiyong Sun</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Song_B/0/1/0/all/0/1\">Bo Song</a>"
}