{
  "title": "VIPRE Security Group Introduces its Latest Endpoint Detection and Response (EDR) Technology",
  "link": "https://www.ziffdavis.com/about/news/vipre-security-group-introduces-its-latest-endpoint-detection-and-response-edr-technology",
  "dc:creator": "Jeremy Jones",
  "pubDate": "Thu, 04 Aug 2022 16:00:45 +0000",
  "category": [
    "Recent News",
    "Vipre",
    "VIPRE Security Group"
  ],
  "guid": "https://www.ziffdavis.com/?p=4240",
  "description": "<p>“At VIPRE, we know there are a variety of endpoint detection and response products  available in the marketplace for large companies, but those solutions can be complex and overwhelming for small and mid-sized businesses. After listening to our clients about their priorities, we decided to focus on creating a solution that would make EDR accessible for SMBs and our partners who serve them,” said VIPRE’s Chief Product Officer Usman Choudhary.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.ziffdavis.com/about/news/vipre-security-group-introduces-its-latest-endpoint-detection-and-response-edr-technology\">VIPRE Security Group Introduces its Latest Endpoint Detection and Response (EDR) Technology</a> appeared first on <a rel=\"nofollow\" href=\"https://www.ziffdavis.com\">Ziff Davis</a>.</p>\n",
  "content:encoded": "\n<p>“At VIPRE, we know there are a variety of endpoint detection and response products available in the marketplace for large companies, but those solutions can be complex and overwhelming for small and mid-sized businesses. After listening to our clients about their priorities, we decided to focus on creating a solution that would make EDR accessible for SMBs and our partners who serve them,” said VIPRE’s Chief Product Officer Usman Choudhary.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.ziffdavis.com/about/news/vipre-security-group-introduces-its-latest-endpoint-detection-and-response-edr-technology\">VIPRE Security Group Introduces its Latest Endpoint Detection and Response (EDR) Technology</a> appeared first on <a rel=\"nofollow\" href=\"https://www.ziffdavis.com\">Ziff Davis</a>.</p>\n"
}