{
  "title": "Surprising Earnings and Portfolio Protection",
  "itunes:title": "Surprising Earnings and Portfolio Protection",
  "pubDate": "Fri, 04 Nov 2022 20:38:00 +0000",
  "guid": "77e0d067-9e10-4e36-b50b-3a873a996414",
  "link": "https://fool.libsyn.com/surprising-earnings-and-portfolio-protection",
  "itunes:image": "",
  "description": "<p>If the jobs report and Federal Reserve didn't surprise investors, some earnings reports sure did.<br /> <br /> (0:30) Andy Cross and Jason Moser discuss:<br /> - How two of the \"War On Cash\" stocks are doing<br /> - Etsy's cautious optimism heading into the holidays<br /> - North American same-store sales fueling the rise of Starbucks<br /> - The latest from Qualcomm, Atlassian, and Uber<br /> <br /> (19:15) Rachel Warren talks with Jon Maier, chief investment officer at Global X, about how to protect your portfolio during an economic downturn and trends he's watching over the next 3, 5, and 10 years.<br /> <br /> (30:30: Andy and Jason return to talk about<br /> - Hershey's latest quarter<br /> - Investing strategy for a college student<br /> - Two stocks on their radar: Ulta Beauty and The Trade Desk<br /> <br /> Stocks mentioned: SQ, PYPL, ETSY, SBUX, QCOM, TEAM, UBER, HSY, VOO, ULTA, TTD<br /> <br /> Host: Chris Hill<br /> Guests: Jason Moser, Andy Cross, Rachel Warren, Jon Maier<br /> Producer: Ricky Mulvey<br /> Engineers: Rick Engdahl, Dan Boyd</p>",
  "content:encoded": "<p>If the jobs report and Federal Reserve didn't surprise investors, some earnings reports sure did.  (0:30) Andy Cross and Jason Moser discuss: - How two of the \"War On Cash\" stocks are doing - Etsy's cautious optimism heading into the holidays - North American same-store sales fueling the rise of Starbucks - The latest from Qualcomm, Atlassian, and Uber  (19:15) Rachel Warren talks with Jon Maier, chief investment officer at Global X, about how to protect your portfolio during an economic downturn and trends he's watching over the next 3, 5, and 10 years.  (30:30: Andy and Jason return to talk about - Hershey's latest quarter - Investing strategy for a college student - Two stocks on their radar: Ulta Beauty and The Trade Desk  Stocks mentioned: SQ, PYPL, ETSY, SBUX, QCOM, TEAM, UBER, HSY, VOO, ULTA, TTD  Host: Chris Hill Guests: Jason Moser, Andy Cross, Rachel Warren, Jon Maier Producer: Ricky Mulvey Engineers: Rick Engdahl, Dan Boyd</p>",
  "enclosure": "",
  "itunes:duration": "39:19",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "If the jobs report and Federal Reserve didn't surprise investors, some earnings reports sure did.  (0:30) Andy Cross and Jason Moser discuss: - How two of the \"War On Cash\" stocks are doing - Etsy's cautious optimism heading into the holidays - North...",
  "itunes:episodeType": "full"
}