{
  "title": "Innovator of the Year Awards: Manchester",
  "link": "https://audioboom.com/posts/8171104",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1667,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>This year’s regional podcast series for <em>The Spectator</em>’s Economic Innovator of the Year Awards kicked off with news of a fascinating lunch at The Ivy Cafe in Manchester. </div>\n<br>\n<div>We invited four finalists for the North West region — out of a record total of 176 across the whole of the UK — to pitch their ventures to our distinguished panel of judges. The finalists you’ll hear about on this podcast are: LoveRaw which makes vegan chocolate; Ordo which makes electric toothbrushes; Interact, which drives energy efficiency in data centres and IT systems; and Better2Know, which provides sexual health testing services.<br>\n<br>\nThe judges were Gabriel Fysh, whose company Transcend Packaging, in South Wales, is one of our former winners in this region; private equity and venture capital investor Steve Morris; and Richard Greenhalgh and Michelle White representing our sponsor, the wealth manager and investment bank Investec. </div>\n<br>\n<div>The judges faced the tough task of comparing businesses in very different sectors and stages of development. But all four made compelling pitches —  and the variety of entries is part of the fun of these Awards.</div>\n<br>\n<div>We hope all the companies we meet gain from the networking opportunities, benefit from the accolade of being selected as finalists and enjoy the buzz, the conversation and the lunch.  We hope <em>Spectator</em> readers and podcast listeners also enjoy following the search for this year’s ultimate winners — and will take a few minutes to explore the finalists' websites and products.</div>\n<br>\n<div>More Economic innovator of the Year Awards podcasts coming shortly!</div>\n",
  "pubDate": "Sun, 09 Oct 2022 11:00:00 +0000",
  "guid": "tag:audioboom.com,2022-10-07:/posts/8171104",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}