{
  "title": "#137/Modernism Week 2020: Daniel Libeskind + Nelda Linsk + Alison Martino",
  "pubDate": "Mon, 30 Mar 2020 07:00:00 +0000",
  "guid": "05ac485a-d500-4625-9ffb-f56f3e4a92bf",
  "link": "https://traffic.libsyn.com/secure/usmodernist/USM_137_MW1-F.mp3",
  "itunes:image": "",
  "description": "<p><span class=\"auto-style6\">Nowhere in the world celebrates Modernism better than Palm Springs, California.  Every February, they have a huge architecture and design festival called Modernism Week, which actually lasts 11 days. This was the fifth year USModernist has been at Modernism Week, talking poolside at the USModernist Compound, aka the hip Hotel Skylark, with nearly all the keynote speakers, authors, and special guests. When modern-day Dorothy's kick their red ruby slippers together, they don’t go to Kansas, they land next to in</span> <strong class= \"auto-style6\">Frank Sinatra’s</strong><span class= \"auto-style7\"><span class=\"auto-style5\"> pool in Palm Springs. Modernism Week is a dazzling spectacle of mid-century architecture, martinis, lectures, art galleries, shopping, nonprofit benefit events, architecture documentary premieres, amazing parties at incredible houses, brilliantly curated house tours, detailed art and architecture exhibits, and much more.  <br /> <br /> Today we kick off 2020 Modernism Week coverage with architect </span></span><strong class=\"auto-style6\">Daniel Libeskind</strong><span class=\"auto-style6\">, known for the Jewish Museum in Berlin, Germany, the master plan for the World Trade Center reconstruction and memorial, and the Danish Jewish Museum, Copenhagen, Denmark. He’s one of the world’s most highly regarded architects and someone people can trust to work with projects of great meaning and significance, especially where loss in involved.  </span></p> <p><span class=\"auto-style6\">Next, host <strong class= \"auto-style6\">George Smart</strong> visits with the Queen of Palm Springs, the woman everyone wants to talk to by the pool, <strong class=\"auto-style6\">Nelda Linsk. </strong> Later a delightful chat with <strong class= \"auto-style6\">Alison Martino</strong>, producer, writer, reporter, preservationist, and a master chronicler of old Hollywood, in which she grew up as the daughter of singer <strong class= \"auto-style6\">Al Martino.</strong></span></p>",
  "content:encoded": "<p>Nowhere in the world celebrates Modernism better than Palm Springs, California.  Every February, they have a huge architecture and design festival called Modernism Week, which actually lasts 11 days. This was the fifth year USModernist has been at Modernism Week, talking poolside at the USModernist Compound, aka the hip Hotel Skylark, with nearly all the keynote speakers, authors, and special guests. When modern-day Dorothy's kick their red ruby slippers together, they don’t go to Kansas, they land next to in Frank Sinatra’s pool in Palm Springs. Modernism Week is a dazzling spectacle of mid-century architecture, martinis, lectures, art galleries, shopping, nonprofit benefit events, architecture documentary premieres, amazing parties at incredible houses, brilliantly curated house tours, detailed art and architecture exhibits, and much more.    Today we kick off 2020 Modernism Week coverage with architect Daniel Libeskind, known for the Jewish Museum in Berlin, Germany, the master plan for the World Trade Center reconstruction and memorial, and the Danish Jewish Museum, Copenhagen, Denmark. He’s one of the world’s most highly regarded architects and someone people can trust to work with projects of great meaning and significance, especially where loss in involved.  </p> <p>Next, host George Smart visits with the Queen of Palm Springs, the woman everyone wants to talk to by the pool, Nelda Linsk.  Later a delightful chat with Alison Martino, producer, writer, reporter, preservationist, and a master chronicler of old Hollywood, in which she grew up as the daughter of singer Al Martino.</p>",
  "enclosure": "",
  "itunes:duration": "01:03:40",
  "itunes:explicit": false,
  "itunes:keywords": "linskarchitectureartdesigndaniellibeskindalisonmartino",
  "itunes:subtitle": "Nowhere in the world celebrates Modernism better than Palm Springs, California.  Every February, they have a huge architecture and design festival called Modernism Week, which actually lasts 11 days. This was the fifth year USModernist has been...",
  "itunes:episodeType": "full",
  "itunes:author": "george smart"
}