{
  "id": "yt:video:WXhn1tdZ_os",
  "yt:videoId": "WXhn1tdZ_os",
  "yt:channelId": "UCdZcGRaBV-VRRyU4t6Ur0mw",
  "title": "How Do We Understand Missing Words? Ellipsis",
  "link": "",
  "author": {
    "name": "The Ling Space",
    "uri": "https://www.youtube.com/channel/UCdZcGRaBV-VRRyU4t6Ur0mw"
  },
  "published": "2018-12-13T01:03:02+00:00",
  "updated": "2022-07-22T03:51:20+00:00",
  "media:group": {
    "media:title": "How Do We Understand Missing Words? Ellipsis",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "What can silence tell us about the syntax of a sentence? How do we know what meaning to fill in when words are missing? In this week's episode, we talk about ellipsis: what rules are at work to tell us how to use it, how sentence structure plays into what words we can leave out, and whether words are even missing at all, or just hiding. \n\nThis is Topic #94!\n\nThis week's tag language: Scots Gaelic!\n\nRelated videos:\nHow Can Sentences Look Like Adjectives? Relative Clauses: https://youtu.be/Bra5gExyPbY\nWhat Makes a Basic Sentence? A History of Clauses: https://youtu.be/980meOhBGR8\nHow Can We Tell What Roles Nouns Play? Case Theory: https://youtu.be/8Xi81H80J-w\n\nLast episode:\nWho Is She? The Syntax of Pronouns: https://youtu.be/fvohHpylRkY\n\nOther of our morphosyntax videos:\nWhat Does Possession Tell Us About Syntax? The DP Hypothesis: https://youtu.be/gWy7QdZJg9E\nWhat Kinds of Pieces Do We Use to Build Words? Derivation and Inflection: https://youtu.be/BTZCozhneKA\nWhat Changes in a Sentence When We Swap Verbs? Raising vs. Control: https://youtu.be/SYoYNeaSYrU\n\nOur website also has extra content about this week's topic, on why objects tend to stay put in English, at: http://www.thelingspace.com/episode-94/\n\nFind us on all the social media worlds:\nTumblr: http://thelingspace.tumblr.com/\nTwitter: http://twitter.com/TheLingSpace\nFacebook: http://www.facebook.com/thelingspace/\n\nAnd at our website, http://www.thelingspace.com/ !\nYou can also find our store at the website, https://thelingspace.storenvy.com/\n\nWe also have forums to discuss this episode, and linguistics more generally.\n\nSources:\nMuch of the discussion here is based on Andrew Carnie's Syntax: A Generative Introduction, 3rd edition, as well as his dissertation, which can be found at: http://dingo.sbs.arizona.edu/~carnie/publications/Thesishome.html\n\nWe also used Jason Merchant's survey of different approaches to ellipsis: http://home.uchicago.edu/merchant/pubs/ellipsis.revised.pdf\n\nWe also consulted Brendan Gillon's upcoming book, Natural Language Semantics: http://mitpress.mit.edu/books/natural-language-semantics\n\nAnd the Wikipedia page on ellipsis is a pretty helpful place to start! http://en.wikipedia.org/wiki/Ellipsis_(linguistics)\n\nLooking forward to next time!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}