{
  "id": "yt:video:V8fSYnY9Bj0",
  "yt:videoId": "V8fSYnY9Bj0",
  "yt:channelId": "UCP3alkHEJhoxTpy3iVON-lg",
  "title": "How General Relativity Reshaped the Universe!",
  "link": "",
  "author": {
    "name": "Physics with Elliot",
    "uri": "https://www.youtube.com/channel/UCP3alkHEJhoxTpy3iVON-lg"
  },
  "published": "2022-05-17T21:15:22+00:00",
  "updated": "2022-06-27T23:03:50+00:00",
  "media:group": {
    "media:title": "How General Relativity Reshaped the Universe!",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Discover how Einstein's general theory of relativity spans the cosmic spectrum from planetary orbits to black holes! Sponsored by Babbel 🎉: Start speaking a new language in 3 weeks. Get up to 65% OFF your subscription ▶️ HERE: https://go.babbel.com/12m65-youtube-physicswithelliot-may-2022/default\n\nGet the notes for free here: https://courses.physicswithelliot.com/notes-sign-up\n\nEinstein's theory of gravity---general relativity---was the last great pillar of pre-quantum physics. Gravity, he says, results from the curvature of spacetime in the presence of massive objects like stars. Then lighter particles moving nearby just travel along the straightest possible routes that they can through this curved geometry, called geodesics. And yet over 200 years earlier  Newton wrote down a vastly simpler force law for gravity  and used it to derive the orbits of the planets in our solar system to remarkable accuracy. So how is it that these two radically different descriptions of gravity fit together? And how does Einstein's theory go beyond Newton's, to predict the existence of black holes? (Like the Sagittarius A* supermassive black hole at the center of our galaxy that the Event Horizon Telescope collaboration released the first ever picture of just last week!) We'll explore it all in this video. We'll learn about geodesics, gravitational time dilation, the Schwarzschild solution of Einstein's equations, and the black hole geometries that emerge when you squish a star into a ball smaller than its Schwarzschild radius. You'll come away with an appreciation for how Einstein's theory can capture the same physics as Newton's inverse square law in the limit when gravity is weak, and at the same time describe black holes in the opposite limit when gravity is strong.\n\nRelated videos:\n\nHow Newton derived the orbit of our home planet: https://youtu.be/wLYZsO6lk0E\n\nThe life of a particle in special relativity: https://youtu.be/KVk1QNTWBxQ\n\nThe life of a particle in general relativity and the geodesic equation: https://youtu.be/h2SEK6Jjv3Y\n\nField theory fundamentals: https://youtu.be/13hCkUiu_mI\n\nThe principle of least action: https://youtu.be/sUk9y23FPHk\n\n\nIf you find the content I’m creating valuable and would like to help make it possible for me to continue sharing more, please consider supporting me! You can make a recurring contribution at https://www.Patreon.com/PhysicsWithElliot, or make a one time contribution at https://www.physicswithelliot.com/support-me. Thank you so much!\n\nAbout physics mini lessons:\nIn these intermediate-level physics lessons, I'll try to give you a self-contained introduction to some fascinating physics topics. If you're just getting started on your physics journey, you might not understand every single detail in every video---that's totally fine! What I'm really hoping is that you'll be inspired to go off and keep learning more on your own.\n\nAbout me:\nI’m Dr. Elliot Schneider. I love physics, and I want to help others learn (and learn to love) physics, too. Whether you’re a beginner just starting out with your physics studies, a more advanced student, or a lifelong learner, I hope you’ll find resources here that enable you to deepen your understanding of the laws of nature. For more cool physics stuff, visit me at https://www.physicswithelliot.com.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}