{
  "id": "yt:video:fA6gr8KUQ6A",
  "yt:videoId": "fA6gr8KUQ6A",
  "yt:channelId": "UCEnl2ZDocvt4aoIyT3fl8SQ",
  "title": "Liberated United States airmen prisoners at Stalag 7A in Moosburg, Germany HD Stock Footage",
  "link": "",
  "author": {
    "name": "CriticalPast",
    "uri": "https://www.youtube.com/channel/UCEnl2ZDocvt4aoIyT3fl8SQ"
  },
  "published": "2014-07-16T11:30:51+00:00",
  "updated": "2022-05-20T19:17:06+00:00",
  "media:group": {
    "media:title": "Liberated United States airmen prisoners at Stalag 7A in Moosburg, Germany HD Stock Footage",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "CriticalPast is an archive of historic footage. The vintage footage in this video has been uploaded for research purposes, and is presented in unedited form. Some viewers may find some scenes or audio in this archival material to be unsettling or distressing. CriticalPast makes this media available for researchers and documentarians, and does not endorse or condone any behavior or message, implied or explicit, that is seen or heard in this video.\nLink to order this clip:\nhttp://www.criticalpast.com/video/65675040694_liberated-prisoners_Stalag-Luft-III_soldiers-cleaning-clothes_soldiers-cooking-food\nHistoric Stock Footage Archival and Vintage Video Clips in HD.\n\nLiberated United States airmen prisoners at Stalag 7A in Moosburg, Germany\n\nLiberated United States prisoners (mostly military airmen) at POW camp called Kriegsgefangenen-Mannschafts-Stammlager (Stalag) VII A, located just North of Moosburg, Germany. The airmen cook food. Several are seen sunning themselves. Airmen seen shaving, shining shoes and cleaning clothes. A group of airmen around sign 'I Wanted Wings' and 'Luft 3'. These are some of the prisoners who were originally held at Stalag Luft III, in German Province of Lower Silesia, near the town of Sagan (now in Poland). (Note: Stalag Luft III is famous because the \"Great Escape\" took place there in March, 1944. Prisoners were forced to march from Sagan to Spremburg during the coldest winter in Germany in 50 years. There, they boarded a train of boxcars for a 3 day trip to Moosburg in January 1945, because the Russians were closing in. The addition of these prisoners to Stalag 7A, at Moosburg, led to serious overcrowding of the camp. On May 1, 1945, the New York Times reported that \"The Fourteenth Armored Division liberated 110,000 Allied prisoners of war at Stalag 7A at Moosburg.\" This corrected an earlier report that 27,000 prisoners had been liberated.) Location: Moosburg Germany. Date: April 29, 1945.\n\nVisit us at www.CriticalPast.com:\n57,000+ broadcast-quality historic clips for immediate download.\nFully digitized and searchable, the CriticalPast collection is one of the largest archival footage collections in the world. All clips are licensed royalty-free, worldwide, in perpetuity. CriticalPast offers immediate downloads of full-resolution HD and SD masters and full-resolution time-coded screeners, 24 hours a day, to serve the needs of broadcast news, TV, film, and publishing professionals worldwide. Still photo images extracted from the vintage footage are also available for immediate download.  CriticalPast is your source for imagery of worldwide events, people, and B-roll spanning the 20th century.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}