{
  "title": "A Dusting of Gamification",
  "link": "https://www.joelonsoftware.com/2018/04/13/gamification/",
  "dc:creator": "Joel Spolsky",
  "pubDate": "Fri, 13 Apr 2018 13:40:21 +0000",
  "category": "News",
  "guid": "https://www.joelonsoftware.com/?p=3260",
  "description": "I had to think for a minute to realize that Stack Overflow has “gamification\" too. Not a ton. Maybe a dusting of gamification, most of it around reputation. <span class=\"read-more\"><a class=\"more-link\" href=\"https://www.joelonsoftware.com/2018/04/13/gamification/\" rel=\"bookmark\">Read more <span class=\"screen-reader-text\">\"A Dusting of Gamification\"</span></a></span>",
  "content:encoded": "<p><em>[This is the second in a series of posts about Stack Overflow. The first one is <a href=\"https://www.joelonsoftware.com/2018/04/06/the-stack-overflow-age/\">The Stack Overflow Age</a>.]</em></p>\n<p>Around 2010 the success of Stack Overflow had led us into some conversations with VCs, who wanted to invest.</p>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"aligncenter wp-image-3273\" src=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/2018-01-09-12.54.00.jpg?resize=500%2C667&#038;ssl=1\" alt=\"at the Getty\" width=\"500\" height=\"667\" srcset=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/2018-01-09-12.54.00.jpg?resize=768%2C1024&ssl=1 768w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/2018-01-09-12.54.00.jpg?resize=225%2C300&ssl=1 225w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/2018-01-09-12.54.00.jpg?resize=1200%2C1600&ssl=1 1200w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/2018-01-09-12.54.00.jpg?w=1460&ssl=1 1460w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/2018-01-09-12.54.00.jpg?w=2190&ssl=1 2190w\" sizes=\"(max-width: 500px) 100vw, 500px\" data-recalc-dims=\"1\" /></p>\n<p>The firm that eventually invested in us, <a href=\"https://www.usv.com/\">Union Square Ventures</a>, told us that they were so excited by the power of gamification that they were only investing in companies that incorporated some kind of game play.</p>\n<p>For example, Foursquare. Remember Foursquare? It was all about making your normal post-NYU life of going to ramen noodle places and dive bars into a fun game that incidentally generated wads of data for marketers. Or Duolingo, which is a fun app with flash cards that teaches you foreign languages. Those were other USV investments from that time period.</p>\n<p>At the time, I had to think for a minute to realize that Stack Overflow has “gamification&#8221; too. Not a ton. Maybe a <em>dusting</em> of gamification, most of it around reputation.</p>\n<p>Stack Overflow reputation started as a very simple score. The original idea was just that you would get 10 points when your answers were upvoted. Upvotes do two things. They get the most useful answers to the top, signaling that other developers who saw this answer thought it was good. They also send the person who wrote the answer a real signal that their efforts helped someone. This can be incredibly motivating.</p>\n<p>You would lose points if your questions were downvoted, but you actually only lose 2 points. We didn&#8217;t want to punish you so much as we wanted to show other people that your answer was wrong. And to avoid abuse, we actually make you <em>pay</em> one reputation point to downvote somebody, so you better really mean it. That was pretty much the whole system.</p>\n<p>Now, this wasn&#8217;t an original idea. It was originally inspired by Reddit Karma, which started out as an integer that appeared in parentheses after your handle. If you posted something that got upvoted, your karma went up as a &#8220;reward.&#8221; That was it. Karma <a href=\"https://www.zdnet.com/article/collaborative-filtering-comparing-reddits-karma-system-to-digg/\">didn’t do a single thing</a> but still served as a system for reward and punishment.</p>\n<p>What reputation and karma do is send a message that this is a community with norms, it&#8217;s not just a place to type words onto the internet. (That would be 4chan.) We don&#8217;t really exist for the purpose of letting you exercise your freedom of speech. You can get your freedom of speech somewhere else. Our goal is to get the best answers to questions. All the voting makes it clear that we have standards, that some posts are better than others, and that the community itself has some norms about what&#8217;s good and bad that they express through the vote.</p>\n<p>It&#8217;s not a perfect system (more on the problems in a minute), but it&#8217;s a reasonable first approximation.</p>\n<p>By the way, Alexis Ohanian and Steve Huffman, the creators of Reddit, were themselves inspired by a more primitive karma system, on Slashdot. This system had real-world implications. You didn’t get karma so that other people could see your karma; you got karma so that the system knew you weren’t a spammer. If a lot of your posts had been flagged for abuse, your karma would go down and you might lose posting or moderation privileges. But you weren’t really supposed to show off your high karma. “Don&#8217;t worry too much about it; it&#8217;s just an integer in a database,” Slashdot told us.</p>\n<p>To be honest, it was initially surprising to me that you could just print a number after people’s handles and they would feel rewarded. Look at me! Look at my four digit number! But it does drive a tremendous amount of good behavior. Even people who aren’t participating in the system (by working to earn reputation) buy into it (e.g., by respecting high-reputation users for their demonstrated knowledge and helpfulness).</p>\n<p>But there&#8217;s still something of a mystery here, which is why earning &#8220;magic internet points&#8221; is appealing to anyone.</p>\n<p>I think the answer is that it&#8217;s nice to know that you&#8217;ve made a difference. You toil away in the hot kitchen all day and when you serve dinner it&#8217;s nice to hear a compliment or two. If somebody compliments you on the extra effort you put into making radish roses, you&#8217;re going to be very happy.</p>\n<p>This is a part of a greater human need: to make an impact on the world, and to know that you&#8217;re contributing and being appreciated for it. Stack Overflow&#8217;s reputation system serves to recognize that you&#8217;re a human being and we are super thankful for your contribution.</p>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"aligncenter wp-image-3276 size-large\" src=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/2018-01-11-13.46.38.jpg?resize=730%2C548&#038;ssl=1\" alt=\"in Utah\" width=\"730\" height=\"548\" srcset=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/2018-01-11-13.46.38.jpg?resize=1024%2C768&ssl=1 1024w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/2018-01-11-13.46.38.jpg?resize=300%2C225&ssl=1 300w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/2018-01-11-13.46.38.jpg?resize=768%2C576&ssl=1 768w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/2018-01-11-13.46.38.jpg?resize=1200%2C900&ssl=1 1200w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/2018-01-11-13.46.38.jpg?w=1460&ssl=1 1460w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/2018-01-11-13.46.38.jpg?w=2190&ssl=1 2190w\" sizes=\"(max-width: 730px) 100vw, 730px\" data-recalc-dims=\"1\" /></p>\n<p>That said, there is a dark side to gamification. It&#8217;s not 100% awesome.</p>\n<p>The first problem we noticed is that it&#8217;s very nice to get an upvote, but getting a downvote feels like a slap in the face. Especially if you don&#8217;t understand why you got the downvote, or if you don&#8217;t agree. Stack Overflow&#8217;s voting has made many people unhappy over the years, and there are probably loads of people who felt unwelcome and who don&#8217;t participate in Stack Overflow as a result. (Here&#8217;s an old blog post explaining <a href=\"https://stackoverflow.blog/2009/03/09/the-value-of-downvoting-or-how-hacker-news-gets-it-wrong/\">why we didn&#8217;t just eliminate downvotes</a>).</p>\n<p>There&#8217;s another problem, which is that, to the extent that the gamification in Stack Overflow makes the site feel less inclusive and welcoming to many people, it is disproportionately off-putting to programmers from underrepresented groups. While Stack Overflow does have many amazing, high reputation contributors who are women or minorities, we&#8217;ve also heard from too many who were apprehensive about participating.</p>\n<p>These are big problems. There&#8217;s a lot more we can and will say about that over the next few months, and we&#8217;ve got a lot of work ahead of us trying to make Stack Overflow a more inclusive and diverse place so we can improve the important service that it provides to developers everywhere.</p>\n<p>Gamification can shape behavior. It can guide you to do certain things in certain ways, and it can encourage certain behaviors. But it&#8217;s a very weak force. You can’t do that much with gamification. You certainly can’t get people to do something that they’re not interested in doing, anyway. I’ve heard a lot of crazy business plans that are pinning rather too high hopes on gamification as a way of getting people to go along with some crazy scheme that the people won’t want to go along with. Nobody’s going to learn French just to get the Duolingo points. But if you are learning French, and you are using Duolingo, you might make an effort to open the app every day just to keep your streak going.</p>\n<p>I&#8217;ve got more posts coming! The next one will be about the obsessive way Stack Overflow was designed for the artifact, in other words, we optimized everything to create amazing results for developers with problems arriving from Google, not just to answer questions that people typed into our site.</p>\n<p>&nbsp;</p>\n",
  "post-id": 3260
}