{
  "title": "When Confronting Bias, Beware the Counterclaims",
  "link": "https://sloanreview.mit.edu/article/when-confronting-bias-beware-the-counterclaims/",
  "comments": "https://sloanreview.mit.edu/article/when-confronting-bias-beware-the-counterclaims/#respond",
  "pubDate": "Mon, 31 Oct 2022 11:00:27 +0000",
  "dc:creator": "Felix Danbold, Ivuoma N. Onyeador, and Miguel M. Unzueta. <p>Felix Danbold is an assistant professor in the Organisations &#038; Innovations Group at University College London School of Management. Ivuoma N. Onyeador (<a href=\"https://twitter.com/ivuoma\">@ivuoma</a>) is an assistant professor of management and organizations at the Kellogg School of Management at Northwestern University. Miguel M. Unzueta is a professor at the UCLA Anderson School of Management.</p>\n",
  "category": [
    "Conflict Resolution",
    "Employee Behavior",
    "Human Psychology",
    "Leadership Skills",
    "Diversity & Inclusion",
    "Leadership",
    "Organizational Behavior",
    "Workplace, Teams, & Culture"
  ],
  "description": "Imagine you’re the manager of a diverse team. One day, you are troubled to hear that several Black employees feel unwelcome in the workplace. They report that two White employees were joking with other colleagues about a photo of themselves posted to social media showing them wearing racially insensitive costumes to a party. You want [&#8230;]",
  "content:encoded": "<p></p>\n<figure class=\"article-inline\">\n<img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/10/2022_1031_Danbold-1290x860-1.jpg\" alt=\"\" /><br />\n</figure>\n<p>Imagine you’re the manager of a diverse team. One day, you are troubled to hear that several Black employees feel unwelcome in the workplace. They report that two White employees were joking with other colleagues about a photo of themselves posted to social media showing them wearing racially insensitive costumes to a party. You want to be an inclusive and responsive leader, so you call the two offending employees into your office individually to address the report.</p>\n<p>The first employee — we’ll call him Michael — goes on the defensive, complaining that this is a classic case of “reverse racism” and that he is being unfairly targeted by the Black employees because he’s White. </p>\n<p>The second employee, John, also tries to portray himself as the victim, but in a different way. He argues that his free speech is being imperiled. He says that efforts to control what he can and cannot say in the workplace threaten his fundamental rights.</p>\n<p></p>\n<p>What do you make of these arguments? Would you be inclined to believe both of them, or one employee more than the other? How would you address the situation with your team?</p>\n<p>When members of groups with more power and resources — what social scientists call dominant groups — are accused of discrimination against those with less power and fewer resources (nondominant groups), they will sometimes seek to deflect criticism by portraying themselves as the victims of discrimination. This is known as <em>competitive victimhood</em>. Some go a step further and invoke victimhood on a new dimension of harm, changing the topic to freedom of speech, for instance, or religious liberty. We refer to this as <em>digressive victimhood</em>.</p>\n<p></p>\n<p>In recent research spanning three studies of 3,081 people, we explored how people respond to claims like the ones in the scenario above. We found that people consistently respond more favorably to digressive victimhood claims (like John’s) than competitive ones. Because digressive victimhood claims complicate conversations around bias, their effectiveness means that managers may end up neglecting to address the original instances of bias they are meant to respond to. By raising awareness of this psychological phenomenon, this article aims to help managers avoid getting derailed or distracted by digressive victimhood claims, allowing them to uphold their responsibility to address discrimination in the workplace.</p>\n<p></p>\n<h3>Claiming Victimhood in Response to Accusations of Bias</h3>\n<p>Members of nondominant groups who experience discrimination can highlight the discrimination they face by reporting biased behavior to supervisors or, when that fails to get results, going outside to the media or the courts. This can be seen in rising cases of <a href=\"https://sloanreview.mit.edu/article/leading-in-an-age-of-employee-activism/\">employee activism</a>, such as the recent <a href=\"https://www.theguardian.com/technology/2022/feb/18/tesla-california-racial-harassment-discrimination-lawsuit\">discrimination lawsuits against Tesla</a> by employees of color. Managers faced with reports of discrimination must explore their merits without getting distracted by the counterclaims of those accused.</p>\n<p>In the opening example above, the first employee, Michael, tried to avoid facing consequences for his behavior by alleging reverse racism, deflecting blame from himself onto the Black employees who accused him of discrimination. This type of counterclaim was the basis of a lawsuit against Google in 2018 filed by James Damore, an engineer and ex-employee, who claimed that the company’s efforts to address sexism and racism in the tech industry were actually discriminatory against White and Asian men. Such competitive victimhood claims aim to make the dominant group seem virtuous and stop the criticism levied against them.</p>\n<p>In contrast, the second employee, John, exhibited digressive victimhood when he said the accusation of racism levied against him threatened his freedom of speech. Digressive victimhood is also at work when individuals or businesses invoke religious liberty to deflect claims of homophobia. For example, when accused of bias for refusing to sell a wedding cake to a gay couple, the defendant in the <em>Masterpiece Cakeshop v. Colorado Civil Rights Commission</em> case, heard by the Supreme Court in 2018, argued that his religious liberty was on the line. Like competitive victimhood claims, digressive victimhood claims aim to absolve the dominant group and deflect criticism, but they also complicate the discussion. By drawing in new topics of debate, especially big ideas around universal rights, these claims can obscure nondominant groups’ efforts to address discrimination.</p>\n<h3>The Power of Digressive Victimhood</h3>\n<p>A manager could easily be distracted by John’s digressive victimhood argument, thinking there was a more complicated debate to be had. This muddying of the waters might make managers hesitate to hold employees accused of causing a <a href=\"https://sloanreview.mit.edu/article/why-every-leader-needs-to-worry-about-toxic-culture\">hostile climate</a> accountable. When that happens, managers neglect their responsibility to ensure that employees from nondominant groups are protected from discrimination at work.</p>\n<p>In <a href=\"https://www.sciencedirect.com/science/article/pii/S0022103121001360\">our research</a>, we asked people to read and react to victimhood claims like the ones from the opening example. Across our studies, members of dominant groups endorsed the digressive victimhood claim more strongly than the competitive victimhood claim. For example, in one study, on a scale where 1 represented “strongly disagree” and 7 “strongly agree,” digressive claims averaged a rating of 4.0, compared with 3.4 for the competitive claim. Members of nondominant groups also preferred digressive victimhood claims to competitive victimhood claims, but this preference was smaller, and both claims were endorsed less (averaging 3.5 and 3.1, respectively).</p>\n<p></p>\n<p>Those who endorsed the digressive victimhood claim were also more likely to agree that the claim would be difficult for those originally making accusations of bias to rebut. When trying to understand why members of dominant groups show a clear preference for digressive victimhood claims, we ran statistical analyses that indicated that this preference is rooted in a belief that digressive victimhood claims are more effective at preventing further criticism. This relationship did not emerge among participants from nondominant groups.</p>\n<p>Our findings suggest that members of dominant groups may support digressive victimhood claims strategically. Indeed, we observed that there was a positive correlation between how biased (such as racist) people were and how strongly they endorsed a digressive victimhood argument. We even observed evidence of people acting in bad faith and supporting digressive victimhood claims when they didn’t even particularly support the abstract value undergirding the claim (such as free speech).</p>\n<h3>Where to Go From Here</h3>\n<p>Think back to the example of our two employees accused of racism. If you found the claim based on the threat to John’s freedom of speech more compelling, you’re not alone. The problem is that you could easily get derailed into a debate about free speech and forget about the original issue at hand — the discrimination faced by your Black employees. </p>\n<p>Here are three steps managers can take to avoid getting distracted by digressive victimhood claims.</p>\n<p><strong>Don’t lose focus.</strong> Competitive and digressive victimhood claims emerge when members of dominant groups are confronted with evidence of their bias. It can be easy for managers to get distracted by these counterclaims. After all, the belief that such claims are effective in silencing further criticism is one of the reasons they may be deployed. Managers should separate such counterclaims from the original grievance they are responding to and take care to weigh the sincerity and importance of each. Without this awareness, even well-intentioned managers may find themselves neglecting to address the discrimination often faced by nondominant group members in the workplace.</p>\n<p></p>\n<p><strong>Consider potential motivations.</strong> It’s hard to know what people actually believe, and we’re often inclined to take the arguments people make at face value. However, our research shows that people making digressive victimhood claims may be acting in bad faith. While leaders should listen carefully to all employees, they should also be aware that some may be trying to distract their attention away from the suffering of others. Leaders might investigate counterclaimants’ commitment to the principles they are marshaling to defend themselves. Do they defend the free speech of people whose views do not align with their perspectives? How does the employee think about the consequences of exercising their speech? Do they consider that Black employees in the workplace feel insulted and harmed?</p>\n<p></p>\n<p><strong>Reward accountability.</strong> Our research focused on what happens when those who engage in biased behavior try to dodge accountability and portray themselves as the victims. However, we shouldn’t expect this to happen every time an employee is called out for their biased behavior. Hopefully, some will recognize what they did was wrong, own it, apologize, and change. This kind of behavior should be rewarded and held up as an example to other employees. Knowing how to recognize when employees are claiming competitive or digressive victimhood and being able to discourage it, while also rewarding employees who take accountability, is a key part of effectively <a href=\"https://www.apa.org/pubs/journals/features/apl-apl0000482.pdf\">leading diverse teams</a>.</p>\n<p>We hope that with a better understanding of digressive victimhood, managers will feel better equipped to respond to tricky situations and ensure that underrepresented employees can work in a bias-free climate.</p>\n<p></p>\n",
  "wfw:commentRss": "https://sloanreview.mit.edu/article/when-confronting-bias-beware-the-counterclaims/feed/",
  "slash:comments": 0
}