{
  "id": "yt:video:5BLYLLlP5bc",
  "yt:videoId": "5BLYLLlP5bc",
  "yt:channelId": "UCTUtqcDkzw7bisadh6AOx5w",
  "title": "Understanding Free Fallin'",
  "link": "",
  "author": {
    "name": "12tone",
    "uri": "https://www.youtube.com/channel/UCTUtqcDkzw7bisadh6AOx5w"
  },
  "published": "2022-08-12T17:00:04+00:00",
  "updated": "2022-08-19T20:51:03+00:00",
  "media:group": {
    "media:title": "Understanding Free Fallin'",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "I thought this one would be easy, but... yeah.\nSupport 12tone on Patreon to help us keep making cool videos! https://www.patreon.com/12tonevideos\n\nI've lived in Los Angeles for over a decade now, so I think it's finally time that I tackle perhaps the most LA song ever written. Free Fallin' is both Tom Petty's celebration and his admonishment of my adopted city, wrapped in layers of complex production and lyrical nuance that challenge listeners to reexamine their concepts of freedom while also being just super fun to sing along with.\n\nMerch: http://standard.tv/12tone\nDiscord: https://discord.gg/pq2QBEw\nFacebook: https://www.facebook.com/12tonevideos\nTwitter: https://twitter.com/12tonevideos\nTwitch: https://www.twitch.tv/12tonevideos\nEmail: 12tonevideos@gmail.com\n\nLast: https://youtu.be/EChz4nq-1Pk\n\nScript: https://tinyurl.com/yxbved7h\n\nHuge thanks to our Elephant Club members:\n\nSusan Jones\nJill Jones\nDuck \nHoward Levine\nBrian Etheredge\nLen Lanphar\nKen Arnold\nElaine Pratt\nWarren Huart\nWilliam (Bill) Boston\nKevin Wilamowski\nGrant Aldonas\nChris Prentice\nJack Carlson\nChristopher Lucas\nAndrew Beals\nDov Zazkis\nHendrik P\nThomas Morley\nJacob Helwig\nDavis Sprague\nKelly Christoffersen\nBraum Meakes\nHendrik Stüwe\nDonal Botkin\nDan Bonelli\nKevin Boyce\nStephen Cook\nDarius Rudominer\nDavid Bartz\nLuke\nDhruv Monga\nKen Jones\nObadiah Wright\nCarlos Rendon\nMichael Mol\nAleksandar Milojković\nKylie McInnes\nJody \nPhilRosas \nReiji Kobayashi\nCatherine Berry\nNeil Moore\nKai\nDamien Fuller-Sutherland\n\nAnd thanks as well to Henry Reich, Gabi Ghita, Gene Lushtak, Eugene Bulkin, Owen Campbell-Moore, Logan Jones, Oliver, Anna Work, Adam Neely, Rick Lees, Dave Mayer, CodenaCrow, Arnas, Caroline Simpson, Michael Alan Dorman, Blake Boyd, Charles Gaskell, Ian Seymour, Trevor Sullivan, Tom Evans, JH, David Conrad, Ducky, Todd Davidson, Chris Borland, Jake Lizzio, Elliot Burke, Aaron Epstein, Chris Connett, Tim S., Elias Simon, Kenneth Kousen, James, h2g2guy, W. Dennis Sorrell, Jerry D. Brown, Ohad Lutzky, Peter Leventis, Symmetry, Professor Elliot, James A. Thornton, Andrew Engel, Stefan Strohmaier, Shadow Kat, Adam Wurstmann, Peter Brinkmann, Angela Flierman, Richard T. Anderson, Kevin Johnson, Joshua La Macchia, Rodrigo \"rrc2soft\" Roman, Jeremy Zolner, Patrick Callier, Danny, Francois LaPlante, Volker Wegert, Britt Ratliff, naomio, Alex Mole, John Bejarano, Gary Butterfield, Betsy, Tonya Custis, Dave Shapiro, Jacopo Cascioli, Steve Brand, Rene Miklas, Red Uncle, Walther, Doug Nottingham, Nicholas Wolf, Graeme Lewis, Jake Sand, Robert Beach, Jason Nebergall, Jim Hayes, Mathew Wolak, Scott Albertine, S, Lincoln Mendell, Sam Rezek, Destros, Lucas Augusto, ZagOnEm, רועי סיני, Evan Satinsky, RaptorCat, Conor Stuart Roe, Jigglypuffer, leftaroundabout ., Jens Schäfer, Mikely Whiplash, Austin Amberg, Dragix PL, Francisco Rodrigues, Michael Tsuk, Kottolett, Dylan Vidas, ThoraSTooth, Brandon Legawiec, Hikaru Katayamma, Rob Hardy, Brian Miller, Patrick Chieppe, Eric Stark, David Haughn, Gordon Dell, Byron DeLaBarre, Matty Crocker, anemamata, Lee-orr Orbach, Eric Plume, Kevin Pierce, Jon Hancock, Bryn Davis, Pamela O'Neill, Thomas Morgan, Ludwick Kennedy, Jason Peterson, Peggy Youell, EJ Hambleton, Jos Mulder, Daryl Banttari, J.T. Vandenbree, Ridley Kemp, Mark James, John Castle, Adam Ziegenhals, Mark, Amelia Lewis, sonicolasj, Kristofer Hill, William Merryman, Ryan Mayle, AkselA, Justin St John-Brooks, Sam Plotkin, David MacDonald, Nellie Speirs Baron, Charles R., Joshua Lewis, type inference, Sam, DialMForManning, Wayne Weil, Joseph Satin, Piush Dahal, Matthew Moore, David T Peterson, Bryan C. Mills, Andrew Wyld, JD White, XCompWiz, Michael Blaby, Bean, A Devoted Servant, Milan Brezovsky, Edmund Horner, Joe Johnston, Jordan Friendshuh, M. Bock, Daniel Joseph Moynihan, Josh Witkowski, (Demilitarized), Graham Orndorff, Claymore Alexander, Dixon Roberts, gunnito, Jason McPherson, Chris Robson, A.J. Yates, Matt Moulder, Leander Tietjen, Alex Tafur, Chris Davis, findRED, Howl’s one-handed, Gary Backaus, Daniel Sim, Eugen Lounkine, Fernando Gros, Geoffrey Barnett, OVB_2nd, William, Joe Molloy, Chris Breault, David Wagner, RoxyPop, Paul Tanenholz, Lev, Douglas Anderson, Foreign Man in a Foreign Land, Vigilance Deadname, Liz Webb, Boomer Dell, Julio D, Justin Zboyovski, Adam Poata-Smith, J.R. Hyde, A, Christopher Beattie, triskadecaepyon, Abie, Charles Jordan, Kelly Walker, William Christie, Stephen Tolputt, and Patterner! Your support helps make 12tone even better!\n\nAlso, thanks to Jareth Arnold!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}