{
  "title": "Valuable Lessons from My Third Year of Freedom",
  "link": "https://www.madfientist.com/third-year-of-freedom/",
  "comments": "https://www.madfientist.com/third-year-of-freedom/#comments",
  "dc:creator": "The Mad Fientist",
  "pubDate": "Thu, 01 Aug 2019 09:20:14 +0000",
  "category": [
    "FIRE (Financial Independence / Retire Early)",
    "Interviews"
  ],
  "guid": "http://www.madfientist.com/?p=6423",
  "description": "<p class=\"lead\">It's been three years since I left my full-time job and this past year was the best one yet!  Here's a short podcast episode with everything I learned.</p>\n<p class=\"more-link-p\"><a class=\"btn btn-danger\" href=\"https://www.madfientist.com/third-year-of-freedom/\">Read more &#8594;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/third-year-of-freedom/\">Valuable Lessons from My Third Year of Freedom</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "content:encoded": "<p>I can&#8217;t believe it but it&#8217;s already been three years since <a href=\"https://www.madfientist.com/time-has-finally-come/\" target=\"_blank\" rel=\"noopener\">I left my full-time job</a>!</p>\n<p>To commemorate this special anniversary and to recap the things I&#8217;ve learned during this last year of post-FI life (which happened to be the best one yet), I recorded a short podcast episode:</p>\n<p><h2>Listen Now</h2><div style='padding:20px'><audio class=\"wp-audio-shortcode\" id=\"audio-6423-12\" preload=\"none\" style=\"width: 100%;\" controls=\"controls\"><source type=\"audio/mpeg\" src=\"http://traffic.libsyn.com/madfientist/third-year-of-freedom.mp3?_=12\" /><a href=\"http://traffic.libsyn.com/madfientist/third-year-of-freedom.mp3\">http://traffic.libsyn.com/madfientist/third-year-of-freedom.mp3</a></audio></div><ul><li>Listen on <a href='https://open.spotify.com/show/5AjnvxZb6ZScoI6KCV0hxo' target='_blank'>Spotify</a> or <a href='https://www.madfientist.com/go/itunes/' target='_blank'>Apple Podcasts</a></li><li>Download MP3 by right-clicking <a href='http://traffic.libsyn.com/madfientist/third-year-of-freedom.mp3' target='_blank' rel='nofollow'>here</a></li></ul></p>\n<p>You may remember that I released similar posts for my <a href=\"https://www.madfientist.com/first-year-of-freedom/\" target=\"_blank\" rel=\"noopener\" aria-label=\"first (opens in a new tab)\">first</a><a href=\"https://www.madfientist.com/first-year-of-freedom/\"> year of freedom</a> and <a href=\"https://www.madfientist.com/second-year-of-freedom/\">second year </a><a href=\"https://www.madfientist.com/second-year-of-freedom/\" target=\"_blank\" rel=\"noopener\" aria-label=\"of (opens in a new tab)\">of</a><a href=\"https://www.madfientist.com/second-year-of-freedom/\"> freedom</a> so if you haven&#8217;t read or listened to those yet, you may want to check them out first.</p>\n<h2>Highlights</h2>\n<ul>\n<li>The importance of saying no (even to fun stuff)</li>\n<li>Why this past year was the best one since leaving my job</li>\n<li>The benefits of taking the initiative</li>\n<li>The problem with inertia and how to change course</li>\n<li>Why I&#8217;ve stopped updating my financial spreadsheet (and what I&#8217;m doing instead)</li>\n</ul>\n<h2>Show Links</h2>\n<ul>\n<li><a href=\"https://www.madfientist.com/james-clear-interview/\" target=\"_blank\" rel=\"noopener\" aria-label=\" (opens in a new tab)\">James Clear&#8217;s Interview</a></li>\n<li><a href=\"https://amzn.to/2CMO54A?tag=madfientist-20\" target=\"_blank\" rel=\"nofollow noopener\" aria-label=\" (opens in a new tab)\">Atomic Habits by James Clear</a></li>\n<li><a href=\"https://www.madfientist.com/ramit-sethi-interview/\">Ramit Sethi&#8217;s Interview</a></li>\n<li><a href=\"https://ftc.gov/equifax\" target=\"_blank\" rel=\"nofollow noopener\" aria-label=\" (opens in a new tab)\">Equifax breach settlement</a></li>\n</ul>\n<p><em>Note: Thanks to my buddy Matt from <a href=\"https://www.cannainsider.com\" target=\"_blank\" rel=\"noopener\" aria-label=\" (opens in a new tab)\">CannaInsider</a> for letting me know about the <a href=\"https://ftc.gov/equifax\" target=\"_blank\" rel=\"nofollow noopener\" aria-label=\" (opens in a new tab)\">Equifax settlement</a>!</em></p>\n<h2>Full Transcript</h2>\n<div class=\"transcript\">\n<p><strong>Mad Fientist:</strong> Hey, what&#8217;s up everybody? Welcome to the Financial Independence Podcast, the podcast that usually gets inside the brains of the best and brightest and personal finance to find out how they achieved financial independence but today&#8217;s episode is going to be a bit different.</p>\n<p>Exactly three years ago, I left my job for good. And to reflect on the past year, I&#8217;m just going to release a episode about my third year of freedom.</p>\n<p>You may remember that in the past couple of years, I released my first year of freedom, my second year of freedom so I figured I might as well keep that going, because I&#8217;ve definitely learned a lot this year and I feel it&#8217;s been my best yet.</p>\n<p>So I&#8217;ll share the reasons why it was better than the first two years and hopefully you can learn from my experiences and not make the same mistakes I did whenever you eventually hit financial independence.</p>\n<p>Just like my first year freedom episode and second year freedom episode, this one&#8217;s probably going to be a lot shorter than usual, but I have a lot of really good interviews lined up for the rest of the year so we&#8217;ll be back to normally scheduled programming in the next episode.</p>\n<p>If you haven&#8217;t listened to my first year freedom episode or second year freedom episodes, I put the links in the show notes so you can check those out first, because I&#8217;m going to build on a lot of the things I talked about in those episodes but I&#8217;m not going to recount everything because there&#8217;s no use repeating myself.</p>\n<p>So I hope this episode is useful to you. And let&#8217;s just get right into it.</p>\n<p>So the first thing I have to mention about this year&#8217;s just how quickly it went by. It was actually really scary how fast this year&#8217;s gone, 2019 in particular. I just can&#8217;t believe it&#8217;s already August.</p>\n<p>I guess it is true that time flies when you&#8217;re having fun, but I would say that this year was actually more progress made on big projects that are important to me rather than simply having fun.</p>\n<p>My problem with my first year after leaving my job was that I just said yes to a lot of commitments, for the Mad Fientist in particular, but for other things, I would just say yes to a lot of things because I was like, why not because I have the time. But by the end of the year, I realized I didn&#8217;t make any progress on the projects that are really important to me.</p>\n<p>So on the second year, I got better at saying no to, you know, just opportunities and things that maybe could earn money or maybe that would help my site grow and things that really didn&#8217;t matter at the end of the day anymore. And I was able to say no to it. But my second year, I would say yes to a lot of fun stuff. So even though I said less to Mad Fientist commitments, I ended up saying yes to lots and lots of really fun things. But it was the same problem. By the end of the year, I realized that I didn&#8217;t actually do a lot of the things that I really wanted to do.</p>\n<p>So this third year was marked by saying no to most things, and even though it&#8217;s hard to do at the time, because you&#8217;re passing up these things that are either an opportunity or that sounds really fun, it&#8217;s actually turned out to be great because I have made a lot of progress on the things that are really important to me. And that definitely gives me more lasting deep happiness than simply you know, just having another fun trip or something.</p>\n<p>Another big change on the other side of the coin is that I&#8217;ve been taking a lot more initiative this year. So last year, I had a really good trip with my entire extended family because one of my cousins was getting married. So we went to the beach and just had this fantastic time. And we don&#8217;t all get together like that very often, only maybe once or twice a decade, if we&#8217;re lucky.</p>\n<p>And after the fact, I was like, &#8220;Oh, that was so good…I wish we could do that more often.&#8221;</p>\n<p>And then I started thinking about it. It&#8217;s like, well, hey, I have all the time in the world and planning is sort of my thing so I can actually just take the initiative, plan something for the following year, and then just see who wants to come.</p>\n<p>So for my grandmother&#8217;s birthday, I was like, well, let&#8217;s all just rent a big beach house again, since that was so fun last year, and we can celebrate that for a week. So during the winter, I put that together and we went and had a fantastic week again and got to see all my family and spend some really quality time together.</p>\n<p>I&#8217;ve also done that with my friends because last year I went to a wedding and got to see some high school friends and really spend some quality time with them when I hadn&#8217;t been a few years. And I was like, &#8220;Man, that was so good…wish we would do that more often.&#8221;</p>\n<p>Rather than just wish that would happen, I actually took the initiative. And now I&#8217;m planning a ski trip for this winner and a potential mountain house visit for a lot of my friends.</p>\n<p>And it&#8217;s been great because I&#8217;m spending a lot more quality time with the people that I care about. And I&#8217;m organizing it and making it happen and things that we wouldn&#8217;t have done otherwise. I&#8217;m using the time and mental bandwidth that FI provides to actually organize these things.</p>\n<p>One thing I want to mention about the saying no is I&#8217;ve realized over the past year just how powerful inertia is so things that you just always do you just keep doing them because you don&#8217;t think to even question it. But I&#8217;ve realized over the past year, how important it is to always ask why and think about why you&#8217;re doing something and whether you still want to do it and the reason for doing it. Because it&#8217;s really easy to just keep doing the same thing, and not really do the things that you want to do.</p>\n<p>So to give you an example, I&#8217;ve been approached to keynote conferences and give talks and things like that and at first, you know, my first inclination is, &#8220;Yeah, that&#8217;d be amazing. That&#8217;s an honor. That&#8217;s very kind of you to ask me. I&#8217;m flattered.&#8221;</p>\n<p>And of course you want to say yes to these things. But then, after reflecting on it for a bit before answering, I was like, &#8220;All right, well, what what is the point? Okay, so I would go to a talk. And yes, I would maybe become more well known as a blogger or more well known in the financial space. And is that important to me at this stage?&#8221;</p>\n<p>No, it&#8217;s not actually because the Mad Fientist has grown to a level that I never expected it would anyway. So it&#8217;s like more growth is not going to make me happier. It&#8217;s already exceeded our expectations and is at a great level where it is.</p>\n<p>And then it&#8217;s like, well, do I want to get better at presenting? Thinking about it, it&#8217;s like, well, yeah, that would be nice to get a new skill, but the amount of hours that would go into preparing for something like that would just definitely dwarf the benefit of getting slightly better presenting or more comfortable with it. And it&#8217;s like, I don&#8217;t want to be a public speaker or some sort of financial media person.</p>\n<p>So all the reasons I could think of to do it don&#8217;t really apply it to my situation. So I ended up declining and it&#8217;s things like that. It&#8217;s like, it is so easy just to say yes to things. So you need to constantly be asking yourself why and think about why you would do something and what the benefits are and weigh it up against the costs, because it&#8217;s really easy for your whole year to just be taken up with things and then you actually don&#8217;t do the things that you really want to do.</p>\n<p>And when you&#8217;re thinking about these things, you have to really think deeply about it. Because sometimes something will seem like a good idea but that&#8217;s just because part of your personality or psyche is like craving something that you don&#8217;t actually want or need. So to go back to the example of, you know, being a keynote speaker at a conference. At first, my ego was like, &#8220;Yes, of course you want to be on stage, you want to be loved by everyone, you want to be well known and liked.&#8221; And that was probably what was driving the initial reaction to say yes to it, but when you take a step back and realize that I don&#8217;t want to be a financial icon that just talks about FI all the time in person and gets on radio shows and TV shows. And it just doesn&#8217;t appeal to me. So it&#8217;s like, okay, even though my ego was like instantly, &#8220;Yes, you want to do this.&#8221; Once you really think about it, you realize that actually, that&#8217;s gonna take up a lot of time when I could be doing something else. And the benefits aren&#8217;t that great, because that&#8217;s not the life I want to live.</p>\n<p>So it&#8217;s surprising how complicated it&#8217;s been and how you always have to keep that in focus. But I feel like this year has been the year that I&#8217;ve actually got to grips with it and have started making some really good decisions that have resulted in a really fun and productive year.</p>\n<p>So you may be wondering why I still do the Mad Fcientist if I said all that, but it really is the most rewarding project and in in the state it is in now, with no further growth or no further expansion, I just feel so lucky to have it. And the main thing that I love about it is just the interaction with all of you out there. I can just put an idea out there and then get lots of feedback on it, lots of interaction, lots of conversation. And it&#8217;s just an amazing thing. And I feel so lucky that I have such interesting, supportive, and intelligent readers and listeners. And I just think that&#8217;s the best thing to have this platform to really dive deep into ideas and subjects that really interests me, and then release it out to the public and get lots of different feedback and interactions.</p>\n<p>A big reason I&#8217;m so excited about the future Mad Fcientist content is that I&#8217;m finally going to be able to share with you the secret project that I&#8217;ve been working on for the last three years, which is really the whole point of why I wanted to reach financial independence in the first place. I haven&#8217;t shared it with you yet because it&#8217;s been an incredible struggle and I didn&#8217;t feel like there was anything I could share to help you because I was struggling so much myself.</p>\n<p>But this year, I finally made some progress and I&#8217;ve learned some things that have helped me make some progress. So I&#8217;m finally in a position that I could share this background story but also then give some advice if you&#8217;re in a similar situation.</p>\n<p>So I&#8217;m really looking forward to finally sharing all that stuff because really, there&#8217;s some articles that I have had as drafts for three years that I&#8217;ve really wanted to share, but I just haven&#8217;t been able to. So the rest of this year is hopefully going to be all focused on that and the podcast episodes are going to be built around that the articles are going to be built around that so make sure you subscribe to the podcast just by pressing the subscribe button wherever you&#8217;re listening to this or subscribing to the email list.</p>\n<p>You can do that at madfientist.com/advice and you can get all of the advice that I&#8217;ve gotten from all my past podcasts guests in nice PDF for free so just head over to madfientist.com/advice and you&#8217;ll be signed up to the email list and you&#8217;ll get notified once these articles and podcasts start coming out.</p>\n<p>So this past year has definitely been the best for productivity and doing things that I really want to do. And it&#8217;s also been the best money-wise as well.</p>\n<p>I finally started to relax a bit more with money. If you&#8217;ve listened to my interview with Ramit Sethi, he has tried to help me be a little bit less extreme with money, because it&#8217;s definitely not necessary at this stage to be so hyper focused on very small spending decisions and it&#8217;s something I&#8217;m trying to work through.</p>\n<p>But it&#8217;s trying to deprogram 30 years of programming because this is I&#8217;ve always been frugal, this is something that I don&#8217;t know where it comes from but I&#8217;ve even growing up my family would make fun of me just for being so focused on money and being so frugal.</p>\n<p>So this is something I&#8217;m working on, and it has actually been helping. One big change I&#8217;ve made over the past few months, actually since Ramit&#8217;s interview, is I&#8217;ve stopped updating my financial spreadsheet, which is crazy to me, because I have all this beautiful data that goes back like a decade, at least and I have just stopped updating it. And the reason for that is, if I know I&#8217;m going to update it at the end of the month, then I&#8217;m going to make certain spending decisions based solely on the number.</p>\n<p>So if I have to buy a flight to the States, and it&#8217;s currently at $550, and I think I could spend 10 hours to get that down to $475, then in the past, that is something I would definitely do, and I would obsess about it. And then I would keep checking after the fact. And recently, I&#8217;ve really tried to stop doing that. And not updating my spreadsheet all the time makes that easier just because I&#8217;m not so then hyper focused on just numbers all the time.</p>\n<p>And I do plan on updating my spreadsheet, maybe quarterly, or maybe semi-annually, or hopefully even annually one day, but at least taking the last few months off has sort of made that easier. And I&#8217;m not simply making decisions just based on finding the lowest cost, which I don&#8217;t think is healthy. And it&#8217;s not to say I&#8217;m going to be wasteful with money or things like that, but it&#8217;s just sort of trying to balance the time and money thing and if I can save $10 by spending three hours doing something in the past, I would have just jumped on that. But now it&#8217;s like, well, that&#8217;s not really a good return on invested time. And the time is actually far more important than the $10 is at this stage.</p>\n<p>So although I&#8217;ve stopped updating my financial spreadsheet as much, I have created a new spreadsheet, unsurprisingly, and it has been tracking all the things that I am wanting to do and what I&#8217;ve done throughout the year. So after reading James Clear&#8217;s book, Atomic Habits, he talks in there about what type of person you want to be and then building appropriate habits so that then you can&#8217;t help but become that type of person.</p>\n<p>So when I read the book, I did that exercise and I thought, okay, I want to be a reader, I want to be healthy, I want to be strong, I want to be creative, things like that. And then I created another page and that spreadsheet to list columns with those things at the top.</p>\n<p>Now, throughout the year, I&#8217;ve just been filling in the cells underneath those column headings. So to give you a few examples, when I did that identity exercise, I said, I want to be a reader, I want to be strong, I want to be creative. So in my spreadsheet, I have columns that say, &#8220;Reader&#8221;, &#8220;Strength&#8221;, and &#8220;Creativity&#8221;. And in the reading column, I simply list all the books that I finished throughout the year. And in the strength column, I list how many days during the month that I went to the gym. And in the creative column, I just list all the things that I created and then published out into the world.</p>\n<p>And it&#8217;s been really, really good because it&#8217;s motivating to keep putting stuff in there. So I tend to read a lot more than I did in years past because I&#8217;m like, oh, I&#8217;ll just add another book to my list. And it also makes me realize that I am accomplishing a lot because one of the problems with having free time and not really having any structure in your day is that you feel like the days just slip away. And it&#8217;s like, &#8220;Did I really even do anything last week, like did I get anything done? Did I do anything fun?&#8221; I can&#8217;t even remember. And having this spreadsheet is like well, actually, I&#8217;ve read a lot of books this year, I&#8217;ve gone to the gym a ton, and I&#8217;ve actually published a lot of things into the world that didn&#8217;t exist before. So having it to look back on is really motivating and it makes me feel better about how I&#8217;m spending my time.</p>\n<p>I&#8217;ve also added another column to that spreadsheet that has been really useful to me this year and that is just listing all of the highlights of the year. So I&#8217;ve talked about this a lot before, people are really terrible at figuring out what makes them happy, and making decisions that make them happier. So even though I think about this stuff a lot and I really try to focus on it, it&#8217;s still difficult to realize, like, Oh, that was a good decision, that was a bad decision. So what I&#8217;ve started doing is I just have another column and that same spreadsheet that&#8217;s just highlights and I list all the highlights of the year and I tried to list them in order of how fun they were, how rewarding the experience was, etc.. And then hopefully that can help me govern what we do next year.</p>\n<p>So it has been really good and although it&#8217;s maybe not as fun as updating my financial spreadsheet, it is really rewarding to do that and try to shift my focus away from money and more on to you know, doing things and creating things and building my new identity and post-FI life.</p>\n<p>So that&#8217;s not to say that I&#8217;ve completely forgotten about money, I&#8217;ve actually made some recent moves that I&#8217;ve been meaning to do for a long time. And that goes back to that whole inertia thing where it&#8217;s like, okay, here are my accounts and my money or the way they are and they&#8217;ve been like that for years now. And it&#8217;s just hard to shift. But when I was preparing to leave my job, I built up a little bit of a cash cushion, because obviously, I didn&#8217;t expect to have any income coming in after leaving. So I wanted to have more cash on hand.</p>\n<p>Then, ironically, that&#8217;s when the Mad Fientist started to make more money so I&#8217;ve never had to tap into that cash reserve. And I&#8217;ve earned more money and yes, I&#8217;ve tried to invest as much as I can over the years to so that I didn&#8217;t build up a huge cash cushion, but it has grown more than it was even then. And like I said, it was already a reasonable cushion because I was expecting to not have any income.</p>\n<p>So it&#8217;s really embarrassing to admit this, but that has mainly just been sitting in various checking accounts over the years, because I&#8217;m always thinking, &#8220;Okay, I don&#8217;t think I&#8217;ll need this cash anymore, so I should invest it.&#8221; But then I just don&#8217;t do anything because it&#8217;s inertia. And there&#8217;s other stuff to do, and there&#8217;s more interesting things to worry about then trying to figure out how much is too much in your checking account and where you should put the excess cash just sat there for a while doing nothing.</p>\n<p>And now, I&#8217;ve just sort of come to the conclusion that I actually like having it there so rather than keep it earning nothing in my checking account, I finally, just this week, opened a savings account.</p>\n<p>And the thing that prompted me to do that is Betterment, which is a company that I&#8217;ve written about and talked about before and I met the founder way back at my first FinCon back in 2013, and went to their offices, and visited their team and everything like that and just really liked the company, like what they&#8217;re doing, like the people behind it. They just released a high-yield savings account and it&#8217;s FDIC insured for up to million bucks.</p>\n<p>So that was the thing that finally prompted me into action and I got off my ass and actually created a savings account and moved a big chunk of the money that was just sitting and checking doing nothing and now at least I&#8217;m earning something.</p>\n<p>If you&#8217;re like I was and you had a bunch of cash sitting on the sidelines doing nothing and you&#8217;re interested in checking out this high-yield savings account, you can go to madfientist.com/savings, and that&#8217;ll take you to the page and if you sign up, the Mad Fientist could get a little referral fee so thanks in advance if you do that.</p>\n<p>There&#8217;s one more money thing that I did want to talk about as well before I start wrapping up and that is the Equifax data breach. I don&#8217;t know if you guys remember this last year, but Equifax lost like 170 million customers information and the information was just like everything you need to get a loan pretty much because it had social security number, address, all that sort of stuff.</p>\n<p>It was a huge ordeal I ended up freezing all my credit reports, which really pissed me off because all the credit bureaus were charging me to freeze my own credit and it&#8217;s like, &#8220;Well, hey, that&#8217;s my data. And I&#8217;m at risk here. And you&#8217;re charging me to freeze my data when you&#8217;re making tons of money off of my data.&#8221;</p>\n<p>It was a huge ordeal and it&#8217;s still a huge ordeal because anytime I want to apply for a new credit card, I have to unfreeze the appropriate credit bureaus report and all this nonsense. So anyway, it took a lot of time and a lot of hassle.</p>\n<p>Luckily, Equifax just got in big trouble with the FTC about it all and they have a settlement where you can claim compensation.</p>\n<p>So you can claim $125 if you don&#8217;t want to take them up on their offer to give you four or six years of credit monitoring or something like that. But I actually submitted a claim for $345 because I tallied up all the hours that it took me to freeze my credit reports, unfreeze them when I&#8217;m applying for <keyword data-keyword-id=\"352\">credit cards</keyword>, I got my credit reports from all three credit bureaus and I looked through them and made sure that there was no fraudulent actions, etc. I tallied up all those hours and I added up all the costs of freezing and unfreezing my credit reports and end up totaling $345. So hopefully they&#8217;re going to be sending me a check for $345 and that will at least make up for some of the time and hassle of going through all that when it was their fault in the first place.</p>\n<p>So even though I just mentioned that time is more important than money these days, I could not help myself from claiming that because I was really angry at the time. So this felt good to do.</p>\n<p>If you&#8217;re interested in doing that, you can go to madfientist.com/equifax and I will link to the settlement page where you can check to see if you are involved in the breach, and therefore have rights to get some of this money. And then it also has the form on there that you can fill in to make a compensation claim for this whole Equifax data breach.</p>\n<p>So I think that&#8217;s everything I wanted to chat to you about today. I can&#8217;t believe it&#8217;s been three years. I really cannot believe that much time has gone by and from two years to three years was just so fast so it&#8217;s scary. Hopefully time starts slowing down a little bit.</p>\n<p>Hopefully you got something out of that and maybe can prepare better for FI or make your post-FI life even more enjoyable if you&#8217;re already there.</p>\n<p>Anyway, thanks a lot for listening and I&#8217;ll be back with a normal episode soon!</p>\n</div>\n<p></p>\n<p><h2>Related Post</h2><div><a href='https://www.madfientist.com/second-year-of-freedom/' target='_blank'><div class='post_card'><div class='post_card_text'><h3 style='color:#399da8;'>Valuable Lessons from My Second Year of Freedom</h3><p class='post_card_excerpt'>It's been two years since I retired from my software career so find out all the valuable lessons I learned during my first two years of freedom!</p></div><div class='post_card_image'><img src='https://www.madfientist.com/wp-content/uploads/2018/07/second-year-of-freedom.jpg' style='border-radius:7px;'/></div></div></a></div></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/third-year-of-freedom/\">Valuable Lessons from My Third Year of Freedom</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "wfw:commentRss": "https://www.madfientist.com/third-year-of-freedom/feed/",
  "slash:comments": 28,
  "enclosure": ""
}