{
  "id": "yt:video:oFIdIVngeYA",
  "yt:videoId": "oFIdIVngeYA",
  "yt:channelId": "UCLXo7UDZvByw2ixzpQCufnA",
  "title": "How trail designers build good hikes",
  "link": "",
  "author": {
    "name": "Vox",
    "uri": "https://www.youtube.com/channel/UCLXo7UDZvByw2ixzpQCufnA"
  },
  "published": "2022-10-07T12:00:39+00:00",
  "updated": "2022-10-09T20:32:17+00:00",
  "media:group": {
    "media:title": "How trail designers build good hikes",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The design secrets that make hiking trails feel “organic”\n\nSubscribe and turn on notifications 🔔 so you don't miss any videos: http://goo.gl/0bsAjO \n\nDesigning a hiking trail seems simple enough: It has to take a person from A to B, pass through scenic nature, and last through years of wear and tear. And for most of human history, trails did that without much intentional design at all.\n\nBut as trails shifted from essential transportation to a recreational destination, the way we make them did, too. Now, hidden in every trail is a carefully made design language of angles, alignment, and materials that keep them enjoyable for generations.\n\nWatch our video to hear trail ecologist Jeffery Marion explain how these principles work — and why they’re more important now than ever.\n\nMake sure you never miss behind-the-scenes content in the Vox Video newsletter, sign up here: http://vox.com/video-newsletter\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com\n\nSupport Vox's reporting with a one-time or recurring contribution: http://vox.com/contribute-now\n\nShop the Vox merch store: http://vox.com/store\n\nWatch our full video catalog: http://goo.gl/IZONyE\n\nFollow Vox on Facebook: http://facebook.com/vox\nFollow Vox on Twitter: http://twitter.com/voxdotcom\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}