{
  "title": "Russia’s Dirty Bomb Claim Is a Dirty Lie",
  "link": "https://www.heritage.org/global-politics/commentary/russias-dirty-bomb-claim-dirty-lie",
  "description": "<p>In the latest in a series of outlandish <a href=\"https://www.heritage.org/global-politics/commentary/russias-claim-chemical-bio-labs-ukraine-ruse\">claims</a> and nefarious <a href=\"https://www.heritage.org/global-politics/commentary/how-russia-might-deploy-nukes-ukraine-war\">threats</a> involving weapons of mass destruction during its war on Ukraine, <a href=\"https://www.washingtonpost.com/world/2022/10/24/dirty-bomb-russia-ukraine-war/?utm_campaign=wp_post_most&utm_medium=email&utm_source=newsletter&wpisrc=nl_most&carta-url=https%3A%2F%2Fs2.washingtonpost.com%2Fcar-ln-tr%2F3835fe3%2F6356b9f2f3d9003c581988dc%2F596c38359bbc0f20865611c8%2F16%2F72%2F6356b9f2f3d9003c581988dc&wp_cu=606b268a0619370b8a17d2a4df8be7b3%7CC0E249D8BBEB3FB5E0430100007FF646\">Russia</a> now asserts that Kyiv plans to explode a “dirty bomb” on its own soil, blaming the radioactive act on Moscow.</p>\n\n<p>This Russian <a href=\"https://www.washingtonpost.com/world/2022/10/24/dirty-bomb-russia-ukraine-war/?utm_campaign=wp_post_most&utm_medium=email&utm_source=newsletter&wpisrc=nl_most&carta-url=https%3A%2F%2Fs2.washingtonpost.com%2Fcar-ln-tr%2F3835fe3%2F6356b9f2f3d9003c581988dc%2F596c38359bbc0f20865611c8%2F16%2F72%2F6356b9f2f3d9003c581988dc&wp_cu=606b268a0619370b8a17d2a4df8be7b3%7CC0E249D8BBEB3FB5E0430100007FF646\">allegation</a> reportedly came in phone calls last weekend between Russian Defense Minister Sergei Shoigu and some Western defense ministers, including U.S. Secretary of Defense Lloyd Austin.</p>\n\n<p>Indeed, <a href=\"https://www.reuters.com/world/europe/russia-hits-ukraine-homes-evacuates-kherson-warns-escalation-2022-10-24/\">Russia</a> reportedly is going to bring this issue before the U.N. Security Council this week.</p>\n\n<p><a href=\"https://www.washingtonpost.com/world/2022/10/24/dirty-bomb-russia-ukraine-war/?utm_campaign=wp_post_most&utm_medium=email&utm_source=newsletter&wpisrc=nl_most&carta-url=https%3A%2F%2Fs2.washingtonpost.com%2Fcar-ln-tr%2F3835fe3%2F6356b9f2f3d9003c581988dc%2F596c38359bbc0f20865611c8%2F16%2F72%2F6356b9f2f3d9003c581988dc&wp_cu=606b268a0619370b8a17d2a4df8be7b3%7CC0E249D8BBEB3FB5E0430100007FF646\">Kyiv</a> rejected the latest Russian disinformation attempt out of hand, seeing it as an effort to justify the significant escalation in violence recently meted out by Moscow’s forces on Ukrainian civilians and critical infrastructure.</p>\n\n<p>Kyiv also offered to open two nuclear sites to inspectors from the <a href=\"https://www.reuters.com/world/europe/iaea-preparing-inspect-two-sites-ukraine-over-dirty-bomb-claims-2022-10-24/\">International Atomic Energy Agency</a> to debunk Moscow’s accusation.</p>\n\n<p>Moscow also likely is trying to undermine outside support for Kyiv with this outrageous allegation, believing that Washington, Paris, London, and NATO would see such a plan by Kyiv as particularly egregious.</p>\n\n<p>OK, so what is a so-called dirty bomb?</p>\n\n<p>A dirty bomb is a weapon that uses conventional high explosives to spread radioactive material that could be potentially gathered from common research, industrial, energy, and medical (e.g., nuclear medicine) sources and processes.</p>\n\n<p>Such a bomb might be planted on foot or moved in a vehicle to the location of the target. A sophisticated missile or delivery system is not required; a dirty bomb can be relatively small.</p>\n\n<p>Depending on the explosive yield of the weapon and the amount of radioactive material contained within, it could be used to target a relatively small area such as an important government building, civilian apartments, or a few city blocks. </p>\n\n<p>But a dirty bomb is not a nuclear weapon per se.</p>\n\n<p>The explosion of a dirty bomb wouldn’t produce the tremendous pressures, temperatures, and electromagnetic pulses characteristic of a strategic or tactical nuclear weapon found today in Russia’s, China’s, or America’s military arsenals, for example.</p>\n\n<p>There would be no classic mushroom cloud.</p>\n\n<p>Upon detonation, a dirty bomb would disperse invisible, potentially life-threatening levels of radioactivity, which then possibly could move beyond the blast area via wind currents, affecting more people as well as food and water sources.</p>\n\n<p>Depending on the explosive yield of the dirty bomb, it might not even cause a significant number of casualties. But victims who are not killed by the blast could be harmed over time by exposure to the radioactive material.</p>\n\n<p>The release of radioactive material in an area likely would hamper rescue and recovery operations—even make the blast area uninhabitable for a period due to the contamination. Chaos and refugee flows are possible.</p>\n\n<p>Indeed, a dirty bomb is more a weapon of mass disruption than a weapon of mass destruction.</p>\n\n<p>Because of its potentially significant political and psychological impact, the availability of materials, and relative simplicity of construction, serious concern arose about terrorist use of a dirty bomb after the 9/11 attacks.</p>\n\n<p>Thankfully, that never came to pass.</p>\n\n<p>Although the likelihood of Kyiv’s detonating a dirty bomb on its own soil—but blaming Moscow—is zero, Russian use of a dirty bomb (or other nuclear weapon) in Ukraine is not, considering the recent desperate state of Russia’s military operations.</p>\n\n<p>Escalation across the nuclear threshold in Ukraine with a Russian tactical nuclear weapon—or dirty bomb—is possible.</p>\n\n<p>One thing is for sure: Russia’s attempts at <a href=\"https://www.heritage.org/global-politics/commentary/russias-claim-chemical-bio-labs-ukraine-ruse\">disinformation</a> and <a href=\"https://www.heritage.org/global-politics/commentary/how-russia-might-deploy-nukes-ukraine-war\">nuclear blackmail</a> are sure to continue as Moscow presses its widely destabilizing, unjust war on Ukraine’s sovereignty and territorial integrity.</p>\n\n<p><em>This piece originally appeared in <a href=\"https://www.dailysignal.com/2022/10/26/russias-dirty-bomb-claim-is-a-dirty-lie/\">The Daily Signal</a></em></p>",
  "pubDate": "Fri, 04 Nov 2022 17:40:29 -0400",
  "dc:creator": "Peter Brookes",
  "guid": "https://www.heritage.org/global-politics/commentary/russias-dirty-bomb-claim-dirty-lie"
}