{
  "title": "David Blackwell stories",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/18/david-blackwell-stories/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/18/david-blackwell-stories/#comments",
  "dc:creator": "Jessica Hullman",
  "pubDate": "Tue, 18 Oct 2022 18:15:24 +0000",
  "category": [
    "Decision Theory",
    "Miscellaneous Science",
    "Miscellaneous Statistics"
  ],
  "guid": "https://statmodeling.stat.columbia.edu/?p=48108",
  "description": "This is Jessica. Recently I got asked, on a podcast, what famous scientific figure alive or dead, real or fictional I would have dinner with, and for the sake of choosing someone who was both brilliant and sounds like an &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/18/david-blackwell-stories/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p><span style=\"font-weight: 400\">This is Jessica. Recently I got asked, on a podcast, what famous scientific figure alive or dead, real or fictional I would have dinner with, and for the sake of choosing someone who was both brilliant and sounds like an inspiring person to be around, I said David Blackwell.</span></p>\n<p><span style=\"font-weight: 400\">I didn’t really know Blackwell’s work until maybe a year or year and a half ago, when I was introduced to Blackwell Ordering by a colleague. It’s a way of quantifying the instrumental value of some information generating process (aka channel or experiment or information structure) before the state of the world realizes. Imagine we have two different forecasts for predicting who will win an election, based on some set of signals like poll results, and we can choose which one to consult to make some decision, like how much of our time or money we will allocate to help our preferred candidate prior to an election. How do we decide, given that the value we get out of the forecast (assigned by some real valued payoff function) will depend on the decision we make and the state that ultimately realizes? If we know the probability distribution over the possible signals for each possible state of the world, then Blackwell’s theorem tells us that under certain conditions we can choose which forecast to use even without knowing the specific utility function or the distribution over inputs that we are dealing with. The constraint that needs to be satisfied is that one information structure needs to be a “garbling” of the first (or in Blackwell’s terms, the first needs to be sufficient for the second), meaning that we can represent the second as what we get when we apply some post-processing operation to the first (where both are represented in matrix form).</span></p>\n<p><span style=\"font-weight: 400\">Once we establish that one forecast is sufficient for the other, we know the second one can’t give us more information about the state: Blackwell showed that the expected utility of deciding using the optimal strategy for the original (non-garbled) forecast is always at least as big as using the optimal strategy with the garbled forecast. This is not just for one particular instantiation of a decision problem, but for any input distribution or utility function</span><i><span style=\"font-weight: 400\">. </span></i><span style=\"font-weight: 400\">So, the ordering gives a concise summary of the statistical conditions under which one experiment is more informative than another. I’m not sure the extent to which work like Blackwell’s, which he did in the early 1950’s, directly influenced later learning theories that are similarly agnostic to the input distribution, like PAC learning, but this way of thinking seems ahead of its time. When I first learned about it, I found Blackwell ordering exciting because I was frustrated with how dependent our knowledge of what makes a better visual representation of uncertainty tends to be on specific decision setups that researchers study. So the idea of theory for doing </span><span style=\"font-weight: 400\">unconditional analysis of information structures reflecting uncertainty around some outcome was like a missing piece I was looking for. Since then I’ve been paying more attention to other work on the value of information, such as in economics. </span></p>\n<p><span style=\"font-weight: 400\">More recently I learned more about some of Blackwell’s other major contributions, like approachability. The original formulation asked under what conditions we can expect the row player in a minimax game with vector payoffs to be able to get his payoffs to approach some target set, making it a generalization of minimax for vector payoffs. But there are connections to online learning and forecasting; it turns out Blackwell&#8217;s result implies <a href=\"http://proceedings.mlr.press/v19/abernethy11b/abernethy11b.pdf\">no-regret learning</a> and </span><a href=\"https://repository.upenn.edu/cgi/viewcontent.cgi?article=1006&context=statistics_papers\"><span style=\"font-weight: 400\">calibration</span></a><span style=\"font-weight: 400\">. There’s also Rao-Blackwell theorem, which says that (at least with enough data) it’s possible to make a better estimator of your parameter by taking the conditional expected value of your estimator given some sufficient statistic for that parameter.</span></p>\n<p><span style=\"font-weight: 400\">This fall I attended a </span><a href=\"https://simons.berkeley.edu/workshops/datadriven-2022-bc\"><span style=\"font-weight: 400\">workshop on data-driven decision processes</span></a><span style=\"font-weight: 400\">, where there was a day devoted to Blackwell. Some of these were by people who spent time around him, and shared anecdotes about what he was like to work with. He sounds like an inspiring person to be around, someone who undoubtedly experienced a lot more pushback along the way that most of his faculty peers but continued to make major contributions and positively affect the people around him in all sorts of ways. Someone mentioned for instance how he had high standards for communicating ideas in the most direct, comprehensible way, like when teaching, which I respect. There are talks listed under the last day </span><a href=\"https://simons.berkeley.edu/workshops/schedule/16924\"><span style=\"font-weight: 400\">here</span></a><span style=\"font-weight: 400\"> that cover his work and influence for those that are interested.</span></p>\n<p><span style=\"font-weight: 400\">However, there is one anecdote that I keep coming across as I’ve been finding out more about Blackwell&#8211; not about Blackwell himself but about his experience as a Black statistician&#8211;that I have to complain about. It involves Blackwell’s first interactions with the UC Berkeley math department, which then contained statistics, where he later spent years as a professor and chair.  Apparently, he was considered as a hire in 1942 but was not extended an offer, because of racism. Many accounts describe how the offer was blocked by the spouse of a faculty member, e.g., “</span><span style=\"font-weight: 400\">Blackwell would later in his career find out the then head of the math department’s wife protested Blackwell’s hiring. It was customary to host faculty members in their home and the wife objected to hosting a black man in her house.”, or “</span><span style=\"font-weight: 400\">Blackwell was blocked by one of the ‘faculty wives.’” Or, put differently: “</span><span style=\"font-weight: 400\">In 1954, after an initial attempt in 1942, which failed due to the racial prejudice of some faculty families, Blackwell was appointed Professor.”</span></p>\n<p><span style=\"font-weight: 400\">To be clear, I do not doubt that someone’s wife (or more specifically, the chair’s wife as some records describe) protested to Blackwell getting hired. Racism is not hard to find even now, so pre-civil rights era it does not seem surprising that some professor’s wife would have made blatantly racist comments. And I’m glad that the bias that Blackwell had to deal with during his life is brought to light in recounting his career. </span></p>\n<p><span style=\"font-weight: 400\">But… isn’t it a little odd, so long after the fact, to be talking about someone’s wife as the reason Blackwell wasn’t offered a job in what was presumably at the time an all or mostly male department? I respect that speakers and authors who retell this want to acknowledge the racism Blackwell experienced in the mostly white academic institution, and I can understand why some of the original faculty involved might have been frustrated by the influence of someone’s wife. But eighty years later, it seems kind of weird to hear this retold, as if we’re going out of our way to put the blame on some woman who wasn’t even part of the department. The optics distract from the more interesting story of who Blackwell was.</span></p>\n<p><span style=\"font-weight: 400\">I doubt the reasons for bringing up this particular anecdote are to intentionally redirect blame, so much as people have heard it and decide to echo it to tell a more entertaining story. From looking around online it seems like it originated from a biography on Neyman written by Constance Reid. </span></p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/18/david-blackwell-stories/feed/",
  "slash:comments": 15
}