{
  "title": "57: Susan Anderson on Healing from Abandonment, Heartbreak, and Loss",
  "pubDate": "Wed, 21 Sep 2016 01:17:14 +0000",
  "guid": "c0c62ceb9f32a8b10fc57bc6c7650717",
  "link": "https://lifeonpurpose.libsyn.com/57-susan-anderson-on-x",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #57</strong>, my guest is author and psychotherapist <strong>Susan Anderson</strong>, who has devoted more than 30 years of clinical experience and research to working with the victims of abandonment trauma, grief, and loss and teaches people around the world how to overcome abandonment and its aftermath of self-sabotaging patterns.<br /> <br /> <strong>Susan</strong> joined me for a powerful chat about her new book, <em>The Abandonment Recovery Workbook: Guidance through the Five Stages of Healing from Abandonment, Heartbreak, and Loss,</em> as well as how her own life journey paved the way for her most powerful work, and MUCH more!<br /> <br /> <em>“Learning the steps to take after surviving a great loss is a hopeful process. You discover your ability to benefit from the experience rather than be diminished by it,” says Anderson. “Many of you are going through heartbreak, getting separated or divorced, or feel isolated and alone. Many of you are grieving over someone close to you who has died. Some seek recovery from childhood wounds that impinge on the quality of your current life. But our journey will take us beyond the specifics of your loss, all the way to the underlying source of the fear and despair —abandonment — the crux of the human condition.”</em><br /> <br /> About: <strong>Susan Anderson</strong> is a psychotherapist who has devoted over 30 years of clinical experience and research to working with the victims of abandonment trauma, grief, and loss. Author of Taming your Outer Child: Overcoming your Self Defeating Patterns; Journey from Abandonment to Healing; Black Swan: Twelve Lessons of Abandonment Recovery; and The Abandonment Recovery Workbook, she is founder of the Abandonment Recovery movement, a worldwide program of techniques and support groups that help people heal their abandonment wounds past and present, overcome their self-defeating “Outer Child” patterns, and find greater life and love.<br /> <br /> Through extensive clinical research, group work, and scientific study, she has developed a treatment protocol specific to overcoming the impact of abandonment trauma in adults and children. Her five universal stages of abandonment recovery (Shattering, Withdrawal, Internalizing, Rage, and Lifting) are based upon scientific findings related to the psychobiology of separation and attachment. Through her books and public appearances, she shares her own experiences with abandonment, grief, and recovery, speaking passionately from personal and professional experience.<br /> <br /> In addition to her national tours to promote abandonment recovery, she continues in private practice in Manhattan and Long Island.<br /> <br /> To learn more about <strong>Susan</strong> and her work, visit: <a href= \"http://www.abandonment.net/\">http://www.abandonment.net/</a>.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #57, my guest is author and psychotherapist Susan Anderson, who has devoted more than 30 years of clinical experience and research to working with the victims of abandonment trauma, grief, and loss and teaches people around the world how to overcome abandonment and its aftermath of self-sabotaging patterns.  Susan joined me for a powerful chat about her new book, <em>The Abandonment Recovery Workbook: Guidance through the Five Stages of Healing from Abandonment, Heartbreak, and Loss,</em> as well as how her own life journey paved the way for her most powerful work, and MUCH more!  <em>“Learning the steps to take after surviving a great loss is a hopeful process. You discover your ability to benefit from the experience rather than be diminished by it,” says Anderson. “Many of you are going through heartbreak, getting separated or divorced, or feel isolated and alone. Many of you are grieving over someone close to you who has died. Some seek recovery from childhood wounds that impinge on the quality of your current life. But our journey will take us beyond the specifics of your loss, all the way to the underlying source of the fear and despair —abandonment — the crux of the human condition.”</em>  About: Susan Anderson is a psychotherapist who has devoted over 30 years of clinical experience and research to working with the victims of abandonment trauma, grief, and loss. Author of Taming your Outer Child: Overcoming your Self Defeating Patterns; Journey from Abandonment to Healing; Black Swan: Twelve Lessons of Abandonment Recovery; and The Abandonment Recovery Workbook, she is founder of the Abandonment Recovery movement, a worldwide program of techniques and support groups that help people heal their abandonment wounds past and present, overcome their self-defeating “Outer Child” patterns, and find greater life and love.  Through extensive clinical research, group work, and scientific study, she has developed a treatment protocol specific to overcoming the impact of abandonment trauma in adults and children. Her five universal stages of abandonment recovery (Shattering, Withdrawal, Internalizing, Rage, and Lifting) are based upon scientific findings related to the psychobiology of separation and attachment. Through her books and public appearances, she shares her own experiences with abandonment, grief, and recovery, speaking passionately from personal and professional experience.  In addition to her national tours to promote abandonment recovery, she continues in private practice in Manhattan and Long Island.  To learn more about Susan and her work, visit: <a href= \"http://www.abandonment.net/\">http://www.abandonment.net/</a>.</p>",
  "enclosure": "",
  "itunes:duration": "56:15",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #57, my guest is author and psychotherapist Susan Anderson, who has devoted more than 30 years of clinical experience and research to working with the victims of abandonment trauma, grief, and loss and teaches people around..."
}