{
  "title": "Parallel Structures Are the Only Way to Freedom",
  "link": "https://mises.org/node/60797",
  "description": "<p>The battle for political supremacy in the West has been decided. The so-called progressives have won; conservatives and libertarians have lost. The “march through the institutions,” started by the misguided 1968 generation, has been successful, and their children and grandchildren are now at the helm. Eco-socialist, cultural Marxist, in short: <strong><em>bolshewoke</em></strong> ideas prevail in politics and culture, public administration, media, schools, universities, and increasingly even in business. At accelerating speed. If you have kept the same center-left viewpoint over the remaining twenty years, you are considered far right today.</p>\n<p>In virtually all Democratic states, there is a tendency for larger organizations to drift to the left over time. This applies equally to television stations, newspapers, political parties, state authorities, universities, and other associations.</p>\n<p>Why is this so? The explanation is twofold:</p>\n<p>First, if you like to create things or projects on your own, or prefer to work for making a living and then enjoying private life with your family, you are probably less inclined to join any of these institutions. On the other hand, if you like to manipulate other people and control them, you are very much inclined to join these institutions.</p>\n<p>The first position correlates rather with conservative positions, the second rather with progressive positions. And precisely because the most fundamental characteristic of Progressive ideas is that they do not work, Progressives concentrate in institutions where ideas do not have to work in order to survive. That is why Progressives are disproportionately found in professions where economically measurable results do not have to be achieved.</p>\n<p>Thus, Progressives are often media people, teachers, professors, politicians, or otherwise employed in government service or tax-funded nongovernmental governmental organizations. This has the additional effect that they can then use this position to agitate and discredit permanently, while their victims are busy proving themselves on the market, earning their own living and also supporting their Progressive opponents through taxes.</p>\n<p>Second, conservatives and libertarians tend to be more tolerant toward differing political positions. If someone is known as a leftie in their organization, mostly they would allow this person to stay. Not so with the Progressives: They want to missionize and force all nonprogressive fellow citizens, whom they consider either unenlightened or bribed, to a happiness defined by them. Progressives only give a position in an organization to those who have the same world view and kick out dissenters by all means.</p>\n<p>And this is how it has been going on for decades in newsrooms, broadcasting stations, universities, and authorities. Whoever is not of their opinion is defamed, suppressed, slandered. As a result, most of these institutions have been irreparably destroyed and can no longer be reformed with reasonable effort.</p>\n<p>If one can mobilize $50 billion like Elon Musk, then one can take over Twitter. But it will still be difficult to turn the platform into a beacon of <em>freedom of speech</em> as planned. That’s because virtually the entire workforce tends politically to the left (relation of donations of Twitter employees in the Biden-Trump presidential campaign: 98:2). Since the majority of these people are convinced they are in the right and fighting for a good cause, Musk’s attempts to allow dissent will be sabotaged. Musk will have to replace large parts of the workforce to change this in the long term.</p>\n<p>Comparable things apply to newspapers, TV stations, administrations, including the leadership of the armed forces and police, the courts, and practically all educational institutions. Reforms in the sense of a freedom-oriented policy are not impossible but extremely difficult, and they will probably be watered down, because existing sensitivities have to be taken into account.</p>\n<h4>Not Forcing People to Be Happy</h4>\n<p>We have also to keep in mind that every new generation of students is released into the voting age even more tightly ideologized, thus producing more and more streamlined voters, who are no longer reachable by argumentation and who are not even willing to expose themselves to competing arguments. They learn that the state solves all their problems. Only a minority is able to break out of this framework by own efforts of thought.</p>\n<p>Why force these people to be happy against their will? This only makes you unpopular and them angry. Rather, those who refuse for life to become adults, and thus self-responsible individuals, should bear the consequences themselves, And the consequences will be serious. One only has to reflect that almost <em>everything</em> that the woke mainstream claims and that is more or less absorbed by the people, is wrong and the politics based on it will therefore <em>inevitably</em> fail.</p>\n<p>For example, take the idea that an industrialized country can be supplied with wind power and solar energy only, or the conviction that the world’s population can be fed with organic food without any fertilizers and pesticides, the idea that one can impose all kinds of planned economic requirements on the economy without any major loss of prosperity, or the idea that one can increase the money supply at will without triggering massive inflation sooner or later.</p>\n<p>Or take the complete refusal to subject drastic measures to a harm-benefit analysis, for example measures against covid, against climate change, or against Russia. Take the idea that man and woman are social constructs and that there are more than two genders, or the conviction that all people are exactly the same and can perform all tasks equally well with the appropriate education, or the idea of preventing or sanctioning free speech for an alleged good cause, and so on. Errors accumulated over decades, now add up to a veritable delusion and inevitably to a downfall.</p>\n<h4>Learning through Pain</h4>\n<p>The message is that the small number of advocates of freedom should not waste their energy trying to change systems from within that can no longer be repaired. The drastic cure, rather, is to allow total and irrevocable failure of these systems, learning through pain. Only this will drive the eco-socialist insanity out of people’s minds to some extent. This cup must now be finished to the end.</p>\n<p>This is not an easy medicine, as many people will suffer as a result, including those who saw the disaster coming and warned in time. But this is the only way to achieve a sustainable change in thinking and thus a turning away from statist collectivism and toward personal responsibility, which by all means also includes caring for others. The opposite of political collectivism is not selfish individualism, it is self-determination. And this is a concept beyond left or right.</p>\n<p>The main insight is this: there is no right to live at the expense of others. Of course, we can and should feel morally obliged to help people who cannot help themselves, especially amongst family and friends. And we can take over respective contractual obligations, like in a marriage. But there is no <em>human right</em> to sue unrelated others for providing you a living.</p>\n<p>This insight is crucial for a peaceful future beyond an all-powerful state, so let us work it out a bit.</p>\n<p>Over time, instead of limiting human rights to liberty, the well intentioned have added more and more so-called participation rights. These include rights such as the right to work, the right to free education, the right to a humane existence with housing, clothing, medical care, “satisfactory remuneration” and so on. Sounds good, but what is completely lacking is the understanding that these rights can only be asserted at the expense of third parties and only by an all-powerful state. They are in direct conflict with the human rights to liberty.</p>\n<p>If I cannot afford a “humane” apartment, then someone else has to pay for it. Who enforces this against whom and who decides what constitutes a humane existence? As things stand, this can only be the state, which thereby intervenes in the property rights and freedom of action of its citizens.</p>\n<p>In other words, the fundamental liberty rights originally conceived as a right of defense against the state, are transformed now into powers of intervention which the state has against its citizens and which cannot or must not defend themselves against them. It is therefore not surprising that the existence of particpation rights has become a constant cause of struggles for distribution. Endless political struggles.</p>\n<p>The recent idea of an <em>universal basic income</em> is only the logical consequence of believing that you have the right to live at the expense of others without having to pay anything in return. This doesn’t add up, of course. Ultimately, it can only be at the expense of those who generate surpluses that can then be taken away from them. This discourages them. Finally, the state will have to force them to work in order to earn the basic income for the others. In another context, this configuration is called slavery.</p>\n<p>Rights at the expense of third parties are in truth privileges. They are an aberration that causes considerable discord. Properly understood, there is only one essential human right—namely, the right to be left alone, in order to be able to lead one’s self-determined life. All other human rights are either legitimate derivatives thereof or illegitimate privileges at the expense of third parties.</p>\n<p>Only when these insight has been internalized can a new era dawn.</p>\n<p>Otherwise, after the downfall, there will be only a lukewarm reform by “moderate” professional politicians, which will lead to the fact that a few years later, the very forces that caused the mess will be in charge again.</p>\n<h4>Room for Maneuver for Freedom Seekers</h4>\n<p>The good news is that freedom-oriented persons, be they libertarian, classical liberal, conservative, or whatever, do not have to wait idly for this collapse, which can also mean a long decline instead of a big bang. Instead, parallel structures can be set up immediately. The big advantage is that you don’t need a majority to do it and that you can make an immediate difference by yourself. After all, successful parallel structures have a role model effect that will come to full fruition when the existing systems fail more and more.</p>\n<p>Admittedly, there is a catch. You actually have to do something about it—namely, get out of your comfort zone. It won’t be enough just to write know-it-all articles or comments in the online media or to participate in petitions and demonstrations. You have to create something new based on your own actions. That is exhausting.</p>\n<p>But in return a meaningful existence beckons, creating the seed for a better and above all freer world. Even if it is not completely successful in our lifetime, the seed is sown for future generations. And really everyone can participate and everyone is needed.</p>\n<p>Unlike the other side, such undertakings happen at one’s own expense and in recognition of reality, instead of delusional narratives. They are accompanied by a willingness to face the competition of ideas and systems. Only through this pressure of competition can permanently stable and antifragile structures be established.</p>\n<p>Whoever relentlessly evaluates himself or herself and their situation, gains sovereignty over the present, which, as hard as it may be, nevertheless confronts one with selectable options for action. Conversely, those who do not want to make this cognitive effort, deserve only the status quo.</p>\n<h4>To Work</h4>\n<p>The progressive regime bases its power primarily on absolute domination of the media, the cultural sector, central banks, and educational institutions. These areas in particular are therefore candidates for the creation of parallel structures, along with alternative systems of living together.</p>\n<p>What they have in common is not to focus on reforming existing systems, but to make them obsolete through better models. What is at stake is nothing less than the creation of parallel societies and parallel elites.</p>\n<h4>Media</h4>\n<p>The media domination has of course not gone unnoticed by critical minds and so, thanks to the Internet, countless new media have emerged, with widely varying quality. This includes alternatives to social media.</p>\n<p>There are journalists who have managed to attract an audience of millions just on the strength of the quality and impartiality of their work, such as Joe Rogan in the USA or Boris Reitschuster in Germany. They are flanked by numerous bloggers who tirelessly bring new points of view and facts to light.</p>\n<p>The former gatekeepers are now striking back with attempts of technical and legal censorship, but the genie will not go back into the bottle. That’s good.</p>\n<h4>Culture</h4>\n<p>New libertarian heroic figures in books like Charles Knight or Carl Brun have what it takes to reach broad audiences. In the case of a film adaptation, you could even create new cult series. In the film and music sector, so many artists have been canceled recently that it is becoming easier by the day to find one who actively participates in the construction of an alternative counterculture instead of submissively crawling back into the woke herd.</p>\n<h4>Education</h4>\n<p>In order to protect our children from brainwashing, we urgently need parallel structures in education. Keep in mind that in many countries, homeschooling is forbidden.</p>\n<p>Luckily, home schooling always has promoted alternative offerings and numerous educational possibilities are emerging, including completely new, “nonwoke” universities like the University of Austin in Texas.</p>\n<p>In this sector, too, many approaches are likely to fail, especially those that dispense with knowledge transfer and performance measurements. Such a selection process is something quite normal in new markets. Only through trial and error, and imitation and duplication of successful models, can a better system be created. This is how evolution works. Nothing is wrong with that.</p>\n<p>As everywhere, competition stimulates business. Here is my proposal: For an alternative school education, historic human development should be taken as a yardstick—in addition to the classical curriculum—and children be taught not only the knowledge but also the appropriate skills, at least in the basics. Staggered according to age group, with increasing degree of difficulty, starting with making fire, building a wall, sewing clothes up to metallurgical and computer-based processes.</p>\n<p>Young people with the appropriate education would not only be capable of survival and self-confidence on the basis of the work of their own hands, but were also able to understand from their own experience why the world is where it is today, especially in technological and economic terms.</p>\n<p>The litmus test for true education must be: Suppose you were transported by time machine back to the Stone Age or the Middle Ages, could you teach people there anything meaningful?</p>\n<h4>Finance</h4>\n<p>In finance, parallel structures are the most advanced. The monopoly of state money and central banks has already been broken by bitcoin and other cryptocurrencies. The importance of this cannot be overstated. Basically, this fulfills <em>Hayek’s</em> call to take the monopoly of money away from governments so that we don’t keep running into currency disasters every couple of decades.</p>\n<p>Anyone who can pay directly from person to person without having to ask permission from intermediaries such as banks is naturally a danger to the regime. This is especially true in times when unwelcome critics regularly have their bank accounts terminated.</p>\n<p>Therefore, we can still expect a fierce battle here, with efforts to ban bitcoin under the guise of saving energy. It is precisely the energy crisis that can be used by the very establishment responsible for it, to ban unwelcome parallel currencies like bitcoin. Sadly, probably to the applause of the masses.</p>\n<p>But this genie is out of the bottle too and will not be pushed back completely. Even if bitcoin will be banned in many countries, it will not be banned everywhere and there are enough successors and variants, including gold-backed payment systems.</p>\n<h4>Politics and Social Systems</h4>\n<p>The most difficult issue is the creation of new systems of living together—that is, new political or social orders. Current political systems are characterized by false incentives for both the rulers and the governed. The rulers are not liable and have no economic disadvantages if they make bad decisions. The governed are led to believe that they can vote “free” benefits into their pockets. This politicizes the state’s monopoly on the use of force and leads to constant changes in the “social contract.” The result is a constant struggle to influence these changes in a particular direction.</p>\n<p>Penetration of this market is particularly difficult because it usually requires secession, revolution, or at least the winning of an absolute majority in elections. Again, however, there are parallel structures that are easier to accomplish.</p>\n<h4>Free Private Cities</h4>\n<p>I have already proposed a peaceful and voluntary alternative: <a href=\"https://free-cities.org/free-private-cities-whitepaper/\">free private cities</a>. A free private city is characterized by the fact that it is organized by a for-profit company, the city operator, who acts as a “government service provider.” This operator may also be partially or wholly owned by citizens.</p>\n<p>In this capacity, the operator guarantees its citizens the protection of life, liberty, and property. The services provided by the operator include internal and external security, a predefined legal and regulatory framework, and an independent dispute resolution system. Participation is 100 percent voluntary.</p>\n<p>Interested individuals and companies enter into a “citizen contract” with it and pay a fixed annual fee for these services in lieu of taxes. Within this framework, a “spontaneous order” can develop, resulting from the voluntary activities and decisions of citizens.</p>\n<p>The operator cannot later unilaterally change the citizen contract without the consent of the citizen concerned. Disputes between citizens and the operator are heard by external arbitration tribunals, as is common in international commercial law. If the operator ignores the arbitration awards or abuses its power, its customers leave and it faces insolvency.</p>\n<p>Since all land is currently controlled by governments, the establishment of a free private city requires the operator to enter into a contractual agreement with an existing state. In this agreement, the “host nation” grants the operator the right to establish the free private city on a certain territory under certain conditions, which include legal autonomy in various areas.</p>\n<p>States may be willing to relinquish some of their power in exchange for promised benefits. These include, for example, job creation, foreign investment, and a share of the profits generated by the operator. The existence of a large number of special economic zones around the world demonstrates the basic willingness of countries to go down this path.</p>\n<p>Free Private Cities do have a chance. That’s because people don’t want to be subjugated by rules and regulations that they have not consented to. People don’t want to pay for things they have not ordered. And reasonable people don’t need hundreds or thousands of laws to live peacefully together. People need a safe space where they can congregate and cooperate peacefully, but are otherwise left alone by coercive authorities. Free Private Cities can deliver these human desires. The existing political systems cannot. It is for this reason that Free Private Cities have a chance to succeed. Since eventually, people will go where they are treated best.</p>\n<p>Admittedly, it is not an easy path, and even in countries open to it, it requires years of negotiations and legislative changes. Nevertheless, it must be taken; me and others are working on it or comparable models, and the first emerging economies, such as Honduras, have embarked on it. Further projects in Africa and Central America are in the pipeline. However, in Honduras, the empire is striking back already after a socialist election victory. The irony is that the very politicians who want to get rid of the most innovative forms of governance in the world, the Honduran zones for economic development and employment (ZEDEs), call themselves “Progressives.”</p>\n<p>Be it as it is, the momentum is there, and there is now a Free City movement around the world that wants to try out alternative forms of government. Be it free private cities, prosperity zones, charter cities, bitcoin cities, and the like.</p>\n<h4>Intentional Communities</h4>\n<p>However, in most places, governments are not willing to grant even a limited autonomy. What to do? In my view, the best thing is what Prussian military strategist Carl von Clausewitz advised: “First create a secure base.”</p>\n<p>Small and smallest units by the citizens themselves can be created within the existing system, by taking advantage of the remaining niches of freedom in contract law and cooperative law. It is also easier to rally a critical mass of like-minded people than to win nationwide elections. Cooperation between many small units on a contractual basis can also be more efficient organizationally and financially, politically conflict-free, and culturally autonomous, especially in the digital age. This approach can be institutionalized—namely, by founding an intentional community, on a contractual basis or as a cooperative on a defined piece of land.</p>\n<p>There are already purely idealistic value communities and settlements that often have collectivist and egalitarian ideals (community ownership, veganism, equal pay for all, etc.). They are usually attached to a single strong leader. Their main problem is that they usually fall apart relatively soon due to the undeniable diversity of people and their interests.</p>\n<p>Therefore, successful intentional communities should intervene as little as possible in the way their members shape their lives, but should rather have “live and let live” as their motto. They should merely presuppose certain common values that protect voluntariness, freedom, but also cohesion in the community.</p>\n<p>In this respect, guiding ideas of a intentional community can be: freedom of contract, private property, self-determination, and market economy, as well as willingness to help, interest in the welfare of fellow human beings, as well as in certain regions, the desire to preserve and pass on one’s own language and culture.</p>\n<p>Of course, in such cases all state laws are still applicable; but at least in the area of security, dispute resolution, and social harmony, a more pleasant coexistence can be established through this design. Furthermore, the intentional community can try to gradually establish its own parallel systems in the areas of energy supply, education, and social security, in order to avoid the existing systems as much as possible within the limits of legal possibilities. The creation of its own (crypto)currency or the use of an existing one is also conceivable. By allowing the intentional community to reject applicants and terminate those who break the rules, positive selection is possible.</p>\n<h4>Conclusion</h4>\n<p>We should try to start parallel structures immediately in order not to stand isolated in the coming turbulent times. It’s a good thing. New communities of values can be created. People get to know each other and help each other. The path along the way gives confidence, is often even fun, and by doing instead of talking, the wheat is separated from the chaff.</p>\n<p>It always goes on somehow. It’s up to us how.</p>\n<p>Let’s spit on our hands and get to work.</p>\n\n",
  "author": "Titus Gebel",
  "enclosure": "",
  "guid": 60797,
  "pubDate": "Fri, 28 Oct 2022 06:00:00 -0500",
  "source": "Mises Wire"
}