{
  "guid": "https://podcasts.nationalreview.com/?p=1141",
  "title": "Episode 7: Jay Cost / The Kinks",
  "description": "<p>Scot and Jeff talk to Jay Cost about The Kinks.</p>\n<p><span><b>Introducing the Band<br />\n</b></span>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\" target=\"_blank\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\" target=\"_blank\">@EsotericCD</a>) with guest Jay Cost, author of <i>A Republic No More: Big Government and the Rise of American Corruption, </i>contributing editor at <i>The Weekly Standard, </i>and yinzer. Follow Jay on Twitter at <a href=\"https://twitter.com/JayCostTWS\" target=\"_blank\">@JayCostTWS</a>, read <a href=\"http://www.weeklystandard.com/author/jay-cost\" target=\"_blank\">his work here</a>, and <a href=\"https://www.amazon.com/dp/B01F1G7PR8/ref=dp-kindle-redirect?_encoding=UTF8&btkr=1\" target=\"_blank\">buy his book on Amazon here</a>.</p>\n<p><span><b>Jay’s Musical Pick:</b> </span><u>The Kinks<br />\n</u>How did Jay get into them? Jay talks about discovering the Kinks in college, once he finally got enough disposable income to hunt down their CDs. They’ve never left his life since, an endless well to dive back into and discover new things. Jeff talks about his experience in high school as a ‘classic rock kid’ who avoided the Kinks because nobody ever talked about their classic-era records. A chance purchase of <i>The Kink Kronikles</i> led to a follow-up used CD version of <i>Village Green Preservation Society</i> and after that all bets were off. Jeff recalls being thrown for a loop by Ray Davies’ social and lyrical concerns, which were as un-‘rock’ as anything he had ever heard up until that point.</p>\n<p>KEY TRACK: “<a href=\"https://www.youtube.com/watch?v=9KTxbH4PEww\" target=\"_blank\">The Village Green Preservation Society</a>” (<i>The Kinks Are The Village Green Preservation Society</i>, 1968)</p>\n<p><span><b>The Early Garage-Rock Years: Massive Singles and Dodgy Albums</b></span><br />\nThe gang surveys the early (1964-1965) era of The Kinks, when their albums were mostly-appalling collections of half-competent covers and lame ‘originals’, while their non-album singles were one titanic landmark of early British Invasion rock (and proto-punk) after another. Nobody has much other than laughter for <i>Kinks </i>and <i>Kinda Kinks</i> outside of the mega-hit singles found on each, though Jeff offers praise to “Something Better Beginning,” the conclusion of <i>Kinda Kinks</i>. But those amazing singles! “You Really Got Me,” “All Day And All Of The Night,” “Tired Of Waiting For You,” “Set Me Free,” “See My Friends,” “I Need You,” and the list goes on and on. Before the Kinks became the textbook example of an “album act,” they were one of the truly legendary singles acts in UK history.</p>\n<p>The gang spares more of an ear for the Kinks’ third record, the transitional <i>Kink Kontroversy</i>. The originals still aren’t very sophisticated, outside of the single/B-side and a track or two, but they’re getting more refined and “Milk-Cow Blues” is maybe the only great cover the Kinks ever recorded. Also, <i>The Kink Kontroversy</i> sports one of the coolest, sleekest album covers of the entire pre-psychedelia pop era. <a href=\"https://images-na.ssl-images-amazon.com/images/I/51Y0wPnOmoL.jpg\" target=\"_blank\">Check it out here</a>.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=O9Mb3Q-zhCI\" target=\"_blank\">You Really Got Me</a>” (<i>Kinks, </i>1964); “<a href=\"https://www.youtube.com/watch?v=IjdkTSifgO4\" target=\"_blank\">All Day And All Of The Night</a>” (A-side of single, 1964); “<a href=\"https://www.youtube.com/watch?v=CvmU_oHObSM\" target=\"_blank\">Nothin’ In The World Can Stop Me Worryin’ ‘Bout That Girl</a>” (<i>Kinda Kinks</i>, 1965); “<a href=\"https://www.youtube.com/watch?v=9MlAiHkNUe0\" target=\"_blank\">Tired Of Waiting For You</a>” (<i>Kinda Kinks</i>, 1965); “<a href=\"https://www.youtube.com/watch?v=n9j3StMje0Q\" target=\"_blank\">Something Better Beginning</a>” (<i>Kinda Kinks</i>, 1965); “<a href=\"https://www.youtube.com/watch?v=1wxZ3towZSI\" target=\"_blank\">Set Me Free</a>” (A-side of single, 1965); “<a href=\"https://www.youtube.com/watch?v=TkkZmwvO8Lw\" target=\"_blank\">See My Friends</a>” (A-side of single, 1965); “<a href=\"https://www.youtube.com/watch?v=s8K3X_n9dUc\" target=\"_blank\">Milk-Cow Blues</a>” (<i>The Kink Kontroversy</i>, 1965); “<a href=\"https://www.youtube.com/watch?v=01HO5PIQ7BA\" target=\"_blank\">Where Have All The Good Times Gone?</a>” (<i>The Kink Kontroversy</i>, 1965); “<a href=\"https://www.youtube.com/watch?v=BIO7ejGBrbA\" target=\"_blank\">I’m On An Island</a>” (<i>The Kink Kontroversy</i>, 1965)</p>\n<p><strong><span>The Kinks become The Kinks</span></strong><br />\n“Dedicated Follower Of Fashion,” <i>Face To Face</i>, and the Davies brothers’ retreat from prevailing psychedelic trends into a sharp commentary on the nature of ‘progress’ and its effect upon British society. This is where the Kinks become THE KINKS as Jay, Scot and Jeff all agree. Scot cites <i>Face To Face</i> as the Great Leap Forward for the Kinks. Jeff says that the dividing line should be moved a little further back to early 1966 with their non-album single “Dedicated Follower Of Fashion.” Jay suggests that the real key to the Kinks’ early years was their secret weapon: Dave Davies, brusquely effective lead guitarist, underrated songwriter, and sneaky-good hoarse-voxed singer. But all agree that <i>Face To Face</i> is the first truly great ALBUM the band ever released, a varied diverse kaleidoscope of instrumental colors, musical approaches, and lyrical concerns. The only song you might have ever heard from it is “Sunny Afternoon” unless you’re a serious fan. But nearly every other track is equally as good. (Have you heard “Dandy”? “Session Man”? “Holiday In Waikiki”? If not, why not?)</p>\n<p>The halting flirtation with psychedelic touches found on <i>Face To Face</i> are abandoned completely after this point, yet the Kinks keep rising from artistic triumph to triumph even as their commercial fortunes decline. First with “Dead End Street,” a brilliantly catchy pop single written about the horrors of living in a tenement slum, and then with <i>Something Else By The Kinks</i>, home to twelve deft character sketches of life in mid-sixties Britain. Jay thinks that <i>Face To Face</i> marks Ray’s initial lamentation of the costs of modern ‘progress’ for the simple dreams of ordinary folks, but doesn’t proffer a solution: the solution, at least as Ray sees it, is put forth on <i>Something Else</i> and <i>Village Green Preservation Society</i>. Jeff thinks “Death Of A Clown” and “Situation Vacant” are <i>Something Else</i>‘s best songs, but of course Scot and Jay point to “Waterloo Sunset,” often hailed by other musicians as the most beautiful pop song ever written in the English language. Scot marvels that a song so highly rated by Davies’ peers (and by critics) is actually relatively obscure in terms of radio airplay. The Kinks’ US performance ban (and its effect on Ray Davies’ delve into a highly British songwriting obsession) is discussed, and the primitive production stylings of Shel Talmy are lamented.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=kzSWZln8wxI\" target=\"_blank\">Dedicated Follower Of Fashion</a>” (A-side of single, 1966); “<a href=\"https://www.youtube.com/watch?v=qKshanNoqTI\" target=\"_blank\">Party Line</a>” (<i>Face To Face</i>, 1966); “<a href=\"https://www.youtube.com/watch?v=pkJ-33DeB6U\" target=\"_blank\">Rosie Won’t You Please Come Home</a>” (<i>Face To Face</i>, 1966); “<a href=\"https://www.youtube.com/watch?v=ndjmq9ZvBvw\" target=\"_blank\">Dandy</a>” (<i>Face To Face</i>, 1966); “<a href=\"https://www.youtube.com/watch?v=ysECGTSdfaQ\" target=\"_blank\">Session Man</a>” (<i>Face To Face</i>, 1966); “<a href=\"https://www.youtube.com/watch?v=gxJpO0-nVqw\" target=\"_blank\">Fancy</a>” (<i>Face To Face</i>, 1966); “<a href=\"https://www.youtube.com/watch?v=TBzzWFXpVZg\" target=\"_blank\">Sunny Afternoon</a>” (<i>Face To Face</i>, 1966); “<a href=\"https://www.youtube.com/watch?v=nvd7sAdKi2U\" target=\"_blank\">I’m Not Like Everybody Else</a>” (B-side of “Sunny Afternoon,” 1966); “<a href=\"https://www.youtube.com/watch?v=2vQtSp1SLwg\" target=\"_blank\">Dead End Street</a>” (A-side of single, 1966); “<a href=\"https://www.youtube.com/watch?v=lR9HT76BCeU\" target=\"_blank\">David Watts</a>” (<i>Something Else By The Kinks</i>, 1967); “<a href=\"https://www.youtube.com/watch?v=mp740LsxAW4\" target=\"_blank\">Waterloo Sunset</a>” (<i>Something Else By The Kinks</i>, 1967); “<a href=\"https://www.youtube.com/watch?v=LCROm6pyvDE\" target=\"_blank\">Death Of A Clown</a>” (<i>Something Else By The Kinks</i>, 1967); “<a href=\"https://www.youtube.com/watch?v=ujbeT5TW65o\" target=\"_blank\">Situation Vacant</a>” (<i>Something Else By The Kinks</i>, 1967); “<a href=\"https://www.youtube.com/watch?v=gtYJ6IpSBzM\" target=\"_blank\">Susannah’s Still Alive</a>” (A-side of single, 1967)</p>\n<p><strong><span>Maturity</span></strong><br />\nThe Kinks reach the full flower of their maturity, join the Sherlock Holmes English-Speaking Vernacular, and observe the Decline and Fall of the British Empire. It’s not a unanimous decision for the #1 spot (Jay still prefers <i>Muswell Hillbillies</i>), but everyone agrees that <i>The Kinks Are The Village Green Preservation Society</i> is one of the most magnificent achievements not only in The Kinks’ discography, but in pop music history. Ray Davies finally dedicates himself to an actual concept album, built around the cultural and social concerns on display over 1966-1967, and the result is flooring. Unless you’re a Kinks fan, you might not have even heard <i><u>one single song</u></i> on this record, and yet nearly all of them are masterpieces. Jeff talks about how “Do You Remember Walter” is the most devastatingly realistic requiem to childhood dreams ever written…and yet it ends with a hopeful conclusion. He also cites to “Picture Book,” “Monica” (a joyful song about the local town prostitute!) and especially “People Take Pictures Of Each Other,” which even to this day explains ‘selfie culture.’ Jay praises <i>Village Green</i> as the record where Ray Davies actually provided a constructive answer to his critique of society advanced on <i>Face To Face</i> and <i>Something Else, </i>even as <i>VGPS</i> is essentially a lament for a world slowly being destroyed by modern capitalist commercialism.</p>\n<p>Jeff thought he was going out on a limb by dismissing <i>Village Green</i>‘s critically adored 1969 follow-up <i>Arthur, Or The Decline And Fall Of The British Empire</i> (perhaps the ‘critical consensus’ choice as their best record) as a flabbily substandard album, but he finds a surprising ally in Jay. Scot likes the album (a concept piece originally conceived for a TV special about one man making his way through the wreckage of the post-war, post-Empire British dream), but Jeff insists it’s an ominous example of Ray subverting musical quality in favor of ‘conceptual unity,’ and cites to the Dave Davies B-sides of this era as proof that far better work was being discarded in order to service a premise. Jay agrees that musically it’s a dip between the albums that bracket it, but is taken by the surpassing gloom and pessimism of the album’s defeated protagonist. That said, all rational human beings love “Victoria,” and “Shangri-La,” and particular respect is given to the pathos of the title track “Arthur.” (“Arthur the world’s gone and passed you by, don’t you know it?/You can cry all night but it won’t make it right, don’t you know it?”)</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=ATzw-N_AEIA\" target=\"_blank\">Do You Remember, Walter?</a>” (<i>The Kinks Are The Village Green Preservation Society</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=98G52rTDvvQ\" target=\"_blank\">Picture Boo</a>k” (<i>The Kinks Are The Village Green Preservation Society</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=Aj7LscZ_x7Q\" target=\"_blank\">Johnny Thunder</a>” (<i>The Kinks Are The Village Green Preservation Society</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=UGc31IE0cGA\" target=\"_blank\">Last Of The Steam-Powered Trains</a>” (<i>The Kinks Are The Village Green Preservation Society</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=3aamoTw3qBw\" target=\"_blank\">Animal Farm</a>” (<i>The Kinks Are The Village Green Preservation Society</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=9LgWE9n_3bk\" target=\"_blank\">Monica</a>” (<i>The Kinks Are The Village Green Preservation Society</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=SRa43s6Ui3E\" target=\"_blank\">People Take Pictures Of Each Other</a>” (<i>The Kinks Are The Village Green Preservation Society</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=XiGLta9NnN0\" target=\"_blank\">Days</a>” (A-side of single, 1968); “<a href=\"https://www.youtube.com/watch?v=VYXeA3SxtNY\" target=\"_blank\">Victoria</a>” (<i>Arthur, Or The Decline And Fall Of The British Empire</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=WdaaLjABhtY\" target=\"_blank\">Yes Sir, No Sir</a>” (<i>Arthur, Or The Decline And Fall Of The British Empire</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=Zmag4OUFQYw\" target=\"_blank\">Brainwashed</a>‘” (<i>Arthur, Or The Decline And Fall Of The British Empire</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=ZnzPRKW3kJ4\" target=\"_blank\">Mindless Child Of Motherhood</a>” (B-side of “Drivin’,” 1969); “<a href=\"https://www.youtube.com/watch?v=1q2VKNARcoE\" target=\"_blank\">Shangri-La</a>” (<i>Arthur Or The Decline And Fall Of The British Empire</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=M6LQbG230sY\" target=\"_blank\">Arthur</a>” (<i>Arthur, Or The Decline And Fall Of The British Empire</i>, 1969)</p>\n<p><b><span><i>Lola </i>and <i>Muswell Hillbillies</i>: The Kinks Complete Their Golden Era</span><br />\n</b>Critics and fans sometimes like to dismiss the <i>Lola </i>album as a step down from <i>Arthur — </i>just “Ray Davies bellyaching ‘PAY MEEEE!!!'” (as Jay puts it). The gang is having none of it. All three of them think <i>Lola Versus Powerman And The Moneygoround</i> (1970) is a superb record, one of the Kinks’ finest, and Jeff and Jay consider it superior to <i>Arthur</i>. Scot calls out to Dave’s magnificent “Strangers” and has no idea why classic rock radio programmers aren’t playing “Powerman” on heavy rotation. Jay considers the record to be a morality tale about being “seduced by the serpent,” the serpent in this case being the music industry and its promise of fame, fortune, and self-fulfillment. To Jay, “Lola” isn’t just a goofy novelty song about a transvestite, it’s a song about an outsider liberated from shackles and illusions, someone who’s just <a href=\"https://www.youtube.com/watch?v=x9Jx26BVB50\" target=\"_blank\">got to be free</a>. Jeff agrees with Jay about <i>Lola</i>‘s fundamental unhappiness, and finds it best expressed in the forgotten (except by Wes Anderson) album track “This Time Tomorrow,” where the loneliness of a touring musician is treated without bathos or self-pity.</p>\n<p>Scot is indifferent towards <i>Muswell Hillbillies</i> (1971), but Jeff is not; while it’s not his favorite Kinks record, it’s up there, and it’s certainly their last truly great LP even if it’s a left-turn away from radio-friendly commercialism into a unique fusion of country and jazz-tinged music-hall. Jay then takes over to sing the praises of <i>Muswell,</i> his single favorite Kinks album, the one that fully diagnoses (as Ray sees it) the illness of modern society. “This is the album where Ray basically says ‘they’re coming for you’…there’s no getting away from the People In Grey.”</p>\n<p>KEY TRACKS: “<a href=\"https://www.youtube.com/watch?v=W2HwKnMacNA\" target=\"_blank\">Lola</a>” (<i>Lola Versus Powerman And The Moneygoround</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=oXSUPoh7jAI\" target=\"_blank\">Strangers</a>” (<i>Lola Versus Powerman And The Moneygoround</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=yfTaoC7TVag\" target=\"_blank\">Get Back In Line</a>” (<i>Lola Versus Powerman And The Moneygoround</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=oNzAKuqdNpw\" target=\"_blank\">Apeman</a>” (<i>Lola Versus Powerman And The Moneygoround</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=uYqRwwupnIk\" target=\"_blank\">Powerman</a>” (<i>Lola Versus Powerman And The Moneygoround</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=TnnxpaMmSZk\" target=\"_blank\">This Time Tomorrow</a>” (<i>Lola Versus Powerman And The Moneygoround</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=zwrlVSbU0Jc\" target=\"_blank\">20th Century Man</a>” (<i>Muswell Hillbillies</i>, 1971); “<a href=\"https://www.youtube.com/watch?v=HwwuPH8-Q1k\" target=\"_blank\">Skin And Bone</a>” (<i>Muswell Hillbillies</i>, 1971); “<a href=\"https://www.youtube.com/watch?v=nCWGHAhEveA\" target=\"_blank\">Oklahoma U.S.A.</a>” (<i>Muswell Hillbillies</i>, 1971); “<a href=\"https://www.youtube.com/watch?v=bAPA_DmEjlY\" target=\"_blank\">Acute Schizophrenia Paranoia Blues</a>” (<i>Muswell Hillbillies</i>, 1971); “<a href=\"https://www.youtube.com/watch?v=HtCChgCsP8U\" target=\"_blank\">Have A Cuppa Tea</a>” (<i>Muswell Hillbillies</i>, 1971); “<a href=\"https://www.youtube.com/watch?v=VDmBvh3SOC4\" target=\"_blank\">Muswell Hillbilly</a>” (<i>Muswell Hillbillies</i>, 1971)</p>\n<p><b><span>The ‘Theatrical’ Years</span><br />\n</b>Scot refers to <i>Everybody’s In Show-Biz</i>, as “the drunkest album ever recorded” and he’s got a point. It’s not a cliff-dive after <i>Muswell Hillbillies</i>, but it is a noticeable drop-off as Ray’s songwriting shifts to conceptual concerns and begins to consciously retread ground already covered before. Neither Scot nor Jeff (especially Jeff!) is a fan of this era — Scot names “Jack The Idiot Dunce” as his least favorite Kinks song of all time — but Jay makes a bold defense of them, and recommends the live shows from this era. To be fair, the individual songs he singles out are…actually pretty darn good.</p>\n<p>KEY TRACKS: “<a href=\"https://www.youtube.com/watch?v=qlunpm832zc\" target=\"_blank\">Celluloid Heroes</a>” (<i>Everybody’s In Show-Biz</i>, 1972); “<a href=\"https://www.youtube.com/watch?v=TzpJzwVIwQQ\" target=\"_blank\">Sitting In My Hotel</a>” (<i>Everybody’s Show-Biz</i>, 1972); “<a href=\"https://www.youtube.com/watch?v=a6icG96Ktbo\" target=\"_blank\">Sitting In The Midday Sun</a>” (<i>Preservation Act 1</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=hasWLmR5VE0\" target=\"_blank\">One Of The Survivors</a>” (<i>Preservation Act 1</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=OneFA47H8Ow\" target=\"_blank\">Sweet Lady Genevieve</a>” (<i>Preservation Act 1</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=_AEB1q7wE4U\" target=\"_blank\">He’s Evil</a>” (<i>Preservation Act 2</i>, 1974); “<a href=\"https://www.youtube.com/watch?v=7hO0CIqSknQ\" target=\"_blank\">Salvation Road</a>” (<i>Preservation Act 2</i>, 1974); “<a href=\"https://www.youtube.com/watch?v=vfbZDbo3KIs\" target=\"_blank\">Slum Kids (live March 1979)</a>” (originally an outtake from <i>Preservation Act 2</i>, 1974); “<a href=\"https://www.youtube.com/watch?v=DsgICCvHBpM\" target=\"_blank\">Everybody’s A Star</a>” (<i>Soap Opera, </i>1975); “<a href=\"https://www.youtube.com/watch?v=hpqoYzNoiPc\" target=\"_blank\">Holiday Romance</a>” (<i>Soap Opera</i>, 1975); “<a href=\"https://www.youtube.com/watch?v=BxTfn4WhqmU\" target=\"_blank\">Ducks On The Wall</a>” (<i>Soap Opera</i>, 1975); “<a href=\"https://www.youtube.com/watch?v=WqXXw-PRbhY\" target=\"_blank\">No More Looking Back</a>” (<i>Schoolboys In Disgrace</i>, 1975)</p>\n<p><b><span>The Commercial Revival</span><br />\n</b>The Kinks’ late ’70s/early ’80s commercial revival: <i>Sleepwalker, Misfits</i>, <i>Low Budget</i>, and <i>Give The People What They Want</i>.<b> </b>New label + internal band rebellion = Ray returns to a more commercial sound…or at least a series of records that aren’t dependent upon arch theatrical conceits. The gang really enjoy <i>Sleepwalker</i> and <i>Misfits</i> even though they don’t get any airplay anymore. Ray actually seems happy as a songwriter, for once! Plus a lot of the band’s radio hits still hold up. Jay thinks of <i>Misfits</i> as the ‘happy ending’ that the Kinks deserved but never quite got. Jeff singles out “Black Messiah” as a fascinatingly troubling song that could never in a million years be written today.</p>\n<p>KEY TRACKS: “<a href=\"https://www.youtube.com/watch?v=Pu5Ugs4piJg\" target=\"_blank\">Life Goes On</a>” (<i>Sleepwalker</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=FDfUWyCAVUU\" target=\"_blank\">Life On The Road</a>” (<i>Sleepwalker</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=fUjfb5tZ22Q\" target=\"_blank\">Sleepwalker</a>” (<i>Life On The Road</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=OollyF3NIxs\" target=\"_blank\">Misfits</a>” (<i>Misfits</i>, 1978); “<a href=\"https://www.youtube.com/watch?v=V53SeZBDP5c\" target=\"_blank\">Permanent Waves</a>” (<i>Misfits</i>, 1978); “<a href=\"https://www.youtube.com/watch?v=bEpCDkSKNCM\" target=\"_blank\">A Rock ‘N’ Roll Fantasy</a>” (<i>Misfits</i>, 1978); “<a href=\"https://www.youtube.com/watch?v=iuW3Sax8XtU\" target=\"_blank\">Black Messiah</a>” (<i>Misfits</i>, 1978); “<a href=\"https://www.youtube.com/watch?v=f5XxskkI5AY\" target=\"_blank\">(Wish I Could Fly Like) Superman</a>” (<i>Low Budget</i>, 1979); “<a href=\"https://www.youtube.com/watch?v=A5yuCwmf2fk\" target=\"_blank\">Destroyer</a>” (<i>Give The People What They Want</i>, 1981); “<a href=\"https://www.youtube.com/watch?v=8ooRninMapo\" target=\"_blank\">Better Things</a>” (<i>Give The People What They Want</i>, 1981); “<a href=\"https://www.youtube.com/watch?v=Sdx6SolpTJI\" target=\"_blank\">Come Dancing</a>” (<i>State Of Confusion</i>, 1983); “<a href=\"https://www.youtube.com/watch?v=ozpMiwKhZQE\" target=\"_blank\">Do It Again</a>” (<i>Word Of Mouth</i>, 1984)</p>\n<p><span><b>Finale</b></span><br />\nJay, Scot and Jeff each name their 2 key albums and 5 key tracks by The Kinks.</p>\n",
  "pubDate": "Sun, 1 Oct 2017 23:00:23 +0000",
  "author": "studio@nationalreview.com (National Review)",
  "link": "https://www.nationalreview.com/media/political-beats",
  "content:encoded": "<p>Scot and Jeff talk to Jay Cost about The Kinks.</p>\n<p><span><b>Introducing the Band<br />\n</b></span>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\" target=\"_blank\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\" target=\"_blank\">@EsotericCD</a>) with guest Jay Cost, author of <i>A Republic No More: Big Government and the Rise of American Corruption, </i>contributing editor at <i>The Weekly Standard, </i>and yinzer. Follow Jay on Twitter at <a href=\"https://twitter.com/JayCostTWS\" target=\"_blank\">@JayCostTWS</a>, read <a href=\"http://www.weeklystandard.com/author/jay-cost\" target=\"_blank\">his work here</a>, and <a href=\"https://www.amazon.com/dp/B01F1G7PR8/ref=dp-kindle-redirect?_encoding=UTF8&btkr=1\" target=\"_blank\">buy his book on Amazon here</a>.</p>\n<p><span><b>Jay’s Musical Pick:</b> </span><u>The Kinks<br />\n</u>How did Jay get into them? Jay talks about discovering the Kinks in college, once he finally got enough disposable income to hunt down their CDs. They’ve never left his life since, an endless well to dive back into and discover new things. Jeff talks about his experience in high school as a ‘classic rock kid’ who avoided the Kinks because nobody ever talked about their classic-era records. A chance purchase of <i>The Kink Kronikles</i> led to a follow-up used CD version of <i>Village Green Preservation Society</i> and after that all bets were off. Jeff recalls being thrown for a loop by Ray Davies’ social and lyrical concerns, which were as un-‘rock’ as anything he had ever heard up until that point.</p>\n<p>KEY TRACK: “<a href=\"https://www.youtube.com/watch?v=9KTxbH4PEww\" target=\"_blank\">The Village Green Preservation Society</a>” (<i>The Kinks Are The Village Green Preservation Society</i>, 1968)</p>\n<p><span><b>The Early Garage-Rock Years: Massive Singles and Dodgy Albums</b></span><br />\nThe gang surveys the early (1964-1965) era of The Kinks, when their albums were mostly-appalling collections of half-competent covers and lame ‘originals’, while their non-album singles were one titanic landmark of early British Invasion rock (and proto-punk) after another. Nobody has much other than laughter for <i>Kinks </i>and <i>Kinda Kinks</i> outside of the mega-hit singles found on each, though Jeff offers praise to “Something Better Beginning,” the conclusion of <i>Kinda Kinks</i>. But those amazing singles! “You Really Got Me,” “All Day And All Of The Night,” “Tired Of Waiting For You,” “Set Me Free,” “See My Friends,” “I Need You,” and the list goes on and on. Before the Kinks became the textbook example of an “album act,” they were one of the truly legendary singles acts in UK history.</p>\n<p>The gang spares more of an ear for the Kinks’ third record, the transitional <i>Kink Kontroversy</i>. The originals still aren’t very sophisticated, outside of the single/B-side and a track or two, but they’re getting more refined and “Milk-Cow Blues” is maybe the only great cover the Kinks ever recorded. Also, <i>The Kink Kontroversy</i> sports one of the coolest, sleekest album covers of the entire pre-psychedelia pop era. <a href=\"https://images-na.ssl-images-amazon.com/images/I/51Y0wPnOmoL.jpg\" target=\"_blank\">Check it out here</a>.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=O9Mb3Q-zhCI\" target=\"_blank\">You Really Got Me</a>” (<i>Kinks, </i>1964); “<a href=\"https://www.youtube.com/watch?v=IjdkTSifgO4\" target=\"_blank\">All Day And All Of The Night</a>” (A-side of single, 1964); “<a href=\"https://www.youtube.com/watch?v=CvmU_oHObSM\" target=\"_blank\">Nothin’ In The World Can Stop Me Worryin’ ‘Bout That Girl</a>” (<i>Kinda Kinks</i>, 1965); “<a href=\"https://www.youtube.com/watch?v=9MlAiHkNUe0\" target=\"_blank\">Tired Of Waiting For You</a>” (<i>Kinda Kinks</i>, 1965); “<a href=\"https://www.youtube.com/watch?v=n9j3StMje0Q\" target=\"_blank\">Something Better Beginning</a>” (<i>Kinda Kinks</i>, 1965); “<a href=\"https://www.youtube.com/watch?v=1wxZ3towZSI\" target=\"_blank\">Set Me Free</a>” (A-side of single, 1965); “<a href=\"https://www.youtube.com/watch?v=TkkZmwvO8Lw\" target=\"_blank\">See My Friends</a>” (A-side of single, 1965); “<a href=\"https://www.youtube.com/watch?v=s8K3X_n9dUc\" target=\"_blank\">Milk-Cow Blues</a>” (<i>The Kink Kontroversy</i>, 1965); “<a href=\"https://www.youtube.com/watch?v=01HO5PIQ7BA\" target=\"_blank\">Where Have All The Good Times Gone?</a>” (<i>The Kink Kontroversy</i>, 1965); “<a href=\"https://www.youtube.com/watch?v=BIO7ejGBrbA\" target=\"_blank\">I’m On An Island</a>” (<i>The Kink Kontroversy</i>, 1965)</p>\n<p><strong><span>The Kinks become The Kinks</span></strong><br />\n“Dedicated Follower Of Fashion,” <i>Face To Face</i>, and the Davies brothers’ retreat from prevailing psychedelic trends into a sharp commentary on the nature of ‘progress’ and its effect upon British society. This is where the Kinks become THE KINKS as Jay, Scot and Jeff all agree. Scot cites <i>Face To Face</i> as the Great Leap Forward for the Kinks. Jeff says that the dividing line should be moved a little further back to early 1966 with their non-album single “Dedicated Follower Of Fashion.” Jay suggests that the real key to the Kinks’ early years was their secret weapon: Dave Davies, brusquely effective lead guitarist, underrated songwriter, and sneaky-good hoarse-voxed singer. But all agree that <i>Face To Face</i> is the first truly great ALBUM the band ever released, a varied diverse kaleidoscope of instrumental colors, musical approaches, and lyrical concerns. The only song you might have ever heard from it is “Sunny Afternoon” unless you’re a serious fan. But nearly every other track is equally as good. (Have you heard “Dandy”? “Session Man”? “Holiday In Waikiki”? If not, why not?)</p>\n<p>The halting flirtation with psychedelic touches found on <i>Face To Face</i> are abandoned completely after this point, yet the Kinks keep rising from artistic triumph to triumph even as their commercial fortunes decline. First with “Dead End Street,” a brilliantly catchy pop single written about the horrors of living in a tenement slum, and then with <i>Something Else By The Kinks</i>, home to twelve deft character sketches of life in mid-sixties Britain. Jay thinks that <i>Face To Face</i> marks Ray’s initial lamentation of the costs of modern ‘progress’ for the simple dreams of ordinary folks, but doesn’t proffer a solution: the solution, at least as Ray sees it, is put forth on <i>Something Else</i> and <i>Village Green Preservation Society</i>. Jeff thinks “Death Of A Clown” and “Situation Vacant” are <i>Something Else</i>‘s best songs, but of course Scot and Jay point to “Waterloo Sunset,” often hailed by other musicians as the most beautiful pop song ever written in the English language. Scot marvels that a song so highly rated by Davies’ peers (and by critics) is actually relatively obscure in terms of radio airplay. The Kinks’ US performance ban (and its effect on Ray Davies’ delve into a highly British songwriting obsession) is discussed, and the primitive production stylings of Shel Talmy are lamented.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=kzSWZln8wxI\" target=\"_blank\">Dedicated Follower Of Fashion</a>” (A-side of single, 1966); “<a href=\"https://www.youtube.com/watch?v=qKshanNoqTI\" target=\"_blank\">Party Line</a>” (<i>Face To Face</i>, 1966); “<a href=\"https://www.youtube.com/watch?v=pkJ-33DeB6U\" target=\"_blank\">Rosie Won’t You Please Come Home</a>” (<i>Face To Face</i>, 1966); “<a href=\"https://www.youtube.com/watch?v=ndjmq9ZvBvw\" target=\"_blank\">Dandy</a>” (<i>Face To Face</i>, 1966); “<a href=\"https://www.youtube.com/watch?v=ysECGTSdfaQ\" target=\"_blank\">Session Man</a>” (<i>Face To Face</i>, 1966); “<a href=\"https://www.youtube.com/watch?v=gxJpO0-nVqw\" target=\"_blank\">Fancy</a>” (<i>Face To Face</i>, 1966); “<a href=\"https://www.youtube.com/watch?v=TBzzWFXpVZg\" target=\"_blank\">Sunny Afternoon</a>” (<i>Face To Face</i>, 1966); “<a href=\"https://www.youtube.com/watch?v=nvd7sAdKi2U\" target=\"_blank\">I’m Not Like Everybody Else</a>” (B-side of “Sunny Afternoon,” 1966); “<a href=\"https://www.youtube.com/watch?v=2vQtSp1SLwg\" target=\"_blank\">Dead End Street</a>” (A-side of single, 1966); “<a href=\"https://www.youtube.com/watch?v=lR9HT76BCeU\" target=\"_blank\">David Watts</a>” (<i>Something Else By The Kinks</i>, 1967); “<a href=\"https://www.youtube.com/watch?v=mp740LsxAW4\" target=\"_blank\">Waterloo Sunset</a>” (<i>Something Else By The Kinks</i>, 1967); “<a href=\"https://www.youtube.com/watch?v=LCROm6pyvDE\" target=\"_blank\">Death Of A Clown</a>” (<i>Something Else By The Kinks</i>, 1967); “<a href=\"https://www.youtube.com/watch?v=ujbeT5TW65o\" target=\"_blank\">Situation Vacant</a>” (<i>Something Else By The Kinks</i>, 1967); “<a href=\"https://www.youtube.com/watch?v=gtYJ6IpSBzM\" target=\"_blank\">Susannah’s Still Alive</a>” (A-side of single, 1967)</p>\n<p><strong><span>Maturity</span></strong><br />\nThe Kinks reach the full flower of their maturity, join the Sherlock Holmes English-Speaking Vernacular, and observe the Decline and Fall of the British Empire. It’s not a unanimous decision for the #1 spot (Jay still prefers <i>Muswell Hillbillies</i>), but everyone agrees that <i>The Kinks Are The Village Green Preservation Society</i> is one of the most magnificent achievements not only in The Kinks’ discography, but in pop music history. Ray Davies finally dedicates himself to an actual concept album, built around the cultural and social concerns on display over 1966-1967, and the result is flooring. Unless you’re a Kinks fan, you might not have even heard <i><u>one single song</u></i> on this record, and yet nearly all of them are masterpieces. Jeff talks about how “Do You Remember Walter” is the most devastatingly realistic requiem to childhood dreams ever written…and yet it ends with a hopeful conclusion. He also cites to “Picture Book,” “Monica” (a joyful song about the local town prostitute!) and especially “People Take Pictures Of Each Other,” which even to this day explains ‘selfie culture.’ Jay praises <i>Village Green</i> as the record where Ray Davies actually provided a constructive answer to his critique of society advanced on <i>Face To Face</i> and <i>Something Else, </i>even as <i>VGPS</i> is essentially a lament for a world slowly being destroyed by modern capitalist commercialism.</p>\n<p>Jeff thought he was going out on a limb by dismissing <i>Village Green</i>‘s critically adored 1969 follow-up <i>Arthur, Or The Decline And Fall Of The British Empire</i> (perhaps the ‘critical consensus’ choice as their best record) as a flabbily substandard album, but he finds a surprising ally in Jay. Scot likes the album (a concept piece originally conceived for a TV special about one man making his way through the wreckage of the post-war, post-Empire British dream), but Jeff insists it’s an ominous example of Ray subverting musical quality in favor of ‘conceptual unity,’ and cites to the Dave Davies B-sides of this era as proof that far better work was being discarded in order to service a premise. Jay agrees that musically it’s a dip between the albums that bracket it, but is taken by the surpassing gloom and pessimism of the album’s defeated protagonist. That said, all rational human beings love “Victoria,” and “Shangri-La,” and particular respect is given to the pathos of the title track “Arthur.” (“Arthur the world’s gone and passed you by, don’t you know it?/You can cry all night but it won’t make it right, don’t you know it?”)</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=ATzw-N_AEIA\" target=\"_blank\">Do You Remember, Walter?</a>” (<i>The Kinks Are The Village Green Preservation Society</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=98G52rTDvvQ\" target=\"_blank\">Picture Boo</a>k” (<i>The Kinks Are The Village Green Preservation Society</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=Aj7LscZ_x7Q\" target=\"_blank\">Johnny Thunder</a>” (<i>The Kinks Are The Village Green Preservation Society</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=UGc31IE0cGA\" target=\"_blank\">Last Of The Steam-Powered Trains</a>” (<i>The Kinks Are The Village Green Preservation Society</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=3aamoTw3qBw\" target=\"_blank\">Animal Farm</a>” (<i>The Kinks Are The Village Green Preservation Society</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=9LgWE9n_3bk\" target=\"_blank\">Monica</a>” (<i>The Kinks Are The Village Green Preservation Society</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=SRa43s6Ui3E\" target=\"_blank\">People Take Pictures Of Each Other</a>” (<i>The Kinks Are The Village Green Preservation Society</i>, 1968); “<a href=\"https://www.youtube.com/watch?v=XiGLta9NnN0\" target=\"_blank\">Days</a>” (A-side of single, 1968); “<a href=\"https://www.youtube.com/watch?v=VYXeA3SxtNY\" target=\"_blank\">Victoria</a>” (<i>Arthur, Or The Decline And Fall Of The British Empire</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=WdaaLjABhtY\" target=\"_blank\">Yes Sir, No Sir</a>” (<i>Arthur, Or The Decline And Fall Of The British Empire</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=Zmag4OUFQYw\" target=\"_blank\">Brainwashed</a>‘” (<i>Arthur, Or The Decline And Fall Of The British Empire</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=ZnzPRKW3kJ4\" target=\"_blank\">Mindless Child Of Motherhood</a>” (B-side of “Drivin’,” 1969); “<a href=\"https://www.youtube.com/watch?v=1q2VKNARcoE\" target=\"_blank\">Shangri-La</a>” (<i>Arthur Or The Decline And Fall Of The British Empire</i>, 1969); “<a href=\"https://www.youtube.com/watch?v=M6LQbG230sY\" target=\"_blank\">Arthur</a>” (<i>Arthur, Or The Decline And Fall Of The British Empire</i>, 1969)</p>\n<p><b><span><i>Lola </i>and <i>Muswell Hillbillies</i>: The Kinks Complete Their Golden Era</span><br />\n</b>Critics and fans sometimes like to dismiss the <i>Lola </i>album as a step down from <i>Arthur — </i>just “Ray Davies bellyaching ‘PAY MEEEE!!!'” (as Jay puts it). The gang is having none of it. All three of them think <i>Lola Versus Powerman And The Moneygoround</i> (1970) is a superb record, one of the Kinks’ finest, and Jeff and Jay consider it superior to <i>Arthur</i>. Scot calls out to Dave’s magnificent “Strangers” and has no idea why classic rock radio programmers aren’t playing “Powerman” on heavy rotation. Jay considers the record to be a morality tale about being “seduced by the serpent,” the serpent in this case being the music industry and its promise of fame, fortune, and self-fulfillment. To Jay, “Lola” isn’t just a goofy novelty song about a transvestite, it’s a song about an outsider liberated from shackles and illusions, someone who’s just <a href=\"https://www.youtube.com/watch?v=x9Jx26BVB50\" target=\"_blank\">got to be free</a>. Jeff agrees with Jay about <i>Lola</i>‘s fundamental unhappiness, and finds it best expressed in the forgotten (except by Wes Anderson) album track “This Time Tomorrow,” where the loneliness of a touring musician is treated without bathos or self-pity.</p>\n<p>Scot is indifferent towards <i>Muswell Hillbillies</i> (1971), but Jeff is not; while it’s not his favorite Kinks record, it’s up there, and it’s certainly their last truly great LP even if it’s a left-turn away from radio-friendly commercialism into a unique fusion of country and jazz-tinged music-hall. Jay then takes over to sing the praises of <i>Muswell,</i> his single favorite Kinks album, the one that fully diagnoses (as Ray sees it) the illness of modern society. “This is the album where Ray basically says ‘they’re coming for you’…there’s no getting away from the People In Grey.”</p>\n<p>KEY TRACKS: “<a href=\"https://www.youtube.com/watch?v=W2HwKnMacNA\" target=\"_blank\">Lola</a>” (<i>Lola Versus Powerman And The Moneygoround</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=oXSUPoh7jAI\" target=\"_blank\">Strangers</a>” (<i>Lola Versus Powerman And The Moneygoround</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=yfTaoC7TVag\" target=\"_blank\">Get Back In Line</a>” (<i>Lola Versus Powerman And The Moneygoround</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=oNzAKuqdNpw\" target=\"_blank\">Apeman</a>” (<i>Lola Versus Powerman And The Moneygoround</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=uYqRwwupnIk\" target=\"_blank\">Powerman</a>” (<i>Lola Versus Powerman And The Moneygoround</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=TnnxpaMmSZk\" target=\"_blank\">This Time Tomorrow</a>” (<i>Lola Versus Powerman And The Moneygoround</i>, 1970); “<a href=\"https://www.youtube.com/watch?v=zwrlVSbU0Jc\" target=\"_blank\">20th Century Man</a>” (<i>Muswell Hillbillies</i>, 1971); “<a href=\"https://www.youtube.com/watch?v=HwwuPH8-Q1k\" target=\"_blank\">Skin And Bone</a>” (<i>Muswell Hillbillies</i>, 1971); “<a href=\"https://www.youtube.com/watch?v=nCWGHAhEveA\" target=\"_blank\">Oklahoma U.S.A.</a>” (<i>Muswell Hillbillies</i>, 1971); “<a href=\"https://www.youtube.com/watch?v=bAPA_DmEjlY\" target=\"_blank\">Acute Schizophrenia Paranoia Blues</a>” (<i>Muswell Hillbillies</i>, 1971); “<a href=\"https://www.youtube.com/watch?v=HtCChgCsP8U\" target=\"_blank\">Have A Cuppa Tea</a>” (<i>Muswell Hillbillies</i>, 1971); “<a href=\"https://www.youtube.com/watch?v=VDmBvh3SOC4\" target=\"_blank\">Muswell Hillbilly</a>” (<i>Muswell Hillbillies</i>, 1971)</p>\n<p><b><span>The ‘Theatrical’ Years</span><br />\n</b>Scot refers to <i>Everybody’s In Show-Biz</i>, as “the drunkest album ever recorded” and he’s got a point. It’s not a cliff-dive after <i>Muswell Hillbillies</i>, but it is a noticeable drop-off as Ray’s songwriting shifts to conceptual concerns and begins to consciously retread ground already covered before. Neither Scot nor Jeff (especially Jeff!) is a fan of this era — Scot names “Jack The Idiot Dunce” as his least favorite Kinks song of all time — but Jay makes a bold defense of them, and recommends the live shows from this era. To be fair, the individual songs he singles out are…actually pretty darn good.</p>\n<p>KEY TRACKS: “<a href=\"https://www.youtube.com/watch?v=qlunpm832zc\" target=\"_blank\">Celluloid Heroes</a>” (<i>Everybody’s In Show-Biz</i>, 1972); “<a href=\"https://www.youtube.com/watch?v=TzpJzwVIwQQ\" target=\"_blank\">Sitting In My Hotel</a>” (<i>Everybody’s Show-Biz</i>, 1972); “<a href=\"https://www.youtube.com/watch?v=a6icG96Ktbo\" target=\"_blank\">Sitting In The Midday Sun</a>” (<i>Preservation Act 1</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=hasWLmR5VE0\" target=\"_blank\">One Of The Survivors</a>” (<i>Preservation Act 1</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=OneFA47H8Ow\" target=\"_blank\">Sweet Lady Genevieve</a>” (<i>Preservation Act 1</i>, 1973); “<a href=\"https://www.youtube.com/watch?v=_AEB1q7wE4U\" target=\"_blank\">He’s Evil</a>” (<i>Preservation Act 2</i>, 1974); “<a href=\"https://www.youtube.com/watch?v=7hO0CIqSknQ\" target=\"_blank\">Salvation Road</a>” (<i>Preservation Act 2</i>, 1974); “<a href=\"https://www.youtube.com/watch?v=vfbZDbo3KIs\" target=\"_blank\">Slum Kids (live March 1979)</a>” (originally an outtake from <i>Preservation Act 2</i>, 1974); “<a href=\"https://www.youtube.com/watch?v=DsgICCvHBpM\" target=\"_blank\">Everybody’s A Star</a>” (<i>Soap Opera, </i>1975); “<a href=\"https://www.youtube.com/watch?v=hpqoYzNoiPc\" target=\"_blank\">Holiday Romance</a>” (<i>Soap Opera</i>, 1975); “<a href=\"https://www.youtube.com/watch?v=BxTfn4WhqmU\" target=\"_blank\">Ducks On The Wall</a>” (<i>Soap Opera</i>, 1975); “<a href=\"https://www.youtube.com/watch?v=WqXXw-PRbhY\" target=\"_blank\">No More Looking Back</a>” (<i>Schoolboys In Disgrace</i>, 1975)</p>\n<p><b><span>The Commercial Revival</span><br />\n</b>The Kinks’ late ’70s/early ’80s commercial revival: <i>Sleepwalker, Misfits</i>, <i>Low Budget</i>, and <i>Give The People What They Want</i>.<b> </b>New label + internal band rebellion = Ray returns to a more commercial sound…or at least a series of records that aren’t dependent upon arch theatrical conceits. The gang really enjoy <i>Sleepwalker</i> and <i>Misfits</i> even though they don’t get any airplay anymore. Ray actually seems happy as a songwriter, for once! Plus a lot of the band’s radio hits still hold up. Jay thinks of <i>Misfits</i> as the ‘happy ending’ that the Kinks deserved but never quite got. Jeff singles out “Black Messiah” as a fascinatingly troubling song that could never in a million years be written today.</p>\n<p>KEY TRACKS: “<a href=\"https://www.youtube.com/watch?v=Pu5Ugs4piJg\" target=\"_blank\">Life Goes On</a>” (<i>Sleepwalker</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=FDfUWyCAVUU\" target=\"_blank\">Life On The Road</a>” (<i>Sleepwalker</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=fUjfb5tZ22Q\" target=\"_blank\">Sleepwalker</a>” (<i>Life On The Road</i>, 1977); “<a href=\"https://www.youtube.com/watch?v=OollyF3NIxs\" target=\"_blank\">Misfits</a>” (<i>Misfits</i>, 1978); “<a href=\"https://www.youtube.com/watch?v=V53SeZBDP5c\" target=\"_blank\">Permanent Waves</a>” (<i>Misfits</i>, 1978); “<a href=\"https://www.youtube.com/watch?v=bEpCDkSKNCM\" target=\"_blank\">A Rock ‘N’ Roll Fantasy</a>” (<i>Misfits</i>, 1978); “<a href=\"https://www.youtube.com/watch?v=iuW3Sax8XtU\" target=\"_blank\">Black Messiah</a>” (<i>Misfits</i>, 1978); “<a href=\"https://www.youtube.com/watch?v=f5XxskkI5AY\" target=\"_blank\">(Wish I Could Fly Like) Superman</a>” (<i>Low Budget</i>, 1979); “<a href=\"https://www.youtube.com/watch?v=A5yuCwmf2fk\" target=\"_blank\">Destroyer</a>” (<i>Give The People What They Want</i>, 1981); “<a href=\"https://www.youtube.com/watch?v=8ooRninMapo\" target=\"_blank\">Better Things</a>” (<i>Give The People What They Want</i>, 1981); “<a href=\"https://www.youtube.com/watch?v=Sdx6SolpTJI\" target=\"_blank\">Come Dancing</a>” (<i>State Of Confusion</i>, 1983); “<a href=\"https://www.youtube.com/watch?v=ozpMiwKhZQE\" target=\"_blank\">Do It Again</a>” (<i>Word Of Mouth</i>, 1984)</p>\n<p><span><b>Finale</b></span><br />\nJay, Scot and Jeff each name their 2 key albums and 5 key tracks by The Kinks.</p>\n",
  "enclosure": "",
  "itunes:title": "Episode 7: Jay Cost / The Kinks",
  "itunes:author": "National Review",
  "itunes:duration": "02:08:55",
  "itunes:summary": "Scot and Jeff talk to Jay Cost about The Kinks.",
  "itunes:subtitle": "Scot and Jeff talk to Jay Cost about The Kinks.",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:episode": 7
}