{
  "guid": "http://themoth.prx.org/?p=3196",
  "title": "The Moth Radio Hour: Me, Myself, and I: Stories of Questioned Identity",
  "pubDate": "Tue, 22 Sep 2020 20:00:00 -0000",
  "link": "https://beta.prx.org/stories/231307",
  "description": "<p>A “spambot” takes over a man’s life; rules are broken during a night at the bar; a woman’s career ambition is challenged by her health; and a young Mormon must weigh desire with devotion.</p>\n\n<p>Hosted by The Moth’s Executive Producer, Sarah Austin Jenness. The Moth Radio Hour is produced by The Moth and Jay Allison of Atlantic Public Media.</p>\n\n<p>Storytellers: Jon Ronson, Sitawa Wafula, Maureen Freeman, and Elna Baker.</p>",
  "enclosure": "",
  "itunes:subtitle": "A “spambot” takes over a man’s life; rules are broken during a night at the bar; a woman’s career ambition is challenged by her health; and a young Mormon must weigh desire with devotion. Hosted by The Moth’s Executive Producer, Sarah Austin Jenness.",
  "itunes:explicit": true,
  "itunes:episodeType": "full",
  "itunes:duration": "53:21",
  "category": [
    "live",
    "mothradiohour",
    "performance",
    "stories",
    "storytelling"
  ],
  "itunes:author": "The Moth",
  "itunes:summary": "A “spambot” takes over a man’s life; rules are broken during a night at the bar; a woman’s career ambition is challenged by her health; and a young Mormon must weigh desire with devotion. Hosted by The Moth’s Executive Producer, Sarah Austin Jenness. The Moth Radio Hour is produced by The Moth and Jay Allison […]",
  "itunes:image": "",
  "media:content": "",
  "content:encoded": "<p>A “spambot” takes over a man’s life; rules are broken during a night at the bar; a woman’s career ambition is challenged by her health; and a young Mormon must weigh desire with devotion.</p>\n\n<p>Hosted by The Moth’s Executive Producer, Sarah Austin Jenness. The Moth Radio Hour is produced by The Moth and Jay Allison of Atlantic Public Media.</p>\n\n<p>Storytellers: Jon Ronson, Sitawa Wafula, Maureen Freeman, and Elna Baker.</p>"
}