{
  "title": "Modeling Solids in Nuclear Astrophysics with Smoothed Particle Hydrodynamics. (arXiv:2211.01927v1 [astro-ph.IM])",
  "link": "http://arxiv.org/abs/2211.01927",
  "description": "<p>Smoothed Particle Hydrodynamics (SPH) is a frequently applied tool in\ncomputational astrophysics to solve the fluid dynamics equations governing the\nsystems under study. For some problems, for example when involving asteroids\nand asteroid impacts, the additional inclusion of material strength is\nnecessary in order to accurately describe the dynamics. In compact stars, that\nis white dwarfs and neutron stars, solid components are also present. Neutron\nstars have a solid crust which is the strongest material known in nature.\nHowever, their dynamical evolution, when modeled via SPH or other computational\nfluid dynamics codes, is usually described as a purely fluid dynamics problem.\nHere, we present the first 3D simulations of neutron-star crustal toroidal\noscillations including material strength with the Los Alamos National\nLaboratory SPH code FleCSPH. In the first half of the paper, we present the\nnumerical implementation of solid material modeling together with standard\ntests. The second half is on the simulation of crustal oscillations in the\nfundamental toroidal mode. Here, we dedicate a large fraction of the paper to\napproaches which can suppress numerical noise in the solid. If not minimized,\nthe latter can dominate the crustal motion in the simulations.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Sagert_I/0/1/0/all/0/1\">Irina Sagert</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Korobkin_O/0/1/0/all/0/1\">Oleg Korobkin</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Tews_I/0/1/0/all/0/1\">Ingo Tews</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Tsao_B/0/1/0/all/0/1\">Bing-Jyun Tsao</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Lim_H/0/1/0/all/0/1\">Hyun Lim</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Falato_M/0/1/0/all/0/1\">Michael J. Falato</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Loiseau_J/0/1/0/all/0/1\">Julien Loiseau</a>"
}