{
  "id": "tag:blogger.com,1999:blog-17171206.post-172078101208900982",
  "published": "2016-02-02T10:35:00.001-08:00",
  "updated": "2016-02-02T10:35:10.267-08:00",
  "title": "Where am I?",
  "content": "There have recently been some articles (e.g. <a href=\"https://www.poweradmin.com/blog/51-devops-influencers-to-start-following-today/\">This</a> list of influencers) that have pointed to this blog and lamented that I don't update it regularly anymore. It is true. I now realize I should have at least posted something here to direct readers to the places where I keep posting in case they find I might have something interesting to say.<br /><br />First and foremost, given that I joined <a href=\"http://www.quora.com/\">Quora</a> about a year ago, I have been using the Quora product itself to post most of my writing. You can find my profile <a href=\"https://www.quora.com/profile/Xavier-Amatriain\">here</a>. I have found that I can reformulate almost anything I want to say in the form of an answer to a Quora question. Besides, my posts there get a ton of views (I am almost about to reach 2 million views in about a year) and good interactions. Also, I have written some posts in the <a href=\"https://engineering.quora.com/\">Quora Engineering Blog</a> describing some of our work.<br /><br />I also keep very active on <a href=\"https://twitter.com/xamat\">Twitter</a>, and every now and then I will update my <a href=\"https://www.linkedin.com/in/xamatriain\">LinkedIn</a> with some professional posts.<br /><br />Recently, I gave <a href=\"https://medium.com/@xamat\">Medium</a> a try. I am not really sure how often I will update my blog there, but I am almost certain that my Medium blog will take precedence over this one. Medium is indeed a much better blogging platform than Blogger.<br /><br />So, yes, I guess this is a farewell to Technocalifornia unless every now and then I decide to simply post a collection of posts elsewhere just to make sure that people visiting this blog don't get the sense that I am not active anymore. Let me know if you feel that would be interesting for you.",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Xavier Amatriain",
    "uri": "http://www.blogger.com/profile/14166119485952054870",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}