{
  "title": "Deep Learning Hamiltonians from Disordered Image Data in Quantum Materials. (arXiv:2211.01490v1 [cond-mat.str-el])",
  "link": "http://arxiv.org/abs/2211.01490",
  "description": "<p>The capabilities of image probe experiments are rapidly expanding, providing\nnew information about quantum materials on unprecedented length and time\nscales. Many such materials feature inhomogeneous electronic properties with\nintricate pattern formation on the observable surface. This rich spatial\nstructure contains information about interactions, dimensionality, and disorder\n-- a spatial encoding of the Hamiltonian driving the pattern formation. Image\nrecognition techniques from machine learning are an excellent tool for\ninterpreting information encoded in the spatial relationships in such images.\nHere, we develop a deep learning framework for using the rich information\navailable in these spatial correlations in order to discover the underlying\nHamiltonian driving the patterns. We first vet the method on a known case,\nscanning near-field optical microscopy on a thin film of VO2. We then apply our\ntrained convolutional neural network architecture to new optical microscope\nimages of a different VO2 film as it goes through the metal-insulator\ntransition. We find that a two-dimensional Hamiltonian with both interactions\nand random field disorder is required to explain the intricate, fractal\nintertwining of metal and insulator domains during the transition. This\ndetailed knowledge about the underlying Hamiltonian paves the way to using the\nmodel to control the pattern formation via, e.g., tailored hysteresis\nprotocols. We also introduce a distribution-based confidence measure on the\nresults of a multi-label classifier, which does not rely on adversarial\ntraining. In addition, we propose a new machine learning based criterion for\ndiagnosing a physical system's proximity to criticality.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cond-mat/1/au:+Basak_S/0/1/0/all/0/1\">S. Basak</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Banguero_M/0/1/0/all/0/1\">M. Alzate Banguero</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Burzawa_L/0/1/0/all/0/1\">L. Burzawa</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Simmons_F/0/1/0/all/0/1\">F. Simmons</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Salev_P/0/1/0/all/0/1\">P. Salev</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Aigouy_L/0/1/0/all/0/1\">L. Aigouy</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Qazilbash_M/0/1/0/all/0/1\">M. M. Qazilbash</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Schuller_I/0/1/0/all/0/1\">I. K. Schuller</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Basov_D/0/1/0/all/0/1\">D. N. Basov</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Zimmers_A/0/1/0/all/0/1\">A. Zimmers</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Carlson_E/0/1/0/all/0/1\">E. W. Carlson</a>"
}