{
  "title": "OkCupid’s Dating Data Center",
  "link": "https://theblog.okcupid.com/okcupids-dating-data-center-5b1271fdf94d?source=rss----2cd59e7d4ed1--data",
  "guid": "https://medium.com/p/5b1271fdf94d",
  "category": [
    "love",
    "data",
    "relationships",
    "dating",
    "dating-data-center"
  ],
  "dc:creator": "OkCupid",
  "pubDate": "Thu, 01 Jul 2021 15:10:45 GMT",
  "atom:updated": "2021-08-09T20:22:35.957Z",
  "content:encoded": "<h4>What singles are matching on in July 2021</h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*1p6l_UgVOqjpZ-dW6tx1wQ.gif\" /></figure><p>Every month we will be sharing the latest OkCupid matching questions and responses, showing what’s top of mind for our millions and millions of daters around the world. Our newest questions cover everything from Juneteenth to pandemic restrictions to first date etiquette.</p><h4><strong>What we’re asking</strong>:</h4><ul><li>Is it important that your date celebrates Juneteenth?</li><li>How do you most like to celebrate Juneteenth?</li><li>Would you go on a first date with someone on the 4th of July?</li><li>Now that restrictions are being lifted, what are you more excited for?</li><li>Would you plan a vacation with someone you have never met in person?</li><li>Will you be following the 2021 Olympic Games?</li><li>Do you mind silence on a first date?</li><li>Is it okay to post a first date on social media?</li><li>Which best describes you on your first phone call with someone you’re dating?</li></ul><h4><strong>What you’re saying</strong>:</h4><ul><li>Thousands of daters on OkCupid in the United States recently said it’s important to them that their date celebrates Juneteenth, with support highest among Gen Z and Millennial women</li><li>Users who answered yes are getting 20% more matches and 50% more likes on average</li><li>43% of OkCupid respondents said they celebrated Juneteenth by educating themselves on Black culture and history while 23% said they attended a related event, 20% supported Black-owned businesses and 14% listened to Black artists and watched Black movies</li><li>About 9 in 10 daters (87%) say they plan to go on a first date this holiday weekend for July 4th</li><li>Gen Z daters on OkCupid are more likely than Millennials to be excited to go on dates now that restrictions are being lifted</li><li>Millennials and Gen Z are more likely than Gen X to plan a vacation with someone they have never met in person</li><li>Those who are open to planning a vacation with someone they have never met before receive 31% more matches on average</li><li>Millennials are more likely to follow the 2021 Olympic Games than Gen Z</li><li>About 6 in 10 people on OkCupid say they do not mind silence on a first date</li><li>More than half of OkCupid respondents say it is okay to post a first date on social media</li><li>Gen Z are 2X more likely to nervously pace the room while on the first phone call with someone they’re dating instead of being relaxed on the couch</li></ul><p><em>Dive into the summer of love. </em><a href=\"https://okcupid.onelink.me/godV/44c7b6b0\"><em>Download OkCupid</em></a><em> to find someone now.</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=5b1271fdf94d\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://theblog.okcupid.com/okcupids-dating-data-center-5b1271fdf94d\">OkCupid’s Dating Data Center</a> was originally published in <a href=\"https://theblog.okcupid.com\">OkCupid Dating Blog</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
}