{
  "guid": "prx_137_f7087ba6-fdbe-486a-a162-cd1fac076e56",
  "title": "762 - Game of Drones - All Seasons Tale of the Tape",
  "pubDate": "Wed, 10 Apr 2019 23:00:00 -0000",
  "link": "https://beta.prx.org/stories/272081",
  "description": "<p>How many seasons have there been? Can Scoots remember? How many characters will get left out or names forgotten as he tried to recap the entire series in about fifty minutes. This will be a retrospective you can sleep right through.<br>\n<br>\nYou can find all of our sponsors or become a patron on our new website <a href=\"http://www.sleepwithmepodcast.com/\" rel=\"nofollow\" target=\"_blank\">http://www.sleepwithmepodcast.com</a> story starts at about 20:00)<br>\n<br>\nCheck out “Start With This” in your podcast app or at <a href=\"http://www.nightvalepresents.com/startwiththis\" rel=\"nofollow\" target=\"_blank\">http://www.nightvalepresents.com/startwiththis </a>“Start With This” is a podcast gone creativity playground designed to put your ideas in motion, from the creators of “Welcome to Night Vale”, Joseph Fink and Jeffrey Cranor.<br>\n<br>\nTonight’s show is sponsored by Quip! The sensitive sonic toothbrush I have been using for over two years (not over and over! Changing out the brush heads every three months!) Quip starts at just $25 and if you go to <a href=\"http://www.getquip.com/sleep\" rel=\"nofollow\" target=\"_blank\">http://www.getquip.com/sleep</a>, you get your first refill pack for FREE with a quip electric toothbrush.<br>\n<br>\nTonight’s episode is sponsored by Casper. Get $100 toward select mattresses by visiting <a href=\"http://www.casper.com/sleepwith\" rel=\"nofollow\" target=\"_blank\">http://www.casper.com/sleepwith</a> and using “sleepwith” at checkout. Terms and Conditions apply. You can be sure of your purchase with Casper’s 100 night risk-free, sleep-on-it trial.<br>\n<br>\nWelcome our newest sponsor Robinhood - an investing app that lets you buy and sell stocks, E-T-F’s (exchange-traded funds), options, and cryptos- all commission-free. They strive to make financial services work for everyone, not just the wealthy.Robinhood is giving listeners a FREE stock like Apple, Ford or Sprint to help build your portfolio. Sign up at <a href=\"http://sleep.robinhood.com/\" rel=\"nofollow\" target=\"_blank\">sleep.robinhood.com</a>!</p>",
  "enclosure": "",
  "itunes:title": "Game of Drones - All Seasons Tale of the Tape",
  "itunes:subtitle": "How many seasons have there been? Can Scoots remember? How many characters will get left out or names forgotten as he tried to recap the entire series in about fifty minutes. This will be a retrospective you can sleep right through.",
  "itunes:episodeType": "full",
  "itunes:episode": 762,
  "itunes:duration": "01:06:12"
}