{
  "id": "tag:blogger.com,1999:blog-8913912091036362264.post-1229870125662437418",
  "published": "2020-04-08T09:00:00.000-07:00",
  "updated": "2020-04-08T09:00:01.165-07:00",
  "title": "Pray #WithMe: Connect online with your faith community",
  "content": "This week, millions of people across the globe will celebrate Passover and Easter. And in the coming weeks, millions will begin to observe Ramadan. This year, these important religious holidays will feel very different, as faith organizations all over the world look for new ways to celebrate safely in order to reduce the spread of COVID-19 within their communities. <br /><br />During these difficult times, it’s important for us to continue to connect with each other and feel part of our wider communities, even from home.  <br /><br />While some faith organizations have used digital tools to connect with their congregations for many years, this year’s broadly mandated orders to stay home will make it essential for churches, synagogues, mosques, families and individuals to find new ways of coming together, online. <br /><br />The shift has already begun. Since the start of March, the combined subscribers of all <a href=\"https://www.youtube.com/user/vatican\" target=\"_blank\">Vatican News</a> channels has more than doubled. <br /><br />To assist faith organizations everywhere who are new to online services, YouTube has brought together  helpful information to get started with live streaming. Please visit our <a href=\"https://www.youtube.com/playlist?list=PLpjK416fmKwSJ5EvkT9th8mmz_p8x1ReL\" target=\"_blank\">Playlist</a> and <a href=\"https://support.google.com/youtube/topic/9257891?hl=en&amp;ref_topic=9257610\" target=\"_blank\">Help Center</a> for best practices, or check out instructions for hosting a live stream event either from a <a href=\"https://www.youtube.com/watch?v=V2nFR-nxUCo\" target=\"_blank\">mobile device</a> or <a href=\"https://www.youtube.com/watch?v=Ok3qM3ecWJU\" target=\"_blank\">desktop</a>.  <br /><br />For those who are observing Passover this week, synagogues are offering many ways to share and celebrate online. <a href=\"https://www.youtube.com/channel/UCxLjQlG2DTP3Obi2492EyIg\" target=\"_blank\">Park Avenue Synagogue</a>, in New York City, is live streaming Seders and festival services throughout the week, starting with a one hour Seder on Wednesday, April 8 at 6 p.m. ET.  <br /><br />We also invite you to celebrate with a special Saturday Night Seder, premiering exclusively on YouTube via <a href=\"https://www.youtube.com/channel/UCJFp8uSYCjXOMnkUyb3CQ3Q\" target=\"_blank\">Tasty</a> and <a href=\"https://www.saturdaynightseder.com/\" target=\"_blank\">SaturdayNightSeder</a> on Saturday, April 11 at 8 p.m. ET. This Passover-themed variety show will raise funds for the <a href=\"https://www.cdcfoundation.org/\" target=\"_blank\">CDC Foundation</a>, and includes comedy sketches, heartfelt moments and music, with an impressive list of participants including Jason Alexander, Ben Platt, Idina Menzel, Dan Levy, Henry Winkler, Tan France and Senator Chuck Schumer, among many others. <br /><br />For those celebrating Good Friday and Easter, many churches are hosting live streams for their local congregations, so please check in with your church. <a href=\"https://www.youtube.com/user/vatican\" target=\"_blank\">The Vatican</a> will live stream all of its Holy Week services from St. Peter’s Basilica, including Easter Sunday mass at 11 a.m. CET.  <br /><br />Renowned opera singer <a href=\"https://www.youtube.com/user/andreabocelli\" target=\"_blank\">Andrea Bocelli</a> will perform live at 7 p.m. CET on Sunday, April 12 from Milan’s historic Duomo Cathedral, available exclusively on YouTube.  The concert entitled, “Music For Hope,” will represent a message of love, healing and hope to Italy and the world. The Duomo, currently closed,  will open its doors exceptionally for Andrea Bocelli who will be accompanied only by the cathedral organist, Emanuele Vianelli, playing one of world’s largest pipe organs. The “Music For Hope” trailer can be seen <a href=\"https://www.youtube.com/watch?v=lI6nH5-_J3c\" target=\"_blank\">here</a>.  <br /><br />We’ll have more to share in the next few weeks about upcoming Ramadan celebrations.  <br /><br />We wish safe and healthy holidays for faith communities across the world. <br /><br /><i>—The YouTube Team </i>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube",
    "uri": "http://www.blogger.com/profile/03369985352764236236",
    "email": "noreply@blogger.com",
    "gd:image": ""
  }
}