{
  "id": "yt:video:cVZ_fYxx4WY",
  "yt:videoId": "cVZ_fYxx4WY",
  "yt:channelId": "UCwKTbPQOdBFrkSvGrO-8v3g",
  "title": "The Shins: Oh, Inverted World - The 21st Birthday Tour",
  "link": "",
  "author": {
    "name": "theshins",
    "uri": "https://www.youtube.com/channel/UCwKTbPQOdBFrkSvGrO-8v3g"
  },
  "published": "2022-05-12T13:48:14+00:00",
  "updated": "2022-05-26T21:45:13+00:00",
  "media:group": {
    "media:title": "The Shins: Oh, Inverted World - The 21st Birthday Tour",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The Shins are bringing their classic 2001 debut album Oh, Inverted World to life in its entirety with a 21st Birthday Tour this summer. Beginning on July 12th in San Francisco, the band will embark on a two month tour of North America performing the landmark album from start to finish — plus a nightly rotation of additional fan favorites and deep cuts. The “low-key masterpiece” (The New York Times) will celebrate 21 years since its arrival on June 19, 2001. \n\nJames Mercer's injection of emotional sincerity and melodic ambition redefined the indie rock paradigm at the dawn of the 21st century — and Oh, Inverted World sounds every bit as fresh, honest and expansive as it did then. Upon its original release over two decades ago, Oh, Inverted World was quickly praised by The New York Times as “a beguiling but confounding little album that wasn't as little as it first seemed.” Today, Billboard agrees, “Twenty years later, the sound of Mercer’s sublime vocals over tranquil acoustic guitar is just as affecting.”\n\n“Everything was so tongue-in-cheek in the indie world of the ’90s,” Mercer says today. “I remember feeling a longing for some sort of romance in music again, something earnest, like a real attempt at some emotional language.” \n\nReissued last year in a 20th anniversary edition remastered by Bob Ludwig, Oh, Inverted World is one of those rare masterworks that remains as concise as it is vital, with not an iota of filler. Mercer says of Oh, Inverted World, “This record symbolized a very special moment in my life, a watershed moment for sure.” Their debut full length, caused a seismic shift in the indie rock world upon its release in 2001, singlehandedly ushering in the modern era of the genre. The record packs 11 tracks into barely over 30 minutes, including gems like “New Slang,” “Caring Is Creepy,” “Girl Inform Me”—every one of which “became defining touchstones of millennial indie rock.” (Entertainment Weekly).\n\nWith support from Portland sister trio Joseph, the tour will make stops at iconic venues like Red Rocks, Radio City Music Hall and the Ryman Auditorium, ending at Portland’s Pioneer Courthouse Square on September 16. \n\nTickets are on sale now: https://www.ohinvertedworldtour.com \n\nOH, INVERTED WORLD – THE 21ST BIRTHDAY TOUR\n\n07/12/22 – San Francisco, CA – The Warfield ^\n07/15/22 – Sacramento, CA – Memorial Auditorium ^\n07/16/22 – Saratoga, CA – The Mountain Winery ^\n07/18/22  – Los Angeles, CA – Orpheum Theatre ^\n07/22/22 – Las Vegas, NV – The Theater at Virgin Hotels Las Vegas ^\n07/23/22 – San Diego, CA – San Diego Civic Theatre ^\n07/24/22 – Phoenix, AZ - Marquee Theatre ^\n07/26/22 – Morrison, CO – Red Rocks Amphitheatre ^\n07/27/22 – Kansas City, MO – Arvest Bank Theatre at The Midland ^\n07/29/22 – Austin, TX – ACL Live at The Moody Theater ^\n07/30/22 – Austin, TX – ACL Live at The Moody Theater ^\n08/01/22 – Houston, TX – White Oak Music Hall ^\n08/02/22 – Dallas, TX – The Factory in Deep Ellum ^\n08/04/22 – Albuquerque, NM – Kiva Auditorium ^\n08/06/22 – Ogden, UT – Ogden Twilight at the Ogden Amphitheater ^\n08/16/22 – Atlanta, GA – The Eastern ^\n08/17/22 – Nashville, TN – Ryman Auditorium ^\n08/19/22 – Washington, DC – The Anthem ^\n08/20/22 – Richmond, VA – The National ^\n08/23/22 – New York, NY – Radio City Music Hall ^\n08/26/22 – Philadelphia, PA – Skyline Stage at the Mann ^\n08/27/22 – Boston, MA – Roadrunner ^\n08/29/22 – Montreal, QC – L’Olympia ^\n08/30/22 – Toronto, ON – Massey Hall ^\n08/31/22 – Detroit, MI – Masonic Cathedral Theatre ^\n09/02/22 – Cleveland, OH – The Agora ^\n09/03/22 – Pittsburgh, PA – Stage AE ^\n09/04/22 – Columbus, OH – KEMBA Live! ^\n09/06/22 – Saint Louis, MO – The Factory ^\n09/08/22 – Chicago, IL – Chicago Theatre ^\n09/10/22 – Minneapolis, MN – Orpheum Theatre ^\n09/13/22 – Seattle, WA – Paramount Theatre ^\n09/14/22 – Vancouver, BC – Queen Elizabeth Theatre ^\n09/16/22 – Portland, OR – Pioneer Courthouse Square**\n\n\n^ With special guest Joseph\n**Support Act TBA",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}