{
  "title": "Is The Death Industry Haunted? | Best of RGSO",
  "link": "https://audioboom.com/posts/8080502",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1882,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>What paranormal event made a death investigator question if they should go any further into their investigation?<br>\nHere is a preview of the story.<br>\n“One of my first case was where a man took his own life because he got caught looking a younger kid. It was a strange feeling just being in the area we were in. I am not sure if it was because I was during a peso, or it was just strange feeling due to being new to this career. I did not work with dead people before this. A while later my kids kept complaining they would hear my voice calling them when I was not home. They also told me that they would see someone go room to room and assumed it was their dad or I had come home early. I ended up sagging my house with palo santos and saying a prayer over my children, the house, my husband and me. It seemed to diminish after that. I hate to think something would follow me home but it a possibility. I have always had a connection with the other side I believe, seeing people who have passed in my dreams, seeing \"ghost\" or individuals’ others could not see, having one those gut feelings before something bad happened. At another scene, I was putting on ankle tag onto the decedent. At that moment I felt the area get still or silent like as if I were in a bubble. My coworker, 2 cops, and our third-party transport was in the living area of the residence. I then heard the others gasp and my coworker yelling \"What the hell was that\". I go out into the living room area and asked what is going on. They told me you did not hear that laugh. I said no but it was eerily quiet in there.”<br>\n<br>\n\n</div>\n<div>Watch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\n\n</div>\n<div>If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n",
  "pubDate": "Sun, 29 May 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-05-09:/posts/8080502",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}