{
  "id": "yt:video:91yro7IPSb4",
  "yt:videoId": "91yro7IPSb4",
  "yt:channelId": "UCMTk_R_Y49jvq-HQXDmKI0Q",
  "title": "How One \"Man\" Fooled Us All - The Strange Story Of Samurai Buyer | TRO",
  "link": "",
  "author": {
    "name": "The Right Opinion",
    "uri": "https://www.youtube.com/channel/UCMTk_R_Y49jvq-HQXDmKI0Q"
  },
  "published": "2020-06-17T21:59:58+00:00",
  "updated": "2022-02-09T05:52:15+00:00",
  "media:group": {
    "media:title": "How One \"Man\" Fooled Us All - The Strange Story Of Samurai Buyer | TRO",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "How One \"Man\" Fooled Us All - The Strange Story Of Samurai Buyer | TRO\n\n0:00 - Intro\n5:59 - The Rise Of Samurai Buyer\n12:26 - i Dubbbed\n19:02 - Cherry Blossom\n25:57 - Stormy Weather\n33:09 - Collateral\n43:39 - Samurai Liar\n52:29 - Sayonara\n\nIntro:\n\nImage can be reflected in our demeanour, our actions, our comments, and equally, it will be defined by how people interpret that behaviour. When we encounter people, and other alike entities, we spend a lot of time attempting to paint a mental picture in our head for how we envision them. Now, we cannot look into their minds and read their every intention, but some judgement is always necessary, because when we have to make a decision which may involve bestowing responsibility or trust in certain people, then that mental picture has to be factored in. \n\nHowever, this is typically reserved for personal relationships, and although we may hold greater opinions about certain issues, we won’t typically assign a face to it. This is particularly the case with corporations. Now, it’s completely valid to have distaste for companies and their conduct, but it’s also reasonable to accept that most companies are made up of a lot of interacting tiers, and this can lead to them pretty much being separated from the idea of consciousness altogether. Although I wouldn’t actually agree with that, and urge others to keep in mind that a decision will typically have a person behind it, it is often hard to conceptually feel any emotional connection to what a company may do, hell, if we did we’d probably never stop being upset, and we need to look out for our mental well being too you know.\n\nYouTube occupies a weird medium between the world of intimacy and distance, because although we may not feel a connection to a lot of creators on a personal level, their success partly relies on the direct support that we pledge towards them. A lot of celebrities feel a bit beyond our world, and YouTube creates communities that people can be involved in, however, because of that, there is a bit more direct accountability, and a judgement that does feel a little more personal. Therefore, we tend to apply certain standards for creators that we may not give to large multinational corporations, partly because of that connection, and partly because we actually have the power to hold them accountable.\n\nOver the last few years, we’ve witnessed companies attempt to be quote “woke”, and relate to the human condition, yet it never feels particularly real because, although amusing, you receive the impression it’s just another campaign focused towards the demographic of depressed teenagers who occupy the Twitter hellscape. On top of this, the Tweets are never really channeled through the mind of an individual, and therefore we never put a face to the company or develop a personal connection. \n\nHowever, in 2015, a business managed to infiltrate a budding YouTube community, through a character who would become almost synonymous with the product that he was offering. Yes, long before BetterHelp would cause many creators to reevaluate how they keep an eye on the sponsors they collaborate with, there was an even more bewildering controversy, surrounding one of the most iconic YouTube sponsors: Samurai Buyer.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}