{
  "id": "yt:video:wGQgd-G7BdQ",
  "yt:videoId": "wGQgd-G7BdQ",
  "yt:channelId": "UCAsLjyYl9GW66G1mpMzr8IA",
  "title": "I’m Stuck With My Crush For 2 Weeks | Childhood Sweethearts Ep.4",
  "link": "",
  "author": {
    "name": "MinuteVideos",
    "uri": "https://www.youtube.com/channel/UCAsLjyYl9GW66G1mpMzr8IA"
  },
  "published": "2021-03-12T14:00:20+00:00",
  "updated": "2022-05-20T05:18:41+00:00",
  "media:group": {
    "media:title": "I’m Stuck With My Crush For 2 Weeks | Childhood Sweethearts Ep.4",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "What would you do if your crush who broke your heart, walked back into your life a year later? What if you were stuck together for 2 weeks with no choice but to be around each other every day... Would you forgive him for what he did and go back to how it used to be? Or would you ignore him and move on?\n\n\"I hated the fact that I was always the one who had to apologise to Lacey.  Lacey is a good person and can be a great friend, but we would be so much closer if Aiden hadn't come between us. And because of this, I know there would always be tension between us. I loved him. In the back of my mind, I've always wanted to get back at her. Hurt her the way she hurt me. I was about to knock on Carter's door, when it opened and I came face-to-chest with Carter chest.\n\n\nCarter: \"Take a picture. It will last longer.\" \nMercedes: \"Um, r-right. Is Lacey home?\" \nCarter: \"Nope. Her pet came and picked her up about ten minutes ago. Just missed them.\" \nMy lips spread in a thin line at his word choice. Describing Aiden as a 'pet' was not cool. Not when he was so, so much more than that.  \"But, you're welcome to come in if you'd like.\" His eyes swept over me not-so-subtly and I felt my heart rate quicken. \nEvery girl wanted Carter Williams to notice her. I felt like I was beginning my five seconds of fame.  \nMercedes: \"You're asking me to come in?\" \nCarter: \"Well, that's what it looks like. Unless you have something better to do, of course.\"\n\nChildhood Sweethearts a fictional series based on Lauren Jackson's (LaurenJ22), the award-winning Wattpad author of the book,' Childhood Sweethearts' now as an animation series. We hope you enjoy this series as much as we did! Please let us know what cha think and if you are #TeamAiden or #TeamCarter in the comments! :)\n\nIf you loved it and want to see episode 3, please use the hashtag in the comments: \n\n#ChildhoodSweethearts \n\nFollow The Author: \n\nInstagram: laurenj_22 or https://www.instagram.com/laurenj_22/ \n\nWattpad: https://www.wattpad.com/user/LaurenJ22\n\nTikTok: https://vm.tiktok.com/w3UVhH/\n\nFollow The Artist: chulee.kob 💕\n\nSubmit your story at: https://community02.com/story/new\nLike us on Facebook: https://www.facebook.com/minutevideos.productions\nFollow us on Instagram: http://www.instagram.com/minutevideosdotcom\nSupport us on Patreon: https://www.patreon.com/minutevideos",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}