{
  "id": "https://bibleinoneyear.org/en/youth/219",
  "title": "Day 219: Three Bad Attitudes That Cause Division",
  "description": "Psalm 92:7,9,12–13, 1 Chronicles 24:3b,5a, 1 Corinthians 3:1–11,21.  This kind of division is one we must do our very best to avoid  It is this kind of division that the apostle Paul speaks against in the New Testament passage for today",
  "pubDate": "Sun, 07 Aug 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/219/",
  "itunes:duration": "13:22",
  "guid": "enyouth07082022-219",
  "length": 802.95,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 219: Three Bad Attitudes That Cause Division",
  "itunes:subtitle": "Psalm 92:7,9,12–13, 1 Chronicles 24:3b,5a, 1 Corinthians 3:1–11,21.  This kind of division is one we must do our very best to avoid  It is this kind of division that the apostle Paul speaks against in the New Testament passage for today",
  "itunes:summary": "During my time at university, I shared rooms together with my great friend Nicky Lee who became one of the associate vicars of HTB. We did all our own catering; I did the cooking and Nicky Lee did the dividing. He was an expert at dividing whatever was cooked into exactly equal portions! This is but one instance where division is used in a good sense rather than a bad one.\nDivisions are a fact of life. They need not necessarily be a bad thing. Indeed, they may even be necessary. For example, placing people in different divisions in an organisation may be helpful and important. We see this kind of division in the Old Testament passage for today.\nThen, there is the division that will take place on the day of judgment. This is a necessary division between good and evil. This kind of division can be seen in the psalm for today.\nThere is also a third kind of division, which is not good, helpful or necessary. Disunity and division in the church is a tragedy. This kind of division is one we must do our very best to avoid. It is this kind of division that the apostle Paul speaks against in the New Testament passage for today.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 584
}