{
  "id": "https://bibleinoneyear.org/en/youth/125",
  "title": "Day 125: Jesus Always Delivers",
  "description": "Psalm 56:3-4, Judges 2:16; 3:9,11,15,30b–31, John 4:28–29,39-42.  He is one example of the millions of people whom Jesus has delivered from addiction and set free  Ah Yin has spent the rest of his life testifying about the saviour who always delivers",
  "pubDate": "Wed, 05 May 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/125/?ignore",
  "itunes:duration": "14:17",
  "guid": "enyouth05052021-125",
  "length": 857.99,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 125: Jesus Always Delivers",
  "itunes:subtitle": "Psalm 56:3-4, Judges 2:16; 3:9,11,15,30b–31, John 4:28–29,39-42.  He is one example of the millions of people whom Jesus has delivered from addiction and set free  Ah Yin has spent the rest of his life testifying about the saviour who always delivers",
  "itunes:summary": "Pippa and I met Ah Yin when we visited Jackie Pullinger in Hong Kong. He had become a drug addict as a teenager. His father was an addict. He was brought up in the notorious Walled City. He joined a gang at the age of eleven. They ate, stole, fought and took heroin together. At the age of fourteen, he got caught doing a robbery and spent his first time in detention.\nOver the years he tried everything to get off drugs. Nothing worked. Then he met Jackie and, through the power of Jesus, came off drugs with no pain at all. Since then he has become one of the leaders of Jackie’s work in Hong Kong. He has trained many people to pray for the sick and to work with the poor. He is one example of the millions of people whom Jesus has delivered from addiction and set free. Ah Yin has spent the rest of his life testifying about the saviour who always delivers.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 125
}