{
  "id": "tag:blogger.com,1999:blog-6959495683334200101.post-8856035538557174174",
  "published": "2018-10-22T09:00:00.000-07:00",
  "updated": "2018-10-25T08:33:45.716-07:00",
  "title": "A Final Update on Our Priorities for 2018",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\">Dear Creators,<br /><br />Since 2005, YouTube has transformed from a single video at the zoo to a global video library where billions of people turn to each day for knowledge, creativity and connection. Today, YouTube is a diverse community of creators who are building the next generation of media companies and drawing fans from every corner of the world. You are making history and changing the way people watch video, engage with each other and share their voice. I feel honored to help you do this, and I continue to be inspired by what I see.<br /><br />In the last year, the number of channels with over 1 million subscribers has increased by 75%. Each month, more than one billion fans come to YouTube to be part of music culture and discover new songs and artists. Building on that momentum, we’ve expanded YouTube Music to the UK, Ireland, Germany, Austria, France, Italy, Spain, Sweden, Norway, Finland, Russia, Canada, Denmark, Belgium, the Netherlands, Luxembourg and Brazil. We also rolled out three new stories on <a href=\"https://www.youtube.com/watch?v=QIz5MHKV1nk&amp;feature=youtu.be\" target=\"_blank\">Janelle Monáe</a>, <a href=\"https://www.youtube.com/watch?v=qZ9hBdgC4lo\" target=\"_blank\">J Balvin</a> and <a href=\"https://www.youtube.com/watch?v=ZYkvxtriIrI&amp;feature=youtu.be\" target=\"_blank\">Shawn Mendes</a> in our YouTube Artist Spotlight series over the last few months. And we launched 13 YouTube Originals in the last quarter, including three in Germany and two in France. <br /><br />All of this is possible because of the creative economy powered by you. However, this growing creative economy is at risk, as the EU Parliament <a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/news/eu-parliament-copyright-memes-latest-vote-internet-article-11-13-a8534121.html\" target=\"_blank\">voted on Article 13, copyright legislation</a> that could drastically change the internet that you see today. <br /><br />Article 13 as written threatens to shut down the ability of millions of people -- from creators like you to everyday users -- to upload content to platforms like YouTube. And it threatens to block users in the EU from viewing content that is already live on the channels of creators everywhere. This includes YouTube’s incredible video library of educational content, such as language classes, physics tutorials and other how-to’s.<br /><br />This legislation poses a threat to both your livelihood and your ability to share your voice with the world. And, if implemented as proposed, Article 13 threatens hundreds of thousands of jobs, European creators, businesses, artists and everyone they employ. The proposal could force platforms, like YouTube, to allow only content from a small number of large companies. It would be too risky for platforms to host content from smaller original content creators, because the platforms would now be directly liable for that content.&nbsp; We realize the importance of all rights holders being fairly compensated, which is why we built Content ID and a platform to pay out all types of content owners. But the unintended consequences of article 13 will put this ecosystem at risk.&nbsp; We are committed to working with the industry to find a better way.&nbsp; This language could be finalized by the end of the year, so it’s important to speak up now.<br /><br />Please take a moment to <a href=\"https://youtube.com/yt/saveyourinternet\" target=\"_blank\">learn more</a> about how it could affect your channel and take action immediately. Tell the world through social media (#SaveYourInternet) and your channel why the creator economy is important and how this legislation will impact you.<br /><br />Please read on for an update on our priorities for 2018.<br /><div><br /></div><br /><h3 style=\"text-align: left;\">Communication &amp; Transparency</h3>As I’ve written to you before, we’ve made a conscious effort to communicate with you more in the place where your conversations are taking place--social and video. Based on your feedback, we’ve also increased the number of product updates or “heads up” messages regarding changes to YouTube, including smaller tests or experiments, on our @TeamYouTube handle and the <a href=\"https://www.youtube.com/channel/UCGg-UqjRgzhYDPJMr-9HXCg\" target=\"_blank\">Creator Insider channel</a>. And we continue to share helpful tutorials and inspiring creator stories on our <a href=\"https://www.youtube.com/channel/UCkRfArvrzheW2E7b6SVT7vQ\" target=\"_blank\">YouTube Creators channel</a>, formerly the Creator Academy channel. We’re working to increase these efforts. I’m posting <a href=\"https://www.youtube.com/watch?v=sWXDNPLlovE\" target=\"_blank\">more videos</a> to my own channel and the Creator Insider channel just posted their 100th video!<br /><br />We’ve heard that you want communication from us in a simplified way and in one central location. To that point, we launched <a href=\"https://studio.youtube.com/\" target=\"_blank\">YouTube Studio</a>, the new one-stop shop for platform news and product updates. This is the primary place for getting YouTube-related information, such as announcements about new features, creator academy videos and Creator Insider weekly news flashes. This easy-to-view dashboard is THE place you can go to find the latest news and will be the new homepage for all creators by end of the year.<br /><br />Finally, our leadership continues to meet face-to-face with creators around the world. Robert Kyncl and Neal Mohan spoke to creators from across Europe, the Middle East and Africa at the Creator Summit in Berlin. Robert continued his series of Creator Interviews <a href=\"https://www.youtube.com/watch?v=p8w7SheU5qs\" target=\"_blank\">with Caspar Lee in Berlin</a> and Gautam Anand, Managing Director of YouTube APAC, sat down with <a href=\"https://www.youtube.com/watch?v=KL3n5z-KKDY\" target=\"_blank\">Korean creator Dotty in Seoul</a>. We saw incredible turn out at our Creator Summit in Seoul, with creators from across Asia Pacific, and, we look forward to hosting Latin American creators at our final 2018 Creator Summit in November.<br /><h3 style=\"text-align: left;\">Helping you succeed</h3>Monetization is the heart of your business. To that end, we released an update to our monetization systems this quarter, which improved the accuracy of monetization icons by 10%.<br /><br />In my last letter, I talked about our pilot to test a new video upload flow that asks creators to provide specific information about what’s in their video as it relates to our advertiser-friendly guidelines. Most creators in the pilot were able to accurately represent the content in their video, and it is providing more transparency to creators in terms of what type of content is suitable for ads. We hope to offer self certification to more creators before end of year and plan to expand broadly in early 2019.<br /><br />This summer, we announced Channel Memberships, and since then, we’ve seen thousands of creators take advantage of this feature. For instance, <a href=\"https://www.youtube.com/channel/UCcXhhVwCT6_WqjkEniejRJQ/join\" target=\"_blank\">Wintergatan</a>, creator of the Marble Machine, grew his revenue by more than 50% since adding channel memberships and is using it to fund his next generation Marble Machine and a World Tour. Gaming creator <a href=\"https://www.youtube.com/channel/UC7_YxT-KID8kRbqZo7MyscQ/join\" target=\"_blank\">Markiplier</a> increased his revenue by 20% and Comedy creator <a href=\"https://www.youtube.com/user/mikefalzone/join\" target=\"_blank\">Mike Falzone</a> tripled his YouTube revenue. We’ve also seen creators use Memberships to support creative endeavours, such as <a href=\"https://www.youtube.com/user/tristargymcanada/join\" target=\"_blank\">TriStar Gym</a> offering exclusive Brazilian Jiu Jitsu technique videos and <a href=\"https://www.youtube.com/user/fearedse/join\" target=\"_blank\">Ola Englund</a> offering guitar lessons online to members. Because of this success, we're accelerating the roll-out of memberships to more channels and lowering the subscriber threshold from 100,000 to 50,000 subscribers. We plan to expand memberships to even more of you in the months to come.<br /><br />Over the past few weeks, we've hosted three special editions of our <a href=\"https://youtube-creators.googleblog.com/2018/09/meet-creators-heading-to-three-special.html\" target=\"_blank\">NextUp</a> camps designed to support up-and-coming Black, Latino and <a href=\"https://www.standard.co.uk/tech/women-to-watch-youtube-space-london-a3936296.html\" target=\"_blank\">women creators</a>. We received more applications for this round than any other before it. If you missed your chance to apply this time, please stay tuned for the next round. We are hosting two more in Rio de Janeiro, Brazil and St. Petersburg, Russia and plan to announce more in the coming months.<br /><br /><h3 style=\"text-align: left;\">Giving people more ways to engage</h3>Since <a href=\"https://www.youtube.com/watch?v=Wbi_Ic1DDwQ\" target=\"_blank\">we announced Premieres</a> this summer, creators have been using this new feature to generate more views, more engagement and more revenue for their channel. For instance, <a href=\"https://www.youtube.com/user/twentyonepilots\" target=\"_blank\">Twenty One Pilots</a> premiered their new video <a href=\"https://youtu.be/8mn-FFjIbo8\" target=\"_blank\">My Blood</a> to more than 75,000 fans who watched it together and engaged over live chat and comments. One of our top gaming creators, <a href=\"https://www.youtube.com/user/theRadBrad\" target=\"_blank\">TheRadBrad</a>, tried it out and told his fans in his live chat that “it was one of the coolest experiences in my 8 years on YouTube.” And <a href=\"https://www.youtube.com/channel/UCXuqSBlHAE6Xw-yeJA0Tunw\" target=\"_blank\">Linus Tech Tips’</a> premiere of his <a href=\"https://www.youtube.com/watch?v=5HNnXJMJkY0\" target=\"_blank\">recent tech reviews</a> was one of his best performing videos. I’m happy to announce that premieres is now available to all creators.<br /><br />We recently introduced <a href=\"https://youtube-creators.googleblog.com/2018/08/introducing-youtube-giving-new-tools.html\" target=\"_blank\">YouTube Giving</a>, a suite of features that allow creators and nonprofits to raise funds for causes they care about directly on YouTube videos and live streams. While these features are currently in beta, we’ve seen creators use them to create inspiring impact. <a href=\"https://www.youtube.com/watch?v=7xkh30Hb42Y\" target=\"_blank\">Hope for Paws</a> raised over $100,000 in the first 10 days, and over 12 gaming creators have teamed up with <a href=\"https://www.youtube.com/watch?time_continue=1&amp;v=NGQ2Zhrkk4o\" target=\"_blank\">St. Jude Children’s Research Hospital</a> to raise over $125,000 throughout Childhood Cancer Awareness Month. Our hope is to expand these features soon to more creators so that they can give back and support causes they care about.<br /><br />Finally, we’re building a stronger gaming community on YouTube with features, such as our new <a href=\"https://www.youtube.com/gaming\" target=\"_blank\">Gaming Destination</a>, Gaming Creator on the Rise and dedicated pages for over 80,000 games. We’ll also be retiring the standalone gaming app next year. We know this change impacts a lot of you, but it will allow gaming creators to have greater access to fans while still providing a unique gaming experience.<br /><br /><h3 style=\"text-align: left;\">Tightening and enforcing our policies</h3>One of our biggest priorities from a policy perspective has been investing in the news experience on YouTube and tackling misinformation. In close collaboration with many of our news partners, we've rolled out a number of changes to address them. For example, we have worked to make credible sources more readily available to users and rolled out <a href=\"https://support.google.com/youtube/answer/9057101\" target=\"_blank\">breaking news and top news</a> shelves in 23 countries. We also hosted the first YouTube News working group meeting at our headquarters and used this opportunity to listen to news organizations, academics, and creators on how we can improve news on the platform. Finally, we’re supporting journalism with technology that allows news to thrive, including an innovation fund to help news organizations sustainably build their video capabilities. We know we have more to do to combat misinformation, and we will continue to invest in innovative solutions to address this.<br /><br />We also continue to provide updates to our YouTube Community Guidelines enforcement report, which you can <a href=\"https://transparencyreport.google.com/youtube-policy/overview\" target=\"_blank\">read here</a>.<br /><br /><h3 style=\"text-align: left;\">Learning and education</h3>Learning is one of the best parts of YouTube. In recent months, <a href=\"https://www.nytimes.com/2018/07/31/books/booktubers-youtube.html\" target=\"_blank\">BookTubers</a> came together for their annual <a href=\"https://www.youtube.com/channel/UCZhmQgR4l0MMisH-OGO729Q\" target=\"_blank\">BookTubeAThon</a>, during which creators read books, shared their thoughts via their channels and inspired people around the world to do the same. We also saw <a href=\"https://www.wsj.com/articles/quiet-im-cramming-for-finalsby-watching-someone-else-study-1528045886\" target=\"_blank\">“Study with me”</a> videos gain popularity--<a href=\"https://www.youtube.com/channel/UCc1tG1M1qP4IE6AQLXXWyww?mod=article_inline\" target=\"_blank\">motivating users</a> to persevere through their own study sessions. <br /><br />We’re committed to empowering both the creators who want to share their knowledge with the world and the users who come to our platform to learn--from home improvements to the basics of physics to grammar lessons. Today I’m happy to announce we’re investing $20 million in YouTube Learning, an initiative to support education focused creators and expert organizations that create and curate high quality learning content on YouTube. Part of this investment includes a Learning Fund to support creators who want to build multi-session learning content for YouTube. If you’re interested in this program, <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSeUTXdkXpUP9Mv__uAi925nAQXGz7TRJCoPDT7-L3PRqkGK6w/viewform\" target=\"_blank\">please fill out this form</a>. <br /><br />As part of efforts to support creators who are sharing their knowledge on the platform, we also launched <a href=\"https://www.youtube.com/channel/UCdxpofrI-dO6oYfsqHDHphw\" target=\"_blank\">Learning</a>, a new channel of curated tutorials, DIY videos, skill-based playlists, and other high-quality educational content from a range of creators. And we hosted three YouTube EduCon gatherings in Los Angeles, Mexico City and Rio de Janeiro. These conferences were great opportunities for Edutubers to network and learn new skills, and we’re planning to hold more conferences in new places in the upcoming year. <br /><br />At YouTube, we hope to give back. We’ve worked with Lily Singh to <a href=\"https://www.youtube.com/watch?v=t_RbKWvHaTM&amp;feature=youtu.be\" target=\"_blank\">support girls’ education</a> and fight violence against children, and we teamed up with <a href=\"https://www.youtube.com/watch?v=ErW-0LhR1Fs&amp;feature=youtu.be\" target=\"_blank\">Priyanka Chopra</a>, <a href=\"https://youtu.be/Yt77js8T5SQ\" target=\"_blank\">BB Ki Vines</a>, and <a href=\"https://youtu.be/4XoP44U3H8s\" target=\"_blank\">MostlySane</a> to encourage girls’ literacy and education around the world. Please take a moment to watch and support theses causes.<br /><br />Thank you for making YouTube an incredible source of creativity, knowledge and inspiration. As always, keep the feedback coming. I’m listening.<br /><br /><i>Susan Wojcicki,&nbsp;CEO of YouTube</i></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube Creators",
    "uri": "http://www.blogger.com/profile/00450486760991148551",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 280
}