{
  "title": "Accelerating the Discovery of g-C$_3$N$_4$-Supported Single Atom Catalysts for Hydrogen Evolution Reaction: A Combined DFT and Machine Learning Strategy. (arXiv:2211.01624v1 [cond-mat.mtrl-sci])",
  "link": "http://arxiv.org/abs/2211.01624",
  "description": "<p>Two-dimensional materials supported by single atom catalysis (SACs) are\nforeseen to replace platinum for large-scale industrial scalability of\nsustainable hydrogen generation. Here, a series of metal (Al, Sc, Ti, V, Cr,\nMn, Fe, Ni, Cu, Zn) and non-metal (B, C, N, O, F, Si, P, S, Cl) single atoms\nembedded on various active sites of g-C$_3$N$_4$ are screened by DFT\ncalculations and six machine learning (ML) algorithms (support vector\nregression, gradient boosting regression, random forest regression, AdaBoost\nregression, multilayer perceptron regression, ridge regression). Our results\nbased on formation energy, Gibbs free energy and bandgap analysis demonstrate\nthat the single atoms of B, Mn and Co anchored on g-C$_3$N$_4$ can serve as\nhighly efficient active sites for hydrogen production. The ML model based on\nsupport vector regression (SVR) exhibits the best performance to accurately and\nrapidly predict the Gibbs free energy of hydrogen adsorption (${\\Delta}$GH )\nfor the test set with a lower mean absolute error (MAE) and a high coefficient\nof determination (R$^2$) of 0.45 and 0.81, respectively. Feature selection\nbased on the SVR model highlights the top five primary features: formation\nenergy, bond length, boiling point, melting point, and valance electron as key\ndescriptors. Overall, the multistep work-flow employed through DFT calculations\ncombined with ML models for efficient screening of potential hydrogen evolution\nreaction (HER) from g-C$_3$N$_4$-based single atom catalysis can significantly\ncontribute to the catalyst design and fabrication.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cond-mat/1/au:+Jyothirmai_M/0/1/0/all/0/1\">M. V. Jyothirmai</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Roshini_D/0/1/0/all/0/1\">D. Roshini</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Abraham_B/0/1/0/all/0/1\">B. Moses Abraham</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Singh_J/0/1/0/all/0/1\">Jayant K. Singh</a>"
}