{
  "title": "Chinese Whispers: being gay in China",
  "link": "https://audioboom.com/posts/8175878",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1842,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>I recently caught a rare viewing of a 2001 Chinese film, <em>Lan Yu</em>. It tells the story of two gay men falling in love and finding domestic life throughout the reform and opening years of China. The filmmakers never bothered to apply for approval from the censors, knowing that its homosexual storyline would never make it past the moralistic Communist censors.</div>\n<br>\n<div>On this episode, I take a look at the place of homosexuality in the traditional Chinese mindset and under these years of Communism. My guests are Zhang Yongning, the producer of <em>Lan Yu</em>, and Liu Yiling, a a writer covering Chinese society, technology and internet culture who has written about the the dating apps that millennial gay men now use. We discuss the homosexuality rooted in traditional Chinese literature, like <em>Dreams of the Red Chamber</em>, balanced against the Confucian need to procreate and pass on lineage. It turns out that, much like ancient Greece, the problem wasn’t so much the gay sex so long as you still set up families and had children, Yongning says.</div>\n<br>\n<div>With the influx of Christianity through missionaries, there took on a ‘pathological’ view of homosexuality, more akin to the western homophobia, says Yiling.</div>\n<br>\n<div>When it comes to political attitudes, Yiling makes the astute point that ‘Chinese history has always moved in patterns of <em>fang shou</em> (open and close)’. Under Communism, you might expect the kind of restrictive attitudes towards divergent lifestyles, but much of this had moved in more liberal ways since reform and opening, forming the backdrop to <em>Lan Yu</em>’s story. Yet the sticking point is always whether these minority groups ask for political or civil rights. Unlike feminists under the MeToo movement which has been shut down by the government, gays haven’t united politically. ‘If they start asking for rights, then they will be in huge trouble’, Yongning says.</div>\n<br>\n<div>We don’t get much time to talk about other LGBT communities, but I’ll certainly come back to those in future episodes.<br>\n<br>\nIf you enjoy this podcast, you can now register your interest for an upcoming Chinese Whispers newsletter, at <a href=\"https://www.docs.google.com/forms/d/1kzf64KP_84kKFTR5q33aUJQoIt03QDZ6mmzDiUfuqyY/viewform?edit_requested=true\">www.spectator.co.uk/whispers</a>. It'll be everything you love about the podcast.</div>\n",
  "pubDate": "Mon, 17 Oct 2022 10:00:00 +0000",
  "guid": "tag:audioboom.com,2022-10-17:/posts/8175878",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}