{
  "title": "251: Level Up Your Self-Esteem with Sandy Grigsby",
  "pubDate": "Mon, 08 Nov 2021 18:56:18 +0000",
  "guid": "8d0664d5-f7a5-467b-b516-d2e510586804",
  "link": "https://sites.libsyn.com/94610/251-level-up-your-self-esteem-with-sandy-brigsby",
  "itunes:image": "",
  "description": "<p>How do you improve your self-esteem?<br /> <br /> Confidence is all about trusting in yourself and your abilities. But it can be challenging to trust in yourself when you don't believe in yourself.<br /> <br /> Today, we're excited to have back personal branding image expert and confidence catalyst Sandy Grigsby. She helps people discover their potential and unlock their inner confidence.</p> <p>Listen in as we continue our conversation on how to build confidence and self-esteem. If you've ever felt that you are not enough or you're struggling to meet the external expectations others have set, this episode is for you.</p> <p class=\"p1\">*** In my new 7-day Kwik Confidence course, I'm using the accelerated learning model to show you how to manage negative emotions like a pro & be unstoppable. All you need is 15 minutes a day. Get all the details on <a href= \"https://kwikbrain.com/confidence\" target=\"_blank\" rel= \"noopener\">KwikConfidence.com</a> ***</p>",
  "content:encoded": "<p>How do you improve your self-esteem?  Confidence is all about trusting in yourself and your abilities. But it can be challenging to trust in yourself when you don't believe in yourself.  Today, we're excited to have back personal branding image expert and confidence catalyst Sandy Grigsby. She helps people discover their potential and unlock their inner confidence.</p> <p>Listen in as we continue our conversation on how to build confidence and self-esteem. If you've ever felt that you are not enough or you're struggling to meet the external expectations others have set, this episode is for you.</p> <p class=\"p1\">*** In my new 7-day Kwik Confidence course, I'm using the accelerated learning model to show you how to manage negative emotions like a pro & be unstoppable. All you need is 15 minutes a day. Get all the details on <a href= \"https://kwikbrain.com/confidence\" target=\"_blank\" rel= \"noopener\">KwikConfidence.com</a> ***</p>",
  "enclosure": "",
  "itunes:duration": "19:48",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "How do you improve your self-esteem?  Confidence is all about trusting in yourself and your abilities. But it can be challenging to trust in yourself when you don't believe in yourself.  Today, we're excited to have back personal branding image expert...",
  "itunes:episodeType": "full"
}