{
  "title": "The Origin of Buckling Instability in Galactic Bars: Searching for the Scapegoat. (arXiv:2211.01391v1 [astro-ph.GA])",
  "link": "http://arxiv.org/abs/2211.01391",
  "description": "<p>The buckling process in stellar bars is full of unsolved issues. We analyze\nthe origin of the buckling instability in stellar bars using high-resolution\nN-body simulations. Previous studies have promoted the nonresonant firehose\ninstability to be responsible for the vertical buckling. We have analyzed the\nbuckling process in terms of the resonant excitation of stellar orbits in the\nbar, which pumps energy into vertical oscillations. We find that (1) the\nbuckling is associated with an abrupt increase in the central mass\nconcentration and triggers velocities along the bar and along its rotation\naxis. The velocity field projected on one of the main axes forms circulation\ncells and increases vorticity, which are absent in firehose instability; (2)\nThe bending amplitude is nonlinear when measured by isodensity contours or\ncurvature of the Laplace plane, which has a substantial effect on the stellar\nmotions; (3) In the linear description, the planar and vertical 2:1 resonances\nappear only with the buckling and quickly reach the overlapping phase, thus\nsupporting the energy transfer; (4) Using nonlinear orbit analysis, we analyze\nthe stellar oscillations along the bar and along the rotation axis and find\nthat stars cross the vertical 2:1 resonance simultaneously with the buckling.\nThe overlapping planar and vertical 2:1 resonances trapping more than 25% of\nthe bar particles provide the 'smoking gun' pointing to a close relationship\nbetween the bending of stellar orbits and the resonant action -- these\nparticles provide the necessary ingredient assuring the cohesive response in\nthe growing vertical asymmetry. We conclude that resonant excitation is\nimportant in triggering the buckling instability, and the contribution from the\nfirehose instability should be reevaluated. Finally, we discuss some\nobservational implications of buckling.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Li_X/0/1/0/all/0/1\">Xingchen Li</a> (University of Kentucky), <a href=\"http://arxiv.org/find/astro-ph/1/au:+Shlosman_I/0/1/0/all/0/1\">Isaac Shlosman</a> (University of Kentucky and Theoretical Astrophysics, Osaka University), <a href=\"http://arxiv.org/find/astro-ph/1/au:+Pfenniger_D/0/1/0/all/0/1\">Daniel Pfenniger</a> (University of Geneva), <a href=\"http://arxiv.org/find/astro-ph/1/au:+Heller_C/0/1/0/all/0/1\">Clayton Heller</a> (Georgia Southern University)"
}