{
  "id": "yt:video:iDVaoU8MmVw",
  "yt:videoId": "iDVaoU8MmVw",
  "yt:channelId": "UCP3alkHEJhoxTpy3iVON-lg",
  "title": "What I Wish I'd Known As A Beginning Physics Student",
  "link": "",
  "author": {
    "name": "Physics with Elliot",
    "uri": "https://www.youtube.com/channel/UCP3alkHEJhoxTpy3iVON-lg"
  },
  "published": "2021-11-17T00:41:23+00:00",
  "updated": "2022-01-01T16:46:07+00:00",
  "media:group": {
    "media:title": "What I Wish I'd Known As A Beginning Physics Student",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Experienced physics students always do the same thing whenever they write down an answer to a question: check the units. If the units are wrong, you know you've made a mistake! That way, you can catch your own errors and elevate your grade.\n\nDimensional analysis is your physics superpower: https://youtu.be/kC6U900CvwY \n\nMore physics help room videos: https://www.physicswithelliot.com/help-room-all\n\nTutoring inquiries: https://www.physicswithelliot.com/tutoring\n\nIf you find the content I’m creating valuable and would like to help make it possible for me to continue sharing more, please consider supporting me! You can make a recurring contribution at https://www.Patreon.com/PhysicsWithElliot, or make a one time contribution at https://www.physicswithelliot.com/support-me. Thank you so much!\n\nAbout physics help room videos:\nThese are intro-level physics videos aimed at students taking their first physics classes. In each video, I'll teach you the fundamentals of a particular physics topic you're likely to meet in your first classes on mechanics and electromagnetism.\n\nAbout me:\nI’m Dr. Elliot Schneider. I love physics, and I want to help others learn (and learn to love) physics, too. Whether you’re a beginner just starting out with your physics studies, a more advanced student, or a lifelong learner, I hope you’ll find resources here that enable you to deepen your understanding of the laws of nature. For more cool physics stuff, visit me at https://www.physicswithelliot.com.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}