{
  "title": "IEEE Is Working to Reconfigure Its Geographic Regions",
  "link": "https://spectrum.ieee.org/ieee-regions-reconfiguration",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/an-illustration-of-the-regions-of-the-ieee.jpg?id=31531954&width=2000&height=1500&coordinates=524%2C0%2C525%2C0\"/><br/><br/><p>IEEE has been analyzing its region and geographic unit structure to ensure there is equitable representation across its global membership. </p><p>IEEE’s region structure organizes membership into 10 globe-spanning geographic organizational units. Each member is assigned to a local section within one of the 10 regions, and each region elects a representative to serve on the <a href=\"https://mga.ieee.org/index.php?option=com_content&view=article&id=10\" target=\"_blank\">IEEE Member and Geographic Activities </a>(MGA) Board and on the IEEE Board of Directors. The regional units work to fulfill IEEE’s mission and to meet the needs of IEEE members living within the region’s borders. </p><p>As of June, the distribution of the IEEE membership across the 10 regions is <a href=\"https://r1.ieee.org/about/\" target=\"_blank\">Region 1</a>: 24,938 members; <a href=\"https://r2.ieee.org/\" target=\"_blank\">Region 2</a>: 21,795 members; <a href=\"https://r3.ieee.org/\" target=\"_blank\">Region 3</a>: 24,202 members; <a href=\"https://www.ewh.ieee.org/reg/4/index.php\" target=\"_blank\">Region 4</a>: 16,836 members; <a href=\"https://r5.ieee.org/\" target=\"_blank\">Region 5</a>: 22,317 members; <a href=\"https://ieee-region6.org/\" target=\"_blank\">Region 6</a>: 43,089 members; <a href=\"https://www.ieee.ca/en/\" target=\"_blank\">Region 7</a>: 14,179 members; <a href=\"https://ieeer8.org/\" target=\"_blank\">Region 8</a>: 74,451 members; <a href=\"https://r9.ieee.org/en/home/\" target=\"_blank\">Region 9</a>: 16,426 members; and <a href=\"https://www.ieeer10.org/\" target=\"_blank\">Region 10:</a> 151,421 members.</p><p>Last year, the MGA Board, which oversees IEEE membership and the activities of geographic units worldwide, formed a region realignment ad hoc committee to review the regional organization and propose recommendations for structural changes. The committee consists of current region directors among other MGA volunteers.</p><p>Based on the ad hoc committee’s recommendations, several actions have been taken to date. A formal plan will be presented to the MGA Board for approval at a meeting later this year.</p><p>A plan has been developed to divide Region 10, IEEE’s largest region, into two regions, to better meet the needs of its members in this region. Region 10 leadership and the MGA ad hoc committee have been working to develop the geographic boundaries of the two regions and have been creating implementation plans to execute this regional division following approval by the MGA Board and the IEEE Board of Directors. </p><p>To maintain a total of 10 regions across the world, IEEE Region 1 and Region 2 are proposing to merge formally into a single region with a single region director. The Region 1 and Region 2 Board of Governors and Executive Committees will work collaboratively to document and determine the best path forward in merging the two regions affairs, governance, and member activities. </p><p>While planning efforts for regional realignment are ongoing, another recent initiative has been the introduction of additional zone representatives at the MGA Board. A zone is a substructure within a region with a significant number of members. In these large regions, zone representatives can assist in the region and provide an additional voice for members within the zone. </p><p>To test the zone concept, in February the MGA Board approved the formation of four zones: two in Region 8 and two in Region 10. Representatives from the new zones participated in the MGA Board meeting held in June. The ad hoc committee is continuing to further develop specific responsibilities for the zone leaders.</p><p>The ad hoc committee is planning to bring motions forward to an upcoming MGA Board meeting to confirm the direction and next steps of the realignment, including next steps in the split of Region 10 into two regions, the consolidation of Regions 1 and 2 into a single region, and further definition of the zone concept.</p><p>If approved by the MGA Board, the vice president of MGA, <a href=\"https://www.linkedin.com/in/davidakoehler/\" target=\"_blank\">David Koehler</a>, will then present motions related to these matters for consideration by the IEEE Board of Directors at its November meeting.</p>",
  "pubDate": "Wed, 07 Sep 2022 18:00:01 +0000",
  "guid": "https://spectrum.ieee.org/ieee-regions-reconfiguration",
  "category": [
    "Ieee news",
    "Ieee regions",
    "Ieee member and geographic activities",
    "Type:ti"
  ],
  "dc:creator": "Kathy Pretz",
  "media:content": ""
}