{
  "id": "yt:video:Zxgynqqg45o",
  "yt:videoId": "Zxgynqqg45o",
  "yt:channelId": "UCkLHy_jxeaHTZCfGalg6QaA",
  "title": "A Chat with EEOC Commissioner Keith Sonderling: Artificial Intelligence in the Workforce",
  "link": "",
  "author": {
    "name": "Conn Maciel Carey LLP",
    "uri": "https://www.youtube.com/channel/UCkLHy_jxeaHTZCfGalg6QaA"
  },
  "published": "2022-06-08T17:36:13+00:00",
  "updated": "2022-09-09T17:31:25+00:00",
  "media:group": {
    "media:title": "A Chat with EEOC Commissioner Keith Sonderling: Artificial Intelligence in the Workforce",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "On May 12, 2022, the EEOC issued a Technical Assistance (“TA”) document entitled, “The Americans with Disabilities Act (“ADA”) and the Use of Software, Algorithms, and Artificial Intelligence to Assess Job Applicants and Employees” focused on providing “clarity to the public regarding existing requirements” under the ADA and agency policy. This is the first guidance document the EEOC has issued regarding the use of Artificial Intelligence (“AI”) in employment decision-making since announcing its Al Initiative in October 2021.\n\nIt’s no secret that more employers have turned to AI to enhance their work processes over the years. An estimated 83% of employers have engaged AI or algorithmic tools to screen or assess applicants and workers, and some have even adopted a broad framework applicable to everything from resume scanners and “virtual assistants” or chatbots to video interviewing software and testing software that assess personality, aptitude, skills and perceived \"cultural fit.\" However, if employers are not careful, these tools could result in disability discrimination violating the ADA.\n\nIn this special event with EEOC Commissioner Sonderling, we facilitated a deep dive discussion covering:\n\n• The impact of AI in the workplace\n• How the COVID-19 Pandemic has accelerated digitization in our businesses\n• Potential risks facing employers implementing algorithmic processes\n• Recommended EEOC practices to reduce the likelihood of disability discrimination\n• Workplace trends and issues facing employers in 2022 and beyond\n\nA webinar from Conn Maciel Carey LLP.\n\nUse of this video does not in any manner constitute or establish an attorney-client relationship between Conn Maciel Carey and the viewer. This video may be deemed \"attorney advertising\" in jurisdictions from which it is accessed. The decision to hire a lawyer is a serious one and should be undertaken after consideration of all relevant information, not only information on this video.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}