{
  "id": "https://bibleinoneyear.org/en/youth/308",
  "title": "Day 308: Loving Warnings",
  "description": "Proverbs 26:27-28, 27:1-4, Ezekiel 4:4-8, 5:15, Hebrews 5:12–14, 6:1-12.  He does not want you to get hurt  There are many warnings in the Bible and they all stem from God’s love for you",
  "pubDate": "Thu, 04 Nov 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/308/?ignore",
  "itunes:duration": "14:23",
  "guid": "enyouth04112021-308",
  "length": 863.76,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 308: Loving Warnings",
  "itunes:subtitle": "Proverbs 26:27-28, 27:1-4, Ezekiel 4:4-8, 5:15, Hebrews 5:12–14, 6:1-12.  He does not want you to get hurt  There are many warnings in the Bible and they all stem from God’s love for you",
  "itunes:summary": "These days, practically everything you buy seems to carry some kind of warning on it. Some of these warnings can seem a little ridiculous. For example:\nSainsbury’s peanuts: ‘Warning – Contains nuts’\nNytol Nighttime Sleep-Aid: ‘Warning – May cause drowsiness’\nOn a household DIY drill: ‘Not intended for use as dentist drill’\nBecause so many warnings seem almost absurd, the danger is that we ignore them. But not all warnings are so ridiculous.\nA foggy day, on 13 March 1991, led to one of Britain’s worst road accidents. Ten people died and twenty-five people were injured in a disaster on the M4 motorway. In the midst of the accident one man was hailed as a hero. Alan Bateman climbed out of his damaged car and ran along the central reservation to try to warn oncoming vehicles of the wreckage ahead. Not all appreciated the warnings. Some drivers sounded their horns at him and drove on towards the crash.\nAlan’s warnings to the other drivers were not only heroic; they were an act of love. Jesus himself often warned of dangers ahead (see for example Matthew 7:13,19,26–27). Jesus knew that in the long run it is more loving to warn people by telling them the truth.\nGod loves you. He does not want you to get hurt. There are many warnings in the Bible and they all stem from God’s love for you.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 308
}