{
  "title": "S14 Ep28: The Rites and Rituals of the Modern Traditional Witch",
  "link": "https://audioboom.com/posts/8098602",
  "itunes:episode": 28,
  "itunes:title": "The Rites and Rituals of the Modern Traditional Witch",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5736,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "As organized religion sees decreases in attendance numbers, and people label themselves as more \"spiritual\" than ever before, we see more and more people joining the ranks of Wicca and Witchcraft.  Laura Tempest Zakroff joins Beyond The Darkness today and is an author, artist, dancer, and practicing Modern Traditional Witch of more than two decades who will streamline your ideas of what witchcraft is... and isn't! <br>\n<br>\nLaura's Website:  <a href=\"https://www.lauratempestzakroff.com/\">https://www.lauratempestzakroff.com/</a><br>\n<br>\nLaura's Book:    <a href=\"https://www.amazon.com/Weave-Liminal-Living-Traditional-Witchcraft/dp/0738756105/ref=sr_1_1?keywords=weave+the+liminal&qid=1554521115&s=gateway&sr=8-1\">https://www.amazon.com/Weave-Liminal-Living-Traditional-Witchcraft/dp/0738756105/ref=sr_1_1?keywords=weave+the+liminal&qid=1554521115&s=gateway&sr=8-1</a><br>\n<br>\nPLUS: One of our favorite presentations of Theater of the Mind<br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nDigestive troubles? \tWeight gain?\tLow energy?\tAchy Joints?<br>\nIf you’ve been struggling with any of these, Dr. Steven Gundry says you’re not alone<br>\nAnd he knows the real cause! Watch the free video at <a href=\"http://totalrestore2.com\">totalrestore2.com</a> to find out more!",
  "itunes:summary": "As organized religion sees decreases in attendance numbers, and people label themselves as more \"spiritual\" than ever before, we see more and more people joining the ranks of Wicca and Witchcraft.  Laura Tempest Zakroff joins Beyond...",
  "pubDate": "Sun, 07 Apr 2019 08:00:00 +0000",
  "guid": "3fce1b3a-c2d7-41fb-93ef-81f09d02d7e5",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}