{
  "id": "yt:video:HAQdYE8rQPI",
  "yt:videoId": "HAQdYE8rQPI",
  "yt:channelId": "UC9K5PLkj0N_b9JTPdSRwPkg",
  "title": "The Critical Turn in Education | James Lindsay",
  "link": "",
  "author": {
    "name": "New Discourses",
    "uri": "https://www.youtube.com/channel/UC9K5PLkj0N_b9JTPdSRwPkg"
  },
  "published": "2022-10-20T18:15:13+00:00",
  "updated": "2022-11-04T15:01:47+00:00",
  "media:group": {
    "media:title": "The Critical Turn in Education | James Lindsay",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The Marxification of Education Workshop, Session 1 \n\nEducation has been stolen from us and from our children. Yes, stolen. It was deliberately transformed from within into something that is barely education at all anymore. Instead, it's a systematic program of thought reform (brainwashing) into neo-Marxist belief and activism. How has this been accomplished? The formal name for the transformation is \"the critical turn in education,\" which \"turned\" education from traditional models of pedagogy to \"Critical Pedagogy,\" the application and teaching of Critical Theory to and through the education system. Its purpose: to overcome what Marxists refer to as \"the problem of reproduction,\" by which stable societies reproduce themselves from one generation to the next, especially through institutions involving children like religion, family, media, and especially education. Here, New Discourses Founder James Lindsay summarizes this \"turn\" in this first of four presentations on the Marxification of Education delivered in late July 2022 in Arlington, Virginia, on location in the now-famous Loudoun County, ground zero for the fight for America's schools. \n\nAs a result of the research that produced this lecture series, Lindsay has written a detailed and accessible book on the issue titled The Marxification of Education, which is available for preorder now: https://amzn.to/3RYZ0tY #ad\n\nSession 2: https://newdiscourses.com/2022/10/paulo-freires-critical-method-of-education/\nSession 3: https://newdiscourses.com/2022/11/groomer-schools/\n\nSupport New Discourses: https://newdiscourses.com/support\n\nSubscribe to New Discourses on other platforms: https://newdiscourses.com/subscribe\n\nFollow James Lindsay: https://linktr.ee/conceptualjames\n\n© 2022 New Discourses. All rights reserved.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}