{
  "title": "What are ML Sensors?",
  "link": "https://petewarden.com/2022/06/09/what-are-ml-sensors/",
  "comments": "https://petewarden.com/2022/06/09/what-are-ml-sensors/#comments",
  "dc:creator": "Pete Warden",
  "pubDate": "Thu, 09 Jun 2022 21:57:23 +0000",
  "category": "Uncategorized",
  "guid": "http://petewarden.com/?p=7675",
  "description": "I&#8217;ve spent a lot of time at conferences talking about all the wonderful things that are now possible using machine learning on embedded devices, but as Stacey Higginbotham pointed out at this year&#8217;s TinyML Summit, despite all the potential there haven&#8217;t been many shipping applications. My experience is that companies like Google with big ML [&#8230;]",
  "content:encoded": "\n<figure class=\"wp-block-image size-large\"><a href=\"https://petewarden.files.wordpress.com/2022/06/mlsensor.png\"><img data-attachment-id=\"7676\" data-permalink=\"https://petewarden.com/2022/06/09/what-are-ml-sensors/mlsensor/\" data-orig-file=\"https://petewarden.files.wordpress.com/2022/06/mlsensor.png\" data-orig-size=\"415,250\" data-comments-opened=\"1\" data-image-meta=\"{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}\" data-image-title=\"mlsensor\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://petewarden.files.wordpress.com/2022/06/mlsensor.png?w=300\" data-large-file=\"https://petewarden.files.wordpress.com/2022/06/mlsensor.png?w=415\" src=\"https://petewarden.files.wordpress.com/2022/06/mlsensor.png?w=415\" alt=\"\" class=\"wp-image-7676\" srcset=\"https://petewarden.files.wordpress.com/2022/06/mlsensor.png 415w, https://petewarden.files.wordpress.com/2022/06/mlsensor.png?w=150 150w, https://petewarden.files.wordpress.com/2022/06/mlsensor.png?w=300 300w\" sizes=\"(max-width: 415px) 100vw, 415px\" /></a></figure>\n\n\n\n<p>I&#8217;ve spent a lot of time at conferences talking about all the wonderful things that are now possible using machine learning on embedded devices, but as Stacey Higginbotham <a href=\"https://staceyoniot.com/tinyml-needs-a-big-use-case-or-any-use-case/\">pointed out at this year&#8217;s TinyML Summit</a>, despite all the potential there haven&#8217;t been many shipping applications. My experience is that companies like Google with big ML teams have been able to deploy products successfully, but it has been a lot harder for teams in other industries. For example, when I visited an appliance manufacturer in China and pitched them on the glorious future they could access thanks to TensorFlow Lite Micro, they told me they didn&#8217;t even know how to open a Python notebook. Instead, they asked if I could just give them a voice interface, or something that told them when somebody sat down in front of their TV.</p>\n\n\n\n<p>I realized that the software framework model that had worked so well for TensorFlow Lite adoption on phone apps didn&#8217;t translate to other domains. Many of the firms that could most benefit from ML just don&#8217;t have the software engineering resources to integrate a library, even with great tools like <a href=\"https://www.edgeimpulse.com/\">Edge Impulse</a> that make the process much easier. As I thought about how to make on-device ML more widely accessible, I realized that providing ML capabilities as small, cheap hardware modules might be a good solution. This was the seed of the idea that became <a href=\"https://arxiv.org/pdf/2206.03266.pdf\">the ML sensors proposal, now available as a paper on arXiv</a>.</p>\n\n\n\n<p>The basic idea is that system builders are already able to integrate components like sensors into their products, so why not expose some higher-level information about the environment in the same form factor? For example, a person sensor might have a pin that goes high when someone is present, and then an I2C interface to supply more detailed information about their pose, activities, and identity. That would allow a TV manufacturer to wake up the display when someone sat down on the couch, and maybe even customize the UI to show recently-watched shows based on which family members are present. All of the complexity of the ML implementation would be taken care of by the sensor manufacturer and hidden inside the hardware module, which would have a microcontroller and a camera under the hood. The OEM would just need to respond to the actionable signals from the component.</p>\n\n\n\n<p>At the same time as I was thinking about how to get ML into more peoples hands, I was also worried about <a href=\"https://www.theverge.com/23003418/wyze-cam-v1-vulnerability-no-patch-bitdefender-responsible-disclosure\">the potential for abuse</a> that the proliferation of cameras and microphones in everyday devices enables. I realized that the modular approach might have some advantages there too. I think of personal information as toxic waste, because any leaks can be highly damaging to individuals, and to the companies involved, and there are few data sources that have as much potential for harm as video and audio streams from within peoples&#8217; homes. I believe it&#8217;s our responsibility as developers to engineer systems that are as leak-resistant as possible, especially if we&#8217;re dealing with cameras and microphones. I&#8217;d already <a href=\"https://openreview.net/forum?id=rlHeH9tx3SM\">explored the idea of using Arm&#8217;s TrustZone</a> to keep sensitive data contained, but by moving the ML processing off the central microcontroller and onto a peripheral, we have the chance to design something that has a very small attack surface (because there&#8217;s no memory shared with the rest of the system) and can be audited by a third-party to ensure any claims of safety are credible.</p>\n\n\n\n<p>The ML sensor paper brings all these ideas together into a proposal for designing systems that are easier to build, and safer by default. I&#8217;m hoping this will start a discussion about how to improve usability and privacy in everyday systems, and lead to more practical prototyping and experimentation to answer a lot of the questions it raises. I&#8217;d love to <a href=\"mailto:pete@petewarden.com\">get feedback</a> on this proposal, especially from product designers who might want to try integrating these into their systems. I&#8217;m looking forward to seeing more work in this area, I know I&#8217;m going to be busy trying to get some examples up and running, so watch this space!</p>\n",
  "wfw:commentRss": "https://petewarden.com/2022/06/09/what-are-ml-sensors/feed/",
  "slash:comments": 4,
  "media:content": [
    {
      "media:title": "petewarden"
    },
    ""
  ]
}