{
  "title": "Mi200 - \"Team Minkorrekt!\"",
  "itunes:title": "Mi200 - \"Team Minkorrekt!\"",
  "description": "Folge 200 vom 05.10.2021\n\ndiesmal mit dem was war, was ist und was vielleicht sein wird.\n\nDu möchtest mehr über unsere Werbepartner erfahren? Hier findest du alle Infos & Rabatte: https://linktr.ee/methodischinkorrekt",
  "pubDate": "Tue, 05 Oct 2021 09:15:19 +0000",
  "link": "https://minkorrekt.de/mi200-team-minkorrekt/",
  "guid": "2325308e09f57c5a0fc70a62f2f85087",
  "content:encoded": "\"Team Minkorrekt\" direkt von der Jubiläumsgala der Wissenschaft.\n<p>Wir hätten damals nie gedacht, dass wir das hier so lange und auch so erfolgreich machen werden. Daher geht der erste große Dank an euch die das möglich gemacht haben!</p>\n<p>Wir reden in dieser Episode ein wenig über die Anfänge von Minkorrekt und die Entwicklung des Podcast über die Jahre, der für uns so viel mehr als einfach nur ein Podcast geworden ist. Vor allem reden wir dabei viel über uns und wie uns das Podcasten in den letzten 8 Jahren verändert hat.</p>\n<p>Neben all der Freude die uns dieses Projekt bisher bereitet hat, hat es aber auch immer viel Arbeit bedeutet. Diese Arbeit haben wir immer gerne gemacht, aber es ist langsam an der Zeit, das wir diesen Weg nicht mehr alleine weitergehen. Es sind einfach zu viele Dinge die wir gerne machen wollen, zu viele Gespräche mit euch und zu viele Themen neben diesem Weg liegengeblieben.</p>\n<p>Aus diesem Grund wollen wir unser Team im Hintergrund vergrößern und ein bis zwei Leute einstellen, denen wir die Möglichkeit geben wollen an diesem Projekt mitzuarbeiten und dabei auch ein angemessenes Gehalt zu zahlen. Dabei wollen wir nicht einfach Aufgaben abgeben, sondern die Sachen in angriff nehmen, die wir schon lange mit uns herumtragen, für die uns aber bisher einfach die Zeit und die Energie fehlte. Wenn ihr also \"was mit Medien\" machen wollt oder vielleicht in den Bereich der Wissenschaftskommunikation wollt, dann meldet euch doch gerne mal per Mail bei uns.</p>\n<p>Wir wollen nach 200 Fogen also noch lange nicht aufhören, sondern wir wollen mehr machen! Wenn wir Menschen anstellen, müssen wir das ganze natürlich auch irgendwie finanzieren und aus diesem Grund haben wir uns dazu entschlossen mal auszuprobieren ob Werbung eine Möglichkeit sein könnte diese Finanzierung zu stemmen. </p>\n<p>Da uns bewusst ist, dass Eineige von euch lieber nen Euro in den Hut werfen als Werbung zu hören, haben wir ab nächster Folge <a href=\"https://steadyhq.com/de/minkorrekt/about\">einen entsprechenden Steady-Feed</a> eingerichtet, wo ihr Minkorrekt, für den bei Steady kleinstmöglichen Betrag (2,50 Euro/Monat), weiterhin werbefrei hören könnt.</p>\n<p>Am Ende der Folge haben wir dann noch angefangen eure Fragen zu beantworten. Leider haben wir hier viel weniger geschafft als wir eigentlich vor hatten, da wir von der schieren Menge an Fragen auch ehrlich gesagt etwas überrascht waren. Wir werden die Fragen in den weiteren Folgen häufiger mal aufgreifen und die Liste nach und nach abarbeiten!</p>\n<p>So jetzt bleibt uns erstmal nichts weiter übrig als euch Hörerinnen für 8 Jahre Minkorrekt mit allem drum und dran zu danken und elektrisiert auf die nächsten 8 Jahre zu gucken!</p>\n<p>Vielen Dank! \nEure beiden Stimmen im Kopf mit denen ihr diesen Text gerade gelesen habt ;)</p>\n<p>PS: Nächster Livestream ist am 11.10.21 um 20:00 Uhr auf Twitch.</p>\n<p>Du möchtest mehr über unsere Werbepartner erfahren? <a href=\"https://linktr.ee/methodischinkorrekt\"><strong>Hier findest du alle Infos & Rabatte</strong></a></p>",
  "itunes:image": "",
  "itunes:episode": 204,
  "itunes:episodeType": "full",
  "itunes:subtitle": "\"Team Minkorrekt\" direkt von der Jubiläumsgala der Wissenschaft.",
  "itunes:summary": "Folge 200 vom 05.10.2021\n\ndiesmal mit dem was war, was ist und was vielleicht sein wird.\n\nDu möchtest mehr über unsere Werbepartner erfahren? Hier findest du alle Infos & Rabatte: https://linktr.ee/methodischinkorrekt",
  "itunes:explicit": "yes",
  "itunes:keywords": "Jubiläum",
  "itunes:author": "Methodisch inkorrekt!",
  "enclosure": "",
  "itunes:duration": 11211
}