{
  "id": "yt:video:yLCMfaTvbx0",
  "yt:videoId": "yLCMfaTvbx0",
  "yt:channelId": "UCJekgf6k62CQHdENWf2NgAQ",
  "title": "Business, Innovation, and Managing Life (October 26, 2022)",
  "link": "",
  "author": {
    "name": "Wolfram",
    "uri": "https://www.youtube.com/channel/UCJekgf6k62CQHdENWf2NgAQ"
  },
  "published": "2022-10-26T21:05:59+00:00",
  "updated": "2022-11-02T18:43:28+00:00",
  "media:group": {
    "media:title": "Business, Innovation, and Managing Life (October 26, 2022)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Stephen Wolfram hosts live and unscripted Ask Me Anything about business, innovation and managing life. Find the playlist of Q&A's here: https://wolfr.am/youtube-sw-business-qa&#13;\n&#13;\nOriginally livestreamed at: https://twitch.tv/stephen_wolfram&#13;\n&#13;\nIf you missed the original livestream of this episode, feel free to submit a question or topic you would like Stephen to answer in a future Q&A livestream here: https://wolfr.am/12cczmv5J&#13;\n&#13;\n 00:00 Start stream\n00:50 SW starts talking\n1:15 Do you have any fun Halloween plans? Any memorable costumes you've dressed up in or have seen?\n3:02 If you could spend the day as any animal in the world, what would it be? What might the change in perspective allow you to understand and apply toward your current work?\n12:40 What are your thoughts on providing feedback to employees? What methodologies and tools do you use? How can we best help an employee to grow before letting them go for underperformance?\n22:25 I just finished reading \"Things a Computer Scientist Rarely Talks About\" by Donald Knuth. He briefly mentions the possibility of the universe being a cellular automata. Have you ever read this book?\n37:15 Maybe 'project' is not an adequate word for undertakings like WA\n42:20 Do you have a time-frame for the physics project or is it a life-long project. If you had to work on another idea/project what would that be?\n52:05 How would you tackle a problem? Dive into it or first observe bigger picture?\n55:54 What's your way of studying something new, or understanding historical evolution of concepts, or reading from textbooks and working out examples?\n1:02:46 I have to wonder how Bertrand Russell would have viewed the Wolfram metamathematical project!\n1:06:06​ What has been the typical response reaching out to \"academics\" to join the physics project?\n&#13;\nFollow us on our official social media channels.&#13;\n&#13;\nTwitter: https://twitter.com/WolframResearch/&#13;\nFacebook: https://www.facebook.com/wolframresearch/&#13;\nInstagram: https://www.instagram.com/wolframresearch/&#13;\nLinkedIn: https://www.linkedin.com/company/wolfram-research/&#13;\nStephen Wolfram's Twitter: https://twitter.com/stephen_wolfram/&#13;\n&#13;\nContribute to the official Wolfram Community: https://community.wolfram.com/&#13;\nStay up-to-date on the latest interest at Wolfram Research through our blog: https://blog.wolfram.com/&#13;\nFollow Stephen Wolfram's life, interests, and what makes him tick on his blog: https://writings.stephenwolfram.com/",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}