{
  "id": "yt:video:luz_aAlW9cs",
  "yt:videoId": "luz_aAlW9cs",
  "yt:channelId": "UCweDKPSF65wRw5VHFUJYiow",
  "title": "Voyage to Planet Aion | Speculative Biology",
  "link": "",
  "author": {
    "name": "Curious Archive",
    "uri": "https://www.youtube.com/channel/UCweDKPSF65wRw5VHFUJYiow"
  },
  "published": "2022-07-08T19:08:24+00:00",
  "updated": "2022-09-02T00:46:01+00:00",
  "media:group": {
    "media:title": "Voyage to Planet Aion | Speculative Biology",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Discover an alien world of incredible wonders. A breakdown of the creatures and exploratory vessels found on Christian Grajewski’s 'Planet Aion.'\n---\nExplorer Book: http://www.christiangrajewski.com/#/explorer/\nPurchase Book: https://designstudiopress.com/product/explorer/\nArtist’s Instagram: https://www.instagram.com/christiangrajewski/\nArtist’s ArtStation: https://www.artstation.com/christian_grajewski\n\nHumans have always been explorers. As a species, we are innately curious about what lies beyond our horizon. If the day ever comes when we embark across the cosmic oceans beyond our moon, what vessels will we use to discover new worlds?\n\nFew art projects capture the wonder and awe of voyaging to an unfamiliar planet better than the ‘Explorer’ series. Brought to life by incredible digital artist Christian Grajewski, the story is set in a distant future, where the remnants of humanity journey to a lush exoplanet called Aion\n\nThe ongoing ‘Explorer’ project doesn’t just examine a vibrant alien ecosystem, but also documents the fascinating vehicles the early explorers use to chart the unfamiliar planet. So, for this entry into the archive, we’ll tag along with the first wave of explorers, and voyage across this mysterious world in a range of different machines. And as always, you can follow and support the artist using the links in the description. Now, let’s set off towards Planet Aion…\n\n0:00 A New World\n1:17 First Contact\n5:17 Teeming Forest\n8:49 Land of Giants\n12:09 Unknown Reaches\n14:43 The Last Frontier\n18:51 So Much More…\n\nCopyright Disclaimer: Under section 107 of the Copyright Act 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education, and research. All video/image content is edited under fair use rights for reasons of commentary.\n\nI do not own the images, music, or footage used in this video. All rights and credit goes to the original owners.\n\n♫ Music by Kevin MacLeod (incompetech.com): \nBeauty Flow, Firesong, Majestic Hills, Floating Cities\nLicensed under Creative Commons: By Attribution 3.0\nhttp://creativecommons.org/licenses/by/3.0/  \n\n#CuriousArchive #SpeculativeBiology #AlienBiology",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}