{
  "id": "yt:video:Ls_ARU-rp7w",
  "yt:videoId": "Ls_ARU-rp7w",
  "yt:channelId": "UCnQC_G5Xsjhp9fEJKuIcrSw",
  "title": "Vote For Dems, Or Republicans Will Kill Your Kids | Ep. 1604",
  "link": "",
  "author": {
    "name": "Ben Shapiro",
    "uri": "https://www.youtube.com/channel/UCnQC_G5Xsjhp9fEJKuIcrSw"
  },
  "published": "2022-11-04T17:00:10+00:00",
  "updated": "2022-11-05T08:10:50+00:00",
  "media:group": {
    "media:title": "Vote For Dems, Or Republicans Will Kill Your Kids | Ep. 1604",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Watch the member-only portion of my show on DailyWire+: https://utm.io/ueSuX\n\nLIKE & SUBSCRIBE for new videos every day. https://www.youtube.com/c/BenShapiro\n\nThe Ben Shapiro Show is sponsored by ExpressVPN. Protect your online privacy today at https://expressvpn.com/ben \n\nJoe Biden’s scattershot midterm campaign draws to a close; historian Michael Beschloss warns of mass death if Republicans are elected; and we examine the bellwether races that will indicate a possible red wave.\n\n00:00 - Final midterm estimates\n10:08 - Biden's priorities \n11:15 - Hillary Clinton is back \n14:23 - Biden pushes student loan debt relief plan \n19:02 - Scaremongering and pre-emptive rage \n28:44 - Historian says Republicans will kill your kids\n32:09 - The View insults white suburban women \n37:21 - Trump blamed for crime rates\n\n- - - \n\nDailyWire+:\n\nThis weekend, tune in for the new episode of my Sunday Special with Tennessee Governor Bill Lee on DailyWire+, Apple, Spotify, or wherever you listen to podcasts.\n\n - - - \n\nToday’s Sponsors:\n\nExpressVPN - Protect your online privacy with ExpressVPN. Get 3 Months FREE! https://www.EXPRESSVPN.com/BEN\n\nBirch Gold - Text \"BEN\" to 989898 for your no-cost, no-obligation, FREE information kit: https://birchgold.com/ben\n\nBlack Rifle Coffee - Get 10% off your first order or Coffee Club subscription with code SHAPIRO: https://www.blackriflecoffee.com/\n\nInternational Fellowship of Christians and Jews - For only $25 you can rush a food box full of nutritious food to Jewish people in need: benforthefellowship.org\n\nRing - Live a little more stress-free this season with a Ring product that’s right for you: https://ring.com/\n\nUSCCA - Text 'BEN' to 87222 for a FREE Concealed Carry and Family Defense Guide, AND a chance to WIN $1,000.\n\n- - -\n\nStop giving your money to woke corporations that hate you. Get your Jeremy's Razors today at https://www.ihateharrys.com\n\nGrab your Ben Shapiro merch here: https://utm.io/uePzN\n\n#BenShapiro #TheBenShapiroShow #News #Politics #DailyWire",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}