{
  "id": "yt:video:-GfM2L9bfIA",
  "yt:videoId": "-GfM2L9bfIA",
  "yt:channelId": "UCbmNph6atAoGfqLoCL_duAg",
  "title": "Noëlla Coursaris Musunka | The Story of Malaika | Talks at Google",
  "link": "",
  "author": {
    "name": "Talks at Google",
    "uri": "https://www.youtube.com/channel/UCbmNph6atAoGfqLoCL_duAg"
  },
  "published": "2022-10-14T16:00:00+00:00",
  "updated": "2022-10-14T16:00:00+00:00",
  "media:group": {
    "media:title": "Noëlla Coursaris Musunka | The Story of Malaika | Talks at Google",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Noëlla Coursaris Musunka discusses Malaika, a grassroots nonprofit that empowers girls and communities in the Democratic Republic of the Congo through a school, a community center, and a clean water program. \n\nMalaika has grown into a fully-functioning ecosystem impacting thousands of lives each year, anchored by its accredited primary and secondary school for 400 (soon to be 430!) girls. The Malaika School provides a comprehensive education for girls ages 5-18 with a STEM-focused curriculum including coding, music, theater, sport and art, ensuring that students are equipped with a 21st century education. Malaika also comprises a community center that offers a range of programs to 5,000 youth and adults, a clean water program with 25 wells that service over 35,000 people each year, technical classes educating and certifying future electricians and mechanics, and a sustainable agricultural program that helps provide two nutritious meals each day to students and staff. All of Malaika's community-driven programs are free and serve as a model that can be replicated on a global scale in communities around the world.\n\nLearn more about Malaika: https://malaika.org/.\n\nNoëlla Coursaris Musunka,a Congolese/Cypriot philanthropist and international model, is the Founder & CEO of Malaika. A unique and fearless spokesperson, and the face of leading fashion campaigns across the globe, Noëlla is a voice for the power of girls’ education worldwide and has shared her insights at a number of world-class forums, spanning the World Economic Forum in Davos to the university halls of Cambridge, Oxford, Harvard, and MIT. In 2017, Noëlla was named one of the BBC’s 100 Most Influential & Inspirational Women of the Year, and in 2018, she received an award at the 100 Years of Mandela celebration. She is an Advisor at Concordia and an Ambassador for the Global Fund to Fight AIDS, Tuberculosis and Malaria. She sits on the United Nations Conscious Fashion and Lifestyle Network and the L'Oréal Fund for Women Endowment Fund Advisory Committee.\n\nModerated by Stephen Ichatha.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}