{
  "title": "186: Searching for Sheela",
  "link": "https://audioboom.com/posts/7891223",
  "itunes:episode": 186,
  "itunes:title": "Searching for Sheela",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3166,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>BUCKLE UP EVERYONE, GILLIAN IS REAL MAD THIS WEEK!</div>\n<div><br>\n</div>\n<div>So, Ok, remember Ma Anand Sheela from “Wild Wild Country?” She was Bagwan’s number 2, bus we all knew she was really the one running things in the Rajneesh Cult. Remember how she went a little bananas and tried to poison the entire town in Oregon where the cult was based and then she plotted to assassinate a Senator, and then went into hiding after leaving the cult. WELL GUESS WHAT, SHE’S GETTING HER OWN DOCUMENTARY! After 35 years, she’s headed back to India to promote her book. But she really doesn’t want to talk about the book or answer any questions AND GILLIAN IS NOT HERE FOR IT. Ugh, this is a doozy. </div>\n<div>\n<br>\n<a href=\"https://thewilbur.com/artist/true-crime-obsessed/\"><strong>FAM OUR LIVE SHOW IN BOSTON IS BACK ON AND TICKETS ARE NOW ON SALE!! </strong></a>If you had tickets to the original date, they have been refunded, check your email! Our new date is Saturday, July 31st at 7pm AT THE WILBUR THEATER!!  We're covering Oxygen's \"The Disappearance of Maura Murray\" and we will be joined by Maggie Freleng (who hosted the series) and Tim and Lance from Missing Maura Murray podcast! <a href=\"https://thewilbur.com/artist/true-crime-obsessed/\"><strong>TICKETS ARE GOING FAST! GET YOURS AND COME JOIN US!</strong></a><strong><br>\n<br>\nLOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 200 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>Night Stalker</strong>\" <strong>\"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Tue, 22 Jun 2021 10:00:00 +0000",
  "guid": "tag:audioboom.com,2021-06-22:/posts/7891223",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}