{
  "title": "Improving Instagram notification management with machine learning and causal inference",
  "link": "https://engineering.fb.com/2022/10/31/ml-applications/instagram-notification-management-machine-learning/",
  "dc:creator": "",
  "pubDate": "Mon, 31 Oct 2022 16:30:38 +0000",
  "category": [
    "DevInfra",
    "ML Applications",
    "Instagram"
  ],
  "guid": "https://engineering.fb.com/?p=19553",
  "description": "<p>We’re sharing how Meta is applying statistics and machine learning (ML) to improve notification personalization and management on Instagram – particularly on daily digest push notifications. By using causal inference and ML to identify highly active users who are likely to see more content organically, we have been able to reduce the number of notifications [...]</p>\n<p><a class=\"btn btn-secondary understrap-read-more-link\" href=\"https://engineering.fb.com/2022/10/31/ml-applications/instagram-notification-management-machine-learning/\">Read More...</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://engineering.fb.com/2022/10/31/ml-applications/instagram-notification-management-machine-learning/\">Improving Instagram notification management with machine learning and causal inference</a> appeared first on <a rel=\"nofollow\" href=\"https://engineering.fb.com\">Engineering at Meta</a>.</p>\n",
  "content:encoded": "<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">We’re sharing how Meta is applying statistics and machine learning (ML) to improve notification personalization and management on Instagram – particularly on daily digest push notifications.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">By using causal inference and ML to identify highly active users who are likely to see more content organically, we have been able to reduce the number of notifications sent while also improving overall user experience.</span></li>\n</ul>\n<p><span style=\"font-weight: 400;\">On Instagram, notifications play an important role in providing efficient communication channels between Instagram and our users. As the<a href=\"https://engineering.fb.com/2022/07/26/web/launching-instagram-messaging-on-desktop/\" target=\"_blank\" rel=\"noopener\"> types of notifications</a> have increased, a need has arisen to provide people with personalized notification experiences to help avoid them receiving excess notifications or ones they may not find to be important.</span></p>\n<p><span style=\"font-weight: 400;\">At Meta, we have been applying statistics and <a href=\"https://engineering.fb.com/2022/09/19/ml-applications/data-ingestion-machine-learning-training-meta/\" target=\"_blank\" rel=\"noopener\">machine learning</a> (ML) for notification personalization and management on Instagram. Today, we would like to share an example of how we used causal inference and ML to control sending for daily digest push notifications.</span></p>\n<h2><span style=\"font-weight: 400;\">Moving beyond click-through rate models</span></h2>\n<p><span style=\"font-weight: 400;\">A daily digest push notification about stories is a type of notification that lists a digest of stories that are shared and ready for someone to view. When such a notification is delivered to someone’s device, they may click on the notification to view the content. Traditionally, an ML model called a click-through rate (CTR) model is used to predict how likely someone is to click on a notification. CTR models have been working well in many applications across the industry. The predicted click probability is used as a proxy to indicate the notification’s quality to the user. If the predicted click probability is too low, the notification will be dropped in the middle of its sending flow and the user won’t receive the notification because it has been deemed low quality.</span></p>\n<p><span style=\"font-weight: 400;\">CTR model-based filtering worked well for daily digest notification in the sense that the actual average click rate when using the CTR model was significantly higher than without the model. However, we also noticed that using the CTR model meant a large portion of the daily digest notifications were sent to users who are relatively active in terms of using Instagram. For many highly active Instagram users, even without sending these daily digest notifications, they would be able to view the corresponding stories in an organic manner. </span><span style=\"font-weight: 400;\">This actually opens up an opportunity to provide a better user experience by sending fewer notifications to active users who are likely to view the stories listed in the notifications organically.</span></p>\n<p><span style=\"font-weight: 400;\">The challenging aspect is how to identify these users. If we reduce the notifications sent to users who are active based on them receiving such notifications, it’s possible those users will become less active. In other words, if the right users aren’t properly selected for sending reductions we risk creating a decline in user engagement.</span></p>\n<h2><span style=\"font-weight: 400;\">Causal inference and ML</span></h2>\n<p><span style=\"font-weight: 400;\">Essentially, it’s a user selection problem. We would like to maximize the efficiency of sent notifications by selecting proper user cohorts. The solution we adopted to tackle this problem is the combination of causal inference and ML.</span></p>\n<p><span style=\"font-weight: 400;\">For problem formulation, let’s assume there is a fixed computational cost to send each daily digest notification, and also there is a total budget for these notifications to spend. Now it becomes a budget allocation problem. The key to solving this problem is figuring out the incremental value of sending a daily digest notification compared to not sending. For example, the incremental value for user </span><em><span style=\"font-weight: 400;\">i</span></em><span style=\"font-weight: 400;\"> can be defined in terms of user activeness, i.e., <em>u<sub>i</sub>=Pr<sub>i</sub>(active|do(send notification)) &#8211; Pr<sub>i</sub>(active|do(drop notification))</em>. </span><span style=\"font-weight: 400;\">For some user cohorts, they would be active without receiving the daily digest notifications and thus the incremental values would be small; selecting these cohorts to send the digest notifications is inefficient and may even spam these users. For better product experience and efficiency, we can sort the notifications by the incremental values in descending order and select the top notifications with high incremental values to send, to maximize the overall incremental value with limited budget (sending volume).</span></p>\n<p><span style=\"font-weight: 400;\">The next question is how to estimate the incremental value before we make the send or drop decision. It is a challenging question because for the same notification, we can either send it or drop it; there is no way to observe both scenarios. Essentially, this is a causal inference problem and </span><a href=\"https://proceedings.mlr.press/v67/gutierrez17a.html\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">uplift modeling techniques</span></a><span style=\"font-weight: 400;\"> can be used. To </span><a href=\"https://www.pnas.org/doi/10.1073/pnas.1804597116\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">apply uplift models</span></a><span style=\"font-weight: 400;\">, we designed a randomized experiment in which each notification was randomly sent or dropped, as illustrated in Figure 1.</span></p>\n<figure id=\"attachment_19555\" aria-describedby=\"caption-attachment-19555\" style=\"width: 1024px\" class=\"wp-caption alignnone\"><img decoding=\"async\" loading=\"lazy\" class=\"size-large wp-image-19555\" src=\"https://engineering.fb.com/wp-content/uploads/2022/10/Instagram-Causal-Inference-ML_Figure-1.png?w=1024\" alt=\"Instagram causal inference machine learning\" width=\"1024\" height=\"371\" srcset=\"https://engineering.fb.com/wp-content/uploads/2022/10/Instagram-Causal-Inference-ML_Figure-1.png 1763w, https://engineering.fb.com/wp-content/uploads/2022/10/Instagram-Causal-Inference-ML_Figure-1.png?resize=916,331 916w, https://engineering.fb.com/wp-content/uploads/2022/10/Instagram-Causal-Inference-ML_Figure-1.png?resize=768,278 768w, https://engineering.fb.com/wp-content/uploads/2022/10/Instagram-Causal-Inference-ML_Figure-1.png?resize=1024,371 1024w, https://engineering.fb.com/wp-content/uploads/2022/10/Instagram-Causal-Inference-ML_Figure-1.png?resize=1536,556 1536w, https://engineering.fb.com/wp-content/uploads/2022/10/Instagram-Causal-Inference-ML_Figure-1.png?resize=96,35 96w, https://engineering.fb.com/wp-content/uploads/2022/10/Instagram-Causal-Inference-ML_Figure-1.png?resize=192,69 192w\" sizes=\"(max-width: 992px) 100vw, 62vw\" /><figcaption id=\"caption-attachment-19555\" class=\"wp-caption-text\">Figure 1: A randomized experiment for uplift modeling, where a notification eligible to send will be dropped randomly with 50 percent probability.</figcaption></figure>\n<p><span style=\"font-weight: 400;\">Based on the data collected from this randomized experiment, we developed a neural network-based uplift model to predict the incremental impact between not sending and sending the daily digest notifications about stories at user level. Given the estimates of incremental impact for all notifications, the solution of the above budget allocation problem is trivial. However, in practice the notifications are generated and scored online and thus we cannot have incremental impact estimates ready for all candidate notifications in advance. </span></p>\n<p><span style=\"font-weight: 400;\">As a consequence, we need an online approach to determine which notifications to send or drop. One simple but effective solution is to compare the online generated score with a fixed threshold – if the score is higher than the threshold we can send it. By doing so, we intend to maintain a fixed notification sending rate </span><em><span style=\"font-weight: 400;\">r</span></em><span style=\"font-weight: 400;\"> where </span><em><span style=\"font-weight: 400;\"> 0 < r < 1</span></em><span style=\"font-weight: 400;\">. </span></p>\n<p><span style=\"font-weight: 400;\">When we applied this approach in online testing we observed sending rate fluctuations because the uplift (incremental impact) estimates generated from ML models may shift from time to time due to various reasons. To stabilize the sending rate, we utilize an online quantile computation service to transform the raw uplift estimates towards a standard uniform distribution while preserving the orders. To maintain the sending rate to </span><span style=\"font-weight: 400;\">r</span><span style=\"font-weight: 400;\">, we simply compare the transformed uplift estimate with </span><em><span style=\"font-weight: 400;\">r</span></em><span style=\"font-weight: 400;\"> to make the sending decision, since the transformed uplift estimate <em>Z~U(0,1),</em>  <em>Pr( Z >= 1 &#8211; r ) = r</em></span><span style=\"font-weight: 400;\">. This process is illustrated in Figure 2.</span></p>\n<figure id=\"attachment_19572\" aria-describedby=\"caption-attachment-19572\" style=\"width: 1024px\" class=\"wp-caption alignnone\"><img decoding=\"async\" loading=\"lazy\" class=\"size-large wp-image-19572\" src=\"https://engineering.fb.com/wp-content/uploads/2022/10/Instagram-Causal-Inference-ML_Figure-2_updaetd.png?w=1024\" alt=\"instagram machine learning causal inference\" width=\"1024\" height=\"383\" srcset=\"https://engineering.fb.com/wp-content/uploads/2022/10/Instagram-Causal-Inference-ML_Figure-2_updaetd.png 1999w, https://engineering.fb.com/wp-content/uploads/2022/10/Instagram-Causal-Inference-ML_Figure-2_updaetd.png?resize=916,343 916w, https://engineering.fb.com/wp-content/uploads/2022/10/Instagram-Causal-Inference-ML_Figure-2_updaetd.png?resize=768,287 768w, https://engineering.fb.com/wp-content/uploads/2022/10/Instagram-Causal-Inference-ML_Figure-2_updaetd.png?resize=1024,383 1024w, https://engineering.fb.com/wp-content/uploads/2022/10/Instagram-Causal-Inference-ML_Figure-2_updaetd.png?resize=1536,575 1536w, https://engineering.fb.com/wp-content/uploads/2022/10/Instagram-Causal-Inference-ML_Figure-2_updaetd.png?resize=96,36 96w, https://engineering.fb.com/wp-content/uploads/2022/10/Instagram-Causal-Inference-ML_Figure-2_updaetd.png?resize=192,72 192w\" sizes=\"(max-width: 992px) 100vw, 62vw\" /><figcaption id=\"caption-attachment-19572\" class=\"wp-caption-text\">Figure 2: Order-preserving score transformation for sending rate control</figcaption></figure>\n<h2><span style=\"font-weight: 400;\">Better notifications with causal inference and ML</span></h2>\n<p><span style=\"font-weight: 400;\">By applying this model and targeting the users + notifications with high incremental impact, we reduced the sending volume substantially compared to using the CTR model and also saw no decline in user engagement. The benefit of this work is twofold: improved user experience and reduced resource usage.</span></p>\n<p><span style=\"font-weight: 400;\">In the Instagram Notifications Systems team, ML and statistics have been applied in different areas to improve user notification experience. If you want to learn more about this work or are interested in joining one of our engineering teams, please visit our </span><a href=\"https://www.facebook.com/careers/jobs/?q=instagram\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">careers page</span></a><span style=\"font-weight: 400;\">, and follow us</span> <a href=\"https://www.facebook.com/instagramengineering/\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">on Facebook</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p>The post <a rel=\"nofollow\" href=\"https://engineering.fb.com/2022/10/31/ml-applications/instagram-notification-management-machine-learning/\">Improving Instagram notification management with machine learning and causal inference</a> appeared first on <a rel=\"nofollow\" href=\"https://engineering.fb.com\">Engineering at Meta</a>.</p>\n",
  "post-id": 19553
}