{
  "id": "https://bibleinoneyear.org/en/youth/93",
  "title": "Day 93: How to Love",
  "description": "Psalm 40:10–11, Numbers 36:13, Luke 9:28–55.  God’s love and mercy is even more extraordinary because ‘At the cross of Jesus, pardon is complete  *Love* and *justice* mingle, *truth* and *mercy* meet",
  "pubDate": "Sat, 03 Apr 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/93/?ignore",
  "itunes:duration": "14:30",
  "guid": "enyouth03042021-93",
  "length": 870.48,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 93: How to Love",
  "itunes:subtitle": "Psalm 40:10–11, Numbers 36:13, Luke 9:28–55.  God’s love and mercy is even more extraordinary because ‘At the cross of Jesus, pardon is complete  *Love* and *justice* mingle, *truth* and *mercy* meet",
  "itunes:summary": "Four bullets hit Pope John Paul II – two of them lodging in his lower intestine, the others hitting his left hand and right arm. This assassination attempt on the Pope in May 1981 left him severely wounded and with considerable blood loss – his health was never the same again. In July 1981, the perpetrator, Ali Ağca, was sentenced to life imprisonment. Pope John Paul II asked people to pray ‘for my brother Ağca, whom I have sincerely forgiven’.\nTwo years later, he was to take the hand of Ali Ağca, then in prison, and quietly tell him that he had forgiven him for what he had done (even though his would-be killer had not asked for forgiveness). He developed a friendship over the years, meeting Ağca’s mother in 1987 and his brother a decade later. In June 2000 Ağca was pardoned by the Italian President at the Pope’s request. In February 2005 Ağca sent a letter to the Pope wishing him well. When the Pope died on 2 April 2005, Ağca’s brother, Adrian, gave an interview saying that Ağca and his entire family were grieving and that the Pope had been a great friend to them.\nPope John Paul II’s response of love and mercy is exemplary. God’s love and mercy is even more extraordinary because ‘At the cross of Jesus, pardon is complete. Love and justice mingle, truth and mercy meet.’",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 93
}