{
  "title": "Pong-in-a-Dish",
  "link": "https://spectrum.ieee.org/pong-in-a-dish",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-grid-with-colorful-blocks-that-look-like-lights-and-columns-a-box-shows-control-panels-and-another-shows-a-visualizer-of-the.jpg?id=31994756&width=1200&height=800&coordinates=20%2C0%2C20%2C0\"/><br/><br/><p>Ever hear of the <a href=\"https://spectrum.ieee.org/untold-history-of-ai-charles-babbage-and-the-turk\" target=\"_self\">Turk</a>—the 19th<sup></sup>-century mechanism topped by a turbaned head that played chess against all comers? In fact, hidden inside was a diminutive chessmaster, one you might imagine deadpanning, “<a href=\"https://www.youtube.com/watch?v=pyxJ7GKGFG0\" rel=\"noopener noreferrer\" target=\"_blank\">Eh, It’s a living.</a>”</p><p>Then there’s its namesake, the <a href=\"https://spectrum.ieee.org/untold-history-of-ai-mechanical-turk-revisited-tktkt\" target=\"_self\">Mechanical Turk</a>—a 21st<sup></sup>-century service offered by Amazon to mark up images on the Web with the help of crowdsourced freelancers. They, too, might intone, glassy-eyed, “It’s a living.”</p><p>Now we have a kind of Biological Turk. A mass of neurons act as a computer that mimics a human being playing the classic computer game Pong. The neurons, some taken from mouse embryos, others grown from human precursor cells, spread out into a one-layer, 800,000-cell mesh called a biological neural network, which lives in a giant petri dish called the DishBrain. There it interfaces with arrays of electrodes that form an interface to silicon hardware. Software mounted on that hardware provides stimulation and feedback, and the minibrain learns how to control a paddle on a simulated ping-pong table.</p><p>The work was described recently in the journal <a href=\"https://www.cell.com/neuron/fulltext/S0896-6273(22)00806-6#%20\" rel=\"noopener noreferrer\" target=\"_blank\"><em>Neuron</em></a> by Brett Kagan, the chief scientific officer of <a href=\"https://corticallabs.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Cortical Labs</a>, a startup in Melbourne, Australia, and nine colleagues at that company.</p><p>The authors talk hopefully about the emergence of sentience, a notion that other brain-in-a-dish researchers have also <a href=\"https://www.nature.com/articles/d41586-020-02986-y\" rel=\"noopener noreferrer\" target=\"_blank\">recently floated</a>. But they seem to stand on solid ground when they say their method will help to advance brain science, on the one hand, and computer science, on the other. A bio-neuro-network might model the effects of drugs on the brain in ways that single-cell neurons can’t. Also, neurons may show themselves to be more than just protoplasmic logic switches but more like entire computers.</p><p>The question before us, though, is how does the thing play Pong?</p><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"0d57b1d55d16d51cf831540a01c2f883\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/GJaXiR_uvVI?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Pong-in-a-Dish</small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">\n<a href=\"https://youtu.be/GJaXiR_uvVI\" target=\"_blank\">youtu.be</a>\n</small>\n</p><p>First, the electronic scaffolding hits the minibrain with electrical signals that represent the position and movement of the virtual ball. It’s rather like the action potential that a firing neuron would use to convey, say, a sensory signal from the eye to the brain. Because the electrodes are placed at different points in the cell network, the system physically represents the different possible locations. Further information comes from the frequency of the signals, which varies with the distance of the ball to the virtual paddle.<br/></p><p>The network responds to these stimuli like a motor neuron, sending out a signal that moves the virtual paddle. If the resulting movement causes the ball to bounce, the neural network gets a “reward.” Failure results in a signal that has the opposite effect.<span></span></p><p>“Reward” is put in sneer quotes because these cells don’t have feelings. They can’t experience the joy of victory, the agony of defeat. There’s no dopamine, no salted popcorn. Instead, the researchers say, the network is working to minimize unpredictability. In this view, the so-called reward is a predictable signal, the anti-reward is an unpredictable one.</p><p>Kagan tells <em>IEEE Spectrum</em> that the system as a whole then reorganizes to become better at playing the game. The most marked improvement came in the first five minutes of play.</p><p>It seems amazing that a mere 800,000 neurons can model the world, even a simplified world. But, Kagan says, such feats are seen in nature. \"Flies have even fewer neurons but must be able to do some modeling—although perhaps not in a way a human may—to navigate a complex and changing 3D world,\" he says.</p><p>As he and his colleagues point out in their report the ability of neurons to adapt to external stimuli is well established <em>in vivo</em>; it forms the basis for all animal learning. But theirs, they say, is the first <em>in vitro </em>demonstration involving a goal-directed behavior. </p><p>The current version of Pong is forgiving. The paddle is broad, the volley slow, the ball unspinning. Even a neophyte would crush DishBrain. Then again, the same was true of all of AI’s early assays in game playing.</p><p>The early chess machines would sometimes senselessly give up first a pawn, then a piece, then the queen—all because they were attempting to put off a disagreeable action to a point beyond the built-in <a href=\"https://spectrum.ieee.org/cars-may-think-but-will-they-achieve-artificial-stupidity\" target=\"_self\">planning horizon</a>. Poker-playing programs <a href=\"https://spectrum.ieee.org/poker-pros-battle-artificial-intelligence-to-statistical-draw\" target=\"_self\">got good</a> pretty fast, but the early ones sometimes played too well—that is, too cautiously—against weak human opponents, which reduced their winnings. Car navigation programs would send you into a vacant lot.</p><p>You might think that just getting a machine to play a decent game is the hard part, and that further improving it to perfection ought to be a snap. Edgar Allan Poe made that judgement when he called the Turk a fraud because it occasionally erred. His conclusion was correct but his reasoning was faulty.</p><p>It’s not easy turning a barely there machine into a world champion at chess or <a href=\"https://spectrum.ieee.org/alphago-wins-match-against-top-go-player\" target=\"_self\">Go</a>. And yet it has been done.</p>",
  "pubDate": "Sat, 22 Oct 2022 14:09:13 +0000",
  "guid": "https://spectrum.ieee.org/pong-in-a-dish",
  "category": [
    "Neuroscience",
    "Brain computer interface",
    "Video games",
    "Pong",
    "Neurons",
    "Biological neural networks"
  ],
  "dc:creator": "Philip E. Ross",
  "media:content": ""
}