{
  "id": "tag:blogger.com,1999:blog-2957813557601703695.post-3530987476728212727",
  "published": "2022-10-28T09:54:00.000+05:00",
  "updated": "2022-10-28T09:54:02.112+05:00",
  "category": [
    "",
    "",
    ""
  ],
  "title": "Meta Q3 Sales Slip 4% and Profits Miss Expectations, Facebook Nears 2 Billion Daily Users",
  "content": "<h1 style=\"text-align: left;\">Meta Q3 Sales Slip 4% and Profits Miss Expectations, Facebook Nears 2 Billion Daily Users</h1><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhJT_RvEKh3a4xmem5OWkuXrdD2K26VGW3-VBNlfh88uKUWb_-Vxf6VrveDGN-Mj_c_ggUBypvzjqTeM6y7eAxCbHnIT0s7bp9AdCsaaJMV_CIaNYzZVFhtNPZLQ_xWj9a5IwgGKwaw2F3wvIDxd5T8yS8fNK6ybvHGfA3y9pvdBP88773DWox5-lnnAA/s720/879b9b7f5d1d250f23b892eb3105cb6c1666860702627314_original.webp\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"540\" data-original-width=\"720\" height=\"480\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhJT_RvEKh3a4xmem5OWkuXrdD2K26VGW3-VBNlfh88uKUWb_-Vxf6VrveDGN-Mj_c_ggUBypvzjqTeM6y7eAxCbHnIT0s7bp9AdCsaaJMV_CIaNYzZVFhtNPZLQ_xWj9a5IwgGKwaw2F3wvIDxd5T8yS8fNK6ybvHGfA3y9pvdBP88773DWox5-lnnAA/w640-h480/879b9b7f5d1d250f23b892eb3105cb6c1666860702627314_original.webp\" width=\"640\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\"></td></tr></tbody></table><br /><div><br /></div><div><div>Meta was buffeted by a broad ad-spending slowdown in the third quarter, reporting a year-over-year revenue decline of 4%, while it missed Wall Street expectations on the bottom line as heavy metaverse investments continued to eat into earnings.</div><div><br /></div><div>The company said its flagship Facebook app had 1.984 billion daily active users on average in Q3, up around 16 million from 1.968 billion the prior quarter — and, as Meta’s core social media business plateaus, it’s facing stronger competition from TikTok. Facebook DAUs had previously declined in Q4 2021, by about 1 million.</div><div><br /></div><div>Click here to sign up for Variety’s free Strictly Business newsletter covering earnings, financial news, and more.</div><div><br /></div><div>For the third quarter, Meta reported $27.71 billion in total revenue and net income of $4.4 billion, or $1.64 per share — down 52% year over year and below Wall Street expectations. The year-over-year sales drop was only its second ever as a public company, following a 1% dip in Q2. Analyst consensus estimates were for revenue of $27.38 billion and earnings of $1.89 per share, according to data from Refinitiv. Meta’s results come after Q3 earnings misses at Alphabet (parent of Google and YouTube) and Snap, which both cited weakness in ad spending during the quarter.</div><div><br /></div><div>Meta said it expects to see decline in revenue for the fourth quarter, too: It projected sales of between $30 billion and $32.5 billion, which would be a drop of 3.5%-11% versus the year prior.</div><div><br /></div><div>On the earnings miss and Q4 revenue guidance, Meta stock plummeted more than 18% in after-hours trading. Shares are down more than 68% year to date.</div><div><br /></div><div>“Our community continues to grow and I’m pleased with the strong engagement we’re seeing driven by progress on our discovery engine and products like Reels,” Meta chief Mark Zuckerberg said in prepared remarks. “While we face near-term challenges on revenue, the fundamentals are there for a return to stronger revenue growth. We’re approaching 2023 with a focus on prioritization and efficiency that will help us navigate the current environment and emerge an even stronger company.”</div><div><br /></div><div>Instagram has more than 2 billion monthly active users and WhatsApp has more than 2 billion daily users, according to Zuckerberg. He said Q3 revenue would have grown slightly excluding the impact of foreign exchange rates (according to Meta, if exchange rates had remained constant with Q3 2021, revenue for the most recent quarter would have been $1.79 billion higher).</div><div><br /></div><div>Zuckerberg said Reels — the company’s short-form video copycat of TikTok — is seeing 140 billion daily views across Facebook and Instagram, up 50% from six months ago. Reels is now on a $3 billion annual revenue run rate, he said. “We believe we’re gaining share on time spent on competitors like TikTok,” Zuckerberg said.</div><div><br /></div><div>Meanwhile, Meta has been spending billions on its metaverse projects, recently unveiling the high-end Meta Quest Pro headset ($1,500), a pivot the social media giant signaled with its new name. The company also revealed that a cheaper, consumer-focused next-gen Quest is coming in 2023. But Meta’s Reality Labs, comprising its VR, AR and wearables businesses, is years away from contributing to the bottom line and has cramped overall financial results.</div><div><br /></div><div>In Q3, Reality Labs posted an operating loss of $3.67 billion versus a loss of $2.63 billion in the year-earlier period. Revenue for the unit came in at $285 million, dropping 49% year-over-year.</div><div><br /></div><div>“We do anticipate that Reality Labs operating losses in 2023 will grow significantly year-over-year,” outgoing CFO Dave Wehner said in a statement. “Beyond 2023, we expect to pace Reality Labs investments such that we can achieve our goal of growing overall company operating income in the long run.”</div><div><br /></div><div>On Monday, Meta investor Brad Gerstner of Altimeter Capital posted an open letter to Zuckerberg and the company’s board, recommending Meta cut its headcount by 20% and cap its metaverse investments at $5 billion annually (versus $10 billion-$15 billion currently). “Meta has drifted into the land of excess — too many people, too many ideas, too little urgency,” Gerstner wrote. “This lack of focus and fitness is obscured when growth is easy but deadly when growth slows and technology changes.”</div><div><br /></div><div>In July, Zuckerberg had said Meta plans to “steadily reduce” headcount growth over the next year, saying that “Many teams are going to shrink.”</div><div><br /></div><div>In Wehner’s 2023 guidance to investors, he said Meta is “holding some teams flat in terms of headcount, shrinking others and investing headcount growth only in our highest priorities. As a result, we expect headcount at the end of 2023 will be approximately in-line with third quarter 2022 levels.” Wehner is stepping down as Meta’s CFO next week; Susan Li, currently VP of finance, will take over the role on Nov. 1.</div><div><br /></div><div>Meta reported having 87,314 employees as of Sept. 30, 2022, up 28% year over year, and a net increase of 3,700 during the period.</div><div><br /></div><div>Read more:&nbsp;<a href=\"https://www.yahoo.com/now/meta-q3-sales-slip-4-201257522.html\">https://www.yahoo.com/now/meta-q3-sales-slip-4-201257522.html</a></div><div><br /></div></div><div class=\"blogger-post-footer\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js\"></script>\n<!-- MobileAds -->\n<ins class=\"adsbygoogle\"\n     style=\"display:inline-block;width:320px;height:50px\"\n     data-ad-client=\"ca-pub-2762820915666464\"\n     data-ad-slot=\"9814557735\"></ins>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Admin",
    "uri": "https://www.blogger.com/profile/00179371387546033311",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}