{
  "title": "Netgear Introduces Wi-Fi 6 / 6E Access Points and Services for Residential Installers",
  "dc:creator": "Ganesh T S",
  "description": " <p align=\"center\"><a href=\"https://www.anandtech.com/show/17592/netgear-introduces-wifi-6-6e-access-points-and-services-for-residential-installers\"><img src=\"https://images.anandtech.com/doci/17592/ntgr-cedia-carousel_575px.png\" alt=\"\" /></a></p><p><p>Netgear has been at the forefront of the SDVoE (Software-Defined Video over Ethernet) initiative with multiple AV switches serving the growing market. The ProAV lineup of managed switches have been sold primarily in a B2B setting by the Netgear Business division. These switches are increasingly becoming part of luxury residential installations requiring an AV-over-IP solution. As part of the CEDIA Expo 2022, Netgear is announcing a new 'Netgear Home Solutions' push. The intention is to take the same lineup of Netgear AV products sold by Netgear Business and target it towards both commercial and residential installations.</p>\n\n<p>As part of this initiative, Netgear will be selling ProAV Managed Switches and ProWiFi Access Points to residential installers, along with the Pro version of Insight Remote Management and Pro Support. While the ProAV Managed Switches are already in the market, the new WAX628 and WAX638E APs are complementary to the currently existing <a href=\"https://www.anandtech.com/show/17272\">members of the Insight Access Point Portfolio</a>.</p>\n\n<p align=\"center\"><a href=\"https://www.anandtech.com/show/17592/netgear-introduces-wifi-6-6e-access-points-and-services-for-residential-installers\"><img alt=\"\" src=\"https://images.anandtech.com/doci/17592/ntgr-cedia-00_575px.png\" /></a></p>\n\n<p>The WAX628 (already available for residential installers) slots in-between the dual-band AX3600 WAX620 and the tri-band AX6000 WAX630. This AX5400 dual-band solution supports 160 MHz channel bandwidth, and is accompanied by the AX7800 WAX638E which adds 6 GHz band support to the mix. The Wi-Fi 6E AP is slated to come to the market in the next few months.</p>\n\n<p>Netgear is promising margin protection for installers by selling the ProAV and ProWiFi products only through the channel and not via Amazon or other e-tailers. Since these products are going to reach end-consumers through custom installers who have their own cost structures, the lack of any pricing information from Netgear is not surprising.</p>\n\n<p align=\"center\"><a href=\"https://www.anandtech.com/show/17592/netgear-introduces-wifi-6-6e-access-points-and-services-for-residential-installers\"><img alt=\"\" src=\"https://images.anandtech.com/doci/17592/ntgr-cedia-01_575px.png\" /></a></p>\n\n<p>Netgear's traditional consumer Wi-Fi router market has evolved rapidly over the last few years. Despite the success of Orbi (in both the consumer and SMB markets), new entrants like eero have gained significant mind and market share. In this context, Netgear has to look towards services and expand into new markets in order to maintain and build upon their technical leadership. Forays into lucrative niches like the residential installer market are not surprising.</p>\n\n<p><div>Gallery: <a href=\"https://www.anandtech.com/Gallery/Album/8191\" target=\"_blank\">Netgear Introduces Wi-Fi 6 / 6E Access Points and Services for Residential Installers</a><div><a href=\"https://www.anandtech.com/Gallery/Album/8191#1\" target=\"_blank\"><img src=\"https://images.anandtech.com/galleries/8191/ntgr-cedia-00_carousel_thumb.png\" width=\"85\" height=\"85\" border=\"0\"/></a><a href=\"https://www.anandtech.com/Gallery/Album/8191#2\" target=\"_blank\"><img src=\"https://images.anandtech.com/galleries/8191/ntgr-cedia-01_carousel_thumb.png\" width=\"85\" height=\"85\" border=\"0\"/></a><a href=\"https://www.anandtech.com/Gallery/Album/8191#3\" target=\"_blank\"><img src=\"https://images.anandtech.com/galleries/8191/ntgr-cedia-carousel_thumb.png\" width=\"85\" height=\"85\" border=\"0\"/></a></div></div></p>\n</p>",
  "link": "https://www.anandtech.com/show/17592/netgear-introduces-wifi-6-6e-access-points-and-services-for-residential-installers",
  "pubDate": "Tue, 27 Sep 2022 08:30:00 EDT",
  "guid": "tag:www.anandtech.com,17592:news",
  "category": " Networking"
}