{
  "id": "yt:video:QyhRQKxBpoA",
  "yt:videoId": "QyhRQKxBpoA",
  "yt:channelId": "UCQSEAbOs6vsJfy7WN7iYaGQ",
  "title": "Castle Crashers speedruns are incredibly violent",
  "link": "",
  "author": {
    "name": "EazySpeezy",
    "uri": "https://www.youtube.com/channel/UCQSEAbOs6vsJfy7WN7iYaGQ"
  },
  "published": "2022-09-10T17:00:22+00:00",
  "updated": "2022-09-19T23:23:37+00:00",
  "media:group": {
    "media:title": "Castle Crashers speedruns are incredibly violent",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "We decided to speedrun Castle Crashers and it almost drove us insane. This speedrun is way more difficult than you think, but it's also incredibly nostalgic so it's a good time at least\n\nThanks to @LaxChris, @Purple Hair Guy, and @VengeanceBry for doing the speedrun with me!\n\nMy 2nd channel (WEEKLY UPLOADS): https://www.youtube.com/eaziestspeezy\nWatch live at: https://twitch.tv/EazySpeezy\n\n▶ Twitter: https://twitter.com/EazySpeezy\n▶ Instagram: https://instagram.com/EazySpeezy/\n▶ Merch: https://eazyspeezy.com\n\nEdited by: @The Suited Bird \nWatch the world record speedrun here: this run\n\nMy channel generally focuses on a more casual side of speedruns. With these videos I want to show off cool speedruns, explain how they work, and entertain. Hopefully you enjoy the content and maybe even take up speedrunning yourself, because it is truly a lot of fun!\n\nCastle Crashers description (from Steam):\n\nHack, slash, and smash your way to victory in this newly updated edition of the insanely popular 2D arcade adventure from The Behemoth! Up to four friends can play locally or online and save your princess, defend your kingdom, and crash some castles!\n\nWith the new Barbarian Makeover Update, Castle Crashers now delivers uncapped framerate and a new Ultra texture quality mode. We even built a new, fast-paced multiplayer minigame just for you and your friends!\nKey Features:\n(NEW!) Back Off Barbarian mini game: Jump and hop across the level to avoid the enemies!\nUnlock more than 25 characters and over 40 weapons!\nIntuitive combo and magic system: Unlock an arsenal of new attacks as your character progresses through the game.\nLevel up your character and adjust Strength, Magic, Defense, and Agility.\nAdorable animal orbs are your companions. Each adds different abilities to aid you on your journey.\nArena mode: Battle other players in free-for-all or team matches!\nInsane Mode: Test your skills in the ultimate campaign challenge\nNecromantic Pack (includes Necromancer and Cult Minion characters)\nKing Pack (includes The King and Open-Faced Gray Knight)\nAlso includes: Alien Hominid playable character\n\n#EazySpeezy #CastleCrashers #Speedrun",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}