{
  "title": "S1E59 - Finding a New Path Forward with Master Yoga Instructor Cristi Christensen",
  "guid": "https://pinecast.com/guid/afb5bf85-7b8f-4948-aa66-47290ef6502a",
  "pubDate": "Thu, 31 Mar 2022 06:30:00 -0000",
  "itunes:duration": "01:01:20",
  "description": "<p>Today, Laura catches up with her dear friend, fellow competitive platform diver, and bridesmaid in her wedding, Cristi Christensen. Originally an elite-level gymnast, Cristi went on to train with the US Olympic diving team as a young adult. After an injury cut her Olympic dreams short, Cristi shifted her focus to helping others improve their level of fitness through personal training, Pilates, Core Fusion, and yoga. In addition to a degree in Kinesiology, Cristi has studied extensively for over 10 years with world-renowned teachers including Saul David Raye, Shiva Rea, Seane Corn, Elisabeth Halfpapp, and Fred DeVito.</p>\n<p>Cristi begins by sharing what inspired her to get into gymnastics, her journey to becoming an elite gymnast, her transition to diving, and the injuries that ultimately ended her Olympic dreams. She goes on to describe what drove her to yoga, how it changed her, and why she eventually began teaching it. Cristi also details her experience as a global traveling yoga teacher, how the pandemic caused her to pivot yet again, and the outcome of her most recent pivot. The episode draws to a close with an overview of Cristi's work to expand the definition of wellness and well-being, and how her style of yoga brings her back to how she grew up. Cristi’s story of responding to injuries with her determination to bounce back, keep learning and moving forward will captivate and inspire all who listen into this fascinating conversation today.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>Cristi’s transition from being an elite gymnast to an elite diver</li>\n<li>Diving injuries ended her dream of the Olympics, just as they’d ended her gymnastics career</li>\n<li>How Cristi’s pain and anxiety drove her to yoga</li>\n<li>How yoga changed her</li>\n<li>Cristi begins to teach fitness classes, but she refused to teach yoga</li>\n<li>What changed her mind?</li>\n<li>How flying by the seat of her pants helped launch her career as a global traveling yoga teacher</li>\n<li>How the pandemic forced Cristi to pivot yet again</li>\n<li>The outcome of Cristi’s most recent pivot</li>\n<li>Cristi’s work to expand the definition of wellness and well-being</li>\n<li>How Cristi’s style of yoga, which incorporates dance and music, brings her back to how she grew up</li>\n</ul>\n<p>Quotes:</p>\n<ul>\n<li>“My mom was like ‘No more. No more. I know it’s your dream but we’re not risking you being paralyzed.’ And there was no pushing… that was the end of my gymnastics career.”</li>\n<li>“That’s just so quick though, too. I mean, you go for a summer, doing a sport you’ve never done, and you just decide to move for your last two years of high school. Like, that’s pretty intense. But it sounds like that’s kind of the way you roll.”</li>\n<li>“I did shatter my left hand into a million pieces. Basically, I had three metal plates and 22 screws to put it back together.”</li>\n<li>“And that’s where joy, like a joy of movement, started coming back. My body was healing, I was connecting to my breath.”</li>\n<li>“But now I had a new lens on it, because the practice I was doing was healing me and I wanted to be able to share that with others… I taught tons of different fitness classes and was still doing yoga as my personal practice… yoga really opened me up in a way that I didn’t even know I was closed.”</li>\n<li>“Every time you show up and do it, those voices will get smaller.”</li>\n<li>“I had some really bizarre instances that just made it so, so clear that the way I was living and the way I was working were no longer in alignment.”</li>\n<li>“I got to a point where the fear of if I failed was much smaller than the fear of actually staying and staying small and staying trapped in something.”</li>\n<li>“Over the years it evolved… how could something that was so right, now be something that’s actually a detriment to the evolution of my career or the evolution of where in my soul I believe I wanted to go?”</li>\n<li>“I just thought I was going to be hanging out in LA for six months, like figuring it out… but as the opportunities came, I was like, ‘Well, I just have to say yes’.”</li>\n<li>“I didn’t realize I had all my eggs in one basket; I thought I was diversified.”</li>\n<li>“Everything I teach is based off of ‘how can we use this as a map for our own empowerment, our own awakening, so that we can live a life that is full of color and rich in love and passion and freedom, but really be grounded in this very human experience and be able to deal with everything that life brings?’”</li>\n<li>“The whole idea was to share women’s stories… I want more women’s voices to be heard. I want more kids growing up to have more access to role models from different backgrounds.”</li>\n<li>“I’m not teaching a routine. It’s not like ‘5, 6, 7, 8’. It’s actually getting you to a place that you feel free enough to express and to move and to breathe, and just enjoy the aliveness and the power pulsing through your body - letting it move, letting the emotions move, letting everything just flow. And it’s super powerful and super fun!”</li>\n</ul>\n<p><strong><a href=\"https://www.kaatsu.com/go/PURSUIT\" rel=\"nofollow\">Pursuit of Gold Podcast is brought to you by Kaatsu Global</a><a href=\"https://kaatsu.com/\" rel=\"nofollow\">.</a></strong></p>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold</a>\n<a href=\"https://www.laurawilkinson.com/journal\" rel=\"nofollow\">The Confidence Journal</a>\n<a href=\"https://www.amazon.com/Life-10-Meters-Lessons-Champion/dp/B096CQW2L7/ref=sr_1_3?crid=2AXVGI3HL987J&dchild=1&keywords=laura+wilkinson+life+at+10+meters&qid=1624113646&sprefix=Laura+Wilkinson%2Caps%2C227&sr=8-3\" rel=\"nofollow\">Life at 10 Meters: Lessons from an Olympic Champion</a>\n<a href=\"http://laurawilkinson.com/shop\" rel=\"nofollow\">Laura Wilkinson Designs- Shop</a></p>\n<p>Laura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura’s Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura’s Facebook</a></p>\n<p>Cristi’s Links:\n<a href=\"https://www.cristichristensen.com/\" rel=\"nofollow\">Cristi’s Homepage</a>\n<a href=\"https://www.instagram.com/cristi_christensen/\" rel=\"nofollow\">Cristi’s Instagram</a>\n<a href=\"https://www.chakraritualsbook.com/\" rel=\"nofollow\">Cristi’s Book</a></p>",
  "itunes:title": "Finding a New Path Forward with Master Yoga Instructor Cristi Christensen",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 59
}