{
  "title": "&#8220;Rankings offer no sense of scale&#8221;",
  "link": "https://statmodeling.stat.columbia.edu/2022/11/02/rankings-offer-no-sense-of-scale/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/11/02/rankings-offer-no-sense-of-scale/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Wed, 02 Nov 2022 13:03:02 +0000",
  "category": [
    "Miscellaneous Statistics",
    "Sociology"
  ],
  "guid": "https://statmodeling.stat.columbia.edu/?p=47963",
  "description": "Laura &#8220;Namerology&#8221; Wattenberg writes: Rankings offer no sense of scale. There is always a #1 name, even if that name is only a fraction as popular as #1s of past eras. That’s a problem when scale itself—the changing level of &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/11/02/rankings-offer-no-sense-of-scale/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>Laura &#8220;Namerology&#8221; Wattenberg <a href=\"https://namerology.com/2022/08/24/the-top-of-the-charts-illusion-how-popularity-rankings-lie-about-baby-names/\">writes</a>:</p>\n<blockquote><p>Rankings offer no sense of scale. There is always a #1 name, even if that name is only a fraction as popular as #1s of past eras. That’s a problem when scale itself—the changing level of consensus—is part of the story.</p>\n<p>In the past, popularity charts served as a solid snapshot of everyday name style, especially for boys. America’s top 10 names accounted for about a third of all boys born. But the popularity curve has flattened. Today’s top 10 accounts just one-fourteenth of American boys.</p>\n<p><img src=\"https://statmodeling.stat.columbia.edu/wp-content/uploads/2022/08/image.png\" alt=\"\" width=\"350\" /></p></blockquote>\n<p>Here&#8217;s how we put it in <a href=\"http://www.stat.columbia.edu/~gelman/regression/\">Regression and Other Stories</a>:</p>\n<p><img src=\"https://statmodeling.stat.columbia.edu/wp-content/uploads/2022/08/Screen-Shot-2022-08-31-at-1.04.25-PM.png\" alt=\"\" width=\"550\" /></p>\n<p>Wattenberg summarizes:</p>\n<blockquote><p>\nAmerica’s top-10 list of popular baby names always looks comforting. Or, depending on your perspective, boring. The names change slowly, and their style remains mostly traditional. The overall impression is of gradual evolution and cultural continuity. And it’s a lie.</p>\n<p>Change in 21st-century naming has been anything but gradual. It’s been revolutionary, a splintering of style that breaks with the past in dramatic ways. But the top of the popularity charts cannot tell this story. A top-10 list is a perfect instrument to create the illusion of stability in the midst of a cyclone. . . .</p>\n<p>By consistently reporting name data in scaleless rankings, news reports obscure the fact that the top 10 is losing relevance as a portrait of how we name children.</p>\n<p>Last year, an incredible 31,538 different names registered in U.S. baby name stats. Yet 8% of babies received a name that was too rare to even register in the count—more than received a top-10 name. That’s the real story of American names today. But as long as we continue to focus on the top of the popularity charts, we’ll continue to see only the most traditional sliver of our increasingly freewheeling name culture.</p></blockquote>\n<p>Good point, as sociology, statistics, and statistical communication.</p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/11/02/rankings-offer-no-sense-of-scale/feed/",
  "slash:comments": 8
}