{
  "title": "The War in Ukraine Disrupts Trade in Both Food and Fuel",
  "link": "https://spectrum.ieee.org/russian-exports",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-man-in-a-hard-hat-reaches-down-into-the-cargo-hold-of-a-ship-and-puts-his-hand-into-a-big-pile-of-yellowish-grain-two-other-m.jpg?id=31170659&width=1245&height=700&coordinates=0%2C0%2C0%2C388\"/><br/><br/><p><strong>The Russian invasion</strong> of Ukraine has brought a stream of reports about the country’s energy exports. Here are the basic facts.  </p><p>Russia ranks second in the extraction of both crude oil (behind the United States and ahead of Saudi Arabia) and natural gas (behind the United States and ahead of Iran), and it is the sixth-largest producer of coal (behind Australia and ahead of South Africa). Before the war, Russia exported about 55 percent of its fossil-fuel output, mostly to the European Union. The EU bought about 85 percent of the natural gas that Russia shipped out (via pipelines from Western Siberia) and nearly 55 percent of the crude oil and refined oil products that Russia exported (via pipelines and tankers). </p><hr/><p>This means that in 2021 the EU got more than 40 percent of its natural gas, 27 percent of its oil, and 46 percent of its coal imports from Russia, for which it paid €99 billion, or nearly US $10 billion a month. Since the start of the war, soaring energy prices have lifted this import bill to about $23 billion a month, making the EU a significant de facto financier of the Russian invasion: three-quarters of a billion a day! Belatedly, in May, the EU produced its <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/IP_22_3131\" target=\"_blank\">REPowerEU plan</a>, which is intended to drastically reduce this dependence.  </p><p>But Russian exports go far beyond fossil fuels; there is also food. It is one thing for the EU to reduce its dependence on Russian hydrocarbons, quite another for many low-income countries to do without Russian (and Ukrainian) grain. This is because Russia has changed from a proverbial agricultural basket case to a food basket. Any attempt to reduce imports of its foodstuffs would impose higher prices on precisely those nations that can least afford them. </p><p class=\"pull-quote\">It is one thing for the EU to reduce its dependence on Russian hydrocarbons, quite another for many low-income countries to do without Russian (and Ukrainian) grain.</p><p>The Soviet Union long struggled to produce wheat, and beginning in the 1970s the country indeed began to import the grain en masse from the United States. After the Soviet Union unraveled in the early 1990s, its wheatlands were divided between Russia and Ukraine. Russian agriculture at first shrank, then staged a comeback in the early years of the new century: By 2015 it had begun to export about as much wheat as the United States, and in 2018 it sold nearly twice as much (almost 44 million tonnes), most of it going to the Middle East and Africa. Some of the countries in those regions have also been buying Ukrainian wheat (the country is the fifth-largest exporter of wheat) and sunflower oil, for which Ukraine provides half and Russia a fifth of global exports. </p><p>Moreover, thanks to its large natural-gas production, Russia is also the world’s second-largest producer of ammonia (after China, ahead of India), a key ingredient for artificial nitrogenous fertilizers, of which it is the second-largest exporter. Its reserves of potash and phosphates make it, respectively, the world’s second-largest producer (and exporter) of potassium (after Canada) and the fourth-largest producer (after China, Morocco, and the United States) of phosphates. No other country controls a similarly large share of each of the three plant macronutrients that are needed to sustain high crop yields.  </p><p>No wonder the war raised concerns about the near-complete disruption of Ukrainian food exports (Odesa’s port was blockaded) and about the reduction of Russia’s grain and fertilizer shipments. Global food prices had begun to rise already during the pandemic, and their further expected war-induced increase will have the greatest impact in Asia and Africa, where people typically spend 30 to 40 percent of their disposable income on food; the U.S. share in 2020, by contrast, was about 9 percent.  </p><p>Worst of all, the <a href=\"https://www.wfp.org/\" target=\"_blank\">World Food Programme</a> and the <a href=\"https://www.fao.org/home/en\" target=\"_blank\">Food and Agriculture Organization</a> of the United Nations now expect that rising food prices, widespread supply problems, and worsening drought in parts of Africa will raise the number of malnourished and hungry people. That is why it was encouraging to hear in late July that Russia and Ukraine had agreed to restart Ukrainian food shipments: The first grain-carrying ship left Odesa, Ukraine’s largest port, for Lebanon on 1 August 2022. </p><p><em>This article appears in the September 2022 print issue as “Fuel, Food, and War.”</em></p><div class=\"rm-embed embed-media\"><div class=\"flourish-embed flourish-map\" data-src=\"visualisation/10779144?602891\"><script src=\"https://public.flourish.studio/resources/embed.js\"></script></div></div>",
  "pubDate": "Mon, 29 Aug 2022 15:00:00 +0000",
  "guid": "https://spectrum.ieee.org/russian-exports",
  "category": [
    "Energy",
    "Food",
    "Food insecurity",
    "War"
  ],
  "dc:creator": "Vaclav Smil",
  "media:content": ""
}