{
  "title": "Episode 76: &#8220;Stagger Lee&#8221; by Lloyd Price",
  "link": "https://500songs.com/podcast/episode-76-stagger-lee-by-lloyd-price/",
  "pubDate": "Tue, 31 Mar 2020 14:58:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=493",
  "description": "Episode seventy-six of&nbsp;<em>A History of Rock Music in Five Hundred Songs</em>&nbsp;looks at \"Stagger Lee\" by Lloyd Price, and how a barroom fight 125 years ago led to a song performed by everyone from Ma Rainey to Neil Diamond. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on&nbsp;<a href=\"https://www.patreon.com/posts/35456421\">\"That Crazy Feeling\" by Kenny Rogers</a>.\n\nI have also beeped out some expletives in the song excerpts this week, so as not to be censored by some podcast aggregators, and so I've uploaded&nbsp;<a href=\"https://www.patreon.com/posts/35456492\">an unbeeped version</a>&nbsp;for backers.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust%20\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-stagger-lee/\">a Mixcloud streaming playlist&nbsp;</a>with full versions of all the songs in the episode.\n\nThe bulk of the information in this episode came from&nbsp;<a href=\"https://amzn.to/2UPh0vq\"><em>Stagolee Shot Billy</em>, by Cecil Brown, the person who finally identified Lee Shelton as the subject of the song.</a>\n\nI also got some information from&nbsp;<a href=\"https://amzn.to/2wOuob5\"><em>Get Your Ass in the Water and Swim Like Me: African-American Narrative Poetry from the Oral Tradition</em></a>&nbsp;by Bruce Jackson,<a href=\"https://amzn.to/3bHN0Ir\">&nbsp;<em>Unprepared to Die</em>&nbsp;by Paul Slade,</a>&nbsp;and&nbsp;<a href=\"https://amzn.to/2UHpfcE\"><em>Yo' Mama!: New Raps, Toasts, Dozens, Jokes and Children's Rhymes from Urban Black America</em></a>&nbsp;edited by&nbsp;Onwuchekwa Jemie.\n\nLloyd Price has written a few books.&nbsp;<a href=\"https://amzn.to/2ShLwvs\">His autobiography</a>&nbsp;is out of print and goes for silly money (and don't buy the \"Kindle edition\" at that link, because it's just the sheet music to the song, which Amazon have mislabelled) but he's also written&nbsp;<a href=\"https://amzn.to/2GCj2LB\">a book of essays</a>&nbsp;with his thoughts on race, some of which shed light on his work.\n\nThe Lloyd Price songs here can be found on&nbsp;<a href=\"https://amzn.to/2Shr7qd\">The Complete Singles As & Bs 1952-62</a>&nbsp;.\n\nAnd you can get the Snatch and the Poontangs album&nbsp;<a href=\"https://amzn.to/39yRDmO\">on a twofer</a>&nbsp;with Johnny Otis' less explicit album&nbsp;<em>Cold Shot.</em>\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">Why not join them</a>?\n\n<strong>Transcript</strong>\n\nBefore we start today's episode, a brief note.\n\nFirstly, this episode contains a description of a murder, so if you're squeamish about that sort of thing, you may want to skip it.\n\nSecondly, some of the material I'm dealing with in this episode is difficult for me to deal with in a podcast, for a variety of reasons. This episode will look at a song whose history is strongly entwined both with American racism and with black underworld culture. The source material I've used for this therefore contains several things that for different reasons are difficult for me to say on here. There is frequent use of a particular racial slur which it is not okay under any circumstances for me as a white man to say; there are transcripts of oral history which are transcribed in rather patronising attempts at replicating African-American Vernacular English, which even were those transcripts themselves acceptable would sound mocking coming out of my English-accented mouth; and there is frequent use of sexual profanity, which I personally have no problem with at all, but would get this podcast an explicit rating on several of the big podcast platforms.\n\nThere is simply no way to tell this story while avoiding all of those things, so I've come up with the best compromise I can. I will not use, even in quotes, that slur. I will minimise the use of transcripts, but when I have to use them, I will change them from being phonetic transcripts of AAVE into being standard written English, and I will include the swearing where it comes in the recordings I want to use but will beep it out of the version that goes up on the main podcast feed. I'll make an unexpurgated version available for my Patreon backers, and I'll put the unbleeped recordings on Mixcloud.\n\nThe story we're going to tell goes back to Christmas Day 1895, but we're going to start our story in the mid 1950s, with Lloyd Price.\n\n[Excerpt: Lloyd Price, “Stagger Lee”]\n\nYou may remember us looking at Lloyd Price way back in episode twelve, from Christmas 2018, but if you don't, Price was a teenager in 1952, when he wandered into Cosimo Matassa's studio in New Orleans, at the invitation of his acquaintance Dave Bartholomew, who had produced, co-written, and arranged most of Fats Domino's biggest hits. Price had a song, \"Lawdy Miss Clawdy\", which was loosely based around the same basic melody as Domino's earlier hit \"The Fat Man\", and they recorded it with Bartholomew producing, Domino on piano, and the great Earl Palmer on drums:\n\n[Excerpt: Lloyd Price, \"Lawdy Miss Clawdy\"]\n\nThat was one of the first R&B records put out on Specialty Records, the label that would later bring Little Richard, Larry Williams, Sam Cooke and others to prominence, and it went to number one on the R&B charts. Price had a couple more big R&B hits, but then he got drafted, and when he got back the musical landscape had changed enough that he had no hits for several years. But then both Elvis Presley and Little Richard cut cover versions of \"Lawdy Miss Clawdy\", and that seemed to bring Price enough extra attention that in 1957 he got a couple of songs into the lower reaches of the Hot One Hundred, and one song, \"Just Because\" went to number three on the R&B charts:\n\n[Excerpt: Lloyd Price, \"Just Because\"]\n\nBut it wasn't until 1958 that Price had what would become his biggest hit, a song that would kickstart his career, and which had its roots in a barroom brawl in St. Louis on Christmas Day 1895:\n\n[Excerpt: Lloyd Price, \"Stagger Lee\"]\n\nThe Lee Line was a line of steamboats that went up and down the Mississippi, run by the Lee family. Their line was notorious, even by Mississippi riverboat standards, for paying its staff badly, but also for being friendly to prostitution and gambling. This meant that some people, at least, enjoyed working on the ships despite the low pay. There is a song, whose lyrics were quoted in an article from 1939, but which seems to have been much older, whose lyrics went (I've changed these into standard English, as I explained at the start):\n\nReason I like the Lee Line trade\n\nSleep all night with the chambermaid\n\nShe gimme some pie, and she gimme some cake\n\nAnd I give her all the money that I ever make\n\nThe Lee Line was one of the two preferred steamboat lines to work on for that reason, and it ended up being mentioned in quite a few songs, like this early version of the song that's better known as \"Alabamy Bound\", but was here called \"Don't You Leave Me Here\":\n\n[Excerpt: Little Harvey Hull and Long Cleve Reed, \"Don't You Leave Me Here\"]\n\nThe line, \"If the boat don't sink and the Stack don't drown\" refers to one of the boats on the Lee Line, the Stack Lee, a boat that started service in 1902. But the boat was named, as many of the Lee Line ships were, after a member of the Lee family, in this case one Stack Lee, who was the captain in the 1880s and early 90s of a ship named after his father, James Lee, the founder of the company.\n\nIn 1948 the scholar Shields McIlwayne claimed that the captain, and later the boat, were popular enough among parts of the black community that there were \"more colored kids named Stack Lee than there were sinners in hell\". But it was probably the boats' reputation for prostitution that led to a thirty-year-old pimp in St. Louis named Lee Shelton taking on the name \"Stack Lee\", at some time before Christmas Day 1895.\n\nOn that Christmas Day, a man named Bill Lyons entered the Bill Curtis Saloon. Before he entered the saloon, he stopped to ask his friend to give him a knife, because the saloon was the roughest in the whole city, and he didn't want any trouble.\n\nBill Lyons was known as \"Billy the Bully\", but bully didn't quite, or didn't only, mean what it means today. A \"bully\", in that time and place, was a term that encompassed both being a pimp and being a bagman for a political party. There was far more overlap in the late nineteenth and early twentieth centuries between politics and organised crime than many now realise, and the way things normally operated in many areas was that there would be a big man in organised crime whose job it would be to raise money for the party, get people out to vote, and tell them which way to vote.\n\nLyons was not a popular man, but he was an influential man, and he was part of a rich family -- one of the richest black families in St. Louis. He was, like his family, very involved with the Republican Party. Almost all black people in the US were Republicans at that time, as it was only thirty years since the end of the Civil War, when the Republican President Lincoln had been credited with freeing black people from slavery, and the Bridgewater Saloon, owned by Lyons' rich brother-in-law Henry Bridgewater, was often used as a meeting place for local Republicans.\n\nLyons had just ordered a drink when Lee Shelton walked into the bar. Shelton was a pimp, and seems to have made a lot of money from it. Shelton was also a Democrat, which in this time and place meant that he was essentially a member of a rival gang.\n\n[Excerpt: Duke Ellington, \"Stack-A-Lee Blues\"]\n\nShelton was very big in the local Democratic party, and from what we can tell was far more popular among the black community than Lyons was. While the Democrats were still the less popular of the two major parties among black people in the area, some were starting to feel like the Republicans talked a good game but were doing very little to actually help black people, and were considering taking their votes elsewhere.\n\nHe was also a pimp who seems to have had a better reputation than most among the sex workers who worked for him, though like almost everything in this story it's difficult to know for certain more than a hundred and twenty years later. When he walked into the bar, he was wearing mirror-toed shoes, a velvet waistcoat, an embroidered shirt, and gold rings, and carrying an ebony cane with a gold top. He had a slightly crossed left eye, and scars on his face. And he was wearing a white Stetson.\n\nLee asked the crowd, \"Who's treating?\" and they pointed to Lyons. There was allegedly some bad blood between Lyons and Shelton, as Lyons' step-brother had murdered Shelton's friend a couple of years earlier, in the Bridgewater Saloon. But nonetheless, the two men were, according to the bartenders working there, who had known both men for decades, good friends, and they were apparently drinking and laughing together for a while, until they started talking about politics.\n\nThey started slapping at each other's hats, apparently playfully. Then Shelton grabbed Lyons' hat and broke the rim, so Lyons then snatched Shelton's hat off his head.\n\nShelton asked for his hat back, and Lyons said he wanted six bits -- seventy-five cents -- for a new hat. Shelton replied that you could buy a box of those hats for six bits, and he wasn't going to give Lyons any money. Lyons refused to hand the hat back until Shelton gave him the money, and Shelton pulled out his gun, and told Lyons to give him the hat. Lyons refused, and Shelton hit him on the head with the gun. He then threatened to kill Lyons if he didn't hand the hat over.\n\nLyons pulled out the knife his friend had given him, and said \"You cock-eyed son of a bitch, I'm going to *make* you kill me\" and came at Shelton, who shot Lyons. Lyons staggered and clutched on to the bar, and dropped the hat. Shelton addressed Lyons using a word I am not going to say, and said \"I told you to give me my hat\", picked it up, and walked out. Lyons died of his wounds a few hours later.\n\n[Excerpt: Fred Waring's Pennsylvanians, \"Stack O' Lee Blues\"]\n\nShelton was arrested, and let go on four thousand dollars bail -- that's something like a hundred and twenty thousand in today's money, to give you some idea, though by the time we go that far back comparisons of the value of money become fairly meaningless.\n\nShelton hired himself the best possible lawyer -- a man named Nat Dryden, who was an alcoholic and opium addict, but was also considered a brilliant trial lawyer. Dryden had been the first lawyer in the whole of Missouri to be able to get a conviction for a white man murdering a black man.\n\nShelton was still at risk, though, simply because of the power of Henry Bridgewater in local politics -- a mob of hundreds of people swamped the inquest trying to get to Shelton, and the police had to draw their weapons before they would disperse. But something happened between Shelton's arrest and the trial that meant that Bridgewater's political power waned somewhat.\n\nShelton was arraigned by Judge David Murphy, who was regarded by most black people in the city as on their side, primarily because he was so against police brutality that when a black man shot a policeman, claiming self defence because the policeman was beating him up at the time, Murphy let the man off. Not only that, when a mob of policemen attacked the defendant outside the court in retribution, Murphy had them jailed.\n\nThis made him popular among black people, but less so among whites.\n\n[Excerpt: Frank Westphal and his Orchestra, \"Stack O'Lee Blues\"]\n\nThe 1896 Republican National Convention was held in St. Louis, and one of the reasons it was chosen was that the white restaurants had promised the party that if they held the convention there, they would allow black people into the restaurants, so the black caucus within the party approved of the idea. But when the convention actually happened, the restaurants changed their minds, and the party did nothing.\n\nThis infuriated many black delegates to the convention, who had seen for years how the system of backhanders and patronage on which American politics ran never got so far as to give anything to black people, who were expected just to vote for the Republicans. James Milton Turner, one of the leaders of the radical faction of the Republicans, and the first ever black US ambassador, who was a Missouri local and one of the most influential black politicians in the state, loudly denounced the Republican party for the way it was treating black voters.\n\nShortly afterwards, the party had its local convention. Judge Murphy was coming up for reelection, and the black delegates voted for him to be the Republican nominee again. The white delegates, on the other hand, voted against him.\n\nThis was the last straw. In 1896, ninety percent of black voters in Missouri voted Democrat, for the first time. Shelton's faction was now in the ascendant.\n\nBecause Murphy wasn't reselected, Shelton's trial wasn't held by him, but Nat Dryden did an excellent job in front of the new judge, arguing that Shelton had been acting in self-defence, because Lyons had pulled out a knife. There was a hung jury, and it went to a retrial.\n\nSadly for Shelton, though, Dryden wasn't going to be representing him in the second trial. Dryden had hidden his alcoholism from his wife, and she had offered him a glass of sherry. That had triggered a relapse, he'd gone on a binge, and died.\n\nAt his next trial, in late 1897, Shelton was convicted, and sentenced to twenty-five years in prison -- presumably the influence of his political friends stopped him from getting the death penalty, just as it got him paroled twelve years later. Two years after that, though, Shelton was arrested again, for assault and robbery, and this time he died in prison.\n\nBut even before his trial -- just before Dryden's death, in fact -- a song called \"Stack-A-Lee\" was mentioned in the papers as being played by a ragtime pianist in Kansas City.\n\nThe story gets a bit hazy here, but we know that Shelton was friends with the ragtime pianist Tom Turpin.\n\nRagtime had become popular in the US as a result of Scott Joplin's performance at the 1893 Chicago World's Fair -- the same fair, incidentally, that introduced the belly dancers known as \"Little Egypt\" who we talked about in the episode on the Coasters a few weeks back. But a year before that, Turpin, who was a friend of Joplin's, had written \"Harlem Rag\", which was published in 1897, and became the first ragtime tune written by a black man to be published:\n\n[Excerpt: Ragtime Dorian Henry, \"Harlem Rag\"]\n\nTurpin was another big man in St. Louis politics, and he was one of those who signed petitions for Shelton's release. While we can't know for sure, it seems likely that the earliest, ragtime, versions of the \"Stagger Lee\" song were written by Turpin. It's been suggested that he based the song on \"Bully of the Town\", a popular song written two years earlier, and itself very loosely based on a real murder case from New Orleans.\n\nThat song was popularised by May Irwin, in a play which is also notable for having a love scene filmed by Edison in 1897, making it possibly the first ever love scene to be filmed. Irwin recorded her version in 1909, but she uses a racial slur, over and over again, which I am not going to allow on this podcast, so here's a 1920s version by Gid Tanner and his Skillet Lickers:\n\n[Excerpt: Gid Tanner and his Skillet Lickers, \"Bully of the Town\"]\n\nThat song, in its original versions, is about someone who goes out and kills a bully -- in the same sense that Billy Lyons was a bully -- and so becomes the biggest bully himself. It's easy to see how Turpin could take that basic framework and add in some details about how his friend had done the same thing, and turn it into a new song.\n\nBy 1910, the song about Stack Lee had spread all across the country. The folklorist and song collector John Lomax collected a version that year that went \"Twas a Christmas morning/The hour was about ten/When Stagalee shot Billy Lyons/And landed in the Jefferson pen/O lordy, poor Stagalee\".\n\nIn 1924, two white songwriters copyrighted a version of it, called \"Stack O'Lee Blues\", and we've heard instrumental versions of that, from 1923 and 24, earlier in this episode -- that's what those instrumental breaks were. Lovie Austin recorded a song called \"Skeg-A-Lee Blues\" in 1924, but that bears little lyrical resemblance to the Stagger Lee we know about:\n\n[Excerpt: Ford & Ford, \"Skeg-A-Lee Blues\"]\n\nThe first vocal recording of the song that we would now recognise as being Stagger Lee was by Ma Rainey, in 1925. In her version, the melody and some of the words come from \"Frankie and Johnny\", another popular song about a real-life murder in St. Louis in the 1890s:\n\n[Excerpt: Ma Rainey, \"Stack O'Lee Blues\"]\n\nAccording to Wikipedia, Louis Armstrong is playing cornet on that song. It doesn't sound like him to me, and I can't find any other evidence for that except other sites which get their information from Wikipedia. Sites I trust more say it was Joe Smith, and they also say that Coleman Hawkins and Fletcher Henderson are on the track.\n\nBy 1927, the song was being recorded in many different variants. Long Cleve Reed and Little Harvey Hull recorded a version that clearly owes something to \"the Bully of the Town\":\n\n[Excerpt: Long Cleve Reed and Little Henry Hull -- Down Home Boys, \"Original Stack O'Lee Blues\"]\n\nAnd in possibly the most famous early version, Mississippi John Hurt asks why the police can't arrest that bad man Stagger Lee:\n\n[Excerpt: Mississippi John Hurt, \"Stack O'Lee (1928 version)\"]\n\nBy this point, all connection with the real Lee Shelton had been lost, and it wouldn't be until the early nineties that the writer Cecil Brown would finally identify Shelton as the subject of the song.\n\nDuring the thirties and forties, the song came to be recorded by all sorts of musicians, almost all of them either folk musicians like Woody Guthrie, blues musicians like Ivory Joe Hunter, or field recordings, like the singer known as \"Bama\" who recorded this for the Lomaxes:\n\n[Excerpt: Bama, \"Stackerlee\"]\n\nNone of these recorded versions was a major hit, but the song became hugely well known, particularly among black musicians around Louisiana. It was a song in everyone's repertoire, and every version of the song followed the same basic structure to start with -- Stagger Lee told Billy Lyons he was going to kill him over a hat that had been lost in a game of craps, Billy begged for his life, saying he had a wife and children, and Stagger Lee killed him anyway. Often the bullet would pass right through Billy and break the bartender's glass.\n\nFrom there, the story might change -- in some versions, Lee would go free -- sometimes because they couldn't catch him and sometimes because crowds of women implored the judge to let him off. In other versions, he would be locked up in jail, and in yet other versions he would be sentenced to death. Sometimes he would survive execution through magical powers, sometimes he would be killed, and crowds of women would mourn him, all dressed in red.\n\nIn the versions where he was killed, he would often descend to Hell, where he would usurp the Devil, because the Devil wasn't as bad as Stagger Lee.\n\nThere were so many versions of this song that the New Orleans pianist Doctor John was, according to some things I've read, able to play \"Stagger Lee\" for three hours straight without repeating a verse.\n\nVery few of these recordings had any commercial success, but one that did was a 1950 New Orleans version of the song, performed by \"Archibald and His Orchestra\":\n\n[Excerpt: Archibald and His Orchestra, \"Stack A'Lee\"]\n\nThat version of the song was the longest ever recorded up to that point, and took up both sides of a seventy-eight record. It was released on Imperial Records, the same label that Fats Domino was on, in 1950, and was recorded at Cosimo Matassa's studio. It went top ten on the Billboard R&B charts, and was Archibald's only hit.\n\nThat's the version that, eight years later, inspired Lloyd Price to record this:\n\n[Excerpt: Lloyd Price, \"Stagger Lee\"]\n\nThat became a massive, massive hit. It went to number one on both the Hot One Hundred and the R&B charts -- which incidentally makes Lloyd Price the earliest solo artist to have a number one hit on the Hot One Hundred and still be alive today. Price's career was revitalised -- and \"Stagger Lee\" was brought properly into the mainstream of American culture.\n\nOver the next few decades, the song -- in versions usually based on Price's -- became a standard among white rock musicians. Indeed, it seems to have been recorded by some of the whitest people in music history, like Huey Lewis and the News:\n\n[Excerpt: Huey Lewis and the News, \"Stagger Lee\"]\n\nMike Love of the Beach Boys:\n\n[Excerpt: Mike Love, \"Stagger Lee\"]\n\nand Neil Diamond:\n\n[Excerpt: Neil Diamond, “Stagger Lee”]\n\nBut while the song had hit the white mainstream, the myth of Stagger Lee had an altogether different power among the black community. You see, up to this point all we've been able to look at are versions of the song that have seen commercial release, and they all represent what was acceptable to be sold in shops at the time.\n\nBut as you may have guessed from the stuff about the Devil I mentioned earlier, Stagger Lee had become a folkloric figure of tremendous importance among many black Americans. He represented the bad man who would never respect any authority -- a trickster figure, but one who was violent as well. He represented the angry black man, but a sort of righteous anger, even if that anger was chaotic. Any black man who was not respected by white society would be thought of as a Stagger Lee figure, at least by some -- I've seen the label applied to everyone from O.J. Simpson to Malcolm X.\n\nBobby Seale, the leader of the Black Panther Party, named his son Malik Nkrumah Stagolee Seale, and was often known to recite a version of \"Stagger Lee\" at parties. In an interview, later, Seale said \"Now I transformed Stagolee, more or less in my own mind, into brothers standing on the block and all of the illegitimate activity. In effect, they were the lumpen proletariat in a high-tech social order, different from how 'lumpen' had been described historically. My point is this; that Malcolm X at one time was an illegitimate hustler. Later in life, Malcolm X grows to have the most profound political consciousness as far as I'm concerned. To me, this brother was really getting ready to move. So symbolically, at one time he was Stagolee.\"\n\nThe version of Stagger Lee that Seale knew is the one that came from something called \"toasts\".\n\nToasting is a form of informal storytelling in black American culture, usually rhyming, and usually using language and talking about subjects that would often be considered obscene. Toasting is now generally considered one of the precursors of rapping, and the style and subject matter are often very similar.\n\nMany of the stories told in toasts are very well known, including the story of the Signifying Monkey (which has been told in bowdlerised forms in many blues songs, including Chuck Berry's \"Jo Jo Gunne\"), and the story of Shine, the black cook on the Titanic, who swims for safety and refuses to help the Captain's daughter even after she offers sex in return for his help. Shine outswims the sharks who try to eat him, and arrives back on land before anyone there even knew the ship was sinking.\n\nShine is, of course, another Stagger Lee style figure.\n\nThese toasts remained largely unknown outside of the less respectable parts of the black community, until the scholar Bruce Jackson published his seminal book \"Get Your Ass in the Water and Swim Like Me: African-American Poetry from Oral Tradition\", whose title is taken from a version of the story of Shine and the Titanic. Jackson's field recordings, mostly recorded in prisons, have more recently been released on CD, though without the names of the performers attached. Here's the version of Stagger Lee he collected -- there will be several beeps in this, and the next few recordings, if you're listening to the regular version of this podcast:\n\n[Excerpt: Unknown field recording, \"Stagger Lee\"]\n\nAfter Jackson's book, but well before the recordings came out, Johnny Otis preserved many of these toasts in musical form on his Snatch and the Poontangs album, including \"The Great Stack-A-Lee\", which clearly has the same sources as the version Jackson recorded:\n\n[Excerpt: Snatch and the Poontangs, \"The Great Stack-A-Lee\"]\n\nThat version was used as the basis for the most well-known recentish version of the song, the 1995 version by Nick Cave and the Bad Seeds:\n\n[Excerpt: Nick Cave and the Bad Seeds, \"Stagger Lee\"]\n\nCave has later said in interviews that they improvised the music and used the lyrics from Jackson's book, but the melody is very, very, close to the Johnny Otis version. And there's more evidence of Cave basing his version on the Johnny Otis track. There's this line:\n\n[Excerpt: Nick Cave and the Bad Seeds, \"Stagger Lee\"]\n\nThat's not in the versions of the toast in Jackson's book, but it *is* in a different song on the Snatch and the Poontangs album, \"Two-Time Slim\":\n\n[Excerpt: Snatch and the Poontangs, \"Two-Time Slim\"]\n\nThis is the Stagger Lee of legend, the Stagger Lee who is the narrator of James Baldwin's great poem \"Stagolee Wonders\", a damning indictment of racist society:\n\n[Excerpt: James Baldwin, reading an excerpt from \"Stagolee Wonders\" on \"Poems for a Listener\",]\n\nBaldwin's view of Stagger Lee was, to quote from the interview from which that reading is also excerpted, \"a black folk hero, a singer essentially, who actually truly comes out of the auction block, by way of the cotton field, into the beginning of the black church. And Stagger Lee's roots are there, and Stagger Lee's often been a preacher. He's one who conveys the real history.”\n\nIt's a far cry from one pimp murdering another on Christmas Day 1895. And it's a mythos that almost everyone listening to Lloyd Price's hit version will have known nothing of.\n\nAs a result of \"Stagger Lee\", Lloyd Price went on to have a successful career, scoring several more hits in 1959 and 1960, including the song for which he's now best known, \"Personality\":\n\n[Excerpt: Lloyd Price, \"Personality\"]\n\nPrice also moved into other areas, including boxing promotion -- he was the person who got Don King, another figure who has often been compared to Stagger Lee, the chance to work with Mohammed Ali, and he later helped King promote the famous \"Rumble in the Jungle\" fight.\n\nLloyd Price is eighty-seven years old, now, and released his most recent album in 2016. He still tours -- indeed, his most recent live show was earlier this month, just before the current coronavirus outbreak meant live shows had to stop. He opened his show, as he always does, with \"Stagger Lee\", and I hope that when we start having live shows again, he will continue to do so for a long, long time.",
  "itunes:subtitle": "Episode seventy-six of&nbsp;A History of Rock Music in Five Hundred Songs&nbsp;looks at Stagger Lee by Lloyd Price, and how a barroom fight 125 years ago led to a song performed by everyone from Ma Rainey to Neil Diamond. Click the full post to read line",
  "itunes:keywords": "Alan Lomax,Cosimo Matassa,folk music,James Baldwin,John Lomax,Johnny Otis,Lloyd Price,Ma Rainey,Mississippi John Hurt,Mohammed Ali,Nick Cave,racism,ragtime,Snatch and the Poontangs,Specialty Records,the blues,toasts",
  "itunes:episodeType": "full",
  "itunes:episode": 76,
  "content:encoded": "Episode seventy-six of&nbsp;<em>A History of Rock Music in Five Hundred Songs</em>&nbsp;looks at \"Stagger Lee\" by Lloyd Price, and how a barroom fight 125 years ago led to a song performed by everyone from Ma Rainey to Neil Diamond. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on&nbsp;<a href=\"https://www.patreon.com/posts/35456421\">\"That Crazy Feeling\" by Kenny Rogers</a>.\n\nI have also beeped out some expletives in the song excerpts this week, so as not to be censored by some podcast aggregators, and so I've uploaded&nbsp;<a href=\"https://www.patreon.com/posts/35456492\">an unbeeped version</a>&nbsp;for backers.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust%20\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-stagger-lee/\">a Mixcloud streaming playlist&nbsp;</a>with full versions of all the songs in the episode.\n\nThe bulk of the information in this episode came from&nbsp;<a href=\"https://amzn.to/2UPh0vq\"><em>Stagolee Shot Billy</em>, by Cecil Brown, the person who finally identified Lee Shelton as the subject of the song.</a>\n\nI also got some information from&nbsp;<a href=\"https://amzn.to/2wOuob5\"><em>Get Your Ass in the Water and Swim Like Me: African-American Narrative Poetry from the Oral Tradition</em></a>&nbsp;by Bruce Jackson,<a href=\"https://amzn.to/3bHN0Ir\">&nbsp;<em>Unprepared to Die</em>&nbsp;by Paul Slade,</a>&nbsp;and&nbsp;<a href=\"https://amzn.to/2UHpfcE\"><em>Yo' Mama!: New Raps, Toasts, Dozens, Jokes and Children's Rhymes from Urban Black America</em></a>&nbsp;edited by&nbsp;Onwuchekwa Jemie.\n\nLloyd Price has written a few books.&nbsp;<a href=\"https://amzn.to/2ShLwvs\">His autobiography</a>&nbsp;is out of print and goes for silly money (and don't buy the \"Kindle edition\" at that link, because it's just the sheet music to the song, which Amazon have mislabelled) but he's also written&nbsp;<a href=\"https://amzn.to/2GCj2LB\">a book of essays</a>&nbsp;with his thoughts on race, some of which shed light on his work.\n\nThe Lloyd Price songs here can be found on&nbsp;<a href=\"https://amzn.to/2Shr7qd\">The Complete Singles As & Bs 1952-62</a>&nbsp;.\n\nAnd you can get the Snatch and the Poontangs album&nbsp;<a href=\"https://amzn.to/39yRDmO\">on a twofer</a>&nbsp;with Johnny Otis' less explicit album&nbsp;<em>Cold Shot.</em>\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">Why not join them</a>?\n\n<strong>Transcript</strong>\n\nBefore we start today's episode, a brief note.\n\nFirstly, this episode contains a description of a murder, so if you're squeamish about that sort of thing, you may want to skip it.\n\nSecondly, some of the material I'm dealing with in this episode is difficult for me to deal with in a podcast, for a variety of reasons. This episode will look at a song whose history is strongly entwined both with American racism and with black underworld culture. The source material I've used for this therefore contains several things that for different reasons are difficult for me to say on here. There is frequent use of a particular racial slur which it is not okay under any circumstances for me as a white man to say; there are transcripts of oral history which are transcribed in rather patronising attempts at replicating African-American Vernacular English, which even were those transcripts themselves acceptable would sound mocking coming out of my English-accented mouth; and there is frequent use of sexual profanity, which I personally have no problem with at all, but would get this podcast an explicit rating on several of the big podcast platforms.\n\nThere is simply no way to tell this story while avoiding all of those things, so I've come up with the best compromise I can. I will not use, even in quotes, that slur. I will minimise the use of transcripts, but when I have to use them, I will change them from being phonetic transcripts of AAVE into being standard written English, and I will include the swearing where it comes in the recordings I want to use but will beep it out of the version that goes up on the main podcast feed. I'll make an unexpurgated version available for my Patreon backers, and I'll put the unbleeped recordings on Mixcloud.\n\nThe story we're going to tell goes back to Christmas Day 1895, but we're going to start our story in the mid 1950s, with Lloyd Price.\n\n[Excerpt: Lloyd Price, “Stagger Lee”]\n\nYou may remember us looking at Lloyd Price way back in episode twelve, from Christmas 2018, but if you don't, Price was a teenager in 1952, when he wandered into Cosimo Matassa's studio in New Orleans, at the invitation of his acquaintance Dave Bartholomew, who had produced, co-written, and arranged most of Fats Domino's biggest hits. Price had a song, \"Lawdy Miss Clawdy\", which was loosely based around the same basic melody as Domino's earlier hit \"The Fat Man\", and they recorded it with Bartholomew producing, Domino on piano, and the great Earl Palmer on drums:\n\n[Excerpt: Lloyd Price, \"Lawdy Miss Clawdy\"]\n\nThat was one of the first R&B records put out on Specialty Records, the label that would later bring Little Richard, Larry Williams, Sam Cooke and others to prominence, and it went to number one on the R&B charts. Price had a couple more big R&B hits, but then he got drafted, and when he got back the musical landscape had changed enough that he had no hits for several years. But then both Elvis Presley and Little Richard cut cover versions of \"Lawdy Miss Clawdy\", and that seemed to bring Price enough extra attention that in 1957 he got a couple of songs into the lower reaches of the Hot One Hundred, and one song, \"Just Because\" went to number three on the R&B charts:\n\n[Excerpt: Lloyd Price, \"Just Because\"]\n\nBut it wasn't until 1958 that Price had what would become his biggest hit, a song that would kickstart his career, and which had its roots in a barroom brawl in St. Louis on Christmas Day 1895:\n\n[Excerpt: Lloyd Price, \"Stagger Lee\"]\n\nThe Lee Line was a line of steamboats that went up and down the Mississippi, run by the Lee family. Their line was notorious, even by Mississippi riverboat standards, for paying its staff badly, but also for being friendly to prostitution and gambling. This meant that some people, at least, enjoyed working on the ships despite the low pay. There is a song, whose lyrics were quoted in an article from 1939, but which seems to have been much older, whose lyrics went (I've changed these into standard English, as I explained at the start):\n\nReason I like the Lee Line trade\n\nSleep all night with the chambermaid\n\nShe gimme some pie, and she gimme some cake\n\nAnd I give her all the money that I ever make\n\nThe Lee Line was one of the two preferred steamboat lines to work on for that reason, and it ended up being mentioned in quite a few songs, like this early version of the song that's better known as \"Alabamy Bound\", but was here called \"Don't You Leave Me Here\":\n\n[Excerpt: Little Harvey Hull and Long Cleve Reed, \"Don't You Leave Me Here\"]\n\nThe line, \"If the boat don't sink and the Stack don't drown\" refers to one of the boats on the Lee Line, the Stack Lee, a boat that started service in 1902. But the boat was named, as many of the Lee Line ships were, after a member of the Lee family, in this case one Stack Lee, who was the captain in the 1880s and early 90s of a ship named after his father, James Lee, the founder of the company.\n\nIn 1948 the scholar Shields McIlwayne claimed that the captain, and later the boat, were popular enough among parts of the black community that there were \"more colored kids named Stack Lee than there were sinners in hell\". But it was probably the boats' reputation for prostitution that led to a thirty-year-old pimp in St. Louis named Lee Shelton taking on the name \"Stack Lee\", at some time before Christmas Day 1895.\n\nOn that Christmas Day, a man named Bill Lyons entered the Bill Curtis Saloon. Before he entered the saloon, he stopped to ask his friend to give him a knife, because the saloon was the roughest in the whole city, and he didn't want any trouble.\n\nBill Lyons was known as \"Billy the Bully\", but bully didn't quite, or didn't only, mean what it means today. A \"bully\", in that time and place, was a term that encompassed both being a pimp and being a bagman for a political party. There was far more overlap in the late nineteenth and early twentieth centuries between politics and organised crime than many now realise, and the way things normally operated in many areas was that there would be a big man in organised crime whose job it would be to raise money for the party, get people out to vote, and tell them which way to vote.\n\nLyons was not a popular man, but he was an influential man, and he was part of a rich family -- one of the richest black families in St. Louis. He was, like his family, very involved with the Republican Party. Almost all black people in the US were Republicans at that time, as it was only thirty years since the end of the Civil War, when the Republican President Lincoln had been credited with freeing black people from slavery, and the Bridgewater Saloon, owned by Lyons' rich brother-in-law Henry Bridgewater, was often used as a meeting place for local Republicans.\n\nLyons had just ordered a drink when Lee Shelton walked into the bar. Shelton was a pimp, and seems to have made a lot of money from it. Shelton was also a Democrat, which in this time and place meant that he was essentially a member of a rival gang.\n\n[Excerpt: Duke Ellington, \"Stack-A-Lee Blues\"]\n\nShelton was very big in the local Democratic party, and from what we can tell was far more popular among the black community than Lyons was. While the Democrats were still the less popular of the two major parties among black people in the area, some were starting to feel like the Republicans talked a good game but were doing very little to actually help black people, and were considering taking their votes elsewhere.\n\nHe was also a pimp who seems to have had a better reputation than most among the sex workers who worked for him, though like almost everything in this story it's difficult to know for certain more than a hundred and twenty years later. When he walked into the bar, he was wearing mirror-toed shoes, a velvet waistcoat, an embroidered shirt, and gold rings, and carrying an ebony cane with a gold top. He had a slightly crossed left eye, and scars on his face. And he was wearing a white Stetson.\n\nLee asked the crowd, \"Who's treating?\" and they pointed to Lyons. There was allegedly some bad blood between Lyons and Shelton, as Lyons' step-brother had murdered Shelton's friend a couple of years earlier, in the Bridgewater Saloon. But nonetheless, the two men were, according to the bartenders working there, who had known both men for decades, good friends, and they were apparently drinking and laughing together for a while, until they started talking about politics.\n\nThey started slapping at each other's hats, apparently playfully. Then Shelton grabbed Lyons' hat and broke the rim, so Lyons then snatched Shelton's hat off his head.\n\nShelton asked for his hat back, and Lyons said he wanted six bits -- seventy-five cents -- for a new hat. Shelton replied that you could buy a box of those hats for six bits, and he wasn't going to give Lyons any money. Lyons refused to hand the hat back until Shelton gave him the money, and Shelton pulled out his gun, and told Lyons to give him the hat. Lyons refused, and Shelton hit him on the head with the gun. He then threatened to kill Lyons if he didn't hand the hat over.\n\nLyons pulled out the knife his friend had given him, and said \"You cock-eyed son of a bitch, I'm going to *make* you kill me\" and came at Shelton, who shot Lyons. Lyons staggered and clutched on to the bar, and dropped the hat. Shelton addressed Lyons using a word I am not going to say, and said \"I told you to give me my hat\", picked it up, and walked out. Lyons died of his wounds a few hours later.\n\n[Excerpt: Fred Waring's Pennsylvanians, \"Stack O' Lee Blues\"]\n\nShelton was arrested, and let go on four thousand dollars bail -- that's something like a hundred and twenty thousand in today's money, to give you some idea, though by the time we go that far back comparisons of the value of money become fairly meaningless.\n\nShelton hired himself the best possible lawyer -- a man named Nat Dryden, who was an alcoholic and opium addict, but was also considered a brilliant trial lawyer. Dryden had been the first lawyer in the whole of Missouri to be able to get a conviction for a white man murdering a black man.\n\nShelton was still at risk, though, simply because of the power of Henry Bridgewater in local politics -- a mob of hundreds of people swamped the inquest trying to get to Shelton, and the police had to draw their weapons before they would disperse. But something happened between Shelton's arrest and the trial that meant that Bridgewater's political power waned somewhat.\n\nShelton was arraigned by Judge David Murphy, who was regarded by most black people in the city as on their side, primarily because he was so against police brutality that when a black man shot a policeman, claiming self defence because the policeman was beating him up at the time, Murphy let the man off. Not only that, when a mob of policemen attacked the defendant outside the court in retribution, Murphy had them jailed.\n\nThis made him popular among black people, but less so among whites.\n\n[Excerpt: Frank Westphal and his Orchestra, \"Stack O'Lee Blues\"]\n\nThe 1896 Republican National Convention was held in St. Louis, and one of the reasons it was chosen was that the white restaurants had promised the party that if they held the convention there, they would allow black people into the restaurants, so the black caucus within the party approved of the idea. But when the convention actually happened, the restaurants changed their minds, and the party did nothing.\n\nThis infuriated many black delegates to the convention, who had seen for years how the system of backhanders and patronage on which American politics ran never got so far as to give anything to black people, who were expected just to vote for the Republicans. James Milton Turner, one of the leaders of the radical faction of the Republicans, and the first ever black US ambassador, who was a Missouri local and one of the most influential black politicians in the state, loudly denounced the Republican party for the way it was treating black voters.\n\nShortly afterwards, the party had its local convention. Judge Murphy was coming up for reelection, and the black delegates voted for him to be the Republican nominee again. The white delegates, on the other hand, voted against him.\n\nThis was the last straw. In 1896, ninety percent of black voters in Missouri voted Democrat, for the first time. Shelton's faction was now in the ascendant.\n\nBecause Murphy wasn't reselected, Shelton's trial wasn't held by him, but Nat Dryden did an excellent job in front of the new judge, arguing that Shelton had been acting in self-defence, because Lyons had pulled out a knife. There was a hung jury, and it went to a retrial.\n\nSadly for Shelton, though, Dryden wasn't going to be representing him in the second trial. Dryden had hidden his alcoholism from his wife, and she had offered him a glass of sherry. That had triggered a relapse, he'd gone on a binge, and died.\n\nAt his next trial, in late 1897, Shelton was convicted, and sentenced to twenty-five years in prison -- presumably the influence of his political friends stopped him from getting the death penalty, just as it got him paroled twelve years later. Two years after that, though, Shelton was arrested again, for assault and robbery, and this time he died in prison.\n\nBut even before his trial -- just before Dryden's death, in fact -- a song called \"Stack-A-Lee\" was mentioned in the papers as being played by a ragtime pianist in Kansas City.\n\nThe story gets a bit hazy here, but we know that Shelton was friends with the ragtime pianist Tom Turpin.\n\nRagtime had become popular in the US as a result of Scott Joplin's performance at the 1893 Chicago World's Fair -- the same fair, incidentally, that introduced the belly dancers known as \"Little Egypt\" who we talked about in the episode on the Coasters a few weeks back. But a year before that, Turpin, who was a friend of Joplin's, had written \"Harlem Rag\", which was published in 1897, and became the first ragtime tune written by a black man to be published:\n\n[Excerpt: Ragtime Dorian Henry, \"Harlem Rag\"]\n\nTurpin was another big man in St. Louis politics, and he was one of those who signed petitions for Shelton's release. While we can't know for sure, it seems likely that the earliest, ragtime, versions of the \"Stagger Lee\" song were written by Turpin. It's been suggested that he based the song on \"Bully of the Town\", a popular song written two years earlier, and itself very loosely based on a real murder case from New Orleans.\n\nThat song was popularised by May Irwin, in a play which is also notable for having a love scene filmed by Edison in 1897, making it possibly the first ever love scene to be filmed. Irwin recorded her version in 1909, but she uses a racial slur, over and over again, which I am not going to allow on this podcast, so here's a 1920s version by Gid Tanner and his Skillet Lickers:\n\n[Excerpt: Gid Tanner and his Skillet Lickers, \"Bully of the Town\"]\n\nThat song, in its original versions, is about someone who goes out and kills a bully -- in the same sense that Billy Lyons was a bully -- and so becomes the biggest bully himself. It's easy to see how Turpin could take that basic framework and add in some details about how his friend had done the same thing, and turn it into a new song.\n\nBy 1910, the song about Stack Lee had spread all across the country. The folklorist and song collector John Lomax collected a version that year that went \"Twas a Christmas morning/The hour was about ten/When Stagalee shot Billy Lyons/And landed in the Jefferson pen/O lordy, poor Stagalee\".\n\nIn 1924, two white songwriters copyrighted a version of it, called \"Stack O'Lee Blues\", and we've heard instrumental versions of that, from 1923 and 24, earlier in this episode -- that's what those instrumental breaks were. Lovie Austin recorded a song called \"Skeg-A-Lee Blues\" in 1924, but that bears little lyrical resemblance to the Stagger Lee we know about:\n\n[Excerpt: Ford & Ford, \"Skeg-A-Lee Blues\"]\n\nThe first vocal recording of the song that we would now recognise as being Stagger Lee was by Ma Rainey, in 1925. In her version, the melody and some of the words come from \"Frankie and Johnny\", another popular song about a real-life murder in St. Louis in the 1890s:\n\n[Excerpt: Ma Rainey, \"Stack O'Lee Blues\"]\n\nAccording to Wikipedia, Louis Armstrong is playing cornet on that song. It doesn't sound like him to me, and I can't find any other evidence for that except other sites which get their information from Wikipedia. Sites I trust more say it was Joe Smith, and they also say that Coleman Hawkins and Fletcher Henderson are on the track.\n\nBy 1927, the song was being recorded in many different variants. Long Cleve Reed and Little Harvey Hull recorded a version that clearly owes something to \"the Bully of the Town\":\n\n[Excerpt: Long Cleve Reed and Little Henry Hull -- Down Home Boys, \"Original Stack O'Lee Blues\"]\n\nAnd in possibly the most famous early version, Mississippi John Hurt asks why the police can't arrest that bad man Stagger Lee:\n\n[Excerpt: Mississippi John Hurt, \"Stack O'Lee (1928 version)\"]\n\nBy this point, all connection with the real Lee Shelton had been lost, and it wouldn't be until the early nineties that the writer Cecil Brown would finally identify Shelton as the subject of the song.\n\nDuring the thirties and forties, the song came to be recorded by all sorts of musicians, almost all of them either folk musicians like Woody Guthrie, blues musicians like Ivory Joe Hunter, or field recordings, like the singer known as \"Bama\" who recorded this for the Lomaxes:\n\n[Excerpt: Bama, \"Stackerlee\"]\n\nNone of these recorded versions was a major hit, but the song became hugely well known, particularly among black musicians around Louisiana. It was a song in everyone's repertoire, and every version of the song followed the same basic structure to start with -- Stagger Lee told Billy Lyons he was going to kill him over a hat that had been lost in a game of craps, Billy begged for his life, saying he had a wife and children, and Stagger Lee killed him anyway. Often the bullet would pass right through Billy and break the bartender's glass.\n\nFrom there, the story might change -- in some versions, Lee would go free -- sometimes because they couldn't catch him and sometimes because crowds of women implored the judge to let him off. In other versions, he would be locked up in jail, and in yet other versions he would be sentenced to death. Sometimes he would survive execution through magical powers, sometimes he would be killed, and crowds of women would mourn him, all dressed in red.\n\nIn the versions where he was killed, he would often descend to Hell, where he would usurp the Devil, because the Devil wasn't as bad as Stagger Lee.\n\nThere were so many versions of this song that the New Orleans pianist Doctor John was, according to some things I've read, able to play \"Stagger Lee\" for three hours straight without repeating a verse.\n\nVery few of these recordings had any commercial success, but one that did was a 1950 New Orleans version of the song, performed by \"Archibald and His Orchestra\":\n\n[Excerpt: Archibald and His Orchestra, \"Stack A'Lee\"]\n\nThat version of the song was the longest ever recorded up to that point, and took up both sides of a seventy-eight record. It was released on Imperial Records, the same label that Fats Domino was on, in 1950, and was recorded at Cosimo Matassa's studio. It went top ten on the Billboard R&B charts, and was Archibald's only hit.\n\nThat's the version that, eight years later, inspired Lloyd Price to record this:\n\n[Excerpt: Lloyd Price, \"Stagger Lee\"]\n\nThat became a massive, massive hit. It went to number one on both the Hot One Hundred and the R&B charts -- which incidentally makes Lloyd Price the earliest solo artist to have a number one hit on the Hot One Hundred and still be alive today. Price's career was revitalised -- and \"Stagger Lee\" was brought properly into the mainstream of American culture.\n\nOver the next few decades, the song -- in versions usually based on Price's -- became a standard among white rock musicians. Indeed, it seems to have been recorded by some of the whitest people in music history, like Huey Lewis and the News:\n\n[Excerpt: Huey Lewis and the News, \"Stagger Lee\"]\n\nMike Love of the Beach Boys:\n\n[Excerpt: Mike Love, \"Stagger Lee\"]\n\nand Neil Diamond:\n\n[Excerpt: Neil Diamond, “Stagger Lee”]\n\nBut while the song had hit the white mainstream, the myth of Stagger Lee had an altogether different power among the black community. You see, up to this point all we've been able to look at are versions of the song that have seen commercial release, and they all represent what was acceptable to be sold in shops at the time.\n\nBut as you may have guessed from the stuff about the Devil I mentioned earlier, Stagger Lee had become a folkloric figure of tremendous importance among many black Americans. He represented the bad man who would never respect any authority -- a trickster figure, but one who was violent as well. He represented the angry black man, but a sort of righteous anger, even if that anger was chaotic. Any black man who was not respected by white society would be thought of as a Stagger Lee figure, at least by some -- I've seen the label applied to everyone from O.J. Simpson to Malcolm X.\n\nBobby Seale, the leader of the Black Panther Party, named his son Malik Nkrumah Stagolee Seale, and was often known to recite a version of \"Stagger Lee\" at parties. In an interview, later, Seale said \"Now I transformed Stagolee, more or less in my own mind, into brothers standing on the block and all of the illegitimate activity. In effect, they were the lumpen proletariat in a high-tech social order, different from how 'lumpen' had been described historically. My point is this; that Malcolm X at one time was an illegitimate hustler. Later in life, Malcolm X grows to have the most profound political consciousness as far as I'm concerned. To me, this brother was really getting ready to move. So symbolically, at one time he was Stagolee.\"\n\nThe version of Stagger Lee that Seale knew is the one that came from something called \"toasts\".\n\nToasting is a form of informal storytelling in black American culture, usually rhyming, and usually using language and talking about subjects that would often be considered obscene. Toasting is now generally considered one of the precursors of rapping, and the style and subject matter are often very similar.\n\nMany of the stories told in toasts are very well known, including the story of the Signifying Monkey (which has been told in bowdlerised forms in many blues songs, including Chuck Berry's \"Jo Jo Gunne\"), and the story of Shine, the black cook on the Titanic, who swims for safety and refuses to help the Captain's daughter even after she offers sex in return for his help. Shine outswims the sharks who try to eat him, and arrives back on land before anyone there even knew the ship was sinking.\n\nShine is, of course, another Stagger Lee style figure.\n\nThese toasts remained largely unknown outside of the less respectable parts of the black community, until the scholar Bruce Jackson published his seminal book \"Get Your Ass in the Water and Swim Like Me: African-American Poetry from Oral Tradition\", whose title is taken from a version of the story of Shine and the Titanic. Jackson's field recordings, mostly recorded in prisons, have more recently been released on CD, though without the names of the performers attached. Here's the version of Stagger Lee he collected -- there will be several beeps in this, and the next few recordings, if you're listening to the regular version of this podcast:\n\n[Excerpt: Unknown field recording, \"Stagger Lee\"]\n\nAfter Jackson's book, but well before the recordings came out, Johnny Otis preserved many of these toasts in musical form on his Snatch and the Poontangs album, including \"The Great Stack-A-Lee\", which clearly has the same sources as the version Jackson recorded:\n\n[Excerpt: Snatch and the Poontangs, \"The Great Stack-A-Lee\"]\n\nThat version was used as the basis for the most well-known recentish version of the song, the 1995 version by Nick Cave and the Bad Seeds:\n\n[Excerpt: Nick Cave and the Bad Seeds, \"Stagger Lee\"]\n\nCave has later said in interviews that they improvised the music and used the lyrics from Jackson's book, but the melody is very, very, close to the Johnny Otis version. And there's more evidence of Cave basing his version on the Johnny Otis track. There's this line:\n\n[Excerpt: Nick Cave and the Bad Seeds, \"Stagger Lee\"]\n\nThat's not in the versions of the toast in Jackson's book, but it *is* in a different song on the Snatch and the Poontangs album, \"Two-Time Slim\":\n\n[Excerpt: Snatch and the Poontangs, \"Two-Time Slim\"]\n\nThis is the Stagger Lee of legend, the Stagger Lee who is the narrator of James Baldwin's great poem \"Stagolee Wonders\", a damning indictment of racist society:\n\n[Excerpt: James Baldwin, reading an excerpt from \"Stagolee Wonders\" on \"Poems for a Listener\",]\n\nBaldwin's view of Stagger Lee was, to quote from the interview from which that reading is also excerpted, \"a black folk hero, a singer essentially, who actually truly comes out of the auction block, by way of the cotton field, into the beginning of the black church. And Stagger Lee's roots are there, and Stagger Lee's often been a preacher. He's one who conveys the real history.”\n\nIt's a far cry from one pimp murdering another on Christmas Day 1895. And it's a mythos that almost everyone listening to Lloyd Price's hit version will have known nothing of.\n\nAs a result of \"Stagger Lee\", Lloyd Price went on to have a successful career, scoring several more hits in 1959 and 1960, including the song for which he's now best known, \"Personality\":\n\n[Excerpt: Lloyd Price, \"Personality\"]\n\nPrice also moved into other areas, including boxing promotion -- he was the person who got Don King, another figure who has often been compared to Stagger Lee, the chance to work with Mohammed Ali, and he later helped King promote the famous \"Rumble in the Jungle\" fight.\n\nLloyd Price is eighty-seven years old, now, and released his most recent album in 2016. He still tours -- indeed, his most recent live show was earlier this month, just before the current coronavirus outbreak meant live shows had to stop. He opened his show, as he always does, with \"Stagger Lee\", and I hope that when we start having live shows again, he will continue to do so for a long, long time.",
  "enclosure": "",
  "itunes:summary": "Episode seventy-six of&nbsp;A History of Rock Music in Five Hundred Songs&nbsp;looks at \"Stagger Lee\" by Lloyd Price, and how a barroom fight 125 years ago led to a song performed by everyone from Ma Rainey to Neil Diamond. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on&nbsp;\"That Crazy Feeling\" by Kenny Rogers.\n\nI have also beeped out some expletives in the song excerpts this week, so as not to be censored by some podcast aggregators, and so I've uploaded&nbsp;an unbeeped version&nbsp;for backers.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created&nbsp;a Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nThe bulk of the information in this episode came from&nbsp;Stagolee Shot Billy, by Cecil Brown, the person who finally identified Lee Shelton as the subject of the song.\n\nI also got some information from&nbsp;Get Your Ass in the Water and Swim Like Me: African-American Narrative Poetry from the Oral Tradition&nbsp;by Bruce Jackson,&nbsp;Unprepared to Die&nbsp;by Paul Slade,&nbsp;and&nbsp;Yo' Mama!: New Raps, Toasts, Dozens, Jokes and Children's Rhymes from Urban Black America&nbsp;edited by&nbsp;Onwuchekwa Jemie.\n\nLloyd Price has written a few books.&nbsp;His autobiography&nbsp;is out of print and goes for silly money (and don't buy the \"Kindle edition\" at that link, because it's just the sheet music to the song, which Amazon have mislabelled) but he's also written&nbsp;a book of essays&nbsp;with his thoughts on race, some of which shed light on his work.\n\nThe Lloyd Price songs here can be found on&nbsp;The Complete Singles As & Bs 1952-62&nbsp;.\n\nAnd you can get the Snatch and the Poontangs album&nbsp;on a twofer&nbsp;with Johnny Otis' less explicit album&nbsp;Cold Shot.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;Why not join them?\n\nTranscript\n\nBefore we start today's episode, a brief note.\n\nFirstly, this episode contains a description of a murder, so if you're squeamish about that sort of thing, you may want to skip it.\n\nSecondly, some of the material I'm dealing with in this episode is difficult for me to deal with in a podcast, for a variety of reasons. This episode will look at a song whose history is strongly entwined both with American racism and with black underworld culture. The source material I've used for this therefore contains several things that for different reasons are difficult for me to say on here. There is frequent use of a particular racial slur which it is not okay under any circumstances for me as a white man to say; there are transcripts of oral history which are transcribed in rather patronising attempts at replicating African-American Vernacular English, which even were those transcripts themselves acceptable would sound mocking coming out of my English-accented mouth; and there is frequent use of sexual profanity, which I personally have no problem with at all, but would get this podcast an explicit rating on several of the big podcast platforms.\n\nThere is simply no way to tell this story while avoiding all of those things, so I've come up with the best compromise I can. I will not use, even in quotes, that slur. I will minimise the use of transcripts, but when I have to use them, I will change them from being phonetic transcripts of AAVE into being standard written English, and I will include the swearing where it comes in the recordings I want to use but will beep it out of the version that goes up on the main podcast feed. I'll make an unexpurgated version available for my Patreon backers, and I'll put the unbleeped recordings on Mixcloud.\n\nThe story we're going to tell g",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode seventy-six of&nbsp;A History of Rock Music in Five Hundred Songs&nbsp;looks at \"Stagger Lee\" by Lloyd Price, and how a barroom fight 125 years ago led to a song performed by everyone from Ma Rainey to Neil Diamond. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on&nbsp;\"That Crazy Feeling\" by Kenny Rogers.\n\nI have also beeped out some expletives in the song excerpts this week, so as not to be censored by some podcast aggregators, and so I've uploaded&nbsp;an unbeeped version&nbsp;for backers.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created&nbsp;a Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nThe bu",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}