{
  "title": "UN Security Council votes against probe into US biolabs",
  "link": "https://www.rt.com/news/565850-un-rejects-biolab-probe/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565850-un-rejects-biolab-probe/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63636f042030276fde3150fb.jpg\" /> The UN Security Council has rejected a resolution to investigate US biological laboratories in Ukraine <br/><a href=\"https://www.rt.com/news/565850-un-rejects-biolab-probe/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The US, France, and Britain shut down Russia’s call to investigate “military-biological” activities in Ukraine</strong></p>\n            \n                        \n            <p>The UN Security Council has rejected Russia&rsquo;s call for an international investigation into claims that the US used laboratories in Ukraine to develop biological weapons.</p>\n<p>While China backed Russia&rsquo;s proposal, the US, Britain, and France voted against it, and the ten rotating council members abstained.</p>\n<p>Russia insists that the US and Ukraine have been violating the 1972 international convention that bans the development, production, and stockpiling of biological weapons. According to Moscow, several laboratories in Ukraine were working on a secret <em>&ldquo;military-biological&rdquo;</em> program, which involved studies and the stockpiling of samples of anthrax, cholera, and other infectious diseases.</p>\n<p>Washington and Kiev both deny developing biological weapons. Ukrainian President Vladimir Zelensky said in March that the laboratories were conducting <em>&ldquo;ordinary scientific research.&rdquo;</em></p>\n<p></p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6362ba5485f5404eeb7b61b6.jpg\" alt=\"FILE PHOTO: A Yars mobile intercontinental ballistic missile launcher drives along Red Square in Moscow during the military parade.\" />\n            <figcaption><a href=\"https://www.rt.com/russia/565834-foreign-ministry-nuclear-statement/\">Russia issues call to other nuclear powers</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>During the vote in the Security Council on Wednesday, US envoy, Linda Thomas-Greenfield, argued that the Russian proposal for a probe is &ldquo;<em>based on disinformation, dishonesty, bad faith, and a total lack of respect for this body</em>.&rdquo;</p>\n<p>Thomas-Greenfield reiterated that the activities under the Pentagon&rsquo;s Cooperative Threat Reduction (CTR) program in Ukraine and other former Soviet states <em>&ldquo;are not for military purposes.&rdquo; </em></p>\n<p>The US Mission to International Organizations in Geneva, Switzerland said in April that the CTR&rsquo;s goal in Ukraine was to help the country<em> &ldquo;consolidate and secure pathogens and to continue to ensure Ukraine can detect and report disease outbreaks before they pose security or stability threats.&rdquo; </em></p>\n<p>Dmitry Polyansky, Russia&rsquo;s deputy envoy to the UN, meanwhile, said he was <em>&ldquo;deeply disappointed&rdquo;</em> by the vote. He said <em>&ldquo;the Western countries are simply afraid&rdquo;</em> of an international investigation into the issue.</p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 07:44:14 +0000",
  "dc:creator": "RT"
}