{
  "title": "Modeling Thermal Management Systems for Electronics",
  "link": "https://event.on24.com/wcc/r/3959064/F4D5B0E14D03698DE8F5FB556899D62C",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/image.png?id=26851526&width=980\"/><br/><br/><p>\n\tThe ability to dissipate heat is one of the most important features of modern electronic devices and is usually a limiting factor in the miniaturization of these devices.\n</p>\n<p>\n<span></span>COMSOL Multiphysics includes functionality for heat transfer through conduction, convection, and radiation. Its ability to treat conjugate heat transfer, including laminar and turbulent flow as well as surface-to-surface radiation, has proven to be of great importance for the design and optimization of thermal management systems in electronics. Its multiphysics modeling capabilities also enable the study of thermoelectric effects as well as thermal–structural effects, such as thermal expansion.<u></u><u></u>\n</p>\n<p>\n\tIn this webinar, we will demonstrate how to create models and apps for conjugate heat transfer in electronic devices. We will also give a general overview of the software’s capabilities for multiphysics modeling, including heat transfer as one of the modeled phenomena.\n</p>\n<p>\n<a href=\"https://event.on24.com/wcc/r/3959064/F4D5B0E14D03698DE8F5FB556899D62C\" target=\"_blank\">Register now for this free webinar!</a>\n</p>\n<hr/>\n<p>\n\tSpeaker<br/>\n</p>\n<p>\n<span></span><span style=\"background-color: initial;\"><strong>Mranal Jain<br/>\n</strong></span>Senior Applications Engineer, COMSOL<br/>\n\tMranal Jain has been with COMSOL since 2013 and currently leads the transport team in the Burlington, MA office. He studied microfluidics and electrokinetic transport, while pursuing his PhD in chemical engineering at the University of Alberta, Edmonton.\n</p>",
  "pubDate": "Mon, 03 Oct 2022 12:00:00 +0000",
  "guid": "https://event.on24.com/wcc/r/3959064/F4D5B0E14D03698DE8F5FB556899D62C",
  "category": [
    "Comsol",
    "Multiphysics",
    "Simulation",
    "Thermal management",
    "Type:webinar"
  ],
  "dc:creator": "COMSOL",
  "media:content": ""
}