{
  "title": "The Fifth Catalogue of Nearby Stars (CNS5). (arXiv:2211.01449v1 [astro-ph.SR])",
  "link": "http://arxiv.org/abs/2211.01449",
  "description": "<p>We present the compilation of the Fifth Catalogue of Nearby Stars (CNS5),\nbased on astrometric and photometric data from Gaia EDR3 and Hipparcos, and\nsupplemented with parallaxes from ground-based astrometric surveys carried out\nin the infrared.\n</p>\n<p>The aim of the CNS5 is to provide the most complete sample of objects in the\nsolar neighbourhood. For all known stars and brown dwarfs in the 25 pc sphere\naround the Sun, basic astrometric and photometric parameters are given.\nFurthermore, we provide the colour-magnitude diagram and various luminosity\nfunctions of the stellar content in the solar neighbourhood, and characterise\nthe completeness of the CNS5 catalogue.\n</p>\n<p>We compile a sample of stars and brown dwarfs which most likely are located\nwithin 25 pc of the Sun, taking space-based parallaxes from Gaia EDR3 and\nHipparcos as well as ground-based parallaxes from Best et al. (2021),\nKirkpatrick et al. (2021), and from the CNS4 into account. We develop a set of\nselection criteria to clean the sample from spurious sources. Furthermore, we\nshow that effects of blending in the Gaia photometry, which affect mainly the\nfaint and red sources in Gaia, can be mitigated, to reliably place those\nobjects in a colour-magnitude diagram. We also assess the completeness of the\nCNS5 using a Kolmogorov-Smirnov test and derive observational optical and\nmid-infrared luminosity functions for the main-sequence stars and white dwarfs\nin the solar neighbourhood. The CNS5 contains 5931 objects, including 5230\nstars (4946 main-sequence stars, 20 red giants and 264 white dwarfs) and 701\nbrown dwarfs.\n</p>\n<p>We find that the CNS5 catalogue is statistically complete down to 19.7 mag in\nG-band and 11.8 mag in W1-band absolute magnitudes, corresponding to a spectral\ntype of L8.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Golovin_A/0/1/0/all/0/1\">Alex Golovin</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Reffert_S/0/1/0/all/0/1\">Sabine Reffert</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Just_A/0/1/0/all/0/1\">Andreas Just</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Jordan_S/0/1/0/all/0/1\">Stefan Jordan</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Vani_A/0/1/0/all/0/1\">Akash Vani</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Jahreiss_H/0/1/0/all/0/1\">Hartmut Jahrei&#xdf;</a>"
}