{
  "title": "Real-space imaging of polar and elastic nano-textures in thin films via inversion of diffraction data. (arXiv:2211.01506v1 [cond-mat.mtrl-sci])",
  "link": "http://arxiv.org/abs/2211.01506",
  "description": "<p>Exploiting the emerging nanoscale periodicities in epitaxial, single-crystal\nthin films is an exciting direction in quantum materials science: confinement\nand periodic distortions induce novel properties. The structural motifs of\ninterest are ferroelastic, ferroelectric, multiferroic, and, more recently,\ntopologically protected magnetization and polarization textures. A critical\nstep towards heterostructure engineering is understanding their nanoscale\nstructure, best achieved through real-space imaging. X-ray Bragg coherent\ndiffractive imaging visualizes sub-picometer crystalline displacements with\ntens of nanometers spatial resolution. Yet, it is limited to objects spatially\nconfined in all three dimensions and requires highly coherent, laser-like\nx-rays. Here we lift the confinement restriction by developing real-space\nimaging of periodic lattice distortions: we combine an iterative phase\nretrieval algorithm with unsupervised machine learning to invert the diffuse\nscattering in conventional x-ray reciprocal-space mapping into real-space\nimages of polar and elastic textures in thin epitaxial films. We first\ndemonstrate our imaging in PbTiO3/SrTiO3 superlattices to be consistent with\npublished phase-field model calculations. We then visualize strain-induced\nferroelastic domains emerging during the metal-insulator transition in Ca2RuO4\nthin films. Instead of homogeneously transforming into a low-temperature\nstructure (like in bulk), the strained Mott insulator splits into nanodomains\nwith alternating lattice constants, as confirmed by cryogenic scanning\ntransmission electron microscopy. Our study reveals the type, size,\norientation, and crystal displacement field of the nano-textures. The\nnon-destructive imaging of textures promises to improve models for their\ndynamics and enable advances in quantum materials and microelectronics.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cond-mat/1/au:+Shao_Z/0/1/0/all/0/1\">Ziming Shao</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Schnitzer_N/0/1/0/all/0/1\">Noah Schnitzer</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Ruf_J/0/1/0/all/0/1\">Jacob Ruf</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Gorobtsov_O/0/1/0/all/0/1\">Oleg Y. Gorobtsov</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Dai_C/0/1/0/all/0/1\">Cheng Dai</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Goodge_B/0/1/0/all/0/1\">Berit H. Goodge</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Yang_T/0/1/0/all/0/1\">Tiannan Yang</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Nair_H/0/1/0/all/0/1\">Hari Nair</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Stoica_V/0/1/0/all/0/1\">Vlad A. Stoica</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Freeland_J/0/1/0/all/0/1\">John W. Freeland</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Ruff_J/0/1/0/all/0/1\">Jacob Ruff</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Chen_L/0/1/0/all/0/1\">Long-Qing Chen</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Schlom_D/0/1/0/all/0/1\">Darrell G. Schlom</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Shen_K/0/1/0/all/0/1\">Kyle M. Shen</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Kourkoutis_L/0/1/0/all/0/1\">Lena F. Kourkoutis</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Singer_A/0/1/0/all/0/1\">Andrej Singer</a>"
}