{
  "title": "The role of prior information and computational power in Machine Learning. (arXiv:2211.01972v1 [cs.LG])",
  "link": "http://arxiv.org/abs/2211.01972",
  "description": "<p>Science consists on conceiving hypotheses, confronting them with empirical\nevidence, and keeping only hypotheses which have not yet been falsified. Under\ndeductive reasoning they are conceived in view of a theory and confronted with\nempirical evidence in an attempt to falsify it, and under inductive reasoning\nthey are conceived based on observation, confronted with empirical evidence and\na theory is established based on the not falsified hypotheses. When the\nhypotheses testing can be performed with quantitative data, the confrontation\ncan be achieved with Machine Learning methods, whose quality is highly\ndependent on the hypotheses' complexity, hence on the proper insertion of prior\ninformation into the set of hypotheses seeking to decrease its complexity\nwithout loosing good hypotheses. However, Machine Learning tools have been\napplied under the pragmatic view of instrumentalism, which is concerned only\nwith the performance of the methods and not with the understanding of their\nbehavior, leading to methods which are not fully understood. In this context,\nwe discuss how prior information and computational power can be employed to\nsolve a learning problem, but while prior information and a careful design of\nthe hypotheses space has as advantage the interpretability of the results,\nemploying high computational power has the advantage of a higher performance.\nWe discuss why learning methods which combine both should work better from an\nunderstanding and performance perspective, arguing in favor of basic\ntheoretical research on Machine Learning, in special about how properties of\nclassifiers may be identified in parameters of modern learning models.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Marcondes_D/0/1/0/all/0/1\">Diego Marcondes</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Simonis_A/0/1/0/all/0/1\">Adilson Simonis</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Barrera_J/0/1/0/all/0/1\">Junior Barrera</a>"
}