{
  "title": "Square Peg closes new US$550M fund",
  "link": "https://e27.co/square-peg-closes-fifth-fund-at-us550m-20221026/",
  "dc:creator": "Sainul",
  "pubDate": "Wed, 26 Oct 2022 08:20:45 +0000",
  "category": [
    "Investments",
    "News",
    "Singapore",
    "Airwallex",
    "Kula",
    "Square Peg",
    "Supabase"
  ],
  "guid": "https://e27.co/?p=474965",
  "description": "<p>Square Peg, a global investment firm with an office in Singapore, has announced the close of its fifth fund at US$550 million. The investors include high-performing Australian superannuation funds (such as Hostplus and AustralianSuper), family offices, institutions and endowments. The Square Peg team is also a significant investor in its funds. The fresh capital will [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/square-peg-closes-fifth-fund-at-us550m-20221026/\">Square Peg closes new US$550M fund</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<div id=\"attachment_474985\" style=\"width: 700px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-474985\" loading=\"lazy\" class=\"size-full wp-image-474985\" src=\"https://e27.co/wp-content/uploads/2022/10/Square_Peg_fund_V_news.png\" alt=\"\" width=\"690\" height=\"388\" /><p id=\"caption-attachment-474985\" class=\"wp-caption-text\">(L-R) Square Peg Singapore Partner Piruze Sabuncu and Tushar Roy</p></div>\n<p>Square Peg, a global investment firm with an office in Singapore, has announced the close of its fifth fund at US$550 million.</p>\n<p>The investors include high-performing Australian superannuation funds (such as Hostplus and AustralianSuper), family offices, institutions and endowments. The Square Peg team is also a significant investor in its funds.</p>\n<p>The fresh capital will be deployed across two strategies: its core venture fund will invest in companies from seed to Series B, and the Opportunities Fund will typically invest in later-stage rounds of its emerging portfolio companies.</p>\n<p>The fifth fund has already made follow-on investments in Kula, Supabase, and Airwallex.</p>\n<p>The VC firm will continue to invest in consumer internet, fintech, edutech, future of work, healthtech, and SaaS in Southeast Asia, Australia, and Israel.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/how-iprice-navigates-the-seven-seas-20221025/\">How iPrice Group navigates the seven SEAs</a></strong></p>\n<p>Since its launch, Square Peg has backed more than 60 companies across the three markets. Its portfolio companies also include SaaS firm LottieFiles, digital health platform Doctor Anywhere, and digital credit provider FinAccel (all in Southeast Asia); Canva and ROKT (in Australia); and Fiverr and AIDoc (Israel).</p>\n<p>The company claims its fifth generation fund takes total capital commitments to over US$1.6 billion since its founding ten years ago. Over the past decade, it has returned substantial capital back to its investors of over US$580 million across 11 exits at an IRR of 42 per cent.</p>\n<p>Square Peg has a permanent presence in Singapore, with two Partners Tushar Roy and Piruze Sabuncu, managing investments in the region.</p>\n<p>&#8212;</p>\n<p><span >Echelon 2022 aims to provide intimate and focused discussions on key topics and business matching services to facilitate business-driven connections during the two-day event. </span><strong><span >e27 </span></strong><span >will curate and invite key stakeholders of startups, investors, corporates, and ecosystem enablers to drive towards fruitful business outcomes at Echelon. </span></p>\n<p><span >Here’s the full list of the <a rel=\"follow\" href=\"https://e27.co/echelon/asia/agenda/\" rel=\"follow\">speakers for the 2022 edition</a>, which will be co-located with SWITCH at Resorts World Sentosa from 27 to 28 October 2022. </span><a class=\"editor-rtfLink\" rel=\"follow\" href=\"https://e27.co/echelon/asia/\" target=\"_blank\" rel=\"follow noopener\"><span >Learn more here</span></a><span >. </span></p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/square-peg-closes-fifth-fund-at-us550m-20221026/\">Square Peg closes new US$550M fund</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}