{
  "title": "Can the Artemis Moon Mission Revive the Glamour of Big Tech?",
  "link": "https://spectrum.ieee.org/can-the-artemis-moon-mission-revive-the-glamour-of-big-tech",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/an-image-of-an-astronaut-having-moon-soil-fall-from-his-hand.png?id=29811165&width=1245&height=700&coordinates=0%2C0%2C0%2C0\"/><br/><br/><p><strong>Today, the phrase</strong> “big tech” typically resonates negatively. It conjures up disturbing aspects of social media and the rise of megacorporations that seem beyond the reach of the law. And yet decades ago, big tech was typically associated with the glamor of motion: of speed, of power, and the thrill of exploring new frontiers.</p><p>Two leaders, <a href=\"https://www.aljazeera.com/opinions/2013/5/3/wernher-von-braun-historys-most-controversial-figure\" rel=\"noopener noreferrer\" target=\"_blank\">Wernher von Braun</a> and <a href=\"https://www.nytimes.com/1981/04/04/obituaries/juan-trippe-81-dies-us-aviation-pioneer.html\" rel=\"noopener noreferrer\" target=\"_blank\">Juan Trippe</a>, became household names as they made bold bets that paid off and enabled people to go where few thought it possible not long before. Von Braun had a troubling history: As a 30-year-old, he had convinced Adolf Hitler to fund his V-2 missiles, of which thousands were built, with slave labor. They rained down on Paris, London, and other cities, killing <a href=\"https://www.dailymail.co.uk/news/article-2750353/Interactive-map-reveals-hundreds-sites-Hitler-s-V2-rockets-killed-thousands-British-civilians-final-months-WW2.html\" rel=\"noopener noreferrer\" target=\"_blank\">9,000 people</a>, mostly civilians.</p><hr/><p>But when von Braun’s Apollo program came to fruition, in the late 1960s, huge crowds gathered every few months on the Florida coast to watch the thundering <a href=\"https://www.space.com/saturn-v-rocket-guide-apollo\" rel=\"noopener noreferrer\" target=\"_blank\">Saturn V</a> rockets take off. It was a partylike atmosphere and a joyous time. We humans were going to the moon, making a connection that had seemed both improbable and impossible just a few years before.</p><p class=\"pull-quote\">Pan Am’s landing in Manila marked the start of globalism, of our modern connectivity.</p><p>The rapturous crowds in Florida gathered during a turbulent time, with popular culture dominated by sex, drugs, rock and roll, and pervasive antiestablishment sentiment. And yet, in that unsettled era, techno-optimism somehow took root. The most religious experience I have ever had was during the astronauts’ <a href=\"https://www.jsonline.com/story/news/2018/12/21/50-years-ago-apollo-8-astronauts-saved-1968-genesis-reading/2301420002/\" rel=\"noopener noreferrer\" target=\"_blank\">live-to-Earth reading of Genesis</a> from orbit around the moon on Christmas Eve, 1968.</p><p>Few probably realize that the big Apollo gatherings had a clear precedent in another mass outpouring of hope about large-scale human adventure. It occurred around San Francisco Bay at the height of the Great Depression, 30 years before the Apollo landings. Another indomitable spirit, Trippe, the president of Pan Am, was betting against all odds that he could open transpacific passenger service, and make it real on a timetable that no sober advisor believed possible.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img class=\"rm-shortcode\" data-rm-shortcode-id=\"974025d764977715161d31473e486940\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"f8245\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/this-martin-m-130-flying-boat-called-the-china-clipper-took-off-on-a-test-flight-from-san-francisco-bay-in-october-1935-u2014o.png?id=29795241&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">This Martin M-130 flying boat, called the China Clipper, took off on a test flight from San Francisco Bay in October 1935—one month before it made the first commercial transpacific flight.</small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">\n            FPG/Archive Photos/Getty Images\n        </small>\n</p><p>On 22 November 1935, the first transpacific commercial flight took to the skies. <a href=\"https://www.thisdayinaviation.com/22-november-1935/\" rel=\"noopener noreferrer\" target=\"_blank\">At 3:46 p.m</a>., a <a href=\"http://www.everythingpanam.com/M130.html\" rel=\"noopener noreferrer\" target=\"_blank\">Martin M-130 flying boat</a>, the<a href=\"http://www.timelines.ws/subjects/Airlinestuff.HTML\" rel=\"noopener noreferrer\" target=\"_blank\"> largest passenger plane</a> built up to that point, lumbered into the air from Pan Am's base in Alameda, Calif., on the east side of San Francisco Bay. On that first trip, the plane carried only mail under contract to the U.S. post office.</p><p>Over 100,000 people had gathered around the bay to watch. Captain Edwin Musick powered the \"<a href=\"https://www.clipperflyingboats.com/pan-am/martin-m130\" rel=\"noopener noreferrer\" target=\"_blank\">China Clipper</a>\" northward in the bay and up over the waves. He planned to fly over the Bay Bridge, the double suspension bridge that today spans the bay and links San Francisco with Oakland. But he couldn't gain altitude quickly enough with <a href=\"https://www.panam.org/explorations/724-transpacific-flight-borger\" rel=\"noopener noreferrer\" target=\"_blank\">the 4,000 gallons of fuel</a> he was carrying. Fortunately, the roadway had not yet been hung from the catenaries, and he managed to fly under them. When he got to the Golden Gate Bridge, also under construction at the time, he just barely managed to get above it.</p><p class=\"pull-quote\">On the Clipper’s very first return flight from Honolulu to San Francisco, disaster was very narrowly averted when the big seaplane landed in the bay with just 1 minute of fuel left in its tanks.</p><p>When Musick and his crew arrived in the Philippines six days later, there were 200,000 people cheering wildly in Manila Harbor. Musick hand-delivered a letter from President Franklin D. Roosevelt to President Manuel Quezon of the Philippines. Quezon told Musick, \"You have swept away forever the distance which from the beginning of time has separated the great continent of America from the beautiful islands of the Pacific.\" Pan Am’s landing in Manila marked the start of globalism, of our modern connectivity.</p><p>Today, as NASA’s <a href=\"https://www.nasa.gov/specials/artemis/\" rel=\"noopener noreferrer\" target=\"_blank\">Artemis mission</a> heralds a new era of human space exploration, it’s important to remember how much difficulty and serendipity there was on the way to Manila and the moon. On the Clipper’s first return flight from Honolulu to San Francisco, disaster was very narrowly averted when the big seaplane landed in the bay with just 1 minute of fuel left in its tanks. Von Braun could have easily ended up dead or in Russia rather than in the United States.</p><p>Similarly, there will be many twists and turns on the way to the moon and Mars. The obvious successor to Trippe and von Braun would now seem to be Elon Musk—but maybe it’ll be someone else. Regardless, and despite our divisions and perhaps even future pandemics, people will undoubtedly come out in droves once again to witness the takeoffs and landings. At last, big tech will again be something to celebrate.</p><p><em>This article appears in the June 2022 print issue as “22 November 1935: The Day Globalism was Born.”</em></p>",
  "pubDate": "Tue, 17 May 2022 15:00:01 +0000",
  "guid": "https://spectrum.ieee.org/can-the-artemis-moon-mission-revive-the-glamour-of-big-tech",
  "category": [
    "Big tech",
    "Globalism",
    "Transportation",
    "Space travel",
    "Artemis mission"
  ],
  "dc:creator": "Rodney Brooks",
  "media:content": ""
}