{
  "title": "Ranking Programming Languages by GitHub Users",
  "link": "",
  "updated": "2018-01-25T00:00:00-08:00",
  "id": "http://www.benfrederickson.com/ranking-programming-languages-by-github-users/",
  "content": "\n        \n            <img src=\"http://www.benfrederickson.com/images/github/language-popularity/newthing.png\" width=\"100%\" style=\"max-width:500px\">\n        \n        <p>I’ve recently become obsessed with the sheer amount of development activity happening on sites like GitHub.</p>\n\n<p>As a first project on working with this data, I thought it would be fun to rank all the programming languages by counting how many people on GitHub use each language.</p>\n\n<p>I’m using the <a href=\"https://www.githubarchive.org/\">GitHub Archive</a> and <a href=\"http://ghtorrent.org/\">GHTorrent</a> projects as data sources for this analysis.\nThe GitHub Archive provides a record of every public event on GitHub since early 2011.\nThis includes an event every time someone has pushed new code, forked or starred a repository, or opened an issue on GitHub.\nOverall the GitHub Archive has more than 1.25 Billion events on more than 75 Million different repositories. <a href=\"http://ghtorrent.org/\">GHTorrent</a> goes even further\nand hits the GitHub API for each event - which lets me resolve the language for most repositories.</p>\n\n<p>The cool thing about this is that there are usernames associated with each of those events, which means that I can count how many\ndifferent people are using each language. Every time a user interacts with a repository I’m counting that user as using the language of that repository -\nand then aggregating this each month to calculate how many Monthly Active Users (MAU) each language has.</p>\n\n<p>Since the data goes back 7 years, I can also plot how popular each programming language was over time which reveals some interesting patterns.\nLooking at these trend lines, we can figure out which programming languages are worth learning, and which programming languages probably should be avoided.</p>\n\n<p class='more'><a href='http://www.benfrederickson.com/ranking-programming-languages-by-github-users/'>Read more ...</a></p>\n     "
}