{
  "title": "S03.03: Fifty Shades of Grey by EL James: Romance Has Gotten Hotter And I Think I Like It",
  "category": [
    "full-length episode",
    "read along",
    "S03 - BOOB"
  ],
  "dc:creator": "Jennifer Prokop",
  "pubDate": "Wed, 02 Sep 2020 04:00:00 +0000",
  "link": "https://fatedmates.net/episodes/2020/9/1/s0303-fifty-shades-of-grey-by-el-james",
  "guid": "5bc7409ec46f6d369ce5f644:5bcf6773419202388fdccb10:5f4ea7c960a99202f502d76d",
  "description": "<p class=\"\">If we’re going to talk about the last 10 years of romance — what we’d call modern romance — it’s basically impossible to do that out in the world without someone who doesn’t know much about the genre asking about EL James’s Fifty Shades of Grey. This week, Fated Mates is talking about Fifty Shades. Or, rather, we’re talking about what we're really talking about when we talk about Fifty Shades of Grey.</p><p class=\"\">At no point in this discussion do we talk about tampons. You’re welcome.</p><p class=\"\">Next week, we’ve got an interstitial for you! And the week after, we’re deep diving on Milla Vane’s A Heart of Blood and Ashes, which is a long fantasy romance. If you are a reader who needs content warnings, you might want to check out reviews on Goodreads.</p><p class=\"\">Find it at Amazon, B&N, Kobo, Apple Books or Bookshop.org.</p><p class=\"\"><strong>Show Notes</strong></p><p class=\"\">There are honestly so many articles about Fifty Shades that Jen couldn't possibly even link to them. But the one about the increase in ER visits, necktie sales up 23%, and Jen wrote about the history of romance between Fabio and Fifty Shades.</p><p class=\"\">Drunk Austen went through a rather spectacular break-up last week; we promise never to do this and swear we are full legal partners in our current venture.</p><p class=\"\">Fanfiction brought Christina Lauren, Tara Sue Me, Sally Thorne and so many others to us. And lots of great BDSM was written after Fifty Shades by too many authors to count, but many think of The Original Sinners series by Tiffany Reisz as being truly excellent.</p><p class=\"\">There's a reason why women hate dealing with car salesmen and mechanics. Jen wants you to know that if you're in Chicago and looking for a mechanic, the guys at Ashland Tire and Auto will never treat you like that.</p><p class=\"\">Perhaps you're interested in whether or not Fifty Shades of Grey was copyright infringement?</p><p class=\"\">The 2010 He-cession vs the 2020 she-cession.</p><p class=\"\">Sarah reviewed Grey for the Washington Post, and just a few weeks ago, Midnight Sun (Twilight from Edward's Point of View was released.</p><p class=\"\">Ope. We forgot to talk about Thomas Hardy, so just read this article from The Guardian instead.</p><p class=\"\">Mrs. Robinson refers to a character in the 1967 film The Graduate.</p><p class=\"\">Flat Stanley is a character in a children's book, but here we are talking about the theory that readers insert themselves into a book and become the main character. Many people believed that teenage girls reading Twilight imaged themselves as Bella, for example, but that's deeply rooted in misogny. In Dangerous Men and Adventurous Women, Laura Kinsale suggested that women reading romance imagine themselves as the hero rather than the heroine.</p><p class=\"\">Fifty Shades of Grey sold a lot of fucking copies. A lot. A lot!</p><p class=\"\">Lori Perkins was the editor of Fifty Writers on Fifty Shades of Grey. You can also check out Hard Core Romance: Fifty Shades of Grey, Bestsellers, and Society by Eva Illouz.</p><p class=\"\">Jen refers to Christian as the Marlboro Man, a symbol of a kind of gruff, male, American renegade loner.</p><p class=\"\">BDSM contracts are a thing!</p><p class=\"\">Where does Kink come from? And what Fifty Shades gets right and wrong about kink and BDSM.</p><p class=\"\">In two weeks: A Heart of Blood and Ashes by Milla Vane. Has at The Book Pushers has a reviw with content warnings, so check that if you need to.</p><p class=\"\">Sarah has a contemporary novella in the Naught Brits anthology which comes out September 15, preorder today!</p>",
  "itunes:author": "Fated Mates",
  "itunes:subtitle": "Jen and Sarah revisit 50 Shades of Grey",
  "itunes:summary": "If we’re going to talk about the last 10 years of romance — what we’d call modern romance — it’s basically impossible to do that out in the world without someone who doesn’t know much about the genre asking about EL James’s Fifty Shades of Grey. This week, Fated Mates is talking about Fifty Shades. Or, rather, we’re talking about what we're really talking about when we talk about Fifty Shades of Grey. \nAt no point in this discussion do we talk about tampons. You’re welcome.",
  "itunes:explicit": "yes",
  "itunes:duration": "01:25:32",
  "itunes:image": "",
  "itunes:season": 3,
  "itunes:episode": 3,
  "itunes:title": "S03.03: Fifty Shades of Grey by EL James: Romance Has Gotten Hotter And I Think I Like It",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "S03.03: Fifty Shades of Grey by EL James: Romance Has Gotten Hotter And I Think I Like It"
  }
}