{
  "title": "betaclust: a family of mixture models for beta valued DNA methylation data. (arXiv:2211.01938v1 [stat.ME])",
  "link": "http://arxiv.org/abs/2211.01938",
  "description": "<p>The DNA methylation process has been extensively studied for its role in\ncancer. Promoter cytosine-guanine dinucleotide (CpG) island hypermethylation\nhas been shown to silence tumour suppressor genes. Identifying the\ndifferentially methylated CpG (DMC) sites between benign and tumour samples can\nhelp understand the disease. The EPIC microarray quantifies the methylation\nlevel at a CpG site as a beta value which lies within [0,1). There is a lack of\nsuitable methods for modelling the beta values in their innate form. The DMCs\nare identified via multiple t-tests but this can be computationally expensive.\nAlso, arbitrary thresholds are often selected and used to identify the\nmethylation state of a CpG site. We propose a family of novel beta mixture\nmodels (BMMs) which use a model-based clustering approach to cluster the CpG\nsites in their innate beta form to (i) objectively identify methylation state\nthresholds and (ii) identify the DMCs between different samples. The family of\nBMMs employs different parameter constraints that are applicable to different\nstudy settings. Parameter estimation proceeds via an EM algorithm, with a novel\napproximation during the M-step providing tractability and computational\nfeasibility. Performance of the BMMs is assessed through a thorough simulation\nstudy, and the BMMs are used to analyse a prostate cancer dataset and an\nesophageal squamous cell carcinoma dataset. The BMM approach objectively\nidentifies methylation state thresholds and identifies more DMCs between the\nbenign and tumour samples in both cancer datasets than conventional methods, in\na computationally efficient manner. The empirical cumulative distribution\nfunction of the DMCs related to genes implicated in carcinogenesis indicates\nhypermethylation of CpG sites in the tumour samples in both cancer settings. An\nR package betaclust is provided to facilitate the use of the developed BMMs.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/stat/1/au:+Majumdar_K/0/1/0/all/0/1\">Koyel Majumdar</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Silva_R/0/1/0/all/0/1\">Romina Silva</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Perry_A/0/1/0/all/0/1\">Antoinette Sabrina Perry</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Watson_R/0/1/0/all/0/1\">Ronald William Watson</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Murphy_T/0/1/0/all/0/1\">Thomas Brendan Murphy</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Gormley_I/0/1/0/all/0/1\">Isobel Claire Gormley</a>"
}