{
  "id": "https://bibleinoneyear.org/en/youth/327",
  "title": "Day 327: Where Is God?",
  "description": "Psalm 132:3–5,13–14, Ezekiel 43:2, 44:4, 1 Peter 2:4–17,20b–24.  The holy temple in the New Testament is one made of ‘living stones’ (1 Peter 2:5) – in other words, people like you and me  This is God’s new home",
  "pubDate": "Tue, 23 Nov 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/327/?ignore",
  "itunes:duration": "15:42",
  "guid": "enyouth23112021-327",
  "length": 942.63,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 327: Where Is God?",
  "itunes:subtitle": "Psalm 132:3–5,13–14, Ezekiel 43:2, 44:4, 1 Peter 2:4–17,20b–24.  The holy temple in the New Testament is one made of ‘living stones’ (1 Peter 2:5) – in other words, people like you and me  This is God’s new home",
  "itunes:summary": "Elie Wiesel was born into a Jewish family in Romania. He was only a teenager when he and his family were rounded up by the Nazis and taken first to Auschwitz, and then to Buchenwald. In his book, Night, he gives a terrifying and intimate account of the increasing horrors he endured – the death of his parents and eight-year-old sister, and the loss of his innocence by barbaric hands.\nIn the foreword to the book, François Mauriac writes of his encounter with Elie Wiesel: ‘On that most horrible day, even among all those other bad days, when the child witnessed the hanging (yes!) of another child who, he tells us, had the face of a sad angel, he heard someone behind him groan: “For God’s sake, where is God?” And from within me, I heard a voice answer: “Where He is? This is where – hanging here from this gallows.”’\nFrançois Mauriac goes on, ‘And I, who believe that God is love, what answer was there to give my young interlocutor... What did I say to him? Did I speak to him of that other Jew, this crucified brother who perhaps resembled him and whose cross conquered the world?\n‘Did I explain to him that what had been a stumbling block for his faith had become a cornerstone for mine? And that the connection between the cross and human suffering remains, in my view, the key to the unfathomable mystery in which the faith of his childhood was lost... That is what I should have said to the Jewish child. But all I could do was embrace him and weep.’\nHis words point to the most profound answer to the question, ‘Where is God?’ God is in Christ. He was on the cross bearing our sins in his body. Now the crucified is among his people. Not only has he suffered for you, but he now suffers with you.\nIn the Old Testament, the tabernacle (and later the temple) was the place where people went to meet with God. This was God’s home as we see in our Old Testament passage for today (Ezekiel 43:5).\nThe message of our New Testament passage though is that the glory and presence of God is to be found supremely in Jesus. It is at the very moment that Jesus is rejected and crucified that God’s presence among people is finally and fully realised. From that point on there is no need for a physical temple. The only church building the New Testament speaks about is a building made of people (Ephesians 2:20–22), founded and built upon Jesus, the chief cornerstone. The holy temple in the New Testament is one made of ‘living stones’ (1 Peter 2:5) – in other words, people like you and me. This is God’s new home.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 327
}