{
  "title": "Tom Tom Fest Applied Machine Learning Conference 2019",
  "link": "https://www.becomingadatascientist.com/2019/03/10/tom-tom-fest-applied-machine-learning-conference-2019/",
  "comments": "https://www.becomingadatascientist.com/2019/03/10/tom-tom-fest-applied-machine-learning-conference-2019/#comments",
  "pubDate": "Sun, 10 Mar 2019 19:39:28 +0000",
  "dc:creator": "Renee",
  "category": [
    "events/meetups",
    "Podcast"
  ],
  "guid": "https://www.becomingadatascientist.com/?p=1591",
  "description": "The 2019 iteration of Tom Tom Fest (named after Thomas Jefferson) starts in under a month, and the Applied Machine Learning Conference (AMLC) is just over a month away, on April 11, in Charlottesville, VA! This is a conference I&#8217;ve helped plan since the beginning, and it&#8217;s grown in 3 years from a single theater [&#8230;]",
  "content:encoded": "<p>The 2019 iteration of <a href=\"https://tomtomfest.com/\" rel=\"noopener\" target=\"_blank\">Tom Tom Fest</a> (named after Thomas Jefferson) starts in under a month, and the <a href=\"https://tomtomfest.com/machine-learning/\" rel=\"noopener\" target=\"_blank\">Applied Machine Learning Conference (AMLC)</a> is just over a month away, on April 11, in Charlottesville, VA!</p>\n<p>This is a conference I&#8217;ve helped plan since the beginning, and it&#8217;s grown in 3 years from a single theater with a partial day of talks to 4 theaters with non-stop presentations all day, plus keynotes in an even larger venue!</p>\n<p>An exciting announcement from me is that I will be recording a short episode of my Becoming a Data Scientist Podcast in front of a live audience for the first time at the AMLC! I&#8217;ll be interviewing <a href=\"https://twitter.com/therriaultphd\" rel=\"noopener\" target=\"_blank\">Andrew Therriault</a>, one of our keynote speakers, about how he became an Infrastructure Data Science Manager at Facebook, after starting out with degrees in politics, and working as the Director of Data Science for the Democratic National Committee, and the Chief Data Officer for the City of Boston, among other roles.</p>\n<p>I am <a href=\"https://twitter.com/BecomingDataSci/status/1099814149452976131\" rel=\"noopener\" target=\"_blank\">featuring an AMLC speaker each day</a> with the <a href=\"https://twitter.com/hashtag/AMLCville?src=hash\" rel=\"noopener\" target=\"_blank\">#AMLCville</a> hashtag on twitter. You can learn more about all of our speakers (still more to be added!) and get tickets on the <a href=\"https://tomtomfest.com/machine-learning/\" rel=\"noopener\" target=\"_blank\">conference website</a>. Hope to see you there! </p>\n",
  "wfw:commentRss": "https://www.becomingadatascientist.com/2019/03/10/tom-tom-fest-applied-machine-learning-conference-2019/feed/",
  "slash:comments": 1
}