{
  "title": "TU162: Adult Attachment Projective (AAP) Assessment &#038; Clinical Use with Dr. Carol George",
  "link": "https://therapistuncensored.com/episodes/using-the-adult-attachment-projective-aap-assessment-with-carol-george/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=using-the-adult-attachment-projective-aap-assessment-with-carol-george",
  "pubDate": "Tue, 09 Nov 2021 07:17:07 +0000",
  "guid": "https://therapistuncensored.com/?p=11946",
  "description": "This is an incredible opportunity to sit with a legend in the field of attachment research!  Dr. Carol George worked directly with Mary Main, and her dissertation lead to the Adult Attachment Inventory (AAI).  She and Sue Marriott discuss wide-ranging topics all with the eye on using the whole of this research in real life and in the clinical setting.  Learn about the Adult Attachment Projective, the history of the research and more about this incredible woman who is a living legend.",
  "enclosure": "",
  "itunes:subtitle": "Not for just for scholars and professionals - understanding attachment research for real world settings outside the lab",
  "itunes:summary": "This is an incredible opportunity to sit with a legend in the field of developmental attachment research!  Dr. Carol George worked directly with Mary Main, and her dissertation lead to the Adult Attachment Inventory (AAI).  She and co-host Sue Marriott discuss wide-ranging topics all with the eye on using the whole of this research in real life and in the clinical setting.  Learn about the Adult Attachment Projective, the history of the research and more about this incredible woman who is a living legend. Show notes for this episode can be found at therapistuncensored.com/episodes or search for 163 or Carol George.For more, join our private online community at https://therapistuncensored.supercast.com.",
  "itunes:author": "Carol George",
  "itunes:image": "",
  "itunes:season": 6,
  "itunes:episode": 162,
  "itunes:title": "Adult Attachment Projective (AAP) Assessment & Clinical Use, with Dr. Carol George",
  "itunes:duration": "1:33:00"
}