{
  "title": "Neuronlike Memristors Could Superspeed 6G Wireless",
  "link": "https://spectrum.ieee.org/memristor-6g-switches",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/conceptual-rendering-of-a-device-of-molybdenum-disulfide-sandwiched-between-gold-electrodes-wiggly-lines-and-light-emit-from-it.jpg?id=29982938&width=1200&height=600&coordinates=0%2C155%2C0%2C155\"/><br/><br/><p>The dream for the next generation of wireless communications, <u><a href=\"https://spectrum.ieee.org/6g-geopolitics\" target=\"_self\">6G</a></u>, includes speeds of up to <u><a href=\"https://spectrum.ieee.org/terahertz-linkdiscovery\" target=\"_self\">trillions of bits per second</a></u>. Now a new study reveals that neuronlike devices made of atomically thin films might serve as key switches in upcoming 6G networks.<br/></p><p>The current generation of wireless communications, 5G, began its rollout in 2020. Initial deployment of 6G is not likely to happen until around 2030, and much remains uncertain about the shape that it might take, as no standards for it have been established yet. Still, many envision terabit-per-second data rates for 6G, as well as applications such as autonomous vehicles, <a href=\"https://spectrum.ieee.org/heres-what-6g-will-be-according-to-the-creator-of-massive-mimo\" target=\"_self\">augmented reality</a>, and <a href=\"https://spectrum.ieee.org/6g-technology\" target=\"_self\">immersive telepresence</a>.</p><p>A key building block that will likely require an upgrade for 6G is the analog switch. These commonplace components assist communications between wirelessly connected devices by jumping between networks and frequencies while receiving data.</p><p class=\"pull-quote\">“When we first started the research, we could only dream of such performance, and to be able to actually realize it in practical devices is a welcome surprise.”<br/>—Deji Akinwande, University of Texas at Austin</p><p>Conventional analog switches based on transistors or solid-state diodes are <a href=\"https://en.wikipedia.org/wiki/Volatile_memory\" target=\"_blank\">volatile</a>, consuming energy not only when they switch but also during standby or even when idle. To substantially reduce the overall energy consumption, researchers are exploring nonvolatile memory devices as alternative analog switches. These include <a href=\"https://spectrum.ieee.org/memristor-random\" target=\"_self\">neuronlike memristors</a>, two-dimensional <a href=\"https://spectrum.ieee.org/atomthin-memristors-discovered\" target=\"_self\">atomristors</a>, <a href=\"https://spectrum.ieee.org/nanoporous-version-of-silicon-oxide-brings-it-back-into-the-race-for-resistive-memory\" target=\"_self\">resistive random-access memory (RRAM)</a>, and <a href=\"https://spectrum.ieee.org/novel-nanostructures-give-boost-to-phase-change-memory\" target=\"_self\">phase-change memory (PCM)</a>.</p><p>In the new study, researchers focused on atomically thin, two-dimensional materials that in principle require only tiny amounts of energy, potentially resulting in greater speed and battery life. The researchers had previously developed nonvolatile switches made of <a href=\"https://spectrum.ieee.org/atomically-thin-circuits-made-from-graphene-and-molybdenite\" target=\"_self\">molybdenum disulfide</a> that operated at <a href=\"https://www.nature.com/articles/s41467-018-04934-x\" target=\"_blank\">frequencies of up to 50 gigahertz</a>, and ones made of <a href=\"https://spectrum.ieee.org/atomthin-switches-5g-6g-radio-signals\" target=\"_self\">hexagonal boron nitride</a> that operated at 100 GHz.</p><p>Now these scientists have developed nonvolatile analog switches from molybdenum disulfide that can operate at frequencies of roughly 100 to 500 GHz, a communication band that 6G will likely include.</p><p>The new devices sandwich molybdenum disulfide between two gold electrodes. This metal-insulator-metal structure behaves like a <a href=\"https://en.wikipedia.org/wiki/Memristor\" target=\"_blank\">memristor</a>, or <a href=\"https://spectrum.ieee.org/tag/memristors\" target=\"_blank\">memory resistor</a>, a kind of building block for electronic circuits that scientists predicted roughly 50 years ago but created for the first time only a little more than a decade ago. These components are essentially switches that can remember whether they were toggled on or off after their power is turned off. In theory, memristors can act like artificial neurons capable of both computing and storing data.</p><p>In experiments, the new switch could engage in data communication at rates of up to 100 gigabits per second at a frequency of 320 GHz, with a low bit error rate and a high signal-to-noise ratio. It could also stream real-time, high-definition television with no compression at 1.5 Gb/s at a frequency of 300 GHz. It could switch in just half a nanosecond with an energy of just 50 picojoules, more than one order of magnitude lower than comparable mature devices.</p><p>“When we first started the research, we could only dream of such performance, and to be able to actually realize it in practical devices is a welcome surprise,” says study co–senior author Deji Akinwande, an electrical engineer and materials scientist at the University of Texas at Austin. “The application is quite clear—energy-efficient communication components for future 6G wireless systems.”</p><p>In the future, the researchers aim to integrate these switches with silicon chips and circuits. “Molybdenum disulfide is wafer-scalable and can be integrated with silicon CMOS,” Akinwande says. “Hence, this switch device can be readily integrated with contemporary semiconductor microchip technology that could benefit a diverse array of industries to benefit society.”</p><p>The main criticism of the device at the moment “is the reliability of these switches, especially with respect to endurance,” Akinwande says. “That is indeed a question that is critical to practical applications, and we are working on this matter.”</p><p>The scientists detailed <u><a href=\"https://www.nature.com/articles/s41928-022-00766-2\" rel=\"noopener noreferrer\" target=\"_blank\">their findings</a></u> 30 May in the journal <em>Nature Electronics</em>.</p>",
  "pubDate": "Thu, 16 Jun 2022 21:13:41 +0000",
  "guid": "https://spectrum.ieee.org/memristor-6g-switches",
  "category": [
    "6g",
    "Wireless communication",
    "5g",
    "Switches",
    "Molybdenum disulfide",
    "Memristors",
    "Memristor"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}