{
  "title": "S1 Ep46: How does shame and embarrassment impact social learning? Evidence from India",
  "link": "https://audioboom.com/posts/7784603",
  "itunes:episode": 46,
  "itunes:title": "How does shame and embarrassment impact social learning? Evidence from India",
  "itunes:season": 1,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 860,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>People are less likely to ask questions in their communities if it exposes the limits of their knowledge.<br>\n<strong>Read “Signaling, shame, and silence in social learning” by Arun G. Chandrasekhar, Benjamin Golub, and He Yang </strong><a href=\"https://stanford.edu/~arungc/CGY.pdf\"><strong>here</strong></a><strong>.</strong>\n</div>\n",
  "itunes:summary": "Social learning is an important part of how people gain knowledge to inform their decisions. Seeking new information from one’s networks or peers can, however, be inhibited by feelings of shame or fears of reputation loss. These inhibitory mechanisms have been the focus of extensive sociological research. In this VoxDevTalk, Benjamin Golub, discusses findings from his field experiment in rural India, with co-authors Arun G. Chandrasekhar and He Yang that further explores these underlying mechanisms. Their research reveals that social learning does indeed play a large part in knowledge acquisition – almost all subjects reported learning important things about issues ranging from farming techniques to financial services from their friends and community. However, almost 90% also reported feeling constrained about how often they could ask for information, most often over worries of appearing ill-informed or weak. Hesitance to seek new information can have important implications for not jus",
  "pubDate": "Wed, 06 Jan 2021 17:11:00 +0000",
  "guid": "tag:audioboom.com,2021-01-28:/posts/7784603",
  "itunes:author": "VoxDev.org",
  "dc:creator": "VoxDev.org",
  "media:rights": ""
}