{
  "title": "Metagaming: An Interview With Andrew Ringlein",
  "link": "https://danielmiessler.com/blog/metagaming-an-interview-with-andrew-ringlein/",
  "dc:creator": "Daniel Miessler",
  "pubDate": "Wed, 07 Sep 2022 16:39:20 +0000",
  "category": "Creativity",
  "guid": "https://danielmiessler.com/?p=138183",
  "description": "In today’s standalone episode I’m going to talk about some new gaming ideas I’ve not seen anywhere else, and have their creator, Andrew Ringlein, come on and talk about them. Andrew was also on a previous episode where we talked about crypto and how it changes incentives in business. So I’ve been a steady, casual gamer since junior&#8230;",
  "content:encoded": "<p><img decoding=\"async\" loading=\"lazy\" src=\"https://danielmiessler.com/images/rifters-post-650x650.png\" alt=\"\" width=\"650\" height=\"650\" class=\"aligncenter size-medium wp-image-138184\" /></p>\n\n<p>\n<iframe loading=\"lazy\" src=\"https://omny.fm/shows/unsupervised-learning/metagaming-an-interview-with-andrew-ringlein/embed?style=artwork\" allow=\"autoplay; clipboard-write\" width=\"100%\" height=\"180\" frameborder=\"0\" title=\"Metagaming: An Interview with Andrew Ringlein\"></iframe>\n</p>\n\n<p>In today’s standalone episode I’m going to talk about some new gaming ideas I’ve not seen anywhere else, and have their creator, Andrew Ringlein, come on and talk about them. Andrew was also on a previous episode where we talked about crypto and how it changes incentives in business.</p>\n\n<p>So I’ve been a steady, casual gamer since junior high school, and Andrew actually introduced me to Role Playing Games way back then. Andrew is a die-hard gamer, a super close friend, and quite simply the smartest game designer I’ve ever met. And now he’s actually built a game studio and is in the middle of launching two games.</p>\n\n<p>But before I bring him on I want to talk about why I thought these ideas warranted a UL episode. He’s a close friend, but I have lots of friends, and I only create UL content around ideas that I think will be interesting to the audience.</p>\n\n<p>What I personally find most interesting in the gaming space is not really the games, but new things happening in the games. The engagement mechanisms. How the content is being created. How people are incentivized to create their own content. And how changing rules change incentives and then change behavior.</p><div data-inline-related-post data-inline-related-post-index=0></div>\n\n<p><strong>Basically, I’m excited about how new games change gaming itself.</strong></p>\n\n<p>I have talked to Andrew throughout the creation of his new games, and had a bit of input and knew the general direction, but the other day I spent over an hour doing a brain dump of everything he thinks is unique about the game he’s releasing, which is called Rifters.</p>\n\n<p>And I’ve broken these new mechanics into 5 Rifter Mechanics (Update With Full List Number)</p>\n\n<p>1: Core Gaming Concepts, and</p>\n\n<p>First, and just to get it out of the way, NFTs are a big part of the game. He came up with this during the NFT climax earlier in 2022. But luckily for the game and its legacy, it’s not about hyping some sort of NFT (which is the worst part about the whole space). Rather it’s a mechanism for getting NFT-united groups to come play in the game. So the NFT thing is ever-present, but it’s just a mechanic, not the entire point.</p>\n\n<p>So, here are the mechanics.</p><div data-inline-related-post data-inline-related-post-index=1></div>\n\n<ol>\n<li>The first core concept is what he’s calling Reactive Reality. This is where things happening within the game itself, as well as adjacent to the game in other mediums, all affect the nature of reality inside the game. So think of the physics engine. The strength of items. The relative power of different magic types. They’re all dynamically modifiable based on player activity! Imagine pacts with Gods where you make deals and promises, and in return something you desire actually happens.</li>\n<li>The second concept is highly tied to the first and deals with the existence of Simultaneous Realities for the game. That means the main game is happening within the game itself, within the browser, but dialogue and activity is taking place simultaneously on Discord, on Twitter, and even in meatspace! And tying in with the first major concept, those actions in Discord or Twitter—or live on Earth—can directly and significantly affect the rules and outcomes of the game!</li>\n<li>The third concept is Gamification of Pro-Community Behaviors, which he calls Crossover Incentives. In other words, this is a Discord-adjacent game that wraps community-desirable actions—such as talking about the community on social media, or looking for people who trash-talking the community&#8211;and incentivizes them through in-game activities.</li>\n</ol>\n\n<p><strong>This is the first game ever made, to my knowledge, where an action on Discord, or Twitter, or in front of the Oakland Coliseum, can materially alter a game’s fundamental reality.</strong></p>\n\n<p>Not as a hack or a trick, but built directly into the game engine from the beginning. Tons of the game’s underlying variables are adjustable from external inputs, giving players across multiple mediums (Discord, Twitter, Physical, etc.) more control than ever over a game.</p>\n\n<p>So the Core Concepts are:</p>\n\n<ol>\n<li>Reactive Reality</li>\n<li>Simultaneous Realities</li>\n<li>Crossover Incentives</li>\n</ol>\n\n<p>When you combine these you end up with a completely new type of game that merges game, community, and reality into one, which he’s referred to as Metagaming (think meta in RPGs combined with mixing worlds). So you have the game itself that has adjustment and change built right into its core (Reactive Reality). Then you have gaming activity happening across multiple dimensions simultaneously, including in-game, on Twitter, in Discord, and in physical reality (Simultaneous Realities). And then you have in-game activities affecting real-world communities and vice-versa (Crossover Incentives).</p>\n\n<p>Here are a couple of examples:</p><div class=\"inline-auto-newsletter\"><div class=\"inline-subscribe px-2 pb-8 pt-8 mb-8 border-t border-b\">\n<div class=\"text-lg font-bold\">The UL Newsletter: Finding the Patterns in the Noise…</div>\n<div class=\"text-sm text-gray-700 max-w-lg\">Get a weekly analysis of what's happening in security and tech—<em>and why it matters</em>.</div>\n<div class=\"mt-2\"><form action=\"https://danielmiessler.us8.list-manage.com/subscribe/post?u=6a9e465ab1570df8aaecb2292&id=49fdb7d723\" method=\"post\" name=\"mc-embedded-subscribe-form\" class=\"mc-embedded-subscribe-form validate inline\" novalidate > \n            <div>\n            <div class=\"mc-field-group\">\n            <input  placeholder=\"your best email\" type=\"email\" value=\"\" name=\"EMAIL\" class=\"required email\" id=\"mce-EMAIL\">\n            <input type=\"submit\" value=\"Subscribe\" name=\"subscribe\" id=\"mc-embedded-subscribe\" class=\"button text-system\">\n            </div>\n            <div style=\"position: absolute; left: -5000px;\" aria-hidden=\"true\"><input type=\"text\" name=\"b_6a9e465ab1570df8aaecb2292_49fdb7d723\" tabindex=\"-1\" value=\"\"></div>\n            </div>\n            </form></div>\n</div>\n</div>\n\n<ul>\n<li><p>Let’s say you just had a major player die in your clan within Rifters, and you really wish you could resurrect them. You can speak with a game avatar and forge an agreement that says if you can get 10 influencers of X amount of power to take the following action, that will create enough power outside of the game to cross the Rift into the game!</p></li>\n<li><p>Or let’s say you create some amazing item in the game and you want to give it ungodly powers. You can can go to an avatar and make a deal in which you bring X number of new viewers into a given location, and that attention will result in the Avatar being pleased with you in-game, giving you the ability to forge a +5 weapon instead of a +2 weapon. And it’s up to you to negotiate that pact, including what you have to do and how it will affect the game.</p></li>\n</ul>\n\n<p>Crucially—this isn’t a change that happens for just you, in your own instance. No. These are game-wide changes. You are literally able to leverage your community, your network, and—most importantly your creativity—to forge pacts that affect the underlying rules of the game for everyone in it.</p>\n\n<p>So those are the main elements, but here are some additional mechanisms that add to vitality.</p>\n\n<ul>\n<li><p>Personalized Items — Items are created within Rifters that are named after specific individuals in real life. Like, “Will Wheaton’s Wand of Woe”. Anyone else can wield it, and it’ll be a fine weapon at +1 and the ability to fix any technical problem. But if Will Wheaton actually shows up and claims it, it becomes a +5 weapon, with its own custom art, and a whole list of additional buffs. Plus, the guild he joins with will get a ton of additional advantages both in the game as well as in their Discord community. Again: crossing the boundary between real and game worlds!</p></li>\n<li><p>Tribal CTF — One of the primary dynamics is 8 factions that make up each game, and the fact that they are each NFT communities. Groan, I know, NFTs. Well, remember, it’s not the NFT bit that matters here: it’s the community bit. This allows things like a community’s Discord channel saying, “Hey, we’re going against BORED APES in Rifters, let’s go kick some ass!”</p><div data-inline-related-post data-inline-related-post-index=3></div></li>\n<li><p>Importance Mapping — The more powerful a given item (in this model an NFT), the more powerful the item in game. This encourages people with powerful NFTs to bring their item into Rifters to see how powerful they can be.</p></li>\n</ul>\n\n<p>So that brings the complete list to:</p>\n\n<ol>\n<li>Reactive Reality</li>\n<li>Simultaneous Realities</li>\n<li>Crossover Incentives</li>\n<li>Personalized Items</li>\n<li>Tribal CTF</li>\n<li>Importance Mapping</li>\n</ol>\n\n<p>Ok, so those are some of the core ideas, with a few examples. To hear more, listen to <a href=\"https://omny.fm/shows/unsupervised-learning/metagaming-an-interview-with-andrew-ringlein\">the included podcast</a>.</p>\n</p>"
}