{
  "guid": "805c6463dd784a2e803241089ec7b1ca",
  "title": "Episode 24: What's in your blood?",
  "pubDate": "Wed, 20 Feb 2019 22:11:49 -0000",
  "link": "https://beta.prx.org/stories/364937",
  "description": "<p>Thin nose, high cheekbones, kinky hair, what you got in your blood? Your blood won’t lie, but does it determine your identity? We meet two women- Uzaz Shami, a Nubian woman who didn’t expect her results, and Shonda Buchanan who has always identified as Native American but isn’t always accepted as that.  What percent of an ethnicity makes you part of that group, and does it even matter?</p>",
  "enclosure": "",
  "itunes:title": "What's in your blood?",
  "itunes:subtitle": "Thin nose, high cheekbones, kinky hair, what you got in your blood? Your blood won’t lie, but does it determine your identity? We meet two women- Uzaz Shami, a Nubian woman who didn’t expect her results, and Shonda Buchanan who has always...",
  "itunes:explicit": false,
  "itunes:episodeType": "full",
  "itunes:season": 3,
  "itunes:episode": 24,
  "itunes:duration": "36:07",
  "author": "hangout@thestoop.org (Hana Baba and Leila Day)",
  "itunes:author": "Hana Baba and Leila Day",
  "itunes:summary": "Thin nose, high cheekbones, kinky hair, what's in your blood? Your blood won’t lie, but does it determine your identity? We meet two women- Uzaz Shami, a Nubian woman who didn’t expect her results, and Shonda Buchanan who has always identified as Native American but isn’t always accepted as that.  What percent of an ethnicity makes you part of that group and does it even matter? Co-hosts Leila and Hana also take the test, and things take an unexpected turn.",
  "itunes:image": "",
  "media:content": "",
  "content:encoded": "<p>Thin nose, high cheekbones, kinky hair, what you got in your blood? Your blood won’t lie, but does it determine your identity? We meet two women- Uzaz Shami, a Nubian woman who didn’t expect her results, and Shonda Buchanan who has always identified as Native American but isn’t always accepted as that.  What percent of an ethnicity makes you part of that group, and does it even matter?</p>"
}