{
  "id": "tag:blogger.com,1999:blog-19803222.post-371457597389590987",
  "published": "2016-11-28T08:31:00.004-07:00",
  "updated": "2016-11-28T09:38:46.101-07:00",
  "title": "Workshops and mini-conferences",
  "content": "I've attended and organized two types of workshops in my time, one of which I'll call the ACL-style workshop (or \"mini-conference\"), the other of which I'll call the NIPS-style workshop (or \"actual workshop\"). Of course this is a continuum, and some workshops at NIPS are ACL-style and vice versa. As I've already given away with phrasing, I much prefer the NIPS style. Since many NLPers may never have been to NIPS or to a NIPS workshop, I'm going to try to describe the differences and explain my preference (and also highlight some difficulties).<br /><br />(Note: when I say ACL-style workshop, I'm <i>not</i> thinking of things like WMT that have effectively evolved into full-on co-located conferences.)<br /><br />To me, the key difference is whether the workshop is structured around invited talks, panels, discussion (NIPS-style) or around contributed, reviewed submissions (ACL-style).<br /><br />For example, Paul Mineiro, Amanda Stent, Jason Weston and I are organizing a workshop at NIPS this year on ML for dialogue systems, <a href=\"http://letsdiscussnips2016.weebly.com/\">Let's Discuss</a>. We have seven <i>amazing</i> <a href=\"http://letsdiscussnips2016.weebly.com/invited-speakers.html\">invited speakers</a>: Marco Baroni, Antoine Bordes, Nina Dethlefs, Raquel Fernández, Milica Gasic, Helen Hastie and Jason Williams. If you look at our <a href=\"http://letsdiscussnips2016.weebly.com/schedule.html\">schedule</a>, we have allocated 280 minutes to invited talks, 60 minutes to panel discussion, and 80 minutes to contributed papers. This is a quintessential NIPS-style workshop.<br /><br />For contrast, a standard ACL-style workshop might have one or two invited talks with the majority of the time spent on contributed (submitted/reviewed) papers.<br /><br />The difference in structure between NIPS-style and ACL-style workshops has some consequences:<br /><ul><li>Reviewing in the NIPS-style tends to be very light, often without a PC, and often just by the organizers.</li><li>NIPS-style contributed workshop papers tend to be shorter.</li><li>NIPS-style workshop papers are almost always non-archival.</li></ul>My personal experience is that NIPS-style workshops are a lot more fun. Contributed papers at ACL-style workshops are often those that might not cut it at the main conference. (Note: this isn't <i>always</i> the case, but it's common. It's also less often the case at workshops that represent topics that are not well represented at the main conference.) On the other hand, when you have seven invited speakers who are all experts in their field and were chosen by hand to represent a diversity of ideas, you get a much more intellectually invigorating experience.<br /><br />(Side note: my experience is that many many NIPS attendees only attend workshops and skip the main conferences; I've rarely heard of this happening at ACL. Yes, I could go get the statistics, but they'd be incomparable anyway because of time of year.)<br /><br />There are a few other effects that matter.<br /><br />The first is the archival-ness of ACL workshops which have proceedings that appear in the anthology:<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-G7d88-v5Soo/WDxLrYEzViI/AAAAAAAAAbc/aVETOaXJ-Kw9xLlLoZRzqBJBbjHb9DipACLcB/s1600/Screenshot%2Bfrom%2B2016-10-13%2B19-50-26.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"186\" src=\"https://4.bp.blogspot.com/-G7d88-v5Soo/WDxLrYEzViI/AAAAAAAAAbc/aVETOaXJ-Kw9xLlLoZRzqBJBbjHb9DipACLcB/s400/Screenshot%2Bfrom%2B2016-10-13%2B19-50-26.png\" width=\"400\" /></a></div>(This is from EACL, but it's the same rules across the board.) I personally believe it's absurd that workshop papers are considered archival but papers on arxiv are not. By forcing workshop papers to be archival, you run the significant risk of guaranteeing that many submissions are things that authors have given up on getting into the main conference, which can lead to a weaker program.<br /><br />A second issue has to do with reviewing. Unfortunately as of about three years ago, the ACL organizing committee almost guaranteed that ACL workshops have to be ACL-style and not NIPS-style (personally I believe this is massive bureaucratic overreaching and micromanaging):<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-6GJueVYgjM8/WDxMTKJ14JI/AAAAAAAAAbg/60qGP-fPuqwYfKdpfZtlxgZp_r5_hF3vwCLcB/s1600/Screenshot%2Bfrom%2B2016-10-15%2B13-30-41.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"255\" src=\"https://1.bp.blogspot.com/-6GJueVYgjM8/WDxMTKJ14JI/AAAAAAAAAbg/60qGP-fPuqwYfKdpfZtlxgZp_r5_hF3vwCLcB/s400/Screenshot%2Bfrom%2B2016-10-15%2B13-30-41.png\" width=\"400\" /></a></div>By forcing a program committee and reviewing, we're largely locked into the ACL-style workshop. Of course, some workshops ignore this and do more of a NIPS-style anyway, but IMO this should never have been a rule.<br /><br />One tricky issue with NIPS-style workshops is that, as I understand it, some students (and perhaps faculty/researchers) might be unable to secure travel funding to present at a non-archival workshop. I honestly have little idea how widespread this factor is, but if it's a big deal (e.g., perhaps in certain parts of the world) then it needs to be factored in as a cost.<br /><br />A second concern I have about NIPS-style workshops is making sure that they're inclusive. A significant failure mode is that of \"I'll just invite my friends.\" In order to prevent this outcome, the workshop organizers have to make sure that they work hard to find invited speakers who are not necessarily in their narrow social networks. Having a broader set of workshop organizers can help. I think that when NIPS-style workshops are proposed, they should be required to list potential invited speakers (even if these people have not yet been contacted) and a significant part of the review process should be to make sure that these lists represent a diversity of ideas and a diversity of backgrounds. In the best case, this can lead to a <i>more</i> inclusive program than ACL-style workshops (where basically you get whatever you get as submissions) but in the worst case it can be pretty horrible. There are lots of examples of pretty horrible at NIPS in the past few years.<br /><br />At any rate, these aren't easy choices, but my preference is strongly for the NIPS-style workshop. At the very least, I don't think that ACL should predetermine which type is allowed at its conferences.<br /><br /><br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "hal",
    "uri": "http://www.blogger.com/profile/02162908373916390369",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 5
}