{
  "title": "My top learning and pondering moments at Splunk .conf22",
  "link": "http://rocketdatascience.org/?p=1670",
  "comments": "http://rocketdatascience.org/?p=1670#respond",
  "dc:creator": "Kirk Borne",
  "pubDate": "Fri, 17 Jun 2022 19:45:26 +0000",
  "category": [
    "Analytics",
    "Big Data",
    "Internet of Things",
    "Products",
    "Data Science",
    "Machine Learning"
  ],
  "guid": "http://rocketdatascience.org/?p=1670",
  "description": "I recently attended the Splunk .conf22 conference. While the event was live in-person in Las Vegas, I attended virtually from my home office. Consequently I missed the incredible in-person experience of the brilliant speakers on the main stage, the technodazzle of 100&#8217;s of exhibitors&#8217; offerings in the exhibit arena, and the smooth hip hop sounds [&#8230;]",
  "content:encoded": "\n<p>I recently attended the <a rel=\"noreferrer noopener\" href=\"https://conf.splunk.com/\" target=\"_blank\">Splunk .conf22</a> conference. While the event was live in-person in Las Vegas, I attended virtually from my home office. Consequently I missed the incredible in-person experience of the brilliant speakers on the main stage, the technodazzle of 100&#8217;s of exhibitors&#8217; offerings in the exhibit arena, and the smooth hip hop sounds from the special guest entertainer — <a rel=\"noreferrer noopener\" href=\"https://conf.splunk.com/connect.html#evening-events\" target=\"_blank\">guess who</a>?</p>\n\n\n\n<p>What I missed in-person was more than compensated for by the incredible online presentations by <a rel=\"noreferrer noopener\" href=\"https://www.splunk.com/\" target=\"_blank\">Splunk </a>leaders, developers, and customers. If you have ever attended a major expo at one of the major Vegas hotels, you know that there is a lot of walking between different sessions &#8212; literally, miles of walking per day. That&#8217;s good for you, but it often means that you don&#8217;t attend all of the sessions that you would like because of the requisite rushing from venue to venue. None of that was necessary on the Splunk .conf22 virtual conference platform. I was able to see a lot, learn a lot, be impressed a lot, and ponder a lot about all of the wonderful features, functionalities, and future plans for the Splunk platform.</p>\n\n\n\n<p>One of the first major attractions for me to attend this event is found in the primary descriptor of the Splunk Platform — it is appropriately called the Splunk Observability Cloud, which includes an impressive suite of <a rel=\"noreferrer noopener\" href=\"https://www.splunk.com/en_us/products/observability.html\" target=\"_blank\">Observability and Monitoring products and services</a>. I have written and spoken frequently and passionately about Observability in the past couple of years. For example, I wrote this in 2021: </p>\n\n\n\n<blockquote class=\"wp-block-quote has-small-font-size\"><p><em>&#8220;Observability emerged as one of the hottest and (for me) most exciting developments of the year. Do not confuse observability with monitoring (specifically, with IT monitoring). The key difference is this: monitoring is what you do, and observability is why you do it. Observability is a business strategy: what you monitor, why you monitor it, what you intend to learn from it, how it will be used, and how it will contribute to business objectives and mission success. But the power, value, and imperative of observability does not stop there. Observability meets AI – it is part of the complete AIOps package: &#8216;keeping an eye on the AI.&#8217; Observability delivers actionable insights, context-enriched data sets, early warning alert generation, root cause visibility, active performance monitoring, predictive and prescriptive incident management, real-time operational deviation detection (6-Sigma never had it so good!), tight coupling of cyber-physical systems, digital twinning of almost anything in the enterprise, and more. And the goodness doesn’t stop there.&#8221;</em></p><cite>Continue reading my thoughts on Observability at <a href=\"http://rocketdatascience.org/?p=1589\" target=\"_blank\" rel=\"noreferrer noopener\">http://rocketdatascience.org/?p=1589</a></cite></blockquote>\n\n\n\n<p>The dominant references everywhere to <a rel=\"noreferrer noopener\" href=\"https://conf.splunk.com/sessions-virtual-amer.html?search=Observability\" target=\"_blank\">Observability</a> was just the start of awesome brain food offered at Splunk&#8217;s .conf22 event. Here is a list of my top moments, learnings, and musings from this year&#8217;s <a rel=\"noreferrer noopener\" href=\"https://conf.splunk.com/\" target=\"_blank\">Splunk .conf</a>: </p>\n\n\n\n<ol><li>Observability for Unified Security with AI (Artificial Intelligence) and Machine Learning on the Splunk platform empowers enterprises to operationalize data for use-case-specific functionality across shared datasets. (<a rel=\"noreferrer noopener\" href=\"https://splunk.com/en_us/blog/conf-splunklive/-conf22-bringing-the-power-of-unified-security-observability-to-customers.html\" target=\"_blank\">Reference</a>)</li><li>The latest updates to the Splunk platform address the complexities of multi-cloud and hybrid environments, enabling cybersecurity and network big data functions (e.g., log analytics and anomaly detection) across distributed data sources and diverse enterprise IT infrastructure resources. (<a rel=\"noreferrer noopener\" href=\"https://helpnetsecurity.com/2022/06/15/splunk-platform/\" target=\"_blank\">Reference</a>) </li><li>Splunk Enterprise 9.0 is here, now! Explore and test-drive it (with a free trial) <a rel=\"noreferrer noopener\" href=\"https://splunk.com/en_us/products/platform.html\" target=\"_blank\">here</a>.</li><li>The new Splunk Enterprise 9.0 release enables DevSecOps users to gain more insights from Observability data with Federated Search, with the ability to correlate ops with security alerts, and with Edge Management, all in one platform. (<a rel=\"noreferrer noopener\" href=\"https://techtarget.com/searchitoperations/news/252521589/Splunk-Enterprise-users-push-more-data-into-DevSecOps\" target=\"_blank\">Reference</a>) </li><li>Security information and event management (SIEM) on the Splunk platform is enhanced with end-to-end visibility and platform extensibility, with machine learning and automation (AIOps), with risk-based alerting, and with Federated Search (i.e., Observability on-demand). (<a rel=\"noreferrer noopener\" href=\"https://splunk.com/en_us/blog/security/risk-based-alerting-the-new-frontier-for-siem.html\" target=\"_blank\">Reference</a>) </li><li>Customer success story: As a customer-obsessed bank with ultra-rapid growth, <a rel=\"noreferrer noopener\" href=\"https://nubank.com.br/\" target=\"_blank\">Nubank</a> turned to Splunk to optimize data flows, analytics applications, customer support functions, and insights-obsessed IT monitoring. (<a rel=\"noreferrer noopener\" href=\"https://iqstock.news/n/splunk-helps-nubank-deliver-digital-banking-millions-4041041/\" target=\"_blank\">Reference</a>) </li><li>The key characteristics of the Splunk Observability Cloud are Resilience, Security, Scalability, and EXTENSIBILITY. The latter specifically refers to the ease in which developers can extend Splunk&#8217;s capabilities to other apps, applying their AIOps and DevSecOps best practices and principles! Developers can start <a rel=\"noreferrer noopener\" href=\"https://dev.splunk.com\" target=\"_blank\">here</a>.</li><li>The Splunk Observability Cloud has many functions for data-intensive IT, Security, and Network operations, including Anomaly Detection Service, Federated Search, Synthetic Monitoring, Incident Intelligence, and much more. Synthetic monitoring is essentially digital twinning of your network and IT environment, providing insights through simulated risks, attacks, and anomalies via predictive and prescriptive modeling. [<a rel=\"noreferrer noopener\" href=\"https://docs.splunk.com/Observability/get-started/welcome.html\" target=\"_blank\">Reference</a>] </li><li>Splunk Observability Cloud&#8217;s Federated Search capability activates search and analytics regardless of where your data lives — on-site, in the cloud, or from a third party. (<a rel=\"noreferrer noopener\" href=\"https://splunk.com/en_us/products/platform-federated-search-and-analytics.html\" target=\"_blank\">Reference</a>) </li><li>The new release of the Splunk Data Manager provides a simple, modern, automated experience of data ingest for Splunk Cloud admins, which reduces the time it takes to configure data collection (from hours/days to minutes). (<a rel=\"noreferrer noopener\" href=\"https://splunk.com/en_us/blog/platform/announcing-the-general-availability-of-data-manager.html\" target=\"_blank\">Reference</a>) </li><li>Splunk works on data, data, data, but the focus is always on customer, customer, customer — because delivering best outcomes for customers is job #1. Explore Splunk&#8217;s amazing Partner ecosystem (Partnerverse) and the impressive catalog of partners&#8217; solutions <a rel=\"noreferrer noopener\" href=\"https://partners.splunk.com/solutionscatalog/\" target=\"_blank\">here</a>. </li><li><a rel=\"noreferrer noopener\" href=\"https://www.splunk.com/en_us/newsroom/press-releases/2022/splunk-conf22-invites-organizations-to-unlock-innovation-with-data.html\" target=\"_blank\">Splunk .conf22 Invites Organizations to Unlock Innovation With Data</a>.</li></ol>\n\n\n\n<p>In summary, here is my list of key words and topics that illustrate the diverse capabilities and value-packed features of the Splunk Observability Cloud Platform that I learned about at the .conf22 event:</p>\n\n\n\n<p>&#8211; Anomaly Detection Assistant<br>&#8211; Risk-based Alerting (powered by AI and Machine Learning scoring algorithms)<br>&#8211; Federated Search (Observability on-demand)<br>&#8211; End-to-End Visibility<br>&#8211; Platform Extensibility<br>&#8211; Massive(!) Scalability of the Splunk Observability Cloud (to billions of transactions per day)<br>&#8211; Insights-obsessed Monitoring (&#8220;We don&#8217;t need more information. We need more insights.&#8221;)<br>&#8211; APIs in Action (to Turn Data into Doing<img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/2122.png\" alt=\"™\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" />)<br>&#8211; Splunk Incident Intelligence<br>&#8211; Synthetic Monitoring (Digital Twin of Network/IT infrastructure)<br>&#8211; Splunk Data Manager<br>&#8211; The Splunk Partner Universe (Partnerverse)</p>\n\n\n\n<p>My closing thought — Cybersecurity is basically Data Analytics: detection, prediction, prescription, and optimizing for unpredictability. This is what Splunk lives for!</p>\n\n\n\n<p>Follow me on LinkedIn <a rel=\"noreferrer noopener\" href=\"https://www.linkedin.com/in/kirkdborne/\" target=\"_blank\">here</a> and on Twitter at <a rel=\"noreferrer noopener\" href=\"https://twitter.com/kirkdborne\" target=\"_blank\">@KirkDBorne</a>.</p>\n\n\n\n<p>Disclaimer: I was compensated as an independent freelance media influencer for my participation at the conference and for this article. The opinions expressed here are entirely my own and do not represent those of Splunk or of any Splunk partners. Any misrepresentations of the products and services mentioned in my statements are entirely my own responsibility. Nothing here should be construed as an offer to sell or as financial advice of any kind. My comments are entirely of a technical nature, focused on the technical capabilities of the items mentioned in the article.<a href=\"\"></a></p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><a href=\"http://rocketdatascience.org/wp-content/uploads/2022/06/Splunk-dashboard2.webp\"><img loading=\"lazy\" width=\"2048\" height=\"1153\" src=\"http://rocketdatascience.org/wp-content/uploads/2022/06/Splunk-dashboard2.webp\" alt=\"\" class=\"wp-image-1695\"/></a><figcaption>Splunk Cloud Platform Dashboard. <br>Source: <a href=\"https://www.splunk.com/en_us/products/splunk-cloud-platform.html\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.splunk.com/en_us/products/splunk-cloud-platform.html</a></figcaption></figure></div>",
  "wfw:commentRss": "http://rocketdatascience.org/?feed=rss2&#038;p=1670",
  "slash:comments": 0
}