{
  "title": "RANSAC",
  "description": "<p>This post is about the popular outlier rejection algorithm RANSAC. It stands for RANdom SAmple Consensus. It is widely used in computer vision, with one of the application being in rejection of false feature matches in a pair of images from a stereo camera set.</p>\n\n<p>Suppose you have been given a dataset and you want to fit a mathematical model on it. We now assume that this data has certain <em>inliers</em> and some <em>outliers</em>. Inliers refer to the data points whose presence can be explained with the help of a mathematical model, while outliers are data points whose presence can never be explained via any reasonable mathematical model. Usually their presence in the dataset deteriorates the quality of the mathematical model that we can fit to the data. For best results, we should ignore these outliers while estimating the parameters of our mathematical model. RANSAC helps us in identifying these points so that we can obtain a better fir for the inliers.</p>\n\n<p>Note that even the inliers do not <em>exactly</em> fit the mathematical model as they might have some noise, but the outliers either have an extremely large amount of noise or they are obtained due to faults in measurement, or because of problems in the sensor from which we are obtaining the data.</p>\n\n<h2 id=\"the-algorithm\">The Algorithm</h2>\n\n<h3 id=\"the-input\">The Input</h3>\n<ul>\n  <li>Data points</li>\n  <li>Some parametrized model (we need to estimate the parameters for this model)</li>\n  <li>Some confidence parameters</li>\n</ul>\n\n<h3 id=\"algo\">Algo</h3>\n<ul>\n  <li>A set points from the original dataset are randomly selected, and are assumed to be the inliers.</li>\n  <li>Parameters are estimated to fit to this hypothetical inlier set.</li>\n  <li>Every point that was not a part of this hypothetical inlier set is tested against the mathematical model that we just fit.</li>\n  <li>The points that fit the model become a part of the <em>consensus</em> set. The model is good if a particular number of points have been classified as part of the consensus set.</li>\n  <li>This model is then re-estimated using all the members of a consensus set.</li>\n  <li>The above process is repeated a fixed number of times, and the model with the largest consensus set is kept.</li>\n</ul>\n\n<h3 id=\"how-many-times-do-we-repeat\">How many times do we repeat?</h3>\n<p>It is possible to theoretically determine the fixed number of iterations ‘k’ which are needed, if we have an estimate of the percentage of outliers present in the data.</p>",
  "pubDate": "Mon, 21 Jul 2014 00:00:00 +0000",
  "link": "https://avisingh599.github.io/stats/ransac/",
  "guid": "https://avisingh599.github.io/stats/ransac/"
}