{
  "id": "yt:video:GnfI6cGltwg",
  "yt:videoId": "GnfI6cGltwg",
  "yt:channelId": "UCNhX3WQEkraW3VHPyup8jkQ",
  "title": "CHILEAN Spanish and What Makes it Unique!",
  "link": "",
  "author": {
    "name": "Langfocus",
    "uri": "https://www.youtube.com/channel/UCNhX3WQEkraW3VHPyup8jkQ"
  },
  "published": "2021-12-04T15:20:56+00:00",
  "updated": "2022-06-02T05:38:24+00:00",
  "media:group": {
    "media:title": "CHILEAN Spanish and What Makes it Unique!",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "This video is all about the varieties of Spanish spoken in Chile, and their special features and influences. 🚩Learn Spanish with Spanishpod101: https://bit.ly/pod101spanish\n\nSpecial thanks to Javier Torres for his Chilean Spanish samples and work as a consultant on this video!\n\nAnd special thanks to all the amazing Langfocus Patreon supporters, including the following people:\n\nAmateurTextualCriticism, Andrew Doehler, Auguste Fields, Bennett Seacrist, Bill Walderman, Brian King, Bruce C, CFitz17, Colin Milner, Irina Bruce, Italy Made Easy, J Choi, Jacob Madsen, John Moffat, Karl-Erik Wångstedt, Kenny, Kirk Kirkpatrick, Michael Arbagi, Michael Cuomo, Michael J Synnott, Mody, Neil Sills, Nobbi Lampe-Strang, Paul Falstad, Rosalind Resnick, Ruben Sanchez Jr, ShadowCrossZero, Ulf Hermjakob, Victoria Goh, Vincent David, Walter Moore, Wolfgang Egon Schroder, Yuko Sunda, 19jks94, Abdullah Al-Kazaz, Adam Vanderpluym, Aitona Al Fung, Alana Kalinowski, Aleksei, Alen, Alex McKenzie, Ali Muhammed Alshehri, Alice, Amittai Aviram, Andrew Woods, Anthony Kinread, Anthony Peter Swallow, Aous Mansouri, Arnoud Hoorn, Ashley Dierolf, Avital Levant, Bartosz Czarnotta, Ben, Benjamin Tipton, Brent Warner, Brian Begnoche, Bruce Stark, Chelsea Boudreau, chris brown, Chris Shifman, Christian Langreiter, Christopher Lowell, contumacious, Culimancer, Cyrus Shahrivar, Daniel Young, Darek, David Eggleston, David Golub, David LeCount, Dean Cary, Debbie, Diana Fulger, Diane Young, DickyBoa, Dina Trageser, divad, Divadrax, Don Ross, Donald Tilley, Doug, Drew Gatewood, Edward Wilson, Elaine Salmon, Emilia Bruns, Eric Loewenthal, Eric Nutt, Fabio Martini, fatimahl, Fawad Quraishi, frederick shiels, G Bot, Grace Wagner, Grégoire Le Corre, Guillaume Brodar, Henrik Flyvbjerg, Herr K, Hila Ghebrehiwot, Howard Clark, Hugh AULT, Ihor Khodzhaniiazov, Ina Mwanda, James and Amanda Soderling, James Lillis, JAMES ORR, Jay Bernard, Jaye Ferrone, Jens Aksel Takle, Jesús Horacio Báez Ávila, \nJim McLaughlin, JL Bumgarner, Joe Dubya, Johannes, John E. McLaughlin, John Flanagan, John Gavin, John Hyaduck, John Lloyd, Josh Rotenberg, Julie Sriken, Kate MacDonald, Kimball Pierce, kingvaeonic, Konrad, Krzysztof  Dobrzanski, KW, Lance Bedasie, Laura Morland, Lee Dedmon, Leo Barudi, Lincoln Hutton, Lissette Talledo, Louie dela Fuente, Luke Jensen, maiku, Manuel Rosales, Margaret Langendorf, Margrét, Mark,  Mark Bonneaux, Mark Judge, Mark Kemp, Markzipan, Martin Blackwell, Melanie Falk, Merrick Bobb, Merrick Bobb, MH, Michael Regal, Mike Frysinger, Mike Smigielski, Mohammed A. Abahussain, Mário Pegado, Naama and Geoff Shang, Nicholas Gentry, Nicolas Elsishans, Niro, Oleksandr Ivanov, Ondra, Oto Kohulák, Patrick smith, Patriot Nurse, Paul Flynn, Paul Shutler, Paulla Fetzek, Peter Andersson, Peter Nikitin, Peter Scollar, piero, Pudim de Cana, Raymond Thomas, Richard Kelly, Robert Brockway, Robert Williams, Roger Smith, Roland Seuhs, Ronald Brady, Ryan Rubinstein, S. P., Sergio Pascalin, Sheila Perryman, Sierra Rooney,\nSigbjørn Nerland, Simon Blanchet, Simon Jaglom, sinastral, SJWS, Srga91, Stefan Reichenberger, Steven Severance, Suzanne Jacobs, Tara Pride, Theophagous, Thomas Chapel, Thomas Gijsbers, Tim Hopmann, tommy dahill, Tony DeSantis, Tumble Bug, Ty Ovendale, Vinicius Marchezini, \nVitor, Waltraud Seemann, Warren McKenzie, William MacKenzie, William O Beeman, Yagub Alserkal, Yeshar Hadi, Yuriy Vrublevskiy, Yuval Filmus, Zachary Root, zhangyimo, Éric Martin, Вайзефакнот, 洋平 木嶋.\n\n***Images***\nImages licensed from iStock.com and Shutterstock.com\n\nThe following images were used under Creative Commons Share Alike licenses:\n\nhttps://commons.wikimedia.org/wiki/File:Pueblos_indigenas_de_Chile.svg. CC SA 3 Unported license.\nAuthor: createaccount\n\nhttps://commons.wikimedia.org/wiki/File:Inca_Expansion.svg. CC SA 4 International license.\nAuthor: QQuantum\n\n***Music***\n\nOutro music: \"January Thirteenth\" by JCSD, licensed from Storyblocks.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}