{
  "id": "yt:video:rG6nzrksbPQ",
  "yt:videoId": "rG6nzrksbPQ",
  "yt:channelId": "UCAL3JXZSzSm8AlZyD3nQdBA",
  "title": "Primitive Technology: Pot Made of Wood Ash - New Clay Alternative",
  "link": "",
  "author": {
    "name": "Primitive Technology",
    "uri": "https://www.youtube.com/channel/UCAL3JXZSzSm8AlZyD3nQdBA"
  },
  "published": "2019-12-13T21:00:07+00:00",
  "updated": "2022-04-11T05:37:05+00:00",
  "media:group": {
    "media:title": "Primitive Technology: Pot Made of Wood Ash - New Clay Alternative",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Primitive Technology: Pot Made of Wood Ash - new clay alternative created by me.\nSubscribe: http://bit.ly/subPT | Never miss a video! Enable ‘ALL’ Notifications!\nI built a Brik Firing Kiln last time: https://youtube.com/watch?v=wrTDJbaxhOI&list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj\n\nFollow Primitive Technology:\nWordpress: https://primitivetechnology.wordpress.com/\nPatreon: https://patreon.com/user?u=2945881\n\nWatch More Primitive Technology:\nLatest Uploads: https://youtube.com/playlist?list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj&playnext=1\nPyrotechnology: https://youtube.com/playlist?list=PLGnWLXjIDnpBVRqu5lz5JGaQxjPs7q3CJ&playnext=1\nShelter: https://youtube.com/playlist?list=PLGnWLXjIDnpBBsdKZb-vy30o88SIxItp2&playnext=1\nWeapons: https://youtube.com/playlist?list=PLGnWLXjIDnpA-XGDrrmVgBnSXx15i2Awp&playnext=1\nPopular Videos: https://youtube.com/playlist?list=PLGnWLXjIDnpAb29Lrdki5BPjTpMon8zla&playnext=1\n\nAbout This Video:\nI invented method of making pots from wood ash instead of clay. The ash is mixed with water and formed into shape, left to set for 3-7 days and will then be water resistant like normal clay pottery. Unlike conventional clay pottery, no firing is required, the pot will set by itself in the air due to the high lime content of the ash. First the wood must be burned at a high temperature, well ventilated fire. The white ash is then mixed with water, molded into a pot using conventional pottery techniques and will then set due to the calcium oxide in the wood ash turning into calcium carbonate by absorbing carbon dioxide from the atmosphere. The pot can then optionally be polished with a smooth object such as a shell while it's semi dry to give it a shiny finish. The resultant pot was then put in water for 24 hours without dissolving. It then held water for another 24 hours though some of the water seeped out. It should make a good alternative to clay pottery if there are no sources of clay around. A brick was also made to test it's ability to form bricks. The ash brick also passed the water test after spending 24 hours in the creek without dissolving. \n\nAbout Primitive Technology:\nPrimitive technology is a hobby where you build things in the wild completely from scratch using no modern tools or materials. These are the strict rules: If you want a fire, use a fire stick - An axe, pick up a stone and shape it - A hut, build one from trees, mud, rocks etc. The challenge is seeing how far you can go without utilizing modern technology. I do not live in the wild, but enjoy building shelter, tools, and more, only utilizing natural materials. To find specific videos, visit my playlist tab for building videos focused on pyrotechnology, shelter, weapons, food & agriculture, tools & machines, and weaving & fiber.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}