{
  "title": "Housekeeper accuses Jeff Bezos of racism and mistreatment",
  "link": "https://www.rt.com/news/565864-housekeeper-sues-bezos-mistreatment-racism/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565864-housekeeper-sues-bezos-mistreatment-racism/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6363a88d2030274fcd71fcb8.jpg\" /> A housekeeper who worked for former Amazon CEO Jeff Bezos is suing her ex-boss over alleged mistreatment and racial discrimination <br/><a href=\"https://www.rt.com/news/565864-housekeeper-sues-bezos-mistreatment-racism/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>A former employee claims Hispanic staff were treated differently from white colleagues.</strong></p>\n            \n                        \n            <p>A woman who worked as a housekeeper for former Amazon CEO Jeff Bezos has filed a lawsuit against her ex-boss. The plaintiff, Mercedes Wedaa, claims she was forced to work long hours without meal breaks and was also discriminated against on the basis of her ethnicity.</p>\n<p>Wedaa lodged her complaint in a Seattle state court on Tuesday. She says she began working for the billionaire in September 2019 and spent nearly three years on the staff. She was put in charge of a team of five to six housekeepers.</p>\n<p>The former employee&nbsp;recounted having been repeatedly forced to work 10 to 14 hours a day without rest. Moreover, the housekeepers were allegedly denied access to a toilet in a nearby security room, which meant they had to climb out a window to reach another bathroom.</p>\n<p>According to the complaint, the plaintiff and other Hispanic employees were supposedly treated differently from Bezos&rsquo; white staff.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/63501a3e85f5405a2f7bf537.jpg\" alt=\"RT\" />\n            <figcaption><a href=\"https://www.rt.com/business/564980-bezos-dire-warning-us-economy/\">Bezos issues dire warning for US economy</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>At one point, a household manager even &ldquo;<em>became aggressive and abusive</em>&rdquo; with Wedaa, the woman claims. Wedaa was eventually terminated. She is seeking back pay and benefits, as well as damages.</p>\n<p>The plaintiff's lawyer, Patrick McGuigan, insisted that the US &ldquo;<em>labor and employment laws</em>&rdquo; clearly stipulate that employees &ldquo;<em>must be able to perform&hellip; work in a safe, sanitary and healthy workplace</em>.&rdquo;</p>\n<p>Harry Korrell, an attorney representing Bezos, meanwhile, argued that the claims made by Wedaa &ldquo;<em>have no merit,</em>&rdquo; and vowed to &ldquo;<em>defend</em> [his client] <em>against them.</em>&rdquo;</p>\n<p>Having founded Amazon back in 1994 as an online bookstore, over the years Bezos successfully branched out into several other areas of e-commerce, and later into retail. Amazon is now a multinational tech company on par with the likes of Alphabet, Apple, Meta, and Microsoft. Bloomberg and Forbes ranked Bezos as the world&rsquo;s wealthiest person from 2017 until 2021. Since then, however, he has slipped to fourth place, with a net worth of $115.6 billion.</p>\n<p>Meanwhile, the company has also received a lot of flak in recent years over its allegedly grueling and even unsafe workplace practices. Claims of racial discrimination have been made against Amazon as well.</p>\n<p>The tech giant has faced several lawsuits filed by current and former employees as a result.</p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 12:40:44 +0000",
  "dc:creator": "RT"
}