{
  "id": "https://bibleinoneyear.org/en/youth/278",
  "title": "Day 278: What Is the Meaning of Life?",
  "description": "Psalm 117:1–2, Jeremiah 10:2–5, Colossians 1:24–29.  Not only Mother Teresa and Billy Graham, but actors, scientists and the then Lord Chancellor  The Chief Cashier of the Bank of England, Graham Kentfield (whose signature was on every banknote at the time) said, ‘I am clear that the meaning of life can only be properly understood in the context of our *relationship with God*",
  "pubDate": "Wed, 05 Oct 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/278/",
  "itunes:duration": "13:11",
  "guid": "enyouth05102022-278",
  "length": 791.41,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 278: What Is the Meaning of Life?",
  "itunes:subtitle": "Psalm 117:1–2, Jeremiah 10:2–5, Colossians 1:24–29.  Not only Mother Teresa and Billy Graham, but actors, scientists and the then Lord Chancellor  The Chief Cashier of the Bank of England, Graham Kentfield (whose signature was on every banknote at the time) said, ‘I am clear that the meaning of life can only be properly understood in the context of our *relationship with God*",
  "itunes:summary": "Jonathan Gabay, a thirty-one-year-old professional writer, was facing employment challenges and stress when he hit rock bottom. He began to ask questions about the meaning of life. He wrote to people in all walks of life: world leaders, the homeless, Oscar-winning actors, philosophers, comedians, taxi-drivers, teachers, explorers and prisoners on death row. He even wrote to me!\nTo each one he asked, ‘What is the meaning of life?’ Gabay compiled a book of our responses, together with others who had attempted, over time, to answer this question. They include the following:\nRichard Nixon: ‘Life is one crisis after another.’\nJohn Lennon: ‘Life is what happens to you while you’re busy making other plans.’\nDennis the Menace: ‘Life is what you make it – and I can make it UNBEARABLE!’\nAlbert Einstein: ‘The man who regards his life and that of his fellow creatures as meaningless is not merely unhappy but hardly fit for life.’\nNumerous people replied that the meaning and purpose of life was to be found in Jesus Christ. Not only Mother Teresa and Billy Graham, but actors, scientists and the then Lord Chancellor. The Chief Cashier of the Bank of England, Graham Kentfield (whose signature was on every banknote at the time) said, ‘I am clear that the meaning of life can only be properly understood in the context of our relationship with God.’",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 643
}