{
  "id": "yt:video:KMV2tfPDDPM",
  "yt:videoId": "KMV2tfPDDPM",
  "yt:channelId": "UCAY_M9HyJb8oMKPV1utQQyA",
  "title": "The iPhone 14 launch and Gareth's leaving party | The LAST Noise Cancelling Podcast",
  "link": "",
  "author": {
    "name": "TechRadar",
    "uri": "https://www.youtube.com/channel/UCAY_M9HyJb8oMKPV1utQQyA"
  },
  "published": "2022-09-23T11:00:13+00:00",
  "updated": "2022-10-01T00:37:22+00:00",
  "media:group": {
    "media:title": "The iPhone 14 launch and Gareth's leaving party | The LAST Noise Cancelling Podcast",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Can't find the time to keep up with tech news? \nWe have you covered with the Noise Cancelling podcast, which is brought to you by TechRadar and our sister sites Laptop Mag and Tom's Guide.\n \nThis week’s show is presented by Gareth Beavis, Editor in Chief of TechRadar and Sherri L Smith, Editor in Chief of Laptop Mag!\n \nThis week our guest is Matt Phillips Senior Video Producer at TechRadar who join us (remotely, of course) to talk about the last seven days in tech.\n \nShow Headlines\n00:00 Start\n02:21 Big Question - The first tech we reviewed      \n18:31 iPhone 14 launch\n34:56 Reminiscing about bad tech events      \n40:59 Unpopular opinion    \n46:55 Bye bye\n \nLast week saw the launch of the iPhone 14 line-up and new Apple watches and so this week we are doing a huge Apple deep dive. Gareth and Sherri have both been using and reviewing the iPhone 14 Pro Max so let's see what they think!\n \nAfter more than 14 years at TechRadar this is Gareth's last week as Editor-and-Chief. But he didn't want to leave without bringing back the noise canceling podcast, one last time. We hope you enjoy this final episode, thanks for all the support. \n \nDon’t forget to head over to TechRadar.com, LaptopMag.com and Tomsguide.com to read more.\n \nMusic by Lee Rosevere - Thought Bubbles\nLicenses under Creative Commons Attribution 4.0 International - https://creativecommons.org/licenses/...",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}