{
  "title": "A Systematic Survey of Regularization and Normalization in GANs. (arXiv:2008.08930v7 [cs.LG] UPDATED)",
  "link": "http://arxiv.org/abs/2008.08930",
  "description": "<p>Generative Adversarial Networks (GANs) have been widely applied in different\nscenarios thanks to the development of deep neural networks. The original GAN\nwas proposed based on the non-parametric assumption of the infinite capacity of\nnetworks. However, it is still unknown whether GANs can fit the target\ndistribution without any prior information. Due to the overconfident\nassumption, many issues remain unaddressed in GANs' training, such as\nnon-convergence, mode collapses, gradient vanishing. Regularization and\nnormalization are common methods of introducing prior information to stabilize\ntraining and improve discrimination. Although a handful number of\nregularization and normalization methods have been proposed for GANs, to the\nbest of our knowledge, there exists no comprehensive survey that primarily\nfocuses on objectives and development of these methods, apart from some\nin-comprehensive and limited scope studies. In this work, we conduct a\ncomprehensive survey on the regularization and normalization techniques from\ndifferent perspectives of GANs training. First, we systematically describe\ndifferent perspectives of GANs training and thus obtain the different\nobjectives of regularization and normalization. Based on these objectives, we\npropose a new taxonomy. Furthermore, we compare the performance of the\nmainstream methods on different datasets and investigate the applications of\nregularization and normalization techniques that have been frequently employed\nin state-of-the-art GANs. Finally, we highlight potential future directions of\nresearch in this domain. Code and studies related to the regularization and\nnormalization of GANs in this work is summarized on\nhttps://github.com/iceli1007/GANs-Regularization-Review.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Li_Z/0/1/0/all/0/1\">Ziqiang Li</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Usman_M/0/1/0/all/0/1\">Muhammad Usman</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Tao_R/0/1/0/all/0/1\">Rentuo Tao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Xia_P/0/1/0/all/0/1\">Pengfei Xia</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_C/0/1/0/all/0/1\">Chaoyue Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chen_H/0/1/0/all/0/1\">Huanhuan Chen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Li_B/0/1/0/all/0/1\">Bin Li</a>"
}