{
  "title": "How Gen Z is fighting online misinformation in Asia-Pacific",
  "link": "https://blog.google/products/news/how-gen-z-is-fighting-online-misinformation-in-asia-pacific/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"denea\">Last week marked the UNESCO Global Media and Information Literacy Week— perfect timing for our recently concluded Google News Initiative (GNI) <a href=\"https://www.verificationchallenge.com/\">Youth Verification Challenge</a>.</p><p data-block-key=\"bi65d\">The Challenge is for those aged 15 to 24 across the Asia Pacific region, and presents teams with a series of tutorials and quizzes on identifying online misinformation. This year, over 4,000 participants from 28 countries took part, learning about fact-checking tools used in the real world. Each team had the chance to <a href=\"https://newsonair.withgoogle.com/events/youth-verification-challenge-en?tab=chapter1\">hone</a> their investigative skills and <a href=\"https://newsonair.withgoogle.com/events/youth-verification-challenge-en?tab=chapter2\">learn</a> from experts.</p><p data-block-key=\"a90sk\">We spoke with the winning team from India — made up of students Royal, Amitabh, and Rooka — about their thoughts on fact-checking. Royal attends the National Institute of Technology Karnataka, while Amitabh is a student at the Gaya College of Engineering, and Rooka studies at the Jawaharlal Nehru Technological University. Together they became the self-named team “Espionage Experts”, and experts they truly were! They had to solve more than 200 problems in order to win first place.</p><p data-block-key=\"daptv\"></p><p data-block-key=\"4a92\"><b>How can news be more engaging for a younger audience?</b></p><p data-block-key=\"emmge\">By providing a concise explanation of the story, news can definitely be enjoyable for younger audiences. Simple story formats, explainers and background context makes news easier to digest, but to truly engage younger audiences, media organizations need to consider more diverse points of view and experiment with different kinds of story-telling formats. They can give us a call if they want some tips!</p><p data-block-key=\"3krl7\"></p><p data-block-key=\"1vles\"><b>How aware do you think Gen Z is when it comes to online misinformation?</b></p><p data-block-key=\"cr13d\">We think the younger generation needs to be even more aware, as many people appear to be falling for misinformation online. Events like the Youth Verification Challenge are great initiatives that can be conducted to inform youths about how to discern true stories from misinformation in an engaging manner.</p><p data-block-key=\"fvagl\"></p><p data-block-key=\"biru1\"><b>Why do you think fact-checking is important?</b></p><p data-block-key=\"bc81h\">Fact-checking is very important in the present world. We believe that true stories should and must prevail. It is important for us to get into a habit of fact-checking, given the cognitive biases that make us (unfortunately) receptive to fake news. Fact-checking can help mitigate the threat that misinformation poses to factual accuracy.</p><p data-block-key=\"403j0\"></p><p data-block-key=\"89t1g\"><b>How will the team continue to bring fact-checking skills in their daily routine?</b></p><p data-block-key=\"c1q6l\">We are really passionate about sharing our experiences and the skills we picked up from the Youth Verification Challenge, and aspire to help our communities get better at fact-checking, too. Beyond encouraging people around us to use fact-checking tools like Google’s Fact Check Explorer, we will also focus on developing new skills to adapt to external trends in today’s digital world. The tools and strategies we use now will change when technology and the world of disinformation inevitably changes. Things are evolving fast and we all have to keep up!</p><p data-block-key=\"al071\"></p><p data-block-key=\"5itud\">Through the Youth Verification Challenge, we hope to keep encouraging younger internet users to fight misinformation as they equip themselves with the tools to approach the internet with confidence.</p></div></div></body></html>",
  "pubDate": "Fri, 04 Nov 2022 10:51:00 +0000",
  "guid": "https://blog.google/products/news/how-gen-z-is-fighting-online-misinformation-in-asia-pacific/",
  "category": [
    "Google News Initiative",
    "Google in Asia"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "How Gen Z is fighting online misinformation in Asia-Pacific",
    "description": "",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Screen_Shot_2022-11-04_at_10.53.12_AM.max-600x600.png",
    "site_name": "Google",
    "url": "https://blog.google/products/news/how-gen-z-is-fighting-online-misinformation-in-asia-pacific/"
  },
  "author": {
    "name": "Irene Liu",
    "title": "Head of APAC, News Lab",
    "department": "",
    "company": ""
  }
}