{
  "title": "Millionaire Thoughts on Buying Time",
  "link": "https://esimoney.com/millionaire-thoughts-on-buying-time/",
  "comments": "https://esimoney.com/millionaire-thoughts-on-buying-time/#comments",
  "dc:creator": "ESI",
  "pubDate": "Fri, 04 Nov 2022 09:00:16 +0000",
  "category": [
    "Books",
    "Save"
  ],
  "guid": "https://esimoney.com/?p=8747",
  "description": "<p>I&#8217;m in the middle of a series on the book Happy Money: The Science of Happier Spending. In the last post, we talked about being happier by buying time &#8212; basically trading money for time and avoiding unpleasant tasks by hiring someone to do them. We&#8217;ve discussed this issue quite a bit in the Millionaire [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://esimoney.com/millionaire-thoughts-on-buying-time/\">Millionaire Thoughts on Buying Time</a> appeared first on <a rel=\"nofollow\" href=\"https://esimoney.com\">ESI Money</a>.</p>\n",
  "content:encoded": "<p><a href=\"https://esimoney.com/wp-content/uploads/2022/05/Lawn-mower-grass-new.jpg\"><img class=\"alignleft size-medium wp-image-8748\" src=\"https://esimoney.com/wp-content/uploads/2022/05/Lawn-mower-grass-new-300x185.jpg\" alt=\"\" width=\"300\" height=\"185\" srcset=\"https://esimoney.com/wp-content/uploads/2022/05/Lawn-mower-grass-new-300x185.jpg 300w, https://esimoney.com/wp-content/uploads/2022/05/Lawn-mower-grass-new.jpg 750w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a>I&#8217;m in the middle of a series on the book <a href=\"https://amzn.to/3xYv1ft\">Happy Money: The Science of Happier Spending</a>.</p>\n<p>In the last post, we talked about <a href=\"https://esimoney.com/be-happier-by-buying-time/\">being happier by buying time</a> &#8212; basically trading money for time and avoiding unpleasant tasks by hiring someone to do them.</p>\n<p>We&#8217;ve discussed this issue quite a bit in the <a href=\"https://millionairemoneymentors.com/\">Millionaire Money Mentors</a> forums and I thought I&#8217;d share some of those comments with you today.</p>\n<p>As I&#8217;ve said previously, I wasn&#8217;t good at buying time for most of my life, which is something I would certainly focus on more if I could do it over again.</p>\n<p>For this post, I&#8217;ll simply share some highlights from the forums on this subject as I think several members and mentors have good perspectives and tips on buying back their time.</p>\n<p>Our discussion started with this post:</p>\n<p style=\"padding-left: 40px;\"><em><strong>Over the last couple of months I’ve been thinking about hiring a cleaning service, and more recently, maybe lawn care. With a toddler and a newborn, our hands are full, and it’d be nice to know that once a week a larger cleaning would occur, with us just doing the smaller ‘clean as you go’ type maintenance. Cleaning isn’t a task I add any value to, the best case scenario is things are the way they should be, nothing gets cleaner than clean.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>Hiring someone to do it hurts me on the inside, because it feels like it goes against the efforts I’ve been making over the last couple years to reduce ongoing costs. Why hire someone when I can do it myself? But if getting an hour back means I can generate another hour of income at a higher rate than what I’m paying, that should be a no-brainer, right? Hire out the low value tasks in life (not saying these tasks have no value, but the value I can personally add to it vs some else who can do it the same, or specializes in it and does it better), spend efforts on tasks with a higher return, or higher happiness like playing with the kids.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>Would really appreciate any thoughts or stories on how y’all approach this sort of stuff, why you do or don’t offload certain tasks to others, or what kind of work/tasks you’ve found most beneficial having someone else take over.</strong></em></p>\n<p>&#8220;Hiring someone to do it hurts me on the inside, because it feels like it goes against the efforts I’ve been making over the last couple years to reduce ongoing costs. Why hire someone when I can do it myself?&#8221; This was my line of thinking for most of my life. Hence I mowed the yard and shoveled snow (and there was a lot of snow in Michigan) and my wife cleaned the house for many, many years when we would have been better served (in hindsight) to hire those tasks out.</p>\n<p>Thankfully, this forums member is much wiser than I was.</p>\n<p>What followed were several comments back and forth, starting with this great advice from a mentor:</p>\n<p style=\"padding-left: 40px;\"><em><strong>Bottom line…if you don’t enjoy it and can afford to outsource it…then do it and if you are fortunate enough to be able to make more incremental income than a task costs to outsource than do it. Life is too short to be doing low value things you don’t want to especially if it is taking away from time with your family or things you enjoy.</strong></em></p>\n<p>There are two facts I didn&#8217;t think of in my younger days:</p>\n<ul>\n<li>Life is too short &#8212; I could have outsourced tasks and enjoyed that time in many different ways.</li>\n<li>I could have earned more &#8212; even if I didn&#8217;t enjoy the time I saved, I could have worked instead and likely made more than the cost of the service.</li>\n</ul>\n<p>Another mentor had similar thoughts:</p>\n<p style=\"padding-left: 40px;\"><em><strong>Pretty simple equation to me…if you can make more money NOT doing the task (or already have the NW) AND it’s not a task you enjoy, offload/outsource it.</strong></em></p>\n<p>Then a member shared a situation where they wished they had taken a different approach:</p>\n<p style=\"padding-left: 40px;\"><em><strong>I had this harebrained idea that we (wife and I) could paint the exterior of our house years ago. I bought the paint, scheduled the rental of the sprayer, and scheduled a week off work. I was filling in the cracks of the stucco and within an hour, my fingers were bleeding and I was less than 10% done with crack repair. I called a local painter and he came by and gave a quote that was about the same cost for us to do it. Plus, it probably saved a potential divorce situation…Ha ha.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>It took a crew of four, four days to do it. No way were we going to do it in 5 days. Plus, we saved money on the sprayer and returning the paint since he gets a contractor discount. We also saved our vacation time. That was my Ah Ha moment. My wife told me she was just waiting for me to wise up. Ha ha.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>Time is very valuable as we learn as we get older. We all have regrets on the time we lost that we can’t get back. Learn from us elders. ha ha.</strong></em></p>\n<p>Then I joined in with my own hard won lesson:</p>\n<p style=\"padding-left: 40px;\"><em><strong>Here’s an even more harebrained idea…</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>My wife bought 13 tons (yes, tons!) of rock a couple years ago and thought we could “save money” by hauling it from the front drive to the back yard.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>Do you know how heavy 13 tons is??? (I bet you do!) <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f642.png\" alt=\"🙂\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>It’s also about a bazillion wheelbarrows full of very heavy rock.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>Never doing that again…</strong></em></p>\n<p>From another member:</p>\n<p style=\"padding-left: 40px;\"><em><strong>I’m in a similar boat &#8211; young kids, work full time, spouse works full time, also have elder caregiving responsibilities. We do a cleaning service 2x/month, and we only do the top floor of the house. So, for ~$250/month I don’t have to do a bunch of stuff I hate very most (floors, toilets mainly). The amount of dread that resolves for me is well worth it for 3k/yr. We of course have to do all the routine cleaning in between. With small kids, I tell you what, that cleaner earns every cent.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>I’ve been considering adding some yard maintenance to our mix. Spending another 1k/yr for people to just come pull weeds a few times throughout the summer seems like a value add too. We’re trying to start a side hustle so time spent doing low wage or unliked chores is a barrier to our success. At least that&#8217;s how I’m justifying it to myself :).</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>I’ve grown to love our cleaning service so much that I’d give up my car and start doing uber only, I think, before I gave up the cleaner. Side bonus &#8211; the day before the cleaner comes is the 2x per month that nobody can argue about helping pick up and get the house ready &#8211; that alone is worth something!</strong></em></p>\n<p>And another:</p>\n<p style=\"padding-left: 40px;\"><em><strong>Personal experience, I hired the cleaning service. It still hurts occasionally, but I look at it this way. Annually, it costs me $2300 and saves me about 75 hours of my life. That’s nearly 2 weeks of work.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>Would you see value in lowering your salary by 2300 to get 2 additional weeks of vacation. I would make that trade any time, any day.</strong></em></p>\n<p>And another vote for going for it:</p>\n<p style=\"padding-left: 40px;\"><em><strong>Do it. Cleaning and lawn service are worth every penny, even if you don’t work those hours to theoretically make more than you are paying. Use the time for life experience points, and you will be so much better off.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>One other point I’ll make is that the cleaning thing was a huge friction point in the early years of my marriage (typically, as the guy my definition of clean had a lower bar than my dear wife’s) &#8211; so we have had a cleaning service since the kids were born almost 20 years ago and well before our NW was over 7 figures. Problem was solved, and I don’t regret that trade off one bit.</strong></em></p>\n<p>This one really saved some time &#8212; and the trade-off was well worth it:</p>\n<p style=\"padding-left: 40px;\"><em><strong>You won’t regret having someone else do the sucky stuff.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>I used to do all my own yard work and had the best equipment so that I could knock it out quickly. Then my dad needed help with his huge yard so I started cutting his too. Then my sister bought a house and didn’t have access to a mower and was broke all the time so I cut hers too. At my church we would have cleanup days but it seemed that most everyone had to “work” those Saturdays so my sons and I were the only ones cutting the grass/trimming the shrubs there. Oh yeah, I have a medical building that has lots of landscaping so that was on the rotation as well.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>After a few years of 6 hour Saturdays every other week from April to September I sold it all and hired out the house and practice landscaping. The amount I got from the equipment paid for 2-3 years of cuts and now I spend Saturdays working out and playing in the pool.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>We used a twice a month cleaner at the house for several years and it definitely helped around the edges. My wife and I were working long days at the practice and she was irritated with having to come home and cook and do laundry etc. We had a couple of really good years in a row so she talked me into hiring a full time housekeeper/cook/assistant. Was that the best thing that ever happened to us? No…but it has been pretty darn close!</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>She’s awesome! We come home from the office and dinner is on the table, the dry cleaning has been picked up and the packages mailed and the clean laundry folded and sitting in our respective closets. She does the grocery shopping and in the summertime makes sure the kids have food at lunch and even drives them around when needed. We have definitely become spoiled in that regard but my wife can see enough patients in an hour to cover that person’s entire paycheck for 2 weeks. Now we can come home and relax and enjoy dinner and our children.</strong></em></p>\n<p>Here&#8217;s a comment with some good guidance &#8212; and a GREAT point about employing others (something that&#8217;s not often considered but is valuable IMO):</p>\n<p style=\"padding-left: 40px;\"><em><strong>Do it yourself and continue to be as frugal as possible IF:</strong></em></p>\n<ul>\n<li><em><strong>you have credit card debt</strong></em></li>\n<li><em><strong>you don’t have adequate emergency savings</strong></em></li>\n<li><em><strong>you aren’t contributing at least 15% to retirement investments each year</strong></em></li>\n<li><em><strong>cash flow each month is super tight or negative</strong></em></li>\n</ul>\n<p style=\"padding-left: 40px;\"><em><strong>Otherwise, outsourcing home maintenance including cleaning would be near the top of my personal values list. Other things I added quickly to my budget once I achieved the above basic financial security included a fairly expensive gym membership, better flights when I traveled (direct, better times), a monthly massage membership, and a bigger clothing budget for my work wardrobe.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>It’s all about values, but TBH I’ve had a house cleaner since my mid-20s (when I got my first pet), well before I was a millionaire. I could afford it, but I struggled with the identity portion of it &#8211; being the kind of person who paid someone else to clean my very small condo when I was single and had plenty of free time and ability to do it myself. But I’ve never gone back and honestly I’d cut cable before I cut my house cleaner.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>Another factor for me that helped me rationalize it is that I’m giving this woman employment. She needs/wants a job and I need/want my house cleaned, and I pay her well. I have tipped from day one and also give her raises each year even though she’s never asked and also give holiday presents. She isn’t even that good a cleaner haha &#8211; but she’s better than what I would do!</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>Plus the impact on my marriage to avoid negotiating about who cleans the toilet is priceless.</strong></em></p>\n<p>And the comments kept going:</p>\n<p style=\"padding-left: 40px;\"><em><strong>When we were making way less combined than one of us makes today we hired a lawn service. We agreed that should there ever be a budget squeeze on us we would cut cable over the lawn service as we valued our time and maintenance of the property over entertainment. Since then we’ve added a cleaning service that comes once a month cutting our hours spent cleaning from 6-8 per week to 2-4 per week. Currently debating on adding a 2nd visit as the kids are bigger and the dirt seems to multiply with their growth and their friends who roam through our house.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>Two years ago we added a laundry service. The fact that half our weekly laundry now is shoved in a bag once a week and set on the porch on a Thursday and arrives Friday washed and folded (or on hangers if I tell them to) and can be in drawers and out of my life in minutes versus 2-3 hours for a wash/dry/fold cycle continues to make me happy. Now we do 1-2 loads during the week to wash mask, sports stuff and delicates, all manageable without having to declare a “laundry day”.</strong></em></p>\n<p>Here&#8217;s one with a focus on the difference kids make:</p>\n<p style=\"padding-left: 40px;\"><em><strong>My thoughts on this have changed and a lot of this had to do with having children. Before kids I did almost everything myself. I would paint my own rentals, fix stuff up, whatever it took. Now I find it way more efficient to hire a professional that can do it in a fraction of the time and also do it better than I can.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>I have also started to hire out a lot of the tasks in my business that I am not as skilled at and that don’t propel my business forward I love Upwork for this. Just creating marketing, spread sheets, or other things like that there are really talented people that can create things like that for me cheaper and faster than I ever could.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>Now this is not directed at anyone but I personally hate the saying “time is money.” To me that implies that I should always be out trading my time for money and anytime I am not doing that I am wasting time. I do trade my time for money currently but that&#8217;s what I am trying to get away from. I want to make money that&#8217;s not tied to my time. There are a lot of activities that I do with my time that do not have a ROI on them monetarily but in my opinion have far more value than making money.</strong></em></p>\n<p>Some good points there. I also employ several people with ESI Money and Millionaire Money Mentors as they can do things better/faster/simpler than I can.</p>\n<p>At this point in the conversation, I chimed in again:</p>\n<p style=\"padding-left: 40px;\"><em><strong>Just came upon these thoughts from the book <a href=\"https://esimoney.com/how-to-die-with-zero-introduction-and-rule-1/\">Die with Zero</a>:</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>The other big opportunity I see for creating a more balanced life is to exchange money for free time – a tactic that usually has the most impact in one’s middle year, when you have more money than time. The classic example is laundry, a time-consuming weekly chore that most people dread doing and that, in many places, can be done inexpensively by an outside service that specializes in it.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>The more money you have, the more you should be using this tactic, because your time is a lot more scarce and finite then your cash. I am constantly trading money back into time. I’ll never get more than 24 hours in a day, but I can do my utmost to free up as much of that finite time as I possibly can.</strong></em></p>\n<p>Then a member commented as follows:</p>\n<p style=\"padding-left: 40px;\"><em><strong>My wife and I have agreed that while we are both working and our kids are young, we will outsource as many household tasks as possible so that we can maximize our evenings and weekends. So we pay for lawn care and housekeeping. We also pay for someone to deal with laundry, plant watering, dishes, and other odd jobs around the house.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>I actually like manual labor…within reason (not 13 tons of rocks). It’s a welcome break from staring at a screen all day, and at some primal level I like working with my hands. But there are only so many hours in a day when you’ve subtracted working (your day job), eating, sleeping, child care, etc.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>Currently I’m debating whether to replace my entire back fence myself or hire it out. I’ve replaced a few sections myself, including jackhammering out the old posts. I don’t consider it “joyless”. But again, how many hours do I have? At this rate it will take months if not years…</strong></em></p>\n<p>I actually don&#8217;t mind some decent manual labor myself. I do still mow our yard, though it&#8217;s much smaller now than it has been at other homes. It takes me 15 minutes to do the back yard (my nice neighbor does our front yard because he&#8217;s a grass perfectionist and can do it better than I can &#8212; lol) and I get some steps in.</p>\n<p>I usually water the roses (front and back yard) when I mow as well.</p>\n<p>Here&#8217;s another perspective from a like-minded mower:</p>\n<p style=\"padding-left: 40px;\"><em><strong>So, I have a different perspective than what I have seen in the rest of this thread…</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>When I was a teen, I cut a LOT of lawns. It was more and easier money than what I made washing dishes in a bar by hand. When Mrs. McDuck and I bought our first personal residence I did the yard work myself for a couple of years, but then I got a big head and decided that I needed other people to start doing this manual labor for me because I could make more money in that time than I paid my landscaper. I outsourced my lawn care for probably 10 years after that.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>About 5 years ago I realized that I had been looking at things the wrong way. Yard work wasn’t a manual labor task that I needed to outsource. It was an opportunity for an extra workout, usually an extra cardio workout.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>I probably get enough total exercise already but nothing gets my heart rate up to a high sustained rate like pushing around my non-self propelled mower for an hour. Half the season I cut the grass once a week and half I cut it twice a week. It’s probably the best heart decision I’ve ever made.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>Trimming trees and bushes and pulling weeds feels like more work for me but the bending and stretching is good for me too.</strong></em></p>\n<p>The thread continues with a response to the mowing fan:</p>\n<p style=\"padding-left: 40px;\"><em><strong>Agree to some extent. I was having someone come in to mow the lawn (small lawn) several times a month and just realized it was costing me way more than I wanted to spend and it was on an already crappy lawn. Twice a month was $100 and then you add the tip each time on top of that. Went out and bought all of the equipment to do it myself and it all paid for itself in 4 months. Not for my time obviously but like you, it is now an opportunity for exercise. Now we actually have a nice lawn with new sod etc., but we still do the lawncare ourselves.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>However; anything beyond mowing the lawn, I’ll bring someone in to do because the humidity is just so miserable to work in. I grew up doing hard labor and I did a 130 foot French drain at one point last year with a bad hip (since replaced) and I will never do that again…lol. I could do it in what I consider normal temps but in heat…that’s for the birds.</strong></em></p>\n<p>Here&#8217;s another &#8212; with a new task outsourced:</p>\n<p style=\"padding-left: 40px;\"><em><strong>I can’t believe I am saying this, but we just got each of our cars fully detailed for the first time ever. At $400/each it wasn’t cheap (it&#8217;s a quality shop) but they spent a full 8 hours on each of them and did a far more thorough job than I would. That and the fact that I can’t even seem to bother washing or waxing them by myself anymore (which I used to enjoy) told me that I have probably reached the point in life where loosening up and paying someone to do this occasionally makes sense.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>BTW &#8211; the kids did a lot of damage to my 12 year old BMW interior (which is tan) and absolutely destroyed our light grey, 6 year old minivan interior. Fixing that and many years of salt buildup in the carpet were both major wins.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>Bottom line is that I make enough in a day to pay for both cars and have money left over but I still struggle(d) with offloading this work.</strong></em></p>\n<p>And a final comment:</p>\n<p style=\"padding-left: 40px;\"><em><strong>I formerly paid someone to cut my lawn. I didn’t hate doing it, but I hated the fact that it took 3+hours to complete the task. We paid someone else to do it for 3 years. Last year, after the 3rd person who took the work started to get more than moderately annoying, we decided to spend some money on a riding mower and bring the work back in house in a more manageable way. I still had to rake pine needles in my yard in the fall which was always a huge hassle even after paying someone. Hopefully I will need to do much less of that now.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>The first two people that did the work for us were very nice, but were less reliable than I needed. The lawn would go 2-3 weeks without being cut and start to get unruly. The last guy was a bit more reliable, but was a real nut job. He was calling and texting multiple times in a row if we didn’t answer immediately, told us long, pointless, and inappropriate personal stories, and then told my wife that she looked terrible and should try drinking more so she wasn’t miserable.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>Fun bonus, my daughter loves “her new tractor” and has cut the grass with me twice already! It now takes less than an hour (would be shorter if my daughter wasn’t on my lap and I could go faster, but I prefer this way), but I do have to take the clippings over to the municipal drop off site which adds another 20 minutes or so.</strong></em></p>\n<p>Ok, so maybe all those comments were a bit over-kill, but I wanted to hit this topic hard to make the following points:</p>\n<ul>\n<li>It&#8217;s ok to trade money for time by outsourcing unpleasant tasks. You can always get more money, but you can&#8217;t get more time.</li>\n<li>If you make more by outsourcing, that&#8217;s great. But you don&#8217;t have to &#8212; you can just enjoy life instead.</li>\n<li>There are a wide variety of things to outsource. Pick the ones (or them all) that you really dislike and get rid of those.</li>\n<li>You don&#8217;t have to wait until you are financially independent to outsource tasks. These are millionaires and members (most of whom are doing quite well themselves) and they are fine paying for these services.</li>\n<li>If it helps (and I think it&#8217;s a valid point), consider that you&#8217;re actually spreading your wealth around and helping someone else by employing them.</li>\n</ul>\n<p>Finally, <a href=\"https://spilledcoffee.substack.com/p/return-on-hassle?s=r\">here&#8217;s a list of things that could be outsourced from Spilled Coffee</a> (and a good article on this subject):</p>\n<ul>\n<li>Cleaning and laundry</li>\n<li>Mowing the lawn and shoveling snow</li>\n<li>Ordering something online that will arrive in a few days on your doorstep versus the time and cost of gas to drive somewhere to pick it up.</li>\n<li>Trips to the bank or post office</li>\n<li>Cleaning up and putting new mulch in your landscape.</li>\n<li>Spending the money and the minutes it takes to go through the car wash versus all the time of washing it yourself.</li>\n<li>Hiring a financial advisor instead of stressing and spending time handling all your own investments.</li>\n<li>Spending all the time researching investments versus just investing in index funds.</li>\n<li>Hiring an accountant to take care of your taxes versus trying to tackle them on your own.</li>\n<li>Hanging Christmas lights</li>\n<li>Managing physical rental properties versus just investing in REITs.</li>\n<li>Having food delivered versus getting in your car and driving to go pick up food to then just bring it back home.</li>\n</ul>\n<p>So&#8230;now it&#8217;s your turn. Anyone reading this outsource any (unpleasant) tasks? Let us know which ones in the comments below.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://esimoney.com/millionaire-thoughts-on-buying-time/\">Millionaire Thoughts on Buying Time</a> appeared first on <a rel=\"nofollow\" href=\"https://esimoney.com\">ESI Money</a>.</p>\n",
  "wfw:commentRss": "https://esimoney.com/millionaire-thoughts-on-buying-time/feed/",
  "slash:comments": 6
}