{
  "title": "Why Does the Media Continue to Mislead Americans About the Border?",
  "link": "https://www.heritage.org/immigration/commentary/why-does-the-media-continue-mislead-americans-about-the-border",
  "description": "<p>There’s a catastrophic crisis underway at our southwest border, a crisis that’s been raging since Joe Biden first took office and undid the Trump-era border security policies that I helped craft and implement.</p>\n\n<p>That crisis has been readily apparent to anyone willing to take off the political blinders and <a href=\"https://www.heritage.org/press/time-excuses-over-hold-them-accountable-mark-morgan-tom-homan-blast-new-september-fy2022\">just look at what’s happening</a>.</p>\n\n<p>Sadly, though, most of the political establishment in Washington, the coastal elites in their gated communities, and the open-borders bureaucracy have shown they are unwilling to do just that.</p>\n\n<p>And that includes most of the U.S. corporate media.</p>\n\n<p><strong>>>> <a href=\"https://www.heritage.org/biden-border-crisis\">The Biden Border Crisis</a></strong></p>\n\n<p>Some journalists have done exemplary work covering the border crisis for months—Bill Melugin and Griff Jenkins of Fox News, Townhall’s Julio Rosas, Jennie Taer of the Daily Caller, NewsNation’s Ali Bradley, and Newsmax’s Jaeson Jones all come to mind.</p>\n\n<p>For the most part, however, the media has not only largely ignored the border crisis, but has actively participated in the left’s campaign to mislead and deceive Americans about the scope, scale, and causes of the crisis.</p>\n\n<p>I experienced that deception firsthand last week.</p>\n\n<p>The Heritage Foundation, where I serve as a visiting fellow, was contacted by two reporters from the Arizona Republic—Rafael Carranza and Daniel Gonzalez—who wanted to speak with someone about the number of illegal aliens who have entered the United States since Joe Biden took office.</p>\n\n<p>The question has major public policy ramifications, particularly for Arizonans, who are seeing the crisis literally play out on their doorsteps.</p>\n\n<p>I happily agreed to the interview, and despite encountering everything from skepticism to fierce resistance to the case I made, I laid out in great detail the facts about who has entered this country under Joe Biden.</p>\n\n<p>In the end, the Arizona Republic published a piece that actively misleads its readers. Carranza, whose name appeared on the byline, first failed to accurately report <a href=\"https://www.cbp.gov/newsroom/stats/cbp-enforcement-statistics\">the number of individuals who have improperly entered</a> the country, <a href=\"https://www.azcentral.com/story/news/politics/elections/2022/10/21/us-mexico-border-security-immigration-issues-election-2022/10462644002/\">under-counting the right number</a> by more than half a million.</p>\n\n<p>Even more egregiously, he failed to make <i>any</i> mention of the massive number of “got-aways” who have illegally crossed into our country and never been apprehended by Border Patrol.</p>\n\n<p>Known got-aways, or those who Border Patrol knows come across the border because they’re caught on cameras, sensors, or even seen by agents, have totaled <a href=\"https://www.fairus.org/press-releases/border-security/fair-analysis-55-million-illegal-aliens-have-crossed-our-borders\">more than one million</a> since Joe Biden assumed office. And that number continues to grow as <a href=\"https://twitter.com/anna_giaritelli/status/1582068015809429504\">more and more agents are pulled off the frontline security mission</a> to process and release historic numbers of illegal aliens being detained.</p>\n\n<p>Border Patrol also knows that every month, a certain number of illegal aliens slip across the border and are never <a href=\"https://www.dhs.gov/sites/default/files/publications/immigration-statistics/BSMR/ndaa_border_security_metrics_report_fy_2019_0.pdf.pdf\">even tracked</a>. As someone who used to oversee the Border Patrol, I can tell you this number can be up to twice as many as the known got-aways. <a href=\"https://www.newsweek.com/record-number-suspected-terrorists-crossed-us-mexico-border-opinion-1754869\">That’s another 1-2 million unknown got-aways</a> under Biden, easily.</p>\n\n<p>Carranza included <i>none</i> of these figures, nor others I gave that added even more to the overall total.</p>\n\n<p>In doing so, he reported a conclusion about the number of improper border crossings that was inaccurate and misleading.</p>\n\n<p>The rest of the piece was a further attempt to downplay the crisis, or make excuses for why it’s occurring.</p>\n\n<p>He even went so far as to blame historic levels of apprehensions on repeat offenders (recidivists). The problem is that recidivism has always been tracked by CBP, not just the past 18 months. More importantly, whether it’s a first-time offender or someone crossing for the tenth time, that individual demands Border Patrol time and resources, and pulls more attention away from actual border security. The effect is the same.</p>\n\n<p>And we know the cartels are taking advantage of fewer agents on the line. We see the consequences in <a href=\"https://www.heritage.org/immigration/commentary/the-got-away-crisis-our-southern-border\">increasing numbers of got-aways and deadly narcotics flowing across the border</a>.</p>\n\n<p>One has to ask to all this dishonesty: Why? What agenda was he advancing that is more important than the truth? Why are so many in corporate media not only ignoring the crisis, but actively trying to deceive Americans when they do cover it? How did this piece make it past an editor?</p>\n\n<p><strong>>>> <a href=\"https://www.heritage.org/immigration/commentary/the-next-congress-should-impeach-dhs-secretary-alejandro-mayorkas\">The Next Congress Should Impeach DHS Secretary Alejandro Mayorkas</a></strong></p>\n\n<p>Incidents like this demonstrate why trust in corporate media is at <a href=\"https://news.gallup.com/poll/403166/americans-trust-media-remains-near-record-low.aspx\">all-time lows</a>. Instead of reporting the facts and letting Americans make up their own minds, they withhold vital information that would provide more context and clarity. They withhold the truth.</p>\n\n<p>And it’s the case across corporate media. Most of the time, these outlets <a href=\"https://www.washingtontimes.com/news/2022/jul/19/inside-beltway-year-media-silence/\">are content to simply ignore the crisis</a>, pretending it doesn’t exist. But when they weigh in, they either miss the truth or mislead.</p>\n\n<p>A recent <a href=\"https://www.latimes.com/opinion/story/2022-09-20/editorial-immigrants-flights-buses-political-posturing\">Los Angeles Times op-ed</a> asserted, “There is no question that there is a crisis at the border…But it is a humanitarian crisis exacerbated by political posturing, not one caused by an uncontrolled border.” A columnist for the Arizona Daily Star <a href=\"https://tucson.com/news/local/govt-and-politics/investigative-commentary-signs-show-border-panic-is-overblown-politically-motivated/article_e34e0904-2b8a-5dcb-a558-7000d7ac3748.html\">wrote about</a> the “five ways you can tell today’s border panic is trumped up.” And without any irony, apparently, a CNN “fact check” posited <a href=\"https://www.cnn.com/2021/08/10/politics/desantis-border-covid-fact-check/index.html\">in August 2021</a>, “While migrants continue to arrive at the U.S.-Mexico border in record numbers, it’s false to claim that the border is ‘open’…”</p>\n\n<p>Reporters may disagree with the vast majority of Americans who support secure borders and enforcing the law, but they’re not entitled to their own facts.</p>\n\n<p>Thankfully, Americans <i>are</i> entitled to increasingly tune them out.</p>",
  "pubDate": "Thu, 03 Nov 2022 10:19:15 -0400",
  "dc:creator": "Mark Morgan",
  "guid": "https://www.heritage.org/immigration/commentary/why-does-the-media-continue-mislead-americans-about-the-border"
}