{
  "title": "Fast Noise Removal in Hyperspectral Images via Representative Coefficient Total Variation. (arXiv:2211.01825v1 [cs.CV])",
  "link": "http://arxiv.org/abs/2211.01825",
  "description": "<p>Mining structural priors in data is a widely recognized technique for\nhyperspectral image (HSI) denoising tasks, whose typical ways include\nmodel-based methods and data-based methods. The model-based methods have good\ngeneralization ability, while the runtime cannot meet the fast processing\nrequirements of the practical situations due to the large size of an HSI data $\n\\mathbf{X} \\in \\mathbb{R}^{MN\\times B}$. For the data-based methods, they\nperform very fast on new test data once they have been trained. However, their\ngeneralization ability is always insufficient. In this paper, we propose a fast\nmodel-based HSI denoising approach. Specifically, we propose a novel\nregularizer named Representative Coefficient Total Variation (RCTV) to\nsimultaneously characterize the low rank and local smooth properties. The RCTV\nregularizer is proposed based on the observation that the representative\ncoefficient matrix $\\mathbf{U}\\in\\mathbb{R}^{MN\\times R} (R\\ll B)$ obtained by\northogonally transforming the original HSI $\\mathbf{X}$ can inherit the strong\nlocal-smooth prior of $\\mathbf{X}$. Since $R/B$ is very small, the HSI\ndenoising model based on the RCTV regularizer has lower time complexity.\nAdditionally, we find that the representative coefficient matrix $\\mathbf{U}$\nis robust to noise, and thus the RCTV regularizer can somewhat promote the\nrobustness of the HSI denoising model. Extensive experiments on mixed noise\nremoval demonstrate the superiority of the proposed method both in denoising\nperformance and denoising speed compared with other state-of-the-art methods.\nRemarkably, the denoising speed of our proposed method outperforms all the\nmodel-based techniques and is comparable with the deep learning-based\napproaches.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Peng_J/0/1/0/all/0/1\">Jiangjun Peng</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_H/0/1/0/all/0/1\">Hailin Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Cao_X/0/1/0/all/0/1\">Xiangyong Cao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liu_X/0/1/0/all/0/1\">Xinlin Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Rui_X/0/1/0/all/0/1\">Xiangyu Rui</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Meng_D/0/1/0/all/0/1\">Deyu Meng</a>"
}