{
  "title": "Episode 144: &#8220;Last Train to Clarksville&#8221; by the Monkees",
  "link": "https://500songs.com/podcast/episode-144-last-train-to-clarksville-by-the-monkees/",
  "pubDate": "Tue, 15 Feb 2022 02:40:14 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=1040",
  "description": "Episode 144 of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Last Train to Clarksville\" and the beginnings of the career of the Monkees, along with a short primer on the origins of the Vietnam War.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a seventeen-minute bonus episode available, on \"These Boots Are Made For Walking\" by Nancy Sinatra, which I mispronounce at the end of this episode as \"These Boots <em>Were</em> Made For Walking\", so no need to correct me here.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, all the songs excerpted in the podcast can be heard in full at <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-144-last-train-to-clarksville/\">Mixcloud</a>.\n\nThe best versions of the Monkees albums are the triple-CD super-deluxe versions that used to be available from monkees.com , and I've used Andrew Sandoval's liner notes for them extensively in this episode. Sadly, though, the only one of those that is still in print is <em>More of the Monkees</em>.\n\nFor those just getting into the group, my advice is to start with <a href=\"https://amzn.to/34ZGAGw\">this five-CD set</a>, which contains their first five albums along with bonus tracks.\n\nThe single biggest source of information I used in this episode is the first edition of Andrew Sandoval's <em>The Monkees; The Day-By-Day Story</em>. Sadly that is now out of print and goes for hundreds of pounds. Sandoval released a second edition of the book last year, which I was unfortunately unable to obtain, but that too is now out of print. If you can find a copy of either, do get one.\n\nOther sources used were <a href=\"https://amzn.to/3gI2yke\"><em>Monkee Business</em> by Eric Lefcowitz</a>, and the autobiographies of three of the band members and one of the songwriters -- <a href=\"https://amzn.to/34LJr6e\"><em>Infinite Tuesday</em></a> by Michael Nesmith, <a href=\"https://amzn.to/3uY3OI2\"><em>They Made a Monkee Out of Me</em></a> by Davy Jones, <a href=\"https://amzn.to/3uQANyc\"><em>I'm a Believer</em></a> by Micky Dolenz, and <em><a href=\"https://amzn.to/3gNZQtA\">Psychedelic Bubble-Gum</a> </em>by Bobby Hart.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWe've obviously talked in this podcast about several of the biggest hits of 1966 already, but we haven't mentioned the biggest hit of the year, one of the strangest records ever to make number one in the US -- \"The Ballad of the Green Berets\" by Sgt Barry Sadler:\n\n[Excerpt: Barry Sadler, \"The Ballad of the Green Berets\"]\n\nBarry Sadler was an altogether odd man, and just as a brief warning his story, which will last a minute or so, involves gun violence. At the time he wrote and recorded that song, he was on active duty in the military -- he was a combat medic who'd been fighting in the Vietnam War when he'd got a wound that had meant he had to be shipped back to the USA, and while at Fort Bragg he decided to write and record a song about his experiences, with the help of Robin Moore, a right-wing author of military books, both fiction and nonfiction, who wrote the books on which the films The Green Berets and The French Connection were based.\n\nSadler's record became one of those massive fluke hits, selling over nine million copies and getting him appearances on the Ed Sullivan Show, but other than one top thirty hit, he never had another hit single. Instead, he tried and failed to have a TV career, then became a writer of pulp fiction himself, writing a series of twenty-one novels about the centurion who thrust his spear into Jesus' side when Jesus was being crucified, and is thus cursed to be a soldier until the second coming.\n\nHe moved to Nashville, Tennessee, where he lived until he shot Lee Emerson, a country songwriter who had written songs for Marty Robbins, in the head, killing him, in an argument over a woman. He was sentenced to thirty days in jail for this misdemeanour, of which he served twenty-eight. Later he moved to Guatemala City, where he was himself shot in the head.\n\nThe nearest Army base to Nashville, where Sadler lived after his discharge, is Fort Campbell, in Clarksville:\n\n[Excerpt: The Monkees, \"Last Train to Clarksville\"]\n\nThe Vietnam War was a long and complicated war, one which affected nearly everything we're going to see in the next year or so of this podcast, and we're going to talk about it a lot, so it's worth giving a little bit of background here. In doing so, I'm going to use quite a flippant tone, but I want to make it clear that I'm not mocking the very real horrors that people suffered in the wars I'm talking about -- it's just that to sum up multiple decades of unimaginable horrors in a few sentences requires glossing over so much that you have to either laugh or cry.\n\nThe origin of the Vietnam War, as in so many things in twentieth century history, can be found in European colonialism. France had invaded much of Southeast Asia in the mid-to-late nineteenth century, and created a territory known as French Indo-China, which became part of the French colonial Empire. But in 1940 France was taken over by Germany, and Japan was at war with China. Germany and Japan were allies, and the Japanese were worried that French Indo-China would be used to import fuel and arms to China -- plus, they quite fancied the idea of having a Japanese empire. So Vichy France let Japan take control of French Indo-China.\n\nBut of course the *reason* that France had been taken over by Germany was that pretty much the whole world was at war in 1940, and obviously the countries that were fighting Germany and Japan -- the bloc led by Britain, soon to be joined by America and Russia -- weren't very keen on the idea of Japan getting more territory. But they were also busy with the whole \"fighting a world war\" thing, so they did what governments in this situation always do -- they funded local guerilla insurgent fighters on the basis that \"my enemy's enemy is my friend\", something that has luckily never had any negative consequences whatsoever, except for occasionally.\n\nThose local guerilla fighters were an anti-imperialist popular front, the Việt Minh, led by Hồ Chí Minh, a revolutionary Communist. They were dedicated to overthrowing foreign imperialist occupiers and gaining independence for Vietnam, and Hồ Chí Minh further wanted to establish a Soviet-style Communist government in the newly-independent country. The Allies funded the Việt Minh in their fight against the Japanese occupiers until the end of the Second World War, at which point France was liberated from German occupation, Vietnam was liberated from Japanese occupation, and the French basically said \"Hooray! We get our Empire back!\", to which Hồ Chí Minh's response was, more or less, \"what part of anti-imperialist Marxist dedicated to overthrowing foreign occupation of Vietnam did you not understand, exactly?\"\n\nObviously, the French weren't best pleased with this, and so began what was the first of a series of wars in the region. The First Indochina War lasted for years and ended in a negotiated peace of a sort. Of course, this led to the favoured tactic of the time, partition -- splitting a formerly-occupied country into two, at an arbitrary dividing line, a tactic which was notably successful in securing peace everywhere it was tried. Apart from Ireland, India, Korea, and a few other places, but surely it wouldn't be a problem in Vietnam, right?\n\nNorth Vietnam was controlled by the Communists, led by Hồ Chí Minh, and recognised by China and the USSR but not by the Western states. South Vietnam was nominally independent but led by the former puppet emperor who owed his position to France, soon replaced by a right-wing dictatorship. And both the right-wing dictatorship and the left-wing dictatorship were soon busily oppressing their own citizens and funding military opposition groups in the other country. This soon escalated into full-blown war, with the North backed by China and Russia and the South backed by America.\n\nThis was one of a whole series of wars in small countries which were really proxy wars between the two major powers, the USA and the USSR, both of which were vying for control, but which couldn't confront each other directly because either country had enough nuclear weapons to destroy the whole world multiple times over.\n\nBut the Vietnam War quickly became more than a small proxy war. The US started sending its own troops over, and more and more of them. The US had never ended the draft after World War II, and by the mid sixties significant numbers of young men were being called up and sent over to fight in a war that had by that point lasted a decade (depending on exactly when you count the war as starting from) between two countries they didn't care about, over things few of them understood, and at an exorbitant cost in lives.\n\nAs you might imagine, this started to become unpopular among those likely to be drafted, and as the people most affected (other, of course, than the Vietnamese people, whose opinions on being bombed and shot at by foreigners supporting one of other of the dictators vying to rule over them nobody else was much interested in) were also of the generation who were the main audience for popular music, slowly this started to seep into the lyrics of songs -- a seepage which had already been prompted by the appearance in the folk and soul worlds of many songs against other horrors, like segregation.\n\nThis started to hit the pop charts with songs like \"The Universal Soldier\" by Buffy Saint-Marie, which made the UK top five in a version by Donovan:\n\n[Excerpt: Donovan, \"The Universal Soldier\"]\n\nThat charted in the lower regions of the US charts, and a cover version by Glen Campbell did slightly better:\n\n[Excerpt: Glen Campbell, \"The Universal Soldier\"]\n\nThat was even though Campbell himself was a supporter of the war in Vietnam, and rather pro-military. Meanwhile, as we've seen a couple of times, Jan Berry of Jan and Dean recorded a pro-war answer song to that, \"The Universal Coward\":\n\n[Excerpt: Jan Berry, \"The Universal Coward\"]\n\nThis, of course, was even though Berry was himself avoiding the draft. And I've not been able to find the credits for that track, but Glen Campbell regularly played guitar on Berry's sessions, so it's entirely possible that he played guitar on that record made by a coward, attacking his own record, which he disagreed with, for its cowardice.\n\nThis is, of course, what happens when popular culture tries to engage with social and political issues -- pop culture is motivated by money, not ideological consistency, and so if there's money to be made from anti-war songs or from pro-war songs, someone will take that money.\n\nAnd so on October the ninth 1965, Billboard magazine ran a report:\n\n\"Colpix Enters Protest Field\n\nHOLLYWOOD -Colpix has secured its first protest lyric disk, \"The Willing Conscript,\"as General Manager Bud Katzel initiates relationships with independent producers. The single features Lauren St. Davis.\n\nKatzel says the song was written during the Civil War, rewritten during World War I and most recently updated by Bob Krasnow and Sam Ashe.\n\nScreen Gems Music, the company's publishing wing, is tracing the song's history, Katzel said.\n\nKatzel's second single is \"(You Got the Gamma Goochee\" by an artist with that unusual stage name. The record is a Screen Gems production and was in the house when Katzel arrived one month ago.\n\nThe executive said he was expressly looking for material for two contract artists, David Jones and Hoyt Axton. The company is also working on getting Axton a role in a television series, \"Camp Runamuck.\" \"\n\nTo unpack this a little, Colpix was a record label, owned by Columbia Pictures, and we talked about that a little bit in the episode on \"The Loco-Motion\" -- the film and TV companies were getting into music, and Columbia had recently bought up Don Kirshner's Aldon publishing and Dimension Records as part of their strategy of tying in music with their TV shows.\n\nThis is a company trying desperately to jump on a bandwagon -- Colpix at this time was not exactly having huge amounts of success with its records.\n\nHoyt Axton, meanwhile, was a successful country singer and songwriter. We met his mother many episodes back -- Mae Axton was the writer of \"Heartbreak Hotel\". Axton himself is now best known as the dad in the 80s film Gremlins. David Jones will be coming up shortly.\n\nBob Krasnow and Sam Ashe were record executives then at Kama Sutra records, but soon to move on -- we'll be hearing about Krasnow more in future episodes. Neither of them were songwriters, and while I have no real reason to disbelieve the claim that \"The Willing Conscript\" dates back to the Civil War, the earliest version *I* have been able to track down was its publication in issue 28 of Broadside Magazine in June 1963 -- nearly a hundred years after the American Civil War -- with the credit \"by Tom Paxton\" -- Paxton was a popular singer-songwriter of the time, and it certainly sounds like his writing. The first recording of it I know of was by Pete Seeger:\n\n[Excerpt: Pete Seeger, \"The Willing Conscript\"]\n\nBut the odd thing is that by the time this was printed, the single had already been released the previous month, and it was not released under the name Lauren St Davis, or under the title \"The Willing Conscript\" -- there are precisely two differences between the song copyrighted as by Krasnow and Ashe and the one copyrighted two years earlier as by Paxton. One is that verses three and four are swapped round, the other is that it's now titled \"The New Recruit\". And presumably because they realised that the pseudonym \"Lauren St. Davis\" was trying just a bit too hard to sound cool and drug culture, they reverted to another stage name the performer had been using, Michael Blessing:\n\n[Excerpt: Michael Blessing, \"The New Recruit\"]\n\nBlessing's name was actually Michael Nesmith, and before we go any further, yes his mother, Bette Nesmith Graham, did invent the product that later became marketed in the US as Liquid Paper. At this time, though, that company wasn't anywhere near as successful as it later became, and was still a tiny company. I only mention it to forestall the ten thousand comments and tweets I would otherwise get asking why I didn't mention it. In Nesmith's autobiography, while he talks a lot about his mother, he barely mentions her business and says he was uninterested in it -- he talks far more about the love of art she instilled in him, as well as her interest in the deep questions of philosophy and religion, to which in her case and his they found answers in Christian Science, but both were interested in conversations about ideas, in a way that few other people in Nesmith's early environment were.\n\nNesmith's mother was also responsible for his music career. He had spent two years in the Air Force in his late teens, and the year he got out, his mother and stepfather bought him a guitar for Christmas, after he was inspired by seeing Hoyt Axton performing live and thinking he could do that himself:\n\n[Excerpt: Hoyt Axton, \"Greenback Dollar\"]\n\nAs he put it in his autobiography, \"What did it matter that I couldn't play the guitar, couldn't sing very well, and didn't know any folk songs? I would be going to college and hanging out at the student union with pretty girls and singing folk songs. They would like me. I might even figure out a way to get a cool car.\"\n\nThis is, of course, the thought process that pretty much every young man to pick up a guitar goes through, but Nesmith was more dedicated than most. He gave his first performance as a folk singer ten days after he first got a guitar, after practising the few chords in most folk songs for twelve hours a day every day in that time.\n\nHe soon started performing as a folk singer, performing around Dallas both on his own and with his friend John London, performing the standard folk repertoire of Woody Guthrie and Lead Belly songs, things like \"Pick a Bale of Cotton\":\n\n[Excerpt: Michael Nesmith, \"Pick a Bale of Cotton\"]\n\nHe also started writing his own songs, and put out a vanity record of one of them in 1963:\n\n[Excerpt: Mike Nesmith, \"Wanderin'\"]\n\nLondon moved to California, and Nesmith soon followed, with his first wife Phyllis and their son Christian. There Nesmith and London had the good fortune to be neighbours with someone who was a business associate of Frankie Laine, and they were signed to Laine's management company as a folk duo.\n\nHowever, Nesmith's real love was rock and roll, especially the heavier R&B end of the genre -- he was particularly inspired by Bo Diddley, and would always credit seeing Diddley live as a teenager as being his biggest musical influence. Soon Nesmith and London had formed a folk-rock trio with their friend Bill Sleeper. As Mike & John & Bill, they put out a single, \"How Can You Kiss Me?\", written by Nesmith:\n\n[Excerpt: Mike & John & Bill, \"How Can You Kiss Me?\"]\n\nThey also recorded more of Nesmith's songs, like \"All the King's Horses\":\n\n[Excerpt: Mike & John & Bill, \"All the King's Horses\"]\n\nBut that was left unreleased, as Bill was drafted, and Nesmith and London soon found themselves in The Survivors, one of several big folk groups run by Randy Sparks, the founder of the New Christie Minstrels. Nesmith was also writing songs throughout 1964 and 1965, and a few of those songs would be recorded by other people in 1966, like \"Different Drum\", which was recorded by the bluegrass band The Greenbriar Boys:\n\n[Excerpt: The Greenbriar Boys, \"Different Drum\"]\n\nThat would more successfully be recorded by the Stone Poneys later of course. And Nesmith's \"Mary Mary\" was also picked up by the Paul Butterfield Blues Band:\n\n[Excerpt: The Paul Butterfield Blues Band, \"Mary Mary\"]\n\nBut while Nesmith had written these songs by late 1965, he wasn't able to record them himself. He was signed by Bob Krasnow, who insisted he change his name to Michael Blessing, and recorded two singles for Colpix -- \"The New Recruit\", which we heard earlier, and a version of Buffy Saint-Marie's \"Until It's Time For You To Go\", sung in a high tenor range very far from Nesmith's normal singing voice:\n\n[Excerpt: Michael Blessing, \"Until It's Time For You To Go\"]\n\nBut to my mind by far the best thing Nesmith recorded in this period is the unissued third Michael Blessing single, where Nesmith seems to have been given a chance to make the record he really wanted to make. The B-side, a version of Allen Toussaint's swamp-rocker \"Get Out of My Life, Woman\", is merely a quite good version of the song, but the A-side, a version of his idol Bo Diddley's classic \"Who Do You Love?\" is utterly extraordinary, and it's astonishing that it was never released at the time:\n\n[Excerpt: Michael Blessing, \"Who Do You Love?\"]\n\nBut the Michael Blessing records did no better than anything else Colpix were putting out. Indeed, the only record they got onto the hot one hundred at all in a three and a half year period was a single by one David Jones, which reached the heady heights of number ninety-eight:\n\n[Excerpt: David Jones, \"What Are We Going to Do?\"]\n\nJones had been brought up in extreme poverty in Openshaw in Manchester, but had been encouraged by his mother, who died when he was fourteen, to go into acting. He'd had a few parts on local radio, and had appeared as a child actor on TV shows made in Manchester, like appearing in the long-running soap opera Coronation Street (still on today) as Ena Sharples' grandson Colin:\n\n[Excerpt: Coronation St https://www.youtube.com/watch?v=5FDEvOs1imc , 13:30]\n\nHe also had small roles in Z-Cars and Bill Naughton's TV play \"June Evening\", and a larger role in Keith Waterhouse's radio play \"There is a Happy Land\". But when he left school, he decided he was going to become a jockey rather than an actor -- he was always athletic, he loved horses, and he was short -- I've seen his height variously cited as five foot three and five foot four. But it turned out that the owner of the stables in which he was training had showbusiness connections, and got him the audition that changed his life, for the part of the Artful Dodger in Lionel Bart's West End musical Oliver!\n\nWe've encountered Lionel Bart before a couple of times, but if you don't remember him, he was the songwriter who co-wrote Tommy Steele's hits, and who wrote \"Living Doll\" for Cliff Richard. He also discovered both Steele and Marty Wilde, and was one of the major figures in early British rock and roll.\n\nBut after the Tommy Steele records, he'd turned his attention to stage musicals, writing book, music, and lyrics for a string of hits, and more-or-less singlehandedly inventing the modern British stage musical form -- something Andrew Lloyd Webber, for example, always credits him with. Oliver!, based on Oliver Twist, was his biggest success, and they were looking for a new Artful Dodger. This was *the* best role for a teenage boy in the UK at the time -- later performers to take the role on the London stage include Steve Marriott and Phil Collins, both of whom we'll no doubt encounter in future episodes -- and Jones got the job, although they were a bit worried at first about his Manchester vowels. He assured them though that he could learn to do a Cockney accent, and they took him on.\n\nJones not having a natural Cockney accent ended up doing him the biggest favour of his career. While he could put on a relatively convincing one, he articulated quite carefully because it wasn't his natural accent. And so when the North American version found  in previews that their real Cockney Dodger wasn't being understood perfectly, the fake Cockney Jones was brought over to join the show on Broadway, and was there from opening night on.\n\nOn February the ninth, 1964, Jones found himself, as part of the Broadway cast of Oliver!, on the Ed Sullivan Show:\n\n[Excerpt: Davy Jones and Georgia Brown, \"I'd Do Anything\"]\n\nThat same night, there were some other British people, who got a little bit more attention than Jones did:\n\n[Excerpt: The Beatles, \"I Want to Hold Your Hand (live on Ed Sullivan)\"]\n\nDavy Jones wasn't a particular fan of pop music at that point, but he knew he liked what he saw, and he wanted some of the same reaction.\n\nShortly after this, Jones was picked up for management by Ward Sylvester, of Columbia Pictures, who was going to groom Jones for stardom. Jones continued in Oliver! for a while, and also had a brief run in a touring version of Pickwick, another musical based on a Dickens novel, this time starring Harry Secombe, the British comedian and singer who had made his name with the Goon Show. Jones' first single, \"Dream Girl\", came out in early 1965:\n\n[Excerpt: Davy Jones, \"Dream Girl\"]\n\nIt was unsuccessful, as was his one album, David Jones, which seemed to be aiming at the teen idol market, but failing miserably. The second single, \"What Are  We Going to Do?\" did make the very lowest regions of the Hot One Hundred, but the rest of the album was mostly attempts to sound a bit like Herman's Hermits -- a band whose lead singer, coincidentally, also came from Manchester, had appeared in Coronation Street, and was performing with a fake Cockney accent. Herman's Hermits had had a massive US hit with the old music hall song \"I'm Henry VIII I Am\":\n\n[Excerpt: Herman's Hermits, \"I'm Henry VIII I Am\"]\n\nSo of course Davy had his own old music-hall song, \"Any Old Iron\":\n\n[Excerpt: Davy Jones, \"Any Old Iron\"]\n\nAlso, the Turtles had recently had a hit with a folk-rock version of Dylan's \"It Ain't Me Babe\", and Davy cut his own version of their arrangement, in the one concession to rock music on the album:\n\n[Excerpt: Davy Jones, \"It Ain't Me Babe\"]\n\nThe album was, unsurprisingly, completely unsuccessful, but Ward Sylvester was not disheartened. He had the perfect job for a young British teen idol who could sing and act.\n\nThe Monkees was the brainchild of two young TV producers, Bob Rafelson and Bert Schneider, who had come up with the idea of doing a TV show very loosely based on the Beatles' film A Hard Day's Night (though Rafelson would later claim that he'd had the idea many years before A Hard Day's Night and was inspired by his youth touring with folk bands -- Schneider always admitted the true inspiration though). This was not a particularly original idea -- there were a whole bunch of people trying to make TV shows based in some way around bands. Jan and Dean were working on a possible TV series, there was talk of a TV series starring The Who, there was a Beatles cartoon series, Hanna-Barbera were working on a cartoon series about a band called The Bats, and there was even another show proposed to Screen Gems, Columbia's TV department, titled Liverpool USA, which was meant to star Davy Jones, another British performer, and two American musicians, and to have songs provided by Don Kirshner's songwriters.\n\nThat The Monkees, rather than these other series, was the one that made it to the TV (though obviously the Beatles cartoon series did too) is largely because Rafelson and Schneider's independent production company, Raybert, which they had started after leaving Screen Gems, was given two hundred and twenty-five thousand dollars to develop the series by their former colleague, Screen Gems' vice president in charge of programme development, the former child star Jackie Cooper.\n\nOf course, as well as being their former colleague, Cooper may have had some more incentive to give Bob Rafelson and Bert Schneider that money in that the head of Columbia Pictures, and thus Cooper's boss' boss, was one Abe Schneider.\n\nThe original idea for the show was to use the Lovin' Spoonful, but as we heard last week they weren't too keen, and it was quickly decided instead that the production team would put together a group of performers.\n\nDavy Jones was immediately attached to the project, although Rafelson was uncomfortable with Jones, thinking he wasn't as rock and roll as Rafelson was hoping for -- he later conceded, though, that Jones was absolutely right for the group.\n\nAs for everyone else, to start with Rafelson and Schneider placed an ad in a couple of the trade papers which read \"Madness!! Auditions Folk and Roll Musicians-Singers for acting roles in new TV series. Running parts for 4 insane boys ages 17-21. Want spirited Ben Frank's types. Have courage to work. Must come down for interview\"\n\nThere were a couple of dogwhistles in there, to appeal to the hip crowd -- Ben Frank's was a twenty-four-hour restaurant on the Sunset Strip, where people including Frank Zappa and Jim Morrison used to hang out, and which was very much associated with the freak scene we've looked at in episodes on Zappa and the Byrds. Meanwhile \"Must come down for interview\" was meant to emphasise that you couldn't actually be high when you turned up -- but you were expected to be the kind of person who would at least at some points have been high.\n\nA lot of people answered that ad -- including Paul Williams, Harry Nilsson, Van Dyke Parks, and many more we'll be seeing along the way. But oddly, the only person actually signed up for the show because of that ad was Michael Nesmith -- who was already signed to Colpix Records anyway. According to Davy Jones, who was sitting in at the auditions, Schneider and Rafelson were deliberately trying to disorient the auditioners with provocative behaviour like just ignoring them, to see how they'd react. Nesmith was completely unfazed by this, and apparently walked in wearing a  green wool hat and carrying a bag of laundry, saying that he needed to get this over with quickly so he could go and do his washing. John London, who came along to the audition as well, talked later about seeing Nesmith fill in a questionnaire that everyone had to fill in -- in a space asking about previous experience Nesmith just wrote \"Life\" and drew a big diagonal line across the rest of the page.\n\nThat attitude certainly comes across in Nesmith's screen test:\n\n[Excerpt: Michael Nesmith screen test]\n\nMeanwhile, Rafelson and Schneider were also scouring the clubs for performers who might be useful, and put together a shortlist of people including Jerry Yester and Chip Douglas of the Modern Folk Quartet, Bill Chadwick, who was in the Survivors with Nesmith and London, and one Micky Braddock, whose agent they got in touch with and who was soon signed up.\n\nBraddock was the stage name of Micky Dolenz, who soon reverted to his birth surname, and it's the name by which he went in his first bout of fame. Dolenz was the son of two moderately successful Hollywood actors, George Dolenz and Janelle Johnson, and their connections had led to Dolenz, as Braddock, getting the lead role in the 1958 TV series Circus Boy, about a child named Corky who works in a circus looking after an elephant after his parents, the Flying Falcons, were killed in a trapeze accident.\n\n[Excerpt: Circus Boy, \"I can't play a drum\"]\n\nOddly, one of the other people who had been considered for that role was Paul Williams, who was also considered for the Monkees but ultimately turned down, and would later write one of the Monkees' last singles.\n\nDolenz had had a few minor TV appearances after that series had ended, including a recurring role on Peyton Place, but he had also started to get interested in music. He'd performed a bit as a folk duo with his sister Coco, and had also been the lead singer of a band called Micky and the One-Nighters, who later changed their name to the Missing Links, who'd played mostly covers of Little Richard and Chuck Berry songs and later British Invasion hits.\n\nHe'd also recorded two tracks with Wrecking Crew backing, although neither track got released until after his later fame -- \"Don't Do It\":\n\n[Excerpt: Micky Dolenz, \"Don't Do It\"]\n\nand \"Huff Puff\":\n\n[Excerpt: Micky Dolenz, \"Huff Puff\"]\n\nDolenz had a great singing voice, an irrepressible personality, and plenty of TV experience. He was obviously in.\n\nRafelson and Schneider took quite a while whittling down the shortlist to the final four, and they *were* still considering people who'd applied through the ads. One they actually offered the role to was Stephen Stills, but he decided not to take the role. When he turned the role down, they asked if he knew anyone else who had a similar appearance to him, and as it happened he did.\n\nSteve Stills and Peter Tork had known of each other before they actually met on the streets of Greenwich Village -- the way they both told the story, on their first meeting they'd each approached the other and said \"You must be the guy everyone says looks like me!\"\n\nThe two had become fast friends, and had played around the Greenwich Village folk scene together for a while, before going their separate ways -- Stills moving to California while Tork joined another of those big folk ensembles of the New Christie Minstrels type, this one called the Phoenix Singers.\n\nTork had later moved to California himself, and reconnected with his old friend, and they had performed together for a while in a trio called the Buffalo Fish, with Tork playing various instruments, singing, and doing comedy bits.\n\nOddly, while Tork was the member of the Monkees with the most experience as a musician, he was the only one who hadn't made a record when the TV show was put together. But he was by far the most skilled instrumentalist of the group -- as distinct from best musician, a distinction Tork was always scrupulous about making -- and could play guitar, bass, and keyboards, all to a high standard -- and I've also seen him in more recent years play French horn live. His great love, though, was the banjo, and you can hear how he must have sounded on the Greenwich Village folk scene in his solo spots on Monkees shows, where he would show off his banjo skills:\n\n[Excerpt: Peter Tork, \"Cripple Creek\"]\n\nTork wouldn't get to use his instrumental skills much at first though, as most of the backing tracks for the group's records were going to be performed by other people. More impressive for the TV series producers was his gift for comedy, especially physical comedy -- having seen Tork perform live a few times, the only comparison I can make to his physical presence is to Harpo Marx, which is about as high a compliment as one can give.\n\nIndeed, Micky Dolenz has often pointed out that while there were intentional parallels to the Beatles in the casting of the group, the Marx Brothers are a far better parallel, and it's certainly easy to see Tork as Harpo, Dolenz as Chico, Nesmith as Groucho, and Jones as Zeppo. (This sounds like an insult to Jones, unless you're aware of how much the Marx Brothers films actually depended on Zeppo as the connective tissue between the more outrageous brothers and the more normal environment they were operating in, and how much the later films suffered for the lack of Zeppo).\n\nThe new cast worked well together, even though there were obvious disagreements between them right from the start. Dolenz, at least at this point, seems to have been the gel that held the four together -- he had the experience of being a child star in common with Jones, he was a habitue of the Sunset Strip clubs where Nesmith and Tork had been hanging out, and he had personality traits in common with all of them. Notably, in later years, Dolenz would do duo tours with each of his three bandmates without the participation of the others.\n\nThe others, though, didn't get on so well with each other. Jones and Tork seem to have got on OK, but they were very different people -- Jones was a showbiz entertainer, whose primary concern was that none of the other stars of the show be better looking than him, while Tork was later self-diagnosed as neurodivergent, a folkie proto-hippie who wanted to drift from town to town playing his banjo. Tork and Nesmith had similar backgrounds and attitudes in some respects -- and were united in their desire to have more musical input into the show than was originally intended -- but they were such different personalities in every aspect of their lives from their religious views to their politics to their taste in music they came into conflict. Nesmith would later say of Tork \"I never liked Peter, he never liked me. So we had an uneasy truce between the two of us. As clear as I could tell, among his peers he was very well liked. But we rarely had a civil word to say to each other\".\n\nNesmith also didn't get on well with Jones, both of them seeming to view themselves as the natural leader of the group, with all the clashes that entails.\n\nThe four Monkees were assigned instruments for their characters based not on instrumental skill, but on what suited their roles better. Jones was the teen idol character, so he was made the maraca-playing frontman who could dance without having to play an instrument, though Dolenz took far more of the lead vocals. Nesmith was made the guitarist, while Tork was put on bass, though Tork was by far the better guitarist of the two. And Dolenz was put on drums, even though he didn't play the drums -- Tork would always say later that if the roles had been allocated by actual playing ability, Jones would have been the drummer.\n\nDolenz did, though, become a good drummer, if a rather idiosyncratic one. Tork would later say \"Micky played the drums but Mike kept time, on that one record we all made, Headquarters. Mike was the timekeeper. I don't know that Micky relied on him but Mike had a much stronger sense of time. And Davy too, Davy has a much stronger sense of time. Micky played the drums like they were a musical instrument, as a colour. He played the drum colour.... as a band, there was a drummer and there was a timekeeper and they were different people.\"\n\nBut at first, while the group were practising their instruments so they could mime convincingly on the TV and make personal appearances, they didn't need to play on their records. Indeed, on the initial pilot, they didn't even sing -- the recordings had been made before the cast had been finalised:\n\n[Excerpt: Boyce & Hart, \"Monkees Theme (pilot version)\"]\n\nThe music was instead performed by two songwriters, Tommy Boyce and Bobby Hart, who would become hugely important in the Monkees project.\n\nBoyce and Hart were not the first choice for the project. Don Kirshner, the head of Screen Gems Music, had initially suggested Roger Atkins, a Brill Building songwriter working for his company, as the main songwriter for The Monkees. Atkins is best known for writing \"It's My Life\", a hit for the Animals:\n\n[Excerpt: The Animals, \"It's My Life\"]\n\nBut Atkins didn't work out, though he would collaborate later on one song with Nesmith, and reading between the lines, it seems that there was some corporate infighting going on, though I've not seen it stated in so many words. There seems to have been a turf war between Don Kirshner, the head of Screen Gems' music publishing, who was based in the Brill Building, and Lester Sill, the West Coast executive we've seen so many times before, the mentor to Leiber and Stoller, Duane Eddy, and Phil Spector, who was now the head of Screen Gems music on the West Coast. It also seems to be the case that none of the top Brill Building songwriters were all that keen on being involved at this point -- writing songs for an unsold TV pilot wasn't exactly a plum gig.\n\nSill ended up working closely with the TV people, and it seems to have been him who put forward Boyce and Hart, a songwriting team he was mentoring.\n\nBoyce and Hart had been working in the music industry for years, both together and separately, and had had some success, though they weren't one of the top-tier songwriting teams like Goffin and King. They'd both started as performers -- Boyce's first single, \"Betty Jean\", had come out in 1958:\n\n[Excerpt: Tommy Boyce, \"Betty Jean\"]\n\nAnd Hart's, \"Love Whatcha Doin' to Me\", under his birth name Robert Harshman, a year later:\n\n[Excerpt: Robert Harshman, \"Love Whatcha Doin' to Me\"]\n\nBoyce had been the first one to have real songwriting success, writing Fats Domino's top ten hit \"Be My Guest\" in 1959:\n\n[Excerpt: Fats Domino, \"Be My Guest\"]\n\nand cowriting two songs with singer Curtis Lee, both of which became singles produced by Phil Spector -- \"Under the Moon of Love\" and the top ten hit \"Pretty Little Angel Eyes\":\n\n[Excerpt: Curtis Lee, \"Pretty Little Angel Eyes\"]\n\nBoyce and Hart together, along with Wes Farrell, who had co-written \"Twist and Shout\" with Bert Berns, wrote \"Lazy Elsie Molly\" for Chubby Checker, and the number three hit \"Come a Little Bit Closer\" for Jay and the Americans:\n\n[Excerpt: Jay and the Americans, \"Come a Little Bit Closer\"]\n\nAt this point they were both working in the Brill Building, but then Boyce moved to the West Coast, where he was paired with Steve Venet, the brother of Nik Venet, and they co-wrote and produced \"Peaches and Cream\" for the Ikettes:\n\n[Excerpt: The Ikettes, \"Peaches and Cream\"]\n\nHart, meanwhile, was playing in the band of Teddy Randazzo, the accordion-playing singer who had appeared in The Girl Can't Help It, and with Randazzo and Bobby Weinstein he wrote \"Hurts So Bad\", which became a big hit for Little Anthony and the Imperials:\n\n[Excerpt: Little Anthony and the Imperials, \"Hurts So Bad\"]\n\nBut Hart soon moved over to the West Coast, where he joined his old partner Boyce, who had been busy writing TV themes with Venet for shows like \"Where the Action Is\". Hart soon replaced Venet in the team, and the two soon wrote what would become undoubtedly their most famous piece of music ever, a theme tune that generations of TV viewers would grow to remember:\n\n[Excerpt: \"Theme from Days of Our Lives\"]\n\nWell, what did you *think* I meant?\n\nYes, just as Davy Jones had starred in an early episode of Britain's longest-running soap opera, one that's still running today, so Boyce and Hart wrote the theme music for *America's* longest-running soap opera, which has been running every weekday since 1965, and has so far aired well in excess of fourteen thousand episodes.\n\nMeanwhile, Hart had started performing in a band called the Candy Store Prophets, with Larry Taylor  -- who we last saw with the Gamblers, playing on \"LSD-25\" and \"Moon Dawg\" -- on bass, Gerry McGee on guitar, and Billy Lewis on drums. It was this band that Boyce and Hart used -- augmented by session guitarists Wayne Erwin and Louie Shelton and Wrecking Crew percussionist Gene Estes on tambourine, plus Boyce and session singer Ron Hicklin on backing vocals, to record first the demos and then the actual tracks that would become the Monkees hits.\n\nThey had a couple of songs already that would be suitable for the pilot episode, but they needed something that would be usable as a theme song for the TV show. Boyce and Hart's usual working method was to write off another hit -- they'd try to replicate the hook or the feel or the basic sound of something that was already popular. In this case, they took inspiration from the song \"Catch Us If You Can\", the theme from the film that was the Dave Clark Five's attempt at their own A Hard Day's Night:\n\n[Excerpt: The Dave Clark Five, \"Catch Us If You Can\"]\n\nBoyce and Hart turned that idea into what would become the Monkees theme. We heard their performance of it earlier of course, but when the TV show finally came out, it was rerecorded with Dolenz singing:\n\n[Excerpt: The Monkees, \"Monkees Theme\"]\n\nFor a while, Boyce and Hart hoped that they would get to perform all the music for the TV show, and there was even apparently some vague talk of them being cast in it, but it was quickly decided that they would just be songwriters. Originally, the intent was that they wouldn't even produce the records, that instead the production would be done by a name producer. Micky Most, the Animals' producer, was sounded out for the role but wasn't interested. Snuff Garrett was brought in, but quickly discovered he didn't get on with the group at all -- in particular, they were all annoyed at the idea that Davy would be the sole lead vocalist, and the tracks Garrett cut with Davy on lead and the Wrecking Crew backing were scrapped.\n\nInstead, it was decided that Boyce and Hart would produce most of the tracks, initially with the help of the more experienced Jack Keller, and that they would only work with one Monkee at a time to minimise disruption -- usually Micky and sometimes Davy. These records would be made the same way as the demos had been, by the same set of musicians, just with one of the Monkees taking the lead.\n\nMeanwhile, as Nesmith was seriously interested in writing and production, and Rafelson and Schneider wanted to encourage the cast members, he was also assigned to write and produce songs for the show. Unlike Boyce and Hart, Nesmith wanted to use his bandmates' talents -- partly as a way of winning them over, as it was already becoming clear that the show would involve several competing factions. Nesmith's songs were mostly country-rock tracks that weren't considered suitable as singles, but they would be used on the TV show and as album tracks, and on Nesmith's songs Dolenz and Tork would sing backing vocals, and Tork would join the Wrecking Crew as an extra guitarist -- though he was well aware that his part on records like \"Sweet Young Thing\" wasn't strictly necessary when Glen Campbell, James Burton, Al Casey and Mike Deasy were also playing guitar:\n\n[Excerpt: The Monkees, \"Sweet Young Thing\"]\n\nThat track was written by Nesmith with Goffin and King, and there seems to have been some effort to pair Nesmith, early on, with more commercial songwriters, though this soon fell by the wayside and Nesmith was allowed to keep making his own idiosyncratic records off to the side while Boyce and Hart got on with making the more commercial records.\n\nThis was not, incidentally, something that most of the stars of the show objected to or even thought was a problem at the time. Tork was rather upset that he wasn't getting to have much involvement with the direction of the music, as he'd thought he was being employed as a musician, but Dolenz and Jones were actors first and foremost, while Nesmith was happily making his own tracks. They'd all known going in that most of the music for the show would be created by other people -- there were going to be two songs every episode, and there was no way that four people could write and record that much material themselves while also performing in a half-hour comedy show every week.\n\nAssuming, of course, that the show even aired. Initial audience response to the pilot was tepid at best, and it looked for a while like the show wasn't going to be green-lit. But Rafelson and Schneider -- and director James Frawley who played a crucial role in developing the show -- recut the pilot, cutting out one character altogether -- a manager who acted as an adult supervisor -- and adding in excerpts of the audition tapes, showing the real characters of some of the actors. As three of the four were playing characters loosely based on themselves -- Peter's \"dummy\" character wasn't anything like he was in real life, but was like the comedy character he'd developed in his folk-club performances -- this helped draw the audience in. It also, though, contributed to some line-blurring that became a problem.\n\nThe re-edited pilot was a success, and the series sold. Indeed, the new format for the series was a unique one that had never been done on TV before -- it was a sitcom about four young men living together, without any older adult supervision, getting into improbable adventures, and with one or two semi-improvised \"romps\", inspired by silent slapstick, over which played original songs. This became strangely influential in British sitcom when the series came out over here  -- two of the most important sitcoms of the next couple of decades, The Goodies and The Young Ones, are very clearly influenced by the Monkees.\n\nAnd before the broadcast of the first episode, they were going to release a single to promote it. The song chosen as the first single was one Boyce and Hart had written, inspired by the Beatles. Specifically inspired by this:\n\n[Excerpt: The Beatles, \"Paperback Writer\"]\n\nHart heard that tag on the radio, and thought that the Beatles were singing \"take the last train\". When he heard the song again the next day and realised that the song had nothing to do with trains, he and Boyce sat down and wrote their own song inspired by his mishearing. \"Last Train to Clarksville\" is structured very, very, similarly to \"Paperback Writer\" -- both of them stay on one chord, a G7, for an eight-bar verse before changing to C7 for a chorus line -- the word \"writer\" for the Beatles, the \"no no no\" (inspired by the Beatles \"yeah yeah yeah\") for the Monkees.\n\nTo show how close the parallels are, I've sped up the vocals from the Beatles track slightly to match the tempo with a karaoke backing track version of \"Last Train to Clarksville\" I found, and put the two together:\n\n[Excerpt: \"Paperback Clarksville\"]\n\nLyrically, there was one inspiration I will talk about in a minute, but I think I've identified another inspiration that nobody has ever mentioned. The classic country song \"Night Train to Memphis\", co-written by Owen Bradley, and made famous by Roy Acuff, has some slight melodic similarity to \"Last Train to Clarksville\", and parallels the lyrics fairly closely -- \"take the night train to Memphis\" against \"take the last train to Clarksville\", both towns in Tennessee, and \"when you arrive at the station, I'll be right there to meet you I'll be right there to greet you, So don't turn down my invitation\" is clearly close to \"and I'll meet you at the station, you can be here by 4:30 'cos I've made your reservation\":\n\n[Excerpt: Roy Acuff, \"Night Train to Memphis\"]\n\nInterestingly, in May 1966, the same month that \"Paperback Writer\" was released, and so presumably the time that Hart heard the song on the radio for the first time, Rick Nelson, the teen idol formerly known as Ricky Nelson, who had started his own career as a performer in a sitcom, had released an album called Bright Lights and Country Music. He'd had a bit of a career downslump and was changing musical direction, and recording country songs. The last track on that album was a version of \"Night Train to Memphis\":\n\n[Excerpt: Rick Nelson, \"Night Train to Memphis\"]\n\nNow, I've never seen either Boyce or Hart ever mention even hearing that song, it's pure speculation on my part that there's any connection there at all, but I thought the similarity worth mentioning.\n\nThe idea of the lyric, though, was to make a very mild statement about the Vietnam War. Clarksville was, as mentioned earlier, the site of Fort Campbell, a military training base, and they crafted a story about a young soldier being shipped off to war, calling his girlfriend to come and see him for one last night. This is left more-or-less ambiguous -- this was a song being written for a TV show intended for children, after all -- but it's still very clear on the line \"and I don't know if I'm ever coming home\".\n\nNow, Boyce and Hart were songwriters first and foremost, and as producers they were quite hands-off and would let the musicians shape the arrangements. They knew they wanted a guitar riff in the style of the Beatles' recent singles, and Louie Shelton came up with one based around the G7 chord that forms the basis of the song, starting with an octave leap:\n\nShelton's riff became the hook that drove the record, and engineer Dave Hassinger added the final touch, manually raising the volume on the hi-hat mic for a fraction of a second every bar, creating a drum sound like a hissing steam brake:\n\n[Excerpt: The Monkees, \"Last Train to Clarksville\"]\n\nNow all that was needed was to get the lead vocals down. But Micky Dolenz was tired, and hungry, and overworked -- both Dolenz and Jones in their separate autobiographies talk about how it was normal for them to only get three hours' sleep a night between working twelve hour days filming the series, three-hour recording sessions, and publicity commitments. He got the verses down fine, but he just couldn't sing the middle eight. Boyce and Hart had written a complicated, multisyllabic, patter bridge, and he just couldn't get his tongue around that many syllables when he was that tired. He eventually asked if he could just sing \"do do do\" instead of the words, and the producers agreed. Surprisingly, it worked:\n\n[Excerpt: The Monkees, \"Last Train to Clarksville\"]\n\n\"Last Train to Clarksville\" was released in advance of the TV series, on a new label, Colgems, set up especially for the Monkees to replace Colpix, with a better distribution deal, and it went to number one. The TV show started out with mediocre ratings, but soon that too became a hit. And so did the first album released from the TV series. And that album was where some of the problems really started.\n\nThe album itself was fine -- ten tracks produced by Boyce and Hart with the Candy Store Prophets playing and either Micky or Davy singing, mostly songs Boyce and Hart wrote, with a couple of numbers by Goffin and King and other Kirshner staff songwriters, plus two songs produced by Nesmith with the Wrecking Crew, and with token participation from Tork and Dolenz.\n\nThe problem was the back cover, which gave little potted descriptions of each of them, with their height, eye colour, and so on. And under three of them it said \"plays guitar and sings\", while under Dolenz it said \"plays drums and sings\".\n\nNow this was technically accurate -- they all did play those instruments. They just didn't play them on the record, which was clearly the impression the cover was intended to give. Nesmith in particular was incandescent. He believed that people watching the TV show understood that the group weren't really performing that music, any more than Adam West was really fighting crime or William Shatner travelling through space. But crediting them on the record was, he felt, crossing a line into something close to con artistry.\n\nTo make matters worse, success was bringing more people trying to have a say. Where before, the Monkees had been an irrelevance, left to a couple of B-list producer-songwriters on the West Coast, now they were a guaranteed hit factory, and every songwriter working for Kirshner wanted to write and produce for them -- which made sense because of the sheer quantity of material they needed for the TV show, but it made for a bigger, less democratic, organisation -- one in which Kirshner was suddenly in far more control.\n\nSuddenly as well as Boyce and Hart with the Candy Store Prophets and Nesmith with the Wrecking Crew, both of whom had been operating without much oversight from Kirshner, there were a bunch of tracks being cut on the East Coast by songwriting and production teams like Goffin and King, and Neil Sedaka and Carole Bayer.\n\nOn the second Monkees album, released only a few months after the first, there were nine producers credited -- as well as Boyce, Hart, Jack Keller, and Nesmith, there were now also Goffin, King, Sedaka, Bayer, and Jeff Barry, who as well as cutting tracks on the east coast was also flying over to the West Coast, cutting more tracks with the Wrecking Crew, and producing vocal sessions while there.\n\nAs well as producing songs he'd written himself, Barry was also supervising songs written by other people. One of those was a new songwriter he'd recently discovered and been co-producing for Bang Records, Neil Diamond, who had just had a big hit of his own with \"Cherry Cherry\":\n\n[Excerpt: Neil Diamond, \"Cherry Cherry\"]\n\nDiamond was signed with Screen Gems, and had written a song which Barry thought would be perfect for the Monkees, an uptempo song called \"I'm a Believer\", which he'd demoed with the regular Bang musicians -- top East Coast session players like Al Gorgoni, the guitarist who'd played on \"The Sound of Silence\":\n\n[Excerpt: Neil Diamond, \"I'm a Believer\"]\n\nBarry had cut a backing track for the Monkees using those same musicians, including Diamond on acoustic guitar, and brought it over to LA. And that track would indirectly lead to the first big crisis for the group.\n\nBarry, unlike Boyce and Hart, was interested in working with the whole group, and played all of them the backing track. Nesmith's reaction was a blunt \"I'm a producer too, and that ain't no hit\". He liked the song -- he wanted to have a go at producing a track on it himself, as it happened -- but he didn't think the backing track worked.\n\nBarry, trying to lighten the mood, joked that it wasn't finished and you needed to imagine it with strings and horns. Unfortunately, Nesmith didn't get that he was joking, and started talking about how that might indeed make a difference -- at which point everyone laughed and Nesmith took it badly -- his relationship with Barry quickly soured.\n\nNesmith was getting increasingly dissatisfied with the way his songs and his productions were being sidelined, and was generally getting unhappy, and Tork was wanting more musical input too. They'd been talking with Rafelson and Schneider, who'd agreed that the group were now good enough on their instruments that they could start recording some tracks by themselves, an idea which Kirshner loathed. But for now they were recording Neil Diamond's song to Jeff Barry's backing track.\n\nGiven that Nesmith liked the song, and given that he had some slight vocal resemblance to Diamond, the group suggested that Nesmith be given the lead vocal, and Kirshner and Barry agreed, although Kirshner at least apparently always intended for Dolenz to sing lead, and was just trying to pacify Nesmith.\n\nIn the studio, Kirshner kept criticising Nesmith's vocal, and telling him he was doing it wrong, until eventually he stormed out, and Kirshner got what he wanted -- another Monkees hit with Micky Dolenz on lead, though this time it did at least have Jones and Tork on backing vocals:\n\n[Excerpt: The Monkees, \"I'm a Believer\"]\n\nThat was released on November 23rd, 1966, as their second single, and became their second number one. And in January 1967, the group's second album, More of the Monkees, was released. That too went to number one.\n\nThere was only one problem. The group weren't even told about the album coming out beforehand -- they had to buy their own copies from a record shop to even see what tracks were on it. Nesmith had his two tracks, but even Boyce and Hart were only given two, with the rest of the album being made up of tracks from the Brill Building songwriters Kirshner preferred. Lots of great Nesmith and Boyce and Hart tracks were left off the album in favour of some astonishingly weak material, including the two worst tracks the group ever recorded, \"The Day We Fall in Love\" and \"Laugh\", and a novelty song they found embarrassing, \"Your Auntie Grizelda\", included to give Tork a vocal spot.\n\nNesmith called it \"probably the worst album in the history of the world\", though in truth seven of the twelve tracks are really very strong, though some of the other material is pretty poor. The group were also annoyed by the packaging. The liner notes were by Don Kirshner, and read to the group at least like a celebration of Kirshner himself as the one person responsible for everything on the record. Even the photo was an embarrassment -- the group had taken a series of photos in clothes from the department store J. C. Penney as part of an advertising campaign, and the group thought the clothes were ridiculous, but one of those photos was the one chosen for the cover.\n\nNesmith and Tork made a decision, which the other two agreed to with varying degrees of willingness. They'd been fine miming to other people's records when it was clearly just for a TV show. But if they were being promoted as a real band, and having to go on tour promoting albums credited to them, they were going to *be* a real band, and take some responsibility for the music that was being put out in their name.  With the support of Rafelson and Schneider, they started making preparations to do just that.\n\nBut Don Kirshner had other ideas, and told them so in no uncertain terms. As far as he was concerned, they were a bunch of ungrateful, spoiled, kids who were very happy cashing the ridiculously large cheques they were getting, but now wanted to kill the goose that laid the golden egg. They were going to keep doing what they were told.\n\nThings came to a head in a business meeting in January 1967, when Nesmith gave an ultimatum. Either the group got to start playing on their own records, or he was quitting. Herb Moelis, Kirshner's lawyer, told Nesmith that he should read his contract more carefully, at which point Nesmith got up, punched a hole in the wall of the hotel suite they were in, and told Moelis \"That could have been your face\".\n\nSo as 1967 began, the group were at a turning point. Would they be able to cut the puppet strings, or would they have to keep living a lie? We'll find out in a few weeks' time...",
  "itunes:subtitle": "Episode 144 of A History of Rock Music in Five Hundred Songs looks at “Last Train to Clarksville and the beginnings of the career of the Monkees, along with a short primer on the origins of the Vietnam War.  Click the full post to read liner notes, links",
  "itunes:keywords": "Bert Schneider,Bob Krasnow,Bob Rafelson,Bobby Hart,Davy Jones,Don Kirshner,Larry Taylor,Lester Sill,Lionel Bart,Michael Nesmith,Micky Dolenz,Neil Diamond,Peter Tork,Stephen Stills,the Monkees,Tommy Boyce,Vietnam War",
  "itunes:episodeType": "full",
  "itunes:episode": 144,
  "content:encoded": "Episode 144 of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Last Train to Clarksville\" and the beginnings of the career of the Monkees, along with a short primer on the origins of the Vietnam War.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a seventeen-minute bonus episode available, on \"These Boots Are Made For Walking\" by Nancy Sinatra, which I mispronounce at the end of this episode as \"These Boots <em>Were</em> Made For Walking\", so no need to correct me here.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, all the songs excerpted in the podcast can be heard in full at <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-144-last-train-to-clarksville/\">Mixcloud</a>.\n\nThe best versions of the Monkees albums are the triple-CD super-deluxe versions that used to be available from monkees.com , and I've used Andrew Sandoval's liner notes for them extensively in this episode. Sadly, though, the only one of those that is still in print is <em>More of the Monkees</em>.\n\nFor those just getting into the group, my advice is to start with <a href=\"https://amzn.to/34ZGAGw\">this five-CD set</a>, which contains their first five albums along with bonus tracks.\n\nThe single biggest source of information I used in this episode is the first edition of Andrew Sandoval's <em>The Monkees; The Day-By-Day Story</em>. Sadly that is now out of print and goes for hundreds of pounds. Sandoval released a second edition of the book last year, which I was unfortunately unable to obtain, but that too is now out of print. If you can find a copy of either, do get one.\n\nOther sources used were <a href=\"https://amzn.to/3gI2yke\"><em>Monkee Business</em> by Eric Lefcowitz</a>, and the autobiographies of three of the band members and one of the songwriters -- <a href=\"https://amzn.to/34LJr6e\"><em>Infinite Tuesday</em></a> by Michael Nesmith, <a href=\"https://amzn.to/3uY3OI2\"><em>They Made a Monkee Out of Me</em></a> by Davy Jones, <a href=\"https://amzn.to/3uQANyc\"><em>I'm a Believer</em></a> by Micky Dolenz, and <em><a href=\"https://amzn.to/3gNZQtA\">Psychedelic Bubble-Gum</a> </em>by Bobby Hart.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWe've obviously talked in this podcast about several of the biggest hits of 1966 already, but we haven't mentioned the biggest hit of the year, one of the strangest records ever to make number one in the US -- \"The Ballad of the Green Berets\" by Sgt Barry Sadler:\n\n[Excerpt: Barry Sadler, \"The Ballad of the Green Berets\"]\n\nBarry Sadler was an altogether odd man, and just as a brief warning his story, which will last a minute or so, involves gun violence. At the time he wrote and recorded that song, he was on active duty in the military -- he was a combat medic who'd been fighting in the Vietnam War when he'd got a wound that had meant he had to be shipped back to the USA, and while at Fort Bragg he decided to write and record a song about his experiences, with the help of Robin Moore, a right-wing author of military books, both fiction and nonfiction, who wrote the books on which the films The Green Berets and The French Connection were based.\n\nSadler's record became one of those massive fluke hits, selling over nine million copies and getting him appearances on the Ed Sullivan Show, but other than one top thirty hit, he never had another hit single. Instead, he tried and failed to have a TV career, then became a writer of pulp fiction himself, writing a series of twenty-one novels about the centurion who thrust his spear into Jesus' side when Jesus was being crucified, and is thus cursed to be a soldier until the second coming.\n\nHe moved to Nashville, Tennessee, where he lived until he shot Lee Emerson, a country songwriter who had written songs for Marty Robbins, in the head, killing him, in an argument over a woman. He was sentenced to thirty days in jail for this misdemeanour, of which he served twenty-eight. Later he moved to Guatemala City, where he was himself shot in the head.\n\nThe nearest Army base to Nashville, where Sadler lived after his discharge, is Fort Campbell, in Clarksville:\n\n[Excerpt: The Monkees, \"Last Train to Clarksville\"]\n\nThe Vietnam War was a long and complicated war, one which affected nearly everything we're going to see in the next year or so of this podcast, and we're going to talk about it a lot, so it's worth giving a little bit of background here. In doing so, I'm going to use quite a flippant tone, but I want to make it clear that I'm not mocking the very real horrors that people suffered in the wars I'm talking about -- it's just that to sum up multiple decades of unimaginable horrors in a few sentences requires glossing over so much that you have to either laugh or cry.\n\nThe origin of the Vietnam War, as in so many things in twentieth century history, can be found in European colonialism. France had invaded much of Southeast Asia in the mid-to-late nineteenth century, and created a territory known as French Indo-China, which became part of the French colonial Empire. But in 1940 France was taken over by Germany, and Japan was at war with China. Germany and Japan were allies, and the Japanese were worried that French Indo-China would be used to import fuel and arms to China -- plus, they quite fancied the idea of having a Japanese empire. So Vichy France let Japan take control of French Indo-China.\n\nBut of course the *reason* that France had been taken over by Germany was that pretty much the whole world was at war in 1940, and obviously the countries that were fighting Germany and Japan -- the bloc led by Britain, soon to be joined by America and Russia -- weren't very keen on the idea of Japan getting more territory. But they were also busy with the whole \"fighting a world war\" thing, so they did what governments in this situation always do -- they funded local guerilla insurgent fighters on the basis that \"my enemy's enemy is my friend\", something that has luckily never had any negative consequences whatsoever, except for occasionally.\n\nThose local guerilla fighters were an anti-imperialist popular front, the Việt Minh, led by Hồ Chí Minh, a revolutionary Communist. They were dedicated to overthrowing foreign imperialist occupiers and gaining independence for Vietnam, and Hồ Chí Minh further wanted to establish a Soviet-style Communist government in the newly-independent country. The Allies funded the Việt Minh in their fight against the Japanese occupiers until the end of the Second World War, at which point France was liberated from German occupation, Vietnam was liberated from Japanese occupation, and the French basically said \"Hooray! We get our Empire back!\", to which Hồ Chí Minh's response was, more or less, \"what part of anti-imperialist Marxist dedicated to overthrowing foreign occupation of Vietnam did you not understand, exactly?\"\n\nObviously, the French weren't best pleased with this, and so began what was the first of a series of wars in the region. The First Indochina War lasted for years and ended in a negotiated peace of a sort. Of course, this led to the favoured tactic of the time, partition -- splitting a formerly-occupied country into two, at an arbitrary dividing line, a tactic which was notably successful in securing peace everywhere it was tried. Apart from Ireland, India, Korea, and a few other places, but surely it wouldn't be a problem in Vietnam, right?\n\nNorth Vietnam was controlled by the Communists, led by Hồ Chí Minh, and recognised by China and the USSR but not by the Western states. South Vietnam was nominally independent but led by the former puppet emperor who owed his position to France, soon replaced by a right-wing dictatorship. And both the right-wing dictatorship and the left-wing dictatorship were soon busily oppressing their own citizens and funding military opposition groups in the other country. This soon escalated into full-blown war, with the North backed by China and Russia and the South backed by America.\n\nThis was one of a whole series of wars in small countries which were really proxy wars between the two major powers, the USA and the USSR, both of which were vying for control, but which couldn't confront each other directly because either country had enough nuclear weapons to destroy the whole world multiple times over.\n\nBut the Vietnam War quickly became more than a small proxy war. The US started sending its own troops over, and more and more of them. The US had never ended the draft after World War II, and by the mid sixties significant numbers of young men were being called up and sent over to fight in a war that had by that point lasted a decade (depending on exactly when you count the war as starting from) between two countries they didn't care about, over things few of them understood, and at an exorbitant cost in lives.\n\nAs you might imagine, this started to become unpopular among those likely to be drafted, and as the people most affected (other, of course, than the Vietnamese people, whose opinions on being bombed and shot at by foreigners supporting one of other of the dictators vying to rule over them nobody else was much interested in) were also of the generation who were the main audience for popular music, slowly this started to seep into the lyrics of songs -- a seepage which had already been prompted by the appearance in the folk and soul worlds of many songs against other horrors, like segregation.\n\nThis started to hit the pop charts with songs like \"The Universal Soldier\" by Buffy Saint-Marie, which made the UK top five in a version by Donovan:\n\n[Excerpt: Donovan, \"The Universal Soldier\"]\n\nThat charted in the lower regions of the US charts, and a cover version by Glen Campbell did slightly better:\n\n[Excerpt: Glen Campbell, \"The Universal Soldier\"]\n\nThat was even though Campbell himself was a supporter of the war in Vietnam, and rather pro-military. Meanwhile, as we've seen a couple of times, Jan Berry of Jan and Dean recorded a pro-war answer song to that, \"The Universal Coward\":\n\n[Excerpt: Jan Berry, \"The Universal Coward\"]\n\nThis, of course, was even though Berry was himself avoiding the draft. And I've not been able to find the credits for that track, but Glen Campbell regularly played guitar on Berry's sessions, so it's entirely possible that he played guitar on that record made by a coward, attacking his own record, which he disagreed with, for its cowardice.\n\nThis is, of course, what happens when popular culture tries to engage with social and political issues -- pop culture is motivated by money, not ideological consistency, and so if there's money to be made from anti-war songs or from pro-war songs, someone will take that money.\n\nAnd so on October the ninth 1965, Billboard magazine ran a report:\n\n\"Colpix Enters Protest Field\n\nHOLLYWOOD -Colpix has secured its first protest lyric disk, \"The Willing Conscript,\"as General Manager Bud Katzel initiates relationships with independent producers. The single features Lauren St. Davis.\n\nKatzel says the song was written during the Civil War, rewritten during World War I and most recently updated by Bob Krasnow and Sam Ashe.\n\nScreen Gems Music, the company's publishing wing, is tracing the song's history, Katzel said.\n\nKatzel's second single is \"(You Got the Gamma Goochee\" by an artist with that unusual stage name. The record is a Screen Gems production and was in the house when Katzel arrived one month ago.\n\nThe executive said he was expressly looking for material for two contract artists, David Jones and Hoyt Axton. The company is also working on getting Axton a role in a television series, \"Camp Runamuck.\" \"\n\nTo unpack this a little, Colpix was a record label, owned by Columbia Pictures, and we talked about that a little bit in the episode on \"The Loco-Motion\" -- the film and TV companies were getting into music, and Columbia had recently bought up Don Kirshner's Aldon publishing and Dimension Records as part of their strategy of tying in music with their TV shows.\n\nThis is a company trying desperately to jump on a bandwagon -- Colpix at this time was not exactly having huge amounts of success with its records.\n\nHoyt Axton, meanwhile, was a successful country singer and songwriter. We met his mother many episodes back -- Mae Axton was the writer of \"Heartbreak Hotel\". Axton himself is now best known as the dad in the 80s film Gremlins. David Jones will be coming up shortly.\n\nBob Krasnow and Sam Ashe were record executives then at Kama Sutra records, but soon to move on -- we'll be hearing about Krasnow more in future episodes. Neither of them were songwriters, and while I have no real reason to disbelieve the claim that \"The Willing Conscript\" dates back to the Civil War, the earliest version *I* have been able to track down was its publication in issue 28 of Broadside Magazine in June 1963 -- nearly a hundred years after the American Civil War -- with the credit \"by Tom Paxton\" -- Paxton was a popular singer-songwriter of the time, and it certainly sounds like his writing. The first recording of it I know of was by Pete Seeger:\n\n[Excerpt: Pete Seeger, \"The Willing Conscript\"]\n\nBut the odd thing is that by the time this was printed, the single had already been released the previous month, and it was not released under the name Lauren St Davis, or under the title \"The Willing Conscript\" -- there are precisely two differences between the song copyrighted as by Krasnow and Ashe and the one copyrighted two years earlier as by Paxton. One is that verses three and four are swapped round, the other is that it's now titled \"The New Recruit\". And presumably because they realised that the pseudonym \"Lauren St. Davis\" was trying just a bit too hard to sound cool and drug culture, they reverted to another stage name the performer had been using, Michael Blessing:\n\n[Excerpt: Michael Blessing, \"The New Recruit\"]\n\nBlessing's name was actually Michael Nesmith, and before we go any further, yes his mother, Bette Nesmith Graham, did invent the product that later became marketed in the US as Liquid Paper. At this time, though, that company wasn't anywhere near as successful as it later became, and was still a tiny company. I only mention it to forestall the ten thousand comments and tweets I would otherwise get asking why I didn't mention it. In Nesmith's autobiography, while he talks a lot about his mother, he barely mentions her business and says he was uninterested in it -- he talks far more about the love of art she instilled in him, as well as her interest in the deep questions of philosophy and religion, to which in her case and his they found answers in Christian Science, but both were interested in conversations about ideas, in a way that few other people in Nesmith's early environment were.\n\nNesmith's mother was also responsible for his music career. He had spent two years in the Air Force in his late teens, and the year he got out, his mother and stepfather bought him a guitar for Christmas, after he was inspired by seeing Hoyt Axton performing live and thinking he could do that himself:\n\n[Excerpt: Hoyt Axton, \"Greenback Dollar\"]\n\nAs he put it in his autobiography, \"What did it matter that I couldn't play the guitar, couldn't sing very well, and didn't know any folk songs? I would be going to college and hanging out at the student union with pretty girls and singing folk songs. They would like me. I might even figure out a way to get a cool car.\"\n\nThis is, of course, the thought process that pretty much every young man to pick up a guitar goes through, but Nesmith was more dedicated than most. He gave his first performance as a folk singer ten days after he first got a guitar, after practising the few chords in most folk songs for twelve hours a day every day in that time.\n\nHe soon started performing as a folk singer, performing around Dallas both on his own and with his friend John London, performing the standard folk repertoire of Woody Guthrie and Lead Belly songs, things like \"Pick a Bale of Cotton\":\n\n[Excerpt: Michael Nesmith, \"Pick a Bale of Cotton\"]\n\nHe also started writing his own songs, and put out a vanity record of one of them in 1963:\n\n[Excerpt: Mike Nesmith, \"Wanderin'\"]\n\nLondon moved to California, and Nesmith soon followed, with his first wife Phyllis and their son Christian. There Nesmith and London had the good fortune to be neighbours with someone who was a business associate of Frankie Laine, and they were signed to Laine's management company as a folk duo.\n\nHowever, Nesmith's real love was rock and roll, especially the heavier R&B end of the genre -- he was particularly inspired by Bo Diddley, and would always credit seeing Diddley live as a teenager as being his biggest musical influence. Soon Nesmith and London had formed a folk-rock trio with their friend Bill Sleeper. As Mike & John & Bill, they put out a single, \"How Can You Kiss Me?\", written by Nesmith:\n\n[Excerpt: Mike & John & Bill, \"How Can You Kiss Me?\"]\n\nThey also recorded more of Nesmith's songs, like \"All the King's Horses\":\n\n[Excerpt: Mike & John & Bill, \"All the King's Horses\"]\n\nBut that was left unreleased, as Bill was drafted, and Nesmith and London soon found themselves in The Survivors, one of several big folk groups run by Randy Sparks, the founder of the New Christie Minstrels. Nesmith was also writing songs throughout 1964 and 1965, and a few of those songs would be recorded by other people in 1966, like \"Different Drum\", which was recorded by the bluegrass band The Greenbriar Boys:\n\n[Excerpt: The Greenbriar Boys, \"Different Drum\"]\n\nThat would more successfully be recorded by the Stone Poneys later of course. And Nesmith's \"Mary Mary\" was also picked up by the Paul Butterfield Blues Band:\n\n[Excerpt: The Paul Butterfield Blues Band, \"Mary Mary\"]\n\nBut while Nesmith had written these songs by late 1965, he wasn't able to record them himself. He was signed by Bob Krasnow, who insisted he change his name to Michael Blessing, and recorded two singles for Colpix -- \"The New Recruit\", which we heard earlier, and a version of Buffy Saint-Marie's \"Until It's Time For You To Go\", sung in a high tenor range very far from Nesmith's normal singing voice:\n\n[Excerpt: Michael Blessing, \"Until It's Time For You To Go\"]\n\nBut to my mind by far the best thing Nesmith recorded in this period is the unissued third Michael Blessing single, where Nesmith seems to have been given a chance to make the record he really wanted to make. The B-side, a version of Allen Toussaint's swamp-rocker \"Get Out of My Life, Woman\", is merely a quite good version of the song, but the A-side, a version of his idol Bo Diddley's classic \"Who Do You Love?\" is utterly extraordinary, and it's astonishing that it was never released at the time:\n\n[Excerpt: Michael Blessing, \"Who Do You Love?\"]\n\nBut the Michael Blessing records did no better than anything else Colpix were putting out. Indeed, the only record they got onto the hot one hundred at all in a three and a half year period was a single by one David Jones, which reached the heady heights of number ninety-eight:\n\n[Excerpt: David Jones, \"What Are We Going to Do?\"]\n\nJones had been brought up in extreme poverty in Openshaw in Manchester, but had been encouraged by his mother, who died when he was fourteen, to go into acting. He'd had a few parts on local radio, and had appeared as a child actor on TV shows made in Manchester, like appearing in the long-running soap opera Coronation Street (still on today) as Ena Sharples' grandson Colin:\n\n[Excerpt: Coronation St https://www.youtube.com/watch?v=5FDEvOs1imc , 13:30]\n\nHe also had small roles in Z-Cars and Bill Naughton's TV play \"June Evening\", and a larger role in Keith Waterhouse's radio play \"There is a Happy Land\". But when he left school, he decided he was going to become a jockey rather than an actor -- he was always athletic, he loved horses, and he was short -- I've seen his height variously cited as five foot three and five foot four. But it turned out that the owner of the stables in which he was training had showbusiness connections, and got him the audition that changed his life, for the part of the Artful Dodger in Lionel Bart's West End musical Oliver!\n\nWe've encountered Lionel Bart before a couple of times, but if you don't remember him, he was the songwriter who co-wrote Tommy Steele's hits, and who wrote \"Living Doll\" for Cliff Richard. He also discovered both Steele and Marty Wilde, and was one of the major figures in early British rock and roll.\n\nBut after the Tommy Steele records, he'd turned his attention to stage musicals, writing book, music, and lyrics for a string of hits, and more-or-less singlehandedly inventing the modern British stage musical form -- something Andrew Lloyd Webber, for example, always credits him with. Oliver!, based on Oliver Twist, was his biggest success, and they were looking for a new Artful Dodger. This was *the* best role for a teenage boy in the UK at the time -- later performers to take the role on the London stage include Steve Marriott and Phil Collins, both of whom we'll no doubt encounter in future episodes -- and Jones got the job, although they were a bit worried at first about his Manchester vowels. He assured them though that he could learn to do a Cockney accent, and they took him on.\n\nJones not having a natural Cockney accent ended up doing him the biggest favour of his career. While he could put on a relatively convincing one, he articulated quite carefully because it wasn't his natural accent. And so when the North American version found  in previews that their real Cockney Dodger wasn't being understood perfectly, the fake Cockney Jones was brought over to join the show on Broadway, and was there from opening night on.\n\nOn February the ninth, 1964, Jones found himself, as part of the Broadway cast of Oliver!, on the Ed Sullivan Show:\n\n[Excerpt: Davy Jones and Georgia Brown, \"I'd Do Anything\"]\n\nThat same night, there were some other British people, who got a little bit more attention than Jones did:\n\n[Excerpt: The Beatles, \"I Want to Hold Your Hand (live on Ed Sullivan)\"]\n\nDavy Jones wasn't a particular fan of pop music at that point, but he knew he liked what he saw, and he wanted some of the same reaction.\n\nShortly after this, Jones was picked up for management by Ward Sylvester, of Columbia Pictures, who was going to groom Jones for stardom. Jones continued in Oliver! for a while, and also had a brief run in a touring version of Pickwick, another musical based on a Dickens novel, this time starring Harry Secombe, the British comedian and singer who had made his name with the Goon Show. Jones' first single, \"Dream Girl\", came out in early 1965:\n\n[Excerpt: Davy Jones, \"Dream Girl\"]\n\nIt was unsuccessful, as was his one album, David Jones, which seemed to be aiming at the teen idol market, but failing miserably. The second single, \"What Are  We Going to Do?\" did make the very lowest regions of the Hot One Hundred, but the rest of the album was mostly attempts to sound a bit like Herman's Hermits -- a band whose lead singer, coincidentally, also came from Manchester, had appeared in Coronation Street, and was performing with a fake Cockney accent. Herman's Hermits had had a massive US hit with the old music hall song \"I'm Henry VIII I Am\":\n\n[Excerpt: Herman's Hermits, \"I'm Henry VIII I Am\"]\n\nSo of course Davy had his own old music-hall song, \"Any Old Iron\":\n\n[Excerpt: Davy Jones, \"Any Old Iron\"]\n\nAlso, the Turtles had recently had a hit with a folk-rock version of Dylan's \"It Ain't Me Babe\", and Davy cut his own version of their arrangement, in the one concession to rock music on the album:\n\n[Excerpt: Davy Jones, \"It Ain't Me Babe\"]\n\nThe album was, unsurprisingly, completely unsuccessful, but Ward Sylvester was not disheartened. He had the perfect job for a young British teen idol who could sing and act.\n\nThe Monkees was the brainchild of two young TV producers, Bob Rafelson and Bert Schneider, who had come up with the idea of doing a TV show very loosely based on the Beatles' film A Hard Day's Night (though Rafelson would later claim that he'd had the idea many years before A Hard Day's Night and was inspired by his youth touring with folk bands -- Schneider always admitted the true inspiration though). This was not a particularly original idea -- there were a whole bunch of people trying to make TV shows based in some way around bands. Jan and Dean were working on a possible TV series, there was talk of a TV series starring The Who, there was a Beatles cartoon series, Hanna-Barbera were working on a cartoon series about a band called The Bats, and there was even another show proposed to Screen Gems, Columbia's TV department, titled Liverpool USA, which was meant to star Davy Jones, another British performer, and two American musicians, and to have songs provided by Don Kirshner's songwriters.\n\nThat The Monkees, rather than these other series, was the one that made it to the TV (though obviously the Beatles cartoon series did too) is largely because Rafelson and Schneider's independent production company, Raybert, which they had started after leaving Screen Gems, was given two hundred and twenty-five thousand dollars to develop the series by their former colleague, Screen Gems' vice president in charge of programme development, the former child star Jackie Cooper.\n\nOf course, as well as being their former colleague, Cooper may have had some more incentive to give Bob Rafelson and Bert Schneider that money in that the head of Columbia Pictures, and thus Cooper's boss' boss, was one Abe Schneider.\n\nThe original idea for the show was to use the Lovin' Spoonful, but as we heard last week they weren't too keen, and it was quickly decided instead that the production team would put together a group of performers.\n\nDavy Jones was immediately attached to the project, although Rafelson was uncomfortable with Jones, thinking he wasn't as rock and roll as Rafelson was hoping for -- he later conceded, though, that Jones was absolutely right for the group.\n\nAs for everyone else, to start with Rafelson and Schneider placed an ad in a couple of the trade papers which read \"Madness!! Auditions Folk and Roll Musicians-Singers for acting roles in new TV series. Running parts for 4 insane boys ages 17-21. Want spirited Ben Frank's types. Have courage to work. Must come down for interview\"\n\nThere were a couple of dogwhistles in there, to appeal to the hip crowd -- Ben Frank's was a twenty-four-hour restaurant on the Sunset Strip, where people including Frank Zappa and Jim Morrison used to hang out, and which was very much associated with the freak scene we've looked at in episodes on Zappa and the Byrds. Meanwhile \"Must come down for interview\" was meant to emphasise that you couldn't actually be high when you turned up -- but you were expected to be the kind of person who would at least at some points have been high.\n\nA lot of people answered that ad -- including Paul Williams, Harry Nilsson, Van Dyke Parks, and many more we'll be seeing along the way. But oddly, the only person actually signed up for the show because of that ad was Michael Nesmith -- who was already signed to Colpix Records anyway. According to Davy Jones, who was sitting in at the auditions, Schneider and Rafelson were deliberately trying to disorient the auditioners with provocative behaviour like just ignoring them, to see how they'd react. Nesmith was completely unfazed by this, and apparently walked in wearing a  green wool hat and carrying a bag of laundry, saying that he needed to get this over with quickly so he could go and do his washing. John London, who came along to the audition as well, talked later about seeing Nesmith fill in a questionnaire that everyone had to fill in -- in a space asking about previous experience Nesmith just wrote \"Life\" and drew a big diagonal line across the rest of the page.\n\nThat attitude certainly comes across in Nesmith's screen test:\n\n[Excerpt: Michael Nesmith screen test]\n\nMeanwhile, Rafelson and Schneider were also scouring the clubs for performers who might be useful, and put together a shortlist of people including Jerry Yester and Chip Douglas of the Modern Folk Quartet, Bill Chadwick, who was in the Survivors with Nesmith and London, and one Micky Braddock, whose agent they got in touch with and who was soon signed up.\n\nBraddock was the stage name of Micky Dolenz, who soon reverted to his birth surname, and it's the name by which he went in his first bout of fame. Dolenz was the son of two moderately successful Hollywood actors, George Dolenz and Janelle Johnson, and their connections had led to Dolenz, as Braddock, getting the lead role in the 1958 TV series Circus Boy, about a child named Corky who works in a circus looking after an elephant after his parents, the Flying Falcons, were killed in a trapeze accident.\n\n[Excerpt: Circus Boy, \"I can't play a drum\"]\n\nOddly, one of the other people who had been considered for that role was Paul Williams, who was also considered for the Monkees but ultimately turned down, and would later write one of the Monkees' last singles.\n\nDolenz had had a few minor TV appearances after that series had ended, including a recurring role on Peyton Place, but he had also started to get interested in music. He'd performed a bit as a folk duo with his sister Coco, and had also been the lead singer of a band called Micky and the One-Nighters, who later changed their name to the Missing Links, who'd played mostly covers of Little Richard and Chuck Berry songs and later British Invasion hits.\n\nHe'd also recorded two tracks with Wrecking Crew backing, although neither track got released until after his later fame -- \"Don't Do It\":\n\n[Excerpt: Micky Dolenz, \"Don't Do It\"]\n\nand \"Huff Puff\":\n\n[Excerpt: Micky Dolenz, \"Huff Puff\"]\n\nDolenz had a great singing voice, an irrepressible personality, and plenty of TV experience. He was obviously in.\n\nRafelson and Schneider took quite a while whittling down the shortlist to the final four, and they *were* still considering people who'd applied through the ads. One they actually offered the role to was Stephen Stills, but he decided not to take the role. When he turned the role down, they asked if he knew anyone else who had a similar appearance to him, and as it happened he did.\n\nSteve Stills and Peter Tork had known of each other before they actually met on the streets of Greenwich Village -- the way they both told the story, on their first meeting they'd each approached the other and said \"You must be the guy everyone says looks like me!\"\n\nThe two had become fast friends, and had played around the Greenwich Village folk scene together for a while, before going their separate ways -- Stills moving to California while Tork joined another of those big folk ensembles of the New Christie Minstrels type, this one called the Phoenix Singers.\n\nTork had later moved to California himself, and reconnected with his old friend, and they had performed together for a while in a trio called the Buffalo Fish, with Tork playing various instruments, singing, and doing comedy bits.\n\nOddly, while Tork was the member of the Monkees with the most experience as a musician, he was the only one who hadn't made a record when the TV show was put together. But he was by far the most skilled instrumentalist of the group -- as distinct from best musician, a distinction Tork was always scrupulous about making -- and could play guitar, bass, and keyboards, all to a high standard -- and I've also seen him in more recent years play French horn live. His great love, though, was the banjo, and you can hear how he must have sounded on the Greenwich Village folk scene in his solo spots on Monkees shows, where he would show off his banjo skills:\n\n[Excerpt: Peter Tork, \"Cripple Creek\"]\n\nTork wouldn't get to use his instrumental skills much at first though, as most of the backing tracks for the group's records were going to be performed by other people. More impressive for the TV series producers was his gift for comedy, especially physical comedy -- having seen Tork perform live a few times, the only comparison I can make to his physical presence is to Harpo Marx, which is about as high a compliment as one can give.\n\nIndeed, Micky Dolenz has often pointed out that while there were intentional parallels to the Beatles in the casting of the group, the Marx Brothers are a far better parallel, and it's certainly easy to see Tork as Harpo, Dolenz as Chico, Nesmith as Groucho, and Jones as Zeppo. (This sounds like an insult to Jones, unless you're aware of how much the Marx Brothers films actually depended on Zeppo as the connective tissue between the more outrageous brothers and the more normal environment they were operating in, and how much the later films suffered for the lack of Zeppo).\n\nThe new cast worked well together, even though there were obvious disagreements between them right from the start. Dolenz, at least at this point, seems to have been the gel that held the four together -- he had the experience of being a child star in common with Jones, he was a habitue of the Sunset Strip clubs where Nesmith and Tork had been hanging out, and he had personality traits in common with all of them. Notably, in later years, Dolenz would do duo tours with each of his three bandmates without the participation of the others.\n\nThe others, though, didn't get on so well with each other. Jones and Tork seem to have got on OK, but they were very different people -- Jones was a showbiz entertainer, whose primary concern was that none of the other stars of the show be better looking than him, while Tork was later self-diagnosed as neurodivergent, a folkie proto-hippie who wanted to drift from town to town playing his banjo. Tork and Nesmith had similar backgrounds and attitudes in some respects -- and were united in their desire to have more musical input into the show than was originally intended -- but they were such different personalities in every aspect of their lives from their religious views to their politics to their taste in music they came into conflict. Nesmith would later say of Tork \"I never liked Peter, he never liked me. So we had an uneasy truce between the two of us. As clear as I could tell, among his peers he was very well liked. But we rarely had a civil word to say to each other\".\n\nNesmith also didn't get on well with Jones, both of them seeming to view themselves as the natural leader of the group, with all the clashes that entails.\n\nThe four Monkees were assigned instruments for their characters based not on instrumental skill, but on what suited their roles better. Jones was the teen idol character, so he was made the maraca-playing frontman who could dance without having to play an instrument, though Dolenz took far more of the lead vocals. Nesmith was made the guitarist, while Tork was put on bass, though Tork was by far the better guitarist of the two. And Dolenz was put on drums, even though he didn't play the drums -- Tork would always say later that if the roles had been allocated by actual playing ability, Jones would have been the drummer.\n\nDolenz did, though, become a good drummer, if a rather idiosyncratic one. Tork would later say \"Micky played the drums but Mike kept time, on that one record we all made, Headquarters. Mike was the timekeeper. I don't know that Micky relied on him but Mike had a much stronger sense of time. And Davy too, Davy has a much stronger sense of time. Micky played the drums like they were a musical instrument, as a colour. He played the drum colour.... as a band, there was a drummer and there was a timekeeper and they were different people.\"\n\nBut at first, while the group were practising their instruments so they could mime convincingly on the TV and make personal appearances, they didn't need to play on their records. Indeed, on the initial pilot, they didn't even sing -- the recordings had been made before the cast had been finalised:\n\n[Excerpt: Boyce & Hart, \"Monkees Theme (pilot version)\"]\n\nThe music was instead performed by two songwriters, Tommy Boyce and Bobby Hart, who would become hugely important in the Monkees project.\n\nBoyce and Hart were not the first choice for the project. Don Kirshner, the head of Screen Gems Music, had initially suggested Roger Atkins, a Brill Building songwriter working for his company, as the main songwriter for The Monkees. Atkins is best known for writing \"It's My Life\", a hit for the Animals:\n\n[Excerpt: The Animals, \"It's My Life\"]\n\nBut Atkins didn't work out, though he would collaborate later on one song with Nesmith, and reading between the lines, it seems that there was some corporate infighting going on, though I've not seen it stated in so many words. There seems to have been a turf war between Don Kirshner, the head of Screen Gems' music publishing, who was based in the Brill Building, and Lester Sill, the West Coast executive we've seen so many times before, the mentor to Leiber and Stoller, Duane Eddy, and Phil Spector, who was now the head of Screen Gems music on the West Coast. It also seems to be the case that none of the top Brill Building songwriters were all that keen on being involved at this point -- writing songs for an unsold TV pilot wasn't exactly a plum gig.\n\nSill ended up working closely with the TV people, and it seems to have been him who put forward Boyce and Hart, a songwriting team he was mentoring.\n\nBoyce and Hart had been working in the music industry for years, both together and separately, and had had some success, though they weren't one of the top-tier songwriting teams like Goffin and King. They'd both started as performers -- Boyce's first single, \"Betty Jean\", had come out in 1958:\n\n[Excerpt: Tommy Boyce, \"Betty Jean\"]\n\nAnd Hart's, \"Love Whatcha Doin' to Me\", under his birth name Robert Harshman, a year later:\n\n[Excerpt: Robert Harshman, \"Love Whatcha Doin' to Me\"]\n\nBoyce had been the first one to have real songwriting success, writing Fats Domino's top ten hit \"Be My Guest\" in 1959:\n\n[Excerpt: Fats Domino, \"Be My Guest\"]\n\nand cowriting two songs with singer Curtis Lee, both of which became singles produced by Phil Spector -- \"Under the Moon of Love\" and the top ten hit \"Pretty Little Angel Eyes\":\n\n[Excerpt: Curtis Lee, \"Pretty Little Angel Eyes\"]\n\nBoyce and Hart together, along with Wes Farrell, who had co-written \"Twist and Shout\" with Bert Berns, wrote \"Lazy Elsie Molly\" for Chubby Checker, and the number three hit \"Come a Little Bit Closer\" for Jay and the Americans:\n\n[Excerpt: Jay and the Americans, \"Come a Little Bit Closer\"]\n\nAt this point they were both working in the Brill Building, but then Boyce moved to the West Coast, where he was paired with Steve Venet, the brother of Nik Venet, and they co-wrote and produced \"Peaches and Cream\" for the Ikettes:\n\n[Excerpt: The Ikettes, \"Peaches and Cream\"]\n\nHart, meanwhile, was playing in the band of Teddy Randazzo, the accordion-playing singer who had appeared in The Girl Can't Help It, and with Randazzo and Bobby Weinstein he wrote \"Hurts So Bad\", which became a big hit for Little Anthony and the Imperials:\n\n[Excerpt: Little Anthony and the Imperials, \"Hurts So Bad\"]\n\nBut Hart soon moved over to the West Coast, where he joined his old partner Boyce, who had been busy writing TV themes with Venet for shows like \"Where the Action Is\". Hart soon replaced Venet in the team, and the two soon wrote what would become undoubtedly their most famous piece of music ever, a theme tune that generations of TV viewers would grow to remember:\n\n[Excerpt: \"Theme from Days of Our Lives\"]\n\nWell, what did you *think* I meant?\n\nYes, just as Davy Jones had starred in an early episode of Britain's longest-running soap opera, one that's still running today, so Boyce and Hart wrote the theme music for *America's* longest-running soap opera, which has been running every weekday since 1965, and has so far aired well in excess of fourteen thousand episodes.\n\nMeanwhile, Hart had started performing in a band called the Candy Store Prophets, with Larry Taylor  -- who we last saw with the Gamblers, playing on \"LSD-25\" and \"Moon Dawg\" -- on bass, Gerry McGee on guitar, and Billy Lewis on drums. It was this band that Boyce and Hart used -- augmented by session guitarists Wayne Erwin and Louie Shelton and Wrecking Crew percussionist Gene Estes on tambourine, plus Boyce and session singer Ron Hicklin on backing vocals, to record first the demos and then the actual tracks that would become the Monkees hits.\n\nThey had a couple of songs already that would be suitable for the pilot episode, but they needed something that would be usable as a theme song for the TV show. Boyce and Hart's usual working method was to write off another hit -- they'd try to replicate the hook or the feel or the basic sound of something that was already popular. In this case, they took inspiration from the song \"Catch Us If You Can\", the theme from the film that was the Dave Clark Five's attempt at their own A Hard Day's Night:\n\n[Excerpt: The Dave Clark Five, \"Catch Us If You Can\"]\n\nBoyce and Hart turned that idea into what would become the Monkees theme. We heard their performance of it earlier of course, but when the TV show finally came out, it was rerecorded with Dolenz singing:\n\n[Excerpt: The Monkees, \"Monkees Theme\"]\n\nFor a while, Boyce and Hart hoped that they would get to perform all the music for the TV show, and there was even apparently some vague talk of them being cast in it, but it was quickly decided that they would just be songwriters. Originally, the intent was that they wouldn't even produce the records, that instead the production would be done by a name producer. Micky Most, the Animals' producer, was sounded out for the role but wasn't interested. Snuff Garrett was brought in, but quickly discovered he didn't get on with the group at all -- in particular, they were all annoyed at the idea that Davy would be the sole lead vocalist, and the tracks Garrett cut with Davy on lead and the Wrecking Crew backing were scrapped.\n\nInstead, it was decided that Boyce and Hart would produce most of the tracks, initially with the help of the more experienced Jack Keller, and that they would only work with one Monkee at a time to minimise disruption -- usually Micky and sometimes Davy. These records would be made the same way as the demos had been, by the same set of musicians, just with one of the Monkees taking the lead.\n\nMeanwhile, as Nesmith was seriously interested in writing and production, and Rafelson and Schneider wanted to encourage the cast members, he was also assigned to write and produce songs for the show. Unlike Boyce and Hart, Nesmith wanted to use his bandmates' talents -- partly as a way of winning them over, as it was already becoming clear that the show would involve several competing factions. Nesmith's songs were mostly country-rock tracks that weren't considered suitable as singles, but they would be used on the TV show and as album tracks, and on Nesmith's songs Dolenz and Tork would sing backing vocals, and Tork would join the Wrecking Crew as an extra guitarist -- though he was well aware that his part on records like \"Sweet Young Thing\" wasn't strictly necessary when Glen Campbell, James Burton, Al Casey and Mike Deasy were also playing guitar:\n\n[Excerpt: The Monkees, \"Sweet Young Thing\"]\n\nThat track was written by Nesmith with Goffin and King, and there seems to have been some effort to pair Nesmith, early on, with more commercial songwriters, though this soon fell by the wayside and Nesmith was allowed to keep making his own idiosyncratic records off to the side while Boyce and Hart got on with making the more commercial records.\n\nThis was not, incidentally, something that most of the stars of the show objected to or even thought was a problem at the time. Tork was rather upset that he wasn't getting to have much involvement with the direction of the music, as he'd thought he was being employed as a musician, but Dolenz and Jones were actors first and foremost, while Nesmith was happily making his own tracks. They'd all known going in that most of the music for the show would be created by other people -- there were going to be two songs every episode, and there was no way that four people could write and record that much material themselves while also performing in a half-hour comedy show every week.\n\nAssuming, of course, that the show even aired. Initial audience response to the pilot was tepid at best, and it looked for a while like the show wasn't going to be green-lit. But Rafelson and Schneider -- and director James Frawley who played a crucial role in developing the show -- recut the pilot, cutting out one character altogether -- a manager who acted as an adult supervisor -- and adding in excerpts of the audition tapes, showing the real characters of some of the actors. As three of the four were playing characters loosely based on themselves -- Peter's \"dummy\" character wasn't anything like he was in real life, but was like the comedy character he'd developed in his folk-club performances -- this helped draw the audience in. It also, though, contributed to some line-blurring that became a problem.\n\nThe re-edited pilot was a success, and the series sold. Indeed, the new format for the series was a unique one that had never been done on TV before -- it was a sitcom about four young men living together, without any older adult supervision, getting into improbable adventures, and with one or two semi-improvised \"romps\", inspired by silent slapstick, over which played original songs. This became strangely influential in British sitcom when the series came out over here  -- two of the most important sitcoms of the next couple of decades, The Goodies and The Young Ones, are very clearly influenced by the Monkees.\n\nAnd before the broadcast of the first episode, they were going to release a single to promote it. The song chosen as the first single was one Boyce and Hart had written, inspired by the Beatles. Specifically inspired by this:\n\n[Excerpt: The Beatles, \"Paperback Writer\"]\n\nHart heard that tag on the radio, and thought that the Beatles were singing \"take the last train\". When he heard the song again the next day and realised that the song had nothing to do with trains, he and Boyce sat down and wrote their own song inspired by his mishearing. \"Last Train to Clarksville\" is structured very, very, similarly to \"Paperback Writer\" -- both of them stay on one chord, a G7, for an eight-bar verse before changing to C7 for a chorus line -- the word \"writer\" for the Beatles, the \"no no no\" (inspired by the Beatles \"yeah yeah yeah\") for the Monkees.\n\nTo show how close the parallels are, I've sped up the vocals from the Beatles track slightly to match the tempo with a karaoke backing track version of \"Last Train to Clarksville\" I found, and put the two together:\n\n[Excerpt: \"Paperback Clarksville\"]\n\nLyrically, there was one inspiration I will talk about in a minute, but I think I've identified another inspiration that nobody has ever mentioned. The classic country song \"Night Train to Memphis\", co-written by Owen Bradley, and made famous by Roy Acuff, has some slight melodic similarity to \"Last Train to Clarksville\", and parallels the lyrics fairly closely -- \"take the night train to Memphis\" against \"take the last train to Clarksville\", both towns in Tennessee, and \"when you arrive at the station, I'll be right there to meet you I'll be right there to greet you, So don't turn down my invitation\" is clearly close to \"and I'll meet you at the station, you can be here by 4:30 'cos I've made your reservation\":\n\n[Excerpt: Roy Acuff, \"Night Train to Memphis\"]\n\nInterestingly, in May 1966, the same month that \"Paperback Writer\" was released, and so presumably the time that Hart heard the song on the radio for the first time, Rick Nelson, the teen idol formerly known as Ricky Nelson, who had started his own career as a performer in a sitcom, had released an album called Bright Lights and Country Music. He'd had a bit of a career downslump and was changing musical direction, and recording country songs. The last track on that album was a version of \"Night Train to Memphis\":\n\n[Excerpt: Rick Nelson, \"Night Train to Memphis\"]\n\nNow, I've never seen either Boyce or Hart ever mention even hearing that song, it's pure speculation on my part that there's any connection there at all, but I thought the similarity worth mentioning.\n\nThe idea of the lyric, though, was to make a very mild statement about the Vietnam War. Clarksville was, as mentioned earlier, the site of Fort Campbell, a military training base, and they crafted a story about a young soldier being shipped off to war, calling his girlfriend to come and see him for one last night. This is left more-or-less ambiguous -- this was a song being written for a TV show intended for children, after all -- but it's still very clear on the line \"and I don't know if I'm ever coming home\".\n\nNow, Boyce and Hart were songwriters first and foremost, and as producers they were quite hands-off and would let the musicians shape the arrangements. They knew they wanted a guitar riff in the style of the Beatles' recent singles, and Louie Shelton came up with one based around the G7 chord that forms the basis of the song, starting with an octave leap:\n\nShelton's riff became the hook that drove the record, and engineer Dave Hassinger added the final touch, manually raising the volume on the hi-hat mic for a fraction of a second every bar, creating a drum sound like a hissing steam brake:\n\n[Excerpt: The Monkees, \"Last Train to Clarksville\"]\n\nNow all that was needed was to get the lead vocals down. But Micky Dolenz was tired, and hungry, and overworked -- both Dolenz and Jones in their separate autobiographies talk about how it was normal for them to only get three hours' sleep a night between working twelve hour days filming the series, three-hour recording sessions, and publicity commitments. He got the verses down fine, but he just couldn't sing the middle eight. Boyce and Hart had written a complicated, multisyllabic, patter bridge, and he just couldn't get his tongue around that many syllables when he was that tired. He eventually asked if he could just sing \"do do do\" instead of the words, and the producers agreed. Surprisingly, it worked:\n\n[Excerpt: The Monkees, \"Last Train to Clarksville\"]\n\n\"Last Train to Clarksville\" was released in advance of the TV series, on a new label, Colgems, set up especially for the Monkees to replace Colpix, with a better distribution deal, and it went to number one. The TV show started out with mediocre ratings, but soon that too became a hit. And so did the first album released from the TV series. And that album was where some of the problems really started.\n\nThe album itself was fine -- ten tracks produced by Boyce and Hart with the Candy Store Prophets playing and either Micky or Davy singing, mostly songs Boyce and Hart wrote, with a couple of numbers by Goffin and King and other Kirshner staff songwriters, plus two songs produced by Nesmith with the Wrecking Crew, and with token participation from Tork and Dolenz.\n\nThe problem was the back cover, which gave little potted descriptions of each of them, with their height, eye colour, and so on. And under three of them it said \"plays guitar and sings\", while under Dolenz it said \"plays drums and sings\".\n\nNow this was technically accurate -- they all did play those instruments. They just didn't play them on the record, which was clearly the impression the cover was intended to give. Nesmith in particular was incandescent. He believed that people watching the TV show understood that the group weren't really performing that music, any more than Adam West was really fighting crime or William Shatner travelling through space. But crediting them on the record was, he felt, crossing a line into something close to con artistry.\n\nTo make matters worse, success was bringing more people trying to have a say. Where before, the Monkees had been an irrelevance, left to a couple of B-list producer-songwriters on the West Coast, now they were a guaranteed hit factory, and every songwriter working for Kirshner wanted to write and produce for them -- which made sense because of the sheer quantity of material they needed for the TV show, but it made for a bigger, less democratic, organisation -- one in which Kirshner was suddenly in far more control.\n\nSuddenly as well as Boyce and Hart with the Candy Store Prophets and Nesmith with the Wrecking Crew, both of whom had been operating without much oversight from Kirshner, there were a bunch of tracks being cut on the East Coast by songwriting and production teams like Goffin and King, and Neil Sedaka and Carole Bayer.\n\nOn the second Monkees album, released only a few months after the first, there were nine producers credited -- as well as Boyce, Hart, Jack Keller, and Nesmith, there were now also Goffin, King, Sedaka, Bayer, and Jeff Barry, who as well as cutting tracks on the east coast was also flying over to the West Coast, cutting more tracks with the Wrecking Crew, and producing vocal sessions while there.\n\nAs well as producing songs he'd written himself, Barry was also supervising songs written by other people. One of those was a new songwriter he'd recently discovered and been co-producing for Bang Records, Neil Diamond, who had just had a big hit of his own with \"Cherry Cherry\":\n\n[Excerpt: Neil Diamond, \"Cherry Cherry\"]\n\nDiamond was signed with Screen Gems, and had written a song which Barry thought would be perfect for the Monkees, an uptempo song called \"I'm a Believer\", which he'd demoed with the regular Bang musicians -- top East Coast session players like Al Gorgoni, the guitarist who'd played on \"The Sound of Silence\":\n\n[Excerpt: Neil Diamond, \"I'm a Believer\"]\n\nBarry had cut a backing track for the Monkees using those same musicians, including Diamond on acoustic guitar, and brought it over to LA. And that track would indirectly lead to the first big crisis for the group.\n\nBarry, unlike Boyce and Hart, was interested in working with the whole group, and played all of them the backing track. Nesmith's reaction was a blunt \"I'm a producer too, and that ain't no hit\". He liked the song -- he wanted to have a go at producing a track on it himself, as it happened -- but he didn't think the backing track worked.\n\nBarry, trying to lighten the mood, joked that it wasn't finished and you needed to imagine it with strings and horns. Unfortunately, Nesmith didn't get that he was joking, and started talking about how that might indeed make a difference -- at which point everyone laughed and Nesmith took it badly -- his relationship with Barry quickly soured.\n\nNesmith was getting increasingly dissatisfied with the way his songs and his productions were being sidelined, and was generally getting unhappy, and Tork was wanting more musical input too. They'd been talking with Rafelson and Schneider, who'd agreed that the group were now good enough on their instruments that they could start recording some tracks by themselves, an idea which Kirshner loathed. But for now they were recording Neil Diamond's song to Jeff Barry's backing track.\n\nGiven that Nesmith liked the song, and given that he had some slight vocal resemblance to Diamond, the group suggested that Nesmith be given the lead vocal, and Kirshner and Barry agreed, although Kirshner at least apparently always intended for Dolenz to sing lead, and was just trying to pacify Nesmith.\n\nIn the studio, Kirshner kept criticising Nesmith's vocal, and telling him he was doing it wrong, until eventually he stormed out, and Kirshner got what he wanted -- another Monkees hit with Micky Dolenz on lead, though this time it did at least have Jones and Tork on backing vocals:\n\n[Excerpt: The Monkees, \"I'm a Believer\"]\n\nThat was released on November 23rd, 1966, as their second single, and became their second number one. And in January 1967, the group's second album, More of the Monkees, was released. That too went to number one.\n\nThere was only one problem. The group weren't even told about the album coming out beforehand -- they had to buy their own copies from a record shop to even see what tracks were on it. Nesmith had his two tracks, but even Boyce and Hart were only given two, with the rest of the album being made up of tracks from the Brill Building songwriters Kirshner preferred. Lots of great Nesmith and Boyce and Hart tracks were left off the album in favour of some astonishingly weak material, including the two worst tracks the group ever recorded, \"The Day We Fall in Love\" and \"Laugh\", and a novelty song they found embarrassing, \"Your Auntie Grizelda\", included to give Tork a vocal spot.\n\nNesmith called it \"probably the worst album in the history of the world\", though in truth seven of the twelve tracks are really very strong, though some of the other material is pretty poor. The group were also annoyed by the packaging. The liner notes were by Don Kirshner, and read to the group at least like a celebration of Kirshner himself as the one person responsible for everything on the record. Even the photo was an embarrassment -- the group had taken a series of photos in clothes from the department store J. C. Penney as part of an advertising campaign, and the group thought the clothes were ridiculous, but one of those photos was the one chosen for the cover.\n\nNesmith and Tork made a decision, which the other two agreed to with varying degrees of willingness. They'd been fine miming to other people's records when it was clearly just for a TV show. But if they were being promoted as a real band, and having to go on tour promoting albums credited to them, they were going to *be* a real band, and take some responsibility for the music that was being put out in their name.  With the support of Rafelson and Schneider, they started making preparations to do just that.\n\nBut Don Kirshner had other ideas, and told them so in no uncertain terms. As far as he was concerned, they were a bunch of ungrateful, spoiled, kids who were very happy cashing the ridiculously large cheques they were getting, but now wanted to kill the goose that laid the golden egg. They were going to keep doing what they were told.\n\nThings came to a head in a business meeting in January 1967, when Nesmith gave an ultimatum. Either the group got to start playing on their own records, or he was quitting. Herb Moelis, Kirshner's lawyer, told Nesmith that he should read his contract more carefully, at which point Nesmith got up, punched a hole in the wall of the hotel suite they were in, and told Moelis \"That could have been your face\".\n\nSo as 1967 began, the group were at a turning point. Would they be able to cut the puppet strings, or would they have to keep living a lie? We'll find out in a few weeks' time...",
  "enclosure": "",
  "itunes:summary": "Episode 144 of A History of Rock Music in Five Hundred Songs looks at “Last Train to Clarksville\" and the beginnings of the career of the Monkees, along with a short primer on the origins of the Vietnam War.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a seventeen-minute bonus episode available, on \"These Boots Are Made For Walking\" by Nancy Sinatra, which I mispronounce at the end of this episode as \"These Boots Were Made For Walking\", so no need to correct me here.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, all the songs excerpted in the podcast can be heard in full at Mixcloud.\n\nThe best versions of the Monkees albums are the triple-CD super-deluxe versions that used to be available from monkees.com , and I've used Andrew Sandoval's liner notes for them extensively in this episode. Sadly, though, the only one of those that is still in print is More of the Monkees.\n\nFor those just getting into the group, my advice is to start with this five-CD set, which contains their first five albums along with bonus tracks.\n\nThe single biggest source of information I used in this episode is the first edition of Andrew Sandoval's The Monkees; The Day-By-Day Story. Sadly that is now out of print and goes for hundreds of pounds. Sandoval released a second edition of the book last year, which I was unfortunately unable to obtain, but that too is now out of print. If you can find a copy of either, do get one.\n\nOther sources used were Monkee Business by Eric Lefcowitz, and the autobiographies of three of the band members and one of the songwriters -- Infinite Tuesday by Michael Nesmith, They Made a Monkee Out of Me by Davy Jones, I'm a Believer by Micky Dolenz, and Psychedelic Bubble-Gum by Bobby Hart.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nWe've obviously talked in this podcast about several of the biggest hits of 1966 already, but we haven't mentioned the biggest hit of the year, one of the strangest records ever to make number one in the US -- \"The Ballad of the Green Berets\" by Sgt Barry Sadler:\n\n[Excerpt: Barry Sadler, \"The Ballad of the Green Berets\"]\n\nBarry Sadler was an altogether odd man, and just as a brief warning his story, which will last a minute or so, involves gun violence. At the time he wrote and recorded that song, he was on active duty in the military -- he was a combat medic who'd been fighting in the Vietnam War when he'd got a wound that had meant he had to be shipped back to the USA, and while at Fort Bragg he decided to write and record a song about his experiences, with the help of Robin Moore, a right-wing author of military books, both fiction and nonfiction, who wrote the books on which the films The Green Berets and The French Connection were based.\n\nSadler's record became one of those massive fluke hits, selling over nine million copies and getting him appearances on the Ed Sullivan Show, but other than one top thirty hit, he never had another hit single. Instead, he tried and failed to have a TV career, then became a writer of pulp fiction himself, writing a series of twenty-one novels about the centurion who thrust his spear into Jesus' side when Jesus was being crucified, and is thus cursed to be a soldier until the second coming.\n\nHe moved to Nashville, Tennessee, where he lived until he shot Lee Emerson, a country songwriter who had written songs for Marty Robbins, in the head, killing him, in an argument over a woman. He was sentenced to thirty days in jail for this misdemeanour, of which he served twenty-eight. Later he moved to Guatemala City, where he was himself shot in the head.\n\nThe nearest Army base to Nashville, where Sadler lived after his ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode 144 of A History of Rock Music in Five Hundred Songs looks at “Last Train to Clarksville\" and the beginnings of the career of the Monkees, along with a short primer on the origins of the Vietnam War.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a seventeen-minute bonus episode available, on \"These Boots Are Made For Walking\" by Nancy Sinatra, which I mispronounce at the end of this episode as \"These Boots Were Made For Walking\", so no need to correct me here.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, all the songs excerpted in the podcast can be heard in full at Mixcloud.\n\nThe best versions of the Monkees albums are the triple-CD super-deluxe versions that used to be available from monkees.com ,",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}