{
  "itunes:episode": 72,
  "title": "Community Supported Appliculture with Henry Smith",
  "pubDate": "Thu, 24 Apr 2014 15:04:24 +0000",
  "link": "http://newdisrupt.org/blog/2014/4/24/community-supported-appliculture-with-henry-smith-episode-72",
  "description": "<p>Henry Smith is a games app developer, and the evil genius behind the addictive multi-player app <a href=\"http://www.sleepingbeastgames.com/spaceteam/\">Spaceteam</a>. Spaceteam won oodles of awards, and it has the added benefit (or problem) of being free. Henry <a href=\"https://www.kickstarter.com/projects/hengineer/spaceteam-admirals-club\">has an active Kickstarter</a> to fund future development of free work over the next year. </p>\n\n<h2>Sponsors and Patrons</h2>\n\n<p><a href=\"http://newrelic.com/disruptors\">New Relic</a> helps everyone's software work better, and if you’re in any business today, you’re in the software business. Software powers our apps, runs our databases, manages our accounts, and runs ecommerce sites and email programs. New Relic monitors every move your application makes, across the entire stack, and shows you what's happening right now. Visit <a href=\"http://newrelic.com/disruptors\">newrelic.com/disruptors</a> to find out more.</p>\n\n<p><a href=\"http://mailroute.net/disrupt\">MailRoute</a> filters your mail, quarantines any suspicious mail offsite, and delivers only clean mail to your mailboxes. With one simple click, your domain, mail server and other precious resources are protected. For 10% off the lifetime of your account, and a free 15-day trial, visit <a href=\"http://mailroute.net/disrupt\">mailroute.net/disrupt</a>!</p>\n\n<p>Thanks to patrons Andy Baio, Jonathan Mann, and Abraham Finberg for <a href=\"http://www.patreon.com/newdisruptors\">supporting us directly through Patreon</a>! You can back this podcast for as little as $1 per month. At higher levels, we'll thank you on the air and send you mugs and T-shirts.</p>\n\n<h2>Show notes</h2>\n\n<p>Watch for an upcoming interview with Greg Wohlwend, the developer of the app <a href=\"https://itunes.apple.com/us/app/threes!/id779157948?mt=8\">Threes</a>.</p>\n\n<p>Henry <a href=\"http://www.sleepingbeastgames.com/spaceteam/Numbers/\">shares details openly</a> about Spaceteam's downloads and revenue. He <a href=\"http://www.sleepingbeastgames.com/blog/spaceteam-retrospective/#/vanilla/discussion/embed/?vanilla_discussion_id=0\">wrote a post</a> summing up all the money that's come in, including commissions and prize winnings. Henry's <a href=\"http://www.sleepingbeastgames.com/blog/a-spaceteam-manifesto/\">Spaceteam Manifesto</a> is a more formal expression than this podcast of a lot of the principles driving him.</p>\n\n<p>Greg Knauss talked about exiting a long-time job, some of the paralysis that followed, the fear and reality of failure, and finding a path forward in \"<a href=\"http://newdisrupt.org/blog/2014/2/20/63-failing-upward-with-greg-knauss\">Falling Upward</a>\" (Episode 63).</p>\n",
  "guid": "tag:soundcloud,2010:tracks/146203576",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "00:59:50",
  "itunes:subtitle": "Henry Smith is a games app developer, and the evil genius behind the addictive multi-player app Spaceteam.",
  "itunes:summary": "Henry Smith is a games app developer, and the evil genius behind the addictive multi-player app Spaceteam. Spaceteam won oodles of awards, and it has the added benefit (or problem) of being free. Henry has an active Kickstarter to fund future development of free work over the next year. Sponsored by New Relic http://newrelic.com/disruptors and Mailroute http://mailroute.net/disrupt"
}