{
  "id": "yt:video:usmSXsyJJn8",
  "yt:videoId": "usmSXsyJJn8",
  "yt:channelId": "UCJZ94qp4dtCw0Q5UQqAkg7w",
  "title": "Shooting 1120 arrows in 1.4 min",
  "link": "",
  "author": {
    "name": "larsandersen23",
    "uri": "https://www.youtube.com/channel/UCJZ94qp4dtCw0Q5UQqAkg7w"
  },
  "published": "2020-11-23T14:21:47+00:00",
  "updated": "2022-06-14T14:24:37+00:00",
  "media:group": {
    "media:title": "Shooting 1120 arrows in 1.4 min",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "100 arrows in 18 seconds.\n1000 arrows in 25 seconds.\n\nArab Archery describes shooting 10 small arrows simultaneously (and does not describe feathers on the arrows)  it is like a shotgun, you shoot so many arrows that it is not about precision, one of them probably hit !!!\n\nPower from each arrow is very low but if arrows were poisonous (as many historical arrows were) then arrows hitting in the face or other unprotected areas could be dangerous.\n\nShooting fast 10 handfuls of 10 arrows are not described anywhere in historical sources, I tried to see if it was possible.\nIt was possible and whether it has any practical use, it is quite fun!!\n\nVery much is questionable and can certainly be discussed.\n\nShooting multiple arrows simultaneously is historically controversial.\nIs it a trick without practical use?\nI doubt there is any historical idea in shooting 2 or 3 arrows at the same time.\nIf you compare shooting  2-3 arrows quickly one by one, then you get much much higher power and precision by arrow shot one by one, and it  takes much longer to put several arrows on the string at the same time to be ready for to shoot.\nSo you can fast shoot the same number of arrows at the same time, with much higher power and precision, so why shoot 2-3 arrows simultaneously ?\n\n10 arrows at a time is of course debatable too.\nVery little power and you use a huge number of arrows.\nBut if the purpose is to spread as many arrows as possible, then you may only need, very quickly made arrows in poor quality.\n\nAlthough I very much doubt it was widespread in history that archer shot several arrows at once, I thought it was a fun idea with so many arrows and would share it with others too.\n\nSincerely\nLars Andersen",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}