{
  "title": "Write to a short attention span",
  "link": "",
  "updated": "2020-07-13T00:00:00+00:00",
  "id": "https://mrocklin.github.io/blog/work/2020/07/13/brevity",
  "content": "<p>Speaking truth is easy.  Getting people to listen is hard.</p>\n\n<h3 id=\"summary\">Summary</h3>\n\n<p>This post talks about communicating effectively to a short attention span.\nIt lays out practical writing style advice to respect the reader through brevity.</p>\n\n<p>In particular, we discuss the construction and use of an <em>attention span budget</em>.</p>\n\n<h2 id=\"ten-tips-for-keeping-attention\">Ten Tips for Keeping Attention</h2>\n\n<p>Let’s go through the following ten tips to establish reader trust and build attention span:</p>\n\n<h3 id=\"1--tell-them-where-theyre-going\">1.  Tell them where they’re going</h3>\n\n<p><em>Uncertainty causes stress.  Reduce reader stress.</em></p>\n\n<p>Also, give them a roadmap in case they want to skip around.</p>\n\n<p>In this post we’re going to cover the following tips:</p>\n\n<ol>\n  <li>Tell them where they’re going</li>\n  <li>Front-load content and results</li>\n  <li>Break up long blocks of prose</li>\n  <li>Earn and then burn attention span</li>\n  <li>Say important things</li>\n  <li>Avoid boilerplate</li>\n  <li>Acknowledge bias to build trust</li>\n  <li>Be brutally concise</li>\n  <li>Don’t fill time</li>\n  <li>A worked example</li>\n</ol>\n\n<h3 id=\"2-front-load-content\">2. Front-load content</h3>\n\n<p><em>Put the important bits first.</em></p>\n\n<p>More readers will start your post than will finish it, and those that finish it\nwill skim.</p>\n\n<p>You’ll notice that every section of this document includes a single line of\ntext at the top of the section.  This is because I know that you will skim,\nand I want to make sure that you get the gist of my message, even if you don’t\nstay around for the whole thing.</p>\n\n<p>Front-loading content helps us to earn the readers’ attention,\nand helps make sure the reader gets our message,\neven if we don’t achieve their attention for long.</p>\n\n<h3 id=\"3-break-up-long-blocks-of-prose\">3. Break up long blocks of prose</h3>\n\n<p><em>Humans like variety.  Switch between different visual elements every few lines.</em></p>\n\n<p>By “visual elements” I mean things like the following:</p>\n\n<ol>\n  <li>Paragraphs of normal prose</li>\n  <li>Bulleted lists, like this one</li>\n  <li><strong>Bold text</strong> on a single line, or an indented quote</li>\n  <li>Code blocks (especially if you have colorful syntax highlighting)</li>\n</ol>\n\n<p>Paragraphs or lists longer than four lines are often skipped.\nHowever if you interleave paragraphs and bulleted sections,\nor include some bold text lines and code blocks in there then people\nfind it more reasonable to go through, even if it’s the exact same content.</p>\n\n<p><strong>Interleaving style is an easy way to break things up.</strong></p>\n\n<h3 id=\"4-deliver-lessons-after-earning-the-readers-attention\">4. Deliver lessons after earning the reader’s attention</h3>\n\n<p><em>Win the listener’s respect before you ask for their time.</em></p>\n\n<p>I arrive at content excited.  I’ve already clicked on a post or entered a\nconference talk.  I’ve bought in.</p>\n\n<p>However, that excitement lasts about 20 seconds for a blog post or three\nminutes for a conference talk.  It is within that time that we need to hook the\nlistener/reader and make them want to stay for longer.</p>\n\n<p>This looks different in different contexts:</p>\n\n<ol>\n  <li>\n    <p>In a conference talk I often start out with a live demo.\nMost people save this for the end of the talk,\nbut to me that seems like a missed opportunity to earn attention quickly.</p>\n\n    <p>By seeing a flashy demo the audience is riveted and super-curious about how you achieved it.\nThey’ll hang on every word to figure out your magic.</p>\n  </li>\n  <li>\n    <p>In a blog post you might put important results up front in the summary,\nor start with your primary image.\nYou can include these results or images later in the post as well after you’ve built context,\nbut giving them dessert before the meal can help get them excited.</p>\n  </li>\n</ol>\n\n<p>As an analogy think about a child sitting down to play a game.  They’ll listen\nfor a little while to learn about the instructions, but you have to get playing\nwithin a few minutes, or else they get agitated and leave.  If you can\nmanage it, design your game so that you can start playing right away.\nThen, once they’re invested in the game and see that it’s fun you can get\npretty deep into the rules and they’ll be excited to learn more.</p>\n\n<p>We have to earn the listener’s attention before we can use it to teach them\nthings.</p>\n\n<p>(<em>small pet peeve, when writing talk slides try to avoid placing an “About me”\nsection at the front.  This burns one of your three minutes of starter\nattention span.  The audience probably didn’t come to learn about you.</em>)</p>\n\n<h3 id=\"5-teach-something\">5. Teach something.</h3>\n\n<p><em>Write for a reason.</em></p>\n\n<p>My most popular blog posts were written in a state of controlled rage.</p>\n\n<ol>\n  <li><a href=\"https://matthewrocklin.com/blog/2019/02/28/slack-github\">Why I Avoid Slack?</a></li>\n  <li><a href=\"https://matthewrocklin.com/blog/2019/05/18/maintainer\">The Role of a Maintainer</a></li>\n  <li><a href=\"https://matthewrocklin.com/blog/work/2016/02/08/tests\">Write tests.</a></li>\n</ol>\n\n<p>These were conversations that I had had hundreds of times and wanted to have no longer.\nI wanted to change the behaviors of people immediately around me.\nThey weren’t solving abstract problems or thinking broadly about what the world\nmight be.  No.  They were tightly scoped and specific and borne of great\ninternal turmoil.</p>\n\n<p>The key to a great blog post is to channel internal turmoil into a fair, balanced, and concise document.</p>\n\n<h3 id=\"6--be-novel-avoid-boilerplate\">6.  Be Novel. Avoid Boilerplate.</h3>\n\n<p><em>Most content generated by companies today is low-information.  Don’t copy their bad style.</em></p>\n\n<p>Marketing professionals today employ ghost writers who translate a relevant\nmessage into 1000 words.\nHere is an example:</p>\n\n<ul>\n  <li><strong>Product Marketing team</strong>: <em>We just released our new machine learning product that helps companies meet their cyber security needs.  We would like to raise awareness.</em></li>\n  <li><strong>Ghost writer</strong>: <em>Sure. 1000 word blog post coming right up</em></li>\n</ul>\n\n<p>This becomes a long post about the company’s\nhistory, the history of cyber-security, how machine learning has been used to\nrevolutionize other fields, and other things that readers have already read.\nMore often than not it’s a waste of time.</p>\n\n<p>If you’re new to writing, then you might be tempted to copy what you see.\nThis is safe, but I encourage you to develop your own style quickly.\nBe brief, be genuine, and rework the same content a few times and you’ll\nkick the crap out of ghost content within a few tries.\nYou don’t need to “try to look like a blog post”.</p>\n\n<p><em>This applies to slide presentations, talks, and everything else too</em></p>\n\n<h3 id=\"7--stay-balanced-acknowledge-your-bias\">7.  Stay Balanced. Acknowledge Your Bias</h3>\n\n<p><em>The best way to establish trust is to acknowledge your bias</em></p>\n\n<p><em>Well, hey, I get paid if you buy this thing, so you probably shouldn’t trust me, but let’s dive into it and you can come to your own conclusions.</em></p>\n\n<p>Honesty is disarming and a wonderful way to establish connection.\nIt has the side benefit of being the right thing to do.</p>\n\n<p>My favorite example of this is our <a href=\"https://docs.dask.org/en/latest/spark.html\">Dask vs Spark</a> documentation.\nIt’s informative and tries hard to be unbiased.\nIt also ends with this line, which we’ve gotten repeated praise for:</p>\n\n<blockquote>\n  <p>If you are looking to manage a terabyte or less of tabular CSV or JSON data, then you should forget both Spark and Dask and use Postgres or MongoDB.</p>\n</blockquote>\n\n<p>:)</p>\n\n<p>Also, staying balanced and honest will build self-respect.\nWe’re social animals, and being honest to our neighbors makes us feel fulfilled.</p>\n\n<h3 id=\"8--be-brutally-concise\">8.  Be Brutally Concise</h3>\n\n<p><em>Every word costs attention.  Remove unnecessary words.</em></p>\n\n<h3 id=\"9--dont-fill-time\">9.  Don’t fill time</h3>\n\n<p><em>When you’re done, be done.  Everyone appreciates getting time back.</em></p>\n\n<h3 id=\"10-example\">10. Example</h3>\n\n<p>This is the last piece of material I was working on with a colleague about an upcoming webinar.\nWe’re going to show before and after:</p>\n\n<h4 id=\"before\">Before</h4>\n\n<p>This Thursday at 5pm ET, we’ll be piloting our very first YouTube Live stream here at Coiled!</p>\n\n<p>We’ll be talking about scalable computing, when you want to do it and when you don’t, and doing some live Python coding to show you how to</p>\n\n<ul>\n  <li>Use Dask to scale up your pandas code to larger datasets locally, in order to utilize all your cores on your laptop or local workstation and</li>\n  <li>Use Dask and Coiled to scale out your computation to a cluster on the cloud, when you need more cores than your laptop can provide.</li>\n</ul>\n\n<p>We’ll first chat about the general uses of distributed computing and how to figure out when you really need to use it (generally when you’re either RAM-bound or CPU-bound). We’ll then dive into using the now famous NYC taxi dataset and we’ll see how you can seamlessly move from pandas to dask to scale up computation, all within the comfortable environment of JupyterLab. The scalable dask code you write mimics the pandas API because, as we’ve written before, the social goal of dask was to “invent nothing” (we wanted to be as familiar as possible to what users already knew in the PyData stack).</p>\n\n<h4 id=\"after\">After</h4>\n\n<p>Join us for Coiled’s first live stream!</p>\n\n<p>We’ll cover both the opportunities and the challenges of scaling data science workloads with Pandas using a real-world example:</p>\n\n<ol>\n  <li>Explore and clean a raw dataset with Pandas</li>\n  <li>Scale this workload locally with Dask</li>\n  <li>Scale this workload onto the cloud with Dask and Coiled</li>\n</ol>\n\n<p>Join us this Thursday 5pm US Eastern time as we encounter, triage,\nand resolve common challenges that come with scaling data science in the real world.</p>\n\n<h4 id=\"analysis\">Analysis</h4>\n\n<p>We’ve lost some content, but everything is a lot tighter.\nThe content that we lost wasn’t critical to our objective of informing the\nreader that they should attend the webinar, or what the webinar would be about.</p>\n\n<h2 id=\"extra-personal-anecdote\">Extra: Personal Anecdote</h2>\n\n<p><em>My first draft of this post had this section first, but I figured it wasn’t\nthat important, so I put it down here instead.  You can safely skip it.</em></p>\n\n<p>Teaching students taught me the value of writing to an attention budget.</p>\n\n<p>As a graduate student I taught computer science to technical non-majors\n(physics/math/econ students mostly).  Students participated in practical\nsessions in the computer lab where they would read a set of instructions and\nthen proceed to work through projects with us behind them.</p>\n\n<p>The instructions looked like this:</p>\n\n<blockquote>\n  <p>Today we’re covering object oriented programming and classes.  A class looks\nlike this:</p>\n</blockquote>\n\n<div class=\"language-python highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code><span class=\"k\">class</span> <span class=\"nc\">Human</span><span class=\"p\">:</span>\n    <span class=\"k\">def</span> <span class=\"nf\">__init__</span><span class=\"p\">(</span><span class=\"bp\">self</span><span class=\"p\">,</span> <span class=\"n\">name</span><span class=\"p\">:</span> <span class=\"nb\">str</span><span class=\"p\">):</span>\n        <span class=\"bp\">self</span><span class=\"p\">.</span><span class=\"n\">name</span> <span class=\"o\">=</span> <span class=\"n\">name</span>\n\n    <span class=\"k\">def</span> <span class=\"nf\">mate</span><span class=\"p\">(</span><span class=\"bp\">self</span><span class=\"p\">,</span> <span class=\"n\">partner</span><span class=\"p\">:</span> <span class=\"n\">Human</span><span class=\"p\">)</span> <span class=\"o\">-&gt;</span> <span class=\"n\">Child</span><span class=\"p\">:</span>\n        <span class=\"p\">...</span>\n</code></pre></div></div>\n\n<blockquote>\n  <p>In our next exercise you will extend this class to …</p>\n</blockquote>\n\n<p>And so on.  When I wrote bad instructions, all of the students would have lots\nof problems, and the lab was stressful for me.  When I wrote good instructions the\nstudents would be fine and I could relax and joke around with them (scientists\nwho choose to learn programming are invariably great to be around).</p>\n\n<p>To be clear the difference between “good” and “bad” instructions wasn’t in the\ncontent, it was whether or not the student actually read through all of the instructions.</p>\n\n<p><strong>Teaching is a game where you have to capture someone’s attention while\nsimultaneously shoving knowledge into their brain.</strong></p>\n\n<p><em>Thank you to <a href=\"https://hugobowne.github.io/\">Hugo Bowne-Anderson</a> for his thoughtful remarks on this post</em></p>"
}