{
  "title": "Deep meta-learning for the selection of accurate ultrasound based breast mass classifier. (arXiv:2211.01892v1 [eess.IV])",
  "link": "http://arxiv.org/abs/2211.01892",
  "description": "<p>Standard classification methods based on handcrafted morphological and\ntexture features have achieved good performance in breast mass differentiation\nin ultrasound (US). In comparison to deep neural networks, commonly perceived\nas \"black-box\" models, classical techniques are based on features that have\nwell-understood medical and physical interpretation. However, classifiers based\non morphological features commonly underperform in the presence of the\nshadowing artifact and ill-defined mass borders, while texture based\nclassifiers may fail when the US image is too noisy. Therefore, in practice it\nwould be beneficial to select the classification method based on the appearance\nof the particular US image. In this work, we develop a deep meta-network that\ncan automatically process input breast mass US images and recommend whether to\napply the shape or texture based classifier for the breast mass\ndifferentiation. Our preliminary results demonstrate that meta-learning\ntechniques can be used to improve the performance of the standard classifiers\nbased on handcrafted features. With the proposed meta-learning based approach,\nwe achieved the area under the receiver operating characteristic curve of 0.95\nand accuracy of 0.91.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/eess/1/au:+Byra_M/0/1/0/all/0/1\">Michal Byra</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Karwat_P/0/1/0/all/0/1\">Piotr Karwat</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Ryzhankow_I/0/1/0/all/0/1\">Ivan Ryzhankow</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Komorowski_P/0/1/0/all/0/1\">Piotr Komorowski</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Klimonda_Z/0/1/0/all/0/1\">Ziemowit Klimonda</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Fura_L/0/1/0/all/0/1\">Lukasz Fura</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Pawlowska_A/0/1/0/all/0/1\">Anna Pawlowska</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Zolek_N/0/1/0/all/0/1\">Norbert Zolek</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Litniewski_J/0/1/0/all/0/1\">Jerzy Litniewski</a>"
}