{
  "id": "https://bibleinoneyear.org/en/youth/264",
  "title": "Day 264: Never Give Up",
  "description": "Proverbs 23:17–18, Isaiah 49:8-25, Galatians 6:1–10.  We require instant returns and instant results  But sometimes the biggest pay-offs are a long time coming",
  "pubDate": "Wed, 21 Sep 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/264/",
  "itunes:duration": "14:22",
  "guid": "enyouth21092022-264",
  "length": 862.82,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 264: Never Give Up",
  "itunes:subtitle": "Proverbs 23:17–18, Isaiah 49:8-25, Galatians 6:1–10.  We require instant returns and instant results  But sometimes the biggest pay-offs are a long time coming",
  "itunes:summary": "Sir Winston Churchill has been described as Britain’s greatest ever leader. He lived a long, heroic life and he rallied a nation with his inspiring rhetoric. One of the most striking parts of his biography is that he had to resign from the Admiralty during WWI over the failed Dardanelles campaign. He had failed spectacularly, yet he was to learn not to give up.\nI was told that once, when he returned to his old school, Harrow, to address the boys, the whole school assembled to listen to his words of wisdom. The great man arose to speak: ‘Young men; never give up, never give up, never give up.’ The entire speech lasted only a few seconds. Then he sat down. No one present ever forgot his words.\nThat is, at least, the popular version of the story. Churchill did indeed say words to that effect, but as part of a longer speech. Towards the end he said, ‘Never give in. Never give in. Never, never, never, never – in nothing, great or small, large or petty – never give in, except to convictions of honour and good sense. Never yield to force. Never yield to the apparently overwhelming might of the enemy.’\nIn today’s generation, our lives have become so instantaneous that anything requiring patient perseverance can appear unattractive. We require instant returns and instant results. But sometimes the biggest pay-offs are a long time coming.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 629
}