{
  "title": "Episode 52: &#8220;Twenty Flight Rock&#8221;, by Eddie Cochran",
  "link": "https://500songs.com/podcast/episode-52-twenty-flight-rock-by-eddie-cochran/",
  "pubDate": "Mon, 14 Oct 2019 05:42:47 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-52-twenty-flight-rock-by-eddie-cochran/",
  "description": "Episode fifty-two of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Twenty Flight Rock\" by Eddie Cochran, and at the first great rock and roll film Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/30742419\">\"Teen-Age Crush\" by Tommy Sands</a>.\n\n\n\n<strong>Resources</strong>\n\nThere are several books available on Cochran, but for this episode I mostly relied on <a href=\"https://amzn.to/2losisr\"><em>Gene Vincent and Eddie Cochran: Rock and Roll Revolutionaries</em> by John Collis.</a> I'll be using others as well in forthcoming episodes.\n\nWhile there are dozens of compilations of Cochran's music available, many of them are flawed in one way or another (including the Real Gone Music four-CD set, which is what I would normally recommend). <a href=\"https://amzn.to/2oDr1zy\">This one</a> is probably the best you can get for Cochran novices.\n\nAnd as always there's <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-52-teen-age-crush/\">a Mixcloud</a> with the full versions of all the songs featured in today's episode.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nTo tell the story of rock music, it's important to tell the story of the music's impact on other media. Rock and roll was a cultural phenomenon that affected almost everything, and it affected TV, film, clothing and more. So today, we're going to look at how a film made the career of one of the greats of rock and roll music:\n\n[Excerpt: Eddie Cochran, \"Twenty Flight Rock\"]\n\nEddie Cochran was born in Albert Lea, Minnesota, though in later life he would always claim to be an Okie rather than from Albert Lea. His parents were from Oklahoma, they moved to Minnesota shortly before Eddie was born, and they moved back to Oklahoma City when he was small, moved back again to Minnesota, and then moved off to California with the rest of the Okies.\n\nCochran was a staggeringly precocious guitarist. On the road trip to California from Albert Lea, he had held his guitar on his lap for the entire journey, referring to it as his best friend. And once he hit California he quickly struck up a musical relationship with two friends -- Guybo Smith, who played bass, and Chuck Foreman, who played steel guitar. The three of them got hold of a couple of tape recorders, which allowed them not only to record themselves, but to experiment with overdubbing in the style of Les Paul. Some of those recordings have seen release in recent years, and they're quite astonishing:\n\n[Excerpt: Eddie Cochran and Chuck Foreman, \"Rockin' It\"]\n\nCochran plays all the guitars on that (except the steel guitar, which is Foreman) and he was only fourteen years old at the time.\n\nHe played with several groups who were playing the Okie Western Swing and proto-rockabilly that was popular in California at the time, and eventually hooked up with a singer from Mississippi who was born Garland Perry, but who changed his name to Hank Cochran, allowing the duo to perform under the name \"the Cochran Brothers\".\n\nThe Cochran Brothers soon got a record deal. When they started out, they were doing pure country music, and their first single was a Louvin Brothers style close harmony song, about Jimmie Rodgers and Hank Williams:\n\n[Excerpt: The Cochran Brothers, \"Two Blue Singing Stars\"]\n\nBut while Hank was perfectly happy making this kind of music, Eddie was getting more and more interested in the new rock and roll music that was starting to become popular, and the two of them eventually split up over actual musical differences.\n\nHank Cochran would go on to have a long and successful career in the country industry, but Eddie was floundering. He knew that this new music was what he should be playing, and he was one of the best guitarists around, but he wasn't sure how to become a rock and roller, or even if he wanted to be a singer at all, rather than just a guitar player. He hooked up with Jerry Capehart, a singer and songwriter who the Cochran Brothers had earlier backed on a single:\n\n[Excerpt: Jerry Capehart and the Cochran Brothers, \"Walkin' Stick Boogie\"]\n\nThe two of them started writing songs together, and Eddie also started playing as a session musician. He played on dozens of sessions in the mid-fifties, mostly uncredited, and scholars are still trying to establish a full list of the records he played on.\n\nBut while he was doing this, he still hadn't got himself a record contract, other than for a single record on an independent label:\n\n[Excerpt: Eddie Cochran, \"Skinny Jim\"]\n\nCochran was in the studio recording demos for consideration by record labels when Boris Petroff, a B-movie director who was a friend of Cochran's collaborator Jerry Capehart, dropped in. Petroff decided that Cochran had the looks to be a film star, and right there offered him a part in a film that was being made under the working title Do-Re-Mi. Quite how Petroff had the ability to give Cochran a part in a film he wasn't working on, I don't know, but he did, and the offer was a genuine one, as Cochran confirmed the next day.\n\nThere were many, many, rock and roll films made in the 1950s, and most of them were utterly terrible. It says something about the genre as a whole when I tell you that Elvis' early films, which are not widely regarded as cinematic masterpieces, are among the very best rock and roll films of the decade.\n\nThe 1950s were the tipping point for television ownership in both the US and the UK, but while TV was quickly becoming a mass medium, cinema-going was still at levels that would stagger people today -- *everyone* went to the cinema.\n\nAnd when you went to the cinema, you didn't go just to see one film. There'd be a main film, a shorter film called a B-movie that lasted maybe an hour, and short features like cartoons and newsreels. That meant that there was a much greater appetite for cheap films that could be used to fill out a programme, despite their total lack of quality. This is where, for example, all the films that appear in Mystery Science Theater 3000 come from, or many of them.\n\nAnd these B-movies would be made in a matter of weeks, or even days, and so would quickly be turned round to cash in on whatever trend was happening right at that minute. And so between 1956 and 1958 there were several dozen films, with titles like \"Rock! Rock! Rock!\", \"Don't Knock The Rock\" and so on.\n\n[Excerpt: Bill Haley and the Comets, “Don't Knock the Rock”]\n\nIn every case, these films were sold entirely on the basis of the musical performances therein, with little or no effort to sell them as narratives, even though they all had plots of sorts. They were just excuses to get footage of as many different hit acts as possible into the cinemas, ideally before their songs dropped off the charts. (Many of them also contained non-hit acts, like Teddy Randazzo, who seemed to appear in all of them despite never having a single make the top fifty. Randazzo did, though, go on to write a number of classic hits for other artists).\n\nVery few of the rock and roll films of the fifties were even watchable at all. We talked in the episode on \"Brown-Eyed Handsome Man\" about the film \"Rock! Rock! Rock!\" which Chuck Berry appeared in -- that was actually towards the more watchable end of these films, terrible as it was.\n\nThe film that Cochran was signed to appear in, which was soon renamed The Girl Can't Help It, is different. There are plenty of points at which the action stops for a musical performance, but there is an actual plot, and actual dialogue and acting. While the film isn't a masterpiece or anything like that, it is a proper film.\n\nAnd it's made by a proper studio. While, for example, Rock! Rock! Rock! was made by a fly-by-night company called Vanguard Productions, The Girl Can't Help It was made by Twentieth Century Fox. And it was made in both colour and Cinemascope. The budget for Rock! Rock! Rock! was seventy-five thousand dollars compared to the 1.3 million dollars spent on The Girl Can't Help It.\n\n[Excerpt: Little Richard, “The Girl Can't Help It”]\n\nIndeed, it seems to be as much an attempt to cash in on a Billy Wilder film as it is an attempt to cash in on rock and roll. The previous year, The Seven-Year Itch had been a big hit, with Tom Ewell playing an unassuming middle-aged man who becomes worryingly attracted to a much younger woman, played by Marilyn Monroe. The film had been a massive success (and it's responsible for the famous scene with Monroe on the air grate, which is still homaged and parodied to this day) and so the decision was taken to cast Tom Ewell as an unassuming middle-aged man who becomes worryingly attracted to a much younger woman, played by Jayne Mansfield doing her usual act of being a Marilyn Monroe impersonator.\n\nJust as the film was attempting to sell itself on the back of a more successful hit film, the story also bears a certain amount of resemblance to one by someone else. The playwright Garson Kanin had been inspired in 1955 by the tales of the jukebox wars -- he'd discovered that most of the jukeboxes in the country were being run by the Mafia, and that which records got stocked and played depended very much on who would do favours for the various gangsters involved. Gangsters would often destroy rivals' jukeboxes, and threaten bar owners if they were getting their jukeboxes from the wrong set of mobsters.\n\nKanin took this idea and turned it into a novella, Do-Re-Mi, about a helpless schlub who teams up with a gangster named \"Fatso\" to enter the record business, and on the way more or less accidentally makes a young woman into a singing star. Do-Re-Mi later became a moderately successful stage musical, which introduced the song \"Make Someone Happy\".\n\n[Excerpt: Doris Day, “Make Someone Happy”]\n\nMeanwhile the plot of The Girl Can't Help It has a helpless schlub team up with a mobster named \"Fats\", and the two of them working together to make the mobster's young girlfriend into a singing star.\n\nI've seen varying accounts as to why The Girl Can't Help It was renamed from Do-Re-Mi and wasn't credited as being based on Kanin's novella. Some say that the film was made without the rights having been acquired, and changed to the point that Kanin wouldn't sue. Others say that Twentieth Century Fox acquired the rights perfectly legally, but that the director, Frank Tashlin changed the script around so much that Kanin asked that his credit be removed, because it was now so different from his novella that he could probably resell the rights at some future point.\n\nThe latter seems fairly likely to me, given that Tashlin's next film, Will Success Spoil Rock Hunter?, which also starred Jayne Mansfield, contained almost nothing from the play on which it was based.\n\nIndeed, the original play Will Success Spoil Rock Hunter? was by the author of the original play on which The Seven-Year Itch was based. The playwright had been so annoyed at the way in which his vision had been messed with for the screen that he wrote Will Success Spoil Rock Hunter? as a satire about the way the film industry changes writers' work, and Mansfield was cast in the play. When Tashlin wanted Mansfield to star in The Girl Can't Help It but she was contractually obliged to appear in the play, Fox decided the easiest thing to do was just to buy up the rights to the play and relieve Mansfield of her obligation so she could star in The Girl Can't Help It.\n\nThey then, once The Girl Can't Help It finished, got Frank Tashlin to write a totally new film with the title Will Success Spoil Rock Hunter?, keeping only the title and Mansfield's character.\n\nWhile The Girl Can't Help It has a reputation for satirising rock and roll, it actually pulls its punches to a surprising extent. For example, there's a pivotal scene where the main mobster character, Fats, calls our hero after seeing Eddie Cochran on TV:\n\n[excerpt: dialogue from \"The Girl Can't Help It\"]\n\nNote the wording there, and what he doesn't say. He doesn't say that Cochran can't sing, merely that he \"ain't got a trained voice\". The whole point of this scene is to set up that Jerry Jordan, Mansfield's character, could become a rock and roll star even though she can't sing at all, and yet when dealing with a real rock and roll star they are careful to be more ambiguous.\n\nBecause, of course, the main thing that sold the film was the appearance of multiple rock and roll stars -- although \"stars\" is possibly overstating it for many of those present in the film. One thing it shared with most of the exploitation films was a rather slapdash attitude to which musicians the film would actually feature. And so it has the genuinely big rock and roll stars of the time Little Richard, the Platters, and Fats Domino, the one-hit wonder Gene Vincent (but what a one hit to have), and a bunch of… less well-known people, like the Treniers -- a jump band who'd been around since the forties and never really made a major impact, or Eddie Fontaine (about whom the less said the better), or the ubiquitous Teddy Randazzo, performing here with an accordion accompaniment.\n\n[Excerpt: Teddy Randazzo and the Three Chuckles, “Cinnamon Sinner”]\n\nAnd Cochran was to be one of those lesser-known acts, so he and Capehart had to find a song that might be suitable for him to perform in the film. Very quickly they decided on a song called \"Twenty Flight Rock\", written by a songwriter called Nelda Fairchild.\n\nThere has been a lot of controversy as to who actually contributed what to the song, which is copyrighted in the names of both Fairchild and Cochran. Fairchild always claimed that she wrote the whole thing entirely by herself, and that Cochran got his co-writing credit for performing the demo, while Cochran's surviving relatives are equally emphatic in their claims that he was an equal contributor as a songwriter.\n\nWe will almost certainly never know the truth. Cochran is credited as the co-writer of several other hit songs, usually with Capehart, but never as the sole writer of a hit. Fairchild, meanwhile, was a professional songwriter, but pieces like \"Freddie the Little Fir Tree\" don't especially sound like the work of the same person who wrote \"Twenty Flight Rock\". As both credited writers are now dead, the best we can do is use our own judgement, and my personal judgement is that Cochran probably contributed at least something to the song's writing.\n\nThe original version of \"Twenty Flight Rock\", as featured in the film, was little more than a demo -- it featured Cochran on guitar, Guybo Smith on double bass, and Capehart slapping a cardboard box to add percussion. Cochran later recorded a more fully-arranged version of the song, which came out after the film, but the extra elements, notably the backing vocals, added little to the simplistic original:\n\n[Excerpt: Eddie Cochran, \"Twenty Flight Rock\"]\n\nIt was that simpler version that appeared in the film, and which took its place alongside several other classic tracks in the film's soundtrack.\n\nThe film was originally intended to have a theme tune recorded by Fats Domino, who appeared in the film performing his hit \"Blue Monday\", but when Bobby Troup mentioned this to Art Rupe, Rupe suggested that Little Richard would be a more energetic star to perform the song (and I'm sure this was entirely because of his belief that Richard would be the better talent, and nothing to do with Rupe owning Richard's label, but not Domino's).\n\nAs a result, Domino's role in the film was cut down to a single song, while Richard ended up doing three -- the title song, written by Troup, \"Ready Teddy\" by John Marascalco and Bumps Blackwell, and \"She's Got It\".\n\nWe've mentioned before that John Marascalco's writing credits sometimes seem to be slightly exaggerated, and “She's Got It” is one record that tends to bear that out. Listen to “She's Got It”, which has Marascalco as the sole credited writer:\n\n[Excerpt: Little Richard, “She's Got It”]\n\nAnd now listen to “I Got It”, an earlier record by Richard, which has Little Richard credited as the sole writer:\n\n[Excerpt: Little Richard, “I Got It”]\n\nHmm…\n\nThe Girl Can't Help It was rather poorly reviewed in America. In France it was a different story. There's a pervasive legend that the people of France revere Jerry Lewis as a genius. This is nonsense. But the grain of truth in it is that Cahiers du Cinema, the most important film magazine in France by a long way -- the magazine for which Godard, Truffaut, and others wrote, and which popularised the concept of auteur theory, absolutely loved Frank Tashlin. In 1957, Tashlin was the only director to get two films on their top ten films of the year list -- The Girl Can't Help It at number eight, and Will Success Spoil Rock Hunter at number two. The other eight films on the list were directed by Chaplin, Fellini, Hitchcock, Bunuel, Ingmar Bergman, Nicholas Ray, Fritz Lang and Sidney Lumet.\n\nTashlin directed several films starring Jerry Lewis, and those films, like Tashlin's other work, got a significant amount of praise in the magazine. And that's where that legend actually comes from, though Cahiers did also give some more guarded praise to some of the films Lewis directed himself later.\n\nTashlin wasn't actually that good a director, but what he did have is a visual style that came from a different area of filmmaking than most of his competitors. Tashlin had started out as a cartoon director, working on Warner Brothers cartoons. He wasn't one of the better directors for Warners, and didn't direct any of the classics people remember from the studio -- he mostly made forgettable Porky Pig shorts. But this meant he had an animator's sense for a visual gag, and thus gave his films a unique look. For advocates of auteur theory, that was enough to push him into the top ranks.\n\nAnd so The Girl Can't Help It became a classic film, and Cochran got a great deal of attention, and a record deal.\n\nAccording to Si Waronker, the head of Liberty Records, Eddie Cochran getting signed to the label had nothing to do with him being cast in The Girl Can't Help It, and Waronker had no idea the film was being made when Cochran got signed. This seems implausible, to say the least. Johnny Olenn, Abbey Lincoln and Julie London, three other Liberty Records artists, appeared in the film -- and London was by some way Liberty's biggest star. Not only that, but London's husband, Bobby Troup, wrote the theme song and was musical director for the film.\n\nBut whether or not Cochran was signed on account of his film appearance, \"Twenty Flight Rock\" wasn't immediately released as a single. Indeed, by the time it came out Cochran had already appeared in another film, in which he had backed Mamie Van Doren -- another Marilyn Monroe imitator in the same vein as Mansfield -- on several songs, as well as having a small role and a featured song himself.\n\nOddly, when that film, Untamed Youth, came out, Cochran's backing on Van Doren's recordings had been replaced by different instrumentalists. But he still appears on the EP that was released of the songs, including this one, which Cochran co-wrote with Capehart:\n\n[Excerpt: Mamie Van Doren, \"Ooh Ba La Baby\"]\n\nIt had originally been planned to release \"Twenty Flight Rock\" as Cochran's first single on Liberty, to coincide with the film's release but then it was put back for several months, as Si Waronker wanted Cochran to release \"Sitting in the Balcony\" instead. That song had been written and originally recorded by John D Loudermilk:\n\n[Excerpt: John D Loudermilk, \"Sitting in the Balcony\"]\n\nWaronker had wanted to release Loudermilk's record, but he hadn't been able to get the rights, so he decided to get Cochran to record a note-for-note cover version and release that instead:\n\n[Excerpt: Eddie Cochran, \"Sitting in the Balcony\"]\n\nCochran was not particularly happy with that record, though he was happy enough once the record started selling in comparatively vast quantities, spurred by his appearance in The Girl Can't Help It, and reached number eighteen in the charts. The problem was that Cochran and Waronker had fundamentally different ideas about what Cochran actually was as an artist. Cochran thought of himself primarily as a guitarist -- and the guitar solo on \"Sittin' in the Balcony\" was the one thing about Cochran's record which distinguished it from Loudermilk's original -- and also as a rock and roller. Waronker, on the other hand, was convinced that someone with Cochran's good looks and masculine voice could easily be another Pat Boone.\n\nLiberty was fundamentally not geared towards making rock and roll records. Its other artists included the Hollywood composer Lionel Newman, the torch singer Julie London, and a little later novelty acts like the Chipmunks -- the three Chipmunks, Alvin, Simon, and Theodore, being named after Al Bennett, Si Waronker, and Theodore Keep, the three men in charge of the label. And their attempts to force Cochran into the mould of a light-entertainment crooner produced a completely forgettable debut album, Singin' to My Baby, which has little of the rock and roll excitement that would characterise Cochran's better work.\n\n(And a warning for anyone who decides to go out and listen to that album anyway -- one of the few tracks on there that *is* in Cochran's rock and roll style is a song called \"Mean When I'm Mad\", which is one of the most misogynist things I have heard, and I've heard quite a lot -- it's basically an outright rape threat. So if that's something that will upset you, please steer clear of Cochran's first album, while knowing you're missing little artistically.)\n\n“Twenty Flight Rock” was eventually released as a single, in its remade version, in November 1957, almost a year after The Girl Can't Help It came out. Unsurprisingly, coming out so late after the film, it didn't chart, and it would be a while yet before Cochran would have his biggest hit. But just because it didn't chart, doesn't mean it didn't make an impression.\n\nThere's one story, more than any other, that sums up the impact both of \"The Girl Can't Help It\" and of \"Twenty Flight Rock\" itself. In July 1957, a skiffle group called the Quarrymen, led by a teenager called John Lennon, played a village fete in Woolton, a suburb of Liverpool. After the show, they were introduced to a young boy named Paul McCartney by a mutual friend.\n\nLennon and McCartney hit it off, but the thing that persuaded Lennon to offer McCartney a place in the group was when McCartney demonstrated that he knew all the words to \"Twenty Flight Rock\". Lennon wasn't great at remembering lyrics, and was impressed enough by this that he decided that this new kid needed to be in the group.\n\n[Excerpt: Paul McCartney, “Twenty Flight Rock”]\n\nThat's the impact that The Girl Can't Help It had, and the impact that \"Twenty Flight Rock\" had. But Eddie Cochran's career was just starting, and we'll see more of him in future episodes...",
  "itunes:subtitle": "Episode fifty-two of A History of Rock Music in Five Hundred Songs looks at Twenty Flight Rock by Eddie Cochran, and at the first great rock and roll film Click the full post to read liner notes, links to more information, and a transcript of the episode",
  "itunes:keywords": "Art Rupe,country and western,Eddie Cochran,Hank Cochran,Jerry Capehart,John Lennon,John Marascalco,Liberty Records,Little Richard,Paul McCartney,Si Waronker,Teddy Randazzo,The Quarrymen",
  "itunes:episodeType": "full",
  "itunes:episode": 52,
  "content:encoded": "Episode fifty-two of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Twenty Flight Rock\" by Eddie Cochran, and at the first great rock and roll film Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/30742419\">\"Teen-Age Crush\" by Tommy Sands</a>.\n\n\n\n<strong>Resources</strong>\n\nThere are several books available on Cochran, but for this episode I mostly relied on <a href=\"https://amzn.to/2losisr\"><em>Gene Vincent and Eddie Cochran: Rock and Roll Revolutionaries</em> by John Collis.</a> I'll be using others as well in forthcoming episodes.\n\nWhile there are dozens of compilations of Cochran's music available, many of them are flawed in one way or another (including the Real Gone Music four-CD set, which is what I would normally recommend). <a href=\"https://amzn.to/2oDr1zy\">This one</a> is probably the best you can get for Cochran novices.\n\nAnd as always there's <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-52-teen-age-crush/\">a Mixcloud</a> with the full versions of all the songs featured in today's episode.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nTo tell the story of rock music, it's important to tell the story of the music's impact on other media. Rock and roll was a cultural phenomenon that affected almost everything, and it affected TV, film, clothing and more. So today, we're going to look at how a film made the career of one of the greats of rock and roll music:\n\n[Excerpt: Eddie Cochran, \"Twenty Flight Rock\"]\n\nEddie Cochran was born in Albert Lea, Minnesota, though in later life he would always claim to be an Okie rather than from Albert Lea. His parents were from Oklahoma, they moved to Minnesota shortly before Eddie was born, and they moved back to Oklahoma City when he was small, moved back again to Minnesota, and then moved off to California with the rest of the Okies.\n\nCochran was a staggeringly precocious guitarist. On the road trip to California from Albert Lea, he had held his guitar on his lap for the entire journey, referring to it as his best friend. And once he hit California he quickly struck up a musical relationship with two friends -- Guybo Smith, who played bass, and Chuck Foreman, who played steel guitar. The three of them got hold of a couple of tape recorders, which allowed them not only to record themselves, but to experiment with overdubbing in the style of Les Paul. Some of those recordings have seen release in recent years, and they're quite astonishing:\n\n[Excerpt: Eddie Cochran and Chuck Foreman, \"Rockin' It\"]\n\nCochran plays all the guitars on that (except the steel guitar, which is Foreman) and he was only fourteen years old at the time.\n\nHe played with several groups who were playing the Okie Western Swing and proto-rockabilly that was popular in California at the time, and eventually hooked up with a singer from Mississippi who was born Garland Perry, but who changed his name to Hank Cochran, allowing the duo to perform under the name \"the Cochran Brothers\".\n\nThe Cochran Brothers soon got a record deal. When they started out, they were doing pure country music, and their first single was a Louvin Brothers style close harmony song, about Jimmie Rodgers and Hank Williams:\n\n[Excerpt: The Cochran Brothers, \"Two Blue Singing Stars\"]\n\nBut while Hank was perfectly happy making this kind of music, Eddie was getting more and more interested in the new rock and roll music that was starting to become popular, and the two of them eventually split up over actual musical differences.\n\nHank Cochran would go on to have a long and successful career in the country industry, but Eddie was floundering. He knew that this new music was what he should be playing, and he was one of the best guitarists around, but he wasn't sure how to become a rock and roller, or even if he wanted to be a singer at all, rather than just a guitar player. He hooked up with Jerry Capehart, a singer and songwriter who the Cochran Brothers had earlier backed on a single:\n\n[Excerpt: Jerry Capehart and the Cochran Brothers, \"Walkin' Stick Boogie\"]\n\nThe two of them started writing songs together, and Eddie also started playing as a session musician. He played on dozens of sessions in the mid-fifties, mostly uncredited, and scholars are still trying to establish a full list of the records he played on.\n\nBut while he was doing this, he still hadn't got himself a record contract, other than for a single record on an independent label:\n\n[Excerpt: Eddie Cochran, \"Skinny Jim\"]\n\nCochran was in the studio recording demos for consideration by record labels when Boris Petroff, a B-movie director who was a friend of Cochran's collaborator Jerry Capehart, dropped in. Petroff decided that Cochran had the looks to be a film star, and right there offered him a part in a film that was being made under the working title Do-Re-Mi. Quite how Petroff had the ability to give Cochran a part in a film he wasn't working on, I don't know, but he did, and the offer was a genuine one, as Cochran confirmed the next day.\n\nThere were many, many, rock and roll films made in the 1950s, and most of them were utterly terrible. It says something about the genre as a whole when I tell you that Elvis' early films, which are not widely regarded as cinematic masterpieces, are among the very best rock and roll films of the decade.\n\nThe 1950s were the tipping point for television ownership in both the US and the UK, but while TV was quickly becoming a mass medium, cinema-going was still at levels that would stagger people today -- *everyone* went to the cinema.\n\nAnd when you went to the cinema, you didn't go just to see one film. There'd be a main film, a shorter film called a B-movie that lasted maybe an hour, and short features like cartoons and newsreels. That meant that there was a much greater appetite for cheap films that could be used to fill out a programme, despite their total lack of quality. This is where, for example, all the films that appear in Mystery Science Theater 3000 come from, or many of them.\n\nAnd these B-movies would be made in a matter of weeks, or even days, and so would quickly be turned round to cash in on whatever trend was happening right at that minute. And so between 1956 and 1958 there were several dozen films, with titles like \"Rock! Rock! Rock!\", \"Don't Knock The Rock\" and so on.\n\n[Excerpt: Bill Haley and the Comets, “Don't Knock the Rock”]\n\nIn every case, these films were sold entirely on the basis of the musical performances therein, with little or no effort to sell them as narratives, even though they all had plots of sorts. They were just excuses to get footage of as many different hit acts as possible into the cinemas, ideally before their songs dropped off the charts. (Many of them also contained non-hit acts, like Teddy Randazzo, who seemed to appear in all of them despite never having a single make the top fifty. Randazzo did, though, go on to write a number of classic hits for other artists).\n\nVery few of the rock and roll films of the fifties were even watchable at all. We talked in the episode on \"Brown-Eyed Handsome Man\" about the film \"Rock! Rock! Rock!\" which Chuck Berry appeared in -- that was actually towards the more watchable end of these films, terrible as it was.\n\nThe film that Cochran was signed to appear in, which was soon renamed The Girl Can't Help It, is different. There are plenty of points at which the action stops for a musical performance, but there is an actual plot, and actual dialogue and acting. While the film isn't a masterpiece or anything like that, it is a proper film.\n\nAnd it's made by a proper studio. While, for example, Rock! Rock! Rock! was made by a fly-by-night company called Vanguard Productions, The Girl Can't Help It was made by Twentieth Century Fox. And it was made in both colour and Cinemascope. The budget for Rock! Rock! Rock! was seventy-five thousand dollars compared to the 1.3 million dollars spent on The Girl Can't Help It.\n\n[Excerpt: Little Richard, “The Girl Can't Help It”]\n\nIndeed, it seems to be as much an attempt to cash in on a Billy Wilder film as it is an attempt to cash in on rock and roll. The previous year, The Seven-Year Itch had been a big hit, with Tom Ewell playing an unassuming middle-aged man who becomes worryingly attracted to a much younger woman, played by Marilyn Monroe. The film had been a massive success (and it's responsible for the famous scene with Monroe on the air grate, which is still homaged and parodied to this day) and so the decision was taken to cast Tom Ewell as an unassuming middle-aged man who becomes worryingly attracted to a much younger woman, played by Jayne Mansfield doing her usual act of being a Marilyn Monroe impersonator.\n\nJust as the film was attempting to sell itself on the back of a more successful hit film, the story also bears a certain amount of resemblance to one by someone else. The playwright Garson Kanin had been inspired in 1955 by the tales of the jukebox wars -- he'd discovered that most of the jukeboxes in the country were being run by the Mafia, and that which records got stocked and played depended very much on who would do favours for the various gangsters involved. Gangsters would often destroy rivals' jukeboxes, and threaten bar owners if they were getting their jukeboxes from the wrong set of mobsters.\n\nKanin took this idea and turned it into a novella, Do-Re-Mi, about a helpless schlub who teams up with a gangster named \"Fatso\" to enter the record business, and on the way more or less accidentally makes a young woman into a singing star. Do-Re-Mi later became a moderately successful stage musical, which introduced the song \"Make Someone Happy\".\n\n[Excerpt: Doris Day, “Make Someone Happy”]\n\nMeanwhile the plot of The Girl Can't Help It has a helpless schlub team up with a mobster named \"Fats\", and the two of them working together to make the mobster's young girlfriend into a singing star.\n\nI've seen varying accounts as to why The Girl Can't Help It was renamed from Do-Re-Mi and wasn't credited as being based on Kanin's novella. Some say that the film was made without the rights having been acquired, and changed to the point that Kanin wouldn't sue. Others say that Twentieth Century Fox acquired the rights perfectly legally, but that the director, Frank Tashlin changed the script around so much that Kanin asked that his credit be removed, because it was now so different from his novella that he could probably resell the rights at some future point.\n\nThe latter seems fairly likely to me, given that Tashlin's next film, Will Success Spoil Rock Hunter?, which also starred Jayne Mansfield, contained almost nothing from the play on which it was based.\n\nIndeed, the original play Will Success Spoil Rock Hunter? was by the author of the original play on which The Seven-Year Itch was based. The playwright had been so annoyed at the way in which his vision had been messed with for the screen that he wrote Will Success Spoil Rock Hunter? as a satire about the way the film industry changes writers' work, and Mansfield was cast in the play. When Tashlin wanted Mansfield to star in The Girl Can't Help It but she was contractually obliged to appear in the play, Fox decided the easiest thing to do was just to buy up the rights to the play and relieve Mansfield of her obligation so she could star in The Girl Can't Help It.\n\nThey then, once The Girl Can't Help It finished, got Frank Tashlin to write a totally new film with the title Will Success Spoil Rock Hunter?, keeping only the title and Mansfield's character.\n\nWhile The Girl Can't Help It has a reputation for satirising rock and roll, it actually pulls its punches to a surprising extent. For example, there's a pivotal scene where the main mobster character, Fats, calls our hero after seeing Eddie Cochran on TV:\n\n[excerpt: dialogue from \"The Girl Can't Help It\"]\n\nNote the wording there, and what he doesn't say. He doesn't say that Cochran can't sing, merely that he \"ain't got a trained voice\". The whole point of this scene is to set up that Jerry Jordan, Mansfield's character, could become a rock and roll star even though she can't sing at all, and yet when dealing with a real rock and roll star they are careful to be more ambiguous.\n\nBecause, of course, the main thing that sold the film was the appearance of multiple rock and roll stars -- although \"stars\" is possibly overstating it for many of those present in the film. One thing it shared with most of the exploitation films was a rather slapdash attitude to which musicians the film would actually feature. And so it has the genuinely big rock and roll stars of the time Little Richard, the Platters, and Fats Domino, the one-hit wonder Gene Vincent (but what a one hit to have), and a bunch of… less well-known people, like the Treniers -- a jump band who'd been around since the forties and never really made a major impact, or Eddie Fontaine (about whom the less said the better), or the ubiquitous Teddy Randazzo, performing here with an accordion accompaniment.\n\n[Excerpt: Teddy Randazzo and the Three Chuckles, “Cinnamon Sinner”]\n\nAnd Cochran was to be one of those lesser-known acts, so he and Capehart had to find a song that might be suitable for him to perform in the film. Very quickly they decided on a song called \"Twenty Flight Rock\", written by a songwriter called Nelda Fairchild.\n\nThere has been a lot of controversy as to who actually contributed what to the song, which is copyrighted in the names of both Fairchild and Cochran. Fairchild always claimed that she wrote the whole thing entirely by herself, and that Cochran got his co-writing credit for performing the demo, while Cochran's surviving relatives are equally emphatic in their claims that he was an equal contributor as a songwriter.\n\nWe will almost certainly never know the truth. Cochran is credited as the co-writer of several other hit songs, usually with Capehart, but never as the sole writer of a hit. Fairchild, meanwhile, was a professional songwriter, but pieces like \"Freddie the Little Fir Tree\" don't especially sound like the work of the same person who wrote \"Twenty Flight Rock\". As both credited writers are now dead, the best we can do is use our own judgement, and my personal judgement is that Cochran probably contributed at least something to the song's writing.\n\nThe original version of \"Twenty Flight Rock\", as featured in the film, was little more than a demo -- it featured Cochran on guitar, Guybo Smith on double bass, and Capehart slapping a cardboard box to add percussion. Cochran later recorded a more fully-arranged version of the song, which came out after the film, but the extra elements, notably the backing vocals, added little to the simplistic original:\n\n[Excerpt: Eddie Cochran, \"Twenty Flight Rock\"]\n\nIt was that simpler version that appeared in the film, and which took its place alongside several other classic tracks in the film's soundtrack.\n\nThe film was originally intended to have a theme tune recorded by Fats Domino, who appeared in the film performing his hit \"Blue Monday\", but when Bobby Troup mentioned this to Art Rupe, Rupe suggested that Little Richard would be a more energetic star to perform the song (and I'm sure this was entirely because of his belief that Richard would be the better talent, and nothing to do with Rupe owning Richard's label, but not Domino's).\n\nAs a result, Domino's role in the film was cut down to a single song, while Richard ended up doing three -- the title song, written by Troup, \"Ready Teddy\" by John Marascalco and Bumps Blackwell, and \"She's Got It\".\n\nWe've mentioned before that John Marascalco's writing credits sometimes seem to be slightly exaggerated, and “She's Got It” is one record that tends to bear that out. Listen to “She's Got It”, which has Marascalco as the sole credited writer:\n\n[Excerpt: Little Richard, “She's Got It”]\n\nAnd now listen to “I Got It”, an earlier record by Richard, which has Little Richard credited as the sole writer:\n\n[Excerpt: Little Richard, “I Got It”]\n\nHmm…\n\nThe Girl Can't Help It was rather poorly reviewed in America. In France it was a different story. There's a pervasive legend that the people of France revere Jerry Lewis as a genius. This is nonsense. But the grain of truth in it is that Cahiers du Cinema, the most important film magazine in France by a long way -- the magazine for which Godard, Truffaut, and others wrote, and which popularised the concept of auteur theory, absolutely loved Frank Tashlin. In 1957, Tashlin was the only director to get two films on their top ten films of the year list -- The Girl Can't Help It at number eight, and Will Success Spoil Rock Hunter at number two. The other eight films on the list were directed by Chaplin, Fellini, Hitchcock, Bunuel, Ingmar Bergman, Nicholas Ray, Fritz Lang and Sidney Lumet.\n\nTashlin directed several films starring Jerry Lewis, and those films, like Tashlin's other work, got a significant amount of praise in the magazine. And that's where that legend actually comes from, though Cahiers did also give some more guarded praise to some of the films Lewis directed himself later.\n\nTashlin wasn't actually that good a director, but what he did have is a visual style that came from a different area of filmmaking than most of his competitors. Tashlin had started out as a cartoon director, working on Warner Brothers cartoons. He wasn't one of the better directors for Warners, and didn't direct any of the classics people remember from the studio -- he mostly made forgettable Porky Pig shorts. But this meant he had an animator's sense for a visual gag, and thus gave his films a unique look. For advocates of auteur theory, that was enough to push him into the top ranks.\n\nAnd so The Girl Can't Help It became a classic film, and Cochran got a great deal of attention, and a record deal.\n\nAccording to Si Waronker, the head of Liberty Records, Eddie Cochran getting signed to the label had nothing to do with him being cast in The Girl Can't Help It, and Waronker had no idea the film was being made when Cochran got signed. This seems implausible, to say the least. Johnny Olenn, Abbey Lincoln and Julie London, three other Liberty Records artists, appeared in the film -- and London was by some way Liberty's biggest star. Not only that, but London's husband, Bobby Troup, wrote the theme song and was musical director for the film.\n\nBut whether or not Cochran was signed on account of his film appearance, \"Twenty Flight Rock\" wasn't immediately released as a single. Indeed, by the time it came out Cochran had already appeared in another film, in which he had backed Mamie Van Doren -- another Marilyn Monroe imitator in the same vein as Mansfield -- on several songs, as well as having a small role and a featured song himself.\n\nOddly, when that film, Untamed Youth, came out, Cochran's backing on Van Doren's recordings had been replaced by different instrumentalists. But he still appears on the EP that was released of the songs, including this one, which Cochran co-wrote with Capehart:\n\n[Excerpt: Mamie Van Doren, \"Ooh Ba La Baby\"]\n\nIt had originally been planned to release \"Twenty Flight Rock\" as Cochran's first single on Liberty, to coincide with the film's release but then it was put back for several months, as Si Waronker wanted Cochran to release \"Sitting in the Balcony\" instead. That song had been written and originally recorded by John D Loudermilk:\n\n[Excerpt: John D Loudermilk, \"Sitting in the Balcony\"]\n\nWaronker had wanted to release Loudermilk's record, but he hadn't been able to get the rights, so he decided to get Cochran to record a note-for-note cover version and release that instead:\n\n[Excerpt: Eddie Cochran, \"Sitting in the Balcony\"]\n\nCochran was not particularly happy with that record, though he was happy enough once the record started selling in comparatively vast quantities, spurred by his appearance in The Girl Can't Help It, and reached number eighteen in the charts. The problem was that Cochran and Waronker had fundamentally different ideas about what Cochran actually was as an artist. Cochran thought of himself primarily as a guitarist -- and the guitar solo on \"Sittin' in the Balcony\" was the one thing about Cochran's record which distinguished it from Loudermilk's original -- and also as a rock and roller. Waronker, on the other hand, was convinced that someone with Cochran's good looks and masculine voice could easily be another Pat Boone.\n\nLiberty was fundamentally not geared towards making rock and roll records. Its other artists included the Hollywood composer Lionel Newman, the torch singer Julie London, and a little later novelty acts like the Chipmunks -- the three Chipmunks, Alvin, Simon, and Theodore, being named after Al Bennett, Si Waronker, and Theodore Keep, the three men in charge of the label. And their attempts to force Cochran into the mould of a light-entertainment crooner produced a completely forgettable debut album, Singin' to My Baby, which has little of the rock and roll excitement that would characterise Cochran's better work.\n\n(And a warning for anyone who decides to go out and listen to that album anyway -- one of the few tracks on there that *is* in Cochran's rock and roll style is a song called \"Mean When I'm Mad\", which is one of the most misogynist things I have heard, and I've heard quite a lot -- it's basically an outright rape threat. So if that's something that will upset you, please steer clear of Cochran's first album, while knowing you're missing little artistically.)\n\n“Twenty Flight Rock” was eventually released as a single, in its remade version, in November 1957, almost a year after The Girl Can't Help It came out. Unsurprisingly, coming out so late after the film, it didn't chart, and it would be a while yet before Cochran would have his biggest hit. But just because it didn't chart, doesn't mean it didn't make an impression.\n\nThere's one story, more than any other, that sums up the impact both of \"The Girl Can't Help It\" and of \"Twenty Flight Rock\" itself. In July 1957, a skiffle group called the Quarrymen, led by a teenager called John Lennon, played a village fete in Woolton, a suburb of Liverpool. After the show, they were introduced to a young boy named Paul McCartney by a mutual friend.\n\nLennon and McCartney hit it off, but the thing that persuaded Lennon to offer McCartney a place in the group was when McCartney demonstrated that he knew all the words to \"Twenty Flight Rock\". Lennon wasn't great at remembering lyrics, and was impressed enough by this that he decided that this new kid needed to be in the group.\n\n[Excerpt: Paul McCartney, “Twenty Flight Rock”]\n\nThat's the impact that The Girl Can't Help It had, and the impact that \"Twenty Flight Rock\" had. But Eddie Cochran's career was just starting, and we'll see more of him in future episodes...",
  "enclosure": "",
  "itunes:summary": "Episode fifty-two of A History of Rock Music in Five Hundred Songs looks at \"Twenty Flight Rock\" by Eddie Cochran, and at the first great rock and roll film Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Teen-Age Crush\" by Tommy Sands.\n\n\n\nResources\n\nThere are several books available on Cochran, but for this episode I mostly relied on Gene Vincent and Eddie Cochran: Rock and Roll Revolutionaries by John Collis. I'll be using others as well in forthcoming episodes.\n\nWhile there are dozens of compilations of Cochran's music available, many of them are flawed in one way or another (including the Real Gone Music four-CD set, which is what I would normally recommend). This one is probably the best you can get for Cochran novices.\n\nAnd as always there's a Mixcloud with the full versions of all the songs featured in today's episode.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nTo tell the story of rock music, it's important to tell the story of the music's impact on other media. Rock and roll was a cultural phenomenon that affected almost everything, and it affected TV, film, clothing and more. So today, we're going to look at how a film made the career of one of the greats of rock and roll music:\n\n[Excerpt: Eddie Cochran, \"Twenty Flight Rock\"]\n\nEddie Cochran was born in Albert Lea, Minnesota, though in later life he would always claim to be an Okie rather than from Albert Lea. His parents were from Oklahoma, they moved to Minnesota shortly before Eddie was born, and they moved back to Oklahoma City when he was small, moved back again to Minnesota, and then moved off to California with the rest of the Okies.\n\nCochran was a staggeringly precocious guitarist. On the road trip to California from Albert Lea, he had held his guitar on his lap for the entire journey, referring to it as his best friend. And once he hit California he quickly struck up a musical relationship with two friends -- Guybo Smith, who played bass, and Chuck Foreman, who played steel guitar. The three of them got hold of a couple of tape recorders, which allowed them not only to record themselves, but to experiment with overdubbing in the style of Les Paul. Some of those recordings have seen release in recent years, and they're quite astonishing:\n\n[Excerpt: Eddie Cochran and Chuck Foreman, \"Rockin' It\"]\n\nCochran plays all the guitars on that (except the steel guitar, which is Foreman) and he was only fourteen years old at the time.\n\nHe played with several groups who were playing the Okie Western Swing and proto-rockabilly that was popular in California at the time, and eventually hooked up with a singer from Mississippi who was born Garland Perry, but who changed his name to Hank Cochran, allowing the duo to perform under the name \"the Cochran Brothers\".\n\nThe Cochran Brothers soon got a record deal. When they started out, they were doing pure country music, and their first single was a Louvin Brothers style close harmony song, about Jimmie Rodgers and Hank Williams:\n\n[Excerpt: The Cochran Brothers, \"Two Blue Singing Stars\"]\n\nBut while Hank was perfectly happy making this kind of music, Eddie was getting more and more interested in the new rock and roll music that was starting to become popular, and the two of them eventually split up over actual musical differences.\n\nHank Cochran would go on to have a long and successful career in the country industry, but Eddie was floundering. He knew that this new music was what he should be playing, and he was one of the best guitarists around, but he wasn't sure how to become a rock and roller, or even if he wanted to be a singer at all, rather than just a guitar player. He hooked up with Jerry Capehart, a singer and songwriter who the Cochran Brothers had earlier backed on a single:\n\n[Excerpt: Jerry Capehart and the Cochran Brothers, \"W",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode fifty-two of A History of Rock Music in Five Hundred Songs looks at \"Twenty Flight Rock\" by Eddie Cochran, and at the first great rock and roll film Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Teen-Age Crush\" by Tommy Sands.\n\n\n\nResources\n\nThere are several books available on Cochran, but for this episode I mostly relied on Gene Vincent and Eddie Cochran: Rock and Roll Revolutionaries by John Collis. I'll be using others as well in forthcoming episodes.\n\nWhile there are dozens of compilations of Cochran's music available, many of them are flawed in one way or another (including the Real Gone Music four-CD set, which is what I would normally recommend). This one is probably the best you can get for Cochran novices.\n\nAnd as always there's a Mixcloud with the full versions of all the songs featured in today's episode.\n\nPatreon\n\nThis podcast is brought to yo",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}