{
  "title": "Exploring diffuse radio emission in galaxy clusters and groups with the uGMRT and the SKA. (arXiv:2211.01393v1 [astro-ph.CO])",
  "link": "http://arxiv.org/abs/2211.01393",
  "description": "<p>Diffuse radio emission has been detected in a considerable number of galaxy\nclusters and groups, revealing the presence of pervasive cosmic magnetic\nfields, and of relativistic particles in the large-scale structure (LSS) of the\nUniverse. Since cluster radio emission is faint and steep spectrum, its\nobservations are largely limited by the instrument sensitivity and frequency of\nobservation, leading to a dearth of information, more so for lower-mass\nsystems. The unprecedented sensitivity of recently commissioned low-frequency\nradio telescope arrays, aided by the development of advanced calibration and\nimaging techniques, have helped in achieving unparalleled image quality. At the\nsame time, the development of sophisticated numerical simulations and the\navailability of supercomputing facilities have paved the way for\nhigh-resolution numerical modeling of radio emission, and the structure of the\ncosmic magnetic fields in LSS, leading to predictions matching the capabilities\nof observational facilities. In view of these rapidly-evolving scenerio in\nmodeling and observations, in this review, we summarise the role of the new\ntelescope arrays and the development of advanced imaging techniques and discuss\nthe detections of various kinds of cluster radio sources. In particular, we\ndiscuss observations of the cosmic web in the form of supercluster filaments,\nstudies of emission in poor clusters and groups of galaxies, and of ultra-steep\nspectrum sources. We also review the current theoretical understanding of\nvarious diffuse cluster radio sources and the associated magnetic field and\npolarization. As the statistics of detections improve along with our\ntheoretical understanding, we update the source classification schemes based on\ntheir intrinsic properties. We conclude by summarising the role of the upgraded\nGMRT and our expectations from the upcoming Square Kilometre Array (SKA)\nobservatories.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Paul_S/0/1/0/all/0/1\">Surajit Paul</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Kale_R/0/1/0/all/0/1\">Ruta Kale</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Datta_A/0/1/0/all/0/1\">Abhirup Datta</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Basu_A/0/1/0/all/0/1\">Aritra Basu</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Sur_S/0/1/0/all/0/1\">Sharanya Sur</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Parekh_V/0/1/0/all/0/1\">Viral Parekh</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Gupta_P/0/1/0/all/0/1\">Prateek Gupta</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Chatterjee_S/0/1/0/all/0/1\">Swarna Chatterjee</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Salunkhe_S/0/1/0/all/0/1\">Sameer Salunkhe</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Iqbal_A/0/1/0/all/0/1\">Asif Iqbal</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Pandey_Pommier_M/0/1/0/all/0/1\">Mamta Pandey-Pommier</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Raja_R/0/1/0/all/0/1\">Ramij Raja</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Rahaman_M/0/1/0/all/0/1\">Majidul Rahaman</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Raychaudhury_S/0/1/0/all/0/1\">Somak Raychaudhury</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Nath_B/0/1/0/all/0/1\">Biman B. Nath</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Majumdar_S/0/1/0/all/0/1\">Subhabrata Majumdar</a>"
}