{
  "title": "Did A Child See A Spirit? | Horror Podcast",
  "link": "https://audioboom.com/posts/8054636",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1996,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Today on another bone chilling episode of Real Ghost Stories Online. <br>\n<br>\nA young child’s stomach is tied in knots every time they are sent off to visit their grandparents in the deep south. <br>\n<br>\nAnxiety and fear caused not because of the living, but because of the dead that seem to infest the family farm that has been standing for more than a century, where night after night, new visitors would be tormented with the actions of the unwelcoming spirits. <br>\n<br>\nCould this home’s haunting be caused by the thousands of unmarked graves laying nearby? <br>\n<br>\nAnd, with that much negativity and death, could this home ever truly be a peaceful place for the living to find rest?<br>\n<br>\nThat story, and many more, today, on Real Ghost Stories Online.<br>\n<br>\n<br>\n<br>\nWatch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\nIf you have a real ghost story or supernatural event to report, please write into our podcast about the paranormal or call 1-855-853-4802!<br>\nIf you like the show and love spooky things, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n<br>\n\n</div>\n",
  "pubDate": "Thu, 21 Apr 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-03-25:/posts/8054636",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}