{
  "title": "Adversarial Data Augmentation Using VAE-GAN for Disordered Speech Recognition. (arXiv:2211.01646v1 [eess.AS])",
  "link": "http://arxiv.org/abs/2211.01646",
  "description": "<p>Automatic recognition of disordered speech remains a highly challenging task\nto date. The underlying neuro-motor conditions, often compounded with\nco-occurring physical disabilities, lead to the difficulty in collecting large\nquantities of impaired speech required for ASR system development. This paper\npresents novel variational auto-encoder generative adversarial network\n(VAE-GAN) based personalized disordered speech augmentation approaches that\nsimultaneously learn to encode, generate and discriminate synthesized impaired\nspeech. Separate latent features are derived to learn dysarthric speech\ncharacteristics and phoneme context representations. Self-supervised\npre-trained Wav2vec 2.0 embedding features are also incorporated. Experiments\nconducted on the UASpeech corpus suggest the proposed adversarial data\naugmentation approach consistently outperformed the baseline speed perturbation\nand non-VAE GAN augmentation methods with trained hybrid TDNN and End-to-end\nConformer systems. After LHUC speaker adaptation, the best system using VAE-GAN\nbased augmentation produced an overall WER of 27.78% on the UASpeech test set\nof 16 dysarthric speakers, and the lowest published WER of 57.31% on the subset\nof speakers with \"Very Low\" intelligibility.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/eess/1/au:+Jin_Z/0/1/0/all/0/1\">Zengrui Jin</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Xie_X/0/1/0/all/0/1\">Xurong Xie</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Geng_M/0/1/0/all/0/1\">Mengzhe Geng</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Wang_T/0/1/0/all/0/1\">Tianzi Wang</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Hu_S/0/1/0/all/0/1\">Shujie Hu</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Deng_J/0/1/0/all/0/1\">Jiajun Deng</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Li_G/0/1/0/all/0/1\">Guinan Li</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Liu_X/0/1/0/all/0/1\">Xunying Liu</a>"
}