{
  "title": "What is Data Science and Does it Matter?",
  "description": "<!--kg-card-begin: markdown--><p>It starts like a typical data science job interview - I summarise my resume and they describe their core products. They describe what their data looks like and we have a <em>very interesting</em> chat about the structure of their data. But the interviewer keeps dancing around the topic of what</p>",
  "link": "https://www.martingoodson.com/what-is-data-science-and-does-it-matter/",
  "guid": "5e15f163bda2f50017c807c3",
  "dc:creator": "Martin Goodson",
  "pubDate": "Tue, 28 Apr 2015 19:08:00 GMT",
  "content:encoded": "<!--kg-card-begin: markdown--><p>It starts like a typical data science job interview - I summarise my resume and they describe their core products. They describe what their data looks like and we have a <em>very interesting</em> chat about the structure of their data. But the interviewer keeps dancing around the topic of what my job will consist of and the whole thing become vaguer and vaguer until I'm forced to ask 'this sounds great but could you please explain what the job actually is?'</p>\n<p>The answer is often some version of: 'Well, we're pretty sure we need a data scientist but could you explain what <em>exactly</em> a data scientist does?'</p>\n<p>Nobody seems to know exactly what 'data science' is, let alone its almost synonym 'big data'. Maybe it's that most people are not accustomed to statisticians being interesting and it comes as a shock that statistics is useful to their business. Perhaps a new term just makes it easier to deal with.</p>\n<p>Statistics has certainly become more valuable as the amount of data collected by businesses has exploded. We now collect so much data that we can create valuable products from the data itself, previously considered a mere by-product.</p>\n<p>Is this really new? Reader's digest was doing data analysis on millions of households in the 70s (but they needed a mainframe to do it)<sup class=\"footnote-ref\"><a href=\"#fn1\" id=\"fnref1\">[1]</a></sup>. They employed programmers and statisticians but no one we would recognize as a data scientist. Instead they had 300 people who together did what a data scientist can achieve today on a single MacBook Pro.</p>\n<p>But the statistical element of data science and big data is often not new. I read a story in the New York Times about the problems in New York caused by restaurants pouring used cooking oil into sewers. Apparently the culprits were identified by 'big data'<sup class=\"footnote-ref\"><a href=\"#fn2\" id=\"fnref2\">[2]</a></sup>:</p>\n<blockquote>\n<p>They dug up data from the Business Integrity Commission, an obscure city agency that among other tasks certifies that all local restaurants have a carting service to haul away their grease. With a few quick calculations, comparing restaurants that did not have a carter with geo-spatial data on the sewers, the team was able to hand inspectors a list of statistically likely suspects.</p>\n</blockquote>\n<p>Leaving aside the question of whether this is truly 'big data' - how different is this analysis from John Snow's analysis of Cholera cases in London in 1854? <sup class=\"footnote-ref\"><a href=\"#fn3\" id=\"fnref3\">[3]</a></sup> <sup class=\"footnote-ref\"><a href=\"#fn4\" id=\"fnref4\">[4]</a></sup></p>\n<p><img src=\"https://www.martingoodson.com/content/images/2015/04/8a1503bb-3ecf-4cd2-91d7-ad786a091335.jpg\" alt loading=\"lazy\"></p>\n<p>The statistical analysis is not different. The difference today is that the data was just sitting around in a database waiting to be discovered. This requires very different skills to traipsing around Victorian London looking for corpses.</p>\n<p>It's now so easy to manipulate vast quantities of data that you don't need to employ a separate statistician, database guy and programmer. You hire someone who can code and do statistics too. This is the data scientist.</p>\n<p>But this has lead to some confusion about what constitutes a data scientist. Very often data scientists are recruited by non-scientists, who aren't clear on what skills they should be hiring for. Hence the rise of the the hadoop engineer or SQL analyst hired as data scientist. Nothing wrong with these skills, but they don't make you a scientist.</p>\n<p>Statistical know-how is essential. Large messy data sets with weird dependency structures and missing data will cause any data scientist pain and suffering. But at least those with statistical training know they are in trouble; and know what to do about it.</p>\n<p>It's now time for data science as a profession to take stock and ask itself 'what is the core skill set?'. Or further than this, 'is data science a new statistical speciality or even a nascent field in its own right?'.</p>\n<p><em>Come and join the debate at the Royal Statistical Society on the <a href=\"http://www.statslife.org.uk/events/eventdetail/423/-/data-science-and-statistics-different-worlds\">11th of May</a></em></p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><p><a href=\"http://www.pcmag.com/article2/0,2817,1835221,00.asp\">http://www.pcmag.com/article2/0,2817,1835221,00.asp</a> <a href=\"#fnref1\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn2\" class=\"footnote-item\"><p><a href=\"http://www.nytimes.com/2013/03/24/nyregion/mayor-bloombergs-geek-squad.html?pagewanted=all&_r=0\">http://www.nytimes.com/2013/03/24/nyregion/mayor-bloombergs-geek-squad.html?pagewanted=all&_r=0</a> <a href=\"#fnref2\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn3\" class=\"footnote-item\"><p><a href=\"http://en.wikipedia.org/wiki/Dot_distribution_map#John_Snow.27s_cholera_map\">http://en.wikipedia.org</a> <a href=\"#fnref3\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn4\" class=\"footnote-item\"><p><a href=\"http://www.york.ac.uk/depts/maths/histstat/snow_map.htm\">http://www.york.ac.uk/depts/maths/histstat/snow_map.htm</a> <a href=\"#fnref4\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n</ol>\n</section>\n<!--kg-card-end: markdown-->"
}