{
  "title": "&#8216;Internet penetration won&#8217;t be enough to bring everyone online&#8217;: Rohit Jha of Transcelestial",
  "link": "https://e27.co/internet-penetration-wont-be-enough-to-bring-everyone-online-rohit-jha-of-transcelestial-20221102/",
  "dc:creator": "Sainul",
  "pubDate": "Wed, 02 Nov 2022 04:13:40 +0000",
  "category": [
    "Features",
    "People",
    "Singapore",
    "Startups",
    "500 Startups",
    "Airbus Ventures",
    "AirTree Ventures",
    "Cap Vista",
    "EDBI",
    "Entrepreneur First",
    "Partech Ventures",
    "SEEDS Capital",
    "SGInnovate",
    "SparkLabs Global Ventures",
    "Tekton Ventures",
    "Transcelestial",
    "Transcelestial Technologies",
    "Wavemaker Partners"
  ],
  "guid": "https://e27.co/?p=475427",
  "description": "<p>The majority of the world&#8217;s population still does not have access to Internet connectivity because existing communication technologies, such as fibre optics and radio frequency, are challenged by the world&#8217;s ever-growing demand for better connectivity, according to Rohit Jha, Co-Founder and CEO of Transcelestial Technologies, a last-mile internet connectivity startup. He also said internet penetration [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/internet-penetration-wont-be-enough-to-bring-everyone-online-rohit-jha-of-transcelestial-20221102/\">&#8216;Internet penetration won&#8217;t be enough to bring everyone online&#8217;: Rohit Jha of Transcelestial</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<div id=\"attachment_475494\" style=\"width: 700px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-475494\" loading=\"lazy\" class=\"size-full wp-image-475494\" src=\"https://e27.co/wp-content/uploads/2022/11/Transcelestial_factory_feature.png\" alt=\"\" width=\"690\" height=\"388\" /><p id=\"caption-attachment-475494\" class=\"wp-caption-text\">Two Transcelestial employees with the Centauri device</p></div>\n<p>The majority of the world&#8217;s population still does not have access to Internet connectivity because existing communication technologies, such as fibre optics and radio frequency, are challenged by the world&#8217;s ever-growing demand for better connectivity, according to Rohit Jha, Co-Founder and CEO of Transcelestial Technologies, a last-mile internet connectivity startup.</p>\n<p>He also said internet penetration would not be enough to bring everyone online. At the heart of the internet distribution problem is the need to provide affordable, high-speed internet to everyone.</p>\n<p>&#8220;Even among the &#8216;connected&#8217;, internet speeds can vary between 12Mbps to 238Mbps. The impact on those at the lower end of the spectrum can be felt across their daily digital career, work and personal interactions,&#8221; he said in an interview with e27.</p>\n<p>&#8220;Fibre optics can be highly time-consuming and cost-prohibitive to deploy in most countries. It often faces huge &#8216;right of way&#8217; challenges in getting access to the ground where it can be deployed. On a per kilometre basis, it can cost between US$10,000 (in rural areas) to US$100,000 (in dense urban areas),&#8221; Jha added.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/singapores-transcelestial-raises-us9-6m-series-a-to-deliver-a-step-change-in-internet-connectivity-globally-20200703/\">Transcelestial raises US$9.6M Series A to ‘deliver a step-change in internet connectivity globally’</a></strong></p>\n<p>Transcelestial can address this problem with its laser communication (lasercomms) technology, he added. The Singaporean startup has developed a network device called Centauri to provide a wireless distribution network between buildings, traditional cell towers, street-level poles and other physical infrastructure. The size of a shoe box, Centauri weighs less than 3kg and can deliver fibre-like speeds to customers.</p>\n<p>&#8220;Our device provides the same level of high-speed wirelessly, regardless of contextual factors, such as extreme weather or spectrum licensing. The technology involves accurately beaming a laser as thin as a single hair strand into a smartphone-sized window 3km away. The cost of deploying our technology per km is roughly 10x cheaper and takes just days (compared to months) for deployment,&#8221; claimed Jha.</p>\n<p>&#8220;Wireless solutions like Centauri devices provide consistent, high-speed wireless connectivity even in congested environments or under the most demanding weather conditions. They can be deployed quickly with a simple point-to-point connection, which means organisations can now connect the last mile rapidly, flexibly and cost-effectively without any right of way,&#8221; shared Jha. &#8220;We remove the need to lay expensive fibre to bring internet to mobile towers and buildings in the case of home or office broadband.&#8221;</p>\n<p>Centauri devices are already installed in over ten markets, including Singapore, the US, Indonesia, India, Australia, New Zealand, Taiwan, the Philippines, Malaysia, and Mongolia.</p>\n<p>Its customers are leading telecom companies, internet service providers, ports, universities, sports entertainment organisations, cloud providers, defence, and governments.</p>\n<p>Globe Telecom, which has previously tested its technology, has deployed Centauri in the Philippines in areas where it is difficult to install fibre. Hong Kong&#8217;s HIT Ports have also deployed this technology between their data centres to power connectivity.</p>\n<p>Last week, Transcelestial opened a US$1-million Terabit Factory facility in Singapore. The 2,000-square feet production facility can manufacture up to 2,400 Centauri devices annually. It can create a potential bandwidth of over 10 Tbps, which translates into the capacity to connect tens of millions of users.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/how-transcelestial-aims-to-help-telcos-roll-out-5g-rapidly-and-cost-effectively-in-sea-20200827/\" rel=\"follow\">Transcelestial aims to help telcos roll out 5G rapidly and cost-effectively in SEA</a></strong></p>\n<p>Terabit Factory was set up to meet the rising demand for lasercomms technology across telecom, broadband, education, ports and maritime, government, and defence.</p>\n<p>The company is currently in talks with some of the world&#8217;s leading telecom and connectivity partners to roll out the technologies produced right in this facility.</p>\n<p>Transcelestial has recently expanded into India, a vast market with massive potential. It has an on-ground commercial team and some early national-level partners working on key broadband initiatives in some Southern states in India.</p>\n<p>&#8220;For instance, we are working with a top-tier enterprise broadband provider with a large presence across India to provide high-speed connectivity to their enterprise customers. In parallel, we are also working with key railway and metro station owners to build robust connectivity infrastructure at and between their stations,&#8221; he said.</p>\n<p>Founded in December 2016 by Jha and Mohammad Danesh (CTO), Transcelestial is backed by investors, including EDBI, Wavemaker Partners, Airbus Ventures, Cap Vista, SEEDS Capital, Entrepreneur First, Partech Ventures, 500 Startups, AirTree Ventures, Tekton Ventures, SGInnovate, and SparkLabs Global Ventures.</p>\n<p>Transcelestial also counts Michael Seibel (CEO of Y-Combinator, Founder of Twitch.tv) and Charles Songhurst (Microsoft&#8217;s former Head of Corporate Strategy) among its backers.</p>\n<p>&#8212;</p>\n<div class=\"post-container x-post-content\">\n<div class=\"post-container x-post-content\">\n<p>Fundraising or preparing your startup for fundraising? Build your investor network, search from 400+ SEA investors on e27, and get connected or get insights regarding fundraising. <a class=\"ProsemirrorEditor-link\" rel=\"follow\" href=\"https://e27.co/membership/?utm_source=Boilerplate&utm_medium=Articles&utm_campaign=300TRIAL&utm_id=300TRIAL\" rel=\"follow\">Try e27 Pro for free today</a>.</p>\n</div>\n</div>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/internet-penetration-wont-be-enough-to-bring-everyone-online-rohit-jha-of-transcelestial-20221102/\">&#8216;Internet penetration won&#8217;t be enough to bring everyone online&#8217;: Rohit Jha of Transcelestial</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}