{
  "title": "Trusting Ourselves, Trusting Life (2015-10-07)",
  "pubDate": "Fri, 09 Oct 2015 00:37:39 +0000",
  "guid": "7d7aa948502824bc262312e9ad554edd",
  "link": "https://tarabrach.libsyn.com/trusting-ourselves-trusting-life-2015-10-07",
  "itunes:image": "",
  "description": "<p>Trusting Ourselves, Trusting Life (2015-10-07) - How can we trust in basic goodness when we encounter so much greed and violence within and around us? This talk explores three pathways of practice that enable us to bring a healing attention to our primitive survival conditioning, and cultivate the heart and awareness that express our full potential and deepest essence.<br /><br />\"Who would you be if you trusted the basic goodness and beauty that lives through you?\"</p>\n<p>Free download of Tara’s new 10 min meditation: “Mindful Breathing: Finding Calm and Ease” when you <a href=\"http://eepurl.com/6YfI\" target=\"_blank\">join her email list</a>.</p>",
  "content:encoded": "<p>Trusting Ourselves, Trusting Life (2015-10-07) - How can we trust in basic goodness when we encounter so much greed and violence within and around us? This talk explores three pathways of practice that enable us to bring a healing attention to our primitive survival conditioning, and cultivate the heart and awareness that express our full potential and deepest essence.\"Who would you be if you trusted the basic goodness and beauty that lives through you?\"</p>\n<p>Free download of Tara’s new 10 min meditation: “Mindful Breathing: Finding Calm and Ease” when you <a href=\"http://eepurl.com/6YfI\" target=\"_blank\">join her email list</a>.</p>",
  "enclosure": "",
  "itunes:duration": "52:30",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Trusting Ourselves, Trusting Life (2015-10-07) - How can we trust in basic goodness when we encounter so much greed and violence within and around us? This talk explores three pathways of practice that enable us to bring a healing attention to our..."
}