{
  "id": "tag:blogger.com,1999:blog-582368152716771238.post-9135287195906136410",
  "published": "2022-11-04T10:30:00.003-05:00",
  "updated": "2022-11-04T11:44:46.681-05:00",
  "category": [
    "",
    ""
  ],
  "title": "Academic Freedom Conference Opening Statement",
  "content": "<p style=\"text-align: center;\"><b>Opening remarks, <a href=\"https://johnhcochrane.blogspot.com/2022/11/academic-freedom-conference.html\" target=\"_blank\">Conference on Academic Freedom</a></b></p><p style=\"text-align: center;\">John H. Cochrane</p><p style=\"text-align: center;\">Nov 4 2022</p><p>Welcome to the Academic Freedom Conference. I’m John Cochrane, one of the co-organizers of this conference.</p><p>First, let us offer thanks. Most of all, we thank the Stanford GSB and its dean Jon Levin for sponsoring this conference, and sticking with us through some turbulence. We also thank the institutions listed here for sponsorship, and several generous donors. We thank the<a href=\"https://cli.stanford.edu/events/conference-symposium/academic-freedom-conference/organizing-committee\" target=\"_blank\"> organizing committee</a>, which helped to identify and recruit speakers and consulted extensively. We thank all our speakers, and all of you, especially those who have traveled to be here. Most of all, Ivan Marinovic did all the hard work of putting the conference together. Thank you Ivan!&nbsp;</p><p>I am, of course, not going to tell you what to say and not say. But any conversation is more productive if we focus it and try to keep to the point.&nbsp;</p><p>We gather as a group that believes academic freedom is important and under threat. But we don’t fully understand the problem or what to do about it. So, we are here to share experiences in different universities, fields, and from a diversity of viewpoints, to understand and define the problem, and to find practical solutions.&nbsp;</p><p>We are not here to have a philosophical discussion whether academic freedom is important, and whether it is threatened. We here start from the premise that the core mission of the scholarly community is to uncover new knowledge, to debate and refine knowledge, to pass on knowledge to the next generation, and more importantly to pass on the habits and norms of critical inquiry and scholarly debate that produce true knowledge. We here start from the premise that we are losing academic freedom, and that threatens this core scholarly mission. If those of you listening on zoom or the critics of this conference wish to debate these issues, go ahead and run a different conference. Every biology conference does not start with an evolution vs. creationism debate. Time is short, and focus will make us more productive.&nbsp;</p><p>This is a conference on academic freedom, with a lesser emphasis on free speech of political opinions. Cancellation, ostracism, and disciplinary action for political opinions, and canceling outside popular speakers are in the news. But our core question is limitations on the scholarly enterprise of research, teaching, publication, fact-finding, logical analysis, and criticism. This enterprise is damaged when scholars are canceled for political opinions, or opinions on matters like university hiring and admissions. But our focus goes beyond this to emphasize less visible but perhaps more insidious restrictions on academic activity, including direct institutional actions, by self-censorship in fear, or by good people being driven out of the academic enterprise.&nbsp;</p><p>This is a conference on academic freedom, and not free speech and censorship in the media, on twitter, and in the general society. That is an important political problem in our democracy, but it’s not the focus of our conference. &nbsp;</p><p>This is a conference on academic freedom, and not centrally on the substance of contentious issues. We have some noted speakers who have been criticized for their views. But we’re here primarily to learn from their experience of censorship, not to debate the merits of the particular views and research findings that got them in trouble.</p><p>Academic freedom is a problem of institutions. Twitter-mob students are visible. But the key restrictions on academic freedom lie with university leaders, university bureaucracies, hiring and promotion procedures; and beyond universities to funding agencies, professional organizations, and journals. I hope we can discuss and remedy dysfunction in all these institutions.&nbsp;</p><p>The nexus between politics and academic freedom is a deep and troublesome question.</p><p>We designed this conference to be non-partisan. Truth knows no politics, we thought; it is likely to unsettle verities on all sides, and we know many self-identified leftists as well as rightists and libertarians who are concerned. We don’t know and didn’t ask what your politics are. We did however, make a special effort to invite people who self-identify as politically left or progressive and concerned with academic freedom. We also made a special effort to reach out to many of the people who have criticized some of our speakers; among others Stanford faculty who publicly denounced Jay Bhattacharya and Scott Atlas.&nbsp;</p><p>The non-response and refusals from this group was astounding, and surprising to us. If this group does not seem “balanced” to you it is by refusal to participate, not by lack of invitation.&nbsp;</p><p>One prominent Stanford professor, active in university academic freedom issues, spoke for many, telling us “I can’t be seen on the program with right-wing nutjobs like.…” and named a few of our speakers. At an academic freedom conference. There’s half the problem in a nutshell.</p><p>There are now faculty protest letters and demands in the faculty senate that Stanford distance itself from this conference. Critics involved the media. They complain that we are “closed,” for restricting attendance when the room got full, and for restricting media to preserve space for participants, though these are routine for academic conferences. [The Stanford&nbsp;<a href=\"https://gef.stanford.edu\" target=\"_blank\">global energy forum</a> of the last two days is explicitly “invitation only” without complaint, and without Bjorn Lomborg or Steve Kooning.] They complain about some of our speakers’s deplorable, to them, views. People with such views should, apparently, never allowed to speak on anything. They cherry pick one or two hated speakers, to declare us “unbalanced.” But have any of them looked up the other 35 speakers on the program? &nbsp;The <a href=\"https://www.chronicle.com/article/a-conference-says-academic-freedom-is-in-danger-critics-say-the-event-is-part-of-the-problem\" target=\"_blank\">Chronicle of Higher Education </a>declared this conference a “threat to democracy.” Even the Hoover Institution declined to support or co-host this conference, deeming it “too political.”&nbsp;</p><p>The attempt failed. Stanford’s leaders have supported us, for which we are grateful, so we are still here. But young untenured faculty figured out they should not be seen here. Several more deregistered from the conference after we decided to stream the proceedings, citing fear of repercussions.&nbsp;</p><p>The irony of trying to censor the free speech conference has not occurred to them. The hypocrisy of labeling this and only this conference “political,” and demanding that this and only this conference include “wider voices,” not the long list of highly one-sided political events at Stanford, [for example, the “<a href=\"https://wcc.stanford.edu/events-programs/stanford-gender-equity-and-justice-summit\" target=\"_blank\">Gender Equity and Justice Summit</a>”] likewise escapes them. Well, I guess \"logic\" is not politically fashionable, but do we have to be so obvious about it? &nbsp;</p><p>We were naive. Just in setting up a conference to talk about academic freedom, we got to experience part of the problem.&nbsp;</p><p>I think we cannot avoid the elephant in the room. The threat to academic freedom is political, as it has always been. Free scholarship undermines narratives that sustain or are used to claim political power. &nbsp;Though in the past this threat has come from both left and right, and though there are some dumb and illiberal restrictions coming from Republican state legislatures, the main threats to academic freedom inside the university, professional societies, and government agencies predominantly come from a particular far-left political ideology, and most of the forbidden subjects today threaten their narrative. &nbsp;</p><p>Well, I think so. Maybe I’m wrong. My point is, we should talk about this too.</p><p>Some organizational notes:&nbsp;</p><p>You can say what you want, but you can’t talk as long as you want. Please abide by the time limits. Moderators, please be ruthless in enforcing time limits. Please leave ample time for questions and comments from the floor. That discussion is much of the point of this event. I anticipate there will be far more comments than we can accommodate, so I encourage moderators to take a group of 5 or so comments at a time. Panelists, please keep responses short.&nbsp;</p><p>Each session will start on time, and end on time. At breaks, please return to the room promptly without being nagged, so we can keep to the schedule and everyone gets a chance to be heard.</p><p>Be aware that this conference is streamed, and video will be available later as well. We &nbsp;originally preferred no recording and Chatham house rules. But various pressures make that impossible, and we realized there is no way to ensure privacy. So, we accepted the loss of spontaneity that a record imposes, in return for the transparency that it provides. It proves what is not said here as much as it records what is said.&nbsp;</p><p>Covid still runs among us, and in a group this size there is a good probability that someone is infectious. Let this be a super-spreader event of ideas, but not of disease. If you are not feeling well, please do us all a favor and watch the live stream from out of the room. If you have any doubts, please take a test. (There are a bunch at the sign in desk.) In this tolerant free-speech group, let us respect people’s individual choices to wear a mask.</p><p>OK. Tell us what’s going on in your field, your university, your department, your curriculum committee, your classroom, your professional society, your journals, your funding agency, and tell us how we can work together to fix it.</p><p><br /></p><p><br /></p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "John H. Cochrane",
    "uri": "http://www.blogger.com/profile/04842601651429471525",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 7
}