{
  "id": "yt:video:i6g5phaFwa4",
  "yt:videoId": "i6g5phaFwa4",
  "yt:channelId": "UCkLHy_jxeaHTZCfGalg6QaA",
  "title": "OSHA's Training Issues: Proof of Training, Language, and More",
  "link": "",
  "author": {
    "name": "Conn Maciel Carey LLP",
    "uri": "https://www.youtube.com/channel/UCkLHy_jxeaHTZCfGalg6QaA"
  },
  "published": "2022-05-31T21:09:48+00:00",
  "updated": "2022-09-08T10:52:45+00:00",
  "media:group": {
    "media:title": "OSHA's Training Issues: Proof of Training, Language, and More",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "To satisfy OSHA, workplace safety and health training must be more than a “check-the-box” exercise where a trainer stands in front of an audience, delivers a lecture, hands out a test and grades the answers. If your employees are not able to adequately explain or communicate the concepts covered in training when they are interviewed by an OSHA compliance officer, the agency will almost certainly conclude that the training was not effective and issue one or more citations. In other words, you do not comply with the applicable standards simply by delivering the training and/or sending a series of sign-in sheets to OSHA—you comply by providing effective training in a manner that is understood by your employees such that it can be applied and readily explained by them. If employees are not trained in a language and/or vocabulary they understand, they will almost certainly be unable to apply or explain what was presented to them.\n\nDuring this webinar, participants will learn about:\n\n• Notable training requirements found in key OSHA standards\n• What compliant training generally looks like\n• Types of citations an employer may receive for failing to properly train employees\n• How lack of training can impact potential defenses to an OSHA citation\n• Other ways inadequate training impacts the workplace\n• Best practices to help employees grasp and retain information presented during training sessions\n\nA webinar from Conn Maciel Carey LLP.\n\nUse of this video does not in any manner constitute or establish an attorney-client relationship between Conn Maciel Carey and the viewer. This video may be deemed \"attorney advertising\" in jurisdictions from which it is accessed. The decision to hire a lawyer is a serious one and should be undertaken after consideration of all relevant information, not only information on this video.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}