{
  "title": "S14 Ep105: Beyond The Fray to Bigfoot Encounters",
  "link": "https://audioboom.com/posts/8098525",
  "itunes:episode": 105,
  "itunes:title": "Beyond The Fray to Bigfoot Encounters",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4973,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS goes Beyond The Fray to Bigfoot Encounters with Shannon LeGro.<br>\n<br>\nTodays program features some personal eyewitness accounts and terrifying encounters, all from the case files of the popular INTO THE FRAY program.  These stories are unique and scary. They will leave you wondering what this creature is and will no doubt give you pause before you cross the wood line and enter the woods. <br>\n<br>\nVisit Shannon's site here: <a href=\"https://intothefrayradio.com/\">https://intothefrayradio.com/</a><br>\n<br>\nGet the  book here: <a href=\"https://www.amazon.com/shop/darknessradiodave\">https://www.amazon.com/shop/darknessradiodave</a><br>\n<br>\nVisit Medium Carole Obley's site here: <a href=\"http://www.soulvisions.net\">www.soulvisions.net</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nAre you playing along with Beyond the Darkness on the Podcast One/ <a href=\"http://Betonline.AG\">Betonline.AG</a> Sportsnet Challenge?!  Each Week Dave and Tim are picking the winners of five NFL gam,es and playing against the hosts of different Podcast One shows!  If you play aloing with Dave and Tim on <a href=\"http://BetOnline.AG\">BetOnline.AG</a>, and they win the week, you qualify to be one of five winners splitting a $500 weekly prize! To sign up go to <a href=\"https://promotions.betonline.ag/podcastone\">https://promotions.betonline.ag/podcastone</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.<br>\n<br>\nDo you experience stress?  Or have anxiety…Or chronic pain ...Or have trouble sleeping at least once a week? You’re NOT alone! Feals is a better way to feel better. Our premium CBD will keep your head clear and help you feel your best. Become a member today by going to <a href=\"http://Feals.com/darkness\">Feals.com/darkness</a> and you'll get 50% off your first order with free shipping.  <br>\n<br>\nWe all know mental health is a big part of self-care. But changing mental habits is easier said than done. Luckily, Talkspace online therapy gives you a convenient and affordable way to improve your mental health.  Our listeners can get $100 off their first month by using code DARKNESS at <a href=\"http://talkspace.com\">talkspace.com</a> right now!",
  "itunes:summary": "BEYOND the DARKNESS goes Beyond The Fray to Bigfoot Encounters with Shannon LeGro.\n\nTodays program features some personal eyewitness accounts and terrifying encounters, all from the case files of the popular INTO THE FRAY program.  These...",
  "pubDate": "Sun, 22 Dec 2019 10:00:00 +0000",
  "guid": "b143ade2-8d1a-4594-830e-2fca69c12efa",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}