{
  "title": "Heather McGhee on THE SUM OF US",
  "pubDate": "Sat, 12 Feb 2022 11:00:00 +0000",
  "guid": "78bf013d-dc09-40ae-a3f5-48006b0bf035",
  "link": "http://pouredover.libsyn.com/heather-mcghee-on-tk",
  "itunes:image": "",
  "description": "<p>“I wrote <em>The Sum of Us</em> in the hopes that people would read it together, that people from all walks of life, different backgrounds, whether they're connected by something, a community, a school, a workplace, would pick it up and find for each person, a way into the story of America's troubled history with racism, and then a way out together.” Trained as a lawyer, and an expert in economic and social policy, Heather McGhee also excels at getting Americans to tell their stories — and look for solutions. Her urgent, important book, <em>The Sum of Us</em> is just out in paperback and she joins us on the show to talk about The Zero-Sum Hierarchy, The American Dream and other stories (and stereotypes) we tell ourselves, where we can go from here, the writers who inspire her, and more.</p> <p>Featured Books: <em>The Sum of Us</em> by Heather McGhee<br /> <br /> Poured Over is produced and hosted by Miwa Messer and mixed by Harry Liang. Follow us here for new episodes Tuesdays and Thursdays (with bonus episodes on occasional Saturdays).</p>",
  "content:encoded": "<p>“I wrote <em>The Sum of Us</em> in the hopes that people would read it together, that people from all walks of life, different backgrounds, whether they're connected by something, a community, a school, a workplace, would pick it up and find for each person, a way into the story of America's troubled history with racism, and then a way out together.” Trained as a lawyer, and an expert in economic and social policy, Heather McGhee also excels at getting Americans to tell their stories — and look for solutions. Her urgent, important book, <em>The Sum of Us</em> is just out in paperback and she joins us on the show to talk about The Zero-Sum Hierarchy, The American Dream and other stories (and stereotypes) we tell ourselves, where we can go from here, the writers who inspire her, and more.</p> <p>Featured Books: <em>The Sum of Us</em> by Heather McGhee  Poured Over is produced and hosted by Miwa Messer and mixed by Harry Liang. Follow us here for new episodes Tuesdays and Thursdays (with bonus episodes on occasional Saturdays).</p>",
  "enclosure": "",
  "itunes:duration": "46:01",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "“I wrote The Sum of Us in the hopes that people would read it together, that people from all walks of life, different backgrounds, whether they're connected by something, a community, a school, a workplace, would pick it up and find for each...",
  "itunes:episodeType": "full"
}