{
  "title": "459 - Advances in Treating Hospitalized COVID Patients",
  "itunes:title": "459 - Advances in Treating Hospitalized COVID Patients",
  "pubDate": "Fri, 22 Apr 2022 10:00:00 +0000",
  "guid": "3e2aa914-f97f-4a31-82ae-763b14b2f544",
  "link": "https://johnshopkinssph.libsyn.com/459-advances-in-treating-hospitalized-covid-patients",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">In-patient treatment for severe COVID has come a long way since 2020 thanks, in part, to the rare opportunity of real-time data collection from so many people sick with the same disease at the same time.</span> <strong>Dr. Brian Garibaldi</strong><span style=\"font-weight: 400;\">, director of the Johns Hopkins Biocontainment Unit, returns to the podcast to talk with</span> <strong>Stephanie Desmon</strong> <span style= \"font-weight: 400;\">about treating severely ill COVID patients, advances in therapeutics like antivirals and anti-inflammatory treatments, and why vaccines remain “the most astounding achievements.”</span></p>",
  "content:encoded": "<p>In-patient treatment for severe COVID has come a long way since 2020 thanks, in part, to the rare opportunity of real-time data collection from so many people sick with the same disease at the same time. Dr. Brian Garibaldi, director of the Johns Hopkins Biocontainment Unit, returns to the podcast to talk with Stephanie Desmon about treating severely ill COVID patients, advances in therapeutics like antivirals and anti-inflammatory treatments, and why vaccines remain “the most astounding achievements.”</p>",
  "enclosure": "",
  "itunes:duration": "15:40",
  "itunes:explicit": false,
  "itunes:keywords": "Pandemic,virus,Variants,coronavirus,antivirals,covid",
  "itunes:subtitle": "In-patient treatment for severe COVID has come a long way since 2020 thanks, in part, to the rare opportunity of real-time data collection from so many people sick with the same disease at the same time. Dr. Brian Garibaldi, director of the Johns...",
  "itunes:season": 5,
  "itunes:episode": 459,
  "itunes:episodeType": "full",
  "itunes:author": "The Johns Hopkins Bloomberg School of Public Health"
}