{
  "title": "Chinese Whispers: Politics and language – decoding the CCP",
  "link": "https://audioboom.com/posts/8018222",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 3557,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>All political parties have weaknesses for jargon and buzzwords, and the Chinese Communist Party more than most. It's why Party documents – whether they be speeches, Resolutions or reports – can be hard going. Sentences like the following (from the Resolution adopted at the Sixth Plenum) abound:</div>\n<br>\n<blockquote>‘All Party members should uphold historical materialism and adopt a rational outlook on the Party’s history.’<br>\n<br>\n‘We need to strengthen our consciousness of the need to maintain political integrity, think in big-picture terms, follow the leadership core, and keep in alignment with the central Party leadership’</blockquote><br>\n<div>In other words, full of platitudes and dense Marxist terminology.</div>\n<br>\n<div>So what is, then, the purpose of official Party documents? Can they ever reveal division within the Party, or say anything new at all? And throughout the fusty rhetoric, who is the audience, who are these words designed for?</div>\n<br>\n<div>On this episode, Cindy is joined by two guests expert at reading the Communist tea leaves. In this wide ranging – and slightly longer than usual – Chinese Whispers, they discuss the power of political language and how the Chinese Communist Party makes the most of it, why it’s important to control the historical narrative, and exactly what, if anything, does Xi Jinping Thought entail.</div>\n<br>\n<div>Her guests are Professor Rana Mitter, a historian of China at the University of Oxford and author of numerous books, the latest being <em>China’s Good War</em>;<em> </em>and Bill Bishop, who curates the newsletter Sinocism. Bill’s newsletter is a must-have round up of the most important political and economic China news, in your inbox four times a week. Very much worth every penny, and frequently featuring translated Party documents and Chinese articles.<br>\n<br>\nTo continue the conversation, they also mention a couple of past episodes of Chinese Whispers:<br>\nCindy interviews the exiled Professor Sun Peidong about the witch hunt against her at a top Shanghai University: <a href=\"https://www.spectator.co.uk/podcast/healing-the-cancer-of-the-cultural-revolution\">https://www.spectator.co.uk/podcast/healing-the-cancer-of-the-cultural-revolution</a>.<br>\nCindy discusses just why Taiwan is so important to China with Rana and analyst Jessica Drun: <a href=\"https://www.spectator.co.uk/podcast/healing-the-cancer-of-the-cultural-revolution\">https://www.spectator.co.uk/podcast/why-does-china-care-about-taiwan-</a>.<br>\n<br>\nYou can also find Cindy's review of Jing Tsu's <em>Kingdom of Characters</em> here: <a href=\"https://www.spectator.co.uk/article/the-great-chinese-puzzle-how-to-adapt-the-language-to-modern-communication-technologies\">https://www.spectator.co.uk/article/the-great-chinese-puzzle-how-to-adapt-the-language-to-modern-communication-technologies</a>.</div>\n",
  "pubDate": "Mon, 24 Jan 2022 17:55:20 +0000",
  "guid": "tag:audioboom.com,2022-01-24:/posts/8018222",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}