{
  "title": "Why You&#8217;ll Probably Never Run Out Of Money",
  "link": "https://www.mrmoneymustache.com/2022/07/18/never-run-out-of-money/",
  "comments": "https://www.mrmoneymustache.com/2022/07/18/never-run-out-of-money/#comments",
  "dc:creator": "Mr. Money Mustache",
  "pubDate": "Mon, 18 Jul 2022 15:49:10 +0000",
  "category": [
    "Case Studies",
    "The MMM Blog",
    "investing",
    "Retirement"
  ],
  "guid": "https://www.mrmoneymustache.com/?p=18240",
  "description": "As strange as it may sound, earning financial freedom is a lot easier for certain people than claiming that freedom once they have earned it. And if the following statement rings true to you, you may be suffering from this same hardship: “I think I’m close to having enough money to jump into early retirement, [&#8230;]",
  "content:encoded": "<a class=\"featured_image_link\" href=\"https://www.mrmoneymustache.com/2022/07/18/never-run-out-of-money/\"><img style=\"max-width:100%;height:auto\" width=\"800\" height=\"707\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/07/paintbrush-800.jpg\" class=\"attachment-full size-full wp-post-image\" alt=\"\" loading=\"lazy\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/07/paintbrush-800.jpg 800w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/paintbrush-800-300x265.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/paintbrush-800-200x177.jpg 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/paintbrush-800-768x679.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/paintbrush-800-150x133.jpg 150w\" sizes=\"(max-width: 800px) 100vw, 800px\" /></a>\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-full is-resized\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/07/paintbrush-800.jpg\" alt=\"\" class=\"wp-image-18243\" width=\"407\" height=\"360\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/07/paintbrush-800.jpg 800w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/paintbrush-800-300x265.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/paintbrush-800-200x177.jpg 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/paintbrush-800-768x679.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/paintbrush-800-150x133.jpg 150w\" sizes=\"(max-width: 407px) 100vw, 407px\" /></figure></div>\n\n\n\n<p>As strange as it may sound, <em>earning financial freedom</em> is a lot easier for certain people than <em>claiming </em>that freedom once they have earned it. And if the following statement rings true to you, you may be suffering from this same hardship:</p>\n\n\n\n<p class=\"has-text-align-center\"><strong><em>“I think I’m close to having enough money to jump into early retirement, but not quite.&nbsp;</em></strong><br><br><strong><em>So I’m just working one more year and starting one more side hustle and buckling down extra hard to be more certain.”</em></strong></p>\n\n\n\n<p>It sounds rational, right? After all, you can never be too careful, as the saying goes.&nbsp;</p>\n\n\n\n<p>But the problem is that these people keep repeating the mantra regardless of how much money they have, and regardless of their actual living expenses. No matter how bright their financial picture is, they always find a way to undervalue their savings and overestimate their future expenses,<strong><em> just in case</em></strong> of the unexpected. </p>\n\n\n\n<p>And by tilting the balance ever further in the direction of “safety”, they forget about what should be on the other side of the scale, which is “making the most of your finite time on this lovely planet.”</p>\n\n\n\n<p>This happens way more than you might think. Every week, it’s in my email inbox and my in-person conversations with people I meet. This fear is even prevalent among some of my real-life friends, so let’s look at a couple of thinly disguised examples from that group to see some of the symptoms (and a possible cure for) this famed affliction of One More Year Syndrome.</p>\n\n\n\n<p><strong>Alina’s Anemic Withdrawal Rate</strong></p>\n\n\n\n<p>Alina is a currently-single doctor in a stressful but well paid area of practice, age 50 with one grown child. She has about $2 million in investments, and currently spends about $50,000 per year, a level which includes pretty much everything that is important to her.</p>\n\n\n\n<p>&nbsp;According to <a href=\"https://www.mrmoneymustache.com/2012/05/29/how-much-do-i-need-for-retirement/\"><span style=\"text-decoration: underline;\">The 4% Rule</span></a>, Alina’s nest egg will provide a pretty reliable income of roughly $80,000 per year for the rest of her life. Or to put it another way, her planned spending of $50k is only a 2.5% withdrawal rate from that 2 million. Since 4% is reasonably safe, 2.5% is a <strong>preposterously safe withdrawal rate</strong>.</p>\n\n\n\n<p>But <em>wait! </em>There’s more. In the interest of being conservative, Alina has deliberately ignored several other key pieces of her own financial future:</p>\n\n\n\n<ul><li style=\"padding-bottom: 16px;font-size:17px\">All future social security income (over $2000 per month for the last 2-3 decades of your life)&nbsp;</li><li style=\"padding-bottom: 16px;font-size:17px\">A highly likely inheritance from her parents who, while wise and vibrant and still doing great, are in their early 80s.&nbsp;</li><li style=\"padding-bottom: 16px;font-size:17px\">And she’s also assuming that she will never couple up with another partner someday and share household expenses, despite the fact that she’s an attractive and sociable person with many options in this department.</li></ul>\n\n\n\n<p>Her response to this feeling of extra caution? Just crank it out for another year or three in the furnace of the operating room, and hold off on any luxuries to save up another few hundred thousand, just in case.&nbsp;</p>\n\n\n\n<p><strong>Dave’s Deceptively Bright Future</strong></p>\n\n\n\n<p>My other friend Dave is ten years younger, with a lower income but equally scrappy and very entrepreneurial. He has been a star performer in a very underpaid full-time job for over fifteen years. His total annual spending &#8211; including a mortgage on a $430,000 house here in Longmont &#8211; is only about $45,000 per year.</p>\n\n\n\n<p>Although Dave lives in high-cost Colorado, he has carefully accumulated eight rental apartments back in his hometown (a midsized city in Ohio), which very conservatively deliver $2800 per month of net cashflow, while also increasing his wealth by a further $3000 every month through principal payoff and appreciation.</p>\n\n\n\n<p>He also has a couple of side jobs, helping various members of our local HQ Coworking space with their businesses, which bring in a further $1000 per month.&nbsp;</p>\n\n\n\n<p>And then the kicker: Over the past seven months, Dave and I teamed up to renovate the main floor of that somewhat costly new house into a very high-end Airbnb rental. We recently pressed the button to make this place go live, and it became an immediate success with virtually no vacancy, now bringing in another <strong>$5000 per month (!?), </strong>while still leaving him with his finished walkout lower-level apartment as a place to live.&nbsp;</p>\n\n\n\n<p>So, Dave is living in his own basement collecting $5000 every month, while spending only $2000 on the mortgage. In other words, he is <strong>living for free and getting paid an additional $3000</strong> for the chore of owning this house, a trick formally known as&nbsp; the “Mustachian Inversion”</p>\n\n\n\n<p>If you add all this up, he has a total business income of $8800 per month ($105,600 per year!), which absolutely dwarfs his $45,000 spending even without taking into account the salary from that crappy full-time job which he has been wanting to quit for so long.</p>\n\n\n\n<p>&nbsp;When you add in the additional $3000 per month of mortgage principal payoff and appreciation of the rentals, my friend’s side hustles are netting him $140,000 every year. And his bank accounts reflect this: there are sizable cash reserves and maintenance and contingency funds for every rental unit, plus a well-funded personal 401k plan and every other bit of responsible financial preparation you can imagine.</p>\n\n\n\n<p>You may be slightly jealous of Dave because he is all set to kick back and enjoy the proceeds of all this hard work for life. He could cut his income in half and his wealth would still increase rapidly forever. </p>\n\n\n\n<p>But remember, on top of all this he <strong>still has that <em>full time job</em></strong><em> </em>which is demanding about 10 hours of his time every day, with several hours of Zoom meetings packed in throughout, eliminating the possibility of slacking.&nbsp;</p>\n\n\n\n<p>Dave is a great sport and puts on a brave face, but all of us in the local friends group can tell that he is nearly buckling under the stress of this shitty, stressful job, especially combined with his overflowing salad bowl of side hustles.&nbsp;</p>\n\n\n\n<p class=\"has-text-align-center\"><strong><em>“Dave, you stubborn dumbass, you need to quit that job yesterday”</em></strong><em>,&nbsp;</em></p>\n\n\n\n<p class=\"has-text-align-center\">is the loving message we have been trying to get into his head.</p>\n\n\n\n<p class=\"has-text-align-center\"><strong><em>“Yeah, I know”</em></strong>, he says, <strong><em>“But I’m just holding on for one more year, just to pad the accounts a bit further. What if the Airbnb slows down? What if my rental houses experience some vacancy? What if I want to help my nephew with college ten years down the line?”</em></strong></p>\n\n\n\n<p>Alina and Dave are both leaning upon the old rule of “You can never be too safe”, and many people agree with that statement, because how could you argue with such plain folksy wisdom?</p>\n\n\n\n<p>But this rule is incorrect. It is indeed possible to be “too safe”, because <a href=\"https://www.mrmoneymustache.com/2012/06/07/safety-is-an-expensive-illusion/\">safety comes at a high cost</a> &#8211; and the price is your own life.&nbsp;</p>\n\n\n\n<p>If Dave enjoys perfect health and lives to age 90, he still only has about 600 months left to live, or an even more precious 240 months of “youth” before hitting age 60. And Alina’s remaining 120 months of youth are even more dear.&nbsp;</p>\n\n\n\n<p>With both of their financial situations already so cushy, <em>why oh why</em> are my dear friends trading away this time for jobs they don’t enjoy, just to get that last shred of unnecessary safety?</p>\n\n\n\n<p>Why are they letting these jobs compromise their friendships and relationships, cost them sleep, miss out on camping trips and international adventures and just plain lazy Tuesday brunches with the people they love the most? (most of whom are already retired and currently having brunch without them?)</p>\n\n\n\n<p>The real answer of course is not money, it’s fear. </p>\n\n\n\n<p>But if you dig deeper, their fear is still about “running out of money”, even though it is almost mathematically impossible at this point.</p>\n\n\n\n<p>To train away this fear in myself and others, I like to conduct a thought experiment. And that is to force yourself through the numbers (using a spreadsheet) of these two things.</p>\n\n\n\n<ul><li><strong>If you quit your job right now, what would a good, typical, and improbably bad scenario look like for your financial future?</strong><strong><br></strong></li><li><strong>Then in the case of the “bad” scenario, write down, step by step, what it would really mean for you to run out of money.&nbsp;</strong></li></ul>\n\n\n\n<p>This can be a crazy thought experiment, but in many cases it will also reveal just how much of a ridiculously fortunate fortress you have built for yourself.&nbsp;</p>\n\n\n\n<p>Because unlike you, most people in the US really <em>are </em>almost out of money. They have virtually no retirement savings, monthly spending that meets or exceeds their income, and an array of car loans, student loans, and credit card debt that grows every year. A full ten percent of households have a negative net worth, and even the <a href=\"https://en.wikipedia.org/wiki/Affluence_in_the_United_States\">median net worth</a> is under $100,000 meaning half of us have only a 1-2 year cushion between ourselves and being dead broke.</p>\n\n\n\n<p>&nbsp;If the average person quits their job, any shreds of net worth would be depleted almost immediately. At this point, the landlord and the collection agencies come calling, and they would truly end up with no food or shelter beyond what is available through welfare programs. It’s a rough place to be, but this category includes <a href=\"https://www.census.gov/library/visualizations/interactive/social-safety-net-benefits.html\">tens of millions</a> of people in the US.</p>\n\n\n\n<p>But for most Mustachians considering early retirement, the situation is completely different. And to prove this point, let’s try to get Alina to go bankrupt.</p>\n\n\n\n<p>(<em>note: I made all of the spreadsheets and graphs below in &#8220;real&#8221; (inflation-adjusted) dollars so they make more sense from our perspective of today. In reality, all the numbers (both spending and </em>i<em>nvestments/income) will get bigger over time depending on the rate of inflation, but the net effect is the same)</em></p>\n\n\n\n<p><strong>Alina: The Worst Case Scenario</strong></p>\n\n\n\n<p>Instead of “one more year”, she quits her job now.</p>\n\n\n\n<p>Even though the stock market tends to grow along with the economy, let’s assume we enter a never ending period of stagnation where stocks barely even match inflation, and she decides to live only off of the dividends of her $2 million portfolio, which are a paltry 2% at the moment, or $40,000 per year.&nbsp;&nbsp;</p>\n\n\n\n<p>But despite her conservative investment management, she insists on keeping her spending at the full $50k. She never rents out an apartment in her house, never finds any pastimes that generate any income, never switches from Whole Foods to Costco, keeps up the international travel, and always keeps a new-ish car in the driveway despite the fact that she has no more commute.&nbsp;</p>\n\n\n\n<p>The US Social Security program somehow gets canceled despite the fact that our aging population carries the bulk of the voting power and would never vote away its own retirement income, and her mom and dad decide to donate all their remaining wealth to charity rather than leaving it to Alina and her sister.&nbsp;</p>\n\n\n\n<p>In the event of this ridiculously contrived example, she would end up drawing down $10,000 per year from her savings, which means her wealth would drain down to, uh-oh, 1.99 million after the first year. And the trend would continue like this:</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-full is-resized\"><a href=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/07/alina-drawdown-1.png\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/07/alina-drawdown-1.png\" alt=\"\" class=\"wp-image-18244\" width=\"482\" height=\"357\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/07/alina-drawdown-1.png 820w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/alina-drawdown-1-300x222.png 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/alina-drawdown-1-200x148.png 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/alina-drawdown-1-768x569.png 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/alina-drawdown-1-150x111.png 150w\" sizes=\"(max-width: 482px) 100vw, 482px\" /></a></figure></div>\n\n\n\n<p>Uh-oh. So the worst things have happened in many areas of her economic life, and Alina lives out the next 40 years of her life and dies with only $1,395,000 in the account. What a harrowing close call!</p>\n\n\n\n<p>But what if things turned out <strong>worse than the worst? </strong>Despite our best efforts to make her go bankrupt, she still died a millionaire. So we need to get a little more Mad Max in our scenario:</p>\n\n\n\n<p><strong>Alina: Fury Road</strong></p>\n\n\n\n<p>The US decides to cripple its own economy forever so there is no more innovation, no productivity, and all dividends are halted and yet our 330 million citizens all decide to go along with it.&nbsp;</p>\n\n\n\n<p>Amid the chaos and the dune buggy machine gun battles which rage day and night in the street, her wealth drains by $100,000 every year&nbsp; and she is down to a single million by age 60. But she keeps up the spending and refuses to make any changes. She’s broke by age 70 but just sticks to her favorite activities which are rewarding and engaging but never produce a penny of income.</p>\n\n\n\n<p>Her mortgage checks start to bounce. The bank eventually enters foreclosure but she remains glued to that house. After another year, the foreclosure is complete and the sheriff arrives to drag her wiry 71-year-old frame out of the house, kicking all the way.</p>\n\n\n\n<p>Alina is eligible for social programs, but rejects them all. She has a huge network of friends, but doesn’t accept any of their offers for help or employment.&nbsp;</p>\n\n\n\n<p>She checks into a nice all-suites hotel and starts paying all her bills with credit cards, maxing them all out including some cash advances to keep the money flowing. With the usual tricks of balance transfers and delayed-repayment plans, she keeps the party going for two more years, until all the credit cards have been canceled and sent off to collections.</p>\n\n\n\n<p>At age 73, Alina is <em>finally </em>out of money. She cannot buy food or shelter and she has finally arrived at a reality that homeless people currently experience every day right now. But we had to make up an absolutely ridiculous and frankly impossible story to get her there.</p>\n\n\n\n<p>I’ll spare you the long story of Dave’s decline, but it’s equally impossible.&nbsp;</p>\n\n\n\n<p><strong>Dave&#8217;s Doubtful Demise</strong></p>\n\n\n\n<p>If he quit his job today, <strong>stopped airbnbing his house</strong> and just enjoyed the whole thing and never even rented out the lower level, forfeited his six-figure 401k account and social security and everything else except the rental properties and the $1000 from local gigs, this would happen:</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/07/daves-demise.png\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" width=\"1024\" height=\"447\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/07/daves-demise-1024x447.png\" alt=\"\" class=\"wp-image-18272\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/07/daves-demise-1024x447.png 1024w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/daves-demise-300x131.png 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/daves-demise-200x87.png 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/daves-demise-768x335.png 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/daves-demise-1536x671.png 1536w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/daves-demise-150x66.png 150w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/daves-demise-900x393.png 900w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/daves-demise.png 1827w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /></a></figure>\n\n\n\n<p>What the heck!?</p>\n\n\n\n<p>We threw Dave into the worst of situations, something far beyond just quitting his crappy day job and arguably impossible. Yet not only does his cashflow continue to increase, but&nbsp; his net worth skyrockets by about $50,000 per year, ending up at almost <strong>$4 million dollars </strong>(inflation-adjusted too) by the time he kicks the bucket at 90 years old.&nbsp;</p>\n\n\n\n<p>In reality, that purple “other income” column is likely to be triple what the spreadsheet says, his 401(k) account will definitely continue to exist and grow, and many other good things will happen.&nbsp;</p>\n\n\n\n<p><strong>More Realistic Projections for Both Of My Friends</strong></p>\n\n\n\n<p>If you&#8217;re a pessimist, you may have looked at all of those numbers above and said, &#8220;Hmm yeah they made it, but it was a little close&#8221;. But remember, these were <strong>worst case scenarios. </strong>It is foolish to plan everything in your life around the worst case scenario, because it will often result in you having the <strong>minimum possible amount of fun.</strong></p>\n\n\n\n<p> So instead, you need to at least include a conservative estimate of what is most likely to happen<em>.</em> And I&#8217;ve done so for both Alina an Dave, creating these graphs of the results</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-full is-resized\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/07/alina-scenarios-1.png\" alt=\"\" class=\"wp-image-18247\" width=\"567\" height=\"350\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/07/alina-scenarios-1.png 742w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/alina-scenarios-1-300x185.png 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/alina-scenarios-1-200x123.png 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/alina-scenarios-1-150x93.png 150w\" sizes=\"(max-width: 567px) 100vw, 567px\" /><figcaption>Alina grows exponentially richer over time, due to having a large stock portfolio that she never really touches.</figcaption></figure></div>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-full is-resized\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/07/dave-disastertypical.png\" alt=\"\" class=\"wp-image-18273\" width=\"542\" height=\"335\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/07/dave-disastertypical.png 982w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/dave-disastertypical-300x186.png 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/dave-disastertypical-200x124.png 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/dave-disastertypical-768x476.png 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/dave-disastertypical-150x93.png 150w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/dave-disastertypical-900x558.png 900w\" sizes=\"(max-width: 542px) 100vw, 542px\" /><figcaption>Dave does incredibly well too, even starting from a much smaller initial net worth. </figcaption></figure></div>\n\n\n\n<p>So, both of these friends can not only quit working, they can also start splashing out more money on whatever they want. Congratulations to both of you!</p>\n\n\n\n<p>&nbsp;Both of them, and more importantly a large percentage of MMM readers, possibly including <strong>YOU,</strong> are beyond the point where they could ever run out of money even if they quit their jobs today.&nbsp;</p>\n\n\n\n<p>And they need to see this wonderful truth for what it is, so that they can confidently act on it, so that they can stop giving away precious months of their lives away to their employers, to amass still more chunks of easy money, to add to a pile that they will never, ever, ever need.</p>\n\n\n\n<p>And then they can start experiencing actual reality of early retirement, which is as follows:</p>\n\n\n\n<ul><li style=\"padding-bottom: 16px;font-size:17px\">Your spending ends up a little bit lower than you expected, despite your best efforts to splurge on yourself and be generous to others.</li><li style=\"padding-bottom: 16px;font-size:17px\">Your investments <em>do </em>keep going up over the long run, exceeding those conservative forecasts you made.</li><li style=\"padding-bottom: 16px;font-size:17px\">You <em>do </em>end up making bits of money here and there (in Dave’s case shit-tons of money), even though you absolutely don’t need it.</li><li style=\"padding-bottom: 16px;font-size:17px\">As the decades pass and you settle into this pattern, you realize that money is not one of your worries. Life as a Human Being still presents plenty of challenges, but holy shit, thank goodness you quit working when you did because it was completely unnecessary. Looking back, you probably should have done it several years earlier.</li></ul>\n\n\n\n<p>If any of this sounds familiar, congratulations &#8211; you will never run out of money which means you need to stop letting it rule your life.&nbsp;</p>\n\n\n\n<p>Quit your job.</p>\n\n\n\n<p>Seriously.&nbsp;</p>\n\n\n\n<p>Sheesh. What are you waiting for?! </p>\n\n\n\n<p><strong>Epilogue: Mr Money Mustache Chills out for a Splurge too:</strong></p>\n\n\n\n<p>Writing this article reminded me that I too can still be a victim of excessively frugal habits. Sure, my house is beautiful and I have great food, cars, tools, bikes and everything else. But when it comes to travel, I start playing silly games with myself.&nbsp;</p>\n\n\n\n<p>For example, my boy and I are heading to Canada later this month to visit the family. And against all logic, I noticed the Nagging Voices of Cheapness starting to chatter in my head.</p>\n\n\n\n<p><em>“These plane tickets were only $210 each &#8211; can I really justify paying an extra $80 for a bigger seat at the front of the plane? And sheesh, how can I get around the $150 roundtrip Uber ride (or $150 roundtrip driving+parking) to the airport, that’s ALMOST AS MUCH AS THE PLANE TICKET! Should we spend an extra 3 hours roundtrip to save $100 by taking the bus?” And then what about our transportation once we’re in Canada? Bus? Car rental? Train tickets? How does the $7.00 per gallon gasoline factor into this given that we need to travel over 800 miles during our time there?</em></p>\n\n\n\n<p>Blah blah blah. The correct answer is <strong>“Shut up, Mustache! You should do whatever you think is </strong><strong><em>most fun and least stressful, without thinking about the money.”</em></strong></p>\n\n\n\n<p>For me, this means driving my nice electric car on the speedy toll road to the expensive Denver Airport parking lot so we can walk right into the terminal with no shuttle. It also means sitting in a good plane seat, and then taking the least stressful and most fun form of transportation once I get there.</p>\n\n\n\n<p>Why? Because the difference between the cheapest and most stressful trip, and the most expensive one in this case, is only about one thousand dollars.</p>\n\n\n\n<p>Even if I did this every single year for the rest of my life, I’d blow $50,000 on luxurious trips to visit my family (and I could drive my Mom to her 125th birthday in style!)</p>\n\n\n\n<p>And based on my own worst-case spreadsheet, I am <em>never </em>going to wake up and think,</p>\n\n\n\n<p><em>&nbsp;“Damn, if I just had one thousand more dollars, or even <strong>fifty thousand dollars more </strong>in this net worth column, I’d be a happier person”</em></p>\n\n\n\n<p>So I get to relax, and enjoy my trip, and guess what I even did this:</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-full is-resized\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/07/trip-booked-1.png\" alt=\"\" class=\"wp-image-18248\" width=\"237\" height=\"469\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/07/trip-booked-1.png 438w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/trip-booked-1-152x300.png 152w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/trip-booked-1-91x180.png 91w, https://www.mrmoneymustache.com/wp-content/uploads/2022/07/trip-booked-1-76x150.png 76w\" sizes=\"(max-width: 237px) 100vw, 237px\" /></figure></div>\n\n\n\n<p>So I’ll see you in retirement, and maybe even in Canada later this month!</p>\n\n\n\n<p><strong><em>Further Homework for Spreadsheet Lovers</em></strong>:</p>\n\n\n\n<p>I have shared a copy of the Google Sheets spreadsheet I made for these examples and graphs <strong><span style=\"text-decoration: underline;\"><a href=\"https://docs.google.com/spreadsheets/d/1yaxKgk-HnbaZeZZcZR4leF8-jdp97hdj2CmponV6BYE/copy?usp=sharing\" data-type=\"URL\" target=\"_blank\" rel=\"noreferrer noopener\">here</a></span></strong>. You should be able to &#8220;file->make a copy&#8221; to get an editable version to mess around with. Mine are pretty basic and leave out some details in order to avoid getting any more complicated than they already are, but feel free to add more if you like,</p>\n\n\n\n<p><em><strong>In the Comments:</strong></em></p>\n\n\n\n<p><em>Are you too fearful, or too optimistic, or somewhere in between? If you have already quit your job, how did you get the confidence? If you’re still stuck in One More Year Limbo, what would it take to get you out of it?</em></p>\n",
  "wfw:commentRss": "https://www.mrmoneymustache.com/2022/07/18/never-run-out-of-money/feed/",
  "slash:comments": 199,
  "post-id": 18240
}