{
  "title": "The Unflagging Faith of Nick Foles | How the NFL’s star quarterback overcame his fears and self-doubt to find freedom – and success",
  "pubDate": "Fri, 01 Feb 2019 00:04:59 +0000",
  "guid": "c6728cec438343da967b6d7fd1cc721e",
  "link": "https://tonyrobbins.libsyn.com/the-unflagging-faith-of-nick-foles-how-the-nfls-star-quarterback-overcame-his-fears-and-self-doubt-to-find-freedom-and-success",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">What’s standing in your way of achieving your goals, your dreams? What is holding you back from taking that next step forward? For many of us, it’s fear. Fear of failure, fear of the unknowns. We become our own worst enemy, doubting ourselves into paralysis.</span></p> <p><span style=\"font-weight: 400;\">But imagine what your life could look like, if you were able to find a reason that was so much bigger than yourself to propel you forward. I’m not talking about money or material objects, I’m talking about a greater purpose and a resounding and unflagging faith that for you, there is no other option that to give it everything you have.</span></p> <p><span style=\"font-weight: 400;\">In this episode of the Tony Robbins Podcast, you will hear a very special conversation between Tony and Eagles Quarterback, Nick Foles. Now this interview happened</span> <em><span style= \"font-weight: 400;\">after</span></em> <span style= \"font-weight: 400;\">Nick helped lead the Eagles to their Super Bowl Championship in 2018, where he was also named the game’s MVP. But what you’ll see is that even in spite of his incredible accomplishments, Nick’s sense of past failures and mistakes is never too far from his mind.</span></p> <p><span style=\"font-weight: 400;\">Nick reveals his constant battles with self-doubt and a fear of failure. In fact, it was this fear that almost kept him out of the NFL entirely. But through his faith and his family, Nick found a greater sense of purpose and strength that have helped him move forward. And he’s even adopted an entirely new perspective when it comes to fear.</span></p> <p><span style=\"font-weight: 400;\">He’s a firm believer that if he hadn’t experienced failure and pain in his past, he wouldn’t be where he is today. And along his journey, he’s seen how immensely important it is to be open, honest and transparent about your weaknesses. Because by acknowledging and even embracing your deepest fears, you actually free yourself, and can then grow into the person you were meant to be.</span></p> <p><br /></p>",
  "content:encoded": "<p>What’s standing in your way of achieving your goals, your dreams? What is holding you back from taking that next step forward? For many of us, it’s fear. Fear of failure, fear of the unknowns. We become our own worst enemy, doubting ourselves into paralysis.</p> <p>But imagine what your life could look like, if you were able to find a reason that was so much bigger than yourself to propel you forward. I’m not talking about money or material objects, I’m talking about a greater purpose and a resounding and unflagging faith that for you, there is no other option that to give it everything you have.</p> <p>In this episode of the Tony Robbins Podcast, you will hear a very special conversation between Tony and Eagles Quarterback, Nick Foles. Now this interview happened <em>after</em> Nick helped lead the Eagles to their Super Bowl Championship in 2018, where he was also named the game’s MVP. But what you’ll see is that even in spite of his incredible accomplishments, Nick’s sense of past failures and mistakes is never too far from his mind.</p> <p>Nick reveals his constant battles with self-doubt and a fear of failure. In fact, it was this fear that almost kept him out of the NFL entirely. But through his faith and his family, Nick found a greater sense of purpose and strength that have helped him move forward. And he’s even adopted an entirely new perspective when it comes to fear.</p> <p>He’s a firm believer that if he hadn’t experienced failure and pain in his past, he wouldn’t be where he is today. And along his journey, he’s seen how immensely important it is to be open, honest and transparent about your weaknesses. Because by acknowledging and even embracing your deepest fears, you actually free yourself, and can then grow into the person you were meant to be.</p> <p></p>",
  "enclosure": "",
  "itunes:duration": "29:41",
  "itunes:explicit": false,
  "itunes:keywords": "Championship,Nick,football,faith,tony,robbins,foles",
  "itunes:subtitle": "What’s standing in your way of achieving your goals, your dreams? What is holding you back from taking that next step forward? For many of us, it’s fear. Fear of failure, fear of the unknowns. We become our own worst enemy, doubting ourselves into...",
  "itunes:episodeType": "full"
}