{
  "id": "yt:video:AeuZZuobHEo",
  "yt:videoId": "AeuZZuobHEo",
  "yt:channelId": "UCMTk_R_Y49jvq-HQXDmKI0Q",
  "title": "The Problems With Blaire White - Misinformation And \"Moderation\" | TRO",
  "link": "",
  "author": {
    "name": "The Right Opinion",
    "uri": "https://www.youtube.com/channel/UCMTk_R_Y49jvq-HQXDmKI0Q"
  },
  "published": "2021-09-25T22:00:34+00:00",
  "updated": "2022-05-11T15:03:42+00:00",
  "media:group": {
    "media:title": "The Problems With Blaire White - Misinformation And \"Moderation\" | TRO",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The Problems With Blaire White - Misinformation And \"Moderation\" | TRO\n\n0:00:00 - Introduction\n0:06:20 - Setting The Scene\n0:13:50 - The Anti-Feminist\n0:21:54 - The Good One\n0:29:25 - The Playground\n0:37:39 - A New Leaf\n0:47:37 - Changes\n0:56:42 - One Step Back\n1:04:28 - A New Calling\n1:13:19 - Ground Hog Day\n1:22:23 - God I'm So Done\n1:31:38 - The Moderate\n1:42:06 - The Hill\n1:51:12 - The Fall\n2:00:34 - The Apology\n2:09:47 - Credibility\n2:17:32 - The Blaire White Saga\n2:24:39 - It Never Ends\n2:32:42 - Moderation\n2:46:00 - Conclusion & Credits\n\nIntro: \n\nI recall back to my Q&A in March, when The Nostradamus Opinion announced that the year seemed to calming down, which in hindsight, was a slightly a misguided forecast, in fact, I’d positively say it was a kiss of death, as the world has careened towards its frankly, well-deserved armageddon. \n\nHonestly, I’ve not handled it too well personally, to see so much going on often makes me want to curl up into a ball and hibernate, or aestivate if you consider when all this was happening. At the same time, there’s always reason within the chaos, and I’ve always lived by the philosophy that I’d emerge from hardships a wiser man, and a part of me hopes that would be similarly applicable on a macro level as well. However, we’ll never reach that if we can’t have a proper, mature discussion to understand how such discord has arisen, and at times where emotions can run high we often need voices of reason to lead that discourse forward, so that we can all learn from such adversities.\n\nIn the past few years in particular, I feel that YouTube has become increasingly integral to that conversation, introducing a new generation to the many complex, and sometimes not as complex matters facing down today’s youth, with online creators engaging audiences through fresh mediums, acquainting them with new ideas and perspectives. Although the nature of my channel can be a little biographical, I hope that people have found value in the viewpoints I have to share. And you know what? I’d say the feedback has been broadly positive. One way that people recognise the work you do is what some regard as “Year end lists”, where people compile a selection of their favourite creators, and post it to their preferred social media site.\n\nAt the end of 2019, I was once again honoured by being placed amongst YouTubers who put great effort into their respective hustle, however, one name whose presence I was surprised to see was a commentator by the name of Blaire White.\n\nWant to know more? Watch the video...",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}