{
  "id": "tag:blogger.com,1999:blog-7815614485808579332.post-6262728517595280370",
  "published": "2022-08-10T11:22:00.000-07:00",
  "updated": "2022-08-10T11:22:05.934-07:00",
  "category": [
    "",
    ""
  ],
  "title": "Country targeting in Shopping Ads campaigns is changing in August 2022",
  "content": "We’re starting a phased rollout of a change to country targeting in Google Ads and Merchant Center. The rollout has already begun and will continue into September.<br /><br /> See <a href=\"http://ads-developers.googleblog.com/2022/08/feed-label-replaces-target-country-in.html\">Feed label replaces target country in Content API for Shopping</a> for how this change impacts the <a href=\"https://developers.google.com/shopping-content/guides/quickstart\">Content API for Shopping</a>.<br /><br /> When the change reaches you, you’ll be able to set the <a href=\"https://developers.google.com/google-ads/api/reference/rpc/v11/Campaign.ShoppingSetting#feed_label\"><code>feed_label</code></a> field in <code>ShoppingSetting</code> for Shopping &amp; Performance Max campaigns in the UI and API. Due to this change, you may begin seeing campaigns with <code>feed_labels</code> set in the UI and API for certain merchants. Campaigns with <ocde>feed_label</code> not set to a 2-letter CLDR territory code can serve ads in any country as long as the campaign has the appropriate <code>geoTargeting</code> and the appropriate target countries are set in Merchant Center.<br /><br /> <strong>This change doesn’t impact the countries targeted by existing shopping feeds. You don’t need to update existing shopping feeds or campaigns.</strong><br /><br />   <strong>What’s changing in Merchant Center</strong><br />Today, Google Merchant Center feeds require you to select a primary <strong>country of sale</strong> target (<a href=\"https://developers.google.com/google-ads/api/reference/rpc/v11/Campaign.ShoppingSetting#sales_country\"><code>sales_country</code></a> in Google Ads API), with the option to provide additional target countries once the feed has been created. Starting in August 23, 2022, we will make the following changes to how target countries are organized in the Merchant Center UI: <ul>  <li>The primary <strong>country of sale</strong> option will be removed in Google Merchant Center. <strong>Country of sale</strong> will be replaced by the more generic <code>feed_label</code> that can accept any string, including any existing 2 letter CDLR country code.</li>  <li>The current <code>additional countries</code> field will be renamed <code>target countries</code>, and will include all countries you want the feed to target.</li></ul> <strong>What’s changing in Google Ads UI and API</strong><br />The current <a href=\"https://developers.google.com/google-ads/api/reference/rpc/v11/Campaign.ShoppingSetting#sales_country\"><code>sales_country</code></a> field for all available Shopping campaign types, including Performance Max, will eventually be replaced by <a href=\"https://developers.google.com/google-ads/api/reference/rpc/v11/Campaign.ShoppingSetting#feed_label\"><code>feed_label</code></a>. Note that we will keep the <a href=\"https://developers.google.com/google-ads/api/reference/rpc/v11/Campaign.ShoppingSetting#sales_country\"><code>sales_country</code></a> field for backwards compatibility until at least Q2 2023. Right now, you can continue to use <code>sales_country</code> in your campaigns.<br /><br /> You can create a <code>feed_label</code> in Google Merchant Center or the Content API. Feed labels let you group different offers according to a common trait, like language (or a country, as you’ve currently been doing). You can also use <code>feed_label</code>s in Google Ads campaigns to target the relevant offers (all products with the same Merchant Center feed label).<br /><br /> The ads for the offers that match the <code>feed_label</code> will show based on the following: <ol>  <li>The countries you selected as target countries in Merchant Center.</li>  <li>Your campaign’s geo targeting. <strong>Note</strong>: The default campaign targeting behavior (if you do not geo target) is that your products will serve in all your Merchant Center target countries.</li></ol> <strong>How you’re impacted</strong><br />The phased rollout to enable this feature in Google Ads UI and API has already started, and is expected to be complete by the end of September 2022. For existing feeds, <code>feed_label</code> will automatically be set to the two-letter territory code of the existing <code>sales_country</code> field to avoid interrupting existing targeting.<br /><br /> However, if you want to support new users or new feeds that only have a <code>feed_label</code> and <strong>not</strong> a <code>sales_country</code> field, we recommend you update your code by August 23, 2022 to accommodate customers who will use campaigns that only have a <code>feed_label</code> (without a <code>sales_country</code>).<br /> <img height=\"100%\" width=\"100%\" src=\"https://lh4.googleusercontent.com/LddBoLrPfhyYmblNHyxhzv02E8qyVxra9eTqi3EHriOCZmmDcOgHOi9dVIYpFVZawtYqUUWMwQRd8XwjdlzoZH1KXDE-IKcSQa11kGloAmwISO11sH_zLzD1HRNb3qnJAhmsvmND3tmUtV5kh2xFtXc\" /><br /> If you have any questions or concerns, please don't hesitate to contact us via the <a href=\"https://groups.google.com/g/adwords-api\">forum</a>.<br /> <span class='byline-author'><img height=\"40\" width=\"40\" src=\"https://lh5.googleusercontent.com/wsjBn43yuNVLhNQSKybeSaSLqRlzaojCO4PYKPs_ySxkJ1gPTJRd4ozaAyDdOM4Xbs-gecC-TCrOXcgZWN9tmJrkAPmYsYJFyU5vb4AbHje633MCnqfVtwoEYIfqDjdcFRedbIX6qBU9vS8BGz1obP_m4GDjO65zlxSMY-GmXZZXc5wCwe08PvqQ73_JHRM\" style=\"vertical-align: middle; border:none;\"/> Benji Rothman, Content API for Shopping Team</span>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google Ads Developer Advisor",
    "uri": "http://www.blogger.com/profile/16700526826531306391",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}