{
  "title": "S14 Ep87: Supernatural News/Parashare: Bunnies and Bruisers Edition",
  "link": "https://audioboom.com/posts/8098543",
  "itunes:episode": 87,
  "itunes:title": "Supernatural News/Parashare: Bunnies and Bruisers Edition",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5919,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS reports the strange this week on Supernatural News & ParaShare Bunnies and Bruisers edition!<br>\n<br>\nWe hurdle headlong into Halloween with Edward Snowden blowing the whistle on Aliens... but not how you think,A Ghost Baby makes his first and last appearance on camera, The Girls Next Door get one more \"Rise\" from Hugh Hefner, but it's from the dead PLUS your stories and WWE Superstars as well in ParaShare!<br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nAre you playing along with Beyond the Darkness on the Podcast One/ <a href=\"http://Betonline.AG\">Betonline.AG</a> Sportsnet Challenge?!  Each Week Dave and Tim are picking the winners of five NFL gam,es and playing against the hosts of different Podcast One shows!  If you play aloing with Dave and Tim on <a href=\"http://BetOnline.AG\">BetOnline.AG</a>, and they win the week, you qualify to be one of five winners splitting a $500 weekly prize! To sign up go to <a href=\"https://promotions.betonline.ag/podcastone\">https://promotions.betonline.ag/podcastone</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.<br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !",
  "itunes:summary": "BEYOND the DARKNESS reports the strange this week on Supernatural News & ParaShare Bunnies and Bruisers edition!\n\nWe hurdle headlong into Halloween with Edward Snowden blowing the whistle on Aliens... but not how you think,A Ghost Baby...",
  "pubDate": "Sat, 26 Oct 2019 08:00:00 +0000",
  "guid": "6db4285f-a0e0-4dd5-a42b-8ed6a066e753",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}