{
  "guid": "prx_126_6c2b91c6-6cc2-4ec1-8669-156530fb14b4",
  "title": "The Summer of Night Vale Presents, Part 2",
  "pubDate": "Fri, 13 Jul 2018 04:00:00 -0000",
  "link": "https://beta.prx.org/stories/248945",
  "description": "<p>This is the Summer of Night Vale Presents, a celebration and sampling of some of the shows across our network. This week, we hear from two of our newest fiction shows, <a href=\"http://poundedinthebuttbymyownpodcast.com\" rel=\"nofollow\" target=\"_blank\">Pounded In The Butt By My Own Podcast</a> and <a href=\"http://itmakesasound.com\" rel=\"nofollow\" target=\"_blank\">It Makes A Sound</a>. Plus, an update on <a href=\"http://withinthewires.com\" rel=\"nofollow\" target=\"_blank\">Within the Wires</a> Season 3.</p>\n\n<p><a href=\"http://withinthewires.com\" rel=\"nofollow\" target=\"_blank\">Within the Wires</a> returns on September 4. Each season tells a new story in the same world, using a single set of found audio. Season One is a prison break / romance told entirely through relaxation tapes. Season Two is the mystery of a missing woman told through a decade’s worth of museum audio guides. Season Three, coming this September, is a political thriller told through dictaphone recordings to a secretary.</p>\n\n<p><a href=\"http://poundedinthebuttbymyownpodcast.com\" rel=\"nofollow\" target=\"_blank\">Pounded In The Butt By My Own Podcast</a> is our collaboration with celebrated author Chuck Tingle. Chuck’s short stories have entertained and aroused readers across the world, and we are excited to bring his stories to life with performances by celebrity guests like Cecil Baldwin, Mara Wilson, and Becca Blackwell. Whether you’re new to the Tingleverse or have lived there for years, this is the podcast about love that you never knew you needed.<br>\n<br>\n<a href=\"http://itmakesasound.com\" rel=\"nofollow\" target=\"_blank\">It Makes A Sound</a> is the story of a woman named Deirdre who finds a cassette tape from 1992 in her attic. What follows is a surprising story about family, memory, and music that goes places that you don’t expect. Join her quest to make Rosemary Hills come back to life with the sound of music.</p>\n\n<p>Find out more about these shows, and all of the shows on our network, by visiting <a href=\"http://nightvalepresents.com/\" rel=\"nofollow\" target=\"_blank\">nightvalepresents.com.</a></p>",
  "enclosure": "",
  "itunes:subtitle": "This is the Summer of Night Vale Presents, a celebration and sampling of some of the shows across our network.",
  "itunes:episodeType": "full",
  "itunes:duration": "51:28"
}