{
  "title": "TU107: What is Somatic Experiencing With Guest Abi Blakeslee",
  "link": "https://therapistuncensored.com/episodes/what-is-somatic-experiencing-with-guest-abi-blakeslee/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=what-is-somatic-experiencing-with-guest-abi-blakeslee",
  "pubDate": "Wed, 30 Oct 2019 09:01:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=7662",
  "description": "Trauma is not a life sentence. We are rapidly learning what works to reverse the effects of stored injuries and today we will explore one treatment version of that, called Somatic Experiencing. \n\nFirst a shout out to a listener who connected us to our guest today, Ali Capurro – thank you! And to everyone else please note that we love these kinds of connections are always open to hear from you on who you think would deepen this conversation of earning security.\nIn This Episode of Therapist Uncensored,\nco-host Sue Marriott explores Somatic Experiencing with Dr Abi Blakeslee. This interactive deep-dive takes you into the Somatic Experiencing process and provides hope and confirmation that healing trauma is possible through integrated treatment of the brain, the body, and the mind!\nThe Foundations of Somatic Experiencing (SE)\n\n \tFounded by Dr Peter Levine – author of best-selling books “Waking the\n \tTiger- Healing Trauma”, and “In an Unspoken Voice”\n \tSE is based on the study of how animals in the wild process and recover from stress and trauma.\n \tFocuses on working directly with the nervous system to help people reorganize the non-conscious survival adaptations developed by the sub-cortical or lower brain\n\nDefinition of Somatic Experiencing\n\n \tthe experience of body in the present moment.\n\nWhat SE Looks Like in Practice\n\n \tPresent-centered because the healing happens in the here-and-now.\n \tIt’s a process of following what is is happening in the body and taking a pause from the trauma content to down-regulate the amygdala to a state of safety before moving forward.\n\n“The trauma’s not in the event. It’s in the nervous system.”\nThe Nervous System\nGetting “Unstuck” – Healing Trauma Through Body Awareness\n\n \tPendulation – Peter Levine defines that as the expansion of contraction of all things moving between expanded States and contracted States.\n \tOrienting Exercise\n\nThe Biological Model of the Threat Response Cycle\n\n \tWild Animals Versus Humans During Threat\n \tCycle:\n \t Orient – aware of something in environment\n \tDefensive Orienting – sense threat\n \tMoving Into Social Interaction –\n \tMoving Into Fight and Flight – these are active defense responses\n \tIncreased sympathetic arousal, burst of movements,\n \tMoving Into Freeze – passive defense response\n \tHeart rate goes into a slow state like for hibernation. Digestion slows down, hello heart rate variability circulation. There’s nothing pumping to the arms and the legs, so everything shifts into this near death state\n \tBack to Exploratory Orienting\n\nWorking With the Nervous System\n\n \tTracking Sensation – describing sensations happening in the body as they are happening\n \tNoticing Movement Patterns – acknowledging the shifts that occur\n \tCompletion of Defensive Responses – allowing the body to carry out the response desired (runnint, punching, kicking, etc) but VERY SLOWLY\n \tSympathetic Discharge When Coming Out of Freeze or Down From High Sympathetic Charge\n \tImpala and the Baboon Video\n \tGrounding Exercise\n\nNeuroception vs Interoception\n\n \tNeuroception is the lower brain assessment of safety/threat in the environment.\n \tInteroception is the awareness of one’s own internal states and can be learned over time.\n\nWho is Dr Abi Blakeslee:\nDr. Abi Blakeslee is faculty at the Somatic Experiencing Trauma Institute and Foundation for Human Enrichment. She is additionally Dr. Peter Levine’s legacy faculty at Ergos Institute for Somatic Education. Dr. Blakeslee holds a Ph.D. in Clinical and Somatic Psychology and is a licensed marriage and family therapist. Her dissertation, with a committee that included Dr. Daniel Siegel, generated original research on the role of implicit memory in healing trauma. Dr. Blakeslee integrates SE with clinical research, secondary trauma interventions, and the psychobiological principles of attachment and shock trauma. She treats individuals, couples, children and families in her clinical practice. Dr.",
  "enclosure": "",
  "itunes:subtitle": "Trauma is not a life sentence. We are rapidly learning what works to reverse the effects of stored injuries and today we will explore one treatment version of that, called Somatic Experiencing.  - First a shout out to a listener who connected us to ou...",
  "itunes:summary": "TU107: What is Somatic Experiencing With Guest Abi Blakeslee",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "1:00:26"
}