{
  "title": "Regulation, Discretion, and Public Choice with Stephen M. Jones",
  "pubDate": "Fri, 24 Feb 2017 21:16:08 +0000",
  "guid": "b5500704727db42bfa6c2f3cdac12640",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP44SMJones_EDR.mp3",
  "itunes:image": "",
  "description": "<p>What follows is an edited partial transcript of my conversation with Stephen M. Jones. He is an economist for the US Coast Guard. However, we are discussing his own research, so nothing in this conversation should be taken to represent the official views of the US Coast Guard.</p> <hr /> <p><strong>Petersen:</strong> So Stephen, let's start just by defining regulatory discretion. What does that mean in this context?</p> <p><strong>Jones:</strong> Sure. So, I think first off, we should probably define regulation because when Congress writes a law, they pass the law on to regulatory agencies and it will say something to the effect of \"agencies: issue a regulation.\" So, when we talk about regulations this point isn't always clear because people just aren't familiar with this process. The regulation is a statement that kind of clarifies existing congressional law or is written in direct response to congressional law. And this could be as specific as, say, Congress can direct an agency to set an exact amount of pollution that is permitted for an industry to as broad as saying something like \"protect consumers from unreasonable risks.\" And then the agency has room to interpret that statement as wide as it wants to.</p> <p>So, when I talk about agency discretion what I'm really talking about is Congress wrote a rule that gave the agency power to issue legally binding rules that may or may not trace directly back to Congress.</p> <p><strong>Petersen:</strong> Yes. So, in the example you use with the pollution, Congress has something fairly specific in mind---a specific type of pollution---but the agency might have to clarify and to say what counts as pollution and how much they're measuring it and maybe they might establish a quota system, they might have specific rules for specific firms. And in the other example you gave, which is just protecting consumers from unnecessary risk, in that case they can basically write rules as if they were their own legislator, they're essentially doing what Congress is ostensibly meant to do. Is that correct?</p> <div style=\"float: right; padding-left: 10px;\"><a href= \"https://www.amazon.com/Politics-Information-Problem-Definition-America/dp/022619812X/ref=as_li_ss_il?ie=UTF8&qid=1487952272&sr=8-1&keywords=the+politics+of+information&linkCode=li2&tag=economicsde0f-20&linkId=1e4030332fdc72aabe9ba96ead586ab5\" target=\"_blank\"><img src= \"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=022619812X&Format=_SL160_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=economicsde0f-20\" alt=\"\" border=\"0\" /></a><img style= \"border: none !important; margin: 0px !important;\" src= \"https://ir-na.amazon-adsystem.com/e/ir?t=economicsde0f-20&l=li2&o=1&a=022619812X\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" /></div> <p><strong>Jones:</strong> I'm not sure I would go that far. So, there are various theories of the purpose of the regulatory apparatus in the bureaucracy. Some people---I cite them in the paper---<a href=\"http://amzn.to/2lDCSbb\" target= \"_blank\">Baumgartner and Jones</a> and Workman have one that is called 'The Politics of Information' and I forget what the other is called, it was written in 2015. And their theory instead is that Congress gives the agencies discretion because Congress doesn't know the problems it needs to solve and so the agency is kind of like the specialists that you subcontracted to figure out what Congress wants them to solve without actually knowing, say the relevant information to determine that.</p> <div style=\"float: right; padding-left: 10px;\"><a href= \"https://www.amazon.com/Administrative-Law-Unlawful-Philip-Hamburger/dp/022632463X/ref=as_li_ss_il?ie=UTF8&qid=1487952660&sr=8-1&keywords=hamburger+administrative+law&linkCode=li2&tag=economicsde0f-20&linkId=650c38bf102b6ef3d800b89357a84feb\" target=\"_blank\"><img src= \"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=022632463X&Format=_SL160_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=economicsde0f-20\" alt=\"\" border=\"0\" /></a><img style= \"border: none !important; margin: 0px !important;\" src= \"https://ir-na.amazon-adsystem.com/e/ir?t=economicsde0f-20&l=li2&o=1&a=022632463X\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" /></div> <p>That's one theory. You've got other people like <a href= \"http://amzn.to/2kUqKFr\" target=\"_blank\">Philip Hamburger</a> notably, who has written a whole book on how administrative law, which is another word for regulation, is unlawful and so he goes through sort of the common-law tradition and cites numerous pieces of evidence to say, exactly in the way that you put it, that it's a deep legislative function and only Congress should be performing that.</p> <p>And so, whether that's true I think depends on a number of different assumptions that aren't always discussed directly in the literature. That would be my interpretation if that makes sense.</p> <p><strong>Petersen:</strong> Right. And of course, we're approaching this from an economic standpoint so there are important public choice issues involved with this. The same rule whether it's written by a legislator or a bureaucracy---a regulatory agency--- it's the same rule and so in principle, there should be no difference. But the important thing is that the agency and the Congress may have different incentives and may write different rules. That's what I interpret as an important underlying theme in your paper.</p> <p><strong>Jones:</strong> That's most certainly true. So, that's actually one of the things that frustrate me greatly about reading a lot of these other, I think, great researchers who don't in my opinion sufficiently consider the role of incentives. To couch it in Baumgartner's or in Jones' and Workman's terms, okay, let's assume that the purpose of the bureaucracy is to create the information that's necessary to solve the national problems, whatever these supposed national problems are. Why would you assume that bureaucrats would supply the right amount of information in the right ways consistently throughout time?</p> <p>And it's not clear to me that those incentive systems are ever worked out; or if you do work them out, I don't think it actually shows that bureaucrats are beholden directly to Congress. So the big terminal literature, which comes from <a href= \"https://web.stanford.edu/group/mcnollgast/cgi-bin/wordpress/mcnollgast/\" target=\"_blank\">McNollgast</a>, which is McCubbins, Noll, and Weingast, in the 80s is called Congressional dominance. They basically say that because Congress writes the rules they structure all the incentives and have all the tools at their disposal to monitor and police agencies. And I'm just deeply skeptical that that works as well as they describe.</p> <p><strong>Petersen:</strong> Right. Your paper mentions the Administrative Procedure Act which is sort of an attempt by Congress to keep these agencies in check. Could you describe that act and what exactly it does?</p> <p><strong>Jones:</strong> Sure. So, the Administrative Procedure Act is the main document that governs how agencies regulate. It defines the process by which regulation is made. And the chief component is that it really says before an agency issues a regulation it has to go through notice-and-comment. And what that means is when it sends out a rule it issues it in the Federal Register, which is the government's journal of record, and then it allows everybody to comment on this rule, and literally anybody will comment on these rules, and the agency is legally required to respond to all comments.</p> <p>So, the basic theory is this, it's kind of got a two-part mechanism here. On the one side, it's a sort of direct structural constraint and doesn't really affect agency decision making because all it's really saying is you have to send out all rules---if the fire alarm is triggered it acts like a fire alarm. So, if you get a whole bunch of comments it's a really easy way for Congress to tell, \"oh there's a problem with this policy\" or it's a contentious policy because all of these people commented it and it's really loud, it's like a fire alarm. But it doesn't necessarily mean that an agency, that an individual bureaucrat in that agency really feels that alarm. It's more like it'll just be triggered, make sure just do something that doesn't trigger that alarm and you should be okay.</p> <p>The other way in which it might change agency behavior is that by forcing agencies to publish rules they reveal a lot of information and in the rule itself you have to describe, say, the cost of the benefits. You have to describe whether or not it has impacts on Native American tribes, or on the Federal structure, or various other executive orders that have been issued. So, one of the main ways in fact that notice-and-comment system has changed is executive orders that define how in a very practical sense these final rules will be constructed. And so, they're all today reviewed in an office inside of the OMB---the Organization for Management and Budget---and the office is called a wire at the Office of Information and Regulatory Affairs. And so, they're responsible for reviewing all regulation and they are an Office of the president. So, some people then conclude that the President has all this power, in effect, of rulemaking in general.</p> <p><strong>Petersen:</strong> I guess the idea of the President is that it's the executive branch and so it executes and it sort of makes sense that these agencies that are executing laws would ultimately be beholden to the President. It sort of fits. So, do you know quantitatively how many comments? Are these regulatory agencies writing regulations and getting hundreds of comments every time, or is it rare to get even one comment?</p> <p><strong>Jones:</strong> It depends on the agency and it depends on the rules. So EPA because many of its rules will have national effects, and then there are national environmental organizations that you can say are key stakeholders in the outcome of all these rules could very easily generate hundreds of thousands of comments. And so, they'll actually have computer programs that scrape the comments and kind of try to sort them in the boxes. You have other organizations, like FRA for instance, they might have a rule that only gets 30 comments.</p> <p><strong>Petersen:</strong> Sorry what does FRA stand for?</p> <p><strong>Jones:</strong> Sorry, that's the Federal Railroad Administration and that's one of the two main regulators of railroads in the United States. The other regulator, the Service and Transportation Board, is primarily focused on business practices, antitrust type issues, and FRA is focused primarily on health safety and welfare of anything railroad related. So that's everything from, say, the occupational safety of railroad workers to the safety of passengers on trains. And so, the Federal Railroad Administration might only get 30 to 40 comments on a normal rule, they might even get less than that. It really depends on the rule itself.</p> <p><strong>Petersen:</strong> And typically, this would be if a rule affects my business and I might pay attention to the new rules coming out in my industry and if one I thought was going to be detrimental to my bottom line if I work for or run a private business, then I would comment. Is that the typical thing that happens?</p> <p><strong>Jones:</strong> Probably. I really think the diversity of interaction is so high it's really hard to characterize exactly what normal public commenting looks like. Because it could be everything from \"I'm a regulated businessman who wants this,\" there might be somebody on the other side who benefits directly because the new rule sets a standard and the standards organization writes in and says your standard isn't strict enough. It could be something like there's a proposed rule that the Federal Aviation Administration, which regulates commercial flying, or anything air related at all pretty much, and they have a rule on the use of cell phones on planes. They've got about 5,000 comments, 6,000 comments. It's quite a number. Once you get above 100 that's usually quite significant. And a lot of those could be something as simple as \"we just think phones shouldn't be on planes\" and just average citizens writing in upset at the very concept of a phone being on a plane. So, there's quite a diversity of interactions between the agency and public on that.</p> <p><strong>Petersen:</strong> So, getting into the main topic of your paper you discuss what you call channels of influence. So, what are those and why are they important?</p> <p><strong>Jones:</strong> Yes. The way I think about it is this. I think the chief question of the bureaucracy literature is who does this regulatory bureaucracy exist for? Does it exist for interest groups? Does it exist for Congress to ultimately provide information that Congress needs? Does it exist for the President to carry out the President's wishes and his policy? Or does it exist for the bureaucrats themselves which is the one I also like to emphasize because the literature on that one is not very common today. It was more common I think about 30 years ago but the framing of it is a little different.</p> <p>And so, my point is to say each one of these separate groups should have an effect on the outcome itself of the final rule which changes say the regulatory set. Some rules may be demanded by bureaucrats, some rules are demanded by interest groups in Congress. If I were to put it in the econ speak---because I'm writing this paper probably more for a political science literature---but if I had to put it in an econ speak my I'm kind of saying you have four different demanders for this product and so who is the regulatory agency really supplying this for? It's I think really how I'm thinking about it.</p> <hr /> <p>For the full conversation, listen to the episode.</p> <p> </p>",
  "content:encoded": "<p>What follows is an edited partial transcript of my conversation with Stephen M. Jones. He is an economist for the US Coast Guard. However, we are discussing his own research, so nothing in this conversation should be taken to represent the official views of the US Coast Guard.</p>  <p>Petersen: So Stephen, let's start just by defining regulatory discretion. What does that mean in this context?</p> <p>Jones: Sure. So, I think first off, we should probably define regulation because when Congress writes a law, they pass the law on to regulatory agencies and it will say something to the effect of \"agencies: issue a regulation.\" So, when we talk about regulations this point isn't always clear because people just aren't familiar with this process. The regulation is a statement that kind of clarifies existing congressional law or is written in direct response to congressional law. And this could be as specific as, say, Congress can direct an agency to set an exact amount of pollution that is permitted for an industry to as broad as saying something like \"protect consumers from unreasonable risks.\" And then the agency has room to interpret that statement as wide as it wants to.</p> <p>So, when I talk about agency discretion what I'm really talking about is Congress wrote a rule that gave the agency power to issue legally binding rules that may or may not trace directly back to Congress.</p> <p>Petersen: Yes. So, in the example you use with the pollution, Congress has something fairly specific in mind---a specific type of pollution---but the agency might have to clarify and to say what counts as pollution and how much they're measuring it and maybe they might establish a quota system, they might have specific rules for specific firms. And in the other example you gave, which is just protecting consumers from unnecessary risk, in that case they can basically write rules as if they were their own legislator, they're essentially doing what Congress is ostensibly meant to do. Is that correct?</p> <a href= \"https://www.amazon.com/Politics-Information-Problem-Definition-America/dp/022619812X/ref=as_li_ss_il?ie=UTF8&qid=1487952272&sr=8-1&keywords=the+politics+of+information&linkCode=li2&tag=economicsde0f-20&linkId=1e4030332fdc72aabe9ba96ead586ab5\" target=\"_blank\"></a> <p>Jones: I'm not sure I would go that far. So, there are various theories of the purpose of the regulatory apparatus in the bureaucracy. Some people---I cite them in the paper---<a href=\"http://amzn.to/2lDCSbb\" target= \"_blank\">Baumgartner and Jones</a> and Workman have one that is called 'The Politics of Information' and I forget what the other is called, it was written in 2015. And their theory instead is that Congress gives the agencies discretion because Congress doesn't know the problems it needs to solve and so the agency is kind of like the specialists that you subcontracted to figure out what Congress wants them to solve without actually knowing, say the relevant information to determine that.</p> <a href= \"https://www.amazon.com/Administrative-Law-Unlawful-Philip-Hamburger/dp/022632463X/ref=as_li_ss_il?ie=UTF8&qid=1487952660&sr=8-1&keywords=hamburger+administrative+law&linkCode=li2&tag=economicsde0f-20&linkId=650c38bf102b6ef3d800b89357a84feb\" target=\"_blank\"></a> <p>That's one theory. You've got other people like <a href= \"http://amzn.to/2kUqKFr\" target=\"_blank\">Philip Hamburger</a> notably, who has written a whole book on how administrative law, which is another word for regulation, is unlawful and so he goes through sort of the common-law tradition and cites numerous pieces of evidence to say, exactly in the way that you put it, that it's a deep legislative function and only Congress should be performing that.</p> <p>And so, whether that's true I think depends on a number of different assumptions that aren't always discussed directly in the literature. That would be my interpretation if that makes sense.</p> <p>Petersen: Right. And of course, we're approaching this from an economic standpoint so there are important public choice issues involved with this. The same rule whether it's written by a legislator or a bureaucracy---a regulatory agency--- it's the same rule and so in principle, there should be no difference. But the important thing is that the agency and the Congress may have different incentives and may write different rules. That's what I interpret as an important underlying theme in your paper.</p> <p>Jones: That's most certainly true. So, that's actually one of the things that frustrate me greatly about reading a lot of these other, I think, great researchers who don't in my opinion sufficiently consider the role of incentives. To couch it in Baumgartner's or in Jones' and Workman's terms, okay, let's assume that the purpose of the bureaucracy is to create the information that's necessary to solve the national problems, whatever these supposed national problems are. Why would you assume that bureaucrats would supply the right amount of information in the right ways consistently throughout time?</p> <p>And it's not clear to me that those incentive systems are ever worked out; or if you do work them out, I don't think it actually shows that bureaucrats are beholden directly to Congress. So the big terminal literature, which comes from <a href= \"https://web.stanford.edu/group/mcnollgast/cgi-bin/wordpress/mcnollgast/\" target=\"_blank\">McNollgast</a>, which is McCubbins, Noll, and Weingast, in the 80s is called Congressional dominance. They basically say that because Congress writes the rules they structure all the incentives and have all the tools at their disposal to monitor and police agencies. And I'm just deeply skeptical that that works as well as they describe.</p> <p>Petersen: Right. Your paper mentions the Administrative Procedure Act which is sort of an attempt by Congress to keep these agencies in check. Could you describe that act and what exactly it does?</p> <p>Jones: Sure. So, the Administrative Procedure Act is the main document that governs how agencies regulate. It defines the process by which regulation is made. And the chief component is that it really says before an agency issues a regulation it has to go through notice-and-comment. And what that means is when it sends out a rule it issues it in the Federal Register, which is the government's journal of record, and then it allows everybody to comment on this rule, and literally anybody will comment on these rules, and the agency is legally required to respond to all comments.</p> <p>So, the basic theory is this, it's kind of got a two-part mechanism here. On the one side, it's a sort of direct structural constraint and doesn't really affect agency decision making because all it's really saying is you have to send out all rules---if the fire alarm is triggered it acts like a fire alarm. So, if you get a whole bunch of comments it's a really easy way for Congress to tell, \"oh there's a problem with this policy\" or it's a contentious policy because all of these people commented it and it's really loud, it's like a fire alarm. But it doesn't necessarily mean that an agency, that an individual bureaucrat in that agency really feels that alarm. It's more like it'll just be triggered, make sure just do something that doesn't trigger that alarm and you should be okay.</p> <p>The other way in which it might change agency behavior is that by forcing agencies to publish rules they reveal a lot of information and in the rule itself you have to describe, say, the cost of the benefits. You have to describe whether or not it has impacts on Native American tribes, or on the Federal structure, or various other executive orders that have been issued. So, one of the main ways in fact that notice-and-comment system has changed is executive orders that define how in a very practical sense these final rules will be constructed. And so, they're all today reviewed in an office inside of the OMB---the Organization for Management and Budget---and the office is called a wire at the Office of Information and Regulatory Affairs. And so, they're responsible for reviewing all regulation and they are an Office of the president. So, some people then conclude that the President has all this power, in effect, of rulemaking in general.</p> <p>Petersen: I guess the idea of the President is that it's the executive branch and so it executes and it sort of makes sense that these agencies that are executing laws would ultimately be beholden to the President. It sort of fits. So, do you know quantitatively how many comments? Are these regulatory agencies writing regulations and getting hundreds of comments every time, or is it rare to get even one comment?</p> <p>Jones: It depends on the agency and it depends on the rules. So EPA because many of its rules will have national effects, and then there are national environmental organizations that you can say are key stakeholders in the outcome of all these rules could very easily generate hundreds of thousands of comments. And so, they'll actually have computer programs that scrape the comments and kind of try to sort them in the boxes. You have other organizations, like FRA for instance, they might have a rule that only gets 30 comments.</p> <p>Petersen: Sorry what does FRA stand for?</p> <p>Jones: Sorry, that's the Federal Railroad Administration and that's one of the two main regulators of railroads in the United States. The other regulator, the Service and Transportation Board, is primarily focused on business practices, antitrust type issues, and FRA is focused primarily on health safety and welfare of anything railroad related. So that's everything from, say, the occupational safety of railroad workers to the safety of passengers on trains. And so, the Federal Railroad Administration might only get 30 to 40 comments on a normal rule, they might even get less than that. It really depends on the rule itself.</p> <p>Petersen: And typically, this would be if a rule affects my business and I might pay attention to the new rules coming out in my industry and if one I thought was going to be detrimental to my bottom line if I work for or run a private business, then I would comment. Is that the typical thing that happens?</p> <p>Jones: Probably. I really think the diversity of interaction is so high it's really hard to characterize exactly what normal public commenting looks like. Because it could be everything from \"I'm a regulated businessman who wants this,\" there might be somebody on the other side who benefits directly because the new rule sets a standard and the standards organization writes in and says your standard isn't strict enough. It could be something like there's a proposed rule that the Federal Aviation Administration, which regulates commercial flying, or anything air related at all pretty much, and they have a rule on the use of cell phones on planes. They've got about 5,000 comments, 6,000 comments. It's quite a number. Once you get above 100 that's usually quite significant. And a lot of those could be something as simple as \"we just think phones shouldn't be on planes\" and just average citizens writing in upset at the very concept of a phone being on a plane. So, there's quite a diversity of interactions between the agency and public on that.</p> <p>Petersen: So, getting into the main topic of your paper you discuss what you call channels of influence. So, what are those and why are they important?</p> <p>Jones: Yes. The way I think about it is this. I think the chief question of the bureaucracy literature is who does this regulatory bureaucracy exist for? Does it exist for interest groups? Does it exist for Congress to ultimately provide information that Congress needs? Does it exist for the President to carry out the President's wishes and his policy? Or does it exist for the bureaucrats themselves which is the one I also like to emphasize because the literature on that one is not very common today. It was more common I think about 30 years ago but the framing of it is a little different.</p> <p>And so, my point is to say each one of these separate groups should have an effect on the outcome itself of the final rule which changes say the regulatory set. Some rules may be demanded by bureaucrats, some rules are demanded by interest groups in Congress. If I were to put it in the econ speak---because I'm writing this paper probably more for a political science literature---but if I had to put it in an econ speak my I'm kind of saying you have four different demanders for this product and so who is the regulatory agency really supplying this for? It's I think really how I'm thinking about it.</p>  <p>For the full conversation, listen to the episode.</p> <p> </p>",
  "enclosure": "",
  "itunes:duration": "58:37",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "What follows is an edited partial transcript of my conversation with Stephen M. Jones. He is an economist for the US Coast Guard. However, we are discussing his own research, so nothing in this conversation should be taken to represent the official..."
}