{
  "id": "yt:video:OPIUMpiV0IY",
  "yt:videoId": "OPIUMpiV0IY",
  "yt:channelId": "UCAL3JXZSzSm8AlZyD3nQdBA",
  "title": "Primitive Technology: Making Iron From Creek Sand",
  "link": "",
  "author": {
    "name": "Primitive Technology",
    "uri": "https://www.youtube.com/channel/UCAL3JXZSzSm8AlZyD3nQdBA"
  },
  "published": "2022-09-01T21:00:20+00:00",
  "updated": "2022-09-08T20:23:19+00:00",
  "media:group": {
    "media:title": "Primitive Technology: Making Iron From Creek Sand",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Primitive Technology: Making Iron From Sand\nSubscribe: http://bit.ly/subPT | Never miss a video! Enable ‘ALL’ Notifications!\nWatch my newest content: https://youtube.com/playlist?list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj&playnext=1&index=2\n\nFollow Primitive Technology:\nWordpress: https://primitivetechnology.wordpress.com/\nPatreon: https://patreon.com/user?u=2945881\n\nWatch More Primitive Technology:\nNewest Uploads: https://youtube.com/playlist?list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj&playnext=1&index=2\nPyrotechnology: https://youtube.com/playlist?list=PLGnWLXjIDnpBVRqu5lz5JGaQxjPs7q3CJ&playnext=1&index=2\nShelter: https://youtube.com/playlist?list=PLGnWLXjIDnpBBsdKZb-vy30o88SIxItp2&playnext=1&index=2\nWeapons: https://youtube.com/playlist?list=PLGnWLXjIDnpA-XGDrrmVgBnSXx15i2Awp&playnext=1&index=2\nPopular Videos: https://youtube.com/playlist?list=PLGnWLXjIDnpAb29Lrdki5BPjTpMon8zla&playnext=1&index=2\n\nAbout This Video:\nI made iron from ordinary sand in the creek. Sand contains a minor proportion of iron in the form of magnetite (and some hematite), the rest of the sand being other non iron minerals such as silica.  In this form it is not concentrated enough to use as an ore to produce iron metal. However, it is possible to concentrate the magnetite grains from the silica sand using gravity separation, as magnetite is heavier than silica sand. \n\nSo, I made a sluice box from a spare roof tile I made in an earlier video. The curved tile acts as a chute and grooves were carved into the concave surface perpendicular to it's length. When sand was put into the sluice and water was run over it, the heavier magnetite got trapped in the grooves and most of the lighter sand was washed away. The trapped iron sand was then tipped into a collection pot. This sand was then sluiced a second time to concentrate it further. From experiment, it was found that sluicing twice yields the best result for effort, sluicing a 3rd time does little to further concentrate the ore.\n\n A furnace was then built and the ore tested. About 500g of charcoal and 200g of iron sand were charged every 5 minutes, for 6 charges. The result was a small amount of iron in the form of some cast iron spherical prills (similar to other smelts I've done) and jagged coral like formations, also of cast iron (a form new to me). When comparing the result to my usual ore, iron bacteria, it produces about the same amount of iron but with a different shape. \n\nThe benefit of using iron sand as an ore is that it can be found in almost all geological areas that have a creek or river, though the iron will be more concentrated in some areas than others. I did this experiment in a basalt rich geological location but have heard that sand formed from granite produces even better results. In summary, Iron sand, though laborious to process is easily found in most creeks, rivers and beaches and so this technique of benefiction is worth learning. \n\nAbout Primitive Technology:\nPrimitive technology is a hobby where you build things in the wild completely from scratch using no modern tools or materials. These are the strict rules: If you want a fire, use a fire stick - An axe, pick up a stone and shape it - A hut, build one from trees, mud, rocks etc. The challenge is seeing how far you can go without utilizing modern technology. I do not live in the wild, but enjoy building shelter, tools, and more, only utilizing natural materials. To find specific videos, visit my playlist tab for building videos focused on pyrotechnology, shelter, weapons, food & agriculture, tools & machines, and weaving & fiber.\n\n#PrimitiveTechnology #iron  #sand",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}