{
  "title": "150,000 Qubits Printed on a Chip",
  "link": "https://spectrum.ieee.org/silicon-spin-qubits",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/multicolored-data-visualization.jpg?id=30125442&width=2000&height=1500&coordinates=0%2C0%2C0%2C0\"/><br/><br/><p>Quantum computers can theoretically solve problems no classical computer ever could—even given billions of years—but only if they possess many components known as qubits. Now scientists have fabricated more than 150,000 silicon-based qubits on a chip that they may be able to link together with light, to help form powerful quantum computers connected by a quantum Internet.</p><p>Classical computers switch transistors either on or off to represent data as ones or zeroes. In contrast, quantum computers use quantum bits, also known as qubits. Because of the surreal nature of quantum physics, qubits can exist in a state called superposition, in which they are essentially both 1 and 0 at the same time. This phenomenon lets each qubit perform two calculations at once. The more qubits are quantum mechanically linked, or <a data-linked-post=\"2657446195\" href=\"https://spectrum.ieee.org/what-is-quantum-entanglement\" target=\"_blank\">entangled (see our explainer)</a>, within a quantum computer, the greater its computational power can grow, in an exponential fashion.</p><p>Currently quantum computers are <a href=\"https://spectrum.ieee.org/quantum-computing\" target=\"_self\">noisy intermediate-scale quantum</a> (NISQ) platforms, meaning their qubits number up to a few hundred at most. To prove useful for practical applications, future quantum computers will likely need thousands of qubits to help compensate for <a href=\"https://spectrum.ieee.org/fault-tolerant-quantum-computing\" target=\"_self\">errors</a>.</p><p>There are many different types of qubits under development, such as <a href=\"https://spectrum.ieee.org/googles-quantum-computer-exponentially-suppress-errors\" target=\"_self\">superconducting circuits</a>, <a href=\"https://spectrum.ieee.org/lithium-air-battery-quantum-computing\" target=\"_self\">electromagnetically trapped ions</a>, and even <a href=\"https://spectrum.ieee.org/neon-qubit\" target=\"_self\">frozen neon</a>. Recently scientists have discovered that so-called spin qubits manufactured in silicon may prove especially promising for quantum computing.</p><p>“Silicon spins are some of nature’s very best natural qubits,” says study cosenior author <a href=\"https://www.sfu.ca/physics/people/faculty/s_simmons.html\" target=\"_blank\">Stephanie Simmons</a>, a quantum engineer at Simon Fraser University in Burnaby, B.C., Canada.</p><p>The “spin” in spin qubits is the angular momentum of a particle such as an electron or an atomic nucleus. Spin can point up or down in a manner analogous to a compass needle that points north or south. A spin qubit can exist in a superposition where it is oriented both ways at once.</p><p>Silicon spin qubits are among the most stable qubits created to date. In addition, this technology can theoretically rapidly scale up with the support of the decades of work spent developing the global semiconductor industry.</p><p>Until now, scientists had measured single spins only electrically in silicon. This in turn meant that the only way to entangle spins together was electromagnetically, “which must be done with qubits in very close proximity to each other,” Simmons says. “This is hard to scale from an engineering perspective.”</p><p>Now, for the first time, researchers have detected single spins optically in qubits in silicon. Such optical access to spin qubits suggests it may one day be possible to use light to “have qubits entangling with each other across a chip, or across a data center as easily as if they’re side by side,” Simmons says.</p><p>The new spin qubits are based on <a href=\"https://aip.scitation.org/doi/10.1063/5.0093822\" rel=\"noopener noreferrer\" target=\"_blank\">radiation damage centers</a>—defects within silicon created using ion implantation or irradiation with high-energy electrons. Specifically, they are <a href=\"https://journals.aps.org/prxquantum/abstract/10.1103/PRXQuantum.1.020301\" rel=\"noopener noreferrer\" target=\"_blank\">T centers</a>, each comprised of two carbon atoms, one hydrogen atom, and an unpaired electron.</p><p>Each T center features an unpaired electron spin and a hydrogen nuclear spin, each of which can serve as a qubit. The electron spin can stay coherent, or stable, for more than 2 milliseconds; the hydrogen nuclear spin can remain so for more than 1.1 seconds. “Our silicon spin qubits’ long lifetimes are already quite competitive, and we have ideas on how to push them far further,” Simmons says.</p><p>The researchers printed 150,000 spots dubbed “micropucks” on commercial industry-standard silicon-on-insulator integrated photonic wafers. Each micropuck ranged from 0.5 to 2.2 micrometers wide and held one T center on average, says study lead author <a href=\"https://www.sfu.ca/physics/people/postdocs-researchers/dhigginb.html\" target=\"_blank\">Daniel Higginbottom, </a>at Simon Fraser University.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"an array of micropucks\" class=\"rm-shortcode\" data-rm-shortcode-id=\"cd56edc0f493fcc8f363fbb54ba2bb89\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"fca14\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/an-array-of-micropucks.png?id=30125716&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Under the microscope: An array of thousands of micropucks.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Simon Fraser University</small></p><p>Under a magnetic field, the spin qubit states in each T center have slightly different energies, and each emit a different wavelength of light. This lets the scientists detect the states of each spin qubit optically in these T centers.<br/></p><p>The wavelengths these spin qubits emit lie in the near-infrared <a href=\"https://en.wikipedia.org/wiki/Fiber-optic_communication#Optical_bands\" target=\"_blank\">O-band</a>. This means these spin qubits can link with other qubits by emitting the kind of light often used in telecommunications networks, helping qubits work together inside a quantum processor and helping quantum computers partner over a quantum Internet.</p><p>In addition, “the electron and nuclear spin qubits can be operated together—the nuclear spin as a long-lived memory qubit and the electron spin as an optically coupled communication qubit, and information can be swapped between them using microwave fields,” Simmons says. “No other physical quantum system combines high-performance quantum memories, direct and strong links to telecom photons, and the commercial prospects of silicon, which is the world’s top platform for both modern microelectronics as well as integrated photonics.”</p><p>Scientists have known about T centers since the 1970s. “We do not know why we are the first to start investigating T centers as qubits in silicon,” Simmons says. “It is possible that researchers assumed that candidate spin-photon qubits in silicon were simply less likely to compete with candidates in other materials such as diamond and silicon carbide. It’s a mystery to us.”</p><p>All in all, “we are most excited about the fundamental scalability of these qubits,” Simmons says. “It’s a new entrant to the international race for a quantum computer, and we think the prospects are very bright.”</p><p>Although the researchers have fabricated many qubits in this new study, “these have not yet been wired up into a working quantum computer,” Simmons cautions. “The optical access to these spins will make this wiring a lot easier than many other approaches, but this technology is still very young and there is a lot of work to be done.”</p><p>The scientists detailed <u><a href=\"https://www.nature.com/articles/s41586-022-04821-y\" rel=\"noopener noreferrer\" target=\"_blank\">their findings</a></u> online 13 June in the journal <em>Nature</em>.</p>",
  "pubDate": "Thu, 14 Jul 2022 14:28:22 +0000",
  "guid": "https://spectrum.ieee.org/silicon-spin-qubits",
  "category": [
    "Qubit",
    "Silicon spin qubits",
    "Quantum networks",
    "Quantum internet",
    "Silicon-on-insulator",
    "Quantum computing"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}