{
  "id": "yt:video:Nd4b0_vJZUk",
  "yt:videoId": "Nd4b0_vJZUk",
  "yt:channelId": "UCP3alkHEJhoxTpy3iVON-lg",
  "title": "Before You Start On Quantum Mechanics, Learn This",
  "link": "",
  "author": {
    "name": "Physics with Elliot",
    "uri": "https://www.youtube.com/channel/UCP3alkHEJhoxTpy3iVON-lg"
  },
  "published": "2021-12-16T23:02:37+00:00",
  "updated": "2022-06-27T23:00:07+00:00",
  "media:group": {
    "media:title": "Before You Start On Quantum Mechanics, Learn This",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Quantum mechanics is mysterious---but not as mysterious as it has to be. Most quantum equations have close parallels in classical mechanics, where quantum commutators are replaced by Poisson brackets. Get the notes for free here: https://courses.physicswithelliot.com/notes-sign-up\n\nYou can't derive quantum mechanics from classical laws like F = ma, but there are close parallels between many classical and quantum equations. Many fundamental quantum equations are expressed as a commutator of operators, such as the canonical commutation relation and the Heisenberg equation of motion. These equations have classical parallels where the quantum commutator is replaced by a classical operation called the Poisson bracket, up to a factor of i hbar. I'll show how Poisson brackets work, and how they mirror these key quantum equations.\n\nGet all the links here: https://www.physicswithelliot.com/poisson-mini\n\nIntro to Lagrangian and Hamiltonian mechanics: https://youtu.be/0DHNGtsmmH8\n\nIntroduction to the principle of least action: https://youtu.be/sUk9y23FPHk\n\nNoether's theorem: https://youtu.be/O0NYaO_OnH4\n\nTutoring  inquiries: https://www.physicswithelliot.com/tutoring\n\nIf you find the content I’m creating valuable and would like to help make it possible for me to continue sharing more, please consider supporting me! You can make a recurring contribution at https://www.Patreon.com/PhysicsWithElliot, or make a one time contribution at https://www.physicswithelliot.com/support-me. Thank you so much!\n\nAbout physics mini lessons:\nIn these intermediate-level physics lessons, I'll try to give you a self-contained introduction to some fascinating physics topics. If you're just getting started on your physics journey, you might not understand every single detail in every video---that's totally fine! What I'm really hoping is that you'll be inspired to go off and keep learning more on your own.\n\nAbout me:\nI’m Dr. Elliot Schneider. I love physics, and I want to help others learn (and learn to love) physics, too. Whether you’re a beginner just starting out with your physics studies, a more advanced student, or a lifelong learner, I hope you’ll find resources here that enable you to deepen your understanding of the laws of nature. For more cool physics stuff, visit me at https://www.physicswithelliot.com.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}