{
  "id": "tag:blogger.com,1999:blog-19803222.post-6490974161258379048",
  "published": "2016-07-05T06:42:00.000-06:00",
  "updated": "2016-07-05T06:42:38.014-06:00",
  "title": "Rating the quality of reviews, after the fact",
  "content": "Groan groan groan reviewers are horrible people. Not you and me. <i>Those other reviewers over there!</i><br /><br /><b>tldr: </b>In general we actually don't think our reviews are that bad, though of course it's easy to remember the bad ones. Author perception of review quality is colored by, but not determined by, the overall accept/reject decision and/or the overall score that review gave to the paper.<i><br /></i><br /><br />NIPS did an experiment a bunch of years ago (can't dig it up any more, now it's an urban legend) where they asked reviewers at, I think, the time of author feedback, to rate the reviews. The anecdotal story was that there was almost perfect correlation between \"this is a good review\" and \"this review gave my paper a high score.\" Of course this is not super surprising, even if you get rid of \"emotions,\" because presumably I like my paper and so any review that doesn't like it is flawed.<br /><br />For NAACL 2013, we did a similar experiment, but we asked authors for their responses several months <i>after</i> the fact (actually, even after the conference had taken place), at which point hopefully emotions had cooled a bit and they could look back at their reviews with a sort of fond recollection. We presented the contact author of each paper with the original review text for each of their reviews, but did not show them the original scores. We asked them on a standard Likert scale how <i>helpful</i> this review was, and how <i>informative</i> this review was.<br /><br />Because this was long after the fact, response rate was of course not 100%, and it was also biased toward authors of papers that were accepted. We got responses from 128 authors on a total of 138 papers (some papers had same contact authors), covering a total of about 397 reviews (roughly one per paper, but some short papers only had two, and some papers had four).<br /><br />All the plots below are restricted to this set of 138 papers, not to the full set of about 500.<br /><br />First, let's get a sense of the data. Here are the overall results for this entire set of 138 papers:<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-iVslRdUhnUA/V3V_QvOYWtI/AAAAAAAAAXE/oSjLT5voEHQMd67zMGK9SOEx_pYsJykXgCLcB/s1600/reviewfeedback-summary.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"400\" src=\"https://4.bp.blogspot.com/-iVslRdUhnUA/V3V_QvOYWtI/AAAAAAAAAXE/oSjLT5voEHQMd67zMGK9SOEx_pYsJykXgCLcB/s400/reviewfeedback-summary.png\" width=\"381\" /></a></div><br />(Note that the numbers add up to 397, not 138, because this is counting per-review not per-paper.) The first row shows the accept/reject ratio. Since NAACL 2013 had an acceptance rate between 25% and 30%, obviously survey results are biased toward accepted papers, but we still have a healthy response rate from rejected papers.<br /><br />Overall, the vast majority (~80%) of reviews were considered both informative and helpful (score 4 or 5) according to the authors. So yes, we need to do something about the 20% of reviews that got a 1, 2 or 3 on the Likert scale, but we're actually not doing that horribly. (Modulo sample selection bias.) The papers themselves were considered overwhelmingly appropriate and clear. The overall score distribution matches (roughly) the overall score distribution for the entire conference.<br /><br />Let's look at what happens if we look only at accepted or rejected paper:<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-HqC4tFnb89I/V3WAMMIKzXI/AAAAAAAAAXQ/eo1Q6I_tt0g78J00QWXc7PT1rpq8CLEowCLcB/s1600/reviewfeedback-conditioned-Accepted%2BPapers.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"400\" src=\"https://1.bp.blogspot.com/-HqC4tFnb89I/V3WAMMIKzXI/AAAAAAAAAXQ/eo1Q6I_tt0g78J00QWXc7PT1rpq8CLEowCLcB/s400/reviewfeedback-conditioned-Accepted%2BPapers.png\" width=\"380\" /></a></div><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-e3Q1bsJfcxU/V3WAOK1l4KI/AAAAAAAAAXY/IKL_R8yMIMsrf8k2uBYr17h2RN6ikshCgCLcB/s1600/reviewfeedback-conditioned-Rejected%2BPapers.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"400\" src=\"https://3.bp.blogspot.com/-e3Q1bsJfcxU/V3WAOK1l4KI/AAAAAAAAAXY/IKL_R8yMIMsrf8k2uBYr17h2RN6ikshCgCLcB/s400/reviewfeedback-conditioned-Rejected%2BPapers.png\" width=\"380\" /></a></div>Comparing these, we definitely see a bit of the NIPS effect. For accepted papers, the reviews were considered overwhelmingly informative and helpful (scores of 4 or 5 in 85% or more cases). However, for rejected papers, the reviews were still considered largely informative and helpful (~73% of cases were 4s and 5s). Not surprisingly, accepted papers fare quite well on the individual score metrics, in particular overall score (duh!).<br /><br />We can alternatively condition the analysis on the overall paper score rather than the final accept/reject decision. Here's how that looks:<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-9k4Aq3UudgE/V3WA9SsJEDI/AAAAAAAAAXs/_TV4wOaSGnA5J0jkhakDBlvVNoqcIoqqQCLcB/s1600/reviewfeedback-conditioned-High%2BOverall%2BScore.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"400\" src=\"https://3.bp.blogspot.com/-9k4Aq3UudgE/V3WA9SsJEDI/AAAAAAAAAXs/_TV4wOaSGnA5J0jkhakDBlvVNoqcIoqqQCLcB/s400/reviewfeedback-conditioned-High%2BOverall%2BScore.png\" width=\"381\" /></a></div><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-My5MggdoVcU/V3WA9cLBN2I/AAAAAAAAAXk/U4agQZlcV3E1VJDJnwLyEsFRsYbBykgawCLcB/s1600/reviewfeedback-conditioned-Low%2BOverall%2BScore.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"400\" src=\"https://1.bp.blogspot.com/-My5MggdoVcU/V3WA9cLBN2I/AAAAAAAAAXk/U4agQZlcV3E1VJDJnwLyEsFRsYbBykgawCLcB/s400/reviewfeedback-conditioned-Low%2BOverall%2BScore.png\" width=\"381\" /></a></div>That's not substantially different.<br /><br />So what makes the difference between good (informativeness 4 or 5) and bad (informativeness 1 or 2) reviews?<br /><br />On average, the \"good\" reviews were about 15% longer than the bad reviews (on average 320 characters versus 280 characters).<br /><br />Somewhat surprisingly, a linear classifier on bag of words data and distinguish with 90% accuracy \"good\" from \"bad\" reviews, but the features it gives high weight to are basically features that look like positive versus negative reviews, rather essentially exploiting of the correlation between informativeness and acceptance, rather than informativeness on its own.",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "hal",
    "uri": "http://www.blogger.com/profile/02162908373916390369",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 4
}