{
  "title": "Dive into Deep Learning",
  "description": "<p>I’m happy to announce our new book project - <a href=\"http://www.diveintodeeplearning.org\">Dive into Deep Learning</a>. It’s still in beta stage, i.e. we’re still working on it, but I think that it’s good enough to share with friends and colleagues. This is joint work with <a href=\"https://www.astonzhang.com/\">Aston Zhang</a>, <a href=\"http://www.cs.cmu.edu/~muli/\">Mu Li</a>, and <a href=\"http://zacklipton.com/\">Zachary Lipton</a>. </p><p>There’s an obvious question - why yet another machine learning book? After all, there’s no shortage of great books, e.g. <a href=\"https://www.cs.ubc.ca/~murphyk/MLbook/\">Machine Learning</a> by Kevin Murphy, <a href=\"https://www.springer.com/gp/book/9780387310732\">Pattern Recognition and Machine Learning</a> by Chris Bishop, <a href=\"https://www.deeplearningbook.org/\">Deep Learning</a> by Ian Goodfellow, Yoshua Bengio and Aaron Courville, <a href=\"http://www.inference.org.uk/itprnn/book.html\">Information Theory, Inference and Learning Algorithms</a> by the late David MacKay, and many other great books. At the same time, there are ready made recipe books for various deep learning frameworks, such as <a href=\"http://shop.oreilly.com/product/0636920063698.do\">Learning Tensorflow</a> by Itay Lieder, Yehezkel Resheff, and Tom Hope. However, none of the books so far attempted to bridge this gap between theory and practice. This is what the current book project aims to address. In particular, it combines the following features:</p><ul><li>Downloadable <a href=\"http://en.diveintodeeplearning.org/d2l-en.zip\">Jupyter notebooks</a> (in fact, the entire book consists of notebooks)<br/></li><li>A freely available <a href=\"https://en.diveintodeeplearning.org/d2l-en.pdf\">PDF</a> version</li><li>A <a href=\"https://github.com/diveintodeeplearning/d2l-en\">GitHub repository</a> to allow for fast corrections of errata</li><li>A tight integration with <a href=\"https://discuss.mxnet.io/\">discussion forums</a> to allow for questions regarding the math and code on the site</li><li>Theoretical background suitable for engineers and undergraduate researchers</li><li>State of the art models (including ResNet, faster-RCNN, etc)</li><li>Well documented and structured code that is executed on real datasets, yet at the same time small enough to fit on a laptop. </li><li>A Chinese translation (in fact, the Chinese book will be released first)</li></ul><p>In addition to that, Mu and I will be teaching a class at UC Berkeley in Spring. As part of that, we will be releasing slides, videos and assignments, suitable for reuse for anyone who’d like to do so. In short, we aim to offer a complete resource to learn deep learning, easily and a comprehensive manner. Please let us know what you think.</p>",
  "link": "https://blog.smola.org/post/180838682891",
  "guid": "https://blog.smola.org/post/180838682891",
  "pubDate": "Wed, 05 Dec 2018 13:52:42 -0800"
}