{
  "title": "India Gambles On Building a Leading Drone Industry",
  "link": "https://tech.slashdot.org/story/22/11/04/2142253/india-gambles-on-building-a-leading-drone-industry?utm_source=rss1.0mainlinkanon&utm_medium=feed",
  "description": "The Indian government wants to develop a home-grown industry that can design and assemble drones and make the components that go into their manufacture. The BBC reports: \"Drones can be significant creators of employment and economic growth due to their versatility, and ease of use, especially in India's remote areas,\" says Amber Dubey, former joint secretary at the Ministry of Civil Aviation. \"Given its traditional strengths in innovation, information technology, frugal engineering and its huge domestic demand, India has the potential of becoming a global drone hub by 2030,\" he tells the BBC. Over the next three years Mr Dubey sees as much as 50 billion rupees $630 million invested in the sector.\n \n[...] However, despite the excitement and investment around India's drone industry, even those in the sector advise caution. \"India has set a goal of being a hub of drones by 2030, but I think we should be cautious because we at present don't not have an ecosystem and technology initiatives in place,\" says Rajiv Kumar Narang, from the Drone Federation of India. He says the industry needs a robust regulator that can oversee safety and help develop an air traffic control system for drones. That will be particularly important as the aircraft become larger, says Mr Narang. \"Initiatives have to come from the government. A single entity or a nodal ministry has to take this forward if we want to reach a goal of being the hub by 2030,\" he says.\n \nIndia also lacks the network of firms needed to make all the components that go into making a drone. At the moment many parts, including batteries, motors and flight controllers are imported. But the government is confident an incentive scheme will help boost domestic firms. \"The components industry will take two to three years to build, since it traditionally works on low margin and high volumes,\" says Mr Dubey. Despite those reservations, firms are confident there will be demand for drones and people to fly them. Chirag Shara is the chief executive of Drone Destination, which has trained more than 800 pilots and instructors since the rules on drone use were first relaxed in August 2021. He estimates that India will need up to 500,000 certified pilots over the next five years.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=India+Gambles+On+Building+a+Leading+Drone+Industry%3A+https%3A%2F%2Fbit.ly%2F3U3gB5Q\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F22%2F11%2F04%2F2142253%2Findia-gambles-on-building-a-leading-drone-industry%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://tech.slashdot.org/story/22/11/04/2142253/india-gambles-on-building-a-leading-drone-industry?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=22334471&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>",
  "dc:creator": "BeauHD",
  "dc:date": "2022-11-05T00:02:00+00:00",
  "dc:subject": "technology",
  "slash:department": "cash-cow",
  "slash:section": "technology",
  "slash:comments": 12,
  "slash:hit_parade": "12,12,9,9,4,3,1"
}