{
  "title": "EPISODE 85: The Siege That Changed All of History",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Mon, 17 Jan 2022 21:43:51 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2022/1/17/episode-85-the-siege-that-changed-all-of-history",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:61e5e2906711cc43484285d7",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/dc36357b-bcd4-4e4b-b33d-b82c7958e023/HOF-85.jpg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"61e5e2fee327b82e155e385b\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/dc36357b-bcd4-4e4b-b33d-b82c7958e023/HOF-85.jpg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“I cut off their heads. I burned them with fire. With their blood I dyed the mountain red like red wool. Men I impaled on stakes. The city I destroyed, devastated… the young men and maidens I burned in the fire.” — </em>Ashurnairpal II </p><p class=\"\"><em>“I filled the wide plain with the corpses of his warriors…. These [rebels] I impaled on stakes. …A pyramid of heads I erected in front of the city.”</em> — Salmaneser III</p><p class=\"\"><em>“Don’t let Hezekiah mislead you by saying, ‘The&nbsp;Lord&nbsp;will rescue us!’ Have the gods of any other nations ever saved their people from the king of Assyria?&nbsp;19&nbsp;What happened to the gods of Hamath and Arpad? And what about the gods of Sepharvaim? Did any god rescue Samaria from my power?&nbsp;20&nbsp;What god of any nation has ever been able to save its people from my power? So what makes you think that the&nbsp;Lord&nbsp;can rescue Jerusalem from me?” —</em> Isaiah 36:18-20</p><p class=\"\">History is a fickle beast. Some events may not seem like much at the time when they happen, but they end up radically shaping all events afterwards. For example, had just one event turned out different—an event largely forgotten today, such as the siege of Jerusalem in 701 BCE—and all of history would have changed. If the siege had ended in the way everyone expected it to end, Judaism would have disappeared from the pages of history, and Christianity and Islam would have never been born. Can you imagine how different the world would be if you were to remove the entire history of the three main monotheistic religions? </p><p class=\"\"> In this episode we’ll tackle this greatest of ‘what ifs.’ In the process of doing so, we’ll discuss the origins of Western monotheism, Assyrian culture, Hebrew legends, the Assyrian protection racket, the clash between monotheistic Hebrews and polytheistic Hebrews, how the Assyrians turned 10 of the tribes of Israel into the “lost tribes”, committing ‘suicide by Assyrian’, the destruction of Lachish, what may have happened in Jerusalem in 701 BCE, and much more.</p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "02:29:03",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 85,
  "itunes:title": "EPISODE 85: The Siege That Changed All of History",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 85: The Siege That Changed All of History"
  }
}