{
  "id": "yt:video:0NHu2_BOGW0",
  "yt:videoId": "0NHu2_BOGW0",
  "yt:channelId": "UCddem5RlB3bQe99wyY49g0g",
  "title": "“ BADEN-POWELL CHIEF SCOUT OF THE WORLD ” 1957 BOY SCOUTS ASSOCIATION DOCUMENTARY FILM   XD51864",
  "link": "",
  "author": {
    "name": "PeriscopeFilm",
    "uri": "https://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g"
  },
  "published": "2022-11-02T19:29:46+00:00",
  "updated": "2022-11-02T19:29:47+00:00",
  "media:group": {
    "media:title": "“ BADEN-POWELL CHIEF SCOUT OF THE WORLD ” 1957 BOY SCOUTS ASSOCIATION DOCUMENTARY FILM   XD51864",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Join this channel to get access to perks:\nhttps://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g/join\n\nWant to learn more about Periscope Film and get access to exclusive swag? Join us on Patreon. Visit https://www.patreon.com/PeriscopeFilm\nVisit our website www.PeriscopeFilm.com\n\nThis British documentary entitled “Baden-Powell Chief Scout of The World” was made in 1957 by The Boy Scouts Association. It is about the life and history of Baden Powell, the founder of The Boy Scouts. The film details his history working as a scout for the British Army and his undercover missions to disrupt rebellions in British colonies in India and Africa. The film illustrates the evolution of the Boy Scouts from a military movement to a force of unity and good will.  (Note: the USA version of The Boy Scouts Association is the Boy Scouts of America or BSA.) \n\nFilm opens with hundreds of boys running through a field and introduces the founder, Baden Powell (1:54). Narration accompanies illustrations and photographs by and of Powell. Describes his childhood in England and his love of hunting and nature, accompanied by Powell’s sketches. Powell pictured as a teenager joined the army at age 19 and was sent to the regiment in India in 1876. Sketch of him on a horse shows his first scout mission to Natal, India in 1884 (3:35). Sketch of Powell undercover as a butterfly hunter (4:56). Map shows the gold coast of West Africa where Powell was sent in 1895 to command African scouts and pioneers (5:17). Sketches show ceremonies performing human sacrifices by the Ashanti tribe (5:30).  Was coined “he of the big hat” by the Africans. Picture of him in said hat which became part of the boy scout uniform (6:16). Map shows Matabeleland, a region in Zimbabwe, Where Powell was sent to repress the growing rebellion (6:28). Picture of him blowing a Kudu horn, which was incorporated as a tradition of the boy scouts (7:07). Map shows Meerut, India where Powell was sent after being promoted to Colonel (07:22). Sketches show soldiers he trained with scout skills in order to be more independent, and their badges. He then wrote a book called “Aids to Scouting for N. -C.Os. and Men” (8:15). Sketches show Mafeking in South Africa (8:50). More sketches show technology and tactics developed by Powell to bluff the regiment’s power and size (9:19) Sketches show the cadette core of boys who were trained to fill in for soldiers sent to the front line (11:31). Sketch of Sir William Smith, founder of the boy’s brigade (13:02). Pictures of boys from all over England participating in the first Boy Scout Camp in Brownsea Island in 1907 (13:33). Powell’s first appearance on motion picture film in 1911 inspecting boy scout rallies all over the country (15:28). Photo shows King George V, a boy scout enthusiast (16:40). Picture of Powell with his new wife, Olave St Clair Baden-Powell and their new car. Sketches show Powell and the boy scouts aiding in the efforts during WWI (17:39). Photos of the first permanent boy scout camp with Duke of Connaught, president of the boy scouts for 30 years (18:19). Photos of the first jamboree in Olympia London. King George inspects the scouts. Clips of the second jamboree in Denmark. The King of Denmark inspects the boys. More footage of Scout Jamborees all over the world. Pictures show a reunion of the Powell with the first campers from Brownsea Island (20:06). The Prince of Wales gives a speech during a jamboree (20:44). Footage of Powell giving speeches and traveling all over the world. Powell speaks from Sydney, Australia of the evolution of the boy scouts from a military movement to a movement of peace and good will among men intended to unite the world (25:15). Powell gives a speech in 1932 at a Jamboree in England (26:17). Footage of the Jamboree in Hungry. 77 year old Powell goes on another world tour. Footage shows Stockholm in 1935. Film from Powell’s daughter Betty’s wedding in 1936. Powell returns to India in 1937 for the countries first jamboree (29:47). The royal family speaks with Powell in front of Windsor Castle. Speech plays over photos from Powell address to the boy scouts encouraging them to be their best in celebration of his 80th birthday. Powell strolls the ship he took to Kenya where he retired in 1938. Pictures taken by Powell show game hunting tree houses. Powell dies in 1941 in Kenya, footage of his grand funeral possession (33:55). \n\nThis film is part of the Periscope Film LLC archive, one of the largest historic military, transportation, and aviation stock footage collections in the USA. Entirely film backed, this material is available for licensing in 24p HD, 2k and 4k. For more information visit http://www.PeriscopeFilm.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}