{
  "title": "EPISODE 40 Joan of Arc (Part 2)",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Tue, 16 Oct 2018 13:00:00 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2018/10/16/episode-40-joan-of-arc-part-2",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5bc3a7059140b74027b71ecb",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1539549029960-HR2HXCLQ3EO8LXVYCYOA/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"5bc3a7610d9297cb3899b965\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1539549029960-HR2HXCLQ3EO8LXVYCYOA/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“Help me, Obi-Wan Kenobi. You’re my only hope.”</em> — Star Wars&nbsp;</p><p class=\"\"><em>“… No one else, neither a king nor a duke nor the daughter of the king of Scotland, nor any other who can recover the kingdom of France, and he will have no help, if not through me…” —</em> Joan of Arc</p><p class=\"\"><em>“You know as little of war as that Hobbit. When the fear takes him, and the blood, and the screams, and the horrors of battle take hold, do you think he would stand and fight? He would flee. And it would be right to do so. War is the province of Men, Éowyn.” —</em> Eomer in The Lord of the Rings</p><p class=\"\"><em>“I do not permit a woman to teach or to assume authority over a man; she is to keep silent.”</em> — St Paul</p><p class=\"\"><em>“King of England, do justly by the King of Heaven. Return to the Maid sent by God to restore the royal blood the keys of all the good cities that you have taken and violated in France… King of England, if you do not do this, I am Chef de Guerre [Commander of War], and in whatever place I shall find your people in France, I will make them flee whether they want to or not; and if they will not obey I will have them all killed. I am sent here by God, the King of Heaven, to drive you, body for body, out of all France. If you don’t leave, we will make so great a war cry that none like it has been heard in France in a thousand years.”</em> — Joan of Arc</p><p class=\"\"><em>“You, Duke of Bedford, the Maid begs you not to make her destroy you.” —</em> Joan of Arc&nbsp;</p><p class=\"\">By 1429, the heir to the French throne was about to give up and flee in exile. The English and their Burgundian allies controlled huge parts of the country. With Orleans likely to fall in a not too distant future, the path was open for the English to conquer the rest of France. It looked like the game was up for him. As much as he tried, he couldn’t see any logical path to victory. But little did he know that help was on its way—a kind of help that didn’t seem to be logical, reasonable or likely. Help was coming in the form of an illiterate teenage peasant—a female at that—who was going to change his fortunes; a young woman who through sheer willpower would radically change the course of the war. She arrived at the royal court during France’s darkest hour with news that God had sent her to lift the siege of Orleans, and make sure the heir to the throne would be crowned King of France.</p><p class=\"\">The young woman was Joan of Arc, and she was one of the most unusual individuals in history.&nbsp;</p><p class=\"\">At 13 years old, her life was turned upside down when she began hearing voices and having visions of angelic figures delivering her messages. The voices told her that no one on earth—neither knight nor king—could restore the kingdom of France. No one could—no one that is… except for her.&nbsp;</p><p class=\"\">Ok, so we have a possibly insane girl hearing voices, This is hardly the stuff that makes the history books. At best, this would be an interesting case study for the history of mental illness. But that’s not what happened here—because the girl and her voices did change the course of the Hundred Years War between France and England. The voices propelled this young woman away from the typical existence of farm girls in the 1400s, and transformed her into a force of nature who embraced a heroic and tragic destiny that was entirely beyond what anyone from her gender, social class, and age could legitimately expect.&nbsp;</p><p class=\"\">According to logic and common sense, none of the things that happened in our story should have been able to happen. A untrained peasant leading an army of knights? A young woman succeeding where the entire French nobility had failed? What she accomplished would have been exceptional if done by an aristocratic, seasoned male leader. But it seems downright impossible for someone like her. The world she lived in was hyper patriarchal and very class conscious, so on the surface there should have been no chance whatsoever that a young peasant girl could pull it off. She belonged to the wrong gender, wrong social class, and wrong age to achieve what she dreamed of. And yet she did.&nbsp;</p><p class=\"\">In this second episode of this four-part series, we see guest appearances by Luke Skywalker from <em>Star Wars</em>, Miracle Max from <em>The Princess </em>Bride, Tyrion Lannister from <em>Game of Thrones</em>, Eomer from <em>The Lord of the Rings</em>. Among the key topics, Joan and her voices; Joan’s father planning on drowning his daughter and winning the Taliban father of the year award; Joan’s meeting with the Dauphin; Taoism and victory in battle; the letter to the King of England; the disturbing tale of Gilles de Rais; Joan takes an arrow to the chest, and gets back into battle; the miracle at Orleans.&nbsp;<br></p><p class=\"\">This episode of History on Fire is brought to you by ForHims.com—a one-stop shop for hair loss, skincare, and sexual wellness for men. Try hims for a month today for just $5 while supplies last. See website for full details. Go to <a href=\"https://www.forhims.com/history5\">https://www.forhims.com/history5</a>&nbsp;</p><p class=\"\">This episode is sponsored by <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a> For less than $ 10 per meal, Blue Apron delivers straight to your door seasonal recipes along with pre-portioned ingredients to make delicious, home-cooked meals. Get $ 30 off your first order—with free shipping—by going to <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a>&nbsp;</p><p class=\"\">This episode is also brought to you by <a href=\"https://www.greats.com/\">https://www.greats.com/</a> GREATS is a wonderful sneaker company offering men's and women's styles. Save 15% on your first purchase with our code, HISTORY.&nbsp;</p><p class=\"\">Please, also show some love to my regular sponsors by shopping for supplements, special foods, clothing, and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;</p><p class=\"\">And if you are in the market for backpacks, computer bags and other hemp gear, check out my favorites at <a href=\"http://www.dsgear.com\">http://www.dsgear.com</a>&nbsp;</p><p class=\"\">Big thank you to the “Context” Podcast by Brad Harris: <a href=\"https://itunes.apple.com/us/podcast/context-with-brad-harris/id1395459106\">https://itunes.apple.com/us/podcast/context-with-brad-harris/id1395459106</a>&nbsp;</p><p class=\"\">And to “The Strenuous Life” Podcast by Stephan Kesting <a href=\"https://itunes.apple.com/us/podcast/strenuous-life-podcast-stephan-kesting-grapplearts/id320705565\">https://itunes.apple.com/us/podcast/strenuous-life-podcast-stephan-kesting-grapplearts/id320705565</a>&nbsp;</p><p class=\"\">And thank you also to <a href=\"https://www.snowroast.com/\">https://www.snowroast.com/</a> for their delicious coffee. Use the code TAO18 for a 15 % discount.&nbsp;</p><p class=\"\">History on Fire is brought to you by Kannaway. All CBD products are from organic, non-GMO European HEMP grown on generational family farms. The products all have a triple authenticated process guaranteeing you’re getting exactly what you are paying for. Because all of the CBD is from hemp and NOT cannabis, it is legal to use and possess in all 50 states AND Europe! Now you can get 100% THC-free CBD oil from hemp, delivered to your door in all 50 of the Unites States and the whole of Europe. Please check them out at: <a href=\"https://kannaway.com/2496006\">https://kannaway.com/2496006</a>&nbsp;</p><p class=\"\">A huge thank you to <a href=\"https://www.dynastyforge.com/\">https://www.dynastyforge.com/</a> for sharing with me their amazing swords.&nbsp;</p><p class=\"\">If you train in Jiujitsu (or any other sport for that matter), check out the knee braces at <a href=\"https://nevertapgear.com/\">https://nevertapgear.com/</a> and check out the TOMOE GOZEN RASH GUARD! <a href=\"https://nevertapgear.com/new-products/tomeo\">https://nevertapgear.com/new-products/tomeo</a>&nbsp;</p><p class=\"\"><br>PATREON NEWS: I have just started a Patreon account!!!! If you feel in a generous mood, please, check it out at <a href=\"http://www.patreon.com/historyonfire\">www.patreon.com/historyonfire</a>&nbsp;</p><p class=\"\">And Donations in crypto-currencies can be made to:&nbsp;</p><p class=\"\">Btc: 1Fdzfr1aPMFdwBY5GXe71nLo11HSMxEfRw</p><p class=\"\">Eth: 0x0deedc896c8e23c3a9daf39e4a9fadada656e924&nbsp;</p><p class=\"\">Ltc: LMW7m54iovT1GK6yZxYXUVPT52pXD9CmjN&nbsp;</p><p class=\"\">Zec: t1NgHHkaEqFM9XzdAZf5u16MRmmz6ruHyTD&nbsp;</p><p class=\"\">Slt: 0x0deedc896c8e23c3a9daf39e4a9fadada656e924</p><p class=\"\">My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>. Thank you to Onnit, Datsusara, Float Clinic, Shaman’s Simple Solutions, War Fuel, Proven Nutrition, and Fight Chix for sponsoring her for her first MMA fight. If you’d like to check out Fight Chix merchandise, you can get a 20% discount by going to <a href=\"http://www.fightchix.com/\">http://www.fightchix.com/</a> and entering the code Fire20 upon checkout.</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "2:06:22",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 40,
  "itunes:title": "EPISODE 40 Joan of Arc (Part 2)",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 40 Joan of Arc (Part 2)"
  }
}