{
  "title": "Pacific nations want compensation commitment from UN climate talks, Samoa says",
  "description": "The islands are among the most vulnerable to rising sea levels and extreme weather.",
  "link": "https://www.rfa.org/english/news/pacific/climate-11042022134111.html",
  "guid": "https://www.rfa.org/english/news/pacific/climate-11042022134111.html",
  "author": "By Joyetter Feagaimaalii for BenarNews",
  "media:content": {
    "media:description": "The South Pacific Ocean pounds the coastline of Funafuti Atoll, Tuvalu, 19 February 2004. Pacific Island nations are among the most vulnerable to higher sea levels.",
    "media:credit": "AFP"
  },
  "content:encoded": "\n        <p><span>Samoa’s environment minister says Pacific island nations want the international climate talks in Egypt this month to establish a basis for compensating developing countries for losses caused by climate change.</span></p>\n<p><span>Pacific island nations account for only a tiny fraction of the pollution that drives global warming, but are among the most vulnerable to rising sea levels and extreme weather linked to higher average global temperatures. The risks over coming decades are particularly severe for low-lying atoll nations such as Kiribati and Tuvalu.</span></p>\n<p><span>“We have to stand together as a Pacific family, if this situation is not remedied, the Pacific islands will face loss and damage issues,” Samoa’s Minister of Natural Resources and Environment, Toesulusulu Cedric Schuster, told BenarNews, an RFA-affiliated online news service.</span></p>\n<p><span></span></p>\n<figure><img alt=\"\" class=\"image-richtext image-inline\" src=\"https://www.benarnews.org/english/news/pacific/schuster.jpg/@@images/2f168af4-4a5c-42a8-be1e-726a3a8a1c20.jpeg\"/>\n<figcaption>Samoa’s Minister of Natural Resources and Environment, Toeolesulusulu Cedric Schuster, speaks at the Sydney Energy Forum in Sydney, Australia, July 13, 2022. Credit: Reuters</figcaption>\n</figure>\n<p><br/><span>Developing nations have for decades called for financial help to address loss and damage, a term in the U.N climate negotiations that covers the consequences of planet warming that go beyond what countries can adapt to, according to the World Resources Institute, a research organization. It includes economic losses and human trauma such as flooding of burial grounds and community relocation or migration. </span></p>\n<p><span>A few developed countries including Germany and New Zealand have signaled some support for such finance, but the United States, which is behind only China as a polluter, has not.</span></p>\n<p><span>The 27th annual U.N climate talks start on Sunday in Sharm El-Sheikh, Egypt. The annual talks between nearly 200 nations are widely known as COP, short for Conference of the Parties. It has the overarching goal of limiting the increase in the average global temperature to 1.5 degrees Celsius, though activists and scientists say emissions reductions have not been far-reaching enough to achieve that.</span></p>\n<p><span>Egypt has said that COP27 will be about moving from negotiation to implementation</span></p>\n<p><span>\"One of the core issues that will be addressed at the COP is loss and damage which has been a long-standing concern for Samoa let alone the Pacific,” said Schuster. “It remains one of Samoa’s priorities and it's evident in the delegation numbers that will be attending the COP this year,” he said.</span></p>\n<p><span>The United States and China are both vying for influence in the Pacific and their stances at the climate talks will give an indication of the authenticity of their commitment to the region, activists say. The United States has vowed a renewed focus on the Pacific in response to China’s greater involvement in the region over the past two decades through development aid and infrastructure projects. </span></p>\n<p><span>“Climate change is the single biggest security threat, the threat being our livelihoods, our wellbeing,” said Lavetanalagi Seru, regional policy officer for the Pacific Islands Climate Action Network, a non-governmental organization (NGO).</span></p>\n<p><span>“If they are to work with the Pacific then they really need to consider what the Pacific island countries and leaders deem as a priority,” he said.</span></p>\n<p><span>Samoa’s Prime Minister Fiame Naomi Mata'afa told the United Nations General Assembly in September that action from the climate talks is a matter of survival for Pacific island nations and other small island states.</span></p>\n<p><span>\"We should not put out the flame for loss and damage,” she said. “Natural disasters continue to devastate countless lives. Recent climate events are transboundary and drive home the reality that no country is immune to the impacts of climate change.”</span></p>\n<p><span>Separately, Pacific island countries have created the Pacific Resilience Fund, which they hope will attract up to U.S. $1.5 billion for coping with climate change.</span></p>\n<p><span>Tonga’s Prime Minister Siaosi Sovaleni said in September wealthy countries should contribute to the fund rather than only impose their own climate projects.</span></p>\n<p><span>The Pacific is competing with other developing nations for assistance and so far has got less than 1.0% of the money allocated by wealthy nations for climate projects, according to Seru.</span></p>\n<p><span>“The hope is that these funds will directly go to supporting grassroots communities and NGOs,” he said.</span></p>\n<p><em><strong>BenarNews is an RFA-affiliated news service.</strong></em></p>\n        ",
  "pubDate": "Fri, 04 Nov 2022 13:43:59 -0400"
}