{
  "title": "Stephen Vaughan appointed Chief Executive Officer at Yorkshire County Cricket Club",
  "link": "https://www.asianexpress.co.uk/2022/11/stephen-vaughan-appointed-chief-executive-officer-at-yorkshire-county-cricket-club/",
  "comments": "https://www.asianexpress.co.uk/2022/11/stephen-vaughan-appointed-chief-executive-officer-at-yorkshire-county-cricket-club/#respond",
  "dc:creator": "Andleeb Hanif",
  "pubDate": "Wed, 02 Nov 2022 12:56:12 +0000",
  "category": [
    "Sport",
    "new ceo for yorkshire county cricket club",
    "racis",
    "racism in cricket",
    "Stephen Vaughan",
    "yccc"
  ],
  "guid": "https://www.asianexpress.co.uk/?p=45734",
  "description": "<p>Club also confirms permanent appointment of Darren Gough as Managing Director of Cricket The Yorkshire County Cricket Club has announced the appointment of Stephen Vaughan as Chief Executive Officer. He will officially begin the role on 7th November 2022. Stephen joins the Club following three years at Wasps Group, which he joined as CEO of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.asianexpress.co.uk/2022/11/stephen-vaughan-appointed-chief-executive-officer-at-yorkshire-county-cricket-club/\">Stephen Vaughan appointed Chief Executive Officer at Yorkshire County Cricket Club</a> appeared first on <a rel=\"nofollow\" href=\"https://www.asianexpress.co.uk\">Asian Express Newspaper</a>.</p>\n",
  "content:encoded": "\n<p class=\"has-text-align-center has-white-color has-black-background-color has-text-color has-background\"><strong>Club also confirms permanent appointment of Darren Gough as Managing Director of Cricket</strong></p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"664\" height=\"1024\" src=\"https://www.asianexpress.co.uk/wp-content/uploads/2022/11/Stephen-Vaughan_22-664x1024.jpg\" alt=\"\" class=\"wp-image-45736\" srcset=\"https://www.asianexpress.co.uk/wp-content/uploads/2022/11/Stephen-Vaughan_22-664x1024.jpg 664w, https://www.asianexpress.co.uk/wp-content/uploads/2022/11/Stephen-Vaughan_22-195x300.jpg 195w, https://www.asianexpress.co.uk/wp-content/uploads/2022/11/Stephen-Vaughan_22-768x1185.jpg 768w, https://www.asianexpress.co.uk/wp-content/uploads/2022/11/Stephen-Vaughan_22-696x1074.jpg 696w, https://www.asianexpress.co.uk/wp-content/uploads/2022/11/Stephen-Vaughan_22-272x420.jpg 272w, https://www.asianexpress.co.uk/wp-content/uploads/2022/11/Stephen-Vaughan_22.jpg 778w\" sizes=\"(max-width: 664px) 100vw, 664px\" /></figure>\n\n\n\n<p>The Yorkshire County Cricket Club has announced the appointment of Stephen Vaughan as Chief Executive Officer. He will officially begin the role on 7th November 2022.</p>\n\n\n\n<p>Stephen joins the Club following three years at Wasps Group, which he joined as CEO of sports businesses in August 2019.</p>\n\n\n\n<p>He became Group Chief Executive in 2020, with additional responsibility for venues, overseeing the securing of stadium naming rights and the return of Coventry City Football Club to the city. During his time there, Stephen was responsible for the rollout of a comprehensive Equality, Diversity & Inclusion (ED&I) strategy, placing this at the heart of the group’s mission and values.</p>\n\n\n\n<p>Stephen brings decades of experience in professional sport, having represented Walsall FC as a player, prior to roles as Managing Director of Thomas Cook London 2012 where he led the company’s involvement with the 2012 Olympic Games and Paralympic Games in London, and seven successful years at Gloucester Rugby.</p>\n\n\n\n<p>At Gloucester, he directed the transformation of the Club both on and off the pitch, securing not only impressive revenue growth but also key improvements to the fan experience, as well as establishing a strong set of values for all staff across the organisation. Stephen sat on the Premiership Rugby Board, as well as the finance, audit and nominations committee.</p>\n\n\n\n<p>Stephen Vaughan, incoming CEO of Yorkshire County Cricket Club, said: “Yorkshire County Cricket Club is one of the most iconic sporting institutions in the world and it’s truly an honour to take up this position. Without shying away from the significant challenges we have faced over the past year, there are many reasons to be optimistic about the future, both on and off the pitch.</p>\n\n\n\n<p>“I had a number of offers, but the opportunity to lead this club back to the forefront of English Cricket and realise our full potential was very attractive.</p>\n\n\n\n<p>“The Club is hugely important in the region with a massive fan base of loyal members who want to see us get back to where we should be.</p>\n\n\n\n<p>“Working alongside the newly installed Board I am determined to deliver sporting success at Headingley and produce exceptional results, underpinned by robust commercial foundations and our vision to make Yorkshire Cricket a place for everyone.</p>\n\n\n\n<p>“I am looking forward to meeting Members over the coming weeks and leading this Club forward. I can’t wait to get started.”</p>\n\n\n\n<p>Lord Kamlesh Patel, Chair of Yorkshire County Cricket Club, said: “We’re delighted to welcome Stephen to the Club as the outstanding candidate in a highly talented field. With years of knowledge and experience working across various disciplines within sport he will bring a huge amount of expertise to Yorkshire County Cricket Club. His proven track record and business acumen will be vital to our future success.</p>\n\n\n\n<p>“Stephen’s openness in dealing with challenging conditions at Wasps in the wake of Covid demonstrates the strength of character that will be vital to the ongoing transformation of the Club. I look forward to working with him as we continue on our rebuilding journey”.</p>\n\n\n\n<p>Alongside Stephen’s appointment, the Club can also confirm that Darren Gough has been permanently appointed as Managing Director of Yorkshire Cricket. He has worked the same role on an interim basis since late 2021 and will continue working with the coaching and medical staff, overseeing on-field performance.</p>\n\n\n\n<p>Darren Gough, Managing Director of Cricket, Yorkshire County Cricket Club: “I have a long-established connection to the Club and am very happy to be part of our future by signing a permanent contract. We were all disappointed with the conclusion of the men’s XI season but we are determined to get back to the top as soon as possible and regain our Division One status.</p>\n\n\n\n<p>“There is much to be optimistic about, not least the exceptional young talent coming through, and I am excited about the signings we have made to improve the team. The hard work starts through the winter, and I am looking forward to working together with Ottis and the coaching team in the years ahead to bring success on the cricket field back to Yorkshire.”</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.asianexpress.co.uk/2022/11/stephen-vaughan-appointed-chief-executive-officer-at-yorkshire-county-cricket-club/\">Stephen Vaughan appointed Chief Executive Officer at Yorkshire County Cricket Club</a> appeared first on <a rel=\"nofollow\" href=\"https://www.asianexpress.co.uk\">Asian Express Newspaper</a>.</p>\n",
  "wfw:commentRss": "https://www.asianexpress.co.uk/2022/11/stephen-vaughan-appointed-chief-executive-officer-at-yorkshire-county-cricket-club/feed/",
  "slash:comments": 0
}