{
  "title": "7 takeaways from our Black and Latinx Publishers Summit",
  "link": "https://blog.google/products/admanager/7-takeaways-our-black-and-latinx-publishers-summit/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>This month, Google virtually hosted more than 200 publishers at the 2021 Black and Latinx Publishers Summit to discuss how they can grow their businesses using digital advertising. The event featured talks with industry leaders like <a href=\"https://localmedia.org/\">Local Media Association</a> and <a href=\"https://cafemedia.com/\">CafeMedia</a> on empowering diverse creators, innovating out of a crisis, using analytics to curate content and earning money from sites.</p><p>With ad spend <a href=\"https://www.emarketer.com/content/insider-intelligence-digital-advertising-trends-watch-2022\">predicted</a> to keep rising in 2022, we’re sharing the top seven takeaways from the event to help publishers make the most of this growth.</p><ol><li><b>Increase your reach through collaborations<br/></b> <a href=\"https://defendernetwork.com/news/local-state/defender-ceo-sonny-messiah-jiles-featured-in-google-news-initiative-ad/\">Sonny Messiah Jiles</a> and <a href=\"https://sacobserver.com/from-the-publisher/\">Larry Lee</a> from <a href=\"https://localmedia.org/\">Local Media Association's</a> <a href=\"https://wordinblack.com/\">Word In Black</a>, a newsroom collaboration of leading Black publishers in the U.S., shared what it means to be in the audience business — not the news business. Reflecting on the Black Lives Matter movement, Sonny and Larry noted that the Black press plays a critical role in elevating voices and servicing communities. Collaborations like Word In Black, among others, have proven valuable to publishers looking to grow and serve a niche audience.</li><li><b>Think of your platform as a business<br/></b> Showing up and being authentic to yourself, and to your audience, is important. <a href=\"https://matermea.com/about/\">Tomi Akitunde</a>, <a href=\"https://mydominicankitchen.com/about/\">Vanessa Mota</a> and <a href=\"https://sweetpotatosoul.com/about-jenne/\">Jenné Claiborne</a> from <a href=\"https://www.remarkable-voices.com/\">CafeMedia’s Remarkable Voices</a> — an eight-week training and mentorship program — spoke about the challenges of feeling confident enough to turn their hobbies into sustainable businesses. For these creators, keeping a list of wins and removing the “perfection” barrier helped keep them grounded and focused.</li><li><b>Treat your website like your digital piece of real estate<br/></b> Grow with Google Digital Coach <a href=\"https://events.withgoogle.com/digital-coach-nyc/\">Sandra Garcia</a> shared that, as a small publisher, you are in “the business of you.” She noted that small publishers and business owners can grow their careers by mastering their brands and online presence — including making sure your brand is consistent and up to date across any platforms you’re publishing content on.</li><li><b>Take advantage of productivity tools<br/></b> According to <a href=\"https://www.thetilt.com/wp-content/uploads/2021/07/TheTilt_Content_Entrepreneur_Research_final.pdf\">The Tilt</a>, content creators spend 30% of their time creating content weekly. The remainder is spent on managing their personal brand, building relationships, selling, marketing and emailing. Using productivity tools like Drive, Gmail and Google Meet to manage emails, calls and documents can help you spend more time on what really matters — creating content.</li><li><b>Start measuring for better marketing<br/></b>Getting to know your audience is essential. Eden Hagos from <a href=\"https://www.blackfoodie.co/\">BLACK FOODIE</a> shared how she analyzes her content’s performance to understand what’s resonating with her audience, what channels are driving traffic and where she should invest more time. Tools like <a href=\"https://analytics.google.com/analytics/web/provision/#/provision\">Google Analytics</a> can give you insights about your audience and website to help you make strategic business decisions.</li><li><b>Use emerging platforms to generate leads and test content<br/></b> Emerging technologies, formats and social networks are a great way to grow your audience and test out new features. Cedric J. Rogers from <a href=\"https://www.culturegenesis.com/\">Culture Genesis</a> shared how his team uses new platforms to grow readership for their main monetized platforms. Rene Alegria and the <a href=\"https://en.mundohispanico.com/\">Mundo Hispanico</a> team also recently tested moving to an infinite scroll on their homepage, which increased time spent on their site by 300%.</li><li><b>Understand what metrics make up your revenue<br/></b>Your earnings are a product of your costs-per-click, clickthrough rate and pageviews. Google AdSense and Google Ad Manager have a variety of features — like <a href=\"https://support.google.com/adsense/answer/9261307?hl=en\">Auto ads</a>, <a href=\"https://support.google.com/adsense/answer/9141298?hl=en\">Auto optimize</a> and <a href=\"https://support.google.com/admanager/answer/6333031?hl=en\">manual experiments</a> — to help you learn how to maximize your metrics and increase your earning potential.</li></ol><p>A big thank you to all of our <a href=\"https://publishersonair.withgoogle.com/events/2021-black-latinx-publisher-summit/speakers#\">speakers</a> for sharing their wisdom and expertise at this year’s Black and Latinx Publisher Summit. If you’re interested in hearing more, check out the <a href=\"https://publishersonair.withgoogle.com/events/2021-black-latinx-publisher-summit#\">event replay</a>.</p></div></div></body></html>",
  "pubDate": "Thu, 16 Dec 2021 13:00:00 +0000",
  "guid": "https://blog.google/products/admanager/7-takeaways-our-black-and-latinx-publishers-summit/",
  "category": [
    "Diversity and Inclusion",
    "AdSense",
    "Grow with Google",
    "Google Ad Manager"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "7 takeaways from our Black and Latinx Publishers Summit",
    "description": "Google hosted the 2021 Black and Latinx Publishers Summit, where industry leaders and publishers shared top tips for growing their businesses.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Black_Latinx_summit.max-600x600.png",
    "site_name": "Google",
    "url": "https://blog.google/products/admanager/7-takeaways-our-black-and-latinx-publishers-summit/"
  },
  "author": {
    "name": "Ashley Castillo",
    "title": "Product Marketing Manager",
    "department": "",
    "company": "Google Ad Manager"
  }
}