{
  "title": "A Serial Entrepreneur Shares Lessons Learned on His Road to Success",
  "link": "https://spectrum.ieee.org/serial-entrepreneur-on-lessons-learned",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/portrait-of-a-man-in-a-black-blazer-and-a-blue-button-up-shirt-against-a-white-background.jpg?id=31890708&width=2000&height=1500&coordinates=0%2C0%2C0%2C0\"/><br/><br/><p>When <a href=\"https://www.linkedin.com/in/rarjunpillai/\" rel=\"noopener noreferrer\" target=\"_blank\">Arjun Pillai</a> was a youngster, the words <em>entrepreneur</em> and <em>startup</em> weren’t part of his vocabulary. It wasn’t until he became an IEEE student member in 2006 that Pillai learned those terms. He served on several IEEE committees and had leadership positions in IEEE groups—which helped him discover his managerial instincts. He learned from other IEEE members what running a tech company entails. And he belatedly realized that his father, who ran a small rubber-band manufacturing company next to the family’s home in India, was an entrepreneur.</p><p>After learning more about what running a tech company entails from other IEEE members, Pillai decided he also wanted to become an entrepreneur, to create “something bigger than me.”</p><hr/><p>He helped launch two companies that develop software-as-a-service platforms—both of which he and his cofounders subsequently sold. </p><p>His most recent venture, <a href=\"https://www.linkedin.com/company/insent-ai/?lipi=urn%3Ali%3Apage%3Ad_flagship3_search_srp_all%3BuxxNjRF1T4m6IszPiMJTgg%3D%3D\" rel=\"noopener noreferrer\" target=\"_blank\">Insent</a>, was a business-to-business chat platform based in Denver; it was acquired last year by software and data company <a href=\"https://www.google.com/aclk?sa=l&ai=DChcSEwjgveSry5n6AhXG9sgKHYEiATgYABABGgJxdQ&sig=AOD64_3S3mJk_XJ_XoQDHEn7KDsH5kTHAw&q&adurl&ved=2ahUKEwjE6tyry5n6AhWLM1kFHc7LApgQ0Qx6BAgEEAE\" rel=\"noopener noreferrer\" target=\"_blank\">ZoomInfo</a> of Vancouver, Wash. Pillai is now senior vice president of ZoomInfo’s products and growth department.</p><p>He credits IEEE with giving him leadership training and opportunities to hone his public-speaking skills. As an active volunteer with the <a href=\"https://ieeekerala.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Kerala (India) Section</a>, he spoke at numerous conferences and meetings. He also served on the <a href=\"https://www.ieeer10.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Region 10</a> <a href=\"https://newsletter.ieeer10.org/home_oct2021/r10-humanitarian-technology-activities-committee/\" rel=\"noopener noreferrer\" target=\"_blank\">humanitarian technology activities committee</a> and was vice chair of <a href=\"https://yp.ieee.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Young Professionals</a>.</p><p>Thos activities helped him improve his English language skills, he says, as well as his interpersonal skills.</p><p>“IEEE helped me gain the confidence I needed to found my first startup, in 2012,” the senior member says.</p><h2>From systems engineer to CEO</h2><p>After graduating in 2010 with a bachelor’s degree in electronics and communication engineering from the <a href=\"https://cusat.ac.in/\" rel=\"noopener noreferrer\" target=\"_blank\">Cochin University of Science and Technology</a> in India, Pillai joined IT company <a href=\"https://www.infosys.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Infosys</a>, in Bangalore, as a systems engineer. He left in 2012 and founded <a href=\"https://www.linkedin.com/company/profoundis/about/\" rel=\"noopener noreferrer\" target=\"_blank\">Profoundis</a> with three former classmates: <a href=\"https://www.linkedin.com/in/jofin/\" rel=\"noopener noreferrer\" target=\"_blank\">Jofin Joseph</a>, <a href=\"https://www.linkedin.com/in/nithinsamoommen/\" rel=\"noopener noreferrer\" target=\"_blank\">Nithin Sam Oommen</a>, and <a href=\"https://www.linkedin.com/in/atmb4u/\" rel=\"noopener noreferrer\" target=\"_blank\">Anoop Thomas Mathew</a>. The company, based in Cochin, aimed to help businesses and other organizations connect with customers.</p><p>“I was 23 years old. I was young and stupid and had no idea what I was getting into,” Pillai says, laughing. He served as chief executive, while Joseph was chief operating officer, Oommen was chief of data research, and Mathew was chief technology officer.</p><p>During the company’s first two years, it developed four products—a management system for online testimonials, a financial analytics platform for small and midsize businesses, an assignment system for college students, and a social media analytics tool—all of which failed to get any traction within their intended markets, Pillai says.</p><p class=\"pull-quote\">“If the reason why you started a company is strong, it will get you through the hurdles you will face.”</p><p>“But we had to just keep going,” he says. “The failure didn’t really register as such. It was just another day at work.”</p><p>In 2015 Profoundis launched its fifth product, Vibe: sales software that helps businesses identify prospective customers. It proved to be a winner. Vibe collects data about companies from the Internet, organizes it into a searchable list, and makes it available to marketers and salespeople. More than 200 companies in dozens of countries have used it. The success of the product enabled the company to grow from seven employees to 72. <a href=\"https://www.fullcontact.com/\" rel=\"noopener noreferrer\" target=\"_blank\">FullContact</a>, a software company in Denver, acquired Profoundis nine months later.</p><p>“It was the first product acquisition in the history of my state of Kerala,” Pillai says.</p><p>After Profoundis was sold, Pillai joined FullContact as the head of data strategy, working in Denver. But he says he didn’t really enjoy working for another company.</p><p>“Once you’re an entrepreneur, you kind of have that bug all the time,” he says. He also struggled with the fact that it wasn’t his company anymore, he says. </p><p>“I didn’t do a good enough job transitioning from CEO to employee,” he says. “I always tell other entrepreneurs about my experience so they don’t make the same mistake. This was the most important thing I learned after selling my first company.”</p><p>Pillai left FullContact after two years and worked as a consultant until 2018, when he founded Insent with IEEE Member <a href=\"https://www.linkedin.com/in/prasanna081460\" rel=\"noopener noreferrer\" target=\"_blank\">Prasanna Venkatesan</a>. The two cofounders had met through their volunteer activities with IEEE a decade earlier.</p><p>The startup’s B2B platform used a combination of human and chatbot conversations to personalize a customer’s purchasing experience with a retailer. After the company was acquired, the platform was renamed ZoomInfo Chat.</p><p>ZoomInfo hired all of the startup’s employees.</p><p>In his new position, Pillai led the release of ZoomInfo Chat. He is currently managing the company’s data portfolio.</p><p>“ZoomInfo has the best business data assets in the world,” he says. “It’s the core of the company, so I have a big responsibility.”</p><p>Pillai also invests in startups including <a href=\"https://www.inflection.io/\" rel=\"noopener noreferrer\" target=\"_blank\">Inflection</a>, <a href=\"https://www.savantlabs.io/\" rel=\"noopener noreferrer\" target=\"_blank\">Savant Labs</a>, and <a href=\"https://www.linkedin.com/company/toplynehq\" rel=\"noopener noreferrer\" target=\"_blank\">Toplyne</a>. Inflection and Savant Labs are data analytics companies, while Toplyne develops software.</p><p>“Investing in others gives me the ability to learn about new industries,” he says.</p><h2>Advice for budding entrepreneurs</h2><p>Pillai says that running his own company gave him an unparalleled education on how to be a CEO, and he has learned from both his successes and his failures.</p><p>Pillai, who had no mentor to teach him how to run a company, is now a strong advocate for supporting budding entrepreneurs. For the past five years, he has been an ambassador for <a href=\"https://startupchile.org/\" rel=\"noopener noreferrer\" target=\"_blank\">Start-Up Chile</a>, a government initiative that seeks to attract high-potential entrepreneurs to the country.</p><p>“I want to give back,” he says.</p><p>The biggest challenge for any startup, he says, is bringing together the right team, especially if you plan to launch the company with another person.</p><p>“Being cofounders is like being married,” he says. “If you choose the wrong person, running a successful startup together will be difficult.”</p><p>You need to pick people who share your passion and have a similar mindset, a positive attitude, and strong ethics, he says.</p><p>Other challenges include developing a product or service that makes sense for its intended market and securing enough funding so that you can release the product in a timely way while it still can make an impact.</p><p>He tells budding entrepreneurs to ensure they’re forming a company for the right reasons. Found a startup only if “you feel passionate about a problem that keeps you awake at night and that you believe you’re the only person who can solve,” he says. “If the reason why you started a company is strong, it will get you through the hurdles you will face.”</p><p>Pillai advises startup founders to take occasional breaks from work.</p><p>“In the four and a half years I was CEO of my first company, work was my life,” he says. He was so driven that he showed up once to an investor’s meeting while he was sick, instead of rescheduling it. He says he thinks that’s the reason the investor ended up backing away from the project.</p><p>Pillai says he wishes he had had a mentor to tell him that he needed to take it easy, and that things would work out in the end.</p><p>“Learning all of these lessons on my own was a humbling experience,” he says.</p>",
  "pubDate": "Tue, 11 Oct 2022 18:00:01 +0000",
  "guid": "https://spectrum.ieee.org/serial-entrepreneur-on-lessons-learned",
  "category": [
    "Ieee member news",
    "Startups",
    "Profile",
    "Entrepreneurship",
    "Careers",
    "Ieee young professionals",
    "Type:ti"
  ],
  "dc:creator": "Joanna Goodrich",
  "media:content": ""
}