{
  "id": "yt:video:EyBDtUtyshk",
  "yt:videoId": "EyBDtUtyshk",
  "yt:channelId": "UCrlZs71h3mTR45FgQNINfrg",
  "title": "Complex integration, Cauchy and residue theorems | Essence of Complex Analysis #6",
  "link": "",
  "author": {
    "name": "Mathemaniac",
    "uri": "https://www.youtube.com/channel/UCrlZs71h3mTR45FgQNINfrg"
  },
  "published": "2022-01-22T15:00:07+00:00",
  "updated": "2022-02-16T12:14:17+00:00",
  "media:group": {
    "media:title": "Complex integration, Cauchy and residue theorems | Essence of Complex Analysis #6",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Unlock new career opportunities and become data fluent today! Use my link https://bit.ly/MathemaniacDCJan22  and check out the first chapter of any DataCamp course for FREE! \n\nI can't pronounce \"parametrisation\" lol\n\nA crash course in complex analysis - basically everything leading up to the Residue theorem. This is a more intuitive explanation of complex integration using Pólya vector field.\n\nYou might notice that my explanation on parametrisation is a bit similar to the Jacobian, and you will be right! Jacobian is really important in this area (and also understanding complex differentiation and Cauchy-Riemann equations).\n\nI have made this slower in comparison with some of my other videos, because when I myself watched some of my other videos that are faster, I couldn't comprehend if I was not paying too much attention on the screen, let alone the audience watching it for the first time. If somehow, miraculously, you think this is way too slow, feel free to speed it up!\n\nI said the more general Cauchy integral formula is related, because in my original plan, I did want to say that Laurent coefficients take on exactly the same form, but it just occurred while I was finally editing the video that we don't find Laurent coefficients using integrals, and I don't want to send my Cauchy integral formula bit to waste, so here it is.\n\nThroughout this video series, of course I have left out lots of theorems in complex analysis, only talking about the things that I find more \"applicable\" (read: more audience want to watch). Things like Fundamental theorem of algebra, or maximum modulus principle, or even winding numbers are not presented, but in my defense, they are not really \"essence of\" anymore, because they use the concepts that we have developed in this series instead - like Cauchy integral formula as seen here.\n\nThis video was sponsored by DataCamp.\n\n📖📖MORE READING📖📖\n\n(Simply connected version) https://en.wikipedia.org/wiki/Cauchy%27s_integral_theorem\n\n(Homologous to 0 version)\nhttps://www-users.cse.umn.edu/~brubaker/docs/8701-F13/dixon.pdf\n\nSurely, You’re Joking, Mr Feynman: https://www.amazon.co.uk/Surely-Youre-Joking-Feynman-Adventures/dp/009917331X\n\nMath StackExchange thread: https://math.stackexchange.com/questions/253910/the-integral-that-stumped-feynman\n\nResidue theorem example links:\n\nWikipedia: https://en.wikipedia.org/wiki/Residue_theorem#An_integral_along_the_real_axis\n[The example that I nicked from]\n\nYou will need - estimation lemma (a.k.a. ML lemma): https://en.wikipedia.org/wiki/Estimation_lemma\n\nIf you want to watch other videos on the exact same integral instead (although I think the Wikipedia page is a more “elementary” way of finding residues), you might want to have a look at:\n\nClassifying singularities: https://sites.oxy.edu/ron/math/312/14/ws/24.pdf (page 1)\n\nMore ways of calculating residues: https://en.wikipedia.org/wiki/Residue_(complex_analysis)#Calculating_residues\n\nYouTube videos talking about exactly the same integral (though they all assume quite a bit of familiarity of the above):\n\nFlammable maths: https://www.youtube.com/watch?v=YWBdwYr6PGg\nqncubed3: https://www.youtube.com/watch?v=DvND8J32gOA\ntahiri math science online teaching: https://www.youtube.com/watch?v=oGEo_BxqZ3c\n\n🎶🎶Music used🎶🎶\nAakash Gandhi - Heavenly / Kiss the Sky / Lifting Dreams / White River\nAsher Fulero - The Closing of Summer\n\nVideo chapter:\n00:00 Complex integration (first try)\n06:01 Pólya vector field\n08:18 Complex integration (second try)\n12:27 Cauchy's theorem\n18:39 Integrating 1/z\n22:28 Other powers of z\n28:26 Cauchy integral formula\n31:43 Residue theorem\n36:14 But why?\n\nOther than commenting on the video, you are very welcome to fill in a Google form linked below, which helps me make better videos by catering for your math levels:\nhttps://forms.gle/QJ29hocF9uQAyZyH6\n\nIf you want to know more interesting Mathematics, stay tuned for the next video!\n\nSUBSCRIBE and see you in the next video!\n\nIf you are wondering how I made all these videos, even though it is stylistically similar to 3Blue1Brown, I don't use his animation engine Manim, but I will probably reveal how I did it in a potential subscriber milestone, so do subscribe!\n\nSocial media:\n\nFacebook: https://www.facebook.com/mathemaniacyt\nInstagram: https://www.instagram.com/_mathemaniac_/\nTwitter: https://twitter.com/mathemaniacyt\nPatreon: https://www.patreon.com/mathemaniac (support if you want to and can afford to!)\nMerch: https://mathemaniac.myspreadshop.co.uk\n\nFor my contact email, check my About page on a PC.\n\nSee you next time!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}