{
  "id": "tag:theatlantic.com,2020:39-605524",
  "content": "<p class=\"dropcap\">When you enter the RH (formerly Restoration Hardware) <a href=\"https://www.architecturaldigest.com/story/-restoration-hardware-rh-opens-new-york-meatpacking-store-pastis\">megastore</a> in New York City’s Meatpacking District, you might think it’s a place to buy furniture. Technically it is, with tens of thousands of square feet filled with dining-room sets and king-size beds and couches, upholstered in shades of gray and beige and beiger, and accessorized with plush rugs and metal-armed lamps. Or maybe you’ll mistake it for a hotel lobby, with its high ceilings, ample seating, and smiling concierge.</p><p>But on either side of the store’s broad central path, you’ll see its true spiritual, if not practical, purpose: as a temple to the high-end furniture chain’s infamous “source books.” On twin circular tables large enough for an extended family’s Thanksgiving dinner (yours for $7,995 each), eight different editions sit in neat stacks and offer inspiration tailored to ski chalets, beach getaways, or nurseries for rich babies, depending on the tome. Bathed in golden light from enormous $12,000 chandeliers, the gods of direct-mail marketing beckon enticingly from their “carbonized split bamboo” altars.</p><p>The biggest of RH’s 2019 catalogs was 730 glossy pages—from a few feet away, you might think it’s the September issue of <i>Vogue</i>. The company would not reveal how much it spends on the lavish compendiums, but in 2012, <a href=\"https://www.sfgate.com/business/article/Restoration-Hardware-catalog-a-huge-feat-3866807.php\">an industry expert estimated</a> that they would require a multimillion-dollar budget, with each individual book costing as much as $3 to print and ship—a figure that doesn’t include the tab for photography or page design. RH’s catalogs, and its price points, were similar to Pottery Barn’s and Crate &amp; Barrel’s until the late aughts, when the source books and opulently appointed stores began to be introduced. Both are part of what longtime Chairman and CEO Gary Friedman has described as a strategy to project abundance and turn the heads of wealthy customers; apparently, it’s worked. In 2001, the company was <a href=\"https://www.wsj.com/articles/SB10001424052748704436004576300181946707482\">teetering on the edge of bankruptcy</a>. While there have been bumps along the way, RH’s sales since then have increased dramatically, and in December its stock price hit an all-time high.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/health/archive/2020/01/kitchenaid-le-creuset-peak-domesticity/605716/?utm_source=feed\">Read: The new trophies of domesticity</a>]</i></p><p>All the pageantry for catalogs might seem puzzling, given that print media and retail stores are struggling to compete with the infotainment hub of the smartphone. But although the number of catalogs mailed in America has fallen since its high of 19 billion in 2007, an estimated 11.5 billion were still sent in 2018. As retailers become ever more desperate to find ways to sell their stuff without tithing to the tech behemoths, America might be entering a golden age of the catalog.</p><p class=\"dropcap\"><span class=\"smallcaps\">“The rumors of </span>my demise are greatly exaggerated,” says Hamilton Davison, the executive director of the American Catalog Mailers Association, which advocates for things like favorable postage rates and tax rules. “Isn’t that what Mark Twain said?” In the late 2000s, a change in federal regulation raised mailing prices for catalogs, and as online shopping accelerated in the years afterward, a lot of companies abandoned catalogs in favor of email and social-media strategies targeting younger consumers. Those retailers included companies known for their direct-mail products, such as JCPenney, whose catalog had figured prominently in its branding since 1963 but was discontinued in 2010.</p><aside class=\"callout-placeholder\" data-source=\"curated\"></aside><p>Five years later, though, <a href=\"https://www.nytimes.com/2015/01/26/business/media/catalogs-after-years-of-decline-are-revamped-for-changing-times.html\">the JCPenney catalog was back</a>, in defeated recognition that the physical world still matters. “You can’t make me open your email, you can’t make me open your website, you can’t make me go to your retail store, but you can send a large-format mail piece I have to pick up,” Davison says. “It’s invasive, but it’s welcome.” Davison has a vested interest in the future of the format, of course, but his claims are borne out by research suggesting that even though catalogs typically arrive unbidden, consumers find them less presumptuous and irritating than marketing emails. “The internet is too much like work,” Davison says, while catalogs feel more like play. “The internet is great if you know what you’re looking for,” he adds, “but it’s a lousy browsing vehicle.” Instead of being followed around online for days by ads for a product you already ordered (or considered and ruled out), you can peruse catalogs at your leisure and disengage fully when you’re done. It’s so analog, it almost feels wholesome.</p><p class=\"c-recirculation-link\" data-id=\"injected-recirculation-link\"><em><a href=\"https://www.theatlantic.com/magazine/archive/2018/09/download-your-facebook-data/565736/?utm_source=feed\">From September 2018: What it’s like to wallow in your own Facebook data</a></em></p><p>Around the same time that JCPenney was returning to mailboxes, catalogs began gaining favor among newer companies. “You can think about a catalog as a push versus a pull,” says Matt Krepsik, the global head of analytics for Nielsen’s marketing-effectiveness arm. “On the internet, I just have to hope that Matt discovers my website. When I send Matt a catalog, I’m reaching out to him one-to-one.”</p><p>Another benefit: Catalog-mailers can “prospect” by sending their books to whomever they choose, but most email-marketing services require retailers to gain consent from recipients. That’s partly because sending marketing emails without permission is illegal in some countries and partly because it’s against the rules of some internet- and email-service providers—businesses risk having everything they send algorithmically disregarded as spam.</p><p>Although the average catalog costs about a dollar per copy to produce and ship, compared with pennies per email, Krepsik says that they’re particularly effective at prompting large purchases (up to twice as expensive as those made by noncatalog shoppers) and luring back customers after first purchases. Higher receipts and consumer loyalty are exactly what a plucky upstart needs to become a standard-bearer—or for a long-standing business to fight back against Amazon.</p><p class=\"dropcap\"><span class=\"smallcaps\">The story of </span>the Vermont Country Store is the opposite of the now-familiar cautionary tales of businesses too slow to cater to the desires of youth. “We were still printing a black-and-white catalog in 2000,” says Eliot Orton, one of three brothers who now own the business started by their grandfather in 1946. “We slowly migrated to color, even doing a watercolor treatment to the sketches we were doing at the time.” The store’s catalog, sent seasonally, with special editions for the holidays, is now full of color photography, but no one would mistake it for a concession to American marketers’ obsession with youth. Its comfy nightgowns, flannel bed linens, and old-school candies and baked goods are straight out of a Norman Rockwell fantasia.</p><p>Not only does the company curate its products for an older demographic, but the structure of its business, which still allows people to order by phone or send in a form with a check, could have easily become a thing of the past. A substantial number of Americans, however, still lack reliable high-speed internet or credit services, and many older people just don’t trust the internet, a suspicion that’s arguably justified. “We spent the last 30 years agonizing over whether there was a cliff, and whether the audience we were serving would evaporate and not be replaced,” Cabot Orton says. But new customers keep aging into the store’s market. You don’t have to be very old, after all, to grow tired of trying to keep up with technology—just ask any 30-something American still trying to decide whether to download TikTok. No one has to be taught how to flip through a catalog.</p><p>Even if the majority of a company’s orders are made online, as the Vermont Country Store’s now are, catalogs provide an important opportunity for businesses whose appeal goes beyond super-fast service at super-low prices. The store is a family business whose employees, from photographers to warehouse workers, all live nearby. The brothers often turn up in the catalog, modeling plaid shirts, and everyone picks up shifts answering phones during the busy holiday season. This is a company that constantly reminds you that it’s still possible to buy some of what you need from people who aren’t trying to eliminate competitors or extract every last bit of value from employees or colonize the moon. That kind of context is lost entirely when a nightgown appears in Google’s shopping tab, alongside less expensive alternatives from Walmart.</p><p class=\"dropcap\"><span class=\"smallcaps\">A host of </span>internet-first start-ups, such as the makeup brand Glossier and the menswear company Bonobos, have boarded the catalog bandwagon in the past decade. These companies had thrived on direct-to-consumer websites and social-media advertising but needed new strategies to make a more complete case for their business.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/technology/archive/2019/03/shop-until-you-drop-instagram/585268/?utm_source=feed\">Read: I gave up and let Instagram shop for me</a>]</i></p><p>That’s especially true for a very modern subgenre of company that seeks to attract socially conscious young people with a mix of activism, philanthropy, and sales. The brand Cotopaxi, which uses recycled materials to make things like backpacks and jackets, is among them. The outdoor-gear purveyor shoots its catalogs in adventure-travel spots in conjunction with local nonprofits, including, most recently, Escuela Nueva, which provides education to indigenous people and refugees in South America. The organizations receive modest grants from Cotopaxi, as well as coverage in the company’s catalog and the rights to use the material for their own fundraising. “It’s hard to tell that story over [social media] sometimes,” says Annie Agle, Cotopaxi’s director of brand and impact. “It can feel callous; there’s not a lot of time, and you’re fighting for attention.” Catalogs, in their own way, are antiviral—they’re not easily shared, and they offer depth and explanation. If the catalogs in your mailbox have started to look more like magazines, that’s why.</p><p>Still, consumers worried about waste and climate change might bristle at receiving paper mail when they could be reached digitally. Agle says she understands that concern, but notes that upwards of 90 percent of an apparel company’s carbon footprint happens before a garment is sewn, because the manufacture and transportation of textiles is extremely expensive and wasteful. So that, she says, is where most of Cotopaxi’s efforts at waste reduction have gone.</p><p>Even if paper sent through the mail is an imperfect medium, it still might be the best way for independent businesses to avoid getting sucked into the Amazon-Google-Facebook vortex—and for internet-weary consumers to avoid seeing the whole world through the filters of the Big Three’s algorithms. “Something we talk about a lot is data-privacy issues,” Agle says. “Obviously electronic advertising is more sustainable, but it’s not necessarily better for society.”</p><hr><p><small><em>This article appears in the March 2020 print edition with the headline “Why Restoration Hardware Sends Catalogs the Size of a Toddler.”</em></small></p>",
  "author": {
    "name": "Amanda Mull",
    "uri": "http://www.theatlantic.com/author/amanda-mull/?utm_source=feed"
  },
  "media:content": {
    "media:credit": "Giacomo Bagnara"
  },
  "title": "Why the Restoration Hardware Catalog Won’t Die",
  "published": "2020-02-18T06:00:00-05:00",
  "updated": "2020-11-19T14:57:57-05:00",
  "summary": "The surprising persistence of the mail-order business",
  "link": ""
}