{
  "title": "S02.40: A Kingdom of Dreams by Judith McNaught: A Romance Reader's Romance",
  "category": [
    "full-length episode",
    "read along",
    "S02 - TBTBU"
  ],
  "dc:creator": "Jennifer Prokop",
  "pubDate": "Wed, 10 Jun 2020 04:00:00 +0000",
  "link": "https://fatedmates.net/episodes/2020/6/9/s0240-a-kingdom-of-dreams",
  "guid": "5bc7409ec46f6d369ce5f644:5bcf6773419202388fdccb10:5edff515984cb602a4c55094",
  "description": "<p class=\"\">It’s the last read-along of Season Two! We’re reading Judith McNaught’s A Kingdom of Dreams, which is the actual book that blooded Sarah when she was wee. This week we’re talking old-school romance, what McNaught was doing with this book and this hero who is so unlike all the heroes who came before him, and why (book) Jennifer is the perfect namesake for (our) Jennifer.</p><p class=\"\">We might not be doing read alongs until August, but that doesn’t mean your TBR won’t still be groaning under the weight of our recommendations — we’ve got a bunch of rec episodes lined up for summer….oh, and did you know Sarah has a book out in three weeks? Order it from <a href=\"https://amzn.to/36enOHt\">Amazon</a>, <a href=\"http://bit.ly/DukeKobo\">Kobo</a>, <a href=\"http://bit.ly/DukeBN\">Barnes & Noble</a>, <a href=\"https://apple.co/394AXnZ\">Apple Books</a>, <a href=\"http://bit.ly/DukeBAM\">Books-a-Million</a> or from <a href=\"https://bit.ly/3foEa5a\">your local indie</a>, or order it signed from her local indie, <a href=\"http://wordbookstores.com/sarahmaclean\">WORD Bookstore</a>, and get a special edition Fated Mates sticker with your purchase!</p><p class=\"\">As summer approaches, if you are up for leaving a rating or review for the podcast on your podcasting app, we would be very grateful!</p><p class=\"\">Show Notes</p><p class=\"\"><a href=\"https://en.wikipedia.org/wiki/Marty_McFly\">Marty McFly</a>, played by Michael J. Fox, was the main character in an excellent 1985 time-traveling movie called <a href=\"https://www.backtothefuture.com/\">Back to the Future</a>.</p><p class=\"\">Sarah's next book, <em>Daring and the Duke</em>, comes out at the end of the month. <a href=\"https://www.wordbookstores.com/SarahMacLean\">Preorder from WORD</a> in Brooklyn and you'll recieve <a href=\"https://twitter.com/FatedMates/status/1263064000310448128?s=20\">a limited edition yellow Fated Mates sticker</a>.</p><p class=\"\"><em>Whitney, My Love</em> is an early McNaught historical romance that the author changed because in the original text, the hero rapes and horsewhips the heroine. The hero of <em>A Kingdom of Dreams</em>, Royce Westmoreland, is one of Clayton's ancestors, but we think he is McNaught correcting the record on the Alpha hero. <a href=\"https://fatedmates.net/episodes/2019/1/13/7-warlord-wants-forever-amp-untouchable\">In the IAD novella episode</a>, we talked about the changes in <em>Whitney, My Love</em>. <em>Whitney</em> also <a href=\"https://fatedmates.net/episodes/2019/9/17/s022-the-alpha-in-romance-novels-interstitial\">came up in the Alpha episode</a> that started the season, because it's impossible to talk about the primordial alphas without talking about the early Alpha.</p><p class=\"\">More on the four books that comprise <a href=\"https://www.simonandschuster.com/series/The-Westmoreland-Dynasty-Saga\">the Westmoreland series</a>.</p><p class=\"\">Who do we talk to get <em>A Kingdom of Dreams</em> on audio? <a href=\"https://www.audible.com/ep/business-inquiries?pf_rd_p=93623a20-4420-43f1-9509-872bcf46b3b2&pf_rd_r=EETZAXEEZQ73VW2B3EK2&ref=a_home-page_b1_desktop_footer_column_3_2\">Oh, you can email a request to Audible.</a></p><p class=\"\">Jen learned about <a href=\"https://en.wikipedia.org/wiki/1497\">1497</a> on Wikipedia. As one does.</p><p class=\"\"><a href=\"http://www.cracroftspeerage.co.uk/index20.htm\">Women could inherit a title in Scotland</a>.</p><p class=\"\">Margaret Tudor was Henry VII's eldest daughter, married to James IV of Scotland to bring peace to the border. Fun fact, once James IV died (thanks for nothing, Henry VIII, you were the worst), Margaret acted as Regent until James V of Scotland, but when that didn't work out, she married two other dudes and also staged a coup, so we don't really know why we don't all sing her praise always. Yeah, we do. Patriarchy. Anyway. Sarah didn't learn about Margaret Tudor on Wikipedia, <a href=\"https://en.wikipedia.org/wiki/Margaret_Tudor\">but you can</a>.</p><p class=\"\"><a href=\"https://adamselindisdress.blog/2014/04/28/12th-century-dress-the-bliaut/\">All about the bliaut</a>. Sarah would like you to know she <a href=\"https://en.wikipedia.org/wiki/Bliaut\">looked up bliauts</a> on Wikipedia after we recorded and now she's an expert. High-fives to all Wikipedia editors. Nothing without you.</p><p class=\"\"><a href=\"https://fatedmates.net/episodes/2019/5/18/135-freewheeling-with-sarah-and-jen\">Tinctures, tonics, and teas</a> is Fated Mates shorthand for historicals where medicine women knew various herbal remedies for preventing or ending pregnancy. Or in this case, causing life-long impotence.</p><p class=\"\">We talked a little bit about the freedom of setting a romance in Medieval times on our <a href=\"https://en.wikipedia.org/wiki/Bliaut\">Scottish Romance episode</a>, so head over and listen to that if you're interested.</p><p class=\"\">Jen's obsessed with the idea of the Vietnam Hero, but doesn't know where to start. Probably with finishing the <a href=\"http://www.pbs.org/kenburns/the-vietnam-war/home/\">Ken Burns Vietnam documentary</a>.</p><p class=\"\"><a href=\"https://sudeleycastle.co.uk/news/9-things-you-didnt-know-about-jousting\">Jousting</a>. <a href=\"https://www.nytimes.com/2010/07/11/magazine/11Jousting-t.html\">WTF</a>.</p><p class=\"\">What would <a href=\"https://www.theringer.com/year-in-review/2019/12/13/21013189/jurgen-klopp-liverpool-premier-league-leaders\">Jurgen Klopp</a> say?</p><p class=\"\">While we're talking about Judith McNaught and Wikipedia, do not sleep on her page. Divorce celebrations, Coors Brewing Company tie-ins, the invention of the non-clinch romance cover, moving to Dallas after going there on book tour...<a href=\"https://en.wikipedia.org/wiki/Judith_McNaught\">it has it all</a>.</p><p class=\"\">Support <a href=\"https://blacklivesmatter.com/\">Black Lives Matter</a> and <a href=\"https://www.communityjusticeexchange.org/nbfn-directory\">bail funds</a> in your city or state.</p><p class=\"\"><a href=\"https://twitter.com/Bookshop_Org/status/1267846208237776904?s=20\">Shop and support Black-owned Indie bookstores</a>.</p><p class=\"\"><a href=\"https://www.vote.org/register-to-vote/\">Register to vote</a>. Already registered? <a href=\"https://www.vote.org/am-i-registered-to-vote/\">Double check</a>.</p>",
  "itunes:author": "Fated Mates",
  "itunes:subtitle": "Sarah and Jen discuss A Kingdom of Dreams",
  "itunes:summary": "One of readers’ very favorite tropes this week…sometimes it’s friends-to-lovers and sometimes it’s friends-to-enemies-to-lovers and sometimes it’s friends-to-attempted-murder-to-lovers….we’re talking childhood friends to adult lovers and we will get to the bottom of it! Get ready for way too much music from The Saint. But first things first….Black Lives Matter.",
  "itunes:explicit": "yes",
  "itunes:duration": "01:30:34",
  "itunes:image": "",
  "itunes:season": 2,
  "itunes:episode": 40,
  "itunes:title": "S02.40: A Kingdom of Dreams by Judith McNaught: A Romance Reader's Romance",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "S02.40: A Kingdom of Dreams by Judith McNaught: A Romance Reader's Romance"
  }
}