{
  "id": "tag:theatlantic.com,2021:50-620187",
  "content": "<p>Grocery prices are rising. Meat prices are rising more than most other grocery prices. Beef prices are rising more than most other meat prices.</p><p>But on the ranch, these are not prosperous times. Even as ground chuck costs <a href=\"https://www.walmart.com/search?q=ground+beef\">more than $5 a pound at Walmart</a>, ranchers complain that they are receiving less for their animals than it costs to feed them.</p><p>Rising food prices are likely depressing President Joe Biden’s softening approval numbers. The U.S. economy has added <a href=\"https://fred.stlouisfed.org/series/PAYEMS\">almost 5 million</a> non-farm jobs since Inauguration Day. Yet Biden’s approval rating has dropped into the mid-40s. In a recent Fox News poll, 82 percent of respondents described themselves as “extremely” or “very” concerned about <a href=\"https://www.foxnews.com/official-polls/fox-news-poll-majorities-favor-mask-vaccine-mandates-as-pandemic-worries-increase\">the cost of living</a>. More than scenes of chaos in Afghanistan, the numbers at the supermarket checkout may be weighing Biden down.</p><p>On September 8, the White House unveiled an analysis of the problem—and an ambitious plan for action: $500 million in loan guarantees to smaller and regional beef processors.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/ideas/archive/2019/11/income-inequality-getting-worse/601414/?utm_source=feed\">Annie Lowrey: The inflation gap</a>]</i></p><p>What’s going on here is bigger than beef. It’s a test of a theory about the U.S. economy—and about a philosophy of government. The theory, expressed most powerfully in a 2019 book by Thomas Philippon, <a href=\"https://www.hup.harvard.edu/catalog.php?isbn=9780674237544\"><i>The Great Reversal</i></a>, is that the U.S. economy is in thrall to a few dominant corporations. In industry after industry, Philippon argued, a few companies have gained the power to keep prices high, wages low, and competitors out. The philosophy of government that follows from this theory is that the government should vigorously police competition, not only by means of <a href=\"https://www.theatlantic.com/business/archive/2017/06/word-monopoly-antitrust/530169/?utm_source=feed\">traditional antitrust enforcement</a> but also through a broader program of <a href=\"https://www.theatlantic.com/ideas/archive/2019/10/europe-not-america-home-free-market/600859/?utm_source=feed\">market regulation</a> and intervention.  </p><p>Market regulation went out of style in the 1970s, a victim of its internal contradictions. As academic critics such as Robert Bork argued back then: If, say, a supermarket gains market share from its mom-and-pop competitors by offering a wider selection at lower prices, you can understand why Mom and Pop don’t like it. But how is it “pro-competition” if the government intervenes to protect Mom and Pop from competitors who are doing a better job of meeting customer needs?</p><p>That argument prevailed for most of the past half century. The Biden administration is seeking to change course—and beef is where it’s starting.</p><p>To understand the choices facing the Biden administration, here are the two warring explanations of what’s going on with beef.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/politics/archive/2021/05/biden-economy-inflation-yellen/618816/?utm_source=feed\">Read: Bidenomics really is something new</a>]</i></p><p>The first explanation is a classic story of supply and demand. The beef industry has been hammered over the past two years by <a href=\"https://www.theatlantic.com/technology/archive/2021/09/pandemic-supply-chain-nightmare-slow-shipping/620147/?utm_source=feed\">a series of supply shocks</a>. COVID closed many processing plants. Then, when the plants reopened, they had to work less efficiently, with workers spaced farther apart from one another. Like many other employers, meatpackers have had difficulty hiring enough labor at pre-pandemic wages, so they have had to pay more, which raises their costs.</p><p>Meanwhile, U.S. cattle herds have been ravaged by drought across the American West. The 2020 drought was bad; the 2021 drought has been worse. More than one-third of American cattle have grazed under drought conditions in 2021, sometimes—as in Montana and Washington State—extreme-drought conditions. The aggregate national herd has shrunk in numbers, and the animals that have come to market have weighed an <a href=\"https://www.ers.usda.gov/webdocs/outlooks/101889/ldp-m-326.pdf?v=714.6\">average of 15 pounds less</a> than animals weighed a year earlier, according to U.S. Department of Agriculture statistics.</p><p>Drought has also pushed the price of cattle feed to dizzying heights, raising beef prices even higher. The feed crisis explains some of the woes of small ranchers. Many cattle spend their early months on a ranch eating grass, then are shipped to a feedlot where they are fattened with corn and other grains. If the feed costs more, the rancher earns less.</p><p>Over the past year and a half, surging demand slammed into this constrained supply. Throughout the coronavirus pandemic, the federal government has pumped enormous purchasing power into consumers’ wallets. This extra money—plus consumer cutbacks on other kinds of spending—has enabled consumers to increase their spending at the grocery store; they spent <a href=\"https://www.brookings.edu/blog/future-development/2020/12/14/the-decline-and-recovery-of-consumer-spending-in-the-us/\">$84 billion</a> more in 2020 relative to 2019.</p><p>If this supply-and-demand explanation is correct, then the right policy for government is: Do nothing. Higher prices will encourage ranchers to raise more cattle. Higher prices will enable meatpackers to pay higher wages. Higher prices will induce consumers to substitute other foods for beef. Supply and demand will equilibrate, as they always do. And this time, the high prices can serve another function, too: warning consumers of the pocketbook impact of drought-causing climate change.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/business/archive/2015/10/meat-industry-lobbying-political-nutrition/412243/?utm_source=feed\">Read: How meat producers have influenced nutrition guidelines for decades</a>]</i></p><p>But there’s another story to tell, and it’s the story the Biden administration is telling. Meatpacking is becoming a more concentrated industry. Just four companies process more than 80 percent of America’s beef. Even as prices moved down in the early 2010s and up again in the early 2020s, the Big Four packers have been able first to increase, then to maintain, <a href=\"https://www.whitehouse.gov/briefing-room/blog/2021/09/08/addressing-concentration-in-the-meat-processing-industry-to-lower-food-prices-for-american-families/\">their level of profitability</a>. In less concentrated food industries, notably eggs, prices did not rise nearly as much in 2020–21 as did prices of meat, and especially beef.</p><p>Without denying the supply-and-demand explanation altogether, the Biden administration wants to act to multiply competition in the meatpacking industry. It proposes committing $500 million in loan guarantees and direct subsidies to support smaller players against the Big Four. It hopes that more competition will raise the prices that packers pay to ranchers and cut the prices consumers pay at the store.</p><p>That’s maybe a forlorn hope. A single large-sized <a href=\"https://www.theatlantic.com/magazine/archive/2021/07/meatpacking-plant-dodge-city/619011/?utm_source=feed\">meatpacking plant</a> can cost $200 million, and take many months to approve and build. So $500 million will not buy much additional capacity. Worse, from a Biden administration perspective, meatpackers faced by intensified competition have another option besides paying more to ranchers or charging consumers less: They can squeeze their own costs by, for example, automating workers out of jobs.</p><p>The architects of the Biden plan are uneasily aware that it rests on a lot of hopes, guesses, and optimistic assumptions. When pressed on the unlikelihood that their plan will deliver any near-term relief to either ranchers or consumers, they reply that the more fundamental goal of their plan is to improve the resiliency of the U.S. food system. Because meatpacking in general—and beef packing most of all—is so concentrated in a few huge plants, small shocks can disrupt the nation’s supply of meat.</p><p>In August 2019, a fire badly damaged one of the seven largest meatpacking plants in the United States, near Holcomb, Kansas. At a stroke, the U.S. <a href=\"https://www.meatpoultry.com/articles/22036-the-smoldering-impact-of-tyson-holcomb-fire\">lost the ability</a> to process 30,000 head of cattle per week. In May 2021, a cyberattack temporarily closed all of the U.S. processing operations of JBS, the largest meatpacker in the world. That attack disrupted <a href=\"https://www.bloomberg.com/news/articles/2021-05-31/meat-is-latest-cyber-victim-as-hackers-hit-top-supplier-jbs\">one-fourth</a> of the U.S. beef supply.</p><p>Multiplying the number of smaller if perhaps less efficient suppliers can provide some cushions against such shocks in future. That’s the hope anyway, and President Biden has talked <a href=\"https://www.whitehouse.gov/briefing-room/speeches-remarks/2021/04/12/remarks-by-president-biden-at-a-virtual-ceo-summit-on-semiconductor-and-supply-chain-resilience/\">a lot</a> about it. But how would that hope work in the real world? The Big Four came to dominate beef packing as they do precisely because theirs is an industry where larger size translates into lower costs and greater efficiencies. The Biden administration is not talking about turning the Big Four into the Big Five. It’s talking about supporting a lot of smaller competitors. What’s to stop the Big Four from undercutting them and driving them out of business far in advance of a crisis in which the extra resiliency might prove useful? When I put this question to officials involved in the Biden plan, they admit that the question worried the president too.</p><p>There is one way that the resiliency project can work: if the additional capacity can somehow persuade consumers to pay higher prices. Craft breweries do not compete with Anheuser-Busch on price; they compete on taste. Smaller meatpackers could likewise compete as alternatives that are more humane to animals—or that deliver organic or grass-fed meat. But that means entering the market at the top, not undercutting from below. And because the main obstacles to this kind of niche competition are regulatory, allowing the niche competitors to grow will demand a <i>deregulatory</i> agenda of a kind very different from what the Biden administration seems to have in mind for meatpacking.</p><p>Instead, there’s a real risk that the initial commitment of $500 million in aid and loan guarantees to small packers will expand into continuing intervention in the marketplace to keep smaller competitors in business in the face of the higher efficiency and lower prices of the big packers.</p><p>As the saying goes, there’s no taking the politics out of politics. Rage at the big meatpackers burns especially hot among ranchers in Montana and the Dakotas. These ranchers are located far away from the feedlots of the Corn Belt to the south, and they feel themselves especially disadvantaged by the industry’s present structure. They even have <a href=\"https://www.r-calfusa.com/\">their own industry group</a>, which broadly supports the Biden administration’s plans. Montana has a Democratic senator right now; North Dakota had one from 2013 to 2019. Unsurprisingly, a Democratic presidential administration listens more carefully to the views of ranchers in states that sometimes vote Democratic than to those from states that less often do.</p><p>Yet it would be a mistake to interpret beef policy as merely an expression of regional politics. What’s being proposed for beef is as an experiment in stricter marketplace regulation. If it works—or at least seems to work—for beef, it can be tried elsewhere. But what if it doesn’t work? We’ll be back where we were before the 1970s, when “pro-competition” often turned out to mean “a helping hand to the least capable competitors.” “Resiliency” is an appealing slogan. But what if it translates into plainer English as higher taxes and higher prices?</p>",
  "author": {
    "name": "David Frum",
    "uri": "http://www.theatlantic.com/author/david-frum/?utm_source=feed"
  },
  "media:content": {
    "media:credit": "Adam Maida / The Atlantic"
  },
  "title": "Where’s the Cheap Beef?",
  "published": "2021-09-24T05:00:00-04:00",
  "updated": "2021-10-19T10:55:36-04:00",
  "summary": "The rising prices at the supermarket checkout are a problem with no simple explanation. But Democratic hopes may depend on finding the right answer.",
  "link": ""
}