{
  "title": "EPISODE 23 The Conquest of Mexico (Part 4): Tenochtitlan Or Bust",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Thu, 17 Aug 2017 18:03:38 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2017/8/17/episode-23-the-conquest-of-mexico-part-4-tenochtitlan-or-bust",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5995c6bcbe42d6aa7c81dcda",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1502991802902-OOD6CYBZD6DNFHB20F89/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"5995d5b86b8f5b1d7695e22e\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1502991802902-OOD6CYBZD6DNFHB20F89/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“After getting this information, he had the arms, feet, and heads of our unfortunate companions cut off, and sent them round to various towns of our allies and those who had made peace with us, with the message that he did not think one of us would be left alive to return to Texcoco. Then he offered their hearts and blood to his idols.”</em>&nbsp;— Bernal Diaz</p><p class=\"\">“<em>Eat the flesh of your brothers, for we are full. You can stuff yourselves with our leftovers.”</em>&nbsp;—Mexica warriors addressing the Spaniards&nbsp;</p><p class=\"\"><em>“It is better that we should all die fighting in the city than see ourselves in the power of those who would enslave us and torture us for gold.” —</em> From a speech attributed to a Mexica captain&nbsp;</p><p class=\"\"><em>“The people of the city had to walk upon their dead while others swam or drowned in the waters of that wide lake… so great was their suffering that it was beyond our understanding how they could endure it.” —</em> Hernan Cortes</p><p class=\"\">In the 1500s, two highly militaristic peoples fueled by religious ideologies requiring bloodshed clashed with one another. This is the tale of what happened when a band of Spaniards run into the Mexica (Aztec) empire. By the time the dust will settle, out of the 25 million indigenous inhabitants of Mexico, little over a million will be left standing.&nbsp;</p><p class=\"\">In this fourth episode:</p><ul data-rte-list=\"default\"><li><p class=\"\">Cortes’ charge at the battle of Otumba</p></li><li><p class=\"\">The Tlaxcalan fateful choice</p></li><li><p class=\"\">Branding POWs in the face with the letter G for Guerra</p></li><li><p class=\"\">Smallpox was better than any army for the Spaniards</p></li><li><p class=\"\">Cortes holds a rape auction</p></li><li><p class=\"\">The master carpenter Martin Lopez, and his ships sealed with boiling human fat taken from dead Mexica warriors</p></li><li><p class=\"\">A plot against Cortes ends with a hanging</p></li><li><p class=\"\">Cortes on top of the pyramid at Xochimilco sees 2,000 canoes coming to kill him</p></li><li><p class=\"\">Xicotenga and Led Zeppelin’s Gallows Pole</p></li><li><p class=\"\">The siege of Tenochtitlan</p></li><li><p class=\"\">Cortes flirting with death</p></li><li><p class=\"\">The human sacrifice that gave Bernal Diaz permanent PTSD</p></li><li><p class=\"\">Eating the plaster off your walls and still fighting on</p></li><li><p class=\"\">The city of the dead</p></li><li><p class=\"\">The Mexica emperor being introduced to the expression “holding the feet to the fire”</p></li><li><p class=\"\">Ramsay Bolton would have loved both Mexica and Spaniards</p></li><li><p class=\"\">The aftermath of the Conquest</p></li></ul><p class=\"\">This episode is sponsored by <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a> For less than $ 10 per meal, Blue Apron delivers straight to your door seasonal recipes along with pre-portioned ingredients to make delicious, home-cooked meals. Get your first three meals free—with free shipping—by going to <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a>&nbsp;</p><p class=\"\">This episode is also brought to you by Skillshare, an online learning community with over fifteen thousand classes in design, business, and more. Skillshare is giving my listeners a month of unlimited access -- absolutely FREE! Go to <a href=\"http://www.skillshare.com/history\" target=\"_blank\">www.skillshare.com/history</a> to redeem your free month.&nbsp;</p><p class=\"\">Thank you to Geek Nation Tours, a vacation company which creates tours focusing on geek culture including conventions, movie locations and historical battlefields.<br>This October, they will be time-traveling to Feudal Japan and the battlefields of Sekigahara…. Join them as they watch Kendo, Kyudo, Iaido, and sword making demonstrations at the Seki Cutlery Festival, visit the most famous Japanese medieval castles, hike through spectacular natural landscapes and of course visit the Sekigahara re-enactment festival where you will see samurai walking the streets in full armor and battling in a commemoration of that singular battle of 1600.</p><p class=\"\"><a href=\"http://geeknationtours.com/tours_post/signature-battlefield-series-feudal-japan-and-the-battlefields-of-sekigahara-2017/\">http://geeknationtours.com/tours_post/signature-battlefield-series-feudal-japan-and-the-battlefields-of-sekigahara-2017/</a></p><p class=\"\">Please, also show some love to my regular sponsors by shopping for supplements, special foods, clothing and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;</p><p class=\"\">And if you are in the market for backpacks, computer bags and other hemp gear, check out my favorites at <a href=\"http://www.dsgear.com\">http://www.dsgear.com</a> and use the code “daniele” at checkout for a discount.&nbsp;</p><p class=\"\">Please check out <a href=\"http://www.alphadynamicshealth.com\">www.alphadynamicshealth.com</a> for their line of medicinal mushrooms</p><p class=\"\">Master podcaster Darryl Cooper has created a companion series to go with this particular History on Fire series. Check out his episodes exploring themes of human sacrifice, religion, psychology and much more at <a href=\"http://www.martyrmade.com/\">http://www.martyrmade.com/</a>&nbsp;</p><p class=\"\"><br>My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>. Thank you to Onnit, Datsusara, Float Clinic, Shaman’s Simple Solutions, War Fuel, Proven Nutrition, and Fight Chix for sponsoring her for her first MMA fight. If you’d like to check out Fight Chix merchandise, you can get a 20% discount by going to <a href=\"http://www.fightchix.com/\">http://www.fightchix.com/</a> and entering the code Fire20 upon checkout.</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "02:30:41",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 23,
  "itunes:title": "EPISODE 23 The Conquest of Mexico (Part 4): Tenochtitlan Or Bust",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 23 The Conquest of Mexico (Part 4): Tenochtitlan Or Bust"
  }
}