{
  "title": "The doves were wrong",
  "description": "\n<p>In late 2021 and early 2022, a number of pundits warned that the Fed was moving too quickly to tighten <a href=\"https://www.econlib.org/library/Enc/MonetaryPolicy.html\">monetary policy</a>. It is now clear that these pundits were wrong. Not only did the Fed not do too much tightening, <em>there&#8217;s almost no evidence that the Fed has tightened monetary policy at all</em>, at least to any measurable extent.</p>\n<p>Roughly a year ago, it became apparent (even to the Fed) that the economy was moving toward overheating.  So why might an abrupt tightening in late 2021 have been a mistake?  After all, <a href=\"https://www.econlib.org/library/Enc/Inflation.html\">inflation</a> is a big problem, and tight money is the only reliable way of reducing inflation.  Tight money can reduce NGDP growth to a level consistent with 2% inflation.</p>\n<div class=\"block-quote\">\n<div class=\"pull-quote-blue\"><img loading=\"lazy\" class=\"size-medium wp-image-62223\" src=\"https://www.econlib.org/wp-content/uploads/2022/11/tight-money-300x300.jpg\" alt=\"\" width=\"300\" height=\"300\" srcset=\"https://www.econlib.org/wp-content/uploads/2022/11/tight-money-300x300.jpg 300w, https://www.econlib.org/wp-content/uploads/2022/11/tight-money-150x150.jpg 150w, https://www.econlib.org/wp-content/uploads/2022/11/tight-money-768x768.jpg 768w, https://www.econlib.org/wp-content/uploads/2022/11/tight-money-250x250.jpg 250w, https://www.econlib.org/wp-content/uploads/2022/11/tight-money-600x600.jpg 600w, https://www.econlib.org/wp-content/uploads/2022/11/tight-money-100x100.jpg 100w, https://www.econlib.org/wp-content/uploads/2022/11/tight-money.jpg 1000w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></div>\n</div>\n<p>The standard answer is that the Fed needs to be careful, as tight money imposes pain on the labor market.  And I believe that is true&#8212;we all saw what happened in 2008 when the Fed over tightened.  The unemployment rate shot up to 10%.</p>\n<p>If that&#8217;s your criterion for over tightening, then the Fed certainly has not done so.  Indeed not only has the Fed not imposed excessive pain on the labor market, they&#8217;ve produced such rapid NGDP growth in 2022 that the labor market is almost absurdly hot.  Job openings are currently far above the level of previous boom periods such as late 2019.</p>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-62211\" src=\"https://www.econlib.org/wp-content/uploads/2022/11/Screen-Shot-2022-11-04-at-1.28.17-PM.png\" alt=\"\" width=\"658\" height=\"406\" srcset=\"https://www.econlib.org/wp-content/uploads/2022/11/Screen-Shot-2022-11-04-at-1.28.17-PM.png 658w, https://www.econlib.org/wp-content/uploads/2022/11/Screen-Shot-2022-11-04-at-1.28.17-PM-300x185.png 300w, https://www.econlib.org/wp-content/uploads/2022/11/Screen-Shot-2022-11-04-at-1.28.17-PM-600x370.png 600w\" sizes=\"(max-width: 658px) 100vw, 658px\" /></p>\n<p>A desirable policy of bringing inflation down through gradualism would balance the costs of inflation and <a href=\"https://www.econlib.org/library/Enc/Unemployment.html\">unemployment</a>.  It would impose a modest amount of pain on the labor market, but not too much.  <em>But the Fed has not imposed any pain at all.</em>  Indeed it hasn&#8217;t even returned to labor market back down to the boom conditions of late 2019.  There&#8217;s been no balancing of costs.  And there&#8217;s been no significant reduction in inflation at all.  Despite what you read in the press, there&#8217;s been no tight money policy in 2022.</p>\n<p>Later this year, I plan to release a book that discusses problems in the way we measure the stance of monetary policy.  Here are some mistakes that have been made in 2021-22:</p>\n<p>1. Assuming that interest rates measure the stance of monetary policy.  They don&#8217;t.  Rising rates do not indicate tighter money.  The money supply is also not a good indicator.</p>\n<p>2.  Gradualism in adjusting the policy instrument.  It&#8217;s true that you&#8217;d like to bring NGDP growth down gradually, so as not to create a lot of unemployment.  But that does not mean that you need to raise the target interest rate at a gradual pace.</p>\n<p>3.  Confusing a falling stock and bond market with tight money.  (This is referred to a tighter &#8220;financial conditions&#8221;.)  The most expansionary monetary policy in my lifetime (1966-81) was accompanied by a very weak performance of the stock and bond markets.  Markets hate high inflation&#8212;but high inflation is not a product of tight money.  Don&#8217;t equate tight financial conditions and tight money.</p>\n<p>4.  Assuming that monetary policy affects NGDP with a long and variable lag.  In fact, monetary policy affects NGDP almost immediately, as we see in the few monetary shocks that are clearly identified (such as 1933).  It seems like a long lag if you assume that rising rates are tight money, but they are not.</p>\n<p>5.  Too much focus on inflation and not enough focus on NGDP growth.  There was a long and utterly useless debate about whether inflation was caused by supply or demand side factors.  It doesn&#8217;t matter!  What matters is NGDP growth, which is 100% demand driven.  And NGDP growth has clearly been too high.</p>\n<p>6.  President Biden waited too long to reappoint Powell.  It&#8217;s possible that Powell felt uncomfortable making the decision to tighten monetary policy just a month or two before Biden was to make his decision on a new Fed chair.</p>\n<p>7.  Most important of all (by far), the Fed&#8217;s FAIT fiasco.  The Fed signaled an intention to target the average rate of inflation at 2%, just as it adopted a highly expansionary monetary policy.  FAIT actually would have been a great idea, if implemented properly.  But as soon as stabilizing the average inflation rate required a tight money policy, the Fed announced that the policy was <em>asymmetric</em>, and that they would not offset inflation overshoots with future undershoots.</p>\n<p>In late 2019, monetary policy in the US was in a very good place, the best policy I&#8217;ve seen in my entire life.  Tragically, all these gains were thrown away over the following few years, in a reckless attempt to artificially create prosperity by printing lots of money.  FAIT would have been a great policy.  Asymmetric FAIT has been a disaster.</p>\n<p>PS.  I got this email from Bloomberg:</p>\n<blockquote>\n<p><strong>It&#8217;s that time of the month</strong>—jobs day. The US nonfarm payrolls report will be scoured for <a title=\"Original URL: https://link.mail.bloombergbusiness.com/click/29591758.128166/aHR0cHM6Ly93d3cuYmxvb21iZXJnLmNvbS9uZXdzL2FydGljbGVzLzIwMjItMTEtMDMvc3R1cmR5LWpvYi1tYXJrZXQtcmlza3MtbW9yZS1yZXN0cmljdGl2ZS1mZWQtZGVlcGVyLXJlY2Vzc2lvbj9jbXBpZD1CQkQxMTA0MjJfT1VTJnV0bV9tZWRpdW09ZW1haWwmdXRtX3NvdXJjZT1uZXdzbGV0dGVyJnV0bV90ZXJtPTIyMTEwNCZ1dG1fY2FtcGFpZ249b3BlbmFtZXJpY2Fz/618eb74474cb6737ab0d1dd6B2ecad17b. Click or tap if you trust this link.\" href=\"https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Flink.mail.bloombergbusiness.com%2Fclick%2F29591758.128166%2FaHR0cHM6Ly93d3cuYmxvb21iZXJnLmNvbS9uZXdzL2FydGljbGVzLzIwMjItMTEtMDMvc3R1cmR5LWpvYi1tYXJrZXQtcmlza3MtbW9yZS1yZXN0cmljdGl2ZS1mZWQtZGVlcGVyLXJlY2Vzc2lvbj9jbXBpZD1CQkQxMTA0MjJfT1VTJnV0bV9tZWRpdW09ZW1haWwmdXRtX3NvdXJjZT1uZXdzbGV0dGVyJnV0bV90ZXJtPTIyMTEwNCZ1dG1fY2FtcGFpZ249b3BlbmFtZXJpY2Fz%2F618eb74474cb6737ab0d1dd6B2ecad17b&data=05%7C01%7Cssumner%40bentley.edu%7C6e775d9b3f72438793fc08dabe4ce166%7C9030beae3cfc4788a9e2130204ff1f10%7C0%7C0%7C638031534759028409%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=6g8zELjPjwFiBOvbxS9fkRC%2FPMkTnuwdax3iMu66DT0%3D&reserved=0\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"Verified\" data-linkindex=\"3\">any clue</a> that the Fed can downshift to a 50 bp hike next time around or reaffirm a higher terminal rate. Evidence may be mixed: The economy probably added 195,000 jobs in October, fewer than in September but still OK.</p>\n</blockquote>\n<p>No, 195,000 would not be OK; it would be far too high.  I&#8217;m not advocating high unemployment, but is it too much to ask that the Fed at least bring the labor market back to the historically strong boom of late 2019, instead of the almost absurd overheating that we see today?  In any case, Bloomberg was wrong.  The economy added 261,000 jobs in October, and previous months were also revised upwards.  Nominal wage growth was also above expectations.  We&#8217;re still booming.</p>\n<p>PPS.  A few months back, a whole bunch of commenters told me that the US entered a recession in early 2022.  These people need to reconsider their model of the economy.  Ditto for those people who warned that the Fed was tightening too aggressively in early 2022.   Time for some soul searching.  (I did some soul searching in January, when I realized that the Fed&#8217;s FAIT was a sham.)</p>\n<div class=\"x_body-image\"><img alt=\"\" data-imagetype=\"External\" /></div>\n(10 COMMENTS)",
  "link": "https://www.econlib.org/the-doves-were-wrong/",
  "guid": "https://www.econlib.org/the-doves-were-wrong/",
  "category": [
    "Macroeconomics",
    "Monetary Policy",
    "Money and Inflation",
    "inflation",
    "Jerome Powell",
    "labor market",
    "policy doves",
    "recession",
    "tight money"
  ],
  "pubDate": "Fri, 04 Nov 2022 18:07:20 +0000"
}