{
  "id": "yt:video:IIqix9CsuUk",
  "yt:videoId": "IIqix9CsuUk",
  "yt:channelId": "UCTUtqcDkzw7bisadh6AOx5w",
  "title": "Why Is It So Hard To Talk About Sound?",
  "link": "",
  "author": {
    "name": "12tone",
    "uri": "https://www.youtube.com/channel/UCTUtqcDkzw7bisadh6AOx5w"
  },
  "published": "2022-07-01T17:00:09+00:00",
  "updated": "2022-07-02T12:56:29+00:00",
  "media:group": {
    "media:title": "Why Is It So Hard To Talk About Sound?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The tools we have to precisely discuss sound kinda... suck. Ok, maybe that's a bit much, but as a music theorist, it's hard not to notice how underdeveloped our vocabulary is when it comes to what is arguably the single most important component of musical experience: The actual tones of the instruments that comprise songs. It seems like such an obvious thing, but it's actually really difficult to do well. Why is that, and can we do better?\n\nPatreon: https://www.patreon.com/12tonevideos\nMerch: http://standard.tv/12tone\nDiscord: https://discord.gg/pq2QBEw\nFacebook: https://www.facebook.com/12tonevideos\nTwitter: https://twitter.com/12tonevideos\nTwitch: https://www.twitch.tv/12tonevideos\nEmail: 12tonevideos@gmail.com\n\nLast: https://youtu.be/we1_PUmh_RA\n\nScript: https://tinyurl.com/sxsj4fbj\n\nHuge thanks to our Elephant Club members:\n\nSusan Jones\nJill Jones\nDuck \nHoward Levine\nBrian Etheredge\nLen Lanphar\nKen Arnold\nElaine Pratt\nWilliam (Bill) Boston\nWarren Huart\nKevin Wilamowski\nGrant Aldonas\nChris Prentice\nJack Carlson\nChristopher Lucas\nAndrew Beals\nDov Zazkis\nHendrik P\nThomas Morley\nJacob Helwig\nDavis Sprague\nBraum Meakes\nKelly Christoffersen\nHendrik Stüwe\nDan Bonelli\nKevin Boyce\nDonal Botkin\nStephen Cook\nLuke\nDavid Bartz\nDhruv Monga\nKen Jones\nObadiah Wright\nCarlos Rendon\nAleksandar Milojković\nKylie McInnes\nJody \nDaniel Reaman\nTom\nPhilRosas \nReiji Kobayashi\nCatherine Berry\nMichael Mol\nNeil Moore\nKai\n\nAnd thanks as well to Henry Reich, Gabi Ghita, Gene Lushtak, Owen Campbell-Moore, Eugene Bulkin, Logan Jones, Oliver, Anna Work, Adam Neely, Rick Lees, Dave Mayer, CodenaCrow, Arnas, Caroline Simpson, Michael Alan Dorman, Blake Boyd, Charles Gaskell, Ian Seymour, Trevor Sullivan, Tom Evans, Lamadesbois, JH, David Conrad, Ducky, Chris Borland, Todd Davidson, Elliot Burke, Jake Lizzio, Tim S., Elias Simon, Aaron Epstein, Chris Connett, Jerry D. Brown, Ohad Lutzky, Kenneth Kousen, James, h2g2guy, W. Dennis Sorrell, Symmetry, Peter Leventis, Professor Elliot, James A. Thornton, Stefan Strohmaier, Andrew Engel, Shadow Kat, Adam Wurstmann, Angela Flierman, Richard T. Anderson, Peter Brinkmann, Kevin Johnson, Joshua La Macchia, Rodrigo \"rrc2soft\" Roman, Jeremy Zolner, Patrick Callier, Danny, Francois LaPlante, Volker Wegert, Britt Ratliff, Darzzr, Alex Keeny, John Bejarano, naomio, Alex Mole, Gary Butterfield, Steve Brand, Rene Miklas, Red Uncle, Betsy, Tonya Custis, Dave Shapiro, Jacopo Cascioli, Doug Nottingham, Rafael Martinez Salas, Walther, Nicholas Wolf, Graeme Lewis, Jake Sand, Robert Beach, Jason Nebergall, Mathew Wolak, S, Lincoln Mendell, Jim Hayes, Scott Albertine, Sam Rezek, Destros, Lucas Augusto, Evan Satinsky, RaptorCat, Jigglypuffer, leftaroundabout ., Jens Schäfer, Mikely Whiplash, Austin Amberg, רועי סיני, Conor Stuart Roe, Francisco Rodrigues, Michael Tsuk, Dragix PL, ThoraSTooth, Brandon Legawiec, Gary Evesson, Kottolett, Dylan Vidas, Hikaru Katayamma, Rob Hardy, Patrick Chieppe, Eric Stark, David Haughn, Gordon Dell, Byron DeLaBarre, Matty Crocker, anemamata, Brian Miller, Lee-orr Orbach, Eric Plume, Kevin Pierce, Jon Hancock, Bryn Davis, Pamela O'Neill, Jason Peterson, Peggy Youell, EJ Hambleton, Jos Mulder, Daryl Banttari, J.T. Vandenbree, Thomas Morgan, Ludwick Kennedy, John Castle, Ridley Kemp, Mark James, Wayne Robinson, Gabriel Totusek, Adam Ziegenhals, Mark, Amelia Lewis, sonicolasj, Mnemosyne Music, AkselA, Sam Plotkin, David MacDonald, Nellie Speirs Baron, Charles R., Joshua Lewis, Kristofer Hill, William Merryman, Ryan Mayle, Sam, DialMForManning, Wayne Weil, Michael Wehling, Justin St John-Brooks, type inference, Brandon Peckham, James, David T Peterson, Bryan C. Mills, Joseph Satin, Piush Dahal, Matthew Moore, XCompWiz, Andrew Wyld, Michael Blaby, Bean, A Devoted Servant, Milan Brezovsky, Edmund Horner, NinoDoko, JD White, M. Bock, Daniel Joseph Moynihan, Joe Johnston, Jordan Friendshuh, Josh Witkowski, What is true is already so, Graham Orndorff, Jason McPherson, Chris Robson, A.J. Yates, Matt Moulder, Leander Tietjen, Hakim C, Dixon Roberts, gunnito, Alex Tafur, Chris Davis, findRED, Howl’s one-handed, Gary Backaus, Eugen Lounkine, Fernando Gros, Geoffrey Barnett, OVB_2nd, William, Joe Molloy, Jay Wilson, RoxyPop, Chris Breault, Daniel Sim, Pär Nord, David Wagner, Paul Tanenholz, Lev, Julio D, Justin Zboyovski, Adam Poata-Smith, J.R. Hyde, A, Douglas Anderson, Foreign Man in a Foreign Land, Vigilance Deadname, Liz Webb, Boomer Dell, Christopher Beattie, triskadecaepyon, Abie, Charles Jordan, Kelly Walker, derFunkenstein, and The curious case of music! Your support helps make 12tone even better!\n\nAlso, thanks to Jareth Arnold!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}