{
  "title": "Chess cheating: how to detect it (other than catching someone with a shoe phone)",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/06/chess-cheating-how-to-detect-it-other-than-catching-someone-with-a-shoe-phone/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/06/chess-cheating-how-to-detect-it-other-than-catching-someone-with-a-shoe-phone/#comments",
  "dc:creator": "Phil",
  "pubDate": "Thu, 06 Oct 2022 22:34:25 +0000",
  "category": [
    "Miscellaneous Statistics",
    "Sports",
    "cheating",
    "chess"
  ],
  "guid": "https://statmodeling.stat.columbia.edu/?p=48045",
  "description": "This post is by Phil Price, not Andrew. Some of you have surely heard about the cheating scandal that has recently rocked the chess world (or perhaps it&#8217;s more correct to say the &#8216;cheating-accusation scandal.&#8217;) The whole kerfuffle started when &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/06/chess-cheating-how-to-detect-it-other-than-catching-someone-with-a-shoe-phone/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "\n<p>This post is by Phil Price, not Andrew.<br><br>Some of you have surely heard about the cheating scandal that has recently rocked the chess world (or perhaps it&#8217;s more correct to say the &#8216;cheating-accusation scandal.&#8217;)  The whole kerfuffle started when World Champion Magnus Carlsen withdrew from a tournament after losing a game to a guy named Hans Niemann. Carlsen didn&#8217;t say at the time why he resigned, in fact he said &#8220;I really prefer not to speak. If I speak, I am in big trouble.&#8221;  Most people correctly guessed that Carlsen suspected that Niemann had cheated to win. Carlsen later confirmed that suspicion. Perhaps he didn&#8217;t say so at the start because he was afraid of being sued for slander. <br><br>Carlsen faced Niemann again in a tournament just a week or two after the initial one, and Carlsen resigned on move 2.<br><br>In both of those cases, Carlsen and Niemann were playing &#8220;over the board&#8221; or &#8220;OTB&#8221;, i.e. sitting across a chess board from each other and moving the pieces by hand.  That&#8217;s in contrast to &#8220;online&#8221; chess, in which players compete by moving pieces on a virtual board.  Cheating in online chess is very easy: you just run a &#8220;chess engine&#8221; (a chess-playing program) and enter the moves from your game into the engine as you play, and let it tell you what move to make next.  Cheating in OTB chess is not so simple: at high-level tournaments players go through a metal detector before playing and are not allowed to carry a phone or other device. (A chess engine running on a phone can easily beat the best human players.  A chess commentator once responded to the claim &#8220;my phone can beat the world chess champion&#8221; by saying &#8220;that&#8217;s nothing, my microwave can beat the world chess champion.&#8221;).  But if the incentives are high enough, some people will take difficult steps in order to win. In at least one tournament it seems that a player was using a chess computer (or perhaps a communication device)<a href=\"https://en.chessbase.com/post/the-shoe-aistant--ivanov-forfeits-at-blagoevgrad-051013\"> concealed in his shoe</a>. <br><br>I don&#8217;t know if there are specific allegations related to how Niemann might have cheated in OTB games. A shoe device again, which Niemann uses to both enter the moves as they occur and to get the results through vibration? A confederate who enters the moves and signals Niemann somehow (a suppository that vibrates?). I&#8217;m not really sure what the options are. It would be very hard to &#8220;prove&#8221; cheating simply by looking at the moves that are made in a single game: at the highest levels both players can be expected to play <em>almost</em> perfectly, usually making one of the top two or three moves on every move (as evaluated by the computer), so simply playing very very well is not enough to prove anything.</p>\n\n\n\n<span id=\"more-48045\"></span>\n\n\n\n<p>But even if it&#8217;s impossible to prove cheating by looking at the moves in a single game, there&#8217;s additional information available from the arc of a player&#8217;s career. And although cheating in online games could, in principle, be at least as hard to detect as cheating in OTB chess &#8212; actually it should be harder, because you can&#8217;t do a physical search of the players! &#8212; in practice the ways people cheat in online games seem to be rather easily detectable. A company called chess.com that is used by millions of players (including me!) has posted <a href=\"https://www.chess.com/blog/CHESScom/hans-niemann-report\">a long article</a> about their cheat-detection methods, specifically as regards Hans Niemann &#8212; who has, they believe, cheated in many games, including when playing for monetary prizes &#8212;  and it lists several ways they look for cheating. Their bullet list is a bit confused so I&#8217;ve cleaned it up here:</p>\n\n\n\n<ul><li>Comparing the moves made to engine-recommended moves (after removing some opening and endgame moves that are memorized and thus uninformative about player skill).</li><li>Comparing player past performance to their historical strength</li><li>Comparing a player&#8217;s performance to comparable peers</li><li>Looking at behavioral factors (e.g. &#8216;browser behavior&#8217;)</li><li>Reviewing time usage for finding easy vs difficult moves. </li></ul>\n\n\n\n<p>The &#8216;browser behavior&#8217; item needs explanation. If you play on chess.com, they can tell when your computer&#8217;s &#8216;focus&#8217; is on the window where you are playing. If you click to another window, they can tell. At least two things would be suspicious: (1) clicking away from chess.com after every move or almost every move, since this would suggest you might be entering moves into the engine and looking at results, and (2) playing stronger moves after returning to the chess.com window from somewhere else, as compared to the moves you play when you stay on the chess.com window for multiple consecutive moves. <br><br>Item (2) requires an assessment of move quality, which is usually summarized in the pleasing unit of &#8220;centipawns.&#8221; By tradition, a pawn is considered to be &#8220;worth&#8221; one point on average, and chess programs are programmed to evaluate positions by assigning points according to that scale. If you a move causes you to lose a pawn (without other compensation such as a stronger position) then, as far as the program is concerned, you have lost a point.  To evaluate a human&#8217;s move you can compare their position after their move to the position if they had made the move the computer thinks is best. If they made the computer move, they have a loss of &#8216;0 centipawns&#8217;. If the computer thinks their position is 0.12 pawns worse than it would have been if they had made the computer move, then they have lost 12 centipawns. Measures such as &#8216;average centipawn loss&#8217; can be used to evaluate player strength, both for online play and OTB play (and even for players who played long before the advent of computers). Chess.com creates a &#8220;Strength Score&#8221; based on this sort of information (I don&#8217;t think they have published their algorithm); this is highly correlated with the player &#8220;ELO ratings&#8221;, which are based on win-loss-draw records against other players but chess.com evidently prefers it to using the ratings alone.  </p>\n\n\n\n<p>In online play, if a player averages a 4 centipawn loss per move when they stay on the chess.com window, but only a 1 centipawn move when they return to it after clicking away to another window, that suggests cheating. (But it doesn&#8217;t <em>prove</em> cheating.  Perhaps you only click away to check Facebook if the position is very simple and you know you can pick the best move). It seems to me that if you were going to cheat in an online tournament you would simply have a second computer to run your chess engine. Maybe that&#8217;s what people will do, now that they know chess.com can and does detect when they click away.<br><br>By using these approaches, chess.com has concluded that Niemann &#8220;very likely&#8221; cheated in a great many individual games and in many online tournaments. You can read the chess.com article for a list. (By the way, Niemann has admitted to cheating in some online games, although he claims never to have done so when money was at stake.)</p>\n\n\n\n<p>Other than &#8216;browser behavior&#8217;, the other methods chess.com can be used for detecting cheating in OTB chess as well&#8230;and those also make Niemann&#8217;s performance look very, very suspicious. For example, considering only OTB chess, Niemann&#8217;s improvement from age 11 through 19 has been faster than any other player in history. Second on the list is Bobby Fischer, fourth is Magnus Carlsen. This alone doesn&#8217;t <em>prove</em> anything. We know Fischer wasn&#8217;t improving because of an engine, and yet he had this huge improvement, and who&#8217;s to say nobody could ever do it faster than Fischer? But <em>either</em> Niemann improved faster than any other chess player of all time, <em>or</em> he cheated.  <br><br>Finally, there&#8217;s some other, less quantifiable evidence that Niemann has cheated in OTB chess. For example, many grandmasters supposedly find that his post-game discussions of his games show lack of a deep understanding of the positions that he just played. And some grandmasters think Niemann&#8217;s pattern of time usage is suspicious: that he takes too little time in subtle positions but still finds the best moves, while sometimes taking too much time in clearer positions where he should be able to move more quickly. (Perhaps I should have mentioned earlier: all games, online and OTB, are played using a chess clock so that players are limited in how much time they have. The amount of time allowed is different from tournament to tournament). <br><br>I guess that&#8217;s enough for now. I think the evidence that Niemann cheated very frequently in online chess is extremely convincing, and I think all of the smart money is betting that he has also cheated OTB. Certainly that&#8217;s where my money is, and my money isn&#8217;t even smart!<br><br>If you have any interest in this general topic, I highly recommend reading the chess.com article (link is in the fifth paragraph, above). <br><br>This post is by Phil. </p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/06/chess-cheating-how-to-detect-it-other-than-catching-someone-with-a-shoe-phone/feed/",
  "slash:comments": 67
}