{
  "title": "67: How to QUIET Your Mind Kwikly",
  "pubDate": "Thu, 26 Jul 2018 15:33:54 +0000",
  "guid": "74a1921697e24d3db6fe3c579b06bc31",
  "link": "https://sites.libsyn.com/94610/67-how-to-quiet-your-mind-kwikly",
  "itunes:image": "",
  "description": "<p class=\"p1\">Do you have a busy mind?<br /> <br /> We often get questions about how to calm and quiet one’s mind in our Kwik Brain Podcast FB Group. We no longer live in the age where we measure success by profit or prestige, but rather by a peace of mind. Do you agree?<br /> <br /> Your brain is not designed to work at full steam all the time. So regularly simmering down with these tips and hacks is a brilliant move for your wellbeing in life and career.<br /> <br /> Perhaps you wear a lot of hats and have a long list of to-do’s, and your monkey mind can get out of control. And a majority of the time, the thoughts in our heads aren’t always positive. If you’re struggling with that internal chatterbox, then this episode is for you.<br /> <br /> I’ll share with you simple questions and tips to get your mind in a more peaceful place when you need it the most.<br /> <br /> ** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access.<br /> <br /> ** Also, visit <a href= \"http://www.JimKwik.com/podcast\"><span class=\"s1\">www.JimKwik.com/podcast</span></a> to view all the show notes.</p>",
  "content:encoded": "<p class=\"p1\">Do you have a busy mind?  We often get questions about how to calm and quiet one’s mind in our Kwik Brain Podcast FB Group. We no longer live in the age where we measure success by profit or prestige, but rather by a peace of mind. Do you agree?  Your brain is not designed to work at full steam all the time. So regularly simmering down with these tips and hacks is a brilliant move for your wellbeing in life and career.  Perhaps you wear a lot of hats and have a long list of to-do’s, and your monkey mind can get out of control. And a majority of the time, the thoughts in our heads aren’t always positive. If you’re struggling with that internal chatterbox, then this episode is for you.  I’ll share with you simple questions and tips to get your mind in a more peaceful place when you need it the most.  ** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access.  ** Also, visit <a href= \"http://www.JimKwik.com/podcast\">www.JimKwik.com/podcast</a> to view all the show notes.</p>",
  "enclosure": "",
  "itunes:duration": "17:23",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Do you have a busy mind?  We often get questions about how to calm and quiet one’s mind in our Kwik Brain Podcast FB Group. We no longer live in the age where we measure success by profit or prestige, but rather by a peace of mind. Do you agree? ...",
  "itunes:episodeType": "full"
}