{
  "title": "#578: The Secret Plan To Bring America Back Into The British Empire with Richard Grove",
  "link": "https://www.spreaker.com/user/11759118/tfh-tfh-richard-grove-audio",
  "description": "Thank you so much for tuning in for another episode of Tin Foil Hat with Sam Tripoli. This episode we welcome Richard Grove back to the show for easily one of our best episodes ever.   We dive deep into the British Empire's secret plan to bring America to its knees and back under control of the British Elites.  We go deep on the total banger.  Thank you for your support. <br /><br />Want To See Sam Tripoli Live? Grab Your Tickets at Samtripoli.com<br />June 17th: Tallahassee, Fl- Tin Foil Hat Comedy And Swarm Tank with Sam Tripoli and Eddie Bravo<br /><a href=\"https://bit.ly/3thKmEx\" rel=\"noopener\">https://bit.ly/3thKmEx</a><br /><br />June 18th: Jacksonville, Fl- Tin Foil Hat Comedy And Swarm Tank with Sam Tripoli and Eddie Bravo<br /><a href=\"https://bit.ly/3Q0RFdC\" rel=\"noopener\">https://bit.ly/3Q0RFdC</a><br /><br />June 21st:  Los Angeles, Ca- Assassins Only Live At The 3 Of Clubs<br /><a href=\"https://www.eventbrite.com/e/assassins-only-comedy-show-w-a-killer-secret-lineup-tickets-358818163787\" rel=\"noopener\">https://www.eventbrite.com/e/assassins-only-comedy-show-w-a-killer-secret-lineup-tickets-358818163787</a><br /><br />Please check out Richard Grove's internet:<br /><a href=\"https://www.GetAUTONOMY.info/freedomvault\" rel=\"noopener\">https://www.GetAUTONOMY.info/freedomvault</a> (FREE for all who are conscious enough to get it)<br /><a href=\"https://www.GetAUTONOMY.info/ignite\" rel=\"noopener\">https://www.GetAUTONOMY.info/ignite</a> (What’s your next stage of growth?)<br /><a href=\"https://www.AutonomyUnlimited.com\" rel=\"noopener\">https://www.AutonomyUnlimited.com</a> (Marketing & Distro for Freedom/Liberty Media Producers)<br /><a href=\"https://www.GrandTheftWorld.com\" rel=\"noopener\">https://www.GrandTheftWorld.com</a> (Sundays 9pm EST on Rokfin)<br /> <br /><br />Please check out SamTripoli.com for all things Sam Tripoli.<br /><br />Check out all of our premium content on ROKFIN.com.  <br />Tin Foil Hat Premium: <a href=\"https://rokfin.com/tinfoilhat\" rel=\"noopener\">https://rokfin.com/tinfoilhat</a><br />Zero: <a href=\"https://rokfin.com/zero\" rel=\"noopener\">https://rokfin.com/zero</a><br />Conspiracy Social Club: <a href=\"https://rokfin.com/conspiracysocialclub\" rel=\"noopener\">https://rokfin.com/conspiracysocialclub</a><br />Broken Simulation: <a href=\"https://rokfin.com/brokensimulation\" rel=\"noopener\">https://rokfin.com/brokensimulation</a><br /><br />Thank you to our sponsors:<br />Athleticgreens.com: Athletic Greens daily all-in-one superfood powder is your nutritional essential. It is by far the easiest and most delicious nutritional habit that you can add to your health routine today and empower you to take ownership of your health.Simply visit athleticgreens.com/TINFOIL<br /><br />HelixSleep.com: Just go to Helix Sleep dot com slash tinfoil, take their two-minute sleep quiz, and they’ll match you to a customized mattress that will give you the best sleep of your life. Helix is offering up to 200 dollars off all mattress orders AND two free pillows for our listeners at Helix Sleep dot com slash tinfoil. <br /><br />CopyMyCrypto.com: The ‘Copy my Crypto’ membership site shows you the coins that the youtuber ‘James McMahon’ personally holds - and allows you to copy him. So if you’d like to join the 1300 members who copy James, then stop what you’re doing and head over to: CopyMyCrypto.com/TFH You’ll not only find proof of everything I’ve said - but my listeners get full access for just $1<br /><br />SterlingStockPicker.com: You work hard for your money, don’t you think it’s time to start getting your money to work hard for you? Sterling Stock Picker is a ultra cool stock investing software that is EASY to use and understand. Check out Sterling Stock Picker.com/tinfoil hat for your FREE 14 day trial. That’s sterlingstockpicker.com/tinfoilhat<br /><br />Superspeciosa.com: If you’re feeling unwell, physically or mentally—try kratom. As of now, it’s still considered a legal alternative to controlled substances, and it’s safe.SUPER SPECIOSA offers the purest, highest quality, and highest strength kratom on the market.SUPER SPECIOSA’s kratom is backed by a money back guarantee. Go to GetSuperLeaf.com/SAM, promocode SAM for 20% off.<br /><br />Titan.com: Check out Titan if you want to aim to become the smartest, wealthiest investor you’ve ever been. So head to Titan.com/tinfoil to get $50 when you invest with Titan. You MUST go to this URL or you WILL NOT get that $50 – and they won’t know that we sent you!  That’s $50 when you go to Titan.com/tinfoil and invest with Titan. <br /><br />FUM: Quit naturally with Fum and use TINFOIL to save 10% at breathefum.com/TinFoil<br /><br />American Home Shelid: Keep your home up and running and budget on track with American Home Shield. Right now, [TIN FOIL HAT] listeners can take $50 off their most comprehensive plans ever. Go to a-h-s dot com slash [TINFOIL] now to SAVE $50. That’s a-h-s dot com, slash [TINFOIL] for $50 OFF any plan.<br /><br />TryFirstleaf.com: If you love finding and tasting new wine, Firstleaf is a no-brainer! Join today and you’ll get 6 bottles of wine for $29.95 and free shipping! Just go to TRY Firstleaf dot com slash TINFOIL. That’s 6 bottles of wine for $29.95 and free shipping at TRY Firstleaf dot com slash TINFOIL<br /><br />Go.Factor75.Com: Factor makes it easy for me to eat clean 24/7, with fresh—never frozen—prepared meals that are so delicious, you wouldn’t believe they’re actually good for you.  Head to GO dot FACTOR 75 dot com slash tinfoil120 and use code tinfoil120 to get $120 off. That’s code tinfoil120 at GO dot FACTOR 75 dot com slash tinfoil120 for $120 off.<br /><br />Joymode.com: JOYMODE makes NATURAL and SCIENCE-BACKED sexual wellness products for men. Their Sexual Performance Booster is like a pre-workout, but for sex.  The Sexual Performance Booster is designed to support erection quality and firmness, and sex drive. It contains clinically supported doses of L-Citrulline, Arginine, Yohimbine and Vitamin-C. It was created with best-in-class scientists and biochemistry PhDs. Go to usejoymode.com/TINFOIL or enter TINFOIL at checkout for 20% off your first order.<br /><br />Blue Chew: Visit Blue Chew dot com and get your first shipment free when you use promo code tinfoil. Just pay $5 shipping. That’s B-L-U-E-Chew dot com promo code tinfoil<br /><br />Bespoke Post: Bespoke Post partners with small businesses and emerging brands to bring you the most unique goods every month in the Box of Awesome collections. From travel and outdoor gear to breezy summer styles and grooming goods, Box of Awesome has collections for every part of your life. Get 20% of your first monthly box when you sign up at BoxofAwesome.com and use the promo code \"TinFoil\" at check out!<br /><br />BuckMason.com: Buck Mason’s clothes are second-to-none. They’re timeless and never go out of style. Buck Mason makes all the essentials: jeans, shirts, jackets, all your go-to’s and so much more. Once you try Buck Mason they’ll become your go-to’s too! Head over to Buck Mason dot com slash tinfoil and get a free t-shirt with your first order.<br /><br />Lucy: Some of you are looking for the best, most responsible way to consume their nicotine to relax, focus, or just unwind after a long day. Lucy is a modern oral nicotine company that makes nicotine gum, lozenges, and pouches for adults. If you enjoy using nicotine, you should definitely check out Lucy’s products at lucy.co. That’s LUCY dot Cee Oh and use promo code TINFOIL at check out.<br /><br />AltoIRA.com: Ready to take your investments to the next level? Diversify like the pros and trade without tax headaches. Open an Alto CryptoIRA with as little as $10. Just go to Alto IRA dot com/ FOIL. That’s A- L-T-O-I-R-A dot com/ FOIL. Start investing in cryptocurrency today! Go to Alto IRA dot com/ FOIL.<br /><br />Vesselbrand.com: Vape and dry herb hardware and accessories with unparalleled attention to detail & craftsmanship. While they look breathtaking, the hits are also superior to other products on the market. Each product is engineered with exceptional design, more efficient power usage and to deliver unrestricted airflow. They are having their biggest sale of the year right now: 20% off all products until the end of April for 4/20. So go to VesselBrand.com!<br /><br />BlendersEyewear.com: Blenders has sunglasses, prescription glasses, readers and blue lights, as well as a snow collection with goggles and accessories. To score 15% off your Blenders purchase, visit BLENDERS EYEWEAR dot com and enter promo code TINFOILHATVIP. —Rocked with pride, worldwide.<br /><br />IP... Frequently Podcast:  If you are looking for a funny business podcast with solid business advice, 80’s music and headline news than check the IP... Frequently podcast.  Subscribe to IP... Frequently and stay up-to-date on their weekly stream of episodes wherever you get your podcasts..<br /><br />EveryPlate: EveryPlate is America’s Best Value Meal Kit. While most meal kits come with a premium price tag, EveryPlate offers delicious dinners that won’t break the bank! Give yourself – and your wallet – a break. Enjoy delicious, affordable meals, delivered to your door, and ready to go in just six simple steps. Get started with EveryPlate for just $1.79 per meal by going to EveryPlate dot com and entering code tinfoil179.”<br /><br />BudVac:  BudVac is a one-of-a-kind cannabis stash container that comes with a vacuum pump to extract all the air, allowing cannabis enthusiasts to store their products in an oxygen-free environment. With BudVac's storage jars — you'll be able to taste, smell, and feel the difference! Go to BudVac.com and use promo code TFH at checkout for a 10% discount!<br /><br />Coinbase.com: Coinbase offers a trusted and easy-to-use platform to buy, sell, and spend cryptocurrency. Whether you’re looking to diversify, just getting started, or searching for a better way to access crypto markets, start today - with Coinbase. For a limited time, new users can get $10 in free Bitcoin when you sign up today at Coinbase.com/tinfoil",
  "guid": "vnid://episodes/50206847?media_id=37029504",
  "pubDate": "Tue, 14 Jun 2022 22:03:10 +0000",
  "enclosure": "",
  "itunes:author": "Sam Tripoli",
  "itunes:subtitle": "Thank you so much for tuning in for another episode of Tin Foil Hat with Sam Tripoli. This episode we welcome Richard Grove back to the show for easily one of our best episodes ever.   We dive deep into the British Empire's secret plan to bring...",
  "itunes:summary": "Thank you so much for tuning in for another episode of Tin Foil Hat with Sam Tripoli. This episode we welcome Richard Grove back to the show for easily one of our best episodes ever.   We dive deep into the British Empire's secret plan to bring America to its knees and back under control of the British Elites.  We go deep on the total banger.  Thank you for your support. <br /><br />Want To See Sam Tripoli Live? Grab Your Tickets at Samtripoli.com<br />June 17th: Tallahassee, Fl- Tin Foil Hat Comedy And Swarm Tank with Sam Tripoli and Eddie Bravo<br /><a href=\"https://bit.ly/3thKmEx\" rel=\"noopener\">https://bit.ly/3thKmEx</a><br /><br />June 18th: Jacksonville, Fl- Tin Foil Hat Comedy And Swarm Tank with Sam Tripoli and Eddie Bravo<br /><a href=\"https://bit.ly/3Q0RFdC\" rel=\"noopener\">https://bit.ly/3Q0RFdC</a><br /><br />June 21st:  Los Angeles, Ca- Assassins Only Live At The 3 Of Clubs<br /><a href=\"https://www.eventbrite.com/e/assassins-only-comedy-show-w-a-killer-secret-lineup-tickets-358818163787\" rel=\"noopener\">https://www.eventbrite.com/e/assassins-only-comedy-show-w-a-killer-secret-lineup-tickets-358818163787</a><br /><br />Please check out Richard Grove's internet:<br /><a href=\"https://www.GetAUTONOMY.info/freedomvault\" rel=\"noopener\">https://www.GetAUTONOMY.info/freedomvault</a> (FREE for all who are conscious enough to get it)<br /><a href=\"https://www.GetAUTONOMY.info/ignite\" rel=\"noopener\">https://www.GetAUTONOMY.info/ignite</a> (What’s your next stage of growth?)<br /><a href=\"https://www.AutonomyUnlimited.com\" rel=\"noopener\">https://www.AutonomyUnlimited.com</a> (Marketing & Distro for Freedom/Liberty Media Producers)<br /><a href=\"https://www.GrandTheftWorld.com\" rel=\"noopener\">https://www.GrandTheftWorld.com</a> (Sundays 9pm EST on Rokfin)<br /> <br /><br />Please check out SamTripoli.com for all things Sam Tripoli.<br /><br />Check out all of our premium content on ROKFIN.com.  <br />Tin Foil Hat Premium: <a href=\"https://rokfin.com/tinfoilhat\" rel=\"noopener\">https://rokfin.com/tinfoilhat</a><br />Zero: <a href=\"https://rokfin.com/zero\" rel=\"noopener\">https://rokfin.com/zero</a><br />Conspiracy Social Club: <a href=\"https://rokfin.com/conspiracysocialclub\" rel=\"noopener\">https://rokfin.com/conspiracysocialclub</a><br />Broken Simulation: <a href=\"https://rokfin.com/brokensimulation\" rel=\"noopener\">https://rokfin.com/brokensimulation</a><br /><br />Thank you to our sponsors:<br />Athleticgreens.com: Athletic Greens daily all-in-one superfood powder is your nutritional essential. It is by far the easiest and most delicious nutritional habit that you can add to your health routine today and empower you to take ownership of your health.Simply visit athleticgreens.com/TINFOIL<br /><br />HelixSleep.com: Just go to Helix Sleep dot com slash tinfoil, take their two-minute sleep quiz, and they’ll match you to a customized mattress that will give you the best sleep of your life. Helix is offering up to 200 dollars off all mattress orders AND two free pillows for our listeners at Helix Sleep dot com slash tinfoil. <br /><br />CopyMyCrypto.com: The ‘Copy my Crypto’ membership site shows you the coins that the youtuber ‘James McMahon’ personally holds - and allows you to copy him. So if you’d like to join the 1300 members who copy James, then stop what you’re doing and head over to: CopyMyCrypto.com/TFH You’ll not only find proof of everything I’ve said - but my listeners get full access for just $1<br /><br />SterlingStockPicker.com: You work hard for your money, don’t you think it’s time to start getting your money to work hard for you? Sterling Stock Picker is a ultra cool stock investing software that is EASY to use and understand. Check out Sterling Stock Picker.com/tinfoil hat for your FREE 14 day trial. That’s sterlingstockpicker.com/tinfoilhat<br /><br />Superspeciosa.com: If you’re feeling unwell, physically or mentally—try kratom. As of now, it’s still considered a legal alternative to controlled substances,...",
  "itunes:duration": 6982,
  "itunes:explicit": "yes",
  "itunes:image": "",
  "itunes:episodeType": "full"
}