{
  "id": "tag:blogger.com,1999:blog-8698702854482141883.post-1711132641026524221",
  "published": "2022-06-22T09:00:00.002-07:00",
  "updated": "2022-09-06T14:16:18.316-07:00",
  "category": [
    "",
    ""
  ],
  "title": "Establishing new baselines:  Identifying open source work in an unstable world",
  "content": "For more than 17 years, Google's Open Source Programs Office (OSPO) has brought the best of open source to Google and the best of Google to open source. We sponsor, create, and invest in projects and programs that <b>enable everyone</b> to join and contribute to the global open source ecosystem. Because that's who open source is for—<b>everyone.</b><br /><br />In 2021, Google <a href=\"https://blog.google/technology/safety-security/shared-success-in-building-a-safer-open-source-community/\" target=\"_blank\">supported open source innovation, security, collaboration, and sustainability through our programs and services</a> with $15 million of funding. This includes $7 million in direct funding to open source communities through Google’s OSPO. We also stepped up our investments in the governing organizations of open source ecosystems. We became <a href=\"https://pyfound.blogspot.com/2021/02/welcoming-google-as-visionary-sponsor.html\" target=\"_blank\">the first Visionary Sponsor of the Python Software Foundation</a>, supporting a number of key initiatives including funding for the first <a href=\"https://lukasz.langa.pl/a072a74b-19d7-41ff-a294-e6b1319fdb6e/\" target=\"_blank\">CPython Developer in Residence</a>. We sustained our <a href=\"https://openjsf.org/about/members/\" target=\"_blank\">Platinum Membership of the OpenJS Foundation</a> to continue supporting the essential work of the foundation that fosters many critical projects in the Javascript ecosystem.<br /><br />In late 2021, we <a href=\"https://opensource.googleblog.com/2021/11/announcing-knative-10_0887375769.html\" target=\"_blank\">announced the release of Knative 1.0</a> and <a href=\"https://opensource.googleblog.com/2021/11/Knative-applies-to-become-CNCF-incubating-project.html\" target=\"_blank\">submitted Knative to become a Cloud Native Computing Foundation incubation project</a> to enable the next phase of community-driven innovation. (Knative’s application <a href=\"https://www.cncf.io/blog/2022/03/02/knative-accepted-as-a-cncf-incubating-project/\" target=\"_blank\">was accepted in March 2022</a> and followed by our <a href=\"https://cloud.google.com/blog/products/open-source/submitting-istio-project-to-the-cncf\" target=\"_blank\">submission of Istio to the CNCF</a>). We also <a href=\"https://opensource.googleblog.com/2021/11/Open%20source%20DDR%20controller%20framework%20for%20mitigating%20Rowhammer.html\" target=\"_blank\">collaborated with Antmicro to develop and release the Rowhammer Tester platform</a>, which provides security professionals a flexible platform for experimenting with new types of attacks to find better mitigation techniques. <br /><h2 style=\"text-align: left;\">We sustain and expand the open source ecosystem through programs at scale</h2>In addition to our new investments, we continued to maintain our long-term programs elevating open source contributors, both new and existing.<br /><ul style=\"text-align: left;\"><li>The <b>Google Open Source Live</b> <a href=\"https://opensourcelive.withgoogle.com/\" target=\"_blank\">virtual events program</a>, initiated in 2020, hosted 11 events, expanding to cover more projects and technology areas.</li></ul><ul style=\"text-align: left;\"><li>We launched <a href=\"https://goo.gle/LearnK8s-live\" target=\"_blank\">Learn Kubernetes with Google series</a> to provide <a href=\"https://goo.gle/LearnK8s\" target=\"_blank\">specific technical content</a> and live panels with experts from across the industry, focusing on how to make Kubernetes work best for you and your environment.</li></ul><ul style=\"text-align: left;\"><li><b>Google Summer of Code</b>, <a href=\"https://opensource.googleblog.com/2021/08/google-summer-of-code-2021-results-announced.html\" target=\"_blank\">in its 17th year</a>, matched 1,205 students from 67 countries with more than 2,100 mentors from 75 countries in 199 open source organizations to successfully complete this year’s program. At the end of this round, we announced our plans to <a href=\"https://opensource.googleblog.com/2021/11/expanding-google-summer-of-code-in-2022.html\" target=\"_blank\">broaden the scope of the program in 2022</a>, expanding the eligibility of who could participate, offering more options around project contribution, and increased flexibility in the timing of the program.</li></ul><ul style=\"text-align: left;\"><li><b>Season of Docs</b>, <a href=\"https://opensource.googleblog.com/2021/12/Season%20of%20Docs%20announces%20results%20of%202021%20program.html\" target=\"_blank\">in its third year</a>, had 30 open source organizations finish their projects with 93% of organizations and 96% of the technical writers reporting a positive experience with the program.</li></ul><ul style=\"text-align: left;\"><li>Through our <b>Open Source Peer Bonus Program</b>, we were able to award peer bonuses to 175 contributors working in 35 countries on 86 unique projects, including contributors to the <a href=\"https://chaoss.community/\" target=\"_blank\">CHAOSS</a>, <a href=\"https://cocoapods.org/\" target=\"_blank\">CocoaPods</a>, <a href=\"https://git-scm.com/\" target=\"_blank\">git</a> and <a href=\"https://github.com/opencivicdata\" target=\"_blank\">Open Civic Data</a> projects.</li></ul>In 2021, Google's open source programs directly supported more than 120 events to safely bring together more than 88,000 attendees from open source communities. We proudly sponsored <a href=\"https://2021.allthingsopen.org/ato-2021-summary-and-overview/\" target=\"_blank\">All Things Open 2021</a>, which had nearly 5,000 registered participants from 86 countries. We were also a Cornerstone Sponsor for <a href=\"https://archive.fosdem.org/2021/\" target=\"_blank\">FOSDEM 2021's two-day virtual gathering</a>.<br /><div><h2 style=\"text-align: left;\">Our contributing population continues to scale with the growth of Alphabet</h2>In 2021, roughly 10% of Alphabet's full-time workforce (FTEs) actively contributed code or code-adjacent work to open source projects. This percentage has remained roughly consistent over the last five years, indicating that our open source contribution has continued to scale with the growth of Alphabet. Note that in 2021, FTEs represented over 95% of our open source contributors, while the remainder includes vendors, independent contractors, temporary staff, and interns that have contributed to open source projects during their tenure at Alphabet.<br /><br />After <a href=\"https://opensource.googleblog.com/2021/08/metrics-spikes-and-uncertainty-open-source-contribution-during-a-global-pandemic.html\" target=\"_blank\">2020’s atypical growth</a>—which was largely due to novel programs such as our <a href=\"https://blog.google/inside-google/life-at-google/google-internships-go-virtual-help-open-source/\" target=\"_blank\">open source internships</a> and <a href=\"https://opensource.googleblog.com/2020/06/covid-19-how-google-is-helping-open.html\" target=\"_blank\">COVID-19 response</a>&nbsp;work—in 2021, our activity numbers returned to pre-pandemic baselines. Over the last five years, the trajectory of monthly active usage has increased on both GitHub and Git-on-Borg by more than 15% on average each year.<br /><br />Note that the dip in GitHub data reported in October of 2021 corresponds to an <a href=\"https://github.com/igrigorik/gharchive.org/issues/261\" target=\"_blank\">outage</a> on <a href=\"https://www.gharchive.org/\" target=\"_blank\">GHarchive</a> resulting in 4+ days of lost data (see figure below). Despite this outage, contribution levels remained fairly consistent month over month: more than 45% of our active contributing population for the year logged an activity on GitHub or Git-on-Borg in an average month.<table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgh7aMxZUxG5qCPtzjgrpumlJyL2Rh2K4WBPZN1VfYdBAs2LzO7xG9tY4hnn66R8B6ksiYHeaJSFeYPdo6UEiyUWSCUion0SjyM9GzJZOeGxcI8XVYlKApcEaii_bN-ITwZXC8ggxDxDyf2fxxfV1T1tQFcQ-eH1ugpSuOMG50G35IIg6i58ZXljZVk/s1200/image1%20copy%209.png\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"742\" data-original-width=\"1200\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgh7aMxZUxG5qCPtzjgrpumlJyL2Rh2K4WBPZN1VfYdBAs2LzO7xG9tY4hnn66R8B6ksiYHeaJSFeYPdo6UEiyUWSCUion0SjyM9GzJZOeGxcI8XVYlKApcEaii_bN-ITwZXC8ggxDxDyf2fxxfV1T1tQFcQ-eH1ugpSuOMG50G35IIg6i58ZXljZVk/s16000/image1%20copy%209.png\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\"><span style=\"text-align: left;\">For more details about the source data and analysis cited in this report, see “</span><b style=\"text-align: left;\">About this data.</b></td></tr></tbody></table></div><span style=\"text-align: left;\">” below.</span><div><h2 style=\"text-align: left;\">The number of Alphabet open source projects remains steady</h2>In 2021, we estimated that more than 2,000 open source projects that originated from Alphabet teams and employees were still active (not archived). To make this estimate, we chose a broad and variable definition of an open source project, including developer tools, utilities, languages, frameworks, libraries, demos, sample code, models, raw data, designs, and more. This estimate also includes personal projects that went through <a href=\"https://opensource.google/documentation/reference/releasing\" target=\"_blank\">Alphabet's releasing process</a> but not projects that have been moved to or originated under external organizations or foundations.<br /><br />Project counts should not be confused with repositories; projects can include many repositories. Within Alphabet, we maintain more than 9,500 public repositories on Github and 1,700 public repositories on Git-on-Borg. While these efforts originated at Google and Alphabet, these repositories are open for anyone to use, contribute to, fork or build on through open source licenses. In 2021, more than 500,000 unique GitHub accounts not affiliated with Alphabet employees contributed to Alphabet projects.<br /><h2 style=\"text-align: left;\">The majority of repositories we work on are outside of Alphabet organizations</h2>Open source contributors at Alphabet work on a variety of projects and repositories—not just our own code. In 2021, contributors at Alphabet engaged with more than 70,000 repositories on GitHub (<a href=\"https://docs.github.com/en/developers/webhooks-and-events/github-event-types#watchevent\" target=\"_blank\">WatchEvents</a> or “stars” were removed from this count to represent active engagement), pushing commits and/or opening pull requests on over 49,000 repositories. Consistent with our 2019 and 2020 reports, more than 75% of repositories with pull requests opened by Alphabet contributors on GitHub were outside of Google-managed organizations.</div><div><h2 style=\"text-align: left;\">We continue to invest in open source quality, security, and long term viability</h2>Alphabet continues to rely on the health and availability of open source projects. Through internal efforts and collaboration with industry-led efforts such as <a href=\"https://openssf.org/news/\" target=\"_blank\">OpenSSF</a>, Alphabet is committed to sharing relevant practices and tooling with the goal of improving overall code quality and bolstering the security posture of users and developers of open source software. We hope that by sharing our <a href=\"https://security.googleblog.com/2021/02/know-prevent-fix-framework-for-shifting.html\" target=\"_blank\">internal frameworks and best practices</a>, we can spark industry-wide discussion and progress on the security and sustainability of the open source ecosystem.<br /><br />In 2021, we launched <a href=\"https://opensource.googleblog.com/2021/06/introducing-open-source-insights-project.html\" target=\"_blank\">Open Source Insights</a>, a tool designed to list and visualize a project’s dependencies and their properties, helping developers review the packages that make up their software supply chains. The potential of this tool was put to the test after the disclosure of Log4j&nbsp;<a href=\"https://nvd.nist.gov/vuln/detail/CVE-2021-44228\" target=\"_blank\">vulnerabilities</a> in December 2021. The <a href=\"https://security.googleblog.com/2021/12/understanding-impact-of-apache-log4j.html\" target=\"_blank\">Open Source insights team reported </a>that more than 35,000 Java packages, amounting to over 8% of the <a href=\"https://www.maven.org/\" target=\"_blank\">Maven Central repository</a>, were impacted by this vulnerability. As part of their investigation, they compiled a <a href=\"https://commondatastorage.googleapis.com/log4j_vulnerability/log4j_top_500_dependents.csv\" target=\"_blank\">list of 500 affected packages</a> with some of the highest transitive usage to guide users and maintainers who were supporting patching and remediation activities.<br /><br />In 2021, we also <a href=\"https://security.googleblog.com/2021/10/introducing-secure-open-source-pilot.html\" target=\"_blank\">announced our sponsorship</a> of the <a href=\"https://sos.dev/\" target=\"_blank\">Secure Open Source (SOS) Rewards pilot program</a> run by the Linux Foundation. This program financially rewards developers for enhancing the security of critical open source projects that we all depend on.<br /><br />These efforts build on our existing open source security work, such as <a href=\"https://github.com/google/oss-fuzz\" target=\"_blank\">OSS Fuzz</a>, which was used by over 500 critical open source projects in 2021 and has helped find more than <a href=\"https://bugs.chromium.org/p/oss-fuzz/issues/list?q=type%3Dbug-security%20-status%3Aduplicate%2Cwontfix&amp;can=1\" target=\"_blank\">7,000 vulnerabilities</a> to date.<br /><br />Our open source work will continue to grow and evolve to support the changing needs of our communities. Thank you to our colleagues and community members that continue to dedicate their personal and professional time supporting the open source ecosystem. Follow our work at <a href=\"https://opensource.google/\" target=\"_blank\">opensource.google</a>.<br /><br /><i>By Sophia Vargas – Research Analyst and Amanda Casari, Open Source Researcher – Google Open Source Programs Office<br /></i><br /><h4 style=\"text-align: left;\"></h4><h3 style=\"text-align: left;\">About this data:&nbsp;</h3>This report features metrics provided by many teams and programs across Alphabet. In regards to the data centered on code and code adjacent activities, we wanted to share more details about the derivation of those metrics:<br /><ul style=\"text-align: left;\"><li><b>Data source:</b> These data represent activities on repositories hosted on GitHub and our internal production Git service <a href=\"https://opensource.google/docs/glossary/#gitonborg\" target=\"_blank\">git-on-borg</a>. These sources represent a <a href=\"https://arxiv.org/abs/2106.15611\" target=\"_blank\">subset of open source activity</a> currently tracked by our OSPO.</li></ul><ul style=\"text-align: left;\"><ul><li><b>GitHub:</b> We continue to use <a href=\"https://www.gharchive.org/\" target=\"_blank\">GitHub Archive</a> as the primary source for GitHub data, which is available as a public dataset on <a href=\"https://cloud.google.com/bigquery\" target=\"_blank\">BigQuery</a>. Alphabet activity within GitHub is identified by <a href=\"https://opensource.google/docs/github/accounts/#register\" target=\"_blank\">self-registered accounts</a>, which we estimate underreports actual activity.</li></ul></ul><ul style=\"text-align: left;\"><ul><li><b>git-on-borg: </b>This is our primary platform for internal projects and some of our larger, long running public projects like Android and Chromium. While we continue to develop on this platform, most of our open source activity has <a href=\"https://opensource.google/docs/releasing/hosting/\" target=\"_blank\">moved to GitHub</a> to increase exposure and encourage community growth.</li></ul></ul><ul style=\"text-align: left;\"><ul><li><b>Distinct event types:</b> Note that git-on-borg and GitHub APIs produce distinct sets of events—as such we will report activity metrics per platform. Where GitHub <a href=\"https://docs.github.com/en/developers/webhooks-and-events/events/github-event-types\" target=\"_blank\">Event</a> logs capture a wide range of activity from code creation and review to issue creation and comments, the Gerrit <a href=\"https://gerrit-review.googlesource.com/Documentation/cmd-stream-events.html\">Event</a> stream (used by git-on-borg) only captures code changes and reviews.</li></ul></ul><ul style=\"text-align: left;\"><li><b>Driven by humans: </b>We have created many automated bots and systems that can propose changes on various hosting platforms. We have intentionally filtered these data to focus on human-initiated activities. For our estimation of bots, we married our own records with a public list maintained by the <a href=\"https://github.com/cncf/devstats/blob/master/util_sql/only_bots.sql\" target=\"_blank\">devstats</a> project</li></ul><ul style=\"text-align: left;\"><li><b>Business and personal: </b>Activity on GitHub reflects a mixture of Alphabet projects, third party projects, experimental efforts, and personal projects. Our metrics report on all of the above unless otherwise specified.</li></ul><ul style=\"text-align: left;\"><li><b>Alphabet contributors:</b> Please note that unless additional detail is specified, activity counts attributed to Alphabet open source contributors will include our full-time employees as well as our extended Alphabet community (temps, vendors, contractors, and interns).</li></ul><ul style=\"text-align: left;\"><li><b>GitHub Accounts:</b> For counts of Github accounts not affiliated with Alphabet, we cannot assume that 1 account translates to 1 person - as multiple accounts could be tied to one individual or bot accounts.</li></ul><ul style=\"text-align: left;\"><li><b>Active counts:</b> Where possible, we will show ‘active users’ defined by logged activity within a specified timeframe (i.e. in month, year, etc) and ‘active repositories’ and ‘active projects’ as those that have not been archived.</li></ul><ul style=\"text-align: left;\"><li><b>Activity types:</b> This year we explore GitHub activity types in more detail. Note that in some cases we have removed “Watch Events” or articulated this as passive engagement. Additionally, GitHub added an event type “PullRequestReviewEvent” that started logging activity in August 2020, but we chose to remove this from our charts and aggregate counts as it invalidates year over year comparisons.</li></ul></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Open Source Programs Office",
    "uri": "http://www.blogger.com/profile/11192158996903493674",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}