{
  "id": "tag:blogger.com,1999:blog-2471378914199150966.post-4747549341167461823",
  "published": "2022-03-03T12:21:00.000-08:00",
  "updated": "2022-03-03T12:21:46.433-08:00",
  "category": "",
  "title": "Chrome 100 Beta: Reduced User-Agent Strings, Multi-Screen Window Placement, and More",
  "content": "<p>Unless otherwise noted, changes described below apply to the newest Chrome beta channel release for Android, Chrome OS, Linux, macOS, and Windows. Learn more about the features listed here through the provided links or from the list on <a href=\"https://www.chromestatus.com/features#milestone%3D76\">ChromeStatus.com</a>. Chrome 100 is beta as of March 3. 2022. You can <a href=\"https://www.blogger.com/blog/post/edit/2471378914199150966/133027011330334491#\">download the latest on Google.com</a> for desktop or on Google Play Store on Android. </p> <h1>Last Version for Unreduced User-Agent String</h1><p>Chromium 100 will be the last version to support an unreduced User-Agent string by default (as well as the related <code>navigator.userAgent</code>, <code>navigator.appVersion</code>, and <code>navigator.platform</code> DOM APIs). The origin trial that <a href=\"https://developer.chrome.com/origintrials/#/view_trial/-7123568710593282047\">allowed sites to test the fully reduced User-Agent</a> will end on April 19, 2022. After that date, the User-Agent String will be gradually reduced. To review the whole schedule, see <a href=\"https://blog.chromium.org/2021/09/user-agent-reduction-origin-trial-and-dates.html\">Chromium Blog: User-Agent Reduction Origin Trial and Dates</a>. Sites that need more time to test or <a href=\"https://web.dev/migrate-to-ua-ch/\">migrate to User-Agent Client Hints</a> can enroll in the deprecation origin trial <a href=\"https://developer.chrome.com/origintrials/#/view_trial/2608710084154359809\">scheduled from Chrome 100 to 113</a>, inclusive. In contrast to the first origin trial, which previews the fully reduced User-Agent string, the deprecation trial maintains the legacy User-Agent. The deprecation trial is expected to end in late May of 2023. </p> <p>This is part of a strategy to replace use of the User-Agent string with the<br />new User-Agent Client Hints API. To learn about User-Agent Client Hints, see <a href=\"https://web.dev/migrate-to-ua-ch/\">Migrate to User-Agent Client Hints</a> and <a href=\"https://web.dev/user-agent-client-hints/\">Improving user privacy and developer experience with User-Agent Client Hints</a>.</p> <h1>Multi-Screen Window Placement</h1><p>The Multi-Screen Window Placement API, now available on desktop, lets you enumerate the displays connected to your machine and to place windows on specific screens. This unlocks use cases like multi-window apps that need to accurately position certain windows. It also adds a new <code>screen</code> option to the <code>Element.requestFullscreen()</code> method which allows you to determine which screen to start a full screen view on.</p><p></p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/a/AVvXsEgtGhn3kNRSGWBRGewgC3BYz3fi5IAnL0sp_imdTkye0m4l43OuJjTAPn85Hj3_YhJm4JCHuebIJXuvoGSuWgnIBDy3hBLysDRxvNchVlJc1OukR5q1aMTnvV2JrFE96IhiOShpq6Nc6nOpnrHI3L-WCEhEqnnH1uJACOeOaIN_Sv8J8_NuxNM-RJp5rw=s571\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"A multi-screen setup.\" border=\"0\" data-original-height=\"532\" data-original-width=\"571\" height=\"298\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEgtGhn3kNRSGWBRGewgC3BYz3fi5IAnL0sp_imdTkye0m4l43OuJjTAPn85Hj3_YhJm4JCHuebIJXuvoGSuWgnIBDy3hBLysDRxvNchVlJc1OukR5q1aMTnvV2JrFE96IhiOShpq6Nc6nOpnrHI3L-WCEhEqnnH1uJACOeOaIN_Sv8J8_NuxNM-RJp5rw=w320-h298\" title=\"A multi-screen setup.\" width=\"320\" /></a></div><br />&nbsp; <br /><br />New use cases include:<p></p> <ul><li>A slideshow app presenting on a projector, while showing speaker notes on a laptop screen.</li><li>A financial app opening a dashboard of windows across multiple monitors.</li><li>A medical app opening images (for example, x-rays) on a high-resolution grayscale display.</li><li>A creativity app showing secondary windows (for example, a palette) on a separate screen.</li><li>Multi-screen layouts in gaming, signage, artistic, and other types of apps.</li></ul> <p>For more information, see <a href=\"https://web.dev/multi-screen-window-placement/\">Managing several displays with the Multi-Screen Window Placement API</a>. </p> <h1>Origin Trials</h1><p>This version of Chrome introduces the origin trials described below. Origin trials allow you to try new features and give feedback on usability, practicality, and effectiveness to the web standards community. To register for any of the origin trials currently supported in Chrome, including the ones described below, visit the <a href=\"https://developers.chrome.com/origintrials/#/trials/active\">Chrome Origin Trials dashboard</a>. To learn more about origin trials in Chrome, visit the <a href=\"https://web.dev/origin-trials/\">Origin Trials Guide for Web Developers</a>. Microsoft Edge runs its own origin trials separate from Chrome. To learn more, see the <a href=\"https://developer.microsoft.com/en-us/microsoft-edge/origin-trials/\">Microsoft Edge Origin Trials Developer Console</a>. </p> <h2>Continuing Origin Trials</h2><p>The following origin trial is being extended to the listed version.</p> <h3>Media Source Extensions in Workers</h3><p>Chrome is continuing an origin trial for making the Media Source Extensions (MSE) API <a href=\"https://developer.chrome.com/origintrials/#/view_trial/3847199981681246209\">available from dedicated workers</a>. This feature improves performance when buffering playing media in an <code>HTMLMediaElement</code> on the main Window. By creating a <code>MediaSource</code> object in a dedicated worker, an application may then create an ObjectURL for it and call <code>postMessage()</code> to pass that URL to the main thread for attaching to an <code>HTMLMediaElement</code>. The context that created the <code>MediaSource</code> object may then use it to buffer media. Web authors have consistently requested that MSE be available from Worker contexts. This extended origin trial is expected to end in Chrome 103, in late July 2022.</p> <h2>Completed Origin Trials</h2><p>The following feature, previously in a Chrome origin trial, is now enabled by default.</p> <h3>Digital Goods API</h3><p>Chrome now provides an API for querying and managing digital products to facilitate in-app purchases from web applications. The new API works with the Payment Request API, which is used for the actual purchases. The API can be linked to a digital distribution service connected through the user agent. In Chromium, this is specifically a web API wrapper around the Android Play Billing API.</p> <p>This API lets web apps in the Play Store accept purchases for digital goods. (Play policies prevent them from accepting payment via any other method.) Without this, websites that sell digital goods are not installable through the Play Store.</p> <p>For more information, see <a href=\"https://developer.chrome.com/docs/android/trusted-web-activity/receive-payments-play-billing/\">Receive Payments via Google Play Billing with the Digital Goods API and the Payment Request API - Chrome Developers</a>.</p> <h1>Other Features in this Release</h1> <h2>AbortSignal.prototype.throwIfAborted()</h2><p>Chrome now <a href=\"https://www.chromestatus.com/feature/5029737100476416\">throws an <code>AbortSignal</code> object's reason</a> if the signal is aborted. This convenience method allows signal-handling functions to check a signal's abort status and propagate the abort reason. For example, it could be called after asynchronous operations that might change a signal's state.</p> <p>Abort signal handling functions often need to check the signal's status and propagate the error if the signal has been aborted. This provides a convenient and consistent way to do this. An example is already <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/AbortSignal/throwIfAborted#examples\">available on MDN</a>.</p> <h2>Capability Delegation</h2><p>Capability delegation means allowing a frame to relinquish its ability to call a restricted API and transfer that ability to a (sub) frame it trusts. If an app wants to delegate its ability to call a restricted JavaScript feature (for example, popups, or fullscreen) to a known and trusted third-party frame, this API allows it to transfer this ability to the target frame for a specified period. This is in contrast to static mechanisms such as an iframe's allow attributes. </p> <p>Many merchant websites host their online store on their own domain but outsource the payment collection and processing infrastructure to a payment service provider (PSP) to comply with security and regulatory complexities around card payments. This workflow is implemented as a \"pay\" button inside the top (merchant) frame where it can blend better with the rest of the merchant's website, and payment request code inside a cross-origin iframe from the PSP. The <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Payment_Request_API\">Payment Request API</a> used by the PSP code is gated by transient user activation (to prevent malicious attempts like unattended or repeated payment requests). Because the top (merchant) frame's user interaction is not visible to the iframe, the PSP code needs to delegate in response to a click in the top frame before it can start payment processing.</p> <h2>HIDDevice forget()</h2><p>The <a href=\"https://www.google.com/url?q=https://web.dev/hid/%23revoke-access&amp;sa=D&amp;source=docs&amp;ust=1646065188537268&amp;usg=AOvVaw3UTyzaYw6yA6VnrI8f54Hd\"><code>HIDDevice</code> <code>forget()</code> method</a> allows web developers to voluntarily revoke a permission to an HIDDevice that was granted by a user. Some sites may not be interested in retaining long-term permissions to access HID devices. For example, for an educational web application used on a shared computer with many devices, a large number of accumulated user-generated permissions creates a poor user experience.<br /><br />In addition to user agent mitigations to avoid this problem, such as defaulting to a session scoped permission on the first request or expiring infrequently used permissions, it should be possible for the site itself to clean up user-generated permissions it no longer needs.</p> <h2>mix-blend-mode: \"plus-lighter\"</h2><p>The <code>mix-blend-mode</code> property now <a href=\"https://www.chromestatus.com/feature/5677338286096384\">supports the <code>\"plus-lighter\"</code> value</a>, which adds the source and destination colors multiplied by their respective alphas. This operation is useful when crossfading between two elements that contain common pixels. In that case, <code>\"plus-lighter\"</code> ensures that the common pixels do not change in appearance as opacity changes from 0 to 1 on one element and from 1 to 0 on the other.</p> <h2>Sec-CH-UA-WoW64 Client Hint</h2><p>This hint serves solely as a backwards compatible shim for sites relying on \"WoW64-ness\" (32-bit apps running in 64-bit Windows) as they <a href=\"https://web.dev/migrate-to-ua-ch/\">transition from the User-Agent string to UA-CH</a>. It returns a boolean value.</p> <h2>SerialPort Integration with WritableStream Controller's Abort Signal</h2><p>When using <code>WritableStream</code>, serial ports <a href=\"https://www.chromestatus.com/feature/4778232531386368\">can now be closed without waiting</a> for all write operations to finish. If the port is waiting for the peer device to provide a flow control signal it could be blocked indefinitely. The intent of aborting a <code>WritableStream</code> is to immediately stop writing data to the underlying sink. </p> <h2>TLS ALPN Extension in wss-schemed WebSockets Connections</h2><p>The TLS ALPN extension is <a href=\"https://www.chromestatus.com/feature/5687059162333184\">now included when initiating a new connection</a> for wss-schemed <code>WebSockets</code>, offering just the default \"http/1.1\" protocol. Currently, unlike HTTPS connections, such connections do not offer ALPN at all. Changing this aligns with Firefox and Safari, hardens against cross-protocol attacks (ALPACA, for example), and makes wss eligible for the false start optimization. It also simplifies work on the HTTPS DNS record.</p> <h2>Web NFC: NDEFReader makeReadOnly()</h2><p>The <a href=\"https://www.google.com/url?q=https://web.dev/nfc/%23make-read-only&amp;sa=D&amp;source=docs&amp;ust=1646065188538039&amp;usg=AOvVaw3p-6rssvNSRjDA4HXKzooW\"><code>NDEFReader</code> <code>makeReadOnly()</code> method</a> allows web developers to make NFC tags permanently read-only with Web NFC.</p> <h2>WebTransport serverCertificateHashes Option</h2><p>In <code>WebTransport</code>, <a href=\"https://chromestatus.com/feature/5690646332440576\">the <code>serverCertificateHashes</code> option</a> allows a website to connect to a web transport server by authenticating the certificate against the expected certificate hash instead of using the Web public key infrastructure (PKI).</p> <p>This feature allows Web developers to connect to WebTransport servers that would normally find obtaining a publicly trusted certificate challenging, such as hosts that are not publically routable, or virtual machines that are ephemeral in nature.</p> <h1>Deprecations, and Removals</h1><p>This version of Chrome has only one deprecation, described <a href=\"#Last-Version-for-Unreduced-User-Agent-String\">at the top of this article</a>. <br />Visit ChromeStatus.com for lists of <a href=\"https://www.chromestatus.com/features#browsers.chrome.status%3A%22Deprecated%22\">ongoing deprecations</a>  and <a href=\"https://www.chromestatus.com/features#browsers.chrome.status:%22Removed%22\">previous removals</a>.<br /><br /></p>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Chromium Blog",
    "uri": "http://www.blogger.com/profile/06394244468194711527",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}