{
  "title": "The Biden Administration’s Electric Vehicle Gambit Is Illegal and Costly",
  "link": "https://www.heritage.org/government-regulation/commentary/the-biden-administrations-electric-vehicle-gambit-illegal-and",
  "description": "<p>Congress has repeatedly rejected radical climate change policies that would increase the price of energy. Now, President Joe Biden is circumventing the legislative branch by moving to force people into using electric vehicles. This plan would impose the costliest regulatory burden ever inflicted on the public.</p>\n\n<p>The vast majority of people don’t support phasing out and eventually banning the sale of internal combustion engine cars. At a time of record high inflation and a very expensive new and used vehicle market, these regulations raise the cost of gas-powered cars to push people toward EVs that are, on average, $18,000 more.</p>\n\n<p>The opening gambit of Biden's plan has three main components. First, the Environmental Protection Agency promulgated new emissions standards for cars and trucks—standards that can be met only by electrification of at least 17% of the new fleet. Second, the EPA and the Department of Transportation worked together to bless California’s reimplementation of its separate (and illegal) greenhouse gas vehicle emissions standards and electric car mandate. Third, the Transportation Department set fuel-economy standards that cannot be achieved without electrification and that explicitly incorporate California’s electric car quota into their “baseline.” Manufacturers that don’t sell enough EVs have to buy credits or pay fines, increasing the price of all nonelectric cars. The EPA estimates the price hikes will reach thousands of dollars per car.</p>\n\n<p>All of this is illegal.</p>\n\n<p><strong>>>> <a href=\"https://www.heritage.org/energy-economics/commentary/washington-knows-best-what-car-you-should-drive-electric-vehicles\">Washington Knows Best What Car You Should Drive: Electric Vehicles. Seriously?</a></strong></p>\n\n<p>The 1975 Energy Policy and Conservation Act grants the Transportation Department <i>sole </i>authority to regulate fuel economy for the entire nation and forbids states from making laws that are even “related to” fuel economy. Moreover, the law explicitly prohibits the department from “considering” electric vehicles in setting these standards.</p>\n\n<p>Under the Clean Air Act, Congress gave the EPA authority to regulate pollutants from the tailpipe. California could request permission to impose separate standards under a narrow set of circumstances, given its unique topography and challenge with smog. Historically, the EPA and California have not used this authority to regulate greenhouse gas emissions from cars, both because it’s a stretch under the Clean Air Act and because there is a direct, scientifically verified relationship between fuel economy and carbon emissions.</p>\n\n<p>The Supreme Court directed the EPA to change course in 2007, stating that there was no reason to believe the Transportation Department and the EPA could not regulate harmoniously. Both the Obama and Trump administrations issued joint rules by both agencies trying to do just that.</p>\n\n<p>But in a bid to phase out conventional vehicles, the Biden administration has tried to sidestep the prohibition on DOT considering electric vehicles by having the EPA first issue its standards in a separate rulemaking and then restore California’s Clean Air Act “waiver” for its own standards and electric car quota. This completely inverts the statutory system, transforming it into a tool for forcing electrification rather than the technology-neutral, performance-based system Congress created.</p>\n\n<p><strong>>>> <a href=\"https://www.heritage.org/coal-oil-natural-gas/commentary/we-dont-need-costly-mandated-detour-electric-cars\">We Don’t Need a Costly, Mandated Detour to Electric Cars</a></strong></p>\n\n<p>Congress should use every means possible—whether through oversight, appropriations, or legislation—to expose and rein in the Biden administration’s power grab, which pursues its climate change agenda without regard for economic consequences or the rule of law.</p>\n\n<p>The most promising route to restrain this overreach is through litigation. States such as Ohio and Texas and more than a dozen trade groups are fighting the administration’s moves under the Major Questions Doctrine. Under <i>West Virginia v. EPA</i>, the Supreme Court said for agencies to change policy so drastically, as Obama wanted to do to force power plants to change to renewable fuels, they must have clear direction from Congress.</p>\n\n<p>No such clarity can be found here. And this case is even more influential. The regulations coming out of the EPA and the Transportation Department are the most expensive in U.S. history. They are designed to remake, not to regulate, our energy systems. The courts should reject the administration’s cynical attempt to circumvent Congress’s prerogative.</p>",
  "pubDate": "Wed, 02 Nov 2022 09:53:31 -0400",
  "dc:creator": "Derrick Morgan",
  "guid": "https://www.heritage.org/government-regulation/commentary/the-biden-administrations-electric-vehicle-gambit-illegal-and"
}