{
  "title": "Million Bazillion answers your questions about money",
  "guid": "01FANXZNFM92BMCGVWH7XK1CZY",
  "itunes:author": "American Public Media",
  "description": "<p>Today we’re sharing an episode with you from our friends at Million Bazillion, the podcast that answers the questions kids have about money. They help dollars make more sense and they’re back for a whole new season! </p>\n<p> In today’s episode, hosts Jed and Bridget answer a question from two curious listeners who want to know why we pay taxes. In answering the question, they come across the legendary Robin Hood, known for his hatred of taxes. Back in his day, tax-collecting sheriffs forced people to pay money to a king, who decided how those taxes were spent. These days our tax system works a bit differently. We get to vote for people who’ll spend that money on things we care about — like schools and libraries, health care for elderly people, police, parks, sewers and so on. With the help of a rambling troubadour and a tax policy expert, Jed and Bridget teach Robin Hood that the way tax dollars are spent today reflects what we prioritize as a society. Plus, we’ll ask random kids some not-so-random questions.</p>\n<p>Million Bazillion is a collaboration between Brains On and Marketplace. It’s hosted by Jed Kim and Bridget Bodnar. You can listen to <a href=\"https://www.marketplace.org/shows/million-bazillion/\" title=\"https://www.marketplace.org/shows/million-bazillion/\">more episodes here</a>, or subscribe at <a href=\"https://podcasts.apple.com/us/podcast/million-bazillion/id1523486568\">Apple Podcasts</a>, <a href=\"https://open.spotify.com/show/1QlbveZv5f9T0lo4qu8pkU?si=VtCWiw5TQmmkNDk1gIfFxQ\">Spotify</a>, <a href=\"https://podcasts.google.com/feed/aHR0cHM6Ly93d3cubWFya2V0cGxhY2Uub3JnL2ZlZWQvcG9kY2FzdC9taWxsaW9uLWJhemlsbGlvbg?ved=2ahUKEwivsdW999LqAhWCnZ4KHX0RBi4Q4aUDegQIARAC&hl=en\">Google Podcasts</a>, or wherever you get your podcasts.</p>\n<p> </p>\n",
  "enclosure": "",
  "pubDate": "Thu, 15 Jul 2021 20:33:31 +0000",
  "itunes:duration": "00:19:54",
  "itunes:explicit": "no"
}