{
  "title": "Chinese Whispers: Xi's absolute power after the 20th Party Congress",
  "link": "https://audioboom.com/posts/8183904",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1924,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>This week Xi Jinping has taken his new Politburo Standing Committee on a group trip – to Yan’An, the base of Mao Zedong’s Communist revolution after the Long March. The symbolism is easy to see.<br>\n<br>\nOn this episode of Chinese Whispers, Bill Bishop, author of the popular Sinocism newsletter, and Professor Victor Shih, author of <em>Coalitions of the Weak</em>, have returned to reflect on the Party Congress just past. It's been a more dramatic event than many (inside and outside the party) expected, starting with a brave, lone protestor hanging a 42-character banner off a popular bridge in Beijing, lambasting the authoritarian regime; and ending with the forcible removal of former general secretary Hu Jintao in front of the world's media.<br>\n<br>\nAt the congress itself Xi overturned decades-long norms dictating the top leadership of the party – age no longer seems to necessitate retirement, while the Politburo has not a single woman. Above all, Xi has started his third term as general secretary with a loyal cabal of men around him. Did he not want more competent people in the top jobs? 'Loyalty is merit', Bill suggests.<br>\n<br>\nWhat does this mean for China, and the world? Victor makes the point that Xi is putting the pieces in place to push through unpopular decisions – for example, an invasion of Taiwan. 'If you think about it, why would you want people whom you trust absolutely to fill every single position? Because even Chairman Mao didn’t do this'. It also means that as Xi becomes more truly dictatorial, the West needs to engage with him more, not less. <br>\n<br>\n\n</div>\n<blockquote>We just don’t know the kind of information about the US, about other countries, that are landing on Xi Jinping’s desk. And this information can be incredibly distorted. So if anything, just presenting an alternative view of how the world works could be helpful. He may not believe you… but if you’re able to look him in the eye and tell him something, at least he’ll be forced to think about it.</blockquote><div>As for the party itself, the three of us digest the Hu Jintao incident. Regardless of what you think happened, one thing is for sure – it was a deep and utter humiliation for Hu, especially given China's deep-set Confucian respect for elders. The idea that there is any organised CCP opposition against Xi has been put to bed.<br>\n<br>\n\n</div>\n",
  "pubDate": "Sun, 30 Oct 2022 12:00:00 +0000",
  "guid": "tag:audioboom.com,2022-10-28:/posts/8183904",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}