{
  "title": "ZBT #245: Bomb Sniffing Dolphins + Lies Your Recruiter Told You",
  "description": "<p>Round #1: Despite what longtime stoolie Ray Finkle would say, the laces were out and the dolphins are in… inside the belly of a C-17 because these specialized bomb-smelling dolphins are headed to the Florida Keys from San Diego. No word yet on Key Largo or Montego. We’ll keep you updated!\n\nRound 2: THATS A SPICY MEAT-A-BALL! Soldiers and family members assigned to bases in Italy will no longer be allowed to PCS home, go to professional schools, or couple’s skate at the base roller rink due to fears about the Coronavirus outbreak in Italy. One of those isn't true. We’ll let you think about it and guess! \n\nRound 3: That’s right, folks. MORE CORONAVIRUS TALK! This time, however, we are going to praise the good folks of the Coast Guard. The more I think about it, they might be the most useful branch to homeland America. They are constantly in the thick of it even if that thickness comes from the mucus-laden nastiness of the coronavirus. \n\nRound 4: Recruiter Tall Tales: we head out to the ZBT platoon on social media to check in and see if the recruiters out there ever lie, cheat, or steal. It should be a short round because honesty is a hallmark of non-commissioned officers.  \n\nRound 5: A Marine had to take a shit. The Marine wasn't Kate or me.. We’ll tell you her horror story, though. Dont drink coffee while we do if you have a barracks inspection. We dont want nose coffee.. (Which is different than nose beers) to cause you to fail your inspection..</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/ZeroBlog30\">barstool.link/ZeroBlog30</a></p>",
  "guid": "94a6a9aa-59b5-4f8c-bd76-96fd7abc23ad",
  "pubDate": "Tue, 10 Mar 2020 07:15:00 +0000",
  "link": "https://www.barstoolsports.com/shows/zero-blog-thirty",
  "itunes:explicit": "yes",
  "itunes:duration": "00:57:38",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}