{
  "title": "The idea of Europe: more than a feeling?",
  "link": "https://audioboom.com/posts/7845959",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 3959,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In a recent set of two Bruegel publications <a href=\"https://www.bruegel.org/author/giuseppe-porcaro/\">Giuseppe Porcaro</a>, <a href=\"https://www.bruegel.org/author/emmanuel-mourlon-druol/\">Emmanuel Mourlon-Druol</a>, Enrico Bergamini and Francesco Papadia set out to understand exactly how europeanised public debate in national conversations actually is. With no quantitative indicators, they used a whole set of 'imperfect proxies' such as analysis of national newspapers to give them additional elements alongside the voters turnout, and existing eurobarometers surveys to understand just how strong citizens’ attachment to the European Union is.<br>\n<br>\n\n</div>\n<div>In this episode of The Sound of Economics LIVE, Giuseppe and Emmanuel are joined by two guests who with hands on experience in finding this 'European public sphere': <a href=\"https://www.bruegel.org/author/jaume-duch-guillot/\">Jaume Duch Guillot</a>, the Spokesperson and Director General for Communication at the European Parliament, and <a href=\"https://www.bruegel.org/author/mick-ter-reehorst/\">Mick ter Reehorst</a>, founder of 'Are We Europe', a pan-European publication that focuses on 'border-breaking' stories.<br>\n<br>\n\n</div>\n<div><strong><em>Relevant publications:</em></strong></div>\n<div>Bergamini, E. and E. Mourlon-Druol (2021) ‘<a href=\"https://www.bruegel.org/2021/03/talking-about-europe-exploring-70-years-of-news-archives/\">Talking about Europe: exploring 70 years of news archives</a>’, Working Paper 04/2021, Bruegel</div>\n<div>Papadia, F., E. Bergamini, E. Mourlon-Druol and G. Porcaro (2021) ‘<a href=\"https://www.bruegel.org/2021/03/interest-in-european-matters-a-glass-three-quarters-full/\">Interest in European matters: a glass three-quarters full?</a>’ Working Paper 05/2021, Bruegel<br>\n<br>\n\n</div>\n",
  "itunes:summary": "What can 70 years of news(paper articles) and how we talk about 'Europe' tell us about pan-European identity? Is there even such a thing as a European public sphere?",
  "pubDate": "Fri, 16 Apr 2021 13:13:27 +0000",
  "guid": "tag:audioboom.com,2021-04-16:/posts/7845959",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}