{
  "id": "tag:blogger.com,1999:blog-4371296950668142214.post-4762581545218316389",
  "published": "2021-07-13T09:12:00.005+10:00",
  "updated": "2021-07-13T09:12:48.968+10:00",
  "category": [
    "",
    ""
  ],
  "title": "YouTube Shorts arrives in Australia",
  "content": "Last year, we <a href=\"https://blog.youtube/news-and-events/building-youtube-shorts/\">announced</a> that we are building YouTube Shorts, a short-form video experience for anyone who wants to create short, catchy videos using nothing but their mobile phones. Since then, we’ve expanded our beta to 26 more countries and have already seen many creative, awesome Shorts from our community.&nbsp;<div>We’re excited to share that YouTube Shorts is going global. We’re now rolling out our beta across more than 100 countries around the world where YouTube is available — including Australia.&nbsp;</div><div>We plan to introduce more features as we continue to build Shorts alongside creators and artists. Here’s an update on what to expect from YouTube Shorts as it rolls out.&nbsp;</div><div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-Baq75KZN_Ok/YOzLzES_tdI/AAAAAAAAC2M/ux8KCdIP5yE90Nkbp1OMUdrsAjuceTxOQCLcBGAsYHQ/s2048/Home.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"2048\" data-original-width=\"1127\" height=\"640\" src=\"https://1.bp.blogspot.com/-Baq75KZN_Ok/YOzLzES_tdI/AAAAAAAAC2M/ux8KCdIP5yE90Nkbp1OMUdrsAjuceTxOQCLcBGAsYHQ/w352-h640/Home.png\" width=\"352\" /></a></div></div><div><b>Unlocking a new playground of creativity&nbsp;</b></div><div>Creation is at the core of short-form video, and we want to make it easy and fun to create Shorts. Shorts already includes foundational creation tools like a multi-segment camera to string multiple video clips together, the ability to record with music, control speed settings, and more. As we continue to build Shorts alongside our creators and artists, we’ve added more features to try, like:&nbsp;</div><div><ul style=\"text-align: left;\"><li><b>Add text</b> to specific points in your video&nbsp;</li><li><b>Sample audio from other Shorts </b>to remix into your own creation&nbsp;</li><li>Automatically <b>add captions</b> to your Short&nbsp;</li><li><b>Record up to 60 seconds </b>with the Shorts camera&nbsp;</li><li><b>Add clips from your phone’s gallery </b>to add to your recordings made with the Shorts camera&nbsp;</li><li><b>Add basic filters</b> to colour correct your Shorts, with more effects to come in the future&nbsp;</li></ul>We’ve also been starting to roll out t<b>he ability to sample audio from videos across YouTube</b> - which includes billions of videos worldwide - unlocking a new playground of creativity like never before. This means you can give your own creative spin on the content you love to watch on YouTube and help find it a new audience — whether it’s reacting to your favourite jokes, trying your hand at a creator’s latest recipe, or re-enacting comedic skits. Creators will be in control and will be able to opt out if they don’t want their long form video remixed.&nbsp;</div><div>We’ve also worked alongside our music partners to make sure artists and creators have a large library of songs to use in their Shorts. As we expand Shorts, the library and number of partners will continue to grow.&nbsp;</div><div>Stay tuned for more creation tools rolling out in the future as we continue to build Shorts.&nbsp;</div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-cxEmvhcAyXw/YOzMLN37c0I/AAAAAAAAC2U/05Hw6nDojMEJp3Q9BeQeOoJnfDOu5WCrgCLcBGAsYHQ/s2048/Player.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"2048\" data-original-width=\"1127\" height=\"640\" src=\"https://1.bp.blogspot.com/-cxEmvhcAyXw/YOzMLN37c0I/AAAAAAAAC2U/05Hw6nDojMEJp3Q9BeQeOoJnfDOu5WCrgCLcBGAsYHQ/w352-h640/Player.png\" width=\"352\" /></a></div><div><br /></div><div><b>Delivering a seamless viewing experience across YouTube&nbsp;</b></div><div>We know that creation is only one part of the Shorts experience. We also want to help people find Shorts to enjoy and help creators get discovered. We’ve introduced a row on the YouTube homepage especially for Shorts, have launched a new watch experience that lets you easily swipe vertically from one video to the next, and will soon add a Shorts tab on mobile that makes it easier for you to watch Shorts with a single tap.&nbsp;</div><div>We’re also exploring how to deepen your connection with Shorts content, creators, and artists you’re most interested in by integrating it with the YouTube you already know and love. For instance, if you hear a snippet of a song on Shorts, you can easily find the full song, watch the music video, or learn more about the artist — all on YouTube. And it works both ways. Tap the create button right from a video to make your own Short with that audio, or check out how others are using it on Shorts.&nbsp;</div><div>As more people create and watch Shorts, we expect that our systems will get even better, improving our ability to help you discover new content, trends, and creators you’ll love.&nbsp;</div><div><br /></div><div><b>Supporting mobile creators</b>&nbsp;</div><div>YouTube has helped an entire generation of creators turn their creativity into businesses and become the next generation media companies. Over the last three years, we’ve paid more than US$30 billion to creators, artists, and media companies.&nbsp;</div><div>Shorts is a new way to watch and create on YouTube, so we’ve been taking a fresh look at what it means to monetise Shorts and reward creators for their content. We are deeply committed to supporting the next generation of mobile creators with Shorts, and are actively working on what monetisation options will look like in the future.&nbsp;</div><div>As our first step in this journey, we recently <a href=\"https://blog.youtube/news-and-events/introducing-youtube-shorts-fund/\">introduced</a> the YouTube Shorts Fund, a US$100M fund distributed over the course of 2021-2022.&nbsp;</div><div>The Shorts beta is rolling out globally and will be available to everybody soon. We know that it will take us time to get this right, but we can't wait for you to try Shorts and help us build a first-class short-form video experience right on YouTube.&nbsp;</div><div><br /></div><div><span class=\"byline-author\">Posted by YouTube Australia &amp; New Zealand Team</span></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "anzprteam",
    "uri": "http://www.blogger.com/profile/06099752084931732403",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}