{
  "title": "Cherry reboots its coveted '80s keyboard switch",
  "description": "<p>Cherry is releasing the <a href=\"https://www.cherrymx.de/en/cherry-mx/mx-special/mx-black-clear-top.html\">MX Black Clear-Top</a> (aka the \"Nixie\") a new version of a keyboard switch from the '80s prized for its typing feel and acoustics. It was manufactured for a German company called Nixdorf (hence the nickname) that mainly built keyboards for terminals, servers and mini computers. Because the Nixie was only built for a few years, used switches are rare and command high prices — a fact that no doubt inspired Cherry to start building an updated version.</p><p>The original <a href=\"https://www.theremingoat.com/blog/from-the-vault-cherry-nixie-review\">Nixie switch</a> was a variant of Cherry's MX Black switch with very specific modifications. Namely, the actuating force was bumped slightly from 60 to 63.5 centinewtons, and a diode was integrated into the switch for n-key rollover (NKRO) which allows the keyboard to register every key press, even if done simultaneously.&nbsp;</p><span id=\"end-legacy-contents\"></span><p>The new version carries the same specs and looks, including \"the familiar milky top housing, black bottom housing, and a black stem,\" Cherry wrote in a press release. It has the same actuation force of 63.5 centinewtons, a pre-travel of 2 mm, and a total travel of 4 mm. The company also retained the same vintage design for the spring.&nbsp;</p><p>At the same time, though, it's being built using the company's latest production systems so it's up to the quality of its latest MX switches. Cherry will offer the MX Black Clear-Top both with or without grease works, with the latter being for enthusiasts who want to do any lubrication themselves. The switches arrive at the beginning of 2023, but Cherry has yet to announce the price.&nbsp;</p><p></p>",
  "link": "https://www.engadget.com/cherry-is-now-mass-producing-a-classic-after-switch-from-the-80s-095044095.html?src=rss",
  "source_id": "engadget_479",
  "guid": "0b089a61-fac7-4cd1-ab34-ed25c1dfe3b4",
  "dc:creator": "Steve Dent",
  "source": "Engadget",
  "dc:publisher": "Engadget",
  "dc:rightsHolder": "Engadget",
  "pubDate": "Fri, 04 Nov 2022 09:50:44 +0000",
  "ingested": 1667553494,
  "modified": "2022-11-04T09:18:17+00:00",
  "category": [
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Steve Dent"
  ],
  "media:content": [
    {
      "media:keywords": "headline",
      "media:media_html": "",
      "dc:identifier": 1,
      "media:credit": "",
      "media:description": "",
      "media:title": ""
    },
    {
      "media:media_html": "",
      "dc:identifier": 2,
      "media:credit": "Cherry",
      "media:description": "Cherry is now mass-producing a classic keyboard switch from the '80s",
      "media:title": "Cherry is now mass-producing a classic keyboard switch from the '80s"
    }
  ]
}