{
  "title": "What Texas Instruments’ Little Professor Can Teach Us",
  "link": "https://spectrum.ieee.org/texas-instruments-calculator",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-photo-of-a-little-professor-calculator.jpg?id=29605180&width=1245&height=700&coordinates=0%2C281%2C0%2C281\"/><br/><br/><p><strong>In the early</strong> 1990s, the literary critic Stephen Greenblatt wrote about the tension between <a href=\"http://stephengreenblatt.com/sites/default/files/Karp-Levine.pdf\" target=\"_blank\">resonance and wonder</a> in museums. The wondrous objects, he wrote, are unique and instantly amazing—<a href=\"https://airandspace.si.edu/stories/editorial/mars-rover-lands-virginia\" target=\"_blank\">a model of a Mars rover</a>, say, or <a href=\"https://www.thehenryford.org/collections-and-research/digital-collections/artifact/225212/\" target=\"_blank\">a glass test tube holding Edison’s last breath</a>. These are the objects that stop visitors in their tracks and proclaim: “I belong in a museum!” </p><p>Objects that evoke resonance, on the other hand, are more relatable and more familiar. They reach out from their exhibit case to spark conversations with visitors: “I remember Grandma having a <a href=\"https://americanhistory.si.edu/collections/object-groups/slide-rules\" target=\"_blank\">slide rule</a> like that.” </p><hr/><p>Which brings me to the object at top. I encountered this funny-looking calculator during a recent visit to the <a href=\"https://www.whipplemuseum.cam.ac.uk/\" target=\"_blank\">Whipple Museum of the History of Science</a>, at the University of Cambridge. Many years ago, my 7-year-old sister had a calculator just like this, and I desperately wanted one, too. There is no stronger resonance than that of your inner jealous 5-year-old seeing the calculator that your older sister wouldn’t let you play with. </p><p>This Texas Instruments calculator, called the Little Professor, debuted in 1976 and proved an instant hit. Over the next decade, parents bought millions of the jaunty yellow devices to help their children learn basic arithmetic. The backward-functioning calculator displays a simple equation—such as “9 – 3 =”—and the user then has to punch in the answer. Get it wrong and the LED display flashes “EEE.” After a set of 10 questions, the calculator displays the user’s score. A 9-volt battery powered the Texas Instrument <a href=\"http://www.vintagecalculators.com/html/little_professor.html\" target=\"_blank\">TMS0975NL</a> integrated circuit and the eight-digit LED display. In the 1980s, the LED display was replaced with an LCD. (Texas Instruments still makes a version of the Little Professor, only now it’s sustainably <a href=\"https://education.ti.com/en/products/calculators/elementary-calculators/little-professor-solar\" target=\"_blank\">powered with solar cells</a>.)  </p><p>The iconic calculator features the face of a mustachioed man wearing square glasses and reading a book. The top of the device suggests a mortarboard, a nod to the professor’s status, with the “tassel” being a wrist strap to hold the device. The calculator initially sold for US $17, which dropped to $13 by mid-1977. </p><p>This Texas Instruments ad from 1978 presents the calculator as a gateway device for young learners to explore “the wonder of numbers”:</p><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"9acbae9aeb080f202c7fe4677efa0356\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/TlOIXK1b5kw?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Texas Instruments - \"Little Professor\" (Commercial, 1978)</small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">\n<a href=\"https://www.youtube.com/watch?v=TlOIXK1b5kw\" target=\"_blank\">www.youtube.com</a>\n</small>\n</p><p>The Little Professor came with a <a href=\"http://www.datamath.net/Manuals/LittleProf76_US.pdf\" target=\"_blank\">workbook of games</a> like Jackpot and Loco Motion that coaxed users into solving math problems, either on their own or with friends. Math as a fun group activity? Why not. </p><h2>How the Little Professor Found a Home at the Whipple Museum </h2><p>The Little Professor came to the Whipple in 1987 as part of the Francis Hookham Collection of Handheld Calculators, which includes more than 400 electronic calculators from the 1970s and ’80s. The donation caught the attention of a columnist at <em>The Daily Telegraph </em>named Boris Johnson. (Yes, <a href=\"https://www.telegraph.co.uk/boris-johnson-archive/\" target=\"_blank\"><em>that</em> Boris Johnson</a>.) He wrote a disparaging article about the museum’s acquisition of a “peerless collection of obsolete gadgets.” </p><p>What the article really shows is that Johnson had no idea how museums work. At the very least, the Whipple’s Little Professor isn’t obsolete because it’s still in working condition. In the hands of a child, it could still teach arithmetic tables. </p><p>And the Little Professor may be a child’s calculator, but it’s one that a number of museums have deemed worthy of their collections. The Whipple currently displays its <a href=\"https://collections.whipplemuseum.cam.ac.uk/objects/10874/\" target=\"_blank\">Little Professor</a> along with other models from the Hookham Collection to show the evolution of electronic calculators. Back in 1980 the Science Museum in London exhibited its <a href=\"https://collection.sciencemuseumgroup.org.uk/objects/co8000285/little-professor-electronic-calculator-1980-electronic-calculator-educational-toy\" target=\"_blank\">Little Professor</a> as part of the <a href=\"http://tcm.computerhistory.org/CHMfiles/The%20Challenge%20of%20the%20Chip,%20London%20Science%20Museum%201980.pdf\" target=\"_blank\">Challenge of the Chip</a> exhibition, which encouraged visitors to consider how the tiny microchip was going to change their lives. The Smithsonian’s <a href=\"https://collections.si.edu/search/detail/edanmdm:nmah_334611\" target=\"_blank\">Little Professor</a> makes an appearance in <a href=\"https://www.press.jhu.edu/books/title/9570/tools-american-mathematics-teaching-1800-2000\" target=\"_blank\"><em>Tools of American Mathematics Teaching, 1800–2000</em></a>, the 2008 book by Peggy Aldrich Kidwell, Amy Ackerberg-Hastings, and David Lindsay. Personally, I would like to see the Little Professor in an exhibit about designing for children. </p><p>But Boris Johnson seemed to believe that museums should collect only the wondrous. He favored the <a href=\"https://www.museothyssen.org/en/collection/carmen-thyssen\" target=\"_blank\">Carmen Thyssen Collection</a> in Madrid and the <a href=\"https://burrellcollection.com/\" target=\"_blank\">Burrell Collection</a> in Glasgow, both replete with high art and old masters. There was no space in Johnson’s museum world for the merely resonant. </p><p>The fact is that museums need both wonder and resonance. Resonant objects make museums more approachable and more accessible to the average visitor. You realize that you don’t have to be a Newton or an Einstein or a billionaire to have owned an object that’s now in a museum’s collection.  </p><p>While working on this month’s column, I chatted with several friends and colleagues about the Little Professor. Every one of them remarked with glee, “I had one of those!” That’s excellent design—to create a connection that endures decades later. Seeing a museum object that speaks to your own life and experience helps you realize that everyone has an origin story—and it might just include a goofy-looking calculator toy. </p><p><em>Part of a</em><a href=\"https://spectrum.ieee.org/tag/Past+Forward\" target=\"_self\"><em> continuing series</em></a> <em>looking at photographs of historical artifacts that embrace the boundless potential of technology.</em> </p><p><em>An abridged version of this article appears in the April 2022 print issue as </em><em>“</em><em>Lessons From the Little Professor</em><em>.”</em></p>",
  "pubDate": "Thu, 31 Mar 2022 15:00:01 +0000",
  "guid": "https://spectrum.ieee.org/texas-instruments-calculator",
  "category": [
    "Past forward",
    "Texas instruments",
    "Calculators",
    "Consumer electronics",
    "Museums",
    "History",
    "Type:departments"
  ],
  "dc:creator": "Allison Marsh",
  "media:content": ""
}