{
  "title": "S1E6 - You're Never Too Old to Dream Big with Olympic Medalist Lauren Gibbs",
  "guid": "https://pinecast.com/guid/697860c8-50b8-4844-b667-8761b6e15a8f",
  "pubDate": "Tue, 14 Jul 2020 07:30:03 -0000",
  "itunes:duration": "00:58:31",
  "description": "<p>Prepare yourself for the unique and unusual story of today’s guest, Lauren Gibbs, Silver Medalist and World Champion Bobsledder, not to mention Laura’s newest BFF. Throughout their lively conversation, you will laugh, you will learn, and most of all, you will be inspired to start dreaming big, no matter how old you are.</p>\n<p>Lauren starts things off by describing her unique journey to becoming an Olympian, what it is like to actually live at an Olympic Training Centre, and emphasizing the importance she places upon having and following an effective recovery regime. She also shares what she has learned from this journey, about dealing with self-doubt, and exactly how the Olympic Bobsled Team is selected. Her emotional tale of her first Olympic experience, her preparation for a potential second Olympics appearance, and her strategy for getting through the ‘tough times’ that all elite athletes encounter are explored as well. Finally, she shares with listeners her recent collaboration with airbnb which offers people the opportunity to interact with her online in real time. Lauren is a thoroughly engaging speaker whose honesty, insights, and humor in today’s episode will not only educate and entertain, but also inspire all listeners.</p>\n<p>Episode Highlights:</p>\n<p>Lauren’s journey to becoming an Olympian\nLiving in an Olympic Training Centre\nThe importance of a recovery regime\nWhat Lauren has learned from her journey\nDealing with thoughts of self doubt\nHow the USA Olympic Bobsled Team is picked\nLauren’s Olympic experience\nPreparing for her second Olympics\nGetting through those ‘character building days’\nLauren’s ‘Airbnb Online Experience’</p>\n<p>Quotes:</p>\n<p>“Lauren Gibbs in high school and college was kind of lazy.”</p>\n<p>“At any point in your life you can change who you are and do better.”</p>\n<p>“And by the way, bobsledding feels like being kicked off a cliff in a trash can. Have fun!”</p>\n<p>“Most of us Olympians don’t make much money, if any at all, like, we’re paying to do our sport oftentimes.”</p>\n<p>“Lauren, you worked hard at something, you committed yourself to something, and you did it. Congratulations, here’s your new life.”</p>\n<p>“The difference maker was going to be how I handled those tough days.”</p>\n<p>“In a time when the world kind of feels like it’s on fire and ending, it’s really nice to have something positive and exciting and interesting to do.”\nLinks:\nThe Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a></p>\n<p>Lauren’s Instagram: <a href=\"https://www.instagram.com/lagibbs84/\" rel=\"nofollow\">https://www.instagram.com/lagibbs84/</a></p>\n<p>Lauren’s bio:   <a href=\"https://www.teamusa.org/usa-bobsled-skeleton-federation/athletes/lauren-gibbs\" rel=\"nofollow\">https://www.teamusa.org/usa-bobsled-skeleton-federation/athletes/lauren-gibbs</a></p>\n<p>Lauren’s ‘Airbnb Online Experience’:    <a href=\"https://www.airbnb.ca/experiences/1661397?locale=en&_set_bev_on_new_domain=1593448886_xxh3CusJGZToEWMP\" rel=\"nofollow\">https://www.airbnb.ca/experiences/1661397?locale=en&_set_bev_on_new_domain=1593448886_xxh3CusJGZToEWMP</a></p>",
  "itunes:title": "You're Never Too Old to Dream Big with Olympic Medalist Lauren Gibbs",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 6
}