{
  "id": "https://bibleinoneyear.org/en/youth/61",
  "title": "Day 61: A Loving, Ongoing Relationship",
  "description": "Psalm 28:1–2,6–7, Leviticus 8:10,12, Mark 11:1–25.  Without that relationship there will always be a deep sense of aloneness and a lack of ultimate meaning and purpose At the heart of the Christian faith is this relationship with God where we find what we are living for",
  "pubDate": "Wed, 02 Mar 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/61/",
  "itunes:duration": "13:40",
  "guid": "enyouth02032022-61",
  "length": 820.77,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 61: A Loving, Ongoing Relationship",
  "itunes:subtitle": "Psalm 28:1–2,6–7, Leviticus 8:10,12, Mark 11:1–25.  Without that relationship there will always be a deep sense of aloneness and a lack of ultimate meaning and purpose At the heart of the Christian faith is this relationship with God where we find what we are living for",
  "itunes:summary": "In one of his last songs, Freddie Mercury, the lead singer of the rock group Queen, asked the question: ‘Does anybody know what we are living for?’\nIn spite of the fact that he had amassed a huge fortune and had attracted thousands of fans, Freddie Mercury admitted in an interview shortly before his death in 1991 that he was desperately lonely. He said, ‘You can have everything in the world and still be the loneliest man, and that is the most bitter type of loneliness. Success has brought me world idolisation and millions of pounds, but it’s prevented me from having the one thing we all need – a loving, ongoing relationship.’\nThere is only one relationship that is completely loving and ongoing, and for which we were created. Without that relationship there will always be a deep sense of aloneness and a lack of ultimate meaning and purpose.\nAt the heart of the Christian faith is this relationship with God where we find what we are living for.\nHow can you and I have a relationship with the Creator of the universe? How in practice can we begin to communicate with God? What is the basis of this relationship?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 426
}