{
  "id": "yt:video:zEE12SoHQ0w",
  "yt:videoId": "zEE12SoHQ0w",
  "yt:channelId": "UCknLrEdhRCp1aegoMqRaCZg",
  "title": "Russian troops signal withdrawal from Kherson as Ukraine moves in | DW News",
  "link": "",
  "author": {
    "name": "DW News",
    "uri": "https://www.youtube.com/channel/UCknLrEdhRCp1aegoMqRaCZg"
  },
  "published": "2022-11-04T10:21:16+00:00",
  "updated": "2022-11-05T10:07:54+00:00",
  "media:group": {
    "media:title": "Russian troops signal withdrawal from Kherson as Ukraine moves in | DW News",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Ukraine's President Volodymir Zelenskyy says Russian strikes have left some 4.5 million people without power across the country. Zelenskyy accuses Moscow of \"energy terrorism\" for escalating attacks on Ukraine's power grid as winter looms. Similar attacks on infrastructure have also damaged Ukraine's water supplies. Officials have asked refugees not to return to the country this winter because of fears of further shortages.\nAnd Moscow has claimed Kyiv was developing a so-called \"dirty bomb,\" but the International Atomic Energy Agency has not found no evidence that the claim is true.\nMeanwhile, there are signs the Russians are withdrawing from parts of Kherson, as Ukraine appears poised to retake the strategic city. Russia has begun the mass relocation of people there, and there are troubling reports that children are being moved out of orphanages and offered up for adoption in Russia, which would constitute a war crime.\n \nSubscribe: https://www.youtube.com/user/deutschewelleenglish?sub_confirmation=1\n\nFor more news go to: http://www.dw.com/en/\nFollow DW on social media:\n►Facebook: https://www.facebook.com/deutschewellenews/\n►Twitter: https://twitter.com/dwnews\n►Instagram: https://www.instagram.com/dwnews\n►Twitch: https://www.twitch.tv/dwnews_hangout\nFür Videos in deutscher Sprache besuchen Sie: https://www.youtube.com/dwdeutsch\n\n#Ukraine #Russia #UkraineWar",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}