{
  "title": "Traumpfad oder Holzweg - Passt die literarische Welterkundung noch in den kritischen Zeitgeist?",
  "link": "https://www.deutschlandfunk.de/traumpfad-oder-holzweg-100.html",
  "description": "<img src=\"https://assets.deutschlandfunk.de/5bad2a57-c53a-43f7-8390-5c95fa746460/2400x1350.jpg?t=1659004448020\" alt=\"An der Rezeption eines staatlichen Campinplatz im Bryce Canyon, Utah, können Reisende Bücher, Kleidung, Feuerholz, Campingbedarf und Essen abgeben, welches sie nicht mehr brauchen, andere Reisende aber benötigen könnten. Die Campinplatzleitung hat daneben ein Schild mit einem Zitat des Schriftstellers Mark Twain \"Reisen ist fatal für Vorurteile, Bigotterie und Engstirnigkeit\" (engl.) aufgestellt.\" title=\"An der Rezeption eines staatlichen Campinplatz im Bryce Canyon, Utah, können Reisende Bücher, Kleidung, Feuerholz, Campingbedarf und Essen abgeben, welches sie nicht mehr brauchen, andere Reisende aber benötigen könnten. Die Campinplatzleitung hat daneben ein Schild mit einem Zitat des Schriftstellers Mark Twain \"Reisen ist fatal für Vorurteile, Bigotterie und Engstirnigkeit\" (engl.) aufgestellt.\"\n                    width=\"144\" height=\"81\" border=\"0\" align=\"left\" hspace=\"4\" vspace=\"4\"/>Klimakrise, Pandemie und postkoloniale Diskurse haben dem Weltreisen den Zauber genommen. Auf einmal steht die Reiseliteratur nicht mehr für Offenheit und Welterkundung, sondern für CO2-Ausstoß und kulturelle Aneignung. Was aber, wenn wir nicht nur frivole Lästereien über fremde Völker und seltsame Sitten aufgeben, sondern auch die Lust auf Abenteuer, Begegnung und Missverständnis?<br clear=\"all\"/><br/>Von Thekla Dannenberg<br/>www.deutschlandfunk.de, Essay und Diskurs<br/><a title=\"Direkter Link zur Audiodatei\" href=\"https://podcast-mp3.dradio.de/podcast/2022/07/31/traumpfad_oder_holzweg_dlf_20220731_0930_7ad28d44.mp3\">Direkter Link zur Audiodatei</a><br/><p><br/></p>",
  "guid": "https://podcast-mp3.dradio.de/podcast/2022/07/31/traumpfad_oder_holzweg_dlf_20220731_0930_7ad28d44.mp3",
  "pubDate": "Sun, 31 Jul 2022 09:30:00 +0200",
  "enclosure": "",
  "itunes:author": "Thekla Dannenberg",
  "itunes:duration": "29:38"
}