{
  "id": "https://bibleinoneyear.org/en/youth/21",
  "title": "Day 21: Be Honest with God",
  "description": "Psalm 12:1, Genesis 41:41,46, Matthew 14:22–33.  He likes candour  He wants to hear what is on your heart today",
  "pubDate": "Thu, 21 Jan 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/21/?ignore",
  "itunes:duration": "12:39",
  "guid": "enyouth21012021-21",
  "length": 759.59,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 21: Be Honest with God",
  "itunes:subtitle": "Psalm 12:1, Genesis 41:41,46, Matthew 14:22–33.  He likes candour  He wants to hear what is on your heart today",
  "itunes:summary": "We are living in a ‘post-truth’ era. The term increased 2000% in prevalence during the Brexit and U.S presidential debates. In a ‘post-truth’ era, objective facts appear less influential than appeals to emotion. There is a tolerance for dishonest, inaccurate allegations and outright denial of facts. Political half-truths and blatant lies become routine.\nBut if you buy a car, you want to know the truth about that car. In a relationship, you want to know the truth. We hunger for honesty and truth. The new generation (following the millennials) Gen Z – people born between 1995 to 2010 – have been called ‘True Gen’ because of their search for truth.\nWe see in our passages for today that God hates lies and deception. David says, ‘People all lie to their neighbours; their flattering lips speak with deception’ (Psalm 12:2). Jesus quoted Isaiah, ‘These people honour me with their lips, but their hearts are far from me’ (Matthew 15:8). Although Joseph’s brothers had deceived their father about the fate of Joseph (Genesis 37:31–35), they knew in their hearts that they could not deceive God: ‘Surely we are being punished because of our brother’ (42:21).\nGod wants you to be honest with him. He likes candour. He wants to hear what is on your heart today.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 21
}