{
  "title": "Painting with Lasers with Dan, Shell, and Nick",
  "pubDate": "Fri, 12 Apr 2019 21:57:27 +0000",
  "link": "https://newdisrupt.org/blog/2019/4/12/painting-with-lasers-dan-shapiro-shell-meggersee-nick-taylor",
  "guid": "tag:soundcloud,2010:tracks/605153883",
  "enclosure": "",
  "itunes:episode": 109,
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "00:45:42",
  "description": "<p>This episode is recorded live at <a href=\"https://glowforge.com/about-us\">Glowforge</a>, makers of a 2D laser cutter—but it’s not a sponsored episode and we don’t talk about the hardware much at all. Instead, it’s conversation about what people are trying to make and how to get started as a creator.</p>\n<p>I talk with Glowforge founder (and my friend) Dan Shapiro, and the company’s two content designers, Shell Meggersee and Nick Taylor, who spend a lot of their time talking to new and experienced makers as they work with their laser equipment. They offer some great insight and a lot of encouragement.</p>\n<p>A few lovely quotes that struck me on listening to the recording afterwards:</p>\n<ul>\n<li>Nick: “I wonder if we’re teaching them how to fail gracefully, rather than how to be successful?”</li>\n<li>Shell: “There’s some subtle psychology in the fact that, ‘Oh, the machine messed up! Oops! It wasn’t me!’”</li>\n<li>Dan: “Tools that help you become an amateur are so wonderful…it gets you to that point where you have some small degree of self-sufficiency and creativity.”</li>\n</ul>\n<p>(Glowforge <em>did</em> sponsor an episode earlier in the current season; this episode was entirely my idea and no money changed hands. However, if you’re thinking about buying a Glowforge, <a href=\"https://glowforge.us/r/6KYGS\">you can use this referral link</a> and get $100 to $500 off purchase price depending on the model. I receive the same amount as a referral fee, which helps support the podcast.)</p>\n<h2>Patrons</h2>\n<p>This episode is also brought to you in part by Disruptor-level patrons Bob Owen, Garrett Allen, Michael Warner, Nick Hurley, and Nicholas Santos. You can <a rel=\"payment\" href=\"https://newdisrupt.org/support/\">become a patron of the show</a> on a one-time or recurring basis, and get rewards like an exclusive enamel pin and being thanked in this fashion!</p>\n<h2>Guest biographies</h2>\n<p><em>Dan Shapiro</em> sold his last company to Google. His last side project was Robot Turtles, the best-selling board game in Kickstarter history. He builds drones, authored <em><a href=\"http://www.amazon.com/gp/product/1449360734/\">Hot Seat: The Startup CEO Guidebook</a></em>, and his seven-year-old twins regularly beat him at the game Werewolf. You can listen to <a href=\"https://newdisrupt.org/blog/2014/1/23/shell-game-with-dan-shapiro-episode-59\">the New Disruptors episode on Robot Turtles</a> (episode 59, January 2014).</p>\n<p><em>Shell Meggersee</em> has worked in film, TV and video games, bringing everything from giant 3D monsters to well-known cartoon characters to life. At night, you might find her designing anything from vinyl toys to couture bedding fabric to intricate wedding invitations.</p>\n<p><em>Nick Taylor</em> has spent the last 12 years completing hundreds of projects including custom headphones, bespoke bicycles, desktop furniture, and lighting. Before joining Glowforge, Nick spent 5 years at Apple and ran his own company making artisanal leather goods.</p>\n<h2>Show notes</h2>\n<ul>\n<li>Service bureaus for 2D cutting and 3D printing abound. <a href=\"https://www.ponoko.com\">Ponoko</a> is a well-known one for cutting and engraving, and <a href=\"https://www.shapeways.com\">Shapeways</a> for 3D printing.</li>\n<li>Nick Benson, part of a great family of artists and a descendent of stone carvers, <a href=\"https://www.instagram.com/nixbenson/?hl=en\">has an amazing Instagram account</a></li>\n<li>The <a href=\"http://www.sf-encyclopedia.com/entry/ansible\">ansible</a>, a sci-fi solution for instantaneous communication</li>\n<li><a href=\"http://webcache.googleusercontent.com/search?q=cache:PR6NEkNOwMYJ:www.visiocorp.info/trivia.aspx+&cd=3&hl=en&ct=clnk&gl=us&client=safari\">Graw</a>!</li>\n<li><a href=\"https://newdisrupt.org/blog/2018/10/9/whats-your-latest-studio-neats-mark-one-pen-episode-102\">Studio Neat episode of New Disruptors</a> in which they talk about their tiny lathe</li>\n<li>Anna Robinson, my collaborator on the Tiny Type Museum, <a href=\"https://www.instagram.com/somethingisnotquiteright/\">makes spoons</a></li>\n</ul>\n",
  "itunes:subtitle": "How to help people become makers: advice from the folks who created the Glowforge laser cutter.",
  "itunes:summary": "This episode is recorded live at Glowforge, makers of a 2D laser cutter—but it’s not a sponsored episode and we don’t talk about the hardware much at all. Instead, it’s conversation about what people are trying to make and how to get started as a creator.\n\nI talk with Glowforge founder (and my friend) Dan Shapiro, and the company’s two content designers, Shell Meggersee and Nick Taylor, who spend a lot of their time talking to new and experienced makers as they work with their laser equipment. They offer some great insight and a lot of encouragement.\n\nA few lovely quotes that struck me on listening to the recording afterwards:\n\nNick: “I wonder if we’re teaching them how to fail gracefully, rather than how to be successful?”\n\nShell: “There’s some subtle psychology in the fact that, ‘Oh, the machine messed up! Oops! It wasn’t me!’”\n\nDan: “Tools that help you become an amateur are so wonderful…it gets you to that point where you have some small degree of self-sufficiency and creativity.”\n\nPatrons\n\nThanks to the patrons in the crowdfunding campaign who brought the New Disruptors back, and these Disruptor-level backers in particular: Bob Owen, Garrett Allen, Michael Warner, Nick Hurley, and Nicholas Santos. You can become a patron of the show and get a special pin and be thanked on the air, too, at newdisrupt.org/support\n\nGuest biographies\n\nDan Shapiro sold his last company to Google. His last side project was Robot Turtles, the best-selling board game in Kickstarter history. He builds drones, authored Hot Seat: The Startup CEO Guidebook, and his seven-year-old twins regularly beat him at the game Werewolf. You can listen to the New Disruptors episode on Robot Turtles (episode 59, January 2014).\n\nShell Meggersee has worked in film, TV and video games, bringing everything from giant 3D monsters to well-known cartoon characters to life. At night, you might find her designing anything from vinyl toys to couture bedding fabric to intricate wedding invitations.\n\nNick Taylor has spent the last 12 years completing hundreds of projects including custom headphones, bespoke bicycles, desktop furniture, and lighting. Before joining Glowforge, Nick spent 5 years at Apple and ran his own company making artisanal leather goods."
}