{
  "title": "20: Gregg Krech on The Art of Taking Action: Lessons from Japanese Psychology",
  "pubDate": "Mon, 04 May 2015 21:34:48 +0000",
  "guid": "04da8731c57b7d2111a50defd68e5227",
  "link": "https://traffic.libsyn.com/secure/lifeonpurpose/LifeOnPurposeGregg.mp3",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #20</strong>, my guest is author, speaker, and teacher <strong>Gregg Krech</strong>, one of the leading authorities on Japanese Psychology in North America. Gregg joins me to discuss the importance of taking informed action, how maintaining awareness of our finite reality can infuse your life with passion and urgency, the Japanese philosophies of Naikan and Morita Therapy, and some of the tools he uses to live a meaningful and purposeful life.</p>\n<p>About: <strong>Gregg Krech</strong> is an author, speaker, teacher, and one of the leading authorities on Japanese Psychology in North America.  He's also the founding Director of the TohDoh Institute, an educational center for purposeful living, based in Vermont. </p>\n<p>He is the author of the award-winning book: <strong><em>Naikan: Gratitude, Grace & the Japanese Art of Self-Reflection</em></strong>, which has been translated into five languages, and he's the editor of <em>Thirty Thousand Days: A Journal for Purposeful Living</em>. His work has been featured in a wide range of publications including THE SUN magazine, Utne Reader, Fitness, Counseling Today, Cosmopolitan, and Experience Life.</p>\n<p>His most recent book, <strong><em>The Art of Taking Action: Lessons from Japanese Psychology</em> </strong>brings an eastern perspective to the issue of purpose is currently an Amazon best-seller in the Zen category. It offers an empowering approach to meeting our own personal goals, but also focuses on the impact on our actions (and inactions) on the world..</p>\n<p>To learn more about <strong>Gregg</strong> and his work, visit: <a href=\"http://www.artoftakingaction.com\">http://www.artoftakingaction.com</a> or <a href=\"http://www.todoinstitute.org\">http://www.todoinstitute.org</a>.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #20, my guest is author, speaker, and teacher Gregg Krech, one of the leading authorities on Japanese Psychology in North America. Gregg joins me to discuss the importance of taking informed action, how maintaining awareness of our finite reality can infuse your life with passion and urgency, the Japanese philosophies of Naikan and Morita Therapy, and some of the tools he uses to live a meaningful and purposeful life.</p>\n<p>About: Gregg Krech is an author, speaker, teacher, and one of the leading authorities on Japanese Psychology in North America.  He's also the founding Director of the TohDoh Institute, an educational center for purposeful living, based in Vermont. </p>\n<p>He is the author of the award-winning book: <em>Naikan: Gratitude, Grace & the Japanese Art of Self-Reflection</em>, which has been translated into five languages, and he's the editor of <em>Thirty Thousand Days: A Journal for Purposeful Living</em>. His work has been featured in a wide range of publications including THE SUN magazine, Utne Reader, Fitness, Counseling Today, Cosmopolitan, and Experience Life.</p>\n<p>His most recent book, <em>The Art of Taking Action: Lessons from Japanese Psychology</em> brings an eastern perspective to the issue of purpose is currently an Amazon best-seller in the Zen category. It offers an empowering approach to meeting our own personal goals, but also focuses on the impact on our actions (and inactions) on the world..</p>\n<p>To learn more about Gregg and his work, visit: <a href=\"http://www.artoftakingaction.com\">http://www.artoftakingaction.com</a> or <a href=\"http://www.todoinstitute.org\">http://www.todoinstitute.org</a>.</p>",
  "enclosure": "",
  "itunes:duration": "58:32",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #20, my guest is author, speaker, and teacher Gregg Krech, one of the leading authorities on Japanese Psychology in North America. Gregg joins me to discuss the importance of taking informed action, how maintaining..."
}