{
  "title": "The Edition: Rip it up",
  "link": "https://audioboom.com/posts/8008633",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2260,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s episode: Is it time to rip up the idea of vaccine passports? </div>\n<div><br>\n</div>\n<div>In <em>The Spectator</em>’s cover story this week, our economics editor Kate Andrews writes about her disdain for the idea of vaccine passports after being exposed to their flaws first hand. She joins the podcast along with Professor Julian Savulescu from the University of Oxford. (01:01)</div>\n<div><br>\n</div>\n<div><br>\n</div>\n<div>Also this week: Is Covid putting a spotlight on understudies?</div>\n<div><br>\n</div>\n<div>In this week's <em>Spectator</em>, Sarah Crompton champions the understudy as one of the heroes of the pandemic. These are the community of stand-in actors who have kept productions alive during Covid. She is joined on the podcast by Chris Howell, understudy to Michael Ball in Hairspray last year and currently stand-in for Julian Clary at the Palladium, to discuss. (18:06)</div>\n<div>  </div>\n<div><br>\n</div>\n<div>And finally: Is being cancelled a badge of honour?</div>\n<div><br>\n</div>\n<div>The comedian Stewart Lee announced his pedal bin list for the new year. Essentially people he wants to put in the bin. In <em>The Spectator</em> this week Julie Burchill who is on the list writes about her excitement to be featured. Joining the podcast are two others who made the list: journalist Martha Gill and Winston Marshall formally of the band Mumford and Sons, but who this year is joining <em>The Spectator</em> family with his new show, Marshall Matters. (28:59)</div>\n<div><br>\n</div>\n<div><br>\n</div>\n<div>Hosted by Lara Prendergast and William Moore</div>\n<div><br>\n</div>\n<div>Produced by Sam Holmes</div>\n<div><br>\n</div>\n<div>Subscribe to <em>The Spectator </em>today and get a £20 Amazon gift voucher:</div>\n<div>\n<a href=\"http://www.spectator.co.uk/voucher\">www.spectator.co.uk/voucher</a> </div>\n<div><br>\n</div>\n<div>Listen to Lara's food podcast Table Talk:</div>\n<div><a href=\"https://www.spectator.co.uk/podcasts/table-talk\">https://www.spectator.co.uk/podcasts/table-talk </a></div>\n",
  "pubDate": "Thu, 06 Jan 2022 19:00:01 +0000",
  "guid": "tag:audioboom.com,2022-01-06:/posts/8008633",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}