{
  "title": "PODCAST 12-20-2018: Moroccan Islam, with Ann Marie Wainscott",
  "description": "<p>For our final regular podcast of 2018, I'm joined by political scientist Ann Marie Wainscott of Miami University of Ohio. Ann is currently researching the religious sector in Iraq, but I wanted to talk about her past work in Morocco (ruled by King Mohammed VI, pictured). We talk about the Moroccan government's efforts to bureaucratize religious expression after the Casablanca bombings of 2003, Morocco's efforts to position itself as a \"third pole\" in the Islamic World, between and apart from the Saudi-Iran rivalry. Finally she helps shed some light on conditions in the Rif surrounding the 2016-2017 Hirak Rif protests and on recent developments in the frozen Western Sahara conflict. This one will be open to the public. Enjoy!</p><p>Ann's book is <em>Bureaucratizing Islam </em>from <a target=\"_blank\" href=\"https://www.cambridge.org/core/books/bureaucratizing-islam/70BBBC09365C045A323B0DAE9B0CF18A\">Cambridge University Press</a>. The 2017 <em>Journal of Politics and Religion </em>article she mentions can be found <a target=\"_blank\" href=\"https://www.cambridge.org/core/journals/politics-and-religion/article/religious-regulation-as-foreign-policy-moroccos-islamic-diplomacy-in-west-africa/1F17F15E07C005AEE31FAE05C5CF6F8A\">here</a> if you have some institutional access, and she's also got a 2015 <a target=\"_blank\" href=\"https://www.tandfonline.com/eprint/GTf3Zxrc44TXBWAbIWFq/full\">article</a> in the <em>Journal of North African Studies </em>on Islamic education in Morocco post-Casablanca. Check out her website, <a target=\"_blank\" href=\"http://annmariewainscott.com/\">annmariewainscott.com</a>, and give her a follow on Twitter, <a target=\"_blank\" href=\"https://twitter.com/AnnMWainscott\">@AnnMWainscott</a>.</p><p>Finally, since this is it for our regular podcasts in 2018, let me say Happy Holidays to you and yours, and see you in 2019!</p> <br/><br/>This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit <a href=\"https://fx.substack.com/subscribe?utm_medium=podcast&utm_campaign=CTA_2\">fx.substack.com/subscribe</a>",
  "link": "https://fx.substack.com/p/podcast-12-20-2018-moroccan-islam",
  "guid": 47267,
  "dc:creator": "Derek Davison",
  "pubDate": "Thu, 20 Dec 2018 18:01:00 GMT",
  "enclosure": "",
  "itunes:author": "Derek Davison",
  "itunes:explicit": "No",
  "itunes:duration": 3279,
  "itunes:image": ""
}