{
  "id": "tag:blogger.com,1999:blog-1747027701196237068.post-4976755503411137829",
  "published": "2022-02-07T05:00:00.001-05:00",
  "updated": "2022-02-07T05:00:00.165-05:00",
  "title": "Black on the Prairies: Carol LaFayette-Boyd’s Story",
  "content": "<b>Editor's note: <i></i></b>This Black History Month, we’re highlighting Black-perspectives, and sharing stories from Black Googlers, partners, and culture shapers from across Canada.  <table cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto; text-align: justify;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/a/AVvXsEhEiiMjs3pvvmoekCeNFqe2BkyfWu3lNh-LF5uuhS-SbWzzUKzoXwuGJq-e378ZS6B-6zE43QPHsK_lT-Wnii3HnD9AF8ePds6W_FYImO_vpJqAOV4p3vcp4lmiF8xZZMwcAagt6WQnbGC-Eyn-aZ1OTQv2XUS8x4YZ7MN5eEzP4pfD_9vDX1HlN1C9=s512\" style=\"display: block; margin-left: auto; margin-right: auto; padding: 1em 0px; text-align: center;\"><img alt=\"\" border=\"0\" data-original-height=\"341\" data-original-width=\"512\" height=\"426\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEhEiiMjs3pvvmoekCeNFqe2BkyfWu3lNh-LF5uuhS-SbWzzUKzoXwuGJq-e378ZS6B-6zE43QPHsK_lT-Wnii3HnD9AF8ePds6W_FYImO_vpJqAOV4p3vcp4lmiF8xZZMwcAagt6WQnbGC-Eyn-aZ1OTQv2XUS8x4YZ7MN5eEzP4pfD_9vDX1HlN1C9=w640-h426\" width=\"640\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: justify;\"><span style=\"font-size: medium;\"><i style=\"text-align: left;\">LaFayette-Boyd, a Master’s Canada Athletics competitor, atop the podium at a track and field meet.</i><i style=\"text-align: left;\">&nbsp;<br /></i></span></td></tr></tbody></table><div style=\"text-align: left;\"><div style=\"text-align: justify;\"><br /></div>Black History Month is an opportunity for all of us to learn about the wide range of Black experiences, and the vital role our community has played throughout Saskatchewan’s shared history for over 100 years. As many of my relatives - especially the younger generation - do not look like me, I want them to be proud of our African heritage and all the contributions of people of African descent.&nbsp;</div><div><br /></div><div>In my growing up days we were referred to as various forms of the N-word and ‘Coloured’. I didn’t know us as Black until the Black is Beautiful and Black Power movements came in in the late 1960s.&nbsp;</div><div><br /></div><div>My dad’s parents came to Regina from Iowa in 1906.  My dad, Karl, was born in Regina in 1907.  They homesteaded out near Rosetown – west of Saskatoon in 1911.  My mom’s grandparents came to Canada in 1910 from Oklahoma. That year, over 200 people arrived from Oklahoma to Maidstone and Amber Valley, where my great grandparents went. I was born on a farm.  There were five born before me and the only one born in a hospital was our second brother who was born in June and it was easy to get there. There was no running water or electricity, but growing up on the farm leaves me with nothing but good memories of fun and harmony.  Although, now I cannot go for more than 24 hours without running water.  <div class=\"separator\" style=\"clear: both;\"><a href=\"https://blogger.googleusercontent.com/img/a/AVvXsEiS8j8Z1RqJYJgahQPJ2voJGdiQz6fOyoyihl-sGRnk8WSxnYYwgKrWaFuARHPgJUdJhP6i4IN7B6qMfCWEJToToPHsgjQ5hepeQ4MchqrZ_bO7wuY5TvH9aIlIntsZ4_9rNF7r3fZmaJ8oxqYN6bUU_9iQ5zUmhdWlr-juz1CGZDvT4GzKQ0KlF1kc=s512\" style=\"display: block; padding: 1em 0px; text-align: center;\"><img alt=\"\" border=\"0\" data-original-height=\"384\" data-original-width=\"512\" height=\"480\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEiS8j8Z1RqJYJgahQPJ2voJGdiQz6fOyoyihl-sGRnk8WSxnYYwgKrWaFuARHPgJUdJhP6i4IN7B6qMfCWEJToToPHsgjQ5hepeQ4MchqrZ_bO7wuY5TvH9aIlIntsZ4_9rNF7r3fZmaJ8oxqYN6bUU_9iQ5zUmhdWlr-juz1CGZDvT4GzKQ0KlF1kc=w640-h480\" width=\"640\" /></a></div> <b>What it was like being the only Black family and lessons learned&nbsp;</b></div><div><b></b>Being the sixth-born child in my family, it seems that I was protected from name calling as my siblings had taken care of that already.  They were always the fastest at track meets held with other communities and it was heard “run N-word run.” My parents taught me the saying that “sticks and stones will break your bones, but names will never hurt you”.  I really took that to heart.  They told me that the N-word meant the person felt bad about themselves, so put others down.  I looked it up in the dictionary and saw it meant “Stupid person” (but think now I was looking at a different word) – I knew I wasn’t a stupid person so those calling me that felt that way about themselves.  As a result, I never felt inferior to others; although I know at times I was treated as inferior to others.  In my work in particular, I saw discrimination towards minorities and women and did my best to stand up against it.  <div class=\"separator\" style=\"clear: both;\"><a href=\"https://blogger.googleusercontent.com/img/a/AVvXsEgjGlmEhQGAAneRWC_mfEWf_pfp4_Tq3kzEW9vjoPPI1rxchbS1pgUGWK_ggIHbFSWqGQ8TvMbzu4BGiZGB4PG1f6Ok_Lbo5TjX_ujZkbki1mh2C9u2fhOcgslf1F1xjIFH4083gBUHo9jRFNye6IdmWPW_4VJ1D15zgCAZ2kh4fnuDI5m_6jH-v6i2=s512\" style=\"display: block; padding: 1em 0px; text-align: center;\"><img alt=\"\" border=\"0\" data-original-height=\"512\" data-original-width=\"288\" height=\"640\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEgjGlmEhQGAAneRWC_mfEWf_pfp4_Tq3kzEW9vjoPPI1rxchbS1pgUGWK_ggIHbFSWqGQ8TvMbzu4BGiZGB4PG1f6Ok_Lbo5TjX_ujZkbki1mh2C9u2fhOcgslf1F1xjIFH4083gBUHo9jRFNye6IdmWPW_4VJ1D15zgCAZ2kh4fnuDI5m_6jH-v6i2=w361-h640\" width=\"361\" /></a></div> <b>Life in School</b></div><div><b></b>After my mom passed away, we moved to Regina where my Dad had found work after leaving the farm. In 1956, I was starting grade 9 and I found out many years later that my teacher had instructed the kids to be nice to me.  She had not told them that I was Black. I was the only Black student in the six high schools in the city until grade 12 that I know of.  There had been other people of African ancestry in Regina, but had left to live in either Calgary or Winnipeg where there was better opportunity for employment.&nbsp;</div><div><br /></div><div>One thing that most of us of African descent learned early on in life was that you had to give 200% in whatever you were trying to accomplish whether in school, work, sports, etc. in order to be accepted before others who might only give 50% effort and then the acceptance may not have come anyway.  That is not unfamiliar to what many women have faced in competition for work.  So a Black woman is facing double barriers.  Because of affirmative action rules, hopefully that is changing.&nbsp;</div><div><br /></div><div>As a person of African descent, I have always seen myself as a member of the human race and while living in Canada, that was my identity.  However, when I lived in the United States in the late 1960s and early 1970s, I was always aware that I was Black.  That did change until after Barack Obama was voted in as President. That moment made it feel like “now we are all members of the human race”.&nbsp;</div><div><br /></div><div>I think it is important to know and understand history so we will build on what is good and not repeat what isn’t.</div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Aaron Brindle",
    "uri": "http://www.blogger.com/profile/13885417405401273013",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}