{
  "title": "Did the Affordable Care Act Affect Access to Medications for Opioid Use Disorder among the Already Insured? Evidence from the Rhode Island All-payer Claims Database",
  "link": "https://fedinprint.org/item/fedbwp/93552/original",
  "description": "Previous research suggests that state Medicaid expansions implemented under the Patient Protection and Affordable Care Act (ACA) helped large numbers of patients suffering from opioid use disorder (OUD) gain access to life-saving medications, including buprenorphine. However, Medicaid expansions could have impeded access to care among individuals already enrolled in Medicaid, as new enrollees would have placed added demands on a limited supply of buprenorphine providers. Using a panel data set of medical claims from Rhode Island, we estimate the causal effects of the state’s January 2014 ACA implementation on buprenorphine receipt among incumbent (pre-ACA) Medicaid enrollees by leveraging geographic variation within Rhode Island in the intensity of treatment under the ACA. Using a difference-in-differences identification strategy, multivariate regression analysis yields no evidence that incumbent Medicaid enrollees experienced added \ndifficulties in accessing buprenorphine as a result of the ACA, despite the fact that both Medicaid and non-Medicaid enrollment increased substantially under the policy. Supply-side factors may have helped to blunt any negative fallout, as we find that the number of buprenorphine prescribers in the state increased fairly steadily during the two years leading up to January 2014 and for at least 15 months after that date. Also, the average number of buprenorphine recipients per prescriber increased rapidly after January 2014, suggesting that providers had unused treatment capacity before the policy went into effect.",
  "guid": "https://fedinprint.org/item/fedbwp/93552/original",
  "dc:creator": "Sullivan, Riley; Yu, Hao; Wharam, James Frank; Burke, Mary A.; Carman, Katherine Grace; Wen, Hefei",
  "dc:date": "2021-10-01",
  "rdau:hasExtent": 56,
  "dc:subject": "Medicaid expansion; opioid use disorder; methadone; buprenorphine; Rhode Island; all-payer claims database",
  "swpo:hasNumber": "21-17",
  "identifiers:doi": "10.29412/res.wp.2021.17",
  "bibo:series": "Working Papers"
}