{
  "id": "yt:video:YCsbbl9KA8M",
  "yt:videoId": "YCsbbl9KA8M",
  "yt:channelId": "UCHbMevniQEQnGZ4npjYSfaw",
  "title": "Scott Ambinder Has Docked At All 1,674 Citi Bike Stations",
  "link": "",
  "author": {
    "name": "Streetfilms",
    "uri": "https://www.youtube.com/channel/UCHbMevniQEQnGZ4npjYSfaw"
  },
  "published": "2022-06-14T01:00:10+00:00",
  "updated": "2022-09-04T03:41:47+00:00",
  "media:group": {
    "media:title": "Scott Ambinder Has Docked At All 1,674 Citi Bike Stations",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Scott Ambinder's dedication to Citi Bike is impressive. For one, he has docked at least once at all 1,674 locations throughout NYC (and New Jersey's Hoboken & Jersey City!) He's a fountain of knowledge when it comes to where stations are and what the neighborhoods look like around them. And certainly an expert on how to use the app, score membership extensions and where to look to see when a new station activates in the network.\n\nHe was always an avid Citi Bike fanatic but in the Summer of 2020 - and already a top 1% user and with Covid raging throughout NYC - he looked at the new City Explorer Map launched by Citi Bike and started pondering whether he could eventually return his bike at each docking station. Soon after he began strategizing how to attack specific neighborhood grids to maximize the number of stations on daily jaunts. But he added another impressive wrinkle to his accomplishment: he never used mass transit to start or finish his journeys (except to cross the river to NJ to get across the Hudson.)\n\nScott is only one of three Citi Bike members to crest the 1,600+ mark.\n\nStreetfilms followed him around for a few hours on two days to talk about his unique feat and enthusiasm for City Bike. (Editors Note: as you will discover in the film we met one weekend after Scott offered an incredibly kind gesture of help!)\n\nTowards the end of the film, Scott answered Streetfilms fans questions submitted for him to answer.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}