{
  "title": "‘Activist groups’ tanking Twitter profits – Musk",
  "link": "https://www.rt.com/news/565971-elon-musk-activists-advertiser-boycott/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565971-elon-musk-activists-advertiser-boycott/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/636567042030271f55419679.jpg\" /> Activist groups pressuring advertisers to boycott Twitter are a threat to free speech, owner Elon Musk claims <br/><a href=\"https://www.rt.com/news/565971-elon-musk-activists-advertiser-boycott/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The billionaire met this week with lobbyists to promise the site’s moderation policies would stay for now</strong></p>\n            \n                        \n            <p>Twitter owner Elon Musk has accused &ldquo;<em>activist groups</em>&rdquo; of &ldquo;<em>trying to destroy free speech in America</em>&rdquo; by pressuring advertisers to boycott his platform even though he hasn&rsquo;t changed any policies. The billionaire took to Twitter to complain about the &ldquo;<em>massive drop in revenue</em>&rdquo; on Friday.</p>\n<p>The platform is losing money &ldquo;<em>due to activist groups pressuring advertisers, even though nothing has changed with content moderation and we did everything we could to appease the activists</em>,&rdquo; Musk tweeted, calling the situation &ldquo;<em>extremely messed up!</em>&rdquo;</p>\n<p>&ldquo;<em>They&rsquo;re trying to destroy free speech in America</em>,&rdquo; he wrote.</p>\n<p>Musk held a Zoom call on Tuesday with representatives from the Stop Hate for Profit Coalition, a pressure group led by the ADL that has organized advertiser boycotts of social media platforms over perceived weaknesses in keeping out &ldquo;<em>hate speech</em>.&rdquo; Representatives from the NAACP, Color of Change, the Asian American Foundation, and the George Bush Presidential Center were also reportedly present, among others.&nbsp;</p>\n\n            <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Twitter has had a massive drop in revenue, due to activist groups pressuring advertisers, even though nothing has changed with content moderation and we did everything we could to appease the activists.<br><br>Extremely messed up! They’re trying to destroy free speech in America.</p>&mdash; Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1588538640401018880?ref_src=twsrc%5Etfw\">November 4, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n    \n\n<p>The coalition was able to secure all three of its &ldquo;<em>immediate requests</em>&rdquo; from the Tesla tycoon, according to multiple members and Musk himself.</p>\n<p>He promised not to replatform banned accounts before the midterm election results were certified or before a &ldquo;<em>clear process</em>&rdquo; had been devised, and vowed to keep in place &ldquo;<em>election integrity</em>&rdquo; measures. Additionally, Musk agreed to form a &ldquo;<em>content moderation council</em>&rdquo; that would include representatives from the ADL and other coalition members with &ldquo;<em>diverse</em>&rdquo; viewpoints.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6362b8d72030270c910771e3.jpg\" alt=\"Elon Musk attends a Halloween party in New York City, October 31, 2022\" />\n            <figcaption><a href=\"https://www.rt.com/news/565831-twiitter-accurate-information-musk/\">Elon Musk promises ‘most accurate source of information on Earth’</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Despite appearing to bring the self-described &ldquo;<em>free speech absolutist</em>&rdquo; to heel, ADL CEO Jonathan Greenblatt hinted that further controls might be necessary in a statement released following the call. He insisted &ldquo;<em>much more needs to be done to reduce lies and hate on Twitter</em>&rdquo; and said backtracking on previous progress was &ldquo;<em>not an option.</em>&rdquo;</p>\n<p>A few Twitter users had suggestions for how Musk might deal with the pressure campaign.&nbsp;</p>\n<p>&ldquo;<em>Name and shame the advertisers who are succumbing to the advertiser boycotts</em>,&rdquo; Mike Davis, co-founder of the Internet Accountability Project, <a href=\"https://twitter.com/mrddmia/status/1588557835792953345\" target=\"_blank\" rel=\"noopener noreferrer\">tweeted</a>, suggesting Musk&rsquo;s followers engage in a &ldquo;<em>counter-boycott</em>&rdquo; against them.&nbsp;</p>\n<p>More than three quarters of 2.7 million respondents agreed that advertisers should support free speech over political correctness when polled by Musk on Wednesday.</p>\n<p>Musk fired the board of directors and several high ranking executives upon taking over as CEO last week. However, he has attempted to reassure advertisers that the site would not become a &ldquo;<em>free-for-all hellscape, where anything can be said with no consequence</em>&rdquo; under his watch.</p>",
  "enclosure": "",
  "pubDate": "Fri, 04 Nov 2022 19:42:04 +0000",
  "dc:creator": "RT"
}