{
  "title": "169: Murder on Middle Beach: Part 2",
  "link": "https://audioboom.com/posts/7800518",
  "itunes:episode": 169,
  "itunes:title": "Murder on Middle Beach: Part 2",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3715,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On March 3rd, 2010, 48 year old Barbara Beach-Hamburg was found murdered in the side yard of her house in the wealthy town of Madison, Connecticut. The murder had been brutal and personal, and it completely changed the lives of Barbara’s two kids—18-year-old Madison and 16-year-old Ali. As years passed, Barbara’s murder remained unsolved and rumors swirled about who could have done it. Was it Barbara’s ex-husband, with whom she’d had bitter divorce? Was it her sister Conway who always lived in Barbara’s shadow? Could Ali have done it? Or could someone else have wanted Barbara dead? Over the course of 8 years, Madison, Barbara’s son, investigated her death by interviewing everyone in his family in a desperate quest to finally figure out what happened.<br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"A Wilderness of Error\" \"<strong>The Vow</strong>\" \"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Tue, 16 Feb 2021 11:00:00 +0000",
  "guid": "tag:audioboom.com,2021-02-15:/posts/7800518",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}