{
  "title": "The Tidyverse in a Table",
  "link": "",
  "updated": "2020-12-29T17:00:00+00:00",
  "id": "http://www.sumsar.net/blog/2020/12/tidyverse-in-a-table",
  "category": "",
  "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body>\n<p><em>This was my submission to the <a href=\"https://blog.rstudio.com/2020/09/15/announcing-the-2020-rstudio-table-contest/\">2020 RStudio Table Contest</a>. For many good reasons it didn’t qualify, you can check out all those good reasons here: <a href=\"https://blog.rstudio.com/2020/12/23/winners-of-the-2020-rstudio-table-contest/\">Winners of the 2020 RStudio Table Contest.\n</a></em></p>\n\n<p>Some tables are beautiful. And yes, I’m talking about the stats-and-numbers kind of tables and not the ones you get at IKEA. Some tables show carefully selected statistics, with headers in bold and spacious yet austere design; the numbers rounded to just the right number of decimal places. </p>\n\n<p>But here we’re not going to make a beautiful table, instead we’re making a <em>useful table</em>. In this tutorial, I’m going show you how to take all the documentation, for all the functions in <a href=\"https://www.tidyverse.org/packages/#core-tidyverse\">the <code>tidyverse</code> core packages</a>, and condense it into one single table. Why is this useful? As we’re going to use the excellent <a href=\"https://rstudio.github.io/DT/\">DT package</a> the result is going to be an interactive table that makes it easy to search, sort, and explore the functions of the tidyverse.</p>\n\n<p>Actually, let’s start with the finished table and then I’ll show you how it’s made. Or a screenshot of it, at least. To read on and to try out the interactive table <a href=\"http://www.sumsar.net/files/posts/2020-12-29-tidyverse-in-a-table/tidyverse_in_a_table.html\">check out my full submission here</a>.</p>\n\n<p><a href=\"http://www.sumsar.net/files/posts/2020-12-29-tidyverse-in-a-table/tidyverse_in_a_table.html\"><img src=\"http://www.sumsar.net/images/posts/2020-12-29-tidyverse-in-a-table/tidyverse-in-a-table.gif\" alt=\"\"></a></p>\n\n<!-- more -->\n\n</body></html>\n"
}