{
  "guid": "https://podcasts.nationalreview.com/?p=1706",
  "title": "Episode 14: Nicholas Confessore / Ryan Adams",
  "description": "<p>Jeff and Scot talk to Nicholas Confessore about Ryan Adams.</p>\n<p><span><strong>Introducing the Band<br />\n</strong></span>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\" target=\"_blank\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\" target=\"_blank\">@EsotericCD</a>) with guest Nicholas Confessore, investigative reporter for the <i>New York Times</i>, writer at large for the <i>NYT Magazine</i>, and MSNBC contributor. Follow Nick on Twitter at <a href=\"https://twitter.com/nickconfessore\" target=\"_blank\">@nickconfessore</a>, read his past work <a href=\"https://www.nytimes.com/by/nicholas-confessore\" target=\"_blank\">here</a>, and also please do set aside some time for this remarkable long-form piece <a href=\"https://www.nytimes.com/2016/11/30/magazine/how-to-hide-400-million.html?_r=2\" target=\"_blank\">here</a>.</p>\n<p><span><b>Nick’s Musical Pick: Ryan Adams<br />\n</b></span>The gang is extremely excited this week to be covering rocker/country-rocker/all-around-hyperprolific-polymath Ryan Adams, for this is not only one of our guest’s favorite artists, but perhaps co-host Scot’s as well. Scot explains how a chance encounter with Adams at a Chicago in-store performance back in 2000 led to a copy of <i>Heartbreaker</i> and a lifetime of fandom. Nick credits his buddy <a href=\"https://twitter.com/JoshuaGreen\">@JoshuaGreen</a> for introducing him to Adams during their days as fellow wage-slaves at the <i>Washington Monthly</i>. Nick never thought of himself as a fan of country or country-rock, but he was fascinated by Adams’ guitar-playing and quirky songwriting style and before he knew it was teaching himself every song on <i>Heartbreaker</i>. Jeff found Ryan Adams immediately after 9/11, when a friend gave him a copy of <i>Gold</i> as a gift and “New York New York” was just the right song at the right time for him.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=jzaen5ZDYZw\" target=\"_blank\">Amy</a>” (<i>Heartbreaker</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=JkaP1cZRNHM\" target=\"_blank\">New York, New York</a>” (<i>Gold</i>, 2001); “<a href=\"https://www.youtube.com/watch?v=fk_NvHH7Qxg\" target=\"_blank\">Jacksonville Skyline</a>” <span>[Whiskeytown]</span>(<i>Pneumonia</i>, 1999/2001)</p>\n<p><span><b>Origins: Whiskeytown<i>, </i>the Classic Debut <i>Heartbreaker</i>, and the Overstuffed Follow-up <i>Gold<br />\n</i></b></span><b></b>Valiant fools that the gang are, they have set for themselves an impossible task: dealing with the ridiculously enormous Ryan Adams discography in less than five hours. This is a guy who released, like, sixteen albums in 2005 alone after all (the numbers there may be a bit off). That means that certain parts of Adams’ career must, alas, get short shrift, and the sting is felt in his original pre-solo career group, the great alt-country band Whiskeytown. Scot, Nick and Jeff all love this material, but there just isn’t time, so Scot gives his “60 second history of Whiskeytown” (extremely talented country-rock group driven by Adams’ singing and songwriting that collapsed under record label disasters and its own sheer gravity).</p>\n<p>Then it’s on to <i>Heartbreaker</i> (2000), and the gang could have spent an hour on this album alone. Is it one of the greatest debut albums of all time? One of the greatest country-rock albums of all time? Is it even country at all? (Jeff, for one, thinks it owes far more to Bob Dylan and Neil Young than Nashville, despite Adams’ country background; already he was spreading his wings and refusing all stylistic straitjackets.) Scot declares <i>Heartbreaker</i>to be one of his favorite albums of all time, perhaps even his #1 pick. (Scot: “I can’t even be rational about it.”) Nick raves about how Adams creates an entire world with his soft, thoughtful folk melodies and lyrics: a New York City that isn’t quite New York and a Carolina that isn’t quite the real Carolina, but a magical, idealized version of both. Jeff marvels at how every song on <i>Heartbreaker</i> sounds like a standard — like people have been playing them for decades. And yet some young punk who came pretty much out of nowhere wrote them all, and did it on his first album. Jeff can’t even quite believe that “My Winding Wheel” was <i>written</i>; it just feels like it’s been kicking around Appalachia for a century or so.</p>\n<p><i>Gold</i> (2001) was Adams’ big grab for the brass ring (as Scot characterizes it), and its failings are telling, the gang agrees: here the first problematic tics of Adams’ career show up: over-prolificity, overstuffing his albums, and being a questionable judge of the quality of his own material. (Nick complains that many of the best songs were left off the original album and only released on a “Side 4” bonus disc that isn’t even commercially available anymore — and he’s right!) But Jeff will walk through fire to defend Adams’ big attempt at a pop hit “New York New York,” and also points out that Adams’ straight rock moves (like “Nobody Girl” and “Enemy Fire”) actually work extremely well, proving how capable he was of playing in genres outside of country and folk.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=MIrTfgi0C_Y\" target=\"_blank\">To Be Young (Is To Be Sad, Is To Be High)</a>” (<i>Heartbreaker</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=zNY1SS9sjao\" target=\"_blank\">My Winding Wheel</a>” (<i>Heartbreaker</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=19CFwwJnTOo&list=PLaEilnmerR8zXiYmqYgWHtQtlq-IBPIfl&index=5\" target=\"_blank\">Oh, My Sweet Carolina</a>” (<i>Heartbreaker</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=PmM2C6RHPwk\" target=\"_blank\">Come Pick Me Up</a>” (<i>Heartbreaker</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=hmHgY_J63Ik\" target=\"_blank\">New York, New York</a>” (<i>Gold</i>, 2001); “<a href=\"https://www.youtube.com/watch?v=j9yeDAgnSFo\" target=\"_blank\">Nobody Girl</a>” (<i>Gold</i>, 2001); “<a href=\"https://www.youtube.com/watch?v=HNqqAYHASEU\" target=\"_blank\">Enemy Fire</a>” (<i>Gold</i>, 2001); “<a href=\"https://www.youtube.com/watch?v=yTwLuNwdg_g\" target=\"_blank\">La Cienega Just Smiled</a>” (<i>Gold</i>, 2001); “<a href=\"https://www.youtube.com/watch?v=nbbpMDw12sI\" target=\"_blank\">When The Stars Go Blue</a>” (<i>Gold</i>, 2001); “<a href=\"https://www.youtube.com/watch?v=rRit8dFMt1s\" target=\"_blank\">Firecracker</a>” (<i>Gold</i>, 2001); “<a href=\"https://www.youtube.com/watch?v=VPxSASgAw1s\" target=\"_blank\">Gonna Make You Love Me</a>” (<i>Gold</i>, 2001);</p>\n<p><span><b>The Weird Years: <i>Demolition</i>, <i>Love Is Hell</i>, and <i>Rock N Roll<br />\n</i></b></span><b></b><i>Political Beats</i> gets spicy, as Scot, Nick, and Jeff all bounce off of one another like pinballs on bumpers debating the merits of Ryan Adams’ mixed-up muddled-up shook-up middle period: <i>Demolition</i> (2002), <i>Love Is Hell</i> (2004) and <i>Rock N Roll</i> (2003). Jeff thinks <i>Demolition</i> (which was infamously assembled like a Frankenstein’s monster out of the pieces of <u>four</u> rejected albums) is a dog’s breakfast, but Nick loves its rockist moves like “Starting To Hurt.” Then it’s Nick’s turn to be outraged: he threatens to hang up over the fact that Jeff thinks <i>Love Is Hell</i> (recorded in 2003, but not released until 2004) is one of Ryan Adams’ finest albums. Nick is wrong, of course; <i>Love Is Hell</i> is as far as Adams ever successfully migrated away from his country-rock roots (its key reference points are folk and British postpunk), and Jeff loves it for precisely that reason (even the cover of “Wonderwall” is amazing).</p>\n<p>“Successfully” is the key word in the preceding sentence, since <i>Rock N Roll</i> (2003) — recorded in an amphetamine-rushed two weeks after his record label rejected <i>Love Is Hell</i> — is of course Adams’ Big Major Rock Statement. Few albums are more controversial in the Adams discography than <i>Rock N Roll</i>, and Scot lines up with the general fan consensus that it’s embarrassing musical cosplay, Ryans Adams wearing The Strokes as a skin-suit. Nick is having none of that, however, and loves “rock Ryan,” with particular praise for “Do Miss America” and “This Is It.” (“This was the guy that I loved doing more of the thing that I loved that he did.”) Jeff falls in the middle; he doesn’t think this is a great album, but he’s pretty much willing to forgive all its sins simply because of the existence of “So Alive,” one of the finest songs (and vocal performances) Adams will ever reel off in his life. People, go watch Adams’ live performance of this on the David Letterman Show. The link is below. Click it.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=2MaGA_6Xlzo\" target=\"_blank\">Starting To Hurt</a>” (<i>Demolition</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=Kc2se4UcL90\" target=\"_blank\">Dear Chicago</a>” (<i>Demolition</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=UiUvttMIsik\" target=\"_blank\">Chin Up, Cheer Up</a>” (<i>Demolition</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=KP83frH3LbE\" target=\"_blank\">Hallelujah</a>” (<i>Demolition</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=MTEYEQZ1wHY\" target=\"_blank\">Tennessee Sucks</a>” (<i>Demolition</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=Dc3uxHXr_-Q\" target=\"_blank\">Afraid Not Scared</a>” (<i>Love Is Hell</i>, 2004); “<a href=\"https://www.youtube.com/watch?v=QIZ9QreW0hE\" target=\"_blank\">This House Is Not For Sale</a>” (<i>Love Is Hell</i>, 2004); “<a href=\"https://www.youtube.com/watch?v=GsSI19OU2Ws\" target=\"_blank\">Love Is Hell</a>” (<i>Love Is Hell</i>, 2004); “<a href=\"https://www.youtube.com/watch?v=jRJvGKQhATs\" target=\"_blank\">Wonderwall</a>” (<i>Love Is Hell</i>, 2004); “<a href=\"https://www.youtube.com/watch?v=KY_eos7G_zU\" target=\"_blank\">Please Do Not Let Me Go</a>” (<i>Love Is Hell</i>, 2004); “<a href=\"https://www.youtube.com/watch?v=RZUxRLNhxP8\" target=\"_blank\">I See Monsters</a>” (<i>Love Is Hell</i>, 2004); “<a href=\"https://www.youtube.com/watch?v=6K6g5mp9pNc\" target=\"_blank\">This Is It</a>” (<i>Rock N Roll</i>, 2003); “<a href=\"https://www.youtube.com/watch?v=JSltuHhd-cc\" target=\"_blank\">So Alive</a>” (<i>Rock N Roll</i>, 2003); “<a href=\"https://www.youtube.com/watch?v=kXw3nWfE1U4\" target=\"_blank\">Burning Photographs</a>” (<i>Rock N Roll</i>, 2003); “<a href=\"https://www.youtube.com/watch?v=o--y4YB-ayw\" target=\"_blank\">Anybody Wanna Take Me Home</a>” (<i>Rock N Roll</i>, 2003); “<a href=\"https://www.youtube.com/watch?v=PGSmEbWmUUU\" target=\"_blank\">Do Miss America</a>” (<i>Rock N Roll</i>, 2003); “<a href=\"https://www.youtube.com/watch?v=7wnePqQW6v4\" target=\"_blank\">So Alive (live on David Letterman, January 5th, 2004)</a>” (previously unreleased, 2004)</p>\n<p><span><b>2005: The Year of the Three (Yes, That’s Right, Three) Ryan Adams Albums<br />\n</b></span><b></b>In early 2005, the world greeted Ryan Adams’ declaration that he would be releasing, not one, not two, but THREE new albums with snickers. And then he silenced nearly every one of those skeptical voices by making two of those three records among the finest he ever recorded. <i>Cold Roses </i>is a double album inspired by Adams’ discovery of country-era Grateful Dead and Jerry Garcia, and amazingly it somehow manages to lack nearly any filler. (The title track, which Nick loves anyway, might be as close as it gets: “he called it a night halfway through the songwriting, was like ‘yeah….it sorta rhymes? We’ll go with it’.”) Otherwise, the gang is agreed on the greatness of <i>Cold Roses</i>: a great album full of extremely well-written songs performed by a crack band. It is telling indeed that all three of them cite to different songs as their favorites — proof, if any were needed, that this is a record with something to offer everyone. Also, everyone loves The Cardinals, the fine new band Adams put together to back him on this and subsequent records.<b><br />\n</b></p>\n<p>Nick, Scot, and Jeff are equally enthusiastic about <i>Jacksonville City Nights</i>, and lament the fact that people might be avoiding it because it was marketed as Adams’ “trad country” album. Yes, there are pedal steel guitars on nearly every song here, but this is as far from a generic country album as could be imagined: a warm, vibrant collection of some of Adams’ finest songs and (in particular) his finest lyrics. Nick wants people to own this album for no other reason than “Dear John,” Adams’ emotionally devastating collaboration with Norah Jones. Scot could talk about every single song on this record, but particularly adores “The Hardest Part” and Adams’ lived-in, casually country scansion on pieces like “The End.” All agree that this is part of the core Adams discography, which is more than they can say for the final Ryan Adams album of 2005, the mopey concept-folk LP <i>29</i>. Jeff suggests that Adams was better off not pushing his luck beyond the two classics he already released, and the gang agrees that this is the least worthy, and most mannered, of all Adams’ records up until this point.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=GtkiFpp2Kmg\" target=\"_blank\">Magnolia Mountain</a>” (<i>Cold Roses</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=VbeBcXARzEo\" target=\"_blank\">Cherry Lane</a>” (<i>Cold Roses</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=Xh_Au8mWJXE\" target=\"_blank\">Mockingbird</a>” (<i>Cold Roses</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=vOF4Uxia788\" target=\"_blank\">Let It Ride</a>” (<i>Cold Roses</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=5aDu3ByWyGM\" target=\"_blank\">Cold Roses</a>” (<i>Cold Roses</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=v-Bs4iaRUos\" target=\"_blank\">Sweet Illusions</a>” (<i>Cold Roses</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=kbxuefz21K0\" target=\"_blank\">Meadowlake Street</a>” (<i>Cold Roses</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=CvdGNfx8sok\" target=\"_blank\">If I Am A Strange</a>r” (<i>Cold Roses</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=QGGaV8kMQco\" target=\"_blank\">Friends</a>” (<i>Cold Roses</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=txtM_leOjXE\" target=\"_blank\">The Hardest Part</a>” (<i>Jacksonville City Nights</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=qvggxtB3A0k\" target=\"_blank\">Silver Bullets</a>” (<i>Jacksonville City Nights</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=UK9Z6gZBGLg\" target=\"_blank\">Don’t Fail Me Now</a>” (<i>Jacksonville City Nights</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=KojMnQJA3AU\" target=\"_blank\">Trains</a>” (<i>Jacksonville City Nights</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=E6QkQgLwV9k\" target=\"_blank\">The End</a>” (<i>Jacksonville City Nights</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=auV1SBQBFIg\" target=\"_blank\">Dear John</a>” <span>[with Norah Jones]</span> (<i>Jacksonville City Nights</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=-iDc7ceUcXM\" target=\"_blank\">Strawberry Wine</a>” (<i>29</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=G9varSGwbrs\" target=\"_blank\">Night Birds</a>” (<i>29</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=XvYg6_FU_H4\" target=\"_blank\">Carolina Rain (live June 23rd, 2011)</a>” (<i>Live After Deaf</i>, 2012; originally from <i>29</i>, 2005)</p>\n<p><span><b>Ryan Adams Sobers Up: <i>Easy Tiger</i> and the <i>Cardinology</i> Sessions<br />\n</b></span><b></b>After years of drug addiction (which clearly fueled his manic creativity), Adams finally sobered up after 2005 and slowed down his pace. 2007 saw <i>Easy Tiger</i>, which marks the end of an era in many ways — it’s an album that neither Jeff nor Scot can muster particularly strong feelings about (though Scot still loves Ryan when he’s in his Big Dumb Rock Riff mode, c.f. “Halloweenhead”), but Nick insists that “Everybody Knows” is one of Adams’ finest songs. Jeff tracks with most fans in having little time for <i>Cardinology</i> (after which Adams disbanded The Cardinals), but Scot makes an impassioned plea for it, and for “Magick” in particular. Nick pithily disposes of the later semi-archival double album <i>III/IV</i>, which consists entirely of outtakes from <i>Cardinology</i>: “it’s the same album, except it just gets worse and worse.”</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=YDL7A0IsVbM\" target=\"_blank\">Halloweenhead</a>” (<i>Easy Tiger</i>, 2007); “<a href=\"https://www.youtube.com/watch?v=PePUWpJDXC0\" target=\"_blank\">Pearls On A String</a>” (<i>Easy Tiger</i>, 2007); “<a href=\"https://www.youtube.com/watch?v=OnmTucafcGU\" target=\"_blank\">Two</a>” (<i>Easy Tiger</i>, 2007); “<a href=\"https://www.youtube.com/watch?v=dvuGGhDSLEk\" target=\"_blank\">Everybody Knows</a>” (<i>Easy Tiger</i>, 2007); “<a href=\"https://www.youtube.com/watch?v=zpWAQK6TNGU\" target=\"_blank\">Born Into A Light</a>” (<i>Cardinology</i>, 2008); “<a href=\"https://www.youtube.com/watch?v=LSyo6_z_yZo\" target=\"_blank\">Go Easy</a>” (<i>Cardinology</i>, 2008); “<a href=\"https://www.youtube.com/watch?v=TmmRQ5r79qI\" target=\"_blank\">Magick</a>” (<i>Cardinology</i>, 2008); “<a href=\"https://www.youtube.com/watch?v=GkjNSQpvXIU\" target=\"_blank\">Cobwebs</a>” (<i>Cardinology</i>, 2008); “<a href=\"https://www.youtube.com/watch?v=jjSueJQ9J88\" target=\"_blank\">Dear Candy</a>” (<i>III/IV</i>, 2010)</p>\n<p><span><strong>To the Present Day: Ryan Adams Reclines then Roars Back<br />\n</strong></span><b></b>Were it not for the final album (taking us up to the present day), this period might have represented Ryan Adams’ curious dotage as an artist. First there’s <i>Orion </i>(2010), a hardcore/heavy-metal (yes, you read correctly) album that is little more than a deeply embarrassing genre experiment. (Jeff: “please do not listen to this.”) Then there’s the undistinguishedly mellow <i>Ashes And Fire</i>, a perfectly cromulent album of sedate folk ballads that none of the gang can muster real disdain for, but which also doesn’t earn any higher praise than “a nice record to do the dishes to.” <i>Ryan Adams</i> (2014), however, is praised by both Scot and Nick as the beginning of a comeback, with far more sonic and textural interest than his past several records.</p>\n<p>At this point Jeff steps in to make a 100% serious plea for people to give Ryan Adams’ track-for-track re-recording of Taylor Swift’s <i>1989</i> (2015) a chance, no matter how utterly ridiculous the idea must sound. A good song is a good song, and Adams’ entire point in recording and releasing his version of <i>1989</i> (where he recasts many of its most famous songs as brutal <i>Nebraska</i>-era Springsteen ballads) is to emphasize to those who might otherwise dismiss pop music what a fine songwriter Taylor Swift actually is. The gang concludes with high praise for Ryan Adams’ most recent album, 2017’s <i>Prisoner</i>. All are impressed by the vigor and vitality of this music from an artist who has already released well over 200 original songs in the past 17 years — as well as the fact that (my God!) he might actually finally be learning to edit himself.</p>\n<p><u>KEY TRACKS</u>: “[<a href=\"https://www.youtube.com/watch?v=5w02O-XdsXE\" target=\"_blank\">This Is What Every Single Song On <i>Orion</i> Sounds Like</a>]” (<i>Metal Machine Music </i><span>[Lou Reed]</span>, 1975); “<a href=\"https://www.youtube.com/watch?v=UAeS61OVsIQ\" target=\"_blank\">Dirty Rain</a>” (<i>Ashes & Fire</i>, 2011); “<a href=\"https://www.youtube.com/watch?v=aVhZkt_XqnE\" target=\"_blank\">Invisible Riverside</a>” (<i>Ashes & Fire</i>, 2011); “<a href=\"https://www.youtube.com/watch?v=RunG7BPeD_E\" target=\"_blank\">Gimme Something Good</a>” (<i>Ryan Adams</i>, 2014); “<a href=\"https://www.youtube.com/watch?v=BfAENOAwk8U\" target=\"_blank\">Trouble</a>” (<i>Ryan Adams</i>, 2014); “<a href=\"https://www.youtube.com/watch?v=5cKtuAIbOdA\" target=\"_blank\">My Wrecking Ball</a>” (<i>Ryan Adams</i>, 2014); “<a href=\"https://www.youtube.com/watch?v=9V-8VP5dnrQ\" target=\"_blank\">Bad Blood</a>” (<i>1989</i>, 2015); “<a href=\"https://www.youtube.com/watch?v=PwmXO0J-PAA\" target=\"_blank\">Shake It Off</a>” (<i>1989</i>, 2015); “<a href=\"https://www.youtube.com/watch?v=R3xZYemGLdQ\" target=\"_blank\">To Be Without You</a>” (<i>Prisoner</i>, 2017); “<a href=\"https://www.youtube.com/watch?v=Ot0To3ult6k\" target=\"_blank\">Do You Still Love Me?</a>” (<i>Prisoner</i>, 2017); “<a href=\"https://www.youtube.com/watch?v=AiupLuwENyk\" target=\"_blank\">Shiver And Shake</a>” (<i>Prisoner</i>, 2017)</p>\n<p><span><b>Finale: Nick, Scot and Jeff Each Name Their Two Key Albums and Five Key Songs from Ryan Adams<br />\n</b></span><u>Nick’s albums</u><b>: </b>1) <i>Heartbreaker</i> (2000); 2) <i>Cold Roses</i> (2005) | <u>Nick’s songs</u><b>: </b>1) “Magnolia Mountain” (<i>Cold Roses</i>, 2005); 2) “Oh My Sweet Carolina” (<i>Heartbreaker</i>, 2000); 3) “Dear John” (<i>Jacksonville City Nights</i>, 2005); 4) “Everybody Knows” (<i>Easy Tiger</i>, 2007); 5) “<a href=\"https://www.youtube.com/watch?v=UyiRT1keaZY\" target=\"_blank\">16 Days</a>” <span>[Whiskeytown]</span> (<i>Strangers Almanac</i>, 1997)</p>\n<p><u>Scot’s albums</u>: 1) <i>Heartbreaker</i> (2000); 2) <i>Jacksonville City Nights</i> (2005) | <u>Scot’s songs</u>: 1) “Come Pick Me Up” (<i>Heartbreaker</i>, 2000<i>)</i> ; 2) “Please Do Not Let Me Go” (<i>Love Is Hell</i>, 2004); 3) “Let It Ride” (<i>Cold Roses</i>, 2005); 4) “The Hardest Part” (<i>Jacksonville City Nights</i>, 2005); 5) “<a href=\"https://www.youtube.com/watch?v=oWgtiCAkgQ4\" target=\"_blank\">Rosalie Come And Go</a>” (<i>Gold</i>, 2001)</p>\n<p><u>Jeff’s albums</u>: 1) <i>Heartbreaker</i> (2000); 2) <i>Love Is Hell</i> (2004) | <u>Jeff’s songs</u>: 1) “My Winding Wheel” (<i>Heartbreaker</i>, 2000); 2) “New York, New York” (<i>Gold</i>, 2001); 3) “So Alive” (<i>Rock N Roll</i>, 2003); 4) “Afraid Not Scared” (<i>Love Is Hell</i>, 2004); 5) “Meadowlake Street” (<i>Cold Roses</i>, 2005)</p>\n",
  "pubDate": "Mon, 20 Nov 2017 07:08:52 +0000",
  "author": "studio@nationalreview.com (National Review)",
  "link": "https://www.nationalreview.com/media/political-beats",
  "content:encoded": "<p>Jeff and Scot talk to Nicholas Confessore about Ryan Adams.</p>\n<p><span><strong>Introducing the Band<br />\n</strong></span>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\" target=\"_blank\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\" target=\"_blank\">@EsotericCD</a>) with guest Nicholas Confessore, investigative reporter for the <i>New York Times</i>, writer at large for the <i>NYT Magazine</i>, and MSNBC contributor. Follow Nick on Twitter at <a href=\"https://twitter.com/nickconfessore\" target=\"_blank\">@nickconfessore</a>, read his past work <a href=\"https://www.nytimes.com/by/nicholas-confessore\" target=\"_blank\">here</a>, and also please do set aside some time for this remarkable long-form piece <a href=\"https://www.nytimes.com/2016/11/30/magazine/how-to-hide-400-million.html?_r=2\" target=\"_blank\">here</a>.</p>\n<p><span><b>Nick’s Musical Pick: Ryan Adams<br />\n</b></span>The gang is extremely excited this week to be covering rocker/country-rocker/all-around-hyperprolific-polymath Ryan Adams, for this is not only one of our guest’s favorite artists, but perhaps co-host Scot’s as well. Scot explains how a chance encounter with Adams at a Chicago in-store performance back in 2000 led to a copy of <i>Heartbreaker</i> and a lifetime of fandom. Nick credits his buddy <a href=\"https://twitter.com/JoshuaGreen\">@JoshuaGreen</a> for introducing him to Adams during their days as fellow wage-slaves at the <i>Washington Monthly</i>. Nick never thought of himself as a fan of country or country-rock, but he was fascinated by Adams’ guitar-playing and quirky songwriting style and before he knew it was teaching himself every song on <i>Heartbreaker</i>. Jeff found Ryan Adams immediately after 9/11, when a friend gave him a copy of <i>Gold</i> as a gift and “New York New York” was just the right song at the right time for him.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=jzaen5ZDYZw\" target=\"_blank\">Amy</a>” (<i>Heartbreaker</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=JkaP1cZRNHM\" target=\"_blank\">New York, New York</a>” (<i>Gold</i>, 2001); “<a href=\"https://www.youtube.com/watch?v=fk_NvHH7Qxg\" target=\"_blank\">Jacksonville Skyline</a>” <span>[Whiskeytown]</span>(<i>Pneumonia</i>, 1999/2001)</p>\n<p><span><b>Origins: Whiskeytown<i>, </i>the Classic Debut <i>Heartbreaker</i>, and the Overstuffed Follow-up <i>Gold<br />\n</i></b></span><b></b>Valiant fools that the gang are, they have set for themselves an impossible task: dealing with the ridiculously enormous Ryan Adams discography in less than five hours. This is a guy who released, like, sixteen albums in 2005 alone after all (the numbers there may be a bit off). That means that certain parts of Adams’ career must, alas, get short shrift, and the sting is felt in his original pre-solo career group, the great alt-country band Whiskeytown. Scot, Nick and Jeff all love this material, but there just isn’t time, so Scot gives his “60 second history of Whiskeytown” (extremely talented country-rock group driven by Adams’ singing and songwriting that collapsed under record label disasters and its own sheer gravity).</p>\n<p>Then it’s on to <i>Heartbreaker</i> (2000), and the gang could have spent an hour on this album alone. Is it one of the greatest debut albums of all time? One of the greatest country-rock albums of all time? Is it even country at all? (Jeff, for one, thinks it owes far more to Bob Dylan and Neil Young than Nashville, despite Adams’ country background; already he was spreading his wings and refusing all stylistic straitjackets.) Scot declares <i>Heartbreaker</i>to be one of his favorite albums of all time, perhaps even his #1 pick. (Scot: “I can’t even be rational about it.”) Nick raves about how Adams creates an entire world with his soft, thoughtful folk melodies and lyrics: a New York City that isn’t quite New York and a Carolina that isn’t quite the real Carolina, but a magical, idealized version of both. Jeff marvels at how every song on <i>Heartbreaker</i> sounds like a standard — like people have been playing them for decades. And yet some young punk who came pretty much out of nowhere wrote them all, and did it on his first album. Jeff can’t even quite believe that “My Winding Wheel” was <i>written</i>; it just feels like it’s been kicking around Appalachia for a century or so.</p>\n<p><i>Gold</i> (2001) was Adams’ big grab for the brass ring (as Scot characterizes it), and its failings are telling, the gang agrees: here the first problematic tics of Adams’ career show up: over-prolificity, overstuffing his albums, and being a questionable judge of the quality of his own material. (Nick complains that many of the best songs were left off the original album and only released on a “Side 4” bonus disc that isn’t even commercially available anymore — and he’s right!) But Jeff will walk through fire to defend Adams’ big attempt at a pop hit “New York New York,” and also points out that Adams’ straight rock moves (like “Nobody Girl” and “Enemy Fire”) actually work extremely well, proving how capable he was of playing in genres outside of country and folk.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=MIrTfgi0C_Y\" target=\"_blank\">To Be Young (Is To Be Sad, Is To Be High)</a>” (<i>Heartbreaker</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=zNY1SS9sjao\" target=\"_blank\">My Winding Wheel</a>” (<i>Heartbreaker</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=19CFwwJnTOo&list=PLaEilnmerR8zXiYmqYgWHtQtlq-IBPIfl&index=5\" target=\"_blank\">Oh, My Sweet Carolina</a>” (<i>Heartbreaker</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=PmM2C6RHPwk\" target=\"_blank\">Come Pick Me Up</a>” (<i>Heartbreaker</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=hmHgY_J63Ik\" target=\"_blank\">New York, New York</a>” (<i>Gold</i>, 2001); “<a href=\"https://www.youtube.com/watch?v=j9yeDAgnSFo\" target=\"_blank\">Nobody Girl</a>” (<i>Gold</i>, 2001); “<a href=\"https://www.youtube.com/watch?v=HNqqAYHASEU\" target=\"_blank\">Enemy Fire</a>” (<i>Gold</i>, 2001); “<a href=\"https://www.youtube.com/watch?v=yTwLuNwdg_g\" target=\"_blank\">La Cienega Just Smiled</a>” (<i>Gold</i>, 2001); “<a href=\"https://www.youtube.com/watch?v=nbbpMDw12sI\" target=\"_blank\">When The Stars Go Blue</a>” (<i>Gold</i>, 2001); “<a href=\"https://www.youtube.com/watch?v=rRit8dFMt1s\" target=\"_blank\">Firecracker</a>” (<i>Gold</i>, 2001); “<a href=\"https://www.youtube.com/watch?v=VPxSASgAw1s\" target=\"_blank\">Gonna Make You Love Me</a>” (<i>Gold</i>, 2001);</p>\n<p><span><b>The Weird Years: <i>Demolition</i>, <i>Love Is Hell</i>, and <i>Rock N Roll<br />\n</i></b></span><b></b><i>Political Beats</i> gets spicy, as Scot, Nick, and Jeff all bounce off of one another like pinballs on bumpers debating the merits of Ryan Adams’ mixed-up muddled-up shook-up middle period: <i>Demolition</i> (2002), <i>Love Is Hell</i> (2004) and <i>Rock N Roll</i> (2003). Jeff thinks <i>Demolition</i> (which was infamously assembled like a Frankenstein’s monster out of the pieces of <u>four</u> rejected albums) is a dog’s breakfast, but Nick loves its rockist moves like “Starting To Hurt.” Then it’s Nick’s turn to be outraged: he threatens to hang up over the fact that Jeff thinks <i>Love Is Hell</i> (recorded in 2003, but not released until 2004) is one of Ryan Adams’ finest albums. Nick is wrong, of course; <i>Love Is Hell</i> is as far as Adams ever successfully migrated away from his country-rock roots (its key reference points are folk and British postpunk), and Jeff loves it for precisely that reason (even the cover of “Wonderwall” is amazing).</p>\n<p>“Successfully” is the key word in the preceding sentence, since <i>Rock N Roll</i> (2003) — recorded in an amphetamine-rushed two weeks after his record label rejected <i>Love Is Hell</i> — is of course Adams’ Big Major Rock Statement. Few albums are more controversial in the Adams discography than <i>Rock N Roll</i>, and Scot lines up with the general fan consensus that it’s embarrassing musical cosplay, Ryans Adams wearing The Strokes as a skin-suit. Nick is having none of that, however, and loves “rock Ryan,” with particular praise for “Do Miss America” and “This Is It.” (“This was the guy that I loved doing more of the thing that I loved that he did.”) Jeff falls in the middle; he doesn’t think this is a great album, but he’s pretty much willing to forgive all its sins simply because of the existence of “So Alive,” one of the finest songs (and vocal performances) Adams will ever reel off in his life. People, go watch Adams’ live performance of this on the David Letterman Show. The link is below. Click it.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=2MaGA_6Xlzo\" target=\"_blank\">Starting To Hurt</a>” (<i>Demolition</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=Kc2se4UcL90\" target=\"_blank\">Dear Chicago</a>” (<i>Demolition</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=UiUvttMIsik\" target=\"_blank\">Chin Up, Cheer Up</a>” (<i>Demolition</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=KP83frH3LbE\" target=\"_blank\">Hallelujah</a>” (<i>Demolition</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=MTEYEQZ1wHY\" target=\"_blank\">Tennessee Sucks</a>” (<i>Demolition</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=Dc3uxHXr_-Q\" target=\"_blank\">Afraid Not Scared</a>” (<i>Love Is Hell</i>, 2004); “<a href=\"https://www.youtube.com/watch?v=QIZ9QreW0hE\" target=\"_blank\">This House Is Not For Sale</a>” (<i>Love Is Hell</i>, 2004); “<a href=\"https://www.youtube.com/watch?v=GsSI19OU2Ws\" target=\"_blank\">Love Is Hell</a>” (<i>Love Is Hell</i>, 2004); “<a href=\"https://www.youtube.com/watch?v=jRJvGKQhATs\" target=\"_blank\">Wonderwall</a>” (<i>Love Is Hell</i>, 2004); “<a href=\"https://www.youtube.com/watch?v=KY_eos7G_zU\" target=\"_blank\">Please Do Not Let Me Go</a>” (<i>Love Is Hell</i>, 2004); “<a href=\"https://www.youtube.com/watch?v=RZUxRLNhxP8\" target=\"_blank\">I See Monsters</a>” (<i>Love Is Hell</i>, 2004); “<a href=\"https://www.youtube.com/watch?v=6K6g5mp9pNc\" target=\"_blank\">This Is It</a>” (<i>Rock N Roll</i>, 2003); “<a href=\"https://www.youtube.com/watch?v=JSltuHhd-cc\" target=\"_blank\">So Alive</a>” (<i>Rock N Roll</i>, 2003); “<a href=\"https://www.youtube.com/watch?v=kXw3nWfE1U4\" target=\"_blank\">Burning Photographs</a>” (<i>Rock N Roll</i>, 2003); “<a href=\"https://www.youtube.com/watch?v=o--y4YB-ayw\" target=\"_blank\">Anybody Wanna Take Me Home</a>” (<i>Rock N Roll</i>, 2003); “<a href=\"https://www.youtube.com/watch?v=PGSmEbWmUUU\" target=\"_blank\">Do Miss America</a>” (<i>Rock N Roll</i>, 2003); “<a href=\"https://www.youtube.com/watch?v=7wnePqQW6v4\" target=\"_blank\">So Alive (live on David Letterman, January 5th, 2004)</a>” (previously unreleased, 2004)</p>\n<p><span><b>2005: The Year of the Three (Yes, That’s Right, Three) Ryan Adams Albums<br />\n</b></span><b></b>In early 2005, the world greeted Ryan Adams’ declaration that he would be releasing, not one, not two, but THREE new albums with snickers. And then he silenced nearly every one of those skeptical voices by making two of those three records among the finest he ever recorded. <i>Cold Roses </i>is a double album inspired by Adams’ discovery of country-era Grateful Dead and Jerry Garcia, and amazingly it somehow manages to lack nearly any filler. (The title track, which Nick loves anyway, might be as close as it gets: “he called it a night halfway through the songwriting, was like ‘yeah….it sorta rhymes? We’ll go with it’.”) Otherwise, the gang is agreed on the greatness of <i>Cold Roses</i>: a great album full of extremely well-written songs performed by a crack band. It is telling indeed that all three of them cite to different songs as their favorites — proof, if any were needed, that this is a record with something to offer everyone. Also, everyone loves The Cardinals, the fine new band Adams put together to back him on this and subsequent records.<b><br />\n</b></p>\n<p>Nick, Scot, and Jeff are equally enthusiastic about <i>Jacksonville City Nights</i>, and lament the fact that people might be avoiding it because it was marketed as Adams’ “trad country” album. Yes, there are pedal steel guitars on nearly every song here, but this is as far from a generic country album as could be imagined: a warm, vibrant collection of some of Adams’ finest songs and (in particular) his finest lyrics. Nick wants people to own this album for no other reason than “Dear John,” Adams’ emotionally devastating collaboration with Norah Jones. Scot could talk about every single song on this record, but particularly adores “The Hardest Part” and Adams’ lived-in, casually country scansion on pieces like “The End.” All agree that this is part of the core Adams discography, which is more than they can say for the final Ryan Adams album of 2005, the mopey concept-folk LP <i>29</i>. Jeff suggests that Adams was better off not pushing his luck beyond the two classics he already released, and the gang agrees that this is the least worthy, and most mannered, of all Adams’ records up until this point.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=GtkiFpp2Kmg\" target=\"_blank\">Magnolia Mountain</a>” (<i>Cold Roses</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=VbeBcXARzEo\" target=\"_blank\">Cherry Lane</a>” (<i>Cold Roses</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=Xh_Au8mWJXE\" target=\"_blank\">Mockingbird</a>” (<i>Cold Roses</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=vOF4Uxia788\" target=\"_blank\">Let It Ride</a>” (<i>Cold Roses</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=5aDu3ByWyGM\" target=\"_blank\">Cold Roses</a>” (<i>Cold Roses</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=v-Bs4iaRUos\" target=\"_blank\">Sweet Illusions</a>” (<i>Cold Roses</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=kbxuefz21K0\" target=\"_blank\">Meadowlake Street</a>” (<i>Cold Roses</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=CvdGNfx8sok\" target=\"_blank\">If I Am A Strange</a>r” (<i>Cold Roses</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=QGGaV8kMQco\" target=\"_blank\">Friends</a>” (<i>Cold Roses</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=txtM_leOjXE\" target=\"_blank\">The Hardest Part</a>” (<i>Jacksonville City Nights</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=qvggxtB3A0k\" target=\"_blank\">Silver Bullets</a>” (<i>Jacksonville City Nights</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=UK9Z6gZBGLg\" target=\"_blank\">Don’t Fail Me Now</a>” (<i>Jacksonville City Nights</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=KojMnQJA3AU\" target=\"_blank\">Trains</a>” (<i>Jacksonville City Nights</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=E6QkQgLwV9k\" target=\"_blank\">The End</a>” (<i>Jacksonville City Nights</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=auV1SBQBFIg\" target=\"_blank\">Dear John</a>” <span>[with Norah Jones]</span> (<i>Jacksonville City Nights</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=-iDc7ceUcXM\" target=\"_blank\">Strawberry Wine</a>” (<i>29</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=G9varSGwbrs\" target=\"_blank\">Night Birds</a>” (<i>29</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=XvYg6_FU_H4\" target=\"_blank\">Carolina Rain (live June 23rd, 2011)</a>” (<i>Live After Deaf</i>, 2012; originally from <i>29</i>, 2005)</p>\n<p><span><b>Ryan Adams Sobers Up: <i>Easy Tiger</i> and the <i>Cardinology</i> Sessions<br />\n</b></span><b></b>After years of drug addiction (which clearly fueled his manic creativity), Adams finally sobered up after 2005 and slowed down his pace. 2007 saw <i>Easy Tiger</i>, which marks the end of an era in many ways — it’s an album that neither Jeff nor Scot can muster particularly strong feelings about (though Scot still loves Ryan when he’s in his Big Dumb Rock Riff mode, c.f. “Halloweenhead”), but Nick insists that “Everybody Knows” is one of Adams’ finest songs. Jeff tracks with most fans in having little time for <i>Cardinology</i> (after which Adams disbanded The Cardinals), but Scot makes an impassioned plea for it, and for “Magick” in particular. Nick pithily disposes of the later semi-archival double album <i>III/IV</i>, which consists entirely of outtakes from <i>Cardinology</i>: “it’s the same album, except it just gets worse and worse.”</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=YDL7A0IsVbM\" target=\"_blank\">Halloweenhead</a>” (<i>Easy Tiger</i>, 2007); “<a href=\"https://www.youtube.com/watch?v=PePUWpJDXC0\" target=\"_blank\">Pearls On A String</a>” (<i>Easy Tiger</i>, 2007); “<a href=\"https://www.youtube.com/watch?v=OnmTucafcGU\" target=\"_blank\">Two</a>” (<i>Easy Tiger</i>, 2007); “<a href=\"https://www.youtube.com/watch?v=dvuGGhDSLEk\" target=\"_blank\">Everybody Knows</a>” (<i>Easy Tiger</i>, 2007); “<a href=\"https://www.youtube.com/watch?v=zpWAQK6TNGU\" target=\"_blank\">Born Into A Light</a>” (<i>Cardinology</i>, 2008); “<a href=\"https://www.youtube.com/watch?v=LSyo6_z_yZo\" target=\"_blank\">Go Easy</a>” (<i>Cardinology</i>, 2008); “<a href=\"https://www.youtube.com/watch?v=TmmRQ5r79qI\" target=\"_blank\">Magick</a>” (<i>Cardinology</i>, 2008); “<a href=\"https://www.youtube.com/watch?v=GkjNSQpvXIU\" target=\"_blank\">Cobwebs</a>” (<i>Cardinology</i>, 2008); “<a href=\"https://www.youtube.com/watch?v=jjSueJQ9J88\" target=\"_blank\">Dear Candy</a>” (<i>III/IV</i>, 2010)</p>\n<p><span><strong>To the Present Day: Ryan Adams Reclines then Roars Back<br />\n</strong></span><b></b>Were it not for the final album (taking us up to the present day), this period might have represented Ryan Adams’ curious dotage as an artist. First there’s <i>Orion </i>(2010), a hardcore/heavy-metal (yes, you read correctly) album that is little more than a deeply embarrassing genre experiment. (Jeff: “please do not listen to this.”) Then there’s the undistinguishedly mellow <i>Ashes And Fire</i>, a perfectly cromulent album of sedate folk ballads that none of the gang can muster real disdain for, but which also doesn’t earn any higher praise than “a nice record to do the dishes to.” <i>Ryan Adams</i> (2014), however, is praised by both Scot and Nick as the beginning of a comeback, with far more sonic and textural interest than his past several records.</p>\n<p>At this point Jeff steps in to make a 100% serious plea for people to give Ryan Adams’ track-for-track re-recording of Taylor Swift’s <i>1989</i> (2015) a chance, no matter how utterly ridiculous the idea must sound. A good song is a good song, and Adams’ entire point in recording and releasing his version of <i>1989</i> (where he recasts many of its most famous songs as brutal <i>Nebraska</i>-era Springsteen ballads) is to emphasize to those who might otherwise dismiss pop music what a fine songwriter Taylor Swift actually is. The gang concludes with high praise for Ryan Adams’ most recent album, 2017’s <i>Prisoner</i>. All are impressed by the vigor and vitality of this music from an artist who has already released well over 200 original songs in the past 17 years — as well as the fact that (my God!) he might actually finally be learning to edit himself.</p>\n<p><u>KEY TRACKS</u>: “[<a href=\"https://www.youtube.com/watch?v=5w02O-XdsXE\" target=\"_blank\">This Is What Every Single Song On <i>Orion</i> Sounds Like</a>]” (<i>Metal Machine Music </i><span>[Lou Reed]</span>, 1975); “<a href=\"https://www.youtube.com/watch?v=UAeS61OVsIQ\" target=\"_blank\">Dirty Rain</a>” (<i>Ashes & Fire</i>, 2011); “<a href=\"https://www.youtube.com/watch?v=aVhZkt_XqnE\" target=\"_blank\">Invisible Riverside</a>” (<i>Ashes & Fire</i>, 2011); “<a href=\"https://www.youtube.com/watch?v=RunG7BPeD_E\" target=\"_blank\">Gimme Something Good</a>” (<i>Ryan Adams</i>, 2014); “<a href=\"https://www.youtube.com/watch?v=BfAENOAwk8U\" target=\"_blank\">Trouble</a>” (<i>Ryan Adams</i>, 2014); “<a href=\"https://www.youtube.com/watch?v=5cKtuAIbOdA\" target=\"_blank\">My Wrecking Ball</a>” (<i>Ryan Adams</i>, 2014); “<a href=\"https://www.youtube.com/watch?v=9V-8VP5dnrQ\" target=\"_blank\">Bad Blood</a>” (<i>1989</i>, 2015); “<a href=\"https://www.youtube.com/watch?v=PwmXO0J-PAA\" target=\"_blank\">Shake It Off</a>” (<i>1989</i>, 2015); “<a href=\"https://www.youtube.com/watch?v=R3xZYemGLdQ\" target=\"_blank\">To Be Without You</a>” (<i>Prisoner</i>, 2017); “<a href=\"https://www.youtube.com/watch?v=Ot0To3ult6k\" target=\"_blank\">Do You Still Love Me?</a>” (<i>Prisoner</i>, 2017); “<a href=\"https://www.youtube.com/watch?v=AiupLuwENyk\" target=\"_blank\">Shiver And Shake</a>” (<i>Prisoner</i>, 2017)</p>\n<p><span><b>Finale: Nick, Scot and Jeff Each Name Their Two Key Albums and Five Key Songs from Ryan Adams<br />\n</b></span><u>Nick’s albums</u><b>: </b>1) <i>Heartbreaker</i> (2000); 2) <i>Cold Roses</i> (2005) | <u>Nick’s songs</u><b>: </b>1) “Magnolia Mountain” (<i>Cold Roses</i>, 2005); 2) “Oh My Sweet Carolina” (<i>Heartbreaker</i>, 2000); 3) “Dear John” (<i>Jacksonville City Nights</i>, 2005); 4) “Everybody Knows” (<i>Easy Tiger</i>, 2007); 5) “<a href=\"https://www.youtube.com/watch?v=UyiRT1keaZY\" target=\"_blank\">16 Days</a>” <span>[Whiskeytown]</span> (<i>Strangers Almanac</i>, 1997)</p>\n<p><u>Scot’s albums</u>: 1) <i>Heartbreaker</i> (2000); 2) <i>Jacksonville City Nights</i> (2005) | <u>Scot’s songs</u>: 1) “Come Pick Me Up” (<i>Heartbreaker</i>, 2000<i>)</i> ; 2) “Please Do Not Let Me Go” (<i>Love Is Hell</i>, 2004); 3) “Let It Ride” (<i>Cold Roses</i>, 2005); 4) “The Hardest Part” (<i>Jacksonville City Nights</i>, 2005); 5) “<a href=\"https://www.youtube.com/watch?v=oWgtiCAkgQ4\" target=\"_blank\">Rosalie Come And Go</a>” (<i>Gold</i>, 2001)</p>\n<p><u>Jeff’s albums</u>: 1) <i>Heartbreaker</i> (2000); 2) <i>Love Is Hell</i> (2004) | <u>Jeff’s songs</u>: 1) “My Winding Wheel” (<i>Heartbreaker</i>, 2000); 2) “New York, New York” (<i>Gold</i>, 2001); 3) “So Alive” (<i>Rock N Roll</i>, 2003); 4) “Afraid Not Scared” (<i>Love Is Hell</i>, 2004); 5) “Meadowlake Street” (<i>Cold Roses</i>, 2005)</p>\n",
  "enclosure": "",
  "itunes:title": "Episode 14: Nicholas Confessore / Ryan Adams",
  "itunes:author": "National Review",
  "itunes:duration": "01:57:02",
  "itunes:summary": "Jeff and Scot talk to Nicholas Confessore about Ryan Adams.",
  "itunes:subtitle": "Jeff and Scot talk to Nicholas Confessore about Ryan Adams.",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:episode": 14
}