{
  "guid": "prx_126_06b19890-383a-4092-8c41-3be8b0652eb3",
  "title": "The Summer of Night Vale Presents, Part 3",
  "pubDate": "Fri, 20 Jul 2018 04:00:00 -0000",
  "link": "https://beta.prx.org/stories/249516",
  "description": "<p>This is the Summer of Night Vale Presents, a celebration and sampling of some of the shows across our network. This week, we’re listening to special episodes of <a href=\"http://aliceisntdead.com\" rel=\"nofollow\" target=\"_blank\">Alice Isn’t Dead</a> and <a href=\"https://www.sleepwithmepodcast.com\" rel=\"nofollow\" target=\"_blank\">Sleep With Me</a>.<br>\n<br>\n<a href=\"http://aliceisntdead.com\" rel=\"nofollow\" target=\"_blank\">Alice Isn’t Dead</a> is about a truck driver, played by Jasika Nicole, who searches across America for the wife she had long assumed was dead. In the course of her search, she encounters not-quite-human serial murderers, towns literally lost in time, and a conspiracy that goes way beyond one missing woman. We’re in the middle of the third and final season right now, and it would only take a few hours for you to catch up the finale later this summer.<br>\n<br>\n<a href=\"https://www.sleepwithmepodcast.com\" rel=\"nofollow\" target=\"_blank\">Sleep With Me</a> is the podcast that puts you to sleep. Every episode of this unique and inventive storytelling podcast is designed to help you fall asleep. The next time you’re tossing and turning at night, turn on one of the hundreds of episodes in the Sleep With Me archive and let Scooter tell you a bedtime story.<br>\n<br>\nFind out more about these shows, and all of the shows on our network, by visiting <a href=\"http://nightvalepresents.com/\" rel=\"nofollow\" target=\"_blank\">nightvalepresents.com.</a></p>",
  "enclosure": "",
  "itunes:subtitle": "This is the Summer of Night Vale Presents, a celebration and sampling of some of the shows across our network. This week, we’re listening to special episodes of Alice Isn’t Dead and Sleep With Me.",
  "itunes:episodeType": "full",
  "itunes:duration": "48:00"
}