{
  "id": "yt:video:lAt1Vcuy5LY",
  "yt:videoId": "lAt1Vcuy5LY",
  "yt:channelId": "UCTUtqcDkzw7bisadh6AOx5w",
  "title": "The Book That Changed Jazz Forever",
  "link": "",
  "author": {
    "name": "12tone",
    "uri": "https://www.youtube.com/channel/UCTUtqcDkzw7bisadh6AOx5w"
  },
  "published": "2022-09-02T17:00:32+00:00",
  "updated": "2022-09-28T20:42:20+00:00",
  "media:group": {
    "media:title": "The Book That Changed Jazz Forever",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Taking on music theory's biggest idea.\nSupport 12tone on Patreon to help us keep making cool videos! https://www.patreon.com/12tonevideos\n\nIn music circles, the Lydian Chromatic Concept by George Russell has built a reputation as a daunting model, a brilliant but esoteric idea best suited for the minds of geniuses like Miles Davis. And that reputation isn't entirely unearned, but it's led a lot of people to not engage with Russell's work when it's actually not that hard to understand, so I'm gonna try to demystify it a bit and explain what he was actually trying to do.\n\nMerch: http://standard.tv/12tone\nDiscord: https://discord.gg/pq2QBEw\nFacebook: https://www.facebook.com/12tonevideos\nTwitter: https://twitter.com/12tonevideos\nTwitch: https://www.twitch.tv/12tonevideos\nEmail: 12tonevideos@gmail.com\n\nScript: https://tinyurl.com/42zt32t2\n\nHuge thanks to our Elephant Club members:\n\nSusan Jones\nJill Jones\nDuck \nHoward Levine\nBrian Etheredge\nLen Lanphar\nKen Arnold\nWarren Huart\nElaine Pratt\nKevin Wilamowski\nGrant Aldonas\nWilliam (Bill) Boston\nChris Prentice\nJack Carlson\nChristopher Lucas\nAndrew Beals\nDov Zazkis\nHendrik P\nThomas Morley\nJacob Helwig\nDavis Sprague\nKelly Christoffersen\nBraum Meakes\nDonal Botkin\nHendrik Stüwe\nDan Bonelli\nKevin Boyce\nStephen Cook\nDavid Bartz\nDarius Rudominer\nLuke\nIan Seymour\nDhruv Monga\nKen Jones\nObadiah Wright\nCarlos Rendon\nAleksandar Milojković\nKylie McInnes\nJody \nPhilRosas \nReiji Kobayashi\nCatherine Berry\nNeil Moore\nDamien Fuller-Sutherland\nKai\nChris Davis\nLuke Klima\nFred Kroon\nHardScale\nChris Piro\nMatt Robbins\nRyan Evans\n\nAnd thanks as well to Henry Reich, Gabi Ghita, Gene Lushtak, Eugene Bulkin, Owen Campbell-Moore, Logan Jones, Oliver, Anna Work, Adam Neely, Rick Lees, Dave Mayer, CodenaCrow, Arnas, Caroline Simpson, Michael Alan Dorman, Blake Boyd, Charles Gaskell, Trevor Sullivan, Tom Evans, JH, David Conrad, Ducky, Todd Davidson, Chris Borland, Jake Lizzio, Elliot Burke, Aaron Epstein, Chris Connett, Tim S., Elias Simon, Kenneth Kousen, James, h2g2guy, W. Dennis Sorrell, Jerry D. Brown, Ohad Lutzky, Peter Leventis, Symmetry, James A. Thornton, Andrew Engel, Peter Brinkmann, Stefan Strohmaier, Shadow Kat, Adam Wurstmann, Angela Flierman, Richard T. Anderson, Michael Mol, Kevin Johnson, Joshua La Macchia, naomio, Alex Mole, Rodrigo \"rrc2soft\" Roman, Jeremy Zolner, Patrick Callier, Danny, Francois LaPlante, Volker Wegert, Britt Ratliff, John Bejarano, Gary Butterfield, Betsy, Tonya Custis, Dave Shapiro, Jacopo Cascioli, Steve Brand, Rene Miklas, Walther, Red Uncle, Doug Nottingham, Graeme Lewis, Jake Sand, Nicholas Wolf, Robert Beach, Jason Nebergall, Jim Hayes, Scott Albertine, Mathew Wolak, S, Lincoln Mendell, Sam Rezek, Destros, Lucas Augusto, ZagOnEm, רועי סיני, Evan Satinsky, Conor Stuart Roe, RaptorCat, Dragix PL, Jigglypuffer, leftaroundabout ., Jens Schäfer, Mikely Whiplash, Austin Amberg, Francisco Rodrigues, Michael Tsuk, Kottolett, Dylan Vidas, ThoraSTooth, Brandon Legawiec, Hikaru Katayamma, Brian Miller, Rob Hardy, Patrick Chieppe, Eric Stark, David Haughn, Gordon Dell, Bryn Davis, Pamela O'Neill, Byron DeLaBarre, Matty Crocker, anemamata, Lee-orr Orbach, Eric Plume, Thomas Morgan, Ludwick Kennedy, Jason Peterson, Peggy Youell, EJ Hambleton, Caitlin Olsen, Ridley Kemp, Mark James, Jos Mulder, Daryl Banttari, J.T. Vandenbree, John Castle, Adam Ziegenhals, Mark, Amelia Lewis, sonicolasj, Kristofer Hill, William Merryman, Ryan Mayle, AkselA, Justin St John-Brooks, Sam Plotkin, David MacDonald, Nellie Speirs Baron, Charles R., Joshua Lewis, Sam, DialMForManning, Wayne Weil, Joseph Satin, Piush Dahal, Matthew Moore, Andrew Wyld, David T Peterson, Bryan C. Mills, JD White, XCompWiz, Michael Blaby, Joe Johnston, Jordan Friendshuh, Bean, A Devoted Servant, Milan Brezovsky, Edmund Horner, NinoDoko, M. Bock, Daniel Joseph Moynihan, vivi mouse emoji, Claymore Alexander, Dixon Roberts, Josh Witkowski, You Can Face Reality, Graham Orndorff, gunnito, Jason McPherson, Chris Robson, A.J. Yates, Matt Moulder, Leander Tietjen, Alex Tafur, findRED, Howl’s one-handed, Gary Backaus, Joel LaRosa, Daniel Sim, Chris Breault, Eugen Lounkine, Fernando Gros, Geoffrey Barnett, OVB_2nd, William, David Wagner, Joe Molloy, Jeffrey Mann, Drunk Wookiee, RoxyPop, Douglas Anderson, Foreign Man in a Foreign Land, Vigilance Deadname, Liz Webb, Boomer Dell, Paul Tanenholz, Lev, Julio D, Justin Zboyovski, Adam Poata-Smith, J.R. Hyde, A, Christopher Beattie, triskadecaepyon, Abie, Charles Jordan, Kelly Walker, Tom, William Christie, Stephen Tolputt, Patterner, Taylor Malik, Messier42, Bradley Crowley, Mark Mitchell Gloster, Andy Maurer, William Spratley, Don Jennings, Cormag81, Derek Hiemforth, Bryan, Michael K, Milan Durnell, Dan Whitmer, Thel 'Vadam, Brian Hall, Cole McIntyre, Andrew Herald, Mireille C, Justin Carpenter, N Zaph, David Dynes, M3RK Chaos, Marc Testart, Charles Miller, and Ceri Williams! Your support helps make 12tone even better!\n\nAlso, thanks to Jareth Arnold!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}