{
  "title": "US$7.4 mil funding brings Zanroo closer to unicorn dream",
  "link": "https://www.digitalnewsasia.com/startup-scaleups/us74-million-funding-brings-zanroo-closer-unicorn-dream",
  "description": "<!-- START FIELD TEMPLATE -->\n\n\n<div class=\"d-flex justify-content-start flex-wrap\">\n      <div class=\"body\">\n      <ul>\n<li><em><strong> Funding </strong></em><em><strong>kickstarts</strong></em><em><strong> high-growth phase and tech expansion</strong></em></li>\n<li><em><strong>Ambitions to be a global top 10 </strong></em><em><strong>martech</strong></em><em><strong> company </strong></em></li>\n</ul>\n<p class=\"rtecenter\"><img alt=\"\" src=\"/sites/default/files/images/Image%206.jpg\" style=\"width: 600px; height: 400px;\" /></p>\n<p class=\"rtecenter\"><em><strong>Zanroo founders Chitpol Mungprom (CEO) and Udomsak Donkhampai (CTO) </strong></em></p>\n<p>Thai-based insight discovery and marketing technology startup Zanroo is one of the fastest-growing startups in its industry; founders Chitpol Mungprom and Udomsak Donkhampai claim it is the fastest-growing in Southeast Asia (SEA). </p>\n<p>Zanroo, which was founded in July 2013, helps its customers discover actionable insights through real-time big-data analytics so that these businesses can make their campaign activation and crisis management processes more efficient and successful. </p>\n<p>Its customer acquisition in the last four years has been significant, certainly helped along by its bespoke proprietary technology. It now has more than 300 leading brands across various verticals, including banking, automotive, telecommunications, e-commerce, aviation and consumer goods. It is active in 15 countries:  Malaysia, Singapore, Indonesia, Philippines, Myanmar, Cambodia, Vietnam, Japan, Taiwan, Hong Kong, Australia, Sri Lanka, Pakistan, the UK and Thailand.</p>\n<p>On July 11, Zanroo closed its Series A funding, securing US$7.4 million (RM31.8 million) from a single investor, Shift Ventures. According to Mungprom, who is chief executive officer, Zanroo will use the funding to propel it further forward in its journey to secure a global footprint and become a unicorn. </p>\n<p><strong>World domination</strong></p>\n<p>Zanroo has big plans for global expansion but the founders do not believe they are overly ambitious. The startup is already in 17 countries, its current biggest markets being Mexico and Dubai. The next big markets the startup is looking into are China and cities in Europe, followed by cities in the US. </p>\n<p>Mungprom says that China will not be too difficult for Zanroo to break into because it already has a local partner that Zanroo obtained through its extensive network in Thailand and because of the good business reputation that the startup has cultivated. Though Mungprom declines to reveal the name of the China partner, he says that it is big in the retail and food and beverage space, and has connections with Alibaba.</p>\n<p>Zanroo is looking at an expansion timeline of two-and-a-half years, though Mungprom stresses that this timeline is just the first benchmark: “We believe that expansion needs to carry on for the company’s whole life. If you stop expansion the company stops moving,” he says.  </p>\n<p>He elaborates that the funding will be used for two things - hiring people for marketing, sales, and research and development, and to improve on Zanroo’s hardware and software. Zanroo currently has 160 employees across the 17 countries it operates in. </p>\n<p>“The funding is only for expansion, so we are ready to move up from a startup to a corporation. We want to be the next company that people who come out from Google, Facebook or Agoda come to. We are ready for them,” reveals Mungprom.</p>\n<p>Though Zanroo is comparatively small, it is moving into a sustained high-growth phase – Mungprom says Zanroo will very soon be in 40 countries – which means great opportunities for people to use their previous experience to help grow the company. </p>\n<p>“We can offer a good salary for sure. But normally when hiring people I don’t think what we are going to use them for, I think about how far they can go with us. People in Google may be at the top of the world, but what’s next after that? We are offering them the chance to grow another company and grow themselves together,” he says. </p>\n<p>The founders emphasise that one of Zanroo’s major strengths is a strong local sales team that understands the local markets. The localisation of Zanroo’s products is an important aspect of its success. Its latest solution, Arun, for example, contains carefully designed algorithms that enable it to process big data quickly and intelligently, aggregating paid, owned and earned media for return-on-investment measurement. The most interesting part of it is that it can be tweaked to suit each market. </p>\n<p>“Every market is slightly different, with different data, culture and ways of using the product, so when we first enter a new market we have a temporary team there with local knowledge so that we can customise the software for market requirements,” explains Donkhampai, who is the chief technical officer. </p>\n<p> </p>\n<p class=\"rtecenter\"><img alt=\"\" src=\"/sites/default/files/images/Image%201.jpg\" style=\"width: 600px; height: 400px;\" /></p>\n<p class=\"rtecenter\"><em><strong>From left  Shift Venture CEO and founding partner Worawisut Pinyoyang, Zanroo CEO and founder Chitpol Mungprom and Zanroo CTO and founder Udomsak Donkhampai</strong></em></p>\n<p><strong>Unicorns are real</strong></p>\n<p>Zanroo boasts an annual revenue growth of between 200% and 400%. This year’s target revenue is US$7.43 million (THB260 million), about the same amount as it obtained for its Series A funding. The founders did not reveal Zanroo’s valuation but Mungprom says it is far over the US$25 million mark. </p>\n<p>As of August, Zanroo has achieved 80% of its revenue target for the year and Mungprom says that it will certainly exceed the target, something the startup does every year. </p>\n<p>“When we set the targets and forecast growth we don’t just imagine where we want to be, we look at the numbers and calculate what we should achieve in two months, six months and one year. So we never miss a target. We always have a plan and we stick to it,” says Mungprom.</p>\n<p>According to Mungprom, Zanroo has been profitable from day 1: “We have never had negative cash flow.”</p>\n<p>He explains that as a B2B model, Zanroo has a long and diversified list of customers from which revenue flows in. Further, because the startup’s cutting-edge products and technologies are so attractive and its client servicing and after-sales services are top-notch, it was able to obtain quite a few clients from the beginning who signed contracts and paid in advance, enabling Zanroo to make early profits. </p>\n<p>The founders strongly believe that Zanroo’s unicorn dream is achievable and that Thai capabilities are certainly of global standard, saying that Zanroo will be the first Thai brand to go global. Donkhampai says that his previous experience at a global company has given him the experience, knowledge and confidence to take Zanroo’s products global. “It’s great to know that in Thailand we can do something like this.”</p>\n<p>Besides becoming a unicorn, Zanroo has aspirations to be in the top 10 martech companies in the world. It will achieve this as it does everything else – with quality products and services, and methodical, steady growth. </p>\n<p>Mungprom explains that once Zanroo has expanded to 40 countries as per plans, it will strive to be in the top three martech companies in each country. Once this is achieved, Zanroo will be in the top 10 in the world. With revenue already at such high numbers, such growth will definitely make Zanroo a unicorn in terms of valuation. The founders see all this happening within three years. </p>\n<p>What is next for a startup with such high ambitions and founders that are confident of success? “Once we become a unicorn we can’t just stop; we still need more products. We would like to be an innovation company. At that time we will probably have a lot more money, connections, people, and technology so why not think of more innovations, create something that can help solve the problems in the world?” says Mungprom. </p>\n<p>“We don’t want to solve all the world’s problems, just those we have the knowledge to solve. We just want to be part of making the world better.”</p>\n<p> </p>\n<p><em><strong>Related stories: </strong></em></p>\n<p><a href=\"https://www.digitalnewsasia.com/mobility/telco-deep-dive-sharing-not-taking-away-telco-lunch\">Telco Deep Dive: Sharing, not taking away telco lunch</a></p>\n<p><a href=\"https://www.digitalnewsasia.com/startups/ecommerce-crossborder-conference-aims-educate-local-smes\">eCommerce </a><a href=\"https://www.digitalnewsasia.com/startups/ecommerce-crossborder-conference-aims-educate-local-smes\">Crossborder</a><a href=\"https://www.digitalnewsasia.com/startups/ecommerce-crossborder-conference-aims-educate-local-smes\"> Conference aims to educate local SMEs</a></p>\n<p><a href=\"https://www.digitalnewsasia.com/business/ventures-southeast-asian-jungle\">Ventures in the Southeast Asian jungle</a></p>\n<p> </p>\n<p> </p>\n    </div>\n  </div>\n\n<div class=\"clearfix\">&nbsp;</div>\n<!-- END FIELD TEMPLATE -->\n<!-- START FIELD TEMPLATE -->\n\n  <h6 class=\"field-label font-weight-bold text-dark\">Keyword(s) :</h6>\n\n<div class=\"d-flex justify-content-start flex-wrap\">\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/zanroo\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Zanroo</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/chitpol-mungprom\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Chitpol Mungprom</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/udomsak-donkhampai\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Udomsak Donkhampai</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/shift-ventures\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Shift Ventures</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/marketing-technology\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">marketing technology</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/martech\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">martech</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/big-data\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Big Data</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/b2b\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">B2B</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/unicorn\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Unicorn</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/startup\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Startup</a>    </div>\n  </div>\n\n<div class=\"clearfix\">&nbsp;</div>\n<!-- END FIELD TEMPLATE -->\n<!-- START FIELD TEMPLATE -->\n\n  <h6 class=\"field-label font-weight-bold text-dark\">Author Name :</h6>\n\n<div class=\"d-flex justify-content-start flex-wrap\">\n      <div class=\"field_article_author_name\">\n      <a href=\"/author/anushia-kandasivam\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Anushia Kandasivam</a>    </div>\n  </div>\n\n<div class=\"clearfix\">&nbsp;</div>\n<!-- END FIELD TEMPLATE --><span class=\"a2a_kit a2a_kit_size_24 a2a_target addtoany_list\" id=\"da2a_14\">\n      <a class=\"a2a_button_facebook a2a_counter\"></a>\n<a class=\"a2a_button_twitter a2a_counter\"></a>\n<a class=\"a2a_button_linkedin a2a_counter\"></a>\n<a class=\"a2a_button_email  a2a_counter\"></a>\n<a class=\"a2a_button_whatsapp  a2a_counter\"></a>\n<a class=\"a2a_button_telegram  a2a_counter\"></a\n      <a class=\"a2a_dd addtoany_share_save\" href=\"https://www.addtoany.com/share#url=https%3A%2F%2Fwww.digitalnewsasia.com%2Fstartup-scaleups%2Fus74-million-funding-brings-zanroo-closer-unicorn-dream&amp;title=US%247.4%20mil%20funding%20brings%20Zanroo%20closer%20to%20unicorn%20dream\"></a>\n      \n    </span>",
  "pubDate": "Fri, 11 Aug 2017 05:40:26 +0000",
  "dc:creator": "theaneu",
  "guid": "68699 at https://www.digitalnewsasia.com"
}