{
  "id": "tag:blogger.com,1999:blog-4371296950668142214.post-5342528265840130015",
  "published": "2021-02-25T00:01:00.059+11:00",
  "updated": "2021-02-26T15:30:16.458+11:00",
  "category": [
    "",
    "",
    ""
  ],
  "title": "A new choice for parents of tweens and teens on YouTube",
  "content": "<i><span style=\"color: #666666;\">“We’ve worked closely with YouTube on the complexities of redesigning their global platform to help ensure that the content children consume is diverse, high quality and age-appropriate. Getting this right is challenging – and requires ongoing discussions with global experts. A global platform will always need to keep innovating in response to emerging challenges, so it’s great to see that YouTube has processes in place to ensure that top notch expertise can guide its evolution.” - Prof Amanda Third, Young and Resilient Research Center Western Sydney University</span></i><div><br /></div><div><br /></div><div><br /></div><div><br /></div><div>This generation of tweens and teens has grown up online, and it’s where they go to learn, laugh, and connect. Every family has a different approach to how they use technology, access the internet and set digital ground rules. Over the years, we’ve made investments to protect families and kids on YouTube, such as launching a dedicated <a href=\"https://blog.youtube/news-and-events/youtube-kids/\">kids app</a>, better protecting their <a href=\"https://blog.youtube/news-and-events/an-update-on-kids/\">privacy</a>, <a href=\"https://blog.youtube/news-and-events/an-update-on-our-efforts-to-protect/\">restricting features</a> and improving <a href=\"https://blog.youtube/news-and-events/using-technology-more-consistently-apply-age-restrictions/\">age restrictions</a>. Today, we are announcing a <a href=\"http://youtube.com/myfamily\">new choice</a> for parents who have decided their tweens and teens are ready to explore YouTube with a supervised account.&nbsp;</div><div><br /></div><div><br /></div><div><b>Supervised experiences on YouTube&nbsp;</b></div><div>From our earliest days, YouTube has been a platform for people <a href=\"https://support.google.com/accounts/answer/1350409\">over 13</a>, and we’ve always recommended that parents co-watch with their kids if they choose to watch YouTube. In 2015, we created <a href=\"https://kids.youtube.com/\">YouTube Kids</a>, a safer destination for kids to explore their interests while providing parental controls. But since then, we’ve heard from parents and older children that tweens and teens have different needs, which weren’t being fully met by our products. As children grow up, they have insatiable curiosity and need to gain independence and find new ways to learn, create, and belong.&nbsp;</div><div>Over the last year, we've worked with parents and experts across the globe in areas related to child safety, child development, and digital literacy to develop a solution for parents of tweens and teens. In the coming months, we’ll launch a new experience in beta for parents to allow their children to access YouTube through a <a href=\"https://support.google.com/families/answer/7103338?hl=en&amp;ref_topic=7336731\">supervised Google Account</a>. This <a href=\"https://support.google.com/youtube/answer/10314940\">supervised experience</a> will come with content settings and limited features. We’ll start with an early beta for families with kids under the <a href=\"https://support.google.com/accounts/answer/1350409\">age of consent</a> to test and provide feedback, as we continue to expand and improve the experience.&nbsp;</div><div><br /></div><div><br /></div><div><b>Giving parents content options on YouTube&nbsp;</b></div><div>We know that every parent has a different parenting style and that every child is unique and reaches different developmental stages at different times. That’s why we’ll give parents the ability to choose from 3 different content settings on YouTube.&nbsp;</div><div><ul style=\"text-align: left;\"><li><b>Explore:</b> For children ready to move on from YouTube Kids and explore content on YouTube, this setting will feature a broad range of videos generally suitable for viewers ages 9+, including vlogs, tutorials, gaming videos, music clips, news, educational content and more.&nbsp;</li><li><b>Explore More:</b> With content generally suitable for viewers ages 13+, this setting will include an even larger set of videos, and also live streams in the same categories as “Explore.”&nbsp;</li><li><b>Most of YouTube:</b> This setting will contain almost all videos on YouTube, except for <a href=\"https://support.google.com/youtube/answer/2802167\">age-restricted content</a>, and it includes sensitive topics that may only be appropriate for older teens.&nbsp;</li></ul><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-FKQZloAt6aA/YDh4wVl2sfI/AAAAAAAACvs/oFvQ_FRYKwwkTLs_xf1Pz89o67KK-YCxQCLcBGAsYHQ/s1211/supex_icons_contentsettings_EN.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1138\" data-original-width=\"1211\" height=\"602\" src=\"https://1.bp.blogspot.com/-FKQZloAt6aA/YDh4wVl2sfI/AAAAAAAACvs/oFvQ_FRYKwwkTLs_xf1Pz89o67KK-YCxQCLcBGAsYHQ/w640-h602/supex_icons_contentsettings_EN.png\" width=\"640\" /></a></div><div><br /></div>This option was designed for parents who think their children are ready to explore the vast universe of YouTube videos. We will use a mix of user input, machine learning and human review to determine which videos are included. We know that our systems will make mistakes and will continue to evolve over time.&nbsp;</div><div>We recommend parents continue to be involved in guiding and supporting their child’s experience on YouTube. To help parents get started, we’ve developed a <a href=\"https://kstatic.googleusercontent.com/files/8c008b73566d01df66ef5e487b7feaf08b1bd3620171bed889d95ce13098920fd3dfc0817d7e9f330ef72aa3144c29c233d3c5f97ade838e948b2989c3fcdc51\">guide</a> in partnership with <a href=\"https://www.pta.org/\">National PTA</a>, <a href=\"https://parentzone.org.uk/home\">Parent Zone</a> and <a href=\"https://beinternetawesome.withgoogle.com/en_us/\">Be Internet Awesome</a>. We’ll also launch an ongoing campaign that features creators discussing themes like bullying and harassment, misinformation, digital well-being and more.&nbsp;</div><div><br /></div><div><br /></div><div><b>New features for families&nbsp;</b></div><div>We understand the importance of striking a balance between empowering tweens and teens to more safely gain independence, while offering parents ways to set controls. In addition to choosing the content setting, parents will be able to manage watch and search history from within their child's account settings. Parents can also use other controls offered by <a href=\"https://families.google.com/familylink/\">Google’s Family Link</a>, including screen timers. We’ll continue adding new parental controls over time, such as blocking content.&nbsp;</div><div>When a parent grants access to YouTube, their child’s experience will feel much like regular YouTube, but certain features will be disabled to protect younger audiences. For example, we won't serve personalised ads or ads in <a href=\"https://support.google.com/youtube/answer/9713557?hl=en\">certain categories</a>. At launch, we'll also disable in-app purchases, as well as creation and comments features. Since self-expression and community are integral parts of YouTube and children's development, over time we'll work with parents and experts to add some of these features through an age-appropriate and parent controlled approach.&nbsp;</div><div><br /></div><div><br /></div><div><b>Investing in YouTube Kids&nbsp;</b></div><div>We’re building this new supervised experience for parents who think their older kids are ready to use YouTube, but we still recommend YouTube Kids for younger kids to watch independently and have a more contained viewing experience.&nbsp;</div><div>With availability in <a href=\"https://support.google.com/youtubekids/answer/6130573\">over 80 countries</a>, now over 35 million viewers use YouTube Kids every week. We’ll continue <a href=\"https://support.google.com/youtubekids/thread/49349707?hl=en\">expanding product availability</a>, <a href=\"https://support.google.com/youtube/thread/12980033?hl=en\">adding new features</a>, and offering several new <a href=\"https://www.youtube.com/kids/parent-resources/\">parental tools</a>, such as a highly-requested option for parents to select specific videos and channels from the main YouTube platform that they’d like their child to explore on YouTube Kids.&nbsp;</div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-YXoe7hpz18Y/YDh44ZahdII/AAAAAAAACvw/a3pL_vrxgSIBxCwe6dgD9_BDXeZytCa3QCLcBGAsYHQ/s1200/Supex_DesktopHero_US.gif\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"675\" data-original-width=\"1200\" height=\"360\" src=\"https://1.bp.blogspot.com/-YXoe7hpz18Y/YDh44ZahdII/AAAAAAAACvw/a3pL_vrxgSIBxCwe6dgD9_BDXeZytCa3QCLcBGAsYHQ/w640-h360/Supex_DesktopHero_US.gif\" width=\"640\" /></a></div><div>We know that we have a long journey ahead of us as we design this experience for parents of tweens and teens. Over the long term, we hope this will provide a safer environment for older children to explore their interests, learn new skills, connect with communities that share their passions, while giving parents more ways to support their kids' online experience.&nbsp;</div><div><br /></div><div><br /></div><div><span class=\"byline-author\">Posted by James Beser, Director of Product Management, Kids and Family</span><span data-about-syndication=\"\" style=\"display: none; font-size: 0px; line-height: 0; max-height: 0px; overflow: hidden;\"> <!--INSTRUCTIONS   In order to support google.com/about site blog syndication, fill in the info below (after the example). Leave elements empty if there is no valid data.    Example:   <span class=\"post-image\">http://1.bp.blogspot.com/-mX0dxJxp8dg/Vo8MSdxypWI/AAAAAAAARsI/EjaFhvgAEgc/s1600/Beutler_Google_Giftwrap_-v2TW.png</span>  <span class=\"post-author-name\">Abbi Tatton</span>  <span class=\"post-author-title\">Editorial Elf</span>  <span class=\"post-author-team\">Google</span>--> <span class=\"post-image\"></span><span class=\"post-author-name\"></span><span class=\"post-author-title\"></span><span class=\"post-author-team\"></span></span></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "anzprteam",
    "uri": "http://www.blogger.com/profile/06099752084931732403",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}