{
  "id": "yt:video:UmUJUTSdSRA",
  "yt:videoId": "UmUJUTSdSRA",
  "yt:channelId": "UC3WoPalcYf7d_x4DC2BXAfw",
  "title": "A Plague Tale Requiem is like Dishonored but wholesome",
  "link": "",
  "author": {
    "name": "jayvee",
    "uri": "https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw"
  },
  "published": "2022-10-18T21:21:27+00:00",
  "updated": "2022-10-21T14:59:16+00:00",
  "media:group": {
    "media:title": "A Plague Tale Requiem is like Dishonored but wholesome",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "hey guys today i'm playing rat simulator 2022\ngrab the game from my friends at GOG! https://af.gog.com/en/game/a_plague_tale_requiem?as=1725538448\n\nSubscribe to jayveeonYT for more videos!\n► ​https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw?sub_confirmation=1\n\nWatch more videos on jayveeonYT! \n► https://youtube.com/playlist?list=PLGdQpBjWmxqVuXKKNVcccm81dpDwsJPvH\n\n- - - - - - - - - - - - - - - -\n\nFollow jayveeonYT!\n► Twitter: https://twitter.com/jayveeonYT​\n► Discord: https://discord.gg/jayveeonyt\n► Instagram: https://www.instagram.com/jayvee.yt/​\n\nWatch More jayveeonYT!\nLatest Uploads:  \n\nSo I ranked ALL the AC games...\n► https://youtu.be/Z9_Tb_TcPYI\n\nSo I played AC Rogue in 2021...\n► https://youtu.be/LUmOm2whuvY\n\nSo I played AC Syndicate in 2021...\n► https://youtu.be/swJN5NO2gJ8\n\nSo I played AC Unity in 2021...\n► https://youtu.be/UjTt4KtAZO8\n\nSo I played AC Odyssey in 2021…\n► https://youtu.be/guMObmtv54s\n\n- - - - - - - - - - - - - - - -\n\nAbout jayveeonYT:\nNews, reactions, and gameplay of all the biggest RPGs, open world, and action-adventure video games! Jayvee covers Assassin's Creed, Cyberpunk, Fallout, and more!\n\n- - - - - - - - - - - - - - - -\n\nA Plague Tale: Requiem is an action-adventure stealth video game developed by Asobo Studio and published by Focus Entertainment. It is the sequel to A Plague Tale: Innocence (2019), and follows siblings Amicia and Hugo de Rune who must look for a cure to Hugo's blood disease in Southern France while fleeing from soldiers of the Inquisition and hordes of rats that are spreading the black plague. The game was released for Windows, Nintendo Switch, PlayStation 5 and Xbox Series X and Series S in October 2022.\n\nSimilar to its predecessor, Requiem is an action-adventure game played from a third-person perspective. In the game, the player assumes control of Amicia and must face against both soldiers from the French Inquisition and hordes of rats that are spreading the black plague. Gameplay is largely similar to the first game, though the combat system is significantly expanded. Amicia is equipped with weapons such as a knife to stab enemies, a sling that can be used to throw rocks, and a crossbow which allows her to easily defeat armoured opponents. Crossbow bolts, throwing pots, and rocks can be combined with alchemical mixtures. In addition to Ignifer and Extinguis, which allows the player to light and extinguish flame respectively, the game introduces tar, which increases the radius of the light source, and can be used to ignite enemies.[1]\n\nLocations are also larger in Requiem, giving players additional options to progress. Stealth is expanded in Requiem. Unlike Innocence, Amicia would not die after being hit once by enemies. She can also return to stealth after she was discovered by enemies, and counter their attacks if she gets too close to them. Amicia's brother Hugo, who has a connection to the plague, can use an ability named \"Echo\" which reveals the locations of enemies through walls. Hugo can also control the hordes of rats to overwhelm enemies. Similar to the first game, the rats, which are light-averse, play a huge role in the game. Amicia and Hugo must stay in the light, or they will be devoured by the rats. Amicia can use the rats to her advantage, manipulating them to solve puzzles, or even lure them to kill enemies.[1]\n\nThe game also features a progression system in which the player will be awarded additional skills and abilities. Stealth players will unlock skills that allows them to sneak around more efficiently, while those who prefer a more lethal approach will unlock additional combat skills.[1] The player's gear and equipment can also be upgraded at workbenches.[2]\n\n#gaming #jayvee #aplaguetale",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}