{
  "id": "yt:video:kAi3sSgGp9w",
  "yt:videoId": "kAi3sSgGp9w",
  "yt:channelId": "UCddem5RlB3bQe99wyY49g0g",
  "title": "\"THE HAUNTED MOUTH\"  1974 AMERICAN DENTAL ASSOCIATION EDUCATIONAL FILM  w/ CESAR ROMERO XD72304",
  "link": "",
  "author": {
    "name": "PeriscopeFilm",
    "uri": "https://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g"
  },
  "published": "2022-10-31T19:00:19+00:00",
  "updated": "2022-10-31T19:00:20+00:00",
  "media:group": {
    "media:title": "\"THE HAUNTED MOUTH\"  1974 AMERICAN DENTAL ASSOCIATION EDUCATIONAL FILM  w/ CESAR ROMERO XD72304",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Join this channel to get access to perks:\nhttps://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g/join\n\nWant to learn more about Periscope Film and get access to exclusive swag? Join us on Patreon. Visit https://www.patreon.com/PeriscopeFilm\nVisit our website www.PeriscopeFilm.com\n\nProduced by the American Dental Association courtesy of a grant from Colgate-Palmolive in 1974, \"The Haunted Mouth\". It features actor Cesar Romero as the narrator, \"B. Plaque\".  This \"scary movie\" is actually all about dental hygiene and preventing cavities, and in it the invisible spirit of plaque (Romero) warns children against the dangers of not brushing and flossing. The film shows the enemies of plaque including toothpaste, toothbrushes, and dental floss (7:25), and discusses the proper method for brushing and flossing.  \n\nCesar Julio Romero Jr. was an American actor and activist, known for his portrayal of the Joker in the Batman TV show, but also for a wide range of screen roles including Latin lovers, historical figures in costume dramas, and characters in light domestic comedies.\n\nWe encourage viewers to add comments and, especially, to provide additional information about our videos by adding a comment!  See something interesting?  Tell people what it is and what they can see by writing something for example: \"01:00:12:00 -- President Roosevelt is seen meeting with Winston Churchill at the Quebec Conference.\"\n\nThis film is part of the Periscope Film LLC archive, one of the largest historic military, transportation, and aviation stock footage collections in the USA. Entirely film backed, this material is available for licensing in 24p HD, 2k and 4k. For more information visit http://www.PeriscopeFilm.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}