{
  "title": "522: Revisiting 'Deathly Hallows, Part 2' Ten Years Later",
  "link": "https://audioboom.com/posts/7908038",
  "itunes:episode": 522,
  "itunes:title": "Revisiting 'Deathly Hallows, Part 2' Ten Years Later",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5296,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>\n<em>Harry Potter and the Deathly Hallows, Part 2</em> turns ten years old!</li>\n<li>On this episode, the MuggleCasters and Slug Club member Molly reminisce about the last film in the original series.</li>\n<li>Where were we when <em>Deathly Hallows</em> came out?</li>\n<li>We experience the touching farewell speeches given by Dan, Rupert and Emma on the red carpet in London.</li>\n<li>Movie 8 has the highest Rotten Tomato rating of the whole series! And it made the most money. Can we see why?</li>\n<li>We deep dive the plot of DH2 and re-learn what was new and different, including Aberforth.</li>\n<li>Micah recaps the biggest omissions in adaptation from the page to the screen. Tonks' pregnancy, portrait Dumbledore and Carrows vs. McGonagall all got changed.</li>\n<li>Meanwhile, the scene in the Chamber of Secrets is shown for the first time, and Snape gets a change of scenery!</li>\n<li>The hosts revisit what they were most looking forward to, after having read the book, and what scenes surprised them.</li>\n<li>The Epilogue was shot, and then re-shot. Remembering the geriatric non-millennial trio and friends.</li>\n<li>In this week's debate, hosts take sides defending or criticizing the last film's adaptation. Let us know who won via our social media poll!</li>\n<li>Quizzitch: Five years after Harry Potter and the Deathly Hallows, Part 2, the franchise was continued with the first Fantastic Beasts film. What is the first spoken sentence of Fantastic Beasts? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week’s episode is sponsored by BetterHelp (Get 10% off by visiting <a href=\"http://www.BetterHelp.com/mugglecast\">BetterHelp.com/mugglecast</a>) and HelloFresh (Get up to 14 free meals and free shipping by going to <a href=\"http://www.HelloFresh.com/muggle14\">HelloFresh.com/muggle14</a> and using code 'muggle14' at checkout)</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like access to our recording studio, Bonus MuggleCast, a personalized thank you video from one of the hosts and more! On this month's Bonus MuggleCast, we talk about our favorite Jude Law Dumbledore moments from Crimes of Grindelwald!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 20 Jul 2021 09:00:00 +0000",
  "guid": "tag:audioboom.com,2021-07-19:/posts/7908038",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}