{
  "title": "Startup Revenue",
  "link": "",
  "updated": "2022-07-25T00:00:00+00:00",
  "id": "https://mrocklin.github.io/blog/work/2022/07/25/startup-revenue",
  "content": "<p>VC funded startups are weird.\nThey (rightly) care more about valuation than about revenue.\nValuation depends on revenue, but only on very certain kinds of revenue.</p>\n\n<p>The simplified version of this is that there are two kinds of revenue:</p>\n\n<ol>\n  <li><strong>Services (bad)</strong> one-off consulting work that is easy to get but has little to do with making a scalable business</li>\n  <li><strong>Recurring Product Revenue (good)</strong> annually recurring revenue with little to no marginal cost and great scalability</li>\n</ol>\n\n<p>I agree with this assessment, but I think that it over-simplifies things a bit.\nThis blog goes through a variety of different kinds of revenue that I think are\ndifferent kinds of good and bad.  Throughout these examples I draw from on my\nsingle experience selling open source software in the data infrastructure space.</p>\n\n<h2 id=\"consulting-services\">Consulting Services</h2>\n\n<p><em>Customer: Please join my team and help us use your software to solve our problem</em></p>\n\n<ul>\n  <li>Not Scalable</li>\n  <li>Not Dependable</li>\n  <li>Maybe informs future product development</li>\n</ul>\n\n<p>I think that this activity is actually great when you’re starting out.\nThere’s no better way to understand customer pain points than figuring out what\nthey’re willing to pay for and working closely with them.</p>\n\n<p>Of course, one needs to be careful that we’re learning from this experience,\nrather than just chasing money (although that’s ok too if you’re doing it\nintentionally).</p>\n\n<p>Typically these contracts are hourly.  I’ve seen rates anywhere from <em>$150/hr</em> to\n<em>$1000/hr</em>.</p>\n\n<h2 id=\"funded-development\">Funded Development</h2>\n\n<p><em>Customer: I love your software.  Can I pay you to add a feature?</em></p>\n\n<ul>\n  <li>Not scalable</li>\n  <li>Not dependable</li>\n  <li>Supports product development</li>\n</ul>\n\n<p>This work is probably great.  Someone cares enough about your software to pay\nyou to improve it.  They don’t want you mucking about in their systems\n(awesome) but do want to prioritize things on your roadmap a bit.  This can be\neither good signal (customers pointing you in the right direction) or\ndistracting (customers pointing you in a bad direction).  Additionally, because\nthis work isn’t very dependable it’s hard to build a team around it (at least\nnot a team that needs to be dependably employed)</p>\n\n<p>Typically these are one-off fixed-price contracts.  I’ve seen contracts from\n<em>$50,000</em> to <em>$1,000,000</em>.</p>\n\n<h2 id=\"support\">Support</h2>\n\n<p><em>Customer: I want insurance that things won’t break</em></p>\n\n<ul>\n  <li>Pretty Scalable</li>\n  <li>Pretty Dependable</li>\n  <li>Kinda supports product development</li>\n</ul>\n\n<p>Once your software is endemic within an organization they’re going to want\nsomeone to be on the hook for it.  We do this by providing a private issue\ntracker, SLAs on critical bugs, and a person to talk to from time to time.  We\nalso offer things that no one uses like indemnity insurance.</p>\n\n<p>The beautiful thing here is that if your software works perfectly then this is\nfree to provide.  Your software doesn’t work perfectly, so this isn’t free, but\nfortunately all of these customers typically ask for the same things, so it\nscales pretty well.  It’s also pretty dependable, so it’s easy to hire people\nand rest assured that you can continue to employ them.</p>\n\n<p>For enterprise customers these are typically anywhere from <em>$100,000</em> to\n<em>$1,000,000</em>, at least at the Series Seed/A size.  Multi-million dollar deals of\nthis nature are doable between larger companies.  I typically have to convince\nbusiness people that this is ARR, despite the fact that it’s definitely\nannually recurring revenue.</p>\n\n<h2 id=\"product-hard-to-deploy\">Product (hard to deploy)</h2>\n\n<p><em>Customer: I want your product, but need it in my environment, like Cloudera</em></p>\n\n<ul>\n  <li>Pretty Scalable</li>\n  <li>Very Dependable</li>\n  <li>Supports product development (but painfully)</li>\n</ul>\n\n<p>Hooray product revenue!  This is the first thing that you don’t have to\nconvince VCs to count as ARR.  It might actually still be a pain in the butt\nthough.</p>\n\n<p>Products are often hard to deploy within customer settings.  Big customers have\nlots of custom systems that are hard to work with, and you’ll be asked to work\nwith them.  That’s ok, you can hire a team that just does this work and you can\ncharge for their time.  There are other challenges, like supporting old\nversions of the software, getting clear bug reports on your software when you\nmay not have permissions to touch that software directly, etc..</p>\n\n<p>Fortunatley though, the world has also improved since the days of Cloudera.\nTechnologies like Kubernetes and “on-prem cloud” reduce (but don’t eliminate)\nthis pain.</p>\n\n<h2 id=\"product-cloud-saas\">Product (cloud SaaS)</h2>\n\n<p><em>Customer: I want your product, and don’t mind if you see my data, like Snowflake</em></p>\n\n<ul>\n  <li>Very Scalable</li>\n  <li>Dependable</li>\n  <li>Supports product development (and joyfully)</li>\n</ul>\n\n<p>Hooray product revenue attached to a system over which you have full visibility!\nCloud SaaS is considered to be the highest velocity approach because once it\nworks it’s easy to scale out to lots of customers with low effort.  Of course,\nit may be <em>really</em> hard to get to that point.  You’ll have to get good at\nconvincing customers that your internal systems are safe.  This will be easy in\nsome sectors (SMBs, non-sensitive industries) but harder in others (Large\nEnterprise, finance, government, etc.).</p>\n\n<h2 id=\"summary\">Summary</h2>\n\n<p>Money is good.  Dependability is good.  Learning is good.</p>\n\n<p>All of these activities are good in some ways and bad in others.  Rather than\nsay services are bad and product is good we should be asking questions about\nhow scalable, dependable, high margin, and in line with your product\ndevelopment they are.</p>"
}