{
  "title": "Pakistan Infrastructure Initiative’s Continuing Problems",
  "description": "Beijing&#8217;s policies driving more conflict than development",
  "link": "https://www.asiasentinel.com/p/china-pakistan-infrastructure-problems",
  "guid": "https://www.asiasentinel.com/p/china-pakistan-infrastructure-problems",
  "pubDate": "Thu, 27 Oct 2022 13:43:30 GMT",
  "enclosure": "",
  "content:encoded": "<h5>By: Salman Rafi Sheikh</h5><div class=\"captioned-image-container\"><figure><a class=\"image-link is-viewable-img image2\" target=\"_blank\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F8fcbb8f2-5027-4222-90b1-a5f8b028255c_732x412.jpeg\"><div class=\"image2-inset\"><picture><source type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F8fcbb8f2-5027-4222-90b1-a5f8b028255c_732x412.jpeg 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F8fcbb8f2-5027-4222-90b1-a5f8b028255c_732x412.jpeg 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F8fcbb8f2-5027-4222-90b1-a5f8b028255c_732x412.jpeg 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F8fcbb8f2-5027-4222-90b1-a5f8b028255c_732x412.jpeg 1456w\" sizes=\"100vw\"><img src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F8fcbb8f2-5027-4222-90b1-a5f8b028255c_732x412.jpeg\" width=\"732\" height=\"412\" data-attrs=\"{\"src\":\"https://bucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com/public/images/8fcbb8f2-5027-4222-90b1-a5f8b028255c_732x412.jpeg\",\"fullscreen\":null,\"imageSize\":null,\"height\":412,\"width\":732,\"resizeWidth\":null,\"bytes\":88287,\"alt\":null,\"title\":null,\"type\":\"image/jpeg\",\"href\":null,\"belowTheFold\":false,\"internalRedirect\":null}\" class=\"sizing-normal\" alt=\"\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F8fcbb8f2-5027-4222-90b1-a5f8b028255c_732x412.jpeg 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F8fcbb8f2-5027-4222-90b1-a5f8b028255c_732x412.jpeg 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F8fcbb8f2-5027-4222-90b1-a5f8b028255c_732x412.jpeg 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F8fcbb8f2-5027-4222-90b1-a5f8b028255c_732x412.jpeg 1456w\" sizes=\"100vw\"></picture><div class=\"image-link-expand\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"16\" height=\"16\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"#FFFFFF\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\" class=\"lucide lucide-maximize2\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" y1=\"3\" x2=\"14\" y2=\"10\"></line><line x1=\"3\" y1=\"21\" x2=\"10\" y2=\"14\"></line></svg></div></div></a></figure></div><p>On September 29, a newly formed militant group comprising Sindhi nationalists killed a Chinese-Pakistani dental assistant in Karachi and wounded the two owners of the dental clinic, with what is now known as the &#8220;Sindhudesh People&#8217;s Army&#8221; claiming responsibility and warning the Chinese that Beijing must end its projects in Pakistan.</p><p>The attack is the latest against Chinese interests and while aimed at a seemingly irrelevant target a considerable distance from major projects, it is related to ongoing economic instability that recently forced the government in Islamabad to seek an IMF bailout package that illustrates the failure of China&#8217;s near-US$60 billion investment in the massive China-Pakistan Economic Corridor to generate any meaningful growth.</p><p>While the IMF&#8217;s &#8220;timely intervention&#8221; has helped Pakistan avoid bankruptcy, there is little denying that, according to leading politicians who spoke with Asia Sentinel on numerous occasions, the CPEC, which includes the Gwadar deep sea port, numerous energy projects, modern transportation links all the way to China and several special economic zones, in addition to its failure to drive growth is driving conflict in Pakistan in major part because it has saddled Pakistan with enormous debt, largely employed Chinese construction workers and reserved the deep-sea&nbsp;port for Chinese use while barring Pakistani fishing vessels all the while providing little benefit to Pakistan.</p><p>The continuing problems in turning around the project constitute a blow for both China and Pakistan. China muscled India out of the way to build the Gwadar port. It is considered a major linchpin &#8211; envisioned as arguably the most prestigious &#8211; in China&#8217;s trillion-dollar Belt and Road initiative, providing transport links to China&#8217;s western border nearly 6,000 km away.</p><p>In many ways, the emergence of a militant group in Sindh, which is otherwise considered to be the land of the Sufi, a pacifist and pluralistic Islamic tradition, is an outcome of the ways the CPEC&#8217;s implementation has been designed in ways to cater to China&#8217;s needs first and foremost.</p><p>This exclusionary model of development not only explains anti-China militancy but also shows why different militant groups are in fact coming together for cross-ethnic alliances against both Islamabad and Beijing. As has been extensively reported in the Pakistani media, the SPA is allied with Baloch militant-nationalist groups, with the latter providing logistical support to the former to launch attacks.</p><p>In November 2018, a Baloch National Freedom Movement (BRAS) was launched. BRAS includes three groups, which were until recently rivals and competed with each other for influence. But the China factor has allowed these groups to close their ranks and develop a united front. BRAS includes Balochistan Liberation Army, Balochistan Liberation Front, and Baloch Republican Guards.</p><p>In the recent past, Baloch groups have launched many attacks, including a suicide attack on Chinese teachers in Karachi (Sindh province) in April 2022. While not directly related to these nationalist groups, Chinese interests have also been attacked many times in the recent past by the banned <em>Tehreek-i-Taliban Pakistan </em>(TTP).</p><p>Even though the TTP and groups like BRAS and SPA are not allies, all seek a similar end i.e., weakening the Pakistan state and driving China out of the country. Analysts believe that a <em>de facto </em>alliance between these groups cannot be ruled out completely, now that the TTP is back in Pakistan and has re-emerged as a player in Pakistan&#8217;s Swat valley in Khyber Pakhtunkhwa province and the former Federally Administered Tribal Areas (FATA). It also implies that China and CPEC are not welcome in three of Pakistan&#8217;s four provinces.</p><p><strong>&#8216;Soft Targets&#8217;</strong></p><p>Even though the CPEC is facing a religious and nationalist onslaught, Beijing continues to operate in Pakistan, ostensibly without fear. One of the key reasons for China&#8217;s continued optimism is that these groups have not been able to target any major Chinese establishments or infrastructure in Pakistan. They don&#8217;t have the capacity to launch major attacks and can attack only soft targets, such as teachers and doctors based in Pakistan and those not directly working on the project.</p><p>There is little denying, however, that the Pakistan state has been taking steps for quite some time to beef up security for the Chinese. The Pakistan military has even sealed-off the Gwadar port, which is on lease to the Chinese for 40 years since 2017x, and that a special CPEC security division was raised to ensure security. These steps have had the effect of protecting major Chinese projects.</p><p>Having said that, there is no denying that these security steps cannot by themselves prevent groups like SPA to emerge and target Chinese nationals.</p><p>Even if they are soft targets, the impact remains &#8216;hard&#8217; insofar as it tends to create panic. Following the suicide attack in April 2022, Pakistani media reports indicated many Chinese leaving Pakistan on the first available flights.</p><p>Although Pakistan tried to downplay the significance of this Chinese exodus, reports have also indicated how even these attacks on soft targets have eroded Beijing&#8217;s confidence in Pakistan&#8217;s security system, leading China to contemplate the possibility of deploying, covertly or overtly, their own security agencies in Pakistan to look after the security of their nationals.</p><p>But, even if such a step is taken, it is unlikely to prevent groups like BRAS and SPA from operating. Besides, Islamabad has refused to entertain Beijing&#8217;s request for a Chinese company to operate in Pakistan.</p><p>As an alternative, China has been talking to some &#8216;moderate&#8217; nationalists in Balochistan and Sindh and offering scholarships to the students of these impoverished regions to create a &#8216;soft&#8217; and &#8216;benevolent&#8217; image of itself.</p><p>But these steps are unlikely to change the way the CPEC is viewed by these groups. Specifically, they view the whole CPEC model as flawed. Even though it is a national project and even though all provinces are stakeholders, Pakistan has not been managing this project through the Council of Common Interests (CCI), a constitutional body which includes both Islamabad and all provinces and is empowered to make policy on common national matters.</p><p>Beijing, again, has played a role in it, as Asia Sentinel has learned from multiple Pakistani sources. In fact, Beijing has been trying to convince Islamabad, since 2015, to get rid of the 18th Constitutional amendment of 2010 to end provincial autonomy and make provincial powers and provincial stakes irrelevant for the &#8220;greater good&#8221; of development. Beijing&#8217;s preference for dealing with one center i.e., Islamabad, has created more resentment than development in the provinces.</p>"
}