{
  "title": "Black Hole or Shock Absorber: How Does a Free-Market Economy Respond to Crises?",
  "link": "https://mises.org/node/60742",
  "description": "<p>Mainstream economists view the economy as fickle, unstable, and always in danger of utter collapse. They see the outlook as very bleak if not for the enormous existing superstructure of government intervention, including constant stimulus of “aggregate demand.” In their minds, this essential stabilization would also include the existing intricate arrangement of regulation and restriction, the army of technocratic bureaucrats overlording every market, and the rollout of massive interventions and macro stabilization schemes, whenever necessary.</p>\n<p>This bureaucratic view is predicated on the assumption of the superiority of technocratic ability, “scientific” knowledge, and centralized resources. It is a view that is only plausible when combined with the supposed inability of individual actors to foresee such events or to respond to events, especially those deemed beyond their control. In addition to ignoring government intervention as the cause of crises, this top-down view is incorrect and is directly at odds with reality.<a class=\"see-footnote\" id=\"footnoteref1_k8zuf32\" title=\"A minority of economists, often associated with the Chicago school, believes in “price theory,” but feels that both the gold standard and the Fed are the source of crises that can “pluck” the economy off its long-run growth trajectory and into the economic abyss. As such, they feel that the Fed should follow some kind of nondiscretionary bureaucratic monetary rule such as a 3 percent monetary growth target, the Taylor rule, or nominal gross domestic product targeting.\" href=\"#footnote1_k8zuf32\">1</a></p>\n<p>In contrast, Austrian economists see the free market as highly stable and quick to adapt to changing circumstances, including huge macro destabilizing events such as hurricanes, wars, famines, and pandemics. Here, the crisis is the inevitable result of government intervention, although natural disasters are not ignored.</p>\n<p>This bottom-up view is based on an understanding of the interests and ability of entrepreneurs to respond to events, minor and major, to improve their situation and indirectly to “stabilize” the economy. Individuals can respond to even dramatic changes in supply and demand conditions. They respond to crises as consumers, laborers, managers, and entrepreneurs, as well as communities, churches, civic groups, family members, friends, and neighbors, but all can be paralyzed or incapacitated by the top-down policy approach.</p>\n<p>Without describing the process of how the free-market system works and without the benefit of any real-world experience, the decision of what approach to choose is a coin toss. In a world in which education, the media, and the government all side with the top-down government approach, it will win the public opinion coin toss by default—after all, <em>something</em> must be done! The purpose of this article is to explain how the anarchy of individual actions works to buffer the economy like a shock absorber.</p>\n<h4>The Black Hole of Economics</h4>\n<p>It is hard to explain and understand how mainstream economists think about economic crises, because they have written so little about how the economics of the crisis works, per se. Their bogeyman is deflation. They see deflation, in the form of falling prices, to be like a black hole. If the economy gets near deflation, it will be sucked into the black hole and never be able to emerge again. I have coined the term <a href=\"https://www.urbandictionary.com/define.php?term=Apoplithorismosphobia\">apoplithorismosphobia</a> to describe their psychological problem and <a href=\"https://mises.org/library/apoplithorismosphobia-1\">my article</a> on the same subject should be sufficient to describe the manifestations of the phobia and its tragic results. Ben <a href=\"https://mises.org/library/bernankes-apoplithorismosphobia\">Bernanke</a> has deflation-phobia and so does Paul <a href=\"https://www.nytimes.com/2003/05/24/opinion/fear-of-a-quagmire.html\">Krugman</a> so it is safe to assume the fear is widely spread.</p>\n<p>Their credibility is unmasked by the fact that the biggest direct losers from deflation are the wealthy political elites and crony capitalists. Everyone will get some kind of “haircut” during the process, but the big losers are mostly the same people who benefitted from the corrupt system that caused the crisis in the first place!</p>\n<p>The enormous unmentioned benefit of this deflationary/crisis process is that we might be able to break free from paper fiat-money inflation, the “regulated” fractional reserve banking system, exploding government debt, and the Fed itself! Obviously, the rank-and-file citizen would benefit from the completion of this process.</p>\n<h4>Free-Market Shock Absorbers</h4>\n<p>The traditional vehicle suspension system contains many mechanical parts with the most famous being the shock absorber. It is designed to absorb much of the energy that results from the change in the road surface. It dissipates much of the absorbed energy from bumps in the road to smooth out the ride for motorists. Indeed, much of the automobile involves absorbing shocks, from the tires to the padded seats and steering wheel, making vehicle transport more desirable than otherwise.</p>\n<p>The economic analogy to micro and macroeconomic shocks also involves a similar set of “parts” including prices, markets, warehousing, transportation, etc. That are designed to reduce (minimization subject to cost) shocks. Most of these parts function to economize on the natural uncertainty of change for entrepreneurs that result from unexpected changes in prices, the normal imperfections of the road, so to speak. This process is governed or regulated by the natural system of <a href=\"https://mises.org/library/profit-and-loss-0\">profit and loss</a>.</p>\n<p>These same parts also function in irregular occurrences of macroeconomic shocks, as when the brakes, tires, steering, shock absorbers, etc. Are engaged prior to an accident. The market economy also has analogs to the car’s bumpers, air bags, and other emergency features. These secondary parts include untapped resources, such as savings, land, mines, unused factories, facilities, and residences, and a multitude of unemployed labor at “full employment.” In addition, there is always untapped technology, or “advanced” technology that is unprofitable prior to a shock. The tertiary level of shock absorption are global, financial, and sophisticated institutions that are capable of absorbing macroeconomic shocks, such as multinational corporations and financial institutions, hedge funds, and sovereign funds, although this is not necessarily their primary purpose.</p>\n<p>The primary component in all these shock absorbing parts is entrepreneurship. The free market provides the widest possible latitude for individuals to seek their most rewarding course of action and to achieve their goals. This is true, not just for entrepreneur/business owners, but also for capitalists, property owners, and labor, all of whom are constrained by self-interest, if not by direct profit and loss.</p>\n<p>We can view the free market as a shock absorber for all events large and small. The smallest purchase creates an immediate reaction regarding inventory information that moves backward through the structure of production from retail to wholesale to production facilities to input suppliers and labor markets, and all the way back to raw materials and resource extraction. This system has a built-in, profit driven, feedback mechanism of signals regarding changes in supply or demand, and thus signals to entrepreneurs to either cutback, redouble, or redirect their efforts.</p>\n<p>The failsafe mechanism, beyond adjustments for profit and loss, is related to the legal system. Entire firms can shut down production, downsize, or go out of business. This frees up the company’s resources for alternative uses in other companies. Weak companies can combine with stronger companies through mergers and acquisitions to take advantage of cost savings and economies of scale. Adjacent to this is the process of bankruptcy for insolvent companies, where distressed companies can be reconfigured to continue operating. All these processes create efficiency and frees up resources for alternative uses. So, the basic legal and judicial systems play an important role in this economic process.</p>\n<h4>Nuts and Bolts</h4>\n<p>What happens in an economic crisis is based on the knowledge of how the market works. This in turn explains how the market softens the blow from the crisis. Furthermore, the process is self-contained and self-regulated. It does not need acts of government intervention. This failure to understand the market process is why mainstream economists believe in black hole economics.</p>\n<p>The most salient feature of a crisis is a sharp fall in the value of most capital assets. The most evident aspect of this feature is a strong decline in stock markets. In general, the value of stocks is estimated by the market with the discounted value of its estimated revenues over time and this value is “shocked” by the revelation of a crisis, whether its war, business cycle, or something else. For example, the NASDAQ Composite stock index, which is heavily weighted to technology and capital investment, fell by roughly two-thirds in the tech bust of the early 2000s, by one-half after the housing bubble, and has already fallen by about one-third its value in the current crisis.</p>\n<p>Secondarily, the prices of raw materials also tend to collapse. For example, the price of lumber declined significantly after the Tech Bubble, the Housing Bubble, and the Lockdown Bubble. As a master ingredient in production and consumption, the price of oil ebbs and flows with the Boom Bust cycle as well. The graph below shows the price of oil since the mid-1980s with the National Bureau of Economic Research recessions shaded in gray.</p>\n<div class=\"media media-element-container media-default media-wysiwyg-align-center\"><div id=\"file-136561\" class=\"file file-image file-image-png\">\n\n        <h2 class=\"element-invisible\"><a href=\"/files/fredgraphthorntonpng\">fredgraph_thornton.png</a></h2>\n    \n  \n  <div class=\"content\">\n              <img alt=\"Thornton1\" class=\"media-element file-default\" data-delta=\"1\" typeof=\"foaf:Image\" src=\"https://cdn.mises.org/styles/max_full/s3/fredgraph_thornton.png?itok=AXCj85ID\" width=\"693\" height=\"276\" />      </div>\n\n  \n</div>\n</div>\n<p>A third noteworthy impact of an economic crisis is its negative impact on labor markets. Unemployment in the capital goods related industries is significant and the impact is pervasive on employment, new hirings, and wage rates. We have recently experienced a significant decline in the labor force participation rate, a record number of job openings (60 percent higher than the prelockdown records!), and a very large number of new hirings in the aftermath of government lockdowns, but average real wages have already declined by 10 percent since the recent peak.</p>\n<p>Economic crises also negatively impact the price of consumer goods. With the capital-intensive sectors smashed and fewer job opportunities and lower real wages for workers, it is not surprising that the prices of consumer goods weaken. However, consumers adjust to crises by cutting back on investments, luxury goods, consumer durable purchases, such as homes, cars, clothes, and appliances, and focus on primary goods such as food and energy. This typically means that the prices of such goods do not decline nearly as much as capital and labor.</p>\n<p>This all sounds bad as everything is in decline, but alert individuals realize this situation is pivotal for making profits. If capital and raw material prices have crashed and wage rates have collapsed, but consumer good prices have not, then entrepreneurs will sense and investigate profit opportunities.</p>\n<p>These opportunities cluster around the low prices of capital goods (e.g., office space, real estate, technology, and production facilities), raw materials, and labor (skilled and technology workers and recent college graduates, especially), combined with the relatively elevated prices of final consumer goods. Entrepreneurs exploit these profit opportunities by reorganizing unemployed capital, labor, and materials to sell consumer goods as well as brand new products. This also applies to previously advanced technologies, a silver lining to the otherwise unfortunate boom-bust process.</p>\n<p>For example, imagine a large economic crisis where major airlines go bankrupt, flights are cancelled en masse, planes, pilots, and flight attendants are unemployed, airports are nearly empty, and the price of jet fuel drops considerably. Might airline entrepreneurs not enter the market and offer cheap flights at a profit? Or might former Boeing engineers not develop and test a prototype pilotless plane in their spare time?</p>\n<p>This deflationary process is a primary aspect of the free market’s role as an automatic shock absorber. The best discussion of this is still probably Rothbard’s (1963) <a href=\"chrome-extension://efaidnbmnnnibpcajpcglclefindmkaj/https:/cdn.mises.org/Americas%20Great%20Depression_3.pdf\"><em>America’s Great Depression</em></a> chapter on the theory of the business cycle and his discussion on the “general economic ‘return to normal,’” although the last few pages of <a href=\"https://mises.org/library/lessons-young-economist\">Murphy’s text</a> is also good. This process is generally not taught in economics courses and is not depicted in textbooks, which are typically limited to the topics of the government’s “automatic stabilizers” and fiscal and monetary stabilization policies. William Anderson <a href=\"https://mises.org/library/murray-rothbard-and-deflation-bogey\">summarizes Rothbard’s view on deflation</a>, as well.</p>\n<p>Not surprisingly, the people making decisions concerning an economic crisis—politicians, bureaucrats, and Fed officials—have no skills to make the right decisions. As a result, they are likely to panic and to act in the <a href=\"https://mises.org/wire/feds-real-mandate\">interests of the political elites</a>. This means the <a href=\"https://mises.org/wire/feds-full-employment-mandate-mandate-inflation\">wrong solution of more monetary inflation</a> and other interventions to protect those interests.</p>\n<p>In contrast, the best political solutions are straightforward from a proper understanding of how markets work. I will present them in a future article but in general the idea is to maintain and expand the free-market economy and reduce and restrict government intervention from the economy.</p>\n\n<ul class=\"footnotes\"><li class=\"footnote\" id=\"footnote1_k8zuf32\"><a class=\"footnote-label\" href=\"#footnoteref1_k8zuf32\">1.</a> A minority of economists, often associated with the Chicago school, believes in “price theory,” but feels that both the gold standard and the Fed are the source of crises that can “pluck” the economy off its long-run growth trajectory and into the economic abyss. As such, they feel that the Fed should follow some kind of nondiscretionary bureaucratic monetary rule such as a 3 percent monetary growth target, the Taylor rule, or nominal gross domestic product targeting.</li>\n</ul>\n",
  "author": "Mark Thornton",
  "enclosure": "",
  "guid": 60742,
  "pubDate": "Sat, 29 Oct 2022 06:00:00 -0500",
  "source": "Mises Wire"
}