{
  "title": "Could Giant Pretrained Image Models Extract Universal Representations?. (arXiv:2211.02043v1 [cs.CV])",
  "link": "http://arxiv.org/abs/2211.02043",
  "description": "<p>Frozen pretrained models have become a viable alternative to the\npretraining-then-finetuning paradigm for transfer learning. However, with\nfrozen models there are relatively few parameters available for adapting to\ndownstream tasks, which is problematic in computer vision where tasks vary\nsignificantly in input/output format and the type of information that is of\nvalue. In this paper, we present a study of frozen pretrained models when\napplied to diverse and representative computer vision tasks, including object\ndetection, semantic segmentation and video action recognition. From this\nempirical analysis, our work answers the questions of what pretraining task\nfits best with this frozen setting, how to make the frozen setting more\nflexible to various downstream tasks, and the effect of larger model sizes. We\nadditionally examine the upper bound of performance using a giant frozen\npretrained model with 3 billion parameters (SwinV2-G) and find that it reaches\ncompetitive performance on a varied set of major benchmarks with only one\nshared frozen base network: 60.0 box mAP and 52.2 mask mAP on COCO object\ndetection test-dev, 57.6 val mIoU on ADE20K semantic segmentation, and 81.7\ntop-1 accuracy on Kinetics-400 action recognition. With this work, we hope to\nbring greater attention to this promising path of freezing pretrained image\nmodels.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Lin_Y/0/1/0/all/0/1\">Yutong Lin</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liu_Z/0/1/0/all/0/1\">Ze Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhang_Z/0/1/0/all/0/1\">Zheng Zhang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Hu_H/0/1/0/all/0/1\">Han Hu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zheng_N/0/1/0/all/0/1\">Nanning Zheng</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Lin_S/0/1/0/all/0/1\">Stephen Lin</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Cao_Y/0/1/0/all/0/1\">Yue Cao</a>"
}