{
  "title": "More Rate Hikes Coming",
  "itunes:title": "More Rate Hikes Coming",
  "pubDate": "Fri, 07 Oct 2022 20:00:00 +0000",
  "guid": "92c7408d-13c4-4bcc-8e5d-1b1fee99d17e",
  "link": "https://fool.libsyn.com/more-rate-hikes-coming",
  "itunes:image": "",
  "description": "<p>Make no mistake, investors, September's jobs report is just one more indication that the Federal Reserve will increase interest rates in November.<br /> <br /> (0:21) Andy Cross and Jason Moser discuss:<br /> - AMD warning about lower revenue<br /> - Constellation Brands posting a lost in the 2nd quarter<br /> - Apple looking to boost production in India<br /> - Macy's gaining inventory insights from its own credit-card data<br /> - The latest from McCormick, Peloton, and more<br /> <br /> (19:11) Malcolm Ethridge, host of \"The Tech Money Podcast\", weighs in on prospects for more interest rate hikes, expectations for earnings season, why he's watching seasonal hiring, and the S&P 600.<br /> <br /> (32:45) Jason Moser and Andy Cross discuss the possibility of DraftKings signing an exclusive partnership with ESPN, and share two stocks on their radar: Alphabet and Dream Finders Homes.<br /> <br /> Stocks mentioned: AMD, NVDA, MKC, STZ, PTON, AAPL, M, TGT, NKE, DKNG, DIS, GOOG, GOOGL, DFH<br /> <br /> Host: Chris Hill<br /> Guests: Andy Cross, Jason Moser, Malcolm Ethridge<br /> Engineers: Dan Boyd, Rick Engdahl<br /> <br /></p>",
  "content:encoded": "<p>Make no mistake, investors, September's jobs report is just one more indication that the Federal Reserve will increase interest rates in November.  (0:21) Andy Cross and Jason Moser discuss: - AMD warning about lower revenue - Constellation Brands posting a lost in the 2nd quarter - Apple looking to boost production in India - Macy's gaining inventory insights from its own credit-card data - The latest from McCormick, Peloton, and more  (19:11) Malcolm Ethridge, host of \"The Tech Money Podcast\", weighs in on prospects for more interest rate hikes, expectations for earnings season, why he's watching seasonal hiring, and the S&P 600.  (32:45) Jason Moser and Andy Cross discuss the possibility of DraftKings signing an exclusive partnership with ESPN, and share two stocks on their radar: Alphabet and Dream Finders Homes.  Stocks mentioned: AMD, NVDA, MKC, STZ, PTON, AAPL, M, TGT, NKE, DKNG, DIS, GOOG, GOOGL, DFH  Host: Chris Hill Guests: Andy Cross, Jason Moser, Malcolm Ethridge Engineers: Dan Boyd, Rick Engdahl </p>",
  "enclosure": "",
  "itunes:duration": "38:51",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Make no mistake, investors, September's jobs report is just one more indication that the Federal Reserve will increase interest rates in November.  (0:21) Andy Cross and Jason Moser discuss: - AMD warning about lower revenue - Constellation Brands...",
  "itunes:episodeType": "full"
}