{
  "title": "Empirical constraints on the turbulence in QSO host nebulae from velocity structure function measurements. (arXiv:2209.04344v2 [astro-ph.GA] UPDATED)",
  "link": "http://arxiv.org/abs/2209.04344",
  "description": "<p>We present the first empirical constraints on the turbulent velocity field of\nthe diffuse circumgalactic medium around four luminous QSOs at\n$z\\!\\approx\\!0.5$--1.1. Spatially extended nebulae of $\\approx\\!50$--100\nphysical kpc in diameter centered on the QSOs are revealed in\n[OII]$\\lambda\\lambda\\,3727,3729$ and/or [OIII]$\\lambda\\,5008$ emission lines in\nintegral field spectroscopic observations obtained using MUSE on the VLT. We\nmeasure the second- and third-order velocity structure functions (VSFs) over a\nrange of scales, from $\\lesssim\\!5$ kpc to $\\approx\\!20$--50 kpc, to quantify\nthe turbulent energy transfer between different scales in these nebulae. While\nno constraints on the energy injection and dissipation scales can be obtained\nfrom the current data, we show that robust constraints on the power-law slope\nof the VSFs can be determined after accounting for the effects of atmospheric\nseeing, spatial smoothing, and large-scale bulk flows. Out of the four QSO\nnebulae studied, one exhibits VSFs in spectacular agreement with the Kolmogorov\nlaw, expected for isotropic, homogeneous, and incompressible turbulent flows.\nThe other three fields exhibit a shallower decline in the VSFs from large to\nsmall scales. However, with a limited dynamic range in the spatial scales in\nseeing-limited data, no constraints can be obtained for the VSF slopes of these\nthree nebulae. For the QSO nebula consistent with the Kolmogorov law, we\ndetermine a turbulence energy cascade rate of $\\approx\\!0.2$ cm$^{2}$ s$^{-3}$.\nWe discuss the implication of the observed VSFs in the context of QSO feeding\nand feedback in the circumgalactic medium.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Chen_M/0/1/0/all/0/1\">Mandy C. Chen</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Chen_H/0/1/0/all/0/1\">Hsiao-Wen Chen</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Rauch_M/0/1/0/all/0/1\">Michael Rauch</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Qu_Z/0/1/0/all/0/1\">Zhijie Qu</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Johnson_S/0/1/0/all/0/1\">Sean D. Johnson</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Li_J/0/1/0/all/0/1\">Jennifer I-Hsiu Li</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Schaye_J/0/1/0/all/0/1\">Joop Schaye</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Rudie_G/0/1/0/all/0/1\">Gwen C. Rudie</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Zahedy_F/0/1/0/all/0/1\">Fakhri S. Zahedy</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Boettcher_E/0/1/0/all/0/1\">Erin Boettcher</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Cooksey_K/0/1/0/all/0/1\">Kathy L. Cooksey</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Cantalupo_S/0/1/0/all/0/1\">Sebastiano Cantalupo</a>"
}