{
  "title": "UK lacks pilots for F-35 jets – defense secretary",
  "link": "https://www.rt.com/news/565776-uk-f35-training-crisis/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565776-uk-f35-training-crisis/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6362106685f5402ed14829e3.jpg\" /> The UK military has more F-35 fighter jets than pilots to fly them due to a training crisis, the UK defense secretary has said <br/><a href=\"https://www.rt.com/news/565776-uk-f35-training-crisis/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The military is struggling to man all the warplanes due to a training crisis, Ben Wallace has said</strong></p>\n            \n                        \n            <p></p>\n<p>The UK military does not have enough pilots to operate its state-of-the-art F-35 fighters due to training issues, Defense Secretary Ben Wallace said on Tuesday. The UK has over two dozen of the warplanes.</p>\n<p>Speaking to the House of Lords, Wallace admitted that manning all of the F-35s presents <em>&ldquo;quite a challenge.&rdquo;</em> Explaining the reasons, he noted that flight training has been plagued by delays, with pilots waiting up to eight years before meeting the requirements to operate the sophisticated fighters instead of the target time of two to three years.</p>\n<p><em>&ldquo;Our pilot pipeline is not in a place I would want it to be,&rdquo;</em> he said.</p>\n<p>According to Wallace, another factor is that the F-35s are relatively new.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/6341257a85f5401c1840fa07.jpg\" alt=\"A Lockheed Martin F-35 fighting jet is pictured at the ILA Berlin Air Show in Schoenefeld near Berlin, on June 22, 2022.\" />\n            <figcaption><a href=\"https://www.rt.com/news/564275-pentagon-f35-approves-chinese-alloy/\">Pentagon approves F-35 deliveries containing Chinese alloy – Politico</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>In total, the Royal Air Force and Royal Navy plan to operate 138 5th-generation F-35B short takeoff/vertical landing aircraft. However, the UK has so far purchased only 27 of the aircraft in the joint US-led program.</p>\n<p>The UK announced its intention to buy F-35s as early as in 2006.</p>\n<p>In early August, Sky News reported that more than two years ago, the defense secretary instructed Air Chief Marshal Sir Mike Wigston, who heads the Royal Air Force, to <em>&ldquo;fix chronic problems&rdquo;</em> with flight training and treat the issue as &ldquo;<em>his only priority.&rdquo;</em></p>\n<p>At the time, the outlet noted that the Air Force was concerned by a <em>&ldquo;damaging drain&rdquo;</em> of qualified pilots who opted for more lucrative jobs in industry over staying and training new recruits.</p>",
  "enclosure": "",
  "pubDate": "Wed, 02 Nov 2022 07:55:13 +0000",
  "dc:creator": "RT"
}