{
  "title": "128: Shut Up and Sing",
  "link": "https://audioboom.com/posts/7555288",
  "itunes:episode": 128,
  "itunes:title": "Shut Up and Sing",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3394,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In 2003, The Dixie Chicks were on top of the world. They were the number 1 selling female band of all time, They were Grammy winners, and all around darlings of the country music scene. But then, at a club date in London, the band's lead singer, Natalie Manines, told the crowd that the band was \"ashamed that the President of the United States is from Texas.\" The backlash from their American fans was immediate. People burned their CDs, country music stations banned their music, and the band members received death threats. And we have A LOT to say about all of it<br>\n<br>\n<strong>WARNING! PLEASE READ BEFORE LISTENING! </strong>It won't come as a shock that this episode deals with politics. It also won't come as a shock that Patrick and Gillian love the Dixie Chicks and think they were on the right side of history. Patrick and Gillian also believe that if you disagree with them, you are entitled to your opinion. Believe it or not, we don't get too into the politics here, though, obviously it's in there. We hope all of our listeners can enjoy this episode. However, if the discussion of Bush-era politics and hearing Natalie Maines call The President a dumb fuck is going to upset you, no hard feelings if you want to skip this one. <br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 100 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n<br>\n<a href=\"https://www.obsessedwithpod.com/\"><strong>WE LAUNCHED A NEW PODCAST!</strong></a> \"Obsessed With: Abducted In Plain Sight\" is a 4-part podcast series hosted by Patrick Hinds and Skye Borgman, the director of <em>Abducted in Plain Sight. </em>The podcast takes you behind the scenes of the smash hit documentary by sharing new interview with Jan and her parents, deleted scenes, AN INSANE PLOT LINE THAT LEFT OUT OF THE FILM THAT YOU WON'T BELIEVE, and audio journal recorded by the kidnapper himself and later recovered by the FBI. <strong>BINGE ALL 4 EPISODES NOW WHEREVER YOU GET YOUR PODCASTS!</strong>\n</div>\n",
  "pubDate": "Tue, 14 Apr 2020 04:01:00 +0000",
  "guid": "tag:audioboom.com,2020-04-13:/posts/7555288",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}