{
  "title": "Hiring Data Scientists",
  "link": "",
  "published": "2018-02-04T00:00:00-08:00",
  "updated": "2022-11-03T04:16:07-07:00",
  "author": {
    "name": "Greg Reda"
  },
  "id": "tag:www.gregreda.com,2018-02-04:/2018/02/04/hiring-data-scientists/",
  "summary": "<p>Chicago's a big city that feels small -- everyone seems only a degree or two\naway from one another. This feels especially true within Chicago's tech and data\nscience communities.</p>\n<p>As a result, I occasionally get asked about hiring data scientists.\nSpecifically, how do you vet, hire, and evaluate a data …</p>",
  "content": "<p>Chicago's a big city that feels small -- everyone seems only a degree or two\naway from one another. This feels especially true within Chicago's tech and data\nscience communities.</p>\n<p>As a result, I occasionally get asked about hiring data scientists.\nSpecifically, how do you vet, hire, and evaluate a data scientist if you don't\nhave existing experience (either personally or within your company)?</p>\n<p>While I feel this is a hard problem -- and one I never have a great answer\nto -- I figured sharing how I think about hiring might prove helpful to others.</p>\n<h3>How I think about it</h3>\n<p>My general belief is that so long as the candidate clears some\nprogramming bar and some quantitative bar (neither of which should be too high),\nthe most important things for success are <em><strong>curiosity and skepticism</strong></em>.</p>\n<p>The programming and quantitative bars should be based <em><strong>solely on examples of\nwork they'd do on the job</strong></em>.</p>\n<p>I do this via a small take-home assignment that should take candidates a couple\nof hours. The assignment asks variations of questions they are likely to encounter\nin the role. A small dataset is provided, which the questions reference.</p>\n<p>In my opinion, the programming and quantitative bars mostly come down to:</p>\n<ul>\n<li>\n<p>Can they write code to do what they need to? Getting data out of a database, analysis at scale, automating some regular analysis, etc.</p>\n</li>\n<li>\n<p>Do they think from a quantitative perspective? Do they think probabilistically?</p>\n</li>\n<li>\n<p>Can they build a basic model and evaluate it? Do they understand statistics enough such that their analysis will not be <em>harmful</em>?</p>\n<ul>\n<li>My belief is that <em>no data</em> is preferable to <em>bad data</em>. With no data, you're forced to seek alternative forms of information (e.g. talking to users). With bad data, you risk drawing improper conclusions that lead you astray -- false confidence.</li>\n</ul>\n</li>\n</ul>\n<p>Assuming the candidate clears these bars, I believe curiosity and skepticism are the two most\nimportant attributes for success.</p>\n<p>If they are curious, they will continue to fill gaps in their knowledge, learn\nnew approaches to problems, and seek to continuously learn the business/product\nside -- and how their work can add value to it. A data scientist that has a\ntendency to go down rabbit holes can be a good thing if properly directed.</p>\n<p>If they are skeptical, they'll refine everyone's\nthought process by questioning things in a healthy way. They'll innately seek to\nprove things believed to be true and they'll seek to answer questions\nthat arise -- be it via their own curiosity or others'. This skepticism also\nacts as a check -- they'll seek alternative ways to prove and\ntest their own work, cautiously fearful of creating bad data that can lead to\nimproper action.</p>\n<h3>My interview process</h3>\n<ol>\n<li>\n<p>Phone screen with recruiter (30 mins)</p>\n</li>\n<li>\n<p>Phone screen with me (30 mins)</p>\n</li>\n<li>\n<p>Take-home assignment (~2 hours)</p>\n</li>\n<li>\n<p>In-office interview (3 hours)</p>\n</li>\n</ol>\n<p>The phone screens are really about feeling the person out, learning about what they're\nlooking for next, and digging into specifics about their past experience/work.</p>\n<p>The take-home assignment acts as the \"programming and statistical bar\" with\nrespect to the job -- brief examples of questions or problems they might work on\nin the role. We ask candidates to provide any code they wrote or charts\nthey created to answer all questions, even if it's exploratory in nature. We\nalso ask that they be prepared to discuss their work during interviews.</p>\n<p>My in-office interviews are three one-hour interviews. Usually, two one-hour\ninterviews with myself and my team, and a joint interview with a\nproduct manager and platform engineer. Time is <em>always</em> left for the candidate\nto ask the interviewers questions.</p>\n<p>I should note that depending on how tenured the candidate is and their existing\nbody of work, this process might change slightly. My approach tends to change when\ncandidates can point me to prior work (GitHub, side projects, blog posts).</p>\n<p>If you’re looking for more details an ideal hiring process for data scientists, <a href=\"http://treycausey.com/hiring_data_scientists.html\">Trey Causey’s advice is excellent</a> and has influenced much of my thinking. Similarly, <a href=\"http://qethanm.cc/\">Q McCallum</a>’s series on <a href=\"http://qethanm.cc/2018/01/23/common-mistakes-in-data-science-hiring-part-1/\">common data science hiring mistakes</a> offers practical advice to determine whether you actually need a data scientist, and that you can hire and retain them. Finally, <a href=\"https://mpopov.com/\">Mikhail Popov</a>'s piece on <a href=\"https://blog.wikimedia.org/2017/02/02/hiring-data-scientist/\">Wikipedia's approach to data science hiring</a> is worth your time.</p>",
  "category": [
    "",
    "",
    "",
    "",
    ""
  ]
}