{
  "title": "Can you be addicted to food? With Ashley Gearhardt, PhD",
  "itunes:title": "Can you be addicted to food? With Ashley Gearhardt, PhD",
  "pubDate": "Wed, 17 Aug 2022 10:30:00 +0000",
  "guid": "53c023b7-0ec4-40c8-a83f-8ef72de14b49",
  "link": "http://sopapa.libsyn.com/can-you-be-addicted-to-food-with-ashley-gearhardt-phd",
  "itunes:image": "",
  "description": "<p>We live in a nation awash with cheap, easy-to-get calories, mostly from highly processed convenience foods. Now, some researchers argue that these foods may actually be addictive – just like cigarettes or alcohol. Ashley Gearhardt, PhD, of the University of Michigan, talks about why highly processed foods may trigger addiction, the difference between addiction and simply liking to indulge in treats, who is most at risk for food addiction, and more.<br /> <br /> <br /> <strong>Links</strong><br /> <br /> <br /> <a href= \"https://lsa.umich.edu/psych/people/faculty/agearhar.html\">Ashley Gearhardt, PhD</a><br /> <a href=\"https://www.speakingofpsychology.org\">Speaking of Psychology Home Page</a><br /> <br /></p>",
  "content:encoded": "<p>We live in a nation awash with cheap, easy-to-get calories, mostly from highly processed convenience foods. Now, some researchers argue that these foods may actually be addictive – just like cigarettes or alcohol. Ashley Gearhardt, PhD, of the University of Michigan, talks about why highly processed foods may trigger addiction, the difference between addiction and simply liking to indulge in treats, who is most at risk for food addiction, and more.   Links   <a href= \"https://lsa.umich.edu/psych/people/faculty/agearhar.html\">Ashley Gearhardt, PhD</a> <a href=\"https://www.speakingofpsychology.org\">Speaking of Psychology Home Page</a> </p>",
  "enclosure": "",
  "itunes:duration": "37:36",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "We live in a nation awash with cheap, easy-to-get calories, mostly from highly processed convenience foods. Now, some researchers argue that these foods may actually be addictive – just like cigarettes or alcohol. Ashley Gearhardt, PhD, of the...",
  "itunes:episode": 202,
  "itunes:episodeType": "full",
  "itunes:author": "American Psychological Association"
}