{
  "title": "23: The Time Saving Episode",
  "link": "https://audioboom.com/posts/7042808",
  "itunes:episode": 23,
  "itunes:title": "The Time Saving Episode",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2574,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Time, time, there’s never enough TIME! Good thing you found this episode. On today’s show, you’ll find great time-saving healthy foods, from liquid egg whites to frozen fillo shells! Plus, Lisa shows you the fastest ways to make lunch and dinner! But wait, there’s more... Time-saving kitchen gadgets, time-saving kitchen hacks, and we even have enough time for a rousing round of CHEW or FALSE? trivia! We’re about to save you SO much time, you’ll be able to listen to this episode twice! [www.hungry-girl.com/foodcast](www.hungry-girl.com/foodcast)",
  "itunes:subtitle": "Time, time, there’s never enough TIME! Good thing you found this episode. On today’s show, you’ll find great time-saving healthy foods, from liquid egg whites to frozen fillo shells! Plus, Lisa shows you the fastest ways to make lunch and dinner! But w...",
  "itunes:summary": "Time, time, there’s never enough TIME! Good thing you found this episode. On today’s show, you’ll find great time-saving healthy foods, from liquid egg whites to frozen fillo shells! Plus, Lisa shows you the fastest ways to make lunch and dinner! But wait, there’s more... Time-saving kitchen gadgets, time-saving kitchen hacks, and we even have enough time for a rousing round of CHEW or FALSE? trivia! We’re about to save you SO much time, you’ll be able to listen to this episode twice! [www.hungry-girl.com/foodcast](www.hungry-girl.com/foodcast)",
  "content:encoded": "<p>Time, time, there’s never enough TIME! Good thing you found this episode. On today’s show, you’ll find great time-saving healthy foods, from liquid egg whites to frozen fillo shells! Plus, Lisa shows you the fastest ways to make lunch and dinner! But wait, there’s more... Time-saving kitchen gadgets, time-saving kitchen hacks, and we even have enough time for a rousing round of CHEW or FALSE? trivia! We’re about to save you SO much time, you’ll be able to listen to this episode twice! <a >www.hungry-girl.com/foodcast</a></p>",
  "pubDate": "Fri, 12 Oct 2018 10:00:00 +0000",
  "guid": "tag:audioboom.com,2018-10-12:/posts/7042808",
  "itunes:author": "Lisa Lillien",
  "dc:creator": "Lisa Lillien",
  "media:rights": ""
}