{
  "guid": "tag:blogger.com,1999:blog-2761684730989137546.post-6168133699274693468",
  "pubDate": "Wed, 02 Nov 2022 15:27:00 +0000",
  "atom:updated": "2022-11-02T11:27:48.386-04:00",
  "title": "Bank Liquidity Management Introduction — Brian Romanchuk",
  "description": "<p>&nbsp;Important for understanding some of the details of MMT. MMT is not about just government finance but the operations of the monetary system in general (general case) and in specific jurisdictions (special cases). Thus, the banking system and how it interfaces with the government needs to be understood from the institutional POV.</p><blockquote style=\"font-style: italic;\">For modern financial systems, the key distinguishing characteristic of banks is that they key managers of the liquidity of the system. Although one can find small banks (or community banks) that operate on more traditional lines, banking firms are diversified and operate in the capital markets as well taking in deposits and making loans in the manner described in most banking primers. What differentiates banks from other financial firms is that they are in the business of selling liquidity via credit lines. In order to credibly offer that service, the banks themselves have to been seen as being unquestionably liquid.<br /><br />Although central bank lender-of-last-resort facilities offer the ultimate backstop of banking system liquidity, the reality is that everyone involved views such operations represent a failure on the part of the banks — they will only exist further at the whims of the government. The role of regulators and risk managers at banks is to avoid that outcome. In this article, I discuss how the system is supposed to work.…</blockquote><div>When banks provide liquidity they are essentially \"creating money\" owing to their special relationship with the central bank as the currency issuer through their access to the payments system in return for submitting to regulation and oversight.&nbsp;</div><div><br /></div><div>So it becomes necessary to understand central banking, commercial banking, and the institutional relationship of the two. This is the basis of MMT's operational description component. See MMT economist Eric Tymoigne's book on money &amp; banking <a href=\"https://neweconomicperspectives.org/money-banking\">here</a>.</div><div><br /></div>Bond Economics<br /><a href=\"http://www.bondeconomics.com/2022/11/bank-liquidity-management-introduction.html\">Bank Liquidity Management Introduction</a><br />Brian Romanchuk",
  "link": "http://mikenormaneconomics.blogspot.com/2022/11/bank-liquidity-management-introduction.html",
  "thr:total": 4,
  "author": "contrarianmedia@hotmail.com (Mike Norman)"
}