{
  "title": "The Annual Freakonomics Kentucky Derby Predictions",
  "link": "https://freakonomics.com/2015/05/the-annual-freakonomics-kentucky-derby-predictions/",
  "dc:creator": "Steven D. Levitt",
  "pubDate": "Fri, 01 May 2015 19:00:14 +0000",
  "category": [
    "Freakonomics Blog",
    "gambling",
    "Kentucky Derby",
    "Kentucky Derby Predictions",
    "Steven D. Levitt"
  ],
  "guid": "http://freakonomics.com/?p=110130",
  "description": "<p>Almost a decade of blogging had worn me down, but after some time off, I'm ready to jump back in the saddle. I can't think of a better way than by embarrassing myself with the annual Kentucky Derby predictions!</p>\n<p>The post <a rel=\"nofollow\" href=\"https://freakonomics.com/2015/05/the-annual-freakonomics-kentucky-derby-predictions/\">The Annual Freakonomics Kentucky Derby Predictions</a> appeared first on <a rel=\"nofollow\" href=\"https://freakonomics.com\">Freakonomics</a>.</p>\n",
  "content:encoded": "<p>&nbsp;</p>\n<div id=\"attachment_110131\" style=\"width: 370px\" class=\"wp-caption alignleft\"><a href=\"https://flic.kr/p/nRTDWC\"><img aria-describedby=\"caption-attachment-110131\" loading=\"lazy\" class=\"wp-image-110131 \" src=\"https://freakonomics.com/wp-content/uploads/2015/05/Kentucky-Derby-2015-1024x481.jpg\" alt=\"(Photo: Florian Christoph)\" width=\"360\" height=\"169\" /></a><p id=\"caption-attachment-110131\" class=\"wp-caption-text\">(Photo: Florian Christoph)</p></div>\n<p>Almost a decade of blogging had worn me down, but after some time off, I&#8217;m ready to jump back in the saddle. I can&#8217;t think of a better way than by embarrassing myself with the annual Kentucky Derby predictions!</p>\n<p>I can&#8217;t remember the last time I was so excited about a Kentucky Derby.</p>\n<p>It&#8217;s not that there is some particular horse that I have an emotional attachment to it.  It is not that there is a particularly compelling story line going into this year&#8217;s race.</p>\n<p>Nope.  The reason is that I am a gambler, and unlike most years, the numbers coming out of my model are telling me that I should bet a whole lot of money on this year&#8217;s derby.</p>\n<p>There are two likely betting favorites in this year&#8217;s race: American Pharaoh and Dortmund.  Favorites tend to be the smart bets in horse racing because of a very pronounced &#8220;long shot&#8221; bias.  On average, bettors are much too optimistic about the winning chances of the long shots relative to the favorites.  Because the odds are determined by the bettors, the smart thing to do is usually to stick with favorites.</p>\n<p>My model, quite unusually, dislikes both favorites in this year&#8217;s Kentucky Derby.  If I&#8217;m right (and those who follow my annual predictions know that I rarely am), that means there is a good chance that the top three or four finishers might all be long shots.  Which means that the potential payoffs on what are called &#8220;exotic&#8221; bets (e.g. picking the top three finishers in the exact order) could be huge.  Which, as a gambler, gets me excited!</p>\n<p>My single favorite horse is Upstart, who will likely have odds of about 15-1.</p>\n<p>I also like Tencendur, Bolo and  Materiality.  And if you want a real long shot &#8212; try Itsaknockout&#8230;but I am guessing he will be 80-1 when the final odds are determined.</p>\n<p>I always try to predict the horse that will finish last as well (most notably <a href=\"https://freakonomics.com/2009/05/04/thankfully-no-one-pays-attention/\">Mine That Bird</a>).  My model doesn&#8217;t see any real stinkers this year.  But if I had to pick one bad horse, it would be Mr. Z.</p>\n<p>If you are looking to bet the Derby, I have some good friends who have built a cool company that tries to make it fun and easy for novices to bet on horses.  It&#8217;s called <a href=\"https://derbyjackpot.com/triple-crown/kentucky-derby?a=freakonomics2015\">Derby Jackpot</a>.  (I have no financial interest in Derby Jackpot, but my friends do, and they would really like you to come and bet with them.)</p>\n<p>Good luck!</p>\n<p>The post <a rel=\"nofollow\" href=\"https://freakonomics.com/2015/05/the-annual-freakonomics-kentucky-derby-predictions/\">The Annual Freakonomics Kentucky Derby Predictions</a> appeared first on <a rel=\"nofollow\" href=\"https://freakonomics.com\">Freakonomics</a>.</p>\n"
}