{
  "title": "Big Tech tightens belt amid global economic woes",
  "link": "https://www.rt.com/news/565937-us-big-tech-cut-costs/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565937-us-big-tech-cut-costs/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6364c62520302730c371f4ab.jpg\" /> US tech companies Amazon, Lyft, and Stripe are clamping down on costs, slashing jobs in some cases, due to economic woes <br/><a href=\"https://www.rt.com/news/565937-us-big-tech-cut-costs/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Amazon has frozen hiring, while two other technology companies have announced job cuts</strong></p>\n            \n                        \n            <p>Amazon and two other major US tech companies are the latest big names in corporate America to sound the economic alarm, announcing job cuts and other cost-control measures as they brace for <em>&ldquo;leaner times.&rdquo;</em></p>\n<p>Ride-hailing giant Lyft Inc. revealed on Thursday that it will slash its staffing by 13%, eliminating about 700 jobs. Stripe Inc., a major payments processor, announced a 14% reduction in its workforce, putting around 1,000 people out of work. Amazon, the world&rsquo;s largest retailer, told employees that it&rsquo;s freezing corporate hiring for at least the next few months.</p>\n<p><em>&ldquo;We are facing stubborn inflation, energy shocks, higher interest rates, reduced investment budgets and sparser startup funding,&rdquo;</em> Stripe co-founders Patrick and John Collison said in a note to employees.&nbsp;The company underestimated the impact of a broad economic slowdown, they added, and now must cut costs <em>&ldquo;to adapt ourselves to the world we&rsquo;re headed into.&rdquo;</em></p>\n<blockquote>\n<p><strong><em>Many parts of the developed world appear to be headed for recession. We think that 2022 represents the beginning of a different economic climate.</em></strong></p>\n</blockquote>\n<p>Lyft offered a similar explanation to its staffers, saying that it must become leaner to cope with a <em>&ldquo;probable recession&rdquo;</em> and rising insurance costs. <em>&ldquo;We worked hard to bring down costs this summer,&rdquo;</em> co-founders Logan Green and John Zimmer said, adding that job cuts became necessary after an earlier hiring freeze and other steps failed to tighten expenses enough.</p>\n<p>Amazon cited economic uncertainty in announcing its hiring freeze. <em>&ldquo;We&rsquo;re facing an unusual macroeconomic environment and want to balance our hiring and investments with being thoughtful about this economy,&rdquo;</em> Beth Galetti, senior vice president for people experience and technology, told employees. Amazon CEO Andy Jassy has taken other steps in recent months to cut costs, such as closing call centers, discontinuing a tele-health service, and canceling or delaying new warehouse construction.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6363afb22030274fcd71fcc6.jpg\" alt=\"RT\" />\n            <figcaption><a href=\"https://www.rt.com/business/565857-elon-musk-twitter-layoffs/\">Elon Musk to fire half of Twitter’s staff – Bloomberg</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>The latest Big Tech belt-tightening follows job cut announcements in recent weeks by companies such as Microsoft Corp., Oracle Corp., and Facebook parent Meta Platforms Inc. Like Amazon, Google and Apple Inc. have announced hiring freezes. Billionaire Elon Musk plans to fire nearly half of the 7,500 employees at Twitter after completing his $44 billion takeover of the social media platform last week, according to a Bloomberg report.</p>\n<p>Nevertheless, with US midterm congressional elections approaching next week, President Joe Biden and members of his administration have denied that the nation&rsquo;s economy is slumping. Biden, in fact, called the US economy <em>&ldquo;strong as hell.&rdquo;</em> Even as Thursday brought more announcements of job cuts, White House spokeswoman Karine Jean-Pierre told reporters that the strength of the US labor market is <em>&ldquo;just not consistent with a recession, or with even a pre-recession. We believe our economy is incredibly resilient.&rdquo;</em></p>\n<p></p>",
  "enclosure": "",
  "pubDate": "Fri, 04 Nov 2022 08:00:52 +0000",
  "dc:creator": "RT"
}