{
  "title": "5G Networks Are Worryingly Hackable",
  "link": "https://spectrum.ieee.org/5g-virtualization-increased-hackability",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/illustration-of-network-with-locks-around-it.jpg?id=31141770&width=1200&height=800&coordinates=0%2C83%2C0%2C84\"/><br/><br/><p>Prominent tech firms like <a href=\"https://www.lightreading.com/service-provider-cloud/with-hacks-on-rise-microsoft-looks-to-secure-open-ran/d/d-id/779743\" rel=\"noopener noreferrer\" target=\"_blank\">Microsoft</a> and <a href=\"https://www.fiercewireless.com/tech/nec-exec-open-ran-moving-pretty-fast-compared-prior-tech-shifts\" rel=\"noopener noreferrer\" target=\"_blank\">NEC</a> have recently expressed concerns over the security and perhaps too-rapid adoption, respectively, of critical 5G technologies. Now German security researchers have given some substance to the industry’s fears and unease.</p><p>At a hacker conference held in the Netherlands last month, <a href=\"https://www.youtube.com/watch?v=LRQsFTmWa2w\" rel=\"noopener noreferrer\" target=\"_blank\">Karsten Nohl</a>, founder of Berlin-based <a href=\"https://www.srlabs.de/\" rel=\"noopener noreferrer\" target=\"_blank\">Security Research Labs</a>, outlined how his team had breached live 5G networks in a series of “red teaming” exercises—where hackers are hired by a company to test their defenses. In most cases they were able to take control of the network, he says, potentially allowing them to steal customer data or disrupt operations.</p><p>The hacks, <a href=\"https://media.ccc.de/v/mch2022-273-openran-5g-hacking-just-got-a-lot-more-interesting\" rel=\"noopener noreferrer\" target=\"_blank\">revealed at the May Contain Hackers 2022 event (a.k.a. MCH2022</a>), were made possible thanks to poorly configured cloud technology, which is playing an increasingly important role in 5G networks. Nohl says many telcos are inexperienced in how to protect such systems, and his team found that operators had failed to apply basic cloud security techniques that could help mitigate hacks.</p><p class=\"pull-quote\">The push toward Open RAN, virtualization, and “cloudifcation” unlocks more choice and functionality for 5G operators. It has also thrust them into the unfamiliar role of system integrator, suddenly responsible for securing the entire supply chain.</p><p>“5G has swept over telcos with all its implications, and nobody seems well prepared,” says Nohl. “We are introducing new technology into mobile networks, and those technologies can greatly enhance the security of our mobile networks. Or they can basically destroy any hacking resistance we’ve built up over the years. People are not aware of those choices.”</p><p>Mobile operators have traditionally relied on proprietary hardware from vendors like Ericsson, Nokia, and Huawei to build their networks. But in recent years, there has been a major push to “virtualize” network functions, which involves replicating key components in software so they can run on generic hardware, or even in the cloud. And the advent of 5G has only heightened the demand for virtualization, in particular when it comes to <a href=\"https://en.wikipedia.org/wiki/Radio_access_network\" target=\"_blank\">radio access networks (RANs)</a>—the part of the network involved in connecting end-user devices like cellphones to the network core.</p><p>Virtualization has a host of benefits, including the ability to deploy networks faster and more cheaply, to quickly upgrade networks, and even to dynamically reconfigure them in response to changing situations on the ground. The decoupling of hardware and software also prevents <a href=\"https://en.wikipedia.org/wiki/Vendor_lock-in\" target=\"_blank\">vendor lock-in</a> and allows network operators to mix and match components from different companies, something advocated for by the <a href=\"https://spectrum.ieee.org/the-cellular-industrys-clash-over-the-movement-to-remake-networks\" target=\"_self\">Open RAN movement</a>.</p><p>But these new capabilities are also making 5G networks more complex, says Nohl, which in turn necessitates the increasing use of automation to manage networks. And the ability to mix and match software and services from different companies means far more people are involved in the development pipeline. “The more stuff you have and the more moving parts, the more opportunities for mistakes, little misconfigurations,” says Nohl.</p><p>This makes it much easier to break into such virtualized networks than was previously possible. Among the entry points the team discovered included a backdoor-revealing API that had been posted publicly to the Internet as well as an old development site that had accidentally been left online. But the increased ease with which attackers can penetrate the networks is not in and of itself the main problem. “The really critical question is how difficult it is to break through from your initial foothold to something actually valuable within the network,” says Nohl.</p><p>His team found it was worryingly easy to move deeper into the networks they tested, thanks primarily to poorly configured “containers.” These are self-contained packages of software that bundle up an application and everything needed to run it—code, software libraries, and configuration files—so that it can be run on any hardware. Containers are a critical part of the cloud, because they allow different applications from different companies or departments to run alongside one another on the same servers. Containers are supposed to be isolated from one another, but if they are poorly configured it’s possible to break out and gain access to other containers or even to take control of the host system. In multiple instances Nohl and his team found misconfigured containers that allowed them to do just this.</p><p class=\"pull-quote\">“I saw it many times when security teams were invited to the party when all is done and almost finished. The security guys have a very short time slot in order to fine-tune it—if they are actually allowed to touch it.”<br/>—Dmitry Kurbatov, SecurityGen</p><p>Some of the above difficulties could be attributed to the fact that telcos are inexperienced when it comes to cloud security, says Nohl. But they also may be taking shortcuts. Often operators are “lifting and shifting” preexisting software components into containers, Nohl said, but many of the settings designed to isolate containers from one another prevent the software from working as it should. Rather than rewriting code, developers often simply remove these protections, says Nohl. “Those shortcuts we see everywhere now,” he says.</p><p>“Network operators are having to move into a new operating model that’s significantly different than what they’ve done in the past,” says <a href=\"https://www.linkedin.com/in/erichanselman/\" rel=\"noopener noreferrer\" target=\"_blank\">Eric Hanselman</a>, chief analyst at 451 Research. “The reality is that telcos have never had to deal with these levels of software development or low-level infrastructure management before. They always rely on their suppliers for this.”</p><p>While the shift toward Open RAN and the growing virtualization and “cloudifcation” of networks is unlocking more choice and functionality for operators, says Hanselman, it has also thrust them into the unfamiliar role of system integrator, responsible for securing the entire supply chain.</p><p><a href=\"https://www.linkedin.com/in/xcosta/\" target=\"_blank\">Xavier Costa Pérez</a>, head of 5G networks R&D at <a href=\"https://www.neclab.eu/\" target=\"_blank\">NEC Laboratories Europe</a>, disputes that operators are behind the curve when it comes to 5G security. While he admits that the transition to more virtualized networks entails inevitable risks, he says major players are investing heavily in security and partnering with cloud providers to tap into their security expertise. “I think the telco industry is very much aware that this can be a big issue,” he says. “It’s critical for survival, so I don’t think it’s taken lightly at all.”</p><p>It’s also important to remember that these kinds of highly virtualized networks still represent only a small portion of the 5G infrastructure today, probably less than 10 percent, says Costa Pérez. And all operators have backup 4G networks that they can switch to in the event of any problems.</p><p>Network operators aren’t complacent, says Ian Smith, security operations director at the industry body <a href=\"https://www.gsma.com/\" target=\"_blank\">GSMA</a>. “We know that maintaining security, especially for new network technologies, is an ongoing and evolving effort, and one to which the mobile industry is wholeheartedly committed.”</p><p>However, that hasn’t been the experience of <a href=\"https://www.linkedin.com/in/dmitry-kurbatov/?originalSubdomain=uk\" rel=\"noopener noreferrer\" target=\"_blank\">Dmitry Kurbatov</a>, cofounder of telecom security startup SecurityGen. He has found that security often appears to be an afterthought, rather than being part of the development process from the start. “I saw it many times when security teams were invited to the party when all is done and almost finished.” he says. “The security guys have a very short time slot in order to fine-tune it—if they are actually allowed to touch it.”</p><p>Nonetheless, he’s optimistic about the shift to 5G. Previously, operators had little option but to trust vendors when it came to security, but now they will be able to take matters into their own hands. “You actually can have full visibility and control over [5G] systems and functions, which means now you have the chance as the network owner to be much more secure,” he says.</p><p>And even more important, the industry isn’t alone in going through the transition to the cloud, says John Carse, chief information security officer at the Japanese operator <a href=\"https://corp.mobile.rakuten.co.jp/english/\" target=\"_blank\">Rakuten Mobile</a>, which has been a champion of Open RAN principles. “This is a good thing because it means telecom doesn’t have a special problem to solve,” he says. “Telecom can benefit from adoption of techniques happening in all the industries surrounding it versus trying to overcome proprietary challenges.”</p>",
  "pubDate": "Wed, 24 Aug 2022 20:09:18 +0000",
  "guid": "https://spectrum.ieee.org/5g-virtualization-increased-hackability",
  "category": [
    "Cybersecurity",
    "Telecommunications",
    "Open ran",
    "5g"
  ],
  "dc:creator": "Edd Gent",
  "media:content": ""
}