{
  "title": "Tiny particles work together to do big things",
  "link": "https://news.mit.edu/2022/microparticles-oscillating-current-1013",
  "description": "Simple microparticles can beat rhythmically together, generating an oscillating electrical current that could be used to power microrobotic devices.",
  "pubDate": "Thu, 13 Oct 2022 05:00:00 -0400",
  "guid": "https://news.mit.edu/2022/microparticles-oscillating-current-1013",
  "dc:creator": "Anne Trafton | MIT News Office",
  "content:encoded": "<p>Taking advantage of a phenomenon known as emergent behavior in the microscale, MIT engineers have designed simple microparticles that can collectively generate complex behavior, much the same way that a colony of ants can dig tunnels or collect food.</p>\n\n<p></p>\n\n<p>Working together, the microparticles can generate a beating clock that oscillates at a very low frequency. These oscillations can then be harnessed to power tiny robotic devices, the researchers showed.</p>\n\n<p></p>\n\n<p>“In addition to being interesting from a physics point of view, this behavior can also be translated into an on-board oscillatory electrical signal, which can be very powerful in microrobotic autonomy. There are a lot of electrical components that require such an oscillatory input,” says Jingfan Yang, a recent MIT PhD recipient and one of the lead authors of the new study.</p>\n\n<p></p>\n\n<p>The particles used to create the new oscillator perform a simple chemical reaction that allows the particles to interact with each other through the formation and bursting of tiny gas bubbles. Under the right conditions, these interactions create an oscillator that behaves similar to a ticking clock, beating at intervals of a few seconds.</p>\n\n<p></p>\n\n<p>“We're trying to look for very simple rules or features that you can encode into relatively simple microrobotic machines, to get them to collectively do very sophisticated tasks,” says Michael Strano, the Carbon P. Dubbs Professor of Chemical Engineering at MIT.</p>\n\n<p></p>\n\n<p>Strano is the senior author of the new paper, which appears today in <em>Nature Communications</em>. Along with Yang, Thomas Berrueta, a Northwestern University graduate student advised by Professor Todd Murphey, is a lead author of the study.</p>\n\n<p></p>\n\n<p><strong>Collective behavior</strong></p>\n\n<p></p>\n\n<p>Demonstrations of emergent behavior can be seen throughout the natural world, where colonies of insects such as ants and bees accomplish feats that a single member of the group would never be able to achieve.</p>\n\n<p></p>\n\n<p>“Ants have minuscule brains and they do very simple cognitive tasks, but collectively they can do amazing things. They can forage for food and build these elaborate tunnel structures,” Strano says. “Physicists and engineers like myself want to understand these rules because it means we can make tiny things that collectively do complex tasks.”</p>\n\n<p></p>\n\n<p>In this study, the researchers wanted to design particles that could generate rhythmic movements, or oscillations, with a very low frequency. Until now, building low-frequency micro-oscillators has required sophisticated electronics that are expensive and difficult to design, or specialized materials with complex chemistries.</p>\n\n<p></p>\n\n<p>The simple particles that the researchers designed for this study are discs as small as 100 microns in diameter. The discs, made from a polymer called SU-8, have a platinum patch that can catalyze the breakdown of hydrogen peroxide into water and oxygen.</p>\n\n<p></p>\n\n<p>When the particles are placed at the surface of a droplet of hydrogen peroxide on a flat surface, they tend to travel to the top of the droplet. At this liquid-air interface, they interact with any other particles found there. Each particle produces its own tiny bubble of oxygen, and when two particles come close enough that their bubbles interact, the bubbles pop, propelling the particles away from each other. Then, they begin forming new bubbles, and the cycle repeats over and over.</p>\n\n<p></p>\n\n<p>“One particle by itself stays still and doesn’t do anything interesting, but through teamwork, they can do something pretty amazing and useful, which is actually a difficult thing to achieve at the microscale,” Yang says.</p>\n<p>The researchers found that two particles could make a very reliable oscillator, but as more particles were added, the rhythm would get thrown off. However, if they added one particle that was slightly different from the others, that particle could act as a “leader” that reorganized the other particles back into a rhythmic oscillator.</p>\n\n<p></p>\n\n<p>This leader particle is the same size as the other particles but has a slightly larger platinum patch, which enables it to create a larger oxygen bubble. This allows this particle to move to the center of the group, where it coordinates the oscillations of all of the other particles. Using this approach, the researchers found they could create oscillators containing up to at least 11 particles.</p>\n\n<p></p>\n\n<p>Depending on the number of particles, this oscillator beats at a frequency of about 0.1 to 0.3 hertz, which is on the order of the low-frequency oscillators that govern biological functions such as walking and the beating of the heart.</p>\n\n<p></p>\n\n<p><strong>Oscillating current</strong></p>\n\n<p></p>\n\n<p>The researchers also showed that they could use the rhythmic beating of these particles to generate an oscillating electric current. To do that, they swapped out the platinum catalyst for a fuel cell made of platinum and ruthenium or gold. The mechanical oscillation of the particles rhythmically alters the resistance from one end of the fuel cell to the other, which converts the voltage generated by the fuel cell to an oscillating current.</p>\n\n<p></p>\n\n<p>“Like a dripping faucet, catalytic microdiscs floating at a liquid interface use a chemical reaction to drive the periodic growth and release of gas bubbles.&nbsp;The study shows how these oscillatory dynamics can be harnessed for mechanical actuation and electrochemical signaling relevant to microrobotics,” says Kyle Bishop, a professor of chemical engineering at Columbia University, who was not involved in the study.</p>\n\n<p></p>\n\n<p>Generating an oscillating current instead of a constant one could be useful for applications such as powering tiny robots that can walk. The MIT researchers used this approach to show that they could power a microactuator, which was previously used as legs on a tiny walking robot developed by researchers at Cornell University. The original version was powered by a laser that had to be alternately pointed at each set of legs, to manually oscillate the current. The MIT team showed that the on-board oscillating current generated by their particles could drive the cyclic actuation of the microrobotic leg, using a wire to transfer the current from the particles to the actuator.</p>\n\n<p></p>\n\n<p>“It shows that this mechanical oscillation can become an electrical oscillation, and then that electrical oscillation can actually power activities that a robot would do,” Strano says.</p>\n\n<p></p>\n\n<p>One possible application for this kind of system would be to control swarms of tiny autonomous robots that could be used as sensors to monitor water pollution.</p>\n\n<p></p>\n\n<p>The research was funded in part by the U.S. Army Research Office, the U.S. Department of Energy, and the National Science Foundation.</p>",
  "media:content": {
    "media:description": "MIT chemical engineers have shown that specialized particles can oscillate together, demonstrating a phenomenon known as emergent behavior.",
    "media:credit": "Image: Courtesy of the researchers"
  },
  "category": [
    "Research",
    "Chemical engineering",
    "School of Engineering",
    "Department of Energy (DoE)",
    "National Science Foundation (NSF)",
    "Nanoscience and nanotechnology",
    "Robots",
    "Robotics"
  ]
}