{
  "title": "How Can We Make Sure Autonomous Weapons Are Used Responsibly?",
  "link": "https://spectrum.ieee.org/autonomous-weapons-trust",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/abstract-illustration-of-a-light-shining-through-overlapping-rectangles-of-different-sizes.jpg?id=31988677&width=1245&height=700&coordinates=0%2C326%2C0%2C327\"/><br/><br/><p>\n<em><em>This article is part of our <a href=\"https://spectrum.ieee.org/collections/autonomous-weapons-challenges/\" target=\"_self\">Autonomous Weapons Challenges</a> series. The IEEE Standards Association is <a href=\"https://saforms.ieee.org/autonomous-weapons-participation/\" rel=\"noopener noreferrer\" target=\"_blank\">looking for your feedback</a> on this topic, and has invites you to answer <a href=\"https://saforms.ieee.org/autonomous-weapons-participation/\" rel=\"noopener noreferrer\" target=\"_blank\">these questions</a>.</em></em>\n</p><p>\n\tInternational discussions about autonomous weapons systems (AWS) often focus on a fundamental question: Is it legal for a machine to make the decision to take a human life? But woven into this question is another fundamental issue: Can an automated weapons system be trusted to do what it’s expected to do?\n</p><p>\n\tIf the technical challenges of developing and using AWS can’t be addressed, then the answer to both questions is likely “no.”\n</p><hr/><h3>AI Challenges Are Magnified When Applied to Weapons </h3><p>\n\tMany of the known issues with AI and machine learning become even more problematic when associated with weapons. For example, AI systems could help process data from images far faster than human analysts can, and the majority of the results would be accurate. But the algorithms used for this functionality are known to introduce or exacerbate issues of bias and discrimination, targeting certain demographics more than others. Given that, is it reasonable to use image-recognition software to help humans identify potential targets?\n</p><p>\n\tBut concerns about the technical abilities of AWS extend beyond object recognition and algorithmic bias. Autonomy in weapons systems requires a slew of technologies, including sensors, communications, and onboard computing power, each of which poses its own challenges for developers. These components are often designed and programmed by different organizations, and it can be hard to predict how the components will function together within the system, as well as how they’ll react to a variety of real-world situations and adversaries.\n</p><h3>Testing for Assurance and Risk</h3><p>\n\tIt’s also not at all clear how militaries can test these systems to ensure the AWS will do what’s expected and comply with International Humanitarian Law. And yet militaries typically want weapons to be tested and proven to act consistently, legally, and without harming their own soldiers before the systems are deployed. If commanders don’t trust a weapons system, they likely won’t use it. But standardized testing is especially complicated for an AI program that can learn from its interactions in the field—in fact, such standardized testing for AWS simply doesn’t exist.\n</p><p>\n\tWe know how software updates can alter how a system behaves and may introduce bugs that cause a system to behave erratically. But an automated weapons system powered by AI may also update its behavior based on real-world experience, and changes to the AWS behavior could be much harder for users to track. New information that the system accesses in the field could even trigger it to start to shift away from its original goals.\n</p><p>\n\tSimilarly, cyberattacks and adversarial attacks pose a known threat, which developers try to guard against. But if an attack is successful, what would testing look like to identify that the system has been hacked, and how would a user know to implement such tests?\n</p><h3>Physical Challenges of Autonomous Weapons</h3><p>\n\tThough recent advancements in artificial intelligence have led to greater concern about the use of AWS, the technical challenges of autonomy in weapons systems extends beyond AI. Physical challenges already exist for conventional weapons and for nonweaponized autonomous systems, but these same problems are further exacerbated and complicated in AWS.\n</p><p>\n\tFor example, many autonomous systems are getting smaller, even as their computational needs grow, including navigation, data acquisition and analysis, and decision making—and potentially all while out of communication with commanders. Can the automated weapons system maintain the necessary and legal functionality throughout the mission, even if communication is lost? How is data protected if the system falls into enemy hands?\n</p><p>\n\tIssues similar to these may also arise with other autonomous systems, but the consequences of failure are magnified with AWS, and extra features will likely be necessary to ensure that, for example, a weaponized autonomous vehicle in the battlefield doesn’t violate International Humanitarian Law or mistake a friendly vehicle for an enemy target. Because these problems are so new, weapons developers and lawmakers will need to work with and learn from experts in the robotics space to be able to solve the technical challenges and create useful policy.\n</p><p>\n\tThere are many technical advances that will contribute to various types of weapons systems. Some will prove far more difficult to develop than expected, while others will likely be developed faster. That means AWS development won’t be a leap from conventional weapons systems to full autonomy, but will instead make incremental steps as new autonomous capabilities are developed. This could lead to a slippery slope where it’s unclear if a line has been crossed from acceptable use of technology to unacceptable. Perhaps the solution is to look at specific robotic and autonomous technologies as they’re developed and ask ourselves whether society would want a weapons system with this capability, or if action should be taken to prevent that from happening.\n</p><div class=\"ieee-sidebar-large\">\n<h3>What Do You Think?</h3>\n<p>\n\tWe want your feedback! To help bring clarity to these AWS discussions, the \n\t\t<a href=\"https://standards.ieee.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Standards Association</a> convened an expert group in 2020, to consider the ethical and technical challenges of translating AWS principles into practice and what that might mean for future development and governance. Last year, the expert group published its findings in a report entitled “<a href=\"https://standards.ieee.org/wp-content/uploads/import/documents/other/ethical-technical-challenges-autonomous-weapons-systems.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">Ethical and Technical Challenges in the Development, Use, and Governance of Autonomous Weapons Systems</a>.” Many of the AWS challenges are similar to those arising in other fields that are developing autonomous systems. We expect and hope that IEEE members and readers of <em>IEEE Spectrum</em> will have insights from their own fields that can inform the discussion around AWS technologies.\n\t</p>\nWe’ve put together a \n\t<a href=\"https://saforms.ieee.org/autonomous-weapons-participation/\" rel=\"noopener noreferrer\" target=\"_blank\">series of questions</a> in <a href=\"https://standards.ieee.org/wp-content/uploads/import/documents/other/ethical-technical-challenges-autonomous-weapons-systems.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">the Challenges document</a> that we hope you’ll answer, to help us better understand how people in other fields are addressing these issues. Autonomous capabilities will increasingly be applied to weapons systems, much as they are being applied in other technical realms, and we hope that by looking at the challenges in more detail, we can help establish effective technical solutions, while contributing to discussions about what can and should be legally acceptable. Your feedback will help us move toward this ultimate goal. <a href=\"https://saforms.ieee.org/autonomous-weapons-participation/\" rel=\"noopener noreferrer\" target=\"_blank\">Public comments will be open through 7 December 2022</a>.\n</div>",
  "pubDate": "Thu, 03 Nov 2022 13:16:52 +0000",
  "guid": "https://spectrum.ieee.org/autonomous-weapons-trust",
  "category": [
    "Autonomous weapons",
    "Aws",
    "Robotics"
  ],
  "dc:creator": "Ariel Conn",
  "media:content": ""
}