{
  "title": "How US artillery dominated the Iraq military in the First Gulf War &#8211; Interview with L. Scott Lingamfelter",
  "link": "http://warscholar.org/first-gulf-war-military-history-book-desert-redlegs-university-press-of-kentucky-2020-l-scott-lingamfelter-interview/",
  "pubDate": "Mon, 06 Jul 2020 18:35:27 +0000",
  "guid": "http://warscholar.org/?p=1516",
  "comments": "http://warscholar.org/first-gulf-war-military-history-book-desert-redlegs-university-press-of-kentucky-2020-l-scott-lingamfelter-interview/#respond",
  "wfw:commentRss": "http://warscholar.org/first-gulf-war-military-history-book-desert-redlegs-university-press-of-kentucky-2020-l-scott-lingamfelter-interview/feed/",
  "slash:comments": 0,
  "category": [
    "All Iraq and Afghanistan",
    "All Modern War",
    "Army",
    "author",
    "Britain",
    "interview",
    "Modern warfare",
    "United States",
    "academic",
    "audio interviews",
    "books",
    "Modern War",
    "podcast",
    "university press of kentucky"
  ],
  "description": "How US artillery dominated the Iraq military in the First Gulf War – Interview with L. Scott Lingamfelter Check out this book here   https://amzn.to/3e5qbza Interview Timeline L. Scott Lingamfelter was a senior Artillery Officer and Middle East expert when he participated in the First Gulf War as XO of 1st ARTY. He wrote a book…",
  "enclosure": "",
  "itunes:subtitle": "How US artillery dominated the Iraq military in the First Gulf War – Interview with L. Scott Lingamfelter Check out this book here   https://amzn.to/3e5qbza Interview Timeline L. Scott Lingamfelter was a senior Artillery Officer and Middle East expert ...",
  "itunes:summary": "How US artillery dominated the Iraq military in the First Gulf War &#8211; Interview with L. Scott Lingamfelter<br />\n<a href=\"https://amzn.to/3e5qbza\">Check out this book here</a>   <a href=\"https://amzn.to/3e5qbza\">https://amzn.to/3e5qbza</a><br />\nInterview Timeline<br />\nL. Scott Lingamfelter was a senior Artillery Officer and Middle East expert when he participated in the First Gulf War as XO of 1st ARTY. He wrote a book detailing his time in that war, including tactical and operational issues, and his thoughts about the geopolitical and strategic aspects of the war. We spoke about the book and the war. Desert Redleg (University Press of Kentucky, 2020)<br />\n0:41 &#8211; Scott talks about why he wanted to write about his experiences in the First Gulf War.<br />\n1:34 &#8211; Scott talks about the start of his career in 1973 as an artillery officer and as a Middle East specialist.<br />\n3:12 &#8211; Scott talks about the use of artillery between the Vietnam War and the First Gulf War.<br />\n6:58 &#8211; Scott talks about the logistics of moving artillery into the Gulf War theater.<br />\n9:43 &#8211; Scott talks about the artillery that the division used.<br />\n12:15 &#8211; Scott talks about the obstacles they faced once they were in the Middle East.<br />\n15:23 &#8211; Scott talks about the placement of the artillery units and their protection.<br />\n18:19 &#8211; Scott talks about the size of the division and armament.<br />\n19:56 &#8211; Scott talks about counter fire.<br />\n21:32 &#8211; Scott talks about the other threats to the safety and health of the Division. He discusses unexploded and failed ordnance.<br />\n24:26 &#8211; Scott talks about the threat of chemical attack.<br />\n28:03 &#8211; Scott talks about dealing with dust and heat.<br />\n29:48 &#8211; Scott talks about instilling hygiene practices among the troops.<br />\n32:47 &#8211; Scott talks about resupply issues and the Tapline Road.<br />\n35:51 &#8211; Scott talks about the casualties on the Tapline Road.<br />\n37:29 &#8211; Scott talks about what the damage they had wrought in Iraq was like.<br />\n40:02 &#8211; Scott discusses the amount of firepower used in the First Gulf War.<br />\n44:22 &#8211; Scott discusses the combat effects of the artillery on enemy morale.<br />\n46:21 &#8211; Scott talks about the Vietnam veterans that developed the Air-Land battle concept used in the Gulf War.<br />\n47:35 &#8211; Scott talks about how he presents information in the book.<br />\n52:12 &#8211; Scott talks about coordination between foreign partners and with other services.<br />\n55:09 &#8211; Scott was surprised by the dud rate when he went back to his notes. He was also surprised at how good his diary notes were.<br />\n59:06 &#8211; Scott talks about how he expected the US to return to Iraq to fight Saddam again.<br />\n1:01:31 &#8211; Scott talks about how he almost became General Schwarzkopf&#8217;s aide-de-camp.<br />\n1:03:08 &#8211; Scott talks about how the book is written from a tactical point of view.<br />\n1:06:42 &#8211; Scott talks about getting the book written and published. He had to write some difficult things as he saw them.<br />\n1:10:11 &#8211; Scott be found at copybookwarrior.com. Readers can use the code FS30 on the University Press of Kentucky until the end of July to get 30% of the book.<br />\nLinks of interest<br />\n<a href=\"https://amzn.to/3e5qbza\">https://amzn.to/3e5qbza</a><br />\n<a href=\"https://www.kentuckypress.com/9780813179209/desert-redleg/\">https://www.kentuckypress.com/9780813179209/desert-redleg/</a><br />\n<a href=\"https://www.copybookwarrior.com/\">https://www.copybookwarrior.com</a><br />\nContact Information<br />\nFor more “Military History Inside Out” please follow me at <a href=\"http://www.warscholar.org/\">www.warscholar.org</a>, on Facebook at <a href=\"https://www.facebook.com/Warscholarorg-Military-History-News-and-Education-115795938127/\">warscholar</a>, on twitter at <a href=\"https://twitter.",
  "itunes:author": "Cris Alvarez",
  "itunes:image": "",
  "itunes:duration": "1:15:33",
  "post-id": 1516
}