{
  "itunes:episode": 76,
  "title": "Freelance To Be You and Me with Katie Lane",
  "pubDate": "Thu, 22 May 2014 15:04:24 +0000",
  "link": "http://newdisrupt.org/blog/2014/5/22/freelance-to-be-you-and-me-with-katie-lane-episode-76",
  "description": "<p>Katie Lane is an attorney who writes a blog called <a href=\"http://www.workmadeforhire.net/blog/\">Work Made for Hire</a>. She advises creative freelancers and artists on how to protect their rights and get paid fairly for their work. She recently took the plunge herself, going full-time as a self-employed person. We'll talk about what led her into this specialized career and the kinds of things that people who want to or are pursuing work on their own should consider. We take a brief, deep dive into copyright, too.</p>\n\n<h2>Sponsors & patrons</h2>\n\n<p>This podcast is made possible through the support of sponsors and patrons.</p>\n\n<p>We're sponsored this week by <a href=\"http://cardsagainsthumanity.com/\">Cards Against Humanity</a>, which just launched a site where you can buy directly from them, including their Bigger Blacker Box and their 2012 and 2013 holiday packs, the profits from which are donated to charity.</p>\n\n<p>Thanks to patrons Bryan Clark, GravityFish, and Brain Rutledge for <a href=\"http://www.patreon.com/newdisruptors\">supporting us directly through Patreon</a>! You can back this podcast for as little as $1 per month. At higher levels, we'll thank you on the air and send you mugs and T-shirts!</p>\n\n<h2>Show notes</h2>\n\n<p>The US Copyright Office <a href=\"http://www.copyright.gov/circs/circ09.pdf\">has a circular</a> that defines work-for-hire rules (PDF). Katie notes that regardless of what contract you sign, <a href=\"http://dearauthor.com/features/reclaiming-your-copyright-after-thirty-five-years/\">you can reclaim rights</a> after 35 years. It's a very specific process. This has been an <a href=\"http://variety.com/2013/biz/news/judge-rules-dc-comics-holds-rights-to-superboy-1938-superman-ads-1200387287/\">ongoing issue</a> with the rights related to early creators of well-known comics characters, like Superman.</p>\n\n<p>The phonogram right is a set of audio rights separate from copyright. I <a href=\"http://www.economist.com/blogs/babbage/2011/06/sound-recordings\">explain it at length</a> at the <em>Economist</em>. For extensive and interesting details about the duration of copyright in America, depending on what kind of thing is under discussion, when it was created or registered, and other factors, <a href=\"http://copyright.cornell.edu/resources/publicdomain.cfm\">consult this chart</a> by copyright guru Peter Hirtle at Cornell University's site.</p>\n\n<p>I <a href=\"https://medium.com/the-magazine/b6481c44c3ff\">wrote a pile of words</a> on the tax and licensing issues (in America) around crowdfunding. You can apply for and receive an Employer Identification Number (EIN) from the IRS through <a href=\"http://www.irs.gov/Businesses/Small-Businesses-&-Self-Employed/Apply-for-an-Employer-Identification-Number-%28EIN%29-Online\">a simple online process</a> -- no, I'm not kidding! It's great!</p>\n\n<p>The <a href=\"https://twitter.com/forexposure_txt\">@for_exposure</a> Twitter account is a riot, posting messages about people asking for work from others for free.</p>\n\n<p>Katie recommends taking a look at these sites:</p>\n\n<ul>\n<li><p><a href=\"https://www.zencash.com/\">Zencash</a>: Helpful best practices (and a service) for getting paid and on time.</p></li>\n<li><p><a href=\"https://www.docracy.com/\">Docracy</a>: An open-source contract site, where you can examine others' contracts and upload your own.</p></li>\n<li><p><a href=\"http://www.shakelaw.com/\">Shake</a>: It's a way to create, sign, and send legally binding agreements via an iPad or iPhone.</p></li>\n<li><p><a href=\"https://www.freelancersunion.org/contract-creator/\">Contract Creator</a>: A tool from the Freelancers Union that guides you through creating a model for most or all of what you need.</p></li>\n</ul>\n\n",
  "guid": "tag:soundcloud,2010:tracks/150692172",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "01:08:36",
  "itunes:subtitle": "Katie Lane is an attorney who writes a blog called Work Made for Hire. She advises creative freelancers and artists on how to protect their rights and get paid fairly for their work.",
  "itunes:summary": "Katie Lane is an attorney who writes a blog called Work Made for Hire. She advises creative freelancers and artists on how to protect their rights and get paid fairly for their work. She recently took the plunge herself, going full-time as a self-employed person. We'll talk about what led her into this specialized career and the kinds of things that people who want to or are pursuing work on their own should consider. We take a brief, deep dive into copyright, too."
}