{
  "title": "The Rise of the Electric Scooter",
  "description": "<!--kg-card-begin: markdown--><p>In an electric car, the (enormous) battery is <a href=\"https://www.bloomberg.com/opinion/articles/2019-04-12/electric-vehicle-battery-shrinks-and-so-does-the-total-cost\">a major part of the price</a>.  If electric car prices are decreasing, battery costs <em>must</em> be decreasing, because it's not like the cost of fabricating rubber, aluminum, glass, and steel into car shapes can decline that much, right?</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2019/09/ev-battery-costs.png\" alt=\"ev-battery-costs\" loading=\"lazy\"></p>\n<p>On an</p>",
  "link": "https://blog.codinghorror.com/the-rise-of-the-electric-scooter/",
  "guid": "5d5c700979b255003874fb4d",
  "dc:creator": "Jeff Atwood",
  "pubDate": "Thu, 12 Sep 2019 07:24:32 GMT",
  "content:encoded": "<!--kg-card-begin: markdown--><p>In an electric car, the (enormous) battery is <a href=\"https://www.bloomberg.com/opinion/articles/2019-04-12/electric-vehicle-battery-shrinks-and-so-does-the-total-cost\">a major part of the price</a>.  If electric car prices are decreasing, battery costs <em>must</em> be decreasing, because it's not like the cost of fabricating rubber, aluminum, glass, and steel into car shapes can decline that much, right?</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2019/09/ev-battery-costs.png\" alt=\"ev-battery-costs\" loading=\"lazy\"></p>\n<p>On an <em>electric scooter</em>, though, the effect of battery price has to be even more dramatic because scooters are such <a href=\"https://blog.codinghorror.com/geek-transportation-systems/\">lightweight, compact, and simple machines</a>. They aren't much more than a battery and an electric motor to begin with. Remember the <a href=\"https://www.sfgate.com/business/article/Sebastopol-s-Zap-Power-Systems-is-banking-on-3067718.php\">the Zappy electric scooter</a> from twenty years ago?</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2019/09/zappy-electric-scooter-year-2000.jpg\" alt=\"zappy-electric-scooter-year-2000\" loading=\"lazy\"></p>\n<p>What killed the electric scooter back then is the same thing that <a href=\"https://blog.codinghorror.com/electric-geek-transportation-systems/\">killed the electric car</a> of year 2000: terrible lead-acid battery technology. It's too heavy, it lacks power, it doesn't have enough range, it takes too long to charge. These are all different ways of saying the same thing: <em>the battery sucks</em>. It wasn't until Lithium Ion batteries matured that both the electric car and the electric scooter &#x2014; and pretty much electric <em>everything</em>, if you think about it &#x2014; became viable.</p>\n<p>Thus, one way to see if Lithium Ion battery prices are indeed generally dropping independent of all other manufacturing concerns is to examine the cost of electric scooters over the last few years. Let's consider one of the most popular models, the Xiaomi Mi M365:</p>\n<p><a href=\"https://camelcamelcamel.com/Xiaomi-Electric-Long-range-Fold-n-Carry-Ultra-Lightweight/product/B076KKX4BC\"><img src=\"https://blog.codinghorror.com/content/images/2019/09/xiaomi-mi-m365-price-history-2018-2019.png\" alt=\"xiaomi-mi-m365-price-history-2018-2019\" loading=\"lazy\"></a></p>\n<p>This graph only shows roughly two years, from January 2018 to now; it looks like the original price for the Xiaomi M365 when it hit the US market in early 2017 was around $800. So <strong>the price of a popular, common electric scooter has <em>halved</em> in three years.</strong> Very good news indeed for electric vehicles of all types!</p>\n<p>This dramatic drop in electric scooter price from 2016 to 2019 may not be surprising versus the parallel rise of the quasi-legal electric scooter smartphone app rental industry over roughly the same time period, in the form of Bird, Lime, Skip, Spin, Scoot, etc.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2019/09/electric-scooter-rentals-bird-lime.jpg\" alt=\"electric-scooter-rentals-bird-lime\" loading=\"lazy\"></p>\n<p>Early versions of Bird scooters were <em>actual Xiaomi M365s</em>, slightly modified for rental. Only by late 2018 had they <a href=\"https://en.wikipedia.org/wiki/Bird_(company)#Vehicles\">migrated to</a> custom built, ruggedized scooters optimized for the rental market. The rental industries <a href=\"https://www.latimes.com/business/technology/la-fi-tn-bird-scooters-money-profit-strategy-20190505-story.html\">have their own challenges</a>, and ironically have started to pivot to monthly rentals rather than the classic 15 cents per minute.</p>\n<blockquote>\n<p>Bird has experimented with its business model in recent months. In early March, the company altered its repair program in Los Angeles, which had relied on gig workers to fix broken scooters. It moved repairs in-house (though scooters are still charged each night by an army of gig workers). Later that month, the company introduced scooters with locks in some markets, in a bid to prevent theft and vandalism.</p>\n<p>In April, it announced the launch of a more traditional rental program in San Francisco and Barcelona, in which users could pay $25 per month to rent a Xiaomi m365 from the company rather than paying per ride.</p>\n</blockquote>\n<p>But this isn't meant to be a blog entry about the viability of scooter rental company business models.</p>\n<p>I want to tackle a more fundamental question: <strong>are electric scooters the future of transportation?</strong></p>\n<p>Even Uber, as screwed up of a company as they still are, knows cars are overkill for a lot of basic transportation needs:</p>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Uber believes their current micro fleet of ebikes and scooters can displace trips under 3 miles.<br><br>46% of Uber's rides are under 3 miles &#x1F440; <a href=\"https://t.co/OFmb8arZ3j\">pic.twitter.com/OFmb8arZ3j</a></p>&#x2014; Micromobility Industries (@MicromobilityCo) <a href=\"https://twitter.com/MicromobilityCo/status/1116703423108227072?ref_src=twsrc%5Etfw\">April 12, 2019</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>We have plenty of scooters here at my house, and the family and I enjoy them greatly, but I have never actually ridden or owned an electric scooter. So I bought one. It is of course the popular, inexpensive, and well reviewed <a href=\"https://www.amazon.com/dp/B076KKX4BC/?tag=codihorr-20\">Xiaomi Mi M365</a>.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2019/08/m365-scooter.jpg\" alt=\"m365-scooter\" loading=\"lazy\"></p>\n<p>Here's a picture of my electric scooter inside <a href=\"https://blog.codinghorror.com/electric-geek-transportation-systems/\">my electric car</a>. (I apologize that I didn't have an electric bicycle to park next to it for maximum smugness, but you can <em>bet your sweet electrons</em> I'll work on that next!)</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2019/09/electric-scooter-in-electric-car.jpg\" alt=\"electric-scooter-in-electric-car\" loading=\"lazy\"></p>\n<p>The short version of my review is <strong>this electric scooter is incredibly fun, works great, and if you can get it for a price around $300, practically a no-brainer.</strong> I love it, my kids love it, and as long as you're <a href=\"https://www.vox.com/technology/2018/11/2/18053650/elon-musk-electric-scooters-dignity-recode-swisher\">conceptually OK with the look, unlike Elon Musk</a> &#x1F6F4;&#x1F4A8; then you'll probably love it too.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/0JgCn8-aETA\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n<p>I found a neat video covering the \"one year later\" experience of owning the scooter, and what you might eventually run into or want to tweak.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/LyzdSktRfVI\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n<p>(The main thing to take away from this video is that flats <em>super suck</em> on tires this small, so be warned. I put Slime in my Mi's tires out of an abundance of caution, but you could also go with solid tubeless tires &#x2013; at the cost of some ride comfort &#x2013; if you're really worried.)</p>\n<p>That's not to say that the electric scooter experience is perfect. There are some challenges with electric scooters, starting with the biggest one: <a href=\"https://www.techradar.com/news/are-electric-scooters-legal-know-the-law-where-you-live\">your local government has no idea how to regulate the darn things</a>.</p>\n<ul>\n<li>Is this regulated like a bicycle? If not, why not?</li>\n<li>Are they allowed on the sidewalk?</li>\n<li>Do you have to ride them in the road, with cars &#x2026; uh, depending on the speed limit?</li>\n<li>Do you need a driver's license?</li>\n<li>Do you need a helmet?</li>\n<li>Are you even <em>allowed</em> to legally ride them in public at all outside of private property?</li>\n</ul>\n<p>The answers also vary wildly depending on where you live, and with no consistency or apparent logic. Here are <a href=\"https://bayareabicyclelaw.com/new-e-scooter-laws-2019/\">the current electric scooter laws in California</a>, for what it's worth, which <em>require the rider to have a valid driver's license</em> (unlike electric bicycles) and also disallow them from sidewalks, both of which I feel are onerous and unnecessary restrictions.</p>\n<p>One aspect of those laws I <em>definitely</em> agree with, however, is the <strong>15 mile per hour speed restriction</strong>. That's a plenty brisk top speed for a standing adult with no special safety equipment. Anything faster starts to get decidedly &#x2026; uncomfortable. Consider <a href=\"https://www.ewheels.com/product/new-turbowheel-lightning-957wh-battery-2x-1000w-3600w-motors/\">this monster of a 1165KWh electric scooter</a>, with dual motors and dual suspension that goes up to <em>forty freakin' miles per hour</em>.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/z6O7KmJQbJE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n<p>That &#x2026; is &#x2026; terrifying. Even the reviewer, in full motorcycle safety gear, wasn't willing to push it all the way to 40 MPH. And I don't blame him! But now that I've shown you the undisputed Honda Civic everyman budget model of electric scooter in the M365, hopefully this gives you a taste of the wider emerging diversity in these kinds of minimalistic electric vehicles. If you want a <a href=\"https://www.unagiscooters.com/products/the-scooter?variant=15012683448435\">luxury</a> electric scooter, an <a href=\"https://fluidfreeride.com/products/mosquito-lightweight-foldable-electric-scooter\">ultralight</a> electric scooter, a <a href=\"https://electrek.co/2019/06/10/widewheel-electric-scooter-off-road-test/\">rugged offroad</a> electric scooter &#x2026; all things are possible, for a price.</p>\n<p>Another reason the M365 is available for so cheap is that is successor, the <a href=\"https://www.mi.com/global/mi-electric-scooter-pro/\">Xiaomi M365 Pro</a>, was recently released, although it is not quite possible to obtain in the US at the moment.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/1i6g-la23HE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n<p>Having ridden my M365 a fair bit, I can confirm all the Pro improvements are welcome, if incremental: bigger battery and disc brake, more power, better display, improved latch mechanism, etc.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2019/09/xiaomi-mi-m365-vs-pro.jpg\" alt=\"xiaomi-mi-m365-vs-pro\" loading=\"lazy\"></p>\n<p>None of those Pro improvements, however, are worth a 2&#xD7; increase in price so I'd recommend sticking with the M365 for now because its value proposition is off the charts. Did I mention there's a bluetooth connection, and an app, and it is possible to <a href=\"https://www.gearbest.com/blog/how-to/how-to-install-xiaomi-m365-electric-scooter-firmware-mod-6635\">hack the M365 firmware</a>? Pretty cool how electric vehicles are inherently digital, isn't it?</p>\n<p>Here are a few other observations after riding my M365 around a fair bit:</p>\n<ul>\n<li>\n<p><strong>Please be respectful around pedestrians.</strong> Most of the sidewalks around here are not busy at all, but the pedestrians I encountered on the electric scooter were definitely more freaked out than I&#x2019;ve seen before when using regular kick scooters (or skateboards) on the sidewalk, which did surprise me. An electric scooter has more heft to it, both physically at 26 pounds, and in the 15 mile per hour speed it can reach &#x2013; but also mentally in terms of how it looks and how people approach it. I recommend slowing down to just above walking speed when encountering pedestrians, and if there is a bike lane available, I'd definitely recommend using that.</p>\n</li>\n<li>\n<p><strong>Hills work great.</strong> The kryptonite of traditional kick scooters is hills, and I'm pleased to report that even with a <small>cough</small> sizable adult such as myself riding, I was able to sustain a respectable above-walking speed on most <em>reasonable</em> hills. Where I looked at a hill and thought \"this probably should work\", it did. That's impressive, considering this <em>isn't</em> the upgraded Pro model with bigger battery and more powerful motor. On flats and downhills the performance is superb, as you'd expect. That said, if you are a really big or tall adult, or live in a particularly hilly area, wait for the Pro model or an equivalent.</p>\n</li>\n<li>\n<p><strong>Portability is good, but borderline.</strong> At ~26 pounds, the electric scooter is reasonably portable, but it's not something you a) could really get away with taking inside a restaurant / store with you to prevent theft or b) want to be carrying around on your person for any significant length of time. It's not nearly as nimble or portable as a kick scooter, but that's a high bar. You'll need to carry a bike lock and think about how to lock your scooter on bike racks, which turned out to be &#x2026; more geometrically challenging than I anticipated due to the small tires, disc brakes, and the engine in the front wheel. They need more obvious locking points on the chassis.</p>\n</li>\n</ul>\n<p>To be honest with you I'm still bitter about the whole <a href=\"https://en.wikipedia.org/wiki/Segway_Inc.\">Segway</a> debacle. There was so much hype back in the day. That ridiculous thing was <a href=\"https://www.wired.com/2009/12/1203segway-unveiled/\">supposed to change the world</a>. Instead, we got &#x2026; <em>Paul Blart Mall Cop</em>.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2019/09/paul-blart-segway.jpeg\" alt=\"paul-blart-segway\" loading=\"lazy\"></p>\n<p>A Segway was $5,000 at launch in 2001, which is a whopping $7,248 in inflation adjusted dollars. Here in 2019, cheap $200 to $300 electric scooters are basically the transformational technology the Segway was <em>supposed</em> to be, aren't they? Are electric scooters the future of (most) transportation? I'm not sure, but I do like where we're headed, even if it took us twenty years to get there.</p>\n<!--kg-card-end: markdown-->"
}