{
  "title": "Episode 155: &#8220;Waterloo Sunset&#8221; by the Kinks",
  "link": "https://500songs.com/podcast/episode-155-waterloo-sunset-by-the-kinks/",
  "pubDate": "Tue, 11 Oct 2022 08:13:47 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=1385",
  "description": "<p>Episode one hundred and fifty-five of&nbsp;<em>A History of Rock Music in Five Hundred Songs</em>&nbsp;looks at “Waterloo Sunset” by the Kinks, and the self-inflicted damage the group did to their career between 1965 and 1967. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n\n\n\n<p>Patreon backers also have a nineteen-minute bonus episode available, on<a href=\"https://www.patreon.com/posts/73156702\"> \"Excerpt From a Teenage Opera\" by Keith West</a>.</p>\n\n\n\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n\n\n\n\n<p><strong>Resources</strong></p>\n\n\n\n<p>No Mixcloud this week, as there are too many Kinks songs.</p>\n\n\n\n<p>I’ve used several resources for this and future episodes on the Kinks, most notably<a href=\"https://amzn.to/3cOfO5z\">&nbsp;<em>Ray Davies: A Complicated Life</em></a>&nbsp;by Johnny Rogan and&nbsp;<a href=\"https://amzn.to/3uqKMqA\"><em>You Really Got Me&nbsp;</em></a>by Nick Hasted.</p>\n\n\n\n<p><a href=\"https://amzn.to/2PBB1qE\"><em>X-Ray</em>&nbsp;by Ray Davies</a>&nbsp;is a remarkable autobiography with a framing story set in a dystopian science-fiction future, while&nbsp;<a href=\"https://amzn.to/3mnnHlD\"><em>Kink</em>&nbsp;by Dave Davies&nbsp;</a>is more revealing but less well-written.</p>\n\n\n\n<p><a href=\"https://amzn.to/3sTNeFD\"><em>The Anthology 1964-1971</em>&nbsp;</a>is a great box set that covers the Kinks’ Pye years, which overlap almost exactly with their period of greatest creativity. For those who don’t want a full box set,&nbsp;<a href=\"https://amzn.to/3mnylZI\">this two-CD set&nbsp;</a>covers all the big hits.</p>\n\n\n\n<p>And <a href=\"https://jennyartichoke.wordpress.com/2016/04/26/rasa-didzpetris/\">this</a> is the interview with Rasa I discuss in the episode.</p>\n\n\n\n<p><strong>Patreon</strong></p>\n\n\n\n<p>This podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?</p>\n\n\n\n<p><strong>Transcript</strong></p>\n\n\n\n<p>Before I start, this episode has some mentions of racism and homophobia, several discussions of physical violence, one mention of domestic violence, and some discussion of mental illness. I've tried to discuss these things with a reasonable amount of sensitivity, but there's a tabloid element to some of my sources which inevitably percolates through, so be warned if you find those things upsetting.&nbsp;</p>\n\n\n\n<p>One of the promises I made right at the start of this project was that I would not be doing the thing that almost all podcasts do of making huge chunks of the episodes be about myself -- if I've had to update people about something in my life that affects the podcast, I've done it in separate admin episodes, so the episodes themselves will not be taken up with stuff about me. The podcast is not about me.</p>\n\n\n\n<p>I am making a very slight exception in this episode, for reasons that will become clear -- there's no way for me to tell this particular story the way I need to without bringing myself into it at least a little. So I wanted to state upfront that this is a one-off thing. The podcast is not suddenly going to change.&nbsp;</p>\n\n\n\n<p>But one question that I get asked a lot -- far more than I'd expect -- is \"do the people you talk about in the podcast ever get in touch with you about what you've said?\"</p>\n\n\n\n<p>Now that has actually happened twice, both times involving people leaving comments on relatively early episodes. The first time is probably the single thing I'm proudest of achieving with this series, and it was a comment left on the episode on \"Goodnight My Love\" a couple of years back:</p>\n\n\n\n<p>[Excerpt: Jesse Belvin, \"Goodnight My Love\"]</p>\n\n\n\n<p>That comment was from Debra Frazier and read “Jesse Belvin is my Beloved Uncle, my mother’s brother. I’ve been waiting all my life for him to be recognized in this manner. I must say the content in this podcast is 100% correct!Joann and Jesse practically raised me. Can’t express how grateful I am. Just so glad someone got it right. I still miss them dearly to this day. My world was forever changed Feb. 6th 1960. I can remember him writing most of those songs right there in my grandmother’s living room. I think I’m his last living closest relative, that knows everything in this podcast is true.\"</p>\n\n\n\n<p>That comment by itself would have justified me doing this whole podcast.</p>\n\n\n\n<p>The other such comment actually came a couple of weeks ago, and was on the episode on \"Only You\":</p>\n\n\n\n<p>[Excerpt: The Platters, \"Only You\"]</p>\n\n\n\n<p>That was a longer comment, from Gayle Schrieber, an associate of Buck Ram, and started \"Well, you got some of it right. Your smart-assed sarcasm and know-it-all attitude is irritating since I Do know it all from the business side but what the heck. You did better than most people – with the exception of Marv Goldberg.\"</p>\n\n\n\n<p>Given that Marv Goldberg is the single biggest expert on 1950s vocal groups in the world, I'll take that as at least a backhanded compliment.</p>\n\n\n\n<p>So those are the only two people who I've talked about in the podcast who've commented, but before the podcast I had a blog, and at various times people whose work I wrote about would comment -- John Cowsill of the Cowsills still remembers a blog post where I said nice things about him fourteen years ago, for example.</p>\n\n\n\n<p>And there was one comment on a blog post I made four or five years ago which confirmed something I'd suspected for a while…</p>\n\n\n\n<p>When we left the Kinks, at the end of 1964, they had just recorded their first album. That album was not very good, but did go to number three in the UK album charts, which is a much better result than it sounds. Freddie \"Boom Boom\" Cannon got to number one in 1960, but otherwise the only rock acts to make number one on the album charts from the start of the sixties through the end of 1967 were Elvis, Cliff Richard, the Shadows, the Beatles, the Rolling Stones, Bob Dylan and the Monkees.&nbsp;</p>\n\n\n\n<p>In the first few years of the sixties they were interspersed with the 101 Strings, trad jazz, the soundtrack to West Side Story, and a blackface minstrel group, The George Mitchell Singers. From mid-1963 through to the end of 1967, though, literally the <em>only</em> things to get to number one on the album charts were the Beatles, the Rolling Stones, Bob Dylan, the Monkees, and the soundtrack to The Sound of Music. That tiny cabal was eventually broken at the end of 1967 by Val Doonican Rocks… But Gently, and from 1968 on the top of the album charts becomes something like what we would expect today, with a whole variety of different acts,&nbsp;</p>\n\n\n\n<p>I make this point to point out two things The first is that number three on the album charts is an <em>extremely</em> good position for the Kinks to be in -- when they reached that point the Rolling Stones' second album had just entered at number one, and Beatles For Sale had dropped to number two after eight weeks at the top -- and the second is that for most rock artists and record labels, the album market was simply not big enough or competitive enough until 1968 for it to really matter.</p>\n\n\n\n<p>What did matter was the singles chart. And \"You Really Got Me\" had been a genuinely revolutionary hit record. According to Ray Davies it had caused particular consternation to both the Rolling Stones and the Yardbirds, both of whom had thought they would be the first to get to number one with a dirty, distorted, R&B-influenced guitar-riff song.&nbsp;</p>\n\n\n\n<p>And so three weeks after the release of the album came the group's second single. Originally, the plan had been to release a track Ray had been working on called \"Tired of Waiting\", but that was a slower track, and it was decided that the best thing to do would be to try to replicate the sound of their first hit. So instead, they released \"All Day And All Of The Night\":</p>\n\n\n\n<p>[Excerpt: The Kinks, \"All Day And All Of The Night\"]</p>\n\n\n\n<p>That track was recorded by the same team as had recorded \"You Really Got Me\", except with Perry Ford replacing Arthur Greenslade on piano. Once again, Bobby Graham was on drums rather than Mick Avory, and when Ray Davies suggested that he might want to play a different drum pattern, Graham just asked him witheringly \"Who do you think you are?\"</p>\n\n\n\n<p>\"All Day and All of the Night\" went to number two -- a very impressive result for a soundalike follow-up -- and was kept off the number one spot first by \"Baby Love\" by the Supremes and then by \"Little Red Rooster\" by the Rolling Stones. The group quickly followed it up with an EP, Kinksize Session, consisting of three mediocre originals plus the group's version of \"Louie Louie\". By February 1965 that had hit number one on the EP charts, knocking the Rolling Stones off.</p>\n\n\n\n<p>Things were going as well as possible for the group. Ray and his girlfriend Rasa got married towards the end of 1964 -- they had to, as Rasa was pregnant and from a very religious Catholic family. By contrast, Dave was leading the kind of life that can only really be led by a seventeen-year-old pop star -- he moved out of the family home and in with Mick Avory after his mother caught him in bed with five women, and once out of her watchful gaze he also started having affairs with men, which was still illegal in 1964. (And which indeed would still be illegal for seventeen-year-olds until 2001).</p>\n\n\n\n<p>In January, they released their third hit single, \"Tired of Waiting for You\". The track was a ballad rather than a rocker, but still essentially another variant on the theme of \"You Really Got Me\" -- a song based around a few repeated phrases of lyric, and with a chorus with two major chords a tone apart. \"You Really Got Me\"'s chorus has the change going up:</p>\n\n\n\n<p>[Plays \"You Really Got Me\" chorus chords]</p>\n\n\n\n<p>While \"Tired Of Waiting For You\"'s chorus has the change going down:</p>\n\n\n\n<p>[Plays \"Tired of Waiting For You\" chorus chords]</p>\n\n\n\n<p>But it's trivially easy to switch between the two if you play them in the same key:</p>\n\n\n\n<p>[Demonstrates]</p>\n\n\n\n<p>Ray has talked about how \"Tired of Waiting for You\" was partly inspired by how he felt tired of waiting for the fame that the Kinks deserved, and the music was written even before \"You Really Got Me\". But when they went into the studio to record it, the only lyrics he had were the chorus. Once they'd recorded the backing track, he worked on the lyrics at home, before coming back into the studio to record his vocals, with Rasa adding backing vocals on the softer middle eight:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Tired of Waiting For You\"]</p>\n\n\n\n<p>After that track was recorded, the group went on a tour of Australia, New Zealand, and Hong Kong. The flight out to Australia was thirty-four hours, and also required a number of stops. One stop to refuel in Moscow saw the group forced back onto the plane at gunpoint after Pete Quaife unwisely made a joke about the recently-deposed Russian Premier Nikita Khruschev. They also had a stop of a couple of days in Mumbai, where Ray was woken up by the sounds of fishermen chanting at the riverside, and enchanted by both the sound and the image.</p>\n\n\n\n<p>In Adelaide, Ray and Dave met up for the first time in years with their sister Rose and her husband Arthur. Ray was impressed by their comparative wealth, but disliked the slick modernity of their new suburban home. Dave became&nbsp; so emotional about seeing his big sister again that he talked about not leaving her house, not going to the show that night, and just staying in Australia so they could all be a family again. Rose sadly told him that he knew he couldn't do that, and he eventually agreed.</p>\n\n\n\n<p>But the tour wasn't all touching family reunions. They also got into a friendly rivalry with Manfred Mann, who were also on the tour and were competing with the Kinks to be the third-biggest group in the UK behind the Beatles and the Stones, and at one point both bands ended up on the same floor of the same hotel as the Stones, who were on their own Australian tour. The hotel manager came up in the night after a complaint about the noise, saw the damage that the combined partying of the three groups had caused, and barricaded them into that floor, locking the doors and the lift shafts, so that the damage could be contained to one floor.</p>\n\n\n\n<p>\"Tired of Waiting\" hit number one in the UK while the group were on tour, and it also became their biggest hit in the US, reaching number six, so on the way home they stopped off in the US for a quick promotional appearance on Hullabaloo. According to Ray's accounts, they were asked to do a dance like Freddie and the Dreamers, he and Mick decided to waltz together instead, and the cameras cut away horrified at the implied homosexuality.</p>\n\n\n\n<p>In fact, examining the footage shows the cameras staying on the group as Mick approaches Ray, arms extended, apparently offering to waltz, while Ray backs off nervous and confused, unsure what's going on. Meanwhile Dave and Pete on the other side of the stage are being gloriously camp with their arms around each other's shoulders.&nbsp;</p>\n\n\n\n<p>When they finally got back to the UK, they were shocked to hear this on the radio:</p>\n\n\n\n<p>[Excerpt: The Who, \"I Can't Explain\"]</p>\n\n\n\n<p>Ray was horrified that someone had apparently stolen the group's sound, especially when he found out it was the Who, who as the High Numbers had had a bit of a rivalry with the group. He said later \"Dave thought it was us! It was produced by Shel Talmy, like we were. They used the same session singers as us, and Perry Ford played piano, like he did on ‘All Day And All Of The Night’. I felt a bit appalled by that. I think that was worse than stealing a song – they were actually stealing our whole style!”</p>\n\n\n\n<p>Pete Townshend later admitted as much, saying that he had deliberately demoed \"I Can't Explain\" to sound as much like the Kinks as possible so that Talmy would see its potential.</p>\n\n\n\n<p>But the Kinks were still, for the moment, doing far better than the Who. In March, shortly after returning from their foreign tour, they released their second album, Kinda Kinks. Like their first album, it was a very patchy effort, but it made number two on the charts, behind the Rolling Stones.</p>\n\n\n\n<p>But Ray Davies was starting to get unhappy. He was dissatisfied with everything about his life. He would talk later about looking at his wife lying in bed sleeping and thinking \"What's she doing here?\", and he was increasingly wondering if the celebrity pop star life was right for him, simultaneously resenting and craving the limelight, and doing things like phoning the music papers to deny rumours that he was leaving the Kinks -- rumours which didn't exist until he made those phone calls.</p>\n\n\n\n<p>As he thought the Who had stolen the Kinks' style, Ray decided to go in a different direction for the next Kinks single, and recorded \"Everybody's Gonna Be Happy\", which was apparently intended to sound like Motown, though to my ears it bears no resemblance:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Everybody's Gonna Be Happy\"]</p>\n\n\n\n<p>That only went to&nbsp; number nineteen -- still a hit, but a worry for a band who had had three massive hits in a row. Several of the band started to worry seriously that they were going to end up with no career at all.</p>\n\n\n\n<p>It didn't help that on the tour after recording that, Ray came down with pneumonia. Then Dave came down with bronchitis. Then Pete Quaife hit his head&nbsp; and had to be hospitalised with severe bleeding and concussion. According to Quaife, he fainted in a public toilet and hit his head on the bowl on the way down, but other band members have suggested that Quaife -- who had a reputation for telling tall stories, even in a band whose members are all known for rewriting history -- was ashamed after getting into a fight.</p>\n\n\n\n<p>In April they played the NME Poll-Winners' Party, on the same bill as the Beatles, the Rolling Stones, the Animals, the Moody Blues, the Searchers, Freddie And The Dreamers, Herman’s Hermits, Wayne Fontana & The Mindbenders, the Rockin’ Berries, the Seekers, the Ivy League, Them, the Bachelors, Georgie Fame & The Blue Flames, Cilla Black, Dusty Springfield, Twinkle, Tom Jones, Donovan, and Sounds Incorporated.&nbsp;</p>\n\n\n\n<p>Because they got there late they ended up headlining, going on <em>after</em> the Beatles, even though they hadn't won an award,&nbsp; only come second in best new group, coming far behind the Stones but just ahead of Manfred Mann and the Animals.</p>\n\n\n\n<p>The next single, \"Set Me Free\", was a conscious attempt to correct course after \"Everybody's Gonna Be Happy\" had been less successful:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Set Me Free\"]</p>\n\n\n\n<p>The song is once again repetitive, and once again based on a riff, structured similarly to \"Tired of Waiting\" but faster and more upbeat, and with a Beatles-style falsetto in the chorus. It worked -- it returned the group to the top ten -- but Ray wasn't happy at writing to order. He said in August of that year “I’m ashamed of that song. I can stand to hear and even sing most of the songs I’ve written, but not that one. It’s built around pure idiot harmonies that have been used in a thousand songs.”&nbsp;</p>\n\n\n\n<p>More recently he's talked about how the lyric was an expression of him wanting to be set free from the constraint of having to write a hit song in the style he felt he was outgrowing.</p>\n\n\n\n<p>By the time the single was released, though, it looked like the group might not even be together any longer.</p>\n\n\n\n<p>There had always been tensions in the band. Ray and Dave had a relationship that made the Everly Brothers look like the model of family amity, and while Pete Quaife stayed out of the arguments for the most part, Mick Avory couldn't. The core of the group had always been the Davies brothers, and Quaife had known them for years, but Avory was a relative newcomer and hadn't grown up with them, and they also regarded him as a bit less intelligent than the rest of the group. He became the butt of jokes on a fairly constant basis.&nbsp;</p>\n\n\n\n<p>That would have been OK, except that Avory was also an essentially passive person, who didn't want to take sides in conflicts, while Dave Davies thought that as he and Avory were flatmates they should be on the same side, and resented when Avory didn't take his side in arguments with Ray.</p>\n\n\n\n<p>As Dave remembered it, the trigger came when he wanted to change the setlist and Mick didn't support him against Ray. In others' recollection, it came when the rest of the band tried to get Dave away from a party and he got violent with them. Both may be true. Either way, Dave got drunk and threw a suitcase at the back of a departing Mick, who was normally a fairly placid person but had <em>had enough</em>, and so he turned round, furious, grabbed Dave, got him in a headlock and just started punching, blackening both his eyes.</p>\n\n\n\n<p>According to some reports, Avory was so infuriated with Dave that he knocked him out, and Dave was so drunk and angry that when he came to he went for Avory again, and got knocked out again.</p>\n\n\n\n<p>The next day, the group were driven to their show in separate cars -- the Davies brothers in one, the rhythm section in the other -- they had separate dressing rooms, and made their entrance from separate directions.&nbsp;</p>\n\n\n\n<p>They got through the first song OK, and then Dave Davies insulted Avory's drumming, spat at him, and kicked his drums so they scattered all over the stage. At this point, a lot of the audience were still thinking this was part of the act, but Avory saw red again and picked up his hi-hat cymbal and smashed it down edge-first onto Dave's head.</p>\n\n\n\n<p>Everyone involved says that if his aim had been very slightly different he would have actually killed Dave. As it is, Dave collapsed, unconscious, bleeding everywhere. Ray screamed \"My brother! He's killed my little brother!\" and Mick, convinced he was a murderer, ran out of the theatre, still wearing his stage outfit of a hunting jacket and frilly shirt. He was running away for his life -- and that was literal, as Britain still technically had the death penalty at this point; while the last executions in Britain took place in 1964, capital punishment for murder wasn't abolished until late 1965 --&nbsp; but at the same time a gang of screaming girls outside who didn't know what was going on were chasing him because he was a pop star.&nbsp;</p>\n\n\n\n<p>He managed to get back to London, where he found that the police had been looking for him but that Dave was alive and didn't want to press charges. However, he obviously couldn't go back to their shared home, and they had to cancel gigs because Dave had been hospitalised. It looked like the group were finished for good.</p>\n\n\n\n<p>Four days after that, Ray and Rasa's daughter Louisa was born, and shortly after that Ray was in the studio again, recording demos:</p>\n\n\n\n<p>[Excerpt: Ray Davies, \"I Go to Sleep (demo)\"]</p>\n\n\n\n<p>That song was part of a project that Larry Page, the group's co-manager, and Eddie Kassner, their publisher, had of making Ray's songwriting a bigger income source, and getting his songs recorded by other artists. Ray had been asked to write it for Peggy Lee, who soon recorded her own version:</p>\n\n\n\n<p>[Excerpt: Peggy Lee, \"I Go to Sleep\"]</p>\n\n\n\n<p>Several of the other tracks on that demo session featured Mitch Mitchell on drums. At the time, Mitchell was playing with another band that Page managed, and there seems to have been some thought of him possibly replacing Avory in the group.</p>\n\n\n\n<p>But instead, Larry Page cut the Gordian knot. He invited each band member to a meeting, just the two of them -- and didn't tell them that he'd scheduled all these meetings at the same time. When they got there, they found that they'd been tricked into having a full band meeting, at which point Page just talked to them about arrangements for their forthcoming American tour, and didn't let them get a word in until he'd finished. At the end he asked if they had any questions, and Mick Avory said he'd need some new cymbals because he'd broken his old ones on Dave's head.</p>\n\n\n\n<p>Before going on tour, the group recorded a song that Ray had written inspired by that droning chanting he'd heard in Mumbai. The song was variously titled \"See My Friend\" and \"See My Friends\" -- it has been released under both titles, and Ray seems to sing both words at different times -- and Ray told Maureen Cleave \"The song is about homosexuality… It’s like a football team and the way they’re always kissing each other.”</p>\n\n\n\n<p>(We will be talking about Ray Davies' attitudes towards sexuality and gender in a future episode, but suffice to say that like much of Davies' worldview, he has a weird mixture of very progressive and very reactionary views, and he is also prone to observe behaviours in other people's private lives and make them part of his own public persona).</p>\n\n\n\n<p>The guitar part was recorded on a bad twelve-string guitar that fed back in the studio, creating a drone sound, which Shel Talmy picked up on and heavily compressed, creating a sound that bore more than a little resemblance to a sitar:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"See My Friend\"]</p>\n\n\n\n<p>If that had been released at the time, it would have made the Kinks into trend-setters. Instead it was left in the can for nearly three months, and in the meantime the Yardbirds released the similar-sounding \"Heart Full of Soul\", making the Kinks look like bandwagon-jumpers when their own record came out, and reinforcing a paranoid belief that Ray had started to develop that his competitors were stealing his ideas.</p>\n\n\n\n<p>The track taking so long to come out was down to repercussions from the group's American tour, which changed the course of their whole career in ways they could not possibly have predicted.</p>\n\n\n\n<p>This was still the era when the musicians' unions of the US and UK had a restrictive one-in, one-out policy for musicians, and you couldn't get a visa to play in the US without the musicians' union's agreement -- and the AFM were not very keen on the British invasion, which they saw as taking jobs away from their members. There are countless stories from this period of bands like the Moody Blues getting to the US only to find that the arrangements have fallen through and they can't perform. Around this time, Wayne Fontana and the Mindbenders were told they weren't notable enough to get permission to play more than one gig, even though they were at number one on the charts in the US at the time.</p>\n\n\n\n<p>So it took a great deal of effort to get the Kinks' first US tour arranged, and they had to make a good impression. Unfortunately, while the Beatles and Stones knew how to play the game and give irreverent, cheeky answers that still left the interviewers amused and satisfied, the Kinks were just flat-out confusing and rude:</p>\n\n\n\n<p>[Excerpt: The Kinks Interview with Clay Cole]</p>\n\n\n\n<p>The whole tour went badly. They were booked into unsuitable venues, and there were a series of events like the group being booked on the same bill as the Dave Clark Five, and both groups having in their contract that they would be the headliner. Promoters started to complain about them to their management and the unions, and Ray was behaving worse and worse.</p>\n\n\n\n<p>By the time the tour hit LA, Ray was being truly obnoxious. According to Larry Page he refused to play one TV show because there was a Black drummer on the same show. Page said that it was not about personal prejudice -- though it's hard to see how it could not be, at least in part -- but just picking something arbitrary to complain about to show he had the power to mess things up.</p>\n\n\n\n<p>While shooting a spot for the show Where The Action Is, Ray got into a physical fight with one of the other cast members over nothing. What Ray didn't realise was that the person in question was a representative for AFTRA, the screen performers' union, and was already unhappy because Dave had earlier refused to join the union. Their behaviour got reported up the chain.</p>\n\n\n\n<p>The day after the fight was supposed to be the highlight of the tour, but Ray was missing his wife. In the mid-sixties, the Beach Boys would put on a big Summer Spectacular at the Hollywood Bowl every year, and the Kinks were due to play it, on a bill which as well as the Beach Boys also featured the Byrds, the Righteous Brothers, Dino, Desi & Billy, and Sonny and Cher. But Ray said he wasn't going on unless Rasa was there.</p>\n\n\n\n<p>And he didn't tell Larry Page, who was there, that. Instead, he told a journalist at the Daily Mirror in London, and the first Page heard about it was when the journalist phoned him to confirm that Ray wouldn't be playing. Now, they had already been working to try to get Rasa there for the show, because Ray had been complaining for a while. But Rasa didn't have a passport. Not only that, but she was an immigrant and her family were from Lithuania, and the US State Department weren't exactly keen on people from the Eastern Bloc flying to the US. And it was a <em>long</em> flight. I don't know exactly how long a flight from London to LA took then, but it takes eleven and a half hours now, and it will have been around that length.</p>\n\n\n\n<p>Somehow, working a miracle, Larry Page co-ordinated with his co-managers Robert Wace and Grenville Collins back in London -- difficult in itself as Wace and Collins and Page and his business partner Eddie Kassner were by now in two different factions, because Ray had been manipulating them and playing them off against each other for months. But the three of them worked together and somehow got Rasa to LA in time for Ray to go on stage. Page waited around long enough to see that Ray had got on stage at the Hollywood Bowl, then flew back to London. He had had enough of Ray's nonsense, and didn't really see any need to be there anyway, because they had a road manager, their publisher, their agent, and plenty of support staff. He felt that he was only there to be someone for Ray Davies to annoy and take his frustrations out on.</p>\n\n\n\n<p>And indeed, once Page flew back to the UK, Ray calmed down, though how much of that was the presence of Rasa it's hard to say. Their road manager at the time though said \"If Larry wasn’t there, Ray couldn’t make problems because there was nobody there to make them to. He couldn’t make problems for me because I just ignored them. For example, in Hawaii, the shirts got stolen. Ray said, ‘No way am I going onstage without my shirt.’ So I turned around and said to him, ‘Great, don’t go on!’ Of course, they went on.”</p>\n\n\n\n<p>They did miss the gig the next night in San Francisco, with more or less the same lineup as the Hollywood Bowl show -- they'd had problems with the promoter of that show at an earlier gig in Reno, and so Ray said they weren't going to play unless they got paid in cash upfront. When the promoter refused, the group just walked on stage, waved, and walked off. But other than that, the rest of the tour went OK.</p>\n\n\n\n<p>What they didn't realise until later was that they had made so many enemies on that tour that it would be impossible for them to return to the US for another four years. They weren't blacklisted, as such, they just didn't get the special treatment that was necessary to make it possible for them to visit there. From that point on they would still have a few hits in the US, but nothing like the sustained massive success they had in the UK in the same period.</p>\n\n\n\n<p>Ray felt abandoned by Page, and started to side more and more with Wace and Collins. Page though was still trying to promote Ray's songwriting. Some of this, like the album \"Kinky Music\" by the Larry Page Orchestra, released during the tour, was possibly not the kind of promotion that anyone wanted, though some of it has a certain kitsch charm:</p>\n\n\n\n<p>[Excerpt: The Larry Page Orchestra, \"All Day And All Of The Night\"]</p>\n\n\n\n<p>Incidentally, the guitarist on that album was Jimmy Page, who had previously played rhythm guitar on a few Kinks album tracks.</p>\n\n\n\n<p>But other stuff that Larry Page was doing would be genuinely helpful. For example, on the tour he had become friendly with Stone and Greene, the managers who we heard about in the Buffalo Springfield episode. At this point they were managing Sonny and Cher, and when they came over to the UK, Page took the opportunity to get Cher into the studio to cut a version of Ray's \"I Go to Sleep\":</p>\n\n\n\n<p>[Excerpt: Cher, \"I Go to Sleep\"]</p>\n\n\n\n<p>Most songwriters, when told that the biggest new star of the year was cutting a cover version of one of their tracks for her next album, would be delighted. Ray Davies, on the other hand, went to the session and confronted Page, screaming about how Page was stealing his ideas.</p>\n\n\n\n<p>And it was Page being marginalised that caused \"See My Friend\" to be delayed, because while they were in the US, Page had produced the group in Gold Star Studios, recording a version of Ray's song \"Ring the Bells\", and Page wanted that as the next single, but the group had a contract with Shel Talmy which said he would be their producer. They couldn't release anything Talmy hadn't produced, but Page, who had control over the group's publishing with his business partner Kassner, wouldn't let them release \"See My Friend\". Eventually, Talmy won out, and \"See My Friend\" became the group's next single.</p>\n\n\n\n<p>It made the top ten on the Record Retailer chart, the one that's now the official UK chart cited in most sources, but only number fifteen on the NME chart which more people paid attention to at the time, and only spent a few weeks on the charts. Ray spent the summer complaining in the music papers about how the track -- \"the only one I've really liked\", as he said at the time -- wasn't selling as much as it deserved, and also insulting Larry Page and boasting about his own abilities, saying he was a better singer than Andy Williams and Tony Bennett.</p>\n\n\n\n<p>The group sacked Larry Page as their co-manager, and legal battles between Page and Kassner on one side and Collins and Wace on the other would continue for years, tying up much of the group's money. Page went on to produce a new band he was managing, making records that sounded very like the Kinks' early hits:</p>\n\n\n\n<p>[Excerpt: The Troggs, \"Wild Thing\"]</p>\n\n\n\n<p>The Kinks, meanwhile, decided to go in a different direction for their new EP, Kwyet Kinks, an EP of mostly softer, folk- and country-inspired songs. The most interesting thing on Kwyet Kinks was \"Well-Respected Man\", which saw Ray's songwriting go in a completely different direction as he started to write gentle social satires with more complex lyrics, rather than the repetitive riff-based songs he'd been doing before. That track was released as a single in the US, which didn't have much of an EP market, and made the top twenty there, despite its use of a word that in England at the time had a double meaning -- either a cigarette or a younger boy at a public school who has to be the servant of an older boy -- but in America was only used as a slur for gay people:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Well Respected Man\"]</p>\n\n\n\n<p>The group's next album, The Kink Kontroversy, was mostly written in a single week, and is another quickie knockoff album. It had the hit single \"Til the End of the Day\", another attempt at getting back to their old style of riffy rockers, and one which made the top ten. It also had a rerecorded version of \"Ring the Bells\", the song Larry Page had wanted to release as a single:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Ring the Bells\"]</p>\n\n\n\n<p>I'm sure that when Ray Davies heard \"Ruby Tuesday\" a little over a year later he didn't feel any better about the possibility that people were stealing his ideas.</p>\n\n\n\n<p>The Kink Kontroversy was a transitional album for the group in many ways. It was the first album to prominently feature Nicky Hopkins, who would be an integral part of the band's sound for the next three years, and the last one to feature a session drummer (Clem Cattini, rather than Avory, played on most of the tracks). From this point on there would essentially be a six-person group of studio Kinks who would make the records -- the four Kinks themselves, Rasa Davies on backing vocals, and Nicky Hopkins on piano.</p>\n\n\n\n<p>At the end of 1965 the group were flailing, mired in lawsuits, and had gone from being the third biggest group in the country at the start of the year to maybe the tenth or twentieth by the end of it. Something had to change.</p>\n\n\n\n<p>And it did with the group's next single, which in both its sound and its satirical subject matter was very much a return to the style of \"Well Respected Man\". \"Dedicated Follower of Fashion\" was inspired by anger. Ray was never a particularly sociable person, and he was not the kind to do the rounds of all the fashionable clubs like the other pop stars, including his brother, would. But he did feel a need to make some kind of effort and would occasionally host parties at his home for members of the fashionable set.</p>\n\n\n\n<p>But Davies didn't keep up with fashion the way they did, and some of them would mock him for the way he dressed. At one such party he got into a fistfight with someone who was making fun of his slightly flared trousers, kicked all the guests out, and then went to a typewriter and banged out a lyric mocking the guest and everyone like him:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Dedicated Follower of Fashion\"]</p>\n\n\n\n<p>The song wasn't popular with Ray's bandmates -- Dave thought it was too soft and wimpy, while Quaife got annoyed at the time Ray spent in the studio trying to make the opening guitar part sound a bit like a ukulele. But they couldn't argue with the results -- it went to number five on the charts, their biggest success since \"Tired of Waiting for You\" more than a year earlier, and more importantly in some ways it became part of the culture in a way their more recent singles hadn't. \"Til The End of the Day\" had made the top ten, but it wasn't a record that stuck in people's minds. But \"Dedicated Follower of Fashion\" was so popular that Ray soon got sick of people coming up to him in the street and singing \"Oh yes he is!\" at him.</p>\n\n\n\n<p>But then, Ray was getting sick of everything. In early 1966 he had a full-scale breakdown, brought on by the flu but really just down to pure exhaustion. Friends from this time say that Ray was an introverted control freak, always neurotic and trying to get control and success, but sabotaging it as soon as he attained it so that he didn't have to deal with the public.</p>\n\n\n\n<p>&nbsp;Just before a tour of Belgium, Rasa gave him an ultimatum -- either he sought medical help or she would leave him. He picked up their phone and slammed it into her face, blacking her eye -- the only time he was ever physically violent to her, she would later emphasise -- at which point it became <em>imperative</em> to get medical help for his mental condition.</p>\n\n\n\n<p>Ray stayed at home while the rest of the band went to Belgium -- they got in a substitute rhythm player, and Dave took the lead vocals -- though the tour didn't make them any new friends. Their co-manager Grenville Collins went along and with the tact and diplomacy for which the British upper classes are renowned the world over, would say things like “I understand every bloody word you’re saying but I won’t speak your filthy language. De Gaulle won’t speak English, why should I speak French?”</p>\n\n\n\n<p>At home, Ray was doing worse and worse. When some pre-recorded footage of the Kinks singing \"Dedicated Follower of Fashion\" came on the TV, he unplugged it and stuck it in the oven.&nbsp; He said later \"I was completely out of my mind. I went to sleep and I woke up a week later with a beard. I don’t know what happened to me. I’d run into the West End with my money stuffed in my socks, I’d tried to punch my press agent, I was chased down Denmark Street by the police, hustled into a taxi by a psychiatrist and driven off somewhere. And I didn’t know. I woke up and I said, ‘What’s happening? When do we leave for Belgium?’ And they said, ‘Ray it’s all right. You had a collapse. Don’t worry. You’ll get better.’”</p>\n\n\n\n<p>He did get better, though for a long time he found himself unable to listen to any contemporary rock music other than Bob Dylan -- electric guitars made him think of the pop world that had made him ill -- and so he spent his time listening to classical and jazz records.&nbsp;</p>\n\n\n\n<p>He didn't want to be a pop star any more, and convinced himself he could quit the band if he went out on top by writing a number one single. And so he did:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Sunny Afternoon\"]</p>\n\n\n\n<p>Or at least, I say it's a single he wrote, but it's here that I finally get to a point I've been dancing round since the beginning of the episode.</p>\n\n\n\n<p>The chorus line, \"In the summertime\", was Rasa's suggestion, and in one of the only two interviews I've ever come across with her, for Johnny Rogan's biography of Ray, she calls the song \"the only one where I wrote some words\". But there's evidence, including another interview with her I'll talk about in a bit, that suggests that's not quite the case.</p>\n\n\n\n<p>For years, I thought it was an interesting coincidence that Ray Davies' songwriting ability follows a curve that almost precisely matches that of his relationship with Rasa. At the start, he's clearly talented -- \"You Really Got Me\" is a great track -- but he's an unformed writer and most of his work is pretty poor stuff.</p>\n\n\n\n<p>Then he marries Rasa, and his writing starts to become more interesting. Rasa starts to regularly contribute in the studio, and he becomes one of the great songwriters of his generation. For a five-year period in the mid-to-late-sixties, the period when their marriage is at its strongest, Ray writes a string of classic songs that are the equal of any catalogue in popular music.</p>\n\n\n\n<p>Then around 1970 Rasa stops coming to the studio, and their marriage is under strain. The records become patchier -- still plenty of classic tracks, but a lot more misses. And then in 1973, she left him, and his songwriting fell off a cliff. If you look at a typical Ray Davies concert setlist from 2017, the last time he toured, he did twenty songs, of which two were from his new album, one was the Kinks' one-off hit \"Come Dancing\" from 1983, and every other song was from the period when he and Rasa were married.</p>\n\n\n\n<p>Now, for a long time I just thought that was interesting, but likely a coincidence. After all, most rock songwriters do their most important work in their twenties, divorces have a way of messing people's mental health up, musical fashions change… there are a myriad reasons why these things could be like that.</p>\n\n\n\n<p>But… the circumstantial evidence just kept piling up. Ray's paranoia about people stealing his ideas meant that he became a lot more paranoid and secretive in his songwriting process, and would often not tell his bandmates the titles of the songs, the lyrics, or the vocal melody, until after they'd recorded the backing tracks -- they would record the tracks knowing the chord changes and tempo, but not what the actual song was. Increasingly he would be dictating parts to Quaife and Nicky Hopkins in the studio from the piano, telling them exactly what to play.</p>\n\n\n\n<p>But while Pete Quaife thought that Ray was being dictatorial in the studio and resented it, he resented something else more. As late as 1999 he was complaining about, in his words, \"the silly little bint from Bradford virtually running the damn studio\", telling him what to do, and feeling unable to argue back even though he regarded her as \"a jumped-up groupie\". Dave, on the other hand, valued Rasa's musical intuition and felt that Ray was the same. And she was apparently actually more up-to-date with the music in the charts than any of the band -- while they were out on the road, she would stay at home and listen to the radio and make note of what was charting and why.</p>\n\n\n\n<p>All this started to seem like a lot of circumstantial evidence that Rasa was possibly far more involved in the creation of the music than she gets credit for -- and given that she was never credited for her vocal parts on any Kinks records, was it too unbelievable that she might have contributed to the songwriting without credit?</p>\n\n\n\n<p>But then I found the <em>other</em> interview with Rasa I'm aware of, a short sidebar piece I'll link in the liner notes, and I'm going to quote that here:</p>\n\n\n\n<p>\"Rasa, however, would sometimes take a very active role during the writing of the songs, many of which were written in the family home, even on occasion adding to the lyrics. She suggested the words “In the summertime” to ‘Sunny Afternoon’, it is claimed. She now says, “I would make suggestions for a backing melody, sing along while Ray was playing the song(s) on the piano; at times I would add a lyric line or word(s). It was rewarding for me and was a major part of our life.”</p>\n\n\n\n<p>That was enough for me to become convinced that Rasa was a proper collaborator with Ray. I laid all this out in a blog post, being very careful how I phrased what I thought -- that while Ray Davies was probably the <em>principal</em> author of the songs credited to him (and to be clear, that is definitely what I think -- there's a stylistic continuity throughout his work that makes it very clear that the same man did the bulk of the work on all of it), the songs were the work of a writing partnership.</p>\n\n\n\n<p>As I said in that post \"But even if Rasa only contributed ten percent, that seems likely to me to have been the ten percent that pulled those songs up to greatness. Even if all she did was pull Ray back from his more excessive instincts, perhaps cause him to show a little more compassion in his more satirical works (and the thing that’s most notable about his post-Rasa songwriting is how much less compassionate it is), suggest a melodic line should go up instead of down at the end of a verse, that kind of thing… the cumulative effect of those sorts of suggestions can be enormous.\"</p>\n\n\n\n<p>I was just laying out my opinion, not stating anything as a certainty, though I was morally sure that Rasa deserved at least that much credit. And then Rasa commented on the post, saying \"Dear Andrew. Your article was so informative and certainly not mischaracterised. Thank you for the ’history’ of my input working with Ray. As I said previously, that time was magical and joyous.\"</p>\n\n\n\n<p>I think that's as close a statement as we're likely to get that the Kinks' biggest hits were actually the result of the songwriting team of Davies and Davies, and not of Ray alone, since nobody seems interested at all in a woman who sang on -- and likely co-wrote -- some of the biggest hit records of the sixties. Rasa gets mentioned in two sentences in the band's Wikipedia page, and as far as I can tell has only been interviewed twice -- an extensive interview by Johnny Rogan for his biography of Ray, in which he sadly doesn't seem to have pressed her on her songwriting contributions, and the sidebar above.&nbsp;</p>\n\n\n\n<p>I will probably continue to refer to Ray writing songs in this and the next episode on the Kinks, because I don't know for sure who wrote what, and he is the one who is legally credited as the sole writer. But… just bear that in mind. And bear it in mind whenever I or anyone else talk about the wives and girlfriends of other rock stars, because I'm sure she's not the only one.</p>\n\n\n\n<p>\"Sunny Afternoon\" knocked \"Paperback Writer\" off the number one spot, but by the time it did, Pete Quaife was out of the band. He'd fallen out with the Davies brothers so badly that he'd insisted on travelling separately from them, and he'd been in a car crash that had hospitalised him for six weeks. They'd quickly hired a temporary replacement, John Dalton, who had previously played with The Mark Four, the group that had evolved into The Creation. They needed him to mime for a TV appearance pretty much straight away, so they asked him \"can you play a descending D minor scale?\" and when he said yes he was hired -- because the opening of \"Sunny Afternoon\" used a trick Ray was very fond of, of holding a chord in the guitars while the bass descends in a scale, only changing chord when the notes would clash too badly, and then changing to the closest possible chord:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Sunny Afternoon\"]</p>\n\n\n\n<p>Around this time, the group also successfully renegotiated their contract with Pye Records, with the help of a new lawyer they had been advised to get in touch with -- Allen Klein.</p>\n\n\n\n<p>As well as helping renegotiate their contracts, Klein also passed on a demo of one of Ray's new songs to Herman's Hermits. “Dandy” was going to be on the Kinks' next album, but the Hermits released it as a single in the US and took it into the top ten:</p>\n\n\n\n<p>[Excerpt: Herman's Hermits, “Dandy”]</p>\n\n\n\n<p>In September, Pete Quaife formally quit the band -- he hadn't played with them in months after his accident -- and the next month the album Face To Face, recorded while Quaife was still in the group, was released. Face to Face was the group's first really solid album, and much of the album was in the same vein as \"Sunny Afternoon\" -- satirical songs that turned on the songwriter as much as on the people they were ostensibly about. It didn't do as well as the previous albums, but did still make the top twenty on the album chart.</p>\n\n\n\n<p>The group continued work, recording a new single, \"Dead End Street\", a song which is musically very similar to \"Sunny Afternoon\", but is lyrically astonishingly bleak, dealing with poverty and depression rather than more normal topics for a pop song. The group produced a promotional film for it, but the film was banned by the BBC as being in bad taste, as it showed the group as undertakers.</p>\n\n\n\n<p>But the single happened to be released two days after the broadcast of \"Cathy Come Home\", the seminal drama about homelessness, which suddenly brought homelessness onto the political agenda. While \"Dead End Street\" wasn't technically about homelessness, it was close enough that when the TV programme Panorama did a piece on the subject, they used \"Dead End Street\" to soundtrack it. The song made the top five, an astonishing achievement for something so dark:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Dead End Street\"]</p>\n\n\n\n<p>But the track also showed the next possible breach in the Kinks' hitmaking team -- when it was originally recorded, Shel Talmy had produced it, and had a French horn playing, but after he left the session, the band brought in a trombone player to replace the French horn, and rerecorded it without him. They would continue working with him for a little while, recording some of the tracks for their next album, but by the time the next single came out, Talmy would be out of the picture for good.</p>\n\n\n\n<p>But Pete Quaife, on the other hand, was nowhere near as out of the group as he had seemed. While he'd quit the band in September, Ray persuaded him to rejoin the band four days before \"Dead End Street\" came out, and John Dalton was back to working in his day job as a builder, though we'll be hearing more from him.&nbsp;</p>\n\n\n\n<p>The group put out a single in Europe, \"Mr. Pleasant\", a return to the style of \"Well Respected Man\" and \"Dedicated Follower of Fashion\":</p>\n\n\n\n<p>[Excerpt: The Kinks, “Mr. Pleasant”]</p>\n\n\n\n<p>That was a big hit in the Netherlands, but it wasn't released in the UK. They were working on something rather different.</p>\n\n\n\n<p>Ray had had the idea of writing a song called \"Liverpool Sunset\", about Liverpool, and about the decline of the Merseybeat bands who had been at the top of the profession when the Kinks had been starting out. But then the Beatles had released \"Strawberry Fields Forever\" and \"Penny Lane\", and Ray hadn't wanted to release anything about Liverpool's geography and look like he had stolen from them, given his attitudes to plagiarism. He said later \"I sensed that the Beatles weren’t going to be around long. When they moved to London, and ended up in Knightsbridge or wherever, I was still in Muswell Hill. I was loyal to my origins. Maybe I felt when they left it was all over for Merseybeat.”</p>\n\n\n\n<p>So instead, he -- or he and Rasa -- came up with a song about London, and about loneliness, and about a couple, Terry and Julie -- Terry was named after his nephew Terry who lived in Australia, while Julie's name came from Julie Christie, as she was then starring in a film with a Terry, Terrence Stamp:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Waterloo Sunset\"]</p>\n\n\n\n<p>It's interesting to look at the musical inspirations for the song. Many people at the time pointed out the song's similarity to \"Winchester Cathedral\" by the New Vaudeville Band, which had come out six months earlier with a similar melody and was also named after a place:</p>\n\n\n\n<p>[Excerpt: The New Vaudeville Band, \"Winchester Cathedral\"]</p>\n\n\n\n<p>And indeed Spike Milligan had parodied that song and replaced the lyrics with something more London-centric:</p>\n\n\n\n<p>[Excerpt: Spike Milligan, \"Tower Bridge\"]</p>\n\n\n\n<p>But it seems likely that Ray had taken inspiration from an older piece of music. We've talked before about Ferd Grofe in several episodes -- he was the one who orchestrated the original version of \"Rhapsody in Blue\", who wrote the piece of music that inspired Don Everly to write \"Cathy's Clown\", and who wrote the first music for the Novachord, the prototype synthesiser from the 1930s.&nbsp;</p>\n\n\n\n<p>As we saw earlier, Ray was listening to a lot of classical and jazz music rather than rock at this point, and one has to wonder if, at some point during his illness the previous year, he had come across Metropolis: A Blue Fantasy, which Grofe had written for Paul Whiteman's band in 1928, very much in the style of \"Rhapsody in Blue\", and this section, eight and a half minutes in, in particular:</p>\n\n\n\n<p>[Excerpt: Paul Whiteman, \"Metropolis: A Blue Fantasy\" ]</p>\n\n\n\n<p>\"Waterloo Sunset\" took three weeks to record. They started out, as usual, with a backing track recorded without the rest of the group knowing anything about the song they were recording -- though the group members did contribute some ideas to the arrangement, which was unusual by this point. Pete Quaife contributed to the bass part, while Dave Davies suggested the slapback echo on the guitar:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Waterloo Sunset, Instrumental Take 2\"]</p>\n\n\n\n<p>Only weeks later did they add the vocals. Ray had an ear infection, so rather than use headphones he sang to a playback through a speaker, which meant he had to sing more gently, giving the vocal a different tone from his normal singing style:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Waterloo Sunset\"]</p>\n\n\n\n<p>And in one of the few contributions Rasa made that has been generally acknowledged, she came up with the \"Sha la la\" vocals in the middle eight:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Waterloo Sunset\"]</p>\n\n\n\n<p>And the idea of having the track fade out on cascading, round-like vocals:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Waterloo Sunset\"]</p>\n\n\n\n<p>Once again the Kinks were at a turning point. A few weeks after \"Waterloo Sunset\" came out, the Monterey Pop Festival finally broke the Who in America -- a festival the Kinks were invited to play, but had to turn down because of their visa problems.</p>\n\n\n\n<p>It felt like the group were being passed by -- Ray has talked about how \"Waterloo Sunset\" would have been another good point for him to quit the group as he kept threatening to, or at least to stay home and just make the records, like Brian Wilson, while letting the band tour with Dave on lead vocals.&nbsp;He decided against it, though, as he would for decades to come.</p>\n\n\n\n<p>That attitude, of simultaneously wanting to be part of something and be a distanced, dispassionate observer of it, is what made \"Waterloo Sunset\" so special. As Ray has said, in words that seem almost to invoke the story of Moses:&nbsp;</p>\n\n\n\n<p>\"it’s a culmination of all my desires and hopes – it’s a song about people going to a better world, but somehow I stayed where I was and became the observer in the song rather than the person who is proactive . . . I did not cross the river. They did and had a good life apparently.\"</p>\n\n\n\n<p>Ray stayed with the group, and we'll be picking up on what he and they did next in about a year's time. \"Waterloo Sunset\" went to number two on the charts, and has since become the most beloved song in the Kinks' whole catalogue. It's been called \"the most beautiful song in the English language\", and \"the most beautiful song of the rock 'n' roll era\", though Ray Davies, ever self-critical when he's not being self-aggrandising, thinks it could be improved upon.</p>\n\n\n\n<p>But most of the rest of us disagree. As the song itself says, \"Waterloo Sunset's fine\".</p>",
  "itunes:subtitle": "Episode one hundred and fifty-five of&nbsp;A History of Rock Music in Five Hundred Songs&nbsp;looks at “Waterloo Sunset” by the Kinks, and the self-inflicted damage the group did to their career between 1965 and 1967. Click the full post to read liner no",
  "itunes:keywords": "Allen Klein,Cher,Dave Davies,Ferde Grofe,Herman&#039;s Hermits,Jimmy Page,Larry Page,Manfred Mann,Mick Avory,Mitch Mitchell,New Vaudeville Band,Nicky Hopkins,Rasa Didzpetris,Ray Davies,Shel Talmy,Spike Milligan,The Kinks,the who",
  "itunes:episodeType": "full",
  "itunes:episode": 155,
  "content:encoded": "<p>Episode one hundred and fifty-five of&nbsp;<em>A History of Rock Music in Five Hundred Songs</em>&nbsp;looks at “Waterloo Sunset” by the Kinks, and the self-inflicted damage the group did to their career between 1965 and 1967. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n\n\n\n<p>Patreon backers also have a nineteen-minute bonus episode available, on<a href=\"https://www.patreon.com/posts/73156702\"> \"Excerpt From a Teenage Opera\" by Keith West</a>.</p>\n\n\n\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n\n\n\n\n<p><strong>Resources</strong></p>\n\n\n\n<p>No Mixcloud this week, as there are too many Kinks songs.</p>\n\n\n\n<p>I’ve used several resources for this and future episodes on the Kinks, most notably<a href=\"https://amzn.to/3cOfO5z\">&nbsp;<em>Ray Davies: A Complicated Life</em></a>&nbsp;by Johnny Rogan and&nbsp;<a href=\"https://amzn.to/3uqKMqA\"><em>You Really Got Me&nbsp;</em></a>by Nick Hasted.</p>\n\n\n\n<p><a href=\"https://amzn.to/2PBB1qE\"><em>X-Ray</em>&nbsp;by Ray Davies</a>&nbsp;is a remarkable autobiography with a framing story set in a dystopian science-fiction future, while&nbsp;<a href=\"https://amzn.to/3mnnHlD\"><em>Kink</em>&nbsp;by Dave Davies&nbsp;</a>is more revealing but less well-written.</p>\n\n\n\n<p><a href=\"https://amzn.to/3sTNeFD\"><em>The Anthology 1964-1971</em>&nbsp;</a>is a great box set that covers the Kinks’ Pye years, which overlap almost exactly with their period of greatest creativity. For those who don’t want a full box set,&nbsp;<a href=\"https://amzn.to/3mnylZI\">this two-CD set&nbsp;</a>covers all the big hits.</p>\n\n\n\n<p>And <a href=\"https://jennyartichoke.wordpress.com/2016/04/26/rasa-didzpetris/\">this</a> is the interview with Rasa I discuss in the episode.</p>\n\n\n\n<p><strong>Patreon</strong></p>\n\n\n\n<p>This podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?</p>\n\n\n\n<p><strong>Transcript</strong></p>\n\n\n\n<p>Before I start, this episode has some mentions of racism and homophobia, several discussions of physical violence, one mention of domestic violence, and some discussion of mental illness. I've tried to discuss these things with a reasonable amount of sensitivity, but there's a tabloid element to some of my sources which inevitably percolates through, so be warned if you find those things upsetting.&nbsp;</p>\n\n\n\n<p>One of the promises I made right at the start of this project was that I would not be doing the thing that almost all podcasts do of making huge chunks of the episodes be about myself -- if I've had to update people about something in my life that affects the podcast, I've done it in separate admin episodes, so the episodes themselves will not be taken up with stuff about me. The podcast is not about me.</p>\n\n\n\n<p>I am making a very slight exception in this episode, for reasons that will become clear -- there's no way for me to tell this particular story the way I need to without bringing myself into it at least a little. So I wanted to state upfront that this is a one-off thing. The podcast is not suddenly going to change.&nbsp;</p>\n\n\n\n<p>But one question that I get asked a lot -- far more than I'd expect -- is \"do the people you talk about in the podcast ever get in touch with you about what you've said?\"</p>\n\n\n\n<p>Now that has actually happened twice, both times involving people leaving comments on relatively early episodes. The first time is probably the single thing I'm proudest of achieving with this series, and it was a comment left on the episode on \"Goodnight My Love\" a couple of years back:</p>\n\n\n\n<p>[Excerpt: Jesse Belvin, \"Goodnight My Love\"]</p>\n\n\n\n<p>That comment was from Debra Frazier and read “Jesse Belvin is my Beloved Uncle, my mother’s brother. I’ve been waiting all my life for him to be recognized in this manner. I must say the content in this podcast is 100% correct!Joann and Jesse practically raised me. Can’t express how grateful I am. Just so glad someone got it right. I still miss them dearly to this day. My world was forever changed Feb. 6th 1960. I can remember him writing most of those songs right there in my grandmother’s living room. I think I’m his last living closest relative, that knows everything in this podcast is true.\"</p>\n\n\n\n<p>That comment by itself would have justified me doing this whole podcast.</p>\n\n\n\n<p>The other such comment actually came a couple of weeks ago, and was on the episode on \"Only You\":</p>\n\n\n\n<p>[Excerpt: The Platters, \"Only You\"]</p>\n\n\n\n<p>That was a longer comment, from Gayle Schrieber, an associate of Buck Ram, and started \"Well, you got some of it right. Your smart-assed sarcasm and know-it-all attitude is irritating since I Do know it all from the business side but what the heck. You did better than most people – with the exception of Marv Goldberg.\"</p>\n\n\n\n<p>Given that Marv Goldberg is the single biggest expert on 1950s vocal groups in the world, I'll take that as at least a backhanded compliment.</p>\n\n\n\n<p>So those are the only two people who I've talked about in the podcast who've commented, but before the podcast I had a blog, and at various times people whose work I wrote about would comment -- John Cowsill of the Cowsills still remembers a blog post where I said nice things about him fourteen years ago, for example.</p>\n\n\n\n<p>And there was one comment on a blog post I made four or five years ago which confirmed something I'd suspected for a while…</p>\n\n\n\n<p>When we left the Kinks, at the end of 1964, they had just recorded their first album. That album was not very good, but did go to number three in the UK album charts, which is a much better result than it sounds. Freddie \"Boom Boom\" Cannon got to number one in 1960, but otherwise the only rock acts to make number one on the album charts from the start of the sixties through the end of 1967 were Elvis, Cliff Richard, the Shadows, the Beatles, the Rolling Stones, Bob Dylan and the Monkees.&nbsp;</p>\n\n\n\n<p>In the first few years of the sixties they were interspersed with the 101 Strings, trad jazz, the soundtrack to West Side Story, and a blackface minstrel group, The George Mitchell Singers. From mid-1963 through to the end of 1967, though, literally the <em>only</em> things to get to number one on the album charts were the Beatles, the Rolling Stones, Bob Dylan, the Monkees, and the soundtrack to The Sound of Music. That tiny cabal was eventually broken at the end of 1967 by Val Doonican Rocks… But Gently, and from 1968 on the top of the album charts becomes something like what we would expect today, with a whole variety of different acts,&nbsp;</p>\n\n\n\n<p>I make this point to point out two things The first is that number three on the album charts is an <em>extremely</em> good position for the Kinks to be in -- when they reached that point the Rolling Stones' second album had just entered at number one, and Beatles For Sale had dropped to number two after eight weeks at the top -- and the second is that for most rock artists and record labels, the album market was simply not big enough or competitive enough until 1968 for it to really matter.</p>\n\n\n\n<p>What did matter was the singles chart. And \"You Really Got Me\" had been a genuinely revolutionary hit record. According to Ray Davies it had caused particular consternation to both the Rolling Stones and the Yardbirds, both of whom had thought they would be the first to get to number one with a dirty, distorted, R&B-influenced guitar-riff song.&nbsp;</p>\n\n\n\n<p>And so three weeks after the release of the album came the group's second single. Originally, the plan had been to release a track Ray had been working on called \"Tired of Waiting\", but that was a slower track, and it was decided that the best thing to do would be to try to replicate the sound of their first hit. So instead, they released \"All Day And All Of The Night\":</p>\n\n\n\n<p>[Excerpt: The Kinks, \"All Day And All Of The Night\"]</p>\n\n\n\n<p>That track was recorded by the same team as had recorded \"You Really Got Me\", except with Perry Ford replacing Arthur Greenslade on piano. Once again, Bobby Graham was on drums rather than Mick Avory, and when Ray Davies suggested that he might want to play a different drum pattern, Graham just asked him witheringly \"Who do you think you are?\"</p>\n\n\n\n<p>\"All Day and All of the Night\" went to number two -- a very impressive result for a soundalike follow-up -- and was kept off the number one spot first by \"Baby Love\" by the Supremes and then by \"Little Red Rooster\" by the Rolling Stones. The group quickly followed it up with an EP, Kinksize Session, consisting of three mediocre originals plus the group's version of \"Louie Louie\". By February 1965 that had hit number one on the EP charts, knocking the Rolling Stones off.</p>\n\n\n\n<p>Things were going as well as possible for the group. Ray and his girlfriend Rasa got married towards the end of 1964 -- they had to, as Rasa was pregnant and from a very religious Catholic family. By contrast, Dave was leading the kind of life that can only really be led by a seventeen-year-old pop star -- he moved out of the family home and in with Mick Avory after his mother caught him in bed with five women, and once out of her watchful gaze he also started having affairs with men, which was still illegal in 1964. (And which indeed would still be illegal for seventeen-year-olds until 2001).</p>\n\n\n\n<p>In January, they released their third hit single, \"Tired of Waiting for You\". The track was a ballad rather than a rocker, but still essentially another variant on the theme of \"You Really Got Me\" -- a song based around a few repeated phrases of lyric, and with a chorus with two major chords a tone apart. \"You Really Got Me\"'s chorus has the change going up:</p>\n\n\n\n<p>[Plays \"You Really Got Me\" chorus chords]</p>\n\n\n\n<p>While \"Tired Of Waiting For You\"'s chorus has the change going down:</p>\n\n\n\n<p>[Plays \"Tired of Waiting For You\" chorus chords]</p>\n\n\n\n<p>But it's trivially easy to switch between the two if you play them in the same key:</p>\n\n\n\n<p>[Demonstrates]</p>\n\n\n\n<p>Ray has talked about how \"Tired of Waiting for You\" was partly inspired by how he felt tired of waiting for the fame that the Kinks deserved, and the music was written even before \"You Really Got Me\". But when they went into the studio to record it, the only lyrics he had were the chorus. Once they'd recorded the backing track, he worked on the lyrics at home, before coming back into the studio to record his vocals, with Rasa adding backing vocals on the softer middle eight:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Tired of Waiting For You\"]</p>\n\n\n\n<p>After that track was recorded, the group went on a tour of Australia, New Zealand, and Hong Kong. The flight out to Australia was thirty-four hours, and also required a number of stops. One stop to refuel in Moscow saw the group forced back onto the plane at gunpoint after Pete Quaife unwisely made a joke about the recently-deposed Russian Premier Nikita Khruschev. They also had a stop of a couple of days in Mumbai, where Ray was woken up by the sounds of fishermen chanting at the riverside, and enchanted by both the sound and the image.</p>\n\n\n\n<p>In Adelaide, Ray and Dave met up for the first time in years with their sister Rose and her husband Arthur. Ray was impressed by their comparative wealth, but disliked the slick modernity of their new suburban home. Dave became&nbsp; so emotional about seeing his big sister again that he talked about not leaving her house, not going to the show that night, and just staying in Australia so they could all be a family again. Rose sadly told him that he knew he couldn't do that, and he eventually agreed.</p>\n\n\n\n<p>But the tour wasn't all touching family reunions. They also got into a friendly rivalry with Manfred Mann, who were also on the tour and were competing with the Kinks to be the third-biggest group in the UK behind the Beatles and the Stones, and at one point both bands ended up on the same floor of the same hotel as the Stones, who were on their own Australian tour. The hotel manager came up in the night after a complaint about the noise, saw the damage that the combined partying of the three groups had caused, and barricaded them into that floor, locking the doors and the lift shafts, so that the damage could be contained to one floor.</p>\n\n\n\n<p>\"Tired of Waiting\" hit number one in the UK while the group were on tour, and it also became their biggest hit in the US, reaching number six, so on the way home they stopped off in the US for a quick promotional appearance on Hullabaloo. According to Ray's accounts, they were asked to do a dance like Freddie and the Dreamers, he and Mick decided to waltz together instead, and the cameras cut away horrified at the implied homosexuality.</p>\n\n\n\n<p>In fact, examining the footage shows the cameras staying on the group as Mick approaches Ray, arms extended, apparently offering to waltz, while Ray backs off nervous and confused, unsure what's going on. Meanwhile Dave and Pete on the other side of the stage are being gloriously camp with their arms around each other's shoulders.&nbsp;</p>\n\n\n\n<p>When they finally got back to the UK, they were shocked to hear this on the radio:</p>\n\n\n\n<p>[Excerpt: The Who, \"I Can't Explain\"]</p>\n\n\n\n<p>Ray was horrified that someone had apparently stolen the group's sound, especially when he found out it was the Who, who as the High Numbers had had a bit of a rivalry with the group. He said later \"Dave thought it was us! It was produced by Shel Talmy, like we were. They used the same session singers as us, and Perry Ford played piano, like he did on ‘All Day And All Of The Night’. I felt a bit appalled by that. I think that was worse than stealing a song – they were actually stealing our whole style!”</p>\n\n\n\n<p>Pete Townshend later admitted as much, saying that he had deliberately demoed \"I Can't Explain\" to sound as much like the Kinks as possible so that Talmy would see its potential.</p>\n\n\n\n<p>But the Kinks were still, for the moment, doing far better than the Who. In March, shortly after returning from their foreign tour, they released their second album, Kinda Kinks. Like their first album, it was a very patchy effort, but it made number two on the charts, behind the Rolling Stones.</p>\n\n\n\n<p>But Ray Davies was starting to get unhappy. He was dissatisfied with everything about his life. He would talk later about looking at his wife lying in bed sleeping and thinking \"What's she doing here?\", and he was increasingly wondering if the celebrity pop star life was right for him, simultaneously resenting and craving the limelight, and doing things like phoning the music papers to deny rumours that he was leaving the Kinks -- rumours which didn't exist until he made those phone calls.</p>\n\n\n\n<p>As he thought the Who had stolen the Kinks' style, Ray decided to go in a different direction for the next Kinks single, and recorded \"Everybody's Gonna Be Happy\", which was apparently intended to sound like Motown, though to my ears it bears no resemblance:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Everybody's Gonna Be Happy\"]</p>\n\n\n\n<p>That only went to&nbsp; number nineteen -- still a hit, but a worry for a band who had had three massive hits in a row. Several of the band started to worry seriously that they were going to end up with no career at all.</p>\n\n\n\n<p>It didn't help that on the tour after recording that, Ray came down with pneumonia. Then Dave came down with bronchitis. Then Pete Quaife hit his head&nbsp; and had to be hospitalised with severe bleeding and concussion. According to Quaife, he fainted in a public toilet and hit his head on the bowl on the way down, but other band members have suggested that Quaife -- who had a reputation for telling tall stories, even in a band whose members are all known for rewriting history -- was ashamed after getting into a fight.</p>\n\n\n\n<p>In April they played the NME Poll-Winners' Party, on the same bill as the Beatles, the Rolling Stones, the Animals, the Moody Blues, the Searchers, Freddie And The Dreamers, Herman’s Hermits, Wayne Fontana & The Mindbenders, the Rockin’ Berries, the Seekers, the Ivy League, Them, the Bachelors, Georgie Fame & The Blue Flames, Cilla Black, Dusty Springfield, Twinkle, Tom Jones, Donovan, and Sounds Incorporated.&nbsp;</p>\n\n\n\n<p>Because they got there late they ended up headlining, going on <em>after</em> the Beatles, even though they hadn't won an award,&nbsp; only come second in best new group, coming far behind the Stones but just ahead of Manfred Mann and the Animals.</p>\n\n\n\n<p>The next single, \"Set Me Free\", was a conscious attempt to correct course after \"Everybody's Gonna Be Happy\" had been less successful:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Set Me Free\"]</p>\n\n\n\n<p>The song is once again repetitive, and once again based on a riff, structured similarly to \"Tired of Waiting\" but faster and more upbeat, and with a Beatles-style falsetto in the chorus. It worked -- it returned the group to the top ten -- but Ray wasn't happy at writing to order. He said in August of that year “I’m ashamed of that song. I can stand to hear and even sing most of the songs I’ve written, but not that one. It’s built around pure idiot harmonies that have been used in a thousand songs.”&nbsp;</p>\n\n\n\n<p>More recently he's talked about how the lyric was an expression of him wanting to be set free from the constraint of having to write a hit song in the style he felt he was outgrowing.</p>\n\n\n\n<p>By the time the single was released, though, it looked like the group might not even be together any longer.</p>\n\n\n\n<p>There had always been tensions in the band. Ray and Dave had a relationship that made the Everly Brothers look like the model of family amity, and while Pete Quaife stayed out of the arguments for the most part, Mick Avory couldn't. The core of the group had always been the Davies brothers, and Quaife had known them for years, but Avory was a relative newcomer and hadn't grown up with them, and they also regarded him as a bit less intelligent than the rest of the group. He became the butt of jokes on a fairly constant basis.&nbsp;</p>\n\n\n\n<p>That would have been OK, except that Avory was also an essentially passive person, who didn't want to take sides in conflicts, while Dave Davies thought that as he and Avory were flatmates they should be on the same side, and resented when Avory didn't take his side in arguments with Ray.</p>\n\n\n\n<p>As Dave remembered it, the trigger came when he wanted to change the setlist and Mick didn't support him against Ray. In others' recollection, it came when the rest of the band tried to get Dave away from a party and he got violent with them. Both may be true. Either way, Dave got drunk and threw a suitcase at the back of a departing Mick, who was normally a fairly placid person but had <em>had enough</em>, and so he turned round, furious, grabbed Dave, got him in a headlock and just started punching, blackening both his eyes.</p>\n\n\n\n<p>According to some reports, Avory was so infuriated with Dave that he knocked him out, and Dave was so drunk and angry that when he came to he went for Avory again, and got knocked out again.</p>\n\n\n\n<p>The next day, the group were driven to their show in separate cars -- the Davies brothers in one, the rhythm section in the other -- they had separate dressing rooms, and made their entrance from separate directions.&nbsp;</p>\n\n\n\n<p>They got through the first song OK, and then Dave Davies insulted Avory's drumming, spat at him, and kicked his drums so they scattered all over the stage. At this point, a lot of the audience were still thinking this was part of the act, but Avory saw red again and picked up his hi-hat cymbal and smashed it down edge-first onto Dave's head.</p>\n\n\n\n<p>Everyone involved says that if his aim had been very slightly different he would have actually killed Dave. As it is, Dave collapsed, unconscious, bleeding everywhere. Ray screamed \"My brother! He's killed my little brother!\" and Mick, convinced he was a murderer, ran out of the theatre, still wearing his stage outfit of a hunting jacket and frilly shirt. He was running away for his life -- and that was literal, as Britain still technically had the death penalty at this point; while the last executions in Britain took place in 1964, capital punishment for murder wasn't abolished until late 1965 --&nbsp; but at the same time a gang of screaming girls outside who didn't know what was going on were chasing him because he was a pop star.&nbsp;</p>\n\n\n\n<p>He managed to get back to London, where he found that the police had been looking for him but that Dave was alive and didn't want to press charges. However, he obviously couldn't go back to their shared home, and they had to cancel gigs because Dave had been hospitalised. It looked like the group were finished for good.</p>\n\n\n\n<p>Four days after that, Ray and Rasa's daughter Louisa was born, and shortly after that Ray was in the studio again, recording demos:</p>\n\n\n\n<p>[Excerpt: Ray Davies, \"I Go to Sleep (demo)\"]</p>\n\n\n\n<p>That song was part of a project that Larry Page, the group's co-manager, and Eddie Kassner, their publisher, had of making Ray's songwriting a bigger income source, and getting his songs recorded by other artists. Ray had been asked to write it for Peggy Lee, who soon recorded her own version:</p>\n\n\n\n<p>[Excerpt: Peggy Lee, \"I Go to Sleep\"]</p>\n\n\n\n<p>Several of the other tracks on that demo session featured Mitch Mitchell on drums. At the time, Mitchell was playing with another band that Page managed, and there seems to have been some thought of him possibly replacing Avory in the group.</p>\n\n\n\n<p>But instead, Larry Page cut the Gordian knot. He invited each band member to a meeting, just the two of them -- and didn't tell them that he'd scheduled all these meetings at the same time. When they got there, they found that they'd been tricked into having a full band meeting, at which point Page just talked to them about arrangements for their forthcoming American tour, and didn't let them get a word in until he'd finished. At the end he asked if they had any questions, and Mick Avory said he'd need some new cymbals because he'd broken his old ones on Dave's head.</p>\n\n\n\n<p>Before going on tour, the group recorded a song that Ray had written inspired by that droning chanting he'd heard in Mumbai. The song was variously titled \"See My Friend\" and \"See My Friends\" -- it has been released under both titles, and Ray seems to sing both words at different times -- and Ray told Maureen Cleave \"The song is about homosexuality… It’s like a football team and the way they’re always kissing each other.”</p>\n\n\n\n<p>(We will be talking about Ray Davies' attitudes towards sexuality and gender in a future episode, but suffice to say that like much of Davies' worldview, he has a weird mixture of very progressive and very reactionary views, and he is also prone to observe behaviours in other people's private lives and make them part of his own public persona).</p>\n\n\n\n<p>The guitar part was recorded on a bad twelve-string guitar that fed back in the studio, creating a drone sound, which Shel Talmy picked up on and heavily compressed, creating a sound that bore more than a little resemblance to a sitar:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"See My Friend\"]</p>\n\n\n\n<p>If that had been released at the time, it would have made the Kinks into trend-setters. Instead it was left in the can for nearly three months, and in the meantime the Yardbirds released the similar-sounding \"Heart Full of Soul\", making the Kinks look like bandwagon-jumpers when their own record came out, and reinforcing a paranoid belief that Ray had started to develop that his competitors were stealing his ideas.</p>\n\n\n\n<p>The track taking so long to come out was down to repercussions from the group's American tour, which changed the course of their whole career in ways they could not possibly have predicted.</p>\n\n\n\n<p>This was still the era when the musicians' unions of the US and UK had a restrictive one-in, one-out policy for musicians, and you couldn't get a visa to play in the US without the musicians' union's agreement -- and the AFM were not very keen on the British invasion, which they saw as taking jobs away from their members. There are countless stories from this period of bands like the Moody Blues getting to the US only to find that the arrangements have fallen through and they can't perform. Around this time, Wayne Fontana and the Mindbenders were told they weren't notable enough to get permission to play more than one gig, even though they were at number one on the charts in the US at the time.</p>\n\n\n\n<p>So it took a great deal of effort to get the Kinks' first US tour arranged, and they had to make a good impression. Unfortunately, while the Beatles and Stones knew how to play the game and give irreverent, cheeky answers that still left the interviewers amused and satisfied, the Kinks were just flat-out confusing and rude:</p>\n\n\n\n<p>[Excerpt: The Kinks Interview with Clay Cole]</p>\n\n\n\n<p>The whole tour went badly. They were booked into unsuitable venues, and there were a series of events like the group being booked on the same bill as the Dave Clark Five, and both groups having in their contract that they would be the headliner. Promoters started to complain about them to their management and the unions, and Ray was behaving worse and worse.</p>\n\n\n\n<p>By the time the tour hit LA, Ray was being truly obnoxious. According to Larry Page he refused to play one TV show because there was a Black drummer on the same show. Page said that it was not about personal prejudice -- though it's hard to see how it could not be, at least in part -- but just picking something arbitrary to complain about to show he had the power to mess things up.</p>\n\n\n\n<p>While shooting a spot for the show Where The Action Is, Ray got into a physical fight with one of the other cast members over nothing. What Ray didn't realise was that the person in question was a representative for AFTRA, the screen performers' union, and was already unhappy because Dave had earlier refused to join the union. Their behaviour got reported up the chain.</p>\n\n\n\n<p>The day after the fight was supposed to be the highlight of the tour, but Ray was missing his wife. In the mid-sixties, the Beach Boys would put on a big Summer Spectacular at the Hollywood Bowl every year, and the Kinks were due to play it, on a bill which as well as the Beach Boys also featured the Byrds, the Righteous Brothers, Dino, Desi & Billy, and Sonny and Cher. But Ray said he wasn't going on unless Rasa was there.</p>\n\n\n\n<p>And he didn't tell Larry Page, who was there, that. Instead, he told a journalist at the Daily Mirror in London, and the first Page heard about it was when the journalist phoned him to confirm that Ray wouldn't be playing. Now, they had already been working to try to get Rasa there for the show, because Ray had been complaining for a while. But Rasa didn't have a passport. Not only that, but she was an immigrant and her family were from Lithuania, and the US State Department weren't exactly keen on people from the Eastern Bloc flying to the US. And it was a <em>long</em> flight. I don't know exactly how long a flight from London to LA took then, but it takes eleven and a half hours now, and it will have been around that length.</p>\n\n\n\n<p>Somehow, working a miracle, Larry Page co-ordinated with his co-managers Robert Wace and Grenville Collins back in London -- difficult in itself as Wace and Collins and Page and his business partner Eddie Kassner were by now in two different factions, because Ray had been manipulating them and playing them off against each other for months. But the three of them worked together and somehow got Rasa to LA in time for Ray to go on stage. Page waited around long enough to see that Ray had got on stage at the Hollywood Bowl, then flew back to London. He had had enough of Ray's nonsense, and didn't really see any need to be there anyway, because they had a road manager, their publisher, their agent, and plenty of support staff. He felt that he was only there to be someone for Ray Davies to annoy and take his frustrations out on.</p>\n\n\n\n<p>And indeed, once Page flew back to the UK, Ray calmed down, though how much of that was the presence of Rasa it's hard to say. Their road manager at the time though said \"If Larry wasn’t there, Ray couldn’t make problems because there was nobody there to make them to. He couldn’t make problems for me because I just ignored them. For example, in Hawaii, the shirts got stolen. Ray said, ‘No way am I going onstage without my shirt.’ So I turned around and said to him, ‘Great, don’t go on!’ Of course, they went on.”</p>\n\n\n\n<p>They did miss the gig the next night in San Francisco, with more or less the same lineup as the Hollywood Bowl show -- they'd had problems with the promoter of that show at an earlier gig in Reno, and so Ray said they weren't going to play unless they got paid in cash upfront. When the promoter refused, the group just walked on stage, waved, and walked off. But other than that, the rest of the tour went OK.</p>\n\n\n\n<p>What they didn't realise until later was that they had made so many enemies on that tour that it would be impossible for them to return to the US for another four years. They weren't blacklisted, as such, they just didn't get the special treatment that was necessary to make it possible for them to visit there. From that point on they would still have a few hits in the US, but nothing like the sustained massive success they had in the UK in the same period.</p>\n\n\n\n<p>Ray felt abandoned by Page, and started to side more and more with Wace and Collins. Page though was still trying to promote Ray's songwriting. Some of this, like the album \"Kinky Music\" by the Larry Page Orchestra, released during the tour, was possibly not the kind of promotion that anyone wanted, though some of it has a certain kitsch charm:</p>\n\n\n\n<p>[Excerpt: The Larry Page Orchestra, \"All Day And All Of The Night\"]</p>\n\n\n\n<p>Incidentally, the guitarist on that album was Jimmy Page, who had previously played rhythm guitar on a few Kinks album tracks.</p>\n\n\n\n<p>But other stuff that Larry Page was doing would be genuinely helpful. For example, on the tour he had become friendly with Stone and Greene, the managers who we heard about in the Buffalo Springfield episode. At this point they were managing Sonny and Cher, and when they came over to the UK, Page took the opportunity to get Cher into the studio to cut a version of Ray's \"I Go to Sleep\":</p>\n\n\n\n<p>[Excerpt: Cher, \"I Go to Sleep\"]</p>\n\n\n\n<p>Most songwriters, when told that the biggest new star of the year was cutting a cover version of one of their tracks for her next album, would be delighted. Ray Davies, on the other hand, went to the session and confronted Page, screaming about how Page was stealing his ideas.</p>\n\n\n\n<p>And it was Page being marginalised that caused \"See My Friend\" to be delayed, because while they were in the US, Page had produced the group in Gold Star Studios, recording a version of Ray's song \"Ring the Bells\", and Page wanted that as the next single, but the group had a contract with Shel Talmy which said he would be their producer. They couldn't release anything Talmy hadn't produced, but Page, who had control over the group's publishing with his business partner Kassner, wouldn't let them release \"See My Friend\". Eventually, Talmy won out, and \"See My Friend\" became the group's next single.</p>\n\n\n\n<p>It made the top ten on the Record Retailer chart, the one that's now the official UK chart cited in most sources, but only number fifteen on the NME chart which more people paid attention to at the time, and only spent a few weeks on the charts. Ray spent the summer complaining in the music papers about how the track -- \"the only one I've really liked\", as he said at the time -- wasn't selling as much as it deserved, and also insulting Larry Page and boasting about his own abilities, saying he was a better singer than Andy Williams and Tony Bennett.</p>\n\n\n\n<p>The group sacked Larry Page as their co-manager, and legal battles between Page and Kassner on one side and Collins and Wace on the other would continue for years, tying up much of the group's money. Page went on to produce a new band he was managing, making records that sounded very like the Kinks' early hits:</p>\n\n\n\n<p>[Excerpt: The Troggs, \"Wild Thing\"]</p>\n\n\n\n<p>The Kinks, meanwhile, decided to go in a different direction for their new EP, Kwyet Kinks, an EP of mostly softer, folk- and country-inspired songs. The most interesting thing on Kwyet Kinks was \"Well-Respected Man\", which saw Ray's songwriting go in a completely different direction as he started to write gentle social satires with more complex lyrics, rather than the repetitive riff-based songs he'd been doing before. That track was released as a single in the US, which didn't have much of an EP market, and made the top twenty there, despite its use of a word that in England at the time had a double meaning -- either a cigarette or a younger boy at a public school who has to be the servant of an older boy -- but in America was only used as a slur for gay people:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Well Respected Man\"]</p>\n\n\n\n<p>The group's next album, The Kink Kontroversy, was mostly written in a single week, and is another quickie knockoff album. It had the hit single \"Til the End of the Day\", another attempt at getting back to their old style of riffy rockers, and one which made the top ten. It also had a rerecorded version of \"Ring the Bells\", the song Larry Page had wanted to release as a single:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Ring the Bells\"]</p>\n\n\n\n<p>I'm sure that when Ray Davies heard \"Ruby Tuesday\" a little over a year later he didn't feel any better about the possibility that people were stealing his ideas.</p>\n\n\n\n<p>The Kink Kontroversy was a transitional album for the group in many ways. It was the first album to prominently feature Nicky Hopkins, who would be an integral part of the band's sound for the next three years, and the last one to feature a session drummer (Clem Cattini, rather than Avory, played on most of the tracks). From this point on there would essentially be a six-person group of studio Kinks who would make the records -- the four Kinks themselves, Rasa Davies on backing vocals, and Nicky Hopkins on piano.</p>\n\n\n\n<p>At the end of 1965 the group were flailing, mired in lawsuits, and had gone from being the third biggest group in the country at the start of the year to maybe the tenth or twentieth by the end of it. Something had to change.</p>\n\n\n\n<p>And it did with the group's next single, which in both its sound and its satirical subject matter was very much a return to the style of \"Well Respected Man\". \"Dedicated Follower of Fashion\" was inspired by anger. Ray was never a particularly sociable person, and he was not the kind to do the rounds of all the fashionable clubs like the other pop stars, including his brother, would. But he did feel a need to make some kind of effort and would occasionally host parties at his home for members of the fashionable set.</p>\n\n\n\n<p>But Davies didn't keep up with fashion the way they did, and some of them would mock him for the way he dressed. At one such party he got into a fistfight with someone who was making fun of his slightly flared trousers, kicked all the guests out, and then went to a typewriter and banged out a lyric mocking the guest and everyone like him:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Dedicated Follower of Fashion\"]</p>\n\n\n\n<p>The song wasn't popular with Ray's bandmates -- Dave thought it was too soft and wimpy, while Quaife got annoyed at the time Ray spent in the studio trying to make the opening guitar part sound a bit like a ukulele. But they couldn't argue with the results -- it went to number five on the charts, their biggest success since \"Tired of Waiting for You\" more than a year earlier, and more importantly in some ways it became part of the culture in a way their more recent singles hadn't. \"Til The End of the Day\" had made the top ten, but it wasn't a record that stuck in people's minds. But \"Dedicated Follower of Fashion\" was so popular that Ray soon got sick of people coming up to him in the street and singing \"Oh yes he is!\" at him.</p>\n\n\n\n<p>But then, Ray was getting sick of everything. In early 1966 he had a full-scale breakdown, brought on by the flu but really just down to pure exhaustion. Friends from this time say that Ray was an introverted control freak, always neurotic and trying to get control and success, but sabotaging it as soon as he attained it so that he didn't have to deal with the public.</p>\n\n\n\n<p>&nbsp;Just before a tour of Belgium, Rasa gave him an ultimatum -- either he sought medical help or she would leave him. He picked up their phone and slammed it into her face, blacking her eye -- the only time he was ever physically violent to her, she would later emphasise -- at which point it became <em>imperative</em> to get medical help for his mental condition.</p>\n\n\n\n<p>Ray stayed at home while the rest of the band went to Belgium -- they got in a substitute rhythm player, and Dave took the lead vocals -- though the tour didn't make them any new friends. Their co-manager Grenville Collins went along and with the tact and diplomacy for which the British upper classes are renowned the world over, would say things like “I understand every bloody word you’re saying but I won’t speak your filthy language. De Gaulle won’t speak English, why should I speak French?”</p>\n\n\n\n<p>At home, Ray was doing worse and worse. When some pre-recorded footage of the Kinks singing \"Dedicated Follower of Fashion\" came on the TV, he unplugged it and stuck it in the oven.&nbsp; He said later \"I was completely out of my mind. I went to sleep and I woke up a week later with a beard. I don’t know what happened to me. I’d run into the West End with my money stuffed in my socks, I’d tried to punch my press agent, I was chased down Denmark Street by the police, hustled into a taxi by a psychiatrist and driven off somewhere. And I didn’t know. I woke up and I said, ‘What’s happening? When do we leave for Belgium?’ And they said, ‘Ray it’s all right. You had a collapse. Don’t worry. You’ll get better.’”</p>\n\n\n\n<p>He did get better, though for a long time he found himself unable to listen to any contemporary rock music other than Bob Dylan -- electric guitars made him think of the pop world that had made him ill -- and so he spent his time listening to classical and jazz records.&nbsp;</p>\n\n\n\n<p>He didn't want to be a pop star any more, and convinced himself he could quit the band if he went out on top by writing a number one single. And so he did:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Sunny Afternoon\"]</p>\n\n\n\n<p>Or at least, I say it's a single he wrote, but it's here that I finally get to a point I've been dancing round since the beginning of the episode.</p>\n\n\n\n<p>The chorus line, \"In the summertime\", was Rasa's suggestion, and in one of the only two interviews I've ever come across with her, for Johnny Rogan's biography of Ray, she calls the song \"the only one where I wrote some words\". But there's evidence, including another interview with her I'll talk about in a bit, that suggests that's not quite the case.</p>\n\n\n\n<p>For years, I thought it was an interesting coincidence that Ray Davies' songwriting ability follows a curve that almost precisely matches that of his relationship with Rasa. At the start, he's clearly talented -- \"You Really Got Me\" is a great track -- but he's an unformed writer and most of his work is pretty poor stuff.</p>\n\n\n\n<p>Then he marries Rasa, and his writing starts to become more interesting. Rasa starts to regularly contribute in the studio, and he becomes one of the great songwriters of his generation. For a five-year period in the mid-to-late-sixties, the period when their marriage is at its strongest, Ray writes a string of classic songs that are the equal of any catalogue in popular music.</p>\n\n\n\n<p>Then around 1970 Rasa stops coming to the studio, and their marriage is under strain. The records become patchier -- still plenty of classic tracks, but a lot more misses. And then in 1973, she left him, and his songwriting fell off a cliff. If you look at a typical Ray Davies concert setlist from 2017, the last time he toured, he did twenty songs, of which two were from his new album, one was the Kinks' one-off hit \"Come Dancing\" from 1983, and every other song was from the period when he and Rasa were married.</p>\n\n\n\n<p>Now, for a long time I just thought that was interesting, but likely a coincidence. After all, most rock songwriters do their most important work in their twenties, divorces have a way of messing people's mental health up, musical fashions change… there are a myriad reasons why these things could be like that.</p>\n\n\n\n<p>But… the circumstantial evidence just kept piling up. Ray's paranoia about people stealing his ideas meant that he became a lot more paranoid and secretive in his songwriting process, and would often not tell his bandmates the titles of the songs, the lyrics, or the vocal melody, until after they'd recorded the backing tracks -- they would record the tracks knowing the chord changes and tempo, but not what the actual song was. Increasingly he would be dictating parts to Quaife and Nicky Hopkins in the studio from the piano, telling them exactly what to play.</p>\n\n\n\n<p>But while Pete Quaife thought that Ray was being dictatorial in the studio and resented it, he resented something else more. As late as 1999 he was complaining about, in his words, \"the silly little bint from Bradford virtually running the damn studio\", telling him what to do, and feeling unable to argue back even though he regarded her as \"a jumped-up groupie\". Dave, on the other hand, valued Rasa's musical intuition and felt that Ray was the same. And she was apparently actually more up-to-date with the music in the charts than any of the band -- while they were out on the road, she would stay at home and listen to the radio and make note of what was charting and why.</p>\n\n\n\n<p>All this started to seem like a lot of circumstantial evidence that Rasa was possibly far more involved in the creation of the music than she gets credit for -- and given that she was never credited for her vocal parts on any Kinks records, was it too unbelievable that she might have contributed to the songwriting without credit?</p>\n\n\n\n<p>But then I found the <em>other</em> interview with Rasa I'm aware of, a short sidebar piece I'll link in the liner notes, and I'm going to quote that here:</p>\n\n\n\n<p>\"Rasa, however, would sometimes take a very active role during the writing of the songs, many of which were written in the family home, even on occasion adding to the lyrics. She suggested the words “In the summertime” to ‘Sunny Afternoon’, it is claimed. She now says, “I would make suggestions for a backing melody, sing along while Ray was playing the song(s) on the piano; at times I would add a lyric line or word(s). It was rewarding for me and was a major part of our life.”</p>\n\n\n\n<p>That was enough for me to become convinced that Rasa was a proper collaborator with Ray. I laid all this out in a blog post, being very careful how I phrased what I thought -- that while Ray Davies was probably the <em>principal</em> author of the songs credited to him (and to be clear, that is definitely what I think -- there's a stylistic continuity throughout his work that makes it very clear that the same man did the bulk of the work on all of it), the songs were the work of a writing partnership.</p>\n\n\n\n<p>As I said in that post \"But even if Rasa only contributed ten percent, that seems likely to me to have been the ten percent that pulled those songs up to greatness. Even if all she did was pull Ray back from his more excessive instincts, perhaps cause him to show a little more compassion in his more satirical works (and the thing that’s most notable about his post-Rasa songwriting is how much less compassionate it is), suggest a melodic line should go up instead of down at the end of a verse, that kind of thing… the cumulative effect of those sorts of suggestions can be enormous.\"</p>\n\n\n\n<p>I was just laying out my opinion, not stating anything as a certainty, though I was morally sure that Rasa deserved at least that much credit. And then Rasa commented on the post, saying \"Dear Andrew. Your article was so informative and certainly not mischaracterised. Thank you for the ’history’ of my input working with Ray. As I said previously, that time was magical and joyous.\"</p>\n\n\n\n<p>I think that's as close a statement as we're likely to get that the Kinks' biggest hits were actually the result of the songwriting team of Davies and Davies, and not of Ray alone, since nobody seems interested at all in a woman who sang on -- and likely co-wrote -- some of the biggest hit records of the sixties. Rasa gets mentioned in two sentences in the band's Wikipedia page, and as far as I can tell has only been interviewed twice -- an extensive interview by Johnny Rogan for his biography of Ray, in which he sadly doesn't seem to have pressed her on her songwriting contributions, and the sidebar above.&nbsp;</p>\n\n\n\n<p>I will probably continue to refer to Ray writing songs in this and the next episode on the Kinks, because I don't know for sure who wrote what, and he is the one who is legally credited as the sole writer. But… just bear that in mind. And bear it in mind whenever I or anyone else talk about the wives and girlfriends of other rock stars, because I'm sure she's not the only one.</p>\n\n\n\n<p>\"Sunny Afternoon\" knocked \"Paperback Writer\" off the number one spot, but by the time it did, Pete Quaife was out of the band. He'd fallen out with the Davies brothers so badly that he'd insisted on travelling separately from them, and he'd been in a car crash that had hospitalised him for six weeks. They'd quickly hired a temporary replacement, John Dalton, who had previously played with The Mark Four, the group that had evolved into The Creation. They needed him to mime for a TV appearance pretty much straight away, so they asked him \"can you play a descending D minor scale?\" and when he said yes he was hired -- because the opening of \"Sunny Afternoon\" used a trick Ray was very fond of, of holding a chord in the guitars while the bass descends in a scale, only changing chord when the notes would clash too badly, and then changing to the closest possible chord:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Sunny Afternoon\"]</p>\n\n\n\n<p>Around this time, the group also successfully renegotiated their contract with Pye Records, with the help of a new lawyer they had been advised to get in touch with -- Allen Klein.</p>\n\n\n\n<p>As well as helping renegotiate their contracts, Klein also passed on a demo of one of Ray's new songs to Herman's Hermits. “Dandy” was going to be on the Kinks' next album, but the Hermits released it as a single in the US and took it into the top ten:</p>\n\n\n\n<p>[Excerpt: Herman's Hermits, “Dandy”]</p>\n\n\n\n<p>In September, Pete Quaife formally quit the band -- he hadn't played with them in months after his accident -- and the next month the album Face To Face, recorded while Quaife was still in the group, was released. Face to Face was the group's first really solid album, and much of the album was in the same vein as \"Sunny Afternoon\" -- satirical songs that turned on the songwriter as much as on the people they were ostensibly about. It didn't do as well as the previous albums, but did still make the top twenty on the album chart.</p>\n\n\n\n<p>The group continued work, recording a new single, \"Dead End Street\", a song which is musically very similar to \"Sunny Afternoon\", but is lyrically astonishingly bleak, dealing with poverty and depression rather than more normal topics for a pop song. The group produced a promotional film for it, but the film was banned by the BBC as being in bad taste, as it showed the group as undertakers.</p>\n\n\n\n<p>But the single happened to be released two days after the broadcast of \"Cathy Come Home\", the seminal drama about homelessness, which suddenly brought homelessness onto the political agenda. While \"Dead End Street\" wasn't technically about homelessness, it was close enough that when the TV programme Panorama did a piece on the subject, they used \"Dead End Street\" to soundtrack it. The song made the top five, an astonishing achievement for something so dark:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Dead End Street\"]</p>\n\n\n\n<p>But the track also showed the next possible breach in the Kinks' hitmaking team -- when it was originally recorded, Shel Talmy had produced it, and had a French horn playing, but after he left the session, the band brought in a trombone player to replace the French horn, and rerecorded it without him. They would continue working with him for a little while, recording some of the tracks for their next album, but by the time the next single came out, Talmy would be out of the picture for good.</p>\n\n\n\n<p>But Pete Quaife, on the other hand, was nowhere near as out of the group as he had seemed. While he'd quit the band in September, Ray persuaded him to rejoin the band four days before \"Dead End Street\" came out, and John Dalton was back to working in his day job as a builder, though we'll be hearing more from him.&nbsp;</p>\n\n\n\n<p>The group put out a single in Europe, \"Mr. Pleasant\", a return to the style of \"Well Respected Man\" and \"Dedicated Follower of Fashion\":</p>\n\n\n\n<p>[Excerpt: The Kinks, “Mr. Pleasant”]</p>\n\n\n\n<p>That was a big hit in the Netherlands, but it wasn't released in the UK. They were working on something rather different.</p>\n\n\n\n<p>Ray had had the idea of writing a song called \"Liverpool Sunset\", about Liverpool, and about the decline of the Merseybeat bands who had been at the top of the profession when the Kinks had been starting out. But then the Beatles had released \"Strawberry Fields Forever\" and \"Penny Lane\", and Ray hadn't wanted to release anything about Liverpool's geography and look like he had stolen from them, given his attitudes to plagiarism. He said later \"I sensed that the Beatles weren’t going to be around long. When they moved to London, and ended up in Knightsbridge or wherever, I was still in Muswell Hill. I was loyal to my origins. Maybe I felt when they left it was all over for Merseybeat.”</p>\n\n\n\n<p>So instead, he -- or he and Rasa -- came up with a song about London, and about loneliness, and about a couple, Terry and Julie -- Terry was named after his nephew Terry who lived in Australia, while Julie's name came from Julie Christie, as she was then starring in a film with a Terry, Terrence Stamp:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Waterloo Sunset\"]</p>\n\n\n\n<p>It's interesting to look at the musical inspirations for the song. Many people at the time pointed out the song's similarity to \"Winchester Cathedral\" by the New Vaudeville Band, which had come out six months earlier with a similar melody and was also named after a place:</p>\n\n\n\n<p>[Excerpt: The New Vaudeville Band, \"Winchester Cathedral\"]</p>\n\n\n\n<p>And indeed Spike Milligan had parodied that song and replaced the lyrics with something more London-centric:</p>\n\n\n\n<p>[Excerpt: Spike Milligan, \"Tower Bridge\"]</p>\n\n\n\n<p>But it seems likely that Ray had taken inspiration from an older piece of music. We've talked before about Ferd Grofe in several episodes -- he was the one who orchestrated the original version of \"Rhapsody in Blue\", who wrote the piece of music that inspired Don Everly to write \"Cathy's Clown\", and who wrote the first music for the Novachord, the prototype synthesiser from the 1930s.&nbsp;</p>\n\n\n\n<p>As we saw earlier, Ray was listening to a lot of classical and jazz music rather than rock at this point, and one has to wonder if, at some point during his illness the previous year, he had come across Metropolis: A Blue Fantasy, which Grofe had written for Paul Whiteman's band in 1928, very much in the style of \"Rhapsody in Blue\", and this section, eight and a half minutes in, in particular:</p>\n\n\n\n<p>[Excerpt: Paul Whiteman, \"Metropolis: A Blue Fantasy\" ]</p>\n\n\n\n<p>\"Waterloo Sunset\" took three weeks to record. They started out, as usual, with a backing track recorded without the rest of the group knowing anything about the song they were recording -- though the group members did contribute some ideas to the arrangement, which was unusual by this point. Pete Quaife contributed to the bass part, while Dave Davies suggested the slapback echo on the guitar:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Waterloo Sunset, Instrumental Take 2\"]</p>\n\n\n\n<p>Only weeks later did they add the vocals. Ray had an ear infection, so rather than use headphones he sang to a playback through a speaker, which meant he had to sing more gently, giving the vocal a different tone from his normal singing style:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Waterloo Sunset\"]</p>\n\n\n\n<p>And in one of the few contributions Rasa made that has been generally acknowledged, she came up with the \"Sha la la\" vocals in the middle eight:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Waterloo Sunset\"]</p>\n\n\n\n<p>And the idea of having the track fade out on cascading, round-like vocals:</p>\n\n\n\n<p>[Excerpt: The Kinks, \"Waterloo Sunset\"]</p>\n\n\n\n<p>Once again the Kinks were at a turning point. A few weeks after \"Waterloo Sunset\" came out, the Monterey Pop Festival finally broke the Who in America -- a festival the Kinks were invited to play, but had to turn down because of their visa problems.</p>\n\n\n\n<p>It felt like the group were being passed by -- Ray has talked about how \"Waterloo Sunset\" would have been another good point for him to quit the group as he kept threatening to, or at least to stay home and just make the records, like Brian Wilson, while letting the band tour with Dave on lead vocals.&nbsp;He decided against it, though, as he would for decades to come.</p>\n\n\n\n<p>That attitude, of simultaneously wanting to be part of something and be a distanced, dispassionate observer of it, is what made \"Waterloo Sunset\" so special. As Ray has said, in words that seem almost to invoke the story of Moses:&nbsp;</p>\n\n\n\n<p>\"it’s a culmination of all my desires and hopes – it’s a song about people going to a better world, but somehow I stayed where I was and became the observer in the song rather than the person who is proactive . . . I did not cross the river. They did and had a good life apparently.\"</p>\n\n\n\n<p>Ray stayed with the group, and we'll be picking up on what he and they did next in about a year's time. \"Waterloo Sunset\" went to number two on the charts, and has since become the most beloved song in the Kinks' whole catalogue. It's been called \"the most beautiful song in the English language\", and \"the most beautiful song of the rock 'n' roll era\", though Ray Davies, ever self-critical when he's not being self-aggrandising, thinks it could be improved upon.</p>\n\n\n\n<p>But most of the rest of us disagree. As the song itself says, \"Waterloo Sunset's fine\".</p>",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and fifty-five of&nbsp;A History of Rock Music in Five Hundred Songs&nbsp;looks at “Waterloo Sunset” by the Kinks, and the self-inflicted damage the group did to their career between 1965 and 1967. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nPatreon backers also have a nineteen-minute bonus episode available, on \"Excerpt From a Teenage Opera\" by Keith West.\n\n\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\n\n\nResources\n\n\n\nNo Mixcloud this week, as there are too many Kinks songs.\n\n\n\nI’ve used several resources for this and future episodes on the Kinks, most notably&nbsp;Ray Davies: A Complicated Life&nbsp;by Johnny Rogan and&nbsp;You Really Got Me&nbsp;by Nick Hasted.\n\n\n\nX-Ray&nbsp;by Ray Davies&nbsp;is a remarkable autobiography with a framing story set in a dystopian science-fiction future, while&nbsp;Kink&nbsp;by Dave Davies&nbsp;is more revealing but less well-written.\n\n\n\nThe Anthology 1964-1971&nbsp;is a great box set that covers the Kinks’ Pye years, which overlap almost exactly with their period of greatest creativity. For those who don’t want a full box set,&nbsp;this two-CD set&nbsp;covers all the big hits.\n\n\n\nAnd this is the interview with Rasa I discuss in the episode.\n\n\n\nPatreon\n\n\n\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\n\n\n\nTranscript\n\n\n\nBefore I start, this episode has some mentions of racism and homophobia, several discussions of physical violence, one mention of domestic violence, and some discussion of mental illness. I've tried to discuss these things with a reasonable amount of sensitivity, but there's a tabloid element to some of my sources which inevitably percolates through, so be warned if you find those things upsetting.&nbsp;\n\n\n\nOne of the promises I made right at the start of this project was that I would not be doing the thing that almost all podcasts do of making huge chunks of the episodes be about myself -- if I've had to update people about something in my life that affects the podcast, I've done it in separate admin episodes, so the episodes themselves will not be taken up with stuff about me. The podcast is not about me.\n\n\n\nI am making a very slight exception in this episode, for reasons that will become clear -- there's no way for me to tell this particular story the way I need to without bringing myself into it at least a little. So I wanted to state upfront that this is a one-off thing. The podcast is not suddenly going to change.&nbsp;\n\n\n\nBut one question that I get asked a lot -- far more than I'd expect -- is \"do the people you talk about in the podcast ever get in touch with you about what you've said?\"\n\n\n\nNow that has actually happened twice, both times involving people leaving comments on relatively early episodes. The first time is probably the single thing I'm proudest of achieving with this series, and it was a comment left on the episode on \"Goodnight My Love\" a couple of years back:\n\n\n\n[Excerpt: Jesse Belvin, \"Goodnight My Love\"]\n\n\n\nThat comment was from Debra Frazier and read “Jesse Belvin is my Beloved Uncle, my mother’s brother. I’ve been waiting all my life for him to be recognized in this manner. I must say the content in this podcast is 100% correct!Joann and Jesse practically raised me. Can’t express how grateful I am. Just so glad someone got it right. I still miss them dearly to this day. My world was forever changed Feb. 6th 1960. I can remember him writing most of those songs right there in my grandmother’s living room. I think I’m his last living closest relative, that knows everything in this podcast is true.\"\n\n\n\nThat comment by itself would have justified me doing this whole podcast.\n\n\n\nThe other such comment actually came a couple of weeks ago,",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and fifty-five of&nbsp;A History of Rock Music in Five Hundred Songs&nbsp;looks at “Waterloo Sunset” by the Kinks, and the self-inflicted damage the group did to their career between 1965 and 1967. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nPatreon backers also have a nineteen-minute bonus episode available, on \"Excerpt From a Teenage Opera\" by Keith West.\n\n\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\n\n\nResources\n\n\n\nNo Mixcloud this week, as there are too many Kinks songs.\n\n\n\nI’ve used several resources for this and future episodes on the Kinks, most notably&nbsp;Ray Davies: A Complicated Life&nbsp;by Johnny Rogan and&nbsp;You Really Got Me&nbsp;by Nick Hasted.\n\n\n\nX-Ray&nbsp;by Ray Davies&nbsp;is a remarkable auto",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}