{
  "title": "Thomas M. Coughlin Is 2023 IEEE President-Elect",
  "link": "https://spectrum.ieee.org/2023-ieee-president-elect",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-photo-of-a-man-in-a-dark-jacket-on-a-light-background.jpg?id=31945564&width=2000&height=1500&coordinates=0%2C93%2C0%2C104\"/><br/><br/><p>IEEE Life Fellow <a href=\"https://candidates.ieee.org/candidates/nominees/thomas-m-coughlin/\" rel=\"noopener noreferrer\" target=\"_blank\">Thomas M. Coughlin</a> has been elected as the 2023 IEEE president-elect. He is set to begin serving as president on 1 January 2024.</p><p>Coughlin, who was nominated by the IEEE Board of Directors, received 10,908 votes in the election. Senior Member <a href=\"https://candidates.ieee.org/candidates/nominees/kathleen-a-kramer/\" rel=\"noopener noreferrer\" target=\"_blank\">Kathleen Kramer</a> received 10,769 votes, Life Fellow <a href=\"https://candidates.ieee.org/candidates/nominees/kazuhiro-kosuge/\" rel=\"noopener noreferrer\" target=\"_blank\">Kazuhiro Kosuge</a> received 8,682 votes, and Senior Member <a href=\"https://candidates.ieee.org/candidates/nominees/maike-luiken/\" rel=\"noopener noreferrer\" target=\"_blank\">Maike Luiken</a> received 4,365 votes.</p><hr/><p>At press time, the results were unofficial until the IEEE Board of Directors accepts the IEEE Teller's Committee report in November.</p><p>Coughlin is founder and president of Coughlin Associates, in San Jose, Calif., which provides market and technology analysis as well as data storage, memory technology, and business consulting services. He has more than 40 years of experience in the data storage industry and has been a consultant for over 20 years. He has been granted six patents.</p><p>Before starting his own company, Coughlin held senior leadership positions at Ampex, Micropolis, and SyQuest.</p><p>He is the author of <em>Digital Storage in Consumer Electronics: The Essential Guide</em>, which is in its second edition. He is a regular contributor on digital storage for the <em>Forbes</em> blog and other news outlets.</p><h3>Coughlin’s Top Three Goals as President-Elect</h3><br/><ol><li>Increase IEEE’s engagement with members and enhance the value of membership for all member grades</li><li>Create greater partnerships across and outside of IEEE to increase the organization’s public impact</li><li>Ensure that IEEE creates a vibrant and safe environment that supports its diverse members</li></ol><p>In 2019 he was IEEE-USA president as well as the 2015-2016 IEEE Region 6 director. He also was chair of the IEEE New Initiatives and Public Visibility committees. He was vice president of operations and planning for the IEEE Consumer Technology Society and served as general chair of the 2011 Sections Congress in San Francisco.<br/></p><p>He is an active member of the IEEE Santa Clara Valley (Calif.) Section, which he chaired, and has been involved with several societies and standards groups, as well as the IEEE Future Directions Committee.</p><p>As a distinguished lecturer for the Consumer Technology Society and IEEE Student Activities, he has spoken on digital storage in consumer electronics, digital storage and memory for artificial intelligence, and how students can make IEEE their “professional home.”</p><p>Coughlin is a member of the IEEE–Eta Kappa Nu (IEEE-HKN) honor society.</p><p>He has received several recognitions including the 2020 IEEE Member and Geographic Activities Leadership Award.</p><p>Coughlin is active in several other professional organizations including the Society of Motion Picture and Television Engineers and the Storage Networking Industry Association.</p><p>To find out who was chosen as IEEE-USA president-elect, IEEE Technical Activities vice president-elect, IEEE Standards Association Board of Governors members-at-large, and more, <a href=\"https://www.ieee.org/content/dam/ieee-org/ieee/web/org/about/corporate/election/2022-IEEE-annual-election-results.pdf\" target=\"_blank\">read the full annual election results</a>.</p>",
  "pubDate": "Fri, 14 Oct 2022 18:00:00 +0000",
  "guid": "https://spectrum.ieee.org/2023-ieee-president-elect",
  "category": [
    "Ieee news",
    "Ieee election",
    "Ieee president elect",
    "Type:ti"
  ],
  "dc:creator": "Joanna Goodrich",
  "media:content": ""
}