{
  "title": "Early Retirement Extreme &#8211; A Systems Approach to Lifestyle Design",
  "link": "https://www.madfientist.com/early-retirement-extreme-interview/",
  "comments": "https://www.madfientist.com/early-retirement-extreme-interview/#comments",
  "dc:creator": "The Mad Fientist",
  "pubDate": "Tue, 19 Jan 2021 10:15:00 +0000",
  "category": [
    "FIRE (Financial Independence / Retire Early)",
    "Interviews"
  ],
  "guid": "http://www.madfientist.com/?p=6958",
  "description": "<p class=\"lead\">I finally talked to the person who introduced me to the idea of financial independence - Jacob Lund Fisker from Early Retirement Extreme!</p>\n<p class=\"more-link-p\"><a class=\"btn btn-danger\" href=\"https://www.madfientist.com/early-retirement-extreme-interview/\">Read more &#8594;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/early-retirement-extreme-interview/\">Early Retirement Extreme &#8211; A Systems Approach to Lifestyle Design</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "content:encoded": "\n<p>On today&#8217;s episode of the <a href=\"https://www.madfientist.com/podcast/\" target=\"_blank\" rel=\"noopener\">Financial Independence Podcast</a>, I finally got to interview the person who introduced me to the concept of financial independence and early retirement in the first place&#8230;</p>\n\n\n\n<p>Jacob Lund Fisker from <a href=\"http://earlyretirementextreme.com\" target=\"_blank\" rel=\"noopener\">Early Retirement Extreme</a>!</p>\n\n\n\n<p>To my mind, Jacob is the founder of the modern-day &#8220;FIRE movement&#8221; so hope you enjoy the interview!</p>\n\n\n<h2>Listen Now</h2><div style='padding:20px'><audio class=\"wp-audio-shortcode\" id=\"audio-6958-6\" preload=\"none\" style=\"width: 100%;\" controls=\"controls\"><source type=\"audio/mpeg\" src=\"https://traffic.libsyn.com/secure/madfientist/early-retirement-extreme-interview.mp3?_=6\" /><a href=\"https://traffic.libsyn.com/secure/madfientist/early-retirement-extreme-interview.mp3\">https://traffic.libsyn.com/secure/madfientist/early-retirement-extreme-interview.mp3</a></audio></div><ul><li>Listen on <a href='https://open.spotify.com/show/5AjnvxZb6ZScoI6KCV0hxo' target='_blank'>Spotify</a> or <a href='https://www.madfientist.com/go/itunes/' target='_blank'>Apple Podcasts</a></li><li>Download MP3 by right-clicking <a href='https://traffic.libsyn.com/secure/madfientist/early-retirement-extreme-interview.mp3' target='_blank' rel='nofollow'>here</a></li></ul>\n\n\n\n<h2>Highlights</h2>\n\n\n\n<ul><li>What Jacob has been up to since stepping away from ERE</li><li>His experience being a financial quant and how it impacted his personal investing</li><li>The problem with set-it-and-forget-it index investing</li><li>The importance of staying flexible with your investing strategy</li><li>Predictions for the next decade and the post-COVID world</li><li>A systems approach to lifestyle design and why it&#8217;s beneficial</li><li>Jacob&#8217;s thoughts on early retirement how they&#8217;ve changed since publishing Early Retirement Extreme</li><li>His current projects and his plans for the future</li></ul>\n\n\n\n<h2>Show Links</h2>\n\n\n\n<ul><li>Early Retirement Extreme <a href=\"http://earlyretirementextreme.com/\" target=\"_blank\" rel=\"noopener\">Website</a> | <a href=\"https://amzn.to/3bTH6aG\" target=\"_blank\" rel=\"nofollow noopener\">Book</a> | <a href=\"https://forum.earlyretirementextreme.com/\" target=\"_blank\" rel=\"noopener\">Forum</a> | <a href=\"https://wiki.earlyretirementextreme.com/\" target=\"_blank\" rel=\"noopener\">Wiki</a> | <a href=\"https://buy.bookfunnel.com/zvjq7i422n\" target=\"_blank\" rel=\"noopener\">Audio Book</a></li><li>Early Retirement Extreme on <a href=\"https://twitter.com/extremejacob\" target=\"_blank\" rel=\"nofollow noopener\">Twitter</a> | <a href=\"https://www.facebook.com/earlyretirementextreme\" target=\"_blank\" rel=\"nofollow noopener\">Facebook</a></li><li><a href=\"https://www.getrichslowly.org/early-retirement-extreme/\" target=\"_blank\" rel=\"noopener\">ERE 10-Year Update on Get Rich Slowly</a></li><li><a href=\"https://www.getrichslowly.org/book-review-early-retirement-extreme/\" target=\"_blank\" rel=\"noopener\">The Post that Started the Mad Fientist&#8217;s FI Journey</a></li></ul>\n\n\n\n<h2>Full Transcript</h2>\n\n\n<div class=\"transcript\">\n<strong>Mad Fientist:</strong> Hey, what&#8217;s up everybody? \n<br/><br/>\nWelcome to the Financial Independence Podcast, the podcast where I get inside the brains of some of the best and brightest in personal finance to find out how they achieved financial independence. \n<br/><br/>\nI can&#8217;t believe it, but I am finally interviewing the person that introduced me to this whole idea of financial independence in the first place. \n<br/><br/>\nAnd that is Jacob Lund Fisker from EarlyRetirementExtreme.com. \n<br/><br/>\nI came across Jacob way back in 2011, I was reading GetRichSlowly.org, which I&#8217;ve interviewed the writer behind that blog, JD Roth, on a previous episode of the podcast. So I was reading his site, and he did a review of a book called Early Retirement Extreme, and it just blew my mind. And that was when I realized that early financial independence was possible. If you saved enough money, you could then live on it and not have to rely on work anymore. So I&#8217;d say that was probably the most influential article I&#8217;ve ever read in my life, because it completely changed everything. And over the years, I&#8217;ve heard lots of stories from people about who introduced them to the idea of FIRE. And, you know, Mr. Money Mustache is a big one. And even this podcast has introduced some people to the concept, which is amazing to me. But Jacob and ERE is what did it for me. So it&#8217;s an honor to be able to talk to the guy that changed my life in so many ways. So rather than ramble on here, I just want to dive into it&#8230; \n<br/><br/>\nJacob, thank you so much for being here. I really appreciate it.\n<br/><br/>\nThis is a long time coming. So I started this podcast way back in May of 2012. And you were going to be my first guest, because you were the entire reason I knew about this whole thing called financial independence in the first place. But I chickened out and ended up asking a guy named Mr. Money Mustache, who was also a software developer like myself. And thankfully, I didn&#8217;t know how big he was at the time and how big he would go on to become but yeah, this is, this is a huge treat to be able to talk to you after all these years. And to thank you for the huge impact you&#8217;ve had on my life. Because I was trying to think about it before this call and I can&#8217;t think of anyone other than maybe my parents and my wife who have had a bigger impact on my financial life than you have.  And it was all from an article on Get Rich Slowly. And I think it was maybe when JD was reviewing your book back in 2011. \n<br/><br/>\n<strong>Jacob Lund Fisker:</strong> Yeah, I mean, I think that was the one. I recently did a 10 year update and Get Rich Slowly as well. But I think that like only only two of them. But like, at that time I was I was I was mostly sort of like fading out of existence, like right when you started is when I more or less ended. \n<br/><br/>\n<strong>Mad Fientist:</strong> Yeah, it was crazy. You just passed the torch to Mr. Money Mustache and that&#8217;s why I was like, well, I could talk to him because he&#8217;s a software developer. That would be fun. And yeah, it was just around that time.\n<br/><br/>\nMaybe that&#8217;s where we can kick off because I&#8217;m interested to hear what you&#8217;ve been up to. So you had you had written the book. And it&#8217;s a fantastic book. I&#8217;ve read it at least three times. And you finished up what you were trying to say with the website. And you were moving on and you passed the torch to MMM and I believe at the time you were becoming a quant trader. Is that right? \n<br/><br/>\n<strong>Jacob:</strong> Yeah, something I never quite sure what my title was actually supposed to be. But it was me staring at financial data&#8230;a giant screen setup and trying to see some patterns there. \n<br/><br/>\n<strong>Mad Fientist:</strong> What was that experience like? And how long did you end up doing it for? \n<br/><br/>\n<strong>Jacob:</strong> I was there three and a half years until 2015. Essentially, my experience&#8230;when I was sort of like a young physicist, so to speak, I was very dismissing of anything financing business. But as I sort of like, matured a little bit more and got into sort of like the postdoc era of my life, I began to sort of kind of get acquainted with the whole financial independence thing, I started reading into finance and economics and actually thought working in the business and Wall Street could be could be really fun. And but that was that unfortunately happened sort of like around 2007-2008.\n<br/><br/>\nAnd then the great credit crisis essentially happened then there was like, tons of layoffs and all hiring essentially froze. And then I thought, Well, okay, that&#8217;s kind of like it for me. Just kind of forget about that.\n<br/><br/>\nAnd so I basically did that. And when I was sort of writing on the blog, instead and I was always making these kind of comments about like, if there had been more physicists on Wall Street, maybe this wouldn&#8217;t have happened. Like total physicist arrogance, we can fix everything.\n<br/><br/>\nAnd then one of one of my readers actually commented back and said if I&#8217;m still interested, maybe he could make that happen. So I was like, Yes. Okay, let&#8217;s try this, right, because my sort of philosophy is to try as many different things as you possibly can so essentially, sort of like self actualize to the fullest. By doing many different things, I&#8217;m learning many different things. So he essentially got me into the company in Chicago. So we left California in 2011-12. So basically, just before you started podcasting.\n<br/><br/>\nSo same time, I sort of took that as an opportunity to stop blogging because I really felt that I but said everything there was to say, in the blog, I finished the book, which was sort of like the canonical textbook of both FI and also sort of like the extended theory part of it, I mean, to be FIREd, it&#8217;s just like a small aspect of what, when I was sort of like going on about so so I did that for a few years. \n<br/><br/>\nYeah, I think the greatest takeaway&#8230;is how big a difference there was between, like the academic side, sort of like the internet armchair expert, and then the actual practitioners.  Because in other fields, like science and engineering, you&#8217;re used to having one line of insight, sort of like goes from not knowing anything to maybe being like a hobbyist to being like a serious amateur. And then you have people working in the business. And then at the very top, you have like professors who understand everything.  That, you would agree, is typically how it goes.  I don&#8217;t know if that goes away in computing these days. But that&#8217;s how it would go in and like for example, physics, whereas in, in finance, or high finance, or like Wall Street stuff (Wall Street does not mean the physical location essentially means everything that has to do with trading and making deals that are outside the retail level), it has essentially forked. So they&#8217;re like two different communities that almost have like a wall between them. So you have, you have the academic side of it. And then you have the practical side. And what&#8217;s weird is that like the practical side is way bigger, way more well-financed, and in a sense more advanced. Whereas the academic side, they have essentially access to worse data, because data is expensive.  So it will be something like end of day closing prices, you can get a subscription to that. On the actual practitioner side, you will have everything tick by tick from multiple different exchanges. There&#8217;s not just the market in the US. I mean, when I when I quit in 15, there were like 40 different I think, exchanges and dark pools just in the US. So way more data, and that sort of like leads to sort of like different interpretation, different behaviors in those separate groups. \n<br/><br/>\nAnd yeah, so that was my biggest surprise. My biggest insight from it was probably how agnostic or how neutral people were, in practitioners are in terms of like, what&#8217;s the best strategy is more sort of like, Well, I mean, this strategy might be good for this. And this might be good for that. But all sort of like look at what works and and just go with that. It&#8217;s not like as a theoretical academic level, where it&#8217;s all an improvement and stuff we already know and Nobel Prize winners have shown that and therefore everything must cite back to something, some previous work. \n<br/><br/>\nI sort of like the more dogmatic so I mean, I think that sort of like spilled over into the rest of my life. So these days, I&#8217;m so far less to sort of like fly off a tangent because someone is wrong on the internet. So I think that is sort of like the biggest life lesson in that. \n<br/><br/>\n<strong>Mad Fientist:</strong> That&#8217;s a great takeaway. Did it affect how you view your own personal investments at all? I know back in the day, when I was reading you, you were one of the people that wasn&#8217;t on board with the whole buy and hold index investing, just set it and forget it sort of thing, which I want to dive into a little bit more. But first, did did your time in the industry on that practitioner side of Wall Street? Did that influence how you invested as an individual or a family? \n<br/><br/>\n<strong>Jacob:</strong> Not really.  I mean, first of all, it&#8217;s like what I was was doing was like completely different than what I can do as a retail investor. So no, that&#8217;s not really been any change, I will actually say I&#8217;m probably better as a retail investor than I was as a professional. I tend to be more risk adverse, and this is not optimal for the industry. Let&#8217;s put it that way.\n<br/><br/>\nLike one of the fun things, where every everybody I work absolutely enjoyed playing poker. And I hate poker. I mean, that was interesting. I think in terms of the whole sort of like the index investing thing. I think the my reputation has been somewhat exaggerated in the FIRE movement. I mean, I wrote a few posts and asked some questions about the systemic effects mass adoption of index investing could have on the markets as such. And that sort of eventually turned into, &#8220;this Jacob guy who just hates index investing&#8221;. I think my bigger concern was the whole fire-and-forget attitude. Let&#8217;s, just hand everything over to an app. Let&#8217;s, you know, you want to want something quick and easy, something simple. So just do that. And then you can forget about it. \n<br/><br/>\n<strong>Mad Fientist:</strong> I&#8217;d be interested to hear what you think of the FIRE movement? Especially, I think maybe 2017-2018 just seemed like it was going crazy. What were your thoughts on it at that stage? Because this is, you know, seven years after you felt like, you&#8217;ve pretty much said everything you wanted to say about it?\n<br/><br/>\n<strong>Jacob:</strong> Yeah, I mean, it&#8217;s kind of like doing the podcast today. It&#8217;s like, well, man, I just like the 10 years ago, I&#8217;d forgotten all about it right now. And I need to revisit my notes, essentially. Yeah, I mean, it definitely hit the mainstream at that at that point. And, you start getting contacted by various journalists, because I mean, I&#8217;m sort of still known as one of the progenitors of it. And so of course, they want my opinion on it.\n<br/><br/>\nAnd I think what happened, essentially, you get, like a different kind of different kind of exposure. I mean, if you started if you go like, way back, way back, if you go back to sort of like this, the present iteration, which I think kind of started with me, we were only like, at least I was sort of like the loudest loud mouth bunch, right? I mean, I remember sort of, I mean, back then FIRE was not a thing, that sort of financial independence was not a thing in the personal finance world. I mean, when I was starting up, I was like, you know, these like, blogging awards, and I was I was getting them for, for something like &#8220;Best in Senior Living&#8221;.\n<br/><br/>\nLike &#8220;Best Entrepreneurial Blog&#8221;, like I hadn&#8217;t started into business, but that was sort of like the sort of the framework of sort of like the mid late 2000s that financial independence could fit into.\n<br/><br/>\nAnd so I started out at this very extreme kind of thing, way out of the left field, you know, like, let&#8217;s try not buying anything for a year. So that was completely unusual to do that. And when this has now become sort of like a &#8220;Buy Nothing Year&#8221;. \n<br/><br/>\nBack then was David Bach thing where it was like the latte effect, where if you just save $2 a day, you become a millionaire in like 100 years, or whatever, and the idea of retiring was that you would save up a million dollars, it was always a million dollars, so that he was to become a millionaire. Investing, I think, like the 4% rule&#8230;that was the thing.  But it wasn&#8217;t really that wide widespread.  I mean, it came out of the Trinity study but back then the Trinity study was only like 10 years old or something. So it was not the foundation of any way to sort of invest for retirement.  It was more like I want to retire on this day and I have the $700,000 and I want to spend $40,000 a year, and then they would go back way around and then compute like a return of investment of 6% and so given those 6% what should the allocation investment be like.  So that was sort of like pre 4% rule as a as a rule of thumb and a lot of people retired and invested accordingly.\n<br/><br/>\nRight. And that kind of goes back to that warning about not adapting or sort of like integrating a very simple understanding of how to invest for the next 60 years, because some of these guys, you know, like, who retired in the 90s. And it was sort of like a mental model that sort of crashed and burned, because investing in some something aggressive at 8%, which was perfectly possible in the 90s, did not work very well between 2000 and 2007.\n<br/><br/>\n<strong>Mad Fientist:</strong> So, would you be willing to share like sort of what your thinking is, as far as personal investment now, and like, you don&#8217;t have to obviously share any numbers or any actual strategies, but maybe just give a sort of an idea of what you&#8217;re thinking as far as how you invest your own FI portfolio? \n<br/><br/>\n<strong>Jacob:</strong> Having invested for almost 20 years, now, I can definitely say that it changes, I mean, it changes, you change, depending on where I make money, I don&#8217;t make money.  Depends on how big the network has become. I mean, if you are like starting in the beginning, then index funds, for example, makes like great sense. Because you&#8217;re not you don&#8217;t have to think very much think very hard about and you can concentrate on your salary instead, I mean, and sort of like a we agree way to identify that demographic is when they plot you know, your net-worth graphic, and it&#8217;s just a straight line up, right? Because stuff, you know, your dollar cost averaging is completely and utterly dominating the sort of market impact of whatever your net worth is like, maybe you&#8217;re, you probably have sort of like less than 10 to 15 annual spend so that&#8217;s essentially how we calculate net worth these days, like how many years of spending have saved.  So if you&#8217;re below 15, then you know that the net worth curve always tend to be a straight line, because it&#8217;s dominated by salary. But then once you sort of get into get into the 25 Plus, and if you get even higher, I mean, my problem is, essentially, I spend so little that whenever people pay me money, I don&#8217;t know what to use it for. So this like, just keeps going, going up and up and up. I mean, right now, it&#8217;s like 130. And from that perspective, you know, like, volatility, or risk&#8230;risk for me is no longer volatility risk, for me is a permanent loss. Right? Maybe that&#8217;s another sort of like practitioner takeaway. These guys don&#8217;t care about volatility, they care about money that never comes back, right?  Because volatility is only really relevant if you&#8217;re like, if you&#8217;re doing research, then volatility is sort of like, sort of like a very easy way to define risk, because you can calculate, you know, it&#8217;s the standard deviation, essentially. And it&#8217;s useful if you&#8217;re, if you&#8217;re a bank, and you&#8217;re sitting in the middle between a customer and a big pool of money, because I&#8217;m here to sort of like bridge between and you have like slippage losses.  But for practical people, that&#8217;s the risk of permanent loss. So my personal strategy has tended towards becoming like a lot safer, you know, like belt and suspenders kind of stuff.\n<br/><br/>\nMy interest in investing, investing is also kind of going down. So I actually might end up just like, putting everything into a Global Fund, or something \n<br/><br/>\nI think I worry most about are the cases where someone comes in and says, I don&#8217;t care anything about investing or finance or anything, I just want sort of like a one stop solution for my post-FIRE life. I don&#8217;t know what what to call that risk&#8230;like an ignorant risk or paradigm risk?\n<br/><br/>\nBecause I mean, paradigms change. I mean, they change every 10 years. I mean, you only have to go back 10 years, look at the real estate bubble, and see how that was sort of like, in many ways in the US, not in Canada, where it didn&#8217;t pop. But here, it was many ways driven by by sort of the same dogmatic slogan based understanding that you tend to see in sort of, like, I wouldn&#8217;t say it&#8217;s like the entire FIRE movement, but there are many, many in the, in the fire movement that have had sort of like the same thing like, well, they&#8217;re not making any more land, just by the biggest house, you can, because  you&#8217;ll never get this chance again.  They&#8217;re not making any more often. Just paint the walls essentially.\n<br/><br/>\nAnd you can, you can go back and see these kinds of ideas like fail over and over and over again.  Because people change their mind.  I think it&#8217;s like a twofold I mean, you can sort of feel the two ways you can have the paradigm shift under you, and then essentially like miss the terrain. Or worse, you can keep insisting that that one strategy you learned when you&#8217;re 25 is still valid when you&#8217;re 50, right?\n<br/><br/>\nSo like, so the dominant paradigms are essentially been index investing since the 2010s is like when that exploded, and part of the reason it exploded was, of course, because interest rates were both dropped and then you had all these quantitative easing things, both in the US and in Europe. And you could actually plot like the stock market index with bands when when you have quantitative easing, the market goes up, when the easing stops, it goes flat. When it started again, it goes up again, you know, that&#8217;s not that&#8217;s, that&#8217;s not really a booming economy. That&#8217;s like, an economy, on heroin or something. I mean, that&#8217;s just bad. And then you can&#8217;t keep doing that forever. What I mean, so far, so good, right? \n<br/><br/>\nAnd if you if you sort of, if you said like this is what&#8217;s actually happening in, in sort of, like the practical world, and on Wall Street, I mean, I knew a bunch of like, value investors. That&#8217;s not what I was doing, but people doing value investing, and sort of like getting depressed. Because everything was like completely overvalued. There was like nothing to buy that made some sense, right? So they&#8217;re just sitting on piles of cash waiting and waiting and waiting. And if you&#8217;ve been waiting for 10 years, right?\n<br/><br/>\nYou can&#8217;t keep insisting that you are right and the market is wrong. I mean, you can only do that so long.  So that&#8217;s the tricky part.\n<br/><br/>\nGoing back, so you had like real estate in the 2000s. And a little bit again after it recovered, people got into it again, and now it&#8217;s called house hacking.  It&#8217;s always a new new word.\n<br/><br/>\nYou had .coms in the 90s but obviously, not anymore, right? \n<br/><br/>\nA little bit again&#8230;the five biggest companies in the s&#038;p 500, that&#8217;s 20% of the index, right? They call the giants like Facebook, Microsoft, Apple, Google, and I totally forgot one. And they&#8217;re like, 40% of the NASDAQ. How&#8217;s that for diversification? \n<br/><br/>\nAnyway, go back again&#8230;So in the 80s, it was commodities and CDs, like bank CDs, because the interest rates were so high.  You can&#8217;t get anything out of that anymore. So like a safe CD investment from the 80s would completely bomb, right. \n<br/><br/>\n70s, gold.  My uncle collected stamps. Essentially because the market flatlined, and bonds were not doing anything so people were just buying collectibles, thinking that that would sort of be the thing. \n<br/><br/>\nIn the 60s, it was like blue chips. I just want to buy the big companies, and you&#8217;ll be safe forever. And as a result of that the multiple expansion was immense. So similar to what you see today, in internet stocks, you know, we had like PE ratios above 50. So like, that would take decades for these people to actually like return a decent amount of sort of like economic profit, as opposed to just like greater-fool profit of people like buying higher and so on. \n<br/><br/>\nSo I mean, the thing is, the biggest mistake one can make is to believe that you, you know everything there is to know about investing. But sort of like you have this kind of like dogmatic mind. I&#8217;m not kind of like super insist that everybody become an expert on this. But I do think that I think the least people can do or should do is sort of like pay attention from time to time, like is index investing still a thing? And if it is, cool&#8230;just keep doing that. But if everybody around you have sort of like moved on to something else, whatever that is, maybe it&#8217;s time to start questioning whether you are still the genius you think you are right. \n<br/><br/>\n<strong>Mad Fientist:</strong> I think that&#8217;s great advice. And it seems like right now is potentially a paradigm shifting event COVID and then all the money being pumped into the economy. What are your thoughts on that? Have you have you spent any time thinking about what this means for the next decade? And what&#8217;s going to be the big thing for that? Because it does seem like this is a turning point, potentially, in how people think of investments and what the government&#8217;s ability to get involved is.\n<br/><br/>\n<strong>Jacob:</strong> Oh, well, investment wise, I haven&#8217;t really done much.  I was already like a belt and suspenders. \n<br/><br/>\nI mean, it was kind of shocking to see things dip that fast, right? That was crazy fast compared to say 2008.  2008 was sort of more like a slow grind. I lost 1% today, tomorrow I lost another percent. And after 30 days, you know, you&#8217;re just sort of getting punished every every day until you&#8217;re sick of it. And then when when the maximum number of people were sufficiently sick, it flipped, because there were no more that were willing to sell and it went up again.\n<br/><br/>\nHere, it was more like slam slam, and then suddenly way up again&#8230;it was crazy volatile.\n<br/><br/>\nSo there was like a lot of people in the futures market that just had like a field day with that. So for them it was good but for buy-and-holders, it must have been very interesting.\n<br/><br/>\nBut of course, the government immediately practically guaranteed all their corporate bonds, right. So they were dropping.  So you have like AA rated bonds, that should normally be almost like treasuries losing, I don&#8217;t know, 20-30% like over a week. I mean, that&#8217;s insane. And then they gain it just as fast, as the government comes in and backstops the whole thing.  What&#8217;s more interesting to report on COVID from the ERE perspective, because ERE was originally not intended to be some FIRE thing. It was certainly more intended to be be sort of like a resilient lifestyle, like a low resource intensive lifestyle.  So if we were to run into limits to growth in the environment, would it still be possible to live live well.  And so for me, it has always been about, highly efficient living, and how to make it resilient and not become financially independent, as much as becoming like economically dependent, like independent of the economy. And so that, essentially is like ERE at the higher level.  And if you do that, then FIRE just become a nice side effect. You know, if you have a job, people pay you money, but you don&#8217;t have anything to use it for so you just park it in a savings account, which is actually what I did myself for, like the first five years until I found that there was something called investing and the crazy idea, like using money to make more money. I mean, that was just bizarre to me. I mean, I&#8217;m an immigrant.  I&#8217;m from Denmark, where like, stock investing was not a thing, and really wasn&#8217;t.  Put money in bricks in housing, but owning stocks and bonds, that was just weird. So with COVID, you know, being independent of the economy already, there was like practically no change in the way we live here. And on the forum, we had sort of like a slight tension between what you would call like the traditional FIRE people sort of like high incomes and total belief and like comparative advantage&#8230;it&#8217;s kind of like the, I&#8217;m not gonna spend my time fixing a flat on my bicycle for $15 when I&#8217;m making like $50 an hour. So you see that attitude a lot, especially the more people earned, the less they are willing to deal with the little things.\n<br/><br/>\nAnd they suddenly realize, it doesn&#8217;t really matter I have all this money when everything is on lockdown and I can&#8217;t do anything. Whereas for sort of like the resilient system I build up and then some of the other guys that build up instead it was like wow, this is what we&#8217;ve been prepared for practically. And so there was actually a lot of shifts in sort of like the one dimensional money only consumer/producer kind of thing, towards the sort of like more systems theoretical way of integrating your production and your consumption in your personal life so you&#8217;re no longer just having money coming from this side, so you earn it here and then you buy stuff here to solve the problem.  It was more like the total solution.\n<br/><br/>\n<strong>Mad Fientist:</strong> That&#8217;s one of my favorite parts of the actual book.  And ERE is one of my favorite finance books and it&#8217;s not even really a finance book, as you said.  It&#8217;s more a philosophy book about overall life strategy and systems and yeah, the the financial independence part is a byproduct of that life but it&#8217;s the systems approach to lifestyle lifestyle design that I really enjoyed and I still think about it a lot.\n<br/><br/>\nLike when Mr. Money Mustache bought that piece of property on Main Street and had this like community thing. I thought, that&#8217;s a such an amazing idea because I&#8217;m an introverted guy but I do enjoy meeting people in my community and socializing. I was like, that&#8217;s a great idea. And now he has this place that just sort of, like promotes that. \n<br/><br/>\nAnd at the time somebody was talking about maybe starting a brewery. And I thought, oh, that would be ideal because you get the forced socialization, you&#8217;re building something, you&#8217;re building a business, which is always fun and challenging. But on the health side of things, which in your book, you talk about how the second order effects of some decisions and how it could be negative positive. And for something like a brewery, it&#8217;d be great for the community, the socialization, the challenge, the creation/creativity, things like that. But it&#8217;d be terrible for the health side of things, because I would find myself drinking more beer. \n<br/><br/>\nSo it&#8217;s definitely something that I&#8217;ve kept in mind over the years. And it really does help me make decisions. And it&#8217;s like, okay, this seems good at first but what&#8217;s the knock-on effect? So yeah, I was wondering if you could maybe talk about how you&#8217;ve used that thinking in designing your life and how that has made you really resilient for a pandemic? \n<br/><br/>\n<strong>Jacob:</strong> Yeah, I mean, so like, I almost feel like sort of like, describing the whole thing. Like, the book is very much about like, contrasting and comparing what we grew up with taking for granted, which is essentially the idea that you specialize in a job, you get an education, you specialize in a job that gives you earning power, and then you potentially measure how successful you are in terms of how high your earning power is. I mean, in the English language, we even have like expression, how much are you worth? I mean, when, when we ask that question, we want to know, like, you know, it&#8217;s the money question, practically.\n<br/><br/>\nIt&#8217;s not like how nice a person are you or what did you do for your community.  I mean, it&#8217;s really, are you making lots of money. And along the same dimension, happiness equals spending. And I mean, I don&#8217;t know if I&#8217;m, like, projecting too much, but you can see how, how FIRE kind of developed into lean FIRE and fat FIRE.  I&#8217;m obviously somewhat even more extreme than lean FIRE, but fat FIRE often sort of accuses us on the other side of like living a life without happiness because we are sacrificing so much, because spending is happiness. So I mean, it&#8217;s not surprising, from even like, from you&#8217;re like 10 years old, from the time you&#8217;re old enough to watch ads, right? I wonder when that when that happens by age three?  You do get sort of like continually reinforced that if you buy something, that increases your happiness, you get a shot of dopamine. Or if you had a problem, you pay someone, so all you need to do is earn and then you buy.  So you&#8217;re in this kind of cycle.\n<br/><br/>\nPersonal Finance when when I started with it sort of tried to step out a little bit of that. I mean, if you&#8217;re sort of into the spending equals happiness, it&#8217;s no surprise that like half of Americans end up not having any more than $400 for one emergency. Right? Which is tragic, crazy. I mean, it shouldn&#8217;t be that way, right? \n<br/><br/>\nSo like, initial personal finance then becomes about like prioritizing your spending and not just like blowing your money left and right and then trying to keep everything together with credit cards. \n<br/><br/>\nAnd people started learning how to budget you know, that&#8217;s a basic skill.  I don&#8217;t know if they teach this in schools today. They didn&#8217;t when I was young.  To a large degree, people are not taught sort of like the fundamentals of the society they live in it&#8217;s kind of like fish swimming in water, right? I mean, they&#8217;ve not discussed the water ever. So to them the water does not exist. And to a similar degree, the whole idea of earning and buying as a lifestyle is not something people see from the outside.  It&#8217;s something that they can&#8217;t see because they&#8217;re inside of it.\n<br/><br/>\nSo, in the blogging world, it&#8217;s almost like getting an education, when you get into this, from sort of being blind to the water and then getting out.\n<br/><br/>\nSo you learn to budget and prioritize. And then if you&#8217;re a little bit more advanced, you start optimizing your budgets.  Where is my money spent best or how do I get the best deal out of this. But it&#8217;s still sort looked at in isolation. Like, what is the best car here? Does this car make me happy? You know, are we getting the maximum return of my money in terms of like, my choice of driving, how do I make the best food. \n<br/><br/>\nSo it&#8217;s all sort of like seen as individual things to optimize. You want to spend money well so you have all these like Consumer Reports review. And the underpinning of all this is of course, specialization and comparative advantage, people are distinctly sort of like pushed back towards, you just got to earn more money, because you&#8217;re wasting your time if you try to learn other things.\n<br/><br/>\nYou can suspect that half of the economy is just in the, in the business of like creating problems for the other half of the economy to solve. \n<br/><br/>\nI mean, this kind of like with the brewery.  So you drink beer to become happy, but then you also become unhealthy. And then you have to take some other drug that makes you healthy again, but that drug has side effects. And now you have to take a drug to remove those side effects and perhaps pay someone to administrate that whole business. \n<br/><br/>\nSo this is kind of where the ERE book, where that philosophy comes in, because first of all, it kind of describes this screwed up system we&#8217;re living in. So it kind of like takes the fish out of the water. Look fish, you&#8217;re swimming in this pool of water.\n<br/><br/>\nSo I introduced the concept of the Renaissance man or Renaissance person, which was sort of like an early idea of the Enlightenment.  Today, it&#8217;s more like a general polymath, I think would be the right word.\n<br/><br/>\nBut essentially, the idea that humans have potential to become many different things, and you should strive to develop in that way. You can kind of contrast it with today where any kind of education development practically stops after college. But you should also development in many other directions, like you should be healthy, should to be able to sing, dance, play an instrument, create art, all kinds of things. \n<br/><br/>\nSo essentially, in the Renaissance idea was the view that a person should be skilled in many things, which is like completely different than the industrial idea that you should be like skilled, very skilled but in only one thing. \n<br/><br/>\nSo once you&#8217;re skilled in many things, then that essentially implies that now you can start doing many things, you can do different things, instead of paying someone else to do for you. \n<br/><br/>\nThat&#8217;s kind of what you described with MMM&#8217;s mainstreet operation or the brewery.\n<br/><br/>\nEverything you do has some outcomes, and it always has more than one outcome. There&#8217;s always a side effect, some where you got to sort of ask yourself, is that a productive thing or a bad thing. I refer to those as goals. So like, for instance, like if you had a brewery and you make beer, drink beer, then that has the goal of like making you drunk or whatever. But it also has the goal of making you unhealthy. So goal does not imply anything positive&#8230;it is simply an outcome.\n<br/><br/>\nAnd so the systems theory comes in when you start connecting these goals. So instead of just optimizing single points, like which is the best electric car, you begin to consider which side effects does this have. Are there side effects to the side effects? And do I do something that&#8217;s productive, but also counterproductive.\n<br/><br/>\nAnd so everything is then arranged and it&#8217;s almost kind of like&#8230;so a system is essentially like a network.  That&#8217;s probably the best way to describe that.  So in a network you have like nodes and connections.  You have computers and cables between them. So it&#8217;s like a network and systems thinking essentially means looking beyond the given node or the given action to see what impact does this have on the system itself?\n<br/><br/>\nAnd so systems it&#8217;s not no longer the money flowing around like it would be on sort of like the one dimensional linear earn-spend thing.  It&#8217;s also like happiness, health, meaning, skills.  So I call it the web of goals, essentially, but could also call it the net of goals but the reason I call it a web is that if you look at it almost like if a fisherman&#8217;s net or web for catching something. Actually a spider&#8217;s web is probably a better example. If it breaks in some part, like you fail to reach a goal, like seeing back when I was trying to become like a quant in 2007. And I was reading all these like high finance, like complicated finance, how to price options and all that kind of stuff.  But I failed at doing that. So that goal was essentially eliminated. But because it was aligned up with other productive goals, it meant that I could still use that knowledge to invest for myself and not like, you know, do harm to my own financial well being. \n<br/><br/>\nSo in that sense, the web of goals is extremely resilient. You can cut parts out of it, and it still works. \n<br/><br/>\nWhereas if you&#8217;re sort of like a specialist, who consumes&#8230;if you lose your ability to consume, then suddenly you have nothing, right? That was like the COVID experience, right? Oh, my God, suddenly, I have to learn how to cook my own food, because I can no longer go out seven days a week. That happened to a lot of people, right? I mean, there are people who eat out every single day, they literally cannot fry an egg. I&#8217;m not exaggerating.\n<br/><br/>\nAnd the other completely different perspective in the book is, of course, going back to the idea where spending equals happiness&#8230;to me spending money is bad in that sense because that implies a poorly designed system.  For me, spending money is resolving friction in the system. It&#8217;s because something is not moving naturally. It&#8217;s not well thought out. So I mean, I&#8217;m not impressed when people say, &#8220;Well, I spend $100,000 a year.&#8221; It&#8217;s like, wow, you must have a lot of problems with your system!\n<br/><br/>\nAnd that&#8217;s essentially the book in a nutshell. And then there&#8217;s like, maybe 20 pages on the math in case you want to declare financial independence. And that&#8217;s mainly because I got a lot of pushback, &#8220;You can&#8217;t become financially independent in five years if you don&#8217;t have a million dollars.&#8221; \n<br/><br/>\n<strong>Mad Fientist:</strong> So to go back to the system, the web of goals, and the systems you have in place&#8230;your systems must have been so dialed in, even back in 2011, just because of the amount that you guys were able to spend per year means that you had removed all the inefficiencies and were able to really just not spend that much. Because I think back in the day, I think it was when you were in San Francisco, which is thought of as a very expensive city. And yet you guys were only spending something like $7,000 a year. \n<br/><br/>\nHave you felt like your system has improved even since then? And I&#8217;m sure it&#8217;s a constant thing that you&#8217;re working on and adjusting.  And has your spending increased at all over the years or it has it actually decreased since 2011?\n<br/><br/>\n<strong>Jacob:</strong> It has changed.  Compared to like a normal consumer, our budget looks completely different. And, like we spent like 60% of our money on unavoidable stuff like real estate or health insurance.  We cannot we cannot eliminate it. \n<br/><br/>\nSo if we move like west of the Mississippi, where real estate taxes are a lot lower, we will be spending even less than $7,000 per person. So like two adults $14,000.\n<br/><br/>\nThe problem also when you go back for 25 years, inflation becomes a factor.  If I spent like $6,000 in 2000, I would not be spending $6,000 today.  I&#8217;m getting old enough where this seems to become a factor. \n<br/><br/>\nBut on an absolute level, yeah, about $7,000. We were not in San Francisco, we were on on the other side of the bay.  We were on the East Bay.\n<br/><br/>\nBut we had to rent a house there, until we got the RV, and that exceeded $7,000. But otherwise, since I moved away from home, it&#8217;s always been about that low. So I&#8217;d essentially kept my student stipend budget ever since then, which is, which is a lot easier than if you got used to living at $50,000 a year, $100,000 a year, then going the other way is a lot harder than not going up in the first place.\n<br/><br/>\nWhat has changed is the system. So the web of goals changed as well. I mean, we&#8217;ve tried many different ways to live on $7,000 at this point.\n<br/><br/>\n<strong>Mad Fientist:</strong> So what does life look like since you stopped working as a quant? What have been some of the things that you&#8217;ve been interested in learning? Like you mentioned, the Renaissance man idea where you&#8217;re constantly learning new things and developing new skills&#8230;What&#8217;s been keeping you busy since the quant days finished?\n<br/><br/>\n<strong>Jacob:</strong> Yeah, so we bought a light fixer upper. So I mean, that&#8217;s another thing where sort of like growing up with a wide assortment of skills.  Can they take down a wall and put it up again? And in my case, I came in with absolutely nothing. I mean, I can just about like, drill a hole in the wall.  That&#8217;s my childhood education. So there was a lot of figuring this stuff out.  I renovated our bathroom, I built new cabinets. So I&#8217;ve been into furniture making for quite a while. So we fixed up the entire bathroom for 50 bucks, I think. So it&#8217;s a learning all these little things. And then recently, I&#8217;ve started like building clocks out of plywood.\n<br/><br/>\n<strong>Mad Fientist:</strong> Rereading the book recently, to prepare for this interview&#8230;I read it way back when it got released and then I read it again, when I was gonna ask you to be on the podcast five years ago, and then I wimped out and didn&#8217;t ask you. So then I read it again, in anticipation for this.  And you predict a lot of things and they seem to have been coming true in lots of different ways. So my two questions&#8230;is there anything that&#8217;s changed that you wish you had written in the book? Has your thinking changed in any ways that you think, &#8220;I actually should have changed that&#8221;? And also, where do you think these ideas go in the future? \n<br/><br/>\n<strong>Jacob:</strong> Yeah, so it kind of goes back to that thing about working in finance, becoming sort of more neutral in attitude or seeing more perspectives..Definitely when I wrote it, I had one perspective, which was my perspective. And if I wrote it today, it would be less edgy, it would be more understanding of other perspectives. So it&#8217;s not just like, these guys are crazy.  I think there was there&#8217;s definitely been some growing up in that sense.  Also, from interacting with different people, I&#8217;ve become lot more cognizant of different perspectives and limits and more understanding in terms of&#8230;I mean, back then I was like, &#8220;Well, here&#8217;s the book, you just read it, and then you change your life&#8221;.\n<br/><br/>\nNow I realize it&#8217;s a long process. And it&#8217;s not from here to here&#8230;it&#8217;s more like sort of like a step. \n<br/><br/>\nAnd sometimes people might be sitting on the same level for a long time and be fine with it and then suddenly have some kind of epiphany. But that is not necessarily an epiphany that goes all the way to sort of like what I consider the full ERE.  It might just be a next step.  So we&#8217;ve sort of like mapped out the pedagogical challenges of this stuff. \n<br/><br/>\nIn terms of the technical stuff, I&#8217;m sometimes amazed at how smart that book was. I don&#8217;t know if I can write it again like that. Since you go back and you read some things like oh, this is really good.\n<br/><br/>\nSo it&#8217;s kind of sounds a little stupid because I think I should be able to write a better book now but I really doubt myself that I can do that. \n<br/><br/>\nI think being more understanding of different perspective kind of tends to clutter the mind. Instead of just presenting one perspective, there&#8217;s a lot more, &#8220;But what if?&#8221; and &#8220;What about this case?&#8221; and &#8220;What about that case?&#8221; sort of like taking up my mind space these days.\n<br/><br/>\nI wouldn&#8217;t say I have particularly more I experience and sort of like the pure technical sense but I have talked to a lot more people since then. So I have their perspective. And of course, one of the huge problems back then was that there will not be many examples to draw on. So it all fell on me, right? I kind of realized that I&#8217;m a somewhat unusual or weird person compared to&#8230;if you pick some someone at random, right? I mean, for example, we don&#8217;t have children. So a lot of people will say, &#8220;Well, I mean, that&#8217;s easy for him, because he doesn&#8217;t have children&#8221;. But that&#8217;s not the best way to learn&#8230;to just try to copy someone and try to be like them. I mean, it&#8217;s better to understand why they&#8217;re doing what they&#8217;re doing, rather than who they are, what they&#8217;re doing, and then try to do the exact same thing. \n<br/><br/>\n<strong>Mad Fientist:</strong> Exactly. And that&#8217;s why that&#8217;s why the book is so good. And I think maybe why it&#8217;s so timeless, and why it was just as enjoyable reading over the past few months as it was, you know, way back in the in the day, in 2011, because it&#8217;s more like&#8230;I think even mentioned in the book, it&#8217;s not a to-do list or a guide, or even a map, it&#8217;s more a philosophy that you can use to make better decisions, to make your own map and figure out your own to-do lists based on that.\n<br/><br/>\n<strong>Jacob:</strong> I was I was very deliberate, trying to make it as timeless as possible.  Or as non-timely as possible. This is also why there&#8217;s no sort of deep investment &#8211; deep is a very terrible word, it is actually quite deep in terms of investment insights &#8211; But there&#8217;s no details.  So there&#8217;s no 10 step to it, just buy this fund and that fund and that fund, and then then you&#8217;re good to go.\n<br/><br/>\nOne of one of my quirky hobbies is to go into a thrift store and then like pick out popular investment books from like the 90s. And the 80s. And the 70s, if I can find them.\n<br/><br/>\nSomething like from the 80s&#8230; how to get rich with CDs.  And I didn&#8217;t want to have written a book like that. Give someone some advice, and then turns out to be terrible like 10-20 years later. \n<br/><br/>\n<strong>Mad Fientist:</strong> Well, we&#8217;re coming up to over an hour already, which is crazy. So I don&#8217;t want to take up too much of your time, but if people want to get in touch for any reason, is the forum, still probably the best way to post questions and get answers? \n<br/><br/>\n<strong>Jacob:</strong> Yeah, the forum is where the action is. I mean, it&#8217;s, at least some people have figured out the blog has been on like, auto rotation for like, eight, nine years now. I don&#8217;t really write anything, but it&#8217;s still presenting new stuff.\n<br/><br/>\nBut I mean, the forum is kind of like the grad school of financial independence, if you want to put it that way. It&#8217;s not really a place where you go and ask, How do I how do I set up a brokerage account or something like that?\n<br/><br/>\n<strong>Mad Fientist:</strong> Well, this has been fantastic, Jacob. Like I said at the beginning, you&#8217;ve you&#8217;ve impacted my life in more ways than I would have even imagined it would have impacted me when I read that article way back in the day. So, thanks for taking the time to do this. Thanks for writing. And writing the book. \n<br/><br/>\nI usually ask all my guests this final question&#8230;what&#8217;s one piece of advice you&#8217;d give to somebody who wants to achieve financial independence? And it could be about anything. So I&#8217;d be interested to hear what you say. \n<br/><br/>\n<strong>Jacob:</strong> I&#8217;m the worst person to ask that question. I would say just find someone who motivates you. You can only learn from someone who&#8217;s slightly ahead of you and not someone who&#8217;s far ahead of you. But once you&#8217;re no longer learning anything from a given teacher, then it&#8217;s time to move on to the next teacher. I think the best advice is to find the right teacher.\n<br/><br/>\n<strong>Mad Fientist:</strong> And it&#8217;s a good time for that. That&#8217;s one big benefit of this explosion in people writing and talking about FIRE&#8230;you can find that next step. \n<br/><br/>\nWell, thank you so much, Jacob. This has been an absolute honor to speak to you after all these years. So thanks again for coming on the show. And yeah, hopefully meet up with you in real life one day and we can chat about more stuff \n<br/><br/>\n<strong>Jacob:</strong> Once the pandemic is over.\n<br/><br/>\n<strong>Mad Fientist:</strong> Absolutely.  Thanks again, I&#8217;ll talk to you soon. Take care.\n</div>\n\n\n\n\n<h2>Related Post</h2><div><a href='https://www.madfientist.com/mr-money-mustache-interview/' target='_blank'><div class='post_card'><div class='post_card_text'><h3 style='color:#399da8;'>Mr. Money Mustache - Early Retirement Made Easy</h3><p class='post_card_excerpt'>Mr. Money Mustache shares his financial independence and early retirement secrets in an interview for the Financial Independence Podcast!</p></div><div class='post_card_image'><img src='https://www.madfientist.com/wp-content/uploads/2012/05/mr-money-mustache-interview.jpg' style='border-radius:7px;'/></div></div></a></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/early-retirement-extreme-interview/\">Early Retirement Extreme &#8211; A Systems Approach to Lifestyle Design</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "wfw:commentRss": "https://www.madfientist.com/early-retirement-extreme-interview/feed/",
  "slash:comments": 26,
  "enclosure": ""
}