{
  "guid": "2cc5d100-2e8f-49ed-9f18-ff7133445c1f",
  "title": "Concussions with Leonard Marshall",
  "description": "<p>How is CTE different from a concussion?  Neil deGrasse Tyson and co-hosts Chuck Nice and Gary O’Reilly discuss concussions and chronic traumatic encephalopathy, with former NFL lineman, Leonard Marshall, and neuroscientist, Heather Berlin, PhD.</p><p>NOTE: StarTalk+ Patrons can watch or listen to this entire episode commercial-free.</p><p>Thanks to our Patrons Walter Johnson, Ali AlWaheedy, Armen Gevorgyan, Jenny K Leasure, WIGwigWIG, Denny, MaKayla A Holloway, Anna Dupre-Whiting, Allain Brideau, and David for supporting us this week.</p><p>Photo Credit: Garpenholm, CC BY-SA 3.0, via Wikimedia Commons</p>\n",
  "pubDate": "Fri, 27 May 2022 07:00:00 +0000",
  "author": "feed@startalkradio.net (Neil deGrasse Tyson, Chuck Nice, Gary O'Reilly, Leonard Marshall, Heather Berlin)",
  "link": "https://www.startalkradio.net/?sfid=22493&_sft_category=startalk-radio",
  "content:encoded": "<p>How is CTE different from a concussion?  Neil deGrasse Tyson and co-hosts Chuck Nice and Gary O’Reilly discuss concussions and chronic traumatic encephalopathy, with former NFL lineman, Leonard Marshall, and neuroscientist, Heather Berlin, PhD.</p><p>NOTE: StarTalk+ Patrons can watch or listen to this entire episode commercial-free.</p><p>Thanks to our Patrons Walter Johnson, Ali AlWaheedy, Armen Gevorgyan, Jenny K Leasure, WIGwigWIG, Denny, MaKayla A Holloway, Anna Dupre-Whiting, Allain Brideau, and David for supporting us this week.</p><p>Photo Credit: Garpenholm, CC BY-SA 3.0, via Wikimedia Commons</p>\n",
  "enclosure": "",
  "itunes:title": "Concussions with Leonard Marshall",
  "itunes:author": "Neil deGrasse Tyson, Chuck Nice, Gary O'Reilly, Leonard Marshall, Heather Berlin",
  "itunes:image": "",
  "itunes:duration": "01:00:35",
  "itunes:summary": "How is CTE different from a concussion?  Neil deGrasse Tyson and co-hosts Chuck Nice and Gary O’Reilly discuss concussions and chronic traumatic encephalopathy, with former NFL lineman, Leonard Marshall, and neuroscientist, Heather Berlin, PhD.",
  "itunes:subtitle": "How is CTE different from a concussion?  Neil deGrasse Tyson and co-hosts Chuck Nice and Gary O’Reilly discuss concussions and chronic traumatic encephalopathy, with former NFL lineman, Leonard Marshall, and neuroscientist, Heather Berlin, PhD.",
  "itunes:keywords": "brain scan, tackle, neuronal death, white matter, concussion, star talk, clf, als, neuroscience, eagles, diagnosis, microtubules, force, leonard marshall, david duerson, junior seau, mri, heading, nfl, startalk, energy, cognition, football, anne mckee, when the cheering stops, chronic traumatic encephalopathy, giants, tau protein, health insurance, gray matter, sled head, robert cantu, soccer, lamar leachman, neurosurgery, cyril wecht, chuck nice, gary o’reilly, autopsy, alsheimers, pet scan, bennet omalu, julian bailes, heather berlin, neil degrasse tyson, brain injury, cte, ding",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:episode": 13,
  "itunes:season": 13
}