{
  "title": "Augmenting photometric redshift estimates using spectroscopic nearest neighbours. (arXiv:2211.01901v1 [astro-ph.CO])",
  "link": "http://arxiv.org/abs/2211.01901",
  "description": "<p>As a consequence of galaxy clustering, close galaxies observed on the plane\nof the sky should be spatially correlated with a probability inversely\nproportional to their angular separation. In principle, this information can be\nused to improve photometric redshift estimates when spectroscopic redshifts are\navailable for some of the neighbouring objects. Depending on the depth of the\nsurvey, however, such angular correlation is reduced by chance projections. In\nthis work, we implement a deep learning model to distinguish between apparent\nand real angular neighbours by solving a classification task. We adopt a graph\nneural network architecture to tie together the photometry, the spectroscopy\nand the spatial information between neighbouring galaxies. We train and\nvalidate the algorithm on the data of the VIPERS galaxy survey, for which\nSED-fitting based photometric redshifts are also available. The model yields a\nconfidence level for a pair of galaxies to be real angular neighbours, enabling\nus to disentangle chance superpositions in a probabilistic way. When objects\nfor which no physical companion can be identified are excluded, all photometric\nredshifts' quality metrics improve significantly, confirming that their\nestimates were of lower quality. For our typical test configuration, the\nalgorithm identifies a subset containing ~75% of high-quality photometric\nredshifts, for which the dispersion is reduced by as much as 50% (from 0.08 to\n0.04), while the fraction of outliers reduces from 3% to 0.8%. Moreover, we\nshow that the spectroscopic redshift of the angular neighbour with the highest\ndetection probability provides an excellent estimate of the redshift of the\ntarget galaxy, comparable or even better than the corresponding template\nfitting estimate.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Tosone_F/0/1/0/all/0/1\">F. Tosone</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Cagliari_M/0/1/0/all/0/1\">M.S. Cagliari</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Guzzo_L/0/1/0/all/0/1\">L. Guzzo</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Granett_B/0/1/0/all/0/1\">B.R. Granett</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Crespi_A/0/1/0/all/0/1\">A. Crespi</a>"
}