{
  "title": "24: Andrea Peron Interview | Halloween Extra",
  "link": "https://audioboom.com/posts/8184628",
  "itunes:episode": 24,
  "itunes:title": "Andrea Peron Interview | Halloween Extra",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2788,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>You know her story from the books House of Darkness, House of Light, and from the movie The Conjuring. Andrea Perron has lived a life, unlike most others. Today we catch up with her to discuss what it was like revisiting the infamous house with her family after being away for so many years.  The feelings and emotions that overtook her, and the dark feelings that overtook some of her sisters.  We also dive into a conversation about how the global pandemic has affected our spiritual world and the massive paradigm shifts that we are currently going through, how it may turn out, and what may be able to lead us to a connective idea of “one.” All that and more today on The Grave Talks.<br>\n<br>\n<br>\n<a href=\"http://www.patreon.com/thegravetalks\"><strong>PART 2 - AVAILABLE TO GRAVE KEEPERS ONLY - LISTEN HERE</strong></a> <strong>In part two of our interview, </strong><a href=\"http://www.patreon.com/thegravetalks\"><strong>available only to Grave Keepers</strong></a><strong>, we discuss:<br>\n</strong><br>\n\n</div>\n<ul>\n<li>Did the house still have the same feeling that it did when Andrea returned to the Conjuring home after 2014?<br>\n<br>\n\n</li>\n<li>What happened to Andrea’s sister Cindy when they returned to the house?<br>\n<br>\n\n</li>\n<li>Why does have Andrea have positive feelings about the house while other family members do not?<br>\n<br>\n\n</li>\n<li>How does Andrea think the global pandemic has affected the world of spirits and the supernatural?<br>\n<br>\n\n</li>\n<li>What is Andrea’s take on the mass number of UFOs that people see around the world currently in history?<br>\n<br>\n\n</li>\n<li>What memory did an encounter with the supernatural bring back to Andrea’s mind late one night, outside under the stars?<br>\n<br>\n\n</li>\n</ul>\n<div><br>\n</div>\n<ul>\n<li>As a Grave Keeper, for $5 per month you will get:</li>\n<li>\n<strong>Access to every </strong><a href=\"http://www.thegravetalks.com/category/podcast-episodes/\"><strong>episode</strong></a><strong> of our show, AD-FREE – MONTHS BEFORE THEY GO PUBLIC.</strong>\n</li>\n<li><strong>Access to every EXCLUSIVE PART 2 episode of our show for Grave Keeper Only!</strong></li>\n<li><strong>Access to submit questions to upcoming guests of our show.</strong></li>\n<li><strong>The “good feeling” knowing that you are keeping this show alive (It really does feel good!)</strong></li>\n</ul>\n<div>Listen to part two of this interview and get exclusive access to HUNDREDS of bonus episodes at <a href=\"http://www.patreon.com/thegravetalks\">http://www.patreon.com/thegravetalks</a>\n</div>\n",
  "pubDate": "Sun, 30 Oct 2022 20:00:00 +0000",
  "guid": "tag:audioboom.com,2022-10-30:/posts/8184628",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}