{
  "id": "yt:video:VJ372iHsExM",
  "yt:videoId": "VJ372iHsExM",
  "yt:channelId": "UCBH5VZE_Y4F3CMcPIzPEB5A",
  "title": "The Labor Market Is Still Intact",
  "link": "",
  "author": {
    "name": "Real Vision Finance",
    "uri": "https://www.youtube.com/channel/UCBH5VZE_Y4F3CMcPIzPEB5A"
  },
  "published": "2022-11-04T20:42:19+00:00",
  "updated": "2022-11-05T11:30:58+00:00",
  "media:group": {
    "media:title": "The Labor Market Is Still Intact",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "U.S. stocks opened higher but drifted lower through the trading day, digesting an October nonfarm payrolls report that showed a still-strong labor market in the aftermath of Federal Reserve Chair Jerome Powell’s forceful rejection of “pivot” talk earlier this week and ahead of crucial midterm elections next week. Traders are now pricing in a 5.25% peak policy rate via the June 2023 swap contract. “I don’t think this changes anything in the Fed’s calculation,” noted Peter Boockvar in response to the jobs report, “but I do believe the trend in the unemployment rate is now going higher and will be 4%-plus soon.” Boockvar, the chief investment officer of Bleakly Advisory Group, joins Andreas Steno Larsen for today’s Daily Briefing to talk about  when the Fed might finally change, or at least pause, its current policy path and the implications of Tuesday’s voting in the U.S. We also hear from Alexander Stahel about why U.S. immunity to the global energy crisis is an illusion. Watch the full conversation featuring Alexander Stahel and Andreas Steno Larsen here: https://rvtv.io/3WzREk0. And we want to hear from you too – please share your questions, comments, and suggestions!\n\nEditor’s Note: Our live chat feature will be unavailable for four to six weeks as we upgrade our video player technology. We apologize for the temporary loss of function. But we assure you the upgrade will more than justify the wait. In the meantime, we will be monitoring the comments section. So, in addition to conversing with your fellow community members, please share your questions there.\n\n\n\nThanks for watching The Daily Briefing. Sign up here with your email address to have every episode delivered to your inbox Monday-Friday: http://rvtv.io/DailyBriefEmail\n\nAbout Real Vision™:\nReal Vision™ is where you can gain an understanding of the complex world of finance, business and the global economy with real in-depth analysis from real experts. \n\nConnect with Real Vision™ Online:\nTwitter: https://rvtv.io/twitter\nInstagram: https://rvtv.io/instagram\nFacebook: https://rvtv.io/facebook\nLinkedin: https://rvtv.io/linkedin \n\nThe Labor Market Is Still Intact\n\nDisclaimer:\nThis is pretty obvious, but we should probably say it anyway so that there is absolutely no confusion…The material in REAL VISION GROUP video programs and publications {collectively referred to as “RV RELEASES”} is provided for informational purposes only and is NOT investment advice. The information in RV RELEASES has been obtained from sources believed to be reliable, but Real Vision and its contributors, distributors and/or publisher, licensors, and their respective employees, contractors , agents, suppliers and vendors { collectively, “Affiliated Parties”} make no representation or warranty as to the accuracy, timeliness or completeness of the content in RV RELEASES. Any data included in RV RELEASES are illustrative only and not for investment purposes. Any opinion or recommendation expressed in RV RELEASES is subject to change without notice. RV Releases do not recommend, explicitly nor implicitly, nor suggest or recommend any investment strategy. Real Vision Group and its Affiliated Parties disclaim all liability for any loss that may arise (whether direct indirect, consequential, incidental, punitive or otherwise) from any use of the information in RV RELEASES. Real Vision Group and its Affiliated Parties do not have regard to any individual’s, group of individuals’ or entity’s specific investment objectives, financial situation or circumstance. RV RELEASES do not express any opinion on the future value of any security, currency or other investment instrument. You should seek expert financial and other advice regarding the appropriateness of the material discussed or recommended in RV RELEASES and should note that investment values may fall, you may receive less back than originally invested and past performances is not necessarily reflective of future performances. Well that was pretty intense! We hope you got all of that – now stop reading the small print and go and enjoy Real Vision.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}