{
  "title": "China orders construction of state-run canteens in self-contained community hubs",
  "description": "Local one-stop shop services will boost state control over food supply, and could be linked to war planning.",
  "link": "https://www.rfa.org/english/news/china/canteens-11042022113231.html",
  "guid": "https://www.rfa.org/english/news/china/canteens-11042022113231.html",
  "author": "By Gu Ting and Jane Tang for RFA Mandarin, Jojo Man for RFA Cantonese",
  "media:content": {
    "media:description": "State canteens have been popping up in residential compounds across Hunan, Hubei, Shandong and Yunnan provinces since July, often run and funded by neighborhood committees.",
    "media:credit": "RFA screenshot from video"
  },
  "content:encoded": "\n        <p><span style=\"font-weight: 400;\">The Chinese Communist Party under Xi Jinping is accelerating a return to the state-run economics of the Mao era, with local governments and neighborhoods ordered to build self-contained community depots to serve residential compounds in time of need, experts told RFA in recent interviews.</span></p>\n<p><span style=\"font-weight: 400;\">The ministries of housing and civil affairs have ordered residential communities in pilot areas to build self-contained service depots in residential compounds offering convenience stores, vegetable stalls, state-run canteens, mail and express delivery service facilities, hair salons, laundry shops, pharmacies, maintenance points, and housekeeping services.</span></p>\n<p><span style=\"font-weight: 400;\">If rolled out nationwide, the move would effectively make it far easier to confine people to their homes, whether due to Chinese leader Xi Jinping's zero-COVID policy or other national contingencies like war, natural disaster or civil unrest.</span></p>\n<p><span style=\"font-weight: 400;\">Any grouping of 100 households must have a comprehensive service hub of at least 30 square-meters (325 square-feet) under the pilot plan, which will be implemented by local governments and district and neighborhood committees.</span></p>\n<p><span style=\"font-weight: 400;\">Efforts must be made to ensure that residential compounds all have access to community hospitals, schooling, nursing homes, and state canteens, newly built if necessary, within 15 minutes of people's homes, a Nov. 1 report on the official Chinese government website said.</span></p>\n<p><span style=\"font-weight: 400;\">State-run \"community canteens\" are already starting to appear, with a social media video of one in the Fengqing residential community in the central city of Wuhan showing people lining up to buy mass-produced meals.</span></p>\n<p><span style=\"font-weight: 400;\">\"I'm here to taste the kind of fare on offer at a state-run canteen,\" the presenter says to camera, before tucking into a bowl of rice with various other dishes in colorful bowls on a tray.</span></p>\n<p><span style=\"font-weight: 400;\">The memory of state-run canteens and state stores under the All China Federation of Supply and Marketing Cooperatives has made many older people in China uneasy with the break with the market-reform era of Deng Xiaoping, which followed the death of Mao Zedong in 1976.</span></p>\n<p><span style=\"font-weight: 400;\">\"We suffered under the planned economy, and it's only now, under the market economy, that we finally have enough to eat,\" Jiangsu-based current affairs commentator Zhang Jianping told RFA. \"Barely have we eaten our fill, and it's back to the planned economy again.\"</span></p>\n<p><span style=\"font-weight: 400;\">\"To be honest, we all have a sense of dread ... People are also speculating whether this means there is going to be a war,\" he said. \"War would be the only reason for a return to the planned economy, which is obviously a kind of regression.\"</span></p>\n<p><span style=\"font-weight: 400;\">Hunan current affairs commentator Li Ang agreed.</span></p>\n<p><span style=\"font-weight: 400;\">\"The old planned economy and [attempts at] socialist self-sufficiency are still fresh in our memories,\" Li said. \"We experienced all of that when we were kids.\"</span></p>\n<p><span style=\"font-weight: 400;\">\"It's a clear demonstration of their determination in the face of their belief in the decoupling from Western civilization, in the wake of the 20th party congress,\" he said.</span></p>\n<figure><img alt=\"ENG_CHN_StateCanteens_11042022.2.jpg\" class=\"image-richtext image-inline\" src=\"https://www.rfa.org/english/news/china/canteens-11042022113231.html/eng_chn_statecanteens_11042022-2.jpg/@@images/2b217538-3903-46e3-b0ec-c5d6fd5ccef1.jpeg\" title=\"ENG_CHN_StateCanteens_11042022.2.jpg\"/>\n<figcaption>A newly built residential canteen in Wuhan, China. Credit: RFA screenshot from video</figcaption>\n</figure>\n<p><strong>Looking ahead to 'a country at war'</strong></p>\n<p><span style=\"font-weight: 400;\">State canteens have been popping up in residential compounds across Hunan, Hubei, Shandong and Yunnan provinces since July, often run and funded by neighborhood committees, and offering more affordable meals than commercial restaurants.</span></p>\n<p><span style=\"font-weight: 400;\">They have been particularly popular with people on a low income, such as the elderly.</span></p>\n<p><span style=\"font-weight: 400;\">\"Back then, they built canteens on a large scale to make economies of scale, and also to minimize food waste,\" current affairs commentator Ma Ju told RFA. \"They figured that having only a few people in any place doing the cooking would free up other laborers, which could improve productivity.\"</span></p>\n<p><span style=\"font-weight: 400;\">\"Today's large-scale canteen construction feels more like we're looking ahead to being a country at war.\"</span></p>\n<p><span style=\"font-weight: 400;\">However, centralizing canteens also politicizes food, and who gets to eat it, Ma said.</span></p>\n<p><span style=\"font-weight: 400;\">\"Building canteens is also about controlling people through food ... and associating the Communist Party in people's minds with getting fed,\" he said. \"The purpose is to enable them to impose emergency measures [on the population], anywhere and at any time.\"</span></p>\n<p><span style=\"font-weight: 400;\">Both state canteens and supply and marketing co-ops also </span><a href=\"https://www.rfa.org/english/women/li-shuxian-04272012104245.html\"><span style=\"font-weight: 400;\">evoke memories</span></a><span style=\"font-weight: 400;\"> from the 1970s and 1980s of being asked for food rationing tickets limiting the amount of rice, oil and other foods a family could buy in a week, with the neighborhood committees in charge of handing these over to residents.</span></p>\n<p><span style=\"font-weight: 400;\">Lai Rongwei, assistant professor at the General Education Center of Longhua University of Science and Technology, agreed that the Chinese Communist Party is looking to maintain social stability by offering a \"one-stop shop\" to serve people locally, and to exert collective controls over them at the same time.</span></p>\n<p><span style=\"font-weight: 400;\">\"Put simply, this is about controlling resources,\" Lai told RFA. \"On the supply side, they will be looking to centralize all agricultural production, similar to the People's Communes before the [Deng market reforms].\"</span></p>\n<p><strong>'Decoupling' from the global economy</strong></p>\n<p><span style=\"font-weight: 400;\">Analysts told RFA in recent interviews that China is </span><a href=\"https://www.rfa.org/english/news/china/state-10312022122620.html\"><span style=\"font-weight: 400;\">quietly rebooting a Mao-era institution</span></a><span style=\"font-weight: 400;\"> that once functioned as a pillar of the socialist command economy to prepare for future \"decoupling\" from the global economy, pointing to the elevation of supply and marketing co-ops chief Liang Huiling to the ruling party's Central Committee last month. </span></p>\n<p><span style=\"font-weight: 400;\">Wu Chien-chung, associate professor at the National Taiwan Ocean University, agreed that Beijing could be planning for war.</span></p>\n<p><span style=\"font-weight: 400;\">\"It remains to be seen whether local governments ... are capable of implementing this thinking from central government, which wants to store grain to prepare for war,\" Wu told RFA. </span></p>\n<p><span style=\"font-weight: 400;\">Former top Communist Party aide Bao Tong </span><a href=\"https://www.rfa.org/english/commentaries/baotong/freedom-12202013190532.html\"><span style=\"font-weight: 400;\">warned in an essay</span></a><span style=\"font-weight: 400;\"> written to mark Mao Zedong's centenary in 2020: \"Markets, just like history itself, can move backwards as well as forwards, and there is always a danger of regression under a great leader flying the banner of honor and right thinking.\" </span></p>\n<p><span style=\"font-weight: 400;\">\"The destruction of the markets was among the most prominent of Mao's tyrannies,\" wrote Bao, who spent seven years in prison after the fall of his political mentor Zhao Ziyang in the wake of the 1989 Tiananmen Square protests, and remains under close surveillance in Beijing.</span></p>\n<p><span style=\"font-weight: 400;\">While the rebooted supply and marketing cooperative stores look more like a modern supermarket than the general stores of the 1970s and 1980s, many older people in China still remember rationing -- the side-effect of a top-down, command economy.</span></p>\n<p><span style=\"font-weight: 400;\">\"I remember there was a building for the supply and marketing co-op, but they didn't let just anyone go in and buy stuff,\" Beijing-born economist Li Hengqing told RFA. \"You had to have special ration tickets to buy oil, rice, meat and many other items.\"</span></p>\n<p><span style=\"font-weight: 400;\">\"Nobody wants to go back to that,\" Li said.</span></p>\n<p><span style=\"font-weight: 400;\">“There wasn't any choice of products, and the attitude of the staff was generally very bad,\" he said. </span></p>\n<p><span style=\"font-weight: 400;\">\"I can still remember trying to buy meat and them refusing to give me any, because they were keeping it for someone they knew, or for one of the leaders. That was [typical of] state-owned enterprises.\"</span></p>\n<p><em><strong>Translated and edited by Luisetta Mudie.</strong></em></p>\n        ",
  "pubDate": "Fri, 04 Nov 2022 13:19:07 -0400"
}