{
  "title": "Why can some people speak dozens of languages? with Ev Fedorenko, PhD",
  "itunes:title": "Why can some people speak dozens of languages? with Ev Fedorenko, PhD",
  "pubDate": "Wed, 22 Jun 2022 10:30:00 +0000",
  "guid": "624a7f9c-d13d-4f11-9a43-9418b9e6290f",
  "link": "http://sopapa.libsyn.com/why-can-some-people-speak-dozens-of-languages-with-ev-fedorenko-phd",
  "itunes:image": "",
  "description": "<p>For those of us who speak only one language, the idea of learning twenty or thirty sounds impossible. But there are “hyperpolyglots” who have managed this remarkable feat. Evelina Fedorenko, PhD, of the Massachusetts Institute of Technology, discusses what sets polyglots apart and what scientists might learn from studying them. She also discusses how language is processed in the brain, why it’s so much easier for kids to learn languages than adults, the relationship between language and thought and how we can think without language, and more.<br /> <br /> <strong>Links</strong><br /> <br /> <a href=\"https://mcgovern.mit.edu/profile/ev-fedorenko/\">Ev Fedorenko, PhD</a><br /> <a href= \"https://www.apa.org/news/podcasts/speaking-of-psychology\">Speaking of Psychology Home Page</a></p> <p><strong>Sponsor</strong><br /> <br /> <a href=\"https://www.newporthealthcare.com\">Newport Health</a></p>",
  "content:encoded": "<p>For those of us who speak only one language, the idea of learning twenty or thirty sounds impossible. But there are “hyperpolyglots” who have managed this remarkable feat. Evelina Fedorenko, PhD, of the Massachusetts Institute of Technology, discusses what sets polyglots apart and what scientists might learn from studying them. She also discusses how language is processed in the brain, why it’s so much easier for kids to learn languages than adults, the relationship between language and thought and how we can think without language, and more.  Links  <a href=\"https://mcgovern.mit.edu/profile/ev-fedorenko/\">Ev Fedorenko, PhD</a> <a href= \"https://www.apa.org/news/podcasts/speaking-of-psychology\">Speaking of Psychology Home Page</a></p> <p>Sponsor  <a href=\"https://www.newporthealthcare.com\">Newport Health</a></p>",
  "enclosure": "",
  "itunes:duration": "40:06",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For those of us who speak only one language, the idea of learning twenty or thirty sounds impossible. But there are “hyperpolyglots” who have managed this remarkable feat. Evelina Fedorenko, PhD, of the Massachusetts Institute of Technology,...",
  "itunes:episode": 196,
  "itunes:episodeType": "full"
}