{
  "title": "Twenty-First Century Illicit Drugs and Their Discontents: The Scourge of Illicit Fentanyl",
  "link": "https://www.heritage.org/crime-and-justice/report/twenty-first-century-illicit-drugs-and-their-discontents-the-scourge",
  "description": "<p> </p>\n\n<blockquote>“If the scourge slay suddenly, he will laugh at the trial of the innocent.”</blockquote>\n\n<blockquote>Job 9:23 (King James)</blockquote>\n\n<p>Since the last decade of the 20th century, America has been gripped by a tremendous increase in the number of its citizens who are suffering from the overuse and misuse of opioids. The result has been called an epidemic, but another term might be more apt. As one physician described it, “The proliferation of opioid use in the United States is called an epidemic, but it more resembles metastatic cancer.”<span class=\"annotation__highlight\" data-annotation=\"<p>David Brown, Opioids and Paternalism, Am. Scholar 22, 23 (2017); see Jon Kamp et al., How Two Mexican Drug Cartels Came to Dominate America’s Fentanyl Supply, Wall St. J., Aug. 30, 2022, https://www.wsj.com/articles/mexico-drug-cartels-fentanyl-overdose-sinaloa-jalisco-11661866903 (“Fentanyl metastasized into a broader crisis in the 2010s, as drugs flowed from China, sometimes through Mexico, and the cartels ramped up their own production. The eastern half of the U.S. was particularly hard-hit as powdered fentanyl was mixed into the heroin supply, sometimes catching users off guard and leading to an increase in fatal overdoses.”). Numerous studies, books, and articles discuss the provenance and extent of that epidemic. See, e.g., Understanding the Epidemic, Cntrs. For Disease Control & Prevention (Dec. 19, 2018), https://www.cdc.gov/drugoverdose/epidemic​/index.html [https://perma.cc/SFQ6-RLKF]; Scott Higham & Sari Horwitz, American Cartel: Inside the Battle to Bring Down the Opioid Industry (2022); Anna Lembke, Drug Dealer, MD (2016); American Epidemic: Reporting from the Front Lines of the Opioid Crisis (John McMillan ed., 2019); Barry Meier, Pain Killer: An Empire of Deceit and the Origin of America’s Opioid Epidemic (2018); Sam Quinones, Dreamland: The True Tale of America's Opiate Epidemic (2016); Patrick Radden Keefe, Empire of Pain: The Secret History of the Sackler Dynasty (2021).</p>\"><span class=\"annotation-link\">REF</span></span> Cancer could be a more appropriate label, given the number of fatalities that opioids have caused. As U.S. Senator Tom Cotton and U.S. Representative David Trone, co-chairmen of the Commission to Combat Synthetic Opioid Trafficking, explained earlier this year, “The overdose crisis in the United States claims more lives each year than firearms, suicide, homicide, or motor vehicle crashes.”<span class=\"annotation__highlight\" data-annotation=\"<p>Commission on Combatting Synthetic Opioid Trafficking, Final Report vii (Co-Chairs Letter) [hereafter Synthetic Opioid Comm’n].</p>\"><span class=\"annotation-link\">REF</span></span> More people than even AIDS killed during its worst years.<span class=\"annotation__highlight\" data-annotation=\"<p>Ben Westhoff, Fentanyl, Inc.: How Rogue Chemists Are Creating the Deadliest Wave of the Opioid Epidemic 4 (2019).</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>This <i>Legal Memorandum</i> is another in a series of Heritage Foundation papers under the overall title “Twenty-First Century Illicit Drugs and Their Discontents.” This one will focus on the synthetic opioid fentanyl. It will explain why fentanyl has become a modern-day Old Testament scourge.</p>\n\n<h3>The Dilemma That Opioids Pose</h3>\n\n<p>The bulbs of the poppy plant produce a gum that has been known for its analgesic properties for thousands of years.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., Gene M. Heyman, Addiction: A Disorder of Choice 23–25 (2009); Brodie Ramin, The Age of Fentanyl: Ending the Opioid Epidemic 9 (2020); John J. Coleman & Robert L. DuPont, Fentanyl as Sentinel: The Deadly Threat of Illegal Synthetic and Counterfeit Drugs, The Heritage Found., Backgrounder No. 3436, at 2 (Sept. 4, 2019).</p>\"><span class=\"annotation-link\">REF</span></span> The word <i>opium</i> comes from the Greek word <i>opion</i>, meaning poppy juice.<span class=\"annotation__highlight\" data-annotation=\"<p>Ramin, supra note 4, at 9.</p>\"><span class=\"annotation-link\">REF</span></span> In the 19th century, chemists identified the poppy component responsible for the plant’s analgesic effects and purified that substance into the drug known as morphine, named after Morpheus, the Greek god of sleep. Just before the turn of the 20th century, the Bayer company modified morphine to produce diacetylmorphine, which the company called <i>heroin</i> after the German word <i>heroisch</i>, which means heroic or mighty.<span class=\"annotation__highlight\" data-annotation=\"<p>Coleman & DuPont, supra note 4, at 2.</p>\"><span class=\"annotation-link\">REF</span></span> Touted as a powerful cough suppressant and a less addictive painkiller than morphine, heroin was seen initially as an invaluable medicament at a time when tuberculosis and pneumonia killed thousands.<span class=\"annotation__highlight\" data-annotation=\"<p>Id.</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>Opioids remain the premiere analgesic today.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., Jerrold S. Meyer & Linda F. Quenzer, Psychopharmacology: Drugs, the Brain, and Behavior 305–06 (2d ed. 2018) (“As a class, [opioids] are the very best painkillers known to man.”).</p>\"><span class=\"annotation-link\">REF</span></span> They have that effect by generating a cascade of the naturally produced pleasure-inducing molecule dopamine in the reward center in the brain, the <i>nucleus accumbens</i>.<span class=\"annotation__highlight\" data-annotation=\"<p>See generally Moheb Costandi, Neuroplasticity (2016); Robert L. DuPont, Chemical Slavery: Understanding Addiction and Stopping the Drug Epidemic 63–88 (Rev. ed., 2018); Francesca Mapua Filbey, The Neuroscience of Addiction (2019); George F. Koob et al., Drugs, Addiction, and the Brain (2014); Nora D. Volkow et al., Neurobiologic Advances from the Brain Disease Model of Addiction, 374 New Eng. J. Med. 363 (2016).</p>\"><span class=\"annotation-link\">REF</span></span> Think of it as “the brain’s Grand Central Station, a junction for addictions and anxieties and obsessions.”<span class=\"annotation__highlight\" data-annotation=\"<p>Zachary Siegel, A Hole in the Head: Can a Brain Implant Treat Drug Addiction?, Harpers 25 (Sept. 2022) (punctuation omitted).</p>\"><span class=\"annotation-link\">REF</span></span> Dopamine is exceptionally helpful in some circumstances. To produce it, physicians prescribe opioids to relieve the intense pain and suffering caused by recent surgery or end-stage cancer, which dopamine accomplishes well.<span class=\"annotation__highlight\" data-annotation=\"<p>Coleman & DuPont, supra note 4, at 2.</p>\"><span class=\"annotation-link\">REF</span></span> Opioids, like antibiotics and vaccines, are a modern-day pharmacological success story.</p>\n\n<p>Yet therein also lies a dilemma: “[O]pioids give pleasure, and pleasure is a trap.”<span class=\"annotation__highlight\" data-annotation=\"<p>Ramin, supra note 4, at 9 (footnote omitted).</p>\"><span class=\"annotation-link\">REF</span></span> Opioids seduce people into believing that they are the ticket to earthly paradise. A problem is that long-term (and some short-term) users get waylaid into physical dependence or addiction. The former describes the state in which your body needs a certain drug to avoid becoming physically ill; the latter, a state in which using a drug becomes the <i>raison d’étre </i>for your life.<span class=\"annotation__highlight\" data-annotation=\"<p>There is a difference between the two concepts: “While all morphine and morphine substitute chemicals produce analgesia and brain reward, prolonged use may lead to analgesic tolerance in patients treated for pain and to compulsive intake by opioid addicts. Long-term use also may produce physical dependence, a condition manifested by somatic withdrawal symptoms in the absence of the drug. Withdrawal symptoms may include pain, insomnia, and diarrhea, which are, in effect, a reversal of the drug’s therapeutic effects. Physical dependence and withdrawal symptoms can be resolved medically by gradual dose reduction over several weeks or months, and is known in the lingo as ‘tapering.’ [¶] More worrisome, however, is ‘addiction,’ a serious disease referred to in the literature today as substance use disorder (SUD). This condition is often misunderstood in the discussion of chronic opioid use. Unlike physical dependence, a SUD involving opioids is not easily managed by gradual dose reduction because of a strong desire or craving that the addicted person has for the abusable substance, even following periods of forced or voluntary abstinence. Unlike tolerance or physical dependence, both of which typically respond well to medical management, a SUD is a life-threatening chronic disease characterized by compulsive use of psychoactive substances despite their harm.” Coleman & DuPont, supra note 4, at 3 (footnotes omitted); see also Volkow et al., supra note 9, at 364 Box 1.</p>\"><span class=\"annotation-link\">REF</span></span> Addiction treatment physician Dr. Brodie Ramin has described the problem as follows:</p>\n\n<blockquote>Addiction is about dopamine. Addictive substances push dopamine to high, often massively elevated levels, in the nucleus accumbens, the reward centre of the brain. This is the <i>high</i> of the street vernacular. You get high, then you come down. You get dope, then you get dope sickness. You use. You need a fix, a drink, a toke. Stimulating the opioid receptors leads to a cascade in the brain that ends with increased dopamine…. Floating on a cloud is a common description of the first high.<span class=\"annotation__highlight\" data-annotation=\"<p>Ramin, supra note 4, at 15 (footnote omitted; emphasis in original).</p>\"><span class=\"annotation-link\">REF</span></span></blockquote>\n\n<p>Dr. Ramin explained the highs and lows of opioids as follows:</p>\n\n<blockquote>Pamela told me that heroin is like an abusive lover; it gets under your skin and into your mind. Opioids make you feel high and then bring you down. They make you feel calm and safe and then smother you in your sleep. All you can think about is your next point of heroin or your next pill of Percocet, but more than anything you want to stop using. You want to get away. You fight, but the opioid fights back. It gives you chills and drenching night sweats; it makes you vomit; it makes you want to jump out of your skin; it makes you crazy with revulsion and desire. It is the perfect biological weapon, designed to target the pleasure centres of the brain.<span class=\"annotation__highlight\" data-annotation=\"<p>Ramin, supra note 4, at 2, 9; see also, e.g., Martin Booth, Opium: A History (1996); David T. Courtwright, Dark Paradise: A History of Opiate Addiction in America (2009); H. Wayne Morgan, Yesterday’s Addicts: American Society and Drug Abuse, 1865–1920 (1974). For personal accounts of the effect that addiction can have on the user and his or her family, see, for example, James Frey, A Million Little Pieces (2005); Beth Macy, Dopesick: Dealers, Doctors, and the Drug Company that Addicted America (2018); Sigrid Rausing, Mayhem (2017); David Sheff, Beautiful Boy: A Father’s Journey Through His Son’s Addiction (2009); Nikki Sixx, The Heroin Diaries (2007).</p>\"><span class=\"annotation-link\">REF</span></span></blockquote>\n\n<p>The process of addiction leads to a rewiring of the brain or “neuroplasticity”—viz., “systematic changes in the synaptic signaling, or communication, between neurons in various reward regions of the brain”:<span class=\"annotation__highlight\" data-annotation=\"<p>Volkow et al., supra note 9, at 366 Box 2.</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<blockquote>Opioids affect the brain’s response to stimuli and impair decision-making. We are all creatures of habit, and addiction is a deeply ingrained habit…. When you smell your favorite food, you start salivating before a morsel has passed your lips. So it is with drugs. Entering a room where you have used drugs or taking out the equipment to smoke or inject a drug leads your dopamine-producing cells to start firing in anticipation of the rush to come. Repetition turns opioid use into an automatic and compulsive behavior. These changes in the brain endure; they last for years after drug use stops, which is why addiction is a chronic disease.<span class=\"annotation__highlight\" data-annotation=\"<p>Ramin, supra note 4, at 16 (footnote omitted). For a pictorial depiction of the stages of the addiction cycle, see Volkow et al., supra note 9, at 365 Fig. 1.</p>\"><span class=\"annotation-link\">REF</span></span></blockquote>\n\n<p>The result is like seeing Dante Alighieri’s <i>Divine Comedy</i> played in reverse. Opioid use can take people from the <i>Paradiso</i> or <i>Purgatorio</i> through the <i>Inferno</i>, ultimately entombing them in a far worse form of misery than whatever physical or psychological anguish they had hoped to leave behind.</p>\n\n<blockquote>The tragedy for nearly all people who use drugs is that they never return to that initial state of bliss. With repeated use, smaller and smaller amounts of dopamine are released. People need to increase the quantity and frequency of opioid use. Even worse, they become less sensitive to the stimulation for non-drug-related rewards, and they lose motivation to do quotidian and necessary activities such as show up at work and maintain their relationships. The joys of drug use plateau and then decline, but so do the joys of life. Food doesn’t taste as good, careers become a barrier to using drugs, and love feels less like love.<span class=\"annotation__highlight\" data-annotation=\"<p>Ramin, supra note 4, at 17–18.</p>\"><span class=\"annotation-link\">REF</span></span></blockquote>\n\n<p>Sadly, even that absence of ordinary sources of gratification and happiness is not the nadir of an addict’s life:</p>\n\n<blockquote>It gets worse. Not only does the brain’s reward system flatline, but there is a concurrent rise of the brain’s anti-reward system, the network of brain pathways involved in stress and negative emotions. Chronic drug use makes the anti-reward system overactive. That is why people who use opioids chronically are more likely to develop depression and to stop caring about every other aspect of life other than drugs. People who use opioids are pulled to the rewards of drugs while also being pushed to avoid withdrawal, depression, and pain. Over a short period of time, a person transitions from taking drugs in order to get high to using them to get a brief respite from depression. Rather than using to get the feeling of floating on a cloud, people begin to use opioids to make the pain stop.<span class=\"annotation__highlight\" data-annotation=\"<p>Id. at 18 (footnote omitted); see also id. at 19–20; Volkow et al., supra note 9, at 366 & Box 2 (“Experience-dependent learning (such as that which occurs in repeated episodes of drug use) may invoke both long-term potentiation, in which the transmission of signals between neurons increases, and long-term depression, in which signal transmission decreases…. In this way, environmental stimuli that are repeatedly paired with drug use—including environments in which a drug has been taken, persons with whom it has been taken, and the mental state of a person before it was taken—may all come to elicit conditioned, fast surges of dopamine release that trigger craving for the drug…motivate drug-seeking behaviors, and lead to heavy ‘binge’ use of the drug. These conditioned responses become deeply ingrained and can trigger strong cravings for a drug long after use has stopped (e.g., owing to incarceration or treatment) and even in the face of sanctions against its use.”) (footnotes omitted); see Ramin, supra note 4, at 21–24.</p>\"><span class=\"annotation-link\">REF</span></span></blockquote>\n\n<p>Far too many Americans fell into that trap over the past century by overusing prescription opioids or illicit substitutes to address physical pain or to avoid psychological distress that can be no less real and disabling. Nonetheless, illicit opioid use can have tragic consequences. Approximately half of the people who use heroin become addicted to it; for every first user, “it is a coin toss” whether addiction will follow.<span class=\"annotation__highlight\" data-annotation=\"<p>Ramin, supra note 4, at 24.</p>\"><span class=\"annotation-link\">REF</span></span> Congress sought to prevent heroin’s use by prohibiting its sale more than a century ago. Nonetheless, just as prohibiting the production and distribution of alcohol did not prevent people from becoming alcoholics, outlawing heroin has not kept heroin from ruining or claiming numerous lives.<span class=\"annotation__highlight\" data-annotation=\"<p>Harrison Narcotics Tax Act of 1914, ch. 1, 38 Stat. 785; 21 U.S.C. §§ 812(c) Schedule I & 841 (2018); see John Kaplan, The Hardest Drug: Heroin and Public Policy (1983); David F. Musto, One Hundred Years of Heroin (2002).</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<h3>The Opioid Epidemic</h3>\n\n<p>Traditionally, physicians were reluctant to prescribe opioids except in limited circumstances, given their addictive potential.<span class=\"annotation__highlight\" data-annotation=\"<p>Coleman & DuPont, supra note 4, at 3 (noting that opioids were used for “providing end-of-life care for patients whose physical dependence on the medication was not a relevant risk factor”).</p>\"><span class=\"annotation-link\">REF</span></span> Several factors coalesced to change that attitude in the 1990s. Prompted by the work of patient advocacy groups, pain—whether caused by disease or by injury and whether acute or chronic—came to be seen as the fifth vital sign (atop temperature, heart rate, respiration rate, and blood pressure).<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., Coleman & DuPont, supra note 4, at 3; D. Andrew Tompkins et al., Providing Chronic Pain Management in the “Fifth Vital Sign” Era: Historical and Treatment Perspectives on a Modern-Day Medical Dilemma, 173 Drug & Alcohol Dependence Supp. 1 S11–S21 (2017).</p>\"><span class=\"annotation-link\">REF</span></span> Insurers for managed health care programs demanded that physicians increase the number of their patients and declined to reimburse non-opioid pain treatments. Pharmaceutical companies claimed to have developed forms of opioids that had a very low risk of addiction. Physicians feared patients’ ability to rate the quality of their treatment on social media. As a result, doctors found that they could satisfy all of those groups by regularly prescribing opioids to manage chronic pain.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., Lembke, supra note 1.</p>\"><span class=\"annotation-link\">REF</span></span> Sadly but perhaps predictably, beginning late in the 1990s, “America has witnessed an increase in drug overdose deaths in numbers partaking of Biblical proportions,”<span class=\"annotation__highlight\" data-annotation=\"<p>Paul J. Larkin, Jr. & Bertha K. Madras, Opioids, Overdoses, and Cannabis: Is Marijuana an Effective Therapeutic Response to the Opioid Abuse Epidemic?, 17 Geo. J. L. & Pub. Pol’y 555, 557 (2019).</p>\"><span class=\"annotation-link\">REF</span></span> due principally to overuse and misuse of opioids, legal and illegal.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., id. at 561–62, 588. As one report summarized: “Beginning in the late 1990s, prescribing of opioid pain relievers spread far beyond traditional indications. Opioids had long been used with considerable success to treat acute pain in general and chronic cancer pain in particular. Chronic non-cancer pain began to be recognized as a serious and prevalent problem in America in the 1990s. In this period, U.S. pharmaceutical companies argued that the appropriate response to this real problem was a dramatic expansion of opioid prescribing. Companies such as Purdue Pharma organized ‘pain lobbies’ of doctors and patients to urge widespread and prolonged use of new potent opioids, such as OxyContin—not just for severe pain in terminal patients but also for ordinary injuries, bad backs, and wobbly knees. Beguiled doctors started prescribing opioids to wide segments of the U.S. population—from injured high school athletes to older people suffering from arthritis. The pharmaceutical companies cynically and duplicitously promoted the aggressive prescription of opioids, knowing they could lead to substance dependence. Worse, the pharmaceutical companies not only suppressed revelations about how supposedly harmless opioids in fact stimulated substance dependence, but also managed to capture or neutralize almost every U.S. institution charged with protecting the public from such malfeasance—from the medical schools to the Drug Enforcement Administration (DEA). Substance dependence rose fastest in the places most aggressively targeted by pharmaceutical companies’ promotions, and those with the most ‘pill mills’ and unscrupulous doctors and pharmacies. These included vulnerable communities with declining income and lack of economic and educational opportunities, such as in West Virginia, a state that became associated with prescription opioid — and later other opioid—use disorder and misery.” Vanda Felbab-Brown et al., The Opioid Crisis in America: Domestic and International Dimensions: Overview, Brookings Inst. 3–4 (June 2020) (footnotes omitted).</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>The epidemic hit the nation in three successive “waves” of increasing severity.<span class=\"annotation__highlight\" data-annotation=\"<p>Ramin, supra note 4, at 3 (footnote omitted) (“We have been hit by three waves, so far, of the North American opioid epidemic. In the 1990s, as more doctors prescribed more opioids to ease pain, patients began to die from those medications. That was the first wave. The second wave began in 2010, as heroin became increasingly competitive with prescription opioids in terms of cost and purity, and new heroin distribution networks spread across the continent. The third wave began only a few years later, in 2013. We are being hit by the third wave now [viz., 2020], and it’s much worse than the wave of the 1990s, worse than what occurred in 2010. The third wave is being driven by fentanyl.”). The SARS-CoV-2 pandemic of 2019–2022 eclipsed the opioid epidemic, but the latter did not disappear.</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<ul><li>Wave 1 involved the overprescription and overuse of opioids.</li>\n\t<li>In Wave 2, once the federal and state governments limited opioid prescriptions to address the spreading overdose crisis, opioid users turned to heroin because it was easier to obtain and less expensive.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., Paul J. Larkin, Ruan v. United States: An Important Ruling or Merely “Sound and Fury”?, 21 Geo. J.L. & Pub. Pol’y (forthcoming 2023) (manuscript 10–12).</p>\"><span class=\"annotation-link\">REF</span></span></li>\n\t<li>Wave 3, the most recent and still-ongoing stage, involves a synthetic analgesic, fentanyl.</li>\n</ul><p>Fentanyl made a cameo appearance in the United States late in the 1970s, when it was known as “China White.”<span class=\"annotation__highlight\" data-annotation=\"<p>Technically, China White was alpha-methylfentanyl, an analogue of fentanyl. Westhoff, supra note 3, at 37. Its introduction, however, was momentous. “China White represented a fish-crawling-onto-land moment: it was the first popular illicit drug synthesized by a rogue chemist that was new, rather than simply a copy of something already on the medical market. And thus, alpha-methylfentanyl was the first in a long line of new psychoactive substances that came to include K2, Spice, ‘bath salts, and all the other psychoactive substances this book is about. Back before they were called novel psychoactive substances, or NPS, they were known by another name: designer drugs.” Id. at 38. Today, we are witnessing an explosion of NPSs. Id. at 50–51, 82–90. That problem will be the subject of a future paper.</p>\"><span class=\"annotation-link\">REF</span></span> Now, however, it has become the principal villain responsible for America’s overdoses and fatalities.<span class=\"annotation__highlight\" data-annotation=\"<p>See Drug Enforcement Admin., U.S. Dep’t of Justice, Press Release: DEA Warns of Increase in Mass-Overdose Events Involving Deadly Fentanyl (Apr. 6, 2022); Drug Enforcement Admin., U.S. Dep’t of Justice, National Drug Threat Assessment 2020 DEA-DCT-DIR-008-21, at 4 (Mar. 2021) [hereafter DEA Nat’l Drug Assessment] (“Illicit fentanyl—produced in foreign clandestine laboratories and trafficked into the United States in powder and pill form—is primarily responsible for fueling the ongoing opioid crisis. Fentanyl-laced counterfeit pills continue to be trafficked across the country and remain significant contributors to the rates of overdose deaths observed across the country. As inexpensive, potent fentanyl continues to push into established heroin markets, fentanyl will augment, and in some cases supplant, white powder heroin in various domestic markets.”), 9 (“The domestic market for fentanyl overlaps with most of the major white powder heroin markets. However, in select areas, law enforcement and public health officials report fentanyl is either supplanting or has surpassed a significant portion of the pre-established heroin market, including in DEA Field Divisions in the Northeast (New England, New Jersey, New York, Philadelphia) and Midwest (St. Louis, Chicago).”), 12 (“Overdose data indicates fentanyl use continues in areas with traditional white powder heroin prevalence while its use appears to be expanding into other regions in the United States, such as west of the Mississippi River.”); Sarah Maslin Nir, Inside Fentanyl’s Mounting Death Toll: “This Is Poison”, N.Y. Times, Nov. 22, 2021, https://www.nytimes.com​/2021/11/20/nyregion/fentanyl-opioid-deaths.html?referringSource=articleShare. Noah Weiland & Margot Sanger-Katz, Overdose Deaths Continue Rising, with Fentanyl and Meth Key Culprits, N.Y. Times, May 11, 2022, https://www.nytimes.com/2022/05/11/us/politics/overdose-deaths-fentanyl​-meth.html?searchResultPosition=7 (“A growing share of deaths continue to come from overdoses involving fentanyl, a class of potent synthetic opioids that are often mixed with other drugs, and methamphetamine, a synthetic stimulant. State health officials battling an influx of both drugs said many of the deaths appeared to be the result of combining the two.”). The best short discussion of fentanyl is Coleman & DuPont, supra note 4. For lengthier discussions, see Synthetic Opioid Comm’n, supra note 2; Bryce Pardo et al., The Future of Fentanyl and Other Synthetic Opioids (2019); Ramin, supra note 4; Sam Quinones, The Least of Us: True Tales of America and Hope in the Time of Fentanyl and Meth (2021); Westhoff, supra note 3.</p>\"><span class=\"annotation-link\">REF</span></span> Ben Westhoff described the current wave in his book <i>Fentanyl, Inc</i>.:</p>\n\n<blockquote>After the heroin and prescription pill crisis took off in the 1990s and reached epidemic levels in the following decades, heartbreaking reports increasingly appeared about decimated communities, about young victims cut down in their prime.</blockquote>\n\n<p>The CDC was right; fentanyl is claiming lives at an unprecedented rate.<span class=\"annotation__highlight\" data-annotation=\"<p>Synthetic Opioid Comm’n, supra note 2, at 13–14 & Fig. 3.1.</p>\"><span class=\"annotation-link\">REF</span></span> Heroin use “had never been a particularly safe pastime,” but once fentanyl appeared, users “began dropping like flies.”<span class=\"annotation__highlight\" data-annotation=\"<p>Westhoff, supra note 3, at 122–23.</p>\"><span class=\"annotation-link\">REF</span></span> A 2022 study published in the <i>Journal of the American Medical Association</i> found that “[i]n 2021, fentanyls were identified in 77.14% of adolescent overdose deaths, compared with 13.26% for benzodiazepines, 9.77% for methamphetamine, 7.33% for cocaine, 5.76% for prescription opioids, and 2.27% for heroin.”<span class=\"annotation__highlight\" data-annotation=\"<p>Joseph Friedman et al., Trends in Drug Overdose Deaths Among US Adolescents, January 2020 to June 2021, 327 JAMA 1398, 1398–99 (2022) (footnotes omitted).</p>\"><span class=\"annotation-link\">REF</span></span> “Overdoses involving illegally manufactured fentanyl are now the leading cause of death for those ages 18 to 45.”<span class=\"annotation__highlight\" data-annotation=\"<p>Synthetic Opioid Comm’n, supra note 2, at vii; Fentanyl Becomes Leading Cause of Death for Ages 18–45, Georgetown Behavioral Hosp., Dec. 23, 2021, https://www.gbhoh.com/fentanyl-becomes-leading-cause-of-death-for-ages-18-45/ (last visited Aug. 23, 2022).</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>The costs of the opioid epidemic are staggering. “Since 2000, there have been 400,000 opioid-involved deaths in the U.S. contributing to an historic decline in U.S. life expectancy.”<span class=\"annotation__highlight\" data-annotation=\"<p>Felbab-Brown et al., supra note 26, at 3.</p>\"><span class=\"annotation-link\">REF</span></span> According to the most recent annual data, from June 2020 through May 2021, more than 100,000 Americans died from drug overdoses<span class=\"annotation__highlight\" data-annotation=\"<p>Id. at ix, 2.</p>\"><span class=\"annotation-link\">REF</span></span>—more than double the number of Americans killed in action during the Vietnam War.<span class=\"annotation__highlight\" data-annotation=\"<p>Id.; see Nat’l Archives, Military Records, Vietnam War U.S. Military Fatal Casualty Statistics, Aug. 23, 2022, https://www.archives.gov/research/military​/vietnam-war/casualty-statistics (last accessed Aug. 24, 2022); see also, e.g., Virginia Allen, How America’s Unsecured Border Contributes to Fentanyl Crisis, Daily Signal, Aug. 18, 2022, https://www.dailysignal.com/2022/08/18/how-americas-unsecured-border-contributes-to-fentanyl-crisis-deaths/; Jon Kamp, Drug-Overdose Deaths Reached a Record in 2021, Fueled by Fentanyl, Wall St. J., May 11, 2022, https://www.wsj.com/articles/drug-overdose​-deaths-reached-a-record-in-2021-fueled-by-fentanyl-11652277600?page=1 (“The U.S. has recorded more than one million overdose deaths since 2000, and more than half of those came in the past seven years…. The agency has counted about 103,600 overdoses for 2021 but believes the number is several thousand higher due to suspected overdoses that haven’t yet been confirmed by local death investigators, Dr. Anderson said.”); Weiland & Sanger-Katz, supra note 30 (“After a catastrophic increase in 2020, deaths from drug overdoses rose again to record-breaking levels in 2021, nearing 108,000, the result of an ever-worsening fentanyl crisis, according to preliminary new data published on Wednesday by the Centers for Disease Control and Prevention. [¶] The increase of nearly 15 percent followed a much steeper rise of almost 30 percent in 2020, an unrelenting crisis that has consumed federal and state drug policy officials. Since the 1970s, the number of drug overdose deaths has increased every year except 2018.”).</p>\"><span class=\"annotation-link\">REF</span></span> Since 1999, drug overdoses have killed approximately one million Americans.<span class=\"annotation__highlight\" data-annotation=\"<p>Synthetic Opioid Comm’n, supra note 2, at ix.</p>\"><span class=\"annotation-link\">REF</span></span> Estimates of the national economic cost have ranged from approximately $700 billion to $1 trillion annually.<span class=\"annotation__highlight\" data-annotation=\"<p>Id. (estimating a $1 trillion annual cost); Felbab-Brown et al., supra note 26, at 3 (same, $700 billion).</p>\"><span class=\"annotation-link\">REF</span></span> “In terms of loss of life and damage to the economy, illicit synthetic opioids have the effect of a slow-motion weapon of mass destruction in pill form.”<span class=\"annotation__highlight\" data-annotation=\"<p>Id.</p>\"><span class=\"annotation-link\">REF</span></span> For the ones who lose their lives and the people who care about them, the personal cost is incalculable.</p>\n\n<h3>Fentanyl</h3>\n\n<p>Synthesized as a more powerful painkiller than morphine, fentanyl is a powerful anesthetic and analgesic.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., Cntrs. for Disease Control & Prevention, Opioids, Fentanyl (June 1, 2022), https://www.cdc.gov/opioids/basics/fentanyl.html [hereafter CDC, Fentanyl]; Drug Enforcement Admin., U.S. Dep’t of Justice, DEA Fact Sheet: Fentanyl 1 (Apr. 2020) [hereafter DEA Fact Sheet], https://www.dea.gov/sites​/default/files/2020-06/Fentanyl-2020_0.pdf; Coleman & DuPont, supra note 4, at 4.</p>\"><span class=\"annotation-link\">REF</span></span> The Food and Drug Administration approved it in 1972<span class=\"annotation__highlight\" data-annotation=\"<p>Pardo et al., supra note 30, at 3, App. A 165–67.</p>\"><span class=\"annotation-link\">REF</span></span> as a Schedule II controlled substance under the Controlled Substances Act of 1970 (CSA), the classification used for drugs that have legitimate medical uses but also pose a serious risk of abuse and can be distributed only pursuant to a physician’s order.<span class=\"annotation__highlight\" data-annotation=\"<p>Pub. L. No. 91-513, 84 Stat. 1242 (codified as amended at 21 U.S.C. §§ 801–904 (2018)). The CSA was Title II of the Comprehensive Drug Abuse Prevention and Control Act of 1970. Title I addressed prevention and treatment of narcotics addiction, and Title III dealt with the import and export of controlled substances. See Gonzales v. Raich, 545 U.S. 1, 11 n.14 (2005). A “controlled substance” is “a drug or other substance, or immediate precursor, included in Schedule I, II, III, IV, or V of part B of this title,” except for “distilled spirits, wine, malt beverages, or tobacco, as those terms are defined or used in subtitle E of the Internal Revenue Code of 1954.” 21 U.S.C. § 802(6) (2018). The Controlled Substances Act incorporates the definition of a “drug” from the Federal Food, Drug, and Cosmetic Act, 21 U.S.C. § 201(g)(1) (2019).</p>\"><span class=\"annotation-link\">REF</span></span> Commercially produced fentanyl is a legitimate product. It is used intravenously during surgery or as a treatment for end-stage cancer pain, often as a transdermal patch.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., DEA Fact Sheet, supra note 42, at 1. Illicit fentanyl can be consumed in multiple ways. Id. at 2 (“Fentanyl patches are abused by removing its gel contents and then injecting or ingesting these contents. Patches have also been frozen, cut into pieces, and placed under the tongue or in the cheek cavity.”).</p>\"><span class=\"annotation-link\">REF</span></span> Like other opioids, fentanyl produces effects such as pain relief, sedation, relaxation, euphoria, and respiratory depression.<span class=\"annotation__highlight\" data-annotation=\"<p>Id. at 2.</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>It is the mass production of illicitly produced and distributed fentanyl, however, that is killing thousands of Americans today.<span class=\"annotation__highlight\" data-annotation=\"<p>Since the 1980s, there were some isolated cases of illicit fentanyl production, but the “cooks” lacked a large-scale distribution network. Bryce Pardo & Peter Reuter, The Opioid Crisis in America: Enforcement Strategies for Fentanyl and Other Synthetic Opioids, Brookings Inst. 8 (June 2020). The Mexican cartels have used their established cocaine and heroin networks to distribute fentanyl. See id. at 9–10; infra note 81 and accompanying text.</p>\"><span class=\"annotation-link\">REF</span></span> The principal culprits are China and Mexico. Together, they have been responsible for nearly all of the illicit fentanyl that has entered the United States and have caused scores of thousands of overdose deaths.<span class=\"annotation__highlight\" data-annotation=\"<p>Canada, India, and Myanmar are also sources of precursor chemicals, but Mexico is dominant. Synthetic Opioid Comm’n, supra note 2, at 6 n.†.</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p><i>China</i><b>.</b> China was not a traditional source of the narcotics that have been smuggled into the United States, such as heroin.<span class=\"annotation__highlight\" data-annotation=\"<p>Id. at 2, 5.</p>\"><span class=\"annotation-link\">REF</span></span> Nonetheless, beginning in approximately 2013, China became the principal direct source of the processed illicit fentanyl<span class=\"annotation__highlight\" data-annotation=\"<p>China is also the principal supplier of fentanyl that is lawfully produced and sold to the American medical profession. Vanda Felbab-Brown, The Opioid Crisis in America: Domestic and International Dimensions: Fentanyl and Geopolitics: Controlling the Opioid Supply from China, Brookings Inst. 7 (July 2020).</p>\"><span class=\"annotation-link\">REF</span></span> that arrived in America.<span class=\"annotation__highlight\" data-annotation=\"<p>See Synthetic Opioid Comm’n, supra note 2, at 2; see also, e.g., DEA Nat’l Drug Assessment, supra note 30, at 4; Synthetic Opioid Comm’n, supra note 2, at vii; Sean O’Connor, Fentanyl: China’s Deadly Export to the United States, U.S.–China Economic and Security Rev. Comm’n, Staff Research Report 3, 5–6 (Feb. 1, 2017); Pardo et al., supra note 30, at xviii, 2–3; Westhoff, supra note 3, at 3, 13–14, 51, 130–31, 152, 167–70, 190, 200–28; Felbab-Brown, supra note 49, at 3.</p>\"><span class=\"annotation-link\">REF</span></span> China has massive pharmaceutical and chemical sectors<span class=\"annotation__highlight\" data-annotation=\"<p>See Felbab-Brown, supra note 49, at 7 (“More than 5,000 firms make up China’s politically-powerful and government-supported and protected pharmaceutical industry, the world’s largest in terms of exports of basic chemical ingredients and precursors and second largest in terms of annual revenue of more than $100 billion (one third of the value of the U.S. pharmaceutical industry).The pharmaceutical industry produces more than 2,000 products in annual output of more than 2 million tons. The world’s leading chemical exporter by value, China also has between 160,000 and 400,000 chemical manufacturers and distributors, many of which operate without legal approval, others of which hide behind shell companies, and most of which are capable of producing fentanyl and hiding it amongst its massive chemical output production.”) (footnotes omitted), 8 (noting that “China’s chemical exports make up one third of all global shipments”); see also Synthetic Opioid Comm’n, supra note 2, at 6–7 (estimating the number of Chinese pharmaceutical firms at 2,000 to 5,000 and the number of chemical firms from 24,000 to 160,000); Westhoff, supra note 3, at 181–82; Kamp et al., supra note 1.</p>\"><span class=\"annotation-link\">REF</span></span> that annually contribute trillions of dollars to China’s economy.<span class=\"annotation__highlight\" data-annotation=\"<p>See Felbab-Brown, supra note 49, at 7 (“Like the pharmaceutical industry, the chemical industry is also politically powerful, constituting some 3% of China’s national economy and generating some $100 billion in profits yearly, according to a private-sector analysis.”) (footnote omitted).</p>\"><span class=\"annotation-link\">REF</span></span> They synthesized the precursor chemicals for the production of fentanyl as well as the finished product, and China’s regulation of that industry, whether purposeful or not, was, in a word, lax.<span class=\"annotation__highlight\" data-annotation=\"<p>Synthetic Opioid Comm’n, supra note 2, at 8 (“The government of the PRC has a vested interest in allowing the industry to operate with little oversight or enforcement of regulations…. Although the central government of the PRC sets policy, regulatory enforcement is in the hands of provincial authorities. Not only do local officials lack resources; the pharmaceutical and chemical sectors play an important role in local economies and the careers of local administrators, reducing incentives to police bad actors…. Further, provincial regulatory efforts are susceptible to capture or corruption. To encourage rapid economic development and revenue growth, local officials eschew enforcement. As a result, authorities seem to inspect firms with little frequency.”); Westhoff, supra note 3, at 183 (“China’s clumsy, understaffed bureaucracy has a difficult time controlling the country’s chemical industry, where legal and illegal elements bleed into each other. Different layers of government are sometimes at odds with one another, local officials are corruptible, and industry regulations are confusing and poorly enforced. Thus, dodgy companies that keep their heads down can often operate without problems…. ‘Lack of coordination and competing regulatory oversight…creates opportunities for some firms to hide unregulated activities in plain sight,’ testified the RAND Corporation’s Bryce Pardo, an expert on drugs in China, to Congress in 2018.”), 201, 205–06 (“For more than a decade, China has been encouraging its chemical and pharmaceutical industries by offering companies lucrative tax incentives, subsidies, and direct financial support…. Quietly, money intended to spur legitimate innovation has gone to companies exporting fentanyl, fentanyl precursors, synthetic cannabinoids, and other dangerous products. It’s unclear how aware the Chinese central government is of this.”), 214 (“There is little doubt that China is undercutting its publicly stated goal of stopping the export of dangerous drugs for illicit use…. ‘If China had a subsidy on lead, you’d probably see a lot more bullets coming out of China, and that’s what happening here with the precursors. They’re subsidizing whatever is a high-value commodity, and in this case it just happens to be really potent synthetic opioids or opioid precursors,’ said RAND’s Bryce Pardo. ‘The Chinese government doesn’t have a good capacity for regulating its own industry. At the same time, it wants to export and make as much money as possible. They’re getting ahead of themselves and causing a lot of harm in the process.’”); Kamp et al., supra note 1 (“A 2021 report from two researchers at the Institute of Criminal Investigation of People’s Public Security University of China, the country’s highest police academy, pointed to weak training and unclear lines of command within China’s drug enforcement divisions. The researchers said those inspecting chemical plants often don’t have the means or know-how to identify fentanyl precursor chemicals.”).</p>\"><span class=\"annotation-link\">REF</span></span> Perhaps that is because the initial response of the Chinese Communist Party (CCP) to flaws in its Communist paradise is to deny the existence of any problem.<span class=\"annotation__highlight\" data-annotation=\"<p>See Felbab-Brown, supra note 49, at 3 (“The government of China at first tends to deny the existence of a problem.”).</p>\"><span class=\"annotation-link\">REF</span></span> Perhaps it is because the economic might of China’s chemical and pharmaceutical industries translates directly into considerable power.<span class=\"annotation__highlight\" data-annotation=\"<p>See Westhoff, supra note 3, at 194 (“[China’s] chemical industry, powered by global capitalism, has become a Frankenstein’s monster, powerful, destructive, and uncontrollable.”); Felbab-Brown, supra note 50, at 3 (“Under international or strong domestic pressure, [China] eventually moves to tighten regulation. But its enforcement tends to be limited and subverted by powerful vested interests of industry representatives, officials of line ministries charged with regulating or promoting the industry, and government officials. Geostrategic interests also trump other considerations, such as enforcement of regulatory compliance.”).</p>\"><span class=\"annotation-link\">REF</span></span> Perhaps it is because China has no interest in penalizing companies that employ thousands of workers in the provinces.<span class=\"annotation__highlight\" data-annotation=\"<p>Felbab-Brown, supra note 49, at 5 (noting that an important interest of the Chinese Communist Party is “to generate jobs and revenues at the provincial level.”).</p>\"><span class=\"annotation-link\">REF</span></span> Perhaps it is China’s way of repaying the West for the Opium Wars and resulting addiction that England forced China to endure in the 19th century.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., W. Travis Hanes III & Frank Sanello, The Opium Wars: The Addiction of One Empire and the Corruption of Another (2004); Julia Lovell, The Opium War: Drugs, Dreams, and the Making of Modern China (2015); Stephen R. Platt, Imperial Twilight: The Opium War and the End of China’s Last Golden Age (2018).</p>\"><span class=\"annotation-link\">REF</span></span> Or perhaps it is a combination of those factors and others as well (such as an unstated desire to weaken the United States). Regardless of the reason why, the CCP has been reluctant to stifle the smuggling of illicit fentanyl into the United States.</p>\n\n<p>Initially, Chinese companies would synthesize fentanyl and traffic the completed product into the United States (or send it to Mexico for one of the cartels to take fentanyl the last mile) by the U.S. Postal Service, private express carriers, passenger boats, commercial freighters, trains, and drones.<span class=\"annotation__highlight\" data-annotation=\"<p>Synthetic Opioid Comm’n, supra note 2, at 5; see also Combatting the Opioid Crisis: Exploiting Vulnerabilities in International Mail, Permanent Subcomm. on Investigations of the Comm. on Homeland Security and Governmental Affs., 115th Cong. 1–5 (2018).</p>\"><span class=\"annotation-link\">REF</span></span> Given the small size of smuggled fentanyl packages and the overwhelming number of inbound parcels, illegal packages hidden in shipping containers, like particular trees, were hidden in a forest of shipments.<span class=\"annotation__highlight\" data-annotation=\"<p>Synthetic Opioid Comm’n, supra note 2, at 5–6, Westhoff, supra note 3, at 138 (“[C]onsidering more than 400 million international packages arrive in the United States every year, checking each one for drugs is logistically impossible.”), 147 (“‘It’s near impossible to stop these drugs, because they are so easy to smuggle in shipping containers,’ said University of Pittsburgh professor Phil Williams, an expert on international organized crime and terror.”); Felbab-Brown, supra note 50, at 7 (“Some 20.6 billion parcels from China arrived in the United States in 2015 by sea and air cargo and through postal services; and nearly 500 million by post alone in 2017.”) (footnote omitted). Illegal fentanyl shippers in China—“often mom-and-pop illicit entrepreneurs without criminal organizations behind them and without the need and capacity for violence”—ship high-potency fentanyl to minimize its weight and their exposure. Felbab-Brown, supra note 49, at 8.</p>\"><span class=\"annotation-link\">REF</span></span> To make detection even more difficult, Chinese shippers use false identities, mislabel shipped fentanyl, hide it in legitimate cargos, and transship packages through “scores of middlemen and freight forwarders” to “launder” its origination point.<span class=\"annotation__highlight\" data-annotation=\"<p>Felbab-Brown, supra note 49, at 7; see also Westhoff, supra note 3, at 139, 147–48.</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>During the Obama and Trump Administrations,<span class=\"annotation__highlight\" data-annotation=\"<p>See Felbab-Brown, supra note 49, at 8–9 (describing the Administrations’ effort to enlist China’s aid).</p>\"><span class=\"annotation-link\">REF</span></span> the United States urged China to control its production and export of fentanyl and its analogues—drugs that have only minor variations from fentanyl in their chemical structure that leave its effect unchanged but allow manufacturers and shippers to evade the regulatory scheme.<span class=\"annotation__highlight\" data-annotation=\"<p>Synthetic Opioid Comm’n, supra note 2, at 7. Some fentanyl analogues, such as carfentanil, however, are far more powerful than the parent drug.</p>\"><span class=\"annotation-link\">REF</span></span> Yet fentanyl traffickers could easily evade the Chinese regulations and weak enforcement efforts. In 2019, however, after engagements at multiple levels, including a meeting between President Donald Trump and President Xi Jinping, China changed its fentanyl regulatory scheme. The Chinese government included all fentanyl analogues within its schedule of controlled substances and banned their export without a special government-issued license.<span class=\"annotation__highlight\" data-annotation=\"<p>Id.; Felbab-Brown, supra note 49, at 9.</p>\"><span class=\"annotation-link\">REF</span></span> The result was to shift the nature of China’s involvement in fentanyl trafficking.<span class=\"annotation__highlight\" data-annotation=\"<p>Disrupt, not stop. China remains the source of some illicit fentanyl that comes into the United States. See DEA Nat’l Drug Assessment, supra note 30, at 9 (Fentanyl distributors in the United States also continue to order fentanyl, FRCs, and other synthetic opioids, such as U-47700, directly from manufacturers in China via the Internet including the dark web, with delivery accomplished by international mail and commercial parcel services. China-sourced fentanyl typically is smuggled in small volumes and generally tested over 90 percent pure. In 2019, U.S. law enforcement continued to seize China-sourced fentanyl though in smaller volumes and with fewer occurrences than previous years.”).</p>\"><span class=\"annotation-link\">REF</span></span> Rather than send processed fentanyl directly to the United States by mail or by express carriers, China began to send fentanyl’s precursor chemicals to Mexico, where they have been processed into the final product and smuggled across the border.<span class=\"annotation__highlight\" data-annotation=\"<p>Synthetic Opioid Comm’n, supra note 2, at 7. The Synthetic Opioid Commission described those effects as follows: “First, the ban halted the continued generation of new fentanyl analogues and reduced the supply of these drugs directly from the PRC to the United States. Multiple experts in the U.S. government and other reports and data attest to this; the numbers of new fentanyl analogues appearing for the first time in drug seizures from domestic U.S. markets fell dramatically. This was accompanied by a sharp decline in the numbers of air-based seizures at ports of entry (POEs) arriving by mail to the United States from the PRC, starting around the time that the two countries were discussing classwide scheduling of all fentanyl-related substances. Nevertheless, despite the success in stopping direct shipments into the United States, these measures did not end the problem of illegal manufacture or import of synthetic opioids. [¶] Second, with the full ban on fentanyl-related compounds, producers in the PRC adapted and began trading in chemicals not listed under the country’s law. These chemicals include the emergence of nonfentanyl synthetic opioids, such as the benzimidazole class of opioids (e.g., etonitazene, isotonitazene), which started showing up in greater frequency in death and seizure data in 2019. At the same time, exports of uncontrolled fentanyl precursors, such as 4-AP and 4-piperidone, to TCOs in Mexico increased. According to federal authorities, since 2019, criminals in Mexico have been the primary source of fentanyl illegally imported into the United States using precursors from the PRC and elsewhere.” Id. at 7 (footnotes omitted).</p>\"><span class=\"annotation-link\">REF</span></span> Whether China will vigorously enforce its scheduling law remains to be seen, but the prognosis is a bleak one.<span class=\"annotation__highlight\" data-annotation=\"<p>Felbab-Brown et al., supra note 26, at 10 (“Though proud of its tough counternarcotics stance, China is unlikely to closely collaborate with the United States. The significant deterioration of U.S.–Chinese relations may undermine China’s willingness to diligently enforce the fentanyl regulation. Only when China starts to experience its own opioid epidemic—for example, because international pharmaceutical companies set off abuse of prescription opioids—will China likely crack down on the illicit fentanyl trade robustly. In the meantime, Felbab-Brown recommends a four-pronged approach: 1) with respect to the government of China: delinking counternarcotics policy from the U.S.–China global rivalry; 2) with respect to Chinese pharmaceutical companies: mandating that all companies selling legal fentanyl in the United States institute verifiable internal monitoring of their production facilities and contribute opioid samples to a U.S. or international database; 3) with respect to prominent Chinese pharmaceutical and chemical industry officials: the development of packages of leverage; and [4]), with respect to drug traffickers: the development of legal indictment portfolios.”); Felbab-Brown, supra note 49, at 5 (“The question now is how likely it is that China will diligently enforce the new regulation and crack down against individuals and companies that illegally traffic fentanyl to the United States and elsewhere in the world. That is a question of both capacity and will. The enforcement challenge is significant, as it involves the monitoring of hundreds of thousands of legal facilities and requires extensive law enforcement resources. It also requires significant will on the part of the Chinese government, which may be in short supply as the United States and China stand on the cusp of a new Cold War with relations between the two countries at their lowest point in decades.”); id. at 6 (“Overall, vested interests have systematically sought to undermine tighter regulations and their enforcement—such as on cigarette marketing or wildlife trade regulation. To the extent that particular economic sectors succeed in delivering extensive tax revenues and jobs, they advance the primarily [sic] performance measures by which Chinese government officials are evaluated and the primary tools by which the Chinese government seeks to maintain internal stability and preserve the power of the CCP. Vested interests of industry representatives and government officials then often hamper regulation and its enforcement, even when China is in violation of its international treaty obligations and there are intensely negative public health consequences for Chinese citizens…. [¶] Moreover, geostrategic considerations tend to trump other domestic and international considerations pertaining to regulation in a wide variety of regulatory domains. [¶] All this does not bode well for tight enforcement of China’s new fentanyl regulations—at least not until a synthetic opioid epidemic arrives in China as a result of aggressive and unscrupulous marketing of prescription opioids there by the same pharmaceutical companies responsible for the U.S. opioid epidemic and already operating in China, as well as their Chinese business partners (or from Chinese drug traffickers selling fentanyl to Chinese heroin users).”); id. at 10 (“[E]nforcement is frequently left up to local officials whose political careers and political survival are far less dependent on enforcing regulations than on advancing the economic interests of the Chinese government—namely, revenue and job generation—which the government deems essential for preservation of CCP rule and stability in China. National government officials often have few details about subprovincial level business activities and their ties to illicit economies. Regulatory capture of provincial and local officials by vested interests can be high.”) (footnote omitted); id. at 11 (“[N]ational level enforcement in China tends to be selective and deployed particularly as a tool to strengthen central power rather than a consistent mechanism to uphold the rule of law and enforce regulations.”).</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>Yet even if China were to collaborate aggressively with the United States to stem illicit fentanyl manufacturing, China’s efforts might not count for very much. A variety of chemicals can be used in fentanyl synthesis; some precursors have lawful uses in synthesizing legitimate chemicals; the manufacturing technique is not scientifically challenging; and legal controls on the production and export of precursor chemicals vary from country to country.<span class=\"annotation__highlight\" data-annotation=\"<p>Synthetic Opioid Comm’n, supra note 2, at 6 n.†; DEA Nat’l Drug Assessment, supra note 30, at 9 (noting that the Mexican “TCOs are diversifying their precursor chemical sources of supply, and moving to precursor chemicals further down the synthesis chain to avoid international chemical controls.”), 15 (“Law enforcement seizures in 2019 and 2020 include many chemicals which are uncontrolled in China and Mexico.”); Westhoff, supra note 3, at 224–25; Kamp et al., supra note 1.</p>\"><span class=\"annotation-link\">REF</span></span> The Mexican drug cartels—also known as Drug Trafficking Organizations (DTOs) or Transnational Criminal Organizations (TCOs)—could turn to countries like India and Myanmar to purchase the same precursor chemicals in the open market, smuggling them in legitimate shipments, or mislabel them to hide their origin and nature.<span class=\"annotation__highlight\" data-annotation=\"<p>DEA Nat’l Drug Assessment, supra note 30, at 15; Westhoff, supra note 3, at 226 (“According to the DEA, there are sixteen different known precursor chemicals that can be used to make fentanyl, most of which remain unscheduled,” and therefore legal, “worldwide.”); Vanda Felbab-Brown, The Opioid Crisis in America: Domestic and International Dimensions: Fending Off Fentanyl and Hunting Down Heroin: Controlling Opioid Supply from Mexico, Brookings Inst. 5 (July 2020); Felbab-Brown et al., supra note 26, at 10 (“[I]f the production and trafficking of fentanyl in China is reduced, illicit production and supply will likely intensify in India and Myanmar. DTOs smuggling fentanyl to the United States already collaborate with Indian pharmaceutical companies.”).</p>\"><span class=\"annotation-link\">REF</span></span> Accordingly, the difficulties posed by dealing with nations like India and Myanmar might be no less challenging than the ones that China presents.<span class=\"annotation__highlight\" data-annotation=\"<p>Felbab-Brown et al., supra note 26, at 10–11 (“[T]he enforcement challenge with both countries is no smaller than with China. India’s large pharmaceutical industry is even more poorly regulated than China’s. It is also politically powerful, and aggressively promotes the sale of opioids in India and abroad, for example in Africa, where its sales of tramadol contribute to an intensifying drug epidemic. But, Felbab-Brown notes, U.S. counternarcotics leverage with India will be severely constrained by the U.S. desire to cultivate India as a geopolitical counterweight against China…. [¶] U.S. capacity to generate anti-fentanyl law enforcement actions in Myanmar is also severely constrained—both by the ongoing and intensifying civil war in the country and by geopolitical considerations. A myriad of militant groups and pro-government militias have been implicated in the production or taxation of illicit drugs. For decades, the Myanmar military has allowed the ethno-secessionist groups to trade in anything, including drugs, as an inducement to get the groups to agree to and maintain ceasefires with the government. It has similarly allowed progovernment militias to self-finance through the production of methamphetamine and heroin. The military has mostly undertaken counternarcotics actions when militants or militias crossed its domestic redlines, such as by trading with militant groups against which the military is engaged in active hostilities. New broad U.S. sanctions are unlikely to change this calculus while undermining other U.S. objectives.”).</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>Geopolitics plays an unavoidably large role in the fentanyl problem. Foreign nations often expect or demand some type of quid pro quo to help the United States solve a problem they do not share. Our government must decide whether obtaining the assistance of nations like China, India, and Myanmar is a priority and, if it is, what we are willing to offer to enlist their help. Complicating those negotiations is any tension or enmity between those nations (or their leaders) and ours. For example, China, hypersensitive to criticism, is loath to accept responsibility for any part in America’s fentanyl crisis. The CCP has consistently blamed America for any fentanyl overdose and fatality problem, saying that the United States must reduce its demand for illegal drugs, change its culture of drug use and addiction, and step up its enforcement of our laws. China also has been reluctant to partner aggressively with the Drug Enforcement Administration in the investigation of illicit fentanyl labs and smuggling activities within that country.<span class=\"annotation__highlight\" data-annotation=\"<p>See Felbab-Brown, supra note 49, at 21–22.</p>\"><span class=\"annotation-link\">REF</span></span> Finally, China’s recent adventurism in Southeast Asia toward Taiwan makes it unlikely that China would welcome or empower new American law enforcement officers on Chinese soil anytime soon.<span class=\"annotation__highlight\" data-annotation=\"<p>As Felbab-Brown of the Brookings Institution concluded in 2020: “China is thus most unlikely to mount cooperation with the United States on synthetic opioids as extensive as its collaboration with Australia to suppress methamphetamine production and trafficking from China. The level of collaboration is likely to fall as direct trafficking of synthetic opioids from China to the U.S. continues to decrease and trafficking is increasingly routed through intermediary countries. China already exhibits limited interest in cracking down on the flows of precursor agents from China to Mexico. In response to previous efforts by the Mexican government to lobby China to stop fentanyl and precursor trafficking, Chinese government officials tended to reply: ‘It’s a problem for Mexico to deal with. It’s a problem with your customs. There’s nothing we can do.’ Similarly, since the early days of the Obama administration, neither the United States nor Mexico have [sic] been able to persuade China to crack down on the vast amount of methamphetamine precursor agents transshipped from China to Mexico and fueling a devastating high-potency methamphetamine addiction in both the U.S. and Mexico. Once again, the pattern appears to be one of China enforcing counternarcotics controls only to the extent necessary to achieve plausible deniability and push the visible element of the problem abroad.” Id. at 23 (footnotes omitted).</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>Besides, whatever saps this nation’s energies strengthens China’s position relative to ours. Scheduling fentanyl’s analogues in 2019 and now sitting back and doing nothing (or next to nothing) gives China a cost-free way to avoid international criticism while harming its most powerful rival. As Napoleon is reputed to have mused, never interfere with the enemy when he is in the process of destroying himself.</p>\n\n<p><i>Mexico</i><b>.</b> Mexico has always played an important role as a transshipment point for the smuggling of China’s fentanyl into this country.<span class=\"annotation__highlight\" data-annotation=\"<p>Mexico also plays the major role in the smuggling of heroin into America. Historically, heroin came to the United States from Turkey, Afghanistan, and Southeast Asia. In this century, however, Mexico became the source for approximately 90 percent of the heroin consumed in this nation. Felbab-Brown, supra note 68.</p>\"><span class=\"annotation-link\">REF</span></span> Once China revised its fentanyl laws in 2019, however, “supply pivoted to Mexico.”<span class=\"annotation__highlight\" data-annotation=\"<p>Synthetic Opioid Comm’n, supra note 2, at 5 (footnote omitted).</p>\"><span class=\"annotation-link\">REF</span></span> Our southern neighbor is now the principal site for fentanyl’s illicit production and the direct source for the finished product to be smuggled into the United States.<span class=\"annotation__highlight\" data-annotation=\"<p>Id. at x (“Mexico is the principal source of this illicit fentanyl and its analogues today. In Mexico, cartels manufacture these poisons in clandestine laboratories with ingredients—precursor chemicals—sourced largely from the People’s Republic of China (PRC). Because illicit fentanyl is so powerful and such a small amount goes such a long way, traffickers conceal hard-to-detect quantities in packages, in vehicles, and on persons and smuggle the drug across the U.S.–Mexico border. It is difficult to interdict given that just a small physical amount of this potent drug is enough to satisfy U.S. demand, making it highly profitable for traffickers and dealers.”) (footnote omitted), 2 (“Mexican transnational criminal organizations (TCOs) also increasingly began supplying fentanyl instead of traditional plant-based opiates, such as heroin, albeit often producing it using precursor chemicals supplied by sellers in the PRC.”), 5–6; see also, e.g., DEA Nat’l Drug Assessment, supra note 30, at 4, 14 (“DEA reporting indicates that Mexican TCOs are significantly involved in fentanyl production. The Sinaloa Cartel and the Jalisco New Generation Cartel (CJNG) appear to be increasing the production of wholesale quantities of fentanyl in both powder and pill forms.”); Synthetic Opioid Comm’n, supra note 2, at vii; Pardo et al., supra note 30, at xviii, 2–3; Westhoff, supra note 3, at 13–14, 51, 130–31, 152, 167-70, 190, 200–28; see generally Felbab-Brown, supra note 68.</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>Two of the nine Mexican drug cartels<span class=\"annotation__highlight\" data-annotation=\"<p>“DEA considers the following nine Mexican TCOs as having the greatest drug trafficking impact on the United States: Sinaloa Cartel, CJNG, Beltran-Leyva Organization, Cartel del Noreste and Los Zetas, Guerreros Unidos, Gulf Cartel, Juarez Cartel and La Linea, La Familia Michoacána, and Los Rojos. These TCOs maintain drug distribution cells in cities across the United States that either report directly to TCO leaders in Mexico or report indirectly through intermediaries. The cartels dominate the drug trade influencing the United States market, with most cartels having a polydrug market approach that allows for maximum flexibility and resiliency of their operations.” DEA Nat’l Drug Assessment, supra note 30, at 66.</p>\"><span class=\"annotation-link\">REF</span></span>—the Sinaloa Cartel<span class=\"annotation__highlight\" data-annotation=\"<p>“Sinaloa cartel is the market leader, said Renato Sales, Mexico’s former security chief. U.S. and Mexican officials likened it to how a company works, manufacturing and marketing an array of illegal drugs and cultivating links to suppliers in dozens of countries in Latin America, Europe and Asia. The cartel is believed to have different units handling jobs such as security, money laundering, transportation, production and the bribing of public officials.” Kamp et al., supra note 1.</p>\"><span class=\"annotation-link\">REF</span></span> and the Jalisco New Generation Cartel (CJNG)<span class=\"annotation__highlight\" data-annotation=\"<p>“[CJNG] is Mexico’s fastest-growing and most violent. It is fighting with Sinaloa for control of seaports where fentanyl’s chemical ingredients arrive from China as well as routes through the country and border crossings into the U.S.” Kamp et al., supra note 1; see also, e.g., Juan Montes & Jose de Córdoba, Brutal Gang Rises as Mexico’s Top Security Threat, Wall St. J., July 8, 2020, https://www.wsj.com/articles/brutal-gang-rises-as-mexicos-top-security​-threat-11594209600?mod=article_inline (describing the effort by 24 gunmen from the CJNG to assassinate Mexico City Police Chief Omar Garcia Harfuch); id. (“The cartel, which dominates the trade in fentanyl and methamphetamines, has become Mexico’s most powerful criminal organization, eclipsing the more famous Sinaloa Cartel, which used to be run by jailed drug lord Joaquin ‘El Chapo’ Guzman and is now being managed by his sons. More than any rival gang, the Jalisco cartel has made it a hallmark to attack Mexican security forces and public servants directly, making it the biggest danger to the country’s at times fragile stability, former and current security officials say. The organized-crime group has killed more than 100 public servants in Jalisco state, including federal, state and local policemen, soldiers, mayors, council members, a state tourism minister and a federal lawmaker, state officials said. In June, it killed a federal judge and his wife. Now, some analysts worry the attack on the capital’s police chief shows it is launching a wider campaign of retribution. ‘These people have the firepower and the money to challenge the Mexican state,’ said Renato Sales, Mexico’s security commissioner from 2015 to 2018. ‘The Jalisco New Generation Cartel is the most urgent threat to Mexico’s national security.’”).</p>\"><span class=\"annotation-link\">REF</span></span>—are principally responsible for manufacturing the finished product from the precursor chemicals imported from China via shell corporations,<span class=\"annotation__highlight\" data-annotation=\"<p>Synthetic Opioid Comm’n, supra note 2, at 9.</p>\"><span class=\"annotation-link\">REF</span></span> from whence they smuggle the finished product into this nation.<span class=\"annotation__highlight\" data-annotation=\"<p>“The two cartels are named for their respective strongholds in states on Mexico’s Pacific Coast. Sinaloa is a decades-old criminal organization deeply embedded in the economy, politics, and culture of Mexico’s wild northwest, analysts and officials said. Jalisco, farther south, is a relative upstart, and has violently challenged Sinaloa for market share.” Kamp et al., supra note 1. The cartels initially expanded to include methamphetamine production but have increasingly churned out fentanyl since 2014. Synthetic Opioid Comm’n, supra note 2, at 9.</p>\"><span class=\"annotation-link\">REF</span></span> Using both large-scale and small-scale laboratories in Mexico, the cartels are able to churn out massive quantities of fentanyl for smuggling into this country.<span class=\"annotation__highlight\" data-annotation=\"<p>Mexican TCOs also cut fentanyl more than China’s suppliers did. Fentanyl sent from China to the United States by mail was 90 percent pure, while Mexican fentanyl is approximately 7 percent pure. Westhoff, supra note 3, at 152. The bulk of Mexican fentanyl, according to author Ben Westhoff, enters through the 48 official ports of entry from Mexico into California, Arizona, New Mexico, and Texas secreted in secret panels in vehicles or in gas tanks. Id. at 153. TCOs also use individuals to smuggle fentanyl on their persons. If you think that the Mexican TCOs have scruples about who they choose to serve as “mules,” think again. See Bradford Betz, Texas Border Agents Encounter Boy, 4, Among Suspected Illegal Immigrants Smuggling Marijuana Into US, Fox News, Apr. 15, 2022, https://www.foxnews.com/us/texas-border-agents-encounter-boy-4-among-suspected-illegal​-immigrants-smuggling-marijuana-into-us.</p>\"><span class=\"annotation-link\">REF</span></span> As <i>The Wall Street Journal</i> recently reported, “In a six-day workweek, the cook said, he can make enough fentanyl for hundreds of thousands of doses.”<span class=\"annotation__highlight\" data-annotation=\"<p>Kamp et al., supra note 1.</p>\"><span class=\"annotation-link\">REF</span></span> The Sinaloa and CJNG cartels have established smuggling routes to transport fentanyl across the border and into the United States, including new areas where fentanyl use once was rare.<span class=\"annotation__highlight\" data-annotation=\"<p>Id. (“Mexican cartels were primed to take advantage. They already had established trafficking networks built around drugs like cocaine, marijuana and heroin, said Uttam Dhillon, who served as acting DEA administrator under Mr. Trump. And they had relationships with Chinese chemical makers, and expertise running drugmaking labs, through their production of methamphetamine, another synthetic drug they are sending to the U.S., Mr. Dhillon said. [¶] The DEA said the cartels are pushing their synthetic wares into more parts of the U.S. Methamphetamine is more present in some eastern states where that drug was once rare. And fentanyl is growing in the West.”).</p>\"><span class=\"annotation-link\">REF</span></span> The cartels then use established distribution routes, along with local gangs, to infiltrate fentanyl and other illegal drugs into every corner of this nation, earning them billions of dollars.<span class=\"annotation__highlight\" data-annotation=\"<p>Synthetic Opioid Comm’n, supra note 2, at 10; DEA Nat’l Drug Assessment, supra note 30, at 65 & Fig. 58; Montes & de Córdoba, supra note 78 (“In its 2019 annual report, the DEA said the cartel has distribution hubs in Los Angeles, New York City, Chicago, Houston and Atlanta.”).</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>To be sure, Mexico has taken some steps ostensibly to limit fentanyl trafficking. For example, President Andres Manuel López Obrador has placed Mexico’s ports and largest Mexico City airport under the control of the Mexican navy, which has seized approximately 320 tons of illicit precursor chemicals this year.<span class=\"annotation__highlight\" data-annotation=\"<p>Kamp et al., supra note 1.</p>\"><span class=\"annotation-link\">REF</span></span> Mexican authorities also claim to have destroyed roughly 1,000 labs and fentanyl production sites.<span class=\"annotation__highlight\" data-annotation=\"<p>Id.</p>\"><span class=\"annotation-link\">REF</span></span> But the truth is that the current Mexican president has no stomach for fighting the cartels.<span class=\"annotation__highlight\" data-annotation=\"<p>See Synthetic Opioid Comm’n, supra note 2, at 9 (“Part of the difficulty for Mexico can be explained by corruption, threats from violent TCOs, and, until recently, Mexican authorities’ reluctance to acknowledge the growing illegal fentanyl synthesis problem.”).</p>\"><span class=\"annotation-link\">REF</span></span> His stated policy of “<i>abrazos no balazos</i>” (hugs not bullets)<span class=\"annotation__highlight\" data-annotation=\"<p>Several Violent Episodes in Mexico Suggest a Worrying Trend, Economist, Sept. 1, 2022. https://www.economist.com/the-americas/2022/09/01/several​-violent-episodes-in-mexico-suggest-a-worrying-trend.</p>\"><span class=\"annotation-link\">REF</span></span>—attacking poverty rather than the cartels—has not merely failed to stem Mexico’s violence.<span class=\"annotation__highlight\" data-annotation=\"<p>Id. (“Between 2006 and 2012 an average of eight people ‘disappeared’ each day (many of whom were probably murdered). Now the daily average is 25. Mexico’s murder rate is 28 per 100,000 people. That is four times the murder rate in the United States. Polls show Mexicans are more concerned about violence than any other matter. In 2021 the cost of violence in Mexico was estimated by the Institute for Economics and Peace, a think-tank, to be 4.9trn pesos ($243bn), around a fifth of GDP.”); see also, e.g., Juan Montes & Jose de Córdoba, Two Jesuit Priests Gunned Down in Northern Mexico Church, Wall St. J., June 21, 2022, https://www.wsj.com/articles/two-jesuit-priests-gunned-down-in-northern-mexico-church-11655835560?page=1 (“The organized-crime group has killed more than 100 public servants in Jalisco state, including federal, state and local policemen, soldiers, mayors, council members, a state tourism minister and a federal lawmaker, state officials said. In June, it killed a federal judge and his wife. Now, some analysts worry the attack on the capital’s police chief shows it is launching a wider campaign of retribution…. For veterans of Latin America’s long drug wars, the attacks on Mexican security forces are an unsettling reminder of the campaign waged by cocaine kingpin Pablo Escobar against the Colombian state in the late 1980s, a wave of terror that included the assassination of politicians and journalists, the downing of an Avianca airliner and the bombing of shopping malls in the capital…. The cartel’s growing assertiveness presents Mr. López Obrador with a dilemma. The president took office in 2018 with the promise he would do away with Mexico’s spiraling violence by attacking poverty. So far, violence has risen further, and Mexico posted a record number of homicides in 2019.”).</p>\"><span class=\"annotation-link\">REF</span></span> It has emboldened the cartels, allowing them to grow in strength, bravado, and influence by proving that the Mexican government is not a threat.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., Aidan Gardiner, Is Mexico Growing More Violent? Our Journalists Answer Reader Questions, N.Y. Times, Nov. 7, 2019, https://www.nytimes​.com/2019/11/07/reader-center/mexico-attack-mormon-family.html; Elisabeth Malkin et al., Mormon Family Massacre Stuns Mexico, Laying Bare Government’s Helplessness, N.Y. Times, Nov. 8, 2019, https://www.nytimes.com/2019/11/05/world/americas/mexico-mormons-killed.html; Kirk Semple, Mormon Massacre in Mexico May Be Tied to Gang War, Officials Say, N.Y. Times, Nov. 8, 2019, https://www.nytimes.com/2019/11/06/world/americas​/Lebaron-Family-killed-Mexico.html.</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>Consider what happened in October 2019 in Culiacán, capital of the Mexican State of Sinaloa and home of the Sinaloa Cartel.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., David Luhnow et al., Mexican Cartel Rules City After Gunbattle, Wall St. J., Oct. 18, 2019, https://www.wsj.com/articles/mexican-president​-backs-decision-to-free-drug-lords-son-11571404233?mod=article_inline; Andrea Schmidt, The Siege of Culiacán, N.Y. Times, Nov. 15, 2019, https://www​.nytimes.com/2019/11/15/the-weekly/el-chapo-guzman-son.html?searchResultPosition=3.</p>\"><span class=\"annotation-link\">REF</span></span> Mexican law enforcement authorities arrested Ovidio Guzmán, the son of the infamous Sinaloa Cartel leader Joaquín “El Chapo” Guzmán, who had been convicted of drug trafficking in the United States and sentenced to life imprisonment. In response, cartel sicarios engaged in more than 70 firefights in that city and forced President Obrador to order the city of Culiacán to release Ovidio.<span class=\"annotation__highlight\" data-annotation=\"<p>“Within minutes of Mr. Guzmán’s capture, hundreds of cartel gunmen sprang into action. Convoys of SUVs and pickups filled the city streets. Gunmen wore bulletproof vests and toted assault rifles, and at least two had machine guns, including an intimidating Browning M2 set up on the back of a light truck, according to security experts who analyzed video footage of the events. [¶] Gunmen also began firing on army barracks where the family members of soldiers lived, Mr. Sandoval said. One unconfirmed report said gang members had hijacked loaded fuel trucks and parked them near the barracks, threatening to blow them up…. Heavily-armed gunmen riding in convoys engaged in more than 70 separate firefights with Mexican security forces, set fires [sic] to vehicles, shot at government offices and engineered a jailbreak that freed 55 prisoners, with six recaptured, officials said. By nightfall, it was clear that the cartel was in charge of the city…. The administration’s backing down to the cartel’s offensive was sharply criticized by many ordinary Mexicans and security analysts, who challenged Mr. López Obrador’s policy of using force only as a last resort in an attempt to pacify one of the world’s most violent nations. He has called the policy ‘hugs, not bullets,’ promising to focus on attacking poverty rather than cartels.” Luhnow et al., supra note 90; Mexico Needs Statecraft, Yet Its President Offers Theatre, Economist, Feb. 27, 2020, https://www.economist.com/the​-americas/2020/02/27/mexico-needs-statecraft-yet-its-president-offers-theatre.</p>\"><span class=\"annotation-link\">REF</span></span> That would be the equivalent of the Gambino Crime Family “going to the mattresses” against the federal government when the latter arrested and prosecuted John Gotti, with the federal government giving in to the Gambino Family’s demand that Gotti be freed. The teaching that any such dereliction of duty sends is that there is no rule of law and no consequence for the cartels’ illegal activities.<span class=\"annotation__highlight\" data-annotation=\"<p>See Luhnow et al., supra note 90 (“Mexico’s powerful drug cartels are likely to take note of the Sinaloa cartel’s use of military power and tactics in freeing Mr. Guzmán, and emulate it, said Mike Vigil, a former head of international operations for the U.S. Drug Enforcement Administration, who has also served in Mexico. [¶] ‘Releasing Ovidio sends a vivid message to criminal cartels that if a group’s leader is captured, all you have to do is go into a town, commit wholesale violence, and the government will release him,’ he said.”). Also, late in 2020, Mexico enacted a law in response to the American arrest on drug-trafficking charges of former Mexican Defense Minister Salvador Cienfuegos. “The legislation orders Mexico’s local, state and federal officials to report to the federal government every telephone call, meeting or communication with a foreign agent within three days of its occurrence. Foreign agents must report to the government any information they dig up and provide monthly reports of their activities.” José de Córdoba & Santiago Perez, Mexico Passes Law Curbing Operations of Foreign Security Agents, Wall St. J., Dec. 15, 2020, https://www.wsj.com/articles​/mexico-passes-law-curbing-operations-of-foreign-security-agents-11608059949?cx_testId=3&cx_testVariant=cx_2&cx_artPos=4&mod=WTRN​#cxrecs_s; A New Law Might Hobble the US–Mexican Fight against Drug Cartels, Economist, Jan. 2, 2021, https://www.economist.com/the-americas​/2021/01/02/a-new-law-might-hobble-the-us-mexican-fight-against-drug-cartels. Mexico is less a partner in the fight against the cartels than a willfully blind observer.</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<h3>Why Fentanyl Is a New Scourge</h3>\n\n<p>Fentanyl differs from well-known “hard” drugs, such as heroin, in three ways. Each one is relevant to the problem we face today.</p>\n\n<p><strong><i>Difference No. 1: Fentanyl is extremely potent</i>.</strong> The first difference is that fentanyl is extraordinarily powerful because it binds more efficiently to neuroreceptors than plant-based analgesics like heroin do.<span class=\"annotation__highlight\" data-annotation=\"<p>Pardo et al., supra note 30, at 2.</p>\"><span class=\"annotation-link\">REF</span></span> Fentanyl is 50–100 times more powerful than morphine, the drug that serves as the baseline for measuring analgesic effectiveness.<span class=\"annotation__highlight\" data-annotation=\"<p>CDC, Fentanyl, supra note 11; Pardo et al., supra note 30, at 2. The potency of drugs is measured in terms of their Morphine Equivalent Dose, or MED. Pardo et al., supra note 30, at 3.</p>\"><span class=\"annotation-link\">REF</span></span> (For perspective, heroin is five times as powerful as morphine.) And some analogues of fentanyl, such as carfentanil, which is used to tranquilize elephants, are <i>ten thousand times as</i> <i>powerful as morphine</i>.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., Pardo et al., supra note 30, at 2; Westhoff, supra note 3, at 31–32.</p>\"><span class=\"annotation-link\">REF</span></span> Only a few grains—<i>grains</i>, not <i>grams</i>—of carfentanil are fatal to humans.<span class=\"annotation__highlight\" data-annotation=\"<p>“Because of its incredible potency, fentanyl is extremely difficult to dose properly. It can be lethal at only two milligrams, an amount barely visible to the eye and far smaller than a dose of heroin. Traffickers ‘cut’ fentanyl into other drugs to give them more kick, unbeknownst to users. Thus, many fentanyl victims think they are taking heroin, cocaine, meth, or prescription pills.” Westhoff, supra note 3, at 3.</p>\"><span class=\"annotation-link\">REF</span></span> Only a miniscule amount of fentanyl is necessary for it to have its anaesthetic or analgesic effect. A smidgeon more and death follows like the Ghost of Christmas Yet to Come. “It takes only 2 milligrams to be lethal. That’s not even enough to cover the year on the front of the penny in your pocket.”<span class=\"annotation__highlight\" data-annotation=\"<p>Andrew Olivastro, Fentanyl’s Wake, Am. Mind, May 25, 2022, https://americanmind.org/salvo/fentanyls-wake/; Synthetic Opioid Comm’n, supra note 2, at 2. Unfortunately, fentanyl and its analogues are not the end of the development of powerful synthetic opioids. More are being developed regularly. See, e.g., Jon Kamp & Arian Campo-Flores, This Is U-47700, Once a Lab Experiment, Now a Killer Opioid, Wall St. J., Nov. 4, 2016, https://www.wsj​.com/articles/this-is-u-47700-once-a-lab-experiment-now-a-killer-opioid-1478269461?mod=article_inline (“In a high-stakes game of cat-and-mouse, overseas labs are churning out new synthetic drugs at a furious pace, often staying a step ahead of authorities and helping to fuel America’s rampant opioid crisis. [¶] The United Nations Commission on Narcotic Drugs estimates that ‘new psychoactive substances’—a broad list that includes synthetic opioids—are emerging globally at an average rate of one a week. As with U-47700, rogue chemists sometimes piggyback on research by legitimate scientists that was abandoned before making it to the legal market.”); Kacie Sinton, New Synthetic Opioid More Potent and Dangerous Now in Colorado, KKCO11News, July 21, 2022, https://www.nbc11news.com/2022/07/21/new-synthetic-opioid-more-potent-dangerous-than-fentanyl-now​-colorado/ (“A new drug has appeared in Colorado and has already killed at least one person in Denver. N-pyrrolidino Etonitazene, known by its street name ‘Pyro,’ is a high-potency synthetic opioid with a molecular structure that resembles Etonitazene, a synthetic opioid classified as a controlled substance. [¶] The drug is anywhere between 1,000 and 1,500 times more powerful than morphine. Fentanyl, for reference, is only about 100 times more powerful than morphine.”). That problem is beyond the scope of this paper.</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p><strong><i>Difference No. 2: Fentanyl can kill instantly</i>. </strong>The second difference is that because of its potency, fentanyl can kill instantly.<span class=\"annotation__highlight\" data-annotation=\"<p>Westhoff, supra note 3, at 3.</p>\"><span class=\"annotation-link\">REF</span></span> There is very little room between the curves defining the maximum recommended therapeutic dose of fentanyl needed to achieve its analgesic effect and the minimum fatal dose.<span class=\"annotation__highlight\" data-annotation=\"<p>For a discussion of those concepts, see T. Liu et al., Estimation of Maximum Recommended Therapeutic Dose Using Predicted Promiscuity and Potency, 9 Clinical Transl. Sci. 311 (2016).</p>\"><span class=\"annotation-link\">REF</span></span> Put differently, there is little margin for error. A person who, wittingly or not, uses more than the small amount of fentanyl to achieve the sought-after blissful euphoric state might not have any such margin. As Illinois’ Madison County Coroner Stephen Nonn put it, “‘When we go to a death scene and you still see the needle in the arm, we know it was fentanyl because it works that quick[ly].’”<span class=\"annotation__highlight\" data-annotation=\"<p>Id. at 125.</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>That feature alone explains why fentanyl is a far bigger threat than heroin. Heroin turns people into “addicts”—viz., individuals who were more than physically dependent on a drug and would start “jonesing” for it if its use were discontinued. Addicts—a term that is no longer widely used but that still accurately summarizes a relevant concept—are individuals whose drug use dominates their lives so completely and deeply that they compulsively use a drug and do whatever is necessary to obtain it, despite the damage it does to their professional, family, and personal lives, because their brains have become rewired and demand it.<span class=\"annotation__highlight\" data-annotation=\"<p>See Coleman & DuPont, supra note 4, at 3.</p>\"><span class=\"annotation-link\">REF</span></span> Yet, unlike fentanyl, drugs like heroin offer what is called the “gift of desperation”—that is, the opportunity to seek treatment after hitting “rock bottom” and realizing that death is “just a shot away.”<span class=\"annotation__highlight\" data-annotation=\"<p>The Rolling Stones, Gimmie Shelter (Decca Records 1969).</p>\"><span class=\"annotation-link\">REF</span></span> Heroin addicts can enter treatment for their substance use disorder, and though escaping an addiction is quite difficult, some are able to do so successfully. Fentanyl doesn’t give people that chance. It is merciless.</p>\n\n<p><strong><i>Difference No. 3: Fentanyl is easier and cheaper to produce, smuggle, and distribute than heroin</i>. </strong>The third difference is in the production processes for poppy-based opioids like heroin and synthetic drugs like fentanyl.<span class=\"annotation__highlight\" data-annotation=\"<p>“From a supplier standpoint, illegally manufactured synthetic opioids have several advantages over plant-based heroin in terms of production and distribution…. Operationally, it takes a few days to produce a batch of fentanyl, while poppy takes months to come to harvest. A single lab employing a trained technician can substitute for a field of poppy that employs scores of laborers. Further, poppy is subject to blight, drought, and eradication. A synthetic opioid can be produced in a small lab, sometimes in a single container, that is easier to conceal from authorities than hectares of poppy would be.” DEA Nat’l Drug Assessment, supra note 30, at 19 (footnote omitted); see also, e.g., Westhoff, supra note 3, at 4–5; Pardo et al., supra note 30, at 2–4.</p>\"><span class=\"annotation-link\">REF</span></span> Synthetic opioids—and other Novel Psychoactive Substances (NPS)<span class=\"annotation__highlight\" data-annotation=\"<p>Westhoff, supra note 3, at 33 (“Historically, only a few handfuls of different compounds have been used reliably to get people high, but over the past hundred years or so, humankind has learned to synthesize the active chemicals in laboratories and to manipulate chemical structures to invent new drugs—the numbers of which began growing exponentially in the 2010s. Anyone with computer acumen can acquire hundreds of psychoactive compounds that didn’t exist even a few years ago. [¶] According to the European Monitoring Centre for Drugs and Drug Addiction, 150 new illicit drugs were bought and sold between 1997 and 2010. Another 150 appeared in just the next three years, and since then, in some years as many as 100 new chemicals have appeared, with synthetic cannabinoids especially common.”).</p>\"><span class=\"annotation-link\">REF</span></span>—have several cost advantages for suppliers over plant-based opioids.<span class=\"annotation__highlight\" data-annotation=\"<p>DEA Nat’l Drug Assessment, supra note 30, at 19; see id. at 20 Tbl. 4.1.</p>\"><span class=\"annotation-link\">REF</span></span> Those factors encourage TCOs to shift to production of synthetic opioids.<span class=\"annotation__highlight\" data-annotation=\"<p>“The supply chain for synthetic opioids differs markedly from that of heroin. The traditional plant-based drug trade has an hourglass shape—with many producers at the top, many retail-level dealers at the bottom, and fewer importers and exporters in the middle (this is illustrated in Figure 4.1). In contrast, the supply chain for illegally produced synthetic opioids is a pyramid that cuts off the large number of producers at the top. Instead, fewer chemists or producers make fentanyl or other synthetic opioids that are shipped via importers and exporters to wholesale and retail distributors. Online distribution and mail-order delivery streamline the process further, by cutting out exporters and sending small amounts of fentanyl directly from producer to users or to importers for further distribution. Consolidating supply chains makes them far more efficient, reduces risks to suppliers, and increases revenues retained by the remaining segments in the chain.” Synthetic Opioid Comm’n, supra note 2, at 20.</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>Heroin is the product of the opium poppy. Because heroin is a Schedule I controlled substance, it cannot be lawfully cultivated within, imported into, or manufactured in the United States. It must be produced elsewhere and then smuggled into this country. Those multiple steps between a poppy field and an end-user add time and expense, upping the cost at each stage of the cultivation, processing, smuggling, transportation, and distribution steps that are necessary to get heroin to street-level dealers and users.<span class=\"annotation__highlight\" data-annotation=\"<p>Like the pizza parlors used in the famous “Pizza Connection” case brought against organized crime in New York City. See United States v. Casamento, 887 F.2d 1141 (2d Cir. 1989).</p>\"><span class=\"annotation-link\">REF</span></span> By contrast, fentanyl is created entirely in a lab from lawfully obtained, inexpensive precursor chemicals.<span class=\"annotation__highlight\" data-annotation=\"<p>Pardo et al., supra note 30, at 2; Kamp et al., supra note 1.</p>\"><span class=\"annotation-link\">REF</span></span> The result is that a far smaller geographic area is necessary to produce fentanyl. In theory, it could be produced in remote labs in the United States, particularly in the vast unsettled areas in Rocky Mountain states.<span class=\"annotation__highlight\" data-annotation=\"<p>Like the area near Albuquerque, New Mexico. See Breaking Bad (AMC 2008–2013).</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>Transportation costs are also lower. Mexico, the primary source of the illicit fentanyl smuggled into this nation, has a 2,000-mile border with four adjacent American states, eliminating the need for the trans-oceanic shipping that is necessary to bring opium from Afghanistan or Southeast Asia into this country. Moreover, fentanyl’s greater potency makes transportation easier and more cost-effective because small quantities of the drug<span class=\"annotation__highlight\" data-annotation=\"<p>The Commission to Combat Synthetic Opioid Trafficking recently estimated that Americans annually use 125 metric tons (a metric ton consists of 1,000 kilograms, or 2,205 pounds) of heroin each year. Synthetic Opioid Comm’n, supra note 2, at 23. Only five metric tons would be necessary to match that demand. Id.</p>\"><span class=\"annotation-link\">REF</span></span> are easier to conceal in vehicles and can also be sent by parcel post, private express carriers, drones, or some other mode of transportation.<span class=\"annotation__highlight\" data-annotation=\"<p>Synthetic Opioid Comm’n, supra note 2, at 22.</p>\"><span class=\"annotation-link\">REF</span></span> The cost of synthesizing, smuggling, and distributing fentanyl is only 1 percent of the cost of trafficking in an equally potent amount of heroin, making fentanyl trafficking preferable from a dose-equivalent or efficiency perspective.<span class=\"annotation__highlight\" data-annotation=\"<p>Pardo et al., supra note 30, at 3, App. A 165–67; Richard G. Frank & Harold A. Pollack, Addressing the Fentanyl Threat to Public Health, 376 New Eng. J. Med. 605, 605 (2017) (“Even with declining prices, heroin costs about $65,000 per kilogram wholesale, whereas illicit fentanyl is available at roughly $3,500 per kilogram. Drug dealers thus face strong incentives to mix fentanyl with heroin and other street drugs.”); Kamp et al., supra note 1 (“[Fentanyl] is also less expensive to make [than heroin]. The plant-based opium needed to produce a kilogram of heroin can cost producers about $6,000, while the precursor chemicals to make a kilogram of fentanyl cost $200 or less, according to Bryce Pardo, associate director of the Rand Corp.’s Drug Policy Research Center, who helped lead a recent bipartisan report on synthetic opioids.”).</p>\"><span class=\"annotation-link\">REF</span></span> Accordingly, because fentanyl and other synthetic opioids “offer economic and tactical advantages that allow criminals to vastly outpace enforcement efforts,” fentanyl is replacing heroin as the principal opioid sold in areas of the nation.<span class=\"annotation__highlight\" data-annotation=\"<p>Synthetic Opioid Comm’n, supra note 2, at xiii; see, e.g., Pardo et al., supra note 30, at xv, 19–23, 35, 56–67; Kamp et al., supra note 1 (“Heroin’s profile has been shrinking as fentanyl becomes more available. Some Mexican poppy farmers in the mountains of Sinaloa say they have lost income as cartels shift away from heroin, and have abandoned their fields.”).</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>Collateral developments also worsen our predicament. Evolutions in communications, cryptography, and transportation media have made the creation, smuggling, and distribution of fentanyl far easier today than had historically been the case for drugs like heroin.<span class=\"annotation__highlight\" data-annotation=\"<p>For example, the famous “Pizza Connection” narcotics smuggling case, see supra note 108, involved operations that took place in the 1980s, long before the technical developments noted above came on stream.</p>\"><span class=\"annotation-link\">REF</span></span> Sellers and buyers of processed fentanyl or its precursor chemicals can meet in cyberspace and communicate via social media or in private over the Dark Web, “a sort of eBay of illicit drugs.”<span class=\"annotation__highlight\" data-annotation=\"<p>James Martin, Drugs on the Dark Net: How Cryptomarkets Are Transforming the Global Trade in Illicit Drugs 3 (2014) (punctuation omitted); see also Westhoff, supra note 3, at 17, 130–39; Madeleine Coggins, Father Who Lost Son to Fentanyl Calls on the Biden Administration to Take Action: We Are Being Massacred,” Fox News, July 21, 2023, https://www.foxnews.com/media/father-lost-son-fentanyl-biden-administration-take-action (“Social media has been linked to the deaths of fentanyl victims in at least 22 states as social-sharing platforms have also been weaponized as drug markets.”); Jan Hoffman, Fentanyl Tainted Pills Bought on Social Media Cause Youth Drug Deaths to Soar, N.Y. Times, May 19, 2022, https://www.nytimes.com/2022​/05/19/health/pills-fentanyl-social-media.html?referringSource=articleShare; Jon Kamp & Julie Wernau, Fentanyl Invades More Illicit Pills, with Deadly Consequences, Wall St. J., Dec. 16, 2021, https://www.wsj.com/articles/fentanyl-invades-more-illicit-pills-with-deadly-consequences-11639650605​?page=1 (“DEA Administrator Anne Milgram said a major concern is the ease with which traffickers are selling their product through social media and encrypted apps. [¶] ‘Social media is the perfect drug trafficking tool,’ she said.”); Kamp & Flores, supra note 34 (“This spring, R.J. Henney showed his mother how he could access the darknet, a restricted part of the internet and a known drug market, she said. A drug shipment his parents later discovered arrived in what looked like a greeting card, with calligraphy on the envelope. Another came in a cellophane-wrapped DVD case for ‘Lord of the Dance,’ an Irish musical.”).</p>\"><span class=\"annotation-link\">REF</span></span> Sellers can deliver purchased goods via a host of private express carriers.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., Synthetic Opioid Comm’n, supra note 2, at 6 (“Globalization, increased trade and travel, the internet, and advances in encrypted communication have all facilitated the illegal trade in synthetic opioids. Insufficient enforcement of chemical controls and oversight of large pharmaceutical industries in Asia contribute to regulatory environments that are conducive to illegal groups, unsanctioned production operations, and companies and individuals willing to flout the rules. The use of internet-based communications and social media also play a critical role linking buyers in Mexico with chemical manufacturers in Asia. Encrypted darknet marketplaces or unmonitored social media forums and business-to-business (B2B) platforms make it easier for distributors to trade in illegally manufactured synthetic opioids or uncontrolled precursors with minimal risks.”) (footnote omitted); Pardo et al., supra note 30, at 2–3.</p>\"><span class=\"annotation-link\">REF</span></span> The result is to make drugs like fentanyl available to an entirely new range of customers. “The people consuming many of these bastardized novel psychotic substances are not traditional hard-drug users.”<span class=\"annotation__highlight\" data-annotation=\"<p>Westhoff, supra note 3, at 17.</p>\"><span class=\"annotation-link\">REF</span></span> Some are “high school kids, college students, and recreational enthusiasts best described as drug nerds,” while others are “psychonauts, thrill seekers who try brand-new drugs that have never been taken before.”<span class=\"annotation__highlight\" data-annotation=\"<p>Id. at 19.</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>Yet fentanyl is similar to heroin and cocaine in one important—and dangerous—respect: It is a white powder.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., CDC, Fentanyl, supra note 12.</p>\"><span class=\"annotation-link\">REF</span></span> Drug dealers can intentionally “step on” drugs like heroin or cocaine by diluting it with less expensive fentanyl to reduce their costs or to give their product an extra “kick” as a means of soliciting repeat business.<span class=\"annotation__highlight\" data-annotation=\"<p>Pardo et al., supra note 30, at 15; Ramin, supra note 4, at 5 (“In October 2018, all twenty-one samples of drugs tested at my clinic in Ottawa, which were sold on the street as heroin, contained fentanyl; none contained heroin.”); Westhoff, supra note 3, at 3; Frank & Pollack, supra note 112, at 605 (“Many people who die from fentanyl overdose appear to have been unaware that they were using the drug. In addition to being mixed with heroin, fentanyl is sometimes sold as methylenedioxymethamphetamine (MDMA), or ecstasy. Recent analysis in Canada showed that fentanyl was present in 89% of seized counterfeit OxyContin tablets. In the United States, recent fatalities have also been attributed to fentanyl in counterfeit Xanax (alprazolam), Norco (acetaminophen–hydrocodone), and other medications.”); Allen, supra note 38 (“‘When people purchase illicit drugs, which is really the way most people are getting fentanyl and other opioids, you don’t really know what you’re getting,’ [emergency room Dr. Arthur] Smolensky said…. It is not uncommon for individuals to ‘think they’re doing one type of drug, and it’s really laced with something completely different,’ Smolensky said.”); Bryce Pardo, Fentanyl in Canadian Drugs—Insights into Mixing Fentanyl and Benzodiazepines from Canadian Drug Seizures, 79 JAMA Psychiatry 81 (2022); Utsha H. Khatri et al., Lethal Fentanyl and Cocaine Intoxication, 379 New Eng. J. Med. 1782 (2018); Kamp & Wernau, supra note 115 (“Illegally made pills may contain unpredictable and poorly mixed amounts of fentanyl. ‘These are not pharmacists,’ Dr. Pardo said.”); Nir, supra note 30 (“Fentanyl’s spread has been pushed by the profit imperative, according to interviews with dealers: On each leg of the journey of a drug like heroin or cocaine, from cartel to end user, sellers often cut the pure product with cheap powders that are similar in appearance, a process known as ‘stepping on’ the drug. Once it was things like baby formula; today, it is likely to be fentanyl. [¶] There is no quality control: A street dealer might cut fentanyl into cocaine that already contains it, creating a lethal dose. [¶] In interviews, dealers described lacing as completely ad hoc. One said she measured out fentanyl with a McDonald’s ice cream spoon, leveled with a playing card. More than one dealer did not measure at all, spritzing liquid fentanyl onto baking sheets of marijuana, creating a once-rare concoction that some dealers say is increasingly requested.”).</p>\"><span class=\"annotation-link\">REF</span></span> Of course, a result is that there is no uniformity in how much fentanyl can be found in any package or pill.<span class=\"annotation__highlight\" data-annotation=\"<p>Westhoff, supra note 3, at 156 (“The Mexican cartels preparing the fentanyl tend to use crude methods. ‘It’s not like they’re in a laboratory and measuring how much is in it, they just take the fentanyl and stir it with a spoon,’ said Doug Coleman of the DEA. ‘So you may take one hit with 1 milligram of fentanyl, and next you take a hit with 7 milligrams of fentanyl in it.”).</p>\"><span class=\"annotation-link\">REF</span></span> Fentanyl can also wind up unintentionally mixed into heroin and cocaine by dealers who are less than fastidious about how they package their wares.<span class=\"annotation__highlight\" data-annotation=\"<p>Id.</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>Many juvenile or young heroin or cocaine users purchase illegal drugs over social media,<span class=\"annotation__highlight\" data-annotation=\"<p>See supra note 45.</p>\"><span class=\"annotation-link\">REF</span></span> but they “have no idea just how potent and dangerous these new drugs can be.”<span class=\"annotation__highlight\" data-annotation=\"<p>Westhoff, supra note 3, at 17; Pardo & Reuter, supra note 46, at 4 (“The counterfeit tablet phenomenon is more worrying, given that these fakes are made to look like genuine products of consistent dose, whereas illegal manufacturers do not sample product to ensure an even distribution of active ingredient in these fraudulent tablets.”).</p>\"><span class=\"annotation-link\">REF</span></span> That ignorance can be costly; in fact, it already has been.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., Georgetown Behavioral Hosp., supra note 34 (“Across the United States, fentanyl lacing has greatly contributed to fatal overdoses. Since fentanyl is so strong and cheap to make, dealers add it to other, more expensive drugs to cut down on their costs. Fentanyl has been found to be laced into essentially every black market drug, including: • Cocaine • Heroin • Oxycontin • Xanax • Ecstasy[.]”) (punctuation omitted); Hoffman, supra note 116.</p>\"><span class=\"annotation-link\">REF</span></span> Because one never knows how much fentanyl is in heroin or cocaine powder, or in counterfeit pills, using them is like playing Russian Roulette with more than one round in the chamber.<span class=\"annotation__highlight\" data-annotation=\"<p>Westhoff, supra note 3, at 156; id. (“This lack of information, at root, is the primary cause for the fentanyl overdose crisis, the reason so many people are dying.”); see, e.g., DEA Nat’l Drug Assessment, supra note 30, at 10 (“Fentanyl is often reported as a single drug entity—approximately 58 percent of fentanyl reports to [National Forensic Laboratory Information System]-Drug in 2019—but it continues to be observed in mixtures with other drugs, contributing to fentanyl’s involvement not only in the opioid crisis, but also exacerbating the threats posed by other drugs….”); id. at 32 (“Cocaine and fentanyl or other [synthetic opioids other than methadone, or SOOTM] may be packaged together for street sale without the knowledge of the user and/or seller, which can lead to adverse reactions in those who lack the opioid tolerance of a habitual opioid user.”); Olivastro, supra note 97 (“The threat to the American public couldn’t be starker. Fentanyl is now the leading cause of death for Americans between the ages of 18 and 45, according to Families Against Fentanyl. It killed more people last year than suicide, car accidents, or gun violence; and the number of fatalities has more than doubled in 30 states in just two years, more than tripled in 15 states, and increased almost five-fold in six states.”); Kamp et al., supra note 1 (“[Fentanyl’s] potency and the lack of quality control in the black market make it easy to cause overdoses—including when users don’t know that fentanyl is laced into or simply sold as other drugs.”); Kamp & Wernau, supra note 115.</p>\"><span class=\"annotation-link\">REF</span></span> Want proof? Fentanyl was present in the system of 40 percent of the people who overdosed and died from cocaine in 2016.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., Westhoff, supra note 3, at 31–32; Ramin, supra note 4, at 53 (noting that in 2016, fentanyl was found present in the system of 76 percent of all overdose fatalities, as well as 85 percent of the ones age 15–29, along with drugs such as cocaine, methamphetamine, and alcohol).</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>There is an additional, more ominous aspect of illicit fentanyl sales. Americans are accustomed to and prefer taking drugs by swallowing pills rather than receiving or self-administering injections, so the cartels use commercial-grade presses to manufacture counterfeit pills containing fentanyl, either in part or entirely, creating look-alikes for legitimate prescription drugs such as OxyContin or Adderall.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., Synthetic Opioid Comm’n, supra note 2, at xi (“The emergence of counterfeit tablets that contain minute quantities of synthetic opioids is particularly troubling. Drug traffickers in Mexico produce most of these tablets, but illegal pill pressing does occur to a lesser extent in the United States and Canada. Counterfeit tablets sometimes contain, and conceal, dangerous and inconsistent doses of fentanyl. These fakes are potentially fatal, especially for unsuspecting buyers or others who might casually consume diverted prescription medications. Counterfeit tablets can also be attractive to people who do not inject or snort powders. Americans are accustomed to and prefer taking prescription pills, making fake tablets an attractive opportunity for illegal suppliers to expand their markets.”); Drug Enforcement Admin., U.S. Dep’t of Justice, DEA-DCT-DIB-021-16, Counterfeit Prescription Pills Containing Fentanyls: A Global Threat 2 (July 2016); Pardo et al., supra note 30, at 3; Westhoff, supra note 3, at 31; Louis Casiano, Minnesota Fentanyl Pill Bust Could Be Largest Seizure in Midwest, Cops Say, Fox News, Sept. 29, 2022, https://www.foxnews.com/us/minnesota-fentanyl-pill-bust-midwest (“This is enough fentanyl to kill a fifth of the entire state’s population.”); Audrey Conklin, Fentanyl in Disguise: Expert Calls Deadly Opioid’s Presence a “Slow Motion Chemical Weapon Attack,” Fox News, Sept. 14, 2022, https://www.foxnews.com/us/fentanyl-disguise-expert-calls-deadly-opioidss-presence-slow-motional-chemical-weapon-attack (“Fentanyl is more frequently appearing in disguised forms like prescription pills and ‘rainbow fentanyl.’”); Sadie Gurman, DEA Agents Arrest 800 in the U.S. in Crackdown on Illegal Sales of Drugs Laced with Fentanyl, Wall St. J., Sept. 30, 2021, https://www.wsj.com/articles/dea-agents-arrest-800-in-the-u-s​-in-crackdown-on-illegal-sales-of-drugs-laced-with-fentanyl-11633039984?page=1 (noting that in 2021, drug-enforcement agents had seized more than 11 million fake pills laced with fentanyl by September); Hoffman, supra note 116 (photographs of look-alike pills); Kamp & Wernau, supra note 115 (“Federal authorities say they are encountering more pills passing for medications such as oxycodone that contain fentanyl. They have seized more than 20 million fake pills this year, the vast majority containing fentanyl, the Drug Enforcement Administration said Thursday. [¶] ‘The supply of these pills is going up exponentially,’ said Joseph Palamar, an associate professor and drug epidemiologist at New York University Langone Health. ‘They are easy to transport and difficult to track. Pills are the ultimate fake out. You can fake out your parents, your friends, your partner, law enforcement.’ [¶] The mass production of such pills by Mexican cartels has escalated the threat, according to the DEA.”); Arya Sundaram, Officials Warn of Fake Adderall Pills After Two College Students Die, N.Y. Times, May 7, 2022, https://www.nytimes.com/2022/05/07/us/adderall-fentanyl-osu-deaths.html?searchResultPosition=8.</p>\"><span class=\"annotation-link\">REF</span></span> The machines allow the cartels to manufacture millions of pills.<span class=\"annotation__highlight\" data-annotation=\"<p>See Drug Enforcement Admin., U.S. Dep’t of Justice, One Pill Can Kill (undated) [hereafter DEA, One Pill Can Kill], https://www.dea.gov/onepill (last accessed Oct. 23, 2022) (noting that from May 23 through September 8, 2022, the DEA seized more than 10.2 million fentanyl pills); supra note 129 and infra note 134 (collecting authorities).</p>\"><span class=\"annotation-link\">REF</span></span> The goal is to attract new customers.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., Hoffman, supra note 116 (“The result is that new waves of customers are swiftly becoming addicted, said Dr. Nora Volkow, director of the National Institute on Drug Abuse. ‘When you are putting fentanyl in pills that are sold as benzodiazepines or for pain, you are reaching a new group of customers that you wouldn’t have if you were just selling fentanyl powder.’”).</p>\"><span class=\"annotation-link\">REF</span></span> To entice juveniles, the cartels also manufacture pills in various colors to make them look like candy.<span class=\"annotation__highlight\" data-annotation=\"<p>See Drug Enforcement Admin., Press Release: DEA Warns of Brightly-Colored Fentanyl Used to Target Young Americans, Aug. 30, 2022 (“‘Rainbow fentanyl—fentanyl pills and powder that come in a variety of bright colors, shapes, and sizes—is a deliberate effort by drug traffickers to drive addiction amongst kids and young adults,’ said DEA Administrator Anne Milgram.”); see also, e.g., DEA, One Pill Can Kill, supra note 129 (displaying photographs of counterfeit pills laced with fentanyl); Louis Casiano, Los Angeles School Students Ingest Ecstasy Pills Laced with Fentanyl, Superintendent Says, CBS News, June 2, 2022, https://www.foxnews.com/us/los-angeles-students-ingest-ecstasy-pills-fentanyl (story contains a photograph of ecstasy pills laced with fentanyl that were made in numerous colors); Conklin, supra note 128.</p>\"><span class=\"annotation-link\">REF</span></span> Even more horrifying, shortly before Halloween in 2022, law enforcement authorities at the Los Angeles International Airport seized thousands of suspected fentanyl pills disguised in popular candy packages.<span class=\"annotation__highlight\" data-annotation=\"<p>Sarah Rumpf, 12,000 Fentanyl Pills Found Packaged in Candy at LAX TSA Checkpoint, Fox News, Oct. 20, 2022, https://www.foxnews.com/us/fentanyl​-pills-found-packaged-candy-lax-tsa-checkpoint (“Authorities found the dangerous opioid inside boxes of Sweettarts, Skittles and Whoppers, officials said.”).</p>\"><span class=\"annotation-link\">REF</span></span> It is not difficult to imagine the reaction of thousands of parents whose children overdosed and died from ingesting those candies had they reached their destinations.</p>\n\n<p>Across the nation, law enforcement has seized millions of counterfeit pills containing fentanyl and have witnessed unprecedented numbers of fatal fentanyl-induced overdoses.<span class=\"annotation__highlight\" data-annotation=\"<p>See DEA Nat’l Drug Assessment, supra note 30, at 9 (“The U.S. Drug Enforcement Administration (DEA) has reported that the numbers of counterfeit pills seized in the United States increased more than seven times, from 2.6 million in fiscal year (FY) 2019 to more than 20 million in FY 2021.”) (footnote omitted); see also, e.g., Paul Best, Virginia Police Seize 5,000 Counterfeit Fentanyl-Laced Pills, Arrest Four, Fox News, May 4, 2022, https://​www.foxnews.com/us/virginia-police-seize-5000-counterfeit-fentanyl-laced-pills-arrest-four; Louis Casiano, Colorado Fentanyl Seizures This Year Already Surpass All of Last Year, Authorities Say, Fox News, June 2, 2022, https://www.foxnews.com/us/colorado-fentanyl-seizures-surpass-last-year; Rahul Gupta, China Should Rejoin the U.S. in the Opioid Crisis, Wall St. J., Aug. 22, 2022, https://www.wsj.com/articles/china-should-rejoin-the-u-s​-in-the-fentanyl-fight-synthetic-drugs-opioid-trade-imports-beijing-crime-violence-corruption-11661199859?mod=opinion_lead_pos8 (Gupta is the Director of the U.S. Office of National Drug Control Policy; photograph of thousands of seized pills containing fentanyl); Elizabeth Heckman, Idaho Sheriff Says Area “Overwhelmed” by Fentanyl Overdoses: “This Is at Everyone’s Doorstep,” Fox News, Apr. 8, 2022, https://www.foxnews.com/media​/border-crisis-fentanyl-biden-idaho-sheriff-overwhelmed; Kamp et al., supra note 1 (“U.S. seizures last year included 20.4 million fake pills, according to the DEA. Fentanyl and other drugs are often ferried across the southern border hidden in secret compartments of vehicles.”); Olivastro, supra note 97 (“Earlier this year, Texas Governor Greg Abbott sounded the alarm about the large amount of fentanyl coming through the southwest border, noting that his state had seized enough to kill 222 million Americans, or 67 percent of the total U.S. population.”); Adam Sabes, Colorado State Patrol Seizes Enough Fentanyl to Kill 25 Million People, Fox News, July 1, 2022, https://www.foxnews.com/us/colorado-state-patrol-seizes-fentanyl-kill-25​-million-people (“Figures by the DEA say that one kilogram of fentanyl can kill up to 500,000 people. The bust on June 20 had the potential to kill over 25 million people, according to those figures. [¶] From January to May, over 2 million dosages of fentanyl units were seized by Colorado authorities, which surpasses the amount from last year.”).</p>\"><span class=\"annotation-link\">REF</span></span> However that happens, the presence of fentanyl in an illicit drug can wind up causing someone to die from its use, whether that someone is a celebrity or an average everyday American.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., Jonah Engel Bromwich, Prince Overdosed on Fentanyl. What Is It?, N.Y. Times, June 2, 2016, https://www.nytimes.com/2016/06/03/health​/what-is-fentanyl.html?searchResultPosition=12; Paulina Dedaj, Ravens’ Jaylon Ferguson Died from Combined Effects of Fentanyl, Cocaine: Report, Fox News, July 1, 2022, https://www.foxnews.com/sports/ravens-jaylon-ferguson-died-fentanyl-cocaine; Olivia Lank et al., 13-Year-Old Dies Following Fentanyl-Related Overdose at Hartford School, 22WWLP.com, Jan. 16, 2022, https://www.wwlp.com/news/connecticut/police-teen-in-grave-condition​-after-ingesting-substance-at-sports-and-medical-sciences-academy-in-hartford/; Andy Newman, Fentanyl in Bottle Kills Toddler, and Father Is Charged, N.Y. Times, Dec. 2, 2021, https://www.nytimes.com/2021/12/02/nyregion/father-charged-toddler-fentanyl-death.html; Ginger Adams Otis & Christian Richey, Four Men Arrested in Drug Overdose Death of “The Wire” Actor Michael K. Williams, Wall St. J., Feb. 2, 2022), https://www.wsj.com​/articles/four-men-arrested-in-drug-overdose-death-of-the-wire-actor-michael-k-williams-11643836893?page=1.</p>\"><span class=\"annotation-link\">REF</span></span> As author Ben Westhoff has written, “Until recently young people could often take drugs at parties without risking much more than a bad hangover. Now, however, any black market pill or powder could contain a lethal dose of fentanyl.”<span class=\"annotation__highlight\" data-annotation=\"<p>Westhoff, supra note 3, at 32; id. at 31 (“A 2019 DEA report noted that more than one in four seized counterfeit prescription pills contained a potentially lethal dose of fentanyl. The amounts vary greatly. One might have ten times as much fentanyl as the next. Investigators believe such counterfeit pills were responsible for the death of music star Prince in 2016; about one hundred white pills found on his property looked exactly like Vicodin but actually contained fentanyl.”); id. (“Cocaine can also be spiked with fentanyl. American cocaine overdose deaths remained fairly steady throughout the first decade of the 2000s—ranging from roughly four thousand to seven thousand—but in the second decade began to surge, exceeding fourteen thousand in 2017. Fentanyl is part of the reason for this.”); see also, e.g., Kamp & Wernau, supra note 115 (“Now, if you’re a casual consumer, partying on the weekends, it can be the case that someone hands out pills—you overdose and die,” he [Bryce Pardo] said.”); Margot Patrick, Three New Yorkers Ordered Cocaine from the Same Delivery Service. All Died from Fentanyl, Wall St. J., Oct. 23, 2022, https://www.wsj.com/articles/fentanyl-cocaine​-new-yorkers-drug-delivery-service-all-died-11666526726 (“Traffickers have found ]fentanyl] is easy and inexpensive to make. The illicit form has spread throughout the illegal drug market, turning up in heroin as well as pills stamped out to look like oxycodone or Adderall and other drugs. [¶] Dealers also cut it into cocaine, a stimulant, to be more potent and addictive, introducing the drug to unsuspecting buyers. A tiny amount of fentanyl can kill unseasoned users.”); Georgetown Behavioral Hosp., supra note 34; Friedman et al., supra note 33.</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>Unfortunately, this problem will only worsen over time.<span class=\"annotation__highlight\" data-annotation=\"<p>See DEA Nat’l Drug Assessment, supra note 30, at 17 (“The heroin and fentanyl markets, already intertwined, will continue to grow as traffickers mix heroin with fentanyl to stretch heroin supplies and maximize revenues. Fentanyl and other synthetic opioids will likely continue to contribute to high numbers of drug overdose deaths in the United States in the near term, as fentanyl availability either by itself or mixed in with other drugs—particularly heroin—continues to persist. However, overdose deaths involving heroin alone may stabilize or continue to decline in the near term. The low cost, high potency, and ease of acquisition of fentanyl may encourage heroin users to switch to the drug should future heroin supplies be disrupted. As Mexico is the dominant supplier of heroin entering the United States, additional restrictions or limits on travel across the U.S.–Mexico border due to pandemic concerns will likely impact heroin DTOs, particularly those using couriers or personal vehicles to smuggle heroin into the United States. Another possibility may be a decrease in the price level for heroin as DTOs and street-level dealers maximize associated profit margins by increasingly mixing fentanyl into distributed heroin. DTOs may come to view heroin as simply an adulterant to fentanyl. Mexican TCOs will remain the primary source of supply for heroin and fentanyl smuggled into the United States, using precursors primarily sourced from China, and they will continue to use their extensive infrastructure in both Mexico and the United States to supply lucrative U.S. opioid markets.”).</p>\"><span class=\"annotation-link\">REF</span></span> Fentanyl shows that enterprising chemists are able to create new synthetic opioids, and the Mexican cartels are willing to expand their operations to create new drugs for both existing and new markets.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., DEA Nat’l Drug Assessment, supra note 30, at 14 (“DEA reporting indicates that Mexican TCOs are significantly involved in fentanyl production. The Sinaloa Cartel and the Jalisco New Generation Cartel (CJNG) appear to be increasing the production of wholesale quantities of fentanyl in both powder and pill forms. Additionally, these TCOs are diversifying their precursor chemical sources of supply, and moving to precursor chemicals further down the synthesis chain to avoid international chemical controls.”); Pardo et al., supra note 30, at xvi (“Much as the synthesis of heroin in the late 19th century displaced morphine and forever changed the opiate landscape, the country may again be standing at the precipice of a new era: Inexpensive, accessible, and mass-produced synthetic opioids might displace heroin, which could have important and hard-to-predict consequences.”); Westhoff, supra note 3, at 33 (“According to the European Monitoring Centre for Drugs and Drug Addiction, 150 new illicit drugs were bought and sold between 1997 and 2010. Another 150 appeared in just the next three years, and since then, in some years as many as 100 new chemicals have appeared, with synthetic cannabinoids especially common.”), 82–90 (discussing the development of synthetic cannabinoids, such as K2), 158 (“In the United States, fentanyl has been hugely profitable for the [Mexican] cartels, and despite its staggering death count, it may have only scratched the surface.”).</p>\"><span class=\"annotation-link\">REF</span></span> Given Mexico’s economic problems, Mexican TCOs also have no shortage of young men willing to join their ranks for the money and prestige that comes with cartel membership.<span class=\"annotation__highlight\" data-annotation=\"<p>“They have this saying here, ‘Mas vale vivir cinco anos campo rey que cincuenta como guey,’ said Deborah Bonello. It’s better to live five years as a king, than fifty as a loser.” Westhoff, supra note 3, at 159.</p>\"><span class=\"annotation-link\">REF</span></span> Stopping the smuggling of fentanyl into the United States is a matter of life and death. The question is not whether but how many Americans will die from fentanyl smuggling and distribution.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., CDC, Fentanyl, supra note 11 (“Rates of overdose deaths involving synthetic opioids other than methadone, which includes fentanyl and fentanyl analogs, increased over 16% from 2018 to 2019. Overdose deaths involving synthetic opioids were nearly 12 times higher in 2019 than in 2013. More than 36,000 people died from overdoses involving synthetic opioids in 2019. The latest provisional drug overdose death counts through May 2020 suggest an acceleration of overdose deaths during the COVID-19 pandemic.”) (footnotes omitted); Pardo et al., supra note 30, at xv, 11–12 (noting that overdose fatalities involving fentanyl or an analogue outnumber overdose death from heroin or semisynthetic drugs by a 2:1 ratio), 35 (suggesting that illicit fentanyl might be replacing heroin in some locations).</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<h3>The Bottom Line</h3>\n\n<p>Fentanyl is the Black Mamba of illicit drugs. Its fangs contain a quick-acting, extremely aggressive, highly potent, merciless, and remorseless venom that kills in the blink of an eye. “Never…has an opiate—or any other drug, for that matter—killed so many annually as the fentanyl epidemic.”<span class=\"annotation__highlight\" data-annotation=\"<p>Westhoff, supra note 3, at 25.</p>\"><span class=\"annotation-link\">REF</span></span> Illicit fentanyl use is a public health problem of historic proportions.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., CDC, Fentanyl, supra note 12 (“Rates of overdose deaths involving synthetic opioids other than methadone, which includes fentanyl and fentanyl analogs, increased over 16% from 2018 to 2019. Overdose deaths involving synthetic opioids were nearly 12 times higher in 2019 than in 2013. More than 36,000 people died from overdoses involving synthetic opioids in 2019. The latest provisional drug overdose death counts through May 2020 suggest an acceleration of overdose deaths during the COVID-19 pandemic.”) (footnotes omitted).</p>\"><span class=\"annotation-link\">REF</span></span> As a 2018 Brookings Institution report noted, “Replacing drugs derived from plants (e.g., heroin, cannabis) with synthetic analogues (e.g., fentanyl, Spice/K2) could be the most disruptive innovation in the history of the international drug trade.”<span class=\"annotation__highlight\" data-annotation=\"<p>Vanda Felbab-Brown et al., How Synthetic Opioids Can Radically Change Global Illegal Drug Markets and Foreign Policy, Brookings Inst., Apr. 30, 2018, https://www.brookings.edu/blog/order-from-chaos/2018/04/30/how-synthetic-opioids-can-radically-change-global-illegal-drug-markets-and​-foreign-policy/; see also, e.g., Keith Humphreys et al., Opioids of the Masses, 97 Foreign Affs. 118 (May/June 2018).</p>\"><span class=\"annotation-link\">REF</span></span> The recent federal Commission to Combat Synthetic Opioid Trafficking concluded that “the trafficking of synthetic drugs into the United States [is] not just a public health emergency but a national emergency that threatens both the national security and economic well-being of the country.”<span class=\"annotation__highlight\" data-annotation=\"<p>Synthetic Opioid Comm’n, supra note 2, at ix, x.</p>\"><span class=\"annotation-link\">REF</span></span> Medical and law enforcement professionals agree on the nature of the problem and the need to stop its murderous assault on the nation.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., Pardo et al., supra note 30, at xv, 11–12 (noting that overdose fatalities involving fentanyl or an analogue outnumber overdose death from heroin or semisynthetic drugs by a 2:1 ratio), 35 (suggesting that illicit fentanyl might be replacing heroin in some locations); Westhoff, supra note 3, at 4 (“‘Today we are facing the most deadly crisis in American history,’ then U.S. Attorney General Jeff Sessions said during a 2018 press conference. ‘We’ve never seen anything like it.’”); id. (“‘Fentanyl is the game changer,’ Special Agent in Charge James Hunt of the US Drug Enforcement Administration (DEA) told Vice. ‘It’s the most dangerous substance in the history of drug trafficking. Heroin and cocaine pale in comparison to how dangerous fentanyl is.’”); id. at 25 (“Never…has an opiate—or any other drug, for that matter—killed so many people annually as the fentanyl epidemic.”); id. at 51 (“[By 2016,] fentanyl had shot past heroin and was killing more Americans annually than any other drug in American history. And the fentanyl analogues, which are being developed and marketed at a rapid clip, threaten to make the problem worse.”); cf. id. at 20 (“The former director of the DEA’s Special Operations Division, Derek Maltz, used stark terms to describe the fentanyl-driven opioid epidemic. ‘Where it becomes a national security emergency is the connectivity between the drug traffickers and the terrorists that are out there that are trying to destroy our way of life,’ he said in November 2018.”).</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>A joint federal–state response is necessary because this threat will not pass into the night and the states cannot handle it alone. As the Commission to Combat Synthetic Opioid Trafficking concluded earlier this year, given all the features that make fentanyl dangerous—its relatively greater potency than plant-based opioids, its relatively simple and inexpensive production and distribution process, the vast areas in Mexico where the drug can be synthesized, the cartels’ demonstrated willingness to exploit every advantage that the United States offers for drug trafficking, and the refusal of Presidents López Obrador and Joe Biden to stop fentanyl smuggling from Mexico into the United States<span class=\"annotation__highlight\" data-annotation=\"<p>Law enforcement alone cannot eliminate fentanyl abuse; both supply-side and demand-side approaches are necessary. See Synthetic Opioid Comm’n, supra note 2, at x (“The difficult truth is that there is no easy solution to the synthetic opioid problem. The supply of illicit fentanyl cannot be permanently stopped through enforcement alone—only temporarily disrupted before another cartel, trafficking method, or analogue steps in to fill the market that addiction creates. U.S. and Mexican efforts can disrupt the flow of synthetic opioids across U.S. borders, but real progress can come only by pairing illicit synthetic opioid supply disruption with decreasing the domestic U.S. demand for these drugs.”); Frank & Pollack, supra note 112, at 606 (“Within the policing arena, traditional drug-enforcement approaches emphasize use reduction. Given the dangers of a substance such as fentanyl, use reduction can indeed benefit public health by deterring distribution, sale, and use. Cracking down on illegal laboratories and other links in the supply chain would probably help disrupt the fentanyl market. [¶] Over time, however, use reduction has often provided too little incentive for illegal-market participants to reduce public health risks. Indeed, law-enforcement policies can aggravate public health harms. For example, intensive policing interventions—particularly those targeting buyers caught with syringes—increase needle sharing, raising the risk of HIV transmission.”); id. at 607 (“Fentanyl’s low production costs and high death toll pose a distinctive challenge that requires a concerted response. We believe a full package of prevention, treatment, and harm-reduction interventions is the best bet for reducing a frightening public health threat and saving lives.”); Nora Volkow & Francis S. Collins, The Role of Science in Addressing the Opioid Crisis, 377 New Eng. J. Med. 391 (2017); Nora Volkow et al., Medication-Assisted Therapies—Tackling the Opioid Overdose Epidemic, 370 New Eng. J. Med. 2063 (2014). A future Heritage paper will discuss some responsive steps.</p>\"><span class=\"annotation-link\">REF</span></span>—“a transition from heroin or diverted prescription opioids to more-potent synthetic opioids is here to stay.”<span class=\"annotation__highlight\" data-annotation=\"<p>Synthetic Opioid Comm’n, supra note 2, at 3, 6.</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<h3>Conclusion</h3>\n\n<p>According to Jim Crotty, Deputy Chief of Staff at the Drug Enforcement Administration from 2019 to 2021, fentanyl “is in fact the most pernicious, the most devastating drug that we have ever seen.”<span class=\"annotation__highlight\" data-annotation=\"<p>Kamp et al., supra note 1.</p>\"><span class=\"annotation-link\">REF</span></span> Adding a little bit of black humor, Crotty said that if fentanyl “were an athlete, people would call it ‘The G.O.A.T.’”<span class=\"annotation__highlight\" data-annotation=\"<p>Id.</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>All jokes aside, the facts show that Crotty is right. We have long known that while opioids can relieve pain, they also can destroy life. Generally, they work slowly by reducing users to the ever-hungry souls in a Buddhist afterlife. Sometimes, though, they act more quickly, leaving no opportunity for the inexperienced user or for someone who succumbs to reuse after becoming “clean.” Fentanyl, however, does not give many users the opportunity for redemption; it can kill in the blink of an eye. Worse still, fentanyl can kill unwitting or novice users. Opioid users once had the chance to survive a poor choice—to walk away after youthful experimentation or to hit rock bottom after being hooked but then realizing that they needed to turn their lives around. Now users frequently do not get that second chance.</p>\n\n<p>We need to educate people about fentanyl’s danger, persuade them not to run the risks it poses, and stop the sale of poison to our fellow citizens. Andrew Olivastro, a colleague of mine at The Heritage Foundation, once wrote, “In this war, the drugs are winning. The battle must be joined.” Fentanyl proves that he is right.</p>\n\n<p><i><b>Paul J. Larkin</b> is the John, Barbara, and Victoria Rumpel Senior Legal Research Fellow in the Edwin Meese III Center for Legal and Judicial Studies at The Heritage Foundation. </i></p>",
  "pubDate": "Tue, 01 Nov 2022 15:42:20 -0400",
  "dc:creator": "Paul J. Larkin",
  "guid": "https://www.heritage.org/crime-and-justice/report/twenty-first-century-illicit-drugs-and-their-discontents-the-scourge"
}