{
  "title": "Regression Compatible Listwise Objectives for Calibrated Ranking. (arXiv:2211.01494v1 [cs.IR])",
  "link": "http://arxiv.org/abs/2211.01494",
  "description": "<p>As Learning-to-Rank (LTR) approaches primarily seek to improve ranking\nquality, their output scores are not scale-calibrated by design -- for example,\nadding a constant to the score of each item on the list will not affect the\nlist ordering. This fundamentally limits LTR usage in score-sensitive\napplications. Though a simple multi-objective approach that combines a\nregression and a ranking objective can effectively learn scale-calibrated\nscores, we argue that the two objectives can be inherently conflicting, which\nmakes the trade-off far from ideal for both of them. In this paper, we propose\na novel regression compatible ranking (RCR) approach to achieve a better\ntrade-off. The advantage of the proposed approach is that the regression and\nranking components are well aligned which brings new opportunities for\nharmonious regression and ranking. Theoretically, we show that the two\ncomponents share the same minimizer at global minima while the regression\ncomponent ensures scale calibration. Empirically, we show that the proposed\napproach performs well on both regression and ranking metrics on several public\nLTR datasets, and significantly improves the Pareto frontiers in the context of\nmulti-objective optimization. Furthermore, we evaluated the proposed approach\non YouTube Search and found that it not only improved the ranking quality of\nthe production pCTR model, but also brought gains to the click prediction\naccuracy.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Bai_A/0/1/0/all/0/1\">Aijun Bai</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Jagerman_R/0/1/0/all/0/1\">Rolf Jagerman</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Qin_Z/0/1/0/all/0/1\">Zhen Qin</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kar_P/0/1/0/all/0/1\">Pratyush Kar</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Lin_B/0/1/0/all/0/1\">Bing-Rong Lin</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_X/0/1/0/all/0/1\">Xuanhui Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Bendersky_M/0/1/0/all/0/1\">Michael Bendersky</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Najork_M/0/1/0/all/0/1\">Marc Najork</a>"
}