{
  "title": "499: Life As An Adult Harry Potter Fan",
  "link": "https://audioboom.com/posts/7788046",
  "itunes:episode": 499,
  "itunes:title": "Life As An Adult Harry Potter Fan",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3756,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Welcome to our listener and <a href=\"https://www.patreon.com/mugglecast/\">Patron</a> Julia, whose son Wyatt sent us a great question a few weeks ago.</li>\n<li>News: As we predicted, a Potter television series is reportedly in the works. And, <em>Fantastic Beasts 3</em> finishes filming this week!</li>\n<li>In Bonus MuggleCast, available on our Patron, we'll discuss when to expect more news and updates about the third Fantastic Beasts movie.</li>\n<li>Today we discuss the trials and tribulations of being an adult fan of the <em>Harry Potter</em> series!</li>\n<li>The hosts discuss whether they've received backlash for liking Harry Potter as adults.</li>\n<li>How the New York Times Bestseller List  cleverly sidelined Harry Potter back in the heyday to make room for more \"adult\" book series</li>\n<li>Eric discovered a 2003 <em>Telegraph</em> article overflowing with derision for adults who like \"kids movies\"</li>\n<li>We discuss the United Kingdom \"adult edition\" book covers, and ask why Scholastic never did the same thing in the United States.</li>\n<li>Listeners who got into Harry Potter as adults weigh in over on <a href=\"https://www.twitter.com/mugglecast/\">Twitter</a>!</li>\n<li>When is the best time to get your child into Harry Potter? Julia gives her thoughts!</li>\n<li>Troll in the Dungeon: Andrew takes on 3 incredible personas and grills the hosts to defend their love of Harry.</li>\n<li>Quizzitch: What statue resides next to the Prefect’s Bathroom?</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 02 Feb 2021 12:00:00 +0000",
  "guid": "tag:audioboom.com,2021-02-01:/posts/7788046",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}