{
  "title": "Characterizing Virtual Reality Software Testing. (arXiv:2211.01992v1 [cs.SE])",
  "link": "http://arxiv.org/abs/2211.01992",
  "description": "<p>Virtual Reality (VR) is an emerging technique that provides a unique\nreal-time experience for users. VR technologies have provided revolutionary\nuser experiences in various scenarios (e.g., training, education,\nproduct/architecture design, gaming, remote conference/tour, etc.). However,\ntesting VR applications is challenging due to their nature which necessitates\nphysical interactivity, and their reliance on hardware systems. Despite the\nrecent advancements in VR technology and its usage scenarios, we still know\nlittle about VR application testing. To fill up this knowledge gap, we\nperformed an empirical study on 97 open-source VR applications including 28\nindustrial projects. Our analysis identified that 74.2% of the VR projects\nevaluated did not have any tests, and for the VR projects that did, the median\nfunctional-method to test-method ratio was low in comparison to other project\ncategories. Moreover, we uncovered tool support issues concerning the\nmeasurement of VR code coverage, and the code coverage and assertion density\nresults we were able to generate were also relatively low, as they respectively\nhad averages of 15.63% and 17.69%. Finally, through manual analysis of 220 test\ncases from four VR applications and 281 test cases from four non-VR\napplications, we identified that VR applications require specific categories of\ntest cases to ensure VR application quality attributes. We believe that our\nfindings constitute a call to action for the VR development community to\nimprove testing aspects and provide directions for software engineering\nresearchers to develop advanced techniques for automatic test case generation\nand test quality analysis for VR applications.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Rzig_D/0/1/0/all/0/1\">Dhia Elhaq Rzig</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Iqbal_N/0/1/0/all/0/1\">Nafees Iqbal</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Attisano_I/0/1/0/all/0/1\">Isabella Attisano</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Qin_X/0/1/0/all/0/1\">Xue Qin</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Hassan_F/0/1/0/all/0/1\">Foyzul Hassan</a>"
}