{
  "title": "EPISODE 81: The Other 300 (Part 1)",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Mon, 17 Jan 2022 21:35:43 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2022/1/17/episode-81-the-other-300-part-1",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:61e5e09b3afeaa586a1a7905",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/355a2984-7d0e-423d-ac00-99032182e32b/HOF-81-TheOther300-Pt01.jpg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"61e5e0ee38ef861067ccf7fd\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/355a2984-7d0e-423d-ac00-99032182e32b/HOF-81-TheOther300-Pt01.jpg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“There was no uproar, and no silence either, but that certain type of noise that results from anger and battle. Clashing shield on shield, they were shoving, fighting, killing, dying.”</em> — Xenophon</p><p class=\"\"><em>“Pelopidas, after receiving seven wounds in front, sank down upon a great heap of friends and enemies who lay dead together; but Epaminondas, although he thought him lifeless, stood forth to defend his body and his arms, and fought desperately, single-handed against many, determined to die rather than leave Pelopidas lying there.” —</em> Plutarch </p><p class=\"\"><em>“Urgent matters tomorrow!”</em> — Archias </p><p class=\"\"><em>“If by… an army, of lovers and their young loves could come into being . . . then, fighting along- side one another, such men, though few in number, could defeat practically all humankind. For a man in love would rather have anyone other than his lover see him leave his place in the line or toss away his weapons, and often would rather die on behalf of the one he loves.”</em>  — Plato</p><p class=\"\"><em>“If we are to have peace. it must be on the basis of equality and justice. If we aren’t all equal, then peace won’t endure.”</em> — Epaminondas</p><p class=\"\">Following the end of the Peloponnesian War, Sparta emerged as the dominant military power in ancient Greece. Seemingly, no one could stop them. But someone did. The rising power of Thebes would challenge Sparta as no one had done before. Thebes’ main heroes, Pelopidas and Epaminondas, radically changed military tactics, and risked it all in the name of freedom from Spartan imperialism. Their secret weapon against Sparta was The Sacred Band, an elite group of 300 soldiers destined to become the most feared infantry unit in the entire Greek world. Something peculiar characterized this legendary unit. The Sacred Band was made up of 150 homosexual couples. And it was these 150 couples who broke the myth of Spartan military invincibility. </p><p class=\"\">In this episode, we follow the rise of Thebes from the ashes of the end of the Peloponnesian War in 401 BCE, through the Theban revolution of 379—when Pelopidas led 11 men to reclaim their city, to the Battle of Leuctra in 371 BCE, when the Sacred Band had its chance to demonstrate its valor against the Spartans. And in the course of narrating all this, we will grapple with one central question: what force can allow people to defeat their natural fears and fight like heroes?</p>",
  "media:content": {
    "media:title": "EPISODE 81: The Other 300 (Part 1)"
  }
}