{
  "title": "Grandparents Reunited | RGSO Classic",
  "link": "https://audioboom.com/posts/8159032",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1975,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Its comforting to believe that a deceased grandparent is being reunited with their spouse in death. Then what does it mean when one of them shows up from beyond the grave in your bedroom?<br>\n<br>\nHere is a preview of the story.<br>\n“When I was 18, two months after my grandmother died, I reunited with my father, her son, in another country. We had been separated for two years prior to this due to geography and financial circumstances, and he was not able to attend the funeral. One afternoon, I was in my father's upstairs bedroom (which he let me sleep in during my visit) and heard clear as day my deceased grandmother's voice say my name. There was not anything spooky about it at the moment. Just as real as you would hear anybody talk. And as quickly as it came, it went - too quick for me to even register that my grandmother was dead until the incident passed.”<br>\n<br>\nTo hear more real ghost stories, become a supporter of our show and get every episode, including our weekly bonus episodes at <a href=\"http://www.ghostpodcast.com\">http://www.ghostpodcast.com</a> or <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\nWatch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\nIf you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n",
  "pubDate": "Sun, 18 Sep 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-09-16:/posts/8159032",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}