{
  "title": "US Democrat senator slams Biden",
  "link": "https://www.rt.com/news/566019-democrat-senator-slams-biden/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/566019-democrat-senator-slams-biden/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6366c51c2030271e32228d78.jpg\" /> US Senator Joe Manchin has blasted President Joe Biden for vowing to shut down America’s coal-fueled power plants <br/><a href=\"https://www.rt.com/news/566019-democrat-senator-slams-biden/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>West Virginia’s Joe Manchin has called out the US president for pledging to shut down America’s coal-fueled power plants</strong></p>\n            \n                        \n            <p>US Senator Joe Manchin, one of the most powerful lawmakers in Joe Biden&rsquo;s own Democrat party, has blasted the president for vowing to shut down America&rsquo;s coal-fueled power plants, unleashing an unusually candid rebuke of the leader just three days before the congressional midterm elections.</p>\n<p><em>&ldquo;President Biden&rsquo;s comments are not only outrageous and divorced from reality,&rdquo;</em>&nbsp;<a href=\"https://www.manchin.senate.gov/newsroom/press-releases/manchin-reacts-to-bidens-outrageous-coal-comments\" target=\"_blank\" rel=\"noopener noreferrer\">Manchin said</a> on Saturday in a statement,&nbsp;<em>&ldquo;they ignore the severe economic pain the American people are feeling because of rising energy costs. Comments like these are the reason the American people are losing trust in President Biden.&rdquo;</em></p>\n<p>Manchin, a Democrat from West Virginia, was reacting to a speech that Biden gave on Saturday in California, where the president said of the nation&rsquo;s coal-fueled power stations, <em>&ldquo;We&rsquo;re going to be shutting these plants down all across America and having wind and solar.&rdquo;</em> The senator said Biden had never made such a comment to him.</p>\n\n            \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/news/565917-poll-us-voters-expect-biden-impeachment/\">\n            <span>READ MORE: </span>Voters expect Republicans to impeach Biden – poll\n        </a>\n    </p>\n\n    \n\n<p><em>&ldquo;Being cavalier about the loss of coal jobs for men and women in West Virginia and across the country who literally put their lives on the line to help build and power this country is offensive and disgusting,&rdquo;</em> Manchin said. <em>&ldquo;The president owes these incredible workers an immediate and public apology, and it is time he learn a lesson that his words matter and have consequences.&rdquo;</em></p>\n<blockquote>\n<p><strong><em>It seems his positions change daily depending on the audience and politics of the day.</em></strong></p>\n</blockquote>\n<p>White House press secretary <a href=\"https://www.whitehouse.gov/briefing-room/speeches-remarks/2022/11/05/statement-by-press-secretary-karine-jean-pierre-2/\" target=\"_blank\" rel=\"noopener noreferrer\">Karine Jean-Pierre</a> said Biden&rsquo;s speech was <em>&ldquo;twisted to suggest a meaning that was not intended.&rdquo;</em> She added, <em>&ldquo;The president was commenting on a fact of economics and technology: As it has been from its earliest days as an energy superpower, America is once again in the midst of an energy transition.&rdquo;</em></p>\n<p>West Virginia is the second-largest coal-producing state, ranking behind only Wyoming, and it relies on the fuel for 89% of its power generation. Nationwide, coal fueled almost 22% of electricity production in 2021, nearly double the combined output of wind and solar, according to <a href=\"https://www.eia.gov/tools/faqs/faq.php?id=427&t=3\" target=\"_blank\" rel=\"noopener noreferrer\">US Energy Department data</a>. Only natural gas ranked higher as a fuel source, at 38%.</p>\n<p></p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63657ad92030271d4f6e00fd.jpg\" alt=\"President Joe Biden speaks at a campaign event in California, November 3, 2022.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565975-biden-democrats-coal-power/\">Biden promises to shut US coal power plants</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Parts of the US have faced power shortages. For instance, the grid operator in New England has warned that the region may suffer <a href=\"https://www.wsj.com/articles/new-england-risks-winter-blackouts-as-gas-supplies-tighten-11665999002\" target=\"_blank\" rel=\"noopener noreferrer\">blackouts</a> this winter. Some states have struggled with the transition to renewable energy sources, given the intermittency of output from wind and solar farms. California has been forced to impose <a href=\"https://www.rt.com/usa/498478-california-brown-blackout-renewables/\">rolling blackouts</a> from time to time during periods of surging power demand.</p>\n<p>As the most conservative Democrat in the Senate, Manchin wields outsized power because he&rsquo;s often the biggest impediment to pushing through partisan legislation that needs unanimous support from the party. Colleagues have called him <em><a href=\"https://thehill.com/homenews/senate/3561908-five-times-joe-manchin-has-bucked-the-democrats/\" target=\"_blank\" rel=\"noopener noreferrer\">&ldquo;infuriating&rdquo;</a></em>&nbsp;for forcing compromises on Biden&rsquo;s agenda.</p>\n<p>The senator&rsquo;s sharp criticism of the party&rsquo;s leader comes as Democrats try to rally support amid expectations that they will lose control of Congress in Tuesday&rsquo;s midterms. Manchin won&rsquo;t be up for re-election until 2024.</p>\n<p></p>",
  "enclosure": "",
  "pubDate": "Sat, 05 Nov 2022 20:27:53 +0000",
  "dc:creator": "RT"
}