{
  "title": "DonorSee and the Future of Charitable Giving with Gret Glyer",
  "pubDate": "Sun, 29 Jan 2017 18:49:59 +0000",
  "guid": "2b02744638c4b1daf8215e77b9d3bc7b",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP43Glyer_EDR.mp3",
  "itunes:image": "",
  "description": "<p>What follows is an edited transcript of the first part of my conversation with Gret Glyer, creator of <a href= \"https://donorsee.com/\" target=\"_blank\">DonorSee</a>. For the full conversation, listen to the episode.</p> <hr /> <p><strong>Petersen: </strong>My guest today is Gret Glyer, he is the creator of a new app called <a href=\"https://donorsee.com/\" target=\"_blank\">DonorSee</a>. Gret, welcome to Economics Detective Radio.</p> <p><strong>Glyer:</strong> Thank you for having me, Garrett. How are you?</p> <p><strong>Petersen:</strong> I am great! So, DonorSee is a charitable giving app with a very interesting twist which---we'll get to the app itself in a little bit---but first let's start with some background. Tell us a little bit about yourself and how you got involved with the nonprofit sector.</p> <p><strong>Glyer:</strong> Sure. So, I graduated from college in 2012 and immediately started working at a rental car company and did that for about a year and did really well. And I was promoted very quickly and I was told by upper management I was going to skyrocket through the ranks and that whole idea of being very successful having six or seven figure income, getting a company car, that kind of stuff, was just a depressing thought to me because I didn't want to wake up in twenty years and be really good at renting cars to people.</p> <p>So I started looking at a bunch of different ways to find something more fulfilling, more around doing work that I cared about and I decided to go overseas for a year and I found an opportunity to go to Malawi, Africa. So I went over there, I spent a year as a math teacher and I really loved being over there. Teaching math wasn't exactly my vocation in life but being in a very impoverished area and being a part of helping those people, that was something that I found a lot of fulfillment and gratification in. So I spent another two years out there and then I came and I was out there, I did a whole bunch of different crowdfunding stuff and I got involved.</p> <p>I started a charity and a few other things and then when I came back---about six months ago---that's when I started this new company DonorSee. It's kind of in the nonprofit sector, but I've also been telling people it's kind of like the anti-charity. There are so many negative connotations associated with what charity is, and how people understand it, and how effective it is, and how much they waste money that I almost don't want to be associated with non-profits or with charities, I'd almost rather be considered like the opposite end of the spectrum. So, in some ways it is in the nonprofit sector in some ways it's the farthest thing from it.</p> <p><strong>Petersen:</strong> Yeah, well I'm hesitant to describe it as the Tinder of charity but it's almost like that. So, you're not a tech person, you're not a computer programmer but you come from, well not charity, but from the helping others in poor countries angle. How did you get to this point where you can start a tech startup?</p> <p><strong>Glyer:</strong> Yes. So, basically, you can do anything you want as long as you have the resources to hire people who do the stuff that you can't do.</p> <p>So, I came up with the idea back a year ago, actually in January, and I spent the next two months developing it and writing out a business plan for it and getting screens made to see how it would look, and what the flow would be like, and how people might use it. And then I paid a guy online who lives somewhere in Eastern Europe and he---I think it was Ukraine---and for a relatively small amount of money he made a basic very buggy first draft, like a prototype, and I used that.</p> <p>And I took it to investors to show them what the app was like. And they believed in the idea, they believed in my vision for what the app could be and how it could disrupt the charity sector and so forth. And so they saw that and they decided to provide me with investment money and I was able to use that money to hire the tech people and hire a marketing team and all that kind of stuff. So, that was how I got from having no technical background to running a tech company myself.</p> <p><strong>Petersen:</strong> Yeah that's great! So many idea people are also sort of averse to hiring others. You know a lot of people have great ideas and flounder because they try to do everything themselves. I do something similar on a smaller scale, but I outsourced a lot of the things for the podcast so I can focus on the parts of it I like, the interviews, the sort of high-level thinking side and also so I can finish my Ph.D. which I promise I will eventually. And you know it's just good to hear you taking this smart approach.</p> <p>Let's get into the app itself. I actually did, I went to your website and I installed the app. So if someone listening were to install the app and booted it up, what would they see?</p> <p><strong>Glyer:</strong> The app it looks most similar to---when someone opens it, it reminds most of them of Instagram when they open it up. So they open it up and then you see you can scroll through this list of pictures and descriptions underneath. I think the one thing that might look different is that each picture has a little circle at the bottom that shows the progress of how much money has been donated.</p> <p>So, each picture is actually a project and that project could be providing a wheelchair for a kid in Malawi or providing hearing aids for a little girl in India or education or any number of things. And you see the picture, you see the description underneath and then you have the opportunity to donate to any of those things and the progress bar tells you how much has been donated. So, if there's 25$ left you can be the person to donate that final 25$ and get it out to that person who is usually in a very urgent or desperate situation.</p> <p>They open it up, they see this list of projects and then they can pick where in the world they want to give to, what kind of project they want to give to, in what way they want to be involved and we have all sorts of different stuff from over 30 different countries. And when people give, the thing that is very---so far there's nothing special about it, this is pretty much like every other thing that you've ever heard of except for maybe it being on an app---the thing that makes us special is that when you give to one of our projects you will get relatively quickly a visual update at some point of how your money was being spent.</p> <p>So, let's say you gave to that kid who needed the wheelchair. You actually get to see a picture of that boy being fitted for the wheelchair and getting his wheelchair and going out, how his life is improved because of that. Or the girl who needed hearing aids; you'll get a video of that girl hearing for the very first time. So, we provide very strong connective visual feedback on every single donation. That's what makes this different than anyone else that's out there.</p> <p><strong>Petersen:</strong> Right, and the great thing about doing it through an app is that you can get that warm fuzzy feeling in the feedback in the knowledge that you've had an impact, which is not always clear. With a lot of charities, you give them some money and it goes into their general revenue, you don't know if you actually gave that goat to that far-off person or if it went into marketing to get more money to---I mean hopefully---to buy more goats but maybe just to market some more.</p> <p>And if we want to look at the distant end of the spectrum in terms of warm fuzzy feelings per dollar actually spent helping a poor person, we might look at something like Habitat for Humanity where they fly people with no building experience from the West at great expense to a poor country to build buildings that nobody wants that have to be torn down because they're so poorly built, just in order to get---I guess they pay some kind of fee---and eventually a little bit of money goes to the people in the country.</p> <p>But there's just a lot more effort put into that warm fuzzy feeling. I think we as humans are a little flawed in needing it. We need that feeling in order to do good in the world. It's not enough to just abstractly know. Could you compare your charity to some of the others?</p> <p><strong>Glyer:</strong> Yes. So, I lived in Malawi for three years. So, most people have seen what charity is kind of like from the American side of things. They give five bucks to a charity and then that charity bugs them every week for the next year, asking them for more money and they never show where their money goes. And they promise they're constantly saying \"Hey, we're doing all these amazing things, we're helping 10,000 kids here and 5,000 kids here,\" and they throw all these confusing numbers at you but they never show you anything. And they're responsible to no one.</p> <p>And you can go to <a href=\"https://www.charitynavigator.org/\" target=\"_blank\">Charity Navigator</a> and you can kind of see all of these percentages going here. But ultimately, you can make up all of those numbers, numerical transparency is a complete farce. So if you've ever given money to a really big charity, I'm sorry, but there's a good chance that it's been blown. There are a few charities I would highly recommend and they are doing really good work and in general that's like one in 50.</p> <p>The vast majority of charities are blowing your money. I say that as someone who lived in a third world country for three years and was on the other side of the world when that money was supposedly being spent. So, I was there when the executives of these big charities were coming and staying in nice hotels, eating really nice meals. And I was there when I saw tons of shoes---I've seen in Malawi a warehouse full of shoes in boxes that were never distributed but they were reported as distributed. There's no accountability whatsoever, there's no transparency and anyone who tells you \"oh, we have unprecedented transparency.\" Well, prove it, show us. In general, no one's doing that.</p> <p>So, I think what we do differently is we really do show you visually. If you gave money to a lady who needs a sewing machine. You will get to see her using that sewing machine and there's a good chance you'll get updates months or even years down the road of how that sewing-machine has improved her life after that one-time donation because our model is just a superior model to what most charities are using.</p> <hr /> <p>Listen to the episode for the full conversation!</p>",
  "content:encoded": "<p>What follows is an edited transcript of the first part of my conversation with Gret Glyer, creator of <a href= \"https://donorsee.com/\" target=\"_blank\">DonorSee</a>. For the full conversation, listen to the episode.</p>  <p>Petersen: My guest today is Gret Glyer, he is the creator of a new app called <a href=\"https://donorsee.com/\" target=\"_blank\">DonorSee</a>. Gret, welcome to Economics Detective Radio.</p> <p>Glyer: Thank you for having me, Garrett. How are you?</p> <p>Petersen: I am great! So, DonorSee is a charitable giving app with a very interesting twist which---we'll get to the app itself in a little bit---but first let's start with some background. Tell us a little bit about yourself and how you got involved with the nonprofit sector.</p> <p>Glyer: Sure. So, I graduated from college in 2012 and immediately started working at a rental car company and did that for about a year and did really well. And I was promoted very quickly and I was told by upper management I was going to skyrocket through the ranks and that whole idea of being very successful having six or seven figure income, getting a company car, that kind of stuff, was just a depressing thought to me because I didn't want to wake up in twenty years and be really good at renting cars to people.</p> <p>So I started looking at a bunch of different ways to find something more fulfilling, more around doing work that I cared about and I decided to go overseas for a year and I found an opportunity to go to Malawi, Africa. So I went over there, I spent a year as a math teacher and I really loved being over there. Teaching math wasn't exactly my vocation in life but being in a very impoverished area and being a part of helping those people, that was something that I found a lot of fulfillment and gratification in. So I spent another two years out there and then I came and I was out there, I did a whole bunch of different crowdfunding stuff and I got involved.</p> <p>I started a charity and a few other things and then when I came back---about six months ago---that's when I started this new company DonorSee. It's kind of in the nonprofit sector, but I've also been telling people it's kind of like the anti-charity. There are so many negative connotations associated with what charity is, and how people understand it, and how effective it is, and how much they waste money that I almost don't want to be associated with non-profits or with charities, I'd almost rather be considered like the opposite end of the spectrum. So, in some ways it is in the nonprofit sector in some ways it's the farthest thing from it.</p> <p>Petersen: Yeah, well I'm hesitant to describe it as the Tinder of charity but it's almost like that. So, you're not a tech person, you're not a computer programmer but you come from, well not charity, but from the helping others in poor countries angle. How did you get to this point where you can start a tech startup?</p> <p>Glyer: Yes. So, basically, you can do anything you want as long as you have the resources to hire people who do the stuff that you can't do.</p> <p>So, I came up with the idea back a year ago, actually in January, and I spent the next two months developing it and writing out a business plan for it and getting screens made to see how it would look, and what the flow would be like, and how people might use it. And then I paid a guy online who lives somewhere in Eastern Europe and he---I think it was Ukraine---and for a relatively small amount of money he made a basic very buggy first draft, like a prototype, and I used that.</p> <p>And I took it to investors to show them what the app was like. And they believed in the idea, they believed in my vision for what the app could be and how it could disrupt the charity sector and so forth. And so they saw that and they decided to provide me with investment money and I was able to use that money to hire the tech people and hire a marketing team and all that kind of stuff. So, that was how I got from having no technical background to running a tech company myself.</p> <p>Petersen: Yeah that's great! So many idea people are also sort of averse to hiring others. You know a lot of people have great ideas and flounder because they try to do everything themselves. I do something similar on a smaller scale, but I outsourced a lot of the things for the podcast so I can focus on the parts of it I like, the interviews, the sort of high-level thinking side and also so I can finish my Ph.D. which I promise I will eventually. And you know it's just good to hear you taking this smart approach.</p> <p>Let's get into the app itself. I actually did, I went to your website and I installed the app. So if someone listening were to install the app and booted it up, what would they see?</p> <p>Glyer: The app it looks most similar to---when someone opens it, it reminds most of them of Instagram when they open it up. So they open it up and then you see you can scroll through this list of pictures and descriptions underneath. I think the one thing that might look different is that each picture has a little circle at the bottom that shows the progress of how much money has been donated.</p> <p>So, each picture is actually a project and that project could be providing a wheelchair for a kid in Malawi or providing hearing aids for a little girl in India or education or any number of things. And you see the picture, you see the description underneath and then you have the opportunity to donate to any of those things and the progress bar tells you how much has been donated. So, if there's 25$ left you can be the person to donate that final 25$ and get it out to that person who is usually in a very urgent or desperate situation.</p> <p>They open it up, they see this list of projects and then they can pick where in the world they want to give to, what kind of project they want to give to, in what way they want to be involved and we have all sorts of different stuff from over 30 different countries. And when people give, the thing that is very---so far there's nothing special about it, this is pretty much like every other thing that you've ever heard of except for maybe it being on an app---the thing that makes us special is that when you give to one of our projects you will get relatively quickly a visual update at some point of how your money was being spent.</p> <p>So, let's say you gave to that kid who needed the wheelchair. You actually get to see a picture of that boy being fitted for the wheelchair and getting his wheelchair and going out, how his life is improved because of that. Or the girl who needed hearing aids; you'll get a video of that girl hearing for the very first time. So, we provide very strong connective visual feedback on every single donation. That's what makes this different than anyone else that's out there.</p> <p>Petersen: Right, and the great thing about doing it through an app is that you can get that warm fuzzy feeling in the feedback in the knowledge that you've had an impact, which is not always clear. With a lot of charities, you give them some money and it goes into their general revenue, you don't know if you actually gave that goat to that far-off person or if it went into marketing to get more money to---I mean hopefully---to buy more goats but maybe just to market some more.</p> <p>And if we want to look at the distant end of the spectrum in terms of warm fuzzy feelings per dollar actually spent helping a poor person, we might look at something like Habitat for Humanity where they fly people with no building experience from the West at great expense to a poor country to build buildings that nobody wants that have to be torn down because they're so poorly built, just in order to get---I guess they pay some kind of fee---and eventually a little bit of money goes to the people in the country.</p> <p>But there's just a lot more effort put into that warm fuzzy feeling. I think we as humans are a little flawed in needing it. We need that feeling in order to do good in the world. It's not enough to just abstractly know. Could you compare your charity to some of the others?</p> <p>Glyer: Yes. So, I lived in Malawi for three years. So, most people have seen what charity is kind of like from the American side of things. They give five bucks to a charity and then that charity bugs them every week for the next year, asking them for more money and they never show where their money goes. And they promise they're constantly saying \"Hey, we're doing all these amazing things, we're helping 10,000 kids here and 5,000 kids here,\" and they throw all these confusing numbers at you but they never show you anything. And they're responsible to no one.</p> <p>And you can go to <a href=\"https://www.charitynavigator.org/\" target=\"_blank\">Charity Navigator</a> and you can kind of see all of these percentages going here. But ultimately, you can make up all of those numbers, numerical transparency is a complete farce. So if you've ever given money to a really big charity, I'm sorry, but there's a good chance that it's been blown. There are a few charities I would highly recommend and they are doing really good work and in general that's like one in 50.</p> <p>The vast majority of charities are blowing your money. I say that as someone who lived in a third world country for three years and was on the other side of the world when that money was supposedly being spent. So, I was there when the executives of these big charities were coming and staying in nice hotels, eating really nice meals. And I was there when I saw tons of shoes---I've seen in Malawi a warehouse full of shoes in boxes that were never distributed but they were reported as distributed. There's no accountability whatsoever, there's no transparency and anyone who tells you \"oh, we have unprecedented transparency.\" Well, prove it, show us. In general, no one's doing that.</p> <p>So, I think what we do differently is we really do show you visually. If you gave money to a lady who needs a sewing machine. You will get to see her using that sewing machine and there's a good chance you'll get updates months or even years down the road of how that sewing-machine has improved her life after that one-time donation because our model is just a superior model to what most charities are using.</p>  <p>Listen to the episode for the full conversation!</p>",
  "enclosure": "",
  "itunes:duration": "38:38",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "What follows is an edited transcript of the first part of my conversation with Gret Glyer, creator of . For the full conversation, listen to the episode.  Petersen: My guest today is Gret Glyer, he is the creator of a new app called . Gret,..."
}