{
  "guid": "tag:blogger.com,1999:blog-2761684730989137546.post-712056944397409705",
  "pubDate": "Thu, 03 Nov 2022 01:46:00 +0000",
  "atom:updated": "2022-11-02T21:46:40.870-04:00",
  "title": "Bill Mitchell –  Degrowth, deep adaptation, and skills shortages–Part 5",
  "description": "<i><blockquote>This is Part 5 of an on-going series I am writing about the issues facing societies dealing with climate change and other elements which come together as a poly crisis. The series will unfold as I research and think about the topic more through my Modern Monetary Theory (MMT) lens. Today, I am concluding the analysis of the questions relating to the ageing society and the resulting skill shortages, that the mainstream narrative identifies as key ‘problems’ facing governments across the Western world. Like any issue, the way the ‘problem’ is constructed or framed influences the conclusions we come up with. Further, the tools use to operationalise that construction also influence the scope and quality of the analysis and the resulting conclusions. As I explained in Monday’s blog post – Degrowth, deep adaptation, and skills shortages – Part 4 (October 31, 2022) – the use of mainstream macroeconomics fails to deliver appropriate policy advice on these questions. But further, when we introduce multi-dimensional complexity – such as degrowth to the ageing society issue – the mainstream approach becomes catastrophic. MMT is a much better analytical framework for drilling down to see what the essential problem is and what are non-problems and thus creating the questions and answers that lead to sound policy. Today, I show why the existence of skills shortages really provides us with the space to pursue a degrowth strategy while not causing material standards of living to collapse. They are better seen as indicator of what is possible rather than a macro problem....</blockquote></i>Bill Mitchell – billy blog<br /><a href=\"http://bilbo.economicoutlook.net/blog/?p=50743\">Degrowth, deep adaptation, and skills shortages – Part 5</a><br />Bill Mitchell | Professor in Economics and Director of the Centre of Full Employment and Equity (CofFEE), at University of Newcastle, NSW, Australia",
  "link": "http://mikenormaneconomics.blogspot.com/2022/11/bill-mitchell-degrowth-deep-adaptation.html",
  "thr:total": 1,
  "author": "contrarianmedia@hotmail.com (Mike Norman)"
}