{
  "title": "Database Management to Data Science: Career Switch",
  "link": "https://dimensionless.in/career-switch-data-science-database-management/",
  "comments": "https://dimensionless.in/career-switch-data-science-database-management/#respond",
  "dc:creator": "Pooja Sahatiya",
  "pubDate": "Tue, 22 Oct 2019 05:08:15 +0000",
  "category": [
    "Career Transitions",
    "Data Science",
    "Career Switch Data Science",
    "Career Transition",
    "data science careers",
    "data science job",
    "data science professional",
    "data science skillset",
    "Data Science Success Story",
    "future ready careers",
    "Hardware Engineer",
    "Learn Data Science and Business Analytics",
    "Machine Learning",
    "Network Engineer",
    "Research Associate"
  ],
  "guid": "https://dimensionless.in/?p=216495",
  "description": "Dimensionless gave me the confidence to move to Data Science even after 8 years in Database Management. My career transition to Data Science went smoothly.",
  "content:encoded": "\n<h2>Career Transition from Team Lead, Database Management to Data Scientist</h2>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>I believe it’s never too late to learn and move to a better technology. </p>\n<cite><a href=\"https://www.linkedin.com/in/ruchi-saboo-5126287a/\">&#8211; </a><a href=\"https://www.linkedin.com/in/vikash-kumar-prakash-03850179/\">Vikash Kumar Prakash</a></cite></blockquote>\n\n\n\n<h3>Background</h3>\n\n\n\n<p><strong>Education:</strong> B. Tech in Computer Science</p>\n\n\n\n<table class=\"wp-block-table is-style-stripes\">\n<tbody>\n<tr>\n<td><strong>Previous Profile  >>></strong></td>\n<td><strong>Current Profile</strong></td>\n</tr>\n<tr>\n<td>Company: BNY Melon<br />Profile: <strong>Oracle, PL/SQL Developer</strong><br />Designation: Team Lead, Database Management<br />Domain: Finance<br />Experience: 8 years</td>\n<td>Company: Barclays<br />Profile: <strong>Data Analyst</strong><br />Designation: Team Lead<br />Domain: Finance</td>\n</tr>\n</tbody>\n</table>\n\n\n\n<div class=\"wp-block-spacer\" style=\"height: 32px\" aria-hidden=\"true\"> </div>\n\n\n\n<h3>My journey into Data Science<br /><br /></h3>\n\n\n\n<h4>Why Data Science?</h4>\n\n\n\n<p>There wasn’t much growth in PL/SQL and Database Management after a certain level. After reaching that level and giving about 8 years to one technology, and it was scary to move to newer technology. So I started looking at how I could build on stuff I already knew. I knew how to use and store the data. Now, I was more interested in the business side of it. I was interested in predictive analytics to help businesses apply this data and get insights from it. Data Science would help me do that. Because of this interest, Machine Learning and Data Science was an obvious choice.</p>\n\n\n\n<h4>Why Dimensionless?</h4>\n\n\n\n<p>One of my trusted friends did his course from Dimensionless and recommended it to me. He too was able to transition from Database Management to Data Science.</p>\n\n\n\n<p>After checking out the course myself, I found it to be good in every aspect. My main issue was timings, but they provided the flexibility of attending classes in the morning or evening. Plus, there were weekend classes which covered the most syllabus. The faculty looked promising since they were all from Machine Learning background, they had worked in this technology. After the Demo, I was convinced completely.</p>\n\n\n\n<h4>Experience with Dimensionless?</h4>\n\n\n\n<p>I had a very good experience with Dimensionless. One thing I really liked was that the faculty gave equal attention to all the students. Even the doubts were resolved quickly by the teachers. Any issues we had were discussed either in the lecture itself or personally too.<br />We got assignments and case studies that helped us get hands-on experience in the applications of Data Science, which was the most interesting part for me.</p>\n\n\n\n<h3>Career Transition to Data Science</h3>\n\n\n\n<p>After the course was done, I started giving interviews. The Placement Assistance really helped me here. Right from resume preparation to mock interviews, Dimensionless prepared us for everything. We were given a set of questions to prepare from and then mock interview would be held. I think these activities boosted my confidence more than anything else.</p>\n\n\n\n<p>Within 2 months after the course, I got placed in Barclays as a Data Analyst with R and Python.</p>\n\n\n\n<figure class=\"wp-block-pullquote\">\n<blockquote>\n<p>Dedicating time to learning new tech is the best way out of an outdated job, no matter how much experience you have. In Data Science, as well as every other advanced technology, the main thing that matters is practical knowledge.</p>\n</blockquote>\n</figure>\n\n\n\n<p>Do you also want career transition like <a href=\"https://www.linkedin.com/in/vikash-kumar-prakash-03850179/\"><strong>Vikash</strong></a>? <br /><strong>Follow this </strong><a href=\"http://dimensionless.in/\"><strong>link</strong></a>, and make it possible with Dimensionless Techademy!</p>\n\n\n\n<p>Furthermore, if you want to read more about data science, you can <strong>read our blogs </strong><a href=\"http://dimensionless.in/blog\"><strong>here</strong></a><strong>.</strong></p>\n\n\n\n<p>&nbsp;</p>\n",
  "wfw:commentRss": "https://dimensionless.in/career-switch-data-science-database-management/feed/",
  "slash:comments": 0
}