{
  "title": "The Economist gets in on the AI Fluff",
  "link": "https://datamining.typepad.com/data_mining/2015/05/the-economist-gets-in-on-the-ai-fluff.html",
  "description": "The Economist leads with an editorial and an article on The Dawn of Artificial Intelligence. The editorial starts of with: “THE development of full artificial intelligence could spell the end of the human race,” Stephen Hawking warns. Elon Musk fears...",
  "content:encoded": "<p>The Economist leads with an editorial and an article on <a href=\"http://www.economist.com/news/leaders/21650543-powerful-computers-will-reshape-humanitys-future-how-ensure-promise-outweighs\" target=\"_self\">The Dawn of Artificial Intelligence</a>.</p>\n<p>The editorial starts of with:</p>\n<blockquote>\n<p>“THE development of full artificial intelligence could spell the end of the human race,” Stephen Hawking warns. Elon Musk fears that the development of artificial intelligence, or AI, may be the biggest existential threat humanity faces. Bill Gates urges people to beware of it.</p>\n<p>Dread that the abominations people create will become their masters, or their executioners, is hardly new. But voiced by a renowned cosmologist, a Silicon Valley entrepreneur and the founder of Microsoft—hardly Luddites—and set against the vast investment in AI by big firms like Google and Microsoft, such fears have taken on new weight. With supercomputers in every pocket and robots looking down on every battlefield, just dismissing them as science fiction seems like self-deception. The question is how to worry wisely.</p>\n</blockquote>\n<p>To my knowledge, while the three titans mentioned here of undeniable intellect, it is not clear why two of them are relevant at all. I consider myself reasonably smart, but should I be quoted on my opinion of current treatments of toxoplasmosis? The argument &quot;a smart person says X, therefore we should attend&quot; is known as <a href=\"http://www.don-lindsay-archive.org/skeptic/arguments.html#falseauth\" target=\"_self\">the appeal to false authority</a> (i.e. a fallacious argument). Such arguments introduce another argumentative crime: the exclusion of actual authority. <a href=\"http://www.theguardian.com/technology/2015/jan/28/artificial-intelligence-will-not-end-human-race\" target=\"_self\">Eric Horvitz comes to mind</a>:</p>\n<blockquote>\n<p>The head of Microsoft’s main research lab has dismissed fears that artificial intelligence could pose a threat to the survival of the human race.</p>\n<p>Eric Horvitz believed that humans would not “lose control of certain kinds of intelligences”, adding: “In the end we’ll be able to get incredible benefits from machine intelligence in all realms of life, from science to education to economics to daily life.”</p>\n</blockquote>\n<p>The article then stumbles along confusing advances in machine perception and machine learning with intelligence. Predictably, the Kasparov vs Deep Blue achievement is trundled out:</p>\n<blockquote>\n<p>Yet AI is already powerful enough to make a dramatic difference to human life. It can already enhance human endeavour by complementing what people can do. Think of chess, which computers now play better than any person.</p>\n</blockquote>\n<p>Suggesting that any computer can now beat all humans. Deep Blue was a singular machine which was <a href=\"http://en.wikipedia.org/wiki/Deep_Blue_(chess_computer)\" target=\"_self\">dismantled after the match</a>. And how does chess playing make a dramatic difference to human life?</p>\n<p>A well informed article - and one that is actually interesting to read - should lead with a concrete set of definitions regarding the components of artificial intelligence (perception, reasoning, etc.) and discuss the discrete advances in those areas. Such an article should discuss the challenges of bringing those things together in anything other than the most rudimentary ways they are combined currently. An interesting article on AI would discuss the economics that drive investments and how they dictate what areas are worked on and which aren&#39;t.</p>\n<p>In all these articles, there is a vague notion of inevitability, as if the machines themselves were selectively investing in research areas, or as if we could stand back and do nothing and this scary version of AI would emerge. It&#39;s as if the article were suggesting that landing on the moon was inevitable. The fact that humans did this and then never returned indicates that it was an incredibly intentional endeavor.</p>\n<p>&#0160;</p>",
  "dc:subject": "AI",
  "dc:creator": "Matthew Hurst",
  "dc:date": "2015-05-10T22:54:24-04:00"
}