{
  "title": "How 5G’s Rollout Rattled Hundreds of Pilots",
  "link": "https://spectrum.ieee.org/faa-5g",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/an-airplane-just-before-landing-in-the-early-morning-runway-lights-can-be-seen-in-the-foreground.jpg?id=31913203&width=2000&height=1500&coordinates=200%2C0%2C200%2C0\"/><br/><br/><p>In January this year, at least three flights above Tennessee simultaneously experienced altimeter errors that made it “impossible to maintain assigned altitude,” according to one of the pilots. One jet lost its autopilot completely, and reportedly had fire trucks waiting for it on landing.</p><p>In February, a passenger plane on approach to the Louis Armstrong International Airport in New Orleans experienced erratic low-altitude warnings as it flew below 1,000 feet. “This sort of erroneous warning indications would be extremely distracting in a more challenging environment such as low visibility, icing conditions, etc,” the pilot wrote later.</p><p>In March, a commercial jet landing on autopilot at Los Angeles International Airport suddenly went into an aggressive descent just 100 feet above the ground. “I took control of the aircraft and raised the nose and landed,” its pilot reported. “It was a very alarming pushover by the autopilot. In [other] conditions, it could have caused a crash.”</p><hr/><p>All three incidents—and many more this year—were linked by pilots to problems with the aircrafts’ radio (radar) altimeters, which pilots rely on during takeoff and landing, and to help avoid crashing into mountains. These altimeters also feed into critical autopilot, auto-throttle, and instrument landing systems. According to an <em>IEEE Spectrum</em> analysis of reports made to NASA’s <a href=\"https://asrs.arc.nasa.gov/\" rel=\"noopener noreferrer\" target=\"_blank\">Aviation Safety Reporting System</a> (ASRS), complaints of malfunctioning and failing altimeters soared after the rollout earlier this year of <a href=\"https://spectrum.ieee.org/5g-faa\" target=\"_self\">high-speed 5G wireless networks</a>, which use similar frequencies.</p><p>ASRS is a public database maintained by NASA to encourage U.S.-based air and ground crew, and air traffic controllers, to anonymously share safety incidents and concerns. Between January and May, there were 93 reports of faulty or failing radar altimeters, where a normal year might see only a handful. January alone saw almost twice as many complaints of malfunctioning altimeters as the previous five years combined. In most, including the Tennessee and Los Angeles incidents above, the reporter referred to 5G interference.</p><p>The <a href=\"https://www.fcc.gov/\" target=\"_blank\">U.S. Federal Communications Commission</a> initially played down concerns that the new cell towers and devices might interfere with commercial jet radar altimeters, which operate a few hundred megahertz higher in the radio spectrum. In early 2020, <a href=\"https://docs.fcc.gov/public/attachments/DOC-362358A1.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">the agency wrote</a>: “The technical rules on power and emission limits we set for the 3.7 [gigahertz] service and the spectral separation of 220 megahertz offers significant protection of services in the 4.2–4.4 GHz band.”</p><p>The <a href=\"https://www.faa.gov/\" target=\"_blank\">U.S. Federal Aviation Administration</a> was not so certain. It commissioned an empirical study by <a href=\"https://www.rtca.org/\" target=\"_blank\">RTCA</a>, a nonprofit that studies aviation electronics, to assess the operational risks of 5G interference. <a href=\"https://www.rtca.org/wp-content/uploads/2020/10/SC-239-5G-Interference-Assessment-Report_274-20-PMC-2073_accepted_changes.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">That report concluded</a> that C-band 5G systems would cause harmful interference to radar altimeters on all types of civil aircraft, and that “this risk is widespread and has the potential for broad impacts to aviation operations in the United States, including the possibility of catastrophic failures leading to multiple fatalities.”</p><p>It found the risk would originate from intentional and spurious signals from terrestrial cell towers, as well as 5G cellphones inadvertently operated onboard aircraft, exacerbated by altimeter receivers with poor spectral selectivity. In what now seems a prescient observation, the RTCA report said: “[The] possibility of harmful interference…is particularly dangerous given that up to the present time, radar altimeter failures…have been extremely uncommon.”</p><p>Nevertheless, the spectrum auction went ahead, with wireless providers led by <a href=\"https://www.verizon.com/\" target=\"_blank\">Verizon</a> and <a href=\"https://www.att.com/\" target=\"_blank\">AT&T</a> paying over US $80 billion for the frequencies. 5G services were due to go live in 46 markets around the United States on 5 January this year. But as the deployment neared, the FAA issued an airworthiness directive that would have vastly restricted air travel into those areas. </p><p>Ultimately, wireless carriers agreed to delay the 5G rollout for two weeks, and the FAA banned certain aircraft—those with susceptible or untested altimeters—from low-visibility landings at airports with 5G wireless networks. The networks also agreed to set up “<a href=\"https://www.faa.gov/sites/faa.gov/files/2022-01/50%20Airports%20with%205G%20Buffer.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">buffer zones</a>” around 50 airports that would reduce 5G C-band signal levels by at least 10 times within a mile of takeoff and landing runways. The mitigations would remain in place for six months, while the FAA attempted to clear more aircraft for operation.</p><p>On 19 January, the 5G systems were switched on.</p><p>Almost immediately, complaints began rolling into NASA. On their first flight to San Francisco after 5G was switched on, one pilot was horrified when their plane’s speed brakes unexpectedly activated before touchdown. “With over 18,000 hours as Captain of Boeing airliners…I’ve never had the auto speedbrakes deploy uncommanded before ground contact,” they wrote. “While I operate in the 5G environment, I have no intention on being the first to make a 5G landing.”</p><p>“I was predisposed to think the implementation would be a non-event and was surprised to experience actual interference events,” reported another pilot, who suspected a malfunctioning altimeter had caused their plane’s auto-throttle to disengage.</p><p>ASRS contains at least 40 reports of possible 5G interference in the vicinity of the 50 airports with buffer zones. With six reports, Phoenix Sky Harbor International Airport had the most complaints.</p><p>“I've been flying an aircraft with a radar altimeter for years and never once have I seen a malfunction such as this until the 5G turn on,” wrote another pilot in Florida, whose altimeter fluctuated between -90 and 400 feet prior to takeoff. “Coincidence? Probably not.”</p><p>But could it be? <a href=\"https://people.ece.uw.edu/rudell_chris/\" target=\"_blank\">Chris Rudell</a> is an associate professor in the department of electrical and computer engineering at the University of Washington. “I’d sleep like a baby [on a plane] that flew over a 5G base station at full power output,” he told <em>Spectrum</em>. “Probably something happens that’s unusual and the pilots attribute it to 5G but maybe it’s not attributable to 5G. After everything in the news, they’re now submitting what they actually see, whereas before they perhaps weren't motivated to do that.”</p><p>It is true that the FAA does now have a specific online radio-altimeter anomaly reporting form, that it asks pilots and other aviation personnel to complete. The FAA would not share the full details of these reports, but it did provide high-level data that indicates it has received around 550 such submissions since January.</p><p>The agency has reviewed over half of the reports, and was unable to rule out 5G interference in around 80 incidents. Contrary to the ASRS reports, none of the interference events identified by the FAA had any safety-related system impacts, affecting direct aircraft control inputs such as auto-throttle or speed brakes. The FAA has concluded that the mitigations it had agreed with wireless providers “are working.” In June, it agreed with the carriers to extend those mitigations for <a href=\"https://www.faa.gov/newsroom/faa-statements-5g\" rel=\"noopener noreferrer\" target=\"_blank\">another year</a>.</p><p>Although altimeter complaints on ASRS seem to be declining, many pilots still want tighter controls on 5G technology. <a href=\"https://www.aopa.org/\" target=\"_blank\">AOPA</a>, the world’s largest organization representing general aviation pilots and aircraft owners, told <em>Spectrum</em>: “We call for continued discussions between the public and private sectors to further mitigate the proven safety risks that 5G technology poses to radar altimeters. Further cooperation and coordination will bring about solutions that work for all.”</p><p>A few pilots were less diplomatic when sharing their views anonymously. “Shutdown [sic] 5G until carefully vetted,” suggested one. “Delay implementation of 5G service until all issues with radar altimeters and transport category aircraft have been dealt with,” wrote another. A third simply pleaded: “Turn off 5G cell service near airports.”<br/></p><p><em>This article was updated to clarify AOPA’s status as an aviation association.</em><br/></p>",
  "pubDate": "Thu, 13 Oct 2022 15:25:44 +0000",
  "guid": "https://spectrum.ieee.org/faa-5g",
  "category": [
    "5g",
    "Cellular networks",
    "Aviation",
    "Faa",
    "Fcc",
    "Wireless"
  ],
  "dc:creator": "Mark Harris",
  "media:content": ""
}