{
  "title": "#476: Celebrating 15 Years of MuggleCast (with Jamie!)",
  "link": "https://audioboom.com/posts/7648358",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4831,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>SPOILER WARNING: Do not listen if you haven't finished Book 6 yet, but today we're celebrating 15 YEARS OF MUGGLECAST!</li>\n<li>Welcome back everyone's favorite Brit, Jamie! He has some huge life updates for everyone.</li>\n<li>Why in the world did we ever decide to start a podcast? Who is this mystery \"Sarah\" person?</li>\n<li>We dig deep into the archive to roll clips from Episode 1! Were our predictions any good? Or totally wrong?</li>\n<li>From Steve Jobs to David Heyman to Pickle Pack and more, Andrew, Eric, Micah, Laura and Jamie share their favorite MuggleCast Moments!</li>\n<li>The hosts give their best fandom moments and top Potter news items over the last 15 years</li>\n<li>What will be the state of the Harry Potter fandom 15 years from now? We think the current state of the Star Wars and Marvel fandoms should clue us in.</li>\n<li>Make The Music Connection returns, with music from 2005!</li>\n<li>Why we still love doing MuggleCast after all this time...and...</li>\n<li>British Joke of the Day!</li>\n<li>After the outro, listeners share their favorite moments from over the years</li>\n<li>This week's episode is sponsored by BetterHelp (visit <a href=\"http://BetterHelp.com/mugglecast\">BetterHelp.com/mugglecast</a> to get 10% off your first month of therapy) and BeachBody On Demand (text 'mugglecast' to 30-30-30 for your free trial membership!</li>\n<li>Join our community at <a href=\"http://www.patreon.com/mugglecast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 04 Aug 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-08-03:/posts/7648358",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}