{
  "id": "yt:video:I4CjewbJgRQ",
  "yt:videoId": "I4CjewbJgRQ",
  "yt:channelId": "UCP3alkHEJhoxTpy3iVON-lg",
  "title": "Particle Physics is Founded on This Principle!",
  "link": "",
  "author": {
    "name": "Physics with Elliot",
    "uri": "https://www.youtube.com/channel/UCP3alkHEJhoxTpy3iVON-lg"
  },
  "published": "2022-04-14T20:50:37+00:00",
  "updated": "2022-06-27T23:03:18+00:00",
  "media:group": {
    "media:title": "Particle Physics is Founded on This Principle!",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Take your first steps toward understanding gauge field theory, which underlies everything we know about particle physics! Sponsored by Blinkist: Start your free trial and get 25% off! https://www.blinkist.com/elliot\n\nGet the notes for free here: https://courses.physicswithelliot.com/notes-sign-up\n\nConservation laws, symmetries, and in particular gauge symmetries are fundamental to the construction of the standard model of particle physics. And as we've seen in past videos, the link that connects symmetries and conservation laws is Noether's theorem. In this video, we'll see how it all extends to field theories. We'll learn to formulate a local conservation law by writing down its continuity equation, which describes how charge is conserved in any region of space. Then we'll see how these conservation laws appear any time we have a field theory with a continuous symmetry. We'll learn about the symmetry of electromagnetism, called U(1), that leads to the conservation of electric charge. And finally, we'll see how to write down the simplest example of a gauge theory by coupling to the electromagnetic potential. The global U(1) symmetry becomes a local symmetry thanks to the covariant derivative, and we arrive at a U(1) gauge theory! The standard model is a generalization of all this.\n\nField theory fundamentals: https://youtu.be/13hCkUiu_mI\n\nIntro to Noether's theorem: https://youtu.be/O0NYaO_OnH4\n\nThe principle of least action: https://youtu.be/sUk9y23FPHk\n\nThe Lagrangian for a special relativistic particle: https://youtu.be/KVk1QNTWBxQ\n\nThe Lagrangian for a general relativistic particle: https://youtu.be/h2SEK6Jjv3Y\n\nTutoring  inquiries: https://www.physicswithelliot.com/tutoring\n\nIf you find the content I’m creating valuable and would like to help make it possible for me to continue sharing more, please consider supporting me! You can make a recurring contribution at https://www.Patreon.com/PhysicsWithElliot, or make a one time contribution at https://www.physicswithelliot.com/support-me. Thank you so much!\n\nAbout physics mini lessons:\nIn these intermediate-level physics lessons, I'll try to give you a self-contained introduction to some fascinating physics topics. If you're just getting started on your physics journey, you might not understand every single detail in every video---that's totally fine! What I'm really hoping is that you'll be inspired to go off and keep learning more on your own.\n\nAbout me:\nI’m Dr. Elliot Schneider. I love physics, and I want to help others learn (and learn to love) physics, too. Whether you’re a beginner just starting out with your physics studies, a more advanced student, or a lifelong learner, I hope you’ll find resources here that enable you to deepen your understanding of the laws of nature. For more cool physics stuff, visit me at https://www.physicswithelliot.com.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}