{
  "title": "The inside story of how Google bathrooms became classrooms",
  "link": "https://blog.google/inside-google/life-at-google/inside-story-learning-on-the-loo/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"mnvsm\">As a software engineer at Google, Daniele Midi spends most of his time working on developing smart home products. But every week he also sets aside time to help Googlers learn something new from a surprising classroom: the bathroom. Daniele is the editor-in-chief of Learning on the Loo (LotL), a volunteer-driven series of one-page lessons that show up in Google bathrooms in every office across the globe. The “episodes,\" as they're called, hang inside each restroom and cover subjects from productivity tips for Gmail to avoiding bias in decision making.</p><p data-block-key=\"61q8k\">The ultimate mission of LotL is to improve Googlers’ lives at work. Daniele first got involved as an intern in 2015, helping with distributing new episodes in his office. Soon after, he joined the small editorial team, and eventually stepped up to lead it. Today, LotL releases new episodes twice a month, on topics that deal with productivity, career and personal development.</p><p data-block-key=\"40jrb\">LotL launched in 2007 and drew inspiration from <a href=\"https://testing.googleblog.com/2007/01/introducing-testing-on-toilet.html\">Testing on the Toilet (TotT)</a>, another Google institution, but a more tailored one. TotT began after a group of Googlers wanted to get input on how engineers could write better tests to ensure their code was working. One of those Googlers somewhat jokingly suggested posting tips about writing better tests in bathrooms. The idea caught on. Today, engineer Andrew Trenk heads up TotT, which now covers topics like coding best practices in addition to testing.</p><p data-block-key=\"fp2e9\">TotT and LotL have a few things in common — for instance, the length. “A challenge is often getting everything to fit on one page,” Andrew says. “This also happens to be what makes the content so useful: Authors are forced to limit themselves to only their most critical points.” And like TotT, LotL aims to be actionable, with quick tips Googlers can use right away.</p><p data-block-key=\"5og6h\">One example episode: “Effective meetings,” published May 17, 2022, written by Oded Niv. This episode shares tips for what to do and why, both before the meeting starts (“set a prioritized list of goals and activities”) and during the meeting (“politely keep the focus on the agenda”).</p><p data-block-key=\"kc8\">An episode titled “Are you writing clearly?” was published August 2, 2022, and written by Nancy Fann-Im. Tips include “Less is more,” “Write like you speak” and “Be direct.” “Even executives appreciate brevity over jargon,” Nancy writes.</p><p data-block-key=\"ciejt\">All Googlers can submit LotL episode ideas via a form that asks things like whether their lesson is applicable to Googlers everywhere and what the takeaways are. It also includes the note that at least one image or meme is required. Daniele and his team of three other Googlers read through the submissions. Once they accept a proposal, the author or authors work on the one-page copy, edited by the LotL team.</p><p data-block-key=\"60e1v\">“I think people would be surprised at the level of scrutiny each episode goes through,” Daniele says. LotL even began an open editing group, so any Googler can give suggestions on upcoming episodes via Google Docs. “It’s particularly helpful to get feedback on whether a lesson makes sense globally,” Daniele explains. “Local office culture in the U.S., for example, is different from office culture in Korea.”</p><p data-block-key=\"b3hv4\">Once the LotL team finalizes an episode, they send it to a cadre of Googler volunteers and local facilities teams across the globe who print and distribute it. (Each LotL is also available online and via email for Googlers.) From submission to launch day, the process takes a minimum of three to four weeks.</p><p data-block-key=\"39hi9\">Like so much about work, LotL had to evolve once the pandemic started. When people began working from home in 2020, LotL went entirely digital, and the content shifted. LotL proposals focusing on everything from at-home office setup to coping with the ongoing stress of the COVID-19 pandemic poured in. “It was a challenging time, for sure, but it was really wonderful to see how many Googlers wanted to share ideas to help each other, too,” Daniele says.</p><p data-block-key=\"ena7q\">Learning on the Loo remains a source of common ground for Googlers everywhere — and according to Daniele, it’s one that receives an encouraging amount of positive attention. “We recently added a short feedback form to our site,” Daniele says. “People will drop us emails that say, ‘Hey, I loved this, thank you so much!’ I just think that’s really, really cool.”</p></div></div></body></html>",
  "pubDate": "Tue, 01 Nov 2022 16:00:00 +0000",
  "guid": "https://blog.google/inside-google/life-at-google/inside-story-learning-on-the-loo/",
  "category": "Life at Google",
  "media:content": "",
  "og": {
    "type": "article",
    "title": "The inside story of how Google bathrooms became classrooms",
    "description": "Learning on the Loo, a series of one-pagers with quick lessons in productivity, career and personal development, is a fixture in many Google office bathrooms across the globe.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/learning_on_the_loo_hero_1.max-600x600.jpg",
    "site_name": "Google",
    "url": "https://blog.google/inside-google/life-at-google/inside-story-learning-on-the-loo/"
  },
  "author": {
    "name": "Molly McHugh-Johnson",
    "title": "Contributor",
    "department": "The Keyword",
    "company": ""
  }
}