{
  "id": "yt:video:ECeLlEjQmJI",
  "yt:videoId": "ECeLlEjQmJI",
  "yt:channelId": "UCddem5RlB3bQe99wyY49g0g",
  "title": "CASS SCENIC RAILROAD  WEST VIRGINIA    SHAY STEAM LOCOMOTIVE #6 & MEADOW RIVER DIESEL #9   XD39054",
  "link": "",
  "author": {
    "name": "PeriscopeFilm",
    "uri": "https://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g"
  },
  "published": "2022-11-04T16:29:46+00:00",
  "updated": "2022-11-04T16:29:46+00:00",
  "media:group": {
    "media:title": "CASS SCENIC RAILROAD  WEST VIRGINIA    SHAY STEAM LOCOMOTIVE #6 & MEADOW RIVER DIESEL #9   XD39054",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Want to support this channel and help us preserve old films? Visit https://www.patreon.com/PeriscopeFilm\nVisit our website www.PeriscopeFilm.com\n\nThis film contains footage of the Cass Scenic Railroad State Park, an 11-mile heritage railroad located in Cass, Pocahontas County, West Virginia. The park also includes the town of Cass and part of the summit of Back Allegheny Mountain's Bald Knob. The film begins with shots of Meadow River Lumber Company diesel locomotive #9 moving a caboose. This locomotive was a General Electric 70 Ton Switcher, Production Roster - SN 32816. The film then shows extensive footage of Cass steam locomotive #6. The film was shot in the winter, with Cass' locomotive #6 operating in a light snowfall. Built in 1945, this engine is the last Shay locomotive built and the largest Shay locomotive in existence. It was formerly from the Western Maryland Railway. The engine is shown moving its tender and a caboose.  \n\nWest Virginia Pulp & Paper Company (WVP&P) built the sawmill, railroad and town at Cass. Its huge logging operation used Shay locomotives almost exclusively. Today the Cass Railroad owns eight Shay locomotives, one Heisler locomotive, and one Climax locomotive.\n\nThe Meadow River Lumber Company operated in Rainelle, West Virginia from 1906 to 1975, and was the largest hardwood sawmill in the world.\n\n\nWe encourage viewers to add comments and, especially, to provide additional information about our videos by adding a comment!  See something interesting?  Tell people what it is and what they can see by writing something for example: \"01:00:12:00 -- President Roosevelt is seen meeting with Winston Churchill at the Quebec Conference.\"\n\nThis film is part of the Periscope Film LLC archive, one of the largest historic military, transportation, and aviation stock footage collections in the USA. Entirely film backed, this material is available for licensing in 24p HD, 2k and 4k. For more information visit http://www.PeriscopeFilm.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}