{
  "title": "What Does “Human Control” Over Autonomous Systems Mean?",
  "link": "https://spectrum.ieee.org/autonomous-weapons-control",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/conceptual-illustration-of-two-humanoid-heads-facing-away-from-each-other-with-a-pattern-of-nested-squares.jpg?id=32029419&width=1200&height=600&coordinates=0%2C682%2C0%2C682\"/><br/><br/><p><em><em>This article is part of our <a href=\"https://spectrum.ieee.org/collections/autonomous-weapons-challenges/\" target=\"_self\">Autonomous Weapons Challenges</a> series. The IEEE Standards Association is <a href=\"https://saforms.ieee.org/autonomous-weapons-participation/\" rel=\"noopener noreferrer\" target=\"_blank\">looking for your feedback</a> on this topic, and has invites you to answer <a href=\"https://saforms.ieee.org/autonomous-weapons-participation/\" rel=\"noopener noreferrer\" target=\"_blank\">these questions</a>.</em></em></p><p>\n<a href=\"https://spectrum.ieee.org/how-the-boeing-737-max-disaster-looks-to-a-software-developer\" target=\"_self\">Two Boeing 737 Max planes crashed</a> in 2018 and 2019 due to sensor failures that led to autopilot malfunctions that two human pilots were unable to overcome. Also in 2018, an Uber autonomous vehicle struck and killed a pedestrian in Arizona, even though a person in the car was supposed to be overseeing the system. These examples highlight many of the issues that arise when considering what “human control” over an autonomous system really means.\n</p><p>\n\tThe development of these autonomous technologies occurred within enormously complex bureaucratic frameworks. A huge number of people were involved—in engineering a number of autonomous capabilities to function within a single system, in determining how the systems would respond to an unknown or emergency situation, and in training people to oversee the systems. A failure in any of these steps could, and did, lead to a catastrophic failure in which the people overseeing the system weren’t able to prevent it from causing unintended harm.\n</p><hr/><p>\n\tThese examples underscore the basic human psychology that developers need to understand in order to design and test autonomous systems. Humans are <a href=\"https://www.bbc.com/future/article/20211019-why-we-place-too-much-trust-in-machines\" rel=\"noopener noreferrer\" target=\"_blank\">prone to over-trusting machines</a> and become increasingly complacent the more they use a system and nothing bad happens. Humans are notoriously bad at maintaining the level of focus necessary to catch an error in such situations, typically <a href=\"https://slate.com/technology/2018/03/safety-drivers-attention-spans-might-slow-self-driving-car-progress.html\" rel=\"noopener noreferrer\" target=\"_blank\">losing focus after about 20 minutes</a>. And the human response to an emergency situation can be <a href=\"https://www.tudelft.nl/en/2019/lr/unpredictable-training-better-prepares-pilots-for-emergencies/\" rel=\"noopener noreferrer\" target=\"_blank\">unpredictable</a>.\n</p><p>\n\tUltimately, “human control” is hard to define and has become a controversial issue in discussions about autonomous weapons systems, with many similar phrases used in international debates, including “meaningful human control,” “human responsibility,” and “appropriate human judgment.” But regardless of the phrase that’s used, the problem remains the same: Simply assigning a human the task of overseeing an AWS may not prevent the system from doing something it shouldn’t, and it’s not clear who would be at fault.\n</p><h3>Responsibility and Accountability</h3><p>\n\tAutonomous weapons systems can process data at speeds that far exceed a human’s cognitive capabilities, which means a human involved will need to know when to trust the data and when to question it.\n</p><p>\n\tIn the examples above, people were directly overseeing a single commercial system. In the very near future, a single soldier might be expected to monitor an entire swarm of hundreds of weaponized drones, with testing already taking place for soldiers. Each drone may be detecting and processing data in real time. If a human can’t keep up with a single autonomous system, they certainly wouldn’t be able to keep up with the data coming in from a swarm. Additional autonomous systems may thus be added to filter and package the data, introducing even more potential points of failure. Among other issues, this raises legal concerns, given that responsibility and accountability could quickly become unclear if the system behaves unexpectedly only after it’s been deployed.</p><h3>Human-Machine Teams</h3><p>\n\tArtificial intelligence often relies on machine learning, which can turn AI-based systems into black boxes, with the AI taking unexpected actions and leaving its designers and users uncertain as to why it did what it did. It remains unclear how humans working with AWS will respond to their machine partners or what type of training will be necessary to ensure the human understands the capabilities and limitations of the system. Human-machine teaming also presents challenges both in terms of training people to use the system and of developing a better understanding of the trust dynamic between humans and AWS. While the human-robot handoff may be a technical challenge in many fields, it quickly becomes a question of international humanitarian law if the handoff doesn’t go smoothly for a weapons system.\n</p><p>\n\tEnsuring responsibility and accountability for AWS is a general point of agreement among those involved in the international debate. But without sufficient understanding of human psychology or how human-machine teams should work, is it reasonable to expect the human to be responsible and accountable for any unintended consequences of the system’s deployment?\n</p><div class=\"ieee-sidebar-large\">\n<h3>What Do You Think?</h3>\n<p>\n\tWe want your feedback! To help bring clarity to these AWS discussions, the<a href=\"https://standards.ieee.org/\" rel=\"noopener noreferrer\" target=\"_blank\"> IEEE Standards Association</a> convened an expert group in 2020, to consider the ethical and technical challenges of translating AWS principles into practice and what that might mean for future development and governance. Last year, the expert group published its findings in a report entitled<a href=\"https://standards.ieee.org/wp-content/uploads/import/documents/other/ethical-technical-challenges-autonomous-weapons-systems.pdf\" rel=\"noopener noreferrer\" target=\"_blank\"> “<u>Ethical and Technical Challenges in the Development, Use, and Governance of Autonomous Weapons Systems</u></a>.” Many of the AWS challenges are similar to those arising in other fields that are developing autonomous systems. We expect and hope that IEEE members and readers of <em>IEEE Spectrum</em> will have insights from their own fields that can inform the discussion around AWS technologies.\n</p><p>\nWe’ve put together a<a href=\"https://saforms.ieee.org/autonomous-weapons-participation/\" rel=\"noopener noreferrer\" target=\"_blank\"> series of questions</a> on <a href=\"https://standards.ieee.org/wp-content/uploads/import/documents/other/ethical-technical-challenges-autonomous-weapons-systems.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">the Challenges document</a> that we hope you’ll answer, to help us better understand how people in other fields are addressing these issues. Autonomous capabilities will increasingly be applied to weapons systems, much as they are being applied in other technical realms, and we hope that by looking at the challenges in more detail, we can help establish effective technical solutions while contributing to discussions about what can and should be legally acceptable. Your feedback will help us move toward this ultimate goal.<a href=\"https://saforms.ieee.org/autonomous-weapons-participation/\" rel=\"noopener noreferrer\" target=\"_blank\"> Public comments will be open through 7 December 2022</a>.\n</p></div>",
  "pubDate": "Thu, 03 Nov 2022 13:20:08 +0000",
  "guid": "https://spectrum.ieee.org/autonomous-weapons-control",
  "category": [
    "Autonomous weapons",
    "Aws",
    "Robotics"
  ],
  "dc:creator": "Ariel Conn",
  "media:content": ""
}