{
  "id": "yt:video:HXB925ptd7Y",
  "yt:videoId": "HXB925ptd7Y",
  "yt:channelId": "UC5Jz6SBlu2Sv61kfssv4DOw",
  "title": "Compliant Spherical Mechanism: A Flexure-based Kinematic Sculpture",
  "link": "",
  "author": {
    "name": "The FACTs of Mechanical Design",
    "uri": "https://www.youtube.com/channel/UC5Jz6SBlu2Sv61kfssv4DOw"
  },
  "published": "2022-04-28T17:49:59+00:00",
  "updated": "2022-05-28T18:34:42+00:00",
  "media:group": {
    "media:title": "Compliant Spherical Mechanism: A Flexure-based Kinematic Sculpture",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "This video introduces a compliant three-degree-of-freedom (3 DOF) spherical mechanism that uses the collective deformations of blue flexures to ensure that every point trajectory on both its white dome-shaped frame and attached yellow probe lie in concentric spherical shells around a single stationary point (i.e., the center of the probe’s sphere). The mechanism was designed as a vibrating compliant kinematic sculpture to mesmerize students that poke at it. \n\nThe flexures used were adapted from a design proposed by Professor Just Herder’s group from Delft University of Technology. A link to their paper published in Precision Engineering is provided here:\n\nhttps://www.sciencedirect.com/science/article/pii/S0141635921000726\n\nAlso see this related video: https://www.youtube.com/watch?v=DAngcygU7tc \n\nThe link to Thingiverse to download the STL files necessary to 3D print and assemble our mechanism yourself is included here:\n\nhttps://www.thingiverse.com/thefactsofmechanicaldesign/designs\n\nAcknowledgements:\nSpecial thanks to the following individuals, who helped to fabricate and adapt the design so that it could be fabricated for my Compliant Mechanism Design course:\n\nAllaine Taduran, Alyssa Tomkinson, Feng Xu, Jiahui Xi, Justin Tang, Katusch Strich, Lily Tebb, Mingzhang Zhu, Mukesh Yadav, Noah Truong, Roger Truong, Sean Velandia, Shubham Wani, Varit Vicathorn, Weiqi Wang, William Xu, Yurika Yamada.\n\nDisclaimer: \nResponsibility for the content of this video is my own. The University of California, Los Angeles is not involved with this channel nor does it endorse its content.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}