{
  "id": "https://bibleinoneyear.org/en/youth/208",
  "title": "Day 208: Beautiful Feet",
  "description": "Proverbs 18:10–13,15–16, 1 Chronicles 3:4-5a, 10-16, Romans 10:9–15.  ‘Everyone who calls on the name of the Lord will be saved’ (v 13)",
  "pubDate": "Tue, 27 Jul 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/208/?ignore",
  "itunes:duration": "13:42",
  "guid": "enyouth27072021-208",
  "length": 822.05,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 208: Beautiful Feet",
  "itunes:subtitle": "Proverbs 18:10–13,15–16, 1 Chronicles 3:4-5a, 10-16, Romans 10:9–15.  ‘Everyone who calls on the name of the Lord will be saved’ (v 13)",
  "itunes:summary": "Friends of ours had been waiting for ten years for a baby. They had been told it was impossible. One day there was a ring on our doorbell. There she was. It was written all over her face. As soon as she was in the house she started jumping up and down, stamping her feet with joy and delight, announcing the good news. She had conceived. Their wait was over. She was carrying the good news in her own body. There is nothing more exciting than being the bearer of good news.\nYou too are the bearer of good news. The message of Jesus is in you. That is why, according to the apostle Paul, you have beautiful feet (Romans 10:15).\nAs his followers, we are all called to share the good news of Jesus. Some of us have the immense privilege of being called to do it as a full-time job. Way back in January 1978, when I was practising law, I wrote in my prayer diary:\n‘I long to spend my whole time preaching the gospel – telling people about the love of Jesus. But Romans 10:15 warns, “How can [people] preach unless they are sent?” I cannot and will not be able to preach the gospel unless I am sent by God to do so – it is a wonderful calling. “How beautiful are the feet of those who bring good news!”’\nThe heart of the good news is a righteousness that comes by faith (v.6). ‘Everyone who calls on the name of the Lord will be saved’ (v.13).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 208
}