{
  "title": "539: What Was The '98 Hogwarts School Year Like? And More Muggle Mail",
  "link": "https://audioboom.com/posts/7980671",
  "itunes:episode": 539,
  "itunes:title": "What Was The '98 Hogwarts School Year Like? And More Muggle Mail",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4692,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode, we empty some owl post from our Muggle Mail bag! What would the 1998-99 Hogwarts school year have looked like? Why did Harry decide to become an Auror? Plus, we analyze several new Credence theories, a Chicken Soup from India and a horcrux email from 2006 that we’ll finally answer!<br>\n<br>\n\n</div>\n<ul>\n<li>We're confounded! Harry Potter: Wizards Unite is closing this January!</li>\n<li>Harry Potter and the Sorcerer's Stone director Chris Columbus says he thinks they got Harry’s scar wrong... and is interested in making a Cursed Child movie!</li>\n<li>It's our monthly Muggle Mail episode with voicemails covering Dumbledore and Grindelwald's blood pact, Mads Mikkelson's casting and more!</li>\n<li>Would Hermione, Ginny and Luna have been close? Would the Slytherin students have been treated poorly? How would Snape have been remembered?</li>\n<li>Credence theories abound!</li>\n<li>Would J.K. Rowling ever write a HP-world book from a different character's perspective?</li>\n<li>What is Grindelwald's emotional motivation?</li>\n<li>Chicken Soup for the MuggleCast Soul returns!</li>\n<li>Our throwback email from 2006 covers Harry's glasses being a horcrux!</li>\n<li>Quizzitch: What was the first movie directed by Chris Columbus, which co-starred a young Vincent D'Onofrio as the Norse god Thor?</li>\n<li>This week's episode is brought to you by BetterHelp (get 10% off your first month at <a href=\"http://betterhelp.com/MuggleCast\">BetterHelp.com/MuggleCast</a>), WarbyParker (try 5 pairs of glasses at home for free at <a href=\"http://warbyparker.com/MuggleCast\">WarbyParker.com/MuggleCast</a>) and ThirdLove (Get 20% off at<a href=\"http://www.thirdlove.com/mugglecast\"> Thirdlove.com/mugglecast</a>)</li>\n<li>Coming up on Bonus MuggleCast (<a href=\"http://www.patreon.com/mugglecast\">available on Patreon</a>), the hosts discuss a certain character not appearing in The Secrets of Dumbledore and give their predictions on when we will see our first movie trailer!</li>\n</ul>\n",
  "pubDate": "Tue, 16 Nov 2021 10:00:00 +0000",
  "guid": "tag:audioboom.com,2021-11-15:/posts/7980671",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}