{
  "title": "Special Episode: The Low-Income Real Estate Story",
  "description": "<p>The housing market has seen record home price growth this year. But who does this boom benefit and who gets left behind?</p><p><br></p><p>----- Transcript -----</p><p><strong>Jim Egan </strong>Welcome to Thoughts on the Market. I'm James Egan, co-head of U.S. Securitized Products Research from Morgan Stanley,</p><p><br></p><p><strong>Sarah Wolfe </strong>and I'm Sarah Wolfe from the US economics team, focused on the U.S. consumer.</p><p><br></p><p><strong>Jim Egan </strong>And on this edition of the podcast, we'll be talking about the impact of the housing boom on America's low-income households. It's Tuesday, November 16th, 10:00 a.m. in New York.</p><p><br></p><p><strong>Jim Egan </strong>Regular listeners of the podcast have probably heard me talking with my colleague Jay Bacow about the record level of home price growth that we've seen this year. And we've talked about it from a number of different angles: how high can home price appreciation actually climb? How sustainable is this current level of growth? What's the aftermath going to be? But today, Sarah, you and I are going to be approaching this from a slightly different angle, and we're going to talk about the impact of rising home values on low-income households. So, what were some of the big questions behind your recent research, Sarah?</p><p><br></p><p><strong>Sarah Wolfe</strong> So there's been a lot of discussion this year, as you mentioned, around rising home prices, rising rents and the extremely healthy housing environment. So, we wanted to look at what this meant for households all across the income distribution and, in particular, what it meant for low-income households. There's been a lot of focus on how low-income households are going to fare as we move off of fiscal stimulus - I'm talking about the unemployment insurance benefits, the economic impact payments - and so we wanted to explore real estate wealth as a potential source of equity for this group in order to make the transition away from government stimulus into a more recovery part of the economy easier or not. And so that's really the focus of this report.</p><p><br></p><p><strong>Jim Egan </strong>All right. Now you've spent a lot of time talking about the low-income consumer. We've got the kind of excess savings narrative across the consumer in aggregate. I know that that is appearing in the low-income consumer a little bit, but maybe not as much as further up the spectrum. Can you dig into that for us a little bit? How is the low-income consumer performing right now?</p><p><br></p><p><strong>Sarah Wolfe </strong>So overall, the low-income consumer over the last year and a half has performed very well, and that's because we've seen an unprecedent amount of fiscal stimulus. We've also seen strong job growth among low-income industries, including retail trade, leisure and hospitality. These are where the jobs are coming back. And we're also seeing pretty strong wage growth for low-income workers. And then at the same time, there was a pretty significant pullback in spending like dining out and other services. So together we got this buildup of excess savings and, low-income households had savings as well, and there was excess savings held all across the income distribution. While this is really significant, it's important to know that the dollar amount of excess savings held among lower income households is not that significant. And they also have a higher marginal propensity to consume out of their savings. So, while the savings is there, it likely will not last long. And so, it's not going to be a longer-term source of wealth, and that's why we decided to turn our attention to real estate wealth. Will this be a potential long-term source of wealth and significant for this group of consumers?</p><p><br></p><p><strong>Jim Egan </strong>OK. So, when you looked into housing wealth and particularly for low-income consumers, what did you find?</p><p><br></p><p><strong>Sarah Wolfe </strong>Well, low-income homeowners have actually seen their real estate wealth increased by roughly $18,000 per household. That's from the end of 2019 through mid-2021. Now, in dollar terms, that's less than the rise in real estate for higher income groups. But in percentage change, it's a 19% increase in real estate wealth among low-income homeowners. And that's the largest percentage increase across the entire income distribution when it comes to real estate wealth.</p><p><br></p><p><strong>Sarah Wolfe </strong>So, there's clearly been a substantial amount of real estate wealth for homeowners, but it leads me to ask the question, can they actually access that wealth?</p><p><br></p><p><strong>Jim Egan</strong> That is probably the question we get asked most frequently. The record rise we've seen in home prices has brought equity in the U.S. housing market to levels we haven't seen. We have data going back over 26 years. We've never had more equity in the housing market than we do right now. Part of that's because this rise in home prices just was not accompanied by the rise in mortgage debt that we saw in the early 2000s, the last time home price growth was really anywhere close to where it is right now. So, the question we get from investors pretty frequently is, well are borrowers going to access this? How can borrowers access this? Are we going to see that same sort of mortgage equity withdrawal, that sort of cash out activity that we saw during the last cycle. And look, the high-level answer is it's difficult to say, given the lack of comprehensive data that we see there. Now, we do have some form of data from the GSEs, we have it from Ginnie Mae, that can show us how cash out activity is evolving, and we are seeing cash out activity really pick up in 2021. It wasn't the case in 2020. Falling rates in 2020 meant that a larger percentage of refinancings were more just straight rate-and-term refinances. They didn't have a cash out component. But we are starting to see cash out refinance activity pick up in 2021 from where it was in 2020.</p><p><strong>&nbsp;</strong></p><p><strong>Sarah Wolfe </strong>And how does mortgage credit availability play into all of this?</p><p><br></p><p><strong>Jim Egan</strong> We do think that's playing a pretty big role. Now we've talked about how mortgage credit availability is running at pretty tight levels. We actually undid six years’ worth of easing lending standards in the six months following COVID, but we have started to see lending standards plateau and they've started to ease from here. Now, how of those tight lending standards manifested themselves in terms of cash out activity? We're actually seeing the dollar amount that is being cashed out, it's lower today than it was in 2019 in terms of absolute dollar amount. If we talk about the amount of equity, the rising home prices we've seen, that means as a percentage of the property value, in 2019, we were seeing cash out refi’s remove roughly about 18% of value from the house. That's down to just 13% today. So people are able to access that equity, but tighter credit standards might be contributing to that dollar amount being lower. And it certainly means that the borrowers who are more likely to be able to access that are probably borrowers that are further up the credit quality spectrum, higher credit scores, for instance, perhaps higher income levels as well. So we do think that tight credit availability plays a role. But Sarah, turning this back to you.</p><p><br></p><p><strong>Jim Egan </strong>Once we get past the borrower's ability to actually remove cash from their home or the borrower's ability to tap that equity in their home. What are you seeing households use that money for?</p><p><br></p><p><strong>Sarah Wolfe </strong>Well, a bulk of the equity goes back into the home in the form of home improvement and repairs. There is a smaller amount that goes towards non-housing expenditures like education and apparel. Also, some of it goes towards paying down debt. But the large majority is back into the house in terms of home repairs and improvements.</p><p><br></p><p><strong>Jim Egan </strong>OK, I want to switch gears from homeowners to renters. Rents have been racing higher in recent months. That doesn't seem great for low-income consumers who don't own their homes. But what are you seeing there?</p><p><br></p><p><strong>Sarah Wolfe </strong>That's true. Home price appreciation is great for those who own a home, but only half of the bottom 20% are homeowners. This compares to 80% homeownership among the top 20%. And so while we've seen a rise in home price appreciation, it's coincided with escalating rents for non-homeowners. To put some numbers around it, CPI inflation-- this is consumer price index-- showed that rents rose 0.4% in October and 0.5% in September. And while that might not seem like a big number, that's the largest two month increase in rent inflation since 1992. We also find that low-income renters spend 63% of their income paying rent nationally, which is quite elevated. And we're forecasting that rent prices are just going to keep going up and up in the coming years, making it harder for Low-Income non-homeowners to afford having a home and leaving them at the mercy of rising rents.</p><p><br></p><p><strong>Jim Egan </strong>Now we've done a lot of work on inequal access to homeownership among minorities. How does this factor into the rising burden of rent?</p><p><br></p><p><strong>Sarah Wolfe </strong>Well, on top of the income disparity in homeownership, the racial disparity adds another dimension to the divide between low-income homeowners and renters. Our ESG strategies find that on average, the gap in homeownership between White and Black and Hispanic households is widest for low to moderate income families. This really limits the benefits of home price appreciation for minorities and further exacerbates racial inequalities.</p><p><br></p><p><strong>Jim Egan </strong>All right, so the record level of home price growth, which has led to a record level of equity in U.S. households, does appear to have increased wealth across the income spectrum. But when we look a little bit closer, that's not necessarily the case for lower income households the same way it is for higher income households. And, across the board, the ability of these different households to tap that equity is still a question.</p><p><br></p><p><strong>Sarah Wolfe </strong>That's correct. But I think that it's important to keep in mind that the picture is not all bad. The low-income household is still healthy, and we have the substantial amount of labor market income coming from lower wage jobs like retail trade, leisure and hospitality, transportation, combined with strong wage growth, all helping and supporting income growth longer term for this group.</p><p><br></p><p><strong>Jim Egan </strong>Sarah, always great speaking with you.</p><p><br></p><p><strong>Sarah Wolfe </strong>Great talking with you, Jim.</p><p><br></p><p><strong>Jim Egan</strong> As a reminder, if you enjoy Thoughts on the Market, please take a moment to rate and review us on the Apple Podcasts app. It helps more people to find the show.</p>",
  "itunes:title": "Special Episode: The Low-Income Real Estate Story",
  "itunes:episodeType": "full",
  "itunes:episode": 495,
  "itunes:summary": "The housing market has seen record home price growth this year. But who does this boom benefit and who gets left behind?",
  "content:encoded": "<p>The housing market has seen record home price growth this year. But who does this boom benefit and who gets left behind?</p><p><br></p><p>----- Transcript -----</p><p><strong>Jim Egan </strong>Welcome to Thoughts on the Market. I'm James Egan, co-head of U.S. Securitized Products Research from Morgan Stanley,</p><p><br></p><p><strong>Sarah Wolfe </strong>and I'm Sarah Wolfe from the US economics team, focused on the U.S. consumer.</p><p><br></p><p><strong>Jim Egan </strong>And on this edition of the podcast, we'll be talking about the impact of the housing boom on America's low-income households. It's Tuesday, November 16th, 10:00 a.m. in New York.</p><p><br></p><p><strong>Jim Egan </strong>Regular listeners of the podcast have probably heard me talking with my colleague Jay Bacow about the record level of home price growth that we've seen this year. And we've talked about it from a number of different angles: how high can home price appreciation actually climb? How sustainable is this current level of growth? What's the aftermath going to be? But today, Sarah, you and I are going to be approaching this from a slightly different angle, and we're going to talk about the impact of rising home values on low-income households. So, what were some of the big questions behind your recent research, Sarah?</p><p><br></p><p><strong>Sarah Wolfe</strong> So there's been a lot of discussion this year, as you mentioned, around rising home prices, rising rents and the extremely healthy housing environment. So, we wanted to look at what this meant for households all across the income distribution and, in particular, what it meant for low-income households. There's been a lot of focus on how low-income households are going to fare as we move off of fiscal stimulus - I'm talking about the unemployment insurance benefits, the economic impact payments - and so we wanted to explore real estate wealth as a potential source of equity for this group in order to make the transition away from government stimulus into a more recovery part of the economy easier or not. And so that's really the focus of this report.</p><p><br></p><p><strong>Jim Egan </strong>All right. Now you've spent a lot of time talking about the low-income consumer. We've got the kind of excess savings narrative across the consumer in aggregate. I know that that is appearing in the low-income consumer a little bit, but maybe not as much as further up the spectrum. Can you dig into that for us a little bit? How is the low-income consumer performing right now?</p><p><br></p><p><strong>Sarah Wolfe </strong>So overall, the low-income consumer over the last year and a half has performed very well, and that's because we've seen an unprecedent amount of fiscal stimulus. We've also seen strong job growth among low-income industries, including retail trade, leisure and hospitality. These are where the jobs are coming back. And we're also seeing pretty strong wage growth for low-income workers. And then at the same time, there was a pretty significant pullback in spending like dining out and other services. So together we got this buildup of excess savings and, low-income households had savings as well, and there was excess savings held all across the income distribution. While this is really significant, it's important to know that the dollar amount of excess savings held among lower income households is not that significant. And they also have a higher marginal propensity to consume out of their savings. So, while the savings is there, it likely will not last long. And so, it's not going to be a longer-term source of wealth, and that's why we decided to turn our attention to real estate wealth. Will this be a potential long-term source of wealth and significant for this group of consumers?</p><p><br></p><p><strong>Jim Egan </strong>OK. So, when you looked into housing wealth and particularly for low-income consumers, what did you find?</p><p><br></p><p><strong>Sarah Wolfe </strong>Well, low-income homeowners have actually seen their real estate wealth increased by roughly $18,000 per household. That's from the end of 2019 through mid-2021. Now, in dollar terms, that's less than the rise in real estate for higher income groups. But in percentage change, it's a 19% increase in real estate wealth among low-income homeowners. And that's the largest percentage increase across the entire income distribution when it comes to real estate wealth.</p><p><br></p><p><strong>Sarah Wolfe </strong>So, there's clearly been a substantial amount of real estate wealth for homeowners, but it leads me to ask the question, can they actually access that wealth?</p><p><br></p><p><strong>Jim Egan</strong> That is probably the question we get asked most frequently. The record rise we've seen in home prices has brought equity in the U.S. housing market to levels we haven't seen. We have data going back over 26 years. We've never had more equity in the housing market than we do right now. Part of that's because this rise in home prices just was not accompanied by the rise in mortgage debt that we saw in the early 2000s, the last time home price growth was really anywhere close to where it is right now. So, the question we get from investors pretty frequently is, well are borrowers going to access this? How can borrowers access this? Are we going to see that same sort of mortgage equity withdrawal, that sort of cash out activity that we saw during the last cycle. And look, the high-level answer is it's difficult to say, given the lack of comprehensive data that we see there. Now, we do have some form of data from the GSEs, we have it from Ginnie Mae, that can show us how cash out activity is evolving, and we are seeing cash out activity really pick up in 2021. It wasn't the case in 2020. Falling rates in 2020 meant that a larger percentage of refinancings were more just straight rate-and-term refinances. They didn't have a cash out component. But we are starting to see cash out refinance activity pick up in 2021 from where it was in 2020.</p><p><strong>&nbsp;</strong></p><p><strong>Sarah Wolfe </strong>And how does mortgage credit availability play into all of this?</p><p><br></p><p><strong>Jim Egan</strong> We do think that's playing a pretty big role. Now we've talked about how mortgage credit availability is running at pretty tight levels. We actually undid six years’ worth of easing lending standards in the six months following COVID, but we have started to see lending standards plateau and they've started to ease from here. Now, how of those tight lending standards manifested themselves in terms of cash out activity? We're actually seeing the dollar amount that is being cashed out, it's lower today than it was in 2019 in terms of absolute dollar amount. If we talk about the amount of equity, the rising home prices we've seen, that means as a percentage of the property value, in 2019, we were seeing cash out refi’s remove roughly about 18% of value from the house. That's down to just 13% today. So people are able to access that equity, but tighter credit standards might be contributing to that dollar amount being lower. And it certainly means that the borrowers who are more likely to be able to access that are probably borrowers that are further up the credit quality spectrum, higher credit scores, for instance, perhaps higher income levels as well. So we do think that tight credit availability plays a role. But Sarah, turning this back to you.</p><p><br></p><p><strong>Jim Egan </strong>Once we get past the borrower's ability to actually remove cash from their home or the borrower's ability to tap that equity in their home. What are you seeing households use that money for?</p><p><br></p><p><strong>Sarah Wolfe </strong>Well, a bulk of the equity goes back into the home in the form of home improvement and repairs. There is a smaller amount that goes towards non-housing expenditures like education and apparel. Also, some of it goes towards paying down debt. But the large majority is back into the house in terms of home repairs and improvements.</p><p><br></p><p><strong>Jim Egan </strong>OK, I want to switch gears from homeowners to renters. Rents have been racing higher in recent months. That doesn't seem great for low-income consumers who don't own their homes. But what are you seeing there?</p><p><br></p><p><strong>Sarah Wolfe </strong>That's true. Home price appreciation is great for those who own a home, but only half of the bottom 20% are homeowners. This compares to 80% homeownership among the top 20%. And so while we've seen a rise in home price appreciation, it's coincided with escalating rents for non-homeowners. To put some numbers around it, CPI inflation-- this is consumer price index-- showed that rents rose 0.4% in October and 0.5% in September. And while that might not seem like a big number, that's the largest two month increase in rent inflation since 1992. We also find that low-income renters spend 63% of their income paying rent nationally, which is quite elevated. And we're forecasting that rent prices are just going to keep going up and up in the coming years, making it harder for Low-Income non-homeowners to afford having a home and leaving them at the mercy of rising rents.</p><p><br></p><p><strong>Jim Egan </strong>Now we've done a lot of work on inequal access to homeownership among minorities. How does this factor into the rising burden of rent?</p><p><br></p><p><strong>Sarah Wolfe </strong>Well, on top of the income disparity in homeownership, the racial disparity adds another dimension to the divide between low-income homeowners and renters. Our ESG strategies find that on average, the gap in homeownership between White and Black and Hispanic households is widest for low to moderate income families. This really limits the benefits of home price appreciation for minorities and further exacerbates racial inequalities.</p><p><br></p><p><strong>Jim Egan </strong>All right, so the record level of home price growth, which has led to a record level of equity in U.S. households, does appear to have increased wealth across the income spectrum. But when we look a little bit closer, that's not necessarily the case for lower income households the same way it is for higher income households. And, across the board, the ability of these different households to tap that equity is still a question.</p><p><br></p><p><strong>Sarah Wolfe </strong>That's correct. But I think that it's important to keep in mind that the picture is not all bad. The low-income household is still healthy, and we have the substantial amount of labor market income coming from lower wage jobs like retail trade, leisure and hospitality, transportation, combined with strong wage growth, all helping and supporting income growth longer term for this group.</p><p><br></p><p><strong>Jim Egan </strong>Sarah, always great speaking with you.</p><p><br></p><p><strong>Sarah Wolfe </strong>Great talking with you, Jim.</p><p><br></p><p><strong>Jim Egan</strong> As a reminder, if you enjoy Thoughts on the Market, please take a moment to rate and review us on the Apple Podcasts app. It helps more people to find the show.</p>",
  "guid": "gid://art19-episode-locator/V0/7Mf7_63K2j8Xm5xCLd-5JOXizvHDo3WrdIvgdCrC4vc",
  "pubDate": "Wed, 17 Nov 2021 00:51:52 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:duration": "00:09:21",
  "enclosure": ""
}