{
  "id": "tag:blogger.com,1999:blog-2499715909956774229.post-1000566262278153408",
  "published": "2020-03-05T14:41:00.003-08:00",
  "updated": "2020-03-05T14:41:37.833-08:00",
  "title": "Coronavirus and Monetary Policy",
  "content": "On Tuesday, the FOMC voted to reduce the Fed's range for the fed funds rate by 50 basis points, to 1.00-1.25%, and on Wednesday, the Bank of Canada followed suit with a 50 basis point cut in its overnight interest rate target, from 1.75% to 1.25%. As you know, 50 basis point cuts by central banks are aggressive, particularly in the Fed's case where the cut occurred outside a regularly scheduled FOMC meeting. Other central banks might be doing the same - if their policy rates were not already at or close to zero, if not negative.<br /><br />What's going on? Well, Jay Powell and Steve Poloz have told us why they're doing what they're doing. What do they have to say? First, in the <a href=\"https://www.federalreserve.gov/newsevents/pressreleases/monetary20200303a.htm\">FOMC statement</a> that Powell and his colleagues issued, it says that the \"fundamentals of the US economy remain strong,\" but the coronavirus \"poses evolving risks.\" The FOMC is cutting 50 basis points \"in support\" of the Fed's dual mandate. There's no information beyond that. In <a href=\"https://www.federalreserve.gov/mediacenter/files/FOMCpresconf20200303.pdf\">his short press conference,</a> Powell didn't really add to that. Basically, the cut is to lend \"support,\" apparently, and there are no promises about where the Fed goes from here. And, by the way, this has nothing to do with what Donald Trump wants, according to Powell.<br /><br />So, that doesn't enlighten me much. An extreme action has been taken, but it's not based on anything that's actually showing up in the data yet. This is based solely on speculation about the effects on economic activity of a contagious virus that is going around. About which we know more than we did a couple of months ago, but much less than we would like to know. So, from all evidence, the Fed is taking a shot in the dark.<br /><br />But maybe Steve Poloz knows something that Powell doesn't know? The <a href=\"https://www.bankofcanada.ca/2020/03/fad-press-release-2020-03-04/\">Bank of Canada statement</a> certainly has more information in it than does the FOMC statement, in part because the Bank of Canada made its decision in a regularly-scheduled policy meeting. There's a review of current conditions, which basically looks like more of the same. Current inflation (headline CPI) is above target at 2.4%, the labor market looks good, but there is some weakness in 4th quarter 2019 real GDP growth. Otherwise, like the US, the fundamentals are strong, but the statement seems to go out of its way to suggest that there's some weakness, presumably to justify the big reduction in the target rate. With regard to the coronavirus, the statement says: <blockquote>...business activity in some regions [of the world] has fallen sharply and supply chains have been disrupted. This has pulled down commodity prices and the Canadian dollar has depreciated. Global markets are reacting to the spread of the virus by repricing risk across a broad set of assets, making financial conditions less accommodative. It is likely that as the virus spreads, business and consumer confidence will deteriorate, further depressing activity.</blockquote>So, I think that's really the guts of the information that's supporting the policy decision. We know there's something going on with respect to the real side of the economy. Anecdotal evidence tells us that supply chain disruptions, originating mainly in China, could be a serious problem for domestic economic activity. We're also seeing large asset price movements. Stock prices are down, and prices of government debt are up. We're expecting to see some negative information in soft data - business and consumer confidence - but we're not measuring that as yet.<br /><br />But, we still don't have so much to go on. No hard data, really. Asset prices have been known to move by large amounts in the past, without any central bank response. But what's this about financial conditions becoming \"less accommodative.\" I've heard that comment elsewhere, and I'm not sure what it means. The idea seems to be that financial markets get \"tight\" on their own, and then it's the job of the central bank to loosen things up. Maybe I can see some sign of \"tightening\" financial conditions in stress indices, or financial conditions indices. Here's the St. Louis Fed's financial stress index:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-8FF5HnZxoU4/XmAiKaZLo5I/AAAAAAAADyw/143qCn2YxIkikNbC6GzqqGxmRCixn3uvACNcBGAsYHQ/s1600/stlstress.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://2.bp.blogspot.com/-8FF5HnZxoU4/XmAiKaZLo5I/AAAAAAAADyw/143qCn2YxIkikNbC6GzqqGxmRCixn3uvACNcBGAsYHQ/s640/stlstress.png\" width=\"640\" height=\"247\" data-original-width=\"1168\" data-original-height=\"450\" /></a></div>And here's the Chicago Fed's financial conditions index:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-vsBUnCHLbcg/XmAiUP_MBEI/AAAAAAAADy0/JggRHNoBpFQTuMgSU2XgiJJRXwAoEo_cQCNcBGAsYHQ/s1600/chicagostress.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://1.bp.blogspot.com/-vsBUnCHLbcg/XmAiUP_MBEI/AAAAAAAADy0/JggRHNoBpFQTuMgSU2XgiJJRXwAoEo_cQCNcBGAsYHQ/s640/chicagostress.png\" width=\"640\" height=\"247\" data-original-width=\"1168\" data-original-height=\"450\" /></a></div>Those two charts show basically the same thing. Not much going on. Maybe people have something else in mind? There certainly have been large movements in the prices of Treasury securities in the US:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-hB1IRJWoCuI/XmF8nkZgUfI/AAAAAAAADzc/_kmAAT66eFU8iAcoA52zbMrbJc8HWD53gCNcBGAsYHQ/s1600/interest2.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://2.bp.blogspot.com/-hB1IRJWoCuI/XmF8nkZgUfI/AAAAAAAADzc/_kmAAT66eFU8iAcoA52zbMrbJc8HWD53gCNcBGAsYHQ/s640/interest2.png\" width=\"640\" height=\"247\" data-original-width=\"1168\" data-original-height=\"450\" /></a></div>The chart shows the 3-month T-bill rate, and the 10-year bond yield, both of which have dropped even more than the drop in the Fed's policy rate. The Fed moved down 50 basis points, but the whole Treasury yield curve has shifted down by much more than that. But why would I call that financial tightening? Looks like easing, don't you think?<br /><br />Another interesting phenomenon in US financial markets is what's going on in overnight markets. Since last fall, the Fed has been purchasing Treasury bills, and now has a <a href=\"https://www.federalreserve.gov/releases/h41/current/\">stock of about $280 billion in T-bills.</a> As well, to maintain its overnight fed funds target, the Fed has been intervening in the overnight repo market, on the lending side. On February 27, there was about $140 billion in repos outstanding (overnight and term). However, on Tuesday and Wednesday of this week, the Fed's lending on the repo market expanded substantially. In fact, demand for overnight repos apparently exceeded the Fed's $100 billion cap. So, overnight Fed repos on Tuesday and Wednesday were $100 billion, where last week overnight repos were running roughly $30-$50 billion per day. So, something is causing high demand for overnight credit, and upward pressure on the overnight repo rates, while Treasury yields at all maturities are dropping like rocks. So, two issues here. First, why is the Fed capping its overnight repo lending? If it's so important to hold down short rates, the Fed should lift the cap. Second, the drop in Treasury yields in part reflects a high demand for safe assets. Why is the Fed continuing to buy T-bills? The market wants them, so the Fed should be selling T-bills or, short of that, stopping its purchases.<br /><br />What does history, and theory, tell us about what central banks should be doing now, in response to the coronavirus? History doesn't give us a lot to go on. In modern times, we haven't had to deal with a global pandemic of this type, with this level of potential widespread economic disruption. But, is this like dealing with other types of large shocks? First, is this like a financial crisis? No. The financial crisis originated as disruption in the financial sector. As such, it had historical precedents, and there is a wealth of experience concerning how a central bank should deal with a financial panic. In a financial crisis, the standard responses involve central bank lending, and bailouts. There is of course plenty of judgement that comes into play concerning who to lend to and how, who to bail out and how, and what the costs and benefits are. But, in general, this is all relatively well-understood. I know policymakers got plenty of flack in the last recession, but in general they were following a time-worn script. Not so much after the recession was over, but that's another story.<br /><br />Second, for policy purposes, is the coronavirus anything like a war? No. Wars involve a reallocation of labor and capital across sectors, as human beings go into the armed forces, peacetime production goes away, and wartime production ramps up. There are important questions concerning how the expenditure on the war machine is financed. Little of that is going on here, as what policymakers are dealing with is a general cutback in across-the-board economic activity, and a reduction in time devoted to market activities. Public spending comes into play, but it's not of the magnitude that we observe in a war. So, I don't think we can learn anything from wars in this case.<br /><br />Finally, what about natural disasters? Is that similar? Maybe. Floods and hurricanes, for example, can destroy aggregate economic activity temporarily, so that looks similar. And public spending is required to deal with the disaster. But if we take that seriously, this might tell us that monetary policy should do nothing and central bankers should sit on the sidelines. You may remember some monetary policy response to a hurricane or flood, but I don't.<br /><br />But what would theory tell us? There are of course plenty of Keynesian models - both new and old - in which output is demand-determined, and therefore output contractions occur because \"demand\" falls. I guess what people mean when they say the coronavirus is a \"supply\" shock and not a \"demand\" shock is that Keynesian models are not equipped to help us understand what is going on in this instance, so let's forget about that stuff. Some people -Roger Farmer for example - like to think about multiple equilibrium models. In a multiple equilibrium world, what policymakers say, or what they commit to, can make a difference. So, perhaps the large moves by the Fed and the Bank of Canada this week could be seen as bolstering confidence. But, those aggressive moves could also cause people to think that a disaster is looming. Maybe the central bankers know something we don't, and we should panic. Go buy toilet paper, instead of that new car.<br /><br />But, there are regular declines in economic activity that we deal with on a regular basis, apparently without any discretionary response from the central bank. Those regular declines are due to weekends, and seasonals. Every weekend a lot of people produce no market output. Every winter, some types of economic activity become more costly to undertake. Every summer a lot of people go on vacation. But, we've all become so accustomed to staring at seasonally adjusted data, that we forget a lot of that. There's a substantial amount of seasonal variation in a many macroeconomic time series. For example, here's US employment, unadjusted:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-1-YRdw97xqg/XmFyIfn01aI/AAAAAAAADzQ/ybaoMZ9iB0UrgvslNXVaPu8evLSRi2jnACNcBGAsYHQ/s1600/employment.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://2.bp.blogspot.com/-1-YRdw97xqg/XmFyIfn01aI/AAAAAAAADzQ/ybaoMZ9iB0UrgvslNXVaPu8evLSRi2jnACNcBGAsYHQ/s640/employment.png\" width=\"640\" height=\"247\" data-original-width=\"1168\" data-original-height=\"450\" /></a></div>Typically, there's a big dip in employment in January, and a smaller one in August. The drop in employment from the busiest month to the least busy month isn't as large as the drop in employment during the last recession, but it's about 25% of that drop, typically, and it happens every year. And, importantly, the central bank is responding to that. Part of what the central bank does is to smooth out seasonal variation in interest rates, and also to smooth out bumps in the payments system, that is predictable disturbances that have to do with the month, the day of the week, or the season. An important part of central bank activity (though increasingly less important) is to supply currency elastically on weekends, in the holiday season, etc., to accommodate demand.<br /><br />So, that's all just happening automatically, as a result of standard central banking procedure - pegging an overnight nominal interest rate. And that will happen while the coronavirus is making us sick. The key question is whether the central bank should be doing more. Should the central bankers have done what they did - aggressively cut interest rate targets as if they were dealing with a financial crisis, or a large drop in (seasonally adjusted) employment at the onset of a recession?<br /><br />Jay Powell says that the interest rate cut will \"support\" the economy. Steve Poloz says that the interest rate cut will help consumer and business confidence. But how? Central bankers are always telling us about Friedman's \"long and variable lags.\" The usual claim is that it takes a long time - maybe up to a couple of years - for monetary policy to have its effects. I don't know whether that's true or not, but it's a standard part of central banking lore. But, if the effects of the coronavirus are going to be temporary - a few months - why do anything if it's not going to matter within the relevant time frame? Maybe the interest rate cuts are supposed to inspire confidence. Typically, we think that interest rate cuts are going to tip the balance for consumers thinking about buying consumer durables and houses, or for firms making investment decisions. But, if the message I'm getting from the central bank is that things could get really bad, I'm going to be inclined to hunker down and postpone big spending decisions. So, it's hard to see what got accomplished this week on the monetary policy front.<br /><br />Finally, there's the issue of leaving policy space to deal with whatever future shocks might be thrown at us. Central bankers find it very easy to cut interest rate targets, and very hard to increase them. It's clear that, now these rate cuts are in place, central bankers will be slow to move up again, after the coronavirus passes. Non-neutralities of money are temporary - we don't get permanently lower output by having low nominal interest rates forever. So, once we cut rates now, we can't cut them later, and the real effects, such as they are, will dissipate.<br /><br />So, I'm inclined to think that the Fed, and the Bank of Canada, did the wrong things this week. The potential benefits are too small, and the potential costs too large. At the minimum, central bankers could have waited for more information, or cut less aggressively.<br /><br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Stephen Williamson",
    "uri": "http://www.blogger.com/profile/01434465858419028592",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}