{
  "title": "Scholz Kowtows to Beijing",
  "link": "https://www.heritage.org/global-politics/commentary/scholz-kowtows-beijing",
  "description": "<p>On Nov. 3-4, German Chancellor Olaf Scholz will lead a delegation of German business leaders to Beijing, <a href=\"https://www.thelocal.de/20221026/explained-why-is-olaf-scholzs-stance-on-china-so-controversial-in-germany/\" rel=\"noopener\" target=\"_blank\">becoming</a> the first G7 leader to visit China since the start of the pandemic. His timing is inopportune. The visit comes amid a firestorm of controversy ignited by the German Cabinet’s approval of Chinese state-owned COSCO’s purchase of a 24.9% stake in a terminal in Hamburg, Germany’s largest port.  </p>\n\n<p>The decision was pushed through by Scholz’s Social Democratic Party (SPD) over the objections of his coalition partners. The foreign ministry, led by the Greens Annalena Baerbock, is said to be apoplectic, as are the government ministries led by the Free Democratic Party (FDP). The Greens and FDP reportedly <a href=\"https://www.reuters.com/markets/deals/german-cabinet-approves-investment-by-chinas-cosco-hamburg-port-terminal-sources-2022-10-26/\" rel=\"noopener\" target=\"_blank\">drafted a note</a> saying the decision, \"disproportionately expands China's strategic influence on German and European transport infrastructure as well as Germany's dependence on China.\"  </p>\n\n<p>SPD argues that COSCO’s stake is less than the 35% they had desired, and the Chinese enterprise cannot exceed its current stake without passing further investment review. That may be true, but it’s cold comfort for Scholz’s coalition partners, who have lately felt put upon.  </p>\n\n<p>Scholz’s decision also runs counter to an overarching trend in the U.S. and Europe, at least in terms of infrastructure acquisitions, toward greater wariness of the security risks associated with Chinese investments. Given all we know about China’s predatory business practices, total disregard for human rights (Xinjiang concentration camps, crackdowns on dissent in Hong Kong), and utter contempt for the laws of sovereign nations (recent revelations of illegal Chinese “police” stations in the Netherlands), Germany’s decision seems even more jarring. </p>\n\n<p><strong>>>> <a href=\"https://www.heritage.org/europe/commentary/3-seas-initiative-americas-opportunity-europe-advance-national-interests\">3 Seas Initiative: America’s Opportunity in Europe to Advance National Interests</a></strong></p>\n\n<p>The decision is, however, consistent with Scholz’s determination to strengthen Germany’s already deep economic ties with China. He is following a path blazed by his predecessor, Christian Democrat Chancellor Angela Merkel. For six years running, China has been Germany’s <a href=\"https://www.cnbc.com/2022/09/14/germany-drawing-up-new-china-trade-policy-vows-no-more-naivety.html\" rel=\"noopener\" target=\"_blank\">largest trading partner</a>, and even that may understate the importance of the Chinese market for German exports. For instance, China remains the largest market for Germany’s politically powerful automotive industry. More than one out of every three German cars produced is sold in China.  </p>\n\n<p>Though aware of his nation’s dependence on China, Scholz does not wish to backtrack. He recently stated that, “Decoupling is the wrong answer.” Rather, he hopes that over time, Germany can diversify its investments and export market enough to lessen its dependence on China. </p>\n\n<p>This hope appears to be untethered from current reality. German companies continue to pour money into China. BMW, for example, <a href=\"https://www.bloomberg.com/news/articles/2022-10-11/scholz-plans-china-visit-around-nov-3-4-ahead-of-g-20-summit\" rel=\"noopener\" target=\"_blank\">purchased</a> “a controlling stake in its car-making joint-venture… [and] opened a multibillion-dollar factory extension early this year in Shenyang.” Other German firms like Audi and chemical giant BASF are soon to open large plants in China.  </p>\n\n<p>In September, Germany’s FDP economy minister <a href=\"https://www.reuters.com/world/europe/germanys-new-china-policy-will-not-be-naive-economy-minister-2022-09-13/\" rel=\"noopener\" target=\"_blank\">promised</a> “no more naivety” in regard to Germany’s trading relations with China. Scholz isn’t naïve, yet unfortunately believes he has no better option. He continues to court the CCP despite every known risk. In line with this view, since taking office, he has consistently <a href=\"https://euobserver.com/tickers/153903\" rel=\"noopener\" target=\"_blank\">sought to resuscitate</a> the thankfully comatose China-EU Investment Agreement, a deal with myriad pitfalls.  </p>\n\n<p>Even putting the security risks aside, the Scholz approach entails long-term economic risks. Chinese firms are cannibalizing Germany industry, using intellectual property gained via partnership arrangements or outright theft to gain market share in China as well as in Europe. China’s solar industry has already decimated its German rivals. Now, German carmakers are fighting tooth and nail for electric vehicle market share inside China, even as their Chinese rivals <a href=\"https://www.ft.com/content/791720d0-df91-4973-99cc-e847a8caab39\" rel=\"noopener\" target=\"_blank\">launch a renewed</a> push to gain a foothold in Germany’s domestic EV market. </p>\n\n<p>Another key factor for the German government is the overall health of the economy. Germany can no longer rely on cheap Russian energy to keep its economy humming. Energy costs in Germany are now 7-10 times what they were a year ago. This is having an especially deleterious impact on German manufacturing, causing many companies to move production away from Europe to cheaper shores, including China.  </p>\n\n<p><strong>>>> <a href=\"https://www.heritage.org/asia/report/responding-the-china-challenge-blueprint-20\">Responding to the China Challenge: Blueprint 2.0</a></strong></p>\n\n<p>Scholz, however, fails to appreciate the symbiotic relationship between China and Russia. Strengthening ties to China means strengthening Russia’s hand in Europe. This weakens the West’s collective ability to push back against Beijing’s and Moscow’s systematic assault on democratic principles.   </p>\n\n<p>Even Germany’s moral position is compromised by its relations with Beijing. Scholz raised “the situation of the Uighurs in Xinjiang,” in his <a href=\"https://www.bundesregierung.de/breg-en/news/chancellor-scholz-un-2128398\" rel=\"noopener\" target=\"_blank\">September speech</a> at the UN General Assembly. But by doubling down on trade ties and departing post haste for Beijing on the heels of Xi’s latest consolidation of power and continuing belligerence toward Taiwan, he undermines any serious effort to hold China accountable for its abuses.  </p>\n\n<p>For the Chancellor, the precarious state of the German economy undoubtedly confirms his belief that its reliance on China is a strength to be drawn on rather than a liability. Yet, burrowing deeper into economic dependence on Beijing isn’t healthy in the long run and raises serious issues in the here and now—none of which the Scholz government seems to have an answer for.  </p>\n\n<p>The Chancellor’s upcoming visit to China and Hamburg port decision are a slap in the face of his coalition partners. These acts have also opened rifts with other European nations like France. And they have surely confirmed to Washington that too many in Europe remain comfortable with the Faustian bargain inherent in arriving cap in hand at the court of Xi.  </p>",
  "pubDate": "Fri, 04 Nov 2022 12:59:41 -0400",
  "dc:creator": "Daniel Kochis",
  "guid": "https://www.heritage.org/global-politics/commentary/scholz-kowtows-beijing"
}