{
  "title": "The Power of Unity | Tony and Pastor Miles McPherson discuss the third option to healing the racial divide",
  "pubDate": "Sat, 19 Jan 2019 02:01:10 +0000",
  "guid": "7ad5206856b4423382ba8e9ad46f2291",
  "link": "https://tonyrobbins.libsyn.com/the-power-of-unity-tony-and-pastor-miles-mcpherson-discuss-the-third-option-to-healing-the-racial-divide-0",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Police shootings. Border protests. White nationalist rallies. There’s no denying that we live in a time of racial divide that only seems to be growing. And while it’s easy to direct our focus to these great chasms that separate us, this is actually when it becomes even more imperative to start focusing on what unites us.</span></p> <p><span style=\"font-weight: 400;\">In this episode of the Tony Robbins Podcast, Tony is sitting down with Pastor Miles McPherson of the Rock Church in San Diego, who leads tens of thousands of diverse individuals in sermon every month. He’s also a former NFL football player, motivational speaker, and he has recently authored</span> <a href= \"http://milesmcpherson.com/thethirdoption/\"><span style= \"font-weight: 400;\">The Third Option: Hope for a Racially Divided Nation</span></a><span style=\"font-weight: 400;\">. Pastor Miles brings a refreshingly different perspective to the discussion around race and race relations, asking the tough questions about how we ended up in this state of tension and turmoil, and what we can do on a psychological and practical level, so that we can initiate real change.</span></p> <p><span style=\"font-weight: 400;\">Where does racism come from? Are we all biased in some capacity? How do we expose racial divides, and most importantly, how do we move beyond them? These are just some of the questions that Tony and Pastor Miles have a tough, honest conversation about so that we can all find a way to be part of the solution. Because perhaps it’s time for us to all take a step back, stop focusing on what separates us, and star focusing on what we have in common, so that we can all work together to build a more united world.</span></p> <p><br /> <br /></p>",
  "content:encoded": "<p>Police shootings. Border protests. White nationalist rallies. There’s no denying that we live in a time of racial divide that only seems to be growing. And while it’s easy to direct our focus to these great chasms that separate us, this is actually when it becomes even more imperative to start focusing on what unites us.</p> <p>In this episode of the Tony Robbins Podcast, Tony is sitting down with Pastor Miles McPherson of the Rock Church in San Diego, who leads tens of thousands of diverse individuals in sermon every month. He’s also a former NFL football player, motivational speaker, and he has recently authored <a href= \"http://milesmcpherson.com/thethirdoption/\">The Third Option: Hope for a Racially Divided Nation</a>. Pastor Miles brings a refreshingly different perspective to the discussion around race and race relations, asking the tough questions about how we ended up in this state of tension and turmoil, and what we can do on a psychological and practical level, so that we can initiate real change.</p> <p>Where does racism come from? Are we all biased in some capacity? How do we expose racial divides, and most importantly, how do we move beyond them? These are just some of the questions that Tony and Pastor Miles have a tough, honest conversation about so that we can all find a way to be part of the solution. Because perhaps it’s time for us to all take a step back, stop focusing on what separates us, and star focusing on what we have in common, so that we can all work together to build a more united world.</p> <p> </p>",
  "enclosure": "",
  "itunes:duration": "56:16",
  "itunes:explicit": false,
  "itunes:keywords": "pastor,mcpherson,Miles,tony,robbins,divide,racism,racial",
  "itunes:subtitle": "Police shootings. Border protests. White nationalist rallies. There’s no denying that we live in a time of racial divide that only seems to be growing. And while it’s easy to direct our focus to these great chasms that separate us, this is...",
  "itunes:episodeType": "full"
}