{
  "title": "S1E39 - Chasing Dreams and Making History with Olympic Runner Dom Scott",
  "guid": "https://pinecast.com/guid/655fcadc-68bd-476a-885c-2a9b6c6e5ac2",
  "pubDate": "Tue, 30 Mar 2021 06:30:00 -0000",
  "itunes:duration": "01:05:37",
  "description": "<p>South African Olympic runner, Dom Scott, joins Laura today for a truly inspiring conversation about persevering and making tough decisions to make your dreams a reality. Born in Cape Town, Dom’s journey to the Olympics meant moving away from her family at a young age to access the training and opportunities offered elsewhere, which resulted in multiple NCAA titles, 12 All-American honors, and, of course, her appearance at the Rio Olympics. Today, Dom takes some time out from her training for the Tokyo Olympics to share her story and the lessons it has to offer.\n \nShe begins by sharing some details of growing up in Cape Town, her start in sports, particularly running, and the difficult decision to leave home to attend a high school with a track team. Dom also discusses the road that took her to the University of Arkansas, her career there, her year of fairy tale moments, and her Rio experience. She concludes by delving into the lessons she has learned throughout her career, how COVID has affected her and her training, what keeps her going through the hard times, and the Dom Squad. The overriding themes of following your dream and cherishing support from family, friends, and faith run through Dom’s journey, and\noffer inspiration for us all in how we can approach our own lives.</p>\n<p>Episode Highlights:\n </p>\n<ul>\n<li>Dom’s upbringing in Cape Town and her start in running</li>\n<li>Netball</li>\n<li>Living away from home to go to a high school with a track team</li>\n<li>Her Olympic dream and her parents’ support</li>\n<li>Going to the University of Arkansas</li>\n<li>Her college experience</li>\n<li>The differences between indoor/outdoor track and cross country</li>\n<li>How she improved so much over her college career</li>\n<li>Dom’s year of fairytale moments</li>\n<li>Her Rio Olympic experience and the process involved in getting there</li>\n<li>What helped Dom through her doubts and anxiety leading up to Rio</li>\n<li>What Dom has learned in terms of her identity</li>\n<li>Her current definition of success</li>\n<li>How COVID has impacted her and her preparation for Tokyo</li>\n<li>What keeps Dom going through the hard times</li>\n<li>The Dom Squad</li>\n</ul>\n<p>Quotes:\n </p>\n<ul>\n<li>“I grew up playing every sport.”</li>\n<li>“I guess as a dreamer and the determined person that I am, as a 12 year old, that just seemed like something that was worth fighting for and worth making hard decisions for.”</li>\n<li>“Selflessly…she told me to go and to follow my dreams, follow my heart, and if she hadn’t done that, I think I probably would have pulled the plug on the whole thing.”</li>\n<li>“College, you’ve got to remember, everyone is away from home.”</li>\n<li>“Very quickly, I started changing the way I was talking…and looking back at it, I’m so sad that I did that.”</li>\n<li>“Don’t change who you are to blend in and be like everybody else…you want to stand up and rise above that.”</li>\n<li>“My freshman year was a big learning curve.”</li>\n<li>“I just tried to start observing.”</li>\n<li>“Dress for the job you want, not the job you have.”</li>\n<li>“Your 10 points just secured the win for the Lady Razorbacks.”</li>\n<li>“That sermon gave me so much peace.”</li>\n<li>“You earned your spot on that start line.”</li>\n<li>“I had taken the necessary steps to make my dream a reality.”</li>\n<li>“At the time, I was embarrassed to say I’d come 21st,which is ridiculous!”</li>\n<li>“It’s not about the place, it’s about how you feel about what you did.”</li>\n<li>“Being an Olympian and having competed in the Olympics is not something that made me a better person, or, like, changed my life significantly either…it wasn’t something I wanted to be branded as.”</li>\n<li>“If you are searching for your identity in anything other than Christ…it’s never going to fulfill you, it’s never going to satisfy you, and you’re always going to be left wanting more.”</li>\n<li>“I am…more than Dom Scott, the athlete.”</li>\n<li>“I really feel like surrounding myself with people that love me and support me – that’s what helps me through those really horrible days.”</li>\n</ul>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold homepage</a>\n<a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">5 Smart Strategies to Confidence</a>\n<a href=\"https://laurawilkinson.mykajabi.com/email-capture-0d05ebf5-739d-43b0-a4ab-5f4ea91a24e6\" rel=\"nofollow\">Conquer Your Fear in 5 Days</a>\n \nLaura’s Social Media:\nInstagram: <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">  Laura's Instagram</a>\nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">  Laura's Facebook page</a>\n \nConnect with Dom:\n \n<a href=\"https://www.dominiquescott.com/\" rel=\"nofollow\">Dom's homepage</a>\n \n<a href=\"https://www.instagram.com/domscottrunsa/\" rel=\"nofollow\">Dom on Instagram</a>\n \n<a href=\"https://www.facebook.com/domscottrunSA/\" rel=\"nofollow\">Dom on Facebook</a>\n \n<a href=\"https://twitter.com/domscottrunSA\" rel=\"nofollow\">Dom on Twitter</a></p>",
  "itunes:title": "Chasing Dreams and Making History with Olympic Runner Dom Scott",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 39
}