{
  "title": "#413: My 2020 Year In Review 4/7 - Best Summer Ever",
  "itunes:title": "Year In Review: Best Summer Ever (Part 4 of 7)",
  "pubDate": "Thu, 21 Jan 2021 05:03:00 +0000",
  "guid": "666d914b-19c9-45e9-91d5-3c781ed35e60",
  "link": "https://shaffir1.libsyn.com/413-my-2020-year-in-review-47-best-summer-ever",
  "itunes:image": "",
  "description": "<div>In part 4 of My 2020 Year in Review podcast, I talk about returning to New York City. I am standup comedian Ari Shaffir. And I'm only a standup comedian while I'm doing standup comedy. Otherwise, I'm just the internet's greatest yogi. Things in New York were starting to open up again. So I made my return. And what a great decision that was. New York was ALIVE. People were drinking in the streets. All our comedian friends were hanging out. They say crime was up, and if crime includes drug use, then yeah, my crime was WAAAAY up. Molly flowed. Booze flowed. Weed flowed. The cokeheads and the potheads came to terms with each other and met in the middle at the bar. Everybody was happy. And standup was the coolest it's been in decades. Comics were responding to things. Not just doing well written jokes about nothing. Now we had BLM, Covid, the elections, Ellen, and so much more to talk about. It felt important. I loved it! We all gotta figure out a way to hold onto the good parts of this summer when next summer rolls around.</div> <div> </div> <div><strong>Please subscribe to my <a href= \"patreon.com/arishafir\">Patreon</a>. If you were a member, you could've heard this podcast over a week ago. Plus at <a href= \"patreon.com/arishaffir\" target=\"_blank\" rel= \"noopener\">patreon.com/arishaffir</a> there's exclusive merch and bonus podcasts for patreon members only.</strong></div> <div> </div> <div>Thank you to our sponsor, walktails. It's like a capri sun pouch full of booze. Imagine a pouch of margarita to go. Yeah. And they were available at just about every bar in Manhattan and Brooklyn. Walktails. I didn't invent the word, but I love the word. Eventually they made the bars serve food with them so bars would give you chips or a half a bologna sandwich or even a single tortilla. I barfed outside so many times!</div> <div> </div> <div><strong><em>The Music</em></strong></div> <div> </div> <div>Pinc Louds - Shake It</div> <div>The Pinc Louds are the spirit of creativity in New York. They are a fake band and they are at the forefront of a movement to steal the city back from the rich and make New York cool again. You should see them live. You can listen online until you get that chance, but once you get that chance, take it. Claudi is a busker. And busker's play. And the Pinc Louds play well. And they play loud. And they bring the party. Get a tall boy and come hang. Check the <a href=\"https://www.instagram.com/pinclouds/?hl=en\">Pinc Louds instagram</a> to see when they're playing next and then get on a bike and make your way over.</div> <div> </div> <div> </div>",
  "content:encoded": "In part 4 of My 2020 Year in Review podcast, I talk about returning to New York City. I am standup comedian Ari Shaffir. And I'm only a standup comedian while I'm doing standup comedy. Otherwise, I'm just the internet's greatest yogi. Things in New York were starting to open up again. So I made my return. And what a great decision that was. New York was ALIVE. People were drinking in the streets. All our comedian friends were hanging out. They say crime was up, and if crime includes drug use, then yeah, my crime was WAAAAY up. Molly flowed. Booze flowed. Weed flowed. The cokeheads and the potheads came to terms with each other and met in the middle at the bar. Everybody was happy. And standup was the coolest it's been in decades. Comics were responding to things. Not just doing well written jokes about nothing. Now we had BLM, Covid, the elections, Ellen, and so much more to talk about. It felt important. I loved it! We all gotta figure out a way to hold onto the good parts of this summer when next summer rolls around.   Please subscribe to my <a href= \"patreon.com/arishafir\">Patreon</a>. If you were a member, you could've heard this podcast over a week ago. Plus at <a href= \"patreon.com/arishaffir\" target=\"_blank\" rel= \"noopener\">patreon.com/arishaffir</a> there's exclusive merch and bonus podcasts for patreon members only.   Thank you to our sponsor, walktails. It's like a capri sun pouch full of booze. Imagine a pouch of margarita to go. Yeah. And they were available at just about every bar in Manhattan and Brooklyn. Walktails. I didn't invent the word, but I love the word. Eventually they made the bars serve food with them so bars would give you chips or a half a bologna sandwich or even a single tortilla. I barfed outside so many times!   <em>The Music</em>   Pinc Louds - Shake It The Pinc Louds are the spirit of creativity in New York. They are a fake band and they are at the forefront of a movement to steal the city back from the rich and make New York cool again. You should see them live. You can listen online until you get that chance, but once you get that chance, take it. Claudi is a busker. And busker's play. And the Pinc Louds play well. And they play loud. And they bring the party. Get a tall boy and come hang. Check the <a href=\"https://www.instagram.com/pinclouds/?hl=en\">Pinc Louds instagram</a> to see when they're playing next and then get on a bike and make your way over.    ",
  "enclosure": "",
  "itunes:duration": "52:15",
  "itunes:explicit": true,
  "itunes:keywords": "",
  "itunes:subtitle": "In part 4 of My 2020 Year in Review podcast, I talk about returning to New York City. I am standup comedian Ari Shaffir. And I'm only a standup comedian while I'm doing standup comedy. Otherwise, I'm just the internet's greatest yogi. Things in New...",
  "itunes:episode": 413,
  "itunes:episodeType": "full",
  "itunes:author": "Ari Shaffir"
}