{
  "title": "Steradian’s 4D Imaging Radar Aims to Make Self-Driving Cars Smarter",
  "link": "https://spectrum.ieee.org/steradians-4d-imaging-radar",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/hand-holding-small-computer-chip-between-the-thumb-and-forefinger.jpg?id=31300451&width=2000&height=1500&coordinates=0%2C0%2C0%2C1\"/><br/><br/><p>The founders of<a href=\"https://steradiansemi.com/\" rel=\"noopener noreferrer\" target=\"_blank\"> Steradian Semiconductors</a> saw a technology gap in the marketplace and used their know-how to fill it. Before launching the fabless semiconductor startup in 2016, the founders were working at well-known technology companies designing chipsets for mass-market radio technologies including Bluetooth, GPS, LTE cellular, and wireless LAN. They discovered that radars could be built with modern techniques, such as semiconductors and processing advances, so that they could extract shapes, sizes, and types of objects.</p><p>The sophisticated radar chips and processors working together could be used in autonomous cars to extract the same information if not more, the founders theorized.</p><hr/><p>“We did market studies and literature surveys—including IEEE publications—and found that radar has unlimited potential in the automotive industry,” says IEEE Senior Member<a href=\"https://steradiansemi.com/about/\" rel=\"noopener noreferrer\" target=\"_blank\"> Apu Sivadas</a>, the company’s CTO and a cofounder. “The radar echoes contain a wealth of hidden information, which we felt the existing technology used in autonomous vehicles could not fully harness.”</p><p>Headquartered in Bangalore, India, Steradian developed a “4D” millimeter-wave imaging radar system and the small MIMO (multiple input, multiple output) transceiver chipsets that go with it. The system is called 4D because it tracks distance, speed, elevation angles, and the azimuth, the horizontal angle or direction of a compass bearing.</p><p>At the moment, lidar has superior angular resolution, but Sivadas says he believes radar eventually can bridge the gap once modern radar chipsets and AI are combined.</p><h3>Using IEEE Xplore to its fullest</h3><br/><p>IEEE is “pretty close to my heart,” Sivadas says. “At the universities where I studied [the National Institute of Technology Calicut and the Indian Institute of Technology Kanpur], there was a history of faculty publishing in IEEE transactions or journals and referring to them to let us know what was new and trending. For example, our research topics were picked from the journals the professors wrote for.</p><p>“Even after so many years, IEEE is still very much baked into the education of Indian engineers.”</p><p>A subscription to the<a href=\"https://ieeexplore.ieee.org/Xplore/home.jsp\" target=\"_blank\"> IEEE Xplore Digital Library</a> is his most important member benefit, he says.</p><p>When he needs to solve a technical issue, he says, he searches the digital library to find relevant papers. And he has collaborated with some authors of those papers and hired graduate students who have coauthored the articles.</p><p>“Automotive sensing is fast emerging. We hope to achieve a lot more with radar, Sivadas says. “We should exploit radar to the maximum.”</p><p>The company was named <em>Steradian, </em>he says, because “it is the 3D version of radian, which is the International System of Units [measure] of angle on a plane.” Steradian is the SI unit for a solid angle and has “connotations of having very sharp antenna beams,” he says.</p><p>The startup, which has four dozen employees, submitted 26 U.S. patent applications for its technology, and it has been granted nine patents so far.</p><p>“We are an end-to-end product company,” he says. “The advanced technology that goes into radar—such as antennas, radar semiconductor chipsets, signal processors, and software—are all done under one roof. We take care of the entire product architecture.”</p><h2>4D imaging</h2><p>An imaging radar system consists of two main parts: a transceiver that sends and receives signals and an imaging/processing chip that turns the signals into images.</p><p>Steradian offers a state-of-the-art 28-nanometer CMOS chip that powers its 4D sensors. The radar chip is an integrated 16-channel MIMO that acts as a building block for high-resolution radars. In a market comparison, Sivadas says, Steradian’s transceiver had the highest output power and the lowest noise with the least amount of distortion.</p><p>The radar system, which operates in the 76- to 81-gigahertz frequency band, can be used in intelligent transportation infrastructure in addition to self-driving cars, he says.</p><p class=\"pull-quote\">“The advanced technology that goes into radar—such as antennas, radar semiconductor chipsets, signal processors, and software—are all done under one roof.”</p><p><span></span>“The unit can be installed on highways or intersections to monitor traffic,” he says, “such as counting the number of vehicles in a lane, automating traffic lights, or monitoring a vehicle’s speed.”</p><p>The automotive industry is evaluating the use of 4D radar sensors in autonomous vehicles, he says, adding that the price of mass-produced imaging units is comparable to today’s conventional radar.</p><p>Steradian’s prototypes for intelligent transportation systems are being tested by about 20 companies. Sivadas says the company has revenue coming in from the sale of its system thanks to several partnerships it recently formed. In February the startup signed an<a href=\"https://roboticsandautomationnews.com/2022/02/14/visteon-partners-with-steradian-semiconductors-to-build-enhanced-advanced-driver-assistance-systems/49231/\" target=\"_blank\"> agreement</a> to work with mobility company<a href=\"https://www.visteon.com/\" target=\"_blank\"> Visteon</a> to produce enhanced advanced driver-assistance systems. Steradian also signed a<a href=\"https://economictimes.indiatimes.com/tech/technology/steradian-semiconductors-joins-hands-with-astra-microwave-products-for-traffic-monitoring-4d-imaging-radar/articleshow/89951722.cms?utm_source=contentofinterest&utm_medium=text&utm_campaign=cppst\" target=\"_blank\"> partnership deal</a> in March with <a href=\"https://www.astramwp.com/\" target=\"_blank\">Astra Microwave Products</a> to produce radar modules for traffic management systems.</p><h2>Former Qualcomm and Texas Instruments employee</h2><p>Sivadas has 25 years of experience in engineering R&D and management working for<a href=\"http://qualcomm.com\" rel=\"noopener noreferrer\" target=\"_blank\"> Qualcomm</a> and<a href=\"http://ti.com\" rel=\"noopener noreferrer\" target=\"_blank\"> Texas Instruments</a>. He holds more than 20 patents for RF technologies and integrated circuits.</p><p>He says it was an easy transition for Steradian’s founders to go from working for large tech companies to forming their own.</p><p>“We had done many of the same functions required in a large company, such as defining products and architectures, executing them, adding features ahead of the market, and hiring people and building up their capabilities,” he says. What was new for the founders, he says, was having to set up their early office themselves.</p><p>Finding qualified engineers to hire wasn’t difficult, he says, because India has many companies involved in chip design: “The talent pipeline already existed.”</p><p>As with other startups, another challenge has been raising capital. For the first three years, the company was self-funded. Steradian now has several investors, having received funding from venture capitalists and some tech companies with an interest in automotive sensing technology.</p><p>“The biggest challenge,” he says, “was getting the first set of investors to believe in us.”</p><p>On 31 August, <a href=\"https://www.renesas.com/us/en\" target=\"_blank\">Renesas Electronics Corp.</a>, a supplier of advanced semiconductor solutions headquartered in Tokyo, <a href=\"https://www.renesas.com/us/en/about/press-room/renesas-acquire-steradian-expand-its-reach-radar-market\" target=\"_blank\">announced</a> that it had entered into an agreement to acquire Steradian Semiconductors. </p><p><em>This article has been updated from an earlier version. </em></p>",
  "pubDate": "Tue, 30 Aug 2022 18:00:01 +0000",
  "guid": "https://spectrum.ieee.org/steradians-4d-imaging-radar",
  "category": [
    "Ieee member news",
    "Self-driving cars",
    "Autonomous vehicles",
    "Intelligent transportation systems",
    "Radar",
    "Careers",
    "Computer chip",
    "Transportation",
    "Type:ti"
  ],
  "dc:creator": "Kathy Pretz",
  "media:content": ""
}