{
  "title": "EPISODE 42 Joan of Arc (Part 4)",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Thu, 13 Dec 2018 09:44:00 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2018/12/13/episode-42-joan-of-arc-part-4",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5c11815bb8a045904bc3232f",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1544651775289-QLQPZ4KASVU2R1JB7VIK/HOF-Ep42.jpg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"HOF-Ep42.jpg\" data-load=\"false\" data-image-id=\"5c1183fc0e2e72d90e4b5fc3\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1544651775289-QLQPZ4KASVU2R1JB7VIK/HOF-Ep42.jpg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“It is true that I wished and still wish to escape, as is lawful for any captive or prisoner.”</em> — Joan of Arc&nbsp;</p><p class=\"\"><em>“I have greater fear of failing my voices in saying something that displeases them than I have of answering you.”</em> — Joan of Arc addressing a group of theologians in charge of deciding whether to burn her alive&nbsp;</p><p class=\"\"><em>“Tear me limb from limb. I would rather have you cut my throat than tell you all I know.”</em> — Joan of Arc&nbsp;</p><p class=\"\"><em>“I am the vine; you are the branches. Whoever abides in me and I in them, will produce much fruit. For apart from me you can do nothing. If anyone does not abide in me he is thrown away like a branch and withers; and the branches are gathered, thrown into the fire, and burned.” —</em> Jesus quoted in John 15:5-6</p><p class=\"\"><em>“There had been unjust ecclesiastical trials before, but Joan’s was one of the most unjust trial ever undertaken in any ecclesiastical court.” —</em> Timothy Wilson-Smith</p><p class=\"\">By 1429, the heir to the French throne was about to give up and flee in exile. The English and their Burgundian allies controlled huge parts of the country. With Orleans likely to fall in a not too distant future, the path was open for the English to conquer the rest of France. It looked like the game was up for him. As much as he tried, he couldn’t see any logical path to victory. But little did he know that help was on its way—a kind of help that didn’t seem to be logical, reasonable or likely. Help was coming in the form of an illiterate teenage peasant—a female at that—who was going to change his fortunes; a young woman who through sheer willpower would radically change the course of the war. She arrived at the royal court during France’s darkest hour with news that God had sent her to lift the siege of Orleans, and make sure the heir to the throne would be crowned King of France.</p><p class=\"\">The young woman was Joan of Arc, and she was one of the most unusual individuals in history.&nbsp;</p><p class=\"\">At 13 years old, her life was turned upside down when she began hearing voices and having visions of angelic figures delivering her messages. The voices told her that no one on earth—neither knight nor king—could restore the kingdom of France. No one could—no one that is… except for her.&nbsp;</p><p class=\"\">Ok, so we have a possibly insane girl hearing voices, This is hardly the stuff that makes the history books. At best, this would be an interesting case study for the history of mental illness. But that’s not what happened here—because the girl and her voices did change the course of the Hundred Years War between France and England. The voices propelled this young woman away from the typical existence of farm girls in the 1400s, and transformed her into a force of nature who embraced a heroic and tragic destiny that was entirely beyond what anyone from her gender, social class, and age could legitimately expect.&nbsp;</p><p class=\"\">According to logic and common sense, none of the things that happened in our story should have been able to happen. A untrained peasant leading an army of knights? A young woman succeeding where the entire French nobility had failed? What she accomplished would have been exceptional if done by an aristocratic, seasoned male leader. But it seems downright impossible for someone like her. The world she lived in was hyper patriarchal and very class conscious, so on the surface there should have been no chance whatsoever that a young peasant girl could pull it off. She belonged to the wrong gender, wrong social class, and wrong age to achieve what she dreamed of. And yet she did.&nbsp;</p><p class=\"\">In this final episode of this four-part series, Joan challenges the law of gravity and loses, King Charles’ betrayal, Bishop Pierre Cauchon lacking the guts to be a proper savage, 70 clerics vs. a teenage girl, Cauchon doing his best Darth Vader impersonation, institutions vs. mystics, food poisoning & a trip to the torture chambers, forcing a confession, entrapment, burning at the stake, impersonators, the retrial, the end of the Hundred Years’ War, surviving an assassination attempt thanks to layers of fat, Joan becoming a saint, and the mystery of Joan of Arc’s visions.&nbsp;</p><p class=\"\">This episode is sponsored by Audible. Right now for a limited time, you can get 3 months of Audible for just $ 6.95 a month. That’s more than half off the regular price. Go to <a href=\"http://www.audible.com/HOF\">www.audible.com/HOF</a> or text HOF to 500 500 to get started.</p><p class=\"\">This episode of History on Fire is brought to you by ForHims.com—a one-stop shop for hair loss, skincare, and sexual wellness for men. Try hims for a month today for just $5 while supplies last. See website for full details. Go to <a href=\"https://www.forhims.com/history5\">https://www.forhims.com/history5</a>&nbsp;</p><p class=\"\">This episode is sponsored by <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a> For less than $ 10 per meal, Blue Apron delivers straight to your door seasonal recipes along with pre-portioned ingredients to make delicious, home-cooked meals. Get $ 30 off your first order—with free shipping—by going to <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a>&nbsp;</p><p class=\"\">Check out <a href=\"https://www.letterjoy.co/\">https://www.letterjoy.co/</a> Give or receive weekly historic letters on fine cotton or parchment paper from figures like Thomas Jefferson, Florence Nightingale, and George S. Patton. Use code “onfire” to get a $5 credit towards your first gift or membership.</p><p class=\"\">This episode is brought to you by <a href=\"https://actionheat.com/history\">https://actionheat.com/history</a> for a 15% discount on the world’s best heated-clothing including Heated Jackets, Socks, Gloves, Hats.</p><p class=\"\">Please, also show some love to my regular sponsors by shopping for supplements, special foods, clothing, and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;</p><p class=\"\">And if you are in the market for backpacks, computer bags and other hemp gear, check out my favorites at <a href=\"http://www.dsgear.com\">http://www.dsgear.com</a>&nbsp;</p><p class=\"\">And thank you also to <a href=\"https://www.snowroast.com/\">https://www.snowroast.com/</a> for their delicious coffee. Use the code TAO18 for a 15 % discount.&nbsp;</p><p class=\"\">History on Fire is brought to you by Kannaway. All CBD products are from organic, non-GMO European HEMP grown on generational family farms. The products all have a triple authenticated process guaranteeing you’re getting exactly what you are paying for. Because all of the CBD is from hemp and NOT cannabis, it is legal to use and possess in all 50 states AND Europe! Now you can get 100% THC-free CBD oil from hemp, delivered to your door in all 50 of the Unites States and the whole of Europe. Please check them out at: <a href=\"https://kannaway.com/2496006\">https://kannaway.com/2496006</a>&nbsp;</p><p class=\"\">A huge thank you to <a href=\"https://www.dynastyforge.com/\">https://www.dynastyforge.com/</a> for sharing with me their amazing swords.&nbsp;</p><p class=\"\">If you train in Jiujitsu (or any other sport for that matter), check out the knee braces at <a href=\"https://nevertapgear.com/\">https://nevertapgear.com/</a> and check out the TOMOE GOZEN RASH GUARD! <a href=\"https://nevertapgear.com/new-products/tomeo\">https://nevertapgear.com/new-products/tomeo</a>&nbsp;</p><p class=\"\"><br>PATREON NEWS: I have just started a Patreon account!!!! If you feel in a generous mood, please, check it out at <a href=\"http://www.patreon.com/historyonfire\">www.patreon.com/historyonfire</a>&nbsp;</p><p class=\"\">And Donations in crypto-currencies can be made to:&nbsp;</p><p class=\"\">Btc: 1Fdzfr1aPMFdwBY5GXe71nLo11HSMxEfRw<br>Eth: 0x0deedc896c8e23c3a9daf39e4a9fadada656e924&nbsp;<br>Ltc: LMW7m54iovT1GK6yZxYXUVPT52pXD9CmjN&nbsp;<br>Zec: t1NgHHkaEqFM9XzdAZf5u16MRmmz6ruHyTD<br>Slt: 0x0deedc896c8e23c3a9daf39e4a9fadada656e924</p><p class=\"\"><br>My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>. Thank you to Onnit, Datsusara, Float Clinic, Shaman’s Simple Solutions, War Fuel, Proven Nutrition, and Fight Chix for sponsoring her for her first MMA fight. If you’d like to check out Fight Chix merchandise, you can get a 20% discount by going to <a href=\"http://www.fightchix.com/\">http://www.fightchix.com/</a> and entering the code Fire20 upon checkout.</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\"><br>For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "2:02:34",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 42,
  "itunes:title": "EPISODE 42 Joan of Arc (Part 4)",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 42 Joan of Arc (Part 4)"
  }
}