{
  "title": "Optimizing for periodicity: a model-independent approach to flux crosstalk calibration for superconducting circuits. (arXiv:2211.01497v1 [quant-ph])",
  "link": "http://arxiv.org/abs/2211.01497",
  "description": "<p>Flux tunability is an important engineering resource for superconducting\ncircuits. Large-scale quantum computers based on flux-tunable superconducting\ncircuits face the problem of flux crosstalk, which needs to be accurately\ncalibrated to realize high-fidelity quantum operations. Typical calibration\nmethods either assume that circuit elements can be effectively decoupled and\nsimple models can be applied, or require a large amount of data. Such methods\nbecome ineffective as the system size increases and circuit interactions become\nstronger. Here we propose a new method for calibrating flux crosstalk, which is\nindependent of the underlying circuit model. Using the fundamental property\nthat superconducting circuits respond periodically to external fluxes,\ncrosstalk calibration of N flux channels can be treated as N independent\noptimization problems, with the objective functions being the periodicity of a\nmeasured signal depending on the compensation parameters. We demonstrate this\nmethod on a small-scale quantum annealing circuit based on superconducting flux\nqubits, achieving comparable accuracy with previous methods. We also show that\nthe objective function usually has a nearly convex landscape, allowing\nefficient optimization.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/quant-ph/1/au:+Dai_X/0/1/0/all/0/1\">X. Dai</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Trappen_R/0/1/0/all/0/1\">R. Trappen</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Yang_R/0/1/0/all/0/1\">R. Yang</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Disseler_S/0/1/0/all/0/1\">S. M. Disseler</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Basham_J/0/1/0/all/0/1\">J. I. Basham</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Gibson_J/0/1/0/all/0/1\">J. Gibson</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Melville_A/0/1/0/all/0/1\">A. J. Melville</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Niedzielski_B/0/1/0/all/0/1\">B. M. Niedzielski</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Das_R/0/1/0/all/0/1\">R. Das</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Kim_D/0/1/0/all/0/1\">D. K. Kim</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Yoder_J/0/1/0/all/0/1\">J. L. Yoder</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Weber_S/0/1/0/all/0/1\">S. J. Weber</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Hirjibehedin_C/0/1/0/all/0/1\">C. F. Hirjibehedin</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Lidar_D/0/1/0/all/0/1\">D. A. Lidar</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Lupascu_A/0/1/0/all/0/1\">A. Lupascu</a>"
}