{
  "title": "Revamping an Art Deco Masterpiece",
  "link": "https://spectrum.ieee.org/restore-power",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/image.jpg?id=31198373&width=980\"/><br/><br/><p>The Big Picture features technology through the lens of photographers.</p><p>Every month, <em>IEEE Spectrum</em> selects the most stunning technology images recently captured by photographers around the world. We choose images that reflect an important advance, or a trend, or that are just mesmerizing to look at. We feature all images on our site, and one also appears on our monthly print edition.</p><p>Enjoy the latest images, and if you have suggestions, leave a comment below.</p><h3>Power Station Restoration</h3><br/><img alt=\"Image of a newly restored control room in a power station in London.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"32c442f3e1cdfe199aeec07099b1d72a\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"9fef1\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/image-of-a-newly-restored-control-room-in-a-power-station-in-london.jpg?id=31147265&width=980\"/><p>\n\tThis beautifully outfitted room is the newly restored Control Room A at the Battersea Power Station in London. For half a century, the electric power hub controlled the flow of current that met one-fifth of London’s electricity demand. The hub was decommissioned in 1983. Now it has been returned to its original 1930s Art Deco glory. The painstaking restoration, complete with period details—including the gauges engineers relied on when the station was fully functional and a glass elevator that will give visitors a panoramic view of the London skyline–took decades to complete.\n</p><p class=\"caption\">\n\tJames Parsons\n</p><h3></h3><br/><img alt=\"Photo zooming in on the eye of a person wearing an electronic contact lens\" class=\"rm-shortcode\" data-rm-shortcode-id=\"3baa7fca72642d0103b759fa82669522\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"1a661\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/photo-zooming-in-on-the-eye-of-a-person-wearing-an-electronic-contact-lens.jpg?id=30978650&width=980\"/><h3>\n<a href=\"https://spectrum.ieee.org/looking-through-mojo-visions-newest-ar-contact-lens\" target=\"_blank\">Augmented-Reality Contacts</a>\n</h3><p>\n\tIn March 2022, IEEE Spectrum Senior Editor Tekla S. Perry took a glimpse at the world through the latest iteration of Mojo Vision’s AR contact lens. She didn’t put the lens in her eye because the company had not yet completed the prototype’s safety testing. Still, she saw enough to confirm that Mojo Vision’s engineers had pulled off a few exciting advances. Among them were a 14,000-pixel-per-inch monochrome microLED display, eye tracking using an accelerometer, a gyroscope, and a magnetometer, and onboard power using medical-grade microbatteries. By June, the team was confident that it had hurdled any remaining safety concerns—so much so that Mojo Vision CEO Drew Perkins [shown here] put a pair of Mojo’s high-tech lenses to the test in his own eyes.\n</p><p class=\"caption\">\n\tMOJO VISION\n</p><h3></h3><br/><img alt=\"Image of a cochlear implant that uses pulses of electricity to hear\" class=\"rm-shortcode\" data-rm-shortcode-id=\"a12a646e82fd7b7481a3edc1eacd50e7\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"31736\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/image-of-a-cochlear-implant-that-uses-pulses-of-electricity-to-hear.jpg?id=30978772&width=980\"/><h3>\n<a href=\"https://spectrum.ieee.org/cochlear-implant\" target=\"_blank\">Hearing With Light</a>\n</h3><p>\n\tThe cochlear implant is an impressive feat of engineering. Figuring out how to use pulses of electric current to stimulate the cochlear nerve that feeds auditory information to the brain was a big achievement. But according to users, the implants still leave quite a bit to be desired. That’s why a group of researchers from institutions across Europe have been trying to give the implants a whole new ring. Instead of manipulating electrons to stimulate the cochlear nerve, they’ve invented a new version that does it with photons. The beams of light can be controlled with a level of specificity that helps solve cochlear implant wearers’ major complaints, including voices that sound flat and robotic, stripped of the subtle inflections that help communicate things like sarcasm. The implant captures some of the dynamics of music that had been lost in transmission. And it promises to solve the cocktail-party problem—where  background noise, including other conversations, overwhelms the signal representing a speaker’s voice.\n</p><p class=\"caption\">\n\tLakshay Khurana and Daniel Keppeler \n</p><h3></h3><br/><img alt=\"Image of a battery and wires connected to the battery in the snow\" class=\"rm-shortcode\" data-rm-shortcode-id=\"dddcc0e1df4a7401788ab8cabeac6d5b\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"01880\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/image-of-a-battery-and-wires-connected-to-the-battery-in-the-snow.jpg?id=30979058&width=980\"/><h3>\n<a href=\"https://spectrum.ieee.org/too-hot-too-cold-not-for-these-lithium-batteries\" target=\"_blank\">Weather-beating Battery</a>\n</h3><p>\n\tEven before the introduction of the General Motors EV1 in 1996, it was clear that if we’re ever going to replace cars powered by fossil fuels with electric vehicles, we’ll need batteries that take and deliver charge reliably in both hot and cold climates. For EV propulsion, we’ve come a long way since the lead-acid chemistry still used to power electric starters and cabin electronics. Now a team of researchers at the University of California, San Diego, says it has hit upon a new electrolyte chemistry for lithium batteries that doesn’t freeze at temperatures down to  –100 °C. And because the dibutyl ether solvent in the new electrolyte binds weakly with the lithium ions in solution, those ions are free to move easily and create a strong current, even on the most frigid of winter mornings. What’s more, the dibutyl ether resists evaporation and side reactions that would irreversibly decompose the electrolyte when the battery is exposed to high temperatures on hot summer days.\n</p><p class=\"caption\">\n\tDavid Baillot/UC San Diego Jacobs School of Engineering \n</p>",
  "pubDate": "Wed, 24 Aug 2022 15:00:00 +0000",
  "guid": "https://spectrum.ieee.org/restore-power",
  "category": [
    "Ar contact lens",
    "Art deco",
    "Battersea power station",
    "Big picture",
    "Cochlear implant",
    "Cocktail party problem",
    "Control room a",
    "Electric vehicles",
    "Lithium battery",
    "Mojo vision"
  ],
  "dc:creator": "Willie Jones",
  "media:content": ""
}