{
  "title": "[NEW COURSE] Data Science: Bayesian Linear Regression in Python",
  "link": "https://lazyprogrammer.me/new-course-data-science-bayesian-linear-regression-in-python/",
  "comments": "https://lazyprogrammer.me/new-course-data-science-bayesian-linear-regression-in-python/#respond",
  "dc:creator": "admin",
  "pubDate": "Wed, 03 Aug 2022 07:14:40 +0000",
  "category": [
    "data science",
    "machine learning"
  ],
  "guid": "https://lazyprogrammer.me/?p=2688",
  "description": "<p>Hello friends! I am SUPER excited to announce my latest course &#8211; Data Science: Bayesian Linear Regression in Python. Don&#8217;t want to read the spiel? Just click here to get the course: https://deeplearningcourses.com/c/bayesian-linear-regression-in-python I first started the Bayesian Machine Learning course series over 5 years ago, with A/B Testing in Python. I always had big [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://lazyprogrammer.me/new-course-data-science-bayesian-linear-regression-in-python/\">[NEW COURSE] Data Science: Bayesian Linear Regression in Python</a> appeared first on <a rel=\"nofollow\" href=\"https://lazyprogrammer.me\">Lazy Programmer</a>.</p>\n",
  "content:encoded": "<p><a href=\"https://deeplearningcourses.com/c/bayesian-linear-regression-in-python\"><img loading=\"lazy\" class=\"aligncenter size-medium\" src=\"https://i.imgur.com/X385fwo.png\" width=\"300\" height=\"171\" /></a></p>\n<p>Hello friends!</p>\n<p>I am SUPER excited to announce my latest course &#8211; Data Science: Bayesian Linear Regression in Python.</p>\n<p>Don&#8217;t want to read the spiel? Just click here to get the course:</p>\n<p><a href=\"https://deeplearningcourses.com/c/bayesian-linear-regression-in-python\">https://deeplearningcourses.com/c/bayesian-linear-regression-in-python</a></p>\n<p>I first started the Bayesian Machine Learning course series over 5 years ago, with A/B Testing in Python. I always had big plans for it, but kept getting pulled in different directions. With this course, the series is finally back on track.</p>\n<p>What&#8217;s covered in this course?</p>\n<p>Exactly as the title says: &#8220;Bayesian Linear Regression in Python&#8221;. It&#8217;s a simple, clear-cut course. We go through how the model works (what you might call the &#8220;theory&#8221;) and then we implement it in Python with a scikit-learn style interface (i.e. a fit function and a predict function). We then apply the model to real-world datasets.</p>\n<p>In the first A/B Testing course, a lot of students asked, &#8220;but where is the &#8216;machine learning&#8217;?&#8221;, since they thought of machine learning from the typical supervised/unsupervised parametric model paradigm. The A/B Testing course was never meant to look at such models, but that is exactly what this current course is for.</p>\n<p>If you&#8217;ve studied machine learning before, then you know that linear regression is the first model everyone learns about. We will approach Bayesian Machine Learning the same way. Bayesian Linear Regression has many nice properties (easy transition from non-Bayesian Linear Regression, closed-form solutions, etc.). It is the best and most efficient &#8220;first step&#8221; into the world of Bayesian Machine Learning.</p>\n<p>It should be stated however: Bayesian Machine Learning really is very mathematical. If you&#8217;re looking for a scikit-learn-like experience, Bayesian Machine Learning is definitely too high-level for you. Most of the &#8220;work&#8221; involves algebraic manipulation. At the same time, if you can tough it out to the end, you will find the results really satisfying, and you will be awed by its elegance.</p>\n<p>Sidenote: If you made it through my Linear Regression and A/B Testing courses, then you&#8217;ll do just fine.</p>\n<p>Some additional notes:</p>\n<ul>\n<li>This course will be a deeplearningcourses.com exclusive. It is simply TOO HOT <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f525.png\" alt=\"🔥\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /> for Udemy. Seriously though, I don&#8217;t think the average Udemy student could handle it.</li>\n<li>LOW PRICE <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f4b0.png\" alt=\"💰\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" />. I&#8217;ve spent the last few years putting out gargantuan mega-courses. Unfortunately, this comes at the cost of a slower release cycle, which, upon reflection, is kind of boring. It means I have to spend months on the same topic, and as the student, you do too, if you want to make it through the whole course and get your money&#8217;s worth. There are pros and cons to both. What do you prefer? Email me and let me know!</li>\n<li>After proof-watching the course, I felt that the math went by pretty fast. I was thinking of adding more lectures, where I&#8217;d go through the derivations by hand (writing on a tablet) in a live, un-edited setting, like a real lecture. This would give you, as the student, more time to think and engage, as well as to write things down yourself. Is that something you&#8217;d be interested in seeing? Let me know via email!</li>\n</ul>\n<p>Alrighty, that&#8217;s all I&#8217;ve got for you today. What are you waiting for? Get the course!</p>\n<p><a href=\"https://deeplearningcourses.com/c/bayesian-linear-regression-in-python\"><img class=\"alignnone size-medium\" src=\"https://i.imgur.com/G32vT35.png\" width=\"100%\" /></a></p>\n\n<div class=\"twitter-share\"><a href=\"https://twitter.com/intent/tweet?url=https%3A%2F%2Flazyprogrammer.me%2Fnew-course-data-science-bayesian-linear-regression-in-python%2F&#038;via=lazy_scientist\" class=\"twitter-share-button\" data-size=\"large\">Tweet</a></div>\n<p>The post <a rel=\"nofollow\" href=\"https://lazyprogrammer.me/new-course-data-science-bayesian-linear-regression-in-python/\">[NEW COURSE] Data Science: Bayesian Linear Regression in Python</a> appeared first on <a rel=\"nofollow\" href=\"https://lazyprogrammer.me\">Lazy Programmer</a>.</p>\n",
  "wfw:commentRss": "https://lazyprogrammer.me/new-course-data-science-bayesian-linear-regression-in-python/feed/",
  "slash:comments": 0
}