{
  "title": "42: Author: The JT LeRoy Story",
  "link": "https://audioboom.com/posts/6845689",
  "itunes:episode": 42,
  "itunes:title": "Author: The JT LeRoy Story",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3540,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In 2000, the novel “Sarah” was published. It was written by a homeless teenaged hustler named JT LeRoy. Nobody had ever met him—his only correspondence with press and publishers was over the phone or fax machine—and still he became the literary sensation of the time. He was dubbed a ‘wunderkind,’ an ‘it boy’ and ‘the literary voice of his generation.’ He became a best-selling author and sold the film rights to his books. The only thing was, he didn’t actually exist. On January 9, 2006 The New York Times sent shockwaves through the literary world when it unmasked JT LeRoy, whose tough prose about a sordid childhood had captivated icons and luminaries internationally. It turned out that he was the creative expression of 40-year-old San Francisco former phone-sex operator turned housewife, Laura Albert. Author: The JT LeRoy Story takes us down the infinitely fascinating rabbit hole of how Laura Albert--like a Cyrano de Bergerac on steroids--breathed not only words, but life, into her avatar for a decade. Albert's epic and entertaining account plunges us into a glittery world of rock shows, fashion events, and the Cannes red carpet where LeRoy becomes a mysterious sensation.<br>\n<br>\n\n</div>\n<div>Also, our best friend Courtney Love (call us, girl!) Is back in a big, cocaine-infused way. Oh, how we’ve missed her.<br>\n<br>\n\n</div>\n<div>You Guys! We're creating WEEKLY FULL BONUS EPISODES <a href=\"https://www.patreon.com/TrueCrimeObsessed\">via our Patreon feed.</a> We're currently covering \"Serial\" season 1 episode-by-episode. <a href=\"https://www.patreon.com/TrueCrimeObsessed\">The firs 4 episode of \"Serial\" plus 2 full bonus episodes (covering \"The Queen of Versailles\" and \"Madonna: Truth or Dare\") are now available.<br>\n</a><br>\n\n</div>\n<div>NEXT WEEK'S EPISODE:<br>\n The Seven Five. <a href=\"https://www.youtube.com/watch?v=LBB7DolmQPY\">Check out the Trailer here!</a>\n</div>\n",
  "pubDate": "Tue, 08 May 2018 04:01:00 +0000",
  "guid": "tag:audioboom.com,2018-05-08:/posts/6845689",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}