{
  "title": "IEEE STEM Activity Kits Are In Demand at 150 U.S. Public Libraries",
  "link": "https://spectrum.ieee.org/ieee-stem-activity-kits",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/two-boys-and-one-girl-standing-in-front-of-a-computer-monitor-on-the-left-side-of-the-monitor-is-a-backpack-containing-a-scienc.jpg?id=30049260&width=1200&height=800&coordinates=0%2C0%2C0%2C246\"/><br/><br/><p>More than 150 public libraries throughout the central United States now lend out activity kits that let children explore just about any aspect of science, technology, engineering, and mathematics. The kids can check them out just like they would a book. The kits teach youngsters what engineers do, as well as how to code, build robots, design video games, and create animations. </p><p>The collections have been made possible by the<a href=\"https://r4.ieee.org/skpl/\" rel=\"noopener noreferrer\" target=\"_blank\"> IEEE Region 4 Science Kits for Public Libraries</a> program with funding from Region 4 members and corporate sponsors. The SKPL program is the brainchild of IEEE Life Senior Member <a href=\"https://www.linkedin.com/in/john-zulaski-b4445243/\" target=\"_blank\">John A. Zulaski</a>, the chair of the SKPL committee.</p><p>Activity kits aren’t new to libraries, but STEM kits didn’t exist 10 years ago. Nowadays large, well-funded libraries might have them, but that’s not the case for many small and midsize ones, Zulaski says.</p><p>He says he is on a mission to encourage other IEEE entities to make the kits available at local libraries. Only public libraries in IEEE Region 4 currently are eligible for an SKPL grant. </p><p>“This is the perfect project for IEEE life members or young professionals to undertake,” Zulaski says. “The kits get kids interested in pursuing a technical career—which, by the way, helps increase IEEE membership down the road.”</p><p>Currently all 80 branches of the<a href=\"https://chipublib.bibliocommons.com/v2/search?query=science%20kits&searchType=smart&_ga=2.48539494.1160701079.1654617414-274951698.1654617414\" rel=\"noopener noreferrer\" target=\"_blank\"> Chicago Public Library</a> have the kits, as do libraries in Illinois, Indiana, Iowa, Minnesota, Michigan, Nebraska, North Dakota, Ohio, and Wisconsin.</p><p><strong>STEM in Libraries </strong></p><p>After Zulaski retired as director of electronic products at<a href=\"https://www.sandc.com/en/\" rel=\"noopener noreferrer\" target=\"_blank\"> S&C Electric</a>, in Chicago, he became a trustee for his <a href=\"https://mtpros.ent.sirsi.net/client/en_US/default/search/results/?qu=science+kits\" rel=\"noopener noreferrer\" target=\"_blank\">local library, in Mount Prospect, Ill</a>. During his visits there, he noticed cloth bags filled with puzzles and other activities, but none were specific to STEM. He recalled the wonderful experiences he had as a child playing with Erector sets, Lincoln Logs, and other activity kits, and he realized many children today are not so fortunate. In 2009 he talked to the library’s executive director, <a href=\"https://www.linkedin.com/in/marilyn-genther-108566a/\" rel=\"noopener noreferrer\" target=\"_blank\">Marilyn Genther</a>, about creating science kits that could be circulated. She was interested but said she didn’t have the US $2,000 in her budget she estimated it would take to create such a collection.</p><p>Zulaski ran the idea past the <a href=\"https://ieeechicago.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Chicago Section</a>, which agreed to provide funding. Assembled by youth librarians and IEEE volunteers, 12 kits were created for children in Grades 1 through 5. They included hands-on off-the-shelf STEM projects, instructions written by the librarians, and a recommended list of books, DVDs, videos, and other reference material from the library, Genther says. All the items were stowed in backpacks.</p><p>Genther says having libraries offer the kits makes a lot of sense. There is no curriculum for students to follow, so they can learn at their own pace and pick topics they find interesting. </p><p>“The kits get into the hands of children who may not have an opportunity to learn about STEM otherwise,” she says. Genther has since retired and is now a member of the IEEE SKPL committee.</p><p>Zulaski says the prototype kits were flying off the shelves—which persuaded the IEEE Chicago Section to launch the SKPL project in 2010. Through the generosity of the section’s members and a few corporate donors, more than 25 libraries in the Chicago area began circulating the science kits.</p><p>The kits get into the hands of children who may not have an opportunity to learn about STEM otherwise.</p><p><span></span>Kids aren’t the only ones checking out the collections. Teachers, Boy Scout leaders, parents who homeschool their children, and libraries that have in-house STEM programs do as well.</p><p>The kits are tailored to the needs of the local children, Zulaski says.</p><p>“We decided early on that we did not want to dictate to the libraries what should be in their kits,” he says. “They are in a better position to make that determination because they can look at their records on STEM-related books that have been checked out and see what subjects seem to be most popular.”</p><p><strong>Generous Donors </strong></p><p>In 2011 the project received funding from the IEEE Foundation and the IEEE<a href=\"https://mga.ieee.org/board-committees/committees/216-ieee-life-members-committee\" target=\"_blank\"> Life Members Committee</a> to enable 26 libraries in the Midwest to build science kit collections.</p><p>The SKPL committee set up a <a href=\"https://r4.ieee.org/skpl/apply-for-a-grant/\" target=\"_blank\">formal application process</a> for granting money to libraries. The number of libraries applying for SKPL grants has grown. This year the committee has received 79 applications, up from 40 last year. It awarded 15 grants of up to $2,000.</p><p>In a testimonial about the SKPL grant received by the <a href=\"https://bataviapubliclibrary.org/discovery-kits-youth/\" rel=\"noopener noreferrer\" target=\"_blank\">Batavia Public Library</a>, in Illinois, its youth services librarian, Amanda Vanderwerf, said, “The deeper understanding that comes from sustained engagement with these kits is something we are proud to offer to our patrons, and we thank you for this opportunity. The Batavia community, the library staff, and especially the youth services department thanks IEEE for allowing us to be part of this fantastic opportunity to create circulating science kits.”</p><p>S&C Electric made a substantial donation to provide SKPL collections to the entire Chicago Public Library system. The company also makes an annual donation to maintain the existing kits and add new ones to the collection. Other corporate donors include <a href=\"https://www.atcllc.com/\" rel=\"noopener noreferrer\" target=\"_blank\">American Transmission</a>, <a href=\"https://www.eaton.com/us/en-us.html\" rel=\"noopener noreferrer\" target=\"_blank\">Eaton</a>, <a href=\"https://www.elite-electronics.com.au/\" rel=\"noopener noreferrer\" target=\"_blank\">Elite Electronics</a>,<a href=\"https://www.emerson.com/en-us\" rel=\"noopener noreferrer\" target=\"_blank\"> Emerson Electric</a>, and <a href=\"https://www.milwaukeetool.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Milwaukee Tool</a>. <a href=\"https://ieeeusa.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE-USA</a>, the <a href=\"https://www.ewh.ieee.org/reg/4/pace.php\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Professional Activities Committee</a>, and the <a href=\"https://www.emcs.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Electromagnetic Compatibility Society</a>’s Chicago chapter also have donated money. </p><p>With cash Zulaski received in 2015 from the <a href=\"https://spectrum.ieee.org/ieee-new-initiatives-program-is-looking-to-bring-your-bright-ideas-into-the-light\" target=\"_self\">IEEE New Initiatives Committee </a>, the SKPL committee created a marketing campaign to promote the project, developed fundraising initiatives, and built its <a href=\"https://r4.ieee.org/skpl/\" rel=\"noopener noreferrer\" target=\"_blank\">website</a>. </p><p>The 2023 submission period for SKPL <a href=\"https://r4.ieee.org/skpl/apply-for-a-grant/#1586393847832-70d8c1af-b04d\" rel=\"noopener noreferrer\" target=\"_blank\">grant</a> applications period begins 1 November 2022 and closes 15 January.</p><p>Zulaski says Region 4 members are making their libraries aware of the opportunity. He says he hopes that by this time next year, other IEEE groups will be offering grants. To help make that happen, funding is being sought to create a toolkit to train other IEEE entities how to implement their own SKPL program. </p><p>“Hopefully this can be accomplished by the end of this year, assuming major donors step forward,” Zulaski says. “There are around 10,000 public libraries in the United States alone and hundreds of thousands around the world. Much remains to be accomplished.”</p><p>If your IEEE entity is interested in offering the SKPL program, complete <a href=\"https://r4.ieee.org/skpl/contact-us/\" rel=\"noopener noreferrer\" target=\"_blank\">this form</a>.</p><p><a href=\"https://give.ieeefoundation.org/give/246578/#!/donation/checkout\" rel=\"noopener noreferrer\" target=\"_blank\">Donations</a> to the program are welcome.</p>",
  "pubDate": "Thu, 30 Jun 2022 18:00:01 +0000",
  "guid": "https://spectrum.ieee.org/ieee-stem-activity-kits",
  "category": [
    "Stem",
    "Education",
    "Ieee products services",
    "Students",
    "Ieee region 4",
    "Ieee chicago section",
    "Ieee science kits for local libraries",
    "Type:ti"
  ],
  "dc:creator": "Kathy Pretz",
  "media:content": ""
}