{
  "title": "Make Leader Character Your Competitive Edge",
  "link": "https://sloanreview.mit.edu/article/make-leader-character-your-competitive-edge/",
  "comments": "https://sloanreview.mit.edu/article/make-leader-character-your-competitive-edge/#comments",
  "pubDate": "Wed, 19 Oct 2022 11:00:49 +0000",
  "dc:creator": "Mary Crossan, William (Bill) Furlong, and Robert D. Austin. <p>Mary Crossan is professor of strategic leadership at Ivey Business School. William (Bill) Furlong is executive in residence at Ivey Business School. Robert D. Austin is professor of information systems at Ivey Business School.</p>\n",
  "category": [
    "Ethics",
    "Human Behavior",
    "Leadership Development",
    "Culture",
    "Leadership",
    "Leadership Skills",
    "Skills & Learning",
    "Workplace, Teams, & Culture"
  ],
  "description": "Gary Waters/theispot.com For all of the attention that leader character gets when we witness its negative extremes — such as when an authoritarian CEO presides over a corrupt or an abusive culture — most organizations give surprisingly little thought to what is actually one of the most significant available levers to effect positive organizational development. [&#8230;]",
  "content:encoded": "<p></p>\n<figure class=\"article-inline\">\n<img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/10/WINTER23-Crossan-1290x860-1.jpg\" alt=\"\" /><figcaption>\n<p class=\"attribution\">Gary Waters/theispot.com</p>\n</figcaption></figure>\n<p>For all of the attention that leader character gets when we witness its negative extremes — such as when an authoritarian CEO presides over a corrupt or an abusive culture — most organizations give surprisingly little thought to what is actually one of the most significant available levers to effect positive organizational development.</p>\n<p>Organizations that fail to hire for and develop positive character among its leaders are missing an opportunity. In fact, one study found that organizations with leaders of high character — those whose employees rated them highly on integrity, responsibility, forgiveness, and compassion — had nearly five times the return on assets of those with low character.<a id=\"reflink1\" class=\"reflink\" href=\"#ref1\">1</a></p>\n<p>Why is this aspect of leadership and organizational culture so overlooked? Over more than a decade of investigating leader character in organizations, we’ve found that leaders largely underestimate and misunderstand the concept of character. They marginalize it as just being about ethics rather than recognizing it as the foundation of all judgment and decision-making. They generally assess their own character as “good enough.” They believe it is a fixed trait rather than a quality that can be developed, and so they don’t see how individual strength of character can be embedded and scaled in their own organizations and cultures. Simply put, they don’t see that competence and character go hand in hand.</p>\n<p></p>\n<p>Our research into leader character began as an investigation into the failures of leadership associated with the 2008 global economic crisis.<a id=\"reflink2\" class=\"reflink\" href=\"#ref2\">2</a> We conducted focus groups with over 300 business leaders in Canada, the U.S., England, and Hong Kong. The groups reached consensus that the character of leaders contributed substantially to creating the crisis. Unfortunately, there was no consensus about how to define character, and there was extensive debate about whether it could even be developed. We set out to address the underlying science of leader character: what it is (and is not), why it matters, how it can be developed, and how it is manifested in people’s actions.</p>\n<p></p>\n<p>As we unpack what character is and how it operates, the critical underpinning is its impact on judgment and the choices we make minute by minute, day in and day out — what we call the micro-moments between stimulus and response. It is this character-based judgment that supports superior performance, and its lack explains both misconduct and poor decision-making. In numerous high-profile cases — whether the global financial crisis, the Volkswagen emissions scandal, or the Boeing 737 Max tragedies — technical competence was largely evident, but character was not. Essentially, the slippery slope of compromised judgment and decision-making can be identified in the seeds of compromised character.</p>\n<p>It’s important to note that while strength of character certainly supports ethical decision-making, its reach is much broader; as noted above, too many leaders equate it simply with being “good,” which is much too narrow. It is also a powerful influence on individual well-being and sustained excellence, and so it matters at all levels of the organization, not just in leadership.<a id=\"reflink3\" class=\"reflink\" href=\"#ref3\">3</a> To illustrate, consider the perspective of Ron Francis, general manager of professional hockey team the Seattle Kraken. At the 2022 NHL combine, where teams have an opportunity to interview prospective draft picks, one athlete asked him what the team looks for in a player. His immediate response? Character. Competence is table stakes, but what sets players, teams, and organizations apart is the character that enables them to bring their best every day, even in challenging situations. Will the exhausted player maintain the drive needed to win the one-on-one puck battle? Will a player withstand an opponent trying to pull them off their game? And will a team persevere through a difficult stretch of losses? None of these choices are about competence or skill but about character, and they make the difference between winning and losing. At the highest level, character is the competitive edge.</p>\n<p></p>\n<p>In this article, we will provide a deeper understanding of character and its applications, beginning with an overview of our research-based Leader Character Framework, and we will offer guidance for how business leaders can begin to apply considerations of character to build stronger organizations.</p>\n<h3>Understanding Leader Character</h3>\n<p>Whereas the rigorous application of leader character in organizations is new, the science of character is not. More than two millennia ago, Aristotle declared character to be a virtuous set of habits. Even earlier than that, around 500 B.C., Confucius had introduced ideas about justice, humanity, and wisdom. More recently, psychologists Christopher Peterson and Martin Seligman used a rigorous scientific approach to identify a universal set of virtues that contribute to well-being and human flourishing.<a id=\"reflink4\" class=\"reflink\" href=\"#ref4\">4</a> Porting this depth of research on character and well-being into leadership in organizations involved mapping the scholarly research on character with its practical application in organizations.</p>\n<p>To forge a bridge between the research underpinnings associated with character and the application of character in leadership practice, we used an engaged scholarship approach with over 2,000 executives that involved focus groups and quantitative analysis. This ultimately led to a definition of <em>leader character</em> based on 10 separate dimensions that interact with an 11th, central quality of judgment. (See “Leader Character Framework.”)</p>\n<div class=\"callout-highlight\">\n<aside class=\"l-content-wrap\">\n<article>\n<h4>Leader Character Framework</h4>\n<p class=\"caption\">\n<p><img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/10/MAG-Crossan-Figure-1.jpg\" alt=\"Leader Character Framework\" /></p>\n<p class=\"attribution\">\n</article>\n</aside>\n</div>\n<p>Each dimension in this framework is a potential virtue. Consistent with Aristotle’s thinking, though, virtues become vices in either deficiency or excess. For example, leaders with too little courage are timid; those who take courage to an extreme become reckless. Every character behavior can operate as a vice in deficiency or excess. (See “Examples of Leader Character Virtues and Vices.”)</p>\n<div class=\"callout-highlight\">\n<aside class=\"l-content-wrap\">\n<article>\n<h4>Examples of Leader Character Virtues and Vices</h4>\n<p class=\"caption\">Each character dimension can function as a vice as well as a virtue, if it is either lacking or excessive.</p>\n<table id=\"Chart#\" class=\"chart-grouped-rows no-mobile\" style=\"width: 100%\">\n<thead>\n<tr>\n<th style=\"line-height:1.5;vertical-align:bottom;width:10%\">Character Dimension</th>\n<th style=\"line-height:1.5;vertical-align:bottom;width:30%\">Deficient Vice</th>\n<th style=\"line-height:1.5;vertical-align:bottom;width:30%\">Virtue</th>\n<th style=\"line-height:1.5;vertical-align:bottom;width:30%\">Excess Vice</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td rowspan=\"4\">\n<p><strong>Accountability</strong></p>\n</td>\n<td>\n<p>Deflects</p>\n</td>\n<td>\n<p>Takes ownership</p>\n</td>\n<td>\n<p>Can’t delegate</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Unaccepting of consequences</p>\n</td>\n<td>\n<p>Accepts consequences</p>\n</td>\n<td>\n<p>Burdened</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Negligent</p>\n</td>\n<td>\n<p>Conscientious</p>\n</td>\n<td>\n<p>Obsessive</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Irresponsible</p>\n</td>\n<td>\n<p>Responsible</p>\n</td>\n<td>\n<p>Controlling</p>\n</td>\n</tr>\n<tr>\n<td rowspan=\"5\">\n<p><strong>Collaboration</strong></p>\n</td>\n<td>\n<p>Self-centered</p>\n</td>\n<td>\n<p>Cooperative</p>\n</td>\n<td>\n<p>Conflict avoidant</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Confrontational</p>\n</td>\n<td>\n<p>Collegial</p>\n</td>\n<td>\n<p>People-pleasing</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Narrow-minded</p>\n</td>\n<td>\n<p>Open-minded</p>\n</td>\n<td>\n<p>Abstract</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Inflexible</p>\n</td>\n<td>\n<p>Flexible</p>\n</td>\n<td>\n<p>Compliant</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Disconnected</p>\n</td>\n<td>\n<p>Interconnected</p>\n</td>\n<td>\n<p>Can’t discern boundaries</p>\n</td>\n</tr>\n<tr>\n<td rowspan=\"5\" style=\"background-color:white;\">\n<p><strong>Integrity</strong></p>\n</td>\n<td>\n<p>Fake</p>\n</td>\n<td>\n<p>Authentic</p>\n</td>\n<td>\n<p>Uncompromising</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Untruthful</p>\n</td>\n<td>\n<p>Candid</p>\n</td>\n<td>\n<p>Belligerent</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Manipulative</p>\n</td>\n<td>\n<p>Transparent</p>\n</td>\n<td>\n<p>Indiscriminate</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Unprincipled</p>\n</td>\n<td>\n<p>Principled</p>\n</td>\n<td>\n<p>Dogmatic</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Inconsistent</p>\n</td>\n<td>\n<p>Consistent</p>\n</td>\n<td>\n<p>Rigid</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p><!--IMAGE FALLBACK FOR MOBILE BELOW --><br />\n<img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/10/MAG-Crossan-Table_1.png\" alt=\"Examples of Leader Character Virtues and Vices\" class=\"no-desktop\">\n</p>\n</article>\n</aside>\n</div>\n<p>People often have difficulty understanding how vices as well as virtues can spring from character dimensions. However, when we ask people to describe a leader who has a lot of integrity, accountability, and drive (behaviors that are often reinforced, endorsed, and rewarded in organizations) and low humility, humanity, and temperance (behaviors that are typically unsupported), the responses are consistent. Rather than describing a leader who is authentic, candid, transparent, principled, and consistent (observable behaviors associated with integrity in its virtuous state), the leader is described as being uncompromising, belligerent, indiscriminate, dogmatic, and rigid (the vice state of integrity).</p>\n<p>The problem has been that we treat those vice behaviors as expressions of personal style rather than connecting them to the poor decision-making and negative outcomes that often result. It’s important to understand that such a person isn’t just “rough around the edges” but that the very behaviors the organization has endorsed and rewarded have overweighted some dimensions of character and underweighted others, leading to dysfunctional decision-making and culture, and poor results.</p>\n<p>But excess is not simply about having too much of a single dimension. The dimensions of character need to be considered in relationship with each other. Excess, then, is having too much of one dimension relative to other dimensions that you have too little of when they all need to be in balance. Courage needs to be balanced (constrained) by temperance to avoid tipping into recklessness. At the same time, courage needs to be fortified (supported) by justice and accountability to avoid slipping back to deficiency. An appropriately courageous leader supported by a strong sense of justice and accountability but constrained appropriately by temperance and humanity is not afraid to speak up and take action, even in a challenging situation. This isn’t about “dialing back” courage, justice, or accountability so much as it is about making sure temperance and humanity are sufficiently strong to balance them and achieve the best outcomes. This leader will also tend to speak and act in a measured manner that avoids further inflaming difficult circumstances.</p>\n<p>Contrary to other areas of leadership development, which prescribe focusing on strengths and allowing others to complement weaknesses, character development work looks at potential strengths that are likely operating as a vice, and it seeks to restore them to their virtuous state by strengthening weak areas. (See “Developing Leader Character.”)</p>\n<div class=\"callout-highlight\">\n<aside class=\"l-content-wrap\">\n<article>\n<h4>Developing Leader Character</h4>\n<p>Contrary to popular belief, individuals are not born with character, nor is it set in stone at an early age.<a id=\"reflinki\" class=\"reflink\" href=\"#refi\">i</a> Because the 62 elements associated with the 11 dimensions of character are virtuous habits that can be developed, the basic truth is that character can be strengthened, but it can also atrophy without conscious attention to its development. We are always becoming something while we are busy doing what we do; we can become more courageous or less courageous, or possess more humility or less. To this point, many studies have shown that as leaders rise in the organization, they may develop hubris (a lack of humility).</p>\n<p>The development of individual character occurs through five phases. (See “The Five Phases of Leader Character Development.”) Most organizations doing leader character work couple the understanding of what character is and why it matters with an introduction to the development of character. The Leader Character Insight Assessment offered through Sigma Assessment Systems provides an opportunity for the self- or 360-degree assessment of character and a set of resources on which to start the character development journey.<a id=\"reflinkii\" class=\"reflink\" href=\"#refii\">ii</a></p>\n</article>\n</aside>\n</div>\n<div class=\"callout-highlight\">\n<aside class=\"l-content-wrap\">\n<article>\n<h4>The Five Phases of Leader Character Development</h4>\n<p><strong>1. Discover.</strong> Even a brief session providing individuals with an overview of leader character can help them to discover latent character strengths upon reflection. For example, one executive in a session we led told us that he subsequently realized that his drive had atrophied over time, and he committed to strengthening it. Such realizations shift the learner into the next phase.</p>\n<p><strong>2. Activate.</strong> Character can be activated through reminding, priming, and reinforcement. There are many ways to do this: For some, it might be setting a reminder alarm, or using that first cup of coffee or tea in the morning to trigger the intention to be mindful of a certain character dimension. Music can be particularly effective; research has revealed that, through tempo, rhythm, and memory, music can activate all 11 dimensions of character.<a id=\"reflinkiii\" class=\"reflink\" href=\"#refiii\">iii</a> For example, people intuitively understand that music can activate drive when they work out. Music is prevalent in our lives and a freely available resource. In fact, we have created a <a href=\"https://open.spotify.com/search/The%20Virtuosity%20soundtrack\">Spotify playlist</a> for all 11 dimensions. (Search for “the Virtuosity soundtrack” on Spotify).</p>\n<div class=\"callout-toggle\">\n<p><strong>3. Strengthen.</strong> This is where character development becomes much more challenging for both individuals and organizations, because it requires daily investment. Our research has drawn on the science of exercise and habit development to anticipate what it takes to develop character. We have developed the Character Behavior Intentionality index, which measures the intention to develop a character-related behavior.<a id=\"reflinkiv\" class=\"reflink\" href=\"#refiv\">iv</a> The scores are derived from an assessment of attitude, peer influence, cultural influence, lifestyle, and ability. Note that even if individuals have a strong attitude to develop a character behavior, it can be negated by an organization where that behavior is discouraged by peers or cultural norms. The Virtuosity learning app provides a customized program for the learner to strengthen character and work through the next two phases of development as well.</p>\n<p><strong>4. Connect.</strong> This phase reinforces the interconnected nature of character and how some dimensions and behaviors can be overweighted and others underweighted. People often see the benefits of courage and integrity (and rarely see the vices) but fail to understand the strength in humility (including vulnerability) that allows someone to be authentic and candid, revealing integrity. Lack of candor is often tied to an unwillingness to show vulnerability; people fear speaking up and being judged.</p>\n<p><strong>5. Sustain.</strong> The real test of character is whether it holds up under stress and in different contexts. For example, having strength in vulnerability to support humility means that when you need to be vulnerable, you can lean into that discomfort or fear. Sustaining character means that you can call on any dimension of character when you need it, not that you are exercising it all the time. Character is always evolving, for better or worse, whether personally or professionally. For example, time pressure tends to stress-test temperance, which has emerged as the weakest dimension of character for most executives. With greater insight and clarity about the leader you are becoming, you can make choices that help strengthen rather than erode character.\n</div>\n</article>\n</aside>\n</div>\n<p></p>\n<p>We have validated our framework by working alongside — and also surveying — thousands of leaders worldwide across sectors and in industries such as international banking, government, law enforcement, military and border protection services, and professional sports. In addition to providing evidence of how character dimensions can be problematic in both excess and deficiency, this work has confirmed that character is a habit of being that is objectively observable. This indicates that it can be objectively assessed and developed like other human behaviors.</p>\n<p>Indeed, as Aristotle said, one becomes virtuous only by acting virtuously. Our decisions and actions, especially in difficult or crucial moments, manifest character. How we habitually make decisions — what we think about in crucial moments, what considerations we reference — determine our actions and whether they exhibit character. The decisions and actions to which we are inclined then form patterns and build capabilities, which influence future actions and decisions. And just as physical exercise builds muscle strength, an individual’s intelligent and disciplined practice develops character strength.</p>\n<p>Our research reveals that simply educating people by unpacking what character is and how it operates can often provide immediate course correction to individuals and organizations, and create the opportunity to activate dimensions of character that have been latent or underdeveloped.</p>\n<p>While individuals must act on these insights themselves, leaders are responsible for bringing an organizationwide approach to elevating character and integrating it with competence. That includes taking a hard look at an organization’s cultural norms that might encourage some character dimensions at the expense of others. Philip Zimbardo, the psychologist known for the famous Stanford prison experiment, has suggested that sometimes problematic behaviors are not the result of “a few bad apples” but, rather, good apples having been placed into bad barrels. In the case of character, because it has been misunderstood and neglected, the organizational barrels have consistently overweighted some dimensions of character and underweighted others and have failed to strategically embed leader character alongside competence in organization practices.</p>\n<h3>Making Leader Character a Strategic Asset</h3>\n<p>When individuals increase their understanding of leader character and take ownership of elevating their character in addition to their professional competence, organizational excellence and well-being will result. But positive effects are limited when organizations don’t apply character insights to policies and practices while continuing to hire, reward, and promote individuals who have weak or imbalanced characters. And because people can’t “unsee” leader character once they’ve learned how it is expressed, it’s only a matter of time before the good apples choose to leave the bad barrels.</p>\n<p>For many companies, work on leader character might begin with the goal of fostering a healthier organizational culture. The table “How Character Manifests in Culture” lists examples of typical behaviors when leader character is present — or absent — in an organization. Every organization we have worked with aspires to the behaviors in the If Present column because they are clearly linked to strategic advantages, but these same organizations have many of the behaviors in the If Absent column. They have struggled to make changes, largely because there is too much lip service paid to areas such as values, which are often aspirational statements about some dimensions of character.</p>\n<div class=\"callout-highlight callout--expand\">\n<aside class=\"l-content-wrap\">\n<article>\n<h4>How Character Manifests in Culture</h4>\n<p class=\"caption\">\n<table id=\"Chart#\" class=\"chart-grouped-rows no-mobile\">\n<thead>\n<tr>\n<th style=\"width:20%\">Dimension</th>\n<th style=\"width:40%\">If Present</th>\n<th style=\"width:40%\">If Absent</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>\n<p><strong>Judgment</strong></p>\n</td>\n<td>\n<p>Recognize key issues; solid decision-making</p>\n</td>\n<td>\n<p>Poor decisions, confusion, and resistance to change</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><strong>Courage</strong></p>\n</td>\n<td>\n<p>Decisions are made; opposition to poor decisions; innovation thrives</p>\n</td>\n<td>\n<p>Agreement of poor decisions; satisficing rather than maximizing is the norm; moral muteness prevails</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><strong>Drive</strong></p>\n</td>\n<td>\n<p>Sustained momentum around focused priorities and high productivity</p>\n</td>\n<td>\n<p>Lethargy and low productivity</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><strong>Collaboration</strong></p>\n</td>\n<td>\n<p>Effective teamwork enhancing productivity; diversity in teams</p>\n</td>\n<td>\n<p>“Every man for himself” mentality; lack of information sharing</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><strong>Integrity</strong></p>\n</td>\n<td>\n<p>Trust, transparency, and effective communication</p>\n</td>\n<td>\n<p>Operating from a position of self-interest and mistrust</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><strong>Temperance</strong></p>\n</td>\n<td>\n<p>Effective risk management; thoughtful consideration</p>\n</td>\n<td>\n<p>Short-term gains dictate strategy; desire for instant gratification</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><strong>Accountability</strong></p>\n</td>\n<td>\n<p>Ownership; commitment to decisions</p>\n</td>\n<td>\n<p>Failure to deliver results and take responsibilityFailure to deliver results and take responsibility</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><strong>Justice</strong></p>\n</td>\n<td>\n<p>Fairness fostering trust; going above and beyond</p>\n</td>\n<td>\n<p>Inequities exist; favoritism and nepotism</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><strong>Humility</strong></p>\n</td>\n<td>\n<p>Willingness to identify and discuss mistakes; support of continuous learning</p>\n</td>\n<td>\n<p>Arrogance and overconfidence; complacency</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><strong>Humanity</strong></p>\n</td>\n<td>\n<p>Deep understanding of what is important to stakeholders</p>\n</td>\n<td>\n<p>Failure to acknowledge critical social interactions</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><strong>Transcendence</strong></p>\n</td>\n<td>\n<p>Commitment to excellence; clarity and focus; inspiration motivates innovation</p>\n</td>\n<td>\n<p>Narrow goals and objectives; failure to acknowledge, appreciate, and strive for excellence; not inspired</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p><!--IMAGE FALLBACK FOR MOBILE BELOW --><br />\n<img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/10/MAG-Crossan-Table_2.png\" alt=\"How Character Manifests in Culture\" class=\"no-desktop\">\n</p>\n</article>\n</aside>\n</div>\n<p>Take, for example, the value of integrity, which is common to most organizations. Valuing integrity without understanding what it is, how to develop it, and how it is nested within the other dimensions of character is like telling someone to run a marathon without having trained for it. There is also the serious danger that in spite of best intentions, cultures built on a strictly values-based foundation simply elevate dimensions such as integrity or drive into a state of vice or dysfunction. A key point is that we do not advocate that organizations reconsider values or even competencies but rather that they elevate leader character alongside competence so that aspirational values are realized in the way they were imagined.</p>\n<p>When working with organizations, we ask leaders to assess where they position their areas of the organization along the continuum, from present to absent, for each of the dimensions in the table. Then we ask them to imagine whether they would reassess where their organization is positioned along the various dimensions if they personally had strength of character across all dimensions. It’s a sobering moment when they realize that the culture of the organization is a reflection of their character.</p>\n<p>While culture might be a good starting point for many, our experience is that it doesn’t matter where you begin when applying leader character in the organization. It often starts with someone who is a champion in a particular area. For example, Sonia Côté, chief HR officer and acting assistant commissioner of the Human Resources Branch at the Canada Revenue Agency (CRA), was asked, “How do we know we are hiring the right people?” In response, Côté led the introduction of character-based assessments and interviews to complement the CRA’s competence-based approach to identifying internal candidates for leadership positions. The hiring process transformed radically.<a id=\"reflink5\" class=\"reflink\" href=\"#ref5\">5</a> The objective, according to Côté, is to “assess who these people are as leaders … to look for their sense of purpose, to get to truly know them and assess the quality of their judgment.”</p>\n<p>The character initiative at CRA has evolved to engage the entire organization and led to the creation of a 20-person leader character team, headed by Steve Virgin, a former Canadian Forces submarine captain. At first, Virgin recalled, people were skeptical. Soon, though, interviewers were calling the approach powerful and meaningful. Even more impressive was the impact of post-interview debriefs. Candidates were encouraged to seek feedback, and those who did were provided commentary about their interview. Many candidates said that the character-based feedback was the most meaningful they had ever received. Interview board members, including those at the most senior levels, indicated that it was the first time they had really gotten to know the candidate as a leader and as an individual. And, importantly, character-based interviews have changed hiring decisions. Because the interview board gets a truer, deeper understanding of who the candidate is as a person, they are more willing to select less traditional candidates, creating a more diverse workforce. All of these positive changes arose from Côté and her team making the initial, personal commitment to champion leader character.</p>\n<p>One of the significant benefits of the strategic approach to leader character is that it provides an accessible common language that weaves together the many different strategic agendas of the organization, whether it be risk management or diversity, equity, and inclusion (DEI). For example, <a href=\"https://www.questionofcharacter.com/essays/characters-essential-role-in-addressing-conduct-in-financial-institutions\">misconduct and risk management are heavily affected by character-based judgment</a>. And when judgment is strengthened by elevating dimensions such as humility, humanity, collaboration, accountability, courage, and justice, meeting strategic goals to advance DEI becomes easier.</p>\n<h3>Taking Action on Character</h3>\n<p>The most immediate and practical approach for organizations that seek to tap the power of leader character is to simply start the conversation. A leadership team from TD Bank Group recently referred to our book, <cite>Developing Leadership Character</cite>, to launch a set of workshops for their colleagues on each of the dimensions of character.<a id=\"reflink6\" class=\"reflink\" href=\"#ref6\">6</a> We learned about this opportunity when a TD  executive reached out to learn more about temperance. </p>\n<p>Educational events with the goal of understanding leader character are both scalable and high impact. They can range from intimate senior leadership workshops to webinars with thousands of people on the call, and they provide an immediate grasp of how leader character can be applied both personally and professionally. In our own workshops, we deepen understanding using video clips such as the movie <cite>Invictus</cite>, which features the real-life story of Nelson Mandela’s transformation of South Africa. We’re often struck by how easily people can identify all the character behaviors after viewing a video clip of Mandela’s first day on the job. They observe that it is not one behavior at a time but often several working simultaneously, in much the same way you might observe the muscles of the body working together when you see someone in motion. These insights are important, because we distinguish what we call <em>elegant manipulation</em> — someone with weak or imbalanced character who pretends to exercise humility and humanity, for example — from the person with strength of character whose actions reveal that strength. And there is another profound moment when people realize that the essence of their leadership potential arises from their strength of character rather than some style that seems inauthentic to them.</p>\n<p>After a workshop with the senior executives of the capital markets group in a bank, one executive asked where he could find a leader character coach for his son, to which we replied, “That would be you.” It is not an insignificant point that many people see the application of character in both their personal lives and professional lives. In fact, given an understanding of what character is and how it develops, there is as much potential for development outside of the workplace as there is within it.<a id=\"reflink7\" class=\"reflink\" href=\"#ref7\">7</a></p>\n<p></p>\n<p>As discussed above, though, these initial investments will have the most significant payback when leadership elevates character alongside competence as a strategic asset. The best outcomes result from inserting character into HR practices and leveraging it in strategic and cultural transformation and key initiatives, including risk management and DEI.</p>\n<p>Although there is a sweeping strategic agenda for leader character work, there are practical points of application. First, start with yourself. Consider whether what could be potential virtues are operating like vices, and where you need to strengthen dimensions of character. Consider who you are becoming while you are busy doing — how is character showing up for you, and how is it affecting others? One executive we know sets his watch to remind himself several times a day to check on how he is activating his character to influence his judgment and the judgment of those with whom he is interacting. A gut-check on character has pivoted many conversations that are going sideways when individuals ask themselves, “What dimension of character do I need to activate in this moment?”</p>\n<aside class=\"callout-info\">\n<h4>Leader Character Resources</h4>\n<ul>\n<li>\n<p><cite><a href=\"https://www.questionofcharacter.com/\">Question of Character</a></cite> podcast series</p>\n</li>\n<li>\n<p><a href=\"https://www.sigmaassessmentsystems.com/assessments/leadership-character-insight-assessment/\">LCIA self- and 360-degree assessments of leader character</a></p>\n</li>\n<li>\n<p><a href=\"https://virtuositycharacter.ca/\">Virtuosity Leader Character Development app</a></p>\n</li>\n<li>\n<p><a href=\"https://www.ivey.uwo.ca/leadership/for-leaders/professional-development-consulting/leader-character-practitioner-certification-program/\">Leader Character Practitioner Certification Program</a></p>\n</li>\n<li>\n<p><a href=\"https://www.ivey.uwo.ca/leadership/\">Articles, webinars, and blogs from the Ian O. Ihnatowycz Institute for Leadership</a></p>\n</li>\n<li>\n<p><a href=\"https://open.spotify.com/playlist/1LCowS9BvxWPseLrIHLzT1?si=kUciQQWJS6KmtQDmkMB1yg\">Virtuosity character playlist on Spotify</a></p>\n</li>\n</ul>\n</aside>\n<p>Second, you can start to embed leader character in your practices from wherever you sit. You might be a senior leader with a smorgasbord of strategic priorities, or someone like Côté, who has a particular area of responsibility. Because the thread of leader character weaves through and connects all facets of the organization, you can make the changes that trigger a ripple effect throughout.</p>\n<p>Finally, our aim has been to enable the strategic shift in elevating character alongside competence with a far-ranging set of tools, from articles and podcasts to assessment instruments and learning apps. It’s a big idea and profound shift, but there are very practical tools and approaches to help implement it. We contend that the times we live in make elevating character alongside competence not only a strategic imperative but also a social responsibility.</p>\n<p></p>\n",
  "wfw:commentRss": "https://sloanreview.mit.edu/article/make-leader-character-your-competitive-edge/feed/",
  "slash:comments": 2
}