{
  "title": "Nanoparticles in Medicine—Microbots to Blood Clots",
  "link": "https://spectrum.ieee.org/medical-nanoparticles",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/microscopic-image-of-neutrophils-and-blood-cells.jpg?id=31945869&width=1200&height=600&coordinates=0%2C312%2C0%2C313\"/><br/><br/><p>As nanotechology burrows into an increasing number of medical technologies, new developments in nanoparticles point to the ways that treatments can today be nanotechnologically targeted. In one case, would-be end effectors on microrobots are aimed at clearing up cases of bacterial pneumonia. In another, a smart-targeting system may decrease clotting risks in dangerous cases of thrombosis. </p><p>Scientists from the University of California, San Diego, demonstrated antibiotic-filled nanoparticles that hitch a ride on microbots made of algae to deliver targeted therapeutics. Their <a href=\"https://www.nature.com/articles/s41563-022-01360-9\" target=\"_blank\">paper</a> was recently published in <em>Nature Materials</em>. As a proof of concept, the researchers administered antibiotic-laden microbots to mice infected with a potentially fatal variety of pneumonia (a strain that is common in human patients who are receiving mechanical ventilation in  intensive-care settings). All infections in the treated mice cleared up within a week, while untreated mice died within three days.<br/></p><p>The algae–nanoparticle hybrid microbots were effectively distributed to infected tissue through lung fluid and showed negligible toxicity. “Our goal is to do targeted drug delivery into more challenging parts of\n the body, like the lungs,” said bioengineering professor <a href=\"https://iem.ucsd.edu/researchers/people/profiles/liangfang-zhang.html\" target=\"_blank\">Liangfang Zhang</a> in a press statement. “And we want to do it in a way that is safe, \neasy, biocompatible, and long lasting.” </p><p>The nanoparticle treatment was also shown to be more effective than an IV injection because of its targeted delivery. “With an IV injection, sometimes only a very small fraction of \nantibiotics will get into the lungs,” said coresearcher <a href=\"https://profiles.ucsd.edu/victor.nizet\" target=\"_blank\">Victor Nizet</a> in the press release. This results in high mortality for patients with current antibiotic treatments for pneumonia. “Based on \nthese mouse data, we see that the microrobots could potentially improve \nantibiotic penetration to kill bacterial pathogens and save more \npatients’ lives.”</p><h2>Nano targets neutro</h2><p>Thrombosis, or the obstruction of blood flow in the body because of clot (thrombus) formation, is one of the <a href=\"https://www.who.int/news-room/fact-sheets/detail/the-top-10-causes-of-death\" target=\"_blank\"><u>leading killers</u></a> of humans globally. Even so, the molecular drivers of thrombosis are poorly understood. A recent <a href=\"https://www.science.org/doi/10.1126/scitranslmed.abj7465\" target=\"_blank\"><u>paper</u></a> published in <em>Science Translational Medicine</em> identifies neutrophils as playing a key role in thrombosis. Targeting neutrophils using nanoparticle therapy, the researchers report, decreases clotting risk without increasing the risk of bleeding.<br/></p><p><u><a href=\"https://case.edu/cancer/members/member-directory/lalitha-nayak\" target=\"_blank\">Lalitha Nayak</a></u>, associate professor at the <a href=\"https://case.edu/medicine/\" target=\"_blank\">Case Western Reserve School of Medicine</a>, in Cleveland, first author of the study, says this is the first time overactive neutrophils have been identified as a key driver of both venous and arterial thrombosis.</p><p>Diseases associated with arterial clots are not the same as those with venous clots. Arteries are thicker, as are their walls, while veins are collapsible with thinner walls; the endothelial lining of these vessels are different, as are the pressures of the blood running through them. Myocardial infarction, or heart attack, for instance, is an arterial clot event, while deep-vein thrombosis is due to venous clots. Therefore, treatments for these two types of thromboses have also been different. </p><p>However, there are some diseases where you see both arterial and venous clots, Nayak says, one of those being antiphospholipid antibody syndrome (APS). This is what the researchers used as a model in their study. They identified key molecular events that serve as potential targets for treatment of thrombosis in APS.</p><p><u><a href=\"https://www.healthline.com/health/neutrophils\" rel=\"noopener noreferrer\" target=\"_blank\">Neutrophils</a></u> are a type of white blood cells that are first responders in the body’s immune system. Ordinarily, they rush to a site of injury or infection, and capture and destroy (by ingesting) infection-causing microorganisms.</p><p>In the present paper, a culmination of 10 years of research, Nayak and colleagues used mice models to show how overactive neutrophils participate in thrombosis because of their tendency to migrate and adhere to sites of injury, increasing the production of key factors used as building blocks of clots. </p><p>Theoretically, blocking neutrophils should make the thrombosis go away, but as these cells play an important immune role, that wouldn’t be practical. “That’s why we developed nanoparticles that specifically [identify and] target one receptor on an activated neutrophil,” Nayak says.<br/></p><p>The nanoparticles are synthetically engineered particles and are coated with different proteins of interest, she adds. For this study, they were coated with an antibody that would target specific receptors on neutrophils. “We did a lot of ex vivo studies to show that this is very specific and targets only activated neutrophils,” she says. “And we showed that if the animals were injected with this nanoparticle, thrombosis was significantly mitigated.”</p><p>At this point, as Nayak points out, their study is a proof of principle to show that if they could develop something like this for human patients, then they could mitigate thrombosis for them as well, irrespective of whether it was caused by, cancer, APS, or any other disease. </p><p>“For us now, the [next] challenge would be to try and develop something that would be translational, to take it to the bench [and then] from the bench to the bedside,” she says. “My next study would include patients’ samples, patients with antiphospholipid antibodies. We want to show that what we did in the mouse can be done in humans.”</p><p>Nayak’s study could be significant not just in treating thrombosis in general, but also could play a crucial role in the treatment regimes of other diseases that have blood clots as a common complication, such as cancer. Testing their nanoparticle therapy on cancer-associated thrombosis in mice is also among Nayak’s future plans.</p>",
  "pubDate": "Sun, 30 Oct 2022 14:00:01 +0000",
  "guid": "https://spectrum.ieee.org/medical-nanoparticles",
  "category": [
    "Biomedical",
    "Biomedical engineering",
    "Biomedicine",
    "Nanoparticles",
    "Nanobots"
  ],
  "dc:creator": "Payal Dhar",
  "media:content": ""
}