{
  "title": "Episode 37: &#8220;I Walk The Line&#8221; by Johnny Cash",
  "link": "https://500songs.com/podcast/episode-37-i-walk-the-line-by-johnny-cash/",
  "pubDate": "Sun, 16 Jun 2019 23:55:11 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-37-i-walk-the-line-by-johnny-cash/",
  "description": "Episode thirty-seven of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"I Walk The Line\" by Johnny Cash, and is part two of a trilogy on the aftermath of Elvis leaving Sun, and the birth of rockabilly. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a thirteen-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/27683577\">\"Don't Be Angry\" by Nappy Brown</a>.\n\n\n\n<strong>Errata</strong>\n\nTwo minor errors I noticed while editing but didn't think were worth going back and redoing -- I pronounce \"Belshazzar\" incorrectly (it's pronounced as Cash does in the song, as far as I can tell), and I said that the lyric to \"Get Rhythm\" contains the phrase \"if you get the blues\", when of course it's \"<em>when</em> you get the blues\".\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-37-i-walk-the-line/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nMy main source for this episode is <a href=\"https://amzn.to/2IjcTm9\"><em>Johnny Cash: The Life</em> by Robert Hilburn.</a>\n\nI'm relying heavily on <a href=\"https://amzn.to/2VDGeeo\"><em>Sam Phillips: the Man Who Invented Rock and Roll</em></a> by Peter Guralnick for all the episodes dealing with Phillips and Sun Records.\n\n<a href=\"https://amzn.to/2KSAoEp\">This triple-CD set</a> contains everything Johnny Cash recorded for Sun Records.\n\nHis early Sun singles are also on <a href=\"https://amzn.to/2I6Tx5A\">this ten-disc set,</a> which charts the history of Sun Records, with the A- and B-sides of ninety of the first Sun singles in chronological order for an absurdly low price. This will help give you the full context for Cash's work, in a way hearing it in isolation wouldn't.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong> Transcript</strong>\n\nThis podcast is called a history of rock music, but one of the things we're going to learn as the story goes on is that the history of any genre in popular music eventually encompasses them all. And at the end of 1955, in particular, there was no hard and fast distinction between the genres of rock and roll, rhythm and blues, and country music.\n\nSo today we're going to talk about someone who, to many, epitomises country music more than any other artist, but who started out recording for Sam Phillips at Sun Studios, making music that was stylistically indistinguishable from any of the other rockabilly artists there, and whose career would intertwine with all of them for decades to come.\n\nBefore you listen to this one, you might want to go back and listen to last week's episode, on \"Blue Suede Shoes\", because the stories of Johnny Cash and Carl Perkins tie together quite a lot, and this is effectively part two of a three-parter, about Sun Records and the birth of rockabilly.\n\nJohnny Cash's birth name was actually J.R. Cash -- initials rather than a full name -- and that was how he was known until he joined the Air Force. His parents apparently had a disagreement over what their son's name should be, and so rather than give him full names, they just gave him initials.\n\nThe Air Force wouldn't allow him to just use initials as his name, so he changed his name to John R. Cash. It was only once he became a professional musician that he took on the name Johnny Cash. He still never had a middle name, just a middle initial.\n\nWhile he was in the military, he'd been the very first American to learn that Stalin had died, as he'd been the radio operator who'd intercepted and decoded the Russian transmissions about it. But the military had never been the career he wanted. He wanted to be a singer. He just didn't know how.\n\nAfter returning to the US from his stint in the Air Force in Germany, aged twenty-two, Cash got married and moved to Memphis, to be near his brother. Cash's brother introduced him to two of his colleagues, Luther Perkins and Marshall Grant. Both Perkins and Grant could play a little guitar, and they started getting together to play a little music, sometimes with a steel player called Red Kernodle.\n\nThey were very, very, unskilled musicians, but that didn't matter. They had a couple of things that mattered far more than skill. They had a willingness to try anything if it might sound good, and they had Cash's voice, which even as a callow young man sounded like Cash had been carved out of rock and imbued with the spirit of an Old Testament prophet. Cash never had a huge range, but his voice had a sonority to it that was quite astonishing, a resonant bass-baritone that demanded you pay attention to what it had to say.\n\nAnd Cash had a determination that he was going to become a famous singer. He had no idea how one was to go about this, but he knew it was what he wanted to do.\n\nTo start with, they mostly performed the gospel songs that Cash loved. This was the music that is euphemistically called Southern Gospel, but which is really white gospel. Cash had had a religious experience as a kid, when his elder brother, who had wanted to become a priest, had died and had had a deathbed vision of heaven and hell, and Cash wanted to become a gospel singer to pay tribute to his brother while also indulging his own love of music.\n\nBut then at one of their jam sessions, Cash brought in a song he had written himself, called \"Belshazzar\", based on a story from the Bible:\n\n[Excerpt: Johnny Cash: \"Belshazzar\"]\n\nThe other two were amazed. Not so much by the song itself, but by the fact that you could write a song at all. The idea that songs were something you write was not something that had really occurred to them.\n\nCash, Perkins, and Grant all played acoustic guitar at first, and none of them were particularly good. They were mostly just hanging out together, having fun. They were just singing stuff they'd heard on the radio, and they particularly wanted to sound like the Louvin Brothers:\n\n[Excerpt: The Louvin Brothers, \"This Little Light of Mine\"]\n\nThey were having fun together, but that was all. But Cash was ambitious to do something more. And that \"something more\" took shape when he heard a record, one that was recorded the day after the plane that took Cash back into the US touched down:\n\n[Excerpt: Elvis Presley, \"That's All Right Mama\"]\n\nHe liked the sound of that record a lot. And what he liked even more was hearing the DJ, after the song was played, say that the record was out on Sun Records, a label based in Memphis itself.\n\nJohnny, Luther, and Marshall went to see Elvis, Scotty, and Bill perform, playing on the back of a flatbed truck and just playing the two songs on their single. Cash was immediately worried – Elvis was clearly a teenager, and Cash himself was a grown man of twenty-two. Had he missed his chance at stardom? Was he too old?\n\nCash had a chat with Elvis, and went along again the next night to see the trio performing a proper set at a nightclub, and this time he talked with Scotty Moore and asked him how to get signed to Sun.\n\nMoore told him to speak to Sam Phillips, and so Cash got hold of Sun's phone number and started calling, asking to speak to Phillips, who was never in – he was out on the road a lot of the time, pushing the label's records to distributors and radio stations.\n\nBut Cash also knew that he was going to have to do something more to get recorded. He was going to have to turn his little guitar jam sessions into a proper group like Elvis, Scotty, and Bill, not just three people bashing away together at acoustic guitars. They sometimes had Red on steel guitar, but they still needed some variety. Cash was obviously going to be the lead singer, so it made sense for him to stick with the acoustic rhythm guitar. Luther Perkins got himself an electric guitar and started playing lead lines which amounted to little more than boogie-woogie basslines transposed up an octave.\n\nMarshall Grant, meanwhile, got himself a double bass, and taped markers on it to show him where the notes were. He'd never played one before, so all he could do was play single notes every other beat, with big gaps between the notes -- \"Boom [pause] boom [pause] boom [pause] boom\" -- he couldn't get his fingers between the notes any faster.\n\nThis group was clearly not anything like as professional as Presley and his group, but they had *something*. Their limitations as musicians meant that they had to find ways to make the songs work without relying on complicated parts or virtuoso playing. As Luther Perkins would later put it, \"You know how all those hot-shot guitarists race their fingers all over the strings? Well, they’re looking for the right sound. I found it.”\n\nBut Cash was still, frankly, a little worried that his group weren't all that great, and when he finally went to see Sam Phillips in person, having failed to get hold of him on the phone, he went alone.\n\nPhillips was immediately impressed by Cash's bearing and presence. He was taller, and more dignified, than most of the people who came in to audition for Phillips. He was someone with presence, and gravitas, and Phillips thought he had the makings of a star.\n\nThe day after meeting Phillips for the first time, Cash brought his musician friends around as well, and Johnny, Luther, Marshall, and Red all had a chat with Phillips. Phillips explained to them that they didn't need to be technically great musicians, just have the right kind of sound.\n\nThe four of them rehearsed, and then came back to Phillips with some of the material they'd been practising. But when it came time to audition, their steel player got so scared that he couldn't tune his guitar, his hands were shaking so much. Eventually he decided that he was holding the other three back, and left the studio, and the audition continued with just the group who had now become the Tennessee Three – a name they chose because while they all now lived in Tennessee, none of them had originally come from there.\n\nPhillips liked their sound, but explained that he wasn't particularly interested in putting out gospel music. There's an urban legend that Phillips said \"go home and sin, then come back with a song I can sell\", though this was denied by Cash. But it is true that he'd had no sales success with gospel music, and that he wanted something more commercial.\n\nWhatever Phillips said, though, Cash took the hint, and went home and started writing secular songs. The one he came back to Phillips with, \"Hey Porter\", was inspired by the sound of the railway, and had a boom-chick-a-boom rhythm that would soon become Cash's trademark:\n\n[Excerpt, \"Hey Porter\": Johnny Cash and the Tennessee Two]\n\nPhillips liked it, and the Tennessee Three set to recording it. Or at least that was what they were called when they recorded it, but by the time it was released Sam Phillips had suggested a slight name change, and the single came out under the name Johnny Cash and the Tennessee Two.\n\nAs the Tennessee Two didn't have a drummer, Cash put paper between the strings and the fretboard of his acoustic guitar to deaden the sound and turn it into something that approximated the sound of a snare drum. The resulting boom-chick sound was one that would become a signature of Cash's recordings for the next few decades, a uniquely country music take on the two-beat rhythm. That sound was almost entirely forced on the group by their instrumental limitations, but it was a sound that worked.\n\nThe song Cash brought in to Phillips as a possible B-side was called \"Folsom Prison Blues\", and it was only an original in the loosest possible sense. Before going off to Germany with the air force, Cash had seen a film called \"Inside the Walls of Folsom Prison\", and it had given Cash the idea that someone should write a song about that. But he'd put the idea to the back of his mind until two other inspirations arrived.\n\nThe first was a song called \"Crescent City Blues\", which he heard on a Gordon Jenkins album that a fellow airman in Germany owned:\n\n[Excerpt: Gordon Jenkins (Beverly Maher vocals): \"Crescent City Blues\"]\n\nIf you've not heard that song before, and are familiar with Cash's work, you're probably mildly in shock right now at just how much like “Folsom Prison Blues” that is. Jenkins' song in turn is also strongly inspired by another song, also titled \"Crescent City Blues\", by the boogie-woogie pianist Little Brother Montgomery:\n\n[Excerpt Little Brother Montgomery, \"Crescent City Blues\"]\n\nThe second musical inspiration for Cash's prison song was a song by Cash's idol, Jimmie Rodgers, \"Blue Yodel #1\", also known as \"T For Texas\":\n\n[Excerpt: Jimmie Rodgers, \"Blue Yodel #1\"]\n\nThe line \"I'm gonna shoot poor Thelma, just to see her jump and fall\" hit Cash hard, and he realised that the most morally bankrupt person he could imagine was someone who would kill someone else just to watch them die.\n\nHe put this bleak amorality together with the idea of a song about Folsom, and changed just enough of the words to \"Crescent City Blues\" that it worked with this new concept of the character, and he titled the result \"Folsom Prison Blues\":\n\n[Excerpt: Johnny Cash, \"Folsom Prison Blues\"]\n\nSam Phillips didn't think that was suitable as the B-side to \"Hey Porter\", and they eventually went for a sad song that Cash had written titled \"Cry Cry Cry,\" but \"Folsom Prison Blues\" was put aside as a future possibility.\n\nWhen the contract was drawn up, the only person who was actually signed to Sun was Cash – Phillips didn't want to be tied to the other two musicians. But while only Cash was signed to the label, they split the money more or less equitably, in a forty-thirty-thirty split (other sources say that the split was completely equal).\n\n“Hey Porter” and “Cry Cry Cry” both charted, and \"Folsom Prison Blues\" became Cash's second single, and one of the songs that would define him for the rest of his career. It went to number four on the country and western chart, and established him as a genuine star of country music.\n\nIt's around this time that Sun signed Carl Perkins, which caused problems. Cash resented the way that he was being treated by Phillips as being less important than Perkins. He thought that Phillips was now only interested in his new star, and wasn't going to bother promoting Cash's records any more. This would be a recurring pattern with Phillips over the next few years -- he would discover some new star and whoever his previous favourite was would be convinced that Phillips no longer cared about them any more. This is ultimately what led to Sun's downfall, as one by one his discoveries moved on to other labels that they believed valued them more than Phillips did.\n\nPhillips, on the other hand, always argued that he had to put in more time when dealing with a new discovery, because he had to build their career up, and that established artists would always forget what he'd done for them when they saw him doing the same things for the next person.\n\nThat's not to say, though, that Cash disliked Perkins. Quite the contrary. The two became close friends -- though Cash became even closer with Clayton Perkins, Carl's wayward brother, who had a juvenile sense of humour that appealed to Cash. Cash even co-wrote a song with Perkins, \"All Mama's Children\", which became the B-side to Perkins' \"Boppin' the Blues\":\n\n[Excerpt, Carl Perkins, \"All Mama's Children\"]\n\nIt's not the greatest song either man ever wrote, by any means, but it was the start of a working relationship that would continue off and on for decades, and which both men would benefit from significantly.\n\nBy this point, Cash had started to build a following, and as you might expect given his inspiration, he was following the exact same career path as Elvis Presley. He was managed by Elvis' first proper manager, Bob Neal, and he was given a regular slot on the Louisiana Hayride, the country music radio show that Elvis had built his reputation on. But this meant that Cash was being promoted alongside Carl Perkins, as a rock and roll star.\n\nThis would actually do wonders for Cash's career in the long term. A lot of people who wouldn't listen to anything labeled country were fans of Cash in the mid fifties, and remained with him, and this meant that his image was always a little more appealing to rock audiences than many other similar singers. You can trace a direct line between Cash being promoted as a rock and roller in 1955 and 56, and his comeback with the American Recordings series more than forty years later.\n\nBut when Cash brought in a new song he'd written, about his struggle while on the road to be true to his wife (and, implicitly, also to his God), it caused a clash between him and Sam Phillips.\n\nThat song was quite possibly inspired by a line in \"Sixteen Tons\", the big hit from Tennessee Ernie Ford that year, which Cash fell in love with when it came out, and which made Cash a lifelong fan of its writer Merle Travis:\n\n[Excerpt: \"Sixteen Tons\", Tennessee Ernie Ford]\n\nHe never made the connection publicly himself, but that image of walking the line almost definitely stuck in Cash's mind, and it became the central image of a song he wrote while on the road, thinking about fidelity in every sense.\n\n\"I Walk the Line\" was the subject of a lot of debate between Cash and Phillips, neither of whom were entirely convinced by the other's argument. Cash was sure that the song was a good one, maybe the best song he ever wrote, but he wanted to play it as a slow, plaintive, lovelorn ballad. Phillips, on the other hand, wasn't so impressed by the song itself, but he thought that it had some potential if it was sped up to the kind of tempo that \"Hey Porter\", \"Cry Cry Cry\" and \"Folsom Prison Blues\" had all been performed in -- a rock and roll tempo, for Cash's rock and roll audience. Give it some rhythm, and some of the boom-chika-boom, and there might be something there.\n\nCash argued that he didn't need to. After all, the other song he had brought in, one that he cared about much less and had originally written to give to Elvis, was a rock and roll song. The lyrics even went \"Get rhythm if you get the blues\":\n\n[Excerpt: Johnny Cash and the Tennessee Two: \"Get Rhythm\"]\n\nThat song itself would go on to become a hit for Cash, and a staple of his live shows, but Phillips didn't see a reason why, just because one side of the record was uptempo, the other shouldn't be as well. He wanted the music to be universal, rather than personal, and to his mind a strong rhythm was necessary for universality.\n\nThey eventually compromised and recorded two versions, a faster one recorded the way Phillips wanted it, and a slower one, the way Cash liked it. Cash walked out convinced that Phillips would see reason and release the slower version. He was devastated to find that Phillips had released the faster version.\n\nCash later said, “The first time I heard it on the radio, I called him and said, ‘I hate that sound. Please don’t release any more records. I hate that sound.’ ”\n\nBut then the record became a massive hit, and Cash decided that maybe the sound wasn't so bad after all. It went to number one on the country jukebox chart, made the top twenty in the pop charts, and sold more than two million copies as a single. Phillips had unquestionably had the right instincts, commercially at least.\n\n[Excerpt: Johnny Cash, \"I Walk The Line\"]\n\n\"I Walk The Line\" has a very, very, unusual structure. There's a key change after every single verse. This is just not something that you do, normally. Most pop songs will either stay in one key throughout, have a different key for different sections (so they might be in a minor key for the verse and a major key for the chorus, for example) or have one key change near the end, to give the song a bit of a kick. Here, the first verse is in F, then it goes up a fourth for the second verse, in B flat. It goes up another fourth, to E flat, for the third verse, then for the fourth verse it's back down to B flat, and the fifth verse it's back down to F, though an octave lower.\n\n(For those wondering about those keys, either they're playing with capoes or, more likely, Sam Phillips sped the track up a semitone to make it sound faster.)\n\nAnd this is really very, very, clever in the way it sets the mood of the song. The song starts and ends in the same place both musically and lyrically -- the last verse is a duplicate of the first, though sung an octave lower than it started -- and the rising and falling overall arc of the song suggests a natural cycle that goes along with the metaphors in the lyrics -- the tides, heartbeats, day and night, dark and light. The protagonist of the song is walking a thin line, wobbling, liable at any moment to fall over to one side or another, just like the oscillation and return to the original tonal centre in this song. What sounds like a relatively crude piece of work is, when listened to closely, a much more inventive record.\n\nAnd this is true of the chord sequences in the individual verses too. The verses only have three chords each -- the standard three chords that most country or blues songs have, the tonic, subdominant and dominant of the key. But they're not arranged in the standard order that you'd have them in, in a three-chord trick or a twelve-bar blues. Instead the verses all start with the dominant, an unusual, unstable, choice that came about from Cash having once threaded a tape backwards and having been fascinated by the sound. The dominant is normally the last chord. Here it's the first.\n\nThe backwards tape is also one story as to where he got the idea of the humming that starts every verse -- though Cash also used to claim that the humming was so he could find the right note because there were so many key changes.\n\nThis is not a song that's structured like a normal country and western song, and it's quite an extraordinarily personal piece of work. It's an expression of one man's very personal aesthetic, no matter how much Sam Phillips altered it to fit his own ideas of what Cash should be recording. It's an utterly idiosyncratic, utterly *strange* record, and a very strong contender for the best thing Sun Records ever put out, which is a high bar to meet. The fact that this sold two million copies in a country market that is usually characterised as conservative shows just how wrong such stereotypes can be.\n\nIt was a masterpiece, and Johnny Cash was set for a very, very, long and artistically successful career.\n\nBut that career wouldn't be with Sun. His life was in turmoil, the marriage that he had written so movingly about trying to keep together was falling apart, and he was beginning to think that he would do better doing as Elvis had and moving to a major label. Soon he would be signed to Columbia, the label where he would spend almost all his career, but we'll have one last glimpse of him at Sun. before he went off to Columbia and superstardom, in a future episode.\n\nAnd next week, we'll look at how Elvis was doing away from Sun.",
  "itunes:subtitle": "Episode thirty-seven of A History of Rock Music in Five Hundred Songs looks at I Walk The Line by Johnny Cash, and is part two of a trilogy on the aftermath of Elvis leaving Sun, and the birth of rockabilly. Click the full post to read liner notes, links",
  "itunes:keywords": "Carl Perkins,country and western,Elvis Presley,gospel,Jimmie Rodgers,Johnny Cash,plagiarism,rockabilly,Sam Phillips,Scotty Moore,Sun Records",
  "itunes:episodeType": "full",
  "itunes:episode": 37,
  "content:encoded": "Episode thirty-seven of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"I Walk The Line\" by Johnny Cash, and is part two of a trilogy on the aftermath of Elvis leaving Sun, and the birth of rockabilly. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a thirteen-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/27683577\">\"Don't Be Angry\" by Nappy Brown</a>.\n\n\n\n<strong>Errata</strong>\n\nTwo minor errors I noticed while editing but didn't think were worth going back and redoing -- I pronounce \"Belshazzar\" incorrectly (it's pronounced as Cash does in the song, as far as I can tell), and I said that the lyric to \"Get Rhythm\" contains the phrase \"if you get the blues\", when of course it's \"<em>when</em> you get the blues\".\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-37-i-walk-the-line/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nMy main source for this episode is <a href=\"https://amzn.to/2IjcTm9\"><em>Johnny Cash: The Life</em> by Robert Hilburn.</a>\n\nI'm relying heavily on <a href=\"https://amzn.to/2VDGeeo\"><em>Sam Phillips: the Man Who Invented Rock and Roll</em></a> by Peter Guralnick for all the episodes dealing with Phillips and Sun Records.\n\n<a href=\"https://amzn.to/2KSAoEp\">This triple-CD set</a> contains everything Johnny Cash recorded for Sun Records.\n\nHis early Sun singles are also on <a href=\"https://amzn.to/2I6Tx5A\">this ten-disc set,</a> which charts the history of Sun Records, with the A- and B-sides of ninety of the first Sun singles in chronological order for an absurdly low price. This will help give you the full context for Cash's work, in a way hearing it in isolation wouldn't.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong> Transcript</strong>\n\nThis podcast is called a history of rock music, but one of the things we're going to learn as the story goes on is that the history of any genre in popular music eventually encompasses them all. And at the end of 1955, in particular, there was no hard and fast distinction between the genres of rock and roll, rhythm and blues, and country music.\n\nSo today we're going to talk about someone who, to many, epitomises country music more than any other artist, but who started out recording for Sam Phillips at Sun Studios, making music that was stylistically indistinguishable from any of the other rockabilly artists there, and whose career would intertwine with all of them for decades to come.\n\nBefore you listen to this one, you might want to go back and listen to last week's episode, on \"Blue Suede Shoes\", because the stories of Johnny Cash and Carl Perkins tie together quite a lot, and this is effectively part two of a three-parter, about Sun Records and the birth of rockabilly.\n\nJohnny Cash's birth name was actually J.R. Cash -- initials rather than a full name -- and that was how he was known until he joined the Air Force. His parents apparently had a disagreement over what their son's name should be, and so rather than give him full names, they just gave him initials.\n\nThe Air Force wouldn't allow him to just use initials as his name, so he changed his name to John R. Cash. It was only once he became a professional musician that he took on the name Johnny Cash. He still never had a middle name, just a middle initial.\n\nWhile he was in the military, he'd been the very first American to learn that Stalin had died, as he'd been the radio operator who'd intercepted and decoded the Russian transmissions about it. But the military had never been the career he wanted. He wanted to be a singer. He just didn't know how.\n\nAfter returning to the US from his stint in the Air Force in Germany, aged twenty-two, Cash got married and moved to Memphis, to be near his brother. Cash's brother introduced him to two of his colleagues, Luther Perkins and Marshall Grant. Both Perkins and Grant could play a little guitar, and they started getting together to play a little music, sometimes with a steel player called Red Kernodle.\n\nThey were very, very, unskilled musicians, but that didn't matter. They had a couple of things that mattered far more than skill. They had a willingness to try anything if it might sound good, and they had Cash's voice, which even as a callow young man sounded like Cash had been carved out of rock and imbued with the spirit of an Old Testament prophet. Cash never had a huge range, but his voice had a sonority to it that was quite astonishing, a resonant bass-baritone that demanded you pay attention to what it had to say.\n\nAnd Cash had a determination that he was going to become a famous singer. He had no idea how one was to go about this, but he knew it was what he wanted to do.\n\nTo start with, they mostly performed the gospel songs that Cash loved. This was the music that is euphemistically called Southern Gospel, but which is really white gospel. Cash had had a religious experience as a kid, when his elder brother, who had wanted to become a priest, had died and had had a deathbed vision of heaven and hell, and Cash wanted to become a gospel singer to pay tribute to his brother while also indulging his own love of music.\n\nBut then at one of their jam sessions, Cash brought in a song he had written himself, called \"Belshazzar\", based on a story from the Bible:\n\n[Excerpt: Johnny Cash: \"Belshazzar\"]\n\nThe other two were amazed. Not so much by the song itself, but by the fact that you could write a song at all. The idea that songs were something you write was not something that had really occurred to them.\n\nCash, Perkins, and Grant all played acoustic guitar at first, and none of them were particularly good. They were mostly just hanging out together, having fun. They were just singing stuff they'd heard on the radio, and they particularly wanted to sound like the Louvin Brothers:\n\n[Excerpt: The Louvin Brothers, \"This Little Light of Mine\"]\n\nThey were having fun together, but that was all. But Cash was ambitious to do something more. And that \"something more\" took shape when he heard a record, one that was recorded the day after the plane that took Cash back into the US touched down:\n\n[Excerpt: Elvis Presley, \"That's All Right Mama\"]\n\nHe liked the sound of that record a lot. And what he liked even more was hearing the DJ, after the song was played, say that the record was out on Sun Records, a label based in Memphis itself.\n\nJohnny, Luther, and Marshall went to see Elvis, Scotty, and Bill perform, playing on the back of a flatbed truck and just playing the two songs on their single. Cash was immediately worried – Elvis was clearly a teenager, and Cash himself was a grown man of twenty-two. Had he missed his chance at stardom? Was he too old?\n\nCash had a chat with Elvis, and went along again the next night to see the trio performing a proper set at a nightclub, and this time he talked with Scotty Moore and asked him how to get signed to Sun.\n\nMoore told him to speak to Sam Phillips, and so Cash got hold of Sun's phone number and started calling, asking to speak to Phillips, who was never in – he was out on the road a lot of the time, pushing the label's records to distributors and radio stations.\n\nBut Cash also knew that he was going to have to do something more to get recorded. He was going to have to turn his little guitar jam sessions into a proper group like Elvis, Scotty, and Bill, not just three people bashing away together at acoustic guitars. They sometimes had Red on steel guitar, but they still needed some variety. Cash was obviously going to be the lead singer, so it made sense for him to stick with the acoustic rhythm guitar. Luther Perkins got himself an electric guitar and started playing lead lines which amounted to little more than boogie-woogie basslines transposed up an octave.\n\nMarshall Grant, meanwhile, got himself a double bass, and taped markers on it to show him where the notes were. He'd never played one before, so all he could do was play single notes every other beat, with big gaps between the notes -- \"Boom [pause] boom [pause] boom [pause] boom\" -- he couldn't get his fingers between the notes any faster.\n\nThis group was clearly not anything like as professional as Presley and his group, but they had *something*. Their limitations as musicians meant that they had to find ways to make the songs work without relying on complicated parts or virtuoso playing. As Luther Perkins would later put it, \"You know how all those hot-shot guitarists race their fingers all over the strings? Well, they’re looking for the right sound. I found it.”\n\nBut Cash was still, frankly, a little worried that his group weren't all that great, and when he finally went to see Sam Phillips in person, having failed to get hold of him on the phone, he went alone.\n\nPhillips was immediately impressed by Cash's bearing and presence. He was taller, and more dignified, than most of the people who came in to audition for Phillips. He was someone with presence, and gravitas, and Phillips thought he had the makings of a star.\n\nThe day after meeting Phillips for the first time, Cash brought his musician friends around as well, and Johnny, Luther, Marshall, and Red all had a chat with Phillips. Phillips explained to them that they didn't need to be technically great musicians, just have the right kind of sound.\n\nThe four of them rehearsed, and then came back to Phillips with some of the material they'd been practising. But when it came time to audition, their steel player got so scared that he couldn't tune his guitar, his hands were shaking so much. Eventually he decided that he was holding the other three back, and left the studio, and the audition continued with just the group who had now become the Tennessee Three – a name they chose because while they all now lived in Tennessee, none of them had originally come from there.\n\nPhillips liked their sound, but explained that he wasn't particularly interested in putting out gospel music. There's an urban legend that Phillips said \"go home and sin, then come back with a song I can sell\", though this was denied by Cash. But it is true that he'd had no sales success with gospel music, and that he wanted something more commercial.\n\nWhatever Phillips said, though, Cash took the hint, and went home and started writing secular songs. The one he came back to Phillips with, \"Hey Porter\", was inspired by the sound of the railway, and had a boom-chick-a-boom rhythm that would soon become Cash's trademark:\n\n[Excerpt, \"Hey Porter\": Johnny Cash and the Tennessee Two]\n\nPhillips liked it, and the Tennessee Three set to recording it. Or at least that was what they were called when they recorded it, but by the time it was released Sam Phillips had suggested a slight name change, and the single came out under the name Johnny Cash and the Tennessee Two.\n\nAs the Tennessee Two didn't have a drummer, Cash put paper between the strings and the fretboard of his acoustic guitar to deaden the sound and turn it into something that approximated the sound of a snare drum. The resulting boom-chick sound was one that would become a signature of Cash's recordings for the next few decades, a uniquely country music take on the two-beat rhythm. That sound was almost entirely forced on the group by their instrumental limitations, but it was a sound that worked.\n\nThe song Cash brought in to Phillips as a possible B-side was called \"Folsom Prison Blues\", and it was only an original in the loosest possible sense. Before going off to Germany with the air force, Cash had seen a film called \"Inside the Walls of Folsom Prison\", and it had given Cash the idea that someone should write a song about that. But he'd put the idea to the back of his mind until two other inspirations arrived.\n\nThe first was a song called \"Crescent City Blues\", which he heard on a Gordon Jenkins album that a fellow airman in Germany owned:\n\n[Excerpt: Gordon Jenkins (Beverly Maher vocals): \"Crescent City Blues\"]\n\nIf you've not heard that song before, and are familiar with Cash's work, you're probably mildly in shock right now at just how much like “Folsom Prison Blues” that is. Jenkins' song in turn is also strongly inspired by another song, also titled \"Crescent City Blues\", by the boogie-woogie pianist Little Brother Montgomery:\n\n[Excerpt Little Brother Montgomery, \"Crescent City Blues\"]\n\nThe second musical inspiration for Cash's prison song was a song by Cash's idol, Jimmie Rodgers, \"Blue Yodel #1\", also known as \"T For Texas\":\n\n[Excerpt: Jimmie Rodgers, \"Blue Yodel #1\"]\n\nThe line \"I'm gonna shoot poor Thelma, just to see her jump and fall\" hit Cash hard, and he realised that the most morally bankrupt person he could imagine was someone who would kill someone else just to watch them die.\n\nHe put this bleak amorality together with the idea of a song about Folsom, and changed just enough of the words to \"Crescent City Blues\" that it worked with this new concept of the character, and he titled the result \"Folsom Prison Blues\":\n\n[Excerpt: Johnny Cash, \"Folsom Prison Blues\"]\n\nSam Phillips didn't think that was suitable as the B-side to \"Hey Porter\", and they eventually went for a sad song that Cash had written titled \"Cry Cry Cry,\" but \"Folsom Prison Blues\" was put aside as a future possibility.\n\nWhen the contract was drawn up, the only person who was actually signed to Sun was Cash – Phillips didn't want to be tied to the other two musicians. But while only Cash was signed to the label, they split the money more or less equitably, in a forty-thirty-thirty split (other sources say that the split was completely equal).\n\n“Hey Porter” and “Cry Cry Cry” both charted, and \"Folsom Prison Blues\" became Cash's second single, and one of the songs that would define him for the rest of his career. It went to number four on the country and western chart, and established him as a genuine star of country music.\n\nIt's around this time that Sun signed Carl Perkins, which caused problems. Cash resented the way that he was being treated by Phillips as being less important than Perkins. He thought that Phillips was now only interested in his new star, and wasn't going to bother promoting Cash's records any more. This would be a recurring pattern with Phillips over the next few years -- he would discover some new star and whoever his previous favourite was would be convinced that Phillips no longer cared about them any more. This is ultimately what led to Sun's downfall, as one by one his discoveries moved on to other labels that they believed valued them more than Phillips did.\n\nPhillips, on the other hand, always argued that he had to put in more time when dealing with a new discovery, because he had to build their career up, and that established artists would always forget what he'd done for them when they saw him doing the same things for the next person.\n\nThat's not to say, though, that Cash disliked Perkins. Quite the contrary. The two became close friends -- though Cash became even closer with Clayton Perkins, Carl's wayward brother, who had a juvenile sense of humour that appealed to Cash. Cash even co-wrote a song with Perkins, \"All Mama's Children\", which became the B-side to Perkins' \"Boppin' the Blues\":\n\n[Excerpt, Carl Perkins, \"All Mama's Children\"]\n\nIt's not the greatest song either man ever wrote, by any means, but it was the start of a working relationship that would continue off and on for decades, and which both men would benefit from significantly.\n\nBy this point, Cash had started to build a following, and as you might expect given his inspiration, he was following the exact same career path as Elvis Presley. He was managed by Elvis' first proper manager, Bob Neal, and he was given a regular slot on the Louisiana Hayride, the country music radio show that Elvis had built his reputation on. But this meant that Cash was being promoted alongside Carl Perkins, as a rock and roll star.\n\nThis would actually do wonders for Cash's career in the long term. A lot of people who wouldn't listen to anything labeled country were fans of Cash in the mid fifties, and remained with him, and this meant that his image was always a little more appealing to rock audiences than many other similar singers. You can trace a direct line between Cash being promoted as a rock and roller in 1955 and 56, and his comeback with the American Recordings series more than forty years later.\n\nBut when Cash brought in a new song he'd written, about his struggle while on the road to be true to his wife (and, implicitly, also to his God), it caused a clash between him and Sam Phillips.\n\nThat song was quite possibly inspired by a line in \"Sixteen Tons\", the big hit from Tennessee Ernie Ford that year, which Cash fell in love with when it came out, and which made Cash a lifelong fan of its writer Merle Travis:\n\n[Excerpt: \"Sixteen Tons\", Tennessee Ernie Ford]\n\nHe never made the connection publicly himself, but that image of walking the line almost definitely stuck in Cash's mind, and it became the central image of a song he wrote while on the road, thinking about fidelity in every sense.\n\n\"I Walk the Line\" was the subject of a lot of debate between Cash and Phillips, neither of whom were entirely convinced by the other's argument. Cash was sure that the song was a good one, maybe the best song he ever wrote, but he wanted to play it as a slow, plaintive, lovelorn ballad. Phillips, on the other hand, wasn't so impressed by the song itself, but he thought that it had some potential if it was sped up to the kind of tempo that \"Hey Porter\", \"Cry Cry Cry\" and \"Folsom Prison Blues\" had all been performed in -- a rock and roll tempo, for Cash's rock and roll audience. Give it some rhythm, and some of the boom-chika-boom, and there might be something there.\n\nCash argued that he didn't need to. After all, the other song he had brought in, one that he cared about much less and had originally written to give to Elvis, was a rock and roll song. The lyrics even went \"Get rhythm if you get the blues\":\n\n[Excerpt: Johnny Cash and the Tennessee Two: \"Get Rhythm\"]\n\nThat song itself would go on to become a hit for Cash, and a staple of his live shows, but Phillips didn't see a reason why, just because one side of the record was uptempo, the other shouldn't be as well. He wanted the music to be universal, rather than personal, and to his mind a strong rhythm was necessary for universality.\n\nThey eventually compromised and recorded two versions, a faster one recorded the way Phillips wanted it, and a slower one, the way Cash liked it. Cash walked out convinced that Phillips would see reason and release the slower version. He was devastated to find that Phillips had released the faster version.\n\nCash later said, “The first time I heard it on the radio, I called him and said, ‘I hate that sound. Please don’t release any more records. I hate that sound.’ ”\n\nBut then the record became a massive hit, and Cash decided that maybe the sound wasn't so bad after all. It went to number one on the country jukebox chart, made the top twenty in the pop charts, and sold more than two million copies as a single. Phillips had unquestionably had the right instincts, commercially at least.\n\n[Excerpt: Johnny Cash, \"I Walk The Line\"]\n\n\"I Walk The Line\" has a very, very, unusual structure. There's a key change after every single verse. This is just not something that you do, normally. Most pop songs will either stay in one key throughout, have a different key for different sections (so they might be in a minor key for the verse and a major key for the chorus, for example) or have one key change near the end, to give the song a bit of a kick. Here, the first verse is in F, then it goes up a fourth for the second verse, in B flat. It goes up another fourth, to E flat, for the third verse, then for the fourth verse it's back down to B flat, and the fifth verse it's back down to F, though an octave lower.\n\n(For those wondering about those keys, either they're playing with capoes or, more likely, Sam Phillips sped the track up a semitone to make it sound faster.)\n\nAnd this is really very, very, clever in the way it sets the mood of the song. The song starts and ends in the same place both musically and lyrically -- the last verse is a duplicate of the first, though sung an octave lower than it started -- and the rising and falling overall arc of the song suggests a natural cycle that goes along with the metaphors in the lyrics -- the tides, heartbeats, day and night, dark and light. The protagonist of the song is walking a thin line, wobbling, liable at any moment to fall over to one side or another, just like the oscillation and return to the original tonal centre in this song. What sounds like a relatively crude piece of work is, when listened to closely, a much more inventive record.\n\nAnd this is true of the chord sequences in the individual verses too. The verses only have three chords each -- the standard three chords that most country or blues songs have, the tonic, subdominant and dominant of the key. But they're not arranged in the standard order that you'd have them in, in a three-chord trick or a twelve-bar blues. Instead the verses all start with the dominant, an unusual, unstable, choice that came about from Cash having once threaded a tape backwards and having been fascinated by the sound. The dominant is normally the last chord. Here it's the first.\n\nThe backwards tape is also one story as to where he got the idea of the humming that starts every verse -- though Cash also used to claim that the humming was so he could find the right note because there were so many key changes.\n\nThis is not a song that's structured like a normal country and western song, and it's quite an extraordinarily personal piece of work. It's an expression of one man's very personal aesthetic, no matter how much Sam Phillips altered it to fit his own ideas of what Cash should be recording. It's an utterly idiosyncratic, utterly *strange* record, and a very strong contender for the best thing Sun Records ever put out, which is a high bar to meet. The fact that this sold two million copies in a country market that is usually characterised as conservative shows just how wrong such stereotypes can be.\n\nIt was a masterpiece, and Johnny Cash was set for a very, very, long and artistically successful career.\n\nBut that career wouldn't be with Sun. His life was in turmoil, the marriage that he had written so movingly about trying to keep together was falling apart, and he was beginning to think that he would do better doing as Elvis had and moving to a major label. Soon he would be signed to Columbia, the label where he would spend almost all his career, but we'll have one last glimpse of him at Sun. before he went off to Columbia and superstardom, in a future episode.\n\nAnd next week, we'll look at how Elvis was doing away from Sun.",
  "enclosure": "",
  "itunes:summary": "Episode thirty-seven of A History of Rock Music in Five Hundred Songs looks at \"I Walk The Line\" by Johnny Cash, and is part two of a trilogy on the aftermath of Elvis leaving Sun, and the birth of rockabilly. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a thirteen-minute bonus episode available, on \"Don't Be Angry\" by Nappy Brown.\n\n\n\nErrata\n\nTwo minor errors I noticed while editing but didn't think were worth going back and redoing -- I pronounce \"Belshazzar\" incorrectly (it's pronounced as Cash does in the song, as far as I can tell), and I said that the lyric to \"Get Rhythm\" contains the phrase \"if you get the blues\", when of course it's \"when you get the blues\".\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nMy main source for this episode is Johnny Cash: The Life by Robert Hilburn.\n\nI'm relying heavily on Sam Phillips: the Man Who Invented Rock and Roll by Peter Guralnick for all the episodes dealing with Phillips and Sun Records.\n\nThis triple-CD set contains everything Johnny Cash recorded for Sun Records.\n\nHis early Sun singles are also on this ten-disc set, which charts the history of Sun Records, with the A- and B-sides of ninety of the first Sun singles in chronological order for an absurdly low price. This will help give you the full context for Cash's work, in a way hearing it in isolation wouldn't.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\n Transcript\n\nThis podcast is called a history of rock music, but one of the things we're going to learn as the story goes on is that the history of any genre in popular music eventually encompasses them all. And at the end of 1955, in particular, there was no hard and fast distinction between the genres of rock and roll, rhythm and blues, and country music.\n\nSo today we're going to talk about someone who, to many, epitomises country music more than any other artist, but who started out recording for Sam Phillips at Sun Studios, making music that was stylistically indistinguishable from any of the other rockabilly artists there, and whose career would intertwine with all of them for decades to come.\n\nBefore you listen to this one, you might want to go back and listen to last week's episode, on \"Blue Suede Shoes\", because the stories of Johnny Cash and Carl Perkins tie together quite a lot, and this is effectively part two of a three-parter, about Sun Records and the birth of rockabilly.\n\nJohnny Cash's birth name was actually J.R. Cash -- initials rather than a full name -- and that was how he was known until he joined the Air Force. His parents apparently had a disagreement over what their son's name should be, and so rather than give him full names, they just gave him initials.\n\nThe Air Force wouldn't allow him to just use initials as his name, so he changed his name to John R. Cash. It was only once he became a professional musician that he took on the name Johnny Cash. He still never had a middle name, just a middle initial.\n\nWhile he was in the military, he'd been the very first American to learn that Stalin had died, as he'd been the radio operator who'd intercepted and decoded the Russian transmissions about it. But the military had never been the career he wanted. He wanted to be a singer. He just didn't know how.\n\nAfter returning to the US from his stint in the Air Force in Germany, aged twenty-two, Cash got married and moved to Memphis, to be near his brother. Cash's brother introduced him to two of his colleagues, Luther Perkins and Marshall Grant. Both Perkins and Grant could play a little guitar, and they started getting together to play a little music, sometimes with a steel player called Red Kernodle.\n\nThey were very, very, unskilled musicians, but that didn't matter. They had a couple of things that mattered far more than skill. They had a willingnes",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode thirty-seven of A History of Rock Music in Five Hundred Songs looks at \"I Walk The Line\" by Johnny Cash, and is part two of a trilogy on the aftermath of Elvis leaving Sun, and the birth of rockabilly. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a thirteen-minute bonus episode available, on \"Don't Be Angry\" by Nappy Brown.\n\n\n\nErrata\n\nTwo minor errors I noticed while editing but didn't think were worth going back and redoing -- I pronounce \"Belshazzar\" incorrectly (it's pronounced as Cash does in the song, as far as I can tell), and I said that the lyric to \"Get Rhythm\" contains the phrase \"if you get the blues\", when of course it's \"when you get the blues\".\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nMy main source for this episode is Johnny Cash: The Life by Robert Hilburn.\n\nI'm relying heavily on Sam Phillips: the Man ",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}