{
  "id": "yt:video:TL82mPxXuvQ",
  "yt:videoId": "TL82mPxXuvQ",
  "yt:channelId": "UCIAmdxvgfnIEZnyQSiqgVgQ",
  "title": "Mathematical Magic: Unlinking a Pair of Handcuffs",
  "link": "",
  "author": {
    "name": "Keenan Crane",
    "uri": "https://www.youtube.com/channel/UCIAmdxvgfnIEZnyQSiqgVgQ"
  },
  "published": "2021-12-07T23:59:48+00:00",
  "updated": "2022-01-09T02:26:46+00:00",
  "media:group": {
    "media:title": "Mathematical Magic: Unlinking a Pair of Handcuffs",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Suppose you have a pair of handcuffs linked together.  Can you pull them apart without unlocking them, breaking them, or letting them pass through themselves?  With real handcuffs, definitely not!  But for handcuffs made out of stretchy rubber, it turns out to be possible—as shown in this short looping video.\n\nThis motion provides a surprising example of what is known in mathematics as an \"ambient isotopy\" of two surfaces: a continuous motion where the surface is not ripped, cut, pinched, or allowed to pass through itself.  A more traditional example, perhaps, is the \"unknot problem\": given a loop of string, can it be untangled into a circle without cutting?  Even this simple question turns out to be very difficult to answer in general.  And questions about isotopy get even more interesting—and harder to predict!—when you start thinking about surfaces rather than curves.\n\nThe motion in this video was computed in a particularly remarkable way: it was not keyframed or manipulated by a human animator, but computed automatically by a program that does not do any high-level reasoning.   Instead, it minimizes a simple geometric energy that knows only about the shape of the surface at the current moment in time.  Just like gravity makes a ball fall to the ground, this so-called tangent-point energy makes the surface \"fall\" into the configuration that spreads out the surface as uniformly as possible, while preserving surface area.\n\nThe algorithm used to compute the motion is described in the paper\n\nChris Yu, Caleb Brakensiek, Henrik Schumacher, Keenan Crane\n\"Repulsive Surfaces\" (2021)\n\nFor more information, see http://www.cs.cmu.edu/~kmcrane/Projects/RepulsiveSurfaces/index.html",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}