{
  "title": "Investing Lessons from The Bond King",
  "itunes:title": "Investing Lessons from The Bond King",
  "pubDate": "Sun, 10 Apr 2022 15:00:42 +0000",
  "guid": "aa0db16b-c0bf-45c4-b0aa-1db3f9060d80",
  "link": "https://fool.libsyn.com/investing-lessons-from-the-bond-king",
  "itunes:image": "",
  "description": "<p>Beating a market for decades isn’t easy. Mary Childs, author of “The Bond King: How One Man Made a Market, Built an Empire, and Lost It All” joins Ricky Mulvey to talk about PIMCO founder Bill Gross and what retail investors can learn from his story. Childs discusses:<br aria-hidden=\"true\" /> - How Gross traded bonds to beat the market for decades<br aria-hidden=\"true\" /> - Why PIMCO may have “started the party” that led to the Great Recession<br aria-hidden=\"true\" /> - Why Bill Gross was blasting 50 Cent’s music at his neighbor’s house<br aria-hidden=\"true\" /> <br aria-hidden=\"true\" /> Bonus resource!<br aria-hidden=\"true\" /> How to Invest in Bonds - <a id=\"LPlnk196682\" href= \"https://www.fool.com/investing/how-to-invest/bonds/\" target= \"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\" data-linkindex= \"0\">https://www.fool.com/investing/how-to-invest/bonds/</a><br aria-hidden=\"true\" />  <br aria-hidden=\"true\" /> Host: Ricky Mulvey<br aria-hidden=\"true\" /> Guest: Mary Childs<br aria-hidden=\"true\" /> Engineer: Steve Broido, Tim Sparks</p>",
  "content:encoded": "<p>Beating a market for decades isn’t easy. Mary Childs, author of “The Bond King: How One Man Made a Market, Built an Empire, and Lost It All” joins Ricky Mulvey to talk about PIMCO founder Bill Gross and what retail investors can learn from his story. Childs discusses: - How Gross traded bonds to beat the market for decades - Why PIMCO may have “started the party” that led to the Great Recession - Why Bill Gross was blasting 50 Cent’s music at his neighbor’s house  Bonus resource! How to Invest in Bonds - <a id=\"LPlnk196682\" href= \"https://www.fool.com/investing/how-to-invest/bonds/\" target= \"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\" data-linkindex= \"0\">https://www.fool.com/investing/how-to-invest/bonds/</a>   Host: Ricky Mulvey Guest: Mary Childs Engineer: Steve Broido, Tim Sparks</p>",
  "enclosure": "",
  "itunes:duration": "33:00",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Beating a market for decades isn’t easy. Mary Childs, author of “The Bond King: How One Man Made a Market, Built an Empire, and Lost It All” joins Ricky Mulvey to talk about PIMCO founder Bill Gross and what retail investors can learn from his...",
  "itunes:episodeType": "full"
}