{
  "title": "BONUS: &#8220;Strawberry Fair&#8221; by Anthony Newley",
  "link": "https://500songs.com/podcast/bonus-strawberry-fair-by-anthony-newley/",
  "pubDate": "Mon, 24 Aug 2020 06:14:39 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/bonus-strawberry-fair-by-anthony-newley/",
  "description": "This is a special extra episode of the podcast, not one of the \"proper\" five hundred. A book I've written, on the TV series&nbsp;<em>The Strange World of Gurney Slade,&nbsp;</em>has <a href=\"https://obversebooks.co.uk/product/06-gurney-slade/\">just become available for pre-order from Obverse Books</a>, so to publicise that I've done an extra episode, on the pop music career of its star, Anthony Newley. The next normal episode will be up in a day or two. Transcript below the cut.\n\n<strong>Erratum:</strong> In a previous version of this episode, I mentioned, in passing, my understanding that Newley was an alcoholic. This has been strongly questioned by some fans, who took offence at the suggestion, and as it was utterly irrelevant to the point I was making I have deleted those three words rather than cause further offence.\n\n<strong>Transcript</strong>\n\nWelcome to a special bonus episode of A History of Rock Music in 500 Songs. This is not this week's normal episode, which will be up in a couple of days, and nor is it the Patreon bonus episode, which will also be up as normal. This is an extra, full-length episode, on a song which didn't make the list of songs I'm covering.\n\nBut this week, a book I've written has gone on pre-order, and it'll be out on the first of September. That book is on The Strange World of Gurney Slade, a TV show from the very early 1960s. And the star of that show, Anthony Newley, also had a very successful music career in the late fifties and early sixties -- and a career which had a real influence on many people who will be seen in future episodes. So, in order to promote my book, I'm going to talk today about some of Newley's music. If you're not interested in anything that isn't part of my \"official\" five hundred songs, then you can skip this episode, but I promise that other than a brief mention at the end, this is not going to be an advert for my book, but just another episode, about the music career of one of Britain's most interesting stars of the pre-Beatles era. So let's look at \"Strawberry Fair\" by Anthony Newley:\n\n[Excerpt: Anthony Newley, \"Strawberry Fair\"]\n\nAnthony Newley was someone whose career only came about by what would seem at first to be bad luck. Newley was a child in London during the Blitz, the son of an unmarried mother, which had a great deal of stigma to it in those days. When the Blitz hit, he was evacuated, and felt abandoned by his mother. That sense of abandonment increased when his mother married her new boyfriend and moved to Scotland.\n\nAnd then Newley was moved into a second foster home, this one in Morecambe, Lancashire. His foster father during the war was one George Pescud, a music hall performer about whom I can discover nothing else, except that he instilled in Newley a great love of the theatre and of the arts, and that as a result of this Newley started writing music, painting, writing, and, especially, acting.\n\nWhen the war ended, Newley was fourteen, and didn't go back to live with his mother and her new husband, choosing instead to move to London and start living an artistic life.\n\nHe saw an advert in the paper for the Italia Conti stage school, and tried to become a student there. When he found out that he couldn't afford the fees, he found another way in -- he got a job there as an office boy, and his tuition was included in his wages. While there, he became friends with another student, Petula Clark, who would herself go on to stardom with records like “Downtown”.\n\n[Excerpt: Petula Clark, \"Downtown\"]\n\nClark also encouraged him to start singing -- something that would definitely pay off for him later. Apparently, Clark had a crush on Newley, but he wasn't interested in her.\n\nWhile at the school, Newley got cast in a couple of roles in low-budget films, which brought him to the attention of David Lean, who was directing his film adaptation of Oliver Twist, and cast Newley in the role of the Artful Dodger. The film, which featured Alec Guinness, became one of the classics of British cinema, and also starred Diana Dors, with whom Newley started an affair, and who managed to get him a job as a bit player for the Rank Organisation.\n\nFor the next few years, Newley had small roles in films, started a double act with the comedy writer Dick Vosburgh, had a brief spell in the army (very brief -- he was discharged because of his mental health problems), spent a couple of years in rep, shared a flat with Christopher Lee and appeared in a Hammer Horror film -- the usual things that low-level actors do as they slowly work their way up to stardom.\n\nHis most notable appearance was in the West End revue Cranks, which opened in late 1955. A revue, for those who don't know, is a theatrical show that usually mixes comedy sketches and songs (though the term was, confusingly for our purposes, sometimes also used for a bill with several different musical acts). These were very popular in the fifties and sixties, and Cranks was one of the most popular. After its West End run it transferred to Broadway, and Newley was one of the cast members who appeared on the Ed Sullivan Show to promote it, though the Broadway run of the show was not a success like the British one was. It was in Cranks that Newley's singing first came to public attention:\n\n[Excerpt: Anthony Newley, \"Cold Comfort\"]\n\nNewley was starting to get substantial film roles, and it was with the film Idol on Parade that Newley became a star, and became drawn into the world of pop music. In that film, the first film written by the prominent British screenwriter John Antrobus, he played a pop star who was drafted into the British army, as all young men were in Britain in the fifties. The film is usually said to have been inspired by Elvis Presley having been called up, though it was likely that it was also influenced by Terry Dene, a British rock and roll star who had recently been drafted, before having a breakdown and being discharged due to ill health, and who had recorded songs like “Candy Floss”:\n\n[Excerpt: Terry Dene, \"Candy Floss\"]\n\nDene's story must have struck a chord with Newley, who'd had a very similar Army experience, though you couldn't tell that from the film, which was a typical low-budget British comedy.\n\nAs Newley was playing a pop singer, obviously he had to sing some songs in the film, and so he recorded five songs, one of which, “I've Waited So Long”, was released as a single and went to number three in the charts:\n\n[Excerpt: Anthony Newley, \"I've Waited So Long\"]\n\nSomehow, despite Newley being an actor -- and someone who despised a lot of rock and roll music -- he had become a pop star. He won the Variety Club of Great Britain Award for Most Promising Newcomer of 1959, even though he'd been making films since 1946.\n\n\"I've Waited So Long\" was co-written by Jerry Lordan, who wrote \"Apache\", and Len Praverman, but two of the other songs in the film were written by Newley and Joe 'Mr. Piano' Henderson, and this would soon set Newley on the way to a career as a songwriter -- indeed, as the most important singer-songwriter in pre-Beatles British pop music.\n\nHe had seven UK top ten hits, two of them number ones, in the years from 1959 through 61, and he had a few more minor hits after that. Most of those hits were either cover versions of American hits like Lloyd Price's \"Personality\", or were written for him by people like Lionel Bart. One odd example shows where he would go as a music-maker, though. \"Strawberry Fair\" is a traditional folk song, which was collected, and presumably bowdlerised, by the Rev. Sabine Baring-Gould -- the lyrics, about a young woman offering a young man the chance to pluck the cherries from her basket, read as innuendo, and Baring-Gould, who wrote \"Onward Christian Soldiers\", was well known for toning down the lyrics of the folk songs he collected.\n\nNewley rewrote the lyrics under the pseudonym \"Nollie Clapton\":\n\n[Excerpt: Anthony Newley, \"Strawberry Fair\"]\n\nBut Newley was someone who wanted to do *everything*, and did so very well. While he was a pop star, he starred in his own series of TV specials, and then in his own sitcom, The Strange World of Gurney Slade. He starred in the classic British noir film The Small World of Sammy Lee. And he recorded a satirical album with his second wife, Joan Collins, and Peter Sellers, mocking the Government over the Profumo sex scandal:\n\n[Excerpt: Fool Britannia, \"Twelve Randy Men\"]\n\nThat album went top ten, and was co-written by Newley and Leslie Bricusse. Bricusse would go on to collaborate with Newley in writing a series of songs, mostly for musicals, that everyone knows, though many don't realise that Newley was involved in them. Newley mostly wrote the music, while Bricusse mostly wrote lyrics, though both did both. Their first major collaboration was on the play Stop The World, I Want To Get Off!, a semi-autobiographical starring vehicle for Newley, which displayed the life of a selfish womaniser called Littlechap, who would regularly stop the action of the play to monologue at the audience in much the same way as Newley's TV character Gurney Slade.\n\nMuch of Newley's work seems to be trying to be three different things at the same time -- he seems to want to write self-flagellating autobiography about his own selfish and sometimes misogynistic behaviour -- this is a man who would later write a song called \"Oh What a Son of a Bitch I Am\", and mean it -- while also wanting to create work that is formally extraordinary and involves a lot of metafictional and postmodern elements -- *and* at the same time wanting to make all-round family entertainment. For a while, at least, he managed to juggle all three aspects very successfully, and Stop The World, I Want to Get Off! became a massive hit on stage, and was adapted for the cinema once and TV twice.\n\nStop The World introduced two songs that would become standards. \"What Kind of Fool Am I?\" became a big hit for Sammy Davis Jr, and won the Grammy for \"Song of the Year\" at the 1963 Grammy Awards:\n\n[Excerpt: Sammy Davis Jr., \"What Kind of Fool Am I?\"]\n\nDavis also recorded another song from that show, \"Gonna Build a Mountain\", as the B-side, and that too became a standard, recorded by everyone from Matt Monroe to the Monkees:\n\n[Excerpt: The Monkees, \"Gonna Build a Mountain\"]\n\nNewley and Bricusse followed that up with another musical, The Roar of the Greasepaint, The Smell of the Crowd, which again introduced a whole host of famous songs. \"Who Can I Turn To?\" was the big hit at the time, for Tony Bennett, and has since been performed by everyone from Miles Davis to Barbra Streisand, Dusty Springfield to the Temptations:\n\n[Excerpt: Temptations, \"Who Can I Turn To?\"]\n\nBut the song from that musical that is now best known is almost certainly \"Feeling Good\", which you've almost certainly heard in Nina Simone's staggering version:\n\n[Excerpt: Nina Simone, \"Feeling Good\"]\n\nThey also wrote the theme to \"Goldfinger\", with John Barry:\n\n[Excerpt: Shirley Bassey, \"Goldfinger\"]\n\nThat song was one that Bricusse would use in interviews to demonstrate the almost telepathic rapport that he and Newley had – when Barry played them the beginning of the melody, they both instantly sang, without looking at each other, “wider than a mile”. Barry was unimpressed, and luckily for all concerned the rest of the melody wasn't that similar to “Moon River”, and the song became arguably the definitive Bond theme.\n\nBut at the same time that Newley was having this kind of popular success, he was also doing oddities like \"Moogies Bloogies\", a song in which Newley sings about voyeuristically watching women, while Delia Derbyshire backs him with experimental electronic music:\n\n[Excerpt: Delia Derbyshire and Anthony Newley, \"Moogies Bloogies\"]\n\nThat was recorded in 1966, though it wasn't released until much later.\n\nNewley's career was a bizarre one by almost every measure. Possibly the highlight, at least in some senses, was his 1969 film Can Hieronymus Merkin Ever Forget Mercy Humppe and Find True Happiness?\n\n[Excerpt: \"Can Hieronymus Merkin Ever Forget Mercy Humppe and Find True Happiness?\" trailer]\n\nOn one level, that film is a terrible sex comedy of the kind that the British film industry produced far too much of in the late sixties and seventies, featuring people like Bruce Forsyth and with characters named Hieronymus Merkin, Filligree Fondle, and Polyester Poontang. On the other hand, it's a work of postmodern self-commenting autobiography, with Newley co-writing the script, starring as multiple characters, directing, producing, and writing the music. Roger Ebert said it was the first English-language film to attempt the same things that Fellini and Godard had been attempting, which is not something you'd normally expect of a musical featuring Milton Berle and Joan Collins.\n\nThe film has at least four different layers of reality to it, including a film within a film within the film, and it features Newley regularly stepping out of character to talk about the problems with the film. It's a film of his midlife crisis, basically, but where Ebert compares it to Fellini and Godard, I'd say it's closer to Head, 200 Motels, or other similarly indulgent rock films of the era, and it deals with a lot of the same concerns -- God and the Devil, sexual freedom, and the nature of film as a narrative medium.\n\nAll of Newley's career was like that -- a mixture of lowbrow light entertainment and attempts at postmodernist art, both treated by Newley as of equal value, but each being offputting to an audience that might have enjoyed the other. If you want songs and pretty women and dirty jokes, you probably don't want metafictional conversations between the main character of the film and the director, both of whom are the same person. If you want a film that Roger Ebert will compare to Fellini, you probably don't want it to be a musical including a song that starts out as a fairy-tale about a lonely princess named Trampolena Whambang, and ends up with the princess having sex with a donkey:\n\n[Excerpt: Heironymus Merkin soundtrack, \"Princess Trampolena\"]\n\nThe film also was one of the things that led to Newley's breakup with Collins -- she decided that she didn't like the aspects of his character, and his attitudes towards women, the film revealed -- though Newley claimed until his dying day that while the film was inspired by his own life, it wasn't directly autobiographical. Given that the film's main character, in one sequence, talks about his attraction to underage girls, that's probably for the best.\n\n(And Newley did have a deplorable attitude to women generally -- I'm not going into it in detail here, because this podcast is about the work, not the person, but Newley was a thoroughly unpleasant person in many respects.)\n\nHieronymus Merkin was a massive flop, though the critical response to it was far kinder than its reputation suggests. Unfortunately, Joan Collins so detests the film that it's never been available on DVD in the UK, and only sporadically elsewhere -- DVD copies on Amazon currently go for around three hundred pounds.\n\nThat was, largely, the end of Anthony Newley's career as an auteur. It wasn't, though, the end of his career in songwriting. With Leslie Bricusse he wrote the songs that made up the soundtrack of Willie Wonka and the Chocolate Factory -- songs like \"Pure Imagination\":\n\n[Excerpt: Gene Wilder, \"Pure Imagination\"]\n\nThat film also featured \"The Candy Man\", which became a number one hit in a cover version by Sammy Davis Jr:\n\n[Excerpt: Sammy Davis Jr, \"The Candy Man\"]\n\nAfter that, though, Newley didn't have much more success as a songwriter, but by this point his biggest influence on rock and roll music was already very apparent.\n\nDavid Bowie once said \"I never thought I could sing very well, and I used to try on people's voices if they appealed to me. When I was a kid, about fifteen, sixteen, I got into Anthony Newley like crazy, because a couple of things about him -- one, before he came to the States and did the whole Las Vegas thing, he really did bizarre things over here. Now, a television series he did, called the Strange World of Gurney Slade, which was so odd, and off the wall, and I thought, 'I like what this guy's doing, where he's going is really interesting'. And so I started singing songs like him... and so I was writing these really weird Tony Newley type songs, but the lyrics were about, like, lesbians in the army, and cannibals, and paedophiles\"\n\nIf you listen to Bowie's earliest work, it's very, very apparent how much he took from Newley's vocal style in particular:\n\n[Excerpt: David Bowie, \"Rubber Band\"]\n\nThere is a whole vein of British music that usually gets called \"music hall\" when bad critics talk about it, even though it owes nothing to the music that was actually performed in actual music halls. But what it does owe a great deal to is the work of Anthony Newley. One can draw a direct line from him through Davy Jones of the Monkees, Bowie, Syd Barrett, Ray Davies, Ian Dury, Blur... even a performer like John Lydon, someone who would seem worlds away from Newley's showbiz sheen, has far more of his influence in his vocal inflections than most would acknowledge. Every time you hear a singer referred to as \"quintessentially British\", you're probably hearing someone who is either imitating Newley, or imitating someone who was imitating Newley.\n\nNewley is one of the most frustrating figures in the history of popular culture. He was someone who had so much natural talent as an actor, singer, songwriter, and playwright, and so many different ideas, that he didn't work hard enough at any of those things to become as great as he could have been -- there are odd moments of genius scattered throughout his work, but very little one can point to and say \"that is a work worthy of his talents\". His mental and emotional problems caused damage to him and to the people around him, and he spent much of the last half of his career making a living from appearing in Las Vegas and as a regular on Hollywood Squares, and appearing in roles in things like The Garbage Pail Kids Movie -- his last starring role in the cinema.\n\nHe attempted a comeback in the nineties, appearing with his ex-wife Joan Collins in two Noel Coward adaptations on TV, taking the lead role in the hit musical Scrooge, written by his old partner Bricusse, and getting a regular role in East Enders (one of the two most popular soap operas on British TV), but unfortunately he had to quit the East Enders role as he was diagnosed with the cancer that killed him in 1999, aged sixty-seven.\n\nAnyway, if this episode has piqued your interest in Newley, you might want to check out my book on The Strange World of Gurney Slade, which is a TV show that has almost all the best aspects of Newley's work, and which deserves to be regarded as one of the great masterpieces of TV, a series that is equal parts Hancock's Half Hour, The Prisoner, and Waiting for Godot.\n\nYou can order the book from Obverse Books, at obversebooks.co.uk, and I'll provide a link in the show notes. While you're there, check out some of the other books Obverse have put out -- they've published two more of my books and a couple of my short stories, and many of their writers are both friends of mine and some of the best writers around.\n\nI'll be back in a couple of days with the next proper episode.",
  "itunes:subtitle": "This is a special extra episode of the podcast, not one of the proper five hundred. A book Ive written, on the TV series&nbsp;The Strange World of Gurney Slade,&nbsp;has just become available for pre-order from Obverse Books, so to publicise that Ive don",
  "itunes:keywords": "Anthony Newley,bonus episodes,British rock,David Bowie,Ed Sullivan,Jerry Lordan,Peter Sellers,Petula Clark,Terry Dene,the Monkees",
  "itunes:episodeType": "bonus",
  "content:encoded": "This is a special extra episode of the podcast, not one of the \"proper\" five hundred. A book I've written, on the TV series&nbsp;<em>The Strange World of Gurney Slade,&nbsp;</em>has <a href=\"https://obversebooks.co.uk/product/06-gurney-slade/\">just become available for pre-order from Obverse Books</a>, so to publicise that I've done an extra episode, on the pop music career of its star, Anthony Newley. The next normal episode will be up in a day or two. Transcript below the cut.\n\n<strong>Erratum:</strong> In a previous version of this episode, I mentioned, in passing, my understanding that Newley was an alcoholic. This has been strongly questioned by some fans, who took offence at the suggestion, and as it was utterly irrelevant to the point I was making I have deleted those three words rather than cause further offence.\n\n<strong>Transcript</strong>\n\nWelcome to a special bonus episode of A History of Rock Music in 500 Songs. This is not this week's normal episode, which will be up in a couple of days, and nor is it the Patreon bonus episode, which will also be up as normal. This is an extra, full-length episode, on a song which didn't make the list of songs I'm covering.\n\nBut this week, a book I've written has gone on pre-order, and it'll be out on the first of September. That book is on The Strange World of Gurney Slade, a TV show from the very early 1960s. And the star of that show, Anthony Newley, also had a very successful music career in the late fifties and early sixties -- and a career which had a real influence on many people who will be seen in future episodes. So, in order to promote my book, I'm going to talk today about some of Newley's music. If you're not interested in anything that isn't part of my \"official\" five hundred songs, then you can skip this episode, but I promise that other than a brief mention at the end, this is not going to be an advert for my book, but just another episode, about the music career of one of Britain's most interesting stars of the pre-Beatles era. So let's look at \"Strawberry Fair\" by Anthony Newley:\n\n[Excerpt: Anthony Newley, \"Strawberry Fair\"]\n\nAnthony Newley was someone whose career only came about by what would seem at first to be bad luck. Newley was a child in London during the Blitz, the son of an unmarried mother, which had a great deal of stigma to it in those days. When the Blitz hit, he was evacuated, and felt abandoned by his mother. That sense of abandonment increased when his mother married her new boyfriend and moved to Scotland.\n\nAnd then Newley was moved into a second foster home, this one in Morecambe, Lancashire. His foster father during the war was one George Pescud, a music hall performer about whom I can discover nothing else, except that he instilled in Newley a great love of the theatre and of the arts, and that as a result of this Newley started writing music, painting, writing, and, especially, acting.\n\nWhen the war ended, Newley was fourteen, and didn't go back to live with his mother and her new husband, choosing instead to move to London and start living an artistic life.\n\nHe saw an advert in the paper for the Italia Conti stage school, and tried to become a student there. When he found out that he couldn't afford the fees, he found another way in -- he got a job there as an office boy, and his tuition was included in his wages. While there, he became friends with another student, Petula Clark, who would herself go on to stardom with records like “Downtown”.\n\n[Excerpt: Petula Clark, \"Downtown\"]\n\nClark also encouraged him to start singing -- something that would definitely pay off for him later. Apparently, Clark had a crush on Newley, but he wasn't interested in her.\n\nWhile at the school, Newley got cast in a couple of roles in low-budget films, which brought him to the attention of David Lean, who was directing his film adaptation of Oliver Twist, and cast Newley in the role of the Artful Dodger. The film, which featured Alec Guinness, became one of the classics of British cinema, and also starred Diana Dors, with whom Newley started an affair, and who managed to get him a job as a bit player for the Rank Organisation.\n\nFor the next few years, Newley had small roles in films, started a double act with the comedy writer Dick Vosburgh, had a brief spell in the army (very brief -- he was discharged because of his mental health problems), spent a couple of years in rep, shared a flat with Christopher Lee and appeared in a Hammer Horror film -- the usual things that low-level actors do as they slowly work their way up to stardom.\n\nHis most notable appearance was in the West End revue Cranks, which opened in late 1955. A revue, for those who don't know, is a theatrical show that usually mixes comedy sketches and songs (though the term was, confusingly for our purposes, sometimes also used for a bill with several different musical acts). These were very popular in the fifties and sixties, and Cranks was one of the most popular. After its West End run it transferred to Broadway, and Newley was one of the cast members who appeared on the Ed Sullivan Show to promote it, though the Broadway run of the show was not a success like the British one was. It was in Cranks that Newley's singing first came to public attention:\n\n[Excerpt: Anthony Newley, \"Cold Comfort\"]\n\nNewley was starting to get substantial film roles, and it was with the film Idol on Parade that Newley became a star, and became drawn into the world of pop music. In that film, the first film written by the prominent British screenwriter John Antrobus, he played a pop star who was drafted into the British army, as all young men were in Britain in the fifties. The film is usually said to have been inspired by Elvis Presley having been called up, though it was likely that it was also influenced by Terry Dene, a British rock and roll star who had recently been drafted, before having a breakdown and being discharged due to ill health, and who had recorded songs like “Candy Floss”:\n\n[Excerpt: Terry Dene, \"Candy Floss\"]\n\nDene's story must have struck a chord with Newley, who'd had a very similar Army experience, though you couldn't tell that from the film, which was a typical low-budget British comedy.\n\nAs Newley was playing a pop singer, obviously he had to sing some songs in the film, and so he recorded five songs, one of which, “I've Waited So Long”, was released as a single and went to number three in the charts:\n\n[Excerpt: Anthony Newley, \"I've Waited So Long\"]\n\nSomehow, despite Newley being an actor -- and someone who despised a lot of rock and roll music -- he had become a pop star. He won the Variety Club of Great Britain Award for Most Promising Newcomer of 1959, even though he'd been making films since 1946.\n\n\"I've Waited So Long\" was co-written by Jerry Lordan, who wrote \"Apache\", and Len Praverman, but two of the other songs in the film were written by Newley and Joe 'Mr. Piano' Henderson, and this would soon set Newley on the way to a career as a songwriter -- indeed, as the most important singer-songwriter in pre-Beatles British pop music.\n\nHe had seven UK top ten hits, two of them number ones, in the years from 1959 through 61, and he had a few more minor hits after that. Most of those hits were either cover versions of American hits like Lloyd Price's \"Personality\", or were written for him by people like Lionel Bart. One odd example shows where he would go as a music-maker, though. \"Strawberry Fair\" is a traditional folk song, which was collected, and presumably bowdlerised, by the Rev. Sabine Baring-Gould -- the lyrics, about a young woman offering a young man the chance to pluck the cherries from her basket, read as innuendo, and Baring-Gould, who wrote \"Onward Christian Soldiers\", was well known for toning down the lyrics of the folk songs he collected.\n\nNewley rewrote the lyrics under the pseudonym \"Nollie Clapton\":\n\n[Excerpt: Anthony Newley, \"Strawberry Fair\"]\n\nBut Newley was someone who wanted to do *everything*, and did so very well. While he was a pop star, he starred in his own series of TV specials, and then in his own sitcom, The Strange World of Gurney Slade. He starred in the classic British noir film The Small World of Sammy Lee. And he recorded a satirical album with his second wife, Joan Collins, and Peter Sellers, mocking the Government over the Profumo sex scandal:\n\n[Excerpt: Fool Britannia, \"Twelve Randy Men\"]\n\nThat album went top ten, and was co-written by Newley and Leslie Bricusse. Bricusse would go on to collaborate with Newley in writing a series of songs, mostly for musicals, that everyone knows, though many don't realise that Newley was involved in them. Newley mostly wrote the music, while Bricusse mostly wrote lyrics, though both did both. Their first major collaboration was on the play Stop The World, I Want To Get Off!, a semi-autobiographical starring vehicle for Newley, which displayed the life of a selfish womaniser called Littlechap, who would regularly stop the action of the play to monologue at the audience in much the same way as Newley's TV character Gurney Slade.\n\nMuch of Newley's work seems to be trying to be three different things at the same time -- he seems to want to write self-flagellating autobiography about his own selfish and sometimes misogynistic behaviour -- this is a man who would later write a song called \"Oh What a Son of a Bitch I Am\", and mean it -- while also wanting to create work that is formally extraordinary and involves a lot of metafictional and postmodern elements -- *and* at the same time wanting to make all-round family entertainment. For a while, at least, he managed to juggle all three aspects very successfully, and Stop The World, I Want to Get Off! became a massive hit on stage, and was adapted for the cinema once and TV twice.\n\nStop The World introduced two songs that would become standards. \"What Kind of Fool Am I?\" became a big hit for Sammy Davis Jr, and won the Grammy for \"Song of the Year\" at the 1963 Grammy Awards:\n\n[Excerpt: Sammy Davis Jr., \"What Kind of Fool Am I?\"]\n\nDavis also recorded another song from that show, \"Gonna Build a Mountain\", as the B-side, and that too became a standard, recorded by everyone from Matt Monroe to the Monkees:\n\n[Excerpt: The Monkees, \"Gonna Build a Mountain\"]\n\nNewley and Bricusse followed that up with another musical, The Roar of the Greasepaint, The Smell of the Crowd, which again introduced a whole host of famous songs. \"Who Can I Turn To?\" was the big hit at the time, for Tony Bennett, and has since been performed by everyone from Miles Davis to Barbra Streisand, Dusty Springfield to the Temptations:\n\n[Excerpt: Temptations, \"Who Can I Turn To?\"]\n\nBut the song from that musical that is now best known is almost certainly \"Feeling Good\", which you've almost certainly heard in Nina Simone's staggering version:\n\n[Excerpt: Nina Simone, \"Feeling Good\"]\n\nThey also wrote the theme to \"Goldfinger\", with John Barry:\n\n[Excerpt: Shirley Bassey, \"Goldfinger\"]\n\nThat song was one that Bricusse would use in interviews to demonstrate the almost telepathic rapport that he and Newley had – when Barry played them the beginning of the melody, they both instantly sang, without looking at each other, “wider than a mile”. Barry was unimpressed, and luckily for all concerned the rest of the melody wasn't that similar to “Moon River”, and the song became arguably the definitive Bond theme.\n\nBut at the same time that Newley was having this kind of popular success, he was also doing oddities like \"Moogies Bloogies\", a song in which Newley sings about voyeuristically watching women, while Delia Derbyshire backs him with experimental electronic music:\n\n[Excerpt: Delia Derbyshire and Anthony Newley, \"Moogies Bloogies\"]\n\nThat was recorded in 1966, though it wasn't released until much later.\n\nNewley's career was a bizarre one by almost every measure. Possibly the highlight, at least in some senses, was his 1969 film Can Hieronymus Merkin Ever Forget Mercy Humppe and Find True Happiness?\n\n[Excerpt: \"Can Hieronymus Merkin Ever Forget Mercy Humppe and Find True Happiness?\" trailer]\n\nOn one level, that film is a terrible sex comedy of the kind that the British film industry produced far too much of in the late sixties and seventies, featuring people like Bruce Forsyth and with characters named Hieronymus Merkin, Filligree Fondle, and Polyester Poontang. On the other hand, it's a work of postmodern self-commenting autobiography, with Newley co-writing the script, starring as multiple characters, directing, producing, and writing the music. Roger Ebert said it was the first English-language film to attempt the same things that Fellini and Godard had been attempting, which is not something you'd normally expect of a musical featuring Milton Berle and Joan Collins.\n\nThe film has at least four different layers of reality to it, including a film within a film within the film, and it features Newley regularly stepping out of character to talk about the problems with the film. It's a film of his midlife crisis, basically, but where Ebert compares it to Fellini and Godard, I'd say it's closer to Head, 200 Motels, or other similarly indulgent rock films of the era, and it deals with a lot of the same concerns -- God and the Devil, sexual freedom, and the nature of film as a narrative medium.\n\nAll of Newley's career was like that -- a mixture of lowbrow light entertainment and attempts at postmodernist art, both treated by Newley as of equal value, but each being offputting to an audience that might have enjoyed the other. If you want songs and pretty women and dirty jokes, you probably don't want metafictional conversations between the main character of the film and the director, both of whom are the same person. If you want a film that Roger Ebert will compare to Fellini, you probably don't want it to be a musical including a song that starts out as a fairy-tale about a lonely princess named Trampolena Whambang, and ends up with the princess having sex with a donkey:\n\n[Excerpt: Heironymus Merkin soundtrack, \"Princess Trampolena\"]\n\nThe film also was one of the things that led to Newley's breakup with Collins -- she decided that she didn't like the aspects of his character, and his attitudes towards women, the film revealed -- though Newley claimed until his dying day that while the film was inspired by his own life, it wasn't directly autobiographical. Given that the film's main character, in one sequence, talks about his attraction to underage girls, that's probably for the best.\n\n(And Newley did have a deplorable attitude to women generally -- I'm not going into it in detail here, because this podcast is about the work, not the person, but Newley was a thoroughly unpleasant person in many respects.)\n\nHieronymus Merkin was a massive flop, though the critical response to it was far kinder than its reputation suggests. Unfortunately, Joan Collins so detests the film that it's never been available on DVD in the UK, and only sporadically elsewhere -- DVD copies on Amazon currently go for around three hundred pounds.\n\nThat was, largely, the end of Anthony Newley's career as an auteur. It wasn't, though, the end of his career in songwriting. With Leslie Bricusse he wrote the songs that made up the soundtrack of Willie Wonka and the Chocolate Factory -- songs like \"Pure Imagination\":\n\n[Excerpt: Gene Wilder, \"Pure Imagination\"]\n\nThat film also featured \"The Candy Man\", which became a number one hit in a cover version by Sammy Davis Jr:\n\n[Excerpt: Sammy Davis Jr, \"The Candy Man\"]\n\nAfter that, though, Newley didn't have much more success as a songwriter, but by this point his biggest influence on rock and roll music was already very apparent.\n\nDavid Bowie once said \"I never thought I could sing very well, and I used to try on people's voices if they appealed to me. When I was a kid, about fifteen, sixteen, I got into Anthony Newley like crazy, because a couple of things about him -- one, before he came to the States and did the whole Las Vegas thing, he really did bizarre things over here. Now, a television series he did, called the Strange World of Gurney Slade, which was so odd, and off the wall, and I thought, 'I like what this guy's doing, where he's going is really interesting'. And so I started singing songs like him... and so I was writing these really weird Tony Newley type songs, but the lyrics were about, like, lesbians in the army, and cannibals, and paedophiles\"\n\nIf you listen to Bowie's earliest work, it's very, very apparent how much he took from Newley's vocal style in particular:\n\n[Excerpt: David Bowie, \"Rubber Band\"]\n\nThere is a whole vein of British music that usually gets called \"music hall\" when bad critics talk about it, even though it owes nothing to the music that was actually performed in actual music halls. But what it does owe a great deal to is the work of Anthony Newley. One can draw a direct line from him through Davy Jones of the Monkees, Bowie, Syd Barrett, Ray Davies, Ian Dury, Blur... even a performer like John Lydon, someone who would seem worlds away from Newley's showbiz sheen, has far more of his influence in his vocal inflections than most would acknowledge. Every time you hear a singer referred to as \"quintessentially British\", you're probably hearing someone who is either imitating Newley, or imitating someone who was imitating Newley.\n\nNewley is one of the most frustrating figures in the history of popular culture. He was someone who had so much natural talent as an actor, singer, songwriter, and playwright, and so many different ideas, that he didn't work hard enough at any of those things to become as great as he could have been -- there are odd moments of genius scattered throughout his work, but very little one can point to and say \"that is a work worthy of his talents\". His mental and emotional problems caused damage to him and to the people around him, and he spent much of the last half of his career making a living from appearing in Las Vegas and as a regular on Hollywood Squares, and appearing in roles in things like The Garbage Pail Kids Movie -- his last starring role in the cinema.\n\nHe attempted a comeback in the nineties, appearing with his ex-wife Joan Collins in two Noel Coward adaptations on TV, taking the lead role in the hit musical Scrooge, written by his old partner Bricusse, and getting a regular role in East Enders (one of the two most popular soap operas on British TV), but unfortunately he had to quit the East Enders role as he was diagnosed with the cancer that killed him in 1999, aged sixty-seven.\n\nAnyway, if this episode has piqued your interest in Newley, you might want to check out my book on The Strange World of Gurney Slade, which is a TV show that has almost all the best aspects of Newley's work, and which deserves to be regarded as one of the great masterpieces of TV, a series that is equal parts Hancock's Half Hour, The Prisoner, and Waiting for Godot.\n\nYou can order the book from Obverse Books, at obversebooks.co.uk, and I'll provide a link in the show notes. While you're there, check out some of the other books Obverse have put out -- they've published two more of my books and a couple of my short stories, and many of their writers are both friends of mine and some of the best writers around.\n\nI'll be back in a couple of days with the next proper episode.",
  "enclosure": "",
  "itunes:summary": "This is a special extra episode of the podcast, not one of the \"proper\" five hundred. A book I've written, on the TV series&nbsp;The Strange World of Gurney Slade,&nbsp;has just become available for pre-order from Obverse Books, so to publicise that I've done an extra episode, on the pop music career of its star, Anthony Newley. The next normal episode will be up in a day or two. Transcript below the cut.\n\nErratum: In a previous version of this episode, I mentioned, in passing, my understanding that Newley was an alcoholic. This has been strongly questioned by some fans, who took offence at the suggestion, and as it was utterly irrelevant to the point I was making I have deleted those three words rather than cause further offence.\n\nTranscript\n\nWelcome to a special bonus episode of A History of Rock Music in 500 Songs. This is not this week's normal episode, which will be up in a couple of days, and nor is it the Patreon bonus episode, which will also be up as normal. This is an extra, full-length episode, on a song which didn't make the list of songs I'm covering.\n\nBut this week, a book I've written has gone on pre-order, and it'll be out on the first of September. That book is on The Strange World of Gurney Slade, a TV show from the very early 1960s. And the star of that show, Anthony Newley, also had a very successful music career in the late fifties and early sixties -- and a career which had a real influence on many people who will be seen in future episodes. So, in order to promote my book, I'm going to talk today about some of Newley's music. If you're not interested in anything that isn't part of my \"official\" five hundred songs, then you can skip this episode, but I promise that other than a brief mention at the end, this is not going to be an advert for my book, but just another episode, about the music career of one of Britain's most interesting stars of the pre-Beatles era. So let's look at \"Strawberry Fair\" by Anthony Newley:\n\n[Excerpt: Anthony Newley, \"Strawberry Fair\"]\n\nAnthony Newley was someone whose career only came about by what would seem at first to be bad luck. Newley was a child in London during the Blitz, the son of an unmarried mother, which had a great deal of stigma to it in those days. When the Blitz hit, he was evacuated, and felt abandoned by his mother. That sense of abandonment increased when his mother married her new boyfriend and moved to Scotland.\n\nAnd then Newley was moved into a second foster home, this one in Morecambe, Lancashire. His foster father during the war was one George Pescud, a music hall performer about whom I can discover nothing else, except that he instilled in Newley a great love of the theatre and of the arts, and that as a result of this Newley started writing music, painting, writing, and, especially, acting.\n\nWhen the war ended, Newley was fourteen, and didn't go back to live with his mother and her new husband, choosing instead to move to London and start living an artistic life.\n\nHe saw an advert in the paper for the Italia Conti stage school, and tried to become a student there. When he found out that he couldn't afford the fees, he found another way in -- he got a job there as an office boy, and his tuition was included in his wages. While there, he became friends with another student, Petula Clark, who would herself go on to stardom with records like “Downtown”.\n\n[Excerpt: Petula Clark, \"Downtown\"]\n\nClark also encouraged him to start singing -- something that would definitely pay off for him later. Apparently, Clark had a crush on Newley, but he wasn't interested in her.\n\nWhile at the school, Newley got cast in a couple of roles in low-budget films, which brought him to the attention of David Lean, who was directing his film adaptation of Oliver Twist, and cast Newley in the role of the Artful Dodger. The film, which featured Alec Guinness, became one of the classics of British cinema, and also starred Diana Dors, with whom Newley started an affair, and who manage",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "This is a special extra episode of the podcast, not one of the \"proper\" five hundred. A book I've written, on the TV series&nbsp;The Strange World of Gurney Slade,&nbsp;has just become available for pre-order from Obverse Books, so to publicise that I've done an extra episode, on the pop music career of its star, Anthony Newley. The next normal episode will be up in a day or two. Transcript below the cut.\n\nErratum: In a previous version of this episode, I mentioned, in passing, my understanding that Newley was an alcoholic. This has been strongly questioned by some fans, who took offence at the suggestion, and as it was utterly irrelevant to the point I was making I have deleted those three words rather than cause further offence.\n\nTranscript\n\nWelcome to a special bonus episode of A History of Rock Music in 500 Songs. This is not this week's normal episode, which will be up in a couple of days, and nor is it the Patreon bonus episode, which will also be up as normal. This is an extra,",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}