{
  "title": "S14 Ep16: Sasquatch of Lake Superior & Sky Invaders",
  "link": "https://audioboom.com/posts/8098614",
  "itunes:episode": 16,
  "itunes:title": "Sasquatch of Lake Superior & Sky Invaders",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4047,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Dee McCullay is a Canadian born filmmaker, seen on Travel & Escape, Destination America, & TruTV (Paranormal Survivor). He is one of the leading Canadian paranormal documentarians having produced both Television and web series including Dark History. Dee is also a horror filmmaker, his multi-nominated horror films include Fallacious, Border Patrol, & Scars. He is also the Producer Director of the viral hit Sasquatch on Lake Superior I & II.. Dee joins BEYOND the DARKNESS  today to talk about his encounters with Sasquatch and with these aliens from other places and what he thinks they may be....<br>\n<br>\nPLUS:  A brand new Theater  of the Mind that is definitely NSFW or prying ears...Listener Discretion Advised<br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nTrying to solve your own life’s mysteries?  Psychic Source is a 24/7 phone, online chat and video psychic service.  Your first three minutes are free plus it’s only .83 cents a minute for a reading up to 30-minutes. Just mention promo code DARKNESS when you call  1-800-355-9214 or sign up online at psychic source dot com.<br>\n<br>\nDigestive troubles? \tWeight gain?\tLow energy?\tAchy Joints?<br>\nIf you’ve been struggling with any of these, Dr. Steven Gundry says you’re not alone<br>\nAnd he knows the real cause! Watch the free video at <a href=\"http://totalrestore2.com\">totalrestore2.com</a> to find out more!",
  "itunes:summary": "Dee McCullay is a Canadian born filmmaker, seen on Travel & Escape, Destination America, & TruTV (Paranormal Survivor). He is one of the leading Canadian paranormal documentarians having produced both Television and web series including...",
  "pubDate": "Sun, 24 Feb 2019 10:00:00 +0000",
  "guid": "f8a993b9-8fc4-4cef-8978-08f33fea100d",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}