{
  "id": "tag:blogger.com,1999:blog-2957813557601703695.post-4767151459405775608",
  "published": "2022-10-20T14:51:00.000+05:00",
  "updated": "2022-10-20T14:51:41.368+05:00",
  "category": [
    "",
    ""
  ],
  "title": "Builtbyher  Hackathon Winners Receive Seed Funding From UBL in support of LMKT and NICK",
  "content": "<p>Builtbyher&nbsp; Hackathon Winners Receive Seed Funding From UBL in support of LMKT and National Incubation Center Karachi (NICK) to promote Women's Entrepreneurship in Pakistan</p><p><br /></p><p>&nbsp;</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgVhc9llVoYdeIBOF4S3vkOkWFkPffpwt4HiQAJQwo7DnOTJoBeCtHJaDsih7gM8fzwEN_n7qXrpwu8sybFYmN4rZG2kv1yqc_k9A5BC5GxSxll2z0QgFXj-blvF-FWQHYzsrBisDr7RQ6c8YNolTV0ItPwjkFEuHzzzEBYvi7ggox-Sv7Ra0vKEHDf3w/s4096/NICK2.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"Builtbyher  Hackathon Winners Receive Seed Funding From UBL in support of LMKT and National Incubation Center Karachi (NICK)\" border=\"0\" data-original-height=\"2222\" data-original-width=\"4096\" height=\"348\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgVhc9llVoYdeIBOF4S3vkOkWFkPffpwt4HiQAJQwo7DnOTJoBeCtHJaDsih7gM8fzwEN_n7qXrpwu8sybFYmN4rZG2kv1yqc_k9A5BC5GxSxll2z0QgFXj-blvF-FWQHYzsrBisDr7RQ6c8YNolTV0ItPwjkFEuHzzzEBYvi7ggox-Sv7Ra0vKEHDf3w/w640-h348/NICK2.jpg\" width=\"640\" /></a></div><br /><p><br /></p><p>&nbsp;</p><p><br /></p><p>Karachi:-United Bank Limited (UBL) recently collaborated with LMKT and the National Incubation Center, Karachi (NICK) to host the BuiltByHer 3.0 Hackathon. The Hackathon focused on empowering aspiring female entrepreneurs in creating technologies to improve Pakistani women’s economic inclusion, while promoting Science, Technology, Engineering and Mathematics (‘STEM’) education amongst young women.</p><p><br /></p><p>&nbsp;</p><p><br /></p><p>At the event, 13 participating teams pitched innovative solutions driven with the aim of making formal banking accessible and inclusive. The female led teams took the stage and pitched their solutions to a panel of banking and startup industry leaders. The panel included Aliya Ahmed (Head of Digital Channels, UBL), Zohair Saif (Head of Innovation, UBL), Omar Abedin (Project Director, NICK), Sana Shah (Program Manager, NICK) and Faizan Laghari (Managing Director, Bykea). The event was also attended by Sharjeel Shahid, Group Executive-Digital Banking Group, UBL.</p><p><br /></p><p>&nbsp;</p><p><br /></p><p>After an intense round of pitches, the panel of industry experts selected the two submissions that stood out from the rest.&nbsp;</p><p><br /></p><p>&nbsp;</p><p><br /></p><p>• Team Oval 2.0 won the competition. It took home a seed money prize of PKR 750,000/- for their cutting-edge and innovative solution. Using VR technology, the team gave an immersive look into a complete end-to-end banking experience in the metaverse.&nbsp;&nbsp;</p><p><br /></p><p>&nbsp;</p><p><br /></p><p>• Team FromHer from Gilgit Baltistan took home the second prize and winning PKR 350,000/-. Their solution focused on training women from far-flung areas in the use of digital banking channels and financial rights and literacy as a whole.&nbsp;</p><p><br /></p><p>&nbsp;</p><p><br /></p><p>The introduction of such solutions into Pakistan's economic value chain will open up new opportunities for economic growth as more of the under-banked population begins to adapt formal banking solutions.</p><p><br /></p><p>&nbsp;</p><p><br /></p><p>In his address to the audience, chief guest of the event, Mr. Shazad G. Dada, President &amp; CEO, UBL said, “Gender diversity and financial inclusion have always been the top priorities of UBL. We are proud to have sponsored the BuiltByHer Hackathon to support the young women of Pakistan showcase their ideas and talent. As Pakistan’s most progressive and innovative financial institution, we always look forward to participating in initiatives that promote diversity, digital literacy and contribute positively towards the country’s economy.”</p><p><br /></p><p>&nbsp;</p><p><br /></p><p>&nbsp;</p><p><br /></p><p>Mr. Atif Rais Khan, CEO of LMKT, lauded the untiring efforts of all the participants, mentors, and judges for coming together as a collective to create a platform for young women to utilize and showcase their talent. He also shared his excitement about partnering with UBL and said,&nbsp;</p><p><br /></p><p>&nbsp;</p><p><br /></p><p>“Having a banking leader like UBL onboard spearheading the cause for gender inclusion in the economy is an extremely encouraging sign for the country’s future.&nbsp; The role that women play within our society cannot be understated. We must do our absolute best to provide them the opportunities that they deserve.”</p><p><br /></p><p>&nbsp;</p><p><br /></p><p>BuiltByHer Hackathon 3.0 highlighted the potential of both Pakistan’s creative and driven young women and the economic possibilities that can be achieved through technology and collaboration between industry leaders. UBL and LMKT are committed to supporting the development and implementation of the most promising solutions that ensure the impact of women's inclusion in the entrepreneurial landscape of Pakistan.</p><p><br /></p><div class=\"blogger-post-footer\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js\"></script>\n<!-- MobileAds -->\n<ins class=\"adsbygoogle\"\n     style=\"display:inline-block;width:320px;height:50px\"\n     data-ad-client=\"ca-pub-2762820915666464\"\n     data-ad-slot=\"9814557735\"></ins>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Admin",
    "uri": "https://www.blogger.com/profile/00179371387546033311",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}