{
  "title": "S15 Ep44: Supernatural News/Parashare: Bigfoot's Open House Edition",
  "link": "https://audioboom.com/posts/8098479",
  "itunes:episode": 44,
  "itunes:title": "Supernatural News/Parashare: Bigfoot's Open House Edition",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5961,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Darkness Radio is back with Supernatural News ParaShare Bigfoot's Open House Edition!<br>\nListen Free Anytime Here:<br>\n<br>\nWe have Attack of Killer Turtles, Evil Child Ghosts, Nick Groff Investigating Werewolves, Frightening Black Mass sighting, UFO sightings and YOUR great paranormal encounters!<br>\n<br>\nCall and share your paranormal stories with us anytime to be used on future episodes.<br>\n651-300-4977<br>\n<br>\nVisit our shop for exciting paranormal new items, clothes, books and more: <a href=\"https://amazon.com\">https://amazon.com</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !<br>\n<br>\nDo you experience stress?  Or have anxiety…Or chronic pain ...Or have trouble sleeping at least once a week? You’re NOT alone! Feals is a better way to feel better. Our premium CBD will keep your head clear and help you feel your best. Become a member today by going to <a href=\"http://Feals.com/darkness\">Feals.com/darkness</a> and you'll get 50% off your first order with free shipping.",
  "itunes:summary": "Darkness Radio is back with Supernatural News ParaShare Bigfoot's Open House Edition!\nListen Free Anytime Here:\n\nWe have Attack of Killer Turtles, Evil Child Ghosts, Nick Groff Investigating Werewolves, Frightening Black Mass sighting,...",
  "pubDate": "Sat, 30 May 2020 08:00:00 +0000",
  "guid": "f228126b-b954-4b8f-968e-32f93b886baa",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}