{
  "title": "TU53: Complex Trauma and Managing Dysregulation with Guest Robyn Gobbel",
  "link": "https://therapistuncensored.com/episodes/tu53-complex-trauma-and-managing-dysregulation-with-guest-robyn-gobbel/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu53-complex-trauma-and-managing-dysregulation-with-guest-robyn-gobbel",
  "pubDate": "Wed, 17 Jan 2018 11:00:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=5864",
  "description": "Loving someone with cumulative and complex relational injuries can be challenging. Learn to manage the impacted neurobiology and relational wounds. This episode addresses both children and adults with complicated attachment histories and gives ideas about how to manage.\n\nWhether it’s your own history or someone you love, let’s be honest – it can be challenging at times to be in very close relationships when early attachment injuries have been layered and ongoing and unaddressed. Threat and unrepaired relational ruptures are encoded in our biology and our neurological systems.\n\nChild and Family Therapist Robyn Gobbel, LCSW joins co-host Sue Marriott LCSW, CGP for a discussion on complex trauma and the importance of boundaries and depersonalizing, especially as a parent. You’ll learn how to best communicate between your partner and child when things get tense and how best to employ structured nurture and scaffolding in those relationships.\n\nRobyn Gobbel – Robyn is the founder of Central Texas Attachment & Trauma Center and specializes in adoption, attachment, and trauma. She leads webinars for parents and clinicians and will be releasing a new podcast soon! Stay tuned!\n\n Related episodes: Episode 23 Building Grit Through Self-Compassion with Kristen Neff \n\nand Episode 51 Conquer Shame by Understanding the Science Behind the Feeling with Steve Finn\n\n \n\n0:00-15:00\n\nIntroduction\n\nDefining “trauma” and the difficulties in doing so\n\nNeurobiology of trauma\n\nComplex Trauma\n\nTrauma in relationships\n\nGobbel’s interest in trauma\n\nGobbel’s focus on working with children, starting early when individual is in safe family space and setting groundwork for the future\n\n \n\n15:00-30:00\n\nListener question about multigenerational trauma\n\nSelf-compassion, acknowledging complex history\n\nImportance of being able to look back and repair rather than aim to be perfect all the time\n\nWhat happens when one parent/partner is regulated and the other isn’t. If intervention is necessary make sure it’s about compassion rather than accusing the partner of messing up.\n\nWhat Gobbel has learned from working with parents, children and families: When curiosity and compassion open up, ability to repair greatly increases\n\nSteve Finn and moving from shame to guilt; shame is inherent in complex trauma\n\nStructured Nurture and finding the right balance\n\n \n\n30:00-45:00\n\nImportance of ability to depersonalize, particularly as a parent, in order to have delight around your children\n\nUnderstanding and how to best employ “scaffolding” in yourself and with your children\n\nWrap Up\n\n \n\nResources\n\nIt’s Not You But What Happened to You \n\nby Chrisitine Courtois\n\nTreating Complex Trauma a Sequenced Relationship-based Approach\n\nBy Christine Courtois Julian Ford\n\nCreative Therapies for Complex Trauma Helping Children and Families in Foster Care, Kinship Care or Adoption\n\nEdited by Joy Hasler and Anthea Hendry\n\nContact Robyn:\n\nhttp://centraltexasattachmenttrauma.com/\n\nhttps://www.gobbelcounseling.com/\n\nTweet",
  "enclosure": "",
  "itunes:subtitle": "Loving someone with cumulative and complex relational injuries can be challenging. Learn to manage the impacted neurobiology and relational wounds. This episode addresses both children and adults with complicated attachment histories and gives ideas ab...",
  "itunes:summary": "Whether it&apos;s your own history or someone you love, let&apos;s be honest - it can be challenging to be in committed close relationships when early attachment injuries have been layered and ongoing.  Threat and unrepaired ruptures lie in our biology and our neurological systems. This episode addresses both children and adults with complicated attachment histories and gives ideas about how to manage.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "41:04"
}