{
  "title": "Africa's battle with COVID-19",
  "link": "https://audioboom.com/posts/7849173",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1255,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Before the pandemic, Africa was experiencing unprecedented economic growth and poverty reduction. While many economies have faced disruption around the globe, emerging economies face an even tougher challenge because they lack the tools at the disposal of developed countries, whether that be vaccines, macroeconomic liquidity or the ability of the labour market to work from home. <br>\n<br>\n\n</div>\n<div>The global nature of the pandemic requires a global response. This January, Bruegel Director <a href=\"https://www.bruegel.org/author/guntram-b-wolff/\">Guntram Wolff</a> and <a href=\"https://www.bruegel.org/author/vera-songwe/\">Vera Songwe</a>, Executive Secretary of the Economic Commission for Africa were appointed by the Italian G20 Presidency to the High Level Independent Panel on financing the global commons for pandemic preparedness and response, tasked with identifying gaps in the financing system for the global commons for pandemic prevention, surveillance, preparedness and response; and proposing actionable solutions to meet these gaps on a systematic and sustainable basis.<br>\n<br>\n\n</div>\n<div>In this episode of The Sound of Economics, Vera shares her insight on how Africa has been handling the spread of COVID-19 and its economic implications. Together they discuss how to ensure necessary financing available to all, that can ensure that the world is better prepared for the next pandemic. <br>\n<br>\n\n</div>\n",
  "itunes:summary": "How can we ensure a worldwide balanced and inclusive recovery from the Covid pandemic?",
  "pubDate": "Wed, 21 Apr 2021 07:14:50 +0000",
  "guid": "tag:audioboom.com,2021-04-21:/posts/7849173",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}