{
  "title": "Designing the cities of tomorrow",
  "link": "https://news.mit.edu/2022/designing-cities-tomorrow-carlo-ratti-1025",
  "description": "Carlo Ratti investigates how digital technologies transform our urban spaces and how they can be harnessed to design sustainable cities for the future.",
  "pubDate": "Tue, 25 Oct 2022 13:35:00 -0400",
  "guid": "https://news.mit.edu/2022/designing-cities-tomorrow-carlo-ratti-1025",
  "dc:creator": "Daniel de Wolff | MIT Industrial Liaison Program",
  "content:encoded": "<p>Reflecting on the mission and approach of SENSEable City Lab at MIT and his role as its director, Carlo Ratti quotes the Nobel laureate Herbert Simon, who said, “The engineer, and more generally the designer, is concerned with how things ought to be — how they ought to be in order to attain goals, and to function.” Simon was a political scientist and economist, but his groundbreaking research on decision-making within organizations was informed by disparate disciplines including computer science and cognitive science.&nbsp;&nbsp;</p>\n\n<p>Ratti, too, recognizes that, given the scope of his work, relying on the methodologies of a single field would be limiting. Our urban spaces are multifaceted constructions, a complex web of evolving systems, and collaboration between disciplines is essential to make sense of them. “The city is a universe,” says Ratti, a professor of the practice in the MIT Department of Urban Studies and Planning. “It can be viewed through the lens of economics or sociology or architecture and design. But a lab focused on cities truly requires an omni-disciplinary approach.”&nbsp;&nbsp;</p>\n\n<p>Which is why SENSEable City Lab fills its ranks with researchers with diverse specialties. It thrives, in no small part, due to collaborative effort, uniting urban planners and designers with engineers and physicists, systems mathematicians with economists and sociologists. Together they find a common language to engage with each other, industry partners, metropolitan governments, individual citizens, and disadvantaged communities to shape the future.&nbsp;</p>\n\n<p>In 2011, for example, the sharing economy was in full bloom, but offerings like Uber pool (UberXshare), Lyftline (Lyft Shared), and Ola did not yet exist. Nobody had quantified the viability of shared trips for passengers heading in the same direction until Ratti and SENSEable City introduced a novel concept they called “shareability networks” via the HubCab Project. Among other things, this led to the first collaboration between the Institute and Uber. Analyzing the movements of all 13,500 medallion taxis in New York City, they assembled a dataset containing the GPS coordinates of the pickup and drop-off points and corresponding times of over 170 million taxi trips. Subsequently, this dataset helped them develop a new tool that allowed for efficient modeling and optimization of trip-sharing opportunities. Their analysis showed that taxi sharing could reduce the number of trips taken by 40 percent, thereby reducing congestion, energy consumption, and pollution.</p>\n<p>More recently, on the social sustainability front, Ratti and his lab put big data to work on a project they call Proximate. To understand connectivity and how remote work affects innovation, they analyzed the email exchange network at MIT before and after the Institute-wide lockdown due to Covid-19. The endeavor draws on the work of sociologist and Stanford University professor Mark Granovetter, who is perhaps best known for his theory that “weak ties” — looser relationships outside of our core network of friends, family, and colleagues — are crucial bridges between social groups that encourage societal diversity, innovation, and creativity. Ratti’s examination of communications among 2,834 MIT faculty and postdocs showed a clear disintegration of “weak ties” when interactions became purely digital in nature. In other words, digital networks, for all their benefits, cannot replace in-person interactions — not if we hope to continue innovating. “The physical space accommodates and encourages the unexpected, the serendipitous, in a manner that doesn't happen, or hasn’t happened yet, in a virtual setting,” Ratti explains.&nbsp;</p>\n\n<p>And, in an effort to expand the impact of his lab at MIT, Ratti has established a series of satellite labs around the globe. The SENSEable Amsterdam Lab (SAL) is involved in an ongoing collaboration with the Amsterdam Institute for Advanced Metropolitan Solutions to help the Dutch capital become carbon neutral by 2050. The first SAL project is a multifunctional autonomous mobility solution befitting a city with more than 60 miles of canals. The <a href=\"https://roboat.org/\">Roboat</a> platform has the power to transform urban waterways: it can be used to transport people, deliver goods, or for services like waste collection. It could even be used to create on-demand infrastructure, such as a floating bridge or a concert stage.&nbsp;</p>\n\n<p>Meanwhile, in Sweden, through a partnership with KTH Royal Institute of Technology, Ratti and his colleagues are leveraging big data to examine integration and segregation in Stockholm. Their findings: these days people tend to self-segregate by socioeconomic strata whether moving through the city or connecting online, creating what Ratti calls “liminal ghettos.” “These are not the ghettos of the past, but they are insidious, invisible fault lines,” he explains. “Once we understand those fault lines, we can take actions to bridge them so that cities fulfill their primordial function, ensuring that together we are more than each of us individually.”&nbsp;</p>\n\n<p>To effectively run a lab focused on cities requires stepping out of the lab and physically inhabiting urban spaces, says Ratti. But he’s also looking beyond earthbound innovations. In a truly cross-disciplinary effort that demonstrates diversity of thought and creativity, he has begun exploring the feasibility of fabricating and deploying a raft of silicon bubbles roughly the size of Brazil into outer space. The goal: reverse global warming by deflecting solar radiation before it hits our planet. The Space Bubbles project is intended as an emergency intervention should current efforts to reduce emissions fail. Joining him is a team of experts from MIT including Charles Primmerman (MIT Lincoln Laboratory), Professor Daniela Rus (MIT Computer Science and Artificial Intelligence Laboratory), Professor Gareth McKinley (MIT Department of Mechanical Engineering), and Professor Markus Buehler (MIT departments of Mechanical Engineering and Civil and Environmental Engineering).&nbsp;</p>\n\n<p>Emerging technologies like artificial intelligence, combined with the rise of big data, have transformed nearly every aspect of our daily lives and how we interact with each other and our built environment; consider the maturation of the internet of things and its profound effect on urban spaces. In the hands of Carlo Ratti and his SENSEable City Lab at MIT, technological advancements become tools to understand our cities and ourselves, gain new insights, and explore opportunities to redesign the future. “The convergence between the digital and physical world is radically changing the way we can understand and design cities, and ultimately how we can live in urban spaces in a different, better way,” says Ratti.</p>",
  "media:content": {
    "media:description": "“The city is a universe,” says MIT professor of the practice Carlo Ratti. “It can be viewed through the lens of economics or sociology or architecture and design. But a lab focused on cities truly requires an omni-disciplinary approach.”",
    "media:credit": "Photo courtesy of Carlo Ratti Associati."
  },
  "category": [
    "Profile",
    "Faculty",
    "Urban studies and planning",
    "Cities",
    "Transportation",
    "Networks",
    "Communications",
    "Sustainability",
    "Collaboration",
    "Infrastructure",
    "Internet of things",
    "Industry",
    "Design",
    "School of Architecture and Planning",
    "Sensors"
  ]
}