{
  "title": "S14 Ep61: Remembering Rosemary Ellen Guiley",
  "link": "https://audioboom.com/posts/8098569",
  "itunes:episode": 61,
  "itunes:title": "Remembering Rosemary Ellen Guiley",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 7475,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Prolific paranormal author and friend of BEYOND the DARKNESS, Rosemary Ellen Guiley has passed away at the age of 69...<br>\n<br>\nRosemary was a cornerstone in the launch of both Darkness Radio and Darkness Events and we wanted to take today to honor her memory by presenting her very first appearance with us in January of 2006 and her last appearance with us in May of 2018.<br>\n<br>\nRosemary was still producing projects of her own and with other people through her own imprint, Visionary Living up until her passing.  You can check out her catalog at  <a href=\"https://visionarylivingpublishing.com/\">https://visionarylivingpublishing.com/</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.",
  "itunes:summary": "Prolific paranormal author and friend of BEYOND the DARKNESS, Rosemary Ellen Guiley has passed away at the age of 69...\n\nRosemary was a cornerstone in the launch of both Darkness Radio and Darkness Events and we wanted to take today to...",
  "pubDate": "Sat, 27 Jul 2019 08:00:00 +0000",
  "guid": "3c5551fc-40fa-4cf0-ad71-9055ab7da510",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}