{
  "title": "EPISODE 70: John Brown (Part 1): Heartbreak & Slavery",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Fri, 26 Mar 2021 15:40:57 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2021/3/26/episode-70-john-brown-heartbreak-amp-slavery-part-1",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:605dff9b736ce063b918b4a4",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1616773194922-VVJTE5LWFEITK0ZD7A1M/HOF-70-JohnBrown-I.jpg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"HOF-70-JohnBrown-I.jpg\" data-load=\"false\" data-image-id=\"605e004a8621cb3555869ee2\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1616773194922-VVJTE5LWFEITK0ZD7A1M/HOF-70-JohnBrown-I.jpg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“You know what John Brown did? He went to war. He was a white man who went to war against white people to help free slaves. White people call John Brown a nut. Go read the history, go read what all of them say about John Brown. They’re trying to make it look like he was a nut, a fanatic… But they depict him in this image because he was willing to shed blood to free the slaves. And any white man who is ready and willing to shed blood for your freedom… So when you want to know good white folks in history where black people are concerned, go read the history of John Brown.”</em> — Malcolm X&nbsp;</p><p class=\"\"><em>“When a man strikes his male or female slave with a rod so hard the slave dies under his hand, he shall be punished. If, however, the slave survives for a day or two, he is not to be punished, since the slave is his own property.” — </em>Exodus 21:20–21</p><p class=\"\"><em>“Here, before God, in the presence of these witnesses, from this time, I consecrate my life to the destruction of slavery!” —</em> John Brown&nbsp;</p><p class=\"\">The subject of this series is easily one of the most divisive individuals in U.S. history. The man we are talking about is Mr. John Brown. Many, in fact, see Brown’s actions as the spark that ignited the Civil War. He has been described as a civil rights hero, a terrorist, and everything in between. Some have argued he was clinically insane. Others believe he was the most principled man of his age. Regardless of how we interpret his story, certain facts are beyond dispute. Throughout his life, slavery was the law of the land in much of the United States. With hardly any abolitionist willing to do more than use words against slavery, while pro-slavery forces demonstrated they were quite skilled at using violence to further their worldview, it seemed inevitable that slavery would last for the foreseeable future. To John Brown, that was an unacceptable option. Allowing it to continue for one more second was cowardly and evil.&nbsp; If pacifist means weren’t enough to bring about the end of slavery, then John Brown was more than ready to speak the language of violence. For the sake of destroying slavery, he would shed the blood of his enemies, the blood of his family, and his own blood.&nbsp;</p><p class=\"\">In this first episode of a three-part series, we’ll introduce the early part of John Brown’s life and his crusade against slavery. Among today’s topics, we’ll have the ethics of punching a Nazi, how the beating of an enslaved child set Brown on his path, how both pro and anti-slavery forces used Christianity to justify their stances, racism masquerading as philanthropy, the Nat Turner rebellion, grief & PTSD, the Underground Railroad, the murder of Elijah Lovejoy, and much more.&nbsp;</p>",
  "media:content": {
    "media:title": "EPISODE 70: John Brown (Part 1): Heartbreak & Slavery"
  }
}