{
  "title": "#435: Into The Dark (OOTP Chapter 3, The Advance Guard)",
  "link": "https://audioboom.com/posts/7377040",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5390,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Welcome Slug Club member Christina!</li>\n<li>Fandom Happenings: a new Wizarding World app, Mina Lima wallpapers, Lethal White begins filming and Darks Arts shows begin in Orlando!</li>\n<li>We take listener feedback on British \"tea\" and defending Mundungus Fletcher</li>\n<li>Chapter-by-Chapter continues with Harry Potter and the Order of the Phoenix, Chapter 3: The Advance Guard</li>\n<li>7-Word Summary: Tonight the Guard rides into Grimmauld Place</li>\n<li>We discuss Harry's treatment of Hedwig... his only friend at Privet Drive</li>\n<li>Who should Harry be guessing is behind the Howler? Does he even consider Dumbledore?</li>\n<li>Is it odd there is no further communication between Petunia and Harry? What about news on Dudley's condition?</li>\n<li>The child abuse continues: eating through a cat flap and not being able to \"steal\" food from the fridge</li>\n<li>Was Mad-Eye Moody really the best person for Harry to first encounter?</li>\n<li>We discuss the members of the Advance Guard and where else they popped up in the Potter series: Remus Lupin, Mad-Eye Moody, Nymphadora Tonks, Hestia Jones, Sturgis Podmore, Dedalus Diggle, Emmeline Vance, Kingsley Shacklebolt and Elphias Doge</li>\n<li>Moody washes his eye - what are the chances one of the Dursleys drinks that upon their return to Privet Drive?</li>\n<li>We're introduced to Tonks for the first time in the series! Did the movies do her character justice?</li>\n<li>Laura wants to know.. why does Lupin look so ragged all the time?!?</li>\n<li>How ignorant are the Dursleys to think they won a best-kept lawn competition in the middle of a draught? And what's the prize for winning?</li>\n<li>Metamorphmagi: What would we do with this new magical ability?</li>\n<li>Does the Ministry detect magic being done by the Advance Guard while at Privet Drive?</li>\n<li>How do Muggles not see the Advance Guard depart Privet Drive and arrive in Grimmauld Place? What kind of magic is being used, if any?</li>\n<li>We Connect the Threads, give our MVPs of the Week and Rename The Chapter!</li>\n<li>Quizzitch: To what does Fred Weasley equate the concept of time?</li>\n<li>Micah and Eric will be at LeakyCon 2019 from October 11-13 in Boston! <a href=\"https://www.leakycon.com/boston-2019-schedule\">Join us</a> for Podcasting with Potter on October 11, Name That Character on October 12 and MuggleCast Live on October 13! <a href=\"http://www.leakycon.com/muggle\">Register today</a> using code MUGGLE for $10 off!</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Become a member of our community</a> today on Patreon and receive awesome, magical benefits!</li>\n<li>This week's episode is sponsored by <a href=\"http://www.yoursuper.com\">YourSuper</a>. Improve your health with super plants! Get 15% off your order when using code MUGGLECAST at checkout.</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Mon, 23 Sep 2019 19:17:20 +0000",
  "guid": "tag:audioboom.com,2019-09-23:/posts/7377040",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}