{
  "title": "90: Mindfulness, Michael Jordan, and Your Masterpiece Within with George Mumford",
  "pubDate": "Thu, 14 May 2020 17:15:07 +0000",
  "guid": "3d4221ad-2a1f-4c2d-9a24-65a0e5df252e",
  "link": "https://lifeonpurpose.libsyn.com/90-mindfulness-michael-jordan-and-your-masterpiece-within-with-george-mumford",
  "itunes:image": "",
  "description": "<p>My guest for <strong>Life on Purpose Episode #90</strong> is speaker, mindfulness and performance coach, and author <a href= \"https://georgemumford.com\" target=\"_blank\" rel= \"noopener\"><strong>George Mumford</strong></a>, a.k.a. The Mindfulness Performance Whisperer. George is a highly acclaimed expert in sports psychology and performance and NBA Hall of Fame coach Phil Jackson’s ‘Secret Weapon’ to winning eight NBA Championships.</p> <p><strong>George’s</strong> passion is teaching mindfulness to high profile sports, business and academic teams alike; from the Los Angeles Lakers, Chicago Bulls and New York Knicks <em>(he taught Michael Jordan, Kobe Bryant, and many other pro athletes)</em>, to senior global executives and systems. He is the author of <em><strong>The Mindful Athlete: Secrets to Pure Performance</strong></em></p> <p>In our <strong>Life on Purpose </strong>chat, we discussed mindfulness itself and what that means; how we can all deal with all the uncertainty during the COVID-19 pandemic; holding hurt and hope simultaneously; his own inspirational life journey from being one of 13 kids growing up in the rough parts of Boston to heroine addiction to recovery and decades of teaching and speaking about mindfulness; <em>The Last Dance</em> <em>(the new ESPN documentary on Michael Jordan and the Bulls for which he was interviewed);</em> the importance of a practice; the Cherokee tale of the two wolves; his Five Spiritual Superpowers; the concept of a Masterpiece Within each of us; and so much more!</p> <p><strong>About George:</strong></p> <p>Michael Jordan credits <strong>George Mumford</strong> with transforming his on-court leadership of the Bulls, helping Jordan lead the team to six NBA championships. Mumford also helped Kobe Bryant, Shaquille O'Neal, Lamar Odom and countless other NBA players turn around their games.</p> <p>A widely respected public speaker and coach, Mumford is sharing his own story and the strategies that have made these athletes into stars in <em><strong>The Mindful Athlete: The Secret to Pure Performance</strong></em>. His proven, gentle but groundbreaking mindfulness techniques can transform the performance of anyone with a goal, be they an Olympian, weekend warrior, executive, hacker, or artist.</p> <p>With a charismatic teaching style that combines mindfulness techniques with lessons from pop culture icons such as Yoda, Indiana Jones, and Bruce Lee, Mumford tells illuminating stories about his larger than life clients. His writing is down-to-earth and easy to understand.</p> <p><em><strong>The Mindful Athlete</strong></em> is an engrossing story and an invaluable resource for anyone looking to elevate their game, no matter the pursuit.<br /> <br /> ###</p>",
  "content:encoded": "<p>My guest for Life on Purpose Episode #90 is speaker, mindfulness and performance coach, and author <a href= \"https://georgemumford.com\" target=\"_blank\" rel= \"noopener\">George Mumford</a>, a.k.a. The Mindfulness Performance Whisperer. George is a highly acclaimed expert in sports psychology and performance and NBA Hall of Fame coach Phil Jackson’s ‘Secret Weapon’ to winning eight NBA Championships.</p> <p>George’s passion is teaching mindfulness to high profile sports, business and academic teams alike; from the Los Angeles Lakers, Chicago Bulls and New York Knicks <em>(he taught Michael Jordan, Kobe Bryant, and many other pro athletes)</em>, to senior global executives and systems. He is the author of <em>The Mindful Athlete: Secrets to Pure Performance</em></p> <p>In our Life on Purpose chat, we discussed mindfulness itself and what that means; how we can all deal with all the uncertainty during the COVID-19 pandemic; holding hurt and hope simultaneously; his own inspirational life journey from being one of 13 kids growing up in the rough parts of Boston to heroine addiction to recovery and decades of teaching and speaking about mindfulness; <em>The Last Dance</em> <em>(the new ESPN documentary on Michael Jordan and the Bulls for which he was interviewed);</em> the importance of a practice; the Cherokee tale of the two wolves; his Five Spiritual Superpowers; the concept of a Masterpiece Within each of us; and so much more!</p> <p>About George:</p> <p>Michael Jordan credits George Mumford with transforming his on-court leadership of the Bulls, helping Jordan lead the team to six NBA championships. Mumford also helped Kobe Bryant, Shaquille O'Neal, Lamar Odom and countless other NBA players turn around their games.</p> <p>A widely respected public speaker and coach, Mumford is sharing his own story and the strategies that have made these athletes into stars in <em>The Mindful Athlete: The Secret to Pure Performance</em>. His proven, gentle but groundbreaking mindfulness techniques can transform the performance of anyone with a goal, be they an Olympian, weekend warrior, executive, hacker, or artist.</p> <p>With a charismatic teaching style that combines mindfulness techniques with lessons from pop culture icons such as Yoda, Indiana Jones, and Bruce Lee, Mumford tells illuminating stories about his larger than life clients. His writing is down-to-earth and easy to understand.</p> <p><em>The Mindful Athlete</em> is an engrossing story and an invaluable resource for anyone looking to elevate their game, no matter the pursuit.  ###</p>",
  "enclosure": "",
  "itunes:duration": "58:32",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "My guest for Life on Purpose Episode #90 is speaker, mindfulness and performance coach, and author , a.k.a. The Mindfulness Performance Whisperer. George is a highly acclaimed expert in sports psychology and performance and NBA Hall of Fame coach Phil...",
  "itunes:episodeType": "full"
}