{
  "title": "A career in biochemistry unfolds",
  "link": "https://news.mit.edu/2022/career-biochemistry-unfolds-rita-anoh-1101",
  "description": "In an MIT summer research program, Rita Anoh learned about molecular machines and the value of collaborations.",
  "pubDate": "Tue, 01 Nov 2022 13:45:00 -0400",
  "guid": "https://news.mit.edu/2022/career-biochemistry-unfolds-rita-anoh-1101",
  "dc:creator": "Sarah Costello | School of Science",
  "content:encoded": "<p>Rita Anoh's first exposure to college-level research was not something she recognized as a path she could follow. While in high school, the daughter of Anoh’s Advanced Placement biology teacher presented a poster to her class about what she was working on in graduate school. “At the time, actually, it did not click to me what she was presenting,” Anoh laughs. “Because I didn't know that you could do research as such, I just didn't put it together.”</p>\n\n<p>Instead, Anoh traces the start of her journey to science back to her childhood in Ghana, where she enjoyed spending summers assisting in a health clinic run by her grandmother, a nurse. Anoh especially loved the problem-solving and teamwork involved. “Every time, people would leave like, ‘Problem solved!’ or ‘Oh, my problem is not solved, but I know where to go next.’”</p>\n\n<p>Anoh’s enthusiasm for finding solutions to complex problems shifted from medicine to research when she arrived as an undergraduate at Mount Saint Mary’s University (The Mount) in Maryland, and later as a participant in the 2022 Bernard S. and Sophie G. Gould MIT Summer Research Program in Biology (BSG-MSRP-Bio).</p>\n\n<p>As a first-year majoring in biology at The Mount, Anoh applied to a summer research program with the encouragement of Patrick Lombardi, assistant professor of chemistry. She earned an internship to work in his lab exploring how DNA damage in cells is detected and repaired. Then, the summer following her sophomore year, she participated in the Caltech WAVE Fellows program in the lab of Douglas Rees, the Roscoe Gilkey Dickinson Professor of Chemistry, focusing on the structures and mechanisms of complex metalloproteins and integral membrane proteins. Anoh was also awarded a Barry M. Goldwater Scholarship for students intending to pursue research careers in natural science, mathematics, and engineering. “I was the first sophomore to receive at my school, so that was very exciting,” adds Anoh.</p>\n\n<p><strong>“It’s been a blast”</strong></p>\n\n<p>Eager to continue building her science skills and experience a new city, Anoh quickly accepted an offer to join the BSG-MSRP-Bio program at MIT this past summer.</p>\n\n<p>Anoh spent 10 weeks in the lab of assistant professor of biology Joey Davis, whose lab works to uncover how cells construct and degrade complex molecular machines rapidly and efficiently. Anoh also worked with Robert Sauer, the Salvador E. Luria Professor of Biology at MIT, who studies the relationship between protein structure, function, sequence, and folding.&nbsp;</p>\n\n<p>“It’s been a blast,” says Anoh.</p>\n\n<p>Specifically, her project centered on a complex in the cell that helps oversee proteolysis, or the breakdown of proteins into peptides, or strings of amino acids, and further into amino acids for recycling by the cell. Called ClpXP, this molecular machine is made up of two substructures: ClpX and ClpP. First, ClpX identifies and unfolds peptide sequences in the protein substrate to be broken down; then ClpP breaks the unfolded peptides down into smaller fragments.</p>\n\n<p>In her research, Anoh looked at the degradation of a protein RseA by ClpXP bound to another piece of molecular machinery called SspB. This “adapter protein” delivers the targeted protein to ClpXP to begin breaking it down. By degrading RseA, ClpXP plays an essential role in the signaling pathway in bacteria allowing the bacterial cell to respond to stress. Along with her mentor, she examined samples under a cryo‐electron microscope (Cryo-EM) at MIT.nano and collected data to determine its 3D map, shedding light on how ClpXP with the help of SspB breaks down proteins within a cell.</p>\n\n<p>In addition to her gain of technical and research skills, one of Anoh’s takeaways from her summer at MIT was “how collaborative and dynamic science is in general,” she says, especially with mentors such as Alireza Ghanbarpour, a joint postdoc in the Davis and Sauer labs.</p>\n\n<p>“During her time at our lab, she became friends with everyone,” says Ghanbarpour, who mentored Anoh and another undergraduate student whom Anoh befriended. “Rita developed a great relationship with her and, on many occasions, helped her with her project.”</p>\n\n<p>Anoh attended group meetings, lab retreats, and conferences. In MSRP seminars, she heard from MIT researchers about their own experiences solving problems using advice from fellow scientists.</p>\n\n<p>“I talk to my peers about what we're all doing, and how different people at the same lab work together, or how different labs work together,” Anoh says. “I’ve learned different ways to achieve the same goal.”</p>\n\n<p>Ghanbarpour also assisted Anoh in deepening her understanding of the material beyond the bench. Passionate about structural biology and biochemistry, he provided explanations and connected Anoh with materials to expand her knowledge of relevant researchers and concepts. “I was learning not just stuff in the lab but actually the meaning of what I was doing, so that was pretty cool,” she says.</p>\n\n<p>Now in her senior year back at The Mount, Anoh intends to keep an open mind. An open mind, after all, is why she acted on her professor’s suggestion when she was a first-year student to apply to the program that set her on her current path to a research career. Without a doubt, though, Anoh says she plans to pursue a PhD in biochemistry and mentor young researchers like herself along the way.</p>",
  "media:content": {
    "media:description": "Rita Anoh studied a molecular machine called ClpXP in the Bernard S. and Sophie G. Gould MIT Summer Research Program in Biology.",
    "media:credit": "Photo: Steph Stevens"
  },
  "category": [
    "Biology",
    "Students",
    "Undergraduate",
    "MIT.nano",
    "Profile",
    "STEM education",
    "School of Science"
  ]
}