{
  "title": "#494: Reviewing The Gadgets and Gizmos of the Wizarding World",
  "link": "https://audioboom.com/posts/7751085",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4918,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>The hosts are joined by Dave Jorgenson, <a href=\"https://www.tiktok.com/@washingtonpost?lang=en\">Washington Post's TikTok Guy</a>, who's a huge Harry Potter fan and a longtime MuggleCast listener!</li>\n<li>Dave is a long-time listener of MuggleCast and has his finger on the pulse of Harry Potter TikTok trends.</li>\n<li>This week's Main Discussion: The gadgets and gizmos of the Wizarding World</li>\n<li>We ask this of each gadget: How does it work? Is it cool or dumb or dangerous? Also, what would we pay for each?</li>\n<li>Far fewer people are on Team Cool regarding Dumbledore's Put-Outer than you'd expect! And what's up with the change in name to Deluminator?</li>\n<li>Wizards' Chess sets and the Flying Ford Anglia both get passing grades and positive reviews.</li>\n<li>The Monster Book of Monsters and Pocket Sneakoscope fall behind...</li>\n<li>...and the Time Turner also turns some heads!</li>\n<li>Omnioculars, Wormtail's Hand, Decoy Detonators, and Auto-Answer Quill receive mixed feedback...</li>\n<li>...while the Pensieve, Quick Quotes Quill, and Hermione's beaded bag impress everyone!</li>\n<li>Which gadget would you most like to own? Did we leave any out? Send us an e-mail and let us know!</li>\n<li>Quizzitch: After the First Task, what does George hear when Harry opens the Golden Egg?</li>\n<li>Find Dave <a href=\"https://twitter.com/davejorgenson\">on Twitter</a> where he tries to make the world a better place.</li>\n<li>...and check out <a href=\"https://thankyouforspieling.libsyn.com/episode-5-dave-jorgenson-the-tik-tok-prince\">Dave's episode on Eric's new podcast</a> for more info about the TikToks and his history with the fandom!</li>\n<li>This week's episode is sponsored by <a href=\"http://www.meundies.com/mugglecast\">MeUndies</a> (get 15% off your first order at <a href=\"http://MeUndies.com/mugglecast\">MeUndies.com/mugglecast</a>), Quip (get your first refill free at <a href=\"http://www.GetQuip.com/muggle\">GetQuip.com/muggle</a>), and <a href=\"http://www.usualwines.com\">Usual Wines</a> (get your first glass on us by using code 'mugglecast' at checkout)</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 15 Dec 2020 12:00:00 +0000",
  "guid": "tag:audioboom.com,2020-12-14:/posts/7751085",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}