{
  "title": "MADS LEWIS TELLS THE TRUTH ABOUT TAYLER HOLDER — BFFs EP. 97",
  "description": "<p>We are joined by friend of the pod Mads Lewis who comes on for her 2nd BFFs appearance. We discuss her (obviously) never being interested in Josh, her new boyfriend and what people are saying about them, the Columbian connection with Dave's girlfriend, and her reboot of her fan favorite show \"Chicken Girls\"\n\nWe then get into headlines including Ray J saying Kris Jenner and the Kardashian's were directly involved in the creation and release of his and Kim Kardashian's tape, Dixie D'Amelio shaving her head and the ensuing Griffin Johnson response, Dixie and Nailea squashing their beef, Steiny from Nelk sliding into Nessa Barrett's DM's, Queen Elizabeth's passing, Harry Styles spitting on Chris Pine, Charly Jordan responding to Bryce's comments about her and Tayler Holder on BFFs (and some inside info from Mads on the entire situation), Noah Beck agreeing with Andrew Tate and the internet losing their minds over it, Addison Rae's leaked song, Jake Paul fighting Anderson Silva, Austin McBroom's new Social Gloves fight being a massive flop, and Zac Efron revealing why his face looks so different.\n\nWe finish with BFFs corner where Josh had protestors at his UF speaking engagement, O'Malley finding her RNR opponent, and where Dave's watermelon bet came in with the summer nearly over. \n\nSupport Our Sponsors!\nRaising Canes: Get your Cane’s fix fast by ordering through their app or online at RaisingCanes.com\nBetterhelp: Go to BetterHelp.com/BFF for 10% off your first month.\nTakis: Try Takis and face the intensity!\nUpside: Download the FREE Upside App and use promo code bffs to get $5 or more cash back on your first purchase of $10 or more.</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/bffspod\">barstool.link/bffspod</a></p>",
  "guid": "0d2a93d3-c311-4270-aa63-76c2507c4e13",
  "pubDate": "Thu, 15 Sep 2022 00:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/134/Bffs",
  "itunes:explicit": "yes",
  "itunes:duration": "00:49:59",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}