{
  "itunes:episode": 90,
  "title": "Mi Casa Es Su Benincasa with Sara Benincasa",
  "pubDate": "Thu, 11 Sep 2014 15:04:24 +0000",
  "link": "http://newdisrupt.org/2014/9/11/mi-casa-es-su-benincasa-with-sara-benincasa-episode-90",
  "guid": "tag:soundcloud,2010:tracks/167203407",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "00:53:36",
  "description": "<p><a href=\"http://www.sarabenincasa.com/\">Sara Benincasa</a> is an author, comedian, writer, and outspoken advocate of LGBTQ youth, among many other hats she's worn. She is an expert impressionist and parodist of Sarah Palin and Michele Bachmann. Sara is the author of the novel <em><a href=\"http://isbn.nu/9780062222695\">Great</a></em> and the memoir/confessional, <em><a href=\"http:qu//isbn.nu/9780062024428\">Agorafabulous!: Dispatches From My Bedroom</a></em>, and her third book, the novel <em>Believers</em>, is due out in early 2016, while a fourth book is already underway. She's interviewed Reggie Watts and <a href=\"http://www.youtube.com/watch?v=gGTh1JC5sbM&list=PL95E2050EE37977A2&index=6\">Amanda Palmer in her bathtub</a>, and <a href=\"http://instagram.com/p/sQpKFYKsp-/\">posed as a nun</a> with adult performer Stoya. We spoke in person in Seattle when she was visiting during <a href=\"https://www.kickstarter.com/projects/84776478/this-tour-is-so-gay\">This Tour Is So Gay</a>, recently funded on Kickstarter.</p>\n\n<h2>Sponsors and patrons</h2>\n\n<p>This podcast is made possible through the support of sponsors and patrons.</p>\n\n<p><a href=\"http://www.99designs.com/disruptors\">99designs</a>: Have dozens of designers from the over 310,000 that are part of 99designs's network submit ideas for your logo, Web site, T-shirt, car wrap, or other design project, then pick the best and have a finished, professional result in a week or less for a flat price. Our listeners can visit <a href=\"http://www.99designs.com/disruptors\">this special destination page</a> to get $99 Power Pack of services for free!</p>\n\n<p>Thanks also to our Patreon backers Ben Werdmuller, Bryan Clark, and GravityFish for supporting us directly.</p>\n\n<h2>Show notes</h2>\n\n<p>This interview was conducted at <a href=\"http://theoffice.adasbooks.com/\">The Office</a>, a co-working space above <a href=\"http://seattletechnicalbooks.com/\">Ada's Technical Books and Café</a>; the owner, Danielle Hulton, was <a href=\"http://newdisrupt.org/blog/2014/3/20/agile-was-i-ere-i-saw-adas-with-danielle-hulton-episode-67\">a previous guest</a> of the show.</p>\n",
  "itunes:subtitle": "Sara Benincasa is an author, comedian, writer, and outspoken advocate of LGBTQ youth, among many other hats she's worn.",
  "itunes:summary": "Sara Benincasa is an author, comedian, writer, and outspoken advocate of LGBTQ youth, among many other hats she's worn. She is an expert impressionist and parodist of Sarah Palin and Michele Bachmann. Sara is the author of the novel Great and the memoir/confessional, Agorafabulous!: Dispatches From My Bedroom, and her third book, the novel Believers, is due out in early 2016, while a fourth book is already underway. She's interviewed Reggie Watts and Amanda Palmer in her bathtub, and posed as a nun with adult performer Stoya. We spoke in person in Seattle when she was visiting during This Tour Is So Gay, recently funded on Kickstarter.\n\nSponsors and patrons\n\nThis podcast is made possible through the support of sponsors and patrons.\n\n99designs: Have dozens of designers from the over 310,000 that are part of 99designs's network submit ideas for your logo, Web site, T-shirt, car wrap, or other design project, then pick the best and have a finished, professional result in a week or less for a flat price. Our listeners can visit http://www.99designs.com/disruptors to get $99 Power Pack of services for free!\n\nThanks also to our Patreon backers Ben Werdmuller, Bryan Clark, and GravityFish for supporting us directly.\n\nShow notes\n\nThis interview was conducted at The Office, a co-working space above Ada's Technical Books and Café; the owner, Danielle Hulton, was a previous guest of the show."
}