{
  "title": "The Edition: TikTok intifada",
  "link": "https://audioboom.com/posts/7870635",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2022,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s podcast, we talk to James Ball, author of this week’s cover story on the ‘TikTok Intifada’ about the themes he uncovers in his analysis of the impact of social media on the conflict in the Middle East. The conversation with James continues with our next guest, Professor Gabriel Weinmann of Haifa University in Israel, the author of an in-depth report on the rise of incendiary, unregulated material on TikTok. As Arab and Israeli youngsters create and consume violent footage on the app, is it time that it was reined in - or is it a lost cause? </div>\n<div>\n<br>\n'This is a platform that targets young audiences. I would say we have a very young, gullible and naïve, unsuspecting type of audience' - Dr Gabriel Weinmann</div>\n<div> </div>\n<div>Next up, The Spectator’s deputy editor Freddy Gray meets the <em>Financial Times</em>’s Jemima Kelly, to debate the recent lulls and highs of those mercurial currencies, Dogecoin and Bitcoin. Has the cult of Elon Musk, a new clampdown by China and the erratic unpredictability of a boom built largely on hype, memes and hot air, finally put the kibosh on cryptocash?  </div>\n<div> </div>\n<div>'If we talk about bitcoin, there’s really not a difference between bitcoin and dogecoin apart from that fact that one says it’s a joke and one says it's really serious!' Jemima Kelly</div>\n<div> </div>\n<div>And finally - the annual Turner art prize rarely fails to spark a bit of controversy and this year’s nominations have reliably provided. There’s been plenty in the way of debate, but not especially in terms of tangible art. The 2021 shortlist comprises five ‘collectives’, most of whom some of whom have barely touched a paintbrush in their lives, has been announced - and in this week’s magazine, art critic Oliver Basciano argues that the politicisation of the Turner is in danger of sidelining values of aesthetics and free expression. He’s joined by critic and author Hettie Judah, to mull over what, how, and why the radical line-up of nominees have been selected and what this means to the British art world. </div>\n<div> </div>\n<div>‘It’s an atypical year - you talk about people going and making weird and exciting stuff in their bedrooms or studios but we’ve not been able to see much of it this year. So, I mean, are we going to have an exhibition of the most-liked works on Instagram?' - Hettie Judah  </div>\n<div> </div>\n<div>Presented by Cindy Yu<br>\n<br>\n\n</div>\n<div>Produced by Arsalan Mohammad</div>\n",
  "pubDate": "Thu, 20 May 2021 18:26:11 +0000",
  "guid": "tag:audioboom.com,2021-05-20:/posts/7870635",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}