{
  "id": "tag:theatlantic.com,2020:50-610183",
  "content": "<p>“Not quite a cliché, not quite a term of art, a buzzword is a profound-seeming phrase devised by someone important to make something sound better than it is,” my colleague <a href=\"https://www.theatlantic.com/health/archive/2020/02/most-annoying-corporate-buzzwords/606748/?utm_source=feed\">Olga Khazan wrote in February</a>.</p><p>Jargon such as <i>pain points</i> and <i>pushback</i> can be a much-derided feature of many workplaces. Even when so much of the country is working from home, this corporate lingo still grates.</p><p>It’s like ASMR, “but instead of giving you those relaxing tingles, it just makes your skin crawl and puts a chill down your spine,” Heath Barker noted. He’s one of many readers who wrote to us to share their revulsion with corporate-speak—and to catalog the flaws of the words that irked them most. “I can’t stand the word ‘team’ anymore. And screw ‘please advise,’” Adrian Xavier Tristan wrote. “I have nightmares because of low-hanging fruit,” Neha Bawa confessed. “If there is not a suitcase involved, I don’t want to hear UNPACK,” Patrice English declared.</p><p>To pin down the most-universally hated corporate buzzwords, I combed through reader replies on <a href=\"https://www.instagram.com/p/B8zSTlhAJhX/\">Instagram</a>, <a href=\"https://www.facebook.com/TheAtlantic/posts/10158392393598487\">Facebook</a>, and <a href=\"https://twitter.com/TheAtlantic/status/1230314159440527360\">Twitter</a> to compile a comprehensive list of terms and organized them into a <a href=\"https://twitter.com/TheAtlantic/status/1235269322999828487\">March Madness–style Twitter bracket</a>. Every day for the past several weeks, readers have voted in polls pitting the most annoying examples of office-speak against one another. <i>Close the loop</i> faced <i>loop in</i>. <i>Win-win</i> battled <i>buy in</i>. In one of the closest matches, <i>silo</i> claimed a narrow victory over <i>optics</i>.</p><p>But elsewhere, several readers raised a compelling point: What if these words aren’t so bad after all? Some defended their simplicity. “What else are people supposed to say? ‘Let me dial your phone number so we can converse about a relevant work related topic’?” Ryan Freeman asked. That justification made sense to Karlee as well. “It’s an understandable ‘script’ when you need to communicate a meaning quickly and smoothly,” she explained—benefits that are even more important with so many meetings occurring remotely now.</p><p>Others disagreed, and piled buzzword on top of buzzword to call their efficient communication into question. “This is the kind of client-focused, solution-driven content that stakeholders want,” John Boudet wrote. Nathan Freehling took perhaps the deepest dive into corporate lingo: “Gotta tactically evaluate this strategic initiative from 40,000 feet before proving out whether it’s going to upcycle productivity or negatively impact the cross-functional team members that are coordinating the multi-pronged approach to synergizing the year-over-year growth strategy,” he wrote.</p><p>Readers revealed how ridiculous the jargon of office life could be—“‘Interrogate’ the data, like we’re going to torture it into making false confessions,” Lia Maland mused—but also, crucially, how pervasive. “Today I said, ‘outside the box,’” Nancy Farmer admitted. “I don’t know how that happened.” Buzzwords are “probably half of my lexicon,” Angelica Verba wrote. This very pervasiveness may help explain why these terms are so hated. “Like everyone’s loud tipsy uncle,” Khazan noted in her article, “the buzzwords people know best tend to be the ones that irritate them most.”</p><p>After weeks of voting, a winner for our bracket emerged. The phrase coasted through the first two rounds, easily winning over <i>double click</i> and <i>ping</i>. <i>Value proposition</i> offered a strong performance in the finals, but the winner was too formidable an opponent to shake. Ultimately, <i>lean in</i>, a term for grabbing opportunities without hesitation <a href=\"https://www.theatlantic.com/technology/archive/2018/11/facebooks-sheryl-sandberg-leaned-we-just-didnt-like-outcome/576046/?utm_source=feed\">popularized by Sheryl Sandberg</a>, claimed victory as the worst buzzword.</p><p>Despite the fact that few of us are in a physical office these days, videoconferencing apps such as Zoom and Google Hangouts replicate work conversations we would otherwise have in person. Even in these virtual environments, buzzwords persist. So as you listen to your co-workers—and now roommates and partners—communicating with other employees, do be understanding of those not yet indoctrinated. “Don’t mind me,” one <i>Atlantic</i> Twitter follower wrote to us, “just reading through these phrases that I thought were totally innocuous (minus synergy and disrupt) and learning that apparently my coworkers hate me.”</p>",
  "author": {
    "name": "Kate Cray",
    "uri": "http://www.theatlantic.com/author/kate-cray/?utm_source=feed"
  },
  "media:content": {
    "media:credit": "Katie Martin / The Atlantic"
  },
  "title": "Something We Can All Agree On? Corporate Buzzwords Are the Worst.",
  "published": "2020-05-05T12:00:00-04:00",
  "updated": "2020-05-05T12:00:32-04:00",
  "summary": "After publishing an article on office jargon, we asked you for your most loathed examples.",
  "link": ""
}