{
  "title": "Episode 52 (video): Research Design Part 2 - Factorial Designs",
  "pubDate": "Fri, 28 Mar 2008 22:46:10 +0000",
  "guid": "episode-52-research-design-part-2-factorial-des",
  "link": "http://www.thepsychfiles.com/2008/03/28/episode-52-research-design-part-2-factorial-designs/",
  "itunes:image": "",
  "description": "Hang in there!  We're going to delve into a two by two factorial research design.  Sounds dull you say?  Well, I'll try my best to make it kinda fun.  You'll see how more complex research is carried out.  In this case I'll examine the downside to being an attractive person.  And you thought attractive people get all the good stuff in life.  Watch to find out how it can be to your disadvantage to be attractive and along the way learn a bit about research design.",
  "content:encoded": "Hang in there!  We're going to delve into a two by two factorial research design.  Sounds dull you say?  Well, I'll try my best to make it kinda fun.  You'll see how more complex research is carried out.  In this case I'll examine the downside to being an attractive person.  And you thought attractive people get all the good stuff in life.  Watch to find out how it can be to your disadvantage to be attractive and along the way learn a bit about research design.",
  "enclosure": "",
  "itunes:duration": "15:43",
  "itunes:explicit": false,
  "itunes:keywords": "design,IN,psychology,research,methods,factorial,attractiveness",
  "itunes:subtitle": "We're going to delve into a two by two factorial research design. I'll try my best to make it fun. Watch to find out how it can be to your disadvantage to be attractive and along the way learn a bit about research design.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Hang in there! We're going to delve into a two by two factorial research design. Sounds dull you say? Well, I'll try my best to make it kinda fun. You'll see how more complex research is carried out. In this case I'll examine the downside to being an attractive person. And you thought attractive people get all the good stuff in life. Watch to find out how it can be to your disadvantage to be attractive and along the way learn a bit about research design."
}