{
  "title": "Episode 252 - Michael Loynd Interview",
  "itunes:episode": 252,
  "itunes:title": "Episode 252 - Michael Loynd Interview",
  "itunes:episodeType": "full",
  "guid": "eaac89be-1d49-49d1-9085-6771e135c0ad",
  "link": "https://share.transistor.fm/s/d4fdf77a",
  "description": "<p>A special interview coming your way today as we chat with American author and Olympic historian Michael Loynd about his latest book <em>The Watermen </em>and the incredible story of America's first ever Olympic swimming champion Charles Daniels. We find out from Michael just what brought about him taking on board this unique project and why Daniels isn't as well known as he should be. We also find out just why Daniels is such an important figure in not only US swimming but global swimming, and how without him we might not have swimming how it is today. Added to this we learn more about all the obstacles Daniels had to overcome and just what honour this book might lead to the legendary swimmer. It's one hell of an interview that you won't want to miss! So get to listening!</p>",
  "content:encoded": "<p>A special interview coming your way today as we chat with American author and Olympic historian Michael Loynd about his latest book <em>The Watermen </em>and the incredible story of America's first ever Olympic swimming champion Charles Daniels. We find out from Michael just what brought about him taking on board this unique project and why Daniels isn't as well known as he should be. We also find out just why Daniels is such an important figure in not only US swimming but global swimming, and how without him we might not have swimming how it is today. Added to this we learn more about all the obstacles Daniels had to overcome and just what honour this book might lead to the legendary swimmer. It's one hell of an interview that you won't want to miss! So get to listening!</p>",
  "pubDate": "Fri, 10 Jun 2022 09:00:00 +1000",
  "author": "Ben Waterworth",
  "enclosure": "",
  "itunes:author": "Ben Waterworth",
  "itunes:image": "",
  "itunes:duration": 2857,
  "itunes:summary": "A special interview coming your way today as we chat with American author and Olympic historian Michael Loynd about his latest book The Watermen and the incredible story of America's first ever Olympic swimming champion Charles Daniels. We find out from Michael just what brought about him taking on board this unique project and why Daniels isn't as well known as he should be. We also find out just why Daniels is such an important figure in not only US swimming but global swimming, and how without him we might not have swimming how it is today. Added to this we learn more about all the obstacles Daniels had to overcome and just what honour this book might lead to the legendary swimmer. It's one hell of an interview that you won't want to miss! So get to listening!",
  "itunes:subtitle": "A special interview coming your way today as we chat with American author and Olympic historian Michael Loynd about his latest book The Watermen and the incredible story of America's first ever Olympic swimming champion Charles Daniels. We find out from M",
  "itunes:keywords": "olympics, off the podium, comedy, funny, interview, colin hilding, jarrod loobeek, ben waterworth, olympic games, sport, australia, canada",
  "itunes:explicit": "No"
}