{
  "title": "Green transformation: a Polish perspective",
  "link": "https://audioboom.com/posts/7770963",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2108,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Poland is sometimes characterised as the black sheep of EU climate policy: in 2019, more than 70 percent of the country’s electricity was generated by coal. In the meantime, it is closing down coal mines and discussing building a nuclear power plant in order to diversify its energy supplies. What is Poland’s climate policy and how is it evolving? Is the idea of Poland’s characterisation as a scapegoat of the failure of international climate ambitions misleading?<br>\n<br>\n\n</div>\n<div>In this episode of the Sound of Economics, Bruegel's <a href=\"https://www.bruegel.org/author/guntram-b-wolff\">Guntram Wolff</a> and <a href=\"Georg%20Zachmann\">Georg Zachmann</a> are joined by Michał Kurtyka, the Minister of Climate and Environment of Poland and former President of the COP24 in Katowice, considered by many as a climate champion in the country. They discuss current climate policy in Poland, the social impact of decarbonisation, how the EU’s recovery package can help smooth the climate transition, and the future of international climate diplomacy.<br>\n<br>\n\n</div>\n<div>Research mentioned:</div>\n<div>Bergamini, E. and G. Zachmann (2020) ‘<a href=\"https://www.bruegel.org/2020/11/understanding-the-european-unions-regional-potential-in-low-carbon-technologies/\">Understanding the European Union’s regional potential in low-carbon technologies</a>’, Working Paper 07/2020, Bruegel</div>\n<div>Wolff, G. (2020) ‘<a href=\"https://www.bruegel.org/2020/12/europe-should-promote-a-climate-club-after-the-us-elections/\">Europe should promote a Climate Club after the US elections</a>’<br>\n<br>\n\n</div>\n",
  "itunes:summary": "A conversation on green recovery with the Polish Minister of Climate and Environment, Michał Kurtyka",
  "pubDate": "Wed, 13 Jan 2021 14:57:00 +0000",
  "guid": "tag:audioboom.com,2021-01-13:/posts/7770963",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}