{
  "title": "Best AMD Motherboards: Holiday 2022",
  "dc:creator": "Gavin Bonshor",
  "description": " <p align=\"center\"><a href=\"https://www.anandtech.com/show/12072/best-motherboards\"><img src=\"https://images.anandtech.com/doci/12072/20221103_150620_575px.jpg\" alt=\"\" /></a></p><p><p>It has been a busy couple of months for both Intel and AMD, as well as their partner motherboard manufacturers. The release of AMD's latest Ryzen 7000 series processors back in September marked the start of a new era for AMD and its AM5 platform &ndash; although AM4 isn't quite dead yet.</p>\n\n<p>With the launch of Ryzen 7000 and AM5 comes support for DDR5 memory, which provides benefits to performance and gets AMD setup to use what is becoming the current generation of memory for the industry. But unlike Intel's 13th and 12th Gen Core series processors, AMD dropped any support for DDR4 memory, opting to fully focus on next-generation memory and the long-term prospects of the platform. This has meant that users looking to build a Ryzen 7000 system will not be able to recycle any DDR4 memory they already have, and instead will need to buy DDR5 to work with AM5.</p>\n\n<p>Regardless of whether you're looking to build a new system or&nbsp;upgrade an older one, AMD has a wide range of processors to cover all use cases. Its AM4 platform has been a highly successful one for AMD, giving us the likes of Ryzen 1000 (Zen), Ryzen 2000 (Zen+), and even Ryzen 3000 (Zen 2) and Ryzen 5000 (Zen 3). With the launch of Ryzen 7000&nbsp;processors to the market, it has delivered better performance in applications, content creation, rendering, and gaming than it ever has before. So while no longer the new and shiny thing from AMD, AM4 is still a viable platform and will remain so for well into 2023.</p>\n\n<p>Given that AMD is in the midst of this transition, for our latest buyers guide we have opted to split our selections between AM4 and AM5. Despite Ryzen 7000 dominating performance charts, there is still quality and value to be found from AM4, especially at the lower end. So without further adu, here are our picks for AMD motherboards for the 2022 holiday period.</p>\n</p>",
  "link": "https://www.anandtech.com/show/12072/best-motherboards",
  "pubDate": "Thu, 03 Nov 2022 11:30:00 EDT",
  "guid": "tag:www.anandtech.com,12072:news",
  "category": " Motherboards"
}