{
  "title": "A Practical Guide to the Lomb-Scargle Periodogram",
  "link": "",
  "published": "2017-03-30T06:00:00-07:00",
  "updated": "2017-03-30T06:00:00-07:00",
  "author": {
    "name": "Jake VanderPlas"
  },
  "id": "tag:jakevdp.github.io,2017-03-30:blog/2017/03/30/practical-lomb-scargle/",
  "summary": "<p>This week I published the preprint of a manuscript that started as a blog post, but quickly out-grew this medium: <a href=\"http://arxiv.org/abs/1703.09824\">Understanding the Lomb-Scargle Periodogram</a>.</p>\n<table class=\"image\">\n<caption align=\"bottom\" style=\"padding-left: 20px; padding-right:20px; font-size:small\">Figure 24 from <a href=\"http://arxiv.org/abs/1703.09824\">Understanding the Lomb-Scargle Periodogram</a>. The figure shows the true period vs the periodogram peak for a\nsimulated dataset with an observing cadence typical of ground-based optical astronomy.\nThe simulation reveals common patterns of failure of the Lomb-Scargle method that are not\noften discussed explicitly, but are straightforward to explain based on the intuition\ndeveloped in the paper; see Section 7.2 for a detailed discussion.</caption>\n<tr><td><img src=\"/figures/lomb-scargle-failure-modes.png\" alt=\"failure modes\"/></td></tr>\n</table>\n\n<p>Over the last couple years I've written a number of Python implementations of the Lomb-Scargle periodogram (I'd recommend <a href=\"http://docs.astropy.org/en/stable/stats/lombscargle.html\">AstroPy's <code>LombScargle</code></a> in most cases today), and also wrote a <a href=\"/blog/2015/06/13/lomb-scargle-in-python/\">marginally popular blog post</a> and <a href=\"https://arxiv.org/abs/1502.01344\">somewhat pedagogical paper</a> on the subject.\nThis all has led to a steady trickle of emails from students and researchers asking for advice on applying and interpreting the Lomb-Scargle algorithm, particularly for astronomical data.\nI noticed that these queries tended to repeat many of the same questions and express some similar misconceptions, and this paper is my attempt to address those once and for all — in a \"mere\" 55 pages (which includes 26 figures and 4 full pages of references, so it's not all that bad).</p>",
  "category": ""
}