{
  "title": "S13 Ep139: Things Stranger than Fiction",
  "link": "https://audioboom.com/posts/8098636",
  "itunes:episode": 139,
  "itunes:title": "Things Stranger than Fiction",
  "itunes:season": 13,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4247,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS finds light in the dark with Bill Bean as we examine Things Stranger than Fiction!<br>\n<br>\nBill Bean is an exorcist, investigator and experiencer of the darkest aspects of the paranormal. Today he stops by to share some new tales of malevolent forces. <br>\n<br>\nWe also discuss Aliens, Sasquatch and their place in the universe and possible origins.<br>\n<br>\nGet more info on Bill and his books and work at:<br>\n<a href=\"http://www.BillBean.net\">www.BillBean.net</a><br>\n<br>\n<a href=\"http://www.billbeanministries.com\">www.billbeanministries.com</a><br>\n<br>\nSupport our sponsors for great deals! <br>\n<br>\nCheck out Adam and Eve dot com today for this special offer.  Get 50% off one item when you type DARKNESS for the offer code upon checkout.  When you do, you’ll get 3 FREE DVDs, a FREE extra gift and FREE shipping.  Just use offer code DARKNESS at Adam and Eve dot com. That's DARKNESS at Adam and Eve dot com<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nGet 30 Days free on SHUDDER for the best in Horror/Suspense by visiting <a href=\"http://www.Shudder.com/Darkness\">www.Shudder.com/Darkness</a>  and use code DARKNESS at check out to get your first 30 Days Free<br>\n<br>\nPLUTO TV is the leading FREE  streaming television service. NO Credit Card or Sign Up needed! Just visit <a href=\"http://www.PLUTOTV.com\">www.PLUTOTV.com</a> and stream on your devices FREE",
  "itunes:summary": "BEYOND the DARKNESS finds light in the dark with Bill Bean as we examine Things Stranger than Fiction!\n\nBill Bean is an exorcist, investigator and experiencer of the darkest aspects of the paranormal. Today he stops by to share some new...",
  "pubDate": "Sun, 09 Dec 2018 10:00:00 +0000",
  "guid": "ce61ac47-0084-40cb-8338-e3c0c5af595c",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}