{
  "title": "Unlocking the potential of two-point cells for energy-efficient training of deep nets. (arXiv:2211.01950v1 [cs.NE])",
  "link": "http://arxiv.org/abs/2211.01950",
  "description": "<p>Context-sensitive two-point layer 5 pyramidal cells (L5PC) were discovered as\nlong ago as 1999. However, the potential of this discovery to provide useful\nneural computation has yet to be demonstrated. Here we show for the first time\nhow a transformative L5PC-driven deep neural network (DNN), termed the\nmultisensory cooperative computing (MCC) architecture, can effectively process\nlarge amounts of heterogeneous real-world audio-visual (AV) data, using far\nless energy compared to best available `point' neuron-driven DNNs. A novel\nhighly-distributed parallel implementation on a Xilinx UltraScale+ MPSoC device\nestimates energy savings up to $245759 \\times 50000$ $\\mu$J (i.e., $62\\%$ less\nthan the baseline model in a semi-supervised learning setup) where a single\nsynapse consumes $8e^{-5}\\mu$J. In a supervised learning setup, the\nenergy-saving can potentially reach up to 1250x less (per feedforward\ntransmission) than the baseline model. This remarkable performance in pilot\nexperiments demonstrates the embodied neuromorphic intelligence of our proposed\nL5PC based MCC architecture that contextually selects the most salient and\nrelevant information for onward transmission, from overwhelmingly large\nmultimodal information utilised at the early stages of on-chip training. Our\nproposed approach opens new cross-disciplinary avenues for future on-chip DNN\ntraining implementations and posits a radical shift in current neuromorphic\ncomputing paradigms.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Adeel_A/0/1/0/all/0/1\">Ahsan Adeel</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Adetomi_A/0/1/0/all/0/1\">Adewale Adetomi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ahmed_K/0/1/0/all/0/1\">Khubaib Ahmed</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Hussain_A/0/1/0/all/0/1\">Amir Hussain</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Arslan_T/0/1/0/all/0/1\">Tughrul Arslan</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Phillips_W/0/1/0/all/0/1\">W.A. Phillips</a>"
}