{
  "title": "S1E70 - Striving for Balance with Olympic Champion Dominique Moceanu",
  "guid": "https://pinecast.com/guid/568ec7ca-1700-490b-88ad-5e9658709ea7",
  "pubDate": "Thu, 27 Oct 2022 07:30:00 -0000",
  "itunes:duration": "01:17:00",
  "description": "<p>Joining Laura today is Dominique Moceanu, the youngest Olympic gold medalist in US gymnastics history and youngest senior US national all-around champion in history. Dominique was a member of the first US women's gymnastics team to win Olympic gold in 1996, commonly referred to as the ‘Magnificent Seven’ by the media. A nine-time US national team member as well as back-to-back junior and senior all-around national champion, Dominique has been inducted into the USA Gymnastics Hall of Fame and the U.S. Olympic Hall of Fame with her 1996 teammates. But, as life would have it, all that glitter isn’t gold. Even though Dominique made history as a young athlete and achieved astonishing results in her career, that success came with a heavy price. From a toxic sports environment to abusive coaching methods, there were a lot of things happening behind the scenes while Dominique and her teammates were winning medals and making gymnastics history. </p>\n<p>In this episode of the Pursuit of Gold podcast, Dominique opens up about her emotional and challenging journey. First, she tells us about the impact of the abusive sports environment on young athletes and the toll that it takes on their mental health. Then, she walks us through all the events that were leading up to the Olympics, as well as the hardships she endured after the competition. When Dominique finally decided to speak up about her experiences, everything changed for her. She was abandoned by the community and had to find another way to make a living. Fast forward a few years, and she’s now a New York Times best-selling author and an advocate for athletes' rights and protection. Tune into this episode to hear all about her mission to make sports safer for future generations of athletes.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>Dominique’s gymnastics journey</li>\n<li>The mental toll of a toxic sports environment</li>\n<li>The emotional and challenging lead-up to the Olympics</li>\n<li>Discovering your identity as a professional athlete</li>\n<li>Finding the right path post-Olympics</li>\n<li>The incredible power of telling your truth</li>\n<li>The devastating reality of standing up for yourself</li>\n<li>The importance of trust and support in a community</li>\n<li>The sacrifice of speaking up and the consequences of not speaking up</li>\n<li>Teaching young athletes to communicate</li>\n<li>Creating a safe and positive sports culture</li>\n</ul>\n<p>Quotes: </p>\n<ul>\n<li>“Everything went from bright and encouraging and nurturing to all of a sudden, a huge shift of the gym is cold, its environment is stressful. You're constantly humiliated and berated and trying to do things out of fear rather than out of nurture and love. ”</li>\n<li>“You can't be in the right mindset to pull the best out of yourself when you're terrified.”</li>\n<li>“I'm lucky that I made it as far as I did with that kind of intensity. Most teenagers would break. Most teenagers would not be able to handle it.”</li>\n<li>“You know it's wrong, but you can't articulate why. And you're supposed to have the adults advocate for you. ”</li>\n<li>“The mindset with everything going on, it wasn't the place I needed to be to probably be even my best, but it was good enough for gold.”</li>\n<li>“This is not who I am; it's what I do. And I love what I do, and I'm passionate about what I do. But you can't let it become who you are.”</li>\n<li>“Can you live with yourself if you don't do the right thing?”</li>\n<li>“That's what I kept saying to the women who came to me; it's wrong. You have to report it.”</li>\n<li>“It is a personal choice. At the end of the day, you have to be okay with the consequences, and they're not always pretty.”</li>\n</ul>\n<p><a href=\"https://www.kaatsu.com/go/PURSUIT\" rel=\"nofollow\">Pursuit of Gold Podcast is brought to you by Kaatsu Global</a></p>\n<p>Links:\n<a href=\"https://laurawilkinson.com/focus\" rel=\"nofollow\">Get Your Freebie: ‘Five Ways to Stay Focused in a Competition’</a>\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold</a>\n<a href=\"https://www.laurawilkinson.com/journal\" rel=\"nofollow\">The Confidence Journal</a>\n<a href=\"https://laurawilkinson.com/book\" rel=\"nofollow\">Life at 10 Meters: Lessons from an Olympic Champion</a>\n<a href=\"http://laurawilkinson.com/shop\" rel=\"nofollow\">Pursuit of Gold Merch</a></p>\n<p>Laura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura’s Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura’s Facebook</a></p>\n<p>Connect with Dominique:\n<a href=\"https://twitter.com/Dmoceanu\" rel=\"nofollow\">Dominique’s Twitter</a>\n<a href=\"https://www.instagram.com/dominiquemoceanu/\" rel=\"nofollow\">Dominique’s Instagram</a>\n<a href=\"https://www.youtube.com/c/DominiqueMoceanu96\" rel=\"nofollow\">Dominique’s YouTube Channel</a>\n<a href=\"https://www.linkedin.com/in/dominique-moceanu-809b7711/\" rel=\"nofollow\">Dominique’s LinkedIn</a></p>",
  "itunes:title": "Striving for Balance with Olympic Champion Dominique Moceanu",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 70
}