{
  "id": "https://bibleinoneyear.org/en/youth/220",
  "title": "Day 220: Money: A Blessing or a Curse?",
  "description": "Proverbs 19:14–15,17,21–22, 1 Chronicles 26:20,24,26a,27, 1 Corinthians 4:7–14. St Laurence had a profound understanding of the message of Jesus  He understood that the poor are the true *treasures of the church*",
  "pubDate": "Mon, 08 Aug 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/220/",
  "itunes:duration": "12:50",
  "guid": "enyouth08082022-220",
  "length": 770.14,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 220: Money: A Blessing or a Curse?",
  "itunes:subtitle": "Proverbs 19:14–15,17,21–22, 1 Chronicles 26:20,24,26a,27, 1 Corinthians 4:7–14. St Laurence had a profound understanding of the message of Jesus  He understood that the poor are the true *treasures of the church*",
  "itunes:summary": "Laurence was in charge of the finances of the church. He was also a deacon. There was a great revival taking place all around him. It was said that, ‘All of Rome were becoming Christians.’\nAs a result, persecution broke out under the Emperor Valerian in around the year AD 250. Christians who owned property distributed all the church’s money and treasures to the city’s poor.\nValerian ordered all bishops, priests and deacons to be arrested and executed. He offered Laurence a way out if he would show where all the church’s treasures were located.\nLaurence asked for three days to gather it into one central place. He brought together the blind, poor, disabled, sick, elderly, widows and orphans. When Valerian arrived, Laurence flung open the doors and said, ‘These are the treasures of the church!’\nValerian was so angry that he decided beheading was not terrifying enough for Laurence. He ordered that this courageous man be roasted on a gridiron. That is how Laurence died on 10 August AD 258. Apparently, he even joked with his executioners, ‘You may turn me over. I’m done on this side.’ His courage made such an impression that the revival in Rome only increased, with many people becoming Christians including several senators who witnessed his execution.\nSt Laurence had a profound understanding of the message of Jesus. He understood that the poor are the true treasures of the church.\nWhat should our attitude be to the poor? What about the rich? Is poverty a blessing or a curse? Are riches a blessing or a curse? Does the gospel promise prosperity?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 585
}