{
  "title": "Solve business problems end-to-end through machine learning in Amazon SageMaker JumpStart solutions",
  "link": "https://aws.amazon.com/blogs/machine-learning/solve-business-problems-end-to-end-through-machine-learning-in-amazon-sagemaker-jumpstart-solutions/",
  "dc:creator": "Raju Penmatcha",
  "pubDate": "Mon, 31 Oct 2022 20:27:35 +0000",
  "category": [
    "Advanced (300)",
    "Amazon SageMaker",
    "Amazon SageMaker JumpStart"
  ],
  "guid": "3185047239331cd1db7d3308cb98061e7b74c0c1",
  "description": "Amazon SageMaker JumpStart provides pre-trained, open-source models for a wide range of problem types to help you get started with machine learning (ML). JumpStart also provides solution templates that set up infrastructure for common use cases, and executable example notebooks for ML with Amazon SageMaker. As a business user, you get to do the following […]",
  "content:encoded": "<p><a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/studio-jumpstart.html\" target=\"_blank\" rel=\"noopener\">Amazon SageMaker JumpStart</a> provides pre-trained, open-source models for a wide range of problem types to help you get started with machine learning (ML). JumpStart also provides solution templates that set up infrastructure for common use cases, and executable example notebooks for ML with <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/whatis.html\" target=\"_blank\" rel=\"noopener\">Amazon SageMaker</a>.</p> \n<p>As a business user, you get to do the following with JumpStart solutions:</p> \n<ul> \n <li>Explore the solutions and evaluate which are a good match for your business needs.</li> \n <li>Launch solutions with a single click in <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/studio.html\" target=\"_blank\" rel=\"noopener\">Amazon SageMaker Studio</a>. This launches an <a href=\"http://aws.amazon.com/cloudformation\" target=\"_blank\" rel=\"noopener\">AWS CloudFormation</a> template to create the required resources.</li> \n <li>Modify the solution to meet your needs with access to underlying notebook and model assets.</li> \n <li>Delete the acquired resources once done.</li> \n</ul> \n<p>This post focuses on the five ML solutions that were recently added to address five different business challenges. As of this writing, JumpStart offers 23 business solutions varying from detecting fraud in financial transactions to recognizing handwriting. The number of solutions that are offered through JumpStart increase on a regular basis as more solutions are added to it.</p> \n<h2>Solution overview</h2> \n<p>The five new solutions are as follows:</p> \n<ul> \n <li><strong>Price optimization – </strong>Offers customizable ML models to help you make optimal decisions for setting the price of your product or service in order to achieve your business objective, such as maximizing revenue, profit, or other custom metrics.</li> \n <li><strong>Bird species prediction – </strong>Shows how you can train and fine-tune an object detection model. It demonstrates model tuning through training image augmentation, and charts the accuracy improvements that occur across the iterations (epochs) of the training job.</li> \n <li><strong>Lung cancer survival prediction – </strong>Shows how you can feed 2D and 3D radiomic features and patient demographics to an ML algorithm to predict a patient’s lung cancer survival chances. The results from this prediction can help providers take appropriate proactive measures.</li> \n <li><strong>Financial payment classification – </strong>Demonstrates how to train and deploy an ML model to classify financial transactions based on transaction information. You can also use this solution as an intermediate step in fraud detection, personalization, or anomaly detection.</li> \n <li><strong>Churn prediction for mobile phone customers – </strong>Demonstrates how to quickly develop a churn prediction model using a mobile call transaction dataset. This is a simple example for users that are new to ML.</li> \n</ul> \n<h2>Prerequisites</h2> \n<p>To use these solutions, make sure that you have access to Studio with an execution role that allows you to run SageMaker functionality. For your user role within Studio, make sure that the <strong>SageMaker Projects and JumpStart</strong> option is turned on.</p> \n<p>In the following sections, we go through each of the five new solutions and discuss how it works in detail, along with some recommendations on how you can use it for your own business needs.</p> \n<h2>Price optimization</h2> \n<p>Businesses like using various levers to fetch the best results. For example, the price of a product or a service is a lever that a business can control. The question is how to decide what price to set a product or service at, in order to maximize a business objective such as profit or revenue.</p> \n<p>This solution provides customizable ML models to help you make optimal decisions for setting the price of your product or service in order to achieve your objective, such as maximizing revenue, profit, or other custom metrics. The solution uses ML and causal inference approaches to learn price-volume relations from historical data, and is able to make dynamic price recommendations in real time to optimize the custom objective metrics.</p> \n<p>The following screenshot shows the sample input data.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image001.jpg\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-45105\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image001.jpg\" alt=\"\" width=\"936\" height=\"236\"></a></p> \n<p>The solution includes three parts:</p> \n<ul> \n <li><strong>Price elasticity estimation</strong> – This is estimated by causal inference via a double ML algorithm</li> \n <li><strong>Volume forecast</strong> – This is forecasted using the Prophet algorithm</li> \n <li><strong>Price optimization</strong> – This is achieved by a what-if simulation through different price scenarios</li> \n</ul> \n<p>The solution provides the recommended price for the next day for maximizing revenue. In addition, the outputs include the estimated price elasticity, which is a value indicating the effect of price on volume, and a forecast model, which is able to forecast the next day’s volume. The following chart shows how a causal model that incorporated the calculated price elasticity performs much better under a what-if analysis (with large deviations from behavior price) than a predictive model that uses Prophet for forecasting volume using time series data.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image003-1.png\"><img loading=\"lazy\" class=\"wp-image-45120 size-full aligncenter\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image003-1.png\" alt=\"\" width=\"500\" height=\"329\"></a></p> \n<p>You could apply this solution to your business for the following use cases:</p> \n<ul> \n <li>Determine the optimal price of goods for a retail store</li> \n <li>Estimate the effect of discount coupons on customer purchases</li> \n <li>Predict the effect of various incentive methods in any business</li> \n</ul> \n<h2>Bird species prediction</h2> \n<p>There are several computer vision (CV) applications for businesses today. One of those applications is object detection, where an ML algorithm detects the location of an object in an image by drawing a bounding box around it, and identifies the type of object it is. Learning how to apply an object detection model and fine-tune it can be of great value to an organization that has CV needs.</p> \n<p>This solution provides an example of how to translate bounding box specifications when providing images to the SageMaker algorithm. This solution also demonstrates how to improve an object detection model by adding training images that are flipped horizontally (mirror images).</p> \n<p>A notebook is provided for experimenting with object detection challenges when there are a large number of classes (200 bird species). The notebook also shows how to chart the accuracy improvements that occur across the epochs of the training job. The following image shows example images from the birds dataset.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image005.jpg\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-45107\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image005.jpg\" alt=\"\" width=\"977\" height=\"487\"></a></p> \n<p>This solution contains five steps:</p> \n<ol> \n <li>Prepare the data, including download and <code>RecordIO</code> file generation.</li> \n <li>Create and train an object detection model.</li> \n <li>Deploy an endpoint and evaluate model performance.</li> \n <li>Create and train an object detection model again with the expanded dataset.</li> \n <li>Deploy an endpoint and evaluate the expanded model performance.</li> \n</ol> \n<p>You get the following as output:</p> \n<ul> \n <li>Object detection results with bonding boxes against your test image</li> \n <li>A trained object detection model</li> \n <li>A trained object detection model with an additional expanded (flipped) dataset</li> \n <li>Two separate endpoints deployed with one of each model</li> \n</ul> \n<p>The following chart shows model improvement against model iterations (epochs) during training.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image007-1.jpg\"><img loading=\"lazy\" class=\"wp-image-45121 size-full aligncenter\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image007-1.jpg\" alt=\"\" width=\"500\" height=\"344\"></a></p> \n<p>The following examples are output from two test images.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image009-1.jpg\"><img loading=\"lazy\" class=\"wp-image-45122 size-full aligncenter\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image009-1.jpg\" alt=\"\" width=\"500\" height=\"350\"></a></p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image011-1.jpg\"><img loading=\"lazy\" class=\"wp-image-45123 size-full aligncenter\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image011-1.jpg\" alt=\"\" width=\"500\" height=\"376\"></a></p> \n<p>You could apply this solution to your business for the following use cases:</p> \n<ul> \n <li>Detect objects on a conveyer belt in a packaging industry</li> \n <li>Detect toppings on a pizza</li> \n <li>Implement supply chain operational applications that involve object detection</li> \n</ul> \n<h2>Lung cancer survival prediction</h2> \n<p>COVID-19 brought a lot more attention to lung-related medical challenges. It has also put a lot of pressure on hospitals, doctors, nurses, and radiologists. Imagine a possibility where you can apply ML as a powerful tool to assist medical practitioners and help them speed up their work. In this solution, we show how 2D and 3D radiomic features and patient demographics can be fed to an ML algorithm to predict a patient’s lung cancer survival chances. Results from this prediction can help providers take appropriate proactive measures.</p> \n<p>This solution demonstrates how to build a scalable ML pipeline for the Non-Small Cell Lung Cancer (NSCLC) Radiogenomics dataset, which consists of RNA sequencing data, clinical data (reflective of EHR data), and medical images. Using multiple types of data to create a machine model is referred to as <em>multi-modal</em> ML. This solution predicts survival outcome of patients diagnosed with non-small cell lung cancer.</p> \n<p>The following image shows an example of the input data from the Non-Small Cell Lung Cancer (NSCLC) Radiogenomics dataset.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image013.jpg\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-45111\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image013.jpg\" alt=\"\" width=\"977\" height=\"366\"></a></p> \n<p>As part of the solution, total RNA was extracted from the tumor tissue and analyzed with RNA sequencing technology. Although the original data contains more than 22,000 genes, we keep 21 genes from 10 highly coexpressed gene clusters (metagenes) that were identified, validated in publicly available gene-expression cohorts, and correlated with prognosis.</p> \n<p>The clinical records are stored in CSV format. Each row corresponds to a patient, and the columns contain information about the patients, including demographics, tumor stage, and survival status.</p> \n<p>For genomic data, we keep 21 genes from 10 highly coexpressed gene clusters (metagenes) that were identified, validated in publicly available gene-expression cohorts, and correlated with prognosis.</p> \n<p>For medical imaging data, we create patient-level 3D radiomic features that explain the size, shape, and visual attributes of the tumors observed in the CT scans. For each patient study, the following steps are performed:</p> \n<ol> \n <li>Read the 2D DICOM slice files for both the CT scan and tumor segmentation, combine them to 3D volumes, save the volumes in NIfTI format.</li> \n <li>Align CT volume and tumor segmentation so we can focus the computation inside the tumor.</li> \n <li>Compute radiomic features describing the tumor region using the pyradiomics library.</li> \n <li>Extract 120 radiomic features of eight classes, such as statistical representations of the distribution and co-occurrence of the intensity within tumorous region of interest, and shape-based measurements describing the tumor morphologically.</li> \n</ol> \n<p>To create a multi-modal view of a patient for model training, we join the feature vectors from three modalities. We then process the data. First, we normalize the range of independent features using feature scaling. Then we perform principal component analysis (PCA) on the features to reduce the dimensionality and identify the most discriminative features that contribute 95% variance in the data.</p> \n<p>This results in a dimensionality reduction from 215 features down to 45 principal components, which constitute features for the supervised learner.</p> \n<p>The solution produces an ML model that predicts NSCLC patients’ survival status (dead or alive) in a form of probability. Besides the model and prediction, we also generate reports to explain the model. The medical imaging pipeline produces 3D lung CT volumes and tumor segmentation for visualization purposes.</p> \n<p>You can apply this solution to healthcare and life sciences use cases.</p> \n<h2>Financial payment classification</h2> \n<p>Taking all financial transactions of a business or a consumer and organizing them into various categories can be quite helpful. It can help the user learn how much they have spent in which category, and it can also raise alerts when transactions or spending in a given category goes up or down unexpectedly.</p> \n<p>This solution demonstrates how to train and deploy an ML model to classify financial transactions based on transaction information. Many banks provide this as a service to give their end-users an overview of their spending habits. You can also use this solution as an intermediate step in fraud detection, personalization, or anomaly detection. We use SageMaker to train and deploy an XGBoost model with the required underlying infrastructure.</p> \n<p>The synthetic dataset that we to demonstrate this solution has the following features:</p> \n<ul> \n <li><strong>transaction_category</strong> – The category of the transaction, out of the following 19 options: <code>Uncategorized</code>, <code>Entertainment</code>, <code>Education</code>, <code>Shopping</code>, <code>Personal Care</code>, <code>Health and Fitness</code>, <code>Food and Dining</code>, <code>Gifts and Donations</code>, <code>Investments</code>, <code>Bills and Utilities</code>, <code>Auto and Transport</code>, <code>Travel</code>, <code>Fees and Charges</code>, <code>Business Services</code>, <code>Personal Services</code>, <code>Taxes</code>, <code>Gambling</code>, <code>Home</code>, and <code>Pension and insurances</code>.</li> \n <li><strong>receiver_id</strong> – An identifier for the receiving party. The identifier consists of 16 numbers.</li> \n <li><strong>sender_id</strong> – An identifier for the sending party. The identifier consists of 16 numbers.</li> \n <li><strong>amount</strong> – The amount that is transferred.</li> \n <li><strong>timestamp</strong> – The timestamp of the transaction in YYYY-MM-DD HH:MM:SS format.</li> \n</ul> \n<p>The first five observations of the dataset are as follows:</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image015.jpg\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-45112\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image015.jpg\" alt=\"\" width=\"936\" height=\"246\"></a></p> \n<p>For this solution, we use XGBoost, a popular and efficient open-source implementation of the gradient boosted trees algorithm. Gradient boosting is a supervised learning algorithm that attempts to accurately predict a target variable by combining an ensemble of estimates from a set of simpler and weaker models. Its implementation is available in the SageMaker built-in algorithms.</p> \n<p>The financial payment classification solution contains four steps:</p> \n<ol> \n <li>Prepare the data.</li> \n <li>Build a feature store.</li> \n <li>Create and train an XGBoost model.</li> \n <li>Deploy an endpoint and evaluate model performance.</li> \n</ol> \n<p>We get the following output:</p> \n<ul> \n <li>A trained XGBoost model based on our example dataset</li> \n <li>A SageMaker endpoint that can predict the transaction category</li> \n</ul> \n<p>After running this solution, you should see a classification report similar to the following.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image017.jpg\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-45113\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image017.jpg\" alt=\"\" width=\"1298\" height=\"822\"></a></p> \n<p>Possible applications for your business include the following:</p> \n<ul> \n <li>Various financial applications in retail and investment banking</li> \n <li>When transactions need to be classified in any use case (not just financial)</li> \n</ul> \n<h2>Churn prediction for mobile phone customers</h2> \n<p>Predicting customer churn is a very common business need. Numerous studies show that the cost of retaining an existing customer is much less than acquiring a new customer. The challenge often comes from businesses having a tough time understanding why a customer is churning, or building a model that predicts churning.</p> \n<p>In this example, users that are new to ML can experience how a churn prediction model can be quickly developed using a mobile call transaction dataset. This solution uses SageMaker to train and deploy an XGBoost model on a customer profile dataset to predict whether a customer is likely to leave a mobile phone operator.</p> \n<p>The dataset this solution uses is publicly available and is mentioned in the book Discovering Knowledge in Data by Daniel T. Larose. It is attributed by the author to the University of California Irvine Repository of Machine Learning Datasets.</p> \n<p>This dataset uses the following 21 attributes to describe the profile of a customer of an unknown US mobile operator.</p> \n<ul> \n <li>State: the US state in which the customer resides, indicated by a two-letter abbreviation; for example, OH or NJ</li> \n <li>Account Length: the number of days that this account has been active</li> \n <li>Area Code: the three-digit area code of the corresponding customer’s phone number</li> \n <li>Phone: the remaining seven-digit phone number</li> \n <li>Int’l Plan: whether the customer has an international calling plan: yes/no</li> \n <li>VMail Plan: whether the customer has a voice mail feature: yes/no</li> \n <li>VMail Message: the average number of voice mail messages per month</li> \n <li>Day Mins: the total number of calling minutes used during the day</li> \n <li>Day Calls: the total number of calls placed during the day</li> \n <li>Day Charge: the billed cost of daytime calls</li> \n <li>Eve Mins, Eve Calls, Eve Charge: the billed cost for calls placed during the evening</li> \n <li>Night Mins, Night Calls, Night Charge: the billed cost for calls placed during nighttime</li> \n <li>Intl Mins, Intl Calls, Intl Charge: the billed cost for international calls</li> \n <li>CustServ Calls: the number of calls placed to Customer Service</li> \n <li>Churn?: whether the customer left the service: true/false</li> \n</ul> \n<p>This solution contains three stages:</p> \n<ol> \n <li>Prepare the data.</li> \n <li>Create and train an XGBoost model.</li> \n <li>Deploy an endpoint and evaluate model performance.</li> \n</ol> \n<p>We get the following output:</p> \n<ul> \n <li>A trained XGBoost model based on our example dataset to predict user churn</li> \n <li>A SageMaker endpoint that can predict user churn</li> \n</ul> \n<p>This model helps estimate how many of the 5,000 mobile phone customers are likely to stop using their current mobile phone operator.</p> \n<p>The following chart shows a probability distribution of the churn as an output from the model.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image019-1.jpg\"><img loading=\"lazy\" class=\"wp-image-45124 size-full aligncenter\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image019-1.jpg\" alt=\"\" width=\"500\" height=\"337\"></a></p> \n<p>You could apply this to your business for the following use cases:</p> \n<ul> \n <li>Predict customer churn in your own business</li> \n <li>Classify which customers may open your marketing email and who will not (binary classification)</li> \n <li>Predict which students are likely to drop out from a course</li> \n</ul> \n<h2>Clean up resources</h2> \n<p>After you’re done running a solution in JumpStart, make sure to choose <strong>Delete all resources</strong> so all the resources that you have created in the process are deleted and your billing is stopped.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image021.png\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-45115\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/ml-12002-image021.png\" alt=\"\" width=\"1246\" height=\"336\"></a></p> \n<h2>Summary</h2> \n<p>This post showed you how to solve various business problems by applying ML, based on JumpStart solutions. Although this post focused on the five new solutions that were recently added to JumpStart, there are a total of 23 available solutions. We encourage you to log in to Studio and look at the JumpStart solutions yourselves and start deriving immediate value out of them. For more information, refer to <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/studio.html\" target=\"_blank\" rel=\"noopener\">Amazon SageMaker Studio</a> and <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/studio-jumpstart.html\" target=\"_blank\" rel=\"noopener\">SageMaker JumpStart</a>.</p> \n<p>Note: If you don’t see all of the above five solutions in the JumpStart console of your AWS region, please wait for a week and check again. We are releasing them to various regions in a phased manner.</p> \n<hr> \n<h3>About the Authors</h3> \n<p style=\"clear: both\"><strong><a href=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/Raju.jpg\"><img loading=\"lazy\" class=\"size-full wp-image-45116 alignleft\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/Raju.jpg\" alt=\"\" width=\"100\" height=\"100\"></a> Dr. Raju Penmatcha</strong> is an AI/ML Specialist Solutions Architect in AI Platforms at AWS. He works on the low-code/no-code suite of services in SageMaker that help customers easily build and deploy machine learning models and solutions. When not helping customers, he likes traveling to new places.</p> \n<p style=\"clear: both\"><strong><a href=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/manan-shah.jpg\"><img loading=\"lazy\" class=\"size-full wp-image-45104 alignleft\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/manan-shah.jpg\" alt=\"\" width=\"100\" height=\"134\"></a>Manan Shah</strong> is a Software Development Manager at Amazon Web Services. He is an ML enthusiast and focuses on building no-code/low-code AI/ML products. He strives to empower other talented, technical people to build great software.</p>"
}