{
  "id": "yt:video:1lPl80AqMDU",
  "yt:videoId": "1lPl80AqMDU",
  "yt:channelId": "UCZWlSUNDvCCS1hBiXV0zKcA",
  "title": "The DEI Disaster",
  "link": "",
  "author": {
    "name": "PragerU",
    "uri": "https://www.youtube.com/channel/UCZWlSUNDvCCS1hBiXV0zKcA"
  },
  "published": "2022-10-31T19:00:10+00:00",
  "updated": "2022-11-01T22:41:22+00:00",
  "media:group": {
    "media:title": "The DEI Disaster",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Twenty years ago, if you asked someone which of the world’s countries was the most diverse, most equitable and most inclusive, they would have answered “the United States.” Not anymore. What changed? Christian Watson, host of Pensive Politics, has the surprising answer.\n\nLearn more about Christian Watson and watch Pensive Politics here: https://www.youtube.com/c/ChristianWatson/videos\n\n#dei #diversity #equity #prageru \n\nSUBSCRIBE 👉 https://www.prageru.com/join\n\nScript:\n\nTwenty or fifty or even a hundred years ago, if you asked someone which of the world’s countries was the most diverse, most equitable, and most inclusive, they would have almost certainly answered “the United States.”\n\nNot anymore.\n\nWhat changed?\n\nWell, nothing… and everything.  \n\nNothing in the sense that America is still the opportunity-rich place it’s always been.\n\nAnd everything because the progressive left has hijacked those three words—diversity, equity, and inclusion—and turned them into weapons of mass destruction. This DEI trio makes up the neutron bomb that has laid waste to a good part of our educational and corporate institutions.\n\nGiven the damage that has been done, it might be a good idea to see what these words used to mean and what they mean now.\n\nDiversity used to mean that people of different backgrounds were free to join a group or association. \n\nEquity used to mean enforcing equal standards for all individuals and groups. \n\nInclusion used to mean allowing people of every background and identity to participate in a group or association.\n\nNow, in their DEI context, these words all mean one thing: applying unequal standards to ensure preferential outcomes for individuals and groups based on race, sex, and gender identity.\n\nThe DEI movement is not about a sincere desire to make educational or corporate institutions more diverse, more equitable, or more inclusive. \n\nIf you don’t believe me, try having an open discussion on your company message board or at your next DEI seminar about why the same standards should apply to everyone, everywhere, regardless of race, sex, or gender identity. \n\nTry that and you know what will happen: You’ll be shouted down, shunned, reprimanded, and maybe fired.\n\nDEI is ultimately about only one thing: advancing those who are not white, heterosexual, and male at the expense of white, heterosexual men, regardless of their respective qualifications.\n\nIf you say, well, that’s fine because white, heterosexual men had too many advantages for too long, then I would ask: What about all the women, gays, blacks, and Latinos who were born into privilege? Should they be recipients of special DEI preferences? \n\nAnd when do we know we’ve reached a DEI endpoint? When do we know that everything is finally diverse, equitable and inclusive?\n\nThere are no good answers to any of these questions. That’s a feature, not a bug of the DEI racket.  America will never be able to DEI its way out of its DEI “problem.” It’s the pot of gold at the end of the rainbow. You never reach your goal because it doesn’t exist. You’ll never quite be diverse enough, equitable enough or inclusive enough.\n\nThe DEI obsession has been great for one group of people and one group only: The lavishly paid DEI administrators at every Fortune 100 company, college, and university; and all those who work under them.\n\nCorporations now pay millions upon millions of dollars to so-called DEI experts to spread division and distrust among their own employees. It may be the single most non-productive, self-destructive thing a business can do to itself. But businesses, to their everlasting shame, are doing it anyway.\n\nThey think they’re trapped. If they don’t set up a DEI office, that proves their company is racist, sexist and homophobic. But if they do set up a DEI office, that proves their company is racist, sexist and homophobic. Or why else did they set up a DEI office in the first place?\n\nHeads DEI wins, tails you lose.\n\nFor the full script, visit: https://www.prageru.com/video/the-dei-disaster",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}