{
  "title": "Two first-year students named Rise Global Winners for 2022",
  "link": "https://news.mit.edu/2022/two-first-year-students-named-rise-global-winners-1026",
  "description": "Now in its second year, the Rise program targets exceptional teenage scholars from around the world for their potential as future change-makers.",
  "pubDate": "Wed, 26 Oct 2022 14:35:00 -0400",
  "guid": "https://news.mit.edu/2022/two-first-year-students-named-rise-global-winners-1026",
  "dc:creator": "Elizabeth Durant | Office of the Vice Chancellor",
  "content:encoded": "<p>In 2019, former Google CEO Eric Schmidt and his wife, Wendy, launched a <a href=\"https://www.risefortheworld.org/news/eric-and-wendy-schmidt-announce-new-usd1-billion-philanthropic-commitment-to\">$1 billion philanthropic commitment</a> to identify global talent. Part of that effort is the <a href=\"https://www.risefortheworld.org/\">Rise</a> initiative, which selects 100 young scholars, ages 15-17, from around the world who show unusual promise and a drive to serve others. This year’s cohort of 100 Rise Global Winners includes two MIT first-year students, Jacqueline Prawira and Safiya Sankari.</p>\n\n<p>Rise intentionally targets younger-aged students and focuses on identifying what the program terms “hidden brilliance” in any form, anywhere in the world, whether it be in a high school or a refugee camp. Another defining aspect of the program is that Rise winners receive sustained support — not just in secondary school, but throughout their lives.</p>\n\n<p>“We believe that the answers to the world’s toughest problems lie in the imagination of the world's brightest minds. Rise is an integral part of our mission to create the best, largest, and most enduring pipeline of exceptional talent globally and match it to opportunities to serve others for life,” says Eric Braverman, CEO of <a href=\"https://www.schmidtfutures.com/\">Schmidt Futures</a>, which manages Rise along with the <a href=\"https://www.rhodeshouse.ox.ac.uk/\">Rhodes Trust</a>.</p>\n\n<p>The Rise program creates this enduring pipeline by providing a lifetime of benefits, including funding, programming, and mentoring opportunities. These resources can be tailored to each person as they evolve throughout their career. In addition to a four-year college scholarship, winners receive mentoring and career services; networking opportunities with other Rise recipients and partner organizations; technical equipment such as laptops or tablets; courses on topics like leadership and human-centered design; and opportunities to apply for graduate scholarships and for funding throughout their careers to support their innovative ideas, such as grants or seed money to start a social enterprise.</p>\n\n<p>Prawira and Sankari’s winning service projects focus on global sustainability and global medical access, respectively. Prawira invented a way to use upcycled fish-scale waste to absorb heavy metals in wastewater. She first started experimenting with fish-scale waste in middle school to try to find a bio-based alternative to plastic. More recently, she discovered that the calcium salts and collagen in fish scales can absorb up to 82 percent of heavy metals from water, and 91 percent if an electric current is passed through the water. Her work has global implications for treating contaminated water at wastewater plants and in developing countries.</p>\n\n<p>Prawira published her research in 2021 and has won awards from the U.S. Environmental Protection Agency and several other organizations. She’s planning to major in Course 3 (materials science and engineering), perhaps with an environmentally related minor. “I believe that sustainability and solving environmental problems requires a multifaced approach,” she says. “Creating greener materials for use in our daily lives will have a major impact in solving current environmental issues.”</p>\n\n<p>For Sankari’s service project, she developed an algorithm to analyze data from electronic nano-sensor devices, or e-noses, which can detect certain diseases from a patient’s breath. The devices are calibrated to detect volatile organic compound biosignatures that are indicative of diseases like diabetes and cancer. “E-nose disease detection is much faster and cheaper than traditional methods of diagnosis, making medical care more accessible to many,” she explains. The Python-based algorithm she created can translate raw data from e-noses into a result that the user can read.</p>\n\n<p>Sankari is a lifetime member of the American Junior Academy of Science and has been a finalist in several prestigious science competitions. She is considering a major in Course 6-7 (computer science and molecular biology) at MIT and hopes to continue to explore the intersection between nanotechnology and medicine.</p>\n\n<p>While the 2022 Rise recipients share a desire to tackle some of the world’s most intractable problems, their ideas and interests, as reflected by their service projects, are broad, innovative, and diverse. A winner from Belarus used bioinformatics to predict the molecular effect of a potential Alzheimer’s drug. A Romanian student created a magazine that aims to promote acceptance of transgender bodies. A Vietnamese teen created a prototype of a toothbrush that uses a nano chip to detect cancerous cells in saliva. And a recipient from the United States designed modular, tiny homes for the unhoused that are affordable and sustainable, as an alternative to homeless shelters.</p>\n\n<p>This year’s winners were selected from over 13,000 applicants from 47 countries, from Azerbaijan and Burkina Faso to Lebanon and Paraguay. The selection process includes group interviews, peer and expert review of each applicant’s service project, and formal talent assessments.</p>",
  "media:content": {
    "media:description": "As Rise Global Winners, first-years Jacqueline Prawira (left) and Safiya Sankari will have access to opportunities for funding, mentoring, and other resources throughout their careers."
  },
  "category": [
    "Awards, honors and fellowships",
    "Students",
    "Undergraduate",
    "Research",
    "Nanoscience and nanotechnology",
    "Medicine",
    "Cancer",
    "Water",
    "Pollution",
    "Sustainability",
    "Computer science and technology"
  ]
}