{
  "title": "160: 5 Practices of Good Leadership with Simon Sinek",
  "pubDate": "Mon, 13 Jan 2020 21:12:13 +0000",
  "guid": "0280b914-c764-4ae7-8600-d3770417aa06",
  "link": "https://sites.libsyn.com/94610/160-5-practices-of-good-leadership-with-simon-sinek",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">How do you lead with an infinite mind?</span></p> <p><span style=\"font-weight: 400;\">Today’s guest Simon Sinek is</span> <span style=\"font-weight: 400;\">an unshakable optimist who believes in a bright future and our ability to build it together. A bestselling author, Simon has recently written a new book,</span> <a href= \"https://simonsinek.com/product/the-infinite-game/\"><span style= \"font-weight: 400;\">The Infinite Game</span></a><span style= \"font-weight: 400;\">. Described as “a visionary thinker with a rare intellect,” Simon is also a speaker and business leader.</span> <span style=\"font-weight: 400;\">On today’s show, he’ll be drawing on his experience teaching leaders and organizations how to inspire people to explain how changing the way we think about leadership can revolutionize our working life.</span></p> <p><span style=\"font-weight: 400;\">In today’s conversation, we’ll explain the five practices of good leadership, and how each one will change your attitude to your work and help you find meaning in your life. Along the way, we’ll give you some quick practical tips you can use to start on your way to becoming a better leader.</span></p> <p class=\"p1\">** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. **</p>",
  "content:encoded": "<p>How do you lead with an infinite mind?</p> <p>Today’s guest Simon Sinek is an unshakable optimist who believes in a bright future and our ability to build it together. A bestselling author, Simon has recently written a new book, <a href= \"https://simonsinek.com/product/the-infinite-game/\">The Infinite Game</a>. Described as “a visionary thinker with a rare intellect,” Simon is also a speaker and business leader. On today’s show, he’ll be drawing on his experience teaching leaders and organizations how to inspire people to explain how changing the way we think about leadership can revolutionize our working life.</p> <p>In today’s conversation, we’ll explain the five practices of good leadership, and how each one will change your attitude to your work and help you find meaning in your life. Along the way, we’ll give you some quick practical tips you can use to start on your way to becoming a better leader.</p> <p class=\"p1\">** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. **</p>",
  "enclosure": "",
  "itunes:duration": "19:58",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "How do you lead with an infinite mind? Today’s guest Simon Sinek is an unshakable optimist who believes in a bright future and our ability to build it together. A bestselling author, Simon has recently written a new book, . Described as “a...",
  "itunes:episodeType": "full"
}