{
  "id": "tag:blogger.com,1999:blog-6894866515532737257.post-6622193342660520983",
  "published": "2018-09-26T06:48:00.000-07:00",
  "updated": "2020-04-02T09:03:04.700-07:00",
  "title": "This blog has moved",
  "content": "As of September 2018, <a href=\"https://www.allendowney.com/blog\">I am moving <i>Probably Overthinking It</i> to a new location</a>.<br /><br />Blogger has been an excellent host; so far, this blog has received more than two million page views.<br /><br />But earlier this month, when I published a new article, Blogger prompted me to post it on Google+, and I did.&nbsp; A few hours later I discovered that my Google+ account had been suspended for violating terms of service, but I got no information about what terms I had violated.<br /><br />While my Google+ account was suspended, I was unable to access Blogger and some other Google services.&nbsp; And since <i>Probably Overthinking It</i> is a substantial part of my professional web presence, that was unacceptable.<br /><br />I appealed the suspension by pressing a button, with no opportunity to ask a question.&nbsp; Within 24 hours, my account was restored, but with no communication and still no information.<br /><br />So for me, using Google+ has become a game of Russian Roulette.&nbsp; Every time I post something, there seems to be a random chance that I will lose control of my web presence.&nbsp; And maybe next time it will be permanent.<br /><br />It is nice that using Blogger is free, but this episode has been a valuable reminder that \"If you are not paying for it, you are not the customer\".&nbsp; (<a href=\"https://quoteinvestigator.com/2017/07/16/product/\">Who said that?</a>)<br /><br />I have moved <i>Probably Overthinking It</i> to <a href=\"https://www.allendowney.com/\">a site I control</a>, hosted by <a href=\"https://www.dreamhost.com/\">a company I pay</a>, a company that has provided consistently excellent customer service.<br /><br />Lesson learned.<br /><br />[When I published this article, Blogger asked if I wanted to post it on Google+.&nbsp; I did not.]<br /><br />UPDATE: See the <a href=\"https://news.ycombinator.com/item?id=18086767\">discussion of this post on Hacker News</a>, with lots of good advice for migrating to services you have more control over.<br /><br /><br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Allen Downey",
    "uri": "http://www.blogger.com/profile/01633071333405221858",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}