{
  "guid": "urn:uuid:68358529-fd62-4440-848d-b3e23c438345",
  "link": "https://www.who.int/news/item/18-10-2022-statement-on-the-thirteenth-meeting-of-the-international-health-regulations-(2005)-emergency-committee-regarding-the-coronavirus-disease-(covid-19)-pandemic",
  "a10:author": {
    "a10:name": ""
  },
  "title": "Statement on the thirteenth meeting of the International Health Regulations (2005) Emergency Committee regarding the coronavirus disease (COVID-19) pandemic",
  "description": "The WHO Director-General has the pleasure of transmitting the Report of the thirteenth meeting of the International Health Regulations (2005) (IHR) Emergency Committee regarding the coronavirus 2019 disease (COVID-19) pandemic, held on Thursday, 13 October 2022, from 12:00 to 16:00 CEST.",
  "pubDate": "Wed, 19 Oct 2022 14:23:03 Z",
  "a10:content": "<p>The WHO Director-General has the pleasure of transmitting the Report of the thirteenth meeting of the International Health Regulations (2005) (IHR) Emergency Committee regarding the coronavirus 2019 disease (COVID-19) pandemic, held on Thursday, 13 October\n    2022, from 12:00 to 16:00 CEST.<br /></p><p>The WHO Director-General concurs with the advice offered by the Committee regarding the ongoing COVID-19 pandemic and determines that the event continues to constitute a Public Health Emergency of International Concern (PHEIC).<br /></p><p>The WHO Director-General considered the advice provided by the Committee regarding the proposed Temporary Recommendations. The set of Temporary Recommendations issued by the WHO Director-General is presented at the end of this statement.<br /></p><p>The WHO Director-General expresses his sincere gratitude to the Chair, and Members of the Committee, as well as to the Committee&rsquo;s Advisors.<br /></p><p>===<br /></p><h2>Proceedings of the meeting<br /></h2><p>The WHO Director-General, Dr Tedros Adhanom Ghebreyesus, welcomed Members and Advisors of the Emergency Committee, all of whom were convened by videoconference.<br /></p><p>Dr Tedros highlighted that weekly reported COVID-19 deaths have reached levels comparable to the beginning of the pandemic and that almost two-thirds of the world&rsquo;s population has completed a primary course of COVID-19 vaccination. However, he expressed\n    concern over persistent inequities in vaccine coverage and access to antiviral and therapeutic treatments between countries, reductions in epidemiological and laboratory surveillance activities for COVID-19 that are necessary to monitor the evolution\n    and impact of the virus, and the removal of many public health and social measures ahead of the expected increase in transmission over the coming months, particularly during the approaching winter in the Northern hemisphere.&nbsp;</p><p>The Representative of the Office of Legal Counsel briefed the Members and Advisors on their roles and responsibilities and the mandate of the Emergency Committee under the relevant articles of the IHR.<br /></p><p>The Ethics Officer from the Department of Compliance, Risk Management, and Ethics briefed Members and Advisers on their roles and responsibilities. Members and Advisors were also reminded of their duty of confidentiality as to the meeting discussions\n    and the work of the Committee, as well as their individual responsibility to disclose to WHO, in a timely manner, any interests of a personal, professional, financial, intellectual or commercial nature that may give rise to a perceived or direct conflict\n    of interest. Each Member and Advisor who was present was surveyed. No conflicts of interest were identified.&nbsp;</p><p>The meeting was handed over to the Chair of the Emergency Committee regarding the COVID-19 pandemic, Professor Didier Houssin. The Chair introduced the objectives of the meeting: to provide views to the WHO Director-General on whether the COVID-19 pandemic\n    continues to constitute a PHEIC, and to review temporary recommendations to States Parties.&nbsp;<br /></p><p>The WHO Secretariat presented a global overview of status of the COVID-19 pandemic and highlighted several challenges to the ongoing response. The presentation focused on the global COVID-19 epidemiological situation; the ongoing evolution and unpredictability\n    of the virus and the impact of current and future SARS-CoV-2 variants of concern, including descendent lineages of these variants; concurrent circulation of other respiratory viruses including influenza; progress towards WHO COVID-19 vaccination targets,\n    including targets for the highest priority groups in all countries; and planning scenarios for the ongoing response to COVID-19 and ending the emergency globally.<br /></p><h2>Deliberative session<br /></h2><p>The Committee acknowledged progress in controlling the outbreak in many countries with the number of severe cases and deaths substantially decreased and high levels of population immunity achieved in many countries through vaccination and/or infection,\n    leading to resumption of economic and social life and lifting of most COVID-19-related restrictions.<br /></p><p>However, the Committee was concerned that despite being well into the third year of the pandemic, there remained considerable uncertainties as to the further trajectory of the virus as well as to the genetic and antigenic characteristics and clinical\n    impact of future variants. The Committee also remained concerned over the increasing challenges in quantifying the broader COVID-19 burden on health systems including thrombotic and endocrine complications as well as the extent and burden of Post\n    COVID-19 condition. More broadly, Committee members recognized that many health systems remain under pressure because of other health emergencies and competing health priorities, in addition to the challenges posed by COVID-19. In this context, the\n    Committee expressed concern about the heavy workload and associated burnout being experienced by health care workers worldwide, leading to an increased deficit in the workforce.<br /></p><p>The Committee also expressed concern over the reduction in epidemiological and laboratory surveillance for SARS-CoV-2. This impedes assessments of currently circulating and emerging variants of the virus, including genomic and phenotypic assessments,\n    and hinders abilities to interpret trends in transmission and burden of disease. The Committee continued to highlight the importance of expediting the integration of COVID-19 surveillance into other routine surveillance systems, including the integration\n    of COVID-19 surveillance with the surveillance of other respiratory pathogens, community-based surveillance, and the potential value of supplementing it with wastewater surveillance.&nbsp;</p><p>The Committee acknowledged the ongoing work of WHO and partners to achieve WHO- and SAGE-recommended vaccination targets, particularly reaching 100% vaccination coverage among those in the highest priority groups. Nonetheless, concern remained as to the\n    lack of sharing of data needed to monitor progress of vaccination campaigns, and&ndash;where data is available&ndash;the persistent inequities in access to vaccines as well as to WHO-recommended therapeutics. These inequities in access have resulted\n    in many COVID-19 deaths that may have otherwise been avoided. The Committee acknowledged the disruption the pandemic continues to have on routine (non&ndash;COVID-19) immunization activities, which has repeatedly manifested as outbreaks of vaccine-preventable\n    diseases in areas where essential immunization activities have lapsed since early 2020.&nbsp;</p><p>The Committee recognized that many national COVID-19 policies reflect a perception that the emergency may be over and that governments, healthcare workers and societies in general are experiencing \"COVID-19 fatigue.\" The Committee therefore emphasized\n    the need to enhance social listening and community engagement as means to better tailor risk communications and contextualize policies, that will help people to continue to take the actions needed to protect their health. The Committee highlighted\n    persistent misinformation related to many aspects of the COVID-19 response, particularly the dangers posed by pervasive disinformation on vaccination, vaccine hesitancy and the convergence of organized anti-vaccination efforts in many countries.<br /></p><h2>Status of the Public Health Emergency of International Concern<br /></h2><p>The Committee noted a clear decoupling of case incidence from severe disease, and the high seroprevalence estimates resulting from combined infection and/or vaccination across all WHO regions. &nbsp;Seroprevalence data may not necessarily reflect true\n    immune protection but seems to reflect protection against severe disease, and such studies continue to be important to monitor immune response over time.<br /></p><p>In assessing the criteria for a public health emergency of international concern, the Committee agreed that, &nbsp;although the public perception is that the pandemic is over in some parts of the world, it remains a public health event that continues\n    to adversely and strongly affect the health of the world&rsquo;s population, that there remains a risk of new variants exacerbating the ongoing health impact, particularly as winter approaches in the Northern hemisphere (and learning from the Southern\n    Hemisphere), and there is still a need for a coordinated international response to address the inequalities in access to life-saving tools.<br /></p><p>In advising the WHO Director-General that the event still constitutes a PHEIC, the Committee developed the following arguments underpinning its advice.<br /></p><p>First, the clear decoupling in incident cases and severe disease has led to a perception in communities that the emergency may be over and that measures to reduce transmission are no longer warranted. Although the number of weekly deaths reported to WHO\n    is near the lowest since the pandemic began, it remains high compared with other respiratory viruses, and the added burden of COVID-19 related complications and Post COVID-19 Condition is also high and its full impact not completely understood. The\n    evolution of the outbreak during the upcoming winter season in the Northern hemisphere must also be considered.&nbsp;</p><p>Second, although ongoing evolution of the virus is expected to continue, the genetic and antigenic characteristics of future variants cannot yet be reliably predicted, partly due to the current gaps in global surveillance that hinder identifying and evaluating\n    these changes early. In addition, the ongoing virus evolution, with potentially increased properties of immune escape, may pose challenges to current vaccines and therapeutics.</p><p>Finally, inequities in access to COVID-19 vaccines and therapeutics persist between and within countries, such that the highest priority groups do not currently have access to safe and effective vaccine and therapeutics everywhere.<br /></p><p>Given the above considerations, the Committee concurred that continued coordination of the international response is necessary to reliably evaluate the health impact of the pandemic, monitor and assess the evolution of the virus and the impact of future\n    variants, to intensify efforts to ensure access to safe and effective countermeasures, and to enhance tailored risk communication and community engagement activities.<br /></p><p>Overall, the Committee considered that the situation remains dynamic and requires frequent reassessments, and that the termination of the PHEIC, when considered feasible, should be implemented as safely as possible. To this end, the Committee requested\n    the WHO Secretariat to provide additional assessment and analysis for an intersessional discussion to further support the Committee&rsquo;s deliberations. The Committee also recommended to review the potential negative consequences of terminating\n    the PHEIC, as well as to consider the relevant provisions of the IHR (2005) in relation to temporary recommendations, which can continue to be formally issued after the termination of a PHEIC, or to standing recommendations. &nbsp;&nbsp;</p><p>The Committee considered that, in view of the current situation, whereby the response efforts in many countries have reduced the burden of COVID-19, but at the same time inequalities in access to life-saving interventions and uncertainties with regard\n    to the evolution of the virus still persist, the Temporary Recommendations require an enhanced focus on three key priorities: strengthen integrated surveillance and achieve vaccination targets for at risk-groups; continue to develop strategies to\n    increase access to affordable therapeutics; strengthen pandemic preparedness planning, while continuing to protect the most-at risk populations.</p><p>The rationale for these priority recommendations is to ensure that the following occur:<br /></p><ol><li>the appropriate strategies, systems and resources are in place to detect any adverse change in the epidemiology of COVID-19, due, for example, to the emergence of a new more transmissible variant with more immune escape, capable of causing more severe\n        disease;\n    </li><li>Member States have the necessary capacity to surge public health and social measures in response to a new event;</li><li>the global population is appropriately protected by an effective and equitable vaccination programme;</li><li>strategies continue to be developed that increase equitable access to affordable therapeutics, and</li><li>progress towards a robust global pandemic preparedness architecture is maintained.</li></ol><p>The Committee anticipates that meaningful progress with implementing these measures would create a situation compatible with terminating the PHEIC related to the COVID-19 pandemic at a future meeting, and that the situation could continue to be characterized\n    as pandemic even if the PHEIC is terminated. The Committee further believes that these recommendations will support appropriate public health messaging on the evolving risk of COVID-19, despite community and political &ldquo;pandemic fatigue.&rdquo;<br /></p><p>===</p><h2>Temporary Recommendations issued by the WHO Director-General to all States Parties</h2><p><strong>1. Strengthen SARS-CoV-2 surveillance in humans to maintain (or, where needed, enhance) capacity to detect and assess emerging variants and significant changes to COVID-19 epidemiology and </strong><strong>to focus on better understanding the burden of COVID-19 in all regions, and its impact on health and public health services.&nbsp;</strong>It\n is recommended that States Parties prepare for sustainable integration of SARS-CoV-2 surveillance with other surveillance systems, and implement the WHO&rsquo;s guidance on <a href=\"https://www.who.int/publications-detail-redirect/WHO-2019-nCoV-SurveillanceGuidance-2022.2\">Public health surveillance for COVID-19</a> &ndash; interim guidance. With the upcoming Northern\n    hemisphere influenza season and in view of the return of seasonal influenza epidemics, States Parties should further integrate disease surveillance of SARS-CoV-2 and influenza by leveraging and enhancing the Global Influenza Surveillance and Response\n    System (GISRS), complemented with other surveillance models or studies, to monitor the relative co-circulation of these viruses to inform responses.<br /></p><p><strong>2. Strengthen (or where needed, implement) surveillance </strong><strong>to monitor presence and evolution of SARS-COV-2 in animal populations. </strong>Continue to conduct epidemiological investigations of SARS-CoV-2 transmission at the human-animal\n    interface and implement targeted surveillance on potential animal hosts and reservoirs. </p><ul><li><a href=\"https://www.woah.org/app/uploads/2022/01/statement-agve-omicron.pdf\">Statement from the Advisory Group on SARS-CoV-2 Evolution in Animals</a>;\n </li><li><a href=\"https://www.who.int/news/item/07-03-2022-joint-statement-on-the-prioritization-of-monitoring-sars-cov-2-infection-in-wildlife-and-preventing-the-formation-of-animal-reservoirs\">Joint statement on the prioritization of monitoring SARS-CoV-2 infection in wildlife and preventing the formation of animal reservoirs</a>.<br /></li></ul><p><strong>3. Achieve national COVID-19 vaccination targets in accordance with </strong>the updated WHO Global COVID-19 Vaccine Strategy, and the WHO SAGE Prioritization Roadmap, which both emphasize fully protecting those in high priority groups.&nbsp;</p><ul><li><a href=\"https://www.who.int/publications/m/item/global-covid-19-vaccination-strategy-in-a-changing-world--july-2022-update\">Global COVID-19 Vaccination Strategy in a Changing World: July 2022 update;</a> </li><li><a href=\"https://www.who.int/news/item/21-01-2022-updated-who-sage-roadmap-for-prioritizing-uses-of-covid-19-vaccines\">Updated WHO SAGE Roadmap for prioritizing uses of COVID-19 vaccines</a>;\n </li><li><a href=\"https://www.who.int/news/item/17-05-2022-interim-statement-on-the-use-of-additional-booster-doses-of-emergency-use-listed-mrna-vaccines-against-covid-19\">Interim statement on the use of additional booster doses of Emergency Use Listed mRNA vaccines against COVID-19</a>;</li><li><a href=\"https://www.who.int/publications-detail-redirect/WHO-2019-nCoV-vaccines-SAGE_recommendation-coadministration-influenza-vaccines\">Coadministration of seasonal inactivated influenza and COVID-19 vaccines</a></li><li><a href=\"https://www.who.int/publications-detail-redirect/9789240049680\">Behavioural and social drivers of vaccination: tools and practical guidance for achieving high uptake</a></li></ul><p><strong>4. Support timely uptake of accurate therapeutics and timely SARS-CoV-2 testing, linked to WHO recommended therapeutics</strong>. States Parties should provide access to COVID-19 treatments for vulnerable populations, particularly immunosuppressed\n    people, and improve access to specific early treatments for patients at higher risk for severe disease outcomes. Global efforts to increase access to affordable therapeutics should be enhanced. &nbsp;Local production and technology transfer related\n    to vaccines, other therapeutics and diagnostics should be encouraged and supported, as increased production capacity can contribute to global equitable access to therapeutics.\n</p><ul><li><a href=\"https://www.who.int/publications-detail-redirect/WHO-2019-nCoV-therapeutics-2022.4\">Therapeutics and COVID-19: living guideline</a></li><li><a href=\"https://www.who.int/tools/covid-19-clinical-care-pathway\">COVID-19 Clinical Care Pathway</a></li></ul><p><strong>5. Maintain the strong national response to the COVID-19 pandemic</strong><strong> </strong>by updating national preparedness and response plans in line with the priorities and potential scenarios outlined in the <a href=\"https://www.who.int/publications-detail-redirect/WHO-WHE-SPP-2022.1\">2022 WHO Strategic Preparedness, Readiness and Response Plan</a> and the recently published\n    <a href=\"https://www.who.int/emergencies/diseases/novel-coronavirus-2019/covid-19-policy-briefs\">WHO COVID-19 policy briefs</a>. <strong></strong></p><p><strong>6. Address the infodemic, risk communications and community engagement challenges, and the divergent perceptions in risk between scientific communities, political leaders and the general public.</strong></p><ul><li><a href=\"https://www.who.int/teams/epi-win\">WHO risk communications resources</a></li></ul><p><strong>7. Continue to adapt the use of appropriate effective, individual-level protective measures to reduce transmission</strong><strong>, </strong>appropriately tailored to the changing epidemiological context including changing risks associated with\n    future variants of concern, and the need to tailor public health and social measure with such changes, including as relevant for mass gathering events. </p><ul><li><a href=\"https://www.who.int/publications-detail-redirect/WHO-2019-nCoV-Mass-gathering-RAtool-2022.1\">WHO mass gathering COVID-19 risk assessment tool: generic events; </a></li><li><span style=\"background-color:transparent;color:inherit;font-family:inherit;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;caret-color:auto;font-size:inherit;\"><a href=\"https://www.who.int/publications-detail-redirect/considerations-in-adjusting-public-health-and-social-measures-in-the-context-of-covid-19-interim-guidance\">Considerations for implementing and adjusting PHSM in the context of COVID-19</a></span><br /></li></ul><p><strong>8. Maintain essential health, social, and education services</strong>, in particular access to essential immunization services.</p><ul><li><a href=\"https://www.who.int/publications-detail-redirect/WHO-2019-nCoV-Policy_brief-IPC-HCF-2022.1\">Maintaining infection prevention and control measures for COVID-19 in health care facilities: Policy brief; </a></li><li><a style=\"font-family:inherit;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;font-size:inherit;\" href=\"https://www.who.int/publications-detail-redirect/WHO-2019-nCoV-clinical-2022-1\">Clinical management of COVID-19: Living guideline;</a><br /></li><li><a href=\"https://www.who.int/publications-detail-redirect/WHO-UHL-PHC-SP-2021.01\">Building health systems resilience for universal health coverage and health security during the COVID-19 pandemic and beyond: WHO position paper;</a> </li><li><a href=\"https://www.unicef.org/reports/state-global-education-crisis\">The State of the Global Education Crisis | UNICEF</a></li></ul><p><strong>9. Continue to adjust any remaining international travel-related measures</strong>, based on risk assessments, and to not require proof of vaccination against COVID-19 as a prerequisite for international travel. </p><ul><li><a href=\"https://www.who.int/news-room/articles-detail/interim-position-paper-considerations-regarding-proof-of-covid-19-vaccination-for-international-travellers\">Interim position paper: considerations regarding proof of COVID-19 vaccination for international travellers; </a></li><li><span style=\"background-color:transparent;color:inherit;font-family:inherit;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;caret-color:auto;font-size:inherit;\"><a href=\"https://www.who.int/publications-detail-redirect/WHO-2019-nCoV-Policy-Brief-Risk-based-international-travel-2021.1\">Policy considerations for implementing a risk-based approach to international travel in the context of COVID-19</a></span><br /></li></ul><p>&nbsp;</p><p>&nbsp;</p>"
}