{
  "title": "Acer Goes Big on Glasses-Free, 3D Monitors—Look Out, VR",
  "link": "https://spectrum.ieee.org/glasses-free-3d-monitor-acer",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-standing-tablet-computer-shows-a-blow-out-of-a-car-that-appears-to-be-coming-out-of-the-display.jpg?id=29828093&width=1245&height=700&coordinates=0%2C139%2C0%2C139\"/><br/><br/><p>Acer, the world’s fifth largest PC brand, wants to take the growing AR/VR market by the horns with its SpatialLabs glasses-free stereoscopic 3D displays.<br/></p><p><a href=\"https://www.acer.com/ac/en/US/content/conceptd-series/conceptd7spatiallabsedition\" rel=\"noopener noreferrer\" target=\"_blank\">First teased in 2021 in a variant of Acer’s ConceptD 7 laptop</a>, the technology expands this summer in a pair of portable monitors, the SpatialLabs View and View Pro, and select Acer Predator gaming laptops. The launch is paired with artificial-intelligence-powered software for converting existing 2D content into stereoscopic 3D.</p><p>“We see a convergence of virtual and reality,” Jane Hsu, <a href=\"https://www.linkedin.com/in/hsujane/?originalSubdomain=tw\" rel=\"noopener noreferrer\" target=\"_blank\">head of business Development for SpatialLabs</a>, said in an interview. “It’s a different form for users to start interacting with a virtual world.” Glasses-free stereoscopic 3D isn’t new. </p><h2>Evolutionary, not revolutionary</h2><p>The technology has powered several niche products and prototypes, <a href=\"https://venturebeat.com/2020/10/15/sony-reveals-spatial-reality-display-a-4k-screen-with-glasses-free-3d/\" target=\"_blank\">such as Sony’s Spatial Reality Display</a>, but its most famous debut was Nintendo’s 3DS portable game console.</p><p>The 3DS filtered two images through a display layer called a parallax barrier. This barrier controlled the angle an image reached the user’s eyes to create the 3D effect. Because angle was important, the 3DS used cameras that detected the user’s eyes and adjusted the image to compensate for viewing angle.</p><p class=\"pull-quote\">“The PC in 2022 is encountering a lot of problems.”<br/>—Jerry Kao, Acer</p><p>Acer’s technology is similar. It also displays two images which are filtered through an “optical layer” and has cameras to track and compensate for the user’s viewing angle.</p><p>So, what’s different this time?</p><p>“The fundamental difference is that the computing power is way different, and resolution is way different,” said Hsu. “The Nintendo, that was 800 by 240. In a sense, the technology is the same, but over time it has improved for a crystal-clear, high-resolution experience.”</p><p>Resolution is important to this form of glasses-free 3D. Because it renders two images to create the 3D effect, the resolution of the display is cut in half on the horizontal axis when 3D is on. The 3DS cut resolution to 400 by 240 when 3D was on and blurry visuals were <a href=\"https://www.theverge.com/2014/10/21/7025667/new-nintendo-3ds-review\" target=\"_blank\">a common complaint among critics</a>.</p><p>Acer’s SpatialLabs laptops and displays are a big improvement. Each provides native 4K (3,840 by 2,160 resolution) in 2D. That’s 43 times the pixel count of Nintendo’s 3DS. Turning 3D on shaves resolution to 1,920 by 2,160, which, while lower, is still sharper than that of a 27-inch 4K monitor.</p><p>Hsu says advancements in AI compute are also key. Partners like Nvidia and Intel can now accelerate AI in hardware, a feature that wasn’t common a half decade ago.</p><p>Acer has harnessed this for SpatialLabs GO, a software utility that can convert full-screen content from 2D to stereoscopic 3D. This should make SpatialLabs useful with a wider range of content. It can also help creators generate content for use in stereoscopic 3D by importing and converting existing assets.</p><h2>A new angle on augmented reality</h2><p><a href=\"https://www.digitaltrends.com/computing/windows-mixed-reality-motion-controllers-build-2017/\" target=\"_blank\">Acer was a lead partner in Microsoft’s push for mixed-reality headsets</a>. They were a flop, and their failure taught Acer hard lessons about how people approach AR/VR hardware in the real world.</p><p>“Acer spent a lot bringing VR headsets to market, but...it was not very successful,” <a href=\"https://www.acer-group.com/ag/en/TW/content/management-team-jerry-kao\" rel=\"noopener noreferrer\" target=\"_blank\">Acer Co-COO Jerry Kao said in an interview</a>. “There were limitations. It’s not comfortable, or it’s expensive, and you need space around you. So, we wanted to address this.”</p><p>SpatialLabs is a complementary alternative. Creators can use Spatial Labs to achieve a 3D effect in their home office without pushing aside furniture. The Acer View Pro, meant for commercial use, may have a future in retail displays, a use that headsets can't address.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A display in a store shows a shoe that seems to be coming out of the screen.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"9fa4c29e29fb443c69312303b6b6c186\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"7f8cf\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-display-in-a-store-shows-a-shoe-that-seems-to-be-coming-out-of-the-screen.jpg?id=29828109&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The View Pro display is built for use in kiosks and retail displays.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Acer</small></p><p>Most of the SpatialLabs product line, including the ConceptD 7 laptop and View displays, lean toward creative professionals using programs like Maya and Blender to create 3D content. Acer says its software suite has “out-of-the-box support for all major file formats.” It recently added support for Datasmith, a plug-in used to import assets to <a href=\"https://spectrum.ieee.org/unreal-engine-5-metaverse\" target=\"_self\">Epic’s Unreal Engine</a>.</p><p>But the technology is also coming to Predator gaming laptops for glasses-free stereoscopic 3D in select titles like <em>Forza Horizon 5</em> and <em>The Witcher 3: Wild Hunt</em>. Gaming seems a natural fit given its history in Nintendo’s handheld, and Hsu thinks it will help attract mainstream attention.</p><p>“When the Turn 10 team [developer of the Forza Horizon series] saw what we had done with <em>Forza Horizon 5</em>, they were like, ‘Wow, this is so great!’ ” said Hsu. “They said, ‘You know what? I think I can build the scene with even more depth.’ And this is just the beginning.”</p><h2>Does glasses-free 3D really stand a chance?</h2><p>SpatialLabs brings gains in resolution and performance, but it’s far from a surefire hit. Acer is the only PC maker currently pursuing the hardware. Going it alone won’t be easy.</p><p>“While the tech seems quite appealing, it will likely remain a niche product that’ll be used in rare instances by designers or developers rather than the average consumer,” <a href=\"https://www.idc.com/getdoc.jsp?containerId=PRF003967\" rel=\"noopener noreferrer\" target=\"_blank\">Jitesh Ubrani, research manager at IDC</a>, said in an email. He thinks Acer could find it difficult to deliver on price and availability, “both of which are tough to do for such a fringe technology.”</p><p>I asked Hsu how Acer will solve these issues. “In a way he’s right, it is difficult. We’re building this ourselves,” said Hsu. “But also, the hardware is more mature.”</p><p>Kao chimed in to say SpatialLabs will stand out in what might be weak year for home computers. “The PC in 2022 is encountering a lot of problems,” Kao said. He sees that as a motivation, not a barrier, for novel technology on the PC.</p><p>“Intel, Google, Microsoft, and a lot of people, they have technology,” said Kao. “But they don’t know how to leverage that technology in the product and deliver the experience to specific people. That is what Acer is good at.”</p>",
  "pubDate": "Fri, 20 May 2022 14:54:57 +0000",
  "guid": "https://spectrum.ieee.org/glasses-free-3d-monitor-acer",
  "category": [
    "Acer",
    "3d tv",
    "Augmented reality",
    "Glasses-free 3d",
    "Virtual reality"
  ],
  "dc:creator": "Matthew S. Smith",
  "media:content": ""
}