{
  "itunes:order": 44,
  "category": [
    "regional integration",
    "welfare state",
    "social policy",
    "globalisation",
    "the European Union",
    "welfare state convergence"
  ],
  "description": "Professor Beckfield discusses whether the welfare state convergence is really taking place, or it is just regional integration, especially in the European context. The contemporary institutionalization of a transnational regional political economy in Europe raises questions about the role of regional integration in the convergence of European welfare states. To date, sociological work has emphasized processes of industrialization and globalization as the social changes that may drive increasing similarity among welfare states. Building on neoinstitutionalist theory and the Europeanization literature, we develop the argument that regional integration drives welfare-state convergence by generating, diffusing, and enforcing the adoption of policy scripts concerning \"appropriate\" European social policy. The hypothesis that deepening regional integration drives growing welfare-state convergence is tested with a three-stage analysis. The first stage examines trends in population-weighted and un-weighted dispersion for the OECD, the set of liberal market economies, and the set of EU-15 member states, since 1960.  The second stage examines associations between regional integration and welfare-state dispersion using time-series data. The third stage employs fixed-effects models of dyad-year data. The results support the hypothesis:  welfare-state convergence appears only among the EU-15; regional integration trends are associated with convergence; and pairs of countries belonging to the EU develop welfare states that are more similar, on average, than other pairs of countries. The findings are robust to three broad measures of the welfare state. Based on our results, we argue that in theorizing contemporary changes in the welfare state, sociologists should attend to the institutionalization of regional political economy. Welfare states can be conceptualized as embedded in regional, as well as global, systems and institutions.",
  "guid": "http://rss.oucs.ox.ac.uk/tag:2011-06-08:114842:415:sociology/sociology-audio",
  "link": "http://media.podcasts.ox.ac.uk/sociology/sociology/Sociology_T6_JasonBeckfield.mp3",
  "itunes:subtitle": "Professor Beckfield discusses whether the welfare state convergence is really taking place, or it is just regional integration, especially in the European context.",
  "creativeCommons:license": "http://creativecommons.org/licenses/by-nc-sa/2.0/uk/",
  "itunes:summary": "Professor Beckfield discusses whether the welfare state convergence is really taking place, or it is just regional integration, especially in the European context. The contemporary institutionalization of a transnational regional political economy in Europe raises questions about the role of regional integration in the convergence of European welfare states. To date, sociological work has emphasized processes of industrialization and globalization as the social changes that may drive increasing similarity among welfare states. Building on neoinstitutionalist theory and the Europeanization literature, we develop the argument that regional integration drives welfare-state convergence by generating, diffusing, and enforcing the adoption of policy scripts concerning \"appropriate\" European social policy. The hypothesis that deepening regional integration drives growing welfare-state convergence is tested with a three-stage analysis. The first stage examines trends in population-weighted and un-weighted dispersion for the OECD, the set of liberal market economies, and the set of EU-15 member states, since 1960.  The second stage examines associations between regional integration and welfare-state dispersion using time-series data. The third stage employs fixed-effects models of dyad-year data. The results support the hypothesis:  welfare-state convergence appears only among the EU-15; regional integration trends are associated with convergence; and pairs of countries belonging to the EU develop welfare states that are more similar, on average, than other pairs of countries. The findings are robust to three broad measures of the welfare state. Based on our results, we argue that in theorizing contemporary changes in the welfare state, sociologists should attend to the institutionalization of regional political economy. Welfare states can be conceptualized as embedded in regional, as well as global, systems and institutions. Creative Commons Attribution-Non-Commercial-Share Alike 2.0 UK: England & Wales; http://creativecommons.org/licenses/by-nc-sa/2.0/uk/",
  "itunes:keywords": "regional integration,welfare state,social policy,globalisation,the European Union,welfare state convergence,2011-06-06",
  "itunes:author": "Jason Beckfield",
  "itunesu:category": "",
  "itunes:duration": 2553,
  "enclosure": "",
  "pubDate": "Wed, 08 Jun 2011 13:48:42 +0100",
  "source": "Department of Sociology Podcasts",
  "title": "Regional integration and welfare-state convergence in Europe"
}