{
  "title": "A tale of two presidencies",
  "link": "https://audioboom.com/posts/7716632",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2006,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Born and bred in the United States, Bruegel scholars <a href=\"https://www.bruegel.org/author/rebecca-christie/\">Rebecca Christie</a> and <a href=\"https://www.bruegel.org/author/scott-marcus/\">J. Scott Marcus</a> are joined by director <a href=\"https://www.bruegel.org/author/guntram-b-wolff/\">Guntram Wolff</a>, on a special edition of The Sound of Economics, to talk about the upcoming US election, the implications it will have for American and European Economic policies, as well as the impact on future transatlantic relations.<br>\n<br>\n\n</div>\n<div>Rebecca and Scott will walk us through the most crucial domestic topics, from voter suppression to shrinking republican demographic, from the covid-19 pandemic to US healthcare system. On international issues, they look at the approaches the two administrations will likely take on climate, trade, data privacy, as well as financial regulations. While a Biden presidency might be the hope to reinitiate sensible discussions and restore alliance and partnerships, a Trump administration will very much likely continue its path on isolationism.<br>\n<br>\n\n</div>\n<div>Find out more from Bruegel scholars for the upcoming US election:</div>\n<div><a href=\"https://www.bruegel.org/events/tricks-of-the-trade-can-the-eu-and-us-meet-at-a-halfway-point/\">The future of EU-US trade relations after the US election</a></div>\n<div><a href=\"https://www.bruegel.org/2020/10/what-should-europe-expect-from-american-trade-policy-after-the-election/\">What should Europe expect from American trade policy after the election?</a></div>\n<div>\n<a href=\"https://www.bruegel.org/2020/09/trumps-international-economic-legacy/\">Trump’s International Economic Legacy<br>\n</a><br>\n\n</div>\n",
  "itunes:summary": "With the US presidential elections around the corner we asked ourselves: what would a Biden administration look like? And what would a(nother) Trump administration look like?",
  "pubDate": "Wed, 28 Oct 2020 15:00:00 +0000",
  "guid": "tag:audioboom.com,2020-10-28:/posts/7716632",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}