{
  "title": "Episode 53: Mindful Learning, NCLB, and the True Foundations of Success",
  "pubDate": "Wed, 02 Apr 2008 01:32:10 +0000",
  "guid": "episode-53-mindful-learning-nclb-and-the-true-f",
  "link": "http://www.thepsychfiles.com/2008/04/01/episode-53-mindful-learning-nclb-and-the-true-foundations-of-success/",
  "itunes:image": "",
  "description": "Tired of rote memorization? Tired of NCLB? Try mindful learning.  In this episode I explore psychologist Ellen Langer's concept of mindful learning.  What does it mean to teach and learn in a mindful way?  How does this concept differ from what is being encouraged in the new report on the teaching of math in this country called Foundations of Success?  Find out the answers to all these questions in this episode of The Psych Files podcast.",
  "content:encoded": "Tired of rote memorization? Tired of NCLB? Try mindful learning.  In this episode I explore psychologist Ellen Langer's concept of mindful learning.  What does it mean to teach and learn in a mindful way?  How does this concept differ from what is being encouraged in the new report on the teaching of math in this country called Foundations of Success?  Find out the answers to all these questions in this episode of The Psych Files podcast.",
  "enclosure": "",
  "itunes:duration": "23:15",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Tired of rote memorization? Tired of NCLB? Try mindful learning. In this episode I explore psychologist Ellen Langer's concept of mindful learning. What does it mean to teach in a mindful way? How does this differ from the Foundations of Success report?",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Tired of rote memorization? Tired of NCLB? Try mindful learning. In this episode I explore psychologist Ellen Langer's concept of mindful learning. What does it mean to teach and learn in a mindful way? How does this concept differ from what is being encouraged in the new report on the teaching of math in this country called Foundations of Success? Find out the answers to all these questions in this episode of The Psych Files podcast."
}