{
  "title": "S1E57 - Be in the Moment with Olympic Champion Wrestler Tamyra Mensah-Stock",
  "guid": "https://pinecast.com/guid/690d5fbe-e0cd-4450-a22e-852a85c28508",
  "pubDate": "Thu, 17 Mar 2022 06:30:00 -0000",
  "itunes:duration": "01:02:46",
  "description": "<p>Today’s guest is Tamyra Mensah-Stock, an American freestyle wrestler who won Olympic gold for the USA, becoming the first African-American and second American female athlete to win a gold in 68 kgs freestyle wrestling in the Olympics. In her journey to this remarkable level of success, Tamyra has also encountered and persevered through a number of difficulties and today she shares her inspiring story with us all.</p>\n<p>She opens up the episode by describing her transition from life as a sprinter into that of a wrestler.  While Tamyra didn’t love the sport at first, it became a big part of her life that stayed with her through bouts of loss and depression.  She goes on to talk about meeting her husband and their decision to move to Colorado to train for the Olympics.  Some rough patches followed her through 2016, but she notes that these tough times really taught her the importance of faith and compartmentalization. Tamyra also notes that COVID gave her a much needed breather that allowed her to prepare for the Olympics. She was incredibly successful in the 2021 Olympic Games, and in the wake of vaccine mandates, she’s become a key supporter for Athletes for Medical Freedom. She makes it clear that she isn’t anti vaccine, she’s anti mandate, and, to close out this week’s episode, she expresses gratitude for Athletes for Medical Freedom, because it taught her how to use her voice.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>Transitioning from sprinting to wrestling</li>\n<li>Tamyra’s experience confronting the death of family and friends</li>\n<li>How she met her husband</li>\n<li>Making the decision to move to Colorado Springs for Olympic training</li>\n<li>Learning to compartmentalize and trust in her faith</li>\n<li>Why COVID was a breath of fresh air</li>\n<li>Tamyra in the 2020 Olympic Games</li>\n<li>Athletes for Medical Freedom</li>\n</ul>\n<p>Quotes:</p>\n<p>“For some reason, back in the day, I was an early riser, and I loved going to school when it was dark and there was nobody around. There was just some kind of freedom about that.”</p>\n<p>“I don't blame wrestling now because it has given me the platform to identify with people who have dealt with the struggle.”</p>\n<p>“You cannot succeed without a little loss.”</p>\n<p>“Some people in college had asked me why am I dating a white man. And I went, ‘You never asked me out. You never showed me any consideration that you wanted to date me. Jacob took the initiative.’”</p>\n<p>“When you are wrestling for one of the biggest tournaments ever, stay in the moment and leave the mat with no regrets.”</p>\n<p>“COVID was a blessing. I just had time to breathe. I came up with a great win. And I could just relax and it was awesome. And once the Olympics came around, I came to destroy.”</p>\n<p>“When you go to the Olympics, you're going to represent whatever country you are representing, and I'm proud to be an American. And I got up on that stage, I represented America, and I was extremely happy. I've been doing this since 2008 - wanting to go on that stage - nobody was gonna take that away from me.”</p>\n<p>“They're just trying to mandate the vaccine. And I'm fine with vaccinations. But when you force people to do things, that's where the line gets really skewed.”</p>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold</a> Website\n<a href=\"https://www.amazon.com/Life-10-Meters-Lessons-Champion/dp/B096CQW2L7/ref=sr_1_3?crid=2AXVGI3HL987J&dchild=1&keywords=laura+wilkinson+life+at+10+meters&qid=1624113646&sprefix=Laura+Wilkinson%2Caps%2C227&sr=8-3\" rel=\"nofollow\">Life at 10 Meters: Lessons from an Olympic Champion</a>\n<a href=\"http://laurawilkinson.com/shop\" rel=\"nofollow\">Laura Wilkinson Designs- Shop</a>\n<a href=\"http://laurawilkinson.com/coffee\" rel=\"nofollow\">Buy Laura a Coffee</a></p>\n<p>Laura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura’s Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura’s Facebook</a>\nTamyra's Links:\n<a href=\"https://www.instagram.com/athletes4medfreedom/?hl=en\" rel=\"nofollow\">Athletes for Medical Freedom on Instagram</a>\n<a href=\"https://www.instagram.com/mensahtamyrastock/\" rel=\"nofollow\">Tamyra Mensah-Stock on Instagram</a></p>",
  "itunes:title": "Be in the Moment with Olympic Champion Wrestler Tamyra Mensah-Stock",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 57
}