{
  "title": "MIT engineers develop sensors for face masks that help gauge fit",
  "link": "https://news.mit.edu/2022/sensors-face-masks-fit-1020",
  "description": "The system measures biological and environmental changes, and detects contact between the mask and the wearer’s skin.",
  "pubDate": "Thu, 20 Oct 2022 11:00:00 -0400",
  "guid": "https://news.mit.edu/2022/sensors-face-masks-fit-1020",
  "dc:creator": "Anne Trafton | MIT News Office",
  "content:encoded": "<p>Wearing a mask can help prevent the spread of viruses such as SARS-CoV-2, but a mask’s effectiveness depends on how well it fits.</p>\n\n<p></p>\n\n<p>Currently, there are no simple ways to measure the fit of a mask, but a new sensor developed at MIT could make it much easier to ensure a good fit. The sensor, which measures physical contact between the mask and the wearer’s face, can be applied to any kind of mask.</p>\n\n<p></p>\n\n<p>Using this sensor, the researchers analyzed the fit of surgical masks on male and female subjects, and found that overall, the masks fit women’s faces much less closely than they fit men’s faces.&nbsp;</p>\n\n<p></p>\n\n<p>“What we realized by analyzing our collected data from the individuals in the study was that the masks that we use in daily life are not very suitable for female participants,” says Canan Dagdeviren, the LG Career Development Professor of Media Arts and Sciences at MIT and the corresponding author of the study.</p>\n\n<p></p>\n\n<p>The researchers hope that their sensor will help people to find masks that fit them better, and that designers could use it to create masks that fit a wider variety of face shapes and sizes. The sensor can also be used to monitor vital signs such as breathing rate and temperature, as well as environmental conditions such as humidity.</p>\n\n<p></p>\n\n<p>The study is a collaboration between Dagdeviren’s lab; Siqi Zheng, the STL Champion Professor of Urban and Real Estate Sustainability in the Department of Urban Studies and Planning; and Tolga Durak, managing director of MIT’s Environment, Health, and Safety programs. Jin-Hoon Kim, an MIT postdoc, is the lead author of the paper, which appears today in <em>Nature Electronics</em>.</p>\n<p><strong>Fit quality</strong></p>\n\n<p></p>\n\n<p>The researchers began working on this project before mask-wearing became common during the Covid-19 pandemic. Their original intention was to use sensors embedded in masks to measure the effectiveness of mask-wearing in areas with high levels of air pollution. However, once the pandemic started, they realized that such a sensor could have more widespread applications.</p>\n\n<p></p>\n\n<p>With so many different kinds of masks available during the pandemic, the researchers thought this kind of sensor could be useful to help individuals find the best-fitting mask for them. Currently, the only way to measure mask fit is to use a machine called a mask fit tester, which evaluates the mask fit by comparing air particle concentrations inside and outside of the face mask. However, this type of machine is only available in specialized facilities such as hospitals, which use them to evaluate mask fit for health care workers.</p>\n\n<p></p>\n\n<p>The MIT team wanted to create a more user-friendly, portable device to measure mask fit. Dagdeviren’s lab, the Conformable Decoders group, specializes in developing flexible, stretchable electronics that can be <a href=\"https://news.mit.edu/2020/sensor-als-communicate-1022\" target=\"_blank\">worn on the skin</a> or <a href=\"https://news.mit.edu/2020/sensors-monitor-vital-signs-0423\" target=\"_blank\">incorporated into textiles</a> to detect signals from the body.</p>\n\n<p></p>\n\n<p>“In this project, we wanted to monitor both biological and environmental conditions simultaneously, such as breathing pattern, skin temperature, human activities, temperature and humidity inside the face mask, and the position of the mask, including whether people are wearing it properly or not,” Kim says. “We also wanted to check the fit quality.”</p>\n\n<p></p>\n\n<p>To integrate their sensors into face masks, the researchers created a device that they call a conformable multimodal sensor face mask (cMaSK). Sensors that measure a variety of parameters are embedded in a flexible polymer frame that can be reversibly attached to the inside of any mask, around the edges.</p>\n\n<p></p>\n\n<p>To measure fit, the cMaSK has 17 sensors around the edge of the mask that measure capacitance, which can be used to determine whether the mask is touching the skin at each of those locations.</p>\n\n<p></p>\n\n<p>The cMaSK interface also has sensors that measure temperature, humidity, and air pressure, which can detect activities such as speaking and coughing. An accelerometer within the device can reveal if the wearer is moving around. All of the sensors are embedded into a biocompatible polymer called polyimide, which is used in medical implants such as stents.</p>\n<img alt=\"Hands lay down orange foil-like polymer along the edges of a surgical mask.\" data-caption=\"The conformable electronics are laminated and delaminated on a surgical mask.\" data-entity-type=\"file\" data-entity-uuid=\"02b11105-9f52-419b-ac29-e7e7e241c262\" src=\"/sites/default/files/images/inline/face-mask-fit.gif\" />\n<p>The researchers tested the cMaSK interface in a group of five men and five women. All of the subjects wore surgical masks, and the researchers monitored the readings from the sensors as the participants performed a variety of activities, such as speaking, walking, and running. They also tested the sensors in a variety of temperature conditions.</p>\n\n<p></p>\n\n<p>Using data obtained by the capacitance sensors, the researchers created a machine-learning algorithm to calculate mask fit quality for each subject in the study. These measurements revealed that mask fit was significantly worse for women than men, due to differences in face shape and size. However, the fit for women could be improved slightly by wearing smaller surgical masks. The researchers also found that mask fit quality was low for one of the male subjects who had a beard, which created gaps between the mask and the skin.</p>\n\n<p></p>\n\n<p>To verify their results, the researchers also collaborated with MIT’s Environment, Health, and Safety Office on the design and evaluation of the fit, and found that the fit results for each study participant were very similar to what they found using the cMaSK.</p>\n\n<p></p>\n\n<p><strong>Customized fit</strong></p>\n\n<p></p>\n\n<p>The researchers hope that their findings will encourage mask manufacturers to design masks that fit a variety of face shapes and sizes, especially women’s faces. Dagdeviren’s lab is planning to work on mass production and large-scale deployment of the cMaSK interface.</p>\n\n<p></p>\n\n<p>“We hope to think about ways to design masks and come up with the best fit for individuals,” Dagdeviren says. “We have different sizes for shoes, and you can even customize your shoes. So why can’t you customize and design your mask, for your own health and for societal benefit?”</p>\n\n<p></p>\n\n<p>The researchers also hope to return to their original idea of studying the effects of air pollution on people who work outside.</p>\n\n<p></p>\n\n<p>“Our technology can really help to quantify the social costs of these environmental hazards, and also to measure the benefits of any kind of policy intervention,” Zheng says.</p>\n\n<p></p>\n\n<p>The research was funded by the MIT Media Lab Consortium, the 3M Non-Tenured Faculty Award, and the MIT International Science and Technology Initiative (MISTI) Global Fund.</p>",
  "media:content": {
    "media:description": "A new sensor developed at MIT could make it much easier to ensure a good face mask fit. The sensor, which measures physical contact between the mask and the wearer’s face, can be applied to any kind of mask.",
    "media:credit": "Image: Courtesy of the researchers"
  },
  "category": [
    "Research",
    "Covid-19",
    "Sensors",
    "Pollution",
    "Pandemic",
    "Health care",
    "Medicine",
    "Women",
    "Media Lab",
    "Department of Urban Studies and Planning",
    "School of Architecture and Planning"
  ]
}