{
  "id": "tag:theatlantic.com,2021:50-618611",
  "content": "<p class=\"dropcap\">I<span class=\"smallcaps\">f there’s a</span> villain of the pandemic, other than COVID-19, it’s probably Zoom. The videochatting platform is making <a href=\"https://news.stanford.edu/2021/02/23/four-causes-zoom-fatigue-solutions/\">people tired</a>, it’s making people <a href=\"https://www.huffpost.com/entry/zoom-awkward-tweets_l_5f4d1d7ac5b6cf66b2bb3ee5\">awkward</a>, and it’s making people <a href=\"https://slate.com/technology/2020/04/how-to-hide-face-zoom.html\">sick of their</a> own faces. Zoom is such a shoddy substitute for real life that, according to <a href=\"https://www.prnewswire.com/news-releases/report-collaboration-creativity-suffer-in-todays-dispersed-workforces-301146549.html\">o</a><a href=\"https://www.prnewswire.com/news-releases/report-collaboration-creativity-suffer-in-todays-dispersed-workforces-301146549.html\">ne survey</a>, nearly one in five workers has illicitly met up in person with colleagues to discuss work. And in <a href=\"https://www.economist.com/international/2021/04/10/love-them-or-hate-them-virtual-meetings-are-here-to-stay\">another poll</a>, a third of women said they were “talked over, interrupted or ignored more frequently” in virtual meetings than in person.</p><p>Zoom haters: I hear you, and I validate your experiences. But Zoom is actually great! Don’t get me wrong. I love reporting in person—in fact, I’ve missed it dearly. But I find working in an office, public speaking, going to big parties, and attending important meetings in person enormously stressful. I prefer Zoom for all of these things, and I’m going to miss it when it’s gone. So will many other socially anxious people.</p><p>Though I enjoy elements of in-person socializing, I don’t really miss some of its trappings, like doing my makeup, parking, or sitting in an overly air-conditioned Starbucks, buying coffee I don’t want, just to talk with someone for 45 minutes. My favorite quote that captures this sentiment is by a man named William, who told <a href=\"https://nymag.com/intelligencer/2021/04/covid-19-and-the-people-who-dont-want-to-return-to-normalcy.html\"><em>New York</em></a><a href=\"https://nymag.com/intelligencer/2021/04/covid-19-and-the-people-who-dont-want-to-return-to-normalcy.html\"> magazine</a>, “I’m just dreading traffic, ‘meet me at the coffee shop at three,’ ‘I’m ten minutes late,’ baby showers, [gender] reveals. Like, I don’t want to do any of that fucking shit.” Some of us cannot wait for the bustling energy of normal society; others of us are standing athwart all the fucking shit yelling, “No thanks!”</p><p>I have a type of social anxiety that most often surfaces when I’m interacting with authority figures, like bosses or police officers. It was exacerbated by a few managers I had early in my career, who would milk my nervousness for extra output. Now when I leave an in-person interaction with an authority figure, I tend to spend the rest of the day wondering whether I phrased something wrong and therefore my career is over. In big work meetings, I basically try to evaporate. And don’t even get me started on “networking receptions.”</p><p>But with Zoom, I’ve found myself feeling more relaxed, more emotionally regulated, and better able to advocate for myself. I feel as though I can more easily speak up in big meetings, and I can express myself to my bosses without worrying about my self-presentation. To me, Zoom turns everyone else into fake people—not people with power over me, just little faces in boxes on my screen. If the trick to beating stage fright is to imagine the audience members in their underwear, it helps that on Zoom, even the most important people are athleisure-clad and holding babies.</p><p>Social anxiety is driven by a fear of being perceived negatively by others because you’ve misunderstood the subtle norms of a situation. But on Zoom, the rules are simpler. There’s no handshake, no decision about where in the room to sit, no need to even pick out an outfit from the waist down. “Real social interaction is so much more terrifying for people because there’s uncertainty, so many unknowns. This is greatly reduced in the online format,” says Stefan G. Hofmann, a psychology professor at Boston University and an <a href=\"https://www.theatlantic.com/health/archive/2015/10/what-is-social-anxiety/411556/?utm_source=feed\">expert on social anxiety</a>. “A lot of things that happen in real life can’t happen in an online format.” On Zoom, awkward moments can be attributed to technical issues. In a face-to-face meeting, telling your boss that you didn’t hear them or didn’t understand them might be uncomfortable. Over Zoom, it’s perfectly normal.</p><p><a href=\"https://www.theatlantic.com/health/archive/2020/05/work-from-home-pandemic/611098/?utm_source=feed\"><em>[ Read: Work From Home Is Here to Stay ]</em></a></p><p>Socially anxious people tend to play a little movie in our mind of what we assume we look like to others. But instead of the dashing protagonist, we picture ourselves as the bumbling stooge. The Zoom self-view helps correct that image. “It counteracts the view in our head of us looking like a babbling idiot,” says Ellen Hendriksen, a clinical psychologist and the author of <a href=\"https://www.indiebound.org/book/9781250122223\"><em>How to Be Yourself</em></a><em>.</em> Zoom provides a mirror, and a reality check: <em>Oh, I look and sound fine.</em></p><p>Many people say the pandemic has <a href=\"https://www.pewresearch.org/fact-tank/2021/03/16/many-americans-continue-to-experience-mental-health-difficulties-as-pandemic-enters-second-year/\">damaged</a> their mental health. But some have told Hofmann that they prefer interacting over Zoom. Some of the legions of office workers who began working from home last year found that they love it. A few of Hofmann’s psychologist colleagues gave up their expensive leases in New York City and have started offering therapy exclusively online. And some people, he says, “find it easier to maneuver the social world in a more simplistic way—an online way.”</p><p class=\"dropcap\">U<span class=\"smallcaps\">nlike almost every</span> other person on Earth, I also prefer Zoom parties to regular parties. At many in-person parties, I drink too much because I’m uncomfortable and then have to leave early because I’m too uncomfortable and too drunk. By contrast, I find that Zoom parties offer just the right amount of stimulation. I will often put on a big group Zoom and do other things, such as fold laundry or cook. I don’t feel the urge to drink, or even participate much, because it’s really just me and a computer. This blending of regular chores and socializing makes me think of what the pioneer days must have been like, with people catching up while quilting or whatever. Except Laura Ingalls Wilder didn’t have Zoom. Lucky us!</p><p>Like Zoom work, Zoom socializing can be easier for socially anxious people, Hendriksen told me. Real parties are a labyrinth of confusing decisions and expectations. You have to navigate “Who am I going to go talk to now? Have I been talking to them for too long? Should I go to the bathroom now?” Hendriksen said. “Whereas with Zoom, there’s a lot more structure. Really only one person can talk at a time. Everybody’s laid out in this nice <em>Brady Bunch</em> grid. You can turn your camera off and just put ‘BRB’ in the chat. If we increase the structure, we can lower the uncertainty, and therefore lower our anxiety.”</p><p>In addition to being a fine alternative to real life, Zoom has, for me, conferred benefits over and above in-person gatherings. <a href=\"https://www.indiebound.org/book/9780316418485\">My book</a> came out last April, amid the throes of the initial pandemic freak-out. Although I was at first frustrated that I wouldn’t get the full “book-tour experience,” my virtual book tour was more fun and more accessible. More people were willing to sign in to Zoom on a pandemic Tuesday than were willing to trudge to a random D.C. bookstore in the April rain. And because the book talks were so easy, I was able to do more of them—on bookstore websites, on Instagram, on YouTube, and, yes, on Zoom.</p><p>Book clubs and other get-togethers are also more geographically inclusive when they’re online. Through Zoom, I’ve caught up with friends who live in other cities, whom I have not been able to visit. The only <a href=\"https://www.theatlantic.com/family/archive/2020/04/end-zoom-facetime-video-call-excuses/610369/?utm_source=feed\">awkward part</a> of a Zoom chat is figuring out how to end it. But you have to do that when you’re talking on the phone, anyway. Some people have tried “I have to go make dinner/go for my little walk/finish up some work,” but I recommend the genteelly passive-aggressive “I should let you go.” I learned this while living in the South and have yet to find a better alternative.</p><p class=\"dropcap\">A<span class=\"smallcaps\">ll the experts</span> I spoke with said that Zoom will continue to play a role in our lives, but probably a smaller one than it has this past year. “Far from getting tired of [working from home], the average American actually seems to be getting used to it and increasing their desire to continue to work from home post-pandemic,” the Stanford University economist Nick Bloom told me via email. About 46 percent of workers would like to continue working from home forever, according to research from ZipRecruiter.</p><p>But remote jobs aren’t available for all of those workers. The share of jobs explicitly offering remote work has gone up from about 3 percent before the pandemic to about 10 percent now, says Julia Pollak, a labor economist at ZipRecruiter, and that number is now coming down slightly. Bloom told me that although employers are planning to increase work-from-home days after the pandemic, they’re not as enthusiastic about the change as employees are—and they don’t envision workers spending quite as many days at home as workers might hope. Some percentage of Zoom lovers will likely be dragged back into the office, whether we like it or not.</p><p>The pandemic probably hasn’t ended in-person conferences, either, though Pollak says  more conferences will likely offer a cheaper, remote ticket option. Steve Moster, the president of GES, which helps companies put on live events, says many clients have told him that virtual events don’t yield the same sales leads or opportunities as in-person conventions do. “So there’s a lot of compelling reasons for in-person, live events,” he told me. He believes that by 2022, Americans will return to live events at their previous levels.</p><p><a href=\"https://www.theatlantic.com/politics/archive/2021/03/how-tell-if-you-have-burnout/618250/?utm_source=feed\"><em>[ Read: Only Your Boss Can Cure Your Burnout ]</em></a></p><p>By using Zoom so much this past year, I’ve grown soft. My social anxiety, which is usually provoked in a million tiny ways each week, has been lulled into a peaceful slumber while I interact with people only virtually. It might be hard for people like me to jump back into meatspace.</p><p>For future in-person interactions that can’t be conducted over Zoom, Hofmann recommended that I try to make the rules of the interaction as explicit as possible, at least in my mind. Having an agenda to discuss, a specific start and end time, and clear talking points can make daunting in-person meetings feel more Zoomlike.</p><p>Hendriksen reminded me that there will be lots of reentry points. First, I’ll have an in-person meeting with my boss. Then I’ll go to a big, loud party. And finally, I’ll have to do an onstage presentation. I’m not going to have to do them all at once. My brain will be recalibrating all along, preparing me for the next stressful thing. “It doesn’t have to be a cannonball into the deep end,” she said. Our brains are flexible, and real life isn’t anything they haven’t seen before.</p>",
  "author": {
    "name": "Olga Khazan",
    "uri": "http://www.theatlantic.com/author/olga-khazan/?utm_source=feed"
  },
  "media:content": {
    "media:credit": "Adam Maida / The Atlantic"
  },
  "title": "You’re Gonna Miss Zoom When It’s Gone",
  "published": "2021-04-16T09:00:00-04:00",
  "updated": "2021-04-16T10:09:04-04:00",
  "summary": "For people like me, who have social anxiety, videoconferencing can be easier than in-person interactions.",
  "link": ""
}