{
  "title": "S14 Ep58: The Dead Files with Steve DiSchiavi",
  "link": "https://audioboom.com/posts/8098572",
  "itunes:episode": 58,
  "itunes:title": "The Dead Files with Steve DiSchiavi",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4173,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS opens The Dead Files with Steve DiSchiavi <br>\n<br>\nFormer NYPD homicide detective Steve DiSchiavi and physical medium Amy Allan are back on the case with a brand-new season of Travel Channel’s hit series, “The Dead Files,” premiered on Thursday, July 11 at 10 p.m. ET/PT. In each of the 10 one-hour episodes, the duo joins forces to help frightened property owners suffering from unexplained and dangerous paranormal activity. From their unique viewpoints, DiSchiavi and Allan work to uncover the truth behind their clients’ startling claims – and ultimately decide if it’s safe for them to stay.  <br>\n<br>\nFor more info visit here: <a href=\"https://www.travelchannel.com/shows/the-dead-files\">https://www.travelchannel.com/shows/the-dead-files</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.",
  "itunes:summary": "BEYOND the DARKNESS opens The Dead Files with Steve DiSchiavi \n\nFormer NYPD homicide detective Steve DiSchiavi and physical medium Amy Allan are back on the case with a brand-new season of Travel Channel’s hit series, “The Dead Files,”...",
  "pubDate": "Sun, 14 Jul 2019 08:00:00 +0000",
  "guid": "2e713178-5e25-48a8-ab8c-a8384aabeb84",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}