{
  "title": "568: Indefensible Characters in Harry Potter, and How to Understand Them",
  "link": "https://audioboom.com/posts/8110114",
  "itunes:episode": 568,
  "itunes:title": "Indefensible Characters in Harry Potter, and How to Understand Them",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4580,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's MuggleCast, the hosts take on the most <em>indefensible</em> characters, and figure out what about them gets under our skin. How can we defend the actions of someone like Gilderoy Lockhart or Rita Skeeter? Do we really believe that James Potter matured out of being a bully? And finally, is Umbridge a case of nature or nurture? Join Andrew, Eric, Micah and Laura for a deep look at characters who bug us in <em>Harry Potter</em>.<br>\n<br>\n\n</div>\n<ul>\n<li>For Pride month, MuggleCast is participating in <a href=\"https://bit.ly/HogwartsHunt\">The Hogwarts Hunt</a>, a fundraiser and scavenger hunt to benefit LGBT charities. We're team Hufflepuff! Visit our social media for more info.</li>\n<li>Who are the most indefensible characters in <em>Harry Potter</em>? Why do we say that they can't they be redeemed?</li>\n<li>The hosts unexpectedly discuss a few Ravenclaws and Micah and Laura get nervous.</li>\n<li>Micah says the Death Eaters would actually approve of the Dursleys' treatment of Harry if they knew.</li>\n<li>Among the irredeemable characters, which ones do we LOVE to hate and why?</li>\n<li>Characters like Snape or Umbridge have scenes that are greatly written as to illustrate their motives clearly, and we are shook.</li>\n<li>Could anything or anyone humanize Bellatrix Lestrange?</li>\n<li>What allow us to defend some characters, but not others? Their upbringing? Their intelligence and skill? Where do we draw the line?</li>\n<li>Is Argus Filch a character we understand? Would a Squib living at a magic school always have his attitude?</li>\n<li>Is James Potter a defensible character, since we see so little of him and when we do he is still that teenage bully of Snape?</li>\n<li>Do we believe that James would have made a good father and raised Harry without prejudice, had he lived?</li>\n<li>Debate: Umbridge, Nature vs Nurture?</li>\n<li>Quizzitch: Which of Umbridge's Educational Decrees (what number) barred teachers from giving the students any information that was not related to the subjects they were hired to teach?</li>\n<li>Andrew was on Swish & Flick podcast discussing the history of Dumbledore's sexuality! <a href=\"https://anchor.fm/swishflickcast/episodes/Episode-250---Grindy-and-Dumle-Sittin-in-a-Tree-e1kese6\">Check it out here</a> or wherever you listen to podcasts!</li>\n<li>This week's episode is brought to you by BetterHelp (Get 10% off your first month at <a href=\"https://www.betterhelp.com/mugglecast\">BetterHelp.com/mugglecast</a>) and Warby Parker (Try 5 pairs of glasses at home for free at <a href=\"https://www.WarbyParker.com/mugglecast\">WarbyParker.com/mugglecast</a>)</li>\n</ul>\n",
  "pubDate": "Tue, 28 Jun 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-06-27:/posts/8110114",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}