{
  "title": "It&#8217;s Get Smart With Money Day!",
  "link": "https://www.mrmoneymustache.com/2022/09/06/its-get-smart-with-money-day/",
  "comments": "https://www.mrmoneymustache.com/2022/09/06/its-get-smart-with-money-day/#comments",
  "dc:creator": "Mr. Money Mustache",
  "pubDate": "Tue, 06 Sep 2022 18:52:21 +0000",
  "category": [
    "The MMM Blog",
    "Retirement"
  ],
  "guid": "https://www.mrmoneymustache.com/?p=18316",
  "description": "Let’s jump right to the real news here: There’s a Netflix documentary that just came out TODAY* called Get Smart With Money Somehow old Mr. Money Mustache and several friends got lured into playing a role in making it. And I’m very happy with the results! And you can watch the results here (which will [&#8230;]",
  "content:encoded": "\n<p>Let’s jump right to the real news here:</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large is-resized\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/get-smart-with-money-819x1024.jpg\" alt=\"\" class=\"wp-image-18322\" width=\"280\" height=\"350\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/get-smart-with-money-819x1024.jpg 819w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/get-smart-with-money-240x300.jpg 240w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/get-smart-with-money-144x180.jpg 144w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/get-smart-with-money-768x960.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/get-smart-with-money-120x150.jpg 120w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/get-smart-with-money.jpg 864w\" sizes=\"(max-width: 280px) 100vw, 280px\" /></figure></div>\n\n\n<ul><li style=\"padding-bottom: 16px;font-size:17px\">There’s a Netflix documentary that just came out TODAY* called Get Smart With Money</li><li style=\"padding-bottom: 16px;font-size:17px\">Somehow old Mr. Money Mustache and several friends got lured into playing a role in making it. And I’m very happy with the results!</li><li style=\"padding-bottom: 16px;font-size:17px\">And you can watch the results here (which will be a huge help to the movie’s success!): <a rel=\"noreferrer noopener\" href=\"https://www.netflix.com/title/81312877\" target=\"_blank\"><strong>https://www.netflix.com/title/81312877</strong></a></li></ul>\n\n\n\n<p>Now for the real story behind this weird situation. Why did I agree to this? Aren’t I supposed to be retired? Do you get paid a lot to be in a Netflix movie? And does that mean you become “famous” and your life changes? Read on to find these answers and more.</p>\n\n\n\n<p><strong>The Origin</strong></p>\n\n\n\n<p>One sunny afternoon in December 2020, I got an email from the co-owner of a filmmaking company with this title:</p>\n\n\n\n<p><em>Feature Documentary &#8211; personal finance</em></p>\n\n\n\n<p>&nbsp;Inside was a very well written description of her idea for a movie, and a heartfelt invitation for me to be one of the people featured in it.</p>\n\n\n\n<p>I immediately went through my usual series of reactions: Feeling flattered that someone would actually want me in their production. Then dread at the idea of actually signing myself up for a bunch of “work” when I’m already way too busy doing fun, meaningful stuff as a retired person. Then a motivated excitement to write back immediately to say,&nbsp;</p>\n\n\n\n<p><em>“Thanks so much, I’m honored, but no thanks, and good luck and maybe I could help out by email just as a casual consultant if you need any ideas.”</em></p>\n\n\n\n<p>Well, that failed. Because this filmmaker turned out to be Kristin Lazure, who then pulled her co-founder Stephanie Soechtig into the conversation, and together they run <a href=\"https://www.atlasfilms.com/\" target=\"_blank\" rel=\"noreferrer noopener\">Atlas Films</a>, not just another documentary company but one of the <em>best </em>ones in the country.&nbsp;</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large is-resized\"><a href=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/atlas-films.jpg\" target=\"_blank\" rel=\"noreferrer noopener\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/atlas-films-765x1024.jpg\" alt=\"\" class=\"wp-image-18317\" width=\"447\" height=\"598\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/atlas-films-765x1024.jpg 765w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/atlas-films-224x300.jpg 224w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/atlas-films-134x180.jpg 134w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/atlas-films-112x150.jpg 112w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/atlas-films.jpg 766w\" sizes=\"(max-width: 447px) 100vw, 447px\" /></a></figure></div>\n\n\n<p>Atlas has made super-incisive films on food, public health, guns, political cover-ups and so many more things, all of them watchable and action-oriented. As I watched their earlier titles, I realized that Atlas does not exist just to crank out entertainment or profit from cheap controversy. They are willing to do the real work to dig out the real stories, with the goal of creating positive social change.</p>\n\n\n\n<p><em>“Shit”, I thought. “How can I say no to this, if my goal with this MMM hobby is really to try to make a difference myself?”&nbsp;</em></p>\n\n\n\n<p>I realized that sure, doing screen and camera work is hard and sometimes inconvenient and it would suck away some of the time I would normally put into writing blog articles. But in exchange it would almost certainly reach a lot more people for each hour I invested into it, and equally important it would reach <em>new </em>people, Netflix watchers who are probably a different group than blog readers.&nbsp;</p>\n\n\n\n<p>And, if you set aside my serious-eyebrows-pretend-grownup charade of being all concerned and logical, I also thought it would be <strong>a lot of fun</strong> to be part of such a big, exciting, new experience. And shit man, how neat to be able to go over to a friend’s house and dare them to put on YOUR OWN NETFLIX MOVIE!?!</p>\n\n\n\n<p>So I said yes, and the giant ball started rolling really fast, and suddenly we spent the entire 2021 hopping through a series of occasional filming days, and recorded zoom calls, and other silly, interesting experiences.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large is-resized\"><a href=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/2021-filmmaking-1.jpg\" target=\"_blank\" rel=\"noreferrer noopener\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/2021-filmmaking-1-1024x980.jpg\" alt=\"\" class=\"wp-image-18319\" width=\"-90\" height=\"-85\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/2021-filmmaking-1-1024x980.jpg 1024w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/2021-filmmaking-1-300x287.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/2021-filmmaking-1-188x180.jpg 188w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/2021-filmmaking-1-768x735.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/2021-filmmaking-1-1536x1470.jpg 1536w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/2021-filmmaking-1-150x144.jpg 150w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/2021-filmmaking-1-900x861.jpg 900w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/2021-filmmaking-1.jpg 1600w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /></a></figure></div>\n\n\n<p>Some of it was indeed hard (like being squeezed onto my deck along with a dozen production crew in the full blazing solar onslaught of a July afternoon, pretending to act natural while answering interview questions, pausing only to wipe away the occasional gallon of sweat from my forehead.) But almost all of it was loads of fun. And it led to wonderful new experiences and friendships for all of us.</p>\n\n\n\n<p>One thing you’ll notice if you watch the movie, is that I talk a big game about how hard this all was, yet in the movie I just seem to pop in occasionally, do a couple of bike tricks and play with power tools, and oh yeah sometimes drop a few sagely financial one-liners to help my students along the way. This is because our content was edited down by probably a 100:1 ratio. They cover a <em>lot </em>of ground in this movie with a lot of people, and yet somehow it all feels natural and coherent.&nbsp;</p>\n\n\n\n<p>My favorite part is probably that my old concept of the “Purchase Justification Machine”, first described in <a href=\"https://www.mrmoneymustache.com/2019/05/08/tesla-procrastination/\" target=\"_blank\" rel=\"noreferrer noopener\">this 2019 article</a> about me not buying a Tesla, made it into the movie in the form of a glorious and silly on-screen animated graphic &#8211; grinding away at Kim as she browses Amazon while riding her Peloton.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full is-resized\"><a href=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/pjm.jpg\" target=\"_blank\" rel=\"noreferrer noopener\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/pjm.jpg\" alt=\"\" class=\"wp-image-18320\" width=\"740\" height=\"434\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/pjm.jpg 968w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/pjm-300x176.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/pjm-200x118.jpg 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/pjm-768x451.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/pjm-150x88.jpg 150w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/pjm-900x529.jpg 900w\" sizes=\"(max-width: 740px) 100vw, 740px\" /></a></figure></div>\n\n\n<p><strong>Money and Fame</strong></p>\n\n\n\n<p>Oh, and no, we didn’t get paid much at all, especially if you work it out on an hourly basis. Documentaries like this have a high production budget when it comes to top-quality crew and equipment, but they somehow manage to get us on-camera participants to willingly almost donate our time.&nbsp;</p>\n\n\n\n<p>If you value fame or exposure, that alone could be considered a valuable form of payment. But in my case, any added fame would be a downside &#8211; there are very few real-world benefits and quite a few downsides related to privacy, which in extreme situations can even lead to danger. However I figured I’m just one of many people in this movie, and it’s a small fish relative to the overall ocean of Netflix. When I weighed that against the benefits of sharing better financial and lifestyle habits, I took an optimistic guess and decided that the good aspects outweighed the bad. I’ll let you know how this goes now that the movie is out!</p>\n\n\n\n<p><strong>So What’s The Movie About?</strong></p>\n\n\n\n<p>Atlas films rounded up four financial gurus, all of us with different backgrounds and styles (<a href=\"https://affordanything.com/\" target=\"_blank\" rel=\"noreferrer noopener\">Paula Pant</a>, <a href=\"https://thebudgetnista.com/\" target=\"_blank\" rel=\"noreferrer noopener\">Tiffany Aliche</a>, <a href=\"https://www.rossmacmusic.com/\" target=\"_blank\" rel=\"noreferrer noopener\">Ro$$ Mac</a>, and myself.)</p>\n\n\n\n<p>Then they had us send “casting calls” out to the Internet, summoning our ideal students with the offer of a year of free coaching &#8211; in exchange for it all being filmed and shared with the world.&nbsp;</p>\n\n\n\n<p>Surprisingly, we got loads of responses &#8211; in the form of personal video stories from singles, couples and families, all of them charming and heartfelt and leaving me wishing I had time to welcome and try to help <em>all </em>of them.</p>\n\n\n\n<p>&nbsp;In the end, I chose a young family of four that falls into the same demographic to which I target these blog posts: people with high incomes and high spending, who are wondering where all the money is going.</p>\n\n\n\n<p>I taught my couple, John and Kim, how to streamline their initial $13,000 per month spending budget (!!), through things like more efficient grocery shopping and dining, keeping a closer eye on impulse purchasing, thinking about housing and neighborhoods and school choices (private versus public), and whether to consider side income streams over the longer run to allow them to scale back on work.</p>\n\n\n\n<p><em><strong>Update: </strong>since publishing this post, many people have emailed me asking how to get in touch with Kim for the (non-financial) coaching she offers &#8211; you can find her here: <a rel=\"noreferrer noopener\" href=\"http://www.kimmassale.com/\" target=\"_blank\"><strong>www.kimmassale.com</strong></a></em></p>\n\n\n\n<p>&nbsp;As you’ll see in the movie, the end results were both subtle and dramatic at the same time. And I’m happy to report that these subjects are now real-life friends and even live nearby so we get to enjoy the results of their more fun new lifestyle together.</p>\n\n\n\n<p>So, I hope you enjoy both the movie and the backstory. I’m very happy that I said “yes” after all, even though I can guarantee that I won’t be coming back for a sequel or an ongoing series. The camera vans have long since left and my schedule is back to its normal blissfully open state. </p>\n\n\n\n<p>With this little report to <em>you </em>now wrapping up, it’s back to my construction projects here at the house for the rest of this week, then off for some camping deep in the mountains this weekend. Seventeen years in, this version of retirement remains the right life for me.</p>\n\n\n\n<p>And I wish you your own version of living the dream this week as well!</p>\n\n\n\n<p>&#8212;&#8211;</p>\n\n\n\n<p><em>*September 6th, 2022</em></p>\n\n\n\n<p><em><strong>In the Comments:</strong> Did you watch the movie? If so what did you think? How could it have been made even better if you were doing the cuts?</em></p>\n\n\n\n<p><em>My candid criticism, being a details person, is that they tried to cover so much that they didn’t have much time for the details. But then again, you can’t teach all the details of such a broad subject with just a documentary, while also keeping it fun to watch. So I’m hoping that the easy breezy approachable nature of the movie leads people to start thinking about these things on their own. Once the right seed is planted, better money habits can catch on pretty easily.</em></p>\n",
  "wfw:commentRss": "https://www.mrmoneymustache.com/2022/09/06/its-get-smart-with-money-day/feed/",
  "slash:comments": 115,
  "post-id": 18316
}