{
  "title": "New Year's Resolutions 2019",
  "description": "<h2 id=\"a-year-back-a-year-ahead\">A year back, a year ahead.</h2>\n\n<p>Below, you’ll find a 2018 retrospective.</p>\n\n<p>Here, you’ll find my new goals for 2019. I looked forward to making them all year. It’s fun to look back on the last year and my crazy goals. It’s amazing to see not only what I’ve accomplished, but what I’ve failed to do. That is clarifying. The last year shows what mattered to me and what didn’t. Goals, of course, are not all-encompassing of life. This is not the Truman show. These are all measurable, attainable goals mostly related to learning and staying in shape – they are not meant to represent professional or interpersonal goals.</p>\n\n<p>High-level summary of 2019 resolutions:</p>\n\n<ul>\n  <li>Reading</li>\n  <li>Writing</li>\n  <li>Travel</li>\n  <li>Language</li>\n  <li>Fitness</li>\n  <li>Sailing</li>\n  <li>Organization</li>\n  <li>Use less technology</li>\n</ul>\n\n<h2 id=\"reading-2019\">Reading, 2019</h2>\n\n<p>Last year’s reading goals were only <em>slightly</em> overprescribed. Lol.</p>\n\n<p><img src=\"/assets/le_bar_bibliotheque.jpg\" alt=\"St. James, Paris\" /></p>\n\n<p>A photo of me in the library bar at <a href=\"https://www.saint-james-paris.com/\">St. James</a> in Paris, reading <a href=\"https://en.wikipedia.org/wiki/Notes_from_Underground\"><em>Notes from Underground</em></a>, by Dostoevsky.</p>\n\n<p>Shortlist of goals:</p>\n<ul>\n  <li>Read 50 books, again (OKR-style)</li>\n  <li>The Great Books, continued</li>\n  <li>Classic machine learning papers</li>\n  <li>Short stories; poetry</li>\n</ul>\n\n<h3 id=\"read-50-books\">Read 50 books</h3>\n\n<p>By OKR standards, I knocked this one out of the park in 2018. By that logic, I should consider upping my goal for next year. That being said, I don’t need to read any <em>more</em> books in 2019 – I spent time reading at the expense of other activities (especially fitness). Rather than lowering the goal, I will keep it at 50. In the same way that the Economist has 50 issues per year (and takes off 2 weeks at the end of every year), the goal of 50 is a reasonable “one book per week” with some wiggle-room to take a couple of weeks off.</p>\n\n<p>By wasting less time in 2019, I think I can still balance fitness and reading goals.</p>\n\n<p><strong>2019-01-04 update:</strong> This should go without saying, but, as a privileged white cis-het male, I feel it is my duty to represent the following. In 2019 I will commit to reading books/stories/poetry written by women, POC, nonbinary folks, and other underrepresented author identities or authors from less privileged backgrounds. These works will stand for themselves and I will not review them as conveniently fitting into some sort of diversity category/genre, as if I am checking off a box. I think this is important and I think everyone else should do the same.</p>\n\n<h3 id=\"great-books-year-one-and-two\">Great Books, year one and two</h3>\n\n<p><img src=\"/assets/great_books.jpg\" alt=\"The Great Books\" /></p>\n\n<p>Here is a Great Books <a href=\"https://gbwwblog.wordpress.com/reading-plan/\">reading plan</a>. Year two doesn’t look so bad. One thing I like about this breakdown is that it includes page counts (though it’s really double this count since they are large double-column pages in tiny print)</p>\n\n<p>By the end of 2019, I’d like to commit to having read all of year one and year two of the great books. This sounds ridiculous since I only got halfway through year one in 2018, but I’m willing to sacrifice a few books from my Goodreads list this year if it means completing this goal <code class=\"language-plaintext highlighter-rouge\">#tradeoffs</code>.</p>\n\n<h3 id=\"classic-machine-learning-papers\">Classic machine learning papers</h3>\n\n<p><img src=\"/assets/lstm.png\" alt=\"LSTM\" /></p>\n\n<p>This is a pictorial representation of an <a href=\"http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.676.4320&amp;rep=rep1&amp;type=pdf\">LSTM</a><sup id=\"fnref:0\" role=\"doc-noteref\"><a href=\"#fn:0\" class=\"footnote\">1</a></sup> cell.</p>\n\n<p>Refer to <a href=\"http://korbonits.github.io/2018/01/05/New-Years-Resolutions.html\">last year’s paper list</a>.</p>\n\n<p>In addition to keeping up with the state of the art in machine learning in 2019, I would like to fill in some of the foundational gaps in my knowledge by reading classic papers. Over the years, I have also acquired a fairly comprehensive library of machine learning references texts and textbooks.</p>\n\n<p>Stretch goal: read &gt;= 1 machine learning textbook in 2019.</p>\n\n<h3 id=\"short-stories-poetry\">Short stories; poetry</h3>\n\n<p>This year, I’d like to gain exposure to forms of writing that are newer to me. Instead of focusing on scientific papers (i.e., in <em>Nature</em>) or timely long-reads on foreign relations (i.e., in <em>Foreign Affairs</em>), I’d like to read more contemporary short stories and poetry. This is also to help me with my writing goals – a double win. I’m a subscriber of <a href=\"https://www.poetryfoundation.org/poetrymagazine\"><em>Poetry Magazine</em></a> and intend to subscribe to one or more additional (usually quarterly) literary magazines (probably <a href=\"https://www.theparisreview.org/\"><em>The Paris Review</em></a>). Staying current with what is being published today will be crucial for my writing career. The measurable goal for 2019 is to read short stories/poetry monthly.</p>\n\n<h2 id=\"writing-2019\">Writing, 2019</h2>\n\n<p><img src=\"/assets/nanowrimo.png\" alt=\"nanowrimo\" /></p>\n\n<p>NaNoWriMo was so fun in 2018, I’d like to do it again in 2019. That’s the first goal.</p>\n\n<p>Second goal is to continue taking writing courses at Hugo House, time permitting. I’m taking a fiction-writing course this winter and would like to take a revision course in the spring.</p>\n\n<p>Third goal is to keep writing all year. Doesn’t need to be in the form of blog posts, but just needs to be a regular (ideally daily) habit.</p>\n\n<p>Stretch goals for 2019:</p>\n\n<ul>\n  <li>Finish manuscript for novel based on nanowrimo 2018</li>\n  <li>Get published (could be short story, poetry, essay – something less ambitious than a novel)</li>\n</ul>\n\n<h2 id=\"travel-2019\">Travel, 2019</h2>\n\n<p><img src=\"/assets/tokyo.jpg\" alt=\"Tokyo\" /></p>\n\n<p>Travel in 2019 is off to a good start. I began the new year in Puerto Vallarta, Mexico. Travel goal for 2019 is visiting at least one new country. Right now I’m going to Japan in May to go sailing (double win!).</p>\n\n<p>Note to friends: get hitched in exotic locations – I’ll be there.</p>\n\n<h2 id=\"language-2019\">Language, 2019</h2>\n\n<p><img src=\"/assets/hiragana.jpg\" alt=\"kanji\" /></p>\n\n<p>This is a new goal. Last year, it was just to “practice French”. I am going to focus on learning a new language in 2019.</p>\n\n<p>After much consideration (and great conversations on Facebook), I will commit to learning Japanese ahead of my trip in May.</p>\n\n<p>Following Japan, unless I want to continue learning Japanese, I think I will focus on the <a href=\"http://www.un.org/en/sections/about-un/official-languages/\">six official languages</a> of the United Nations. Perhaps in the future my preferences will change, but there’s already a lifetime of language learning with that list.</p>\n\n<p>Having just acquired a copy of <a href=\"https://www.amazon.com/Babel-Around-World-Twenty-Languages/dp/0802128793/\"><em>Babel: Around the World in Twenty Languages</em></a>, by Gaston Dorren, I’d need to know the twenty that Dorren describes to be able to converse in the mother tongues of just half of the world’s population. I’d like to know how many (and which) languages would allow me to talk to a majority of humanity even if it’s someone’s 2nd, 3rd, or Nth language (this will likely dramatically reduce the number from twenty to the single digits).</p>\n\n<h2 id=\"fitness-2019\">Fitness, 2019</h2>\n\n<p>Going to keep this one simple:</p>\n\n<ul>\n  <li>Run 365 miles in 2019</li>\n  <li>Stretch goal 1: enter some races, starting with a 5k</li>\n  <li>Stretch goal 2: new PRs for distance, mile, and 5k.</li>\n  <li>Yoga: try it out, see if it sticks</li>\n  <li>Lose 10lbs sustainably</li>\n</ul>\n\n<h2 id=\"sailing-2019\">Sailing, 2019</h2>\n\n<p><img src=\"/assets/spinnaker.jpg\" alt=\"spinnaker\" /></p>\n\n<p>Racing:</p>\n\n<ul>\n  <li>Skip/crew for some casual races (e.g., Goosebumps, Kirkland summer sailing series)</li>\n  <li>Crew for some serious races (Tri-Island, Swiftsure, Grand Prix, Round the County)</li>\n</ul>\n\n<p>Cruising:</p>\n\n<ul>\n  <li>Sail to the San Juans</li>\n  <li>Sail to nearby ports of call (e.g., Poulsbo)</li>\n  <li>Stretch goal: sail to Canada</li>\n</ul>\n\n<p>Last year I was just aiming to get out on the water. Thanks to the wonderful, welcoming people in Seattle’s sailing community, I blew last year’s goal out of the water, as it were. This year, I am going to do some cruising and do some serious racing.</p>\n\n<p>Vic/Maui 2020, anyone?</p>\n\n<h2 id=\"organization-2019\">Organization, 2019</h2>\n\n<p>Implementing Part I of <a href=\"https://www.amazon.com/Getting-Things-Done-Stress-Free-Productivity/dp/0143126563\">Getting Things Done</a> in 2018 went well, but I can do better.</p>\n\n<p>This year, let’s start by finishing it and using organization as a tool to not just keep track of things, but to save time planning and create more time to achieve my goals. Yesterday I was reading <a href=\"https://www.theparisreview.org/\"><em>The Paris Review</em></a> and in an author interview, the topic of plotting vs. pantsing was discussed. In her career, the author has been a pantser, but she said that a little bit of planning can save a lot of time during composition (first draft) and subsequent revisions. Organization to save time. That’s my goal for 2019.</p>\n\n<h2 id=\"use-less-technology-2019\">Use less technology, 2019</h2>\n\n<p>By use less technology, I really mean waste less time. The screen time app is a blessing and a curse, because it creates guilt. Let’s eliminate that in 2019. I want to spend less time watching television, movies, and wasting time on the internet. Scrolling through social media, etc. Time is something you can’t buy.</p>\n\n<p>Therefore, I will commit to using technology less in 2019 and commit to spending my time taking care of my body, exploring the world, reading, writing, and being with people. I can track this with screen time, and try to create habits that disincentivize using technology.</p>\n\n<h2 id=\"2018-retrospective\">2018 Retrospective</h2>\n\n<p>Well, <a href=\"http://korbonits.github.io/2018/01/05/New-Years-Resolutions.html\">that was ambitious</a>.</p>\n\n<p>All in all, I did pretty well. Two major new hobbies emerged: writing prose and sailing. I read a lot of books, and traveled to two new countries (England and Portugal). I learned how to learn better than I had for a while.</p>\n\n<h3 id=\"grading-myself\">Grading myself</h3>\n\n<p>At a high level, for 2018 I had goals in the following categories:</p>\n<ul>\n  <li>Reading: success/failure</li>\n  <li>Writing: success</li>\n  <li>Travel: success</li>\n  <li>Fitness: failure (w/ sailing success)</li>\n  <li>Less television: success</li>\n  <li>Optimize volunteering: failure</li>\n  <li>Themes (organization): success/failure</li>\n</ul>\n\n<h4 id=\"reading-successfailure\">Reading: success/failure</h4>\n\n<p>This was the toughest goal (other than fitness).</p>\n\n<ul>\n  <li>Read 50 books/15,000+ pages: success</li>\n  <li>Great Books, year one: failure</li>\n  <li>Classic machine learning papers: failure</li>\n</ul>\n\n<p>In 2018 I read 14,564 pages of <strong>completed</strong> books on Goodreads, which is 47 books – definitely a success by OKR standards, and including The Great Books I read well over 15,000 pages. Hot damn. I pretty much read things in all of the categories I mentioned, but I mostly stuck to fiction. Here are <a href=\"https://www.goodreads.com/review/list/49504536-alex-korbonits?read_at=2018\">my 2018 books</a>.</p>\n\n<p>Great Books: I got really bored in the middle of Saint Augustine and sort of failed to continue. I’ll hold over this goal from last year.</p>\n\n<p>Classic machine learning papers: I read some of them, but not methodically. I did read a lot of machine learning papers in 2018, in particular the word embedding canon since 2013. I’ll carry this goal over into 2019.</p>\n\n<h4 id=\"writing-success\">Writing: success</h4>\n\n<p>Can you say NaNoWriMo ten times quickly?</p>\n\n<p>This is a goal I put off until August. I ostensibly failed at this given the explicit subgoals, but I succeeded beyond my wildest dreams of a year ago. In late August/early September, I started taking a <a href=\"https://hugohouse.org/classes/the-writers-welcome-kit/\">Writer’s Welcome Kit</a> class at <a href=\"http://hugohouse.org\">Hugo House</a>, both a class and an institution I can’t recommend highly enough. This began when I was feeling a bit behind on my writing goal for the year. I’m so glad I took the plunge. I spend almost two months writing about 1000 words per diem on single word prompts, and used a website I found via HackerNews called <a href=\"http://writingstreak.io\">writingstreak.io</a> to help track my progress. It was great for establishing a writing habit, however, I’m thinking of switching to Scrivener for larger projects or Evernote for everyday writing. Right now I’m using <a href=\"https://www.sublimetext.com/\">Sublime</a> and the command line for most of my writing. Sublime is the editor in which I write all of my code, including the markdown for this post, so for me it is a natural writing setting.</p>\n\n<p>In November I took a class on Novel Immersion through Hugo House, which was contemporaneous with <a href=\"http://nanowrimo.com\">NaNoWriMo</a>, short for National Novel Writing Month. A “winner” is someone who, in the month of November, completes (or begins, really) a 50,000 word manuscript of fiction. Anecdotally this is around 200-250 pages depending on the amount of dialogue. In short: I won! I learned a lot about getting words OUT in the months preceding NaNoWriMo (and I’m so glad I practiced), but the class really helped me focus on how to think about story, plot, character, dialogue, and voice in an immersive, accelerated fashion.</p>\n\n<p>I’m a <a href=\"https://www.urbandictionary.com/define.php?term=Pantser\">pantser</a> – it’s the only thing I know.</p>\n\n<p>Next year I’m going to learn how to edit, learn more about poetry, and try to complete the novel I began in November. Maybe make some submissions and try out other forms of writing.</p>\n\n<h4 id=\"travel-success\">Travel: success</h4>\n\n<p>Not only did I spend two weeks in France (with a 3-day jaunt to jolly old England), but I spent another week in Portugal (two days in Lisbon and four in the Algarve). So I went to 2 new countries. I also practiced French before I went. I was complimented by the French on my French deux fois during my trip there. That’s all I needed to hear.</p>\n\n<h4 id=\"fitness-failure-w-sailing-success\">Fitness: failure (w/ sailing success)</h4>\n\n<p>As for personal training, lifting, and running, I did pretty well during the first half of 2018. But when I cut personal training to focus on sailing, that’s when my fitness went downhill. For 2019 I’ll cut down on my goals to make them more attainable and focused. It wasn’t all for naught, however.</p>\n\n<p>Sailing: great success. This really deserves to be under its own heading. Who would have known that sailing would become such a passion? I started racing in the bitter cold (and snow) of winter in January and February. I started sailing almost weekly on Lake Union/Lake Washington throughout the spring. I crewed in many races (Frostbite, Goosebumps, Tri-Island, Dock Dodge, Kirkland). I acquired a sailboat! WTF. I learned so much about sailing in 2018. There’s so much more. My goal of entering one race and sailing 1x/month was blown out of the water before the first half of 2018. Most importantly, I made great friends in the sailing community. Sailors are the best.</p>\n\n<p>Racing/tracking/autocross: failure, but let’s call it “deferred”. I optimized my weekends (especially in the summer) around sailing. I can do this in 2019. It’ll be a carry-over, but not an explicit goal for 2019. It just wasn’t a priority.</p>\n\n<h4 id=\"less-television-success\">Less television: success</h4>\n\n<p>I did watch less television (and fewer movies) in 2018 but it was not as though I eliminated it. Things I watched in 2018:</p>\n\n<ul>\n  <li>Seinfeld</li>\n  <li>Frasier (8/11 of it)</li>\n  <li>Billions</li>\n  <li>Silicon Valley</li>\n  <li>Mozart in the Jungle</li>\n  <li>Vanity Fair (miniseries)</li>\n  <li>Bleak House (BBC miniseries).</li>\n</ul>\n\n<p>Many audiobooks were missed during the viewing of these TV shows.</p>\n\n<p>Two GREAT movies I saw in 2018 (not new) were both at <a href=\"https://cinerama.com/\">Cinerama</a> as part of their 70mm film festival. Lawrence of Arabia. 2001: A Space Odyssey. Amazing experiences.</p>\n\n<h4 id=\"optimize-volunteering-failure\">Optimize volunteering: failure</h4>\n\n<p>I failed at this. Here’s hope for 2019. Not a complete failure. I became proficient on 2 committees on which I serve, which is great. In 2019 I need to say no to too much and work with others to take my place. It’s time to move on from a couple of engagements through which I’ve learned much and have made many great friends.</p>\n\n<h4 id=\"themes-successfailure\">Themes: success/failure</h4>\n\n<p>What the hell is “themes,” you ask? Organization was the main theme. Even though I didn’t finish reading <a href=\"https://www.amazon.com/Getting-Things-Done-Stress-Free-Productivity/dp/0143126563\">Getting Things Done</a>, I got part one down quite well. I used Trello all year to keep track of things. Not perfectly… but that wasn’t the point. I tracked things all year on boards, and used them to track many of the things on my 2018 resolutions. <strong>I made my 2018 New Years Resolutions last all year</strong> – I kept them in mind throughout 2018. That’s a success for organization. It’s not all roses. I failed in some respects. At times my Trello boards became bloated and/or outdated. I am still a procrastinator for things like making appointments for things that take place during the week – seems like a waste of time to be out of the office. In 2019, I will do better.</p>\n\n<h2 id=\"bibliography\">Bibliography</h2>\n\n<div class=\"footnotes\" role=\"doc-endnotes\">\n  <ol>\n    <li id=\"fn:0\" role=\"doc-endnote\">\n      <p>Hochreiter, Sepp, and Jürgen Schmidhuber. “Long short-term memory.” Neural computation 9.8 (1997): 1735-1780. <a href=\"#fnref:0\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>",
  "pubDate": "Tue, 01 Jan 2019 00:00:00 +0000",
  "link": "http://korbonits.github.io/2019/01/01/New-Years-Resolutions-2019.html",
  "guid": "http://korbonits.github.io/2019/01/01/New-Years-Resolutions-2019.html"
}