{
  "guid": "urn:uuid:f5cef31c-387d-452b-811c-0fcf902566a4",
  "link": "https://www.who.int/news/item/07-03-2022-act-now-to-save-lives-and-prevent-migrants-from-going-missing",
  "a10:author": {
    "a10:name": ""
  },
  "title": "Act now to save lives and prevent migrants from going missing",
  "description": "As heads of the United Nations Network on Migration’s Executive Committee, the International Committee of the Red Cross, the International Federation of Red Cross and Red Crescent Societies and the International Commission on Missing Persons, we call on States to urgently assume collective responsibility to save lives and prevent migrants from going missing or dying along migration routes and to search for and identify those who have gone missing and to assist their families.",
  "pubDate": "Mon, 07 Mar 2022 17:37:06 Z",
  "a10:content": "<p>Thousands of migrants go missing or die each year along migration routes. In 2018, United Nations Member States committed to &ldquo;save lives and establish coordinated international efforts on missing migrants&rdquo; by adopting the Global Compact for Safe, Orderly and Regular Migration (GCM). Four years and more than <a href=\"http://missingmigrants.iom.int/\">15,000 documented deaths</a> later, efforts to provide a meaningful response to this ongoing human tragedy cannot be put off any further.<br /></p><p>As heads of the United Nations Network on Migration&rsquo;s Executive Committee, the International Committee of the Red Cross, the International Federation of Red Cross and Red Crescent Societies and the International Commission on Missing Persons, we call on States to urgently assume collective responsibility to save lives and prevent migrants from going missing or dying along migration routes and to search for and identify those who have gone missing and to assist their families. This is in line with the GCM, including Objectives 8 (save lives), 5 (regular pathways), 7 (reduce vulnerabilities in migration), and 23 (strengthen international cooperation) and with relevant obligations under international law.&nbsp;</p><p>With migration policies becoming ever more restrictive and as safe and regular migration pathways remain out of reach for so many, including in the context of the COVID-19 pandemic, many people seeking family reunification, decent work, dignity, better opportunities or who are compelled to leave owing to disasters and precarious situations have few options other than irregular migration along riskier routes and are often forced to rely on smugglers to facilitate the passage.<em>&nbsp;</em>The consequences are acutely visible: from the Mediterranean Sea, the Atlantic Ocean, and the Andaman Sea, to the Sahara Desert, and along migration corridors in the Americas, the death or disappearance of migrants has become all too frequent.&nbsp;</p><p>Over the past eight years, more than 47,000 people have died along these and other routes around the world. Many more deaths go unrecorded. This figure does not include the thousands of migrants who go missing each year because they are unable to establish contact with their families<strong> </strong>&nbsp;-- whether victims of enforced disappearance, detained or stranded, hiding for fear of arrest or deportation, unaccompanied and separated children or those who have been severely injured.<br /></p><p>When people go missing along migration routes, their families often face devastating socio-economic, psychological, administrative, and legal consequences. The disappearance of a relative is not only cause for anguish, but it may affect access to property, inheritance, parental or social welfare rights.&nbsp;</p><p>Addressing these dynamics is the responsibility of all countries -- of origin, transit and destination &ndash; and requires multi-stakeholder efforts, involving both local and national actors, and in which the voices of migrants and engagement of affected families remain central.<br /></p><p>We are also particularly alarmed about the growing trend of criminalizing or obstructing efforts to provide life-saving humanitarian assistance, including search and rescue efforts and medical care to migrants in need, which runs contrary to the commitment expressed in Objective 8 of the GCM.</p><p>We call on States to respect obligations under international law, including human rights law, upholding the right to life and right to health for all individuals, irrespective of nationality, ethnic or social origin, gender, migration status or other grounds, the right to family life, the best interests of children, and the absolute prohibition of enforced disappearance or arbitrary detention, amongst others.&nbsp;<br /></p><p>Ahead of the first International Migration Review Forum (IMRF) to be held from 17-20 May 2022 to review progress made in implementing the GCM, we also call on States to:<br /></p><p><strong>Prevent migrants from dying or going missing by</strong>:</p><ul><li>Prioritizing and cooperating in search and rescue operations to render assistance to migrants regardless of their migration status, including through clear and predictable disembarkation mechanisms that ensure that survivors are delivered to a <a href=\"https://wwwcdn.imo.org/localresources/en/OurWork/Facilitation/Documents/MSC.167%20(78).pdf\">place of safety</a> and that all children receive adequate non-custodial care and reception;</li><li>Supporting the efforts of humanitarian organizations and crews of commercial vessels, where appropriate, to provide lifesaving assistance, healthcare and protection to migrants at land and at sea, and refraining from criminalizing, obstructing or otherwise deterring the efforts of those who provide such assistance;</li><li>Assessing the impact of migration-related laws, policies and practices on a regular basis and revising those, as necessary, to ensure that they are in line with international legal obligations and do not create or exacerbate the risk of migrants dying or going missing;</li><li>Enabling migrants and their families to establish, restore, or maintain contact along migratory routes and at destination;</li><li>Creating and strengthening possibilities for safe and regular migration in a manner that upholds&nbsp;the right to family life and responds&nbsp;to the needs of migrants in a situation of vulnerability as well as practices for admission and stay based on compassionate, humanitarian or other considerations for migrants compelled to leave their countries of origin.</li></ul><p><strong>Search and identify those who have died or gone missing by:</strong><br /></p><ul><li>Setting up transnational mechanisms to allow for information exchange and coordinated efforts across countries of origin, transit and destination to search for and identify those who have died or gone missing, in cooperation with relevant stakeholders, including the families of the missing, while respecting the right to safety, privacy and data-protection standards;</li><li>Regularly collecting and making data on migrant deaths and missing migrants publicly available in accordance with the right to privacy and data protection.</li></ul><p><strong>Provide support and redress to the families of those who have died or gone missing by:</strong></p><ul><li>Providing avenues through which families can register cases of missing persons and obtain information on search efforts, while respecting the right to privacy and protecting personal data;</li><li>Ensuring that families of missing migrants in countries of origin, transit and destination are able to exercise their rights and access services and other support to meet their specific needs;</li><li>Ensuring access to justice, accountability and redress for migrants and their families by carrying out independent, impartial and thorough investigations into all allegations where migrants&rsquo; lives or safety were endangered in the course of their journey and where they were subjected to violations of their rights, whether by State or non-State actors, including as a result of aggravated smuggling or trafficking;</li><li>Establishing procedures for the dignified recovery, identification, transfer and burial of the remains of deceased migrants, and appropriately notifying and assisting their families in this regard.</li></ul><p>While there is much more to be done, there is a growing body of practice, knowledge and guidance that can inform coordinated efforts to translate commitments under international law and the GCM Objectives into reality. International, regional and sub-regional bodies can play an important role in facilitating these efforts, together with local actors and communities.</p><p>Ahead of the IMRF, we call on States to make concrete commitments and pledges to action, to mobilize efforts to save lives and prevent migrants from going missing.</p><p>Our organizations stand ready to support States to implement these commitments to ensure that humanitarian principles and the human rights of migrants and their families remain at the center of all actions.</p><p>Ant&oacute;nio Vitorino, <em>Director-General</em> of the IOM&nbsp;and Coordinator of the UN Network on Migration</p><p>Guy Ryder, <em>Director-General</em> of ILO</p><p>Michelle Bachelet, <em>UN High Commissioner</em> for Human Rights</p><p>Liu Zhenmin, <em>Under-Secretary-General </em>for Economic and Social Affairs</p><p>Achim Steiner, UNDP <em>Administrator</em></p><p>Filippo Grandi, <em>UN High Commissioner</em> for Refugees</p><p>Catherine M. Russell, <em>Executive Director </em>of UNICEF</p><p>Ghada Fathi&nbsp;Waly, <em>Executive Director</em> of UNODC</p><p>Tedros Adhanom&nbsp;Ghebreyesus, <em>Director-General </em>of WHO</p><p>Peter Maurer, <em>President</em> of the ICRC</p><p>Francesco Rocca, <em>President</em> of the IFRC</p><p>Kathryne Bomberger, <em>Director-General </em>of ICMP</p><p><em>The United Nations Network on Migration was established to ensure effective, timely and coordinated system-wide support to Member States in their implementation, follow up and review of the Global Compact for Safe, Orderly and Regular Migration. While the Network&rsquo;s mandate is focused on the GCM, States are called to also implement these recommendations as relevant to refugees and to protect the human rights of everyone equally, regardless of migration status.</em><em></em></p><p><em>For more information and media requests, please contact:</em></p><p><em>Florence Kim, at the UN Network on Migration secretariat:&nbsp; </em><a href=\"mailto:fkim@iom.int\"><em>fkim@iom.int</em></a><em>; +41 79 748 03 95.</em></p><p>&nbsp;</p>"
}