{
  "title": "S6: Did the Eurogroup save the day?",
  "link": "https://audioboom.com/posts/7553451",
  "itunes:season": 6,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 3192,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>After its longest meeting ever, the Eurogroup reached an agreement yesterday evening. What does the agreement say? What does it mean in terms of the emergency reaction to the economic fallout of the COVID-19 pandemic? What does it mean, more broadly, for the future of Europe? This week, Giuseppe Porcaro is joined by Maria Demertzis, André Sapir and Guntram Wolff to discuss whether the Eurogroup can save the day.<br>\n<br>\n<em>This podcast is a member of the </em><a href=\"https://www.bullemedia.eu/europod\"><em>Europod network</em></a><em>. <br>\n<br>\n</em>The podcast started by the participants giving their view on the deal that was closed last night by the Eurogroup. Guntram Wolff noted that is was good to have a deal, even if it is small in his view. André Sapir also expressed reserved satisfaction for the deal. He was however not surprised, as more could only come from the heads of state and that it is part of the Eurogroup’s habits to increase firepower over time. Maria Demertzis found it is surprising that the longest ever Eurogroup meeting led to such a small result and though this was a bad signal. She did agree with her co-panellists that some agreement was better than no agreement in this case.  </div>\n<div> </div>\n<div>Jumping into the debate, the panellists were asked to reflect on what the measures meant in more detail. André Sapir started by mentioning that of the €540 billion announced, about half (€240 billion) would be provided by the European Stability Mechanism (ESM), each Member State would have access to a credit line equivalent to 2% of their GDP. He added that it was clear however that not all Member States would use the ESM credit line making the €240 billion a maximum rather than the actual amount deployed. Guntram Wolff agreed with this and noted that the ESM was after all a stopgap in case borrowing from the markets became less accessible for a certain country. He added that the ESM package also reflected a movement towards a larger role for fiscal policy in the Euro Zone which was positive. In addition, he noted that it was still the ECB, which through its interventions, is keeping the yields of countries like Italy down and allows them to implement ambitious economic support packages. On the same line, Maria Demertzis agreed and stated that while countries like the Netherlands and Germany do not need ESM credit lines, even countries such as Italy or Span might not use them, as they do not which to be subjected to the conditionality that is attached to it. </div>\n<div> </div>\n<div>Afterwards, the panel went on to discuss the other measures that were part of the package agreed upon by the Eurogroup. Maria Demertzis expressed her satisfaction about the common unemployment insurance, temporary Support to mitigate Unemployment Risks in an Emergency (SURE), which putting aside its relatively small size, is a step in the right direction. Indeed, it provides an automatic stabilizer and could set a good precedent. André Sapir expressed more reservation about whether SURE would one day become a permanent tool, given that its temporary nature is clear in the text. Guntram Wolff agreed that SURE was a good tool as it operates through credit guarantees and through the Commission’s budget. This means that money could be better directed at countries that need it the most. </div>\n<div> </div>\n<div>The panellists followingly discussed issues related to the Italian economy and whether this would lead to debt sustainability issues. Guntram Wolff mentioned that the economic downturn in Italy is likely to be huge, not so much because it was badly affected by the pandemic, but because tourism represents a large share of its economy. He did not think, however, that Italian debt would become unsustainable, at least not as long as yields remained low thanks to the ECB. He therefore argued that Italy should have a large economic support programme. Maria Demertzis was less convinced that Italy did not run any debt sustainability risks due to the current crisis. She noted that while yields mattered, the stock of debt and economic growth were also key determinants of debt sustainability. While the ECB would have to roll over Italian debt indefinitely and probably further expand its Italian debt holdings, low growth could still lead to a bad equilibrium. She called for a deeper reflection into options to monetize debt in order to keep it sustainable. Guntram Wolff agreed and added that the real limits were political and legal in this discussion. </div>\n<div> </div>\n<div>The panellists were asked to conclude with some final thoughts. André Sapir noted that it was important to keep in mind the needs of non-Euro Zone EU Member States, even if they appeared less affect by the pandemic for the moment. Maria focused on a quote from the final text of the agreement that she was positive about: “a response commensurate with the size of crisis”.  She explained that it was reflective of the new awareness of the Eurogroup about the urgency of the situation. Guntram Wolff concluded with two final remarks. First, that one should not only look at the size of the Eurogroup’s package but rather at the size of fiscal support at a national level. Second, although the idea of a federal Europe seems desirable it remains distant, but it is in the interest of all Eurozone countries to help struggling neighbours and this should be reflected by the politics as well. </div>\n",
  "pubDate": "Fri, 10 Apr 2020 13:16:41 +0000",
  "guid": "tag:audioboom.com,2020-04-10:/posts/7553451",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}