{
  "title": "Developing Modular Autonomous Capabilities for sUAS Operations. (arXiv:2211.01813v1 [cs.RO])",
  "link": "http://arxiv.org/abs/2211.01813",
  "description": "<p>Small teams in the field can benefit from the capabilities provided by small\nUncrewed Aerial Systems (sUAS) for missions such as reconnaissance, hostile\nattribution, remote emplacement, and search and rescue. The mobility,\ncommunications, and flexible payload capacity of sUAS can offer teams new\nlevels of situational awareness and enable more highly coordinated missions\nthan previously possible. However, piloting such aircraft for specific missions\ndraws personnel away from other mission-critical tasks, increasing the load on\nremaining personnel while also increasing complexity of operations. For wider\nadoption and use of sUAS for security and humanitarian missions, safe and\nrobust autonomy must be employed to reduce this burden on small teams. In this\npaper, we present the development of the Collaborative-UAS for Hostile\nAttribution, Surveillance, Emplacement, and Reconnaissance (CHASER) testbed,\nfor rapidly prototyping capabilities that will reduce strain on small teams\nthrough sensor-guided autonomous control. We attempt to address autonomy needs\nunfilled by commercial sUAS platforms by creating and testing a series of\ncomposable modules that can be configured to support multiple missions. Methods\nimplemented and presented here include radar track correlation, on-board\ncomputer vision target detection, target position estimation, closed-loop\nrelative position control, and efficient search of a 3D volume for target\nacquisition. We configure and test a series of these modules in an example\nmission, executing a fully autonomous chase of an intruding sUAS in live\nflight, and demonstrating the success of the modularized autonomy approach. We\npresent performance results from simulation or live flight tests for each\nmodule. Lastly, we describe the software architecture that we have developed\nfor flexible controls and comment on how the capabilities presented may enable\nadditional missions.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Quigley_K/0/1/0/all/0/1\">Keegan Quigley</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Goodwin_V/0/1/0/all/0/1\">Virginia Goodwin</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Alvarez_L/0/1/0/all/0/1\">Luis Alvarez</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Yao_J/0/1/0/all/0/1\">Justin Yao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Maclara_Y/0/1/0/all/0/1\">Yousef Salaman Maclara</a>"
}