{
  "id": "yt:video:8dTRx9YsbwA",
  "yt:videoId": "8dTRx9YsbwA",
  "yt:channelId": "UCMTk_R_Y49jvq-HQXDmKI0Q",
  "title": "The Family YouTuber Who Gave Away Her Son - Myka Stauffer | TRO",
  "link": "",
  "author": {
    "name": "The Right Opinion",
    "uri": "https://www.youtube.com/channel/UCMTk_R_Y49jvq-HQXDmKI0Q"
  },
  "published": "2020-11-05T22:00:00+00:00",
  "updated": "2022-06-02T08:29:38+00:00",
  "media:group": {
    "media:title": "The Family YouTuber Who Gave Away Her Son - Myka Stauffer | TRO",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Go to https://buyraycon.com/TRO 15% off your order! Brought to you by Raycon\n\nThe Right Opinion: The Family YouTuber Who Gave Away Her Son - Myka Stauffer | TRO\n\n0:00 - Intro\n9:10 - Brave New World\n18:25 - After Many A Summer\n25:18 - The Genius and The Goddess\n31:28 - Point Counter Point\n38:24 - Antic Hay\n44:11 - Those Barren Leaves\n52:10 - Island\n58:47 - Time Must Have A Stop\n\nIntro:\n\nFamily. For better and for worse, there is no connection like the one you create with the family, I have discussed this time and time again, so I shan’t go into too much depth on my philosophical thoughts on one’s kinsfolk, but as you are all aware by this point, emotional potential, breeds market potential, and the family channel took its place on the YouTube terrain a long time ago. \n\nNow, family channels are no stranger to criticism. The extent that some families will go for views, often places some of the channels at odds with the rather rigorous standards that audience members impose for such creators, why do these standards exist? Well, because of the children. If you are a parent, many would assert that you have a responsibility to preserve as idyllic a childhood as possible for your offspring, and that degree of responsibility is only amplified when you’re uploading content of your family onto a public platform.\n\nIn spite of this, most criticism is typically confined to parents failing to be adequate role models, not just for their own family, but for others who they are supposed to be educating through their content. Some of these escapades may lead to some asking if they are equipped properly to even have children, however, it is seldom the parents who are asking that question, or even acting on such inclination, this is where today’s subjects appear to be an exception.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}