{
  "title": "Wired for Pleasure | Jaiya Ma on desire, seduction and embracing your erotic blueprint",
  "pubDate": "Tue, 13 Feb 2018 16:36:32 +0000",
  "guid": "c87b19eefb677da597410075f48ab059",
  "link": "https://tonyrobbins.libsyn.com/wired-for-pleasure-jaiya-ma-on-desire-seduction-and-embracing-your-erotic-blueprint",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">What have you been taught about pleasure? What have you learned about sexual connection? Does the very thought of answering those questions make you uncomfortable?</span></p> <p> </p> <p><span style=\"font-weight: 400;\">In this episode of the Tony Robbins Podcast, our host, Ana Yoerg, is sitting down with renowned sexologist, Jaiya, and her partner, Ian.</span> <a href= \"http://missjaiya.com\"><span style= \"font-weight: 400;\">Jaiya</span></a> <span style= \"font-weight: 400;\">is the author of Red Hot Touch and Founder of New World Sex Education - a company dedicated to using education to help men and women get the sex lives they’ve always wanted. And her mission is to help unleash erotic ecstasy and shift the cultural view of sexuality from being something that is bad, wrong or shameful to something that is seen as healthy and worth cultivating, and even worth celebrating. You may have seen Jaiya on The Doctors, GMA, Nightline or CNN. And she’s been a guest speaker at Tony’s Platinum Partner events.</span></p> <p> </p> <p><span style=\"font-weight: 400;\">And today - we’re exploring the ultimate language of connection, passion and sexual satisfaction - which Jaiya refers to as The Erotic Blueprint. Jaiya created the Erotic Blueprint framework to help you discover your personal map of sexual arousal and how you can understand yourself and your partner on a deeper level than ever before. Because it’s not just about being able to communicate what you need, it’s about speaking the same language as your partner, and learning how to honor and fulfill their needs. This is the path to connection. And it’s the way to opening up new possibility for seduction, enticement and a deeper level of intimacy than you’ve ever experienced before.</span></p>",
  "content:encoded": "<p>What have you been taught about pleasure? What have you learned about sexual connection? Does the very thought of answering those questions make you uncomfortable?</p> <p> </p> <p>In this episode of the Tony Robbins Podcast, our host, Ana Yoerg, is sitting down with renowned sexologist, Jaiya, and her partner, Ian. <a href= \"http://missjaiya.com\">Jaiya</a> is the author of Red Hot Touch and Founder of New World Sex Education - a company dedicated to using education to help men and women get the sex lives they’ve always wanted. And her mission is to help unleash erotic ecstasy and shift the cultural view of sexuality from being something that is bad, wrong or shameful to something that is seen as healthy and worth cultivating, and even worth celebrating. You may have seen Jaiya on The Doctors, GMA, Nightline or CNN. And she’s been a guest speaker at Tony’s Platinum Partner events.</p> <p> </p> <p>And today - we’re exploring the ultimate language of connection, passion and sexual satisfaction - which Jaiya refers to as The Erotic Blueprint. Jaiya created the Erotic Blueprint framework to help you discover your personal map of sexual arousal and how you can understand yourself and your partner on a deeper level than ever before. Because it’s not just about being able to communicate what you need, it’s about speaking the same language as your partner, and learning how to honor and fulfill their needs. This is the path to connection. And it’s the way to opening up new possibility for seduction, enticement and a deeper level of intimacy than you’ve ever experienced before.</p>",
  "enclosure": "",
  "itunes:duration": "01:09:40",
  "itunes:explicit": false,
  "itunes:keywords": "MA,Relationships,sexologist,tony,erotic,robbins,blueprint,jaiya",
  "itunes:subtitle": "What have you been taught about pleasure? What have you learned about sexual connection? Does the very thought of answering those questions make you uncomfortable?   In this episode of the Tony Robbins Podcast, our host, Ana Yoerg, is sitting...",
  "itunes:episodeType": "full"
}