{
  "title": "S17 Ep117:    Deflecting Curses: The Bane of Negative Thinking w/ Yoitchi Utebi",
  "link": "https://audioboom.com/posts/8165761",
  "itunes:episode": 117,
  "itunes:title": "Deflecting Curses: The Bane of Negative Thinking w/ Yoitchi Utebi",
  "itunes:season": 17,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4741,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Darkness Radio Presents:  Deflecting Curses: The Bane of Negative Thinking w/ Yoitchi Utebi!<br>\n<br>\nPolish your mind to repel the negative influence of ill wishes<em> ...<br>\n</em><br>\nFor most of us, the word ‘curse’ brings fantastical images of black magic, witches’ cauldrons, and a little “eye of newt and toe of frog” to mind, especially as the Halloween season rolls around. But though we may be tempted to believe they are merely fantasy, curses can, in fact, be a very real manifestation of negative thoughts. <br>\n<br>\nKnowing that our thoughts shape our reality, most of us have focused on using the power of positive thinking and acts of love, to try and create harmony, happiness, and success in our lives. However, we cannot ignore the existence of the negative alongside the positive in this world. If we are not mindful of our negative thinking, what Buddhist teachings call the “Poisons of the Mind,” we stand the chance of allowing those thoughts to grow strong enough to actualize harm on ourselves or others. Yes, there is power in positive thinking, but there is equal and opposite power in negative thinking.<br>\n<br>\nHappy Science Lecturer and Producer of the new movie, <em>The Divine Protector: Master Salt Begins, </em>Yoitchi Utebi joins Darkness Radio to draw parallels between curses in the movie and curses in real life!<br>\n<br>\nYou can check out the new movie, which hits limited theatrical release, VOD, and DVD on October 21st here: <a href=\"https://mastersaltmovie.com/\"> https://mastersaltmovie.com/</a><br>\n<br>\n#paranormal  #supernatural  #metaphysical  #paranormalpodcasts  #darknessradio  #timdennis #yoitchiutebi  #mastersalt #buddhism #dogma #curses #spiitualcleansing #ghosts  #spirits  #spectres #hauntings #hauntedhouses #haunteddolls #demons #deliverances #exorcisms #angels #guardianangels #spiritguides #Psychics #mediums #tarot  #ouija  #shadowpeople #conspiracytheory #neardeatheexperience <br>\n<br>\n\n</div>\n",
  "pubDate": "Thu, 29 Sep 2022 08:00:00 +0000",
  "guid": "tag:audioboom.com,2022-09-29:/posts/8165761",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}