{
  "id": "yt:video:seggUWNVRh8",
  "yt:videoId": "seggUWNVRh8",
  "yt:channelId": "UCW39zufHfsuGgpLviKh297Q",
  "title": "Body positivity and self-love: Embracing your own beauty | DW Documentary",
  "link": "",
  "author": {
    "name": "DW Documentary",
    "uri": "https://www.youtube.com/channel/UCW39zufHfsuGgpLviKh297Q"
  },
  "published": "2022-11-02T17:00:42+00:00",
  "updated": "2022-11-04T15:47:43+00:00",
  "media:group": {
    "media:title": "Body positivity and self-love: Embracing your own beauty | DW Documentary",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "When she looks in the mirror, Akanksha Sood Singh feels shame. The successful filmmaker and mother of two loves her life but hates her body. A flawless figure and unblemished skin – the Indian beauty standards of ‘perfection’ are unattainable. How can she escape that pressure? Photographer and activist Roshni Kumar knows how women can overcome body shame: empowerment and self-love. Roshni takes Akanksha on a journey to recognize her self-worth and love the skin she’s in. Will she rise to the challenge? \n\nFind a job, have a family, make money – what if this is not your dream, but your parent’s idea and your community’s norms? To free yourself, go on a journey. With the help of your role model, you will find out: can you take charge of your own life and make your own choices? DW presents 'Choices: Dare to Dream'. \n\nEpisode 1: How to wrestle with gender norms and win - https://youtu.be/j3YBVc9dgMo\n\n#documentary #dwdocumentary #DWChoices \n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: \n⮞ DW Documentary (English): https://www.youtube.com/dwdocumentary\n⮞ DW Documental (Spanish): https://www.youtube.com/dwdocumental\n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/dwdocarabia\n⮞ DW Doku (German): https://www.youtube.com/dwdoku\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/dwdochindi\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}