{
  "title": "Longevity and Supplements",
  "link": "",
  "published": "2021-02-03T22:00:00+00:00",
  "updated": "2021-02-03T22:00:00+00:00",
  "author": {
    "name": "Sebastian Nowozin"
  },
  "id": "tag:www.nowozin.net,2021-02-03:/sebastian/blog/longevity-and-supplements.html",
  "summary": "<p><em>TLDR</em>: in the past decade longevity has emerged as a serious research field.\nThere are now a number of studies that indicate that a number of safe\nsupplements may likely extend lifespan and health in adult humans.</p>\n<p><em>Note</em>: I normally …</p>",
  "content": "<p><em>TLDR</em>: in the past decade longevity has emerged as a serious research field.\nThere are now a number of studies that indicate that a number of safe\nsupplements may likely extend lifespan and health in adult humans.</p>\n<p><em>Note</em>: I normally blog about statistics and machine learning.  This article is\ndifferent and I hope my readers will find the information interesting.</p>\n<h1>Healthy Ageing</h1>\n<blockquote>\n<p>\"I would like to live long and in good health.\"</p>\n<p>-- Approximately 99 percent of humans.</p>\n</blockquote>\n<p>Modern societies enable us to live in good health.  Investment into healthcare\nsystems, emergency response, medical research, pharmaceutical industries, but\nalso elderly care facilities, gyms and sports, as well as educational policies\nand taxes for products causing ill health such as alcohol and tobacco all lead\nto better health outcomes and longer lives.  Even policies and politics that\nlead to <a href=\"https://towardsdatascience.com/has-global-violence-declined-a-look-at-the-data-5af708f47fba\">world peace and lower violence have remarkable outcomes on\nlongevity</a>.</p>\n<p>These efforts have been remarkably effective, and globally so:\nin 1900 the <a href=\"https://www.who.int/global_health_histories/seminars/presentation07.pdf\">global average life expectancy at\nbirth</a>\nwas just 31 years.\nIn 2020 it is 72.6 years.\nThe <a href=\"https://www.macrotrends.net/countries/WLD/world/life-expectancy\">average increase per year in life expectancy globally between 2000 and\n2020</a> has been\n0.46 percent.</p>\n<p>Despite this amazing progress, the idea of systematically aiming scientific\nresearch at directly extending lifespan or even to overcome death entirely is\nrecent.\nOf course, the idea of living forever---to cheat death---is not new.\nIn fact, it appears in the <a href=\"https://en.wikipedia.org/wiki/Epic_of_Gilgamesh\">oldest surviving\nstory</a>.\nHowever, before the last decade most serious scientists did not consider\nit possible to overcome death;\nafter all any empiricist can see that all humans eventually have to die.\n<a href=\"https://www.ynharari.com/\">Yuval Harari</a> puts this as follows:</p>\n<blockquote>\n<p>\"Even a few years ago, very few doctors or scientists would seriously say\nthat they are trying to overcome old age and death. They would say no, I am\ntrying to overcome this particular disease, whether it's tuberculosis or\ncancer or Alzheimers. Defeating disease and death, this is nonsense, this is\nscience fiction.\"</p>\n<p>--- Yuval Harari, in a <a href=\"https://www.edge.org/conversation/yuval_noah_harari-daniel_kahneman-death-is-optional\">2015 interview with Daniel Kahnemann</a></p>\n</blockquote>\n<p>Not only has the last decade changed the view of serious scientists, there are now organized efforts and serious funding.\nThe <a href=\"https://www.sens.org/\">SENS foundation</a>, founded in 2009, has <a href=\"https://www.sens.org/wp-content/uploads/2020/10/SRF-2020-Annual-Report-R2.pdf\">limited\nfunding</a>\nbut coordinates a number of research programmes and <a href=\"https://www.sens.org/our-research/investments/\">investments in longevity\nstartups</a>.\n<a href=\"https://www.calicolabs.com/\">Calico</a>, founded in 2013 as part of Google, has a\nmission to combat ageing and 2.5B USD investment.\n<a href=\"https://www.juvlabs.com/\">Juvenescence</a>, a UK-based longevity startup <a href=\"https://www.ft.com/content/ddec6a10-c046-11e9-b350-db00d509634e\">secured\n100M USD investment in 2019</a>.\nThere are many other smaller companies and institutional investors now\nregularly fund these startups.\nFor investors it makes sense: not only is the total addressable market of\nlongevity products all of humanity, but it also seems that a technical solution\nto death is in reach within our lifetime.\nYuval Harari again puts it better than I could:</p>\n<blockquote>\n<p>\"People never die because the Angel of Death comes, they die because their\nheart stops pumping, or because an artery is clogged, or because cancerous\ncells are spreading in the liver or somewhere. These are all technical\nproblems, and in essence, they should have some technical solution. And this\nway of thinking is now becoming very dominant in scientific circles, and also\namong the ultra-rich who have come to understand that, wait a minute,\nsomething is happening here. For the first time in history, if I'm rich\nenough, maybe I don't have to die.\"</p>\n<p>--- Yuval Harari, in the same <a href=\"https://www.edge.org/conversation/yuval_noah_harari-daniel_kahneman-death-is-optional\">2015 interview</a></p>\n</blockquote>\n<p>In parallel to these more visible investments and research efforts, there is\nalso a renewed interest in the study of ageing-related effects in existing\nmedication and nutritional supplements.\nIn the remainder of this post we will look at some of the safer supplements and\nwhat we now know about them.</p>\n<p>But first, a disclaimer.</p>\n<p><em>Disclaimer</em>:\nThis article is not a substitute for consulting your physician about which\nsupplements may or may not be right for you.  I do not endorse supplement use\nor any product or supplement vendor, and all descriptions here are for\nscientific interest.  Also: I am not a medical doctor or physician.</p>\n<p>With the disclaimer out of the way, lets start.</p>\n<h2>Alpha-Ketoglutarate (AKG)</h2>\n<ul>\n<li>Supplement name: Arginine Alpha-Ketoglutarate (AAKG)</li>\n<li>Typical supplement dosage: 2000 mg/day</li>\n<li>Typical supplement price: 0.35 USD/day</li>\n</ul>\n<p>Alpha-Ketoglutarate is naturally present in human blood plasma and is part of\nthe metabolic cycle.  However, naturally occuring AKG levels decrease severely\nwith age, with a ten-fold reduction between the age of 40 and 80 years.\nAs a supplement AKG has an excellent safety record and is widely and freely\navailable, commonly used in the bodybuilding community.\nTwo reviews on what is known about the effects on AKG in the human body are\n<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4703346/\">(Wu et al., Biomol Ther,\n2016)</a> and <a href=\"https://downloads.hindawi.com/journals/bmri/2018/3408467.pdf\">(Liu et al.,\nBioMed Research International,\n2018)</a>.</p>\n<p>AKG was first identified as a possible longevity supplement in the <a href=\"https://en.wikipedia.org/wiki/Nematode\">nematode</a>\n<a href=\"https://en.wikipedia.org/wiki/Caenorhabditis_elegans\"><em>C.  elegans</em></a> animal model,\n<a href=\"https://www.nature.com/articles/nature13264\">(Chin et al., Nature 2014)</a>,\n<a href=\"https://www.researchgate.net/profile/Stephen_Whelan2/publication/262340044_The_metabolite_a-ketoglutarate_extends_lifespan_by_inhibiting_ATP_synthase_and_TOR/links/54f8d6e00cf2ccffe9df5eee/The-metabolite-a-ketoglutarate-extends-lifespan-by-inhibiting-ATP-synthase-and-TOR.pdf\">(free PDF)</a>.\nIn that study the authors demonstrated a concentration-dependent improvement of lifespan,\nachieving an almost 50 percent increase in lifespan and delaying age-related diseases.\nMoreover, Chin et al. identified one causal mechanism for these benefits.</p>\n<p><a href=\"https://www.cell.com/cell-metabolism/fulltext/S1550-4131(20)30417-4\">(Shahmirzadi et al., Cell, 2020)</a>,\n<a href=\"https://www.biorxiv.org/content/biorxiv/early/2019/10/04/779157.full.pdf\">(preprint PDF)</a>\nreport on a study done in mice.  They demonstrate robust improvements in\nlifespan and healthspan when supplementing the mouse diet with AKG, with\nlifespan increased by about 10 percent (slightly more for female mice, slightly\nless for male mice).\nIn particular, the AKG supplementation postpones the occurence of a number of\naging phenotypes such as deterioration of color in the fur and weakened grip\nstrength of the mice, and improvements are also present when only starting AKG\nsupplementation in the later half of the mouse's life.</p>\n<p>The study concludes:</p>\n<blockquote>\n<p>\"Given its <a href=\"https://en.wikipedia.org/wiki/Generally_recognized_as_safe\">GRAS\nstatus</a> and human\nsafety record, our findings point to a potential safe human intervention that\nmay impact important elements of aging and improve quality of life in the\nelderly population.\"</p>\n<p>--- Shahmirzadi et al., 2020</p>\n</blockquote>\n<h2>Glucosamine Sulphate</h2>\n<ul>\n<li>Supplement name: Glucosamine Sulphate</li>\n<li>Typical supplement dosage: 1500 mg/day</li>\n<li>Typical supplement price: 0.10 USD/day</li>\n</ul>\n<p>Glucosamine is a supplement commonly used to manage joint pain as it <a href=\"https://www.magonlinelibrary.com/doi/abs/10.12968/bjcn.2002.7.3.10214\">has been\nshown to be able to relieve joint\npain</a>.\nA recent study <a href=\"https://www.bmj.com/content/bmj/365/bmj.l1628.full.pdf\">(Ma et al., BMJ, 2019)</a> \nbased on large sample observational <a href=\"https://www.ukbiobank.ac.uk/\">UK Biobank</a>\ndata showed that regular use of glucosamine supplements is associated with\nlowering the risk of cardiovascular disease.\nAnother recent study,\n<a href=\"https://ard.bmj.com/content/79/6/829\">(Li et al., Annals of the Rheumatic Diseases, 2020)</a>,\nalso based on large sample observational <a href=\"https://www.ukbiobank.ac.uk/\">UK Biobank</a> data (<span class=\"math\">\\(n=495,077\\)</span>)\nfinds compelling evidence that Glucosamine may lead to overall reduced mortality.\nWhile Li et al. do not perform a randomized controlled trial and hence such\nobservational data does not imply causation, they do consider confounders and\nperform a detailed analysis on large sample subgroups.  They carefully note:</p>\n<blockquote>\n<p>\"In general, with the current observational study design the possibility of\nresidual confounding due to imprecise measurements or unknown factors cannot\nbe excluded for all findings in our study, despite our careful adjustment of\nall measured confounders.\"</p>\n</blockquote>\n<p>However, the effect size in Li's study is large: assuming an absence of non-measured\nconfounders, the <a href=\"https://en.wikipedia.org/wiki/Hazard_ratio\">hazard ratio</a> for\na nine year follow-up period for overall mortality is 0.85 with regular\nglucosamine supplementation, meaning that there is a 15 percent less death\ncompared to the non-glucosamine supplemented group.  For cardiovascular\nmortality, respiratory mortality, and digestive mortality the hazard ratio is\neven stronger at 0.82, 0.73, and 0.74, respectively.\nThe authors conclude that</p>\n<blockquote>\n<p>\"regular glucosamine supplementation was associated with lower mortality due\nto all causes, cancer, CVD, respiratory and digestive diseases.\"</p>\n</blockquote>\n<p>Glucosamine supplementation is considered safe by the <a href=\"https://www.nccih.nih.gov/health/glucosamine-and-chondroitin-for-osteoarthritis\">US National Center for\nComplementary and Integrative\nHealth</a>\nand no side effects are known when used regularly for multiple years.</p>\n<h2>NAD+ boosters: NMN / NR</h2>\n<ul>\n<li>Supplement name: Nicotinamide riboside chloride (NR)</li>\n<li>Typical supplement dosage: 300-1000mg NR (sold as \"TRU NIAGEN\"), taken in the morning on an empty stomach</li>\n<li>Typical supplement price: 1.80 USD/day (300mg dose)</li>\n</ul>\n<p>and</p>\n<ul>\n<li>Supplement name: Nicotinamide mononucleotide (NMN)</li>\n<li>Typical supplement dosage: 500-2000mg MNM, taken in the morning on an empty stomach</li>\n<li>Typical supplement price: 0.34 USD/day (500mg dose)</li>\n</ul>\n<p>NAD+, <em>nicotinamide adenine dinucleotide</em>, is central to metabolism in many\norganisms, including humans.  NAD+ levels decrease strongly with age,\n<a href=\"https://doi.org/10.1371/journal.pone.0042357\">(Massudi et al., PLoS ONE,\n2012)</a>.\nThe reasons for this decline is not yet fully understood but is actively\nresearched, <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5088772/pdf/nihms824727.pdf\">(Schultz and Sinclair, Cell Metabolism,\n2017)</a>.</p>\n<p>While NAD+ decreases with age, does the low NAD+ level cause aspects of ageing?\nSchultz and Sinclair put this poetically,</p>\n<blockquote>\n<p>\"The discovery of nicotinamide adenine dinucleotide (NAD+) as a \"cozymase\"\nfactor in fermentation has its 110th anniversary this year [2016].\nOf the two billion people who were alive back in 1906, only 150 people\nremain.  Interestingly, NAD+ itself may be the reason for their longevity.\"</p>\n<p>--- Schultz and Sinclair, 2017</p>\n</blockquote>\n<p>A growing line of research in the last 15 years proposes to artificially\nelevate NAD+ levels to improve health in ageing individuals.  For a number of\nreasons NAD+ cannot be directly used as supplement.  Instead a\nnumber of precursors are used.  Two of these, NR and NMN, have been shown to\nlead to dose-dependent increase of bioavailable NAD+ in humans, <a href=\"https://pubmed.ncbi.nlm.nih.gov/27721479/\">(Trammell et al., Nature\nCommunications, 2016)</a>, and <a href=\"https://www.mdpi.com/2218-273X/9/1/34/pdf\">(Poddar\net al., 2019)</a>.\nNR is a <a href=\"https://en.wikipedia.org/wiki/Vitamer\">vitamer</a> of <a href=\"https://en.wikipedia.org/wiki/Vitamin_B3\">Vitamin\nB3</a> and present in normal human diet.\nLikewise NMN is found naturally in small amounts in some foods such as broccoli\nand avocado.</p>\n<p>In an important paper, <a href=\"https://pubmed.ncbi.nlm.nih.gov/27127236/\">(Zhang et al., Science, 2016)</a>,\nNR supplementation has extended lifespan in mice by 10 percent.\nIn particular, NR supplementation has direct observable effects on markers of\nageing such as muscle function.\nThe authors conclude that:</p>\n<blockquote>\n<p>\"Our findings suggest that NAD+ repletion may be revealed as an attractive\nstrategy for lengthening mammalian life span.\"</p>\n<p>--- Zhang et al., 2016</p>\n</blockquote>\n<p>There is now strong causal evidence that NAD+ supplementation in the\nform of NMN or NR has health and ageing benefits in mice through a broad set of\nmechanisms, <a href=\"https://www.cell.com/cell-metabolism/pdf/S1550-4131(17)30670-8.pdf\">(Yoshino et al., Cell Metabolism,\n2018)</a>,\n<a href=\"https://www.mdpi.com/2218-273X/9/1/34/pdf\">(Poddar et al., 2019)</a>.\nRecently NAD+ supplementation via NMN has even been shown to restore female\nfertility in ageing mice, <a href=\"https://www.sciencedirect.com/science/article/pii/S2211124720300838\">(Bertoldo et al., Cell Reports,\n2020)</a>.</p>\n<p>For both NR and NMN there are no large scale studies in humans.  A small scale\nstudy on NR in human adults, <a href=\"https://www.nature.com/articles/s41467-018-03421-7.pdf\">(Martens et al., Nature Communications,\n2018)</a> showed some\ncardiovascular benefits but the small scale of the study makes conclusions difficult.</p>\n<p>The safety of NMN and NR is only partially established.  Both occur naturally\nin a normal human diet but only in small amounts, much smaller than the amount\nused in supplements.\nNR is <a href=\"https://en.wikipedia.org/wiki/Generally_recognized_as_safe\">generally recognized as safe</a>\nand a randomized controlled human trial study, <a href=\"https://www.nature.com/articles/s41598-019-46120-z\">(Conze et al., Nature\nscientific reports, 2019)</a>,\nfinds no adverse effects over a duration of eight weeks.\nIn comparison NMN has limited safety studies, <a href=\"https://www.jstage.jst.go.jp/article/endocrj/advpub/0/advpub_EJ19-0313/_pdf/-char/en\">(Irie et al., 2019)</a>.\nHowever, for both NMN and NR there are is no long-term safety data available for humans.</p>\n<p>Overall NMN and NR supplementation are promising supplements to improve\nhealthspan in humans, but a definite conclusion is still open.\nDefinite results will likely be available within the next ten years.\nIn practical terms one big disadvantage at the moment is that NR is comparatively expensive.</p>\n<h2>Resveratrol</h2>\n<ul>\n<li>Supplement name: Resveratrol</li>\n<li>Typical supplement dosage: 500-1000 mg/day</li>\n<li>Typical supplement price: 0.15-0.30 USD/day</li>\n</ul>\n<p>Resveratrol is a substance naturally occuring in plants in low concentrations.\nIn food one of the highest concentrations of resveratrol is present in red\nwine, however, even the highest concentrations occuring naturally in food\n(up to 15mg per liter) are well below doses used when using resveratrol as\nsupplement.</p>\n<p>There is a wide body of evidence that supplementation with resveratrol has\nstrong beneficial health effects in a wide variety of animals.\nA comprehensive review article, <a href=\"https://www.researchgate.net/profile/Andrei_Gonzales_I/post/Is_there_any_mechanism_on_the_influence_of_resveratrol_on_growth_hormone/attachment/59d623bf6cda7b8083a1e8fc/AS:347637640384512@1459894680107/download/Therapeutic_potential_of_resveratrol.pdf\">(Baur and Sinclair, Nature Reviews, 2006)</a>,\nsummarizes the state of knowledge around 2006:</p>\n<blockquote>\n<p>\"Resveratrol, a constituent of red wine, has long been suspected to have\ncardioprotective effects. Interest in this compound has been renewed in\nrecent years, first from its identification as a chemopreventive agent for\nskin cancer, and subsequently from reports that it activates sirtuin\ndeacetylases and extends the lifespans of lower organisms. Despite scepticism\nconcerning its bioavailability, a growing body of in vivo evidence indicates\nthat resveratrol has protective effects in rodent models of stress and\ndisease.\"</p>\n<p>--- Baur and Sinclair, 2006</p>\n</blockquote>\n<p>Most importantly at that time there already was evidence of lifespan and\nhealthspan extension by resveratrol:</p>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Saccharomyces_cerevisiae\">Yeast</a>, 70 percent mean lifespan extension;</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Caenorhabditis_elegans\">Nematode Caenorhabditis elegans</a>, 18 percent mean lifespan extension;</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Drosophila_melanogaster\">Fly Drosophila melanogaster</a>, 29 percent mean lifespan extension;</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Nothobranchius_furzeri\">Turquoise killifish Nothobranchius furzeri</a>, 56 percent mean lifespan extension.</li>\n</ul>\n<p>While these are very different animals and the lifespan extension varies, the effect size is nevertheless remarkably strong.\nIn 2006, Baur and Sinclair state:</p>\n<blockquote>\n<p>\"The question of whether enhanced SIRT1 activity and/or resveratrol treatment\nwill increase mammalian lifespan looms large in the ageing-research\ncommunity. (...)\nIt is becoming clear that resveratrol and more potent mimetics show great\npromise in the treatment of the leading causes of morbidity and mortality in\nthe Western world. So far, little evidence suggests that these health\nbenefits are coupled with deleterious side effects. Even the trade off\nbetween individual health and reproductive potential that is characteristic\nof caloric restriction does not seem to occur in animals with lifespans that\nhave been extended by resveratrol. Could resveratrol and similar molecules\nform the next class of wonder-drugs?\"</p>\n<p>--- Baur and Sinclair, 2006</p>\n</blockquote>\n<p>A first study on mammals in the form of mice was also published by the same authors in 2006,\n<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4990206/pdf/nihms763280.pdf\">(Baur et al., Nature, 2006)</a>.\nIt demonstrated no lifespan extension by resveratrol supplementation but\nconvincingly demonstrated that mice that are fed on a high calorie diet\ntogether with resveratrol survive as well as normally fed mice and have similar\nhealth characteristics, whereas mice fed the same high calorie diet without\nresveratrol suffers adverse health and shortened lifespan.\nInterestingly the mice fed with the high calorie diet and resveratrol were\nhealthier but had the same body weight as the mice that only received the high\ncalorie diet.</p>\n<p>A result similar to the \"high calorie diet\" study on mice was repeated on humans:\n<a href=\"https://reader.elsevier.com/reader/sd/pii/S155041311100386X?token=95C0135D4F6407DA0AC00A235BCC833DCB1A7114862C8ECA2F918A0727248638BD6FF57A2580EAAC0E0105998477276B\">(Timmers at al., Cell Metabolism, 2011)</a>\nreport broad improvements of health markers on obese humans supplemented with resveratrol.\nThe authors conclude,</p>\n<blockquote>\n<p>\"In conclusion, we demonstrate beneficial effects of resveratrol\nsupplementation for 30 days on the metabolic profile in healthy obese males,\nwhich seems to reflect effects observed during calorie restriction. Although\nmost of the effects that we observed were modest, they were very consistently\npointing toward beneficial metabolic adaptations. Furthermore, therewere no\neffects on safety parameters, and no adverse events were reported.\"</p>\n<p>--- Timmers et al., 2011</p>\n</blockquote>\n<p>Given these promising findings on health benefits, what about lifespan\nextension in mammals and humans?\nA meta-analysis across studies with different species, <a href=\"https://royalsocietypublishing.org/doi/pdf/10.1098/rsbl.2012.0316\">(Hector et al., Biological Letters, 2012)</a> could\nconfirm the life extension effect of resveratrol but found a diminished effect for higher-order species.</p>\n<p><a href=\"https://reader.elsevier.com/reader/sd/pii/S1550413108001824?token=303818F867739DD5EED75F7C70661273DF92847F539E8A0E4600DCBE2F219FE337AECBEF6B4F16633D9E69E2ED5FC845\">(Pearson et al., Cell Metabolism,\n2008)</a>\nperform a study on mice that demonstrates no increase in lifespan for normally\nfed mice that received resveratrol supplements.  But again these mice showed a\nmarked improvement in health markers when compared to mice that did not receive\nresveratrol:</p>\n<ul>\n<li>Significantly improved bone density at age;</li>\n<li>Reduction in age-related cataracts at age;</li>\n<li>Improved balance and motor coordination at age; and</li>\n<li>Improved cardiovascular function at age.</li>\n</ul>\n<p>The observed health benefits are similar to those of a low calorie diet, which\nhas been shown to lead to both increased healthspan as well as lifespan\nextensions in mammals, <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0278584619302702?via%3Dihub\">(Pifferi and Aujard,\n2019)</a>.\nHowever, here only health is improved, not lifespan.</p>\n<p>The authors conclude:</p>\n<blockquote>\n<p>\"In conclusion, long-term resveratrol treatment of mice can mimic\ntranscriptional changes induced by dietary restriction and allow them to live\nhealthier, more vigorous lives.  In addition to improving insulin sensitivity\nand increasing survival in HC mice [high calorie diet mice], we show that resveratrol improves\ncardiovascular function, bone density, and motor coordination, and delays\ncataracts, even in nonobese rodents.  Together, these findings confirm the\nfeasibility of finding an orally available DR [dietary restriction] mimetic.\nSince cardiovascular disease is a major cause of age-related morbidity and mortality in humans but\nnot mice, it is possible that DR mimetics such as resveratrol could have a greater impact on humans.\nHowever, resveratrol does not seem to mimic all of the salutary effects of DR [dietary restriction]\nin that its introduction into the diet of normal 1-year-old mice did not\nincrease longevity.\"</p>\n<p>--- Pearson et al., 2008</p>\n</blockquote>\n<p>Overall, the available evidence makes it likely that humans will also enjoy\nsome health benefits at age when regularly using resveratrol supplementation.\nWhether resveratrol supplementation also has longevity benefits in humans is an\nopen question.</p>\n<p>Safety: a metastudy of clinical trials of resveratrol, <a href=\"https://nyaspubs.onlinelibrary.wiley.com/doi/epdf/10.1111/j.1749-6632.2010.05853.x\">(Patel et al., Annals\nof the New York Academy of Sciences,\n2011)</a>,\nanalyzed the data of 17 studies of resveratrol in humans and found no adverse\neffects for typical doses up to 1g per day in humans and minor dose-dependent side\neffects for doses up to 5g per day.</p>\n<h2>Multivitamin Supplementation</h2>\n<ul>\n<li>Supplement name: generic multivitamin supplement</li>\n<li>Typical supplement dosage: typically 1 pill/day with dosages matching <a href=\"https://www.fda.gov/media/99069/download\">US FDA recommendations</a></li>\n<li>Typical supplement price: 0.10 USD/day</li>\n</ul>\n<p>General multivitamin supplements are widely available and widely used.\nA recent study finds that users of multivitamins often self-report better\nhealth status than clinically present, see <a href=\"https://bmjopen.bmj.com/content/10/11/e039119.abstract\">(Paranjpe et al.,\n2020)</a>.\nIn addition the study finds that no clinical differences exist between people\nusing multivitamin supplements and people who do not.</p>\n<p>However, vitamin deficiency is a real thing and multivitamin supplements are\nsafe, cheap, and effectively guard against certain deficiencies.</p>\n<p>Take <em>vitamin D deficiency</em> for example:\n<a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0271531710002599\">(Forrest and Stuhldreher, Nutrition Research, 2011)</a>\nreport that 41.6 percent of US adults have a vitamin D deficiency (higher\ndepending on skin type, with a vitamin D deficiency present in 82.1 percent of\nblacks, and in 69.2 percent of Hispanics).  They conclude:</p>\n<blockquote>\n<p>\"Given that vitamin D deficiency is linked to some of the important risk\nfactors of leading causes of death in the United States, it is important that\nhealth professionals are aware of this connection and offer dietary and other\nintervention strategies to correct vitamin D deficiency, especially in\nminority groups.\"</p>\n<p>--- Forrest and Stuhldreher, 2011</p>\n</blockquote>\n<p>Take <em>vitamin B deficiency</em> for example:\n<a href=\"https://www.researchgate.net/profile/Gianpietro_Sechi/publication/299540197_Advances_in_clinical_determinants_and_neurological_manifestations_of_B_vitamin_deficiency_in_adults/links/5b0a90e6aca2725783e8e0a5/Advances-in-clinical-determinants-and-neurological-manifestations-of-B-vitamin-deficiency-in-adults.pdf\">(Sechi et al., Nutrition Reviews, 2016)</a>\nsummarize multiple studies of empirically observed vitamin B deficiencies in different populations.\nFor elderly persons (age 65 and up) vitamin B deficiency is observed at 22.9\npercent for vitamin B1, 11.7 percent for vitamin B2, and 30 percent for vitamin\nB9.  They also report on the potential neurological impairments that come with\nvitamin B deficiencies and while they do not advocate for broad supplementation\nthey conclude:</p>\n<blockquote>\n<p>\"Taken together, these findings indicate that subclinical or overt B vitamin\ndeficiency, with frequent involvement both of the central and peripheral\nnervous system at all stages of life, is a global health concern,\nespecially in selected populations at risk and in certain clinical settings.\"</p>\n<p>--- Sechi et al., 2016</p>\n</blockquote>\n<p>So overall, while you will likely not benefit from multivitamin supplementation\nif you have a varied diet and an active lifestyle, it is still cheap and safe\nand provides an additional guard against certain vitamin deficiencies which can\nhave real health consequences.</p>\n<h2>Summary</h2>\n<p>In the last 15 years scientists have identified a number of promising\nsupplements that yield health benefits and potentially increase lifespan.\nShould we all take these supplements then?  Given the partial evidence we\nalways have to make an uncertain risk/benefit tradeoff, the main risks being\nthe known side effects and the unknown potential long-term consequences.</p>\n<p>The potential benefits of healthspan and lifespan extension are large and we are\nobjectively at the dawn of a revolution in our understanding of ageing and in\ntreating ageing.  We should not be surprised if any of the above supplements\nprove their promise in human studies within the next decade.</p>\n<h3>Not included</h3>\n<p>I intentionally did not include medications and certain supplements:</p>\n<ul>\n<li><em>Creatine</em>: generally a beneficial supplement for muscular function. It has\n  been studied for possible beneficial effects on aging, but it is too early to\n  tell, see <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4304302/pdf/f1000research-3-5564.pdf\">(Smith et al., 2015)</a>.</li>\n<li><em>Metformin</em>: a prescription medicine used for treating diabetes.  There is\n  strong causal evidence of a link of Metformin to delaying ageing in mice,\n  <a href=\"https://www.nature.com/articles/ncomms3192.pdf?origin=ppub\">(Martin-Montalvo et al., Nature Comms,\n  2013)</a>, and\n  strong evidence of a potential Metformin-related reduction of overall mortality in\n  humans with effect size measured in years, <a href=\"https://www.sciencedirect.com/science/article/pii/S1568163717301472?via%3Dihub\">(Campbell et al., Ageing Research Reviews,\n  2017)</a>,\n  and potential link to reduction of dementia, <a href=\"https://content.iospress.com/articles/journal-of-alzheimers-disease/jad180263\">(Campbell et al., Journal of\n  Alzheimer's Disease,\n  2018)</a>.\n  A recent summary of what we know about Metformin in ageing is <a href=\"https://www.researchgate.net/profile/Oleh_Lushchak/publication/327879100_Metformin_as_geroprotector_experimental_and_clinical_evidence/links/5e07968ea6fdcc283745dbac/Metformin-as-geroprotector-experimental-and-clinical-evidence.pdf\">(Piskovatska et\n  al., Biogerontology, 2018)</a>.\n  There are three reasons why I do not include Metformin in the above list: 1.\n  Metform in a prescription medicine in most of the world, not a supplement; 2. while Metformin\n  overall is relatively safe and has been used for decades to treat diabetes,\n  there are <a href=\"https://bnf.nice.org.uk/drug/metformin-hydrochloride.html#sideEffects\">very common and unpleasant side effects</a>\n  including diarrhoea, nausea, and vomiting; and 3. two large randomized controlled human\n  trials evaluating Metformin specifically as a treatment for ageing are\n  currently underway.</li>\n<li><em>Rapamycin</em>: a prescription medicine that has an overwhelming evidence base of\n  increasing longevity in a wide variety of animals including mammals with\n  large effect sizes (e.g. 60 percent increase in life expectancy in mice).\n  For an opinionated but well-written overview of the primary literature, see\n  <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6814615/pdf/aging-11-102355.pdf\">(Blagosklonny, Aging, 2019)</a>.</li>\n</ul>\n<script type=\"text/javascript\">if (!document.getElementById('mathjaxscript_pelican_#%@#$@#')) {\n    var align = \"center\",\n        indent = \"0em\",\n        linebreak = \"false\";\n\n    if (false) {\n        align = (screen.width < 768) ? \"left\" : align;\n        indent = (screen.width < 768) ? \"0em\" : indent;\n        linebreak = (screen.width < 768) ? 'true' : linebreak;\n    }\n\n    var mathjaxscript = document.createElement('script');\n    mathjaxscript.id = 'mathjaxscript_pelican_#%@#$@#';\n    mathjaxscript.type = 'text/javascript';\n    mathjaxscript.src = 'https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.3/latest.js?config=TeX-AMS-MML_HTMLorMML';\n\n    var configscript = document.createElement('script');\n    configscript.type = 'text/x-mathjax-config';\n    configscript[(window.opera ? \"innerHTML\" : \"text\")] =\n        \"MathJax.Hub.Config({\" +\n        \"    config: ['MMLorHTML.js'],\" +\n        \"    TeX: { extensions: ['AMSmath.js','AMSsymbols.js','noErrors.js','noUndefined.js'], equationNumbers: { autoNumber: 'none' } },\" +\n        \"    jax: ['input/TeX','input/MathML','output/HTML-CSS'],\" +\n        \"    extensions: ['tex2jax.js','mml2jax.js','MathMenu.js','MathZoom.js'],\" +\n        \"    displayAlign: '\"+ align +\"',\" +\n        \"    displayIndent: '\"+ indent +\"',\" +\n        \"    showMathMenu: true,\" +\n        \"    messageStyle: 'normal',\" +\n        \"    tex2jax: { \" +\n        \"        inlineMath: [ ['\\\\\\\\(','\\\\\\\\)'] ], \" +\n        \"        displayMath: [ ['$$','$$'] ],\" +\n        \"        processEscapes: true,\" +\n        \"        preview: 'TeX',\" +\n        \"    }, \" +\n        \"    'HTML-CSS': { \" +\n        \"        availableFonts: ['STIX', 'TeX'],\" +\n        \"        preferredFont: 'STIX',\" +\n        \"        styles: { '.MathJax_Display, .MathJax .mo, .MathJax .mi, .MathJax .mn': {color: 'inherit ! important'} },\" +\n        \"        linebreaks: { automatic: \"+ linebreak +\", width: '90% container' },\" +\n        \"    }, \" +\n        \"}); \" +\n        \"if ('default' !== 'default') {\" +\n            \"MathJax.Hub.Register.StartupHook('HTML-CSS Jax Ready',function () {\" +\n                \"var VARIANT = MathJax.OutputJax['HTML-CSS'].FONTDATA.VARIANT;\" +\n                \"VARIANT['normal'].fonts.unshift('MathJax_default');\" +\n                \"VARIANT['bold'].fonts.unshift('MathJax_default-bold');\" +\n                \"VARIANT['italic'].fonts.unshift('MathJax_default-italic');\" +\n                \"VARIANT['-tex-mathit'].fonts.unshift('MathJax_default-italic');\" +\n            \"});\" +\n            \"MathJax.Hub.Register.StartupHook('SVG Jax Ready',function () {\" +\n                \"var VARIANT = MathJax.OutputJax.SVG.FONTDATA.VARIANT;\" +\n                \"VARIANT['normal'].fonts.unshift('MathJax_default');\" +\n                \"VARIANT['bold'].fonts.unshift('MathJax_default-bold');\" +\n                \"VARIANT['italic'].fonts.unshift('MathJax_default-italic');\" +\n                \"VARIANT['-tex-mathit'].fonts.unshift('MathJax_default-italic');\" +\n            \"});\" +\n        \"}\";\n\n    (document.body || document.getElementsByTagName('head')[0]).appendChild(configscript);\n    (document.body || document.getElementsByTagName('head')[0]).appendChild(mathjaxscript);\n}\n</script>",
  "category": ""
}