{
  "title": "Radical right-wing upsurge in the US",
  "link": "https://newsin.asia/radical-right-wing-upsurge-in-the-us/",
  "comments": "https://newsin.asia/radical-right-wing-upsurge-in-the-us/#respond",
  "dc:creator": "Editor",
  "pubDate": "Fri, 04 Nov 2022 02:48:20 +0000",
  "category": [
    "Politics",
    "Rioting and disorder",
    "Terrorism",
    "Uncategorized",
    "United States"
  ],
  "guid": "https://newsin.asia/?p=78923",
  "description": "<p>The US still has no system to list domestic racist and anti-liberal extremists of the kind it has for international terror organizations. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://newsin.asia/radical-right-wing-upsurge-in-the-us/\">Radical right-wing upsurge in the US</a> appeared first on <a rel=\"nofollow\" href=\"https://newsin.asia\">NewsIn.Asia</a>.</p>\n",
  "content:encoded": "\n<p>By P.K.Balachandran</p>\n\n\n\n<p>Colombo, November 3: Historically a right-wing and White supremacist country, the United States made significant advances towards liberalism and accommodation in recent years, even electing Afro-American Barak Obama as President twice. But the emergence of Donald Trump as a political type, the unconventional ways in which he has been challenging his election defeat, and the popular support he is getting, show that America is retrogressing. The right-wing era appears to be coming back to threaten American democracy as it has developed over the years to become a beacon of hope to those across the world aspiring for democratic rights.&nbsp;&nbsp;&nbsp; &nbsp;</p>\n\n\n\n<p>The October 28 attack on Paul Pelosi, husband of House Speaker Nancy Pelosi, was clearly the work of an extreme right-wing radical. The assailant, David DePape, told Paul before grievously wounding him with a hammer, that he intended to “get” Nancy and other top politicians for the “lies that were being uttered in Washington.” Alarmed, the federal authorities reportedly issued a joint assessment saying that domestic violent extremists posed a heightened threat to the 2022 midterm elections.</p>\n\n\n\n<p>Political violence started gaining currency and legitimacy in the US with the mob attack on Capitol on January 6, 2021 by defeated President Donald Trump’s supporters. Disturbingly, right-wing extremism, generally associated with Whites, now has non-Whites too. <em>Washington Post</em> noted in a detailed piece in 2021 that some from racial minorities had jumped on the right-wing bandwagon either to make themselves acceptable to the increasingly assertive White majority or to oppose further immigration so as to protect their jobs. &nbsp;</p>\n\n\n\n<p>There is even talk of civil war among a significant number of Whites associated with the Republican party, says Clara Hernanz Lizarraga in her report in <em>Bloomberg</em> on August 30, 2022. “More than two in five Americans say a US civil war is at least somewhat likely in the next decade.” She quotes a recent poll by <em>YouGov</em> and <em>The Economist</em> that found that 43% believed a civil war was either “very” or “somewhat likely.”</p>\n\n\n\n<p>People who identified themselves as “strong Republicans” were the most likely to anticipate a conflict. Lizarraga quoted Thomas Gift, Director of the University College London’s Center on US Politics, as saying: “Polarization right now is at the highest level in decades, if not going all the way back to the civil war.”</p>\n\n\n\n<p>According to a survey conducted among 1,500 US adults, 66% believed that political divisions had gotten worse since the beginning of 2021. More Republicans than Democrats felt that violence would ensue if Trump was arrested for possessing classified documents.</p>\n\n\n\n<p>In her testimony to the Select Committee to Investigate the January 6th attack on the US Capitol, Rachel Kleinfeld of Carnegie said that acceptance of political violence had been rising sharply. She quoted a survey done by Lilliana Mason and Nathan Kalmoe to say that by February 2021, 25% of Republicans and 17% of Democrats felt threats against the other party’s leaders were justifiable, and 19% of Republicans and 10% of Democrats believed it was justified to harass ordinary members of the other party.</p>\n\n\n\n<p>One in five Republicans (20%) and 13% of Democrats said that political violence was justified “these days”. And in each case, support for political violence had doubled for Republicans since 2017 and had grown for Democrats, she noted.</p>\n\n\n\n<p>“To put this level of support into context: In 1973 during the most violent period of Northern Ireland’s troubles, 25% of Catholics and 16% of Protestants agreed that “violence is a legitimate way to achieve one’s goals.” The US is fast approaching these numbers,” Kleinfeld warned.</p>\n\n\n\n<p>A survey done by Larry Bartels and the AEI Survey Center on American Life in January 2020, found that half of Republicans and Republican-leaning independents agreed that “The traditional American way of life is disappearing so fast that we may have to use force to save it.” By January 2021, this number had risen to 56%, and by June 2021 another poll found 68% support across both parties.</p>\n\n\n\n<p>Threats against members of Congress were more than ten times as high as just five years earlier. From 902 threats investigated by the Capitol Police in 2016, they leaped to 3,939 in the first year of the Trump presidency, 5,206 by 2018, 6,955 in 2019, 8,613 in 2020, and hit 9,600 in 2021.9.</p>\n\n\n\n<p>Political violence is still only 1% of all violence in the US but the right-wing surge has tremendous potential because it feeds on the grievances of the vast White working class and petit bourgeoisie. These feel threatened by leftists, big corporates, liberals, and pro-immigration forces. According to Bruce Hoffman of Georgetown University, right-wing terrorists generally criticize the democratic state for “its liberal social welfare policies and tolerance of diverse opinion—alongside its permitting of dark-skinned immigrants in the national labor force and of Jews and other minorities in positions of power or influence.”</p>\n\n\n\n<p>Therefore, there are calls for all parties to oppose “wokeness” (a woke is one wanting to be considered correct). There are calls against “defunding the police” because defunding the police is an “affront to working-class Americans.” &nbsp;Attempts to redefine sexuality are also condemned. The right-wing stands for traditional/conservative White Christian American values. That being so, &nbsp;William A. Galston, an expert on American politics with the Brookings Institution, warns that if Democrats do not compromise on issues like immigration and cultural values, they’ll lose working-class voters “for good.”</p>\n\n\n\n<p>Right-wing extremism marked by violence or threats of violence is growing, says a November 2018 Center for Strategic and International Studies (CSIS) Brief. “The number of terrorist attacks by far-right perpetrators rose over the past decade, more than quadrupling between 2016 and 2017. The recent pipe bombs and the October 27, 2018, synagogue attack in Pittsburgh are symptomatic of this trend,” it says. Disturbingly, the number of attacks from home-grown right-wing extremists since 2014 had been greater than attacks from Islamic extremists.</p>\n\n\n\n<p>Most of the far-right attacks involved firearms or incendiary devices. Right-wing extremists have also been openly parading with deadly arms, though many hide their identity to dodge the police. It has been revealed that in the 11 weeks between the election and Biden’s Inauguration Day, armed actors at protests grew by 47% compared to the 11 weeks prior to the elections, and organized paramilitary groups grew by 96%. Plowing cars into civilians used to be a tactic favored by overseas terrorists, but this is now being used in the US. Reports have pointed out that the increase in political violence has made protests increasingly dangerous, damaging Americans’ rights to free speech and assembly.</p>\n\n\n\n<p>Right-wingers use the social media extensively for spreading hateful ideas. They have also developed contacts with fellow travelers in Europe which is also seeing a surge in right-wing extremism.</p>\n\n\n\n<p>Even the Trump Administration was alarmed by the growth of right-wing extremism. But still, there is no domestic terrorist organization designation like there is for international terrorists, points out Seth G. Jones of the CSIS.</p>\n\n\n\n<p>END</p>\n<p>The post <a rel=\"nofollow\" href=\"https://newsin.asia/radical-right-wing-upsurge-in-the-us/\">Radical right-wing upsurge in the US</a> appeared first on <a rel=\"nofollow\" href=\"https://newsin.asia\">NewsIn.Asia</a>.</p>\n",
  "wfw:commentRss": "https://newsin.asia/radical-right-wing-upsurge-in-the-us/feed/",
  "slash:comments": 0
}