{
  "title": "E Paper License Plates Now Street-Legal in California",
  "link": "https://spectrum.ieee.org/california-tests-kindleized-license-plates",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/photographer-of-reviver-auto-s-customizable-license-plate.jpg?id=25585942&width=1200&height=800&coordinates=60%2C0%2C61%2C0\"/><br/><br/><p><em><strong>Update 14 Oct. 2022</strong></em><em>: The “Kindle” of license plates—</em><a href=\"https://reviver.com/about/\" rel=\"noopener noreferrer\" target=\"_blank\">Reviver</a><em>’s connected, digital </em><a href=\"https://reviver.com/rplate/\" rel=\"noopener noreferrer\" target=\"_blank\">RPlate</a><em>—is now legal for use by any California car-owner, following a 10,000-car pilot that started in 2018. The California </em><a href=\"https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=202120220AB984\" rel=\"noopener noreferrer\" target=\"_blank\">Motor Vehicle Digital Number Plates bill</a><em> that California Governor Gavin Newsom signed this month authorizes digital replacements for conventional license plates, stickers, tabs, and registration cards, including the first-to-market Reviver product.</em></p><p><em>Outside of California, the device has been approved for use by commercial fleet vehicles in Michigan, Arizona, and Texas, and 10 additional U.S. states are considering authorization.</em></p><p><em>The battery-operated RPlate for consumers currently sells as a subscription service for $19.95 per month for 48 months; a hard-wired version for commercial vehicles sells for $24.95 per month.</em></p><p><em>In the story below (originally published 18 June 2018), we describe the RPlate and its potential uses; most of these details—other than the pricing structure—haven’t changed.</em></p><p>That license plate frame sporting a dealership name, sports team logo, or your favorite superhero? That’s so last year.</p> <p>This year, auto dealers in California will be able to go beyond personalized license plate frames to sell “Kindle-ized” license plates, in which the entire plate can display custom text and graphics using <a href=\"/computing/hardware/the-electronic-display-of-the-future\">e-paper technology</a>. These displays can be updated remotely, with such updates replacing the little date stickers that must be reapplied each year when registration is renewed.</p> <p>And, when the car is stopped, drivers will also be able to reduce the license number to a small window and use the rest of the screen for a different graphic. (Though I’m not sure the people stopped behind a custom-plate-bearing car will notice; so many people take that opportunity to surreptitiously check their mobile phones.)</p> <p><a href=\"https://www.reviverauto.com/\">Reviver Auto</a> is making the so-called Rplates, and they aren’t cheap—the plates are listed at US $700, plus an $8 a month subscription fee. [<em>See updated pricing above. –Ed.</em>] The company is initially focused on marketing them to fleet managers, who are expected to use the displays for advertising messages, but expects early adopters to quickly jump on the technology, and other consumers to come on board as the company proves out the plates’ usefulness.</p> <p>The project started in 2008, Reviver founder and CEO <a href=\"https://www.linkedin.com/in/neville-boston-6a308861/\">Neville Boston</a> says, with a plan to eliminate those date stickers—it was time, he thought, to get registration renewals out of snail mail and into the wireless world. In the midst of an economic downturn, he says, he was also looking to get involved with something that exists in good times and bad—and the DMV is certainly that.</p> <p>Then, he says, he started thinking about what else e-paper plates could do. His list of possibilities includes:</p> <ul>\n<li> Paying for tolls and parking </li>\n<li> Identifying cars as legal for travel in high-occupancy vehicle lanes </li>\n<li> Replacing special hangtags and license plates for people with disabilities </li>\n<li> Helping an Uber driver find a passenger by displaying the passenger’s name </li>\n<li> Indicating that a car is in autonomous mode </li>\n<li> Displaying a QR code that could work with an app for keyless entry </li>\n<li> Celebrating holidays with greetings, like “Happy Father’s Day” </li>\n<li> Switching between multiple <a href=\"https://www.dmv.ca.gov/portal/dmv/detail/online/elp/elp\">special interest plates</a>; drivers won’t have to commit to supporting, say, Lake Tahoe, at the expense of Yosemite or the California coast </li>\n</ul> <p>Not a bad list. But once these changeable plates are out in the wild, it seems like it’ll be just moments before someone builds an app to shoot them messages like “Back off, tailgater!”—or maybe display the driver’s Twitter feed.</p> <p>Boston says he’s thought of that—any message will have to be approved by the DMV before it is added to the library, and only messages from that library may go to the plate.</p> <p>One of the earliest adopters will be the <a href=\"http://fox40.com/2018/06/04/digital-license-plates-debut-in-sacramento/\">city of Sacramento</a>; city managers are ordering the plates for new city-owned vehicles and expect to use the plates to display public service announcements and Amber Alerts.</p> <p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"License plate identifying the car as stolen.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"632c802401ca9e3140230c09863693be\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"7c9ab\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/license-plate-identifying-the-car-as-stolen.jpg?id=25585943&width=980\"/>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Photo: Reviver Auto</small>\n</p> <p>These plates are also trackable—another boon to fleet owners, and maybe to parents of teenagers—but that feature raises obvious privacy concerns, though Reviver offers a host of assurances about its cybersecurity practices. If those concerns are resolved, trackability could be a handy way to thwart thieves: A stolen car could display its own SOS message.</p> <p>California was the first state to officially approve the digital plates; Arizona could be next, as it’s conducting a pilot test of the technology. Boston said three more U.S. states will introduce the gadgets this year, and his company is “in conversation” with 10 more.</p> <p>Reviver has also signed a proof-of-concept agreement with the government of Dubai, who, Boston says, is thinking about the plates a little differently than DMV officials in the United States. “They want to know who is driving around in their country,” he says.</p>",
  "pubDate": "Fri, 14 Oct 2022 13:36:35 +0000",
  "guid": "https://spectrum.ieee.org/california-tests-kindleized-license-plates",
  "category": [
    "Infrastructure",
    "Gadgets",
    "E-paper",
    "Epaper",
    "California",
    "Kindle",
    "E-ink",
    "Dmv",
    "Displays",
    "License plate",
    "Transportation"
  ],
  "dc:creator": "Tekla S. Perry",
  "media:content": ""
}