{
  "id": "yt:video:XOfeqRgaF1A",
  "yt:videoId": "XOfeqRgaF1A",
  "yt:channelId": "UCW39zufHfsuGgpLviKh297Q",
  "title": "How our brain judges people in a split second | DW Documentary",
  "link": "",
  "author": {
    "name": "DW Documentary",
    "uri": "https://www.youtube.com/channel/UCW39zufHfsuGgpLviKh297Q"
  },
  "published": "2022-10-26T15:00:32+00:00",
  "updated": "2022-10-27T16:18:19+00:00",
  "media:group": {
    "media:title": "How our brain judges people in a split second | DW Documentary",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Friend or foe? In a fraction of a second, our brain forms an impression of a person based on their facial expressions and voice. And artificial intelligence is getting better and better at interpreting human emotions.\n\nFaces and voices are the first impressions we get of people we don’t know. In less than half a second, we decide whether we like or trust a person, and how intelligent we think they are. That’s thanks to the astonishing processing power of our brains. We learn to read facial expressions as babies, and as we grow older we continue to interpret emotions according to facial expressions. The voice also plays a crucial role: speed, syntax, tone, and phonetics all provide information about what a person is feeling. \n\nBut we are not the only ones who can decipher human emotions. Artificial intelligence technology is also learning to read faces and voices. A photo or a spoken sentence is usually enough to get information about identity, health, emotions and even personality. And the internet has become a vast and ever-growing database of faces and voices. Based on the sound of a voice, artificial intelligence can now detect whether a person suffers from Parkinson's, depression or even Covid-19. In this documentary, international experts offer insight into the latest science, illuminating how our brains work -- and the potential of artificial intelligence. \n\n#documentary #dwdocumentary #impression \n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: \n⮞ DW Documentary (English): https://www.youtube.com/dwdocumentary\n⮞ DW Documental (Spanish): https://www.youtube.com/dwdocumental\n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/dwdocarabia\n⮞ DW Doku (German): https://www.youtube.com/dwdoku\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/dwdochindi\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}