{
  "title": "S1E3 - Learning to Perform Instead of Compete with Legend, Greg Louganis",
  "guid": "https://pinecast.com/guid/aded37b7-c699-405b-84ba-8670dc2254f3",
  "pubDate": "Tue, 23 Jun 2020 07:40:00 -0000",
  "itunes:duration": "00:46:43",
  "description": "<p>Joining Laura today on a very special episode is the man, the myth, the legend, Greg Louganis, currently the Sports Director for the Red Bull Cliff Diving World Series. As you probably already know, Greg is a 4 time Olympian, and the only man to ever win consecutive double gold medals in diving at the Olympics. He is also, of course, the man who came back to win Olympic gold in dramatic fashion after hitting his head during a dive, and we do discuss that as well as many other topics during the show.</p>\n<p>In our discussion, Greg shares how elite athletes, including himself, handle cancelled or boycotted competitions, deal with distractions, and maintain motivation while processing criticism. We also explore the importance of the trust between a coach and athlete, dealing with feelings of failure, and the incredible story of Greg’s 1988 Olympics experience. We finish up by looking at his perception of challenges actually being opportunities, and I ask him how he would like to be remembered. Throughout this fascinating conversation we discover Greg’s lifelong focus upon learning to perform to the best of his ability rather than competing for awards – a valuable attitude for us all to emulate in both sports and life in general.</p>\n<p>Episode Highlights:</p>\n<p>How athletes are handling the cancellation of the Red Bull Cliff Diving Season\nHow Greg dealt with the boycott of the 1980 Olympic Games\nManaging distractions while competing, maintaining motivation and processing criticism\nBuilding coach-athlete trust\nDealing with feelings of failure\nThe story of the 1988 Olympics\nSeeing challenges as opportunities\nPerforming instead of competing\nHow Greg would like to be remembered</p>\n<p>Quotes:</p>\n<p>“If you think of an elite athlete in many sports, it’s like a carton of milk…it has an expiration date.”</p>\n<p>“I always wanted my performance to speak for itself…I was out there to prove something.”</p>\n<p>“It’s human nature to root for the underdog, and for many, many years, I was not the underdog.”</p>\n<p>“I think the most important thing is to observe and listen.”</p>\n<p>“It was never my goal to win gold…my goal was to have the best performance that I could on that given time, and just be the absolute best that I could be…the results will take care of themselves.”</p>\n<p>“This pandemic is proof – we have such little control, ultimately.”</p>\n<p>“As long as I was in the pool in training, HIV didn’t exist, nor did my relationship…that was my safe space, my sanctuary.”</p>\n<p>“I always thought…a bad takeoff was a great opportunity.”</p>\n<p>“Emulate what you admire, but be your own person.”\nLinks:\nThe Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a></p>\n<p>Greg’s homepage: <a href=\"https://greglouganis.com/\" rel=\"nofollow\">https://greglouganis.com/</a></p>\n<p>Greg’s Instagram: <a href=\"https://www.instagram.com/greglouganis/\" rel=\"nofollow\">https://www.instagram.com/greglouganis/</a></p>",
  "itunes:title": "Learning to Perform Instead of Compete with Legend, Greg Louganis",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 3
}