{
  "title": "Kiev slated to receive drone-killing VAMPIREs",
  "link": "https://www.rt.com/news/565828-ukraine-pentagon-vampire-system/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565828-ukraine-pentagon-vampire-system/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63629a5b85f540791e7d4ed8.jpg\" /> US intends to arm Ukraine with VAMPIRE counter-drone systems by mid-2023, according to the Pentagon spokesperson <br/><a href=\"https://www.rt.com/news/565828-ukraine-pentagon-vampire-system/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The Pentagon “anticipates” delivering the weapons systems by mid-2023</strong></p>\n            \n                        \n            <p>Ukraine is expected to soon receive a number of so-called VAMPIRE counter-drone systems, according to Pentagon press secretary Pat Ryder, who confirmed Washington&rsquo;s commitment to supply Kiev with air defense capabilities. The statement came amid Russia&rsquo;s continued strikes targeting Ukraine&rsquo;s energy infrastructure.&nbsp;</p>\n<p>Speaking to reporters on Tuesday, Ryder said the US government has yet to secure a contract for the laser-guided missile launchers but expects one to be reached within the next few months. <em>&ldquo;Right now we&rsquo;re anticipating delivery to be mid-2023,&rdquo;</em> he explained, noting that <em>&ldquo;air defense continues to be a priority.&rdquo;</em> &nbsp;</p>\n<p>The VAMPIRE, or Vehicle-Agnostic Modular Palletized ISR Rocket Equipment, can be installed on the cargo bed of almost any civilian truck and uses laser-guided munitions capable of hitting both ground and airborne targets, including unmanned aerial vehicles. Although it is not explicitly advertised as an anti-drone weapon, systems similar to the VAMPIRE have been used extensively in Ukraine for that purpose. &nbsp;&nbsp;</p>\n<p>These systems are part of a $3 billion arms package for Ukraine announced by the Pentagon back in August. This also includes the National Advanced Surface-to-Air Missile Systems, or NASAMS, which Washington also says will be arriving in Ukraine <em>&ldquo;in the very near future.&rdquo;&nbsp;</em></p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6361421e2030270a7a702679.jpg\" alt=\"A NASAMS battery, seen in Norway, April 22, 2010\" />\n            <figcaption><a href=\"https://www.rt.com/russia/565750-nasams-missiles-arrive-ukraine/\">US air defense systems to arrive in Ukraine soon – Pentagon</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>On Tuesday, a Pentagon official stated that the US had committed a total of eight NASAMS and the corresponding munitions, and that two of them would be in Ukraine soon.&nbsp;</p>\n<p>Kiev has been demanding more advanced air defense systems ever since Russia shifted its military tactics in Ukraine to use inexpensive kamikaze drones to cripple Ukraine&rsquo;s energy infrastructure. Kiev&rsquo;s Soviet-era and NATO-supplied air defense systems have so far been unable to effectively stop the Russian UAVs.&nbsp;</p>\n<p>A number of regions in Ukraine, including Kiev, Zaporozhye, Dnepropetrovsk, and Kharkov have been experiencing regular blackouts since the massive strikes on Ukrainian energy facilities began. The change in the Russian approach came after Moscow accused Kiev of terrorist attacks on its infrastructure, including the strategic Crimean Bridge.</p>",
  "enclosure": "",
  "pubDate": "Wed, 02 Nov 2022 18:15:03 +0000",
  "dc:creator": "RT"
}