{
  "id": "yt:video:A_79m5x0ucY",
  "yt:videoId": "A_79m5x0ucY",
  "yt:channelId": "UCP3alkHEJhoxTpy3iVON-lg",
  "title": "Why Newton's 3rd Law is Conservation of Momentum in Disguise",
  "link": "",
  "author": {
    "name": "Physics with Elliot",
    "uri": "https://www.youtube.com/channel/UCP3alkHEJhoxTpy3iVON-lg"
  },
  "published": "2021-12-09T19:04:14+00:00",
  "updated": "2022-09-27T16:02:10+00:00",
  "media:group": {
    "media:title": "Why Newton's 3rd Law is Conservation of Momentum in Disguise",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Newton's third law says that for every action there's an equal-but-opposite reaction. Hidden inside it is a deep principle of physics: conservation of momentum! Get the notes for free here: https://courses.physicswithelliot.com/notes-sign-up\n\nNewton's third law looks a little strange the first time you see it: all forces between particles come in equal-but-opposite pairs. But it's really all about a more intuitive physical principle: the conservation of momentum. It implies that in an isolated system---meaning one where there are no outside forces acting on it---the total momentum will be conserved. I'll explain why in this video. But there's a catch: Newton's third law isn't always true!\n\nGet the links here: https://www.physicswithelliot.com/third-law-help-room\n\nA more advanced video about Noether's theorem: https://youtu.be/O0NYaO_OnH4\n\nTutoring inquiries: https://www.physicswithelliot.com/tutoring\n\nIf you find the content I’m creating valuable and would like to help make it possible for me to continue sharing more, please consider supporting me! You can make a recurring contribution at https://www.Patreon.com/PhysicsWithElliot, or make a one time contribution at https://www.physicswithelliot.com/support-me. Thank you so much!\n\nAbout physics help room videos:\nThese are intro-level physics videos aimed at students taking their first physics classes. In each video, I'll teach you the fundamentals of a particular physics topic you're likely to meet in your first classes on mechanics and electromagnetism.\n\nAbout me:\nI’m Dr. Elliot Schneider. I love physics, and I want to help others learn (and learn to love) physics, too. Whether you’re a beginner just starting out with your physics studies, a more advanced student, or a lifelong learner, I hope you’ll find resources here that enable you to deepen your understanding of the laws of nature. For more cool physics stuff, visit me at https://www.physicswithelliot.com.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}