{
  "id": "yt:video:FWTNMzK9vG4",
  "yt:videoId": "FWTNMzK9vG4",
  "yt:channelId": "UCsooa4yRKGN_zEE8iknghZA",
  "title": "Why you procrastinate even when it feels bad",
  "link": "",
  "author": {
    "name": "TED-Ed",
    "uri": "https://www.youtube.com/channel/UCsooa4yRKGN_zEE8iknghZA"
  },
  "published": "2022-10-27T15:01:06+00:00",
  "updated": "2022-10-30T06:49:36+00:00",
  "media:group": {
    "media:title": "Why you procrastinate even when it feels bad",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Explore what happens in the brain to trigger procrastination, and what strategies you can use to break the cycle of this harmful practice.\n\n--\n\nThe report you’ve been putting off is due tomorrow. It’s time to buckle down, open your computer ... and check your phone. Maybe watch your favorite YouTube channel? Or maybe you should just start in the morning? This is the cycle of procrastination. So, why do we procrastinate when we know it’s bad for us? Explore how your body triggers a procrastination response, and how you can break the cycle.\n\nDirected by Vitalii Nebelskyi, and action agency.\n\nThis video made possible in collaboration with Character Lab\nLearn more about how TED-Ed partnerships work: https://bit.ly/TEDEdPartners\n\nA special thanks to Fuschia Sirois who provided information and insights for the development of this video.\n\nSupport Our Non-Profit Mission\n----------------------------------------------\nSupport us on Patreon: http://bit.ly/TEDEdPatreon\nCheck out our merch: http://bit.ly/TEDEDShop\n----------------------------------------------\n\nConnect With Us\n----------------------------------------------\nSign up for our newsletter: http://bit.ly/TEDEdNewsletter\nFollow us on Facebook: http://bit.ly/TEDEdFacebook\nFind us on Twitter: http://bit.ly/TEDEdTwitter\nPeep us on Instagram: http://bit.ly/TEDEdInstagram\n----------------------------------------------\n\nKeep Learning\n----------------------------------------------\nView full lesson: https://ed.ted.com/lessons/why-you-procrastinate-even-when-it-feels-bad\nDig deeper with additional resources: https://ed.ted.com/lessons/why-you-procrastinate-even-when-it-feels-bad#digdeeper\n\nAnimator's website: https://and-action.net\n----------------------------------------------\n\nThank you so much to our patrons for your support! Without you this video would not be possible! Sandra Tersluisen, Zhexi Shan, Bárbara Nazaré, Andrea Feliz, Victor E Karhel, Sydney Evans, Latora, Noel Situ, emily lam, Sid, Niccolò Frassetto, Mana, I'm here because of Knowledge Fight Facebook group., Linda Freedman, Edgardo Cuellar, Jaspar Carmichael-Jack, Michael Burton, VIVIANA A GARCIA BESNE, The Vernon's, Olha Bahatiuk, Jesús Bíquez Talayero, Chels Raknrl, Sai Pranavi Jonnalagadda, Stuart Rice, Jing Chen, Vector-Dopamine math, Jasper Song, Giorgio Bugnatelli, Chardon, Eddy Trochez, OnlineBookClub.org, Eric Shear, Leith Salem, Omar Hicham, Adrian Rotaru, Brad Sullivan, Karen Ho, Niklas Frimberger, Hunter Manhart, Nathan Nguyen, Igor Stavchanskiy, James R DeVries, Grace Huo, Diana Huang, Chau Hong Diem, Orlellys Torre, Corheu, Thomas Mee, Maryann H McCrory and Blas Borde.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}