{
  "id": "https://bibleinoneyear.org/en/youth/218",
  "title": "Day 218: God Is With You",
  "description": "Psalm 91:9-11,14–15, 1 Chronicles 22:7–11,13b, 1 Corinthians 2:9–16.  It is an extraordinary and wonderful promise  To experience God with you by his Spirit is life changing",
  "pubDate": "Fri, 06 Aug 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/218/?ignore",
  "itunes:duration": "14:11",
  "guid": "enyouth06082021-218",
  "length": 851.51,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 218: God Is With You",
  "itunes:subtitle": "Psalm 91:9-11,14–15, 1 Chronicles 22:7–11,13b, 1 Corinthians 2:9–16.  It is an extraordinary and wonderful promise  To experience God with you by his Spirit is life changing",
  "itunes:summary": "I wonder whether you have ever had this experience: you are talking to a friend about your faith and they are looking back at you with a blank stare. They have no idea what you are talking about. When you talk about a relationship with Jesus, to them it is like you are speaking about an ‘imaginary friend’. It makes no sense to them at all.\nThe apostle Paul makes the point that you can only understand spiritual truths with the help of the Holy Spirit. The person ‘without the Spirit does not accept the things that come from the Spirit of God but considers them foolishness, and cannot understand them because they are spiritually discerned’ (1 Corinthians 2:14). When God is with us by his Holy Spirit he gives us understanding, ‘that we may understand what God has freely given us’ (v.12).\n‘God with us’ (Immanuel) is one of the titles the New Testament uses for Jesus (Matthew 1:23). He is always with you. That the God who created the universe should be with you is not something to be taken lightly. It is an extraordinary and wonderful promise. To experience God with you by his Spirit is life changing.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 218
}