{
  "id": "https://bibleinoneyear.org/en/youth/260",
  "title": "Day 260: The Best Way to Lead",
  "description": "Proverbs 22:29, Isaiah 42:1–8, Galatians 3:10–25.  Furthermore, it is God’s plan that the church, through the victory of Christ and the power of the Holy Spirit, can and will succeed  So, the St Andrew’s cross broadens out again as the members of the church of Jesus Christ become the servants of God with a mission to call all humanity back to their original creation purpose",
  "pubDate": "Fri, 17 Sep 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/260/?ignore",
  "itunes:duration": "15:07",
  "guid": "enyouth17092021-260",
  "length": 907.57,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 260: The Best Way to Lead",
  "itunes:subtitle": "Proverbs 22:29, Isaiah 42:1–8, Galatians 3:10–25.  Furthermore, it is God’s plan that the church, through the victory of Christ and the power of the Holy Spirit, can and will succeed  So, the St Andrew’s cross broadens out again as the members of the church of Jesus Christ become the servants of God with a mission to call all humanity back to their original creation purpose",
  "itunes:summary": "‘Who is the servant of the Lord?’ This was the question that the Chief Financial Officer of Ethiopia asked the evangelist Philip: ‘Tell me, please, who is the prophet talking about, himself or someone else?’ (Acts 8:34).\nThe title ‘servant of the Lord’ is one of great dignity, reserved for leaders such as Abraham, Moses and David. But in the four ‘servant songs’ (Isaiah 42:1–4; 49:1–7; 50:4–9; 52:13 – 53:12) a distinct concept of ‘servanthood’ comes into sharper focus.\nThe role of this ‘servant’ can be illustrated with the St Andrew’s cross. (St Andrew, brother of Peter, is believed to have died on a diagonally traversed cross, which the Romans sometimes used for execution. It therefore came to be called the St Andrew’s cross, and is the flag of Scotland.)\nOriginally, God intended that all humankind should be his servant. Then, after the fall, God chose the whole nation of Israel to serve him. But even his chosen race was not faithful to him. So the focus, continuing to narrow, became a mere ‘faithful remnant’. Ultimately, only one individual was completely faithful (shown by the central intersection of the cross). This was Jesus.\nJesus revealed what Israel (and indeed humankind) should have been. He was an Israelite sent to Israel, totally identifying with his nation and yet remaining distinct from it. No earthly king or prophet meets the description used in all the servant passages in Isaiah. Yet, Jesus does – perfectly.\nWhere Israel failed, Jesus succeeded. Furthermore, it is God’s plan that the church, through the victory of Christ and the power of the Holy Spirit, can and will succeed. So, the St Andrew’s cross broadens out again as the members of the church of Jesus Christ become the servants of God with a mission to call all humanity back to their original creation purpose.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 260
}