{
  "title": "Astronomie und Satelliten - Der Schutz des dunklen und ruhigen Himmels",
  "link": "https://www.deutschlandfunk.de/sternzeit-schutz-himmel-dunkel-100.html",
  "description": "<img src=\"https://assets.deutschlandfunk.de/4e4171c5-1475-431f-9633-a4fcbf416e27/1280x720.jpg?t=1659791068063\" alt=\"An image of the NGC 5353/4 galaxy group made with a telescope at Lowell Observatory in Arizona, USA on the night of Saturday 25 May 2019. The diagonal lines running across the image are trails of reflected light left by more than 25 of the 60 recently launched Starlink satellites as they passed through the telescopeâs field of view. Although this image serves as an illustration of the impact of reflections from satellite constellations, please note that the density of these satellites is significantly higher in the days after launch (as seen here) and also that the satellites will diminish in brightness as they reach their final orbital altitude.\" title=\"An image of the NGC 5353/4 galaxy group made with a telescope at Lowell Observatory in Arizona, USA on the night of Saturday 25 May 2019. The diagonal lines running across the image are trails of reflected light left by more than 25 of the 60 recently launched Starlink satellites as they passed through the telescopeâs field of view. Although this image serves as an illustration of the impact of reflections from satellite constellations, please note that the density of these satellites is significantly higher in the days after launch (as seen here) and also that the satellites will diminish in brightness as they reach their final orbital altitude.\"\n                    width=\"144\" height=\"81\" border=\"0\" align=\"left\" hspace=\"4\" vspace=\"4\"/>In einigen Jahren dürften zehntausende Satelliten um die Erde kreisen – mit verheerenden Folgen für die Astronomie. Denn die Satelliten reflektieren Sonnenlicht und senden Radiostrahlung aus.<br clear=\"all\"/><br/>Von Dirk Lorenzen<br/>www.deutschlandfunk.de, Sternzeit<br/><a title=\"Direkter Link zur Audiodatei\" href=\"https://podcast-mp3.dradio.de/podcast/2022/08/08/sternzeit_8_august_2022_der_schutz_des_dunklen_und_ruhigen_dlf_20220808_0205_3c77bf8c.mp3\">Direkter Link zur Audiodatei</a><br/><p><br/></p>",
  "guid": "https://podcast-mp3.dradio.de/podcast/2022/08/08/sternzeit_8_august_2022_der_schutz_des_dunklen_und_ruhigen_dlf_20220808_0205_3c77bf8c.mp3",
  "pubDate": "Mon, 08 Aug 2022 02:05:44 +0200",
  "enclosure": "",
  "itunes:author": "Lorenzen, Dirk",
  "itunes:duration": "02:32"
}