{
  "title": "The insatiable fight inside UFC’s Dana White | How one man’s passion and vision led the UFC to the ultimate comeback",
  "pubDate": "Wed, 06 Mar 2019 20:30:15 +0000",
  "guid": "f2747eef14a24bcab7b2930e6d2d0447",
  "link": "https://tonyrobbins.libsyn.com/the-insatiable-fight-inside-ufcs-dana-white-how-one-mans-passion-and-vision-led-the-ufc-to-the-ultimate-comeback",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">In this episode of the Tony Robbins Podcast, we are bringing you to Business Mastery – where Tony interviews the business leaders behind some of today’s fastest growing companies.</span> <span style=\"font-weight: 400;\">You’re going to have a front-row seat as Tony sits down with Dana White</span> <span style=\"font-weight: 400;\">– the current president of The Ultimate Fighting Championship, or UFC, and the man that took the once-fledgling organization from near bankruptcy to a globally popular multi-BILLION dollar enterprise.</span></p> <p><span style=\"font-weight: 400;\">Outspoken, charismatic and unabashedly unapologetic, it’s fair to say that there are not many leaders of major sporting organizations quite like Dana White. Coming from humble beginnings in the Northeast, his fight to the top was an unlikely one – and nothing short of a roller coaster ride.</span></p> <p><span style=\"font-weight: 400;\">Dana talks to Tony about the serendipitous mix of events that catapulted him from the bottom, all the way to the top of the UFC – and the risky decisions he made along the way that led the UFC to its ultimate comeback. Like the decision to</span> <em><span style=\"font-weight: 400;\">embrace r</span></em><span style=\"font-weight: 400;\">egulation instead of run from it, to move away from Pay-Per-View and broadcast fights on free TV, and perhaps the biggest decision of all, the one that changed the face of the sport – to</span> <span style= \"font-weight: 400;\">allow female fighters into the organization.</span></p> <p><span style=\"font-weight: 400;\">Dana has achieved success on a massive scale – he sold UFC for a whopping $4 billion back in 2017. But his fight isn’t over – and as he tells Tony in this special interview, he feels he hasn’t even scratched the surface of his total impact.</span></p>",
  "content:encoded": "<p>In this episode of the Tony Robbins Podcast, we are bringing you to Business Mastery – where Tony interviews the business leaders behind some of today’s fastest growing companies. You’re going to have a front-row seat as Tony sits down with Dana White – the current president of The Ultimate Fighting Championship, or UFC, and the man that took the once-fledgling organization from near bankruptcy to a globally popular multi-BILLION dollar enterprise.</p> <p>Outspoken, charismatic and unabashedly unapologetic, it’s fair to say that there are not many leaders of major sporting organizations quite like Dana White. Coming from humble beginnings in the Northeast, his fight to the top was an unlikely one – and nothing short of a roller coaster ride.</p> <p>Dana talks to Tony about the serendipitous mix of events that catapulted him from the bottom, all the way to the top of the UFC – and the risky decisions he made along the way that led the UFC to its ultimate comeback. Like the decision to <em>embrace r</em>egulation instead of run from it, to move away from Pay-Per-View and broadcast fights on free TV, and perhaps the biggest decision of all, the one that changed the face of the sport – to allow female fighters into the organization.</p> <p>Dana has achieved success on a massive scale – he sold UFC for a whopping $4 billion back in 2017. But his fight isn’t over – and as he tells Tony in this special interview, he feels he hasn’t even scratched the surface of his total impact.</p>",
  "enclosure": "",
  "itunes:duration": "49:10",
  "itunes:explicit": false,
  "itunes:keywords": "MMA,UFC,Dana,white,tony,robbins",
  "itunes:subtitle": "In this episode of the Tony Robbins Podcast, we are bringing you to Business Mastery – where Tony interviews the business leaders behind some of today’s fastest growing companies. You’re going to have a front-row seat as Tony sits down with Dana...",
  "itunes:episodeType": "full"
}