{
  "title": "Chinese Whispers: life in a mega-city",
  "link": "https://audioboom.com/posts/8160807",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2201,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In the last four decades, hundreds of millions of Chinese have moved into cities. Today, two thirds of the country live in urban areas (compared to just one third in 1985), and many of these are hubs with tens of millions of people – mega-cities that many in the West have never heard of before.<br>\n<br>\nWhat does this fast urbanisation do to communities and tradition? On this episode, Cindy Yu's guest Austin Williams (an architect turned journalist and academic) explains how these populations were thrown up into 'vertical living'. ‘If Ayn Rand had created a country, then China would be it’, says Austin. In other words, the family unit matters more than the community surrounding you.<br>\n<br>\nThis episode is a deep dive into urban life in China. Austin and Cindy discuss the residential compounds that we in the West have seen so much of through reporting of China's lockdowns; the demolitions required to pave the way for this wave of urbanisation, which, sadly, left some towns disembowelled without rebuilding (see Austin's film <a href=\"https://www.youtube.com/watch?v=PL8ka3Ax4AM\"><em>Edge Town</em></a> about one such settlement outside the city of Suzhou); and they debate whether it's a good thing that traditional Chinese aesthetics are returning to the country's modern architecture.<br>\n<br>\nIf you enjoy this podcast, you can now register your interest for an upcoming Chinese Whispers newsletter, at <a href=\"https://www.docs.google.com/forms/d/1kzf64KP_84kKFTR5q33aUJQoIt03QDZ6mmzDiUfuqyY/viewform?edit_requested=true\">www.spectator.co.uk/whispers</a>.</div>\n",
  "pubDate": "Tue, 20 Sep 2022 17:30:19 +0000",
  "guid": "tag:audioboom.com,2022-09-20:/posts/8160807",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}