{
  "id": "https://bibleinoneyear.org/en/youth/256",
  "title": "Day 256: Jesus Christ Lives in You",
  "description": "Proverbs 22:17–27, Isaiah 30:20-26, 31:1,5, 32:14–17, 2 Corinthians 13:3–14. If you ‘realise’ (v 5) this, it will transform the way you live your life",
  "pubDate": "Mon, 13 Sep 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/256/?ignore",
  "itunes:duration": "13:57",
  "guid": "enyouth13092021-256",
  "length": 837.56,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 256: Jesus Christ Lives in You",
  "itunes:subtitle": "Proverbs 22:17–27, Isaiah 30:20-26, 31:1,5, 32:14–17, 2 Corinthians 13:3–14. If you ‘realise’ (v 5) this, it will transform the way you live your life",
  "itunes:summary": "I brought in a boxing glove as a visual aid. I dangled the glove and showed how ineffective it was without a hand in it. Then I put my hand in the glove, made a fist and punched the air so that everyone could see the difference it made to the power of the glove.\nI was speaking at a prison for teenagers in Oxford. I was a theological student at the time and was given the opportunity to speak in a chapel service.\nThe prison chaplain at the detention centre, who was helping with my training, pointed out that it was an inappropriate illustration for a prison, since it might suggest that Jesus and violence were closely associated! Apart from that, he agreed that it was a good analogy.\nWhat I was trying to illustrate was the difference it makes when Jesus Christ comes to live in you by his Spirit. Without him we are weak (2 Corinthians 13:4), like the glove without the hand in it. But when Jesus Christ comes to live within you, you have God’s power in your life (vv.4–5).\nIf you ‘realise’ (v.5) this, it will transform the way you live your life.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 256
}