{
  "id": "yt:video:pUS-UlNNkzU",
  "yt:videoId": "pUS-UlNNkzU",
  "yt:channelId": "UCuWcjpKbIDAbZfHoru1toFg",
  "title": "GTA+ Membership Benefits - November 2022",
  "link": "",
  "author": {
    "name": "GTA Series Videos",
    "uri": "https://www.youtube.com/channel/UCuWcjpKbIDAbZfHoru1toFg"
  },
  "published": "2022-11-03T15:08:18+00:00",
  "updated": "2022-11-04T08:08:32+00:00",
  "media:group": {
    "media:title": "GTA+ Membership Benefits - November 2022",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Video breakdown of the benefits GTA+ Members will receive in the current month of Membership (November 2, 2022 - December 12, 2022).\n\nThe intent of this video is to show players the full extent of the bonuses and discounts available in the game and neither to encourage nor discourage the purchase of GTA+.\n\nGTA+ is a membership program which delivers benefits and rewards on GTA Online for both new and long-standing players exclusively on PlayStation 5 and Xbox Series X|S.\n&#13;\n► YOUTUBE: https://www.youtube.com/GTASeriesVideos&#13;\n► INSTAGRAM: https://www.instagram.com/GTASeriesNews&#13;\n► FACEBOOK: https://www.facebook.com/GTASeriesNews&#13;\n► TWITTER: https://twitter.com/GTASeries&#13;\n► DISCORD: https://discord.gg/GTASeries&#13;\n&#13;\n#GTA5 #GTAOnline #GTASeriesVideos&#13;\n&#13;\nABOUT US&#13;\n&#13;\nGTA Series Videos is a dedicated fan-channel in no way tied to Rockstar Games or Take-Two Interactive.&#13;\n&#13;\nHere you can find all the latest news, video walkthroughs and official trailers of the most successful video games published by Rockstar Games, including Grand Theft Auto series, Red Dead Redemption, Max Payne, L.A. Noire, Bully and many others.&#13;\n&#13;\nABOUT GRAND THEFT AUTO ONLINE&#13;\n&#13;\nGrand Theft Auto V for PC also includes Grand Theft Auto Online, with support for 30 players and two spectators. Grand Theft Auto Online for PC will include all existing gameplay upgrades and Rockstar-created content released since the launch of Grand Theft Auto Online, including Heists and Adversary modes.&#13;\n&#13;\nABOUT GRAND THEFT AUTO V&#13;\n&#13;\nWhen a young street hustler, a retired bank robber and a terrifying psychopath find themselves entangled with some of the most frightening and deranged elements of the criminal underworld, the U.S. government and the entertainment industry, they must pull off a series of dangerous heists to survive in a ruthless city in which they can trust nobody, least of all each other.&#13;\n&#13;\nGrand Theft Auto V for PC offers players the option to explore the award-winning world of Los Santos and Blaine County in resolutions of up to 4k and beyond, as well as the chance to experience the game running at 60 frames per second.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}