{
  "title": "91: The Boy Band Con: The Lou Pearlman Story",
  "link": "https://audioboom.com/posts/7305882",
  "itunes:episode": 91,
  "itunes:title": "The Boy Band Con: The Lou Pearlman Story",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3128,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In the 1990s, boy bands were king. Groups like N'SYNC and the Backstreet Boys were international sensations. But that wasn't the whole story. To tell the whole story, you have to talk about Lou Pearlman--the producer behind the pop explosion of the early 90s. Produced by Lance Bass, \"The Boy Band Con\" features interviews and never-before-told stories about how Pearlman conned the young artists--and countless others--out of hundreds of millions of dollars before becoming an international fugitive. <br>\n<br>\n<strong>LOOKING FOR MORE TCO? WHO COULD BLAME YOU</strong>! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Join our Patreon famand</a> instantly get over <strong>80 FULL BONUS episodes to BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!<br>\n<br>\n</a><a href=\"https://www.patreon.com/TrueCrimeObsessed/posts\">Check our our TCO After Party to hear our recap of our recap!</a> This week we're giving you ALL THE STORIES from our time in Nashville for PODX ad New Orleans for CrimeCon. And Things get a little bit.....steamy.....<br>\n<br>\n<strong>COME SEE US LIVE IN NYC OR TORONTO!</strong> <a href=\"https://www.truecrimeobsessed.com/see-us-live\">Get tickets and info here!</a>\n</div>\n",
  "pubDate": "Tue, 02 Jul 2019 20:52:40 +0000",
  "guid": "tag:audioboom.com,2019-07-02:/posts/7305882",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}