{
  "title": "53: The Starbucks Episode",
  "link": "https://audioboom.com/posts/7263318",
  "itunes:episode": 53,
  "itunes:title": "The Starbucks Episode",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2058,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Hot drinks… iced ones... frozen frapps, pastries, protein bowls, and so much more! Starbucks has so many yummy-sounding choices, but is there anything there that’s healthy?? We’re happy you asked, because in this episode, Lisa has your one-stop guide on what to order at Starbucks! From drinks to breakfast, lunch, and even dinner, this episode has it all! Plus, the gang tries the brand-new Mango Dragonfruit Starbucks Refreshers! So sit back and grab a cup of coffee, we’re going on a food and drink tour of Seattle’s greatest export on Chew The Right Thing! [www.hungry-girl.com/foodcast](https://hungry-girl.com/foodcast)",
  "itunes:subtitle": "Hot drinks… iced ones... frozen frapps, pastries, protein bowls, and so much more! Starbucks has so many yummy-sounding choices, but is there anything there that’s healthy?? We’re happy you asked, because in this episode, Lisa has your one-stop guide o...",
  "itunes:summary": "Hot drinks… iced ones... frozen frapps, pastries, protein bowls, and so much more! Starbucks has so many yummy-sounding choices, but is there anything there that’s healthy?? We’re happy you asked, because in this episode, Lisa has your one-stop guide on what to order at Starbucks! From drinks to breakfast, lunch, and even dinner, this episode has it all! Plus, the gang tries the brand-new Mango Dragonfruit Starbucks Refreshers! So sit back and grab a cup of coffee, we’re going on a food and drink tour of Seattle’s greatest export on Chew The Right Thing! [www.hungry-girl.com/foodcast](https://hungry-girl.com/foodcast)",
  "content:encoded": "<p>Hot drinks… iced ones... frozen frapps, pastries, protein bowls, and so much more! Starbucks has so many yummy-sounding choices, but is there anything there that’s healthy?? We’re happy you asked, because in this episode, Lisa has your one-stop guide on what to order at Starbucks! From drinks to breakfast, lunch, and even dinner, this episode has it all! Plus, the gang tries the brand-new Mango Dragonfruit Starbucks Refreshers! So sit back and grab a cup of coffee, we’re going on a food and drink tour of Seattle’s greatest export on Chew The Right Thing! <a href=\"https://hungry-girl.com/foodcast\">www.hungry-girl.com/foodcast</a></p>",
  "pubDate": "Fri, 17 May 2019 10:00:00 +0000",
  "guid": "tag:audioboom.com,2019-05-17:/posts/7263318",
  "itunes:author": "Lisa Lillien",
  "dc:creator": "Lisa Lillien",
  "media:rights": ""
}