{
  "title": "Innovator of the Year Awards: Edinburgh",
  "link": "https://audioboom.com/posts/8172807",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1557,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>The second regional podcast for <em>The Spectator’s</em> Economic Innovator of the Year Award sponsored by Investec was set in the picturesque city of Edinburgh where the judges and finalists met for lunch at the Dome on George Street. </div>\n<br>\n<div>We invited four finalists for the Scotland and Northern Ireland region — out of a record total of 176 across the whole of the UK — to pitch their ventures to our distinguished panel of judges. The finalists you’ll hear about on this podcast are: Cardinal Analytics a fintech business that predicts when enterprises are about to go bankrupt; MacRebur a novel invention for road surfacing; Roslin Technologies which make lab-grown meat; and Synaptec which work in manufacturing for fault sensors in power networks.  <br>\n <br>\n The judges were Merryn Somerset-Webb, editor and chief of MoneyWeek magazine and Financial Times columnist, Irene McAleese, co-founder and CEO of See.Sense, an early winner of these awards; finally our friends from Investec, Michelle White and Arlene Ewing.</div>\n<br>\n<div>The judges faced the tough task of comparing businesses in very different sectors and stages of development. But all four made compelling pitches – and the variety of entries is part of the fun of these awards.</div>\n<br>\n<div>We hope all the companies we meet gain from the networking opportunities, benefit from the accolade of being selected as finalists and enjoy the buzz, the conversation and the lunch.  We hope <em>Spectator</em> readers and podcast listeners also enjoy following the search for this year’s ultimate winners – and will take a few minutes to explore the finalists' websites and products. </div>\n<br>\n<div>More Economic Innovator of the Year Awards podcasts coming shortly!</div>\n",
  "pubDate": "Fri, 14 Oct 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-10-11:/posts/8172807",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}