{
  "title": "89: Creativity in Uncertain Times and The Bright Way with Diana Rowan",
  "pubDate": "Sun, 26 Apr 2020 19:35:53 +0000",
  "guid": "79058683-da6a-4cd6-97d6-0cbd0aea753a",
  "link": "https://lifeonpurpose.libsyn.com/89-creativity-in-uncertain-times-and-the-bright-way-with-diana-rowan",
  "itunes:image": "",
  "description": "<p><strong>Life on Purpose</strong> returns with Episode #89, the fourth chat in a series I’m calling <em>Seeing The Light In Uncertain Times</em>.<br /> <br /> My guest for this episode is creative alchemist <strong>Diana Rowan</strong>, the founder of the Bright Way Guild, a virtual learning environment dedicated to transforming and inspiring a global community of creatives. </p> <div> </div> <div>Taped in April 2020 as people around the world were dealing with the ramifications and massive uncertainty with the Coronavirus (COVID-19) pandemic, <strong>Diana</strong> joined me for an inspiring conversation on the importance of creativity in uncertain times.<br /> <br /> We also discussed her brand new book <strong>The Bright Way: Five Steps to Freeing the Creative Within</strong> <em>(just published by New World Library)</em>, in which she guides readers on every step, giving the tools needed to create a life full of happiness, inspiration, and purpose.<br /> <br /> <em>\"When we become anxious or afraid, it’s usually because we feel a lack of connection — with ourselves and with our communities. The antidote to fear is creativity. As fear fades, love takes center stage, and we become ourselves once more.\"</em> <div><br /> About Diana:<br /> <br /> <strong>Diana Rowan</strong> is a creative alchemist and founder of the Bright Way Guild, a virtual learning environment dedicated to transforming and inspiring a global community of creatives. From her youngest years, the classical inquiry “What makes a good life?” has driven Diana, and sharing her hard-won dis- coveries with others is her mission. Having recovered from a soul-crushing case of stage fright and other challenges, Diana believes that by shining light on the darkness we fear, we can all become courageous purveyors of Bright Knowledge and live the good life.<br /> <br /> <strong>Diana</strong> was born in Dublin, Ireland, to college-student parents, setting the stage for a lifetime of lively learning and seeking. Soon thereafter, her father became a diplomat for the Irish government, taking his family all over the world in a cosmopolitan pilgrimage. Respect for arts and cultures has always been second nature in Diana’s family, along with a deep streak of mysticism, as embodied by her astrologer mother.<br /> <br /> This unusual combination of intellectual seeking, cultural bridging, mystical opening, and artistic engagement is the hallmark of Diana’s life, whether that be in composing music, teaching, writing, or choosing a wine. Diana holds an MM in classical piano performance and a PhD in music theory.<br />  <br /> ###</div> </div>",
  "content:encoded": "<p>Life on Purpose returns with Episode #89, the fourth chat in a series I’m calling <em>Seeing The Light In Uncertain Times</em>.  My guest for this episode is creative alchemist Diana Rowan, the founder of the Bright Way Guild, a virtual learning environment dedicated to transforming and inspiring a global community of creatives. </p>   Taped in April 2020 as people around the world were dealing with the ramifications and massive uncertainty with the Coronavirus (COVID-19) pandemic, Diana joined me for an inspiring conversation on the importance of creativity in uncertain times.  We also discussed her brand new book The Bright Way: Five Steps to Freeing the Creative Within <em>(just published by New World Library)</em>, in which she guides readers on every step, giving the tools needed to create a life full of happiness, inspiration, and purpose.  <em>\"When we become anxious or afraid, it’s usually because we feel a lack of connection — with ourselves and with our communities. The antidote to fear is creativity. As fear fades, love takes center stage, and we become ourselves once more.\"</em>  About Diana:  Diana Rowan is a creative alchemist and founder of the Bright Way Guild, a virtual learning environment dedicated to transforming and inspiring a global community of creatives. From her youngest years, the classical inquiry “What makes a good life?” has driven Diana, and sharing her hard-won dis- coveries with others is her mission. Having recovered from a soul-crushing case of stage fright and other challenges, Diana believes that by shining light on the darkness we fear, we can all become courageous purveyors of Bright Knowledge and live the good life.  Diana was born in Dublin, Ireland, to college-student parents, setting the stage for a lifetime of lively learning and seeking. Soon thereafter, her father became a diplomat for the Irish government, taking his family all over the world in a cosmopolitan pilgrimage. Respect for arts and cultures has always been second nature in Diana’s family, along with a deep streak of mysticism, as embodied by her astrologer mother.  This unusual combination of intellectual seeking, cultural bridging, mystical opening, and artistic engagement is the hallmark of Diana’s life, whether that be in composing music, teaching, writing, or choosing a wine. Diana holds an MM in classical piano performance and a PhD in music theory.   ### ",
  "enclosure": "",
  "itunes:duration": "58:11",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Life on Purpose returns with Episode #89, the fourth chat in a series I’m calling Seeing The Light In Uncertain Times.  My guest for this episode is creative alchemist Diana Rowan, the founder of the Bright Way Guild, a virtual...",
  "itunes:episodeType": "full"
}