{
  "title": "Building a Fleet of Personal EVs in Kenya",
  "link": "https://spectrum.ieee.org/building-a-fleet-of-personal-evs-in-kenya",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-woman-dressed-in-a-black-t-shirt-and-blue-jeans-standing-inside-a-building-in-front-of-a-row-of-electric-bicycles.png?id=30836226&width=1200&height=800&coordinates=0%2C145%2C0%2C145\"/><br/><br/><p><strong>Electric vehicles are</strong> gaining in popularity around the world, especially with the high cost of fuel. But some of the current EV models aren’t a good fit for owners who can’t wait around for hours for their batteries to charge, such as taxi drivers, delivery people, and ride-hailing services.</p><p>One startup trying to solve this problem is <a href=\"https://arcrideglobal.com/#/home\" rel=\"noopener noreferrer\" target=\"_blank\">ARC Ride</a>, in Nairobi, Kenya.</p><hr/><p>Founded in 2020, the company sells a variety of EVs, including e-bikes, scooters, motorcycles, and <em>tuktuks</em>. ARC Ride is also installing battery-swapping stations around the city. The company’s app lets EV owners locate the battery-swap stations.</p><p>A key person involved in the critical tasks of assembling, servicing, and testing the company’s vehicles and related products is<a href=\"https://www.linkedin.com/in/magdalene-maluta-8a901114b/?originalSubdomain=ke\" rel=\"noopener noreferrer\" target=\"_blank\"> Magdalene Maluta</a>. The EV enthusiast came to the 20-employee company through the confluence of motivation, the right mix of skills, and fate.</p><p>“Before I came to ARC Ride, I had been looking into EVs [as a career choice],” Maluta says. “I would read about <a href=\"https://www.tesla.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Tesla</a> and wish I was one of the people in their videos making the vehicles.”</p><p>In March 2020, an IT firm where she was about to start a new job was shuttered because of the COVID-19 pandemic. After struggling to find a job, Maluta got a call in January 2021 from ARC Ride, offering her a position after someone had recommended her. She started with assembly and maintenance, where she learned about EVs from the ground up.</p><p>Working with electric vehicles requires mechanical and engineering expertise. Maluta has diplomas in mechanical engineering from the <a href=\"https://www.nita.go.ke/\" rel=\"noopener noreferrer\" target=\"_blank\">National Industrial Training Authority</a> and the <a href=\"http://kinyanjuitechnical.ac.ke/\" rel=\"noopener noreferrer\" target=\"_blank\">PC Kinyanjui Technical Training Institute</a>, both in Nairobi.</p><p>“My electrical engineering courses included basic electronics, programming, automation, robots, and robotics,” she says. “Applying what I learned in them has helped me solve problems in mechanical engineering and made my work easier.\"</p><p> As an inventory and maintenance manager, Maluta is involved in many facets of the company, including supervising the assembly of EVs, overseeing the maintenance and support teams, tracking inventory, and helping test new features on the mobile app. She is also helping to design and develop the company’s next generation of vehicles, batteries, and swap stations.</p><p> ARC Ride offers four types of EVs. The E1 is an electric bicycle with a battery range of 60 kilometers and up to 65 km with pedal assist. With the throttle, the top speed is 60 km/h, and with pedaling added, it can get up to 65 km/h. The E2 is a two-wheel scooter with a battery range of 85 km and a top speed of 60 km/h. The E2+ all-electric motorcycle—called a <em>boda-boda—</em>can accommodate two batteries and gets a range of 85 km with one battery and 160 km with two. Its top speed is 75 km/h. The E3, a three-wheeled <em>tuktuk</em> motorized rickshaw, can carry up to 500 kilograms of goods and has a range of 80 km. </p><p class=\"pull-quote\">“You have to have the drive and passion for this kind of work, and you need to show it. Do not doubt yourself.”</p><p>Each vehicle includes a charger. Recharging a depleted battery takes less than 4 hours, Maluta says. As an alternative, owners can exchange their nearly discharged battery at the company’s battery-swap stations for a fully charged one. It takes about 2 minutes to complete a battery swap, Maluta says.</p><p>The startup has aggressive plans to add more models and increase production and sales to about 500 vehicles per month, along with adding more swap stations, she says. ARC Ride recently received an order for parts to assemble 120 E2+ motorcycles. It also has plans to expand to other cities in Kenya as well as neighboring countries in East Africa.</p><p> “We are looking into having a single battery that can be used in all four of our current EVs, which will make our swap stations even more useful,” she says. “Also, we are looking into increasing our vehicles’ range and speed. We want to add regenerative braking, which converts braking energy into electricity that goes back into the battery. And—like all EV makers—we want faster battery charging.” </p><p> Part of her job is testing scooters and e-bikes around the city, for performance, top speed, braking, and range. “When we do maintenance or service on one, I test each vehicle’s performance personally,” she says.</p><p>Maluta also has a hand in hiring people and looks for specific skills. “To design and develop EV products, you have to be able to use tools like AutoCAD, Autodesk, and SolidWorks. And you can’t do that without an engineering background.” </p><p>ARC Ride is committed to diversity in its hiring, and Maluta works hard to hire more women for her team. But, she emphasizes, “You have to have the drive and passion for this kind of work, and you need to show it. Do not doubt yourself. Your identity should be the last thing that is going to limit you.”</p><p><em>This article appears in the September 2022 print issue as “Magdalene Maluta.”</em></p>",
  "pubDate": "Thu, 18 Aug 2022 15:14:39 +0000",
  "guid": "https://spectrum.ieee.org/building-a-fleet-of-personal-evs-in-kenya",
  "category": [
    "Electric vehicles",
    "Ev",
    "Ev batteries",
    "Profile",
    "Startups",
    "Transportation",
    "Type:departments",
    "Careers"
  ],
  "dc:creator": "Daniel P. Dern",
  "media:content": ""
}