{
  "title": "ONYX BOOX Tab Ultra ePaper Tablet Launches with Qualcomm Snapdragon 662",
  "dc:creator": "Ganesh T S",
  "description": " <p align=\"center\"><a href=\"https://www.anandtech.com/show/17627/onyx-boox-tab-ultra-epaper-tablet-launches-with-qualcomm-snapdragon-662\"><img src=\"https://images.anandtech.com/doci/17627/onyx-tab-ultra-carousel_575px.png\" alt=\"\" /></a></p><p><p>The e-Paper market has enjoyed steady growth over the last decade, starting with the introduction of the Amazon Kindle back in 2007. While there are many vendors attempting to make a mark in the technology required in this space, E-Ink's offerings have ruled the roost.</p>\n\n<p>The most popular category of products using E-Ink's technology has undoubtedly been eBook readers. Recently, digital notebooks and notepads have also emerged as a significant driver in E-Ink's expansion. These products take the regular e-reader and add support for an electronic pen / stylus. These products were initially quite expensive and targeted business professionals dealing with huge amounts of paperwork and requiring note-taking support (such as lawyers). The Sony DPT lineup (<a href=\"https://www.anandtech.com/show/9860/\">review</a>) became one of the leading products in this category. As the market expanded, vendors such as <a href=\"https://remarkable.com/\">reMarkable</a> and <a href=\"https://onyxboox.com\">ONYX</a> also started putting out compelling products - expanding the target market to creative professionals and students as well. This category became truly mass-market a few months back with the introduction of Amazon's <a href=\"https://www.amazon.com/Introducing-Kindle-Scribe-the-first-Kindle-for-reading-and-writing/dp/B09BRZBK15?tag=hawk-future-20&ascsubtag=anandtech\">Kindle Scribe</a> (and slated to start shipping in time for the holiday season).</p>\n\n<p>ONYX has been serving the e-reader market since 2006. They have an extensive lineup of e-readers (both grayscale and color), e-Paper tablets with note-taking support, and even E-Ink monitors. Today, the company is launching a new category - ePaper Tablet PCs. The first product in this lineup is the ONYX BOOX Tab Ultra - a 10.3\" unit complete with a 16MP rear-facing camera. A first for E-Ink devices, ONYX envisages the camera being used to OCR documents in the field without the need for an external device as an intermediary. The device targets professional use-cases. It must be noted that ONYX already carries the BOOX Note Air 2 Plus that carries most of the same features, but geared towards the home / casual consumer.</p>\n\n<p>The ONYX BOOX Tab Ultra is the first e-reader model from ONYX to utilize the company's proprietary fast refresh algorithm implemented using a separate hardware module on the board. The company has been using this on its Mira lineup of E-Ink monitors, and its use in the e-reader is supposed to improve user experience with web content. Scrolling, in particular, has been a weak point of E-Ink tablets due to the low refresh rate. The actual improvements delivered by the ONYX 'BSR' (BOOX Super Refresh) algorithm in this aspect needs hands-on evaluation for further analysis. The system supports four different modes for different tasks - reading books doesn't require fast refreshing and can utilize the 'HD Mode', while typing requires a 'Balance Mode'. A 'Fast Mode' is available for web browsing, and an 'Ultrafast Mode' for generic Android applications.</p>\n\n<p>The BOOX Tab Ultra utilizes a Qualcomm Snapdragon 662 SoC (4x Kyro Gold (A73-class) @ 2GHz + 4x Kyro Silver (A53-class) @ 1.8 GHz, along with an Adreon 610 GPU), and comes with a specialized version of Android 11 (including Play Store support). The unit is equipped with a 6300 mAh battery, 4GB of LPDDR4x DRAM, and 128GB of eMMC flash storage. The USB-C port in the system also supports OTG functionality, and a micro-SDXC card slot. A keyboard case with a magnetic holder for the Tab Ultra is also available.</p>\n\n<p>ONYX has a reputation for long support cycles, and provides regular firmware updates to augment the functionality of its ePaper tablets. Recent firmware updates have brought a more tablet-like experience in the user interface - a home screen with apps along with a favorites dock at the bottom. ONYX claims that the use of Android in its tablets (compared to custom OSes in other products such as the Kindle Scribe and reMarkable tablets) enables its customers to take advantage of the host of personal knowledge management apps available for note taking and data collection. Another recently added functionality relates to the association of different pages in different documents using easily-created tags.</p>\n\n<p align=\"center\"><a href=\"https://www.anandtech.com/show/17627/onyx-boox-tab-ultra-epaper-tablet-launches-with-qualcomm-snapdragon-662\"><img alt=\"\" src=\"https://images.anandtech.com/doci/17627/onyx-tab-ultra-01_575px.png\" /></a></p>\n\n<p>The ONYX BOOX Tab Ultra is available for pre-order today and comes with a <a href=\"https://shop.boox.com/products/tab\">$600</a> price tag. The company is also simultaneously releasing the <em>Nova Air 2</em> 7.8\" e-Paper tablet with stylus support at $400 and the <em>Leaf 2</em> 7\" e-reader at $200. ONYX has typically not hesitated in trying out innovative ideas on the e-Paper front (they were one of the first vendors to bring out color e-readers), and equipping an e-reader / digital notebook with a rear camera is yet another interesting play from the company. The new products expand ONYX's target market and build upon its position as one of the leading E-Ink product vendors in the market in the face of rising competition.</p>\n</p>",
  "link": "https://www.anandtech.com/show/17627/onyx-boox-tab-ultra-epaper-tablet-launches-with-qualcomm-snapdragon-662",
  "pubDate": "Wed, 26 Oct 2022 22:30:00 EDT",
  "guid": "tag:www.anandtech.com,17627:news",
  "category": " e-ink"
}