{
  "title": "Upholder, Questioner, Obliger or Rebel? |  Happiness expert Gretchen Rubin talks about The 4 Tendencies",
  "pubDate": "Wed, 31 Jan 2018 22:10:16 +0000",
  "guid": "24358c8b4cfb500f19a09775e350a33c",
  "link": "https://tonyrobbins.libsyn.com/upholder-questioner-obliger-or-rebel-happiness-expert-gretchen-rubin-talks-about-the-4-tendencies",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">We all want to have healthy habits. Whether that means eating right, working efficiently, exercising or taking care of yourself emotionally - healthy habits help us lead happier lives. But how do you adopt healthy habits? How do you step out of the struggle and make them part of your DNA? After all - we’re all wired completely differently and respond to inner and outer expectations in our own ways. So what is the solution that will work for you?</span></p> <p><span style=\"font-weight: 400;\">In this episode of the Tony Robbins Podcast, our host, Ana Yoerg, sits down with best-selling author and happiness expert,</span> <a href= \"https://gretchenrubin.com\"><span style= \"font-weight: 400;\">Gretchen Rubin</span></a><span style= \"font-weight: 400;\">.</span></p> <p><span style=\"font-weight: 400;\">Gretchen has written four New York Times best-selling books, including: The Four Tendencies, Better than Before, Happier at Home and The Happiness Project. Her books have sold more than 3 million copies worldwide. She hosts an award-winning podcast, “Happier with Gretchen Rubin,” where she discusses happiness and forming good habits with her sister, Elizabeth Craft. And she is widely regarded as the foremost authority when it comes to habits, human nature and happiness.</span></p> <p><span style=\"font-weight: 400;\">Gretchen maintains that people fall under 1 of 4 behavioral tendencies - the upholder, the obliger, the questioner or the rebel. It’s about how we respond to both inner and outer expectations. Do you embrace the rules? Do you resist? What compels you? What frustrates you?</span></p> <p><span style=\"font-weight: 400;\">Understanding your tendency towards expectations can help you manage your life in a more insightful, productive way. And in this episode, she distills complex psychological tendencies into habit-forming strategies that really work for the individual. So you can make better decisions, meet deadlines, engage more effectively, and even find a better way of understanding</span> <em><span style= \"font-weight: 400;\">other</span></em> <span style= \"font-weight: 400;\">people’s perspectives – allowing you to find more effective ways of communicating, connecting and finding happiness.</span></p> <p><br /> <br /></p>",
  "content:encoded": "<p>We all want to have healthy habits. Whether that means eating right, working efficiently, exercising or taking care of yourself emotionally - healthy habits help us lead happier lives. But how do you adopt healthy habits? How do you step out of the struggle and make them part of your DNA? After all - we’re all wired completely differently and respond to inner and outer expectations in our own ways. So what is the solution that will work for you?</p> <p>In this episode of the Tony Robbins Podcast, our host, Ana Yoerg, sits down with best-selling author and happiness expert, <a href= \"https://gretchenrubin.com\">Gretchen Rubin</a>.</p> <p>Gretchen has written four New York Times best-selling books, including: The Four Tendencies, Better than Before, Happier at Home and The Happiness Project. Her books have sold more than 3 million copies worldwide. She hosts an award-winning podcast, “Happier with Gretchen Rubin,” where she discusses happiness and forming good habits with her sister, Elizabeth Craft. And she is widely regarded as the foremost authority when it comes to habits, human nature and happiness.</p> <p>Gretchen maintains that people fall under 1 of 4 behavioral tendencies - the upholder, the obliger, the questioner or the rebel. It’s about how we respond to both inner and outer expectations. Do you embrace the rules? Do you resist? What compels you? What frustrates you?</p> <p>Understanding your tendency towards expectations can help you manage your life in a more insightful, productive way. And in this episode, she distills complex psychological tendencies into habit-forming strategies that really work for the individual. So you can make better decisions, meet deadlines, engage more effectively, and even find a better way of understanding <em>other</em> people’s perspectives – allowing you to find more effective ways of communicating, connecting and finding happiness.</p> <p> </p>",
  "enclosure": "",
  "itunes:duration": "42:16",
  "itunes:explicit": false,
  "itunes:keywords": "and,happiness,wellness,mind,Meaning,tony,robbins,rubin,gretchen",
  "itunes:subtitle": "We all want to have healthy habits. Whether that means eating right, working efficiently, exercising or taking care of yourself emotionally - healthy habits help us lead happier lives. But how do you adopt healthy habits? How do you step out of the...",
  "itunes:episodeType": "full"
}