{
  "id": "https://bibleinoneyear.org/en/youth/160",
  "title": "Day 160: Stay Loyal",
  "description": "Proverbs 14:19,21–22, 2 Samuel 14:1,20–22, 15:5–6, Acts 5:12,14,17–21,27–29,41–42.  It is a quality often lacking in our society today  Disloyalty destroys families, churches, businesses, political parties and even nations",
  "pubDate": "Thu, 09 Jun 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/160/",
  "itunes:duration": "15:36",
  "guid": "enyouth09062022-160",
  "length": 936.52,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 160: Stay Loyal",
  "itunes:subtitle": "Proverbs 14:19,21–22, 2 Samuel 14:1,20–22, 15:5–6, Acts 5:12,14,17–21,27–29,41–42.  It is a quality often lacking in our society today  Disloyalty destroys families, churches, businesses, political parties and even nations",
  "itunes:summary": "In 2007, a group of twenty-three South Korean missionaries were captured by the Taliban in Afghanistan. They were terrified. The Taliban separated the group, isolated them and confiscated their possessions. One of the Korean women managed to hold on to her Bible. She ripped it into twenty-three pieces and secretly gave each of them a portion so that wherever they were, each person could read a part of Scripture when no one was watching.\nThe group knew that the Taliban had decided to kill them, one at a time. One by one the missionaries surrendered their lives again to Jesus saying, ‘Lord, if you want me to die for your sake I’ll do it.’ Then the pastor said, ‘I’ve talked to [the Taliban] because they are going to start killing us and I’ve told their leaders that if anyone dies, I die first because I am your pastor.’ Another said, ‘No, because I also am a pastor and I am your elder. I die first.’\nThen the pastor came back and said, ‘You are not ordained, I have been ordained, I die first.’ And sure enough, he died first. Two were killed before the rest were eventually rescued. They had demonstrated extraordinary loyalty to God and to each other.\nLoyalty is a combination of love and faithfulness. It is a quality often lacking in our society today. Disloyalty destroys families, churches, businesses, political parties and even nations.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 525
}