{
  "title": "Extending the analogy between intracellular motion in mammalian cells and glassy dynamics. (arXiv:2211.02019v1 [cond-mat.soft])",
  "link": "http://arxiv.org/abs/2211.02019",
  "description": "<p>The physics of how molecules, organelles, and foreign objects move within\nliving cells has been extensively studied in organisms ranging from bacteria to\nhuman cells. In mammalian cells, in particular, cellular vesicles move across\nthe cell using motor proteins that carry the vesicle down the cytoskeleton to\ntheir destination. We have recently noted several similarities between the\nmotion of such vesicles and that in disordered, \"glassy\", systems, but it\nremains unclear whether that is a general observation or something specific to\ncertain vesicles in one particular cell type. Here we follow the motion of\nmitochondria, the organelles responsible for cell energy production, in several\nmammalian cell types over timescales ranging from 50 ms up to 70 s. Qualitative\nobservations show that single mitochondria remain stalled, remaining within a\nspatially limited region, for extended periods of time, before moving longer\ndistances relatively quickly. Analysing this motion quantitatively, we observe\na displacement distribution that is roughly Gaussian for shorter distances\n($\\lesssim$ 0.05 $\\mu$m) but which exhibits exponentially decaying tails at\nlonger distances (up to 0.40 $\\mu$m). We show that this behaviour is\nwell-described by a model originally developed to describe the motion in glassy\nsystems. These observations are extended to in total 3 different objects\n(mitochondria, lysosomes and nano-sized beads enclosed in vesicles), 3\ndifferent mammalian cell types, from 2 different organisms (human and mouse).\nWe provide further evidence that supports glass-like characteristics of the\nmotion by showing a difference between the time it takes to move a longer\ndistance for the first time and subsequent times, as well as a weak ergodicity\nbreaking of the motion. Overall, we demonstrate the ubiquity of glass-like\nmotion in mammalian cells, providing a different perspective on intracellular\nmotion.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cond-mat/1/au:+Corci_B/0/1/0/all/0/1\">B. Corci</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Hooiveld_O/0/1/0/all/0/1\">O. Hooiveld</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Dolga_A/0/1/0/all/0/1\">A. M. Dolga</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+%7B%5CAA%7Dberg_C/0/1/0/all/0/1\">C. &#xc5;berg</a>"
}