{
  "title": "If you did not already know",
  "link": "https://analytixon.com/2022/10/30/if-you-did-not-already-know-1872/",
  "comments": "https://analytixon.com/2022/10/30/if-you-did-not-already-know-1872/#respond",
  "dc:creator": "Michael Laux",
  "pubDate": "Sun, 30 Oct 2022 02:03:19 +0000",
  "category": "What is ...",
  "guid": "https://analytixon.com/?p=37437",
  "description": "DensSiam Convolutional Siamese neural networks have been recently used to track objects using deep features. Siamese architecture can achieve real &#8230;<p><a href=\"https://analytixon.com/2022/10/30/if-you-did-not-already-know-1872/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a></p>",
  "content:encoded": "<p><a href=\"http://arxiv.org/abs/1809.02714v1\" target=\"top\" rel=\"noopener\"><strong>DensSiam</strong></a>  <a href=\"https://www.google.de/search?q=DensSiam\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" class=\"alignright\" src=\"https://analytixon.files.wordpress.com/2015/01/google.png?w=529\" alt=\"google\" data-recalc-dims=\"1\"/></a><BR/><span style=\"font-size:12px;font-style:normal;text-align:justify;\">Convolutional Siamese neural networks have been recently used to track objects using deep features. Siamese architecture can achieve real time speed, however it is still difficult to find a Siamese architecture that maintains the generalization capability, high accuracy and speed while decreasing the number of shared parameters especially when it is very deep. Furthermore, a conventional Siamese architecture usually processes one local neighborhood at a time, which makes the appearance model local and non-robust to appearance changes. To overcome these two problems, this paper proposes DensSiam, a novel convolutional Siamese architecture, which uses the concept of dense layers and connects each dense layer to all layers in a feed-forward fashion with a similarity-learning function. DensSiam also includes a Self-Attention mechanism to force the network to pay more attention to the non-local features during offline training. Extensive experiments are performed on four tracking benchmarks: OTB2013 and OTB2015 for validation set; and VOT2015, VOT2016 and VOT2017 for testing set. The obtained results show that DensSiam achieves superior results on these benchmarks compared to other current state-of-the-art methods. &#8230; </span><BR/><BR/><a href=\"http://arxiv.org/abs/1706.01445v1\" target=\"top\" rel=\"noopener\"><strong>Ensemble Bayesian Optimization (EBO)</strong></a>  <a href=\"https://www.google.de/search?q=Ensemble Bayesian Optimization\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" class=\"alignright\" src=\"https://analytixon.files.wordpress.com/2015/01/google.png?w=529\" alt=\"google\" data-recalc-dims=\"1\"/></a><BR/><span style=\"font-size:12px;font-style:normal;text-align:justify;\">Bayesian Optimization (BO) has been shown to be a very effective paradigm for tackling hard black-box and non-convex optimization problems encountered in Machine Learning. Despite these successes, the computational complexity of the underlying function approximation has restricted the use of BO to problems that can be handled with less than a few thousand function evaluations. Harder problems like those involving functions operating in very high dimensional spaces may require hundreds of thousands or millions of evaluations or more and become computationally intractable to handle using standard Bayesian Optimization methods. In this paper, we propose Ensemble Bayesian Optimization (EBO) to overcome this problem. Unlike conventional BO methods that operate on a single posterior GP model, EBO works with an ensemble of posterior GP models. Further, we represent each GP model using tile coding random features and an additive function structure. Our approach generates speedups by parallelizing the time consuming hyper-parameter posterior inference and functional evaluations on hundreds of cores and aggregating the models in every iteration of BO. Our extensive experimental evaluation shows that EBO can speed up the posterior inference between 2-3 orders of magnitude (400 times in one experiment) compared to the state-of-the-art by putting data into Mondrian bins without sacrificing the sample quality. We demonstrate the ability of EBO to handle sample-intensive hard optimization problems by applying it to a rover navigation problem with tens of thousands of observations. &#8230; </span><BR/><BR/><a href=\"http://arxiv.org/abs/1905.07375v1\" target=\"top\" rel=\"noopener\"><strong>AutoML for Loss Function Search (AM-LFS)</strong></a>  <a href=\"https://www.google.de/search?q=AutoML for Loss Function Search\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" class=\"alignright\" src=\"https://analytixon.files.wordpress.com/2015/01/google.png?w=529\" alt=\"google\" data-recalc-dims=\"1\"/></a><BR/><span style=\"font-size:12px;font-style:normal;text-align:justify;\">Designing an effective loss function plays an important role in visual analysis. Most existing loss function designs rely on hand-crafted heuristics that require domain experts to explore the large design space, which is usually sub-optimal and time-consuming. In this paper, we propose AutoML for Loss Function Search (AM-LFS) which leverages REINFORCE to search loss functions during the training process. The key contribution of this work is the design of search space which can guarantee the generalization and transferability on different vision tasks by including a bunch of existing prevailing loss functions in a unified formulation. We also propose an efficient optimization framework which can dynamically optimize the parameters of loss function&#8217;s distribution during training. Extensive experimental results on four benchmark datasets show that, without any tricks, our method outperforms existing hand-crafted loss functions in various computer vision tasks. &#8230; </span><BR/><BR/><a href=\"http://arxiv.org/abs/1802.06931v1\" target=\"top\" rel=\"noopener\"><strong>Empirical Bayes Matrix Factorization (EBMF)</strong></a>  <a href=\"https://www.google.de/search?q=Empirical Bayes Matrix Factorization\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" class=\"alignright\" src=\"https://analytixon.files.wordpress.com/2015/01/google.png?w=529\" alt=\"google\" data-recalc-dims=\"1\"/></a><BR/><span style=\"font-size:12px;font-style:normal;text-align:justify;\">Matrix factorization methods &#8211; including Factor analysis (FA), and Principal Components Analysis (PCA) &#8211; are widely used for inferring and summarizing structure in multivariate data. Many matrix factorization methods exist, corresponding to different assumptions on the elements of the underlying matrix factors. For example, many recent methods use a penalty or prior distribution to achieve sparse representations (&#8216;Sparse FA/PCA&#8217;). Here we introduce a general Empirical Bayes approach to matrix factorization (EBMF), whose key feature is that it uses the observed data to estimate prior distributions on matrix elements. We derive a correspondingly-general variational fitting algorithm, which reduces fitting EBMF to solving a simpler problem &#8211; the so-called &#8216;normal means&#8217; problem. We implement this general algorithm, but focus particular attention on the use of sparsity-inducing priors that are uni-modal at 0. This yields a sparse EBMF approach &#8211; essentially a version of sparse FA/PCA &#8211; that automatically adapts the amount of sparsity to the data. We demonstrate the benefits of our approach through both numerical comparisons with competing methods and through analysis of data from the GTEx (Genotype Tissue Expression) project on genetic associations across 44 human tissues. In numerical comparisons EBMF often provides more accurate inferences than other methods. In the GTEx data, EBMF identifies interpretable structure that concords with known relationships among human tissues. Software implementing our approach is available at <a href=\"https://github.com/stephenslab/flashr.\" target=\"top\" rel=\"noopener\">https://&#8230;/flashr.</a>  &#8230; </span><BR/></p>\n",
  "wfw:commentRss": "https://analytixon.com/2022/10/30/if-you-did-not-already-know-1872/feed/",
  "slash:comments": 0,
  "post-id": 37437
}