{
  "title": "Top 4 lessons I’ve learned building a deeptech brand from scratch",
  "link": "https://e27.co/the-top-4-lessons-ive-learned-building-accredify-a-deep-tech-brand-from-scratch-20221030/",
  "dc:creator": "Jessica Tan Shu En",
  "pubDate": "Tue, 01 Nov 2022 06:00:52 +0000",
  "category": [
    "Community",
    "Deeptech",
    "Enterprise Solution & CRM",
    "Accredify"
  ],
  "guid": "https://e27.co/?p=475088",
  "description": "<p>I joined Accredify in 2020 as the founding member of the Marketing and Communications departments. Apart from the daunting task of building the firm’s marketing and communications department with limited resources and budget, as well as performing both strategic and executive duties to get the department running, there was another huge challenge that stood in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/the-top-4-lessons-ive-learned-building-accredify-a-deep-tech-brand-from-scratch-20221030/\">Top 4 lessons I’ve learned building a deeptech brand from scratch</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<img loading=\"lazy\" class=\"aligncenter wp-image-475330 size-full\" src=\"https://e27.co/wp-content/uploads/2022/10/e27-30-1.png\" alt=\"\" width=\"690\" height=\"390\" />\n<p>I joined Accredify in 2020 as the founding member of the Marketing and Communications departments.</p>\n<p>Apart from the daunting task of building the firm’s marketing and communications department with limited resources and budget, as well as performing both strategic and executive duties to get the department running, there was another huge challenge that stood in my way: consumers at that time were distrustful of the blockchain.</p>\n<p>As <a rel=\"follow\" href=\"https://www.forbes.com/sites/bernardmarr/2018/02/19/the-5-big-problems-with-blockchain-everyone-should-be-aware-of/?sh=1f77ce031670\">Forbes remarked in 2018</a>, the complexity behind blockchain technology “meant end users found it hard to appreciate its benefits”. At a time when deeptech such as the blockchain, was met with limited understanding, I had to educate and connect with potential clients on how our solution worked in a simplified manner.</p>\n<p>So, the big question mark was how do I build trust in the company during a time when the public’s understanding of the benefits of deeptech was relatively unknown?</p>\n<p>In addition, Accredify is a SaaS solution, a service with a level of intangibility. How can I ensure that clients will want to invest their time and money into a service that they cannot see beyond a sales demo?</p>\n<p>Today, Accredify’s brand has become prominent in the market of decentralised verification and identity tools: researchers from around the world have featured us in <a rel=\"follow\" href=\"https://globalizationandhealth.biomedcentral.com/articles/10.1186/s12992-022-00873-x\">peer-reviewed research papers</a> and <a rel=\"follow\" href=\"https://www.digitaljournal.com/pr/decentralized-identity-solution-market-next-big-thing-major-giants-linux-blocwatch-bizsecure\">white papers</a>.</p>\n<p>We have secured over 100 organic media features within twenty months in the likes of Forbes, CNBC, and The Business Times.</p>\n<p>In 2022 alone, our spokespersons have been invited as guest speakers at more than 30 regional events and roundtables with government ministers to discuss the digital transformation of the public sector.</p>\n<p>In this article, I will pen down my marketing journey, detailing how I developed a strategy to position Accredify as a thought leader and trusted brand in the decentralised verification solutions space, as well as share some personal lessons I have learned along the way.</p>\n<h1>Create a master goal</h1>\n<p>The first and most crucial step: identify a vision for your department.</p>\n<p>What should your department be achieving? The purpose I identified for Accredify’s marketing and communications department was to build trust.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/echelon-2022-a-peek-at-the-future-of-marketing-measurement-20221017/\">Echelon 2022: A peek at the future of marketing measurement</a></strong></p>\n<p>Understanding that our main challenge was trying to connect with clients who did not have a deep understanding of our tech stack, I realised the fastest way to win the hearts and minds of our potential clients was to convince potential clients that Accredify can deliver on our promises and solve their needs, and the fastest way to do that was through establishing brand trust.</p>\n<p>After identifying your master goal, create a list of your department’s responsibilities, and break them down into initiatives that will help you achieve your master goal whilst remaining within budget.</p>\n<p>For example, Corporate Communications’ priorities will oversee pitching press releases, obtaining media coverage, and arranging speaker opportunities for company spokespersons to build credibility in our management. The Marketing department must build social media presence by using it as a free and powerful communication tool to reach your target audience.</p>\n<p>Often, decisions will have to be made quickly, and you won’t have the privilege of time to weigh your options thoroughly. Your vision will act as your north star and will help guide your decision-making between multiple options or dilemmas to ensure that the initiative you have selected will bring you closer to the master goal.</p>\n<h2>Public relations is a CMO’s most valuable tool</h2>\n<p>Public relations is the fastest way to raise brand awareness and educate potential clients on your product.</p>\n<p>However, it’s imperative to note that PR is not just blasting new products and achievements left-right and centre – it’s a strategic tool to build trust-based relationships with your clients.</p>\n<p>With every initiative or new product feature your company develops, don’t shout out about how the product works. Instead, tell a story about how your product solves problems and, most importantly, helps people.</p>\n<p>Establishing your spokespersons as experts and thought leaders is a crucial goal for PR as well. As <a rel=\"follow\" href=\"https://www.edelman.com/research/trust-brands-make-break-moment\">Edelman’s 2020 Trust Barometer Special Report</a> indicated, 63 per cent of respondents were more inclined to trust a brand if it was seen as a protector or innovator. The same report revealed that people also preferred to hear directly from experts in a certain field.</p>\n<p>As such, establishing your company as an innovator and your spokespersons as thought leaders is imperative in the early stages of your company to set up your brand.</p>\n<p>For instance, during the COVID-19 pandemic, Accredify created a first-of-its-kind product called Accredify START to help HR staff ensure that their workplace is safe by providing their employees with a Digital Health Passport to contain their verifiable COVID-19 test results. This reduced manual data entry of an employee’s COVID-19 status reassured the workforce that their office was safe for re-entry.</p>\n<p>I pitched this story to revolve around one of the top-of-mind feelings that the public was experiencing at that time – safety. Through our earned media and spokesperson interviews from this product press release, we obtained incredible leads from companies we had no initial relationship with, such as KPMG, Blackrock, and DHL.</p>\n<p>Zig Ziglar once said, “People buy on emotion and justify with logic.” Create a bond with your clients, and they’ll start to trust you – the first step in the sales process.</p>\n<p>That’s why it is just as important to add a personal touch to your communications. Adding a face behind the brand humanises your business and makes your company more approachable. Along with establishing your spokespersons as thought leaders, it makes people feel like they are in capable hands.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/keep-your-customers-around-with-stellar-retention-strategies-20221013/\">Keep your customers around with stellar retention strategies</a></strong></p>\n<p>Aside from traditional PR channels such as news websites or hardcopy newspapers, don’t forget to utilise other modern communication channels your company owns to connect with potential clients.</p>\n<p>That’s why I introduced social media content verticals that introduced the faces of our employees and their responsibilities in creating the product and consistently shared announcements of speaker panels and behind-the-scenes shots of interviews with our founders. The result was a 120x increase in social media followers in eight months.</p>\n<h2>Trash the jargon</h2>\n<p>Remember that even if you’re working for a tech company, it doesn’t mean you have to add technical terms in every message to prove that you know what you’re talking about.</p>\n<p>In fact, I’m a firm believer in the buyer collective, where everyone can be an advocate for your business, from an end-user, and project manager, to a C-suite. So, keep your message simple and easy to understand by everyone. Be aware of the words you use to erase the possibility of confusion or doubt for individuals.</p>\n<p>For example, in the beginning, when I knew that the blockchain and its abilities were not well-known, it was an active decision to refrain from mentioning the word ‘blockchain’ on our website or other communications – even in sales pitches to prevent technical confusion.</p>\n<p>However, since the beginning of 2022, there has been a wave of Web3 coverage, boosting awareness and education of deeptech amongst the general public. We then knew that this was the right time to start marketing the blockchain aspect of our business more, which led us to include more mentions of our Web3 stack in communications.</p>\n<p>Remember that this communications strategy has to be applied to all brand touchpoints, from the website to social media, onboarding emails, speaker presentations, press releases, and offline collaterals like sales brochures and banners.</p>\n<h2>Trust your intuition and do anything</h2>\n<p>A phrase that I love and stick by is from the book <em>Selling the Invisible</em> by Harry Beckwith. He advised a consultant who was contemplating between different marketing projects. He printed a badge with two words: Do Anything.</p>\n<p>Never forget about the butterfly effect: small efforts will accumulate and have distant, huge effects on your brand and product. That’s why you should not turn down any speaker invitations your spokespersons are invited to.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/web3-marketing-building-a-cult-like-community-20220627/\">Web3 marketing: Building a cult-like community</a></strong></p>\n<p>We started with university sharings, and now our spokespersons have been guest speakers or contributors for reports from the <a rel=\"follow\" href=\"https://eurocham.org.sg/event/webinar-covid-19-vaccination-facts-and-fiction/\">European Chamber of Commerce</a> and some of the largest tech events in Singapore and Asia.</p>\n<p>Turn these panels into content pieces and repurpose them as opinion articles to be pitched to the media. Publish any media coverage you’ve obtained on your website to assist with SEO. Shout out about notable partners and clients and push for joint press releases with key partners and clients and pitch them to the media.</p>\n<p>Do anything which you think will contribute to your master goal, but never at the expense of your brand’s reputation. Marketing is both an art and a science, a role that comprises intuition, creativity, and analytics. Examine your data and continue reiterating your initiatives to create the best tactics for your business.</p>\n<h2>Final thoughts</h2>\n<p>Remember that clients don’t remember what your product’s functions are, but rather, what problems it solves for them and how your product makes them feel.</p>\n<p>Brand trust is the ultimate currency. Understand your goal, strategise, and execute your initiatives, but most important of all, remain personal in your communications.</p>\n<p>Don’t be afraid to try and fail – it’s important to be an adventurer and risk-taker in the early stages of your company’s journey.</p>\n<p>That’s the beauty of marketing – you will always learn something new each day, so take that opportunity to build your brand into an ownable asset for your company.</p>\n<p>&#8211;</p>\n<p>Join us at the Jakarta stop of the <a rel=\"follow\" href=\"https://docs.google.com/forms/d/e/1FAIpQLSeMClsFOBSPfUDI6SLUXVq3o7VQaLZQlk5Hop0VSXwkNjLPng/viewform\">Big Leap roadshow</a></p>\n<p>Editor’s note: <b >e27</b> aims to foster thought leadership by publishing views from the community. Share your opinion by <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://e27.co/contributor\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://e27.co/contributor\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">submitting</a> an article, video, podcast, or infographic</p>\n<p>Join our <b >e27</b> <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://t.me/joinchat/HmTbfBcGCZeykhM8NOlQ-g\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://t.me/joinchat/HmTbfBcGCZeykhM8NOlQ-g\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">Telegram group</a>, <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://www.facebook.com/groups/e27co/permalink/886904662065955/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.facebook.com/groups/e27co/permalink/886904662065955/\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">FB community</a>, or like the <b >e27</b> <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://www.facebook.com/e27/?ref=your_pages\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.facebook.com/e27/?ref=your_pages\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">Facebook page</a></p>\n<p>Image credit: 123rf-<a class=\"ImageDetails__information--link\" rel=\"follow\" href=\"https://www.123rf.com/profile_ismagilov\">ismagilov</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/the-top-4-lessons-ive-learned-building-accredify-a-deep-tech-brand-from-scratch-20221030/\">Top 4 lessons I’ve learned building a deeptech brand from scratch</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}