{
  "title": "Chinese Whispers: is China's property market about to go bust?",
  "link": "https://audioboom.com/posts/8126775",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1700,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>China’s property market accounts for something between 20 and 29 per cent of the country’s total GDP. The seemingly never-ending rise of residential blocks were how ordinary people like my family could see and touch China’s miraculous economic growth. Home ownership was to be expected, especially for young men looking to marry and start a family. Across the country, 70 per cent of household wealth is held in real estate.<br>\n<br>\n\n</div>\n<div>But in recent months, China's property hasn’t been so hot. The sector has shrunk 7 per cent year on year. Developers have run out of money to complete complexes that they've already sold; while consumers across dozens of cities are refusing to pay their mortgages in protest.  'The thing about real estate is that it's intensely pro-cyclical – everything that's good feeds on itself in the boom, and everything that's bad feeds on itself in the downturn', the economist George Magnus tells me in this episode of Chinese Whispers. He's the author of  <em>Red Flags: Why Xi's China is in Jeopardy</em> and has been warning about the underlying problems in China's economy for years.<br>\n<br>\n\n</div>\n<div>Also on the podcast is Lulu Chen, a Bloomberg journalist reporting on real estate trends in Asia. She was one of the first to break the story of the mortgage protests.  The picture they paint is one of a long overdue bust in the cycle.<br>\n<br>\n\n</div>\n<div>Back in the 90s when the country was fresh out of communism, most housing was still allocated by the state or employers. Since then, market reforms allowed people to buy and sell their own places (China's home ownership rate is 95 per cent). The market became hotter and hotter, and the proliferation of new builds (in order to keep up with demand) meant that developers were selling homes before they'd even built them. Real estate companies ran on borrowed money.<br>\n<br>\n\n</div>\n<div>All good and well when the money was flowing. But in the last few years, the amount of corporate debt wracked up by this model concerned policymakers in Zhongnanhai, who then put forward the 'three red lines' stipulating debt controls on real estate companies. Evergrande was the first to trip, but since then, even companies thought to be in the green have fallen to an industry-wide contagion of fear and default. Then came the harsh and sudden lockdowns of zero Covid which added fuel to the fire as consumer confidence and earnings were destroyed.<br>\n<br>\n\n</div>\n<div>Tune in to hear about just how bad the situation is this time (as I suggest to George, haven't warnings sounded about China's property bubble for years now?) But remember, economic problems can quickly turn into political ones for a government that bargains for legitimacy from economic growth. I ask Lulu what the ramifications of a property bust that makes the middle class poorer could be. She sums up the stakes nicely:<br>\n<br>\n\n</div>\n<blockquote>'[The Chinese] have this idea of the world and what it’s like. Life is always going upwards, and tomorrow is going to be better than yesterday. And that’s kind of the mentality of people born in the 70s, especially 80s, 90s... They’ve never experienced a full economic cycle… So it really changes their world view of what life is going to be like for them in the future. It really casts doubt on whether the economy and the future of the country is going to as they envisioned when they were growing up’</blockquote><div>That's why this moment is one to watch.</div>\n",
  "pubDate": "Mon, 25 Jul 2022 11:20:44 +0000",
  "guid": "tag:audioboom.com,2022-07-25:/posts/8126775",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}