{
  "id": "https://bibleinoneyear.org/en/youth/145",
  "title": "Day 145: How to Face Giant Problems",
  "description": "Psalm 67:1–7, 1 Samuel 16:7, 17:4-37, John 15:1–27. There are two possible attitudes when facing a giant  One is to say, ‘It’s so big, there’s nothing I can do",
  "pubDate": "Tue, 25 May 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/145/?ignore",
  "itunes:duration": "15:38",
  "guid": "enyouth25052021-145",
  "length": 938.84,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 145: How to Face Giant Problems",
  "itunes:subtitle": "Psalm 67:1–7, 1 Samuel 16:7, 17:4-37, John 15:1–27. There are two possible attitudes when facing a giant  One is to say, ‘It’s so big, there’s nothing I can do",
  "itunes:summary": "Goliath was a giant. He was 9 feet tall, a champion, wearing heavy armour, standing and shouting, defying the people of God (1 Samuel 17:1–11). As well as physical giants, there are metaphorical ones. A ‘giant’ is a big, seemingly insurmountable problem or issue.\n\n\n‘Personal giants’ could include giant personal challenges in relation to your health, marriage, family, relationships or lack of relationships, job or lack of job, other work issues, or some sin, temptation, addiction, fear, loneliness, discouragement or debt.\n\n\n‘National giants’ in the UK include terrorism, racism, gang violence, homelessness, the breakdown of marriage, family life and community. There is therefore the giant task of evangelising the country, revitalising the church and transforming our society.\n\n\n‘Global giants’ include war, climate change, pandemics, extreme poverty (as a result of which thousands of children die each day), preventable disease (millions dying of diseases for which we have a relatively easy cure), the need for universal primary education (almost one billion people unable to read) and the need for worldwide water sanitation (which could be funded by the amount of money that Europeans spend on ice-cream every year).\n\n\nThere are two possible attitudes when facing a giant. One is to say, ‘It’s so big, there’s nothing I can do.’ The other is to say, ‘It’s so big, I can’t miss!’",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 145
}