{
  "title": "Dynamical quantum ergodicity from energy level statistics. (arXiv:2205.05704v2 [quant-ph] UPDATED)",
  "link": "http://arxiv.org/abs/2205.05704",
  "description": "<p>Ergodic theory provides a rigorous mathematical description of classical\ndynamical systems including a formal definition of the ergodic hierarchy.\nClosely related to this hierarchy is a less-known notion of cyclic approximate\nperiodic transformations [see, e.g., I. Cornfield, S. Fomin, and Y. Sinai,\nErgodic theory (Springer-Verlag New York, 1982)], which maps any \"ergodic\"\ndynamical system to a cyclic permutation on a circle and arguably represents\nthe most elementary notion of ergodicity. This paper shows that cyclic\nergodicity generalizes to quantum dynamical systems, and this generalization is\nproposed here as the basic rigorous definition of quantum ergodicity. It\nimplies the ability to construct an orthonormal basis, where quantum dynamics\ntransports an initial basis vector to all other basis vectors one by one, while\nmaintaining a sufficiently large overlap between the time-evolved initial state\nand a given basis state. It is proven that the basis, maximizing the overlap\nover all cyclic permutations, is obtained via the discrete Fourier transform of\nthe energy eigenstates. This relates quantum cyclic ergodicity to level\nstatistics. We then show that the near-universal Wigner-Dyson level statistics\nimplies quantum cyclic ergodicity, but the reverse is not necessarily true. For\nthe latter, we study irrational flows on a 2D torus and prove that both the\nclassical and quantum flows are cyclic ergodic. However, the corresponding\nlevel statistics is neither Wigner-Dyson nor Poisson. Finally, we use the\ncyclic construction to motivate a quantum ergodic hierarchy of operators and\nargue that under the additional assumption of Poincare recurrences, cyclic\nergodicity is a necessary condition for such operators to satisfy the\neigenstate thermalization hypothesis. This work provides a general framework\nfor transplanting some rigorous concepts of ergodic theory to quantum dynamical\nsystems.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/quant-ph/1/au:+Vikram_A/0/1/0/all/0/1\">Amit Vikram</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Galitski_V/0/1/0/all/0/1\">Victor Galitski</a>"
}