{
  "title": "Analysis of a Deep Learning Model for 12-Lead ECG Classification Reveals Learned Features Similar to Diagnostic Criteria. (arXiv:2211.01738v1 [eess.SP])",
  "link": "http://arxiv.org/abs/2211.01738",
  "description": "<p>Despite their remarkable performance, deep neural networks remain unadopted\nin clinical practice, which is considered to be partially due to their lack in\nexplainability. In this work, we apply attribution methods to a pre-trained\ndeep neural network (DNN) for 12-lead electrocardiography classification to\nopen this \"black box\" and understand the relationship between model prediction\nand learned features. We classify data from a public data set and the\nattribution methods assign a \"relevance score\" to each sample of the classified\nsignals. This allows analyzing what the network learned during training, for\nwhich we propose quantitative methods: average relevance scores over a)\nclasses, b) leads, and c) average beats. The analyses of relevance scores for\natrial fibrillation (AF) and left bundle branch block (LBBB) compared to\nhealthy controls show that their mean values a) increase with higher\nclassification probability and correspond to false classifications when around\nzero, and b) correspond to clinical recommendations regarding which lead to\nconsider. Furthermore, c) visible P-waves and concordant T-waves result in\nclearly negative relevance scores in AF and LBBB classification, respectively.\nIn summary, our analysis suggests that the DNN learned features similar to\ncardiology textbook knowledge.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/eess/1/au:+Bender_T/0/1/0/all/0/1\">Theresa Bender</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Beinecke_J/0/1/0/all/0/1\">Jacqueline Michelle Beinecke</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Krefting_D/0/1/0/all/0/1\">Dagmar Krefting</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Muller_C/0/1/0/all/0/1\">Carolin M&#xfc;ller</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Dathe_H/0/1/0/all/0/1\">Henning Dathe</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Seidler_T/0/1/0/all/0/1\">Tim Seidler</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Spicher_N/0/1/0/all/0/1\">Nicolai Spicher</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Hauschild_A/0/1/0/all/0/1\">Anne-Christin Hauschild</a>"
}