{
  "title": "Fellow Travelers and Killer Robots, with Kelsey Atherton and Andrew Leber",
  "description": "<p>This week I’m joined by Andrew Leber from Harvard's Department of Government and defense technology journalist Kelsey Atherton to talk about a new briefing book produced by their excellent <a target=\"_blank\" href=\"https://fellowtravelersblog.com/\">Fellow Travelers Blog</a>. The book compiles several <a target=\"_blank\" href=\"https://fellowtravelersblog.com/category/articles/policy-brief-2020/\">policy briefs</a> commissioned by FTB over the past several months and is intended to provide some substance for progressive members of Congress looking to steer US foreign policy in a more progressive direction. Toward that end, they’ve started a GoFundMe to support publication and distribution costs, and if you’re able to help out in that regard please <a target=\"_blank\" href=\"https://www.gofundme.com/f/help-publish-ftbs-foreignpolicy-briefing-book\">do so</a>.</p><p>Because I can’t have Kelsey on without talking at least a little bit about drones, we spend a few minutes toward the end of our discussion on recent and somewhat sketchy <a target=\"_blank\" href=\"https://www.nytimes.com/2021/06/03/world/africa/libya-drone.html\">reports</a> of <a target=\"_blank\" href=\"https://www.popsci.com/technology/autonomous-machines-mistakes-un-institute-report/\">autonomous drones</a> targeting fighters in Libya and the still nascent <a target=\"_blank\" href=\"https://www.worldpoliticsreview.com/articles/29723/a-killer-robots-treaty-ban-just-got-a-boost\">movement</a> to craft some international rules of the road about the use of weapons platforms that don’t necessarily require human intervention. We’ll also discuss the <a target=\"_blank\" href=\"https://www.al-monitor.com/originals/2021/06/will-washington-buy-ankaras-drone-crescent-against-russia\">proliferation</a> of relatively inexpensive mid-level drones (or in Kelsey’s words “the Honda Civic of drones”) and what it suggests about the future of warfare.</p><p>You can find <a target=\"_blank\" href=\"https://twitter.com/AndrewMLeber\">Andrew</a> and <a target=\"_blank\" href=\"https://twitter.com/AthertonKD\">Kelsey</a> on Twitter, and I highly recommend checking out Kelsey’s own Substack, <em>Wars of Future Past</em>.</p> <br/><br/>This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit <a href=\"https://fx.substack.com/subscribe?utm_medium=podcast&utm_campaign=CTA_2\">fx.substack.com/subscribe</a>",
  "link": "https://fx.substack.com/p/fellow-travelers-and-killer-robots",
  "guid": "substack:post:37947586",
  "dc:creator": "Derek Davison",
  "pubDate": "Wed, 23 Jun 2021 17:28:05 GMT",
  "enclosure": "",
  "itunes:author": "Derek Davison",
  "itunes:explicit": "No",
  "itunes:duration": 4679,
  "itunes:image": ""
}