{
  "title": "France is ‘changing gear’ on migrant issues – minister",
  "link": "https://www.rt.com/news/565821-france-new-immigration-law/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565821-france-new-immigration-law/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63628c9185f54002072c3a8d.jpg\" /> The French government will draft a tough immigration bill making it easier to deport foreign criminals, the interior minister told Le Monde <br/><a href=\"https://www.rt.com/news/565821-france-new-immigration-law/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>After the murder of a 12-year-old girl, the French government says it seeks a new immigration bill that will be “hardline”</strong></p>\n            \n                        \n            <p>France will introduce tough immigration legislation next year, making it easier to deport foreign criminals, Interior Minister Gerald Darmanin told Le Monde on Wednesday. Under pressure from the right, Paris is <em>&ldquo;changing gear,&rdquo;</em> Darmanin said.</p>\n<p>The bill will be debated in parliament in early 2023. While its specific provisions remain to be hammered out, the minister said that it will allow the police and courts to punish criminal aliens more effectively, while making it easier for legal immigrants to obtain work permits to shore up the country&rsquo;s labor demand.</p>\n<p>One of its measures, Darmanin explained, will strip away three-quarters of the existing grounds for illegal immigrants to appeal deportation orders. The government will also remove access to social services for those set to be deported, remove rules barring long-term residents from deportation, and force the local authorities to act on expulsion orders.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.09/thumbnail/632761fd20302740ed7d1b85.jpg\" alt=\"Migrant encampment in Calais, France\" />\n            <figcaption><a href=\"https://www.rt.com/news/563059-macron-migrants-resettle-rural-decline/\">Migrants can reverse French rural de-population – Macron</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>According to Le Monde, France issued 122,000 expulsion orders in 2021 but only enforced 3,200 in the last two years. Although foreigners make up 7% of the French population, they are responsible for 19% of crimes, according to figures cited by both Darmanin and French President Emmanuel Macron. In Paris, foreigners are responsible for half of all crimes.</p>\n<p>While pro-migrant activists say that many of these crimes are trivial, the latest push to tighten up immigration law comes after the body of a 12-year-old girl was found in a suitcase in Paris with her throat cut last month. The suspect, charged with raping and murdering the schoolgirl, is an Algerian woman who had been issued a deportation order two months previously.</p>\n<p>With right-wing politician Eric Zemmour describing the murder as <em>&ldquo;Francocide&rdquo;</em> and National Rally leader Marine Le Pen demanding that the government stop <em>&ldquo;out-of-control illegal immigration,&rdquo;</em> Darmanin said that by tackling the problem, he would seek to deny the right<em> &ldquo;political fuel.&rdquo;</em></p>\n<p><em>&ldquo;It is up to us to enact the strong &ndash; sometimes even hardline &ndash; measures that the French want or need, otherwise others will do it for us,&rdquo;</em> he added.</p>\n<p>Macron has long been pressed by the right to harden his immigration policies, as migrant camps became a&nbsp;<a href=\"https://www.rt.com/news/428486-paris-rich-against-migrant-camp/\">familiar</a><a href=\"https://www.rt.com/news/530628-paris-homeless-migrant-camp/\" target=\"_blank\" rel=\"noopener noreferrer\"> sight</a> on Paris streets under his leadership. Macron has failed to live up to his 2019 promise to execute 100% of all deportation orders, but now&nbsp;<a href=\"https://www.lemonde.fr/en/politics/article/2022/10/27/macron-wants-tougher-rules-for-the-most-dangerous-foreigners_6001960_5.html\" target=\"_blank\" rel=\"noopener noreferrer\">insists</a> that he will focus on removing<em> &ldquo;the most dangerous&rdquo;</em> criminal foreigners.</p>",
  "enclosure": "",
  "pubDate": "Wed, 02 Nov 2022 16:55:26 +0000",
  "dc:creator": "RT"
}