{
  "title": "69: Lisa Smartt- Words at the Threshold: What LAST Words Reveal About Life, Death & Consciousness",
  "pubDate": "Fri, 10 Mar 2017 17:42:40 +0000",
  "guid": "b4481c149ca0afe23e2b53410c777c34",
  "link": "https://lifeonpurpose.libsyn.com/69-lisa-smartt-words-at-the-threshold-what-last-words-reveal-about-life-death-consciousness",
  "itunes:image": "",
  "description": "<p><em>Do you believe in life after death? Does consciousness exist outside our bodies? Does the language of the dying points the way to a transcendent world beyond our own?</em><br /> <br /> For this special <strong>Soul Series</strong> episode of <strong>Life on Purpose</strong>, my guest is author, linguist, educator, and poet <strong>Lisa Smartt</strong> who founded t<strong>he Final Words Project</strong>, an ongoing study devoted to collecting and interpreting the mysterious language at the end of lives.<br /> <br /> <strong>Lisa</strong> joined me for an inspiring conversation about her new book, <em>Words at the Threshold: What We Say as We’re Nearing Death</em> (New World Library), in which she decodes the symbolism of those last words, showing how the language of the dying points the way to a transcendent world beyond our own.<br /> <br /> She shares the compelling language she has heard and the coherency that emerges in even the most puzzling phrases. She also provides tools for more meaningful communication with loved ones who are at the end of life. And we discuss her work with <strong>Dr. Raymond Moody</strong>, the pioneering researcher who coined the term Near Death Experience (NDE) in the 1970s.<br /> <br /> <em>“Words at the Threshold marks a new era in the understanding of the process of dying. Lisa Smartt’s work has profound psychological, spiritual, and clinical implications for the care of terminally ill patients and their families. And I believe that her work also opens unexplored pathways for the genuinely rational investigation of human kind’s deepest mystery: the prospect of life after death.”</em><br /> — from the foreword by <strong>Raymond Moody Jr., MD, PhD</strong>, author of <em>Life After Life</em><br /> <br /> About: <strong>Lisa Smartt, MA</strong>, is a linguist, educator, and poet. She is the author of <em>Words at the Threshold: What We Say When We’re Nearing Death</em> (New World Library 2017). The book is based on data collected through The Final Words Project, <a href=\"wwwfinalwordsproject.org\" target= \"_blank\">wwwfinalwordsproject.org</a>, an ongoing study devoted to gathering and interpreting the mysterious language at end of life. She has worked closely with Raymond Moody, guided by his research into language, particularly unintelligible speech. They have co-facilitated presentations about language and consciousness at universities, hospices and conferences.<br /> <br /> About <strong>Words at the Threshold</strong>: A person’s last words can often be enigmatic, confusing or powerfully meaningful; they can also offer tantalizing clues about the ultimate fate of the human soul. Until now, no author has systematically studied end-of-life communication by collecting and analyzing the final utterances of the terminally ill. When her father faced his final weeks, linguist <strong>Lisa Smartt</strong> began transcribing his conversations and noticed that both his language and personality underwent inexplicable changes.</p> <p><strong>Smartt’s</strong> father, a skeptical man with a secular worldview, developed a deeply spiritual outlook in his final days — a change reflected in his last words. Baffled and intrigued, <strong>Smartt</strong> began to investigate the near-death utterances of others, collecting over a hundred case studies with interviews and transcripts. In Words at the Threshold, Smartt decodes the symbolism of those last words, showing how the language of the dying points the way to a transcendent world beyond our own​<br /> <br /> To learn more about <strong>Lisa's</strong> work, visit: <a href= \"http://www.finalwordsproject.org/\" target= \"_blank\">http://www.finalwordsproject.org/</a>.</p>",
  "content:encoded": "<p><em>Do you believe in life after death? Does consciousness exist outside our bodies? Does the language of the dying points the way to a transcendent world beyond our own?</em>  For this special Soul Series episode of Life on Purpose, my guest is author, linguist, educator, and poet Lisa Smartt who founded the Final Words Project, an ongoing study devoted to collecting and interpreting the mysterious language at the end of lives.  Lisa joined me for an inspiring conversation about her new book, <em>Words at the Threshold: What We Say as We’re Nearing Death</em> (New World Library), in which she decodes the symbolism of those last words, showing how the language of the dying points the way to a transcendent world beyond our own.  She shares the compelling language she has heard and the coherency that emerges in even the most puzzling phrases. She also provides tools for more meaningful communication with loved ones who are at the end of life. And we discuss her work with Dr. Raymond Moody, the pioneering researcher who coined the term Near Death Experience (NDE) in the 1970s.  <em>“Words at the Threshold marks a new era in the understanding of the process of dying. Lisa Smartt’s work has profound psychological, spiritual, and clinical implications for the care of terminally ill patients and their families. And I believe that her work also opens unexplored pathways for the genuinely rational investigation of human kind’s deepest mystery: the prospect of life after death.”</em> — from the foreword by Raymond Moody Jr., MD, PhD, author of <em>Life After Life</em>  About: Lisa Smartt, MA, is a linguist, educator, and poet. She is the author of <em>Words at the Threshold: What We Say When We’re Nearing Death</em> (New World Library 2017). The book is based on data collected through The Final Words Project, <a href=\"wwwfinalwordsproject.org\" target= \"_blank\">wwwfinalwordsproject.org</a>, an ongoing study devoted to gathering and interpreting the mysterious language at end of life. She has worked closely with Raymond Moody, guided by his research into language, particularly unintelligible speech. They have co-facilitated presentations about language and consciousness at universities, hospices and conferences.  About Words at the Threshold: A person’s last words can often be enigmatic, confusing or powerfully meaningful; they can also offer tantalizing clues about the ultimate fate of the human soul. Until now, no author has systematically studied end-of-life communication by collecting and analyzing the final utterances of the terminally ill. When her father faced his final weeks, linguist Lisa Smartt began transcribing his conversations and noticed that both his language and personality underwent inexplicable changes.</p> <p>Smartt’s father, a skeptical man with a secular worldview, developed a deeply spiritual outlook in his final days — a change reflected in his last words. Baffled and intrigued, Smartt began to investigate the near-death utterances of others, collecting over a hundred case studies with interviews and transcripts. In Words at the Threshold, Smartt decodes the symbolism of those last words, showing how the language of the dying points the way to a transcendent world beyond our own​  To learn more about Lisa's work, visit: <a href= \"http://www.finalwordsproject.org/\" target= \"_blank\">http://www.finalwordsproject.org/</a>.</p>",
  "enclosure": "",
  "itunes:duration": "57:51",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Do you believe in life after death? Does consciousness exist outside our bodies? Does the language of the dying points the way to a transcendent world beyond our own?  For this special Soul Series episode of Life on Purpose, my guest is author,..."
}