{
  "guid": "273aeade-8f31-4793-ab5a-0889b11c4914",
  "title": "The Debate Channel",
  "description": "<p>The election to fill two school board seats takes center stage—and becomes a referendum on the school district’s diversity plan. At a secretly recorded meeting, members of Southlake Families PAC grill a prospective candidate about conservative political causes, from opposition to Black Lives Matter to abortion. As school board candidates debate whether Carroll's code of conduct is enough to protect students, a queer 16-year-old takes a complaint of harassment to Carroll Senior High School’s principal — and the response leaves her feeling even less safe at school. In the final days before the election, candidates knock on doors, and outgoing Mayor Laura Hill gives a speech calling opponents of the diversity plan to action.</p>\n",
  "pubDate": "Mon, 20 Sep 2021 08:00:00 +0000",
  "author": "news.podcasts@nbcuni.com (Mike Hixenbaugh, Antonia Hylton)",
  "link": "https://www.nbcnews.com/southlake-podcast",
  "content:encoded": "<p>The election to fill two school board seats takes center stage—and becomes a referendum on the school district’s diversity plan. At a secretly recorded meeting, members of Southlake Families PAC grill a prospective candidate about conservative political causes, from opposition to Black Lives Matter to abortion. As school board candidates debate whether Carroll's code of conduct is enough to protect students, a queer 16-year-old takes a complaint of harassment to Carroll Senior High School’s principal — and the response leaves her feeling even less safe at school. In the final days before the election, candidates knock on doors, and outgoing Mayor Laura Hill gives a speech calling opponents of the diversity plan to action.</p>\n",
  "enclosure": "",
  "itunes:title": "The Debate Channel",
  "itunes:author": "Mike Hixenbaugh, Antonia Hylton",
  "itunes:duration": "00:42:25",
  "itunes:summary": "As school board candidates debate Southlake’s future, a queer 16-year-old faces off with her principal over his handling of a harassment complaint.",
  "itunes:subtitle": "As school board candidates debate Southlake’s future, a queer 16-year-old faces off with her principal over his handling of a harassment complaint.",
  "itunes:keywords": "misgender, partisan, councilman, secret recording, queer student, high school, carroll, racist, council, southlake, blm, bullying, texas gop, diversity training, football, racism, left-wing ideology, administrator, crt, gop, education public school, bully, student, queer, candidate, propaganda, debate, antiracist, diversity and inclusion training, nbc, fort worth, segregation, donations, school district, duhon, allen west, complaint, south lake, nbc news, conservative, political action committee, critical race theory, pac, texas, dallas, safety, slurs, school board, reverse racism, inclusion, suburb, cisd, marine, classroom, culture war, teacher, cancel culture, donation, diversity plan, carroll high school, training, school board member, dana loesch, politics, learning, gsa, high school football, shawn duhon, election, campaign, dei, forum, anti-racist, race, lgbtq, black lives matter, trump, hannah smith",
  "itunes:explicit": "yes",
  "itunes:episodeType": "full",
  "itunes:episode": 5,
  "itunes:season": 1
}