{
  "guid": "802e8072be53291c858ac27e21d93e4f",
  "title": "The Orbiting Human Circus (of the Air): Season One, Episode 2 (The Cricket)",
  "pubDate": "Wed, 26 Oct 2016 04:00:00 -0000",
  "link": "https://beta.prx.org/stories/229593",
  "description": "<p>Hear Mandy Patinkin perform an extraordinary musicological demonstration and a cricket (Tim Robbins) spin the spellbinding tale of Ladislas Koskovsky. Plus, learn the remarkable history of Julian the janitor's famous great-grandfather.</p>\n\n<p>(NOTE: To continue listening to <em>The Orbiting Human Circus (of the Air)</em>, subscribe now via <a href=\"https://itunes.apple.com/us/podcast/orbiting-human-circus-air/id1158759190\" rel=\"nofollow\" target=\"_blank\">iTunes</a>, <a href=\"http://orbitinghumancircus.libsyn.com/\" rel=\"nofollow\" target=\"_blank\">Libsyn</a>, <a href=\"http://www.stitcher.com/podcast/night-vale-presents/the-orbiting-human-circus-of-the-air\" rel=\"nofollow\" target=\"_blank\">Stitcher</a>, or <a href=\"http://orbitinghumancircus.libsyn.com/rss\" rel=\"nofollow\" target=\"_blank\">via RSS</a> on your favorite podcatcher.)</p>\n\n<p>Thanks to Audible and Atom Tickets for supporting the show! Get a free audiobook with a 30 day free trial at <a href=\"http://www.audible.com/ohc\" rel=\"nofollow\" target=\"_blank\">audible.com/OHC</a>. Download the free Atom Tickets app from Google Play or the Apple App Store and use code OHC for $5 off.</p>\n\n<p>In November 2016, the janitor will be cleaning a venue near you! Upcoming tour dates: <a href=\"http://www.orbitinghumancircus.com\" rel=\"nofollow\" target=\"_blank\">www.orbitinghumancircus.com</a></p>\n\n<p>Featuring John Cameron Mitchell as Mr. Cameron, Julian Koster as the Janitor, and Drew Callander as the Narrator, with Tim Robbins as the Cricket and Mandy Patinkin as Cantor Moishe Lebowitz. </p>\n\n<p>Written and created by Julian Koster. Co-directed by and developed with Ellie Heyman. Produced by Christy Gressman. Featuring musical composition and arrangement by Thomas Hughes and music by The Music Tapes. </p>\n\n<p>Full credits: <a href=\"http://www.orbitinghumancircus.com/\" rel=\"nofollow\" target=\"_blank\">www.orbitinghumancircus.com</a></p>\n\n<p>Part of the Night Vale Presents network: <a href=\"http://www.nightvalepresents.com/\" rel=\"nofollow\" target=\"_blank\">www.nightvalepresents.com</a></p>",
  "enclosure": "",
  "itunes:subtitle": "Hear Mandy Patinkin perform an extraordinary musicological demonstration and a cricket (Tim Robbins) spin the spellbinding tale of Ladislas Koskovsky. Plus, learn the remarkable history of Julian the janitor's famous great-grandfather. (NOTE: To...",
  "itunes:episodeType": "full",
  "itunes:duration": "32:32"
}