{
  "id": "tag:blogger.com,1999:blog-8474926331452026626.post-3533757912595814663",
  "published": "2022-08-31T10:03:00.001-07:00",
  "updated": "2022-10-21T06:31:27.116-07:00",
  "category": [
    "",
    "",
    "",
    ""
  ],
  "title": "Announcing the Patent Phrase Similarity Dataset",
  "content": "<span class=\"byline-author\">Posted Grigor Aslanyan, Software Engineer, Google</span> <p>Patent documents typically use legal and highly technical language, with context-dependent terms that may have meanings quite different from colloquial usage and even between different documents. The process of using <a href=\"https://www.sciencedirect.com/science/article/pii/S017221901630103X\">traditional patent search methods</a> (e.g., keyword searching) to search through the corpus of over one hundred million patent documents can be tedious and result in many missed results due to the broad and non-standard language used. For example, a \"soccer ball\" may be described as a \"spherical recreation device\", \"inflatable sportsball\" or \"ball for ball game\". Additionally, the language used in some patent documents may obfuscate terms to their advantage, so more powerful <a href=\"https://en.wikipedia.org/wiki/Natural_language_processing\">natural language processing</a> (NLP) and <a href=\"https://en.wikipedia.org/wiki/Semantic_similarity\">semantic similarity</a> understanding can give everyone access to do a thorough search.  </p><a name='more'></a>   <p>The patent domain (and more general technical literature like scientific publications) poses unique challenges for NLP modeling due to its use of legal and technical terms. While there are multiple commonly used general-purpose <a href=\"https://ai.googleblog.com/2018/05/advances-in-semantic-textual-similarity.html\">semantic textual similarity</a> (STS) benchmark datasets (e.g., <a href=\"https://ixa2.si.ehu.eus/stswiki/index.php/STSbenchmark\">STS-B</a>, <a href=\"https://marcobaroni.org/composes/sick.html\">SICK</a>, <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=52398\">MRPC</a>, <a href=\"https://github.com/cocoxu/SemEval-PIT2015\">PIT</a>), to the best of our knowledge, there are currently no datasets focused on technical concepts found in patents and scientific publications (the somewhat related <a href=\"http://bioasq.org/\">BioASQ challenge</a> contains a biomedical question answering task). Moreover, with the continuing <a href=\"https://patents.google.com/coverage\">growth in size of the patent corpus</a> (millions of new patents are issued worldwide every year), there is a need to develop more useful NLP models for this domain.  </p>   <p>Today, we announce the release of the <a href=\"https://www.kaggle.com/datasets/google/google-patent-phrase-similarity-dataset\">Patent Phrase Similarity</a> dataset, a new human-rated contextual phrase-to-phrase semantic matching dataset, and the accompanying <a href=\"https://arxiv.org/pdf/2208.01171.pdf\">paper</a>, presented at the <a href=\"http://ifs.tuwien.ac.at/patentsemtech/index.html\">SIGIR PatentSemTech Workshop</a>, which focuses on technical terms from patents. The Patent Phrase Similarity dataset contains ~50,000 rated phrase pairs, each with a <a href=\"https://worldwide.espacenet.com/classification?locale=en_EP\">Cooperative Patent Classification</a> (CPC) class as context. In addition to similarity scores that are typically included in other benchmark datasets, we include granular rating classes similar to <a href=\"https://wordnet.princeton.edu/\">WordNet</a>, such as synonym, antonym, <a href=\"https://en.wikipedia.org/wiki/Hyponymy_and_hypernymy#Hyponyms_and_hypernyms\">hypernym</a>, <a href=\"https://en.wikipedia.org/wiki/Hyponymy_and_hypernymy#Hyponyms_and_hypernyms\">hyponym</a>, <a href=\"https://en.wikipedia.org/wiki/Meronymy_and_holonymy\">holonym</a>, <a href=\"https://en.wikipedia.org/wiki/Meronymy_and_holonymy\">meronym</a>, and domain related. This dataset (distributed under the <a href=\"https://creativecommons.org/licenses/by/4.0/\">Creative Commons Attribution 4.0 International license</a>) was used by <a href=\"https://www.kaggle.com/\">Kaggle</a> and <a href=\"https://www.uspto.gov/\">USPTO</a> as the benchmark dataset in the <a href=\"https://www.kaggle.com/c/us-patent-phrase-to-phrase-matching\">U.S. Patent Phrase to Phrase Matching</a> competition to draw more attention to the performance of machine learning models on technical text. Initial results show that models fine-tuned on this new dataset perform substantially better than general pre-trained models without fine-tuning. </p>   <p><b>The Patent Phrase Similarity Dataset</b><br>To better train the next generation of state-of-the-art models, we created the Patent Phrase Similarity dataset, which includes many examples to address the following problems: (1) phrase disambiguation, (2) adversarial keyword matching, and (3) hard negative keywords (i.e., keywords that are unrelated but received a high score for similarity from other models ). Some keywords and phrases can have multiple meanings (e.g., the phrase \"mouse\" may refer to an animal or a computer input device), so we disambiguate the phrases by including CPC classes with each pair of phrases. Also, many NLP models (e.g., <a href=\"https://en.wikipedia.org/wiki/Bag-of-words_model\">bag of words models)</a> will not do well on data with phrases that have matching keywords but are otherwise unrelated (adversarial keywords, e.g., “container section” → “kitchen container”, “offset table” → “table fan”). The Patent Phrase Similarity dataset is designed to include many examples of matching keywords that are unrelated through adversarial keyword match, enabling NLP models to improve their performance.   </p>   <p>Each entry in the Patent Phrase Similarity dataset contains two phrases, an anchor and target, a context CPC class, a rating class, and a similarity score. The dataset contains 48,548 entries with 973 unique anchors, split into training (75%), validation (5%), and test (20%) sets. When splitting the data, all of the entries with the same anchor are kept together in the same set. There are 106 different context CPC classes and all of them are represented in the training set.  </p>    <table align=\"center\" style=\"margin-left: auto; margin-right: auto; text-align: center; font-size: small; width: 90%;\">  <tr>   <td><b>Anchor</b>   </td>   <td><b>Target</b>   </td>   <td><b>Context</b>   </td>   <td><b>Rating</b>   </td>   <td><b>Score</b>   </td>  </tr>  <tr>   <td>acid absorption    </td>   <td>absorption of acid    </td>   <td>B08    </td>   <td>exact    </td>   <td>1.0    </td>  </tr>  <tr>   <td>acid absorption    </td>   <td>acid immersion    </td>   <td>B08    </td>   <td>synonym    </td>   <td>0.75    </td>  </tr>  <tr>   <td>acid absorption    </td>   <td>chemically soaked    </td>   <td>B08    </td>   <td>domain related    </td>   <td>0.25    </td>  </tr>  <tr>   <td>acid absorption    </td>   <td>acid reflux    </td>   <td>B08    </td>   <td>not related    </td>   <td>0.0    </td>  </tr>  <tr>   <td>gasoline blend    </td>   <td>petrol blend    </td>   <td>C10    </td>   <td>synonym    </td>   <td>0.75    </td>  </tr>  <tr>   <td>gasoline blend    </td>   <td>fuel blend    </td>   <td>C10    </td>   <td>hypernym    </td>   <td>0.5    </td>  </tr>  <tr>   <td>gasoline blend    </td>   <td>fruit blend    </td>   <td>C10    </td>   <td>not related    </td>   <td>0.0    </td>  </tr>  <tr>   <td>faucet assembly    </td>   <td>water tap    </td>   <td>A22    </td>   <td>hyponym    </td>   <td>0.5    </td>  </tr>  <tr>   <td>faucet assembly    </td>   <td>water supply    </td>   <td>A22    </td>   <td>holonym    </td>   <td>0.25    </td>  </tr>  <tr>   <td>faucet assembly    </td>   <td>school assembly    </td>   <td>A22    </td>   <td>not related    </td>   <td>0.0    </td>  </tr></table> <table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto; text-align: center;\"><tbody><tr><td class=\"tr-caption\" style=\"text-align: center;\">A small sample of the dataset with anchor and target phrases, context CPC class (B08: Cleaning, C10: Petroleum, gas, fuel, lubricants, A22: Butchering, processing meat/poultry/fish), a rating class, and a similarity score. </td></tr></tbody></table>     <p><b>Generating the Dataset</b><br>To generate the Patent Phrase Similarity data, we first process the ~140 million patent documents in the Google Patent's <a href=\"https://patents.google.com/coverage\">corpus</a> and automatically extract important English phrases, which are typically noun phrases (e.g., “fastener”, “lifting assembly”) and functional phrases (e.g., “food processing”, “ink printing”). Next, we filter and keep phrases that appear in at least 100 patents and randomly sample around 1,000 of these filtered phrases, which we call anchor phrases. For each anchor phrase, we find all of the matching patents and all of the CPC classes for those patents. We then randomly sample up to four matching CPC classes, which become the context CPC classes for the specific anchor phrase.  </p>   <p>We use two different methods for pre-generating target phrases: (1) partial matching and (2) a <a href=\"https://ai.googleblog.com/2018/11/open-sourcing-bert-state-of-art-pre.html\">masked language model</a> (MLM). For partial matching, we randomly select phrases from the entire corpus that partially match with the anchor phrase (e.g., “abatement” → “noise abatement”, “material formation” → “formation material”). For MLM, we select sentences from the patents that contain a given anchor phrase, mask them out, and use the <a href=\"https://cloud.google.com/blog/products/ai-machine-learning/how-ai-improves-patent-analysis\">Patent-BERT</a> model to predict candidates for the masked portion of the text. Then, all of the phrases are cleaned up, which includes lowercasing and the removal of punctuation and certain stopwords (e.g., \"and\", \"or\", \"said\"), and sent to expert raters for review. Each phrase pair is rated independently by two raters skilled in the technology area. Each rater also generates new target phrases with different ratings. Specifically, they are asked to generate some low-similarity and unrelated targets that partially match with the original anchor and/or some high-similarity targets. Finally, the raters meet to discuss their ratings and come up with final ratings. </p>   <p><b>Dataset Evaluation</b><br>To evaluate its performance, the Patent Phrase Similarity dataset was used in the <a href=\"https://www.kaggle.com/c/us-patent-phrase-to-phrase-matching\">U.S. Patent Phrase to Phrase Matching Kaggle competition</a>. The competition was very popular, drawing about 2,000 competitors from around the world. A variety of approaches were successfully used by the top scoring teams, including ensemble models of <a href=\"https://ai.googleblog.com/2018/11/open-sourcing-bert-state-of-art-pre.html\">BERT</a> variants and prompting (see the full <a href=\"https://www.kaggle.com/competitions/us-patent-phrase-to-phrase-matching/discussion\">discussion</a> for more details). The table below shows the best results from the competition, as well as several off-the-shelf baselines from our <a href=\"https://arxiv.org/abs/2208.01171\">paper</a>. The <a href=\"https://en.wikipedia.org/wiki/Pearson_correlation_coefficient\">Pearson correlation</a> metric was used to measure the linear correlation between the predicted and true scores, which is a helpful metric to target for downstream models so they can distinguish between different similarity ratings.  </p>   <p>The baselines in the paper can be considered zero-shot in the sense that they use off-the-shelf models without any further fine-tuning on the new dataset (we use these models to embed the anchor and target phrases separately and compute the cosine similarity between them). The Kaggle competition results demonstrate that by using our training data, one can achieve significant improvements compared with existing NLP models. We have also estimated human performance on this task by comparing a single rater’s scores to the combined score of both raters. The results indicate that this is not a particularly easy task, even for human experts. </p>    <table align=\"center\" style=\"margin-left: auto; margin-right: auto; width: 80%;\">  <tr>   <td style=\"text-align: left;\"><b>Model</b>   </td>   <td><b>Training</b>   </td>   <td style=\"text-align: center;\"><b>Pearson correlation</b>   </td>  </tr>  <tr>   <td style=\"text-align: left;\"><a href=\"https://tfhub.dev/google/Wiki-words-250/2\">word2vec</a>   </td>   <td>Zero-shot    </td>   <td style=\"text-align: center;\">0.44    </td>  </tr>  <tr>   <td style=\"text-align: left;\"><a href=\"https://services.google.com/fh/files/blogs/bert_for_patents_white_paper.pdf\">Patent-BERT</a>   </td>   <td>Zero-shot    </td>   <td style=\"text-align: center;\">0.53    </td>  </tr>  <tr>   <td style=\"text-align: left;\"><a href=\"https://www.sbert.net/docs/pretrained_models.html\">Sentence-BERT</a>   </td>   <td>Zero-shot    </td>   <td style=\"text-align: center;\">0.60    </td>  </tr>  <tr>   <td style=\"text-align: left;\">Kaggle 1st place single    </td>   <td>Fine-tuned    </td>   <td style=\"text-align: center;\">0.87    </td>  </tr>  <tr>   <td style=\"text-align: left;\">Kaggle 1st place ensemble    </td>   <td>Fine-tuned    </td>   <td style=\"text-align: center;\">0.88    </td>  </tr>  <tr>   <td style=\"text-align: left;\">Human    </td>   <td>   </td>   <td style=\"text-align: center;\">0.93    </td>  </tr></table> <table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto; text-align: center;\"><tbody><tr><td class=\"tr-caption\" style=\"text-align: center;\">Performance of popular models with no fine-tuning (zero-shot), models fine-tuned on the Patent Phrase Similarity dataset as part of the Kaggle competition, and single human performance. </td></tr></tbody></table>  <p><b>Conclusion and Future Work</b><br>We present the <a href=\"https://www.kaggle.com/datasets/google/google-patent-phrase-similarity-dataset\">Patent Phrase Similarity</a> dataset, which was used as the benchmark dataset in the <a href=\"https://www.kaggle.com/c/us-patent-phrase-to-phrase-matching\">U.S. Patent Phrase to Phrase Matching</a> competition, and demonstrate that by using our training data, one can achieve significant improvements compared with existing NLP models.  </p>   <p>Additional challenging machine learning benchmarks can be generated from the patent corpus, and patent data has made its way into many of today's most-studied models. For example, the <a href=\"https://arxiv.org/pdf/1910.10683v3.pdf\">C4 text dataset</a> used to train <a href=\"https://arxiv.org/pdf/1910.10683v3.pdf\">T5</a> contains <a href=\"https://arxiv.org/abs/2104.08758\">many patent documents</a>. The <a href=\"https://arxiv.org/abs/2007.14062\">BigBird</a> and <a href=\"https://arxiv.org/abs/2112.07916\">LongT5</a> models also use patents via the <a href=\"https://arxiv.org/pdf/1906.03741.pdf\">BIGPATENT dataset</a>. The availability, breadth and open usage terms of full text data (see <a href=\"https://cloud.google.com/blog/topics/public-datasets/google-patents-public-datasets-connecting-public-paid-and-private-patent-data\">Google Patents Public Datasets</a>) makes patents a unique resource for the research community. Possibilities for future tasks include massively multi-label classification, summarization, information retrieval, image-text similarity, citation graph prediction, and translation. See the <a href=\"https://arxiv.org/pdf/2208.01171.pdf\">paper</a> for more details.  </p>   <p><b>Acknowledgements</b><br><i>This work was possible through a collaboration with Kaggle, Satsyil Corp., USPTO, and MaxVal. Thanks to contributors Ian Wetherbee from Google, Will Cukierski and Maggie Demkin from Kaggle. Thanks to Jerry Ma, Scott Beliveau, and Jamie Holcombe from USPTO and Suja Chittamahalingam from MaxVal for their contributions.</i></p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google AI",
    "uri": "http://www.blogger.com/profile/12098626514775266161",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}