{
  "title": "Media identifies major beneficiary of Ukraine crisis",
  "link": "https://www.rt.com/news/566012-us-defense-contractor-ukraine-windfall/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/566012-us-defense-contractor-ukraine-windfall/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63669e992030277a354aef87.jpg\" /> The Ukraine crisis has reportedly triggered $230 billion in new defense spending by EU nations, and US contractors will benefit most <br/><a href=\"https://www.rt.com/news/566012-us-defense-contractor-ukraine-windfall/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>US defense contractors reportedly stand to gain the most from $230 billion in new defense-spending commitments by EU nations</strong></p>\n            \n                        \n            <p>Yahoo News has identified a major beneficiary of the Russia-Ukraine slugfest: the US military industrial complex, which is reaping a windfall even as the bloody conflict causes economic havoc, energy shortages and a looming food crisis around the world.</p>\n<p>As the media outlet <a href=\"https://www.yahoo.com/news/us-weapons-sales-in-europe-are-booming-as-russias-war-in-ukraine-continues-to-rage-215801466.html\" target=\"_blank\" rel=\"noopener noreferrer\">reported on Saturday</a>, EU nations have committed to about $230 billion in new weapons purchases since the Russian military offensive against Kiev started in February. US defense contractors are poised to land the lion&rsquo;s share of those orders, given their dominance as suppliers to European militaries, Yahoo added.</p>\n<p>Many European nations turn to US arms makers for more than half of all their weapons purchases. Yahoo cited data from the Stockholm International Peace Research Institute (SIPRI) to show examples of US dominance in European arsenals. For instance, US-made arms accounted for 95% of the weapons purchases by the Netherlands from 2017 to 2021. The ratios were 83% US weaponry for Norway, 77% for the UK, and 72% for Italy.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/6358018c85f5402da638e27b.jpg\" alt=\"FILE PHOTO: Ukrainian servicemen firing a FGM-148 Javelin, a US anti-tank missile.\" />\n            <figcaption><a href=\"https://www.rt.com/business/565320-raytheon-profits-ukraine-weapons-demand/\">Raytheon making a killing on Ukraine weapons</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>European weapons imports jumped 19% during the five-year period as then-President Donald Trump prodded his NATO allies to meet their obligations for defense spending. The Ukraine crisis is set to create an even bigger windfall, as President Joe Biden leads an international campaign to flood Ukraine with weapons and the conflict triggers accelerated steps by European nations to bolster their own defenses.</p>\n<p><em>&ldquo;This is certainly the biggest increase in defense spending in Europe since the end of the Cold War,&rdquo;</em> Ian Bond, director of foreign policy at the Center for European Reform, told Yahoo. The crisis in Eastern Europe dispelled the notion that war on the continent is no longer possible, he added. <em>&ldquo;They&rsquo;re waking up to the fact that not only is it very possible, but it is happening, and it&rsquo;s happening not that many miles away from them.&rdquo;</em></p>\n<p>Since Biden took office in January 2021, European countries entered at least the initial stage of negotiations for $33 billion in arms purchases, including $21 billion since February, Yahoo said, citing figures from the Quincy Institute for Responsible Statecraft.</p>\n<p>US defense contractors will also benefit from Washington&rsquo;s massive military aid to Kiev, as the Pentagon races to replenish stocks of artillery pieces, rocket launchers and other weapons. Biden has set aside more than $65 billion in military and economic aid for Ukraine since the conflict began.</p>\n\n            \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/news/562880-pentagon-raytheon-lockheed-ukraine-bonanza/\">\n            <span>READ MORE: </span>Pentagon’s bonanza for US missile makers\n        </a>\n    </p>\n\n    \n\n<p>Russia has warned that the influx of Western weapons will prolong the crisis while making the US and other NATO members de facto participants.</p>\n<p></p>",
  "enclosure": "",
  "pubDate": "Sat, 05 Nov 2022 17:44:31 +0000",
  "dc:creator": "RT"
}