{
  "title": "S15 Ep15: Supernatural News/Parashare: School Spirits Edition",
  "link": "https://audioboom.com/posts/8098508",
  "itunes:episode": 15,
  "itunes:title": "Supernatural News/Parashare: School Spirits Edition",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 6156,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Darkness Radio has Supernatural News & ParaShare on this School Spirits Edition!<br>\n<br>\nThe boys have swept the world and uncovered the most unusual stories, we go on the lookout for a Leprechaun Lover, seek School Spirits, hear Demonic Sounds from McDonald's, some cool refreshing Ice-T and just a bit of Coco and we reveal The Excorcist's Wife, PLUS Your emails and stories!<br>\n<br>\nCall our Voices from Beyond phone line and leave us your story to share on a future episode 651-300-4977<br>\n<br>\nVisit our shop for exciting new items, clothes, books and more: <a href=\"https://www.amazon.com/shop/darknessradiodave\">https://www.amazon.com/shop/darknessradiodave</a><br>\n<br>\nGet the best F*^cking Tea in the world at <a href=\"http://www.SnarkyTea.com\">www.SnarkyTea.com</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nDo you experience stress?  Or have anxiety…Or chronic pain ...Or have trouble sleeping at least once a week? You’re NOT alone! Feals is a better way to feel better. Our premium CBD will keep your head clear and help you feel your best. Become a member today by going to <a href=\"http://Feals.com/darkness\">Feals.com/darkness</a> and you'll get 50% off your first order with free shipping. <br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !<br>\n<br>\nStart listening with a 30-day Audible trial. Choose 1 audiobook and 2 Audible Originals<br>\nabsolutely free. Visit <a href=\"http://audible.com/btd\">audible.com/btd</a> or text btd to 500-500.",
  "itunes:summary": "Darkness Radio has Supernatural News & ParaShare on this School Spirits Edition!\n\nThe boys have swept the world and uncovered the most unusual stories, we go on the lookout for a Leprechaun Lover, seek School Spirits, hear Demonic Sounds...",
  "pubDate": "Sat, 22 Feb 2020 10:00:00 +0000",
  "guid": "4b26befc-0147-4e37-b4a4-e6b6d22a9b23",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}