{
  "title": "Episode 118: Are You REALLY Listening? Sanford Meisner, Acting and Psychology",
  "pubDate": "Fri, 12 Mar 2010 14:32:08 +0000",
  "guid": "episode-118-are-you-really-listening-sanford-mei",
  "link": "http://www.thepsychfiles.com/2010/03/episode-118-are-you-really-listening-sanford-meisner-acting-and-psychology/",
  "itunes:image": "",
  "description": "A lot of people get into psychology because they think they are good listeners, but are you really a good listener?  What does it mean to be a good listener?  In this episode I look at a fascinating acting exercise created by Sanford Meisner called the \"repetition exercise\" which trains actors how to truly listen.  Are you as good a listener as these trained actors?",
  "content:encoded": "A lot of people get into psychology because they think they are good listeners, but are you really a good listener?  What does it mean to be a good listener?  In this episode I look at a fascinating acting exercise created by Sanford Meisner called the \"repetition exercise\" which trains actors how to truly listen.  Are you as good a listener as these trained actors?",
  "enclosure": "",
  "itunes:duration": "24:33",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,listening,psychology,Acting,lecture,active,meisner",
  "itunes:subtitle": "Are you really a good listener?  What does it mean to be a good listener?  In this episode I look at a fascinating acting exercise created by Sanford Meisner called the \"repetition exercise\" which trains actors how to truly listen.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "A lot of people get into psychology because they think they are good listeners, but are you really a good listener? What does it mean to be a good listener? In this episode I look at a fascinating acting exercise created by Sanford Meisner called the \"repetition exercise\" which trains actors how to truly listen. Are you as good a listener as these trained actors?"
}