{
  "guid": "urn:uuid:5aeeba4f-8268-4ddd-bd18-166d94a01132",
  "link": "https://www.who.int/news/item/01-11-2022-third-meeting-of-the-international-health-regulations-(2005)-(ihr)-emergency-committee-regarding-the-multi-country-outbreak-of-monkeypox",
  "a10:author": {
    "a10:name": ""
  },
  "title": "Third meeting of the International Health Regulations (2005) (IHR) Emergency Committee regarding the multi-country outbreak of monkeypox",
  "description": "<p>&nbsp;</p><p>The WHO Director-General transmits the report of the third meeting of the International Health Regulations (2005) (IHR) Emergency Committee regarding the multi-country outbreak of monkeypox, held on Thursday, 20 October 2022, from 12:00 to 17:00 CEST.</p><p>The Emergency Committee acknowledged that some progress has been made in the global response to the multi-country outbreak of monkeypox since the last meeting, including the emerging information on the effectiveness of behavioural interventions and vaccines. The Committee held the consensus view that the event continues to meet the IHR criteria for a Public Health Emergency of International Concern (PHEIC) and highlights the primary reasons for ongoing concern. These include ongoing&nbsp;transmission in some regions, continuing preparedness and response inequity within and between WHO Member States, an emerging potential for greater health impact in vulnerable populations, continuing risk of stigma and discrimination, weak health systems in some developing countries leading to under-reporting, ongoing lack of equitable access to diagnostics, antiviral and vaccines, and research gaps needing to be addressed.</p><p>The WHO Director-General expresses&nbsp;his gratitude to the Chair,&nbsp;Members, and Advisors for their advice and concurs with this advice that the event continues to constitute a PHEIC for the reasons detailed in the proceedings of the meeting below. The Director-General issues revised Temporary Recommendations in relation to this PHEIC, which are presented at the end of this document.</p><p><a name=\"_Hlk109592327\" data-sf-ec-immutable=\"\">&nbsp;</a></p><p><strong>Proceedings of the third meeting</strong><strong>&nbsp;of the IHR Emergency Committee</strong></p><p>The third meeting of the IHR Emergency Committee on the multi-country outbreak of monkeypox was convened by videoconference, with the Chair and Vice-Chair being present in person on the premises of WHO headquarters, Geneva, Switzerland. Members and Advisors joined by videoconference. Eleven of the 15 Members and 6 of the 9 Advisors to the Committee participated in the meeting. The WHO Director-General, in his <a href=\"https://www.who.int/director-general/speeches/detail/who-director-general-s-opening-remarks-at-3rd-meeting-of-the-ihr-emergency-committee--multi-country-outbreak-of-monkeypox---20-october-2022\">opening remarks</a>, welcomed the Committee, noting a promising decline in cases globally, although progress in the regions of the Americas and Africa is less certain, where cases are rising in some countries, and underreporting is likely in others.</p><p>The Representative of the Office of Legal Counsel reminded the Members and Advisors of their roles and responsibilities and the mandate of the Emergency Committee under the relevant articles of the IHR.</p><p>The Ethics Officer from the Department of Compliance, Risk Management, and Ethics also reminded Members and Advisors of their roles and responsibilities, including their duty of confidentiality as to the meeting discussions and the work of the Committee; as well as of their individual responsibility to disclose to WHO, in a timely manner, any interests of a personal, professional, financial, intellectual or commercial nature that may give rise to a perceived or direct conflict of interest. Each Member and Advisor who was&nbsp;present was surveyed. No conflicts of interest were noted.</p><p>It was noted that one Member has withdrawn from the Committee on account of other commitments&nbsp;</p><p>The meeting was handed over to the Chair of the Emergency Committee, Dr Jean-Marie Okwo-Bele, who introduced the objectives of the meeting: to provide views to the WHO Director-General as to whether the multi-country outbreak of monkeypox continues to constitute&nbsp;a PHEIC, and, if so,&nbsp;to review the proposed temporary recommendations to States Parties.&nbsp;</p><p><strong>Presentations</strong>&nbsp;</p><p>Representatives of Brazil, Ghana, and Sudan updated the Committee on the epidemiological situation in their countries and their current response efforts. </p><p>The WHO Secretariat updated the Committee on the global epidemiological situation as well as on the rapidly evolving knowledge in understanding the clinical manifestation and evolution of the disease. Details can be found in the <a href=\"https://www.who.int/publications/m/item/weekly-epidemiological-update-on-covid-19---19-october-2022\">weekly epidemiological update</a>&nbsp;and in the <a href=\"https://www.who.int/publications/m/item/multi-country-outbreak-of-monkeypox--external-situation-report--8---19-october-2022\">8<sup>th</sup> External situation report</a>; WHO updates the information regularly through the <a href=\"https://www.who.int/emergencies/situation-reports\"></a><a href=\"https://www.who.int/emergencies/situation-reports\">external situation reports</a>. All data are also available and case counts are updated daily at this link: <a href=\"https://worldhealthorg.shinyapps.io/mpx_global/\">2022 Monkeypox Outbreak: Global Trends (shinyapps.io)</a>.</p><p>The Secretariat noted that, since the determination of the PHEIC on 23 July 2022, many more countries have promptly responded to the outbreak with a range of public health interventions and cases are declining globally. Nonetheless, the picture is mixed and, overall, the risk assessment conducted by the WHO Secretariat concludes that as of 18 October 2022 the public health risk remains moderate globally; at regional level, risk was assessed as high in the WHO region of the Americas, declining from high to moderate in the European region, remaining moderate for the WHO Regions of Africa, Eastern Mediterranean, and South-East Asia, and remaining low in the Western Pacific Region.</p><p>The Secretariat presented its <a href=\"https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)\">Strategic preparedness, readiness and response plan for monkeypox 2022</a>, and the global funding appeal recently published. With a goal of stopping the global monkeypox outbreak, the plan articulates three objectives: to stop human-to-human transmission, protect the vulnerable, and minimize zoonotic transmission.&nbsp; Five core components underpin the global response: emergency coordination, collaborative surveillance, community protection, safe and scalable care, and countermeasures and research. </p><p>After the presentations, Committee Members and Advisors proceeded to engage the Secretariat and the presenting countries in a question-and-answer session. </p><p><strong>Deliberative session</strong><strong> </strong><strong></strong></p><p>The Committee reconvened in a closed meeting to examine the questions in relation to whether the event continues to constitute a PHEIC, and if so, to consider the proposed Temporary Recommendations, drafted by the WHO Secretariat in accordance with IHR provisions. </p><p>The Chair reminded the Committee Members and Advisors of the definition of a PHEIC under the IHR: an extraordinary event, which constitutes a public health risk to other States through international spread, and which potentially requires a coordinated international response.</p><p>The Committee noted with concern that data from low-income settings are largely lacking, with scanty information available to determine whether transmission observed in Africa is mainly zoonotic or to determine the role of human-to-human transmission, including through intimate or sexual contact. Many low-income settings have inadequate diagnostic capacity and do not yet have access to vaccines or therapeutics, despite clearly having the highest reported case fatality of all regions, and little information is available as to whether authorities are considering their use or requesting supplies. </p><p>The Committee noted that in high-income settings in which the outbreak was first experienced, preliminary information suggests significant declines in the number of newly reported cases of monkeypox. Data needed to determine the respective contributions of various factors to these declines have yet to be fully collected and analysed. These factors could include: the adoption of safer sexual behaviours among populations at higher risk; the seasonal reduction of large gatherings enhancing risk-taking sexual behaviours; the strong vaccine acceptance in affected communities and rising rates of pre- and post-exposure vaccination; possibly rising immunity following infection among populations at higher risk; and surveillance artifacts resulting from declining patient presentation and testing for less severe cases. While evaluation and research have established that lower participation in higher-risk activities has contributed to slowing the outbreak, the Committee expressed concerns about the sustainability of these trends, early signals of vaccine hesitancy in a few areas within an overall context of very high vaccine acceptance; and an increasing concentration of cases amongst minoritized communities. The Committee noted the need to gather evidence on the drivers and interventions that have led to positive behaviour change. </p><p>The Committee noted the epidemiological concomitance of monkeypox, HIV and other Sexually Transmitted Infections, and expressed concern about the more frequent severe outcomes and deaths in people living with HIV who are immunocompromised and/or not receiving antiretroviral treatment, especially in underserved and low resource settings</p><p>The Committee expressed deep concern over continuing and emerging inequities in the response to the outbreak and noted the imperative for mechanisms, commitments and actions that will ensure equity in access to diagnostics, therapeutics, and vaccines. In addition, the Committee called for respect for human rights for all, including those in marginalized communities vulnerable to stigma; some Members reiterated their views that laws, policies and practices by state or non-state actors that criminalize or stigmatize consensual same-sex behaviour may hamper response interventions. It was advised that public health best practices include a harm reduction approach with efforts to overcome barriers caused by policies and laws which criminalize homosexuality or otherwise contribute to stigma and discrimination and impede efforts to control the outbreak. It was also recommended that global and national programmes should continue to engage with affected communities, work towards 1) integrating monkeypox outbreak response with HIV prevention and sexual health services where appropriate and 2) continue to strive for greater strategic support and research for most-affected countries.</p><p>Overall, the conditions that warranted the determination of the PHEIC still persist, as the monkeypox outbreak continues to constitute an extraordinary event which poses a public health risk through international spread, for which additional epidemic waves may yet be seen, and continues to require a coordinated international response to reduce the impact of the outbreak. While two members expressed views that the event did not and does not constitute a PHEIC, these were tempered by concern about the potential negative consequences of lifting the declaration at this time.<br /></p><p><strong>Conclusions</strong></p><p>The Committee collectively advised the WHO Director-General that the multi-country outbreak of monkeypox continues to meet the criteria included in the definition of the PHEIC provide by Article 1 of the IHR. Although views were expressed that the event did not and does not constitute a PHEIC, the Committee collectively recognized that the criteria embedded in the definition of the PHEIC may not be adequate at this time to inform their advice to the WHO Director-General as to whether and when this PHEIC should be terminated. In that regard, the Committee noted the ongoing process related to amendments to the IHR. </p><p>The Committee Members and Advisors provided their advice for the Temporary Recommendations to States Parties, which to a large extent continued those issued on 23 July 2022 by the WHO Director-General. The committee indicated the need to monitor the level of uptake and degree of implementation of Temporary Recommendations by States Parties, to complement the other modalities and programmatic approaches that are in place to support and monitor country outbreak response. </p><p align=\"center\">===</p><p><strong>&nbsp;</strong></p><p><strong>Temporary Recommendations issued by the WHO Director-General in relation to the</strong><strong> </strong><strong>multi-country outbreak of monkeypox</strong><strong> </strong><strong></strong></p><p>These Temporary Recommendations extend, modify or add to those issued on <a href=\"https://www.who.int/news/item/23-07-2022-second-meeting-of-the-international-health-regulations-(2005)-(ihr)-emergency-committee-regarding-the-multi-country-outbreak-of-monkeypox\">23 July 2022</a>.</p><p>These Temporary Recommendations support the goal and objectives of the <a href=\"https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)\">Strategic Preparedness, Readiness and Response Plan for Monkeypox 2022&ndash;2032</a> to stop the outbreak of monkeypox, interrupt human-to-human transmission of the virus, protect the vulnerable, and minimize zoonotic transmission of the virus. They apply to States Parties according to their epidemiological situation, patterns of transmission and capacities with respect to monkeypox outbreak response. It should be assumed that any State Party may experience importation or local human-to-human transmission of monkeypox. Thus, each State Party should undertake surveillance and be ready to engage in outbreak response for suspected cases, since any case from any source may lead to human-to-human transmission. Some States Parties may have a history of, or be experiencing, zoonotic transmission or may observe spillback of monkeypox from humans to animals. Finally, States Parties in a position to support scaling up access to vaccines, diagnostics and therapeutics, including through technology transfer, should make every effort to do so.</p><p>In implementing these temporary recommendations (defined under the IHR as &ldquo;non-binding advice issued by WHO pursuant to Article 15 of the IHR for application on a time-limited, risk-specific basis, in response to a public health emergency of international concern, so as to prevent or reduce the international spread of disease and minimize interference with international traffic&rdquo;), States Parties should do so in full respect for the dignity, human rights and fundamental freedoms of persons, in line with the principles set out in Article 3 of the IHR. </p><p>WHO documents referenced below are current as of 20 October 2022.</p><p><strong>&nbsp;</strong></p><p><strong>MODIFIED</strong>: <strong>Readiness (1):</strong><strong> </strong><strong><em>&nbsp;These recommendations are meant to ensure a state of readiness for an outbreak of monkeypox and apply to ALL States Parties</em></strong></p><p><strong>&nbsp;</strong></p><p><strong>MODIFIED</strong>: <strong>1.a.</strong> Activate or establish health and multi-sectoral coordination mechanisms to strengthen all aspects of readiness for responding to monkeypox and stop human-to-human transmission, including a comprehensive One Health approach<em>.</em> <a href=\"https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)\"><em></em></a><a href=\"https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)\">Monkeypox Strategic Preparedness, Readiness, and Response Plan (SPRP)</a>; <a href=\"https://www.who.int/publications/m/item/multi-country-outbreak-of-monkeypox--external-situation-report--8---19-october-2022\"></a><a href=\"https://www.who.int/emergencies/situations/monkeypox-oubreak-2022\"><em></em></a><a href=\"https://www.who.int/emergencies/situations/monkeypox-oubreak-2022\">Monkeypox outbreak 2022 - Global (who.int)</a>; <a href=\"https://www.who.int/publications/m/item/multi-country-outbreak-of-monkeypox--external-situation-report--8---19-october-2022\">Multi-country outbreak of monkeypox, External situation report #8 - 19 October 2022 (who.int)</a><em></em><strong></strong></p><p><strong>&nbsp;</strong></p><p><strong>MODIFIED</strong>: <strong>1.b.</strong> Plan for, and/or implement, interventions to avoid the stigmatization and discrimination against any individual or population group that may be affected by monkeypox, with the goal of preventing further undetected transmission of monkeypox virus. The focus of these interventions should be: to promote voluntary self-reporting and care seeking behaviour; to support access to diagnostic services, vaccines and therapeutics; to facilitate timely access to quality clinical care; and to protect human rights to health, privacy and dignity of affected individuals and their contacts across all communities.</p><p><a href=\"https://www.who.int/publications/i/item/WHO-MPX-RCCE-2022.1\"></a><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-RCCE-2022.1\">Risk communication and community engagement for monkeypox outbreaks, interim guidance</a><em></em></p><p><a href=\"https://www.who.int/publications/m/item/communications-and-community-engagement-interim-guidance-on-using-inclusive-language-in-understanding--preventing-and-addressing-stigma-and-discrimination-related-to-monkeypox\">Risk communication and community engagement public health advice on understanding, preventing and addressing stigma and discrimination related to monkeypox (who.int)</a><em></em></p><p><strong>&nbsp;</strong></p><p><strong>MODIFIED</strong>: <strong>1.</strong><strong>c. </strong>Noting that Clade II monkeypox virus is a sexually transmissible infection, establish and intensify epidemiological disease surveillance, including access to reliable, affordable and accurate diagnostic tests, for illness consistent with monkeypox as part of existing national surveillance and health care systems. For disease surveillance purposes, case definitions for suspected, probable and confirmed cases of monkeypox should be adopted, as well as the case definition for death related to monkeypox.</p><p><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Surveillance-2022.3\">https://www.who.int/publications/i/item/WHO-MPX-Surveillance-2022.3</a>; <a href=\"https://www.who.int/publications/i/item/WHO-MPX-laboratory-2022.1\"></a><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-laboratory-2022.1\">https://www.who.int/publications/i/item/WHO-MPX-laboratory-2022.1</a></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>1.d.</strong> Intensify the detection capacity by raising awareness and training health workers, including those in primary care, genitourinary and sexual health clinics, urgent care/emergency departments, dental practices, dermatology, paediatrics, HIV services, infectious diseases, maternity services, obstetrics and gynaecology, and other acute care facilities.</p><p><a href=\"https://www.who.int/publications/i/item/WHO-MPX-Surveillance-2022.3\"></a><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Surveillance-2022.3\">https://www.who.int/publications/i/item/WHO-MPX-Surveillance-2022.3</a></p><p><em>Online introductory training. </em><a href=\"https://openwho.org/courses/monkeypox-introduction\">Monkeypox: Introduction | OpenWHO</a>&nbsp; </p><p><em>Online extended training.</em> <a href=\"https://openwho.org/courses/monkeypox-intermediate\">Monkeypox epidemiology, preparedness and response | OpenWHO</a><em></em></p><p><em>These online trainings are available in many languages. </em></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>1.e.</strong> Raise awareness about monkeypox virus transmission, related prevention and protective measures, and symptoms and signs of monkeypox among communities that are currently affected in other countries (e.g., importantly, but not exclusively, gay, bisexual and other men who have sex with men (MSM) or individuals with multiple sexual partners) as well as among other population groups that may be at risk (e.g., male and female sex workers, transgender people).</p><p><a href=\"https://www.who.int/publications/i/item/WHO-MPX-RCCE-2022.1\"></a><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-RCCE-2022.1\">https://www.who.int/publications/i/item/WHO-MPX-RCCE-2022.1</a><strong></strong></p><p><a href=\"https://www.who.int/news-room/public-advice/men-who-have-sex-with-men-preventing-monkeypox\"></a><a href=\"https://www.who.int/news-room/public-advice/men-who-have-sex-with-men-preventing-monkeypox\">Public advice for men who have sex with men on preventing monkeypox</a><em></em></p><p><a href=\"https://www.who.int/publications/m/item/public-health-advice-for-sex-workers-on-monkeypox\"></a><a href=\"https://www.who.int/publications/m/item/public-health-advice-for-sex-workers-on-monkeypox\">Public health advice for sex workers on monkeypox (who.int)</a><strong><em></em></strong></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>:<strong> 1.f. </strong>Engage key community-based groups, sexual health and civil society networks to increase the provision of reliable and factual information about monkeypox and its potential transmission to and within populations or communities that may be at increased risk of infection. </p><p><a href=\"https://www.who.int/publications/i/item/WHO-MPX-RCCE-2022.1\"></a><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-RCCE-2022.1\">https://www.who.int/publications/i/item/WHO-MPX-RCCE-2022.1</a><strong></strong></p><p><a href=\"https://www.who.int/news-room/public-advice/protecting-yourself-from-monkeypox\"></a><a href=\"https://www.who.int/news-room/public-advice/protecting-yourself-from-monkeypox\">Public advice on protecting yourself from monkeypox (who.int)</a><strong><em></em></strong></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>:<strong> 1.g.</strong> Focus risk communication and community support efforts on settings and venues where intimate encounters take place (e.g., gatherings focused on MSM, sex-on-premises venues). This includes engaging with and supporting community-led organizations, the organizers of large and smaller scale events, as well as with owners and managers of sex on premises venues to promote personal protective measures and risk-reducing behaviour.</p><p><a href=\"https://www.who.int/publications/i/item/WHO-MPX-Gatherings-2022.1\"></a><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Gatherings-2022.1\">https://www.who.int/publications/i/item/WHO-MPX-Gatherings-2022.1</a><strong></strong></p><p><strong>&nbsp;</strong></p><p><strong>MODIFIED</strong>: <strong>1.h.</strong> As soon as the first cases are detected, report probable and confirmed cases of monkeypox, and deaths related to monkeypox, to WHO through channels established under the provisions of the IHR using the minimum data set contained in the WHO Case Report Form (CRF).</p><p><a href=\"https://www.who.int/publications/i/item/WHO-MPX-Surveillance-2022.3\"><em></em></a><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Surveillance-2022.3\">https://www.who.int/publications/i/item/WHO-MPX-Surveillance-2022.3<em></em></a>; <a href=\"https://www.who.int/publications/i/item/WHO-MPX-Clinical_CRF-2022.3\"><em></em></a><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Clinical_CRF-2022.3\">https://www.who.int/publications/i/item/WHO-MPX-Clinical_CRF-2022.3&nbsp; </a><strong></strong></p><p><strong>&nbsp;</strong></p><p><strong>MODIFIED</strong>:<strong> 1.i.</strong> Implement all actions necessary to be ready to apply or continue applying the set of Temporary Recommendations enumerated under Outbreak Response (2) below in the event of first-time or renewed detection of one or more suspected, probable or confirmed cases of monkeypox. </p><p><a href=\"https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)\"></a><a href=\"https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)\">https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)</a><strong></strong></p><p>&nbsp;</p><p><strong>MODIFIED</strong>: <strong>&nbsp;Outbreak response (2):</strong><strong> All </strong><strong><em>States Parties with one or more cases of monkeypox, regardless of the initial source, or experiencing human-to-human transmission, including in key population groups communities at high risk of exposure&nbsp; </em></strong></p><p><strong></strong><strong></strong></p><p><strong>EXTENDED</strong>: <strong>2.a.</strong><strong> </strong><strong>Implementing coordinated response</strong></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.a.i.</strong> Implement response actions with the <strong>goal of stopping human-to-human transmission</strong> of monkeypox virus, with a priority focus on communities at high risk of exposure, which may differ according to context and include gay, bisexual and other men who have sex with men (MSM). Those actions include: targeted risk communication and community engagement, case detection, supported isolation of cases and treatment, contact tracing, and targeted immunization for persons at high risk of exposure for monkeypox.</p><p><a href=\"https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)\"></a><a href=\"https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)\">https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)</a><strong></strong></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.a.ii.</strong> Empower affected communities and enable and support their leadership in devising, contributing actively to, and monitoring the response to the health risk they are confronting. Extend technical, financial and human resources to the extent possible and maintain mutual accountability on the actions of the affected communities.</p><p><a href=\"https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)\"></a><a href=\"https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)\">https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)</a><strong></strong></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.a.iii.</strong> Implement response actions with the goal of <strong>protecting vulnerable groups</strong> (immunosuppressed individuals, children, pregnant women) who may be at increased risk of severe monkeypox disease. Those actions include: targeted risk communication and community engagement, case detection, supported isolation of cases, contact tracing, and treatment. These may also include targeted immunization, which takes into careful consideration the risks and benefits for the individual in shared clinical decision-making.<a href=\"https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)\"></a><a href=\"https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)\"></a></p><p><a href=\"https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)\">https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)</a></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.b.</strong><strong> </strong><strong>Engaging and protecting communities</strong></p><p><strong>&nbsp;</strong></p><p><strong>MODIFIED</strong>: <strong>2.b.i. </strong>Raise awareness about monkeypox virus transmission, actions to reduce the risk of onward transmission to others and clinical presentation in communities affected by the outbreak, which may vary by context, and promote the uptake and appropriate use of prevention measures, including supporting equitable access to primary preventive vaccination for persons at risk of exposure, and adoption of other informed risk mitigation measures. In different contexts, these measures include limiting skin to skin contact or other forms of close contact with others while symptomatic, promoting the reduction of the number of sexual partners where relevant including with respect to events with venues for sex on premises, and use of personal protective measures and practices, including during, and related to, small or large gatherings of communities at high risk of exposure. </p><p><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-RCCE-2022.1\">https://www.who.int/publications/i/item/WHO-MPX-RCCE-2022.1</a></p><p><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Immunization-2022.2-eng\">Vaccines and immunization for monkeypox: Interim guidance, 24 August 2022 (who.int)</a><em></em></p><p><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Gatherings-2022.1\">https://www.who.int/publications/i/item/WHO-MPX-Gatherings-2022.1</a></p><p><strong>&nbsp;</strong></p><p><strong>MODIFIED</strong>: <strong>2.b.ii.</strong> Engage with authorities and event organizers of gatherings (large and small), including those likely to be conducive for encounters of an intimate nature or that may include venues for sex-on-premises, to promote personal protective measures and behaviours, encourage organizers to apply the WHO-recommended risk-based approach to decision-making regarding the holding of such events. All necessary information should be provided for risk communication on personal choices around preventive measures including the role of vaccines and reduction in numbers of partners, and for infection prevention and control including regular cleaning of event venues and premises.</p><p><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Gatherings-2022.1\">https://www.who.int/publications/i/item/WHO-MPX-Gatherings-2022.1</a><br /></p><p><a href=\"https://extranet.who.int/ihr/eventinformation/all-announcements\">https://extranet.who.int/ihr/eventinformation/all-announcements</a><strong></strong></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.b.iii.</strong> Develop and target risk communication and community engagement interventions, including systematic social listening (e.g., through digital platforms), for emerging perceptions, concerns, and misinformation that might hamper response actions.</p><p><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-RCCE-2022.1\">https://www.who.int/publications/i/item/WHO-MPX-RCCE-2022.1</a><strong></strong></p><p><a href=\"https://www.who.int/news-room/public-advice\"></a><a href=\"https://www.who.int/news-room/public-advice\">Public Advice (who.int)</a><em></em></p><p><a href=\"https://www.who.int/teams/epi-win\"></a><a href=\"https://www.who.int/teams/epi-win\">EPI-WIN (who.int)</a><em></em></p><p><a href=\"https://www.who.int/news/item/26-09-2022-who-releases-a-public-health-taxonomy-for-social-listening-on-monkeypox-conversations\">WHO releases a public health taxonomy for social listening on monkeypox conversations</a><strong><em></em></strong></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.b.iv.</strong> Engage with representatives of affected communities, non-government organizations, elected officials and civil society, and behavioural scientists to advise on approaches and strategies to avoid stigmatization of any individual or population groups in the implementation of appropriate interventions, so that care seeking behaviour, testing and access to preventive measures and clinical care are equitable and timely, and to prevent undetected transmission of monkeypox virus. </p><p><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-RCCE-2022.1\">https://www.who.int/publications/i/item/WHO-MPX-RCCE-2022.1</a><strong></strong></p><p><a href=\"https://www.who.int/publications/m/item/communications-and-community-engagement-interim-guidance-on-using-inclusive-language-in-understanding--preventing-and-addressing-stigma-and-discrimination-related-to-monkeypox\">Risk communication and community engagement public health advice on understanding, preventing and addressing stigma and discrimination related to monkeypox (who.int)</a><em></em></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.c. Surveillance and public health measures</strong></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.c.i. </strong>Intensify surveillance for illness compatible with monkeypox as part of existing national surveillance schemes, including access to reliable, affordable and accurate diagnostic tests.</p><p><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Surveillance-2022.3\">https://www.who.int/publications/i/item/WHO-MPX-Surveillance-2022.3</a><strong></strong></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.c.ii. </strong>Report to WHO, on a weekly basis and through channels established under the provision of the IHR, probable and confirmed cases of monkeypox, including using the minimum data set contained in the WHO Case Report Form (CRF).</p><p><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Surveillance-2022.3\">https://www.who.int/publications/i/item/WHO-MPX-Surveillance-2022.3</a><br /></p><p><a href=\"https://www.who.int/tools/global-clinical-platform/monkeypox\"></a><a href=\"https://www.who.int/tools/global-clinical-platform/monkeypox\">The WHO Global Clinical Platform for monkeypox</a><em></em></p><p><a href=\"https://www.who.int/publications/i/item/WHO-MPX-Clinical_CRF-2022.3\"><em></em></a><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Clinical_CRF-2022.3\">https://www.who.int/publications/i/item/WHO-MPX-Clinical_CRF-2022.3&nbsp; </a><strong></strong></p><p><strong>&nbsp;</strong></p><p><strong>MODIFIED</strong>: <strong>2.c.iii.</strong> Strengthen laboratory capacity (including through international specimen referral as needed), and support within-country decentralized access to testing, wherever feasible, for the diagnosis of monkeypox virus infection, and related surveillance, based on the use of nucleic acid amplification testing (NAAT), such as real time or conventional polymerase chain reaction (PCR).</p><p><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-laboratory-2022.1\">https://www.who.int/publications/i/item/WHO-MPX-laboratory-2022.1</a><br /></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.c.iv.</strong> Strengthen genomic sequencing, and international specimen referral capacities, building on existing sequencing capacities worldwide, to determine circulating virus clades and their evolution, and share genetic sequence data through publicly accessible databases. </p><p><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-laboratory-2022.1\">https://www.who.int/publications/i/item/WHO-MPX-laboratory-2022.1</a><strong></strong></p><p><strong>&nbsp;</strong></p><p><strong>MODIFIED</strong>: <strong>2.c.v.</strong><strong> </strong>Isolate cases for the duration of the infectious period. Policies related to the isolation of cases should encompass health, psychological, material and essential support to adequate living. Any adjustment of isolation policies late in the isolation period should entail the mitigation of any residual public health risk. Advise cases,<strong> </strong>during the isolation period, on how to minimise the risk of onward transmission.</p><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Clinical-and-IPC-2022.1\"></a><p><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Clinical-and-IPC-2022.1\"></a><a href=\"https://www.who.int/publications/i/item/WHO-MPX-Clinical-and-IPC-2022.1\">https://www.who.int/publications/i/item/WHO-MPX-Clinical-and-IPC-2022.1</a><em></em></p><p><a href=\"https://www.who.int/news-room/public-advice/protecting-yourself-from-monkeypox\"></a><a href=\"https://www.who.int/news-room/public-advice/protecting-yourself-from-monkeypox\">Public advice on protecting yourself from monkeypox (who.int)</a><em></em></p><a href=\"https://www.who.int/news-room/public-advice/recovering-from-monkeypox-at-home\"></a><p><a href=\"https://www.who.int/news-room/public-advice/recovering-from-monkeypox-at-home\"></a><a href=\"https://www.who.int/news-room/public-advice/recovering-from-monkeypox-at-home\">Public advice on recovering from monkeypox at home (who.int)</a><em></em></p><p><strong>&nbsp;</strong></p><p><strong>REMOVED (merged with previous)</strong>: <strong>2.c.vi.</strong><strong> D</strong>uring the isolation period, cases should be advised on how to minimise the risk of onward transmission.</p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.c.vii.</strong> Conduct contact tracing among individuals in contact with anyone who may be a suspected, probable, or confirmed case of monkeypox, including: contact identification (protected by confidentiality), management, and follow-up for 21 days through health monitoring that may be self-directed or supported by public health officers. Policies related to the management of contacts should encompass health, psychological, material and essential support to adequate living.</p><p><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Surveillance-2022.3\">https://www.who.int/publications/i/item/WHO-MPX-Surveillance-2022.3</a></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.c.</strong><strong>viii.</strong> Consider the targeted use of second- or third-generation smallpox or monkeypox vaccines (hereafter referred to as vaccine(s)) for post-exposure prophylaxis in contacts, including household, sexual and other contacts of community cases and health workers where there may have been a breach of personal protective equipment (PPE). </p><p><a href=\"https://www.who.int/publications/i/item/WHO-MPX-Immunization-2022.2-eng\"></a><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Immunization-2022.2-eng\">https://www.who.int/publications/i/item/WHO-MPX-Immunization-2022.2-eng</a><strong></strong></p><p><a href=\"https://cdn.who.int/media/docs/default-source/immunization/sage/2022/october/highlights_sage_oct_2022.pdf?sfvrsn=69f947c4_5\">highlights_sage_oct_2022.pdf (who.int)</a><strong><em></em></strong></p><p><strong>&nbsp;</strong></p><p><strong>MODIFIED</strong>: <strong>2.c.</strong><strong>vix.</strong> Consider the use of vaccines for primary preventive (pre-exposure) vaccination, particularly for persons and communities at high risk of exposure. Persons at highest risk of exposure in the multi-country outbreak are gay, bisexual or other MSM with multiple partners. Others at risk may include individuals with multiple casual sexual partners, sex workers, and those who may be exposed and at risk for more severe disease. Those at risk may also include health workers at risk of repeated exposure, laboratory personnel working with orthopoxviruses, and clinical laboratory personnel performing diagnostic testing for monkeypox. </p><p><a href=\"https://www.who.int/publications/i/item/WHO-MPX-Immunization-2022.2-eng\"></a><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Immunization-2022.2-eng\">https://www.who.int/publications/i/item/WHO-MPX-Immunization-2022.2-eng</a><strong></strong></p><p><a href=\"https://cdn.who.int/media/docs/default-source/immunization/sage/2022/october/highlights_sage_oct_2022.pdf?sfvrsn=69f947c4_5\">highlights_sage_oct_2022.pdf (who.int)</a><em></em></p><p><a href=\"https://www.who.int/publications/m/item/public-health-advice-for-sex-workers-on-monkeypox\">Public health advice for sex workers on monkeypox (who.int)</a><strong><em></em></strong></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.c.ix.</strong> Convene the National Immunization Technical Advisory Group for any decision about immunization policy and the use of vaccines. These should be informed by risks-benefits analysis. In all circumstances, vaccinees should be informed of the time required for protective immunity potentially offered by vaccination to be effective. </p><p><a href=\"https://www.who.int/publications/i/item/WHO-MPX-Immunization-2022.2-eng\"></a><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Immunization-2022.2-eng\">https://www.who.int/publications/i/item/WHO-MPX-Immunization-2022.2-eng</a><strong></strong></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.c.xi.</strong> Engage the communities at high risk of exposure in the decision-making process regarding any vaccine roll out.</p><p><a href=\"https://www.who.int/publications/i/item/WHO-MPX-Immunization-2022.2-eng\"></a><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Immunization-2022.2-eng\">https://www.who.int/publications/i/item/WHO-MPX-Immunization-2022.2-eng</a><em></em></p><p><strong>&nbsp;</strong></p><p><strong>ADDED</strong>: <strong>2.c.xii.</strong> Undertake thorough risk assessments, prepare for, and rapidly respond to any case or outbreak of monkeypox in congregate settings including hospitals, prisons, migrant worker residences, or other situations where population density may be high, including facilities for internally displaced persons or refugees. </p><p><a data-sf-ec-immutable=\"\">20221019_Monkeypox_external_sitrep-8.pdf</a><strong><em></em></strong></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.d. Clinical management and infection prevention and control</strong></p><p><strong>&nbsp;</strong></p><p><strong>MODIFIED</strong>: <strong>2.d.i.</strong> Establish and use recommended clinical care pathways and protocols for the screening, triage, isolation, testing, and clinical assessment of suspected cases of persons with monkeypox in all clinical settings where persons with compatible clinical syndromes may present, including but not limited to urgent or primary care, sexual health services and dermatology clinics; provide training to health care providers accordingly and monitor implementation of those protocols.</p><p><a href=\"https://www.who.int/publications/i/item/WHO-MPX-Clinical-and-IPC-2022.1\">https://www.who.int/publications/i/item/WHO-MPX-Clinical-and-IPC-2022.1</a><strong></strong></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.d.ii.</strong> Establish and implement protocols related to infection prevention and control (IPC) measures, encompassing engineering and administrative and the use of PPE; provide training to health care providers accordingly, and monitor the implementation of those protocols.</p><p><a href=\"https://www.who.int/publications/i/item/WHO-MPX-Clinical-and-IPC-2022.1\">https://www.who.int/publications/i/item/WHO-MPX-Clinical-and-IPC-2022.1</a><strong></strong></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.d.iii.</strong> Provide health and laboratory workers with adequate PPE, as appropriate for health facility and laboratory settings, and provide all personnel with training in the use of PPE.</p><p><a href=\"https://www.who.int/publications/i/item/WHO-MPX-Clinical-and-IPC-2022.1\">https://www.who.int/publications/i/item/WHO-MPX-Clinical-and-IPC-2022.1</a><strong></strong></p><p><strong>&nbsp;</strong></p><p><strong>MODIFIED</strong>: <strong>2.d.iv.</strong><strong> </strong>Establish, update, and implement evidence-based clinical protocols for the care and management of patients with uncomplicated monkeypox (e.g., keeping lesions clean, pain control, and maintaining adequate hydration and nutrition) and the various manifestations of severe disease; prevention and treatment of acute complications; and monitoring and management of mid- or long-term sequelae, including provision of social and psychological support where needed. Establish monkeypox case detection and care through integrated approaches with established sexual health and HIV prevention and care services, including through community engagement with civil society organizations.</p><p><a href=\"https://www.who.int/publications/i/item/WHO-MPX-Clinical-and-IPC-2022.1\">https://www.who.int/publications/i/item/WHO-MPX-Clinical-and-IPC-2022.1</a><strong><em></em></strong></p><p><a href=\"https://cms.who.int/news-room/public-advice/recovering-from-monkeypox-at-home\">Public advice on recovering from monkeypox at home (who.int)</a><strong><em></em></strong></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.d.v.</strong> Harmonise data collection and report clinical outcomes, using the WHO Global Clinical Platform for Monkeypox.</p><p><a href=\"https://www.who.int/tools/global-clinical-platform/monkeypox\"></a><a href=\"https://www.who.int/tools/global-clinical-platform/monkeypox\">https://www.who.int/tools/global-clinical-platform/monkeypox</a><strong></strong></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.e. Medical countermeasures and research</strong></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.e.i.</strong> Make all efforts to use existing or new vaccines against monkeypox within a framework of collaborative clinical efficacy studies, using standardized design methods and data collection tools for clinical and outcome data, to rapidly increase evidence generation on efficacy and safety, collect data on effectiveness of vaccines (e.g., such as comparison of one or two dose vaccine regimens), and conduct vaccine effectiveness studies.<a href=\"https://www.who.int/publications/i/item/WHO-MPX-Immunization-2022.2-eng\"><em>&nbsp;</em></a><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Immunization-2022.2-eng\">Vaccines and immunization for monkeypox: Interim guidance</a>; <a href=\"https://www.who.int/news-room/events/detail/2022/08/02/default-calendar/who-monkeypox-research---what-study-designs-can-be-used-to-address-the-remaining-knowledge-gaps-for-monkeypox-vaccines\"></a><a href=\"https://www.who.int/news-room/events/detail/2022/08/02/default-calendar/who-monkeypox-research---what-study-designs-can-be-used-to-address-the-remaining-knowledge-gaps-for-monkeypox-vaccines\">WHO Monkeypox research - Study designs to address knowledge gaps for monkeypox vaccines</a><strong><em></em></strong></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.e.ii.</strong> Make all efforts to use existing or new therapeutics and antiviral agents for the treatment of monkeypox cases within a framework of collaborative clinical efficacy studies, using standardized design methods and data collection tools for clinical and outcome data, to rapidly increase evidence generation on efficacy and safety.<sup> </sup></p><p><a href=\"https://www.who.int/publications/i/item/WHO-MPX-Clinical-and-IPC-2022.1\">https://www.who.int/publications/i/item/WHO-MPX-Clinical-and-IPC-2022.1</a><strong></strong></p><p><a href=\"https://www.who.int/tools/global-clinical-platform/monkeypox\">The WHO Global Clinical Platform for Monkeypox</a><em></em></p><p><a href=\"https://www.who.int/publications/m/item/core-protocol---an-international-adaptive-multi-country-randomized-placebo-controlled--double-blinded-trial-of-the-safety-and-efficacy-of-treatments-for-patients-with-monkeypox-virus-disease\"><a href=\"https://www.who.int/publications/m/item/core-protocol---an-international-adaptive-multi-country-randomized-placebo-controlled--double-blinded-trial-of-the-safety-and-efficacy-of-treatments-for-patients-with-monkeypox-virus-disease\">WHO CORE PROTOCOL - An international adaptive multi-country randomized, placebo-controlled, double-blinded trial of the safety and efficacy of treatments for patients with monkeypox virus disease</a></a><em> </em><strong></strong></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>2.e.iii.</strong> When the use of vaccines and antivirals for monkeypox in the context of a collaborative research framework is not possible, use under expanded access protocols can be considered, such as the Monitored Emergency Use of Unregistered and Investigational Interventions (MEURI), under certain circumstances, using harmonized data collection for clinical outcomes (such as <a href=\"https://cms.who.int/tools/global-clinical-platform/monkeypox\">the WHO Global Clinical Platform for Monkeypox</a>). </p><p><a href=\"https://www.who.int/publications/i/item/9789240041745\"><a href=\"https://www.who.int/publications-detail-redirect/9789240041745\">https://www.who.int/publications/i/item/9789240041745</a></a><strong></strong></p><p>&nbsp;</p><p><strong>ADDED</strong>: <strong>2.e.iv.</strong> Encourage, support and facilitate data gathering and priority research in areas of work relevant to monkeypox, including but not limited to disease transmission and the natural history of disease; diagnostics and innovative technologies including point-of-care tests, viral kinetics across specimen types and animal diagnostics; behavioural insights research and studies on effectiveness of interventions; exposure risk for health workers and&nbsp;pre- and post-exposure management; research on zoonotic transmission of monkeypox at the human-animal-environment interface, including, socio-economic and behavioural risk factors, and&nbsp; indications for environmental surveillance in wastewater. </p><p><a href=\"https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)\">https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)</a><strong><em></em></strong></p><p><a href=\"https://www.who.int/teams/blueprint/monkeypox\"><a href=\"https://www.who.int/teams/blueprint/monkeypox\">WHO R&amp;D blueprint and monkeypox</a></a><em></em></p><p><a href=\"https://www.who.int/news/item/17-10-2022-one-health-joint-plan-of-action-launched-to-address-health-threats-to-humans--animals--plants-and-environment\"><a href=\"https://www.who.int/news/item/17-10-2022-one-health-joint-plan-of-action-launched-to-address-health-threats-to-humans--animals--plants-and-environment\">One Health Joint Plan of Action to address health threats to humans, animals, plants and environment </a></a><em></em></p><p><a href=\"https://www.woah.org/en/disease/monkeypox/\">Monkeypox - World Organisation for Animal Health</a><em></em></p><p>&nbsp;</p><p><strong>MODIFIED</strong>:<strong> 2.f. Domestic and international travel </strong></p><p><strong>&nbsp;</strong></p><p><strong>MODIFIED</strong>:<strong> 2.f.i.</strong> Adopt and apply the following measures:</p><p data-list=\"24\" data-level=\"1\">-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Any individual who is considered a suspected, probable, or confirmed case of monkeypox by jurisdictional health authorities should avoid undertaking any travel, including international travel, until they are cleared to do so. Anyone who is unwell should be advised to seek medical attention prior to travel. </p><p data-list=\"24\" data-level=\"1\">-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Any individual who has been identified as a contact of a monkeypox case, and is therefore subject to health monitoring, should avoid undertaking any travel, including international travel, while under the health monitoring period, except for contacts for whom pre-departure arrangements to ensure continuity of health monitoring are agreed upon by the health authorities concerned, or, in the case of international travel, between national health authorities. <a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Surveillance-2022.3\">https://www.who.int/publications/i/item/WHO-MPX-Surveillance-2022.3</a></p><p>Exemptions apply for any person who is a case or contact and who may need to undertake travel to seek urgent medical care or flee from life threatening situations, such as conflict or natural disasters. <em></em></p><p><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Surveillance-2022.3\">https://www.who.int/publications/i/item/WHO-MPX-Surveillance-2022.3</a><br /></p><p>&nbsp;</p><p data-list=\"24\" data-level=\"1\">-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cross-border workers, who are identified as contacts of a monkeypox case, and, hence, under health monitoring, can continue their routine daily activities provided that health monitoring is duly coordinated by the jurisdictional health authorities from both/all sides of the border.</p><p>&nbsp;</p><p><strong>EXTENDED</strong>: <strong>2.f.ii.</strong> Establish operational channels between health authorities, transportation authorities, and conveyances and points of entry operators to:</p><p data-list=\"15\" data-level=\"1\">-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Facilitate international contact tracing in relation to individuals who have developed signs and symptoms compatible with monkeypox virus infection during travel or upon return;</p><p data-list=\"15\" data-level=\"1\">-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Provide communication materials at points of entry on signs and symptoms consistent with monkeypox; infection prevention and control; and on how to seek medical care at the place of destination;</p><p><strong>EXTENDED</strong>: WHO advises against any additional general or targeted international travel-related measures other than those specified in paragraphs <strong>2.f.i and 2.f.ii</strong>.</p><p><strong>&nbsp;</strong></p><p><strong>MODIFIED</strong>: <strong>Zoonotic transmission (3):</strong><strong> </strong><strong><em>States Parties, with known or suspected zoonotic transmission of monkeypox, including those where zoonotic transmission is known to occur or has been reported in the past, those where presence of monkeypoxvirus has been documented in any animal species, and those where infection of animals may be suspected or anticipated including in domestic pets, livestock or wildlife in newly affected countries. These recommendations apply to all States Parties.</em></strong></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>3.a. </strong>Establish or activate collaborative One Health coordination or other mechanisms at federal, national, subnational and/or local level, as relevant, between public health, veterinary, and wildlife authorities for understanding, monitoring and managing the risk of animal-to-human and human-to-animal transmission in natural habitats, forested and other wild or managed environments, wildlife reserves, domestic and peri-domestic settings, zoos, pet shops, animal shelters and any settings where animals may come into contact with domestic waste.</p><p><a href=\"https://www.who.int/news/item/17-10-2022-one-health-joint-plan-of-action-launched-to-address-health-threats-to-humans--animals--plants-and-environment\"></a><a href=\"https://www.who.int/news/item/17-10-2022-one-health-joint-plan-of-action-launched-to-address-health-threats-to-humans--animals--plants-and-environment\">One Health Joint Plan of Action to address health threats to humans, animals, plants and environment </a><em></em></p><p><a href=\"https://www.woah.org/en/disease/monkeypox/\">Monkeypox - WOAH - World Organisation for Animal Health</a><em></em></p><p><strong>&nbsp;</strong></p><p><strong>MODIFIED</strong>: <strong>3.b.</strong> Undertake detailed case investigations and studies to characterize transmission patterns, including suspected or documented spillovers from, and spillback, to animals. In all settings, and particularly for States Parties in the African and Eastern Mediterranean Regions, case investigation forms should be updated and adapted to elicit information on the full range of possible exposures and modes of both zoonotic and human-to-human transmission, including through sexual contact. Share the findings of these endeavours including ongoing case reporting with WHO.</p><p><a href=\"https://www.who.int/publications/i/item/WHO-MPX-Clinical_CRF-2022.3\"><em></em></a><a href=\"https://www.who.int/publications-detail-redirect/WHO-MPX-Clinical_CRF-2022.3\">https://www.who.int/publications/i/item/WHO-MPX-Clinical_CRF-2022.3&nbsp; </a><strong></strong></p><p>&nbsp;</p><p><strong>MODIFIED</strong>: Development and deployment of <strong>medical countermeasures (4):</strong><strong> These recommendations applies to all </strong><strong><em>States Parties, and particularly including those with capacity to innovate, develop and/or manufacture medical countermeasures</em></strong></p><p><strong>&nbsp;</strong></p><p><strong>MODIFIED</strong>: <strong>4.a.</strong> States Parties should pursue and/or support research, development and manufacturing capacity for monkeypox diagnostics, vaccines or therapeutics to enhance availability in an equitable manner and raise production. </p><p><a href=\"https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)\">https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)</a><strong><em></em></strong></p><p><a href=\"https://www.who.int/publications/m/item/who-emergency-appeal--monkeypox---july-2022---june-2023\"><a href=\"https://www.who.int/publications/m/item/who-emergency-appeal--monkeypox---july-2022---june-2023\">WHO Emergency Appeal: Monkeypox - July 2022 &ndash; June 2023</a></a><strong></strong></p><p><strong>&nbsp;</strong></p><p><strong>EXTENDED</strong>: <strong>4.b.</strong> States Parties and manufacturers should work with WHO to ensure diagnostics, vaccines, therapeutics, and other necessary supplies are made available based on equity, public health needs, solidarity and at reasonable cost to countries where they are most needed to support efforts to stop the onward spread of monkeypox.<strong></strong></p><p><a href=\"https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)\"><em></em></a><a href=\"https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)\">https://www.who.int/publications/m/item/monkeypox-strategic-preparedness--readiness--and-response-plan-(sprp)</a><em>; </em><a href=\"https://www.who.int/publications/m/item/who-emergency-appeal--monkeypox---july-2022---june-2023\"></a><a href=\"https://www.who.int/publications/m/item/who-emergency-appeal--monkeypox---july-2022---june-2023\">WHO Emergency Appeal: Monkeypox - July 2022 &ndash; June 2023</a><em></em></p><p><em>&nbsp;</em></p><p align=\"center\">===</p><br /><p>&nbsp;</p>",
  "pubDate": "Tue, 01 Nov 2022 13:01:29 Z"
}