{
  "title": "537: The First Harry Potter Movie Turns 20 Years Old",
  "link": "https://audioboom.com/posts/7971349",
  "itunes:episode": 537,
  "itunes:title": "The First Harry Potter Movie Turns 20 Years Old",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3977,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode, we’re celebrating the 20th Anniversary of Harry Potter and the Sorcerer’s Stone hitting movie theaters, and kicking off an incredible film series! Where were we on opening night? How did movie critics react to the first Potter film? Who would we cast in some of our favorite Potter roles?  Plus, Eric as the Sorting Hat? Join us for the first of several episodes celebrating this epic movie anniversary! <br>\n<br>\n\n</div>\n<ul>\n<li>Good news: ALL episodes of MuggleCast are now available in our RSS feed! Scroll all the way down to the bottom of the podcast feed to relive the old days.</li>\n<li>What did we do for the film's release on November 16, 2001?</li>\n<li>Thumbs up or thumbs down? We read some initial critical reviews of the movie!</li>\n<li>Quidditch hype! John Williams slander?!? No liberties taken?!?</li>\n<li>What were some of the more notable scenes that didn't make it to the screen?</li>\n<li>Box Office Breakdown: how did Sorcerer's Stone measure up?</li>\n<li>Recasting the first Potter film - our listeners weigh in with great suggestions!</li>\n<li>The hosts give their best Sorcerer's Stone movie impersonations!</li>\n<li>Quizzitch: Eventually released in 2017, what is the name of the song Bruce Springsteen wrote for Harry Potter between 1998-2001 and offered to Chris Columbus for use in the first Harry Potter film? <a href=\"https://www.mugglecast.com/quizzitch/\">Submit your answer</a>!</li>\n<li>This week’s episode is brought to you by MeUndies (get 15% off your first order at <a href=\"http://MeUndies.com/MuggleCast\">MeUndies.com/MuggleCast</a>), HelloFresh (Get 14 free meals and 3 free gifts at <a href=\"https://hellofresh.com/muggle14\">HelloFresh.com/muggle14</a>) and Quip (get your first refill of any refillable product free at <a href=\"http://www.getquip.com/muggle\">GetQuip.com/Muggle</a>).</li>\n</ul>\n",
  "pubDate": "Tue, 02 Nov 2021 08:00:00 +0000",
  "guid": "tag:audioboom.com,2021-11-01:/posts/7971349",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}