{
  "title": "Episode 76: Lost at School - An Interview with Ross Green Part 1",
  "pubDate": "Wed, 29 Oct 2008 11:02:54 +0000",
  "guid": "episode-76-lost-at-school-an-interview-with-ros",
  "link": "http://www.thepsychfiles.com/2008/10/29/episode-76-lost-at-school-an-interview-with-ross-green-part-1/",
  "itunes:image": "",
  "description": "Dr. Ross Green, author of The Explosive Child, has just published his second book, Lost at School in which he shows how the principles of Collaborative Problem Solving can be used by teachers and other caregivers in school settings.  If timeout hasn't worked for you as a parent or teacher, and especially if you're a teacher dealing with \"problem kids\", then perhaps you should look into Collaborative Problem Solving.  Join me for another fascinating interview with Dr. Ross Green.",
  "content:encoded": "Dr. Ross Green, author of The Explosive Child, has just published his second book, Lost at School in which he shows how the principles of Collaborative Problem Solving can be used by teachers and other caregivers in school settings.  If timeout hasn't worked for you as a parent or teacher, and especially if you're a teacher dealing with \"problem kids\", then perhaps you should look into Collaborative Problem Solving.  Join me for another fascinating interview with Dr. Ross Green.",
  "enclosure": "",
  "itunes:duration": "27:00",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology,lecture,childcare",
  "itunes:subtitle": "Dr. Ross Green, author of The Explosive Child, has just published his second book, Lost at School in which he shows how the principles of Collaborative Problem Solving can be used by teachers and other caregivers in school settings.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Dr. Ross Green, author of The Explosive Child, has just published his second book, Lost at School in which he shows how the principles of Collaborative Problem Solving can be used by teachers and other caregivers in school settings. If timeout hasn't worked for you as a parent or teacher, and especially if you're a teacher dealing with \"problem kids\", then perhaps you should look into Collaborative Problem Solving. Join me for another fascinating interview with Dr. Ross Green."
}