{
  "title": "#48: The Best of 2018",
  "itunes:title": "The Best of 2018",
  "pubDate": "Thu, 03 Jan 2019 11:00:00 +0000",
  "guid": "d96512579b774c72aaa67c44b194d0d8",
  "link": "https://inotherwords.libsyn.com/episode-48-the-best-of-2018",
  "itunes:image": "",
  "description": "<p>What were the hot topics of 2018? Host Charlotte Burns looks back on the year in this special episode, breaking down key moments in conversation with Julia Halperin (executive editor of artnet News).<br /> <br /> The broadening of the canon across markets and museums—from African American artists to outliers, from women artists to conspiracists—was a major topic for In Other Words guests last year.<br /> <br /> Another key area of focus was the future of the museum, with topics from deaccessioning to digital swarming discussed by institutional leaders in their appearances on the show, including Glenn Lowry (director, MoMA), Richard Armstrong (director, Solomon R. Guggenheim Museum and Foundation), Jessica Morgan (director, Dia Art Foundation), Michael Govan (CEO and Wallis Annenberg director, LACMA), Doryun Chong (deputy director and chief curator, M+ ), Budi Tek (founder, Yuz Museum and Foundation) and Lisa Phillips (director, New Museum of Contemporary Art).<br /> <br /> And the most popular topic of 2018? Art criticism. Roberta Smith (co-chief art critic of the New York Times) and Jerry Saltz (New York magazine’s senior art critic) talked about their writing and audiences, as well as the best art being made today.<br /> <br /> Tune in to toast the year.</p> <p>Transcript: <a href= \"http://www.artagencypartners.com/podcast/podcast-highlights-from-2018/\"> http://www.artagencypartners.com/podcast/podcast-highlights-from-2018/</a></p> <p>“In Other Words” is a presentation of AAP and Sotheby’s, produced by Audiation.fm.</p>",
  "content:encoded": "<p>What were the hot topics of 2018? Host Charlotte Burns looks back on the year in this special episode, breaking down key moments in conversation with Julia Halperin (executive editor of artnet News).  The broadening of the canon across markets and museums—from African American artists to outliers, from women artists to conspiracists—was a major topic for In Other Words guests last year.  Another key area of focus was the future of the museum, with topics from deaccessioning to digital swarming discussed by institutional leaders in their appearances on the show, including Glenn Lowry (director, MoMA), Richard Armstrong (director, Solomon R. Guggenheim Museum and Foundation), Jessica Morgan (director, Dia Art Foundation), Michael Govan (CEO and Wallis Annenberg director, LACMA), Doryun Chong (deputy director and chief curator, M+ ), Budi Tek (founder, Yuz Museum and Foundation) and Lisa Phillips (director, New Museum of Contemporary Art).  And the most popular topic of 2018? Art criticism. Roberta Smith (co-chief art critic of the New York Times) and Jerry Saltz (New York magazine’s senior art critic) talked about their writing and audiences, as well as the best art being made today.  Tune in to toast the year.</p> <p>Transcript: <a href= \"http://www.artagencypartners.com/podcast/podcast-highlights-from-2018/\"> http://www.artagencypartners.com/podcast/podcast-highlights-from-2018/</a></p> <p>“In Other Words” is a presentation of AAP and Sotheby’s, produced by Audiation.fm.</p>",
  "enclosure": "",
  "itunes:duration": "42:31",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "The Best of 2018",
  "itunes:season": 1,
  "itunes:episode": 48,
  "itunes:episodeType": "full",
  "itunes:author": "Charlotte Burns"
}