{
  "title": "215: Fruitcake Fraud",
  "link": "https://audioboom.com/posts/7992505",
  "itunes:episode": 215,
  "itunes:title": "Fruitcake Fraud",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3402,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>AND BEFORE YOU CAN EVEN THINK IT, LET ME REMIND YOU THAT PATRICK IS THE QUEEN FRUITCAKE AROUND HERE...and as much as we want this to be about a band of gay fraudsters, it's not. <br>\n<br>\nTIS THE SEASON TO BE SHADY! When the world's most beloved fruitcake company realizes that millions upon millions of dollars have been stolen from the CENTURY OLD FRUITCAKE FACTORY, the whole town is in an uproar. We've got socialites LITERALLY GOSSIPPING OVER POMEGRANATE MARTINIS AT 9AM, members of the centuries old cotillion book club who SIMPLY CAN'T BELIEVE IT, And the world's great accountant, a lady named Semetric, who figures it all out. THIS. ONE. IS. BANANAS. <br>\n<br>\n<a href=\"https://shop.truecrimeobsessed.com/\">OUR MERCH STORE IS OPEN!</a> Want a \"Steve, I've Been Duped\" T-shirt, or how about \"Not A Mother\" baseball T? \"Let The Women Do The Work\" sweatshirt? We've got all that and more for a limited time only! <a href=\"https://shop.truecrimeobsessed.com/\">CHECK IT OUT HERE!</a><br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 200 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"John Wayne Gacy: Devil in Disguise\" </strong>\"<strong>Night Stalker</strong>\" <strong>\"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Tue, 07 Dec 2021 12:08:47 +0000",
  "guid": "tag:audioboom.com,2021-12-07:/posts/7992505",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}