{
  "id": "tag:theatlantic.com,2020:39-612244",
  "content": "<p class=\"dropcap\">F<span class=\"smallcaps\">airway Market</span>, which credits itself with introducing New Yorkers to clementines, radicchio, fleur de sel, and vine-ripened fruit, started off as a small grocery store at 74th Street and Broadway, on the Upper West Side of Manhattan, where it still stands. According to family lore, Nathan Glickberg arrived at Ellis Island from Russia sometime in the 1910s, and by 1933 had saved up enough money to open his own fruit-and-vegetable store. Signs of a family fixation with produce are obvious in a black-and-white photo taken sometime in the vicinity of World War II: Nathan’s wife, Mary Glickberg, is dressed up in heels, pearls, and an omelet-fold updo and, for her formal portrait, positioned in front of the store’s rickety wood fruit crates, which are sagging under the weight of apples, lemons, and oranges stacked shoulder high. Pears back then came wrapped in squares of paper, which Nathan saved and placed beside the toilet. What was good enough for pears’ skin was, evidently, good enough for his.</p><p style=\"background-color: #333; color: #fff; padding: 12px 24px;\"><iframe frameborder=\"no\" height=\"20\" scrolling=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/841230652%3Fsecret_token%3Ds-h56xdEUeyc9&amp;inverse=true&amp;auto_play=false&amp;show_user=true\" style=\"background-color: #333\" width=\"100%\"></iframe><i class=\"audm--download-cta\">To hear more feature stories, <a href=\"https://www.audm.com/?utm_source=soundcloud&amp;utm_medium=embed&amp;utm_campaign=atl&amp;utm_content=supermarkets_are_miracle\" style=\"color: #fff; text-decoration: underline;\">get the Audm iPhone app.</a> </i></p><p>In 1954, Nathan brought in his son, Leo. In 1974, Leo brought in his son, Howie, and together they brought in Harold Seybert and David Sneddon, brothers-in-law who’d sold tomatoes wholesale. On Howie, Harold, and David’s watch, the Fairway store grew, expanding into Tibbs luncheonette next door, then into the adjoining drugstore, and then into the D’Agostino supermarket to the north. “We were beating them up,” Howie told me cheerfully. “They couldn’t make a living.” In 1995, <a href=\"https://www.nytimes.com/1995/12/19/nyregion/fancy-food-at-warehouse-prices-upscale-supermarket-carves-a-new-niche-in-harlem.html\">the partners opened a second Fairway, in a former meatpacking plant in Harlem</a>. That brought in my grandmother, ecstatic at being able to shop at a supermarket just around the corner from her apartment. And my grandmother brought in me.</p><p>I don’t remember my first visit to Central Park or the Metropolitan Museum of Art, but I do remember my first trip to Fairway. Coming from Oregon, where I grew up, I felt like Fairway had taken New York City’s big, brash, elbowy spirit and crammed it into a single store: There was the smash of bodies on the subway at rush hour; the dull roar and occasional skronk of Midtown; the hyperactive buy-now pushiness of Times Square, with signs hollering from all directions (<span class=\"smallcaps\">handmade stuffed peppers: wow! hooo! strange but true!</span>) and festive murals featuring steaks the size of taxis and promising <span class=\"smallcaps\">wholesale prices for the retail customer</span>. My grandmother, who had been forced to flee her home in what was then Yugoslavia during World War II, had spent nearly two decades as a stateless person and, before coming to the United States, pieced together family meals from cabbage, offal, and the produce with which farmers paid my grandfather for teaching in a rural Italian school. Fairway, to her, was a place of surreal abundance. She could roll her black-metal grocery cart down the hill and roll it back up stuffed with old- and new-country fare: an Entenmann’s Danish ring, Kraš Napolitanke, Thomas’ English Muffins, Hungarian salami, panettone, hot dogs, ajvar, cornflakes. And the deals! She’d sit me down at the kitchen table and, beaming, haul out new brands of wafer cookies to marvel at how little she’d paid. Fairway acquired a mythic status in our family. We did not make a trip to the supermarket so much as a pilgrimage.</p><figure class=\"full-width\"><img alt=\"left: photo from 1958 supermarket; right: Mary Glickburg\" height=\"429\" src=\"https://cdn.theatlantic.com/assets/media/img/posts/2020/06/Supermarkets_03/f61d9c435.jpg\" width=\"960\"><figcaption class=\"caption\"><em>Left</em>: A scene from a supermarket in 1958. <em>Right</em>: Mary Glickberg outside the original Fairway location. (Dmitri Kessel / Life Picture Collection / Getty; Courtesy of the Glickberg Family)</figcaption></figure><p>In 2007, Harold and David wanted to retire. Together with Howie, they brought in Sterling Investment Partners, a private-equity firm that acquired an 80 percent stake in the company in a deal that valued Fairway at $132 million. Since then, Fairway has expanded to 14 stores in the tristate area, gone public, <a href=\"https://www.nytimes.com/2016/05/08/nyregion/no-longer-a-market-like-no-other-fairway-fades.html?action=click&amp;module=RelatedLinks&amp;pgtype=Article\">declared bankruptcy</a>, cycled through owners, and <a href=\"https://www.nytimes.com/2020/01/23/nyregion/fairway-closing-bankruptcy.html\">declared bankruptcy again</a>. On March 25, nine days after New York restaurants were banned from seating customers and five days after grocery stores were declared one of the few businesses allowed to keep their doors open, Fairway announced that it had sold six stores, the leases of two others, and its name in a bankruptcy auction. The news came even as customers were lining up outside their neighborhood Fairway, spending nearly three times as much as usual on groceries, and finding store managers unable to keep much in stock. The fate of the other six stores remains, as of this writing, uncertain.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/technology/archive/2020/04/how-youll-shop-for-groceries-after-the-pandemic/610135/?utm_source=feed\">Read: How you’ll grocery shop after the coronavirus pandemic</a>]</i></p><p>Such is the whiplash supermarkets are now experiencing. Long-suffering as one of the thinnest-margined businesses in existence and one of the least-looked-forward-to places to visit, the supermarket has, for more than a decade, been under assault from e‑commerce giants, blamed for making Americans fat, accused of contributing to climate change, abandoned in favor of restaurants, and, in parts of the country, disappearing at a concerning pace. Esteem for the supermarket runs so low that, although Fairway technically is one, Howie bristled when I called it that. “I never liked us to be considered a supermarket,” he told me. “We used to be, you know, a food store.”</p><p>Yet in recent months, the supermarket has assumed a new centrality in Americans’ lives. Cashiers, stockers, distributors, wholesalers, packers, pickers, and truck drivers have, even in the absence of adequate health safeguards, continued working to ensure that shelves stay stocked. Foodtowns, Nugget Markets, and Piggly Wigglys have emerged as crucial lifelines, spawning a broad reappreciation for one of the most distinctly American institutions. Grocery shopping is no longer one in a long list of mundane errands. For many people, it’s <i>the</i> errand—the only one—and it now seems not inevitable, but somewhat amazing to be able to do at all.</p><figure><img alt=\"\" height=\"137\" src=\"https://cdn.theatlantic.com/assets/media/img/posts/2020/06/Supermarkets_05-1/9193bfee3.jpg\" width=\"672\"></figure><p><span class=\"smallcaps\">Supermarkets, technically defined </span>as behemoths <a href=\"https://www.novar.com/Refrigeration/1024x768/grocery-definitions.htm\">housing 15,000 to 60,000 different products</a>, from tampons to sliced turkey, evolved in the only place they could have: the U.S. of A. Fourteen years after the creator of <a href=\"https://www.pigglywiggly.com/about-us\">Tennessee’s Piggly Wiggly</a> came up with the revolutionary idea of a self-service grocery where people could hunt and gather food from aisles rather than asking a clerk to fetch items from behind a counter, Michael Cullen (christening himself the “World’s Greatest Price Wrecker”) opened <a href=\"https://timesmachine.nytimes.com/timesmachine/1980/05/04/111237234.pdf?pdf_redirect=true&amp;ip=0\">America’s first supermarket, King Kullen</a>, in 1930 in a converted garage in Jamaica, Queens. (There is some debate about who was first, but over the years, <a href=\"https://www.kingkullen.com/about-us/\">King Kullen</a> has pushed itself to the front of the line.)</p><p>For some 300 years, Americans had fed themselves from small stores like Nathan Glickberg’s and from public markets, where shopping for food involved mud, squawking chickens, clouds of flies, cadaverous smells, haggling, bartering, and getting shortchanged. The supermarket took the Fordist factory, with its emphasis on efficiency and standardization, and reimagined it as a place to buy food. Supermarkets may not feel cutting-edge now, but they were—a “revolution in distribution,” one supermarket researcher declared in 1955. They were such exotic marvels that, on her first official state visit to the United States, in 1957, <a href=\"https://www.washingtonpost.com/news/dc-sports-bog/wp/2017/10/19/wonderful-wonderful-the-time-queen-elizabeth-ii-watched-maryland-upset-unc/\">Queen Elizabeth II insisted on an impromptu tour of a suburban-Maryland Giant Food</a>. During his own visit to the United States in 1989, Boris Yeltsin made an unscheduled, <a href=\"https://www.nytimes.com/2007/04/24/world/europe/24yeltsin.html?hp=&amp;pagewanted=all\">20-minute detour to a Texas supermarket</a> that is credited with souring him on communism. “When I saw those shelves crammed with hundreds, thousands of cans, cartons and goods of every possible sort,” wrote Yeltsin in his autobiography, “for the first time I felt quite frankly sick with despair for the Soviet people.”</p><figure class=\"full-width\"><img alt=\"black and white 1957 photo of Queen Elizabeth at supermarket\" height=\"764\" src=\"https://cdn.theatlantic.com/assets/media/img/posts/2020/06/Supermarkets_WEB_12/6566bcda3.jpg\" width=\"960\"><figcaption class=\"caption\">Queen Elizabeth II visits a Giant Food in Maryland. (Paul Popper / Popperfoto / Getty)</figcaption></figure><p>Over the past 90 years, the average American supermarket has swelled from 12,000 square feet to nearly 42,000—big enough to swallow the Lincoln Memorial, two basketball courts, and a couple of Starbucks and still be hungry for more. The typical supermarket layout has barely changed during that time and could be thought of as a reverse mullet: party in the front, business in the back. Most stores open with a colorful bounty of flowers and produce (a breath of freshness to whet our appetites), followed by the flyover expanse of the center store (cans, jars, boxes, bags), followed, in the way back, by milk, eggs, and other staples (pushed to Siberia so you’ll travel through as much of the store as possible, and be tempted along the way). Store designers can choose from a variety of floor plans—forced-path, free-flow, island, wagon-wheel—but by far the most popular is the combination grid/racetrack, with nonperishable items in rectilinear aisles, and the deli, cheese, meat, seafood, and produce departments circling them on the exhilaratingly named racetrack, so called because we scoot faster on the store’s perimeter.</p><p>As the supermarket proliferated, so did our suspicion of it. We have long feared that this “revolution in distribution” uses corporate black magic on our appetites. The book <i>The Hidden Persuaders</i>, published in 1957, warned that supermarkets were putting women in a “hypnoidal trance,” causing them to wander aisles bumping into boxes and “plucking things off shelves at random.” A few years ago, <i>National Geographic</i> published <a href=\"https://www.nationalgeographic.com/culture/food/the-plate/2015/06/15/surviving-the-sneaky-psychology-of-supermarkets/\">a guide (one of many like it) to “surviving the sneaky psychology of supermarkets,”</a> as though buying milk were fraught with existential risk. Supermarkets have drawn comparisons to casinos—both are believed to cunningly manipulate us into staying longer and spending more—though, according to one architect who specializes in constructing stores, this gives regional grocers far too much credit.</p><aside class=\"callout-placeholder\" data-source=\"magazine-issue\"></aside><p>Still, a staggering number of studies have marshaled everything from video surveillance to eye tracking to decode how we behave while food shopping. The results suggest that we haven’t been applying ourselves. An analysis of more than 400 million shopping trips by the company VideoMining found that the average supermarket visit lasts just 13 minutes. During our time there, according to a study published in <i>The Journal of Consumer Research</i>, we typically demonstrate “only a minimal degree of cognitive effort.” My review of more than three dozen papers, ranging from “Observation of Parent-Child Interaction in Supermarket Decision-Making” (less exciting than it sounds) to “Shelf Management and Space Elasticity” (highly recommended), reveals that we ignore a full third of packages on the shelves; never make it to three-quarters of the store; take an average of just 13 seconds to pick out a product (including the time it takes to walk down the aisle and locate the item); spend 40 percent of our money on whatever chips or sports drinks the store’s manager is promoting on the aisles’ endcaps; dedicate, at most, 30 percent of our time in a store to actually selecting things to buy; and, per a 2012 article in <i>Obesity Reviews</i>, devote the rest of our shopping trip to “ineffective wandering.”</p><p>The experts have concluded that we buy more of the products stocked at or just below eye level, think more highly of items placed on high shelves, are 40 percent more likely to give a product a second look if it has eight facings on a shelf instead of four, and will buy 6 percent less canned soup if it’s organized alphabetically by flavor instead of clumped by brand. (Inefficiency can be profitable, and the soup study observed that making products easier to locate corresponded with a drop in sales.) Findings such as these are used to create planograms—aisle-by-aisle, shelf-by-shelf, inch-by-inch maps that indicate whether Jell‑O gets two facings or three, and whether Coke Zero is to the left of Diet Coke or to its right. (Often, the manufacturers whose products sell the most in a category—like Kellogg’s or Coca-Cola—get to advise grocers on where to put their products as well as their competitors’.) Howie Glickberg used to sketch out Fairway’s planograms by hand; more typically, they’re determined using “category management” software that, per one vendor, relies on “space-aware assortment optimization,” “robust supply chain and shelf analytics,” and other things likely to make your eyes glaze over. “We’re constantly changing planograms in the stores, 52 weeks a year,” one supermarket executive told me.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/health/archive/2020/03/can-you-get-coronavirus-grocery-store/608659/?utm_source=feed\">Read: Can you get the coronavirus from the grocery store?</a>]</i></p><p>Analyzing data is one way to determine where things go. Cash is another. Among grocers’ least-favorite topics of conversation is slotting fees, which many of them charge manufacturers in exchange for real estate in their stores. Say you want to introduce a new product. In early 2018, getting it placed in the most visible areas of Whole Foods stores would have cost you, on average, $25,000, <a href=\"https://www.wsj.com/articles/getting-your-product-on-shelves-at-whole-foods-just-got-harder-1518085801\">according to <i>The Wall Street Journal</i></a>. Distributing it in supermarkets nationwide would cost nearly $2 million, but that’s per <a href=\"https://www.ftc.gov/sites/default/files/documents/reports/use-slotting-allowances-retail-grocery-industry/slottingallowancerpt031114.pdf\">a 2003 Federal Trade Commission report</a>, and the price now is almost certainly higher. Although a Nielsen survey found that 85 percent of retailers take slotting fees, the practice is covered by a strict omertà. One woman, fearing retribution for testifying on the subject to a Senate committee in 1999, <a href=\"https://apnews.com/b180119a0baaacd9d133edd3e4f1df06\">only did so while wearing a hood, hiding behind a screen, and having her voice scrambled</a>.</p><figure><img alt=\"\" height=\"152\" src=\"https://cdn.theatlantic.com/assets/media/img/posts/2020/06/Supermarkets_08/e0deadc8c.jpg\" width=\"672\"></figure><p><span class=\"smallcaps\">Before something is </span>in your supermarket, it is in a truck. “Everything you have comes in by truck,” one long-haul driver told me proudly. “We always say you’d be hungry, homeless, and naked if it wasn’t for our trucks.”</p><p>Over the past 40 years, Ingrid Brown has pulled bull racks and garbage trailers, but right now she feels blessed to be hauling a reefer. She runs 48 states with her refrigerated trailer, carrying eggs, milk, beef, toilet paper, computers, raw plastic on three-foot-tall rolls that will melt in the summertime, energy drinks that will freeze in the wintertime, and what she considers her specialty, “dead-on, fresh-hot freight”—blueberries out of California, bananas off the port in New Jersey, Vidalia onions out of Georgia, lettuce, squash, corn. “We’re seasonal,” she told me. “We move just like cabbage moves, from the bottom of Florida up.”</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/health/archive/2020/04/coronavirus-class-war-just-beginning/609919/?utm_source=feed\">Read: How the coronavirus could create a new working class</a>]</i></p><p>Haulers consider produce one of the most difficult and temperamental loads to run. The <a href=\"https://www.ams.usda.gov/sites/default/files/media/TransportPerishableFoodsbyTruck%5B1%5D.pdf\">Department of Agriculture’s guide to “Protecting Perishable Foods During Transport by Truck”</a> is high on drama and full of inspiration for the aspiring horror writer: chilling injury, highway shock, mold attacks, sunken skin, “pitting and physiological breakdown.” Each fruit and vegetable has its own rider specifying its preferred travel conditions. Apples, for instance, are most comfortable between 30 and 32 degrees Fahrenheit, unless they’re Cortland, McIntosh, or Yellow Newtown Pippins, which desire an ambience 8 degrees warmer. Truck drivers must also know which foods do not get along. Apples are gassy; they release ethylene, which causes bananas, Brussels sprouts, kiwis, carrots, and a long list of other produce to brown or ripen prematurely. Other fruit is deliberately gassed: Strawberries are sealed in packaging into which carbon dioxide is injected, and grapes are often fumigated with sulfur dioxide. Garlic affects apples and pears the same way it affects us, which is to say, it makes them smell like garlic. Summer squash, poor thing, is “easily wounded,” while the humble potato turns out to be a mini miracle that, even after it has left the ground, can self-heal a nick by essentially growing new skin.</p><p>Brown has a house in the Blue Ridge Mountains in North Carolina, but her home is a Kenworth 18‑wheeler named Peach O Mind. She spends about 11 months a year on the road. She sleeps on a narrow bunk with pale-blue sheets behind the driver’s seat, and curls her hair most mornings in truck-stop bathrooms. While driving, she looks out on 40 gauges and switches, two orange teddy bears, and the open road. Brown drives for a carrier that pays either a set rate per run, or by the mile—44 to 47 cents, depending on tenure. When she and I spoke in the first week of April, the curve had not yet flattened, and Brown had just pulled into Love’s Travel Stop in Lake City, Florida, with a load of apples from Wenatchee, Washington.</p><p>It took Brown a week to get from Wenatchee to Lake City. She drove southeast until she reached the Ranch Hand Trail Stop near the Idaho-Wyoming border; continued east to Nebraska, where she searched unsuccessfully for a Subway sandwich and settled for crackers and a can of Beanee Weenee; moved onward to Carthage, Missouri, where she did seven loads of laundry and sanitized her truck; then drove down through Alabama to Lake City. She was scheduled to deliver her load at 4:30 a.m. the next day at a Target distribution center, but Target wanted to delay. The panic-buying had apparently subsided. “Now they’re actually getting overfilled, and they don’t have as many workers in the warehouses to unload it,” Brown said. “It’s taken a flip-flop.”</p><p>Brown has been bringing food, but having trouble getting it. “I’m living off peanut butter on a spoon,” she told me. Roadside restaurants are closing early, if they open at all, and the convenience stores at truck stops have become heinously expensive: $4.95 for a little cup of fruit, $7.89 for the very smallest jar of peanut butter, $8.39 for a bowl of instant mac and cheese. (Peach O Mind can’t fit in a drive-through lane or a regular gas station, or stop at a Walmart, which is notorious for booting rigs parked in its lots.) At Love’s, Brown couldn’t even find sliced bread.</p><figure class=\"full-width\"><img alt=\"collage of photos including Fairway and Steven Jenkins\" height=\"826\" src=\"https://cdn.theatlantic.com/assets/media/img/posts/2020/06/Supermarkets_04/d881c7f48.jpg\" width=\"960\"><figcaption class=\"caption\">Steven Jenkins (<em>bottom right</em>), a longtime Fairway employee and eventual partner, started making irreverent signs as an excuse to avoid talking to customers. But anything with his signs sold like crazy. (<em>Top right</em>: Zach Korb; <em>bottom right</em>: Michelle Sims; <em>remaining photos</em>: Fairway)</figcaption></figure><p>What Brown wishes she could spend her money on, but can’t, is hand sanitizer, Clorox wipes, anything to disinfect her hands and truck. “There’s none. None, zero. I ran out of everything last week, the last of everything. I have not had Lysol, a mask, gloves,” she told me. “I’ve been searching and searching.” There is nowhere to wash your hands in a truck, and finding bathrooms has become a challenge, as many rest stops have closed. Brown felt she was putting herself and others at risk. “Do you realize how many people I could infect?” she said. “If I got this across New York to New Jersey to California to Florida to Portland to Washington? Fourteen days before I had any sort of symptom, I would be in twice that many locations. And nobody is listening.”</p><p>There had been stories in the news about <a href=\"https://www.bloomberg.com/news/articles/2020-03-26/truckers-wary-of-new-york-deliveries-create-headache-for-grocers?sref=BGQFqz7X\">truck drivers not wanting to run loads into New York City</a>, which is a logistical headache even in the best of times. But during the last three weeks of March, Brown had delivered three loads of vegetables to the city. Most recently, she brought 40,000 pounds of cabbage, which had been transferred, on a predawn morning, from a packinghouse in North Carolina into Peach O Mind’s dark, frigid trailer; had rumbled north for a day; and then had been thrust into the fluorescent, honking insanity of the Bronx’s Hunts Point, the site of the largest produce market in the world.</p><figure><img alt=\"\" height=\"121\" src=\"https://cdn.theatlantic.com/assets/media/img/posts/2020/06/Supermarkets_WEB_07/80ae74fff.jpg\" width=\"672\"></figure><p><span class=\"smallcaps\">The New York City</span> Terminal Produce Market, as the Hunts Point Produce Market is officially known, has a face only a mother could love. Bordered by barbed wire and concrete walls, the 113‑acre complex is home to snowbanks of flattened cardboard boxes and four long, squat buildings with mottled cinder-block exteriors. At each building, there are 18‑wheelers unloading, six-wheelers picking up, and boxes everywhere—<span class=\"smallcaps\">top red washington state apples, top quality limes, premium california citrus</span>—piled two stories high in refrigerated rooms, whizzing by on pallet jacks, getting hustled onto hand trucks, teetering beside a sales booth where someone nearby is on the phone telling Curtis, “I do not have a box of one-twenty-fives” (size-125 apples, so called because 125 of them will fit in a 40-pound box).</p><p>Everything is either on its way in or on its way out, or had better be. “You do not want to get caught with the product,” says Joel Fierman, who represents the third generation of Fiermans to run Fierman Produce Exchange. “This is a perishable. This is not a sweater. This goes bad. Forty-eight hours—it’s going bad, nobody’s buying it.” Fierman Produce Exchange is one of Hunts Point’s 30 houses—distributors that buy from growers, then sell to restaurants, nursing homes, schools, jails, bodegas, street carts, and supermarkets, or the suppliers that stock them. Together, the houses handle 70 percent of the produce in the tristate area, feeding an estimated 25 million people each year.</p><p>From 6 a.m. on Sunday, when the week’s first loads of inbound fresh arrive, until 5 p.m. on Friday, when most houses pause sales, the market hums. The phone rings all day—where are trucks, deliveries, orders? At 10 p.m., buyers flood in. Through 3 a.m., it’s a madhouse, filled with the call-and-response of wholesalers pushing to sell for more while their customers needle for less. Workers assemble orders, stage produce, move so fast to load six-wheelers that they’ll hop off their motorized pallet jacks and start running for the boxes before the jack rolls to a stop. Every distributor I spoke with constantly interrupted himself to have another conversation. When he answered the phone, the first thing Andrew Brantley, who oversees apples, grapes, stone fruit, citrus, and pears for S. Katzman Produce, said to me was “Hold on one second, all right?”</p><p>Nathan Glickberg, Fairway’s patriarch, bought from Hunts Point <a href=\"https://www.pps.org/article/how-markets-grow-learning-from-manhattans-lost-food-hub\">when it was still Washington Market</a>, in Tribeca. He’d venture downtown to pick out produce each morning, get it delivered, and have it in his stands by 7 a.m. (The market moved to the Bronx in 1967.) But Fairway was selling in larger and larger quantities as it grew, and began to self-supply, ordering trailers of produce directly from growers. Other large supermarket chains and cooperatives do the same, though, like Fairway, they still fill in at Hunts Point. “They need us for when a truck is late, a truck is frozen, a truck came in heated, or maybe the product just wasn’t that good,” Brantley said. “We negotiate a price. Of course, they’re going to try to pay as close—Excuse me one second. Hello? Greg?”</p><p>By early April, the market’s sales had cratered by about half. “We lost the restaurants. We lost the theater. We lost the arts. The museums. We lost the tourism trade. We lost the hotels,” Fierman told me. People are still eating, but our tastes change when we dine at home, and supermarkets buy differently than restaurants. Romaine, not frisée. A modest potato, not the overstuffed Idaho spud that the Morton’s steakhouse in Midtown serves for $8.80. Supermarkets demand fruit with curb appeal, while chefs don’t mind irregular produce, since it’ll be chopped before anyone sees it. “You go to a store and you want everything to look—we call it ‘plastic,’ ” Brantley said. “Like you can buy at IKEA or Pier 1.” Lately, his sales of bagged fruit and clamshell grapes had gone through the roof.</p><figure class=\"full-width\"><img alt=\"Left: Ingrid Brown; right: Elizabeth Miller\" height=\"648\" src=\"https://cdn.theatlantic.com/assets/media/img/posts/2020/06/Supermarkets_WEB_09/e70e1e3c0.jpg\" width=\"960\"><figcaption class=\"caption\"><em>Left</em>: Ingrid Brown spends about 11 months a year in an 18-wheeler named Peach O Mind, hauling produce and other goods across the country. <em>Right</em>: Elizabeth Miller takes a bus to a train to another bus to get to her job as a cashier at the Fairway in Harlem. (September Dawn Bottoms; Laurel Golio)</figcaption></figure><p>At the entrance to the market, an electronic sign blinked instructions to <span class=\"smallcaps\">stay in your truck</span>, but that did not apply to Hunts Point employees. They were being exposed to 40 or more people a day, Fierman said, despite new protocols. At least 20 people at the market had gotten sick. Some deliveries were taking longer to arrive. Before, loading a truck at a farm in California might have required four hours. “Now it’s taking eight, 12, or maybe even 18 hours to do that same process,” because of staffing shortages, Brantley said. And that’s if the fields are picked. Produce-industry publications had developed a careening tone: One day, they’d report on <a href=\"https://www.hortidaily.com/article/9209322/florida-growers-leave-behind-unharvested-crops/\">a Florida farmer who let 250 acres of cucumber, zucchini, yellow squash, and bell pepper rot on the vine</a> because there were no restaurants or cafeterias to sell to; supermarkets, the farmer noted, weren’t compromising on their demand for “plastic” produce. Another day, growers would cheer spikes in demand for ginger, mushrooms, apples, oranges, grapefruit, or “hardware”—potatoes, onions, carrots. Shoppers were seeking groceries with a long shelf life.</p><p>Some produce had been ready and waiting for months. Apples are picked in the late summer and fall and stored in a cold room, with the oxygen removed, until someone like Ingrid Brown comes for them. “There might be a time in October when you’re biting into an apple that was literally harvested that month, or sometimes you may be biting into an apple that was harvested back in November of the previous year,” Brantley said. “You’re still eating last year’s crop. And it’s no problem at all.”</p><figure><img alt=\"\" height=\"148\" src=\"https://cdn.theatlantic.com/assets/media/img/posts/2020/06/Supermarkets_06/162374ea0.jpg\" width=\"672\"></figure><p><span class=\"smallcaps\">Produce is one thing</span> Fairway has actually managed to keep in stock. “Every day I wake up and it’s <i>What disaster is going to happen today? </i>” Rob Reinisch, a Fairway district manager, told me in mid-April. Reinisch’s suppliers are rationing him, and he is rationing customers. Approximately half of what he orders from his suppliers is out of stock, and the eight stores he manages have been constantly running out of things: orange juice (“Everybody thinks Vitamin C is the immediate cure for the coronavirus”), yeast (“I’m basically not in stock ever”), even the free plastic produce bags (“They’re flying off the shelves because people are using them to cover their hands as gloves”). A week after Reinisch and I spoke, <a href=\"https://thefeed.blog/2020/04/26/feeding-the-nation-and-keeping-our-employees-healthy/\">the chairman of Tyson Foods wrote in an ad, “The food supply chain is breaking,”</a> sparking fears of more shortages to come. During the month of April, <a href=\"https://www.washingtonpost.com/business/2020/05/12/april-saw-sharpest-increase-grocery-store-prices-nearly-50-years/\">grocery prices increased more than they had in almost 50 years</a>, even as more than 20 million American jobs disappeared. The lines outside grocery stores paled in comparison to those outside many food banks.</p><p>In Fairway’s New York City stores, the panic-shopping had not subsided. “People continue every day to buy massive amounts of food,” Reinisch said. In wealthy neighborhoods like the Upper East Side, where, he assumes, people have disappeared to second homes, grocery purchases have leveled off. Alcohol purchases, on the other hand, have “<i>exploded</i>,” he said. “Wayyyyy, way up.”</p><p>To get to her job as a cashier at the Fairway in Harlem, Elizabeth Miller takes the No. 27 or No. 39 bus from the apartment she shares with a roommate in the Bronx, transfers to the 6 train, and then transfers again to the No. 15 bus. The trip used to take an hour and a half each way. Now, because there is so little traffic, it takes about 45 minutes. Miller works five or six days a week, in six-to-eight-hour shifts. She wears jeggings, a black T-shirt that says <span class=\"smallcaps\">fairway</span> in orange, a beanie over a baseball cap, and orange-and-green sneakers with reinforced soles. Miller joined Fairway’s Pelham Manor store last June, then transferred to Harlem because it paid $15 an hour rather than $12. When she first started working as a cashier, she had nightmares about memorizing produce codes. “Every cashier will tell you about the time they dream of being at work and they have a long line, and they’re by themselves, and there’s no manager to help them, and they’re trying to remember all the numbers of all the produce,” Miller told me.</p><aside class=\"callout-placeholder\" data-source=\"curated\"></aside><p>Stooping over the cash register all day and lifting heavy things from the belt make her back and shoulders sore, but to Miller, the hardest part of the job is not the long hours. It’s the people. Less the chance that they’ll get her sick—“I’m not as worried as most people,” she said—than having to stay placid and polite in the face of their impatience, testiness, and sheer, incessant swarm. Recently, Miller was working her register when a new hire couldn’t remember the produce codes and was mocked by customers. The cashier burst into tears and quit on the spot. “Honestly, being a cashier is not for the fainthearted,” Miller told me. “You can’t let someone get to you, because they’ll be gone in a few minutes. You can’t let them ruin your day.” She’s been cursed out, yelled at, called names. Just the other day, Miller asked a man to stay six feet away from her and another customer, and he started ranting and threw his money at her.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/ideas/archive/2020/04/i-work-grocery-store-dont-call-me-hero/610147/?utm_source=feed\">Karleigh Frisbie Brogan: I work in a grocery store—don’t call me a hero</a>]</i></p><p>Still, she has lately felt more appreciated, and is thankful to have a job. “It’s kind of weird—a lot of people are showing their gratitude, even though they’re the same people that just stand there when you’re bagging their items. It’s like, ‘What, you’re grateful now?’ Oh, how the tables have turned!” she said. “We actually matter more than celebrities and politicians and lawyers. We’re keeping everybody fed. We’re important.” She’d heard that two co-workers had gotten sick and were in quarantine. Around the time we spoke, <i>The Washington Post</i> reported that <a href=\"https://www.washingtonpost.com/business/2020/04/12/grocery-worker-fear-death-coronavirus/\">at least 41 grocery and food-processing workers nationwide had died from the virus</a>.</p><p>Miller tries to lighten the mood—by competing with other cashiers to see whose customers spend the most ($1,139 is the current record), and teasing people who have waited an hour in line and just finished unloading their carts that she’s closing the register to go on break. “They end up laughing, having a good time, getting a smile on their face,” Miller said. “It won’t help anybody if you show that you’re scared or freaked out. It won’t help the next person. So just smile a little bit.”</p><p>Miller does her food shopping at the Family Dollar near her apartment, which lately has also had long lines just to get in. She tries to avoid buying groceries at Fairway, because even with a 20 percent employee discount, it’s hard to leave without spending most of what she earned during the day’s shift. “Sometimes I do shop at Fairway, but only for, like, meat or bread,” she said. “Actually, no, not bread. It’s a little expensive.”</p><figure><img alt=\"\" height=\"152\" src=\"https://cdn.theatlantic.com/assets/media/img/posts/2020/06/Supermarkets_11/53dd536ce.jpg\" width=\"672\"></figure><p><span class=\"smallcaps\">In 2009, I </span><span class=\"smallcaps\">moved to New York</span> and made a weekend ritual of seeing my grandmother for visits that inevitably revolved around Fairway. In 2013, the year of the company’s public offering, a Fairway opened in my neighborhood. I looked forward to tasting my way through its hundreds of cheeses and developing the signature Fairway limp, cultivated through years of distracted shoppers ramming their carts into your ankles. But the store gradually stopped feeling like a Fairway. Prices ticked higher. The apples and lettuce no longer sat at attention, but slouched on displays, looking bored. The store, which I’d always associated with its totally arrogant, utterly New York motto “Like no other market,” began to promote itself with a slogan I’d have bet good money was engineered in whichever lab invented pink meat goo: “The place to go fooding.” Still, it stung to learn that the Fairway in Harlem, where my grandmother had spent so much time, had failed to sell in the bankruptcy auction in March, along with five other stores. Though Fairway said it planned to keep them open “for the foreseeable future,” I found this less than reassuring.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/ideas/archive/2020/02/how-private-equity-ruined-fairway/606625/?utm_source=feed\">Eileen Appelbaum and Andrew W. Park: How private equity ruined Fairway</a>]</i></p><p>What went wrong? According to industry experts, after Fairway’s longtime owners sold the lion’s share of their company, Fairway took on too much debt, expanded too fast, and went into a vicious cycle of trying to boost revenue by raising prices, which alienated shoppers. What went wrong, according to Howie Glickberg? “The Ivy League geniuses decided they knew more about the business than I did,” he told me. “They couldn’t understand that when you raise prices and get away from what the store was based on—best prices, best quality—you lose customers.” In 2016, Glickberg left the company. By then, his meetings with the Sterling executives were regularly devolving into heated fights because he disagreed with changes to the stores. (Sterling said that competition from Whole Foods, Trader Joe’s, and online grocers was responsible for the price pressures.) What went wrong, according to current Fairway Vice President Pat Sheils? “I’m not sure that I’m able to speak on that,” Sheils told me. “Yeah,” interrupted a publicist who’d been listening in on our call. “Yeah, agreed with you on that one, Pat.”</p><figure class=\"full-width\"><img alt=\"1988 photo of Steven Jenkins in cheese department\" height=\"643\" src=\"https://cdn.theatlantic.com/assets/media/img/posts/2020/06/Supermarkets_10/cdfe4363f.jpg\" width=\"960\"><figcaption class=\"caption\">Steven Jenkins in the cheese department of the original Upper West Side store, in 1988 (Michelle Sims)</figcaption></figure><p>For decades, Fairway felt like a store run by human beings, not calculators. Steven Jenkins, a longtime Fairway employee and eventual partner, started making irreverent signs as a way to look busy and avoid talking to customers (<span class=\"smallcaps\">fresh black figs, raw sex—same thing, 79 cents each</span>), but anything in the store with his signs sold like crazy, so he kept at them. He and Fairway’s other managers stocked things for the simple reason that they were good to eat. While Jenkins and I were speaking, he got out an old notebook in which he’d kept a ledger of every item he’d shipped to the stores from Europe in December 2013. “Here’s anchovies that I bought from the coast of Catalonia, the greatest anchovy in the <i>world</i>,” he said, reading from his list. “There’s some little mints from the village in France called Flavigny … Oh my God, I brought in walnuts from the Périgord region … Here’s my vintage sardines from Brittany. These vintage sardines taste like a sardine that God made and gave to you, personally … Olive oil, olive oil, olive oil. Mustards, vinegars, more French dried fruits … There’s my beets! I would bring in pallets and pallets of beets from just west of Paris, in Chatou … You didn’t have to peel the goddamn beet; they were ready to go and they tasted perfect and they were organic as well and they were cheap as dirt. I sold mountains of beets. Can you imagine such a thing? I was <i>so</i> proud of those beets.” He continued like this for 15 minutes.</p><p>Not every supermarket stocks French beets, but Fairway was less exceptional than it might seem. Private-equity firms have lately devoured supermarkets; since 2015, at least seven other grocery chains have been bought by private-equity investors, then bankrupted. And Fairway was no luxury-food shop: Besides the beets, which my grandmother adored, it stocked Kraft Singles, which I adore, and it evoked that same feeling of possibility that exists in even the most ordinary supermarket. Stuffed to the rafters, supermarkets overwhelm with the cacophony of choice. Floor-to-ceiling, wall-to-wall Light ’n Fluffy, Ding Dongs, Donettes, CRAVE, Fabuloso, Juicy Juice, Crunch ’n Munch, Pup-Peroni, Enviro-Log—all yelling, cajoling, promising, winking. At the very least, you have to marvel: How did we take something built to satisfy the simplest human need and make it so utterly baroque? The supermarket does not “curate.” It is a defiantly encyclopedic catalog of our needs and desires, each and every one of which it attempts to satisfy. With nothing but a can opener, you can get a “turkey dinner in gravy,” “chicken shrimp and crab stew,” “saucy seafood bake,” “chicken and turkey casserole,” “prime filets with salmon and beef,” “bisque with tuna and chicken,” “ocean whitefish dinner with garden greens in sauce,” or a “natural flaked skipjack tuna entrée in a delicate broth.” And that’s just in the cat-food aisle.</p><p>While researching this story, I became obsessed with supermarket names, which are the antithesis of the sanitized, one-word titles favored by cool venture-capital-backed retailers—Roman, Winc, Away. Traditional supermarkets have names as unpretentious and moth-eaten as an old wool sweater: Save A Lot, BI-LO, Great Valu. They don’t promise something as ambitious as Whole Foods. Just something edible, for an okay price: Food 4 Less, Price Rite, Stop &amp; Shop. The supermarket is not an aspirational brand catering to who we want to be. It’s just there for who we are: people who need Light ’n Fluffy, and Ding Dongs, and Donettes.</p><p>The names I came across were also largely unfamiliar to me, because, even now, supermarkets have stayed stubbornly regional. That may not be the case much longer, as national chains are poised to continue squeezing local players. The supermarket has always operated according to the principle of pile it high and sell it cheap, and the bigger you are—Kroger, Walmart, Albertsons—the higher, and cheaper, your pile. You can trim costs by <a href=\"https://www.wsj.com/articles/as-shipping-costs-soar-supply-chains-get-a-makeover-1529244003\">running your own trucking fleets</a>, creating <a href=\"https://www.emarketer.com/content/retailers-are-revamping-private-label-grocery\">your own products</a>, even designing your own produce. Walmart <a href=\"https://www.bloomberg.com/news/articles/2017-06-13/don-t-freak-out-but-wal-mart-just-created-a-designer-cantaloupe?sref=BGQFqz7X\">pioneered a cantaloupe</a> that supposedly tastes equally sweet in summer and winter. Americans now buy about a quarter of their groceries from Walmart, which has stores so gigantic, they are technically <i>hyper</i>markets.</p><p>Once upon a time, supermarkets were themselves the colossi putting small grocers out of business, and nostalgia for regional supermarkets in a sense seems risible. These Goliaths now look frail, as we’ve shifted to stocking up on groceries at places far beyond the super- and even hypermarket—gas stations, a onetime online bookseller. But until recently, you couldn’t go too long without joining the people who live near you to ineffectively wander a supermarket’s aisles, picking up toilet paper and milk and gossip. Supermarkets gather us together, and they reflect the particular appetites of our place. In speaking with the people who built Fairway, I perceived, despite the vastness of their stores, a neighborly sense of pride in focusing on the minute details of their shoppers’ lives. Jenkins had been outraged that New Yorkers were eating cheeses and olive oils that, in his mind, were beneath them. “There wasn’t a single bottle of olive oil worthy of anybody throughout the ’80s!” he ranted. So he imported some that was.</p><p>Compared with inventing new cantaloupes, this was, arguably, a small act. But the result was not small. Once a week, my grandmother would put on her hat, scarf, gloves, and polished leather shoes, and pull her black-metal cart down the hill to Fairway, then back up to her apartment. When she could no longer pull the cart back up the hill, she’d make the pilgrimage to Fairway, do her shopping, and have her groceries delivered. When she could no longer negotiate the steep hill on her own, my aunt, or a neighbor, steadied her on the walk down. When my grandmother stopped going anywhere else in the city, she still went to Fairway, where the world came to her.</p><hr><p><small><em>This article appears in the July/August 2020 print edition with the headline “Supermarkets Are a Miracle.”</em></small></p>",
  "author": {
    "name": "Bianca Bosker",
    "uri": "http://www.theatlantic.com/author/bianca-bosker/?utm_source=feed"
  },
  "media:content": {
    "media:credit": "H. Armstrong Roberts / Classicstock / Getty / The Atlantic"
  },
  "title": "The Pandemic Shows Us the Genius of Supermarkets",
  "published": "2020-06-17T07:00:00-04:00",
  "updated": "2020-07-21T14:33:13-04:00",
  "summary": "A short history of the stores that—even now—keep us supplied with an abundance of choices",
  "link": ""
}