{
  "title": "How technology has revolutionised operational efficiency in consumer finance",
  "link": "https://e27.co/how-technology-has-revolutionised-operational-efficiency-in-consumer-finance-20221026/",
  "dc:creator": "Tomasz Borowski",
  "pubDate": "Fri, 28 Oct 2022 02:00:52 +0000",
  "category": [
    "Big Data",
    "Community",
    "Fintech",
    "Philippines",
    "Singapore"
  ],
  "guid": "https://e27.co/?p=474817",
  "description": "<p>It is without question that technology has vastly improved our lives in more ways than none, making everything faster, easier, and more efficient than ever before. For the longest time, consumer finance has been confined to a traditional way, where customers regularly visit a bank’s branch to avail themselves of their products and services. Conversely, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/how-technology-has-revolutionised-operational-efficiency-in-consumer-finance-20221026/\">How technology has revolutionised operational efficiency in consumer finance</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<img loading=\"lazy\" class=\"aligncenter wp-image-474947 size-full\" src=\"https://e27.co/wp-content/uploads/2022/10/e27-19.png\" alt=\"\" width=\"690\" height=\"390\" />\n<p style=\"text-align: justify;\">It is without question that technology has vastly improved our lives in more ways than none, making everything faster, easier, and more efficient than ever before.</p>\n<p style=\"text-align: justify;\">For the longest time, consumer finance has been confined to a traditional way, where customers regularly visit a bank’s branch to avail themselves of their products and services. Conversely, bank employees must address customer concerns and document and validate bank transactions.</p>\n<h3 style=\"text-align: justify;\">Striking a balance between speed and security</h1>\n<p style=\"text-align: justify;\">I first entered the world of consumer finance when I joined a leading and established bank in Poland, at a time when retail banking was starting to get ahold in the country. My first experience not only taught me the ropes but it established my foundations on how essential it was to work as a team and what it meant to be a professional.</p>\n<p style=\"text-align: justify;\">It also made me realise the harsh reality that banks faced: everything took time, perhaps too much time. By its very nature, banks have a fiduciary duty towards their clients to ensure that their money remains safe and secure. However, I found myself asking this, “Is there a better and faster way to do all of this without risking our customers’ trust?”</p>\n<p style=\"text-align: justify;\">With this in mind, I brought this with me to the next stop in my career, this time in a growing retail bank in Ukraine. Fuelled to augment and reduce the lead time needed, I was determined to optimise our core banking processes. During this period, we could finish projects in two months, which would usually take six months, a 300 per cent improvement.</p>\n<h3 style=\"text-align: justify;\">Building on process automation and human innovation</h2>\n<p style=\"text-align: justify;\">To achieve these results, our team made use of known data-driven methods such as Six Sigma, which allows us first to identify and then eliminate defects in business processes. This emphasis on data would further serve as the light that guides my career from that point forward.</p>\n<p style=\"text-align: justify;\">Digital transformation is in full swing, a phenomenon that continues to affect us in every facet of our lives. This would not have been possible without breakthrough technological advancements driven by data.</p>\n<p style=\"text-align: justify;\">Consumer finance has already grown leaps and bounds compared to when I started. New processes like predictive auto-dialling and automated reminder calls can now be executed at increasing speeds and with little to no human errors.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/neobanks-can-create-a-better-digital-cx-by-leveraging-ai-blockchain-banco-ceo-20220906/\">‘Neobanks can create a better digital CX by leveraging AI, blockchain’: banco CEO</a></strong></p>\n<p style=\"text-align: justify;\">That does not mean that our role has diminished. In fact, it highlights the brilliance of human ingenuity – our abilities to be innovative and creative. We no longer need to focus our valuable time on doing rote work; we can now shift to designing systems that will put customer experience at the forefront, allowing technology to automate processes in a faster and more secure way than any person could ever do.</p>\n<h3 style=\"text-align: justify;\">Leveraging on data for business optimisation</h2>\n<p style=\"text-align: justify;\">As Co-Founder and former CEO Of Singapore-based FLOW (previously known as Asia Collect), we established professional, ethical, and highly efficient credit management through our data-driven collection strategies in the APAC region.</p>\n<p style=\"text-align: justify;\">Redefining credit management was made possible with AI technologies and ethical practices. With no field collection, automation was the framework which allowed digital debt collection to handle larger volumes of transactions with significantly reduced manpower.</p>\n<p style=\"text-align: justify;\">With over 2.8 million customers utilising FLOW’s personalised and digital-first experiences, FLOW’s strategies have shown impressive recovery rates for financial institutions and technology companies. Its growing success was made possible by efficiency improvements not just in its processes but also in optimising our personnel.</p>\n<p style=\"text-align: justify;\">After my venture with FLOW, I am more than proud of the work that we have done at Tonik, the Philippines’ first purely digital bank, or neobank as we call it. In their <a rel=\"follow\" href=\"https://www.bsp.gov.ph/Inclusive%20Finance/Financial%20Inclusion%20Reports%20and%20Publications/2021/2021FISToplineReport.pdf\">2021 Financial Inclusion report</a>, the Philippine central bank, <em>Bangko Sentral ng Pilipinas (BSP)</em>, showed that 45 per cent of adult Filipinos in 2019 were unbanked. In that same year, only 12 per cent of those had bank accounts. In 2021 per cent, that figure doubled to 23 per cent for those with bank accounts.</p>\n<p style=\"text-align: justify;\">That rise in the figure, which happened throughout the pandemic, greatly accelerated the adoption of digital payment and banking systems. Now that digital banking has gained widespread usage due to its ease and convenience, Filipinos now have more access to lending and deposit products and payments channel, all done with a few taps on their phones.</p>\n<p style=\"text-align: justify;\">Customers can seamlessly transfer funds, apply for loans, and pay their bills in a fraction of the time compared to before. Our core banking infrastructure is in the cloud, powered and secured by world-class tech companies.</p>\n<p style=\"text-align: justify;\">With a strong and experienced leadership team that is steering the ship, amplified by our shared vision of revolutionising the way money works in the region, I am excited to be on this trailblazing journey. By harnessing both the power of operational efficiency through technology and the talents and passion of our people, we are set to continue to revolutionise the way money works in Southeast Asia truly.</p>\n<p>&#8211;</p>\n<p>Editor’s note: <b >e27</b> aims to foster thought leadership by publishing views from the community. Share your opinion by <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://e27.co/contributor\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://e27.co/contributor\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">submitting</a> an article, video, podcast, or infographic</p>\n<p>Join our <b >e27</b> <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://t.me/joinchat/HmTbfBcGCZeykhM8NOlQ-g\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://t.me/joinchat/HmTbfBcGCZeykhM8NOlQ-g\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">Telegram group</a>, <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://www.facebook.com/groups/e27co/permalink/886904662065955/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.facebook.com/groups/e27co/permalink/886904662065955/\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">FB community</a>, or like the <b >e27</b> <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://www.facebook.com/e27/?ref=your_pages\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.facebook.com/e27/?ref=your_pages\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">Facebook page</a></p>\n<p>Image credit: 123rf-<a class=\"ImageDetails__information--link\" rel=\"follow\" href=\"https://www.123rf.com/profile_doucefleur\">doucefleur</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/how-technology-has-revolutionised-operational-efficiency-in-consumer-finance-20221026/\">How technology has revolutionised operational efficiency in consumer finance</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}