{
  "title": "Daniel Jenatsch: The Close World (Ellipses)",
  "itunes:author": "Liquid Architecture",
  "itunes:subtitle": "Ellipses",
  "itunes:summary": "The object of the ellipse within science fiction offers numerous ways to reimagine temporarily outside of the confines of linear progress. Ellipses: Part One: Time Knots encourages us to imagine a more blended temporarily and perhaps to even actualise new times.\n\nDaniel Jenatsch talks through the expansion of his universe ‘The Close World’; the affects of working with the program GPT-3 to generate dialogue; and his relationship to science fiction.\n\nDaniel Jenatsch combines hyper-detailed soundscapes, music and video to create multimedia documentaries, installations, radio pieces, and performances. Reaching back into the research of a now little known Professor William A. (Bill) Martin, a computer scientist who worked on early natural language processing at MIT in the 1970s called OWL (One World Language), Daniel Jenatsch has expanded his universe of The Close World. OWL was based on the philosopher Wittgenstein’s theory of knowledge that the meaning of any concept in language is linked to the totality of all other concepts. A singular and mysterious figure in computer programming, Jenatsch reformulates some of Martin’s methods, presenting a creative fiction about Martin as a traveller between this world and the establishment of OWL, and The Close World. Written in collaboration with an AI trained by Jenatsch, the methods of production of this work become a form of time travel, blurring artistic, scientific, artificial and historical voices.\n\nhttps://disclaimer.org.au/contents/ellipses-br-returning-to-time-knots-br-and-techno-utopias/daniel-jenatsch\n\nImage: Daniel Jenatsch\n\nProduced by Mara Schwerdtfeger. \n\nFinancial support from patrons at any level has a resounding impact on our work. You can support Liquid Architecture’s weekly podcast and our online journal Disclaimer, for new thinking and writing on listening and sound through a Patreon subscription, for as little as $5 a month. \n\nhttps://www.patreon.com/liquidarchitecture\n\nFor the past 20 years, Liquid Architecture has been Australia’s leading organisation for artists working with sound and listening. LA investigates the sounds themselves, but also the ideas communicated about, and the meaning of, sound and listening.\n\nhttps://liquidarchitecture.org.au/",
  "itunes:image": "",
  "enclosure": "",
  "guid": "https://liquidarchitecture.org.au/podcast/daniel-jenatsch-the-close-world-ellipses",
  "pubDate": "Tue, 01 Nov 2022 08:00:00 +1100",
  "itunes:duration": "16:41",
  "itunes:explicit": "no"
}