{
  "title": "TU50:  The Psychology of an Entrepreneur -Surprising Insights with Guest Krisztina ‘Z’ Holly",
  "link": "https://therapistuncensored.com/episodes/tu50-the-psychology-of-an-entrepreneur-surprising-insights-with-guest-krisztina-z-holly/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu50-the-psychology-of-an-entrepreneur-surprising-insights-with-guest-krisztina-z-holly",
  "pubDate": "Thu, 07 Dec 2017 11:30:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=5767",
  "description": "Learn what goes on inside the mind of a successful entrepreneur and bring to life your own dormant projects!\n\nKristina ‘Z’ Holly, curator and host of first ever TEDx, as well as the founder of the podcast, “The Art of Manufacturing,” joins our own Dr. Ann Kelley to delve into the mind and personality of an entrepreneur. Through her podcast, Z speaks in-depth with inspiring and successful entrepreneurs and shares wisdom and insights about this population. Discover how risk, reasoning, and cognitive biases work towards entrepreneurial decision-making. The benefits of gaining the resilience that comes after failure is discussed, as well as how to use extroversion and open-mindedness to actually increase your own “luck” and ability to actualize your ideas.\n\nKrisztina ‘Z’ Holly is a MIT-trained engineer, tech entrepreneur and startup wizard. She has served as Vice Provost for Innovation at USC and has been an advisor to dozens of companies and organizations, including the World Economic Forum and the Obama Administration.  In addition to her podcast, Z is also the Founder and Chief Instigator for LA Mayor Garcetti’s MAKE IT IN LA initiative.\n\n0:00-15:00\n\nPersonalities of Entrepreneurs\n\nEffectual Reasoning, Risk Taking, Cognitive Biases\n\nStereotype of power and selfishness, versus the drive to make a positive impact as an entrepreneur, specific examples\n\nAverage age of entrepreneur is 40s, not 20s.\n\n15:00-30:00\n\nImportance of partnerships and interdependence\n\nStarting TEDx\n\nKey to making impact sometimes is to recognize what you’re willing to give up\n\nRisk Taking & Risk Aversion\n\nComparison of entrepreneurs and parents\n\n“Trough of Sorrow”\n\nWorking in groups to start projects are more likely to be successful (up to 5)\n\nHolding the mission above the brand, entrepreneurship as a helping profession\n\n30:00-45:00\n\nUsing importance of mission to counteract knee jerk human reaction to take ownership\n\nHow does entrepreneur personality play out in relationships?\n\nExamples of entrepreneurs who are driven by fanaticism\n\nSense of responsibility for business comparable to that of parent for child\n\nReality of what it takes to be an entrepreneur\n\nDrive for money versus something more\n\nLearning from failure vs. learning from success. Learn from resilience after failure, not failure itself.\n\nPush comfort zone every day.\n\n45:00-55:00\n\nDifferent types of entrepreneur personalities?\n\nInternal locus of control in entrepreneur\n\nRichard Weisman luck study – you can cultivate your own luck through openness to experience and extroversion. Those self-described as lucky were much more likely to get answer correctly (they were open to new information and new input). Entrepreneurs fit into category of those who make their own luck. Internal locus of control about affecting world if you intake its information.\n\nEntrepreneurs have world view in a way that they can affect the world.\n\nWrap Up & Outro\n\n \n\nResources for this episode:\n\nThe Art of Manufacturing Podcast\n\nMAKE IT IN LA\n\nRichard Wiseman, The Luck Factor, Skeptical Inquirer, May/June 2003\n\n6 Key Qualities for Entrepreneurs.\n\n5 Biggest Hurdles to Entrenpreneurship\n\nOUR PACKED RESOURCE PAGE IN GENERAL CLICK HERE! \n\nHeads up for our listeners who love to keep on learning all kinds of cool useful not fluffy stuff!\n\nLike this and want to hear more?  Join our email list here, subscribe to Tunes here or sign up for the waiting list for our free online course on Modern Adult Attachment here! We may read your review on air, please rate and review us on your favorite podcast player, it helps so much!!\n\nFinally – this is the easiest of all – “Like” our public Facebook page here to get updated popular articles on these subjects of interest.\n\nSlots available for our online reading group for Attachment Disturbances in Adults, Comprehensive Treatment and Repair by David Brown and David Elliott. See Dr.",
  "enclosure": "",
  "itunes:subtitle": "Learn what goes on inside the mind of a successful entrepreneur and bring to life your own dormant projects! - Kristina ‘Z’ Holly, curator and host of first ever TEDx, as well as the founder of the podcast, “The Art of Manufacturing,",
  "itunes:summary": "Get your own dormant entrepreneur excited with this podcast, which delves into the psychology of these successful leaders.  Also find out how to increase the \"luck\" factor in getting your goals accomplished.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW, CGP",
  "itunes:image": "",
  "itunes:duration": "52:52"
}