{
  "title": "Josh and Jacob Wolf Share a Rumor About How Larry the Cable Guy Got His Start",
  "description": "<p>- Josh Wolf and his son, Jacob Wolf, talk about Josh airing out all of Jacob’s most embarrassing moments growing up, how embarrassment is a made up concept, roast battles with the Gronkowski's, and much more\n- Feits’ parents are giving him self help books…. for children in hopes that SOMETHING will help\n- KFC is happy again now that the Yankees season has ended\n- Alec Baldwin posted an extremely tone deaf photo of Halyna Hutchins\n- Start planning funeral services for Tom Brady because he is looking ill\n- Wisconsin Women's volleyball team had their nudes leaked\n- Iranian government came for Iranian rock climber after not wearing Hijab\n- Video Voicemials\n               - custom license plates\n               - coincidences / 6 degrees of separation\n\n++++++++++++++++++++++++\n\nTimecodes:\n0:00 - Feit's parents give him self help books\n10:09 - Yankees are done\n23:08 - Alec Baldwin's tone deaf post\n26:49 - Tom Brady looks like he's going through it\n35:06 - Wisconsin women's vball team n*des\n37:49 - Iranian Rock Climber without Hijab\n42:26 - Josh and Jacob Wolf Interview\n02:04:42 - Video Voicemails\n\n++++++++++++++++++++++++\n\nGametime:\nDownload the Gametime app and redeem code KFC for $20 off your first purchase (terms apply).\n\nWhistlepig:\nStay tuned for more on how and when to buy our KFC Barrel\n\nSimplisafe:\nGet 40% off your order at https://barstool.link/Simplisafekfc\n\nBlue Nile:\nGo to https://barstool.link/bluenileBSS and use code KEVIN to save $50 on your purchase of $500 or more\n\nThursday Boots:\nGo to https://barstool.link/ThursdaybootsKFC and try a pair today with free shipping & free returns</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/kfcr\">barstool.link/kfcr</a></p>",
  "guid": "f739998d-acd5-4fa2-a1d7-2764530a14c3",
  "pubDate": "Tue, 25 Oct 2022 10:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/kfc-radio",
  "itunes:explicit": "yes",
  "itunes:duration": "02:18:39",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}