{
  "title": "We can no longer adopt a cookie-cutter approach to marketing: Gunalan Ram of CINNOX",
  "link": "https://e27.co/we-can-no-longer-adopt-a-cookie-cutter-approach-to-marketing-gunalan-ram-of-cinnox-20221103/",
  "dc:creator": "Manisha Maity",
  "pubDate": "Thu, 03 Nov 2022 08:30:30 +0000",
  "category": [
    "Community",
    "People",
    "Productivity & Culture",
    "CINNOX Asia Pacific"
  ],
  "guid": "https://e27.co/?p=475658",
  "description": "<p>At e27, we have kickstarted a new articles series called work-life balance to learn more about tech enablers and executives and their lives beyond working hours. Gunalan Ram is a marketing strategy leader with over 20 years of experience across project management, consulting, account strategy, and customer success encompassing multiple sectors and functions.  He currently leads [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/we-can-no-longer-adopt-a-cookie-cutter-approach-to-marketing-gunalan-ram-of-cinnox-20221103/\">We can no longer adopt a cookie-cutter approach to marketing: Gunalan Ram of CINNOX</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<img loading=\"lazy\" class=\"aligncenter wp-image-475671 size-full\" src=\"https://e27.co/wp-content/uploads/2022/11/gunalan.png\" alt=\"\" width=\"690\" height=\"390\" />\n<p><em><span >At </span></em><strong><em><span >e27</span></em></strong><em><span >, we have kickstarted a new articles series called work-life balance to learn more about tech enablers and executives and their lives beyond working hours.</span></em></p>\n<p><span >Gunalan Ram is a marketing strategy leader with over 20 years of experience across project management, consulting, account strategy, and customer success encompassing multiple sectors and functions. </span></p>\n<p><span >He currently leads the influencer marketing and marketing strategy practice at CINNOX, a total experience platform that empowers team members and delivers an omnichannel experience to customers.</span></p>\n<p><span >He is a regular contributor of articles for </span><strong><span >e27</span></strong><span > (you can read his thought leadership articles </span><a class=\"editor-rtfLink\" rel=\"follow\" href=\"https://e27.co/user/gunalan.ram/\" target=\"_blank\" rel=\"noopener\"><span >here</span></a><span >). </span></p>\n<p><span >In this candid interview, Ram talks about her personal and professional life.</span></p>\n<h1><span >How would you explain what you do to a five-year-old?</span></h1>\n<p><span >When five-year-olds visit Toys R Us, they are greeted by a breathtaking view of toys, games and educational products. Like how the kids enjoy personalised experiences through open play areas, interactive displays and spaces for special events and birthday parties, giving the kid a sense of joy and engagement.</span></p>\n<p><span >This is what I do. I&#8217;m part of the marketing team, driving the marketing strategy of CINNOX. I help businesses build better relationships with their customers through personalised interactions.</span></p>\n<h2><span >What has been the biggest highlight/challenge of your career so far?</span></h2>\n<p><span >I must admit there were many challenges in my career. But through challenges, there lie opportunities as well. For every job I have taken up, I learned the art of executing tasks through teamwork and guided decision-making.</span></p>\n<p><span >I consider all work success as my highlights. I prefer not to single out any one of them. As long as I&#8217;ve displayed a strong commitment to the task and provided value to the other party, I consider that an achievement. </span></p>\n<p><span >Highlights could also be seen in forming good relationships with your team members and stakeholders.</span></p>\n<p><strong><span >Also Read: </span></strong><a class=\"editor-rtfLink\" rel=\"follow\" href=\"https://e27.co/dream-loud-dream-big-and-dream-now-surbhi-agarwal-of-yellow-ai-20221027/\" target=\"_blank\" rel=\"noopener\"><strong><span >Dream loud, dream big and dream now: Surbhi Agarwal of Yellow.ai</span></strong></a></p>\n<p><span >For now, I&#8217;m learning and soaking in my role as a Strategic Marketeer at </span><span >CINNOX. The biggest challenge in this job is not the product but the chaotic marketplace itself. Information overload leaves people confused and unable to reach any decision. How do I overcome or differentiate my point of view in such a cluttered scenario?</span></p>\n<h2><span >How do you envision the next five years of your career?</span></h2>\n<p><span >I don&#8217;t have a mystic crystal ball, so I can&#8217;t predict the future. We are living in a world that moves and changes so rapidly. What excites me is I am constantly challenged with new things to learn in my current position.</span></p>\n<p><span >We can no longer adopt a cookie-cutter approach. Marketing has evolved so much over the years, from traditional to digital. Digital marketing is an entirely different beast from traditional one. As I&#8217;m already in my mid-40s, I hope to press on learning and strategising the best way to reach the audience.</span></p>\n<p><span >That said, I&#8217;m very fortunate to discover CINNOX. The solution is not just a unified platform that helps employees and customers but an ecosystem for a user journey, be it a startup to an enterprise.</span></p>\n<p><span >The platform&#8217;s capabilities constantly keep me wanting to have a deep understanding of the business. I always believe that the more you understand how a company and product are positioned, the more valuable asset you will be. This is not just for a marketer but for anyone.</span></p>\n<p><span >So at least for the next few years, I hope to build trust and reputation for the brand.</span></p>\n<h2><span >What&#8217;s something about you or your job that would surprise us?</span></h2>\n<p><span >My first job after my National Service lasted 15 years. I lived in a bubble, never getting out to venture into other domains.</span></p>\n<p><span >In the company name CINNOX, if you take the first and last letters, CX = Customer Experience. The middle four letters, INNO = Innovation.</span></p>\n<p><span >Though we are a startup launched in 2020, our parent company M800 was founded by a group of telecommunication pioneers in 2007 with a vision to revolutionise global communications.</span></p>\n<h2><span >What are some of your favourite work tools?</span></h2>\n<p><span >I love working on Google Workspace, though I don&#8217;t use them in my current work. We use M365 a lot to get our work done.</span></p>\n<p><span >In my previous job, I used Jira for product development. I dabbled with project management tools like Trello and Miro occasionally, and I enjoyed the latter because of its visual strategy mapping.</span></p>\n<p><span >For team collaboration and communication, it&#8217;s none other than our brand, CINNOX. I can use it to chat and voice/video-call my team members. Share and screen share our projects.</span></p>\n<h2><span >Do you prefer WFH or WFO, or hybrid?</span></h2>\n<p><span >I prefer a hybrid approach as it gives more freedom and autonomy. This enables me to fit my work and life together, reduces stress and helps prevent burnout.</span></p>\n<p><span >Sometimes, it is healthy to see your colleagues at the workplace and talk about work and other matters outside of work. It helps to understand each other better, strengthens relationships, and improves communication. Going out for lunch or even a drink after work encourages team bonding.</span></p>\n<p><strong><span >Also Read: </span></strong><a class=\"editor-rtfLink\" rel=\"follow\" href=\"https://e27.co/dont-chase-titles-chase-curiosity-and-let-it-lead-you-bernadette-cho-of-entrepreneur-first-20221017/\" target=\"_blank\" rel=\"noopener\"><strong><span >&#8216;Don&#8217;t chase titles; chase curiosity and let it lead you&#8217;: Bernadette Cho of Entrepreneur First</span></strong></a></p>\n<p><span >That said, I&#8217;m a remote worker based in Singapore. CINNOX is headquartered in Hong Kong. As such, I work from anywhere (WFA) because our platform enables us to work entirely online.</span></p>\n<p><span >The only advice I would probably give is to try to have more human interaction to foster mental well-being. This will strengthen the connections that make teams thrive.</span></p>\n<h2><span >What would you tell your younger self?</span></h2>\n<p><span >Always be open to learning. Every day is a learning journey. If there is an opportunity to travel, go for it. Learn new cultures and meet people. The most important thing is not to underestimate anyone.</span></p>\n<h2><span >Can you describe yourself in three words?</span></h2>\n<p><span >Passionate, trustworthy and curious.</span></p>\n<h2><span >What are you most likely to be doing if not working?</span></h2>\n<p><span >Binge-watching on Netflix, Prime, and Disney with my teenage children, I go shopping with my wife (reluctantly, lol), work out at the gym, and spend time with friends.</span></p>\n<h2><span >What are you currently reading/listening to/watching?</span></h2>\n<p><span >I&#8217;m always on Spotify when I work—listening to jazz, classical, and instrumental beats. Something to keep me calm, focused, and think better.</span></p>\n<p><span >I like reading novels, and they must have an interesting start, or I&#8217;ll get bored quite easily. Recently I&#8217;ve been reading some non-fiction/self-help books. I just finished with </span><em><span >The Art of Thinking Clearly</span></em><span > by Rolf Dobelli. It&#8217;s a psychology-based book for anyone who wants to make better decisions in life.</span></p>\n<p><span >I love watching movies, any kind, as long as the story is good. Sci-fi, suspense, thriller, hero saves the world, comedy, documentary, reality, etc. Recently, I finished watching </span><em><span >Stranger Things</span></em><span > with my kids and was blown away by the creativity of the storyline. Currently, I&#8217;m watching </span><em><span >Somebody Feed Phil</span></em><span >, Season 6, a popular food and travel series by Phil Rosenthal.</span></p>\n<p><span >&#8211;</span></p>\n<p>Be a part of the <strong>e27</strong> contributor community of thought leaders and share your opinion by <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://e27.co/contributor\" target=\"_blank\" rel=\"follow noopener\" data-stringify-link=\"https://e27.co/contributor\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" >submitting</a> an article, video, podcast, or infographic</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/we-can-no-longer-adopt-a-cookie-cutter-approach-to-marketing-gunalan-ram-of-cinnox-20221103/\">We can no longer adopt a cookie-cutter approach to marketing: Gunalan Ram of CINNOX</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "enclosure": ""
}