{
  "title": "Imran’s bid to split Pakistan army from its intelligence wing likely to boomerang",
  "link": "https://newsin.asia/imrans-bid-to-split-pakistan-army-from-its-intelligence-wing-likely-to-boomerang/",
  "comments": "https://newsin.asia/imrans-bid-to-split-pakistan-army-from-its-intelligence-wing-likely-to-boomerang/#respond",
  "dc:creator": "Editor",
  "pubDate": "Sat, 05 Nov 2022 08:49:10 +0000",
  "category": [
    "Pakistan",
    "Politics",
    "Security",
    "Top Story"
  ],
  "guid": "https://newsin.asia/?p=78951",
  "description": "<p>The battle is now not between Imran and the Shehbaz Sharif regime but between Imran and the all-powerful army.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://newsin.asia/imrans-bid-to-split-pakistan-army-from-its-intelligence-wing-likely-to-boomerang/\">Imran’s bid to split Pakistan army from its intelligence wing likely to boomerang  </a> appeared first on <a rel=\"nofollow\" href=\"https://newsin.asia\">NewsIn.Asia</a>.</p>\n",
  "content:encoded": "\n<p>By P.K.Balachandran</p>\n\n\n\n<p>Colombo, November 5 (newsin.asia): Imran Khan, the Supremo of the opposition Pakistan Tehreek-e-Insaaf (PTI) party, who was injured in an assassination bid at a public rally in Wazirabad on Thursday, has accused a senior officer of the Inter-Services Intelligence (ISI) Maj.Gen.Faisal of being part of a three-man group that allegedly plotted to assassinate him for “blasphemy.” &nbsp;</p>\n\n\n\n<p>Imran charged that the plotters were trying to replicate the way in which Punjab Provincial Governor Salman Taseer was assassinated in 2011 for opposing blasphemy laws. In Pakistan, blasphemy against Islam carries the death sentence.</p>\n\n\n\n<p>By making such an allegation against an army officer, Imran had taken the unprecedented step of accusing the Pakistan army of indulging in an assassination bid to settle scores with a political leader.</p>\n\n\n\n<p>This has put the army as a whole in an extremely tight spot from which it has get out.</p>\n\n\n\n<p>Imran did make a bid to distinguish the main body of the army from its intelligence wing, the ISI. He said that the country needs the army to maintain security but it has within it “black sheep” which it has to weed out. He appealed to the army Chief Gen.Qmar Javed Bajwa to “weed out the black sheep”. He demanded the resignation of the conspirators who he had identified as Prime Minister Shehbaz Sharif, Interior Minister Rana Sanaulah and Maj.Gen.Faisal. &nbsp;</p>\n\n\n\n<p>While Sharif and Sanaullah have ridiculed the demand,&nbsp; the army has denied involvement in the alleged plot and put out a very strong statement against the mud-slinging. According to <em>Wall Street Journal</em>, the army said in a statement on Friday, that it had requested the government to “initiate legal action for defamation and false accusations.”</p>\n\n\n\n<p>The statement warned: “If the honor, safety and prestige of its rank and file is being tarnished by vested interests through frivolous allegations, the institution will jealously safeguard its officers and soldiers no matter what. No one will be allowed to defame the institution or its soldiers with impunity.”</p>\n\n\n\n<p>The conclusion is inescapable: Imran is on a collision course with Pakistan’s most powerful and entrenched institution, the army. In fact, it is the only organization that is designated as an “institution” in Pakistan.  It is popularly known as the “Establishment,” a superior and permanent status. Political parties and civilian leaders are just flotsam and jetsam of no consequence.  </p>\n\n\n\n<p>However, while accusing Maj.Gen.Faisal of plotting with Prime Minister Shehbaz Sharif and Interior Minister Rana Sanaullah, Imran had made it a point to stress that the main body of the army was not part of the plot. He appealed to Army Chief Gen.Qamar Javed Bajwa to weed out the “black sheep” in the organization for the sake of the army’s image and reputation.</p>\n\n\n\n<p>But the army will not accept a distinction between the main body and the ISI and will consider it a grave offense to even hint at such a distinction.</p>\n\n\n\n<p>The ISI has been seen in bad light recently over the killing of leading TV anchor Arshad Sharif in Kenya in October. Although the Kenyan police said that it was due to mistaken identity, there were strong rumors in Pakistan that it was an ISI job. The ISI chief had to take the unprecedented step of holding a press conference to deny involvement. In that presser, the ISI said that Imran had been secretly suggesting a deal for army support to oust the Sharif government.&nbsp;</p>\n\n\n\n<p>There are reasons to believe in ISI’s contention because Imran had also been asking the army chief to shed his neutrality in the ongoing fight between him and Prime Minister Sharif. His plea has been that only animals can be neutral as they do not know the difference between right and wrong, moral and immoral.</p>\n\n\n\n<p>Imran reiterated the demand for the army’s support in his video address to the nation on Friday. He said that the army’s support is necessary to ensure the security of the country. But spoilt his case by adding that the army cannot bring about national unity which could be done only by political parties. The army could only render help, he explained.</p>\n\n\n\n<p>Imran then went on to illustrate his point by recalling the secession of East Pakistan and the formation of an independent Bangladesh in 1971. He said that the very pro-Pakistani people of East Pakistan were forced to seek secession because the political parties of West Pakistan had denied East Pakistanis the fruits of their stunning election victory. They had been denied political justice, Imran said. The army had acted at the behest of the then-civilian leaders.    </p>\n\n\n\n<p>Imran has actually been blowing hot and cold on the army’s role in Pakistan. It is widely believed that he was pitchforked into power in 2018 by the army, which at that time, was at odds with the then Prime Minister Nawaz Sharif, bother of the present Prime Minister Shehbaz Sharif. When Imran became PM, he was dubbed the “selected” Prime Minister and not an “elected” PM. However, when Imran tried to be his own man as PM and refused to toe the army line on key economic and foreign policy matters, he was ousted again, allegedly by the machinations of the army in cahoots with Shehbaz Sharif.</p>\n\n\n\n<p>After being thrown out, in his fight back to come to power through street action, marches and sit-ins in the national capital, Imran started appealing to the army to abandon Sharif and help him oust the “bunch of thieves” in power. He criticized army chief Gen. Bajwa for declaring the army as a neutral institution and insisted that the nation’s security (that the army is there to ensure) could not be guaranteed in the absence of justice and the rule of law. These could not be ensured, he said,  when the government is the hands of thieves (60% of the present ruling party legislators are on bail in corruption cases he pointed out in his TV address).</p>\n\n\n\n<p>Vowing to continue the agitation against the Sharif regime, despite his injuries, Imran said: “I want you to come out to protest on the streets until these three (Sharif, Sanaullah and Maj.Gen. Faisal) resign. Your religion requires you to stand against injustice.”</p>\n\n\n\n<p>There are fears of nationwide clashes between Imran’s supporters and the authorities, as Pakistan struggles to tackle an economic tailspin and recover from catastrophic floods this summer, <em>Wall Street Journal</em> noted.</p>\n\n\n\n<p>“Despite the government’s repeated rebuttals of Mr. Khan’s allegations, the claim is likely to carry weight with supporters of Mr. Khan who have turned out at rallies over months to hear his fiery speeches. Mr. Khan also said Friday that the country is in danger of sinking into chaos because authorities aren’t allowing democratic politics to take their own course,” <em>WSJ</em> said.</p>\n\n\n\n<p>Opinion in Pakistan is divided on what could happen in the coming weeks. The question is: Can Imran keep whipping up a public frenzy? If the Sharif government is unable to handle it, would the army shed its reserve and takeover?</p>\n\n\n\n<p>Some like Najam Sethi, editor of <em>Friday Times</em> say an army takeover cannot be ruled out because of past experience. Others say that the army will prevail even without an outright takeover. A former Pakistani diplomat said that Imran’s aggressive movement is already losing steam. “The Long March has been attracting less and less people because people are suffering from political fatigue. They are more concerned about rising prices than changing a government,” he said.</p>\n\n\n\n<p>END&nbsp;&nbsp;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://newsin.asia/imrans-bid-to-split-pakistan-army-from-its-intelligence-wing-likely-to-boomerang/\">Imran’s bid to split Pakistan army from its intelligence wing likely to boomerang  </a> appeared first on <a rel=\"nofollow\" href=\"https://newsin.asia\">NewsIn.Asia</a>.</p>\n",
  "wfw:commentRss": "https://newsin.asia/imrans-bid-to-split-pakistan-army-from-its-intelligence-wing-likely-to-boomerang/feed/",
  "slash:comments": 0
}