{
  "title": "S1E69 - How to Effectively Implement Visualization with Our Host Laura Wilkinson",
  "guid": "https://pinecast.com/guid/25b64a76-24ef-4420-bd2c-c5af8a1df35a",
  "pubDate": "Thu, 13 Oct 2022 07:30:00 -0000",
  "itunes:duration": "00:35:09",
  "description": "<p>On today’s episode, Laura’s talking about one of the things she gets asked about most frequently: visualization. Laura credits this technique as a big part of why she was able to make the Olympic team and win gold when no one else expected her to. Having seen other athletes succeed with this approach, she adopted it as a way to continue training after shattering her foot three months before the Olympic Trials, making an opportunity out of that forced sidelining. Visualization has remained part of Laura’s personal toolset, and she uses that experience in this episode to explain what the technique is and walk us through how to get started visualizing in a way that will actually make a difference.</p>\n<p>Visualization is defined as purposely rehearsing a skill, routine, or performance in your mind to program your body physically for success. Practicing it consistently becomes a fortifying competition strategy, rewiring your brain to prepare it to deal with all the different factors that come into play while competing. Laura explains that there are a few different ways to visualize, including first and third-person versions, which contribute different effects and should be used in conjunction with each other. She also points out the importance of engaging all your senses while visualizing to better immerse your brain and make changes more easily. Laura then shares some how-to basics for those wishing to start visualizing, from giving yourself a set amount of time to practice, to making sure you have a quiet place to visualize in, and starting with the approach that comes most naturally to you. And finally, Laura finishes the episode with some tips and tricks for beginners, including practicing frequently and consistently, mixing things up every day, and using video study to enhance your visualization.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>Laura’s personal experience with visualization</li>\n<li>What visualization is</li>\n<li>Types and elements of visualization</li>\n<li>How-to visualizing basics</li>\n<li>Tips and tricks for getting started with visualization</li>\n</ul>\n<p>Quotes:</p>\n<ul>\n<li>“When I burst onto the scene winning an unexpected Olympic victory—well, unexpected to everyone else—the story that was being told was centered around me having shattered my foot before the Olympic trials and being unable to physically train. So I visualized, and that not only helped me make the Olympic team, but I consider it a big part of the reason that I was able to stand atop the podium and listen to my national anthem play.”</li>\n<li>“The more senses that you engage, the more your mind starts to believe that you’re really doing the activity. You’re actively rewiring your brain on how to fire and react when you’re doing specific movements and techniques. So the more real it is to you, the more real it is to your brain, and the more effective changes you can actually make.”</li>\n<li>“People say practice makes perfect, but really, practice makes permanent. So if you’re practicing or thinking about or visualizing the wrong actions, that’s what you are making into concrete in your brain. So you really want to make sure, as you’re visualizing, that you take the time to think about doing all the things, all the tiny, little details, correct because that’s what you are programming in your brain.”</li>\n<li>“These visualizations of the competition scenarios, it just allows you to put yourself in so many different situations that maybe you don’t have the actual time to be going out and doing the thirty different competitions against the same people to see how you would stack up in different scenarios. But you can do that in your mind.”</li>\n<li>“Make sure that you’re keeping this positive. This is not a place to beat yourself up or to get frustrated. This is a place to learn, to experiment, and to see yourself doing all these awesome and amazing things that you’ve dreamed of doing.”</li>\n</ul>\n<p><a href=\"https://www.kaatsu.com/go/PURSUIT\" rel=\"nofollow\">Pursuit of Gold Podcast is brought to you by Kaatsu Global</a></p>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold</a>\n<a href=\"https://laurawilkinson.com/coaching\" rel=\"nofollow\">1-on-1 Coaching with Laura</a>\n<a href=\"https://www.laurawilkinson.com/journal\" rel=\"nofollow\">The Confidence Journal</a>\n<a href=\"https://laurawilkinson.com/book\" rel=\"nofollow\">Life at 10 Meters: Lessons from an Olympic Champion</a></p>\n<p>Laura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura’s Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura’s Facebook</a></p>",
  "itunes:title": "How to Effectively Implement Visualization with Our Host Laura Wilkinson",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 69
}