{
  "title": "Episode 95 (video): Mnemonics Advanced: The Pegword System Part 1",
  "pubDate": "Mon, 25 May 2009 13:43:55 +0000",
  "guid": "episode-95-video-mnemonics-advanced-the-pegwor",
  "link": "http://www.thepsychfiles.com/2009/05/25/episode-95-video-mnemonics-advanced-the-pegword-system-part-1/",
  "itunes:image": "",
  "description": "Did you know there's a mnemonic device that is more powerful than the  One is a bun pegword mnemonic?  Here's a system you can use for lists that have more than 12 items.  In this video I show you the advanced pegword mnemonic system in which every number becomes a letter and a concrete word that you can visualize to help you remember a list of any length.  See how to put mental imagery and your memory to work in this video.",
  "content:encoded": "Did you know there's a mnemonic device that is more powerful than the  One is a bun pegword mnemonic?  Here's a system you can use for lists that have more than 12 items.  In this video I show you the advanced pegword mnemonic system in which every number becomes a letter and a concrete word that you can visualize to help you remember a list of any length.  See how to put mental imagery and your memory to work in this video.",
  "enclosure": "",
  "itunes:duration": "18:39",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology,lecture,mnemonics",
  "itunes:subtitle": "Did you know there's a mnemonic device that is more powerful than the One is a bun pegword mnemonic? Here's a system you can use for lists that have more than 12 items. See how to put mental imagery and your memory to work in this video.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Did you know there's a mnemonic device that is more powerful than the One is a bun pegword mnemonic? Here's a system you can use for lists that have more than 12 items. In this video I show you the advanced pegword mnemonic system in which every number becomes a letter and a concrete word that you can visualize to help you remember a list of any length. See how to put mental imagery and your memory to work in this video."
}