{
  "title": "536: Evanna Lynch discusses 'The Opposite of Butterfly Hunting'",
  "link": "https://audioboom.com/posts/7966886",
  "itunes:episode": 536,
  "itunes:title": "Evanna Lynch discusses 'The Opposite of Butterfly Hunting'",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3289,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode, long time friend of the show Evanna Lynch joins us to discuss her new book, <a href=\"https://www.penguinrandomhouse.com/books/677563/the-opposite-of-butterfly-hunting-by-evanna-lynch/\">The Opposite of Butterfly Hunting</a>. She talks about the challenges in writing her memoir and the hosts ask her about her experiences as a newly published author. Her book chronicles a struggle with mental illness and an eating disorder, as well as her correspondence with JK Rowling via letters, years before she was cast as Luna Lovegood. Evanna was kind to answer all of our questions and give us her time. This is one episode you won't want to miss!<br>\n<br>\n\n</div>\n<ul>\n<li>Evanna Lynch returns to MuggleCast, a newly published author!</li>\n<li>Her book, <em>The Opposite of Butterfly Hunting </em>is a deeply moving, at times comical and mostly challenging tale of her struggles with an eating disorder while she was growing up.</li>\n<li>The hosts take turns asking Evanna questions both about her book, and some of the surprising stories found within.</li>\n<li>Evanna details why she was inspired to write <em>Butterfly Hunting...</em> and how she managed to remember so many details from when she was eleven.</li>\n<li>What lessons and messages can readers hope to get from the book?</li>\n<li>Laura asks Evanna what she would say to her younger self, and Evanna replies gravely and honestly.</li>\n<li>The interview touches on Evanna's early correspondence with J.K. Rowling via letter. What made her reach out?</li>\n<li>The reasons Evanna is connected to the character of Luna.</li>\n<li>Evanna recounts her transition from everyday Harry Potter super-fan to friend and colleague of the cast, and how strange it was to get used to.</li>\n<li>Finally, what does the title of the book mean? And how did becoming a vegan change Evanna's way of seeing the world?</li>\n<li>MuggleCast recently was on Evanna's <a href=\"https://www.thechickpeeps.com/episodes/2021/3/10/s3-ep22-chickpeeps-x-mugglecast-crossover\">The ChickPeeps podcast</a>, and we had a great time.</li>\n<li>Evanna leaves us with a story of walking into bookstores to sign copies of her book, and what it was like to record the audiobook.</li>\n<li>Quizzitch: What is Aragog's wife's name?? <a href=\"https://www.mugglecast.com/quizzitch/\">Submit your answer</a>!</li>\n<li>This week’s episode is brought to you by BetterHelp. Get 10% off your first month of therapy at <a href=\"http://www.BetterHelp.com/mugglecast\">BetterHelp.com/mugglecast</a>!</li>\n</ul>\n",
  "pubDate": "Tue, 26 Oct 2021 08:00:00 +0000",
  "guid": "tag:audioboom.com,2021-10-25:/posts/7966886",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}