{
  "id": "https://bibleinoneyear.org/en/youth/274",
  "title": "Day 274: How to Be a Blessing Machine",
  "description": "Psalm 115:12-18, Jeremiah 4:1-2, Philippians 2:12–30.  That is exactly what we as Christians are called to be, as the church and as individuals  You really can be a blessing machine",
  "pubDate": "Fri, 01 Oct 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/274/?ignore",
  "itunes:duration": "13:53",
  "guid": "enyouth01102021-274",
  "length": 833.04,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 274: How to Be a Blessing Machine",
  "itunes:subtitle": "Psalm 115:12-18, Jeremiah 4:1-2, Philippians 2:12–30.  That is exactly what we as Christians are called to be, as the church and as individuals  You really can be a blessing machine",
  "itunes:summary": "Do you ever wonder whether you can make a difference to the lives of those around you?\nI once watched an episode of the reality TV Show, The Secret Millionaire. Kevin Green – a covert multi-millionaire – searched for people and causes that would benefit from his financial support. He gave about $100,000 to a range of people working with the homeless, teenage addicts and disabled children. The response of all these people was deeply moving. They were so grateful, and the causes that they work for benefited greatly. They were blessed and enabled to bring greater blessing to others.\nHowever, the most interesting aspect of the programme was the change in Kevin Green. He had experienced in a new way the joy of blessing others. His life was changed as a result. The words of Jesus are true: ‘It is more blessed to give than to receive’ (Acts 20:35).\nArchie Coates, vicar of Holy Trinity Brompton, speaks of the church as a ‘blessing machine’. That is exactly what we as Christians are called to be, as the church and as individuals. You really can be a blessing machine.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 274
}