{
  "title": "UK spies building secret ‘terror army’ in Ukraine – Grayzone",
  "link": "https://www.rt.com/news/565973-uk-spies-train-ukraine-secret-terror-army/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565973-uk-spies-train-ukraine-secret-terror-army/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6365763e85f5402edf25b0f0.jpg\" /> UK military-intelligence operatives are reportedly building a ‘terror army’ in Ukraine to attack Russian targets in Crimea <br/><a href=\"https://www.rt.com/news/565973-uk-spies-train-ukraine-secret-terror-army/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The revelation comes after Russia warned London about its level of involvement in the country</strong></p>\n            \n                        \n            <p>UK military-intelligence operatives are reportedly working to create and train a covert terrorist force in Ukraine assigned to attack Russian targets in Crimea on behalf of the Kiev government.</p>\n<p>Working through a private British intelligence services firm called Prevail Partners, the operatives signed an agreement with the Odessa branch of the Security Service of Ukraine (SSU) to build the so-called <em>&ldquo;partisan&rdquo;</em> terror army, <a href=\"https://thegrayzone.com/2022/11/03/british-spies-terror-army-ukraine/\" target=\"_blank\" rel=\"noopener noreferrer\">The Grayzone</a> reported on Thursday, citing leaked documents detailing the plans. The work is conducted in close coordination with the SSU and is possibly funded at least partly by Ukrainian oligarch Andrey Sadovoy, who is the mayor of Lviv and heads the country&rsquo;s TRK Lux media company.</p>\n<p><em>&ldquo;Their plans called for the secret army to conduct sabotage and reconnaissance operations targeting Crimea &hellip; precisely the kind of attacks witnessed in past weeks,&rdquo;</em> The Grayzone wrote.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6363cbdb2030274d382f634a.jpg\" alt=\"British Ambassador Deborah Bronnert in Moscow, November 3, 2022.\" />\n            <figcaption><a href=\"https://www.rt.com/russia/565883-russia-summons-uk-ambassador/\">Russia warns UK of ‘dangerous consequences’</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Moscow has accused London of being involved in \"[the] training, preparation and [the] execution of plans against Russian infrastructure and the Russian fleet in [the] Black Sea [near Crimea].\"</p>\n<p>The UK was also allegedly implicated in the October 8 terrorist bombing that targeted the strategically-important Crimean Bridge. UK intelligence officials commissioned a study in April examining ways to blow up the bridge, The Grayzone reported last month.</p>\n<p><a href=\"https://www.rt.com/russia/565883-russia-summons-uk-ambassador/\"></a></p>\n<p>Also last month, the Kremlin accused London of orchestrating the terrorist attack that damaged the Nord Stream 2 pipeline. The UK Ministry of Defence replied that Moscow was <em>&ldquo;peddling false claims on an epic scale.&rdquo;</em></p>\n<p>Prevail, the private intelligence firm, was founded by special forces veterans, including Royal Marine Brigadier Justin Hedges. Chris Donnelly, the same British Army intelligence operative who requested the Crimean Bridge study, was among the key figures who covertly lobbied for Prevail&rsquo;s Ukrainian partisan program, The Grayzone said.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/6345b20b203027319d207c19.jpg\" alt=\"Black smoke billows from a fire on the Kerch bridge that links Crimea to Russia, after a truck exploded, near Kerch, on October 8, 2022.\" />\n            <figcaption><a href=\"https://www.rt.com/news/564495-uk-plotted-crimea-bridge-attack/\">UK intelligence plotted Crimean Bridge bombing – The Grayzone</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Initial hurdles included funding sources for the initiative and the UK government&rsquo;s reluctance to let private contractors provide the training services, <em>&ldquo;perhaps out of fear they would be caught in the act or even prosecuted for engaging in such provocative activity,&rdquo;</em> the outlet reported. Some operatives raised concerns that Prevail initially pegged the annual cost at $600,000 per partisan fighter.</p>\n<p>Training sites were lined up in Poland and Greece. Hedges said that if funding needed to be kept at arm&rsquo;s length from government sources, <em>&ldquo;donations&rdquo;</em> could be gathered through Rhizome Insights Ltd., an NGO front group for Prevail. He added that the firm was also in talks with Sadovoy&rsquo;s office about funding help.</p>\n<p></p>",
  "enclosure": "",
  "pubDate": "Fri, 04 Nov 2022 20:40:35 +0000",
  "dc:creator": "RT"
}