{
  "title": "THE VIDEOS JOSH RICHARDS DOESN’T WANT YOU TO SEE — BFFs EP. 85",
  "description": "<p>After a late guest cancellation, it’s a BFFs only episode (plus O’Malley) with Josh in person in NYC. We start the pod talking about the Johnny Depp Amber Heard trial, and are quickly sidetracked by Bri ignoring Josh’s texts because she was on shrooms all weekend. We then talk about Liam Payne going on the Impaulsive podcast in which he said he was really One Direction’s front man, his beef with Zayn Malik, and a story about an anonymous fight with a band member that was so absurd that Dave had to call Mike Maijlak live on the pod (after some technical difficulties) to ask how it was he was able to seriously interview Liam. Josh also brings up how Bryce Hall has somehow weaseled his way into wanting to box Liam, and that even Liam’s ex fiance is team Bryce. \n\n\nWe then talk Madi Monroe “exposing” a girl that was apparently trying to get with her man, but thanks to a BFFs Exclusive™ we have the full DMs from the girl in question, and after a lot of confusion and a roleplay scenario with Bri and Josh, it turns out there may be more to the story than what Madi is portraying on social media. We also talk Tana Mongeau canceling her “Canceled” podcast, Apple’s new iMessage features, the viral videos of a guy getting humiliated by his girlfriend’s hall pass and a Disney employee ruining a couples proposal. \n\n\nWe finish the podcast with the BFFs Corner where Nessa is now following Josh, Griffin lets slip that Josh and Nessa are back together, and another BFFs Exclusive™ of videos that show Josh and Nessa from the weekend in some… interesting scenarios. \n\nSupport our sponsors!\n\nGametime: Download the Gametime app at https://barstool.link/GametimeApp and redeem code BFF for $20 off your first purchase (terms apply).\n\nTakis: Find Takis on Amazon Today at https://barstool.link/BFFTakis and \"Face the Intensity\"</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/bffspod\">barstool.link/bffspod</a></p>",
  "guid": "b5c5060c-34a9-4477-967c-00ace5050155",
  "pubDate": "Thu, 9 Jun 2022 00:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/134/Bffs",
  "itunes:explicit": "yes",
  "itunes:duration": "00:47:19",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}