{
  "title": "LA County’s Failure to Invest in Alternatives to Incarceration Fuels Inhumane Jail Conditions",
  "link": "https://www.aclu.org/news/criminal-law-reform/la-countys-failure-to-invest-in-alternatives-to-incarceration-fuels-inhumane-jail-conditions",
  "pubDate": "Thu, 20 Oct 2022 14:21:42 +0000",
  "dc:creator": "Melissa Camacho-Cheung",
  "category": [
    "Criminal Law Reform",
    "Prisoners' Rights",
    "Conditions in Jails and Prisons",
    "Civil Liberties in Prison",
    "Medical and Mental Health Care",
    "Criminal Justice Reform for LGBTQ People",
    "LGBTQ Rights"
  ],
  "guid": "https://www.aclu.org/news/criminal-law-reform/la-countys-failure-to-invest-in-alternatives-to-incarceration-fuels-inhumane-jail-conditions",
  "description": "<p>Celia Banos calls her son, Jhean, a born musician. Ever since he was a little boy, Jhean loved music. He learned the guitar, and after high school, he played in a band called The Parallels. At the age of 21, Jhean had his first episode of schizophrenia.</p>\n<p>Jhean is 28 now, and — like thousands of people with serious mental illness — he cycles in and out of the Los Angeles County jail system. This cycle repeats itself because the county does not fund robust mental health services and alternatives to incarceration. Jhean’s family has tried to get him the help he needs, but they cannot find affordable, quality care for him. In moments of crisis, the family’s only option has been to call the Los Angeles Police Department.</p>\n<p>Calling the police, however, causes the family even more trauma. In one recent incident, LAPD officers tased Jhean multiple times. In another incident, Celia says the police made fun of Jhean and laughed at him.</p>\n<p>“This is someone’s son. Someone’s brother. He&#8217;s our family member, and he’s sick,” said Celia. “Being sick doesn’t mean that he is a criminal, and you have no right to laugh at someone like that, especially in front of a mother.”</p>\n\n  <div class=\"wp-sizing-container sizing--wide\">\n      <figure class=\"wp-image mb-md\">\n\t\t  <img width=\"1000\" height=\"581\" src=\"https://www.aclu.org/wp-content/uploads/2022/10/22_1001_ACLU_CeliaBanos_001.jpg\" class=\"attachment-original size-original\" alt=\"Celia Banos\" loading=\"lazy\" srcset=\"https://www.aclu.org/wp-content/uploads/2022/10/22_1001_ACLU_CeliaBanos_001.jpg 1000w, https://www.aclu.org/wp-content/uploads/2022/10/22_1001_ACLU_CeliaBanos_001-768x446.jpg 768w, https://www.aclu.org/wp-content/uploads/2022/10/22_1001_ACLU_CeliaBanos_001-400x232.jpg 400w, https://www.aclu.org/wp-content/uploads/2022/10/22_1001_ACLU_CeliaBanos_001-600x349.jpg 600w, https://www.aclu.org/wp-content/uploads/2022/10/22_1001_ACLU_CeliaBanos_001-800x465.jpg 800w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />\t\n\t\t  <figcaption class=\"wp-image__caption is-caption mt-xs\"><p>Celia Banos</p>\n</figcaption>\n\t\n\t\t  <span class=\"wp-image__credit is-credit\"><p>Credit: Tara Pixley</p>\n</span>\n\t  </figure>\n  </div>\n<p>I met Jhean and Celia over the summer while investigating conditions at the LA County jail.</p>\n<p>Every day, I get updates from the jail telling me how many people are stuck in processing at the Inmate Reception Center (IRC) for more than 24 hours.</p>\n<p>I get these updates because, since 1978, the ACLU has served as a court-appointed monitor of the LA County jail system. In that capacity, we gather information from the county and from incarcerated people in order to advocate on their behalf when jail conditions fall below basic constitutional standards of safety, hygiene and decency.</p>\n<p>Earlier this summer, one of these daily updates showed exceptionally long wait times at the IRC. On that day in June, at least 28 people had been stuck at the IRC for more than 49 hours. That same day, I went down to investigate.</p>\n<p>What I saw shook me.</p>\n<p>The IRC was filthy. My shoes stuck to the floor. Two toilets were overflowing with human waste. More than a dozen people were trying to sleep on the floor. In an area known as the “front bench,” five individuals were sitting chained to their chairs as is required. The daily report noted that two of those five had been chained to the front bench for more than 24 hours. People called out to me that they had only been given peanut butter sandwiches to eat. Others called out that they hadn’t been provided with their medication and were awaiting psychiatric evaluations.</p>\n<p>Over the next few weeks, I went back to the IRC with my ACLU colleagues to investigate the conditions, talk to people detained at the IRC, and talk to the LA County Sheriff Department’s staff about improving conditions.</p>\n<p>Conditions worsened throughout the summer, and by August people were stuck in the IRC for four to five days, and some chained to the Front Bench for over 72 hours.</p>\n<p>This is when Celia called the ACLU, and I eventually met Jhean. Celia was concerned that Jhean had been arrested and taken to the IRC but had not received housing for days, even though he had been diagnosed with a severe mental illness. I checked our reports and discovered that Jhean had spent almost 100 consecutive hours chained to the front bench. I went to visit Jhean, who had finally been transferred to a cell in the Twin Towers Jail. I saw that his wrists were swollen, cut and bruised — consistent with being handcuffed for so many hours.</p>\n<p>Tragically, Jhean was just one of many who suffered from pervasive abuse in the IRC in late summer. My colleagues and I saw and heard reports of:</p>\n<ul>\n<li>People with serious mental illness chained to chairs for days at a time, where they slept sitting up.</li>\n<li>Dozens of people crammed together, sleeping head-to-foot on the hard concrete floor.</li>\n</ul>\n<ul>\n<li>People defecating in trash cans and urinating on the floor or in empty food containers in shared spaces.</li>\n<li>Unhygienic conditions, including floors littered with trash, overflowing sinks and toilets, no access to showers or clean clothes for days, and lack of adequate access to drinking water and food.</li>\n<li>Lack of adequate health care, including failure to provide people with serious mental illness or chronic medical conditions their medications, or to provide care to people dangerously detoxing from drugs and alcohol.</li>\n</ul>\n<p>Ultimately, the ACLU of Southern California and the ACLU National Prison Project sought an <a href=\"https://www.aclu.org/cases/rutherford-v-villanueva\">emergency order</a> from a federal judge to make LA County and the LA sheriff limit wait times and provide adequate hygiene and medical care at the IRC.</p>\n<p>The level of daily suffering and misery experienced by people in the IRC is unspeakable. The LA County Board of Supervisors — the people ultimately responsible for the jails — know about the suffering, and the county’s attorneys even conceded in court that the horrors we recounted were true.</p>\n<p>This level of suffering and misery could be avoided.</p>\n<p>Years ago, the LA County Board of Supervisors committed to a “care first, jails last” approach to mental health treatment and meeting the needs of our unhoused community. But the Board of Supervisors has yet to commit to a timeline for establishing the thousands of community beds and services needed to reduce overcrowding and stop the cycle of people coming in and out of jail because they cannot access necessary mental health care, substance use treatment, or housing.</p>\n\n  <div class=\"wp-sizing-container sizing--wide\">\n      <figure class=\"wp-image mb-md\">\n\t\t  <img width=\"1000\" height=\"667\" src=\"https://www.aclu.org/wp-content/uploads/2022/10/22_1001_ACLU_CeliaBanos_024.jpg\" class=\"attachment-original size-original\" alt=\"Celia and Jhean&#039;s brother Kevin.\" loading=\"lazy\" srcset=\"https://www.aclu.org/wp-content/uploads/2022/10/22_1001_ACLU_CeliaBanos_024.jpg 1000w, https://www.aclu.org/wp-content/uploads/2022/10/22_1001_ACLU_CeliaBanos_024-768x512.jpg 768w, https://www.aclu.org/wp-content/uploads/2022/10/22_1001_ACLU_CeliaBanos_024-400x267.jpg 400w, https://www.aclu.org/wp-content/uploads/2022/10/22_1001_ACLU_CeliaBanos_024-600x400.jpg 600w, https://www.aclu.org/wp-content/uploads/2022/10/22_1001_ACLU_CeliaBanos_024-800x534.jpg 800w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />\t\n\t\t  <figcaption class=\"wp-image__caption is-caption mt-xs\"><p>Celia and Jhean&#8217;s brother Kevin.</p>\n</figcaption>\n\t\n\t\t  <span class=\"wp-image__credit is-credit\"><p>Credit: Tara Pixley</p>\n</span>\n\t  </figure>\n  </div>\n<p>Jhean remains in jail, as of this writing. Celia hasn’t been able to visit him, because the sheriff’s office keeps canceling her visits. She believes it is in retaliation for speaking out about Jhean and the nearly 100 hours he spent chained to a chair in IRC. Celia wishes her family could access consistent treatment for Jhean.</p>\n<p>“Why jail?” said Celia. “My son does not belong in jail. He has an illness.”</p>\n<p>She worries for his safety. “I&#8217;m scared for my son,” she said. “This is an everyday thing.”</p>\n<p>Learn more about Celia and her son&#8217;s story below:</p>\n<p>&nbsp;</p>\n<p><a href=\"https://www.youtube.com/watch?v=X7RsqNqVWYM\">Play the video</a></p><img src=\"https://www.aclu.org/wp-content/uploads/2022/10/22_1001_ACLU_CeliaBanos_018-400x267.jpg\" srcset=\"https://www.aclu.org/wp-content/uploads/2022/10/22_1001_ACLU_CeliaBanos_018-400x267.jpg 400w, https://www.aclu.org/wp-content/uploads/2022/10/22_1001_ACLU_CeliaBanos_018-600x400.jpg 600w, https://www.aclu.org/wp-content/uploads/2022/10/22_1001_ACLU_CeliaBanos_018-800x533.jpg 800w, https://www.aclu.org/wp-content/uploads/2022/10/22_1001_ACLU_CeliaBanos_018-1000x667.jpg 1000w, https://www.aclu.org/wp-content/uploads/2022/10/22_1001_ACLU_CeliaBanos_018-1200x800.jpg 1200w, https://www.aclu.org/wp-content/uploads/2022/10/22_1001_ACLU_CeliaBanos_018-1400x933.jpg 1400w, https://www.aclu.org/wp-content/uploads/2022/10/22_1001_ACLU_CeliaBanos_018-1600x1066.jpg 1600w, https://www.aclu.org/wp-content/uploads/2022/10/22_1001_ACLU_CeliaBanos_018.jpg 2000w\" alt=\"Celia Banos\" />\t\t<div class=\"rss-cta__title\">We need you with us to keep fighting</div><a href=\"https://action.aclu.org/give/now\" class=\"rss-cta__button\">Donate today</a></div>",
  "source": "American Civil Liberties Union"
}