{
  "title": "EPISODE 46 Enjoying Hell: The Life of Ikkyu Sojun (Part 2)",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Mon, 25 Mar 2019 19:46:00 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2019/3/25/episode-46-enjoying-hell-the-life-of-ikkyu-sojun-part-2",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5c992b0a9b747a21386f4923",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1553542249652-W52LFGWCDIZ9NTPLEKU9/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"5c992c654785d38c4eb61da6\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1553542249652-W52LFGWCDIZ9NTPLEKU9/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“Even if I go to Hell, I’ll find a way to enjoy it.” —</em> Ikkyu&nbsp;</p><p class=\"\"><em>“Watching my four year old daughter dance, I can’t break free of her. Forgetting my duties, I slip into freedom.” —</em> Ikkyu&nbsp;</p><p class=\"\"><em>\"After ten days in this temple, my mind is spinning. Between my legs the red thread stretches and stretches. If you wish to find me in the future, you better look for me in a fish shop, a sake parlor, or a brothel.” —</em> Ikkyu&nbsp;</p><p class=\"\"><em>“…tasting life and enjoying sex to the fullest.”</em> — Ikkyu&nbsp;</p><p class=\"\"><em>“Thus the so-called ‘traditional arts of Japan’ all felt his influence: tea, ceramics, Noh drama, rock gardening, and haiku poetry. No historian was keeping track of this cultural movement with Ikkyu the axis of a vortex; but with hindsight one can see how deeply Japanese medieval art forms are indebted to him.” —</em> Jon Covell&nbsp;</p><p class=\"\">So many History on Fire episodes feature incredibly violent pages from humanity’s past. This is not one of those episodes. The hero of our tale was too busy enjoying life in 15th century Japan to join the civil wars raging around him or to go around killing people. As the illegitimate son of the Emperor of Japan, Ikkyu Sojun experienced the harsh side of life from the moment he was born, but always looked for a way not to let it spoil his good mood. His main passions (in no particular order) were Zen Buddhism, sex and drinking. And in the midst of the endless party that was in life, he managed to have a tremendously powerful impact on Japanese culture. In this episode, we see Ikkyu’s wanderings taking him through torrid love affairs, friendships with pirate-merchants, and clashes with the Zen establishment. Living in an age of shoguns being assassinated, peasant uprisings, and the fury of the Onin War, Ikkyu found the time to save very Zen temple he had criticized throughout his life, and to launch an artistic renaissance that would have a lasting impact on Japanese history. In the course of our journey, we’ll find out how Ikkyu affected the creation of tea ceremony, how he and Lady Mori shared the greatest love story in Japanese history, and Ikkyu can teach about finding joy in the midst of suffering.&nbsp;</p><p class=\"\">If you'd like to keep following my work on Luminary, please follow my personal link to their platform to sign up. Thank you for understanding that this move is necessary to keep History on Fire viable. <a href=\"https://luminarypodcasts.com/signup?_branch_match_id=486767570160189673\">luminary.link/history</a></p><p class=\"\">This episode is sponsored by <a href=\"https://www.magellantv.com/\">MagellanTV</a> - a brand-new streaming service that features the very best collection of historical documentaries available anywhere. The service includes over 1500 documentary movies, series, and exclusive playlists across the major genres, with particular depth in Ancient History, Modern History, War and Military. Check out their curated <a href=\"https://www.magellantv.com/explore/history\">history playlists</a>, designed with you in mind.&nbsp;Claim your two-month free trial here: <a href=\"https://www.magellantv.com/historyonfire\" target=\"_blank\">https://www.magellantv.com/historyonfire</a></p><p class=\"\">Big thank you to <a href=\"http://www.teamevolving.com/\">www.teamevolving.com</a> for sponsoring this episode. Whether you're a startup or a talented engineer, or a recruiter looking to join a rapidly growing team of recruitment professionals, if you’re looking for a personal touch to show you your next opportunity or an elite eye in your next hire, reach out to them.&nbsp;</p><p class=\"\">Please, also show some love to my regular sponsors by shopping for supplements, special foods, clothing, and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;</p><p class=\"\">And if you are in the market for backpacks, computer bags and other hemp gear, check out my favorites at <a href=\"http://www.dsgear.com\">http://www.dsgear.com</a>&nbsp;</p><p class=\"\">And thank you also to <a href=\"https://www.snowroast.com/\">https://www.snowroast.com/</a> for their delicious coffee. Use the code TAO18 for a 15 % discount.&nbsp;</p><p class=\"\">A huge thank you to <a href=\"https://www.dynastyforge.com/\">https://www.dynastyforge.com/</a> for sharing with me their amazing swords.&nbsp;</p><p class=\"\">If you train in Jiujitsu (or any other sport for that matter), check out the knee braces at <a href=\"https://nevertapgear.com/\">https://nevertapgear.com/</a> and check out the TOMOE GOZEN RASH GUARD! <a href=\"https://nevertapgear.com/new-products/tomeo\">https://nevertapgear.com/new-products/tomeo</a>&nbsp;</p><p class=\"\">If you’d like to explore the history of gladiators while in Italy, join me on this tour in 2020! <a href=\"http://geeknationtours.com/tours_post/signature-battlefield-series-arenas-of-blood-spartacus-and-the-gladiators-of-ancient-rome-2020/\">http://geeknationtours.com/tours_post/signature-battlefield-series-arenas-of-blood-spartacus-and-the-gladiators-of-ancient-rome-2020/</a>&nbsp;</p><p class=\"\">My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>. Thank you to Onnit, Datsusara, Float Clinic, Shaman’s Simple Solutions, War Fuel, Proven Nutrition, and Fight Chix for sponsoring her for her first MMA fight. If you’d like to check out Fight Chix merchandise, you can get a 20% discount by going to <a href=\"http://www.fightchix.com/\">http://www.fightchix.com/</a> and entering the code Fire20 upon checkout.</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "01:38:46",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 46,
  "itunes:title": "EPISODE 46 Enjoying Hell: The Life of Ikkyu Sojun (Part 2)",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 46 Enjoying Hell: The Life of Ikkyu Sojun (Part 2)"
  }
}