{
  "title": "86 (LoP Returns): Seeing The Light In Uncertain Times with Shelli L Duarte",
  "pubDate": "Tue, 24 Mar 2020 23:21:30 +0000",
  "guid": "64ae3fb1-b222-460c-adda-bb9769a4daf9",
  "link": "https://lifeonpurpose.libsyn.com/86-lop-returns-seeing-the-light-in-uncertain-times-with-shelli-l-duarte",
  "itunes:image": "",
  "description": "<p>After a two-year hiatus, <strong>Life on Purpose</strong> returns with <strong>Episode #86</strong>, the first of several informal chats in a new series I’m calling <strong><em>Seeing The Light In Uncertain Times</em></strong>.</p> <div> </div> <div>My guest for this episode is <strong>Shelli L Duarte</strong> <em>(Shell Luna Love)</em>, a creative and catalyst who brings heart-centered wisdom to all of her work and endeavors.</div> <div> </div> <div>Taped in March 2020 as people around the world were dealing with the ramifications and massive uncertainty with the Coronavirus (COVID-19) pandemic, Shelli joined me for a heart-centered conversation on <strong><em>Seeing The Light In Uncertain Times</em></strong>. We discussed keeping an open heart while still having our moments of fear and stepping into our sovereign unity at this time when the world needs each of us to embrace our gifts.<br /> <br /> About Shelli:</div> <div> </div> <div>Shelli L. (Duarte), aka Shell Luna Love, believes in magic and mystery and all the in-between spaces. She suggests we all are ‘magicians’ when we go about finding our own inner essence and start unravelling our own riddles and stories through unconditional love and compassion. Creating, in whatever form, is magical and mysterious, and chock-full of love, joy, and beauty. She uses both the practical and mystical to be her most creative ‘alive’ self. “We are creators whether we are purposefully tending to this aspect or not. No matter if we are artists, parents, spouses, accountants, or engineers, etc., we are always creating.  It’s our inherent design and we have a responsibility to engage it.” <br /> <br /> One part of her work in the world is to spark and catalyze others to access their own heart-full self-leadership to allow an embodied life design. She has a passion and mission to bring tools of inspiration through joy, beauty, and experience. Some of her favourite avenues of experiencing, exploring, and serving in the world are through conversation, image, poetry, writing, and wayfinding with those who want to create and design their most heart-full lives.  Her love to inspire and guide people to their edge of self-empowered leadership is a path to the expanded love, joy, and beauty she wishes to see in the world.<br /> <br /> Shell Luna came into this world as a ‘seer’ and a seeker. She has known herself as a creative being always, just as she sees all others. She sees and seeks beauty, truth, love, mystery, and possibility in the world through inner self-exploration and outer world explorations. She is proud to call herself a ‘Jill-of-many-trades’ in this lifetime, but her soul essence is an illuminary-mystic-dream weaving-designer, an ‘engineer’, an agent of change, wanting to bring healing ideas and tools to hearts, minds, bodies, and spirits.  </div> <div> </div> <div>###</div> <div><br /> <br /></div>",
  "content:encoded": "<p>After a two-year hiatus, Life on Purpose returns with Episode #86, the first of several informal chats in a new series I’m calling <em>Seeing The Light In Uncertain Times</em>.</p>   My guest for this episode is Shelli L Duarte <em>(Shell Luna Love)</em>, a creative and catalyst who brings heart-centered wisdom to all of her work and endeavors.   Taped in March 2020 as people around the world were dealing with the ramifications and massive uncertainty with the Coronavirus (COVID-19) pandemic, Shelli joined me for a heart-centered conversation on <em>Seeing The Light In Uncertain Times</em>. We discussed keeping an open heart while still having our moments of fear and stepping into our sovereign unity at this time when the world needs each of us to embrace our gifts.  About Shelli:   Shelli L. (Duarte), aka Shell Luna Love, believes in magic and mystery and all the in-between spaces. She suggests we all are ‘magicians’ when we go about finding our own inner essence and start unravelling our own riddles and stories through unconditional love and compassion. Creating, in whatever form, is magical and mysterious, and chock-full of love, joy, and beauty. She uses both the practical and mystical to be her most creative ‘alive’ self. “We are creators whether we are purposefully tending to this aspect or not. No matter if we are artists, parents, spouses, accountants, or engineers, etc., we are always creating.  It’s our inherent design and we have a responsibility to engage it.”   One part of her work in the world is to spark and catalyze others to access their own heart-full self-leadership to allow an embodied life design. She has a passion and mission to bring tools of inspiration through joy, beauty, and experience. Some of her favourite avenues of experiencing, exploring, and serving in the world are through conversation, image, poetry, writing, and wayfinding with those who want to create and design their most heart-full lives.  Her love to inspire and guide people to their edge of self-empowered leadership is a path to the expanded love, joy, and beauty she wishes to see in the world.  Shell Luna came into this world as a ‘seer’ and a seeker. She has known herself as a creative being always, just as she sees all others. She sees and seeks beauty, truth, love, mystery, and possibility in the world through inner self-exploration and outer world explorations. She is proud to call herself a ‘Jill-of-many-trades’ in this lifetime, but her soul essence is an illuminary-mystic-dream weaving-designer, an ‘engineer’, an agent of change, wanting to bring healing ideas and tools to hearts, minds, bodies, and spirits.     ###  ",
  "enclosure": "",
  "itunes:duration": "49:50",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "After a two-year hiatus, Life on Purpose returns with Episode #86, the first of several informal chats in a new series I’m calling Seeing The Light In Uncertain Times.   My guest for this episode is Shelli L Duarte (Shell Luna...",
  "itunes:episodeType": "full"
}