{
  "title": "Water, Water everywhere but potable nowhere",
  "link": "http://asiasamachar.com/2022/11/02/water-water-everywhere-but-potable-nowhere/",
  "comments": "http://asiasamachar.com/2022/11/02/water-water-everywhere-but-potable-nowhere/#respond",
  "dc:creator": "Asia Samachar",
  "pubDate": "Wed, 02 Nov 2022 09:41:00 +0000",
  "category": [
    "Featured",
    "Global",
    "Opinion",
    "Bhupinder ‘Bo’ Singh",
    "environment"
  ],
  "guid": "https://asiasamachar.com/?p=48082",
  "description": "By Bhupinder ‘Bo’ Singh &#124; Opinion &#124; The recent hurricane storm Ian which battered the parts of Florida with such a ferocity that it will be remembered as the worst ever. The devastation it unleashed took a heavy toll on the properties, and the lives. The impact can be gauged from the fact that cars and houses ",
  "content:encoded": "\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"700\" height=\"463\" src=\"http://asiasamachar.com/wp-content/uploads/2019/07/earth-water-climate.jpg\" alt=\"\" class=\"wp-image-26100\" srcset=\"http://asiasamachar.com/wp-content/uploads/2019/07/earth-water-climate.jpg 700w, http://asiasamachar.com/wp-content/uploads/2019/07/earth-water-climate-454x300.jpg 454w, http://asiasamachar.com/wp-content/uploads/2019/07/earth-water-climate-696x460.jpg 696w, http://asiasamachar.com/wp-content/uploads/2019/07/earth-water-climate-635x420.jpg 635w\" sizes=\"(max-width: 700px) 100vw, 700px\" /></figure>\n\n\n\n<p><strong>By Bhupinder ‘Bo’ Singh</strong> | Opinion |</p>\n\n\n\n<p>The recent hurricane storm Ian which battered the parts of Florida with such a ferocity that it will be remembered as the worst ever. The devastation it unleashed took a heavy toll on the properties, and the lives. The impact can be gauged from the fact that cars and houses were floating on water, and boats were washed up lying on land, roofs blown away. There was water everywhere, but potable water was nowhere to be found. When the devastation of this scale hits the community, the potable water becomes the scarcest of item. The bottled water becomes the most precious commodity, making the empty store shelfs stark reminder of its imminence. That is the time we realize the true significance of water, which is normally taken for granted despite beings essential for our survival. The words of poet Samuel Coleridge from the poem “The Rime of the Ancient Mariner” get refreshed in our mind:</p>\n\n\n\n<p><strong>“Water, water, everywhere, nor any drop to drink.”</strong></p>\n\n\n\n<p>These words from the famous Coleridge’s poem of 1798 aptly sums the human predicament of being unable to benefit from the abundance of life’s essential. In recent times we have seen the repeat of this phenomenon as when Mississippi’s capital city Jackson was grappling with multiple water problems — there’s been too much on the ground after heavy rainfalls in end of August 2022, and not enough safe water coming through the pipes for people to use.</p>\n\n\n\n<p>A similar experience the Houston residents had to undergo through in June 2015, when the tropical storm Bill lashed Houston. Houston experienced it again, on August 25, 2017, when Hurricane Harvey hit Houston. These incidents make us realize that water taken for granted, being available on taps 24 x 7, becomes extremely scarce that even for cooking the bottled water is needed. Talking about the use of bottled water takes us back to memories of Flint, Michigan, where as a result of lead contamination of water the residents were scarred to use tap water even for cooking and were resorting to using bottled water.</p>\n\n\n\n<p>All these incidents reminds us of the importance of potable water, which we have failed to appreciate. So, many of our water bodies are contaminated that their water is unpotable. The plight of poor in the third world countries reminds us of the efforts and stress of securing potable water for cooking and drinking can become so overwhelming, that the whole day is exclusively dedicated in securing that life’s essential. With the growing population the demand for food and water is going to grow continuously. All these are going to put severe pressure on our potable water supplies. The fragile states of Africa and Middle East are most at risk of experiencing these water shortages. Even the countries like India and China are not immune to it. Already there are people in India who are getting their water supplies by spending their day waiting at the public tap of water for it to start flowing. Then making numerous trips back and forth when the water is running. In fact, shanty colonies spring up and mushroom near the public taps, so that they can quickly get their much-needed supplies.</p>\n\n\n\n<p>Another aspect of the grim water scenario is the drought situations being experienced in certain other parts of the world. The droughts have exposed the river basins and the lake beds. Europe’s drought is the worst in 500 years, and several famous European rivers have run dry. China’s largest freshwater lake and longest river are also running dry. The Guardian said on August 19, 2022, that drought in the Horn of Africa has the potential to push more than 22 million people into starvation. On August 16, 2022, the Bureau of Reclamation said that 23 years of drought and low amounts of runoff have resulted in historically low water levels at the two largest reservoirs in the U.S., Lake Mead, and Lake Powell on the U.S. Colorado River. A shocking news just came out that the California city of Coalinga will run out of water in two months. Another news item dated October 18, 2022, mentioned that the Shasta Lake in California is to the brink, risking water supply for millions in the state. When such acute drought conditions becomes the reality the availability of any water potable or non-potable is out of question.</p>\n\n\n\n<p>It is time we realize the real significance of having steady supply of potable water together with its importance for our survival. The early wakeup call came to leaders of Enron, as they started acquiring the water resources and trading in it. However, with the demise of Enron even the concern for water has evaporated from the scene. By 2050, experts forecast a 55% increase in the amount of water required to meet demand from rising population, food production and the industry. Failure to meet that demand will have devastating consequences: water shortages will become chronic, leading to the proliferation of water riots and water wars between have and have-nots.</p>\n\n\n\n<p><strong>ਪਹਿਲਾ ਪਾਣੀ ਜੀਉ ਹੈ ਜਿਤੁ ਹਰਿਆ ਸਭੁ ਕੋਇ ॥</strong></p>\n\n\n\n<p><em>“Pahilaa paanee jeeau hai jit hariaa sabh koi.”</em> (SGGS, Pg. No. 472)</p>\n\n\n\n<p><strong>Translation:</strong> First, there is life in the water, that brings life everything.</p>\n\n\n\n<p>Guru Ji saying that essentially water is not just primal life but sustains all other life. So, it’s time to raise the awareness on the essentiality of water and put plans of action in place so that this does not become the life-threatening issue. The world’s most valuable natural compound – water has a potential to become cause of many strives and wars if we fail to plan for it. We have already seen the desalination process being utilized to get water from the oceans, but now the new world reality is unfolding in front of our eyes, and we need to come with other newer methods of purifying contaminated water to take care of our daily needs. I am ending this piece with hopes that the wiser sense prevails, and we have some breakthrough technologies ushered in to take care of this manmade disaster. Guru Ji has shared with how essential the water is for life of fish in these words:</p>\n\n\n\n<p><a href=\"https://www.srigranth.org/servlet/gurbani.gurbani?Action=Page&Param=1273&english=t&id=54680\"></a><strong>ਖਿਨੁ ਤਿਲੁ ਰਹਿ ਨ ਸਕੈ ਪਲੁ ਜਲ ਬਿਨੁ ਮਰਨੁ ਜੀਵਨੁ ਤਿਸੁ ਤਾਂਈ ॥੪॥<br></strong>“<em>Khin til raeh na sakai pal jal bin maran jeevan tis ṯaaee.</em> 4.” (SGGS, Pg. No. 1273)</p>\n\n\n\n<p><strong>Translation:</strong> It (Fish) cannot survive without water for a moment, even for an instant. (Its) Life and death depend on it. ||4||</p>\n\n\n\n<p>It is also true for human life and existence. Let us all work together to ensure that no life is lost for want of water.</p>\n\n\n\n<p></p>\n\n\n\n<p>References:</p>\n\n\n\n<ol type=\"1\"><li><a href=\"https://www.poetryfoundation.org/poems/43997/the-rime-of-the-ancient-mariner-text-of-1834\">https://www.poetryfoundation.org/poems/43997/the-rime-of-the-ancient-mariner-text-of-1834</a></li><li><a href=\"https://www.tampabay.com/hurricane/2022/09/28/wednesday-live-updates-hurricane-ian-forecast-hit-florida-today/\">Hurricane Ian punishes Florida with devastating winds, storm surge</a>. Tampa Bay Times September 28, 2022.</li><li>Water, water everywhere – but not a drop to drink at some Houston grocery stores. Houston Chronicle June 16, 2015. <a href=\"https://www.chron.com/news/houston-weather/article/Water-water-everywhere-but-not-a-drop-to-6330308.php\">https://www.chron.com/news/houston-weather/article/Water-water-everywhere-but-not-a-drop-to-6330308.php</a></li><li>Flint Water Crisis: Everything You Need to Know. NRDC, November 08, 2018. <a href=\"https://www.nrdc.org/stories/flint-water-crisis-everything-you-need-know\">https://www.nrdc.org/stories/flint-water-crisis-everything-you-need-know</a></li><li>Drought around the world, August 2022, in dramatic images. Earthsky. https://earthsky.org/earth/drought-around-world-2022-revealing-hidden-artifacts/</li><li>Enron-ization of Water: Wall Street’s Pending Resource Grab. Wolf Street August 10, 2014. <a href=\"https://wolfstreet.com/2014/08/10/enron-ization-of-water-wall-streets-pending-resource-grab/\">https://wolfstreet.com/2014/08/10/enron-ization-of-water-wall-streets-pending-resource-grab/</a></li><li>The California City of Coalinga will run out of water in two Months. Los Angeles Magazine. October 10, 2022. https://www.lamag.com/culturefiles/the-city-ofcoalinga-has-2-months-of-water-left/</li></ol>\n\n\n\n<p></p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"298\" height=\"200\" src=\"http://asiasamachar.com/wp-content/uploads/2020/11/Bhupinder-Bo-Singh.jpg\" alt=\"\" class=\"wp-image-34987\"/></figure>\n\n\n\n<p><strong>Bhupinder ‘Bo’ Singh, Houston. Born in Bhamo, Myanmar, he now lives in Houston, US, where he runs a manufacturing company formed with his son. A mechanical engineer by training, he has authored a number of books, including </strong><em>Connecting with the Master – A collection of essays on topics related to Sikhism </em>(2006) <strong>and </strong><em>In Bully’s Eyes – An Illustrated Children’s book on Bullying</em>(2019).</p>\n\n\n\n<p></p>\n\n\n\n<h4 class=\"has-vivid-red-color has-text-color\"><strong>RELATED STORY:</strong></h4>\n\n\n\n<p><a href=\"https://asiasamachar.com/2020/10/01/33864/\">Punjab ground water crisis</a> <strong>(<em>Asia Samachar,</em> 1 Oct 2020)</strong></p>\n\n\n\n<h4></h4>\n\n\n\n<p><strong><em>ASIA SAMACHAR is an<a href=\"http://asiasamachar.com/\">&nbsp;online newspaper</a>&nbsp;for Sikhs / Punjabis in Southeast Asia and beyond.</em><a href=\"https://www.facebook.com/asiasamachar/\">Facebook</a>&nbsp;| WhatsApp +6017-335-1399 | Email: editor@asiasamachar.com |&nbsp;<a href=\"https://twitter.com/AsiaSamachar\">Twitter</a>&nbsp;|&nbsp;<a href=\"https://www.instagram.com/asiasamachar/\">Instagram</a>&nbsp;| Obituary announcements, click&nbsp;<a href=\"http://asiasamachar.com/2017/07/30/obituary-announcement-at-asia-samachar/\">here</a>&nbsp;</strong></p>\n\n\n\n<p></p>\n",
  "wfw:commentRss": "http://asiasamachar.com/2022/11/02/water-water-everywhere-but-potable-nowhere/feed/",
  "slash:comments": 0,
  "post-id": 48082
}