{
  "title": "S6: Reopening: Europe",
  "link": "https://audioboom.com/posts/7604916",
  "itunes:season": 6,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2005,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Since the end of May and throughout the month of June, many European Countries have lifted or loosened the lockdown measures set in place to fight the spread of the virus. </div>\n<div><br>\n</div>\n<div>One of the last measures still in place is the closure of international borders, which to some extent brought back to the memory a closed Europe, and border checkpoints, which many of our listeners that born after 1989 probably bene experienced, at least on the scale we have had. </div>\n<div><br>\n</div>\n<div>As this is somewhat an atypical and historical moment, we are going to embark in a peculiar journey, starting on Friday 12 June. Bruegel is supporting a project driving across 7 Countries and more that 2.500 kilometres to collect facts about how the border closure affected the economy and society, take a “temperature reading” of the perceptions of people, and make an analysis out of it. </div>\n<div><br>\n</div>\n<div>It is an exciting endeavour that sees Bruegel on the road, after these months of lockdown and countless zoom livestreams. It will provide a snapshot of the impact on the ground also of the European policies which we are more of a commonplace in our studies and in this podcast. </div>\n<div><br>\n</div>\n<div>You will be able to follow us on the road on the Bruegel channels, as well as the project website <a href=\"http://www.reopeningeurope.com/\">www.reopeningeurope.com</a> </div>\n<div><br>\n</div>\n<div>This episode provides a background overview of the impact of the reopening on European value chains, future of work, and innovation. </div>\n<div><br>\n</div>\n<div>Guests</div>\n<div>Scott Marcus, senior fellow, Bruegel</div>\n<div>Niclas Poiters, research fellow, Bruegel</div>\n<div>Reinhilde Veugelers, senior scholar, Bruegel</div>\n<div><br>\n</div>\n<div>Host</div>\n<div>Giuseppe Porcaro, head of outreach and governance, Bruegel</div>\n",
  "itunes:summary": "This episode provides a background overview of the impact of the reopening of borders on European value chains, future of work, and innovation.",
  "pubDate": "Thu, 11 Jun 2020 09:04:05 +0000",
  "guid": "tag:audioboom.com,2020-06-11:/posts/7604916",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}