{
  "id": "yt:video:NqPsdlQDOYQ",
  "yt:videoId": "NqPsdlQDOYQ",
  "yt:channelId": "UCZRoNJu1OszFqABP8AuJIuw",
  "title": "5 People Founded Tesla. Only Elon Got Rich.",
  "link": "",
  "author": {
    "name": "Logically Answered",
    "uri": "https://www.youtube.com/channel/UCZRoNJu1OszFqABP8AuJIuw"
  },
  "published": "2022-11-02T19:00:08+00:00",
  "updated": "2022-11-02T19:32:56+00:00",
  "media:group": {
    "media:title": "5 People Founded Tesla. Only Elon Got Rich.",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Elon Musk is usually credited as being the visionary founder of Tesla, and this makes sense given that the early days of Tesla were almost completely funded by himself. Not to mention, he was the main reason that Tesla survived the 2008 financial crisis and the 2018 production hell. But, Tesla actually has 5 founders and Elon is only one of them. The other founders include Martin Eberhard, Mark Tarpenning, JB Straubel, and Ian Wright, but these guys are almost never talked about and they’re nowhere near as rich as Elon Musk. In fact, none of the other founders are currently billionaires, and Elon Musk has daily net worth swings that are worth more than all of their net worth combined. But, how did such a massive discrepancy arise among the founders who presumably all started with a significant stake in Tesla? After all, even a 1% stake in Tesla would be worth several billion dollars today. This video explains why Elon Musk is the only Tesla founder that became stupidly rich and why the other founders all eventually left Tesla. \n\nDiscord Community: \nhttps://discord.gg/SJUNWNt\n\nTimestamps:\n0:00 - Tesla’s Other Founders\n1:51 - Money Talks\n5:27 - Firing The Founders\n8:34 - Agressive CEO Compensation\n11:37 - Why Only Elon Is Rich\n\nThumbnail Credit:\nDimitrios Kambouris - Getty Images\nhttps://abcn.ws/3gZpCyk\n\nResources: \nhttps://pastebin.com/2TLxqEYk",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}