{
  "id": "yt:video:NtoIXhUgqSk",
  "yt:videoId": "NtoIXhUgqSk",
  "yt:channelId": "UCrlZs71h3mTR45FgQNINfrg",
  "title": "The 5 ways to visualize complex functions | Essence of complex analysis #3",
  "link": "",
  "author": {
    "name": "Mathemaniac",
    "uri": "https://www.youtube.com/channel/UCrlZs71h3mTR45FgQNINfrg"
  },
  "published": "2021-09-12T14:00:20+00:00",
  "updated": "2022-05-03T19:02:28+00:00",
  "media:group": {
    "media:title": "The 5 ways to visualize complex functions | Essence of complex analysis #3",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Complex functions are 4-dimensional: its input and output are complex numbers, and so represented in 2 dimensions each, so how do we visualize complex functions if we are living in a 3D world? There are actually 5 different ways to visualize a complex function, and this video is going to explore a bit about each of them.\n\nSome of you commented that you have already studied complex analysis in full, but hopefully there are still some things that you haven't seen before, because a typical university course on complex analysis wouldn't contain as many visuals as seen in this video.\n\nI know this might not be recommended by YouTube as much simply because the video is not that long (less than 20 minutes), and it seems like YouTube only puts my videos in recommendations when my video is very long. Originally I wanted to put things that will be covered in the next video into this particular video, but I figured that it doesn't make sense to cram two quite separate things into one video just for the sake of watch time. So please consider sharing this video, liking and commenting so that more people can watch it!\n\nLEARN A LITTLE BIT MORE HERE:\nMore about complex visualisation: http://www.nucalc.com/ComplexFunctions.html\nJoukowsky transform: https://complex-analysis.com/content/joukowsky_airfoil.html\nJoukowsky transform (NASA): https://www.grc.nasa.gov/www/k-12/airplane/map.html\n\nCredits to Yehuda, there is an interactive tool to obtain the domain colouring plot for complex functions here: https://people.math.osu.edu/fowler.291/phase/\n\nMusic used:\nHeavenly - Aakash Gandhi\nfrom YouTube audio library\n\nVideo chapters:\n00:00 Introduction\n01:03 Domain colouring\n03:35 3D plots\n05:45 Vector fields\n07:50 z-w planes\n10:53 Riemann spheres\n\nOther than commenting on the video, you are very welcome to fill in a Google form linked below, which helps me make better videos by catering for your math levels:\nhttps://forms.gle/QJ29hocF9uQAyZyH6\n\nIf you want to know more interesting Mathematics, stay tuned for the next video!\n\nSUBSCRIBE and see you in the next video!\n\nIf you are wondering how I made all these videos, even though it is stylistically similar to 3Blue1Brown, I don't use his animation engine Manim, but I will probably reveal how I did it in a potential subscriber milestone, so do subscribe!\n\nSocial media:\n\nFacebook: https://www.facebook.com/mathemaniacyt\nInstagram: https://www.instagram.com/_mathemaniac_/\nTwitter: https://twitter.com/mathemaniacyt\nPatreon: https://www.patreon.com/mathemaniac (support if you want to and can afford to!)\n\nFor my contact email, check my About page on a PC.\n\nSee you next time!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}