{
  "title": "When his hobbies went on hiatus, this Kaggler made fighting COVID-19 with data his mission | A…",
  "link": "https://medium.com/kaggle-blog/when-his-hobbies-went-on-hiatus-this-kaggler-made-fighting-covid-19-with-data-his-mission-a-e306419b99a5?source=rss----4b0982ce16a3---4",
  "guid": "https://medium.com/p/e306419b99a5",
  "category": [
    "covid19",
    "data-science",
    "kaggle-competition",
    "machine-learning",
    "kaggle"
  ],
  "dc:creator": "Kaggle Team",
  "pubDate": "Wed, 29 Jul 2020 19:36:32 GMT",
  "atom:updated": "2020-07-29T19:39:26.208Z",
  "content:encoded": "<h3>With sports (and everything else) cancelled, this data scientist decided to take on COVID-19 | A Winner’s Interview with David Mezzetti</h3><h4>When his hobbies went on hiatus, Kaggler David Mezzetti made fighting COVID-19 his mission.</h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*vgrOydKr3YdJcZjWXHK5lw.jpeg\" /><figcaption>Photo by <a href=\"https://unsplash.com/@claybanks?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Clay Banks</a> on <a href=\"https://unsplash.com/s/photos/data-covid?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Unsplash</a></figcaption></figure><h4>Let’s learn about David!</h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*7zQLY6WJxHVa3yNShDjrbA.png\" /><figcaption><a href=\"https://www.kaggle.com/davidmezzetti\">https://www.kaggle.com/davidmezzetti</a></figcaption></figure><p><a href=\"https://www.kaggle.com/davidmezzetti\">David Mezzetti </a>is the founder of NeuML, a data analytics and machine learning company that develops innovative products backed by machine learning. He previously co-founded and built Data Works into a 50+ person well-respected software services company. In August 2019, Data Works was acquired and Dave worked to ensure a successful transition.</p><h4>David, what can you tell us about your background?</h4><p><strong>David: </strong>My technical background is in ETL, data extraction, data engineering and data analytics. I spent over a decade of my career developing large-scale data pipelines to transform both structured and unstructured data into formats that can be utilized in downstream systems. I also have experience in building large-scale distributed text search and Natural Language Processing (NLP) systems.</p><h4>Do you have any prior experience or domain knowledge that helped you succeed in this competition?</h4><p>I’ve worked in the data analytics space for 15+ years but did not have prior knowledge of medical documents or the medical industry.</p><h4>How did you get started competing on Kaggle?</h4><p>I’ve participated in a couple March Madness competitions. I was looking forward to the 2020 tournament and had a model I was very excited about. The way the season went was perfect for the strengths of the model but we’ll never know how it would have performed.</p><h4>What made you decide to enter this competition?</h4><p>When the 2020 March Madness competition was cancelled and COVID-19 was really starting to hit hard, I wanted to find a way to get involved and help. NeuML was working on a real-time sports event tracking application, neuspo but sports along with everything else was being shut down and there were no sports to track.</p><p>With sports and life on a hiatus, I saw the Kaggle CORD-19 challenge and felt I had the background to be able to contribute. On top of everything going on, my Mom passed away in early March. She was a high school biology teacher and would have been happy to know I was involved. This effort was also a good distraction from everything going on and a way to feel like I could do my part to help beat COVID-19.</p><h3><strong>Let’s get technical</strong></h3><h4>Tell us about the overall architecture or approach to the problem.</h4><p>The solution consisted of two main parts, a sentence embeddings based search index and a custom BERT QA model to extract column based answers, known as summary tables for a specific list of questions.</p><p>For each query, an embeddings query identifies the list of best matching documents. Common fields including date, title, authors and the reference url are stored as search result columns.</p><p>A <a href=\"https://huggingface.co/NeuML/bert-small-cord19qa\">custom BERT QA model</a> was developed to add additional columns to the list of search results. For example, given a search of the CORD-19 dataset for “hypertension”, an additional column for the question “What is the risk factor of developing severe symptoms for patients with hypertension?” is added as a separate column.</p><h4>Did any past research or previous competitions inform your approach?</h4><p>Much of the search logic was based on a prior project, codequestion (<a href=\"https://github.com/neuml/codequestion\">https://github.com/neuml/codequestion</a>). codequestion builds a sentence embeddings index over coding questions to match developers questions with previously asked questions/answers. Given that I already had that code base, I took that approach when starting with the CORD-19 dataset and much of the code is still derived from codequestion today.</p><h4>What preprocessing and feature engineering did you do?</h4><p>The CORD-19 dataset has a metadata CSV file with the full list of documents along with full-text stored in separate JSON files. An ETL process was built to take the CSV, find the corresponding text articles and load the data into a SQLite database. The text is then broken down into sentences per document, and those sentences are mapped to sentence embeddings using a BM25 + fastText method described in this <a href=\"https://towardsdatascience.com/building-a-sentence-embedding-index-with-fasttext-and-bm25-f07e7148d240\">Medium article</a>.</p><h4>What supervised learning methods did you use?</h4><p>All search and question-answering was unsupervised using fastText+BM25 and a BERT based model for QA.</p><p>An important concept discovered early on was the importance of study design. All articles are not considered equal, and the medical community puts more weight behind different study types. For example, studies with a larger sample size (i.e. more patients) or systematic reviews are held in higher regard vs mathematical modeling/forecasting articles. A Random Forest classifier was built to analyze articles to determine the study design based on the word tokens and named entities within an article.</p><h4>What was your most important insight into the data?</h4><p>The CORD-19 dataset is dynamic and growing. I saw that almost everyone, including myself took the first approach of building a search index that allowed finding documents based on matching tokens. Additionally, summarization was seen as a way to also add value. The thought being to show researchers all data on a particular term or concept. Building on the previous point on study design, not all documents are of equal value. Labeling documents with a study design proved to be greatly beneficial in allowing researchers to review a document vs just showing documents with matching tokens.</p><p>Additionally, where tokens show up in a document is important. Some articles reference a concept in the introduction or discussion sections but the article doesn’t cover that concept. Most medical articles have methods & results sections and matches in those sections are more important.</p><h4>Were you surprised by any of your findings?</h4><p>I had little to no expectations entering this competition, so I wouldn’t say I was surprised by anything. It was great to see so many smart and capable people all working together to try to help in whatever way they could.</p><h4>Which tools did you use?</h4><p>All of the work is driven by the Kaggle platform. The list of notebooks cover all the submissions for Round 1 and Round 2 of the CORD-19 challenge. All of the notebooks are in Python.</p><p><a href=\"https://www.kaggle.com/davidmezzetti/cord-19-analysis-with-sentence-embeddings\">Sentence Embeddings Notebook</a></p><p><strong>Round 1:</strong></p><ul><li><a href=\"https://www.kaggle.com/davidmezzetti/cord-19-transmission-incubation-environment\">What is known about transmission, incubation, and environmental stability?</a></li><li><a href=\"https://www.kaggle.com/davidmezzetti/cord-19-risk-factors?scriptVersionId=33173909\">What do we know about COVID-19 risk factors?</a></li><li><a href=\"https://www.kaggle.com/davidmezzetti/cord-19-virus-genetics-origin-and-evolution\">What do we know about virus genetics, origin, and evolution?</a></li><li><a href=\"https://www.kaggle.com/davidmezzetti/cord-19-vaccines-and-therapeutics\">What do we know about vaccines and therapeutics?</a></li><li><a href=\"https://www.kaggle.com/davidmezzetti/cord-19-non-pharmaceutical-interventions\">What do we know about non-pharmaceutical interventions?</a></li><li><a href=\"https://www.kaggle.com/davidmezzetti/cord-19-medical-care\">What has been published about medical care?</a></li><li><a href=\"https://www.kaggle.com/davidmezzetti/cord-19-diagnostics-and-surveillance\">What do we know about diagnostics and surveillance?</a></li><li><a href=\"https://www.kaggle.com/davidmezzetti/cord-19-sharing-and-collaboration\">What has been published about information sharing and inter-sectoral collaboration?</a></li><li><a href=\"https://www.kaggle.com/davidmezzetti/cord-19-ethical-and-social-science-considerations\">What has been published about ethical and social science considerations?</a></li></ul><p><strong>Round 2:</strong></p><ul><li><a href=\"https://www.kaggle.com/davidmezzetti/cord-19-population\">Task 1: Population</a></li><li><a href=\"https://www.kaggle.com/davidmezzetti/cord-19-relevant-factors\">Task 2: Relevant Factors</a></li><li><a href=\"https://www.kaggle.com/davidmezzetti/cord-19-patient-descriptions\">Task 3: Patient Descriptions</a></li><li><a href=\"https://www.kaggle.com/davidmezzetti/cord-19-models-and-open-questions\">Task 4: Models and Open Questions</a></li><li><a href=\"https://www.kaggle.com/davidmezzetti/cord-19-materials\">Task 5: Materials</a></li><li><a href=\"https://www.kaggle.com/davidmezzetti/cord-19-diagnostics\">Task 6: Diagnostics</a></li><li><a href=\"https://www.kaggle.com/davidmezzetti/cord-19-therapeutics\">Task 7: Therapeutics</a></li><li><a href=\"https://www.kaggle.com/davidmezzetti/cord-19-risk-factors\">Task 8: Risk Factors</a></li><li><a href=\"https://www.kaggle.com/davidmezzetti/cord-19-task-csv-exports\">Full Task CSV Export List</a></li></ul><p>There is also a separate Python project on github, <a href=\"https://github.com/neuml/cord19q\">cord19q</a>. cord19q has the logic for ETL, building the embeddings index and running the custom BERT QA model.</p><h4>How did you spend your time on this competition?</h4><p>The early days of the effort were spent on EDA and exchanging ideas with other members of the community. Before models could be built, gaining an understanding of the data, strengths and weaknesses of the dataset and what researchers are looking for out of the CORD-19 dataset was needed. I was fortunate enough to find like-minded data scientists who were willing to roll up their sleeves and write code to help discover what we want from the data. It wasn’t until 1–2 months into the effort that machine learning models and feature engineering were even considered. Most of Round 1 was focused on data extraction, parsing, requirements analysis and building a system to search for documents.</p><p>The work of Round 1 led to discovering that building summary tables with extracted answers to a series of questions, would be most beneficial to the medical community. Fortunately, a team of medical experts manually curated a dataset that could be used to help build machine learning models. In Round 2, a BERT based QA model was developed to be able to extract answers from medical documents. This required building a custom question-answer dataset to teach a model how to answer medical questions. In Round 2, the majority of time was spent on building this model.</p><h4>What does your hardware setup look like?</h4><p>All of the submissions were built on the Kaggle platform as CPU Notebooks. Development was done on a quad core laptop with a 8GB GPU and 32GB of RAM. The fastText embeddings, study design models, and custom BERT QA models were built offline using this laptop.</p><h4>What was the run time for both training and prediction of your winning solution?</h4><p>Given that the data is continually updated, there is a recurring job that runs each update (using <a href=\"https://github.com/neuml/kernelpipes\">kernelpipes</a>). It takes about 6 hours to fully ETL, build the models and run all the solution notebooks on Kaggle.</p><h3><strong>Words of wisdom</strong></h3><h4>What have you taken away from this competition?</h4><p>This challenge was unique for a number of reasons. First there was no known answer, this was a real-world problem like you would encounter in industry, where someone has a large dataset and they aren’t sure what to do with it. This approach requires an iterative process of exploring the data, sharing feedback with experts and building a workflow to solve the problem. The data scientists involved in this effort were extremely fortunate to be guided by Savanna Reid, an epidemiologist volunteering her time. We were also fortunate Kaggle was heavily involved with Paul Mooney and Anthony Goldbloom helping guide the effort. I was fortunate to be able to bounce ideas off other data scientists working the effort, specifically Ken Miller and Andy White.</p><p>It was an honor to volunteer and while I’ll never know the true impact these contributions made, I like to think it did a small part to help.</p><h4>Looking back, what would you do differently now?</h4><p>Entering the competition, my first instinct was to use sentence embeddings since I had an existing similar project. If starting over, I would have explored different methods to search the documents to see if any other methods performed better.</p><h4>Do you have any advice for those just getting started in data science?</h4><p>Much of your time will be spent on data preparation and feature engineering. The best way to learn data science is to solve a problem you’re interested in. Sports analytics is how I got started in data science. This was an engaging way for me to stay focused not only in the algorithms but the data itself.</p><p>—</p><p>Additional Medium posts by David Mezzetti:</p><p><a href=\"https://medium.com/neuml/combating-covid-19-with-data-science-80bad4007096\">Combating COVID-19 with Data Science</a><br><a href=\"https://towardsdatascience.com/building-analysis-pipelines-with-kaggle-c745671d273e\">Building Analysis Pipelines with Kaggle</a></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=e306419b99a5\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/kaggle-blog/when-his-hobbies-went-on-hiatus-this-kaggler-made-fighting-covid-19-with-data-his-mission-a-e306419b99a5\">When his hobbies went on hiatus, this Kaggler made fighting COVID-19 with data his mission | A…</a> was originally published in <a href=\"https://medium.com/kaggle-blog\">Kaggle Blog</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
}