{
  "title": "S14 Ep96: Supernatural News/Parashare: Visitors from Beyond Edition",
  "link": "https://audioboom.com/posts/8098534",
  "itunes:episode": 96,
  "itunes:title": "Supernatural News/Parashare: Visitors from Beyond Edition",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 6070,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS is back with our Visitors from Beyond edition with Supernatural News & ParaShare Saturday!<br>\n<br>\nThe planet appears to be preparing for visits from other planets for Thanksgiving, Aliens and UFOs are being seen everywhere and by everyone it seems! Plus we have stories of Ghosts of the Asylum, Life After Death and more!<br>\n<br>\nVisit our store front for the books, documentaries and more you hear featured on our show: <a href=\"https://www.amazon.com/shop/darknessradiodave\">https://www.amazon.com/shop/darknessradiodave</a><br>\n<br>\nAND WATCH THE HOLZER FILES ON TRAVEL CHANNEL EVERY THURSDAY NIGHT!<br>\n<br>\n<a href=\"https://www.travelchannel.com/shows/holzer-files\">https://www.travelchannel.com/shows/holzer-files</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nAre you playing along with Beyond the Darkness on the Podcast One/ <a href=\"http://Betonline.AG\">Betonline.AG</a> Sportsnet Challenge?!  Each Week Dave and Tim are picking the winners of five NFL gam,es and playing against the hosts of different Podcast One shows!  If you play aloing with Dave and Tim on <a href=\"http://BetOnline.AG\">BetOnline.AG</a>, and they win the week, you qualify to be one of five winners splitting a $500 weekly prize! To sign up go to <a href=\"https://promotions.betonline.ag/podcastone\">https://promotions.betonline.ag/podcastone</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.<br>\n<br>\nNative is a deodorant filled with natural ingredients and formulated without aluminum, parabens and talc. Choose from scents like Coconut & Vanilla, Lavender & Rose, Cucumber & Mint and Eucalyptus & Mint. \tFor  20%  off your first purchase, visit <a href=\"http://nativedeodorant.com\">nativedeodorant.com</a> and use promo code DARKNESS during checkout!",
  "itunes:summary": "BEYOND the DARKNESS is back with our Visitors from Beyond edition with Supernatural News & ParaShare Saturday!\n\nThe planet appears to be preparing for visits from other planets for Thanksgiving, Aliens and UFOs are being seen everywhere...",
  "pubDate": "Sat, 23 Nov 2019 10:00:00 +0000",
  "guid": "d4411742-70ec-4d08-b0b7-a4a537840c86",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}