{
  "title": "How I Build Learning Projects — Part II",
  "link": "https://medium.com/@rchang/how-i-build-learning-projects-part-ii-3c5ab4b3dd98?source=rss-c00b242128fe------2",
  "guid": "https://medium.com/p/3c5ab4b3dd98",
  "category": [
    "data-science",
    "learning",
    "programming",
    "data",
    "machine-learning"
  ],
  "dc:creator": "Robert Chang",
  "pubDate": "Sun, 29 Mar 2020 01:01:00 GMT",
  "atom:updated": "2020-03-29T01:01:00.935Z",
  "content:encoded": "<h3>How I Build Learning Projects — Part II</h3><h4>Habits Are Too Light To Be Felt Until They Are Too Heavy to Be Broken</h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*swL0WOzlj0ycZaC80BSXFg.png\" /><figcaption><a href=\"https://unsplash.com/photos/Oaqk7qqNh_c\">Image Credit</a>: Are you ready to build your learning habits?</figcaption></figure><h3>Recap</h3><p>In my <a href=\"https://medium.com/@rchang/how-i-build-learning-projects-part-i-54dbaad68961\">earlier post</a>, I shared my approach to building self-directed learning projects. I emphasized, before jumping into any project, you should pick carefully and strategically what skills to invest in. In particular, prioritizing skills that are foundational, transferrable, and adjacent to your core competency are some of my criteria for acquiring new professional skills.</p><p>I also highlighted the importance of planning — from defining the objectives and key results, decomposing a project into concrete milestones, to surveying and sampling learning materials, these planning exercises can significantly reduce logistical complexity and enable you to deeply focus on learning itself.</p><p>In this second post, I will pick up where we left off and describe how you can develop habits and rituals to reliably execute against your plan. Furthermore, We will cover techniques that will further solidify your learnings such as doing drills for procedural learning, building mental models for conceptual learning, and using free recall and spaced repetition to remember facts. By the end of this post, I hope you will be inspired to develop your learning system as <a href=\"https://superorganizers.substack.com/\">many others</a> have.</p><h3>From Strategy to Execution: Habits and Rituals</h3><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*FGrPgB48KfgP3UJk3vibOw.png\" /><figcaption><a href=\"https://unsplash.com/photos/BfphcCvhl6E\">Image Credit</a>: Many high performers (such as in sports) have designed habits and routines to support their high performance</figcaption></figure><p>While most people agreed with “strategy without execution is useless”, many still fall short when it comes to learning project execution. For example, the chart below shows the view progression for some of the most popular online courses on YouTube. In the aggregate, people tend to drop off quickly just a few lectures into the courses, and many people fail to take their studies to the finish line.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*lbHNIKvUhmBt7lvmt_EYmg.png\" /><figcaption><a href=\"https://gist.github.com/robert8138/aa0e08bd56b6597f278d2622397a2505\">Code</a>: View trends of free, popular MOOC on Youtube — people rarely pass through the 3rd lecture!</figcaption></figure><p>The key to fighting against the odds, in my opinion, lies in the book “<a href=\"https://jamesclear.com/books\">Atomic Habit</a>”. The author James Clear argues that all great performers, be them athletes, musicians, and any professionals, have rituals and routines designed to support their high performance. I believe, to get the most out of your projects, you too should design <strong>learning habits </strong>to support your deliberate practice. These learning habits are the key to finishing a good project.</p><h4>The Habit Loop</h4><p>Drawing from a wide variety of research and interviews, Clear develops a framework that describes <a href=\"https://jamesclear.com/three-steps-habit-change\">the mechanics of habit formation</a>. In his words:</p><blockquote>The cue triggers a craving, which motivates a response, which provides a reward, which satisfies the craving and, ultimately, becomes associated with the cue. Together, these four steps form a neurological feedback loop — <strong>cue, craving, response, reward</strong>;<strong> cue, craving, response, reward</strong> — that ultimately allows you to create automatic habits.</blockquote><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/706/1*SBtbix-E4x4CXRNSiaj4dg.png\" /><figcaption><a href=\"https://jamesclear.com/three-steps-habit-change\">Image credit</a>: The cue-craving-response-reward habit loop</figcaption></figure><p>If you analyze some of your habits that are seemingly automatic, they all follow the same habit loop described above. For example, early in the morning, the act of waking up is a <em>cue</em> for you to go to the bathroom, and your mere presence in the bathroom triggers a <em>craving</em> to freshen up. You then react to this craving by brushing your teeth or taking a shower. Once you complete these <em>responses</em>, you feel refreshed and <em>rewarded</em>. In the background, this process completes a habit loop and repeats itself the next morning.</p><p>Many high performers understood that this very cycle can be leveraged to design rituals and routines to support their professional pursuits. Michael Phelps trained for 5–6 hours a day in the water, and the consistency made him one of the greatest swimmers in the world. The late Kobe Bryant woke up at 4:30 a.m. every day just so he could get a few extra hours of practice, and this dedication made him one of the most legendary basketball players in NBA history. The pursuit of excellence is never just achieved through will powers, it is also supported by well-designed habits and routines.</p><h4>The Four Laws of Good Habit Formation</h4><p>Certainly, putting habits in place is easier said than done, so what can we do to foster these habits? Clear explains, once you understand how habits work, you can follow a simple set of rules to create good habits and even break bad ones. He called these the<strong> Four Laws of Good Habit Formation:</strong></p><ul><li><strong>Make it obvious: </strong>If you want to reliably kickstart a habit loop, make the <em>cues </em>that remind you about the habit extremely obvious</li><li><strong>Make it attractive: </strong>If the triggered cue is associated with a strong <em>craving</em>, you are more likely to follow through with the habit</li><li><strong>Make it easy: </strong>For you to execute on the habit itself, the action or response needed to fulfill the craving must be very easy to perform</li><li><strong>Make it satisfying: </strong>Finally, to complete the loop, the reward you get from completing the action must be satisfying to satisfy the craving</li></ul><p>By understanding these principles, you can now design tactics to make a good habit stick. If you often forget to do a learning project, find cues to remind you of this priority. If you often don’t have enough motivation to return to a project, find ways to make it more desirable. If your projects are too hard to execute on, simplify and make it easy to do. Finally, if your projects don’t give you enough satisfaction, find alternative ways to make it rewarding.</p><h3>Engineer Habits & Routines For Learning Projects</h3><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*IFo-KtorcGN3uO0NIoTXFQ.png\" /><figcaption><a href=\"https://unsplash.com/photos/Wiu3w-99tNg\">Image credit</a>: How will you engineer your habits and routines to support your learnings every day?</figcaption></figure><p>Ever since I learned about the <strong>Four Laws of Good Habit Formation</strong>, I have become more intentional about how I execute my projects. While my previous learnings succeeded because I pushed myself hard, my more recent projects succeeded because of the routines that I designed. To make it concrete, I will use a Machine Learning project that I completed in 2018 as a case study.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*zRhATTkIaLV4DdHdG4tCjA.png\" /><figcaption>My <a href=\"https://github.com/robert8138/deep-learning-deliberate-practice\">Project Plan Document</a> — similar to a Product Requirement Document (PRD) in Product Development</figcaption></figure><p>First, I would encourage you to read my <a href=\"https://github.com/robert8138/deep-learning-deliberate-practice\">Project Plan Document</a> to understand the motivation of this project. Next, you can read through my detailed time log to see my learning <a href=\"https://github.com/robert8138/deep-learning-deliberate-practice/blob/master/TIMELINE.md\">progression</a> by the week. With those contexts in mind, I will go beyond what I have written down on Github and highlight the habits and routines that I practiced throughout the project.</p><h4>Make It Obvious: Use Implementation Intention As My Cue</h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*9mEja8Y6JnD9ICdG5qGWRQ.png\" /><figcaption><a href=\"https://unsplash.com/photos/XVoyX7l9ocY\">Image Credit</a>: I jumpstart my learning projects the moment I hop on a train for 50 minutes</figcaption></figure><p>Like many other brave souls in Silicon Valley, I spend a few hours a day in commuting. Recognizing that my time is valuable, I was determined to not waste it. Each morning, as I stepped onto the waiting platform, I would tell myself that today is a new day, and I will re-engage with my learning projects for 50 minutes until I arrive at San Francisco. The act of pre-committing to a specific action at a specific time and a specific place is a goal-setting technique called <a href=\"https://jamesclear.com/implementation-intentions\"><strong>Implementation Intention</strong></a>.</p><p>This technique has been used widely in many situations and has been proven to be extremely effective. The reason that it works is that it removes the decision making ahead of time and lowers the activation energy to kickstart a routine. When you pair this technique with an environment where you regularly interact, you effectively design a recurring cue that serves as a powerful reminder to prioritize what is important to you in that environment.</p><p>Note, interruptions and disruptions do occur in life: e.g. the train could be late, you could feel sick every once a while, or you might not be able to find a seat on the train because it’s too crowded. These things do happen, and that’s ok. As long as you treat your implementation intention seriously, you can adapt and still follow through your commitments.</p><h4><strong>Make It Attractive: Increase Craving Through Temptation Bundling</strong></h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*KrLcvyQQogcHgsnRBi6GLA.png\" /><figcaption><a href=\"https://unsplash.com/photos/6SOc_IqY9mk\">Image Credit</a>: Is your learning project attractive enough to get you taking action?</figcaption></figure><p>Suppose the train is on time, and I found a good seat, it can still feel like a struggle to dive right back into the learning materials. In these situations, a technique called <a href=\"https://jamesclear.com/temptation-bundling\"><strong>Temptation Bundling</strong></a> can be very handy. At its core, the idea is to link behavior that you <em>need</em> to do with a behavior that you <em>want</em> to do. By bundling the hard thing with the pleasurable thing together, the hard thing becomes more attractive.</p><p>As a concrete example, grokking intellectually challenging concepts in Deep Learning isn’t always the easiest. On the other hand, I always really enjoy writing a neat learning summary whenever I finish a new concept, as I find that process soothing. By bundling these two activities, I convinced myself that if I could engage with the materials and learn a new concept (what I <em>need to do</em>), I will be able to produce a well-written summary by the end of the session (what I <em>want to do</em>). Furthermore, the fact that these two activities are sequentially related, means that bundling can be particularly effective.</p><p>Not every person struggling with Deep Learning is obsessed with well-written <a href=\"https://github.com/robert8138/deep-learning-deliberate-practice/tree/master/concepts\">documentation</a>. The general lesson here, however, is to identify what things you <em>need</em> to do, what things you <em>want</em> to do and think of ways of linking some of them together. By going through this design exercise, you can drastically improve your motivation to carry your routines forward.</p><h4><strong>Make It Easy: Remove Logistical Complexity Ahead of Time</strong></h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*ca-ZuhLYH3YutaC-liYH9A.png\" /><figcaption><a href=\"https://unsplash.com/photos/dCAKIpxs3eE\">Image Credit</a>: If the task you need to perform is too hard to do, you won’t do it</figcaption></figure><p>Even when I am already engaging with my learnings during my commute, there could still be challenges. As an example, if I am working through a MOOC, I generally do not like to consume video lectures on my tiny phone screen. In addition, the internet connection can be unstable and the streaming experience can be sporadic, the whole experience can feel inconvenient. These logistical complexities can easily creep up on me and kill productivity. As a result, I decided to simplify and remove these complexities ahead of time.</p><p>For example, to overcome the inconvenience, I always pre-<a href=\"https://en.savefrom.net/1-youtube-video-downloader-1/\">download</a> the video lectures to my laptop before my commute. Once I am on the train, I could then play the lectures in 2X the speed, or even play back and forth without any internet interruptions. Furthermore, the logistics of deciding what materials to download on a given day is also solved, because I can go back to my learning schedule and my time log to identify which lessons to pursue next. The preparation process is lightweight and seamless.</p><p>Depending on the task at hand, there could be many ways to make it easier. Tactics such as <a href=\"https://jamesclear.com/small-habits\">starting small</a>, reducing scope, and leveraging <a href=\"https://jamesclear.com/akrasia\">commitment devices</a> are all worth trying when designing your routines.</p><h4><strong>Make It Satisfying: Using Github to Keep Track of My Progress</strong></h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*RynYCpN1X7r0j-tby8RY4g.png\" /><figcaption>I used Github’s commit heat map to visually see my progress</figcaption></figure><p>Finally, to celebrate the progress that I made, I used a combination of visual cues and public artifacts to reward myself. For example, I use Github’s commit heat map to visually track my progress. As much as I know the number of commits is a vanity metric, being able to visualize them at a glance is still very powerful. <a href=\"https://jamesclear.com/stop-procrastinating-seinfeld-strategy\">Jerry Seinfeld</a>, the legendary comedian, uses this very same technique to motivate himself to write jokes every day:</p><blockquote>“After a few days, you’ll have a chain. Just keep at it and the chain will grow longer every day. You’ll like seeing that chain, especially when you get a few weeks under your belt. Your only job is to not break the chain.”</blockquote><p>While never breaking the chain is very difficult, Clear proposed a slightly more lenient version called <a href=\"https://www.youtube.com/watch?v=dMwnQO8MUjw\"><strong>Never Miss Twice</strong></a>, which I find both practical and empathetic.<strong> </strong>The idea is the following — it is acceptable to break the chain every once a while, but when you do, never miss your routine twice in a row. It is not just about adhering to a routine, but it is also about how fast and how consistent you can get back on track. Grit is the key to success.</p><p>Designing good learning habits takes time and thoughtful thinking. But once you have the right designs in place, they are not as hard to follow as you originally imagined. By following the strategies derived from the <strong>Four Laws of Good Habit Formation</strong>, you can greatly increase the odds of completing your work to drive high performance.</p><h3>Transform Learnings Into Tools In Your Toolkit</h3><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*Zgsn95NzmKcr_EYAn5DXHQ.png\" /><figcaption><a href=\"https://unsplash.com/photos/IClZBVw5W5A\">Image Credit</a>: Are you adding new tools to your toolkit from your learning projects?</figcaption></figure><p>Without continuous training and consistent practice, over time, even the greatest athletes and musicians would experience skill deterioration. This is even more true among knowledge workers, many of whom “practice” and “training” are less tangible and more abstract.</p><p>For example, even for some of my well-executed projects, without further practice, I tend to forget about 30% to 50% of what I initially learned in the following six months. Without more investments, knowledge and skills that are fresh to our memory can go away rather quickly. The good news is, depending on whether you are trying to learn <em>procedures</em>, <em>concepts</em>, or <em>facts</em>, we can adopt different strategies to extend the half-life of our learnings.</p><h4>Procedures: Find Opportunity To Do “Practice Drills” On the Job</h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*-wDwkaoZS0qV9K1tTxz8HQ.png\" /><figcaption><a href=\"https://unsplash.com/photos/uvMSarsRHzo\">Image Credit</a>: What are some of the ways you can do practice drills on the job?</figcaption></figure><p>One strategy to effectively sharpen your skills is to <em>directly</em> <em>practice</em> and <em>apply</em> that skill on the job. Not only will you be able to correlate your current level of expertise with the quality of your output, but this strategy will also create urgency and accountability that vehemently forces you to do your work better.</p><p>In the early days of my self-directed learning journey, I largely saw these projects as standalone intellectual exercises — whether I applied the skills or not is not that consequential. Nowadays, I see self-directed learning as an investment in my career, and there is no better feedback than to see how well I can deploy these skills to facilitate my work. As an example, after my push to deliberately <a href=\"https://github.com/robert8138/python-deliberate-practice\">improve my Python skills</a>, I forced myself to conduct analyses at work in Python to see how efficient I could be. Similarly, I took on projects where reading and writing Python code is essential to completing the work. I also proactively studied how Object-oriented Python is used to design some of Airbnb’s Data Engineering frameworks. Every activity deepened my muscle memory and made me more familiar with the core skills involved.</p><p>The road to mastery is a long one, and it is only through many practices will we get closer. Given that we spend a disproportionate amount of time at work, identifying work projects that will take your skill to the next level <em>on the job</em> is a high leverage exercise. At times, this might give you a feeling of defeat or a temporary loss in productivity, but by enduring the discomfort and working through the feedback, you will get better at these procedural learnings.</p><h4>Concepts: Build Mental Models And Teach Others</h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*AMmDlyZSSMYs7KoY_JxWvg.png\" /><figcaption><a href=\"https://unsplash.com/photos/7e2pe9wjL9M\">Image Credit</a>: Have you ever experienced a eureka moment where you started to “get it”?</figcaption></figure><p>Have you ever experienced a eureka moment where, all of a sudden, many ideas and concepts you previously struggled with now started to make sense? I certainly have, and I suppose these “aha moments” are not uncommon among avid learners. When these moments arrive, it is critically important to slow down and capture those thoughts. Here is a process that I recommend:</p><ul><li><strong>Write those insights down: </strong>As it has been said, <a href=\"https://medium.learningbyshipping.com/writing-is-thinking-an-annotated-twitter-thread-2a75fe07fade?gi=bc12710a469\">writing is thinking</a>. By writing things down, it helps you to develop a logical narrative of your understanding, and it helps you to confront fuzzy ideas and half-baked thoughts. Writing is one of the most powerful ways to drive clarity.</li><li><strong>Validate your mental models with experts: </strong>With your mental models written down, share them with subject-matter experts who, in terms, have their mental model of the same subject. By learning and comparing different mental models, you can gut check if you are on the right track.</li><li><strong>Voraciously teach others what you learned: </strong>After confirming your intuition, find opportunities to teach and share your mental models. By articulating and sharing your perspectives, the power of teaching and explaining will help you to refine what you have learned.</li></ul><p>The process above is a powerful way to translate amorphous understanding into concrete mental models. As an example, when things started to click for me for Data Engineering, I wrote down my thoughts and shared them with other experts in the company to get feedback. I summarized them in a series of <a href=\"https://medium.com/@rchang/a-beginners-guide-to-data-engineering-part-i-4227c5c457d7\">blog posts</a> and I found every possible opportunity to teach new hires about this topic. By applying my mental model in various situations, these exercises helped me to draw an increasingly clear mental picture in my mind.</p><h4>Facts: Use Free Recall, Spaced Repetition, and Interleaving</h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*51jxxlH9qpmeWQcE6-btRA.png\" /><figcaption><a href=\"https://unsplash.com/photos/hgFY1mZY-Y0\">Image Credit</a>: Have you ever used free recall to remember facts you have learned?</figcaption></figure><p>Despite living in a world where facts are just a few keystrokes away, active memory recall can still be very useful in many situations. For example, being able to retrieve known facts from your brain can help you triangulate and validate new information on the spot. In a debate, being able to cite relevant facts can make your argument more compelling. Being able to remember facts well is quite underrated in this information age. When it comes to fact-based learning, I have found the following techniques quite useful:</p><ul><li><strong>Free Recall: </strong>After consuming some new materials, immediately force yourself to summarize the main points from memory without looking at it</li><li><strong>Spaced Repetition</strong>: Spread out your exercises over time, repeat them often and do not force the materials onto yourself in a short cramming session</li><li><a href=\"https://www.scientificamerican.com/article/the-interleaving-effect-mixing-it-up-boosts-learning/\"><strong>Interleaving</strong></a><strong>: </strong>Mix several topics together and use free recall and spaced repetition together. Instead of reviewing topic A & B in a sequence “AAAAAA” and “BBBBBB”, interleave them with “AAA-BBB-AAA-BBB”</li></ul><p>For example, when trying to digest facts and ideas from a book, I often found free recall a more effective technique than sentence highlighting. By closing the book and forcing myself to reiterate the main points, I often realized how incoherent I was or how little I could explain these points the first time around. However, by repeating this retrieval process several times, and connecting them with other related materials (of which I also practice free recall), these spaced-out, interleaved exercises helped me to internalize facts much more effectively.</p><h3>Closing</h3><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*MSYrQzglSdhN7wsXVq4TKA.png\" /><figcaption><a href=\"https://visme.co/blog/amazing-leaders-who-once-had-crippling-stage-fright-and-how-they-overcame-it/\">Image credit</a>: Warren Buffett, a creature of habits</figcaption></figure><p><a href=\"https://www.youtube.com/watch?v=RYHPlLsdW0A\">Warren Buffett</a>, also known as the “Oracle of Omaha”, is one of the world’s most renowned investors and philanthropists. In addition to those two public roles, he always considered himself a teacher. Notably, he always advises young people to seek role models whose qualities and traits they admire and encourage them to make those qualities as their own.</p><p>To me, in addition to Buffett’s <a href=\"https://www.youtube.com/watch?v=ldPh0_zEykU#t=12m15s\">whimsical humor</a> and <a href=\"https://www.youtube.com/watch?v=O0R_9L_D2Yk\">strong integrity</a>, what I admire him the most, is not his wealth, but his consistency. He still lives in the modest house he bought in 1958, he still drives by the same McDonald’s for breakfast every day, and he continues to conduct his life with the same principles and philosophies. His long-time investment partner and friend Charlie Munger calls him an absolute “<strong>lifelong learning machine</strong>”, and I suspect he did not become one without his habits for learning. He once said:</p><blockquote><a href=\"https://www.youtube.com/watch?v=ldPh0_zEykU#t=08m35s\">[Chains of habit are] too light to be felt until they are too heavy to be broken</a></blockquote><p>I wrote this series partly because I believe many of us have a strong desire to learn and grow, but I also believe we do not discuss enough how to design and build systems and routines to support our learnings. I hope by sharing some of my own experiences and research from others, you too can be inspired to build your system and become a lifelong learning machine!</p><p>Happy learning!</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=3c5ab4b3dd98\" width=\"1\" height=\"1\" alt=\"\">"
}