{
  "title": "I'm moving to San Francisco. And hiring",
  "link": "",
  "published": "2013-03-22T00:00:00-07:00",
  "updated": "2013-03-22T00:00:00-07:00",
  "author": {
    "name": "Wes McKinney"
  },
  "id": "tag:wesmckinney.com,2013-03-22:/blog/im-moving-to-san-francisco-and-hiring/",
  "summary": "<p>PyCon and PyData 2013 were a blast this last week. Several people noted that my GitHub activity on pandas hasn't quite been the same lately and wondered if I was getting a little burned out. I'm happy to say quite the opposite; I'll still be involved with pandas development (though not the 80 hours/week of the last 2 years), but I'm starting an ambitious new data project that I'm looking forward to sharing later this year. This endeavor is also taking me from New York to San Francisco. I'm sad to be leaving the (vibrant and growing) New York data community, but also looking forward to spending more time with my data hacking friends in the Bay Area.</p>",
  "content": "<p>PyCon and PyData 2013 were a blast this last week. Several people noted that my GitHub activity on pandas hasn't quite been the same lately and wondered if I was getting a little burned out. I'm happy to say quite the opposite; I'll still be involved with pandas development (though not the 80 hours/week of the last 2 years), but I'm starting an ambitious new data project that I'm looking forward to sharing later this year. This endeavor is also taking me from New York to San Francisco. I'm sad to be leaving the (vibrant and growing) New York data community, but also looking forward to spending more time with my data hacking friends in the Bay Area.</p>\n\n\n<p>While I can't share too many details about the new startup, anyone who knows me knows my passion for innovation in data tooling and making people and organizations more productive in their data analysis. <a href=\"http://pandas.pydata.org\" target=\"_blank\">pandas</a> was Act 1! So, I'm building a world class team of engineers, designers, and forward thinkers to join me in this effort. Are you one of them? If so I look forward to hearing from you (my e-mail address can be easily located on GitHub):</p>\n<h3>Front-end and Data Visualization Engineer</h3>\n<p>You will be building a richly featured web application that will stretch the capabilities of modern web browsers. You will build core UI components and work with the UX designer and backend team to make everything work seamlessly.</p>\n<ul>\n<li>Extensive Javascript and CSS experience.</li>\n<li>Experience with one or more SVG or Canvas-based visualization toolkits, i.e. D3.js, or a keen interest in learning. Maybe you've spent a lot of time on http://bl.ocks.org. Extra points if you have opinions about the Grammar of Graphics (or its implementations, like ggplot2).</li>\n<li>Know the ins and outs of websockets and AJAX communications with various backend data services.</li>\n<li>Understand data binding and have used MV* frameworks enough to be dangerous.</li>\n<li>Prior data analysis experience (even at the Excel level) very useful.</li>\n</ul>\n<h3>Data Engineer</h3>\n<p>You are a pragmatic, performance-motivated cruncher of bytes who knows what it means to ship code on tight deadlines. You have high standards but are willing to make tradeoffs to get stuff done. You and I will spend a lot of time at the whiteboard talking about the nuts and bolts of data processing. Some of these things may describe you:</p>\n<ul>\n<li>Experience building performance and latency-sensitive, data-driven analytical applications.</li>\n<li>Knowledge of standard data structures and algorithms for data processing, their implementation details, and performance tradeoffs (hash tables, vectors, binary trees, sorting algorithms, etc.). Maybe you already have enjoyed reading my blog.</li>\n<li>Knowledge of binary data formats, serialization schemes, compression, and other IO performance considerations. Familiar with a variety of database technology.</li>\n<li>Python and C/C++ experience preferred. Extra points if you have programmed in an APL dialect (J or K/Q/Kona) or solved 100 or more problems on Project Euler.</li>\n<li>You are a firm believer in unit testing and continuous integration.</li>\n<li>Experience with building distributed data systems and analytics tools such as Spark, Crunch, or Pig a plus. Maybe you loved the Google Dremel white paper.</li>\n<li>Experience with code generation (e.g. LLVM) or compiler technology a big plus.</li>\n</ul>\n<h3>UX Designer</h3>\n<p>You will be responsible for web design and crafting a compelling user experience. You will work intimately with the front-end / data visualization team to make a consistent look and feel throughout the product. We would prefer a designer who can also do her/his own JS/CSS implementation work if necessary. Any experience with data analysis tools, from Excel to Spotfire to Matlab (with opinions about what makes each of them easy—or terrible—to use), would be strongly preferred.</p>\n<h3>Full Stack Web Engineer</h3>\n<p>You will play a critical role in building a scalable, reliable web application, and generally keeping the trains running on time. You should be a jack of many trades with an interest in learning many more. Here are some desirable qualities:</p>\n<ul>\n<li>Extensive experience using Python, Javascript (Node.js), etc. to build scalable, data-intensive web applications, and with strong opinions about the right technology to use.</li>\n<li>Comfort with managing continuous (or highly frequent) deployments.</li>\n<li>Experience with using and managing SQL (e.g. Postgres) and NoSQL (e.g. MongoDB) databases.</li>\n<li>Experience building applications EC2 or other cloud computing services.</li>\n</ul>\n<h3>Product Lead</h3>\n<p>You will run product at the company, working to gain a deep understanding of customer use cases and working with the engineering team to drive product-market fit. Prior experience in the data analytics or business intelligence space would be very helpful.</p>"
}