{
  "title": "AI Helps Humans Level Up",
  "link": "https://spectrum.ieee.org/ai-tools",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-man-in-a-white-shirt-and-blue-blazer-moves-a-chess-piece-on-a-board.png?id=31999824&width=1200&height=800&coordinates=0%2C0%2C0%2C0\"/><br/><br/><p>\n<strong>Back in the </strong>mid-1970s, <em>IEEE</em> <em>Spectrum</em> senior editor Phil Ross played one of the first chess programs capable of vanquishing humans. He capitulated quickly—too quickly, it turned out: Although the program that beat him was good at openings and the middle game, it was terrible at the end game. Fast forward 50 years and the highest-ranked chess players in the world are AIs, with humans trailing far behind.\n</p><p>\n\tAs Ross points out in his online piece “\n\t<a href=\"https://spectrum.ieee.org/magnus-carlsen-chess-scandal-ai\" target=\"_self\">AI’s Grandmaster Status Overshadows Chess Scandal</a>,” the recent brouhaha involving world champion Magnus Carlsen and up-and-comer Hans Niemann highlights how chess-playing AIs, referred to as “engines” by the cognoscenti, have overtaken humans in terms of raw game-playing accuracy. The scandal also shows how AIs are being used by players at all levels to get better faster, fostering a boom in the sport.\n</p><hr/><p>\n\tIf you were born a few decades ago, your best shot at playing and learning from grandmasters was either to be lucky enough to know one or to somehow qualify for the high-level tournaments in which they participated. Nowadays, chess newbies can log in and play engines that far exceed their own abilities, learning strategies and moves in days or weeks that in the past might have taken months or years. Engines can also help neophytes and grandmasters alike analyze their own games to give them an edge against human opponents. In fact, if you burrow down the rabbit holes of chess YouTube or Twitch, you’ll find grandmasters giving move-by-move analyses of games that engines played \n\t<em>against each other</em>. These AI tools, along with the humans who use them, are readily accessible: You can play the cybernetic versions of super grandmasters, like the open-source, current top-ranked chess engine <a href=\"https://stockfishchess.org/blog/2021/stockfish-14-1/\" rel=\"noopener noreferrer\" target=\"_blank\">Stockfish 14.1</a>, not to mention tens of millions of human opponents on sites like <a href=\"https://www.chess.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Chess.com</a>, a global community of some 93 million players and a central player in the cheating controversy.\n</p><p>\n\tWhile it is certainly true that bad actors use AI to cheat at chess—potentially posing an existential threat to the game, as Carlsen has suggested—it is equally true that the chess world has openly embraced AI and has been thriving as a result. Similar risk/reward calculations will need to be made in other domains.\n</p><p class=\"pull-quote\">\n\t“The well-designed user interfaces on these tools lower the threshold of entry but do not raise the ceiling of performance. Expert programmers will still be needed to make breakthrough programming innovations, like the next generation of AI-infused tools or post-AI supertools.” —Ben Shneidermann\n</p><p>\n\tTake software development. On page 5 in this issue, the journalist Craig S. Smith looks at the proliferation of AI-powered code-writing assistants and how they can help programmers compose better programs faster and guide nonprogrammers to instantiate their ideas in software. As for the risk of these AI assistants driving humans out of programming, the experts Smith talked to don’t believe that human coders are going to be replaced anytime soon.\n</p><p>\n\tInstead, programmers are learning that AI can automate routine tasks such as writing unit tests that verify discrete chunks of code, which can free up a portion of a developer’s time to spend on more creative endeavors. Amazon’s CodeWhisperer, GitHub’s Copilot, and Microsoft’s TiCoder are all based on large language models trained up on massive code bases. Among other things, these coding assistants suggest auto-completions for developers as they write code and can also make suggestions for executable instructions using natural language. In the case of TiCoder, a feedback mechanism interrogates programmers to resolve ambiguities so it can generate the cleanest possible code.\n</p><h3></h3><br/><div class=\"rblad-ieee_in_content\"></div><p>\n\t“Like compilers for high-level languages, code-checkers, and interactive development environments, AI-infused coding tools will speed the programmer's work,” says Ben Shneiderman, IEEE Fellow and author of “\n\t<a href=\"https://global.oup.com/academic/product/human-centered-ai-9780192845290?cc=us&lang=en&\" rel=\"noopener noreferrer\" target=\"_blank\">Human-Centered AI</a>” (Oxford University Press, 2022). “The well-designed user interfaces on these tools lower the threshold of entry but do not raise the ceiling of performance. Expert programmers will still be needed to make breakthrough programming innovations, like the next generation of AI-infused tools or post-AI supertools.”\n</p><p>\n\t Indeed, while some programmers might be concerned about algorithms edging them out of their jobs, they need only look to chess to see how technology can surpass human abilities and at the same time help people push past their own limits.\n</p>",
  "pubDate": "Mon, 31 Oct 2022 11:00:00 +0000",
  "guid": "https://spectrum.ieee.org/ai-tools",
  "category": [
    "Artificial intelligence",
    "Machine learning",
    "Chess",
    "Code",
    "Developers",
    "Programmers"
  ],
  "dc:creator": "Harry Goldstein",
  "media:content": ""
}