{
  "title": "Episode 121 (corrected): Top 10 Psychology Apps for the iPad, iPhone, & IPod",
  "pubDate": "Mon, 12 Apr 2010 21:46:42 +0000",
  "guid": "episode-121-corrected-top-10-psychology-apps-fo",
  "link": "http://www.thepsychfiles.com/2010/04/episode-121-top-10-psychology-apps-for-the-ipad-iphone-ipod/",
  "itunes:image": "",
  "description": "In this video episode I show you 10 of what I consider to be the best psychology apps in the app store.  There are a lot of apps out there and many are not so good, but in this episode I pick out what I consider to be credible therapy apps, excellent  mobile mind mapping tools, relaxation apps, games based on Gestalt principles of psychology, and some of the best 3 dimensional ways to look at the brain.",
  "content:encoded": "In this video episode I show you 10 of what I consider to be the best psychology apps in the app store.  There are a lot of apps out there and many are not so good, but in this episode I pick out what I consider to be credible therapy apps, excellent  mobile mind mapping tools, relaxation apps, games based on Gestalt principles of psychology, and some of the best 3 dimensional ways to look at the brain.",
  "enclosure": "",
  "itunes:duration": "22:23",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology,lecture,apps,ipad",
  "itunes:subtitle": "In this video episode I show you 10 of what I consider to be the best psychology apps in the app store.  I pick out therapy apps,  mobile mind mapping tools, relaxation apps, games based on Gestalt principles of psychology, and the best 3 brains apps.  ",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "In this video episode I show you 10 of what I consider to be the best psychology apps in the app store. There are a lot of apps out there and many are not so good, but in this episode I pick out what I consider to be credible therapy apps, excellent mobile mind mapping tools, relaxation apps, games based on Gestalt principles of psychology, and some of the best 3 dimensional ways to look at the brain."
}