{
  "title": "Episode 123: &#8220;You&#8217;ve Lost That Lovin&#8217; Feelin&#039;&#8221; by the Righteous Brothers",
  "link": "https://500songs.com/podcast/episode-123-youve-lost-that-lovin-feelin-by-the-righteous-brothers/",
  "pubDate": "Tue, 25 May 2021 00:00:23 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=761",
  "description": "<p>Episode 123 of <em>A History of Rock Music in Five Hundred Songs</em> looks at “You've Lost That Lovin' Feelin'\", the Righteous Brothers, <em>Shindig! </em>and \"blue-eyed soul\".  Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/51652467\">on \"Wooly Bully\" by Sam the Sham and the Pharaohs</a>.</p>\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n<p><strong>Erratum</strong></p>\n<p>I say the music in the bridge drops down to “just the bass”. Obviously there is also a celeste on that section.</p>\n<p><strong>Resources</strong></p>\n<p>No Mixcloud this week due to the number of Righteous Brothers songs.</p>\n<p>A lot of resources were used for this episode.</p>\n<p><a href=\"https://amzn.to/3fhZ87W\"><em>Time of My Life: A Righteous Brother's Memoir</em> i</a>s Bill Medley's autobiography.</p>\n<p><a href=\"https://amzn.to/325o24w\">Always Magic in the Air: The Bomp and Brilliance of the Brill Building Era</a> by Ken Emerson is a good overview of the Brill Building scene, and I used it for bits about how Mann and Weil wrote their songs.</p>\n<p>I’ve referred to two biographies of Spector in this episode, <a href=\"https://amzn.to/35C05CU\"><em>Phil Spector: Out of His Head</em> by Richard Williams</a> and <a href=\"https://amzn.to/32OKWMK\"><em>He’s a Rebel</em> by Mark Ribkowsky</a>.</p>\n<p><a href=\"https://amzn.to/3umr8eK\">This two-CD set </a>contains all of the Righteous Brothers recordings excerpted here, all their hits, and a selection of Medley and Hatfield's solo work. It would be an absolutely definitive set, except for the Spector-era tracks being in stereo.</p>\n<p>There are many compilations available with some of the hits Spector produced, but I recommend getting<a href=\"https://amzn.to/3lOXT0V\"> <em>Back to Mono</em></a>, a four-CD overview of his career containing all the major singles put out by Philles.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?</p>\n<p><strong>Transcript</strong></p>\n<p>Today we're going to look at a record that according to BMI is the most-played song of the twentieth century on American radio, and continued to be the most played song for the first two decades of the twenty-first as well, a record that was arguably the artistic highpoint of Phil Spector's career, and certainly the commercial highpoint for everyone involved. We're going to look at \"You've Lost That Lovin' Feelin'\" by the Righteous Brothers:</p>\n<p>[Excerpt: The Righteous Brothers, \"You've Lost That Lovin' Feelin'\"]</p>\n<p>In this episode we're going to take one of our first looks at an American act who owed their success to TV. We've seen these before, of course -- we've talked in passing about Ricky Nelson, and there was an episode on Chubby Checker -- but there have been relatively few. But as we pass into the mid-sixties, and television becomes an even more important part of the culture, we'll see more of this.</p>\n<p>In 1964, ABC TV had a problem. Two years before, they'd started a prime-time folk TV show called Hootenanny:</p>\n<p>[Excerpt: Jack Linkletter introducing Hootenanny]</p>\n<p>That programme was the source of some controversy -- it blacklisted Pete Seeger and a few other Communist folk musicians, and while Seeger himself argued against a boycott, other musicians were enraged, in part because the term Hootenanny had been popularised by Seeger, Woody Guthrie, and other Communist musicians. As a result, several of the top names in the folk scene, like Joan Baez and Ramblin' Jack Elliott, refused to appear on the show. </p>\n<p>But plenty of performers did appear on the show, usually those at the poppier end of the spectrum, like the New Christie Minstrels:</p>\n<p>[Excerpt: The New Christie Minstrels, \"This Train (live on Hootenanny)\"]</p>\n<p>That lineup of the New Christie Minstrels featured, among others, Barry McGuire, Gene Clark, and Larry Ramos, all of whom we should be seeing in future episodes. </p>\n<p>But that in itself says something about the programme's problems, because in 1964, the music industry changed drastically. Suddenly, folk music was out, and rock music was in. Half the younger musicians who appeared on Hootenanny -- like those three, but also John Sebastian, John Phillips, Cass Elliot, and others -- all decided they were going to give up singing mass harmony versions of \"Go Tell it on the Mountain\" accompanied by banjo, and instead they were going to get themselves some electric guitars. And the audience, likewise, decided that they'd rather see the Beatles and the Stones and the Dave Clark Five than the New Christie Minstrels, the Limeliters, and the Chad Mitchell Trio, if that was all the same to the TV companies.</p>\n<p>And so ABC needed a new prime-time music variety show, and they needed it in a hurry. But there was a problem -- when the music industry is shifting dramatically and all of a sudden it's revolving around a style of music that is based on a whole other continent, what do you do to make a TV show featuring that music?</p>\n<p>Well, you turn to Jack Good, of course. </p>\n<p>For those of you who haven't listened to all the earlier episodes, Jack Good had basically invented rock and roll TV, and he'd invented it in the UK, at a time when rock and roll was basically a US-only genre. Good had produced a whole string of shows -- Six-Five Special, Oh Boy!, Boy Meets Girls, and Wham! -- which had created a set of television conventions for the presentation of rock and roll, and had managed to get an audience by using a whole host of British unknowns, with the very occasional guest appearance by a visiting American rocker.</p>\n<p>In 1962, he'd moved to the US, and had put together a pilot episode of a show called \"Young America Swings the World\", financed with his own money. That programme had been on the same lines as his UK shows, and had featured a bunch of then-unknowns, like Jackie DeShannon. It had also featured a band led by Leon Russell and containing Glen Campbell and David Gates, none of whom were famous at the time, and a young singer named P.J. Proby, who was introduced to Good by DeShannon and her songwriting partner Sharon Sheeley, whose demos he worked on. We talked a bit about Proby back in the episode on \"LSD-25\" if you want to go back and listen to the background on that. Sheeley, of course, had known Good when he worked with her boyfriend Eddie Cochran a few years earlier.</p>\n<p>\"Young America Swings the World\" didn't sell, and in 1964, Good returned to England to produce a TV special for the Beatles, \"Around the Beatles\", which also featured Millie singing \"My Boy Lollipop\", Cilla Black, Sounds Incorporated, the Vernons Girls, and Long John Baldry singing a Muddy Waters song with the Beatles shouting the backing vocals from the audience:</p>\n<p>[Excerpt: Long John Baldry, \"Got My Mojo Working\"]</p>\n<p>The show also featured Proby, who Good had brought over from the US and who here got his first TV exposure, singing a song Rufus Thomas had recorded for Stax:</p>\n<p>[Excerpt: P.J. Proby, \"Walking the Dog\"]</p>\n<p>Around the Beatles obviously sold to the US, and ABC, who bought it, were suddenly interested in Jack Good's old pilot, too. They asked him to produce two more pilots for a show which was eventually named Shindig!</p>\n<p>Incidentally, I've seen many people, including some on the production staff, say that the first episode of Shindig! was an episode of Ready Steady Go! with the titles changed. It wasn't. The confusion seems to arise because early in Shindig's run, Around the Beatles was also broadcast by ABC, and when Dave Clark later bought the rights to Around The Beatles and Ready Steady Go!, he released a chunk of Around the Beatles on VHS as a Ready Steady Go special, even though it was made by a totally different production team.</p>\n<p>Good got together with Sharon Sheeley and her husband, the DJ Jimmy O'Neill, and they started collaborating on the pilots for the show, which eventually credited the three of them as co-creators and producers.</p>\n<p>The second pilot went in a very different direction -- it was a country music programme, hosted by Roy Clark, who would later become a household name for co-hosting Hee-Haw, and featuring Johnny Cash, along with PJ Proby doing a couple of cover versions of old folk songs that Lonnie Donegan had made famous -- \"Rock Island Line\" and \"Cumberland Gap\". </p>\n<p>But for the third pilot, Good, Sheeley, and O'Neill went back to the old Oh Boy! formula -- they got a couple of properly famous big guest stars, in this case Little Richard and the Angels, who had had a number one the previous year with \"My Boyfriend's Back\", and a rotating cast of about a dozen unknown or little-known musical acts, all local, who they could fill the show with. The show opened with a medley with all or most of the cast participating:</p>\n<p>[Excerpt: Shindig Pilot 3 Opening Medley]</p>\n<p>And then each artist would perform individually, surrounded by a dancing audience, with minimal or no introductions, in a quick-paced show that was a revelation to American audiences used to the polite pacing of American Bandstand. For the most part, they performed cover versions -- on that pilot, even the Angels, rather than doing their own recentish number one record, sang a cover version of \"Chapel of Love\" -- and in a sign of the British influence, the pilot also featured what may be the first ska performance by an American group -- although they seem to think that \"the ska\" is a dance, rather than ska being a style of music:</p>\n<p>[Excerpt: the Hollywood All-Stars, \"Jamaica Ska\", plus Jimmy O'Neill intro]</p>\n<p>That show featured Delaney Bramlett, who would later go on to become a fairly well-known and important performer, and the Blossoms, who we've talked about previously. Both of those would become regular parts of the Shindig cast, as would Leon Russell, Bobby Sherman, Jackie and Gayle, Donna Loren, and Glen Campbell.</p>\n<p>That pilot led to the first broadcast episode, where the two main star acts were Sam Cooke, who sang a non-waltz version of \"The Tennessee Waltz\" and \"Blowin' in the Wind\", both from his cabaret act, and the Everly Brothers -- who as well as doing their own songs performed with Cooke at the end of the show in a recording which I only wish wasn't so covered with audience screams, though who can blame the audience?</p>\n<p>[Excerpt: Sam Cooke and the Everly Brothers, \"Lucille\"]</p>\n<p>Shindig was the first prime-time pop music show in the US, and became massively popular -- so much so that it quickly spawned a rival show on NBC, Hullabaloo. In a sign of just how much transatlantic back-and-forth there was at this time, and possibly just to annoy future researchers, NBC's Hullabaloo took its name, though nothing else, from a British TV show of the same name. That British TV show was made by ABC, which is not the same company as American ABC, and was a folk and blues show clearly patterned after Hootenanny, the show Shindig had replaced on American ABC. (And as a quick aside, if you're at all interested in the early sixties British folk and blues movements, I can't recommend Network's double-DVD set of the British Hullabaloo highly enough).</p>\n<p>Shindig! remained on air for two years, but the show's quality declined markedly after Jack Good left the show a year or so in, and it was eventually replaced on ABC's schedules by Batman, which appealed to largely the same audience.</p>\n<p>But all that was in the future. Getting back to the first broadcast episode, the Everlys also appeared in the opening medley, where they sang an old Sister Rosetta Tharpe song with Jackie and Gayle and another unknown act who had appeared in the pilot -- The Righteous Brothers:</p>\n<p>[Excerpt: Jackie and Gayle, The Righteous Brothers, and the Everly Brothers, \"Gonna Build a Mountain/Up Above My Head\"]</p>\n<p>The Righteous Brothers would appear on nine out of sixteen episodes broadcast between September and December 1964, and a further seventeen episodes during 1965 -- by which time they'd become the big breakout stars of the show, and had recorded the song that would become the most-played song, *ever*, on American radio, beating out such comparatively unpopular contenders as \"Never My Love\", \"Yesterday\", \"Stand By Me\" and \"Can't Take My Eyes Off of You\", a record that was played so much that in thirty-six years it had clocked up forty-five years of continuous airtime. </p>\n<p>The Righteous Brothers were a Californian vocal duo consisting of baritone Bill Medley and tenor Bobby Hatfield. Medley's career in the music business had started when he was nineteen, when he'd just decided to go to the office of the Diamonds, the white vocal group we mentioned in passing in the episode on \"Why Do Fools Fall in Love?\" who much like the Crew Cuts had had hits by covering records by Black artists:</p>\n<p>[Excerpt: The Diamonds, \"Little Darlin'\"]</p>\n<p>Young Bill Medley fancied himself as a songwriter, and he brought the Diamonds a few of his songs, and they ended up recording two of them -- \"Chimes of My Heart\", which remained unreleased until a later compilation, and \"Woomai-Ling\", which was the B-side to a flop single:</p>\n<p>[Excerpt: The Diamonds, \"Woomai-Ling\"]</p>\n<p>But Medley was inspired enough by his brief brush with success that he decided to go into music properly. He formed a band called the Paramours, which eventually gained a second singer, Bobby Hatfield, and he and Hatfield also started performing as a duo, mostly performing songs by Black R&B artists they grew up listening to on Hunter Hancock's radio show.</p>\n<p>While Medley doesn't say this directly in his autobiography, it seems likely that the duo's act was based specifically on one particular Black act -- Don and Dewey. We've mentioned Don and Dewey before, and I did a Patreon episode on them, but for those who don't remember their brief mentions, Don \"Sugarcane\" Harris and Dewey Terry were an R&B duo signed to Specialty Records, and were basically their second attempt at producing another Little Richard, after Larry Williams. They were even less successful than Williams was, and had no hits themselves, but they wrote and recorded many songs that would become hits for others, like \"Farmer John\", which became a garage-band staple, and \"I'm Leaving it Up to You\", which was a hit for Donny and Marie Osmond. While they never had any breakout success, they were hugely popular among R&B lovers on the West Coast, and two of their other singles were \"Justine\":</p>\n<p>[Excerpt: Don and Dewey, \"Justine\"]</p>\n<p>And \"Ko Ko Joe\", which was one of their few singles written by someone else -- in this case by Sonny Bono, who was at that time working for Specialty:</p>\n<p>[Excerpt: Don and Dewey, \"Ko Ko Joe\"]</p>\n<p>Hatfield and Medley would record both those songs in their early months working together, and would also perform them on Shindig!</p>\n<p>The duo were different in many ways -- Medley was tall and Hatfield comparatively short, Medley sang in a deep bass-baritone and Hatfield in a high tenor, and Hatfield was gregarious, outgoing, and funny while Medley was self-effacing and shy. The duo would often perform comedy routines on stage, patterned after Dean Martin and Jerry Lewis, and Hatfield was always the comedian while Medley was the straight man. But on the other hand, Hatfield was actually quite uncomfortable with any level of success -- he just wanted to coast through life and had no real ambition, while Medley was fiercely driven and wanted to become huge.</p>\n<p>But they both loved R&B music, and in many ways had similar attitudes to the British musicians who, unknown to them at the time, were trying to play R&B in the UK. They were white kids who loved Black music, and desperately wanted to do justice to it.</p>\n<p>Orange County, where Medley and Hatfield lived, was at the time one of the whitest places in America, and they didn't really have much competition on the local scene from authentic R&B bands. But there *was* a Marine base in the area, with a large number of Black Marines, who wanted to hear R&B music when they went out. Medley and Hatfield quickly became very popular with these audiences, who would address them as \"brother\", and called their music \"righteous\" -- and so, looking for a name for their duo act, they became The Righteous Brothers.</p>\n<p>Their first single, on a tiny local label, was a song written by Medley, \"Little Latin Lupe Lou\":</p>\n<p>[Excerpt: The Righteous Brothers, \"Little Latin Lupe Lou\"]</p>\n<p>That wasn't a success to start with, but picked up after the duo took a gig at the Rendezvous Ballroom, the surf-rock venue where Dick Dale had built his reputation. It turned out that \"Little Latin Lupe Lou\" was a perfect song to dance the Surfer's Stomp to, and the song caught on locally, making the top five in LA markets, and the top fifty nationally. It became a standard part of every garage band's repertoire, and was covered several times with moderate success, most notably by Mitch Ryder and the Detroit Wheels, whose cover version made the top twenty in 1966:</p>\n<p>[Excerpt: Mitch Ryder and the Detroit Wheels, \"Little Latin Lupe Lou\"]</p>\n<p>The Righteous Brothers became *the* act that musicians in Southern California wanted to see, even though they were very far from being huge -- Elvis, for example, would insist on his friends coming to see the duo when he was in LA filming, even though at the time they were playing at bowling alleys rather than the more glamorous venues his friends would rather visit.</p>\n<p>Georgie Woods, a Black DJ in Philadelphia who enjoyed their music but normally played Black records coined a term to describe them -- \"blue-eyed soul\" -- as a way of signalling to his listeners that they were white but he was going to play them anyway. The duo used that as the title of their second album, and it soon became a generic term for white people who were influenced by Black music -- much to Medley's annoyance. As he put it later \"It kind of bothers me when other singers call themselves “blue-eyed soul” because we didn’t give ourselves that name. Black people named us that, and you don’t just walk around giving yourself that title.\"</p>\n<p>This will, of course, be something that comes up over and over again in this history -- the question of how much it's cultural appropriation for white people to perform in musical styles created by Black people, and to what extent it's possible for that to be given a pass when the white musicians in question are embraced by Black musicians and audiences. I have to say that *to me*, Medley's attempts to justify the duo's use of Black styles by pointing out how much Black people liked their music don't ring *entirely* true, but that at the same time, I do think there's a qualitative difference between the early Righteous Brothers singles and later blue-eyed soul performers like Michael Bolton or Simply Red, and a difference between a white act embraced by Black audiences and one that is mostly appealing to other white people. This is something we're going to have to explore a lot more over the course of the series, and my statements about what other people thought about this at the time should not be taken as me entirely agreeing with them -- and indeed it shouldn't be taken as me agreeing with *myself*. My own thoughts on this are very contradictory, and change constantly.</p>\n<p>While \"Little Latin Lupe Lou\" was a minor hit and established them as locally important, none of their next few singles did anything at all, and nor did a solo single that Bobby Hatfield released around this time:</p>\n<p>[Excerpt: Bobby Hatfield, \"Hot Tamales\"]</p>\n<p>But the duo picked up enough of a following as a live act that they were picked for Shindig! -- and as an opening act on the Beatles' first US tour, which finished the same week that Shindig! started broadcasting. It turned out that even though the duo's records hadn't had any success, the Beatles, who loved to seek out obscure R&B records, had heard them and liked them, and George Harrison was particularly interested in learning from Barry Rillera, the guitarist who played with them, some of  the guitar techniques he'd used.</p>\n<p>Shindig! took the duo to stardom, even though they'd not yet had a hit. They'd appear most weeks, usually backed by a house band that included Delaney Bramlett, James Burton, Russ Titelman, Larry Knechtel, Billy Preston, Leon Russell, Ray Pohlman, Glenn Hardin, and many other of the finest studio musicians in LA -- most, though not all, of them also part of the Wrecking Crew. They remained favourites of people who knew music, even though they were appearing on this teen-pop show -- Elvis would apparently regularly phone the TV company with requests for them to sing a favourite song of his on the next week's show, and the TV company would arrange it, in the hopes of eventually getting Elvis on the show, though he never made an appearance.</p>\n<p>Medley had a certain level of snobbery towards white pop music, even after being on that Beatles tour, but it started to soften a bit after the duo started to appear on Shindig! and especially after meeting the Beach Boys on Shindig's Christmas episode, which also featured Marvin Gaye and Adam Faith. Medley had been unimpressed with the Beach Boys' early singles, but Brian Wilson was a fan of the Righteous Brothers, and asked Medley to accompany him into the men's toilets at the ABC studios -- not for any of the reasons one might imagine, but because the acoustics in the room were so good that the studio had actually installed a piano in there.</p>\n<p>There, Wilson asked Medley to listen to his group singing their version of \"The Lord's Prayer\":</p>\n<p>[Excerpt: The Beach Boys, \"The Lord's Prayer\"]</p>\n<p>Medley was blown away by the group's tight harmonies, and instantly gained a new respect for Wilson as an arranger and musician. The two became lifelong friends, and as they would often work in adjoining rooms in the same studio complex, they would often call on each other to help solve a musical problem.</p>\n<p>And the reason they would work in the same studios is because Brian Wilson was a huge admirer of Phil Spector, and those were the studios Spector used, so Wilson had to use them as well. And Phil Spector had just leased the last two years of the Righteous Brothers' contract from Moonglow Records, the tiny label they'd been on to that point.</p>\n<p>Spector, at this point, was desperate to try something different -- the new wave of British acts that had come over were swamping the charts, and he wasn't having hits like he had been a few months earlier. The Righteous Brothers were his attempt to compromise somewhat with that -- they were associated with the Beatles, after all, and they were big TV stars. They were white men, like all the new pop stars, rather than being the Black women he'd otherwise always produced for his own label, but they had a Black enough sound that he wasn't completely moving away from the vocal sound he'd always used. </p>\n<p>Medley, in particular, was uneasy about working with Spector -- he wanted to be an R&B singer, not a pop star. But on the other hand, Spector made hits, and who didn't want a hit?</p>\n<p>For the duo's first single on Philles, Spector flew Mann and Weil out from New York to LA to work with him on the song. Mann and Weil took their inspiration from a new hit record that Holland-Dozier-Holland had produced for a group that had recently signed to Motown, the Four Tops:</p>\n<p>[Excerpt: The Four Tops, \"Baby I Need Your Loving\"]</p>\n<p>Mann and Weil took that feeling, and came up with a verse and chorus, with a great opening line, \"You never close your eyes any more when I kiss your lips\". They weren't entirely happy with the chorus lyric though, considering it a placeholder that they needed to rewrite. But when they played it for Spector, he insisted that \"You've Lost That Lovin' Feelin'\" was a perfect title, and shouldn't be changed. Spector added a long bridge, based around a three-chord riff using the \"La Bamba\" chords, and the song was done.</p>\n<p>Spector spent an inordinate amount of time getting the backing track done -- Earl Palmer has said that he took two days to get one eight-bar section recorded, because he couldn't communicate exactly how he wanted the musicians to play it. This is possibly partly because Spector's usual arranger, Jack Nitzsche, had had a temporary falling out with him, and Spector was working with Gene Page, who did a very good job at copying Nitzsche's style but was possibly not as completely in tune with Spector's wishes.</p>\n<p>When Spector and Mann played the song to the Righteous Brothers, Bill Medley thought that the song, sung in Spector and Mann's wispy high voices, sounded more suitable for the Everly Brothers than for him and Hatfield, but Spector insisted it would work. Of course, it's now impossible to think of the song without hearing Medley's rich, deep, voice:</p>\n<p>[Excerpt: The Righteous Brothers, \"You've Lost That Lovin' Feelin'\"]</p>\n<p>When Mann first heard that, he thought Spector must have put the record on at the wrong speed, Medley's voice was so deep. Bobby Hatfield was also unimpressed -- the Righteous Brothers were a duo, yet Medley was singing the verses on his own. \"What am I supposed to do while the big guy's singing?\" he asked. Spector's response, \"go to the bank!\"</p>\n<p>But while Medley is the featured singer during Mann and Weil's part of the song, Hatfield gets his own chance to shine, in the bridge that Spector added, which for me makes the record -- it's one of the great examples of the use of dynamics in a pop record, as after the bombast of the chorus the music drops down to just a bass, then slowly builds in emotional intensity as Medley and Hatfield trade off phrases:</p>\n<p>[Excerpt: The Righteous Brothers, \"You've Lost That Lovin' Feelin'\"]</p>\n<p>The record was released in December 1964, and even though the Righteous Brothers didn't even perform it on Shindig! until it had already risen up the charts, it made number one on the pop charts and number two on the R&B charts, and became the fifth biggest hit of 1965 in the US. </p>\n<p>In the UK, it looked like it wasn't going to be a hit at all. Cilla Black, a Liverpudlian singer who was managed by Brian Epstein and produced by George Martin, rushed out a cover version, which charted first:</p>\n<p>[Excerpt: Cilla Black, \"You've Lost That Lovin' Feelin'\"]</p>\n<p>On their second week on the charts, Black was at number twelve, and the Righteous Brothers at number twenty. At this point, Andrew Oldham, the Rolling Stones' manager and a huge fan of Spector's work, actually took out an ad in Melody Maker, even though he had no financial interest in the record (though it could be argued that he did have an interest in seeing his rival Brian Epstein taken down a peg), saying:</p>\n<p>\"This advert is not for commercial gain, it is taken as something that must be said about the great new PHIL SPECTOR Record, THE RIGHTEOUS BROTHERS singing ‘YOU’VE LOST THAT LOVIN’ FEELING’. Already in the American Top Ten, this is Spector’s greatest production, the last word in Tomorrow’s sound Today, exposing the overall mediocrity of the Music Industry. Signed Andrew Oldham P.S. See them on this week’s READY, STEADY, GO!\"</p>\n<p>The next week, Cilla Black was at number two, and the Righteous Brothers at number three. The week after, the Righteous Brothers were at number one, while Black's record had dropped down to number five. The original became the only single ever to reenter the UK top ten twice, going back into the charts in both 1969 and 1990.</p>\n<p>But Spector wasn't happy, at all, with the record's success, for the simple reason that it was being credited as a Righteous Brothers record rather than as a Phil Spector record. Where normally he worked with Black women, who were so disregarded as artists that he could put records by the Ronettes or the Blossoms out as Crystals records and nobody seemed to care, here he was working with two white men, and they were starting to get some of the credit that Spector thought was due only him. </p>\n<p>Spector started to manipulate the two men. He started with Medley, who after all had been the lead singer on their big hit. He met up with Medley, and told him that he thought Bobby Hatfield was dead weight. Who needed a second Righteous Brother? Bill Medley should go solo, and Spector should produce him as a solo artist.</p>\n<p>Medley realised what was happening -- the Righteous Brothers were a brand, and Spector was trying to sabotage that brand. He turned Spector down.</p>\n<p>The next single was originally intended to be a song that Mann and Weil were working on, called \"Soul and Inspiration\", but Spector had second thoughts, and the song he chose was written by Goffin and King, and was essentially a rewrite of \"You've Lost That Lovin' Feelin'\". To my mind it's actually the better record, but it wasn't as successful, though it still made the US top ten:</p>\n<p>[Excerpt: The Righteous Brothers, \"Just Once in My Life\"]</p>\n<p>For their third Philles single, Spector released \"Hung on You\", another intense ballad, very much in the mould of their two previous singles, though not as strong a song as either. But it was the B-side that was the hit.</p>\n<p>While Spector produced the group's singles, he wasn't interested in producing albums, leaving Medley, a decent producer in his own right, to produce what Spector considered the filler tracks. And Medley and Hatfield had an agreement that on each album, each of them would get a solo spot. </p>\n<p>So for Hatfield's solo spot on the first album the duo were recording for Philles, Medley produced Hatfield singing the old standard \"Unchained Melody\", while Medley played piano:</p>\n<p>[Excerpt: The Righteous Brothers, \"Unchained Melody\"]</p>\n<p>That went out on the B-side, with no production credit -- until DJs started playing that rather than \"Hung on You\". Spector was furious, and started calling DJs and telling them they were playing the wrong side, but they didn't stop playing it, and so the single was reissued, now with a Spector production credit for Medley's production.</p>\n<p>\"Unchained Melody\" made the top five, and now Spector continued his plans to foment dissent between the two singers. This time he argued that they should follow up \"Unchained Melody\" with \"Ebb Tide\" -- \"Unchained Melody\" had previously been a hit for both Roy Hamilton and Al Hibbler, and they'd both also had hits with \"Ebb Tide\", so why not try that? Oh, and the record was only going to have Bobby Hatfield on. It would still be released as a Righteous Brothers record, but Bill Medley wouldn't be involved.</p>\n<p>That was also a hit, but it would be the last one the duo would have with Philles Records, as they moved to Mercury and Medley started producing all their records. But the damage had been done -- Spector had successfully pit their egos against each other, and their working relationship would never be the same.</p>\n<p>But they started at Mercury with their second-biggest hit -- \"Soul and Inspiration\", the song that Mann and Weil had written as a follow-up to \"You've Lost That Lovin' Feelin'\":</p>\n<p>[Excerpt: The Righteous Brothers, \"(You're My) Soul and Inspiration\"]</p>\n<p>That went to number one, and apparently to this day Brian Wilson will still ask Bill Medley whenever they speak \"Did you produce that? Really?\", unable to believe it isn't a Phil Spector production.</p>\n<p>But the duo had been pushed apart. and were no longer happy working together. They were also experiencing personal problems -- I don't have details of Hatfield's life at this period, but Medley had a breakdown, and was also having an affair with Darlene Love which led to the breakup of his first marriage. The duo broke up in 1968, and Medley put out some unsuccessful solo recordings, including a song that Mann and Weil wrote for him about his interracial relationship with Love, who sang backing vocals on the record. It's a truly odd record which possibly says more about the gender and racial attitudes of everyone involved at that point than they might have wished, as Medley complains that his \"brown-eyed woman\" doesn't trust him because \"you look at me and all you see are my blue eyes/I'm not a man, baby all I am is what I symbolise\", while the chorus of Black women backing him sing \"no no, no no\" and \"stay away\":</p>\n<p>[Excerpt: Bill Medley, \"Brown-Eyed Woman\"]</p>\n<p>Hatfield, meanwhile, continued using the Righteous Brothers name, performing with Jimmy Walker, formerly the drummer of the Knickerbockers, who had been one-hit wonders with their Beatles soundalike \"Lies\":</p>\n<p>[Excerpt: The Knickerbockers, \"Lies\"]</p>\n<p>Walker and Hatfield recorded one album together, but it was unsuccessful, and they split up. Hatfield also tried a solo career -- his version of \"Only You\" is clearly patterned after the earlier Righteous Brothers hits with \"Unchained Melody\" and \"Ebb Tide\":</p>\n<p>[Excerpt: Bobby Hatfield, \"Only You\"]</p>\n<p>But by 1974, both careers floundering, the Righteous Brothers reformed -- and immediately had a hit with \"Rock and Roll Heaven\", a tribute to dead rock stars, which became their third highest-charting single, peaking at number three. They had a couple more charting singles, but then, tragically, Medley's first wife was murdered, and Medley had to take several years off performing to raise his son. They reunited in the 1980s, although Medley kept up a parallel career as a solo artist, having several minor country hits, and also having a pop number one with the theme song from Dirty Dancing, \"I've Had the Time of My Life\", sung as a duet with Jennifer Warnes:</p>\n<p>[Excerpt: Bill Medley and Jennifer Warnes, \"I've Had the Time of My Life\"]</p>\n<p>A couple of years later, another Patrick Swayze film, Ghost, would lead to another unique record for the Righteous Brothers. Ghost used \"Unchained Melody\" in a crucial scene, and the single was reissued, and made number nineteen in the US charts, and hit number one in many other countries. It also sparked a revival of their career that made \"You've Lost That Lovin' Feelin'\" rechart in the UK. </p>\n<p>But \"Unchained Melody\" was only reissued on vinyl, and the small label Curb Records saw an opportunity, and got the duo to do a soundalike rerecording to come out as a CD single. That CD single *also* made the top twenty, making the Righteous Brothers the only artist ever to be at two places in the top twenty at the same time with two versions of the same song -- when Gene and Eunice's two versions of \"Ko Ko Mo\" had charted, they'd been counted as one record for chart purposes.</p>\n<p>The duo continued working together until 2003, when Bobby Hatfield died of a cocaine-induced heart attack. Medley performed as a solo artist for several years, but in 2016 he took on a partner, Bucky Heard, to perform with him as a new lineup of Righteous Brothers, mostly playing Vegas shows.</p>\n<p>We'll see a lot more blue-eyed soul artists as the story progresses, and we'll be able to look more closely at the issues around race and appropriation with them, but in 1965, unlike all the brown-eyed women like Darlene Love who'd come before them, the Righteous Brothers did become the first act to break free of Phil Spector and have hits without him -- though we will later see at least one Black woman Spector produced who became even bigger later. But still, they'll always be remembered primarily for the work they did with Spector, and somewhere, right now, at least one radio station is still playing \"You've Lost That Lovin' Feelin'\", and it'll probably continue to do so as long as radio exists. </p>",
  "itunes:subtitle": "Episode 123 of A History of Rock Music in Five Hundred Songs looks at “Youve Lost That Lovin Feelin, the Righteous Brothers, Shindig! and blue-eyed soul.  Click the full post to read liner notes, links to more information, and a transcript of the episode",
  "itunes:keywords": "Andrew Loog Oldham,Barry Mann,Barry McGuire,Bill Medley,Billy Preston,Cilla Black,Cynthia Weil,Darlene Love,Delaney Bramlett,Don and Dewey,Gene Clark,George Martin,Jack Good,James Burton,Larry Ramos,Little Richard,Long John Baldry,New Christie Minstrels,P.J. Proby,Phil Spector,Sam Cooke,Sharon Sheeley,The Beach Boys,The Beatles,The Blossoms,the Diamonds,The Everly Brothers,The Four Tops,The Righteous Brothers,The Wrecking Crew",
  "content:encoded": "<p>Episode 123 of <em>A History of Rock Music in Five Hundred Songs</em> looks at “You've Lost That Lovin' Feelin'\", the Righteous Brothers, <em>Shindig! </em>and \"blue-eyed soul\".  Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/51652467\">on \"Wooly Bully\" by Sam the Sham and the Pharaohs</a>.</p>\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n<p><strong>Erratum</strong></p>\n<p>I say the music in the bridge drops down to “just the bass”. Obviously there is also a celeste on that section.</p>\n<p><strong>Resources</strong></p>\n<p>No Mixcloud this week due to the number of Righteous Brothers songs.</p>\n<p>A lot of resources were used for this episode.</p>\n<p><a href=\"https://amzn.to/3fhZ87W\"><em>Time of My Life: A Righteous Brother's Memoir</em> i</a>s Bill Medley's autobiography.</p>\n<p><a href=\"https://amzn.to/325o24w\">Always Magic in the Air: The Bomp and Brilliance of the Brill Building Era</a> by Ken Emerson is a good overview of the Brill Building scene, and I used it for bits about how Mann and Weil wrote their songs.</p>\n<p>I’ve referred to two biographies of Spector in this episode, <a href=\"https://amzn.to/35C05CU\"><em>Phil Spector: Out of His Head</em> by Richard Williams</a> and <a href=\"https://amzn.to/32OKWMK\"><em>He’s a Rebel</em> by Mark Ribkowsky</a>.</p>\n<p><a href=\"https://amzn.to/3umr8eK\">This two-CD set </a>contains all of the Righteous Brothers recordings excerpted here, all their hits, and a selection of Medley and Hatfield's solo work. It would be an absolutely definitive set, except for the Spector-era tracks being in stereo.</p>\n<p>There are many compilations available with some of the hits Spector produced, but I recommend getting<a href=\"https://amzn.to/3lOXT0V\"> <em>Back to Mono</em></a>, a four-CD overview of his career containing all the major singles put out by Philles.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?</p>\n<p><strong>Transcript</strong></p>\n<p>Today we're going to look at a record that according to BMI is the most-played song of the twentieth century on American radio, and continued to be the most played song for the first two decades of the twenty-first as well, a record that was arguably the artistic highpoint of Phil Spector's career, and certainly the commercial highpoint for everyone involved. We're going to look at \"You've Lost That Lovin' Feelin'\" by the Righteous Brothers:</p>\n<p>[Excerpt: The Righteous Brothers, \"You've Lost That Lovin' Feelin'\"]</p>\n<p>In this episode we're going to take one of our first looks at an American act who owed their success to TV. We've seen these before, of course -- we've talked in passing about Ricky Nelson, and there was an episode on Chubby Checker -- but there have been relatively few. But as we pass into the mid-sixties, and television becomes an even more important part of the culture, we'll see more of this.</p>\n<p>In 1964, ABC TV had a problem. Two years before, they'd started a prime-time folk TV show called Hootenanny:</p>\n<p>[Excerpt: Jack Linkletter introducing Hootenanny]</p>\n<p>That programme was the source of some controversy -- it blacklisted Pete Seeger and a few other Communist folk musicians, and while Seeger himself argued against a boycott, other musicians were enraged, in part because the term Hootenanny had been popularised by Seeger, Woody Guthrie, and other Communist musicians. As a result, several of the top names in the folk scene, like Joan Baez and Ramblin' Jack Elliott, refused to appear on the show. </p>\n<p>But plenty of performers did appear on the show, usually those at the poppier end of the spectrum, like the New Christie Minstrels:</p>\n<p>[Excerpt: The New Christie Minstrels, \"This Train (live on Hootenanny)\"]</p>\n<p>That lineup of the New Christie Minstrels featured, among others, Barry McGuire, Gene Clark, and Larry Ramos, all of whom we should be seeing in future episodes. </p>\n<p>But that in itself says something about the programme's problems, because in 1964, the music industry changed drastically. Suddenly, folk music was out, and rock music was in. Half the younger musicians who appeared on Hootenanny -- like those three, but also John Sebastian, John Phillips, Cass Elliot, and others -- all decided they were going to give up singing mass harmony versions of \"Go Tell it on the Mountain\" accompanied by banjo, and instead they were going to get themselves some electric guitars. And the audience, likewise, decided that they'd rather see the Beatles and the Stones and the Dave Clark Five than the New Christie Minstrels, the Limeliters, and the Chad Mitchell Trio, if that was all the same to the TV companies.</p>\n<p>And so ABC needed a new prime-time music variety show, and they needed it in a hurry. But there was a problem -- when the music industry is shifting dramatically and all of a sudden it's revolving around a style of music that is based on a whole other continent, what do you do to make a TV show featuring that music?</p>\n<p>Well, you turn to Jack Good, of course. </p>\n<p>For those of you who haven't listened to all the earlier episodes, Jack Good had basically invented rock and roll TV, and he'd invented it in the UK, at a time when rock and roll was basically a US-only genre. Good had produced a whole string of shows -- Six-Five Special, Oh Boy!, Boy Meets Girls, and Wham! -- which had created a set of television conventions for the presentation of rock and roll, and had managed to get an audience by using a whole host of British unknowns, with the very occasional guest appearance by a visiting American rocker.</p>\n<p>In 1962, he'd moved to the US, and had put together a pilot episode of a show called \"Young America Swings the World\", financed with his own money. That programme had been on the same lines as his UK shows, and had featured a bunch of then-unknowns, like Jackie DeShannon. It had also featured a band led by Leon Russell and containing Glen Campbell and David Gates, none of whom were famous at the time, and a young singer named P.J. Proby, who was introduced to Good by DeShannon and her songwriting partner Sharon Sheeley, whose demos he worked on. We talked a bit about Proby back in the episode on \"LSD-25\" if you want to go back and listen to the background on that. Sheeley, of course, had known Good when he worked with her boyfriend Eddie Cochran a few years earlier.</p>\n<p>\"Young America Swings the World\" didn't sell, and in 1964, Good returned to England to produce a TV special for the Beatles, \"Around the Beatles\", which also featured Millie singing \"My Boy Lollipop\", Cilla Black, Sounds Incorporated, the Vernons Girls, and Long John Baldry singing a Muddy Waters song with the Beatles shouting the backing vocals from the audience:</p>\n<p>[Excerpt: Long John Baldry, \"Got My Mojo Working\"]</p>\n<p>The show also featured Proby, who Good had brought over from the US and who here got his first TV exposure, singing a song Rufus Thomas had recorded for Stax:</p>\n<p>[Excerpt: P.J. Proby, \"Walking the Dog\"]</p>\n<p>Around the Beatles obviously sold to the US, and ABC, who bought it, were suddenly interested in Jack Good's old pilot, too. They asked him to produce two more pilots for a show which was eventually named Shindig!</p>\n<p>Incidentally, I've seen many people, including some on the production staff, say that the first episode of Shindig! was an episode of Ready Steady Go! with the titles changed. It wasn't. The confusion seems to arise because early in Shindig's run, Around the Beatles was also broadcast by ABC, and when Dave Clark later bought the rights to Around The Beatles and Ready Steady Go!, he released a chunk of Around the Beatles on VHS as a Ready Steady Go special, even though it was made by a totally different production team.</p>\n<p>Good got together with Sharon Sheeley and her husband, the DJ Jimmy O'Neill, and they started collaborating on the pilots for the show, which eventually credited the three of them as co-creators and producers.</p>\n<p>The second pilot went in a very different direction -- it was a country music programme, hosted by Roy Clark, who would later become a household name for co-hosting Hee-Haw, and featuring Johnny Cash, along with PJ Proby doing a couple of cover versions of old folk songs that Lonnie Donegan had made famous -- \"Rock Island Line\" and \"Cumberland Gap\". </p>\n<p>But for the third pilot, Good, Sheeley, and O'Neill went back to the old Oh Boy! formula -- they got a couple of properly famous big guest stars, in this case Little Richard and the Angels, who had had a number one the previous year with \"My Boyfriend's Back\", and a rotating cast of about a dozen unknown or little-known musical acts, all local, who they could fill the show with. The show opened with a medley with all or most of the cast participating:</p>\n<p>[Excerpt: Shindig Pilot 3 Opening Medley]</p>\n<p>And then each artist would perform individually, surrounded by a dancing audience, with minimal or no introductions, in a quick-paced show that was a revelation to American audiences used to the polite pacing of American Bandstand. For the most part, they performed cover versions -- on that pilot, even the Angels, rather than doing their own recentish number one record, sang a cover version of \"Chapel of Love\" -- and in a sign of the British influence, the pilot also featured what may be the first ska performance by an American group -- although they seem to think that \"the ska\" is a dance, rather than ska being a style of music:</p>\n<p>[Excerpt: the Hollywood All-Stars, \"Jamaica Ska\", plus Jimmy O'Neill intro]</p>\n<p>That show featured Delaney Bramlett, who would later go on to become a fairly well-known and important performer, and the Blossoms, who we've talked about previously. Both of those would become regular parts of the Shindig cast, as would Leon Russell, Bobby Sherman, Jackie and Gayle, Donna Loren, and Glen Campbell.</p>\n<p>That pilot led to the first broadcast episode, where the two main star acts were Sam Cooke, who sang a non-waltz version of \"The Tennessee Waltz\" and \"Blowin' in the Wind\", both from his cabaret act, and the Everly Brothers -- who as well as doing their own songs performed with Cooke at the end of the show in a recording which I only wish wasn't so covered with audience screams, though who can blame the audience?</p>\n<p>[Excerpt: Sam Cooke and the Everly Brothers, \"Lucille\"]</p>\n<p>Shindig was the first prime-time pop music show in the US, and became massively popular -- so much so that it quickly spawned a rival show on NBC, Hullabaloo. In a sign of just how much transatlantic back-and-forth there was at this time, and possibly just to annoy future researchers, NBC's Hullabaloo took its name, though nothing else, from a British TV show of the same name. That British TV show was made by ABC, which is not the same company as American ABC, and was a folk and blues show clearly patterned after Hootenanny, the show Shindig had replaced on American ABC. (And as a quick aside, if you're at all interested in the early sixties British folk and blues movements, I can't recommend Network's double-DVD set of the British Hullabaloo highly enough).</p>\n<p>Shindig! remained on air for two years, but the show's quality declined markedly after Jack Good left the show a year or so in, and it was eventually replaced on ABC's schedules by Batman, which appealed to largely the same audience.</p>\n<p>But all that was in the future. Getting back to the first broadcast episode, the Everlys also appeared in the opening medley, where they sang an old Sister Rosetta Tharpe song with Jackie and Gayle and another unknown act who had appeared in the pilot -- The Righteous Brothers:</p>\n<p>[Excerpt: Jackie and Gayle, The Righteous Brothers, and the Everly Brothers, \"Gonna Build a Mountain/Up Above My Head\"]</p>\n<p>The Righteous Brothers would appear on nine out of sixteen episodes broadcast between September and December 1964, and a further seventeen episodes during 1965 -- by which time they'd become the big breakout stars of the show, and had recorded the song that would become the most-played song, *ever*, on American radio, beating out such comparatively unpopular contenders as \"Never My Love\", \"Yesterday\", \"Stand By Me\" and \"Can't Take My Eyes Off of You\", a record that was played so much that in thirty-six years it had clocked up forty-five years of continuous airtime. </p>\n<p>The Righteous Brothers were a Californian vocal duo consisting of baritone Bill Medley and tenor Bobby Hatfield. Medley's career in the music business had started when he was nineteen, when he'd just decided to go to the office of the Diamonds, the white vocal group we mentioned in passing in the episode on \"Why Do Fools Fall in Love?\" who much like the Crew Cuts had had hits by covering records by Black artists:</p>\n<p>[Excerpt: The Diamonds, \"Little Darlin'\"]</p>\n<p>Young Bill Medley fancied himself as a songwriter, and he brought the Diamonds a few of his songs, and they ended up recording two of them -- \"Chimes of My Heart\", which remained unreleased until a later compilation, and \"Woomai-Ling\", which was the B-side to a flop single:</p>\n<p>[Excerpt: The Diamonds, \"Woomai-Ling\"]</p>\n<p>But Medley was inspired enough by his brief brush with success that he decided to go into music properly. He formed a band called the Paramours, which eventually gained a second singer, Bobby Hatfield, and he and Hatfield also started performing as a duo, mostly performing songs by Black R&B artists they grew up listening to on Hunter Hancock's radio show.</p>\n<p>While Medley doesn't say this directly in his autobiography, it seems likely that the duo's act was based specifically on one particular Black act -- Don and Dewey. We've mentioned Don and Dewey before, and I did a Patreon episode on them, but for those who don't remember their brief mentions, Don \"Sugarcane\" Harris and Dewey Terry were an R&B duo signed to Specialty Records, and were basically their second attempt at producing another Little Richard, after Larry Williams. They were even less successful than Williams was, and had no hits themselves, but they wrote and recorded many songs that would become hits for others, like \"Farmer John\", which became a garage-band staple, and \"I'm Leaving it Up to You\", which was a hit for Donny and Marie Osmond. While they never had any breakout success, they were hugely popular among R&B lovers on the West Coast, and two of their other singles were \"Justine\":</p>\n<p>[Excerpt: Don and Dewey, \"Justine\"]</p>\n<p>And \"Ko Ko Joe\", which was one of their few singles written by someone else -- in this case by Sonny Bono, who was at that time working for Specialty:</p>\n<p>[Excerpt: Don and Dewey, \"Ko Ko Joe\"]</p>\n<p>Hatfield and Medley would record both those songs in their early months working together, and would also perform them on Shindig!</p>\n<p>The duo were different in many ways -- Medley was tall and Hatfield comparatively short, Medley sang in a deep bass-baritone and Hatfield in a high tenor, and Hatfield was gregarious, outgoing, and funny while Medley was self-effacing and shy. The duo would often perform comedy routines on stage, patterned after Dean Martin and Jerry Lewis, and Hatfield was always the comedian while Medley was the straight man. But on the other hand, Hatfield was actually quite uncomfortable with any level of success -- he just wanted to coast through life and had no real ambition, while Medley was fiercely driven and wanted to become huge.</p>\n<p>But they both loved R&B music, and in many ways had similar attitudes to the British musicians who, unknown to them at the time, were trying to play R&B in the UK. They were white kids who loved Black music, and desperately wanted to do justice to it.</p>\n<p>Orange County, where Medley and Hatfield lived, was at the time one of the whitest places in America, and they didn't really have much competition on the local scene from authentic R&B bands. But there *was* a Marine base in the area, with a large number of Black Marines, who wanted to hear R&B music when they went out. Medley and Hatfield quickly became very popular with these audiences, who would address them as \"brother\", and called their music \"righteous\" -- and so, looking for a name for their duo act, they became The Righteous Brothers.</p>\n<p>Their first single, on a tiny local label, was a song written by Medley, \"Little Latin Lupe Lou\":</p>\n<p>[Excerpt: The Righteous Brothers, \"Little Latin Lupe Lou\"]</p>\n<p>That wasn't a success to start with, but picked up after the duo took a gig at the Rendezvous Ballroom, the surf-rock venue where Dick Dale had built his reputation. It turned out that \"Little Latin Lupe Lou\" was a perfect song to dance the Surfer's Stomp to, and the song caught on locally, making the top five in LA markets, and the top fifty nationally. It became a standard part of every garage band's repertoire, and was covered several times with moderate success, most notably by Mitch Ryder and the Detroit Wheels, whose cover version made the top twenty in 1966:</p>\n<p>[Excerpt: Mitch Ryder and the Detroit Wheels, \"Little Latin Lupe Lou\"]</p>\n<p>The Righteous Brothers became *the* act that musicians in Southern California wanted to see, even though they were very far from being huge -- Elvis, for example, would insist on his friends coming to see the duo when he was in LA filming, even though at the time they were playing at bowling alleys rather than the more glamorous venues his friends would rather visit.</p>\n<p>Georgie Woods, a Black DJ in Philadelphia who enjoyed their music but normally played Black records coined a term to describe them -- \"blue-eyed soul\" -- as a way of signalling to his listeners that they were white but he was going to play them anyway. The duo used that as the title of their second album, and it soon became a generic term for white people who were influenced by Black music -- much to Medley's annoyance. As he put it later \"It kind of bothers me when other singers call themselves “blue-eyed soul” because we didn’t give ourselves that name. Black people named us that, and you don’t just walk around giving yourself that title.\"</p>\n<p>This will, of course, be something that comes up over and over again in this history -- the question of how much it's cultural appropriation for white people to perform in musical styles created by Black people, and to what extent it's possible for that to be given a pass when the white musicians in question are embraced by Black musicians and audiences. I have to say that *to me*, Medley's attempts to justify the duo's use of Black styles by pointing out how much Black people liked their music don't ring *entirely* true, but that at the same time, I do think there's a qualitative difference between the early Righteous Brothers singles and later blue-eyed soul performers like Michael Bolton or Simply Red, and a difference between a white act embraced by Black audiences and one that is mostly appealing to other white people. This is something we're going to have to explore a lot more over the course of the series, and my statements about what other people thought about this at the time should not be taken as me entirely agreeing with them -- and indeed it shouldn't be taken as me agreeing with *myself*. My own thoughts on this are very contradictory, and change constantly.</p>\n<p>While \"Little Latin Lupe Lou\" was a minor hit and established them as locally important, none of their next few singles did anything at all, and nor did a solo single that Bobby Hatfield released around this time:</p>\n<p>[Excerpt: Bobby Hatfield, \"Hot Tamales\"]</p>\n<p>But the duo picked up enough of a following as a live act that they were picked for Shindig! -- and as an opening act on the Beatles' first US tour, which finished the same week that Shindig! started broadcasting. It turned out that even though the duo's records hadn't had any success, the Beatles, who loved to seek out obscure R&B records, had heard them and liked them, and George Harrison was particularly interested in learning from Barry Rillera, the guitarist who played with them, some of  the guitar techniques he'd used.</p>\n<p>Shindig! took the duo to stardom, even though they'd not yet had a hit. They'd appear most weeks, usually backed by a house band that included Delaney Bramlett, James Burton, Russ Titelman, Larry Knechtel, Billy Preston, Leon Russell, Ray Pohlman, Glenn Hardin, and many other of the finest studio musicians in LA -- most, though not all, of them also part of the Wrecking Crew. They remained favourites of people who knew music, even though they were appearing on this teen-pop show -- Elvis would apparently regularly phone the TV company with requests for them to sing a favourite song of his on the next week's show, and the TV company would arrange it, in the hopes of eventually getting Elvis on the show, though he never made an appearance.</p>\n<p>Medley had a certain level of snobbery towards white pop music, even after being on that Beatles tour, but it started to soften a bit after the duo started to appear on Shindig! and especially after meeting the Beach Boys on Shindig's Christmas episode, which also featured Marvin Gaye and Adam Faith. Medley had been unimpressed with the Beach Boys' early singles, but Brian Wilson was a fan of the Righteous Brothers, and asked Medley to accompany him into the men's toilets at the ABC studios -- not for any of the reasons one might imagine, but because the acoustics in the room were so good that the studio had actually installed a piano in there.</p>\n<p>There, Wilson asked Medley to listen to his group singing their version of \"The Lord's Prayer\":</p>\n<p>[Excerpt: The Beach Boys, \"The Lord's Prayer\"]</p>\n<p>Medley was blown away by the group's tight harmonies, and instantly gained a new respect for Wilson as an arranger and musician. The two became lifelong friends, and as they would often work in adjoining rooms in the same studio complex, they would often call on each other to help solve a musical problem.</p>\n<p>And the reason they would work in the same studios is because Brian Wilson was a huge admirer of Phil Spector, and those were the studios Spector used, so Wilson had to use them as well. And Phil Spector had just leased the last two years of the Righteous Brothers' contract from Moonglow Records, the tiny label they'd been on to that point.</p>\n<p>Spector, at this point, was desperate to try something different -- the new wave of British acts that had come over were swamping the charts, and he wasn't having hits like he had been a few months earlier. The Righteous Brothers were his attempt to compromise somewhat with that -- they were associated with the Beatles, after all, and they were big TV stars. They were white men, like all the new pop stars, rather than being the Black women he'd otherwise always produced for his own label, but they had a Black enough sound that he wasn't completely moving away from the vocal sound he'd always used. </p>\n<p>Medley, in particular, was uneasy about working with Spector -- he wanted to be an R&B singer, not a pop star. But on the other hand, Spector made hits, and who didn't want a hit?</p>\n<p>For the duo's first single on Philles, Spector flew Mann and Weil out from New York to LA to work with him on the song. Mann and Weil took their inspiration from a new hit record that Holland-Dozier-Holland had produced for a group that had recently signed to Motown, the Four Tops:</p>\n<p>[Excerpt: The Four Tops, \"Baby I Need Your Loving\"]</p>\n<p>Mann and Weil took that feeling, and came up with a verse and chorus, with a great opening line, \"You never close your eyes any more when I kiss your lips\". They weren't entirely happy with the chorus lyric though, considering it a placeholder that they needed to rewrite. But when they played it for Spector, he insisted that \"You've Lost That Lovin' Feelin'\" was a perfect title, and shouldn't be changed. Spector added a long bridge, based around a three-chord riff using the \"La Bamba\" chords, and the song was done.</p>\n<p>Spector spent an inordinate amount of time getting the backing track done -- Earl Palmer has said that he took two days to get one eight-bar section recorded, because he couldn't communicate exactly how he wanted the musicians to play it. This is possibly partly because Spector's usual arranger, Jack Nitzsche, had had a temporary falling out with him, and Spector was working with Gene Page, who did a very good job at copying Nitzsche's style but was possibly not as completely in tune with Spector's wishes.</p>\n<p>When Spector and Mann played the song to the Righteous Brothers, Bill Medley thought that the song, sung in Spector and Mann's wispy high voices, sounded more suitable for the Everly Brothers than for him and Hatfield, but Spector insisted it would work. Of course, it's now impossible to think of the song without hearing Medley's rich, deep, voice:</p>\n<p>[Excerpt: The Righteous Brothers, \"You've Lost That Lovin' Feelin'\"]</p>\n<p>When Mann first heard that, he thought Spector must have put the record on at the wrong speed, Medley's voice was so deep. Bobby Hatfield was also unimpressed -- the Righteous Brothers were a duo, yet Medley was singing the verses on his own. \"What am I supposed to do while the big guy's singing?\" he asked. Spector's response, \"go to the bank!\"</p>\n<p>But while Medley is the featured singer during Mann and Weil's part of the song, Hatfield gets his own chance to shine, in the bridge that Spector added, which for me makes the record -- it's one of the great examples of the use of dynamics in a pop record, as after the bombast of the chorus the music drops down to just a bass, then slowly builds in emotional intensity as Medley and Hatfield trade off phrases:</p>\n<p>[Excerpt: The Righteous Brothers, \"You've Lost That Lovin' Feelin'\"]</p>\n<p>The record was released in December 1964, and even though the Righteous Brothers didn't even perform it on Shindig! until it had already risen up the charts, it made number one on the pop charts and number two on the R&B charts, and became the fifth biggest hit of 1965 in the US. </p>\n<p>In the UK, it looked like it wasn't going to be a hit at all. Cilla Black, a Liverpudlian singer who was managed by Brian Epstein and produced by George Martin, rushed out a cover version, which charted first:</p>\n<p>[Excerpt: Cilla Black, \"You've Lost That Lovin' Feelin'\"]</p>\n<p>On their second week on the charts, Black was at number twelve, and the Righteous Brothers at number twenty. At this point, Andrew Oldham, the Rolling Stones' manager and a huge fan of Spector's work, actually took out an ad in Melody Maker, even though he had no financial interest in the record (though it could be argued that he did have an interest in seeing his rival Brian Epstein taken down a peg), saying:</p>\n<p>\"This advert is not for commercial gain, it is taken as something that must be said about the great new PHIL SPECTOR Record, THE RIGHTEOUS BROTHERS singing ‘YOU’VE LOST THAT LOVIN’ FEELING’. Already in the American Top Ten, this is Spector’s greatest production, the last word in Tomorrow’s sound Today, exposing the overall mediocrity of the Music Industry. Signed Andrew Oldham P.S. See them on this week’s READY, STEADY, GO!\"</p>\n<p>The next week, Cilla Black was at number two, and the Righteous Brothers at number three. The week after, the Righteous Brothers were at number one, while Black's record had dropped down to number five. The original became the only single ever to reenter the UK top ten twice, going back into the charts in both 1969 and 1990.</p>\n<p>But Spector wasn't happy, at all, with the record's success, for the simple reason that it was being credited as a Righteous Brothers record rather than as a Phil Spector record. Where normally he worked with Black women, who were so disregarded as artists that he could put records by the Ronettes or the Blossoms out as Crystals records and nobody seemed to care, here he was working with two white men, and they were starting to get some of the credit that Spector thought was due only him. </p>\n<p>Spector started to manipulate the two men. He started with Medley, who after all had been the lead singer on their big hit. He met up with Medley, and told him that he thought Bobby Hatfield was dead weight. Who needed a second Righteous Brother? Bill Medley should go solo, and Spector should produce him as a solo artist.</p>\n<p>Medley realised what was happening -- the Righteous Brothers were a brand, and Spector was trying to sabotage that brand. He turned Spector down.</p>\n<p>The next single was originally intended to be a song that Mann and Weil were working on, called \"Soul and Inspiration\", but Spector had second thoughts, and the song he chose was written by Goffin and King, and was essentially a rewrite of \"You've Lost That Lovin' Feelin'\". To my mind it's actually the better record, but it wasn't as successful, though it still made the US top ten:</p>\n<p>[Excerpt: The Righteous Brothers, \"Just Once in My Life\"]</p>\n<p>For their third Philles single, Spector released \"Hung on You\", another intense ballad, very much in the mould of their two previous singles, though not as strong a song as either. But it was the B-side that was the hit.</p>\n<p>While Spector produced the group's singles, he wasn't interested in producing albums, leaving Medley, a decent producer in his own right, to produce what Spector considered the filler tracks. And Medley and Hatfield had an agreement that on each album, each of them would get a solo spot. </p>\n<p>So for Hatfield's solo spot on the first album the duo were recording for Philles, Medley produced Hatfield singing the old standard \"Unchained Melody\", while Medley played piano:</p>\n<p>[Excerpt: The Righteous Brothers, \"Unchained Melody\"]</p>\n<p>That went out on the B-side, with no production credit -- until DJs started playing that rather than \"Hung on You\". Spector was furious, and started calling DJs and telling them they were playing the wrong side, but they didn't stop playing it, and so the single was reissued, now with a Spector production credit for Medley's production.</p>\n<p>\"Unchained Melody\" made the top five, and now Spector continued his plans to foment dissent between the two singers. This time he argued that they should follow up \"Unchained Melody\" with \"Ebb Tide\" -- \"Unchained Melody\" had previously been a hit for both Roy Hamilton and Al Hibbler, and they'd both also had hits with \"Ebb Tide\", so why not try that? Oh, and the record was only going to have Bobby Hatfield on. It would still be released as a Righteous Brothers record, but Bill Medley wouldn't be involved.</p>\n<p>That was also a hit, but it would be the last one the duo would have with Philles Records, as they moved to Mercury and Medley started producing all their records. But the damage had been done -- Spector had successfully pit their egos against each other, and their working relationship would never be the same.</p>\n<p>But they started at Mercury with their second-biggest hit -- \"Soul and Inspiration\", the song that Mann and Weil had written as a follow-up to \"You've Lost That Lovin' Feelin'\":</p>\n<p>[Excerpt: The Righteous Brothers, \"(You're My) Soul and Inspiration\"]</p>\n<p>That went to number one, and apparently to this day Brian Wilson will still ask Bill Medley whenever they speak \"Did you produce that? Really?\", unable to believe it isn't a Phil Spector production.</p>\n<p>But the duo had been pushed apart. and were no longer happy working together. They were also experiencing personal problems -- I don't have details of Hatfield's life at this period, but Medley had a breakdown, and was also having an affair with Darlene Love which led to the breakup of his first marriage. The duo broke up in 1968, and Medley put out some unsuccessful solo recordings, including a song that Mann and Weil wrote for him about his interracial relationship with Love, who sang backing vocals on the record. It's a truly odd record which possibly says more about the gender and racial attitudes of everyone involved at that point than they might have wished, as Medley complains that his \"brown-eyed woman\" doesn't trust him because \"you look at me and all you see are my blue eyes/I'm not a man, baby all I am is what I symbolise\", while the chorus of Black women backing him sing \"no no, no no\" and \"stay away\":</p>\n<p>[Excerpt: Bill Medley, \"Brown-Eyed Woman\"]</p>\n<p>Hatfield, meanwhile, continued using the Righteous Brothers name, performing with Jimmy Walker, formerly the drummer of the Knickerbockers, who had been one-hit wonders with their Beatles soundalike \"Lies\":</p>\n<p>[Excerpt: The Knickerbockers, \"Lies\"]</p>\n<p>Walker and Hatfield recorded one album together, but it was unsuccessful, and they split up. Hatfield also tried a solo career -- his version of \"Only You\" is clearly patterned after the earlier Righteous Brothers hits with \"Unchained Melody\" and \"Ebb Tide\":</p>\n<p>[Excerpt: Bobby Hatfield, \"Only You\"]</p>\n<p>But by 1974, both careers floundering, the Righteous Brothers reformed -- and immediately had a hit with \"Rock and Roll Heaven\", a tribute to dead rock stars, which became their third highest-charting single, peaking at number three. They had a couple more charting singles, but then, tragically, Medley's first wife was murdered, and Medley had to take several years off performing to raise his son. They reunited in the 1980s, although Medley kept up a parallel career as a solo artist, having several minor country hits, and also having a pop number one with the theme song from Dirty Dancing, \"I've Had the Time of My Life\", sung as a duet with Jennifer Warnes:</p>\n<p>[Excerpt: Bill Medley and Jennifer Warnes, \"I've Had the Time of My Life\"]</p>\n<p>A couple of years later, another Patrick Swayze film, Ghost, would lead to another unique record for the Righteous Brothers. Ghost used \"Unchained Melody\" in a crucial scene, and the single was reissued, and made number nineteen in the US charts, and hit number one in many other countries. It also sparked a revival of their career that made \"You've Lost That Lovin' Feelin'\" rechart in the UK. </p>\n<p>But \"Unchained Melody\" was only reissued on vinyl, and the small label Curb Records saw an opportunity, and got the duo to do a soundalike rerecording to come out as a CD single. That CD single *also* made the top twenty, making the Righteous Brothers the only artist ever to be at two places in the top twenty at the same time with two versions of the same song -- when Gene and Eunice's two versions of \"Ko Ko Mo\" had charted, they'd been counted as one record for chart purposes.</p>\n<p>The duo continued working together until 2003, when Bobby Hatfield died of a cocaine-induced heart attack. Medley performed as a solo artist for several years, but in 2016 he took on a partner, Bucky Heard, to perform with him as a new lineup of Righteous Brothers, mostly playing Vegas shows.</p>\n<p>We'll see a lot more blue-eyed soul artists as the story progresses, and we'll be able to look more closely at the issues around race and appropriation with them, but in 1965, unlike all the brown-eyed women like Darlene Love who'd come before them, the Righteous Brothers did become the first act to break free of Phil Spector and have hits without him -- though we will later see at least one Black woman Spector produced who became even bigger later. But still, they'll always be remembered primarily for the work they did with Spector, and somewhere, right now, at least one radio station is still playing \"You've Lost That Lovin' Feelin'\", and it'll probably continue to do so as long as radio exists. </p>",
  "enclosure": "",
  "itunes:summary": "Episode 123 of A History of Rock Music in Five Hundred Songs looks at “You've Lost That Lovin' Feelin'\", the Righteous Brothers, Shindig! and \"blue-eyed soul\".  Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a ten-minute bonus episode available, on \"Wooly Bully\" by Sam the Sham and the Pharaohs.\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nErratum\nI say the music in the bridge drops down to “just the bass”. Obviously there is also a celeste on that section.\nResources\nNo Mixcloud this week due to the number of Righteous Brothers songs.\nA lot of resources were used for this episode.\nTime of My Life: A Righteous Brother's Memoir is Bill Medley's autobiography.\nAlways Magic in the Air: The Bomp and Brilliance of the Brill Building Era by Ken Emerson is a good overview of the Brill Building scene, and I used it for bits about how Mann and Weil wrote their songs.\nI’ve referred to two biographies of Spector in this episode, Phil Spector: Out of His Head by Richard Williams and He’s a Rebel by Mark Ribkowsky.\nThis two-CD set contains all of the Righteous Brothers recordings excerpted here, all their hits, and a selection of Medley and Hatfield's solo work. It would be an absolutely definitive set, except for the Spector-era tracks being in stereo.\nThere are many compilations available with some of the hits Spector produced, but I recommend getting Back to Mono, a four-CD overview of his career containing all the major singles put out by Philles.\nPatreon\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\nTranscript\nToday we're going to look at a record that according to BMI is the most-played song of the twentieth century on American radio, and continued to be the most played song for the first two decades of the twenty-first as well, a record that was arguably the artistic highpoint of Phil Spector's career, and certainly the commercial highpoint for everyone involved. We're going to look at \"You've Lost That Lovin' Feelin'\" by the Righteous Brothers:\n[Excerpt: The Righteous Brothers, \"You've Lost That Lovin' Feelin'\"]\nIn this episode we're going to take one of our first looks at an American act who owed their success to TV. We've seen these before, of course -- we've talked in passing about Ricky Nelson, and there was an episode on Chubby Checker -- but there have been relatively few. But as we pass into the mid-sixties, and television becomes an even more important part of the culture, we'll see more of this.\nIn 1964, ABC TV had a problem. Two years before, they'd started a prime-time folk TV show called Hootenanny:\n[Excerpt: Jack Linkletter introducing Hootenanny]\nThat programme was the source of some controversy -- it blacklisted Pete Seeger and a few other Communist folk musicians, and while Seeger himself argued against a boycott, other musicians were enraged, in part because the term Hootenanny had been popularised by Seeger, Woody Guthrie, and other Communist musicians. As a result, several of the top names in the folk scene, like Joan Baez and Ramblin' Jack Elliott, refused to appear on the show. \nBut plenty of performers did appear on the show, usually those at the poppier end of the spectrum, like the New Christie Minstrels:\n[Excerpt: The New Christie Minstrels, \"This Train (live on Hootenanny)\"]\nThat lineup of the New Christie Minstrels featured, among others, Barry McGuire, Gene Clark, and Larry Ramos, all of whom we should be seeing in future episodes. \nBut that in itself says something about the programme's problems, because in 1964, the music industry changed drastically. Suddenly, folk music was out, and rock music was in. Half the younger musicians who appeared on Hootenanny -- like those three, but also John Sebastian, Jo",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode 123 of A History of Rock Music in Five Hundred Songs looks at “You've Lost That Lovin' Feelin'\", the Righteous Brothers, Shindig! and \"blue-eyed soul\".  Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a ten-minute bonus episode available, on \"Wooly Bully\" by Sam the Sham and the Pharaohs.\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nErratum\nI say the music in the bridge drops down to “just the bass”. Obviously there is also a celeste on that section.\nResources\nNo Mixcloud this week due to the number of Righteous Brothers songs.\nA lot of resources were used for this episode.\nTime of My Life: A Righteous Brother's Memoir is Bill Medley's autobiography.\nAlways Magic in the Air: The Bomp and Brilliance of the Brill Building Era by",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}