{
  "title": "137: The Zodiac Killer: The Most Dangerous Animal of All (Part 2)",
  "link": "https://audioboom.com/posts/7614315",
  "itunes:episode": 137,
  "itunes:title": "The Zodiac Killer: The Most Dangerous Animal of All (Part 2)",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3382,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Based on <em>The New York Times</em> best-selling book of the same name, <em>The Most Dangerous Animal of All</em> is a documentary series that explores one man's search for the father who abandoned him, only to uncover the worst: he believes his father is the Zodiac killer, one of the most infamous serial killers in American history. In this episode, the evidence is scrutinized and Gary claims new DNA evidence proves that his dad is the Zodiac<br>\n<br>\n<a href=\"https://www.disappearedpod.com/\">FAM! WE LAUNCHED A NEW PODCAST</a>! \"Obsessed With: Disappeared.\" It's a true crime / comedy podcast hosted by Patrick Hinds and Ellyn Marsh--best friends of 20 years. Going in order, Patrick and Ellyn recap episodes of ID's \"Disappeared.\" The first three episodes are live now!<strong><br>\n<br>\nLOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Tue, 23 Jun 2020 10:02:15 +0000",
  "guid": "tag:audioboom.com,2020-06-23:/posts/7614315",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}