{
  "title": "Celebrating 20 years of discovery, Picower Institute looks ahead to continuing impact",
  "link": "https://news.mit.edu/2022/celebrating-20-years-discovery-picower-institute-looks-ahead-1012",
  "description": "At an exhibition marking two decades since a transformative gift from the Picower Foundation, current and alumni members described research at the forefront of neuroscience and beyond.",
  "pubDate": "Wed, 12 Oct 2022 09:00:00 -0400",
  "guid": "https://news.mit.edu/2022/celebrating-20-years-discovery-picower-institute-looks-ahead-1012",
  "dc:creator": "David Orenstein | Picower Institute for Learning and Memory",
  "content:encoded": "<p>If ever there was an event that would seem designed for dwelling on the past, it would be the anniversary celebration of an institute centered on the study of memory, but the first of many insights offered by the 20th Anniversary Exhibition of The Picower Institute for Learning and Memory at MIT Sept. 22 was that memory is all about the future.</p>\n\n<p>Ever since University of California at Berkeley psychology professor <a href=\"https://psychology.berkeley.edu/people/david-foster\">David Foster</a> was a postdoc in the Picower Institute lab of Fairchild Professor <a href=\"https://picower.mit.edu/matthew-wilson\">Matthew Wilson</a>, his research has employed sophisticated neural recordings and behavioral experiments showing that animals don’t just store memories of the spaces and objects around them. In the first talk of the day, Foster demonstrated that during periods of rest animals often think about where they might want to go and rehearse possible future routes in their mind. In other words, much like people do, they use past memory of their experiences to consider how to move forward in the future.&nbsp;</p>\n\n<p>Picower professor <a href=\"https://picower.mit.edu/susumu-tonegawa\">Susumu Tonegawa</a>, who founded MIT’s Center for Learning and Memory in 1994 and worked with the Picower family to create the Picower Institute in 2002, spoke right after Foster. He described new research led by postdoc Afif Aqrabawi showing how the brain physically turns individual memories of experience into generalizable knowledge for use in the future. Tonegawa offered the example of restaurant dining. After a few delicious dinners, you learn the general idea of what to expect the next time. A decade ago Tonegawa’s lab showed how individual event memories are represented by connected ensembles of neurons called engrams. A key ingredient of Aqrabawi’s new findings is that generalized knowledge arises from the activity of neurons that inhabit the overlap of related engrams. Essentially, they enable the brain to represent the similarities among single experiences that compose knowledge.</p>\n<p>Just as the meaning of memory is to inform the future, a clear message of the symposium was that the last two decades of the Picower Institute’s research, <a href=\"https://picower.mit.edu/research/discoveries\">discoveries,</a> and <a href=\"https://picower.mit.edu/research/innovations-inventions\">innovations</a>, as well as the training it has provided to hundreds of scientists who have carried on independent careers, are helping to shape the present and future of neuroscience, medicine, and industry.</p>\n\n<p>Each of the Picower Institute’s 13 labs were represented through talks delivered by the primary investigator, a current trainee, or a member of Picower’s growing <a href=\"https://picower.mit.edu/news/bigger-building\">“alumni”</a> community. As Picower professor and institute director <a href=\"https://picower.mit.edu/news/blending-big-data-and-benchtop-biology-tsai-and-kellis-labs-tackle-brain-diseases\">Li-Huei Tsai</a> framed it for the hybrid audience of about 1,700 people, “Each of today’s talks will illustrate in different ways the impact of our research and training on current questions across many areas of neuroscience.”</p>\n\n<p>MIT President L. Rafael Reif, in a prerecorded message, presaged the broad and urgent significance of the research those talks would cover when he praised the Picower Institute as “a brilliant collective of scientists who work together … to help us better understand ourselves and to advance solutions that offer people with brain disorders real, practical hope.”</p>\n\n<p>Reif and Tsai also led many speakers in thanking Barbara Picower, president of the <a href=\"https://www.jpbfoundation.org/\">JPB Foundation,</a> not only for the gift she and her late husband Jeffry gave back in 2002, but for continued support, vision, and insight ever since.</p>\n\n<p>In her remarks, Picower reflected those expressions of gratitude back on the researchers.</p>\n\n<p>“I am only an enabler,” she said. “It wouldn’t matter how much money anybody put into the institute if we didn’t have great scientists doing great work. So I would like to turn this around a little bit and say thank you to our scientists, many of them who have also been at the institute for 20 years or more.”</p>\n\n<p><strong>Impacts at Picower</strong></p>\n\n<p>One of those long-tenured scientists is Picower professor <a href=\"https://picower.mit.edu/earl-k-miller\">Earl K. Miller</a>, whose talk took on a past-and-future theme explicitly. He described his lab’s 27-year journey from a time when neuroscientists thought the brain worked like clockwork — individual parts all playing single, distinct roles — to the modern era, where advances in technology and understanding have revealed that amazing cognitive abilities such as working memory, prediction, categorization, and attention emerge from the brain’s ability to process information through dynamically assembled networks. His work, for instance, has shown that neurons can take on multiple roles and that brain waves of particular frequencies can assemble and coordinate ensembles of neurons as needed to sculpt the flow of information across the brain’s cortex. Hardwired connections, therefore, represent possible routes for information flow, but don’t determine it.</p>\n<p>In fact, Lister Brothers Associate Professor <a href=\"https://picower.mit.edu/steven-flavell\">Steve Flavell</a> noted that while his lab’s model organism, the <em>C. elegans</em> worm, is the only animal on the planet whose whole neural wiring diagram has been mapped out, it is still capable of producing a rich and flexible repertoire of behaviors. He described how his lab has developed advanced microscopy and computational techniques to enable unprecedentedly comprehensive correlations of the little animal’s neural activity and behavior. That in turn has allowed him to <a href=\"https://picower.mit.edu/news/simple-animal-model-reveals-how-environment-and-state-are-integrated-control-behavior\">demonstrate</a> fundamental principles of how nervous systems can account for many variables, such as internal states and environmental conditions, to generate situationally appropriate behaviors even from “hardwired” circuits.</p>\n\n<p>Jeongtae Kwon, a postdoc in the lab of Mark Hyman Jr. Associate Professor <a href=\"https://picower.mit.edu/gloria-choi\">Gloria Choi</a>,<strong> </strong>described a vivid new example of behavioral flexibility in mice. He recently led a <a href=\"https://picower.mit.edu/news/mice-naturally-engage-physical-distancing-study-finds\">study</a> showing that while male mice have a powerful mating instinct, a circuit connecting olfactory regions with a brain region called the amygdala will override that instinct if a potential mating partner smells like she is sick. Essential to this “social distancing” circuit’s function is the presence of the neuromodulatory chemical TRH. Kwon is planning to continue his work when he starts his own lab in Korea in October.</p>\n\n<p>Picower researchers are not only illuminating how the brain produces knowledge, cognition, and behavior, but also consciousness. Representing the lab of <a href=\"https://picower.mit.edu/emery-n-brown\">Emery N. Brown</a>, Edward Hood Taplin Professor of Medical Engineering and Computational Neuroscience, graduate student <a href=\"https://bioelectronics.mit.edu/author/indie-garwood/\">Indie Garwood</a> described how the lab has shown how ketamine general anesthesia works. They’ve found that it promotes an unusual signature of gamma wave activity that disrupts consciousness and that the waves arise from how the drug promotes elevated production of the neuromodulatory chemical acetylecholine. Such findings point to new ideas for the future, she said, including improving monitoring anesthesia in the operating room, improving understanding of how ketamine affects the brain at a systemic level, and understanding more about how drugs like ketamine affect consciousness.</p>\n<p>In his talk, Newton Professor <a href=\"https://picower.mit.edu/mriganka-sur\">Mriganka Sur</a> traced an arc of his lab’s 30 years of research from the past to the future, showing how fundamental research can lead to the development of clinical treatments. Beginning with a revolutionary study in which he demonstrated the brain’s “plasticity” by showing how a developing ferret’s brain would repurpose the auditory cortex to augment the visual cortex if cut off from input from the ears, Sur’s lab has gone on to study cortical plasticity intensely. His lab has produced powerful demonstrations of how neural activity changes with learning and how individual neural connections, or synapses, change to enable such adaptive flexibility. He also described how such investigations have revealed a promising treatment for Rett syndrome: In 2009 the lab showed how a protein that is crucial for regulating synaptic plasticity is lacking in the developmental condition and that many symptoms can be improved with doses of the protein called <a href=\"https://picower.mit.edu/innovations-inventions/igf1\">IGF-1.</a> A company that has run with the idea has now successfully completed phase 3 clinical trials and asked the FDA to approve the treatment.</p>\n\n<p>“We expect that IGF-1 peptide, with two methyl groups added so that it is bioavailable longer, will be approved as the first thereapeutic for any neurodevelopmental disorder,” Sur said.</p>\n\n<p>Ever since Associate Professor <a href=\"https://picower.mit.edu/myriam-heiman\">Myriam Heiman</a> joined the institute in 2011, her research has been guided by the principle that fundamental understanding can lead to breakthroughs in addressing disease. She focused her talk on a new, highly emblematic and collaborative <a href=\"https://picower.mit.edu/news/new-atlas-cells-carry-blood-brain\">study</a> led by grad student <a href=\"https://heiman.mit.edu/team/garcia-francisco/\">Francisco Garcia</a>. Using several innovative techniques, the research not only produced the first comprehensive map of the cell types that make up the brain’s blood vessels, but also identified specific ways in which the integrity of the blood-brain barrier unravels in Huntington’s disease. Because blood-brain barrier deficiencies are noted in many other diseases, she said, the findings could help address many disorders.<strong> </strong></p>\n\n<p><strong>Impact beyond</strong></p>\n\n<p>As much as the Picower Institute contributes to the field through research in its labs, it also contributes by training researchers, like Foster and Kwon, who then establish their own. When he was a postdoc in Tsai’s lab, for example, <a href=\"https://profiles.mountsinai.org/joel-w-blanchard\">Joel Blanchard</a> engineered a cutting-edge <a href=\"https://picower.mit.edu/news/study-finds-path-addressing-alzheimers-blood-brain-barrier-impairment\">model</a> of the human blood-brain barrier using stem cells to investigate the effects of an Alzheimer’s disease risk gene. Now an assistant professor at Mt. Sinai, he continues to use stem cells to study aging and neurodegenerative disease. In his talk, Blanchard described a new study in which his lab used stem cells to model the pathology of a gene mutation that causes a rare juvenile form of Parkinson’s disease. The models have revealed that the mutation causes cells called astrocytes to become toxic to neighboring dopamine-producing neurons and have helped the lab identify a drug that can prevent the adverse pathology.</p>\n\n<p>Much as Blanchard has continued his neurodegeneration work, <a href=\"https://neuroscience.illinois.edu/profile/bda5\">Ben Auerbach</a>, an alumnus of the lab of Picower professor <a href=\"https://picower.mit.edu/mark-bear\">Mark Bear</a>, has continued to study autism in his lab as an assistant professor at the University of Illinois. Auerbach described how his team has used rats modeling Fragile X syndrome to understand, at multiple levels of brain physiology, how the genetic mutation underlying the disease produces a symptom common across many autism spectrum disorders: sensory hypersensitivity. He’s found that it derives from hyperactivity among neurons in the auditory cortex and shown that chemically intervening to promote inhibition reduces auditory hypersensitivity.</p>\n\n<p>In his talk, Boston University Assistant Professor <a href=\"https://www.bu.edu/biology/people/profiles/jerry-chen/\">Jerry Chen</a> discussed how his lab has been developing technologies to allow measurements spanning neural gene expression, connectivity, activity, and animal behavior to produce “vertically integrated” insights for every animal subject in the lab. Earlier this year, the lab used <a href=\"https://www.science.org/doi/10.1126/science.abl5981\">the approach</a> to identify and characterize the key role a previously unknown type of neuron plays as a hub of cortical circuits enabling sensory processing in mice. As he spoke, he traced roots of the success back to both technologies and scientific ideas he learned when he was in the Picower lab of William R. and Linda R. Young Professor <a href=\"https://picower.mit.edu/elly-nedivi\">Elly Nedivi</a>.</p>\n\n<p>There is, of course, no requirement at all that alumni carry on their research with such clear continuity. Sometimes the training and exposure they gain at the Picower Institute proves just as valuable for launching into distinct career territory.</p>\n\n<p>For example, <a href=\"http://www.sungyonkimlab.org/?page_id=81\">Sung-Yon Kim</a>, now a professor at Seoul National University, was the first postdoc in the Picower Institute and chemical engineering lab of <a href=\"https://picower.mit.edu/kwanghun-chung\">Kwanghun Chung</a>. In Chung’s lab, Kim contributed to developing innovative technologies for clearing, labeling, preserving, imaging, and analyzing brains and other tissues. But in his own research he’s making discoveries about something quite different: identifying the neural and circuit mechanisms that underlie survival behaviors including <a href=\"https://www.cell.com/neuron/fulltext/S0896-6273(21)00712-1\">finding warmth</a> and <a href=\"https://www.nature.com/articles/s41586-020-2167-2\">regulating eating</a>.</p>\n\n<p>And Zacchary Piccioli, an alumnus of the lab of Menicon Professor <a href=\"https://picower.mit.edu/troy-littleton\">Troy Littleton,</a> didn’t speak about neuroscience at all. Instead, as a director of R&amp;D strategy at Moderna, he discussed how the company hopes to use the distinct advantages inherent in mRNA vaccines (like the company’s highly successful Covid-19 vaccines) in the fight against other infectious diseases such as influenza.</p>\n\n<p>“I think Zach is a really wonderful example of how Picower alumni have impacts beyond just the field neuroscience including in clinical therapeutics,” Littleton said.</p>\n\n<p>Right before she closed the day, inviting viewers and attendees to the unveiling of the new painting “Learnings and Memories” by artist Mila Sheng in the Picower Institute lobby, MIT School of Science Dean Nergis Mavalvala noted that a particular excitement she finds in science is that finding the answers to research questions often yields new questions that evoke further discovery. There will always be more to learn.</p>\n\n<p>“We’re not only celebrating the past 20 years of Picower Institute history but we are also kicking off the next 20 years of discovery and impact,” Mavalvala said. “The quest goes on.”</p>",
  "media:content": {
    "media:description": "Members of the Picower Institute lab of Associate Professor Kwanghun Chung (from left to right:) William McCoy, Jose Vargas Asencio, Clover Su, Srinivasa Putari, and Jisoo Kim meet Tim the Beaver (center) at the Picower Institute's 20th Anniversary Exhibition poster session.",
    "media:credit": "Photo: Faith Ninivaggi"
  },
  "category": [
    "School of Engineering",
    "School of Science",
    "Biology",
    "Brain and cognitive sciences",
    "Chemical engineering",
    "Institute for Medical Engineering and Science (IMES)",
    "Picower Institute",
    "Neuroscience",
    "Research",
    "Memory",
    "Behavior",
    "Anesthesia",
    "Medicine",
    "Disease",
    "Autism",
    "Parkinson's",
    "Alzheimer's",
    "Huntington's",
    "Vaccines",
    "History of MIT",
    "Alumni/ae",
    "Special events and guest speakers"
  ]
}