{
  "id": "tag:blogger.com,1999:blog-2471378914199150966.post-2151719453661299450",
  "published": "2022-02-03T13:54:00.002-08:00",
  "updated": "2022-03-03T12:30:12.265-08:00",
  "category": "",
  "title": "Chrome 99: CSS Cascade Layers, a New Picker for Input Elements, and More",
  "content": "<p>Unless otherwise noted, changes described below apply to the newest Chrome beta channel release for Android, Chrome OS, Linux, macOS, and Windows. Learn more about the features listed here through the provided links or from the list on <a href=\"https://www.chromestatus.com/features#milestone%3D76\">ChromeStatus.com</a>. Chrome 99 is beta as of February 3, 2022. You can <a href=\"https://www.blogger.com/blog/post/edit/2471378914199150966/133027011330334491#\">download the latest on Google.com</a> for desktop or on Google Play Store on Android. </p> <h1>Preparing for Chrome 100</h1><p>This year, Chrome will release version 100, adding a digit to the version number reported in Chrome's user agent string. To help site owners test for the new string, Chrome 96 introduced a runtime flag that causes Chrome to return '100' in its user agent string. This new flag called chrome://flags/#force-major-version-to-100 has been available since Chrome 96. For more information, see <a href=\"https://developer.chrome.com/blog/force-major-version-to-100/\">Force Chrome major version to 100 in the User-Agent string</a>.</p> <h1>CSS Cascade Layers</h1><p>CSS cascade layers (<code>@layer</code> rule and layered <code>@import</code> syntax) provide a structured way to organize and balance concerns within a single origin. Rules within a single cascade layer cascade together without interleaving with style rules outside the layer. This allows authors to achieve a certain cascade ordering for same-origin rules in a proper way.</p> <p>Cascade layers allow authors to create layers to represent element defaults, third-party libraries, themes, components, overrides, etc.—and are able to re-order the cascade of layers in an explicit way. Without cascade layers, authors need to tweak, e.g., selector specificity, <code>@import</code> or source ordering to achieve a certain cascade ordering, which is cumbersome and error-prone.</p><p>For more information, see&nbsp;<a href=\"https://developer.chrome.com/blog/cascade-layers/\">Cascade layers are coming to your browser</a>.</p> <h1>New showPicker() Method on HTMLInputElement Objects</h1><p>The new <code>showPicker()</code> method on <code>HTMLInputElement</code> allows web developers to programmatically show a browser picker for input elements (temporal, color, file, and those with suggestions like datalist or autofill).</p> <p><span id=\"docs-internal-guid-d5020ade-7fff-e316-175b-ce64e204a32e\"><span style=\"font-family: Arial; font-size: 11pt; font-variant-east-asian: normal; font-variant-numeric: normal; vertical-align: baseline; white-space: pre-wrap;\"><span style=\"border: none; display: inline-block; height: 169px; overflow: hidden; width: 624px;\"><img alt=\"Date pickers on various systems\" height=\"180\" src=\"https://lh4.googleusercontent.com/mh-EzsBO7guOcVIbCddPDm1y0RDKtCxkjJqWuIqXQNR-teW4hfNkuXLVHZecX3ElFQbw8_9q8MW0vHIHuHIcxBPtAt-QbsVBZwXj0UwRWtuOV7BQoUP0n_8QYEgKZfyhy7USvUP9hw=w665-h180\" style=\"margin-left: 0px; margin-top: 0px;\" title=\"Date pickers on various systems\" width=\"665\" /></span></span></span></p> <p>Developers have been asking for years for a way to programmatically open a browser date picker. Without it, they've had to rely on custom widget libraries and CSS hacks for specific browsers.</p> <p>This is currently possible in some browsers, for some controls, via the <code>click()</code> method. Unfortunately, that doesn't work in all browsers, making the experience inconsistent across systems and users. Providing <code>showPicker()</code> gives developers a supported alternative to <code>click()</code>, and aligns Chromium's <code>click()</code> behavior with the specification and other browsers in in the future. For more information, see <a href=\"https://developer.chrome.com/blog/show-picker/\">Show a browser picker for date, time, color, and files</a>.</p> <h1>Origin Trials</h1><p>This version of Chrome introduces the origin trials described below. Origin trials allow you to try new features and give feedback on usability, practicality, and effectiveness to the web standards community. To register for any of the origin trials currently supported in Chrome, including the ones described below, visit the <a href=\"https://developers.chrome.com/origintrials/#/trials/active\">Chrome Origin Trials dashboard</a>. To learn more about origin trials in Chrome, visit the <a href=\"https://web.dev/origin-trials/\">Origin Trials Guide for Web Developers</a>. Microsoft Edge runs its own origin trials separate from Chrome. To learn more, see the <a href=\"https://developer.microsoft.com/en-us/microsoft-edge/origin-trials/\">Microsoft Edge Origin Trials Developer Console</a>. </p> <h2>New Origin Trials</h2> <h3>Dark Mode Support for Web Apps</h3><p>Web app manifests <a href=\"https://www.chromestatus.com/feature/5714780426862592\">now support the color_scheme_dark field</a> for specifying a different theme color and background color for dark mode. Currently in the web app manifest, only a single theme color and background color can be defined. This means there is no way for apps to specify a different color to use for dark mode. </p> <h2>Completed Origin Trials</h2><p>The following features, previously in a Chrome origin trial, are now enabled by default.</p> <h3>Handwriting Recognition API</h3><p>This API lets web applications use handwriting recognition services that are available on operating systems to recognize hand-written text in real time. This reduces the need for third-party integration by apps that use handwriting recognition. For more information, see <a href=\"https://web.dev/handwriting-recognition/\">Recognize your users' handwriting</a>.</p> <h3>Window Controls Overlay for Installed Desktop Web Apps</h3><p>Window controls overlay extends an app's client area to cover the entire window, including the title bar, and the window control buttons (close, maximize/restore, minimize). The web app developer is responsible for drawing and input-handling for the entire window except for the window controls overlay. Developers can use this feature to make their installed desktop web apps look like operating system apps. For more information, see <a href=\"https://web.dev/window-controls-overlay/\">Customize the window controls overlay of your PWA's title bar</a>.</p> <h1>Other Features in this Release</h1> <h2>Allow infinity, -infinity and NaN in CSS calc()</h2><p>To improve conformance with the spec, <a href=\"https://www.chromestatus.com/feature/5657825571241984\">the CSS <code>calc()</code> method now allows</a> infinity and NaN using the <code>'infinity'</code>, <code>'-infinity'</code>, and <code>'NaN'</code> keywords or expressions that can be evaluated as such, for example: 'calc(1/0)'.</p> <h2>CSS Color Adjust: 'only' Keyword for color-scheme</h2><p><strong>Note:</strong> This feature was erroneously listed as shipping in Chrome 98. It actually shipped in Chrome 99.</p> <p>The only keyword, which has been re-added to the specification for <code>color-scheme</code>, <a href=\"https://chromestatus.com/feature/5157621012103168\">is now supported in Chrome</a>. It allows opting out of <code>color-scheme</code> for single, specific elements. For example, this allows overriding of force darkening. A few examples illustrate its use.</p> <pre>div { color-scheme: light }<br /></pre> <p>This forces the <code>div</code> element out of <code>color-scheme</code> dark.</p> <pre>div { color-scheme: only light }<br /></pre> <p>This keeps the <code>color-scheme</code> for the element light as above, and opts it out of forced darkening by the user agent.</p> <h2>document.adoptedStyleSheets is Now Mutable</h2><p>In compliance with the spec, the <code>document.adoptedStyleSheets</code> property <a href=\"https://chromestatus.com/feature/5638996492288000\">is now mutable</a>, meaning operations such as <code>push()</code> and <code>pop()</code> work on it. The previous implementation of <code>adoptedStyleSheets</code> was unwieldy. For example, to add a sheet, the entire array had to be re-assigned:</p> <pre>document.adoptedStyleSheets = [...adoptedStyleSheets, newSheet];<br /></pre> <p>With the new implementation, the same operation looks like this:</p> <pre>document.adoptedStyleSheets.push(newSheet);<br /></pre> <p><strong>Note:</strong> Previously, this feature was incorrectly listed as shipping in Chrome 98.</p> <h2>Improve Alignment with Spec for Exposing nextHopProtocol Across Origin Boundaries</h2><p>The <code><a href=\"https://developer.mozilla.org/en-US/docs/Web/API/PerformanceResourceTiming\">PerformanceResourceTiming</a></code> interface exposes the <code><a href=\"https://developer.mozilla.org/en-US/docs/Web/API/PerformanceResourceTiming/nextHopProtocol\">nextHopProtocol</a></code> property to describe the underlying connection type used to fetch a resource. To follow the spec, <a href=\"https://www.chromestatus.com/feature/5706026861985792\">Chrome is removing an old special case</a> where cross-origin requests exposed potentially sensitive information, putting users at risk.</p> <h2>New Canvas 2D Features</h2><p>Chrome has added several new attributes to the <code>CanvasRenderingContext2D</code> interface to conform to specs: </p> <ul><li><code>ContextLost</code> and <code>ContextRestored</code> events</li><li><code>\"willReadFrequently\"</code> option for canvases where lots of readback is expected</li><li>More CSS text modifier support</li><li>A reset() method</li><li>A <code>roundRect</code> draw primitive</li><li>Conic gradients</li><li>Better support for SVG filters</li></ul> <p>For more information, see <a href=\"https://web.dev/canvas2d/\">It's always been you Canvas2D</a>.</p> <h2>Unprefixed text-emphasis Properties</h2><p>Chrome 99 <a href=\"https://www.chromestatus.com/feature/5679635154075648\">introduces unprefixed versions of text emphasis</a> CSS properties, specifically: <code>\"text-emphasis\"</code>, <code>\"text-emphasis-color\"</code>, <code>\"text-emphasis-position\"</code>, and <code>\"text-emphasis-style\"</code> CSS properties. These are unprefixed versions of <code>\"-webkit-text-emphasis\"</code>, <code>\"-webkit-text-emphasis-color\"</code>, <code>\"-webkit-text-emphasis-position\"</code>, and <code>\"-webkit-text-emphasis-style\"</code>.</p> <h1>Deprecations, and Removals</h1><p>This version of Chrome introduces the deprecations and removals listed below. Visit ChromeStatus.com for lists of <a href=\"https://www.chromestatus.com/features#browsers.chrome.status%3A%22Deprecated%22\">current deprecations</a>  and <a href=\"https://www.chromestatus.com/features#browsers.chrome.status:%22Removed%22\">previous removals</a>.</p> <h2>Remove Battery Status API on Insecure Origins</h2><p><a href=\"https://chromestatus.com/feature/4878376799043584\">Battery Status API is no longer supported on insecure origins</a>, such as HTTP pages or HTTPS iframes embedded in HTTP pages. The Battery Status API allows web developers to access, among other things, a system's battery charging level and whether it is being charged. It is a powerful feature that has been around for over a decade and, as such, was originally designed with different security constraints.</p> <h2>Remove font-family -webkit-standard</h2><p>This version of Chrome <a href=\"https://www.chromestatus.com/feature/5639265565278208\">removes support for the <code>font-family</code> value <code>\"-webkit-standard\"</code></a>. This value is merely an alias for the proprietary keyword <code>\"-webkit-body\"</code> and is only exposed because it's inherited from WebKit. Removing this improves alignment with the CSS specifications and with Firefox.</p> <h2>Remove GamepadList</h2><p>The <code><a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Navigator/getGamepads\">navigator.getGamepads()</a></code> method <a href=\"https://get-gamepads.glitch.me/\">now returns an array</a> of <code><a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Gamepad\">Gamepad</a></code> objects <a href=\"https://www.chromestatus.com/feature/5693119438782464\">instead of a GamepadList</a>. <code>GamepadList</code> is no longer supported in Chrome. This brings Chrome in line with spec and with Gecko and Webkit. For information on Gamepads generally, see <a href=\"https://web.dev/gamepad/\">Play the Chrome dino game with your gamepad</a>.</p><p><br /></p><h2>Update WebCodecs to Match Spec</h2><p>Chrome has&nbsp;<a href=\"https://www.chromestatus.com/feature/5667793157488640\">removed two items</a>&nbsp;<span id=\"docs-internal-guid-333056de-7fff-df45-48af-33616384d256\"><span style=\"font-family: Arial; font-size: 11pt; font-variant-east-asian: normal; font-variant-numeric: normal; vertical-align: baseline; white-space: pre-wrap;\">because of recent changes in the WebCodecs spec.</span></span>.<br /><br />The&nbsp;<code>EncodedVideoChunkOutputCallback()</code>&nbsp;method takes an&nbsp;<code>EncodedVideoChunkMetadata</code>&nbsp;dictionary. Previously a member called temporalLayerId was located at&nbsp;<code>EncodedVideoChunkMetadata.temporalLayerId</code>. In conformance with the spec, it is now located at&nbsp;<code>EncodedVideoChunkMetadata.SvcOutputMetadata.temporalLayerId</code>.<br /><br />The spec requires that the&nbsp;<code>VideoFrame()</code>&nbsp;constructor include a timestamp argument (<code>VideoFrameInit.timestamp</code>) for&nbsp;<code>CanvasImageSource</code>&nbsp;types that don't implicitly have a timestamp (e.g.&nbsp;<code>HTMLCanvasElement</code>). Failing to include the timestamp should result in a&nbsp;<code>TypeError</code>, but Chrome previously defaulted the timestamp to zero. This seems helpful, but is problematic if you then send the&nbsp;<code>VideoFrame</code>&nbsp;to a&nbsp;<code>VideoEncoder</code>, where timestamps are used to guide bitrate control.</p>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Chromium Blog",
    "uri": "http://www.blogger.com/profile/06394244468194711527",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}