{
  "title": "In Defense of the Nation-State",
  "description": "<p>It is possible to defend the nation-state, despite its history of oppression, persecution, tyranny, and war. Note that before this recent creation, life was not always a piece of cake for everybody either.</p>\n<p>For a more affirmative defense, suppose that all individuals and families on earth were offered an air ticket to move anywhere they want to live, no question asked. Those who like self-reliance and private guns could move to the United States. Those who like wine and sensuality could move to France. Those who like friendly, smiling people like in <a href=\"https://en.wikipedia.org/wiki/The_Village_(The_Prisoner)\" target=\"_blank\" rel=\"noopener\">the Prisoner’s Village</a> could move to the United Kingdom. Those who like wide uninhabited spaces with no guns and wall-to-wall Medicare could move to Canada. Those who like strict social norms and a sense of belonging might choose India or Afghanistan. Those who like the environment and poverty could move to Bhutan or Burundi. Those who like to be liberated from choice (except about where to queue and how to survive) would move to Venezuela or North Korea. These are just illustrations; please choose your own according to your preferences and values. (I take values to mean preferences for states of the world, as opposed to preferences for personal consumption and activities.)</p>\n<p>Once the new borders are drawn, the world would be composed of nation-states based on real common preferences and values <em>as nationalists now imagine them</em>, as opposed to the current reality of largely artificial assemblages in which coercive authorities impose <a href=\"https://www.econlib.org/identity-politics-on-the-right-too/\" target=\"_blank\" rel=\"noopener\">arbitrary identities</a> on most of their subjects. If one of these new nation-states did impose a common identity, it would correspond to what all its subjects want anyway. Even the woke could arguably carve out their own nation-state where they would live among themselves under secular theocracies. The uniformity of individual preferences and values would prevent the voting irrationality predicated on <a href=\"https://www.econlib.org/electorate-may-want-both-afghan-pullout-and-non-pullout/\" target=\"_blank\" rel=\"noopener\">the Condorcet paradox and Arrow’s theorem</a>. Instead, the <a href=\"https://www.econlib.org/library/Enc/PublicChoice.html\" target=\"_blank\" rel=\"noopener\">median voter</a> would rule all the time but, all individuals being similar, every voter would <em>be</em> the median voter and everybody would revel in the resulting mediocrity.</p>\n<p>They are however many problems with this simple model of perfect nation-states. The self-selection of individuals according to their own preferences would be difficult to start, for how would current rulers and their clienteles find in their interests to dismantle their exploitation playgrounds? But let&#8217;s disregard this obstacle.</p>\n<p>As the relocations proceed and new nation-state configurations emerge, many individuals would need to relocate again. Before reaching an equilibrium, where all individuals or a large proportion of them are satisfied and stop moving, assuming such an equilibrium exists, the process would need many rounds. This can be seen with simple <a href=\"http://nifty.stanford.edu/2014/mccown-schelling-model-segregation/\" target=\"_blank\" rel=\"noopener\">computer simulations</a> built on the famous <a href=\"https://www.jstor.org/stable/1823701\" target=\"_blank\" rel=\"noopener\">Thomas Schelling model of segregation</a>. Perhaps a very large number of plane tickets would be required—conceivably consuming all GDP. A mechanism would have to be devised to solve the problem of individuals attracted mainly by the welfare states of the (forecasted) richest countries, because parasites without hosts is not a stable solution.</p>\n<p>Still, if we respect &#8220;national sovereignty,&#8221; many individuals are bound to remain discontented. There are only about 200 countries in the word while barely two individuals among the billions alive have exactly the same preferences and values.</p>\n<p>Ultimately, every individual or family would need its own country, but <a href=\"https://www.cato.org/regulation/winter-2021/2022/wide-ranging-libertarian-philosopher-reasonable-radical\" target=\"_blank\" rel=\"noopener\">the jury is still out</a> on whether anarchy, even if desirable, is feasible. Even in our ideal self-selected nations, then, there would still be majorities exploiting minorities. The latter may be smaller, but this can make them more exploitable. The only solution for perfect “nationalism,” it seems, is that each country have some form of minimal or classical liberal state. The whole relocation exercise would have only demonstrated that the peaceful coexistence of different individuals requires either subjection of some individuals to others or else minimal states. <a href=\"https://www.econlib.org/only-one-way-to-be-president-of-all-syldavians/\" target=\"_blank\" rel=\"noopener\">As I indicated before</a>, the president of Syldavia can only be president of all Syldavians if he drastically limits his interventions in Syldavians&#8217; lives.</p>\n<p>If the foregoing is correct, the practical goal to pursue would be for each of us under his own more or less tyrannical nation-state,  to try to push it toward a minimal state. This is, together with independent relocation (when possible) and a cosmopolitan outlook, the only way to increase the number of individuals whose preferences are not constantly overruled. The possibility of creating and maintaining geographical spaces in which to pursue this goal without foreign tyrants&#8217; interference appears to be the only good defense of the nation-state system, although both “nation” and “state” then require scare quotes.</p>\n(25 COMMENTS)",
  "link": "https://www.econlib.org/in-defense-of-the-nation-state/",
  "guid": "https://www.econlib.org/in-defense-of-the-nation-state/",
  "category": [
    "Political Economy",
    "Politics and Economics",
    "Condorcet paradox",
    "individualism",
    "national sovereignty",
    "nationalism",
    "Thomas Schelling"
  ],
  "pubDate": "Tue, 01 Nov 2022 16:00:13 +0000"
}