{
  "title": "Episode 148: &#8220;Light My Fire&#8221; by the Doors",
  "link": "https://500songs.com/podcast/episode-148-light-my-fire-by-the-doors/",
  "pubDate": "Sat, 30 Apr 2022 19:57:18 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=1141",
  "description": "Episode one hundred and forty-eight of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Light My Fire\" by the Doors, the history of cool jazz, and Maharishi Mahesh Yogi. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/65819863\">on \"My Friend Jack\" by the Smoke</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I’ve put together <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-148-light-my-fire/\">a Mixcloud mix</a> containing all the music excerpted in this episode and the shorter spoken-word tracks.\n\nInformation on Dick Bock, World Pacific, and Ravi Shankar came from <a href=\"https://amzn.to/3JdVYyG\"><em>Indian Sun: The Life and Music of Ravi Shankar</em> by Oliver Craske</a>.\n\nRay Manzarek, John Densmore, and Robby Krieger have all released autobiographies. Densmore's is out of print, but I referred to <a href=\"https://amzn.to/3vvnByF\">Manzarek's</a> and <a href=\"https://amzn.to/3Lw3fe4\">Krieger's</a> here. Of the two Krieger's is vastly more reliable. I also used <a href=\"https://amzn.to/3F5fLi8\">Mick Wall's book on the Doors</a> and <a href=\"https://amzn.to/3kt8Aa8\">Stephen Davis' biography of Jim Morrison</a>.\n\nInformation about Elektra Records came from <em>Follow the Music</em> by Jac Holzman and Gavan Daws, which is available as <a href=\"https://elektra70.elektrarecords.com/followthemusic.pdf\">a free PDF download on Elektra's website</a>.\n\nBiographical information on Maharishi Mahesh Yogi comes from <a href=\"https://amzn.to/3yabAR3\">this book</a>, written by one of his followers.\n\nThe Doors' complete studio albums can be <a href=\"https://amzn.to/3kqYnuL\">bought as MP3s</a> for £14.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\nThere are two big problems that arise for anyone trying to get an accurate picture of history, and which have certainly arisen for me during the course of this podcast -- things which make sources unreliable enough that you feel you have to caveat everything you say on a subject. One of those is hagiography, and the converse desire to tear heroes down. No matter what one wants to say on, say, the subjects of Jesus or Mohammed or Joseph Smith, the only sources we have for their lives are written either by people who want to present them as unblemished paragons of virtue, or by people who want to destroy that portrayal -- we know that any source is written by someone with a bias, and it might be a bias we agree with, but it's still a bias.\n\nThe other, related, problem, is deliberate disinformation. This comes up especially for people dealing with military history -- during conflicts, governments obviously don't want their opponents to know when their attacks have caused damage, or to know what their own plans are, and after a war has concluded the belligerent parties want to cover up their own mistakes and war crimes. We're sadly seeing that at the moment in the situation in Ukraine -- depending on one's media diet, one could get radically different ideas of what is actually going on in that terrible conflict.\n\nBut it happens all the time, in all wars, and on all sides. Take the Vietnam War. While the US was involved on the side of the South Vietnamese government from the start of that conflict, it was in a very minor way, mostly just providing supplies and training. Most historians look at the real start of US involvement in that war as having been in August 1964. President Johnson had been wanting, since assuming the Presidency in November 1963 after the death of John F Kennedy, to get further into the war, but had needed an excuse to do so. The Gulf of Tonkin Incident provided him with that excuse.\nOn August the second, a fleet of US warships entered into what the North Vietnamese considered their territorial waters -- they used a different distance from shore to mark their territorial waters than most other countries used, and one which wasn't generally accepted, but which they considered important. Because of this, some North Vietnamese ships started following the American ones. The American ships, who thought they weren't doing anything wrong, set off what they considered to be warning shots, and the North Vietnamese ships fired back, which to the American ships was considered them attacking. Some fire was exchanged, but not much happened.\n\nTwo days later, the American ships believed they were getting attacked again, and spent several hours firing at what they believed were North Vietnamese submarines. It was later revealed that this was just the American sonar systems playing up, and that they were almost certainly firing at nothing at all, and some even suspected that at the time -- President Johnson apparently told other people in confidence that in his opinion they'd been firing at stray dolphins.\n\nBut that second \"attack\", however flimsy the evidence, was enough that Johnson could tell Congress and the nation that an American fleet had been attacked by the North Vietnamese, and use that as justification to get Congress to authorise him sending huge numbers of troops to Vietnam, and getting America thoroughly embroiled in a war that would cost innumerable lives and billions of dollars for what turned out to be no benefit at all to anyone.\n\nThe commander of the US fleet involved in the Gulf of Tonkin operation was then-Captain, later Rear Admiral, Steve Morrison:\n\n[Excerpt: The Doors, \"The End\"]\n\nWe've talked a bit in this podcast previously about the development of jazz in the forties, fifties, and early sixties -- there was a lot of back and forth influence in those days between jazz, blues, R&B, country, and rock and roll, far more than one might imagine looking at the popular histories of these genres, and so we've looked at swing, bebop, and modal jazz before now.\n\nBut one style of music we haven't touched on is the type that was arguably the most popular and influential style of jazz in the fifties, even though we've mentioned several of the people involved in it. We've never yet had a proper look at Cool Jazz.\n\nCool Jazz, as its name suggests, is a style of music that was more laid back than the more frenetic bebop or hard-edged modal jazz. It was a style that sounded sophisticated, that sounded relaxed, that prized melody and melodic invention over super-fast technical wizardry, and that produced much of what we now think of when we think of \"jazz\" as a popular style of music. The records of Dave Brubeck, for example, arguably the most popular fifties jazz musician, are very much in the \"cool jazz\" mode:\n\n[Excerpt: The Dave Brubeck Quartet, \"Take Five\"]\n\nAnd we have mentioned on several occasions the Modern Jazz Quartet, who were cited as influences by everyone from Ray Charles to the Kinks to the Modern Folk Quartet:\n\n[Excerpt: The Modern Jazz Quartet, \"Regret?\"]\n\nWe have also occasionally mentioned people like Mose Allison, who occasionally worked in the Cool Jazz mode. But we've never really looked at it as a unified thing.\n\nCool Jazz, like several of the other developments in jazz we've looked at, owes its existence to the work of the trumpeter Miles Davis, who was one of the early greats of bop and who later pioneered modal jazz.\n\nIn 1948, in between his bop and modal periods, Davis put together a short-lived nine-piece group, the Miles Davis Nonette, who performed together for a couple of weeks in late 1948, and who recorded three sessions in 1949 and 1950, but who otherwise didn't perform much. Each of those sessions had a slightly different lineup, but key people involved in the recordings were Davis himself, arranger Gil Evans, piano player John Lewis, who would later go on to become the leader of the Modern Jazz Quartet, and baritone sax player Gerry Mulligan.\n\nMulligan and Evans, and the group's alto player Lee Konitz, had all been working for the big band Claude Thornhill and his Orchestra, a band which along with the conventional swing instruments also had a French horn player and a tuba player, and which had recorded soft, mellow, relaxing music:\n\n[Excerpt: Claude Thornhill and his Orchestra, \"To Each His Own\"]\n\nThe Davis Nonette also included French horn and tuba, and was explicitly modelled on Thornhill's style, but in a stripped-down version. They used the style of playing that Thornhill preferred, with no vibrato, and with his emphasis on unison playing, with different instruments doubling each other playing the melody, rather than call-and response riffing:\n\n[Excerpt: The Miles Davis Nonette, \"Venus De Milo\"]\n\nThose recordings were released as singles in 1949 and 1950, and were later reissued in 1957 as an album titled \"Birth of the Cool\", by which point Cool Jazz had become an established style, though Davis himself had long since moved on in other musical directions.\n\nAfter the Birth of the Cool sessions, Gerry Mulligan had recorded an album as a bandleader himself, and then had moved to the West Coast, where he'd started writing arrangements for Stan Kenton, one of the more progressive big band leaders of the period:\n\n[Excerpt: Stan Kenton, \"Young Blood\"]\n\nWhile working for Kenton, Mulligan had started playing dates at a club called the Haig, where the headliner was the vibraphone player Red Norvo. While Norvo had started out as a big-band musician, playing with people like Benny Goodman, he had recently started working in a trio, with just a guitarist, initially Tal Farlowe, and bass player, initially Charles Mingus:\n\n[Excerpt: Red Norvo, \"This Can't Be Love\"]\n\nBy 1952 Mingus had left Norvo's group, but they were still using the trio format, and that meant there was no piano at the venue, which meant that Mulligan had to form a band that didn't rely on the chordal structures that a piano would provide -- the idea of a group with a rhythm section that *didn't* have a piano was quite an innovation in jazz at this time, and freeing themselves from that standard instrument ended up opening up extra possibilities. His group consisted of himself on saxophone, Chet Baker on trumpet, Bob Whitlock on bass and Chico Hamilton on drums. They made music in much the same loose, casual, style as the recordings Mulligan had made with Davis, but in a much smaller group with the emphasis being on the interplay between Mulligan and Baker.\n\nAnd this group were the first group to record on a new label, Pacific Jazz, founded by Dick Bock.\n\nBock had served in the Navy during World War II, and had come back from the South Pacific with two tastes -- a taste for hashish, and for music that was outside the conventional American pop mould. Bock *loved* the Mulligan Quartet, and in partnership with his friend Roy Harte, a notable jazz drummer, he raised three hundred and fifty dollars to record the first album by Mulligan's new group:\n\n[Excerpt: Gerry Mulligan Quartet, \"Aren't You Glad You're You?\"]\n\nPacific Jazz, the label Bock and Harte founded, soon became *the* dominant label for Cool Jazz, which also became known as the West Coast Sound.  The early releases on the label were almost entirely by the Mulligan Quartet, released either under Mulligan's name, as by Chet Baker, or as \"Lee Konitz and the Gerry Mulligan Quartet\" when Mulligan's old bandmate Konitz joined them.\n\nThese records became big hits, at least in the world of jazz. But both Mulligan and Baker were heroin addicts, and in 1953 Mulligan got arrested and spent six months in prison. And while he was there, Chet Baker made some recordings in his own right and became a bona fide star. Not only was Baker a great jazz trumpet player, he was also very good looking, and it turned out he could sing too. The Mulligan group had made the song \"My Funny Valentine\" one of the highlights of its live shows, with Baker taking a trumpet solo:\n\n[Excerpt: Gerry Mulligan Quartet, \"My Funny Valentine\"]\n\nBut when Baker recorded a vocal version, for his album Chet Baker Sings, it made Baker famous:\n\n[Excerpt: Chet Baker, \"My Funny Valentine\"]\n\nWhen Mulligan got out of prison, he wanted to rehire Baker, but Baker was now topping the popularity polls in all the jazz magazines, and was the biggest breakout jazz star of the early fifties. But Mulligan formed a new group, and this just meant that Pacific Jazz had *two* of the biggest acts in jazz on its books now, rather than just one.\n\nBut while Bock loved jazz, he was also fascinated by other kinds of music, and while he was in New York at the beginning of 1956 he was invited by his friend George Avakian, a producer who had worked with Miles Davis, Louis Armstrong, and others, to come and see a performance by an Indian musician he was working with. Avakian was just about to produce Ravi Shankar's first American album, The Sounds of India, for Columbia Records. But Columbia didn't think that there was much of a market for Shankar's music -- they were putting it out as a speciality release rather than something that would appeal to the general public -- and so they were happy for Bock to sign Shankar to his own label. Bock renamed the company World Pacific, to signify that it was now going to be putting out music from all over the world, not just jazz, though he kept the Pacific Jazz label for its jazz releases, and he produced Shankar's next album,  India's Master Musician:\n\n[Excerpt: Ravi Shankar, \"Raga Charu Keshi\"]\n\nMost of Shankar's recordings for the next decade would be produced by Bock, and Bock would also try to find ways to combine Shankar's music with jazz, though Shankar tried to keep a distinction between the two. But for example on Shankar's next album for World Pacific, Improvisations and Theme from Pather Panchali, he was joined by a group of West Coast jazz musicians including Bud Shank (who we'll hear about again in a future episode) on flute:\n\n[Excerpt: Ravi Shankar, \"Improvisation on the Theme From Pather Panchali\"]\n\nBut World Pacific weren't just putting out music. They also put out spoken-word records. Some of those were things that would appeal to their jazz audience, like the comedy of Lord Buckley:\n\n[Excerpt: Lord Buckley, \"Willy the Shake\"]\n\nBut they also put out spoken-word albums that appealed to Bock's interest in spirituality and philosophy, like an album by Gerald Heard. Heard had previously written the liner notes for Chet Baker Sings!, but as well as being a jazz fan Heard was very connected in the world of the arts -- he was a very close friend with Aldous Huxley -- and was also interested in various forms of non-Western spirituality. He practiced yoga, and was also fascinated by Buddhism, Vedanta, and Taoism:\n\n[Excerpt: Gerald Heard, \"Paraphrased from the Tao te Ching of Lao Tzu\"]\n\nWe've come across Heard before, in passing, in the episode on \"Tomorrow Never Knows\", when Ralph Mentzner said of his experiments with Timothy Leary and Ram Dass \"At the suggestion of Aldous Huxley and Gerald Heard we began using the Bardo Thödol ( Tibetan Book of the Dead) as a guide to psychedelic sessions\" -- Heard was friends with both Huxley and Humphrey Osmond, and in fact had been invited by them to take part in the mescaline trip that Huxley wrote about in his book The Doors of Perception, the book that popularised psychedelic drug use, though Heard was unable to attend at that time.\n\nHeard was a huge influence on the early psychedelic movement -- though he always advised Leary and his associates not to be so public with their advocacy, and just to keep it to a small enlightened circle rather than risk the wrath of the establishment -- and he's cited by almost everyone in Leary's circle as having been the person who, more than anything else, inspired them to investigate both psychedelic drugs and mysticism. He's the person who connected Bill W. of Alcoholics Anonymous with Osmond and got him advocating LSD use. It was Heard's books that made Huston Smith, the great scholar of comparative religions and associate of Leary, interested in mysticism and religions outside his own Christianity, and Heard was one of the people who gave Leary advice during his early experiments.\n\nSo it's not surprising that Bock also became interested in Leary's ideas before they became mainstream. Indeed, in 1964 he got Shankar to do the music for a short film based on The Psychedelic Experience, which Shankar did as a favour for his friend even though Shankar didn't approve of drug use. The film won an award in 1965, but quickly disappeared from circulation as its ideas were too controversial:\n\n[Excerpt: The Psychedelic Experience (film)]\n\nAnd Heard introduced Bock to other ideas around philosophy and non-Western religions. In particular, Bock became an advocate for a little-known Hindu mystic who had visited the US in 1959 teaching a new style of meditation which he called Transcendental Meditation.\n\nA lot is unclear about the early life of Maharishi Mahesh Yogi, even his birth name -- both \"Maharishi\" and \"Yogi\" are honorifics rather than names as such, though he later took on both as part of his official name, and in this and future episodes I'll refer to him as \"the Maharishi\". What we do know is that he was born in India, and had attained a degree in physics before going off to study with Swami Brahmananda Saraswati, a teacher of the Advaita Vedanta school of Hinduism.\n\nNow, I am not a Hindu, and only have a passing knowledge of Hindu theology and traditions, and from what I can gather getting a proper understanding requires a level of cultural understanding I don't have, and in particular a knowledge of the Sanskrit language, so my deepest apologies for any mangling I do of these beliefs in trying to talk about them as they pertain to mid-sixties psychedelic rock. I hope my ignorance is forgivable, and seen as what it is rather than malice. But the teachings of this school as I understand them seem to centre around an idea of non-separation -- that God is in all things, and is all things, and that there is no separation between different things, and that you merely have to gain a deep realisation of this. The Maharishi later encapsulated this in the phrase \"I am that, thou art that, all this is that\", which much later the Beach Boys, several of whom were followers of the Maharishi, would turn into a song:\n\n[Excerpt: The Beach Boys, \"All This is That\"]\n\nThe other phrase they're singing there, \"Jai Guru Dev\" is also a phrase from the Maharishi, and refers to his teacher Brahmananda Saraswati -- it means \"all hail the divine teacher\" or \"glory to the heavenly one\", and \"guru dev\" or \"guru deva\" was the name the Maharishi would use for Saraswati after his death, as the Maharishi believed that Saraswati was an actual incarnation of God. It's that phrase that John Lennon is singing in \"Across the Universe\" as well, another song later inspired by the Maharishi's teachings:\n\n[Excerpt: The Beatles, \"Across the Universe\"]\n\nThe Maharishi became, by his own account, Saraswati's closest disciple, advisor, and right-hand man, and was privy to his innermost thoughts. However, on Saraswati's death the leadership of the monastery he led became deeply contested, with two different rivals to the position, and the Maharishi was neither -- the rules of the monastery said that only people born into the Brahmin caste could reach the highest positions in the monastery's structure, and the Maharishi was not a Brahmin.\n\nSo instead of remaining in the monastery, the Maharishi went out into the world to teach a new form of meditation which he claimed he had learned from Guru Dev, a technique which became known as transcendental meditation. The Maharishi would, for the rest of his life, always claim that the system he taught was Guru Dev's teaching for the world, not his own, though the other people who had been at the monastery with him said different things about what Saraswati had taught -- but of course it's perfectly possible for a spiritual leader to have had multiple ideas and given different people different tasks.\n\nThe crucial thing about the Maharishi's teaching, the way it differed from everything else in the history of Hindu monasticism (as best I understand this) is that all previous teachers of meditation had taught that to get the benefit of the techniques one had to be a renunciate -- you should go off and become a monk and give up all worldly pleasures and devote your life to prayer and meditation.\n\nTraditionally, Hinduism has taught that there are four stages of life -- the student, the householder or married person with a family, the retired person, and the Sanyasi, or renunciate, but that you could skip straight from being a student to being a Sanyasi and spend your life as a monk. The Maharishi, though, said:\n\n\"Obviously enough there are two ways of life: the way of the Sanyasi and the way of life of a householder. One is quite opposed to the other. A Sanyasi renounces everything of the world, whereas a householder needs and accumulates everything. The one realises, through renunciation and detachment, while the other goes through all attachments and accumulation of all that is needed for physical life.\"\n\nWhat the Maharishi taught was that there are some people who achieve the greatest state of happiness by giving up all the pleasures of the senses, eating the plainest possible food, having no sexual, familial, or romantic connections with anyone else, and having no possessions, while there are other people who achieve the greatest state of happiness by being really rich and having a lot of nice stuff and loads of friends and generally enjoying the pleasures of the flesh -- and that just as there are types of meditation that can help the first group reach enlightenment, there are also types of meditation that will fit into the latter kind of lifestyle, and will help those people reach oneness with God but without having to give up their cars and houses and money. And indeed, he taught that by following his teachings you could get *more* of those worldly pleasures.\n\nAll you had to do, according to his teaching, was to sit still for fifteen to twenty minutes, twice a day, and concentrate on a single Sanskrit word or phrase, a mantra, which you would be given after going through a short course of teaching. There was nothing else to it, and you would eventually reach the same levels of enlightenment as the ascetics who spent seventy years living in a cave and eating only rice -- and you'd end up richer, too.\n\nThe appeal of this particular school is, of course, immediately apparent, and Bock became a big advocate of the Maharishi, and put out three albums of his lectures:\n\n[Excerpt: Maharishi Mahesh Yogi, \"Deep Meditation\"]\n\nBock even met his second wife at one of the Maharishi's lectures, in 1961.\n\nIn the early sixties, World Pacific got bought up by Liberty Records, the label for which Jan and Dean and others recorded, but Bock remained in charge of the label, and expanded it, adding another subsidiary, Aura Records, to put out rock and roll singles. Aura was much less successful than the other World Pacific labels. The first record the label put out was a girl-group record, \"Shooby Dooby\", by the Lewis Sisters, two jazz-singing white schoolteachers from Michigan who would later go on to have a brief career at Motown:\n\n[Excerpt: The Lewis Sisters, \"Shooby Dooby\"]\n\nThe most successful act that Aura ever had was Sonny Knight, an R&B singer who had had a top twenty hit in 1956 with \"Confidential\", a song he'd recorded on Specialty Records with Bumps Blackwell, and which had been written by Dorinda Morgan:\n\n[Excerpt: Sonny Knight, \"Confidential\"]\n\nBut Knight's biggest hit on Aura, \"If You Want This Love\", only made number seventy-one on the pop charts:\n\n[Excerpt: Sonny Knight, \"If You Want This Love\"]\n\nKnight would later go on to write a novel, The Day the Music Died, which Greil Marcus described as \"the bitterest book ever written about how rock'n'roll came to be and what it turned into\". Marcus said it was about \"how a rich version of American black culture is transformed into a horrible, enormously profitable white parody of itself: as white labels sign black artists only to ensure their oblivion and keep those blacks they can't control penned up in the ghetto of the black charts; as white America, faced with something good, responds with a poison that will ultimately ruin even honest men\".\n\nGiven that Knight was the artist who did the *best* out of Aura Records, that says a great deal about the label.\n\nBut one of the bands that Aura signed, who did absolutely nothing on the charts, was a group called Rick and the Ravens, led by a singer called Screamin' Ray Daniels. They were an LA club band who played a mixture of the surf music which the audiences wanted and covers of blues songs which Daniels preferred to sing. They put out two singles on Aura, \"Henrietta\":\n\n[Excerpt: Rick and the Ravens, \"Henrietta\"]\n\nand \"Soul Train\":\n\n[Excerpt: Rick and the Ravens, \"Soul Train\"]\n\nRay Daniels was a stage name -- his birth name was Ray Manzarek, and he would later return to that name -- and the core of the band was Ray on vocals and his brothers Rick on guitar and Jim on harmonica. Manzarek thought of himself as a pretty decent singer, but they were just a bar band, and music wasn't really his ideal career.  Manzarek had been sent to college by his solidly lower-middle-class Chicago family in the hope that he would become a lawyer, but after getting a degree in economics and a brief stint in the army, which he'd signed up for to avoid getting drafted in the same way people like Dean Torrence did, he'd gone off to UCLA to study film, with the intention of becoming a filmmaker. His family had followed him to California, and he'd joined his brothers' band as a way of making a little extra money on the side, rather than as a way to become a serious musician.\n\nManzarek liked the blues songs they performed, and wasn't particularly keen on the surf music, but thought it was OK. What he really liked, though, was jazz -- he was a particular fan of McCoy Tyner, the pianist on all the great John Coltrane records:\n\n[Excerpt: John Coltrane, \"My Favorite Things\"]\n\nManzarek was a piano player himself, though he didn't play much with the Ravens, and he wanted more than anything to be able to play like Tyner, and so when Rick and the Ravens got signed to Aura Records, he of course became friendly with Dick Bock, who had produced so many great jazz records and worked with so many of the greats of the genre.\n\nBut Manzarek was also having some problems in his life. He'd started taking LSD, which was still legal, and been fascinated by its effects, but worried that he couldn't control them -- he couldn't tell whether he was going to have a good trip or a bad one. He was wondering if there was a way he could have the same kind of revelatory mystical experience but in a more controlled manner.\n\nWhen he mentioned this to Bock, Bock told him that the best method he knew for doing that was transcendental meditation. Bock gave him a copy of one of the Maharishi's albums, and told him to go to a lecture on transcendental meditation, run by the head of the Maharishi's west-coast organisation, as by this point the Maharishi's organisation, known as Spiritual Regeneration, had an international infrastructure, though it was still nowhere near as big as it would soon become.\n\nAt the lecture, Manzarek got talking to one of the other audience members, a younger man named John Densmore. Densmore had come to the lecture with his friend Robby Krieger, and both had come for the same reason that Manzarek had -- they'd been having bad trips and so had become a little disillusioned with acid.\n\nKrieger had been the one who'd heard about transcendental meditation, while he was studying the sitar and sarod at UCLA -- though Krieger would later always say that his real major had been in \"not joining the Army\". UCLA had one of the few courses in Indian music available in the US at the time, as thanks in part to Bock California had become the centre of American interest in music from India -- so much so that in 1967 Ravi Shankar would open up a branch of his own Kinnara Music School there.\n\n(And you can get an idea of how difficult it is to separate fact from fiction when researching this episode that one of the biographies I've used for the Doors says that Krieger heard about the Maharishi while studying at the Kinnara school. As the only branch of the Kinnara school that was open at this point was in Mumbai, it's safe to say that unless Krieger had a *really* long commute he wasn't studying there at this point.)\n\nDensmore and Manzarek got talking, and they found that they shared a lot of the same tastes in jazz -- just as Manzarek was a fan of McCoy Tyner, so Densmore was a fan of Elvin Jones, the drummer on those Coltrane records, and they both loved the interplay of the two musicians:\n\n[Excerpt: John Coltrane, \"My Favorite Things\"]\n\nManzarek was starting to play a bit more keyboards with the Ravens, and he was also getting annoyed with the Ravens' drummer, who had started missing rehearsals -- he'd turn up only for the shows themselves. He thought it might be an idea to get Densmore to join the group, and Densmore agreed to come along for a rehearsal.\n\nThat initial rehearsal Densmore attended had Manzarek and his brothers, and may have had a bass player named Patricia Hansen, who was playing with the group from time to time around this point, though she was mostly playing with a different bar band, Patty and the Esquires. But as well as the normal group members, there was someone else there, a friend of Manzarek's from film school named Jim Morrison.\n\nMorrison was someone who, by Manzarek's later accounts, had been very close to Manzarek at university, and who Manzarek had regarded as a genius, with a vast knowledge of beat poetry and European art film, but who had been regarded by most of the other students and the lecturers as being a disruptive influence. Morrison had been a fat, asthmatic, introverted kid -- he'd had health problems as a child, including a bout of rheumatic fever which might have weakened his heart, and he'd also been prone to playing the kind of \"practical jokes\" which can often be a cover for deeper problems. For example, as a child he was apparently fond of playing dead -- lying in the corridors at school and being completely unresponsive for long periods no matter what anyone did to move him, then suddenly getting up and laughing at anyone who had been concerned and telling them it was a joke.\n\nGiven how frequently Morrison would actually pass out in later life, often after having taken some substance or other, at least one biographer has suggested that he might have had undiagnosed epilepsy (or epilepsy that was diagnosed but which he chose to keep a secret) and have been having absence seizures and covering for them with the jokes. Robby Krieger also says in his own autobiography that he used to have the same doctor as Morrison, and the doctor once made an offhand comment about Morrison having severe health problems, \"as if it was common knowledge\".\n\nHis health difficulties, his weight, his introversion, and the experience of moving home constantly as a kid because of his father's career in the Navy, had combined to give him a different attitude to most of his fellow students, and in particular a feeling of rootlessness -- he never owned or even rented his own home in later years, just moving in with friends or girlfriends -- and a lack of sense of his own identity, which would often lead to him making up lies about his life and acting as if he believed them. In particular, he would usually claim to friends that his parents were dead, or that he had no contact with them, even though his family have always said he was in at least semi-regular contact.\n\nAt university, Morrison had been a big fan of Rick and the Ravens, and had gone to see them perform regularly, but would always disrupt the shows -- he was, by all accounts, a lovely person when sober but an aggressive boor when drunk -- by shouting out for them to play \"Louie Louie\", a song they didn't include in their sets. Eventually one of Ray's brothers had called his bluff and said they'd play the song, but only if Morrison got up on stage and sang it. He had -- the first time he'd ever performed live -- and had surprised everyone by being quite a good singer.\n\nAfter graduation, Morrison and Manzarek had gone their separate ways, with Morrison saying he was moving to New York. But a few weeks later they'd encountered each other on the beach -- Morrison had decided to stay in LA, and had been staying with a friend, mostly sleeping on the friend's rooftop. He'd been taking so much LSD he'd forgotten to eat for weeks at a time, and had lost a great deal of weight, and Manzarek properly realised for the first time that his friend was actually good-looking.\n\nMorrison also told Manzarek that he'd been writing songs -- this was summer 1965, and the Byrds' version of \"Mr. Tambourine Man\", Dylan's \"Like a Rolling Stone\", and the Stones' \"Satisfaction\" had all shown him that there was potential for pop songs to have more interesting lyrical content than \"Louie Louie\". Manzarek asked him to sing some of the songs he'd been writing, and as Manzarek later put it \"he began to sing, not in the booze voice he used at the Turkey Joint, but in a Chet Baker voice\".\nThe first song Morrison sang for Ray Manzarek was one of the songs that Rick and the Ravens would rehearse that first time with John Densmore, \"Moonlight Drive\":\n\n[Excerpt: Rick and the Ravens, \"Moonlight Drive\"]\n\nManzarek invited Morrison to move in with him and his girlfriend. Manzarek seems to have thought of himself as a mentor, a father figure, for Morrison, though whether that's how Morrison thought of him is impossible to say.\n\nManzarek, who had a habit of choosing the myth over the truth, would later claim that he had immediately decided that he and Morrison were going to be a duo and find a whole new set of musicians, but all the evidence points to him just inviting Morrison to join the Ravens as the singer\nCertainly the first recordings this group made, a series of demos, were under Rick and the Ravens' name, and paid for by Aura Records. They're all of songs written by Morrison, and seem to be sung by Morrison and Manzarek in close harmony throughout. But the demos did not impress the head of Liberty Records, which now owned Aura, and who saw no commercial potential in them, even in one that later became a number one hit when rerecorded a couple of years later:\n\n[Excerpt: Rick and the Ravens, \"Hello I Love You\"]\n\nAlthough to be fair, that song is clearly the work of a beginning songwriter, as Morrison has just taken the riff to \"All Day and All of the Night\" by the Kinks, and stuck new words to it:\n\n[Excerpt: The Kinks, \"All Day and All of the Night\"]\n\nBut it seems to have been the lack of success of these demos that convinced Manzarek's brothers and Patricia Hansen to quit the band. According to Manzarek, his brothers were not interested in what they saw as Morrison's pretensions towards poetry, and didn't think this person who seemed shy and introverted in rehearsals but who they otherwise knew as a loud annoying drunk in the audience would make a good frontman.\n\nSo Rick and the Ravens were down to just Jim Morrison, Ray Manzarek, and John Densmore, but they continued shopping their demos around, and after being turned down by almost everyone they were signed by Columbia Records, specifically by Billy James, who they liked because he'd written the liner notes to a Byrds album, comparing them to Coltrane, and Manzarek liked the idea of working with an A&R man who knew Coltrane's work, though he wasn't impressed by the Byrds themselves, later writing \"The Byrds were country, they didn’t have any black in them at all. They couldn’t play jazz. Hell, they probably didn’t even know anything about jazz. They were folk-rock, for cri-sake. Country music. For whites only.\"\n\n(Ray Manzarek was white).\n\nThey didn't get an advance from Columbia, but they did get free equipment -- Columbia had just bought Vox, who made amplifiers and musical instruments, and Manzarek in particular was very pleased to have a Vox organ, the same kind that the Animals and the Dave Clark Five used.\n\nBut they needed a guitarist and a bass player. Manzarek claimed in his autobiography that he was thinking along the lines of a four-piece group even before he met Densmore, and that his thoughts had been \"Someone has to be Thumper and someone has to be Les Paul/Chuck Berry by way of Charlie Christian. The guitar player will be a rocker who knows jazz. And the drummer will be a jazzer who can rock. These were my prerequisites. This is what I had to have to make the music I heard in my head.\"\nBut whatever Manzarek was thinking, there were only two people who auditioned for the role of the guitar player in this new version of the band, both of them friends of Densmore, and in fact two people who had been best friends since high school -- Bill Wolff and Robby Krieger.\n\nWolff and Krieger had both gone to private boarding school -- they had both originally gone to normal state schools, but their parents had independently decided they were bad influences on each other and sent them away to boarding school to get away from each other, but accidentally sent them to the same school -- and had also learned guitar together. They had both loved a record of flamenco guitar called Dos Flamencos by Jaime Grifo and Nino Marvino:\n\n[Excerpt: Jaime Grifo and Nino Marvino, \"Caracolés\"]\n\nAnd they'd decided they were going to become the new Dos Flamencos. They'd also regularly sneaked out of school to go and see a jug band called Mother McCree's Uptown Jug Champions, a band which featured Bob Weir, who was also at their school, along with Jerry Garcia and Pigpen McKernan.\nKrieger was also a big fan of folk and blues music, especially bluesy folk-revivalists like Spider John Koerner, and was a massive fan of the Paul Butterfield Blues Band. Krieger and Densmore had known each other before Krieger had been transferred to boarding school, and had met back up at university, where they would hang out together and go to see Charles Mingus, Wes Montgomery, and other jazz musicians.\n\nAt this time Krieger had still been a folk and blues purist, but then he went to see Chuck Berry live, mostly because Skip James and Big Mama Thornton were also on the bill, and he had a Damascene conversion -- the next day he went to a music shop and traded in his acoustic for a red Gibson, as close to the one Chuck Berry played as he could find.\n\nWolff, Densmore, Krieger, and piano player Grant Johnson had formed a band called the Psychedelic Rangers, and when the Ravens were looking for a new guitarist, it was natural that they tried the two guitarists from Densmore's other band. Krieger had the advantage over Wolff for two reasons -- one of which was actually partly Wolff's doing. To quote Krieger's autobiography: \"A critic once said I had 'the worst hair in rock 'n' roll'. It stung pretty bad, but I can't say they were wrong. I always battled with my naturally frizzy, kinky, Jewfro, so one day my friend Bill Wolff and I experimented with Ultra Sheen, a hair relaxer marketed mainly to Black consumers. The results were remarkable. Wolff, as we all called him, said 'You're starting to look like that jerk Bryan MacLean'\".\n\nAccording to Krieger, his new hairdo made him better looking than Wolff, at least until the straightener wore off, and this was one of the two things that made the group choose him over Wolff, who was a better technical player. The other was that Krieger played with a bottleneck, which astonished the other members.\n\nIf you're unfamiliar with bottleneck playing, it's a common technique in the blues. You tune your guitar to an open chord, and then use a resonant tube -- these days usually a specially-made metal slide that goes on your finger, but for older blues musicians often an actual neck of a bottle, broken off and filed down -- to slide across the strings. Slide guitar is one of the most important styles in blues, especially electric blues, and you can hear it in the playing of greats like Elmore James:\n\n[Excerpt: Elmore James, \"Dust My Broom\"]\n\nBut while the members of the group all claimed to be blues fans -- Manzarek talks in his autobiography about going to see Muddy Waters in a club in the South Side of Chicago where he and his friends were the only white faces in the audience -- none of them had any idea what bottleneck playing was, and Manzarek was worried when Krieger pulled it out that he was going to use it as a weapon, that being the only association he had with bottle necks. But once Krieger played with it, they were all convinced he had to be their guitarist, and Morrison said he wanted that sound on everything.\n\nKrieger joining seems to have changed the dynamic of the band enormously. Both Morrison and Densmore would independently refer to Krieger as their best friend in the band -- Manzarek said that having a best friend was a childish idea and he didn't have one. But where before this had been Manzarek's band with Morrison as the singer, it quickly became a band centred around the creative collaboration between Krieger and Morrison. Krieger seems to have been too likeable for Manzarek to dislike him, and indeed seems to have been the peacemaker in the band on many occasions, but Manzarek soon grew to resent Densmore, seemingly as the closeness he had felt to Morrison started to diminish, especially after Morrison moved out of Manzarek's house, apparently because Manzarek was starting to remind him of his father.\n\nThe group soon changed their name from the Ravens to one inspired by Morrison's reading. Aldous Huxley's book on psychedelic drugs had been titled The Doors of Perception, and that title had in turn come from a quote from The Marriage of Heaven and Hell by the great mystic poet and artist William Blake, who had written \"If the doors of perception were cleansed every thing would appear to man as it is, Infinite. For man has closed himself up, till he sees all things thro' narrow chinks of his cavern\"\n(Incidentally, in one of those weird coincidences that I like to note when they come up, Blake's Marriage of Heaven and Hell had also inspired the book The Great Divorce by C.S. Lewis, about the divorce of heaven and hell, and both Lewis and Huxley died on the same date, the twenty-second of November 1963, the same day John F. Kennedy died).\n\nMorrison decided that he wanted to rename the group The Doors, although none of the other group members were particularly keen on the idea -- Krieger said that he thought they should name the group Perception instead.\n\nInitially the group rehearsed only songs written by Morrison, along with a few cover versions. They worked up a version of Willie Dixon's \"Back Door Man\", originally recorded by Howlin' Wolf:\n\n[Excerpt: Howlin' Wolf, \"Back Door Man\"]\n\nAnd a version of \"Alabama Song\", a song written by Bertholt Brecht and Kurt Weill, from the opera The Rise and Fall of the City of Mahagonny, with English language lyrics by  Elisabeth Hauptmann. That song had originally been recorded by Lotte Lenya, and it was her version that the group based their version on, at the suggestion of Manzarek's girlfriend:\n\n[Excerpt: Lotte Lenya, \"Alabama Song\"]\n\nThough it's likely given their tastes in jazz that they were also aware of a recent recording of the song by Eric Dolphy and John Lewis:\n\n[Excerpt: Eric Dolphy and John Lewis, \"Alabama Song\"]\n\nBut Morrison started to get a little dissatisfied with the fact that he was writing all the group's original material at this point, and he started to put pressure on the others to bring in songs. One of the first things they had agreed was that all band members would get equal credit and shares of the songwriting, so that nobody would have an incentive to push their own mediocre song at the expense of someone else's great one, but Morrison did want the others to start pulling their weight.\n\nAs it would turn out, for the most part Manzarek and Densmore wouldn't bring in many song ideas, but Krieger would, and the first one he brought in would be the song that would make them into stars.\nThe song Krieger brought in was one he called \"Light My Fire\", and at this point it only had one verse and a chorus. According to Manzarek, Densmore made fun of the song when it was initially brought in, saying \"we're not a folk-rock band\" and suggesting that Krieger might try selling it to the Mamas and the Papas, but the other band members liked it -- but it's important to remember here that Manzarek and Densmore had huge grudges against each other for most of their lives, and that Manzarek is not generally known as an entirely reliable narrator.\n\nNow, I'm going to talk a lot about the influences that have been acknowledged for this song, but before I do there's one that I haven't seen mentioned much but which seems to me to be very likely to have at least been a subconscious influence -- \"She's Not There\" by the Zombies:\n\n[Excerpt: The Zombies, \"She's Not There\"]\n\nNow, there are several similarities to note about the Zombies record. First, like the Doors, the Zombies were a keyboard-driven band. Second, there's the dynamics of the songs -- both have soft, slightly jazzy verses and then a more straight-ahead rock chorus. And finally there's the verse chord sequence. The verse for \"She's Not There\" goes from Am to D repeatedly:\n\n[demonstrates]\n\nWhile the verse for \"Light My Fire\" goes from Am to F sharp minor -- and for those who don't know, the notes in a D chord are D, F sharp, and A, while the notes in an F sharp minor chord are F sharp, A, and C sharp -- they're very similar chords. So \"She's Not There\" is:\n\n[demonstrates]\n\nWhile \"Light My Fire\" is:\n\n[demonstrates]\n\nAt least, that's what Manzarek plays. According to Krieger, he played an Asus2 chord rather than an A minor chord, but Manzarek heard it as an A minor and played that instead.\n\nNow again, I've not seen anyone acknowledge \"She's Not There\" as an influence, but given the other influences that they do acknowledge, and the music that was generally in the air at the time, it would not surprise me even the smallest amount if it was.\n\nBut either way, what Krieger brought in was a simple verse and chorus:\n\n[Excerpt: The Doors, \"Light My Fire\"]\n\nIncidentally, I've been talking about the song as having A minor chords, but you'll actually hear the song in two different keys during this episode, even though it's the same performance throughout, and sometimes it might not sound right to people familiar with a particular version of the record. The band played the song with the verse starting with A minor, and that's how the mono single mix was released, and I'll be using excerpts of that in general.\n\nBut when the stereo version of the album was released, which had a longer instrumental break, the track was mastered about a semitone too slow, and that's what I'll be excerpting when talking about the solos -- and apparently that speed discrepancy has been fixed in more recent remasterings of the album than the one I'm using. So if you know the song and bits of what I play sound odd to you, that's why.\n\nKrieger didn't have a second verse, and so writing the second verse's lyrics was the next challenge. There was apparently some disagreement within the band about the lyrics that Morrison came up with, with their references to funeral pyres, but Morrison won the day, insisting that the song needed some darkness to go with the light of the first verse. Both verses would get repeated at the end of the song, in reverse order, rather than anyone writing a third or fourth verse. Morrison also changed the last line of the chorus -- in Krieger's original version, he'd sung \"Come on baby, light my fire\" three times, but Morrison changed the last line to \"try to set the night on fire\", which Krieger thought was a definite improvement.\n\nThey then came up with an extended instrumental section for the band members to solo in. This was inspired by John Coltrane, though I have seen different people make different claims as to which particular Coltrane record it was inspired by. Many sources, including Krieger, say it was based on Coltrane's famous version of \"My Favorite Things\":\n\n[Excerpt: John Coltrane, \"My Favorite Things\"]\n\nBut Manzarek in his autobiography says it was inspired by Ole, the track that Coltrane recorded with Eric Dolphy:\n\n[Excerpt: John Coltrane, \"Ole\"]\n\nBoth are of course similar musical ideas, and either could have inspired the “Light My Fire” instrumental section, though none of the Doors are anything like as good or inventive on their instruments as Coltrane's group (and of course \"Light My Fire\" is in four-four rather than three-four):\n\n[Excerpt: The Doors, \"Light My Fire\"]\n\nSo they had a basic verse-chorus song with a long instrumental jam session in the middle. Now comes the bit that there's some dispute over.  Both Ray Manzarek and Robby Krieger agree that Manzarek came up with the melody used in the intro, but differ wildly over who came up with the chord sequence for it and when, and how it was put into the song. According to Manzarek, he came up with the whole thing as an intro for the song at that first rehearsal of it, and instructed the other band members what to do. According to Krieger, though, the story is rather different, and the evidence seems to be weighted in Krieger's favour.\n\nIn early live performances of the song, they started the song with the Am-F sharp minor shifts that were used in the verse itself, and continued doing this even after the song was recorded:\n\n[Excerpt: The Doors, \"Light My Fire (live at the Matrix)\"]\n\nBut they needed a way to get back out of the solo section and into the third verse. To do this, Krieger came up with a sequence that starts with a change from G to D, then from D to F, before going into a circle of fifths -- not the ascending circle of fifths in songs like \"Hey Joe\", but a descending one, the same sequence as in \"She Came in Through the Bathroom Window\" or \"I Will Survive\", ending on an A flat:\n\n[demonstrates]\n\nTo get from the A flat to the A minor or Asus2 chord on which the verse starts, he simply then shifted up a semitone from A flat to A major for two bars:\n\n[demonstrates]\n\nOver the top of that chord sequence that Krieger had come up with, Manzarek put a melody line which was inspired by one of Bach's two-part inventions. The one that's commonly cited is Invention No. 8 in F Major, BWV 779:\n\n[Excerpt: Glenn Gould, \"Invention No. 8 in F Major, BWV 779\"]\n\nThough I don't believe Manzarek has ever stated directly which piece he was inspired by other than that it was one of the two-part inventions, and to be honest none of them sound very much like what he plays to my ears, and I think more than anything he was just going for a generalised baroque style rather than anything more specific. And there are certainly stylistic things in there that are suggestive of the baroque -- the stepwise movement, the sort of skipping triplets, and so on:\n\n[Excerpt: The Doors, \"Light My Fire\"]\n\nBut that was just to get out of the solo section and back into the verses. It was only when they finally took the song into the studio that Paul Rothchild, the producer who we will talk about more later, came up with the idea of giving the song more structure by both starting and ending with that sequence, and formalised it so that rather than just general noodling it was an integral part of the song.\n\nThey now had at least one song that they thought had the potential to be a big hit. The problem was that they had not as yet played any gigs, and nor did they have a record deal, or a bass player.\n\nThe lack of a record deal may sound surprising, but they were dropped by Columbia before ever recording for them. There are several different stories as to why. One biography I've read says that after they were signed, none of the label's staff producers wanted to work with them and so they were dropped -- though that goes against some of the other things I've read, which say that Terry Melcher was interested in producing them.\n\nOther sources say that Morrison went in for a meeting with some of the company executives while on acid, came out very pleased with himself at how well he'd talked to them because he'd been able to control their minds with his telepathic powers, and they were dropped shortly afterwards. And others say that they were dropped as part of a larger set of cutbacks the company was making, and that while Billy James fought to keep them at Columbia, he lost the fight.\n\nEither way, they were stuck without a deal, and without any proper gigs, though they started picking up the odd private party here and there -- Krieger's father was a wealthy aerospace engineer who did some work for Howard Hughes among others, and he got his son's group booked to play a set of jazz standards at a corporate event for Hughes, and they got a few more gigs of that nature, though the Hughes gig didn't exactly go well -- Manzarek was on acid, Krieger and Morrison were on speed, and the bass player they brought in for the gig managed to break two strings, something that would require an almost superhuman effort.\n\nThat bass player didn't last long, and nor did the next -- they tried several, but found that the addition of a bass player made them sound less interesting, more like the Animals or the Rolling Stones than a group with their own character. But they needed something to hold down the low part, and it couldn't be Manzarek on the organ, as the Vox organ had a muddy sound when he tried to play too many notes at once. But that problem solved itself when they played one of their earliest gigs. There, Manzarek found that another band, who were regulars at the club, had left their Fender keyboard bass there, clipped to the top of the piano.\n\nManzarek tried playing that, and found he could play basslines on that with his left hand and the main parts with his right hand. Krieger got his father to buy one for the group -- though Manzarek was upset that they bought the wrong colour -- and they were now able to perform without a bass player. Not only that, but it gave the group a distinctive sound quite unlike all the other bands. Manzarek couldn't play busy bass lines while also playing lead lines with his right hand, and so he ended up going for simple lines without a great deal of movement, which added to the hypnotic feel of the group's music – though on records they would often be supplemented by a session bass player to give them a fuller sound.\nWhile the group were still trying to get a record deal, they were also looking for regular gigs, and eventually they found one. The Sunset Strip was *the* place to be, and they wanted desperately to play one of the popular venues there like the Whisky A-Go-Go, but those venues only employed bands who already had record deals.\n\nThey did, though, manage to get a residency at a tiny, unpopular, club on the strip called The London Fog, and they played there, often to only a handful of people, while slowly building in confidence as performers. At first, Morrison was so shy that Manzarek had to sing harmony with him throughout the sets, acting as joint frontman. Krieger later said \"It's rarely talked about, but Ray was a natural born showman, and his knack for stirring drama would serve the Doors' legacy well in later years\"\nBut Morrison soon gained enough confidence to sing by himself. But they weren't bringing in any customers, and the London Fog told them that they were soon going to be dropped -- and the club itself shut not long after. But luckily for the group, just before the end of their booking, the booker for the Whisky A-Go-Go, Ronnie Haran walked in with a genuine pop star, Peter Asher, who as half of Peter & Gordon had had a hit with \"A World Without Love\", written by his sister's boyfriend, Paul McCartney:\n\n[Excerpt: Peter and Gordon, \"A World Without Love\"]\n\nHaran was impressed with the group, and they were impressed that she had brought in a real celebrity. She offered them a residency at the club, not as the headlining act -- that would always be a group that had records out -- but as the consistent support act for whichever big act they had booked.\n\nThe group agreed -- after Morrison first tried to play it cool and told Haran they would have to consider it, to the consternation of his bandmates.\n\nThey were thrilled, though, to discover that one of the first acts they supported at the Whisky would be Them, Van Morrison's group -- one of the cover versions they had been playing had been Them's \"Gloria\":\n\n[Excerpt: Them, \"Gloria\"]\n\nThey supported Them for two weeks at the Whisky, and Jim Morrison watched Van Morrison intently. The two men had very similar personalities according to the other members of the Doors, and Morrison picked up a lot of his performing style from watching Van on stage every night. The last night Them played the venue, Morrison joined them on stage for an extended version of “Gloria” which everyone involved remembered as the highlight of their time there.\n\nEvery major band on the LA scene played residencies at the Whisky, and over the summer of 1966 the Doors were the support act for the Mothers of Invention, the Byrds, the Turtles, the Buffalo Springfield, and Captain Beefheart and the Magic Band. This was a time when the Sunset Strip was the centre of Californian musical life, before that centre moved to San Francisco, and the Doors were right at the heart of it. Though it wasn't all great -- this was also the period when there were a series of riots around Sunset Strip, as immortalised in the American International Pictures film Riot on Sunset Strip, and its theme song, by the Standells:\n\n[Excerpt: The Standells, \"Riot on Sunset Strip\"]\n\nWe'll look at those riots in more detail in a future episode, so I'll leave discussing them for now, but I just wanted to make sure they got mentioned.\n\nThat Standells song, incidentally, was co-written by John Fleck, who under his old name of John Fleckenstein we saw last episode as the original bass player for Love. And it was Love who ensured that the Doors finally got the record deal they needed.\n\nThe deal came at a perfect time for the Doors -- just like when they'd been picked up by the Whisky A Go-Go just as they were about to lose their job at the London Fog, so they got signed to a record deal just as they were about to lose their job at the Whisky. They lost that job because of a new song that Krieger and Morrison had written.\n\n\"The End\" had started out as Krieger's attempt at writing a raga in the style of Ravi Shankar, and he had brought it in to one of his increasingly frequent writing sessions with Morrison, where the two of them would work out songs without the rest of the band, and Morrison had added lyrics to it. Lyrics that were partly inspired by his own fraught relationship with his parents, and partly by Oedipus Rex:\n\n[Excerpt: The Doors, \"The End\"]\n\nAnd in the live performance, Morrison had finished that phrase with the appropriate four-letter Oedipal payoff, much to the dismay of the owners of the Whisky A Go Go, who had told the group they would no longer be performing there.\n\nBut three days before that, the group had signed a deal with Elektra Records. Elektra had for a long time been a folk specialist label, but they had recently branched out into other music, first with the Paul Butterfield Blues Band, a favourite of Robby Krieger's, and then with their first real rock signing, Love.\n\nAnd Love were playing a residency at the Whisky A Go Go, and Arthur Lee had encouraged Jac Holzman, the label's owner, to come and check out their support band, who he thought were definitely worth signing. The first time Holzman saw them he was unimpressed -- they sounded to him just like a bunch of other white blues bands -- but he trusted Arthur Lee's judgement and came back a couple more times. The third time, they performed their version of \"Alabama Song\", and everything clicked into place for Holzman. He immediately signed the group to a three-album deal with an option to extend it to seven. The group were thrilled -- Elektra wasn't a major label like Columbia, but they were a label that nurtured artists and wouldn't just toss them aside.\n\nThey were even happier when soon after they signed to Elektra, the label signed up a new head of West Coast A&R -- Billy James, the man who had signed them to Columbia, and who they knew would be in their corner.\n\nJac Holzman also had the perfect producer for the group, though he needed a little persuading. Paul Rothchild had made his name as the producer for the first couple of albums by the Paul Butterfield Blues Band:\n\n[Excerpt: The Paul Butterfield Blues Band, \"Mary Mary\"]\n\nThey were Robby Krieger's favourite group, so it made sense to have Rothchild on that level. And while Rothchild had mostly worked in New York, he was in LA that summer, working on the debut album by another Elektra signing, Tim Buckley. The musicians on Buckley's album were almost all part of the same LA scene that the Doors were part of -- other than Buckley's normal guitarist Lee Underwood there was keyboard player Van Dyke Parks, bass player Jim Fielder, who had had a brief stint in the Mothers of Invention and was about to join Buffalo Springfield, and drummer Billy Mundi, who was about to join the Mothers of Invention. And Buckley himself sang in a crooning voice extremely similar to that of Morrison, though Buckley had a much larger range:\n\n[Excerpt: Tim Buckley, \"Aren't You the Girl?\"]\n\nThere was one problem, though -- Rothchild didn't want to do it. He wasn't at all impressed with the band at first, and he wanted to sign a different band, managed by Albert Grossman, instead. But Holzman persuaded him because Rothchild owed him a favour -- Rothchild had just spent several months in prison after a drug bust, and while he was inside Holzman had given his wife a job so she would have an income, and Holzman also did all the paperwork with Rothchild's parole officer to allow him to leave the state. So with great reluctance Rothchild took the job, though he soon came to appreciate the group's music.\n\nHe didn't appreciate their second session though. The first day, they'd tried recording a version of \"The End\", but it hadn't worked, so on the second night they tried recording it again, but this time Morrison was on acid and behaving rather oddly. The final version of \"The End\" had to be cut together from two takes, and the reason is that at the point we heard earlier:\n\n[Excerpt: The Doors, \"The End\"]\n\nMorrison was whirling around, thrashing about, and knocked over a TV that the engineer, Bruce Botnick, had brought into the studio so he could watch the baseball game -- which Manzarek later exaggerated to Morrison throwing the TV through the plate glass window between the studio and the control room. According to everyone else, Morrison just knocked it over and they picked it up after the take finished and it still worked fine.\n\nBut Morrison had taken a *lot* of acid, and on the way home after the session he became convinced that he had a psychic knowledge that the studio was on fire. He got his girlfriend to turn the car back around, drove back to the studio, climbed over the fence, saw the glowing red lightbulbs in the studio, became convinced that they were fires, and sprayed the entire place with the fire extinguisher, before leaving convinced he had saved the band's equipment -- and leaving telltale evidence as his boot got stuck in the fence on the way out and he just left it there.\n\nBut despite that little hiccup, the sessions generally went well, and the group and label were pleased with the results. The first single released from the album, \"Break on Through\", didn't make the Hot One Hundred:\n\n[Excerpt: The Doors, \"Break on Through\"]\n\nBut when the album came out in January 1967, Elektra put all its resources behind the album, and it started to get a bit of airplay as a result. In particular, one DJ on the new FM radio started playing \"Light My Fire\" -- at this time, FM had only just started, and while AM radio stuck to three-minute singles for the most part, FM stations would play a wider variety of music.\n\nSome of the AM DJs started telling Elektra that they would play the record, too, if it was the length of a normal single, and so Rothchild and Botnick went into the studio and edited the track down to half its previous seven-and-a-half-minute length.\n\nWhen the group were called in to hear the edit, they were initially quite excited to hear what kind of clever editing microsurgery had been done to bring the song down to the required length, but they were horrified when Rothchild actually played it for them. As far as the group were concerned, the heart of the song was the extended instrumental improvisation that took up the middle section:\n\n[Excerpt: The Doors, \"Light My Fire\"]\n\nOn the album version, that lasted over three minutes. Rothchild and Botnick cut that section down to just this:\n\n[Excerpt: The Doors, \"Light My Fire (single edit)\"]\n\nThe group were mortified -- what had been done to their song? That wasn't the sound of people trying to be McCoy Tyner and Elvin Jones, it was just... a pop song.  Rothchild explained that that was the point -- to get the song played on AM radio and get the group a hit. He pointed out how the Beatles records never had an instrumental section that lasted more than eight bars, and the group eventually talked themselves round. After all, wasn't this really more subversive? You get the kids hooked with the pop single, and then they buy the album and the track is a whole other thing! It would blow the kids' minds!\n\nSo they eventually agreed to let the track go out like that, and it made number one on the charts:\n\n[Excerpt: The Doors, \"Light My Fire\"]\n\nThe Doors were now a major success, and they even got a slot on the Ed Sullivan Show, though that went badly for them. They were asked to not use the line \"We couldn't get much higher\", because of the drug reference, and they agreed, but then Morrison either forgot in the excitement or deliberately ignored the request depending on who you ask. According to Manzarek this led to a massive confrontation with the producers after the show, though Krieger denies any confrontation happened and says \"The way Ray told stories, I'm surprised his version didn't end with us strutting in slow motion down Broadway while the CBS studios exploded in the background\".\n\nWhatever the truth, they weren't invited back on the Ed Sullivan Show again, but that didn't matter -- the Doors had had their first number one hit, they had a charismatic lead singer, and they were about to put out their second album.\n\nBut as we'll see the next time we look at the Doors, what you find when you can't get much higher is that the only way to go is down.",
  "itunes:subtitle": "Episode one hundred and forty-eight of A History of Rock Music in Five Hundred Songs looks at “Light My Fire by the Doors, the history of cool jazz, and Maharishi Mahesh Yogi. Click the full post to read liner notes, links to more information, and a tran",
  "itunes:keywords": "Aldous Huxley,Arthur Lee,Bruce Botnick,Chet Baker,Dick Bock,Gerry Mulligan,Jac Holzman,Jim Morrison,John Coltrane,Love,Maharishi Mahesh Yogi,Miles Davis,Paul Rothchild,Ravi Shankar,The Doors,Them,Van Morrison,Vietnam War",
  "content:encoded": "Episode one hundred and forty-eight of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Light My Fire\" by the Doors, the history of cool jazz, and Maharishi Mahesh Yogi. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/65819863\">on \"My Friend Jack\" by the Smoke</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I’ve put together <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-148-light-my-fire/\">a Mixcloud mix</a> containing all the music excerpted in this episode and the shorter spoken-word tracks.\n\nInformation on Dick Bock, World Pacific, and Ravi Shankar came from <a href=\"https://amzn.to/3JdVYyG\"><em>Indian Sun: The Life and Music of Ravi Shankar</em> by Oliver Craske</a>.\n\nRay Manzarek, John Densmore, and Robby Krieger have all released autobiographies. Densmore's is out of print, but I referred to <a href=\"https://amzn.to/3vvnByF\">Manzarek's</a> and <a href=\"https://amzn.to/3Lw3fe4\">Krieger's</a> here. Of the two Krieger's is vastly more reliable. I also used <a href=\"https://amzn.to/3F5fLi8\">Mick Wall's book on the Doors</a> and <a href=\"https://amzn.to/3kt8Aa8\">Stephen Davis' biography of Jim Morrison</a>.\n\nInformation about Elektra Records came from <em>Follow the Music</em> by Jac Holzman and Gavan Daws, which is available as <a href=\"https://elektra70.elektrarecords.com/followthemusic.pdf\">a free PDF download on Elektra's website</a>.\n\nBiographical information on Maharishi Mahesh Yogi comes from <a href=\"https://amzn.to/3yabAR3\">this book</a>, written by one of his followers.\n\nThe Doors' complete studio albums can be <a href=\"https://amzn.to/3kqYnuL\">bought as MP3s</a> for £14.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\nThere are two big problems that arise for anyone trying to get an accurate picture of history, and which have certainly arisen for me during the course of this podcast -- things which make sources unreliable enough that you feel you have to caveat everything you say on a subject. One of those is hagiography, and the converse desire to tear heroes down. No matter what one wants to say on, say, the subjects of Jesus or Mohammed or Joseph Smith, the only sources we have for their lives are written either by people who want to present them as unblemished paragons of virtue, or by people who want to destroy that portrayal -- we know that any source is written by someone with a bias, and it might be a bias we agree with, but it's still a bias.\n\nThe other, related, problem, is deliberate disinformation. This comes up especially for people dealing with military history -- during conflicts, governments obviously don't want their opponents to know when their attacks have caused damage, or to know what their own plans are, and after a war has concluded the belligerent parties want to cover up their own mistakes and war crimes. We're sadly seeing that at the moment in the situation in Ukraine -- depending on one's media diet, one could get radically different ideas of what is actually going on in that terrible conflict.\n\nBut it happens all the time, in all wars, and on all sides. Take the Vietnam War. While the US was involved on the side of the South Vietnamese government from the start of that conflict, it was in a very minor way, mostly just providing supplies and training. Most historians look at the real start of US involvement in that war as having been in August 1964. President Johnson had been wanting, since assuming the Presidency in November 1963 after the death of John F Kennedy, to get further into the war, but had needed an excuse to do so. The Gulf of Tonkin Incident provided him with that excuse.\nOn August the second, a fleet of US warships entered into what the North Vietnamese considered their territorial waters -- they used a different distance from shore to mark their territorial waters than most other countries used, and one which wasn't generally accepted, but which they considered important. Because of this, some North Vietnamese ships started following the American ones. The American ships, who thought they weren't doing anything wrong, set off what they considered to be warning shots, and the North Vietnamese ships fired back, which to the American ships was considered them attacking. Some fire was exchanged, but not much happened.\n\nTwo days later, the American ships believed they were getting attacked again, and spent several hours firing at what they believed were North Vietnamese submarines. It was later revealed that this was just the American sonar systems playing up, and that they were almost certainly firing at nothing at all, and some even suspected that at the time -- President Johnson apparently told other people in confidence that in his opinion they'd been firing at stray dolphins.\n\nBut that second \"attack\", however flimsy the evidence, was enough that Johnson could tell Congress and the nation that an American fleet had been attacked by the North Vietnamese, and use that as justification to get Congress to authorise him sending huge numbers of troops to Vietnam, and getting America thoroughly embroiled in a war that would cost innumerable lives and billions of dollars for what turned out to be no benefit at all to anyone.\n\nThe commander of the US fleet involved in the Gulf of Tonkin operation was then-Captain, later Rear Admiral, Steve Morrison:\n\n[Excerpt: The Doors, \"The End\"]\n\nWe've talked a bit in this podcast previously about the development of jazz in the forties, fifties, and early sixties -- there was a lot of back and forth influence in those days between jazz, blues, R&B, country, and rock and roll, far more than one might imagine looking at the popular histories of these genres, and so we've looked at swing, bebop, and modal jazz before now.\n\nBut one style of music we haven't touched on is the type that was arguably the most popular and influential style of jazz in the fifties, even though we've mentioned several of the people involved in it. We've never yet had a proper look at Cool Jazz.\n\nCool Jazz, as its name suggests, is a style of music that was more laid back than the more frenetic bebop or hard-edged modal jazz. It was a style that sounded sophisticated, that sounded relaxed, that prized melody and melodic invention over super-fast technical wizardry, and that produced much of what we now think of when we think of \"jazz\" as a popular style of music. The records of Dave Brubeck, for example, arguably the most popular fifties jazz musician, are very much in the \"cool jazz\" mode:\n\n[Excerpt: The Dave Brubeck Quartet, \"Take Five\"]\n\nAnd we have mentioned on several occasions the Modern Jazz Quartet, who were cited as influences by everyone from Ray Charles to the Kinks to the Modern Folk Quartet:\n\n[Excerpt: The Modern Jazz Quartet, \"Regret?\"]\n\nWe have also occasionally mentioned people like Mose Allison, who occasionally worked in the Cool Jazz mode. But we've never really looked at it as a unified thing.\n\nCool Jazz, like several of the other developments in jazz we've looked at, owes its existence to the work of the trumpeter Miles Davis, who was one of the early greats of bop and who later pioneered modal jazz.\n\nIn 1948, in between his bop and modal periods, Davis put together a short-lived nine-piece group, the Miles Davis Nonette, who performed together for a couple of weeks in late 1948, and who recorded three sessions in 1949 and 1950, but who otherwise didn't perform much. Each of those sessions had a slightly different lineup, but key people involved in the recordings were Davis himself, arranger Gil Evans, piano player John Lewis, who would later go on to become the leader of the Modern Jazz Quartet, and baritone sax player Gerry Mulligan.\n\nMulligan and Evans, and the group's alto player Lee Konitz, had all been working for the big band Claude Thornhill and his Orchestra, a band which along with the conventional swing instruments also had a French horn player and a tuba player, and which had recorded soft, mellow, relaxing music:\n\n[Excerpt: Claude Thornhill and his Orchestra, \"To Each His Own\"]\n\nThe Davis Nonette also included French horn and tuba, and was explicitly modelled on Thornhill's style, but in a stripped-down version. They used the style of playing that Thornhill preferred, with no vibrato, and with his emphasis on unison playing, with different instruments doubling each other playing the melody, rather than call-and response riffing:\n\n[Excerpt: The Miles Davis Nonette, \"Venus De Milo\"]\n\nThose recordings were released as singles in 1949 and 1950, and were later reissued in 1957 as an album titled \"Birth of the Cool\", by which point Cool Jazz had become an established style, though Davis himself had long since moved on in other musical directions.\n\nAfter the Birth of the Cool sessions, Gerry Mulligan had recorded an album as a bandleader himself, and then had moved to the West Coast, where he'd started writing arrangements for Stan Kenton, one of the more progressive big band leaders of the period:\n\n[Excerpt: Stan Kenton, \"Young Blood\"]\n\nWhile working for Kenton, Mulligan had started playing dates at a club called the Haig, where the headliner was the vibraphone player Red Norvo. While Norvo had started out as a big-band musician, playing with people like Benny Goodman, he had recently started working in a trio, with just a guitarist, initially Tal Farlowe, and bass player, initially Charles Mingus:\n\n[Excerpt: Red Norvo, \"This Can't Be Love\"]\n\nBy 1952 Mingus had left Norvo's group, but they were still using the trio format, and that meant there was no piano at the venue, which meant that Mulligan had to form a band that didn't rely on the chordal structures that a piano would provide -- the idea of a group with a rhythm section that *didn't* have a piano was quite an innovation in jazz at this time, and freeing themselves from that standard instrument ended up opening up extra possibilities. His group consisted of himself on saxophone, Chet Baker on trumpet, Bob Whitlock on bass and Chico Hamilton on drums. They made music in much the same loose, casual, style as the recordings Mulligan had made with Davis, but in a much smaller group with the emphasis being on the interplay between Mulligan and Baker.\n\nAnd this group were the first group to record on a new label, Pacific Jazz, founded by Dick Bock.\n\nBock had served in the Navy during World War II, and had come back from the South Pacific with two tastes -- a taste for hashish, and for music that was outside the conventional American pop mould. Bock *loved* the Mulligan Quartet, and in partnership with his friend Roy Harte, a notable jazz drummer, he raised three hundred and fifty dollars to record the first album by Mulligan's new group:\n\n[Excerpt: Gerry Mulligan Quartet, \"Aren't You Glad You're You?\"]\n\nPacific Jazz, the label Bock and Harte founded, soon became *the* dominant label for Cool Jazz, which also became known as the West Coast Sound.  The early releases on the label were almost entirely by the Mulligan Quartet, released either under Mulligan's name, as by Chet Baker, or as \"Lee Konitz and the Gerry Mulligan Quartet\" when Mulligan's old bandmate Konitz joined them.\n\nThese records became big hits, at least in the world of jazz. But both Mulligan and Baker were heroin addicts, and in 1953 Mulligan got arrested and spent six months in prison. And while he was there, Chet Baker made some recordings in his own right and became a bona fide star. Not only was Baker a great jazz trumpet player, he was also very good looking, and it turned out he could sing too. The Mulligan group had made the song \"My Funny Valentine\" one of the highlights of its live shows, with Baker taking a trumpet solo:\n\n[Excerpt: Gerry Mulligan Quartet, \"My Funny Valentine\"]\n\nBut when Baker recorded a vocal version, for his album Chet Baker Sings, it made Baker famous:\n\n[Excerpt: Chet Baker, \"My Funny Valentine\"]\n\nWhen Mulligan got out of prison, he wanted to rehire Baker, but Baker was now topping the popularity polls in all the jazz magazines, and was the biggest breakout jazz star of the early fifties. But Mulligan formed a new group, and this just meant that Pacific Jazz had *two* of the biggest acts in jazz on its books now, rather than just one.\n\nBut while Bock loved jazz, he was also fascinated by other kinds of music, and while he was in New York at the beginning of 1956 he was invited by his friend George Avakian, a producer who had worked with Miles Davis, Louis Armstrong, and others, to come and see a performance by an Indian musician he was working with. Avakian was just about to produce Ravi Shankar's first American album, The Sounds of India, for Columbia Records. But Columbia didn't think that there was much of a market for Shankar's music -- they were putting it out as a speciality release rather than something that would appeal to the general public -- and so they were happy for Bock to sign Shankar to his own label. Bock renamed the company World Pacific, to signify that it was now going to be putting out music from all over the world, not just jazz, though he kept the Pacific Jazz label for its jazz releases, and he produced Shankar's next album,  India's Master Musician:\n\n[Excerpt: Ravi Shankar, \"Raga Charu Keshi\"]\n\nMost of Shankar's recordings for the next decade would be produced by Bock, and Bock would also try to find ways to combine Shankar's music with jazz, though Shankar tried to keep a distinction between the two. But for example on Shankar's next album for World Pacific, Improvisations and Theme from Pather Panchali, he was joined by a group of West Coast jazz musicians including Bud Shank (who we'll hear about again in a future episode) on flute:\n\n[Excerpt: Ravi Shankar, \"Improvisation on the Theme From Pather Panchali\"]\n\nBut World Pacific weren't just putting out music. They also put out spoken-word records. Some of those were things that would appeal to their jazz audience, like the comedy of Lord Buckley:\n\n[Excerpt: Lord Buckley, \"Willy the Shake\"]\n\nBut they also put out spoken-word albums that appealed to Bock's interest in spirituality and philosophy, like an album by Gerald Heard. Heard had previously written the liner notes for Chet Baker Sings!, but as well as being a jazz fan Heard was very connected in the world of the arts -- he was a very close friend with Aldous Huxley -- and was also interested in various forms of non-Western spirituality. He practiced yoga, and was also fascinated by Buddhism, Vedanta, and Taoism:\n\n[Excerpt: Gerald Heard, \"Paraphrased from the Tao te Ching of Lao Tzu\"]\n\nWe've come across Heard before, in passing, in the episode on \"Tomorrow Never Knows\", when Ralph Mentzner said of his experiments with Timothy Leary and Ram Dass \"At the suggestion of Aldous Huxley and Gerald Heard we began using the Bardo Thödol ( Tibetan Book of the Dead) as a guide to psychedelic sessions\" -- Heard was friends with both Huxley and Humphrey Osmond, and in fact had been invited by them to take part in the mescaline trip that Huxley wrote about in his book The Doors of Perception, the book that popularised psychedelic drug use, though Heard was unable to attend at that time.\n\nHeard was a huge influence on the early psychedelic movement -- though he always advised Leary and his associates not to be so public with their advocacy, and just to keep it to a small enlightened circle rather than risk the wrath of the establishment -- and he's cited by almost everyone in Leary's circle as having been the person who, more than anything else, inspired them to investigate both psychedelic drugs and mysticism. He's the person who connected Bill W. of Alcoholics Anonymous with Osmond and got him advocating LSD use. It was Heard's books that made Huston Smith, the great scholar of comparative religions and associate of Leary, interested in mysticism and religions outside his own Christianity, and Heard was one of the people who gave Leary advice during his early experiments.\n\nSo it's not surprising that Bock also became interested in Leary's ideas before they became mainstream. Indeed, in 1964 he got Shankar to do the music for a short film based on The Psychedelic Experience, which Shankar did as a favour for his friend even though Shankar didn't approve of drug use. The film won an award in 1965, but quickly disappeared from circulation as its ideas were too controversial:\n\n[Excerpt: The Psychedelic Experience (film)]\n\nAnd Heard introduced Bock to other ideas around philosophy and non-Western religions. In particular, Bock became an advocate for a little-known Hindu mystic who had visited the US in 1959 teaching a new style of meditation which he called Transcendental Meditation.\n\nA lot is unclear about the early life of Maharishi Mahesh Yogi, even his birth name -- both \"Maharishi\" and \"Yogi\" are honorifics rather than names as such, though he later took on both as part of his official name, and in this and future episodes I'll refer to him as \"the Maharishi\". What we do know is that he was born in India, and had attained a degree in physics before going off to study with Swami Brahmananda Saraswati, a teacher of the Advaita Vedanta school of Hinduism.\n\nNow, I am not a Hindu, and only have a passing knowledge of Hindu theology and traditions, and from what I can gather getting a proper understanding requires a level of cultural understanding I don't have, and in particular a knowledge of the Sanskrit language, so my deepest apologies for any mangling I do of these beliefs in trying to talk about them as they pertain to mid-sixties psychedelic rock. I hope my ignorance is forgivable, and seen as what it is rather than malice. But the teachings of this school as I understand them seem to centre around an idea of non-separation -- that God is in all things, and is all things, and that there is no separation between different things, and that you merely have to gain a deep realisation of this. The Maharishi later encapsulated this in the phrase \"I am that, thou art that, all this is that\", which much later the Beach Boys, several of whom were followers of the Maharishi, would turn into a song:\n\n[Excerpt: The Beach Boys, \"All This is That\"]\n\nThe other phrase they're singing there, \"Jai Guru Dev\" is also a phrase from the Maharishi, and refers to his teacher Brahmananda Saraswati -- it means \"all hail the divine teacher\" or \"glory to the heavenly one\", and \"guru dev\" or \"guru deva\" was the name the Maharishi would use for Saraswati after his death, as the Maharishi believed that Saraswati was an actual incarnation of God. It's that phrase that John Lennon is singing in \"Across the Universe\" as well, another song later inspired by the Maharishi's teachings:\n\n[Excerpt: The Beatles, \"Across the Universe\"]\n\nThe Maharishi became, by his own account, Saraswati's closest disciple, advisor, and right-hand man, and was privy to his innermost thoughts. However, on Saraswati's death the leadership of the monastery he led became deeply contested, with two different rivals to the position, and the Maharishi was neither -- the rules of the monastery said that only people born into the Brahmin caste could reach the highest positions in the monastery's structure, and the Maharishi was not a Brahmin.\n\nSo instead of remaining in the monastery, the Maharishi went out into the world to teach a new form of meditation which he claimed he had learned from Guru Dev, a technique which became known as transcendental meditation. The Maharishi would, for the rest of his life, always claim that the system he taught was Guru Dev's teaching for the world, not his own, though the other people who had been at the monastery with him said different things about what Saraswati had taught -- but of course it's perfectly possible for a spiritual leader to have had multiple ideas and given different people different tasks.\n\nThe crucial thing about the Maharishi's teaching, the way it differed from everything else in the history of Hindu monasticism (as best I understand this) is that all previous teachers of meditation had taught that to get the benefit of the techniques one had to be a renunciate -- you should go off and become a monk and give up all worldly pleasures and devote your life to prayer and meditation.\n\nTraditionally, Hinduism has taught that there are four stages of life -- the student, the householder or married person with a family, the retired person, and the Sanyasi, or renunciate, but that you could skip straight from being a student to being a Sanyasi and spend your life as a monk. The Maharishi, though, said:\n\n\"Obviously enough there are two ways of life: the way of the Sanyasi and the way of life of a householder. One is quite opposed to the other. A Sanyasi renounces everything of the world, whereas a householder needs and accumulates everything. The one realises, through renunciation and detachment, while the other goes through all attachments and accumulation of all that is needed for physical life.\"\n\nWhat the Maharishi taught was that there are some people who achieve the greatest state of happiness by giving up all the pleasures of the senses, eating the plainest possible food, having no sexual, familial, or romantic connections with anyone else, and having no possessions, while there are other people who achieve the greatest state of happiness by being really rich and having a lot of nice stuff and loads of friends and generally enjoying the pleasures of the flesh -- and that just as there are types of meditation that can help the first group reach enlightenment, there are also types of meditation that will fit into the latter kind of lifestyle, and will help those people reach oneness with God but without having to give up their cars and houses and money. And indeed, he taught that by following his teachings you could get *more* of those worldly pleasures.\n\nAll you had to do, according to his teaching, was to sit still for fifteen to twenty minutes, twice a day, and concentrate on a single Sanskrit word or phrase, a mantra, which you would be given after going through a short course of teaching. There was nothing else to it, and you would eventually reach the same levels of enlightenment as the ascetics who spent seventy years living in a cave and eating only rice -- and you'd end up richer, too.\n\nThe appeal of this particular school is, of course, immediately apparent, and Bock became a big advocate of the Maharishi, and put out three albums of his lectures:\n\n[Excerpt: Maharishi Mahesh Yogi, \"Deep Meditation\"]\n\nBock even met his second wife at one of the Maharishi's lectures, in 1961.\n\nIn the early sixties, World Pacific got bought up by Liberty Records, the label for which Jan and Dean and others recorded, but Bock remained in charge of the label, and expanded it, adding another subsidiary, Aura Records, to put out rock and roll singles. Aura was much less successful than the other World Pacific labels. The first record the label put out was a girl-group record, \"Shooby Dooby\", by the Lewis Sisters, two jazz-singing white schoolteachers from Michigan who would later go on to have a brief career at Motown:\n\n[Excerpt: The Lewis Sisters, \"Shooby Dooby\"]\n\nThe most successful act that Aura ever had was Sonny Knight, an R&B singer who had had a top twenty hit in 1956 with \"Confidential\", a song he'd recorded on Specialty Records with Bumps Blackwell, and which had been written by Dorinda Morgan:\n\n[Excerpt: Sonny Knight, \"Confidential\"]\n\nBut Knight's biggest hit on Aura, \"If You Want This Love\", only made number seventy-one on the pop charts:\n\n[Excerpt: Sonny Knight, \"If You Want This Love\"]\n\nKnight would later go on to write a novel, The Day the Music Died, which Greil Marcus described as \"the bitterest book ever written about how rock'n'roll came to be and what it turned into\". Marcus said it was about \"how a rich version of American black culture is transformed into a horrible, enormously profitable white parody of itself: as white labels sign black artists only to ensure their oblivion and keep those blacks they can't control penned up in the ghetto of the black charts; as white America, faced with something good, responds with a poison that will ultimately ruin even honest men\".\n\nGiven that Knight was the artist who did the *best* out of Aura Records, that says a great deal about the label.\n\nBut one of the bands that Aura signed, who did absolutely nothing on the charts, was a group called Rick and the Ravens, led by a singer called Screamin' Ray Daniels. They were an LA club band who played a mixture of the surf music which the audiences wanted and covers of blues songs which Daniels preferred to sing. They put out two singles on Aura, \"Henrietta\":\n\n[Excerpt: Rick and the Ravens, \"Henrietta\"]\n\nand \"Soul Train\":\n\n[Excerpt: Rick and the Ravens, \"Soul Train\"]\n\nRay Daniels was a stage name -- his birth name was Ray Manzarek, and he would later return to that name -- and the core of the band was Ray on vocals and his brothers Rick on guitar and Jim on harmonica. Manzarek thought of himself as a pretty decent singer, but they were just a bar band, and music wasn't really his ideal career.  Manzarek had been sent to college by his solidly lower-middle-class Chicago family in the hope that he would become a lawyer, but after getting a degree in economics and a brief stint in the army, which he'd signed up for to avoid getting drafted in the same way people like Dean Torrence did, he'd gone off to UCLA to study film, with the intention of becoming a filmmaker. His family had followed him to California, and he'd joined his brothers' band as a way of making a little extra money on the side, rather than as a way to become a serious musician.\n\nManzarek liked the blues songs they performed, and wasn't particularly keen on the surf music, but thought it was OK. What he really liked, though, was jazz -- he was a particular fan of McCoy Tyner, the pianist on all the great John Coltrane records:\n\n[Excerpt: John Coltrane, \"My Favorite Things\"]\n\nManzarek was a piano player himself, though he didn't play much with the Ravens, and he wanted more than anything to be able to play like Tyner, and so when Rick and the Ravens got signed to Aura Records, he of course became friendly with Dick Bock, who had produced so many great jazz records and worked with so many of the greats of the genre.\n\nBut Manzarek was also having some problems in his life. He'd started taking LSD, which was still legal, and been fascinated by its effects, but worried that he couldn't control them -- he couldn't tell whether he was going to have a good trip or a bad one. He was wondering if there was a way he could have the same kind of revelatory mystical experience but in a more controlled manner.\n\nWhen he mentioned this to Bock, Bock told him that the best method he knew for doing that was transcendental meditation. Bock gave him a copy of one of the Maharishi's albums, and told him to go to a lecture on transcendental meditation, run by the head of the Maharishi's west-coast organisation, as by this point the Maharishi's organisation, known as Spiritual Regeneration, had an international infrastructure, though it was still nowhere near as big as it would soon become.\n\nAt the lecture, Manzarek got talking to one of the other audience members, a younger man named John Densmore. Densmore had come to the lecture with his friend Robby Krieger, and both had come for the same reason that Manzarek had -- they'd been having bad trips and so had become a little disillusioned with acid.\n\nKrieger had been the one who'd heard about transcendental meditation, while he was studying the sitar and sarod at UCLA -- though Krieger would later always say that his real major had been in \"not joining the Army\". UCLA had one of the few courses in Indian music available in the US at the time, as thanks in part to Bock California had become the centre of American interest in music from India -- so much so that in 1967 Ravi Shankar would open up a branch of his own Kinnara Music School there.\n\n(And you can get an idea of how difficult it is to separate fact from fiction when researching this episode that one of the biographies I've used for the Doors says that Krieger heard about the Maharishi while studying at the Kinnara school. As the only branch of the Kinnara school that was open at this point was in Mumbai, it's safe to say that unless Krieger had a *really* long commute he wasn't studying there at this point.)\n\nDensmore and Manzarek got talking, and they found that they shared a lot of the same tastes in jazz -- just as Manzarek was a fan of McCoy Tyner, so Densmore was a fan of Elvin Jones, the drummer on those Coltrane records, and they both loved the interplay of the two musicians:\n\n[Excerpt: John Coltrane, \"My Favorite Things\"]\n\nManzarek was starting to play a bit more keyboards with the Ravens, and he was also getting annoyed with the Ravens' drummer, who had started missing rehearsals -- he'd turn up only for the shows themselves. He thought it might be an idea to get Densmore to join the group, and Densmore agreed to come along for a rehearsal.\n\nThat initial rehearsal Densmore attended had Manzarek and his brothers, and may have had a bass player named Patricia Hansen, who was playing with the group from time to time around this point, though she was mostly playing with a different bar band, Patty and the Esquires. But as well as the normal group members, there was someone else there, a friend of Manzarek's from film school named Jim Morrison.\n\nMorrison was someone who, by Manzarek's later accounts, had been very close to Manzarek at university, and who Manzarek had regarded as a genius, with a vast knowledge of beat poetry and European art film, but who had been regarded by most of the other students and the lecturers as being a disruptive influence. Morrison had been a fat, asthmatic, introverted kid -- he'd had health problems as a child, including a bout of rheumatic fever which might have weakened his heart, and he'd also been prone to playing the kind of \"practical jokes\" which can often be a cover for deeper problems. For example, as a child he was apparently fond of playing dead -- lying in the corridors at school and being completely unresponsive for long periods no matter what anyone did to move him, then suddenly getting up and laughing at anyone who had been concerned and telling them it was a joke.\n\nGiven how frequently Morrison would actually pass out in later life, often after having taken some substance or other, at least one biographer has suggested that he might have had undiagnosed epilepsy (or epilepsy that was diagnosed but which he chose to keep a secret) and have been having absence seizures and covering for them with the jokes. Robby Krieger also says in his own autobiography that he used to have the same doctor as Morrison, and the doctor once made an offhand comment about Morrison having severe health problems, \"as if it was common knowledge\".\n\nHis health difficulties, his weight, his introversion, and the experience of moving home constantly as a kid because of his father's career in the Navy, had combined to give him a different attitude to most of his fellow students, and in particular a feeling of rootlessness -- he never owned or even rented his own home in later years, just moving in with friends or girlfriends -- and a lack of sense of his own identity, which would often lead to him making up lies about his life and acting as if he believed them. In particular, he would usually claim to friends that his parents were dead, or that he had no contact with them, even though his family have always said he was in at least semi-regular contact.\n\nAt university, Morrison had been a big fan of Rick and the Ravens, and had gone to see them perform regularly, but would always disrupt the shows -- he was, by all accounts, a lovely person when sober but an aggressive boor when drunk -- by shouting out for them to play \"Louie Louie\", a song they didn't include in their sets. Eventually one of Ray's brothers had called his bluff and said they'd play the song, but only if Morrison got up on stage and sang it. He had -- the first time he'd ever performed live -- and had surprised everyone by being quite a good singer.\n\nAfter graduation, Morrison and Manzarek had gone their separate ways, with Morrison saying he was moving to New York. But a few weeks later they'd encountered each other on the beach -- Morrison had decided to stay in LA, and had been staying with a friend, mostly sleeping on the friend's rooftop. He'd been taking so much LSD he'd forgotten to eat for weeks at a time, and had lost a great deal of weight, and Manzarek properly realised for the first time that his friend was actually good-looking.\n\nMorrison also told Manzarek that he'd been writing songs -- this was summer 1965, and the Byrds' version of \"Mr. Tambourine Man\", Dylan's \"Like a Rolling Stone\", and the Stones' \"Satisfaction\" had all shown him that there was potential for pop songs to have more interesting lyrical content than \"Louie Louie\". Manzarek asked him to sing some of the songs he'd been writing, and as Manzarek later put it \"he began to sing, not in the booze voice he used at the Turkey Joint, but in a Chet Baker voice\".\nThe first song Morrison sang for Ray Manzarek was one of the songs that Rick and the Ravens would rehearse that first time with John Densmore, \"Moonlight Drive\":\n\n[Excerpt: Rick and the Ravens, \"Moonlight Drive\"]\n\nManzarek invited Morrison to move in with him and his girlfriend. Manzarek seems to have thought of himself as a mentor, a father figure, for Morrison, though whether that's how Morrison thought of him is impossible to say.\n\nManzarek, who had a habit of choosing the myth over the truth, would later claim that he had immediately decided that he and Morrison were going to be a duo and find a whole new set of musicians, but all the evidence points to him just inviting Morrison to join the Ravens as the singer\nCertainly the first recordings this group made, a series of demos, were under Rick and the Ravens' name, and paid for by Aura Records. They're all of songs written by Morrison, and seem to be sung by Morrison and Manzarek in close harmony throughout. But the demos did not impress the head of Liberty Records, which now owned Aura, and who saw no commercial potential in them, even in one that later became a number one hit when rerecorded a couple of years later:\n\n[Excerpt: Rick and the Ravens, \"Hello I Love You\"]\n\nAlthough to be fair, that song is clearly the work of a beginning songwriter, as Morrison has just taken the riff to \"All Day and All of the Night\" by the Kinks, and stuck new words to it:\n\n[Excerpt: The Kinks, \"All Day and All of the Night\"]\n\nBut it seems to have been the lack of success of these demos that convinced Manzarek's brothers and Patricia Hansen to quit the band. According to Manzarek, his brothers were not interested in what they saw as Morrison's pretensions towards poetry, and didn't think this person who seemed shy and introverted in rehearsals but who they otherwise knew as a loud annoying drunk in the audience would make a good frontman.\n\nSo Rick and the Ravens were down to just Jim Morrison, Ray Manzarek, and John Densmore, but they continued shopping their demos around, and after being turned down by almost everyone they were signed by Columbia Records, specifically by Billy James, who they liked because he'd written the liner notes to a Byrds album, comparing them to Coltrane, and Manzarek liked the idea of working with an A&R man who knew Coltrane's work, though he wasn't impressed by the Byrds themselves, later writing \"The Byrds were country, they didn’t have any black in them at all. They couldn’t play jazz. Hell, they probably didn’t even know anything about jazz. They were folk-rock, for cri-sake. Country music. For whites only.\"\n\n(Ray Manzarek was white).\n\nThey didn't get an advance from Columbia, but they did get free equipment -- Columbia had just bought Vox, who made amplifiers and musical instruments, and Manzarek in particular was very pleased to have a Vox organ, the same kind that the Animals and the Dave Clark Five used.\n\nBut they needed a guitarist and a bass player. Manzarek claimed in his autobiography that he was thinking along the lines of a four-piece group even before he met Densmore, and that his thoughts had been \"Someone has to be Thumper and someone has to be Les Paul/Chuck Berry by way of Charlie Christian. The guitar player will be a rocker who knows jazz. And the drummer will be a jazzer who can rock. These were my prerequisites. This is what I had to have to make the music I heard in my head.\"\nBut whatever Manzarek was thinking, there were only two people who auditioned for the role of the guitar player in this new version of the band, both of them friends of Densmore, and in fact two people who had been best friends since high school -- Bill Wolff and Robby Krieger.\n\nWolff and Krieger had both gone to private boarding school -- they had both originally gone to normal state schools, but their parents had independently decided they were bad influences on each other and sent them away to boarding school to get away from each other, but accidentally sent them to the same school -- and had also learned guitar together. They had both loved a record of flamenco guitar called Dos Flamencos by Jaime Grifo and Nino Marvino:\n\n[Excerpt: Jaime Grifo and Nino Marvino, \"Caracolés\"]\n\nAnd they'd decided they were going to become the new Dos Flamencos. They'd also regularly sneaked out of school to go and see a jug band called Mother McCree's Uptown Jug Champions, a band which featured Bob Weir, who was also at their school, along with Jerry Garcia and Pigpen McKernan.\nKrieger was also a big fan of folk and blues music, especially bluesy folk-revivalists like Spider John Koerner, and was a massive fan of the Paul Butterfield Blues Band. Krieger and Densmore had known each other before Krieger had been transferred to boarding school, and had met back up at university, where they would hang out together and go to see Charles Mingus, Wes Montgomery, and other jazz musicians.\n\nAt this time Krieger had still been a folk and blues purist, but then he went to see Chuck Berry live, mostly because Skip James and Big Mama Thornton were also on the bill, and he had a Damascene conversion -- the next day he went to a music shop and traded in his acoustic for a red Gibson, as close to the one Chuck Berry played as he could find.\n\nWolff, Densmore, Krieger, and piano player Grant Johnson had formed a band called the Psychedelic Rangers, and when the Ravens were looking for a new guitarist, it was natural that they tried the two guitarists from Densmore's other band. Krieger had the advantage over Wolff for two reasons -- one of which was actually partly Wolff's doing. To quote Krieger's autobiography: \"A critic once said I had 'the worst hair in rock 'n' roll'. It stung pretty bad, but I can't say they were wrong. I always battled with my naturally frizzy, kinky, Jewfro, so one day my friend Bill Wolff and I experimented with Ultra Sheen, a hair relaxer marketed mainly to Black consumers. The results were remarkable. Wolff, as we all called him, said 'You're starting to look like that jerk Bryan MacLean'\".\n\nAccording to Krieger, his new hairdo made him better looking than Wolff, at least until the straightener wore off, and this was one of the two things that made the group choose him over Wolff, who was a better technical player. The other was that Krieger played with a bottleneck, which astonished the other members.\n\nIf you're unfamiliar with bottleneck playing, it's a common technique in the blues. You tune your guitar to an open chord, and then use a resonant tube -- these days usually a specially-made metal slide that goes on your finger, but for older blues musicians often an actual neck of a bottle, broken off and filed down -- to slide across the strings. Slide guitar is one of the most important styles in blues, especially electric blues, and you can hear it in the playing of greats like Elmore James:\n\n[Excerpt: Elmore James, \"Dust My Broom\"]\n\nBut while the members of the group all claimed to be blues fans -- Manzarek talks in his autobiography about going to see Muddy Waters in a club in the South Side of Chicago where he and his friends were the only white faces in the audience -- none of them had any idea what bottleneck playing was, and Manzarek was worried when Krieger pulled it out that he was going to use it as a weapon, that being the only association he had with bottle necks. But once Krieger played with it, they were all convinced he had to be their guitarist, and Morrison said he wanted that sound on everything.\n\nKrieger joining seems to have changed the dynamic of the band enormously. Both Morrison and Densmore would independently refer to Krieger as their best friend in the band -- Manzarek said that having a best friend was a childish idea and he didn't have one. But where before this had been Manzarek's band with Morrison as the singer, it quickly became a band centred around the creative collaboration between Krieger and Morrison. Krieger seems to have been too likeable for Manzarek to dislike him, and indeed seems to have been the peacemaker in the band on many occasions, but Manzarek soon grew to resent Densmore, seemingly as the closeness he had felt to Morrison started to diminish, especially after Morrison moved out of Manzarek's house, apparently because Manzarek was starting to remind him of his father.\n\nThe group soon changed their name from the Ravens to one inspired by Morrison's reading. Aldous Huxley's book on psychedelic drugs had been titled The Doors of Perception, and that title had in turn come from a quote from The Marriage of Heaven and Hell by the great mystic poet and artist William Blake, who had written \"If the doors of perception were cleansed every thing would appear to man as it is, Infinite. For man has closed himself up, till he sees all things thro' narrow chinks of his cavern\"\n(Incidentally, in one of those weird coincidences that I like to note when they come up, Blake's Marriage of Heaven and Hell had also inspired the book The Great Divorce by C.S. Lewis, about the divorce of heaven and hell, and both Lewis and Huxley died on the same date, the twenty-second of November 1963, the same day John F. Kennedy died).\n\nMorrison decided that he wanted to rename the group The Doors, although none of the other group members were particularly keen on the idea -- Krieger said that he thought they should name the group Perception instead.\n\nInitially the group rehearsed only songs written by Morrison, along with a few cover versions. They worked up a version of Willie Dixon's \"Back Door Man\", originally recorded by Howlin' Wolf:\n\n[Excerpt: Howlin' Wolf, \"Back Door Man\"]\n\nAnd a version of \"Alabama Song\", a song written by Bertholt Brecht and Kurt Weill, from the opera The Rise and Fall of the City of Mahagonny, with English language lyrics by  Elisabeth Hauptmann. That song had originally been recorded by Lotte Lenya, and it was her version that the group based their version on, at the suggestion of Manzarek's girlfriend:\n\n[Excerpt: Lotte Lenya, \"Alabama Song\"]\n\nThough it's likely given their tastes in jazz that they were also aware of a recent recording of the song by Eric Dolphy and John Lewis:\n\n[Excerpt: Eric Dolphy and John Lewis, \"Alabama Song\"]\n\nBut Morrison started to get a little dissatisfied with the fact that he was writing all the group's original material at this point, and he started to put pressure on the others to bring in songs. One of the first things they had agreed was that all band members would get equal credit and shares of the songwriting, so that nobody would have an incentive to push their own mediocre song at the expense of someone else's great one, but Morrison did want the others to start pulling their weight.\n\nAs it would turn out, for the most part Manzarek and Densmore wouldn't bring in many song ideas, but Krieger would, and the first one he brought in would be the song that would make them into stars.\nThe song Krieger brought in was one he called \"Light My Fire\", and at this point it only had one verse and a chorus. According to Manzarek, Densmore made fun of the song when it was initially brought in, saying \"we're not a folk-rock band\" and suggesting that Krieger might try selling it to the Mamas and the Papas, but the other band members liked it -- but it's important to remember here that Manzarek and Densmore had huge grudges against each other for most of their lives, and that Manzarek is not generally known as an entirely reliable narrator.\n\nNow, I'm going to talk a lot about the influences that have been acknowledged for this song, but before I do there's one that I haven't seen mentioned much but which seems to me to be very likely to have at least been a subconscious influence -- \"She's Not There\" by the Zombies:\n\n[Excerpt: The Zombies, \"She's Not There\"]\n\nNow, there are several similarities to note about the Zombies record. First, like the Doors, the Zombies were a keyboard-driven band. Second, there's the dynamics of the songs -- both have soft, slightly jazzy verses and then a more straight-ahead rock chorus. And finally there's the verse chord sequence. The verse for \"She's Not There\" goes from Am to D repeatedly:\n\n[demonstrates]\n\nWhile the verse for \"Light My Fire\" goes from Am to F sharp minor -- and for those who don't know, the notes in a D chord are D, F sharp, and A, while the notes in an F sharp minor chord are F sharp, A, and C sharp -- they're very similar chords. So \"She's Not There\" is:\n\n[demonstrates]\n\nWhile \"Light My Fire\" is:\n\n[demonstrates]\n\nAt least, that's what Manzarek plays. According to Krieger, he played an Asus2 chord rather than an A minor chord, but Manzarek heard it as an A minor and played that instead.\n\nNow again, I've not seen anyone acknowledge \"She's Not There\" as an influence, but given the other influences that they do acknowledge, and the music that was generally in the air at the time, it would not surprise me even the smallest amount if it was.\n\nBut either way, what Krieger brought in was a simple verse and chorus:\n\n[Excerpt: The Doors, \"Light My Fire\"]\n\nIncidentally, I've been talking about the song as having A minor chords, but you'll actually hear the song in two different keys during this episode, even though it's the same performance throughout, and sometimes it might not sound right to people familiar with a particular version of the record. The band played the song with the verse starting with A minor, and that's how the mono single mix was released, and I'll be using excerpts of that in general.\n\nBut when the stereo version of the album was released, which had a longer instrumental break, the track was mastered about a semitone too slow, and that's what I'll be excerpting when talking about the solos -- and apparently that speed discrepancy has been fixed in more recent remasterings of the album than the one I'm using. So if you know the song and bits of what I play sound odd to you, that's why.\n\nKrieger didn't have a second verse, and so writing the second verse's lyrics was the next challenge. There was apparently some disagreement within the band about the lyrics that Morrison came up with, with their references to funeral pyres, but Morrison won the day, insisting that the song needed some darkness to go with the light of the first verse. Both verses would get repeated at the end of the song, in reverse order, rather than anyone writing a third or fourth verse. Morrison also changed the last line of the chorus -- in Krieger's original version, he'd sung \"Come on baby, light my fire\" three times, but Morrison changed the last line to \"try to set the night on fire\", which Krieger thought was a definite improvement.\n\nThey then came up with an extended instrumental section for the band members to solo in. This was inspired by John Coltrane, though I have seen different people make different claims as to which particular Coltrane record it was inspired by. Many sources, including Krieger, say it was based on Coltrane's famous version of \"My Favorite Things\":\n\n[Excerpt: John Coltrane, \"My Favorite Things\"]\n\nBut Manzarek in his autobiography says it was inspired by Ole, the track that Coltrane recorded with Eric Dolphy:\n\n[Excerpt: John Coltrane, \"Ole\"]\n\nBoth are of course similar musical ideas, and either could have inspired the “Light My Fire” instrumental section, though none of the Doors are anything like as good or inventive on their instruments as Coltrane's group (and of course \"Light My Fire\" is in four-four rather than three-four):\n\n[Excerpt: The Doors, \"Light My Fire\"]\n\nSo they had a basic verse-chorus song with a long instrumental jam session in the middle. Now comes the bit that there's some dispute over.  Both Ray Manzarek and Robby Krieger agree that Manzarek came up with the melody used in the intro, but differ wildly over who came up with the chord sequence for it and when, and how it was put into the song. According to Manzarek, he came up with the whole thing as an intro for the song at that first rehearsal of it, and instructed the other band members what to do. According to Krieger, though, the story is rather different, and the evidence seems to be weighted in Krieger's favour.\n\nIn early live performances of the song, they started the song with the Am-F sharp minor shifts that were used in the verse itself, and continued doing this even after the song was recorded:\n\n[Excerpt: The Doors, \"Light My Fire (live at the Matrix)\"]\n\nBut they needed a way to get back out of the solo section and into the third verse. To do this, Krieger came up with a sequence that starts with a change from G to D, then from D to F, before going into a circle of fifths -- not the ascending circle of fifths in songs like \"Hey Joe\", but a descending one, the same sequence as in \"She Came in Through the Bathroom Window\" or \"I Will Survive\", ending on an A flat:\n\n[demonstrates]\n\nTo get from the A flat to the A minor or Asus2 chord on which the verse starts, he simply then shifted up a semitone from A flat to A major for two bars:\n\n[demonstrates]\n\nOver the top of that chord sequence that Krieger had come up with, Manzarek put a melody line which was inspired by one of Bach's two-part inventions. The one that's commonly cited is Invention No. 8 in F Major, BWV 779:\n\n[Excerpt: Glenn Gould, \"Invention No. 8 in F Major, BWV 779\"]\n\nThough I don't believe Manzarek has ever stated directly which piece he was inspired by other than that it was one of the two-part inventions, and to be honest none of them sound very much like what he plays to my ears, and I think more than anything he was just going for a generalised baroque style rather than anything more specific. And there are certainly stylistic things in there that are suggestive of the baroque -- the stepwise movement, the sort of skipping triplets, and so on:\n\n[Excerpt: The Doors, \"Light My Fire\"]\n\nBut that was just to get out of the solo section and back into the verses. It was only when they finally took the song into the studio that Paul Rothchild, the producer who we will talk about more later, came up with the idea of giving the song more structure by both starting and ending with that sequence, and formalised it so that rather than just general noodling it was an integral part of the song.\n\nThey now had at least one song that they thought had the potential to be a big hit. The problem was that they had not as yet played any gigs, and nor did they have a record deal, or a bass player.\n\nThe lack of a record deal may sound surprising, but they were dropped by Columbia before ever recording for them. There are several different stories as to why. One biography I've read says that after they were signed, none of the label's staff producers wanted to work with them and so they were dropped -- though that goes against some of the other things I've read, which say that Terry Melcher was interested in producing them.\n\nOther sources say that Morrison went in for a meeting with some of the company executives while on acid, came out very pleased with himself at how well he'd talked to them because he'd been able to control their minds with his telepathic powers, and they were dropped shortly afterwards. And others say that they were dropped as part of a larger set of cutbacks the company was making, and that while Billy James fought to keep them at Columbia, he lost the fight.\n\nEither way, they were stuck without a deal, and without any proper gigs, though they started picking up the odd private party here and there -- Krieger's father was a wealthy aerospace engineer who did some work for Howard Hughes among others, and he got his son's group booked to play a set of jazz standards at a corporate event for Hughes, and they got a few more gigs of that nature, though the Hughes gig didn't exactly go well -- Manzarek was on acid, Krieger and Morrison were on speed, and the bass player they brought in for the gig managed to break two strings, something that would require an almost superhuman effort.\n\nThat bass player didn't last long, and nor did the next -- they tried several, but found that the addition of a bass player made them sound less interesting, more like the Animals or the Rolling Stones than a group with their own character. But they needed something to hold down the low part, and it couldn't be Manzarek on the organ, as the Vox organ had a muddy sound when he tried to play too many notes at once. But that problem solved itself when they played one of their earliest gigs. There, Manzarek found that another band, who were regulars at the club, had left their Fender keyboard bass there, clipped to the top of the piano.\n\nManzarek tried playing that, and found he could play basslines on that with his left hand and the main parts with his right hand. Krieger got his father to buy one for the group -- though Manzarek was upset that they bought the wrong colour -- and they were now able to perform without a bass player. Not only that, but it gave the group a distinctive sound quite unlike all the other bands. Manzarek couldn't play busy bass lines while also playing lead lines with his right hand, and so he ended up going for simple lines without a great deal of movement, which added to the hypnotic feel of the group's music – though on records they would often be supplemented by a session bass player to give them a fuller sound.\nWhile the group were still trying to get a record deal, they were also looking for regular gigs, and eventually they found one. The Sunset Strip was *the* place to be, and they wanted desperately to play one of the popular venues there like the Whisky A-Go-Go, but those venues only employed bands who already had record deals.\n\nThey did, though, manage to get a residency at a tiny, unpopular, club on the strip called The London Fog, and they played there, often to only a handful of people, while slowly building in confidence as performers. At first, Morrison was so shy that Manzarek had to sing harmony with him throughout the sets, acting as joint frontman. Krieger later said \"It's rarely talked about, but Ray was a natural born showman, and his knack for stirring drama would serve the Doors' legacy well in later years\"\nBut Morrison soon gained enough confidence to sing by himself. But they weren't bringing in any customers, and the London Fog told them that they were soon going to be dropped -- and the club itself shut not long after. But luckily for the group, just before the end of their booking, the booker for the Whisky A-Go-Go, Ronnie Haran walked in with a genuine pop star, Peter Asher, who as half of Peter & Gordon had had a hit with \"A World Without Love\", written by his sister's boyfriend, Paul McCartney:\n\n[Excerpt: Peter and Gordon, \"A World Without Love\"]\n\nHaran was impressed with the group, and they were impressed that she had brought in a real celebrity. She offered them a residency at the club, not as the headlining act -- that would always be a group that had records out -- but as the consistent support act for whichever big act they had booked.\n\nThe group agreed -- after Morrison first tried to play it cool and told Haran they would have to consider it, to the consternation of his bandmates.\n\nThey were thrilled, though, to discover that one of the first acts they supported at the Whisky would be Them, Van Morrison's group -- one of the cover versions they had been playing had been Them's \"Gloria\":\n\n[Excerpt: Them, \"Gloria\"]\n\nThey supported Them for two weeks at the Whisky, and Jim Morrison watched Van Morrison intently. The two men had very similar personalities according to the other members of the Doors, and Morrison picked up a lot of his performing style from watching Van on stage every night. The last night Them played the venue, Morrison joined them on stage for an extended version of “Gloria” which everyone involved remembered as the highlight of their time there.\n\nEvery major band on the LA scene played residencies at the Whisky, and over the summer of 1966 the Doors were the support act for the Mothers of Invention, the Byrds, the Turtles, the Buffalo Springfield, and Captain Beefheart and the Magic Band. This was a time when the Sunset Strip was the centre of Californian musical life, before that centre moved to San Francisco, and the Doors were right at the heart of it. Though it wasn't all great -- this was also the period when there were a series of riots around Sunset Strip, as immortalised in the American International Pictures film Riot on Sunset Strip, and its theme song, by the Standells:\n\n[Excerpt: The Standells, \"Riot on Sunset Strip\"]\n\nWe'll look at those riots in more detail in a future episode, so I'll leave discussing them for now, but I just wanted to make sure they got mentioned.\n\nThat Standells song, incidentally, was co-written by John Fleck, who under his old name of John Fleckenstein we saw last episode as the original bass player for Love. And it was Love who ensured that the Doors finally got the record deal they needed.\n\nThe deal came at a perfect time for the Doors -- just like when they'd been picked up by the Whisky A Go-Go just as they were about to lose their job at the London Fog, so they got signed to a record deal just as they were about to lose their job at the Whisky. They lost that job because of a new song that Krieger and Morrison had written.\n\n\"The End\" had started out as Krieger's attempt at writing a raga in the style of Ravi Shankar, and he had brought it in to one of his increasingly frequent writing sessions with Morrison, where the two of them would work out songs without the rest of the band, and Morrison had added lyrics to it. Lyrics that were partly inspired by his own fraught relationship with his parents, and partly by Oedipus Rex:\n\n[Excerpt: The Doors, \"The End\"]\n\nAnd in the live performance, Morrison had finished that phrase with the appropriate four-letter Oedipal payoff, much to the dismay of the owners of the Whisky A Go Go, who had told the group they would no longer be performing there.\n\nBut three days before that, the group had signed a deal with Elektra Records. Elektra had for a long time been a folk specialist label, but they had recently branched out into other music, first with the Paul Butterfield Blues Band, a favourite of Robby Krieger's, and then with their first real rock signing, Love.\n\nAnd Love were playing a residency at the Whisky A Go Go, and Arthur Lee had encouraged Jac Holzman, the label's owner, to come and check out their support band, who he thought were definitely worth signing. The first time Holzman saw them he was unimpressed -- they sounded to him just like a bunch of other white blues bands -- but he trusted Arthur Lee's judgement and came back a couple more times. The third time, they performed their version of \"Alabama Song\", and everything clicked into place for Holzman. He immediately signed the group to a three-album deal with an option to extend it to seven. The group were thrilled -- Elektra wasn't a major label like Columbia, but they were a label that nurtured artists and wouldn't just toss them aside.\n\nThey were even happier when soon after they signed to Elektra, the label signed up a new head of West Coast A&R -- Billy James, the man who had signed them to Columbia, and who they knew would be in their corner.\n\nJac Holzman also had the perfect producer for the group, though he needed a little persuading. Paul Rothchild had made his name as the producer for the first couple of albums by the Paul Butterfield Blues Band:\n\n[Excerpt: The Paul Butterfield Blues Band, \"Mary Mary\"]\n\nThey were Robby Krieger's favourite group, so it made sense to have Rothchild on that level. And while Rothchild had mostly worked in New York, he was in LA that summer, working on the debut album by another Elektra signing, Tim Buckley. The musicians on Buckley's album were almost all part of the same LA scene that the Doors were part of -- other than Buckley's normal guitarist Lee Underwood there was keyboard player Van Dyke Parks, bass player Jim Fielder, who had had a brief stint in the Mothers of Invention and was about to join Buffalo Springfield, and drummer Billy Mundi, who was about to join the Mothers of Invention. And Buckley himself sang in a crooning voice extremely similar to that of Morrison, though Buckley had a much larger range:\n\n[Excerpt: Tim Buckley, \"Aren't You the Girl?\"]\n\nThere was one problem, though -- Rothchild didn't want to do it. He wasn't at all impressed with the band at first, and he wanted to sign a different band, managed by Albert Grossman, instead. But Holzman persuaded him because Rothchild owed him a favour -- Rothchild had just spent several months in prison after a drug bust, and while he was inside Holzman had given his wife a job so she would have an income, and Holzman also did all the paperwork with Rothchild's parole officer to allow him to leave the state. So with great reluctance Rothchild took the job, though he soon came to appreciate the group's music.\n\nHe didn't appreciate their second session though. The first day, they'd tried recording a version of \"The End\", but it hadn't worked, so on the second night they tried recording it again, but this time Morrison was on acid and behaving rather oddly. The final version of \"The End\" had to be cut together from two takes, and the reason is that at the point we heard earlier:\n\n[Excerpt: The Doors, \"The End\"]\n\nMorrison was whirling around, thrashing about, and knocked over a TV that the engineer, Bruce Botnick, had brought into the studio so he could watch the baseball game -- which Manzarek later exaggerated to Morrison throwing the TV through the plate glass window between the studio and the control room. According to everyone else, Morrison just knocked it over and they picked it up after the take finished and it still worked fine.\n\nBut Morrison had taken a *lot* of acid, and on the way home after the session he became convinced that he had a psychic knowledge that the studio was on fire. He got his girlfriend to turn the car back around, drove back to the studio, climbed over the fence, saw the glowing red lightbulbs in the studio, became convinced that they were fires, and sprayed the entire place with the fire extinguisher, before leaving convinced he had saved the band's equipment -- and leaving telltale evidence as his boot got stuck in the fence on the way out and he just left it there.\n\nBut despite that little hiccup, the sessions generally went well, and the group and label were pleased with the results. The first single released from the album, \"Break on Through\", didn't make the Hot One Hundred:\n\n[Excerpt: The Doors, \"Break on Through\"]\n\nBut when the album came out in January 1967, Elektra put all its resources behind the album, and it started to get a bit of airplay as a result. In particular, one DJ on the new FM radio started playing \"Light My Fire\" -- at this time, FM had only just started, and while AM radio stuck to three-minute singles for the most part, FM stations would play a wider variety of music.\n\nSome of the AM DJs started telling Elektra that they would play the record, too, if it was the length of a normal single, and so Rothchild and Botnick went into the studio and edited the track down to half its previous seven-and-a-half-minute length.\n\nWhen the group were called in to hear the edit, they were initially quite excited to hear what kind of clever editing microsurgery had been done to bring the song down to the required length, but they were horrified when Rothchild actually played it for them. As far as the group were concerned, the heart of the song was the extended instrumental improvisation that took up the middle section:\n\n[Excerpt: The Doors, \"Light My Fire\"]\n\nOn the album version, that lasted over three minutes. Rothchild and Botnick cut that section down to just this:\n\n[Excerpt: The Doors, \"Light My Fire (single edit)\"]\n\nThe group were mortified -- what had been done to their song? That wasn't the sound of people trying to be McCoy Tyner and Elvin Jones, it was just... a pop song.  Rothchild explained that that was the point -- to get the song played on AM radio and get the group a hit. He pointed out how the Beatles records never had an instrumental section that lasted more than eight bars, and the group eventually talked themselves round. After all, wasn't this really more subversive? You get the kids hooked with the pop single, and then they buy the album and the track is a whole other thing! It would blow the kids' minds!\n\nSo they eventually agreed to let the track go out like that, and it made number one on the charts:\n\n[Excerpt: The Doors, \"Light My Fire\"]\n\nThe Doors were now a major success, and they even got a slot on the Ed Sullivan Show, though that went badly for them. They were asked to not use the line \"We couldn't get much higher\", because of the drug reference, and they agreed, but then Morrison either forgot in the excitement or deliberately ignored the request depending on who you ask. According to Manzarek this led to a massive confrontation with the producers after the show, though Krieger denies any confrontation happened and says \"The way Ray told stories, I'm surprised his version didn't end with us strutting in slow motion down Broadway while the CBS studios exploded in the background\".\n\nWhatever the truth, they weren't invited back on the Ed Sullivan Show again, but that didn't matter -- the Doors had had their first number one hit, they had a charismatic lead singer, and they were about to put out their second album.\n\nBut as we'll see the next time we look at the Doors, what you find when you can't get much higher is that the only way to go is down.",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and forty-eight of A History of Rock Music in Five Hundred Songs looks at “Light My Fire\" by the Doors, the history of cool jazz, and Maharishi Mahesh Yogi. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"My Friend Jack\" by the Smoke.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, I’ve put together a Mixcloud mix containing all the music excerpted in this episode and the shorter spoken-word tracks.\n\nInformation on Dick Bock, World Pacific, and Ravi Shankar came from Indian Sun: The Life and Music of Ravi Shankar by Oliver Craske.\n\nRay Manzarek, John Densmore, and Robby Krieger have all released autobiographies. Densmore's is out of print, but I referred to Manzarek's and Krieger's here. Of the two Krieger's is vastly more reliable. I also used Mick Wall's book on the Doors and Stephen Davis' biography of Jim Morrison.\n\nInformation about Elektra Records came from Follow the Music by Jac Holzman and Gavan Daws, which is available as a free PDF download on Elektra's website.\n\nBiographical information on Maharishi Mahesh Yogi comes from this book, written by one of his followers.\n\nThe Doors' complete studio albums can be bought as MP3s for £14.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\nThere are two big problems that arise for anyone trying to get an accurate picture of history, and which have certainly arisen for me during the course of this podcast -- things which make sources unreliable enough that you feel you have to caveat everything you say on a subject. One of those is hagiography, and the converse desire to tear heroes down. No matter what one wants to say on, say, the subjects of Jesus or Mohammed or Joseph Smith, the only sources we have for their lives are written either by people who want to present them as unblemished paragons of virtue, or by people who want to destroy that portrayal -- we know that any source is written by someone with a bias, and it might be a bias we agree with, but it's still a bias.\n\nThe other, related, problem, is deliberate disinformation. This comes up especially for people dealing with military history -- during conflicts, governments obviously don't want their opponents to know when their attacks have caused damage, or to know what their own plans are, and after a war has concluded the belligerent parties want to cover up their own mistakes and war crimes. We're sadly seeing that at the moment in the situation in Ukraine -- depending on one's media diet, one could get radically different ideas of what is actually going on in that terrible conflict.\n\nBut it happens all the time, in all wars, and on all sides. Take the Vietnam War. While the US was involved on the side of the South Vietnamese government from the start of that conflict, it was in a very minor way, mostly just providing supplies and training. Most historians look at the real start of US involvement in that war as having been in August 1964. President Johnson had been wanting, since assuming the Presidency in November 1963 after the death of John F Kennedy, to get further into the war, but had needed an excuse to do so. The Gulf of Tonkin Incident provided him with that excuse.\nOn August the second, a fleet of US warships entered into what the North Vietnamese considered their territorial waters -- they used a different distance from shore to mark their territorial waters than most other countries used, and one which wasn't generally accepted, but which they considered important. Because of this, some North Vietnamese ships started following the American ones. The American ships, who thought they weren't doing anything w",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and forty-eight of A History of Rock Music in Five Hundred Songs looks at “Light My Fire\" by the Doors, the history of cool jazz, and Maharishi Mahesh Yogi. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"My Friend Jack\" by the Smoke.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, I’ve put together a Mixcloud mix containing all the music excerpted in this episode and the shorter spoken-word tracks.\n\nInformation on Dick Bock, World Pacific, and Ravi Shankar came from Indian Sun: The Life and Music of Ravi Shankar by Oliver Craske.\n\nRay Manzarek, John Densmore, and Robby Krieger have all released autobiographies. Densmore's is out of print, but I referr",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}