{
  "id": "yt:video:k0pu0yY3efc",
  "yt:videoId": "k0pu0yY3efc",
  "yt:channelId": "UC510QYlOlKNyhy_zdQxnGYw",
  "title": "Paranormal 'Encounters' from World War I",
  "link": "",
  "author": {
    "name": "Simple History",
    "uri": "https://www.youtube.com/channel/UC510QYlOlKNyhy_zdQxnGYw"
  },
  "published": "2022-10-29T18:08:05+00:00",
  "updated": "2022-11-04T20:21:54+00:00",
  "media:group": {
    "media:title": "Paranormal 'Encounters' from World War I",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "2nd Channel: https://www.youtube.com/channel/UCPdc6bs3I8s6Y4QE_3g3MZw\nBecome a Simple History member: https://www.youtube.com/simplehistory/join\nSupport us on Patreon: https://www.patreon.com/simplehistory\n\nYou watch as your candlestick shrinks. You sit huddled in a corner of a muddy hole your superiors call a trench, and clasp your hands over the finger-sized fire. It only heats the front of your hands, but you still savour every second of its warmth. After a short while, you feel the biting cold return, as a thin coil of smoke rises from your candlestick. Images of your late friend return as fast as the light had extinguished. The noise that smashed your eardrums. The chunk of your friend’s head that blew off by the shrapnel. You wish it happened to you instead. You wish they were the one sitting in the trench. To your left, a glow appears that makes you turn. A silhouette of your friend sits next to you. Blood streams from the side of their head but they do not look at you. Instead, they are pointing to a wall at the end of the trench, eyes not blinking. What do you do?\n\nCopyright: DO NOT translate and re-upload our content on Youtube or other social media.\n\nSIMPLE HISTORY MERCHANDISE \n\nGet the Simple History books on Amazon: \n\nhttps://www.amazon.com/Daniel-Turner-%60/e/B00H5TYLAE/\n\nT-Shirts\n\nhttps://teespring.com/stores/simple-history-official-merch\n\nSimple history gives you the facts, simple!\n\nSee the book collection here:\n\nAmazon USA\n\nhttp://www.amazon.com/Daniel-Turner/e/B00H5TYLAE/\n\n\nAmazon UK\nhttp://www.amazon.co.uk/Daniel-Turner/e/B00H5TYLAE/\n\n\nhttps://www.facebook.com/Simple-History-549437675141192/\n\nhttps://twitter.com/SimpleHistoryYT\n\n\nCredit:\nCreated by Daniel Turner (B.A. (Hons) in History, University College London)\n\nScript:\n\nLuke Ursone\n\nNarrator:\n\nJared Sager\n\nBibliography\n\nBeaman, Ardern Arthur Hume. The Squadroon. New York: John Lane Company, 1920.\n\nDoyle, Arthur Conan. The History Of Spiritualism: Vol 2. London: Cassell and Company Ltd, 1926.\n\nFussell, Paul. The Great War and Modern Memory. Oxford: Oxford University Press, 1975.\n\nGross, Patrick. 'Spring 1917, Western Belgium, Belgique, Manfred von Richtofen and Peter Waitzrick.' ufologie, March 14, 2013.\n\nHemmings, Jay. “WWI and the Paranormal: Spooky Tales from the Trenches.” warhistoryonline, September 27, 2019.\n\nLeese, Peter. Shell Shock: Traumatic Neurosis and the British Soldiers of the First World War. Basingstoke: Palgrave Macmillan, 2014.\n\n“The Lady Sopwith Mystery.” Futurism. Accessed October 6, 2022.\n\nMagazine, Smithsonian. “The Legend of What Actually Lived in the ‘No Man's Land’ between World War I's Trenches.” Smithsonian.com. Smithsonian Institution, September 8, 2014.\n\nPearson's Magazine, Volume 48. Minnesota: C. Arthur Pearson Limited, 1919.\n\nRuickbie, Leo. Spiritualism, Superstition and the Supernatural during the First World War. London: Robinson, 2018.\n\nSiegphyl. “The Truth behind the ‘Russian Rumor’ of Mythical WWI Cossacks.” warhistoryonline, March 1, 2014.\n\nWatson, Nigel. UFOs of the First World War: Phantom Airships, Balloons, Aircraft and Other Mysterious Aerial Phenomena. Stroud: The History Press, 2015.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}