{
  "title": "Flipping the SCRIPT: Anwar seeks to repair his nation in postnormal times",
  "link": "https://www.newmandala.org/flipping-the-script-anwar-seeks-to-repair-his-nation-in-postnormal-times/",
  "dc:creator": "Amrita Malhi",
  "pubDate": "Fri, 21 Oct 2022 04:35:01 +0000",
  "category": [
    "Anwar Ibrahim",
    "Elections",
    "Malaysia",
    "Politics",
    "Social reforms"
  ],
  "guid": "https://www.newmandala.org/?p=60076",
  "description": "<p>The opposition leader's new book is a pitch to lead Malaysians as they set out together to repair their social fabric.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.newmandala.org/flipping-the-script-anwar-seeks-to-repair-his-nation-in-postnormal-times/\">Flipping the SCRIPT: Anwar seeks to repair his nation in postnormal times</a> appeared first on <a rel=\"nofollow\" href=\"https://www.newmandala.org\">New Mandala</a>.</p>\n",
  "content:encoded": "<p>It’s on – Malaysia’s Election Commission has announced that the nation will go to the polls on Saturday 19 November.</p>\n<p>Knowing the date feels like a relief. For weeks and months now, Malaysians have been steering their way through the usual pre-election fog of media and analyst hyper-speculation about dates, coalitions, and tactics. They have largely responded with pessimism and disenchantment—as they tire of the politicking while they slog through tough economic conditions.</p>\n<p>In the weeks to come, parties and candidates will announce what seats they are standing in and which coalitions they will form or join. Trying to the follow the daily play-by-play will likely get complicated and I hear from Australian media sources that their audiences get sick of it. That’s fair enough – an excess of tactical commentary is a serious barrier to informed understandings of regional politics.</p>\n<p>So, to observe some of the deeper stakes involved in this election, look to the actions of one of the key contenders in this campaign—opposition leader Anwar Ibrahim.</p>\n<p>If the 178-page book he recently launched is any guide. Anwar is betting that there will be a battle of ideas in this election campaign, despite the government likely hoping that its recent Budget will shore up its own pitch to voters, who it expects to stay home instead of turning out to vote.</p>\n<p>In any case, surely the book is too lengthy to be chopped up into small, media-friendly pieces and socialised quickly enough to make an Anwar-led coalition both coherent and competitive?</p>\n<p>Called <em><a href=\"https://ideselangor.com/v2/2022/10/03/script-for-a-better-malaysia-by-anwar-ibrahim/\">SCRIPT For a Better Malaysia</a></em>, the book does not purport to be a policy manifesto, but rather a “wholistic vision and policy framework for a viable, dynamic, and inclusive Malaysian future.”</p>\n<p>Drawing on decades of Anwar’s thinking as an activist, intellectual, and politician, the book cites influences such as <a href=\"https://www.merdekaaward.my/the-award/past-recipients/education-community/royal-professor-ungku-abdul-aziz-bin-ungku-abdul-h\">Ungku Aziz</a>, <a href=\"https://www.arjunappadurai.org/\">Arjun Appadurai</a>, <a href=\"https://www.gerakbudaya.com/syed-hussein-alatas\">Syed Hussein Alatas</a>, <a href=\"https://www.theguardian.com/education/2017/jan/15/zygmunt-bauman-obituary\">Zygmunt Bauman</a>, <a href=\"https://www.ksjomo.org/\">Jomo Kwame Sundaram</a>, <a href=\"https://asialink.unimelb.edu.au/about-us/leadership-team/professor-tony-milner-am\">Anthony Milner</a>, and <a href=\"https://ziauddinsardar.com/\">Ziauddin Sardar</a> – once Anwar’s education adviser.</p>\n<p>The book is organised around several themes matched to the SCRIPT acronym – Sustainability, Care and Compassion, Respect, Innovation, Prosperity, and Trust. It was written in collaboration with <a href=\"https://postnormaltim.es/what-postnormal-times\">The Centre for Postnormal Policy and Futures Studies</a> – the consultancy Sardar now leads and whose focus is to promote “futures literacy,” with a focus on “marginalised peoples and Muslim societies.”</p>\n<p>One of the key arguments the book makes is that Malaysians—Muslim and non-Muslim—must come together to imagine radical new futures, now more than ever as these are “postnormal times.”</p>\n<p>Sardar, paraphrasing <a href=\"https://books.google.com.au/books/about/Prison_Notebooks.html?id=h0qi9N_9ilUC&redir_esc=y\">Gramsci’s <em>Prison Notebooks</em></a>, describes these times as an “in-between period where old orthodoxies are dying, new ones have not yet emerged, and nothing really makes sense.”</p>\n<p>In the Malaysian context, the Gramscian “morbid symptoms” that make this condition clear include “mismanagement, corruption, cronyism, … divisions, and squabbling.” According to Anwar, Malaysian political leaders who display these symptoms are entirely unfit to address the challenges of an “accelerating, globalised, networked world, steeped in contradictions, complexity, and chaos.”</p>\n<p>Anwar’s book has the flavour of a genre of crisis writing popularised by another author it cites: Nassim Nicholas Taleb. Taleb’s <em><a href=\"https://www.goodreads.com/book/show/13530973-antifragile\">Antifragile</a></em> prescribed not only strength training, including heavy deadlifts; but also, a series of personal and political attitude adjustments as measures to build resilience in what is arguably a new phase of history characterised by endless, rolling crises.</p>\n<p>It also echoes a more recent term – “<a href=\"https://cascadeinstitute.org/technical-paper/what-is-a-global-polycrisis/\">polycrisis,</a>” – recently made famous by economic <a href=\"https://www.theatlantic.com/ideas/archive/2022/07/adam-tooze-chartbook-substack-newsletter-inflation-crisis/661467/\">historian Adam Tooze</a> to describe a situation of multiple crises, “where the whole is even more dangerous than the sum of its parts.”</p>\n<p>Accordingly, it speaks of floods, climate change, the pandemic, rural debt, poverty and inequality, disrespect, a closed political culture, and an education system focused on issues like <a href=\"https://www.malaysianow.com/news/2021/10/27/radzi-visits-kl-school-over-claims-of-period-spot-checks?)\">period spot checks</a> and not on fostering qualities such as care, compassion, or innovation. It also raises issues like automation, robots, and, astutely, racist AI – exactly the kind of high-tech innovation a racially striated society like Malaysia could do without. <em class=\"help-text\">\n\t<div class=\"post alignleft\">\n\t\t<div class=\"post-image\">\n\t\t\t<span class=\"post-label\">\n\t\t\t\tRelated\t\t\t</span>\n\t\t\t\n\t\t\t\t\t\t\t<a href=\"https://www.newmandala.org/malaysia-the-new-political-normal-for-now/\">\n\t\t\t\t\t<img width=\"236\" height=\"184\" src=\"http://www.newmandala.org/wp-content/uploads/cache/2021/08/Kuala_Lumpur_Malaysia_Bangunan_Parlimen_Malaysia-06/3505500628.jpg\" class=\" wp-post-image\" alt=\"\" loading=\"lazy\" />\t\t\t\t</a>\n\t\t\t\t\t</div><!-- /.post-image -->\n\t\n\t\t<h3 class=\"post-title\">\n\t\t\t<a href=\"https://www.newmandala.org/malaysia-the-new-political-normal-for-now/\">Malaysia: The New Political Normal, for Now</a>\n\t\t</h3><!-- /.post-title -->\n\t\t\n\t\t\t\t<div class=\"post-entry\">\n\t\t\t<p>The promise of the “New Malaysia” that would emerge after the historic 2018 election has been delayed again indefinitely.</p>\n\t\t</div><!-- /.post-entry -->\n\t\n\t\t<div class=\"post-actions\">\n\t\t\t<div class=\"post-meta\">\n\t\t\t\t<p>\n\t\t\t\t\t\t<a class=\"post-author\" href=\"https://www.newmandala.org/author/sebdettman/\">Sebastian Dettman</a>\n\t\t\t\t\n\t\t\t\t\t24 August, 2021\t\t\t\t</p>\n\t\t\t</div><!-- /.post-meta -->\n\t\t</div><!-- /.post-actions -->\n\t</div><!-- /.post -->\n\t</em></p>\n<p>It points to the gig economy as a specific source of grief—including for underemployed graduates—along with Malaysia’s low productivity, low wages, and regulatory inertia.</p>\n<p>Recognising their resulting crisis fatigue, Anwar’s book speaks directly to voters: “we must not forget that your sacrifice, your perseverance, and your spirit to carry on, when everything was against you, has delivered us through a global pandemic marred in concurrent political and economic crises.”</p>\n<p>In terms of offering solutions, Anwar’s discussion under each theme appears to look in two directions. One is towards his history, which dates back to the 1960s, of thinking through the challenges Malaysia has faced as a diverse, yet highly unequal, postcolonial society.</p>\n<p>In the 1970s, Anwar was a young Malay rights activist who turned to Islam as a prescription for decolonisation, leading <a href=\"https://www.abim.org.my/english/\">ABIM</a>, an NGO that contributed enormously to the Islamisation of Malaysian politics.</p>\n<p>And yet, even as he became a powerful political insider from the 1980s, he seemed to already grasp that no force in Malaysian society could suppress its diversity completely while also improving its social and economic resilience.</p>\n<p>This realisation has caused him always to return to questions of how Muslims and non-Muslims could live together in a respectful society and caring economy—themes he rehearsed while building a political opposition after his late 1990s expulsion from the centre of Malaysian state power.</p>\n<p>The other direction is towards a future seemingly imagined via <a href=\"https://kanbantool.com/lean-startup-kanban#:~:text=Lean%20Startup%20Kanban%20Approach&text=It%20is%20the%20best%20choice,to%20reduce%20the%20cycle%20time.\">Kanban ideation</a>, in a bureaucratic/NGO version of tech start-up culture. Indeed, each theme in the book appears to have been put through a vision-boarding process using markers, Post-it notes, and butcher’s paper, presumably while on retreats with Sardar and his team.</p>\n<p>These retreats were apparently interrupted not only by the <a href=\"https://www.newmandala.org/federal-state-friction-amid-malaysias-dual-political-and-pandemic-plight/\">pandemic but also by the Sheraton Move</a>, which brought down Anwar’s Pakatan Harapan government in 2020. Perhaps as a result, the book reads not so much like an explicit political narrative, but more like the result of a brainstorm session.</p>\n<p>It is, after all, a framework and not a manifesto. Anwar’s ideas for creating a culture of social repair in Malaysia are set out in the broadest terms. The book names a vast range of issues that all need addressing, such as energy security, waste collection services, national insurance and investment schemes for emergency and humanitarian relief, student debt relief, and a Court of Protection to rule on welfare matters.</p>\n<p>It points to the need for improved farm-to-table systems that pay farmers better while improving Malaysians’ food security. It even raises the idea of awarding social credits for “positive actions.” It also speaks of creating more “humane” economic and financial institutions, along with better social welfare provisions, for an inclusive economic recovery.</p>\n<p>Among all these issues, it also speaks of the need for a “polylogue” on finer-grained solutions, in which Malaysians, in all their diversity, can develop not only policy specifics but a variety of languages and culturally relevant idioms in which to debate them.</p>\n<p>The idea that Malaysians will take control of SCRIPT’s ideas is an important signal. Observant readers will notice that the book is not a pitch to implement democratic reforms, like the many that were made by and to Anwar’s government before it was rolled and reformists’ hopes were dashed. Rather, it is a pitch to lead Malaysians as they set out together to repair their social fabric.</p>\n<p>In this way, the book foreshadows that not only will its ideas be drawn upon in campaign messages rolled out in the weeks to come, but they could also form the basis of a longer-term campaign, including in the states that Pakatan Harapan still controls, in the event that it loses the election. Those states are not holding state elections at the same time as the federal election.</p>\n<p>It must be tough still playing the long game in politics at the age of 75, especially when the short-term tactics of election campaigns tend to consume so much political oxygen.</p>\n<p>Perhaps Anwar can take consolation from the fact that in Malaysia, politics truly is a long game. His long-term frenemy, former Prime Minister Mahathir Mohamad, is still in it at nearly 100.</p>\n<p><em>Dr Amrita Malhi&#8217;s New Mandala report on Pakatan Harapan’s collapse amid a furore over how to manage race and racism, is available <a href=\"https://www.newmandala.org/national-harmony-race-politics-and-campaigning-in-malaysia/\">here</a>. Her previous New Mandala articles, including a series of interviews with Mahathir Mohamad, are available <a href=\"https://www.newmandala.org/mahathir-prepares-najib-confrontation/\">here</a>.</em></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.newmandala.org/flipping-the-script-anwar-seeks-to-repair-his-nation-in-postnormal-times/\">Flipping the SCRIPT: Anwar seeks to repair his nation in postnormal times</a> appeared first on <a rel=\"nofollow\" href=\"https://www.newmandala.org\">New Mandala</a>.</p>\n"
}