{
  "id": "https://bibleinoneyear.org/en/youth/355",
  "title": "Day 355: God’s Hand Is On You",
  "description": "Psalm 145:14,16, Ezra 7:27–28, Revelation 13:1–3,7–8,11,14,16–18.  Ezra said, ‘Because *the hand of the Lord my God was on me*, I took courage…’ (Ezra 7:28)  God’s invisible and intangible hand is also on you: leading, guiding, encouraging, protecting, strengthening you and giving you courage",
  "pubDate": "Tue, 21 Dec 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/355/?ignore",
  "itunes:duration": "09:28",
  "guid": "enyouth21122021-355",
  "length": 568.22,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 355: God’s Hand Is On You",
  "itunes:subtitle": "Psalm 145:14,16, Ezra 7:27–28, Revelation 13:1–3,7–8,11,14,16–18.  Ezra said, ‘Because *the hand of the Lord my God was on me*, I took courage…’ (Ezra 7:28)  God’s invisible and intangible hand is also on you: leading, guiding, encouraging, protecting, strengthening you and giving you courage",
  "itunes:summary": "Hands are very important. On her wedding day, I took hold of our daughter’s hand and passed it over to the minister (who happened to be our son). His hand (for these purposes) represented God’s hand. He, in turn, joined her hand to that of her husband. Symbolically, I gave her to God and God gave her to her husband. A key part of the marriage ceremony is the joining of hands.\nAt one level, your hand is simply your palm, fingers and thumb. But when we use the word ‘hand’ we often mean it in more than just a physical sense. The ‘hand’ can be used as a metaphor for action, care and possession.\nGod uses hands. We read of Jesus healing through laying his hands on sick people, or even just touching them with his hands (for example, Mark 6:5; 8:23). At other times, he put his hands on people to bless them (10:16). He told his disciples that their hands would be used to heal the sick (16:18). Indeed, people were healed through the laying on of their hands (for example, Acts 8:17–18). Others were filled with the Holy Spirit (9:17; 19:6), or received gifts through the laying on of hands (2 Timothy 1:6).\nWhat about ‘the hand of God’? What does that mean? In the Bible, ‘the hand of God’ means something very profound. Ezra said, ‘Because the hand of the Lord my God was on me, I took courage…’ (Ezra 7:28). God’s invisible and intangible hand is also on you: leading, guiding, encouraging, protecting, strengthening you and giving you courage.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 355
}