{
  "id": "yt:video:zCU9tZ2VkWc",
  "yt:videoId": "zCU9tZ2VkWc",
  "yt:channelId": "UCrlZs71h3mTR45FgQNINfrg",
  "title": "Why you can't solve quintic equations (Galois theory approach) #SoME2",
  "link": "",
  "author": {
    "name": "Mathemaniac",
    "uri": "https://www.youtube.com/channel/UCrlZs71h3mTR45FgQNINfrg"
  },
  "published": "2022-07-03T14:00:23+00:00",
  "updated": "2022-09-05T00:08:36+00:00",
  "media:group": {
    "media:title": "Why you can't solve quintic equations (Galois theory approach) #SoME2",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "An entry to #SoME2. It is a famous theorem (called Abel-Ruffini theorem) that there is no quintic formula, or quintic equations are not solvable; but very likely you are not told the exact reason why. Here is how traditionally we knew that such a formula cannot exist, using Galois theory.\n\nCorrection: At 08:09, I forgot to put ellipsis in between. \n\nVideo chapters:\n\n00:00 Introduction\n00:23 Chapter 1: The setup\n04:38 Chapter 2: Galois group\n11:15 Chapter 3: Cyclotomic and Kummer extensions\n19:43 Chapter 4: Tower of extensions\n27:25 Chapter 5: Back to solving equations\n35:23 Chapter 6: The final stretch (intuition)\n43:25 Chapter 7: What have we done?\n\nNotes:\n\nI HAVE to simplify and not give every technical detail. This is made with the intent that everyone, regardless of their background in algebra, can take away the core message of the video. This can only be done if I cut out the parts that are not necessary for this purpose. As with my previous video series on “Average distance in a unit disc”, this is made to address the question I always had when I was small - treat this as a kind of a video message to my past self.\n\nFor the “making everything Galois extension” bit, we will need to show that the only things fixed by ALL automorphisms over Q must be in Q itself. This is intuitive, but difficult to justify rigorously. All proofs I know involve “degree of field extension”, and the very satisfying result called the “tower law”, which I deliberately avoided throughout the video because it turns out not to be necessary for the core part of the video. For instance, this proof: https://math.stackexchange.com/questions/962898/on-a-proof-that-the-splitting-field-of-a-separable-polynomial-is-galois\n\nThe reason we have this mess is that we defined Galois extension using the splitting field of a (separable, i.e. no repeated roots) polynomial. The usual definition given is exactly as above - only things fixed by ALL automorphisms over Q must be in Q itself. This typical definition will of course solve the problem above, but will now create the problem of why this definition implies the larger field is made by adjoining the roots of some polynomial. These two definitions are equivalent, but I just think that it makes much more sense to define it the way I did in the video, in the context of the video; and also I think this is an easier definition to accept.\n\nResources on Tower law: https://en.wikipedia.org/wiki/Degree_of_a_field_extension#The_multiplicativity_formula_for_degrees\nhttps://artofproblemsolving.com/wiki/index.php/Tower_law\n\nQuotients of solvable groups are solvable (the elementary proof): https://math.stackexchange.com/questions/2203250/quotient-of-solvable-groups-is-solvable-whats-wrong-with-this-proof\n[The question is already the proof - it is a really elementary way to show the result that we want]\n\nMore resources on proofs that A_n is not solvable:\nSign of permutations: https://en.wikipedia.org/wiki/Parity_of_a_permutation\nAlternating groups: https://mathworld.wolfram.com/AlternatingGroup.html\nThe proof that A_n is simple (i.e. no non-trivial normal subgroups): http://ramanujan.math.trinity.edu/rdaileda/teach/s19/m3362/alternating.pdf\n[You need to only go up to Page 5 towards the end of the proof of Theorem 2, but you definitely need group theory lingo]\n\nIf you know a bit of group theory (orbit-stabiliser and Cauchy), then you can see that the polynomial x^5 - 6x + 3 has the full S5 Galois group, because it is (i) irreducible [this requires Eisenstein’s criterion, see link below], and (ii) exactly two complex roots [and hence the Galois group contains a transposition, i.e. complex conjugation]. Note that the Galois group is transitive. This again needs quite a bit of justification. For the proof assuming transitivity, see here: https://math.stackexchange.com/questions/3075225/f-irreducible-polynomial-with-p-2-real-roots-rightarrow-gal-mathbbq-f\n\nEisenstein’s criterion: https://en.wikipedia.org/wiki/Eisenstein%27s_criterion\n\nOther than commenting on the video, you are very welcome to fill in a Google form linked below, which helps me make better videos by catering for your math levels:\nhttps://forms.gle/QJ29hocF9uQAyZyH6\n\nIf you want to know more interesting Mathematics, stay tuned for the next video!\n\nSUBSCRIBE and see you in the next video!\n\nIf you are wondering how I made all these videos, even though it is stylistically similar to 3Blue1Brown, I don't use his animation engine Manim, but I will probably reveal how I did it in a potential subscriber milestone, so do subscribe!\n\nSocial media:\n\nFacebook: https://www.facebook.com/mathemaniacyt\nInstagram: https://www.instagram.com/_mathemaniac_/\nTwitter: https://twitter.com/mathemaniacyt\nPatreon: https://www.patreon.com/mathemaniac (support if you want to and can afford to!)\nMerch: https://mathemaniac.myspreadshop.co.uk\nKo-fi: https://ko-fi.com/mathemaniac [for one-time support]\n\nFor my contact email, check my About page on a PC.\n\nSee you next time!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}