{
  "title": "WHAT IS GOING ON WITH JOSH RICHARDS AND NESSA BARRETT? — BFFs EP. 81 WITH GABBIE HANNA",
  "description": "<p>We start the show joined by Gabbie Hanna, who has gone from drama with everyone on the internet (Trisha Paytas, David Dobrik, The Vlog Squad, Ricegum, Bo Burnham, etc) to now moving into \"save the world mode\" where negativity is no longer in her mind.\n\nWe then get into headlines to talk about all the Jaden Hossler and Nessa Barrett breakup updates which range from Josie Canseco denying rumors she cheated on Landon Barker with Jaden, Landon dm'ing fan accounts saying Josie and Jaden screwed everyone, Josh and Nessa liking old Jessa fan edits, them making Tik Toks with the same sound in the background right after each other, Nessa following and dm'ing Bri, and whether or not Josh has spoken to Nessa since her breakup with Jaden.\n\nWe continue with Olivia Rodrigo and Sabrina Carpenter being spotted together, Jenna Marbles potentially taking over the Late Late show from James Corden, Tana Mongeau making a formal apology to Dave for skipping on the podcast, and Topanga trending on Twitter after being in Jack Harlow's music video.\n\nWe wrap the show with BFFs corner where Josh went to Adam Sandler's daughter's Bat Mitzvah with Mia (and also Charlie Puth, Halsey, Jennifer Anniston, Kate Hudson, Conan, Jason Bateman, and all of Hollywood). We then get everyone's take on some inside Barstool drama of Marty Mush dating Hank's ex girlfriend Ria, and Dave and Bri may be on opposite sides. \n\nSupport our sponsors!\n\nSpark: Download Spark today at https://barstool.link/SparkBSS</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/bffspod\">barstool.link/bffspod</a></p>",
  "guid": "7323fabe-a80e-4711-ab59-9dfadd02562c",
  "pubDate": "Thu, 12 May 2022 00:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/134/Bffs",
  "itunes:explicit": "yes",
  "itunes:duration": "00:59:21",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}