{
  "title": "Credit Card Debt Puzzle: Liquid Assets to Pay Bills",
  "link": "https://fedinprint.org/item/fedawp/94790/original",
  "description": "Using transaction data from a US consumer payments diary, we revisit the credit card debt puzzle—a scenario in which consumers revolve credit card debt while also keeping liquid assets as bank account deposits. This scenario is very common: 42 percent of consumers in our sample were borrower-savers in 2019 (those who carry $100 or more in credit card debt and $100 or more in liquid assets). We explain the puzzle by showing that consumers need their liquid assets to pay monthly bills and other necessary expenses, including mortgage or rent. More than 80 percent of bills by value were paid out of bank accounts and could not be charged to credit cards, so bank account balances were needed to cover those basic expenses.\n\nOn average, borrower-savers' credit card debt exceeded their liquid assets. The average borrower-saver carried almost $6,400 in unpaid credit card debt and had $5,400 in liquid assets, including checking and savings accounts, cash, and general-purpose prepaid cards. Only 40 percent of borrower-savers had liquid assets greater than their unpaid credit card balance. In addition, borrower-savers' monthly expenses (bills and purchases) averaged 77 percent of their liquid assets, not leaving enough to repay their credit card debt. On average, the value of their liquid assets could cover only about 60 percent of their unpaid debt plus monthly bills.\n\nIn almost every category of assets or debts, both housing- and nonhousing-related, borrower-savers were significantly worse off financially than savers. Thus, the differences between borrower-savers and savers are much broader than just their credit card debt and bank account balances; the differences extend to mortgage debt and home equity. Even when we control for income and demographics in a regression, we find that carrying a mortgage or other debt (such as auto or educational loans) is associated with a higher probability of revolving on a credit card, suggesting that various types of household debt are complements rather than substitutes.\n\nDuring the COVID-19 pandemic in 2020, consumers' unpaid credit card debt decreased, and their liquid assets increased, so the fraction of borrower-savers dropped to 35 percent of the sample.",
  "guid": "https://fedinprint.org/item/fedawp/94790/original",
  "dc:creator": "Stavins, Joanna; Greene, Claire",
  "dc:date": "2022-08-17",
  "rdau:hasExtent": 38,
  "dc:subject": "credit card debt; liquid assets; consumer payments",
  "swpo:hasNumber": "2022-9",
  "identifiers:doi": "10.29338/wp2022-09",
  "bibo:series": "FRB Atlanta Working Paper"
}