{
  "id": "yt:video:Z08sh4PN8Lc",
  "yt:videoId": "Z08sh4PN8Lc",
  "yt:channelId": "UCX6b17PVsYBQ0ip5gyeme-Q",
  "title": "How Laws Affect Your Health: Crash Course Public Health #8",
  "link": "",
  "author": {
    "name": "CrashCourse",
    "uri": "https://www.youtube.com/channel/UCX6b17PVsYBQ0ip5gyeme-Q"
  },
  "published": "2022-09-22T17:00:30+00:00",
  "updated": "2022-10-27T02:15:43+00:00",
  "media:group": {
    "media:title": "How Laws Affect Your Health: Crash Course Public Health #8",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "If you’ve been paying attention to the news since, oh, say, 2020, then you’ll no doubt be aware that public health policy can often create tension. Having policies that affect public health can, and does, save lives, but not all policies affecting our health are “health policies.” Don’t worry, we’re going to break it all down in this episode of Crash Course Public Health, where we will discuss how an orthopedic surgeon’s love of racing helped create seatbelt policies in the US, and why sometimes laws governing what can be built where affect our health. \n\nChapters: \nSeat Belts & Your Health 00:00\nUnderstanding Health & Policy 2:21\nVaccination Policies 4:40\nHow Policies Save Lives 6:42\nWho Makes Health Policy? 10:01\nReview & Credits 12:33\n\nCheck out our shared playlist with APHA: https://www.youtube.com/playlist?list=PLDjqc55aK3kywF2dd97_Jh5iP0d2ARhdo \n\nVanessa’s channel: https://www.youtube.com/braincraft \n\nTranscript: https://docs.google.com/document/d/1rrykjVn85fBm0x8X0gN-A_eK_Iubx65nTzeEGOo9LMc/edit?usp=sharing \n\nSources: https://docs.google.com/document/d/1OHJiQ1njj5jWJC1YLDBzQgKC1QfnVgqJbbpK6qs7ekA/edit?usp=sharing\n\n***\nWatch our videos and review your learning with the Crash Course App! \nDownload here for Apple Devices: https://apple.co/3d4eyZo\nDownload here for Android Devices: https://bit.ly/2SrDulJ\n\nCrash Course is on Patreon! You can support us directly by signing up at http://www.patreon.com/crashcourse\n\nThanks to the following patrons for their generous monthly contributions that help keep Crash Course free for everyone forever:\nDylan Mandelblatt, Katie, Hilary Sturges, Austin Zielman, Tori Thomas, Justin Snyder, Hasan Jamal, DL Singfield, Amelia Ryczek, Ken Davidian, Stephen Akuffo, Toni Miles, Steve Segreto, Kyle & Katherine Callahan, Laurel Stevens, Michael Wang, Stacey J, Burt Humburg, Allyson Martin, Aziz Y, Shanta, DAVID MORTON HUDSON, Perry Joyce, Scott Harrison, Mark & Susan Billian, Alan Bridgeman, Rachel Creager, Breanna Bosso, Matt Curls, Tim Kwist, Jonathan Zbikowski, Jennifer Killen, Sarah & Nathan Catchings, team dorsey, Trevin Beattie, Eric Koslow, Jennifer Dineen, Indika Siriwardena, Jason Rostoker, Shawn Arnold, Siobhán, Ken Penttinen, Nathan Taylor, Les Aker, William McGraw, ClareG, Rizwan Kassim, Constance Urist, Alex Hackman, Jirat, Pineapples of Solidarity, Katie Dean, Wai Jack Sin, Ian Dundore, Justin, Mark, Caleb Weeks\n__\n\nWant to find Crash Course elsewhere on the internet?\nFacebook - http://www.facebook.com/YouTubeCrashCourse\nTwitter - http://www.twitter.com/TheCrashCourse\nInstagram - https://www.instagram.com/thecrashcourse/\n\nCC Kids: http://www.youtube.com/crashcoursekids",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}