{
  "title": "Astronomers find a “cataclysmic” pair of stars with the shortest orbit yet",
  "link": "https://news.mit.edu/2022/cataclysmic-pair-stars-astronomy-1005",
  "description": "The stars circle each other every 51 minutes, confirming a decades-old prediction.",
  "pubDate": "Wed, 05 Oct 2022 11:00:00 -0400",
  "guid": "https://news.mit.edu/2022/cataclysmic-pair-stars-astronomy-1005",
  "dc:creator": "Jennifer Chu | MIT News Office",
  "content:encoded": "<p>Nearly half the stars in our galaxy are solitary like the sun. The other half comprises stars that circle other stars, in pairs and multiples, with orbits so tight that some stellar systems could fit between Earth and the moon.</p>\n\n<p>Astronomers at MIT and elsewhere have now discovered a stellar binary, or pair of stars, with an extremely short orbit, appearing to circle each other every 51 minutes. The system seems to be one of a rare class of binaries known as a “cataclysmic variable,” in which a star similar to our sun orbits tightly around a white dwarf — a hot, dense core of a burned-out star. &nbsp;</p>\n\n<p>A cataclysmic variable occurs when the two stars draw close, over billions of years, causing the white dwarf to start accreting, or eating material away from its partner star. This process can give off enormous, variable flashes of light that, centuries ago, astronomers assumed to be a result of some unknown cataclysm.</p>\n\n<p>The newly discovered system, which the team has tagged ZTF J1813+4251, is a cataclysmic variable with the shortest orbit detected to date. Unlike other such systems observed in the past, the astronomers caught this cataclysmic variable as the stars eclipsed each other multiple times, allowing the team to precisely measure properties of each star.</p>\n\n<p>With these measurements, the researchers ran simulations of what the system is likely doing today and how it should evolve over the next hundreds of millions of years. They conclude that the stars are currently in transition, and that the sun-like star has been circling and “donating” much of its hydrogen atmosphere to the voracious white dwarf. The sun-like star will eventually be stripped down to a mostly dense, helium-rich core. In another 70 million years, the stars will migrate even closer together, with an ultrashort orbit reaching just 18 minutes, before they begin to expand and drift apart.</p>\n\n<p>Decades ago, researchers at MIT and elsewhere predicted that such cataclysmic variables should transition to ultrashort orbits. This is the first time such a transitioning system has been observed directly.</p>\n\n<p>“This is a rare case where we caught one of these systems in the act of switching from hydrogen to helium accretion,” says Kevin Burdge, a Pappalardo Fellow in MIT’s Department of Physics. “People predicted these objects should transition to ultrashort orbits, and it was debated for a long time whether they could get short enough to emit detectable&nbsp;gravitational waves. This discovery puts that to rest.”​</p>\n\n<p>Burdge and colleagues report their discovery today in <em>Nature</em>. The study’s co-authors include collaborators from multiple institutions, including the Harvard and Smithsonian Center for Astrophysics.</p>\n\n<p><strong>Sky search</strong></p>\n\n<p>The astronomers discovered the new system within a vast catalog of stars, observed by the Zwicky Transient Facility (ZTF), a survey that uses a camera attached to a telescope at the Palomar Observatory in California to take high-resolution pictures of wide swaths of the sky.</p>\n\n<p>The survey has taken more than 1,000 images of each of the more than 1 billion stars in the sky, recording each star’s changing brightness over days, months, and years.</p>\n\n<p>Burdge combed through the catalog, looking for signals of systems with ultrashort orbits, the dynamics of which can be so extreme that they should give off dramatic bursts of light and emit gravitational waves.</p>\n\n<p>&nbsp;“Gravitational waves are allowing us to study the universe in a totally new way,” says Burdge, who is searching the sky for new gravitational-wave sources.</p>\n\n<p>For this new study, Burdge looked through the ZTF data for stars that appeared to flash repeatedly, with a period of less than an hour — a frequency that typically signals a system of at least two closely orbiting objects, with one crossing the other and briefly blocking its light.</p>\n\n<p>He used an algorithm to weed through over 1 billion stars, each of which was recorded in more than 1,000 images. The algorithm sifted out about 1 million stars that appeared to flash every hour or so. Among these, Burdge then looked by eye for signals of particular interest. His search zeroed in on ZTF J1813+4251 — a system that resides about 3,000 light years from Earth, in the Hercules constellation.</p>\n\n<p>“This thing popped up, where I saw an eclipse happening every 51 minutes, and I said, OK, this is definitely a binary,” Burdge recalls.</p>\n\n<p><strong>A dense core</strong></p>\n\n<p>He and his colleagues further focused on the system using the W.M. Keck Observatory in Hawaii and the Gran Telescopio Canarias in Spain. They found that the system was exceptionally “clean,” meaning they could clearly see its light change with each eclipse. With such clarity, they were able to precisely measure each object’s mass and radius, as well as their orbital period.</p>\n\n<p>They found that the first object was likely a white dwarf, at 1/100th the size of the sun and about half its mass. The second object was a sun-like star near the end of its life, at a tenth the size and mass of the sun (about the size of Jupiter). The stars also appeared to orbit each other every 51 minutes.</p>\n\n<p>Yet, something didn’t quite add up.</p>\n\n<p>“This one star looked like the sun, but the sun can’t fit into an orbit shorter than eight hours — what’s up here?” Burdge says.</p>\n\n<p>He soon hit upon an explanation: Nearly 30 years ago, researchers including MIT Professor Emeritus Saul Rappaport had predicted that ultrashort-orbit systems should exist as cataclysmic variables. As the white dwarf eats orbits the sun-like star and eats away its light hydrogen, the sun-like star should burn out, leaving a core of helium — an element that is more dense than hydrogen, and heavy enough to keep the dead star in a tight, ultrashort orbit.</p>\n\n<p>Burdge realized that ZTF J1813+4251 was likely a cataclysmic variable, in the act of transitioning from a hydrogen- to helium-rich body. The discovery both confirms the predictions made by Rappaport and others, and also stands as the shortest orbit cataclysmic variable detected to date.</p>\n\n<p>“This is a special system,” Burdge says. “We got doubly lucky to find a system that answers a big open question, and is one of the most beautifully behaved cataclysmic variables known.”</p>\n\n<p>This research was supported, in part, by the European Research Council.</p>",
  "media:content": {
    "media:description": "An artist’s illustration shows a white dwarf (right) circling a larger, sun-like star (left) in an ultra-short orbit, forming a “cataclysmic” binary system.",
    "media:credit": "Credit: M.Weiss/Center for Astrophysics | Harvard & Smithsonian"
  },
  "category": [
    "Astronomy",
    "Astrophysics",
    "Black holes",
    "Light",
    "Physics",
    "Research",
    "Space, astronomy and planetary science",
    "Stars",
    "School of Science"
  ]
}