{
  "id": "https://bibleinoneyear.org/en/youth/246",
  "title": "Day 246: How Your Life Can Make a Difference",
  "description": "Psalm 105:12–22, Isaiah 5:7, 2 Corinthians 6:3–13, 7:1.  He gave the equivalent of US $250 million to fund such prizes  Alfred Nobel had the rare opportunity to evaluate his life near its end and live long enough to change that assessment",
  "pubDate": "Fri, 03 Sep 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/246/?ignore",
  "itunes:duration": "14:00",
  "guid": "enyouth03092021-246",
  "length": 840.18,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 246: How Your Life Can Make a Difference",
  "itunes:subtitle": "Psalm 105:12–22, Isaiah 5:7, 2 Corinthians 6:3–13, 7:1.  He gave the equivalent of US $250 million to fund such prizes  Alfred Nobel had the rare opportunity to evaluate his life near its end and live long enough to change that assessment",
  "itunes:summary": "Alfred Nobel (1833–1896) is best known for the Nobel Peace Prize. Less well known is the fact that Alfred Nobel also invented dynamite. As well as a chemist, engineer and innovator, he was a weapons’ manufacturer.\nIn 1888, Alfred’s brother Ludvig died. A French newspaper erroneously published Alfred’s obituary. It condemned him for his invention of dynamite, stating: ‘The merchant of death is dead… Dr Alfred Nobel, who became rich by finding ways to kill more people faster than ever before, died yesterday.’\nAlfred Nobel was devastated by the foretaste of how he would be remembered. His last will and testament set aside the bulk of his estate to establish the Nobel prizes. He gave the equivalent of US $250 million to fund such prizes. Alfred Nobel had the rare opportunity to evaluate his life near its end and live long enough to change that assessment.\nHave you ever wondered what difference your life might make? How can your life bring blessing to other people? How can you change the world for the better? How can your life be of ultimate lasting value? How can we lead fruitful lives?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 246
}