{
  "title": "The Edition: Power grab",
  "link": "https://audioboom.com/posts/7956381",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2315,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s episode: with the energy crisis picking up pace who are set to be the winners and losers in this cold war for gas? Domestically we are seeing queues for petrol, rising gas prices all in the face of the Government’s net-zero agenda. And internationally things are looking just as turbulent, with China buying up as much fuel as possible, America becoming more isolationist when it comes to its energy supply, and Russia feeling more powerful in its place thanks to its Nord Stream 2 pipeline. These are the issues that Seb Kennedy, the founding editor of<em> Energy Flux</em>, addresses in his cover piece this week for <em>The Spectator</em>. He speaks about his findings on the podcast along with Senior Reporter for Energy and Commodities for <em>Bloomberg</em> and co-author of <em>The World for Sale</em>, Jack Farchy. (00:50)</div>\n<div><br>\n</div>\n<div>Also this week: can the police reform with Cressida Dick still in charge? Leroy Logan writes in this week’s <em>Spectator</em> that if the Met and police are to reform its subculture of racism and misogyny it can’t be done with Cressida Dick still at the helm. He is joined on the podcast by Sharon Haye, a former officer and policing advocate. (14:06)</div>\n<div><br>\n</div>\n<div>And finally: what is the future for British butchery? Olivia Potts is learning butchery. And in this week’s <em>Spectator</em>, she writes about her experiences as well as the state of the industry in the UK today. Nigel Jarvis is a fourth-generation butcher who has just retired after an unexpected boom in custom during lockdown. (28:52)</div>\n<div><br>\n</div>\n<div> Hosted by Lara Prendergast</div>\n<div><br>\n</div>\n<div> Produced by Sam Holmes</div>\n",
  "pubDate": "Thu, 07 Oct 2021 15:28:00 +0000",
  "guid": "tag:audioboom.com,2021-10-07:/posts/7956381",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}