{
  "title": "Bad on Politics #2: Clare Malone Gives us a pre-Debate Primer!",
  "itunes:title": "Bad on Politics #2: Clare Malone Gives us a pre-debate Primer!",
  "pubDate": "Mon, 14 Oct 2019 04:01:00 +0000",
  "guid": "95612d62b01f40dc98ea870deef006fd",
  "link": "https://youngadultingpod.libsyn.com/bad-on-politics-2-clare-malone-gives-us-a-pre-debate-primer",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Friend of the pod and political writer for FiveThirtyEight, Clare Malone joins us to help sort through the</span> <span style=\"font-weight: 400;\">top ten Democratic</span> <span style=\"font-weight: 400;\">candidates on stage at the next debate. She takes a deep dive into the backgrounds of the top three front runners (Joe Biden, Elizabeth Warren, Bernie Sanders), and gives us the headlines on the rest (Pete Buttigieg, Kamala Harris, Andrew Yang, Beto O’Rourke, Amy Klobuchar, Cory Booker, Julian Castro). Clare also breaks down the Republican</span> <span style= \"font-weight: 400;\">challengers</span><span style= \"font-weight: 400;\">, too (Bill Weld, Joe Walsh, and Mark Sanford). </span></p> <p> </p> <p><span style=\"font-weight: 400;\">For more Clare Malone:</span></p> <p><span style=\"font-weight: 400;\">@claremalone on instagram and twitter</span></p> <p><a href= \"https://fivethirtyeight.com/contributors/clare-malone/\"><span style=\"font-weight: 400;\"> https://fivethirtyeight.com/contributors/clare-malone/</span></a> <span style=\"font-weight: 400;\">on fivethirtyeight.com</span></p> <p> </p> <p><span style=\"font-weight: 400;\"> </span></p> <p><strong>About Bad on Politics:</strong> <span style= \"font-weight: 400;\">Bad on Politics is a monthly bonus episode where we invite a guest expert to help us break down a political topic. We get it, politics is confusing and there's a anxiety-inducing amount of news coverage to follow. So, we're here to ask the \"dumb\" questions so you don't have to. We want to break things down so you can understand what's going on and make an informed opinion.</span></p>",
  "content:encoded": "<p>Friend of the pod and political writer for FiveThirtyEight, Clare Malone joins us to help sort through the top ten Democratic candidates on stage at the next debate. She takes a deep dive into the backgrounds of the top three front runners (Joe Biden, Elizabeth Warren, Bernie Sanders), and gives us the headlines on the rest (Pete Buttigieg, Kamala Harris, Andrew Yang, Beto O’Rourke, Amy Klobuchar, Cory Booker, Julian Castro). Clare also breaks down the Republican challengers, too (Bill Weld, Joe Walsh, and Mark Sanford). </p> <p> </p> <p>For more Clare Malone:</p> <p>@claremalone on instagram and twitter</p> <p><a href= \"https://fivethirtyeight.com/contributors/clare-malone/\"> https://fivethirtyeight.com/contributors/clare-malone/</a> on fivethirtyeight.com</p> <p> </p> <p> </p> <p>About Bad on Politics: Bad on Politics is a monthly bonus episode where we invite a guest expert to help us break down a political topic. We get it, politics is confusing and there's a anxiety-inducing amount of news coverage to follow. So, we're here to ask the \"dumb\" questions so you don't have to. We want to break things down so you can understand what's going on and make an informed opinion.</p>",
  "enclosure": "",
  "itunes:duration": "47:11",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "A quick review of the candidates: Who are they and what are their platforms?",
  "itunes:season": 1,
  "itunes:episode": 80,
  "itunes:episodeType": "full",
  "itunes:author": "Grace Atwood & Becca Freeman"
}