{
  "title": "Digging Into the New QD-OLED TVs",
  "link": "https://spectrum.ieee.org/qd-oled",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/television-screen-displaying-closeup-of-crystals.jpg?id=30538375&width=1245&height=700&coordinates=0%2C116%2C0%2C117\"/><br/><br/><div class=\"ieee-editors-note\">\n<em>Televisions and computer monitors with QD-OLED displays are now on store shelves. The image quality is—as expected—impressive, with amazing black levels, wide viewing angles, a broad color gamut, and high brightness. The products include:</em>\n</div><ul>\n<li><em><a href=\"https://www.samsung.com/us/televisions-home-theater/tvs/oled-tvs/65-class-s95b-oled-4k-smart-tv-2022-qn65s95bafxza/?cid=sem-mktg-pfs-tv-us-google-na-03182022-140959-&ds_e=GOOGLE-cr:0-pl:294764987-&ds_c=FF~OLED+Brand_CN~oled_ID~na_PH~on_MK~us_BS~vd_PR~tv_SB~bitv_FS~lo_CA~kew_KS~ba_MT~exact-&ds_ag=AG~Core_ID~na_MK~us_AT~ta_MD~h_PK~cpqlh_PB~google_AI~n-&ds_k=s95b&gclid=Cj0KCQjwuaiXBhCCARIsAKZLt3nI75I1KvrG_hxQa7L3r-NF0WaHttqhxcv4CdKWUAlPl11BCtpVpB0aAjG8EALw_wcB&gclsrc=aw.ds\" target=\"_blank\">Samsung’s S95B TV</a> in 55-inch (US $2,200) and 65-inch ($3,000) sizes</em></li>\n<li><em><a href=\"https://electronics.sony.com/tv-video/televisions/all-tvs/p/xr65a95k\" rel=\"noopener noreferrer\" target=\"_blank\">Sony’s A95K TV</a> in 55-inch ($3,000) and 65-inch ($4,000) sizes</em></li>\n<li><em><a href=\"https://www.dell.com/en-us/shop/alienware-34-curved-qd-oled-gaming-monitor-aw3423dw/apd/210-bcye/monitors-monitor-accessories\" rel=\"noopener noreferrer\" target=\"_blank\">Alienware’s 34-inch gaming monitor</a> ($1,300)</em></li>\n</ul><p>\n<em>All these products use display panels manufactured by Samsung but have their own unique display assembly, operating system, and electronics.</em>\n</p><p class=\"\">\n<em>I took apart a 55-inch Samsung S95B to learn just how these new displays are put together (destroying it in the process). I found an extremely thin OLED backplane that generates blue light with an equally thin QD color-converting structure that completes the optical stack. I used a UV light source, a microscope, and a spectrometer to learn a lot about how these displays work.</em>\n</p><h3></h3><br/><img alt=\"rows of green squares alternating with rows of red and blue squares against a black background\" class=\"rm-shortcode\" data-rm-shortcode-id=\"bfb6f5e8984ba61e42885e167915afd6\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"bc6ac\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/rows-of-green-squares-alternating-with-rows-of-red-and-blue-squares-against-a-black-background.jpg?id=30510843&width=980\"/><p><em>A few surprises:</em></p><ul><li><em>The pixel layout is unique. Instead of being evenly arrayed, the green quantum dots form their own line, separate from the blue and red [see photo, above]. (The blue pixels draw their light directly from the OLED panel, the red and green pixels are lit by quantum dots.)</em></li><li><em>The bandwidth of the native QD emission is so narrow (resulting in a very wide <a href=\"https://www.benq.com/en-us/knowledge-center/knowledge/color-gamut-monitor.html\" target=\"_blank\">color gamut</a>, that is, the range of colors that can be produced, generally a good thing) that some content doesn’t know how to handle it. So the TV “compresses” the gamut in some cases by adding off-primary colors to bring its primary color points in line with more common gamuts. This is especially dramatic with green, where “pure” green actually contains a significant amount of added red and a small amount of added blue.</em></li><li><em>While taking this thing apart was no easy task, and deconstruction cracked the screen, I was surprised at how easily the QD frontplane and the OLED backplane could be separated. It was easier than splitting an Oreo in half. [See video, below.]</em></li></ul><h3></h3><br/><span class=\"rm-shortcode\" data-rm-shortcode-id=\"f113cc5369a2e85db692e9d3538b7dda\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/0esg-HFbRkw?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span><h3></h3><br/><p><em>As for the name of this technology, Samsung has used the branding OLED, QD Display, and QD-OLED, while Sony is just using OLED. Alienware uses QD-OLED to describe the new tech (as do most in the display industry).</em></p><p><em>—Peter Palomaki</em></p><h3></h3><br/><p><em>Story from January 2022 follows:</em></p><p>For more than a decade now, OLED (organic light-emitting diode) displays have set the bar for screen quality, albeit at a price. That’s because they produce deep blacks, offer wide viewing angles, and have a broad color range. Meanwhile, QD (quantum dot) technologies have done a lot to improve the color purity and brightness of the more wallet-friendly LCD TVs.</p><p>In 2022, these two rival technologies will merge. The name of the resulting hybrid is still evolving, but QD-OLED seems to make sense, so I’ll use it here, although Samsung has begun to call its version of the technology QD Display.</p><p>To understand why this combination is so appealing, you have to know the basic principles behind each of these approaches to displaying a moving image.</p><p>In an LCD TV, the LED backlight, or at least a big section of it, is on all at once. The picture is created by filtering this light at the many individual pixels. Unfortunately, that filtering process isn’t perfect, and in areas that should appear black some light gets through.<br/></p><p>In OLED displays, the red, green, and blue diodes that comprise each pixel emit light and are turned on only when they are needed. So black pixels appear truly black, while bright pixels can be run at full power, allowing unsurpassed levels of contrast.</p><p>But there’s a drawback. The colored diodes in an OLED TV degrade over time, causing what’s called “burn-in.” And with these changes happening at different rates for the red, green, and blue diodes, the degradation affects the overall ability of a display to reproduce colors accurately as it ages and also causes “ghost” images to appear where static content is frequently displayed.</p><p>Adding QDs into the mix shifts this equation. Quantum dots—nanoparticles of semiconductor material—absorb photons and then use that energy to emit light of a different wavelength. In a QD-OLED display, all the diodes emit blue light. To get red and green, the appropriate diodes are covered with red or green QDs. The result is a paper-thin display with a broad range of colors that remain accurate over time. These screens also have excellent black levels, wide viewing angles, and improved power efficiency over both OLED and LCD displays.</p><p>Samsung is the driving force behind the technology, having sunk billions into retrofitting an LCD fab in Tangjeong, South Korea, for making QD-OLED displays While other companies have published articles and demonstrated similar approaches, only</p><p>Samsung has committed to manufacturing these displays, which makes sense because it holds all of the required technology in house. Having both the OLED fab and QD expertise under one roof gives Samsung a big leg up on other QD-display manufacturers.,</p><p>Samsung first announced QD-OLED plans in 2019, then pushed out the release date a few times. It now seems likely that we will see public demos in early 2022 followed by commercial products later in the year, once the company has geared up for high-volume production. At this point, Samsung can produce a maximum of 30,000 QD-OLED panels a month; these will be used in its own products. In the grand scheme of things, that’s not that much.</p><p>Unfortunately, as with any new display technology, there are challenges associated with development and commercialization.</p><p>For one, patterning the quantum-dot layers and protecting them is complicated. Unlike QD-enabled LCD displays (commonly referred to as QLED) where red and green QDs are dispersed uniformly in a polymer film, QD-OLED requires the QD layers to be patterned and aligned with the OLEDs behind them. And that’s tricky to do. Samsung is expected to employ inkjet printing, an approach that reduces the waste of QD material.</p><p>Another issue is the leakage of blue light through the red and green QD layers. Leakage of only a few percent would have a significant effect on the viewing experience, resulting in washed-out colors. If the red and green QD layers don’t do a good job absorbing all of the blue light impinging on them, an additional blue-blocking layer would be required on top, adding to the cost and complexity.</p><p>Another challenge is that blue OLEDs degrade faster than red or green ones do. With all three colors relying on blue OLEDs in a QD-OLED design, this degradation isn’t expected to cause as severe color shifts as with traditional OLED displays, but it does decrease brightness over the life of the display.</p><p>Today, OLED TVs are typically the most expensive option on retail shelves. And while the process for making QD-OLED simplifies the OLED layer somewhat (because you need only blue diodes), it does not make the display any less expensive. In fact, due to the large number of quantum dots used, the patterning steps, and the special filtering required, QD-OLED displays are likely to be more expensive than traditional OLED ones—and way more expensive than LCD TVs with quantum-dot color purification. Early adopters may pay about US $5,000 for the first QD-OLED displays when they begin selling later this year. Those buyers will no doubt complain about the prices—while enjoying a viewing experience far better than anything they’ve had before.</p>",
  "pubDate": "Thu, 04 Aug 2022 20:30:00 +0000",
  "guid": "https://spectrum.ieee.org/qd-oled",
  "category": [
    "Qd",
    "Tv",
    "Quantum dots",
    "Display",
    "Oled",
    "Ces",
    "Ces 2022",
    "Samsung",
    "Sony",
    "Alienware"
  ],
  "dc:creator": "Peter Palomaki",
  "media:content": ""
}