{
  "title": "S1E18 - When Your Purpose Becomes Greater Than Your Goal with Chaunte Lowe",
  "guid": "https://pinecast.com/guid/bdd2e708-cb95-42f0-b700-f5eb055944e9",
  "pubDate": "Tue, 06 Oct 2020 06:30:00 -0000",
  "itunes:duration": "00:44:20",
  "description": "<p>Olympic high jumper, and Laura’s newly declared BFF, Chaunte Lowe, is her very special guest on the podcast this week. Chaunte is a 4-time Olympian, 3-Time World Championship medalist, and 12 times US National Champion, who is always a crowd favorite with her impossibly defined abs, dramatic dance moves, and occasional backflips. She is also a mother of 3 and a breast cancer survivor who is currently training for an opportunity to compete in her 5th Olympic Games in Tokyo 2021. Hers is a story of determination, perseverance and strength that you do not want to miss.</p>\n<p>In today’s episode, Chaunte shares this story of her personal life and career as they intertwine from childhood to today. Along the way, she discusses her childhood difficulties, the resilience she developed, her various Olympic experiences, including the remarkable story behind her Bronze medal, and the incredibly moving and inspiring account of her battle with breast cancer. She and Laura also talk about coming out of retirement, preparing for the coming Olympics, and the challenges of doing so with all the changes that the current pandemic presents. Woven throughout their conversation is the importance of Chaunte’s faith, the powerful motivators which keep her going, and the sheer strength that she possesses, not just physically, but mentally, emotionally and spiritually as well. As you listen in today, you will discover that Chaunte Lowe is, indeed, an ‘unstoppable force who has a purpose greater than her goals’, and is truly an inspiration to all.</p>\n<p>Episode Highlights:</p>\n<p>·       Chaunte’s background and how she got into high jumping\n·       Her childhood difficulties and how she worked through them\n·       Chaunte’s high school and college careers\n·       The role her faith plays\n·       Her journey to the Olympics\n·       Chaunte’s experience at the Athens Olympics\n·       Becoming a professional athlete\n·       The story of her Beijing Olympics, receiving her medal, and her feelings about it all\n·       Chaunte’s battle with breast cancer and the importance of knowing your body\n·       Her retirement\n·       The training she is doing now\n·       Laura and Chaunte’s experiences with their children learning at home\n·       What the next year looks like for Chaunte\n·       What keeps her motivated</p>\n<p>Quotes:</p>\n<p>“We never had a lot, but we were always happy.”</p>\n<p>“No matter where I was or how dire the situation was in my life, I would always be able to find a home within the church.”</p>\n<p>“Something about the high jump was calling me to it, and I believe that now to be God putting me on my right path.”</p>\n<p>“The day that I stepped onto campus, there was a plan. I was focused on executing the plan.”</p>\n<p>“He told me to think beyond athletics.”</p>\n<p>“I kept my integrity intact.”</p>\n<p>“The advancement in testing technology caught some things that weren’t initially caught in 2004.”</p>\n<p>“I’m a firm believer that everything happens for a reason in the right time.”</p>\n<p>“I was so confident that it wasn’t breast cancer, that I brought my kids to the appointment to get the results.”</p>\n<p>“Throughout that whole process, and with the strength of God, because I couldn’t have done it on my own, I decided to train.”</p>\n<p>“I wouldn’t have made it to my 40th birthday, that’s how dire it was.”</p>\n<p>“As athletes, we know our body.”</p>\n<p>“I’m figuring out ways to have my own…series of meets.”</p>\n<p>“I want my daughters to grow up in a breast cancer free world, and so that’s what I’m doing it for.”</p>\n<p>“That’s when you change the world.”</p>\n<p>Links:\nThe Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a> \nMental Training:   <a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">https://www.laurawilkinson.com/learn</a> \nLaura’s Social Media:\nInstagram: <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">https://www.instagram.com/lala_the_diver</a> \nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">https://www.facebook.com/TheLauraWilkinson</a></p>\n<p>Connect with Chaunte:</p>\n<p>Website:   <a href=\"https://www.chauntelowespeaks.com/\" rel=\"nofollow\">https://www.chauntelowespeaks.com/</a></p>\n<p>Instagram:   <a href=\"https://www.instagram.com/chauntelowe/?hl=en\" rel=\"nofollow\">https://www.instagram.com/chauntelowe/?hl=en</a></p>",
  "itunes:title": "When Your Purpose Becomes Greater Than Your Goal with Chaunte Lowe",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 18
}