{
  "title": "S14 Ep106: Supernatural News/Parashare: Year End Edition",
  "link": "https://audioboom.com/posts/8098524",
  "itunes:episode": 106,
  "itunes:title": "Supernatural News/Parashare: Year End Edition",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 6161,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Its time for BEYOND the DARKNESS Year End Edition of Supernatural News & ParaShare!<br>\n<br>\nDolls are bursting into flames, India is teaching Ghost Studies, Vegas is seeing UFOs and we check in on Dave's 2019 predictions! PLUS your paranormal stories featured!<br>\n<br>\nCall in and share YOUR stories on our<br>\nVoices from Beyond Voicemail 651-300-4977<br>\n<br>\nGet your cool Paranormal Books and Swag hand picked by Darkness Dave right here:<br>\n<a href=\"https://www.amazon.com/shop/darknessradiodave\">https://www.amazon.com/shop/darknessradiodave</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nAre you playing along with Beyond the Darkness on the Podcast One/ <a href=\"http://Betonline.AG\">Betonline.AG</a> Sportsnet Challenge?!  Each Week Dave and Tim are picking the winners of five NFL gam,es and playing against the hosts of different Podcast One shows!  If you play aloing with Dave and Tim on <a href=\"http://BetOnline.AG\">BetOnline.AG</a>, and they win the week, you qualify to be one of five winners splitting a $500 weekly prize! To sign up go to <a href=\"https://promotions.betonline.ag/podcastone\">https://promotions.betonline.ag/podcastone</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.<br>\n<br>\nWe all know mental health is a big part of self-care. But changing mental habits is easier said than done. Luckily, Talkspace online therapy gives you a convenient and affordable way to improve your mental health.  Our listeners can get $100 off their first month by using code DARKNESS at <a href=\"http://talkspace.com\">talkspace.com</a> right now!",
  "itunes:summary": "Its time for BEYOND the DARKNESS Year End Edition of Supernatural News & ParaShare!\n\nDolls are bursting into flames, India is teaching Ghost Studies, Vegas is seeing UFOs and we check in on Dave's 2019 predictions! PLUS your paranormal...",
  "pubDate": "Sat, 28 Dec 2019 10:00:00 +0000",
  "guid": "322746d7-06e4-4dbe-b61c-802d906f3b5c",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}