{
  "id": "yt:video:1GhyOA04YaY",
  "yt:videoId": "1GhyOA04YaY",
  "yt:channelId": "UC2iUwfYi_1FCGGqhOUNx-iA",
  "title": "Netflix's The Watcher: Fact vs Fiction",
  "link": "",
  "author": {
    "name": "Screen Rant",
    "uri": "https://www.youtube.com/channel/UC2iUwfYi_1FCGGqhOUNx-iA"
  },
  "published": "2022-10-28T16:30:00+00:00",
  "updated": "2022-11-03T09:23:30+00:00",
  "media:group": {
    "media:title": "Netflix's The Watcher: Fact vs Fiction",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Subscribe: http://bit.ly/Subscribe-to-Screenrant\n\nAnother month another Netflix true crime miniseries by prolific producer Ryan Murphy. The American Horror Story creator first took on the well traveled story of Jeffery Dahmer in the series Dahmer Monster: The Jeffrey Dahmer Story. Now he’s moved his focus to the upscale suburbs of New Jersey with the true but not entirely story of a family that buys a house only to find out that it has a rather dedicated fan already who starts sending the family letters signed The Watcher. As the notes get more personal and more threatening the family struggles to maintain while trying to find out who is sending them these mysterious letters. Is it the privacy invading spectator neighbors Mitch and Maureen who are partially based on neighbors that did in fact sit in lawn chairs facing the house but bear little else with the characters in the show? Is it the almost entirely fictional Dakota whose only tie to a real life suspect is someone seen observing the house who allegedly used the name ‘The Watcher’ on a video game? Maybe it’s the entirely odd neighbors with the brother who loves dumbwaiters based on the Longstrom family next door? Still unsolved the story covers the chaos and attention brought to Westview, New Jersey, former home of Charles Addams, creator of the Addams Family comic strips. While the story is based on true events, the series swings wildly into fiction including a murder based on a real murder that  happened in Westview in 1971 even thought it had nothing to do with 657 Boulevard. We separate fact and fiction from the miniseries. What’s your theory for who sent the letters? Let us know in the comments and be sure to like and subscribe for the latest.\n\nChapters:\n0:00 - Intro\n0.26 - Changes Requested\n1:19 - Never Moved In\n2:18 - No History of Letters\n2:47 - Other Letters\n3:36 - Other Other Letter\n3:53 - Lawn Chairs\n4:19 - Blood Cult\n5:08 - Suicide/Murder\n5:42 - Pearl and Jasper Winslow\n6:38 - John List\n7:54 - Preservation Society\n8:33 - Video Game Handle\n9:47 - Lawsuit\n10:28 - Investigation\n11:10 - Adjusted Prices\n11:34 - DNA\n12:08 - Self Sent Letters\n12:38 - Tunnel\n13:16 - Desperate Measure\n13:36 - Tips to Plot\n14:02 - Literary Reference\n14:23 - Lake\n14:33 - The Cut\n\nCheck out Screen Rant’s official TikTok! \nhttps://www.tiktok.com/@screenrant \n\nOur Social Media:\nhttps://twitter.com/screenrant \nhttps://www.facebook.com/ScreenRant  \nhttps://www.linkedin.com/company/screen-rant/ \n\nOur Website:\nhttp://screenrant.com/\n\nWritten by: Ryan Carbrey\nNarrated by: Joey Criscitello YouTube.com/OfficialJoeyC\nEdited by: Joey Criscitello YouTube.com/OfficialJoeyC\n\nFor copyright matters please contact us at: legal@valnetinc.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}