{
  "title": "My Policeman review: an introspective, static drama",
  "link": "https://www.digitaltrends.com/movies/my-policeman-review/",
  "pubDate": "Sat, 05 Nov 2022 14:01:19 +0000",
  "dc:creator": "Alex Welch",
  "category": [
    "Movies & TV",
    "Reviews",
    "Amazon Prime Video",
    "Harry Styles",
    "Movie Reviews",
    "My Policeman",
    "new movies"
  ],
  "guid": "https://www.digitaltrends.com/?p=3220482",
  "description": "My Policeman is an introspective drama that is undercut by Emma Corrin and Harry Styles' disappointing performances. The film is streaming now on Prime Video.",
  "content:encoded": "<p><em><a href=\"https://www.digitaltrends.com/movies/my-policeman-new-trailer/\">My Policeman</a></em> is a stately, often overly repressed adaptation of Bethan Roberts’ 2012 novel of the same name. The film has all the necessary ingredients to be another respectably dignified &#8212; if not particularly spectacular &#8212; ensemble drama from the U.K. However, despite featuring six core cast members, only one of them truly manages to leave much of a lasting impression in <em>My Policeman</em>. As for the film itself, it frequently flattens rather than deepens the emotional complexity of its story.</p>\n<p>The film’s uniquely British, stiff-upper-lip attitude could have, if handled better, only further amplified the regret and desperation that is present in its tale of gay repression and multigenerational heartbreak. Instead, <em>My Policeman</em> consistently fails to dive as fully into the raw emotions of its story as it should, which robs the film’s third act of much of its intended power. While some of the film’s failings can be attributed to Michael Grandage’s relatively straightforward direction, the two disappointing performances at the center of it are also to blame for many of <em>My Policeman</em>’s problems.</p>\n<figure id=\"attachment_3220581\" aria-describedby=\"caption-attachment-3220581\" class=\"wp-caption alignnone\"><img  class=\" size-large wp-image-3220581\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/11/Harry-Styles-and-Emma-Corrin-stand-in-a-crowd-together-in-My-Policeman.jpg?fit=720%2C480&p=1\" alt=\"Harry Styles and Emma Corrin stand in a crowd together in My Policeman.\"   /><figcaption id=\"caption-attachment-3220581\" class=\"wp-caption-text\"><span class=\"credit\">Amazon Studios, 2022</span></figcaption></figure>\n<p><em>My Policeman</em>’s story is told through the perspectives of two of its central three characters. The film’s first act is shown through the lens of Marion, a retired schoolteacher who is played in her older years by Gina McKee. Through her recollections, we see how Marion’s younger self (played by <a href=\"https://www.digitaltrends.com/movies/everything-revealed-at-netflix-tudum-2022-event/\"><em>The Crown</em>&#8216;s Emma Corrin</a>) first met and fell in love with her eventual husband, Tom (Linus Roache), a former policeman who is played in his younger years by Harry Styles. The memories that are shown at the start of the film also suggest that Tom and Marion’s close friendship with a museum curator named Patrick, who is played by both Rupert Everett in his older years and David Dawson as a younger man, was an entirely innocent one.</p>\n<p>However, after McKee’s older Marion takes in Everett’s disabled Patrick, she begins to secretly read some of the journals he’s kept from his youth. When she does so, <em>My Policeman</em> switches to the perspective of Dawson’s younger Patrick and reveals the secret sexual relationship that he engaged in for many years with Styles’ Tom. From that point on, <em>My Policeman</em>’s multiple perspectives and timelines begin to blend together, slowly but surely revealing how Patrick, Tom, and Marion’s friendship was eventually destroyed.</p>\n<p>The clever structure of <em>My Policeman</em>’s script, which was penned by Ron Nyswaner, allows the film’s story to gradually grow more layered and complex throughout the entirety of its 113-minute runtime. The film even mines a surprising amount of tension and intrigue by revealing Marion’s memories of her husband’s relationship with Patrick in the manner and pace that it does. Unfortunately, Nyswaner’s script still arrives at a conclusion that doesn’t feel nearly as messy or emotionally raw as it arguably should.</p>\n<figure id=\"attachment_3220582\" aria-describedby=\"caption-attachment-3220582\" class=\"wp-caption alignnone\"><img  class=\" size-large wp-image-3220582\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/11/Gina-McKee-stands-on-a-beach-next-to-Rupert-Everett-in-My-Policeman.jpg?fit=720%2C480&p=1\" alt=\"Gina McKee stands on a beach next to Rupert Everett in My Policeman.\"   /><figcaption id=\"caption-attachment-3220582\" class=\"wp-caption-text\"><span class=\"credit\">Amazon Studios, 2022</span></figcaption></figure>\n<p>Styles, for his part, turns in a disappointingly one-note performance as Tom, a man who is torn between the stability of his relationship with Marion and the passion of his and Patrick’s secret romance. Styles is very clearly still growing as an actor, but he proves to be incapable of portraying the kind of vulnerability and dimensionality that <em>My Policeman</em>’s story requires of him. The same goes for Emma Corrin, who fares somewhat better than Styles, but still gives a performance as Marion that doesn’t come close to matching the elegance of McKee’s turn as her older counterpart.</p>\n<p>For the most part, <em>My Policeman</em>’s present-day scenes work well precisely because of how much more nuanced and mature McKee and Roache’s performances feel as Marion and Tom. That doesn’t mean, however, that <em>My Policeman</em>’s flashbacks are all difficult to get through. Quite the opposite is true, in fact, thanks to Dawson’s genuinely revelatory performance as Patrick. Dawson has an innate ability to hold your attention whenever he’s on screen, and it’s in the scenes where <em>My Policeman</em> focuses most heavily on him that the film comes the closest to communicating the romantic tragedy of its story.</p>\n<iframe src=\"https://www.youtube.com/embed/xAEgWXOH1mY\" width=\"640\" height=\"360\"></iframe>\n<p>Despite the undeniable quality of Dawson’s breakout performance, though, <em>My Policeman</em>’s overall power fails to match the sum of its parts. As far as mature dramas go, the film is another competently made, occasionally stirring British romance. However, the overly clean nature of <em>My Policeman</em>’s final minutes, as well as Corrin and Styles’ lackluster performances, ultimately prevent the film from standing out much from the crowd. In the end, McKee and Dawson’s moving efforts as Marion and Patrick aren’t enough to turn <em>My Policeman</em> into the kind of provocative, emotionally searing drama that it desperately wants to be.</p>\n<p>My Policeman <em>is playing in select theaters now and is currently available to stream on Amazon Prime Video.</em></p>\n",
  "thumbnail": "https://www.digitaltrends.com/wp-content/uploads/2022/11/Harry-Styles-and-Emma-Corrin-stand-in-a-crowd-together-in-My-Policeman.jpg?p=1",
  "enclosure": "",
  "post-id": 3220482
}