{
  "title": "FB Live 9/2/20- How can I feel ok about not eating when I'm not hungry?",
  "itunes:title": "FB Live 9/2/20- How can I feel ok about not eating when I'm not hungry?",
  "pubDate": "Sat, 05 Sep 2020 07:00:00 +0000",
  "guid": "64a9bd7d-ad53-44c8-8763-abb73aa495b5",
  "link": "http://phit.click/freecourse",
  "itunes:image": "",
  "description": "<div>Each week I go live to answer questions from 1000's of listeners of the podcast. If you're a regular viewer you know I cut through the shit and give it to you straight. This is one of my favorite ways to help you lose weight the way you want to live your life.</div> <div> </div> <div>In this episode, I answer questions like:</div> <div> </div> <div>-On the weekends I start to think that I can eat whatever I want especially when I’m home alone. I get what I want to eat but I do not over eat. During the week I eat with my family and I feel I’m in control and listening to my signals. It is when no one is around no one will know that I’m stuffing my face. How can I stop that?</div> <div>-How much time will No BS take me each day/week?</div> <div>-I’m making food plans but I’m having a hard time sticking to them especially when I’m at work when my co-workers want to go out to eat for lunch. I say \"no\" when they first ask but couple minutes later I’ll cave in and eat with them. What can I do to stick to my plan?</div> <div> </div> <div>Every week I'm here helping you figure out weightloss. Make sure you join me each Wednesday at 8:30am CST at </div> <div>at <a title=\"www.facebook.com/pnpgirl \" href= \"www.facebook.com/pnpgirl\">www.facebook.com/pnpgirl </a></div> <div>See you there!</div> <div> </div> <div>Get the Free Course here:</div> <div><a class=\"QuillHelpers-link textEditor-link\" href= \"http://phit.click/freecourse\" target=\"_blank\" rel=\"noopener\" data-is-link= \"http://phit.click/freecourse\">http://phit.click/freecourse</a></div>",
  "content:encoded": "Each week I go live to answer questions from 1000's of listeners of the podcast. If you're a regular viewer you know I cut through the shit and give it to you straight. This is one of my favorite ways to help you lose weight the way you want to live your life.   In this episode, I answer questions like:   -On the weekends I start to think that I can eat whatever I want especially when I’m home alone. I get what I want to eat but I do not over eat. During the week I eat with my family and I feel I’m in control and listening to my signals. It is when no one is around no one will know that I’m stuffing my face. How can I stop that? -How much time will No BS take me each day/week? -I’m making food plans but I’m having a hard time sticking to them especially when I’m at work when my co-workers want to go out to eat for lunch. I say \"no\" when they first ask but couple minutes later I’ll cave in and eat with them. What can I do to stick to my plan?   Every week I'm here helping you figure out weightloss. Make sure you join me each Wednesday at 8:30am CST at  at <a title=\"www.facebook.com/pnpgirl \" href= \"www.facebook.com/pnpgirl\">www.facebook.com/pnpgirl </a> See you there!   Get the Free Course here: <a class=\"QuillHelpers-link textEditor-link\" href= \"http://phit.click/freecourse\" target=\"_blank\" rel=\"noopener\" data-is-link= \"http://phit.click/freecourse\">http://phit.click/freecourse</a>",
  "enclosure": "",
  "itunes:duration": "56:10",
  "itunes:explicit": true,
  "itunes:keywords": "",
  "itunes:subtitle": "Each week I go live to answer questions from 1000's of listeners of the podcast. If you're a regular viewer you know I cut through the shit and give it to you straight. This is one of my favorite ways to help you lose weight the way you want to live...",
  "itunes:episodeType": "bonus"
}