{
  "title": "IS BEYONCÉ OVERRATED? — BFFs EP. 99 WITH BILLY EICHNER",
  "description": "<p>We start the show with a debatable first headline of Rihanna, and not Taylor Swift, performing at halftime of the Super Bowl. We then get into Bri's online cancellation after saying Beyonce was overrated, fans speculating that Jaden Hossler and Josie Canseco getting together, Nessa unblocking Jaden, whether or not Tayler Holder and Charly Jordan are together and Dave's conversations with both of them, Huddy talking about his song and love advice from Travis Barker, Adam Levine cheating updates, Playboi Carti and A$AP Rocky trying to mosh, and the NYC Ax Man giving an exclusive interview. \n\nWe then get into BFFs Corner with Josh not wanting to hang out with Grace, Nelk Boys getting upset with Bri and her comments last episode, Josh's Tea Talk causing a stir with an unreleased Thomas Petrou diss track and laughing about Dixie's hair, and finish with Josh meeting Patrick Mahomes and his wife and a potential Jackson Mahomes run in. \n\nWe finish off with Billy Eichner who is on to talk about his movie \"Bros\" the first mainstream gay romcom from a major studio. We get into the process of making the movie, the already high critic reception and finish with a game of \"Billy On His Feet\" a game of word association in which he has to say the first thing that comes to mind when seeing a famous person who he has worked with.  \n\nSupport Our Sponsors!\nRaising Canes: Get your Cane’s fix fast by ordering through their app or online at RaisingCanes.com\nHellofresh: Go to https://barstool.link/HelloFreshBFF and use code bff65 for 65% off plus free shipping!\nTakis: Try Takis and face the intensity!</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/bffspod\">barstool.link/bffspod</a></p>",
  "guid": "d0395d22-28e0-4907-a5b0-0b81ab49b3a6",
  "pubDate": "Thu, 29 Sep 2022 00:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/134/Bffs",
  "itunes:explicit": "yes",
  "itunes:duration": "00:48:33",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}