{
  "title": "Critiquing Florida's Public Policy of \"Shared Adversity\"",
  "link": "https://mises.org/node/60616",
  "description": "<p>Long before Ron DeSantis was the antilockdown governor and long before he was the potential 2024 Republican presidential candidate, DeSantis was the water quality governor. He funded 100 percent of appropriations bills that came to his desk his first year and he even got President Donald Trump to pay lip service.</p>\n<p>While getting him to offer a comment here and there does not sound like an incredible achievement, it’s worth noting that past Florida governor Jeb Bush didn’t even get the president talking about it when the president was his own brother. I say this to show that while water quality does not sound like a sexy issue, it is so important in Florida that it built the man we know today as Governor DeSantis.</p>\n<p>One of the phrases we often hear in the world of Florida water management is “shared adversity.” In an <a href=\"https://jacquithurlowlippisch.com/2018/07/12/is-it-time-to-address-south-floridas-greatest-taboo-shared-adversity-slr-irl/\">article</a> from 2008, current South Florida Water Management District governing board member Jacqui Thurlow-Lippisch, explained the tension in the room as the then Sanibel-Captiva Conservation Foundation director stated that “part of the Lake Okeechobee Release Schedule addresses ‘shared adversity’”: “You could hear a pin drop.”</p>\n<p><a href=\"https://www.captivasanibel.com/2010/07/21/the-challenge-of-balancing-everglades-protection-and-sharing-adversity/\">What this word means</a>, as it relates to water management, that we must protect the Everglades. However, in order to do so, many parts of Florida must share the adverse effects of rising water levels in Lake Okeechobee by routing the water through various estuaries. The problem is that the mix of the Okeechobee freshwater with the natural salt water in these locations <a href=\"https://www.tcpalm.com/story/news/local/indian-river-lagoon/2021/05/13/stuart-florida-gov-ron-desantis-state-of-emergency-hab-lake-o-lake-okeechobee-toxic-algae-bloom/5072563001/\">sparks toxic algal blooms</a> that are certainly dangerous to the local ecosystem, destroy the local economies as their tourism plummets, and are outright dangerous to the people in those regions. Thurlow-Lippisch showed exactly why these laws had become so problematic, declaring:</p>\n<blockquote><p>Just like other laws of our great county, some do, indeed over time, become outdated for the times. Things change. Among other issues, in 1950, when the Central and South Flood Project law was structured and voted upon to protect the crops in the EAA (Everglades Agricultural Area) as part of flood control 2.81 million people lived in Florida. Today, 20 million people reside here.</p></blockquote>\n<p>As more and more people reside where adversity is shared, it becomes more and more dangerous to thrust this water through the estuaries and into the hearts of people’s lives. This battle has waged on in Florida for far longer than I have been alive; however, almost all of the arguments are inherently consequentialist. Here, we can offer a rights-based argument that has been left far from the foreground.</p>\n<p>Most readers of the <em>Mises Wire</em> are well aware of Lockean homesteading—mixing one’s self-ownership with natural resources to acquire just ownership of a good. However, some may not be as familiar with Walter Block’s <em>negative homesteading</em>. Block explains:</p>\n<blockquote><p>I call this the theory of negative homesteading. In ordinary homesteading, or what we must now call positive homesteading to distinguish it from this newly introduced variety, it is the first person upon the scene who mixes his labor with the land or natural resource who comes away with the property rights in question. It is the first man who farms a plot of land, who becomes the rightful owner.</p>\n<p>A similar procedure applies to negative homesteading, only here what gets to be “owned” is a negative, not a positive. This concept refers to some form of unhappiness, not a benefit such as owning land. The ownership of misery, as it were, must stay with its first victim, according to this principle. <em>He cannot legitimately pass it onto anyone else without the latter’s permission</em>. (italics my own)</p></blockquote>\n<p>The application to Florida water management is clear with that last line. Shared adversity means to pass that misery on to someone else. The most convincing argument is that perhaps the cities did not vote or approve an agreement to abide by the decisions of these plans, which means they were not passing it on without permission. However, the barber that counts on tourists in season did not agree to this. The dive instructor who had to give up what could’ve been very profitable dives because of an outbreak certainly did not agree to this. The seafood restaurant that counts on local fishermen never signed anything agreeing to this.</p>\n<p>This is not to say that any given county should simply give up on the Everglades or on other counties. It is, however, to say that from a rights-based approach, any given county has absolutely every right to stand up and say no, you cannot legitimately pass your negatively homesteaded misery on to me. Any given county can stand up and say we absolutely need a solution to this problem, but you have no right to force <em>this</em> solution.</p>\n\n",
  "author": "Connor Mortell",
  "enclosure": "",
  "guid": 60616,
  "pubDate": "Fri, 28 Oct 2022 14:00:00 -0500",
  "source": "Mises Wire"
}