{
  "id": "yt:video:9D72usi69d8",
  "yt:videoId": "9D72usi69d8",
  "yt:channelId": "UCBH5VZE_Y4F3CMcPIzPEB5A",
  "title": "What Will China Do?",
  "link": "",
  "author": {
    "name": "Real Vision Finance",
    "uri": "https://www.youtube.com/channel/UCBH5VZE_Y4F3CMcPIzPEB5A"
  },
  "published": "2022-11-01T20:37:04+00:00",
  "updated": "2022-11-02T16:02:00+00:00",
  "media:group": {
    "media:title": "What Will China Do?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Chinese stocks and the yuan rallied on unconfirmed reports authorities have formed a committee to reconsider China’s “COVID zero” restrictions on economic activity. There was no follow-through in the U.S., though, as investors remain focused on Wednesday and the Federal Open Market Committee’s monetary policy decision. Tony Greer, the founder of TG Macro and the editor of the Morning Navigator, joins Andreas Steno Larsen for today’s Daily Briefing to talk about what impact a reopening of the Chinese economy China will have on global commodity markets and how to position for potential upside. We also hear from Jesse Felder, author of The Felder Report, about how changing investment patterns will impact the technology and energy sectors. Watch the full interview between Jesse Felder and Maggie Lake here: https://www.realvision.com/shows/make-or-break-inflation/videos/there-wont-be-a-crash-but-drpj?tab=details. And we want to hear from you too – please share your questions, comments, and suggestions!\n\nEditor’s Note: Our live chat feature will be unavailable for four to six weeks as we upgrade our video player technology. We apologize for the temporary loss of function. But we assure you the upgrade will more than justify the wait. In the meantime, we will be monitoring the comments section. So, in addition to conversing with your fellow community members, please share your questions there.\n\n\n\nThanks for watching The Daily Briefing. Sign up here with your email address to have every episode delivered to your inbox Monday-Friday: http://rvtv.io/DailyBriefEmail\n\nAbout Real Vision™:\nReal Vision™ is where you can gain an understanding of the complex world of finance, business and the global economy with real in-depth analysis from real experts. \n\nConnect with Real Vision™ Online:\nTwitter: https://rvtv.io/twitter\nInstagram: https://rvtv.io/instagram\nFacebook: https://rvtv.io/facebook\nLinkedin: https://rvtv.io/linkedin \n\nWhat Will China Do?\n\nDisclaimer:\nThis is pretty obvious, but we should probably say it anyway so that there is absolutely no confusion…The material in REAL VISION GROUP video programs and publications {collectively referred to as “RV RELEASES”} is provided for informational purposes only and is NOT investment advice. The information in RV RELEASES has been obtained from sources believed to be reliable, but Real Vision and its contributors, distributors and/or publisher, licensors, and their respective employees, contractors , agents, suppliers and vendors { collectively, “Affiliated Parties”} make no representation or warranty as to the accuracy, timeliness or completeness of the content in RV RELEASES. Any data included in RV RELEASES are illustrative only and not for investment purposes. Any opinion or recommendation expressed in RV RELEASES is subject to change without notice. RV Releases do not recommend, explicitly nor implicitly, nor suggest or recommend any investment strategy. Real Vision Group and its Affiliated Parties disclaim all liability for any loss that may arise (whether direct indirect, consequential, incidental, punitive or otherwise) from any use of the information in RV RELEASES. Real Vision Group and its Affiliated Parties do not have regard to any individual’s, group of individuals’ or entity’s specific investment objectives, financial situation or circumstance. RV RELEASES do not express any opinion on the future value of any security, currency or other investment instrument. You should seek expert financial and other advice regarding the appropriateness of the material discussed or recommended in RV RELEASES and should note that investment values may fall, you may receive less back than originally invested and past performances is not necessarily reflective of future performances. Well that was pretty intense! We hope you got all of that – now stop reading the small print and go and enjoy Real Vision.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}