{
  "title": "NASA&#8217;s Psyche mission goes ahead but VERITAS mission is delayed",
  "link": "https://www.digitaltrends.com/space/psyche-report-veritas-delay/",
  "pubDate": "Sat, 05 Nov 2022 16:52:33 +0000",
  "dc:creator": "Georgina Torbet",
  "category": [
    "News",
    "Space",
    "NASA",
    "psyche",
    "space",
    "veritas"
  ],
  "guid": "https://www.digitaltrends.com/?p=3221289",
  "description": "NASA's Psyche mission to the metal asteroid Psyche is on, but it'll mean pushing back the VERITAS mission to Venus.",
  "content:encoded": "<p>NASA recently announced that its mission to visit a metal asteroid, Psyche, has a <a href=\"https://www.digitaltrends.com/space/psyche-new-launch-date/\">new launch date</a> of October 2023. The mission had originally been scheduled for August 2022 but missed its launch date due to not having enough time for testing all the equipment and software. To make sure the mission launches as planned this time, staff will be moved off the planned VERITAS mission to Venus, which will now be delayed by three years.</p>\n<p>Following the Psyche spacecraft missing its launch date, NASA and its Jet Propulsion Laboratory commissioned an independent review into the issues which delayed the launch and <a href=\"https://www.jpl.nasa.gov/news/as-psyche-mission-moves-forward-nasa-responds-to-independent-review?utm_source=iContact&utm_medium=email&utm_campaign=nasajpl&utm_content=media-psyche20221104\" target=\"_blank\" rel=\"nofollow noopener\">has now announced</a> how it will address the issues raised in the review report.</p>\n<p>“We welcome this opportunity to hear the independent review board’s findings and have a chance to address the concerns,” said Thomas Zurbuchen, associate administrator of NASA’s Science Mission Directorate, in a statement. “It’s our job to notice issues early – this report is essentially a canary in the coal mine – and address them. Information like this helps us for more than just Psyche, but also for upcoming key missions such as Europa Clipper and Mars Sample Return.”</p>\n<p>The report from the review board highlighted several issues which contributed to Psyche missing its launch date, including not enough staff on the project, communication issues, and the increase in remote work which meant informal chats between staff members had become less common. NASA has responded by adding more staff to the project and says the Psyche project manager will be setting a hybrid work policy.</p>\n<p>However, these new staff will have to be pulled off other projects to work on the Psyche mission. That&#8217;s why the planned VERITAS mission to Venus, which is still early in its development, is being delayed. The Venus Emissivity, Radio Science, InSAR, Topography, and Spectroscopy mission, <a href=\"https://www.digitaltrends.com/space/nasa-announces-first-venus-missions-in-more-than-30-years/\">announced last June</a>, aims to map the surface of Venus and to learn more about the planet&#8217;s atmosphere and its volcanic activity, which may be ongoing. This is important to understand <a href=\"https://www.digitaltrends.com/space/nasa-veritas-mission-venus/\">how Earth and Venus diverged</a>, as they were thought to once be very similar.</p>\n<p>The VERITAS mission had been planned for launch in 2027, but will now be pushed back until 2031. NASA&#8217;s other upcoming Venus mission, DAVINCI, which plans to <a href=\"https://www.digitaltrends.com/space/nasa-venus-davinci-probe/\">drop a descent probe</a> through the Venusian atmosphere, is still planned to launch in 2029.</p>\n",
  "thumbnail": "https://www.digitaltrends.com/wp-content/uploads/2021/12/jpegpia24473-width-16001.jpg?p=1",
  "enclosure": "",
  "post-id": 3221289
}