{
  "title": "575: Why is Professor Binns Still Teaching? And More Indefensible Harry Potter Characters",
  "link": "https://audioboom.com/posts/8143784",
  "itunes:episode": 575,
  "itunes:title": "Why is Professor Binns Still Teaching? And More Indefensible Harry Potter Characters",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4234,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode, we’ll be continuing our conversation that began in <a href=\"https://mugglecast.com/episode-568-indefensible-characters-in-harry-potter-and-how-to-understand-them/\">Episode 568</a>, where we argued in defense of some of the most controversial, least favorite, most complicated characters in Harry Potter. There were plenty of characters we didn’t get to last time, so it’s time for Round 2!<br>\n<br>\n\n</div>\n<ul>\n<li>Welcome back, Pat!</li>\n<li>Happy Birthday, Micah! We share the <a href=\"https://www.instagram.com/p/ChXVnswM8Kq/\">very special video</a> he received from Dan Fogler and react to it.</li>\n<li>Hogwarts Legacy has been pushed to February 2023! What do we make of the announcement and this very cool <a href=\"https://www.youtube.com/watch?v=fQGUaN_qkGw\">A Hot Summer Day ASMR Video</a>?</li>\n<li>Main Discussion: Indefensible Characters in Harry Potter, Round 2</li>\n<li>What did Lucius Malfoy, Mundungus Fletcher, Horace Slughorn and Merope Gaunt do to put themselves in our cross-hairs?</li>\n<li>What characters do we love to hate? Professor Binns, Vernon Dursley and Cornelius Fudge make the cut!</li>\n<li>Can the hosts actually defend the indefensible? We try our best with Narcissa Malfoy and Barty Crouch Jr.</li>\n<li>New game alert: One Gotta Go</li>\n<li>Quizzitch: What did the Muggle, Mr. Roberts, say to the Weasley family as they left the Quidditch World Cup?</li>\n<li>Next week's episode: The Physics of the Wizarding World</li>\n<li>This week's episode is brought to you by: Audible's <a href=\"https://www.audible.com/genesis\">Genesis</a>, BetterHelp (get 10% off your first month at <a href=\"http://www.betterhelp.com/mugglecast\">BetterHelp.com/MuggleCast</a>) and Indeed (start hiring now with a $75 sponsored job credit to upgrade your job post at <a href=\"http://www.indeed.com/mugglecast\">Indeed.com/MuggleCast</a>)</li>\n</ul>\n",
  "pubDate": "Tue, 23 Aug 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-08-22:/posts/8143784",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}