{
  "title": "Top Marks for Student Kaggler in Bengali.AI | A Winner’s Interview with Linsho Kaku",
  "link": "https://medium.com/kaggle-blog/top-marks-for-student-kaggler-in-bengali-ai-a-winners-interview-with-linsho-kaku-dd321b324c74?source=rss----4b0982ce16a3---4",
  "guid": "https://medium.com/p/dd321b324c74",
  "category": [
    "data-science",
    "kaggle",
    "machine-learning",
    "bengali",
    "kaggle-competition"
  ],
  "dc:creator": "Kaggle Team",
  "pubDate": "Tue, 21 Apr 2020 16:31:32 GMT",
  "atom:updated": "2020-04-21T17:17:02.905Z",
  "content:encoded": "<p>Kaggler, deoxy takes first-place and sets the stage for his next competition.</p><p><em>Please join us in congratulating Linsho Kaku (aka </em><a href=\"https://www.kaggle.com/linshokaku?utm_medium=blog&utm_source=medium&utm_campaign=bengaliai-1stplace-blog\"><em>deoxy</em></a><em>) on his solo first-place win in our </em><a href=\"https://www.kaggle.com/c/bengaliai-cv19/?utm_medium=blog&utm_source=medium&utm_campaign=bengaliai-1stplace-blog\"><em>Bengali.AI Handwritten Grapheme Classification challenge</em></a><em>! Read the winning solution here: </em><a href=\"https://www.kaggle.com/c/bengaliai-cv19/discussion/135984?utm_medium=blog&utm_source=medium&utm_campaign=bengaliai-1stplace-blog\"><em>1st Place Solution with Code</em></a></p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/500/1*lfCUDu-MqAiJNvmP4rIU3g.jpeg\" /><figcaption>Random Ink by Sankarshan Mukhopadhyay @Flickr</figcaption></figure><h3>Let’s meet Linsho!</h3><h4>Linsho, what would you like to share about yourself?</h4><p><strong>Linsho: </strong>I am a student in the Rio <a href=\"https://www.rio.gsic.titech.ac.jp/en/index.html\">Yokota Laboratory at the Tokyo Institute of Technology</a>. The main theme of the lab is high performance computing with advanced architectures including GPUs. We also deal with deep learning as one of its applications. I’m also an intern at Future Inc. working on an OCR task.</p><h4>Did you have any prior experience or domain knowledge that helped you succeed in this competition?</h4><p>The experience of working on OCR tasks as an intern was a big advantage for me. The ease in which I was able to pre-process data and create models was thanks to my intern experience. I’ve never specialized in Few-Shot Learning, which has been a major factor in the scores of the top teams this time around. However, I think my knowledge of the paper, which was shared in the lab, made a big difference.</p><h3>Let’s get a bit more technical</h3><h4>Did any past research or previous competitions inform your approach?</h4><p>In thinking about the approach, I went through the Kaggle discussions that were presented <a href=\"https://www.kaggle.com/c/bengaliai-cv19/discussion/123198?rvi=1#717786\">here</a> and <a href=\"https://www.kaggle.com/c/bengaliai-cv19/discussion/123198?rvi=1#717786\">here</a>.</p><p>In addition, I often consulted <a href=\"https://www.sciencedirect.com/science/article/pii/S0167865519302181\">Science Direct</a> and other resources to achieve Few-Shot Learning.</p><h4>Did you do any preprocessing?</h4><p>No pre-processing, such as cropping or noise reduction, was done to the images. These processes did not improve recognition accuracy, but rather tended to reduce the amount of information needed. The disadvantages of cropping a smaller area than the required character area and erasing extra characters far outweigh the advantages of giving clean input.</p><h4>What was your most important insight into the data?</h4><p>The most essential task needed was not the classification of the three types of components per se, but the creation of a model that could recognize classes that were not given. The classification into three types of components was only a hint to solve this essential task. This is not to say the division into manually determined components is appropriate. Abstracting the structures that can appear in a character is more likely to improve the accuracy of classification of unknown classes.</p><p>This time, I used a method to generate font image characters from handwritten characters. This generation model is based on a style and style transformation model called CycleGAN. A series of models up to the font image classification model connected to this generative model can be considered as a handwritten character classification model. In such a view, the Font image generated by the generative model can be considered as a feature of the middle layer of this series of handwriting classification models.</p><p>It’s highly likely that each pixel of the font image, which is an intermediate feature, has generated the structure of the font image by observing a relatively narrow portion of the handwriting. This can be thought of as generating features of a more abstract character structure. I think being able to build this system was the biggest factor in my approach.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*fcDymrGQOhoz5UOW0eZ1bw.png\" /></figure><h4>Which tools did you use?</h4><p>I used Pytorch as a deep learning framework and Jupyter Notebook as an IDE.</p><h4>What about your hardware setup?</h4><p>I use some servers, which has 4 Tesla V100.</p><h4>What was the run time of your winning solution?</h4><p>CycleGAN takes the following time:</p><p>Training time: 4 Tesla V100 2.5 days</p><p>Prediction time : 40 min x 2(ensemble 2 model)</p><p>Apart from this, it took some time to work on the usual class classification models and so on.</p><h3>Words of wisdom</h3><h4>OK, are you walking away with anything new as a result of this competition?</h4><p>I gained new skills that will allow for a consistent approach to future challenges.</p><h4>Any advice for those just getting started in data science?</h4><p>Grandmaster’s common sense (or what seems most obvious) is not always the best to win.</p><h3>Just for fun</h3><h4>If you could run a Kaggle competition, what problem would you want to pose to other Kagglers?</h4><p>I’d like to propose a more practical OCR, that is, a task that is evaluated end-to-end from handwriting detection to recognition. (For example, something that aims at transcription and digitization of handwritten notes). I feel a general-purpose method of detection has not yet been established in spite of sufficient recognition accuracy. However, in the field of Object Detection, there are quite a variety of methods being considered, and I think there’s a lot of hope for active discussion and development.</p><blockquote>Linsho Kaku is a Master Student at Tokyo Institute of Technology, supervised by Rio Yokota. His research interests include deep learning, image processing and optical character recognition.</blockquote><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=dd321b324c74\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/kaggle-blog/top-marks-for-student-kaggler-in-bengali-ai-a-winners-interview-with-linsho-kaku-dd321b324c74\">Top Marks for Student Kaggler in Bengali.AI | A Winner’s Interview with Linsho Kaku</a> was originally published in <a href=\"https://medium.com/kaggle-blog\">Kaggle Blog</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
}