{
  "title": "TU67: A Practical Technique to Calm and Confidence with Guest Richard Hill",
  "link": "https://therapistuncensored.com/episodes/tu67-a-practical-technique-to-calm-and-confidence-with-guest-richard-hill/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu67-a-practical-technique-to-calm-and-confidence-with-guest-richard-hill",
  "pubDate": "Mon, 25 Jun 2018 13:30:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=6107",
  "description": "A Practical Technique to Calm and Confidence with Guest Richard Hill\nCalm the chaos of your mind by trying out these ideas and this technique with yourself or if you are a clinician, your patients.\n\nThe Mirroring Hand technique teaches you to use your natural problem solving to manage stress and anxiety and cultivate calm. In this episode we dive into practical techniques for building your own growing edge and using your natural felt-sense of security. Discover how to tap into your inner wisdom and calm by using curiosity about your own body to cultivate focus and healing.\n\nJoin psychotherapist and author Richard Hill in an over-the-pond discussion with co-host Dr. Ann Kelley about the essentials behind his “mirroring hands” technique to treat dysregulation and self-defeating patterns.\n\nGuest Richard Hill is a practicing psychotherapist, author, and educator. He is President of the Global Association of Interpersonal Neurobiology Study’s (GAINS), director of the Mindscience Institute, and managing editor of The Neuropsychotherapist. He has published several books (see show notes for titles and links), as well as numerous articles, journal papers and book chapters.\n\nIf you are interested in more on treatment and the body check out our Mindfulness section and most recently, check out our interview with Dr. Pat Ogden, of the Sensorimotor Institute: Episode 65\n\n0:00-15:00 Introduction\n\nUnderstanding security as a natural sense of well being. How does a person/patient actually know if they’re okay or not? It’s not controlled by our cognitive understanding but is a natural, felt sense – working with traumas, understanding the functionality of a system even if there are unhealthy tendencies How to bring healing and hope into internal systems, “The healing state”: disruptive consciousness vs. integrating state\n\nThree fundamental elements of natural problem solving and healing:\n\n1) Focus attention\n\n2) Move into a state of curiosity\n\n3) Nascent possibility — Mirroring hands technique demonstration\n\n15:00-30:00 Mirroring hands continued – Problem of the therapeutic process getting in the way of clients working, the healing has to occur within physically feeling “the need”\n\n30:00-45:00 Hill’s anecdotes about patient experiences with mirroring hands The key is helping someone find a focus and become curious\n\nThe three frames of curiosity\n\nThe idea of mindfulness and the “sunset”\n\n \n\nRESOURCES:\n\nRichard Hill Contact:  www.richardhillau.com\n\nThe Practitioner’s Guide to Mirroring Hands: A Client-Responsive Therapy that Facilitates Natural Problem-Solving and Mind-Body Healing by Richard Hill and Ernest Rossi.\n\nHill is also President of the Global Association of Interpersonal Neurobiology Studies (GAINS), director of the Mindscience Institute and, Managing Editor of The Neuropsychotherapist.\n\nHis other books include, Choose Hope, Discover the Magic Within and How the ‘Real World’ Is Driving Us Crazy! as well as numerous articles, journal papers and book chapters.\n\nAffect Regulation and the Repair of the Self (Norton Series on Interpersonal Neurobiology) Alan Schore, one of the fathers of interpersonal neurobiology.\nWant to support this work and stay in touch?\nJoin our email list, subscribe to Tunes here or join our Facebook page here to get updated popular articles on these subjects of interest. Biggest help of all is to leave us a review, they are so useful as we go forward fine-tuning what is most helpful for our audience and it literally inspires us to keep going in this hobby of love!\n\nBe sure you’ve checked out our free video, Modern Adult Attachment 101 to learn more and to easily share the basics of this science and what to do with it with others!  \n\nTweet",
  "enclosure": "",
  "itunes:subtitle": "A Practical Technique to Calm and Confidence with Guest Richard Hill Calm the chaos of your mind by trying out these ideas and this technique with yourself or if you are a clinician, your patients. - The Mirroring Hand technique teaches you to use yo...",
  "itunes:summary": "As we continue our discussion of the relational sciences in everyday life, this episodes examines practical treatment ideas from a practitioner&apos;s playbook. Mirroring Hands is outlined and demonstrated in this episode.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "45:35"
}